[{"url": "http://pe.usps.com/text/imm/immc2_011.htm", "passage_text": "1 PS Form 2976-E is approximately 10-1/4 inches wide and 7-1/4 inches high. 2  The maximum size dimensions for Priority Mail International parcels vary by country and are noted in the Individual Country Listings. Priority Mail International service is considered a parcel stream for mail exchange purposes, with the exception of Flat Rate Envelopes and the Small Flat Rate Priced Boxes."}, {"url": "http://pages.ebay.com/help/pay/shipping-services.html", "passage_text": "Priority Mail International offers 6-10 day service to most international destinations. Priority Mail International is a USPS trademark. Note: The cost of postage will appear on all international shipping labels. The maximum weight for flat rate envelopes and small boxes is 4 pounds. First-Class Mail International is a USPS trademark. Note: The cost of postage will appear on all international shipping labels. Maximum weight for letters is 3.5 ounces. Maximum weight for large envelop"}, {"url": "http://www.stamps.com/usps/first-class-mail-classification-tool/", "passage_text": "Minimum size: 3 1/2 inches tall x 5 inches long and 0.007 inches thick. Maximum size: 6 1/8 inches tall x 11 1/2 inches long and 1/4 inches thick. Maximum weight: 3.5 oz. Aspect ratio: Length divided by height: Ratio must be between 1.3 and 2.5 or the letter will be subject to a non-machinable surcharge. See step 3 for details"}, {"url": "http://pe.usps.com/text/imm/immc2_011.htm", "passage_text": "The maximum weight limit for Priority Mail International service is 70 pounds, but lower country-specific weight limits might apply. To determine the maximum weight limit for each country, see the Individual Country Listings. Priority Mail International service is considered a parcel stream for mail exchange purposes, with the exception of Flat Rate Envelopes and the Small Flat Rate Priced Boxes."}, {"url": "http://pages.ebay.com/help/pay/shipping-services.html", "passage_text": "First-Class Priority International delivery times vary by destination. First-Class Priority International is a USPS trademark. Note: The cost of postage will appear on all international shipping labels. Size requirement for packages is up to 24 inches long, and up to 36 inches in combined length, height, and depth. First-Class Mail International is a USPS trademark. Note: The cost of postage will appear on all international shipping labels. Maximum weight for letters is 3.5 ounces. Maximum weight for large envelopes is 4 pounds."}, {"url": "http://pe.usps.gov/text/imm/immc2_006.htm", "passage_text": "221.51 Weight Limits. The maximum weight limit for Priority Mail Express International service is 70 pounds, but lower country-specific weight limits might apply. To determine the maximum weight limit for each country, see the Individual Country Listings. 221.52 Dimensions — Priority Mail Express International Parcels. Maximum size dimensions for Priority Mail Express International service vary by country and are noted in the Individual Country Listings. See Exhibit 231.23 for determining length or length and girth combined for rectangular and nonrectangular parcel"}, {"url": "http://pages.ebay.com/help/pay/shipping-services.html", "passage_text": "First-Class Mail is a USPS trademark. The minimum size for First-Class Mail is 5 inches long, 3-1/2 inches high and 0.007 inches thick. The maximum size is 11-1/2 inches long, 6-1/8 inches high, and .75 inches thick. The maximum weight for letters is 3.5 ounces. First-Class Mail International is a USPS trademark. Note: The cost of postage will appear on all international shipping labels. Maximum weight for letters is 3.5 ounces. Maximum weight for large envelopes is 4 pounds."}, {"url": "http://about.usps.com/publications/pub100/pub100_024.htm", "passage_text": "To offset this, weight and size limits for parcels moving between larger Post Offices gradually were increased starting on July 1, 1967, so that by July 1, 1969, the weight limit for all such parcels had been increased to 40 pounds, and by July 1, 1971, the size limit had been increased to 84 inches. On February 27, 1983, a uniform weight and size limit was set at 70 pounds, 108 inches, for parcels mailed from any Post Office to any destination within the United States."}]