[{"url": "https://www.navy.com/faq.html", "passage_text": "For most Enlisted programs, you must be at least 18 years of age (or 17 with your parents’ permission) and no older than 34 years of age. For most Officer programs, you must be 19 years of age and no older than 35 years of age (keep in mind that waivers may be granted for positions in high demand)."}, {"url": "http://www.cic.gc.ca/english/information/applications/guides/5487ETOC.asp", "passage_text": "The application must be signed and dated before it is submitted. If you are: 1  18 years of age or older, sign and date in the boxes provided at the bottom of the page, 2  less than 18 years of age, your form must be signed by one of your parents or legal guardian."}, {"url": "https://www.divorce.com.au/faq/", "passage_text": "If you have been married less than 2 years and want to apply for a divorce you must: 1  before filing the Application attend mediation with a court approved family and child mediator to discuss the possibility of reconciliation and then file a certificate completed by the counsellor with your Application."}, {"url": "http://www.eliteukforces.info/special-boat-service/selection/", "passage_text": "To be eligible for selection, a candidate must be male, and must have have served in the military for at least 18 months and have 3 years left to serve. Candidates are shown what to expect as a special forces soldier with a series of lectures and tests."}, {"url": "http://www.supremecourtbc.ca/sites/default/files/web/Applications-in-Supreme-Court.pdf", "passage_text": "8. If your application will take longer than 2 hours, you must also submit written submissions, which include a summary of your argument, and an explanation of how the case law and legislation supports your position.9. You must complete the data collection information in the appendix to the form."}, {"url": "http://www.texascjc.org/sites/default/files/jc_files/TCRP,_JFVC_Determining_Your_Parole_Eligibility_(June_2012).pdf", "passage_text": "2 approximately 1/8 of your sentence before your first parole review. For example, if you have a 20-year sentence (240 months), lose no good time, and you are earning the maximum good time – 30 days for every 30 days you serve – you will be eligible for parole in 30 months (two and one-half years)."}, {"url": "http://www.cic.gc.ca/english/information/applications/guides/5487ETOC.asp", "passage_text": "Note: This barcode page will not appear if you fill out your application by hand. Return to footnote 1 referrer. If you are 18 years of age or older, sign and date in the boxes provided at the bottom of the page. If you are less than 18 years of age, your form must be signed by one of your parents or a legal guardian."}, {"url": "http://www.texascjc.org/sites/default/files/jc_files/TCRP,_JFVC_Determining_Your_Parole_Eligibility_(June_2012).pdf", "passage_text": "In other words, if you are doing a 20-year sentence, (240 months) you will serve five years before becoming eligible for parole if you are not earning good time. So, on the same 20-year sentence, you can serve anywhere between two-and-a-half to five years before becoming eligible, all because of your"}, {"url": "http://www.cic.gc.ca/english/information/applications/guides/5487ETOC.asp", "passage_text": "1 If you are not a citizen of the country in which you are applying, you must provide proof of your present immigration status in the country of application. 2  If the government that issued your passport or travel document requires a re-entry permit this must be obtained before you apply for a work permit."}]