[{"url": "http://www.fool.com/investing/general/2014/01/25/the-hunger-games-mockingjay-is-two-movies-too-much.aspx", "passage_text": "The third chapter of The Hunger Games film franchise, Mockingjay, will be released on Nov. 14. The film, which will be split into two parts, is currently in production in Atlanta, but Lionsgate Entertainment (NYSE:LGF) has already started whetting fan appetites by releasing a teaser poster online."}, {"url": "http://www.fool.com/investing/general/2014/01/25/the-hunger-games-mockingjay-is-two-movies-too-much.aspx", "passage_text": "(Source: Lionsgate) The Hunger Games is the latest popular book to be split into two parts -- a practice that prominently started with Time Warner (NYSE:TWX)/Warner Bros.' release of Harry Potter and the Deathly Hallows Part 1 in 2010."}, {"url": "http://www.philly.com/philly/blogs/entertainment/movies/Hunger-Games-Mockingjay-Part-2-will-use-a-CGI-Philip-Seymour-Hoffman-to-complete-filming.html", "passage_text": "Philip Seymour Hoffman’s death earlier this week left a number of projects hanging in development limbo—not the least of which is Hunger Games: Mockingjay Part 2. Producers for that film, however, have found a workaround to the tragedy: digitally recreate Hoffman for his unfilmed scenes."}, {"url": "http://thehungergames.wikia.com/wiki/The_Hunger_Games:_Mockingjay_-_Part_1", "passage_text": "The film adaptations of Mockingjay have been announced: Part 1 will be released November 21, 2014, and Part 2 will be released November 20, 2015. This follows what the actors in The Hunger Games have been saying about signing on for four films. Based upon Lionsgate's renaming of the film for Catching Fire, it is known that the last films will be called The Hunger Games: Mockingjay Part 1 and The Hunger Games: Mockingjay Part 2."}, {"url": "http://www.fool.com/investing/general/2014/01/25/the-hunger-games-mockingjay-is-two-movies-too-much.aspx", "passage_text": "Lionsgate just released the teaser poster for Mockingjay. (Source: Lionsgate). The Hunger Games is the latest popular book to be split into two parts -- a practice that prominently started with Time Warner (NYSE:TWX) /Warner Bros.' release of Harry Potter and the Deathly Hallows Part 1 in 2010."}, {"url": "http://mockingjayfilm.org/", "passage_text": "Lionsgate has announced that the Mockingjay movie will be split into two parts. Mockingjay: Part 1 will be released on November 21st, 2014, and Mockingjay: Part 2 will be released on November 20th, 2015. In doing so, the Hunger Games trilogy has chosen to adopt the strategy of splitting the last movie into more than one part, as the Harry Potter and Twilight movies have successfully done."}, {"url": "http://thehungergames.wikia.com/wiki/The_Hunger_Games:_Mockingjay_-_Part_1", "passage_text": "The Hunger Games: Mockingjay: Part 1 is the film adaptation of the first half of Mockingjay by Suzanne Collins and the sequel to Catching Fire film. It was released at November 20th at the UK and November 21st at the US. It is set to be released at February 8th in China."}]