[{"url": "https://en.wikipedia.org/wiki/List_of_tectonic_plate_interactions", "passage_text": "Tectonic plate interactions are of three different basic types: 1  Divergent boundaries are areas where plates move away from each other, forming either mid-oceanic ridges or rift valleys. 2  These are also known as constructive boundaries. 3  Convergent boundaries are areas where plates move toward each other and collide. 1 Convergent boundaries are areas where plates move toward each other and collide. 2  These are also known as compressional or destructive boundaries. 3  Subduction zones occur where an oceanic plate meets a continental plate and is pushed underneath it."}, {"url": "http://www.ducksters.com/science/earth_science/plate_tectonics.php", "passage_text": "The Lithosphere. The part of the land that is moving is the Earth's surface called the lithosphere. The lithosphere is made up of the Earth's crust and a part of the upper mantle. The lithosphere moves in big chunks of land called tectonic plates. Some of these plates are huge and cover entire continents."}, {"url": "http://www.learner.org/interactives/dynamicearth/plate.html", "passage_text": "The earth's continents are constantly moving due to the motions of the tectonic plates. Closely examine the map below, which shows the 15 major tectonic plates. As you can see, some of the plates contain continents and others are mostly under the ocean. The border between two tectonic plates is called a boundary. All the tectonic plates are constantly moving — very slowly — around the planet, but in many different directions. Some are moving toward each other, some are moving apart, and some are sliding past each other."}, {"url": "http://www.bbc.co.uk/schools/gcsebitesize/geography/natural_hazards/tectonic_plates_rev2.shtml", "passage_text": "Where convection currents converge, plates move towards each other. The movement of the plates, and the activity inside the Earth, is called plate tectonics. Plate tectonics cause earthquakes and volcanoes. The point where two plates meet is called a plate boundary. Earthquakes and volcanoes are most likely to occur either on or near plate boundaries. The map shows the world's tectonic plates and the distribution of earthquakes and volcanoes. Your web browser does not have JavaScript switched on at the moment."}, {"url": "http://divediscover.whoi.edu/tectonics/boundaries.html", "passage_text": "Back to intruction ». Plate Boundaries. The surface of the Earth is broken into rigid plates. These plates are 100 to 120 kilometers thick and include the crust and a small part of the upper mantle. Many plates contain both continental and oceanic crust. Scientists often refer to this crust/upper mantle layer as the lithosphere. "}, {"url": "http://science.nationalgeographic.com/science/earth/the-dynamic-earth/plate-tectonics-article/", "passage_text": "The movement of the plates creates three types of tectonic boundaries: convergent, where plates move into one another; divergent, where plates move apart; and transform, where plates move sideways in relation to each other. Convergent Boundaries. "}, {"url": "http://www.cotf.edu/ete/modules/msese/earthsysFlr/plates1.html", "passage_text": "The theory states that Earth's outermost layer, the lithosphere, is broken into 7 large, rigid pieces called plates: the African, North American, South American, Eurasian, Australian, Antarctic, and Pacific plates. Several minor plates also exist, including the Arabian, Nazca, and Philippines plates. "}, {"url": "https://en.wikipedia.org/wiki/List_of_tectonic_plates", "passage_text": "This is a list of tectonic plates on Earth. Tectonic plates are pieces of Earth's crust and uppermost mantle, together referred to as the lithosphere."}, {"url": "http://www.ducksters.com/science/earth_science/plate_tectonics.php", "passage_text": "1 Convergent Boundaries-A convergent boundary is where two tectonic plates push together. 2  Sometimes one plate will move under the other. 3  This is called subduction. 4  Although the movement is slow, convergent boundaries can be areas of geological activity such as the forming of mountains and volcanoes. The part of the land that is moving is the Earth's surface called the lithosphere. The lithosphere is made up of the Earth's crust and a part of the upper mantle. The lithosphere moves in big chunks of land called tectonic plates. Some of these plates are huge and cover entire continents."}, {"url": "http://study.com/academy/lesson/plate-boundaries-convergent-divergent-and-transform-boundaries.html", "passage_text": "In the theory of plate tectonics, the earth's crust is broken into plates that move around relative to each other. As a result of this movement, three types of plate boundaries are formed: divergent, convergent, and transform boundaries. "}]