[{"url": "http://www.penguinslab.com/tesla.htm", "passage_text": "In order to discharge the capacitor's energy into the primary coil to initiate power transfer, we need some form of an interruptor or switch. The difference in interruptor design separates the many different types of tesla coils. A 'beer bottle' capacitor bank used in my Tesla coil. The capacitor in the tesla coil is used for storing the energy, while the inductor (or primary coil) is used to provide mutual inductance to the secondary coil."}, {"url": "https://en.wikipedia.org/wiki/Tesla_coil", "passage_text": "A Tesla coil is an electrical resonant transformer circuit invented by Nikola Tesla around 1891. It is used to produce high-voltage, low-current, high frequency alternating-current electricity. 1 The Tesla coil (L1, L2) , an air-core double-tuned resonant transformer, which generates the high output voltage. 2  Optionally, a capacitive electrode (top load) (E) in the form of a smooth metal sphere or torus attached to the secondary terminal of the coil."}, {"url": "http://www.sciencebrothers.org/how-a-tesla-coil-works/", "passage_text": "So this is how a Tesla Coil works. It creates high-voltage electricity at a high frequency. And when you produce this kind of electricity, you can do cool things like power light-bulbs with no wires. A Tesla Coil works much in the same way your cell phone charger works, but in reverse. Instead of reducing voltage, it increases it. This is called a transformer. It has two main sets of windings, a primary winding and a secondary winding."}, {"url": "http://www.wikihow.com/Make-a-Tesla-Coil", "passage_text": "1 (For a Tesla coil, this is optimum operating point for transferring electrical energy between the primary and secondary coils.) The unit of measure for the resonant frequency is the hertz (abbreviated Hz), defined as 1 cycle per second. "}, {"url": "http://onetesla.com/tesla-coil-faq", "passage_text": "Tesla coils fall into two categories: spark-gap coils and solid-state coils. Every Tesla coil consists of a primary LC circuit that excites a secondary circuit. Solid-state and spark-gap coils vary in how they drive the primary sides of the coil. Solid-state coils have a number of common sub-varieties as well. Spark gap coils use an air gap to control the primary current. Using a transformer (often a neon sign transformer or “NST”) , a primary capacitor is charged to a high voltage. When the voltage is high enough, the spark gap breaks down, ionizing the air between the terminals and forming a short circuit."}, {"url": "https://en.wikipedia.org/wiki/Tesla_coil", "passage_text": "1 Spark-excited or Spark Gap Tesla Coil (SGTC) - This type uses a spark gap to switch pulses of current through the primary, exciting oscillation in the transformer. 2  This pulsed (disruptive) drive creates a pulsed high voltage output. 1 The Tesla coil (L1, L2) , an air-core double-tuned resonant transformer, which generates the high output voltage. 2  Optionally, a capacitive electrode (top load) (E) in the form of a smooth metal sphere or torus attached to the secondary terminal of the coil."}, {"url": "http://onetesla.com/tesla-coil-faq", "passage_text": "A Tesla coil is a device that uses resonant circuits and alternating current to produce extremely high voltages. Originally invented by Nikola Tesla in the late 1800s, Tesla coils have progressed from spark-gap circuits to designs involving modern solid-state switching devices such as MOSFETs and IGBTs. Spark gap coils use an air gap to control the primary current. Using a transformer (often a neon sign transformer or “NST”) , a primary capacitor is charged to a high voltage. When the voltage is high enough, the spark gap breaks down, ionizing the air between the terminals and forming a short circuit."}, {"url": "http://www.livescience.com/46745-how-tesla-coil-works.html", "passage_text": "A Tesla coil consists of two parts: a primary coil and secondary coil, each with its own capacitor. (Capacitors store electrical energy just like batteries.) The two coils and capacitors are connected by a spark gap — a gap of air between two electrodes that generates the spark of electricity. Essentially, the Tesla coil is two open electric circuits connected to a spark gap. A Tesla coil needs a high-voltage power source. A regular power source fed through a transformer can produce a current with the necessary power (at least thousands of volts)."}, {"url": "http://www.penguinslab.com/tesla.htm", "passage_text": "Tesla coils are air cored resonant transformers. Resonant, basically meaning 'in tune', and transformer, meaning the things you find in almost every household appliance used to step up or down the voltage. In the case of a tesla coil, the voltage is stepped up. Tesla coils are nothing to joke about-they can generate very dangerous voltages, so one must be careful when working with them. To hit an electric circuit into resonance, two basic components are required. The capacitor in the tesla coil is used for storing the energy, while the inductor (or primary coil) is used to provide mutual inductance to the secondary coil."}, {"url": "http://www.penguinslab.com/tesla.htm", "passage_text": "A capacitor (stores energy in the form of an electrostatic field) and an inductor (stores energy in form of a magnetic field). The capacitor in the tesla coil is used for storing the energy, while the inductor (or primary coil) is used to provide mutual inductance to the secondary coil."}]