[{"url": "http://www.apa.org/science/about/psa/2005/05/gelman.aspx", "passage_text": "Psychological essentialism also has implications for models of categorization. There is an idealized model of categorization that has formed the basis for much work in psychology. Standard theories of concepts have been based on considering which known properties are most privileged, and in what form. Essentialism in Everyday Thought. Essentialism is the view that certain categories (e.g., women, racial groups, dinosaurs, original Picasso artwork) have an underlying reality or true nature that one cannot observe directly. The following observations may seem wholly unrelated, but all can be understood within a framework of psychological essentialism:"}, {"url": "http://www.academicroom.com/topics/what-is-essentialism", "passage_text": "Tweet. In philosophy, essentialism is the view that, for any specific kind of entity, there is a set of characteristics or properties all of which any entity of that kind must possess. All things can therefore be precisely defined or described. "}, {"url": "https://en.wikipedia.org/wiki/Essentialism", "passage_text": "There is a difference between metaphysical essentialism (see above) and psychological essentialism, the latter referring not to an actual claim about the world but a claim about a way of representing entities in cognitions (Medin, 1989). Essentialism has emerged as an important concept in psychology, particularly developmental psychology. Gelman and Kremer (1991) studied the extent to which children from 4–7 years old demonstrate essentialism."}, {"url": "http://jonathanstray.com/papers/Psychological%20Essentialism%20in%20Children.pdf", "passage_text": "Language and Conceptual Development series Psychological essentialism in children Susan A. Gelman University of Michigan, Ann Arbor, MI 48109-1109, USA Psychological essentialism is the idea that certaincategories, such as ‘lion’ or ‘female’, have an underlyingreality that cannot be observed directly. "}, {"url": "http://psychology.wikia.com/wiki/Essentialism", "passage_text": "There is a difference between metaphysical essentialism (see above) and psychological essentialism, the latter referring not to an actual claim about the world but a claim about a way of representing entities in cognitions (Medin, 1989). Essentialism, in its broadest sense, is any philosophy that acknowledges the primacy of Essence. Unlike Existentialism, which posits being as the fundamental reality, the essentialist ontology must be approached from a metaphysical perspective."}, {"url": "http://rationalwiki.org/wiki/Essentialism", "passage_text": "Essentialism is a concept in philosophy and psychology concerning the underlying true metaphysical nature of material objects. [edit] Aristotelian essentialism. Aristotelian essentialism was defined by WV Quine, writing in 1966, as the doctrine that some of the attributes of a thing (quite independently of the language in which the thing is referred to, if at all) may be essential to the thing and others accidental."}, {"url": "http://cdp.sagepub.com/content/16/4/202.abstract", "passage_text": "Abstract. Psychological essentialism is an ordinary mode of category representation that has powerful social-psychological consequences. This article reviews those consequences, with a focus on the distinctive ways people perceive, evaluate, and interact with members of human categories they essentialize. "}, {"url": "https://en.wikipedia.org/wiki/Essentialism", "passage_text": "For the 2014 book, see Essentialism: The Disciplined Pursuit of Less. Essentialism is the view that, for any specific entity (such as an animal, a group of people, a physical object, a concept), there is a set of attributes which are necessary to its identity and function. In Western thought the concept is found in the work of Plato and Aristotle. Essentialism has emerged as an important concept in psychology, particularly developmental psychology. Gelman and Kremer (1991) studied the extent to which children from 4–7 years old demonstrate essentialism."}, {"url": "http://rationalwiki.org/wiki/Essentialism", "passage_text": "Psychological essentialism refers to the tendency of people to group objects or people by some natural underlying essence that they are thought to share. Psychological essentialism opposes Jean Piaget's view of children as concrete thinkers who group objects based on superficial characteristics. [edit] Aristotelian essentialism. Aristotelian essentialism was defined by WV Quine, writing in 1966, as the doctrine that some of the attributes of a thing (quite independently of the language in which the thing is referred to, if at all) may be essential to the thing and others accidental."}]