[{"url": "http://www.spacetelescope.org/news/heic0101/", "passage_text": "This dramatic NASA/ESA Hubble Space Telescope image, showing 10 times more detail, reveals the 'ant's body' as a pair of fiery lobes protruding from a dying, Sun-like star. Observed from ground-based telescopes, the so-called 'ant nebula' (Menzel 3, or Mz3) resembles the head and thorax of a common garden ant. - Tantalising detail in ant-shaped nebula illuminates last moments of Sun-like stars"}, {"url": "http://www.astronomytrek.com/what-are-nebulae-and-how-are-they-formed/", "passage_text": "Four Main Types Of Nebulae. Planetary Nebulae: These are called such because they look like a planet when viewed with a small telescope. One of the best examples of a planetary nebula is the Ring Nebula (M57) in Lyra. Reflection Nebulae: A reflection nebula does not emit any visible light of its own, and shines only because the light from an embedded source illuminates its dust. "}, {"url": "http://cas.sdss.org/dr4/en/astro/stars/stars.asp", "passage_text": "In some nebulae, stars form out of large clouds of gas and dust; once some stars have formed inside the cloud, their light illuminates the cloud, making it visible to us. These star formation regions are sites of emission and reflection nebulae, like the famous Orion Nebula shown in the picture on the right. Not surprisingly, these are called dark nebulae. Another type of nebula, called a planetary nebula, results from the death of a star. When a star has burned through so much material that it can no longer sustain its own fusion reactions, the star's gravity causes it to collapse."}, {"url": "http://www.cosmiclight.com/galleries/nebulae.html", "passage_text": "The name planetary nebula refers only to the round shape that many of these objects show when examined through a small visual telescope. In reality, these nebulae have little or nothing to do with planets, but are instead huge shells of gas ejected by stars as they near the ends of their lifetimes. NGC 3132 is nearly half a light year in diameter, and at a distance of about 2000 light years is one of the nearer known planetary nebulae. The Unveiling of a Planetary Nebula. This HST Wide Field and Planetary Camera 2 image captures the infancy of the Stingray Nebula (Hen-1357), the youngest known planetary nebula. In this image, the bright central star is in the middle of the green ring of gas."}, {"url": "http://nineplanets.org/news/the-egg-nebula/", "passage_text": "This colourful image shows a cosmic lighthouse known as the Egg Nebula, which lies around 3000 light-years from Earth. The image, taken with the NASA/ESA Hubble Space Telescope, has captured a brief but dramatic phase in the life of a Sun-like star. The Egg Nebula is a ‘preplanetary nebula’. These objects occur as a dying star’s hot remains briefly illuminates material it has expelled, lighting up the gas and dust that surrounds it."}, {"url": "http://www.cosmiclight.com/galleries/nebulae.html", "passage_text": "The Hourglass Nebula. This is an image of MyCn18, a young planetary nebula located about 8,000 light-years away, taken with the Wide Field and Planetary Camera 2 (WFPC2) aboard NASA's Hubble Space Telescope (HST). This Hubble image reveals the true shape of MyCn18 to be an hourglass with an intricate pattern of etchings in its walls. The Unveiling of a Planetary Nebula. This HST Wide Field and Planetary Camera 2 image captures the infancy of the Stingray Nebula (Hen-1357), the youngest known planetary nebula. In this image, the bright central star is in the middle of the green ring of gas."}, {"url": "http://www.ing.iac.es/PR/science/stars.html", "passage_text": "Planetary nebulae are shells of gas thrown out by some stars near the end of their lives. Our Sun will probably produce a planetary nebula in about 5 thousand million years. They have nothing at all to do with planets; the terminology was invented because they often look a little like planets in small telescopes. The gas and dust in the nebula emits light because it is irradiated by nearby emerging stars. Located at a distance of about 1,600 light years, the Orion nebula is the brightest diffuse nebula in the sky, visible to the naked eye."}, {"url": "http://www.spacetelescope.org/news/heic0101/", "passage_text": "This dramatic NASA / ESA Hubble Space Telescope image, showing 10 times more detail, reveals the 'ant's body' as a pair of fiery lobes protruding from a dying, Sun-like star. Hubble images directly challenge old ideas about planetary nebulae-the last stage in the life of Sun-like stars. This striking image has been assembled by the Hubble Heritage project and ESA from earlier images stored in the Hubble Archive. - Tantalising detail in ant-shaped nebula illuminates last moments of Sun-like stars. Observed from ground-based telescopes, the so-called 'ant nebula' (Menzel 3, or Mz3) resembles the head and thorax of a common garden ant."}, {"url": "http://annesastronomynews.com/photo-gallery-ii/nebulae-clouds/the-stingray-nebula-hen-3-1357-is-the-youngest-known-planetary-nebula-18000-ly-away-in-ara-the-bright-central-white-dwarf-is-in-the-middle-of-the-green-ring-of-gas-its-companion-star-is-at-10-o/", "passage_text": "The Stingray Nebula (designated Henize 1357, Hen 3-1357) is the youngest known planetary nebula, located about 18,000 light-years away in the southern constellation Ara. It has a relatively small size (some 0.16 light-year across, one-tenth the size of most other known planetary nebula). However, it is about 130 times larger than our Solar System and is continuously expanding. As the nebula continues to move away from the star, the core of the star – which has become a white dwarf — is heated and illuminates the gas. Forty years ago the Stingray nebula was still a protoplanetary nebula in which the gas had not yet become hot and ionized."}]