[{"url": "http://www.corrosion-doctors.org/Biographies/VoltaBio.htm", "passage_text": "Proof of this theory was the battery, which Volta invented in 1800. He built in 1800 the first electrical pile, or battery: a series of metal disks of two kinds, separated by cardboard disks soaked with acid or salt solutions. Alessandro Volta (1745-1827). A century and a half after Galileo's death, something of scientific importance was to develop in Italy. Volta found that it was the presence of two dissimilar metals, not the frog leg, that was critical. In 1800, after extensive experimentation, he developed the voltaic pile."}, {"url": "http://physics.kenyon.edu/EarlyApparatus/Electricity/Voltaic_Pile/Voltaic_Pile.html", "passage_text": "The voltaic pile at the left, in the collection at Dartmouth College in Hannover, New Hampshire, is unusual in its provision of a built-in spark gap. Electrochemical Cells, which were developed from Volta's basic idea of dissimilar metals separated by an electrolyte, were developed in the first half of the 19th century. "}, {"url": "https://en.wikipedia.org/wiki/Alessandro_Volta", "passage_text": "In announcing his discovery of the voltaic pile, Volta paid tribute to the influences of William Nicholson, Tiberius Cavallo, and Abraham Bennet. The battery made by Volta is credited as the first electrochemical cell. In 1800, as the result of a professional disagreement over the galvanic response advocated by Galvani, Volta invented the voltaic pile, an early electric battery, which produced a steady electric current."}, {"url": "http://www.juliantrubin.com/bigten/voltapile.html", "passage_text": "In fact, it was Volta's famous disagreement with Galvani's theory of animal electricity that led Volta, in 1800, to build the voltaic pile to prove that electricity did not come from the animal tissue but was generated by the contact of different metals in a moist environment. Most historians attribute the invention of the battery to Alessandro Volta since his voltaic pile was the first battery that produced a reliable, steady current of electricity. Volta s invention was to give rise to electrochemistry, electromagnetism and the modern applications of electricity."}, {"url": "https://en.wikipedia.org/wiki/Voltaic_pile", "passage_text": "A voltaic pile on display in the Tempio Voltiano (the Volta Temple) near Volta's home in Como. The voltaic pile was the first electrical battery that could continuously provide an electrical current to a circuit. It was invented by Alessandro Volta, who published his experiments in 1800. Schematic diagram of a copper – zinc voltaic pile. The copper and zinc discs were separated by cardboard or felt spacers soaked in salt water (the electrolyte). Volta's original piles contained an additional zinc disk at the bottom, and an additional copper disk at the top. These were later shown to be unnecessary."}, {"url": "http://www.rigb.org/our-history/iconic-objects/iconic-objects-list/voltaic-pile", "passage_text": "Alessandro Volta's voltaic pile. The first electrical battery, invented by Volta in 1800 in Genoa, Italy. This voltaic pile, made before 1813, was presented to Michael Faraday by Volta in 1814. Credit: Paul Wilkinson"}, {"url": "http://inventors.about.com/od/utstartinventors/a/Alessandro_Volta.htm", "passage_text": "Alessandro Volta-Example of Voltic Pile. Photograph courtesy of the National Library of Medicine. In 1800, Alessandro Volta of Italy built the voltaic pile and discovered the first practical method of generating electricity. Count Volta also made discoveries in electrostatics, meteorology and pneumatics."}, {"url": "https://nationalmaglab.org/education/magnet-academy/history-of-electricity-magnetism/museum/voltaic-pile-1800", "passage_text": "The voltaic pile, invented by Alessandro Volta in 1800, was the first device to provide a steady supply of electricity. Volta’s ongoing disagreement with Luigi Galvani served as the impetus for its construction. "}]