[{"url": "http://www.tarleton.edu/Departments/anatomy/geneticsreview1.html", "passage_text": "Genetics is the study of inheritance (i.e. the study of the passage of traits from one generation to another). Genetic traits are carried on chromosomes, which are long molecules of a nucleic acid called DNA. Each chromosome carries the genetic code for many different traits."}, {"url": "https://askabiologist.asu.edu/punnett-squares", "passage_text": "1 Genotype: the genetic makeup of an organism, or the versions of a gene that an organism has. 2  Heterozygous: having two different versions of a gene. 3  Homozygous: having two identical"}, {"url": "https://askabiologist.asu.edu/punnett-squares", "passage_text": "1 Dominant: a trait that is visible and can cover up other traits when there is more than one present. 2  Genotype: the genetic makeup of an organism, or the versions of a gene that an organism has. 3  Heterozygous: having two different versions of a gene. 4  Homozygous: having two identical"}, {"url": "http://ghr.nlm.nih.gov/handbook/mutationsanddisorders/predisposition", "passage_text": "A genetic predisposition (sometimes also called genetic susceptibility) is an increased likelihood of developing a particular disease based on a person’s genetic makeup. A genetic predisposition results from specific genetic variations that are often inherited from a parent."}, {"url": "http://www.answers.com/Q/What_is_genetic_make_up_called", "passage_text": "A genotype is how the organism is genetically structured, includin … g recessive genes that are not apparent when looking at the organism. Some diseases, like colorblindness, are recessive and are only expressed when there is not a dominant gene to override it. The entire genetic makeup of an animal is its genome. 4 people found this useful. 1  The Five Major Parts of the Brain At its most basic, the brain controls the body."}, {"url": "http://www.answers.com/Q/The_genetic_make-up_of_an_individual_is_called_the", "passage_text": "A genotype is how the organism is genetically structured, includin … g recessive genes that are not apparent when looking at the organism. Some diseases, like colorblindness, are recessive and are only expressed when there is not a dominant gene to override it. The entire genetic makeup of an animal is its genome."}, {"url": "https://askabiologist.asu.edu/punnett-squares", "passage_text": "1 Allele: a different version of a gene. 2  Dominant: a trait that is visible and can cover up other traits when there is more than one present. 3  Genotype: the genetic makeup of an organism, or the versions of a gene that an organism has. 4  Heterozygous: having two different versions"}]