[{"url": "http://www.babycenter.com/0_head-lice-101-what-lice-look-like-how-they-behave-and-how-ki_10892.bc", "passage_text": "Lice survival guide for parents. Baby lice, known as nymphs, are not much bigger than the nits and tend to be light in color. Nine to 12 days later, they become adults and mate, the females lay their eggs, and the cycle continues. An adult louse can live up to 30 days on the human head."}, {"url": "http://www.licesquad.com/resources/articles/identifying-head-lice/", "passage_text": "1 Empty egg cases or dead eggs are called, Nits. 2  Nits are clear, opaque, almost see through. 3  Female lice lay 3 to 5 eggs per day and live for 30 days. 4  Lice eggs take 7 to 10 days to hatch and another 7 to 10 days to mature and mate."}, {"url": "http://www.hairwhisperers.com/qanda.html", "passage_text": "24 hours after mating, female head lice lays her eggs (nits) on the hair shaft about 1/4-inch away from the scalp, although they can be found anywhere on the scalp. Lice can live up to a month and can lay up to 10 eggs a day. An egg takes 7-10 days to hatch. A nymph is a baby louse. A nymph takes 7-10 days to mature into an adult louse. Only adults can lay eggs. The dark brown eggs are the newly laid eggs."}, {"url": "http://ipm.ncsu.edu/srurban/CHAP8/LICE/lice3.htm", "passage_text": "The eggs are glued to the hair shaft very close to the scalp. Head lice live only about 30 to 40 days. They die in 1 or 2 days when removed from the head, and eggs die soon after being removed from the warm scalp. Head lice do not wander about rugs, furniture, or school buses seeking a host."}, {"url": "http://www.licesquad.com/resources/articles/identifying-head-lice/", "passage_text": "1 Nits are clear, opaque, almost see through. 2  Female lice lay 3 to 5 eggs per day and live for 30 days. 3  Lice eggs take 7 to 10 days to hatch and another 7 to 10 days to mature and mate. 4  An louse egg is called a Nit; a baby louse is called a Nymph."}, {"url": "http://www.shinystrands.com/resources/", "passage_text": "There are 3 life stages for lice – egg, baby and adult. The egg (nit) is attached to the human hair with an extremely strong glue. Female lice lay approximately 5 eggs twice a day. The eggs incubate for 7 to 10 days. After hatching, the baby lice (nymph) grow into adults within"}, {"url": "https://uk.answers.yahoo.com/question/index?qid=20070110003803AAY7WG7", "passage_text": "Adults: The adult louse can lay up to 4-10 eggs a day-starting another generation of lice. The adult stage lasts about 28 days. I am unfamiliar with the product you are using, but what I have found to be the best is a product made by RID."}, {"url": "http://www.licesquad.com/resources/articles/identifying-head-lice/", "passage_text": "1 Female lice lay 3 to 5 eggs per day and live for 30 days. 2  Lice eggs take 7 to 10 days to hatch and another 7 to 10 days to mature and mate. 3  An louse egg is called a Nit; a baby louse is called a Nymph."}]