[{"url": "https://en.wikipedia.org/wiki/Fractal_dimension", "passage_text": "A fractal dimension is an index for characterizing fractal patterns or sets by quantifying their complexity as a ratio of the change in detail to the change in scale. Several types of fractal dimension can be measured theoretically and empirically (see Fig. 2). "}, {"url": "http://mathworld.wolfram.com/Fractal.html", "passage_text": "Fractal. A fractal is an object or quantity that displays self-similarity, in a somewhat technical sense, on all scales. The object need not exhibit exactly the same structure at all scales, but the same type of structures must appear on all scales. A plot of the quantity on a log-log graph versus scale then gives a straight line, whose slope is said to be the fractal dimension"}, {"url": "http://mathforum.org/alejandre/workshops/fractal/fractal3.html", "passage_text": "From the Fractal FAQ: A fractal is a rough or fragmented geometric shape that can be subdivided in parts, each of which is (at least approximately) a reduced-size copy of the whole. Fractals are generally self-similar and independent of scale.. There are many mathematical structures that are fractals; e.g. "}, {"url": "http://www-03.ibm.com/ibm/history/ibm100/us/en/icons/fractal/", "passage_text": "This shape and structure, later known as the Mandelbrot set, was an extraordinarily complex and beautiful example of a “fractal” object, fractal being the name coined by Mandelbrot in 1975 to describe such repeating or self-similar mathematical patterns. "}, {"url": "http://www.sciencedirect.com/science/article/pii/S0166864113003830", "passage_text": "([2, Definition 3.1]) Let X be a topological space. A pre-fractal structure on X is a countable family of coverings called levels, γ={Γn:n∈N}γ={Γn:n∈N} , such that Uxγ is an open neighborhood base of x for each x∈Xx∈X. The main goal of this paper is to provide a generalized definition of fractal dimension for any space equipped with a fractal structure. This novel theory generalizes the classical box-counting dimension theory on the more general context of GF-spaces."}, {"url": "https://www.fractalus.com/fractal-art-faq/faq03.html", "passage_text": "A fractal is a rough or fragmented geometric shape that can be subdivided in parts, each of which is (at least approximately) a reduced-size copy of the whole. Fractals are generally self-similar and independent of scale. There are many mathematical structures that are fractals; e.g. "}, {"url": "http://users.wpi.edu/~goulet/fractals.htm", "passage_text": "A Geometric pattern that is repeated at ever smaller scales to produce irregular shapes and surfaces that cannot be represented by classical geometry. Fractals are used especially in computer modeling of irregular patterns and structures in nature. [French from Latin. "}, {"url": "http://www.sciencedirect.com/science/article/pii/S0166864113003830", "passage_text": "The use of fractal structures provides a powerful tool to introduce new models for a definition of fractal dimension, since a fractal structure is a natural context in which the concept of fractal dimension can be performed. The main goal of this paper is to provide a generalized definition of fractal dimension for any space equipped with a fractal structure. This novel theory generalizes the classical box-counting dimension theory on the more general context of GF-spaces."}, {"url": "https://en.wikipedia.org/wiki/Fractal", "passage_text": "The same fractal as above, magnified a 2000-fold, where the Mandelbrot set fine detail resembles the detail at low magnification. A fractal is a natural phenomenon or a mathematical set that exhibits a repeating pattern that displays at every scale. It is also known as expanding symmetry or evolving symmetry. If the replication is exactly the same at every scale, it is called a self-similar pattern. An example of this is the Menger Sponge. Fractals can also be nearly the same at different levels. This latter pattern is illustrated in the magnifications of the Mandelbrot set. Fractals also include the idea of a detailed pattern that repeats itself. Fractals are different from other geometric figures because of the way in which they scale"}]