[{"url": "http://www.csun.edu/~ll656883/lectures/lecture18.pdf", "passage_text": "These vectors can hold DNA fragments of up to 300 kb. Since they are present in low copies, recombination between the high-copy plasmids. BAC vectors (Bacterial Artificial Chromosome) The F (fertility) factor is a plasmid that can be mobilized from F+ male bacteria and F-female bacteria. The gene transfer from one to another bacterial cell is called conjugation. The F factor controls its own replication"}, {"url": "http://www.ghr.nlm.nih.gov/glossary=yeastartificialchromosome", "passage_text": "Yeast artificial chromosome (YAC) is a human-engineered DNA molecule used to clone DNA sequences in yeast cells. YACs are often used in connection with the mapping and sequencing of genomes. Segments of an organism's DNA, up to one million base pairs in length, can be inserted into YACs. The YACs, with their inserted DNA, are then taken up by yeast cells. As the yeast cells grow and divide, they amplify the YAC DNA, which can be isolated and used for DNA mapping and sequencing."}, {"url": "https://en.wikipedia.org/wiki/Human_artificial_chromosome", "passage_text": "That is, instead of 46 chromosomes, the cell could have 47 with the 47th being very small, roughly 6-10 megabases (Mb) in size instead of 50-250 Mb for natural chromosomes, and able to carry new genes introduced by human researchers. In 2010, a refined human artificial chromosome called 21HAC was reported. 21HAC is based on a stripped copy of human chromosome 21, producing a chromosome 5 Mb in length. Truncation of chromosome 21 resulted in a human artificial chromosome that is mitotically stable. 21HAC was also able to be transferred into cells from a variety of species (mice, chickens, humans)"}, {"url": "https://en.wikipedia.org/wiki/Yeast_artificial_chromosome", "passage_text": "This article is about Chromosomes derived from yeast DNA. For Yeast created from synthetic DNA, see Synthetic DNA. Yeast artificial chromosomes (YACs) are genetically engineered chromosomes derived from the DNA of the yeast, Saccharomyces cerevisiae, which is then ligated into a bacterial plasmid. A YAC is built using an initial circular DNA plasmid, which is typically cut into a linear DNA molecule using restriction enzymes; DNA ligase is then used to ligate a DNA sequence or gene of interest into the linearized DNA, forming a single large, circular piece of DNA."}, {"url": "http://chromoresearch.co.jp/e/chromosome/", "passage_text": "A human artificial chromosome (HAC) is a mini-chromosome that is constructed artificially in human cells. Using its own self-replicating and segregating systems, a HAC can behave as a stable chromosome that is independent from the chromosomes of host cells. Analyses of the Human Genome Project revealed that the human genome contains about 22,000 genes. These genes occupy only 5% of the genome, and the remaining 95% is related to the function, behavior, and inheritance of the chromosomes. Further analyses are needed to better understand chromosomes as vehicles for genes."}, {"url": "http://www.encyclopedia.com/topic/artificial_chromosome.aspx", "passage_text": "artificial chromosome A type of cloning vector that has some features of true chromosomes and is used to clone relatively large fragments of DNA. Bacterial artificial chromosomes (BACs) are based on the F (fertility) plasmid found naturally in E. coli bacteria (see sex factor). Chromosomes, Artificial. Artificial chromosomes are laboratory constructs that contain DNA sequences and that perform the critical functions of natural chromosomes. They are used to introduce and control new DNA in a cell, to study how chromosomes function, and to map genes in genomes."}, {"url": "https://en.wikipedia.org/wiki/Human_artificial_chromosome", "passage_text": "A human artificial chromosome (HAC) is a microchromosome that can act as a new chromosome in a population of human cells. In 2010, a refined human artificial chromosome called 21HAC was reported. 21HAC is based on a stripped copy of human chromosome 21, producing a chromosome 5 Mb in length. Truncation of chromosome 21 resulted in a human artificial chromosome that is mitotically stable. 21HAC was also able to be transferred into cells from a variety of species (mice, chickens, humans)"}, {"url": "https://en.wikipedia.org/wiki/Human_artificial_chromosome", "passage_text": "Yeast artificial chromosomes and bacterial artificial chromosomes were created before human artificial chromosomes, which first appeared in 1997. HACs are useful in expression studies as gene transfer vectors, as a tool for elucidating human chromosome function, and as a method for actively annotating the human genome. In 2010, a refined human artificial chromosome called 21HAC was reported. 21HAC is based on a stripped copy of human chromosome 21, producing a chromosome 5 Mb in length. Truncation of chromosome 21 resulted in a human artificial chromosome that is mitotically stable. 21HAC was also able to be transferred into cells from a variety of species (mice, chickens, humans)"}, {"url": "http://chromoresearch.co.jp/e/chromosome/", "passage_text": "The human genome is composed of 3 billion base pairs of DNA, which is 1 m in length. Genomic DNA is distributed into 23 distinct chromosomes: 22 autosomes and one of two types of sex chromosomes (X or Y) in a haploid germ line cell. Analyses of the Human Genome Project revealed that the human genome contains about 22,000 genes. These genes occupy only 5% of the genome, and the remaining 95% is related to the function, behavior, and inheritance of the chromosomes. Further analyses are needed to better understand chromosomes as vehicles for genes."}]