[{"url": "http://www.middleschoolchemistry.com/lessonplans/chapter6/lesson1", "passage_text": "1 A physical change, such as a state change or dissolving, does not create a new substance, but a chemical change does. 2  In a chemical reaction, the atoms and molecules that interact with each other are called reactants. 3  In a chemical reaction, the atoms and molecules produced by the reaction are called products. "}, {"url": "https://en.wikipedia.org/wiki/Physical_change", "passage_text": "A physical change involves a change in physical properties. Examples of physical properties include melting, transition to a gas, change of strength, change of durability, changes to crystal form, textural change, shape, size, color, volume and density. Physical changes are used to separate mixtures into their component compounds, but can not usually be used to separate compounds into chemical elements or simpler compounds. Physical changes occur when objects or substances undergo a change that does not change their chemical composition. This contrasts with the concept of chemical change in which the composition of a substance changes or one or more substances combine or break up to form new substances. In general a physical change is reversible using physical means"}, {"url": "http://www.audioenglish.org/dictionary/chemical_reaction.htm", "passage_text": "• CHEMICAL REACTION (noun). The noun CHEMICAL REACTION has 1 sense: 1. (chemistry) a process in which one or more substances are changed into others. Familiarity information: CHEMICAL REACTION used as a noun is very rare. hydrolysis (a chemical reaction in which water reacts with a compound to produce other compounds; involves the splitting of a bond and the addition of the hydrogen cation and the hydroxide anion from the water)."}, {"url": "http://www.audioenglish.org/dictionary/chemical_reaction.htm", "passage_text": "Context example: there was a chemical reaction of the lime with the ground water. Hypernyms (chemical reaction is a kind of...): chemical action; chemical change; chemical process ((chemistry) any process determined by the atomic and molecular composition and structure of the substances involved). hydrolysis (a chemical reaction in which water reacts with a compound to produce other compounds; involves the splitting of a bond and the addition of the hydrogen cation and the hydroxide anion from the water)."}, {"url": "http://www.answers.com/Q/What_is_a_physical_reaction", "passage_text": "a mixture is a physical reaction because, by definition, a mixture is the combination of 2 or more substances and they maintain their chemical properties. A physical reaction is were the current substance can be changed in state and then changed back easily to it's previous state, a chemical reaction is the opposite, it is diffi … cult to change it back to its previous state."}, {"url": "http://chemistry.about.com/od/lecturenotesl3/a/chemphyschanges.htm", "passage_text": "A physical change does not produce a new substance. Changes in state or phase (melting, freezing, vaporization, condensation, sublimation) are physical changes. Examples of physical changes include crushing a can, melting an ice cube, and breaking a bottle. A chemical change produces a new substance. Examples of chemical changes include combustion (burning), cooking an egg, rusting of an iron pan, and mixing hydrochloric acid and sodium hydroxide to make salt and water. Physical Changes. Physical changes are concerned with energy and states of matter."}, {"url": "http://mcwdn.org/chemist/pcchange.html", "passage_text": "When you have finished this page, try the Chemical and Physical Changes Quiz. There are several differences between a physical and chemical change in matter or substances. A physical change in a substance doesn't change what the substance is. In a chemical change where there is a chemical reaction, a new substance is formed and energy is either given off or absorbed. For example, if a piece of paper is cut up into small pieces it still is paper. When heat is given off in a chemical change or reaction, it is called an exothermic reaction. When heat is absorbed in a chemical change or reaction, it is called an end"}, {"url": "http://chemistry.about.com/od/chemistryglossary/g/physical-change-definition.htm", "passage_text": "By Anne Marie Helmenstine, Ph.D. Physical Change Definition: A physical change is a type of change in which the form of matter is altered but one substance is not transformed into another. Examples: An example of a physical change is crumpling a sheet or paper or breaking a pane of glass or freezing water into ice. "}, {"url": "http://www.definitions.net/definition/physical%20change", "passage_text": "Physical changes are changes affecting the form of a chemical substance, but do not change the chemical composition of that substance. Physical changes are used to separate mixtures into their component compounds, but can not usually be used to separate compounds into chemical elements or simpler compounds. Examples of physical properties include melting, transition to a gas, change of strength, change of durability, changes to crystal form, textural change, shape, size, color, volume and density. An example of a physical change is the process of tempering steel to form a knife blade."}]