[{"url": "http://www.earthobservatory.sg/faq-on-earth-sciences/why-do-tectonic-plates-move", "passage_text": "If a plate with oceanic lithosphere meets another plate, the dense oceanic lithosphere dives beneath the other plate and sinks into the mantle: this process is called subduction. The sinking oceanic lithosphere drags the rest of the tectonic plate: this is the main cause of plate motion. "}, {"url": "http://www.pbslearningmedia.org/resource/ess05.sci.ess.earthsys.tectonic/tectonic-plates-earthquakes-and-volcanoes/", "passage_text": "Tectonic Plates, Earthquakes, and Volcanoes. According to the theory of plate tectonics, Earth is an active planet. Its surface is composed of many individual plates that move and interact, constantly changing and reshaping Earth's outer layer. Volcanoes and earthquakes both result from the movement of tectonic plates. "}, {"url": "http://www.answers.com/Q/What_are_tectonic_plates_and_how_do_they_move", "passage_text": "Tectonic plates are segments of the Earth's lithosphere, the hard rocky outer shell composed of the crust and the uppermost mantle. This shell is divided by lines of faults, ridges of plate creation, and zones of plate destruction. The Earth's plates are riding on top of the currents caused by these processes. The main features of plate tectonics are: 1  The Earth's surface is covered by a series of crustal plates. 2  The plates are composed of crustal rock and solid upper mantle which is called the lithosphere. * 3  Plates are composed of continental and oceanic crust"}, {"url": "http://www.answers.com/Q/What_are_tectonic_plates_and_how_do_they_move", "passage_text": "The movement of the plates is caused by the convection currents of heat from the Earth's interior. This heat, rising toward the surface through the mantle causes movement of plastic like rock in the asthenosphere, the layer of Earth directly below the lithosphere. The Earth's plates are riding on top of the currents caused by these processes. The main features of plate tectonics are: 1  The Earth's surface is covered by a series of crustal plates. 2  The plates are composed of crustal rock and solid upper mantle which is called the lithosphere. * 3  Plates are composed of continental and oceanic crust"}, {"url": "http://www.wisegeek.org/what-are-tectonic-plates.htm", "passage_text": "Tectonic plates are large plates of rock that make up the foundation of the Earth's crust and the shape of the continents. The tectonic plates comprise the bottom of the crust and the top of the Earth's mantle. There are ten major plates on Earth and many more minor ones. "}, {"url": "https://www.quora.com/Why-do-tectonic-plates-move", "passage_text": "Joshua has in. Tectonic plates move because they are floating on top of the liquid mantle. The mantle itself moves due to convection currents: hot rock rises, gives off some heat, then falls. This creates vast swirls of moving liquid rock under the crust of the earth, which jostles the plates of crust on top. These large pieces of rocks are called tectonic plates. Tectonic plates never stop moving, this process is called continental drift. Tectonic plates move because of convection currents. These convection currents happen in the mantle, underneath the"}, {"url": "http://www.livescience.com/37706-what-is-plate-tectonics.html", "passage_text": "From the deepest ocean trench to the tallest mountain, plate tectonics explains the features and movement of Earth's surface in the present and the past. Plate tectonics is the theory that Earth's outer shell is divided into several plates that glide over the mantle, the rocky inner layer above the core. The plates act like a hard and rigid shell compared to Earth's mantle. This strong outer layer is called the lithosphere. Developed from the 1950s through the 1970s, plate tectonics is the modern version of continental drift, a theory first proposed by scientist Alfred Wegener in 1912. Wegener didn't have an explanation for how continents could move around the planet, but researchers do now."}, {"url": "http://www.answers.com/Q/What_do_tectonic_plates_do", "passage_text": "No they are not the same thing.    Plate Tectonics is the study of mechanisms and the results of  large-scale movement of the earth's crust.    Tectonic Plates … are large sections of the earth's crust that float  on top of semi-molten rocks of the upper mantle. Plate tectonics is useful in the field of geology because it can be used to explain a variety of geologic processes, including volcanic activity, earthquakes, and mountain building.   Plate tectonics are what creates some of the worlds natural diasters. E.g: Tsunami's, Earthquakes, ect"}]