[{"url": "https://en.wikipedia.org/wiki/Romanesque_architecture", "passage_text": "It developed in the 12th century into the Gothic style, marked by pointed arches. Examples of Romanesque architecture can be found across the continent, making it the first pan-European architectural style since Imperial Roman Architecture. The Romanesque style in England is traditionally referred to as Norman architecture."}, {"url": "http://www.answers.com/Q/How_did_Gothic_cathedrals_differ_from_Romanesque_cathedrals", "passage_text": "Strong  walls also meant fewer windows, so the insides of Romanesque  churches often look dim and feel like fortresses. Gothic  architecture began in the mid-12th century with the intention of  making churches look like heaven: soaring, colorful, and bright. The biggest difference from the preceding Romanesque style was the  use of flying buttresses. These support structures or towers, set  off from the main walls and attached by arches, and displaced the  pressure from the roof outward."}, {"url": "http://www.differencebetween.net/miscellaneous/culture-miscellaneous/difference-between-gothic-and-romanesque-architecture/", "passage_text": "Gothic vs Romanesque Architecture. Gothic and Romanesque architecture are different architectural styles with certain similarities and many differences. The Romanesque architecture style was prevalent during the 9th and the 12th centuries. The Byzantine and the Roman styles have influenced the Romanesque architecture. The name “Romanesque” was carved out in the 1800s as it came with the barrel vault feature which had a resemblance to the classical Roman arch. The Gothic architecture is traced to the mid-12th century. The Romanesque architecture had the characteristics of large, internal spaces, barrel vaults, thick walls, and rounded arches on windows and doors. Gothic architecture has many features like highness, flying buttresses, and vertical lines."}, {"url": "http://staff.harrisonburg.k12.va.us/%7Ecwalton/gothicorromanesque.htm", "passage_text": "Three architectural features are typical of the Gothic. These are the pointed arch, the ribbed vault, and the flying buttress. It is the pointed arch that most clearly makes Gothic building look different from Roman and Romanesque work. In the older style the semicircular, round arch was used everywhere. But Gothic architects did not invent the pointed arch. It had been used much earlier in the Near East. One of the most important styles of European art that developed during the Middle Ages was called Romanesque. This style began during the 1000's and lasted for more than 200 years. Romanesque architecture is massive, low, and solid-looking. Round Roman arches, thick walls, and small windows are typical of the buildings."}, {"url": "http://www.oocities.org/medievalarchitecture/", "passage_text": "Above are some images from the interior of St. Michael s. Romanesque architecture: The Romanesque architecture is a style that developed in Europe during the 10th century AD, but the structures of Romanesque era are generally placed between 11th and 12th century AD. The name 'Romanesque' is a word for 'Roman-like' buildings."}, {"url": "http://www.bxscience.edu/ourpages/auto/2013/12/3/38098772/ROMANESQUE%20NEW.pdf", "passage_text": "Romanesque Architecture The term Romanesque means “like Roman”. It refers to the architecture of the 11th and 12th centuries in medieval Europe to Roman Architecture, based on similarities of forms and materials.Romanesque style is characterized by: General Appearance: 1. Dark, solemn spaces2. Exterior is simple, severe3. Modest Height4"}, {"url": "http://www.answers.com/Q/Difference_between_romanesque_and_gothic", "passage_text": "Strong walls also meant fewer windows, so the insides of Romanesque churches often look dim and feel like fortresses. Gothic architecture began in the mid-12th century with the intention of making churches look like heaven: soaring, colorful, and bright. The biggest difference from the preceding Romanesque style was the use of flying buttresses. These support structures or towers, set off from the main walls and attached by arches, and displaced the pressure from the roof outward."}, {"url": "https://answers.yahoo.com/question/index?qid=20070307151157AANlHxh", "passage_text": "Best Answer: Romanesque is characterized by a use of round arches, barrel vaults, cruciform piers supporting vaults, and groin vaults. A combination of masonry, arch and piers are the basis of the Romanesque style. Because of the lack of knowledge of the building statics, it was necessary to build strong, thick walls with narrow openings. In Gothic architecture new development was the ogival or pointed arch"}, {"url": "http://www.scholastic.com/browse/article.jsp?id=3753903", "passage_text": "Three architectural features are typical of the Gothic. These are the pointed arch, the ribbed vault, and the flying buttress. It is the pointed arch that most clearly makes Gothic building look different from Roman and Romanesque work. In the older style the semicircular, round arch was used everywhere. "}]