[{"url": "http://livewell.jillianmichaels.com/magnesium-digestion-5599.html", "passage_text": "Magnesium is responsible for the absorption of other nutrients in the body, especially calcium, copper, zinc, potassium and vitamin D. The digestive system relies on magnesium to help regulate blood sugar levels, control blood pressure, aid in metabolism, protein synthesis and activate enzymes for energy production. It is involved in more than 300 metabolic reactions and biochemical processes, include the digestion of food and release of nutrients for energy. Most of the body’s magnesium is stored in the bone and within the cells of the body’s tissues and organs. Only 1 percent is found in the blood"}, {"url": "http://www.drlwilson.com/articles/calcium.htm", "passage_text": "Calcium is the most plentiful element in the body, with most in the bones, teeth and nerves. Sadly, most people do not ingest nearly enough bioavailable calcium because when dairy products are pasteurized and homogenized, the calcium they contain is made less available to the body. In this case, calcium becomes biounavailable. That is, an excess occurs in the tissues but it is not available to the body. It becomes essentially a toxic mineral, causing calcium deposits in the joints, arteries, kidneys, brain and elsewhere."}, {"url": "http://www.webmd.com/vitamins-supplements/ingredientmono-781-CALCIUM.aspx?activeIngredientId=781&activeIngredientName=CALCIUM", "passage_text": "High levels of phosphate in the blood (hyperphosphatemia) or low levels of phosphate in the blood (hypophosphatemia) : Calcium and phosphate have to be in balance in the body. Taking too much calcium can throw this balance off and cause harm. Don’t take extra calcium without your health provider’s supervision. "}, {"url": "http://www.healthy.net/scr/Article.aspx?Id=2019", "passage_text": "Improved sugar metabolism. Minerals: Calcium Share Elson Haas M. MD © Calcium is the most abundant mineral in the human body and one of the most important. The calcium topic is huge and complex; let me try to make it concise and simple. This mineral constitutes about 1.5-2.0 percent of our body weight. "}, {"url": "http://umm.edu/health/medical/altmed/supplement/calcium", "passage_text": "Calcium is the most abundant mineral in your body. It is essential for the development and maintenance of strong bones and teeth, where about 99% of the body's calcium is found. Calcium also helps the heart, nerves, muscles, and other body systems work properly. 1 Calcium citrate: Easily absorbed and digested by the body. 2  It does not contain as much elemental calcium -- the amount your body actually absorbs -- as calcium carbonate. 3  It is more expensive than calcium carbonate. 4  Also, calcium citrate should not be used with aluminum-containing antacids"}, {"url": "https://ods.od.nih.gov/factsheets/Calcium-Consumer/", "passage_text": "Calcium is a mineral found in many foods. The body needs calcium to maintain strong bones and to carry out many important functions. Almost all calcium is stored in bones and teeth, where it supports their structure and hardness. "}, {"url": "http://www.health.harvard.edu/staying-healthy/what_you_need_to_know_about_calcium", "passage_text": "The calcium in most supplements is either in the form of calcium carbonate or calcium citrate. Research shows that they are absorbed equally well with meals, but calcium carbonate is harder to digest than calcium citrate. People are usually advised to take calcium carbonate with or soon after a meal. Most of the calcium in the American diet comes from dairy products. Not only do they contain a lot of the mineral, but it's in a form that's easy to digest and absorb. An 8-ounce serving of plain yogurt provides about 400 mg of calcium; an 8-ounce glass of milk, 300 mg; and a slice of cheddar cheese, 200 mg."}, {"url": "http://www.drlwilson.com/articles/calcium.htm", "passage_text": "Calcium also helps regulate cell permeability. It is also very alkaline-forming and critical for the maintenance of acid-base balance of the blood and the body tissues. Calcium is involved in the secretion of male and female hormones, cell division and the water balance of the body. It also stabilizes cell membranes, helps muscles relax, and slows nerve transmission and the heart rate. Calcium also helps prevent fluid loss from cells and from the blood. In this case, calcium becomes biounavailable. That is, an excess occurs in the tissues but it is not available to the body. It becomes essentially a toxic mineral, causing calcium deposits in the joints, arteries, kidneys, brain and elsewhere."}]