[{"url": "http://www.stamps.com/usps/standard-post/", "passage_text": "It usually takes between 2 and 9 days to receive a Standard Post package, but USPS sometimes takes up to 14 postal business days to deliver items sent with this method. This mail class was formerly known as Parcel Post, until it was changed to Standard Post in January 2013. However, you can’t use Standard Post for packages that measure more than 130 inches in length and width and weigh more than 70 pounds. The USPS utilizes zone-based pricing for all Standard Post package shipping. There are 9 zones in the U.S. and prices are based on the distance from the original package location to the delivery destination. Prices start at $5.75 for a one pound package. Also, Standard Post is subject to USPS’s balloon pricing. The USPS can charge you extra if your parcel weighs less than 20 pounds, but measures between 84 and 108 inches in length and width"}, {"url": "http://www.moneysavingexpert.com/shopping/cheap-parcel-delivery", "passage_text": "For items 1kg or over this, the cheapest is generally MyHermes, which runs its own delivery service directly. Its basic 3-5 day service costs 5.48 for items between 2-5kg. If you've a lighter parcel, it's 3.98 for 1-2kg items, or 2.98 for items less than 1kg. It's owned by Hermes UK, whose network delivers for online retailers including Next Directory, Debenhams and QVC. However, discount courier companies tend to offer flat-rate prices based around DHL and Parcelforce's standard maximum dimensions. As a rough guide, these are are generally about: Max length 150 cm, max weight 30kg. Of course, it varies depending on the company, so check first as some may offer larger sizes."}, {"url": "http://www.royalmail.com/personal/sending-mail", "passage_text": "Sending mail. All you need to know about sending mail in the UK and overseas. Help Price finder allows you to calculate prices for sending mail in the UK and overseas and print postage from your computer. www.royalmail.com (this Website) uses cookies in order to make it easier to use and to support the provision of relevant information and functionality to you. Cookies also provide us with information about how this Website is used so we can keep it is as up to date, relevant and error free as possible."}, {"url": "https://www.parcelhero.com/", "passage_text": "Large Parcel Delivery from £18.95. If you need a courier service for large items, have a heavy parcel delivery or a pallet delivery, it can be hard to find the best courier. ParcelHero ® specialises in sending large parcels and parcel comparison of the cheapest parcel delivery services from the most reliable couriers. To send a parcel simply get a quote, select from a range of delivery services from our courier comparison and let ParcelHero ® take care of the rest. 1  Cheap UK Parcel Delivery, Pallet Delivery & International Courier Service to 220 countries. 2  Free parcel collection same-day from most"}, {"url": "http://www.stamps.com/usps/standard-post/", "passage_text": "Standard Post is the US Postal Service’s lowest cost option to send packages of all sizes, including oversized boxes, to destinations in the United States. However, you can’t use Standard Post for packages that measure more than 130 inches in length and width and weigh more than 70 pounds. The USPS utilizes zone-based pricing for all Standard Post package shipping. There are 9 zones in the U.S. and prices are based on the distance from the original package location to the delivery destination. Prices start at $5.75 for a one pound package. Also, Standard Post is subject to USPS’s balloon pricing. The USPS can charge you extra if your parcel weighs less than 20 pounds, but measures between 84 and 108 inches in length and width"}, {"url": "http://www.royalmail.com/personal/sending-mail", "passage_text": "Our free, 1st Class or Airmail service designed to support blind and visually impaired people. www.royalmail.com (this Website) uses cookies in order to make it easier to use and to support the provision of relevant information and functionality to you. Cookies also provide us with information about how this Website is used so we can keep it is as up to date, relevant and error free as possible."}, {"url": "http://www.moneysavingexpert.com/shopping/cheap-parcel-delivery", "passage_text": "Royal Mail's generally still cheapest for sending cards, letters and is competitive for small parcels under 1kg (use its Price Finder-check dimensions carefully). The price jumps for heavier parcels-anything over 2kg costs over 13, and that's without tracking. However, discount courier companies tend to offer flat-rate prices based around DHL and Parcelforce's standard maximum dimensions. As a rough guide, these are are generally about: Max length 150 cm, max weight 30kg. Of course, it varies depending on the company, so check first as some may offer larger sizes."}, {"url": "http://www.moneysavingexpert.com/shopping/cheap-parcel-delivery", "passage_text": "For a New York parcel, Worldwide Parcel Services* generally comes up cheapest at 35.13 (there's no VAT when sending to the US, but customs duties may be due at the other end). This will get you delivery via WPS Air Express Service in 2-5 days. However, discount courier companies tend to offer flat-rate prices based around DHL and Parcelforce's standard maximum dimensions. As a rough guide, these are are generally about: Max length 150 cm, max weight 30kg. Of course, it varies depending on the company, so check first as some may offer larger sizes."}, {"url": "https://www.parcelhero.com/", "passage_text": "ParcelHero’s cheap UK parcel delivery service offers same-day collection anywhere in the UK, with booking times between 12pm and 3pm and up to 4pm for Courier Services in London. Our UK standard delivery offers next day delivery to over 95% of UK postcodes, and timed AM delivery for urgent shipments. To send a parcel simply get a quote, select from a range of delivery services from our courier comparison and let ParcelHero ® take care of the rest. 1  Cheap UK Parcel Delivery, Pallet Delivery & International Courier Service to 220 countries. 2  Free parcel collection same-day from most"}]