[{"url": "https://msdn.microsoft.com/en-us/library/hh168327(v=nav.90).aspx", "passage_text": "For example, all costs for the heating cost type, which is an allocation source, can be allocated to the workshop, production, and sales cost centers, which are three allocation targets. Cost accounting. In cost accounting, actual costs of operations, processes, departments, or products are recorded. The allocation key is the basis that is used to allocate costs. It is typically a quantity, such as square meters occupied, number of employees, or man-hours used. For example, two departments, with 20 and 10 employees respectively, share canteen costs"}, {"url": "http://www.accountingcoach.com/terms/A/allocated", "passage_text": "allocated. Costs that have been divided up and assigned to periods, departments, products, etc. In depreciation it is the asset's cost that is assigned to each of the years that the asset is in use. In cost accounting it is the assigning of common production costs to various production departments, product lines, individual products, activities"}, {"url": "http://www.accountingtools.com/definition-allocation", "passage_text": "Allocation. Definition: An allocation is the process of shifting overhead costs to cost objects, using a rational basis of allotment. Allocations are most commonly used to assign costs to produced goods, which then appear in the financial statements of a business in either the cost of goods sold or the inventory asset. If financial statements are not to be distributed outside of an entity, then there is less need to use allocations."}, {"url": "https://msdn.microsoft.com/en-us/library/hh168327(v=nav.90).aspx", "passage_text": "Cost allocation. Cost allocation is a process of allocating costs to cost centers or cost objects. For example, the wage of the truck driver of the sales department is allocated to the sales department cost center. It is not necessary to allocate the wage cost to other cost centers. The allocation key is the basis that is used to allocate costs. It is typically a quantity, such as square meters occupied, number of employees, or man-hours used. For example, two departments, with 20 and 10 employees respectively, share canteen cost"}, {"url": "http://www.accountingtools.com/questions-and-answers/what-is-cost-allocation.html", "passage_text": "Cost allocation is the process of identifying, aggregating, and assigning costs to cost objects. A cost object is any activity or item for which you want to separately measure costs. Examples of cost objects are a product, a research project, a customer, a sales region, and a department. Cost allocation is also used in the calculation of profitability at the department or subsidiary level, which in turn may be used as the basis for bonuses or the funding of additional activities. Cost allocations can also be used in the derivation of transfer prices between subsidiaries. Example of Cost Allocation."}, {"url": "http://smallbusiness.chron.com/budgetary-allocation-31340.html", "passage_text": "Definition. A budget is a financial plan used to estimate revenues and expenditures for a specific period of time. It is a management and planning tool, not just an accounting document. It assists in the allocation of resources. A budget allocation is the amount of funding designated to each expenditure line"}, {"url": "http://www.accountingdetails.com/allocation_base_definition.htm", "passage_text": "Allocation Base Definition : Allocation base is a measure of activity such as direct labor-hours or machine-hours that is used to assign costs to cost objects. Back to Home Page | Back to Managerial Accounting Terms Main Page."}, {"url": "https://en.wikipedia.org/wiki/Purchase_Price_Allocation", "passage_text": "Purchase price allocation (PPA) is an application of goodwill accounting whereby one company (the acquirer), when purchasing a second company (the target), allocates the purchase price into various assets and liabilities acquired from the transaction. "}, {"url": "http://www.accountingtools.com/questions-and-answers/what-is-cost-allocation.html", "passage_text": "Cost allocation is used for financial reporting purposes, to spread costs among departments or inventory items. Cost allocation is also used in the calculation of profitability at the department or subsidiary level, which in turn may be used as the basis for bonuses or the funding of additional activities. Cost allocations can also be used in the derivation of transfer prices between subsidiaries. Example of Cost Allocation."}]