[{"url": "http://www.answers.com/Q/Where_does_corn_come_from", "passage_text": "Answer by Kent Wagoner. Confidence votes 11.5K. Where Corn Comes From Corn grows in the ground for about 95-103 days at which time it has produced an ear of new kernels (about 800 per ear)which is then harvested to either be ground into food, fed to cattle or used in renewable fuels such as ethanol."}, {"url": "http://superbeefy.com/where-did-corn-come-from/", "passage_text": "Corn is the second most widely grown crop on earth today, after wheat, and in the United States it’s the largest crop. But no one in Europe knew about corn until Columbus sailed for the New World. Corn probably first grew in Central America and, by at least 2000 B.C., was cultivated by the Indians in North America."}, {"url": "http://www2.palomar.edu/users/scrouthamel/maize.htm", "passage_text": "In parts of Africa, India, and China maize continues to fit between various ecological niches. It was combinations of plants from around the world that bolstered economies and resulted in exponential population growth. In Europe maize is combined with wheat, barley, cabbage, beets, and the potato."}, {"url": "http://recipes.howstuffworks.com/food-facts/question93.htm", "passage_text": "Corn starch comes from the starchy part of the corn. You are right that corn contains no syrup directly -- the syrup is made from the starch. In the article How Food Works, you learn about starch. Starch is a long-chain carbohydrate -- a polysaccharide."}, {"url": "http://www.answers.com/Q/What_country_does_corn_come_from", "passage_text": "Where Corn Comes From Corn grows in the ground for about 95-103 days at which time it has produced an ear of new kernels (about 800 per ear)which is then harvested to either b … e ground into food, fed to cattle or used in renewable fuels such as ethanol."}, {"url": "http://www2.palomar.edu/users/scrouthamel/maize.htm", "passage_text": "American corn or more properly maize is a grass (Podacae) that was domesticated 5,000-7,000 years ago by Native American people in the Tehuacan Valley in the state of Puebla, Mexico. The word corn comes from an English word that means any hard kern el or grain and in some texts does not refer to 'Indian corn' or maize."}, {"url": "http://www.soyatech.com/corn_facts.htm", "passage_text": "In 2005, the U.S. produced 42 percent of the world’s corn. Over 50 percent of the U.S. crop is produced in Iowa, Minnesota, Nebraska or Illinois. Other states in which corn is grown include Kentucky, Ohio, Indiana, Wisconsin, South Dakota, Wisconsin and Missouri."}, {"url": "http://www.nativetech.org/cornhusk/cornhusk.html", "passage_text": "Evolution of Maize Agriculture Corn or maize (zea mays) is a domesticated plant of the Americas. Along with many other indigenous plants like beans, squash, melons, tobacco, and roots such as Jerusalem artichoke, European colonists in America quickly adopted maize agriculture from Native Americans."}, {"url": "http://recipes.howstuffworks.com/food-facts/question93.htm", "passage_text": "With some grains and nuts it is very easy to see where the oil comes from. For example, if you squeeze a sesame seed or a sunflower seed between two sheets of paper, you can see the oil. Corn isn't quite that oily, but it does contain oil."}]