[{"url": "http://www.wikihow.com/Define-Love", "passage_text": "1. Define love by thinking of what it means to you. If you want, be bold and write down the feelings and thoughts you have about love. The dictionary defines love in several ways in which we use the word."}, {"url": "http://www.urbandictionary.com/define.php?term=true%20love", "passage_text": "Love. Love is the greatest gift God ever gave man. Love is not wanting to go anywhere without her. Love is not caring what other people think about the two of you. Love is when you feel depressed and sickly when you're not with her. You feel like your life has no meaning or purpose without her. And that if she wasn't holding your hand you would float away to heaven from where she came."}, {"url": "http://www.brainyquote.com/words/lo/love186056.html", "passage_text": "Love. 1  A feeling of strong attachment induced by that which delights or commands admiration; preeminent kindness or devotion to another; affection; tenderness; as, the love of brothers and sisters. 2  Especially, devoted attachment to, or tender or passionate affection for, one of the opposite sex."}, {"url": "http://www.godandscience.org/love/what_is_love.html", "passage_text": "Introduction. The true meaning of love, as defined in the Bible, has been corrupted in the common usage of our English language and society. Most often, love is confused with infatuation-that elated, high feeling we get when we fall in love.."}, {"url": "http://www.liveinthemoment.org/what-is-the-meaning-of-love/", "passage_text": "To understand what is the meaning of love, we really need to understand what prevents us from loving. When we believe our judgments about someone, we can feel anger, disappointment, or resentment, or we can just feel separate from that person."}, {"url": "https://www.brainpickings.org/2013/01/01/what-is-love/", "passage_text": "Love, n. A temporary insanity curable by marriage. Love has nothing to do with what you are expecting to get — only with what you are expecting to give — which is everything. Of all forms of caution, caution in love is perhaps the most fatal to true happiness."}, {"url": "http://canyoudefinelove.com/", "passage_text": "Right when you thought you’d be able to define love, then you may have not experienced it. Love often comes not by choice, it just tends to happen. And then you start to wonder what it is. But then again, you may love over and over again, but love may look and feel different every other time."}]