[{"url": "http://orthoinfo.aaos.org/topic.cfm?topic=A00193", "passage_text": "Frostbite. Frostbite is an injury to the body's tissues caused by exposure to very cold temperatures. The nose, cheeks, ears, fingers, and toes are the extremities most commonly affected. The condition results in a loss of feeling and color in the affected area and can cause permanent tissue damage. In severe cases, frostbite can lead to amputation of the extremity."}, {"url": "http://www.symptomfind.com/health/treatment-for-frostbite/", "passage_text": "Frostbite can cause permanent nerve and tissue damage if proper medical treatment does not take place immediately. In turn, if the damaged nerves and tissues are not taken care of, it can lead to infections and more serious necrotic medical conditions that may need amputation. "}, {"url": "https://en.wikipedia.org/wiki/Frostbite", "passage_text": "Frostbite is the medical condition in which localized damage is caused to skin and other tissues due to freezing. Frostbite is most likely to happen in body parts farthest from the heart and those with large exposed areas. The initial stages of frostbite are sometimes called frostnip. The several classifications for tissue damage caused by extreme cold include: 1  Frostnip is a superficial cooling of tissues without cellular destruction. 2  Chilblains are superficial ulcers of the skin that occur when a predisposed individual is repeatedly exposed to cold."}, {"url": "http://www.mckinley.illinois.edu/Handouts/frostbite/frostbite.html", "passage_text": "More severe frostbite will result in blisters filled with clear or milky fluid. This indicates a very serious condition. Very severe frostbite may cause gangrene (blackened, dead tissue), and damage to deep structures such as tendons, muscles, nerves, and bone, with resultant loss of tissue."}, {"url": "http://www.lifescript.com/health/centers/pain/related_conditions/frostbite.aspx", "passage_text": "Causes. Frostbite happens when skin is exposed to freezing temperatures. This can cause the body tissue to freeze. Ice crystals actually form within the frozen body part. Blood cannot flow adequately through the frozen tissue. This causes the frozen tissue to be deprived of blood and oxygen"}, {"url": "http://www.webmd.com/first-aid/understanding-frostbite-basics", "passage_text": "However, if severe frostbite occurs, permanent damage is possible depending on how long and how deeply the tissue was frozen. In severe cases, blood flow to the area may stop, and blood vessels, muscles, nerves, tendons, and bones may be permanently damaged. A. Frostbite refers to the freezing of body tissue (usually skin) that results when the blood vessels contract, reducing blood flow and oxygen to the affected body parts. Normal sensation is lost, and color changes also occur in these tissues"}, {"url": "http://www.nhs.uk/Conditions/Frostbite/Pages/Introduction.aspx", "passage_text": "Introduction. Frostbite is damage to skin and tissue caused by exposure to freezing temperatures – typically any temperature below minus 0.55C (31F). Frostbite can affect any part of your body. However, the extremities, such as the hands, feet, ears, nose and lips are most likely to be affected. In severe cases of frostbite, the loss of blood supply to the tissue may cause it to die (gangrene). A type of surgery called debridement may be needed to remove the dead tissue. In very severe cases, amputation may be needed."}, {"url": "http://patient.info/health/frostbite-leaflet", "passage_text": "Frostbite is an injury that is caused by exposure of parts of the body to the cold. The cold causes freezing of your skin and underlying tissues. Your fingers, toes and feet are most commonly affected. There are different degrees of frostbite. In superficial frostbite, the skin can recover fully with prompt treatment. However, if frostbite is deep, tissue damage can be permanent and tissue loss can occur. For example, the end of a finger or toe can gradually separate off. Sometimes surgery is needed to remove dead tissue. Surgical removal (amputation) of, for example, fingers or toes may be needed."}]