[{"url": "http://travelblog.viator.com/top-10-characteristics-of-a-great-tour-guide/", "passage_text": "4. Knowledgeable. A great tour guide has fun, too! A good tour guide has an in-depth knowledge of the site, its history and importance. A great tour guide has a passion for their subject and can convey their enthusiasm to the group. Such passion can be contagious and inspiring, and make the site really come alive. A great tour guide makes history come alive. In order to get the most out of a visit to a significant site, it all comes down to information and communication – in other words, the quality of your tour guide. Here are our top 10 essentials for a great"}, {"url": "http://www.mycreativetours.com/good-tour-guide.php", "passage_text": "If you are part of european tour guides associations or of private tour guides group in Australia, or want to create your own independent city sightseeing tours in U.S., or you know languages and want to be english speaking tour guide, or want to show what only native guides can, then this is the place for you. "}, {"url": "http://www.wikihow.com/Become-a-Tour-Guide", "passage_text": "1 Your tour guide certificate will look good on a resume, but the job you're applying for demands good people skills. 2  This is your chance to demonstrate those skills. 3  It is also the first impression your potential employer will have of you. 1 Take a training course on first aid and CPR. 2  Depending on the job you land, this may not be necessary, but as a tour guide you will need to know what to do in emergency situations."}, {"url": "http://www.jobmonkey.com/landtours/develop_skills/", "passage_text": "Great Organizational and Leadership Skills. Being organized is a skill that many people neglect to mention when you want to become a tour guide. Developing this skill is one that will make your job easier and that will stand you in good stead for the rest of your career. One tour manager pointed out: “You can’t do this job if you don’t like people. You have to love and care about people, enjoy their company, and get on with everyone. That is the nature of the job.”. People skills are at the fore of the touring industry as you will be working with all kinds of people every day."}, {"url": "http://www.jobmonkey.com/landtours/develop_skills/", "passage_text": "Remember this is probably the first time, they have ever seen these attractions, so your job is to be excited with them, and make them feel comfortable. Here are some of the most important skills that you need to have and develop if you want to become a top tour guide. One tour manager pointed out: “You can’t do this job if you don’t like people. You have to love and care about people, enjoy their company, and get on with everyone. That is the nature of the job.”. People skills are at the fore of the touring industry as you will be working with all kinds of people every day."}, {"url": "http://www.academicinvest.com/arts-careers/linguistics-careers/how-to-become-a-tour-guide", "passage_text": "Tour Guide Job Description. Tour guides are responsible for escorting individuals and groups of people on tours. They must find out about the groups and individuals they will be guiding in order to select points of interest and provide commentary that is appropriate for their age and interests. Tour Guide Salary. The salary level for tour guides can vary greatly depending on a number of factors, such as their level of experience, where they work. Tour Guide salary Canada: According to Service Canada, Canadian workers in the Tour and Travel Guides occupation group earn $30,060 per year."}, {"url": "http://matadornetwork.com/notebook/tour-guide-the-right-job-for-you/", "passage_text": "The skills of a tour guide and leader, though are usually required by most companies. Generally speaking, tour guides are expected to know a city (or country) intimately and offer guests interpretive information such as history and anecdotes on all sites. "}, {"url": "http://www.jobmonkey.com/landtours/develop_skills/", "passage_text": "When speaking to former tour guides and tour directors who are in charge of hiring new guides, they consider the most important factor above all others, to be the ability to get on well with people. One tour manager pointed out: “You can’t do this job if you don’t like people. You have to love and care about people, enjoy their company, and get on with everyone. That is the nature of the job.”. People skills are at the fore of the touring industry as you will be working with all kinds of people every day."}, {"url": "https://nationalcareersservice.direct.gov.uk/advice/planning/jobprofiles/Pages/touristguide.aspx", "passage_text": "Variable. Tourist guides show visitors around places of interest, such as towns and cities, historic buildings, gardens, religious sites or museums and art galleries. You will need excellent communication skills in this job. You will also need to have a good memory for facts, figures and events. 1 Level 3: route flexibility – the ability to work in two different environments such as a walk in a city and then a visit to a heritage site or visitor attraction. 2  Level 4: Blue Badge in Tourist Guiding – route flexibility, the ability to guide around a wider geographical area, tour planning and management skills."}]