[{"url": "http://www.federalreserve.gov/pubs/check21/consumer_guide.htm", "passage_text": "The account agreement you have with your bank governs whether you receive canceled checks with your account statements. If you currently get canceled checks back with your statements, you will continue to receive your checks unless your bank notifies you that it is changing your account agreement. Be sure you have enough money in your account to cover the checks that you write. Always review your account statement to make sure the charges are correct. If you receive something other than a substitute check, be aware of your rights to resolve errors under other state and federal laws."}, {"url": "https://www.wellsfargo.com/help/faqs/order-checks", "passage_text": "For checks that have posted to your account, you can view a check image online or order a paper copy (or select the Check or Draft link in the Request Copies section of the Account Services page if you’re already signed on). Wells Fargo customers can order Checks online or in person. 1  For checks valued up to $2,000 each, order Official Bank Checks online (or select the Order Official Bank Checks link on the Account Services page if you hav"}, {"url": "http://money.howstuffworks.com/personal-finance/online-banking/money-order-online.htm", "passage_text": "The ability to send a money order online is still a relatively new development, and most major banks and financial institutions don't yet to offer the service. There are a few companies, however, that will allow you to use the Internet to purchase money orders. Regular money orders can be bought at your local grocery store, bank or post office. There are some limitations to paper money orders, but they're easily worked around. For example, the amount can't exceed $1,000, but you can buy more than one at a time."}, {"url": "https://www.wellsfargo.com/help/faqs/order-checks", "passage_text": "1 For checks valued up to $2,000 each, order Official Bank Checks online (or select the Order Official Bank Checks link on the Account Services page if you have already signed on). 2  For Personal Money Orders, and Cashier's Checks, visit a Wells Fargo location near you. Wells Fargo customers can order Checks online or in person. 1 "}, {"url": "http://ohmyapt.apartmentratings.com/the-best-way-to-pay-rent-personal-check-cashiers-check-or-money-order.html", "passage_text": "It may also be difficult and time consuming to purchase a money order. Finally, there are often limits on the amount of funds each check can present, such as $500.00 or $1,000.00. In this instance you will have to purchase multiple checks should your rent be more than the amount you can purchase in an individual check. There are several different options to use to pay rent. Whether you choose to pay by personal or cashier’s check or money order, the most important thing is that you pay timely. It is possible to use one or a combination of these methods to pay your rent obligations. Personal C"}, {"url": "http://ohmyapt.apartmentratings.com/the-best-way-to-pay-rent-personal-check-cashiers-check-or-money-order.html", "passage_text": "A cashier’s check is a check drawn by a bank on the bank’s account. To obtain such a check, the customer must have either cash or make a check payable to the bank and in return the bank will draw a check in their name. This means that it will be the banks’ name instead of your own appearing on the bottom of the check. There are several different options to use to pay rent. Whether you choose to pay by personal or cashier’s check or money order, the most important thing is that you pay timely. It is possible to use one or a combination of these methods to pay your rent obligations. Personal C"}, {"url": "http://www.wikihow.com/Get-a-Money-Order", "passage_text": "Ad. 2. Go to your bank. If you have a bank account, the easiest way to obtain a money order is to go to the teller and ask for one. 1  Some banks may charge a small fee, but many offer money orders for free. 2  Some banks offer cashier's checks, which are similar to money orders. Money orders are used in lieu of checks or cash when you need to make a payment. Unlike checks, money orders can never bounce, making them a safer option for parties requiring large payments for rent or expensive items."}, {"url": "http://www.wikihow.com/Get-a-Money-Order", "passage_text": "1 Some banks offer cashier's checks, which are similar to money orders. 2  Make sure the recipient will accept a cashier's check before buying one instead of a money order. 3  Banks offer the benefit of keeping a record of your money order purchase, which could come in handy in the event that the money order gets lost. Money orders are used in lieu of checks or cash when you need to make a payment. Unlike checks, money orders can never bounce, making them a safer option for parties requiring large payments for rent or expensive items."}]