[{"url": "http://monopoly.cdbpdx.com/", "passage_text": "AUSTRALIA DELUXE GOLD EDITION 1936 Here is a Deluxe Gold Edition Monopoly game from 1936 made in Australia by John Sands Co. This version of Monopoly was also made by Parker Brothers in the U.S., John Waddington in the U.K., Copp-Clark in Canada, and in other countries. PB immediately began selling Monopoly games using the Darrow game parts. The first games Parker Brothers made were marked TRADE MARK. About 24,000 - 25,000 of these were maunfactured. This included a small number of the No 9 long box, very rare today."}, {"url": "https://en.wikipedia.org/wiki/History_of_the_board_game_Monopoly", "passage_text": "By 1933, a board game had been created much like the version of Monopoly sold by Parker Brothers and its related companies through the rest of the 20th century, and into the 21st. Several people, mostly in the Midwestern United States and near the East Coast, contributed to the game's design and evolution. Also in the 1970s, Professor Ralph Anspach, who had himself published a board game intended to illustrate the principles of both monopolies and trust busting, fought Parker Brothers and its then parent company, General Mills, over the copyright and trademarks of the Monopoly board game."}, {"url": "http://monopoly.wikia.com/wiki/Tokens", "passage_text": "Tokens are the playing pieces used in the Monopoly board game. They differ depending on the edition, and the year of release of an edition. Standard editions, however different they are, usually use pewter tokens. In 1998, a new piece was voted on to be added to the existing 10. "}, {"url": "http://allaboutfunandgames.com/the-history-of-monopoly-game-tokens", "passage_text": "The first Monopoly game tokens, produced by Parker Brothers in 1935, were the thimble, ship, shoe, hat, cannon, and iron. These tiny game pieces were made of metal. Curiously, a few of the earliest tokens have been discovered to consist of a small hole. Charles Darrow, designer of Monopoly and who originally sold homemade games himself in 1933, decided to leave the choice of token entirely up to the player. In the book, Timeless Toys by Tim Walsh, Walsh shares that the directions for Darrow’s game simply state, “ See that each player is provided with some token."}, {"url": "https://en.wikipedia.org/wiki/Monopoly_(game)", "passage_text": "1 Business, a Monopoly-like game not associated with Hasbro. 2  In this version the properties to be bought are cities of India; Chance and Community Chest reference lists of results printed in the center of the board, keyed to the dice roll; and money is represented by counters, not paper. Subtitled The Fast-Dealing Property Trading Game, the game is named after the economic concept of monopoly —the domination of a market by a single entity. It is now produced by the United States game and toy company Hasbro."}, {"url": "http://www.forevergeek.com/2013/07/my-monopoly-game-is-better-than-yours-18-homemade-monopoly-board-games/", "passage_text": "Along with each board, we’ve included a sampling of the kinds of game spaces used. Click the images to see larger-scale versions, but in most cases, if you follow the artist’s link, you’ll find even bigger versions that can be used to print out and create your own real-life board. "}, {"url": "http://monopoly.cdbpdx.com/", "passage_text": "The 'Patent Pending' game was Parker Brothers next version of Monopoly, made after the 'Trade Mark' games. Parker Brothers applied for a patent and added this to the games. By this time, Parker Brothers realised the game was going to be a hit so production was ramped up considerably. PB immediately began selling Monopoly games using the Darrow game parts. The first games Parker Brothers made were marked TRADE MARK. About 24,000 - 25,000 of these were maunfactured. This included a small number of the No 9 long box, very rare today."}, {"url": "http://monopoly.cdbpdx.com/", "passage_text": "In 1935, Parker Brothers (PB) bought the rights to Monopoly from the 'inventor', Charles Darrow. This included Darrow's inventory of game parts. PB immediately began selling Monopoly games using the Darrow game parts. The first games Parker Brothers made were marked TRADE MARK. About 24,000 - 25,000 of these were maunfactured. This included a small number of the No 9 long box, very rare today."}, {"url": "http://inventors.about.com/library/weekly/aa121997.htm", "passage_text": "Darrow accepted and permitted Parker Brothers to develop a shorter variation of the game, added as an option to the rules. The royalties from Monopoly made Charles Darrow a millionaire, the first game inventor to make that much money. In 1970, a few years after Darrow's death, Atlantic City erected a commemorative plaque in his honor. "}]