[{"url": "http://www.webmd.com/sleep-disorders/features/sleep-hygiene", "passage_text": "From having occasional difficulty sleeping to insomnia, there is a lot you can do to get a better night's sleep, feel refreshed when you awake, and remain alert throughout the day. It's called  sleep hygiene and refers to those practices, habits, and environmental factors that are critically important for sound sleep."}, {"url": "http://wellnessmama.com/4936/improve-sleep-naturally/", "passage_text": "1 Healthy Fats – such as coconut oil, organic and pasture raised meats, eggs, avocado and butter all help provide your body with the necessary building blocks to manufacture sleep hormones. 2  High Antioxidant Foods – Also important for hormone production and removal of toxins that can impede sleep."}, {"url": "http://eatlocalgrown.com/article/12371-how-to-improve-sleep-naturally.html", "passage_text": "To help improve your chances of quality sleep, these are the best foods to consume: 1  Healthy Fats-such as coconut oil, organic and pasture raised meats, eggs, avocado and butter all help provide your body with the necessary building blocks to manufacture sleep hormones."}, {"url": "http://wellnessmama.com/4936/improve-sleep-naturally/", "passage_text": "To help improve your chances of quality sleep, these are the best foods to consume: 1  Healthy Fats – such as coconut oil, organic and pasture raised meats, eggs, avocado and butter all help provide your body with the necessary building blocks to manufacture sleep hormones."}, {"url": "http://www.mayoclinic.org/healthy-lifestyle/adult-health/in-depth/sleep/art-20048379", "passage_text": "1. Stick to a sleep schedule. Go to bed and get up at the same time every day, even on weekends, holidays and days off. Being consistent reinforces your body's sleep-wake cycle and helps promote better sleep at night. There's a caveat, though. If you don't fall asleep within about 15 minutes, get up and do something relaxing."}, {"url": "http://www.healthextremist.com/have-trouble-sleeping-naturally-increase-melatonin-and-sleep-better/", "passage_text": "With these simple tips you can naturally increase melatonin and should be able to get a better night’s sleep. 1. Go to Sleep Early – Make sure to get a full night’s sleep in order to allow your body to go through all sleep stages and to not disrupt circadian rhythm."}]