[{"url": "https://answers.yahoo.com/question/index?qid=20091105192439AAXFeJ2", "passage_text": "Best Answer: Silicon is the fourteenth element of the periodic table and is a Group IVA element, along with carbon germanium, tin and lead. Pure silicon is a dark gray solid with the same crystalline structure as diamond. Its chemical and physical properties are similar to this material. Silicon has a melting point of 2570° F (1410° C), a boiling point of 4271° F (2355° C), and a density of 2.33 g/cm3. Source(s): http://en.wikipedia.org/wiki/Silicon. "}, {"url": "http://education.seattlepi.com/temperature-needed-turn-silicon-glass-3715.html", "passage_text": "Sand is the compound silicon dioxide, and at temperatures of around 1,760 degrees Celsius (3,200 degrees Fahrenheit), it melts to create a form of glass called quartz. Pure silicon melts at 1,414 degrees Celsius (2,577 degrees Fahrenheit), but glassmakers use sand rather than pure silicon. "}, {"url": "http://www.answers.com/Q/At_what_temperature_does_silicone_melt", "passage_text": "The melting point of the element, silicon, is about:  Melting Point: 1687 K (1414°C or 2577°F)  Boiling Point: 3538 K (3265°C or 5909°F)  Resource: http://education.jla … b.org/itselemental/ele014.html  You can find the freezing point of the element there as well.  Thank you. :}. 1 person found this useful. Melting temperature is the point where a substance is reduced to a liquid (this is the state it changes to). the usual melting point of substances is 100 degrees or higher."}, {"url": "https://en.wikipedia.org/wiki/Silicon", "passage_text": "Silicon is a solid at room temperature, with relatively high melting and boiling points of 1414 and 3265 °C, respectively. Like water, it has a greater density in a liquid state than in a solid state, and so, like water but unlike most substances, it does not contract when it freezes, but expands. Measured by mass, silicon makes up 27.7% of the Earth's crust and is the second most abundant element in the crust, with only oxygen having a greater abundance. Silicon is usually found in the form of complex silicate minerals, and less often as silicon dioxide (silica, a major component of common sand)."}, {"url": "https://en.wikipedia.org/wiki/Silicone_rubber", "passage_text": "Silicone rubber is an elastomer (rubber-like material) composed of silicone —itself a polymer —containing silicon together with carbon, hydrogen, and oxygen. Silicone rubbers are widely used in industry, and there are multiple formulations. Silicone rubbers are often one-or two-part polymers, and may contain fillers to improve properties or reduce cost. Silicone rubber is generally non-reactive, stable, and resistant to extreme environments and temperatures from -55 °C to +300 °C while still maintaining its useful properties."}, {"url": "https://en.wikipedia.org/wiki/Silicon", "passage_text": "Silicon is a chemical element with symbol Si and atomic number 14. It is a tetravalent metalloid, more reactive than germanium, the metalloid directly below it in the table. Controversy about silicon's character dates to its discovery; it was first prepared and characterized in pure form in 1823. Measured by mass, silicon makes up 27.7% of the Earth's crust and is the second most abundant element in the crust, with only oxygen having a greater abundance. Silicon is usually found in the form of complex silicate minerals, and less often as silicon dioxide (silica, a major component of common sand)."}, {"url": "http://www.answers.com/Q/What_temperature_does_silicon_melt_and_boil_at", "passage_text": "Gold boils at 2807.0°C or 5084.6 F °and its melting point 1064.43 C° or 1947.9741 F°.  For gold to evaporat … e, it would take EXTREME HEAT TO DO THAT, and to my  knowledge, it would be impossible to do that with out a heat source of great  magnitude........ 1948 degrees 1948 degrees F is equal to 1064.44 degrees C     Gold melts at the temperature of i060 degrees C 1064.18 °C OR 1947.52 °F when it is heated to high temperatures. Gold melts at 1 948.316 degrees Fahrenheit. + 22 others found this useful. Austin Cutler."}, {"url": "http://www.answers.com/Q/What_temperature_does_silicon_melt_and_boil_at", "passage_text": "Answered by The Community. Making the world better, one answer at a time. Silicon melts at 1,414 degrees Celsius (2,577.2 degrees Fahrenheit). Silicon boils at 2,900 degrees Celsius (5,252 degrees Fahrenheit). 1948 degrees 1948 degrees F is equal to 1064.44 degrees C     Gold melts at the temperature of i060 degrees C 1064.18 °C OR 1947.52 °F when it is heated to high temperatures. Gold melts at 1 948.316 degrees Fahrenheit. + 22 others found this useful. Austin Cutler."}]