[{"url": "http://www.thefreedictionary.com/professional+association", "passage_text": "professional association-an association of practitioners of a given profession. association-a formal organization of people or groups of people; he joined the Modern Language Association. "}, {"url": "http://definitions.uslegal.com/b/business-associations/", "passage_text": "Business associations are membership organizations engaged in promoting the business interests of their members. Associations can be a positive force for a small business. Many join local or regional chambers of commerce as a means of providing health insurance to their employees. But all associations are not created equal."}, {"url": "http://www.merriam-webster.com/dictionary/organization", "passage_text": "Tweet. : a company, business, club, etc., that is formed for a particular purpose. : the act or process of putting the different parts of something in a certain order so that they can be found or used easily. : the act or process of planning and arranging the different parts of an event or activity. Full Definition of ORGANIZATION. 1. a: the act or process of organizing or of being organized b: the condition or manner of being organized. 2."}, {"url": "http://definitions.uslegal.com/b/business-associations/", "passage_text": "Large firms have long been active participants in business associations, using the organization to advance their goals in a wide range of areas, from regulatory issues to research to industry image improvement. Associations can be a positive force for a small business. Many join local or regional chambers of commerce as a means of providing health insurance to their employees. But all associations are not created equal."}, {"url": "http://www.merriam-webster.com/dictionary/association", "passage_text": "Medical Definition of ASSOCIATION. 1. : the act of associating. 2. : something linked in memory or imagination with a thing or person. 3. : the process of forming mental connections or bonds between sensations, ideas, or memories. 4. : an organization of persons having a common interest: society. 3. : something linked in memory or imagination with a thing or person. 4"}, {"url": "http://www.merriam-webster.com/dictionary/association", "passage_text": "Full Definition of ASSOCIATION. 1. a: the act of associating b: the state of being associated: combination, relationship. 2. : an organization of persons having a common interest: society. 3. : something linked in memory or imagination with a thing or person. 4. : the process of forming mental connections or bonds between sensations, ideas, or memories."}, {"url": "https://en.wikipedia.org/wiki/Professional_association", "passage_text": "A particular feature of inter-professional associations is that the membership is made up of associations that represent the individual chain professions. This is in contrast, for example, to commodity associations in the United States where membership is largely of individuals and companies. Many professional bodies are involved in the development and monitoring of professional educational programs, and the updating of skills, and thus perform professional certification to indicate that a person possesses qualifications in the subject area."}, {"url": "http://definitions.uslegal.com/p/professional-association/", "passage_text": "Professional Association Law & Legal Definition. A professional association is a term used to describe a business that serves a single profession and requires a significant amount of education, training, or experience or a license or certificate from a state or private authority to practice the profession."}, {"url": "https://en.wikipedia.org/wiki/Professional_association", "passage_text": "(July 2015). A professional association (also called a professional body, professional organization, or professional society) is usually a nonprofit organization seeking to further a particular profession, the interests of individuals engaged in that profession and the public interest. Many professional bodies are involved in the development and monitoring of professional educational programs, and the updating of skills, and thus perform professional certification to indicate that a person possesses qualifications in the subject area."}]