[{"url": "http://www.wikihow.com/Make-Asparagus-Wrapped-in-Bacon", "passage_text": "Tips. 1  You can use thick asparagus stalks or thin; just be sure to lessen the cooking time if they're thin and add a minute or so if they're thicker. 2  Only use fresh asparagus to make bacon wrapped asparagus. 3  Instead of bacon, you can wrap the asparagus in thinly sliced prosciutto or pancetta."}, {"url": "http://www.wikihow.com/Make-Asparagus-Wrapped-in-Bacon", "passage_text": "1 Wrap the bacon tightly around the asparagus as you roll the asparagus bundle. 2  Allow the bacon to wind its way up the asparagus but stop before you get to the tips. 3  Lay the wrapped bundles, seam side down, on a cookie sheet or other transportable flat surface. 4  Now you can either roast or grill the asparagus."}, {"url": "http://www.wikihow.com/Make-Asparagus-Wrapped-in-Bacon", "passage_text": "1 You can use thick asparagus stalks or thin; just be sure to lessen the cooking time if they're thin and add a minute or so if they're thicker. 2  Try to use asparagus that is the same thickness when making this dish. 3  Only use fresh asparagus to make bacon wrapped asparagus."}, {"url": "http://www.asimplehomecook.com/bacon-wrapped-aspargus/", "passage_text": "1 Place wrapped asparagus on heated baking sheet and drizzle or spray with olive oil and add a few grains kosher salt to each bundle. 2  Cook until bacon is crispy or asparagus is done to taste."}, {"url": "http://www.asimplehomecook.com/bacon-wrapped-aspargus/", "passage_text": "Partially cook the bacon in a microwave or skillet prior to wrapping asparagus. You will need to secure it to asparagus with toothpicks. If bacon is not cooked ahead, toothpicks may be used but the bacon will usually hold in place if you cook it with both ends on hot surface first. To cook on grill, spray wrapped asparagus with olive oil or cooking spray. Place directly on hot grill or on hot foil on grill."}, {"url": "http://www.foodnetwork.com/recipes/rachael-ray/bacon-wrapped-asparagus-bundles-recipe.html", "passage_text": "Gather that number of spears and use a slice of bacon to wrap the bundle and secure the spears together. Repeat with remaining ingredients. To grill, place bundles on hot grill and cover. Cook 10 to 12 minutes until bacon is crisp and asparagus bundles are tender."}, {"url": "http://www.kraftrecipes.com/recipes/bacon-wrapped-asparagus-bundles-123296.aspx", "passage_text": "Place bacon in single layer on paper towel-covered microwaveable plate. Microwave on HIGH 1 to 1-1/2 min. or until bacon starts to cook but is not crisp. Sprinkle with sugar. Divide asparagus into 4 small bunches. Wrap 1 bacon slice, sugar sides in, in spiral-fashion around each asparagus bundle. Place on rack of foil-covered broiler pan."}]