[{"url": "http://www.healthcareworkersalary.com/physicians/neurosurgeon-salary/", "passage_text": "In the United Kingdom, a neurosurgeon should expect to earn an annual average salary of about £85,000. The median salary is about £102,000 per year. The salary varies based on age and experience of the surgeon and range from £64,000 entry salary to about £100,000+ per annum. For a neurosurgeon resident in Canada, the average annual salary will be anywhere from $155,000 to $300,000 (Canadian dollar) per annum. A neurosurgeon’s average median salary in Canada is about $250,000."}, {"url": "http://www.healthcareworkersalary.com/physicians/neurosurgeon-salary/", "passage_text": "In the United States, a high paid neurosurgeon should expect to earn a salary ranging from $580,000 to $800,000+ per year. A neurosurgeon with less than 5 years of experience on the job should expect to earn about $ 412,000 per year on average. For neurosurgeons with 9 to 18 years working experience, they can expect an average neurosurgeon salary of about $500,000 per year. For a neurosurgeon resident in Canada, the average annual salary will be anywhere from $155,000 to $300,000 (Canadian dollar) per annum. A neurosurgeon’s average median salary in Canada is about $250,000."}, {"url": "http://www.payscale.com/research/US/Job=Neurological_Surgeon/Salary", "passage_text": "Neurological Surgeon Salary. (United States). Neurological Surgeons in the United States can look forward to a sizeable six-figure salary — around $300K per year on average. Medical benefits are awarded to most, and the larger part earn dental coverage. Pay by Experience Level for Neurological Surgeon. Median of all compensation (including tips, bonus, and overtime) by years of experience. Experience does not seem to be a strong driver of pay increase in this role."}, {"url": "http://www1.salary.com/Surgeon-Neurology-salary.html", "passage_text": "What is the average annual salary for Surgeon-Neurology? The annual salary for someone with the job title Surgeon-Neurology may vary depending on a number of factors including industry, company size, location, years of experience and level of education. This chart describes the expected percentage of people who perform the job of Surgeon-Neurology in the United States that make less than that annual salary."}, {"url": "http://www1.salary.com/Surgeon-Neurology-salary.html", "passage_text": "For example the median expected annual pay for a typical Surgeon-Neurology in the United States is $545,330 so 50% of the people who perform the job of Surgeon-Neurology in the United States are expected to make less than $545,330. Source: HR Reported data as of October 2015. Median $545,330. 1  Salary. This chart describes the expected percentage of people who perform the job of Surgeon-Neurology in the United States that make less than that annual salary."}, {"url": "http://www.indeed.com/salary/q-Neurological-Surgeon-Neurosurgeon-l-Eugene,-OR.html", "passage_text": "$ 89000 average neurological surgeon neurosurgeon salaries for job postings in eugene or are 4 % lower than average neurological surgeon neurosurgeon salaries for job postings nationwide "}, {"url": "http://work.chron.com/annual-salary-neurosurgeon-6734.html", "passage_text": "Experience. Experience makes a big difference in neurosurgeons' salaries. A survey conducted in 2011 by Profiles found a median starting salary of $395,000 for neurological surgeons. After six years in practice, the average salary grew to $589,500. Neurosurgery Market Watch reports that neurosurgeons six to 15 years into their profession earned a median income of $914,796. Top neurosurgeons make more than $1 million annually, according to Becker's Hospital Review.."}, {"url": "http://www.payscale.com/research/US/Job=Neurological_Surgeon/Salary", "passage_text": "Neurological Surgeons in the United States can look forward to a sizeable six-figure salary — around $300K per year on average. Pay by Experience Level for Neurological Surgeon. Median of all compensation (including tips, bonus, and overtime) by years of experience. Experience does not seem to be a strong driver of pay increase in this role."}, {"url": "http://www.healthcare-salaries.com/physicians/neurosurgeon-salary", "passage_text": "An average yearly salary for a neurosurgeon with less than 5 years of work experience is about $411,038 while a neurosurgeon with work experience ranging from between 10 to 19 years receives an annual salary of about $501,276. A median salary for a neurosurgeon averages to about 254,344 CAD per annum while a median wage is about 145 CAD per hour. A highest paid neurosurgeon receives over $294,000 CAD while a lowest paid neurosurgeon earns about $154,000 CAD per annum."}, {"url": "http://www.beckersspine.com/spine/item/24771-12-statistics-on-neurosurgeon-salary-in-2015.html", "passage_text": "Here are 12 statistics on neurosurgeon average salary based on payscale.com data. 1. The salary for neurosurgeons ranges from $99,503 to $718,747. 2. Median reported salary is $355,034. 3. The top 10 percent of neurosurgeons reported salary around $720,000. 4. The bottom 10 percent of neurosurgeons reported salary around $100,000. 5. Bonuses for neurosurgeons were reported at $248.89 to $99,378. 6."}]