[{"url": "https://www.caring.com/questions/how-much-does-cremation-cost", "passage_text": "Purchasing or renting a casket or container. Although these incidental charges can add a few hundred to a few thousand dollars to the cost of cremation, the item that's potentially the priciest is a casket, which can range from $500 for a simple wooden version to $35,000 or more for an ornate style. In a survey of Cremation Costs last year, in a Texas community near Dallas, we found the charge for a direct cremation ranged from $710 to a high of $3820, depending on which funeral home one used. What makes these numbers even more amazing is; all these funeral homes use the SAME CREMATORY and pay the same fee!"}, {"url": "http://www.cremationresource.org/cremation/what-is-the-cost-of-human-cremation.html", "passage_text": "The exact cost of human cremation depends on factors like the region, the type of cremation service you choose, the cost of casket or alternative container, price of cremation urn, the way you want to dispose of the ashes, etc. Thus, there is no standard cost of a cremation. Nevertheless, cremations are mostly cheaper than traditional burials. The prices usually start around $600–700. Yet, people spend several thousand dollars on cremation and funeral services. Funeral homes also offer direct cremation services."}, {"url": "http://www.rocketswag.com/retirement/funeral/cremation/What-Is-The-Average-Cost-For-Cremation-Services.html", "passage_text": "In the United States, nearly quarter of all corpses are cremated because cremation is seen as way of reducing the average cost of a funeral. Traditional funerals are an expensive affair with costs starting at $5,000 but the average cost for cremation services is one-fifth of that. "}, {"url": "http://www.cremation.com/learn-about-cremation/cost-of-cremation/", "passage_text": "Cost of Cremation. Cost is a factor in the growing popularity and acceptance. Understanding cremation costs can help you make a more informed decision when choosing a funeral home to serve your family. This guide is intended to help you understand the different costs that are involved when planning a cremation service. The first step is to understand the basic “types” of cremation service. "}, {"url": "http://www.tridentsociety.com/cremation-costs", "passage_text": "California Cremation Costs. The average cost of cremation is a fraction of funeral and burial costs in California, less than a quarter of the $10,000+ cost of an average funeral and burial. With cremation, there is no need to embalm or to purchase a cemetery plot, casket, burial vault, or gravestone. "}, {"url": "https://www.caring.com/questions/how-much-does-cremation-cost", "passage_text": "Here in Virginia, for instance, a direct cremation ranges from a low of $1145 to a high of $2995 through a funeral home, but through our Cremation Society the cost is $595 and includes all the transport (within the city) and paperwork required. In a survey of Cremation Costs last year, in a Texas community near Dallas, we found the charge for a direct cremation ranged from $710 to a high of $3820, depending on which funeral home one used. What makes these numbers even more amazing is; all these funeral homes use the SAME CREMATORY and pay the same fee!"}, {"url": "http://www.us-funerals.com/funeral-articles/what-is-the-average-cost-of-a-cremation-in-the-us.html", "passage_text": "Cremation Packages average prices to expect. The average price of a direct cremation generally varies between $495 and $1,500. This cost varies between areas. In Miami, Las Vegas and Phoenix you can arrange a direct cremation for as little as $495 - $580. However, in most metro areas across the U.S. a direct cremation costs between $795 and $1,200. Cremation Packages average prices to expect Many funeral homes and crematories offer cremation packages. In a cremation package they bundle together some basic services, and the price quoted for a cremation package is an inclusive price"}, {"url": "http://personalfinance.costhelper.com/cremation.html", "passage_text": "1 Strike Funeral Homes in Minnesota estimates that cremation with a ceremony costs $2,190-$4,785, not including a casket (which start at $775). 2  Total costs also depend on the disposition of the ashes after cremation. 3  See How Much Do Cremation Urns Cost and How Much Does Spreading Ashes Cost. 1 The body must be in a container when it is cremated. 2  A simple unlined and unfinished container or casket starts around $20-$250; cardboard or softwood caskets covered with fabric cost $200-$1,000; and a hardwood casket can be $1,200-$8,000. 3  See How Much Does a Casket or Coffin Cost."}, {"url": "https://www.caring.com/questions/how-much-does-cremation-cost", "passage_text": "The cost of cremation typically ranges from $2,000 to $4,000 if arranged through a funeral home and from $1,500 to $3,000 if arranged directly through a crematory. In a survey of Cremation Costs last year, in a Texas community near Dallas, we found the charge for a direct cremation ranged from $710 to a high of $3820, depending on which funeral home one used. What makes these numbers even more amazing is; all these funeral homes use the SAME CREMATORY and pay the same fee!"}, {"url": "http://personalfinance.costhelper.com/cremation.html", "passage_text": "1 Embalming is not required with cremation unless the body will be on display, or if there will be a long delay between death and cremation. 2  If embalming is done, it can cost $200-$700 or more. 3  See How Much Does Embalming Cost. 4  The body must be in a container when it is cremated. 1 The body must be in a container when it is cremated. 2  A simple unlined and unfinished container or casket starts around $20-$250; cardboard or softwood caskets covered with fabric cost $200-$1,000; and a hardwood casket can be $1,200-$8,000. 3  See How Much Does a Casket or Coffin Cost."}]