[{"url": "http://patient.info/health/paronychia-leaflet", "passage_text": "Paronychia is a common infection of the skin just next to a nail. Treatment involves antibiotic medicines for germ (bacterial) infections or antifungal medicine for infection caused by a yeast (candida) or a fungus. Paronychia is an infection of the skin just next to a nail (the nail fold). The infected nail fold looks swollen, inflamed and may be tender. There may also be a small collection of pus in the swelling. The nail itself may become infected or damaged if a nail-fold infection is left untreated"}, {"url": "https://en.wikipedia.org/wiki/Paronychia", "passage_text": "1 Chronic paronychia is an infection of the folds of tissue surrounding the nail of a finger or, less commonly, a toe, lasting more than six weeks. 2  It is a nail disease prevalent in individuals whose hands or feet are subject to moist local environments, and is often due to contact dermatitis. Paronychia is often treated with antibiotics, either topical or oral. Chronic paronychia is most often caused by a yeast infection of the soft tissues around the nail but can also be traced to a bacterial infection."}, {"url": "http://www.emedicinehealth.com/paronychia_nail_infection/article_em.htm", "passage_text": "Paronychia (Nail Infection) Overview. An infection that develops along the edge of the fingernail or toenail is called a paronychia (pear-ah-NIK-ee-ah). It is the most common hand infection and, if left untreated, can progress to a more severe infection of the entire finger or toe. Medically Reviewed by a Doctor on 11/12/2014. Medical Author: "}, {"url": "http://familydoctor.org/familydoctor/en/diseases-conditions/paronychia.html", "passage_text": "Paronychia (say: “pare-oh-nick-ee-uh”) is an infection in the skin around the fingernails or toenails. It usually affects the skin at the base (cuticle) or up the sides of the nail. There are two types of paronychia: acute paronychia and chronic paronychia. "}, {"url": "https://en.wikipedia.org/wiki/Paronychia", "passage_text": "Paronychia may be divided as follows: 1  Acute paronychia is an infection of the folds of tissue surrounding the nail of a finger or, less commonly, a toe, lasting less than six weeks. 2  The infection generally starts in the paronychium at the side of the nail, with local redness, swelling, and pain. Paronychia is often treated with antibiotics, either topical or oral. Chronic paronychia is most often caused by a yeast infection of the soft tissues around the nail but can also be traced to a bacterial infection."}, {"url": "https://en.wikipedia.org/wiki/Paronychia", "passage_text": "1 Candidal paronychia is an inflammation of the nail fold produced by Candida albicans. 2  Pyogenic paronychia is an inflammation of the folds of skin surrounding the nail caused by bacteria. 3  Generally acute paronychia is a pyogenic paronychia as it is usually caused by a bacterial infection. Paronychia is often treated with antibiotics, either topical or oral. Chronic paronychia is most often caused by a yeast infection of the soft tissues around the nail but can also be traced to a bacterial infection."}, {"url": "https://en.wikipedia.org/wiki/Paronychia", "passage_text": "A paronychia (/ˌpaerəˈnɪkiə/ ; ˌpærəˈnɪkiə: greek παρωνυχία from, para around and- , onukh) nail is a nail disease that is an-often tender bacterial or fungal infection of the hand or foot where the nail and skin meet at the side or the base of a finger or. toenail Paronychia is often treated with antibiotics, either topical or oral. Chronic paronychia is most often caused by a yeast infection of the soft tissues around the nail but can also be traced to a bacterial infection."}, {"url": "http://www.webmd.boots.com/skin-problems-and-treatments/guide/paronychia-nail-infection", "passage_text": "Paronychia causes. A paronychia is most often caused by common skin bacteria entering the skin around the nail that has been damaged by trauma, such as nail biting, finger sucking, dishwashing, or chemical irritants. Fungus can also be a cause of paronychia formation, especially in people with recurrent infection. "}, {"url": "http://www.healthline.com/health/paronychia", "passage_text": "Overview. Paronychia is an infection of the skin around fingernails and toenails. The infection can be caused by bacteria, a fungus, or a type of yeast (candida). It may also be a result of a combination of the three infecting agents. An acute infection is typically caused by a bacterial agent that is introduced to the area around the nail by some type of trauma. This can be from biting at the nails or hangnails, puncture by manicurist tools, pushing down the cuticles too aggressively, and other similar types of injuries."}]