[{"url": "http://work.chron.com/average-beginning-teacher-salaries-1364.html", "passage_text": "National Pay Scale. According to industry website Teacher Portal, the average starting salary for teachers was $33,950 as of 2011. During the first one to four years, average pay increased to $35,873, while teachers with five to nine years of experience reported annual salaries that averaged $41,391."}, {"url": "http://work.chron.com/average-beginning-teacher-salaries-1364.html", "passage_text": "As of 2011, 20 states reported average starting salaries for teachers that were less than $30,000. First-year teachers in Oklahoma, Missouri and Nebraska averaged between $29,000 and $30,000. Mississippi, New Hampshire, South Carolina and Arkansas reported starting salaries of between $28,000 and $29,000."}, {"url": "http://www.teachersalaryinfo.com/", "passage_text": "1 Average Teacher Salary in Montana: Montana Teaching Salaries. 2  New teachers in Montana earn an average salary of $25,318, while the average pay of all teachers in the state stands at $37,770. 3  These figures rank extremely low compared to the national average, ranked 48th and 50th respectively."}, {"url": "https://rossieronline.usc.edu/teaching-salary-california", "passage_text": "In the state public school system, teacher salary in California is determined by individual school districts. According to the Sacramento Bee, the average teacher salary in 2011 was $67,871. Districts with the highest average teacher salaries in California are located near Santa Barbara, San Francisco and Los Angeles."}, {"url": "http://www.teachingdegree.org/california/salary/", "passage_text": "The average salary of a teacher in California is determined by many different factors. Therefore, it is best to view the state averages for the entry-level, mid-point, and salary offerings. An entry-level teacher’s salary starts at an average of $39,972, while the midpoint is $59,193."}, {"url": "http://www1.salary.com/High-School-Teacher-salary.html", "passage_text": "The annual salary for someone with the job title Teacher High School may vary depending on a number of factors including industry, company size, location, years of experience and level of education."}, {"url": "http://www.simplyhired.com/salaries-k-teacher-jobs.html", "passage_text": "Average Teacher Salaries. The average salary for teacher jobs is $28,000. Average teacher salaries can vary greatly due to company, location, industry, experience and benefits. This salary was calculated using the average salary for all jobs with the term teacher anywhere in the job listing."}]