[{"url": "http://www.teachpe.com/anatomy/energy_systems.php", "passage_text": "When energy is needed, ATP is broken down using an enzyme (known as ATPase) into ADP (Adenosine Diphosphate). This process breaks the high energy Phosphate (P) bond and so provides energy for use by the body. Here is the equation you may see in text books: ATP = ADP + P +Energy. The human body is also capable of resynthesising ATP to allow it to continue producing energy. To do this it must use energy to reverse the equation shown above. This is known as an endothermic reaction as it requires energy. The breakdown of ATP is called exothermic as it produces energy."}, {"url": "http://infolific.com/health-and-fitness/fitness/energy-systems-of-the-human-body/", "passage_text": "The first system is the Adenosine Triphosphate (ATP) is the immediate source for energy that is stored in muscle cells. As the phosphate is broken down (there are 3 of them for each molecule of ATP) energy is released. This system is only good for very quick and powerful movements. Then, ATP runs out and much be re-synthesized so the process can be repeated. Oxygen is not required for this to work, there are no waste products, but it is extremely short in duration. This system will last for about 0.5 minutes."}, {"url": "http://www.answers.com/Q/What_sports_use_the_atp-pc_system", "passage_text": "ATP-PC system is used for high intensity short bursts of energy such as sprinting... In netball it is used when leading for the ball or the centre driving to the circle. … it can also be used when jumping for a high pass. 1 person found this useful. The ATP-PC system neither uses oxygen nor produces lactic acid and is thus said to be alactic anae … robic. This is the primary system behind very short, powerful movements like a golf swing or a 100m sprint."}, {"url": "http://ironman.memorialhermann.org/performance-improvement/sports-science/nutrition/how-the-body-uses-energy/", "passage_text": "Energy System 1: Ready fuel for immediate energy. The Immediate Energy system, or ATP-PC, is the system the body uses to generate immediate energy. The energy source, phosphocreatine (PC), is stored within the tissues of the body. When exercise is done and energy is expended, PC is used to replenish ATP. "}, {"url": "http://www.ideafit.com/fitness-library/the-three-metabolic-energy-systems", "passage_text": "Since this process does not need oxygen to resynthesize ATP, it is anaerobic, or oxygen-independent. As the fastest way to resynthesize ATP, the phosphagen system is the predominant energy system used for all-out exercise lasting up to about 10 seconds. However, since there is a limited amount of stored CP and ATP in skeletal muscles, fatigue occurs rapidly. 2. Which pathway your clients use for the primary production of ATP depends on how quickly they need it and how much of it they need. Lifting heavy weights, for instance, requires energy much more quickly than jogging on the treadmill, necessitating the reliance on different energy systems."}, {"url": "http://www.teachpe.com/anatomy/energy_systems.php", "passage_text": "Aerobic Respiration, meaning 'with oxygen' which is used for long-term, steady paced exercise and day-to-day activities and Anaerobic Respiration or 'without oxygen' which produces fast bursts of energy for short, powerful bursts. The Anaerobic system can be divided into two further systems, ATP-PC and Lactic acid. ATP = ADP + P +Energy. The human body is also capable of resynthesising ATP to allow it to continue producing energy. To do this it must use energy to reverse the equation shown above. This is known as an endothermic reaction as it requires energy. The breakdown of ATP is called exothermic as it produces energy."}, {"url": "http://www.answers.com/Q/What_sports_use_the_atp-pc_system", "passage_text": "This system is used only for very short durations of up to 10 seconds. The ATP-PC system neither uses oxygen nor produces lactic acid and is thus said to be alactic anae … robic. This is the primary system behind very short, powerful movements like a golf swing or a 100m sprint."}, {"url": "http://www.ptdirect.com/training-design/anatomy-and-physiology/the-atp-pc-system", "passage_text": "The ATP-PC System. If you train any of your clients at high intensity you must understand how this energy system works. Here's a short(ish) explanation... As the name suggests the ATP-PC system consists of adenosine triphosphate (ATP) and phosphocreatine (PC). This energy system provides immediate energy through the breakdown of these stored high energy phosphates. If this energy system is 'fully stocked' it will provide energy for maximal intensity, short duration exercise for between10-15 seconds before it fatigues."}, {"url": "http://www.ptdirect.com/training-design/anatomy-and-physiology/the-atp-pc-system", "passage_text": "Think of the ATP-PC system as the V8 of your energy systems – it provides you with the most 'power' because it produces ATP more quickly than any other system and because of this it fuels all very high intensity activities. It's downfall however is that it burns out very quickly. This energy system provides immediate energy through the breakdown of these stored high energy phosphates. If this energy system is 'fully stocked' it will provide energy for maximal intensity, short duration exercise for between10-15 seconds before it fatigues."}]