[{"url": "http://www.millerah.com/sites/site-3441/documents/anaplasmosis.pdf", "passage_text": "Anaplasmosis is an infectious disease that is caused by the bacteria Anaplasma phagocytophilum or Anaplasma platys that attack the white blood cells. Anaplasma was formerly known as Ehrlichia, so you may hear this disease referred to as Ehrlichiosis. Both dogs and cats can be infected. "}, {"url": "http://www.cdc.gov/anaplasmosis/symptoms/index.html", "passage_text": "Anaplasmosis is a disease caused by the bacterium Anaplasma phagocytophilium. This pathogen is transmitted to humans by the bite of an infected tick. The black-legged tick (Ixodes scapularis) is the vector of A. phagocytophilum in the northeast and upper midwestern United States. "}, {"url": "https://en.wikipedia.org/wiki/Anaplasmosis", "passage_text": "Anaplasmosis is a disease caused by a rickettsial parasite of ruminants, Anaplasma spp. The microorganism is gram-negative and occurs in the red blood cells. It is transmitted by natural means through a number of haematophagous species of ticks. Anaplasmosis can also be transmitted iatrogenically by the use of surgical, dehorning, castration, and tattoo instruments and hypodermic needles that are not disinfected between uses. Although the term is often associated with animal infection, it is also used to describe infection in human"}, {"url": "http://www.dogsandticks.com/diseases_and_symptoms/anaplasmosis.php", "passage_text": "Canine anaplasmosis comes in two forms. Anaplasma phagocytophilum is an infection of the white blood cells that’s transmitted by the deer tick (also known as the black-legged tick) and the western black-legged tick. These are the same ticks that transmit Lyme disease, which increases the risk of coinfection with anaplasmamosis. Areas where canine anaplasmosis are more common include the northeastern, mid-Atlantic and north-central states, as well as California. A. platys, specifically, is more common in Gulf Coast and southwestern states. Find out if anaplasmosis is in your neighborhood."}, {"url": "http://www.vcahospitals.com/main/pet-health-information/article/animal-health/anaplasmosis-in-dogs/6962", "passage_text": "If a dog is diagnosed with anaplasmosis, this indicates there are infected ticks in the environment that could transmit the disease to humans, and strict tick control measures should be taken. Both Lyme disease and anaplasmosis are commonly found in the same geographic location and are transmitted by the same tick species. If your pet is showing these symptoms do not wait for symptoms to get worse. It's better to contact your local VCA Veterinarian."}, {"url": "http://www.dogsandticks.com/diseases_and_symptoms/anaplasmosis.php", "passage_text": "The other form, Anaplasma platys, is an infection of the blood platelets that can lead to bleeding disorders and is transmitted by the brown dog tick. Although these two forms of anaplasmosis present with different signs, both pose a threat to your dog’s health. Areas where canine anaplasmosis are more common include the northeastern, mid-Atlantic and north-central states, as well as California. A. platys, specifically, is more common in Gulf Coast and southwestern states. Find out if anaplasmosis is in your neighborhood."}, {"url": "http://www.vcahospitals.com/main/pet-health-information/article/animal-health/anaplasmosis-in-dogs/6962", "passage_text": "Dogs with anaplasmosis often have many of the same symptoms as those with Lyme disease, and infection with both agents (co-infection) is not uncommon. Both Lyme disease and anaplasmosis are commonly found in the same geographic location and are transmitted by the same tick species. If your pet is showing these symptoms do not wait for symptoms to get worse. It's better to contact your local VCA Veterinarian."}, {"url": "http://www.peteducation.com/article.cfm?c=2+2101&aid=3621", "passage_text": "Anaplasmosis in dogs is caused by the bacteria Anaplasma phagocytophilum. It used to be known as Ehrlichia equi and Ehrlichia phagocytophilia. The more complete name for the disease is canine granulocytic anaplasmosis.. It commonly affects the platelets in the blood, which are small cellular components found in the blood which help clots to form."}, {"url": "http://www.vcahospitals.com/main/pet-health-information/article/animal-health/anaplasmosis-in-dogs/6962", "passage_text": "Anaplasmosis is a tickborne disease caused by the infectious bacterial organism Anaplasma phagocytophilum. It is transmitted through bites of the deer tick (also known as the black-legged tick) and western black-legged tick. Both Lyme disease and anaplasmosis are commonly found in the same geographic location and are transmitted by the same tick species. If your pet is showing these symptoms do not wait for symptoms to get worse. It's better to contact your local VCA Veterinarian."}, {"url": "http://www.vcahospitals.com/main/pet-health-information/article/animal-health/anaplasmosis-in-dogs/6962", "passage_text": "The treatment for canine anaplasmosis is the same as that for other closely related tickborne infections including ehrlichiosis and Lyme disease: the antibiotic doxycycline. Many infected dogs are treated for 30 days. In the majority of cases, symptoms improve rapidly. Both Lyme disease and anaplasmosis are commonly found in the same geographic location and are transmitted by the same tick species. If your pet is showing these symptoms do not wait for symptoms to get worse. It's better to contact your local VCA Veterinarian."}]