[{"url": "https://www.medicare.gov/coverage/mammograms.html", "passage_text": "1 Screening mammogram: You pay nothing for the screening test if the doctor or other qualified health care provider accepts assignment. 2  Diagnostic mammogram: You pay 20% of the Medicare-approved amount, and the Part B deductible applies. The page could not be loaded. The Medicare.gov Home page currently does not fully support browsers with JavaScript disabled. Please note that if you choose to continue without enabling JavaScript certain functionalities on this website may not be available."}, {"url": "https://www.medicare.gov/coverage/mammograms.html", "passage_text": "Your costs in Original Medicare. 1  Screening mammogram: You pay nothing for the screening test if the doctor or other qualified health care provider accepts assignment. 2  Diagnostic mammogram: You pay 20% of the Medicare-approved amount, and the Part B deductible applies. The page could not be loaded. The Medicare.gov Home page currently does not fully support browsers with JavaScript disabled. Please note that if you choose to continue without enabling JavaScript certain functionalities on this website may not be available."}, {"url": "http://www.wpsmedicare.com/beneficiary/general_faq.shtml", "passage_text": "Women age 40 and older are eligible for a screening mammogram every 12 months. Medicare also covers one baseline mammogram for women between ages 35 and 39. Medicare does not cover screening mammograms for women younger than age 35. Medicare can also cover a diagnostic mammogram when there is a sign or symptom of breast disease."}, {"url": "http://www.factcheck.org/2013/10/aca-doesnt-restrict-mammograms/", "passage_text": "The law requires Medicare to cover a yearly mammography screening at no cost to women starting at age 40. For private insurance plans, the law also requires coverage of mammograms, with no cost-sharing, every one to two years for women starting at age 40. For seniors, this is a step up in benefits: Before the health care law, mammograms were also covered, but with 20 percent cost-sharing."}, {"url": "https://www.humana.com/health-care-reform/preventive-care-benefits", "passage_text": "Mammograms. Original Medicare covers a breast cancer screening, or mammogram, every 12 months with no cost-sharing. Diagnostic screenings are covered as medically necessary for those with Part B. Others pay 20% of the Medicare-approved amount for the doctor’s visit. 8. “Mammograms,” Medicare.gov (accessed 15 Mar. For those who are not at high risk for colorectal cancer, Medicare, covers a colonoscopy every 10 years after your last screening. If you are at high risk, you can get the test every 2 years. Out-of-pocket expenses vary depending on whether you have Original Medicare or Medicare Part B and the benefits of your plan."}, {"url": "http://www.factcheck.org/2013/10/aca-doesnt-restrict-mammograms/", "passage_text": "A: No. In fact, the law requires insurers to cover mammography, with no cost-sharing, every one to two years for women starting at age 40. Medicare fully pays for mammograms once every 12 months with no upper age limit. For private insurance plans, the law also requires coverage of mammograms, with no cost-sharing, every one to two years for women starting at age 40. For seniors, this is a step up in benefits: Before the health care law, mammograms were also covered, but with 20 percent cost-sharing."}, {"url": "http://www.cancer.org/cancer/breastcancer/moreinformation/breastcancerearlydetection/breast-cancer-early-detection-paying-for-br-ca-screening", "passage_text": "The only state without a law ensuring that private health plans cover or offer coverage for screening mammograms is Utah. Of the remaining 49 states, only 22 cover mammograms yearly for women 40 and older. The remaining 27 have less generous coverage. Coverage of mammograms for breast cancer screening is mandated by the Affordable Care Act, which provides that these be given without a co-pay or deductible in plans that started after August 1, 2012. This doesn’t apply to health plans that were in place before the law was passed (called grandfathered plans)."}, {"url": "http://www.insurancelibrary.com/medicare-insurance/does-medicare-cover-mammograms-every-year", "passage_text": "Yes, Medicare part B covers a screening every twelve months. Eleven full months have to have elapsed between screenings. A diagnostic screening can be done anytime that it is prescribed. The Affordable Care Act (Obamacare) makes a mammogram available every one to two years for any woman over the age of 40. They are a covered procedure by your insurer."}, {"url": "http://www.healthcentral.com/breast-cancer/c/question/785758/91396", "passage_text": "Mammogram screening is covered for all women with Medicare age 40 and older every 12 months. You can also get one baseline mammogram between ages 35 and 39. You pay 20% of the Medicare-approved amount with no Part B deductible. Medicare also covers new digital technologies for mammogram screenings. Medicare provides 80% coverage for a clinical breast exam once every 24 months, without Part B deductible. At this time, Medicare's cancer screening coverage information does not include MRI in addition to mammogram as a covered screening method for women who are at high risk for breast cancer."}, {"url": "https://www.medicare.gov/coverage/mammograms.html", "passage_text": "The specific amount you’ll owe may depend on several things, like other insurance you may have, how much your doctor charges, whether your doctor accepts assignment, the type of facility, and the location where you get your test, item, or service. Note. The page could not be loaded. The Medicare.gov Home page currently does not fully support browsers with JavaScript disabled. Please note that if you choose to continue without enabling JavaScript certain functionalities on this website may not be available."}]