[{"url": "https://en.wikipedia.org/wiki/Meerkat", "passage_text": "Meerkats live in all parts of the Kalahari Desert in Botswana, in much of the Namib Desert in Namibia and southwestern Angola, and in South Africa. A group of meerkats is called a mob, gang or clan. A meerkat clan often contains about 20 meerkats, but some super-families have 50 or more members. At the end of each of a meerkat's fingers is a claw used for digging burrows and digging for prey. Claws are also used with muscular hindlegs to help climb trees. Meerkats have four toes on each foot and long slender limbs. The coat is usually peppered gray, tan, or brown with silver."}, {"url": "http://meerkats.wikia.com/wiki/Meerkat", "passage_text": "10-15 years. The Meerkat (Suricata suricatta) is a small member of the mongoose family, which is part of the Feliformia (cat-like carnivores) order. They are also refered to as suricates, s lender-tailed meerkats and grey meerkats. Also, in Dutch 'kat' means cat and 'meer' means lake, and so 'meerkat' also refers to 'lake cat'. As the species are not cats nor do they occur near lakes, the word 'meerkat' is further underlined as being adapted to a misidentified animal."}, {"url": "https://en.wikipedia.org/wiki/Meerkat_(app)", "passage_text": "Meerkat is a mobile app that enables users to do live video streaming through their mobile device. Once signed up, Meerkat users have the option of connecting their Facebook and Twitter accounts, and stream directly to their followers as soon as they go live. "}, {"url": "http://animals.sandiegozoo.org/animals/meerkat", "passage_text": "Safety in numbers. A “kat” is not a “cat” when it’s a meerkat, a vital, clever, and amazing weasel-like animal that is a member of the mongoose family. Most people know meerkats from the character Timon in The Lion King animated movie. "}, {"url": "https://en.wikipedia.org/wiki/Meerkat", "passage_text": "The meerkat is a small diurnal herpestid (mongoose) weighing on average about 0.5 to 2.5 kilograms (1.1 to 5.5 lb). Its long slender body and limbs give it a body length of 35 to 50 centimetres (14 to 20 in) and an added tail length of around 25 centimetres (9.8 in). At the end of each of a meerkat's fingers is a claw used for digging burrows and digging for prey. Claws are also used with muscular hindlegs to help climb trees. Meerkats have four toes on each foot and long slender limbs. The coat is usually peppered gray, tan, or brown with silver."}, {"url": "http://gizmodo.com/what-is-meerkat-and-should-you-even-bother-1690285057", "passage_text": "Meerkat is a carnivorous mongoose native to Africa, but if you've been within 30 feet of a Twitter account the last two weeks, this little guy's name has been appropriated for something else entirely: a new iOS app, hard lined straight into Twitter, that brings live streaming to the social network. Whatever side of the fence you find yourself on, it's undeniable that Meerkat fills a need that Twitter, as of now, has left vacant. Right now, the app is an idea shoved out into the social media world with a sort of here, do what you want intention, and no one is exactly sure what to make of it."}, {"url": "https://en.wikipedia.org/wiki/Meerkat", "passage_text": "The meerkat or suricate (Suricata suricatta) is a small carnivoran belonging to the mongoose family (Herpestidae). It is the only member of the genus Suricata. At the end of each of a meerkat's fingers is a claw used for digging burrows and digging for prey. Claws are also used with muscular hindlegs to help climb trees. Meerkats have four toes on each foot and long slender limbs. The coat is usually peppered gray, tan, or brown with silver."}, {"url": "http://www.huffingtonpost.com/2015/03/15/meerkat-app_n_6872736.html", "passage_text": "Meerkat is a new video app for iOS that allows anyone to launch a live stream using their iPhone or iPad. You could think of it like FaceTime, except you're broadcasting to anyone in the world rather than just to Aunt Millicent in Denver. A quick look at the basic premise of Meerkat.(Credit: Meerkat). ADVERTISEMENT. Call it Schroedinger'schrödinger s: App you probably just heard About, meerkat and people are already saying'it s. Dead meerkat is a new video app iOS ios that allows anyone to launch a live stream using iPhone iphone iPad. ipad"}]