[{"url": "http://www.wisegeek.org/what-is-methane.htm", "passage_text": "Methane, CH4, is a chemical compound composed of one carbon atom and four hydrogen atoms. It is one of the most common gases in the universe, as well as on Earth. While it is valued for its energy-production capabilities, methane also has the ability to potentially wreak havoc on the Earth's fragile ecosystems. This gas is a type of alkane, which are compounds composed only of carbon and hydrogen atoms in various numbers. In fact, methane is the simplest form of alkane. Despite the smells that some may be tempted to associate with the gas, it is odorless and colorless."}, {"url": "http://scifun.chem.wisc.edu/chemweek/METHANE/Methane.html", "passage_text": "METHANE. Methane is a colorless, odorless gas with a wide distribution in nature. It is the principal component of natural gas, a mixture containing about 75% CH. At room temperature, methane is a gas less dense than air. It melts at 183°C and boils at 164°C. It is not very soluble in water. Methane is combustible, and mixtures of about 5 to 15 percent in air are explosive. Methane is not toxic when inhaled, but it can produce suffocation by reducing the concentration of oxygen inhaled."}, {"url": "http://www.wisegeek.com/what-is-methane-combustion.htm", "passage_text": "Top 10 amazing movie makeup transformations. Methane combustion is a chemical reaction that occurs from burning methane gas — which is an odorless and colorless fossil fuel — causing high amounts of heat and pressure to be produced. The heat and pressure that is produced from methane combustion is the energy that is used in various vehicles and machines used for personal and professional use, such as fuel burning industry machinery and hot-air balloons, as well as in Bunsen burners."}, {"url": "http://www.mnn.com/earth-matters/energy/stories/what-is-methane-and-why-should-you-care", "passage_text": "A few basics. Methane is a natural substance that can be produced over time through biological routes — that's what creates natural gas, of which methane is the primary component — through technological processes or other synthetic means. But at the same time, methane — especially as a component of natural gas — is an important fuel source, one that produces fewer greenhouse gases when it is burned than coal or oil. Methane's potential as energy. Methane is rapidly become the go-to way to power the world."}, {"url": "https://en.wikipedia.org/wiki/Ethane", "passage_text": "Ethane (/ˈɛθeɪn/ or /ˈiːθeɪn/) is an organic chemical compound with chemical formula C 2 H 6. At standard temperature and pressure, ethane is a colorless, odorless gas. Ethane is isolated on an industrial scale from natural gas, and as a byproduct of petroleum refining. "}, {"url": "http://www.merriam-webster.com/dictionary/methane", "passage_text": ": a colorless odorless flammable gaseous hydrocarbon CH4 that is a product of decomposition of organic matter and of the carbonization of coal, is used as a fuel and as a starting material in chemical synthesis, and is the simplest of the alkanes. See methane defined for English-language learners. "}, {"url": "https://en.wikipedia.org/wiki/Methane", "passage_text": "Methane (/ˈmɛθeɪn/ or /ˈmiːθeɪn/) is a chemical compound with the chemical formula CH4 (one atom of carbon and four atoms of hydrogen). Methane in the form of compressed natural gas is used as a vehicle fuel and is claimed to be more environmentally friendly than other fossil fuels such as gasoline / petrol and diesel. Research into adsorption methods of methane storage for use as an automotive fuel has been conducted."}, {"url": "https://www.dhs.wisconsin.gov/chemical/methane.htm", "passage_text": "Methane. Methane is an odorless, colorless flammable gas. It is used primarily as fuel to make heat and light. It is also used to manufacture organic chemicals. Methane can be formed by the decay of natural materials and is common in landfills, marshes, septic systems and sewers. "}]