[{"url": "https://en.wikipedia.org/wiki/Carburetor", "passage_text": "A carburetor basically consists of an open pipe through which the air passes into the inlet manifold of the engine. The pipe is in the form of a Venturi: it narrows in section and then widens again, causing the airflow to increase in speed in the narrowest part. To ensure a ready mixture, the carburetor has a float chamber (or bowl) that contains a quantity of fuel at near-atmospheric pressure, ready for use. This reservoir is constantly replenished with fuel supplied by a fuel pump."}, {"url": "http://auto.howstuffworks.com/question3771.htm", "passage_text": "1 A carburetor is essentially a tube. 2  There is an adjustable plate across the tube called the throttle plate that controls how much air can flow through the tube. 3  You can see this circular brass plate in photo 1. 4  At some point in the tube there is a narrowing, called the venturi, and in this narrowing a vacuum is created. This short video of the carburetor (5.1 MB) takes you on a quick tour of the carb. Chainsaw carburetor. Here are the parts of a carb: 1  A carburetor is essentially a tube. 2  There is an adjustable plate across the tube called the throttle plate that controls how much air can flow through the tube. 3  You can see this circular brass plate in photo 1"}, {"url": "https://en.wikipedia.org/wiki/Carburetor", "passage_text": "A carburetor (American and Canadian spelling), carburator, carburettor, or carburetter (Commonwealth spelling) is a device that blends air and fuel for an internal combustion engine. It is sometimes colloquially shortened to carb in North America or carby in Australia. To carburate or carburet (and thus carburation or carburetion, respectively) is to blend the air and fuel or to equip (an engine) with a carburetor for that purpose. Carburetors have largely been supplanted in the automotive industry by fuel injection. To ensure a ready mixture, the carburetor has a float chamber (or bowl) that contains a quantity of fuel at near-atmospheric pressure, ready for use. This reservoir is constantly replenished with fuel supplied by a fuel pump."}, {"url": "http://ask.cars.com/2007/05/what_does_a_car.html", "passage_text": "The carburetor’s replacement is the modern electronic fuel-injection system, which surpasses the carburetor in every way as a more efficient way to control your engine’s air and fuel mixture, thus improving gas mileage, emissions and drivability in any temperature. It’s a Dodge Caliber. Doose ,Palatine, Ill. Carburetors have been extinct on new cars since the early 1990s, so no, your Caliber doesn’t have one. A carburetor used to sit on top of an engine and was a mechanical device used to mix the air and fuel needed for an engine to run."}, {"url": "http://www.ehow.com/about_5082422_carburetor.html", "passage_text": "In addition to regulating the flow of fuel into a vehicle's engine, a carburetor also sucks outside air into the engine intake manifold and combines it with fuel to create a vehicle's air/fuel mixture ratio, which is the precise mixture of air and gas that an engine burns to produce power. Shares & Saves. Save. A carburetor is a critical component of vehicle engine operation. Serving as a vehicle's fuel induction system, a system responsible for creating an engine's air/fuel mixture, a carburetor helps to regulate optimum vehicle engine performance and fuel economy."}, {"url": "http://www.ehow.com/about_5082422_carburetor.html", "passage_text": "Location. A carburetor is bolted directly to the top of the engine intake manifold, which is basically a large, hollow metal tube responsible for directing an engine's air/fuel mixture into the engine combustion chambers, or engine cylinders. Shares & Saves. Save. A carburetor is a critical component of vehicle engine operation. Serving as a vehicle's fuel induction system, a system responsible for creating an engine's air/fuel mixture, a carburetor helps to regulate optimum vehicle engine performance and fuel economy."}, {"url": "http://www.nationalcarburetors.com/carburetor.html", "passage_text": "To overcome these problems other systems are used. Delivering gasoline to the carburetor Gasoline is delivered to the carburetor by the fuel pump and is stored in the fuel bowl. To keep this level of fuel stored in the bowl constant under all conditions a float system is used. A float operated needle valve and seat at the fuel inlet is used to control the fuel level in the bowl. If the fuel level drops below a certain level the float lowers and opens the valve letting more fuel in. When the float rises it pushes the inlet valve against the seat and shuts off the flow of fuel into the bowl."}, {"url": "http://www.ehow.com/about_5082422_carburetor.html", "passage_text": "Significance. A carburetor is basically a mechanical pump that serves as a vehicle's fuel induction system. For a vehicle engine to operate, a constant supply of fuel must be fed directly to the engine cylinders, where the fuel gets burned and produces engine power. Shares & Saves. Save. A carburetor is a critical component of vehicle engine operation. Serving as a vehicle's fuel induction system, a system responsible for creating an engine's air/fuel mixture, a carburetor helps to regulate optimum vehicle engine performance and fuel economy."}, {"url": "http://www.youtube.com/watch?v=oIU-lGc3DL4", "passage_text": "This video explains carburetors and the components involved. They are used to mix the fuel into the air entering the engine, and are placed just before the throttle body. The technology is old, however is still used in small engine applications such as lawnmowers, weedwackers, chainsaws, etc. "}]