[{"url": "http://sbinfocanada.about.com/od/taxdeductions/g/Personal-Services-Corporation.htm", "passage_text": "Bluntly, a designation by the Canada Revenue Agency (CRA) that you don't want, because a personal services corporation (a.k.a. personal services business) is not allowed to claim any of the standard business expenses, including the Small Business Deduction. Technically, a personal services corporation is: 1) that the person performing the services (you) or any person related to you, is a specified shareholder of the corporation (a person who owns at least 10% of the issued shares of any class of capital stock in the corporation or a related corporation, directly or indirectly, at any time of the year);"}, {"url": "http://www.wikihow.com/Qualify-As-a-Personal-Service-Corporation", "passage_text": "1 A person is an employee-owner of a personal service corporation if that person is an employee of the corporation or performs personal services for the corporation on any day during the testing period. 2  For the purposes of this test, independent contractors count as employees. 1 To qualify as a Personal Service Corporation the corporation must show that during a certain period of time the corporation’s principal activity is in providing services in the areas: health, law, engineering, architecture, accounting, actuarial science, performing arts, or consulting."}, {"url": "http://www.investopedia.com/terms/p/personal-service-activity.asp", "passage_text": "DEFINITION of 'Personal-Service Activity'. Any business enterprise with the primary purpose of providing personal services. Personal-service activities encompass a wide range of professions, including law, medicine, engineering, design, finance, accounting and even performing arts. "}, {"url": "https://en.wikipedia.org/wiki/Personal_service_corporation", "passage_text": "A person is an employee-owner of a personal service corporation if both of the following apply: 1. They are an employee of the corporation or perform personal services for, or on behalf of, the corporation (even if they are an independent contractor for other purposes) on any day of the testing period. 2. They own stock in the corporation at any time during the testing period. Its employee-owners substantially perform the services in (1). This requirement is met if more than 20% of the corporation's compensation cost for its activities of performing personal services during the testing period is for personal services performed by employee-owners. 3."}, {"url": "http://smallbusiness.chron.com/advantages-personal-service-corporation-3854.html", "passage_text": "Many doctors' office are formed as personal service corporations. operation in a process image by Andrey Kiselev from Fotolia.com. A personal service corporation, also called a professional service corporation, is a corporate entity formed by individuals who provide personal services for their clients. Examples of this type of business include doctors’ offices, law firms and accounting firm"}, {"url": "http://www.contractorcalculator.co.uk/what_is_a_personal_service_company.aspx", "passage_text": "So, by using a contractor’s limited company in a contract for services, clients are effectively highlighting that they do not have and do not wish to have an employer-employee relationship with the contractors. Many clients also choose to use agencies as yet another buffer between them and the contractor. This is where things get tricky. Because there is no clear definition in law of what actually constitutes a personal service company, HMRC often use this lack of clarity to their advantage when investigating the tax affairs of"}, {"url": "http://www.investopedia.com/terms/p/personal-service-corporation.asp", "passage_text": "BREAKING DOWN 'Personal-Service Corporation'. If you function as the owner-employee of a personal-service corporation and your primary business is related to creative/fine arts or photography, any current expenses you incur pursuant to creative work are deductible for the corporation. To be considered a personal-service corporation by the IRS, the employee-owners must perform at least 20% of the personal services themselves."}, {"url": "http://www.investopedia.com/terms/p/personal-service-corporation.asp", "passage_text": "DEFINITION of 'Personal-Service Corporation'. A corporation that is created for the purpose of providing personal services to individuals or groups. To be considered a personal-service corporation by the IRS, the employee-owners must perform at least 20% of the personal services themselves."}, {"url": "http://www.nixonwilliams.com/what-is-a-personal-service-company", "passage_text": "There is no clear definition of what a personal service company (PSC) is, though when discussing contracting, it is usually the name used to refer to the limited company director, who owns most if not all of the shares. Advantages of working through a personal service company or limited company. Contracting through a limited company comes with many advantages, some of which are listed below: 1  One of the main benefits of working through a limited company is that you may be able to increase your take home pay."}]