[{"url": "http://pmbook.ce.cmu.edu/07_Financing_of_Constructed_Facilities.html", "passage_text": "1 Suppose that an overseas constructor proposed to build the facility in Problem P7-2 at a cost of $550,000 (rather than $500,000), but would also arrange financing with a 5% issuing charge and uniform payments over a seven year period. 2  This financing is available from an export bank with a special interest rate of 9%. With an annual interest charge of 10.25% over a twenty year life time, the annual payment would be $1.076 million except in year 20 when the sum of principal and interest would be 10.5 + 1.076 = $11.576 million. The computation for this case of borrowing has been given in Example 7-2."}, {"url": "https://www.citizensadvice.org.uk/law-and-rights/legal-system/taking-legal-action/help-with-legal-costs-legal-aid/", "passage_text": "If you're worried about the cost of the phone-call, you can ask an adviser to call you back. You can text 'legalaid' and your name to 80010 and an adviser will call you back within 24 hours. The helpline has a translation service if you would like advice in a language other than English or Welsh. You can deduct your mortgage or any charges on your home, up to a maximum of £100,000. This is called mortgage disregard. You can also deduct 3% of the market value of your home (the amount for which it could be sold for on the open market) for sales costs."}, {"url": "http://pmbook.ce.cmu.edu/07_Financing_of_Constructed_Facilities.html", "passage_text": "1 Overdraft from a bank at 13% interest. 2  Suppose that an overseas constructor proposed to build the facility in Problem P7-2 at a cost of $550,000 (rather than $500,000), but would also arrange financing with a 5% issuing charge and uniform payments over a seven year period. With an annual interest charge of 10.25% over a twenty year life time, the annual payment would be $1.076 million except in year 20 when the sum of principal and interest would be 10.5 + 1.076 = $11.576 million. The computation for this case of borrowing has been given in Example 7-2."}, {"url": "http://pmbook.ce.cmu.edu/07_Financing_of_Constructed_Facilities.html", "passage_text": "1 Five year coupon bonds at 10% interest rate for a total amount of borrowing of $900,000 which includes $50,000 of issuing cost. 2  Suppose that the five year coupon bond in Problem 7 is to be refinanced, after the payment of interest at the end of year 3, by a uniform mortgage which requires an issuance cost of 2%. With an annual interest charge of 10.25% over a twenty year life time, the annual payment would be $1.076 million except in year 20 when the sum of principal and interest would be 10.5 + 1.076 = $11.576 million. The computation for this case of borrowing has been given in Example 7-2."}, {"url": "https://www.citizensadvice.org.uk/law-and-rights/legal-system/taking-legal-action/help-with-legal-costs-legal-aid/", "passage_text": "If you have more than £3,000 of disposable capital, you will have to pay a contribution towards the costs of your case. This contribution has to be paid straight away and it will be all of the capital you have over £3,000 up to the total cost of the legal advice. You can deduct your mortgage or any charges on your home, up to a maximum of £100,000. This is called mortgage disregard. You can also deduct 3% of the market value of your home (the amount for which it could be sold for on the open market) for sales costs."}, {"url": "http://www.justice.gov.uk/courts/procedure-rules/civil/rules/part36", "passage_text": "(7) If the offeree accepts a Part 36 offer which includes payment of any part of the damages in the form of periodical payments, the claimant must, within 7 days of the date of acceptance, apply to the court for an order for an award of damages in the form of periodical payments under rule 41.8. 36.4. (1) Except where a Part 36 offer is made in appeal proceedings, it shall have the consequences set out in this Section only in relation to the costs of the proceedings in respect of which it is made, and not in relation to the costs of any appeal from a decision in those proceedings."}, {"url": "https://news.clearancejobs.com/2011/08/07/how-much-does-it-really-cost-to-get-a-security-clearance/", "passage_text": "Some reputable websites perpetuate this myth by stating: “The average cost to process a TOP SECRET clearance is between $3,000 and about $15,000, depending upon individual factors. . . . The law requires that contractors pay most of the costs of obtaining clearances for their employees.” 1. "}, {"url": "http://guides.dss.gov.au/child-support-guide/5/3/1", "passage_text": "If the payer pays $70 in cash (or has an equivalent amount credited as a non-agency payment under s71 or s71A) by the due date for August 2013 (7 September 2013) then $30 from the $2,000 uncredited amount is credited. The arrears of $3,000 remain. The uncredited amount is reduced to $1,970. F and M agree to have the payment applied at the rate of 50% of the ongoing liability, and payer F will pay the other 50% of the ongoing liability, so that M will still receive 50% of her child support as periodic payments."}]