[{"url": "http://www.statista.com/statistics/218360/number-of-starbucks-stores-in-the-us/", "passage_text": "The increase in the number of Starbucks stores across the U.S. has not necessarily correlated with an increase in customer satisfaction. Between 2006 and 2014, the American customer satisfaction index scores of Starbucks have been recorded. In 2006, Starbucks received an ACSI score of 77."}, {"url": "http://www.statista.com/statistics/266465/number-of-starbucks-stores-worldwide/", "passage_text": "Seattle-based coffee chain Starbucks has seen expansion on a large scale in recent years, tripling from around seven thousand stores in 2003 to more than 21 thousand in 2014. As of May 2014, the United States, with 11,563 locations, had the largest number of Starbucks stores in the world by far."}, {"url": "https://en.wikipedia.org/wiki/Starbucks", "passage_text": "Starbucks is the largest coffeehouse company in the world, with 22,766 stores in 65 countries and territories, including 12,802 in the United States, 1,930 in China, 1,409 in Canada, 1,121 in Japan and 825 in the United Kingdom."}, {"url": "https://en.wikipedia.org/wiki/Starbucks", "passage_text": "Starbucks had been profitable as a local company in Seattle in the early 1980s but lost money on its late 1980s expansion into the Midwest and British Columbia. Its fortunes did not reverse until the fiscal year of 1989-1990, when it registered a small profit of $812,000."}, {"url": "http://www.statista.com/statistics/218360/number-of-starbucks-stores-in-the-us/", "passage_text": "In 2013, Starbucks had 7,049 company-operated stores in the U.S. Number of international and U.S. Starbucks stores. Starbucks in the U.S. – additional information. Founded in 1971 in Seattle, Washington, Starbucks expanded outside of the U.S. for the first time in 1996 when it launched in Japan."}, {"url": "http://www.statista.com/statistics/266465/number-of-starbucks-stores-worldwide/", "passage_text": "The country with the second largest number, Canada, had just 1,396 locations. Only two other countries had more than one thousand Starbucks stores at this time, China and Japan. Surprisingly, the city with the largest number of Starbucks stores worldwide was found in none of the aforementioned countries. Seoul, in South Korea, had 284 locations as of May 2014. It seems that, for Starbucks, financial success has gone hand-in-hand with global expansion."}, {"url": "http://www.huffingtonpost.com/2012/10/04/starbucks-locations_n_1940891.html", "passage_text": "As of September 8, there were 12,937 Starbucks stores in the United States. That's more than the number of Pizza Huts, Burger Kings or Dunkin' Donuts, but less than the number of Subways or McDonald's."}]