[{"url": "http://www.wikihow.com/Cook-Rice-in-a-Rice-Cooker", "passage_text": "1 Sold as parboiled (not half-cooked at home) - 2 cups of water per 1 cup of rice. 2  For Indian style rices like Basmati or Jasmine, less water is needed as a drier rice is desired, use no more than 1 1/2 cups of water per 1 cup of rice. 3  Use only 1 to 1 if you washed the rice previously. If your rice cooker has a removable cooking pot, place the pot of rice and water back into the rice cooker. Close the lid of the cooker, plug the cooker in, and press the switch to turn it on. The switch will click, like a toaster, when the rice is done."}, {"url": "http://www.realsimple.com/food-recipes/cooking-tips-techniques/cooking/cook-rice", "passage_text": "Boil water and add salt. Pour water (for every cup of rice, use 1 3/4 cups of water) into a large saucepan with a tight-fitting lid. Bring to a boil. Mix 1 teaspoon salt into the water. Pour in rice. Add it to the boiling water. Stir once, or just enough to separate the rice. Use a wooden spoon to separate any clumps. "}, {"url": "http://dish.allrecipes.com/how-to-cook-rice/", "passage_text": "1 To cook wild rice: Use 1 cup of rice to 3 cups of water. 2  Bring the water to a boil, reduce the heat, and simmer for 45 minutes. 3  Let stand, covered, for 10 minutes before serving. 4  To cook rice pilaf: For pilaf dishes, rice is sauteed in oil in order to keep the grains separate during cooking. 1 To cook brown rice: Use 1 cup of rice and 2 cups of water. 2  Bring the water to a boil, reduce the heat, and simmer for 45 minutes. 3  Let stand, covered, for 10 minutes before serving. 4  To cook basmati or jasmine rice: Follow the instructions for long-grained white rice"}, {"url": "http://www.cookusinterruptus.com/brown-rice-in-a-rice-cooker-4136-51.html", "passage_text": "1 Put it in the rice cooker. 2  Instead of filling the cooker with water to the 2 cup mark, fill it to the 3 cup mark in your rice cooker. 3  That usually means 3 cups of water for the 2 cups of brown rice. 4  Add a teaspoon of sea salt. How to Cook Brown Rice in a Rice Cooker. 1  Rinse and drain 2 cups of brown rice. 2  Put it in the rice cooker. 3  Instead of filling the cooker with water to the 2 cup mark, fill it to the 3 cup mark in your rice cooker. 4  That usually means 3 cups of water for the 2 cups of brown rice"}, {"url": "http://www.wikihow.com/Cook-Brown-Rice-in-a-Rice-Cooker", "passage_text": "Transfer the rice to your rice cooker and let it soak for about 45 minutes in 2 2/3 cups (580 ml) warm water. 1  Soaking is beneficial because it reduces the stickiness of the rice. 2  It also helps the rice expand into long, thin grains. 3  You can soak the rice up to 3 hours, if desired, but 45 minutes will often be enough. If your rice cooker has a brown rice setting, use that. If it only has a timer, set the timer for 30 minutes. 1  Cover the rice cooker before starting it and leave that cover on for the duration of the cooking process. 2  The rice and quinoa may need a total of 40 minutes to finish cooking inside the rice cooker."}, {"url": "http://www.wikihow.com/Cook-Rice-in-a-Rice-Cooker", "passage_text": "Measure the rice with a cup and put it into your cooking pot. Some rice cookers have a removable bowl or pot, while others must have the rice placed directly in the cooker. Most of the time, rice cookers will come with a measuring cup or scoop that can fit 3/4 cup (180 mL). If your rice cooker has a removable cooking pot, place the pot of rice and water back into the rice cooker. Close the lid of the cooker, plug the cooker in, and press the switch to turn it on. The switch will click, like a toaster, when the rice is done."}, {"url": "http://www.cookusinterruptus.com/brown-rice-in-a-rice-cooker-4136-51.html", "passage_text": "1 Rinse and drain 2 cups of brown rice. 2  Put it in the rice cooker. 3  Instead of filling the cooker with water to the 2 cup mark, fill it to the 3 cup mark in your rice cooker. 4  That usually means 3 cups of water for the 2 cups of brown rice. 5  Add a teaspoon of sea salt. 6  Turn cooker on. How to Cook Brown Rice in a Rice Cooker. 1  Rinse and drain 2 cups of brown rice. 2  Put it in the rice cooker. 3  Instead of filling the cooker with water to the 2 cup mark, fill it to the 3 cup mark in your rice cooker. 4  That usually means 3 cups of water for the 2 cups of brown rice"}, {"url": "http://www.thekitchn.com/how-to-cook-rice-on-the-stove-44333", "passage_text": "1 Measure the rice and water: For most rice, use a 1:2 ratio of one cup of rice to two cups of water. 2  Measure a half cup of uncooked rice per person and scale this ratio up or down depending on how much you're making. Small (2-quart or so) saucepan with a lid. Stirring spoon. 1  Rinse your rice: It's good practice to rinse your rice in a strainer before cooking. 2  This isn't strictly necessary, but it will rinse off any dusty starch on the surface of the rice along with any leftover chaff or stray particles."}]