[{"url": "http://www.livestrong.com/article/394115-symptoms-or-diseases-with-a-lack-of-vitamin-k/", "passage_text": "Vitamin K is an important nutrient that plays a role in blood clotting and bone health. It is rare to have a deficiency in vitamin K. This is because vitamin K can be readily obtained from leafy green foods and is also made from bacteria in your intestines. gums or nose."}, {"url": "https://labtestsonline.org/understanding/conditions/vitamink/start/1", "passage_text": "1 Malabsorption, especially impaired absorption of fats due to diseases such as cystic fibrosis, celiac disease, chronic pancreatitis or Crohns disease, may cause vitamin K deficiency. 1 Deficiencies in newborns are associated with hemorrhagic disease of the newborn (also called vitamin K deficiency bleeding or VKDB). 2  This can cause bleeding and bruising and, in severe cases, can lead to fatal bleeding into the brain."}, {"url": "http://www.stylecraze.com/articles/vitamin-k-deficiency-causes-symptoms-and-treatment/", "passage_text": "Vitamin K deficiency is rare since the bacteria in the large intestines can produce it internally. Other things that may cause vitamin K deficiency are: 1. Health problems like gallbladder or cystic fibrosis, celiac disease, biliary disease and Crohn’s disease. High level of vitamin K results in great bone density, while low level of the same causes osteoporosis. Osteoporosis is a bone disorder characterized by weak bones. This can lead to major problems like risk for fractures and falls. Vitamin K improves bone health and reduces risk of postmenopausal women."}, {"url": "http://www.rightdiagnosis.com/v/vitamin_k_deficiency/causes.htm", "passage_text": "Vitamin K deficiency can be caused not only from insufficient dietary intake but also from malabsorption due to an underlying disease such as cystic fibrosis. Certain medications can cause a deficiency of vitamin K. Vitamin K deficiency can also be present in newborns due to insufficient vitamin K in the mother's milk. Vitamin K deficiency: Related Medical Conditions. To research the causes of Vitamin K deficiency, consider researching the causes of these these diseases that may be similar, or associated with Vitamin K deficiency: 1  Trauma. 2  Infection. 3  Thrombocytopenia. 4  Leukaemia. 5  Hereditary disorder. 6  Aspirin induced platelet dysfunction. 7  Liver disease. 8  Hemophilia"}, {"url": "https://labtestsonline.org/understanding/conditions/vitamink/start/1", "passage_text": "Causes of Vitamin K Deficiency. The most common causes of vitamin K deficiency are insufficient dietary intake, inadequate absorption, and decreased storage of the vitamin due to liver disease, but it may also be caused by decreased production in the intestines. 1 Deficiencies in newborns are associated with hemorrhagic disease of the newborn (also called vitamin K deficiency bleeding or VKDB). 2  This can cause bleeding and bruising and, in severe cases, can lead to fatal bleeding into the brain."}, {"url": "http://emedicine.medscape.com/article/126354-overview", "passage_text": "Vitamin K (VK) deficiency can occur in any age group but is encountered most often in infancy. VK, an essential, lipid-soluble vitamin that plays a vital role in the production of coagulation proteins, is found in green, leafy vegetables and in oils, such as soybean, cottonseed, canola, and olive oils. VK is also synthesized by colonic bacteria. (See Etiology and Epidemiology.)"}, {"url": "http://www.mayoclinic.org/diseases-conditions/vitamin-deficiency-anemia/basics/definition/con-20019550", "passage_text": "Vitamin deficiency anemia can occur if you don't eat enough folate, vitamin B-12 or vitamin C. Or vitamin deficiency anemia can occur if your body has trouble absorbing or processing these vitamins. Not all anemias are caused by a vitamin deficiency. Other causes include iron deficiency and certain blood diseases. That's why it's important to have your doctor diagnose and treat your anemia. Vitamin deficiency anemia can usually be corrected with vitamin supplements and changes to your diet"}, {"url": "http://www.livestrong.com/article/394115-symptoms-or-diseases-with-a-lack-of-vitamin-k/", "passage_text": "A deficiency may be the result of malabsorption problems, celiac disease, cystic fibrosis, Crohn's disease, blood thinning drugs, or serious burns. For a healthy body, adults should consume 90 mcg/day of vitamin K. A deficiency in vitamin K could result in a disruption in your body's ability to form blood clots. As a result, you are at risk for excessive bleeding. Symptoms of this can include bleeding in the form of nosebleeds, blood in your urine or stool, tarry black stool, or heavy menstrual bleeding. It is rare to have a deficiency in vitamin K. This is because vitamin K can be readily obtained from leafy green foods and is also made from bacteria in your intestines. gums or nose."}]