[{"url": "http://wirelessestimator.com/content/industryinfo/173", "passage_text": "Slump and air content tests may be required as well. Some specifications call for the testing firm’s representative to take the samples, at costs ranging from $35.00 to $50.00 per man-hour. The minimum fee for any testing service is usually $40.00."}, {"url": "http://www.cas.umt.edu/facultydatabase/FILES_Faculty/1111/WJAFJuniper.pdf", "passage_text": "When fence posts wereproduced also, stump to deck costs were reduced to $31.56/ton. Soil compaction was measured pre-andpostharvest using a soil penetrometer. Paired t-tests showed a statistically significant difference betweenharvested sites and nonharvested sites at depths of 2 and 4 in."}, {"url": "http://wirelessestimator.com/content/industryinfo/173", "passage_text": "Although the standard proctor is used in some instances, most construction documents specify the modified proctor as detailed by ASTM D-1557. The modified proctor, used to test the compaction characteristics of the soil, averages $100.00 for each location. The compaction testing averages $50.00 per lift."}, {"url": "http://www.howmuchisit.org/soil-testing-cost/", "passage_text": "1 On average, depending on what kind of test that you want to have, the costs of a soil test are going to be anywhere from as little as $5 to as much as $20 per sample. 2  With most labs, you will have to ship in the dirt and wait up to six weeks for detailed results. 3  To test the soil’s pH, plan on spending $2 to $5."}, {"url": "http://www.homeadvisor.com/cost/architects-and-engineers/test-soil/", "passage_text": "Material and labor costs. Soil testing can be extensive or basic. Each type of test, such as a soil nitrate test, ranges from $10 to $20 in cost. Screening tests for toxins and environmental cation tests for farming can range from $30 to $50 per test. There are additional costs for expedited services from labs that range from $30 to $100 in some areas. Some soil testing services offer extra reporting and calculation labor visuals for large-scale applications at an additional charge per hour."}, {"url": "http://www.howmuchisit.org/soil-testing-cost/", "passage_text": "1 For instance, on Amazon, soil testing kits retail for $6 to as much as $28. 2  Lanfax Laboratories shares their price list for soil testing. 3  Sampling preparation including air drying and sieving costs $22. 4  Test of moisture content for grave metric"}]