[{"url": "http://www.choosingwisely.org/patient-resources/antibiotics-for-urinary-tract-infections-in-older-people/", "passage_text": "Antibiotics are medicines that can kill bacteria. Doctors often use antibiotics to treat urinary tract infections (UTIs). The main symptoms of UTIs are: 1  A burning feeling when you urinate. 2  A strong urge to urinate often."}, {"url": "http://www.ehow.com/about_5367943_antibiotics-cure-bladder-infection.html", "passage_text": "Trimethoprim is an antibiotic that is used for bladder infections, marketed under the brand names Proloprim, Monotrim and Triprim. It is the most widely prescribed drug for bladder infections because few infection strains are resistant to it. You should not take trimethoprim if you are also taking dofetilide, methotrexate or cyclosporine because it can cause dangerous interactions. Nitrofurantoin is an antibiotic used to treat bladder infections and is sold under the names Macrobid and Macrodantin. It prevents bacteria from forming cell walls and limits their ability to survive and reproduce."}, {"url": "http://umm.edu/health/medical/reports/articles/urinary-tract-infection", "passage_text": "Urinary Tract Infections (UTIs). Urinary tract infections (UTIs) are a common type of infection caused by bacteria (most often E. coli) that travel up the urethra to the bladder. A bladder infection is called cystitis. If bacterial infection spreads to the kidneys and ureters, the condition is called pyelonephritis. 1 (Sometimes lower UTI symptoms may be the only signs of kidney infection. 2  People at highest risk for such silent upper urinary tract infections include patients with diabetes, impaired immune systems, or a history of relapsing or recurring UTIs.). 3  An increased need to urinate at night."}, {"url": "http://www.ehow.com/about_5367943_antibiotics-cure-bladder-infection.html", "passage_text": "Amoxicillin. Amoxicillin is an antibiotic from the penicillin group of drugs, used for many types of infections. Ear infections, gonorrhea and pneumonia can all be cured with amoxicillin. It can be prescribed as a suspension liquid or a tablet, both to be taken orally. Nitrofurantoin is an antibiotic used to treat bladder infections and is sold under the names Macrobid and Macrodantin. It prevents bacteria from forming cell walls and limits their ability to survive and reproduce."}, {"url": "http://www.webmd.com/a-to-z-guides/antibiotics-for-urinary-tract-infections-utis", "passage_text": "Antibiotics also prevent UTIs. The doctor might prescribe preventive antibiotic therapy for: 1  Women who have recurrent UTIs (at least two UTIs in 6 months or three UTIs in 1 year). 2  Pregnant women who had recurrent UTIs before getting pregnant or during pregnancy. Antibiotics are effective for most UTIs. You should start to feel better within 1 to 2 days after starting antibiotics. If your symptoms get worse or you don't feel better by the third day, call your doctor. It is important to take all of the antibiotics your doctor has prescribed."}, {"url": "http://www.webmd.com/a-to-z-guides/understanding-bladder-infections-diagnosis-and-treatment", "passage_text": "Women whose infections are related to sexual activity may be given a small dose of antibiotics to take each time they have intercourse. Remember that frequently recurring bladder symptoms can sometimes be caused by other conditions, such as interstitial cystitis, and are not always the result of an infection. While being treated for a bladder infection, drink plenty of fluids to help flush any bacteria out of the bladder. A common treatment is phenazopyridine (Pyridium), which is available over the counter. This is an anesthetic for the urinary tract, but doesn’t actually treat the"}, {"url": "http://www.webmd.com/a-to-z-guides/understanding-bladder-infections-diagnosis-and-treatment", "passage_text": "After you have finished treatment, you may be asked to come in for a follow-up urine test to make sure your bladder is free of all signs of infection. People with frequently recurring bladder infections may be prescribed low daily doses of antibiotics for an additional six months or longer. While being treated for a bladder infection, drink plenty of fluids to help flush any bacteria out of the bladder. A common treatment is phenazopyridine (Pyridium), which is available over the counter. This is an anesthetic for the urinary tract, but doesn’t actually treat the infection"}, {"url": "http://www.webmd.com/a-to-z-guides/understanding-bladder-infections-diagnosis-and-treatment", "passage_text": "There is a wide variety of antibiotics to treat bladder infections. Some uncomplicated infections can be treated with just three days of medication. Some drugs and some organisms require a week or more of treatment. While being treated for a bladder infection, drink plenty of fluids to help flush any bacteria out of the bladder. A common treatment is phenazopyridine (Pyridium), which is available over the counter. This is an anesthetic for the urinary tract, but doesn’t actually treat the infection"}, {"url": "http://www.wikihow.com/Treat-a-Bladder-Infection", "passage_text": "Ask your doctor about antibiotics. Doctors prescribe a variety of antibiotics for bladder infections including amoxicillin, ampicillin and ciprofloxacin. 1  Your doctor may place you on a short regimen of antibiotics or on a longer regimen depending on the severity of the infection. "}]