[{"url": "https://en.wikipedia.org/wiki/Drainage_basin", "passage_text": "A drainage basin or catchment basin is an extent or an area of land where surface water from rain, melting snow, or ice converges to a single point at a lower elevation, usually the exit of the basin, where the waters join another waterbody, such as a river, lake, reservoir, estuary, wetland, sea, or ocean. In closed (endorheic) drainage basins the water converges to a single point inside the basin, known as a sink, which may be a permanent lake, dry lake, or a point where surface water is lost underground."}, {"url": "http://study.com/academy/lesson/drainage-basins-definition-characteristics.html", "passage_text": "This type of water is referred to as runoff, because it is water that falls on the ground and flows across the surface until it hits a stream. Each waterway has a drainage basin, or watershed, which is an area of land where all precipitation that falls will drain or flow downhill into a specific stream. Based on where rain falls, and in what drainage basin, determines what waterway it will end up traveling to. The drainage basin of a larger river system is comprised of many branching networks. It starts at high elevation with first-order streams, which are small streams that originate from springs. First-order streams are where the system begins, and they do not have any other streams flowing into them."}, {"url": "https://en.wikipedia.org/wiki/Drainage_basin", "passage_text": "Each drainage basin is separated topographically from adjacent basins by a perimeter, the drainage divide making up a succession of higher geographical features (such as a ridge, hill or mountains) forming a barrier. In closed (endorheic) drainage basins the water converges to a single point inside the basin, known as a sink, which may be a permanent lake, dry lake, or a point where surface water is lost underground."}, {"url": "http://www.definitions.net/definition/drainage%20basin", "passage_text": "Drainage basin. A drainage basin is an extent or an area of land where surface water from rain and melting snow or ice converges to a single point, usually the exit of the basin, where the waters join another waterbody, such as a river, lake, reservoir, estuary, wetland, sea, or ocean. In North America, the term watershed is commonly used to mean a drainage basin. Drainage basins drain into other drainage basins in a hierarchical pattern, with smaller sub-drainage basins combining into larger drainage basins."}, {"url": "http://www.thecanadianencyclopedia.ca/en/article/drainage-basin/", "passage_text": "Drainage Basin. A drainage basin is an area of land that contributes the water it receives as precipitation to a river or network of rivers. A drainage basin is an area of land that contributes the water it receives as precipitation to a river or network of rivers. Drainage basins are defined by topographical features, called drainage divides, which determine the direction the water flow"}, {"url": "https://en.wikipedia.org/wiki/Drainage_basin", "passage_text": "The drainage basin includes both the streams and rivers that convey the water as well as the land surfaces from which water drains into those channels, and is separated from adjacent basins by a drainage divide. In closed (endorheic) drainage basins the water converges to a single point inside the basin, known as a sink, which may be a permanent lake, dry lake, or a point where surface water is lost underground."}, {"url": "https://en.wikipedia.org/wiki/Drainage_basin", "passage_text": "The drainage basin acts as a funnel by collecting all the water within the area covered by the basin and channelling it to a single point. In closed (endorheic) drainage basins the water converges to a single point inside the basin, known as a sink, which may be a permanent lake, dry lake, or a point where surface water is lost underground."}, {"url": "http://water.wikia.com/wiki/Drainage_basin", "passage_text": "The drainage basin acts like a funnel-collecting all the water within the area covered by the basin and channeling it into a waterway. Each drainage basin is separated topographically from adjacent basins by a ridge, hill or mountain, which is known as a water divide or a watershed. Especially in North American usage however, watershed refers to the drainage basin itself. Drainage basin. 558 pages on this wiki. A drainage basin is the area within the drainage basin divide (yellow outline), and drains the surface runoff and river discharge (blue lines) of a contiguous area."}, {"url": "https://en.wikipedia.org/wiki/List_of_drainage_basins_by_area", "passage_text": "The list of drainage basins by area identifies basins (also known as watersheds or catchments), sorted by area, which drain to oceans, mediterranean seas, rivers, lakes and other water bodies. All basins larger than 400,000 km 2 (150,000 sq mi) are included as well as selected smaller basins. "}]