[{"url": "http://www.bandbacktogether.com/self-esteem-resources/", "passage_text": "Self-esteem refers to the level of emotional value, worth, and/or importance individuals place on themselves. Self-esteem impacts a person's beliefs about what they can achieve in life, what they deserve in relationships, and how they approach challenging situations."}, {"url": "http://getesteem.com/about-self-esteem.html", "passage_text": "1 Of course, the obvious is that low self-esteem will likely develop if verbal, sexual, emotional, and/or physical abuse is present, plus illness of the child or a parent’s illness that causes the other parent to also be unavailable, can contribute."}, {"url": "http://self-esteem-international.org/Aboutse/3-develops.htm", "passage_text": "HOW SELF-ESTEEM DEVELOPS. There are two essential components of healthy self-esteem; the sense of personal worth and a sense of personal competence or efficacy. These two components of self-esteem develop over a period of time with multiple experiences. The first major component of self-esteem, the sense of personal worth or being worthy of respect, typically stems from being loved or valued by others, most often by parents in the home."}, {"url": "http://www.mayoclinic.org/healthy-lifestyle/adult-health/in-depth/self-esteem/art-20047976", "passage_text": "Self-esteem is your overall opinion of yourself — how you feel about your abilities and limitations. When you have healthy self-esteem, you feel good about yourself and see yourself as deserving the respect of others. When you have low self-esteem, you put little value on your opinions and ideas."}, {"url": "http://psychcentral.com/lib/building-self-esteem/", "passage_text": "Self-esteem is how you feel about yourself as a person. Those with high self-esteem believe that they are adequate, strong and worthy of a good life, while those with low self-esteem feel inadequate and worthless. Low self-esteem can develop in childhood and continue throughout adulthood, causing great emotional pain."}]