[{"url": "http://www.mayoclinic.org/diseases-conditions/vitiligo/basics/causes/CON-20032007", "passage_text": "Skin layers and melanin. Vitiligo occurs when melanin-forming cells (melanocytes) die or stop producing melanin — the pigment that gives your skin, hair and eyes color. The involved patches of skin become lighter or white. Doctors don't know why the cells fail or die. It may be related to: "}, {"url": "http://www.webmd.com/skin-problems-and-treatments/guide/vitiligo-common-cause-loss-skin-pigment", "passage_text": "Causes of Vitiligo. Melanin is the pigment that gives the skin its characteristic color. Vitiligo is caused by a loss of pigment in the skin, due to destruction of pigment-forming cells known as melanocytes. The exact cause of the destruction of these cells is not known. Symptoms of vitiligo include an often rapid pigment loss on several areas of the skin. The initial appearance of the white patches can be followed by a stable period without any progression of the condition. Later on, further cycles of pigment loss and stability may be observed."}, {"url": "http://www.ncbi.nlm.nih.gov/pubmedhealth/PMH0001834/", "passage_text": "Vitiligo (vit-ill-EYE-go) is a pigmentation disorder in which melanocytes (the cells that make pigment) in the skin are destroyed. As a result, white patches appear on the skin in different parts of the body. Vitiligo. A disorder in which the immune system destroys pigment-making cells called melanocytes. This results in white patches of skin on different parts of the body. PubMed Health Glossary. (Source: NIH-National Institute of Arthritis and Musculoskeletal and Skin Diseases). Symptoms Tests Treatments."}, {"url": "http://www.emedicinehealth.com/vitiligo/article_em.htm", "passage_text": "Vitiligo Definition and Overview. Vitiligo a skin disease in which there is a progressive loss of the pigment-producing cells (melanocytes), resulting in areas of skin without melanin pigment."}, {"url": "http://www.medicinenet.com/vitiligo/article.htm", "passage_text": "The cause is not known. Vitiligo may be an autoimmune disease. These diseases happen when your immune system mistakenly attacks some part of your own body. In vitiligo, the immune system may destroy the melanocytes in the skin. It is also possible that one or more genes may make a person more likely to get the disorder. Melanin is the pigment that gives the skin its characteristic color. Vitiligo is caused by a loss of pigment in the skin, due to destruction of pigment-forming cells known as melanocytes."}, {"url": "http://www.medicinenet.com/vitiligo/article.htm", "passage_text": "1 Vitiligo is a disease in which the pigment cells of the skin, melanocytes, are destroyed in certain areas. 2  Vitiligo results in depigmented, or white, patches of skin in any location on the body. 3  Vitiligo can be focal and localized to one area, or it may affect several different areas on the body. Melanin is the pigment that gives the skin its characteristic color. Vitiligo is caused by a loss of pigment in the skin, due to destruction of pigment-forming cells known as melanocytes."}, {"url": "https://en.wikipedia.org/wiki/Vitiligo", "passage_text": "Vitiligo is a chronic skin condition characterized by portions of the skin losing their pigment. It occurs when skin pigment cells die or are unable to function. Aside from cases of contact with certain chemicals, the cause of vitiligo is unknown. "}, {"url": "http://www.niams.nih.gov/Health_Info/Vitiligo/vitiligo_ff.asp", "passage_text": "Vitiligo (vit-ill-EYE-go) is a disorder in which white patches of skin appear on different parts of the body. This happens because the cells that make pigment (color) in the skin are destroyed. These cells are called melanocytes (ma-LAN-o-sites). In vitiligo, the immune system may destroy the melanocytes in the skin. It is also possible that one or more genes may make a person more likely to get the disorder. Some researchers think that the melanocytes destroy themselves. Others think that a single event such as sunburn or emotional distress can cause vitiligo."}, {"url": "http://niams.nih.gov/health_info/vitiligo/", "passage_text": "Vitiligo (vit-ill-EYE-go) is a pigmentation disorder in which melanocytes (the cells that make pigment) in the skin are destroyed. As a result, white patches appear on the skin in different parts of the body. "}]