[{"url": "http://www.computerworld.com/article/2488194/computer-peripherals-usb-type-c-simpler-faster-and-more-powerful.html", "passage_text": "Comments. USB has become ubiquitous as the way to connect our mobile devices to power sources and to other devices. There are currently seven different types of USB connectors already in use: USB 2.0 A, B, mini B and micro B; and USB 3.0 A, B and micro B. There's about to be one more: the USB Type-C."}, {"url": "http://www.mycablemart.com/store/cart.php?m=product_list&c=159", "passage_text": "USB Type A to B Cables. These are your standard Type A Male to Type B Male USB cables use for most common USB printers, and other mainstream USB devices. 6 INCH USB 2.0 Certified 480Mbps Type A Male to B Male Cable. Commonly used for laser and inkjet printers with a USB Type-B connector. The Type-A connector is found on most PCs and Macs. 1.5 ft ANGLE USB 2.0 Certified 480Mbps Type A Male to B Male Cable, Beig"}, {"url": "http://pcsupport.about.com/od/termsu/a/usb-type-b.htm", "passage_text": "USB Type B connectors, officially referred to as Standard-B connectors, are square in shape with either a slight rounding or large square protrusion on the top, depending on the USB version. USB Type-B connectors are supported in every USB version, including USB 3.0, USB 2.0, and USB 1.1. A second type of B connector, called Powered-B, also exists but only in USB 3.0. USB 3.0 Type B connectors are often the color blue while USB 2.0 Type B and USB 1.1 Type B connectors are often black. However, this is not always the case. USB Type B Compatibility. The USB Type B connectors in USB 2.0 and USB 1.1 are identical, meaning that the USB Type B plug from one USB version will fit into the USB Type B receptacle from its own, and from the other, USB version."}, {"url": "http://pcsupport.about.com/od/termsu/a/usb-type-a.htm", "passage_text": "USB Type A connectors, officially called Standard-A connectors, are flat and rectangular in shape. Type A is the original USB connector and is the most recognizable and commonly used connector. USB Type-A connectors are supported in every USB version, including USB 3.0, USB 2.0, and USB 1.1. USB 3.0 Type A connectors are often, but not always, the color blue."}, {"url": "http://pcsupport.about.com/od/termsu/a/usb-type-a.htm", "passage_text": "USB 2.0 Type A and USB 1.1 Type A connectors are often, but not always, black. Note: The male USB Type A connector is called the plug and the female connector is called the receptacle but is commonly referred to as the port. Type A is the original USB connector and is the most recognizable and commonly used connector. USB Type-A connectors are supported in every USB version, including USB 3.0, USB 2.0, and USB 1.1. USB 3.0 Type A connectors are often, but not always, the color blue."}, {"url": "http://www.cnet.com/uk/news/usb-type-c-one-cable-to-connect-them-all/", "passage_text": "USB Type-B. Typically, the Type-B connector is the other end of a standard USB cable that plugs into peripheral device (such as a printer, a phone, or an external hard drive). It's also known as Type B-male. On the peripheral device, the USB port is called Type B-female. USB Type-A. Also known as USB Standard-A, USB Type-A is the original design for the USB standard with a flat and rectangular shape. On a typical USB cable, the Type A connector, aka the A-male connector, is the end that goes into a host, such as a computer."}, {"url": "https://en.wikipedia.org/wiki/USB", "passage_text": "Type-A plugs and receptacles from both USB 3.0 and USB 2.0 are designed to interoperate. Type-B plugs and receptacles in USB 3.0 are somewhat larger than those in USB 2.0; thus, USB 2.0 Type-B plugs can fit into USB 3.0 Type-B receptacles, while the opposite is not possible. "}, {"url": "http://compnetworking.about.com/od/usbnetworking/p/usb-port.htm", "passage_text": "Printers and some other devices may use smaller types of USB ports including a standard called USB-A. To connect a device having USB-B ports to a device with another type, simply use the correct type of cable with appropriate interfaces on each end. Versions of USB: The USB industry standard exists in multiple versions including 1.1, 2.0 and 3.0. "}]