[{"url": "http://www.ehow.com/how_5690562_wrinkles-out-wool.html", "passage_text": "Iron the wool with a dry iron on the wool setting, which is a low setting. Grab a white or light-colored cotton fabric such as a dish towel, bandanna or bed sheet. Spray a light mist of distilled water onto the cloth and then place the cloth over the wrinkle and iron. Press the garment from the wrong side if possible. "}, {"url": "http://www.havebetterskin.com/wrinkles/how-can-i-get-wrinkles-out-of-a-wool-coat", "passage_text": "December 10, 2008 at 4:35 am. If you iron it will put a sheen on the wool, try hanging them in the bathroom when you take a long hot shower, the steam from the shower may help remove the wrinkles if you leave it hang for awhile after the shower. References : December 10, 2008 at 5:01 am. OR check on the Downey Wrinkle Remover product that you spray on and smooth out wrinkles….be sure it is safe for wool before using. It is usually available at your local grocery or Wal-mart. Next time you store your coats, try a Space Bag….you vacuum out the air."}, {"url": "https://answers.yahoo.com/question/index?qid=20071014190946AAaQhH3", "passage_text": "Answers. Best Answer: Tailors use irons and plenty of steam to shape wool when the garment is being made up, so you can use an iron on your coat, but you should do it like the pros. First, use a dry iron on a medium setting. Next use a press cloth, a square of plain cotton fabric such as an old bed sheet. If you can turn the coat so that you can press from the wrong side of the wool, that would work better because you can use a steam iron with a damp press cloth. Always use a light touch when pressing wool, let the steam do most of the work."}, {"url": "http://www.mademan.com/mm/how-get-wrinkles-out-wool-coat.html", "passage_text": "The secret of how to get wrinkles out of a wool coat is steam. The severity of the creases will determine the intensity and length of application. In order to get wrinkles out of a wool coat, you should have the following: 1  A plastic or wooden clothes hanger. 2  Access to a bathroom shower. 3  A clothes iron. 4  An ironing board. 5  A wet piece of cotton cloth about the size of a dish cloth."}, {"url": "http://www.ehow.com/how_5529123_remove-wrinkles-wool-winter-coat.html", "passage_text": "Instructions. Hang your coat up to dry on a padded coat hanger. Wool clothing tends to wrinkle fairly quickly, but it also retains its shape well. If you leave the coat alone for at least a day, the wrinkles should remove. Hang the coat in your bathroom on the shower rod and turn the shower on high to steam up the room. Shut the door and let the steam remove any wrinkles in the fabric. Place the wool winter coat in a warm room if you're not planning on wearing the coat for a few days. Keep the coat away from heaters and other heat sources to prevent the risk of an accidental fire. Use an iron on the wool setting"}, {"url": "https://answers.yahoo.com/question/index?qid=20071014190946AAaQhH3", "passage_text": "If your wool is heavily napped, like velours, pilot, or duffle cloth, then use a thick towel on your ironing surface to soften it. If you can turn the coat so that you can press from the wrong side of the wool, that would work better because you can use a steam iron with a damp press cloth. Always use a light touch when pressing wool, let the steam do most of the work. I make many garments with wool, including wool winter coats"}, {"url": "http://www.overstock.com/guides/how-to-care-for-wool-coats", "passage_text": "Lay the coat on a thick towel and shape the coat. Let it air-dry. If you can avoid ironing a wool coat, do so. If you've brought the coat out of storage and let it hang for a while yet it still has wrinkles, iron on a cool setting. Place the coat on your ironing board or a flat, clean surface, such as a table. "}, {"url": "http://laundry.about.com/video/How-to-Iron-Wool.htm", "passage_text": "Ironing a Wool Coat. If you are ironing a coat, start by laying the coat on the ironing board with the backside facing up. Smooth out wrinkles with your hands. Lay the ironing cloth over the wool and begin ironing from the top, working your way to the bottom. Remove the cloth and rotate the coat to continue ironing the back side. Next, rotate the coat to one of the front sides. Starting on the inner seam, line up the creases and smooth it out using your hand. Using an ironing cloth over the wool, start ironing from the top of the leg and work to the bottom. Flip the pant leg over and iron the outside. Repeat the same process on the second leg."}, {"url": "http://www.mademan.com/mm/how-get-wrinkles-out-wool-coat.html", "passage_text": "1 The best way to do this is to get out the ironing board and your electric iron. 2  Place your wool coat on the board. 3  Soak a plain dishcloth or other piece of cotton of like measurements in water and place the wet cloth on the wrinkled area of the wool coat or jacket. The severity of the creases will determine the intensity and length of application. In order to get wrinkles out of a wool coat, you should have the following: 1  A plastic or wooden clothes hanger. 2  Access to a bathroom shower. 3  A clothes iron. 4  An ironing board. 5  A wet piece of cotton cloth about the size of a dish cloth."}]