[{"url": "http://www.answers.com/Q/What_biome_is_peru", "passage_text": "In Argentina. Peru is the Republic of Peru is a country in western South America.  It is bordered on the north by Ecuador and Colombia, on the east by  Brazil, on the southeast by Bolivia … , on the south by Chile, and on  the west by the Pacific Ocean."}, {"url": "http://commons.wikimedia.org/wiki/Atlas_of_Peru", "passage_text": "The Republic of Peru is a country in western South America, bordering ► Ecuador and ► Colombia to the north, ► Brazil to the east, ► Bolivia to the south-east, ► Chile to the south, and the Pacific Ocean to the west."}, {"url": "http://epod.usra.edu/blog/2010/09/lake-titicaca-on-the-border-of-bolivia-and-peru.html", "passage_text": "The photo above shows a view of Lake Titicaca, which at 12,500 feet (3,811 m) above sea level is the highest commercially, navigable lake in the world. In terms of volume, it's also the largest lake in South America. Lake Titicaca is located on the border between Peru and Bolivia."}, {"url": "http://www.answers.com/Q/What_biome_is_peru", "passage_text": "The Republic of Peru is a country which is located in South America. It shares its border with Ecuador and Colombia on the north, on the east with Brazil, on the south with … Chile, on the southeast with Bolivia and on the west with the Pacific Ocean."}, {"url": "https://en.wikipedia.org/wiki/Bolivia", "passage_text": "With an area of 1,098,581 square kilometres (424,164 sq mi), Bolivia is the world's 28th-largest country, and the fifth largest country in South America, extending from the Central Andes through part of the Gran Chaco as far as the Amazon."}, {"url": "http://www.answers.com/Q/What_biomes_are_in_Peru", "passage_text": "Peru is the Republic of Peru is a country in western South America.  It is bordered on the north by Ecuador and Colombia, on the east by  Brazil, on the southeast by Bolivia … , on the south by Chile, and on  the west by the Pacific Ocean."}, {"url": "http://www.answers.com/Q/What_biomes_are_in_Peru", "passage_text": "Where is Peru? The Republic of Peru is a country which is located in South America. It shares its border with Ecuador and Colombia on the north, on the east with Brazil, on the south with … Chile, on the southeast with Bolivia and on the west with the Pacific Ocean."}, {"url": "http://www.socioambiental.org/amazon/?q=biodiversity-sociodiversity/biomes", "passage_text": "The Amazonian biome covers nearly 8 million square kilometres and extends across nine South American countries: Bolivia, Brazil, Colombia, Ecuador, Guyana, French Guiana, Peru, Suriname and Venezuela."}]