[{"url": "https://en.wikipedia.org/wiki/Dermestidae", "passage_text": "Dermestidae are a family of Coleoptera that are commonly referred to as skin beetles. Other common names include larder beetle, hide or leather beetles, carpet beetles, and khapra beetles. There are approximately 500 to 700 species worldwide. They can range in size from 1–12 mm. Key characteristics for adults are round oval shaped bodies covered in scales or setae. "}, {"url": "http://www.epestsupply.com/carpet_beetles.php", "passage_text": "Common Carpet Beetle Adults are small, rounded, gray to blackish in color with a varied pattern of white and orange scales on the back. There is an orange-red band of scales down the middle of the back. Adult beetles feed on nectar and pollen in flowers. Several species of Carpet Beetles may damage fabrics. Four species are most commonly encountered-the black carpet beetle, varied carpet beetle, common carpet beetle, and furniture carpet beetle. Together, this group is usually considered more economically important as fabric pests than the clothes moths. Many other common beetles resemble adult and larval carpet beetle"}, {"url": "http://edis.ifas.ufl.edu/ig089", "passage_text": "Common Carpet Beetle. Common carpet beetle adults (Figure 2) are about 1/8 inch in length and gray to black with whitish and orange scales on the back. The larva is carrot-shaped, reddish brown, and has many black to brown hairs. The common carpet beetle’s life cycle is 77 to 110 days."}, {"url": "http://www.wikihow.com/Get-Rid-of-Carpet-Beetles", "passage_text": "Verify that you have carpet beetles. Familiarize yourself with common clues that indicate a potential carpet beetle problem and make yourself aware of how carpet beetles look. 1  Fecal pellets and shed skins are the most common signs of infestation. 2  You can also expect to see carpet beetles in both adult and larvae form"}, {"url": "http://ento.psu.edu/extension/factsheets/black-carpet-beetle", "passage_text": "Contents. Attagenus unicolor (F). The black carpet beetle is a common carpet beetle in Pennsylvania. The larvae eat almost any type of animal product such as leather, wool, silk, feathers, hair, dried meat, dead insects, and even dried plant material. "}, {"url": "http://entnemdept.ufl.edu/creatures/fabric/common_carpet_beetle.htm", "passage_text": "The common carpet beetle, Anthrenus scrophulariae (Linnaeus), is a small blackish beetle that is found worldwide. This species is known to infest goods made from animal products, such as carpets, wool, textiles, and also preserved museum specimens. Figure 2. Dorsal view of an adult common carpet beetle, Anthrenus scrophulariae (Linnaeus). This specimen has orange scales. Photograph by Natasha Wright, Florida Department of Agriculture and Consumer Services-Division of Plant Industry; bugwood.org."}, {"url": "http://utahpests.usu.edu/htm/utah-pests-news/summer2011/carpet-hide-beetles/", "passage_text": "Adult carpet and hide beetles common in Utah homes: (top left) Trogoderma sp ., (top right) larder beetle (Dermestes lardarius), (bottom left) varied carpet beetle (Anthrenus verbasci), and (bottom right) black carpet beetle (Attagenus brunneus). Adult beetles are small, ranging in size from 2 mm to 10 mm. The most common Utah dermestids include the varied carpet beetle (Anthrenus verbasci), black carpet beetle (Attagenus megatoma), larder beetle (Dermestes lardarius), hide beetle (D. maculatus), and the warehouse beetle (T rogoderma variabile)."}, {"url": "http://entnemdept.ufl.edu/creatures/fabric/common_carpet_beetle.htm", "passage_text": "Introduction (Back to Top). The common carpet beetle, Anthrenus scrophulariae (Linnaeus), is a small blackish beetle that is found worldwide. This species is known to infest goods made from animal products, such as carpets, wool, textiles, and also preserved museum specimens. Figure 1. Figure 2. Dorsal view of an adult common carpet beetle, Anthrenus scrophulariae (Linnaeus). This specimen has orange scales. Photograph by Natasha Wright, Florida Department of Agriculture and Consumer Services-Division of Plant Industry; bugwood.org."}, {"url": "http://entnemdept.ufl.edu/creatures/fabric/common_carpet_beetle.htm", "passage_text": "Eggs: As is common to the genus Anthrenus, the eggs of the common carpet beetle are small, white, and have projections on them so that the eggs will adhere to surfaces (Black 2004, Smith and Whitman 1996). The female lays between 30 to 60 eggs that will hatch 10 to 20 days after being oviposited. Figure 2. Dorsal view of an adult common carpet beetle, Anthrenus scrophulariae (Linnaeus). This specimen has orange scales. Photograph by Natasha Wright, Florida Department of Agriculture and Consumer Services-Division of Plant Industry; bugwood.org."}]