[{"url": "https://en.wikipedia.org/wiki/Roan_(horse)", "passage_text": "Blue roan. Roan is a horse coat color pattern characterized by an even mixture of colored and white hairs on the body, while the head and  points —lower legs, mane and tail—are mostly solid-colored. Horses with roan coats have white hairs evenly intermingled throughout any other color. The head, legs, mane and tail have fewer scattered white hairs or none at all. The roan pattern is dominantly-inherited, and is found in many horse breeds."}, {"url": "http://www.equusite.com/articles/basics/colors/colorsRoan.shtml", "passage_text": "Bay Roan: A Bay Roan is a horse with a bay coat and the roan gene. The roan gene gives the horse interspersed white hairs on his body. The Bay roan sometimes looks very similar to a red roan or a blue roan. Red Roan: A Red Roan (sometimes called Strawberry Roan) is a chestnut or sorrel horse with the roan gene. The roan gene gives the horse interspersed white hairs on his body. Blue Roan: A Blue Roan is a black horse with the roan gene."}, {"url": "https://en.wikipedia.org/wiki/Roan_(color)", "passage_text": "A varnish roan is not a true roan; it is actually one of the leopard complex coat patterns associated with Appaloosa, Knabstrupper, Noriker horse and related breeds. Rabicano is a white pattern that falls into the category of roaning or scattered white hairs, the genetics of which are not yet fully understood. A horse with intermixed white and colored hairs of any color is usually called a roan. However, such mixtures, which can appear superficially similar, are caused by a number of separate genetic factors."}, {"url": "http://www.cowboyway.com/HowTo/HorseColors01.htm", "passage_text": "A blue roan horse has a body with a mixture of black and white hairs. The head and legs frequently have more black hairs than white, making them appear darker. However, there are exceptions to having darker legs, particularly within the draft horse breeds. The horse in the photo below is a blue roan draft horse. "}, {"url": "https://en.wikipedia.org/wiki/Roan_(color)", "passage_text": "Horses with the classic or true roan pattern may be any base color which is intermingled with unpigmented white hairs on the body. Except for white markings under the control of other genes, the head, mane, tail, and lower legs are dark. Roan is a simple dominant trait symbolized by the Rn allele. A horse with intermixed white and colored hairs of any color is usually called a roan. However, such mixtures, which can appear superficially similar, are caused by a number of separate genetic factors."}, {"url": "http://www.ridearoan.com/what-is-a-roan.html", "passage_text": "Roan refers to a horse coat color pattern characterized by an even mixture of colored and white hairs on the body, while the head and points—lower legs, mane and tail—are mostly solid-colored. Horses with roan coats have white hairs evenly intermingled throughout any other color. The head, legs, mane and tail have fewer scattered white hairs or none at all. The roan pattern is dominantly-inherited, and is found in many horse breeds. While the specific mutation responsible for roan has not been exactly identified, a DNA test can determine zygosity for roan in several breeds."}, {"url": "http://www.ridearoan.com/what-is-a-roan.html", "passage_text": "1 However, blue roan is a roan with a black base color. 2  Red roan: red roan used to include both chestnut and bey roans. in 1999, the American Paint Horse Association changed its coat color descriptions: roans with a chestnut background coat are registered red roan while bay roan is its own category. The head, legs, mane and tail have fewer scattered white hairs or none at all. The roan pattern is dominantly-inherited, and is found in many horse breeds. While the specific mutation responsible for roan has not been exactly identified, a DNA test can determine zygosity for roan in several breeds."}, {"url": "https://en.wikipedia.org/wiki/Roan_(color)", "passage_text": "Two blue roans with white hairs intermingled with a black base coat. A horse with intermixed white and colored hairs of any color is usually called a roan. However, such mixtures, which can appear superficially similar, are caused by a number of separate genetic factors."}, {"url": "http://www.vgl.ucdavis.edu/services/Roan.php", "passage_text": "Roan Zygosity Test. Roan is a white patterning coat color trait of intermixed white and colored hairs in the body while the head, lower legs, mane and tail remain colored. Roan horses are born with the pattern, though it may not be obvious until the foal coat is shed. "}]