[{"url": "https://en.wikipedia.org/wiki/Urethra", "passage_text": "In anatomy, the urethra (from Greek οὐρήθρα – ourḗthrā) is a tube that connects the urinary bladder to the urinary meatus for the removal of fluids from the body. Urethra is number 2, dark yellow. In the human female, the urethra is about 1.9 inches (4.8 cm) to 2 inches (5.1 cm) long and exits the body between the clitoris and the vagina, extending from the internal to the external urethral orifice."}, {"url": "http://www.medicinenet.com/urethral_stricture/article.htm", "passage_text": "Urethral stricture refers to any narrowing of the urethra for any reason whether or not it actually impacts the flow of urine out of the bladder. Any inflammation of urethra can result in scarring, which then can lead to a stricture or a narrowing of the urethra. Trauma, infection, tumors, surgeries, or any other cause of scarring may lead to urethral narrowing or stricture. In men, the urethra is a thin tube-like structure that starts from the lower opening of the bladder and traverses the entire length of the penis. In women, it is a shorter opening coming off the lower opening of bladder and is between 2.5 to 4 centimeters (cm) in length."}, {"url": "https://en.wikipedia.org/wiki/Urethral_stricture", "passage_text": "A urethral stricture is a narrowing of the urethra caused by injury, instrumentation, infection and certain non-infectious forms of urethritis. Urethral strictures most commonly result from injury, urethral instrumentation, infection, non-infectious inflammatory conditions of the urethra, and after prior hypospadias surgery."}, {"url": "http://www.urologystone.com/CH02UrinaryTractSystem/urinarytractsystem-urethra.html", "passage_text": "(Click an organ above to see its description.). Urethra. Function In females, the urethra is a tube that conveys urine from the urinary bladder to the outside of the body. In males, the urethra also functions as a urinary canal and as a passageway for cells and secretions from various reproductive organs. The urinary tract system is a group of organs of the body, which are responsible for the excretion of urine. In humans, the urinary system includes 2 kidneys, a pair of tube-like structures, called the ureters, which connect the kidneys to the bladder."}, {"url": "http://patient.info/health/urethral-stricture-leaflet", "passage_text": "0. 8. A urethral stricture is a narrowing of a section of your urethra. It causes a blocked or reduced flow of urine which can lead to complications. There are various treatment options which aim to widen the narrowed section of your urethra. The urethra is the tube that urine flows out of from your bladder. It passes through your penis in men. The urethra is much shorter in women and ends just above your vagina. (In men, semen is also ejaculated through the urethra.). A stricture occurs when a part of your urethra becomes narrowed. Any section of your urethra may be affected. There is usually some scar tissue around the affected part of your urethra that causes the narrowing. The length of strictures vary from less than 1 cm to the full length of the urethra."}, {"url": "http://www.urology.wustl.edu/en/Patient-Care/Urethral-Stricture-Disease/Urethral-Stricture-Evaluation", "passage_text": "The urethra in males is the tube that carries urine from the bladder to the outside of the body and also serves as the channel though which semen is ejaculated. The anterior urethra is the portion of the urethra from the tip of the penis to just before the prostate. The scar (stricture) is composed of dense collagen and fibroblasts (proteins that form cell-producing connective tissue) and thus contracts in all directions, shortening urethral length and narrowing the diameter of the urethra. Strictures usually do not cause symptoms until the urethra tube is below a certain size."}, {"url": "http://emedicine.medscape.com/article/1972482-overview", "passage_text": "The male urethra is a narrow fibromuscular tube that conducts urine and semen from the bladder and ejaculatory ducts, respectively, to the exterior of the body (see the image below). Although the male urethra is a single structure, it is composed of a heterogeneous series of segments: prostatic, membranous, and spongy. The urethra runs through the prostate eccentrically, with most of the prostatic tissue in a posterior and inferior location. The prostatic urethra is surrounded by an inner circular layer and an outer longitudinal layer of smooth muscle."}, {"url": "http://www.urology.wustl.edu/en/Patient-Care/Urethral-Stricture-Disease/Urethral-Stricture-Evaluation", "passage_text": "An anterior urethral stricture is a scar of the urethral epithelium (the urethra’s outside layer of cells) and commonly extends into the underlying corpus spongiosum (a column of erectile tissue that surrounds the urethra). The scar (stricture) is composed of dense collagen and fibroblasts (proteins that form cell-producing connective tissue) and thus contracts in all directions, shortening urethral length and narrowing the diameter of the urethra. Strictures usually do not cause symptoms until the urethra tube is below a certain size."}, {"url": "http://emedicine.medscape.com/article/1972504-overview", "passage_text": "Overview. The female urethra is a relatively simple tubular structure that has the sole purpose of conducting urine from the bladder to the outside of the body. It is a short structure without complex investing structures; thus, it is less prone to intrinsic pathology than the male urethra is. "}]