[{"url": "http://pestcontrol.about.com/od/controllinggardenpests/fl/Good-and-Bad-Ladybugs.htm", "passage_text": "Photo by Scott Bauer/USDA. Ladybugs are the subject of nursery rhymes (lady bug, lady bug, fly away home…), the name of a girls' soccer team of movie fame, and considered a good luck symbol by many. They are beneficial insects because they feed on plant pests and they live outdoors … usually"}, {"url": "http://www.angelfire.com/stars5/tiffany2144/Omens/Insects.htm", "passage_text": "To kill a spider is --- UNLUCKY. Wasp: To be stung by one is a warning to be on your guard against jealousy, deception and danger. undefined. Insects Omens -- Insects Good and Bad Ant: If you are bitten by an ant it foretells of enmity and quarrels. But if ants build a nest on the threshold of your property prosperity is indicated. Bee: Luck comes into the house with a bee, but only if it is not kept a prisoner. To kill a bee is considered bad luck. In some places fishermen believe they will have a good catch if a bee follows the course of their boat."}, {"url": "http://animals.mom.me/ladybugs-considered-good-luck-5881.html", "passage_text": "Superstition. Even though the ladybug is a North American insect, its delicate and artistic appearance has made it popular In many cultures, with a variety of superstitions to go along. One well-known superstition shared with children across cultures is: Never kill a ladybug because doing so will bring bad luck. Farmers encourage ladybug populations in their fields because ladybugs protect crops from insects, especially from aphids and other sap feeders who can do great damage. A single ladybug can eat as many as 5,000 aphids in its lifetime, according to the University of Kentucky Department of Entomology."}, {"url": "http://superstitionlane.com/popular/ladybug-superstitions/", "passage_text": "1 Many farmers consider ladybugs lucky because the eat some of the bad insects that spoil crops. 2  Ladybugs are considered lucky in Canada if they are found hibernating in a garage. 3  A ladybug is good luck if they land on your hand on a Sunday and you can count to 22 before she flies away. Some Interesting Ladybug Facts. 1  A ladybug will bring you good luck if one lands on you. 2  If a ladybug will take the illness away if you are ill when one lands on you. 3  Let the ladybug go and watch which way she flies and that is the way your answer lays. 4  Finding a ladybug is good luck, the redder the better."}, {"url": "http://www.answers.com/Q/Which_insects_are_considered_good_luck", "passage_text": "Because most clover have only three leaves not four, so it takes a  bit of luck to find a four leaf bit of clover in a field.   The Irish have a tradition that says if so … meone finds one by  accident they will have good luck. "}, {"url": "http://animals.mom.me/ladybugs-considered-good-luck-5881.html", "passage_text": "Having a ladybug land on you can be a magical moment. While other insects may pose a threat to humans, animals and crops alike, ladybugs are harmless -- and even better, they're beneficial! That's why so many cultures over the centuries have cherished ladybugs, believing them to bring good luck. Farmers encourage ladybug populations in their fields because ladybugs protect crops from insects, especially from aphids and other sap feeders who can do great damage. A single ladybug can eat as many as 5,000 aphids in its lifetime, according to the University of Kentucky Department of Entomology."}, {"url": "http://www.angelfire.com/stars5/tiffany2144/Omens/Insects.htm", "passage_text": "Omens -- Insects Good and Bad. Ant: If you are bitten by an ant it foretells of enmity and quarrels. But if ants build a nest on the threshold of your property prosperity is indicated. Bee: Luck comes into the house with a bee, but only if it is not kept a prisoner. To kill a bee is considered bad luck. In some places fishermen believe they will have a good catch if a bee follows the course of their boat"}, {"url": "http://www.wikihow.com/Be-Lucky", "passage_text": "Look for lucky bugs. In many cultures, insects and other bugs are thought of as being lucky signs that bring fortune. Sometimes killing these insects can be considered bad luck, so it's a good idea to be aware of them and let them be. "}, {"url": "http://superstitionlane.com/popular/cricket-superstitions/", "passage_text": "Cricket Luck – in most instances crickets are considered good luck or a creature that will bring good luck to the person that sees them. Cricket luck is the friendly chirping sound of many crickets sound like a fine tuned orchestra on a summer’s night. An ordinary cricket at the foot of the fireplace may be considered a sign of good fortune, but a cricket in the ground, the mole cricket, is a serious farm pest and a sign of bad cricket luck for a farmer."}]