[{"url": "http://www.yourdictionary.com/toroid", "passage_text": "LINK / CITE ADD TO WORD LIST. noun. The definition of a toroid is a doughnut-shaped object that is formed by a curved surface, shape or body that rotates around a center point without intersecting it. An example of a toroid is a doughnut-shaped O-ring. "}, {"url": "https://en.wikipedia.org/wiki/Toroid", "passage_text": "It is a ring form of a solenoid. Its annular shape is generated by revolving a plane geometrical figure about an axis external to that figure which is parallel to the plane of the figure and does not intersect the figure. If the revolved figure is a circle, then the surface of such an object is known as a torus. More generally, a toroid may have any number of holes, may or may not be orientable, and its surface may be decomposed into polygonal faces. One of the best-known applications of the toroid shape is in a Tokamak device, which uses a magnetic field to confine a plasma in the shape of a torus"}, {"url": "https://en.wikipedia.org/wiki/Toroidal_transformer", "passage_text": "The major scale is in inches. A small toroidal transformer. Toroidal inductors and transformers are passive electronic components, typically consisting of a circular ring-shaped magnetic core of high magnetic permeability material such as iron powder or ferrite, around which wire is coiled to make an inductor. Figure 3 of this section shows the most common toroidal winding. It fails both requirements for total B field confinement. Looking out from the axis, sometimes the winding is on the inside of the core and sometimes it is on the outside of the core. It is not axially symmetric in the near region."}, {"url": "http://whatis.techtarget.com/definition/toroid", "passage_text": "A toroid is a coil of insulated or enameled wire wound on a donut-shaped form made of powdered iron. A toroid is used as an inductor in electronic circuits, especially at low frequencies where comparatively large inductances are necessary. A toroid has more inductance, for a given number of turns, than a solenoid with a core of the same material and similar size."}, {"url": "http://www.oxforddictionaries.com/definition/english/toroid", "passage_text": "Example sentences. 1  A toroid generated by a circle; a surface having the shape of a doughnut. 2  Polyamines also induce the collapse of isolated long DNA chains from dilute solutions with formation of toroids showing a local hexagonal packing of DNA. 1 A toroid generated by a circle; a surface having the shape of a doughnut. 2  Polyamines also induce the collapse of isolated long DNA chains from dilute solutions with formation of toroids showing a local hexagonal packing of DNA."}, {"url": "http://www.audioenglish.org/dictionary/toroid.htm", "passage_text": "• TOROID (noun). The noun TOROID has 2 senses: 1. the doughnut-shaped object enclosed by a torus. 2. a ring-shaped surface generated by rotating a circle around an axis that does not intersect the circle. Familiarity information: TOROID used as a noun is rare. Dictionary entry details."}, {"url": "http://www.merriam-webster.com/dictionary/toroid", "passage_text": "Definition of TOROID. 1. : a surface generated by a closed plane curve rotated about a line that lies in the same plane as the curve but does not intersect it. 2. : a body whose surface has the form of a toroid. ADVERTISEMENT. New Latin torus"}, {"url": "http://whatis.techtarget.com/definition/toroid", "passage_text": "Part of the Electronics glossary: A toroid is a coil of insulated or enameled wire wound on a donut-shaped form made of powdered iron. A toroid is used as an inductor in electronic circuits, especially at low frequencies where comparatively large inductances are necessary. A toroid has more inductance, for a given number of turns, than a solenoid with a core of the same material and similar size. This makes it possible to construct high-inductance coils of reasonable physical size and mass"}]