[{"url": "http://www.fool.com/investing/general/2014/01/09/abiomed-inc-the-best-medical-device-companies-of-2.aspx", "passage_text": "The company plans to use results from this study to file for a Humanitarian Device Exemption, or HDE. That exemption is designed to allow use of devices in small patient populations of 4,000 people or less and could come as early as February 2015. It's also working on a device for use in children. Pumping up sales. Abiomed has been around since 1981, but share prices really took off in 2013 thanks to rising demand for the company's Impella product line, which includes catheters, sensors, and pumps used to boost circulation before, during, and after heart surgery."}, {"url": "http://php.sys-con.com/node/1259592", "passage_text": "PHP is one of the most popular scripting languages used for web development. The latest version of PHP, PHP 7 is a new version of the language that is been optimized for fast performance. However, PHP has a rival in HHVM (Hip Hop Virtual Machine) — a virtual tool that executes PHP code. The company expects to incur incremental development costs of up to $3 million in 2010. Overall financial guidance for 2010 will be provided during the upcoming fourth quarter earnings call. This technology represents a compelling opportunity for Thoratec as we broaden our leadership position in MCS therapies"}, {"url": "https://en.wikipedia.org/wiki/Abbott_Laboratories", "passage_text": "Abbott, which already employs 1,400 people in Russia, said it planned to set up a manufacturing presence in the country once the deal closed. Abbott Laboratories has been present in India for over 100 years through its subsidiary Abbott India Limited and it is currently India 's largest healthcare products company. On March 22, 2010, the company completed its acquisition of a Hollywood, Florida-based LIMS company STARLIMS. Under the terms of the deal, Abbott Laboratories acquired the company for $14 per share in an all-cash transaction valued at $123 million."}, {"url": "http://php.sys-con.com/node/1259592", "passage_text": "For more information, visit the company's web sites at http://www.thoratec.com or http://www.itcmed.com. Thoratec, the Thoratec logo, HeartMate and HeartMate II are registered trademarks of Thoratec Corporation and IVAD is a trademark of Thoratec Corporation. The company expects to incur incremental development costs of up to $3 million in 2010. Overall financial guidance for 2010 will be provided during the upcoming fourth quarter earnings call. This technology represents a compelling opportunity for Thoratec as we broaden our leadership position in MCS therapies"}, {"url": "https://en.wikipedia.org/wiki/St._Jude_Medical", "passage_text": "St. Jude Medical, Inc. (NYSE: STJ) is a global medical device company headquartered in Saint Paul, Minnesota, United States. The company has more than 20 principal operations and manufacturing facilities worldwide with products sold in more than 100 countries. The company is named after Jude the Apostle, the patron saint of lost causes. St. Jude Medical was founded in 1976 and went public in 1977. The company has been listed in the Fortune 500 every year since 2010. Daniel Starks serves as the company's chairman, president and chief executive officer"}, {"url": "https://en.wikipedia.org/wiki/Abbott_Laboratories", "passage_text": "Abbott Laboratories is an American pharmaceuticals and health care products company. It has 72,000 employees and operates in over 130 countries. The company headquarters are in Abbott Park, North Chicago, Illinois. On March 22, 2010, the company completed its acquisition of a Hollywood, Florida-based LIMS company STARLIMS. Under the terms of the deal, Abbott Laboratories acquired the company for $14 per share in an all-cash transaction valued at $123 million."}, {"url": "http://www.fool.com/investing/general/2014/01/09/abiomed-inc-the-best-medical-device-companies-of-2.aspx", "passage_text": "Regardless, the company is still making money, and the sales upside has strengthened Abiomed's balance sheet. The company remains debt free, with roughly $71 million in cash, cash equivalents, and short-term investments on its books. Pumping up sales. Abiomed has been around since 1981, but share prices really took off in 2013 thanks to rising demand for the company's Impella product line, which includes catheters, sensors, and pumps used to boost circulation before, during, and after heart surgery."}, {"url": "https://en.wikipedia.org/wiki/Abbott_Laboratories", "passage_text": "In 1964, it acquired Ross Laboratories, making Ross a wholly owned subsidiary of Abbott. In 2001, the company acquired Knoll, the pharmaceutical division of BASF. In 2002, it divested the Selsun Blue brand to Chattem. On March 22, 2010, the company completed its acquisition of a Hollywood, Florida-based LIMS company STARLIMS. Under the terms of the deal, Abbott Laboratories acquired the company for $14 per share in an all-cash transaction valued at $123 million."}]