[{"url": "http://www.towson.edu/ows/moduleSVAGR.htm", "passage_text": "Thus, if a subject is singular, its verb must also be singular; if a subject is plural, its verb must also be plural. In the present tense, nouns and verbs form plurals in opposite ways: nouns ADD an s to the singular form; verbs REMOVE the s from the singular form."}, {"url": "http://www.thinkbabynames.com/meaning/0/Minuit", "passage_text": "Minuit /mi-nu-it/ [2 sylls.] as a girls' name is of French origin, and the meaning of Minuit is midnight. Also the surname of the Dutch explorer who bought Manhattan island from the Canarsee Indians in the 17th century. Kreatif forms: Mannuit, Manuit, Maynuit. [ more ]."}, {"url": "http://www.thinkbabynames.com/meaning/0/Minuit", "passage_text": "Minuit is an unusual first name for women and an equivalently unusual last name too for all people. (2000 U.S. Census). Charted below is the birth name popularity of Minuit for girls. Minuit has yet to be recorded in the list so far."}, {"url": "http://www.oxforddictionaries.com/words/verbs", "passage_text": "Verbs. A verb describes what a person or thing does or what happens. For example, verbs describe: an action – run, hit, travel. an event – rain, occur. a situation – be, seem, have. a change – become, grow, develop. The basic form of a verb is known as the infinitive."}, {"url": "http://www.laits.utexas.edu/tex/gr/vpr1.html", "passage_text": "When used with an auxiliary verb such as aimer (to like), the infinitive of a pronominal verb agrees with its subject. When pronominal verbs are used with parts of the body, they take the definite article (le, la, les) rather than the possessive article as in English: Tex se lave les mains."}, {"url": "http://nameberry.com/nametalk/threads/67746-VERB-Baby-Names", "passage_text": "I actually really like this one.) Weather (again, a noun and a verb; I like the meaning as a verb, though, and it reminds me of what I like about female virtue names like Patience and Temperance. I think this sounds more masculine the feminine, but others might disagree, especially since it rhymes with Heather)."}]