[{"url": "http://homeguides.sfgate.com/can-refinance-first-second-mortgage-combined-2238.html", "passage_text": "Typically, your current lender will waive certain closing costs and fees to keep your business. This will make the refinancing option cheaper for you in the long run. Request information on mortgage refinancing and tell the lender that you want to combine your first and second mortgages into a single loan."}, {"url": "http://mortgageporter.com/2011/12/refinancing-when-you-have-an-existing-second-mortgage-or-heloc.html", "passage_text": "When you are refinancing your primary mortgage and you have an existing second mortgage or HELOC (home equity line of credit), the new lender will require to stay in “first lien position”. This boils down to who has first dibs on a property in the event of a foreclosure. It will either need to be subordinated (it’s up the second mortgage lien holder whether or not they will approve the refinance of the first mortgage and allow a subordination to take place); or it will need to be paid off when you refi the first mortgage (either cash or increasing your loan amount)."}, {"url": "http://budgeting.thenest.com/possible-combine-mortgage-second-mortgage-100-ltv-29389.html", "passage_text": "If you find that you can't combine your first and second mortgages into one loan, you might still be able to refinance your primary loan to at least take advantage of the lower interest rates and resulting lower monthly payment that can come with a refinance. You can call around to any mortgage lender licensed to do business in your state -- not just the lender to whom you already send your mortgage payments -- to determine if any of them are willing to combine your first and second mortgage loans through a refinance even if you have no equity. Most lenders won't do this."}, {"url": "http://www.nolo.com/legal-encyclopedia/what-happens-if-you-default-second-mortgage.html", "passage_text": "If you refinance your first mortgage, that lender will require the second mortgage lender to execute a subordination agreement. In a subordination agreement, the second mortgage holder consents to subordinating its loan to the refinanced loan. A second mortgage is a loan you take out using your house as security that is junior to another mortgage (a first mortgage). A few common examples of second mortgages are home equity loans and home equity lines of credit (HELOCs)."}, {"url": "http://budgeting.thenest.com/possible-combine-mortgage-second-mortgage-100-ltv-29389.html", "passage_text": "You can combine your first and second mortgage loans into one loan with one payment through a refinance. But refinancing your mortgage loan when you are at a loan-to-value rate of 100 percent -- meaning you owe as much on your mortgage loan as what your home is worth -- is already a challenging task. You can call around to any mortgage lender licensed to do business in your state -- not just the lender to whom you already send your mortgage payments -- to determine if any of them are willing to combine your first and second mortgage loans through a refinance even if you have no equity. Most lenders won't do this."}, {"url": "http://budgeting.thenest.com/possible-combine-mortgage-second-mortgage-100-ltv-29389.html", "passage_text": "You have no equity at all. When you add the challenge of trying to refinance a first and second mortgage loan -- your second loan can be a home equity loan, true second mortgage or home equity line of credit -- into one single loan at 100 percent LTV, you are truly taking on a difficult task. You can call around to any mortgage lender licensed to do business in your state -- not just the lender to whom you already send your mortgage payments -- to determine if any of them are willing to combine your first and second mortgage loans through a refinance even if you have no equity. Most lenders won't do this."}, {"url": "http://homeguides.sfgate.com/can-refinance-first-second-mortgage-combined-2238.html", "passage_text": "A first and second mortgage can be consolidated into one. Yes, you can refinance your mortgage to combine a first and second mortgage debt. If the first and second mortgage were taken out at the same time, the refinance transaction would be a rate and term refinance. This will make the refinancing option cheaper for you in the long run. Request information on mortgage refinancing and tell the lender that you want to combine your first and second mortgages into a single loan."}, {"url": "http://www.nolo.com/legal-encyclopedia/what-happens-if-you-default-second-mortgage.html", "passage_text": "If you have a second mortgage on your home and fall behind in payments, the second mortgage lender may or may not foreclose, depending on the value of your home. Read on to find out what happens if you stop making payments on a second mortgage and when that lender may decide to initiate a foreclosure. A second mortgage is a loan you take out using your house as security that is junior to another mortgage (a first mortgage). A few common examples of second mortgages are home equity loans and home equity lines of credit (HELOCs)."}, {"url": "http://budgeting.thenest.com/possible-combine-mortgage-second-mortgage-100-ltv-29389.html", "passage_text": "When you refinance a first and second loan, your primary lender will ask that the holder of your second loan agree to remain in its current, subordinate, position. If the second lender does not agree to this, you will not be able to refinance both mortgage loans, whether or not you are at 100 percent LTV. You can call around to any mortgage lender licensed to do business in your state -- not just the lender to whom you already send your mortgage payments -- to determine if any of them are willing to combine your first and second mortgage loans through a refinance even if you have no equity. Most lenders won't do this."}, {"url": "http://homeguides.sfgate.com/can-roll-second-mortgage-first-mortgage-3100.html", "passage_text": "Rolling your first and second mortgages into one loan can save money each month. Second mortgages provide homeowners with a variety of options when financing their homes. Some people use second mortgages to avoid mortgage insurance when they purchase the home. "}]