[{"url": "http://resources.woodlands-junior.kent.sch.uk/homework/greece/food.htm", "passage_text": "Food. The Greek diet was very healthy. Food in Ancient Greece consisted of grains, wheat, barley, fruit, vegetables, breads, and cake. The Ancient Greeks grew olives, grapes, figs and wheat and kept goats, for milk and cheese. They ate lots of bread, beans and olives. In the Summer months there were plenty of fresh fruit and vegetables to eat and in the winter they ate dried fruit and food they had stored like apples and lentils."}, {"url": "http://greekfood.about.com/od/quenstionsanswers/f/ancientfood.htm", "passage_text": "The foods of ancient Greece were similar to foods we eat today, but did not include many that have become important parts of modern Greek cooking."}, {"url": "http://www.answers.com/Q/What_crops_did_the_Ancient_Greeks_grow", "passage_text": "Therefore, agriculture was very important in ancient Greece because the crops farmers grew and the animals they raised were what Greeks ate. The ancient Greeks ate many different kinds of foods. Since they lived near the Mediterranean Sea, they usually caught fish, squid, and octopus for their meals."}, {"url": "http://www.historyforkids.net/greek-food.html", "passage_text": "Perhaps the most important food to the ancient (and modern) Greeks was the olive. It was not simply a food. It was also a big part of Greek history. Greeks believed that the goddess Athena gave the first olive tree to Athens before it eventually spread to the rest of Greece. Olives were used in many recipes."}, {"url": "http://www.answers.com/Q/What_crops_did_the_Ancient_Greeks_grow", "passage_text": "In addition to these meats, ancient Greeks grew a lot of their own food. The crops that they grew and ate most were radishes, celery, beans, olives, and different kinds of fruit. They also grew wheat to make bread and cakes."}, {"url": "http://ucdsb.libanswers.com/a.php?qid=248663", "passage_text": "Lemons, oranges, eggplant, and rice also arrived later. But the ancient Greeks enjoyed a varied diet. Vegetables, legumes, and fruit were the mainstay, and fish was a favorite. Hunting brought game to the menu."}, {"url": "http://www.historyforkids.net/greek-food.html", "passage_text": "Vegetables were a huge part of the Greek diet. Most Greeks ate a diet that was almost vegetarian. Among the most common vegetables and plants eaten by Greeks were asparagus, fennel, cucumbers, chickpeas, and celery. They also gathered and boiled dandelions to eat."}, {"url": "http://ucdsb.libanswers.com/a.php?qid=248663", "passage_text": "The foods of ancient Greece were similar to foods we eat today. The ancient Greeks enjoyed a varied diet. Vegetables, legumes, and fruit were the mainstay, and fish was a favorite."}]