[{"url": "http://www.jamesvilledewitt.org/", "passage_text": "We are a district of approximately 2900 students supported by a community deeply committed to quality education. Our district prides itself for excellence in academic performance; but it is equally proud of our student performance in the arts, athletics, as well as our students’ contributions to their community."}, {"url": "http://www.syracuse.com/entertainment/index.ssf/2015/01/jamesville-dewitt_high_school_students_present_the_wedding_singer_as_spring_high.html", "passage_text": "Jamesville-DeWitt High School students present 'The Wedding Singer' as spring high school musical. Jamesville-DeWitt Little Shop of Horrors. Jamesville-DeWitt High School students rehearse for their spring 2015 high school musical The Wedding Singer. high school musicals 2015 (Submitted photo by Mark Kotzin)."}, {"url": "http://www.syracuse.com/entertainment/index.ssf/2015/01/jamesville-dewitt_high_school_students_present_the_wedding_singer_as_spring_high.html", "passage_text": "View/Post Comments. Students at Jamesville-DeWitt High School will be the first local school to perform 'The Wedding Singer' as their spring 2015 high school musical 7 p.m. Thursday, Friday and Saturday, Feb. 5, 6 and 7 in the high school's Osborn Auditorium, 6845 Edinger Drive, DeWitt, NY 13214."}, {"url": "http://www.maxpreps.com/high-schools/jamesville-dewitt-red-rams-(dewitt,ny)/lacrosse/schedule.htm", "passage_text": "No Schedule Available. MaxPreps does not have a schedule for the Jamesville-DeWitt lacrosse team. If you have access to the schedule please email it to schedules@maxpreps.com or fax it to (888) 850-3086."}, {"url": "http://www.maxpreps.com/high-schools/jamesville-dewitt-red-rams-(dewitt,ny)/basketball/schedule.htm", "passage_text": "No Schedule Available. MaxPreps does not have a schedule for the Jamesville-DeWitt basketball team. If you have access to the schedule please email it to schedules@maxpreps.com or fax it to (888) 850-3086. Add Team Photo."}]