[{"url": "http://www.governmenttraininginc.com/pdfs/Cost-Reimbursable-TOC-Excerpt.pdf", "passage_text": "A cost-reimbursement contract is a contract where a contractor is paid for all of its allowed expenses to a set limit, plus additional payment to allow for a profit. Cost-reimbursement contracts contrast with a fixed-price contract, in which the contractor is paid a negotiated amount regardless of incurred expenses. It also is a contract cost limitation that the contractor cannot exceed, except at the risk of non-reimbursement. This limit can be changed by mutual agreement of the government and the contractor through a modification to the contract."}, {"url": "http://www.legalmatch.com/law-library/article/cost-plus-fixed-fee-contracts.html", "passage_text": "A cost-plus fixed fee contract is a specific type of contract wherein the contractor is paid for the normal expenses for a project, plus an additional fixed fee for their services. These allow the contractor to collect a profit on the project, and they encourage economic production in various industries. "}, {"url": "http://smallbusiness.chron.com/advantages-cost-plus-contract-3316.html", "passage_text": "The Advantages of a Cost Plus Contract. Cost plus contracts are often called sweetheart deals. signing a contract image by William Berry from Fotolia.com. Cost plus contracts are some of the most beneficial around and caused some controversy during the second Iraq War because of their profitability. Cost plus contracts contain certain clauses, such as the maximum cost guarantee and the savings clause, that alter their advantages. The maximum cost clause reduces risk to the business because the contractor must determine if he can work within that agreed upon sum and pay for any possible overages."}, {"url": "http://law.freeadvice.com/general_practice/contract_law/cost-reimbursement-contract.htm", "passage_text": "Also called a cost plus contract, cost reimbursement contracts are used by governments, private individuals and businesses that are embarking on building or construction projects, on research projects or on other endeavors where a certain amount of materials will need to be purchased. Entering into a Cost Reimbursement Contract. While cost reimbursement contracts have several advantages, including encouraring the use of higher quality materials, there are also some significant disadvantages as well. The biggest disadvantage is that the cost is uncertain at the time when a project is started and when the parties enter into the contract"}, {"url": "https://en.wikipedia.org/wiki/Cost-plus_contract", "passage_text": "Cost-plus redirects here. For the pricing technique, see cost-plus pricing. A cost-plus contract, also termed a cost reimbursement contract, is a contract where a contractor is paid for all of its allowed expenses to a set limit plus additional payment to allow for a profit. "}, {"url": "http://smallbusiness.chron.com/advantages-cost-plus-contract-3316.html", "passage_text": "Disadvantages. If you have a strict budget, cost plus contracts are a poor choice because it has much greater cost uncertainty than fixed-price contracts and you do not know the final price of the project. Cost plus contracts contain certain clauses, such as the maximum cost guarantee and the savings clause, that alter their advantages. The maximum cost clause reduces risk to the business because the contractor must determine if he can work within that agreed upon sum and pay for any possible overages."}, {"url": "http://law.freeadvice.com/general_practice/contract_law/cost-reimbursement-contract.htm", "passage_text": "The terms of a cost reimbursement contract specify that the contractor (the builder, researcher or person performing the work) will be compensated for actual costs, which are uncertain at the time the contract is written. Entering into a Cost Reimbursement Contract. While cost reimbursement contracts have several advantages, including encouraring the use of higher quality materials, there are also some significant disadvantages as well. The biggest disadvantage is that the cost is uncertain at the time when a project is started and when the parties enter into the contract"}, {"url": "http://law.freeadvice.com/general_practice/contract_law/cost-reimbursement-contract.htm", "passage_text": "Cost Reimbursement Contract vs. Fixed Price Contract. Often, when a construction or a building project is starting, the actual costs of materials are not known and it can be difficult for a contractor to provide a fixed price contract for completing the project. Entering into a Cost Reimbursement Contract. While cost reimbursement contracts have several advantages, including encouraring the use of higher quality materials, there are also some significant disadvantages as well. The biggest disadvantage is that the cost is uncertain at the time when a project is started and when the parties enter into the contra"}, {"url": "http://www.gsa.gov/graphics/ogp/fixed_vs_cost_contracts_R2-uN5-j_0Z5RDZ-i34K-pR.doc", "passage_text": "A cost-plus-incentive-fee contract is a cost-reimbursement contract that provides for an initially negotiated fee to be adjusted later by a formula based on the relationship of total allowable costs to total target costs. Cost-plus-incentive-fee contracts are covered in Subpart 16.4, Incentive Contracts. 16.303 Cost-sharing contracts. (a) Description. A cost-sharing contract is a cost-reimbursement contract in which the contractor receives no fee and is reimbursed only for an agreed-upon portion of its allowable costs."}]