[{"url": "http://www.capsimax.com/capsimax-difference", "passage_text": "Capsimax Difference. Consuming large amounts of red pepper, or even supplements with high doses of capsaicinoids, can be too hot for most digestive tracts to handle. Imagine the burning sensation you get from eating a habanero pepper, one of the hottest peppers in the world. OmniBead™ beadlets encapsulate natural capsicum in a controlled-release coating, delivering effective levels of capsaicinoids without the oral and gastric burning sensation of unprotected red hot peppers. Capsimax ' s outer coating can withstand the level of acids found in our stomachs."}, {"url": "http://en.anastore.com/articles/DD18_capsimax.php", "passage_text": "CAPSIMAX is a patented composition of capsicum extract, caffeine, piperine (black pepper extract) and niacin. One capsule of Capsimax corresponds to over 200 mg of highly concentrated capsicum extract. It has been clinically proven by a study carried out on 25 subjects at the University of Oklahoma in the United States that taking Capsimax before exercise helps to raise the metabolism before, during and after exertion."}, {"url": "http://www.getdietsolutions.com/capsimax/", "passage_text": "CapsiMax contains extract of the capsicum chili pepper. It is a concentration equivalent to about 10 grams of the natural peppers. Capsicum is extremely potent and thought to have the best potential to affect weight-loss of any chili pepper. The truth is that CapsiMax is a pretty simple weight-loss ingredient. It has only one active weight-loss agent working for you and they tend to charge a lot for products with CapsiMax in them."}, {"url": "http://www.naturalproductsinsider.com/news/2010/10/capsimax-promotes-fat-burning.aspx", "passage_text": "SHORT HILLS, N.J.—The proprietary hot red pepper extract Capsimax™ from OmniActive Health Technologies promoted a lipolytic effect as measured by an increase in free fatty acids and glycerol in blood compared to placebo in a recent study (Lipids in Health and Disease 2010, 9:72doi:10.1186/1476-511X-9-72). "}, {"url": "http://www.youtube.com/watch?v=kE0pCrGSK6A", "passage_text": "Dr. Richard Bloomer explains how his product Capsimax should be avoided if you are not able to tolerate spicy foods due to the product having a chili pepper extract in it. He also cautions how some can get stomach upset or GI burning from the product. "}, {"url": "http://www.webmd.com/vitamins-supplements/ingredientmono-945-CAPSICUM.aspx?activeIngredientId=945&activeIngredientName=CAPSICUM", "passage_text": "CAPSICUM Overview Information. Capsicum, also known as red pepper or chili pepper, is an herb. The fruit of the capsicum plant is used to make medicine. Capsicum is used for various problems with digestion including upset stomach, intestinal gas, stomach pain, diarrhea, and cramps. It is also used for conditions of the heart and blood vessels including poor circulation, excessive blood clotting, high cholesterol, and preventing heart disease. 1 It’s best to apply capsicum to the nostril that is on the same side of the head as the headache. 2  Relieving symptoms of perennial rhinitis, a runny nose not associated with allergies or infection, when used in the nose. 3  Sometimes the benefit can last for 6-9 months."}, {"url": "http://www.capsimax.com/capsimax-difference", "passage_text": "Look for Capsimax in your favorite capsule, tablet and drink mix supplement for weight management, sports nutrition, healthy metabolism and active lifestyles. Capsimax Capsicum Extract provides the benefits of red hot peppers without the burn. OmniBead™ beadlets encapsulate natural capsicum in a controlled-release coating, delivering effective levels of capsaicinoids without the oral and gastric burning sensation of unprotected red hot peppers. Capsimax ' s outer coating can withstand the level of acids found in our stomachs."}, {"url": "http://www.webmd.com/vitamins-supplements/ingredientmono-945-CAPSICUM.aspx?activeIngredientId=945&activeIngredientName=CAPSICUM", "passage_text": "One form of capsicum is currently being studied as a drug for migraine, osteoarthritis, and other painful conditions. A particular form of capsicum causes intense eye pain and other unpleasant effects when it comes in contact with the face. This form is used in self-defense pepper sprays. 1 It’s best to apply capsicum to the nostril that is on the same side of the head as the headache. 2  Relieving symptoms of perennial rhinitis, a runny nose not associated with allergies or infection, when used in the nose. 3  Sometimes the benefit can last for 6-9 months."}, {"url": "http://www.capsimax.com/", "passage_text": "A ward-winning, category-creating Capsimax ® is concentrated highly-active, natural capsicum extract from red hot chili peppers that delivers all of the heat of capsaicin without the burn. A natural, non-stimulant dietary ingredient, Capsimax is available in hundreds of products around the world. Those products include active lifestyle supplements, supplements for healthy metabolism, weight management capsules and powders, sports nutrition capsules and powders and antioxidant supplements."}]