[{"url": "http://www.christianpost.com/news/microsoft-band-back-in-stores-will-hit-best-buy-stores-before-apple-watch-april-24-release-135478/", "passage_text": "The Microsoft Band has been recently out of stock in the Microsoft Store, but some reports are saying that this move of Microsoft is governed by the company's awareness of Apple's possible effect on the market, according to a report in Windows Central."}, {"url": "http://www.neowin.net/news/microsoft-stores-rumored-to-receive-new-band-units-today", "passage_text": "The Microsoft Band sold out quickly almost everywhere mainly because of its very limited stock but Microsoft is supposedly shipping a fresh batch of devices to its stores today."}, {"url": "http://www.winbeta.org/news/want-microsoft-band-microsoft-store-online-will-have-limited-supply-purchase-tomorrow-nov-18th", "passage_text": "Written By Ron Nov 18th, 2014. Microsoft unveiled the Microsoft Band on October 29th and the device has been out of stock for quite some time now. For those of you who are eager to get your hands on the device, Microsoft is offering a limited number of units for purchase tomorrow via the online Microsoft Store. Microsoft has sent out email notifications for those eagerly waiting for a Microsoft Band. Tomorrow, you can snag one — if you hurry."}, {"url": "http://www.windowscentral.com/microsoft-band-possibly-back-stock-saturday-microsofts-retail-stores", "passage_text": "If you're still looking to get your hands on a Microsoft Band, you may be in luck this weekend — if you make the trek to a Microsoft Store, that is. According to a tip from one of our readers, Microsoft Stores could have more of the wearables available for sale as early as this Saturday, January 3rd."}, {"url": "http://www.engadget.com/2014/10/29/microsoft-band-leak/", "passage_text": "Update: Microsoft confirmed that the Band will go on sale for $199 Thursday in its online and physical stores, to US customers only, in limited quantities.."}, {"url": "http://www.christianpost.com/news/microsoft-band-back-in-stores-will-hit-best-buy-stores-before-apple-watch-april-24-release-135478/", "passage_text": "+. By Liezl Dunuan, Christian Post Contributor. March 11, 2015 | 2:17 pm. In an apparent bid to counter Apple's possible domination of the wearable tech market with the upcoming release of the Apple Watch, Microsoft has re-stocked supplies of its Microsoft Band in its online store."}, {"url": "http://www.windowscentral.com/microsoft-band-units-are-back-stock-us-brick-and-mortar-microsoft-stores", "passage_text": "If you have been waiting for a chance to get your hands on the $199 Microsoft Band, you might be able to do just that. Microsoft has just announced that units of the fitness and notification wrist device are back in stock at all of the brick-and-mortar Microsoft Store locations in the US."}]