[{"url": "http://naics-codes.findthedata.com/", "passage_text": "The North American Industry Classification System (NAICS) is the standard used by Federal statistical agencies in classifying business establishments for the purpose of collecting, analyzing, and publishing statistical data related to the U.S. business economy."}, {"url": "http://dor.wa.gov/content/aboutus/statisticsandreports/sic_vs_naics.aspx", "passage_text": "These codes were developed by the federal government and are used by the U.S. Office of Management and Budget (OMB) as well as many other U.S. statistical agencies. In 1997, OMB adopted NAICS as its new industry classification system. Every registered Washington firm is assigned a SIC or NAICS code."}, {"url": "http://sic-codes.findthedata.com/", "passage_text": "Search by SIC Code. The Standard Industrial Classification (SIC) code system is used to classify a firm's primary industry. Search by Industry. An industry is the primary business activity of any firm. Industries are determined by common products, services, production and delivery system of businesses."}, {"url": "http://siccode.com/en/pages/what-is-a-naics-code", "passage_text": "The North American Industry Classification System (NAICS) is used by businesses and governments to classify and measure economic activity in the United States, Canada, and Mexico."}, {"url": "http://www.census.gov/eos/www/naics/", "passage_text": "The North American Industry Classification System (NAICS) is the standard used by Federal statistical agencies in classifying business establishments for the purpose of collecting, analyzing, and publishing statistical data related to the U.S. business economy."}, {"url": "http://siccode.com/", "passage_text": "The North American Industry Classification System (NAICS) is used by businesses and governments to classify and measure economic activity in Canada, Mexico, and the United States. NAICS is currently the standard used by federal statistical agencies in classifying ... more info."}, {"url": "http://naics-codes.findthedata.com/", "passage_text": "Today, the NAICS code system is the standard system for industry classification. NAICS Codes and SIC Codes. Both SIC and NAICS codes are used to classify establishments by industry. The NAICS code system was adopted in 1997 to replace the Standard Industrial Classification (SIC) system."}]