[{"url": "http://training.seer.cancer.gov/anatomy/muscular/structure.html", "passage_text": "Each skeletal muscle fiber is a single cylindrical muscle cell. An individual skeletal muscle may be made up of hundreds, or even thousands, of muscle fibers bundled together and wrapped in a connective tissue covering. Each muscle is surrounded by a connective tissue sheath called the epimysium. Fascia, connective tissue outside the epimysium, surrounds and separates the muscles"}, {"url": "http://www.topendsports.com/testing/tests/muscle-fiber-composition.htm", "passage_text": "This is a simple indirect test that is used to estimate the predominant muscle fiber type-slow twitch or fast twitch. It is interesting for athletes to know the composition of their muscle fibers. If they are primarily a strength or speed athlete, they want fast twitch fibers. For endurance athletes, more slow twitch fibers is optimal. This test does not replace an actual muscle fiber composition test, which would be more accurate but involves an invasive muscle biopsy and more sophisticated analysis. 1  purpose: to estimate the predominant muscle fiber type for any given muscle group."}, {"url": "https://en.wikipedia.org/wiki/Skeletal_striated_muscle", "passage_text": "Skeletal muscle is a form of striated muscle tissue which is under the voluntary control of the somatic nervous system. It is one of three major muscle types, the others being cardiac muscle and smooth muscle. Most skeletal muscles are attached to bones by bundles of collagen fibers known as tendons. Skeletal muscle is made up of individual muscle cells or myocytes, known as muscle fibers. Muscle fibres are cylindrical, and multinucleated. Muscle fibers are in turn composed of myofibrils. The myofibrils are composed of actin and myosin filaments, repeated in units called sarcomeres, the basic functional units of the muscle fiber. The sarcomere is responsible for the striated appearance of skeletal muscle, and forms the basic machinery necessary for muscle contraction"}, {"url": "http://www.bodybuilding.com/fun/sclark20.htm", "passage_text": "Read on here to learn more about the 3 different muscle fibers and how they build differently depending on the type of sport. O ur body is composed of many different groups of muscles and each person has a unique composition of muscle tissue in their body. Different types of athletes usually have one predominant type of muscle fiber, that being the kind that suits their sport the best. The Different Types. "}, {"url": "http://www.coachr.org/fiber.htm", "passage_text": "Studies performed on identical twins have shown that muscle fiber composition is very much genetically determined (Komi & Karlsson, 1979), however there is evidence that both the structure and metabolic capacity of individual muscle fibers can adapt specifically to different types of training. "}, {"url": "http://www.eng.mu.edu/wintersj/muscmod/nms-func-physiology/musc-fib-comp.htm", "passage_text": "Muscle Fiber Composition. Types of muscle fibers. Most mammalian muscles are composed of a mix of at least three different fiber types; indeed, muscles composed of nearly homogenous fiber type are the exception. The mechanical capabilities of each type of muscle stem from differences in the structures and metabolic properties of different types of muscle fibers. Within the muscle, all muscle fibers within a given motor unit are of the same type."}, {"url": "https://www.muscleandstrength.com/articles/muscle-and-muscle-fibers.html", "passage_text": "Smooth muscle tissue is located in the walls of hollow structures such as blood vessels, the stomach, intestines, and the bladder. Smooth muscle fibers are usually involuntary, and they are non-striated (smooth). Smooth muscle tissue, like skeletal and cardiac muscle tissue, can undergo hypertrophy (growth). Objective: The objective of the muscle fiber test is to determine the fiber composition of the muscles being used for a particular exercise. Two test protocols are described: The Dr F. Hatield muscle fiber test and the Charles Poliquin muscle fiber test."}, {"url": "http://meat.tamu.edu/ansc-307-honors/structure-muscle/", "passage_text": "Structure and Composition of Muscle. Objectives: (1) To provide some insight on the structure of muscle and associated tissues. (2) To familiarize the student with the nomenclature associated with muscle, connective tissue, adipose tissue, and bone. (3) To describe the differences among red, intermediate and white muscle fibers. Reading material: Principles of Meat Science (5th Edition), chapter 2, pages 7 to 52. Muscle tissue — constitutes the bulk of the carcass of meat animals."}, {"url": "https://en.wikipedia.org/wiki/Muscle", "passage_text": "Muscle is a soft tissue found in most animals. Muscle cells contain protein filaments of actin and myosin that slide past one another, producing a contraction that changes both the length and the shape of the cell. "}]