[{"url": "https://en.wikipedia.org/wiki/Somaliland", "passage_text": "Somaliland lies in northwestern Somalia, on the southern coast of the Gulf of Aden. It is bordered by the autonomous Puntland region of Somalia to the east, Djibouti to the northwest, and Ethiopia to the south and west. Its claimed territory has an area of 137,600 square kilometres (53,100 sq mi), with approximately 3.5 million residents."}, {"url": "http://wikitravel.org/en/Somaliland", "passage_text": "UTC+3. Somaliland (Somali: Soomaaliland, Arabic: صوماللاند‎ Ṣūmāliland) is an autonomous region in northwestern Somalia that functions as a de facto country. Although the government is working to establish full safety there, visiting is still not advised by the governments of Canada, New Zealand, the UK and the US."}, {"url": "http://www.economist.com/blogs/baobab/2014/01/somaliland", "passage_text": "Somaliland has the most clean-cut case for International recognition of its independence. Which is that Somaliland upon its independence from the British Voluntarily merged with Somalia Italian to create the Somali Republic (AKA Somalia). Somalia imploded in the early nineties, can became a failed state, which is what it is currently."}, {"url": "https://en.wikipedia.org/wiki/Somaliland", "passage_text": "However, Somaliland's self-proclaimed independence remains unrecognised by any country or international organisation. It is a member of the Unrepresented Nations and Peoples Organization, whose members consist of indigenous peoples, minorities, and unrecognised or occupied territories."}, {"url": "http://www.economist.com/blogs/baobab/2014/01/somaliland", "passage_text": "Somaliland’s problem furthermore is that its case is dwarfed by other concerns in the Horn of Africa. While the northern territory chugs along in relative peace and stability, both rump-Somalia and its international partners are face pressing security problems. Hargeisa will have to wait."}, {"url": "https://www.cia.gov/library/publications/the-world-factbook/geos/so.html", "passage_text": "Independence: 1 July 1960 (from a merger of British Somaliland that became independent from the UK on 26 June 1960 and Italian Somaliland that became independent from the Italian-administered UN trusteeship on 1 July 1960 to form the Somali Republic). National holiday:"}, {"url": "https://www.cia.gov/library/publications/the-world-factbook/geos/so.html", "passage_text": "Britain withdrew from British Somaliland in 1960 to allow its protectorate to join with Italian Somaliland and form the new nation of Somalia."}]