[{"url": "http://www.fedex.com/us/small-business/updates/February2011/luggage-free.html", "passage_text": "Travel Luggage-Free, Stress-Free. Bring your luggage to a FedEx Office or FedEx World Service Center ® near you and we'll ship it to your destination. Plus, avoid wear and tear with our new FedEx Luggage Bags."}, {"url": "http://traveltips.usatoday.com/cost-shipping-luggage-ahead-destination-13442.html", "passage_text": "On top of the basic fees, Delta charges—each way—an extra $90 for bags 51 to 70 pounds, and $175 for bags 71 to 100 pounds, as well as $175 if the bag’s dimensions total 63 to 80 inches. Luggage Forward charges $195 to $483 to ship an oversized bag—up to 75 pounds—cross-country one way. Many airlines now charge for every checked bag. Shipping your luggage in advance is not really a money-saving alternative, but it can be worth the price when it comes to convenience."}, {"url": "http://www.fedex.com/us/smallbusiness/updates/may2010/ship-luggage.html", "passage_text": "1 If you want to avoid possible handling fees at the hotel, you can also pick up your luggage at a FedEx location. 2  Money saved. 3  If you want to avoid the unforeseen, rising fees that airlines are charging for luggage handling, calculate the cost to ship your luggage via FedEx ® on fedex.com. 1 There's no need for you to wait in line to check your baggage or stand around at the carousel once you reach your destination. 2  Let FedEx Express or FedEx Ground handle your luggage so it's waiting when you arrive. 3  Reliability. 4  We'll deliver your luggage wherever you need it: a residential address, your home, a hotel."}, {"url": "http://www.independenttraveler.com/travel-tips/whats-the-deal/should-you-check-or-ship-your-bags", "passage_text": "Price: Luggage Forward charges $69 for a small bag (25 pounds) or $99 for a standard bag (50 pounds) for shipping within the U.S. in five business days. Raise the weight of the bag to 60 pounds, and FedEx charges $71.47 for four-day delivery -- which could be less than the penalties you'll pay for exceeding your airline's weight limit."}, {"url": "http://traveltips.usatoday.com/cost-shipping-luggage-ahead-destination-13442.html", "passage_text": "The shipper Luggage Forward charges $76 to $159 to ship a bag 25 pounds or less one way from New York to Beverly Hills, depending on speed. The $76 option is by ground and takes four to seven business days. Many airlines now charge for every checked bag. Shipping your luggage in advance is not really a money-saving alternative, but it can be worth the price when it comes to convenience."}, {"url": "http://www.independenttraveler.com/travel-tips/whats-the-deal/should-you-check-or-ship-your-bags", "passage_text": "While it's still generally more expensive to ship a suitcase than to check it, the latest airline fees have narrowed the cost differential -- and what you gain in convenience and reliability may be worth paying a few extra bucks. Raise the weight of the bag to 60 pounds, and FedEx charges $71.47 for four-day delivery -- which could be less than the penalties you'll pay for exceeding your airline's weight limit."}, {"url": "http://www.independenttraveler.com/travel-tips/whats-the-deal/should-you-check-or-ship-your-bags", "passage_text": "Price: The cost varies widely based on the size and weight of your bag, the distance it needs to travel, and the speed of service that you select. To send a 40-pound suitcase from New York to San Francisco in four business days, FedEx quoted us a fee of $55.31 Want it there in two days? The price skyrockets to $217.35. Raise the weight of the bag to 60 pounds, and FedEx charges $71.47 for four-day delivery -- which could be less than the penalties you'll pay for exceeding your airline's weight limit."}, {"url": "http://www.fedex.com/us/smallbusiness/updates/may2010/ship-luggage.html", "passage_text": "1 More choices. 2  You can ship for less using FedEx Ground by bringing your suitcases to an eligible FedEx location a few days before your travel time. 3  Find the transit time for your luggage to get to its destination via FedEx Ground. 4  Or for added convenience, FedEx Express can ship your luggage where you need it overnight. 1 There's no need for you to wait in line to check your baggage or stand around at the carousel once you reach your destination. 2  Let FedEx Express or FedEx Ground handle your luggage so it's waiting when you arrive. 3  Reliability. 4  We'll deliver your luggage wherever you need it: a residential address, your home, a hotel."}, {"url": "http://traveltips.usatoday.com/cost-shipping-luggage-ahead-destination-13442.html", "passage_text": "Cost. Many airlines now charge for every checked bag. Shipping your luggage in advance is not really a money-saving alternative, but it can be worth the price when it comes to convenience."}, {"url": "https://www.luggagefree.com/pricing/", "passage_text": "Precise Pricing. Relax, when you ship your luggage with us, we guarantee it will arrive on time or there will be no charge for your shipment and we will give you up to $500 per bag to make it right. It's the best luggage shipping guarantee in the world, period! Click here to learn more. Full Service (+ $50) You pack, we take care of the rest. All paperwork, tagging and wrapping (US only) done on your behalf, with the option to choose a more specific pick up time. Self Service (+ $0) We create and send you all paperwork and labels for your shipment, which you attach to your luggage."}]