[{"url": "https://new.export.gov/community/users/international-logistics/posts/47-what-is-a-freight-forwarder", "passage_text": "Not Rated. An international freight forwarder is an agent for the exporter in moving cargo to an overseas destination. These agents are familiar with the import rules and regulations of foreign countries, the export regulations of the U.S. government, the methods of shipping, and the documents related to foreign trade."}, {"url": "http://www.exfreight.com/air-freight-forwarding.html", "passage_text": "Air freight forwarding is the process of transporting the traders’ goods to its destination. Air freight forwarding can ship up to 43,000 lbs of cargo. Air freight forwarding services assure that merchandise is sent on the agreed date. Also, air freight forwarding needs caution so that the goods’ condition is preserved. Air freight forwarding companies coordinate with other establishments."}, {"url": "http://export.gov/logistics/eg_main_018144.asp", "passage_text": "An international freight forwarder is an agent for the exporter and can move cargo from “dock-to-door,” providing several significant services such as: 1  Advising on exporting costs including freight costs, port charges, consular fees, costs of special documentation, insurance costs and freight handling fees;"}, {"url": "http://www.farrow.com/article-what-is-air-freight", "passage_text": "Air Freight & Cargo. Air freight parcel delivery is the transfer and shipment of goods via an air carrier, which may be charter or commercial. Such shipments travel out of commercial and passenger aviation gateways to anywhere planes can fly and land."}, {"url": "https://en.wikipedia.org/wiki/Freight_forwarder", "passage_text": "A freight forwarder, forwarder, or forwarding agent, also known as a non-vessel operating common carrier (NVOCC) , is a person or company that organizes shipments for individuals or corporations to get goods from the manufacturer or producer to a market, customer or final point of distribution."}]