[{"url": "http://www.answers.com/Q/How_much_money_does_a_science_teacher_earn", "passage_text": "Each school district can, and most do, offer LOCAL pay stipends for all teachers, and additional supplements for specialty areas. ESL and and Spanish generally are considered hard to fill areas. The district I work for pays an additional $1500 per year for a Spanish teacher and has paid as high as $3000. According to the US Bureau of Labor Statistics, median annual  wages of kindergarten, elementary, middle, and secondary school  teachers ranged from $47,100 to $51,180 in M … ay 2008; the lowest 10  percent earned $30,970 to $34,280; the top 10 percent earned  $75,190 to $80,970.."}, {"url": "http://pointsandfigures.com/2010/10/05/how-much-does-a-teacher-really-make/", "passage_text": "The average pension per year for an Illinois teacher is $43,164. Most Illinois teachers work for 12 years. That 43k is a 2010 figure. Every year after, there is a 3% cost of living raise, compounded annually, included in the defined benefit. In Illinois, the average teacher makes $61,402. By the way, the average administrator makes $106,217.00! Illinois teachers work around 176 days, 300 minutes, or 5 hours, per day."}, {"url": "http://couplemoney.com/budgeting/budgeting-on-a-teachers-salary/", "passage_text": "Let’s see how we can use an average teacher’s salary to create a doable budget. I’m using the local county’s pay scale for a teacher with a Bachelor’s Degree, certification, and 5 years of experience. That gives us an annual salary of $41,404.20. "}, {"url": "http://www.access2knowledge.org/jobs-education/how-much-do-teachers-make/", "passage_text": "So how much does a teacher make? According to the May 2012 records of the Bureau of Labor Statistics, the mean annual elementary school teacher salary is $56,130. The bottom ten percent makes $36,740, while the top ten percent earns $82,190 annually. For the 959,770 secondary or high school level teachers, the mean annual salary is slightly higher at $57,770. The lowest ten percent make $36,930 and the top ten percent are compensated with a sizeable $85,690 each year. Industry of employment plays a prominent role in the annual salary of teachers at all levels. Teachers that hold positions as educational support only earn an average of $48,730, while those employed by state governments make an average of $59,070. Another factor that impacts salary for teachers is location. The top-paying states are New York at $74,130, Rhode Island at $69,780, and California at $69,3"}, {"url": "http://work.chron.com/hourly-wages-teachers-2044.html", "passage_text": "According to the BLS, the average secondary school teacher in the U.S. earns an annual salary of $56,760. A 40-hour work week employee would have to earn $27.28 per hour to earn as much over the course of a year. In some areas, teacher's unions enter into collective bargaining agreements with school districts. However, someone working a typical 40-hour work week would have to receive an hourly rate of $26.57 to earn as much as the average elementary teacher"}, {"url": "http://work.chron.com/hourly-wages-teachers-2044.html", "passage_text": "The BLS does not gather data relating to hourly wages due to the manner in which most elementary teachers are paid. However, someone working a typical 40-hour work week would have to receive an hourly rate of $26.57 to earn as much as the average elementary teacher over the course of a year."}, {"url": "http://www.snagajob.com/job-descriptions/teacher-assistant/", "passage_text": "The average hourly pay for all teaching assistant roles is around $10.50 per hour, but will vary by experience and location. Teaching assistants with a significant amount of experience can expect to earn up to $16 per hour. "}, {"url": "http://www.motherjones.com/politics/2012/09/map-teachers-salaries-by-city", "passage_text": "Yet the range of what they earn varies widely: Elementary-school teachers in Jefferson City, Missouri, earn an average of $37,090; their colleagues in Long Island, New York, earn an average of $90,560. Click on a city on the map below for more information on teachers' average wages within its greater metropolitan area. For some perspective, we've compiled data on the average wages of elementary-school, middle-school, and high school teachers in more than 300 metropolitan areas. As you'll see, most teachers make more than $45,320, the average yearly wage for all occupations tracked by the Bureau of Labor Statistics."}, {"url": "http://work.chron.com/much-economics-teachers-make-8998.html", "passage_text": "Salary. The Bureau of Labor Statistics reported an average salary of $94,450 per year for economics teachers in 2011. In the United States, about 13,000 were employed in educational institutions. Salaries ranged from $42,690 to $153,640 per year, which includes the BLS’s 10th through 90th percentiles. The highest average salaries were in Rhode Island, where economics teachers earned an average of $129,040 per year. The New York metropolitan area had the highest levels of employment of economics teachers and paid an average salary of $103,62"}]