[{"url": "https://www.facebook.com/help/353629551372940/", "passage_text": "You can select an audience for each section of likes on your About page: 1  Go to your profile and click About below your cover photo. 2  Scroll down to your Likes section and click. 3  Select Edit Privacy. 4  Click the audience selector to select who can see what you've liked in each section. 5  Click Close. Once you block a Page, that Page can no longer interact with your posts or like or reply to your comments. You won't be able to post on the Page or message the Page and, if you currently like the Page, you'll unlike and unfollow it. To block a Page:"}, {"url": "http://www.huffingtonpost.com/2013/07/09/facebook-graph-search_n_3563010.html", "passage_text": "This will show you a log of all your actions (comments, posts, photos, etc.) on Facebook and the visibility of each post. Anyone that a post is visible to can potentially search for it on Facebook now. That means information that you probably thought would never be searchable -- like the photos you've liked -- now is. Time to check out one of Facebook Graph Search's main sources of information, the pages you've liked. Go to your profile's About page and scroll all the way down to find the music, movies, TV shows and books you've given a thumbs-up to over the years."}, {"url": "https://www.facebook.com/help/353629551372940/", "passage_text": "Tagging a Page in a photo doesn't change photo privacy. People won't see your photo on the Page unless they're already able to see it based on its privacy setting. If your photo is visible to the people who manage the Page, they'll be notified of the photo tag. Once you block a Page, that Page can no longer interact with your posts or like or reply to your comments. You won't be able to post on the Page or message the Page and, if you currently like the Page, you'll unlike and unfollow it. To block a Page:"}, {"url": "http://www.youtube.com/watch?v=96P-pVL9tw0", "passage_text": "In addition to having your friends and customers like your Facebook Page, Facebook Pages can also like Facebook Pages. This video shows you how to see who likes my Facebook Page. Should you have questions on how to see who likes my Facebook Page, feel free to contact me. "}, {"url": "https://www.facebook.com/help/353629551372940/", "passage_text": "Facebook Pages are public spaces. Anyone who can see the Page can see your post or comment. Also, when you post or comment on a Page, a story can be published in News Feed as well as other places around Facebook. Once you block a Page, that Page can no longer interact with your posts or like or reply to your comments. You won't be able to post on the Page or message the Page and, if you currently like the Page, you'll unlike and unfollow it. To block a Page:"}, {"url": "http://www.andreavahl.com/facebook/how-and-why-to-like-other-facebook-pages-as-your-page.php", "passage_text": "I can see all the people that “like” my page, but not other pages. Facebook hides it! Darn it. So if you go up to the top notifications bar, click on the little people icon to see who likes your Page and then click See All at the bottom of the list. But where is the like button, I can go on to other pages but I can’t like another page because there isn’t a like button. If there isn’t a Like button there, then that means you have already Liked that Page as your Page. Check your Likes on the lower left side bar to make sure."}, {"url": "http://www.wikihow.com/See-Who-You-are-Most-Connected-to-on-Facebook", "passage_text": "This list that Facebook keeps is determined by a variety of factors: who comments on your posts, who you message frequently, who looks at your Facebook the most often, and more. 1  There is no way to see JUST who looks at your page the most, and any app which says that it can tell you that is lying and a scam. 1 There is no way to see JUST who looks at your page the most, and any app which says that it can tell you that is lying and a scam. 2  You'll have to learn how to interpret the list that this trick gives you."}, {"url": "http://just-ask-kim.com/how-to-find-out-who-likes-your-facebook-page/", "passage_text": "At the bottom of the menu, click the “See All Fans” link (which opens a new menu). 4. This is the menu from prior (relocated) and you can perpetually scroll it by clicking the “See More” link at the bottom. You can also use the little menu box to see Pages that like your page. In your left-hand sidebar under “# of people who like this” you used to be able to open that and see your fan list. Now, that link redirects to the demographics Insights panel. So, to see all of your fans now, a slightly different approach is called for…."}, {"url": "https://www.facebook.com/help/like", "passage_text": "You can only unlike comments, posts, photos and Pages that you previously liked. To unlike a comment, post or photo, click or Unlike below the content. To unlike a Page (which will also remove it from your profile and Timeline): 1  Go to the Page. 2  Click Liked below the cover photo. 3  Select Unlike. Liking a post from a friend means you're letting that friend know you like their post without leaving a comment. When you connect to a Page, you'll start to see stories from that Page in your News Feed. The Page will also appear on your profile, and you'll appear on the Page as a person who likes that Page."}]