[{"url": "http://www.b4ubuild.com/faq/faq_0002.shtml", "passage_text": "Home prices of $55, $66, $72, $80, $84, $92, $110, $118, and $328 per square foot combine to produce an average of $112 per square foot, which is probably a reasonable figure for many areas of the country. However, the difference between the lowest figure and the highest is very substantial."}, {"url": "http://www.zillow.com/advice-thread/What-is-the-average-per-square-foot-cost-to-rebuild-my-house-in-Montclair-district-in-zip-94611-2026/271528/", "passage_text": "Wholesale costs are running between $150-$200 per square foot. If you are going to hire a contractor, I know contractors that will charge anywhere between $200-$6"}, {"url": "http://www.trulia.com/voices/Home_Insurance/what_is_the_average_cost_per_square_foot_to_rebuil-387848", "passage_text": "It depends on several things....mostly size and finishings. I've seen homes built (excluding the lot) for $80/ft and I'm working with a friend of mine that is building in Memorial for $250/ft. The average for a very nice home runs between $100 and $120/ft. The location and cost of the lot are a huge variable. Lots range from $16,500 in the suburban market to over $1,000,000 in Memorial and closer in. Best of luck to you!"}, {"url": "http://www.answers.com/Q/What_is_the_average_replacement_cost_to_rebuild_a_home_in_Roseville_CA_95678", "passage_text": "In the US, the average cost to build a come is $100 a square foot. This figure goes up and down depending on the specific location of the home. Building a home with high quality cabinets, flooring, countertops, etc. can add to the construction cost. I do not recommend using an estimate of more than $13"}, {"url": "http://homebuying.about.com/od/marketfactstrends/f/062408_persqft.htm", "passage_text": "You can arrive at the average-per-square-foot cost of a home by adding the square-foot cost of each home that has sold in any given area and dividing by the number of homes that sold. For example, say three homes sold on Broadway for $200,000 each."}, {"url": "http://www.buildingsguide.com/faq/what-average-commercial-building-cost-square-foot", "passage_text": "An average commercial steel building costs between $16 and $20 per square foot, including building package (I-Beams, purlins, girts etc.) , delivery, foundation and the cost of construction."}]