[{"url": "http://medical-dictionary.thefreedictionary.com/gonadotropin", "passage_text": "While named for their effects on the ovaries, follicle-stimulating hormone and luteinizing hormone are also major gonadotropins in the testes, causing the Leydig cells to secrete testosterone and facilitating spermatogenesis. Two such hormones are secreted by the anterior pituitary: follicle-stimulating hormone and luteinizing hormone, both of which are active, but with differing effects, in the two sexes. chorionic gonadotropin."}, {"url": "http://www.winfertilityrx.com/gonadotropins/", "passage_text": "Hormones for Fertility. Gonadotropins are hormones which stimulate the gonads, which are the ovaries or testes. Yes, gonadotropins work on men, as well! Gonadotropins are injectable fertility drugs which contain follicle stimulating hormone, or FSH, luteinizing hormone, or LH, or both. They are given to women to help your body make the hormones needed for egg production. They may also be used for men with low testosterone and FSH to promote sperm formation."}, {"url": "http://arbl.cvmbs.colostate.edu/hbooks/pathphys/endocrine/hypopit/lhfsh.html", "passage_text": "Gonadotropins: Luteinizing and Follicle Stimulating Hormones. Luteinizing hormone (LH) and follicle-stimulating hormone (FSH) are called gonadotropins because stimulate the gonads-in males, the testes, and in females, the ovaries. They are not necessary for life, but are essential for reproduction. Luteinizing Hormone. In both sexes, LH stimulates secretion of sex steroids from the gonads. In the testes, LH binds to receptors on Leydig cells, stimulating synthesis and secretion of testosterone."}, {"url": "http://arbl.cvmbs.colostate.edu/hbooks/pathphys/endocrine/hypopit/lhfsh.html", "passage_text": "Glossary. Luteinizing hormone (LH) and follicle-stimulating hormone (FSH) are called gonadotropins because stimulate the gonads-in males, the testes, and in females, the ovaries. They are not necessary for life, but are essential for reproduction. Luteinizing Hormone. In both sexes, LH stimulates secretion of sex steroids from the gonads. In the testes, LH binds to receptors on Leydig cells, stimulating synthesis and secretion of testosterone."}, {"url": "https://en.wikipedia.org/wiki/Gonadotropin-releasing_hormone", "passage_text": "(January 2013). Gonadotropin-releasing hormone (GnRH), also known as luteinizing hormone-releasing hormone (LHRH) and luliberin, as well as gonadorelin (INN), is a trophic peptide hormone responsible for the release of follicle-stimulating hormone (FSH) and luteinizing hormone (LH) from the anterior pituitary. At the pituitary, GnRH stimulates the synthesis and secretion of the gonadotropins, follicle-stimulating hormone (FSH), and luteinizing hormone (LH). These processes are controlled by the size and frequency of GnRH pulses, as well as by feedback from androgens and estrogens."}, {"url": "https://www.asrm.org/Side_Effects_of_Injectable_Fertility_Drugs_Gonadotropins_factsheet/", "passage_text": "Gonadotropins are fertility medications given by injection that contain follicle-stimulating hormone (FSH) alone or combined with luteinizing hormone (LH). When FSH (with or without LH) is given as an injection, it works directly on the ovaries to make multiple follicles (cysts containing eggs). Other fertility medications, such as clomiphene citrate, stimulate the ovaries by working in conjunction with the brain."}, {"url": "https://en.wikipedia.org/wiki/Gonadotropin", "passage_text": "The two principal gonadotropins in vertebrates are luteinizing hormone (LH) and follicle-stimulating hormone (FSH), although primates produce a third gonadotropin called chorionic gonadotropin (CG). LH and FSH are heterodimers consisting of two peptide chains, an alpha chain and a beta chain. LH and FSH are secreted by the anterior pituitary gland, while hCG and eCG are secreted by the placenta in pregnant humans and mares, respectively. The gonadotropins act on the gonads, controlling gamete and sex hormone production. Gonadotropin is sometimes abbreviated G"}, {"url": "https://en.wikipedia.org/wiki/Gonadotropin", "passage_text": "There are various preparations of gonadotropins for therapeutic use, mainly as fertility medication. For example, the so-called menotropins (also called human menopausal gonadotropins) consist of LH and FSH extracted from the urine of menopausal women. There are also recombinant variants. LH and FSH are secreted by the anterior pituitary gland, while hCG and eCG are secreted by the placenta in pregnant humans and mares, respectively. The gonadotropins act on the gonads, controlling gamete and sex hormone production. Gonadotropin is sometimes abbreviated Gn"}, {"url": "http://www.fertilityfactor.com/infertility_medical_options_gonadotropins.html", "passage_text": "Women who fail to respond to clomiphene are often moved on to the next phase of fertility medications – gonadotropins. Unlike clomiphene, which looks to stimulate the pituitary gland, gonadotropins attempt to directly affect the ovaries and stimulate follicle development. While it is more common for women to be prescribed gonadotropins, men are also sometimes prescribed the medications."}]