[{"url": "http://hyperphysics.phy-astr.gsu.edu/hbase/ptens2.html", "passage_text": "The oxygen exchange in the lungs takes place across the membranes of small balloon-like structures called alveoli attached to the branches of the bronchial passages. These alveoli inflate and deflate with inhalation and exhalation. The behavior of the alveoli is largely dictated by LaPlace's law and surface tension."}, {"url": "http://www.webmd.com/lung/picture-of-the-lungs", "passage_text": "In the alveoli, oxygen from the air is absorbed into the blood. Carbon dioxide, a waste product of metabolism, travels from the blood to the alveoli, where it can be exhaled. Between the alveoli is a thin layer of cells called the interstitium, which contains blood vessels and cells that help support the alveoli. The lungs are covered by a thin tissue layer called the pleura."}, {"url": "http://www.cancerresearchuk.org/about-cancer/type/lung-cancer/about/the-lungs", "passage_text": "At the end of the bronchioles are tiny air sacs called alveoli. In the alveoli oxygen passes into the bloodstream to be carried round the body. Carbon dioxide passes into the alveoli from the bloodstream to be breathed out. The right lung is divided into 3 sections called the upper, middle and lower lobes."}, {"url": "http://www.innerbody.com/anatomy/respiratory/lungs", "passage_text": "Alveoli are the functional units of the lungs that permit gas exchange between the air in the lungs and the blood in the capillaries of the lungs. Alveoli are found in small clusters called alveolar sacs at the end of the terminal bronchiole."}, {"url": "http://www.answers.com/Q/The_surface_of_fluid_lining_the_alveoli", "passage_text": "Much of the surface of each of the approximately 300 million alveoli in a human lung is a layer of simple epithelial tissue on a fine mesh of capillaries. Forming a membrane o … nly the thickness of one cell, simple epithelium allows the passage of gases between the lungs and the"}, {"url": "http://hyperphysics.phy-astr.gsu.edu/Hbase/biology/respir.html", "passage_text": "Gas exchange in the lungs takes place in the tiny air sacs called alveoli in the lungs. The process of inhalation must inflate the alveoli, but it can only do so because of the presence of a surfactant fluid that coats the alveoli and lowers the surface tension of their walls."}, {"url": "http://www.macmillan.org.uk/information-and-support/lung-cancer/understanding-cancer/the-lungs.html", "passage_text": "They divide to form smaller tubes called bronchioles, which carry air through the lungs. At the end of the bronchioles are millions of tiny air sacs called alveoli. In the alveoli, oxygen is absorbed from the air we breathe in and passes into the bloodstream to be circulated around the body. Carbon dioxide is a waste gas that needs to be removed from the body."}, {"url": "http://www.innerbody.com/anatomy/respiratory/lungs", "passage_text": "External respiration is the process of exchanging oxygen and carbon dioxide between the air inside the alveoli and the blood in the capillaries of the lungs. Air inside the alveoli contains a higher partial pressure of oxygen compared to the blood in the capillaries."}]