[{"url": "http://www.nhs.uk/Conditions/Scurvy/Pages/Causes.aspx", "passage_text": "Scurvy is caused by a lack of vitamin C in your diet. If your body doesn't have enough vitamin C, it can't produce new collagen (a protein found in many different types of body tissue, including the skin and bones). Without a new supply of collagen, the body's tissue will begin to break down and deteriorate. Although scurvy is rare in the UK, research has shown that a significant number of people may have a lack of vitamin C. However, it's possible to get a good supply of vitamin C by eating plenty of fruit and vegetables. The good news is that it doesn't have to cost a lot to get your 5 A DAY."}, {"url": "http://www.home-remedies-for-you.com/remedy/Scurvy.html", "passage_text": "The main cause of scurvy is a deficiency of vitamin C. If you have not been taking your daily recommended allowance of vitamin C, it will eventually cause scurvy. The deficiency could be caused due to restrictive diets, allergies to vitamin C, anorexia, or a largely meat or fish diet. There are no other causes of scurvy disease other than the deficiency of vitamin C. There may be other causes of bleeding gums, and if this is the only symptom you are experiencing, you may be afflicted with some oral infection and not scurvy."}, {"url": "http://www.medicinenet.com/script/main/art.asp?articlekey=11193", "passage_text": "Scurvy: A disorder that is caused by lack of vitamin C. Symptoms include anemia; soft, bleeding gums; and bumps under the skin near muscles. Scurvy in early childhood can cause musculoskeletal problems. "}, {"url": "http://medical-dictionary.thefreedictionary.com/scurvy", "passage_text": "scurvy. a condition due to deficiency of ascorbic acid (vitamin C). Symptoms of infantile scurvy include poor appetite, digestive disturbances, failure to gain weight, increasing irritability, and bruises scattered over the skin. Severe deficiency may cause changes in bone structure. A lack of vitamin C in the diet is the primary cause of scurvy. This can occur in people on very restricted diets, who are under extreme physiological stress (for example, during an infection or after an injury), and in chronic alcoholics."}, {"url": "http://www.home-remedies-for-you.com/remedy/Scurvy.html", "passage_text": "Scurvy is a disease that is caused by the deficiency of vitamin C. This disease is characterized by bleeding and swelling in the gums and was earlier known as the sailors disease due to its regular occurrence in men at sea, who were deprived of foods rich in vitamin C. There are no other causes of scurvy disease other than the deficiency of vitamin C. There may be other causes of bleeding gums, and if this is the only symptom you are experiencing, you may be afflicted with some oral infection and not scurvy."}, {"url": "https://en.wikipedia.org/wiki/Scurvy", "passage_text": "Scurvy is a disease resulting from a deficiency of vitamin C. Scurvy often presents initially with fatigue, followed by formation of spots on the skin, spongy gums, and bleeding from the mucous membranes. While today scurvy is known to be caused by a nutritional deficiency, until the isolation of vitamin C and direct evidence of its link to scurvy in 1932, numerous theories and treatments were proposed, often on little or no experimental data."}, {"url": "http://www.home-remedies-for-you.com/remedy/Scurvy.html", "passage_text": "Vitamin C and scurvy are closely related. Since the deficiency of vitamin C causes scurvy, it is important to continue consuming this nutrient on a daily basis so that you do not develop this condition. The deficiency of vitamin D causes a condition known as rickets. There are no other causes of scurvy disease other than the deficiency of vitamin C. There may be other causes of bleeding gums, and if this is the only symptom you are experiencing, you may be afflicted with some oral infection and not scurvy."}, {"url": "http://www.medicalnewstoday.com/articles/155758.php", "passage_text": "The primary cause of scurvy is insufficient intake of vitamin C (ascorbic acid). This may be due to ignorance, famine, anorexia, restrictive diets (due to allergies, food fads, etc.), or difficulty orally ingesting foods. Knowledge center. Scurvy is a disease caused by a diet that lacks vitamin C (ascorbic acid) . Patients develop anemia, debility, exhaustion, edema (swelling) in some parts of the body, and sometimes ulceration of the gums and loss of teeth. The name scurvy comes from the Latin scorbutus."}]