[{"url": "http://www.costowl.com/home-improvement/hvac-brick-fireplace.html", "passage_text": "The actual cost of a brick fireplace may vary depending on your location, the materials used, products selected, and the complexity of the installation. 1  The average fireplace installation cost is $2,500 to $5,000, although an authentic brick fireplace constructed by a mason could cost up to $10,000 or more."}, {"url": "http://www.homewyse.com/costs/cost_of_outdoor_stone_fireplaces.html", "passage_text": "The Homewyse Outdoor Stone Fireplace cost estimator provides up to date pricing information for your area. Enter your zip code, the size of your project below and click Update. The table below summarizes the average 2014 cost to install Outdoor Stone Fireplaces in your area for good, better and custom quality work."}, {"url": "http://www.improvenet.com/r/costs-and-prices/outdoor-fireplace", "passage_text": "Disadvantages of an Outdoor Fireplace. Unfortunately, not everything about outdoor fireplaces is positive. For many homeowners, the biggest drawback is simply the expense. Even pre-made fireplaces can easily cost upwards of $1,000, and that amount may simply not fit into the budget. Safety can also be a significant issue, as children will need to be watched carefully whenever an outdoor fireplace is lit."}, {"url": "http://www.landscapingnetwork.com/outdoor-fireplace/cost.html", "passage_text": "The cost of an outdoor fireplace will depend on the exact features you want. Choices you need to make that will impact the total price are: wood vs. gas, prefab vs. custom built, large vs. small, freestanding vs. integrated into a wall or building."}, {"url": "http://www.howmuchisit.org/outdoor-fireplace-cost/", "passage_text": "1 According to Axellandscape.com, an outdoor fireplace costs at least $7,000. 2  The more fancy ones cost around $10,000 or more. 3  To make it gas burning, you will spend around $2,000 to $3,000 more."}, {"url": "http://www.improvenet.com/r/costs-and-prices/outdoor-fireplace", "passage_text": "Popular Materials Used in Outdoor Fireplaces. The cost of an outdoor fireplace can vary depending on a number of different factors like size and geographic location, but there is no doubt that the material used in construction plays the largest role of all."}, {"url": "http://www.howmuchisit.org/outdoor-fireplace-cost/", "passage_text": "1 Depending on the materials, size and the contractor performing the job, the average outdoor fireplace can cost anywhere from as little as $4,000 to as much as $15,000."}]