[{"url": "http://www.explainthatstuff.com/antennas.html", "passage_text": "Antennas like this are sometimes called receivers. A transmitter is a different kind of antenna that does the opposite job to a receiver: it turns electrical signals into radio waves so they can travel sometimes thousands of kilometers around the Earth or even into space and back. Why do you need two antennas in a radio? The signals on these different wave bands are carried by radio waves of different frequency and wavelength. Typical AM radio signals have a frequency of 1000 kHz (kilohertz), while typical FM signals are about 100 MHz (megahertz)—so they vibrate about a hundred times faster."}, {"url": "https://answers.yahoo.com/question/index?qid=20110105203535AAM3u5Z", "passage_text": "Best Answer: Antennas work very well, if you have the correct one. Indoor antennas don't work well unless you are within about 5 miles from the transmitters. The proper antenna for your location depends on how strong the signals are at your house. Visit http://www.antennaweb.org. That site will help you choose the proper antenna for your location using an industry standard color code. Take that code to a retailer and you can choose an antenna. "}, {"url": "http://www.palgear.com/hdtv-antenna-hype.php", "passage_text": "There is nothing specific about a TV antenna that is used to receive HD signals. Your antenna doesn't really care whether the signal is high definition or not. It has absolutely no idea what the signal resolution is, or whether the signal is analog or digital. Antenna is a piece of metal designed to resonate at a specific frequency and to be responsive over a range of frequencies. TV antennas are designed to work either in the range of Ultra High Frequencies (UHF), Very High Frequencies (VHF) or both."}, {"url": "http://www.dennysantennaservice.com/amplified_tv_antenna.html", "passage_text": "Amplified TV Antenna. What is an amplified TV antenna? How do amplified TV antennas work and what are the advantages of an amplified TV antenna? Any TV antenna can be amplified. There are basically two types of amplified TV antennas. The first type most referred to as an amplified TV antenna are those antennas with the antenna amplifier built into the antenna housing."}, {"url": "http://www.dennysantennaservice.com/amplified_tv_antenna.html", "passage_text": "In fact strong signals can overdrive the signals from an amplified TV antenna causing it to malfunction resulting in poor TV reception. The second type of amplified TV antenna are those antennas that don't come with an amplifier. The proper amplifier is chosen to match the reception conditions and is purchased separately from the antenna. These signal amplifiers are designed to be mounted near the antenna onto the mast pipe. Any TV antenna can be amplified. There are basically two types of amplified TV antennas. The first type most referred to as an amplified TV antenna are those antennas with the antenna amplifier built into the antenna housing."}, {"url": "https://en.wikipedia.org/wiki/Television_antenna", "passage_text": "A television antenna, or TV aerial, is an antenna specifically designed for the reception of over-the-air broadcast television signals, which are transmitted at frequencies from about 41 to 250 MHz in the VHF band, and 470 to 960 MHz in the UHF band in different countries. Television antennas are manufactured in two different types: indoor antennas, to be located on top of or next to the television set, and outdoor antennas, mounted on a mast on top of the owner's house."}, {"url": "http://www.explainthatstuff.com/antennas.html", "passage_text": "That's more or less what an antenna (sometimes called an aerial) does: it's the metal rod or dish that catches radio waves and turns them into electrical signals feeding into something like a radio or television or a telephone system. Why do you need two antennas in a radio? The signals on these different wave bands are carried by radio waves of different frequency and wavelength. Typical AM radio signals have a frequency of 1000 kHz (kilohertz), while typical FM signals are about 100 MHz (megahertz)—so they vibrate about a hundred times faster."}, {"url": "http://www.antennasdirect.com/blog/10-digital-tv-antennas/", "passage_text": "10 things you need to know about Digital TV Antennas. Digital TV antennas have come a long ways since your grandma’s rabbit ears antennas you grew up with. Here is our list of the 10 things you need to know about modern day digital TV antennas. 1  Broadcast signals are superior to cable and satellite. Digital TV antennas have come a long ways since your grandma’s rabbit ears antennas you grew up with. Here is our list of the 10 things you need to know about modern day digital TV a"}]