[{"url": "http://www.extension.umn.edu/garden/yard-garden/trees-shrubs/pruning-trees-shrubs/", "passage_text": "1 Prune apple trees, including flowering crabapples, mountain ash, hawthorns and shrub cotoneasters in late winter (February-early April). 2  Spring or summer pruning increases chances for infection and spread of the bacterial disease fireblight. Pruning in late winter, just before spring growth starts, leaves fresh wounds exposed for only a short length of time before new growth begins the wound sealing process. Another advantage of dormant pruning is that it's easier to make pruning decisions without leaves obscuring plant branch structure."}, {"url": "http://www.bhg.com/gardening/trees-shrubs-vines/care/what-to-prune-when/", "passage_text": "Plants that bloom in summer, such as potentilla, butterfly bush, and crape myrtle, produce their flowers on new growth from the current season. Prune them in winter while they're dormant, or in early spring just before they push out their new growth. Most hydrangea types -- pink, blue, or white mopheads and lacecaps, or oakleaf forms -- bloom on old wood. Prune these types of hydrangeas before midsummer. If you prune them in winter or early spring, you'll be removing flower buds."}, {"url": "http://www.wikihow.com/Prune-Apple-Trees", "passage_text": "//d5kh2btv85w9n.cloudfront.net/9/9e/Prune Apple Trees Step 1 Version 2.360p.mp4. 1  If you need to, pruning can occur later in the spring and early in the summer. 2  Avoid pruning in the fall, as new growth will be stimulated but will die off from the cold of winter. As soon as you realize your apple tree needs pruning, it can be tempting to jump to it and start lopping off branches immediately. However, it is important to prune at the right time to avoid damaging your tree. Prune in the first month or two of spring, at least two weeks after the last frost."}, {"url": "http://www.almanac.com/content/spring-pruning-guide-trees-and-shrubs", "passage_text": "Also, pruning in fall (especially early fall) can encourage new growth, which may not harden off in time before winter's temperatures hit. You can prune some trees in winter, when the tree is dormant. In cold climates, late winter is best, but before the buds start to emerge. For flowering trees, it is best to prune spring-flowering trees immediately after they have finished flowering, before they develop next year's flower buds. Prune summer-flowering trees in winter or early spring. "}, {"url": "https://www.arborday.org/trees/tips/when-to-prune.cfm", "passage_text": "If your purpose for pruning is to enhance flowering: 1  For trees that bloom in spring, prune when their flowers fade. 2  Trees and shrubs that flower in mid-to late summer should be pruned in winter or early spring. When to Prune. This depends to a large extent on why you prune. Light pruning and the removal of dead wood can be done anytime. Otherwise, here are some guidelines, but recognizing that individual species may differ is important to remember."}, {"url": "http://extension.illinois.edu/news/news.cfm?NewsID=9690", "passage_text": "In general, if all you want to do is trim out dead, weak or diseased parts of the tree, this type of pruning can be done at any time of the year without drastic effects on the tree. If you prune to thin the trees–to allow light for grass and shrubs–prune in late winter or early spring. Heavy pruning done after growth starts in spring can weaken a tree because it forces the tree to use stored food for re-growth instead of for new growth. Heavy pruning during late summer should also be avoided because it can stimulate lush, succulent growth. Elm, ash and oak are an exception."}, {"url": "http://www.colostate.edu/Dept/CoopExt/4dmg/Trees/Shrubs/spngprun.htm", "passage_text": "Early spring is a good time to do some needed pruning. Despite the advice that some gardening literature provides -- to prune spring-flowering trees and shrubs after bloom -- much pruning can be done in the early spring."}, {"url": "http://www.bhg.com/gardening/trees-shrubs-vines/care/what-to-prune-when/", "passage_text": "Broadleaf Evergreens. Most broadleaf evergreens, including holly, mahonia, and some types of magnolias, need little pruning. The best time to prune them is in early spring, just before they put on their growth spurt. You can do minor shaping and pruning at other times of year, too. Test Garden Tip: Save on holiday decorations by snipping a few branches for winter holiday greenery. 1  Check out our guide to pruning evergreens. Most hydrangea types -- pink, blue, or white mopheads and lacecaps, or oakleaf forms -- bloom on old wood. Prune these types of hydrangeas before midsummer. If you prune them in winter or early spring, you'll be removing flower buds."}, {"url": "http://www.extension.umn.edu/garden/yard-garden/trees-shrubs/pruning-trees-shrubs/", "passage_text": "Shrubs that bloom on new growth may be pruned in spring before growth begins. Plants with marginally hardy stems such as clematis and shrub roses should be pruned back to live wood. Hardier shrubs such as late blooming spireas and smooth (snowball) hydrangeas should be pruned to the first pair of buds above the ground. Pruning in late winter, just before spring growth starts, leaves fresh wounds exposed for only a short length of time before new growth begins the wound sealing process. Another advantage of dormant pruning is that it's easier to make pruning decisions without leaves obscuring plant branch structure."}]