[{"url": "http://www.northernhighlands.org/cms/lib5/NJ01000179/Centricity/Domain/212/Notes/Notes%20-%20Waves%20CP.pdf", "passage_text": "Waves Physics 20.1 Waves What is a wave and what does it carry? Types of Waves 1. Transverse A transverse wave has its oscillations/vibrations _________________________ to the direction the wave moves. "}, {"url": "http://www.phys.uconn.edu/~gibson/Notes/Section5_6/Sec5_6.htm", "passage_text": "Remember, for a string wave, the string moves perpendicular to the string, while the wave travels along the string. Thus, a string wave is a transverse wave. For sound waves, the air molecules move along the motion of the wave, and hence, sound is a longitudinal wave. As we discussed, transverse waves have two directions that they can vibrate in that are perpendicular to the direction that the wave is traveling. These two directions are called polarizations (which is where the term for polarized sunglasses comes from)."}, {"url": "http://www.factmonster.com/dk/science/encyclopedia/energy-waves.html", "passage_text": "FIND OUT MORE. Many different kinds of energy travel in waves. Sound waves carry noises through the air to our ears. SEISMIC WAVES travel inside the Earth and cause earthquakes. Light, heat, radio, and similar types of energy are carried by a variety of waves in the ELECTROMAGNETIC SPECTRUM"}, {"url": "http://www.acs.psu.edu/drussell/Demos/waves/wavemotion.html", "passage_text": "Mechanical Waves are waves which propagate through a material medium (solid, liquid, or gas) at a wave speed which depends on the elastic and inertial properties of that medium. There are two basic types of wave motion for mechanical waves: longitudinal waves and transverse waves. The animations below demonstrate both types of wave and illustrate the difference between the motion of the wave and the motion of the particles in the medium through which the wave is travelling. Water Waves. Water waves are an example of waves that involve a combination of both longitudinal and transverse motions. As a wave travels through the waver, the particles travel in clockwise circles. The radius of the circles decreases as the depth into the water increases."}, {"url": "https://en.wikipedia.org/wiki/Transverse_wave", "passage_text": "A light wave is an example of a transverse wave. Propagation of a transverse spherical wave in a 2d grid (empirical model). A transverse wave is a moving wave that consists of oscillations occurring perpendicular (or right angled) to the direction of energy transfer. If a transverse wave is moving in the positive x-direction, its oscillations are in up and down directions that lie in the y–z plane. Light is an example of a transverse wave. With regard to transverse waves in matter, the displacement of the medium is perpendicular to the direction of propagation of the wave. A ripple in a pond and a wave on a string are easily visualized as transverse waves. "}, {"url": "http://www.schoolphysics.co.uk/age11-14/Wave%20properties/text/Waves_/index.html", "passage_text": "HOME AGE 11 - 14 WAVE PROPERTIES. Waves carry energy from one place to another. Think about the energy released when waves break onto a beach or the immense energy carried along by a tidal wave or tsunami. These waves make the material in which they are travelling vibrate as they pass through it. In a transverse wave the vibration is side to side, ACROSS the direction in which the wave is moving. Examples of this type of wave are water waves, shaking a slinky, radio, light, X rays, gamma rays, microwaves, infrared, ultra violet and radar, S waves in earthquakes."}, {"url": "http://eqseis.geosc.psu.edu/~cammon/HTML/Classes/IntroQuakes/Notes/waves_and_interior.html", "passage_text": "S-waves are transverse waves because they vibrate the ground in a the direction transverse, or perpendicular, to the direction that the wave is traveling. As a transverse wave passes the ground perpendicular to the direction that the wave is propagating. S-waves are transverse waves. "}, {"url": "http://www.bbc.co.uk/schools/gcsebitesize/science/ocr_gateway_pre_2011/energy_home/5_light1.shtml", "passage_text": "In transverse waves the vibrations are at right angles to the direction of travel, as seen in the animation below of a wave sent down a piece of string. The hand moves up and down, as does each part of the string. But the wave moves along from left to right. Water waves and s-waves-one type of seismic wave-are also transverse waves. Your web browser does not have JavaScript switched on at the moment. For information on how to enable JavaScript please go to the Webwise site"}]