[{"url": "http://www.merriam-webster.com/dictionary/soul%20music", "passage_text": "Full Definition of SOUL MUSIC. : music that originated in black American gospel singing, is closely related to rhythm and blues, and is characterized by intensity of feeling and earthiness. See soul music defined for English-language learners. See soul music defined for kids. ADVERTISEMENT"}, {"url": "https://en.wikipedia.org/wiki/Soul_music", "passage_text": "Soul is a popular music genre that originated in the United States in the 1950s and early 1960s. Some soul artists developed funk music, while other singers developed slicker, more sophisticated, and in some cases more politically conscious varieties. By the early 1970s, soul music had been influenced by psychedelic rock and other genres. The United States saw the development of neo soul around 1994."}, {"url": "https://en.wikipedia.org/wiki/Soul_music", "passage_text": "Soul music has its roots in traditional African-American gospel music and rhythm and blues, and the hybridization of their respective religious and secular styles, in both lyrical content and instrumentation, that began to occur in the 1950s. Some soul artists developed funk music, while other singers developed slicker, more sophisticated, and in some cases more politically conscious varieties. By the early 1970s, soul music had been influenced by psychedelic rock and other genres. The United States saw the development of neo soul around 1994."}, {"url": "https://en.wikipedia.org/wiki/Rhythm_and_blues", "passage_text": "Now the term R&B is almost always used instead of the full rhythm and blues, and mainstream use of the term usually refers to contemporary R&B, which is a newer version of soul and funk-influenced pop music that originated as disco faded from popularity. In 1948, RCA Victor was marketing black music under the name Blues and Rhythm. In that year, Louis Jordan dominated the top five listings of the R&B charts with three songs, and two of the top five songs were based on the boogie-woogie rhythms that had come to prominence during the 1940s."}, {"url": "http://www.soulmusicsanctuary.net/soul-musics-history.html", "passage_text": "The term, Soul, was adopted to describe Black popular music as it evolved from the 1950s into the socially conscious 1960s, and through to the early 1970s. There are those who saw it as simply a new term for Rhythm and Blues but this interpretation does miss one of the most important facets of the soul era. However, it's clear that R&B has its origins in the secular folk music of Black American culture-the Blues. From its origin in the South, during the early 20th century, the Blues’ simple but expressive forms had become, by the 1960s, one of the most important influences on the development of popular American music."}, {"url": "https://en.wikipedia.org/wiki/Soul_music", "passage_text": "By 1968, the soul music genre had begun to splinter. Some soul artists developed funk music, while other singers developed slicker, more sophisticated, and in some cases more politically conscious varieties. By the early 1970s, soul music had been influenced by psychedelic rock and other genres. The United States saw the development of neo soul around 1994."}, {"url": "https://en.wikipedia.org/wiki/Rhythm_and_blues", "passage_text": "By the 1970s, rhythm and blues was used as a blanket term for soul and funk. In the 1980s, a newer style of R&B developed, becoming known as  Contemporary R&B . It combines elements of rhythm and blues, soul, funk, pop, hip hop and dance. In 1948, RCA Victor was marketing black music under the name Blues and Rhythm. In that year, Louis Jordan dominated the top five listings of the R&B charts with three songs, and two of the top five songs were based on the boogie-woogie rhythms that had come to prominence during the 1940s."}, {"url": "http://www.answers.com/Q/When_did_soul_music_begin", "passage_text": "1 The History of Soul Music Soul music is a genre of music that became popular in the 1950s and 1960s in the United States. 2  Soul is notable because it combines African American gospel music, as well as …. Soul music began in the late 1950's in the usa."}, {"url": "https://en.wikipedia.org/wiki/Soul_music", "passage_text": "It combines elements of African-American gospel music, rhythm and blues and jazz. Soul music became popular for dancing and listening in the United States; where record labels such as Motown, Atlantic and Stax were influential in the civil rights era. Some soul artists developed funk music, while other singers developed slicker, more sophisticated, and in some cases more politically conscious varieties. By the early 1970s, soul music had been influenced by psychedelic rock and other genres. The United States saw the development of neo soul around 1994."}, {"url": "http://www.soulmusicsanctuary.net/soul-musics-history.html", "passage_text": "Rhythm and Blues (R&B) was, and still is, a term used for a number of post-war American popular music forms. The term is credited to Jerry Wexler when he was editing the charts in Billboard magazine (1947). It was formally introduced to American vernacular in 1949, when it was used in the Billboard chart listings. However, it's clear that R&B has its origins in the secular folk music of Black American culture-the Blues. From its origin in the South, during the early 20th century, the Blues’ simple but expressive forms had become, by the 1960s, one of the most important influences on the development of popular American music."}]