[{"url": "http://wecaremedicalmall.org/ohio_mri_-_ct.htm", "passage_text": "Low cost cash discount starting at $270 CAT Scans-Ohio Affordable CT Scans-MRI starting at $380 cash discount prices-Quality open Ohio MRI or closed Ohio MRI and open Ohio CT Scans available. Doctor referral required by law to get the discount prices."}, {"url": "http://www.newchoicehealth.com/places/ohio/cincinnati/ct-scan", "passage_text": "A CT Scan in Cincinnati costs $962 on average when you take the median of the 30 medical providers who perform CT Scan procedures in Cincinnati, OH. The least expensive CT Scan in Cincinnati is $110 for a CT Bone Density Scan while the most expensive CT Scan list price is $2,025 for a Heart CT Scan."}, {"url": "http://health.costhelper.com/ct-scan.html", "passage_text": "1 For patients not covered by health insurance, the typical cost of a calcium scoring heart CT scan is $50 to $350, while the typical cost of CT angiography ranges from $500 to $1,000. 2  For example, the Heart & Vascular Hospital at Sanford in Sioux Falls, South Dakota, offers calcium scoring scans for $50."}, {"url": "http://health.costhelper.com/ct-scan.html", "passage_text": "1 For patients covered by health insurance, typical out-of-pocket costs typically range from nothing to a copay or coinsurance of 10 to 20 percent, up to $200 for a $1,000 procedure. 2  An example is BlueCross BlueShield of New Mexico HMO plans, which require prior authorization but charge no copay for a cardiac CT scan."}, {"url": "http://www.newchoicehealth.com/places/ohio/columbus/ct-scan", "passage_text": "A CT Scan in Columbus costs $1,051 on average when you take the median of the 38 medical providers who perform CT Scan procedures in Columbus, OH. The least expensive CT Scan in Columbus is $210 for a CT Maxillofacial (Sinus) while the most expensive CT Scan list price is $1,650 for a CT Angiography-Aorta. There are 22 different types of CT Scan provided in Columbus, listed below, and the price for each differs based upon your insurance type."}]