[{"url": "http://constitution.findlaw.com/amendments.html", "passage_text": "This article shall be inoperative unless it shall have been ratified as an amendment to the Constitution by conventions in the several States, as provided in the Constitution, within seven years from the date of the submission hereof to the States by the Congress. Amendment 22 Annotations fn14. Section. 1. Sec. 3. This article shall be inoperative unless it shall have been ratified as an amendment to the Constitution by the legislatures of"}, {"url": "https://en.wikipedia.org/wiki/Amendment", "passage_text": "An amendment is a formal or official change made to a law, contract, constitution, or other legal document. It is based on the verb to amend, which means to change. Amendments can add, remove, or update parts of these agreements. In parliamentary procedure, the way that many meetings are run, an amendment is a type of motion-a proposal or formal suggestion to do something. Amendments can remove words, add words, or change words from motions."}, {"url": "http://loc.gov/rr/program/bib/ourdocs/15thamendment.html", "passage_text": "The 15th Amendment to the Constitution granted African American men the right to vote by declaring that the right of citizens of the United States to vote shall not be denied or abridged by the United States or by any state on account of race, color, or previous condition of servitude.. "}, {"url": "https://en.wikipedia.org/wiki/Constitutional_amendment", "passage_text": "A constitutional amendment refers to the modification of the Constitution of a nation or state. In many jurisdictions the text of the constitution itself is altered; in others the text is not changed, but the amendments change its effect. The method of modification is typically written into the Constitution itself."}, {"url": "http://www.archives.gov/exhibits/charters/constitution_amendments_11-27.html", "passage_text": "This article shall be inoperative unless it shall have been ratified as an amendment to the Constitution by the legislatures of three-fourths of the several States within seven years from the date of its submission. Passed by Congress February 20, 1933. Ratified December 5, 1933. Section 1. Section 3. This article shall be inoperative unless it shall have been ratified as an amendment to the Constitution by conventions in the several States, as provided in the Constitution, within seven years from the date of the submission hereof to the States by the Congress. Passed by Congress March 21, 1947"}, {"url": "http://www.thefreedictionary.com/amendment", "passage_text": "I understand a proposed amendment to the Constitution--which amendment, however, I have not seen--has passed Congress, to the effect that the Federal Government shall never interfere with the domestic institutions of the States, including that of persons held to service. "}, {"url": "http://www.archives.gov/exhibits/charters/constitution_amendments_11-27.html", "passage_text": "This article shall be inoperative unless it shall have been ratified as an amendment to the Constitution by the legislatures of the several States, as provided in the Constitution, within seven years from the date of the submission hereof to the States by the Congress. Passed by Congress June 4, 1919. Section 3. This article shall be inoperative unless it shall have been ratified as an amendment to the Constitution by conventions in the several States, as provided in the Constitution, within seven years from the date of the submission hereof to the States by the Congress. Passed by Congress March 21, 1947"}, {"url": "http://www.ushistory.org/documents/amendments.htm", "passage_text": "Section 3. This article shall be inoperative unless it shall have been ratified as an amendment to the Constitution by the legislatures of the several States, as provided in the Constitution, within seven years from the date of the submission hereof to the States by the Congress. January 16, 1919. "}, {"url": "http://www.uscourts.gov/about-federal-courts/educational-resources/about-educational-outreach/activity-resources/what-does-0", "passage_text": "The Constitution, through the Fourth Amendment, protects people from unreasonable searches and seizures by the government. The Fourth Amendment, however, is not a guarantee against all searches and seizures, but only those that are deemed unreasonable under the law. Whether a particular type of search is considered reasonable in the eyes of the law, is determined by balancing two important interests."}]