[{"url": "https://en.wikipedia.org/wiki/Student_loans_in_the_United_Kingdom", "passage_text": "Student loans and grants in the United Kingdom are primarily provided by the government through the Student Loans Company (SLC), a non-departmental public body. The SLC is responsible for Student Finance England and is a delivery partner of Student Finance Wales and Student Finance NI. In January 2000, the Scottish government, which consisted of a coalition between Labour and the Liberal Democrats, decided to replace annual tuition fees for Scottish students studying at Scottish universities with a £2,000 charge after graduation. This charge was abolished in 2008."}, {"url": "http://financial-dictionary.thefreedictionary.com/Tuition+loan", "passage_text": "A parent, guardian or the student may take out a student loan. In the United States, the federal government subsidizes or guarantees some student loans to enable more people to attend college. Interest on student loans is also tax deductible in the United States. However, because universities in the United States are often so expensive, many students spend a significant portion of their income on student debt service. "}, {"url": "https://en.wikipedia.org/wiki/Student_loan", "passage_text": "If applying loan towards both tuition/school fees and in-study living expenses, the lower limit is KRW 600,000 (at least KRW 100,000 for tuition/school fees plus at least KRW 500,000 for living expenses). A student loan is designed to help students pay for university tuition, books, and living expenses. It may differ from other types of loans in that the interest rate may be substantially lower and the repayment schedule may be deferred while the student is still in school"}, {"url": "https://en.wikipedia.org/wiki/Student_loan", "passage_text": "The student may determine the amount to borrow in increments of KRW 100,000—from KRW 500,000 to KRW 1 million per semester (or up to KRW 2 million per school year). May receive loan on its own or in combination with a student loan (for school tuition and fees). A student loan is designed to help students pay for university tuition, books, and living expenses. It may differ from other types of loans in that the interest rate may be substantially lower and the repayment schedule may be deferred while the student is still in school"}, {"url": "http://www.thefreedictionary.com/tuition+fee", "passage_text": "tuition fee-a fee paid for instruction (especially for higher education); tuition and room and board were more than $25,000. He was very sorry, but he was compelled to give me back my tuition fee and to ask me to leave the school. John Barleycorn by London, Jack View in context. One would rather write masterpieces of literature no doubt -- but meanwhile board and tuition fees have to be paid."}, {"url": "http://www.moneysavingexpert.com/students/student-loans-tuition-fees-changes", "passage_text": "The loan is repaid in exactly the same way as the loan for tuition fees (ie, 9% of everything earned above 21,000). The amount available is dictated by two elements: The guaranteed bit. Up to 65% of the maximum living cost loan is currently available to everyone, regardless of their parental income. Both will then be able to apply for a student loan for the remainder of their fees (eg, undergrad med student can apply for a loan for 1-4 years). Graduates on the four-year accelerated medicine programme will have to fund the 3,465 tuition fee for all the years themselves."}, {"url": "http://www.moneysavingexpert.com/students/student-loans-tuition-fees-changes", "passage_text": "Fees are between 4,500 and some 6,750. Yet since 2012, for the first time, part-time students studying at least 25% of a full-time course have been eligible for tuition fee Student Loan Company loans on exactly the same basis as full-time students. They aren't eligible for maintenance loans or grants though. Both will then be able to apply for a student loan for the remainder of their fees (eg, undergrad med student can apply for a loan for 1-4 years). Graduates on the four-year accelerated medicine programme will have to fund the 3,465 tuition fee for all the years themselves."}, {"url": "https://en.wikipedia.org/wiki/Student_loan", "passage_text": "Loan must be used for tuition, qualifying school fees, and other specific education-related costs, including living expenses during study. Loan payments may not exceed the student’s financial need; there is no other upper limit on the amount borrowed (loan program permits full coverage of tuition and expenses). A student loan is designed to help students pay for university tuition, books, and living expenses. It may differ from other types of loans in that the interest rate may be substantially lower and the repayment schedule may be deferred while the student is still in school"}]