[{"url": "http://www.fao.org/docrep/t0690e/t0690e0a.htm", "passage_text": "Breeding rabbits. The female rabbit (doe) does not come into heat (oestrus) as do other animals. The doe will accept the male (buck) at any time of the year. Does are mature and can breed at 5 to 6 months of age and can continue to have young for 4 years. The length of pregnancy in the rabbit is 31 days and the doe can produce from 1 to 12 young each time she gives birth. She can become pregnant again within a few days of giving birth"}, {"url": "http://www.wikihow.com/Take-Care-of-a-Pregnant-Rabbit", "passage_text": "1. Check if your rabbit is pregnant. Medium to large size rabbits are sexually mature at 4 to 4.5 months, while giant breeds are ready at 6 to 9 months. If your female rabbit is at this stage of maturity and you have reason to suspect that she has been breeding, then check for pregnancy as follows. 1 Until the age of 8 months, keep kits fed on rabbit pellets. 2  Leave the kits with mother until 6-7 weeks of age. 3  At this point, if the litter is large, you can remove the largest pair or trio and place them in their own cage. 4  This will give a chance to the smaller ones to nurse for a week longer and catch up in weight."}, {"url": "http://www.threelittleladiesrabbitry.com/breeding.php", "passage_text": "The age at which a rabbit can be bred depends on the size of the breed and the sex of the rabbit. In small breed rabbits the doe is normally ready to mate when she is 5 months old, and a buck is ready at 6 months. In medium breed rabbits the doe is ready to breed when she is 6 months old and the buck at 7 months. In large breed rabbits the doe is ready at 8 months and the buck is ready at 9 months. Rabbits do not ovulate on a regular cycle, as a result they do not actually go into heat"}, {"url": "http://www.wikihow.com/Breed-Rabbits", "passage_text": "Breed your rabbits at the proper age. You want to start breeding does (female rabbits) when they are reaching maturity. For small-medium breeds, they can be bred at 5-6 months old. Larger breeds can be bred at 8-9 months. Bucks (male rabbits) are usually ready around 6 months old if a small breed, 7 months if medium, and 9 months for a large breed. 5. Ensure that you will have homes for the kits (babies) before you breed. "}, {"url": "http://www.motherearthnews.com/homesteading-and-livestock/raising-rabbits/caring-for-your-pregnant-rabbit-ze0z1411zhur.aspx", "passage_text": "Q. How long does a rabbit pregnancy last? A. The gestation period for rabbits is almost exactly 31 days. That said, rabbits might occasionally kindle anytime between 28 days and 35 days, with a scant handful of rabbits ever waiting beyond 39 days to kindle. "}, {"url": "http://www.debmark.com/rabbits/breeding.htm", "passage_text": "A small breed doe is normally ready to mate when she is 5 months old, and a buck is ready at 6 months. The medium size doe is ready to breed when she is 6 months old and the buck at 7 months. The heavy breed doe is ready at 8 months and the buck is ready at 9 months. It's usually a good idea to select rabbits to breed whose ancestry has evidence of good productivity and good genetics. That's where productivity records and pedigrees listing show winnings come in handy."}, {"url": "https://answers.yahoo.com/question/index?qid=20070617230116AAZEroT", "passage_text": "Right at 28 days after the breeding is when you should stick in the nestbox. The doe will typically have the babies right at 30 days. If she doesn't have them by the end of the 32nd day she will not have them and you can pull the nestbox out. Rabbits only milk about once to twice a day. Some breeders check two weeks after they mate their rabbit buy re-breeding. This isn't all that great of an idea, as rabbits can just keep mating, and she can carry multiple litters. At about 2-3 weeks you'll be able to feel the babies in her stomach. She'll also be moody and wont want to be handled."}, {"url": "http://www.debmark.com/rabbits/breeding.htm", "passage_text": "A rabbit may normally start breeding at the age of 6 months for the small to medium size breeds and 8 to 9 months for the heavy breeds. The gestation period (time between breeding and kindling) is 31 days. After the doe has kindled, I normally re-breed her at 6 weeks and wean the litter at 5-7 weeks. The heavy breed doe is ready at 8 months and the buck is ready at 9 months. It's usually a good idea to select rabbits to breed whose ancestry has evidence of good productivity and good genetics. That's where productivity records and pedigrees listing show winnings come in handy."}]