[{"url": "http://blogs.fda.gov/fdavoice/index.php/tag/national-consumer-protection-week/", "passage_text": "For the FDA, banishing fraudulent remedies has been a top focus since the agency was created—and that was back in the early 1900’s, when consumer protection involved protecting consumers from peddlers of snake oil and “miracle” elixirs. The most common fraudulent products claim to prevent or treat such chronic diseases as cancer, arthritis, diabetes, heart disease, Alzheimer’s disease and multiple sclerosis. But other bogus cure-alls can emerge quickly in the wake of new public health hazards."}, {"url": "http://blogs.fda.gov/fdavoice/index.php/tag/national-consumer-protection-week/", "passage_text": "This week, FDA joins 29 other government agencies and a host of private groups to highlight National Consumer Protection Week, an annual event for consumers to learn how to protect their privacy, manage money and debt, avoid identity theft, and prevent frauds and scams. The most common fraudulent products claim to prevent or treat such chronic diseases as cancer, arthritis, diabetes, heart disease, Alzheimer’s disease and multiple sclerosis. But other bogus cure-alls can emerge quickly in the wake of new public health hazards."}, {"url": "http://www.thebody.com/content/art13857.html", "passage_text": "FDA regulates over $1 trillion worth of products, which account for 25 cents of every dollar spent annually by American consumers. FDA is one of our nation's oldest consumer protection agencies. Its approximately 9,000 employees monitor the manufacture, import, transport, storage and sale of about $1 trillion worth of products each year. It does that at a cost to the taxpayer of about $3 per person. First and foremost, FDA is a public health agency, charged with protecting American consumers by enforcing the Federal Food, Drug, and Cosmetic Act and several related public health law"}, {"url": "http://www.fda.gov/AboutFDA/Transparency/Basics/ucm194877.htm", "passage_text": "FDA's responsibilities extend to the 50 United States, the District of Columbia, Puerto Rico, Guam, the Virgin Islands, American Samoa, and other U.S. territories and possessions. "}, {"url": "https://www.organicconsumers.org/news/five-ways-fda-has-failed-consumers-genetically-engineered-foods", "passage_text": "1. No health safety testing. Genetically engineered (GE) foods have never been safety tested by the U.S. Food and Drug Administration (FDA), thanks to a 20-year-old policy that says it’s up to the biotech companies to determine the safety of genetically engineered (GE) foods. "}, {"url": "http://ods.od.nih.gov/HealthInformation/consumerprotection.sec.aspx", "passage_text": "Create PDF. Information from the U.S. Food and Drug Administration (FDA) and Federal Trade Commission (FTC) on dietary supplement safety, fraud, and other consumer protection matters. Also provides information on how to file a report or complaint. Safety warnings from the U.S. Food and Drug Administration (FDA) about specific dietary supplements. Provides a Web link for reporting health problems associated with dietary supplements."}, {"url": "http://ods.od.nih.gov/HealthInformation/consumerprotection.sec.aspx", "passage_text": "Consumer Protection. Information from the U.S. Food and Drug Administration (FDA) and Federal Trade Commission (FTC) on dietary supplement safety, fraud, and other consumer protection matters. Also provides information on how to file a report or complaint. Safety warnings from the U.S. Food and Drug Administration (FDA) about specific dietary supplements. Provides a Web link for reporting health problems associated with dietary supplements."}, {"url": "https://en.wikipedia.org/wiki/Food_and_Drug_Administration", "passage_text": "The Food and Drug Administration (FDA or USFDA) is a federal agency of the United States Department of Health and Human Services, one of the United States federal executive departments. The FDA regulates more than US$1 trillion worth of consumer goods, about 25% of consumer expenditures in the United States. This includes $466 billion in food sales, $275 billion in drugs, $60 billion in cosmetics and $18 billion in vitamin supplements."}, {"url": "https://en.wikipedia.org/wiki/Consumer_protection", "passage_text": "Consumer protection is a group of laws and organizations designed to ensure the rights of consumers as well as fair trade, competition and accurate information in the marketplace. The laws are designed to prevent businesses that engage in fraud or specified unfair practices from gaining an advantage over competitors. Consumer protection laws are a form of government regulation, which aim to protect the rights of consumers. For example, a government may require businesses to disclose detailed information about products—particularly in areas where safety or public health is an issue, such as food."}]