[{"url": "http://www.enotes.com/homework-help/do-parents-juliet-force-her-marry-paris-1921", "passage_text": "(Answer #2). When Paris first says he wants to marry Juliet, Lord Capulet (her father) specifically says woo her and indicates that his permission is only part of the deal and that Juliet has to agree too. Later, Paris asks again and Lord Capulet says Juliet should listen to his suggestion and marry Paris. That's in between. Juliet's parents did force her to marry Paris, Lord Capulet even threaten her that he would disown her if she doesn't. Of course though, Juliet faked her death, so she didn't have to marry Paris. And of course her plan lead to both her and Romeo' s death."}, {"url": "http://www.answers.com/Q/Does_juliet's_father_want_her_to_marry_Paris", "passage_text": "no one in specific but the day that Juliet wanted to tell her father, her father told her about Paris and when she refused he was so angry and swore that if she doesn't marry … Paris she won't be his daughter anymore. Juliet and Friar Laurence planned to get Romeo and Juliet together, but Capulet wanted to marry Paris to Juliet on Thursday. The Friar gave her a potion that would make her se … em dead for 42 hours, which she was to take Wednesday night."}, {"url": "http://www.bbc.co.uk/bitesize/ks3/english/shakespeare_summaries/romeo_juliet/revision/7/", "passage_text": "Juliet's mother tells her to cheer up because her father has arranged for her to marry Paris. Juliet loses her temper and refuses. Her father comes in and can't believe how ungrateful she is being. He threatens to throw her out and disown her. He says he wants to hit her. Capulet is in a good mood. Juliet tells her father that she has been to see the Friar to confess her sins and asks for her dad's forgiveness. Even the Nurse believes her. Juliet says good night to her mum then starts to panic about what she is about to do."}, {"url": "http://www.bbc.co.uk/bitesize/ks3/english/shakespeare_summaries/romeo_juliet/revision/7/", "passage_text": "The Nurse tells Juliet to forget Romeo and marry Paris. When Juliet's mother and father have left, Juliet asks the Nurse what she should do. The Nurse says to forget Romeo and just marry Paris without owning up. Capulet is in a good mood. Juliet tells her father that she has been to see the Friar to confess her sins and asks for her dad's forgiveness. Even the Nurse believes her. Juliet says good night to her mum then starts to panic about what she is about to do."}, {"url": "http://shakespeare-navigators.com/romeo/S35.html", "passage_text": "1 Juliet pleads with her mother to intervene, but Lady Capulet refuses. 2  Exit Capulet, then Lady Capulet: 3  Juliet asks the Nurse for advice, and she tells Juliet that she ought to marry Paris because Romeo can never come back and Paris is better looking, anyway. Juliet asks what the day of joy is. Lady Capulet tells her it's that early on Thursday Paris will make her a joyful bride at St. Peter's Church, but Juliet exclaims, Now, by Saint Peter's Church and Peter too, / He shall not make me there a joyful bride (3.5.116-117) ."}, {"url": "http://www.answers.com/Q/Why_does_Juliet's_father_want_her_to_marry_Paris", "passage_text": "no one in specific but the day that Juliet wanted to tell her father, her father told her about Paris and when she refused he was so angry and swore that if she doesn't marry … Paris she won't be his daughter anymore. Juliet and Friar Laurence planned to get Romeo and Juliet together, but Capulet wanted to marry Paris to Juliet on Thursday. The Friar gave her a potion that would make her se … em dead for 42 hours, which she was to take Wednesday night."}, {"url": "http://www.enotes.com/homework-help/what-lord-capulets-reaction-when-juliet-refuses-468551", "passage_text": "He arranges for Juliet to marry Paris immediately. Lady Capulet delivers the news, but Juliet is not thrilled as her father expected her to be. In fact, she flatly refuses to marry Paris--or anyone else, for that matter. Capulet's reaction is extraordinary. He yells at her, he curses her, he calls her names, and he vows to disown her. Capulet sounds like a loving and reasonable father when he tells Paris that Juliet is too young and that. My will to her consent is but a part. Capulet makes it clear that he will never consent to anyone marrying his daughter without her approval."}, {"url": "http://shakespeare-navigators.com/romeo/S35.html", "passage_text": "1 Lady Capulet replies that Juliet's father is coming, so Juliet ought to tell him she won't marry Paris, if she dares. 2  Enter Capulet and Nurse: 3  Lady Capulet tells Capulet that Juliet has refused to marry Paris. 4  Enraged, Capulet threatens to throw her out of the house if she doesn't change her mind. Juliet asks what the day of joy is. Lady Capulet tells her it's that early on Thursday Paris will make her a joyful bride at St. Peter's Church, but Juliet exclaims, Now, by Saint Peter's Church and Peter too, / He shall not make me there a joyful bride (3.5.116-117) ."}, {"url": "http://www.enotes.com/homework-help/do-parents-juliet-force-her-marry-paris-1921", "passage_text": "(Answer #5). Juliet's parents did force her to marry Paris, Lord Capulet even threaten her that he would disown her if she doesn't. Of course though, Juliet faked her death, so she didn't have to marry Paris. And of course her plan lead to both her and Romeo' s death."}, {"url": "http://shakespeare-navigators.com/romeo/S35.html", "passage_text": "Her news will be that Juliet's father has arranged for her to be married to Paris, and Lady Capulet is so sure this will make Juliet happy that she teases her a little, as the Nurse earlier teased Juliet when she brought the news from Romeo. Juliet asks what the day of joy is. Lady Capulet tells her it's that early on Thursday Paris will make her a joyful bride at St. Peter's Church, but Juliet exclaims, Now, by Saint Peter's Church and Peter too, / He shall not make me there a joyful bride (3.5.116-117) ."}]