[{"url": "https://prezi.com/mw0adsfy-y4a/hudson-bay-arctic-lowlands/", "passage_text": "The Hudson Bay-Arctic Lowlands were established during the Paleozoic Era, about 542 million years ago. They were developed concluding the most recent ice age, commonly referred to as the Pleistocene Epoch. The Hudson Bay-Arctic Lowlands were formed during the depression of the Canadian Shield, by the weight of the continental ice sheets. As these ice sheets retreated, the region was flooded by the sea, thus causing sediments to deposit in them. "}, {"url": "http://www.answers.com/Q/How_arctic_lowlands_formed", "passage_text": "Answered by The Community. Making the world better, one answer at a time. The Arctic Lowlands were formed at the end of Pleistocene epoch (the last ice age). The enormous weight of the glacier sunk the Canadian Shield and the area became lowlands when the glaciers retreated, same as the Hudson Bay Lowlands. "}, {"url": "http://www.answers.com/Q/When_did_the_Hudson_bay_lowlands_form", "passage_text": "Answer by Snakezjokerz. Confidence votes 36. The Hudson Bay Lowlands formed at the end of the last ice age when the glaciers that were on top of the land scraped some of the earth making lowlands in canada, the glaciers had rocks embedded onto the bottom of them allowing them to sweep away anything in its path... The Hudson Bay Lowlands are a vast wetland located between  the Canadian  Shield and southern shores of Hudson Bay and  James Bay.  Most of the area lies within the provin … ce of Ontario, with smaller  portions reaching into Manitoba and Quebec."}, {"url": "http://www.infoplease.com/encyclopedia/world/hudson-bay.html", "passage_text": "Mansel, Coats, and Southampton islands are at the northern end of the bay. Hudson Bay occupies the southernmost portion of the Hudson Bay Lowlands, a depression in the Canadian Shield formed during the Pleistocene epoch by the weight of the continental ice sheet. As the ice retreated, the region was flooded by the sea, and sediments were deposited in it. "}, {"url": "http://geography.ridley.on.ca/CGC1D/Students/Geo%20Project/Landforms.htm", "passage_text": "Ontario, the largest province in Canada, is home to three different landform regions: the Hudson Bay Lowlands (yellow), the Canadian Shield (dark green), and the Great Lakes/St. Lawrence Lowlands (light green). The most northern region in Ontario, the Hudson Bay Lowlands, is a low area near Hudson Bay and James Bay that is covered with swampy forest. After the last Ice Age much of this land was covered by water. This left a layer of sedimentary rock on top of the Canadian Shield. "}, {"url": "https://en.wikipedia.org/wiki/Hudson_Bay_Lowlands", "passage_text": "The Hudson Bay Lowlands are a vast wetland located between the Canadian Shield and southern shores of Hudson Bay and James Bay. Most of the area lies within the province of Ontario, with smaller portions reaching into Manitoba and Quebec. Many wide and slow-moving rivers flow through this area toward the salt water of Hudson Bay: these include the Churchill, Nelson and Hayes in Manitoba, Severn, Winisk, Ekwan, Attawapiskat, and Albany in Ontario, and the Harricana, Rupert and Eastmain in Quebec."}, {"url": "http://www.thecanadianencyclopedia.ca/en/article/physiographic-regions/", "passage_text": "Canada may be divided into seven physiographic regions: Arctic Lands, Cordillera, Interior Plains, Hudson Bay Lowland, Canadian Shield Forest Lands, St Lawrence Lowlands and Appalachia. Divisions are based on each area’s relatively similar physical geography and landforms. "}, {"url": "http://www.answers.com/Q/When_did_the_Hudson_bay_lowlands_form", "passage_text": "The  Hudson Bay Lowlands are in fact a vast wetland  area between the Laurentian Plateau and southern shores of Hudson …  Bay and James Bay, mostly lying within Ontario Province but with a  few sectors in Manitoba and Quebec Provinces. The Hudson Bay Lowlands are a vast wetland located between  the Canadian  Shield and southern shores of Hudson Bay and  James Bay.  Most of the area lies within the provin … ce of Ontario, with smaller  portions reaching into Manitoba and Quebec."}, {"url": "https://en.wikipedia.org/wiki/Arctic_Lowlands", "passage_text": "From Wikipedia, the free encyclopedia. The Arctic Lowlands and Hudson Bay Lowlands are a physiographic division, lying between the Canadian Shield and the Innuitian region To the south of the surfaces and lowland plains. This is a region of tundra, a treeless Plain, with a cold, dry climate and poorly drained soil. However, the Paleozoic sedimentary rock, from which the Lowlands are formed, contains lignite (a form of coal), oil, and natural gas deposits. Limestone is very abundant as well. The Arctic Lowlands have a small human population. The terrain is mostly ice, snow, rock, and it is full of marshes, especially in the winter."}]