[{"url": "http://www.womenshealth.gov/publications/our-publications/fact-sheet/pregnancy-test.html", "passage_text": "1 Blood test. 2  This type of pregnancy test can only be done at a doctor’s office. 3  It takes longer than a urine test to get results, but it can detect a pregnancy earlier than a urine test (about 10 days after conception, compared to typically 2 weeks or more for a urine test). "}, {"url": "http://americanpregnancy.org/getting-pregnant/understanding-pregnancy-tests/", "passage_text": "Advantages of having a blood test done: 1  Can detect a pregnancy earlier than a urine test at about 7-12 days from possible conception (but if a negative result is received, a test should be repeated if a period is missed.). Tests vary in how long you have to wait to get a result. You will be looking for a change in color, a line, or a symbol (like a plus or minus). The newer digital pregnancy test offered by Clearblue Easy makes reading your results simple: the window will either show the words “not pregnant” or “pregnant”."}, {"url": "http://www.babycenter.com/400_how-long-does-it-take-to-get-a-positive-pregnancy-test_14496904_829.bc", "passage_text": "Yes | No Thank you! If you are truly 5 weeks along, pregnancy test would have come out positive, but there are some cases where it doesn't. I would call the doctor and schedule for a blood test to confirm if pregnant or not. posted 08/11/2013 by My Little Miracle xo. Report answer. "}, {"url": "http://americanpregnancy.org/getting-pregnant/taking-a-pregnancy-test/", "passage_text": "A pregnancy test with a sensitivity of 20 IU/L is more sensitive than one with 50 IU/L. A blood test administered by your doctor is more sensitive than the early home tests and can be taken between 7 and 12 days after you conceive. Most doctors recommend that you wait until the first day of your missed period before taking a home pregnancy test. A missed period is usually one of the first signs of pregnancy. This is usually around two weeks after conception."}, {"url": "http://www.babyhopes.com/articles/when-does-a-pregnancy-test-turn-positive.html", "passage_text": "A positive blood test will usually show a positive result 3 to 4 days after implantation, or roughly 9 to 10 days after ovulation. For a home urine test, however, a positive result will not be visible until a week after implantation or until you have a missed period. "}, {"url": "http://www.babycenter.com/400_how-soon-after-giving-birth-can-you-take-a-home-pregnancy-te_9247053_705.bc", "passage_text": "HCG, the hormone the pregnancy tests test for, disappears from your body about 3-4 weeks after giving birth. So if you test now and get a positive, it means you're pregnant. "}, {"url": "https://answers.yahoo.com/question/index?qid=20070514001645AAePb3k", "passage_text": "3. Medication: There are a few drugs which have the pregnancy hormone in that may give a false positive result. When I took a urine pregnancy test, I was 3 weeks pregnant. So, I would say as early as day 26 of a regular 28 day menstrual cycle. So,if you think you're pregnant, it might seem like a really long wait, but doctors recommend you don't take a test until your period is a day overdue. However, the First Response Pregnancy Test says that it can detect pregnancy hormones in 52% of women three days before their period is due."}, {"url": "https://uk.answers.yahoo.com/question/index?qid=20090105050423AAQiLJj", "passage_text": "I've heard 21 days after conception-but with the tests available nowadays it's probably less.....According to the dates of my wife's last pregnancy we conceived on the 28th July....had a negative result on the 17th August but a positive one on the 20th.....so that might give you an indication........best of luck. How long does it take from conception to show positive on a pregnancy test? I have pcos and do not have regular periods and also had missed miscarriage month ago but have been ttc."}, {"url": "http://www.parenting.com/answers/q/how-long-does-it-take-show-positive-pregnancy-test", "passage_text": "Report. Report. VforVenture. 3 years ago. It takes 2-3 days for the sperm to meet the egg, 2-3 days for the egg to travel down the fallopian tube, 1-2 days for the fertilized egg to implant, and another 2-3 days for the level of hcg to build up enough in your system to get a positive result on a pregnancy test. "}, {"url": "https://answers.yahoo.com/question/index?qid=20060716004627AAwFtka", "passage_text": "RE: How long can it take to get a positive pregnancy test? I am ttc and am 3 days late but still getting negative home pregnancy tests. I have tested with dollar general, answer, and EPT. when i was trying to get pregnant with my daughter i did 4 pregnancy tests and they were all negative. i threw the last negative one in the bin and decided that i just wasnt pregnant, about 12 hours later i got the urge to check the test and it was positive, it took so long to go positive because i was 4 weeks pregnant."}]