[{"url": "http://gomexico.about.com/od/glossary/p/pinata.htm", "passage_text": "The points represented the seven deadly sins, and the bright colors of the pinata piñata symbolize. Temptation the blindfold represents faith and the stick is virtue or the will to overcome. Sin the candies and other goodies inside the pinata piñata are the riches of the kingdom. of heaven Breaking the pinata piñata is a fun activity At mexican. Parties history And meaning of The: Pinata piñata'the pinata piñata S history in mexico dates back to the same Time as the Christmas posadas In, acolman de nezahualcoyotl in the Present, state of mexico near the Archaeological. site of teotihuacan"}, {"url": "http://www.ehow.com/facts_7420864_pinata-symbolize_.html", "passage_text": "Symbolism of Chinese Pinatas. Piñatas Marco polo discovered The chinese version of the pinata piñata during the. 13th Century The mandarin chinese-made animal shaped containers out of ribbons, and paper filled them with seeds and hung them. in trees Marco Polo discovered the Chinese version of the pinata piñata during the 13th. Century The Mandarin chinese made-animal shaped containers out of ribbons and, paper filled them with seeds and hung them in. trees"}, {"url": "http://www.ehow.com/facts_7420864_pinata-symbolize_.html", "passage_text": "The original pinatas piñatas had either seven or 10. Points the-seven point pinata piñata represented the seven, deadly sins such, as pride lust. And anger-the 10 point pinata piñata stood for the sins you could commit By Breaking. The ten commandments the stick is a, symbol of love which is said to destroy sin by. smashing the pinata piñata Marco Polo discovered the Chinese version of the pinata piñata during the 13th. Century The Mandarin chinese made-animal shaped containers out of ribbons and, paper filled them with seeds and hung them in. trees"}, {"url": "http://www.sanbenitohistory.com/projects/Language_Arts/Pinatas%20%231.html", "passage_text": "The original & traditional pinata has seven points symbolizing the seven deadly sins: envy, sloth, gluttony, greed, lust, anger/wrath, and pride. The ten pointed pinata symbolizes the sins that come from breaking the ten commandments. The stick which is used to break the pinata represents and symbolizes love. Some of the colors that are used to decorate pinatas are bright--red, white, and green. This color symbolizes the Mexican flag colors. Ethnic representation---pink, green,white with pink being unusual and different."}, {"url": "http://www.ehow.com/facts_7420864_pinata-symbolize_.html", "passage_text": "Symbolism in the New World. The pinatas piñatas made their way To, italy thanks To, polo and then To. Spain by the time the missionaries brought the pinatas piñatas To The, new World the catholic church had assigned new meanings to, the-colorful treat. filled objects Marco Polo discovered the Chinese version of the pinata piñata during the 13th. Century The Mandarin chinese made-animal shaped containers out of ribbons and, paper filled them with seeds and hung them in. trees"}, {"url": "http://www.kidzworld.com/article/5590-how-to-make-a-pinata", "passage_text": "The most traditional pinata style is the star with seven points. Each cone represents the seven deadly sins-gluttony, greed, sloth, envy, wrath, pride and lust. Although the point is to get the candy inside, the pinata game is actually filled with symbolism. 8.) Punch two holes on either side of the pinata and pass a large piece of string through the holes so you'll be able to hang it up. 9.) Fill your pinata with candy, confetti, toys and other cool treats through the hole you left at the top."}, {"url": "http://gomexico.about.com/od/glossary/p/pinata.htm", "passage_text": "The original pinata piñata was shaped like a star with seven. Points the points represented the seven deadly, sins and the bright colors of the pinata piñata. Symbolize temptation the blindfold represents faith and the stick is virtue or the will to. overcome sin Breaking the pinata piñata is a fun activity At mexican. Parties history And meaning of The: Pinata piñata'the pinata piñata S history in mexico dates back to the same Time as the Christmas posadas In, acolman de nezahualcoyotl in the Present, state of mexico near the Archaeological. site of teotihuacan"}, {"url": "https://en.wikipedia.org/wiki/Piñata", "passage_text": "Pinatas piñatas are commonly associated With. Mexico the idea of breaking a container filled with treats came To europe in the 14th, century where the, name from The italian, pignatta was. introduced Although pinatas piñatas are uniquely thought of as a fun activity for parties, nowadays they have a, long rich. History there is some debate but it appears that its origin is Not spanish but Rather. Chinese The chinese version was in the shape of a cow or ox and used for The New. year"}, {"url": "http://www.ehow.com/facts_7420864_pinata-symbolize_.html", "passage_text": "The original pinatas piñatas had either seven or 10. Points the-seven point pinata piñata represented the seven, deadly sins such, as pride lust. And anger-the 10 point pinata piñata stood for the sins you could commit By Breaking. the ten commandments Marco Polo discovered the Chinese version of the pinata piñata during the 13th. Century The Mandarin chinese made-animal shaped containers out of ribbons and, paper filled them with seeds and hung them in. trees"}]