[{"url": "http://www.woodlandtrust.org.uk/visiting-woods/trees-woods-and-wildlife/british-trees/native-trees/", "passage_text": "Blackthorn, also known as 'sloe', is a small deciduous tree native to the UK and most of E... 1  Box, common (Buxus sempervirens) Common box is a large, slow-growing evergreen tree native to the UK (mainly the south) and... 2  Read more. Elm, wych (Ulmus glabra). Wych elm is a deciduous broadleaf tree native to the UK and much of Europe. 1  Hawthorn, common (Crataegus monogyna) Common hawthorn is a deciduous tree native in the UK and across Europe."}, {"url": "https://en.wikipedia.org/wiki/Forestry_in_the_United_Kingdom", "passage_text": "Broadleaves account for 29% of Britain's woodlands, the rest being conifers, but considering only England, the figures are 55% broadleaf and 45% conifer. Britain's native tree flora comprises 32 species, of which 29 are broadleaves. Britain's industry and populace uses at least 50 million tonnes of timber a year. More than 75% of this is softwood, and Britain's forests cannot supply the demand; in fact, less than 10% of the timber used in Britain is home-grown. In the absence of people, much of Great Britain would be covered with mature oaks, except for Scotland. Although conditions for forestry are good, trees do face damage threats arising from fungi, parasites and pests."}, {"url": "http://www.woodlandtrust.org.uk/visiting-woods/trees-woods-and-wildlife/british-trees/native-trees/", "passage_text": "Field maple is a broadleaf deciduous tree native to the UK and most of Europe. 1  Oak, English (Quercus robur) English oak is arguably the best known and loved of British native trees. 2  It is the most c... Elm, wych (Ulmus glabra). Wych elm is a deciduous broadleaf tree native to the UK and much of Europe. 1  Hawthorn, common (Crataegus monogyna) Common hawthorn is a deciduous tree native in the UK and across Europe."}, {"url": "https://en.wikipedia.org/wiki/Trees_of_Britain_and_Ireland", "passage_text": "(Redirected from Trees of Britain and Ireland). Many lists of trees of Great Britain and Ireland have been written. There are a number of issues surrounding the inclusion of a species in such a list. As can be seen from the outline of debate below, there is no 'correct' list of trees of Britain and Ireland. Britain and Ireland have few endemic trees, most being micro-species of Whitebeam. But there are some interesting endemic trees nevertheless. 1  Plot’s Elm – English Midlands only. 2  Apomictic Whitebeams endemic to the British Isles: 3  Sorbus arranensis – Isle of Arran only. 4  Arran Service Tree"}, {"url": "http://www.forestry.gov.uk/forestry/infd-6a5kvg", "passage_text": "Trees. Share. There are many different tree species to be found in the New Forest ranging from the common English oak, ash and beech to more exotic species such as Wellingtonia, sweet chestnut and Japanese cedar. The New Forest also contains many lovely old trees that are reaching 200-300 years in age."}, {"url": "https://en.wikipedia.org/wiki/Forestry_in_the_United_Kingdom", "passage_text": "For example, only thirty-one species of deciduous tree and shrub are native to Scotland, including ten willows, four whitebeams and three birch and cherry. This is a list of tree species that existed in Britain before 1900. The sheer number of tree species planted subsequently precludes a complete list. In the absence of people, much of Great Britain would be covered with mature oaks, except for Scotland. Although conditions for forestry are good, trees do face damage threats arising from fungi, parasites and pests."}, {"url": "http://www.orangepippintrees.co.uk/articles/growing-fruit-trees-in-the-uk-climate", "passage_text": "There is no well-established method for dividing the UK into climate zones-no equivalent of the North American USDA plant hardiness climate zones. This article attempts to establish some guidelines on growing apple trees and other fruit trees in the different climate regions of the UK. For commercial growers the UK is essentially a marginal climate. (The climate of Cornwall is surprisingly difficult for fruit trees, which is why well-adapted regional varieties such as Cornish Gilliflower remain popular). Growing fruit trees in this region is a little more of a challenge than in Zone 3 - but rest assured, still relatively straightforward."}, {"url": "http://www.twigs.org.uk/nativetrees.htm", "passage_text": "Some trees not native to the UK will be listed. Naturalised trees, those that have been introduced here and are not only growing in our environment, but successfully setting seed and germinating saplings. Some of these are not recommended to be included in woodland, but can be seen growing in hedgerows, nationwide. "}, {"url": "http://www.woodlandtrust.org.uk/visiting-woods/trees-woods-and-wildlife/british-trees/native-trees/", "passage_text": "Aspen (Populus tremula). Aspen is a deciduous broadleaf tree native to the UK and most of Europe. 1  Beech, common (Fagus sylvatica) Common beech is a large, deciduous tree, native to southern England and South Wales. Elm, wych (Ulmus glabra). Wych elm is a deciduous broadleaf tree native to the UK and much of Europe. 1  Hawthorn, common (Crataegus monogyna) Common hawthorn is a deciduous tree native in the UK and across Europe."}]