[{"url": "http://www.primesteakhouses.com/difference-ribeye-rib-steak.html", "passage_text": "Rib Portion of Beef This fine cut of beef is located at the top of the rib primal portion of the beef and generally comes from the section of beef spanning from ribs six through twelve. Yes, you guessed it. Rib steaks are the same as Prime Rib. When combined as a multiple Rib Roast Section and roasted, it i"}, {"url": "http://www.imamother.com/forum/viewtopic.php?t=194610", "passage_text": "A Delmonico roast is a rib-eye roast (and a Delmonico steak is a rib steak). This recipe, from the picture and description definitely wasn't for a rib roast. The BY cookbook lists brick roast in it's meat chart and says it is a french roast or a square roast (here the butchers call it a square cut chuck roast)."}, {"url": "https://answers.yahoo.com/question/index?qid=1006011102336", "passage_text": "· just now. Report Abuse. Sort of-Delmonico is from the same area as prime rib, but Delmonico is a boneless steak cut from the sirloin whereas prime rib is the roast with ribs attached, typically cooked whole then then servings are carved off."}, {"url": "http://everydaylife.globalpost.com/difference-between-ribeye-steak-standing-rib-roast-21218.html", "passage_text": "Because ribeye steaks come from the same place as a standing rib roast, both cuts contain the same nutrition in a 3-ounce serving -- 166 calories, with 2 grams of saturated fat and 3 grams of monounsaturated fat, 25 grams of protein,1.6 milligrams of iron and 4.7 milligrams of zinc."}, {"url": "http://www.recipetips.com/glossary-term/t--35218/rib-eye-roast-beef.asp", "passage_text": "The rib-eye roast refers to a beef rib roast that has had the 6th through the 12th rib bones removed leaving just the rib-eye muscle. It is tender, flavorful, and expensive. The rib-eye roast is also known as a Delmonico roast."}, {"url": "http://everydaylife.globalpost.com/difference-between-ribeye-steak-standing-rib-roast-21218.html", "passage_text": "Although they both come from the same part of the cow, ribeye steak and a standing rib roast are cooked and eaten in very different ways. Ribeye steak, along with other steaks, is the second most-popular cut of beef served in American homes, with ground beef coming in first."}, {"url": "http://articles.philly.com/2008-10-02/entertainment/24991687_1_prime-rib-rib-roast-steak", "passage_text": "The cut known as rib roast comes in two styles: the standing rib roast, which includes the entire roast with three to seven rib bones; and the rolled rib roast, which is boneless and tied into a tight package."}]