[{"url": "http://www.groweyelashesx.com/permanent-eyelash-extensions/", "passage_text": "Mascara, eyelash extensions, semi-permanent eyelash extensions are all temporary measures to get those beautiful longer eyelashes. And they cost money! But if you are fed up of paying out money frequently to constantly change your eyelashes then try the new popluar method of permanent eyelash extensions. The answer is not only yes but the eyelash is as natural as your own. Once you undergo the operation to have permanent eyelash extension surgery, you know that it is a one off cost. It must be remembered that the cost is quite high, ranging from $800 to $1000, depending on where you go to get it done."}, {"url": "http://www.howmuchisit.org/eyelash-extensions-cost/", "passage_text": "How much does it cost? 1  Depending on the salon and your geographical area, most eyelash extension sessions are going to cost anywhere from as little as $150 to as much as $400. 1 You may require retouch appointments for your eyelash extensions. 2  You will also need some fills. 3  Plan on spending around $40-$85 every 3-4 weeks. 4  Premium and customized lashes can cost an additional $45-$70."}, {"url": "http://www.howmuchisit.org/eyelash-extensions-cost/", "passage_text": "1 Depending on the salon and your geographical area, most eyelash extension sessions are going to cost anywhere from as little as $150 to as much as $400. 2  A full set will cost more than $150 on average, while a half set will cost less than this – usually around $65-$100. 1 You may require retouch appointments for your eyelash extensions. 2  You will also need some fills. 3  Plan on spending around $40-$85 every 3-4 weeks. 4  Premium and customized lashes can cost an additional $45-$70."}, {"url": "http://ezinearticles.com/?Semi-Permanent-Eyelashes---Are-They-Worth-The-Cost?&id=5771157", "passage_text": "Price ranges from $150 to $500 for the initial appointment. An individual lash extension could last anywhere from 4 - 6 weeks. It falls out with your natural eyelash. Of coarse, the quality of glue used is an important factor. Lower quality glues can last only 2 weeks. Alternative to Eyelash Extensions. Semi permanent eyelashes are not the only way to increase length and volume. You might be surprised to learn that many celebrities don't even bother using them anymore. Find out the shocking celebrity secret to grow longer eyelashes in just"}, {"url": "http://www.groweyelashesx.com/permanent-eyelash-extensions/", "passage_text": "For women who have short, thin or brittle eyelashes and who can afford the initial cost of permanent eyelash extension surgery, then this is the best option compared to false eyelashes, mascara and semi-permanent eyelashes. You will literally have permanent long eyelashes 24/7, 365 days a year at no extra cost! The answer is not only yes but the eyelash is as natural as your own. Once you undergo the operation to have permanent eyelash extension surgery, you know that it is a one off cost. It must be remembered that the cost is quite high, ranging from $800 to $1000, depending on where you go to get it done."}, {"url": "https://uk.answers.yahoo.com/question/index?qid=20100520144507AAY4hCL", "passage_text": "HOW much do semi & permanent eyelash extensions cost ?.? Hi ive found a place in plymouth that does semi-permanent ones for £45 for 50 + lashes is this good value? And how much do permanent ones cost? and where can you get them done?. Thankyou xxx. 1 You can only upload photos smaller than 5 MB. 2  You can only upload videos smaller than 600 MB. 3  You can only upload a photo (png, jpg, jpeg) or video (3gp, 3gpp, mp4, mov, avi, mpg, mpeg, rm). 4  You can only upload a photo or video."}, {"url": "http://www.howmuchisit.org/eyelash-extensions-cost/", "passage_text": "1 A full set will cost more than $150 on average, while a half set will cost less than this – usually around $65-$100. 2  However, for those who want to purchase the kits on their own, be prepared to spend $10 to $25 for a kit. 1 You may require retouch appointments for your eyelash extensions. 2  You will also need some fills. 3  Plan on spending around $40-$85 every 3-4 weeks. 4  Premium and customized lashes can cost an additional $45-$70."}]