[{"url": "http://www.ncbi.nlm.nih.gov/pubmedhealth/PMHT0023062/", "passage_text": "Systemic circulation carries oxygenated blood from the left ventricle, through the arteries, to the capillaries in the tissues of the body. From the tissue capillaries, the deoxygenated blood returns through a system of veins to the right atrium of the heart. Systemic circulation is the part of the cardiovascular system which carries oxygenated blood away from the heart to the body, and returns deoxygenated blood back to the heart. PubMed Health Glossary."}, {"url": "http://www.vascularconcepts.com/content/pages.php?pg=patients_cardio_system&page=circulation", "passage_text": "Pulmonary Circulation. The pulmonary circulation carries the blood to and from the lungs. In the heart, the blood flows from the right atrium into the right ventricle; the tricuspid valve prevents backflow from ventricles to atria. Coronary Circulation. The coronary circulation consists of the blood vessels that supply blood to, and remove blood from, the heart. The vessels that supply blood high in oxygen to the heart are known as coronary arteries. The vessels that remove the deoxygenated blood from the heart are known as cardiac veins."}, {"url": "http://www.vascularconcepts.com/content/pages.php?pg=patients_cardio_system&page=circulation", "passage_text": "At the far end of the network, the capillaries converge to form venules, which in turn form veins. The inferior vena cava returns blood to the heart from the legs and trunk; it is supplied by the iliac veins from the legs, the hepatic veins from the liver, and the renal veins from the kidneys. Coronary Circulation. The coronary circulation consists of the blood vessels that supply blood to, and remove blood from, the heart. The vessels that supply blood high in oxygen to the heart are known as coronary arteries. The vessels that remove the deoxygenated blood from the heart are known as cardiac veins."}, {"url": "http://www.oluwoleogunranti.com/course/course1/lesson56a.htm", "passage_text": "2.Rectal anastomoses: This is between the inferior rectal vein, which is a tributary of the internal pudendal vein that drains into the internal iliac vein. The internal iliac vein finds its way into the common iliac vein and the into the inferior vena cava (systemic circulation). The anastomoses connect with the superior rectal vein, which is a tributary of the inferior mesenteric vein that drains into the superior mesenteric vein and then to the portal vein. But there is a communication between the portal circulation and the rest of the systemic circulation in the so-called portocaval anastomoses, because the portal vein joins the inferior vena cava in this circulation. Ordinarily these anastomotic channels are silent, i.e. to say they are not prominent."}, {"url": "http://www.ncbi.nlm.nih.gov/pubmedhealth/PMHT0023062/", "passage_text": "Pulmonary Circulation. The circulation of the blood through the lungs. Pulmonary Veins. The veins that return the oxygenated blood from the lungs to the left atrium of the heart. Superior Vena Cava. The large vein that carries blood from the head, neck, arms, and chest to the heart. Systemic circulation is the part of the cardiovascular system which carries oxygenated blood away from the heart to the body, and returns deoxygenated blood back to the heart. PubMed Health Glossary."}, {"url": "http://www.medicinenet.com/script/main/art.asp?articlekey=5974", "passage_text": "Vena cava: The superior vena cava is the large vein which returns blood to the heart from the head, neck and both upper limbs. The inferior vena cava returns blood to the heart from the lower part of the body. The return of blood via the vena cava can be compromised and cause disease. For example, in the superior vena cava syndrome, the symptoms that result from compression of the large vein that carries blood down to the heart. The superior vena cava is located in the middle of the chest and is surrounded by rigid structures and lymph nodes"}, {"url": "http://courses.washington.edu/conj/heart/heartBasics.htm", "passage_text": "The vessels connected to the heart are: 1  superior vena cava and inferior vena cava return blood to the right atrium. 2  four pulmonary veins return blood from the lungs to the left atrium. 3  pulmonary trunk carries blood to the lungs. 4  aorta carries blood to the systemic circulation. "}, {"url": "https://en.wikipedia.org/wiki/Vena_cava", "passage_text": "(Redirected from Vena cava). The venae cavae (from the Latin for hollow veins, singular vena cava) are large veins (venous trunks) that return deoxygenated blood from the body into the heart. In humans they are called the superior vena cava and the inferior vena cava, and both empty into the right atrium. Origin: 1590–1600; New Latin vena cava (sg), venae cavae (pl), 'hollow vein/veins'. Although the classical Latin pronunciation of venae cavae would be approximately /ˈwɛnaɪˈkɑːvaɪ/ , the standard English medical pronunciation is /ˈviːniːˈkeɪviː/ ."}, {"url": "http://www.ncbi.nlm.nih.gov/pubmedhealth/PMHT0023062/", "passage_text": "Blood Circulation (Systemic Circulation). Systemic circulation is the part of the cardiovascular system which carries oxygenated blood away from the heart to the body, and returns deoxygenated blood back to the heart. PubMed Health Glossary. (Source: Wikipedia). Systemic circulation is the part of the cardiovascular system which carries oxygenated blood away from the heart to the body, and returns deoxygenated blood back to the heart. PubMed Health Glossary"}]