[{"url": "http://ssa.gov/planners/retire/applying1.html", "passage_text": "Retirement Planner: When To Start Your Benefits. You can start your Social Security retirement benefits as early as age 62 or as late as age 70. Your monthly benefit amount will be different depending on the age you start receiving it."}, {"url": "http://retireplan.about.com/od/socialsecurity/f/When-Can-I-Start-Receiving-Social-Security-Benefits.htm", "passage_text": "If you start receiving Social Security at age 62, your monthly benefits will be reduced accordingly--by as much as 30%. They increase with each year as you approach full retirement age, at which point you will receive full benefits."}, {"url": "http://www.nbcnews.com/id/15240918/ns/business-answer_desk/t/start-collecting-social-security-or-wait/", "passage_text": "For those born between 1943 and 1954, for example, you can start collecting benefits at age 62, but you’ll only get 75 percent of what you’d get if you wait until you’re 66. If you wait until 67, you get 108 percent of your monthly benefit."}, {"url": "http://www.aarp.org/work/social-security/info-11-2013/when-to-start-social-security-benefits.html", "passage_text": "If you choose to start benefits early, Social Security will use your FRA to compute the reduction in the monthly amount. For instance, if you're due $1,000 a month at full retirement age, you would get only $750 a month at 62, a 25 percent drop."}, {"url": "http://www.aarp.org/work/social-security/info-08-2010/10-things-you-need-to-know-about-social-security.html", "passage_text": "Workers can begin receiving benefits at age 62, but your benefit will be greater if you wait until your full retirement age (currently 66) or later. Widows, widowers, surviving children, the disabled and children of the disabled can start collecting earlier."}, {"url": "https://www.mutualfundstore.com/social-security-benefits-retirement-age", "passage_text": "Social Security Benefits Age. You can start receiving Social Security benefits at age 62 but, here's the catch: you'll collect less benefits at age 62 than if you wait until the full retirement age that ranges between 66 (for those born between 1943 and 1954) and 67 (for those born 1960 and later)."}, {"url": "http://www.interest.com/retirement-planning/news/6-step-guide-when-to-start-collecting-social-security/", "passage_text": "You need to know how much your retirement benefits will be and when, exactly, you'll reach what the Social Security Administration (SSA) considers full retirement age, the age at which you can receive those benefits without penalty."}, {"url": "http://socialsecurity.findlaw.com/social-security-basics/when-should-you-start-claiming-social-security-benefits.html", "passage_text": "Between your full retirement age (see chart above), and the age of 70, your Social Security benefits will increase between 3 and 8 percent each year you delay your retirement. For example, for anyone born 1943 and later, their retirement benefits will increase by 8% for each year they delay until the age of 70."}, {"url": "http://retireplan.about.com/od/socialsecurity/f/When-Can-I-Start-Receiving-Social-Security-Benefits.htm", "passage_text": "You can start as early as age 62 and as late as age 70. But you are entitled to full benefits when you reach normal retirement age or full retirement age according to the Social Security Administration. For anyone born after 1937, full retirement age is between 65 and 67 years old, depending on when you were born."}]