[{"url": "http://medical-dictionary.thefreedictionary.com/psoriasis", "passage_text": "Plaque psoriasis (psoriasis vulgaris), the most common form of the disease, is characterized by small, red bumps that enlarge, become inflamed, and form scales. The top scales flake off easily and often, but those beneath the surface of the skin clump together."}, {"url": "http://www.mayoclinic.org/diseases-conditions/psoriasis/basics/definition/CON-20030838", "passage_text": "Psoriasis is a common skin condition that changes the life cycle of skin cells. Psoriasis causes cells to build up rapidly on the surface of the skin. The extra skin cells form thick, silvery scales and itchy, dry, red patches that are sometimes painful."}, {"url": "http://www.audioenglish.org/dictionary/psoriasis.htm", "passage_text": "The noun PSORIASIS has 1 sense: 1. a chronic skin disease characterized by dry red patches covered with scales; occurs especially on the scalp and ears and genitalia and the skin over bony prominences. Familiarity information: PSORIASIS used as a noun is very rare."}, {"url": "http://www.healthline.com/health/psoriasis", "passage_text": "Psoriasis is a common skin condition that can affect anyone, although it's more common in people between the ages of 15 and 35, according to the National Psoriasis Foundation. If you have psoriasis, your skin cells grow faster than normal."}, {"url": "https://www.psoriasis.org/about-psoriasis", "passage_text": "Plaque Psoriasis. Plaque psoriasis is the most common form of the disease and appears as raised, red patches covered with a silvery white buildup of dead skin cells. These patches or plaques most often show up on the scalp, knees, elbows and lower back. They are often itchy and painful, and they can crack and bleed."}, {"url": "https://www.psoriasis.org/about-psoriasis", "passage_text": "Plaque psoriasis is the most common form of the disease and appears as raised, red patches covered with a silvery white buildup of dead skin cells. These patches or plaques most often show up on the scalp, knees, elbows and lower back. They are often itchy and painful, and they can crack and bleed."}, {"url": "http://www.audioenglish.org/dictionary/psoriasis.htm", "passage_text": "• PSORIASIS (noun). The noun PSORIASIS has 1 sense: 1. a chronic skin disease characterized by dry red patches covered with scales; occurs especially on the scalp and ears and genitalia and the skin over bony prominences. Familiarity information: PSORIASIS used as a noun is very rare."}]