[{"url": "https://en.wikipedia.org/wiki/Takoyaki", "passage_text": "Takoyaki was first popularized in Osaka, where a street vendor named Tomekichi Endo is credited with its invention in 1935. Takoyaki was inspired by akashiyaki, a small round dumpling from the city of Akashi in Hyōgo Prefecture made of an egg-rich batter and octopus. Takoyaki was initially popular in the Kansai region, and later spread to the Kantō region and other areas of Japan. Takoyaki is associated with yatai street food stalls, and there are many well-established takoyaki specialty restaurants, particularly in the Kansai region"}, {"url": "http://www.japanesecooking101.com/takoyaki-recipe/", "passage_text": "Takoyaki is a very casual fast food in Japan. It might not be easily found at Japanese restaurants in the US or other parts of world even though it is a very popular dish. Takoyaki tastes a little bit like round shaped Okonomiyaki, but it has a much different flavor from the Tako (octopus) cooked inside them. 1 Heat a Takoyaki pan with oil to very hot, just until the oil begins to smoke. 2  Use enough oil to coat the pan using a paper towel so that the batter won't stick. 3  Then pour batter to fill the holes of the pan. 4  Drop octopus pieces in the batter in each hole, and sprinkle chopped green onions and ginger all over the pan."}, {"url": "http://pogogi.com/what-is-takoyaki/", "passage_text": "Making Takoyaki requires a special, cast-iron pan with half spherical molds. The half spheres in a Takoyaki pan is what makes it possible to give this snack food its round shape. There are a number of different recipes for making Takoyaki and you can even find some video demonstrations on YouTube. It is usually served with a sauce that is similar to Worcestershire sauce and mayonnaise. The creation of Takoyaki dates back to 1935 and its creation is credited to a street vendor named Tomekichi Endo."}, {"url": "http://www.definitions.net/definition/Takoyaki", "passage_text": "Takoyaki. Takoyaki is a ball-shaped Japanese snack made of a wheat flour-based batter and cooked in a special takoyaki pan. It is typically filled with minced or diced octopus, tempura scraps, pickled ginger, and green onion. Takoyaki are brushed with takoyaki sauce, similar to Worcestershire sauce, and mayonnaise. The takoyaki is then sprinkled with green laver and shavings of dried bonito. There are many variations to the takoyaki recipe, for example, ponzu, goma-dare or vinegared dashi."}, {"url": "http://pogogi.com/what-is-takoyaki/", "passage_text": "Takoyaki is a Japanese snack that is in the shape of little round balls. It is made with a batter that has a wheat flour base and is commonly filled with minced octopus, scraps of tempura, green onions, and pickled ginger. It is usually served with a sauce that is similar to Worcestershire sauce and mayonnaise. The creation of Takoyaki dates back to 1935 and its creation is credited to a street vendor named Tomekichi Endo."}, {"url": "http://japanesefood.about.com/od/seafoodfish/r/takoyaki.htm", "passage_text": "Thickness of the batter should be like potage soup. Preheat a takoyaki pan and grease the molds. Pour batter into the molds to the full. Put octopus, red ginger, green onion, and dried red shrimp in each mold. Grill takoyaki balls, flipping with a pick to make balls. When browned, remove takoyaki from the pan and place on a plate. Put sauce and mayonnaise on top and sprinkle bonito flakes and aonori over"}, {"url": "http://www.justhungry.com/takoyaki", "passage_text": "Takoyaki is the small, round cousin of okonomiyaki, and like okonomiyaki it originated in Osaka. It's basically a flavored batter with a tiny piece of octopus (tako) inside, and is a quintessential street food snack. Re: Takoyaki, the great street snack that's fun to make at ... Each takoyaki is about 1 inch (2.5cm or so) in diameter, give or take a half inch or so. In the pan here they are about that size, and each one needs about 1 1/2 tablespoons of batter."}, {"url": "http://iamafoodblog.com/takoyaki-recipe/", "passage_text": "Takoyaki literally translated means octopus fried, but takoyaki isn’t just fried octopus – it’s a tiny, piping hot ball of batter filled with green onions, ginger, crispy tempura bits and octopus. It’s crisp, it’s gooey, it’s delicious. Takoyaki is one of Osaka’s quintessential street foods. Takoyaki need quite a few ingredients and a specialized pan, but I think it’s worth it. You can find a takoyaki pan on amazon.com or you can use an ebelskiver (Danish pancake) pan. As for the insides, octopus is classic, but feel free to put in shrimp, chicken, or whatever savoury filling you like."}, {"url": "https://en.wikipedia.org/wiki/Takoyaki", "passage_text": "It is typically filled with minced or diced octopus (tako), tempura scraps (tenkasu), pickled ginger, and green onion. Takoyaki are brushed with takoyaki sauce (similar to Worcestershire sauce) and mayonnaise, and then sprinkled with green laver (aonori) and shavings of dried bonito (katsuobushi). Takoyaki was inspired by akashiyaki, a small round dumpling from the city of Akashi in Hyōgo Prefecture made of an egg-rich batter and octopus. Takoyaki was initially popular in the Kansai region, and later spread to the Kantō region and other areas of Japan."}, {"url": "https://simple.wikipedia.org/wiki/Takoyaki", "passage_text": "Takoyaki (たこ焼き or 蛸焼, literally fried or grilled octopus) is a popular ball-shaped Japanese dumpling. It is like a savory pancake in a ball-shape which is cooked in a special pan. Takoyaki is a specialty of Osaka and Kyoto. It is usually eaten as a snack. "}]