[{"url": "http://www.justanswer.com/pet-dog/0ewrn-long-does-poodle-stay-swollen-first-go-heat.html", "passage_text": "Usually your dog will go into heat every 6-7 months though again each dog is different and can go back into heat as early as 4 months or not for 12 months. Most however are average. During the first part of a dogs heat period you will notice swelling of the vulva, possibly an increase in urination and bleeding. This stage generally last about 7 days and she will not allow males to mate with her during this period The second part of the heat cycle is when she will accept a male and breed. This can last from 4 to 21 days though the average is 7 days."}, {"url": "http://en.allexperts.com/q/Poodles-2529/Poodle-heat-1.htm", "passage_text": "Answer. Hi Stephanie :-). The average heat cycle for a dog is approximately 3 weeks and since this an an average, some heats are shorter (as little as 7-10 days), others are longer (4 weeks or more). Average times between heat periods is seven months but some dogs can cycle as early as every 4 months, some once a year. "}, {"url": "http://www.allpoodleinfo.com/breeding-poodles", "passage_text": "The optimal time to pair Poodles is 11 days after the female’s heat cycle begins; though can range from day 7 to day 14 and in rare cases, even beyond that. Most breeders pair the dogs every other day, for 1 week. This allows the sire to recoup and allow the sperm count to come back up. "}, {"url": "https://answers.yahoo.com/question/index?qid=20100402202043AAq3KMq", "passage_text": "If your dog is a standard poodle, then have her spayed at 8-9 months. 8 months to be sure you don't wait too long. Just don't forget! If she has a heat cycle, her risk of mammary cancer increases quite a bit. I heard larger breeds go into heat later than smaller breeds. My standard poodle's mom got into heat at 10 months well a doberman I know just recently got into heat at 11 months. I want to spay my dog but I want her to grow as much as possible before getting her spayed"}, {"url": "http://www.allpoodleinfo.com/poodle-heat-cycle", "passage_text": "All dogs are different, but on average a Poodle heat cycle will last for 3 weeks. The first cycle is not a good indication of how future cycles will be. Once a dog matures and reaches the age of 2 years old, the cycles will begin to become more regular and last for roughly the same amount of time for each one. A canine will enter heat 2 times per year."}, {"url": "http://www.allpoodleinfo.com/poodle-heat-cycle", "passage_text": "In general, the smaller the dog, the earlier the first heat will occur. Toy Poodles and Miniatures have their first heat between 4 and 7 months old. Standard Poodles have their first heat between 7 and 15 months old. There are late bloomers, however it is rare for a Toy or Mini to go beyond 8 months or a Standard to go beyond 2 years without entering into a heat season. If your female Poodle is not yet spayed and has not had signs of heat by this age, you will want to bring this to the attention of the veterinarian. The first cycle is not a good indication of how future cycles will be. Once a dog matures and reaches the age of 2 years old, the cycles will begin to become more regular and last for roughly the same amount of time for each one. A canine will enter heat 2 times per year."}, {"url": "https://answers.yahoo.com/question/index?qid=20100402202043AAq3KMq", "passage_text": "Rating Newest Oldest. If your dog is a standard poodle, then have her spayed at 8-9 months. 8 months to be sure you don't wait too long. Just don't forget! If she has a heat cycle, her risk of mammary cancer increases quite a bit. Larger breed dogs do have their first heat later than small breeds. I heard larger breeds go into heat later than smaller breeds. My standard poodle's mom got into heat at 10 months well a doberman I know just recently got into heat at 11 months. I want to spay my dog but I want her to grow as much as possible before getting her spayed"}, {"url": "http://www.ehow.com/how_8547956_poodles-breed.html", "passage_text": "Determine when your female poodle is in heat. Heat cycles vary with every poodle. Typically, most poodles have their first heat cycle between 4 months of age to a year. Heat cycles tend to last three weeks. Symptoms of heat include a swollen vulva, restlessness and increased urination. Blood spotting is also evident. Toy and miniature poodles have lighter spotting than standard poodles. Spotting is an indication that your female poodle is entering into the first week of its heat cycle. Your poodle is most fertile during the first week. However, your poodle will most likely ward off any advances from the stud."}, {"url": "http://en.allexperts.com/q/Poodles-2529/2009/6/First-heat-cycle.htm", "passage_text": "I have a healthy 15 month old Standard Poodle and she hasn't had her first heat yet. From what I've read she should have come into heat at 9 to 12 months. I wanted to breed her on her second heat but now I'm wondering if there is something wrong with her. "}]