[{"url": "https://ahdc.vet.cornell.edu/sects/Paras/tests/occulthw.cfm", "passage_text": "The Synbiotics DiroCHEK heartworm test is an indirect enzyme-linked immunosorbent assay (ELISA) used for the detection of adult female Dirofilaria immitis antigen in canine and feline serum or plasma. This test is validated for use in dogs and cats only."}, {"url": "http://www.petplace.com/article/dogs/diseases-conditions-of-dogs/tests-procedures/heartworm-test-in-dogs", "passage_text": "This is referred to as occult, or hidden, heartworm infection. Heartworm infections may be occult for a number of reasons: A heartworm test is to check for the evidence of the parasite Dirofilaria immitis, more commonly known as heartworm, in your dog's bloodstream."}, {"url": "http://www.vet.purdue.edu/vth/sacp/documents/Heartwormdiseae.pdf", "passage_text": "This test is not used in dogs because the occult and microfilarial tests are inexpensive and reliable. ways to determine if a heartworm infection is present. However, this is the preferred test in cats, because. the other methods are not sensitive enough to determine if heartworm disease is present in cats."}, {"url": "http://www.goldstockfund.org/edu/health_heartworm.html", "passage_text": "These are another type of microfilaria, not heartworm. They are harmless. The Occult heartworm test tests for the presence in the dog's blood of antigens of adult heartworms. This is generally considered the more reliable test, but it is more expensive and many vets must send blood samples to outside labs for this test."}, {"url": "http://www.pethealthandcare.com/dog-care/heartworm-test-for-dogs.html", "passage_text": "A heartworm test for dogs is helpful in detection of the parasites known as dirofilaria immitis, commonly referred to as heartworm. This parasite is detected in the bloodstream of dogs and is known to cause symptoms such as weight loss, appetite loss, coughing, breathing difficulties and heart disease."}, {"url": "http://www.goldstockfund.org/edu/health_heartworm.html", "passage_text": "Heartworm treated dogs should receive an Occult test about 9-12 months after treatment. Any sooner than that is useless because the dog may still be carrying antigens from the pre-treatment heartworms. About 9-12 months following treatment, most treated dogs should be testing Occult negative."}, {"url": "http://www.vet.purdue.edu/vth/sacp/documents/Heartwormdiseae.pdf", "passage_text": "If a dog has a positive occult test, it has adult heartworms in its heart and/or pulmonary arteries. If a dog has a negative occult test, it does not have adult heartworms. Cats, on the other hand, rarely have greater than 6 worms, and the worms are much more likely to be immature or only male in cats."}]