[{"url": "http://www.echeat.com/free-essay/DNA-Replication-27381.aspx", "passage_text": "Adenine will only bond with Thymine, and Cytosine with only Guanine. The double helix is antiparallel, meaning each strand runs in a different direction. The first step to DNA replication is the unwinding of the double helix with the help of an enyme called helicase. Once unwound, the DNA unzips and the bonded nucleotides are separated. In the next stage, an enzyme called DNA polymerase is important. "}, {"url": "https://en.wikipedia.org/wiki/DNA_replication", "passage_text": "DNA is made up of two strands and each strand of the original DNA molecule serves as a template for the production of the complementary strand, a process referred to as semiconservative replication. Cellular proofreading and error-checking mechanisms ensure near perfect fidelity for DNA replication. DNA usually exists as a double-stranded structure, with both strands coiled together to form the characteristic double-helix. Each single strand of DNA is a chain of four types of nucleotides. Nucleotides in DNA contain a deoxyribose sugar, a phosphate, and a nucleobase."}, {"url": "https://en.wikipedia.org/wiki/DNA_replication", "passage_text": "DNA replication is the process of producing two identical replicas from one original DNA molecule. This biological process occurs in all living organisms and is the basis for biological inheritance. DNA usually exists as a double-stranded structure, with both strands coiled together to form the characteristic double-helix. Each single strand of DNA is a chain of four types of nucleotides. Nucleotides in DNA contain a deoxyribose sugar, a phosphate, and a nucleobase."}, {"url": "https://en.wikibooks.org/wiki/Structural_Biochemistry/Nucleic_Acid/DNA/Replication_Process", "passage_text": "In DNA replication, the DNA is first divided into two daughter strands in the genome, which carries the exact genetic information as the original cell. This starting point of the strand being separated is called the origin. In initiation, many replication proteins called initiators convert the DNA into a replication fork. This is accomplished first by the initiator proteins assembling around the DNA which causes melting of the dsDNA (double stranded DNA) origin."}, {"url": "https://answers.yahoo.com/question/index?qid=20110130182200AAVfZvX", "passage_text": "Rating Newest Oldest. Best Answer: The most widespread example of DNA replication in the real world is your zipper. It divides into two strands on unwinding and forms replication fork just like DNA does. And the same unwinded strands can be incorporated into the daughter DNA molecules and thus becomes semiconservative in nature. Source(s): . "}, {"url": "https://en.wikibooks.org/wiki/Structural_Biochemistry/Nucleic_Acid/DNA/Replication_Process", "passage_text": "When DNA is being replicated, it forms a replication fork that was created during the helicase process that separates the DNA strand. The strands that are separated are called the leading strand and the lagging strand accordingly. The leading strand is synthesized in the 5'-3' direction. In initiation, many replication proteins called initiators convert the DNA into a replication fork. This is accomplished first by the initiator proteins assembling around the DNA which causes melting of the dsDNA (double stranded DNA) origin."}, {"url": "http://www.yourgenome.org/facts/what-is-dna-replication", "passage_text": "1 The separation of the two single strands of DNA creates a ‘Y’ shape called a replication ‘fork’. 2  The two separated strands will act as templates for making the new strands of DNA. 3  One of the strands is oriented in the 3’ to 5’ direction (towards the replication fork), this is the leading strand. 1 This sort of replication is called continuous. 2  Lagging strand: 3  Numerous RNA primers are made by the primase enzyme and bind at various points along the lagging strand. 4  Chunks of DNA, called Okazaki fragments, are then added to the lagging strand also in the 5’ to 3’ direction."}, {"url": "https://en.wikipedia.org/wiki/DNA_replication", "passage_text": "Unwinding of DNA at the origin and synthesis of new strands results in replication forks growing bidirectional from the origin. A number of proteins are associated with the replication fork which helps in terms of the initiation and continuation of DNA synthesis. DNA usually exists as a double-stranded structure, with both strands coiled together to form the characteristic double-helix. Each single strand of DNA is a chain of four types of nucleotides. Nucleotides in DNA contain a deoxyribose sugar, a phosphate, and a nucleobase."}, {"url": "http://www.sparknotes.com/biology/molecular/dnareplicationandrepair/problems_1.html", "passage_text": "DNA replication occurs in the 5' to 3' direction because 3' to 5' replication is chemically impossible. Explain your answer. Lagging strand synthesis is more complex because of the requirement for DNA replication to take place in the 5' to 3' direction. Since parent strands are oriented in an anti-parallel fashion, one strand is oriented in the 5' to 3' direction, while the other strand is oriented in the 3' to 5' direction. While DNA replication does occur in the 5' to 3' direction, the reason is not because 3' to 5' replication is chemically impossible. 3' to 5' replication can in principle occur. The 3' OH of the incoming nucleotide instead of the nucleotide attached to the end of the growing chain would be the attacking group."}]