[{"url": "http://www.nhlbi.nih.gov/health/health-topics/topics/cf/causes", "passage_text": "A defect in the CFTR gene causes cystic fibrosis (CF). This gene makes a protein that controls the movement of salt and water in and out of your body's cells. In people who have CF, the gene makes a protein that doesn't work well."}, {"url": "http://learn.genetics.utah.edu/content/disorders/singlegene/cf/", "passage_text": "People with cystic fibrosis inherit a defective gene on chromosome 7 called CFTR (cystic fibrosis transmembrane conductance regulator). The protein produced by this gene normally helps salt (sodium chloride) move in and out of cells."}, {"url": "http://www.mayoclinic.org/diseases-conditions/cystic-fibrosis/basics/causes/CON-20013731", "passage_text": "Causes. In cystic fibrosis, a defect (mutation) in a gene changes a protein that regulates the movement of salt in and out of cells. The result is thick, sticky mucus in the respiratory, digestive and reproductive systems, as well as increased salt in sweat. Many different defects can occur in the gene."}, {"url": "http://cystic-fibrosis.emedtv.com/cystic-fibrosis/cystic-fibrosis-gene.html", "passage_text": "The cause of cystic fibrosis (CF) is a defect in the cystic fibrosis transmembrane conductance regulator (CFTR) gene. This gene for cystic fibrosis makes a protein that controls the movement of salt and water in and out of your cells. In people with cystic fibrosis, the gene does not work effectively. As a result, cells that line the passageways of the lungs, pancreas, and other organs produce abnormally thick, sticky mucus. This mucus obstructs the airways and glands, which causes the characteristic signs and symptoms of cystic fibrosis."}, {"url": "http://ghr.nlm.nih.gov/gene/CFTR", "passage_text": "The CFTR gene provides instructions for making a protein called the cystic fibrosis transmembrane conductance regulator. This protein functions as a channel across the membrane of cells that produce mucus, sweat, saliva, tears, and digestive enzymes."}]