[{"url": "http://www.mademan.com/mm/10-best-famous-british-actors.html", "passage_text": "Facebook Twitter Stumble Google+ Save. There have been many famous British actors to come to Hollywood and make a name for themselves, so here's a comprehensive list of the 10 best famous British actors. With movie franchises like “James Bond” and “Harry Potter,” many of these British actors have taken their place as Hollywood stars. 1  Daniel Day-Lewis"}, {"url": "http://www.thetoptens.com/most-famous-michaels/", "passage_text": "All of these made him so well-known in every corner of our world. MICHAEL JACKSON IS AND ALWAYS WILL BE THE WORLD'S MOST FAMOUS MICHAEL. WHETHER YOU LIKE HIM OR NOT AND WHETHER YOU LIKE HIS MUSIC OR NOT, THAT'S A FACT AND IT WILL REMAIN THAT WAY LONG, LONG AFTER ALL OF US ARE DEAD AND GONE. 7 1 2 3 4 9. Top Ten Most Famous People South America's Most Famous People Top Ten Most Famous People With the Name David Top Ten Famous People You'd Want to Meet Top Ten Famous People Who Should Try Out TheTopTens."}, {"url": "http://adventurepaul.com/the-name-paul-and-famous-people-named-paul/", "passage_text": "I love my name, Paul. I was named after my Great Uncle Paul Barnett who was first cousins with Paul Black, the man holding me in the picture below. This picture, taken in 1984, is of the Oldest and Youngest Pauls in our family at the time (Paul Black and Baby Adventure Paul)."}, {"url": "http://www.ranker.com/list/famous-people-named-michael/reference", "passage_text": "How many celebrities named Michael can you think of? The famous Mikes and Michaels below have many different professions, as this list includes notable actors named Michael, athletes named Michael, and even political figures named Michael. Did we forget your favorite famous person whose name is Michael? Add them to the list. Michael Jackson is certainly one of the most famous Michaels on this list. He started singing professionally at the age of 6 with the Jackson Five. About 5-6 years later, he went solo and became one of the most famous musicians of all time. His album Thriller remains the best selling album of all time."}, {"url": "http://www.thetoptens.com/most-famous-michaels/", "passage_text": "Michael Jordan is the most legendary basketball player. He should be number 2 and Michael jackson stays at 1. Michael Jackson was last famous in 2009. 7 1 2 3 4 9. Top Ten Most Famous People South America's Most Famous People Top Ten Most Famous People With the Name David Top Ten Famous People You'd Want to Meet Top Ten Famous People Who Should Try Out TheTopTens."}, {"url": "http://www.mademan.com/mm/10-famous-male-actors-80s.html", "passage_text": "1 Robert De Niro. 2  Although he is on the famous male actors from the '80s list he is much more famous than that. 3  Starting with The Godfather in the '70s De Niro has portrayed each role with individuality. 4  Michael Douglas. 1 Although he is on the famous male actors from the '80s list he is much more famous than that. 2  Starting with The Godfather in the '70s De Niro has portrayed each role with individuality. 3"}, {"url": "http://www.behindthename.com/name/michael/comments", "passage_text": "Some famous Michaels: Michael Douglas, Michael Caine, Michael Moore, Michael Mike Meyers, Michael Savage, Chad Michael Murray, Michael Clarke Duncan, Michael Keaton, and Michael Gambon. All are actors except Michael Moore, who is a movie director, and Michael Savage, who is an author and talk radio host. "}]