[{"url": "http://www.101cookingfortwo.com/how-to-grill-t-bone-or-porterhouse/", "passage_text": "If you are into cross grill marks, rotate 90 degrees at 2 1/2 minutes. After the 5 minutes then flip. Cook on the second side for about 3 minutes for rare, 4 for medium rare and 5 for medium. We generally like our meat at about 150. 1 Place over direct heat. 2  In five minutes (by the clock) flip the meat. 3  If your are into crossed grill marks, you should have rotated the meat 90 degrees at about 2½ minues. 4  Grill for approximately 3 more minutes for rare, 4 more minutes for medium-rare and 5 minutes for medium (150)."}, {"url": "http://www.seriouseats.com/2014/05/how-to-grill-t-bone-steak.html", "passage_text": "When looking for the perfect T-bone for grilling, there are a few important things you'll want to look for: A great grilled T-bone takes some attention to detail, but the payoff is a big, beefy steak that's hard to beat. [Photographs: Joshua Bousel]. When it comes to steak, I'm an economy cuts man. "}, {"url": "http://www.grillingcompanion.com/recipe/t-bone-steak/", "passage_text": "Place the steak on the hottest part of the grill (on the grate, of course). Grill until you get a good sear. This depends on your grill, but probably about 2 to 3 minutes. If you get any flare ups that last for longer than a few seconds, move the steak to a different part of the hot grill until the fire dies down. Flip it, grill for 2 minutes then check your temp. Remove at 125° F to 130° F for medium rare. Remove the steak from the refrigerator and let it warm up towards room temp. About 20 minutes while you prep the grill. This will let you get a good sear on the steak and get the inside cooked just perfect. Trim any excess fat from the outside edge of the steak."}, {"url": "http://www.foodnetwork.com/recipes/food-network-kitchens/pan-seared-t-bone-steak-recipe.html", "passage_text": "Reduce heat slightly and cook steak until browned, about 4 minutes on each side. Transfer skillet to the oven. Roast until an instant-read thermometer inserted sideways into the steak registers 120 degrees F for medium-rare, about 6 to 8 minutes. Transfer steak to a cutting board and let it rest for 10 minutes. "}, {"url": "http://www.livestrong.com/article/434388-how-to-grill-a-1-inch-t-bone-steak/", "passage_text": "Step 2. Move your T-bones to the medium heat side of your grill and continue grilling. If you like your T-bone medium rare, grill for four to five minutes on each side or until a meat thermometer reads 130 to 140 degrees Fahrenheit. For a medium steak, grill six to seven minutes per side or until a meat thermometer reads 140 to 150 degrees. Timing and technique are the keys to grilling a 1-inch-thick T-bone steak to perfection. This thicker cut requires different treatment from a T-bone, for example, 1/2- to 3/4-inch thick."}, {"url": "https://www.heb.com/recipe/recipe-article/grill-times-temperatures-for-steak/1392677044707", "passage_text": "Remove steaks from the grill when a quick-response meat thermometer inserted through the side of the steak to its center reads the desired temperature below. To retain juices and reach final temperature, let steaks sit for 2 minutes before cutting. "}, {"url": "http://www.101cookingfortwo.com/how-to-grill-t-bone-or-porterhouse/", "passage_text": "Place over direct heat. In five minutes (by the clock) flip the meat. If you’re into crossed grill marks, you should have rotated the meat 90 degrees at about 2 1/2 minutes. Grill for approximately 3 more minutes for rare, 4 more minutes for medium-rare and 5 minutes for medium (150). Your timing will vary a little so as always, check the temperature. 1 Place over direct heat. 2  In five minutes (by the clock) flip the meat. 3  If your are into crossed grill marks, you should have rotated the meat 90 degrees at about 2½ minues. 4 "}, {"url": "http://www.wikihow.com/Cook-a-T-Bone-Steak", "passage_text": "3. Grill your steak. Place the steak in the hottest part of the grill, usually the middle. For rare, cook it for 2 minutes on each side and then move it to the cooler part of the grill, usually the edges, for another 6-8 minutes, flipping occasionally. For medium rare add 1-3 minutes and for medium add 3-5 minutes to the total cooking time. 4. Let your steak sit for a few minutes before serving"}, {"url": "http://www.livestrong.com/article/434388-how-to-grill-a-1-inch-t-bone-steak/", "passage_text": "Preheat your grill using two temperature settings. If you are using a gas grill, set one side to high and the other to a medium setting, then close the lid for 10 to 15 minutes. Timing and technique are the keys to grilling a 1-inch-thick T-bone steak to perfection. This thicker cut requires different treatment from a T-bone, for example, 1/2- to 3/4-inch thick."}, {"url": "http://www.epicurious.com/recipes/food/views/grilled-t-bone-steaks-232163", "passage_text": "1 Grill steaks on lightly oiled grill rack, covered only if using a gas grill, turning over once, until thermometer inserted horizontally 2 inches into meat (do not touch bone) registers about 120°F for rare, 9 to 11 minutes. 2  Transfer steaks to a cutting board and let stand, uncovered, 10 minutes before slicing. 1 Pat steaks dry and sprinkle all over with sea salt and pepper. 2 "}]