[{"url": "http://www.tablespoon.com/posts/how-to-sweeten-with-maple-syrup/6dfa0e81-4197-4bdf-8d78-bbfc56257701#!", "passage_text": "To substitute maple syrup for honey in a recipe, use 3/4 cup of maple syrup and 1/2 cup sugar for every 1 cup of honey. You can replace molasses with maple syrup in a one-to-one ratio. In each case, both the taste and texture will be affected by the substitution."}, {"url": "http://healthyeating.sfgate.com/nutrition-pure-maple-syrup-vs-honey-1756.html", "passage_text": "A tablespoon of pure maple syrup contains about 13.5 grams of carbohydrates. Of those, 12.4 grams are from sugars. These sugars are primarily from sucrose, which is a complex sugar that your body breaks down to the simple sugars fructose and glucose at a one-to-one ratio."}, {"url": "http://www.tablespoon.com/posts/how-to-sweeten-with-maple-syrup/6dfa0e81-4197-4bdf-8d78-bbfc56257701#!", "passage_text": "To substitute maple syrup for sugar in other types of cooking, use three quarters of maple syrup as the sugar called for. Keep in mind that maple syrup is not as sweet as white sugar and therefore this substitution formula will likely yield a less sweet result than the original recipe."}, {"url": "http://www.livestrong.com/article/412144-nutrition-of-pure-maple-syrup-vs-honey/", "passage_text": "The sugars in maple syrup are primarily in the form of the sucrose, with some glucose and fructose. In honey, the sugars are primarily in the form of fructose and glucose with some sucrose. Sucrose is a complex sugar that breaks down into the simple sugars fructose and glucose."}, {"url": "http://healthyeating.sfgate.com/nutrition-pure-maple-syrup-vs-honey-1756.html", "passage_text": "Fat. The fat in a tablespoon of pure maple syrup is 0.1 grams, with minute amounts of saturated, monounsaturated and polyunsaturated fats. Honey does not contain fat, and thus, contains none of the three subcategories of fat."}, {"url": "http://www.livestrong.com/article/412144-nutrition-of-pure-maple-syrup-vs-honey/", "passage_text": "Honey contains more vitamins than maple syrup. Honey is a significant source of vitamin C, of which maple syrup has none. Honey also has vitamin B6, niacin and folate, while maple syrup does not, and contains four times more riboflavin. Maple syrup does, however, contain thiamin, which honey does not."}, {"url": "http://got2run4me.com/2012/09/24/is-maple-syrup-sweeter-than-honey/", "passage_text": "I use honey and maple syrup to sweeten recipes usually. I like my sweetener to come in its original form. The other good thing about using maple syrup on pancakes is that it's so sweet and thick that I don't use too much."}, {"url": "http://www.discovergoodnutrition.com/2011/08/honey-maple-syrup-or-agave-all-sugars-are-pretty-much-the-same/", "passage_text": "•Agave syrup is produced from the sap of the agave – a succulent plant related to cactus. Agave syrup has a very sweet, but mild flavor. Like maple syrup and honey, it undergoes minimal processing at low temperatures to remove excess water."}, {"url": "http://www.biotrust.com/honey-vs-pure-maple-syrup/", "passage_text": "For instance, per tablespoon, honey has 23% more calories than pure maple syrup. Even more, honey contains 40% more sugar than pure maple syrup! While the two are often compared or thought of as equally healthy choices, it's pretty clear that they are anything but."}]