[{"url": "http://www.entnet.org/content/what-otolaryngologist", "passage_text": "Otolaryngology (pronounced oh/toe/lair/in/goll/oh/jee) is the oldest medical specialty in the United States. Otolaryngologists are physicians trained in the medical and surgical management and treatment of patients with diseases and disorders of the ear, nose, throat (ENT), and related structures of the head and neck. They are commonly referred to as ENT physicians. They are trained in both the medical and surgical treatment of hearing loss, ear infections, balance disorders, ear noise (tinnitus), and some cranial nerve disorders. Otolaryngologists also manage congenital (birth) disorders of the outer and inner ear."}, {"url": "https://answers.yahoo.com/question/index?qid=20081208142636AAdNjEf", "passage_text": "Rating Newest Oldest. Best Answer: Otolaryngology = ear nose and throat infections, etc. Ear doctor is Audiologist but they treat actual hearing and balance problems -- Audiologists are trained to diagnose, manage and/or treat hearing or balance problems. They dispense hearing aids and recommend and map cochlear implants. "}, {"url": "https://en.wikipedia.org/wiki/Otolaryngology", "passage_text": "Doctors who specialize in this area are called otorhinolaryngologists, otolaryngologists, ENT doctors, ENT surgeons, or head and neck surgeons. Patients seek treatment from an otorhinolaryngologist for diseases of the ear, nose, or throat and for the management of cancers of the head and neck. A 40-watt CO 2 laser used in otorhinolaryngology. Royal National Throat, Nose and Ear Hospital founded in 1874, in London. Otorhinolaryngology (Otolaryngology) is the area of medicine that deals with disorders and conditions of the ear, nose, and throat (ENT) region, and related areas of the head and neck."}, {"url": "http://www.nchearingloss.org/otolary.htm", "passage_text": "A doctor who specializes in problems of the ear, nose and throat are normally called an ENT or an Otolaryngologist. If the doctor has additional training in the medical and surgical management of dizziness,hearing loss, and tumors of the ear they may be called an Otologist. Types of Ear Doctors"}, {"url": "http://www.everydayhealth.com/ear-nose-throat/specialist.aspx", "passage_text": "If you have a problem that is related to your ear, nose, or throat, you may need to see an ENT specialist, who is also called an ear, nose, and throat doctor or an otolaryngologist. Among the conditions that are commonly treated by an ear, nose, and throat doctor are: 1  Injury to your ears, nose, or throat. 2  Nerve problems in"}, {"url": "http://www.everydayhealth.com/ear-nose-throat/specialist.aspx", "passage_text": "1 Conditions of the ear. 2  You may need to see an ear, nose, and throat doctor if you have an ear disorder or condition, such as a hearing impairment, ear infections, disorders that affect balance, tinnitus (ringing in the ears), or pain in your ear. Among the conditions that are commonly treated by an ear, nose, and throat doctor are: 1  Injury to your ears, nose, or throat. 2  Nerve problems in"}, {"url": "https://answers.yahoo.com/question/index?qid=20080319074104AAbKaY8", "passage_text": "A doctor that deals *only* with the ears would be an otologist. The previous poster said Otolaryngologists, which is a doctor who deals with both the ear and throat. Most often, you'll see what's commonly referred to as an ENT (ear, nose, and throat doctor) which technically would be an otorhinolaryngologist. Oto=ear, rhino=nose, laryng=throat. If you want to get your husband's hearing tested and possibly look into hearing aids, the person you want to see is an audi"}, {"url": "http://www.everydayhealth.com/ear-nose-throat/specialist.aspx", "passage_text": "1 You may need to see an ear, nose, and throat doctor if you have an ear disorder or condition, such as a hearing impairment, ear infections, disorders that affect balance, tinnitus (ringing in the ears), or pain in your ear. 2  ENT specialists can also treat congenital disorders of the ear (disorders you were born with). Among the conditions that are commonly treated by an ear, nose, and throat doctor are: 1  Injury to your ears, nose, or throat. 2  Nerve problems in"}, {"url": "http://www.healthcommunities.com/health-care-providers/ear-nose-throat-specialist.shtml", "passage_text": "Print. Ear, nose and throat specialists, also called ENTs, ENT doctors and otolaryngologists, specialize in otolaryngology (pronounced ō-tō-la-rən-gae-gä-lə). Jē otolaryngologists, diagnose manage and treat disorders of the head and, neck including the, ears nose, throat, sinuses voice (box) larynx and other. structures Print. Print. Ear, nose and throat specialists, also called ENTs, ENT doctors and otolaryngologists, specialize in otolaryngology (pronounced ō-tō-la-rən-gae-gä-lə). jē"}]