[{"url": "http://psychcentral.com/library/phobia_dentist.htm", "passage_text": "1. Tell the dentist about your fears. This information will help the dentist determine how to best manage and address those fears. By letting the dentist know exactly why the experience is difficult for you, you will feel more control in the examination chair. 2. Your dentist can explain the entire procedure to you beforehand, as well as walk you through step-by-step while the procedure is being performed. You always have the right to fully understand the work being done on your teeth."}, {"url": "http://www.wikihow.com/Overcome-Your-Fear-of-the-Dentist", "passage_text": "1 You might realize that it’s not the procedures that scare you, but your dentist himself. 2  This is an easy fear to help overcome by simply seeking out a new. 3  Take this list to the dentist with you and discuss your fears with her. 4  She can likely offer rational explanations for whatever is causing your anxiety. 1 The best way to find a good doctor for you is to ask friends and family members. 2  Other people aren’t likely to recommend a dentist with whom they don’t feel comfortable. 3  You can also read reviews of dentists online or in local publications such as newspapers or magazines."}, {"url": "http://www.calmclinic.com/anxiety/causes/dental-appointments", "passage_text": "Nearly 20% of Americans avoid the dentist because of this anxiety, and some even have nightmares and sleep loss because of it. But dental health is so important, and very little can happen in a dentist's office that is dangerous. Oral health is still extremely important. You need to see a dentist, especially because most dental problems are easy to fix if they're spot early. There are many different ways to try to overcome dental phobia, but it starts by simply going to the dentist and telling them about your fears."}, {"url": "http://goodrelaxation.com/2012/08/how-to-stay-calm-at-the-dentist/", "passage_text": "Dental anxiety is more common than you think and it is understandable that you will find it difficult to stay calm at the dentist – especially if you have a phobia of needles or pain or you have suffered from a negative experience in the past. There are many reasons why people find it difficult to stay calm at the dentist: some people are afraid of injections, others are fearful of the dreaded dental drill, and others still find it is a fear of the unknown and what may happen once in they are in the dental chair."}, {"url": "http://goodrelaxation.com/2012/08/how-to-stay-calm-at-the-dentist/", "passage_text": "How to Stay Calm at the Dentist. By Natural Relaxation Leave a Comment. The dentist instils fear and anxiety in a large number of people. It can be extremely difficult for patients to keep calm, especially once they reach the waiting room and the familiar sounds and smells of the surgery hit them. There are many reasons why people find it difficult to stay calm at the dentist: some people are afraid of injections, others are fearful of the dreaded dental drill, and others still find it is a fear of the unknown and what may happen once in they are in the dental chair."}, {"url": "http://www.everydayhealth.com/dental-health/you-and-your-dentist/dental-anxiety.aspx", "passage_text": "1 For some patients, a sedative or nitrous oxide can also help calm their nerves, says Harms. 2  Take a break if you need it. 3  Harms says that some patients need to take breaks during dental procedures, when anxiety builds up or they start to feel claustrophobic. 4  If you feel like you need a break, let your dentist know. How to Overcome Dental Anxiety. For people who have dental anxiety, the following strategies can help calm your fears: 1  Communicate with your dentist. 2  Harms says that the best thing you can do to get over your dental anxiety is to talk to your dentist about it."}, {"url": "https://uk.answers.yahoo.com/question/index?qid=20110317054212AAvlTRN", "passage_text": "Hello I totally understand how you feel as I am the same. I so fear going to the dentists and have for years. When I was a child I had to see a Specialist and have 2 teeth pulled and had to wear a brace for 2 years with Head gear at night. Since then I have had loads of fillings and 2 root canals and 2 crowns. I have a check-up appointment at the dentist tomorrow and i am extremely nervous. Every time i go, i'm always having to get some work done (mainly fillings). I think i have developed another cavity on my back tooth and now i am getting scared."}, {"url": "http://www.wikihow.com/Overcome-Your-Fear-of-the-Dentist", "passage_text": "Finding the right doctor can significantly help you to overcome your fear of the dentist. 1  The best way to find a good doctor for you is to ask friends and family members. 2  You can also read reviews of dentists online or in local publications such as newspapers or magazines. 1 The best way to find a good doctor for you is to ask friends and family members. 2  Other people aren’t likely to recommend a dentist with whom they don’t feel comfortable. 3"}, {"url": "http://www.wikihow.com/Overcome-Your-Fear-of-the-Dentist", "passage_text": "In order to overcome your fear of the dentist, write out a list of what is causing you anxiety at the dentist. 1  You may not even be aware of your specific fear(s) until you begin to think about it. 2  Take this list to the dentist with you and discuss your fears with her. 1 The best way to find a good doctor for you is to ask friends and family members. 2  Other people aren’t likely to recommend a dentist with whom they don’t feel comfortable. 3  You can also read reviews of dentists online or in local publications such as newspapers or magazines."}, {"url": "http://psychcentral.com/library/phobia_dentist.htm", "passage_text": "9. Visit the office and talk to the staff before your first appointment. You should feel free to meet with the dentist and to ask questions before scheduling your appointment. Meeting the dentist and his or her staff first will help you find a dentist you like and trust. Your dentist can explain the entire procedure to you beforehand, as well as walk you through step-by-step while the procedure is being performed. You always have the right to fully understand the work being done on your teeth."}]