[{"url": "http://whatscookingamerica.net/Soup/frogmorestew.htm", "passage_text": "Yields 8 servings. Frogmore Stew is considered a classic Low Country South Carolina dish. This dish is also know as Low-Country boil and Beaufort Stew. The dish gets its name from a place that has only a post office on one side of the road and a two-story white country store on the other. Frogmore Stew is actually not a stew and it contains NO Frogs! Frogmore Stew features two main ingredients, fresh shrimp and freshly-shucked yellow corm, but most anything that is good boiled, such as crabs, redskin potatoes, and even crawfish can be added."}, {"url": "http://www.foodnetwork.com/recipes/frogmore-stew-recipe.html", "passage_text": "Directions. In a large stockpot, add the shrimp boil and salt to the water and bring to a boil. Add the sausage and boil, uncovered, for 5 minutes. Add the corn and count 5 minutes. Add the shrimp and count 3 minutes. Do not wait for the liquid to come to a boil when timing the corn and shrimp. Drain immediately and serve. "}, {"url": "http://discoversouthcarolina.com/articles/just-what-is-frogmore-stew", "passage_text": "Frogmore Stew is a delicious, traditional way to cook seafood that is named after a Lowcountry community on St. Helena Island. The “stew” is really a combination of shrimp, corn, potatoes and sausage, and sometimes crabs and other tasty additions. It’s most often eaten outside, where you can be as messy as you want. Frogmore stew is a perfect choice for a relaxed meal for a large crowd. The recipe below serves about six, but it’s easy to adjust. Just allow about 1/2 pound of shrimp and about 1/4 pound of sausage per person, and several potatoes and pieces of corn. Frogmore Stew."}, {"url": "http://allrecipes.com/recipe/19481/frogmore-stew/", "passage_text": "Cook. Ready In. 1  Bring water and Old Bay Seasoning to boil in a large stockpot. 2  Add potatoes and cook for 15 minutes. 3  Add sausage and cook for 5 minutes more. 4  Add corn and cook for another 5 minutes. 5  Stir in the shrimp and cook until shrimp are pink, about 5 minutes. 6  Drain immediately and serve. 1 Bring water and Old Bay Seasoning to boil in a large stockpot. 2  Add potatoes and cook for 15 minutes. 3  Add sausage and cook for 5 minutes more. 4  Add corn and cook for another 5 minutes. 5  Stir in the shrimp and cook until shrimp are pink, about 5 minutes. 6  Drain immediately and serve."}, {"url": "http://whatscookingamerica.net/Soup/frogmorestew.htm", "passage_text": "Photo courtesy of Piggly Wiggly Carolina, Inc. Frogmore Stew is considered a classic Low Country South Carolina dish. This dish is also know as Low-Country boil and Beaufort Stew. The dish gets its name from a place that has only a post office on one side of the road and a two-story white country store on the other. Frogmore Stew is actually not a stew and it contains NO Frogs! Frogmore Stew features two main ingredients, fresh shrimp and freshly-shucked yellow corm, but most anything that is good boiled, such as crabs, redskin potatoes, and even crawfish can be added."}, {"url": "http://www.williams-sonoma.com/recipe/frogmore-stew.html", "passage_text": "A delicious example of South Carolinas low-country cooking, Frogmore stew is named for a tiny town on the coastal island of St. Helena. The flavorful one-pot dish, reputedly created in the 1950s by a local shrimp fisherman, calls for shrimp, corn on the cob, smoked sausage and new potatoes steamed in a savory broth. Add the corn and sausage to the pot and simmer until the corn is tender, 4 to 5 minutes. Add the shrimp and simmer until opaque, 3 to 4 minutes. Taste the broth and adjust the seasonings with salt. Transfer the stew to a large soup tureen or serving bowl and serve immediately."}, {"url": "http://discoversouthcarolina.com/articles/just-what-is-frogmore-stew", "passage_text": "It’s also sometimes called Lowcountry boil or Beaufort stew. Frogmore stew is a perfect choice for a relaxed meal for a large crowd. The recipe below serves about six, but it’s easy to adjust. Just allow about 1/2 pound of shrimp and about 1/4 pound of sausage per person, and several potatoes and pieces of corn. Frogmore Stew."}, {"url": "http://www.jfolse.com/recipes/soups/seafood19.htm", "passage_text": "What is Frogmore Stew? It's a mixture of sausage, potatoes, corn and shrimp, seasoned with a prepared spice mix such as Old Bay seasoning, and boiled until everything is tender and the shrimp have turned pink. The name Frogmore is the names of an old fishing community on St. Helena Island, South Carolina. Bring to a boil, following manufacturer's instructions. Add potatoes, return to a boil, and cook 10 minutes. Add sausage and corn; return to a boil, and cook 10 minutes or until potatoes are tender. Add shrimp; cook 3 to 5 minutes or until shrimp turn pink."}, {"url": "http://www.myrecipes.com/recipe/frogmore-stew", "passage_text": "Preparation. Bring 5 quarts water and 1/4 cup Old Bay seasoning to a rolling boil in a large covered stockpot. Add potatoes; return to a boil, and cook, uncovered, 10 minutes. Add sausage and corn, and return to a boil. Cook 10 minutes or until potatoes are tender. Add shrimp to stockpot; cook 3 to 4 minutes or until shrimp turn pink. Drain. Serve with Old Bay seasoning and cocktail sauce."}]