[{"url": "http://www.answers.com/Q/What_is_a_safe_alternative_to_mineral_oil", "passage_text": "Mineral oil is used to  distinguish oily substances that came out of the ground from oily  substances that are derived from plant … s or animals. The mineral  in this case is petroleum, the substance from which  mineral oil is derived. (Petroleum simply means stone oil in  Greek).    Mineral oil is mainly a mixture of alkane hydrocarbons. If that  sounds a lot like gasoline, it is .."}, {"url": "http://www.differencebetween.info/difference-between-castor-oil-and-mineral-oil", "passage_text": "While, Mineral oil is a mixture of liquid hydrocarbons obtained from petroleum, which is used as a vehicle in pharmaceutical preparations. The castor oil is considered to be the same as that of mineral oil, but primarily it is not so, castor oil is totally different from that of mineral oil. In the market, Vaseline is the most familiar form of mineral oil. It is actually a trademark of a particular brand, but people use it generically. Hence, that particular grade is known as petroleum jelly and petrolatum. Liquid paraffin or light liquid paraffin types are referred as the lighter grades"}, {"url": "http://www.ehow.com/list_5986313_mineral-oil-substitutes.html", "passage_text": "Mineral oil is used in a variety of applications, from industrial lubricants to skin-care products and laxatives. During petroleum processing, mineral oil is formed. Mineral oil is not easily absorbed by skin, so moisture is unable to enter or exit the skin barrier. Skin Care Products. Mineral oil is used in many beauty and skin products as a moisturizer. Mineral oil can clog pores and make it difficult for moisture to enter and exit the skin, which can lead to breakouts. As an alternative to mineral-oil-based products, vegetable-oil products may be used."}, {"url": "http://www.differencebetween.info/difference-between-castor-oil-and-mineral-oil", "passage_text": "Mineral and castor oil are not same; mineral oil are byproducts of petroleum while, castor oil is a plant based vegetable oil obtained from castor seeds. Both have only one thing in common and that is they are not used for cooking purposes. In the market, Vaseline is the most familiar form of mineral oil. It is actually a trademark of a particular brand, but people use it generically. Hence, that particular grade is known as petroleum jelly and petrolatum. Liquid paraffin or light liquid paraffin types are referred as the lighter grades mineral oil"}, {"url": "http://www.drfranklipman.com/3-key-reasons-to-avoid-mineral-oil/", "passage_text": "Mineral oil is a colorless and odorless oil that’s made from petroleum—as a by-product of the distillation of petroleum to produce gasoline. It’s long been used as a common ingredient in lotions, creams, ointments, and cosmetics. It’s lightweight and inexpensive, and helps reduce water loss from the skin. Also called “liquid petroleum,” “paraffin oil,” and “white mineral oil,” mineral oil has long been used in a number of industries, including biomedicine, veterinary medicine, mechanical, electrical, and industrial. Nowhere is its use more debated, however, than in the cosmetics industry."}, {"url": "http://www.constipation-remedies-for-all.com/mineral-oil-for-constipation.html", "passage_text": "As this article will explain, mineral oil for constipation does not constitute a clear-cut case of a constipation remedy that is both natural and safe to use in the long run. First, we will explain what mineral oil is exactly – a derivative of petroleum. Not exactly what you can call a safe product to ingest. Mineral oil, also called “liquid paraffin”, is a derivative of petroleum. It is a translucent, odorless viscous liquid. It doesn’t have any distinctive flavor, but the texture usually makes it unpalatable to children. As you know, petroleum distillation is a big business today."}, {"url": "https://en.wikipedia.org/wiki/Mineral_oil", "passage_text": "Baby oil is a perfumed mineral oil. Most often, mineral oil is a liquid by-product of refining crude oil to make gasoline and other petroleum products. This type of mineral oil is a transparent, colorless oil composed mainly of alkanes and cycloalkanes, related to petroleum jelly. It has a density of around 0.8 g/cm 3. "}]