[{"url": "https://en.wikipedia.org/wiki/Resistant_starch", "passage_text": "1 RS3 Resistant starch that is formed when starch-containing foods are cooked and cooled, such as pasta. 2  Occurs due to retrogradation, which refers to the collective processes of dissolved starch becoming less soluble after being heated and dissolved in water and then cooled. Resistant starch has a small particle size, white appearance, bland flavor and low water-holding capacity. Resistant starch typically replaces flour in foods such as bread and other baked goods, pasta, cereal and batters because it can produce foods with similar color and texture of the original food."}, {"url": "http://chriskresser.com/how-resistant-starch-will-help-to-make-you-healthier-and-thinner/", "passage_text": "Resistant starch is a type of starch that is not digested in the stomach or small intestine, reaching the colon intact. Thus, it “resists” digestion. This explains why we do not see spikes in either blood glucose or insulin after eating RS, and why we do not obtain significant calories from RS. Adding resistant starch to your diet. Some common food sources of RS include green (unripe) bananas, plantains, properly prepared cooked and cooled parboiled rice or legumes, and cooked and cooled potatoes. See this link for a more complete list of RS quantities in food."}, {"url": "https://en.wikipedia.org/wiki/Resistant_starch", "passage_text": "Resistant starch (RS) is starch and starch degradation products that escape from digestion in the small intestine of healthy individuals. Resistant starch has a small particle size, white appearance, bland flavor and low water-holding capacity. Resistant starch typically replaces flour in foods such as bread and other baked goods, pasta, cereal and batters because it can produce foods with similar color and texture of the original food."}, {"url": "http://www.precisionnutrition.com/all-about-resistant-starch", "passage_text": "Resistant starch is a type of starch that isn’t fully broken down and absorbed, but rather turned into short-chain fatty acids by intestinal bacteria. This may lead to some unique health benefits. They’re less likely to spike blood glucose or insulin. Thus, resistant starch is so named because it resists digestion. While most starches are broken down by enzymes in our small intestine into sugar, which is then absorbed into the blood, we can’t fully absorb all kinds of starch. Some starch — known as resistant starch (RS) — isn’t fully absorbed in the small intestine. Instead, RS makes its way to the large intestine (colon), where intestinal bacteria ferment it. RS is similar to fiber (see All About Fiber), although nutrition labels rarely take RS into account"}, {"url": "https://en.wikipedia.org/wiki/Resistant_starch", "passage_text": "Some types of resistant starch (RS1, RS2 and RS3) are fermented by the large intestinal microbiota, conferring benefits to human health through the production of short-chain fatty acids, increased bacterial mass, and promotion of butyrate-producing bacteria. Resistant starch has a small particle size, white appearance, bland flavor and low water-holding capacity. Resistant starch typically replaces flour in foods such as bread and other baked goods, pasta, cereal and batters because it can produce foods with similar color and texture of the original food."}, {"url": "https://en.wikipedia.org/wiki/Resistant_starch", "passage_text": "The concept of resistant starch arose from research in the 1970s and is currently considered to be one of three starch types: rapidly digested starch, slowly digested starch and resistant starch, each of which may affect levels of blood glucose. Resistant starch has a small particle size, white appearance, bland flavor and low water-holding capacity. Resistant starch typically replaces flour in foods such as bread and other baked goods, pasta, cereal and batters because it can produce foods with similar color and texture of the original food."}, {"url": "https://www.myfooddiary.com/blog/what-is-resistant-starch", "passage_text": "The viscosity of fiber (thickness as it moves through the small and large intestines) and how a fiber ferments also play a role when carbohydrates are digested. Resistant starch is a low-viscous type of dietary fiber found in carbohydrate-rich foods. As the name suggests, it resists digestion in the small intestines and ferments in the large intestines. Some studies have shown that resistant starch may help weight loss because it can increase fullness that leads to reduced food intake. There is also evidence that resistant starch reduces insulin resistance and improves blood glucose control."}, {"url": "http://www.marksdailyapple.com/the-definitive-guide-to-resistant-starch/", "passage_text": "RS Type 3 – Retrograded starch; when some starches have been cooked, cooling them (fridge or freezer) changes the structure and makes it more resistant to digestion; found in cooked and cooled potatoes, grains, and beans. RS Type 4 – Industrial resistant starch; type 4 RS doesn’t occur naturally and has been chemically modified; commonly found in “hi-maize resistant starch.”. It’s almost certain that different RS types have somewhat different effects on our gut flora, but the specifics have yet to be fully elucidated."}, {"url": "http://paleoleap.com/resistant-starch/", "passage_text": "Resistant starch is a type of fiber. You can’t digest it, but your gut flora can. That’s why it’s called “resistant:” it resists breakdown in the stomach and small intestine, and makes it through to the large intestine intact. Well, neither and both. How much resistant starch is best for you (and in what form) really depends on your personal tolerance and gut health. It has some interesting potential benefits, but the research is still new and fairly preliminary – and it also has some significant potential downsides."}]