[{"url": "https://answers.yahoo.com/question/index?qid=20100219012547AACEPVF", "passage_text": "Report Abuse. VCB:A vacuum circuit breaker is such kind of circuit breaker where the arc quenching takes place in vacuum. The technology is suitable for mainly medium voltage application. For higher voltage vacuum technology has been developed but not commercially viable. Rating Newest Oldest. Best Answer: Vacuum circuit breaker(VCB)With rated current up to 3000 A, these breakers interrupt the current by creating and extinguishing the arc in a vacuum container."}, {"url": "http://www.electrical4u.com/air-circuit-breaker-air-blast-circuit-breaker/", "passage_text": "This type of circuit breakers, is those kind of circuit breaker which operates in air at atmospheric pressure. After development of oil circuit breaker, the medium voltage air circuit breaker (ACB) is replaced completely by oil circuit breaker in different countries. But in countries like France and Italy, ACBs are still preferable choice up to voltage 15 KV. There are mainly two types of ACB are available. 1  It may increase the arc voltage by cooling the arc plasma. 2  It may increase the arc voltage by lengthening the arc path. 3  Splitting up the arc into a number of series arcs also increases the arc voltage."}, {"url": "http://www.standardelectrical.net/pdf/ACB.pdf", "passage_text": "These are available in 110V and 220V AC/DC. The VA burden of this motor is 150 VA only and the charging time is 3 to 4 seconds.Safety Shutter for main circuitIt is provided on the cradle which automatically isolates the Main circuit terminals when the breaker is drawn out. The electronic circuit gives a signal to this unit in case of over current fault and this unit mechanically trips the Circuit Breaker.In Over Current release (OCR), the sensing of the current is through the current transformers fitted on the main terminals."}, {"url": "http://lntebg.com/ESP/UPOWER/writeups/Ideal.pdf", "passage_text": "Ideal Air Circuit Breaker Preference for an Air Circuit Breaker(ACB) can be assessed based onseveral parameters. With diverseapplications and system configurations,the features offered by the ACB haveto be really exhaustive. "}, {"url": "http://www.acronymfinder.com/Air-Circuit-Breaker-(electric-power-distribution-systems)-(ACB).html", "passage_text": "1 ACB.. 2  Retrieved October 12 2015 from http://www.acronymfinder.com/Air-Circuit-Breaker-(electric-power-distribution-systems)-(ACB).html. 1 Retrieved October 12 2015 from http://www.acronymfinder.com/Air-Circuit-Breaker-(electric-power-distribution-systems)-(ACB).html. 2  APA style: ACB. (n.d.) Acronym Finder. ( 3 2015). 4"}, {"url": "http://acbelectrical.com.au/index.html", "passage_text": "ACB Electrical Services is a licensed electrical contracting and service company. We service almost all areas of NSW. Our services include: 1  Troubleshooting and repairing an electrical problems. 2  Installation of new power points and light points. 3  Complete wiring of home extensions, renovations, or a new house. 4  Switchboard and safety switches for your family safety. 5  Repairs of ovens, stoves, and hot water systems."}, {"url": "https://en.wikipedia.org/wiki/Circuit_breaker", "passage_text": "A circuit breaker is an automatically operated electrical switch designed to protect an electrical circuit from damage caused by overload or short circuit. Its basic function is to detect a fault condition and interrupt current flow. "}, {"url": "http://www.standardelectrical.net/pdf/ACB.pdf", "passage_text": "10 Air Circuit reaer Operating Mechanism It is of stored energy type, which operates using pre-charged springs. The springs are charged manually with the help of charging handle or with the help of charging motor, if provided. The same operating mechanism is used for the entire range. The electronic circuit gives a signal to this unit in case of over current fault and this unit mechanically trips the Circuit Breaker.In Over Current release (OCR), the sensing of the current is through the current transformers fitted on the main terminals."}]