[{"url": "http://www.millboard.co.uk/what-is-composite/", "passage_text": "An advance from the traditional wood plastic composite (WPC), Millboard is a Polymer Composite also known as FRP (Fibre Reinforced Polymer). This is where the core materials used are polymer-based resin and a variety of fibres including glass, carbon and natural fibres for reinforcement. "}, {"url": "http://www.mesothelioma.com/asbestos-exposure/products/millboard/", "passage_text": "Millboard is a thick, square piece of asbestos based insulation that was used in walls, furnaces, fire screens and in other areas where large amounts of heat were produced. Had it not been for the discovery of its poisonous nature, asbestos would most likely still be commonly used by manufacturers throughout the United States. The mineral was mined and processed by hundreds of American companies for nearly a century before its toxicity was revealed."}, {"url": "http://www.millboarddeck.com.au/decking.html", "passage_text": "Millboard decking is hand-made in the United Kingdom &amp styled from real oak timbers, creating an incredible realistic look that captures the natural beauty of wood. Not a single tree is chopped down to produce Millboard. Millboard decking is designed &amp hand crafted in the U.K. from a low energy classed process, as such Millboard is the sustainable choice in exterior decking."}, {"url": "http://www.asbestospacking.com/asbestos-millboard-sheet.html", "passage_text": "We export Asbestos Millboard serve various applications with utmost precision across various industries including; automobile gaskets, padding, construction of roller conveyors, fire Safety. The product is fabricated using supreme quality raw material based on latest technology machineries. We offer Asbestos Millboard Sheet that is fabricated from selected clean, long asbestos fibres of uniform quality assorted with suitable incombustible binding materials. These millboards are known for its features such as heat and fire resistance and strength."}, {"url": "http://www.asbestos.net/exposure/products/construction/millboard/", "passage_text": "While asbestos was a practical material to make many products from, in the 1970’s it was banned in most respects and can no longer be used in the production of new products. However, there is still asbestos in homes all over the country. Much of the time, this is simply due to a lack of awareness. However, if you go in to remove the asbestos millboard, or what have you, it is possible that you’d damage the material in the process. This could stir up the fibers, making it easy for them to be inhaled or ingested. It is when these fibers are taken into the body in some way that problems can arise."}, {"url": "http://www.ehow.com/how_7707801_do-use-rigid-millboard-insulation.html", "passage_text": "Millboard is an insulation material made of fibers tightly compressed between paper or other covering. It is used in walls and ceilings, especially around furnaces, fireplaces or other places subject to high temperatures. "}, {"url": "http://www.mesotheliomasymptoms.com/workplace/asbestos-millboard", "passage_text": "Asbestos Millboard. Asbestos millboard was used in construction homes all over the world. It became a popular material to use above fireplaces and stove-tops as well as in other locations in walls and ceilings because of its flame-resistant durability. The material reduced fires in homes all over the world. "}, {"url": "http://www.urbanline.com.au/products/millboard-decking/", "passage_text": "Urbanline Millboard Decking is an innovative and revolutionary composite decking solution that looks so convincing, you’ll struggle to believe that it’s not real wood – until you enjoy years of virtually maintenance free use. Millboard combines the look of wood with the durability of plastic. Unlike wood decks that require continuous maintenance, there is no need to apply weather protectants or water seal products to Millboard."}, {"url": "http://www.mesothelioma.com/asbestos-exposure/products/millboard/", "passage_text": "Legal Compensation Information. Many people were harmed because of products like millboard that contained asbestos. A large percentage of them filed lawsuits against the companies that produced these goods with the help of mesothelioma attorneys, and demanded monetary compensation. Had it not been for the discovery of its poisonous nature, asbestos would most likely still be commonly used by manufacturers throughout the United States. The mineral was mined and processed by hundreds of American companies for nearly a century before its toxicity was revealed."}, {"url": "http://www.mesothelioma.com/asbestos-exposure/products/rollboard/", "passage_text": "Rollboard. Rollboard, also known as millboard, is a type of insulation used from the mid-to-late 20th century in home and building construction where flame or heat was likely to be a hazard. Rollboard is widely used in construction to make walls and ceilings flame resistant. Some rollboard products have been known to be comprised of as much as 85 percent asbestos. In addition to walls and ceilings, asbestos rollboard was used around stoves and furnaces."}]