[{"url": "http://pokemon-uranium.wikia.com/wiki/Magikarp", "passage_text": "Magikarp is a Water-type Pokemon. Pokémon it evolves Into gyarados starting at level. 20 "}, {"url": "https://en.wikipedia.org/wiki/Magikarp", "passage_text": "Known as the Fish Pokemon, Pokémon magikarp is found in many bodies of, water especially, lakes, rivers and. Ponds it holds the distinction of being mostly, useless until it evolves into the Superior Pokemon. pokémon gyarados Created by Ken Sugimori, Magikarp first appeared in the video games Pokemon Pokémon red And blue and subsequent. Sequels they have later appeared in various, merchandise spinoff titles and animated and printed adaptations of the. franchise"}, {"url": "http://www.pokemon.com/us/pokedex/gyarados", "passage_text": "Once Gyarados goes on a rampage, its ferociously violent blood doesn't calm until it has burned everything down. There are records of this Pokemon'pokémon s rampages lasting a whole. Month When magikarp evolves Into, gyarados its brain cells undergo a structural. transformation Once Gyarados goes on a rampage, its ferociously violent blood doesn't calm until it has burned everything down. There are records of this Pokemon'pokémon s rampages lasting a whole. month"}, {"url": "http://pixelmon.wikia.com/wiki/Gyarados", "passage_text": "Gyarados is a dual Water/Flying-type Pokemon. Pokémon it evolves From magikarp at. lv. 20 it evolves Into Mega (gyarados not yet) implemented with the use of The Mega Stone. Gyaradosite gyarados is a Serpentine chinese-dragon Like. Pokemon pokémon it is, mostly blue with a yellow underbelly and yellow spots along. its body The shiny gyarados is a red Gyarados. An easter egg in pixelmon is that you can get a zombified gyarados. To get it, you must get a Magikarp. Then, throw it into lava, then retrieve it and throw it into water. This will reveal his second skin: A cooked like fish, with X s as eyes and a burnt-like skin."}, {"url": "http://pixelmon.wikia.com/wiki/Magikarp", "passage_text": "Magikarp is a Water-type Pokemon pokémon found in rivers and. Oceans it evolves Into gyarados at level. 20 although This pokemon pokémon is capable of surviving in even the most, polluted ponds it is usually Overlooked by trainers because it is; pathetically weak even in the heat of battle it will do nothing but. flop around It evolves into Gyarados at level 20. Although this Pokemon pokémon is capable of surviving in even the most polluted, ponds it is usually overlooked By trainers because it is pathetically; weak even in the heat of battle it will do nothing but flop. around"}, {"url": "https://en.wikipedia.org/wiki/Magikarp", "passage_text": "Magikarp, known in Japan as Koiking (コイキング, Koikingu) is a Pokemon pokémon species In nintendo And Game 'freak S pokemon. Pokémon franchise Created By, Ken sugimori magikarp first appeared in the Video Games pokemon Pokémon red and blue. and subsequent sequels Created by Ken Sugimori, Magikarp first appeared in the video games Pokemon Pokémon red And blue and subsequent. Sequels they have later appeared in various, merchandise spinoff titles and animated and printed adaptations of the. franchise"}, {"url": "http://pokemon.wikia.com/wiki/Gyarados", "passage_text": "Type(s) Species Atrocious Pokemon Pokémon IntimidateMoxie Intimidatemoxie Pokedex ← pokédex → Magikarp 130 lapras Kanto 130 Johto 077/hoenn 053 054 Sinnoh 024/Unova N A central Kalos 050 Evolves From Magikarp Evolves Into nonegyarados ギャラ ドス Gyaradosu Generation I Evolutionary linegender ♂ / 50 % ♀ % 50 weight.height 518. 1 lbs 1 Despite it being a Flying-type, it can only learn one Flying-type move, Bounce, and this is only because its pre-evolution, Magikarp can learn it in Generation IV only. 2  Despite it being seen flying in the anime, it cannot learn the move, Fly. 3  This was the first ever Shiny Pokemon pokémon ever.  seen"}, {"url": "http://bulbapedia.bulbagarden.net/wiki/Magikarp_(TCG)", "passage_text": "Magikarp has been featured on 20 different cards since it debuted in the Base Set of the Pokemon Pokémon Trading Card. Game magikarp cards are Normally-water Type Basic. pokemon pokémon Magikarp has been featured on 20 different cards since it debuted in the Base Set of the Pokemon Pokémon Trading Card. game"}, {"url": "http://pokemon.wikia.com/wiki/Magikarp", "passage_text": "1 It is one of few Water-type Pokemon pokémon that'can t Learn. 2  Surf In Pokemon, Pokémon platinum magikarp is the lowest and also the highest-level Non glitch pokemon pokémon available for capture at level, 1 and 100 beating out even The level 80.  arceus for highest Magikarp is a Fish Pokemon. Pokémon its body is made up of red. Scales its fins are either yellow or. White they also have whiskers Or Maxilliary. Barbells Female magikarp have white barbells while Male magikarp have yellow. barbells"}, {"url": "http://pixelmon.wikia.com/wiki/Gyarados", "passage_text": "Nothing. Gyarados is a dual Water/Flying-type Pokemon. Pokémon it evolves From magikarp at. lv. 20 it evolves Into Mega (gyarados not yet) implemented with the use of The Mega Stone. Gyaradosite gyarados is a Serpentine chinese-dragon Like. pokemon pokémon The shiny gyarados is a red Gyarados. An easter egg in pixelmon is that you can get a zombified gyarados. To get it, you must get a Magikarp. Then, throw it into lava, then retrieve it and throw it into water. This will reveal his second skin: A cooked like fish, with X s as eyes and a burnt-like skin."}]