[{"url": "https://en.wikipedia.org/wiki/Hydrangea", "passage_text": "Hydrangea (/haɪˈdreɪndʒⁱə/ ; common names hydrangea or hortensia) is a genus of 70–75 species of flowering plants native to southern and eastern Asia (China, Japan, Korea, the Himalayas, and Indonesia) and the Americas. By far the greatest species diversity is in eastern Asia, notably China, Japan, and Korea. Species in the related genus Schizophragma, also in Hydrangeaceae, are also often known as hydrangeas. Schizophragma hydrangeoides and Hydrangea petiolaris are both commonly known as climbing hydrangeas. There are two flower arrangements in hydrangeas. Mophead flowers are large round flowerheads resembling pom-poms or, as the name implies, the head of a mop. In contrast, lacecap flowers bear round, flat flowerheads with a center core of subdued, fertile flowers surrounded by outer rings of showy, sterile flowers"}, {"url": "http://www.theflowerexpert.com/content/growingflowers/flowersandseasons/hydrangea", "passage_text": "Hydrangea is a genus of about 100 species of flowering plants native to southern and eastern Asia (from Japan to China, the Himalaya and Indonesia) and North and South America. Hydrangeas produce flowers from early spring to late autumn. The flowers of Hydrangea are carried in bunches, at the ends of the stems. "}, {"url": "https://en.wikipedia.org/wiki/Hydrangea_macrophylla", "passage_text": "Hydrangea macrophylla is a species of flowering plant in the family Hydrangeaceae, native to China and Japan. The inflorescence of Hydrangea macrophylla is a corymb, with all flowers placed in a plane or a hemisphere or even a whole sphere in cultivated forms. Two distinct types of flowers can be identified: central non-ornamental fertile flowers and peripheral ornamental flowers, usually described as sterile."}, {"url": "http://www.namesofflowers.net/hydrangeas.html", "passage_text": "Several of the most popular species include: 1  Hydrangea arborescens (Wild hydrangea). 2  Hydrangea macrophylla (Bigleaf hydrangea). 3  Hydrangea paniculata (Panicled hydrangea). 4  Hydrangea paniculata 'Grandiflora' (Pee Gee hydrangea). Hydrangea macrophylla also known as the bigleaf hydrangea, florist hydrangea or French hydrangea, is the most popular species. This diverse group includes more than 600 named cultivars encompassing both lace cap and mophead subtypes."}, {"url": "http://hydrangeashydrangeas.com/", "passage_text": "The hydrangeas on this site are divided into four groups. I have included common names as well as botanical names so that hydrangea enthusiasts of all types can relate to the plants.(I took the picture above in Atlanta, GA about 1998 when Penny McHenry was still living. Welcome! Home Books and links Color Change Drying hydrangeas FAQ's Fertilizing HYDRANGEA SPECIES 'Annabelle' Hydrangea arborescens Lacecap Hydrangeas Mophead Hydrangeas Oakleaf Hydrangeas PeeGee and Family Pruning Propagating Planting Purchasing Hydrangeas Wedding Hydrangeas About the author. 1  Home"}, {"url": "http://www.theplantencyclopedia.org/wiki/Hydrangea", "passage_text": "About. Hydrangea (common names Hydrangea and Hortensia) is a genus of about 70 to 75 species of Flowering plants native to southern and eastern Asia (China, Japan, Korea, the Himalayas, and Indonesia) and North and South America. By far the greatest species diversity is in eastern Asia, notably China, Japan, and Korea. Schizophragma hydrangeoides and Hydrangea petiolaris are both commonly known as climbing hydrangeas. There are two flower arrangements in hydrangeas. Mophead flowers are large round flowerheads resembling pom-poms or, as the name implies, the head of a mop."}, {"url": "https://en.wikipedia.org/wiki/Hydrangea_macrophylla", "passage_text": "From Wikipedia, the free encyclopedia. Hydrangea macrophylla is a species of flowering plant in the family Hydrangeaceae, native to China and Japan. It is a deciduous shrub growing to 2 m (7 ft) tall by 2.5 m (8 ft) broad with large heads of pink or blue flowers in summer and autumn. Common names include bigleaf hydrangea, French hydrangea, lacecap hydrangea, mophead hydrangea, penny mac and hortensia. It is widely cultivated in many parts of the world in many climates. It is not to be confused with H. aspera 'Macrophylla'. The inflorescence of Hydrangea macrophylla is a corymb, with all flowers placed in a plane or a hemisphere or even a whole sphere in cultivated forms. Two distinct types of flowers can be identified: central non-ornamental fertile flowers and peripheral ornamental flowers, usually described as sterile."}]