[{"url": "https://en.wikipedia.org/wiki/Neosporin", "passage_text": "Neosporin is the brand name for a product produced by Johnson & Johnson that contains Neomycin Sulfate, Polymyxin B, and Bacitracin Zinc. There is no exact date to when the antibacterial ointment was invented, but it was used as early as the 1950s. Neosporin is for external use only and should not go near mucus membranes such as the eyes or mouth. Neosporin is not recommended for children under the age of two. There are no known side effects when using Neosporin, however users should immediately seek medical attention when experiencing hives, rashes, or itching."}, {"url": "http://www.drugbank.ca/drugs/DB00994", "passage_text": "Mechanism of action. Aminoglycosides like neomycin irreversibly bind to specific 30S-subunit proteins and 16S rRNA. Specifically neomycin binds to four nucleotides of 16S rRNA and a single amino acid of protein S12. This interferes with decoding site in the vicinity of nucleotide 1400 in 16S rRNA of 30S subunit. This region interacts with the wobble base in the anticodon of tRNA."}, {"url": "http://wildpro.twycrosszoo.org/S/00Chem/ChComplex/neomycin.htm", "passage_text": "Topical Preparations: 1  Neomycin / amethocaine / permethrin ear drops (GAC ear drops, Arnolds Veterinary Products) 1-2 drops topically twice daily. ( 2 D107). 3  Neomycin / betamethasone ear/eye drops (Betsolan ear/eye drops, Pitman-Moore) 1-2 drops topically twice or three times daily. Appropriate Use. 1  Neomycin-sensitive infection. 2  Mainly oral administration against enteric infections, for reduction of colon microbe loads prior to colonic surgery. 3  Oral or enema administration in the treatment of hepatic encephalopathy by reducing ammonia-producing bacteria."}, {"url": "http://www.bausch.com/Portals/109/-/m/BL/United%20States/Files/Package%20Inserts/Pharma/Rx-Generics/Neomycin-and-Polymyxin-B-Sulfates-and-Dexamethasone-Oint-A-9114102-9114002.pdf", "passage_text": "Streptomycetaceae). It has a potency equivalent to not less than 600 micrograms of neomycin base per milligram, calculated on an anhydrous basis. The structural formulae are:Polymyxin B Sulfate is the sulfate salt of polymyxin B 1 and B 2 which are produced by the growth of Bacillus polymyxa (Prazmowski) Migula (Fam. How to apply Neomycin and Polymyxin B Sulfates and Dexamethasone Ophthalmic Ointment:1. Tilt your head back.2. Place a finger on your cheek just under your eye and gently pull down until a “V” pocket is formed between your eyeball and your lower lid.3."}, {"url": "https://en.wikipedia.org/wiki/Neosporin", "passage_text": "Concern exists that the use of Neosporin contributes to the emergence of antibiotic-resistant bacteria. In the US, the only large market for Neosporin, the ointment may promote the prevalence of MRSA bacteria, specifically the highly lethal ST8:USA300 strain. Neosporin is for external use only and should not go near mucus membranes such as the eyes or mouth. Neosporin is not recommended for children under the age of two. There are no known side effects when using Neosporin, however users should immediately seek medical attention when experiencing hives, rashes, or itching."}, {"url": "https://en.wikipedia.org/wiki/Neosporin", "passage_text": "The original ointment contains three different antibiotics: bacitracin, neomycin, and polymyxin B, in a relatively low-molecular-weight patented base of cocoa butter, cottonseed oil, sodium pyruvate, tocopheryl acetate, and petroleum jelly. Neosporin is for external use only and should not go near mucus membranes such as the eyes or mouth. Neosporin is not recommended for children under the age of two. There are no known side effects when using Neosporin, however users should immediately seek medical attention when experiencing hives, rashes, or itching."}, {"url": "https://en.wikipedia.org/wiki/Framycetin", "passage_text": "Neomycin is an aminoglycoside antibiotic found in many topical medications such as creams, ointments, and eyedrops. The discovery of neomycin dates back to 1949. It was discovered in the lab of Selman Waksman, who was later awarded the Nobel Prize in Physiology or Medicine in 1951. Neomycin belongs to aminoglycoside class of antibiotics that contain two or more aminosugars connected by glycosidic bonds. Aminoglycosides such as neomycin are known for their ability to bind to duplex RNA with high affinity. The association constant for neomycin with A-site RNA has been found to be in the 10 9 M −1 range. However, more than 50 years after its discovery, its DNA-binding properties were still unknown."}, {"url": "https://en.wikipedia.org/wiki/Framycetin", "passage_text": "Neomycin is typically used as a topical preparation, such as Neosporin. It can also be given orally, where it is usually combined with other antibiotics. Neomycin is not absorbed from the gastrointestinal tract and has been used as a preventive measure for hepatic encephalopathy and hypercholesterolemia. Aminoglycosides such as neomycin are known for their ability to bind to duplex RNA with high affinity. The association constant for neomycin with A-site RNA has been found to be in the 10 9 M −1 range. However, more than 50 years after its discovery, its DNA-binding properties were still unknown."}, {"url": "https://en.wikipedia.org/wiki/Neosporin", "passage_text": "The generic name for these products, regardless of the base, is triple antibiotic ointment. In China, this product is called complex polymyxin B ointment, which is manufactured by Zhejiang Reachall Pharmaceutical. Neosporin is for external use only and should not go near mucus membranes such as the eyes or mouth. Neosporin is not recommended for children under the age of two. There are no known side effects when using Neosporin, however users should immediately seek medical attention when experiencing hives, rashes, or itching."}, {"url": "https://en.wikipedia.org/wiki/Framycetin", "passage_text": "Neomycin B is the most active component in neomycin followed by neomycin C and neomycin A. Neomycin A is not a unique structure, but rather a compositional degradation product of the C and B isomers. Aminoglycosides such as neomycin are known for their ability to bind to duplex RNA with high affinity. The association constant for neomycin with A-site RNA has been found to be in the 10 9 M −1 range. However, more than 50 years after its discovery, its DNA-binding properties were still unknown."}]