[{"url": "http://www.garden-birds.co.uk/birds/magpie.htm", "passage_text": "From a distance the Magpie is a black and white crow with a long tail. The tail accounts for over half the total length of the bird and is an indication of the bird's status in its society. The head, breast and back are black, the shoulders patches, belly and flanks are white. "}, {"url": "http://www.birdcare.com/birdon/birdcare/tipsheets/magpies.html", "passage_text": "Magpies are unlikely to follow them in. If you do have a vulnerable open nest, then it is possible to protect it with an enveloping ball of wire netting. Use a mesh size that will let in the nesting bird, but exclude the magpie. If you erect open nesting boxes, then defend them with wire as soon as you put them up. 1 It takes a pair of magpies around 40 days to build their large, domed nest. 2  A typical magpie clutch is six eggs. 3  Only the female magpie incubates the eggs-it takes 24 days for them to hatch. 4  Young magpies leave the nest around 27 days after hatching."}, {"url": "https://en.wikipedia.org/wiki/Black-billed_magpie", "passage_text": "The breeding season for magpies is generally from late March to early July. They nest once a year, but may re-nest if their first attempt fails early. The female lays up to thirteen eggs, but the usual clutch size is six or seven. The eggs are greenish grey, marked with browns, and 33 mm (about 1.3 inch) long. The black-billed magpie is one of the few North American birds that build a domed nest. This nest is made up of twigs and sits near the top of trees. Usually 6-7 eggs are laid."}, {"url": "http://www.vetwest.com.au/pet-library/baby-magpies-when-and-when-not-to-rescue", "passage_text": "Baby magpies leave the nest before their tail feathers have grown. They live on the ground and are fed and protected (often by swooping) by the parents during the day and are hidden in undergrowth overnight. Members of the public sometimes confuse this act of nature with magpie babies being deserted or in distress. "}, {"url": "https://en.wikipedia.org/wiki/Australian_Magpie", "passage_text": "The Australian magpie (Cracticus tibicen) is a medium-sized black and white passerine bird native to Australia and southern New Guinea. It is not, however, related to the European magpie, which is a corvid. The adult Australian magpie is a fairly robust bird ranging from 37 to 43 cm (14.5–17 in) in length, with distinctive black and white plumage, gold brown eyes and a solid wedge-shaped bluish-white and black bill. The male and female are similar in appearance, and can be distinguished by differences in back markings"}, {"url": "http://www.rspb.org.uk/discoverandenjoynature/discoverandlearn/birdguide/name/m/magpie/life_cycle.aspx", "passage_text": "Breeding magpies hold a territory of about five hectares (12 acres) all year round. Because nest sites are limited, between 25% and 60% of magpies in an area do not breed. These non-breeding birds often form flocks with a home range of up to 20 hectares (about 50 acres) and may pair up within the flock. Magpies usually breed from two years old, although some may breed at one year. "}, {"url": "https://en.wikipedia.org/wiki/Black-billed_magpie", "passage_text": "The black-billed magpie (Pica hudsonia), also known as the American magpie, is a bird in the crow family that inhabits the western half of North America, from southern coastal Alaska to northern California, northern Nevada, northern Arizona, northern New Mexico, central Kansas, and Nebraska. The black-billed magpie is one of the few North American birds that build a domed nest. This nest is made up of twigs and sits near the top of trees. Usually 6-7 eggs are laid."}, {"url": "http://wdfw.wa.gov/living/magpies.html", "passage_text": "Other bird species, including small hawks and owls, often use old magpie nests. Mortality and Longevity During the first half of the 20th century, black-billed magpies were considered detrimental to game-bird populations and domestic stock, and were systematically trapped or shot. Magpie diets include mostly animal matter: insects, small mammals, small wild birds and their hatchlings and eggs. They also eat seeds, fruits, and nuts. Magpies often congregate on recently killed large animal carcasses and eat many road-killed small mammals and birds."}, {"url": "http://icwdm.org/handbook/birds/Magpies.asp", "passage_text": "Black-billed magpies build large nests, sometimes 48 inches (125 cm) high by 40 inches (100 cm) wide, made of sticks in low bushes or in trees usually within 25 feet (7.5 m) from the ground. The nest chamber is a cup lined with grass and mud, and normally enclosed by a canopy of sticks. Two entrances are common. Two distinct species are found in North America, the black-billed and yellow-billed magpies (Fig. 1). They are easily separated by bill color, as their names imply, and by geographic location. Black-billed magpies average 19 inches (47 cm) in length and 1/2 pound (225 g) in weight."}]