[{"url": "http://home.costhelper.com/heat-pump.html", "passage_text": "1 For less moderate climates, installing a dual-fuel air source heat pump that works with a natural gas or propane furnace under a single control system can cost $2,500-$5,500 to install just the heat pump, or $5,000-$25,000 or more for a complete system that includes both the electric heat pump and a fossil-fuel furnace."}, {"url": "http://home.costhelper.com/heat-pump.html", "passage_text": "1 Expect to pay about $2,000-$8,000 for installation of a whole-house air-source heat pump system in an average home (three-ton capacity) with existing usable ductwork. 2  The total costs can double or triple to $4,000-$24,000 or more if new ductwork must be installed or failing ductwork must be replaced."}, {"url": "http://home.costhelper.com/air-heat-pump.html", "passage_text": "1 The total costs can double or triple to $4,000-$24,000 or more if new ductwork must be installed or failing ductwork must be replaced. 2  CostHelper readers report paying $3,000-$15,000 to have an air source heat pump installed, for an average cost of $7,792."}, {"url": "http://www.homeadvisor.com/cost/heating-and-cooling/install-a-heat-pump/", "passage_text": "A heat pump will replace both the furnace and air conditioner/central air unit. It may be costly to install, with the national average falling between $3,956 and $6,702, but it will save you considerable money in energy costs."}, {"url": "http://home.howstuffworks.com/home-improvement/heating-and-cooling/heat-pump6.htm", "passage_text": "Expect to pay as much as $5,000 to $7,500 for a ground-source heat pump system. Air-source heat pumps can be found for much cheaper, averaging around $1,500 to $4,000, because the units tend to be simpler, and installation is easier. The cost required to run and repair a heat pump varies with the type of system."}, {"url": "http://home.costhelper.com/heat-pump.html", "passage_text": "1 Complete installation of a geothermal heat pump (ground-source or water-source) can cost $10,000-$25,000 or more, depending on the length and depth of the underground pipes, soil conditions and other excavation and installation factors."}, {"url": "http://www.qualitysmith.com/request/articles/articles-hvac/geothermal-heat-pump-cost/", "passage_text": "An average home needs 3 tons of heating capacity, and the average cost of a geothermal system is at least $2,500 per ton of capacity. Generally, for each ton of capacity, air source heat pumps are about $3,000 less to install than geothermal heat pumps."}, {"url": "http://www.howmuchisit.org/ductless-heat-pump-cost/", "passage_text": "1 According to GoingDuctless.com, the average cost of an installed ductless heating system using a single indoor heating zone is between $3,000 and $5,000. 2  RemodelingExpense.com estimates a basic ductless heat pump system to cost $1,400-$1,600 and $2,100-$2,525 for custom quality work."}]