[{"url": "http://www.medicalnewstoday.com/articles/151952.php", "passage_text": "Also known as onychomycosis and tinea unguium, nail fungal infections are the most common diseases of the nails, making up about 50% of nail abnormalities. Both fingernails and toenails are susceptible to the infection, which usually manifests as discoloration and thickening of the nail and crumbling edges."}, {"url": "http://www.livescience.com/34786-nail-fungus-symptoms-treatment.html", "passage_text": "Nail fungus, also medically known as onychomycosis, is a chronic fungal infection of the fingernails and/or toenails by dermatophytes, also known as ringworm, yeasts and molds, leading to gradual destruction of the nail plate."}, {"url": "http://www.webmd.com/skin-problems-and-treatments/tc/fungal-nail-infections-cause", "passage_text": "1 Dermatophytes cause almost all fungal toenail infections. 2  Yeasts are a type of fungus that grows on the skin and nails. 3  They are normally present on the human body. 4  Things like illness, antibiotic or birth control pill use, and immune system problems may allow an overgrowth of yeast, leading to a yeast infection."}, {"url": "http://www.webmd.com/skin-problems-and-treatments/tc/fungal-nail-infections-cause", "passage_text": "1 You can get infected by contact with objects that have dermatophytes on them, such as clothing, shoes, nail clippers, nail files, shower and locker room floors, and carpet. 2  Dermatophytes cause almost all fungal toenail infections. 3  Yeasts are a type of fungus that grows on the skin and nails."}, {"url": "http://www.webmd.com/skin-problems-and-treatments/tc/fungal-nail-infections-cause", "passage_text": "Fungal Nail Infections-Cause. Fungal nail infections can be caused by three different types of fungus, alone or in combination. 1  Dermatophytes are a type of fungus that can grow on the skin, hair, and nails. 2  They don't invade the deeper tissues of the body. 3  The most common dermatophyte, Trichophyton rubrum, causes most cases of athlete's foot."}, {"url": "http://www.webmd.com/skin-problems-and-treatments/nail-problems", "passage_text": "Nail fungus, or onychomycosis, is a condition that occurs when a microscopic fungus enters either a fingernail or toenail. Fungal infections occur in toenails more often than in fingernails. Anyone can get nail fungus, but infections are more common in people over the age of 60."}, {"url": "http://www.webmd.com/skin-problems-and-treatments/nail-problems", "passage_text": "Usually, nail fungus occurs when fungus enters the nail through a small trauma (cut or break) in the nail. Nail fungus is not caused by poor hygiene. Nail fungus can be spread from person to person. It may be hard to determine exactly where or how a fungal infection is acquired."}, {"url": "http://www.medicinenet.com/fungal_nails/article.htm", "passage_text": "Many changes in fingernails or toenails may cause people to think they have a fungal infection of the nails, medically known as onychomycosis. Fungal infection of the nails sometimes makes the condition sound contagious or related to poor hygiene."}]