[{"url": "http://www.wisegeek.com/what-is-galvanized-steel.htm", "passage_text": "Ad. This process, known as hot-dipped galvanization, is one of the most common methods of making galvanized steel, but it's not the only one. Continuous sheet galvanizing runs a steel sheet or wire through molten zinc; it's also a form of hot-dipping, but leaves a thinner layer of the protective metal."}, {"url": "http://www.galvanizeit.org/hot-dip-galvanizing/what-is-hot-dip-galvanizing-hdg", "passage_text": "What is Hot-Dip Galvanizing (HDG)? Hot-dip galvanizing (HDG) , as referenced on this site, is the process of dipping fabricated steel into a kettle or vat containing molten zinc."}, {"url": "https://en.wikipedia.org/wiki/Hot-dip_galvanizing", "passage_text": "The process of hot-dip galvanizing results in a metallurgical bond between zinc and steel with a series of distinct iron-zinc alloys. The resulting coated steel can be used in much the same way as uncoated.A typical hot-dip galvanizing line operates as follows: 1  Steel is cleaned using a caustic solution."}, {"url": "http://www.metalplate.com/techdept/galvprocess.php", "passage_text": "Galvanizing is the practice of immersing clean, oxide-free iron or steel into molten zinc in order to form a zinc coating that is metallurgically bonded to the iron or steel's surface. The zinc coating protects the surface against corrosion by providing protection to the iron or steel in two ways."}, {"url": "https://en.wikipedia.org/wiki/Hot-dip_galvanizing", "passage_text": "Hot-dip galvanization is a form of galvanization. It is the process of coating iron and steel with a layer of zinc by immersing the metal in a bath of molten zinc at a temperature of around 840 °F (449 °C).he process of hot-dip galvanizing results in a metallurgical bond between zinc and steel with a series of distinct iron-zinc alloys. The resulting coated steel can be used in much the same way as uncoated."}, {"url": "http://www.innovateus.net/science/what-galvanizing", "passage_text": "Galvanization is the process by which zinc is coated over corrosive (easily rusted) metals. Galvanizing involves coating corrosive metals, such as steel and iron, with a non-corrosive metal. The process of galvanizing, not only protects from corrosion of various ‘soft metals’ but also adds strength of the original, uncoated metal. Electro-Galvanizing: It is an electrolytic process for galvanizing, where a thinner, tighter bonding coat of zinc is applied to a metal through “electroplating”. 2  Electro plating is a process of running a current of electricity through a saline/ zinc solution with a zinc anode and steel conductor."}, {"url": "http://www.businessdictionary.com/definition/galvanizing.html", "passage_text": "galvanizing. Process in which a zinc film is deposited on goods made of steel to provide long term (generally 10 to 30 years) corrosion protection and abrasion resistance.wo common galvanizing processes are (1) Hot metal bath: about 250 years old but still popular method in which the item is immersed in molten zinc to deposit a 50 to 150 micron thick film. (2) Electro-deposition: more recent method in which a 5 to 30 micron thick film of zinc is deposited electrochemically."}, {"url": "http://www.wisegeek.com/what-is-galvanized-steel.htm", "passage_text": "Galvanized steel is steel that has gone through a chemical process to keep it from corroding. The steel gets coated in layers of zinc oxide because this protective metal does not get rusty as easily. The coating also gives the steel a more durable, hard to scratch finish that many people find attractive.d. This process, known as hot-dipped galvanization, is one of the most common methods of making galvanized steel, but it's not the only one. Continuous sheet galvanizing runs a steel sheet or wire through molten zinc; it's also a form of hot-dipping, but leaves a thinner layer of the protective metal."}, {"url": "http://www.innovateus.net/science/what-galvanizing", "passage_text": "Galvanizing is the practice of immersing clean, oxide-free steel into molten zinc to from a protective coating over the metal. The coating is bonded metallurgically to the steel and this coating helps to protect the surface against corrosion. In recent use, the term refers to the coating of steel or iron with zinc. Electro-Galvanizing: It is an electrolytic process for galvanizing, where a thinner, tighter bonding coat of zinc is applied to a metal through “electroplating”. 2  Electro plating is a process of running a current of electricity through a saline/ zinc solution with a zinc anode and steel conductor."}, {"url": "https://en.wikipedia.org/wiki/Galvanization", "passage_text": "Galvanization, or galvanisation, is the process of applying a protective zinc coating to steel or iron, to prevent rusting. The most common method is hot-dip galvanization, in which parts are submerged in a bath of molten zinc. Galvanizing protects in two ways: 1  It forms a coating of corrosion-resistant zinc which prevents corrosive substances from reaching the more delicate part of the metal. 2  The zinc serves as a sacrificial anode so that even if the coating is scratched, the exposed steel will still be protected by the remaining zinc."}]