[{"url": "http://privateschool.about.com/od/salaries/a/What-Do-Private-School-Teachers-Earn.htm", "passage_text": "The average pay of a private school headmaster is about $200,000, and many of the headmasters at competitive boarding and day schools earn close to $500,000 a year, in part because they have extensive responsibilities, including fundraising and the financial stewardship of the school. Why Private School Teachers Earn Less. Teachers at both public and private schools would likely argue that they should earn more. After all, they are critical in creating tomorrow’s leaders, and it has been shown that teachers can have a life-long effect on their students."}, {"url": "http://www.payscale.com/research/US/Job=Elementary_School_Principal/Salary", "passage_text": "Workers with less than five years' experience earn around $72K on average, and those who have five to 10 years under their belts see a higher median salary of $78K. On average, Elementary School Principals make $79K following one to two decades on the job. "}, {"url": "http://privateschool.about.com/od/salaries/a/What-Do-Private-School-Teachers-Earn.htm", "passage_text": "Recent data from PayScale show that teachers at private high schools earn about $40,000 on average, while their counterparts at public schools earn an average of $43,000. Public school teachers in large urban districts such as Chicago and New York City can earn close to or well or $100,000. Why Private School Teachers Earn Less. Teachers at both public and private schools would likely argue that they should earn more. After all, they are critical in creating tomorrow’s leaders, and it has been shown that teachers can have a life-long effect on their students."}, {"url": "http://privateschool.about.com/od/salaries/a/What-Do-Private-School-Teachers-Earn.htm", "passage_text": "Teachers at boarding schools generally earn less than those at private day schools because part of their salary is in the form of room and board, which accounts for about 25% of their income. Why Private School Teachers Earn Less. Teachers at both public and private schools would likely argue that they should earn more. After all, they are critical in creating tomorrow’s leaders, and it has been shown that teachers can have a life-long effect on their students."}, {"url": "http://privateschool.about.com/od/forheadsonly/a/comp.htm", "passage_text": "The average compensation of the top 500 CEO's is in the millions according to Executive Paywatch. Headmasters' compensation averages about $200,000. On the other hand many headmasters earn more than some public school superintendents do. The average salary without benefits for a superintendent is $160,000. Now, college presidents by contrast make significantly more than private school headmasters. They average about $400,000 with a dozen or so well over $1,000,000 in annual compensation. Compensation Information Sources. The Form 990 which a non-profit school files is similar to a tax return."}, {"url": "http://www.telegraph.co.uk/education/educationnews/7886642/Primary-school-headmaster-earns-more-than-276000.html", "passage_text": "Comments. Mark Elms, who runs an inner city primary school in south London, received £70,000 more than the headmaster of Eton College. The sum was made up through his basic salary, back-dated pay and by helping other schools. He is one of around 100 head teachers to earn more than David Cameron's salary of £147,000. Meanwhile the average primary head teacher earns around £55,000 per year. Mr Elms is headmaster of Tidemill Primary School in Lewisham which has more than 335 pupils. The disclosure by Lewisham Council comes days after Michael Gove, the Education Secretary, called for salary caps to ensure that heads earned no more than the Prime Minister."}, {"url": "http://www.ehow.com/info_12048812_pay-scale-headmasters-private-schools.html", "passage_text": "Median Annual Wage. Headmasters are a type of education administrator. In 2010, the median annual wage for education administrators in elementary and secondary schools was $86,970, according to the U.S. Department of Labor's Bureau of Labor Statistics. "}]