[{"url": "http://www.webmd.com/fitness-exercise/dislocated-separated-shoulder?page=2", "passage_text": "1 Ice your shoulder to reduce pain and swelling. 2  Do it for 20-30 minutes every three to four hours, for 2 to 3 days or longer. 3  Use a sling or shoulder immobilizer to prevent further injury until you get medical treatment. 4  Then follow the doctor's advice about whether or not to use a sling. The same treatment would also be used for a separated shoulder. To treat either injury, you should: 1  Ice your shoulder to reduce pain and swelling. 2  Do it for 20-30 minutes every three to four hours, for 2 to 3 days or longer."}, {"url": "http://www.answers.com/Q/How_long_does_it_take_to_heal_an_elbow_dislocation", "passage_text": "About 2 weeks to a month. I slightly dislocated my wrist and its kinda hard to type with this splint on. But if its slightly dislocated like mine, I would wear a splint for 1- … 3 weeks. I'm not a doctor but if you did dislocate it and it's really bad, please see a doctor. About 4-6 weeks, kind of a little bit longer Probably one of the worst piercings to get. I had double hip piercings and they backed out after about 4 months. Surface piercings are really a waste of money because eventually they will back out and leave you with a horrible scar."}, {"url": "http://curetenniselbow.org/1448/how-long-does-it-take-for-elbow-ligaments-to-heal/", "passage_text": "It will take 8 weeks for the majority of the injuery to heal but it will take up to a full year to get 100% function back with therapy. Notify me of follow-up comments by email. Notify me of new posts by email. How long does it take for elbow ligaments to heal? Aron, April 3rd, 2010, in Tennis Elbow Home Cures. I sufferered from a dislocated elbow few weeks ago when a long 40 ft, 2 tonne pipe hit my arm. A surgery was required to reduce the elbow and repair the ligaments, I am wondering how long healing takes. Thank you all in advance"}, {"url": "http://www.antibodywear.com/shoulder-dislocations-symptoms-treatment/", "passage_text": "After the shoulder dislocation has been corrected, it may require immobilization with a cast or sling for 2 to 8 weeks. Complete healing of injured ligaments requires a minimum of 6 weeks. If customary treatment does not prevent a recurrence, athletic activities should be modified until surgery can be done. The appropriate health care for a shoulder dislocation is a doctor’s care. This will include: (1) Manipulation of the joint to reposition the bones. (2) Surgery (sometimes) to restore the joint to its normal position."}, {"url": "http://arcticeasewrap.com/shoulder-dislocation-recovery-time/", "passage_text": "It causes the ligaments that hold your shoulder in place to stretch. A common risk in many sports, a dislocated shoulder can leave you on the sidelines for three months. Following a shoulder dislocation, expect that your arm may be immobilized for about four weeks to allow the joint time to heal properly. A sling or a shoulder immobilizer will prevent you from using your shoulder. In general, dislocated shoulders fully heal within four to 12 weeks depending on your age, the amount and severity of structural damage that was done to the muscles and ligaments at the time of dislocation, and your physical therapy regimen. "}, {"url": "http://www.answers.com/Q/How_long_does_it_take_to_heal_an_elbow_dislocation", "passage_text": "It it is allowed to regrow the length of time depends upon how much new regrowth is required. If you injured a nerve in your lumbar spine (i.e. your low back), that may be 1 meters worth of growth to get to the feet. At 1-2 mm per day, that may take up 500 to 1000 days. If you injured a nerve at your wrist (as occurs with carpal tunnel syndrome and the median nerve), that may be 5 cm and could take 25-50 days to completely regrow. About 4-6 weeks, kind of a little bit longer Probably one of the worst piercings to get. I had double hip piercings and they backed out after about 4 months. Surface piercings are really a waste of money because eventually they will back out and leave you with a horrible scar."}, {"url": "http://www.steadyhealth.com/topics/what-is-approximate-healing-time-for-elbow-dislocation", "passage_text": "Don’t fool around trying to make your elbow heal faster, that is simply not possible. It will heal on its own, in its own time. And time does take from 6 weeks but it can reach 20 weeks, depending on the severity of the injury. "}, {"url": "http://www.webmd.com/fitness-exercise/dislocated-separated-shoulder?page=2", "passage_text": "How quickly you recover depends on how serious your shoulder injury is. Separated shoulders may heal over a period of 6 weeks. Dislocated shoulders may take longer -- more like 3 to 12 weeks. But these lengths of time are just approximations. Everyone heals at a different rate. 1  1. 2  2. 3  3. The same treatment would also be used for a separated shoulder. To treat either injury, you should: 1  Ice your shoulder to reduce pain and swelling. 2  Do it for 20-30 minutes every three to four hours, for 2 to 3 days or longer."}]