[{"url": "http://www.anylabtestnow.com/tests/informational-paternity-test/", "passage_text": "DESCRIPTION: To determine the biological father of a child, get this Informational DNA Paternity Test. This test gives you an accurate determination (with an average probability of paternity of 99% or more) of who the child’s biological father is. DNA TEST, PATERNITY (INFORMATIONAL). A Paternity DNA Test compares the DNA of a child to the DNA of an Alleged Father, and preferably the child’s mother, to determine the probability of paternity."}, {"url": "https://en.wikipedia.org/wiki/Parental_testing", "passage_text": "In a DNA parentage test, the result (called the 'probability of parentage) is 0% when the alleged parent is not biologically related to the child and the probability of parentage is typically 99.99% when the alleged parent is biologically related to the child. In testing the paternity of a male child, comparison of the Y chromosome can be used, since it is passed directly from father to son. In the US, the AABB has regulations for DNA paternity and family relationship testing; however, AABB accreditation is not necessary."}, {"url": "http://my.clevelandclinic.org/health/diagnostics/hic-DNA-paternity-test", "passage_text": "Paternity testing can determine whether or not a particular man is the biological father of a child. This procedure involves collecting and examining the DNA of a small sample of bodily fluid or tissue from a child and the potential father. DNA testing is generally considered to be the most accurate testing method available. DNA paternity testing can indicate that a man is highly likely to be the father with about 99.9% accuracy or that he is excluded as being the father with 100% accuracy."}, {"url": "https://en.wikipedia.org/wiki/Parental_testing", "passage_text": "DNA paternity testing is the use of DNA profiling (known as genetic fingerprinting) to determine whether two individuals are biologically parent and child. In testing the paternity of a male child, comparison of the Y chromosome can be used, since it is passed directly from father to son. In the US, the AABB has regulations for DNA paternity and family relationship testing; however, AABB accreditation is not necessary."}, {"url": "http://www.dnasaves.org/dna_testing.php", "passage_text": "DNA is the most powerful tool available for identification in forensic investigations. Because of its ability to link physical evidence found at a crime scene to a single person, it is often referred to as a “digital fingerprint.” This method is so precise that it can ensure pinpoint accuracy, down to one in a billion. DNA databases make it possible for law enforcement crime laboratories to electronically search and compare collected DNA profiles to crime scene evidence. In the United States, the Combined DNA Index System (CODIS) links all local, state, and national databases and contains more than 5 million records."}, {"url": "http://www.ehow.com/about_5098637_dna-paternity-testing-requirements.html", "passage_text": "Found This Helpful. DNA paternity testing examines DNA from a mother, child and father (or possible father). When a mother is unsure of who the father is or needs proof of paternity, a DNA test will confirm the father's identity. DNA tests are also used for adopted children. Swab Testing. DNA testing requires a neutral third party to take the samples. This ensures that samples are not false or mixed up. A certified tester swipes one specialized swab to the inside of the child's mouth then uses new ones for each parent. The tester sends these samples to a laboratory for analysis"}, {"url": "https://en.wikipedia.org/wiki/Parental_testing", "passage_text": "A paternity test establishes genetic proof whether a man is the biological father of an individual, and a maternity test establishes whether a woman is the biological mother of an individual. In testing the paternity of a male child, comparison of the Y chromosome can be used, since it is passed directly from father to son. In the US, the AABB has regulations for DNA paternity and family relationship testing; however, AABB accreditation is not necessary."}]