[{"url": "http://microbeonline.com/catalase-test-principle-uses-procedure-results/", "passage_text": "Catalase is an enzyme, which is produced by microorganisms that live in oxygenated environments to neutralize toxic forms of oxygen metabolites; H 2 O 2. The catalase enzyme neutralizes the bactericidal effects of hydrogen peroxide and protects them. Anaerobes generally lack the catalase enzyme."}, {"url": "http://www.austincc.edu/microbugz/catalase_test.php", "passage_text": "Hydrogen peroxide is often used as a topical disinfectant in wounds, and the bubbling that is seen is due to the evolution of O2 gas. H2O2 is a potent oxidizing agent that can wreak havoc in a cell; because of this, any cell that uses O2 or can live in the presence of O2 must have a way to get rid of the peroxide."}, {"url": "http://learn.chm.msu.edu/vibl/content/catalase.html", "passage_text": "The catalase test is used to differentiate staphylococci (catalase-positive) from streptococci (catalase-negative). The enzyme, catalase, is produced by bacteria that respire using oxygen, and protects them from the toxic by-products of oxygen metabolism."}, {"url": "http://medical-dictionary.thefreedictionary.com/catalase", "passage_text": "A gene on chromosome 11p13 that encodes catalase, an enzyme which plays a central role in the body’s defence against oxidative stress, converting the reactive oxygen species hydrogen peroxide (H2O2) to water and oxygen, thereby mitigating H2O2’s toxic effects."}, {"url": "http://microbeonline.com/catalase-test-principle-uses-procedure-results/", "passage_text": "Catalase is an enzyme, which is produced by microorganisms that live in oxygenated environments to neutralize toxic forms of oxygen metabolites; H2O2. The catalase enzyme neutralizes the bactericidal effects of hydrogen peroxide and protects them. Anaerobes generally lack the catalase enzyme."}, {"url": "http://medical-dictionary.thefreedictionary.com/catalase", "passage_text": "catalase. a heme-containing enzyme that specifically catalyzes the decomposition of hydrogen peroxide and is found in almost all cells except certain anaerobic bacteria. The reaction can be used as a test in the identification of bacteria."}, {"url": "https://quizlet.com/5987128/microbiology-lab-oxidase-catalase-nitrate-reductase-tests-flash-cards/", "passage_text": "Catalase principle. most bacteria produce hydrogen peroxide, which is toxic to microbial cells. If the bacteria produces the enzyme catalase, which breaks down hydrogen peroxide into water and oxygen gas."}, {"url": "http://webcls.utmb.edu/samplecourses/bact/Bact/procedures/catalase.htm", "passage_text": "The breakdown of hydrogen peroxide into oxygen and water is mediated by the enzyme catalase. When a small amount of an organism that produces catalase is introduced into hydrogen peroxide, rapid elaboration of bubbles of oxygen, the gaseous product of the enzyme's activity is produced."}, {"url": "http://study.com/academy/lesson/what-is-catalase-definition-structure-reaction.html", "passage_text": "To rid ourselves of this toxin, we use catalase. Catalase is an enzyme that converts hydrogen peroxide into water and oxygen gas. Enzymes are protein molecules that are composed of subunits called amino acids. Amino acids are similar to links in a chain, while protein is similar to the chain itself."}]