[{"url": "http://www.answers.com/Q/How_much_is_an_average_horse_farrier_cost", "passage_text": "The cost of a good farrier is one of the many expenses that make owning a horse all but impossible for many people. Of course rates can vary greatly from one region to the nex … t but the average is $30 - $50 for just a trim and $80 - $120 for shoes. Half shoe usually runs about $60. "}, {"url": "http://www.successful-horse-training-and-care.com/buying-a-horse.html", "passage_text": "Costs vary, but an average range is $150 to $350 a year. Another option is to put aside money in a savings account that is earmarked specifically for your horse’s veterinary emergencies. A bare minimum should be the cost of euthanizing your horse and have his body removed, which averages about $250-$300. In the central Illinois area (again excluding Chicago and suburbs), farrier costs for your horse can range from about $30 (for a trim) to over $100 for a full set of shoes. Most horses need to be shod about every six weeks. This is an very important factor to consider when thinking of buying a horse."}, {"url": "http://www.answers.com/Q/What_is_the_average_yearly_farrier_cost", "passage_text": "Confidence votes 99. It all depends on where you live, how often the farrier visits and what you have done. A horse needs his feet tended to every 5-8 weeks on average. If you have your horse trimmed, you might be looking at $25-$50 per visit, depending on what part of the country you live in. If you have your horse shod in front and trimmed behind, it might be anywhere from $75-$125/visit. I estimate that for me, even with my 25% discount, each of my cat's cost an average of $600.00 per year (if they are healthy). As they age the … cost increases with the need for bloodwork and dentals. The cost of the dental alone with extractions can be up to $1,000."}, {"url": "http://www.howmuchisit.org/how-much-does-a-farrier-cost/", "passage_text": "1 Trimming the draught horse can cost $130 to $275, depending on the excessive foot. 2  For saddle horses, trimming has fees ranging from $60 to $135 depending on the job and how much trimming needs to be done. 3  There are farrier services which will charge a minimum call fee of $20-$55. Choose a professional farrier that can do the job well. The cost of a farrier is going to vary depending on how many horses need to be “trimmed”, as well as the complexity of the job, etc. Prices and charges for the farriers are based on the location, number of horses, temperament, and what they need to have done."}, {"url": "http://www.answers.com/Q/What_is_the_average_yearly_farrier_cost", "passage_text": "The cost of a good farrier is one of the many expenses that make owning a horse all but impossible for many people. Of course rates can vary greatly from one region to the nex … t but the average is $30 - $50 for just a trim and $80 - $120 for shoes. Half shoe usually runs about $60. I estimate that for me, even with my 25% discount, each of my cat's cost an average of $600.00 per year (if they are healthy). As they age the … cost increases with the need for bloodwork and dentals. The cost of the dental alone with extractions can be up to $1,000."}, {"url": "http://www.successful-horse-training-and-care.com/buying-a-horse.html", "passage_text": "Farrier costs vary from region to region. In the central Illinois area (again excluding Chicago and suburbs), farrier costs for your horse can range from about $30 (for a trim) to over $100 for a full set of shoes. Most horses need to be shod about every six weeks. This is an very important factor to consider when thinking of buying a horse."}, {"url": "http://www.wiwfarm.com/TrueCostofShoeing.htm", "passage_text": "The total cost of shoeing your one horse is $127.88. If your farrier is just trimming horses, you would deduct the cost of shoes which would leave you at $121.13, divided by three horses, $40.37 per horse. A van or shoeing truck, new, costs $25,000.00. Driving 200 miles per day = 46,960 miles per year. If it lasts about three years = $8,333.33 per year in replacement cost of gas, tires, maintenance, etc. I will use the average payment to a person using their own car for an employer."}, {"url": "http://www.howmuchisit.org/how-much-does-a-farrier-cost/", "passage_text": "1 Overall, the services of a farrier will be between $50 and $300 per horse. 2  For light horse or pony, a hot shoeing cost will run $100 to $250, excluding the shoe cost for draught horses. 3  If you choose to get a shoe for a draught horse, that can cost up to more than $250. Choose a professional farrier that can do the job well. The cost of a farrier is going to vary depending on how many horses need to be “trimmed”, as well as the complexity of the job, etc. Prices and charges for the farriers are based on the location, number of horses, temperament, and what they need to have done."}, {"url": "http://missionfarrierschool.com/FAQ.html", "passage_text": "Frequently Asked Questions. In 1968 the average cost of attending farrier school was $2400. The average cost to shoe a horse was $12 a head. At that price, a graduate would have to shoe 200 horses to pay for his/her schooling. Currently, our tuition is $8000. The average cost to shoe a horse is anywhere from $65 - $150 a head. If we figure low at $80 a head (which our graduates should be able to get in all but the most rural or economically depressed parts of the country), a graduate would have to shoe only 100 horses to pay for his/her schooling."}]