[{"url": "http://www.rightdiagnosis.com/surgery/marshall-marchetti-krantz-mmk-procedure-for-bladder-neck-suspension.htm", "passage_text": "Non-Surgical Options: Marshall-Marchetti-Krantz (MMK) procedure for bladder neck suspension. These non-surgical medical options may be possible alternative treatments to performing Marshall-Marchetti-Krantz (MMK) procedure for bladder neck suspension: Marshall-Marchetti-Krantz (MMK) procedure for bladder neck suspension is major abdominal surgery to secure the neck of the bladder to the cartilage of the pubic bone. Other Surgical Options: Marshall-Marchetti-Krantz (MMK) procedure for bladder neck suspension. Surgical procedure options to consider as an alternative for Marshall-Marchetti-Krantz (MMK) procedure for bladder neck suspension may include these surgeries:"}, {"url": "http://www.xe.com/currency/mmk-burmese-kyat", "passage_text": "Myanmar (Burma), Kyat. The Burmese Kyat is the currency of Myanmar (Burma). Our currency rankings show that the most popular Myanmar (Burma) Kyat exchange rate is the MMK to USD rate. The currency code for Kyats is MMK, and the currency symbol is K. Below, you'll find Burmese Kyat rates and a currency converter. You can also subscribe to our currency newsletters with daily rates and analysis, read the XE Currency Blog, or take MMK rates on the go with our XE Currency Apps and website"}, {"url": "https://en.wikipedia.org/wiki/Maalaala_Mo_Kaya", "passage_text": "In March 2007, MMK started its radio counterpart  Maalaala Mo Kaya sa DZMM  as a daily radio drama being broadcast on DZMM. It is also hosted by Charo Santos-Concio and airs weekdays from 12:30 to 1:00 PM. It was recently recognized as the Best Drama Program at the 32nd Catholic Mass Media Awards. 1 In this very first episode of Maalaala Mo Kaya aired on May 15, 1991, Romnick Sarmienta plays Allan, a social climber who is ashamed of his impoverished state and pretends to be well-off to blend in with his rich friends in school. 2  His father, a street sweeper, works very hard to meet his luxurious needs."}, {"url": "http://www.rightdiagnosis.com/surgery/marshall-marchetti-krantz-mmk-procedure-for-bladder-neck-suspension.htm", "passage_text": "Diseases And Conditions Treated: Marshall-Marchetti-Krantz (MMK) procedure for bladder neck suspension. These diseases and conditions may be treated with the surgical procedure Marshall-Marchetti-Krantz (MMK) procedure for bladder neck suspension: Marshall-Marchetti-Krantz (MMK) procedure for bladder neck suspension is major abdominal surgery to secure the neck of the bladder to the cartilage of the pubic bone. Other Surgical Options: Marshall-Marchetti-Krantz (MMK) procedure for bladder neck suspension. Surgical procedure options to consider as an alternative for Marshall-Marchetti-Krantz (MMK) procedure for bladder neck suspension may include these surgeries:"}, {"url": "https://en.wikipedia.org/wiki/Maalaala_Mo_Kaya", "passage_text": "The Philippine version entitled . MMK Klasiks  aired on ABS-CBN's Kapamilya Gold afternoon block as a temporary replacement program from December 17, 2012 to January 18, 2013. MMK Klasiks also airs on DZMM TeleRadyo as a fill-in to its radio counterpart, because the latter was pre-recorded. 1 In this very first episode of Maalaala Mo Kaya aired on May 15, 1991, Romnick Sarmienta plays Allan, a social climber who is ashamed of his impoverished state and pretends to be well-off to blend in with his rich friends in school. 2  His father, a street sweeper, works very hard to meet his luxurious needs."}, {"url": "http://www.urbandictionary.com/define.php?term=mmk", "passage_text": "2.)or you can say mmk when you dont know what else to say so youre just like....mmk; usually used in online chat. 3.)oh and you cant say it because its mine...MINE oh and Ashleys. 1.) Ryan: so anyways, i hate that emo kid he is so friggin annoying!. "}, {"url": "https://en.wikipedia.org/wiki/MMK", "passage_text": "MMK may refer to: 1  Makkal Manadu Katchi Regional political party in India. 2  Magnitogorsk Iron and Steel Works (магнитогорский металлургический комбинат), one of Russia's largest steel companies. 3  Mūlamadhyamakakārikā. "}, {"url": "http://financial-dictionary.thefreedictionary.com/MMK", "passage_text": "MMK. ISO 4217 code for the Burmese (or Myanmar) kyat. It was introduced in 1953, replacing the Burmese rupee. The Burmese government has been known to follow unusual policies with regard to printing money. The ISO 4217 currency code for the Myanmar (ex-Burma) Kyat"}, {"url": "http://www.investopedia.com/terms/m/mmk.asp", "passage_text": "BREAKING DOWN 'MMK'. The currency market, also known as the Foreign Exchange market, is the largest financial market in the world, with a daily average volume of over US $1 trillion. "}]