[{"url": "http://home.costhelper.com/replace-toilet.html", "passage_text": "1 Professional installation usually costs about $50-$250 for a standard toilet depending on location and plumber, but can be $300-$1,000 or more for a complex installation of a specialty toilet or if parts or lines leading into the toilet have to be repaired or replaced. 1 CostHelper readers report paying $100-$400 for installation, at an average cost of $198. 2  The total cost for a toilet with professional installation is typically $150-$600 depending on location and type of toilet, but it can be $700-$7,000 or more for specialty toilets and/or if additional parts and repairs are needed."}, {"url": "http://home.costhelper.com/replace-toilet.html", "passage_text": "1 Within these price ranges, two-piece toilets (bowl and tank are separate) typically cost less than one-piece models. 2  CostHelper readers report paying $100-$325 for a basic toilet (without installation), at an average price of $176. 1 CostHelper readers report paying $100-$400 for installation, at an average cost of $198. 2  The total cost for a toilet with professional installation is typically $150-$600 depending on location and type of toilet, but it can be $700-$7,000 or more for specialty toilets and/or if additional parts and repairs are needed."}, {"url": "http://home.costhelper.com/replace-toilet.html", "passage_text": "1 The total cost for a toilet with professional installation is typically $150-$600 depending on location and type of toilet, but it can be $700-$7,000 or more for specialty toilets and/or if additional parts and repairs are needed. 1 CostHelper readers report paying $100-$400 for installation, at an average cost of $198. 2  The total cost for a toilet with professional installation is typically $150-$600 depending on location and type of toilet, but it can be $700-$7,000 or more for specialty toilets and/or if additional parts and repairs are needed."}, {"url": "http://articles.courant.com/2013-10-17/news/hc-ls-cost-install-toilet-20131005_1_own-toilet-flange-plumber", "passage_text": "Generally included in the installation price are the wax ring-which seals the toilet around the drain-new anchors and a new supply line. Installing a toilet can be a do-it-yourself project, but be aware that errors can cause floor damage, leaks and other problems that may require a call to a plumber. The price can fluctuate depending on several factors, including whether you want the plumber to haul away the old toilet, whether the toilet has special features and if important plumbing components are in good condition. Our research team found that a plumber usually requires an hour or two to install a toilet."}, {"url": "http://rempros.com/installation-prices/toilet_cost.html", "passage_text": "Additional materials expenses. Cost of a new wax ring and water supply hose will range from $15 to $25 depending on type and size. Installer will add an extra $10 - $30 if toilet flange or flange extension have to be purchased. Certified installer or licensed plumber will charge $130 - $180 for labor alone to replace a standard floor mounted toilet. Local handyman can complete the work about 10% - 20% cheaper. In the price will be included old toilet removal, changing wax ring, new water supply hose and new toilet installation."}, {"url": "http://rempros.com/installation-prices/toilet_cost.html", "passage_text": "Cost to get a new toilet installed varies from $90 to $180 for labor or from $120 to $250 if additional materials have to be purchased for the proper installation. Certified installer or licensed plumber will charge $130 - $180 for labor alone to replace a standard floor mounted toilet. Local handyman can complete the work about 10% - 20% cheaper. In the price will be included old toilet removal, changing wax ring, new water supply hose and new toilet"}, {"url": "http://www.homewyse.com/services/cost_to_install_toilet.html", "passage_text": "$435.71. Get an INSTANT estimate of the cost to Install a Toilet! Our free calculator uses recent, trusted data to estimate costs for your Toilet Installation project. For a basic 1 toilet project in zip code 47474, the benchmark cost to Install a Toilet ranges between $253.00 - $435.71 per toilet. To estimate costs for your project: 1. Set Project Zip Code Enter the Zip Code for the location where labor is hired and materials purchased."}, {"url": "http://home.costhelper.com/replace-toilet.html", "passage_text": "1 CostHelper readers report paying $100-$325 for a basic toilet (without installation), at an average price of $176. 2  Specialty toilets with sleek lines, in designer colors, made to look like stone or furniture, or with options like a heated seat start at $500-$1,000 but can cost $1,000-$6,500 or more. 1 CostHelper readers report paying $100-$400 for installation, at an average cost of $198. 2  The total cost for a toilet with professional installation is typically $150-$600 depending on location and type of toilet, but it can be $700-$7,000 or more for specialty toilets and/or if additional parts and repairs are needed."}, {"url": "http://www.homeadvisor.com/cost/plumbing/install-a-toilet/", "passage_text": "On average nationally, toilet installation or replacement costs $348, with most homeowners spending between $208 and $492. This data is based on actual project costs as reported by HomeAdvisor members. Installing or replacing a toilet can positively affect your happiness, your finances and the planet. If any of your existing plumbing pipes or lines need to be repaired or modified to fit the new or replacement fixture, it will add to the cost of your project. Also, any water damage to the floor below or around the toilet area will require repairs and further increase installation costs."}]