[{"url": "http://www.protrails.com/trail/202/saguaro-national-park-wasson-peak-via-the-sendero-esperanza-and-hugh-norris-trails", "passage_text": "Directions to Trailhead. The Sendero Esperanza Trailhead is located approximately 6 miles from the Red Hills Visitor Center, 1.5 miles east of the intersection of Hohokam Road and Golden Gate Road. From Tucson, take Speedway Blvd west (it will become West Gates Pass Road) and continue west to Kinney Road."}, {"url": "http://fronimos.com/map.html", "passage_text": "3242 E Speedway Blvd Tucson, AZ 85716 (520) 327-8321 Open 10 a.m - 9 p.m. daily Fronimos Greek Cafe is east of the University of Arizona on Speedway Boulevard. It is located between Country Club Road and Alvernon Road on the south side of Speedway. Parking is behind the restaurant. View Larger Map updated November, 2014."}, {"url": "http://hikearizona.com/decoder.php?ZTN=118", "passage_text": "As with most trail systems near Tucson this is just one leg of several options. I specifically choose this trail because I have seen little information in print. From the trailhead Wasson Peak is to the south east as shown in the map below."}, {"url": "http://www.protrails.com/trail/202/saguaro-national-park-wasson-peak-via-the-sendero-esperanza-and-hugh-norris-trails", "passage_text": "1 The trail Hugh Norris Trail is named for a widely respected Tohono O'odham police chief. 2  Wasson Peak was named for John Wasson, an editor of the Tucson Citizen and unlikely appointee to the surveyor general office of the Arizona Territory in 1870."}, {"url": "http://www.century21.com/schools/tucson-az-schools/esperanza-elementary-school/O02094930-LCAZTUCSON", "passage_text": "I would stay far away from this school. Esperanza has zero spirit and that is because the principal has NO leadership skills. She doesn't like parent volunteers because you will find out how she runs the school. She is not well respected by teachers or staff and the culture at the school is extremely negative."}, {"url": "http://www.century21.com/schools/tucson-az-schools/esperanza-elementary-school/O02094930-LCAZTUCSON", "passage_text": "If you love a school where the teachers and staff are under-appreciated, then Esperanza is the place for your child. The principal does not encourage volunteering, in fact, it is just the opposite. Once valuable, time-giving parents come in, she alienates them. The pricipal has zero leadership skills."}]