[{"url": "http://www.cs.colostate.edu/helpdocs/emacs.html", "passage_text": ", is not an insertion mode editor, meaning that any character typed in. is automatically inserted into the file, unless it includes a command prefix. Commands in. are either control characters (hold down the. key while typing another character) or are prefixed by one of a set of reserved characters: or. ."}, {"url": "http://cs.brown.edu/courses/cs009/02/Linux_intro/Emacs.html", "passage_text": "Emacs (technically XEmacs) is a text editor, similar in function to a lot of word processing programs that you may have used. It has a ton of features that will help you create and edit programs in CS15."}, {"url": "https://kb.iu.edu/d/acqm", "passage_text": "In Emacs,  M-x command  means press M-x, then type the name of the command, and then press Enter. The M stands for the Meta key, which you can emulate on most keyboards by pressing the Esc key."}, {"url": "https://en.wikipedia.org/wiki/Emacs", "passage_text": "Emacs /ˈiːmaeks/ ˈiːmæks and its derivatives are a family of text editors that are characterized by their. Extensibility the manual for the most widely used, VARIANT Gnu, emacs describes it as the, extensible, customizable-self, documenting-real time display. editor"}, {"url": "https://en.wikipedia.org/wiki/Emacs", "passage_text": "The original EMACS was written in 1976 by Richard Stallman and Guy L. Steele, Jr. as a set of Editor MACroS for the TECO editor. It was inspired by the ideas of the TECO-macro editors TECMAC and TMACS. The most popular, and most ported, version of Emacs is GNU Emacs, which was created by Stallman for the GNU Project. XEmacs is a variant that branched from GNU Emacs in 1991. Both GNU Emacs and XEmacs use Emacs Lisp and are for the most part compatible with each other. Emacs is, along with vi, one of the two main contenders in the traditional editor wars of Unix culture."}, {"url": "http://searchenterpriselinux.techtarget.com/definition/Emacs", "passage_text": "Emacs (pronounced EE-maks and sometimes spelled emacs or EMACS) is a popular text editor used mainly on Unix-based systems by programmers, scientists, engineers, students, and system administrators."}]