[{"url": "http://medical-dictionary.thefreedictionary.com/sudoriferous+gland", "passage_text": "endocrine g's see endocrine glands. exocrine g's glands that discharge their secretions through ducts opening on internal or external surfaces of the body; see gland. fundic g's (fundus g's) numerous tubular glands in the mucosa of the fundus and body of the stomach that contain the cells that produce acid and pepsin. pituitary gland see pituitary gland. preputial g's small sebaceous glands of the corona of the penis and the inner surface of the prepuce, which secrete smegma; called also Littre's glands and Tyson's glands. prostate gland prostate. pyloric g's the mucin-secreting glands of the pyloric part of the stomach."}, {"url": "https://en.wikipedia.org/wiki/Sebaceous_gland", "passage_text": "The sebaceous glands are microscopic exocrine glands in the skin that secrete an oily or waxy matter, called sebum, to lubricate and waterproof the skin and hair of mammals. The sebaceous glands are found throughout all areas of the skin except the palms of the hands and soles of the feet. There are two types of sebaceous gland, those connected to hair follicles, in pilosebaceous units, and those that exist independently."}, {"url": "http://mhhe.com/biosci/ap/histology_mh/glands.html", "passage_text": "Modes of Secretion. Secretory cells of exocrine glands release their products into ducts in three different ways. The mode of secretion can be classified as merocrine, apocrine, or holocrine. Cells that secrete products via the merocrine method form membrane-bound secretory vesicles internal to the cell. In exocrine glands, products of these cells collect in the duct of the gland and flow toward the surface to which the duct is in contact. Since endocrine glands lack ducts, the product is released across the cell membrane into interstitial spaces around the cells."}, {"url": "http://medical-dictionary.thefreedictionary.com/sudoriferous+gland", "passage_text": "salivary g's see salivary glands. sebaceous gland a type of holocrine gland of the corium that secretes an oily material (sebum) into the hair follicles. Glands: The relationship of the hair follicle, eccrine and apocrine sweat glands and sebaceous glands. From Copstead, 1995. pituitary gland see pituitary gland. preputial g's small sebaceous glands of the corona of the penis and the inner surface of the prepuce, which secrete smegma; called also Littre's glands and Tyson's glands. prostate gland prostate. pyloric g's the mucin-secreting glands of the pyloric part of the stomach."}, {"url": "http://mhhe.com/biosci/ap/histology_mh/glands.html", "passage_text": "Endocrine and exocrine glands secrete various products. These include hormones, enzymes, metabolites, and other molecules. In exocrine glands, products of these cells collect in the duct of the gland and flow toward the surface to which the duct is in contact. Since endocrine glands lack ducts, the product is released across the cell membrane into interstitial spaces around the cells."}, {"url": "https://en.wikipedia.org/wiki/Sebaceous_gland", "passage_text": "In humans, they are found in the greatest number on the face and scalp, and are also found on all parts of the skin except the palms of the hands and soles of the feet. The type of secretion of the sebaceous glands is referred to as holocrine. In the eyelids, meibomian glands, also called tarsal glands, are a type of sebaceous gland that secrete a special type of sebum into tears. Fordyce spots are ectopic (misplaced) sebaceous glands found usually on the lips, gums and inner cheeks. The sebaceous glands are found throughout all areas of the skin except the palms of the hands and soles of the feet. There are two types of sebaceous gland, those connected to hair follicles, in pilosebaceous units, and those that exist independently."}, {"url": "http://www.histology.leeds.ac.uk/glandular/exocr_endocr_properties.php", "passage_text": "Some glands retain their continuity with the surface via a duct and are known as EXOCRINE GLANDS. Other glands lose this direct continuity with the surface when their ducts degenerate during development. These glands are known as ENDOCRINE glands. This is the parotid gland, a type of salivary gland. Can you identify the secretory acini and the ducts in this typical exocrine gland. The intensity of staining should tell you that the secretory cells of this gland are serous."}, {"url": "http://mhhe.com/biosci/ap/histology_mh/glands.html", "passage_text": "Glands of the body are classified as either exocrine or endocrine types. Exocrine glands are glands that retain ducts to body surfaces. During development, endocrine glands lose their contacts to embryological surfaces(ducts) and become isolated as small blocks of tissues. In exocrine glands, products of these cells collect in the duct of the gland and flow toward the surface to which the duct is in contact. Since endocrine glands lack ducts, the product is released across the cell membrane into interstitial spaces around the cells."}, {"url": "https://quizlet.com/44587042/chapter-six-the-integumentary-system-flash-cards/", "passage_text": "Sebaceous glands. - oil producing-holocrine-associated with hair follicles-sebum secreting secrete products via apoptosis-secrete products mostly onto hair follicles-lanolin-usually opens up into a hair follicle-coats the scalp hair with oil-blockage and infection can cause pimples-form of sudoriferous gland. - modified mammary glands. - sweat secreting-eccrine-merocrine-secrete products via exocytosis-apocrine-mammary glands-secrete directly onto the skin surface-secretions are 99% water and slightly acidic pH-simple tubular structures-responsible for diaphoresis-secretion of pheromones."}]