[{"url": "https://technet.microsoft.com/en-us/library/ee176998.aspx", "passage_text": "WQL is actually a subset of SQL, so if you’re familiar with SQL you’re way ahead of the game on this one. In the same way that we use If Then and For Next statements to talk to the computer in VBScript, we use specific statements to talk to WMI to retrieve objects. WMI Query Language. WMI Query Language (WQL) isn’t so much a dialect as it is a language within a language. You use a scripting language such as VBScript to access and manipulate WMI objects, but you use WQL to retrieve the exact object or objects you want to work with."}, {"url": "http://www.ravichaganti.com/blog/wmi-query-language-wql-an-introduction/", "passage_text": "WMI Query Language (WQL) – An introduction. written by Ravikanth. Windows Management Instrumentation (WMI) is the Microsoft implementation of Web-based Enterprise Management (WBEM), which is an industry initiative to develop a standard technology for accessing management information in an enterprise environment. With that background, let us now look at WMI Query Language. The WMI Query Language (WQL) is a subset of the American National Standards Institute Structured Query Language (ANSI SQL)—with minor semantic changes. Similar to SQL, WQL has a set of keywords and operators."}, {"url": "https://msdn.microsoft.com/en-us/library/aa392902(v=vs.85).aspx", "passage_text": "The WMI Query Language (WQL) is a subset of standard American National Standards Institute Structured Query Language (ANSI SQL) with minor semantic changes to support WMI. For a complete list of supported WQL keywords, see WQL (SQL for WMI) . Using SQL keywords for object or property names may restrict a query from being parsed. The following SQL keywords are restricted: NULL, TRUE, and FALSE. Note There are limits to the number of AND and OR keywords that can be used in WQL queries. Large numbers of WQL keywords used in a complex query can cause WMI to return the WBEM_E_QUOTA_VIOLATION error code as an HRESULT value. The limit of WQL keywords depends on how complex the query is"}, {"url": "http://www.darkoperator.com/blog/2013/3/11/introduction-to-wmi-basics-with-powershell-part-3-wql-and-se.html", "passage_text": "In fact WQL is Microsoft's implementation of the CIM Query Language (CQL), a query language for the Common Information Model (CIM) standard from the Distributed Management Task Force (DMTF). The query language is read only there is no INSERT or UPDATE keywords in it. In PowerShell we are not obligated to use WQL to pull information from WMI like shown in the other blog posts in the series where we queried information using Cmdlets parameters. We find that many of the examples we will see out there in Python, Perl, VBScript, C# and others actually WQL for performing their queries since there is some additional controls on what data to pull and to express the query in a more familiar way for others to understand what it is being done."}, {"url": "http://www.codeproject.com/Articles/46390/WMI-Query-Language-by-Example", "passage_text": "This is probably the WQL query most often found in various WMI articles and textbooks. It simply gets all the instances of a WMI class named Win32_Process which represents Windows processes. If you are interested in the properties of Win32_Process, see here. This is where the LIKE WQL operator comes in handy. Just like in SQL, the ‘%’ meta character replaces any string of zero or more characters, so this query returns all Win32_Service instances where the Name property contains the string SQL. Query text: WMI namespace: Root\\Cimv2."}, {"url": "https://en.wikipedia.org/wiki/WQL", "passage_text": "Windows Management Instrumentation Query Language (WQL) is Microsoft 's implementation of the CIM Query Language (CQL), a query language for the Common Information Model (CIM) standard from the Distributed Management Task Force (DMTF). It is a subset of the standard ANSI SQL with minor semantic changes. A basic WQL query remains fairly understandable for people with basic SQL knowledge. WQL is dedicated to WMI and is designed to perform queries against the CIM repository to retrieve information or get event notification"}, {"url": "https://msdn.microsoft.com/en-us/library/aa394606(v=vs.85).aspx", "passage_text": "The WMI Query Language (WQL) is a subset of the American National Standards Institute Structured Query Language (ANSI SQL)—with minor semantic changes. The following table lists the WQL keywords. Use this statement with schema and data queries. The REFERENCES OF statement is similar to the ASSOCIATORS OF statement. However, it does not retrieve endpoint instances; it retrieves the association instances."}]