[{"url": "http://www.mayoclinic.org/diseases-conditions/amyotrophic-lateral-sclerosis/basics/definition/CON-20024397", "passage_text": "ALS is often called Lou Gehrig's disease, after the famous baseball player who was diagnosed with it. ALS is a type of motor neuron disease that causes nerve cells to gradually break down and die. In the United States, ALS is sometimes called motor neuron disease. In most cases, doctors don't know why ALS occurs."}, {"url": "http://www.alsa.org/about-als/what-is-als.html", "passage_text": "ALS, or amyotrophic lateral sclerosis, is a progressive neurodegenerative disease that affects nerve cells in the brain and the spinal cord. A-myo-trophic comes from the Greek language."}, {"url": "http://www.mayoclinic.org/diseases-conditions/amyotrophic-lateral-sclerosis/basics/causes/CON-20024397", "passage_text": "Causes. In ALS, the nerve cells that control the movement of your muscles gradually die, so your muscles progressively weaken and begin to waste away. ALS is inherited in 5 to 10 percent of cases. The other cases appear to occur randomly. Researchers are studying several possible causes of ALS, including:"}, {"url": "http://www.ninds.nih.gov/disorders/amyotrophiclateralsclerosis/detail_ALS.htm", "passage_text": "Amyotrophic lateral sclerosis (ALS), sometimes called Lou Gehrig's disease, is a rapidly progressive, invariably fatal neurological disease that attacks the nerve cells (neurons) responsible for controlling voluntary muscles (muscle action we are able to control, such as those in the arms, legs, and face)."}, {"url": "http://www.asha.org/public/speech/disorders/ALS/", "passage_text": "ALS, sometimes called Lou Gehrig's disease, is a progressive brain disease that attacks the nerve cells that control muscles (motor neurons). It results in the gradual degeneration and death of motor neurons that are located in the brain, brainstem, and spinal cord."}, {"url": "http://www.medicalnewstoday.com/articles/281472.php", "passage_text": "Amyotrophic lateral sclerosis (ALS) is a progressive neurological disease that causes muscle weakness and gradually impacts on the functioning of the body, leading to eventual death. It is also referred to as motor neuron disease or Lou Gehrig's disease, named after the famous baseball player who had the condition."}, {"url": "http://www.medicalnewstoday.com/articles/281472.php", "passage_text": "ALS belongs to a group of diseases called motor neuron diseases. It is a disease that attacks the nerve cells that are used in voluntary muscle actions; actions that we can control such as those in the arms, face and legs. 4. As ALS progresses, motor neuron cells in the body degenerate and die."}, {"url": "http://www.webmd.com/brain/understanding-als-basics", "passage_text": "In the U.S., amyotrophic lateral sclerosis, or ALS, is often called Lou Gehrig's disease after the famed baseball player whose struggle with this disease and death in 1941 brought it national attention. ALS is an incurable, progressive degenerative neurological disorder. For reasons that are not understood, the nerve cells of the brain and spinal cord that control voluntary muscle movement gradually deteriorate. As a result, muscles waste away, leading to paralysis and death, usually in two to five years."}]