[{"url": "http://prescription-drug.addictionblog.org/how-much-valium-is-too-much/", "passage_text": "The recommended daily dose of Valium is 4 to 40 mg throughout the day. People have been reported taking doses of up to 2000 mg and experiencing only minor toxicity. That’s about 50 times the maximum recommended daily dose."}, {"url": "http://epilepsy.emedtv.com/diazepam/diazepam-dosing.html", "passage_text": "For most people experiencing alcohol withdrawal, diazepam dosing starts at diazepam 10 mg three or four times during the first 24 hours. After the first day, the dose is usually lowered to diazepam 5 mg three to four times daily as needed."}, {"url": "http://www.psychtreatment.com/valium_dosage.htm", "passage_text": "The usual valium dosage for convulsive disorders is 2 milligrams to 10 mg two to four times daily. Children. Valium should never be given to children under the age of six months of age. The usual Valium dosage to start children over six months old is 1 to 2.5 mg three or four times a day."}, {"url": "http://www.minddisorders.com/Del-Fi/Diazepam.html", "passage_text": "Recommended dosage. The typical dose of diazepam used to treat anxiety or seizures in healthy adults ranges from a total of 6 milligrams (mg) to 40 mg per day given in three or four doses. Elderly people (over age 60) are usually given lower doses in the range of 4–10 mg per day to treat anxiety or nervous tension."}, {"url": "http://epilepsy.emedtv.com/diazepam/diazepam-dosing.html", "passage_text": "The recommended diazepam dose for anxiety treatment is diazepam 2 mg to 10 mg two to four times daily, depending on the severity of your symptoms. Diazepam Dosing for Muscle Spasms. The recommended dose of diazepam for treating muscle spasms is diazepam 2 mg to 10 mg three or four times daily. Diazepam Dosing for Seizures. The recommended diazepam dose for controlling seizures is diazepam 2 mg to 10 mg two to four times daily. Diazepam is intended to be used along with other seizure medications."}, {"url": "http://www.rxlist.com/diazepam-injection-drug/indications-dosage.htm", "passage_text": "Dosage should be individualized for maximum beneficial effect. The usual recommended dose in older children and adults ranges from 2 mg to 20 mg I.M. or I.V., depending on the indication and its severity. In some conditions, e.g., tetanus, larger doses may be required."}, {"url": "http://www.psychtreatment.com/valium_dosage.htm", "passage_text": "Valium dosage: Recommended amount of this anti anxiety medicine for treatment of anxiety disorders or short-term relief of the symptoms of anxiety. The usual Valium dosage depending upon the severity of symptoms is between 2 mg. and 10 mg. taken two to four times daily."}]