[{"url": "http://stackoverflow.com/questions/6836566/batch-file-delete-all-files-and-folders-in-a-directory", "passage_text": "12. I want to have a batch file that will delete all the folders and files in my Cache folder for my wireless toolkit. Currently I have the following: This will delete all .db files in my RMS directory, however I want to delete every single thing from this directory. "}, {"url": "http://superuser.com/questions/653726/how-can-i-find-and-delete-all-video-files-from-all-drives-using-batch-file", "passage_text": "How can I find and delete all video files from all drives using batch file. up vote -1 down vote favorite. I want to search and delete *.mp4 *.mpeg, *.mkv, *.flv, *.avi (all video files) from all drives (C,D,E,F) or anywhere in my computer in any directory or subdirectory, using BATCH File. My operatin system is windows XP. windows windows-xp batch-file. share | improve this question. edited Oct 6 '13 at 14:12."}, {"url": "https://grumpybear.wordpress.com/2011/05/22/batch-files-to-list-all-files-and-directories-in-a-folder/", "passage_text": "The for command here is used to run a further command for each file or folder in the set. The addition of the /r switch is to tell the script to recurse all directories and subdirectories from where the script is run. The variable name %%a is used to hold the current folder being traversed. "}, {"url": "http://www.quepublishing.com/articles/article.aspx?p=1154761&seqNum=10", "passage_text": "Command. You'll often want to write batch files that process all of a certain type of file. Command-line programs can deal with filename wildcards: For example, you can type. to delete all files whose name ends with. . In batch files, you can accomplish this sort of thing with the. loop. The basic version of the. command scans through a set or list of names and runs a command once for each. The format for batch files is. where set of names is a list of words separated by spaces"}, {"url": "http://www.microsoft.com/resources/documentation/windows/xp/all/proddocs/en-us/percent.mspx", "passage_text": "Cmd.exe provides the batch parameter expansion variables %0 through %9. When you use batch parameters in a batch file, %0 is replaced by the batch file name, and %1 through %9 are replaced by the corresponding arguments that you type at the command line. You can also use modifiers with batch parameters. Modifiers use current drive and directory information to expand the batch parameter as a partial or complete file or directory name."}, {"url": "http://stackoverflow.com/questions/13764103/batch-script-to-delete-files", "passage_text": "del file name/ or *.txt etc... will delete the file in the current directory your batch is looking at, just don't add a directory path before the file name and just have the full file name or to delete multiple files with the same extension with *.txt or whatever extension you need. 5. I have a batch script as follows. The above code deletes all the .txt and .tsv files from all the folders except from the folder TEST 100% . For deleting the files from TEST 100% i am getting the error as The Path could not be found. I guess the % symbol in the folder name creates the issue"}, {"url": "http://www.wikihow.com/Delete-a-File-in-Microsoft-Windows-Using-Batch-Files", "passage_text": "Type del in Notepad (without quotes) on the new line. 8. Space once, and type the name of the folder or file along with its extension (if any) that you want to delete in quotes. . For example, deleting a folder called Delete Me means that I have to type del Delete Me. If I want to delete a file called music.wav, I type del music.wav . "}, {"url": "http://www.microsoft.com/resources/documentation/windows/xp/all/proddocs/en-us/percent.mspx", "passage_text": "mybatch.bat C:\\folder1 D:\\folder2. This has the same effect as typing the following in the batch file: xcopy C:\\folder1 \\*.* D:\\folder2. You can also use modifiers with batch parameters. Modifiers use current drive and directory information to expand the batch parameter as a partial or complete file or directory name."}, {"url": "http://jpsoft.com/help/del.htm", "passage_text": "/R. Delete files to the Windows Recycle Bin. /S. Delete the specified files in this directory and all of its subdirectories. This is like a GLOBAL DEL, and can be used to delete all the files in a subdirectory tree or even a whole disk. Do not use /S with @file lists. See @file lists for details. To erase a single file, simply enter the file name: del letters.txt. You can also erase multiple files in a single command. For example, to erase all the files in the current directory with a .BAK or."}]