[{"url": "http://study.com/academy/lesson/span-of-control-and-unity-of-command-definition-examples.html", "passage_text": "Lesson Transcript. Instructor: Shawn Grimsley. Span of control and unity of command are two important principles in management. In this lesson, you'll learn about span of control and unity of command and be provided some examples of each. A short quiz follows the lesson. Span of control refers to the number of employees a manager has under his control and will be based on such factors as type, complexity and variability of the work task managed. Unity of command is a management principle that states an employee should be answerable and responsible to only one person in the organization."}, {"url": "http://docs.unity3d.com/Documentation/Components/gui-Controls.html", "passage_text": "Toolbar. The Toolbar Control is essentially a row of Buttons. Only one of the Buttons on the Toolbar can be active at a time, and it will remain active until a different Button is clicked. This behavior emulates the behavior of a typical Toolbar. You can define an arbitrary number of Buttons on the Toolbar."}, {"url": "https://en.wikipedia.org/wiki/Control_unit", "passage_text": "For other uses, see Control unit (disambiguation) . The control unit (CU) is a component of a computer's central processing unit (CPU) that directs operation of the processor. It tells the computer's memory, arithmetic/logic unit and input and output devices how to respond to a program's instructions"}, {"url": "http://study.com/academy/lesson/unity-of-command-in-management-principle-definition-quiz.html", "passage_text": "Instructor: Shawn Grimsley. The concept of unity of command is a classic principle of management theory. In this lesson, you will learn the definition of unity of command, examine the principle and review some examples. You will also be given an opportunity to reinforce your knowledge by taking a short quiz. Unity of command is a classic principle of management that is used in many hierarchical organizations, such as the military, government agencies, and corporations. Unity of command holds that an employee should only be answerable to one person."}, {"url": "http://study.com/academy/lesson/unity-of-command-in-management-principle-definition-quiz.html", "passage_text": "Lesson Summary. Unity of command is a classic principle of management that is used in many hierarchical organizations, such as the military, government agencies, and corporations. Unity of command holds that an employee should only be answerable to one person."}]