[{"url": "http://www.medicinenet.com/irritable_bowel_syndrome_ibs/article.htm", "passage_text": "Irritable bowel syndrome (IBS) is a gastrointestinal disorder characterized by the presence of a cluster of symptoms and signs in adult or children that include cramping, abdominal pain, increased gas, altered bowel habits, food intolerance, and bloating (distention). "}, {"url": "http://www.mayoclinic.org/diseases-conditions/irritable-bowel-syndrome/basics/definition/CON-20024578", "passage_text": "Digestive Health. Subscribe to our Digestive Health e-newsletter to stay up to date on digestive health topics. Irritable bowel syndrome (IBS) is a common disorder that affects the large intestine (colon). Irritable bowel syndrome commonly causes cramping, abdominal pain, bloating, gas, diarrhea and constipation. IBS is a chronic condition that you will need to manage long term. "}, {"url": "http://www.cdc.gov/ibd/what-is-ibd.htm", "passage_text": "Inflammatory bowel disease (IBD) is a broad term that describes conditions with chronic or recurring immune response and inflammation of the gastrointestinal tract. The two most common inflammatory bowel diseases are ulcerative colitis and Crohn’s disease. Ulcerative colitis is a chronic gastrointestinal disorder that occurs in the top layers of the colon. Symptoms include. 1  Progressive loosening of the stool. 2  The stool is generally bloody and may include cramping abdominal pain and severe urgency to have a bowel movement. 3  The diarrhea may begin slowly or quite suddenly."}, {"url": "https://en.wikipedia.org/wiki/Irritable_bowel_syndrome", "passage_text": "Irritable bowel syndrome (IBS) or spastic colon is a symptom-based diagnosis. It is characterized by chronic abdominal pain, discomfort, bloating, and alteration of bowel habits. Diarrhea or constipation may predominate, or they may alternate (classified as IBS-D, IBS-C, or IBS-A, respectively). "}, {"url": "http://www.emedicinehealth.com/irritable_bowel_syndrome/article_em.htm", "passage_text": "1 Irritable bowel syndrome has also been called spastic colon, functional bowel disease, and mucous colitis. 2  However, IBS is not a true colitis.. 3  The term colitis refers to a different group of conditions known as inflammatory bowel disease (IBD). 1 Irritable bowel syndrome is a chronic (long-term) disease, and symptoms usually recur. 2  Irritable bowel syndrome (IBS) is a chronic gastrointestinal disorder of unknown cause. 3  Common symptoms include abdominal cramping or pain, bloating and gassiness, and altered bowel habits."}, {"url": "https://en.wikipedia.org/wiki/Inflammatory_bowel_disease", "passage_text": "Inflammatory bowel disease (IBD) is a group of inflammatory conditions of the colon and small intestine. Crohn's disease and ulcerative colitis are the principal types of inflammatory bowel disease. "}, {"url": "http://www.healthline.com/health/crohns-disease/ibs-vs-ibd", "passage_text": "IBS vs. IBD. When it comes to the world of gastrointestinal diseases, you may hear a lot of acronyms such as IBD and IBS. Inflammatory bowel disease (IBD) is a broad term that refers to chronic swelling (inflammation) of the intestines. It’s often confused with the non-inflammatory condition irritable bowel syndrome (IBS). Although the two disorders share similar names and some of the same symptoms, they have distinct differences. "}, {"url": "http://www.emedicinehealth.com/irritable_bowel_syndrome/article_em.htm", "passage_text": "1 Irritable bowel syndrome (IBS) is a chronic gastrointestinal disorder also called spastic colon, functional bowel disease, and mucous colitis, though it is not a true colitis. 2  Symptoms of IBS include abdominal cramping or pain, bloating and gassiness, and altered bowel habits. 1 Irritable bowel syndrome is a chronic (long-term) disease, and symptoms usually recur. 2  Irritable bowel syndrome (IBS) is a chronic gastrointestinal disorder of unknown cause. 3  Common symptoms include abdominal cramping or pain, bloating and gassiness, and altered bowel habits."}, {"url": "http://www.ncbi.nlm.nih.gov/pubmedhealth/PMH0001292/", "passage_text": "About Irritable Bowel Syndrome (IBS). Abdominal pain, constipation and diarrhea are all typical symptoms of irritable bowel syndrome (IBS). Other names for this disorder include irritable colon, mucous colitis, spastic colon or spastic colitis, and nervous stomach. Although IBS is not dangerous, the symptoms can be very painful and bothersome. Irritable Bowel Syndrome (IBS). A disorder of the intestines commonly marked by abdominal pain, bloating, and changes in a person's bowel habits. This may include diarrhea or constipation, or both, with one occurring after the other."}]