[{"url": "http://www.ducks.org/conservation/waterfowl-biology/the-incubation-period/page2", "passage_text": "The incubation period for waterfowl lasts from 21 to 31 days, and females spend from 73 to more than 99 percent of each day on the nest. In the extreme case of emperor geese, females spend as much as 99.5 percent of each day on the nest. This leaves a mere seven minutes a day for other activities such as feeding."}, {"url": "http://medical-dictionary.thefreedictionary.com/incubation+period", "passage_text": "incubation period the interval of time required for development; especially the time between invasion of the body by a pathogenic organism and appearance of the first symptoms of disease."}, {"url": "https://en.wikipedia.org/wiki/Incubation_period", "passage_text": "While latent or latency period may be synonymous, a distinction is sometimes made between incubation period, the period between infection and clinical onset of the disease, and latent period, the time from infection to infectiousness. Which is shorter depends on the disease."}, {"url": "http://medical-dictionary.thefreedictionary.com/incubation+period", "passage_text": "incubation period. the interval between effective exposure to a pathogenic infectious agent, leading to the invasion of the body and the establishment of the infection, and the appearance of the first clinical signs of the disease in question."}, {"url": "http://www.cdc.gov/training/QuickLearns/exposure/2.html", "passage_text": "The incubation period is the time from exposure to the causative agent until the first symptoms develop and is characteristic for each disease agent. Example: Shiga toxin-producing E. coli has an average incubation period of 3-4 days with a range from a minimum of 2 days to a maximum of 10 days."}, {"url": "http://www.medicinenet.com/script/main/art.asp?articlekey=18956", "passage_text": "Incubation period: In medicine, the time from the moment of exposure to an infectious agent until signs and symptoms of the disease appear. For example, the incubation period of chickenpox is 14-16 days. In biology, the incubation period is the time needed for any particular process of development to take place."}]