[{"url": "http://www.extremescience.com/deep-sea-vents.htm", "passage_text": "On the bottom of the ocean around deep-sea hydrothermal vents, there is a profusion of life that thrives on the hydrogen sulfide (H 2 S) gas released from the vents. Some of the most impressive of the creatures that live here are the giant tube-worms. Deep Sea Hydrothermal Vents. Throughout the oceans of the world there exist undersea mountain ranges, which have formed as result of volcanic activity. These are formally known as rift zones – where the movement of tectonic plates is tearing the earth’s crust apart."}, {"url": "http://www.extremescience.com/deep-sea-vents.htm", "passage_text": "A hydrothermal vent is a lot like an underwater geyser. Sea water seeps down into the cracks and fissures created by the spreading of the sea floor, sometimes as much as two or three miles into the earth’s crust. Deep Sea Hydrothermal Vents. Throughout the oceans of the world there exist undersea mountain ranges, which have formed as result of volcanic activity. These are formally known as rift zones – where the movement of tectonic plates is tearing the earth’s crust apart."}, {"url": "http://wwf.panda.org/about_our_earth/blue_planet/deep_sea/vents_seeps/", "passage_text": "At first glance, the animals inhabiting deep-sea hydrothermal vents may not seem so dissimilar to other deep-sea creatures. But in fact, they are unlike any other life on Earth. Instead of sunlight, vent life relies on hydrogen sulfide-more commonly known as rotten egg gas and toxic to most land-based life. Until recently, all life on Earth was believed to be dependent on the sun. But in the last 30 years, several new deep-sea ecosystems have been discovered that utilize an alternative source of energy. Deep-sea hydrothermal vents form as a result of volcanic activity on the ocean floor."}, {"url": "http://www.seasky.org/deep-sea/hydrothermal-vents.html", "passage_text": "Science had discovered deep-sea hydrothermal vents. These vents occur in geologically active regions of the ocean floor. Within these regions, seawater seeps down deep into the Earth's crust through cracks and fissures in the ocean floor. This water is then heated by magma below the surface. As the water is heated to a boil, it expands and rises back to the surface. "}, {"url": "http://www.divediscover.whoi.edu/expedition15/", "passage_text": "Join Expedition 15 this winter as we venture into the Pacific Ocean to examine life in some of the most extreme environments on Earth—deep-sea hydrothermal vents. These vents are like undersea geysers that form near volcanic hotspots on the ocean floor. "}, {"url": "https://en.wikipedia.org/wiki/Hydrothermal_vent", "passage_text": "Under the sea, hydrothermal vents may form features called black smokers. Relative to the majority of the deep sea, the areas around submarine hydrothermal vents are biologically more productive, often hosting complex communities fueled by the chemicals dissolved in the vent fluids. A black smoker or sea vent is a type of hydrothermal vent found on the seabed, typically in the abyssal and hadal zones. They appear as black, chimney-like structures that emit a cloud of black material."}, {"url": "https://en.wikipedia.org/wiki/Hydrothermal_vent", "passage_text": "A hydrothermal vent is a fissure in a planet's surface from which geothermally heated water issues. Hydrothermal vents are commonly found near volcanically active places, areas where tectonic plates are moving apart, ocean basins, and hotspots. A black smoker or sea vent is a type of hydrothermal vent found on the seabed, typically in the abyssal and hadal zones. They appear as black, chimney-like structures that emit a cloud of black material."}, {"url": "http://www.whoi.edu/main/topic/hydrothermal-vents", "passage_text": "Join researchers as they study the biology, geology, and chemistry of some of the deepest hydrothermal vents on Earth. Vent Larvae Cruises. A blog following the Mullineaux Lab's research cruises to study larvae at deep-sea hydrothermal vents. In the winter of 2014, Expedition 15 ventured into the Pacific Ocean to examine life in some of the most extreme environments on Earth—deep-sea hydrothermal vents."}, {"url": "http://evolution.berkeley.edu/evolibrary/article/0_0_0/origsoflife_03", "passage_text": "Support this project. Scientists are exploring several possible locations for the origin of life, including tide pools and hot springs. However, recently some scientists have narrowed in on the hypothesis that life originated near a deep sea hydrothermal vent. The chemicals found in these vents and the energy they provide could have fueled many of the chemical reactions necessary for the evolution of life. "}]