[{"url": "http://www.vdh.virginia.gov/Epidemiology/factsheets/VISA_VRSA.htm", "passage_text": "If a person touches a patient with VISA/VRSA, or touches a bandage or other material contaminated with the VISA/VRSA, he may get the bacterium on his hands. He can then spread it from his hands to another part of his body, or to another person if he touches that person."}, {"url": "http://www.vdh.virginia.gov/Epidemiology/factsheets/pdf/VISA_VRSA.pdf", "passage_text": "Vancomycin-intermediate Staphylococcus aureus (VISA) and Vancomycin-resistant Staphylococcus aureus (VRSA) January 2013 – page 2 VISA or VRSA infections can cause a range of symptoms including skin infections, abscesses, pneumonia, and infection of the heart valves, bones, or blood."}, {"url": "http://www.cdc.gov/HAI/organisms/visa_vrsa/visa_vrsa.html", "passage_text": "Staph bacteria are classified as VISA or VRSA based on laboratory tests. Laboratories perform tests to determine if staph bacteria are resistant to antimicrobial agents that might be used for treatment of infections."}, {"url": "http://www.health.state.mn.us/divs/idepc/diseases/visavrsa/index.html", "passage_text": "1 As VISA and VRSA are types of Staphylococcus aureus infection. 2  The transmission, signs and symptoms of infection, duration of illness, complications and diagnosis are the same as for Staphylococcus aureus."}, {"url": "http://www.vdh.virginia.gov/Epidemiology/factsheets/VISA_VRSA.htm", "passage_text": "Staphylococcus aureus is a bacterium commonly carried on the skin and within the nose of people. The bacterium can cause infections such as boils or pneumonia."}, {"url": "http://www.cdc.gov/HAI/organisms/visa_vrsa/visa_vrsa.html", "passage_text": "Vancomycin [van−kō−mī−sin]-intermediate Staphylococcus aureus [staff−u−lu−kaw−kus aw−ree−us] (also called VISA) and Vancomycin-resistant Staphylococcus aureus (also called VRSA) are specific types of antimicrobial-resistant bacteria."}, {"url": "http://www.cdc.gov/HAI/organisms/visa_vrsa/visa_vrsa.html", "passage_text": "Staphylococcus aureus is a bacterium commonly found on the skin and in the nose of about 30% of individuals. Most of the time, staph does not cause any harm. These infections can look like pimples, boils, or other skin conditions and most are able to be treated."}, {"url": "http://www.ok.gov/health2/documents/VISA%26VRSA.2007.pdf", "passage_text": "VISA and VRSA are specific types of Staphylococcus aureus bacteria that have become resistant to antibiotics. Vancomycin-intermediate Staphylococcus areus (VISA) is only partially resistant to the antibiotic Vancomycin. However, Vancomycin-resistant Staphylococcus areus (VRSA) is completely resistant to"}]