[{"url": "http://www.emedicinehealth.com/drug-lactobacillus_rhamnosus_gg/article_em.htm", "passage_text": "Lactobacillus rhamnosus GG is a bacteria that exists naturally in the body, primarily in the intestines. Lactobacillus rhamnosus GG helps maintain a balance of good bacteria needed to prevent the growth of harmful bacteria in the stomach and intestines. Lactobacillus rhamnosus GG has been used to treat or prevent diarrhea caused by rotavirus and other viral illnesses in babies and children. This product has also been used to treat diarrhea that can occur while taking antibiotics or while traveling to foreign countries ( traveler's diarrhea )."}, {"url": "http://www.webmd.com/vitamins-supplements/ingredientmono-790-LACTOBACILLUS.aspx?activeIngredientId=790&activeIngredientName=LACTOBACILLUS", "passage_text": "Lactobacillus is a type of bacteria. There are lots of different species of lactobacillus. These are friendly bacteria that normally live in our digestive, urinary, and genital systems without causing disease. Lactobacillus is also in some fermented foods like yogurt and in dietary supplements."}, {"url": "http://www.webmd.com/vitamins-supplements/ingredientmono-790-LACTOBACILLUS.aspx?activeIngredientId=790&activeIngredientName=LACTOBACILLUS", "passage_text": "Antibiotics are used to reduce harmful bacteria in the body. Antibiotics can also reduce friendly bacteria in the body. Lactobacillus is a type of friendly bacteria. Taking antibiotics along with lactobacillus can reduce the effectiveness of lactobacillus. To avoid this interaction take lactobacillus products at least 2 hours before or after antibiotics. There are lots of different species of lactobacillus. These are friendly bacteria that normally live in our digestive, urinary, and genital systems without causing disease. Lactobacillus is also in some fermented foods like yogurt and in dietary supplements."}, {"url": "http://www.mayoclinic.org/drugs-supplements/acidophilus/background/HRB-20058615", "passage_text": "Background. Lactobacillus acidophilus is a member of the Lactobacillus genus of bacteria. These bacteria can be found in the mouth, intestine, and vagina. L. acidophilus is thought to benefit health, since it produces vitamin K and lactase. However, L. acidophilus cannot make many other vitamins and amino acids."}, {"url": "http://www.rxlist.com/lactobacillus-page3/supplements.htm", "passage_text": "Antibiotics are used to reduce harmful bacteria in the body. Antibiotics can also reduce friendly bacteria in the body. Lactobacillus is a type of friendly bacteria. Taking antibiotics along with lactobacillus can reduce the effectiveness of lactobacillus. To avoid this interaction, take lactobacillus products at least 2 hours before or after antibiotics. Lactobacillus contains live bacteria and yeast"}, {"url": "http://www.healthline.com/health/what-is-lactobacillus-probiotic", "passage_text": "Where to Get It. Lactobacillus acidophilus and other probiotics are found in some fermented foods, such as yogurt, kefir, soy products, and pickles. You can also buy probiotic supplements in liquid, tablet, or powder form. Eating yogurt is often recommended for people who are lactose intolerant. Lactobacillus acidophilus is one of the probiotics in yogurt that’s responsible for “pre-digesting” the lactose, which makes it easier to digest. To find out if a yogurt brand has Lactobacillus acidophilus, look for the bacteria name in the ingredient list."}, {"url": "http://www.webmd.com/vitamins-supplements/ingredientmono-790-LACTOBACILLUS.aspx?activeIngredientId=790&activeIngredientName=LACTOBACILLUS", "passage_text": "1 Preventing diarrhea due to traveling. 2  Traveler’s diarrhea is caused by bacteria, viruses, or parasites that the traveler has not been exposed to before. 3  Taking a specific strain of Lactobacillus rhamnosus, Lactobacillus GG (Culturelle) seems to help prevent diarrhea in travelers. There are lots of different species of lactobacillus. These are friendly bacteria that normally live in our digestive, urinary, and genital systems without causing disease. Lactobacillus is also in some fermented foods like yogurt and in dietary supplements."}, {"url": "http://www.livestrong.com/article/84144-culturelle/", "passage_text": "Culturelle aims to restore balance in your body's digestive system by replenishing the gut with over 10 billion bacteria per one daily capsule. Culturelle and its contents, Lactobacillus GG, have been the focus of numerous clinical research studies. Rosemary J. Young, R.N., M.S. at the University of Nebraska Medical Center, has overseen many clinical trials which have proven the effectiveness of Lactobacillus GG. Culturelle is available as an oral capsule containing Lactobacillus GG encapsulated in a cellulose gelatin. Each capsule is individually wrapped in protective foil, and capsules can be stored at room temperature, in the refrigerator or the freezer."}, {"url": "http://www.healthline.com/health/what-is-lactobacillus-probiotic", "passage_text": "Not all types of bacteria are bad for you. In fact, your body needs a certain amount of bacteria to function properly. Lactobacillus acidophilus is a form of bacteria that’s found naturally in the body, usually in the intestines, mouth, or female genitals. It’s considered beneficial to human health because the bacteria doesn’t cause disease. Lactobacillus acidophilus is one of the probiotics in yogurt that’s responsible for “pre-digesting” the lactose, which makes it easier to digest. To find out if a yogurt brand has Lactobacillus acidophilus, look for the bacteria name in the ingredient list."}]