[{"url": "https://en.wikipedia.org/wiki/Fiberglass", "passage_text": "To be used in fiberglass, glass fibers have to be made with very low levels of defects. Fiberglass is a strong lightweight material and is used for many products. Although it is not as strong and stiff as composites based on carbon fiber, it is less brittle, and its raw materials are much cheaper. The glass fiber may be randomly arranged, flattened into a sheet (called a chopped strand mat), or woven into a fabric. The plastic matrix may be a thermosetting plastic – most often epoxy, polyester resin – or vinylester, or a thermoplastic."}, {"url": "http://www.compositesworld.com/zones/glass-fiber", "passage_text": "Overview The vast majority of all fibers used in the composites industry are glass. Glass fibers are the oldest and, by far, the most common reinforcement used in nonaerospace applications to replace heavier metal parts. Glass weighs more than carbon, but also is more impact-resistant."}, {"url": "https://en.wikipedia.org/wiki/Glass_fiber", "passage_text": "Glass fiber when used as a thermal insulating material, is specially manufactured with a bonding agent to trap many small air cells, resulting in the characteristically air-filled low-density glass wool family of products. The first type of glass used for fiber was soda lime glass or A-glass (A for the alkali it contains). It is not very resistant to alkali. A new type, E-glass, was formed; this is an alumino-borosilicate glass that is alkali This was the first glass formulation used for continuous filament formation."}, {"url": "http://www.compositesworld.com/zones/glass-fiber", "passage_text": "Zone: Glass Fiber. The vast majority of all fibers used in the composites industry are glass. Glass fibers are the oldest and, by far, the most common reinforcement used in nonaerospace applications to replace heavier metal parts. Glass weighs more than carbon, but also is more impact-resistant."}, {"url": "https://en.wikipedia.org/wiki/Glass_fiber", "passage_text": "Glass fiber (or glass fibre) is a material consisting of numerous extremely fine fibers of glass. Glassmakers throughout history have experimented with glass fibers, but mass manufacture of glass fiber was only made possible with the invention of finer machine tooling. The first type of glass used for fiber was soda lime glass or A-glass (A for the alkali it contains). It is not very resistant to alkali. A new type, E-glass, was formed; this is an alumino-borosilicate glass that is alkali This was the first glass formulation used for continuous filament formation."}, {"url": "https://en.wikipedia.org/wiki/Glass_fiber", "passage_text": "Glass fibers can also occur naturally, as Pele's hair. Glass wool, which is one product called fiberglass today, was invented in 1932–1933 by Russell Games Slayter of Owens-Corning, as a material to be used as thermal building insulation. The first type of glass used for fiber was soda lime glass or A-glass (A for the alkali it contains). It is not very resistant to alkali. A new type, E-glass, was formed; this is an alumino-borosilicate glass that is alkali This was the first glass formulation used for continuous filament formation."}, {"url": "https://en.wikipedia.org/wiki/Fiberglass", "passage_text": "For the thermal insulation material sometimes called fiberglass, see glass wool. For the glass fiber itself, also sometimes called fiberglass, see glass fiber. For similar composite materials in which the reinforcement fiber is carbon fibers, see carbon-fiber-reinforced polymer. The glass fiber may be randomly arranged, flattened into a sheet (called a chopped strand mat), or woven into a fabric. The plastic matrix may be a thermosetting plastic – most often epoxy, polyester resin – or vinylester, or a thermoplastic."}, {"url": "https://en.wikipedia.org/wiki/Glass_fiber", "passage_text": "Composition. The most common types of glass fiber used in fiberglass is E-glass, which is alumino-borosilicate glass with less than 1% w/w alkali oxides, mainly used for glass-reinforced plastics. The first type of glass used for fiber was soda lime glass or A-glass (A for the alkali it contains). It is not very resistant to alkali. A new type, E-glass, was formed; this is an alumino-borosilicate glass that is alkali This was the first glass formulation used for continuous filament formation."}, {"url": "https://en.wikipedia.org/wiki/Fiberglass", "passage_text": "Composition. The most common types of glass fiber used in fiberglass is E-glass, which is alumino-borosilicate glass with less than 1% w/w alkali oxides, mainly used for glass-reinforced plastics. The glass fiber may be randomly arranged, flattened into a sheet (called a chopped strand mat), or woven into a fabric. The plastic matrix may be a thermosetting plastic – most often epoxy, polyester resin – or vinylester, or a thermoplastic."}]