[{"url": "https://en.wikipedia.org/wiki/Jackdaw", "passage_text": "The western jackdaw is found from north-west Africa through all of Europe, except for the extreme north, and eastwards through central Asia to the eastern Himalayas and Lake Baikal. To the east, it occurs throughout Turkey, the Caucasus, Iran, Iraq, Afghanistan, Pakistan, and north-west India. The common name jackdaw first appeared in the 16th century, and is thought to be a compound of the forename Jack, used in animal names to signify a small form (e.g. jack snipe), and the archaic native English word daw. Formerly, western jackdaws were simply called daws."}, {"url": "http://www.answers.com/Q/What_is_a_group_of_jackdaws_called", "passage_text": "The word Harem is Hebrew for forbidden, so the word is not specifying man or woman. It was however used to describe the quarters of women as being Harem or forbidden. The men … who had women as slaves, servants, and wives owned them as property so they were also considered Harem property. If you are talking about the collective noun for men and women the word for a group of women is a gaggle of women. For men it is a band of men.62 people found this useful."}, {"url": "http://www.bbc.co.uk/nature/life/Jackdaw", "passage_text": "Jackdaw. Diminutive members of the crow family, jackdaws are renowned for their love-and often theft-of bright, shiny objects. Herein might lie the origins of their common name, as 'jack' is used traditionally to denote something smaller than the norm, and also to refer to a rogue or thief. In both cases the jackdaw doesn't disappoint."}, {"url": "https://en.wikipedia.org/wiki/Jackdaw", "passage_text": "The western jackdaw (Corvus monedula), also known as the Eurasian jackdaw, European jackdaw, or simply jackdaw, is a passerine bird in the crow family. Found across Europe, western Asia and North Africa, it is mostly resident, although northern and eastern populations migrate south in winter. The common name jackdaw first appeared in the 16th century, and is thought to be a compound of the forename Jack, used in animal names to signify a small form (e.g. jack snipe), and the archaic native English word daw. Formerly, western jackdaws were simply called daws."}, {"url": "http://corvidcorner.com/wordpress/tag/what-is-a-group-of-jackdaws-called/", "passage_text": "A group of birds…. Posted by Magpie in Collective Noun Names, Group Names, Names for groups of corvids On April 19, 2009. It is all in a name…groups of birds have different names. Here are some of the corvidae group names: A group of Jays are called a band, a scold or a party of jays. A group of Magpies are. Read More."}, {"url": "https://uk.answers.yahoo.com/question/index?qid=20090702082812AALES6r", "passage_text": "An archaic collective noun for a group of jackdaws is a clattering.. Another term used is train (White 1833); however, in practice, most people use the more generic term flock.. Source(s): http://www.newworldencyclopedia.org/entr... "}, {"url": "https://en.wikipedia.org/wiki/Jackdaw", "passage_text": "Measuring 34–39 centimetres (13–15 in) in length, the western jackdaw is a black-plumaged bird with a grey nape and distinctive pale-grey irises. It is gregarious and vocal, living in small groups with a complex social structure in farmland, open woodland, on coastal cliffs, and in urban settings. The common name jackdaw first appeared in the 16th century, and is thought to be a compound of the forename Jack, used in animal names to signify a small form (e.g. jack snipe), and the archaic native English word daw. Formerly, western jackdaws were simply called daws."}, {"url": "http://corvidcorner.com/wordpress/2009/04/a-group-of-birds/", "passage_text": "It is all in a name…groups of birds have different names. Here are some of the corvidae group names: 1  A group of Jays are called a band, a scold or a party of jays. 2  A group of Magpies are called a tiding(s), a charm, a flock, a gulp, a murder, a mischief, a tittering, a conventicle, a tribe, or a congregation of magpies. 1 A group of Rooks are called a building, a parliament or a clamour of rooks. 2  A group of Nutcrackers are called a ballet, a booby, a jar or a suite of nutcrackers. 3  A group of Choughs are called a clattering or a chattering of choughs."}]