[{"url": "http://my.clevelandclinic.org/health/transcripts/1203_colonoscopy-ask-the-expert-everything-you-want-to-know-but-are-afraid-to-ask", "passage_text": "1 It depends on your risk. 2  If you are 50 years or older with no family history or personal history of polyps or cancer, then the first colonoscopy should be at 50. 3  If you are African American, your screening colonoscopy should start at age 45. 4  If that is normal, you should have one every eight years afterward. 1 If you are 50 years or older with no family history or personal history of polyps or cancer, then the first colonoscopy should be at 50. 2  If you are African American, your screening colonoscopy should start at age 45. 3"}, {"url": "http://www.tbo.com/health/when-should-i-have-another-colonoscopy-20130928/", "passage_text": "How often you have a colonoscopy depends on what was found during your first one. If no polyps or only non-cancerous ones were found, you won’t need another one for 10 years — unless you experience symptoms or your family history warrants more frequent exams. If necessary, tissue samples will be collected (biopsy) and abnormal growths (polyps) will be removed during the procedure. Usually, 30 to 40 percent of patients undergoing a colonoscopy have polyps that need to be removed."}, {"url": "http://my.clevelandclinic.org/health/transcripts/1203_colonoscopy-ask-the-expert-everything-you-want-to-know-but-are-afraid-to-ask", "passage_text": "1 If you have had colon cancer already, you need a colonoscopy every three years. 2  If you have had precancerous polyps in your colon, you need regular colonoscopies, the frequency of which is determined by the number and size of the polyps. 1 If you are 50 years or older with no family history or personal history of polyps or cancer, then the first colonoscopy should be at 50. 2  If you are African American, your screening colonoscopy should start at age 45. 3  If that is normal, you should have one every eight years afterward."}, {"url": "http://www.livestrong.com/article/18444-should-one-colonoscopy/", "passage_text": "Colonoscopy should be repeated every 5 years in this situation. Screening prior to age 50 may also be warranted for people who are obese or have a history of heavy smoking. Discuss a more advanced screening schedule with your doctor if you believe you are at increased risk. The American College of Gastroenterology further advises that African-Americans begin screening at age 45 due to increased risk. Colonoscopy allows visualization of the rectum and the entire length of the colon and should be repeated every 10 years."}, {"url": "https://www.sharecare.com/health/colonoscopy-diagnosis-colon-cancer/how-often-have-colonoscopy", "passage_text": "African-Americans or those with a family history of colon cancer should schedule their first colonoscopy at age 45. If your initial colonoscopy is clear and there are no polyps detected, you should schedule your next colonoscopy in 10 years. However if polyps are detected during your colonoscopy, your physician will recommend you follow up within 1-5 years, depending on the type of polyp. After that, and without any symptoms, the next colonoscopy should be 5-10 years later. For high-risk patients (personal or family history of colon cancer, certain genetic disorders) colonoscopy may need to be earlier and more frequent."}, {"url": "http://www.livestrong.com/article/18444-should-one-colonoscopy/", "passage_text": "Certain factors increase your risk for colorectal cancer and may call for earlier or more frequent screening. People with a close relative diagnosed with colorectal cancer before age 60 should begin screening at age 40 -- or 10 years earlier than the age the relative developed cancer. The American College of Gastroenterology further advises that African-Americans begin screening at age 45 due to increased risk. Colonoscopy allows visualization of the rectum and the entire length of the colon and should be repeated every 10 years."}, {"url": "http://www.cancer.org/cancer/colonandrectumcancer/moreinformation/colonandrectumcancerearlydetection/colorectal-cancer-early-detection-acs-recommendations", "passage_text": "People with small rectal hyperplastic polyps. Same age as those at average risk. Colonoscopy, or other screening options at same intervals as for those at average risk. Those with hyperplastic polyposis syndrome are at increased risk for adenomatous polyps and cancer and should have more intensive follow-up. People with 1 or 2 small (less than 1 cm) tubular adenomas with low-grade dysplasia. Colorectal cancer or adenomatous polyps in any first-degree relative before age 60, or in 2 or more first-degree relatives at any age (if not a hereditary syndrome). Age 40, or 10 years before the youngest case in the immediate family, whichever is earlier. Colonoscopy. Every 5 years."}, {"url": "https://www.sharecare.com/health/colonoscopy-diagnosis-colon-cancer/how-often-have-colonoscopy", "passage_text": "You should have a colonoscopy every 10 years starting at age 50. Alternatively, you may get a flexible sigmoidoscopy every five years, a double-contrast barium enema every five years or a CT colonography (virtual colonoscopy) every five years. However, a colonoscopy will be needed if any of those results are positive. After that, and without any symptoms, the next colonoscopy should be 5-10 years later. For high-risk patients (personal or family history of colon cancer, certain genetic disorders) colonoscopy may need to be earlier and more frequent."}, {"url": "http://www.choosingwisely.org/patient-resources/colonoscopy/", "passage_text": "Ask your doctor when and how often to have a colonoscopy if you have inflammatory bowel disease; a history of multiple, large, or high-risk adenomas; or a parent, sibling, or child who had colorectal cancer or adenomas. Routine checks usually aren’t needed after age 75. "}, {"url": "http://www.cancerresearchuk.org/about-cancer/type/bowel-cancer/about/screening/who-is-screened-for-bowel-cancer", "passage_text": "Your doctor may suggest you have a colonoscopy every 5 years. But if you then have a colonoscopy that finds no polyps at all, you may be able to stop this screening. If you've had 3 or 4 polyps, or at least one that was more than 1cm across, you have a moderate (intermediate) risk of bowel cancer. Polyps in the bowel. If you have had polyps removed from your bowel in the past, your doctor may suggest that you have a sigmoidoscopy or colonoscopy every so often. This is to pick up any more polyps before they develop into an invasive cancer."}]