[{"url": "https://en.wikipedia.org/wiki/Macrocytic_anemia", "passage_text": "In contrast, in microcytic anemia, the erythrocytes are smaller than normal. In a macrocytic anemia the larger red cells are always associated with insufficient numbers of cells and often also insufficient hemoglobin content per cell. Both of these factors work to the opposite effect of larger cell size, to finally result in a total blood hemoglobin concentration that is less than normal (i.e., anemia). Macrocytic anemia is not a disease in the sense of having a single pathology, but is rather a condition."}, {"url": "http://emedicine.medscape.com/article/203858-overview", "passage_text": "Therefore, if the increase in MCV is not related to macrocytic anemia, the mean cell hemoglobin concentration (MCHC) also increases in proportion. Causes of macrocytosis are many and range from benign to malignant; thus, a complete workup to determine etiology is essential. Vitamin B-12 deficiency is a cause of macrocytosis. Because DNA synthesis requires cyanocobalamin (vitamin B-12) as a cofactor, a deficiency of the vitamin leads to decreased DNA synthesis in the erythrocyte, thus resulting in"}, {"url": "http://study.com/academy/lesson/macrocytic-anemia-definition-and-causes.html", "passage_text": "A subtype of macrocytic anemia occurs with a normal RDW. One of the reasons for this is something known as aplastic anemia. Aplastic anemia refers to a disease where the bone marrow doesn't make enough red blood cells. If both RDW and MCV are elevated, the cause for the anemia may be autoimmune hemolytic anemia, liver disease, or a deficiency in folate, vitamin B9, or cobalamin, vitamin B12. "}, {"url": "http://www.emedicinehealth.com/anemia/article_em.htm", "passage_text": "1 The major causes of this type are iron deficiency (low level iron) anemia and thalassemia (inherited disorders of hemoglobin). 2  If the red blood cells size are normal in size (but low in number), this is called normocytic anemia, such as anemia that accompanies chronic disease or anemia related to kidney disease. 1 If the red blood cells size are normal in size (but low in number), this is called normocytic anemia, such as anemia that accompanies chronic disease or anemia related to kidney disease. 2  If red blood cells are larger than normal, then it is called macrocytic anemia."}, {"url": "http://www.myhealthyfeeling.com/macrocytic-anemia-causes-symptoms-treatment/", "passage_text": "Sponsored link. Macrocytic anemia is a medical condition characterized by the enlargement of red blood cells with lower hemoglobin levels necessary to carry the oxygen all over the body. "}, {"url": "http://emedicine.medscape.com/article/203858-overview", "passage_text": "Pathophysiology. The most common cause of macrocytic anemia is megaloblastic anemia, which is the result of impaired DNA synthesis. Although DNA synthesis is impaired, RNA synthesis is unaffected, leading to a buildup of cytoplasmic components in a slowly dividing cell. This results in a larger-than-normal cell. Vitamin B-12 deficiency is a cause of macrocytosis. Because DNA synthesis requires cyanocobalamin (vitamin B-12) as a cofactor, a deficiency of the vitamin leads to decreased DNA synthesis in the erythrocyte, thus resulting in"}, {"url": "https://en.wikipedia.org/wiki/Macrocytic_anemia", "passage_text": "A macrocytic class of anemia is an anemia (defined as blood with an insufficient concentration of hemoglobin) in which the red blood cells (erythrocytes) are larger than their normal volume. The normal erythrocyte volume in humans is about 80 to 100 femtoliters (fL= 10 −15 L). Both of these factors work to the opposite effect of larger cell size, to finally result in a total blood hemoglobin concentration that is less than normal (i.e., anemia). Macrocytic anemia is not a disease in the sense of having a single pathology, but is rather a condition."}, {"url": "http://www.merckmanuals.com/professional/hematology-and-oncology/anemias-caused-by-deficient-erythropoiesis/megaloblastic-macrocytic-anemias", "passage_text": "The most common causes of megaloblastic, macrocytic anemia are deficiency or defective utilization of vitamin B 12 or folate. Do CBC, RBC indices, reticulocyte count, and peripheral smear; do vitamin B 12 and folate levels in patients with characteristic findings. Treat the cause. "}]