[{"url": "https://answers.yahoo.com/question/index?qid=20070916050358AA7Vl2d", "passage_text": "Best Answer: No-you need the ssn to get the passport, but as long as you don't mind being on hold for quite a while, you can call SS with all your info (your ssn, dads ssn, birth info) and get the number after about 6 weeks."}, {"url": "http://blogs.angloinfo.com/us-tax/2013/02/18/renewing-your-us-passport-beware-state-department-turns-over-your-social-security-number-location-to-the-irs/", "passage_text": "The US passport renewal form mandates that the applicant supply his Social Security Number (SSN) if he has one. http://www.state.gov/documents/organization/79960.pdf. This is authorized by Internal Revenue Code Section 6039E, enacted in 1986."}, {"url": "http://www.us-passport-service-guide.com/getting-passports-for-infants.html", "passage_text": "(Auburn Me). Answer: Although a Social Security number is not required for issuance of a passport, Section 6039E of the Internal Revenue Code (26 U.S.C. 6039E) requires all applicants to provide their Social Security Number (SSN). If the minor has one when you apply for the U.S. passport, it must be provided."}, {"url": "http://expatriates.stackexchange.com/questions/2783/is-a-social-security-number-required-to-apply-for-a-usa-child-passport", "passage_text": "Failure to provide information requested on the form, including your social security number, may result in significant processing delays and/or the denial of your application. According to the DS-11 form and instructions a US citizen is required to provide one if they have it."}, {"url": "http://expatriates.stackexchange.com/questions/2783/is-a-social-security-number-required-to-apply-for-a-usa-child-passport", "passage_text": "It is possible to fill out the form without one: Section 6039E of the Internal Revenue Code (26 U.S.C. 6039E) requires you to provide your Social Security number (SSN), if you have one, when you apply for or renew a U.S. passport. If you have not been issued a SSN, enter zeros in box #5 of this form."}, {"url": "https://www.artiopartners.com/late/us-passport-american-expat-taxes/", "passage_text": "Moreover, the State Department must provide a social security number (SSN) of US passport applicant as well as the foreign residence of American expatriates. This fact is a worrisome issue for American expats who are behind on US expat taxes."}, {"url": "http://www.uspassportnow.com/faq/new_ssn", "passage_text": "Section 6039E of the Internal Revenue Code (26 U.S.C. 6039E) requires you to provide your Social Security Number (SSN), if you have one, when you apply for a U.S. passport or renewal of a U.S. passport. If you have not been issued a SSN, enter zeros in box 5 of the passport application form you are completing."}]