[{"url": "http://www.travelmath.com/drive-distance/from/Barcelona,+Spain/to/Madrid,+Spain", "passage_text": "Driving distance from Barcelona, Spain to Madrid, Spain. The total driving distance from Barcelona, Spain to Madrid, Spain is 387 miles or 623 kilometers. Your trip begins in Barcelona, Spain. It ends in"}, {"url": "http://www.travelmath.com/driving-time/from/Barcelona,+Spain/to/Madrid,+Spain", "passage_text": "More trip calculations. 1  driving distance from Barcelona, Spain to Madrid, Spain. 2  cost to drive from Barcelona, Spain to Madrid, Spain. 3  reverse driving time from Madrid, Spain to Barcelona, Spain. 4  halfway between Barcelona, Spain and Madrid, Spain. 5  places to stop"}, {"url": "http://www.answers.com/Q/How_long_is_the_drive_from_Barcelona_Spain_to_Paris_France", "passage_text": "Making the world better, one answer at a time. The driving distance between Barcelona, Spain and Paris, France is approximately 1040 km. The driving time would be approximately 10 hours if you were to drive non-stop in good driving conditions."}, {"url": "http://www.travelmath.com/driving-time/from/Barcelona,+Spain/to/Madrid,+Spain", "passage_text": "You can also calculate the cost to drive from Barcelona, Spain to Madrid, Spain based on current local gas prices and an estimate of your car's best gas mileage. If you're meeting a friend, you might be interested in finding the city that is halfway between Barcelona, Spain and Madrid, Spain."}, {"url": "http://www.distances-calculator.com/distances-for-barcelona-to-madrid.htm", "passage_text": "The approx distance between Barcelona and Madrid in a straight line is 313 miles or 503.62 KMS See the maps and links below for additional information related to driving distances, fuel costs and estimated journey times for this trip from Barcelona to Madrid. Happy trails!! Advertisements: ."}, {"url": "http://www.travelmath.com/driving-time/from/Barcelona,+Spain/to/Madrid,+Spain", "passage_text": "How long is the drive from Barcelona, Spain to Madrid, Spain? The total driving time is 6 hours."}, {"url": "http://www.spaintravelguide.com/getting-from-madrid-to-barcelona.html", "passage_text": "The driving distance between Madrid and Barcelona is about 600 km. Depending on your driving style, you can reach the destination in about 6.5 hours. The main route is A2 highway (also called Barcelona Road) via Zaragoza."}]