[{"url": "http://medical-dictionary.thefreedictionary.com/pupillary+reflex", "passage_text": "2. any reflex involving the iris, resulting in change in the size of the pupil, occurring in response to various stimuli, e.g., change in illumination or point of fixation, sudden loud noise, or emotional stimulation. quadriceps reflex knee jerk. quadrupedal extensor reflex Brain's reflex."}, {"url": "http://medical-dictionary.thefreedictionary.com/pupillary+reflex", "passage_text": "1. contraction of the pupil on exposure of the retina to light. 2. any reflex involving the iris, resulting in change in the size of the pupil, occurring in response to various stimuli, e.g., change in illumination or point of fixation, sudden loud noise, or emotional stimulation. quadriceps reflex knee jerk. quadrupedal extensor reflex Brain's reflex."}, {"url": "http://www.answers.com/Q/How_does_the_pupil_shrinking_reflex_protect_the_eye", "passage_text": "The pupil is the dark circle at the center of  your eye. It is surrounded by the iris, which is the colored part  of your eye.   The pupil allows light to enter the eye. … Light  enters through the pupil, passes through the lens, and is focused  onto the retina. The retina is the back part of the eye that has  the receptors that interpret what you see."}, {"url": "http://www.audioenglish.org/dictionary/pupillary_reflex.htm", "passage_text": "The noun PUPILLARY REFLEX has 1 sense: 1. reflex contraction of the sphincter muscle of the iris in response to a bright light (or certain drugs) causing the pupil to become smaller. Familiarity information: PUPILLARY REFLEX used as a noun is very rare. Dictionary entry details."}, {"url": "http://www.thefreedictionary.com/pupillary+reflex", "passage_text": "pupillary reflex-reflex contraction of the sphincter muscle of the iris in response to a bright light (or certain drugs) causing the pupil to become smaller. light reflex, miosis, myosis."}, {"url": "http://www.thefreedictionary.com/pupillary+reflex", "passage_text": "Noun. 1. pupillary reflex-reflex contraction of the sphincter muscle of the iris in response to a bright light (or certain drugs) causing the pupil to become smaller. light reflex, miosis, myosis."}]