[{"url": "http://www.biology4kids.com/files/cell_centriole.html", "passage_text": "A centriole is a small set of microtubules arranged in a specific way. There are nine groups of microtubules. When two centrioles are found next to each other, they are usually at right angles. The centrioles are found in pairs and move towards the poles (opposite ends) of the nucleus when it is time for cell division. During prophase, the centrioles move to opposite ends of the nucleus and a mitotic spindle of threads begins to appear. Those threads then connect to the now apparent chromosomes. During anaphase, the chromosomes are split and pulled towards each centriole."}, {"url": "http://www.thefreedictionary.com/centrosome", "passage_text": "Noun. 1. centrosome-small region of cytoplasm adjacent to the nucleus; contains the centrioles and serves to organize the microtubules. central body. cytol, cytoplasm-the protoplasm of a cell excluding the nucleus; is full of proteins that control cell metabolism. 1  Facebook. "}, {"url": "https://en.wikipedia.org/wiki/Centrosome", "passage_text": "Role of the centrosome in cell cycle progression. Centrosomes are associated with the nuclear membrane during prophase of the cell cycle. In mitosis the nuclear membrane breaks down and the centrosome nucleated microtubules (parts of the cytoskeleton) can interact with the chromosomes to build the mitotic spindle. The centrosome replicates during the S phase of the cell cycle. During the prophase in the process of cell division called mitosis, the centrosomes migrate to opposite poles of the cell. The mitotic spindle then forms between the two centrosomes. Upon division, each daughter cell receives one centrosome."}, {"url": "http://biology.about.com/od/mitosisglossary/g/centromere.htm", "passage_text": "Definition: A centromere is a region on a chromosome that joins two sister chromatids. In prophase of mitosis, specialized regions on centromeres called kinetochores attach chromosomes to spindle polar fibers. These fibers help to manipulate and separate chromosomes during cell division. "}, {"url": "http://www.yourdictionary.com/centrosome", "passage_text": "Use centrosome in a sentence. a very small body near the nucleus in most animal cells, consisting of a centriole surrounded by a centrosphere: in mitosis it divides, and the two parts move to opposite poles of the dividing cell. centro- + -some. "}, {"url": "https://simple.wikipedia.org/wiki/Centrosome", "passage_text": "In cell biology, the centrosome is an organelle that is the main place where cell microtubules get organised. They occur only in animal cells. Also, it regulates the cell division cycle, the stages which lead up to cell division. "}, {"url": "http://4to40.com/science/index.asp?p=Centriole_Function", "passage_text": "Centriole is the part of the cell, which acts as the center for producing microtubules, which are the component of cytoskeleton. Cytoskeleton is the skeleton of the cell that provides both shape and structure to a cell. Animal cells contain 2 centrioles, which together form the structure, centrosome. In other words, the centrioles are found within the centrosomes, which is a small region in the cytoplasm near the nucleus. Within the centrosomes, the two centrioles are positioned in such a way that both are perpendicular to each other."}, {"url": "http://kids.britannica.com/comptons/article-234339/cell", "passage_text": "The Web's Best Sites. Centriole. The centrosome is a spherical structure located near the nucleus of eukaryote cells. During the early phases of cell division, or mitosis, the centrosome replicates, resulting in two identical centrosomes that travel to opposite ends of the cell. In animal, fungal, and algal cells, the centrosomes contain a pair of structures called centrioles that produce microtubules. cell... (75 of 39476 words)."}, {"url": "http://www.merriam-webster.com/dictionary/centriole", "passage_text": "Medical Definition of CENTRIOLE. : one of a pair of cellular organelles that occur especially in animals, are adjacent to the nucleus, function in the formation of the spindle apparatus during cell division, and consist of a cylinder with nine microtubules arranged peripherally in a circle."}, {"url": "http://www.academickids.com/encyclopedia/index.php/Centriole", "passage_text": "Two centrioles are arranged perpendicularly in the centre of the centrosome. Centrioles are important in the cell division process, organizing the mitotic spindle upon which the chromosomes are pulled apart. Some animal cells may be able to divide their chromosomes without centrioles, for instance in female meiosis."}]