[{"url": "http://animals.nationalgeographic.com/animals/mammals/giraffe/", "passage_text": "Giraffes are the world's tallest mammals, thanks to their towering legs and long necks. A giraffe's legs alone are taller than many humans—about 6 feet (1.8 meters). These long legs allow giraffes to run as fast as 35 miles (56 kilometers) an hour over short distances and cruise comfortably at 10 miles (16 kilometers) an hour over longer distances. Giraffes only need to drink once every several days; they get most of their water from the luscious plants they eat. Female giraffes give birth standing up. Their young endure a rather rude welcome into the world by falling more than 5 feet (1.5 meters) to the ground at birth."}, {"url": "http://www.livescience.com/27336-giraffes.html", "passage_text": "With such a massive body, it makes sense that the giraffes' organs and other body parts are equally huge. Their tongues are a substantial 21 inches (53 centimeters) long, and their feet are 12 inches (30.5 cm) across. According to the San Diego Zoo, a giraffe's heart is 2 feet (0.6 m) long and weighs about 25 lbs. "}, {"url": "http://www.answers.com/Q/How_much_pounds_of_food_does_a_giraffe_eat_each_day", "passage_text": "How much do giraffes eat in a day? A giraffe eats around 65 pounds (around 30 kilos) of vegetation daily, but during lean periods, they can survive with around 15 pounds."}, {"url": "http://www.answers.com/Q/How_much_pounds_of_food_does_a_giraffe_eat_each_day", "passage_text": "A giraffe can eat 63kg (140 lb) of leaves and twigs daily. As ruminants, they first chew their food, swallow for processing and then visibly regurgitate the semi-digested cud up their necks and back into the mouth, in order to chew again. A giraffe eats around 65 pounds (around 30 kilos) of vegetation daily, but during lean periods, they can survive with around 15 pounds."}, {"url": "http://animals.mom.me/feeding-schedule-giraffe-3141.html", "passage_text": "A giraffe's feeding schedule is relatively consistent -- that is, he's consistently eating. Giraffes eat as much as 75 pounds of food every day, most of which consists of leaves, so they spend a considerable amount of time chowing down. They're grazers, so they eat throughout the day rather than in large meals. What They Eat. Giraffes use their long necks to reach the tasty leaves atop tall trees that other animals often can't access. A staple of the giraffe's diet is the acacia leaf, which grows on thorny trees that are too treacherous for animals that don't share the giraffe's distinct evolutionary advantages."}, {"url": "http://animalstime.com/what-giraffes-eat/", "passage_text": "A male giraffe is known to eat 145 (66 kg) food each day when favorable conditions are there for feeding. However in periods of poor-quality giraffes feed as little as 15 lb (7kg). They have four-chambered stomachs and they can chew while walking that indeed facilitates feeding opportunities. Giraffes are absolute browsers as they spend most of their time eating broad-leaved deciduous foliage in the rains. They rarely feed on herbs, grass, and fruits, depending on a specific season. The animal supplements its diet with 100 species of trees but in any one area it relies on 40 – 60 species."}, {"url": "http://www.macroevolution.net/what-do-giraffes-eat.html", "passage_text": "They are also given acacia branches as a more natural type of food (). Typically a giraffe will eat about 30 kg (~66 lbs) of food a day (a large one may eat up to 34 kg), but can survive on as little as 15 kg. Nowak (1999, vol. The water requirements of a giraffe, which are extremely sparing, are similar to those of a camel. They can go for weeks or even months without any water at all. On average, though, a giraffe drinks about 7.5 liters (~2 gallons) of water a week."}, {"url": "http://animals.sandiegozoo.org/animals/giraffe", "passage_text": "When the tree walked away, they realized that it was a giraffe. A giraffe's feet are the size of a dinner plate—12 inches across (30.5 centimeters). Giraffes have the same number of vertebrae in their necks as we do—seven. A giraffe's tongue is 18 to 20 inches (46 to 50 centimeters) long and blue-black. The color may keep the tongue from getting sunburned. So, giraffes go to a watering hole together and take turns watching for predators. If water is easily available, like in zoos, they can drink 10 gallons (38 liters) a day. Many people think that giraffes have no voice, but they do make a variety of sounds, including moos, roars, snorts, hisses, and grunts."}, {"url": "http://animals.sandiegozoo.org/animals/giraffe", "passage_text": "The legs of a giraffe are also 6 feet (1.8 meters) long. The back legs look shorter than the front legs, but they are about the same length. A giraffe's heart is 2 feet (0.6 meters) long and weighs about 25 pounds (11 kilograms), and its lungs can hold 12 gallons (55 liters) of air! Its closest relative is the okapi. So, giraffes go to a watering hole together and take turns watching for predators. If water is easily available, like in zoos, they can drink 10 gallons (38 liters) a day. Many people think that giraffes have no voice, but they do make a variety of sounds, including moos, roars, snorts, hisses, and grunts."}, {"url": "http://www.answers.com/Q/How_MUCH_do_giraffes_eat", "passage_text": "A giraffe can eat 63kg (140 lb) of leaves and twigs daily. As  ruminants, they first chew their food, swallow for processing and  then visibly regurgitate the semi-digested … cud up their necks and  back into the mouth, in order to chew again. This process is  usually repeated several times for each mouthful. "}]