[{"url": "http://www.hipreplacement.com/about/recovery/rehab", "passage_text": "The physical therapist will check your progress daily and will keep your surgeon informed. Progress. The usual hospital stay for hip replacement is 3 to 5 days, and full recovery typically takes 3 to 6 months. To protect your hip, you will often be asked not to sit past a 90-degree angle after surgery. If this is the case, you will be provided the necessary tools to assist during this process. "}, {"url": "https://uk.answers.yahoo.com/question/index?qid=20080708110346AAgAcTB", "passage_text": "One type is called Metal on Metal, not the full replacement procedure but used more on people in their 40's & 50's. Hospital stay will be around 5 nights. How long it lasts-well the above is around 10 years but am not sure with other hip procedures. "}, {"url": "http://www.webmd.com/arthritis/news/20110419/shorter-hospital-stay-after-hip-replacement-surgery", "passage_text": "Also, researchers say the average length of stay in a hospital for primary hip replacement patients decreased from 9.1 days in 1991-1992 to 3.7 days in 2007-2008. Risk-adjusted 30-day mortality over the study period decreased from 0.7% to 0.3%. And 90-day mortality fell from 1.3% to 0.7%, according to the study. April 19, 2011 -- The average length of a hospital stay for hip replacement surgery has decreased significantly in recent years, new research indicates. But the rate of readmissions for complications or referrals to skilled care facilities has increased"}, {"url": "http://www.niams.nih.gov/health_info/hip_replacement/default.asp", "passage_text": "Usually, people do not spend more than 3 to 5 days in the hospital after hip replacement surgery. Full recovery from the surgery takes about 3 to 6 months, depending on the type of surgery, your overall health, and the success of your rehabilitation. During a traditional hip replacement, which lasts from 1 to 2 hours, the surgeon makes a 6- to 8-inch incision over the side of the hip through the muscles and removes the diseased bone tissue and cartilage from the hip joint, while leaving the healthy parts of the joint intact."}, {"url": "https://answers.yahoo.com/question/index?qid=20080126170353AA4P8BV", "passage_text": "Best Answer: My stays for each of my hip replacements was 4 days but I was not 87 yrs old either. In the US, sometimes instead of dismissing hip patients to go directly home, surgeons transfer them to a rehab unit first. Report Abuse. Now a days people are leaving the hospital in as little as two days after hip replacement. There are agencies that provided services to eldery people after surgies. Ask the nurses at the hospital for a local listing of the agencies in your mothers area."}, {"url": "http://umm.edu/programs/orthopaedics/services/joint-replacement/hipquestions", "passage_text": "Patients usually stay in the hospital for 2 to 4 days after hip replacement. During that time, we monitor vital signs and laboratory values. Most importantly, the physical therapists teach the patients how to get around with a new hip. Twenty years after surgery, 80% of hip replacements are still functioning well. Several factors determine how long a hip replacement lasts, including patient age and activity level, the type of implant used, and the reason the hip was replaced."}, {"url": "http://www.orthopedicdoctor.net/how-long-is-hospital-stay-for-hip-replacement-surgery", "passage_text": "Barring any … Patients are admitted to hospital the day before surgery. … Surgeons that perform both Total Hip Replacement and Hip Resurfacing;…. Jul 08, 2008 · … longer the hip replacement.We did ask how long the hip … hospital stay for a hip replacement and … hip replacement surgery…how long ……. Apr 19, 2011 · … The average length of a hospital stay for hip replacement surgery has decreased significantly in recent years, … Revisions for Hip Replacements…. Jan 27, 2008 · My 87 year old mother has just had a hip replacement … my hip replacements was 4 … a hip replacement? "}, {"url": "http://www.hopkinsmedicine.org/healthlibrary/test_procedures/orthopaedic/hip_replacement_surgery_procedure_92,P07674/", "passage_text": "After the surgery you will be taken to the recovery room for observation. Once your blood pressure, pulse, and breathing are stable and you are alert, you will be taken to your hospital room. Hip replacement surgery usually requires an in-hospital stay of several days. It is important to begin moving the new joint after surgery. A physical therapist will meet with you soon after your surgery and plan an exercise program for you. "}]