[{"url": "http://career-training-center.com/general/average-emt-career-length", "passage_text": "The Average Salary for a Paramedic Candidates for an Emergency Medical Technician career should be emotionally stable and have good dexterity, agility, Program Length: The Central Coast Paramedic Program is three semesters in length. EMT Training And Career Headquarters. EMT Training and Career Headquarters. The program is 5 terms in length and is 75.5 credit hours, including credit for the EMT-B prerequisite, The average salary for paramedics is $37,455.00*,"}, {"url": "http://www.ems1.com/airway-management/articles/1166255-Paramedic-vs-EMT-Which-path-is-right-for-you/", "passage_text": "As a paramedic, you'll earn more money than an EMT, which might affect your decision about becoming a paramedic vs. EMT. Paramedics generally make an average of about $40,000 annually, but can earn as much as $70,000 a year. EMT pay averages $33,000 a year, with the top earners taking home $51,000 a year. When deciding whether to become a paramedic vs. EMT, you should know that either choice offers a rewarding career, job security, good pay and a chance to perform an important role in your community. References:"}, {"url": "http://www.answers.com/Q/What_is_the_average_career_span_of_a_paramedic", "passage_text": "The salary for a paramedic varies by where you work. Say for instance you work for a private service (i.e. AMR, Rural Metro) your likely to have fairly decent pay around $15-1 … 9/hour if you work in a large city like Houston. If you work for a fire deptartment or what's sometimes called a 3rd city service, you will make on average 36-45k/year starting out. The more experience you have the better. Where I work experienced paramedics, once they're off probation, can start out between $55-60k. Paramedic median: $29,271 range: $25,933 to $33,070 quite alot In general, I think a paramedic can earn about $30,000 a year. Most services operate on 12 and 24 hour shifts. 3-4 days a week. With this rotation, you make on average 50,000 a year up to 100,000.   well they get paid about 24-28 dollars per hour   A paramedic will make between 12.00-20.00 an hour, depending on the area you work and your experience."}, {"url": "http://money.usnews.com/careers/best-jobs/emergency-medical-technician-and-paramedic/salary", "passage_text": "Average Paramedic Pay vs. Other Best Jobs. In 2013, paramedics took home slightly more on average ($34,870) than a medical assistant ($30,780). But their mean salary is significantly lower than that of a physical therapist assistant ($53,320), mental health counselor ($43,700) or clinical social worker ($52,520). The BLS reports the median annual salary for EMTs and paramedics was $31,270 in 2013. The best-paid 10 percent in the profession made approximately $54,710, while the lowest-earning 10 percent made approximately $20,420."}, {"url": "http://www.answers.com/Q/What_is_the_average_career_span_of_a_paramedic", "passage_text": "A paramedic in New York City can earn just over $37,000 as a base salary. The base salary does not include overtime and other benefits. Also, your base salary increases on an annual basis.   The median in the U.S. is $36,950. Most services operate on 12 and 24 hour shifts. 3-4 days a week. With this rotation, you make on average 50,000 a year up to 100,000.   well they get paid about 24-28 dollars per hour   A paramedic will make between 12.00-20.00 an hour, depending on the area you work and your experience."}, {"url": "http://emtcareertraining.com/average-length-emt-training", "passage_text": "Training time for certification as an EMT begins at 152 average length of transport call: National Standard; full time staffing; 1 min. or less; 4 min. or less; EMT-P – Emergency Medical technician paramedic, 1540 hours training; EMS Career Path – Blueboard | HealthONE EMS. "}, {"url": "http://www.payscale.com/career-news/2007/09/paramedic-hourl-1", "passage_text": "Be sure EMS is for you. The average career expectancy of a paramedic is five years. Many use EMS as a stepping stone to other health care careers such as nursing or physician's assistant. If you are entering EMS for the adrenaline rush and the excitement, you will be disappointed very quickly."}, {"url": "http://career-training-center.com/general/average-emt-career-length", "passage_text": "Your career in EMS by pursing a degree in paramedicine. The program is 5 terms in length and is 75.5 credit hours, including credit for the EMT-B prerequisite, The average salary for paramedics is $37,455.00*, Jeffstat In The US | Average Salary: $19,000 |. Employees from jeffstat in the US rated jeffstat -1.0 out of 5 stars"}]