[{"url": "http://www.termpaperwarehouse.com/essay-on/Sci-241-Protein-Article-Research/81210", "passage_text": "These proteins are also can be called high quality proteins and they can be found in animal-based foods. With an incomplete protein source, it is low in one or more of the essential amino acids that a body needs. There are risks that are associated with protein deficiency and overconsumption. These risks can increase a person’s risk of getting osteoporosis. But not all amino acids can be made by a person’s body and this is known as essential amino acids. There are two types of proteins and those proteins are a complete protein source and an incomplete protein source. With a complete protein source, it provides all of the essential"}, {"url": "http://www.foodpyramid.com/6-essential-nutrients/proteins/", "passage_text": "Protein deficiency is relatively rare in developed countries but people who are on a strict diet can be at risk. Symptoms of protein deficiency can be decreased muscle mass, fatigue, anemia, impaired immune function, decreased metabolism, reduced fertility, hair loss, premature aging, mood swings and memory problems."}, {"url": "http://www.livestrong.com/article/436535-symptoms-risks-of-protein-deficiency/", "passage_text": "Protein deficiency can be treated if it is caught early enough. Although children with protein deficiency will not grow to full size, their other medical symptoms will likely improve with treatment. Treatment begins by feeding the protein-deficient person foods rich in carbohydrates and fats. Photo Credit ColorBlind Images/Blend Images/Getty Images. Protein is one of three primary types of macronutrients that provide your body with energy, regulate its functioning and facilitate development. A protein consists of a chain of amino acids that your body uses for energy and to make new proteins."}, {"url": "http://www.livestrong.com/article/436535-symptoms-risks-of-protein-deficiency/", "passage_text": "Protein is one of three primary types of macronutrients that provide your body with energy, regulate its functioning and facilitate development. Photo Credit ColorBlind Images/Blend Images/Getty Images. Protein is one of three primary types of macronutrients that provide your body with energy, regulate its functioning and facilitate development. A protein consists of a chain of amino acids that your body uses for energy and to make new proteins."}, {"url": "http://www.foodpyramid.com/6-essential-nutrients/proteins/", "passage_text": "Too much protein can harm your body. If you eat too much protein the excess will be stored as body fat. Over-consumption of protein can also cause constipation, diarrhea, excessive gas, dehydration, dizziness and bad breath. Symptoms of protein deficiency can be decreased muscle mass, fatigue, anemia, impaired immune function, decreased metabolism, reduced fertility, hair loss, premature aging, mood swings and memory problems."}, {"url": "http://healthyeating.sfgate.com/risks-associated-overconsumption-underconsumption-protein-1862.html", "passage_text": "Sources of Protein. Foods rich in proteins include animal-based foods such as meats, poultry, fish, eggs and dairy products. Among plant-based foods, the best protein sources include legumes such as beans, peas, peanuts and especially soybeans and soy-based foods. Under-consumption of protein is rare in the United States, and can lead to malnutrition and serious illness."}, {"url": "http://healthyeating.sfgate.com/risks-associated-overconsumption-underconsumption-protein-1862.html", "passage_text": "If you’re healthy, over-consumption of protein likely won’t hurt you, as long as you are not eating too many foods high in saturated fat and skipping healthful carbohydrate-rich foods such as vegetables and fruit. Under-consumption of protein is rare in the United States, and can lead to malnutrition and serious illness. Foods rich in proteins include animal-based foods such as meats, poultry, fish, eggs and dairy products. Among plant-based foods, the best protein sources include legumes such as beans, peas, peanuts and especially soybeans and soy-based foods"}, {"url": "http://www.livestrong.com/article/436535-symptoms-risks-of-protein-deficiency/", "passage_text": "Symptoms. Physical symptoms of protein deficiency include altered loss of muscle mass, skin pigmentation, diarrhea, changes in the color or texture of hair, protruding belly, rashes and swelling. People with protein deficiency also experience fatigue, lethargy, irritability and apathy. Photo Credit ColorBlind Images/Blend Images/Getty Images. Protein is one of three primary types of macronutrients that provide your body with energy, regulate its functioning and facilitate development. A protein consists of a chain of amino acids that your body uses for energy and to make new proteins."}, {"url": "http://www.daveywaveyfitness.com/nutrition/8-side-effects-of-too-much-protein", "passage_text": "Protein isn’t particularly dangerous, but an over-consumption of protein may be associated with: 1  Weight gain. 2  Excess calories from excess protein may be stored as body fat. 3  Intestinal irritation. 4  Too much protein has been linked to constipation, diarrhea and/or excessive gas. 5  Dehydration. "}]