[{"url": "https://en.wikipedia.org/wiki/Axillary_nerve", "passage_text": "Axillary nerve. The axillary nerve or the circumflex nerve is a nerve of the human body, that originates from the brachial plexus (upper trunk, posterior division, posterior cord) at the level of the axilla (armpit) and carries nerve fibers from C5 and C6. "}, {"url": "http://www.merriam-webster.com/dictionary/axilla", "passage_text": "Medical Definition of AXILLA. : the cavity beneath the junction of the arm or anterior appendage and shoulder or pectoral girdle containing the axillary artery and vein, a part of the brachial plexus of nerves, many lymph nodes, and fat and areolar tissue; especially: armpit. : the cavity beneath the junction of a forelimb and the body; especially: armpit. See axilla defined for kids."}, {"url": "http://www.theodora.com/anatomy/the_axilla.html", "passage_text": "The axilla is a pyramidal space, situated between the upper lateral part of the chest and the medial side of the arm. "}, {"url": "https://en.wikipedia.org/wiki/Axilla", "passage_text": "The axilla (or underarm, or oxter) is the area on the human body directly under the joint where the arm connects to the shoulder. It also provides the under-arm sweat gland. "}, {"url": "http://www.webmd.com/pain-management/picture-of-the-armpit", "passage_text": "© 2014 WebMD, LLC. All rights reserved. The arrangement of the chest wall, shoulder bones and muscles, and the upper arm create a small hollow called the armpit. The armpit is the underside of the shoulder joint, and is among the warmest areas of the body. The armpit is also called the axilla. Blood and lymph vessels serving the arm travel through the armpit"}, {"url": "http://teachmeanatomy.info/upper-limb/areas/axilla/", "passage_text": "Fig 1.0 – Anterior view of the right axilla region. Note the pyramidal shape, with 6 borders (or sides). The axilla is the name given to an area that lies underneath the glenohumeral joint, at the junction of the upper limb and the thorax. This region is a passage by which structures such as vessels and nerves can enter and leave the upper limb. "}, {"url": "http://www.qwhatis.com/what-is-the-axilla/", "passage_text": "Located in the axilla region are lymph nodes, which are important for drainage of lymph from the upper parts of the body including the neck, shoulder, and upper arms or extremities. These lymph nodes are parts of the body’s system to provide immunity from diseases. Another important structure that passes through the axilla is the brachial plexus. This brachial plexus is like a nerve pathway which supplies sensory signals to most parts of the upper arm. If this part is damaged, then one can expect a decrease or absence of normal sensation in the upper arm region."}, {"url": "http://www.qwhatis.com/what-is-the-axilla/", "passage_text": "The axilla is the junction between the inner part of the upper arm and the shoulder. This part is commonly known as the armpit in which many anatomical structures pass through for support of the upper extremities. The axilla is pyramidal in shape. It has an apex which is directed towards the neck area. Another important structure that passes through the axilla is the brachial plexus. This brachial plexus is like a nerve pathway which supplies sensory signals to most parts of the upper arm. If this part is damaged, then one can expect a decrease or absence of normal sensation in the upper arm region."}]