[{"url": "https://www.trustdeedscotland.net/faqs/", "passage_text": "Once you have been discharged from the trust deed you can rebuild your credit and improve your score. You can still apply for a trust deed. All you have to do is provide accounts, invoices and evidence of income. You will be debt free, (typically within four years) and can rebuild your credit score with a clean slate. You can apply for a trust deed if you are resident in Scotland and have been for a minimum of six months, have over £5 000 debt and have an income or someone willing to act as third party."}, {"url": "https://www.lawsociety.com.au/community/publicationsandfaqs/Trusts/index.htm", "passage_text": "In NSW, a private trust can last for up to 80 years. The trust deed will set out how long it should last and can specify a shorter term – often based on a specific event happening, such as someone dying or reaching a certain age. The date when a trust reaches the end of its term is known as the ‘vesting date’. The trust deed: The trust deed (or, in the case of a testamentary trust, the will) is the formal document which sets out how the trust will run and what the trustee is allowed to do."}, {"url": "http://www.trust-deed.co.uk/news/howlongdoesatrustdeedinscotlandlast.php", "passage_text": "1 If you’re quoted a trust deed that will last for longer than three years speak to another firm before committing. 2  Keep your trustee promptly up to date with any changes in your circumstances during the trust deed. If you live in Scotland and are considering starting a trust deed you’ll want to know how long it will last for. This question sounds like it should have a simple answer, but in reality there are many factors that might affect the period of any protected trust deed that you enter into."}, {"url": "http://www.trust-deed.co.uk/news/howlongdoesatrustdeedinscotlandlast.php", "passage_text": "The standard term of a trust deed is three years, sometimes expressed as being 36 payments or 36 months. Most people are able to enter trust deeds that run for this period of time. You may be quoted a term in excess of three years. There may be good reasons for this to be the case. If you live in Scotland and are considering starting a trust deed you’ll want to know how long it will last for. This question sounds like it should have a simple answer, but in reality there are many factors that might affect the period of any protected trust deed that you enter into."}, {"url": "http://www.trust-deed.co.uk/news/howlongdoesatrustdeedinscotlandlast.php", "passage_text": "Our simple checklist to exert control over how long your trust deed will last for is therefore as follows: 1  If you’re quoted a trust deed that will last for longer than three years speak to another firm before committing. If you live in Scotland and are considering starting a trust deed you’ll want to know how long it will last for. This question sounds like it should have a simple answer, but in reality there are many factors that might affect the period of any protected trust deed that you enter into."}, {"url": "http://www.scottishtrustdeed.co.uk/scottish_trust_deed_faq.asp", "passage_text": "In contrast, if you will struggle to complete your obligations in 48 months, or if you arrange to make additional payments in place of the equity in your heritable property, it may be possible to arrange a longer period if reasonable and appropriate.A Trust Deed will usually last 36 months (5 years). The typical period for a Scottish Trust Deed is 48 months, although in certain circumstances if you can repay creditors earlier or if you have a property to sell it may be possible to finish earlier."}, {"url": "http://www.debtadvicefoundation.org/questions/how-long-does-it-take-to-set-up-a-trust-deed", "passage_text": "It usually takes between 5-8 weeks for a Trust Deed proposal to be drafted by the Insolvency Practitioner; this may vary according to the complexity of the case. The proposal is then passed to the creditors for approval, who may then take up to two weeks to approve. "}, {"url": "http://www.patricia.com.au/faq/trust-and-super-funds", "passage_text": "A Trust Deed must vest (be wound up and it's assets distributed) within 80 years of being set up. The Patricia Holdings Trust Deed provide for the Trust Deed to have a maximum life of 79 years. A Trust Deed can be wound up at any time within the 79 years. A Unit Trust Deed must vest (be wound up and it's assets distributed) within 80 years of being set up. The Patricia Holdings Unit"}, {"url": "http://www.scottishtrustdeed.co.uk/scottish_trust_deed_faq.asp", "passage_text": "From the time that she records it in the Register of Insolvencies, the Trust Deed is Protected. This means that it is binding and as long as you complete your obligations you will be discharged from your debts after 48 months. The typical period for a Scottish Trust Deed is 48 months, although in certain circumstances if you can repay creditors earlier or if you have a property to sell it may be possible to finish earlier."}]