[{"url": "http://work.chron.com/social-worker-starting-salaries-8354.html", "passage_text": "These social workers earned an average of $42,650 a year, or $20.50 an hour. The newest ones might earn a salary in line with the lowest-paid 25 percent, at $31,320 or less, or the lowest-paid 10 percent, at $25,520 or less."}, {"url": "http://www.payscale.com/research/US/Job=Social_Worker/Salary", "passage_text": "A Social Worker earns an average salary of $41,663 per year. Most people with this job move on to other positions after 20 years in this career. The highest paying skills associated with this job are Patient Counseling, Hospice, Psychiatric, Geriatrics, and Assessment."}, {"url": "http://www.simplyhired.com/salaries-k-social-auxiliary-worker-jobs.html", "passage_text": "Average Social Auxiliary Worker Salaries. The average salary for social auxiliary worker jobs is $41,000. Average social auxiliary worker salaries can vary greatly due to company, location, industry, experience and benefits. This salary was calculated using the average salary for all jobs with the term social auxiliary worker anywhere in the job listing."}, {"url": "http://www.payscale.com/research/ZA/Job=Social_Worker/Salary", "passage_text": "Social Worker Salary. (South Africa). The average pay for a Social Worker is R153,466 per year. A skill in Project Management is associated with high pay for this job. People in this job generally don't have more than 20 years' experience."}, {"url": "http://work.chron.com/social-worker-starting-salaries-8354.html", "passage_text": "These social workers earned an average annual wage of $44,410, or $21.35 an hour. However, starting social workers might earn a salary closer to the lowest-paid quarter of these workers, who made $32,520 or less, or even the bottom 10 percent, who made $26,190 or less."}, {"url": "http://www.sacssp.co.za/Content/documents/SAW_FAQ.pdf", "passage_text": "The learner will qualify as a Social Auxiliary Worker and register with the South African Council for Social Service Professions (SACSSP) as a Social Auxiliary Worker in terms of Section 18 of the Social Service Professions Act 110 of 1978 (as amended)."}]