[{"url": "https://en.wikipedia.org/wiki/Kennywood", "passage_text": "Kennywood was purchased by California-based Palace Entertainment in 2007. The amusement park features various structures and rides dating back to the early 1900s. Along with Rye Playland Park, it is one of only two amusement parks listed in the National Register of Historic Places. Kennywood is approximately 8 miles (13 km) from Downtown Pittsburgh, in West Mifflin, Pennsylvania. The park is along Pennsylvania Route 837, known as Kennywood Boulevard as it passes through the borough."}, {"url": "http://pittsburgh.about.com/od/amusement_parks/p/kennywood.htm", "passage_text": "LOCATION / DIRECTIONS: Kennywood amusement park is located in West Mifflin, just 12 miles southeast of downtown Pittsburgh on PA 837 along the Monongahela River. From Interstate 376 (which runs from downtown Pittsburgh to Monroeville) you'll get off at the Swissvale Exit (No. 7). Then, just follow the well-marked arrow signs to Kennywood. "}, {"url": "https://www.kennywood.com/things-to-do/attractions", "passage_text": "Combining the best of the old with the best of the new, Kennywood offers the most thrilling and memorable things to do near Pittsburgh. Experience Kennywood’s state-of-the-art coasters and Pennsylvania attractions, including Phantom’s Revenge, Black Widow, Jack Rabbit, and Sky Rocket. When you need a break from riding, check out one of the awesome shows playing on Kennywood’s stages! From rocking out to tunes of yesteryear, to enjoying a modern twist on a classic fairy tale, Kennywood’s shows have something for everyone! See the weekly show schedule here."}, {"url": "https://www.kennywood.com/things-to-do/attractions", "passage_text": "Phantom's Revenge is one of the fastest roller coasters in the world. Unlike most coasters, the biggest drop on this ride is not the first but the second--a whopping 230 feet, reaching speeds of 85 mph. When you need a break from riding, check out one of the awesome shows playing on Kennywood’s stages! From rocking out to tunes of yesteryear, to enjoying a modern twist on a classic fairy tale, Kennywood’s shows have something for everyone! See the weekly show schedule here."}, {"url": "https://en.wikipedia.org/wiki/Kennywood", "passage_text": "1 The gateway to Lost Kennywood is a one-third scale replica of Luna Park's main entrance which spells Pittsburgh with no 'H' , because in 1905–1909, Pittsburgh's name was spelled that way. 2  Volcano Valley was created in the park in 2003 for the addition of a new ride that year, King Kahuna. Kennywood is approximately 8 miles (13 km) from Downtown Pittsburgh, in West Mifflin, Pennsylvania. The park is along Pennsylvania Route 837, known as Kennywood Boulevard as it passes through the borough."}, {"url": "https://www.kennywood.com/things-to-do/attractions", "passage_text": "Kennywood, America’s Favorite Traditional Amusement Park since 1898 continues to delight each and every guest with its 31 major rides! Of the many fun things to do in Pennsylvania with kids, nothing can compare to a day of rides, laughs, and great places to eat at Kennywood. When you need a break from riding, check out one of the awesome shows playing on Kennywood’s stages! From rocking out to tunes of yesteryear, to enjoying a modern twist on a classic fairy tale, Kennywood’s shows have something for everyone! See the weekly show schedule here."}, {"url": "https://www.kennywood.com/", "passage_text": "Our social networks are a great way to connect with Kennywood's kids amusement park fans! Be the first to hear what's happening at the best amusement park near Pittsburgh. Plus, you won’t want to miss out on our fan-exclusive offers to Kennywood Amusement Park in Pennsylvania. "}, {"url": "http://www.city-data.com/articles/Kennywood-Park-West-Mifflin-PA-Rides-for.html", "passage_text": "In addition to the rides, Kennywood features a show called Jugglemania. Jugglemania is a show put on by Michael Karas, an award-winning juggler. The show features several different types of props, such as rings, knives, clubs, balls, and torches. Show times are at 1:30pm, 3:30pm, and 6:30pm. Kennywood Park-West Mifflin, PA-Rides for All Ages. Jump to a detailed profile or search site with. Kennywood Park is an amusement park located at 4800 Kennywood Boulevard in West Mifflin in Pennsylvania. Having first opened as a trolley park in 1898, Kennywood Park is one of only two amusement parks listed on the National Register of Historic Places. Kennywood Park is a seasonal amusement park"}, {"url": "https://en.wikipedia.org/wiki/Kennywood", "passage_text": "On December 12, 2007, Kennywood Entertainment announced that it would be selling Kennywood Park, along with four other amusement parks in the Northeastern United States, to Parques Reunidos, a company based in Madrid, Spain. Kennywood is approximately 8 miles (13 km) from Downtown Pittsburgh, in West Mifflin, Pennsylvania. The park is along Pennsylvania Route 837, known as Kennywood Boulevard as it passes through the borough."}]