[{"url": "http://healthyeating.sfgate.com/three-classifications-lipids-found-food-human-body-11865.html", "passage_text": "Lipids are fatty, waxlike molecules found in the human body and other organisms. They serve several different roles in the body, including fueling it, storing energy for the future, sending signals through the body and being a constituent of cell membranes, which hold cells together. Located on cell membranes, they form double-layered membranes with the water-soluble molecules on the outside of the cell membrane and the water-insoluble molecules in the inside. These lipids are responsible for protecting and insulating cells."}, {"url": "http://www.healthhype.com/what-are-triglycerides-functions-foods-fat-tissue-blood.html", "passage_text": "Triglycerides are one of the types of lipids present in the human body and can be sourced from food or is manufactured within the body. It derives its name from its chemical structure – three long chain fatty acid molecules bind with one glycerol molecule. 1 Triglycerides are an important means for the storage of food, not only fats, but also excess carbohydrates and proteins. 2  This can be found in the adipose tissue "}, {"url": "http://chemistry.about.com/od/lecturenoteslab1/a/Types-Of-Lipids-And-Where-They-Are-Found.htm", "passage_text": "By Anne Marie Helmenstine, Ph.D. Lipids are a diverse group of fat-soluble biological molecules. Here is a look at different types of lipids and where they are found. 1  Triacylglycerols or Triglycerides. 2  The largest class of lipids goes by different names: triacylglycerols, triglycerides, glycerolipids, or fats. "}, {"url": "http://www.familydoctor.co.uk/unassigned-articles/lipids-important-to-the-body/", "passage_text": "Several other lipids are also found in your body. Some are vital components of your brain. An important group includes phospholipids, which resemble triglycerides in structure – the main difference is that one of the fatty acid groups is replaced by one that contains phosphorus. Other important types of lipid include triglycerides and fatty acids. Lipids have several important roles in the body, providing: 1  a source and store of energy. 2  an important part of the membrane surrounding every body cell."}, {"url": "http://www.familydoctor.co.uk/unassigned-articles/lipids-important-to-the-body/", "passage_text": "Cholesterol is a type of lipid (fat). Lipids are substances that do not dissolve in water but are soluble in organic solvents such as chloroform or dry cleaning fluids. Other important types of lipid include triglycerides and fatty acids. Lipids have several important roles in the body, providing: 1  a source and store of energy. 2  an important part of the membrane surrounding every body cell."}, {"url": "http://www.med-health.net/Function-Of-Lipids.html", "passage_text": "Functions of Lipids. A lipid is a non-soluble molecular organic compound comprised of hydrogen and carbon. As far as their purpose in the human body goes, lipids are of crucial importance for both energy storage and cell membrane development. Plants and animals alike contain lipids which they depend on for energy. Gram for gram, a lipid contains more than twice the amount of energy found in carbohydrates. Lipoproteins. A lipoprotein is a combination of proteins and lipids found in a cell’s membrane – examples being antigens and enzymes. Lipoprotein help fat move around the body in the bloodstream and exist in the form of Low Density Lipoprotein (HDL) and High Density Lipoprotein (LDL)."}, {"url": "http://biology.tutorvista.com/biomolecules/lipids.html", "passage_text": "Lipids. Lipids are important constituent of of the diet because they are a source of high energy value. Lipids are also important because of the fat-soluble vitamins, and essential fatty acids found in the fat of the natural food stuffs. Body fat serves as a very good source of energy, it is stored in adipose tissues. Fats and Oils (triglycerides and triacylglycerols) - These are esters of fatty acids with a trihydroxy alcohol, glycerol. A fat is solid at ordinary room temperature, an oil is liquid. Simple Triglycerides-Simple triglycerides are one in which three fatty acids radicles are similar or are of the same type."}, {"url": "http://www.learnyourlipids.com/lipids/", "passage_text": "Lipid is a medical term for fat found in the bloodstream. There are different types of lipids, some good and some bad. Triglycerides are another type of lipid, or fat, found both in the blood and in foods. High triglycerides are often caused by being overweight, a lack of physical activity, cigarette smoking, excess alcohol intake, or a diet very high in carbohydrates–the sugars and starches found in bread, cereals, fruits, etc."}, {"url": "http://healthyeating.sfgate.com/three-classifications-lipids-found-food-human-body-11865.html", "passage_text": "Steroids are a type of lipid that includes hormones and cholesterol. Cholesterol is produced by the body and consumed through food, and it plays a role in the production of hormones. Located on cell membranes, they form double-layered membranes with the water-soluble molecules on the outside of the cell membrane and the water-insoluble molecules in the inside. These lipids are responsible for protecting and insulating cells."}, {"url": "http://healthyeating.sfgate.com/three-classifications-lipids-found-food-human-body-11865.html", "passage_text": "Triglycerides are lipids you obtain from food sources of fat, such as cooking oils, butter and animal fat. Triglycerides provide insulation that keeps you warm while protecting your internal organs with a layer of padding. They also play a role how your body uses vitamins. Located on cell membranes, they form double-layered membranes with the water-soluble molecules on the outside of the cell membrane and the water-insoluble molecules in the inside. These lipids are responsible for protecting and insulating cells."}]