[{"url": "http://www.13.waisays.com/cancer.htm", "passage_text": "Foods Causing Cancer In Short; By heating whatever food, hundreds of different mutagenic substances originate. The more protein that food contains, the more mutagenics originate due to cooking etc. If we only live long enough, these substances eventually will cause cancer. "}, {"url": "http://dailyhealthpost.com/the-10-most-cancer-causing-foods/", "passage_text": "It goes without saying that GMOs have no legitimate place in any cancer-free diet, especially now that both GMOs and the chemicals used to grow them have been shown to cause rapid tumor growth. But GMOs are everywhere, including in most food derivatives made from conventional corn, soybeans, and canola. 4. Soda pop. Like processed meats, soda pop has been shown to cause cancer as well. Loaded with sugar, food chemicals, and colorings, soda pop acidifies the body and literally feeds cancer cells."}, {"url": "http://www.naturalnews.com/039970_cancer_junk_food_carcinogens.html", "passage_text": "But the truth of the matter is that many common food items have, indeed, been scientifically shown to increase cancer risk, and some of them substantially. Here are 10 of the most unhealthy, cancer-causing foods that you should never eat again: 1) Genetically-modified organisms (GMOs) . Top 10 most unhealthy, cancer-causing foods-never eat these again!"}, {"url": "http://www.naturalnews.com/039970_cancer_junk_food_carcinogens.html", "passage_text": "Loaded with sugar, food chemicals, and colorings, soda pop acidifies the body and literally feeds cancer cells. Common soda pop chemicals like caramel color and its derivative 4-methylimidazole (4-MI) have also specifically been linked to causing cancer (http://www.naturalnews.com/031383_caramel_coloring_cola.html). Top 10 most unhealthy, cancer-causing foods-never eat these again!"}, {"url": "http://mamavation.com/2015/01/10-cancer-causing-foods-in-your-diet.html", "passage_text": "CNCA health warns this, in turn, feeds cancer cells. Fructose, the type of sugar found in soda, is a serious cancer culprit as well. It contains caramel color, a known carcinogen. Soda acidifies the body, which in turn causes cancer cells to multiply. Skip the sodas altogether limited your intake of refined sugars. Cancer causing foods are likely in your everyday diet and you didn’t even realize it. We recommend you look into sites like Thrive Market to purchase healthy food 30-50% below retail and learn more about what to avoid. Below you’ll see 10 cancer causing foods to avoid along with an helpful info graphic:"}, {"url": "http://www.cancer.org/healthy/eathealthygetactive/acsguidelinesonnutritionphysicalactivityforcancerprevention/acs-guidelines-on-nutrition-and-physical-activity-for-cancer-prevention-food-additives", "passage_text": "In the United States, some foods, such as spices, are routinely irradiated. Irradiated meats and other foods are also widely available. Because radiation is known to cause cancer, there has been concern that food irradiation may present a cancer risk. However, radiation does not remain in foods that have been irradiated."}, {"url": "http://www.wcvb.com/health/29470318", "passage_text": "Flickr: epSos .de. NaturalOn.com compiled a list of the most common cancer-causing foods. Most of these foods are consumed every day by the majority of Americans. You may consider cutting out these 16 foods. SHOW DESCRIPTION. Advertising."}, {"url": "http://www.mayoclinic.org/diseases-conditions/cancer/in-depth/cancer-causes/ART-20044714", "passage_text": "Scary claims circulate on the Internet that everyday objects and products, such as plastic and deodorant, are secret cancer causes. Beyond being wrong, many of these myths may cause you to worry unnecessarily about your own health and the health of your family. Before you panic, take a look at the facts. Myth: Microwaving plastic containers and wraps releases harmful, cancer-causing substances into food. Fact: Microwave-safe plastic containers and wraps are safe to use in the microwave. But plastic containers not intended for use in the microwave could melt and potentially leak chemicals into your food."}, {"url": "http://www.your-cancer-prevention-guide.com/foods-that-cause-cancer.html", "passage_text": "Foods that Cause Cancer. There is a list of foods that cause cancer as there is one on foods that can prevent it. Always remember that what you eat is what you become. It can either make you healthy or sick. Often, what you love most to eat are major factors for chronic inflammation. "}]