[{"url": "http://www.ancient-minerals.com/magnesium-benefits/what-is-function/", "passage_text": "Magnesium ions regulate over 300 biochemical reactions in the body through their role as enzyme co-factors. They also play a vital role in the reactions that generate and use ATP, the fundamental unit of energy within the body’s cells."}, {"url": "http://www.notesformedicalstudents.com/2014/03/magnesium-functions.html", "passage_text": "Magnesium is the fourth most common cation in the human body and second most abundant intracellular cation in the human body. Human body contains approximately 24g (1000mmole) of magnesium and it is involved in many intracellular processes and is very essential for life."}, {"url": "http://umm.edu/health/medical/altmed/supplement/potassium", "passage_text": "Potassium is a very important mineral for the proper function of all cells, tissues, and organs in the human body. It is also an electrolyte, a substance that conducts electricity in the body, along with sodium, chloride, calcium, and magnesium. Potassium is crucial to heart function and plays a key role in skeletal and smooth muscle contraction, making it important for normal digestive and muscular function."}, {"url": "http://ods.od.nih.gov/factsheets/Magnesium-HealthProfessional/", "passage_text": "Magnesium, an abundant mineral in the body, is naturally present in many foods, added to other food products, available as a dietary supplement, and present in some medicines (such as antacids and laxatives)."}, {"url": "http://www.ancient-minerals.com/magnesium-benefits/what-is-function/", "passage_text": "Understanding Ionic Magnesium and the Body’s Chemistry. Magnesium is the second most abundant element inside human cells and the fourth most abundant positively charged ion in the human body. Within the body’s cells, it serves literally hundreds of functions."}, {"url": "http://www.foodmineral.com/2008/10/magnesium-function-in-human-body.html", "passage_text": "Magnesium Function in Human Body. Of the total magnesium, about 0.5 gm/kg fat-free tissue, roughly 60% is located in bone. The function of magnesium in hard tissues is not known; one third of it is in combination with phosphate, and the remainder appears to be adsorbed loosely on the surface of the mineral structure."}, {"url": "https://www.nlm.nih.gov/medlineplus/ency/article/002423.htm", "passage_text": "Magnesium is needed for more than 300 biochemical reactions in the body. It helps to maintain normal nerve and muscle function, supports a healthy immune system, keeps the heart beat steady, and helps bones remain strong. It also helps regulate blood glucose levels and aid in the production of energy and protein."}]