[{"url": "https://en.wikipedia.org/wiki/Electromagnet", "passage_text": "An electromagnet is a type of magnet in which the magnetic field is produced by an electric current. The magnetic field disappears when the current is turned off. Electromagnets usually consist of a large number of closely spaced turns of wire that create the magnetic field. The magnetic field created by an electromagnet is proportional to both the number of turns in the winding, N, and the current in the wire, I, hence this product, NI, in ampere-turns, is given the name magnetomotive force."}, {"url": "http://www.merriam-webster.com/dictionary/electromagnetism", "passage_text": "Medical Definition of ELECTROMAGNETISM. 1. : magnetism developed by a current of electricity. "}, {"url": "http://www.thefreedictionary.com/electromagnetism", "passage_text": "e·lec·tro·mag·net·ism. n. 1. The physics of electricity and magnetism. 2. An interaction between electricity and magnetism, as when an electric current or a changing electric field generates a magnetic field, or when a changing magnetic field generates an electric field. 1. (General Physics) magnetism produced by an electric current. 2. (General Physics) Also called: electromagnetics the branch of physics concerned with magnetism produced by electric currents and with the interaction of electric and magnetic fields. (ɛˌlɛk troʊˈmaeg troʊˈmæg nɪˌtɪz). əm. n"}, {"url": "http://www.answers.com/Q/What_is_electromagnetism", "passage_text": "Confidence votes 10.9K. Electromagnetism is the effect of the electromagnetic force, which is one of the four fundamental forces in the universe. Electromagnetism speaks to electric fields and the relationship between magnetic fields and moving electric fields. Electromagnetism is the force that causes the interaction between electrically charged particles, and is responsible for practically all the phenomena observed in daily life, except gravity. Electricity and magnetism are the two obvious examples. The chemical bonds holding molecules together are electromagnetic."}, {"url": "http://www.thefreedictionary.com/electromagnetism", "passage_text": "electromagnetism. n. 1. (General Physics) magnetism produced by an electric current. 2. (General Physics) Also called: electromagnetics the branch of physics concerned with magnetism produced by electric currents and with the interaction of electric and magnetic fields. (ɛˌlɛk troʊˈmaeg troʊˈmæg nɪˌtɪz). əm. n"}, {"url": "https://en.wikipedia.org/wiki/Electromagnetism", "passage_text": "Electromagnetism is a branch of physics which involves the study of the electromagnetic force, a type of physical interaction that occurs between electrically charged particles. The electromagnetic force usually shows electromagnetic fields, such as electric fields, magnetic fields, and light. 1 (In particle physics though, the electroweak interaction is the unified description of two of the four known fundamental interactions of nature: electromagnetism and the weak interaction); 2  the strong nuclear force, which binds quarks to form nucleons, and binds nucleons to form nuclei. 3  the gravitational force."}, {"url": "http://whatis.techtarget.com/definition/electromagnetic-field", "passage_text": "An electromagnetic field, sometimes referred to as an EM field, is generated when charged particles, such as electron s, are accelerated. All electrically charged particles are surrounded by electric fields. Charged particles in motion produce magnetic fields. When the velocity of a charged particle changes, an EM field is produced. Electromagnetic fields were first discovered in the 19th century, when physicists noticed that electric arcs (sparks) could be reproduced at a distance, with no connecting wires in between."}, {"url": "https://en.wikipedia.org/wiki/Electromagnetism", "passage_text": "Lightning is an electrostatic discharge that travels between two charged regions. The word electromagnetism is a compound form of two Greek terms, ἤλεκτρον, ēlektron,  amber , and μαγνῆτις λίθος magnētis lithos, which means magnesian stone, a type of iron ore. 1 (In particle physics though, the electroweak interaction is the unified description of two of the four known fundamental interactions of nature: electromagnetism and the weak interaction); 2  the strong nuclear force, which binds quarks to form nucleons, and binds nucleons to form nuclei. 3  the gravitational force."}, {"url": "http://www.answers.com/Q/What_is_electromagnetism", "passage_text": "Electromagnetism is the effect of the electromagnetic force, which is one of the four fundamental forces in the universe. Electromagnetism is the force that causes the interaction between electrically charged particles, and is responsible for practically all the phenomena observed in daily life, except gravity. Electricity and magnetism are the two obvious examples. The chemical bonds holding molecules together are electromagnetic."}, {"url": "http://www.definitions.net/definition/electromagnetism", "passage_text": "Wiktionary (0.00 / 0 votes) Rate this definition: electromagnetism (Noun). A unified fundamental force that combines the aspects of electricity and magnetism and is one of the four fundamental forces. (technically it can be unified with weak nuclear to form electroweak) Its gauge boson is the photon. "}]