[{"url": "https://www.facebook.com/JattSurnames/info", "passage_text": "Jatt is not a caste but it represents a unique race.. The Jatt people follow different faiths and are engaged in different professions.. Long Description. Jatts are a group of Independent Tribes found in Northwest India and Pakistan who maintain one of the oldest surviving triba ... The most visible of them are the Jatt-Sikhs which can easily be distinguished from their clan or family names: Gill, Mann, Bains, Malhi or Malli, Dhaliwal, Dhillon, Sahota, Sidhu, Sandhu, Lalli, Virk, etc."}, {"url": "http://www.sikhcastes.com/", "passage_text": "Islamic Caste System in Indian Sub Continent. The roots of Islamic caste system in India can be traced to the 14th century decree called Fatwa-i-Jahandari of Ziauddin Barani who was the official cleric of the Tughlaqs. The decree introduced a formal division of Ashraf and Ajlaf in the Muslim society of India. Manu Smriti gives the name of a caste of this composition as Kshaatri instead of Kshatriya. The word Khatri accordingly may have originated from Kshaatri instead of Kshatriya. Rajputs, the bonafide Hindu Kshatriya caste, disown all connection with them and treat them same as one of the Baniya castes."}, {"url": "http://www.answers.com/Q/IS_Sahota_a_Jat_Sikh_Caste", "passage_text": "Yes, you will find muslim Sahota families but they are very low in numbers, mostly Sahota cast belongs to Sikhs from India, but a handful families turned muslim some 250 years … ago, they moved to Pakistan between 1800-1947. 1 person found this useful. Yes it is there are about 12 villages off Jat Bains in distt hoshiar pur near Mahil pur village Gond pur near Mahil pur is Bains Jat."}, {"url": "http://www.sikhiwiki.org/index.php/Jatt", "passage_text": "Jatt Classified with other Castes. Jatt similar to Ramdasia (Julaha) only can socialize and make friends each other with one castes Ramdasia (Julaha) to stay close. Jatt similarity same as Ramdasia (Julaha) in Punjabi (Ekh Huu Dee) Jatt & Ramdasia (Julaha) - Very Low Castes in Sikhism. 1 Jatt Marriages are very strict have to be Jatt Matrimonial, similer to Ramdasia (Julaha) Matrimonials. 2  Jatt Bride or Groom for (Example) Jatt Bride or Groom is Manak or Sarpanch can not marry both surnames, have to be other Jatt Surnames reasons why its like marrying brother or sister."}, {"url": "http://www.answers.com/Q/Does_sahota_is_Muslim_caste", "passage_text": "Making the world better, one answer at a time. Yes, you will find muslim Sahota families but they are very low in numbers, mostly Sahota cast belongs to Sikhs from India, but a handful families turned muslim some 250 years ago, they moved to Pakistan between 1800-1947. Being a Muslim entails full submission and active obedi … ence to God, the one and only one God, and living in accordance with His message. Some people mistakenly believe that Islam is just a religion for Arabs, but nothing could be further from the truth."}, {"url": "http://www.answers.com/Q/Does_sahota_is_Muslim_caste", "passage_text": "Answer   You are a Muslim if you, primarily, witness that no god except one and only one God (in Arabic named Allah) and that Muhammad is his messenger and prophet. then: … You should follow and practice the Islam five pillars. You should have faith in the six faith principles. Being a Muslim entails full submission and active obedi … ence to God, the one and only one God, and living in accordance with His message. Some people mistakenly believe that Islam is just a religion for Arabs, but nothing could be further from the truth."}, {"url": "http://www.sikhiwiki.org/index.php/Jatt", "passage_text": "Jatt Matrimonial (Mariages). 1  Jatt Marriages are very strict have to be Jatt Matrimonial, similer to Ramdasia (Julaha) Matrimonials. 2  Jatt Bride or Groom for (Example) Jatt Bride or Groom is Manak or Sarpanch can not marry both surnames, have to be other Jatt Surnames reasons why its like marrying brother or sister. 1"}, {"url": "http://www.sikhcastes.com/", "passage_text": "Caste Should Not Exist At All. There are some reformist Sikhs who, with very good intentions, hold a more radical view and believe that caste should not exist in any form and all marks of caste identity should be abolished which should lead to fusion of all castes into one temporal and spiritual body called the Khalsa. Manu Smriti gives the name of a caste of this composition as Kshaatri instead of Kshatriya. The word Khatri accordingly may have originated from Kshaatri instead of Kshatriya. Rajputs, the bonafide Hindu Kshatriya caste, disown all connection with them and treat them same as one of the Baniya castes."}, {"url": "http://www.sikhcastes.com/sikh-caste-names/sansi-sikh-subcastes", "passage_text": "Sansi is a gypsy and nomadic caste of Sikhs, although Hindu Sansis also exist within and outside Punjab in sizable numbers. The caste claims origin from Bhati Rajputs from Rajputana who had taken to nomadic life after their defeat by Alla-ud-din Khilji in 1303 AD. Many of these Bhati Rajputs moved north into Punjab and the Sikh ruling houses of Jind, Faridkot and Patiala as well as the clan of Maharaja Ranjit Singh, who was a Sansi, traced their origin to these Bhati Rajputs."}, {"url": "http://www.sikhiwiki.org/index.php/Jatt", "passage_text": "In olden times Sikh Jatt were of making indian biscuits in factory in india, all kind of variety different biscuits masala, chilli, jeera biscuits, its very important for dipping biscuits into cup of tea and eating after, indian biscuits sold in grocerie shops in india. 1 Jatt Marriages are very strict have to be Jatt Matrimonial, similer to Ramdasia (Julaha) Matrimonials. 2  Jatt Bride or Groom for (Example) Jatt Bride or Groom is Manak or Sarpanch can not marry both surnames, have to be other Jatt Surnames reasons why its like marrying brother or sister."}]