[{"url": "http://www.wikihow.com/Hatch-Turkey-Eggs-in-an-Incubator", "passage_text": "If the eggs under your turkey hen(s) aren't hatching well, you can move them into an incubator for better hatching success. Since turkey eggs have different needs from chicken eggs, there are several things you need to know in order to increase your chances of having fluffy little turkeys running around."}, {"url": "http://farmingfriends.com/incubating-turkey-eggs/", "passage_text": "The incubation period for turkey eggs is 28 days. Incubation Temperature. The temperature in the incubator for turkey eggs is 99-99.5 degrees fahrenheit. Humidity Levels. The humidity level (wet bulb thermometer) for turkey eggs is 83-86"}, {"url": "http://sunflowerhillhomestead.blogspot.com/2013/07/how-to-incubate-and-hatch-turkey-eggs.html", "passage_text": "The incubation period for turkey eggs is 28 days, versus 21 days for chicken eggs. The eggs need to be turned at least 3 times a day for the first 24 days. Turkey eggs are too large for most turners."}, {"url": "http://www.backyardchickens.com/a/turkey-incubation-and-hatching-guide", "passage_text": "The Basics: turkeys take about 28 days to hatch. incubation temp is the same as it is for chickens and ducks.. so 99.5 ºF in a forced air. 100.5 to 101.5 ºF for a still air incubator."}, {"url": "http://www.thepoultrysite.com/articles/588/single-stage-incubation-has-big-advantages-for-turkeys/", "passage_text": "Hatchability in turkey eggs stored for 15 days prior to setting improves if the incubator temperature during the fi rst 7-14 days of incubation is increased (Christensen and colleagues in 2003)."}, {"url": "http://www.wikihow.com/Hatch-Turkey-Eggs-in-an-Incubator", "passage_text": "On the 25th day, stop turning the eggs. This is so the turkey can get into hatching position. In approx three days, on the 28th day, they will hatch. When turkeys hatch out, they may roll over the others' eggs, use the turning marks to keep the same side up."}, {"url": "http://www.answers.com/Q/What_temperature_to_incubate_turkey_eggs", "passage_text": "99.5 degrees Fahrenheit (37.5 degrees Celsius) is optimum incubating temp. for duck eggs with the temp. being lowered by one degree to 98.5 in the last 3 days of incubat … ion (25-28th day). Lowest temp. - highest temp. range is 97 - 102."}, {"url": "http://porterturkeys.com/egghatchingtips.htm", "passage_text": "Before you place eggs in an incubator make sure the temp is regulating at 100.5 to 101.5 degrees for still air machines or 99.5 to 100 degrees for forced air incubators with a relative humidity in the room of 50-60 %. I recommend a digital thermometer and hygrometer if you don’t have these already."}]