[{"url": "http://tidbitsyoumightuse.blogspot.com/2011/12/sycamine-tree.html", "passage_text": "And like the fruit of the sycamine tree is bitter, its fruit is also very bitter and hard to digest; it just sits within you and festers. The sycamine tree was also used to build caskets, which I already mentioned, it encompassed dead corpses. Bitterness and un-forgiveness are like poison which can make you sick and eventually kill you. Jails and prisons are full of people that have been angry and bitter resulting in revenge and murder."}, {"url": "http://pastorrustysblog.blogspot.com/2008/03/lessons-from-sycamine-tree.html", "passage_text": "3. The sycamine tree produced a fig that was very bitter to eat.The sycamine tree and the mulberry tree were very similar in appearance; the two trees even produced a fruit that looked identical. However, the fruit of the sycamine tree was extremely bitter. Its fruit looked just as luscious and delicious as a mulberry fig. As an illustration, Jesus likened these forces to the sycamine tree that was so well known in that part of the world. The word sycamine comes from the Greek word sukaminos, and it is the Greek word that refers to a tree that grew throughout the Middle East."}, {"url": "http://www.4kingdoms.com/sycamore.html", "passage_text": "In other words, this tree was very difficult to kill. The sycamine tree and the mulberry tree were very similar in appearance; the two trees even produced a fruit that looked identical. However, the fruit of the sycamine tree was extremely bitter. Its fruit looked just as delicious as a mulberry fig. The sycamine tree was known to have one of the deepest root structures of all trees in the Middle East. It was a vigorous and robust tree that grew to a height of thirty feet or more. Because its roots went down so deep into the earth, it"}, {"url": "http://www.biblestudytools.com/dictionary/sycamine-tree/", "passage_text": "Dictionaries-Easton's Bible Dictionary-Sycamine tree. mentioned only in Luke 17:6. It is rendered by Luther mulberry tree (q.v.), which is most probably the correct rendering. It is found of two species, the black mulberry (Morus nigra) and the white mulberry (Mourea), which are common in Palestine. is mentioned only in (Luke 17:6) There is no reason to doubt that the sycamine is distinct from the sycamore of the same evangelist. (Luke 19:4) The sycamine is the mulberry tree (Morus). Both black and white mulberry trees are common in Syria and"}, {"url": "https://en.wikipedia.org/wiki/Sycamine", "passage_text": "(February 2007). The Sycamine tree is mentioned only in Luke 17:6 of the Bible. It is rendered by Luther as  mulberry tree, which is most probably the correct rendering. It is found in two species, the black mulberry (Morus nigra) and the white mulberry (Morus alba), which are common in Palestine. It is in the same family as the fig-tree."}, {"url": "http://www.lightsource.com/ministry/refuel-with-rick/articles/why-jesus-compared-unforgiveness-to-the-sycamine-tree-13912.html", "passage_text": "As an illustration, Jesus likened these forces to the sycamine tree that was so well known in that part of the world. The word sycamine comes from the Greek word sukaminos, and it is the Greek word that refers to a tree that grew throughout the Middle East. Like the sycamine tree, bitterness and unforgiveness must be dealt with clear to the roots, or they will keep springing up again and again. The roots of bitterness and unforgiveness go down deep into the human soul, fed by any offense that lies hidden in the soil of the heart."}, {"url": "http://www.answers.com/Q/Whats_the_difference_between_a_sycamine_tree_and_a_mulberry_tree", "passage_text": "Making the world better, one answer at a time. The sycamine tree and the mulberry tree were very similar in appearance; the two trees even produced a fruit that looked identical. However, the fruit of the sycamine tree was extremely bitter. Its fruit looked just as luscious and delicious as a mulberry fig. "}, {"url": "http://www.biblestudytools.com/dictionaries/smiths-bible-dictionary/sycamine-tree.html", "passage_text": "is mentioned only in (Luke 17:6) There is no reason to doubt that the sycamine is distinct from the sycamore of the same evangelist. (Luke 19:4) The sycamine is the mulberry tree (Morus). Both black and white mulberry trees are common in Syria and Palestine. [E] indicates this entry was also found in Easton's Bible Dictionary. Bibliography Information Smith, William, Dr. Entry for 'Sycamine tree'."}]