[{"url": "http://www.healthyeating.org/Milk-Dairy/Nutrients-in-Milk-Cheese-Yogurt.aspx?Referer=dairycouncilofca", "passage_text": "Nutrients in Milk, Cheese + Yogurt. Milk and milk products are highly nutritious foods. They contain a unique “package of nutrients” that are an essential part of a healthy eating plan. Milk is not easily replaceable with other foods; the substitutes are not the same. Research continues to identify positive ways that milk impacts health"}, {"url": "http://www.dairygoodness.ca/good-health/benefits-of-milk-products/milk-packed-with-16-essential-nutrients2", "passage_text": "Whether there’s skim, 1%, 2%, homogenized or chocolate milk in your glass, you always get the same 16 essential nutrients. In addition to being fortified with vitamin D, milk is also a natural source of 15 essential nutrients. Whether it is skim, 1%, 2% or homogenized, chocolate or powdered, milk provides basically the same nutritious elements. However, the fat content changes, and for chocolate milk, the sugar content. "}, {"url": "http://extension.psu.edu/animals/dairy/nutrition", "passage_text": "Nutrition and Feeding. Dairy nutrition is essentially as simple as understanding the nutrient requirements of dairy cows at various stages of lactation and combining various feed ingredients to meet those needs in a cost-effective manner. "}, {"url": "http://www.nutritionaustralia.org/national/resource/dairy-nutrients", "passage_text": "Dairy Nutrients. Many people know that dairy foods are high in calcium, which is important for building and maintaining strong bones. However calcium is just one benefit of eating dairy foods. Dairy foods also provide a unique package of over 10 essential nutrients which provide a wide range of benefits. Three serves of dairy should be consumed every day as part of a balanced diet to get the calcium and other essential nutrients your body needs. One serve of dairy is equal to: 1  1 glass (250mL) of milk; 2  1 tub (200g) of yogurt; or. 3  2 slices (40g) of cheese"}, {"url": "http://extension.psu.edu/animals/dairy/nutrition/nutrition-and-feeding", "passage_text": "Dairy nutrition is essentially as simple as understanding the nutrient requirements of dairy cows at various stages of lactation and combining various feed ingredients to meet those needs in a cost-effective manner. However, many dynamic factors influence both nutrient requirements and nutrient availability from feeds. "}, {"url": "https://www.midwestdairy.com/nutrition-and-health/dairy-nutrition/", "passage_text": "There’s good news, though — dairy can help. Simply head to the dairy aisle and you’ll find a variety of healthy dairy foods that deliver incomparable nutrition, value and taste. Milk, cheese and yogurt can help your family maintain a healthy diet without sacrificing convenience or money. "}, {"url": "http://www.milk.co.uk/page.aspx?intPageID=40", "passage_text": "Nutrients and dairy. Dairy is the term used to describe milk-based or milk-related products. The dairy foods milk, cheese and yogurt are a natural source of nutrients such as protein and calcium. Incorporating milk, cheese and yogurt into your diet can contribute greatly to your nutritional intake and status. "}, {"url": "http://www.dairy.edu.au/discoverdairy/learning-resources/background-information/s12-dairy-nutrients", "passage_text": "DAIRY NUTRIENTS. The Australian Dietary Guidelines explain that eating milk, yogurt and cheese is linked to a reduced risk of heart disease, stroke, hypertension, type 2 diabetes, metabolic syndrome and colorectal cancer – some of the main causes of death in Australia. Skip to Main Content. Most people know dairy foods such as milk, cheese and yogurt are good sources of calcium, but calcium is just one benefit we get from eating dairy foods. Here, you will discover that dairy foods provide a unique package of more than 10 essential nutrients for children’s growth and development."}, {"url": "http://www.nutritionaustralia.org/national/resource/dairy-nutrients", "passage_text": "Carbohydrate provides the body with energy. The main carbohydrate in dairy foods is lactose. Cow’s milk contains approximately 5% lactose, compared with 7% in human milk. Dairy foods are a truly unique package of nutrients and benefits. Now there are even more reasons to consume 3 serves of dairy every day. Dairy foods also provide a unique package of over 10 essential nutrients which provide a wide range of benefits. Three serves of dairy should be consumed every day as part of a balanced diet to get the calcium and other essential nutrients your body needs. One serve of dairy is equal to:"}, {"url": "https://www.midwestdairy.com/nutrition-and-health/dairy-alternatives/", "passage_text": "Before you reach for a carton of almond milk, soy milk, or other dairy alternatives, it’s important to learn what you’re really pouring into your cup or bowl. Dairy alternatives tout a nutrient or two, but they don’t measure up to the nine essential nutrients in cow’s milk. Cow’s milk is the real deal – the original milk. Here are some of the reasons why milk alternatives are no match for the real deal: 1  Sometimes what you leave out is just as important as what you keep in"}]