[{"url": "http://www.sheknows.com/baby-names/name/rebecca", "passage_text": "Hebrew Meaning: The name Rebecca is a Hebrew baby name. In Hebrew the meaning of the name Rebecca is: Captivating; knotted cord. American Meaning: The name Rebecca is an American baby name. In American the meaning of the name Rebecca is: Captivating; knotted cord."}, {"url": "http://www.sheknows.com/baby-names/name/becky", "passage_text": "The name Becky is an English baby name. In English the meaning of the name Becky is: Abbreviation of Rebecca. American Meaning: The name Becky is an American baby name. In American the meaning of the name Becky is: Abbreviation of Rebecca. Hebrew Meaning: The name Becky is a Hebrew baby name. In Hebrew the meaning of the name Becky is: An abbreviation of Rebecca, meaning captivated, or captivating, frequently used as an independent name. Famous bearer: Fictional character Becky Sharp, the unethical heroine of Thackeray's 1948 novel Vanity Fair."}, {"url": "http://www.thinkbabynames.com/meaning/0/Becky", "passage_text": "Becky /bec-ky/ [2 sylls.] as a girls' name is pronounced BEK-ee. It is of English origin. Pet form of Rebecca (Hebrew) to bind. Often used as an independent given name, and popular in the 18th and 19th centuries. Becky is a very popular first name for women (#287 out of 4276, Top 7%) and a slightly less popular last name for all people (#110523 out of 150436, Top 73%). (2000 U.S. Census). Displayed below is the baby name popularity of Becky for girls."}, {"url": "http://www.thaindian.com/newsportal/tech-news/look-up-the-meaning-of-your-name-on-urban-dictionary_100315514.html", "passage_text": "Look up the meaning of your name on Urban Dictionary. New York, Feb 5 (THAINDIAN NEWS) The latest craze sweeping the Facebook users is urbandictionary.com It defines the slang usages of words, and names that actually mean quite something else. However Urban Dictionary is not all about weird meanings, as some of the meanings are true and real too. 1  Urban Dictionary Names' Definitons Catching On In Facebook-Feb 05, 2010. 2  Palin likens herself to Shakespeare with newly coined word 'refudiate' - Jul 19, 2010. 3  Furor over Facebook's dislike button-Oct 03, 2011."}, {"url": "http://www.urbandictionary.com/define.php?term=Rebecca", "passage_text": "Rebecca. Truly beautiful, both inside and out. She laughs a lot and is always there for you, willing to listen and help. Rebecca is someone everyone likes from the beginning. You just have to look at her and you know she's an interesting and friendly person. She's very determined to make the best of her life and is charmingly competitive at certain things. She's great fun to be around and always makes you feel happy. Rebecca is the best friend anyone could have."}, {"url": "http://www.ourbabynamer.com/meaning-of-Becky.html", "passage_text": "Becky is generally used as a girl's name. It consists of 5 letters and 2 syllables and is pronounced Bec-ky. In the U.S. in 2014, it ranked 3095 in baby name popularity for girls with 53 occurrences. Less than 5 boys were given the name. View the Becky Name Popularity Page to see how the popularity trend for Becky has changed since 1880, or to compare the popularity of Becky to other names. Becky is a diminutive (nickname) of Rebecca. Then just follow the diagram below. Just for fun, see the name Becky in Hieroglyphics, learn about ancient Egyptian Hieroglyphics and write a Hieroglyphic message. Learn about nautical flags and see your name or message written in nautical flags, on the Becky in Nautical Flags page."}, {"url": "http://www.behindthename.com/name/rebecca", "passage_text": "From the Hebrew name רִבְקָה (Rivqah) , possibly meaning a snare in Hebrew, or perhaps derived from an Aramaic name. This is the name of the wife of Isaac and the mother of Esau and Jacob in the Old Testament. "}, {"url": "http://www.thinkbabynames.com/meaning/0/Rebecca", "passage_text": "Rebecca /re-bec-ca/ [3 sylls.] as a girls' name is pronounced ree-BEK-ah. It is of Hebrew origin, and the meaning of Rebecca is to bind. Biblical: Rebekah, noted in the Genesis account as a maiden of beauty, modesty, and kindness, became the wife of Abraham's son, Isaac. The name was used by the Puritans and was common through the 19th century."}, {"url": "http://www.urbandictionary.com/define.php?term=Becky", "passage_text": "3. Becky. According to Plies, Becky is referring to the act of fellatio. Plies terms the act Becky because of the widely held notion and/or stereotype that Caucasian women are somewhat more sexually liberal in terms of frequency of encounters, random partnering, and overall lasciviousness. "}]