[{"url": "http://www.mathsisfun.com/data/standard-deviation.html", "passage_text": "Now we calculate each dog's difference from the Mean: To calculate the Variance, take each difference, square it, and then average the result: So, the Variance is 21,704. And the Standard Deviation is just the square root of Variance, so: Standard Deviation: σ = √21,704 = 147.32..."}, {"url": "http://www.had2know.com/academics/mean-median-mode-range-standard-deviation.html", "passage_text": "In statistics and data analysis, the mean, median, mode, range, and standard deviation tell researchers how the data is distributed. Each of the five measures can be calculated with simple arithmetic. The mean and median idicate the center of the data points. The mode is the value or values that occur most frequently."}, {"url": "http://www2.le.ac.uk/offices/ld/resources/numerical-data/variability", "passage_text": "The range, inter-quartile range and standard deviation are all measures that indicate the amount of variability within a dataset. The range is the simplest measure of variability to calculate but can be misleading if the dataset contains extreme values."}, {"url": "http://www.calculator.net/standard-deviation-calculator.html", "passage_text": "Standard Deviation Calculator. The following is a free online tool to calculate the standard deviation, variance, mean, sum, and confidence range for given numbers. The value used to calculate the confidence range is the sample standard deviation value."}, {"url": "https://www.easycalculation.com/statistics/standard-deviation.php", "passage_text": "Also called as SD, Standard Deviations symbol σ (sigma). This can also be said as a measure of variability or volatility in the given set of data. Find the mean, variance, standard deviation of the given numbers using this free arithmetic standard deviation calculations online."}, {"url": "http://statistics.about.com/od/Descriptive-Statistics/a/Range-Rule-For-Standard-Deviation.htm", "passage_text": "The Range Rule. The range rule tells us that the standard deviation of a sample is approximately equal to one fourth of the range of the data. In other words s = (Maximum – Minimum)/4. This is a very straightforward formula to use, and should only be used as a very rough estimate of the standard deviation."}, {"url": "http://statistics.about.com/od/Descriptive-Statistics/a/Range-Rule-For-Standard-Deviation.htm", "passage_text": "These values have mean of 17 and standard deviation of about 4.1. If instead we first calculate the range of our data as 25 – 12 = 13, and then divide this number by four we have our estimate of the standard deviation as 13/4 = 3.25. This number is relatively close to the true standard deviation, and good for a rough estimate."}]