[{"url": "http://www.nhs.uk/Conditions/Blushing/Pages/Causes.aspx", "passage_text": "Causes of blushing. Blushing is caused by your sympathetic nervous system – the network of nerves responsible for triggering your 'fight or flight' reflex. This is a series of involuntary physical changes to your body when faced with a stressful or dangerous situation. This increases the blood flow to your skin, producing the redness associated with blushing. In addition to emotional triggers, other causes of blushing can include: 1  alcohol. 2  hot or spicy foods. 3  hot drinks. 4  a high temperature (fever). 5  sudden hot or cold temperatures. 6  strenuous exercise"}, {"url": "http://www.healthline.com/health/skin-blushing-flushing", "passage_text": "Skin flushing, or blushing, is characterized by feelings of warmth and rapid reddening of your neck, upper chest, or face. Blotchiness or solid patches of redness are often visible when blushing. Flushed skin is a common physical response to anxiety, stress, embarrassment, anger, or another extreme emotional state. "}, {"url": "http://www.nhs.uk/Conditions/Blushing/Pages/Introduction.aspx", "passage_text": "Normal blushing happens when a strong emotional trigger stimulates the nervous system to widen the blood vessels in the face. This increases the flow of blood into the blood vessels just underneath the skin, causing your face to turn red. Abnormal (severe or frequent) blushing can have both psychological and physical causes, including: 1  social anxiety disorder (social phobia) – a persistent fear of social situations and being around people."}, {"url": "http://www.webmd.boots.com/skin-problems-and-treatments/guide/why-is-my-face-red", "passage_text": "Reddening of the face can have a number of causes, the most common being blushing and rosacea. Blushing, or flushing, is when your face, ears, neck, and occasionally your upper chest, becomes red in colour. This is sometimes accompanied by a hot feeling in the area. Your skin contains a network of small blood vessels which have tiny muscles inside the walls. Normal blushing happens when a strong emotional trigger stimulates the nervous system to widen the blood vessels in the face. This increases the flow of blood into the blood vessels just underneath the skin, causing your face to turn red."}, {"url": "http://www.askdoctork.com/what-causes-blushing-20111226927", "passage_text": "Blushing easily is also a symptom of a common skin condition, rosacea. In addition to these conditions, blushing can be a symptom of something called carcinoid syndrome. It is a rare disease in which a tumor releases chemicals into the body that dilate your blood vessels. The chemicals also cause other symptoms. DEAR READER: Let’s start with what blushing is and why your face gets red. Blushing occurs when the tiniest blood vessels in your face — the capillaries — suddenly get wider. When they widen, more blood flows through them, which gives your skin a reddened, rosy appearance. Your blood vessels widen in response to signals sent by the brain through the nerve"}, {"url": "https://en.wikipedia.org/wiki/Blushing", "passage_text": "Severe blushing is common in people who suffer social anxiety in which the person experiences extreme and persistent anxiety in social and performance situations. Blushing is generally distinguished, despite a close physiological relation, from flushing, which is more intensive and extends over more of the body, and seldom has a mental source. If redness persists for abnormal amounts of time after blushing, then it may be considered an early sign of rosacea."}, {"url": "http://www.calmclinic.com/anxiety/symptoms/blushing", "passage_text": "Blushing Causing Anxiety. Some people find that blushing too much actually causes them more anxiety. They become self-conscious, because they know they blush too easily most of the time and are worried others can see it. Ideally, you should take my anxiety test now to really learn more about your anxiety as a whole."}, {"url": "https://en.wikipedia.org/wiki/Blushing", "passage_text": "Blushing is the reddening of a person's face due to psychological reasons. Blushing is generally distinguished, despite a close physiological relation, from flushing, which is more intensive and extends over more of the body, and seldom has a mental source. If redness persists for abnormal amounts of time after blushing, then it may be considered an early sign of rosacea."}]