[{"url": "http://www.merriam-webster.com/dictionary/suffix", "passage_text": "1 suffix. noun suf·fix \\ˈsə-fiks\\. Tweet. : a letter or a group of letters that is added to the end of a word to change its meaning or to form a different word. Examples of SUFFIX. 1  The adjective “ smokeless ” is formed by adding the suffix “ -less ” to the noun “ smoke. 2  The adverb “ sadly ” is formed by adding the suffix “ -ly ” to the adjective “ sad."}, {"url": "http://englishlanguageterminology.org/definition-of-words/list-of-suffixes.htm", "passage_text": "Definition & List of Suffixes. Definition of Suffixes:A term for fixing one or more letters or syllables to the end of words tomodify their signification. Examples: End a word with 'less' as in homeless, careless. "}, {"url": "http://whatis.techtarget.com/definition/suffix", "passage_text": "In computer system file names, a suffix is a convention for having one or more characters appended to a file name (usually separated from the file name with a dot) so that it can be distinguished from other files or grouped together with similar types of files. Different operating systems have different rules about how long the suffix part of a file name can be. DOS, Windows prior to Windows 95, and OS/2 prior to OS/2 Warp limit suffix names to a maximum of three characters."}, {"url": "http://www.macroevolution.net/suffix-meanings.html", "passage_text": "Use this box to search for the meaning of a suffix (or for suffixes with a particular meaning): Tip: If you don't get a result, try using a query that's a synonym (e.g., instead of carry, try searching with the word bear). "}, {"url": "https://en.wikipedia.org/wiki/Suffix_(name)", "passage_text": "A name suffix, in the Western English-language naming tradition, follows a person's full name and provides additional information about the person. A generational suffix can be used informally (for disambiguation purposes, or as nicknames) and is often incorporated in legal documents. In the United States the most common name suffixes are senior and junior, which are written with a capital first letter (Jr. and Sr.) with or without an interceding comma."}, {"url": "http://dictionary.sensagent.com/suffix%20(name)/en-en/", "passage_text": "Suffix (name). A name suffix, in the Western English-language naming tradition, follows a person's full name and provides additional information about the person. Post-nominal letters indicate that the individual holds a position, educational degree, accreditation, office, or honor. Generational suffixes are used to distinguish persons who share the same name within a family. A generational suffix can be used informally (for disambiguation purposes, or as nicknames) and is often incorporated in legal documents."}, {"url": "http://www.merriam-webster.com/dictionary/suffix", "passage_text": "Full Definition of SUFFIX. : an affix occurring at the end of a word, base, or phrase — compare prefix. — suf·fix·al \\ˈsə-fik-səl, (ˌ)sə-ˈfik-səl\\ adjective. Examples of SUFFIX. 1  The adjective “ smokeless ” is formed by adding the suffix “ -less ” to the noun “ smoke. 2  The adverb “ sadly ” is formed by adding the suffix “ -ly ” to the adjective “ sad."}, {"url": "http://grammar.about.com/od/rs/g/suffixterm.htm", "passage_text": "1 A derivational suffix (such as the addition of-ly to an adjective to form an adverb) indicates what type of word it is. 2  An inflectional suffix (such as the addition of-s to a noun to form a plural) tells something about the word's grammatical behavior. Definition. A suffix is a letter or group of letters added to the end of a word or root (i.e., a base form), serving to form a new word or functioning as an inflectional ending. Adjective: suffixal. There are two primary types of suffixes in English: 1 "}, {"url": "https://www.learnthat.org/pages/view/suffix.html", "passage_text": "List of English Suffixes. Our suffix word lists are the second part of our comprehensive root word tables : Suffixes are word endings that add a certain meaning to the word. Click on the icon to the left and add the suffix list to your LearnThatWord profile for personalized review. If you don't have an account yet, you can start one in a few seconds. It's free! "}]