[{"url": "https://helpx.adobe.com/photoshop/using/saving-pdf-files.html", "passage_text": "Save As, and then choose Photoshop PDF from the Format menu. You can select a Color option if you want to embed a color profile or use the profile specified with the Proof Setup command. You can also include layers, notes, spot color, or alpha channels. Click Save. "}, {"url": "http://www.computerhope.com/issues/ch001278.htm", "passage_text": "1 Depending on your Internet browser and the settings for the PDF reader program, the PDF file may automatically download and open in your browser. 2  If you receive a prompt for opening or saving the PDF file instead, skip to step 4. 3  As you move your mouse cursor over the document, a small toolbar should appear. 1 If you receive a prompt for opening or saving the PDF file instead, skip to step 4. 2  As you move your mouse cursor over the document, a small toolbar should appear. 3  Once you've located the toolbar, click the icon that looks like a computer diskette to save the file."}, {"url": "http://www.computerhope.com/issues/ch001278.htm", "passage_text": "1 Click the link or Icon representing the PDF file. 2  Depending on your Internet browser and the settings for the PDF reader program, the PDF file may automatically download and open in your browser. 3  If you receive a prompt for opening or saving the PDF file instead, skip to step 4. 1 If you receive a prompt for opening or saving the PDF file instead, skip to step 4. 2  As you move your mouse cursor over the document, a small toolbar should appear. 3  Once you've located the toolbar, click the icon that looks like a computer diskette to save the file."}, {"url": "http://www.wikihow.com/Save-a-PDF-File", "passage_text": "1. Open the file that you want save as a PDF. This works for any file that you can print, such as a text, word processing, spreadsheet, or image file. This works with any program that has a print function. Find the file you want to convert to PDF. Find the file on your computer you want to convert to PDF, and then click Open. 1  You can click and drag a file onto the Open window to select it, too."}, {"url": "http://www.computerhope.com/issues/ch001278.htm", "passage_text": "Saving a PDF from a web page. 1  Click the link or Icon representing the PDF file. 2  Depending on your Internet browser and the settings for the PDF reader program, the PDF file may automatically download and open in your browser. 3  If you receive a prompt for opening or saving the PDF file instead, skip to step 4. 1 If you receive a prompt for opening or saving the PDF file instead, skip to step 4. 2  As you move your mouse cursor over the document, a small toolbar should appear. 3  Once you've located the toolbar, click the icon that looks like a computer diskette to save the file."}, {"url": "http://www.wikihow.com/Save-a-PDF-File", "passage_text": "4. Save the file as a PDF. Once the file opens in Acrobat, click the File menu, and then click Save As. In the Save As window, select the location you'd like to save it to, and then name your PDF. Make sure the Save as type dropdown menu is set to Adobe PDF Files, and then click Save. Find the file you want to convert to PDF. Find the file on your computer you want to convert to PDF, and then click Open. 1  You can click and drag a file onto the Open window to select it, too."}, {"url": "https://support.office.com/en-us/article/Convert-a-document-to-PDF-F7F18DDA-5610-431B-9C76-E5DF21ECCCCF", "passage_text": "Convert a document to PDF. If someone asks you to send your work as a PDF, you can save your Word document as a PDF file. Click File Export Create PDF/XPS. Choose where you want to save the PDF file. Tips To avoid including information you don’t want to share, in the Publish as PDF or XPS window, click Options. Then click Document and uncheck the Document properties box. Set any other options you want and click OK. Click Publish"}, {"url": "https://support.office.com/en-us/article/Save-as-PDF-443B9EC2-3B9A-431F-B6F7-672550A296B7", "passage_text": "OneNote. On the File menu, click Publish as PDF or XPS. In the File Name list, type or select a name for the file. In the Save as type list, click PDF. Next to Page range, click the option that represents the portion of the notebook that you want to save as PDF. Click Publish. Save as PDF for sharing or Web distribution. If you want to share the publication in a fixed format over the Web or a network, do the following: On the File menu, click Publish as PDF or XPS. In the File name list, type or select a name for the publication"}, {"url": "http://thecollege.syr.edu/administration/comm_docs/accessibility/save-pdf-files-as-word-documents.pdf", "passage_text": "Tip: If you want to save only part of a PDF file as a Word document, select the part you want to save and then right-click (Windows) or Control-click (Mac OS), choose Export Selection As, and then choose Word Document from the Save As Type or Format menu. 3. Specify settings, and then save the file. When you save complex PDF documents, the conversion to Word may take longer. 4. Evaluate the document in Word. Open the saved document in Microsoft Word, and scroll through it to confirm that text and images have been converted appropriately."}, {"url": "https://support.office.com/en-us/article/Save-as-PDF-443B9EC2-3B9A-431F-B6F7-672550A296B7", "passage_text": "On the File menu, point to Export To, and then click PDF or XPS. In the File Name list, type or select a name for the form. In the Save as type list, click PDF. If you want to open the file immediately after saving it, select the Open file after publishing check box. Save as PDF for sharing or Web distribution. If you want to share the publication in a fixed format over the Web or a network, do the following: On the File menu, click Publish as PDF or XPS. In the File name list, type or select a name for the publication"}]