[{"url": "http://www.aquaguardinjection.com/basement-waterproofing-blog/the-average-cost-of-basement-waterproofing", "passage_text": "1 Exterior crack repair - $400 - $1400; 2  Interior perimeter drain / weeping tile system installation - $50 - $85 per linear foot (minimums usually apply); 3  Sump pump installation (basic submersible with liner) - $900 - $1750; and. 4  Crack stabilization - $50 - $300 per crack. 1 Average price to fix interior cracks in a poured concrete foundation by crack injection - $350 - $525 per crack; 2  Tie-rod hole (form tie) leak repairs - $25 - $150 per hole depending upon the quantity repaired; 3  Window well drain installation - $850 - $1200 per window well;"}, {"url": "http://home.costhelper.com/french-drain.html", "passage_text": "1 Having a landscaper or other professional install outdoor French drains can cost $10-$30 a linear foot but averages about $25 /foot depending on depth and width (typically 12-24 deep and 6-18 wide), and local rates. 2  A French drain 30'-50' long might cost $300-$1,500, with prices averaging about $750-$1,250. 1 Interior French drains are often a last resort when other basement waterproofing methods don't work. 2  They typically cost $2,000-$6,000 but can be $10,000-$15,000 or more with a sump pump and basin."}, {"url": "http://www.aquaguardinjection.com/basement-waterproofing-blog/the-average-cost-of-basement-waterproofing", "passage_text": "1 Window well drain installation - $850 - $1200 per window well; 2  External excavation and waterproofing (average cost to fix weeping tile) - $100 - $250 per linear foot influenced by excavation depth and accessibility (minimums usually apply); 3  Exterior crack repair - $400 - $1400; 1 Average price to fix interior cracks in a poured concrete foundation by crack injection - $350 - $525 per crack; 2  Tie-rod hole (form tie) leak repairs - $25 - $150 per hole depending upon the quantity repaired; 3 "}, {"url": "http://www.ehow.com/info_12126008_drain-tile-cost.html", "passage_text": "Professional Insallation. Having an outdoor drain tile installed by a landscaper or other professional can cost as low as $10 to $30 a foot. However, the cost averages about $25 per foot depending on the depth and width of the drain. For example, a drain tile that's 30 feet to 50 feet long may cost about $750 to over $1,500. A drain tile can direct excess water into an open area, but you might need a dry well to hold the water until it gradually filters into the surrounding soil. A do-it-yourself dry well can cost as little as $5 to as much as $400, but having one professionally installed costs $300 to over $5,000."}, {"url": "http://www.mnshi.umn.edu/kb/scale/basement.html", "passage_text": "For example, in the chart above, a slab-on-grade foundation costs $20,000 less than an unfinished full basement foundation, but the overall cost per square foot of the home with the basement is close to half that of the slab-on-grade home. "}, {"url": "http://www.extension.iastate.edu/agdm/wholefarm/html/c2-90.html", "passage_text": "Example: If the cost of installing tile drainage is $500 per acre and the expected annual net cash return in crop returns from tile drainage is $100 per acre, the payback period is 5 years ($500 / $100 = 5 years). "}, {"url": "http://www.ehow.com/info_12126008_drain-tile-cost.html", "passage_text": "Additional Costs. When other basement waterproofing methods don't work, like wall and floor sealers, you'll need interior drain tiles. Interior drain tiles can cost $2,000 to $6,000. The cost increases to $10,000 to over $15,000 with a sump pump basin, a device that functions as a preventive measure to flooding. A drain tile can direct excess water into an open area, but you might need a dry well to hold the water until it gradually filters into the surrounding soil. A do-it-yourself dry well can cost as little as $5 to as much as $400, but having one professionally installed costs $300 to over $5,000."}, {"url": "http://costowl.com/home-improvement/basement-drainage-channels-cost.html", "passage_text": "A hole will have to be dug in your basement floor (down underneath the foundation) at the low point of your basement. Expect to pay anywhere from $20 per linear foot up to $30 per foot for this work to be completed. Those cost figures do not include refinishing costs, however. Whatever was dug up to install the drainage system will have to be put back. This can cost anywhere from $500 up to $3,000 depending on the size of the area disturbed and whether or not it was a finished basement. If you plan on having basement drainage channels installed in your home while it is being constructed, the entire process can be completed for around $1,000 (for an average sized basement). Aftermarket drainage systems are more expensive due to the higher installation costs."}, {"url": "http://www.gordonenergy.com/blog/should-you-install-a-secondary-drain-tile-on-the-inside-of-your-basement/", "passage_text": "In, these cases, the gravel may not be a good source for the water’s path of least resistance. An average price for an interior drain tile is about $ 1.20 per lineal foot. An average size home would utilize about 180’ lineal feet to circle a basement, or cost you about $ 220. Sometimes, an interior drain tile may be added on a lot by lot basis. "}, {"url": "http://home.costhelper.com/french-drain.html", "passage_text": "1 A French drain 30'-50' long might cost $300-$1,500, with prices averaging about $750-$1,250. 2  For example, Galtech.com reports having two French drains installed at an Oregon home for $1,475 for 58' total, about $25-$26 a foot. 1 Interior French drains are often a last resort when other basement waterproofing methods don't work. 2  They typically cost $2,000-$6,000 but can be $10,000-$15,000 or more with a sump pump and basin."}]