[{"url": "http://www.brighthub.com/electronics/home-theater/articles/46859.aspx", "passage_text": "Amtran Technology. The real question here is not who makes Vizio, but where they get their components. Any electronics company can mold a plastic shell and put an LCD screen inside, and that’s just what Vizio does. Rather than manufacturer televisions, you might say that Vizio just has someone else put them together. You can find their TV’s all over the country, hanging in restaurants and bars, or maybe in a friend’s living room. Like many people who first discovered this brand, I wondered who made Vizio. I thought perhaps they were an offshoot of some larger brand name, but they are really their own company based out of California."}, {"url": "http://www.brighthub.com/electronics/home-theater/articles/93819.aspx", "passage_text": "Making the decision of who makes the best LCD TV is important when purchasing a new TV. A new TV is an expensive item and the choice between the best LCD and plasma television is a comparison of color, sound and features. Four brands compare favorably in this field: Sony, Panasonic, LG and Sharp. This can’t help but improve the quality of the color on the screen. Their products range between $700 and $4,000, providing you with a vast array to choose from. The choice is up to you to decide who makes the best LCD TV."}, {"url": "https://en.wikipedia.org/wiki/Vizio", "passage_text": "VIZIO also produces other audio/video equipment such as High Definition Surround Sound systems, LCD monitors and HDTV accessories. The company released its first Blu-ray Disc player in August 2009. In September 2003, VIZIO started selling LCD TVs to Costco in Japan. In February 2009, VIZIO announced they would stop production of plasma televisions and would focus on the LED-backlit LCD displays instead. At the CES 2009, VIZIO introduced a 240 Hz LED-backlit VF551XVT 55 LCD TV."}, {"url": "https://en.wikipedia.org/wiki/Vizio", "passage_text": "VIZIO primarily produces television sets. VIZIO became the largest LCD TV seller (by volume) in North America for the second quarter of 2007, with 606,402 TVs sold, a 76% jump from the previous quarter. Its market share increased from 9.4% to 14.5%. In September 2003, VIZIO started selling LCD TVs to Costco in Japan. In February 2009, VIZIO announced they would stop production of plasma televisions and would focus on the LED-backlit LCD displays instead. At the CES 2009, VIZIO introduced a 240 Hz LED-backlit VF551XVT 55 LCD TV."}, {"url": "https://en.wikipedia.org/wiki/Vizio", "passage_text": "VIZIO is an American privately held consumer electronics company, based in Irvine, California. It was founded in October 2002 as V Inc. and is best known as a producer of affordable flat screen televisions. In September 2003, VIZIO started selling LCD TVs to Costco in Japan. In February 2009, VIZIO announced they would stop production of plasma televisions and would focus on the LED-backlit LCD displays instead. At the CES 2009, VIZIO introduced a 240 Hz LED-backlit VF551XVT 55 LCD TV."}, {"url": "https://answers.yahoo.com/question/index?qid=20101113164421AABNFOZ", "passage_text": "The following link is at least a partial answer to your question, who manufactures Vizio. http://www.vizio.com/discover/inside/ Element TV's are the remains of RCA TV's http://wiki.answers.com/Q/Who_makes_Elem... Ask yourself this question, who sells the Vizio and Element tv. It is those bargain price department store like Wal Mart, Target, Sam's Club and Costco. The are made of low quality material and they don't last long."}, {"url": "http://www.brighthub.com/electronics/home-theater/articles/46859.aspx", "passage_text": "As of 2009, Vizio is now the largest producer of LCD televisions in North America. Although the company is based out of California, their HDTV's are not Made in America. You can find their TV’s all over the country, hanging in restaurants and bars, or maybe in a friend’s living room. Like many people who first discovered this brand, I wondered who made Vizio. I thought perhaps they were an offshoot of some larger brand name, but they are really their own company based out of California."}]