[{"url": "https://www.mge.com/saving-energy/home/heating-cooling/space-heaters.htm", "passage_text": "A 90% efficient natural gas furnace will cost less than 5¢ to produce that same amount of heat (at $0.80 per therm natural gas rate). Whether you pay $30 or $300 for a space heater, if it uses 1,500 watts, you will: 1  Get the same amount of heat. 2  Pay the same cost per hour of use. Cost to use. For any electrical device, the cost per hour of use depends on the wattage of the equipment. A typical electric space heater: 1  Uses 1,500 watts. 2  Produces 5,120 BTUs of heat per hour. 3  Costs 22¢ (at $0.144 per kilowatt-hour electric rate) to produce those 5,120 BTUs of heat"}, {"url": "http://electricheatingcosts.com/convector-heater-running-cost/", "passage_text": "Running cost = Consumption of Heater X number of hours run X Electricity Unit Cost. So let work out how much it will cost to run a 2000 watt (2kw) convector heater for a period of 5 hours where each unit of electricity costs us 13 pence. 2 (kw) x 5 (hours) x 13 (pence) = 130 pence or £1.30. So to run a 2kw convector for 5 hours would cost you £1.30 based on an Electricity unit cost of 13 pence. Lets do the formula again, but this time using the rating of a 2500 watt convector heater, and an Electricity unit cost of 17p in the example. 2.5 (kw) x 5 (hours) x 17 (pence) = 212.5 Pence or £2.125."}, {"url": "http://electricheatingcosts.com/convector-heater-running-cost/", "passage_text": "A 3000 Watt Convector heater would use 3 units of Electricity for every hour it is running, and so would cost 3x 13p = £0.39p per hour to run. Remember that 1000 watts can also be expressed as 1kw and 2000 watts = 2kw and 3000 watts = 3kw. So to run a 2kw convector for 5 hours would cost you £1.30 based on an Electricity unit cost of 13 pence. Lets do the formula again, but this time using the rating of a 2500 watt convector heater, and an Electricity unit cost of 17p in the example. 2.5 (kw) x 5 (hours) x 17 (pence) = 212.5 Pence or £2.125."}, {"url": "http://powertochange.com/world/spaceheater/", "passage_text": "1 Some convection heaters also have fans to circulate the air in the room.Convection heaters are inexpensive. 2  You’ll get one rated up to 5,000 Btu’s for less than $50.Like radiant heaters, convection heaters use a variety of heating elements. 3  Ceramic disc heaters cost up to $150 and produce up to 5,000 Btu’s per hour. A 1000W heater uses a kilowatt hour per hour! pretty straight forward. So a 2000W heater used ten hours a day will used 20kWh/day, times thirty days is 600kWh. So if your rate is 15c/kWh then it will cost you $90 for that month."}, {"url": "http://www.sust-it.net/heating-energy-calculator.php", "passage_text": "Electric heaters, whether they are fan heaters, halogen heaters, oil-filled radiators or convector heaters are rated in Watts (W) or Kilowatts (kW) . Find out what your heater is rated at, then use our energy calculator to see how much it will cost to run per hour, day or week. Compare heater prices. "}, {"url": "http://homeguides.sfgate.com/cost-run-electric-heater-per-hour-60806.html", "passage_text": "Cost per kilowatt hour will determine how much it costs to run an electric heater. All electric heaters run on the principle of turning electricity into heat. The most common way to do this is to power up a wire coil and then use a small built-in fan to blow the heat out of the heating enclosure. Find out what you are paying your local electric company per kilowatt hour. For example, in San Francisco, the average cost of a kilowatt hour is 20 cents per hour."}, {"url": "http://electricheatingcosts.com/convector-heater-running-cost/", "passage_text": "One unit of Electricity is consumed for every 1000 watts of consumption recorded by the Electricity meter over a period of 1 hour. So to run a 1000 watt heater continuously for 1 hour would use 1 unit of electricity, and at a cost of 13p per unit, a 1000 watt convector heater would cost 13p per hour to run. So to run a 2kw convector for 5 hours would cost you £1.30 based on an Electricity unit cost of 13 pence. Lets do the formula again, but this time using the rating of a 2500 watt convector heater, and an Electricity unit cost of 17p in the example. 2.5 (kw) x 5 (hours) x 17 (pence) = 212.5 Pence or £2.125."}, {"url": "https://uk.answers.yahoo.com/question/index?qid=20081107012037AAYWfap", "passage_text": "Best Answer: Electricity costs about 20pence per unit and 1 unit is one Kw. So 2 Kw will cost you 2 units. Electricity is charged by Kw per hour or KwH. so for 2 hours your heater will cost 80 pence. There will be a slight saving on this as the heater will have a thermostat on it and it will cut in and out for a few minutes over an hour. Hope this helps. "}, {"url": "http://www.sylvane.com/heater-buying-guide.html", "passage_text": "Once you know the kilowatts used per hour and the cost of kilowatts per hour, plug in the number of hours you plan to use the heater each day. For example, a 1,500-watt portable space heater that runs for 12 hours a day at a rate of $0.10 per kilowatt hour will cost $1.80 per day. Here’s how it looks: 1.5 Kilowatts Used Per Hour X $0.10 kWh X 12 hours = $1.80 a"}]