[{"url": "http://www.livestrong.com/article/208307-how-to-calculate-heart-rate-for-fat-burn/", "passage_text": "When you exercise in your fat burning zone, you use a greater percentage of calories from fat than at other heart rate zones. You reach your typical fat burning zone when your heart rate is at 55 percent to 70 percent of your maximum heart rate. Your heart rate is the number of times your heart contracts in a minute and is typically listed as beats per minute. You can determine your heart rate in a variety of ways. Wearing a heart rate monitor, which is composed of some type of chest strap and watch, is one of the best methods."}, {"url": "http://healthyliving.azcentral.com/heart-rate-need-burn-fat-during-exercise-1522.html", "passage_text": "The standard calculation for determining your target heart rate is 220 minus your age, multiplied by 60 and 80 percent. For example, if you are 35 years old, your target heart rate calculation is 220 minus 35 equals 185; 185 times 0.6 equals 111, and 185 times 0.8 equals 148. In this example, your goal heart rate during sustained aerobic activity is between 111 and 148 beats per minute. If you're new to exercise, your doctor may recommend working out at 50 percent of your maximum heart rate to start out."}, {"url": "http://build-muscle-101.com/heart-rate-to-burn-fat/", "passage_text": "Pushing your body to exercise at a very high heart rate makes you burn more calories, this is true, but not so many from fat. For example, exercising at 90% of your maximum heart rate will burn only around 15% of calories from fat. The column 65% was colored red: fat burn. Translated, it means that the best heart rate to burn fat is 65% of your maximum heart rate. At that rate most of 50% of the calories that you burn come from fat, which is great. It is the highest percentage of fat burn that you can reach during cardio exercises. I have to admit that I was very surprised"}, {"url": "http://www.builtlean.com/2013/04/01/fat-burning-zone-myth/", "passage_text": "I hope you are starting to smell something fishy with this idea of a fat burning zone. At 50% of your max heart rate, your body burns a ratio of 60% fat to 40% glycogen. At 75% of your max heart rate, the ratio is 35% to 65%, and at even higher intensities, the ratio is even lower. "}, {"url": "http://build-muscle-101.com/heart-rate-to-burn-fat/", "passage_text": "Heart Rate: 80-90% of maximum heart rate. At this rate you can raise your metabolism and burn more fat as a consequence. Although during exercise this is a rate that burns more calories than the previous ones, only 15% are from fat. The column 65% was colored red: fat burn. Translated, it means that the best heart rate to burn fat is 65% of your maximum heart rate. At that rate most of 50% of the calories that you burn come from fat, which is great. It is the highest percentage of fat burn that you can reach during cardio exercises. I have to admit that I was very surprised"}, {"url": "http://build-muscle-101.com/heart-rate-to-burn-fat/", "passage_text": "Training at higher heart rates burns more calories, there's no doubt about it, but a smaller percentage comes from fat burn. For example at 80% of your maximum heart rate 50% of the calories you burn come from fat. With a very high heart rate around 90% you have only 15% of fat burn. The column 65% was colored red: fat burn. Translated, it means that the best heart rate to burn fat is 65% of your maximum heart rate. At that rate most of 50% of the calories that you burn come from fat, which is great. It is the highest percentage of fat burn that you can reach during cardio exercises. I have to admit that I was very surprised"}, {"url": "http://www.livestrong.com/article/208307-how-to-calculate-heart-rate-for-fat-burn/", "passage_text": "Fat Burning Zone. Your target heart rate for fat burning is approximately 55 percent to 70 percent of your maximum heart rate. Multiply your MHR by 0.55 to get your lower level threshold, and multiply your MHR by 0.70 to get your upper level threshold. Your heart rate is the number of times your heart contracts in a minute and is typically listed as beats per minute. You can determine your heart rate in a variety of ways. Wearing a heart rate monitor, which is composed of some type of chest strap and watch, is one of the best methods."}, {"url": "http://www.livestrong.com/article/208307-how-to-calculate-heart-rate-for-fat-burn/", "passage_text": "So, if you are 40 years old, your estimated maximum heart rate is 180. Keep in mind that this method is based on an estimated maximum heart rate. Your actual maximum heart rate may vary slightly from this number. Your target heart rate for fat burning is approximately 55 percent to 70 percent of your maximum heart rate. Multiply your MHR by 0.55 to get your lower level threshold, and multiply your MHR by 0.70 to get your upper level threshold. Your heart rate is the number of times your heart contracts in a minute and is typically listed as beats per minute. You can determine your heart rate in a variety of ways. Wearing a heart rate monitor, which is composed of some type of chest strap and watch, is one of the best methods."}, {"url": "http://www.livestrong.com/article/378010-the-best-heart-rate-to-lose-belly-fat/", "passage_text": "Different physical activities cause the heart to beat at different rates. Moderate physical activity corresponds to a heart rate of 50 to 60 percent of maximum, or 93 to 157 beats per minute for a 35-year-old. Increasing your heart rate to 60 to 70 percent of maximum improves cardiovascular endurance and burns fat."}]