[{"url": "http://www.state.gov/r/pa/ei/bgn/5467.htm", "passage_text": "More information about Mauritania is available on the Mauritania Page and from other Department of State publications and other sources listed at the end of this fact sheet. U.S.-MAURITANIA RELATIONS. The United States was the first country to recognize Mauritania's independence from France in 1960."}, {"url": "https://en.wikipedia.org/wiki/Mauritania", "passage_text": "Approximately 90% of Mauritania's land is within the Sahara and consequently the population is concentrated in the south, where precipitation is slightly higher. The capital and largest city is Nouakchott, located on the Atlantic coast, which is home to around one-third of the country's 3.5 million people. The government was overthrown on 6 August 2008, in a military coup d'etat état led By General Mohamed Ould Abdel. aziz"}, {"url": "http://www.whereig.com/mauritania/", "passage_text": "The given location map of Mauritania shows that Mauritania is located in the western part of Africa continent. Mauritania map also depicts that the country shares its international boundaries with Western Sahara in the north, Algeria in the north-east, Mali in the east and south-east, and Senegal in the south-west. Besides, Atlantic Ocean borders it from the west. Nouakchott, located on the western coast is the largest and capital city of the country. The government type of Mauritania is Islamic Republic. Economy of the Mauritania is largely depends upon the agriculture, fishing, and livestock."}, {"url": "http://www.encyclopedia.com/topic/Mauritania.aspx", "passage_text": "Mauritania is a primarily desert country in northwest Africa, situated south of the Western Sahara, southwest of Algeria, west and north of Mali, and north of Senegal. The country's western border is the Atlantic Ocean."}, {"url": "http://www.mapsofworld.com/mauritania/", "passage_text": "Geography. Mauritania is located in the Maghreb region of North Africa. Its borders are the Atlantic Ocean to the west, the Western Sahara to the north, Algeria to the north-east, Senegal to the southwest, and Mali to the east and southeast."}]