[{"url": "https://en.wikipedia.org/wiki/Orbital_speed", "passage_text": "The orbital speed of a body, generally a planet, a natural satellite, an artificial satellite, or a multiple star, is the speed at which it orbits around the barycenter of a system, usually around a more massive body. For orbits with small eccentricity, the length of the orbit is close to that of a circular one, and the mean orbital speed can be approximated either from observations of the orbital period and the semimajor axis of its orbit, or from knowledge of the masses of the two bodies and the semimajor axis."}, {"url": "http://www.sjsu.edu/faculty/watkins/orbital.htm", "passage_text": "This is the speed we travel 24 hours a day, 365.25 days a year. The orbital velocity is 2πR/T where R is the average radius of the orbit and T is the length of the year. The orbital velocity of a planet relative to that of Earth's is then the relative radius divided by the relative length of the year. Kepler's Law is that for each planet the square of the length of its year is equal to the cube of the radius of its orbit. From Kepler's Law if you know how far a planet is from the sun you can tell how long it would take for that planet to go around the sun."}, {"url": "http://hypertextbook.com/facts/2000/IlanaEpstein.shtml", "passage_text": "In the earth's orbit around the sun, it travels at an average speed of 29.658 km/s (I took the average of all of the values that I obtained for the velocity). The earth is closest to the sun, which is called the perihelion and has its greatest orbital speed around January 3. A planet's revolution is its motion around the sun in a path called an orbit. The shape of the earth's orbit is a closed curve called an ellipse. The force of gravitation between the sun and a planet is always pulling the planet toward the sun."}, {"url": "https://en.wikipedia.org/wiki/Orbit", "passage_text": "In the elliptical orbit, the center of mass of the orbiting-orbited system is at one focus of both orbits, with nothing present at the other focus. As a planet approaches periapsis, the planet will increase in speed, or velocity. As a planet approaches apoapsis, its velocity will decrease. 1 As the planet moves around its orbit during a fixed amount of time, the line from the Sun to planet sweeps a constant area of the orbital plane, regardless of which part of its orbit the planet traces during that period of time."}, {"url": "http://www.sjsu.edu/faculty/watkins/orbital.htm", "passage_text": "Thus the relative orbital speed is given by: V = 1/R½ This is just Kepler's Law in a different form. Kepler's Law is that for each planet the square of the length of its year is equal to the cube of the radius of its orbit. From Kepler's Law if you know how far a planet is from the sun you can tell how long it would take for that planet to go around the sun."}, {"url": "http://www.answers.com/Q/The_speed_of_a_planet_in_its_orbit_around_the_Sun_depends_primarily_on_the_planet's", "passage_text": "What is the average orbital speed of the planet Mercury around the sun? Its average distance from the sun is 58,000,000 km-so in going once round it travels 360,000,000 km (approximately), and it does this on 88 days, so the average speed is 4.0 … 9 million km per day, or 170,000 km/hour, or 47 km/sec. The speed of a planet in its orbit around the Sun depends primarily on the planet's? already exists. already exists as an alternate of this question. exists and is an alternate of. If you like ________ and ________, then you will like The Americans. How would you fill in the blanks? How does a planet's distance from the sun affect its orbital ..."}, {"url": "http://www.answers.com/Q/At_what_speed_does_each_planet_orbit_the_Sun", "passage_text": "The average orbital speed of a planet or other object in orbit  round the Sun is propotional to the reciprocal of the square root  of the average distance from the Sun.  …  V is proportional to 1/ sqrt (D)    This can be derived from Kepler's laws of planetary motion,  published in 1609 and still in use. No. The farther away you get from the sun, the slower the planets orbit. (and the sun looks smaller!). By the way, even if the planets were all moving at the same speed, they … still wouldn't be lined up, because the distances traveled by planets with each revolution around the sun would be different."}, {"url": "http://homepages.wmich.edu/~korista/Newton-Kepler.html", "passage_text": ". As the planet moves further away in its orbit around the Sun, the gravitational force exerted by the Sun on the planet decreases. If the force exerted on the planet decreases, the planet's acceleration, proportional to Msun/d2, must also decrease, resulting in a lower orbital speed. That is, the orbital speed of any one planet varies inversely with its distance from the Sun (actually, orbital speed varies inversely with the square-root of the distance, but you needn't worry about that detail). This one you can understand conceptually, once you understand Newton's Laws of Motion and Law of Gravity."}, {"url": "https://answers.yahoo.com/question/index?qid=20080729072037AAjGM8V", "passage_text": "Best Answer: the speed is the least! As the planets orbit the Sun, they travel at different speeds. Each planet speeds up when it is nearer the Sun and travels more slowly when it is far from the Sun (this is Kepler's Second Law of Planetary Motion). . Source(s): http://www.enchantedlearning.com/subject..."}]