[{"url": "http://www.labtestsonline.org.au/learning/test-index/ast", "passage_text": "Very high levels of AST (more than 10 times the highest normal level) are usually due to a rapidly developing liver disease called acute hepatitis, which is often due to a virus infection. In acute hepatitis, AST levels usually stay elevated for about 1–2 months, but can take as long as 3–6 months to return to normal. In the slowly developing variety of liver disease, chronic hepatitis, AST levels are usually not as high, often less than 4 times the highest normal level. In chronic hepatitis, AST often varies between normal and slightly increased, so doctors might request the test regularly to determine the pattern of change."}, {"url": "https://en.wikipedia.org/wiki/Aspartate_transaminase", "passage_text": "AST catalyzes the reversible transfer of an α-amino group between aspartate and glutamate and, as such, is an important enzyme in amino acid metabolism. AST is found in the liver, heart, skeletal muscle, kidneys, brain, and red blood cells. Serum AST level, serum ALT (alanine transaminase) level, and their ratio (AST/ALT ratio) are commonly measured clinically as biomarkers for liver health. The tests are part of blood panels. As a prototypical transaminase, AST relies on PLP (Vitamin B6) as a cofactor to transfer the amino group from aspartate or glutamate to the corresponding ketoacid."}, {"url": "http://ghr.nlm.nih.gov/gene/AGT", "passage_text": "Variations in the AGT gene are associated with susceptibility to a form of high blood pressure (hypertension) called essential hypertension. Essential hypertension is a complex disorder associated with many genetic and environmental factors. "}, {"url": "http://www.labtestsonline.org.au/learning/test-index/ast", "passage_text": "AST is an enzyme found mostly in the liver, red blood cells, heart and other muscles. When liver, red blood cells, heart or muscle cells are injured, they release AST into the blood. In the slowly developing variety of liver disease, chronic hepatitis, AST levels are usually not as high, often less than 4 times the highest normal level. In chronic hepatitis, AST often varies between normal and slightly increased, so doctors might request the test regularly to determine the pattern of change."}, {"url": "https://labtestsonline.org/understanding/analytes/alt/tab/test", "passage_text": "The alanine aminotransferase (ALT) test is typically used to detect liver injury. It is often ordered in conjunction with aspartate aminotransferase (AST) or as part of a liver panel to screen for and/or help diagnose liver disease. AST and ALT are considered to be two of the most important tests to detect liver injury, although ALT is more specific to the liver than is AST. Sometimes AST is compared directly to ALT and an AST/ALT ratio is calculated."}, {"url": "https://labtestsonline.org/understanding/analytes/alt/tab/test", "passage_text": "There are a few exceptions; the AST/ALT ratio is usually greater than 1 in alcoholic hepatitis, cirrhosis, and with heart or muscle injury and may be greater than 1 for a day or two after onset of acute hepatitis. ALT is often performed together with a test for AST or as part of a liver panel. For more about ALT results in relation to other liver tests, see the Liver Panel article. AST and ALT are considered to be two of the most important tests to detect liver injury, although ALT is more specific to the liver than is AST. Sometimes AST is compared directly to ALT and an AST/ALT ratio is calculated."}, {"url": "http://www.ncbi.nlm.nih.gov/gene/3988", "passage_text": "Summary. This gene encodes lipase A, the lysosomal acid lipase (also known as cholesterol ester hydrolase). This enzyme functions in the lysosome to catalyze the hydrolysis of cholesteryl esters and triglycerides. Mutations in this gene can result in Wolman disease and cholesteryl ester storage disease. "}, {"url": "https://labtestsonline.org/understanding/analytes/alt/tab/test", "passage_text": "Normally, levels of ALT in the blood are low. Very high levels of ALT (more than 10 times normal) are usually due to acute hepatitis, sometimes due to a viral infection. In acute hepatitis, ALT levels usually stay high for about 1-2 months but can take as long as 3-6 months to return to normal. AST and ALT are considered to be two of the most important tests to detect liver injury, although ALT is more specific to the liver than is AST. Sometimes AST is compared directly to ALT and an AST/ALT ratio is calculated."}, {"url": "http://www.labtestsonline.org.au/learning/test-index/ast", "passage_text": "Testing for AST is usually done to detect liver damage. AST levels can be examined alongside other levels of liver enzymes, such as alkaline phosphatase (ALP) and alanine transaminase (ALT) , to determine which form of liver disease is present. In the slowly developing variety of liver disease, chronic hepatitis, AST levels are usually not as high, often less than 4 times the highest normal level. In chronic hepatitis, AST often varies between normal and slightly increased, so doctors might request the test regularly to determine the pattern of change."}, {"url": "https://labtestsonline.org/understanding/analytes/ast/tab/test", "passage_text": "With heart or muscle injury, AST is often much higher than ALT (often 3-5 times as high) and levels tend to stay higher than ALT for longer than with liver injury. AST is often performed together with the ALT test or as part of a liver panel. An AST test is ordered along with several other tests to evaluate a person who has signs and symptoms of a liver disorder. Some of these may include: 1  Weakness, fatigue. 2  Loss of appetite. 3  Nausea, vomiting. 4  Abdominal swelling and/or pain. 5  Jaundice."}]