[{"url": "http://www.brainz.org/what-micturition/", "passage_text": "Micturition is the process of excreting excess fluid and substances that have potential harm to the body through the acts of urination and voiding. The renal system is involved in micturition. The kidneys filter excess water and waste products to produce urine. The ureters connect each kidney to the urinary bladder for storage until the time for micturition. When urinating, urine flows from the bladder through the urethra and out of the body from the urethra opening. Micturition is supposed to be a somewhat voluntary reflex."}, {"url": "https://en.wikipedia.org/wiki/Frequent_urination", "passage_text": "Frequent urination, or urinary frequency, is the need to urinate more often than usual. It is often, though not necessarily, associated with urinary incontinence and polyuria (large total volume of urine). "}, {"url": "http://medical-dictionary.thefreedictionary.com/micturition", "passage_text": "urination. the discharge of urine from the bladder; urine from the kidneys is passed in spurts every few seconds along the ureters to the bladder, where it collects and later is passed to the outside via the urethra. Called also micturition and voiding. The Urinary Process. Urination is a complex process controlled by muscles of the bladder and sphincter mechanism and by modulatory centers in the central and peripheral nervous systems"}, {"url": "http://www.answers.com/Q/What_is_micturition", "passage_text": "Yes. The terms micturition, voiding and emiction all refer to urination, the passage of urine from the bladder through the urethra to the outside of the body. 2 people found this useful."}, {"url": "https://en.wikipedia.org/wiki/Urination", "passage_text": "Brain centers that regulate urination include the pontine micturition center, periaqueductal gray, and the cerebral cortex. In male placental mammals, urine is ejected through the penis. In female placental mammals, urine is ejected through the vulva or pseudo-penis. In healthy humans (and many other animals) the process of urination is under voluntary control. In infants, some elderly individuals, and those with neurological injury, urination may occur as an involuntary reflex. It is normal for adult humans to urinate up to seven times during the day."}, {"url": "https://en.wikipedia.org/wiki/Urination", "passage_text": "Urination is the release of urine from the urinary bladder through the urethra to the urinary meatus outside of the body. It is also known medically as micturition, voiding, uresis, or, rarely, emiction, and known colloquially by various names including tinkling, peeing, weeing, and pissing. In healthy humans (and many other animals) the process of urination is under voluntary control. In infants, some elderly individuals, and those with neurological injury, urination may occur as an involuntary reflex. It is normal for adult humans to urinate up to seven times during the day."}, {"url": "http://www.mayoclinic.org/diseases-conditions/vasovagal-syncope/expert-answers/micturition-syncope/FAQ-20058084", "passage_text": "Micturition (or post-micturition) syncope is fainting during or, more commonly, immediately after urination due to a severe drop in blood pressure. Micturition syncope is most common in older men and usually occurs at night after a deep sleep. The exact cause of micturition syncope isn't fully understood. "}, {"url": "http://www.wisegeekhealth.com/what-is-micturition.htm", "passage_text": "Urinary incontinence and urinary frequency are symptoms of micturition problems. Micturition, also known as urination and voiding, is a process that allows the body to excrete excess water and get rid of some substances that are potentially harmful to the body. View slideshow of images above. Watch the Did-You-Know slideshow. Follow @wiseGEEK."}, {"url": "http://www.answers.com/Q/What_is_micturition", "passage_text": "Micturition is also known as urination which is an essential part of our health as it gets rid of wastes. This is accomplished by filtering out the waste in the blood through … capillaries. The resulting substance is transported out of the capillaries and comes out as urine. The terms micturition, voiding and emiction all refer to urination, the passage of urine from the bladder through the urethra to the outside of the body. 2 people found this useful."}, {"url": "http://www.answers.com/Q/What_is_micturition", "passage_text": "Micturition reflex is the neurological pathways involved in urination. When your bladder fills, the detrusor muscles expand and proprioceptors within the walls of the muscle … activate. It sends signals (afferent nerves) that go to your medulla and also to the parasympathetic system in the sacral spinal cord. The terms micturition, voiding and emiction all refer to urination, the passage of urine from the bladder through the urethra to the outside of the body. 2 people found this useful."}]