[{"url": "https://hodnettbiomeproject.wikispaces.com/Temperate+or+Deciduous%C2%A0Forest", "passage_text": "Temperate (Deciduous Forest) occupies the eastern part of the United States {Coraima T}. Temperate deciduous forests are found in continents such as North America, South America, Europe, Asia, Austrailia, and Africa. The soil in these temperate forests can be very rocky and sandy."}, {"url": "https://hodnettbiomeproject.wikispaces.com/Temperate+or+Deciduous%C2%A0Forest", "passage_text": "The trees found in temperate forest are called hardwoods. Hardwoods are trees that loose their leaves in the winter, also their trunks are also made of a bark that is very hard. (Dimitri T.). Most of the trees in temperate forest are maple, birch, beech, oak, hickory, and sweet gum."}, {"url": "http://www.answers.com/Q/What_kind_of_rocks_are_in_a_deciduous_forest", "passage_text": "Because a temperate deciduous forest contains trees that loose their leaves in the winter, and that is what deciduous means. In an temperate coniferous forest, trees don't loo … se their leaves, such as evergreens. 11 people found this useful."}, {"url": "https://hodnettbiomeproject.wikispaces.com/Temperate+or+Deciduous%C2%A0Forest", "passage_text": "Since the smaller biomes make up the Deciduous Forests it shows that because it is a forest then naturally trees, animals and rocks are found inside of it. (Riley M) Temperate forests are in cool rainy areas that have trees that lose their leaves in the Fall, and then grow back in the Spring."}, {"url": "http://www.blueplanetbiomes.org/deciduous_forest.htm", "passage_text": "Northeast Asian Deciduous Forest. Deciduous forests can be found in the eastern half of North America, and the middle of Europe. There are many deciduous forests in Asia. Some of the major areas that they are in are southwest Russia, Japan, and eastern China."}, {"url": "http://www.world-builders.org/lessons/less/biomes/rainforest/temp_rain/temprain.html", "passage_text": "Mosses and lichens grow on the tree trunks and rocks. Temperate rain forests are found on the western edge of North and South America, where moist air from the Pacific Ocean drops between 60 and 200 inches of rain a year."}, {"url": "http://www.blueplanetbiomes.org/deciduous_forest.htm", "passage_text": "Plants Animals Climate Northeast Asian Deciduous Forest Deciduous forests can be found in the eastern half of North America, and the middle of Europe. There are many deciduous forests in Asia. Some of the major areas that they are in are southwest Russia, Japan, and eastern China."}, {"url": "http://www.untamedscience.com/biology/biomes/temperate-deciduous-forests/", "passage_text": "In the southern hemisphere, temperate forests can be found on the southern tip of South America and in Eastern Australia. In the northern hemisphere, they can be found in northeast Asia (China, Korea and Japan), Western Europe, and the eastern third of the United States."}]