[{"url": "https://en.wikipedia.org/wiki/Height_in_sports", "passage_text": "The introduction of the libero since 1998 has developed the need for agile and quick-moving players who are usually of shorter stature. In professional volleyball, the men's height generally fall between 1.80 m (5 ft 11 in) to 2.10 m (6 ft 11 in) while for women it is between 1.60 m (5 ft 3 in) to 1.90 m (6 ft 3 in). Thus, most of them are above average height. In rowing, tallness is advantageous, because the taller a rower is, the longer his or her stroke can potentially be, thus moving the boat more effectively. The average male Olympic rower is 1.92 m (6 ft 3 1⁄2 in), and the average female Olympic rower is 1.73 m (5 ft 8 in), well over th"}, {"url": "http://www.livestrong.com/article/421898-what-is-an-average-height-for-a-male-football-player/", "passage_text": "The average height of a male football player varies by position. Being taller or shorter can be either advantageous or disadvantageous, depending on the role. For some positions, the athlete’s weight is more important than his height. The average height of the 32 NFL starting quarterbacks as of the date of publication was 6 feet 3 inches, according to Pro-Football-Reference.com. Taller quarterbacks are able to see over their offensive lines to better locate open receivers on the field"}, {"url": "https://en.wikipedia.org/wiki/Height_in_sports", "passage_text": "Empirically, the over-representation of extremely tall athletes in basketball lends credence to the theory that the sport provides tall players with a very significant advantage. The average American male is 5 ft 10 in (1.78 m) and 99% are 6 ft 4 in (1.93 m) or shorter. In rowing, tallness is advantageous, because the taller a rower is, the longer his or her stroke can potentially be, thus moving the boat more effectively. The average male Olympic rower is 1.92 m (6 ft 3 1⁄2 in), and the average female Olympic rower is 1.73 m (5 ft 8 in), well over the average height."}, {"url": "http://www.livestrong.com/article/421898-what-is-an-average-height-for-a-male-football-player/", "passage_text": "The average heights of USC’s tight ends and linebackers are 6 feet 4 inches and 6 feet 1 inch, respectively, while their offensive and defensive linemen have average heights of 6 feet 5 inches and 6 feet 2 inches, respectfully. Football players at the high school level normally vary greatly in height. The average height of the 32 NFL starting quarterbacks as of the date of publication was 6 feet 3 inches, according to Pro-Football-Reference.com. Taller quarterbacks are able to see over their offensive lines to better locate open receivers on the field"}, {"url": "https://en.wikipedia.org/wiki/Height_in_sports", "passage_text": "These player contest first possession of the ball or hit out after each goal or when the ball bounces out of the playing arena. At professional AFL level, the average height of ruckmen is over 2.00 m (6 ft 7 in) tall. In addition, key position players also gain significant advantage in height. In rowing, tallness is advantageous, because the taller a rower is, the longer his or her stroke can potentially be, thus moving the boat more effectively. The average male Olympic rower is 1.92 m (6 ft 3 1⁄2 in), and the average female Olympic rower is 1.73 m (5 ft 8 in), well over the average height."}, {"url": "http://www.answers.com/Q/What_is_the_average_height_and_weight_of_a_soccer_player", "passage_text": "What is the average height and weight of a High School Football player? It's hard to say, the position in mind matters, I'm 275 and 64 and am a linebacker/offensive tackle, and I'm a little bit on the high side. It depends on the position of the player. According to a 2006 ESPN article, The average weight in the NFL has grown by 10 percent since 1985 to a current average of 248 pou … nds. The heaviest position, offensive tackle, went from 281 pounds two decades ago to 318 pounds.. Most pro football players are over 6 feet tall. Some kickers can be shorter however"}, {"url": "http://www.livestrong.com/article/405892-the-body-types-of-soccer-players/", "passage_text": "Just Under 6 Feet. A review of the European soccer labor market conducted by the International Centre for Sports Studies in Switzerland collected demographic and physical data on professional soccer players, published in 2009. Their average height was 5 feet, 11 1/2 inches tall. Germany's pros average 6 feet at the tallest end of the spectrum, and Spain's are the shortest at 5 feet, 10-3/4 inches. Soccer players range between Messi and van der Sar in height and overall physique. An exception would be a tall, thin player such as Englishman Peter Crouch, a journeyman who has played on more than 10 teams. He stands at 6 feet, 7 inches, and weighs only 156 pounds."}, {"url": "http://www.livestrong.com/article/405892-the-body-types-of-soccer-players/", "passage_text": "Great male players have ranged from 5 feet, 6 inches to 6 feet, 2 inches tall, a build that includes an estimated 95 percent of the world's adult male population. Soccer players range between Messi and van der Sar in height and overall physique. An exception would be a tall, thin player such as Englishman Peter Crouch, a journeyman who has played on more than 10 teams. He stands at 6 feet, 7 inches, and weighs only 156 pounds."}]