[{"url": "http://schoolworkhelper.net/bacteria-bacilli-spirilla-cocci/", "passage_text": "The spiral bacteria are spirilla (singular form is spirillus) and the rod-shaped bacteria are bacilli (singular form is bacillus). The coccus (plural form is cocci) bacteria are spherical and are usually found in clusters or chains. Bacilli have a large surface area that helps them take in nutrients, but they may dry out easily. Cocci do not dry out as quickly and retain water, but they absorb nutrients slowly."}, {"url": "http://www.answers.com/Q/What_is_Gram_Negative_Cocci", "passage_text": "I am QAsuper user. a garam negative cocci is a type of cocci bacteria which is negative for gram staining. which means it has an outer membrane and a thin peptidoglycan wall. "}, {"url": "https://en.wikipedia.org/wiki/Coccus", "passage_text": "Staphylococcus bacteria. Coccus (plural cocci) is a term used to describe any bacterium that has a spherical, ovoid, or generally round shape. It is one of the three distinct bacterial shapes, the other two being bacillus (rod-shaped) and spiral-shaped cells. Coccus is an English loanword of a Neolatin noun, which in turn stems from the Greek masculine noun kokkos (κόκκος) meaning berry."}, {"url": "http://examples.yourdictionary.com/examples-of-bacteria.html", "passage_text": "Here are examples of bacteria that are spherical shaped (Coccus): 1  Staph aureus. 2  S. epidermidis. 3  S. saphrophyticus. 4  S. haemolyticus. 5  S. hominis. 6  S. capitis. Bacteria are the plural of bacterium, which are microscopic one-celled organisms. They are found everywhere and can be harmful, as in infections; or they can be beneficial, as in fermentation or decomposition."}, {"url": "http://classes.midlandstech.edu/carterp/courses/bio225/chap04/lecture2.htm", "passage_text": "Most bacteria are 0.2 um in diameter and 2-8 um in length. The three basic bacterial shapes are coccus (spherical), bacillus (rod-shaped), and spiral (twisted), however pleomorphic bacteria can assume several shapes. Arrangement of cocci. Cocci may be oval, elongated, or flattened on one side. Cocci may remain attached after cell division. These group characteristics are often used to help identify certain cocci. Cocci that remain in pairs after dividing are called diplococci."}, {"url": "http://www.edurite.com/kbase/examples-of-cocci-bacteria", "passage_text": "Cocci bacteria can be oval, elongated, or flattened on one side. Sometimes they may remain attached after cell division and often used to help identify certain cocci. The pair of Cocci is called as diplococcic (Neisseria) while the chain of Cocci is known as streptococci (Streptococcus). On the basis of the bacterium's shape and cell arrangement, bacteria can be classified into three categories; cocci, bacilli, and spirilla. • Cocci are round cells and can exist singly or in pairs. The single cell of cocci is known as coccus. • Bacilli are rod-shaped bacteria and single cell is known as bacillus. The length of a cell depends upon age or environmental conditions"}, {"url": "http://schoolworkhelper.net/bacteria-bacilli-spirilla-cocci/", "passage_text": "An example of cocci is Staphylococcus hominis, and it occurs commonly on human and animal skin harmlessly, but it may occasionally cause infection in patients with weak immune systems. An example of bacilli is Escherichia coli, and these live in the intestines of animals and decompose undigested food. The coccus (plural form is cocci) bacteria are spherical and are usually found in clusters or chains. Bacilli have a large surface area that helps them take in nutrients, but they may dry out easily. Cocci do not dry out as quickly and retain water, but they absorb nutrients slowly."}, {"url": "http://www.wisegeek.org/what-is-coccus.htm", "passage_text": "The word “coccus” has a couple of different meanings in biology, but it most commonly refers to a type of bacteria that is spherical or slightly oval in shape. In this application, the plural term used to describe entire bacterial chains or infections is cocci, whereas a single coccus bacterium is called a monococcus. Coccus bacteria cause a number of common infections, including strep throat. Cocci are usually shaped like flat, elongated ovals. Many species of Neisseria are found in healthy human throats, but the bacteria that cause meningitis also belong to this genus."}]