[{"url": "http://www.health.ny.gov/diseases/communicable/pediculosis/fact_sheet.htm", "passage_text": "Pediculosis is an infestation of the hairy parts of the body or clothing with the eggs, larvae or adults of lice. The crawling stages of this insect feed on human blood, which can result in severe itching. Head lice are usually located on the scalp, crab lice in the pubic area and body lice along seams of clothing. "}, {"url": "http://www.aafp.org/afp/2004/0115/p341.html", "passage_text": "Pediculosis and scabies are caused by ectoparasites; patients usually present with itching. Head and pubic lice infestations are diagnosed by the visualization of insects or viable nits (eggs). Primary treatment is topically administered 1 percent permethrin. Malathion is one alternative for treatment failures. "}, {"url": "http://www.skinsight.com/child/pediculosisCapitisHeadLice.htm", "passage_text": "Numerous tiny, white lice eggs (nits) glued to the hair shaft are seen in this person with head lice. Head lice (pediculosis capitis) is a common, highly contagious infection that often occurs in nurseries, day care centers, and schools. It is caused by infestation with the human head louse, Pediculus humanus capitis, and it is usually very itchy. Lice are very small insects that feed on human blood. In order to make a diagnosis of head lice, the doctor must see a louse or a nit on the scalp. Occasionally, what is called a Wood's lamp is used to look for lice and nits."}, {"url": "http://www.skinsight.com/child/pediculosisCapitisHeadLice.htm", "passage_text": "The female louse attaches her eggs (nits) to the base of the hair near the scalp, and the nits hatch 7–10 days later. While the adult louse cannot survive for more than 2 days off the human head, a nit can stay alive for up to 10 days off the body (for example, on clothes, hairbrushes, or carpets). In order to make a diagnosis of head lice, the doctor must see a louse or a nit on the scalp. Occasionally, what is called a Wood's lamp is used to look for lice and nits."}, {"url": "http://www.cdc.gov/parasites/lice/head/gen_info/faqs.html", "passage_text": "Illustration of egg on a hair shaft. (CDC Photo). Egg/Nit: Nits are lice eggs laid by the adult female head louse at the base of the hair shaft nearest the scalp. Nits are firmly attached to the hair shaft and are oval-shaped and very small (about the size of a knot in thread) and hard to see. Nymph: A nymph is an immature louse that hatches from the nit. A nymph looks like an adult head louse, but is smaller. To live, a nymph must feed on blood. Nymphs mature into adults about 9–12 days after hatching"}, {"url": "https://en.wikipedia.org/wiki/Body_louse", "passage_text": "The body louse (Pediculus humanus humanus, sometimes called Pediculus humanus corporis) is a louse that infests humans. The condition of being infested with head lice, body lice, or pubic lice is known as pediculosis. 1 Nits are louse eggs. 2  They are generally easy to see in the seams of an infested person's clothing, particularly around the waistline, under armpits or even in body hair. 3  They are oval and usually yellow to white in color. 4  Body lice nits may take 1–2 weeks to hatch"}, {"url": "http://www.medicinenet.com/head_lice/article.htm", "passage_text": "1 The word lice is plural for louse. 2  Head lice are spread by personal contact or the sharing of combs, brushes, caps, and other clothing. 3  Head lice are a common problem with preschool and schoolchildren. 1 Head lice are spread by personal contact or the sharing of combs, brushes, caps, and other clothing. 2  Head lice are a common problem with preschool and schoolchildren. 3  Head lice cause a tickling feeling of something moving in the hair, itching, and sores on the head."}, {"url": "http://www.cdc.gov/parasites/lice/head/gen_info/faqs.html", "passage_text": "Adult: The fully grown and developed adult louse is about the size of a sesame seed, has six legs, and is tan to grayish-white in color. Adult head lice may look darker in persons with dark hair than in persons with light hair. To survive, adult head lice must feed on blood. An adult head louse can live about 30 days on a person's head but will die within one or two days if it falls off a person. Adult female head lice are usually larger than males and can lay about six eggs each day. Nymph: A nymph is an immature louse that hatches from the nit. A nymph looks like an adult head louse, but is smaller. To live, a nymph must feed on blood. Nymphs mature into adults about 9–12 days after hatching"}, {"url": "http://www.headlice.org/faq/lousology.htm", "passage_text": "1 Nits (the eggs of the head louse) are small yellowish-white, oval-shaped eggs that are to the side of a hair shaft glued at an angle. 2  Nits must be laid by live lice. 3  You cannot catch nits.. 4  Once laid, it takes 7-10 days for a nit to hatch, and another 7-10 days for the female to mature and begin laying her own eggs. Images & Biology of Head Lice. Nits (the eggs of the head louse) are small yellowish-white, oval-shaped eggs that are to the side of a hair shaft glued at an angle"}]