[{"url": "http://www.daptomarket.com.au/", "passage_text": "Make a weekend of it! Warrawong Market Saturday, Dapto Sunday! Just over an hour's drive from Sydney or just 15 minutes drive South of Wollongong, Dapto is located on the western shore of Lake Illawarra, famous for it's variety of water sports, including sailing, canoeing, water skiing and fishing. The Kembla Grange Racecourse is nearby."}, {"url": "https://en.wikipedia.org/wiki/Dapto,_New_South_Wales", "passage_text": "Dapto Mall is a shopping centre in the Dapto CBD. It has a vast range of stores including Coles Supermarket, Woolworths Store, Australia Post Office, Specsavers Optometrists, Amcal Chemist, Gloria Jeans, Paul the Shoeman, Annola's, Fantasy Donuts, Bushes Meats. Dapto Mall is on Moombara Street in Dapto CBD. St. John's Church is the public worship centre of Dapto's Catholic population, and can be found in Jeramatta Street. Mass times are: Saturday Vigil Mass – 6:00pm, and Sundays at 7:30, 9:30 and 6:00pm. On the last Sunday of the month, cups of tea may be had after the 9:30 mass."}, {"url": "http://www.wollongong.nsw.gov.au/library/onlineresources/suburbprofiles/Pages/Dapto.aspx", "passage_text": "1983.). To the west of Dapto lies the Illawarra escarpment. It ranges in elevation from 220 metres at Garie in the north to over 600 metres at Barren Grounds in the south. The cliffline of the escarpment is formed of Hawkesbury Sandstone up to 130 metres thick. The name Dapto is said to be an aboriginal word either from Dabpeto meaning water plenty, or from tap-toe which described the way a lame aboriginal chief walked. The aborigines called the area Mookoonburro meaning grub."}, {"url": "http://www.maplandia.com/australia/new-south-wales/wollongong/dapto/", "passage_text": "detailed map of Dapto and near places. Welcome to the Dapto google satellite map! This place is situated in Wollongong, New South Wales, Australia, its geographical coordinates are 34° 30' 0 South, 150° 47' 0 East and its original name (with diacritics) is Dapto. Dapto hotel deals. Luxury hotels (including 5 star hotels and 4 star hotels) and cheap Dapto hotels (with best discount rates and up-to-date hotel deals) are both available in separate lists. Always bear in mind that with Maplandia.com and Booking.com the best price is guaranteed!"}, {"url": "http://www.wollongong.nsw.gov.au/library/onlineresources/suburbprofiles/Pages/Dapto.aspx", "passage_text": "Dapto is located on the western shore of Lake Illawarra a valuable natural resource and habitat for local wildlife. Lake Illawarra is a shallow coastal lagoon approximately 31 square kilometres in area. The lake has approximately 39 kilometres of shoreline, very little of it remaining natural. The name Dapto is said to be an aboriginal word either from Dabpeto meaning water plenty, or from tap-toe which described the way a lame aboriginal chief walked. The aborigines called the area Mookoonburro meaning grub."}, {"url": "http://www.about-australia.com/destinations/dapto/", "passage_text": "0 Comments More. Dapto is a developing residential area in southern Wollongong. It is famous for The Dapto Greyhound Racing Club, known locally as the “Dapto Dogs”, which attracts competitions and spectators from all over the Illawarra region and beyond. Dapto is located beside Lake Illawarra, a paradise for aquatic enthusiasts, and has sailing, waterskiing, canoeing, bird watching and fishing."}, {"url": "https://en.wikipedia.org/wiki/Dapto,_New_South_Wales", "passage_text": "Dapto is a suburb of Wollongong in the Illawarra region of New South Wales, Australia, located on the western side of Lake Illawarra and covering an area 7.15 square kilometres in size. According to the 2011 ABS Census, the suburb currently has a total population of 10,735. St. John's Church is the public worship centre of Dapto's Catholic population, and can be found in Jeramatta Street. Mass times are: Saturday Vigil Mass – 6:00pm, and Sundays at 7:30, 9:30 and 6:00pm. On the last Sunday of the month, cups of tea may be had after the 9:30 mass."}, {"url": "https://en.wikipedia.org/wiki/Dapto,_New_South_Wales", "passage_text": "The name Dapto is said to be an Aboriginal word either from Dabpeto meaning water plenty, or from tap-toe which described the way a lame Aboriginal elder walked. St. John's Church is the public worship centre of Dapto's Catholic population, and can be found in Jeramatta Street. Mass times are: Saturday Vigil Mass – 6:00pm, and Sundays at 7:30, 9:30 and 6:00pm. On the last Sunday of the month, cups of tea may be had after the 9:30 mass."}, {"url": "https://en.wikipedia.org/wiki/Dapto_railway_station", "passage_text": "Dapto is an intercity train station located in Dapto, New South Wales, Australia, on the South Coast railway line. The station serves NSW TrainLink trains travelling south to Kiama and north to Wollongong and Sydney. Premier Illawarra operates connecting bus services from the station to Horsley, Shellharbour and Wollongong. Under contract to NSW TrainLink, Roadcoach operates a connecting coach service to meet Canberra Xplorer trains at Moss Vale Station. The railway from Clifton to North Kiama, opened in 1887, passed through the sparsely-settled rural district of Dapto."}, {"url": "http://www.daptodogs.org.au/", "passage_text": "Dapto Greyhound Club would like to advise our Patrons ,Owners & Trainers that our Trackside Restaurant is now under NEW MANAGER we are now DD'S FAMILY RESTAURANT. Come along and enjoy watching the dogs while relaxing in our family restaurant. 1 0 - October 7 at 3:23am. "}]