[{"url": "http://www.healthcaresalaryworld.com/what-is-radiologist-salary/", "passage_text": "Mean Annual Radiologist Salary. The average annual radiologist salary is $379,790. The lowest 10% of radiologist salaries are less than $276,427. The top 10% of radiologist salaries reach more than $496,323. Radiologic technologist makes $55,910 per year while radiologists make a lot more because they are specialized doctors who have gone to school for many years. A radiologic technologist (or radiographer) performs the imaging, and the radiologist interprets the images, aiding other physicians."}, {"url": "http://radiologyed.org/schools/georgia/", "passage_text": "Salaries for Radiologists. The average salary for professionals in this specialty is a very high $67,000 per year. In comparison, the average annual salary for this field in the US as a whole is $49,000. Supervisory positions in radiologic technology were the highest earners, drawing around $80,000 per year. Entry-level radiologic technologist positions tended to be the lowest earners, taking in about $54,000 per year."}, {"url": "http://www.healthcareworkersalary.com/physicians/radiologist-salary/", "passage_text": "Radiologist Salary. The median average radiologist salary in the United States is reported to be around $365,000 per annum according to data from salary.com. The salary earned by a physician radiologist, just like many other professions, is determined by several factors. The lowest 10 percentile earns about $271,000 and the highest 10 percentile earns about $486,500 per annum on average. These salary figures do not take into consideration bonuses and other benefits. When these are added, the average salary of a radiologist should be much higher."}, {"url": "http://www.payscale.com/research/US/Job=Radiologic_Technologist/Hourly_Rate/38eac533/Atlanta-GA", "passage_text": "The average wage for a Radiologic Technologist in Atlanta, Georgia is $22.51 per hour. Most people with this job move on to other positions after 20 years in this career. For the first five to ten years in this position, wages increase modestly, but any additional experience does not have a big effect on pay. $39,565 - $79,673."}, {"url": "http://www.healthcareworkersalary.com/physicians/radiologist-salary/", "passage_text": "Expected salary of a radiologist. According to data we have come across, a radiologist will earn about $365,000 on average per year. In the United States, the median salary of a radiologist is about $385,000 including bonuses. The middle 50% earns between $326,000 and $451,000. The lowest 10% earns $273,000 on average and the highest 10% earns about $510,000 including bonuses. The lowest 10 percentile earns about $271,000 and the highest 10 percentile earns about $486,500 per annum on average. These salary figures do not take into consideration bonuses and other benefits. When these are added, the average salary of a radiologist should be much higher."}, {"url": "http://www.indeed.com/salary/q-Radiology-l-Georgia.html", "passage_text": "Average Radiology salaries for job postings in Georgia are 14% higher than average Radiology salaries for job postings nationwide. "}, {"url": "http://www.alliedhealthworld.com/radiologic-technologist-salary-in-georgia.html", "passage_text": "In 2009, the median radiologic technologist salary in Georgia was $24.18 per hour or $50,300 per year. These figures are quite close to the national average salaries for technologists working in other states. The BLS reports the following average annual income figures for radiologic technologists working in the cities and non-metropolitan areas of Georgia: 1  Albany: $40,600. 2  Atlanta-Sandy Springs-Marietta: $53,800. 3  Augusta-Richmond County, GA-SC: $46,900. 4  Gainesville: $56,300. 5  Macon: $51,000. 6  Middle Georgia: $42,600"}]