[{"url": "http://thesoftlanding.com/are-ethylene-vinyl-acetate-eva-baby-teethers-non-toxic/", "passage_text": "Ethylene Vinyl Acetate (EVA) is widely accepted as safe for use in teethers. EVA is a type of plastic that does not require a plasticizer and is bisphenol-a free, so it is considered to be a safer alternative material. DEHP, a member of the phthalate family of chemicals, is the most widely used plasticizer in teethers. The Center for Health, Environment and Justice (CEHJ) recommends EVA as a safer PVC-free plastic alternative."}, {"url": "http://safemama.com/2008/02/12/faq-teethers-made-of-eva-safe/", "passage_text": "I’ve gotten this question and admittedly, I didn’t know how to answer it. I asked the Non-Toxic Super Hero: Alicia from The Soft Landing. She of course, had the answers we see k! Ethylene Vinyl Acetate (EVA) is widely accepted as safe for use in teethers. EVA is a type of plastic that does not require a plasticizer and is bisphenol-a free, so it is considered to be non-toxic. DEHP, a member of the phthalate family of chemicals, is the most widely used plasticizer in teethers. The Center for Health, Environment and Justice (CEHJ) recommends EVA as a safer PVC-free plastic alternative. CEHJ describes the effects of phthalates in their article PVC: The Poison Plastic."}, {"url": "http://www.ehow.com/info_8706296_dangers-ethylene-vinyl-acetate.html", "passage_text": "Ingestion and Inhalation. Ethylene vinyl acetate (EVA) is not hazardous by ingestion, unless you eat an object made of EVA that's big enough to cause choking or other problems — in which case it would pose the same hazards as any other plastic object. Inhalation does not pose a threat unless you actually work in a processing plant. "}, {"url": "http://www.debralynndadd.com/q-a/peva-vs-eva-shower-curtain/", "passage_text": "PEVA is a nontoxic vinyl (it doesn’t have the chlorine molecule that makes PVC toxic). I used a PEVA shower curtain in a rented apartment for three months. It worked great and doesn’t smell at all. EVA is Ethylene vinyl acetate, a copolymer of ethylene and vinyl acetate."}, {"url": "http://thesoftlanding.com/are-ethylene-vinyl-acetate-eva-baby-teethers-non-toxic/", "passage_text": "It is polyethylene vinyl acetate a copolymer of polyethylene and EVA. So far, polyethylene has been shown to be a safer alternative also. Ask TSL, PEVA, PVC in Teethers. I’m working on that next baby so I can get some of these cute and safe teethers! That cow is the first on my list. DEHP, a member of the phthalate family of chemicals, is the most widely used plasticizer in teethers. The Center for Health, Environment and Justice (CEHJ) recommends EVA as a safer PVC-free plastic alternative."}, {"url": "http://thesoftlanding.com/do-all-eva-foam-products-contain-toxic-formamide/", "passage_text": "I’m sure you’ve heard about the EU’s recent ban of EVA foam playmats related to the presence of formamide, a known carcinogenic chemical. From what we can tell, EVA foam – not standard EVA sheet material – is the source of concern because formamide is sometimes used to make the foam more pliable. Please note that I said sometimes. It’s possible to locate formamide-free EVA foam, although many manufacturers don’t routinely check (or test) for it yet. We recently investigated a new product to stock in our store and the manufacturer was able to confirm with their factory that a small amount of formamide was present in their products. It was noted though, that new mats have the highest risk and formamide residue decreases over time, so older products may contain little or no formamide. EVA is recommended by CHEJ as a PVC-free substitute, as well as by Healthcare without Harm for use in neonatal intensive care units in drug delivery devices."}, {"url": "http://meaniegreenie.blogspot.com/2013/06/eva-shower-curtain.html", "passage_text": "Today, there are many non-PVC alternatives on the market, including a variety of EVA shower curtains. EVA (ethylene vinyl acetate) is phthalate free and nontoxic, making it a healthy and green choice for shower curtains and other consumer products. You should make sure that your shower liner is PVC free as well. Outfit your bathroom with a cholride free / VOC free, non vinyl shower curtain liner to go with your new EVA shower curtain. Odor Free Bath Mats. Next, let's take a look at that bath mat of yours."}, {"url": "http://www.greenhome.com/blog/pevaeva-plastic-is-it-really-green-or-just-a-wash", "passage_text": "It is up to you to do your own regulation. PEVA (polyethylene vinyl acetate) and EVA (ethylene vinyl acetate) are the attempted “answers” to toxic shower curtain (and other plastic) choices. These formulas are not perfect. Investing in a toxic-free shower curtain (or other plastic choice) can be essential to your and your family’s future health. If it must be plastic, avoid the word ‘vinyl’ unless it also shows a PVC-free, PEVA or EVA identification. It may be a few shillings more but definitely worth your safer health."}, {"url": "http://meaniegreenie.blogspot.com/2013/06/eva-shower-curtain.html", "passage_text": "EVA (ethylene vinyl acetate) is a nontoxic alternative to PVC. EVA shower curtains are growing in popularity as consumers discover the many dangers of PVC (polyvinyl chloride) shower curtains. You should make sure that your shower liner is PVC free as well. Outfit your bathroom with a cholride free / VOC free, non vinyl shower curtain liner to go with your new EVA shower curtain. Odor Free Bath Mats. Next, let's take a look at that bath mat of yours."}]