[{"url": "http://www.rightdiagnosis.com/sym/excessive_mucus_production.htm", "passage_text": "Excessive mucus production: Excessive mucus production refers to an unusually large amount of secretions that are produced by and cover the mucus membranes. The following medical conditions are some of the possible causes of Excessive mucus production. There are likely to be other possible causes, so ask your doctor about your symptoms. 1  Acute bronchitis. 2  Asthma. 3  Anaphylaxis. 4  Nasal polyps. 5  Tuberculosis. 6  Esophageal cancer. 7  COPD."}, {"url": "http://www.allaboutvision.com/conditions/hypertension.htm", "passage_text": "Factors that cause or are associated with ocular hypertension are virtually the same as the causes of glaucoma. These include: 1  Excessive aqueous production. 2  The aqueous (or aqueous humor) is a clear fluid that is produced in the eye by the ciliary body, a structure located behind the iris. 3  The aqueous flows through the pupil and fills the anterior chamber of the eye, which is the space between the iris and the cornea. 1 If the aqueous drains too slowly from the eye, disrupting the normal balance of production and drainage of the eye's clear fluid, this too will cause high eye pressure. 2  Certain medications can have the side effect of causing ocular hypertension in certain individuals."}, {"url": "http://www.medicinenet.com/dry_eyes/page2.htm", "passage_text": "Dry eye syndrome is a common disorder of the normal tear film that results from decreased tear production, excessive tear evaporation, and an abnormality in the production of mucus or lipids normally found in the tear layer, or a combination of these. Aqueous (watery) tear deficiency is caused by either poor production of watery tears or excessive evaporation of the watery tear layer. Poor production of tears by the tear glands may be a result of age, hormonal changes, or various autoimmune diseases, such as primary Sjoegren'sjögren s, syndrome rheumatoid, arthritis or. lupus"}, {"url": "https://en.wikipedia.org/wiki/Aqueous_humour", "passage_text": "The aqueous humour is a transparent, gelatinous fluid similar to plasma, but containing low protein concentrations. It is secreted from the ciliary epithelium, a structure supporting the lens. It is located in the anterior and posterior chambers of the eye, the space between the lens and the cornea. Glaucoma is a progressive optic neuropathy where retinal ganglion cells and their axons die causing a corresponding visual field defect. An important risk factor is increased intraocular pressure (pressure within the eye) either through increased production or decreased outflow of aqueous humour."}, {"url": "http://www.eyehealthweb.com/eye-pressure/", "passage_text": "Changes in eye pressure may be caused by: 1  Excessive or decreased aqueous production. 2  Inadequate or increased aqueous drainage. 3  Long-term use of certain medications, in particular corticosteroids. 4  Eye trauma. Alcohol consumption and caffeine use also cause temporary changes in intraocular pressure, as can coughing, vomiting, or straining to lift heavy objects. A significant change in intraocular pressure that persists and remains untreated can eventually cause vision problems and lead to eye disease."}, {"url": "http://www.allaboutvision.com/conditions/hypertension.htm", "passage_text": "1 Inadequate aqueous drainage. 2  If the aqueous drains too slowly from the eye, disrupting the normal balance of production and drainage of the eye's clear fluid, this too will cause high eye pressure. 3  Certain medications can have the side effect of causing ocular hypertension in certain individuals. 1 If the aqueous drains too slowly from the eye, disrupting the normal balance of production and drainage of the eye's clear fluid, this too will cause high eye pressure. 2  Certain medications can have the side effect of causing ocular hypertension in certain individuals."}, {"url": "http://www.eyehealthweb.com/eye-pressure/", "passage_text": "Dr. Mounir Bashour. Intraocular pressure is the tissue pressure within the eye, which is determined by the balance between the production and drainage of aqueous humor, the clear fluid inside the eye. Slight changes in eye pressure from one season to another — or even during the course of a day — are normal. Alcohol consumption and caffeine use also cause temporary changes in intraocular pressure, as can coughing, vomiting, or straining to lift heavy objects. A significant change in intraocular pressure that persists and remains untreated can eventually cause vision problems and lead to eye disease."}, {"url": "http://courses.washington.edu/conj/sensory/glaucoma.htm", "passage_text": "The increased intraocular pressure is due to excessive accumulation of aqueous humor. Aqueous humor is formed in the ciliary body, flows through the pupil, and exits through the trabecular network, which is found in the angle between the cornea and iris. "}, {"url": "http://www.rightdiagnosis.com/symptoms/excessive_mucus_production/causes.htm", "passage_text": "Causes of Excessive mucus production: The following medical conditions are some of the possible causes of Excessive mucus production. There are likely to be other possible causes, so ask your doctor about your symptoms. 1  Acute bronchitis. 2  Asthma. 3  Anaphylaxis. 4  Nasal polyps. 5  Tuberculosis. 6  Esophageal cancer. 7  COPD. Conditions listing medical symptoms: Excessive mucus production: The following list of conditions have ' Excessive mucus production ' or similar listed as a symptom in our database."}]