[{"url": "http://www.babynamesofireland.com/kean", "passage_text": "Kean. Meaning of the name Kean. Listen and learn how to pronounce Kean so you can get the correct pronunciation for this boy name. Meaning of the name Kean. MEANING: From cian “”ancient, enduring.”” In legend Cian Mac Mael Muad was the son-in-law of Brian Boru (read the legend) who led the armies from the province of Munster to victory over the invading Vikings at the Battle of Clontarf in 1014, a battle in which both he and Brian were killed."}, {"url": "http://www.sheknows.com/baby-names/name/keane", "passage_text": "Irish Meaning: The name Keane is an Irish baby name. In Irish the meaning of the name Keane is: Ancient. English Meaning: The name Keane is an English baby name. In English the meaning of the name Keane is: Sharp. Celtic Meaning: The name Keane is a Celtic baby name. In Celtic the meaning of the name Keane is: Tall and handsome. "}, {"url": "http://www.ancestry.com/name-origin?surname=keane", "passage_text": "You can find out where the majority of the Keane families were living before they immigrated to the U.S and learn where to focus your search for foreign records. Immigration records can tell you an ancestor's name, ship name, port of departure, port of arrival, and destination. from the New York Passenger Lists. "}, {"url": "http://www.thinkbabynames.com/meaning/1/Kean", "passage_text": "Kean is an unusual first name for males but a very prominent last name for both adults and children (#7533 out of 150436, Top 5%). (2000 U.S. Census). Cian and Kian (#494 last year) are the popular varying forms of Kean (unlisted) ranked in the Top 1000. Kean /kean/ [1 syll.] as a name for boys means ancient; fighter; sharp, keen wit or eye. Kean is an alternate form of Cian (Irish, Gaelic). Kean is also a form of Keane (Irish, Gaelic, Old English): actor Edmund Kean. Kreatif forms: Keanna, Keanne."}, {"url": "http://www.surnamedb.com/Surname/Kean", "passage_text": "Finally, the surname may be a variant of Keane, of Old Gaelic origin, and the Anglicized form of the Gaelic O'Cathain, the male descendant of Cathan, a personal name from cath, battle; this sept were located in West Clare. Variants of the surname include Keene, Keenes, and Keens. This interesting surname may derive from a number of possible origins. Firstly, the name may be of Anglo-Saxon origin, as a nickname for a brave or proud person, from the Olde English pre 7th Century cene, Middle English kene, fierce, brave, proud."}, {"url": "http://www.thinkbabynames.com/meaning/1/Keane", "passage_text": "Keane /kea-ne/ [1 syll.] as a boys' name is pronounced keen. It is of Irish, Gaelic and Old English origin, and the meaning of Keane is fighter; sharp, keen wit or eye. Actor Edmund Kean. Kreatif forms: Kaene, Kelne, Keonne. Keane has 1 feminine form: Keena. Keane is an uncommon first name for males but a very popular last name for all people (#3121 out of 150436, Top 2%)."}, {"url": "http://www.ancestry.com/name-origin?surname=kean", "passage_text": "You can find out where the majority of the Kean families were living before they immigrated to the U.S and learn where to focus your search for foreign records. Immigration records can tell you an ancestor's name, ship name, port of departure, port of arrival, and destination. from the New York Passenger Lists. You can find out when most of the Kean families immigrated to the United States. You can focus your search to immigration records dating from that era. Immigration records can tell you an ancestor's name, ship name, port of departure, port of arrival and destination."}]