[{"url": "http://www.fixr.com/costs/build-attached-garage", "passage_text": "1 According to author Stu Silverman the average cost of adding a garage begins at roughly $7,500, and for a two-car garage the average costs will go much higher. 2  This sort of structure will average at $27,040. 3  The resale value of this update would hold at $21,635, or a nearly 81% return on investment. For the garage addition, the typical costs include: 1  According to author Stu Silverman the average cost of adding a garage begins at roughly $7,500, and for a two-car garage the average costs will go much higher. 2  This sort of structure will average at $27,040"}, {"url": "http://www.rempros.com/installation-prices/garage_door_cost.html", "passage_text": "Cost of garage door installation varies from $240 to $950 for labor or from $530 to $3,350 including cost of 8' x 7' door and materials expenses. Garage door size, materials used for door manufacturing and type of garage door are main factors which will determine the total cost to get a new garage door installed. Prices for a standard 8’x7’ door start from $190 and adding $180 - $230 for installation the total cost will come up to $370 - $420 to get it installed. But regardless of low prices roll up garage doors are less popular options for residential properties comparing to sectional and side-hinged doors."}, {"url": "http://www.homeadvisor.com/cost/garages/install-a-garage-door/", "passage_text": "Here are some factors to consider as you look to invest in a new garage door: A garage door will cost anywhere from $200 for single doors to $4,000 for two or more doors, with better materials accounting for the higher cost. Most homeowners report spending about $1,060 for the door and installation. Purchasing extra remotes and getting openers set up for operation will typically range from $100 to $400, which will add to the overall cost of the garage door installation. If your opener works with the new door, you won't need to have it replaced."}, {"url": "http://www.fixr.com/costs/install-garage-door", "passage_text": "According to DIYOrNot.com, it should cost between $500 and $800 to install a single new garage door. They demonstrate that the average homeowner can usually tackle such a project in a nine hour time span and a professional will be able to complete it in roughly five hours. "}, {"url": "http://www.rempros.com/installation-prices/garage_door_cost.html", "passage_text": "Cost to install a roll-up garage door. Roll up garage door is one of the cheapest options. Prices for a standard 8’x7’ door start from $190 and adding $180 - $230 for installation the total cost will come up to $370 - $420 to get it installed. But regardless of low prices roll up garage doors are less popular options for residential properties comparing to sectional and side-hinged doors."}, {"url": "http://home.costhelper.com/build-garage.html", "passage_text": "Grittihs) we got a quote in less than 45 mins. for a 1.5 car garage the estimate is $12,354 for a 2 car garage (with a short approaching driveway) will cost us $16,325 this includes the demolition of old garage, 30 year roof, all electrical, slab, garage door, an entrance door and 1 window. 1 Plans for simple or elaborate garages run $20-$200; the book Build Your Own Garage Manual sells for less than $12. 2  Do-it-yourself plans or kits are available through Archway Press, FirstDayCottage.com, HomePlaceStructures.com, ABetterGarage.com and ABetterPlan.com."}, {"url": "http://home.costhelper.com/build-garage.html", "passage_text": "1 Accomplished do-it-yourselfers can cut costs considerably; materials for a single-car garage with a door but no windows start at $3,000-$4,000, depending on the size and style. 1 Plans for simple or elaborate garages run $20-$200; the book Build Your Own Garage Manual sells for less than $12. 2  Do-it-yourself plans or kits are available through Archway Press, FirstDayCottage.com, HomePlaceStructures.com, ABetterGarage.com and ABetterPlan.com."}, {"url": "http://home.costhelper.com/build-garage.html", "passage_text": "1 Upgrading the quality of materials can bump the cost to $55 a square foot, or $13,200 for a minimum single-car structure, $21,000 for a two-car garage and $47,000 or more for the dream version. 1 Plans for simple or elaborate garages run $20-$200; the book Build Your Own Garage Manual sells for less than $12. 2  Do-it-yourself plans or kits are available through Archway Press, FirstDayCottage.com, HomePlaceStructures.com, ABetterGarage.com and ABetterPlan.com."}, {"url": "http://www.homewyse.com/services/cost_to_install_garage_door.html", "passage_text": "$1,198.44. Get an INSTANT estimate of the cost to Install a Garage Door! Our free calculator uses recent, trusted data to estimate costs for your Garage Door Installation project. For a basic 1 door project in zip code 47474, the benchmark cost to Install a Garage Door ranges between $695.35 - $1,198.44 per door. To estimate costs for your project: 1. Set Project Zip Code Enter the Zip Code for the location where labor is hired and materials purchased."}]