[{"url": "http://www.spinning.com/en/energy_zone_chart", "passage_text": "Spinning Energy Zone™ Heart Rate Chart. Wearing a heart rate monitor while exercising provides instant, continuous heart rate display that keeps you in check with your training goals. Endurance Energy Zone™. The lowdown: Endurance training is your foundation and should constitute the bulk of your workouts. "}, {"url": "http://www.about-bicycles.com/exercise-bike-reviews/exercise-bike-heart-rate-monitors.html", "passage_text": "Some models also come with telemetry enabled consoles which can monitor your heart rate from a compatible chest strap transmitter (most are Polar compatible but do not come with the chest strap). This is a much better option for monitoring your heart rate. Some models will have integrated HRC programs which will increase and decrease the exercise bike resistance to keep you within your target heart rate zone. This option is more common on other fitness equipment than it is on exercise bikes."}, {"url": "http://livehealthy.chron.com/heart-rate-stationary-bike-4164.html", "passage_text": "Checking Your Heart Rate. During many forms of exercise, it's necessary to find your pulse and count the beats to determine your heart rate. But when you use a stationary bike, the machine might be equipped with a heart-rate sensor. Before your workout, familiarize yourself with the machine's controls"}, {"url": "http://www.fitday.com/fitness-articles/fitness/cardio/exercise-bikes-aerobic-workout.html", "passage_text": "If you are just starting out on your fitness regimen, try to work out for at least 30 to 45 minutes. Monitoring your heart rate is crucial to an effective aerobic workout on an exercise bike. As previously mentioned, your heart rate should fall in the range of 70%-80% of your maximum heart rate. "}, {"url": "http://www.about-bicycles.com/exercise-bike-reviews/exercise-bike-heart-rate-monitors.html", "passage_text": "You can purchase a separate heart rate watch and chest strap transmitter to monitor your heart rate independently of the exercise bike, of course, but it will not be as convenient as having the data transmitted to the console and integrated with your other workout stats. Some models will have integrated HRC programs which will increase and decrease the exercise bike resistance to keep you within your target heart rate zone. This option is more common on other fitness equipment than it is on exercise bikes."}, {"url": "http://scienceblogs.com/principles/2011/07/28/how-does-the-pulse-meter-on-ou/", "passage_text": "Better to use your brain cycles on the wonders of the ECG and the heart instead of a dinky heart rate monitor in exercise equipment. 8). #7 Lurker #753 July 28, 2011. The 10-second thing is just an artifact of how the programmer fitted the problem into a very simple generic signal processor chip. "}, {"url": "http://livehealthy.chron.com/heart-rate-stationary-bike-4164.html", "passage_text": "As you ride the bike, your heart rate should be within your target zone, which is 50 to 85 percent of your maximum heart rate. Your maximum heart rate is 220 minus your age. For example, a person who is 35 years old has a maximum heart rate of 185 beats per minute and a target heart rate of 93 to 157 beats per minute. During many forms of exercise, it's necessary to find your pulse and count the beats to determine your heart rate. But when you use a stationary bike, the machine might be equipped with a heart-rate sensor."}, {"url": "http://www.about-bicycles.com/exercise-bike-reviews/exercise-bike-heart-rate-monitors.html", "passage_text": "Most of the better Upright and Recumbent exercise bikes will come with the handle grip contact heart rate monitors. Keep in mind that the handle grip heart rate monitors will not be as accurate as the chest strap monitors. Some models will have integrated HRC programs which will increase and decrease the exercise bike resistance to keep you within your target heart rate zone. This option is more common on other fitness equipment than it is on exercise bikes."}, {"url": "http://www.livescience.com/42220-heart-rate-monitors.html", "passage_text": "Heart rate monitors provide immediate feedback on how hard you are working out so that you can make adjustments to get the greatest benefit from your exercise regimen. The goal is to exercise within your target heart rate zone for maximum impact. Heart rate monitors generally come in two types — either a wireless chest strap that sends data to a monitor worn on the wrist, or pulse monitor worn on the wrist that requires you to put your finger on a certain spot to take your pulse."}]