[{"url": "http://www.rsc.org/Education/Teachers/Resources/cfb/Photosynthesis.htm", "passage_text": "Photosynthesis Photosynthesis is the process by which plants, some bacteria and some protistans use the energy from sunlight to produce glucose from carbon dioxide and water. This glucose can be converted into pyruvate which releases adenosine triphosphate (ATP) by cellular respiration. Oxygen is also formed. "}, {"url": "https://msu.edu/~potters6/te801/Biology/biounits/respiration.htm", "passage_text": "Cellular respiration is the process by which the chemical energy of food molecules is released and partially captured in the form of ATP. Carbohydrates, fats, and proteins can all be used as fuels in cellular respiration, but glucose is most commonly used as an example to examine the reactions and pathways involved. Plants go through a process known as photosynthesis. Photosynthesis can be thought of as the opposite process of cellular respiration. Through two processes known as the light reactions and the dark reactions, plants have the ability to absorb and utilize the energy in sunlight."}, {"url": "http://biology-forums.com/index.php?topic=41672.0", "passage_text": "Credits: 10. 0 0. Rep: 3 years ago. Photosynthesis: Reactants Water, Light, Carbon Dioxide. Cellular Respiration: Reactants Oxygen, Sugars. Products Carbon Dioxide, Water, Light. Photosynthesis' reactants and products are just the switched version of cellular respiration, and vice versa. By 'light' for cellular respiration, I'm assuming it just means energy. "}, {"url": "http://www.bbc.co.uk/schools/gcsebitesize/science/add_ocr_21c/life_processes/plantfoodrev1.shtml", "passage_text": "Photosynthesis is a process used by plants in which energy from sunlight is used to convert carbon dioxide and water into molecules needed for growth. These molecules include sugars, enzymes and chlorophyll. Light energy is absorbed by the green chemical chlorophyll. "}, {"url": "http://www.chemicalformula.org/photosynthesis", "passage_text": "Solar energy is converted into chemical energy. Photosynthesis is the process whereby plants using light energy from the sun convert carbon dioxide and water to glucose sugar and oxygen gas through a series of reactions. The overall equation for photosynthesis is. "}, {"url": "http://www.answers.com/Q/What_are_the_reactants_and_products_of_photosynthesis", "passage_text": "Carbon Dioxide, and water are the reactants. Glucose and oxygen are the products. Just remember there are other products that are made in the process of photosynthesis, but ar … e used elsewhere. An example of this is NADPH. NADPH is a product of PS1, but then is used in the Calvin Cycle. Carbon dioxide and water are the two reactants, and carbohydrates (glucose) and oxygen are the end products. Sunlight is the energy source for the endothermic reaction. Along with glucose, products including ATP and other intermediary chemicals are produced."}, {"url": "http://www.answers.com/Q/What_reactants_are_involved_in_photosynthesis", "passage_text": "The reactants that are involved in photosynthesis are carbon dioxide, water, and sunlight. Answered by The Community. Making the world better, one answer at a time. The reactants that are involved in photosynthesis are carbon dioxide, water, and sunlight. These reactants mix to form food for the plant and oxygen for animals."}, {"url": "https://en.wikipedia.org/wiki/Photosynthesis", "passage_text": "This chemical energy is stored in carbohydrate molecules, such as sugars, which are synthesized from carbon dioxide and water – hence the name photosynthesis, from the Greek φῶς, phōs, light, and σύνθεσις, synthesis, putting together. Carbon dioxide is converted into sugars in a process called carbon fixation. Carbon fixation is an endothermic redox reaction, so photosynthesis needs to supply both a source of energy to drive this process, and the electrons needed to convert carbon dioxide into a carbohydrate."}, {"url": "https://en.wikipedia.org/wiki/Photosynthesis", "passage_text": "Photosynthesis is a process used by plants and other organisms to convert light energy, normally from the Sun, into chemical energy that can be later released to fuel the organisms' activities. Carbon dioxide is converted into sugars in a process called carbon fixation. Carbon fixation is an endothermic redox reaction, so photosynthesis needs to supply both a source of energy to drive this process, and the electrons needed to convert carbon dioxide into a carbohydrate."}, {"url": "http://www.globalchange.umich.edu/globalchange1/current/lectures/kling/energyflow/PSN_primer.html", "passage_text": "The process of photosynthesis is broken up into two main groups of reactions: the light reactions which require light energy to operate, and the Calvin cycle which specifically takes carbon dioxide and turns it into organic molecules. Photosynthesis. The net process of photosynthesis is described by the following equation: 6CO2 + 6H2O + Light Energy = C6H12O6 + 6O2. This equation simply means that carbon dioxide from the air and water combine in the presence of sunlight to form sugars; oxygen is released as a by-product of this reaction."}]