[{"url": "http://www.indianmirror.com/ayurveda/indian-spices/parsley.html", "passage_text": "Exceedingly nutritious, parsley can be found in your neighboring supermarket. Parsley is the world's most accepted herbs. It gets its name from the Greek word denoting rock celery. It is a vertical, biennial plant with a plump sweet-smelling tap root and dark shimmering leaves which climb from a little stem. Leaves and seeds are the parts that are used as a spice. The smell of the herb is very characteristic, sweet-smelling and spicy due to its volatile oil presence. Common Names. Petroselinum crispum is the biological name of parsley. In the in Indian common languages ie., in Hindi it is called as Ajmood, in Kannada it is called as Achu-Mooda, in Malayalam it is called as Seema malli"}, {"url": "http://www.indianetzone.com/1/parsley.htm", "passage_text": "Parsley, also known as Petroselinum Hortense, is a species of Petroselinum that belongs to the Apiaceae family. The garden variety of the Indian herb Parsley is usually bright green and hairless biennial plant. The ideal temperature to cultivate Parsley is 22-30 degree Celsius and it usually grows from seed. Parsley is called in various other names in India. Curly parsley is usually utilised as a garnish. Green parsley is generally used as a garnish on rice dishes, potato dishes, on fried chicken, fish, lamb, goose, meat, steaks or vegetable stews. However, parsley should not be consumed in excess as large amounts can have uterotonic effects on the consumer"}, {"url": "https://en.wikipedia.org/wiki/Petroselinum_crispum", "passage_text": "Parsley is widely used in Middle Eastern, European, and American cooking. Curly leaf parsley is often used as a garnish. In central and eastern Europe and in western Asia, many dishes are served with fresh green chopped parsley sprinkled on top. Root parsley is very common in central and eastern European cuisines, where it is used as a snack or a vegetable in many soups, stews, and casseroles."}, {"url": "http://www.answers.com/Q/What_is_the_Kannada_word_for_'parsley_leaves'", "passage_text": "1 Delicious Gourmet Recipe Ideas With Fresh Parsley Parsley is one of the most popular herbs in the world, but people in the Western world only know it as a garnish, served in a tiny sprig on a dish. 2  For this reason, if you fi…. 1 Parsley storage is very simple and takes very little time and thought. 2  Use your fresh parsley in marinades, salads, sauces an…. 3  Parsley Sauce for Fish and Other Dishes Parsley is one of the most popular herbs in America. 4  Despite this fact, in many cases it is used mainly as a garnish."}, {"url": "http://www.answers.com/Q/What_is_the_Kannada_word_for_'parsley_leaves'", "passage_text": "In simple words its a herb. Parsley (Petroselinum crispum) is in the same family (Apiaceae) as parsnip, celery, dill, and carrots. The word parsley comes from the Latin petr … os selinon, meaning rock celery.. 1 Parsley storage is very simple and takes very little time and thought. 2  Use your fresh parsley in marinades, salads, sauces an…. 3  Parsley Sauce for Fish and Other Dishes Parsley is one of the most popular herbs in America. 4  Despite this fact, in many cases it is used mainly as a garnish."}, {"url": "http://www.answers.com/Q/What_is_the_Kannada_word_for_'parsley_leaves'", "passage_text": "1 Parsley Sauce for Fish and Other Dishes Parsley is one of the most popular herbs in America. 2  Despite this fact, in many cases it is used mainly as a garnish. 3  It has a bright green color, and when chopped finely and…. 1 Parsley storage is very simple and takes very little time and thought. 2  Use your fresh parsley in marinades, salads, sauces an…. 3  Parsley Sauce for Fish and Other Dishes Parsley is one of the most popular herbs in America. 4  Despite this fact, in many cases it is used mainly as a garnish."}, {"url": "http://www.onlyfoods.net/parsley.html", "passage_text": "Parsley is the most commonly used platter garnish and sandwich filling around the world. Its mild flavor enhances the taste of the dishes. It makes a significant part of daily American, European and Middle Eastern cuisines. It is a species of Petroselinum and belongs to the family of Apiaceae. 1 It is widely and most commonly used as a garnish. 2  It can be used in salads. 3  It contains carminative and anti-septic properties, hence, used a poultice. 4  Parsley leaves extraction can be used for its diuretics effects."}]