[{"url": "https://en.wikipedia.org/wiki/Batman", "passage_text": "Finger received credit as a creator of Batman for the first time in a comic in October 2015 with Batman and Robin Eternal #3 and Batman: Arkham Knight Genesis #3. The updated acknowledgement for the character appeared as Batman created by Bob Kane with Bill Finger. Batman was one of the few superhero characters to be continuously published as interest in the genre waned during the 1950s. In the story The Mightiest Team in the World in Superman #76 (June 1952), Batman teams up with Superman for the first time and the pair discovers each other's secret identity."}, {"url": "http://batman.wikia.com/wiki/The_Penguin", "passage_text": "The Penguin (Oswald Chesterfield Cobblepot) is a DC Comics supervillain and an enemy of Batman. He was introduced by artist Bob Kane and writer Bill Finger, he first appeared in Detective Comics #58 (December 1941). Penguin appeared in a variety of episodes from The Batman/Superman Hour during its year long run (1968-1969). He appeared to a similar, classic, standard to what Burgess Meredith did in the Batman TV show (which ended shortly before this show aired)."}, {"url": "http://www.answers.com/Q/When_did_Batman_First_Appear", "passage_text": "Superman first appeared in Action Comics #1 in 1938 while Batman first appeared in Detective Comics #27 in 1939. Bruce Wayne's father, Thomas Wayne, dressed up like a Bat-Man for a costume party when Bruce was a little boy (he still has the costume), but Bruce himself was the first person to use a Batman persona to fight crime."}, {"url": "https://en.wikipedia.org/wiki/Batman", "passage_text": "Batman is a fictional superhero appearing in American comic books published by DC Comics. The character was created by artist Bob Kane and writer Bill Finger, and first appeared in Detective Comics #27 (May 1939). Batman was one of the few superhero characters to be continuously published as interest in the genre waned during the 1950s. In the story The Mightiest Team in the World in Superman #76 (June 1952), Batman teams up with Superman for the first time and the pair discovers each other's secret identity."}, {"url": "https://uk.answers.yahoo.com/question/index?qid=20080716005037AA7OIEh", "passage_text": "Report Abuse. Batman first appeared in 1939 in Detective Comics. While he has no superpowers, Batman is the alter-ego of Bruce Wayne, a millionaire who became The World's Greatest Detective through training, study, and lots of Bat gadgets. "}, {"url": "http://www.tor.com/2011/01/31/big-screen-batman-the-1943-and-1949-batman-serials/", "passage_text": "Batman’s first big-screen appearance came in a 1943 serial by Columbia Pictures, who produced another in 1949. In the days before television when movie theaters provided the only audiovisual entertainment available, serials were popular and an essential part of the moviegoing experience; basically, TV before TV. "}, {"url": "http://www.answers.com/Q/When_did_Batman_First_Appear", "passage_text": "Then Robert Lowery in 1939 in Batman and Robin: Relentless Crusaders for Justice! it was the year 1943 in … which Lewis Wilson frist played the role of Batman in the first 15 serials. and 1949 in which Robert lowery played Batman in the second set of 15 serials. Bruce Wayne's father, Thomas Wayne, dressed up like a Bat-Man for a costume party when Bruce was a little boy (he still has the costume), but Bruce himself was the first person to use a Batman persona to fight crime."}, {"url": "https://en.wikipedia.org/wiki/Batman_(comic_book)", "passage_text": "Sprang's first original published Batman work, and first interior-story work, appeared in Batman #19 (Oct.-Nov. 1943), for which he drew the cover and the first three Batman stories, and penciled the fourth Batman story, inked by Norm Fallon. The character of Batman made his first appearance in the pages of Detective Comics #27 in May 1939. In Spring of 1940, Batman #1 was published and introduced new characters into Batman's pantheon, most notably those of Catwoman and Batman's eventual nemesis, the Joker."}, {"url": "https://en.wikipedia.org/wiki/Batman_(comic_book)", "passage_text": "Batman is an ongoing comic book series featuring the DC Comics hero of the same name. The character first appeared in Detective Comics #27 (cover dated May 1939). Batman proved to be so popular that a self-titled ongoing comic book series began publication in the spring of 1940. It was first advertised in early April 1940, one month after the first appearance of his new sidekick, Robin, the Boy Wonder. The character of Batman made his first appearance in the pages of Detective Comics #27 in May 1939. In Spring of 1940, Batman #1 was published and introduced new characters into Batman's pantheon, most notably those of Catwoman and Batman's eventual nemesis, the Joker."}]