[{"url": "http://neutral-izer.blogspot.com/2007/09/how-long-does-caffeine-stay-in-your.html", "passage_text": "As long as caffeine is in your blood, it's effects will also manifest. The time it takes for the body to eliminate one half of a caffeine dose is normally between 3 to 12 hours. It is called the half-life of caffeine. Several factors can shorten or lengthen the half life of caffeine. Smoking, medications and diseases are some factors."}, {"url": "https://www.sharecare.com/health/coffee-drink-health/take-caffeine-leave-your-system", "passage_text": "The half-life, which is the time required by the body to metabolize or inactivate 1/2 of a substance activity, for caffeine (doses lower than 4.50mg/lb) ranges from 2.5 to 10hrs. Meaning, caffeine has little to no pharmacological effect after this time but may still be present in small amounts in the body. "}, {"url": "https://answers.yahoo.com/question/index?qid=20071115065117AAH2HGl", "passage_text": "My doctor told me to stop drinking caffeine and drinks with alot of sugar. So I did. It has only been two days, but I was wondering how long it would take to get out of my system, simply because I still feel tired all day.. I feel like I am gonna fall asleep. I was feeling dizzy to when i stood up or cleaned for longer than 10 minutes. That part has went away, but I still feel extremely tired."}, {"url": "http://www.livestrong.com/article/349564-how-to-flush-the-body-of-caffeine/", "passage_text": "Caffeine is metabolized in the liver, and has a half-life of four to five hours, which is the amount of time it takes for your liver to flush out half of the caffeine you've consumed. Certain conditions, such as liver disease and pregnancy, can increase the time it takes the liver to clear the caffeine from your body. "}, {"url": "https://au.answers.yahoo.com/question/index?qid=20090204230630AA7XBeL", "passage_text": "Best Answer: It depends upon your fitness, metabolism, height, weight, gender, & other health variables. The amount of other non-caffeinated beverages in your system. How much caffeine you've had & how accustomed your body is to it. How much you've eaten or not eaten. If you've taken any other diuretics (since caffeine is itself a diuretic). What medications are in your system-prescribed & over-the-counter. "}, {"url": "https://answers.yahoo.com/question/index?qid=20071115065117AAH2HGl", "passage_text": "Report Abuse. Caffeine has a half life in the body of 3 hours. After you drink a cup of coffee and it has say 100mg of caffeine in 3 hours your body has broken down half of it, after 6 hours you would have 25mg etc. It has only been two days, but I was wondering how long it would take to get out of my system, simply because I still feel tired all day.. I feel like I am gonna fall asleep. I was feeling dizzy to when i stood up or cleaned for longer than 10 minutes. That part has went away, but I still feel extremely tired."}, {"url": "http://www.dotfit.com/content-35789.html", "passage_text": "Print Version. The half-life, which is the time required by the body to metabolize or inactivate 1/2 of a substance activity, for caffeine (doses lower than 4.50mg/lb) ranges from 2.5 to 10hrs. Meaning, caffeine has little to no pharmacological effect after this time but may still be present in small amounts in the body. The variability in rates of elimination is due to an individual’s efficiency in metabolizing caffeine, not absorption. The modern average cup (8oz) of coffee may contain 100-200mgs of caffeine so its effects should be inactivated within 2-5hrs depending on individuality. But it may take the full day to eliminate all traces of caffeine from the body"}, {"url": "http://www.livestrong.com/article/272782-how-long-does-coffee-caffeine-stay-in-your-system/", "passage_text": "Onset and Duration. It takes approximately 15 to 45 minutes for caffeine to reach its peak levels in your bloodstream. Caffeine has a half-life of approximately five to six hours, meaning that it takes this long for its concentration in your bloodstream to reduce by half. Timing of Caffeine's Effects. Amounts of caffeine up to 250 milligrams show very few ill effects and may help individuals feel more alert. Doses exceeding 1,000 milligrams may affect sleep and cognitive performance."}, {"url": "http://www.caffeineinformer.com/caffeine-metabolism", "passage_text": "Advertisement. It only takes 45 minutes for 99% of the caffeine to be absorbed through these membranes. In humans the half-life for caffeine is anywhere from 4 to 6 hours on average, which explains why the average energy drink or coffee’s effect lasts about 4 to 6 hours. "}]