[{"url": "https://answers.yahoo.com/question/index?qid=20080213135605AAjP2ls", "passage_text": "Best Answer: Too much....find a local vet. Banfield is a large corporate chain that hires vets with no experience and then charges you twice as much as what you would pay an experienced vet. And, they try to sell you everything in the world too. Source(s): dogperson · 8 years ago. Banfield charges like $35 for an office visit.....no thanks especially since i have two dogs and the office visit fee does NOT include meds or other services that may be needed. For my puppy, each visit for his set of shots comes out to about $30 and approx 3 visits are needed to complete the puppy shots"}, {"url": "http://www.salarylist.com/company/Banfield-Pet-Hospital-Salary.htm", "passage_text": "Banfield Pet Hospital Salary. Banfield Pet Hospital average salary is $52,000, median salary is $52,000 with a salary range from $52,000 to $52,000. Banfield Pet Hospital salaries are collected from government agencies and companies. Each salary is associated with a real job position. "}, {"url": "http://www.indeed.com/cmp/Banfield-Pet-Hospital/salaries", "passage_text": "Average Banfield Pet Hospital hourly pay ranges from approximately $8.00 per hour for Nurse to $61.60 per hour for Veterinarian. Salary information comes from 556 data points collected directly from employees, users, and jobs on Indeed. The average Banfield Pet Hospital salary ranges from approximately $15,000 per year for Nurse to $250,000 per year for Facility Coordinator."}, {"url": "http://www.banfield.com/preventive-care/optimum-wellness-plans", "passage_text": "No, they are different. With pet insurance, you pay for coverage you may never use. But with an Optimum Wellness Plan, your veterinarian provides all the recommended preventive pet care you've paid for—helping your pet, and giving you a great value. See Comparison Chart. "}, {"url": "http://www.banfield.com/preventive-care/optimum-wellness-plans/owp-faq", "passage_text": "It’s a pet health plan you will actually use. With an Optimum Wellness Plan, we partner with you to combine physical exams, vaccinations, disease screenings and other pet health necessities into one affordable veterinary care package for your dog, puppy, kitten or cat. Optimum Wellness Plans offer proactive, as opposed to reactive, veterinary care. While pet insurance offers coverage for many unforeseen circumstances, our preventive care approach allows us to see, treat and prevent those problems ahead of time."}, {"url": "http://www.embracepetinsurance.com/compare/banfield-pet-insurance", "passage_text": "A pet insurance plan would reimburse you around 80% or 90% of the cost after your deductible. You can read a few of our sample claims stories to get a feel for how much modern veterinary treatment can cost and how a personalized pet insurance policy with Embrace can help you pay for it. Banfield has over 800 pet hospitals across the United States located in Petsmart stores and thousands of Banfield customers have Banfield Optimum Wellness Plans. But it's important to understand that there is (currently) no such thing as Banfield pet insurance"}, {"url": "http://www.embracepetinsurance.com/compare/banfield-pet-insurance", "passage_text": "Banfield Pet Insurance. Banfield has over 800 pet hospitals across the United States located in Petsmart stores and thousands of Banfield customers have Banfield Optimum Wellness Plans. But it's important to understand that there is (currently) no such thing as Banfield pet i"}]