[{"url": "http://www.registerednursern.com/labor-and-delivery-nurse-how-to-become-a-labor-and-delivery-nurse/", "passage_text": "The field of nursing is filled with opportunities for labor and delivery nurses. The employment opportunities for labor and delivery nurse jobs are expected to increase by 22% by 2018. Specialized nurses are highly sought after in the nursing profession. Completing an associate’s degree in nursing or a bachelor’s degree is the most common way to become a labor and delivery nurse. Some may even complete a diploma program offered by a qualifying hospital. Most hospitals require an educational level of a bachelor’s or higher for positions as"}, {"url": "http://work.chron.com/labor-delivery-nurse-school-requirements-10193.html", "passage_text": "Anyone aspiring to work as a labor and delivery nurse must first become a registered nurse, according to the Education Portal website. Begin by enrolling in one of three avenues to become a nurse -- a diploma program, associate’s degree in nursing or a bachelor's degree in nursing. "}, {"url": "http://nursingschoolprograms.net/careers/labor-and-delivery-nurse/", "passage_text": "Salary information courtesy of PayScale http://www.payscale.com. How to become a labor and delivery nurse. To become a labor and delivery nurse, the candidate: 1  Must have an Associate of Science in Nursing (ASN) or a Bachelor of Science in Nursing (BSN) and have passed the National Council Licensure Examination (NCLEX-RN). 2  May pursue additional education in obstetrics."}, {"url": "http://www.lpn.com/types-of-nurses/labor-delivery-nurse/", "passage_text": "Labor and delivery nurses are nurses that assist women during the process of childbirth. Labor and delivery nurses are very similar to perinatal nurses, only they just assist during labor verses seeing the woman during the entire pregnancy like perinatal nurses do. Salary. The average yearly salary for a nurse specializing in labor and delivery is approximately $55,000 a year. A labor and delivery nurse who has several years of experience can expect to make closer to $70,000 or more. Those nurses with a master’s degree or higher can also make a significantly higher annual salary. The annual pay level for a labor and delivery nurse is often higher in metropolitan areas verses rural areas"}, {"url": "http://allnurses.com/ob-gyn-nursing/becoming-a-labor-43818.html", "passage_text": "I am new student nurse at Drexel University I will be finished by next August 22,2003. I am really interested in becoming a labor and delivery nurse however I have been looking at the job openings for labor and delivery nurses and they want you to have at least one year of experience. "}, {"url": "http://www.innerbody.com/careers-in-health/how-to-become-a-labor-and-delivery-nurse.html", "passage_text": "Work Environment. L&D nurses work in hospitals as staff nurses on a labor and delivery or women’s health unit. Some facilities have one area for labor, delivery, and recovery and a separate unit for postpartum care. Others have an all-in-one area where patients go through the entire hospital stay in a single private room. Training. LPNs and RNs learn L&D on the job. Most degree programs have a class and/or clinical experiences in maternal and child health, but nursing students cannot choose a specialty as undergraduates and may only get a brief look into the field before they move to another area of study."}, {"url": "http://study.com/articles/How_to_Become_a_Labor_and_Delivery_Nurse.html", "passage_text": "Step One: Pursue Nursing Training. Prospective labor and delivery nurses must first obtain nursing training, such as an associate's degree in nursing (ADN), a bachelor's degree in nursing, or a nursing diploma from an accredited nursing school or hospital. "}, {"url": "http://www.innerbody.com/careers-in-health/how-to-become-a-labor-and-delivery-nurse.html", "passage_text": "The term labor and delivery (L&D) nurse does not adequately describe the wide scope of this branch of the nursing profession. L&D nurses must be quick thinkers, good communicators, and rapid assessors to treat unpredictable shifts in the health of mom and baby with compassion and safety. Training. LPNs and RNs learn L&D on the job. Most degree programs have a class and/or clinical experiences in maternal and child health, but nursing students cannot choose a specialty as undergraduates and may only get a brief look into the field before they move to another area of study."}, {"url": "http://www.villanovau.com/resources/nursing/labor-delivery-nurse-job-description/", "passage_text": "In most cases, qualifying for nursing jobs requires graduation from an accredited school of nursing and state-required licensure. Labor and delivery nurses are typically required to have advanced nursing skills and experience to provide professional and technical care to patients. When hiring for specializations, employers may prefer to hire candidates with advanced education, such as a Bachelor of Science in Nursing (BSN) degree. Labor and Delivery Duties and Responsibilities. Labor and delivery nurses care for women and their infants during labor and childbirth. They are responsible for assisting, supporting and educating women during the four stages of delivery: antepartum, intrapartum, postpartum and neonatal."}]