[{"url": "http://extension.psu.edu/animals/poultry/topics/general-educational-material/incubation/science-of-incubation/humidity-and-ventilation", "passage_text": "This is critical on homemade incubators. It is possible to suffocate the eggs and chicks in air-tight container. The relative humidity of the air within an incubator for the first 18 days should be able 60 percent. During the last 3 days (the hatching period) the relative humidity should be nearer 65-70 percent. Too much moisture in the incubator prevents normal evaporation and results in a decreased hatch, but excessive moisture is seldom a problem in small incubators."}, {"url": "http://extension.psu.edu/animals/poultry/topics/general-educational-material/incubation/science-of-incubation/humidity-and-ventilation", "passage_text": "Humidity and Ventilation. The relative humidity of the air within an incubator for the first 18 days should be able 60 percent. During the last 3 days (the hatching period) the relative humidity should be nearer 65-70 percent. Too much moisture in the incubator prevents normal evaporation and results in a decreased hatch, but excessive moisture is seldom a problem in small incubators."}, {"url": "http://porterturkeys.com/egghatchingtips.htm", "passage_text": "Turkey Egg Hatching Tips. This is some basic info to help you get the most successful hatch possible out of your turkey eggs. These are my methods and they work for me, if you have a method that works great than by all means continue with it. This is just for those who would like a little guidance. Before you place eggs in an incubator make sure the temp is regulating at 100.5 to 101.5 degrees for still air machines or 99.5 to 100 degrees for forced air incubators with a relative humidity in the room of 50-60 %. I recommend a digital thermometer and hygrometer if you don’t have these already. "}, {"url": "http://www.fertilehatchingeggs.net/turkey/", "passage_text": "So, make sure you thoroughly wash your hands before handling or turning the eggs. Stop turning the eggs about three days before they are due to hatch, or around day 24 of the 28-day incubation period. In addition, make sure that the humidity level during hatching is around 68 to 70 percent. Turkey eggs are typically used for hatching poults, or baby turkeys. Therefore, hatching eggs of this type is more prudent than, say, selling them commercially as hens lay far more eggs per year. While the turkey only lays about 100 eggs during a timeframe of 30 weeks, hens lay as many as 300 eggs annually."}, {"url": "http://www.wikihow.com/Hatch-Turkey-Eggs-in-an-Incubator", "passage_text": "On the 25th day, stop turning the eggs. This is so the turkey can get into hatching position. In approx three days, on the 28th day, they will hatch. When turkeys hatch out, they may roll over the others' eggs, use the turning marks to keep the same side up. 1 Keep an eye on the water level underneath. 2  If you let it go too low, the incubator will get too dry. 3  The relative humidity during hatching time should be 65% or more to prevent the turkey from drying out inside its cracked shell and dying during hatching. 4  Handle the eggs as little as possible."}, {"url": "http://farmingfriends.com/incubating-turkey-eggs/", "passage_text": "The incubation period for turkey eggs is 28 days. Incubation Temperature. The temperature in the incubator for turkey eggs is 99-99.5 degrees fahrenheit. Humidity Levels. The humidity level (wet bulb thermometer) for turkey eggs is 83-86 degrees fahrenheit. Final Day Of Egg Rotation. The final day of egg rotation for turkey eggs is day 25. Please note that all of this information is only a guide and that this information may differ according to the incubator manufacturer’s guide."}, {"url": "http://www.backyardchickens.com/t/663373/hatching-turkey-eggs", "passage_text": "Somone gave me 5 turkey hatching eggs, I researched it and found 28 days incubation, 55% humidity, and 75% humidity in lockdown. Is this correct? This is my first time with turkey eggs, or even turkeys. They are in a Brinsea Eco 20. Reply. "}, {"url": "http://www.motherearthnews.com/homesteading-and-livestock/raising-turkeys/hatching-turkey-eggs-ze0z1303zgar.aspx", "passage_text": "Hatching Turkeys. After 25 days the eggs will start to hatch. To start with, there will be just a faint pip noise. This is the time to adjust the temperature to 37°C (99°F) and up the humidity to 75 percent. When breeding turkeys, you should not count your turkeys before they are hatched. On average you can expect less than half the eggs to hatch, and of the poults, only about 30 percent can be expected to live to 2 weeks old."}, {"url": "http://lrrd.org/lrrd21/3/roma21038.htm", "passage_text": "Japanese quail eggs incubated at the lower humidity presented the highest level of hatchability (79%) compared to intermediate and high humidities. Egg weight loss was respectively 11.96%, 8.94%, and 4.89% for low, intermediate and high humidity groups. At the 15th day of incubation (360h) egg turning was stopped and the eggs were transferred to the hatcher that maintained the same temperature and relative humidity until hatch. All eggs were weighted on 1st, 5th, 10th, and 15th day of incubation and quail chicks at hatch."}]