[{"url": "http://www.biography.com/people/st-thomas-becket-9204211", "passage_text": "St. Thomas Becket, born in London, England, on December 21, 1118, was the Archbishop of Canterbury from 1162 until his murder in 1170 by King Henry II’s knights. The king had ordered his murder for refusing to give the monarchy power over the church."}, {"url": "http://www.historyonthenet.com/Historical_People/thomas_becket.htm", "passage_text": "Children-No. Died - 29th December 1170 - Murdered in Canterbury Cathedral. Thomas Becket was born in Normandy. His parents were quite rich and gave Thomas a good education. After completing his education he gained a position with Theobald, the Archbishop of Canterbury."}, {"url": "http://www.bbc.co.uk/history/historic_figures/becket_thomas.shtml", "passage_text": "Thomas Becket was born in around 1120, the son of a prosperous London merchant. He was well educated and quickly became an agent to Theobald, Archbishop of Canterbury, who sent him on several missions to Rome. Becket's talents were noticed by Henry II, who made him his chancellor and the two became close friends."}, {"url": "http://www.thsrock.net/on-campus/houses/becket", "passage_text": "Thomas Becket was born December 21, 1118, in London to an upper middle class family. He studied throughout Europe. Upon returning to England he attracted the notice of the Archbishop of Canterbury, who entrusted him with several important missions to Rome and finally made him archdeacon of Canterbury."}, {"url": "http://holyspiritinteractive.net/kids/saints/1229.asp", "passage_text": "Thomas Becket was born in London, England. After his parents died, he worked in an office. He loved hunting and other sports. When Thomas was about twenty-four, he went to work in the house of the archbishop of Canterbury and then began to study to become a priest."}, {"url": "http://www.nndb.com/people/838/000086580/", "passage_text": "Executive summary: Archbishop of Canterbury, 1162-70. Thomas Becket, by his contemporaries more commonly called Thomas of London, English chancellor and Archbishop of Canterbury under King Henry II, was born about the year 1118 in London."}, {"url": "http://spartacus-educational.com/NORbeckett.htm", "passage_text": "Thomas Becket, the son of a wealthy Norman merchant living in London, was born in 1118. After being educated in England, France and Italy, he joined the staff of Theobald, the Archbishop of Canterbury. When Henry II became king in 1154, he asked Archbishop Theobald for advice on choosing his government ministers."}]