[{"url": "https://en.wikipedia.org/wiki/Tameside", "passage_text": "There are two Grade I listed churches in Tameside, St Anne's Church, in Haughton, was built in 1881 in the Gothic Revival style by J Medland Taylor. St Michael and All Angels' Church in Ashton-under-Lyne is a 15th-century parish church which was virtually rebuilt in the 19th century.s well as coal measures running north-south through the centre of the borough, there are areas of peat in the north east and there are large areas of boulder clay all over Tameside. Ashton Moss is a peat bog covering about 107 hectares (260 acres) and Denton Moor is an area of about 81 hectares (200 acres) of peat."}, {"url": "https://en.wikipedia.org/wiki/Tameside_College", "passage_text": "Tameside College is a further education college located in Ashton-under-Lyne, Greater Manchester, England. The college offers a range of courses for students from Ashton-under-Lyne and the surrounding area. These courses include NVQs, BTECs, Apprenticeships, Access courses the college also runs adult learning in the evenings. As well as its operations from its main site in Ashton-under-Lyne, the college also operates three Local Learning Centres in Ashton-under-Lyne, Droylsden and Hyde. Tameside College also owns and operates Hyde Clarendon Sixth Form College in Hyde, offering A-Levels to local school-leavers. The College Principal is Peter Ryder."}, {"url": "http://www.tameside.gov.uk/directions", "passage_text": "How to Contact Us. Lying seven miles due east of Manchester, in the North West region of England, Tameside is a neat, compact Borough in an area of scenic beauty, industrial heritage and easy communication with the rest of the country."}, {"url": "https://en.wikipedia.org/wiki/Tameside", "passage_text": "Labour retained control of Tameside Council at the 2012 local elections with a majority of 52 seats; second was the Conservative party with 5 seats, and there were no independents elected. The Leader of the Council is Councillor Kieran Quinn.s well as coal measures running north-south through the centre of the borough, there are areas of peat in the north east and there are large areas of boulder clay all over Tameside. Ashton Moss is a peat bog covering about 107 hectares (260 acres) and Denton Moor is an area of about 81 hectares (200 acres) of peat."}, {"url": "http://www.maplandia.com/united-kingdom/england/north-west/tameside/", "passage_text": "You are in Tameside (North West, England, United Kingdom), administrative region of level 3. Continue further in the list below the place you are interested in. 1  Ashton-under-Lyne. 2  Denton. 3  Droylsden.4  Dukinfield. 5  Guide Bridge. 6  Hyde.7  Longdendale. 8  Micklehurst.rowse Tameside (United Kingdom) google maps gazetteer. Browse the most comprehensive and up-to-date online directory of administrative regions in Tameside. Regions are sorted in alphabetical order from level 1 to level 2 and eventually up to level 3 regions."}, {"url": "https://en.wikipedia.org/wiki/Tameside", "passage_text": "Tameside is bordered by the metropolitan boroughs of Stockport and Oldham to the south and north respectively, the city of Manchester to the west and the borough of High Peak in Derbyshire to the east. As well as coal measures running north-south through the centre of the borough, there are areas of peat in the north east and there are large areas of boulder clay all over Tameside. Ashton Moss is a peat bog covering about 107 hectares (260 acres) and Denton Moor is an area of about 81 hectares (200 acres) of peat."}, {"url": "http://www.manchester2002-uk.com/maps/tameside-map.html", "passage_text": "You can also access a detailed and scalable map from the www.streetmap.co.uk website by clicking here (This is a very large detailed map-please be patient and wait for it to load completely). Street level plan of ASHTON-UNDER-LYNE click here. Street level plan of STALYBRIDGE click here.(These are also very large detailed maps-please be patient and wait for them to load completely)."}, {"url": "https://en.wikipedia.org/wiki/Tameside", "passage_text": "The Metropolitan Borough of Tameside is a metropolitan borough of Greater Manchester in North West England. It is named after the River Tame, which flows through the borough and spans the towns of Ashton-under-Lyne, Audenshaw, Denton, Droylsden, Dukinfield, Hyde, Mossley and Stalybridge. As well as coal measures running north-south through the centre of the borough, there are areas of peat in the north east and there are large areas of boulder clay all over Tameside. Ashton Moss is a peat bog covering about 107 hectares (260 acres) and Denton Moor is an area of about 81 hectares (200 acres) of peat."}]