[{"url": "http://www.thekitchn.com/how-to-cook-boneless-skinless-chicken-thighs-in-the-oven-180140", "passage_text": "Just lay the chicken inside. Bake for 20 minutes or until the chicken has an internal temperature of 165°F. Boneless, skinless thighs cook quickly. Check after 20 minutes, and if they are not quite up to temperature, put back in the oven and continue cooking and checking the temperature in 5-minute increments."}, {"url": "http://www.food.com/recipe/baked-chicken-thighs-leg-quarters-199636", "passage_text": "1 Arrange chicken thighs/leg quarters skin side up in a shallow baking dish. 2  Sprinkle with garlic powder. 3  Drizzle about 1/2 teaspoon soy sauce on each piece. 4  Bake at 350 degrees Fahrenheit for 45 minutes to an hour, until the skin is crisp and brown and the meat is ready to fall off the bones."}, {"url": "http://www.bhg.com/recipes/how-to/cooking-basics/how-to-oven-bake-chicken-legs/", "passage_text": "Bake the chicken, uncovered, for 35 to 40 minutes or until the chicken is no longer pink inside. You can bake the chicken legs in a 375°F. oven, if desired. Increase the baking time to 45 to 50 minutes."}, {"url": "http://www.thekitchn.com/how-to-cook-chicken-the-easiest-simplest-method-cooking-lessons-from-the-kitchn-216562", "passage_text": "Bake for 20 to 30 minutes: The chicken is done when opaque all the way through and the meat registers at least 165°F in the thickest part. Broil for extra-crispy skin: If you'd like the skin to be a bit more crispy and golden, turn on the broiler for 2 to 3 minutes."}, {"url": "http://www.food.com/recipe/baked-chicken-thighs-leg-quarters-199636", "passage_text": "Directions. 1  Arrange chicken thighs/leg quarters skin side up in a shallow baking dish. 2  Sprinkle with garlic powder. 3  Drizzle about 1/2 teaspoon soy sauce on each piece. 4  Bake at 350 degrees Fahrenheit for 45 minutes to an hour, until the skin is crisp and brown and the meat is ready to fall off the bones."}, {"url": "http://www.answers.com/Q/How_long_should_you_cook_chicken_thighs_in_the_oven_and_at_what_temperature", "passage_text": "I usually cook bonless chicken breasts in a pre-heated oven @ 350 for 30-35mins   350 for 1 hour is comon temperature. or 375 for 45 minutes.   45 mins to an hour for bo … ne-in chicken (thighs,legs,breast) at 350 degrees ..either way,pierce it with a fork,if the juice comes out clear and NOT pink, it is cooked.    I always bake my thawed chicken breasts at 375 degrees for 50 min. and they come out juicy and fully cooked. The juices need to run clear."}, {"url": "http://allrecipes.com/recipe/235151/crispy-and-tender-baked-chicken-thighs/", "passage_text": "1 Bake chicken in the preheated oven until skin is crispy, thighs are no longer pink at the bone, and the juices run clear, about 1 hour. 2  An instant-read thermometer inserted near the bone should read 165 degrees F (74 degrees C)."}]