[{"url": "http://www.howtobuyamerican.com/bamw/bamw-040815-shrimp.shtml", "passage_text": "USA American Shrimp and Texas Longhorn Shrimp are also proud members of the Go Texan campaign, which promotes Texas agriculture. The Go Texan logo is certified by the Texas Department of Agriculture and can only be used by product members on products grown, processed or manufactured in Texas."}, {"url": "http://www.thefishsite.com/articles/87/freshwater-shrimp-production-frequently-asked-questions/", "passage_text": "Freshwater shrimp are believed to have great potential for diversification of Ohio farms. They have a short growing season (June 1st-September 15th) that fits in well with other farm activities, require little labor (20 minutes/day feeding and one long harvest day), and occupy underutilized existing water resources."}, {"url": "http://www.worldwildlife.org/industries/farmed-shrimp", "passage_text": "Shrimp is the most valuable traded marine product in the world today. In 2005, farmed shrimp was a 10.6 billion industry. Today, production is growing at an approximate rate of 10 percent annually—one of the highest growth rates in aquaculture."}, {"url": "http://worldwideaquaculture.com/freshwater-shrimp-farming-how-to-start-your-own-shrimp-farm/", "passage_text": "Raising and producing freshwater shrimp or prawns in your own aquaculture fish farm can be a profitable business. Freshwater shrimp farming is suitable mostly in the warmer climate, and is similar to marine shrimp farming in many ways because they share many of the same characteristics and problems. Marine shrimp farming began in the 1970s and quickly became popular in the United States, Western Europe, and in some Asian countries."}, {"url": "http://www.worldwildlife.org/industries/farmed-shrimp", "passage_text": "Overview. Farmed shrimp accounts for 55 percent of the shrimp produced globally. Most shrimp aquaculture occurs in China, followed by Thailand, Indonesia, India, Vietnam, Brazil, Ecuador and Bangladesh, and it has generated substantial income in these developing countries."}, {"url": "http://www.nytimes.com/2014/07/03/business/with-wild-shrimp-stocks-dwindling-farmers-step-up-to-the-plate.html", "passage_text": "Most of the shrimp the United States imports comes from farms in Latin America and in Southeast Asia, where environmental and human rights experts have long identified labor rights abuses, hazardous working conditions, damage to ecosystems and the use of hormones and antibiotics."}, {"url": "http://www.popsci.com/science/article/2011-09/new-shrimp-farming-technique-yields-record-hauls-jumbo-shrimp-minimal-water", "passage_text": "For some perspective, that's equivalent to 1 million pounds of shrimp per acre of water. U.S. shrimp farms top out at about 20,000 pounds per acre of water. The best shrimp farms in tropical climates, working year round, yield something like 60,000 pounds per acre in a good year."}, {"url": "http://www.howtobuyamerican.com/bamw/bamw-040815-shrimp.shtml", "passage_text": "When was the last time you went grocery shopping and decided to pick up some shrimp from the seafood deli? Did you bother to ask or look where the shrimp came from? The last time I was in this situation was a few months ago at a local Albertson s and I had a craving for some shrimp and some cocktail sauce to dip it in."}, {"url": "http://www.nytimes.com/2014/07/03/business/with-wild-shrimp-stocks-dwindling-farmers-step-up-to-the-plate.html", "passage_text": "Though official statistics are not yet available, the number of small indoor shrimp farms in the United States has grown from just two to at least 22 over the last five years, with dozens more in the pipeline, according to RDM Aquaculture, which provides equipment and know-how to other shrimp upstarts."}]