[{"url": "http://www.space.com/44-venus-second-planet-from-the-sun-brightest-planet-in-solar-system.html", "passage_text": "Venus, the second planet from the sun, is named for the Roman goddess of love and beauty. The planet — the only planet named after a female — may have been named for the most beautiful deity of her pantheon because it shone the brightest of the five planets known to ancient astronomers. One mountain range, called Maxwell, is about 540 miles (870 km) long and reaches up to some 7 miles (11.3 km) high, making it the highest feature on the planet. Venus also possesses a number of surface features unlike anything on Earth."}, {"url": "https://en.wikipedia.org/wiki/Venus", "passage_text": "Venus is a terrestrial planet and is sometimes called Earth's sister planet because of their similar size, mass, proximity to the Sun and bulk composition. It is radically different from Earth in other respects. Venus is one of the four terrestrial planets in the Solar System, meaning that, like Earth, it is a rocky body. In size and mass, it is similar to Earth, and is often described as Earth's sister or twin. The diameter of Venus is 12,092 km (only 650 km less than Earth's) and its mass is 81.5% of Earth's."}, {"url": "http://www.planetsforkids.org/planet-venus.html", "passage_text": "1 Venus is the planet which is closest to the Earth and is a little smaller than the Earth. 2  The diameter of the Earth (the distance right round the middle of the Earth at the equator) is 12,760 kilometres, or 7926 miles. 3  The diameter of Venus is 12,103 kilometres, or 7520 miles. 1 Venus is called after the Roman Goddess of love and beauty. 2  Venus is the planet which is closest to the Earth and is a little smaller than the Earth. 3"}, {"url": "http://www.space.com/44-venus-second-planet-from-the-sun-brightest-planet-in-solar-system.html", "passage_text": "Venus is the hottest world in the solar system. Although Venus is not the planet closest to the sun, its dense atmosphere traps heat in a runaway version of the greenhouse effect that warms Earth. As a result, temperatures on Venus reach 870 degrees Fahrenheit (465 degrees Celsius), more than hot enough to melt lead. One mountain range, called Maxwell, is about 540 miles (870 km) long and reaches up to some 7 miles (11.3 km) high, making it the highest feature on the planet. Venus also possesses a number of surface features unlike anything on Earth."}, {"url": "http://space.about.com/od/venus/a/Venus.htm", "passage_text": "Rotation. Venus takes 225 Earth days to complete one orbit of the Sun. And like the other planets in our solar system, Venus rotates about its axis. However, Venus is the only planet that rotates from east to west instead of west to east. This means, that if we lived on Venus, the Sun would appear to rise in the west in the morning, and set in the east in the evening! Even stranger, Venus rotates so slowly that one day on Venus is equivalent to 117 days on Earth. As a result, the gravity on Venus (8.87 m/s2) is nearly the same as it is on Earth (9.81 m/s2). Additionally, scientists conclude that the structure of the planet's interior is similar to Earth's, with an iron core and a rocky mantel."}, {"url": "http://www.nasa.gov/audience/forstudents/5-8/features/F_The_Planet_Venus_5-8.html", "passage_text": "Venus is the second planet from the Sun, and is Earth's closest neighbor in the solar system. Venus is the brightest object in the sky after the Sun and the Moon, and sometimes looks like a bright star in the morning or evening sky. The planet is a little smaller than Earth, and is similar to Earth inside. We can't see the surface of Venus from Earth, because it is covered with thick clouds."}, {"url": "http://nineplanets.org/venus.html", "passage_text": "Venus is the second planet from the Sun and the sixth largest. Venus' orbit is the most nearly circular of that of any planet, with an eccentricity of less than 1%. "}, {"url": "http://space-facts.com/venus/", "passage_text": "Venus is the second planet from the Sun and is the second brightest object in the night sky after the Moon. Named after the Roman goddess of love and beauty, Venus is the second largest terrestrial planet and is sometimes referred to as the Earth’s sister planet due the their similar size and mass. "}, {"url": "http://www.giantbomb.com/venus/3035-2/", "passage_text": "Venus is a planet located in the Milky way galaxy and is the second closest planet to the sun. Venus orbits the sun every 225 days and is the second brightest object at night only behind the moon. Venus gets it's name from the Roman love goddess Venus. "}, {"url": "http://www.planetsforkids.org/planet-venus.html", "passage_text": "1 Venus is the hottest planet in the Solar System, even hotter than Mercury, which is closer to the Sun. 2  The temperature on the surface of Venus is about 860° Fahrenheit or 460° Celsius. 3  Compare this to a warm summer’s day in London, when the temperature might be 80° Fahrenheit or 26° Celsius. 1 Venus is called after the Roman Goddess of love and beauty. 2  Venus is the planet which is closest to the Earth and is a little smaller than the Earth. 3  The diameter of the Earth (the distance right round the middle of the Earth at the equator) is 12,760 kilometres, or 7926 miles."}]