[{"url": "http://www.catholicnewsagency.com/news/will-pope-francis-change-the-date-of-easter-87684/", "passage_text": "Credit: L'Osservatore Romano. Vatican City, Jun 19, 2015 / 03:53 am (CNA) .- Speaking to a global gathering of priests, Pope Francis signaled an openness to changing the date of Easter in the West so that all Christians around the world could celebrate the feast on the same day. Historian Lucetta Scaraffia, writing in the Vatican daily newspaper L’Osservatore Romano, said the Pope is offering this initiative to change the date of Easter “as a gift of unity with the other Christian churches.”."}, {"url": "http://christianity.about.com/od/faqhelpdesk/qt/whyeasterchange.htm", "passage_text": "The Paschal Full Moon can vary as much as two days from the date of the actual full moon, with dates ranging from March 21 to April 18. As a result, Easter dates can range from March 22 through April 25 in Western Christianity. While some Eastern Orthodox Churches not only maintain the date of Easter based on the Julian Calendar which was in use during the First Ecumenical Council of Nicea in 325 A.D., they also use the actual, astronomical full moon and the actual vernal equinox as observed along the meridian of Jerusalem."}, {"url": "http://christianity.about.com/od/faqhelpdesk/qt/whyeasterchange.htm", "passage_text": "Thus, according to the Ecclesiastical tables, the Paschal Full Moon is the first Ecclesiastical Full Moon date after March 20 (which happened to be the vernal equinox date in 325 A.D.). So, in Western Christianity, Easter is always celebrated on the Sunday immediately following the Paschal Full Moon. While some Eastern Orthodox Churches not only maintain the date of Easter based on the Julian Calendar which was in use during the First Ecumenical Council of Nicea in 325 A.D., they also use the actual, astronomical full moon and the actual vernal equinox as observed along the meridian of Jerusalem."}, {"url": "http://www.inquisitr.com/1930862/when-is-easter-2015-why-the-date-for-easter-changes-every-year-unlike-other-holidays/", "passage_text": "Unlike other holidays, the date for Easter changes every year. That’s because Easter doesn’t have a fixed date even though it does have a fixed day. Easter also falls on a Sunday, but the date could be on any Sunday in March or April. Instead, the date for Easter is based on the moon. According to The Old Farmer’s Almanac, Easter falls on different dates because Easter is based on the lunar calendar. Easter and Passover are correlated. Even though the two celebrations come close together, the observance of Passover is always first."}, {"url": "http://www.catholicnewsagency.com/news/will-pope-francis-change-the-date-of-easter-87684/", "passage_text": "The Orthodox churches normally celebrate Easter a week after the Catholics. Some Orthodox leaders have also reflected on the dating of the Christian holy day. In May, Coptic Orthodox Pope Tawadros II wrote to the papal nuncio in Egypt suggesting a common date for Easter. Historian Lucetta Scaraffia, writing in the Vatican daily newspaper L’Osservatore Romano, said the Pope is offering this initiative to change the date of Easter “as a gift of unity with the other Christian churches.”."}, {"url": "http://www.answers.com/Q/Why_does_Easter's_date_change", "passage_text": "Easter's date changes because it's based on Jewish Passover, which is based on a lunar calendar. Easter is the first Sunday after the first full moon after the vernal equinox. Those things don't stay in sync, so the date of Easter moves around. If that wasn't hard enough, there are all sorts of questions about determining the full moon. The date of Easter is based on the moon. Easter is always on the first Sunday after the first full moon after the spring equinox."}, {"url": "http://christianity.about.com/od/faqhelpdesk/qt/whyeasterchange.htm", "passage_text": "Today in Western Christianity, Easter is always celebrated on the Sunday immediately following the Paschal Full Moon date of the year. I had previously, and somewhat erroneously stated, Easter is always celebrated on the Sunday immediately following the first full moon after the vernal (spring) equinox.. While some Eastern Orthodox Churches not only maintain the date of Easter based on the Julian Calendar which was in use during the First Ecumenical Council of Nicea in 325 A.D., they also use the actual, astronomical full moon and the actual vernal equinox as observed along the meridian of Jerusalem."}, {"url": "https://en.wikipedia.org/wiki/Reform_of_the_date_of_Easter", "passage_text": "The two most widespread proposals for fixing the date of Easter would set it on either the second Sunday in April (8 to 14), or the Sunday after the second Saturday in April (9 to 15). The World Council of Churches (WCC) proposed a reform of the method of determining the date of Easter at a summit in Aleppo, Syria, in 1997: Easter would be defined as the first Sunday following the first astronomical full moon following the astronomical vernal equinox, as determined from the meridian of Jerusalem."}, {"url": "http://www.ncregister.com/daily-news/gift-of-unity-will-pope-francis-change-the-date-of-easter/", "passage_text": "06/19/2015 Comments (17). VATICAN CITY — Speaking to a global gathering of priests, Pope Francis signaled an openness to changing the date of Easter in the West so that all Christians around the world could celebrate the feast on the same day. The Pope on June 12 said “we have to come to an agreement” for a common date on Easter."}, {"url": "http://www.patheos.com/blogs/catholicnews/2015/06/will-pope-francis-change-the-date-of-easter/", "passage_text": "Vatican City, Jun 19, 2015 / 03:53 am (CNA).- Speaking to a global gathering of priests, Pope Francis signaled an openness to changing the date of Easter in the West so that all Christians around the world could celebrate the feast on the same day. "}]