[{"url": "http://costarica.com/wildlife/howler-monkeys/", "passage_text": "Named for their throaty howls that can be heard for up to three miles, howler monkeys are the loudest of all New World monkeys. There are nine species of howler monkey, and Costa Rica is home to the common mantled howler, which inhabit parts of southern Mexico, Central and South America. Habitat: Mantled howler monkeys can be found in the canopies of both lowland and montane rainforests. They are commonly heard long before they are seen searching for leaves in the treetops. A troop of howler monkeys usually consists of eight to twelve females, three or four dominant males and several young."}, {"url": "http://animals.nationalgeographic.com/animals/mammals/howler-monkey/", "passage_text": "Size relative to a 6-ft (2-m) man: Howlers are New World monkeys found in tropical Central and South America. They are aptly named for their cacophonous cries. When a number of howlers let loose their lungs in concert, often at dawn or dusk, the din can be heard up to three miles (five kilometers) away. They prefer to stay aloft, munching on the leaves that make up most of their diet. Howler monkeys have beards and long, thick hair which may be black, brown, or red. The red howler species is the most common, but it is often targeted by hunters eager for bushmeat."}, {"url": "http://animals.nationalgeographic.com/animals/mammals/howler-monkey/", "passage_text": "A gripping tail is particularly helpful to howler monkeys because they rarely descend to the ground. They prefer to stay aloft, munching on the leaves that make up most of their diet. Howler monkeys have beards and long, thick hair which may be black, brown, or red. The red howler species is the most common, but it is often targeted by hunters eager for bushmeat. Other species of howler monkey may be critically endangered over sections of their ranges"}, {"url": "https://en.wikipedia.org/wiki/Howler_monkey", "passage_text": "These monkeys are native to South and Central American forests. Threats to howler monkeys include human predation, habitat destruction and being captured for captivity as pets or zoo animals. These monkeys are famous for their loud howls, which can travel three miles through dense forest. Howler monkeys are widely considered to be the loudest land animal. According to Guinness Book of World Records, their vocalizations can be heard clearly for 3 mi (4.8 km)."}, {"url": "http://nationalzoo.si.edu/Animals/SmallMammals/Exhibits/HowlerMonkeys/LoudestAnimal/", "passage_text": "Related Resources. by Terry Dunn. Howler monkeys are named and known for the loud, guttural howls that they routinely use at the beginning and end of the day. They are the loudest animal in the New World and while their howl is not a piercing sound, it can travel for three miles through dense forest. Black howler monkeys are inhabitants of Latin American rainforests, ranging through eastern Bolivia, southern Brazil and Paraguay, and northern Argentina."}, {"url": "https://en.wikipedia.org/wiki/Mantled_howler", "passage_text": "The mantled howler (Alouatta palliata), or golden-mantled howling monkey, is a species of howler monkey, a type of New World monkey, from Central and South America. It is one of the monkey species most often seen and heard in the wild in Central America. It takes its mantled name from the long guard hairs on its sides. The mantled howler is one of the largest Central American monkeys, and males can weigh up to 9.8 kg (22 lb)."}, {"url": "https://en.wikipedia.org/wiki/Mantled_howler", "passage_text": "The mantled howler belongs to the New World monkey family Atelidae, the family that contains the howler monkeys, spider monkeys, woolly monkeys and muriquis. It is a member of the subfamily Alouattinae and genus Alouatta, the subfamily and genus containing all the howler monkeys. It is one of the monkey species most often seen and heard in the wild in Central America. It takes its mantled name from the long guard hairs on its sides. The mantled howler is one of the largest Central American monkeys, and males can weigh up to 9.8 kg (22 lb)."}, {"url": "https://en.wikipedia.org/wiki/Mantled_howler", "passage_text": "The mantled howler's appearance is similar to other howler monkeys of the genus Alouatta except for coloration. The mantled howler is primarily black except for a fringe of yellow or golden brown guard hairs on the flanks of the body earning the common name mantled howler monkey. It is one of the monkey species most often seen and heard in the wild in Central America. It takes its mantled name from the long guard hairs on its sides. The mantled howler is one of the largest Central American monkeys, and males can weigh up to 9.8 kg (22 lb)."}, {"url": "http://www.arkive.org/mantled-howler-monkey/alouatta-palliata/", "passage_text": "Alouatta. Mantled howler monkeys are large, fairly stocky monkeys that are totally black in colour with the exception of a fringe of long golden hairs on the flanks. The tail is prehensile and has a naked patch on the underside towards the tip to aid in grasping. "}, {"url": "http://www.lazoo.org/animals/mammals/blackhowlermonkey/", "passage_text": "The black howler monkey is the loudest land animal in the world! If you come upon a troop of black howler monkeys in a zoo or in the wild, you might think you are looking at two different species. But don’t be fooled! The males and females are sexually dimorphic, meaning they have different physical characteristics. "}]