[{"url": "http://realestate.findlaw.com/landlord-tenant-law/how-long-does-the-eviction-process-take.html", "passage_text": "Thus, the eviction process from the end of the notice period can take from five weeks to three months, assuming there are no delays. Consider speaking with a landlord-tenant lawyer in your area if you have additional questions or need legal assistance. If the tenant remains after that period, the landlord has to hire the sheriff or marshal to carry out a forcible eviction. That will take several weeks more. Further delays are possible if the tenant files a motion for more time or objects to the court determination."}, {"url": "http://www.ehow.com/how-does_5215100_long-evict-tenant_.html", "passage_text": "Each state sets its own rules for the eviction process. Generally landlords can ask a tenant to leave for cause, or evict without cause in some instances. In eviction without cause, the landlord can, for example, ask a month-to-month tenant to leave at the end of a rental period. The landlord usually can't wait until the day before to do this, however. In California, for instance, the tenant gets 30 or 60 days notice"}, {"url": "http://www.tijlaw.com/Firm-Blog/2013/November/How-long-does-it-take-to-evict-a-tenant-in-NYC-.aspx", "passage_text": "Properties that have no rent stabilization will usually be fairly straightforward. The landlord must first formally give 30 days of notice to the tenant. If the tenant does not leave, then the landlord must serve the tenant with a Notice of Petition for eviction. A court date may then be set for 5-12 days after the date of service. At the court hearing, the judge may set a date by which the tenant must vacate the premises. "}, {"url": "http://homeguides.sfgate.com/long-evict-tenant-42768.html", "passage_text": "If the tenant does not pay the rent or otherwise comply with the lease agreement after the specified time, the landlord must file a complaint with the court. The tenant is notified of the complaint, then has five days to file a written response. With no written response, the default judgment goes to the landlord. This can be a three-day pay or quit notice, a 30-day vacate notice or a 60-day vacate notice. The landlord must include certain information in that notice and either hand-deliver it to the tenant or send it via certified or registered mail."}, {"url": "http://realestate.findlaw.com/landlord-tenant-law/how-long-does-the-eviction-process-take.html", "passage_text": "If a landlord decides to evict a month-to-month tenant without cause -- perhaps to make renovations -- he or she must give notice, typically 30 days. But some cities with rent control, including San Francisco and New York City, do not allow evictions unless the landlord is able to prove a legitimate reason to do so. If the tenant remains after that period, the landlord has to hire the sheriff or marshal to carry out a forcible eviction. That will take several weeks more. Further delays are possible if the tenant files a motion for more time or objects to the court determination."}, {"url": "http://homeguides.sfgate.com/long-evict-tenant-california-8035.html", "passage_text": "The landlord must deliver the writ to the sheriff, who then posts a notice to vacate on the premises. Depending on the county, it usually takes the sheriff from 3 to 15 days to post the notice. The tenant is then given five days to vacate the premises. Assuming that the court found in the landlord’s favor, the court will issue a document called a “Writ of Possession,” which provides that the landlord now has the right to possession and directs the county sheriff to evict the tenant from"}, {"url": "http://realestate.findlaw.com/landlord-tenant-law/how-long-does-the-eviction-process-take.html", "passage_text": "It may be as simple as a notice to the tenant with an explanation of the eviction and the final date by which he or she must move out, or it may escalate to a legal dispute. Thus, the length of time the eviction process will take is determined largely by your particular situation. If the tenant remains after that period, the landlord has to hire the sheriff or marshal to carry out a forcible eviction. That will take several weeks more. Further delays are possible if the tenant files a motion for more time or objects to the court determination."}, {"url": "http://homeguides.sfgate.com/long-evict-tenant-42768.html", "passage_text": "To evict a tenant, landlords must follow a certain process to ensure that it is both fair and legal. Whether a tenant has not paid rent or is violating the lease agreement in some other way, a landlord can expect the eviction process to last about 30 to 45 days, according to California law. This can be a three-day pay or quit notice, a 30-day vacate notice or a 60-day vacate notice. The landlord must include certain information in that notice and either hand-deliver it to the tenant or send it via certified or registered mail."}, {"url": "http://www.cga.ct.gov/2011/rpt/2011-R-0350.htm", "passage_text": "The Judicial Branch could not provide precise data on how long it takes to evict someone. According to a representative of the branch, the minimum time for a summary process to proceed to judgment is 30 to 45 days from the service on the tenant of the notice to quit possession. 2. Nonpayment of Rent. If a tenant does not pay his or her rent, the landlord may evict the tenant after a three-day grace period or after the time specified in the notice to quit. If the tenant pays the rent during the grace period, he or she cannot be evicted for nonpayment."}, {"url": "http://homeguides.sfgate.com/long-evict-tenant-california-8035.html", "passage_text": "For this reason, California gives eviction lawsuits priority over all legal matters except for criminal cases. How much time it typically takes to evict a tenant depends in part on what the tenant is being evicted for and the county’s current caseload, but the process is generally uniform. Assuming that the court found in the landlord’s favor, the court will issue a document called a “Writ of Possession,” which provides that the landlord now has the right to possession and directs the county sheriff to evict the tenant from the premises."}]