[{"url": "http://finance.zacks.com/age-must-start-disbursing-ira-8178.html", "passage_text": "If you do, the required minimum distributions must begin when you reach age 70 1/2. If you choose to remain a beneficiary of the IRA, required minimum distributions start when the deceased would have been 70 1/2. If you inherit an IRA from anyone other than a spouse, you have two options."}, {"url": "http://www.rothira.com/blog/comparing-retirement-accounts-at-what-age-do-you-have-to-begin-to-withdraw-funds", "passage_text": "Our favorite, the Roth IRA: 1  Minimum age you must be to begin taking qualified distributions: 59 and 1/2. 2  Maximum age where you must begin to take qualified distributions: Never! 3  You are not forced to take distributions at age 70 1/2."}, {"url": "http://money.cnn.com/retirement/guide/IRA_traditional.moneymag/index5.htm", "passage_text": "Ultimate guide to retirement. While you can begin making qualified withdrawals from a traditional IRA at age 59½, you must start taking withdrawals that are known as required minimum distributions starting in the year you turn 70 ½."}, {"url": "https://www.irs.gov/retirement-plans/retirement-plans-faqs-regarding-required-minimum-distributions", "passage_text": "Your required minimum distribution is the minimum amount you must withdraw from your account each year. You generally have to start taking withdrawals from your IRA, SEP IRA, SIMPLE IRA, or retirement plan account when you reach age 70½. Roth IRAs do not require withdrawals until after the death of the owner."}, {"url": "https://www.irs.gov/Retirement-Plans/Retirement-Plans-FAQs-regarding-IRAs-Distributions-(Withdrawals)", "passage_text": "Required minimum distributions (RMDs) must be taken each year beginning with the year you turn age 70 1/2. The RMD for each year is calculated by dividing the IRA account balance as of December 31 of the prior year by the applicable distribution period or life expectancy. This rule does not apply to your Roth IRAs."}, {"url": "http://www.fool.com/retirement/iras/2014/02/11/the-ira-distribution-table-3-must-know-tips.aspx", "passage_text": "When you must use the IRA distribution table There are two situations in which you'll have to use the IRA distribution table to figure out your minimal withdrawal from your IRA. The most common is that if you will be age 70 1/2 by the end of the current year, you'll have to start taking required minimum distributions."}, {"url": "http://www.rothira.com/blog/comparing-retirement-accounts-at-what-age-do-you-have-to-begin-to-withdraw-funds", "passage_text": "1 Minimum age you must be to begin taking qualified distributions: 59 and 1/2. 2  Maximum age where you must begin to take qualified distributions: Never! 3  You are not forced to take distributions at age 70 1/2. 4  You can keep the money in your Roth IRA as long as you want."}]