[{"url": "http://www.kentnews.co.uk/news/new_sky_atlantic_drama_the_tunnel_filmed_in_kent_1_2858393", "passage_text": "Usurv. The Tunnel was filmed in Kent. Kent provided the backdrop for a new 10-part thriller series due to air on satellite channel Sky Atlantic next week. The Tunnel, which is produced by the makers “Hustle”, “Life on Mars” and “Broadchurch”, was shot at a variety of east Kent locations."}, {"url": "http://www.imdb.com/title/tt1735485/", "passage_text": "1 2 3 4 5 6 7 8 9 10 -/10 X. Ratings: 5.9 /10 from 14,395 users. Reviews: 101 user | 51 critic. An investigation into a government cover-up leads to a network of abandoned train tunnels deep beneath the heart of Sydney. As a journalist and her crew hunt for the story it quickly becomes clear the story is hunting them."}, {"url": "http://www.thelocationguide.com/blog/2015/02/ng-television-murder-drama-the-tunnel-to-return-to-kent-for-second-series-filming/", "passage_text": "A second series of murder drama The Tunnel will return to film on location in Kent in southern England. The show is a remake of Scandinavian drama The Bridge and the first series charted a joint English-French investigation following a murder in the centre of the Channel Tunnel."}, {"url": "http://tvtropes.org/pmwiki/pmwiki.php/Film/TheTunnel", "passage_text": "Film: The Tunnel. Inexact title. See the list below. We don't have an article named Film /TheTunnel, exactly. We do have: 1  Literature/The Tunnel. 2  Series/The Tunnel. 3  YMMV"}, {"url": "http://www.thelocationguide.com/blog/2015/02/ng-television-murder-drama-the-tunnel-to-return-to-kent-for-second-series-filming/", "passage_text": "“It’s good for the economy because the crew and cast will be staying down here and the first series involved a lot of people and hard work.”. The first series of The Tunnel based itself at Discovery Park in Sandwich and filmed locally for nearly 120 days. Kent is a popular filming location, partly because of its proximity to London."}, {"url": "http://tvtropes.org/pmwiki/pmwiki.php/Film/TheTunnel", "passage_text": "See the list below. We don't have an article named Film /TheTunnel, exactly. We do have: 1  Literature/The Tunnel. 2  Series"}, {"url": "http://www.kentnews.co.uk/news/new_sky_atlantic_drama_the_tunnel_filmed_in_kent_1_2858393", "passage_text": "The Tunnel was filmed across five Kent districts including Canterbury, Dover, Thanet, Shepway and Swale and a number prominent Kent locations will feature in the show including the Channel Tunnel, the Turner Contemporary and Folkestone Harbour."}]