[{"url": "https://en.wikipedia.org/wiki/Business_architect", "passage_text": "Since a business architecture practice is closely related to the discipline of enterprise architecture in a way that it provides a foundation for the enterprise architecture, the role of a business architect is sometimes fulfilled by an enterprise architect. Given that the business architecture as a distinct discipline is relatively young, the role of a business architect is often relative to the organization. A business architect can operate on one or more levels of the organization depending on the level of maturity of the architecture practice within that organization."}, {"url": "http://biz-architect.com/business-architecture/what-is/", "passage_text": "According to Wikipedia, business architecture is a part of an enterprise architecture related to a corporate business or an organization. A formal definition of the first meaning is defined by the Object Management Group’s Business Architecture Working Group as follows: People who build business architecture are known as Business Architects. Working as a change agent with senior business stakeholders, the Business Architect plays a key part in shaping and fostering continuous improvement, business transformation, and business innovation initiatives."}, {"url": "https://en.wikipedia.org/wiki/Business_architect", "passage_text": "For each step of the business transformation plan, business architects contribute in development of a blueprint of the enterprise in order to promote a common understanding of the organization and alignment of strategic objectives with tactical demands. Given that the business architecture as a distinct discipline is relatively young, the role of a business architect is often relative to the organization. A business architect can operate on one or more levels of the organization depending on the level of maturity of the architecture practice within that organization."}, {"url": "http://www.computerweekly.com/news/2240105448/The-business-architect-role-is-vital-to-business-process-transformation", "passage_text": "Recognising the need for a business architect. What is not obvious to many who are still relatively new to the business process transformation scene is how this crucial position should be organised, who should occupy it, and what business architects should do. No matter what the industry, business process professionals need an effective architecture for the business process management (BPM) projects that make up the business change programme. Working as the right hand of the business process change agent, the business architect takes the lead in developing that architecture."}, {"url": "http://insights.dice.com/2013/11/14/what-does-an-it-architect-do-201/", "passage_text": "Architects who do more or less the same things with the same skills may be referred to as enterprise architects, solution architects, project architects, IT architects, technical architects, data architects, application architects, business architects, cloud or SOA architects, and security architects. "}, {"url": "https://en.wikipedia.org/wiki/Business_architecture", "passage_text": "Business architecture is defined as “a blueprint of the enterprise that provides a common understanding of the organization and is used to align strategic objectives and tactical demands.. People who develop and maintain business architecture are known as business architects. Business architecture is the bridge between the enterprise business model and enterprise strategy on one side, and the business functionality of the enterprise on the other side. The concept of business architecture has been proposed as a blueprint of the enterprise, as business strategy, and also as the representation of business design. The concept of business architecture has evolved over the years. It was introduced in the 1980s as architectural domains and as activity"}, {"url": "http://biz-architect.com/business-architecture/what-is/", "passage_text": "Business architecture is the bridge between the enterprise business model and the enterprise strategy on one side, and the business functionality of the corporate business or organization on the other side. People who build business architecture are known as Business Architects. Working as a change agent with senior business stakeholders, the Business Architect plays a key part in shaping and fostering continuous improvement, business transformation, and business innovation initiatives."}, {"url": "https://en.wikipedia.org/wiki/Business_architect", "passage_text": "From Wikipedia, the free encyclopedia. A business architect is a practitioner of business architecture, a discipline concerned with developing and maintaining business capabilities of the enterprise in line with the corporate strategy as well as contributing to the business strategy and plans. Given that the business architecture as a distinct discipline is relatively young, the role of a business architect is often relative to the organization. A business architect can operate on one or more levels of the organization depending on the level of maturity of the architecture practice within that organization."}, {"url": "http://www.bainstitute.org/resources/articles/business-architect-job-description-0", "passage_text": "Total votes: 0. I am often asked to describe the role of the Business Architect; the role is new enough that most Resource Managers do not have a job description on file. Of course, the answer depends on the context within which the question is asked. Sometime I describe what the Business Architect “does.” Other times I describe what the Business Architect “accomplishes.” Yet other times the inquirer really wants to know what “skills” the Business Architect should possess. When asked recently, I decided to take a shot at creating a job description."}]