[{"url": "http://www.webmd.com/a-to-z-guides/mad-cow-disease-overview", "passage_text": "Mad cow disease is a fatal disease that slowly destroys the brain and spinal cord (central nervous system) in cattle. It also is known as bovine spongiform encephalopathy, or BSE. People cannot get mad cow disease. But in rare cases they may get a human form of mad cow disease called variant Creutzfeldt-Jakob disease (vCJD), which is fatal. There is no evidence that people can get mad cow disease or vCJD from eating muscle meat-which is used for ground beef, roasts, and steaks-or from consuming milk or milk products. People with vCJD cannot spread it to others through casual contact."}, {"url": "https://en.wikipedia.org/wiki/Bovine_spongiform_encephalopathy", "passage_text": "A cow with BSE. Infected animals lose the ability to stand. Bovine spongiform encephalopathy (BSE), commonly known as mad cow disease, is a fatal neurodegenerative disease (encephalopathy) in cattle that causes a spongy degeneration in the brain and spinal cord. "}, {"url": "http://www.emedicinehealth.com/mad_cow_disease_and_variant_creutzfeldt-jakob/article_em.htm", "passage_text": "Mad cow disease is an infectious disease caused by prions that affect the brains of cattle. The actual name of the disease is bovine spongiform encephalopathy (BSE), a name that refers to the changes seen in brain tissue of affected cows. Abnormal proteins called prions are found in brain tissue of diseased cattle and appear to be the particle that transmits the infection."}, {"url": "http://www.answers.com/Q/What_does_mad_cow_disease_do_to_cows", "passage_text": "Mad cow disease happens when the proteins in the brain of cow become misfolded. This is called prion. In simple words all proteins have to be folded before they can function a … nd when some proteins in the brain become misfolded, such a state is called prions (misfolding of proteins) and it results in mad cow disease. Mad cow disease is an incurable, fatal brain disease that affects cattle and possibly some other animals, such as goats and sheep. The medical name for mad cow disease is bovi … ne spongiform encephalopathy (pronounced: bo-vine spun-jih-form en-seh-fah-la-puh-thee), or BSE for short."}, {"url": "http://www.webmd.com/brain/mad-cow-disease-basics", "passage_text": "Researchers believe that the infectious agent that causes mad cow disease is an abnormal version of a protein normally found on cell surfaces, called a prion. For reasons still unknown, this protein becomes altered and destroys nervous system tissue -- the brain and spinal cord. It is not linked to eating nerve tissue from mad cow disease-affected cattle -- both vegetarians and meat eaters have died from classic CJD. CJD most commonly affects people over 65 and is usually fatal within six months from onset of symptoms."}, {"url": "http://www.uofmhealth.org/health-library/tu6533", "passage_text": "Mad cow disease is a fatal disease that slowly destroys the brain and spinal cord (central nervous system) in cattle. It also is known as bovine spongiform encephalopathy, or BSE. People cannot get mad cow disease. But in rare cases they may get a human form of mad cow disease called variant Creutzfeldt-Jakob disease (vCJD), which is fatal. This can happen if you eat nerve tissue (the brain and spinal cord) of cattle that were infected with mad cow disease. Over time, vCJD destroys the brain and spinal cord. Experts are not sure what causes mad cow disease or vCJD. The leading theory is that the disease is caused by infectious proteins called prions (say PREE-ons). In affected cows, these proteins are found in the brain, spinal cord, and small intestine."}, {"url": "http://www.answers.com/Q/What_does_mad_cow_disease_do_to_cows", "passage_text": "Makes them Mad by deteriorating the nerves in the brain. The Mad Cow Disease is a Prion Illness. A Prion is a protein or part of a protein. As of such, the disease is not alive, much the same as a virus, of which is neither alive. A Bacteria is a living tiny creature with the ability to multiply by itself when given nutrient's. Mad cow disease is an incurable, fatal brain disease that affects cattle and possibly some other animals, such as goats and sheep. The medical name for mad cow disease is bovi … ne spongiform encephalopathy (pronounced: bo-vine spun-jih-form en-seh-fah-la-puh-thee), or BSE for short."}, {"url": "http://www.webmd.com/brain/mad-cow-disease-basics", "passage_text": "A human version of mad cow disease called variant Creutzfeldt-Jakob disease (vCJD) is believed to be caused by eating beef products contaminated with central nervous system tissue, such as brain and spinal cord, from cattle infected with mad cow disease. It is not linked to eating nerve tissue from mad cow disease-affected cattle -- both vegetarians and meat eaters have died from classic CJD. CJD most commonly affects people over 65 and is usually fatal within six months from onset of symptoms."}, {"url": "http://www.fda.gov/AnimalVeterinary/ResourcesforYou/AnimalHealthLiteracy/ucm136222.htm", "passage_text": "The word BSE is short but it stands for a disease with a long name, bovine spongiform encephalopathy. Bovine means that the disease affects cows, spongiform refers to the way the brain from a sick cow looks spongy under a microscope, and encephalopathy indicates that it is a disease of the brain. BSE is commonly called “mad cow disease.”. "}, {"url": "http://www.emedicinehealth.com/mad_cow_disease-health/article_em.htm", "passage_text": "Mad cow disease is a fatal disease that slowly destroys the brain and spinal cord (central nervous system) in cattle. It also is known as bovine spongiform encephalopathy, or BSE. People cannot get mad cow disease. But in rare cases they may get a human form of mad cow disease called variant Creutzfeldt-Jakob disease (vCJD), which is fatal. This can happen if you eat nerve tissue (the brain and spinal cord) of cattle that were infected with mad cow disease"}]