[{"url": "https://en.wikipedia.org/wiki/Stephen_Hawking%27s_Disease", "passage_text": "Amyotrophic lateral sclerosis (ALS), also known as Lou Gehrig's disease and Charcot disease, is a specific disorder that involves the death of neurons. "}, {"url": "http://www.livescience.com/50302-stephen-hawking-trademark.html", "passage_text": "The Theory of Everything , suffers from a motor neuron disease related to ALS (amyotrophic lateral sclerosis), also called Lou Gehrig's disease. Diagnosed when he was 21, Hawking is completely paralyzed and unable to speak without the aid of a computerized speech synthesizer. "}, {"url": "https://answers.yahoo.com/question/index?qid=20070624082921AACn6Gv", "passage_text": "Best Answer: It is amyotrophic lateral sclerosis, or ALS (a type of motor neurone disease); this condition is commonly known in the United States as Lou Gehrig's Disease. It is a progressive, fatal neurodegenerative disease caused by the degeneration of motor neurons. Report Abuse. Hawking is severely disabled by amyotrophic lateral sclerosis, or ALS (a type of motor neurone disease); this condition is commonly known in the United States as Lou Gehrig's Disease."}, {"url": "https://en.wikipedia.org/wiki/Stephen_Hawking", "passage_text": "Hawking suffers from a rare early-onset slow-progressing form of amyotrophic lateral sclerosis (ALS), also known as motor neurone disease or Lou Gehrig's disease, that has gradually paralysed him over the decades. Hawking was born on 8 January 1942 in Oxford, England, to Frank (1905–1986) and Isobel Hawking (nee Née; walker–1915). 2013 his mother Was. Scottish despite their' families financial, constraints both parents attended The university Of, oxford Where frank studied medicine And, Isobel, Philosophy politics And. economics"}, {"url": "http://www.americanscientist.org/science/pub/how-has-stephen-hawking-lived-to-70-with-als", "passage_text": "But like his mind, Hawking's illness seems to be singular. Most patients with ALS--also known as Lou Gehrig's disease, for the famous baseball player who succumbed to the disease--are diagnosed after the age of 50 and die within five years of their diagnosis. Hawking's condition was first diagnosed when he was 21, and he was not expected to see his 25th birthday. "}, {"url": "http://www.cnn.com/2009/HEALTH/04/20/hawking.als/index.html", "passage_text": "Most people with ALS survive only two to five years after diagnosis. Hawking, on the other hand, has lived more than 40 years since he learned he had the disease, which is also known as Lou Gehrig's Disease in America and motor neuron disease, or MND, in the United Kingdom. "}, {"url": "http://www.answers.com/Q/What_disease_does_Stephen_Hawking_have_and_is_he_still_alive", "passage_text": "Stephen Hawking suffers from a progressive motor neuron disease like ALS (amyotrophic lateral sclerosis, or Lou Gehrig's disease), which has progressed over the years and left … him almost entirely paralyzed. 1 person found this useful. Stephen Hawking suffers from the a motor neuron disease known as amytrophic lateral sclerosis, or Lou Gehrig's disease. For Hawking it has progressed to the point of paralysi … s. He is unable to speak and communicates using a speech generating device"}, {"url": "http://www.answers.com/Q/What_disease_does_Stephen_Hawking_have_and_is_he_still_alive", "passage_text": "Hawking has a motor neuron disease (MND) that deteriorates his upper and lower motor neurons. Typical forms of MND include ALS (aka Lou Gherig's disease), progressive lateral sclerosis (PLS), bulbar palsy's (which are diseases that specifically affect the corticobulbar tracts), and progressive muscular atrophy. Stephen Hawking suffers from the a motor neuron disease known as amytrophic lateral sclerosis, or Lou Gehrig's disease. For Hawking it has progressed to the point of paralysi … s. He is unable to speak and communicates using a speech generating device"}]