[{"url": "http://www.bls.gov/ooh/Healthcare/Radiation-therapists.htm", "passage_text": "$34,750. The median annual wage for radiation therapists was $77,560 in May 2012. The median wage is the wage at which half the workers in an occupation earned more than that amount and half earned less. The lowest 10 percent earned less than $51,720, and the top 10 percent earned more than $113,810. Most radiation therapists work full time. Because radiation therapy procedures are usually planned in advance, radiation therapists keep a regular work schedule."}, {"url": "http://www.healthcaresalaryworld.com/what-is-radiation-therapist-salary/", "passage_text": "What Affects Radiation Therapist Salary. Radiation therapists have a mean annual salary of $80,410, with a range from the lowest to highest 10% spanning $51,720 to $113,810. There are several factors at work influencing this $60,000 range, including experience, geographic location, and education. Experience and Position. Experience is one of the primary methods of radiation therapist salary improvements. Starting radiation therapists can expect salaries in the $55,000 to $60,000 range, depending on their geography area."}, {"url": "https://www.recruiter.com/salaries/radiation-therapists-salary/", "passage_text": "Radiation Therapists are compensated at the highest average salary in South Carolina, where they earn average pay levels of about $97090. They are paid at the highest level in Professional, Scientific, and Technical Services, where they get pay levels, on average, of $83900. An Associate's degree is required for this occupation. A Radiation Therapist can get average salaries between 56000 and 84000 based on tenure and industry expertise. Radiation Therapists can get an average compensation of Seventy Eight Thousand Five Hundred dollars each year."}, {"url": "http://www.simplyhired.com/salaries-k-radiation-therapist-jobs.html", "passage_text": "Average Radiation Therapist Salaries. The average salary for radiation therapist jobs is $54,000. Average radiation therapist salaries can vary greatly due to company, location, industry, experience and benefits. This salary was calculated using the average salary for all jobs with the term radiation therapist anywhere in the job listing."}, {"url": "http://www.healthcaresalaryworld.com/what-is-radiation-therapist-salary/", "passage_text": "Mean Annual Radiation Therapist Salary. The mean annual radiation therapist salary is $80,410. The mean salary is calculated by adding all the wages within the occupation and divid that value by the total number of employees. Lowest 10% of this occupation makes less than $51,720 and the top 10% makes over $113,810. Experience and Position. Experience is one of the primary methods of radiation therapist salary improvements. Starting radiation therapists can expect salaries in the $55,000 to $60,000 range, depending on their geography area."}, {"url": "http://www.healthcareworkersalary.com/therapists/radiation-therapist-salary/", "passage_text": "Radiation Therapist Salary. The annual expected average radiation therapist salary is about $75,000. This equates to roughly $38 per hour. Even therapists just starting out in their field can earn a nice salary. The lowest 10th percentile should expect an annual income of about $51,000, or $25 per hour. Experienced radiation therapists working in the top 10th percentile should expect a salary of up to $110,000, or even higher."}, {"url": "http://www.medtravelers.com/allied-healthcare-disciplines/radiation-therapist-jobs/", "passage_text": "Because of high demand, temporary and travel radiation therapist employment opportunities are available at all levels of education and training. On average, radiation therapy salary rates generally fall between $36 and $38 per hour, or about $79,000 per year, according to the Bureau of Labor Statistics. Radiation therapist jobs requiring more advanced experience may offer greater levels of pay. "}, {"url": "http://www1.salary.com/Radiation-Therapist-ARRT-salary.html", "passage_text": "For example the median expected annual pay for a typical Radiation Therapy Technologist (ARRT) in the United States is $76,597, so 50% of the people who perform the job of Radiation Therapy Technologist (ARRT) in the United States are expected to make less than $76,597. The annual salary for someone with the job title Radiation Therapy Technologist (ARRT) may vary depending on a number of factors including industry, company size, location, years of experience and level of education."}, {"url": "http://www.indeed.com/salary/Radiation-Therapist.html", "passage_text": "Average Radiation Therapist salaries for job postings nationwide are 28% higher than average salaries for all job postings nationwide. "}]