[{"url": "http://www.clinicaladvisor.com/2014-nurse-practitioner--physician-assistant-salary-survey/slideshow/1934/", "passage_text": "The average salary for female PAs earning $20,001 to $149,999 per year is $96,585, with their male counterparts bringing down substantially more: $108,228. Overall 3,635 nurse practitioners and 1,232 physician assistants responded to The Clinical Advisor 2014 Salary Survey in March and April 2014. The average salary among all NPs earning between $20,001 and $149,999/year is $94,881.22 and the average salary among all PAs earning between $20,001and $149,999 per year is $100,497.78."}, {"url": "http://www1.salary.com/Nurse-Practitioner-Salary.html", "passage_text": "For example the median expected annual pay for a typical Nurse Practitioner in the United States is $97,688, so 50% of the people who perform the job of Nurse Practitioner in the United States are expected to make less than $97,688. Source: HR Reported data as of October 2015. 1  Salary. 2  Salary + Bonus. "}, {"url": "http://www.indeed.com/salary/nurse-practitioner.html", "passage_text": "Average nurse practitioner salaries for job postings nationwide are 66% higher than average salaries for all job postings nationwide. "}, {"url": "http://www.graduatenursingedu.org/florida/florida-salary/", "passage_text": "The American Academy of Nurse Practitioners reported in their 2011 National NP Compensation Survey that NPs in the southeastern region of the country, including Florida, earned an average salary of $87,653 and an average total income of $96,916. Nurse Practitioners in the city of Miami boasted one of the highest average salaries in the state, at $93,611, according to Advance for NPs & PAs 2011 National Salary Survey. NPs practicing in Tampa earned an average salary of $89,172 and Orlando-based NPs reported an average salary of $86,23"}, {"url": "http://www.payscale.com/research/US/Job=Family_Nurse_Practitioner_(NP)/Salary", "passage_text": "(United States). A Family Nurse Practitioner (NP) earns an average salary of $84,785 per year. Pay for this job does not change much by experience, with the most experienced earning only a bit more than the least. A skill in Emergency Room (ER) is associated with high pay for this job. A Family Nurse Practitioner (NP) earns an average salary of $84,785 per year. Pay for this job does not change much by experience, with the most experienced earning only a bit more than the least"}, {"url": "http://www.clinicaladvisor.com/2014-nurse-practitioner--physician-assistant-salary-survey/slideshow/1934/", "passage_text": "The average salary among all nurse practitioners (NPs) earning between $20,001 and $149,999 per year is $94,881.22. The average salary among all physician assistants (PAs) earning between $20,001and $149,999 per year is $100,497.78. The average salary among all NPs earning between $20,001 and $149,999/year is $94,881.22 and the average salary among all PAs"}, {"url": "http://nurse-practitioners-and-physician-assistants.advanceweb.com/Features/Articles/2013-National-Salary-Survey-Results.aspx", "passage_text": "Full-Time Salaries. In 2013, the average nurse practitioner working full time earned a salary of $98,817 and the average physician assistant working full-time earned $107,268 (Table 1). Compared to 2012 earnings, full-time salary for NPs increased by $5,785, compared to a $5,103 increase for PAs. PAs who are women saw the smallest increase, at 3%. Nurse practitioners who are men earned an average increase in annual salary of 3.55%, up from $103,394 in 2012 to $107,065 in 2013. Nurse practitioners who are women increased their salaries by 6.75%, from $91,613 in 2012 to $97,797 in 2013."}]