[{"url": "https://en.wikipedia.org/wiki/It_Ain%27t_Half_Hot_Mum", "passage_text": "It Ain't Half Hot Mum was the second of the two sitcom series co-written by Perry and Croft set in the Second World War, the first being Dad's Army (1968–1977). It Ain't Half Hot Mum is a BBC television sitcom, about the adventures of a Royal Artillery Concert Party, broadcast on the BBC between 1974 and 1981, and written by Jimmy Perry and David Croft."}, {"url": "http://chaipilgrimage.com/blogs/journal/8413337-what-is-a-chai-wallah", "passage_text": "Most chai wallahs prepare their chai in small batches on a per-order basis. In large cities, however, the chai business is often divided into one central chai wallah, who makes enormous batches of chai, and sellers, who take and fill orders from local shops. For the chai delivery person, the faster he can move on foot through the crowded city streets, the more chai he can sell. A wallah is one who performs a specific task. A rickshaw wallah drives the rickshaw, a dhobi wallah washes clothes and the chai wallah, you guessed it, makes chai. Chai wallahs are everywhere in India. Everywhere."}, {"url": "http://www.charwallahtea.co.uk/", "passage_text": "Char Wallah Tea. Char Wallah Tea, based in Birmingham in the UK, is run by brother and sister team, Andrew and Julie. During his travels to Australia and Asia, Andrew started drinking loose leaf tea and quickly discovered the taste was far superior and more enjoyable than his usual 'cuppa'. What impressed him too was the incredible health benefits of drinking tea."}, {"url": "https://en.wikipedia.org/wiki/Wallah", "passage_text": "1 -walla (or-wala, wali fem.), derived from Marathi and Hindustani वाला والا -vālā (suffix forming an adjectival compound with a noun or an agentive sense with a verb), an Indian surname or suffix indicating a person involved in some kind of activity, where they hail from or what they wear (Topiwala), for example: "}, {"url": "http://chaiwallahsofindia.com/about/", "passage_text": "In Hindi, a wallah is someone makes or sells a certain good. Chai means tea. A chai wallah is person who makes or sells tea—or both! But in India, chai isn’t simply tea, a hot drink made with water and leaves. Nor is it a “chai tea latte,” the popular beverage sold at coffee chains that is often made from a concentrate"}, {"url": "http://www.charwallahtea.co.uk/shop.asp", "passage_text": "Char Wallah shop is situated at Unit 14, The Pavilions, High Street, Birmingham. The shop has been designed and refurbished by Andrew and Julie and has a lovely ambience. You can have a 'taster' of any tea before purchasing or you go, sit back, and relax with a pot of tea and soak up the atmosphere. Accessories are available in the shop to purchase to enable you to enjoy the experience of drinking loose leaf tea at home or at work."}, {"url": "http://www.charwallahtea.co.uk/", "passage_text": "So 'Char Wallah' was created. They have sourced the best quality tea and offer a range of teas to suit everyone's palate, from strong black teas through to the herbal infusions, so customers can enjoy the diverse tastes of tea. During his travels to Australia and Asia, Andrew started drinking loose leaf tea and quickly discovered the taste was far superior and more enjoyable than his usual 'cuppa'. What impressed him too was the incredible health benefits of drinking tea."}, {"url": "http://oook.info/oed/wallahdict.html", "passage_text": "A hybrid of English and Hindustani, applied in modern Anglo-Indian colloquial to members of the Civil Service who have entered it by the competitive system first introduced in 1856. The phrase was probably the invention of one of the older or Haileybury members of the same service. These latter, whose nominations were due to interest, and who were bound together by the intimacies and esprit de corps of a common college, looked with some disfavour upon the children of Innovation."}, {"url": "http://coffeetea.about.com/od/historyculture/f/What-Is-A-Chai-Wallah.htm", "passage_text": "Answer: The tea term chai wallah refers to a maker and seller of masala chai (a.k.a.  chai tea ). The word chai is a Hindi word originating in India. It literally means tea. The word wallah is also a Hindi word. It literally translates to person."}]