[{"url": "http://www.worldweatheronline.com/Lanzarote-weather-averages/Canarias/ES.aspx", "passage_text": "Lanzarote Yearly Weather Summary. Lanzarote enjoys a pleasant climate all year round which helps make it one of the most visited tourist destinations in the whole of Europe, being only 127km away from the Sahara Desert."}, {"url": "http://www.holiday-weather.com/lanzarote/averages/january/", "passage_text": "Averages for Lanzarote in January. Weather overview. The average temperature for Lanzarote, Canary Islands in January remains constant at 17°C across the whole month. Daily highs are around 20°C – rarely going over 22°C or falling below 18°C. Daily lows are around 15°C – rarely going over 17°C or falling below 12°C. The average sea temperature for Lanzarote in January is 19°C. Everyone is different, so whilst some people will find this temperature too cold for swimming, others will find it perfect. Either way, it’s common to see sunbathers and swimmers on the beaches of Lanzarote in January."}, {"url": "http://www.worldweatheronline.com/Lanzarote-weather/Canarias/ES.aspx", "passage_text": "The Lanzarote weather is going to be patchy rain nearby. Lanzarote visibility is going to be around 10 km i.e. 6 miles and an atmospheric pressure of 1012 mb. The daytime temperature is going to reach 28 °c and the temperature is going to dip to 22 °c at night. Lanzarote weather text for Mon 19 th October. It looks on Monday, 19 October the Lanzarote weather is going to be light rain shower. Th"}, {"url": "http://www.myweather2.com/Holiday-Destinations/Spain/Lanzarote.aspx", "passage_text": "The 7 day weather forecast summary for Lanzarote: For Lanzarote in the coming week the average daytime maximum temperature will be around 27°C, with a high for the week of 30°C expected on the afternoon of Friday 16th. The mean minimum temperature will be 22°C, dipping to its lowest on the morning of Wednesday 21st at 21°C. The 7 day weather for Lanzarote provides weather information in 3 hourly intervals for each day and our 14 day Lanzarote weather provides weather data in 6 hourly intervals. We also provide monthly climate averages for Lanzarote."}, {"url": "http://www.weather2travel.com/climate-guides/spain/canary-islands/lanzarote/", "passage_text": "The Lanzarote climate guide is perfect for planning your holiday. Monthly weather averages give the best indication of what the weather is usually like for every month of the year including figures for temperature, rainfall and sunshine. The Lanzarote climate guide shown below is for Arrecife."}, {"url": "http://www.holiday-weather.com/lanzarote/averages/january/", "passage_text": "The average temperature for Lanzarote, Canary Islands in January remains constant at 17°C across the whole month. Daily highs are around 20°C – rarely going over 22°C or falling below 18°C. The average sea temperature for Lanzarote in January is 19°C. Everyone is different, so whilst some people will find this temperature too cold for swimming, others will find it perfect. Either way, it’s common to see sunbathers and swimmers on the beaches of Lanzarote in January."}, {"url": "http://www.worldweatheronline.com/Lanzarote-weather-averages/Canarias/ES.aspx", "passage_text": "In Lanzarote winter begins in December and lasts until March. The winter season remains warm with cool nights. The average high temperatures range from 21°C to 23°C. Night-time remains cool with 16°C in December, 14°C in January and 13°C in February, and again getting back up to 15°C in March. Lanzarote enjoys a pleasant climate all year round which helps make it one of the most visited tourist destinations in the whole of Europe, being only 127km away from the Sahara Desert."}, {"url": "http://www.ibervillas.com/Lanzarote%20Weather.htm", "passage_text": "Information on weather in Lanzarote. Lanzarote has a half dessert climate and very little rain (140mm/year). The average temperature is approx. 23-18°C. Due to the subtropical location, the Canary Islands are influenced nearly all year by a high-pressure area."}, {"url": "http://www.holiday-weather.com/lanzarote/averages/", "passage_text": "Lanzarote: Annual Weather Averages. August is the hottest month in Lanzarote with an average temperature of 25°C (77°F) and the coldest is January at 17°C (63°F) with the most daily sunshine hours at 10 in August. The wettest month is December with an average of 29mm of rain. The best month to swim in the sea is in August when the average sea temperature is 22°C (72°F)."}]