[{"url": "http://islamqa.info/en/106815", "passage_text": "They are: - That she needs to work in order to acquire the money she needs, as in your case. - The work should be suited to the nature of woman, such as medicine, nursing, teaching, sewing, and so on. - The work should be in a place that is only for women, and there should be no mixing with non-mahram men. - Whilst at work she should observe complete shar’i hijab. - Her work should not lead to her travelling without a mahram."}, {"url": "http://www.answers.com/Q/Can_Muslim_women_go_to_work", "passage_text": "Sure they can, they can work as long as the work is halal(means permissible in Islam). For example dealing with interest in bank is NOT permissible in Islam for man and woman. So, no Muslim can not work there."}, {"url": "http://www.questionsonislam.com/question/it-religiously-allowed-women-work-it-religiously-proper-work-amongst-men", "passage_text": "The position of women and discussions of her rights in Islam focus on participation of women in social life and work and have a job in the public service. According to Islam, a woman can work inside or outside the house; can help to her husband in meeting the family’s needs."}, {"url": "http://islam.stackexchange.com/questions/476/are-women-allowed-to-work-in-islam", "passage_text": "The Prophet (salallahu alayhi wassalam) said: Do no prevent the servant woman of Allah from going out to the masaajid of Allah. But their homes are better for them. [Muslim no.442]. However, Scholars of Islam don’t restrict a woman from working outside of her home. In fact, there are jobs where women are required. For example, teaching women or female gynecologists, nurses etc. There is nothing wrong in that as long as she abides by the following guidelines [1]:"}, {"url": "http://islam.stackexchange.com/questions/476/are-women-allowed-to-work-in-islam", "passage_text": "This can be seen from the women in the beginning of Islaam (i.e. the Sahaabiyaat), in that they would work and study and attend the masaajid. Also, since nowadays there are opportunities to work for a concern from home, this is good. It is also allowed by Islam provided she fulfills the job at home."}]