[{"url": "http://wanttoknowit.com/why-are-dugongs-an-endangered-species/", "passage_text": "Why are Dugongs an Endangered Species. 11 May, 2013 animals 0. Dugongs are large marine mammals found throughout the Indo-Pacific region and the eastern parts of Africa. However, they are scarce throughout much of their range and the largest populations are found in the northern waters of Australia."}, {"url": "http://www.answers.com/Q/Why_a_dugong_is_endangered", "passage_text": "Internationally, dugong are listed on Appendix I of the Conservation of International Trade in Endangered Species (CITES), and on Appendix II of the Convention on Migratory Species (the CMS). Australia is a signatory to both these conventions. Dugongs are endangered because sharks, crocodiles … and killer whales hunt them for food. Also entanglement in fishing wire and nets, coastal development and pollution is a major problem. Aboriginals are playing a large part in culling and hunting dugongs for meat, because it's their hunting right."}, {"url": "http://www.konicaminolta.com/kids/endangered_animals/library/sea/dugong.html", "passage_text": "And that's why people caught it for food! Too many Dugong are killed in accidents. Now you are not supposed to catch the Dugong because it is disappearing. But there are other problems, accidents. The Dugong gets hurt by boats or drowned by getting trapped in fishing nets. Worldwide, some Dugongs live in the Shark Bay of Australia. It is a region protecting a World Natural Heritage. "}, {"url": "http://www.answers.com/Q/Why_a_dugong_is_endangered", "passage_text": "Because their predators eat them and human beings kill them for money. So this is the reason why the dugongs are endangered. Dugongs are endangered because sharks, crocodiles … and killer whales hunt them for food. Also entanglement in fishing wire and nets, coastal development and pollution is a major problem. Aboriginals are playing a large part in culling and hunting dugongs for meat, because it's their hunting right."}, {"url": "http://www.answers.com/Q/Why_are_dugongs_endangered", "passage_text": "Because their predators eat them and human beings kill them for money. So this is the reason why the dugongs are endangered. Dugongs are endangered because sharks, crocodiles and killer whales hunt them for food. Also entanglement in fishing wire and nets, coastal development and pollution is a major problem. Aboriginals are playing a large part in culling and hunting dugongs for meat, because it's their hunting right. "}, {"url": "http://www.savethedugong.org/news.html", "passage_text": "In the UAE, when a single endangered dugong dies, it's front page news. Dugongs are protected by federal law there, and Abu Dhabi allegedly has the second largest dugong population in the world (ca. 2000), after Australia. Dugongs are protected throughout the UAE and cherished by all. "}, {"url": "http://www.worldwildlife.org/species/dugong", "passage_text": "Does not qualify for Critically Endangered, Endangered, Vulnerable, or Near Threatened. Dugongs are threatened by sea grass habitat loss or degradation because of coastal development or industrial activities that cause water pollution. If there is not enough sea grass to eat then the dugong does not breed normally. This makes the conservation of their shallow water marine habitat very important. 02 Adopt a Dugong Make a symbolic dugong adoption to help save some of the world's most endangered animals from extinction and support WWF's conservation efforts."}, {"url": "http://www.environment.nsw.gov.au/determinations/DugongEndSpListing.htm", "passage_text": "1. The Dugong, Dugong dugon, is one of only four extant sirenian mammals. They are unique amongst marine mammals by being almost entirely herbivorous. The Dugongs main food is seagrass, and to a much lesser extent marine algae when seagrass is scarce. NSW Scientific Committee-final determination. The Scientific Committee, established by the Threatened Species Conservation Act, has made a Final Determination to list the Dugong, Dugong dugon (Mueller müller), 1776 as AN ENDANGERED species On part 1 Of schedule 1 of The. act"}, {"url": "https://en.wikipedia.org/wiki/Dugong", "passage_text": "The IUCN lists the dugong as a species vulnerable to extinction, while the Convention on International Trade in Endangered Species limits or bans the trade of derived products. The dugong (/ˈduːɡɒŋ/ , /ˈdjuːɡɒŋ/ ; Dugong dugon) is a medium-sized marine mammal."}]