[{"url": "http://www.environmentalhealthnews.org/ehs/news/2011/brominated-battle-in-sodas", "passage_text": "The most popular sodas – Coca-Cola and Pepsi – do not contain BVO. You don't have to be a gamer to drink these fruit-flavored sodas. In the United States, 85 percent of kids drink a beverage containing sugar or artificial sweetener at least once per week, according to a study published last month. Gamers say they chug their fuel for the sugar and caffeine, but drinkers of Mountain Dew and some other citrus-flavored drinks are also getting a dose of a synthetic chemical called brominated vegetable oil, or BVO."}, {"url": "http://articles.mercola.com/sites/articles/archive/2012/01/11/brominated-vegetable-oil-in-us-soda.aspx", "passage_text": "By Dr. Mercola If you live in the U.S. and drink Mountain Dew and some other citrus-flavored sodas, then you are also getting a dose of a synthetic chemical called brominated vegetable oil (BVO). BVO was first patented by chemical companies as a flame retardant. The chemical is banned in food throughout Europe and Japan."}, {"url": "http://www.environmentalhealthnews.org/ehs/news/2013/pepsico-brominated-beverages", "passage_text": "BVO, used as an emulsifier only in citrus-based drinks, is also in Mountain Dew, Squirt, Fanta Orange, Sunkist Pineapple, Powerade Strawberry Lemonade and Fresca Original Citrus. The most popular sodas – Coca-Cola and Pepsi – do not contain BVO. BVO was patented by chemical companies as a flame retardant and has been banned in food and beverages in Europe and Japan. In 1970, the U.S. Food and Drug Administration conditionally approved the interim use of BVO in fruit-flavored soft drinks."}, {"url": "http://www.scientificamerican.com/article/soda-chemical-cloudy-health-history/", "passage_text": "The most popular sodas – Coca-Cola and Pepsi – do not contain BVO. You don't have to be a gamer to drink these fruit-flavored sodas. In the United States, 85 percent of kids drink a beverage containing sugar or artificial sweetener at least once per week, according to a study published last month. "}, {"url": "http://www.usatoday.com/story/news/nation/2014/05/05/coke-pepsi-dropping-bvo-from-all-drinks/8736657/", "passage_text": "Earlier on Monday, Coca-Cola had also said that it's removing the ingredient from all its drinks to be consistent in the ingredients it uses around the world. In addition to Powerade, Coca-Cola uses BVO in some flavors of Fanta, Fresca and several citrus-flavored fountain drinks. Coca-Cola and PepsiCo said Monday they're working to remove a controversial ingredient from all their drinks, including Mountain Dew, Fanta and Powerade. The ingredient, called brominated"}, {"url": "https://en.wikipedia.org/wiki/Brominated_vegetable_oil", "passage_text": "Brominated vegetable oil (BVO) is a complex mixture of plant-derived triglycerides that have been reacted to contain atoms of the element bromine bonded to the molecules. Brominated vegetable oil is used primarily to help emulsify citrus-flavored soft drinks, preventing them from separating during distribution. Brominated vegetable oil has been used by the soft drink industry since 1931, generally at a level of about 8 ppm. PepsiCo announced in January 2013 that it would no longer use BVO in Gatorade, and announced May 5, 2014 that it would discontinue use in all of its drinks, including Mountain Dew. As of August 4th, 2015 BVO is still an ingredient in"}, {"url": "http://www.nytimes.com/2014/05/06/business/coca-cola-to-remove-an-ingredient-questioned-by-consumers.html", "passage_text": "Coca-Cola is moving to eliminate an ingredient used in many of its citrus-flavored products after consumers expressed concerns. The company said on Monday that it was replacing brominated vegetable oil, which contains bromine, an element found in flame retardants, in products that contain it. "}, {"url": "http://www.usatoday.com/story/news/nation/2014/05/05/coke-pepsi-dropping-bvo-from-all-drinks/8736657/", "passage_text": "Coke, Pepsi dropping controversial 'BVO' from all drinks. Coca-Cola and PepsiCo said Monday they're working to remove a controversial ingredient from all their drinks, including Mountain Dew, Fanta and Powerade. The ingredient, called brominated"}]