[{"url": "http://www.simplyrecipes.com/recipes/steak_fajitas/", "passage_text": "1 1 Tbsp vegetable oil. 2  1 lb of flank steak, skirt steak or carne asada. 3  1 large yellow onion, peeled and sliced with the grain, not against the grain as one would normally slice an onion. 4  Slice first in half, and then slice off sections a half inch wide at widest point. Ingredients. 1  1 Tbsp vegetable oil. 2  1 lb of flank steak, skirt steak or carne asada. 3  1 large yellow onion, peeled and sliced with the grain, not against the grain as one would normally slice an onion. 4  2-3 bell peppers of various colors, stemmed, seeded, de-ribbed, sliced lengthwise into strips. 5  Sal"}, {"url": "https://en.wikipedia.org/wiki/Fajita", "passage_text": "Fajita is a Tex-Mex, Texan-Mexican American or Tejano, diminutive term for little strips of meat cut from the beef skirt, the most common cut used to make fajitas. The word fajita is not known to have appeared in print until 1971, according to the Oxford English Dictionary. The first culinary evidence of the fajitas with the cut of meat, the cooking style (directly on a campfire or on a grill), and the Spanish nickname goes back as far as the 1930s in the ranch lands of South and West Texas."}, {"url": "http://www.merriam-webster.com/dictionary/fajita", "passage_text": ": a Mexican food that consists of cooked strips of meat served with a flour tortilla and fillings (such as tomatoes, onions, and peppers). : a marinated strip usually of beef or chicken grilled or broiled and served usually with a flour tortilla and various savory fillings —usually used in plural. See fajita defined for English-language learners."}, {"url": "http://www.simplyrecipes.com/recipes/steak_fajitas/", "passage_text": "1 1 lb of flank steak, skirt steak or carne asada. 2  1 large yellow onion, peeled and sliced with the grain, not against the grain as one would normally slice an onion. 3  Slice first in half, and then slice off sections a half inch wide at widest point. Ingredients. 1  1 Tbsp vegetable oil. 2  1 lb of flank steak, skirt steak or carne asada. 3  1 large yellow onion, peeled and sliced with the grain, not against the grain as one would normally slice an onion. 4  2-3 bell peppers of various colors, stemmed, seeded, de-ribbed, sliced lengthwise into strips. 5  Sal"}, {"url": "https://en.wikipedia.org/wiki/Fajita", "passage_text": "A fajita (/fəˈhiːtə/ ; [faˈxita]. ) is a term found in Tex-Mex cuisine, commonly referring to any grilled meat usually served as a taco on a flour or corn tortilla. The term originally referred to the cut of beef used in the dish which is known as skirt steak. The first culinary evidence of the fajitas with the cut of meat, the cooking style (directly on a campfire or on a grill), and the Spanish nickname goes back as far as the 1930s in the ranch lands of South and West Texas."}, {"url": "http://www.food.com/recipe/steak-or-chicken-fajitas-63786", "passage_text": "Directions. 1  Slice steak into thin strips. 2  In bowl, mix together 1 tablespoons olive oil, lime juice, garlic, chili powder, cumin, hot pepper flakes, black pepper & salt. 3  Add beef strips and stir to coat, set aside. 4  Wrap tortillas in foil and place in 350° oven for 5-10 minutes or until heated through. 1 Add beef strips and stir to coat, set aside. 2  Wrap tortillas in foil and place in 350° oven for 5-10 minutes or until heated through. 3  Cut onions in half lengthwise and slice into strips, cut your peppers into strips. 4  In large non stick skillet over medium high heat, heat remaining tablespoons of olive oil."}, {"url": "http://www.merriam-webster.com/dictionary/fajita", "passage_text": "Full Definition of FAJITA. : a marinated strip usually of beef or chicken grilled or broiled and served usually with a flour tortilla and various savory fillings —usually used in plural. See fajita defined for English-language learners. ADVERTISEMENT"}, {"url": "http://www.simplyrecipes.com/recipes/chicken_fajitas/", "passage_text": "A little bit of back story. The word “fajita” means “little belt” from “faja” for strip or belt, and the diminutive “ita”. It describes a skirt steak, and fajitas were traditionally made with grilled skirt steak, though now they can be made with chicken, shrimp, you name it. 3 Remove the chicken from the marinade. Wipe off most of the marinade and sprinkle the chicken pieces with salt. 4 Heat a large cast iron frying pan on high heat for 1 to 2 minutes. Add a tablespoon of canola oil (or other high smoke point oil) to the pan."}, {"url": "http://www.food.com/recipe/steak-or-chicken-fajitas-63786", "passage_text": "1 Slice steak into thin strips. 2  In bowl, mix together 1 tablespoons olive oil, lime juice, garlic, chili powder, cumin, hot pepper flakes, black pepper & salt. 3  Add beef strips and stir to coat, set aside. 4  Wrap tortillas in foil and place in 350° oven for 5-10 minutes or until heated through. 1 Add beef strips and stir to coat, set aside. 2  Wrap tortillas in foil and place in 350° oven for 5-10 minutes or until heated through. 3  Cut onions in half lengthwise and slice into strips, cut your peppers into strips. 4  In large non stick skillet over medium high heat, heat remaining tablespoons of olive oil."}]