[{"url": "http://www.australianbiography.gov.au/subjects/keneally/bio.html", "passage_text": "Writer, Born 1935, Sydney NSW. Thomas Keneally is one of Australia's most popular and prolific writers, having published more than 30 novels, dramas, screenplays and books of non-fiction. He is also one of its most distinguished. Born in 1935 into an Irish Catholic family, Tom spent his early years in country towns of northern NSW before moving to the Sydney suburb of Homebush. He wanted desperately to be good at sport but, as an asthmatic child, spent much of his time on the sidelines reading."}, {"url": "https://www.goodreads.com/author/show/6900.Thomas_Keneally", "passage_text": "He worked as a Sydney schoolteacher before his success as a novelist, and he was a lecturer at the University Thomas Michael Keneally, AO (born 7 October 1935) is an Australian novelist, playwright and author of non-fiction. "}, {"url": "http://www.middlemiss.org/lit/authors/keneally/keneally.html", "passage_text": "Brief Biography. Born in Sydney in 1935, Thomas Keneally completed his schooling at various schools on the New South Wales north coast before commencing theological studies for the Catholic priesthood. One of the most successful modern Australian writers, Keneally has been short-listed for the Booker Prize on 4 occasions: in 1972 for The Chant of Jimmie Blacksmith, Gossip from the Forest in 1975, and Confederates in 1979, before winning the prize in 1982 with Schindler's Ark."}, {"url": "http://www.australianbiography.gov.au/subjects/keneally/", "passage_text": "Writer, Born 1935, Sydney NSW. Thomas Keneally is one of Australia's most popular and prolific writers, having published more than 30 novels, dramas, screenplays and books of non-fiction. He is also one of its most distinguished, winning numerous prizes including the Booker for Schindler's Ark, later made into an Academy Award winning film."}, {"url": "http://www.enotes.com/topics/thomas-keneally", "passage_text": "Thomas Keneally (kuh-NEE-lee) was born to Edmund and Elsie Keneally in New South Wales, Australia. The Keneally family—Irish and Roman Catholic—moved from the small town of Wauchope to Homebush, a suburb of Sydney, when Keneally was just an infant, and he was educated at the Christian Brothers’ school in Strathfield. Thomas Michael Keneally (kuh-NEE-lee), one of Australia’s best-regarded and most prolific writers, was born to Catholic parents of Irish ancestry."}, {"url": "http://www.enotes.com/topics/thomas-keneally", "passage_text": "Thomas Michael Keneally was born in Wauchope, New South Wales, Australia, on October 7, 1935. He studied for the Roman Catholic priesthood in his youth but left the seminary two weeks before he was to take Holy Orders. He completed his education at St. Patrick’s College, New South Wales. Thomas Michael Keneally (kuh-NEE-lee), one of Australia’s best-regarded and most prolific writers, was born to Catholic parents of Irish ancestry."}, {"url": "http://www.imdb.com/name/nm0447745/", "passage_text": "Writer | Actor. Thomas Keneally was born on October 7, 1935 in Sydney, New South Wales, Australia as Thomas Michael Keneally. He is a writer and actor, known for Schindler's List (1993), The Chant of Jimmie Blacksmith (1978) and Silver City (1984). He has been married to Judith Martin since 1965. They have two children. Keneally's home in Sydney's Northern Beaches has its own trophy room. In it, hangs pictures, plaques and signed shirts of his beloved Manly-Warringah Sea Eagles rugby league team."}, {"url": "http://www.imdb.com/name/nm0447745/bio", "passage_text": "Thomas Keneally was born on October 7, 1935 in Sydney, New South Wales, Australia as Thomas Michael Keneally. He is a writer and actor, known for Schindler's List (1993), The Chant of Jimmie Blacksmith (1978) and Silver City (1984). He has been married to Judith Martin since 1965. Mini Bio (1). Thomas Keneally was born on October 7, 1935 in Sydney, New South Wales, Australia as Thomas Michael Keneally. He is a writer and actor, known for Schindler's List (1993), The Chant of Jimmie Blacksmith (1978) and Silver City (1984). He has been married to Judith Martin since 1965. They have two children."}]