[{"url": "http://www.webmd.com/depression/guide/major-depression", "passage_text": "Major or clinical depression is a serious but treatable illness. Depending on the severity of symptoms, your doctor may recommend treatment with an antidepressant medication. He or she may also suggest psychotherapy, or talk therapy, in which you address your emotional state."}, {"url": "http://www.mayoclinic.org/diseases-conditions/depression/expert-answers/clinical-depression/FAQ-20057770", "passage_text": "Depression ranges in seriousness from mild, temporary episodes of sadness to severe, persistent depression. Clinical depression is the more severe form of depression, also known as major depression or major depressive disorder. It isn't the same as depression caused by a loss, such as the death of a loved one, or a medical condition, such as a thyroid disorder."}, {"url": "http://www.audioenglish.org/dictionary/clinical_depression.htm", "passage_text": "The noun CLINICAL DEPRESSION has 1 sense: 1. a state of depression and anhedonia so severe as to require clinical intervention. Familiarity information: CLINICAL DEPRESSION used as a noun is very rare."}, {"url": "http://www.webmd.com/depression/guide/major-depression", "passage_text": "Most people feel sad or low at some point in their lives. But clinical depression is marked by a depressed mood most of the day, particularly in the morning, and a loss of interest in normal activities and relationships -- symptoms that are present every day for at least 2 weeks."}, {"url": "http://www.audioenglish.org/dictionary/clinical_depression.htm", "passage_text": "Hypernyms (clinical depression is a kind of...): affective disorder; emotional disorder; emotional disturbance; major affective disorder (any mental disorder not caused by detectable organic abnormalities of the brain and in which a major disturbance of emotions is predominant)."}, {"url": "http://www.mayoclinic.org/diseases-conditions/depression/expert-answers/clinical-depression/FAQ-20057770", "passage_text": "At least one of the symptoms must be either a depressed mood or a loss of interest or pleasure. Signs and symptoms may include: 1  Depressed mood, such as feeling sad, empty or tearful (in children and teens, depressed mood can appear as constant irritability)."}, {"url": "http://www.audioenglish.org/dictionary/clinical_depression.htm", "passage_text": "Hyponyms (each of the following is a kind of clinical depression): agitated depression (a state of clinical depression in which the person exhibits irritability and restlessness). anaclitic depression (severe and progressive depression in infants who lose their mother and do not get a suitable substitute)."}, {"url": "http://www.medicinenet.com/script/main/art.asp?articlekey=11123", "passage_text": "Clinical depression: Depressed mood that meets the DSM-IV criteria for a depressive disorder. The term clinical depression is commonly used to describe depression that is a type of mental illness 'not a normal, temporary mood caused by life events or grieving."}]