[{"url": "http://www.spine-health.com/conditions/spine-anatomy/vertebrae-vertebral-column", "passage_text": "They are stacked on top of each other with a disc in between each one. All of the vertebral bodies act as a support column to hold up the spine. This column supports about half of the weight of the body, with the other half supported by the muscles. Each area of the spine has some differences in the form and function of vertebral bodies and how they are attached to adjacent structures. 1 The first cervical segment (called the atlas) is a ring that does not have a vertebral body. 2  It is attached to the second vertebral body (the axis), which acts as a post that the first vertebral ring rotates around. 3  Most of the rotation in the neck is located in these top two segments."}, {"url": "https://www.cedars-sinai.edu/Patients/Health-Conditions/Herniated-or-Ruptured-Disc.aspx", "passage_text": "Print. The spinal column is made up of bones called vertebrae that are stacked on top of each other to protect the nerves of the spinal cord. In between the stacked vertebrae are small rubbery discs that provide cushioning to keep the spine flexible and act as shock absorbers. Pain occurs when pressure is put on the nerve roots or spinal cord. Depending on the location of the herniated disc, symptoms will occur in the area of the body affected by the nerve. Some symptoms may include: 1  Pain."}, {"url": "https://www.cedars-sinai.edu/Patients/Health-Conditions/Herniated-or-Ruptured-Disc.aspx", "passage_text": "Symptoms. When spinal discs are damaged by injury, disease or the normal wear and tear associated with aging, they may bulge out of place (herniate) or break open (rupture). A herniated disc alone may not cause discomfort. Pain occurs when pressure is put on the nerve roots or spinal cord. Depending on the location of the herniated disc, symptoms will occur in the area of the body affected by the nerve. Some symptoms may include: 1  Pain."}, {"url": "http://teachmeanatomy.info/back/bones/vertebral-column/", "passage_text": "The vertebral column (also known as the backbone or the spine), is a column of approximately 33 small bones, called vertebrae. The column runs from the cranium to the apex of the coccyx, on the posterior aspect of the body. It contains and protects the spinal cord. "}, {"url": "https://en.wikipedia.org/wiki/Intervertebral_disc", "passage_text": "Intervertebral disc. An intervertebral disc (or intervertebral fibrocartilage) lies between adjacent vertebrae in the vertebral column. Each disc forms a fibrocartilaginous joint (a symphysis), to allow slight movement of the vertebrae, and acts as a ligament to hold the vertebrae together. "}, {"url": "http://www.ncbi.nlm.nih.gov/pubmedhealth/PMH0001478/", "passage_text": "About Slipped Disks. The spine is made up of a chain of bones called the vertebrae. The front part of each of the vertebrae is called the vertebral body. Soft spinal disks are found between the vertebrae. The disks have a hard, multilayered casing and a gel-like center (nucleus pulposus). "}, {"url": "https://en.wikipedia.org/wiki/Human_vertebral_column", "passage_text": "The human vertebral column consists of 33 vertebrae. These are divided into different regions, which correspond to the curves of the spinal column. These regions are called the cervical spine, thoracic spine, lumbar spine, sacrum and coccyx. There are a total of 33 vertebrae in the vertebral column. The articulating vertebrae are named according to their region of the spine. There are seven cervical vertebrae, twelve thoracic vertebrae and five lumbar vertebrae."}, {"url": "https://en.wikipedia.org/wiki/Human_vertebral_column", "passage_text": "The human vertebral column is the vertebral column (backbone or spine) of the human skeleton, consisting of 24 articulating vertebrae and 9 fused vertebrae in the sacrum and the coccyx. The vertebrae in the column are separated from each other by intervertebral discs. There are a total of 33 vertebrae in the vertebral column. The articulating vertebrae are named according to their region of the spine. There are seven cervical vertebrae, twelve thoracic vertebrae and five lumbar vertebrae."}, {"url": "https://www.cedars-sinai.edu/Patients/Health-Conditions/Herniated-or-Ruptured-Disc.aspx", "passage_text": "Degeneration of the disc (disc disease), aging or injury to the spine are common causes of herniated discs. Disc disease may result from tiny tears or cracks in the outer capsule of the disc. Pain occurs when pressure is put on the nerve roots or spinal cord. Depending on the location of the herniated disc, symptoms will occur in the area of the body affected by the nerve. Some symptoms may include: 1  Pain."}, {"url": "http://www.spine-health.com/conditions/spine-anatomy/spinal-discs", "passage_text": "Fig 1: Healthy Microtome Section. (larger view). The vertebral disc in the spine is an interesting and unique structure. Its primary purpose is to act as a shock absorber between adjacent vertebrae. Spinal discs also act as ligaments that hold the vertebrae of the spine together and as cartilaginous joints that allow for slight mobility in the spine. There are a total of twenty-three vertebral discs in the spinal column. Specific problems with any of these discs may prompt different symptoms, including back pain, neck pain, and sciatica. 1  See All About Spinal Disc Problems. "}]