[{"url": "http://www.beautyschoolsdirectory.com/faq/makeup-artist.php", "passage_text": "This type of makeup artistry is very creative, and the artist learns to concoct a character's appearance as part of the director's vision. You can learn this art on the job, and you can also take classes at colleges with theatrical programs. A day in the life of the makeup artist is tough to pin down, because every day can be totally different for this dynamic and constantly changing profession! One day you may be doing makeup backstage at a runway fashion show, and the next day you could be doing makeup for a bride and her bridal, party."}, {"url": "http://fabjob.com/program/become-makeup-artist/", "passage_text": "As a makeup artist you will have the satisfaction of making your vision a reality. A makeup artist is intimately involved in the most important and exciting events of people's lives, from weddings to the Academy Awards. Makeup artists get to work with celebrities such as models, actors, politicians, and musicians. As a makeup artist you will have a rewarding job with flexible hours. If you start your own business as a freelance makeup artist you will enjoy the freedom of being your own boss. Top makeup artists get paid hundreds or thousands of dollars a day for their services."}, {"url": "http://www.makeupartistbeauty.com/what-does-a-makeup-artist-do/", "passage_text": "What Does a Makeup Artist Do? A makeup artist (or ‘make-up artist’) works with the human body as medium for his or her artistic presentation, using makeup as well as prosthetics. The schedule of a makeup artist is generally quite flexible depending on the projects and so is the MA’s income, which highly depends on the location, the MUA’s reputation, the project’s magnitude and eventually of course the client’s budget (see PayScale Research Center for median makeup artist’s salary)."}, {"url": "http://www.wisegeek.com/what-does-a-makeup-artist-do.htm", "passage_text": "A makeup artist is a professional who specializes in the application of makeup. This can include special uses such as theatrical and effects makeup as well as more standard cosmetics. "}, {"url": "http://www.wisegeek.com/what-does-a-make-up-artist-do.htm", "passage_text": "A make-up artist will be present for a shoot to apply the right make-up to the model or actress. Make-up artists help actors capture specific looks for film and television roles. Make-up artists work with models on photo shoots. Make-up artists can teach women the best way to apply blush for their face shape. Make-up artists may teach others how to apply makeup to their own faces. Make-up artists apply cosmetics to their clients. Some make-up artists build a reputation by working on the sets of photo shoots for magazines. Make-up artists may help brides create a flattering and unique look"}, {"url": "http://www.beautyschoolsdirectory.com/faq/makeup-artist.php", "passage_text": "A makeup artist is someone who uses cosmetic techniques and processes to create beauty upon the human body. In its simplest form, it enhances a person's appearance, bringing out color and features and hiding or smoothing out flaws, using cosmetic products. A day in the life of the makeup artist is tough to pin down, because every day can be totally different for this dynamic and constantly changing profession! One day you may be doing makeup backstage at a runway fashion show, and the next day you could be doing makeup for a bride and her bridal, party."}, {"url": "https://en.wikipedia.org/wiki/Make-up_artist", "passage_text": "A make-up artist or makeup artist is an artist whose medium is the human body, applying makeup and prosthetics for theatrical, television, film, fashion, magazines and other similar productions including all aspects of the modeling industry. Bridal makeup is a new segment in a makeup artist's repertoire. From ethnic, to glamorous, to contemporary, makeup artists are now an important part of wedding planning in Asia, Europe, Africa and North America."}]