[{"url": "http://blog.prepscholar.com/act-score-range", "passage_text": "ACT Score Range: The Basics. On the ACT, your composite score can be anywhere from a 1 to a 36. Unlike the SAT, the composite score is not the sum of the scores of the other tests-it’s the average. The ACT has four sections: English, Math, Reading, and Science. Each one is also scored on a scale of 1 to 36, and the average of these four scores will make up your composite score."}, {"url": "http://www.discoveractaspire.org/pdf/2014_actaspire_UnderstandingAspireResults.pdf", "passage_text": "Figure 3. Additional measures on the student score report ACT Aspire Composite score and predicted ACT Composite scorepredicted ACT subject test score range. WhAT YouR SCoReS MeAn 7 If you are a 9th-or 10th-grade student, ACT Aspire subject tests offer a bridge to the ACT test. "}, {"url": "http://collegeapps.about.com/od/theact/f/goodactscore.htm", "passage_text": "Those four scores are then averaged to generate the composite score used by most colleges. The average composite score is roughly a 21. That is, about 50% of test-takers score below a 21. For students who took the ACT with writing, the writing section is scored on a 12-point scale. The average score is between 7 and 8. Very few students get a perfect ACT score, even those who get into the country's top colleges. In fact, anyone scoring a 34, 35 or 36 is among the top 1% of test-takers in the country. The table above shows the middle 50% range of ACT scores for different schools. "}, {"url": "http://www.princetonreview.com/college-advice/good-sat-score-act-score", "passage_text": "Well, it all depends on the colleges you are considering. A 23 on the ACT or a 1800 on the SAT may be above average at one university but below average at another. The higher your score, the more options are open to you. Above average SAT/ACT scores will improve your chances of getting into a more selective school. Scores below an 1100 on the SAT or a 15 on ACT are considered low at just about any four-year college. You can overcome low scores with good grades or an outstanding application"}, {"url": "https://en.wikipedia.org/wiki/ACT_(test)", "passage_text": "A sampling of ACT admissions scores shows that the 75th percentile composite score was 24.1 at public four-year institutions and 25.3 at private four-year institutions. It is recommended that students check with their prospective institutions directly to understand ACT admissions requirements. The main four tests are scored individually on a scale of 1–36, and a Composite score is provided which is the whole number average of the four scores. Note that a composite score of 32.5 rounds up to a 33."}, {"url": "http://www.ehow.com/about_5412720_average-act-score.html", "passage_text": "National and Other Averages. Nationally, in 2013, the average ACT composite score was 20.9 with a maximum score of 36. The average national scores were 20.2 for English, 20.9 for mathematics, 21.1 for reading and 20.7 for science, with 54 percent of all high school graduates tested. State average composite scores ranged from 18.7 to 24.1. "}, {"url": "http://blog.prepscholar.com/what-is-a-good-act-score-a-bad-act-score-an-excellent-act-score", "passage_text": "The short answer: 20 (composite score) is the national ACT average. About half of students score above that, and half of students score below. The top 25% of ACT takers score about 24 or more, so if your score is above 24, that's excellent. The bottom 25% of ACT takers score 16 or less -- so if you're scoring in that range, be careful! Exclusive Free Bonus: Click here to download a free step-by-step guide on finding your personal ACT score target"}, {"url": "https://en.wikipedia.org/wiki/SAT", "passage_text": "Possible scores on the SAT range from 600 to 2400, combining test results from three 800-point sections: Mathematics, Critical Reading, and Writing. Taking the SAT or its competitor, the ACT, is required for freshman entry to many, but not all, universities in the United States. "}, {"url": "http://collegeapps.about.com/od/sat/f/goodsatscore.htm", "passage_text": "So what is a good SAT score? The exam consists of three parts: Critical Reading, Mathematics and Writing. The scores from each section can range from 200 to 800, so the best possible total score is 2400. The average score for each section is roughly 500, so the average total score is about 1500. For the 1.66 million test-takers in 2013, the mean scores were 496 critical reading, 514 math, and 488 writing."}]