[{"url": "http://health.costhelper.com/wisdom-teeth-removal.html", "passage_text": "1 Dental insurance might cover 15%-50% of wisdom tooth removal if the procedure is considered medically necessary, and some dental plans only pay an annual maximum of $1,000-$1,500. 2  CostHelper readers without insurance report total costs of $250-$750 for extracting a single impacted wisdom tooth. 1 CostHelper readers without dental insurance reported paying $720-$2,735 to have all four wisdom teeth removed at once, for an average cost of $1,616."}, {"url": "http://www.yourdentistryguide.com/wisdom-teeth/", "passage_text": "This cost range does not include fees associated with sedation, X-rays, possible oral surgery necessities, or the proximity of the wisdom tooth to surrounding teeth and nerves. Extraction costs for impacted wisdom teeth are significantly higher than for erupted wisdom teeth. Depending on the type of dental insurance you have, insurance companies may provide a 15 percent reimbursement or up to a 50 percent absorption of the total procedure costs. Wisdom teeth removal is a fairly common oral surgery. However, the removal of wisdom teeth prior to eruption involves a surgical procedure that is far from a simple tooth extraction."}, {"url": "http://www.mypetsdentist.com/fees-for-services.pml", "passage_text": "Fees for dental and oral surgery services.Peace of mind is priceless! Veterinary dental services are of extremely high value for clients. The veterinary dental specialist is very thorough and can provide peace of mind. Dental and Oral Surgery Consultation: $100-$135. The dental and Oral Surgery consultation fee is $100 to $135. Every effort is made to discuss oral health problems, potential treatments, costs and to help owners keep their pet's mouth healthy"}, {"url": "http://health.costhelper.com/tooth-extraction.html", "passage_text": "1 CostHelper readers without insurance report paying $185-$600 for these more complicated extractions, at an average cost of $334. 2  CostHelper readers with insurance report out-of-pocket expenses of $60-$885, for an average cost of $401. 1 Surgical extraction of a tooth can cost $150-$650 or more, depending on the type of anesthesia used (IV sedation typically costs $250-$500 more than local anesthesia), the local cost of living, whether the appointment is on an emergency basis and the type of extraction."}, {"url": "http://health.costhelper.com/wisdom-teeth-removal.html", "passage_text": "1 CostHelper readers without insurance report total costs of $250-$750 for extracting a single impacted wisdom tooth. 2  CostHelper readers with dental insurance report out-of-pocket expenses of $132-$800 for a single impacted tooth, or an average of $416. 1 CostHelper readers without dental insurance reported paying $720-$2,735 to have all four wisdom teeth removed at once, for an average cost of $1,616."}, {"url": "http://www.docshop.com/education/dental/general-dentistry/full-reconstruction", "passage_text": "1 The cost of bridges varies greatly. 2  Dental crown placement can cost from $600 to more than $1,000, and the type of material used for the restoration is a big cost factor. 3  Inlays and onlays generally cost from $650 to $1,200 per tooth, and materials are a major factor in cost. 1 Dental crown placement can cost from $600 to more than $1,000, and the type of material used for the restoration is a big cost factor. 2  Inlays and onlays generally cost from $650 to $1,200 per tooth, and materials are a major factor in cost. 3  Tooth-colored fillings typically cost from $150 to $200 per filling."}, {"url": "http://www.1800dentist.com/dental-implants/", "passage_text": "He or she can best determine if you are a candidate for dental implants. Now let's take a look at dental implant cost. Without a doubt, the cost of dental implants is an important consideration. And for good reason. While the cost of dental implants differ, prices can range from $1000-$3000 per implant. Most dental insurance plans consider the procedure cosmetic and don't cover costs."}, {"url": "https://www.humana.com/learning-center/health-and-wellbeing/healthy-living/how-to-prepare-for-oral-surgery", "passage_text": "1 Some oral surgeons perform complicated facial reconstructions or other cosmetic surgeries. 2  These surgeries can cost hundreds of thousands of dollars. 3  If you are an oral surgery patient, you could possibly get procedures covered by using a combination of dental insurance and health insurance. "}, {"url": "http://www.truedentaldiscounts.com/dental-procedures/discount-oral-surgery.php", "passage_text": "To find the best rates for oral examinations, patients usually get quotes from several dentists, asking for a comprehensive breakdown of the fees and the estimated total costs. The average cost for a oral surgery is between $149 and $240+ . However, with a discount dental plan, you could save on average 15% - 50% for the same procedure. Costs will vary depending on where you live and your needs. "}]