[{"url": "https://uk.answers.yahoo.com/question/index?qid=20100203060655AAd3zks", "passage_text": "Rating Newest Oldest. Best Answer: It costs £77.50 to replace a lost passport in the UK, you can download the forms on line from my source. I think you'll find £49 is for a child's passport. Source(s): http://www.direct.gov.uk/en/TravelAndTra... Retired travel rep. You'll also need to report the lost passport (even if you don't need a replacement one right now) to prevent anyone using it to commit fraud in your name. Here's the section for that: http://www.direct.gov.uk/en/TravelAndTra... Btw, Owlatron's price above (£49) is for a replacement *child's* passport. Good luck with it."}, {"url": "https://www.gov.uk/passport-fees", "passage_text": "Passport fees. A standard adult first passport or renewal costs £72.50, or £82.25 if you use the Post Office’s Passport Check and Send service. Child passports cost £46, or £55.75 using Check and Send. You can’t get a refund if you cancel your application or you’re not entitled to a passport. "}, {"url": "http://www.ehow.com/about_4571800_how-much-replace-lost-passport.html", "passage_text": "Consular Lost/Stolen Passport Section. 1111 19th St., NW, Suite 500. Washington, D.C. 20036. If you're out of the country when you lose the passport, you'll need to contact the nearest U.S. Embassy or Consulate to report your missing passport and apply for a new one. The fee for a passport book for adults 16 and over is $100, while the passport card fee is $45. For those under the age of 16, passport books are $85 while cards are $35. Expedited service is available for an additional fee of $60, for passport books only. Also bring the DS-64 form, if you haven't already mailed it."}, {"url": "http://www.us-passport-service-guide.com/how-much-does-a-passport-cost.html", "passage_text": "The cost of a passport can vary depending on the type of service you require, how quickly you need to get the application processed and any additional services you might need. There is an application fee for most services ranging from only $15 for a passport card for a minor to $110 for a new passport or renewal. An execution fee of $25 is mandatory when submitting Form DS-11. This is paid to the agent that adjudicates the application. The fees for some of the optional services are $60 for expedited service, $14.85 for overnight delivery of your new passport and $150 for a file search. The highest amount an applicant might spend to get a passport can reach $750 or more. That's a pretty high price to pay for a passport and probably only worth the cost in emergency situations. Hopefully, this article will help you better understand all the expenses involved in getting a passport."}, {"url": "http://travel.costhelper.com/passport.html", "passage_text": "1 Breaking down the specific costs, the application fee for a passport booklet is $75 for adults (16+) and $60 for children. 2  Applying for a passport card costs $20 for adults and $10 for children. 3  Applicants must also submit two 2-inch by 2-inch color photos with the passport application. 1 Applying for a passport card costs $20 for adults and $10 for children. 2  Applicants must also submit two 2-inch by 2-inch color photos with the passport application. 3  Passport photos cost about $15, and can be taken at certain branches of the US Post Office, FedEx and UPS stores and photography studios."}, {"url": "http://www.usatoday.com/story/travel/advice/2013/04/04/passport-101-how-to-apply-renew-or-replace/2051177/", "passage_text": "Expediting a passport. You can get your passport expedited in roughly two to three weeks (door-to-door) via the State Department when you pay an extra $60 plus $12.85 for overnight delivery in addition to the standard processing fees. Renewing a passport. You have two options here: Either you have your old passport or you don't. If the former's true, you can apply through the mail as long as your most recent passport is undamaged, was issued when you were at least 16 years old, and isn't more than 15 years old."}, {"url": "http://travel.costhelper.com/passport.html", "passage_text": "1 The total cost to get photos and apply for a passport can run $50-$175. 2  The Department of State Passport Fees website breaks down all the standard government fees. 3  Breaking down the specific costs, the application fee for a passport booklet is $75 for adults (16+) and $60 for children. 1 Applying for a passport card costs $20 for adults and $10 for children. 2  Applicants must also submit two 2-inch by 2-inch color photos with the passport application. 3  Passport photos cost about $15, and can be taken at certain branches of the US Post Office, FedEx and UPS stores and photography studios."}, {"url": "http://www.usatoday.com/story/travel/advice/2013/04/04/passport-101-how-to-apply-renew-or-replace/2051177/", "passage_text": "You'll have to go there in person to get a new passport in order to return home. In What to Do If You've Lost Your Bag, Wallet, Everything, Rick Steves writes, A replacement passport costs $140 and can generally be issued within a few days, or faster if you make a good case that you need it right away. Renewing a passport. You have two options here: Either you have your old passport or you don't. If the former's true, you can apply through the mail as long as your most recent passport is undamaged, was issued when you were at least 16 years old, and isn't more than 15 years old."}, {"url": "http://www.cic.gc.ca/english/passport/security/lost-stolen.asp", "passage_text": "1 A document to support your identity; 2  The appropriate fee (passport fee + replacement fee); and. 3  A complete Declaration concerning a lost, stolen, inaccessible, damaged or found Canadian travel document [PPTC 203, PDF, 150 KB]. "}]