[{"url": "https://answers.yahoo.com/question/index?qid=20071011152534AAik7AH", "passage_text": "Maybe just your vet is wrong! My vet says small breed dogs should not leave the mother until they are at least 10 weeks old and larghe breed dogs should not leave the mother before 8 weeks old. Report Abuse. I keep puppies and kittens 12 weeks. They can leave between 7 and 9 but it is better for them to be with their mom longer. My vet reccomends 10 weeks but I personally go for 12 to allow more time for socialization and skills building. My chihuahua had puppies 3 weeks ago, they will stay until they are 12"}, {"url": "https://answers.yahoo.com/question/index?qid=20100414135001AALez52", "passage_text": "At the very least a puppy needs to be 8 weeks old before leaving its mother preferably weaned off of milk and on to dry food. Go to walmart and get all the proper bottles, formula etc as that is what you'll need it will most likely die if you do not. Puppy needs to be 8 weeks old before leaving. He needs his mother to discipline him.. and teach him lessons that humans cant teach puppies. The breeder just wants peace and quiet.. and is tired of the natural order of things."}, {"url": "http://www.dognotebook.com/how-long-before-you-can-take-a-pup-away-from-its-mom/", "passage_text": "The mother provides vital nutrition, necessary warmth and personal care. Taking a puppy away from its mother should be done gradually, if possible. It should start when the pup is about 4 weeks old, and finish when the pooch is between 7 to 8 weeks of age. Newborns are utterly dependent on their mother’s milk during the first 4 weeks of their lives"}, {"url": "http://www.snowdog.guru/true-cost-early-removal-puppy-mother-litter-mates/", "passage_text": "What you need to know that your puppy should never leave its mother and litter mates before they are at least 8 weeks of age. It frustrates me to read a behaviour related question, to then find out that the dog was allowed to be removed from the mother and siblings before the age of 8 or 9 weeks old. "}, {"url": "http://dogcare.dailypuppy.com/can-dog-away-its-mom-before-6-weeks-2078.html", "passage_text": "Socialization with humans should begin once the puppies are weaned from their mother, at about 7 to 8 weeks of age. It's important to remember that all puppies, up until about 12 weeks of age, are still young and sensitive. The mother's milk provides adequate sustenance until about 4 weeks of age, when the mother and litter's human guardians can begin the transition to solid food. A puppy's vision and hearing only begins to function at about 3 or 4"}, {"url": "http://dogcare.dailypuppy.com/can-dog-away-its-mom-before-6-weeks-2078.html", "passage_text": "A puppy's mother provides vital nutrition, warmth, personal care and attention. Weaning a puppy from its mother is a gradual process that should start at about 4 weeks of age and finish between 7 to 8 weeks of age. Therefore, it's not recommended to take a dog away from its mother before 6 weeks of age. The mother's milk provides adequate sustenance until about 4 weeks of age, when the mother and litter's human guardians can begin the transition to solid food. A puppy's vision and hearing only begins to function at about 3 or 4"}, {"url": "http://www.pets4homes.co.uk/pet-advice/how-old-should-puppies-be-before-they-leave-their-mother-.html", "passage_text": "Most professional breeders of pedigree dogs will not allow their pups to go to their new homes until they are twelve weeks old, although some breeders see eight weeks as a fair time to allow the puppies to leave, and taking home a puppy at eight weeks old is not uncommon. There is a considerable amount of variation in terms of what people think of as an acceptable age for puppies to leave their dam and littermates, and while understandably puppy buyers like to get their new puppy home as soon as possible, it is vitally important that the puppies are not removed from the dam too soon."}]