[{"url": "http://www.studymode.com/course-notes/The-Invention-Of-The-Printing-Press-1096870.html", "passage_text": "I believe a technological invention that has had the biggest impact in the advancement of our society is the printing press. Without the invention of the printing press, education for the masses would have been unavailable to the common man. Prior to the Renaissance period, literacy was only offered to noblemen who were preparing themselves for a career in the church. "}, {"url": "http://classroom.synonym.com/impact-did-invention-printing-press-spread-religion-6617.html", "passage_text": "Johann Gutenberg’s invention of the printing press around 1448 had a significant impact on the spread of ideas in Europe and beyond. Printing technology traveled quickly across Europe and, at a time of great religious change, played a key role in the success of the Protestant Reformation. The invention of the printing press removed control of written material from the Catholic Church and made it difficult for the church to inhibit the spread of what it regarded as heretical ideas."}, {"url": "http://classroom.synonym.com/impact-did-invention-printing-press-spread-religion-6617.html", "passage_text": "1 Massachusetts Institute of Technology: Inventor of the Week, Johann Gutenberg. 2  The Flow of History: The Invention of the Printing Press and its Effects. “ 3 Printing, Propaganda and Martin Luther”; Mark U. Edwards Ph.D. The invention of the printing press removed control of written material from the Catholic Church and made it difficult for the church to inhibit the spread of what it regarded as heretical ideas."}, {"url": "https://answers.yahoo.com/question/index?qid=20111017095626AAMWnVa", "passage_text": "Best Answer: The printing press had dramatic effects on European civilization. Its immediate effect was that it spread information quickly and accurately. This helped create a wider literate reading public. This Site Might Help You. RE: What are 3 effects the printing press has on society? I need 3 different effects that the printing press has had on the Renaissance time period, modern society, or both."}, {"url": "http://classroom.synonym.com/impact-did-invention-printing-press-spread-religion-6617.html", "passage_text": "The printing press drastically cut the cost of producing books and other printed materials. Prior to Gutenberg’s invention, the only way of making multiple copies of a book was to copy the text by hand, an laborious and intensely time-consuming occupation usually performed by monks. The invention of the printing press removed control of written material from the Catholic Church and made it difficult for the church to inhibit the spread of what it regarded as heretical ideas."}, {"url": "http://www.answers.com/Q/What_impact_did_the_printing_press_invention_make_on_society", "passage_text": "According to most historians, the printing press was invented by Gutenberg, in Mainz, in the Holy Roman Empire (Germany) in 1441, or about that time. There are many people w … ho disagree over the invention of the printing press, and alternate views have been put forward. There is a link to an article in an online encyclopedia below. The article say that the printing press was invented in China by 593 AD."}, {"url": "http://www.flowofhistory.com/units/west/11/FC74", "passage_text": "A century later, all that had changed. Like any other invention, the printing press came along and had an impact when the right conditions existed at the right time and place. In this case, that was Europe in the mid 1400's. If one process started the chain reaction of events that led to the invention of the printing press, it was the rise of towns in Western Europe that sparked trade with the outside world all the way to China."}, {"url": "https://en.wikipedia.org/wiki/Printing_press", "passage_text": "The printing press was introduced to the West in the Holy Roman Empire by Johannes Gutenberg, around 1440. Gutenberg, a goldsmith by profession, devised a hand mould to create metal movable type, and adapted screw presses and other existing technologies, to create a printing system. The invention of the printing press led to a huge increase of printing activities across Europe within only a few decades. From a single print shop in Mainz, Germany, printing had spread to no less than around 270 cities in Central, Western and Eastern Europe by the end of the 15th century."}]