[{"url": "http://chemistry.wikia.com/wiki/List_of_elements_by_symbol", "passage_text": "List of elements by symbol. 189 pages on this wiki. This is a list of chemical elements by symbol, including the current symbols used to identify the chemical elements as recognized by the International Union of Pure and Applied Chemistry, as well as proposed and historical symbols."}, {"url": "http://www.rsc.org/periodic-table/element/82/lead", "passage_text": "Elements and Periodic Table History. Lead has been mined for more than 6,000 years, and the metal and its compounds have been used throughout history. Small lead nuggets have been found in pre-Columbian Peru, Yucatan, and Guatemala. "}, {"url": "http://www.audioenglish.org/dictionary/pb.htm", "passage_text": "• PB (noun). The noun PB has 1 sense: 1. a soft heavy toxic malleable metallic element; bluish white when freshly cut but tarnishes readily to dull grey. Familiarity information: PB used as a noun is very rare. Hyponyms (each of the following is a kind of Pb): hard lead (unrefined lead that is hard because of the impurities it contains). antimonial lead; hard lead (a lead alloy that contains about 5% antimony). pig lead (lead that is cast in pigs)."}, {"url": "http://webelements.com/", "passage_text": "[257.10]. 101. Md. [258.10]. 102. No. [259.10]. The periodic table is a table of the chemical elements in which the elements are arranged by order of atomic number in such a way that the periodic properties (chemical periodicity) of the elements are made clear. "}, {"url": "http://environmentalchemistry.com/yogi/periodic/Pb.html", "passage_text": "Element Lead-Pb. Comprehensive data on the chemical element Lead is provided on this page; including scores of properties, element names in many languages, most known nuclides of Lead. Citing this page. If you need to cite this page, you can copy this text: Kenneth Barbalace. Periodic Table of Elements-Lead-Pb. EnvironmentalChemistry.com. 1995 - 2015. Accessed on-line: 10/14/2015. http://EnvironmentalChemistry.com/yogi/periodic/Pb.html. ."}, {"url": "http://medical-dictionary.thefreedictionary.com/Lead+(element)", "passage_text": "lead (Pb), n a common soft, blue-gray, metallic element. Its atomic number is 82, and its atomic weight is 207. In its metallic form, it is used as a protective shielding against radiographs. lead. A metallic element, atomic no. 82, atomic wt. 207.2; occurs in nature as an oxide or one of the salts, but chiefly as the sulfide, or galena; 210 Pb (half-life equal to 22.6 years) has been used in the treatment of certain eye conditions."}, {"url": "http://www.convertunits.com/element/Lead", "passage_text": "not known. Origin Of Name: From the Anglo-Saxon word lead; Latin, plumbum (the origin of the symbol Pb is the Latin word plumbum meaning liquid silver. Calculate the molecular weight of Lead or molecular weight Pb. Also see the full list of chemical elements and atomic weights."}, {"url": "http://www.answers.com/Q/What_is_the_element_name_for_PbS", "passage_text": "exists and is an alternate of. Merge this question into. Split and merge into it. Answered by The Community. Making the world better, one answer at a time. PbS is not an element, it is a compound. Pb is lead and S is sulfur. The name of this compound is commonly known as Lead Sulfide. "}]