[{"url": "http://www.wikihow.com/Write-an-Incident-Report", "passage_text": "If you're a security guard or police officer deployed to the scene of an incident, writing up a detailed and accurate report is an important part of doing your job correctly. A good incident report gives a thorough account of what happened without glossing over unsavory information or leaving out important facts. Write it the same day as the incident if possible. If you wait a day or two your memory will start to get a little fuzzy. You should write down the basic facts you need to remember as soon as the incident occurs. Do your report write-up within the first 24 hours afterward."}, {"url": "http://www.ehow.com/how_8138959_can-look-up-police-report.html", "passage_text": "Get a Copy Online. Check to see if the state and county you need a police report from offers online requests. Not all do. Visit policereports.us and click on your state (see Resources). Choose the appropriate country or department from the provided list. You may also have to pay a small fee, usually around $3. Pick up the police report in the provided period of time. Most requests take between 24 to 72 hours to process. If you arrive too early it may not be ready. If you wait too long, such as more than two weeks, the office may cancel the report request."}, {"url": "http://www.wikihow.com/Write-an-Incident-Report", "passage_text": "1 In other cases you'll be asked to type or write up the report on your own. 2  If possible, do your write up using word processing software. 3  It will look neater, and you'll be able to use spell check to polish it when you're finished. 4  If you write your report by hand, print clearly instead of using cursive. Write it the same day as the incident if possible. If you wait a day or two your memory will start to get a little fuzzy. You should write down the basic facts you need to remember as soon as the incident occurs. Do your report write-up within the first 24 hours afterward."}, {"url": "http://www.ehow.com/how_8377808_look-police-reports-case-number.html", "passage_text": "Locate the address or telephone number of the police department or sheriff's office that created the report. To locate this information, look in your local phone book, or search for the office by name using your favorite search engine. For example, enter Orlando Police Department into a search box. Photodisc/Photodisc/Getty Images. Call the department's non-emergency telephone number. When a police officer responds to a call for service that involves an accident or results in an arrest the officer generates a written report. The report details the events that transpired, as well as the parties involved in the case."}, {"url": "https://www.phoenix.gov/police/policereport", "passage_text": "1 Your incident reported online will be reviewed. 2  If further investigation of your case is needed, you may be contacted. 3  Once the report has been approved, a Phoenix Police Department report number will be emailed to you. 4  Please be sure to check your Spam or Junk mail email folder or add phoenix.gov to your white list. 1 You will receive a tracking number and be able to print a copy of your submission. 2  Your incident reported online will be reviewed. 3  If further investigation of your case is needed, you may be contacted. 4  Once the report has been approved, a Phoenix Police Department report number will be emailed to you"}, {"url": "http://www.wikihow.com/Write-an-Incident-Report", "passage_text": "Your form may have blanks for you to fill out with information about the incident. If not, start the report with a sentence clearly stating the following basic information: 1  The time, date and location of the incident (be specific; write the exact street address, etc.). 2  Your name and ID number. Write it the same day as the incident if possible. If you wait a day or two your memory will start to get a little fuzzy. You should write down the basic facts you need to remember as soon as the incident occurs. Do your report write-up within the first 24 hours afterward."}, {"url": "https://ddrsprovider.fssa.in.gov/IFUR/", "passage_text": "Welcome to the Web-Based Incident And Follow-Up Reporting (IFUR) Tool. NOTICE TO USERS: Please be advised, Indiana Office of Technology (IOT) only supports Internet Explorer. If you access this site via Mozilla (Firefox), Safari, Chrome or some other agent, errors will likely occur. "}, {"url": "http://www.wspdp2c.org/", "passage_text": "Fill out a police report online for a non-emergency event. Welcome to the Winston-Salem Police Department P2C site. P2C (Police to Citizen) allows citizens of Winston-Salem to view police records, search for specific incidents, get crash reports, and submit an online report in an easy and simple manner. Feel free to contact the Winston-Salem Police Department with comments and questions regarding P2C. Most Wanted."}, {"url": "http://www.ehow.com/how_8138959_can-look-up-police-report.html", "passage_text": "The clerk will require you to fill out paperwork. You may also have to pay a small fee, usually around $3. Pick up the police report in the provided period of time. Most requests take between 24 to 72 hours to process. If you arrive too early it may not be ready. If you wait too long, such as more than two weeks, the office may cancel the report request."}]