[{"url": "http://familydoctor.org/familydoctor/en/teens/puberty-sexuality/puberty-what-to-expect-when-your-child-goes-through-puberty.html", "passage_text": "Puberty is the time in life when a young person starts to become sexually mature. In girls, puberty usually starts around 11 years of age, but it may start as early as 6 or 7 years of age. In boys, puberty begins around 12 years as age, but may start as early as 9 years of age. Puberty is a process that goes on for several years. Most girls are physically mature by about 14 years of age. Early puberty is sometimes called precocious or premature puberty. In most cases, early puberty is just a variation of normal puberty. In a few cases, there may be a medical reason for early puberty. You may want to visit your doctor if a young girl develops breasts and pubic hair before 7 or 8"}, {"url": "http://www.medicinenet.com/puberty/article.htm", "passage_text": "Adolescent girls reach puberty today at earlier ages than were ever recorded previously. Nutritional and other environmental influences may be responsible for this change. For example, the average age of the onset of menstrual periods in girls was 15 in 1900. When does puberty occur? The onset of puberty varies among individuals. Puberty usually occurs in girls between the ages of 10 and 14, while in boys it generally occurs later, between the ages of 12 and 16. In some African-American girls, puberty begins earlier, at about age 9, meaning that puberty occurs from ages 9 to 14"}, {"url": "http://www.webmd.com/children/news/20121020/earlier-puberty-age-9-10-average-us-boy", "passage_text": "Reviewed by Brunilda Nazario, MD. Oct. 20, 2012 -- American boys are starting puberty up to two years earlier than decades ago, new data show. Boys are entering puberty at an average age of 10 among whites and Hispanics, and at an average age of 9 among African-Americans. About a third of boys start to mature sexually up to two years earlier than average. "}, {"url": "https://en.wikipedia.org/wiki/Puberty", "passage_text": "The age at which puberty begins varies between individuals; usually, puberty begins between 10 and 13 years of age. The age at which puberty begins is affected by both genetic factors and by environmental factors such as nutritional state and social circumstances. In boys, testicular enlargement is the first physical manifestation of puberty (and is termed gonadarche). Testes in prepubertal boys change little in size from about 1 year of age to the onset of puberty, averaging about 2–3 cm in length and about 1.5–2 cm in width."}, {"url": "https://en.wikipedia.org/wiki/Puberty", "passage_text": "Although there is a wide range of normal ages, girls typically begin the process of puberty at age 10 or 11; boys at ages 11–12. Girls usually complete puberty by ages 15–17, while boys usually complete puberty by ages 16–17. The major landmark of puberty for females is menarche, the onset of menstruation, which occurs on average between ages 12–13; for males, it is the first ejaculation, which occurs on average at age 13. In boys, testicular enlargement is the first physical manifestation of puberty (and is termed gonadarche). Testes in prepubertal boys change little in size from about 1 year of age to the onset of puberty, averaging about 2–3 cm in length and about 1.5–2 cm in width."}, {"url": "http://www.medicinenet.com/puberty/article.htm", "passage_text": "Puberty facts. 1  Puberty is the period of sexual maturation and achievement of fertility. 2  The time when puberty begins varies greatly among individuals; however, puberty usually occurs in girls between the ages of 10 and 14 and between the ages of 12 and 16 in boys. When does puberty occur? The onset of puberty varies among individuals. Puberty usually occurs in girls between the ages of 10 and 14, while in boys it generally occurs later, between the ages of 12 and 16. In some African-American girls, puberty begins earlier, at about age 9, meaning that puberty occurs from ages 9 to 14"}, {"url": "http://www.theguardian.com/politics/2013/nov/04/why-is-puberty-starting-younger-precocious", "passage_text": "The duration of puberty varies too-in girls, puberty takes on average almost 3 years to complete (although anything between 2 and 6 years is still considered normal) while in boys, 4 years is normal. Girls have always developed earlier than boys-on average the onset of puberty happens between the age of 8 and 12 years in girls and between 9 and 14 years in boys."}, {"url": "http://www.med.nyu.edu/sti/content3e80.html?cid=14&ccid=86&cccid=138", "passage_text": "In the United States, almost all children show some signs of puberty by age 13 in girls and 14 in boys, and it is at these ages that the greatest amount of pubertal change in the body will usually occur. The average age for the beginning stages of puberty is 10.5 years in girls and 11.5 years in boys. The average length of time it takes for sexual changes to be complete is about 4 years. Pubertal changes occur because of the influence of hormones"}]