[{"url": "http://www.payscale.com/research/US/Job=Personal_Care_Attendant_(PCA)/Hourly_Rate", "passage_text": "Personal Care Attendants in the United States can expect to earn an average of $10.08 per hour. Earnings sit near $7.96 per hour on the lower side but can approach $13.56 on the higher side. Career duration and the particular city each impact pay for this group, with the former having the largest influence. Medical benefits are awarded to one in six, and one-tenth earn dental coverage."}, {"url": "http://www.payscale.com/research/US/Job=Patient_Transporter/Hourly_Rate", "passage_text": "(United States). The average pay for a Patient Transporter is $10.36 per hour. People in this job generally don't have more than 10 years' experience. Experience has a moderate effect on income for this job. They are in charge of operating motor vehicles, helping patients transport medical or personal devices, anticipating patients' needs, and responding to emergency situations."}, {"url": "http://work.chron.com/much-patient-care-technician-paid-hourly-4581.html", "passage_text": "The mean hourly wage technicians earned in the industry was $17.75. Patient care technicians working for the federal executive branch earned a mean hourly wage of $17.23, while the mean hourly wage that technicians working at colleges, universities and professional schools received was $15.48. Alaska was the top-paying state for patient care technicians, paying nursing aides, orderlies and attendants a mean hourly wage of $16.68 as of May 2011, according to the statistics bureau."}, {"url": "http://work.chron.com/much-patient-care-technician-paid-hourly-4581.html", "passage_text": "These workers earned a median hourly wage of $11.63. The bottom 10 percent of earners among patient care technicians were paid $8.68 or less an hour, but the top 10 percent were paid $16.91 or more an hour. Alaska was the top-paying state for patient care technicians, paying nursing aides, orderlies and attendants a mean hourly wage of $16.68 as of May 2011, according to the statistics bureau."}, {"url": "http://www.healthcare-salaries.com/technicians/patient-care-technician-salary-pct", "passage_text": "Average patient care technician salary. An average hourly wage for a patient care technician in the United States ranges from $10.40 to $13.52 per hour and an average yearly salary ranges from between $22,441 to $30,990 per annum. Check also patient care technician job description. Patient care technician salary in USA. An average starting hourly wage for a patient care technician in the United States ranges from between $9.39 – $15.94 per hour which gradually increases from $8.84 – $23.90 overtime. An average annual salary bonus of around $894 will be included and the total annual salary ranges from between $19,768 – $36,460"}, {"url": "http://www1.salary.com/Patient-Transporter-salary.html", "passage_text": "Our team of Certified Compensation Professionals has analyzed survey data collected from thousands of HR departments at companies of all sizes and industries to present this range of annual salaries for people with the job title Patient Transporter in the United States. Other responsibilities include retrieving medical records, lab results, supplies and medications. May require a high school diploma or its equivalent. No experience necessary. Has knowledge of commonly used concepts, practices, and procedures within a particular field."}, {"url": "http://www.indeed.com/salary/q-Patient-Transporter-l-Orlando,-FL.html", "passage_text": "Average Patient Transporter salaries for job postings in Orlando, FL are 11% lower than average Patient Transporter salaries for job postings nationwide. "}, {"url": "http://www.ehow.com/info_8014334_average-salary-medical-transporter.html", "passage_text": "Regional Variations. In 2014, salaries for medical transporters varied more in some regions than others, according to Indeed. In the South region, the highest average salary was in Washington, D.C. at $29,000 a year and the lowest was in Louisiana at $20,000 a year. "}, {"url": "http://www1.salary.com/Patient-Transporter-salary.html", "passage_text": "For example the median expected annual pay for a typical Patient Transporter in the United States is $26,098, so 50% of the people who perform the job of Patient Transporter in the United States are expected to make less than $26,098. Source: HR Reported data as of October 2015. 1  Salary. 2  Salary + Bonus. Other responsibilities include retrieving medical records, lab results, supplies and medications. May require a high school diploma or its equivalent. No experience necessary. Has knowledge of commonly used concepts, practices, and procedures within a particular field."}]