[{"url": "http://medical-dictionary.thefreedictionary.com/per+diem", "passage_text": "In return for this Schulenberg was to send three meals per diem to Sarah's hall room by a waiter--an obsequious one if possible--and furnish her each afternoon with a pencil draft of what Fate had in store for Schulenberg's customers on the morrow. The Four Million by Henry, O. View in context. "}, {"url": "http://definitions.uslegal.com/p/per-diem/", "passage_text": "Per Diem Law & Legal Definition. Per diem is a Latin term meaning per day. It is often used as a basis for payment of daily expenses and/or fees of an employee or an agent. Limitations on hours worked are governed by the individual employer. Per diem rates are usually applicable to temporary employment, such a temporary military service, or expenses such as travel and lodging. The term per diem means daily.. In a business setting, the term has come to mean the daily rates employees use for expenses incurred while traveling on business-related activities. These rates are likely to differ based on whether the employee travels in his or her home area, away from home, or internationally."}, {"url": "https://en.wikipedia.org/wiki/Per_diem", "passage_text": "A per diem can include part or all of the expenses incurred, for example it may exclude accommodation (for which reimbursement may be available on presentation of receipts) and only cover meals. Per diem is also used as an adjective and an adverb. Unsourced material may be challenged and removed. (April 2007). Per diem (Latin for per day or for each day) is a daily allowance for expenses—a specific amount of money an organization gives an individual, often an employee, per day to cover living expenses when traveling for work."}, {"url": "http://www.investopedia.com/terms/p/per_diem_interest.asp", "passage_text": "DEFINITION of 'Per Diem Interest'. The interest charge on a loan for one or more days. This does not necessarily mean that the interest on the loan compounds daily, per diem interest simply refers to the amount of interest that is due for one day that a loan is outstanding. Next Up. Per diem interest is calculated and paid at loan closings. It is the pro-rated amount of interest due for remaining days in a month. For example, if a mortgage closes on July 29, per diem interest is calculated for July 29, 30 and 31."}, {"url": "http://financial-dictionary.thefreedictionary.com/per+diem", "passage_text": "In return for this Schulenberg was to send three meals per diem to Sarah's hall room by a waiter--an obsequious one if possible--and furnish her each afternoon with a pencil draft of what Fate had in store for Schulenberg's customers on the morrow. Money given to an employee to pay for daily expenses, for example on a business trip. For example, if the employee goes to a convention in Reno, his employer may give him $75 per day for food."}, {"url": "http://www.investopedia.com/terms/p/per-diem-payments.asp", "passage_text": "DEFINITION of 'Per Diem Payments'. Generally, a specified amount that employers will pay to employees as reimbursement for various expenses. Per diem payments usually assume a set dollar limit, such as $30 per day for meals or $100 per day for lodging. These payments are usually made for employee travel expenses. Per diem payments are usually counted as nontaxable income to employees, up to a certain amount, and any excess reimbursement is included in box 12 of the W-2 form. The IRS allows a preset amount to be excluded from taxation for each type of per diem expense. RELATED TERMS."}, {"url": "http://prepaidmaterials.com/perdiem/", "passage_text": "The U.S. Bank Per Diem Card is a Visa-branded reloadable prepaid debit card that is a great alternative to traditional corporate credit cards and is a cost-effective way to easily manage per diem or stipend payments. "}]