[{"url": "http://www.answers.com/Q/What_is_dextrinization_and_its_examples", "passage_text": "Making the world better, one answer at a time. Dextrinization is the browning of starch goods when subjected to dry heat. On dry heating, the starch in the food goes through a chemical reaction. During this reaction, the starch molecules break down into dextrin (hence the name). Examples of dextrinization are toasting bread, and baking biscuits and cakes."}, {"url": "http://www.merriam-webster.com/dictionary/dextrin", "passage_text": "Medical Definition of DEXTRIN. : any of various soluble gummy polysaccharides (C6H10O5)n obtained from starch by the action of heat, acids, or enzymes and used as adhesives, as sizes for paper and textiles, as thickening agents (as in syrups), and in beer. dex·trin also dex·trine \\-ˌstrēn, -strən\\. dextrin. noun dex·trin \\ˈdek-strən\\"}, {"url": "http://www.merriam-webster.com/dictionary/dextrinization", "passage_text": "Definition of DEXTRINIZATION. : an act or process of dextrinizing. ADVERTISEMENT. This word doesn't usually appear in our free dictionary, but the definition from our premium Unabridged Dictionary is offered here on a limited basis. Note that some information is displayed differently in the Unabridged. To access the complete Unabridged Dictionary, with an additional 300,000 words that aren't in our free dictionary, start a free trial."}, {"url": "http://www.andritzgouda.com/en/index.php/proceslijn/Starch_dextrination/", "passage_text": "Starch dextrinization. Dependent on the intended use of the starch, e.g. paper processing, binder for pigments, glue production, it has to be dextrinated in such a way that the structure fits the production process. After tests are completed succesfully, the dextrinization (step 3) can be implemented based on the following flow sheet. The native starch is mixed with the necessary additives and processed for a certain time and under defined conditions for maturing, so that an intensive mixing of starch and additives is guaranteed."}, {"url": "https://en.wikipedia.org/wiki/Dextrinisation", "passage_text": "It consists of two types of molecules: the linear and helical amylose and the branched amylopectin. Depending on the plant, starch generally contains 20 to 25% amylose and 75 to 80% amylopectin by weight. Glycogen, the glucose store of animals, is a more branched version of amylopectin. The products of starch degradation are to the major part maltose and to a less extensive part glucose. These molecules are now exported from the plastid to the cytosol. Maltose is exported via the maltose transporter. If this transporter is mutated (MEX1-mutant), maltose accumulates in the plastid."}, {"url": "https://en.wikipedia.org/wiki/Dextrinisation", "passage_text": "Starch or amylum is a carbohydrate consisting of a large number of glucose units joined by glycosidic bonds. This polysaccharide is produced by most green plants as an energy store. The products of starch degradation are to the major part maltose and to a less extensive part glucose. These molecules are now exported from the plastid to the cytosol. Maltose is exported via the maltose transporter. If this transporter is mutated (MEX1-mutant), maltose accumulates in the plastid."}, {"url": "http://www.larapedia.com/glossary_of_food_technology_terms/dextrinisation_meaning_in_food_terminology.html", "passage_text": "Meaning and definition of dextrinisation. Is the process that occurs when starch is exposed to dry heat, the starch is broken down to dextrin, resulting in a change in colour to golden brown. In United States copyright law, fair use is a doctrine that permits limited use of copyrighted material without acquiring permission from the rights holders. Examples of fair use include commentary, search engines, criticism, news reporting, research, teaching, library archiving and scholarship."}, {"url": "http://www.answers.com/Q/What_is_the_definition_of_dextrinisation", "passage_text": "exists and is an alternate of. Merge this question into. Split and merge into it. Answer by Jessiixlawliz. Confidence votes 38. Dextrinisation is the browning process produced by dry heat on starch. The starch molecule breaks down into dextrin. 1 Pathophysiology: Definition and Practice A pathophysiology definition states that it is a hybrid family of pathology and physiology. 2  The first refers to conditions that usually appear when there is disease, while th…. 3  Research Papers: The True Definition English students study and compose many different types of essays."}, {"url": "http://www.andritzgouda.com/en/index.php/proceslijn/Starch_dextrination/", "passage_text": "Starch Dextrinization. The dextrinization leads to a structural change of the starch, that is obtained through a physical or chemical treatment. An important aspect of dextrination is the property of the raw material itself. After tests are completed succesfully, the dextrinization (step 3) can be implemented based on the following flow sheet. The native starch is mixed with the necessary additives and processed for a certain time and under defined conditions for maturing, so that an intensive mixing of starch and additives is guaranteed."}]