[{"url": "http://www.pestnet.com/termites/termite-tenting-cost/", "passage_text": "The cost of termite tenting varies depending on the number of cubic feet that is treated. This allows fumigation companies to charge for the volume of gas used. When fumigating a property, the entire home is covered and filled with gas. This varies depending on the height of the structure, in order to compensate for a greater volume of gas used. This means a 2,000 square foot home could cost between one to two thousand dollars. However, vaulted ceilings require more gas, which will increase the cost per square foot."}, {"url": "http://www.cockroachbite.net/articles/Best_Way_To_Get_Rid_Of_Roaches.html", "passage_text": "1 They have access to professional grade cockroach poisons. 2  An exterminator will be able to assess your situation and use the most appropriate insecticides to kill the roaches in house. 3  An exterminator knows what it takes to permanently get rid of cockroaches in your city and area. You need to also remove all food from the house so that the poison doesn’t get into it. Most of all is the cost, it can cost thousands of dollars to get your house tented. So while tenting is the best way to get rid of roaches, it is not practical for all families."}, {"url": "http://homeguides.sfgate.com/costs-fumigating-house-95992.html", "passage_text": "In fumigation, the house or other space being fumigated is either sealed off or a tent is placed completely over it. Fumigation prices vary based on square footage, generally costing from $1 to $3 per square foot. For example, a 2,000 square foot could between $2,000 to $6,000 to fumigate. The major factor influencing the cost of a fumigation is the size of the space"}, {"url": "http://www.cdpr.ca.gov/docs/dept/factshts/fumigation.pdf", "passage_text": "Lethal doses vary for different pests, depending on the fumigant used. It is possible for household pests (such as spiders or cockroaches) to survive a fumigation with the dosage used for drywood termites.NOTE: Reinfestations of the target pest could occur following a fumigation. The time required for fumigation varies. A fumi-gation can take anywhere from six hours to one week depending on the type of infestation, dos-age, temperature, size of the structure and other factors."}, {"url": "http://www.controlpest.net/cockroachexterminators.html", "passage_text": "It is important to ensure that roaches do not have the opportunity to bring filth and diseases into your home. Food which has been in contact with cockroaches may be contaminated and left with a distinct roach smell due to traces of roach feces, saliva and bacteria. "}, {"url": "http://homeguides.sfgate.com/fumigate-home-cheaply-39972.html", "passage_text": "Pinpoint the Pest. Treating your home for every type of bug when you only have one specific pest causing a problem can significantly increase the cost of fumigation. Numerous bugs can cause an infestation, with the most common being spiders, ants, fleas, bed bugs, cockroaches and termites. There is nothing creepier than a bug problem, and once you get over the ick factor, coming to grips with the time and money it will likely take to rid your home of the critters can be daunting. There are two ways to fumigate your home cheaply: Do the job on your own or hire a professional."}, {"url": "http://www.pestnet.com/termites/termite-tenting-cost/", "passage_text": "On average, the cost of fumigation is between $1-2 per square foot. This varies depending on the height of the structure, in order to compensate for a greater volume of gas used. This means a 2,000 square foot home could cost between one to two thousand dollars. However, vaulted ceilings require more gas, which will increase the cost per square foot."}, {"url": "http://homeguides.sfgate.com/costs-fumigating-house-95992.html", "passage_text": "Additional Costs When Fumigating. Fumigating may carry extra costs, depending on the company and the degree of infestation. For example, some fumigation companies charge an additional $100 to $200 for a pre-fumigation home inspection. Fumigation prices vary based on square footage, generally costing from $1 to $3 per square foot. For example, a 2,000 square foot could between $2,000 to $6,000 to fumigate."}, {"url": "http://www.networx.com/article/cost-of-cockroach-extermination", "passage_text": "The cost for such a service will be anywhere from $100 to $400 depending on the severity of the infestation. In addition, your exterminator may recommend periodic maintenance visits which can cost between $30 and $100 each. The cost of cockroach extermination varies depending on the size of your home and the type of treatment necessary. Exterminators may use a fogger to apply insecticide in mist form, they may spread desiccants which dry out and kill the bugs, or they may use neurotoxins."}, {"url": "http://www.cdpr.ca.gov/docs/dept/factshts/fumigation.pdf", "passage_text": "The name of the fumigant used will be entered on the notice of reentry that will be posted on the door. This is in addition to the fumigation tag, which has the name of the pest control com-pany, date of the fumigation, and the name of the fumigant used. These tags will be permanently affixed in the subarea or attic. The time required for fumigation varies. A fumi-gation can take anywhere from six hours to one week depending on the type of infestation, dos-age, temperature, size of the structure and other factors."}]