[{"url": "http://www.webmd.com/a-to-z-guides/biofeedback-therapy-uses-benefits", "passage_text": "Biofeedback sessions are typically done in a therapist's office, but there are computer programs that connect the biofeedback sensor to your own computer. A biofeedback therapist helps you practice relaxation exercises, which you fine-tune to control different body functions. Researchers aren't exactly sure how or why biofeedback works. They do know that biofeedback promotes relaxation, which can help relieve a number of conditions that are related to stress. During a biofeedback session, electrodes are attached to your skin. Finger sensors can also be used. These electrodes/sensors send signals to a monitor, which displays a sound, flash of light, or image that represents your heart and breathing rate, blood pressure, skin temperature, sweating, or muscle activity"}, {"url": "http://psychotherapy.com/bio.html", "passage_text": "Biofeedback is a treatment technique in which people are trained to improve their health by using signals from their own bodies. Physical therapists use biofeedback to help stroke victims regain movement in paralyzed muscles. Psychologists use it to help tense and anxious clients learn to relax. Both patients and therapists use it to gauge and direct the progress of treatment. For patients, the biofeedback machine acts as a kind of sixth sense which allows them to see or hear activity inside their bodies. One commonly used type of machine, for example, picks up electrical signals in the muscles."}, {"url": "https://en.wikipedia.org/wiki/Biofeedback", "passage_text": "The definition reads: Biofeedback is a process that enables an individual to learn how to change physiological activity for the purposes of improving health and performance. Precise instruments measure physiological activity such as brainwaves, heart function, breathing, muscle activity, and skin temperature. Biofeedback is a major treatment for anismus (paradoxical contraction of puborectalis during defecation). This therapy directly evolved from the investigation anorectal manometry where a probe that can record pressure is placed in the anal canal."}, {"url": "http://www.webmd.com/a-to-z-guides/biofeedback-therapy-uses-benefits", "passage_text": "It's called biofeedback, and the therapy is used to help prevent or treat conditions, including migraine headaches, chronic pain, incontinence, and high blood pressure. Researchers aren't exactly sure how or why biofeedback works. They do know that biofeedback promotes relaxation, which can help relieve a number of conditions that are related to stress. During a biofeedback session, electrodes are attached to your skin. Finger sensors can also be used. These electrodes/sensors send signals to a monitor, which displays a sound, flash of light, or image that represents your heart and breathing rate, blood pressure, skin temperature, sweating, or muscle activity"}, {"url": "http://www.medicalnewstoday.com/articles/265802.php", "passage_text": "Biofeedback therapy involves training patients to control physiological processes such as muscle tension, blood pressure, or heart rate. These processes usually occur involuntarily, however, patients who receive help from a biofeedback therapist can learn how to completely manipulate them at will. Biofeedback is typically used to treat chronic pain, urinary incontinence, high blood pressure, tension headache, and migraine headache. The three most common types of biofeedback therapy are: 1  Thermal biofeedback-which measures skin temperature. 2  Electromyography-measures muscle tension"}, {"url": "http://www.healthline.com/health/biofeedback", "passage_text": "Overview. Biofeedback is a type of therapy where sensors attached to your body measure key body functions. Biofeedback is intended to help you learn more about how you body works, so that you can develop better control over certain body functions and address health concerns"}, {"url": "http://www.medicalnewstoday.com/articles/265802.php", "passage_text": "Biofeedback is particularly effective at treating conditions brought on by severe stress. When a person is stressed, their internal processes such as blood pressure can become irregular. Biofeedback therapy teaches these patients certain relaxation and mental exercises which can alleviate their symptoms. Biofeedback is typically used to treat chronic pain, urinary incontinence, high blood pressure, tension headache, and migraine headache. The three most common types of biofeedback therapy are: 1  Thermal biofeedback-which measures skin temperature."}, {"url": "http://www.webmd.boots.com/pain-management/guide/biofeedback-therapy", "passage_text": "Biofeedback therapy. Biofeedback is a non-invasive treatment the NHS may recommend for conditions, including constipation, urinary incontinence and faecal incontinence. Special sensors are used to check what the body or specific muscles are doing and a device gives feedback to the person."}, {"url": "https://en.wikipedia.org/wiki/Biofeedback", "passage_text": "Some of the processes that can be controlled include brainwaves, muscle tone, skin conductance, heart rate and pain perception. Biofeedback may be used to improve health, performance, and the physiological changes that often occur in conjunction with changes to thoughts, emotions, and behavior. Eventually, these changes may be maintained without the use of extra equipment, for no equipment is necessarily required to practice biofeedback. Biofeedback is a major treatment for anismus (paradoxical contraction of puborectalis during defecation). This therapy directly evolved from the investigation anorectal manometry where a probe that can record pressure is placed in the anal canal."}]