[{"url": "http://theliceplace.com/pricing.html", "passage_text": "Head Lice and Nit Removal Treatment. Treatment fee is $99 per hour, which will be billed in 15-minute increments, plus the cost of the Terminator Comb. The comb is yours to keep and comes with a lifetime warranty."}, {"url": "http://www.carolinaliceremoval.com/IncredibleValue.aspx", "passage_text": "A typical appointment for one Head Lice Removal treatment costs between $102-$158, and for longer appointments with multiple people requiring treatment, the price averages out to LESS THAN $100 PER PERSON."}, {"url": "http://www.licesquad.com/resources/lice-removal-faq/", "passage_text": "Lice removal cost varies from provider to provider. We charge a modest fee of 75 dollars per hour for mobile and clinic services. If we come to you, a small S ervice Delivery Fee may apply of between $5 to $25. Consult your local franchise location's Lice Lady website page for more detailed info."}, {"url": "http://liceknowingyou.com/lice-cost-analysis.html", "passage_text": "1 $95.00 per person per hour, billed in 15 minute increments. 2  You do not pay for a full hour if we do not spend a full hour on your treatment. 3  Treatment time depends on length, thickness of hair and severity of infestation. 4  Average treatment time for boys is 30-45 minutes."}, {"url": "http://theliceplace.com/pricing.html", "passage_text": "When compared to other lice removal services, our one-time treatment and 30-day guarantee make The Lice Place the best option for treatment."}, {"url": "http://www.licesquad.com/resources/lice-removal-faq/", "passage_text": "Professional lice removal services take anywhere from 1 hour to 2 hours per person. Duration will depend on the severity of the infestation and the length and thickness of the hair. In some cases it may take longer."}, {"url": "http://liceknowingyou.com/lice-cost-analysis.html", "passage_text": "Head Lice Removal. 1  $95.00 per person per hour, billed in 15 minute increments. 2  You do not pay for a full hour if we do not spend a full hour on your treatment. 3  Treatment time depends on length, thickness of hair and severity of infestation."}]