[{"url": "http://amishamerica.com/wisconsin-amish/", "passage_text": "Wisconsin’s Amish population has increased at a much faster rate than most over this 20-year period, gaining 150% as opposed to an average of roughly 100% (see Young Center, 2010). Older small communities are found at Blair in Trempealeau County, Spencer in Marathon County, and Chetek in Barron County. Wisconsin is a state which saw Amish arrive relatively late compared to other states associated with the Plain People. Though the first Amish only began to settle in Wisconsin in the early 1900s, the Wisconsin Amish presence has grown to become the fourth-largest in North America."}, {"url": "http://www.travelwisconsin.com/blog/tours/getting-to-know-wisconsins-amish-country", "passage_text": "You’ll find some of the larger Amish communities in Wisconsin in: 1  Vernon County – Hillsboro. 2  Monroe County – near Wilton/Tomah. 3  Taylor County – Medford. 4  Green Lake County – Kingston-Dalton-Marquette, Redgranite, and Richford. Learn your way around Wisconsin Amish country with one of these tours: 1  Trempealeau County offers a car tour around Amish settlements, and audio guides to listen to as you pass Amish farms, sawmills, ferries, and a buggy shop."}, {"url": "http://amishamerica.com/wisconsin-amish/", "passage_text": "With a population of over 15,000, Wisconsin has fewer Amish than only Pennsylvania, Ohio, and Indiana. The Wisconsin Amish population is spread over nearly four dozen settlements across the state, and a total of 120 church districts (Young Center, 2010). Wisconsin is a state which saw Amish arrive relatively late compared to other states associated with the Plain People. Though the first Amish only began to settle in Wisconsin in the early 1900s, the Wisconsin Amish presence has grown to become the fourth-largest in North America."}, {"url": "http://people.howstuffworks.com/amish.htm", "passage_text": "These folks get around in horse-drawn buggies and use lanterns for light. The people to whom I refer are collectively known as the Amish.. That the Amish have been able to maintain an 18th century lifestyle in a 21st century world is amazing! In this article, we will explore how and why the Amish live as they do. You may have heard of the Amish from the film Witness starring Harrison Ford and Kelly McGillis. "}, {"url": "https://en.wikipedia.org/wiki/Amish", "passage_text": "The Amish are known for simple living, plain dress, and reluctance to adopt many conveniences of modern technology. The history of the Amish church began with a schism in Switzerland within a group of Swiss and Alsatian Anabaptists in 1693 led by Jakob Ammann. Those who followed Ammann became known as Amish. In the early 18th century, many Amish and Mennonites emigrated to Pennsylvania for a variety of reasons. Amish church groups seek to maintain a degree of separation from the non-Amish world, i.e. American and Canadian society. There is generally a heavy emphasis on church and family relationships. They typically operate their own one-room schools and discontinue formal education after grade eight, at age 13/14."}, {"url": "https://en.wikipedia.org/wiki/Amish", "passage_text": "As of 2000, over 165,000 Old Order Amish live in the United States and about 1,500 live in Canada. A 2008 study suggested their numbers have increased to 227,000, and in 2010 a study suggested their population had grown by 10 percent in the past two years to 249,000, with increasing movement to the West. Amish church groups seek to maintain a degree of separation from the non-Amish world, i.e. American and Canadian society. There is generally a heavy emphasis on church and family relationships. They typically operate their own one-room schools and discontinue formal education after grade eight, at age 13/14."}, {"url": "http://www.travelwisconsin.com/blog/tours/getting-to-know-wisconsins-amish-country", "passage_text": "The Amish live according to beliefs that go back to a sixteenth-century Protestant movement in Europe. While different communities have different rules, they all value humility, family, discipline, and hard work. Wisconsin has one of the largest Amish populations in America, with settlements all over the state. Learn your way around Wisconsin Amish country with one of these tours: 1  Trempealeau County offers a car tour around Amish settlements, and audio guides to listen to as you pass Amish farms, sawmills, ferries, and a buggy shop."}, {"url": "http://amishamerica.com/wisconsin-amish/", "passage_text": "Cashton is the largest Wisconsin Amish community. Founded in 1966, the settlement had grown to 13 churches as of 2009 (see Amish Settlements Across America: 2008, David Luthy, for dates of founding and some church district numbers). Wisconsin is a state which saw Amish arrive relatively late compared to other states associated with the Plain People. Though the first Amish only began to settle in Wisconsin in the early 1900s, the Wisconsin Amish presence has grown to become the fourth-largest in North America."}, {"url": "http://amishamerica.com/wisconsin-amish/", "passage_text": "Green Lake County is home to one of the largest Amish settlements in Wisconsin, near the communities of Kingston and Dalton. The Kingston/Dalton settlement was founded in 1977 and has grown to 9 congregations today. Wisconsin is a state which saw Amish arrive relatively late compared to other states associated with the Plain People. Though the first Amish only began to settle in Wisconsin in the early 1900s, the Wisconsin Amish presence has grown to become the fourth-largest in North America."}]