[{"url": "http://homewyse.com/services/cost_to_install_sod.html", "passage_text": "For a basic 1000 square feet project in zip code 47474, the cost to Install Sod averages $0.95 - $2.03 per square foot* - but costs in your area will vary. To estimate costs for your project: 1."}, {"url": "http://www.costowl.com/home-improvement/landscaping-sod-cost.html", "passage_text": "Sod Costs. 1  Expect to pay $0.15 to $1.00 per square foot (depending on grass variety) for sod that you pick up. 2  Delivered sod can cost an additional $100 to $300 or so per load. 3  DIY tool rental might run $200 to $300 (for a rototiller, sod cutter, lawn roller, sod tiller, fertilizer spreader, and tamper)."}, {"url": "http://www.wikihow.com/Lay-a-New-Lawn", "passage_text": "Remove old plants with a hoe or machine. If you have old grass or weeds, remove these before laying a new lawn. Use a grape hoe, also called a grub hoe, to remove grass from small lawns. For larger lawns, or to save time and effort, rent a sod cutter from a tool rental service."}, {"url": "http://www.landscapingnetwork.com/lawns/cost.html", "passage_text": "Cost of lawn installation and maintenance. Installation costs per square foot: 1  Hydroseed: $.50-1.00. 2  Sod: $3.50. 3  Artificial turf: $8-$12. 4  Backyard putting greens: $14."}, {"url": "http://www.costowl.com/home-improvement/landscaping-sod-cost.html", "passage_text": "1 Professional sod installation typically costs $500 to $1,000 for a 2,000 sq. ft. or smaller lawn. 2  Per square foot installation costs average $.50 to $1.00. 3  Installing sod on smaller lawns tends to cost more per square foot. 4  Installation charges usually cover delivery but may not cover prep work or tear out/haul away."}, {"url": "http://www.lets-do-diy.com/Projects-and-advice/Garden/Average-cost-to-lay-turf.aspx", "passage_text": "Summary: How much does it cost to lay turf, average turf installation costs and average price of turf. Laying a fresh, new lawn can turn a tired outside area into a perfect patch of green, whether it's replacing a worn-out or dead lawn or creating an entirely new feature. With careful preparation it can be an easy job."}]