[{"url": "http://exotic-aquariums.com/Brine_Shrimp.html", "passage_text": "Prepare your *saltwater and add it to the hatchery. Add in your brine shrimp eggs. The higher the grade of brine shrimp eggs the higher the hatch out rate. Grade A brine shrimp eggs have an 82% hatch out rate. This equates to approximately 225,000 baby brine shrimp per gram of encysts."}, {"url": "http://www.aquaticcommunity.com/fishfood/largebrineshrimp.php", "passage_text": "1 Add no more than a quarter of a teaspoon of brine shrimp eggs to the dark side. 2  Make sure that the airstone is potent enough to prevent the eggs from settling on the bottom. 3  Cover the tank and leave the eggs in complete darkness for 36 hours before you check for shrimp. Raising and Growing Large Brine Shrimp. Brine shrimp is a popular fry food, but if you allow the brine shrimp to grow a bit bigger it will actually serve as a great food source for a lot of adult fish."}, {"url": "http://exotic-aquariums.com/Brine_Shrimp.html", "passage_text": "A Note on Nutritional Value: Nauplii (newly hatched brine shrimp) have a high fatty acid content (approx. 23% by body weight). This makes them an excellent food source for fish fry. Adult brine shrimp only contain about 7% fat content. Add in your brine shrimp eggs. The higher the grade of brine shrimp eggs the higher the hatch out rate. Grade A brine shrimp eggs have an 82% hatch out rate. This equates to approximately 225,000 baby brine shrimp per gram of encysts."}, {"url": "http://www.aquaticcommunity.com/fishfood/largebrineshrimp.php", "passage_text": "Fish food – an introduction-A comprehensive discussion of fish foods. Growing adult Brine shrimp-how to grow adult Brine shrimp. Microworms-Microworms are easy to cultivate and are excellent live food for small fish or growing fry. Raising Daphnia-How to culture and use daphnia. Raising and Growing Large Brine Shrimp. Brine shrimp is a popular fry food, but if you allow the brine shrimp to grow a bit bigger it will actually serve as a great food source for a lot of adult fish."}, {"url": "https://en.wikipedia.org/wiki/Artemia", "passage_text": "The ability of the Artemia to produce dormant eggs, known as cysts, has led to extensive use of Artemia in aquaculture. The cysts may be stored for long periods and hatched on demand to provide a convenient form of live feed for larval fish and crustaceans. Nauplii of the brine shrimp Artemia constitute the most widely used food item, and over 2000 tonnes of dry Artemia cysts are marketed worldwide annually. "}, {"url": "http://livebrineshrimp.com/Index.htm", "passage_text": "Frozen Brine Shrimp aren't as good for your aquarium animals as live food but in some cases the convenience of frozen food wins out, particularly if the fish has accepted the transition. Northeast Brine Shrimp Frozen Brine Shrimp are whole Brine Shrimp whether they be the Adult Size, Half-grown, or Quarter-grown. Artemia Food (Special Blend) For feeding live brine shrimp and can be used for any plankton feeding organism. Use One teaspoon per 20 gallons per day or as needed."}, {"url": "http://www.wikihow.com/Raise-Brine-Shrimp", "passage_text": "Brine shrimp are a nutritious and easy to raise feed tropical and marine life. Although there are plenty of artificial dietary options, brine shrimp provide important lipids, vitamins, and amino acids many fish need. Feed the brine shrimp yeast, pureed greens, powered eggs, or powered milk. Brine shrimp are not picky, and they will eat these human foods. Spirulina is another option to feed the brine shrimp."}, {"url": "http://www.aquaticcommunity.com/fishfood/growingadultbrineshrimp.php", "passage_text": "There are brine shrimp food available in pet stores that contains micro algae for the nauplii to eat however there are quite a few cheaper alternative that you can by in your regular grocery store. Examples on this are Yeast, wheat flour, soybean powder, egg yolk. Growing Adult Brine Shrimp. Brine shrimps or artemia is a zooplankton used as fry food although Brine shrimps can be grown to about 20 mm (0.8 inch) in length and be a valuable food source for adult fishes."}, {"url": "http://livebrineshrimp.com/Index.htm", "passage_text": "The new Brine Shrimp Grow Kit is an affordable way for all aquarium hobbyists to now try their green thumb at growing live brine shrimp. The kit is complete with salt mix, food, and brine shrimp eggs. All you need is a 5 gallon aquarium, air stone, and a small air pump. All directions are included in the kit. Artemia Food (Special Blend) For feeding live brine shrimp and can be used for any plankton feeding organism. Use One teaspoon per 20 gallons per day or as needed."}]