[{"url": "http://biotechlearn.org.nz/themes/bacteria_in_biotech/proteins_what_they_are_and_how_they_re_made", "passage_text": "Proteins are expressed from genes. All organisms make proteins in essentially the same way. The process starts with a gene – the ‘instruction manual’ for constructing the protein. For this reason, the process of making a protein is also called gene expression. Gene expression has two main stages: transcription and translation."}, {"url": "http://ghr.nlm.nih.gov/handbook/howgeneswork/makingprotein", "passage_text": "Most genes contain the information needed to make functional molecules called proteins. (A few genes produce other molecules that help the cell assemble proteins.) The journey from gene to protein is complex and tightly controlled within each cell. It consists of two major steps: transcription and translation. Together, transcription and translation are known as gene expression. During the process of transcription, the information stored in a gene’s DNA is transferred to a similar molecule called RNA (ribonucleic acid) in the cell nucleus. Both RNA and DNA are made up of a chain of nucleotide bases, but they have slightly different chemical properties."}, {"url": "http://www.ninds.nih.gov/disorders/brain_basics/genes_at_work.htm", "passage_text": "This process is called gene expression. When genes are inactive, they are silent or inaccessible for protein production. At least a third of the approximately 20,000 different genes that make up the human genome are active (expressed) primarily in the brain. Genes that make proteins are called protein-coding genes. In order to make a protein, a molecule closely related to DNA called ribonucleic acid (RNA) first copies the code within DNA. Then, protein-manufacturing machinery within the cell scans the RNA, reading the nucleotides in groups of three."}, {"url": "http://www2.le.ac.uk/departments/genetics/vgec/schoolscolleges/topics/geneexpression-regulation", "passage_text": "Gene expression. Gene expression is the process by which the genetic code-the nucleotide sequence-of a gene is used to direct protein synthesis and produce the structures of the cell. Genes that code for amino acid sequences are known as 'structural genes'. The process of gene expression involves two main stages: Transcription: the production of messenger RNA (mRNA) by the enzyme RNA polymerase, and the processing of the resulting mRNA molecule. "}, {"url": "http://users.rcn.com/jkimball.ma.ultranet/BiologyPages/T/Transcription.html", "passage_text": "1 transcription of the information encoded in DNA into a molecule of RNA (described here) and. 2  translation of the information encoded in the nucleotides of mRNA into a defined sequence of amino acids in a protein (discussed in. 3  Gene Translation: RNA → Protein). "}, {"url": "https://en.wikipedia.org/wiki/Gene_expression", "passage_text": "The process of gene expression is used by all known life-eukaryotes (including multicellular organisms), prokaryotes (bacteria and archaea), and utilized by viruses-to generate the macromolecular machinery for life. In eukaryotes, transcription is performed by three types of RNA polymerases, each of which needs a special DNA sequence called the promoter and a set of DNA-binding proteins -- transcription factors —to initiate the process. RNA polymerase I is responsible for transcription of ribosomal RNA (rRNA) genes."}, {"url": "https://en.wikipedia.org/wiki/Gene_expression", "passage_text": "Gene expression is the process by which information from a gene is used in the synthesis of a functional gene product. These products are often proteins, but in non-protein coding genes such as transfer RNA (tRNA) or small nuclear RNA (snRNA) genes, the product is a functional RNA. In eukaryotes, transcription is performed by three types of RNA polymerases, each of which needs a special DNA sequence called the promoter and a set of DNA-binding proteins -- transcription factors —to initiate the process. RNA polymerase I is responsible for transcription of ribosomal RNA (rRNA) genes."}, {"url": "http://biotechlearn.org.nz/themes/bacteria_in_biotech/proteins_what_they_are_and_how_they_re_made", "passage_text": "Promoters are the sequences of DNA that determine when a gene is expressed. These sections of DNA sit in front of genes and provide a ‘landing site’ for transcription factors (proteins that switch gene expression on and off) and RNA polymerase (the protein that reads DNA and makes an mRNA copy). All organisms make proteins in essentially the same way. The process starts with a gene – the ‘instruction manual’ for constructing the protein. For this reason, the process of making a protein is also called gene expression. Gene expression has two main stages: transcription and translation."}, {"url": "http://www.nature.com/scitable/topicpage/gene-expression-14121669", "passage_text": "Given this statistic, it is not surprising that the primary control point for gene expression is usually at the very beginning of the protein production process — the initiation of transcription. RNA transcription makes an efficient control point because many proteins can be made from a single mRNA molecule. Genes encode proteins and proteins dictate cell function. Therefore, the thousands of genes expressed in a particular cell determine what that cell can do."}]