[{"url": "http://learn.org/articles/What_are_the_Education_Requirements_to_Be_a_Veterinarian.html", "passage_text": "To become a veterinarian, you need to earn a Doctor of Veterinary Medicine degree and obtain a professional license in your state. Keep reading to learn more. Schools offering Animal Care degrees can also be found in these popular choices. To become a veterinarian, you'll need to complete several years of education and training. You'll need to earn a Doctor of Veterinary Medicine (DVM) degree and obtain a license. Many DVM graduates also choose to continue their training through internships and residency program"}, {"url": "http://study.com/requirements_to_become_a_veterinarian.html", "passage_text": "The first step to becoming a veterinarian in the U.S. is attending undergraduate school. According to the U.S. Bureau of Labor Statistics (BLS), some veterinary colleges require applicants to hold only 45-90 undergraduate hours; however, most students enter veterinary school with bachelor's degrees (www.bls.gov). Doctor of Veterinary Medicine Degree. After gaining admittance, students complete four years of veterinary school to earn a Doctor of Veterinary Medicine (D.V.M.). The first two years of veterinary school typically focus on basic science education in the classroom and laboratory."}, {"url": "http://study.com/veterinarian_education.html", "passage_text": "Veterinarians require a significant amount of formal education. Learn more about what veterinarians study in their degree programs, and get information about job duties and licensure requirements to see if this is the career for you. Veterinarian Education Requirements and Career Info. Veterinarians require a significant amount of formal education. Learn more about what veterinarians study in their degree programs, and get information about job duties and licensure requirements to see if this is the career for you. View 10 Popular Schools »."}, {"url": "http://work.chron.com/degrees-requirements-need-veterinarian-3700.html", "passage_text": "Veterinarians are trained to examine and treat small and large animals, including small household pets and large zoo animals. If you want to become a vet, you need to be committed to your career to meet academic and training requirements. It can take up to eight years to complete degrees required to get hired into veterinary jobs. Would-be veterinarians must hold a bachelor's degree at a four-year college before moving on to veterinary medicine school."}, {"url": "http://vbs.psu.edu/majors/vbs/steps-to-becoming-a-veterinarian", "passage_text": "1 One is required from an academic adviser; one is required from a veterinarian; and the third one can be from an individual of your choice (typically one of your course instructors). 2  It is important to get to know your academic adviser and/or professors during your college education. Admission requirements for veterinary schools have many things in common; however the specific requirements may vary among schools. It is therefore advisable to become familiar with the entrance requirements (PDF) early in your career as this may affect course selection especially after your first year of college."}, {"url": "http://study.com/veterinarian_education.html", "passage_text": "Veterinarian Education Requirements. Veterinarians are required to complete a four-year Doctor of Veterinary Medicine (DVM) program in addition to undergraduate school. These professionals are also required to obtain licensure to practice in the profession. Veterinarian Education Requirements and Career Info. Veterinarians require a significant amount of formal education. Learn more about what veterinarians study in their degree programs, and get information about job duties and licensure requirements to see if this is the career for you. View 10 Popular Schools »."}, {"url": "https://en.wikipedia.org/wiki/Veterinary_education", "passage_text": "Veterinary education is the tertiary education of veterinarians. To become a veterinarian one must first complete a veterinary degree (i.e.: DVM, VMD, BVS, BVSc, BVMS, BVM, cand.med.vet, etc.). "}, {"url": "http://learn.org/articles/Equine_Veterinarian_Career_Summary_Job_Outlook_and_Education_Requirements.html", "passage_text": "To become an equine veterinarian, you must obtain a Doctor of Veterinary Medicine (DVM) degree from a college or university accredited by the American Veterinary Medical Association (AVMA). A DVM program takes four years to complete. "}, {"url": "http://learn.org/articles/What_are_the_Education_Requirements_to_Be_a_Veterinarian.html", "passage_text": "Required Education. To become a veterinarian, you'll need to complete several years of education and training. You'll need to earn a Doctor of Veterinary Medicine (DVM) degree and obtain a license. Many DVM graduates also choose to continue their training through internships and residency programs"}]