[{"url": "http://www.webmd.com/vitamins-supplements/ingredientmono-555-MACA.aspx?activeIngredientId=555&activeIngredientName=MACA", "passage_text": "Maca is also used for weak bones (osteoporosis), depression, stomach cancer, leukemia, HIV /AIDS, tuberculosis, erectile dysfunction (ED), to arouse sexual desire, and to boost the immune system. In foods, maca is eaten baked or roasted, prepared as a soup, and used for making a fermented drink called maca chicha. Maca is POSSIBLY SAFE when taken in larger amounts as medicine (up to 3 grams daily) for up to four months. Maca seems to be well tolerated by most people. Pregnancy and breast-feeding: Not enough is known about the use of maca during pregnancy and breast-feeding. Stay on the safe side and avoid use."}, {"url": "http://www.youngandraw.com/what-is-maca-root/", "passage_text": "How To Use Maca. Traditionally, Maca has also been used to treat PMS and menopause. It’s rumored to really cut down on all those hot flashes and nighttime sweats. It’s been used recently as a natural alternative to anabolic steroids for athletes who are trying to achieve muscle hypertrophy. Who Should Not Use Maca. Maca root can be quite energy enhancing for some people so take it first thing in the morning or in the early afternoon. Don’t over do the dosage (a teaspoon/5 grams is a good place to start), take it slow and gradually increase as you go."}, {"url": "http://answers.webmd.com/answers/1186091/what-is-maca", "passage_text": "A. Maca is a plant that grows in central Peru in the high plateaus of the Andes mountains. It has been cultivated as a vegetable crop in Peru for at least 3000 years. Maca is a relative of the radish and has an odor similar to butterscotch. Its root is used to make medicine. Maca is used for “tired blood” (anemia); chronic fatigue syndrome (CFS); and enhancing energy, stamina, athletic performance, memory, and fertility. Women use maca for female hormone imbalance, menstrual problems, and symptoms of menopause. Maca is also used for weak bones (osteoporosis), depression, stomach cancer, leukemia, HIV / AIDS, tuberculosis, erectile dysfunction (ED), to arouse sexual desire, and to boost the immune system"}, {"url": "http://www.youngandraw.com/what-is-maca-root/", "passage_text": "Maca root has the capability to regulate, support, and balance the hormonal systems of both men and women. Hello promising anti-acne herb! And since it’s boosting the hormones, it may also help with fertility, digestion, energy levels, and all things sexual. Who Should Not Use Maca. Maca root can be quite energy enhancing for some people so take it first thing in the morning or in the early afternoon. Don’t over do the dosage (a teaspoon/5 grams is a good place to start), take it slow and gradually increase as you go."}, {"url": "http://macapowderbenefits.net/maca-root-what-is-maca-used-for/", "passage_text": "Maca root can be utilized for a lot of purposes. Maca is mainly used to enhance basic well being, improve libido and it also beats stress and eases tension. Because it has numerous vitamins, compounds and vitamins, Maca powder is used for almost everything. Maca has unique alkaloids that enhance total endocrine system. Maca root powder. This is mainly natural flour made from floor and dried maca root. The powder may be blended with water. Maca root powder can be used for cooking. It may be blended with porridge sort breakfast cereals, brought to cookie batter; and sprinkled into smoothies and milk shakes."}, {"url": "http://macapowderbenefits.net/maca-root-what-is-maca-used-for/", "passage_text": "Maca Is Used For Making improvements to Sexual Function. There is no doubt that maca root has an effect on both female and male libido. This could be as a result of it’s effect on bettering the frame’s herbal energy. For no matter what reason why it’s being touted as a herbal remedy for male impotence. Maca root powder. This is mainly natural flour made from floor and dried maca root. The powder may be blended with water. Maca root powder can be used for cooking. It may be blended with porridge sort breakfast cereals, brought to cookie batter; and sprinkled into smoothies and milk shakes."}, {"url": "http://macapowderbenefits.net/maca-root-what-is-maca-used-for/", "passage_text": "Maca Is Used For Treatment For Menopause. Indian ladies in Peru have used Maca root for years to regard the indicators of menopause. Maca root does now not substitute hormones lost to menopause. Research has shown that maca acts on the hypothalamus-pituitary gland. Maca root powder. This is mainly natural flour made from floor and dried maca root. The powder may be blended with water. Maca root powder can be used for cooking. It may be blended with porridge sort breakfast cereals, brought to cookie batter; and sprinkled into smoothies and milk shakes."}, {"url": "http://www.youngandraw.com/what-is-maca-root/", "passage_text": "Both men and women have used it to increase their libido, fertility, and stamina. Rawr! You can expect to hear more about Maca root in the coming years as Maca root is becoming more popular in the skin care and toiletry industry. Who Should Not Use Maca. Maca root can be quite energy enhancing for some people so take it first thing in the morning or in the early afternoon. Don’t over do the dosage (a teaspoon/5 grams is a good place to start), take it slow and gradually increase as you go."}, {"url": "http://www.webmd.com/vitamins-supplements/ingredientmono-555-MACA.aspx?activeIngredientId=555&activeIngredientName=MACA", "passage_text": "Maca is a plant that grows in central Peru in the high plateaus of the Andes mountains. It has been cultivated as a vegetable crop in Peru for at least 3000 years. Maca is a relative of the radish and has an odor similar to butterscotch. Its root is used to make medicine. Maca is used for “tired blood ” (anemia); chronic fatigue syndrome (CFS); and enhancing energy, stamina, athletic performance, memory, and fertility. Women use maca for female hormone imbalance, menstrual problems, and symptoms of menopause. Maca is POSSIBLY SAFE when taken in larger amounts as medicine (up to 3 grams daily) for up to four months. Maca seems to be well tolerated by most people. Pregnancy and breast-feeding: Not enough is known about the use of maca during pregnancy and breast-feeding. Stay on the safe side and avoid use."}]