[{"url": "https://uk.answers.yahoo.com/question/index?qid=20111207191414AAwZ4PW", "passage_text": "Contrasted to eukaryotes with a nucleus, prokaryotes have a nucleoid where the genetic material can be found. The nucleoid is different from the nucleus of the eukaryotes in a way that the genetic material is not enclosed in a membrane to separate it from the cytoplasm. The nucleoid is a region of cytoplasm where the chromosomal DNA is located. It is not a membrane bound nucleus, but simply an area of the cytoplasm where the strands of DNA are found. Most bacteria have a single, circular chromosome that is responsible for replication, although a few species do have two or more"}, {"url": "http://faculty.ccbcmd.edu/~gkaiser/SoftChalk%20BIOL%20230/Prokaryotic%20Cell%20Anatomy/nucleoid/nucleoid/nucleoid4.html", "passage_text": "C. Functions of the Bacterial Chromosome. The chromosome is the genetic material of the bacterium. Genes located along the DNA are transcribed into RNA molecules, primarily messenger RNA (mRNA) , transfer RNA (tRNA), and ribosomal RNA (rRNA) . Messenger RNA is then translated into protein at the ribosomes. "}, {"url": "http://study.com/academy/lesson/nucleoid-definition-function-structure.html", "passage_text": "The nucleoid is the region in the prokaryotic cell that contains the main DNA material. As a side note, some DNA will be in other sections of the cell, but the primary material will be in the nucleoid. The nucleoid has an irregular shape compared to the nucleus of eukaryotic cells, which is circular. Lesson Summary. The nucleoid region is the irregularly-shaped section of a prokaryotic cell where DNA is housed. It lacks the membrane that is found around the nucleus of eukaryotic cells. In addition to DNA, the nucleoid may also contain RNA, proteins, and enzymes that can be used for cellular processes."}, {"url": "http://study.com/academy/lesson/nucleoid-definition-function-structure.html", "passage_text": "The nucleoid is the region of a prokaryotic cell that houses the primary DNA. This lesson briefly discusses the nucleoid and its characteristics, and how it compares to the nucleus of the eukaryotic cell. Lesson Summary. The nucleoid region is the irregularly-shaped section of a prokaryotic cell where DNA is housed. It lacks the membrane that is found around the nucleus of eukaryotic cells. In addition to DNA, the nucleoid may also contain RNA, proteins, and enzymes that can be used for cellular processes."}, {"url": "http://www.answers.com/Q/Function_of_nucleoid_in_bacteria_cell", "passage_text": "Making the world better, one answer at a time. The nucleoid is a region of cytoplasm where the chromosomal DNA is located. It is not a membrane bound nucleus, but simply an area of the cytoplasm where the strands of DNA are found. Most bacteria have a single, circular chromosome that is responsible for replication, although a few species do have two or more. The function of a nucleoid is it contains genetic material and the DNA determines what proteins and enzymes an organism can synthesise."}, {"url": "https://en.wikipedia.org/wiki/Nucleoid", "passage_text": "Prokaryote cell (right) showing the nucleoid in comparison to a eukaryotic cell (left) showing the nucleus. The nucleoid (meaning nucleus-like) is an irregularly-shaped region within the cell of a prokaryote that contains all or most of the genetic material, called genophore. The nucleoid can be clearly visualized on an electron micrograph at high magnification, where, although its appearance may differ, it is clearly visible against the cytosol. Sometimes even strands of what is thought to be DNA are visible."}, {"url": "http://www.answers.com/Q/What_is_the_function_of_the_nucleoid_in_bacteria", "passage_text": "The nucleoid is a region of cytoplasm where the chromosomal DNA is located. It is not a membrane bound nucleus, but simply an area of the cytoplasm where the strands of DNA ar … e found. Most bacteria have a single, circular chromosome that is responsible for replication, although a few species do have two or more. The function of a nucleoid is it contains genetic material and the DNA determines what proteins and enzymes an organism can synthesise. This will then enable a chemical reacti … on to take place. 3 people found this useful."}, {"url": "http://micro.magnet.fsu.edu/cells/bacteriacell.html", "passage_text": "In gram-negative bacteria, the cell wall is thin and releases the dye readily when washed with an alcohol or acetone solution. Cytoplasm-The cytoplasm, or protoplasm, of bacterial cells is where the functions for cell growth, metabolism, and replication are carried out. It is a gel-like matrix composed of water, enzymes, nutrients, wastes, and gases and contains cell structures such as ribosomes, a chromosome, and plasmids. Unlike the eukaryotic (true) cells, bacteria do not have a membrane enclosed nucleus. The chromosome, a single, continuous strand of DNA, is localized, but not contained, in a region of the cell called the nucleoid."}, {"url": "http://faculty.ccbcmd.edu/courses/bio141/lecguide/unit1/prostruct/nucleoid.html", "passage_text": "1. The genome is the sum of an organism’s genetic material. 2. Bacteria contan a single chromosome of double-stranded deoxyribonucleic acid (DNA). 3. The region of the bacterial cytoplasm where the chromosome is located and visible when viewed with an electron microscope called the nucleoid. 4. Tha bacterial chromosome is typically a physical and genetic circle, becomes supercoiled,and is not surrounded by a nuclear membrane. 5"}]