[{"url": "http://www.thedermreview.com/dimethicone/", "passage_text": "Dimethicone is an emulsifier (which means it helps keep other ingredients from separating) and a moisturizer that makes it a highly effective additive to skin and hair care products. The chemical is also used as an emollient to make the surface of the skin more flexible and help the skin retain moisture."}, {"url": "http://science-yhairblog.blogspot.com/2014/04/silicone-ingredient-solubility-list.html", "passage_text": "Note: If the silicone ingredient has a PEG or PPG or both in front of the silicone, it is probably water-soluble. Watch out for commas. PEG-8 Dimethicone is a water-soluble silicone. PEG-8, Dimethicone indicates either 1) a typo or 2) 2 individual ingredients, separated by a comma."}, {"url": "http://science-yhairblog.blogspot.com/2014/04/silicone-ingredient-solubility-list.html", "passage_text": "In a shampoo, regardless of the detergents, silicone ingredients like dimethicone will deposit on the hair. They will not be removed completely until one uses a silicone-free shampoo. If this doesn't make your hair heavy or limp immediately or over time, it's not a problem. Your hair will show you what is right for it."}, {"url": "http://www.cosmeticsinfo.org/ingredient/dimethicone", "passage_text": "Dimethicone, also known as polydimethylsiloxane, is a silicon-based polymer that is a man-made synthetic molecule made up of repeating units called monomers. Silicon is the second most abundant element in the Earth's crust after oxygen, and silicon dioxide is also known as sand, commonly found on beaches and shores."}, {"url": "http://www.thedermreview.com/dimethicone/", "passage_text": "Dimethicone is also used in a number of skin care products, such as those that moisturize the skin, treat dry flaky skin on face, and in those that care for mild skin irritations, such as eczema, diaper rashes, and other types of dermatitis."}, {"url": "https://www.truthinaging.com/ingredients/dimethicone", "passage_text": "Functions of Dimethicone: One of the most widely used ingredients in cosmetics, dimethicone works as an anti-foaming agent, skin protectant and skin & hair conditioner-it prevents water loss by forming a hydrating barrier on the skin."}, {"url": "http://www.annmariegianni.com/ingredient-watch-list-dimethicone-the-smoothing-silicone-that-exacerbates-acne/", "passage_text": "In hair care products, dimethicone is used to provide smoothness, particularly in conditioners and detanglers, where the ingredient helps smooth hair and provide better comb-through. Because dimethicone leaves a sort of covering on the hair strands, it can also make hair appear shinier."}, {"url": "http://www.thedermreview.com/dimethicone/", "passage_text": "Dimethicone: Product Uses and Side Effects. Dimethicone, which is a silicone oil, is also known as polydimethylsiloxane (PDMS) and is used in a number of health and beauty products."}]