[{"url": "http://www.wikihow.com/Cook-Tilapia-in-the-Oven", "passage_text": "5. Broil the tilapia fillets for 4 to 6 minutes, flipping once. Place the pan on the top rack of the oven, no further than 4 inches (10 cm) from the top heating element. At the 2 or 3 minute mark, flip the fillets and continue broiling. 1  Use a fish spatula or other flat, heat-resistant spatula to turn the fish."}, {"url": "http://allrecipes.com/recipe/89261/lemon-garlic-tilapia/", "passage_text": "1 Place fillets in baking dish. 2  Pour lemon juice over fillets, then drizzle butter on top. 3  Sprinkle with garlic, parsley, and pepper. 4  Bake in preheated oven until the fish is white and flakes when pulled apart with a fork, about 30 minutes."}, {"url": "http://www.livestrong.com/article/434680-how-to-bake-tilapia-in-oven/", "passage_text": "Step 5. Set your oven to 325 degrees F, preheat and then bake the tilapia fillets, uncovered, for about 10 minutes. When your fish is ready, it will flake easily with a fork. TIPS: For additional flavor, slice a fresh lemon into wedges and serve with your baked tilapia."}, {"url": "http://allrecipes.com/recipe/89261/lemon-garlic-tilapia/", "passage_text": "1 Pour lemon juice over fillets, then drizzle butter on top. 2  Sprinkle with garlic, parsley, and pepper. 3  Bake in preheated oven until the fish is white and flakes when pulled apart with a fork, about 30 minutes."}, {"url": "http://allrecipes.com/recipe/70163/easy-baked-tilapia/", "passage_text": "Cook. Ready In. 1  Preheat the oven to 375 degrees F (190 degrees F). 2  Grease a 9x13 inch baking dish. 3  Place the tilapia fillets in the bottom of the baking dish and dot with butter. 4  Season with Old Bay seasoning and garlic salt. 5  Top each one with a slice or two of lemon."}, {"url": "http://www.livestrong.com/article/434680-how-to-bake-tilapia-in-oven/", "passage_text": "Set your oven to 325 degrees F, preheat and then bake the tilapia fillets, uncovered, for about 10 minutes. When your fish is ready, it will flake easily with a fork."}, {"url": "http://southernfood.about.com/od/tilapiarecipes/r/bl40121z.htm", "passage_text": "Brush a little of the butter mixture in the bottom of a shallow baking dish (line baking dish with foil, if desired) then place tilapia fillets on the buttered area. Brush top of each tilapia fillet with the seasoned butter mixture. Bake at 350° for 12 to 15 minutes, until tilapia flakes easily with a fork."}]