[{"url": "https://en.wikipedia.org/wiki/Flower", "passage_text": "A flower, sometimes known as a bloom or blossom, is the reproductive structure found in flowering plants (plants of the division Magnoliophyta, also called angiosperms). The biological function of a flower is to effect reproduction, usually by providing a mechanism for the union of sperm with eggs. Flowers may facilitate outcrossing (fusion of sperm and eggs from different individuals in a population) or allow selfing (fusion of sperm and egg from the same flower)."}, {"url": "http://www.sunset.com/garden/flowers-plants/spring-blooms", "passage_text": "Star-shaped reddish purple flowers appear in large dramatic clusters in early spring. The scent is spicy sweet—the essence of spring. The deciduous shrub reaches 6 to 8 feet tall and 5 to 6 feet wide; it takes full sun, or light shade in the hottest climates. Most lilacs bloom best in regions with winter chill (Sunset climate zones A1–A3; 1–11, 14–16)."}, {"url": "http://www.macmillandictionary.com/dictionary/british/fragrant", "passage_text": "This is the British English definition of fragrant. View American English definition of fragrant. Change your default dictionary to American English. View the pronunciation for fragrant. 90% of the time, speakers of English use just 7,500 words in speech and writing. These words appear in red, and are graded with stars. One-star words are frequent, two-star words are more frequent, and three-star words are the most frequent."}, {"url": "http://www.merriam-webster.com/dictionary/fragrance", "passage_text": "Full Definition of FRAGRANCE. 1. a: a sweet or delicate odor (as of fresh flowers, pine trees, or perfume) b: something (as a perfume) compounded to give off a sweet or pleasant odor. 2. : the quality or state of having a sweet odor. See fragrance defined for English-language learners. See fragrance defined for kids. Synonym Discussion of FRAGRANCE. fragrance, perfume, scent, redolence mean a sweet or pleasant odor. fragrance suggests the odors of flowers or other growing things."}, {"url": "http://www.thefreedictionary.com/fragrant", "passage_text": "fragrant. adjective aromatic, perfumed, balmy, redolent, sweet-smelling, sweet-scented, odorous, ambrosial, odoriferous fragrant oils and perfumes. smelling, stinking, smelly, reeking, fetid, foul-smelling, malodorous, noisome, pongy (Brit. informal), niffy (Brit. slang), olid. adjective. Most of his poems, other than certain political satire, which drew on him the Emperor's wrath, are full of subtle sadness and fragrant regret, reminding one of pot-pourri in some deep blue porcelain bowl."}, {"url": "http://www.ldoceonline.com/dictionary/fragrant", "passage_text": "fragrant flowers. —fragrantly adverb. Definition from the Longman Dictionary of Contemporary English. Advanced Learner's Dictionary. Dictionary results for fragrant."}, {"url": "http://www.learnersdictionary.com/definition/fragrant", "passage_text": "Save. fragrant /ˈfreɪgrənt/ adjective. fragrant. /ˈfreɪgrənt/. adjective. Learner's definition of FRAGRANT. [more fragrant; most fragrant]. : having a pleasant and usually sweet smell. a fragrant flower. The soup was fragrant with herbs and spices. "}, {"url": "https://en.wikipedia.org/wiki/Ylang-ylang", "passage_text": "The tree is also called the fragrant cananga, Macassar-oil plant, or perfume tree. The ylang-ylang vine (Artabotrys odoratissimus) and climbing ylang-ylang (Artabotrys hexapetalus) are woody, evergreen climbing plants in the same family. Artabotrys odoratissimus is also a source of perfume. Cananga odorata is a fast-growing tree of the custard apple family Annonaceae. Its growth exceeds 5 m (15 ft) per year and attains an average height of 12 m (40 ft) in an ideal climate. The evergreen leaves are smooth and glossy, oval, pointed and with wavy margins, and 13–20 cm (5–8 in) long."}, {"url": "http://www.merriam-webster.com/dictionary/fragrant", "passage_text": "Full Definition of FRAGRANT. : having a sweet or pleasant smell. — fra·grant·ly adverb. See fragrant defined for English-language learners. See fragrant defined for kids. "}]