[{"url": "http://www.afamilyfeast.com/greek-salad-with-meat/", "passage_text": "1 To prepare the salad, 2  In a large bowl toss lettuce, cucumber, celery and red onion. 3  Add ¼ cup of the Greek Salad Dressing and toss. 4  Lay tomato wedges across the top and sides of dressed lettuce. 5  Add olives and pepperoncini. 6  Sprinkle feta across top and place cut meat in center. Instructions. 1 "}, {"url": "http://www.doitineurope.com/recipes/cookbook/greek-salad.htm", "passage_text": "How to make a traditional Greek salad. The most traditional Greek salad recipe, and the kind of Greek salad you will usually encounter in Greece, does not typically include lettuce, but is more a bowl of raw chunky vegetables with a little olive oil and lemon juice."}, {"url": "http://www.greek-salad-recipes.com/greek-salad-with-lettuce/", "passage_text": "Making the Greek Salad with lettuce. The recipe for the Greek Salad with lettuce is ideal for a novice; the steps are easy, and similar to the typical horiatiki salad. Use Roma, tomato, or grape tomatoes and long cucumber. Wash the tomatoes and cucumbers and let them dry. Cut and slice them along with onions and cucumbers, and place them in a large bowl. Greek salad with lettuce is one of the variations of the typical Greek salad, the Horiatiki salad. The recipe is easy to make and can save you any time you need a fresh and delicious salad for your lunch or dinner. The Greek salad is one of the most popular and very healthy salads you can have all year long."}, {"url": "http://www.foodnetwork.com/recipes/food-network-kitchens/greek-salad-recipe.html", "passage_text": "Directions. In a small bowl, whisk together the lemon juice, garlic, salt, and oil. Stir in the oregano and pepper to taste. Set aside. When ready to serve: In a large bowl lightly toss the lettuce with some of the dressing. Divide the lettuce among 4 salad bowls. Scatter the olives, cheese, cucumber, tomatoes, onion, and peppers over the top of the greens. Serve and pass the remaining dressing at the tabl"}, {"url": "http://www.chowhound.com/food-news/55152/the-basics-how-to-make-a-greek-salad/", "passage_text": "A good Greek salad is worth its weight in feta. Start with the freshest ingredients you can find and a large bowl. • Wash a head of romaine lettuce and tear into small, bite-sized pieces. (You can use a knife to chop it up as well if you want the pieces to be more uniform.). "}, {"url": "http://www.afamilyfeast.com/greek-salad-with-meat/", "passage_text": "1 In a large bowl toss lettuce, cucumber, celery and red onion. 2  Add ¼ cup of the Greek Salad Dressing and toss. 3  Lay tomato wedges across the top and sides of dressed lettuce. 4  Add olives and pepperoncini. 5  Sprinkle feta across top and place cut meat in center. Instructions. 1  To prepare the salad, 2  In a large bowl toss lettuce, cucumber, celery and red onion. 3  Add ¼ cup of the Greek Salad Dressing and toss. 4  Lay tomato wedges across the top and sides of dressed lettuce. 5  Add olives and pepperoncini. 6"}, {"url": "http://littletechgirl.com/2009/02/06/a-pet-peeve-of-mine-greek-salad-what-kind-of-dressing-would-you-like/", "passage_text": "1 large head Romaine Lettuce 1/2 half red onion, sliced 1 English Cucumber, sliced 1 cup Kalamata olives 1 cup Greek Feta, crumbled Dressing: 1/2 cup olive oil 3 tbsp red wine vinegar 1 tbsp fresh lemon juice 1 tsp dried oregano 1/2 tsp salt freshly ground pepper 1. Place lettuce in a large bowl. 2. "}, {"url": "https://en.wikipedia.org/wiki/Greek_salad", "passage_text": "Lettuce, tomatoes, feta, and olives are the most standard elements in an American-style Greek salad, but cucumbers, peperoncini (pickled hot peppers), bell peppers, onions, radishes, dolmades, and anchovies/ sardines are common. Common additions include green bell pepper slices or berries of capers (especially in the Dodecanese islands). The term Greek salad can also be used in North America, Australia, South Africa, and the United Kingdom to refer to a lettuce salad with Greek-inspired ingredients, dressed with oil and vinegar."}, {"url": "https://en.wikipedia.org/wiki/Greek_salad", "passage_text": "Greek salad is made with pieces of tomatoes, sliced cucumbers, onion, feta cheese, and olives (usually Kalamata olives), typically seasoned with salt and oregano, and dressed with olive oil. Common additions include green bell pepper slices or berries of capers (especially in the Dodecanese islands). The term Greek salad can also be used in North America, Australia, South Africa, and the United Kingdom to refer to a lettuce salad with Greek-inspired ingredients, dressed with oil and vinegar."}]