[{"url": "http://encyclopedia2.thefreedictionary.com/Subsurface+drainage", "passage_text": "in agriculture, the removal of excess water from the soil, either by a system of surface ditches, or by underground conduits if required by soil conditions and land contour. Diesel or centrifugal pumps are sometimes used to drain large areas. Drainage was practiced in the Nile basin c.400 B.C. and in ancient Rome."}, {"url": "http://www.wisegeek.com/what-is-surface-drainage.htm", "passage_text": "In areas of heavy rainfall or low soil percolation, it is necessary to employ surface drainage systems to get rid of surplus surface water from the land. Commonly used surface drainage systems include shallow ditches, open channels, grassed waterways and sloped banks."}, {"url": "http://www.britannica.com/topic/surface-drainage", "passage_text": "Removal of excess water from soils can be achieved by surface or sub surface drainage. Surface drainage refers to the removal of surface water by development of the slope of the land utilizing systems of drains to carry away the surplus water. In sub surface drainage open ditches and tile fields intercept groundwater and carry it off. The water enters the tiling through the joints, and drainage..."}, {"url": "http://wq.illinois.edu/DG/surface.htm", "passage_text": "SURFACE DRAINAGE. Surface drainage is the removal of water that collects on the land surface. A surface drainage system consists of shallow ditches and should include land smoothing or land grading. This type of system is suitable for all slowly permeable soils and for soils with fragipans or clay subsoils."}, {"url": "http://www.nrcs.usda.gov/Internet/FSE_DOCUMENTS/nrcs143_026458.doc", "passage_text": "Conservation Practice Standard. Surface Drain, main or lateral. (Ft.). Code 608. Definition. An open drainage ditch constructed to a designed cross section, alignment and grade. Purpose. This practice is applied as part of a water management system to collect and convey excess surface or subsurface water."}]