[{"url": "http://www.eeoc.gov/laws/types/", "passage_text": "Discrimination by Type. Learn about the various types of discrimination prohibited by the laws enforced by EEOC. We also provide links to the relevant laws, regulations and policy guidance, and also fact sheets, Q&As, best practices, and other information. 1  Age. 2  Disability. 3  Equal Pay/Compensation. 4  Genetic Information. 5  Harassment. 6  National Origin. "}, {"url": "http://dictionary.cambridge.org/dictionary/english/discrimination", "passage_text": "discrimination noun [U] (WORSE TREATMENT). › the ​treatment of a ​person or ​particular ​group of ​people differently, in a way that is ​worse than the way ​people are usually ​treated: Some ​immigrants were ​victims of discrimination. The ​law made ​racial discrimination in ​employment a ​serious ​crime. "}, {"url": "https://en.wikipedia.org/wiki/Discrimination", "passage_text": "Discrimination is treatment or consideration of, or making a distinction in favor of or against, a person or thing based on the group, class, or category to which that person or thing is perceived to belong to rather than on individual merit. Though gender discrimination and sexism refers to beliefs and attitudes in relation to the gender of a person, such beliefs and attitudes are of a social nature and do not, normally, carry any legal consequences."}, {"url": "http://www.yourdictionary.com/discrimination", "passage_text": "discrimination-Legal Definition. n. The act of denying rights, benefits, justice, equitable treatment, or access to facilities available to all others, to an individual or group of people because of their race, age, gender, handicap or other defining characteristic. See also reverse discrimination. noun. Discrimination is defined as distinguishing differences between things or treating someone as inferior based on their race, sex, national origin, age or other characteristics. 1  An example of discrimination is when you can tell the difference between fine wine and cheap wine"}, {"url": "https://en.wikipedia.org/wiki/Employment_discrimination", "passage_text": "Employment discrimination is a form of discrimination based on race, gender, religion, national origin, physical or mental disability, and age by employers. Earnings differentials or occupational differentiation is not in and of itself evidence of employment discrimination. "}, {"url": "http://definitions.uslegal.com/d/discrimination/", "passage_text": "State laws also provide further protection against discrimination. The term discrimination is also used to refer to the effect of state laws that favor local interests over out-of-state interests. Discrimination can be the effect of some law or established practice that confers privileges on a certain class or denies privileges to a certain class because of race, age, sex, nationality, religion, or handicap."}, {"url": "http://definitions.uslegal.com/d/discrimination/", "passage_text": "Employment Discrimination laws seek to prevent discrimination based on race, sex, religion, national origin, physical disability, and age by employers. There is also a growing body of law preventing or occasionally justifying employment discrimination based on sexual orientation. Discrimination can be the effect of some law or established practice that confers privileges on a certain class or denies privileges to a certain class because of race, age, sex, nationality, religion, or handicap."}, {"url": "https://en.wikipedia.org/wiki/Discrimination", "passage_text": "Ageism or age discrimination is discrimination and stereotyping based on the grounds of someone's age. It is a set of beliefs, norms, and values which used to justify discrimination or subordination based on a person's age. Ageism is most often directed towards old people, or adolescents and children. Though gender discrimination and sexism refers to beliefs and attitudes in relation to the gender of a person, such beliefs and attitudes are of a social nature and do not, normally, carry any legal consequences."}, {"url": "http://www.merriam-webster.com/dictionary/discriminatory", "passage_text": "Full Definition of DISCRIMINATORY. 1. : discriminative 1. 2. : applying or favoring discrimination in treatment. — dis·crim·i·na·to·ri·ly \\-ˌkri-mə-nə-ˈtȯr-ə-lē, -ˌkrim-nə-\\ adverb. See discriminatory defined for English-language learners. See discriminatory defined for kids. "}]