[{"url": "http://www.howmuchisit.org/droopy-eyelid-surgery-cost/", "passage_text": "1 According to the American Society of Aesthetic Plastic Surgery, the average cost of droopy eyelid surgery was $2,480. 2  According to Dr. Jonathan Hoenig, who answered the question about the topic at Realself.com, the cost of surgery for one droopy eyelid is around $1,000. 1 A procedure done on both the upper and lower eyelids costs around twice as much as doing the lower lid only. 2  The cost of droopy eyelid surgery is much higher in big cities like New York and Los Angeles because of their high overhead cost and a higher demand for the procedure."}, {"url": "http://plasticsurgery.org/cosmetic-procedures/eyelid-surgery.html?sub=Eyelid+surgery+cost", "passage_text": "The average cost of eyelid surgery is $2,874, according to 2014 statistics from the American Society of Plastic Surgeons. Blepharoplasty costs can vary widely. The average fee referenced above does not include anesthesia, operating room facilities or other related expenses. "}, {"url": "http://www.webmd.com/beauty/eyelid-surgery/cosmetic-procedures-eyelid-surgery", "passage_text": "Eyelid surgery (also called an eye lift or blepharoplasty), reduces bagginess from lower eyelids and removes excess skin from the upper eyelids. This surgery is usually done for cosmetic reasons. It's also an effective way to improve sight in older people whose sagging upper eyelids get in the way of their vision. "}, {"url": "http://health.costhelper.com/eyelid-surgery.html", "passage_text": "1 Eyelid surgery, also known as blepharoplasty or an eyelid tuck, usually costs between $4,000 and $5,500 for the upper and lower eyelids. 2  This includes the anesthesia fee, facility fee and surgeon's fee. 1 The average surgeon's fee for a forehead lift is a little over $3,000. 2  If the patient is unhappy with the results or requires additional surgery to fix complications, corrective surgery can cost as much as or more than the initial procedure."}, {"url": "http://www.howmuchisit.org/droopy-eyelid-surgery-cost/", "passage_text": "1 Since this procedure is deemed a cosmetic procedure 99% of the time, your health insurance policy will more than likely not cover it. 2  According to the American Society of Aesthetic Plastic Surgery, the average cost of droopy eyelid surgery was $2,480. 1 A procedure done on both the upper and lower eyelids costs around twice as much as doing the lower lid only. 2  The cost of droopy eyelid surgery is much higher in big cities like New York and Los Angeles because of their high overhead cost and a higher demand for the procedure."}, {"url": "http://health.costhelper.com/eyelid-surgery.html", "passage_text": "Eyelid Surgery Cost. 1  Eyelid surgery, also known as blepharoplasty or an eyelid tuck, usually costs between $4,000 and $5,500 for the upper and lower eyelids. 1 The average surgeon's fee for a forehead lift is a little over $3,000. 2  If the patient is unhappy with the results or requires additional surgery to fix complications, corrective surgery can cost as much as or more than the initial procedure."}, {"url": "http://www.medicinenet.com/blepharoplasty__eyelid_surgery/article.htm", "passage_text": "An eyelid lift, or blepharoplasty, is a surgical procedure to remove skin and to add or remove fat from the eyelids. The term eyelid lift is a misconception because the eyelid is not lifted during surgery. Upper blepharoplasty surgery uses incisions on the skin to allow for removal of skin and fat. Double eyelid surgery (sometimes termed Asian eyelid surgery) is performed to create an upper eyelid crease. Double eyelid surgery is also called Westernization of the eyelid. Lower blepharoplasty is performed to remove excess skin, reduce wrinkles, and improve the shape of the lower eyelid by removing"}, {"url": "http://health.costhelper.com/eyelid-surgery.html", "passage_text": "Additional costs: 1  In eyelid surgery, the doctor will make an incision in the crease of the upper eyelid, then remove excess skin, tissue and fat. 2  Then, the surgeon will make another cut just below the lashes of the lower eyelid, and will remove excess fat and tissue or redistribute fat to smooth out the eye area. 1 The average surgeon's fee for a forehead lift is a little over $3,000. 2  If the patient is unhappy with the results or requires additional surgery to fix complications, corrective surgery can cost as much as or more than the initial procedure."}, {"url": "https://www.eyemagic.net/", "passage_text": "Get an instant eye lift without eyelid surgery! Eye Magic is a revolutionary new eyelid cosmetic that can quickly and easily restore droopy upper eyelids to a youthful shape, without the cost, risk, and recovery time of cosmetic eyelid surgery. Eye Magic can be applied to both eyes in as little as 60 seconds! Eye Magic can quickly and easily lift droopy upper eyelids to a youthful shape, without the cost, risk, and recovery time of eyelid surgery. Improve your appearance in seconds…in just THREE easy steps!"}, {"url": "http://www.howmuchisit.org/droopy-eyelid-surgery-cost/", "passage_text": "1 According to Dr. Jonathan Hoenig, who answered the question about the topic at Realself.com, the cost of surgery for one droopy eyelid is around $1,000. 2  Yourplasticsurgeryguide.com estimated that eyelid surgery can cost between $2,000 and $5,000, or even higher. 1 A procedure done on both the upper and lower eyelids costs around twice as much as doing the lower lid only. 2  The cost of droopy eyelid surgery is much higher in big cities like New York and Los Angeles because of their high overhead cost and a higher demand for the procedure."}]