[{"url": "http://www.ncbi.nlm.nih.gov/pubmed/18056506", "passage_text": "BACKGROUND: Patients with crowned dens syndrome typically present with severe neck pain and have calcium deposits around the odontoid process of the axis on radiographs. METHODS: Forty patients with severe neck pain had calcium deposition around the odontoid process on computed tomography scans, and they were thus diagnosed as having crowned dens syndrome."}, {"url": "http://www.nejm.org/doi/full/10.1056/NEJMicm1100764", "passage_text": "An 88-year-old woman presented with a 2-month history of recurrent episodes of acute pain in her neck and knees that were associated with fevers of 38 to 39.3°C. She reported no visual symptoms, jaw claudication, morning stiffness, or pain in the upper arms or shoulders. Computed tomography of the neck showed curvilinear calcifications of the transverse ligament of the atlas (Panel A, arrows), a linear calcification (Panel B, arrows), and crown-shaped calcium deposits surrounding the odontoid process (Panel C, arrowheads)."}, {"url": "http://www.ncbi.nlm.nih.gov/pubmed/18056506", "passage_text": "Pain was typically relieved by nonsteroidal anti-inflammatory drugs, prednisolone, or both. A combination of both appeared to be the most effective. CONCLUSIONS: We believe that crowned dens syndrome is more common than previously recognized, especially in elderly patients. METHODS: Forty patients with severe neck pain had calcium deposition around the odontoid process on computed tomography scans, and they were thus diagnosed as having crowned dens syndrome."}, {"url": "http://link.springer.com/article/10.1007/s10067-013-2179-5", "passage_text": "Abstract. Crowned dens syndrome (CDS) is a rare but underrecognized cause of severe neck pain in older adults. It is characterized by acute onset pain and stiffness of the cervical spine. Accompanying fever and elevated inflammatory markers often lead to misdiagnosis. It is frequently associated with calcium pyrophosphate deposition disease, hydroxyapatite crystals, and sometimes other inflammatory conditions."}, {"url": "https://www.hss.edu/professional-conditions_recovery-after-cervical-decompression-for-the-treatment-of-crowded-dens-syndrome-causing-progressive-neuological-decline.asp", "passage_text": "Crowned dens syndrome (CDS) is a rare but known cause of decreased cervical range of motion and severe axial neck pain, in the setting of calcium deposition around the odontoid, for which medical treatment with nonsteroidal anti-inflammatory drugs and/or steroids has been reported [2, 7]. "}, {"url": "http://www.nejm.org/doi/full/10.1056/NEJMicm1100764", "passage_text": "Crowned dens syndrome is characterized by recurrent neck pain related to radiodense deposits of hydroxyapatite or calcium pyrophosphate dihydrate in ligaments around the odontoid process, which create the appearance of a crown or halo surrounding the odontoid process on radiographic imaging. Computed tomography of the neck showed curvilinear calcifications of the transverse ligament of the atlas (Panel A, arrows), a linear calcification (Panel B, arrows), and crown-shaped calcium deposits surrounding the odontoid process (Panel C, arrowheads)."}, {"url": "http://www.nejm.org/doi/pdf/10.1056/NEJMicm1100764", "passage_text": "Crowned dens syndrome is characterized by recurrent neck pain related to radiodense deposits of hydroxyapatite or calcium pyrophosphate dihydrate in ligaments around the odontoid process, which create the appearance of a crown or halo surrounding the odontoid process on radiographic imaging. "}, {"url": "http://www.ncbi.nlm.nih.gov/pubmed/18056506", "passage_text": "To our knowledge, the cases of only thirty-five patients have been reported in the English-language literature and the clinical features remain unclear. The purposes of this study were to examine the clinical features of crowned dens syndrome, determine treatment outcomes, and propose diagnostic criteria. METHODS: Forty patients with severe neck pain had calcium deposition around the odontoid process on computed tomography scans, and they were thus diagnosed as having crowned dens syndrome."}, {"url": "http://www.medscape.com/medline/abstract/23392827", "passage_text": "Crowned dens syndrome (CDS) is a rare but underrecognized cause of severe neck pain in older adults. It is characterized by acute onset pain and stiffness of the cervical spine. Accompanying fever and elevated inflammatory markers often lead to misdiagnosis. "}]