[{"url": "http://www.mathblaster.com/coolmath/articles/linear-vs-nonlinear-functions", "passage_text": "When graphed, a linear equation will have a straight line that has a constant slope. In contrast to this, a nonlinear equation will have a graph that does not have a straight line and, depending on the function, can have many different appearances including a U-shape or an S-shape."}, {"url": "http://www.montereyinstitute.org/courses/Algebra1/COURSE_TEXT_RESOURCE/U03_L2_T5_text_final.html", "passage_text": "In Function 2, the graph is a straight line, so it is a linear function. Summary. We’ve explored a few different kinds of nonlinear functions. Like linear functions, inverse relation, quadratic, and exponential functions can help us model real world situations and understand them better. Unlike linear functions, the rate of change in nonlinear functions is not constant but variable."}, {"url": "http://math.tutorvista.com/calculus/nonlinear-function.html", "passage_text": "Most basically, the functions can be classified into two types -(1) Linear Functions(2) Nonlinear FunctionsLinear functions are the functions having a degree of one. In other words, a function in which highest exponent is found to be one, is known as a linear function."}, {"url": "http://math.tutorvista.com/calculus/nonlinear-function.html", "passage_text": "Non-linear functions are those which do not form a straight line when graphed. One of the functions which is not a linear function and cannot be a complete linear function by transforming the Y variable. Quadratic Functions: Functions of the form f(x) = ax 2 + bx + c,1. where a a‰ â, 0 are called quadratic. functions"}, {"url": "http://www.biology.arizona.edu/biomath/tutorials/Linear/Basics_LinearFunctions.html", "passage_text": "Nonlinear functions, on the other hand, have different changes in y for a fixed change in x. Definition: A nonlinear function is a function that is not linear. That is, for a fixed change in the independent variable, there is NOT a corresponding fixed change in the dependent variable."}, {"url": "http://www.montereyinstitute.org/courses/Algebra1/COURSE_TEXT_RESOURCE/U03_L2_T5_text_final.html", "passage_text": "One kind of nonlinear function is called inverse variation. In these functions, the dependent variable equals a constant times the inverse of the independent variable. In symbolic form, this is the equation, where y is the dependent variable, k is the constant, and x is"}, {"url": "http://www.biology.arizona.edu/biomath/tutorials/Linear/Basics_LinearFunctions.html", "passage_text": "Definition: Linear and Nonlinear Functions. The key feature of linear functions is that the dependent variable (y) changes at a constant rate with the independent variable (x). In other words, for some fixed change in x there is a corresponding fixed change in y."}, {"url": "http://www.biology.arizona.edu/biomath/tutorials/Linear/Basics_LinearFunctions.html", "passage_text": "Definition: A linear function is a function that has a constant rate of change and can be represented by the equation y = mx + b, where m and b are constants. That is, for a fixed change in the independent variable there is a corresponding fixed change in the dependent variable."}]