[{"url": "http://www.healthaliciousness.com/articles/foods-highest-in-carbohydrates.php", "passage_text": "Excessive consumption of carbohydrates, especially refined carbohydrates like sugar or corn syrup, can lead to obesity, type II diabetes, and cancer. Unhealthy high carbohydrate foods include dried fruit, cereals, crackers, cakes, flours, jams, preserves, bread products, and potato products."}, {"url": "http://www.diabetes.org/food-and-fitness/food/what-can-i-eat/understanding-carbohydrates/", "passage_text": "Understanding Carbohydrates. How much and what type of carbohydrate foods are important for managing diabetes. The balance between how much insulin is in your body and the carbohydrate you eat makes a difference in your blood glucose levels."}, {"url": "http://www.bellaonline.com/articles/art6628.asp", "passage_text": "The good carbs on the list of carbohydrate foods can provide your body with energy, optimum nutrition, proper brain and organ function and a healthy, attractive appearance. But bad carbs are detrimental to a healthy diet."}, {"url": "https://www.nlm.nih.gov/medlineplus/ency/article/002469.htm", "passage_text": "Complex carbohydrates, often referred to as starchy foods, include: 1  Legumes, such as beans, peas, lentils and peanuts. 2  Starchy vegetables, such as potatoes, corn, green peas, and parsnips. 3  Whole-grain breads and cereals."}, {"url": "http://www.healthaliciousness.com/articles/foods-highest-in-carbohydrates.php", "passage_text": "Healthy high carbohydrate foods include vegetables, legumes (beans), whole grains, fruits, nuts, and yogurt. Below is a list of foods highest in carbohydrates, for more see the extended list of carb rich foods to avoid. For more healthy high carbohydrate choices see the list of healthy high carb foods."}, {"url": "http://www.livescience.com/51976-carbohydrates.html", "passage_text": "Complex carbohydrates (polysaccharides) have three or more sugars. They are often referred to as starchy foods and include beans, peas, lentils, peanuts, potatoes, corn, parsnips, whole-grain breads and cereals."}, {"url": "http://umm.edu/Health/Medical/Ency/Articles/Carbohydrates", "passage_text": "Complex carbohydrates, often referred to as starchy foods, include: 1  Legumes, such as beans, peas, lentils and peanuts. 2  Starchy vegetables, such as potatoes, corn, green peas, and parsnips. 3  Whole-grain breads and cereals."}, {"url": "https://www.nlm.nih.gov/medlineplus/carbohydrates.html", "passage_text": "Simple carbohydrates include sugars found naturally in foods such as fruits, vegetables, milk, and milk products. They also include sugars added during food processing and refining. Complex carbohydrates include whole grain breads and cereals, starchy vegetables and legumes."}]