[{"url": "https://en.wikipedia.org/wiki/Totem_pole", "passage_text": "Totem poles are monumental sculptures carved on poles, posts, or pillars with symbols or figures made from large trees, mostly western red cedar, by indigenous peoples of the Pacific Northwest coast of North America (northwestern United States and Canada's western province, British Columbia). Poles similar to totem poles are also found elsewhere in the world. Due to their similarities, they are often described as totem poles. Notable cultures with examples of totem pole-like objects are the indigenous people of Jilin, northeast China; the Koreans; and the Māori, an indigenous people of New Zealand."}, {"url": "http://www.merriam-webster.com/dictionary/totem%20pole", "passage_text": "Full Definition of TOTEM POLE. 1. : a pole or pillar carved and painted with a series of totemic symbols representing family lineage and often mythical or historical incidents and erected by Indian tribes of the northwest coast of North America. 2. "}, {"url": "http://users.imag.net/~sry.jkramer/nativetotems/false.htm", "passage_text": "(In reality, most totem poles, though made of decay resistant cedar, fall over in about 100 years; the oldest ones in Ninstints, BC date from about the 1840s and 1850s.) -Painted poles are fakes. (Some poles are painted, some are not. The choice is the carvers to make.) -Unpainted poles are fakes. There are a number of silly stories that circulate about totem poles and the rich traditions that surround them. Sometimes it's tricky to figure out which are true and which are not. Brushing a totem with cedar for life is a sign of respect. The following statements are untrue."}, {"url": "https://www.readinga-z.com/newfiles/levels/lesson_plans/n/totempoles/totempoles_print.html", "passage_text": "1 Ask students what the book they just read is about (totem poles). 2  Ask students if they think the title and covers of this book were good hints. 3  Ask students to tell the best way to find out if the title and covers are good hints (read the book). 4  Direct the students to the table of contents. 1 For example, ask students to point to the photograph of the totem pole on page 4. Ask students to say the words that tell what the picture is of and tell what sounds they hear at the beginning of each. 2  Ask students to find the words on page 4 and explain how they know that the words are totem poles."}, {"url": "http://www.legendsofamerica.com/na-totems.html", "passage_text": "Native American Totems & Their Meanings. A totem is a spirit being, sacred object, or symbol of a tribe, clan, family or individual. Native American tradition provides that each individual is connected with nine different animals that will accompany each person through life, acting as guides. Are you drawn to figurines or paintings of a specific animal? The totem itself is a symbol that represents this animal. This could be any number of items-a crest, a totem pole, an emblem, a small figurine or anything else that depicts your animal guide."}, {"url": "http://wonderopolis.org/wonder/what-is-a-totem-pole/", "passage_text": "In North America, totem poles are part of the cultures of many indigenous peoples of Alaska, British Columbia and the Pacific Northwest. Totem poles serve many purposes beyond their beauty, and their meanings are as varied as the cultures that make them. Some totem poles represent stories or important events. On these poles, each figure on the totem represents part of a story. These totems are used as a way to record the history and legends of the tribes. Figures on a totem pole are not gods to be worshipped. Instead, they represent traits and characteristics each clan or story embodies. There are many other types of totem poles. Genealogy poles are erected in front of a family's home to represent the owner's clan or social status. Common figures found on totem poles include the raven (a symbol of The Creator), the eagle (representing peace and friendship), the killer whale (a symbol of strength), the thunderbird, the beaver, the bear, the wolf and the frog."}, {"url": "http://www.legendsofamerica.com/na-totems.html", "passage_text": "Animal Characteristics & Meaning. A totem is a spirit being, sacred object, or symbol of a tribe, clan, family or individual. Native American tradition provides that each individual is connected with nine different animals that will accompany each person through life, acting as guides. Are you drawn to figurines or paintings of a specific animal? The totem itself is a symbol that represents this animal. This could be any number of items-a crest, a totem pole, an emblem, a small figurine or anything else that depicts your animal guide."}, {"url": "https://www.readinga-z.com/newfiles/levels/lesson_plans/n/totempoles/totempoles_print.html", "passage_text": "Text Summary What kind of tree trunk can tell a story? One that's been carved into a totem pole! In this informational book, readers will learn in what parts of the United States totem poles are found, why they are used and by whom, and how totem poles are carved. Photographs of totem poles, and of figures found on totem poles, enhance the text. About the Lesson. 1 For example, ask students to point to the photograph of the totem pole on page 4. Ask students to say the words that tell what the picture is of and tell what sounds they hear at the beginning of each. 2  Ask students to find the words on page 4 and explain how they know that the words are totem poles."}, {"url": "http://www.thecanadianencyclopedia.ca/en/article/totem-pole/", "passage_text": "Totem Pole. The totem pole is a monument created by Northwest Coast Aboriginal peoples to serve variously as a signboard, genealogical record and memorial. The totem pole is a monument created by Northwest Coast Aboriginal people s to serve variously as a signboard, genealogical record and memorial. Carved of large, straight red cedar and painted vibrant colours, the totem pole is emblematic of both coastal Aboriginal culture and Northwest Coast Aboriginal Art"}]