[{"url": "http://homeguides.sfgate.com/plant-stargazer-lilies-44706.html", "passage_text": "For summer blooms, plant stargazer lilies in the spring or fall. With their pink and white flowers that have the appearance of a star burst, Stargazer lilies (Lilium Stargazer) make a dramatic addition to the garden. These summer-blooming bulbs are a variety of Oriental lily, which thrive in United States Department of Agriculture plant hardiness zones 5 to 10. Like many other bulbs, you have the option of planting Stargazer lilies in either the spring or fall. Preparing to Plant. Like other Oriental lilies, Stargazer lilies prefer to be in a partially shaded area of the garden. The plants tolerate morning and evening sun, but should receive dappled shade during the afternoon. Before planting, loosen the soil to a depth of 12 inches."}, {"url": "http://landscaping.about.com/od/floweringbulbs/p/Stargazer-Lily.htm", "passage_text": "Stargazer Lily Care: Plant Stargazer lily bulbs either in spring or fall. Plant the bulbs 6 inches deep. Fertilize Stargazer lily plants from early spring until they are done blooming. If you use Osmocote slow release fertilizer or compost, you can get all your fertilizing done in one fell swoop in early spring. "}, {"url": "http://www.gardenguides.com/video-59107-plant-stargazer-lilies.html", "passage_text": "To plant stargazer lilies, mound up the roots of the bulb, bury it three inches below the surface of the soil, and provide plenty of drainage. Care for a stargazer plant, which should be planted in a sunny spot in the garden, with helpful tips from a... View Video Transcript. "}, {"url": "http://homeguides.sfgate.com/plant-stargazer-lilies-44706.html", "passage_text": "When planting Stargazer lilies, plant them to a depth of two and a half times their diameter, about 6 to 8 inches for average-sized bulbs. Preparing to Plant. Like other Oriental lilies, Stargazer lilies prefer to be in a partially shaded area of the garden. The plants tolerate morning and evening sun, but should receive dappled shade during the afternoon. Before planting, loosen the soil to a depth of 12 inches."}, {"url": "http://www.wikihow.com/Grow-Stargazer-Lilies", "passage_text": "Lilies can be a great addition to any floral garden, as they are easy to plant and care for. While some varieties of lily are more fragrant than others, the stargazer lily is possibly the most aromatic. Care and maintenance of this variety takes some initial time, but when you learn how to grow stargazer lilies properly, they will multiply readily and provide you years of enjoyment. Ad."}, {"url": "http://www.ehow.com/video_5238736_plant-stargazer-lilies.html", "passage_text": "5. Cancel. To plant stargazer lilies, mound up the roots of the bulb, bury it three inches below the surface of the soil, and provide plenty of drainage. Care for a stargazer plant, which should be planted in a sunny spot in the garden, with helpful tips from a sustainable gardener in this free video on growing flowers"}, {"url": "http://www.youtube.com/watch?v=7x3VXio9nxo", "passage_text": "To plant stargazer lilies, mound up the roots of the bulb, bury it three inches below the surface of the soil, and provide plenty of drainage. Care for a stargazer plant, which should be planted in a sunny spot in the garden, with helpful tips from a sustainable gardener in this free video on growing flowers. "}, {"url": "http://homeguides.sfgate.com/grow-oriental-stargazer-lilies-indoors-69568.html", "passage_text": "1. Plant stargazer lilies in a sturdy pot, such as one made of clay, that will not tip over. It must have a drainage hole. In general, plant one bulb in a 6-inch wide and 8 to 10 inches deep container. For every extra 2 inches in width, you can plant an additional two bulbs in the same container. "}, {"url": "http://forums.gardenweb.com/discussions/2006946/how-deep-to-plant-stargazer-lily-bulbs", "passage_text": "Hi Belinda, Lily bulbs are large, meaning they need to be planted deep, about 6-8 inches. The length of your hand is one way to tell how deep to plant these :) BTW, I love these lilies! They are so beautiful & fragrant. I ordered 10 Stargazer lily bulbs, and they arrived today...but I'm uncertain of how deep to plant them. I did a search, and came up with varying answers, as I expected! I thought I'd ask the lily enthusiasts here, and hopefully I can be set on the right path to planting my new lilies! :-). Thanks so much,"}]