[{"url": "http://www.answers.com/Q/What_continent_is_Korea_in", "passage_text": "49,340 Contributions. Korea is located between china and japan    Korea is geographically, in the East Asian region and is bordered  at the North by Manchuria (Northeastern part of the Peop … le's  Republic of China). To the east is the State of Japan. 23 people found this useful."}, {"url": "http://www.answers.com/Q/What_continent_is_Korea_in", "passage_text": "Korea is a region in East Asia (between China and Japan) that has around 5000 years of recorded history. It's currently divided into North Korea and South Korea. Korea is located between china and japan    Korea is geographically, in the East Asian region and is bordered  at the North by Manchuria (Northeastern part of the Peop … le's  Republic of China). To the east is the State of Japan. 23 people found this useful."}, {"url": "https://en.wikipedia.org/wiki/Geography_of_South_Korea", "passage_text": "The west coast of the peninsula is bordered by the Korea Bay to the north and the Yellow Sea and Korea Strait to the south; the east coast is bordered by the Sea of Japan. The 8,640-kilometer coastline is highly indented. Some 3,579 islands lie adjacent to the peninsula. The only country with a land border to South Korea is North Korea, lying to the north with 238 kilometres (148 mi) of border running along the Korean Demilitarized Zone."}, {"url": "https://en.wikipedia.org/wiki/Koreas", "passage_text": "Korea is located on the Korean Peninsula in North-East Asia. To the northwest, the Amnok River (Yalu River) separates Korea from China and to the northeast, the Duman River (Tumen River) separates Korea from China and Russia. "}, {"url": "http://www.answers.com/Q/Which_continent_is_South_Korea_in", "passage_text": "1 South Korea is a country in East Asia located on the Korean Peninsula. 2  It bordered on the north by North Korea, on the west by the Yellow 3  …. Living at Camp Casey in South Korea Living at Camp Casey in South Korea is somewhat different than living at domestic or even European military bases. South Korea is located in East Asia, on the southern half of the Korean Peninsula jutting out from the far east of the Asian land mass."}, {"url": "https://answers.yahoo.com/question/index?qid=20081004130037AA8W2OP", "passage_text": "Korea is a peninsula which sticks off China (which is a part of Asia). It is politically divided into North Korea (a communist dictatorship) and South Korea (a democracy). lithiumdeuteride · 7 years ago. Thumbs up. "}, {"url": "http://www.answers.com/Q/Which_continent_is_South_Korea_in", "passage_text": "South Korea is a country in East Asia that is south of China and to the west of Japan. Korea is divided into two countries. North Korea and South Korea. a country in Asia that … borders north Korea and famous for a company called samsung and LG. 4 people found this useful. 1  Celebrating the Japanese Holiday, White Day Holidays are predetermined days of celebration that are observed by a particular group of people. South Korea is located in East Asia, on the southern half of the Korean Peninsula jutting out from the far east of the Asian land mass."}, {"url": "https://en.wikipedia.org/wiki/Geography_of_South_Korea", "passage_text": "South Korea is located in East Asia, on the southern half of the Korean Peninsula jutting out from the far east of the Asian land mass. The only country with a land border to South Korea is North Korea, lying to the north with 238 kilometres (148 mi) of border running along the Korean Demilitarized Zone. South Korea is mostly surrounded by water and has 2,413 kilometres (1,499 mi) of coast line along three sea"}, {"url": "http://www.gomapper.com/travel/where-is/south-korea-located.html", "passage_text": "South Korea is a country with a large population which is located in the continent/region of Asia. Countries near South Korea include North Korea, Japan, Taiwan and Hong Kong. Its biggest cities and towns include Seoul, Deogchon, Deog Bigginae and Dochokuri. "}, {"url": "http://www.mapsofworld.com/south-korea/south-korea-location-map.html", "passage_text": "South Korea formally the Republic of South Korea is located in East Asia. It is the southern half of the Korean Peninsula bounded by the Sea of Japan in the east, the Yellow Sea in the west and the Korea Strait in the south. In the north it shares its land boundary with Democratic Republic of Korea (North Korea). The other overseas neighbors of South Korea are Japan in the east and China in the west. The total area covered by South Korea is 99,720 sq. km. It is the hundred and ninth largest country of the world and has 2413 km long coastline. The geographic coordinates of the country are 37 00N and 127 30E."}]