[{"url": "https://en.wikipedia.org/wiki/Posterior_cortical_atrophy", "passage_text": "Posterior cortical atrophy (PCA), also called Benson's syndrome, is a form of dementia which is usually considered an atypical variant of Alzheimer's disease. The main symptom resulting from PCA is a decrease in visuospatial and visuoperceptual capabilities. Because the posterior region of the brain is home to the occipital lobe, which is responsible for visual processing, visual functions are impaired in PCA patients."}, {"url": "http://www.ninds.nih.gov/disorders/cerebral_atrophy/cerebral_atrophy.htm", "passage_text": "Associated Diseases/Disorders: The pattern and rate of progression of cerebral atrophy depends on the disease involved. Diseases that cause cerebral atrophy include: 1  stroke and traumatic brain injury. 2  Alzheimer’s disease, Pick’s disease, and fronto-temporal dementia. 3  cerebral palsy, in which lesions (damaged areas) may impair motor coordination. 4  Huntington’s disease, and other hereditary diseases that are associated with genetic mutations"}, {"url": "http://thebrain.mcgill.ca/flash/i/i_08/i_08_cr/i_08_cr_alz/i_08_cr_alz.html", "passage_text": "CORTICAL ATROPHY IN ALZHEIMER’S. The atrophy of the cortex that is seen in Alzheimer’s-type dementia depends on the amount of neurofibrillary degeneration and build-up of amyloid plaques in the brain. The extent of this atrophy generally correlates with the extent of the cognitive losses observed."}, {"url": "http://www.alz.org/dementia/posterior-cortical-atrophy.asp", "passage_text": "Posterior cortical atrophy (PCA) refers to gradual and progressive degeneration of the outer layer of the brain (the cortex) in the part of the brain located in the back of the head (posterior). It is not known whether PCA is a unique disease or a possible variant form of Alzheimer’s disease. In other people with PCA, however, the brain changes resemble other diseases such as Lewy body dementia or a form of Creutzfeld-Jacob disease. Most cases of Alzheimer’s disease occur in people age 65 or older, whereas the onset of PCA commonly occurs between ages 50 and 65."}, {"url": "http://www.neuroradiologycases.com/2012/09/reversible-cerebral-cortical-atrophy.html", "passage_text": "Atrophy is a finding, seen in many of the diseases that affect the brain. Atrophy of any tissue means loss of cells. In brain it means loss of neurons and the in between connections. Atrophy can be generalized and diffuse, which means that all parts of the brain affected equally or it can be focal, affecting only a limited area of the brain with a relatively decreased of the functions of that area of the brain."}, {"url": "http://www.healthgrades.com/conditions/cerebral-atrophy", "passage_text": "Cerebral atrophy refers to the progressive loss of brain cells over time. Atrophy refers to a decreased size or wasting away of any part of the body. Cerebral atrophy can happen in either the entire brain or in just one part of the brain and can lead to decreased brain mass and loss of neurological function. The symptoms of cerebral atrophy depend on the cause and location of cell death. Find a Top Neurologist Near You. Symptoms of cerebral atrophy include dementia, seizures, loss of motor control, and difficulty with speaking, comprehension or reading. Dementia, which is marked by memory loss and an inability to perform daily activities, may be mild or severe and may worsen with increasing atrophy."}, {"url": "https://en.wikipedia.org/wiki/Cerebral_atrophy", "passage_text": "Cerebral atrophy is a common feature of many of the diseases that affect the brain. Atrophy of any tissue means a decrement in the size of the cell, which can be due to progressive loss of cytoplasmic proteins. In brain tissue, atrophy describes a loss of neurons and the connections between them."}, {"url": "http://www.neuroradiologycases.com/2012/09/reversible-cerebral-cortical-atrophy.html", "passage_text": "Causes of Reversible Cerebral cortical Atrophy. Common causes of reversible cerebral atrophy are related to dehydration and starvation. Addison's disease or other causes of dehydration and abnormal fluid balance occasionally present with cerebral cortical atrophy on CT and may be reversible with treatment. In brain it means loss of neurons and the in between connections. Atrophy can be generalized and diffuse, which means that all parts of the brain affected equally or it can be focal, affecting only a limited area of the brain with a relatively decreased of the functions of that area of the brain."}, {"url": "http://www.healthgrades.com/conditions/cerebral-atrophy", "passage_text": "Cerebral atrophy can occur due to brain injury, as in the case of stroke, or to a neurological disease, such as Alzheimer’s disease, cerebral palsy, or Huntington’s disease. Infections of the brain can also lead to the death of brain cells and cerebral atrophy. Find a Top Neurologist Near You. Symptoms of cerebral atrophy include dementia, seizures, loss of motor control, and difficulty with speaking, comprehension or reading. Dementia, which is marked by memory loss and an inability to perform daily activities, may be mild or severe and may worsen with increasing atrophy."}, {"url": "https://en.wikipedia.org/wiki/Posterior_cortical_atrophy", "passage_text": "The disease causes atrophy of the back (posterior) part of the cerebral cortex, resulting in the progressive disruption of complex visual processing. PCA was first described by D. Frank Benson in 1988. The main symptom resulting from PCA is a decrease in visuospatial and visuoperceptual capabilities. Because the posterior region of the brain is home to the occipital lobe, which is responsible for visual processing, visual functions are impaired in PCA patients."}]