[{"url": "http://www.disability-benefits-help.org/blog/how-long-take-approved-social-security-disability-benefits", "passage_text": "What factors impact how long it takes to get a Social Security Disability approval? The first thing that will impact how quickly you get a response to your application for Social Security Disability is whether your initial disability claim is approved or denied. Initial claims usually take 30 to 90 days to process. Unfortunately, the process of being approved (or denied) can take a very long time. According to the Social Security Administration, the full SSD application and appeal process takes an average of 440 days. That's over a year."}, {"url": "http://www.disabilitysecrets.com/question6.html", "passage_text": "On average, though, a decision for an initial disability claim takes three to four months, and a reconsideration (the first level of appeal) takes about as long, though a case could be decided much sooner or much later. Social Security Disability and SSI cases can be won in as little as 30 days, or take as long as two years for benefits to be awarded."}, {"url": "http://www.disabilitysecrets.com/question6.html", "passage_text": "The question of how long it takes to get a decision on a Social Security Disability or SSI benefit claim is not easy to answer, for several reasons. Social Security Disability and SSI cases can be won in as little as 30 days, or take as long as two years for benefits to be awarded."}, {"url": "http://www.ssdrc.com/disabilityquestions4-52.html", "passage_text": "The average amount of time it takes to receive a decision after filing for SSD benefits, also referred to as SSDI (Social Security Disability Insurance) benefits is about 120 days, or approximately three months. "}, {"url": "http://www.nolo.com/legal-encyclopedia/how-long-does-it-take-get-decision-social-security-disability.html", "passage_text": "It is hard to predict exactly how long it will take the Social Security Administration (SSA) to decide your disability case. This is, in part, because there is no deadline the SSA is required to follow. Decision times also depend on the following factors: 1  whether you are at the initial application stage or have appealed. "}, {"url": "http://www.ultimatedisabilityguide.com/hearing_wait_time.html", "passage_text": "If you are looking for how long it takes to get a decision from the time you request a hearing untill it is decided at your particular ODAR see  how long does it take . Amount of days from request for hearing until hearing is held. Region I 354 days. Region II 484 days. Region III 348 days. Region IV 421 days. "}, {"url": "http://www.ultimatedisabilityguide.com/ssdi_ssi_hearing_wait_times.html", "passage_text": "Below you will find how long the average processing time in days is for each Office of Disability Adjudication and Review or ODAR nationally. Keep in mind this is how long it takes from requesting a hearing until a decision is made and does not include the application and reconsideration process. In July of 2007 the claims backlog for SSDI and SSI cases was at its highest mark ever reaching 749,224 cases. The information below should help give you an idea of how long it takes to get a decision at the hearing level. The national average in 7/07 was 528 days. As of 5/30/08 a new report was published with an update on processing times at the hearing level. As of the month ending 11/27/2009 the national average processing time at the hearing level was down to 446 days. As you can see the average time it takes at hearing has improved from the 5/08 report to the 11/09 report by 77 days."}, {"url": "http://www.ssdrc.com/hub4.html", "passage_text": "If you win your claim and receive an approval at the disability application level, this will usually occur between 30 and 120 days. Sometimes cases take longer to process based on how long it takes to gather medical records or receive reports from independent examinations scheduled by Social Security. Social Security Disability Back pay and How Long it Takes to Qualify for it Social Security disability recipients may have to wait longer to receive their back pay if there are any SSI benefits involved."}, {"url": "http://www.disabilitylawyers.com/resources/disability/ssdi/how-long-will-take-get-social-security-disability", "passage_text": "Continuing disability review (CDR). When your file is up for a periodic review, Social Security will send you a form in the mail, either a short-form or long-form disability report. Once you send the form back, it usually takes one to two months for Social Security to review your case. "}, {"url": "http://www.disabilityadvisor.com/social-security-office/", "passage_text": "Social Security Disability Processing Time Varies. Processing time for Social Security Disability claims varies. Currently, the Social Security Administration, which is sometimes referred to as SSA, indicates that generally initial disability claim processing takes from three to five months. "}]