[{"url": "http://www.azdps.gov/Services/Records/Criminal_History_Records/Questions/", "passage_text": "1 Upon receipt of the record review results, if you feel that your record is inaccurate or incomplete: 2  You can challenge your criminal record by completing the “Review and Challenge of Arizona Criminal History Record Information” form which will be mailed to you with the results of the record review. How can I get a copy of my criminal history record? The Criminal History Records Section serves as the Central State Repository for criminal records in the State of Arizona (See Arizona Revised Statute §41-1750). You may request a copy of your Arizona criminal record if you believe it is inaccurate or incomplete"}, {"url": "http://www.wikihow.com/Access-Criminal-Court-Records", "passage_text": "View the record online. Once you locate a listing for the criminal record you want, click the link to see the record itself. Note that even if your state or county has digital records, they may still be in the middle of converting their files. The information in the database might be incomplet"}, {"url": "https://www.dmv.org/criminal-records.php", "passage_text": "Criminal Records Defined. Simply, a criminal record―or rap sheet― is a record of a person’s criminal history, i.e. the crimes a person has committed. Often, a criminal record is a compilation of local, state, and federal criminal information on a person. Criminal records can include every detail of a person’s criminal past including everything from misdemeanors and felonies to pending charges and even acquitted charges."}, {"url": "http://gbi.georgia.gov/obtaining-criminal-history-record-information", "passage_text": "Individuals can obtain a copy of their national criminal history record from the FBI. In order to receive a copy of your FBI record for personal, employment, or international work requirements, please visit the FBI website, http://www.fbi.gov/hq/cjisd/fprequest.htm for more information. The individual’s complete Georgia criminal history record, except juvenile, restricted and sealed records is released to the requesting entity. Juvenile arrest records are those where the offender was 16 years old or younger at the time of arrest, charged with a felony offense and was not treated as an adult."}, {"url": "http://www.txdps.state.tx.us/administration/crime_records/pages/juvenilecriminalhistoryrecords.htm", "passage_text": "The legal staff responsibilities generally relate to the expunction of criminal history record information, restricted access and sealing of juvenile records, and statutory access to criminal history record information. Chapter 55 of the Texas Code of Criminal Procedure contains provisions for the expunction of arrest records, court records and criminal history record information. The statute specifically details the requirements and procedures to properly expunge records in Texas."}, {"url": "http://www.wikihow.com/Access-Criminal-Court-Records", "passage_text": "Most criminal court records are part of the public record, so you can request them from local, state, or national agencies. Note that in many states (eg California), regular citizens can't request someone’s entire criminal record. Once you locate a listing for the criminal record you want, click the link to see the record itself. Note that even if your state or county has digital records, they may still be in the middle of converting their files."}, {"url": "http://oag.ca.gov/fingerprints/security", "passage_text": "Mail the completed form, along with a copy of your criminal history record, to the address indicated on the form. Your challenge must specifically state the basis for the claim of inaccuracy or incompleteness and include any available proof or corroboration to substantiate your claim. Print out the Application to Obtain copy of State Summary Criminal History Record (Form BCIA 8705, pdf) and follow the instructions on the form. A Spanish version of this form is also available (Form BCIA 8705S, pdf)"}, {"url": "http://www.pacefirm.com/faq/expunction.html", "passage_text": "You can get a copy of your official criminal history from the Texas Department of Public Safety (DPS). In Austin, you can expedite the process by going directly to the DPS office on Denson Drive. If your DPS criminal history is clean they will provide a certified letter stating that you have “No record on file”. If you were arrested but were not convicted, you may be eligible for an expunction, which deletes and destroys all records of the arrest. If you successfully completed deferred adjudication probation, you may be eligible for non-disclosure, which seals the records from the general public."}]