[{"url": "http://www.goodtherapy.org/drugs/seroquel-quetiapine.html", "passage_text": "Seroquel, also known by its generic name quetiapine, is an atypical antipsychotic medication that blocks dopaminergic transmissions, resulting in less overall excitement in the brain. It is a prescription-only medicine and cannot be obtained over the counter."}, {"url": "http://www.everydayhealth.com/drugs/quetiapine", "passage_text": "Seroquel is the brand name of the generic drug q uetiapine, a prescription drug used to treat schizophrenia and bipolar disorder (formerly called manic-depression). Seroquel changes the levels of neurotransmitters (naturally occurring brain substances) including serotonin and dopamine."}, {"url": "https://www.nami.org/Learn-More/Treatment/Mental-Health-Medications/Quetiapine-%28Seroquel%29", "passage_text": "Quetiapine is a medication that works in the brain to treat schizophrenia. It is also known as a second generation antipsychotic (SGA) or atypical antipsychotic. Quetiapine rebalances dopamine and serotonin to improve thinking, mood, and behavior. Symptoms of schizophrenia include:"}, {"url": "http://www.rxlist.com/seroquel-side-effects-drug-center.htm", "passage_text": "Seroquel (quetiapine) is a psychotropic medication used to treat schizophrenia in adults and children who are at least 13 years old. Seroquel is also used in the treatment of major depression and bipolar disorder."}, {"url": "http://www.webmd.com/drugs/2/drug-4718/seroquel-oral/details", "passage_text": "Quetiapine is used to treat certain mental/ mood disorders (such as schizophrenia, bipolar disorder, sudden episodes of mania or depression associated with bipolar disorder). Drugs used to treat depression can help prevent suicidal thoughts/attempts and provide other important benefits."}, {"url": "http://bipolar-disorder.emedtv.com/seroquel/seroquel.html", "passage_text": "Seroquel belongs to a group of medications called atypical (or second-generation) antipsychotic medications. It is not entirely known how Seroquel works in the treatment of schizophrenia or bipolar disorder. However, it is known that the medication blocks or lessens the effects of several chemicals in the brain."}]