[{"url": "http://www.mamapedia.com/article/can-you-freeze-corned-beef", "passage_text": "L., Freezing a corned beef is easy. If you are going to use the corned beef within 2 or 3 months, and the if the package has no rips or tears, you can freeze it right in the package from the store. Just thaw it in the fridge for 2-3 days. If you want to freeze it longer than 2 or 3 months, that's ok too."}, {"url": "http://www.fsis.usda.gov/wps/wcm/connect/c5b2af53-6493-4fa9-a4f1-6eac0f46d1ad/Corned_Beef_and_Food_Safety.pdf?MOD=AJPERES", "passage_text": "Place the beef in small, shallow containers and cool it in the refrigerator quickly. Any corned beef left over from a meal should be refrigerated promptly-within 2 hours of cooking or reheating. Use cooked-ahead or leftover corned beef within 3 to 4 days or freeze 2 to 3 months."}, {"url": "http://www.answers.com/Q/How_long_can_you_keep_corned_beef", "passage_text": "Beef can be frozen for 1 year, and even longer if stored in a deep freeze (0 degrees or lower) A deep freeze is a freezer with no automatic defroster."}, {"url": "http://www.answers.com/Q/How_long_can_you_freeze_corned_beef", "passage_text": "the USDA says you can freeze uncooked corned beef for up to 1 month (drain the liquid first) or cooked corned beef for 2 to 3 months."}, {"url": "http://askkaren.custhelp.com/app/answers/detail/a_id/472/~/how-long-can-you-store-corned-beef%3F", "passage_text": "Drained and well wrapped, an uncooked corned beef brisket may be frozen for one month for best quality. The flavor and texture will diminish with prolonged freezing but the product is still safe. After cooking, corned beef may be refrigerated for about 3 to 4 days and frozen for about 2 to 3 months."}, {"url": "http://www.answers.com/Q/How_long_can_you_keep_corned_beef", "passage_text": "Beef tends to toughen the longer you keep it in the freezer, so have that in mind with what you want to use it for. Hamburgers, for example, are best with the freshest beef you can use, while taco meat, or other dishes where you break up the meat while cooking, is not as bad with old frozen meat."}, {"url": "http://www.answers.com/Q/How_long_can_you_keep_corned_beef", "passage_text": "the USDA says you can freeze uncooked corned beef for up to 1 month (drain the liquid first) or cooked corned beef for 2 to 3 months."}]