[{"url": "http://work.chron.com/interior-decorators-paid-9357.html", "passage_text": "The median salary reported was $47,620, and the median-earning 50 percent of interior designers made between $35,320 and $65,960 per year. The highest paid 10 percent of interior designers made $86,430 or more each year. As of 2011, over one-third of interior designers working in the United States worked in specialized design services, earning an average of $52,870 per year. As of 2011, interior designers in the Northeast and West enjoyed the highest average salaries in the country. The District of Columbia reported the very highest average income, $76,020. Connecticut ranked second at $67,390, followed by New York at $65,540 and Rhode Island at $62,520."}, {"url": "http://www.theartcareerproject.com/get-the-inside-scoop-on-an-interior-design-career/113/", "passage_text": "Since most clients also have strict budgets, an interior designer must also be able to manage money very well. An average salary for an interior designer is usually between $40,000 and $50,000 per year. Interior designer salaries can vary quite a bit, however, depending on a number of factors. Generally, designers in large cities will make more than those in less populated areas. "}, {"url": "http://www.houzz.com/ideabooks/3293842/list/How-to-Work-With-an-Interior-Designer/", "passage_text": "What it will cost: Interior designers have various fee structures. They might charge an hourly rate (anywhere from $50 to $500); a flat fee, which could be as low as several thousand dollars and as high as five figures; or a percentage of total project costs. You may also be asked to pay a retainer before work begins. "}, {"url": "http://work.chron.com/interior-decorators-paid-9357.html", "passage_text": "National Income Statistics. The Bureau of Labor Statistics estimates that the roughly 40,950 interior designers working in the United States as of May 2011 earned an average of $25.39 an hour and $52,810 per year. As of 2011, interior designers in the Northeast and West enjoyed the highest average salaries in the country. The District of Columbia reported the very highest average income, $76,020. Connecticut ranked second at $67,390, followed by New York at $65,540 and Rhode Island at $62,520."}, {"url": "http://www.improvenet.com/r/costs-and-prices/interior-designer-cost", "passage_text": "Hourly Costs of Interior Designers. There are two different ways to hire interior designers, and the most common is an hourly wage. This may incur prices of $50 or more per hour, but it allows the homeowner to end the agreement whenever they want to depending on their budget or their total satisfaction with the project."}, {"url": "http://www.ehow.com/about_4672398_much-interior-designer-make_.html", "passage_text": "Work Settings With Potential. Though the lowest-paid 10 percent of interior designers earned less than $26,000 a year, usually because they were self-employed or paid on commission in retail, the top 10 percent of interior designers earned more than three times as much. "}, {"url": "http://www.payscale.com/research/US/Job=Interior_Designer/Salary", "passage_text": "Interior Designer Salary. (United States). Compared to the national salary average for Interior Designers, those in the same line of work who choose to work for Self-Employed enjoy much larger paychecks — $104K on average versus $43K per year."}, {"url": "http://www.loridennis.com/greenblog/2012/01/how-much-do-interior-designers-cost/", "passage_text": "3. HOURLY RATE. The most simple of all ways to pay an interior, this rate structure works best for smaller projects with limited amount of time required for completion. Rates can run from $50 per hour for a student to $1,500 per hour. I like to use this structure when my clients only need a little bit of my time. 4. SQUARE FOOTAGE. This fee structure takes into account the amount of square feet that will be covered on a project. For example a 10,000 square foot property with 6,000 square feet of exterior space that is being billed at $6 per square foot, would have an interior design fee of $96,000."}, {"url": "http://work.chron.com/much-interior-designer-make-6107.html", "passage_text": "Salary Range. The Bureau of Labor Statistics reports that interior designers earned $52,810 on average in May 2011. Workers in the occupation earned an average wage of $25.39 an hour. The top 10 percent of workers made more than $86,430 a year, while the bottom 10 percent earned less than $25,720. Half of all interior designers had annual incomes between $35,320 and $65,960"}]