[{"url": "https://answers.yahoo.com/question/index?qid=20070515065627AAESxPX", "passage_text": "Best Answer: Amateur bouts are 2 minute rounds, and a 1 minute break. Pro bouts are 3 minute rounds, and a 1 minute break. For amateurs the rounds are 2 minutes with a 1 minute break but for pros the rounds are 3 minutes with a 1 minute or 30 second break depending on the fight. Grasshopper · 9 years ago. Thumbs up. 0"}, {"url": "https://answers.yahoo.com/question/index?qid=20070503152833AAhCExO", "passage_text": "· just now. Report Abuse. depends on if it's amateur or professional. amateur bouts are 3 rounds, pro bouts start out at 4 rounds and increase depending on how many fights the fighters have. all rounds are 3 minutes each. sunrise · 9 years ago. Thumbs up. Report Abuse. depending on the weight class, it can last for as long as 12 rounds and 3 minutes per round... for the heavier weight classes, it's 10, 3-minute rounds..."}, {"url": "https://en.wikipedia.org/wiki/The_distance_(boxing)", "passage_text": "For amateur boxing, the Amateur Boxing Association of England set rules for the length of a match when it was formed in 1880. Initially there were three rounds of 3 minutes with a break of 1 minute between them. In the early days of bare-knuckle boxing, there was no limit on the number of rounds and so matches would be fought to a conclusion (i.e. with a knockout or tap out). For example, the match between Simon Byrne and James 'Deaf' Burke in 1833 lasted 3¼ hours."}, {"url": "https://answers.yahoo.com/question/index?qid=20070503152833AAhCExO", "passage_text": "Best Answer: A boxing match is 12 rounds that last 3 min long. There are one min in between each round. So with 0 commericalls it would be 12*3+12 which equals 48min. Report Abuse. depending on the weight class, it can last for as long as 12 rounds and 3 minutes per round... for the heavier weight classes, it's 10, 3-minute rounds..."}, {"url": "https://en.wikipedia.org/wiki/The_distance_(boxing)", "passage_text": "If a match goes longer than 20 minutes without a knockout or other decision, then it is either a draw or a decision on points. In title fights, this is called  the championship distance , which today usually means 12 rounds (See history section), though there were some ten-round championship matches. In the early days of bare-knuckle boxing, there was no limit on the number of rounds and so matches would be fought to a conclusion (i.e. with a knockout or tap out). For example, the match between Simon Byrne and James 'Deaf' Burke in 1833 lasted 3¼ hours."}, {"url": "http://www.mademan.com/mm/how-long-are-boxing-matches.html", "passage_text": "Amateur boxing matches in the Olympics have three rounds and they last three minutes, but in the ABA (Amateur Boxing Association) they are three rounds that are two minutes in duration. In professional boxing, there are twelve rounds that are three minutes in duration. Boxing matches used to have fifteen rounds, but this rule was changed after the Ray Mancini-Duu Koo Kim bout that took place on November 13 th, 1982. "}, {"url": "http://www.funtrivia.com/askft/Question111798.html", "passage_text": "A boxing match typically consists of a predetermined number of three-minute rounds, a total of up to 12 rounds (formerly 15). A minute is typically spent between each round with the fighters in their assigned corners receiving advice and attention from their coach and staff. http://en.wikipedia.org/wiki/Boxing. "}, {"url": "http://www.answers.com/Q/How_long_does_a_championship_boxing_match_last_for", "passage_text": "However, it is very common for one game of 21 to last for about 15-25 minutes... the tot … al match (of 3 games) lasts about 45 to 75 minutes. I dont know what is the longest duration of any match played in the history, but an hour long match is a typical for a 3 game-long match. "}, {"url": "http://www.answers.com/Q/How_long_does_a_15_round_boxing_match_take_to_complete", "passage_text": "How long is a round in boxing? The length of a professional boxing round for men is 3 mins and  women are 2 mins. The length of an amature boxing round is 2 min  for boys or men with under 10 fights and 3 … min rounds for boys or  men over 10 fights. Girls and younger kids are 1 and a half mins a  round. 8 people found this useful."}]