[{"url": "http://www.payscale.com/research/US/Job=Daycare_Director/Salary", "passage_text": "Daycare Directors in the United States are largely women. The group as a whole has a nationwide average of $33K annually for pay. Pay generally varies between $20K and $46K per year. Residence is the biggest factor affecting pay for this group, followed by career duration. Slightly less than a third enjoy medical while just over one in five get dental coverage. Median of all compensation (including tips, bonus, and overtime) by years of experience. Experience and pay tend to be weakly linked for Daycare Directors — those with more experience do not necessarily bring in higher earnings."}, {"url": "http://health.mo.gov/safety/childcare/director.php", "passage_text": "Child care directors must meet qualifications as stated in Rule 19 CSR 30-62.102(2) (A) 2. The information below explains the process for Director Certification and Facility Director Approval. Becoming an approved director at a facility is a two-step process: STEP 1: An individual applies for Director Certification. "}, {"url": "http://www.payscale.com/research/US/Job=Daycare_Director/Salary", "passage_text": "It is the job of the daycare director to ensure that these expectations are met in a safe and nurturing environment. As an administrator, the daycare director interviews and hires teachers for the center. They assist with any training and offer frequent performance evaluations. Median of all compensation (including tips, bonus, and overtime) by years of experience. Experience and pay tend to be weakly linked for Daycare Directors — those with more experience do not necessarily bring in higher earnings."}, {"url": "http://www.ownadaycare.com/blog/staffing-a-daycare-center", "passage_text": "Preschool teachers comprise the largest number of workers in the child daycare business, accounting for almost 32 percent of the workforce. A preschool teacher is an early educator who teaches children from infancy to age 5, the period covered by early child education. They also take charge of other functions such as budgeting, staffing, and the day-to-day supervision of the staff. In most states, a daycare director/administrator must have a college degree, accompanied with experience in a child care facility and training in early childhood development. Preschool teachers."}, {"url": "https://www.berkeleyparentsnetwork.org/advice/childcare/daycaregift", "passage_text": "Our child is in a small home-based daycare on a part time schedule, a couple of days a week. The daycare will be closed for 2 weeks over the holidays and they would like us to pay them our regular rate for the weeks they are closed. She was extremely appreciative. So this year I plan to get a gift AND STILL the $100. Do the math-helps her holidays. There is only one person at my daycare, but if there were an assistant I would plan to give some smaller amount."}, {"url": "http://www.payscale.com/research/US/Job=Assistant_Director%2c_Child_Care/Hourly_Rate", "passage_text": "Assistant Director, Child Care Salary. (United States). The larger portion of Assistant Child Care Directors in the United States are women. Median pay in this female-dominated area goes for around $12.33 per hour. Earnings sit near $9.09 per hour on the lower side but can approach $16.81 on the higher side. "}, {"url": "http://www.humanservices.alberta.ca/documents/accreditation-guide-daycare-programs.pdf", "passage_text": "Funding is paid to a monthly maximum of 181 direct child care hours (or administrative hours for program/alternate supervisors). For those staff who work in both day care and out-of-school programs, the monthly maximum is 181 cumulative child care hours for day care and out-of-school care combined. NOTE: Under Federal and Provincial law, the Staff Support Funding Grant (wage top-up) paid to child care programs is considered a “wage”. Licensed pre-accredited and accredited day care programs. Q. How do I apply for the allowance?A. Day care programs must submit an updated Accreditation Funding Grant Application and Supplementary Form C to the Alberta Child Care Accreditation Funding Program within 60 days of the new employee’s commencement."}, {"url": "http://www.salary.com/advice/layouthtmls/advl_display_Cat14_Ser69_Par147.html", "passage_text": "If you know how well the CEO is compensated, you can get a sense for how generous the company is likely to be toward other employees as well. CEOs make most of their money through incentives As a general rule, base salary accounts for just 20 percent of a CEO's pay. The other 80 percent comes from performance-based pay. 1  Base pay for the core role and responsibilities of the day-to-day running of the organization. The degree to which your company is a success may be answered in the annual and long-term incentive payout columns in the summary compensation table. If you see large bonus payments, then it is likely that your company is successful. Stock option grants and gains are also important to look at."}]