[{"url": "http://www.thefreedictionary.com/peninsula", "passage_text": "Noun. 1. peninsula-a large mass of land projecting into a body of water. dry land, ground, solid ground, terra firma, earth, land-the solid part of the earth's surface; the plane turned away from the sea and moved back over land; the earth shook for several minutes; he dropped the logs on the ground. 1. (Physical Geography) a narrow strip of land projecting into a sea or lake from the mainland. [C16: from Latin, literally: almost an island, from paene pene- + insula island]. Usage: The noun peninsula is sometimes confused with the adjective peninsular: the Iberian peninsula (not peninsular)."}, {"url": "https://en.wikipedia.org/wiki/Peninsula", "passage_text": "A peninsula can also be a headland, cape, island promontory, bill, point, or spit. A point is generally considered a tapering piece of land projecting into a body of water that is less prominent than a cape. In English, the plural of peninsula is peninsulas or, less commonly, peninsulae. Florida is a well-known example of a large peninsula, with its land area divided between the larger Florida peninsula and the smaller Florida panhandle on the north and west. It has several smaller peninsulas within it:"}, {"url": "http://www.yourdictionary.com/peninsula", "passage_text": "noun. The Iberian Peninsula. The Iberian Peninsula. The definition of a peninsula is an area of land surrounded by water on three sides. An example of a peninsula is the Iberian Peninsula. "}, {"url": "http://www.merriam-webster.com/dictionary/peninsula", "passage_text": "Full Definition of PENINSULA. : a portion of land nearly surrounded by water and connected with a larger body by an isthmus; also: a piece of land jutting out into the water whether with or without a well-defined isthmus. — pen·in·su·lar \\-s(ə-)lər, -shə-lər\\ adjective. See peninsula defined for English-language learners"}, {"url": "http://whyzz.com/what-is-a-peninsula", "passage_text": "Florida is a peninsula, or a piece of land surrounded by water on three sides ! A peninsula sticks out into the water while still being connected to a larger section of land. Sometimes a peninsula is connected to this larger piece of land by a skinny strip of land called an isthmus. Because a peninsula is not surrounded by water on all sides, it’s not an island. In fact, its name is taken from the Latin “paene” and “insula” which together mean “almost an island.”. Now it’s your turn to create a peninsula! Use a blue piece of construction paper as a mat, then flatten a piece of clay or craft dough on top of it. Mold the clay or dough into a body of land. For ideas, look at a real map and see if you can copy the shapes by making your own clay and construction paper map."}, {"url": "http://www.answers.com/Q/What_is_peninsula_means", "passage_text": "Confidence votes 38. A peninsula a piece of land that has three sides of it surrounded by land. Another answer: What the above writer meant was that a peninsula is a peice of land that has three sides surrounded by water. Actually, a peninsula is a area of land nearly surrounded by water but also has a section that is attached to a mainland by an isthmus. Florida is a peninsula, Hawaii is not because it is completely surrounded by water and is therefore an island. for example: Hawaii is a peninsula-+."}, {"url": "http://kids.britannica.com/comptons/article-9276348/peninsula", "passage_text": "A body of land surrounded by water on three sides is called a peninsula. The word comes from the Latin paene insula, meaning almost an island. In the United States Florida is the most obvious peninsula. Alaska also fits the definition, though it is very large and has a number of its own peninsulas. On the East coast the Delmarva Peninsula (named after Delaware, Maryland, peninsula..."}, {"url": "https://en.wikipedia.org/wiki/Peninsula", "passage_text": "A peninsula (Latin: paeninsula from paene almost and insula island) is a piece of land that is bordered by water on three sides but connected to mainland. The surrounding water is usually understood to belong to a single contiguous body, but is not always explicitly defined as such. Florida is a well-known example of a large peninsula, with its land area divided between the larger Florida peninsula and the smaller Florida panhandle on the north and west. It has several smaller peninsulas within it:"}]