[{"url": "http://www.worldvision.org/about-us/who-we-are", "passage_text": "Who We Are. World Vision is a Christian humanitarian organization dedicated to working with children, families, and their communities worldwide to reach their full potential by tackling the causes of poverty and injustice. World Vision is an international partnership of Christians whose mission is to follow our Lord and Savior Jesus Christ in working with the poor and oppressed to promote human transformation, seek justice, and bear witness to the good news of the Kingdom of God."}, {"url": "http://blog.worldvision.org/conversations/world-visions-approach-to-community-development/", "passage_text": "1. World Vision’s core mission is to focus intentionally on the well-being of children. By partnering closely with local community groups, churches, families, and children themselves, we address root causes of poverty that directly impact children, especially the most vulnerable. World Vision sponsorship is designed toward our belief that the most effective way to provide for a child is to address issues at the community level to improve the situation for all children and to reflect God’s love as we serve."}, {"url": "http://www.worldvision.ca/ABOUTUS", "passage_text": "Page Content. World Vision's history begins in 1947, with our founder Dr. Bob Pierce. Today, World Vision is a Christian relief, development, and advocacy organization working to create lasting change in the lives of children, families, and communities to overcome poverty and injustice. Inspired by our Christian values, World Vision is dedicated to working with the world’s most vulnerable people regardless of religion, race, ethnicity, or gender. Browse through our Annual Report, learn about our core values, meet our president and board of directors."}, {"url": "http://www.answers.com/Q/What_is_the_role_of_world_vision", "passage_text": "Split and merge into it. Answered by The Community. Making the world better, one answer at a time. World Vision is a Christian relief and development agency dedicated to helping children and their communities worldwide reach their full potential by tackling the causes of poverty. World Vision aims to 'serve Christ by engaging people and transform lives by alleviating poverty and confronting its causes'. Their mission as stated on their website is '... … to be a Christian organisation that engages people to eliminate poverty and"}, {"url": "http://www.answers.com/Q/What_is_the_role_of_world_vision", "passage_text": "From the World Vision website    World Vision is a Christian relief, development and advocacy organisation dedicated to working with children, families and communi … ties to overcome poverty and injustice.     This qualifies it as an NGO. World Vision aims to 'serve Christ by engaging people and transform lives by alleviating poverty and confronting its causes'. Their mission as stated on their website is '... … to be a Christian organisation that engages people to eliminate poverty and"}, {"url": "https://en.wikipedia.org/wiki/World_Vision_International", "passage_text": "World Vision International is an Evangelical Christian humanitarian aid, development, and advocacy organization. It was founded in 1950 by Robert Pierce as a service organization to meet the emergency needs of missionaries. In 1975 development work was added to World Visions objectives. Today it is headquartered in Monrovia, California, in the same building as World Vision Inc. Mooneyham served as president of World Vision International until 1982 when he resigned after criticism within the International Board related to management style."}, {"url": "http://www.wvi.org/board-directors", "passage_text": "The World Vision International Board is the ultimate governing body for the World Vision Partnership. It has two major responsibilities: 1  Ensuring the overall health and well-being of the Partnership. Tweet. The World Vision International Board consists of 24 directors. With the exception of the international president, all directors including the chair are non-executives (i.e. they are volunteers who are not compensated for their service on the board). Directors are elected by regional forums."}, {"url": "http://blog.worldvision.org/conversations/world-visions-approach-to-community-development/", "passage_text": "ADP is World Vision’s acronym for Area Development Program. It is a distinct geographical area where we partner with local stakeholders to improve the well-being of children through multiple sector projects aimed at root causes of issues that negatively impact children. World Vision sponsorship is designed toward our belief that the most effective way to provide for a child is to address issues at the community level to improve the situation for all children and to reflect God’s love as we serve."}]