[{"url": "http://www.answers.com/Q/Meiosis_is_a_process_that_produces_what", "passage_text": "Meiosis is a process that produces reproductive cells. At the end of meiosis there are four sex cells each with a complete, but single, set of 23 chromosomes. "}, {"url": "https://en.wikipedia.org/wiki/Meiosis", "passage_text": "Meiosis produces haploid gametes with one set of 23 chromosomes. When two gametes (an egg and a sperm) fuse, the resulting zygote is once again diploid, with the mother and father each contributing 23 chromosomes. This same pattern, but not the same number of chromosomes, occurs in all organisms that utilize meiosis."}, {"url": "http://www.answers.com/Q/Meiosis_is_a_division_process_that_produces", "passage_text": "Meiosis is a division process that produces four daughter cells each containing haploid number of chromosomes. Confidence votes 5.0K. Meiosis is a division process that produces four daughter cells each containing haploid number of chromosomes. In humans, as well as a variety of other mammals, meiosis is responsible for the production of gametes (also called germ line cells or sex cells)."}, {"url": "http://www2.estrellamountain.edu/faculty/farabee/biobk/BioBookmeiosis.html", "passage_text": "Meiosis produces 4 haploid cells. Mitosis produces 2 diploid cells. The old name for meiosis was reduction/ division. Meiosis I reduces the ploidy level from 2n to n (reduction) while Meiosis II divides the remaining set of chromosomes in a mitosis-like process (division). Most of the differences between the processes occur during Meiosis I. Meiosis is a special type of nuclear division which segregates one copy of each homologous chromosome into each new gamete. Mitosis maintains the cell's original ploidy level (for example, one diploid 2n cell producing two diploid 2n cells; one haploid n cell producing two haploid n cells; etc.)."}, {"url": "http://www.nature.com/scitable/definition/meiosis-88", "passage_text": "Meiosis has both similarities to and differences from mitosis, which is a cell division process in which a parent cell produces two identical daughter cells. Meiosis begins following one round of DNA replication in cells in the male or female sex organs. The process is split into meiosis I and meiosis II, and both meiotic divisions have multiple phases. Meiosis I is a type of cell division unique to germ cells, while meiosis II is similar to mitosis."}, {"url": "http://www.nature.com/scitable/definition/meiosis-88", "passage_text": "Meiosis is a type of cell division that reduces the number of chromosomes in the parent cell by half and produces four gamete cells. This process is required to produce egg and sperm cells for sexual reproduction. During reproduction, when the sperm and egg unite to form a single cell, the number of chromosomes is restored in the offspring. Meiosis begins with a parent cell that is diploid, meaning it has two copies of each chromosome. Meiosis begins following one round of DNA replication in cells in the male or female sex organs. The process is split into meiosis I and meiosis II, and both meiotic divisions have multiple phases. Meiosis I is a type of cell division unique to germ cells, while meiosis II is similar to mitosis."}, {"url": "https://en.wikipedia.org/wiki/Meiosis", "passage_text": "Meiosis /maɪˈoʊsɨs/ is a specialized type of cell division which reduces the chromosome number by half. This process occurs in all sexually reproducing single-celled and multi-celled eukaryotes, including animals, plants, and fungi. When two gametes (an egg and a sperm) fuse, the resulting zygote is once again diploid, with the mother and father each contributing 23 chromosomes. This same pattern, but not the same number of chromosomes, occurs in all organisms that utilize meiosis."}, {"url": "http://www.nature.com/scitable/definition/meiosis-88", "passage_text": "Meiosis II is a mitotic division of each of the haploid cells produced in meiosis I. During prophase II, the chromosomes condense, and a new set of spindle fibers forms. Meiosis begins following one round of DNA replication in cells in the male or female sex organs. The process is split into meiosis I and meiosis II, and both meiotic divisions have multiple phases. Meiosis I is a type of cell division unique to germ cells, while meiosis II is similar to mitosis."}, {"url": "http://www.yourgenome.org/facts/what-is-meiosis", "passage_text": "Meiosis is a process where a single cell divides twice to produce four cells containing half the original amount of genetic information. These cells are our sex cells – sperm in males, eggs in females. 1  During meiosis one cell divides twice to form four daughter cells. 2  These four daughter cells only have half the number of chromosomes of the parent cell – they are haploid. 3  Meiosis produces our sex cells or gametes (eggs in females and sperm in males)."}, {"url": "https://en.wikipedia.org/wiki/Meiosis", "passage_text": "In meiosis, DNA replication is followed by two rounds of cell division to produce four daughter cells each with half the number of chromosomes as the original parent cell. When two gametes (an egg and a sperm) fuse, the resulting zygote is once again diploid, with the mother and father each contributing 23 chromosomes. This same pattern, but not the same number of chromosomes, occurs in all organisms that utilize meiosis."}]