[{"url": "http://www.abbreviations.com/NORE", "passage_text": "The Nore is a sandbank at the mouth of the Thames Estuary, England. It marks the point where the River Thames meets the North Sea, roughly halfway between Havengore Creek in Essex and Warden Point in Kent. Until 1964 it marked the seaward limit of the Port of London Authority. As the sandbank was a major hazard for shipping coming in and out of London, in 1732 it received the world's first lightship. This became a major landmark, and was used as an assembly point for shipping. Today it is marked by Sea Reach No. 1 Buoy."}, {"url": "http://www.babynamespedia.com/meaning/Nore", "passage_text": "Nore is primarily used in English, and its language of origin is Old Provencal provençal And. Japanese nore is a diminutive form of The english Name. Eleanor nore is also a form of The japanese Name. Nori nore is uncommon as a baby name for. Girls it is not in the top 1000. names Nore is a diminutive form of the English name Eleanor. Nore is also a form of the Japanese name Nori. Nore is uncommon as a baby name for girls. It is not in the top 1000 names."}, {"url": "http://www.thinkbabynames.com/meaning/0/Nore", "passage_text": "Nore /nore/ [1 syll.] as a name for girls is of Old French and Old German derivation, and Nore means other, foreign. Nore is a version of Eleanor (Old French, Old German). Compare surname Norr. Kreatif forms: Naure, Nire, Nonre. Similar Names. Nore is alike in pronunciation to Noor, Nour and Nur. Other suggested similar baby names are Dore, Kore, Nari, Nera, Nira, Noe, Noora, Norm, Norne, Norry, Noura, Nura, Nuru and Nyree. Like Nore, these names are not commonly used."}, {"url": "http://www.thinkbabynames.com/meaning/0/Nore", "passage_text": "Popular varying forms of Nore (unlisted) listed in the Top 1000 are Ella (#17 a year ago) , Nora (#49) , Ellie (#55) , Eleanor (#78) , Norah (#163) , Lena (#279) , Elle (#395) , Helen (#404) , Ellen (#656) , Lina (#767) , Nelda, Nell, Nelly, Nellie, Nelle, Lenora, Elna, Elinore, Elnora, Aline, Leonore, Lenore and Leora. Similar Names. Nore is alike in pronunciation to Noor, Nour and Nur. Other suggested similar baby names are Dore, Kore, Nari, Nera, Nira, Noe, Noora, Norm, Norne, Norry, Noura, Nura, Nuru and Nyree. Like Nore, these names are not commonly used."}, {"url": "http://www.definitions.net/definition/NORE", "passage_text": "Nore. The Nore is a sandbank at the mouth of the Thames Estuary, England. It marks the point where the River Thames meets the North Sea, roughly halfway between Havengore Creek in Essex and Warden Point in Kent. Until 1964 it marked the seaward limit of the Port of London Authority. As the sandbank was a major hazard for shipping coming in and out of London, in 1732 it received the world's first lightship. This became a major landmark, and was used as an assembly point for shipping. Today it is marked by Sea Reach No. 1 Buoy."}, {"url": "http://www.sheknows.com/baby-names/name/nora", "passage_text": "The name Nora is a Greek baby name. In Greek the meaning of the name Nora is: Light. Hebrew Meaning: The name Nora is a Hebrew baby name. In Hebrew the meaning of the name Nora is: Light. Latin Meaning: The name Nora is a Latin baby name. In Latin the meaning of the name Nora is: Honour. English Meaning: The name Nora is an English baby name. In English the meaning of the name Nora is: Abbreviation of Eleanora 'light' and Honora 'honor. '. French Meaning: The name Nora is a French baby name. In French the meaning of the name Nora is: A, derived from the Greek Helen."}, {"url": "http://www.thinkbabynames.com/meaning/0/Nore", "passage_text": "Nore is an uncommon first name for women but a very popular last name for all people (#60557 out of 150436, Top 40%). Similar Names. Nore is alike in pronunciation to Noor, Nour and Nur. Other suggested similar baby names are Dore, Kore, Nari, Nera, Nira, Noe, Noora, Norm, Norne, Norry, Noura, Nura, Nuru and Nyree. Like Nore, these names are not commonly used."}, {"url": "http://www.babynamespedia.com/meaning/Nore", "passage_text": "[ syll. no-re, nor-e ] The baby girl name Nore is pronounced as N AO R- †. Nore is primarily used in English, and its language of origin is Old Provencal provençal And. Japanese nore is a diminutive form of The english Name. Eleanor nore is also a form of The japanese Name. Nori nore is uncommon as a baby name for. girls Nore is a diminutive form of the English name Eleanor. Nore is also a form of the Japanese name Nori. Nore is uncommon as a baby name for girls. It is not in the top 1000 names."}]