[{"url": "http://www.answers.com/Q/What_is_DNA_polymerase_and_how_does_it_function", "passage_text": "DNA polymerase III (not DNA polymerase) is an enzyme that works in association with other enzymes during the replication of a DNA molecule. DNA replication begins when the enzyme, known as helicase unwinds a DNA strand. Helicase unwinds a DNA strand, thus, in the process, separating the two DNA templates. DNA polymerase III can attach a nucleotide only to the 3 prime end of an existing nucleotide sequence. Once a primer is assembled by primase, DNA polymerase III begins its work of adding nucleotides to the 3 prime end of the primer."}, {"url": "https://en.wikipedia.org/wiki/DNA_polymerase", "passage_text": "The DNA polymerases are enzymes that create DNA molecules by assembling nucleotides, the building blocks of DNA. These enzymes are essential to DNA replication and usually work in pairs to create two identical DNA strands from a single original DNA molecule. When creating DNA, DNA polymerase can add free nucleotides only to the 3' end of the newly forming strand. This results in elongation of the newly forming strand in a 5'-3' direction."}, {"url": "https://www.ndsu.edu/pubweb/~mcclean/plsc431/eukarychrom/eukaryo2.htm", "passage_text": "The second two activities of DNA Pol I are important for replication, but DNA Polymerase III (Pol III) is the enzyme that performs the 5'-3' polymerase function. 1  Primase-The requirement for a free 3' hydroxyl group is fulfilled by the RNA primers that are synthesized at the initiation sites by these enzymes. DNA Polymerase-DNA Polymerase I (Pol I) was the first enzyme discovered with polymerase activity, and it is the best characterized enzyme. Although this was the first enzyme to be discovered that had the required polymerase activities, it is not the primary enzyme involved with bacterial DNA replication."}, {"url": "https://en.wikipedia.org/wiki/DNA_polymerase", "passage_text": "DNA polymerase III holoenzyme is the primary enzyme involved in DNA replication in E. coli and belongs to Family C polymerases. It consists of three assemblies: the pol III core, the beta sliding clamp processivity factor and the clamp-loading complex. When creating DNA, DNA polymerase can add free nucleotides only to the 3' end of the newly forming strand. This results in elongation of the newly forming strand in a 5'-3' direction."}, {"url": "http://www.worthington-biochem.com/DNAECI/default.html", "passage_text": "DNA polymerase II also functions in editing and proofreading mainly in the lagging strand (Kim et al. 1997, Wagner and Nohmi 2000). DNA polymerase III is the main replicative enzyme. DNA polymerase IV and V have large active sites that allow for more base misincorporation, and are therefore more error-prone. The new chain is base-paired with the template, and the new chain and template are antiparallel. DNA polymerase I is the most abundant polymerase and functions to fill gaps in DNA that arise during DNA replication, repair, and recombination. History: DNA polymerase I was discovered by Arthur Kornberg et al. in 1956."}, {"url": "https://en.wikipedia.org/wiki/DNA_polymerase_II", "passage_text": "For the RNA Polymerase, see RNA polymerase II. DNA polymerase II (also known as DNA Pol II or Pol II) is a prokaryotic DNA-Dependent DNA polymerase encoded by the PolB gene. DNA Polymerase II is an 89.9-kDa protein and is a member of the B family of DNA polymerases. It was originally isolated by Thomas Kornberg in 1970, and characterized over the next few years. DNA Pol II is not the most studied polymerase so there are many proposed functions of this enzyme which are all likely functions but are ultimately unconfirmed. These are: repair of DNA damaged by UV irradiation, replication restart in UV-irradiated E. coli, adaptive mutagenesis, and long-term survival."}, {"url": "http://www.worthington-biochem.com/DNAECI/default.html", "passage_text": "In 1970, DNA polymerase II of E. coli was isolated and characterized by Arthur Kornberg’s son, Thomas Kornberg (Kornberg and Gefter 1970). DNA polymerase II was also independently reported on by Knippers and by Moses and Richardson in 1970 (Moses and Richardson 1970b). The new chain is base-paired with the template, and the new chain and template are antiparallel. DNA polymerase I is the most abundant polymerase and functions to fill gaps in DNA that arise during DNA replication, repair, and recombination. History: DNA polymerase I was discovered by Arthur Kornberg et al. in 1956."}, {"url": "http://www.answers.com/Q/What_is_DNA_polymerase_and_how_does_it_function", "passage_text": "All these function with a DNA strand as template. Retroviruses possess a unique DNA polymerase (reverse transcriptase) that uses an RNA template. triphosphates. I, II and III are known in of growing   * Yes. DNA polymerases, like most enzymes, are proteins, and the code for their primary structure (their amino acid sequences) is included in the genome.       Yes, DNA does code for DNA polymerase. DNA polymerase III can attach a nucleotide only to the 3 prime end of an existing nucleotide sequence. Once a primer is assembled by primase, DNA polymerase III begins its work of adding nucleotides to the 3 prime end of the primer."}]