[{"url": "http://catalog.flatworldknowledge.com/bookhub/reader/5572?e=stengel_1.0-ch04_s02", "passage_text": "Another important distinction between short-run production and long-run production is in the firm’s ability to alter its capacity. In a decidedly short-run time frame, the firm’s capacity or point of lowest average cost is effectively fixed. 4.2 Long-Run Average Cost and Scale. In the last chapter, we distinguished short-run demand from long-run demand to reflect the range of options for consumers."}, {"url": "https://en.wikipedia.org/wiki/Cost_curve", "passage_text": "Average variable cost (which is a short-run concept) is the variable cost (typically labor cost) per unit of output: SRAVC = wL / Q where w is the wage rate, L is the quantity of labor used, and Q is the quantity of output produced. The marginal cost curve intersects both the average variable cost curve and (short-run) average total cost curve at their minimum points. When the marginal cost curve is above an average cost curve the average curve is rising."}, {"url": "http://www.investopedia.com/exam-guide/cfa-level-1/microeconomics/marginal-average-total-cost-curve.asp", "passage_text": "When economies of scale occur, the long-run average total cost (LRAC) curve will be declining; with diseconomies of scale, the LRAC curve will be rising. Figure 3.9: Long Run Average Total Curve. "}, {"url": "http://catalog.flatworldknowledge.com/bookhub/21?e=rittenberg-ch08_s03", "passage_text": "1 The long-run average cost (LRAC) curve is derived from the average total cost curves associated with different quantities of the factor that is fixed in the short run. 2  The LRAC curve shows the lowest cost per unit at which each quantity can be produced when all factors of production, including capital, are variable. A firm is said to experience economies of scaleSituation in which the long-run average cost declines as the firm expands its output. when"}, {"url": "http://catalog.flatworldknowledge.com/bookhub/reader/5572?e=stengel_1.0-ch04_s02", "passage_text": "Like short-run average cost curves, long-run average cost curves trend downward at low target production rates, although the rate of decline in the long-run average cost curve is somewhat flatter due to the ability to readjust all factors of production. 4.2 Long-Run Average Cost and Scale. In the last chapter, we distinguished short-run demand from long-run demand to reflect the range of options for consumers."}, {"url": "https://en.wikipedia.org/wiki/Long-run", "passage_text": "The long run is associated with the long-run average cost (LRAC) curve in microeconomic models along which a firm would minimize its average cost (cost per unit) for each respective long-run quantity of output. In long-run equilibrium of an industry in which perfect competition prevails, the LRMC = LRAC at the minimum LRAC and associated output. The shape of the long-run marginal and average costs curves is determined by returns to scale."}, {"url": "https://en.wikipedia.org/wiki/Cost_curve", "passage_text": "Given that LRAC is an average quantity, one must not confuse it with the long-run marginal cost curve, which is the cost of one more unit. The LRAC curve is created as an envelope of an infinite number of short-run average total cost curves, each based on a particular fixed level of capital usage. The marginal cost curve intersects both the average variable cost curve and (short-run) average total cost curve at their minimum points. When the marginal cost curve is above an average cost curve the average curve is rising."}, {"url": "http://catalog.flatworldknowledge.com/bookhub/21?e=rittenberg-ch08_s03", "passage_text": "The long-run average cost (LRAC) curveGraph showing the firms lowest cost per unit at each level of output, assuming that all factors of production are variable. shows the firm’s lowest cost per unit at each level of output, assuming that all factors of production are variable. A firm is said to experience economies of scaleSituation in which the long-run average cost declines as the firm expands its output. when"}, {"url": "http://www.whitenova.com/thinkEconomics/lrac.html", "passage_text": "The Long Run Average Cost, LRAC, curve of a firm shows the minimum or lowest average total cost at which a firm can produce any given level of output in the long run (when all inputs are variable). "}, {"url": "http://www.economicsconcepts.com/short_run_and_long_run_cost_curves.htm", "passage_text": "In the short run, the shape of the average total cost curve (ATC) is U-shaped. The, short run average cost curve falls in the beginning, reaches a minimum and then begins to rise. The reasons for the average cost to fall in the beginning of production are that the fixed factors of a firm remain the same. The change only takes place in the variable factors such as raw material, labor, etc. "}]