[{"url": "http://www.medicinenet.com/food_poisoning/related-conditions/index.htm", "passage_text": "Food Poisoning Related Diseases & Conditions. Medical conditions are often related to other diseases and conditions. Our doctors have compiled a list of ailments related to the topic of Food Poisoning. These conditions may be a cause or symptom of Food Poisoning or be a condition for which you may be at increased risk. Staph Infection (Staphylococcus Aureus) Staphylococcus or Staph is a group of bacteria that can cause a multitude of diseases. Staph infections can cause illness...learn more »."}, {"url": "https://en.wikipedia.org/wiki/Foodborne_illness", "passage_text": "Foodborne illness (also foodborne disease and colloquially referred to as food poisoning) is any illness resulting from the food spoilage of contaminated food, pathogenic bacteria, viruses, or parasites that contaminate food, as well as chemical or natural toxins such as poisonous mushrooms. "}, {"url": "http://www.mayoclinic.org/diseases-conditions/food-poisoning/basics/treatment/con-20031705", "passage_text": "Treatments and drugs. Treatment for food poisoning typically depends on the source of the illness, if known, and the severity of your symptoms. For most people, the illness resolves without treatment within a few days, though some types of food poisoning may last longer. Treatment of food poisoning may include: 1  Replacement of lost fluids. "}, {"url": "http://www.symptomfind.com/diseases-conditions/food-poisoning/", "passage_text": "Causes. The cause of most cases of food poisoning is pathogens. A pathogen is any living organism that can cause disease. This includes bacteria, viruses, and molds. The most common pathogens that cause foodborne illnesses are: 1  Salmonella – found in meats, eggs, milk and fresh fruits and vegetables. Each year, according to the Centers for Disease Control and Prevention, 1 in 6 Americans, or roughly 48 million people, are sickened as a result of food poisoning. More than 128,000 people require hospitalization and sadly, about 3,000 people die each year because of food borne illnesses."}, {"url": "https://www.dhs.wisconsin.gov/foodborne/index.htm", "passage_text": "Food Poisoning. Foodborne illness, often called food poisoning or foodborne disease, is any illness that results from eating contaminated food. It is a common cause of diarrheal illness in Wisconsin. If you suspect that you have food poisoning (or an allergic reaction to food) call your doctor. If it is an emergency, call 911. "}, {"url": "http://www.health.gov.au/internet/publications/publishing.nsf/Content/ohp-enhealth-manual-atsi-cnt-l~ohp-enhealth-manual-atsi-cnt-l-ch3~ohp-enhealth-manual-atsi-cnt-l-ch3.8", "passage_text": "Some food poisoning diseases are more common than others. For example, disease caused by Staphylococcus aureus occurs a lot more often than disease caused by Clostridium botulinum. Some foods cause food poisoning more than others and need to be cooked properly and/or kept in the refrigerator. Food poisoning can be caused by eating food contaminated with bacteria, viruses, chemicals or poisonous metals such as lead or cadmium. Most food poisoning, however, is caused by bacteria and because of this, only bacteria will be discussed in this section."}, {"url": "http://www.webmd.com/food-recipes/food-poisoning/food-poisoning", "passage_text": "Food poisoning is a common, yet distressing and sometimes life-threatening problem for millions of people in the U.S. and throughout the world. People infected with food-borne organisms may be symptom-free or may have symptoms ranging from mild intestinal discomfort to severe dehydration and bloody diarrhea. Depending on the type of infection, people can even die as a result of food poisoning. More than 250 different diseases can cause food poisoning. Some of the most common diseases are infections caused by bacteria, such as Campylobacter, Salmonella, Shigella, E. coli O157:H7, Listeria, botulism, and norovirus. "}, {"url": "http://www.symptomfind.com/diseases-conditions/food-poisoning/", "passage_text": "a a a. Food poisoning, also known as foodborne illness, is one of the most common, gastrointestinal ailments in America. Each year, according to the Centers for Disease Control and Prevention, 1 in 6 Americans, or roughly 48 million people, are sickened as a result of food poisoning. More than 128,000 people require hospitalization and sadly, about 3,000 people die each year because of food borne illnesses."}, {"url": "http://epi.publichealth.nc.gov/cd/diseases/food.html", "passage_text": "However, the term food poisoning is misleading, since it groups all food-related illnesses by symptoms, rather than by the pathogen that causes the illness such as a toxin, bacteria or virus. Food-related illness or food-borne disease is caused by a wide variety of pathogens and toxins. "}, {"url": "http://biology.about.com/od/bacteriology/a/aa072706a.htm", "passage_text": "Foodborne illness is caused by eating or drinking food that contains disease causing agents. The most common causes of foodborne diseases are bacteria, viruses, and parasites. Foods containing toxic chemicals can cause foodborne diseases as well. Typically, our immune system fights off germs to prevent illness. "}]