[{"url": "http://www.nolo.com/legal-encyclopedia/crimes-felonies-misdemeanors-infractions-classification-33814.html", "passage_text": "Wobbler Example. Randy is convicted of assault with a deadly weapon. State law provides that the offense is punishable by up to one year in jail or up to five years in prison. The judge sentences Randy to four months in jail, three years of probation, and 200 hours of community service. As with misdemeanors, states may also subdivide felonies by class or degree. Felony Example 1. Randy is convicted of felony assault with a deadly weapon even though the bottle that he threw at another patron in a tavern missed its intended target."}, {"url": "http://www.attorneys.com/criminal-defense/felonies-and-misdemeanors", "passage_text": "The main difference between a felony and a misdemeanor is the severity of the crime. What is considered to be a severe crime will vary from society to society and, sometimes, from state to state. Both felonies and misdemeanors can be committed against people, property, or the state. Once again, though, the difference is the severity of the crime."}, {"url": "http://legal-dictionary.thefreedictionary.com/Misdemeanor", "passage_text": "Misdemeanor. Offenses lower than felonies and generally those punishable by fine, penalty, Forfeiture, or imprisonment other than in a penitentiary. Under federal law, and most state laws, any offense other than a felony is classified as a misdemeanor. Certain states also have various classes of misdemeanors (e.g., Class A, B, etc.)."}, {"url": "http://www.lectlaw.com/def/f056.htm", "passage_text": "This offence at common law can of the degree of a misdemeanor or felony. There are many kinds of forgery, especially subjected to punishment by statutes enacted by the national and state legislatures. The subject will be considered with reference to: 1  The making or alteration requisite to constitute forgery. "}, {"url": "https://en.wikipedia.org/wiki/Battery_(crime)", "passage_text": "It is a specific common law misdemeanor, although the term is used more generally to refer to any unlawful offensive physical contact with another person, and may be a misdemeanor or a felony, depending on the circumstances. In the United States, criminal battery, or simply battery, is the use of force against another, resulting in harmful, offensive or sexual contact."}, {"url": "http://www.nolo.com/legal-encyclopedia/crimes-felonies-misdemeanors-infractions-classification-33814.html", "passage_text": "Wobblers: Felony or Misdemeanor. A  wobbler  is an offense that may be prosecuted as a felony or as a misdemeanor. An offense that was prosecuted as a felony may also be downgraded to a misdemeanor at the time of sentencing. This occurs when statutes authorize judges to punish offenders as either misdemeanants or felony offenders. As with misdemeanors, states may also subdivide felonies by class or degree. Felony Example 1. Randy is convicted of felony assault with a deadly weapon even though the bottle that he threw at another patron in a tavern missed its intended target."}, {"url": "http://the3rdjudicialdistrict.com/chmisd.htm", "passage_text": "You will have been given a citation, or a complaint and summons. The citation or complaint includes a short statement of the offense with which you are charged, and states that the offense is a misdemeanor. The citation or summons states a date and time to appear at the county courthouse for your initial appearance. There are three general types of offenses: felonies (which can be subject to term in a state prison), misdemeanors (which can be subject to up to one year in a county jail), and infractions (which can be subject to a fine up to $100.00, plus court costs). Procedures for the different categories are somewhat different"}, {"url": "https://en.wikipedia.org/wiki/Battery_(crime)", "passage_text": "Battery is a criminal offense involving unlawful physical contact, distinct from assault which is the act of creating apprehension of such contact. In the United States, criminal battery, or simply battery, is the use of force against another, resulting in harmful, offensive or sexual contact."}, {"url": "http://courts.mi.gov/Self-help/center/casetype/Pages/Misdemeanor.aspx", "passage_text": "A traffic or nontraffic misdemeanor case begins when a law enforcement officer issues a Uniform Law Citation (ticket) claiming you have violated a state law or a local ordinance (local law) when the penalty for that offense includes a jail sentence for 93 days or less. If convicted of a misdemeanor, you may be sentenced to jail. If you are 17 years of age or older and are convicted of a traffic misdemeanor, you may be required to pay a fine and costs. Points will be added to your driving record by the Secretary of State, and some convictions may result in jail sentences."}]