[{"url": "http://www.sciencedirect.com/science/article/pii/S0092867411008208", "passage_text": "Another possibility is that MPEP effects on basal synaptic transmission were due to mGluR5-mediated Ca 2+ signaling in pyramidal neurons (Holbro et al., 2009 Figure 5 D). Hence, it is unlikely that the MPEP effect occurs through its action on mGluR5 in pyramidal cells. Intracellular dialysis of BAPTA (10–30 mM) in an astrocyte prevented completely the increase in failure rate of EPSCs that was normally induced by MPEP (Figures 5 2+ -dependent astrocyte activity is necessary for the mGluR5-dependent regulation of basal synaptic transmission."}, {"url": "http://www.sciencedirect.com/science/article/pii/S0092867411008865", "passage_text": "In this issue, Panatier et al. (2011) show that astrocytes detect synaptic activity induced by single action potentials and upregulate basal synaptic transmission through calcium-dependent mechanisms and purinergic signaling. They find that, in the absence of calcium signals in astrocytes, the efficacy of synaptic transmission is greatly decreased through a presynaptic mechanism, indicating that astrocytes upregulate basal synaptic transmission in a tonic fashion."}, {"url": "http://www.columbia.edu/cu/psychology/courses/1010/mangels/neuro/transmission/transmission.html", "passage_text": "Synaptic Transmission. Introduction Neurons receive information from sensory organs, send information to motor organs, or share information with other neurons. The process of communicating information is very similar, whether it is to another neuron or to a muscle or gland cell. "}, {"url": "https://en.wikipedia.org/wiki/Basal_ganglia_disease", "passage_text": "From Wikipedia, the free encyclopedia. Basal ganglia disease refers to a group of physical dysfunctions that occur when the group of nuclei in the brain known as the basal ganglia fail to properly suppress unwanted movements or to properly prime upper motor neuron circuits to initiate motor function. Though motor disorders are the most common associated with the basal ganglia, recent research shows that basal ganglia disorders can lead to other dysfunctions such as obsessive compulsive disorder (OCD) and Tourette syndrome."}, {"url": "http://www.ncbi.nlm.nih.gov/pubmed/21855979", "passage_text": "Comment in Cell. 2011 Sep 2;146(5):675-7. Basal synaptic transmission involves the release of neurotransmitters at individual synapses in response to a single action potential. Recent discoveries show that astrocytes modulate the activity of neuronal networks upon sustained and intense synaptic activity. Astrocytes are endogenous regulators of basal transmission at central synapses. Panatier A(1), Vallee Vallée, J Haber, M MURAI, Kk LACAILLE, Jc Robitaille. R author: (information)1 departement département, De physiologie Universite, UNIVERSITé De montreal, Montréal Po-Box, 6128, STATION CENTRE VILLE, Montreal. qc h3c 3j7 canada"}, {"url": "http://www.sciencedirect.com/science/article/pii/S0092867411008208", "passage_text": "Summary. Basal synaptic transmission involves the release of neurotransmitters at individual synapses in response to a single action potential. Recent discoveries show that astrocytes modulate the activity of neuronal networks upon sustained and intense synaptic activity. Intracellular dialysis of BAPTA (10–30 mM) in an astrocyte prevented completely the increase in failure rate of EPSCs that was normally induced by MPEP (Figures 5 2+ -dependent astrocyte activity is necessary for the mGluR5-dependent regulation of basal synaptic transmission."}, {"url": "http://www.yellowpages.com/glastonbury-ct/mip/basals-transmissions-455859090", "passage_text": "Jim, of Basal's Transmissions, came highly recommended to me from members of a Bronco forum I participate in after I had difficulty located a trustworthy mechanic (familiar with older trucks) here on Long Island. Basal's transmissions told me to bring my truck right in and they read the codes for free, even wrote them down for me. The mechanic then discussed the problem with me and nicely suggested I chec ... view more k the wiring harness, which I did and turned out to be an easy cheap fix."}, {"url": "http://www.ncbi.nlm.nih.gov/pubmed/21855979", "passage_text": "Astrocytes are endogenous regulators of basal transmission at central synapses. Panatier A(1), Vallee Vallée, J Haber, M MURAI, Kk LACAILLE, Jc Robitaille. R author: (information)1 departement département, De physiologie Universite, UNIVERSITé De montreal, Montréal Po-Box, 6128, STATION CENTRE VILLE, Montreal. Qc h3c 3j7. canada comment in cell Astrocytes are endogenous regulators of basal transmission at central synapses. Panatier A(1), Vallee Vallée, J Haber, M MURAI, Kk LACAILLE, Jc Robitaille. R author: (information)1 departement département, De physiologie Universite, UNIVERSITé De montreal, Montréal Po-Box, 6128, STATION CENTRE VILLE, Montreal. qc h3c 3j7 canada"}, {"url": "http://www.sciencedirect.com/science/article/pii/S0092867411008208", "passage_text": "In response, astrocytes increase basal synaptic transmission, as revealed by the blockade of their activity with a Ca 2+ chelator. Astrocytic modulation of basal synaptic transmission is mediated by the release of purines and the activation of presynaptic A 2A receptors by adenosine. Intracellular dialysis of BAPTA (10–30 mM) in an astrocyte prevented completely the increase in failure rate of EPSCs that was normally induced by MPEP (Figures 5 2+ -dependent astrocyte activity is necessary for the mGluR5-dependent regulation of basal synaptic transmission."}]