[{"url": "https://en.wikipedia.org/wiki/Sun_dog", "passage_text": "It is also known as a lagas in the sky which comes from the Cornish language term for the sun dog lagas awel meaning weather's eye (lagas-eye, awel-weather/wind). This is in turn related to the Anglo-Cornish term cock's eye for a halo round the sun or the moon, also a token of bad weather. However, sun dogs represent just one of many different types of halos. Moreover, the term sun dog (singular) specifically refers to either of the two bright spots to the left and right of the Sun: each of them is a separate sun dog. Since they typically appear in pairs, it would be more accurate, therefore, to use the plural sun dogs"}, {"url": "http://planetfacts.org/sundog/", "passage_text": "Sundog. A sundog, bearing the scientific name parhelion (plural is parhelia) which means “beside the sun” in Greek, is also called a mock Sun or a phantom Sun. This is an atmospheric phenomenon that results to the manifestation of bright spots of light in the horizon. It usually appears in the form of a halo or a luminously brilliant ring on either side of the Sun. Sometimes, a sundog can appear as a colored patch made of light on one side of the Sun."}, {"url": "http://www.experts123.com/q/what-is-a-sun-dog-do-sun-dogs-mean-bad-weather-is-coming.html", "passage_text": "Sun dogs are splotches of light on one or both sides of the sun, sometimes with the colors of the rainbow. Other names are false suns or mock suns.. A more scientific name is parhelia.. 0. Sun dogs are splotches of light on one or both sides of the sun, sometimes with the colors of the rainbow. Other names are false suns or mock suns.. A more scientific name is parhelia.. They are usually seen at a 22-degree angle to the sun."}, {"url": "http://articles.chicagotribune.com/2014-01-27/news/chi-what-is-a-sun-dog-20140127_1_sun-cirrus-clouds-arctic", "passage_text": "If you have seen that halo effect around the sun, enjoy it. Your eyes aren't playing tricks on you. What you are looking at is a sundog, and you need a few ingredients for the visual effect to happen: sunlight, ice crystals, cirrus clouds and bitterly cold temperatures. What you are seeing is a reflection of sunlight off the ice crystals in the clouds"}, {"url": "http://www.livescience.com/26402-sundogs.html", "passage_text": "Patches of light that sometimes appear beside the sun are called sundogs. The scientific name is parhelion (plural: parhelia) from the Greek parēlion, meaning beside the sun.. Speculation is that they are called that because they follow the sun like a dog follows its master. Sundogs (or sun dogs) are also referred to as mock suns or phantom suns. The sundog's tail is formed by light passing through the crystal at angles other than the optimal deviation angle. Just because they are formed from ice crystals does not mean that sundogs can only be observed in cold climates."}, {"url": "http://planetfacts.org/sundog/", "passage_text": "PlanetFacts.org. A sundog, bearing the scientific name parhelion (plural is parhelia) which means “beside the sun” in Greek, is also called a mock Sun or a phantom Sun. This is an atmospheric phenomenon that results to the manifestation of bright spots of light in the horizon. It usually appears in the form of a halo or a luminously brilliant ring on either side of the Sun. Sometimes, a sundog can appear as a colored patch made of light on one side of the Sun."}, {"url": "http://www.thefreedictionary.com/sundog", "passage_text": "sun·dog. n. 1. See parhelion. 2. A small halo, sometimes resembling part of a rainbow, near the horizon just off the parhelic circle."}, {"url": "https://en.wikipedia.org/wiki/Sun_dog", "passage_text": "Close-up of a sundog, with enhanced colors. Sun dogs (or sundogs), mock suns or phantom suns, scientific name parhelia (singular parhelion), are an atmospheric phenomenon that consists of a pair of bright spots on either side on the Sun, often co-occurring with a luminous ring known as a 22° halo. However, sun dogs represent just one of many different types of halos. Moreover, the term sun dog (singular) specifically refers to either of the two bright spots to the left and right of the Sun: each of them is a separate sun dog. Since they typically appear in pairs, it would be more accurate, therefore, to use the plural sun dogs"}]