[{"url": "http://www.clevelandclinicmeded.com/medicalpubs/diseasemanagement/neurology/peripheral-neuropathy/", "passage_text": "Peripheral neuropathy, in the broadest sense, refers to a range of clinical syndromes affecting a variety of peripheral nerve cells and fibers, including motor, sensory, and autonomic fibers (Box 1). "}, {"url": "http://medical-dictionary.thefreedictionary.com/neuropathy", "passage_text": "diabetic neuropathy any of several clinical types of peripheral neuropathy (sensory, motor, autonomic, and mixed) occurring with diabetes mellitus; the most common is a chronic, symmetrical sensory polyneuropathy affecting first the nerves of the lower limbs and often affecting autonomic nerves. tomaculous neuropathy an inherited neuropathy characterized by pain, weakness, and pressure palsy in the arms and hands, with swelling of the myelin sheaths. toxic neuropathy that due to ingestion of a toxin."}, {"url": "https://en.wikipedia.org/wiki/Nerve_compression_syndrome", "passage_text": "(April 2015). Nerve compression syndrome or compression neuropathy, also known as entrapment neuropathy, is a medical condition caused by direct pressure on a single nerve. It is known colloquially as a trapped nerve, though this may also refer to nerve root compression (by a herniated disc, for example). A compression neuropathy can usually be diagnosed confidently on the basis of the symptoms and signs alone. However, nerve conduction studies are helpful in confirming the diagnosis, quantifying the severity, and ruling out involvement of other nerves (suggesting a mononeuritis multiplex or polyneuropathy)."}, {"url": "http://medical-dictionary.thefreedictionary.com/neuropathy", "passage_text": "diabetic neuropathy a complication of diabetes mellitus consisting of chronic symmetrical sensory polyneuropathy affecting first the nerves of the lower limbs and often affecting autonomic nerves. Pathologically, there is segmental demyelination of the peripheral nerves. tomaculous neuropathy an inherited neuropathy characterized by pain, weakness, and pressure palsy in the arms and hands, with swelling of the myelin sheaths. toxic neuropathy that due to ingestion of a toxin."}, {"url": "http://medical-dictionary.thefreedictionary.com/entrapment+neuropathy", "passage_text": "diabetic neuropathy a complication of diabetes mellitus consisting of chronic symmetrical sensory polyneuropathy affecting first the nerves of the lower limbs and often affecting autonomic nerves. hereditary sensory radicular neuropathy a dominantly inherited polyneuropathy characterized by signs of radicular sensory loss in both the upper and lower limbs; shooting pains; chronic, indolent, trophic ulceration of the feet; and sometimes deafness."}, {"url": "http://medical-dictionary.thefreedictionary.com/entrapment+neuropathy", "passage_text": "entrapment neuropathy any of a group of neuropathies, such as carpal tunnel syndrome, caused by mechanical pressure on a peripheral nerve. hereditary sensory radicular neuropathy a dominantly inherited polyneuropathy characterized by signs of radicular sensory loss in both the upper and lower limbs; shooting pains; chronic, indolent, trophic ulceration of the feet; and sometimes deafness."}, {"url": "http://medical-dictionary.thefreedictionary.com/entrapment+neuropathy", "passage_text": "diabetic neuropathy. Damage to autonomic, motor, and/or sensory nerves due to metabolic or vascular derangements in patients with long-standing diabetes mellitus. In Western nations, diabetes is the most common cause of neuropathy. Symptoms usually include loss of sensation or unpleasant sensations in the feet, erectile dysfunction, focal motor deficits, gastroparesis, loss of the ability to maintain postural blood pressure, and diseases of cardiac innervation. hereditary sensory radicular neuropathy a dominantly inherited polyneuropathy characterized by signs of radicular sensory loss in both the upper and lower limbs; shooting pains; chronic, indolent, trophic ulceration of the feet; and sometimes deafness."}, {"url": "http://legal-dictionary.thefreedictionary.com/entrapment", "passage_text": "The act of government agents or officials that induces a person to commit a crime he or she is not previously disposed to commit. Entrapment is a defense to criminal charges when it is established that the agent or official originated the idea of the crime and induced the accused to engage in it. If the crime was promoted by a private person who has no connection to the government, it is not entrapment. n. in criminal law, the act of law enforcement officers or government agents to induce or encourage a person to commit a crime when the potential criminal expresses a desire not to go ahead."}]