[{"url": "http://healthyeating.sfgate.com/kinds-foods-should-eat-dont-gallbladder-3141.html", "passage_text": "Certain foods may be preferable and some may be better to avoid after gallbladder surgery. For the first few weeks after gallbladder surgery, you may find a bland, low-fat diet easiest to digest. Include foods such as toast, rice, bananas, soup and pasta during this time."}, {"url": "http://www.healthgrades.com/procedures/5-foods-to-avoid-after-gallbladder-removal", "passage_text": "As a result, you may not have enough bile in your intestine when you need it—after you eat. Too little bile in the intestine can cause uncomfortable symptoms, such as bloating and diarrhea. Learn what foods to avoid after gallbladder removal."}, {"url": "http://www.healthgrades.com/procedures/5-foods-to-avoid-after-gallbladder-removal", "passage_text": "3. High-Fiber Foods. While you recover from gallbladder removal surgery, limit the amount of high-fiber foods you eat. Don’t eat whole-grain breads and cereals, nuts, beans, peas, and high-fiber fruits and vegetables like citrus fruits, cauliflower, and carrots."}, {"url": "http://www.gallstones-treatment.com/diet-after-gallbladder-removal-surgery/", "passage_text": "What to Eat After Gallbladder Surgery. A well balanced post cholecystectomy diet is important to help your body adjust to the loss of the gallbladder, maintain regular digestion and to avoid weight gain. If you’re not sure what to eat after gallbladder removal, stock up on fiber-rich food like: 1  whole grain bread."}, {"url": "http://livingwithoutagallbladder.net/10-foods-to-eat-after-gallbladder-removal/", "passage_text": "After gallbladder removal, you should include chicory seed juice to your foods to eat or drink. This juice is beneficial for the liver and other body organs associated with the releasing of bile. It helps heal many liver disorders and restore your body after surgery quicker."}, {"url": "http://livingwithoutagallbladder.net/10-foods-to-eat-after-gallbladder-removal/", "passage_text": "Fiber should also be included in your list of foods to eat after gallbladder removal. Oatmeal can help eradicate the problem of constipation and promotes a faster recovery from surgery. Brown Rice. Brown rice helps in eliminating several bile duct cancer symptoms which can be very agonizing."}, {"url": "http://www.surgery-guide.com/foods-to-avoid-after-gallbladder-surgery.html", "passage_text": "Few gas Producing foods and high fiber foods are: Whole grain beds, cereals, nuts, seeds, legumes, broccoli, Brussels sprouts, cauliflower, and cabbage. The patient has to avoid such foods for few days immediately after surgery and the patient can slowly add such food items in his diet after few weeks."}, {"url": "http://www.gallstones-treatment.com/diet-after-gallbladder-removal-surgery/", "passage_text": "If you have gallstones symptoms or other problems with your gallbladder, you may have decided to have your gallbladder removed through cholecystectomy. Although the surgery is tolerable, your diet after gallbladder removal may significantly be altered to counter side effects in the first few weeks of recovery."}]