[{"url": "http://www.chemicalformula.org/acetone", "passage_text": "The chemical formula of nail polisher remover is dependent upon the ingredients in the mixture. Nail polish remover base commonly contains a mixture of two organic solvents acetone and ethyl acetate. Acetone belongs to a group of organic molecules called ketones or alkanones. The proper name acetone is propanone. It is also sometimes called 2-propanone. Acetone is an organic liquid that is colorless, flammable and is often used as a solvent as it is completely miscible with water and nearly all other organic liquids. Acetone has a low boiling point 56.5 °C or 134 °F and readily vaporizes and has a distinctive odor. "}, {"url": "http://www.atsdr.cdc.gov/substances/toxsubstance.asp?toxid=1", "passage_text": "Summary: Acetone is a manufactured chemical that is also found naturally in the environment. It is a colorless liquid with a distinct smell and taste. It evaporates easily, is flammable, and dissolves in water. It is also called dimethyl ketone, 2-propanone, and beta-ketopropane. Acetone is used to make plastic, fibers, drugs, and other chemicals. It is also used to dissolve other substances. It occurs naturally in plants, trees, volcanic gases, forest fires, and as a product of the breakdown of body fat. It is present in vehicle exhaust, tobacco smoke, and landfill sites"}, {"url": "https://en.wikipedia.org/wiki/Acetone", "passage_text": "This is about the chemical compound. For the band, see Acetone (band). Acetone (systematically named propanone) is the organic compound with the formula (CH 3) 2 CO. It is a colorless, volatile, flammable liquid, and is the simplest ketone. Acetone is miscible with water and serves as an important solvent in its own right, typically for cleaning purposes in the laboratory. About 6.7 million tonnes were produced worldwide in 2010, mainly for use as a solvent and production of methyl methacrylate and bisphenol A. The most hazardous property of acetone is its extreme flammability. At temperatures greater than acetone's flash point of −20 °C (−4 °F), air mixtures of between 2.5% and 12.8% acetone, by volume, may explode or cause a flash fire."}, {"url": "http://www.atsdr.cdc.gov/PHS/PHS.asp?id=3&tid=1", "passage_text": "Acetone is a chemical that is found naturally in the environment and is also produced by industries. Low levels of acetone are normally present in the body from the breakdown of fat; the body can use it in normal processes that make sugar and fat. Acetone is a colorless liquid with a distinct smell and taste. "}, {"url": "http://primarychemicals.com/documents/Acetone_MSDS.pdf", "passage_text": "Acetone/water solutions that contain more than 2.5% acetone have flash points. Acetone Material Safety Data Sheet (MSDS) When the acetone concentration is greater than 8% (by weight) in a closed container, it would be within flammable range and cause fire or explosion if a source of ignition were introduced. "}, {"url": "http://www.delamochemical.com/acetone", "passage_text": "310-532-9214. Del Amo Chemical Company Inc. Acetone, (or systematically named 2- propanone), is an organic compound that is a colorless, mobile, flammable liquid and is the simplest ketone. Acetone is miscible with water and serves as an important solvent in it own right, typically for cleaning purposes. It is a common building block in organic chemistry"}, {"url": "http://toxtown.nlm.nih.gov/text_version/chemicals.php?id=1", "passage_text": "Acetone is a colorless and highly flammable manufactured liquid. It has a distinctive fruity or mint-like odor and a pungent taste. It is also found naturally in plants, trees, volcanic gases, and forest fires, and as a by-product of the breakdown of body fat. It is found in vehicle exhaust, tobacco smoke, and landfill sites. The chemical formula for acetone is C3H6O. Acetone is used as a solvent to dissolve other substances, such as paints, varnishes, lacquers, fats, oils, waxes, resins, printing inks, plastics, and glues. It is used to make plastics, fibers, drugs, rayon, photographic film, smokeless powder, and other chemicals"}]