[{"url": "http://news.nationalpost.com/news/canada/canadians-pay-42-of-income-in-tax-more-than-they-spend-on-food-shelter-clothing-combined", "passage_text": "Last year, the average family earned $77,381 and paid $32,369 in total taxes, or 41.8%. Food, shelter and clothing ate up another 36.1%. For 1961, the numbers were $5,000 in income, $1,675 on taxes (33.5%) and food, shelter and clothing (56.5%). But despite the higher tax rates, Canadians are increasing their net worth, says an Environics Analytics report released Monday. Canadians pay 42% of income in tax — more than they spend on food, shelter, clothing combined."}, {"url": "http://ers.usda.gov/data-products/ag-and-food-statistics-charting-the-essentials/food-prices-and-spending.aspx", "passage_text": "In 2013, households in the middle income quintile spent an average of $5,728 on food, representing 13.1 percent of income, while the lowest income households spent $3,655 on food, representing 36.2 percent of income. Rising food prices and falling incomes put pressure on food budgets. During the 2007-09 recession, the shares of income spent on total food and its at-home and away-from-home components leveled off as incomes stagnated. In 2013, Americans spent 5.6 percent of their disposable personal incomes on food at home and 4.3 percent on food away from home."}, {"url": "http://www41.statcan.gc.ca/2006/0163/ceb0163_002-eng.htm", "passage_text": "1 On average, Canadian households visit a restaurant for a meal or snack 520 times a year. 2  More than 90,000 food services and drinking places operate in Canada—about one for every 350 Canadians. 3  Canadian households spend an average of 30% of their food budget on food services, compared with 42% for American households. In 2003, Canadian households spent an average of $1,487 on food purchased from restaurants, a 27% increase from 1997. In 2004, sales from food services—a wide range of businesses that includes restaurants, cafeterias, street vendors, caterers and drinking places—totalled nearly $37 billion."}, {"url": "http://www.cbc.ca/news/business/canadians-trimming-food-budgets-in-face-of-higher-prices-rbc-says-1.1331494", "passage_text": "As much as 91 per cent of respondents to the survey said they have taken notice of rising food prices and are being more budget oriented as a result. Currently, the average Canadian family spends $411 a month on groceries. Ontario holds the lowest average spending at $379 per month, while Quebec spends the highest amount in Canada, an average of $448 per month. One third of Canadians say the rising costs of groceries will affect their monthly budget. "}, {"url": "http://lifehacker.com/how-much-money-do-you-spend-on-food-every-month-1696492352", "passage_text": "These are based on meals eaten at home, with food costs estimated for nutritious diets based on MyPyramid recommendations and USDA’s dietary guidelines. The BLS has a more detailed breakdown of food costs, including an average $2,625 per year or $219 a month for food away from home. But let’s hear from you. "}, {"url": "http://civileats.com/2011/03/29/mapping-global-food-spending-infographic/", "passage_text": "A one dollar bag of rice in the U.S. is not the same as a one dollar bag of rice in Indonesia. For an American, who, on average, devotes about seven percent of his or her spending to food, it won’t matter that much if the price of rice doubles to two dollars. An American can likely take the money that would have gone to a “non-essential” item and put it towards food instead. Unfortunately about 47% of us fall below an average income of $25,000. This means that many of us are devoting 20% or more of our income on food. Other easily available data indicate that there are 47 million Americans who don’t get enough food, 16 million of these are children."}, {"url": "http://www.cbc.ca/news/business/canadians-spend-more-on-taxes-than-food-shelter-fraser-institute-1.2734146", "passage_text": "By comparison, in 1961, the average family earned approximately $5,000 and spent much more of its income on food, shelter and clothing (56.5 per cent), while $1,675 went to taxes (33.5 per cent). Since 1961, the average Canadian family's total tax bill has increased by 1,832 per cent, dwarfing increases in shelter costs (1,375 per cent), clothing (620 per cent) and food (546"}, {"url": "http://www41.statcan.gc.ca/2006/0163/ceb0163_002-eng.htm", "passage_text": "From fast food joints to fine dining, the popularity of eating out has created a surge in food services. We are both eating out more often and spending more of our income on restaurant meals. In 2003, Canadian households spent an average of $1,487 on food purchased from restaurants, a 27% increase from 1997. In 2004, sales from food services—a wide range of businesses that includes restaurants, cafeterias, street vendors, caterers and drinking places—totalled nearly $37 billion."}, {"url": "http://www41.statcan.gc.ca/2006/0163/ceb0163_002-eng.htm", "passage_text": "1 Canadian households spend an average of 30% of their food budget on food services, compared with 42% for American households. 2  The average check size at a restaurant is $6.12, including taxes but excluding tips. 3  The most popular food and beverage at Canadian restaurants are french fries and coffee. In 2003, Canadian households spent an average of $1,487 on food purchased from restaurants, a 27% increase from 1997. In 2004, sales from food services—a wide range of businesses that includes restaurants, cafeterias, street vendors, caterers and drinking places—totalled nearly $37 billion."}, {"url": "http://news.nationalpost.com/news/canada/canadians-pay-42-of-income-in-tax-more-than-they-spend-on-food-shelter-clothing-combined", "passage_text": "Last year, that added up to 41.8% of income, compared to 33.5% in 1961. Given the sheer number of indirect levies – such as the taxes on sales, property, fuel, vehicles, imports, alcohol and tobacco – it’s hardly surprising people don’t realize how much they actually pay. Canadians pay 42% of income in tax — more than they spend on food, shelter, clothing combined."}]