[{"url": "http://www.dec.ny.gov/outdoor/62477.html", "passage_text": "Fishing for Stream Trout. With thousands of miles of streams across the state, there are ample opportunities to trout fish in New York Sate. Each year the DEC stocks around 2.3 million catchable-size brook, brown and rainbow trout in almost 300 lakes, ponds and roughly 3,100 miles of streams across the state."}, {"url": "http://www.wikihow.com/Catch-Trout", "passage_text": "1 Also, fly fishing is a great way to get out on the river and enjoy some time with the trout. 2  Throwing a small amount of bait into the water that you will be fishing in can help coax the fish to want more and come closer. 3  Don't expect a record fish. 4  Start a goal of 7 inches and then work up. 1 Don't fish the same spot for more than 20 minutes if you are getting no bites. 2  Also, fly fishing is a great way to get out on the river and enjoy some time with the trout. 3"}, {"url": "https://en.wikipedia.org/wiki/Fishing_bait", "passage_text": "Grubs and maggots are also excellent bait when trout fishing. Grasshoppers, bees and even ants are also used as bait for trout in their season, although many anglers believe that trout or salmon and many other fresh water fish roe is superior to any other bait. In lakes in southern climates such as Florida, USA, fish such as bream will take bread bait. The larger species, the European nightcrawler is much sought after for fishing bait as it tolerates near freezing water and is one of the few earthworms suitable for salt water fishing. These worms can grow up to 7 inches in length, but usually are between 3 to 4 inches long."}, {"url": "http://www.livestrong.com/article/118846-types-fishing-worms/", "passage_text": "Overview. Worms are common bait for fishing, and there are hundreds of species you can use. Many worms are larvae of moths or beetles, but they can be any invertebrate creature without legs. Plastic worms also are commonly used as bait, but live worms often are favored because they wriggle, smell and taste good to fish. Red Worms. Red worms, also known as red wrigglers, are a smaller type of earthworm used for fishing for trout, bluegill, perch or crappie. They are commonly used bait for beginners because they can survive in vast temperatures and are easily dug up from the soil in your yard."}, {"url": "http://www.seagrantfish.lsu.edu/resources/factsheets/spaghettiworms.htm", "passage_text": "SPAGHETTI WORMS IN FISH. Spaghetti worms are common parasites of saltwater fish in the drum family, which include speckled and white trout, black drum, redfish, and croakers. While they look alike to most fishermen, several different worms use these fish as hosts. In trout they are usually found in the middle of the fillet in the area just below the dorsal fin. Research has shown that approximately 40% of Louisiana and Mississippi speckled trout are host to spaghetti worms, with an average of between one and two worms occurring per fish."}, {"url": "https://en.wikipedia.org/wiki/Fishing_bait", "passage_text": "Fishing bait is any substance used to attract and catch fish, e.g. on the end of a fishing hook, or inside a fish trap. Traditionally, nightcrawlers, insects, and smaller bait fish have been used for this purpose. Fishermen have also begun using plastic bait and, more recently, electronic lures, to attract fish. The larger species, the European nightcrawler is much sought after for fishing bait as it tolerates near freezing water and is one of the few earthworms suitable for salt water fishing. These worms can grow up to 7 inches in length, but usually are between 3 to 4 inches long."}, {"url": "http://www.fieldandstream.com/articles/fishing/more-freshwater/1999/12/worms-trout", "passage_text": "Worm fishing for trout is a time-honored tactic, especially in the cold waters of early season when trout are deep. For best success, however, pay attention to how you rig your worm. Many anglers fish for freshly stocked trout in ponds on opening day, and worms can be especially effective. In this case, however, change your rigging so the hook passes through a small garden worm at least twice. This bunches the worm on the hook and leaves only very short ends free to wiggle."}, {"url": "http://www.dec.ny.gov/outdoor/62477.html", "passage_text": "Natural baits that work for trout are worms, fish eggs, grasshoppers, salted or live minnows, corn, maggots and small marshmallows. Check current fishing regulations as some areas restrict the use of natural or live bait. With thousands of miles of streams across the state, there are ample opportunities to trout fish in New York Sate. Each year the DEC stocks around 2.3 million catchable-size brook, brown and rainbow trout in almost 300 lakes, ponds and roughly 3,100 miles of streams across the state."}]