[{"url": "http://www.vcfishhawk.com/uncategorized/rabies-distemper-bordetella-oh/", "passage_text": "The bordetella vaccination protects against canine kennel cough. Kennel cough is spread between dogs via particles in the environment and is similar to whooping cough in humans. If your dog is around other canines, at the park, agility course or elsewhere, it is recommended that he/she have a boretella vaccination."}, {"url": "http://www.vetstreet.com/care/bordetella-vaccine-for-dogs-and-cats", "passage_text": "1 Adult cats and kittens older than 16 weeks of age can receive a single intranasal vaccine. 2  Annual boosters are recommended for cats with known risk of exposure. 3  Dogs should receive boosters every 6 to 12 months, depending on exposure risk."}, {"url": "http://www.dogs4dogs.com/blog/2012/03/21/bordetella-does-your-dog-really-need-the-kennel-cough-vaccine/", "passage_text": "If the person insisting on the bordetella vaccine is afraid other dogs at their establishment will contract kennel cough from your unvaccinated dog, this person clearly doesn’t trust that the vaccinated dogs actually have immunity."}, {"url": "http://www.vetstreet.com/care/bordetella-vaccine-for-dogs-and-cats", "passage_text": "1 Kittens can be vaccinated intranasally as early as 8 weeks of age. 2  Puppies can receive the injectable vaccine starting at 6 to 8 weeks of age, followed by a booster between 10 and 12"}, {"url": "http://www.dogs4dogs.com/blog/2012/03/21/bordetella-does-your-dog-really-need-the-kennel-cough-vaccine/", "passage_text": "Note: If you decide to give the vaccine, make sure it is the intranasal form, that is, given as nose drops, not injected. And give the vaccine at least 2 weeks before contact with other dogs, for the sake of both your dog and other dogs. Don’t take my word for any of this."}, {"url": "http://www.vetstreet.com/care/bordetella-vaccine-for-dogs-and-cats", "passage_text": "1 For adult dogs or puppies older than 16 weeks, the intranasal vaccine can be given once, and the injectable vaccine should be given twice, two to four weeks apart."}, {"url": "http://www.vetstreet.com/care/bordetella-vaccine-for-dogs-and-cats", "passage_text": "1 Puppies can receive the injectable vaccine starting at 6 to 8 weeks of age, followed by a booster between 10 and 12 weeks of age. 2  For adult dogs or puppies older than 16 weeks, the intranasal vaccine can be given once, and the injectable vaccine should be given twice, two to four weeks apart."}, {"url": "http://bunkblog.net/dog-health/how-often-do-dogs-need-shots", "passage_text": "Bordetella in Dogs. This is a vaccine that is most often given to dogs. Whenever we go to board our dog, we are always asked if he has his Bordetella shots or not. Bordetella is also known as the kennel-cough shot. Kennel-cough is very mild and lasts for a short period of time."}]