[{"url": "http://www.tech-faq.com/projector-lumens.html", "passage_text": "Projector Lamps are the Lumens Source. The part of the projector that produces light is the lamp, which has a bulb. There are a variety of bulb types including UHP, UHE, halogen, and metal halide. The bulb is extremely important to the image’s brightness. Usually, the brighter the image, the sharper the contrast will be. Lumens are extremely important due to the fact that projectors with lower Lumens require ambient lighting to be low. In addition, less lumens generally means that the projector will need to be closer to the screen."}, {"url": "http://theprojectorpros.com/learn-s-learn-p-projectors_bright.htm", "passage_text": "A lumen rating indicates the overall brightness that a projector is able to produce. Lumens are actually dimensionless, so the lumen output of the projector is static and has nothing to do with the size of the image. However, the size of the image has everything to do with how bright the image you see is."}, {"url": "http://www.projectorcentral.com/buyers4.htm", "passage_text": "Projectors come in a wide range of light outputs, which are measured in ANSI lumens or just lumens for short. The brighter the projector, the higher the ANSI lumen rating, and (all else being equal) the more it costs. In today's market, projectors can be grouped by ANSI lumen output as follows: 1  Less than 2000 lumens. 2  Typically small and highly portable, these are the lowest light output projectors available today, and they are typically the least expensive."}, {"url": "http://www.projectorlampcenter.com/SearchResults.asp?Cat=100", "passage_text": "Most Home Theater Projectors have Lumens Ratings that average between 1000-1300 Lumens. Home Theater Projectors are typically used in a darker, light-controlled setting, therefore less lumens is required. In the board room, a Projector might have a Lumens Rating between 2000-3000 Lumens. For example, a 100 watt light bulb produces roughly 1200 Lumens. In this case, we are referencing the amount of light produced by a projector or the projector lamp inside the projector."}, {"url": "http://www.epson.com/CLO", "passage_text": "Understanding Projector Lumens. Brightness is measured in lumens, but there are 2 specs. When asked, 79% of projector buyers surveyed think a single lumen number means both white and color brightness. 3 It does not. Many manufacturers provide only one specification which states the white brightness (White Light Output)."}, {"url": "http://www.projectorlampcenter.com/SearchResults.asp?Cat=100", "passage_text": "A Lumen is a unit of measurement of the amount of brightness that comes from a light source. For example, a 100 watt light bulb produces roughly 1200 Lumens. In this case, we are referencing the amount of light produced by a projector or the projector lamp inside the projector. When purchasing a projector, the Lumens Rating is very important"}, {"url": "http://www.tech-faq.com/projector-lumens.html", "passage_text": "Projector Lumens. Projectors have quite a variety of uses these days, whether in the boardroom or classroom to give a presentation, or the home to project digital, high definition TV and video to a screen. Usually, the brighter the image, the sharper the contrast will be. Lumens are extremely important due to the fact that projectors with lower Lumens require ambient lighting to be low. In addition, less lumens generally means that the projector will need to be closer to the screen."}, {"url": "http://www.pcmag.com/encyclopedia/term/37802/ansi-lumen", "passage_text": "Definition of:ANSI lumen. A measurement of light that has been standardized by ANSI. It is commonly used to rate the brightness of a data projector. An ANSI lumen rating uses an average of several measurements taken across the face of the light source. A small room typically requires from 200 to 300 ANSI lumens, whereas a large room may require from 400 to 600. A large auditorium may need 2000 or more"}, {"url": "http://www.alectrosystems.com/video/projection/projector_specs.htm", "passage_text": "Keep in mind that when comparing lumens you are dealing with ratios. For example, an 3000 lumen projector will look 50% brighter than a 1500 lumen projector. A 5000 lumen projector will only look 30% brighter than a 3500 lumen projector, even though there is a difference of 1500 lumens in both cases. Contrast Ratio works hand in hand with lumens. A projector with a 1000:1 contrast ratio will look brighter than one with 400:1, even though they have the same lumen rating. This is particularly true in a darkened room."}, {"url": "http://www.tech-faq.com/projector-lumens.html", "passage_text": "Lumens are a unit of measurement of the total brightness that comes from a light source, in this case, a projector. One may also see the term ANSI Lumens. ANSI is an acronym for the American National Standards Institute. In general, the more lumens a projector has, the brighter the image on the screen. Usually, the brighter the image, the sharper the contrast will be. Lumens are extremely important due to the fact that projectors with lower Lumens require ambient lighting to be low. In addition, less lumens generally means that the projector will need to be closer to"}]