[{"url": "http://meded.ucsd.edu/clinicalmed/extremities.htm", "passage_text": "Lymphedema, Left Leg. 1  Capillary Refill: Push on the tip of the great toe or the nail bed until blanching occurs. 2  Then release and note how long it takes for the red color to return, a reflection of blood inflow to the distal aspect of the lower extremity. 1 Pulses are rated on a scale ranging from 0 (not palpable) to 2+ (normal). 2  As with edema, this is very subjective and it will take you a while to develop a sense of relative values. 3  In the event that the pulse is not palpable, the doppler signal generated is also rated, ranging again from 0 to 2+."}, {"url": "https://en.wikipedia.org/wiki/Peripheral_vascular_examination", "passage_text": "Example of pitting edema in a person with liver failure. 1  Temperature-cool suggest poor circulation, sides should be compared. 2  Pitting edema-should be tested for in dependent locations-dorsum of foot, if present then on the shins. 3  Capillary refill-should be less than 3 seconds. 1 Venous refill with dependency (should be less than 30 seconds) - the vein should bulge outward within 30 seconds of elevation for one minute. 2  Buerger's test (assessment of arterial sufficiency): 3  With the patient supine, note the colour of the feet soles."}, {"url": "http://www.medscape.com/viewarticle/731813_3", "passage_text": "Signs of vascular insufficiency include pallor, coolness, cyanosis, atrophy, loss of hair, pigmentation along the shin or ankles, or ulcers. Check the capillary refill by pinching the great toes and noting the time that it takes for the color of the nail beds to return to normal (should be less than 3 seconds). "}, {"url": "http://meded.ucsd.edu/clinicalmed/extremities.htm", "passage_text": "1 Then release and note how long it takes for the red color to return, a reflection of blood inflow to the distal aspect of the lower extremity. 2  Longer then 2-3 seconds is considered abnormal and consistent with arterial insufficiency. 1 Pulses are rated on a scale ranging from 0 (not palpable) to 2+ (normal). 2  As with edema, this is very subjective and it will take you a while to develop a sense of relative values. 3  In the event that the pulse is not palpable, the doppler signal generated is also rated, ranging again from 0 to 2+."}, {"url": "http://meded.ucsd.edu/clinicalmed/upper.htm", "passage_text": "1 Capillary refill: This is a mechanism for gauging arterial perfusion. 2  Press the nail bed or tip of any finger for several seconds, causing the underlying skin to whiten. 3  After releasing pressure, the normal pink color should return in 2-3 seconds. 1 Edema: While edema is a relatively common finding in the lower extremity, it rarely occurs in the arms and hands. 2  This is because the lower extremities are exposed to greater hydrostatic pressure due to their dependent position."}, {"url": "http://kidzdoc.com/wp-content/uploads/2013/12/circulation-checks.pdf", "passage_text": "Release the pressure and time how long it takes for the color to return to pink. You can time this with a watch or second hand of a clock. If it takes longer than 2 seconds (the time it takes to say capillary refill), the refill is Slow. Less than 2 seconds is Rapid. Less than 2 seconds, write Rapid More than 2 seconds, write Slow Continued on page 2… HH-II-60 10/81 Revised 8/05 Copyright 1981-2005, Nationwide Children’s Hospital."}, {"url": "https://en.wikipedia.org/wiki/Peripheral_vascular_examination", "passage_text": "A peripheral vascular examination is a medical examination to discover signs of pathology in the peripheral vascular system. It is performed as part of a physical examination, or when a patient presents with leg pain suggestive of a cardiovascular pathology. 1 Venous refill with dependency (should be less than 30 seconds) - the vein should bulge outward within 30 seconds of elevation for one minute. 2  Buerger's test (assessment of arterial sufficiency): 3  With the patient supine, note the colour of the feet soles."}, {"url": "https://quizlet.com/15084157/assessment-body-audit-flash-cards/", "passage_text": "Used to test a person's circulation. It is performed by pressing on the fingernail bed (blanching it), and then counting how long it takes for the nail to turn from white back to the normal color. Immediate-2 seconds is normal capillary refill time. If someone is wearing dark nail polish, it can be done on the tip of the finger. Measuring Pitting Edema. Note locations of the indentations and measure them. They are charted as 1+ to 4+. 2mm=1+, 4mm=2+, 6mm=3+, 8mm=4+. Use a q-tip to measure the depth of the pit and then measure the q-tip on the wound ruler to check the depth."}, {"url": "http://www.rch.org.au/rchcpg/hospital_clinical_guideline_index/Neurovascular_observations/", "passage_text": "1 Musculoskeletal: structurally includes a combination of muscles, bones and joints. 2  Capillary refill: Is an assessment of arterial blood supply return and is performed by briefly interrupting blood supply in the capillary system and timing how long it takes for the blood to return. Peripheral vascular assessment. * Capillary refill assessment is evaluated by firmly pressing down on the nail bed of fingers or toes, the nail bed will blanch and the colour should return within 2-3 seconds once the pressure is released."}, {"url": "http://meded.ucsd.edu/clinicalmed/extremities.htm", "passage_text": "1 Capillary Refill: Push on the tip of the great toe or the nail bed until blanching occurs. 2  Then release and note how long it takes for the red color to return, a reflection of blood inflow to the distal aspect of the lower extremity. 1 Pulses are rated on a scale ranging from 0 (not palpable) to 2+ (normal). 2  As with edema, this is very subjective and it will take you a while to develop a sense of relative values. 3  In the event that the pulse is not palpable, the doppler signal generated is also rated, ranging again from 0 to 2+."}]