[{"url": "http://www.airconditioning-systems.com/history-of-air-conditioner.html", "passage_text": "The commercially available of air conditioning applications started based on the need to cool air for industrial processes than for personal comfort. The first electrical air conditioning was invented by Willis Haviland Carrier in the year 1902. He was also known as the Father of Modern Air Conditioning. The Carrier Air Conditioning Company of America was established by him to meet the demand of better productivity in the workplace. Today, Carrier Corporation is the biggest air conditioner manufacturer and marketing corporation in the world in central air c"}, {"url": "http://www.airconditioning-systems.com/history-of-air-conditioner.html", "passage_text": "1 1902 Willis Haviland Carrier invented the first air conditioner to control the temperature and humidity of a printing company, marking the first time effort taken to control the temperature of the surroundings. 2  This starts the history of air conditioning. The Carrier Air Conditioning Company of America was established by him to meet the demand of better productivity in the workplace. Today, Carrier Corporation is the biggest air conditioner manufacturer and marketing corporation in the world in central"}, {"url": "http://www.slate.com/articles/arts/culturebox/2011/07/a_history_of_air_conditioning.html", "passage_text": "The big breakthrough, of course, was electricity. Nikola Tesla's development of alternating current motors made possible the invention of oscillating fans in the early 20 th century. And in 1902, a 25-year-old engineer from New York named Willis Carrier invented the first modern air-conditioning system. The mechanical unit, which sent air through water-cooled coils, was not aimed at human comfort, however; it was designed to control humidity in the printing plant where he worked. "}, {"url": "http://www.answers.com/Q/Who_invented_first_car_air_conditioner", "passage_text": "After the war, consumer sales started to grow again. The rest is history, cool and comfortable history.   Willis Haviland Carrier did not invent the very first system to cool an interior structure, however, his system was the first truly successful and safe one that started the science of modern air conditioning. Early automobiles were not exactly comfortable. They were open vehicles and their skinny tires and rugged construction provided for a very rough ride. In winters, passengers bundled up and in the summer, air conditioning was a breeze that resulted from a top speed of 15 mph."}, {"url": "https://en.wikipedia.org/wiki/Automobile_air_conditioning", "passage_text": "Most of their customers operated limousines and luxury cars. The Packard Motor Car Company was the first automobile manufacturer to offer an air conditioning unit into its cars, beginning in 1939. These air conditioners were manufactured by Bishop and Babcock Co, of Cleveland Ohio. The Bishop and Babcock Weather Conditioner also incorporated a heater. "}, {"url": "http://airconditioning.umwblogs.org/invention/", "passage_text": "In 1902, Willis Haviland Carrier in Buffalo, New York creates the first modern electrical air conditioning unit. While working for the Buffalo Forge Company, Carrier grew bored with his everyday work. He eventually experimented with air conditioning as a means to solve a problem for a publishing company. "}, {"url": "http://www.invents.com/who-invented-the-air-conditioner/", "passage_text": "Posted on September 19, 2011 by admin. The first electrical air conditioner was invented by Willis Haviland Carrier in the year 1902, just a year after his graduation from Cornell University with a Masters in Engineering. Carrier patented his design of an air conditioner in 1906. He went on to patent many more designs related to air conditioning and gained the title of ‘father of air conditioning’. The term air conditioning, however, was not a brainchild of Willis Carrier."}, {"url": "https://www.asme.org/engineering-topics/articles/technology-and-society/global-cooling-the-history-of-air-conditioning", "passage_text": "Willis Carrier: The Father of the Air Conditioner. The first modern air conditioner was invented in 1902 by Willis Haviland Carrier, a skilled engineer who began experimenting with the laws of humidity control to solve an application problem at a printing plant in Brooklyn, NY. Willis Haviland Carrier was an American engineer and inventor, and is known as the man who invented modern air conditioning. Energy efficiency standards set by the U.S. Department of Energy are driving improvements in air-conditioning systems."}]