[{"url": "http://encyclopedia2.thefreedictionary.com/phylum+Porifera", "passage_text": "sponge. common name for members of the aquatic animal phylum Porifera Porifera[Lat.,=pore bearer], animal phylum consisting of the organisms commonly called sponges. It is the only phylum of the animal subkingdom Parazoa and represents the least evolutionarily advanced group of the animal kingdom....."}, {"url": "http://encyclopedia2.thefreedictionary.com/Porifera", "passage_text": "Porifera. (invertebrate zoology). The sponges, a phylum of the animal kingdom characterized by the presence of canal systems and chambers through which water is drawn in and released; tissues and organs are absent. The beating of flagella on collar cells or choanocytes, localized in chambers on the interior of the sponge, maintains the water current. Support for the sponge tissues is provided by calcareous or siliceous spicules, or by organic fibers, or by a combination of organic fibers and siliceous spicules."}, {"url": "http://www.merriam-webster.com/dictionary/Porifera", "passage_text": "Origin of PORIFERA. New Latin, from Latin porus pore + -i- + -fera, neuter plural of-fer-ferous. This word doesn't usually appear in our free dictionary, but the definition from our premium Unabridged Dictionary is offered here on a limited basis. Note that some information is displayed differently in the Unabridged."}, {"url": "http://encyclopedia2.thefreedictionary.com/Porifera", "passage_text": "(pōrĭf`ərə) [Lat.,=pore bearer], animal phylum consisting of the organisms commonly called sponges sponge,common name for members of the aquatic animal phylum Porifera, and for the dried, processed skeletons of certain species used to hold water. The beating of flagella on collar cells or choanocytes, localized in chambers on the interior of the sponge, maintains the water current. Support for the sponge tissues is provided by calcareous or siliceous spicules, or by organic fibers, or by a combination of organic fibers and siliceous spicules."}, {"url": "http://study.com/academy/lesson/phylum-porifera-definition-characteristics-examples.html", "passage_text": "In fact, the vast number of pores in a sponge's body is actually where the phylum derives its name from; Porifera literally means 'bearing pores.'. The most abundant pores, called ostia, are used to draw water into the animal's interior cavity, called the spongocoel. However, here we will focus on the key features of Porifera: choanocytes and spicules (formed by sclerocyte cells). Choanocytes, also known as collar cells, derive their name from the collar-like base where the flagellum (or tail) protrudes."}, {"url": "https://en.wikipedia.org/wiki/Sponge", "passage_text": "Sponges are animals of the phylum Porifera (/pɒˈrɪfərə/ ; meaning pore bearer). They are multicellular organisms that have bodies full of pores and channels allowing water to circulate through them, consisting of jelly-like mesohyl sandwiched between two thin layers of cells. "}, {"url": "http://encyclopedia2.thefreedictionary.com/Porifera", "passage_text": "Porifera. The sponges, a phylum of the animal kingdom which includes about 5000 described species. The body plan of sponges is unique among animals. Currents of water are drawn through small pores, or ostia, in the sponge body and leave by way of larger openings called oscula. The beating of flagella on collar cells or choanocytes, localized in chambers on the interior of the sponge, maintains the water current. Support for the sponge tissues is provided by calcareous or siliceous spicules, or by organic fibers, or by a combination of organic fibers and siliceous spicules."}, {"url": "http://www.thefreedictionary.com/poriferan", "passage_text": "poriferan. n. 1. (Animals) any invertebrate of the phylum Porifera, which comprises the sponges. adj. 2. (Animals) of, relating to, or belonging to the phylum Porifera. Noun. 1. poriferan-primitive multicellular marine animal whose porous body is supported by a fibrous skeletal framework; usually occurs in sessile colonies. parazoan, sponge. invertebrate-any animal lacking a backbone or notochord; the term is not used as a scientific classification."}, {"url": "http://study.com/academy/lesson/phylum-porifera-definition-characteristics-examples.html", "passage_text": "Why, you ask? Well, the term Porifera is actually the scientific name given to the group of organisms known commonly as sponges. But, unlike SpongeBob, living sponges are neither square in shape nor in interest-they are actually a really important and diverse phylum within the animal kingdom. However, here we will focus on the key features of Porifera: choanocytes and spicules (formed by sclerocyte cells). Choanocytes, also known as collar cells, derive their name from the collar-like base where the flagellum (or tail) protrudes."}, {"url": "http://www.merriam-webster.com/dictionary/Porifera", "passage_text": "Definition of PORIFERA. : a phylum of primitive invertebrate animals comprising the sponges and having a cellular grade of construction without true tissue or organ formation but with the body permeated by canals and chambers through which a current of water flows and passes in its course through one or more cavities lined with choanocytes. New Latin, from Latin porus pore + -i- + -fera, neuter plural of-fer-ferous. This word doesn't usually appear in our free dictionary, but the definition from our premium Unabridged Dictionary is offered here on a limited basis. Note that some information is displayed differently in the Unabridged."}]