[{"url": "http://www.wisegeek.com/what-is-the-mucosa.htm", "passage_text": "The glans penis is considered a mucosa. Mucosa is commonly found in the respiratory tract. The mucosa can be found in the body's urinary tracts. Mucosa is commonly found in the body's digestive tract. It is commonly found in the body's digestive, respiratory, reproductive and urinary tracts. The term mucosa is the singular form of the mucous membrane; more than one mucosa requires the use of the term mucosae instead. The mucous membrane is so named because it secretes mucus."}, {"url": "http://www.answers.com/Q/What_is_the_function_of_the_respiratory_mucosa", "passage_text": "The function of the mucosa is to warm and humidify air entering through the nose as well as to help to filter out unwanted particles in the air. 7 people found this useful. Edit. The function of the respiratory system is to allow gas exchange it, taking oxygen into the blood and removing carbon dioxide from the blood. The oxygen absorbed is used by the …. 30"}, {"url": "http://www.answers.com/Q/What_is_the_function_of_the_respiratory_mucosa", "passage_text": "Over 125ml of mucus produced each day forms a mucous blanket over much of the respiratory … mucosa. Mucus serves as an air purification mechanism by trapping inspired irritants such as dust and pollen etc. Cilia on mucousal cells beat in only one direction, moving mucus upward to the pharynx for removal. The function of the respiratory system is to allow gas exchange it, taking oxygen into the blood and removing carbon dioxide from the blood. The oxygen absorbed is used by the …. 30 people found this useful."}, {"url": "http://www.answers.com/Q/What_is_the_respiratory_mucosa", "passage_text": "The function of the mucosa is to warm and humidify air entering through the nose as well as to help to filter out unwanted particles in the air. Specialized membrane that lines the air distrubution tubes in the respiratory tree. Over 125ml of mucus produced each day forms a mucous blanket over much of the respiratory … mucosa. Mucus serves as an air purification mechanism by trapping inspired irritants such as dust and pollen etc."}, {"url": "http://www.wisegeek.com/what-is-the-mucosa.htm", "passage_text": "The mucosa, also known as the mucous membrane, is a soft, moist and pink layer of cells that lines several passages and cavities of the body with openings exposed to the external environment. It is commonly found in the body's digestive, respiratory, reproductive and urinary tracts. The term mucosa is the singular form of the mucous membrane; more than one mucosa requires the use of the term mucosae instead. The mucous membrane is so named because it secretes mucus."}, {"url": "http://www.wisegeek.org/what-is-a-mucous-membrane.htm", "passage_text": "The interior lining of the nose is a mucous membrane. Healthy lung function is aided by a thin mucus lining. The mucous membrane that lines the urogenital tract can make someone vulnerable to infections passed between sexual partners. Mucosa is commonly found in the respiratory tract. "}, {"url": "http://www.improve.com/Respiratory-Mucosa/3442", "passage_text": "Respiratory Mucosa serves the very important role of protecting the lungs by tapping dirt and debris in mucus. Mucus is formed by tissues covering the bronchioles, trachea, and bronchus. Specialized glands along with epithelial cells produce a thick substance that is able to catch foreign particles... "}, {"url": "http://www.wisegeek.com/what-is-the-mucosa.htm", "passage_text": "The nasal mucosa, which provides the mucous lining of the nostrils among other parts of the nasal cavity, is probably the best known type of this membrane. It prevents agents such as dust, bacteria, allergens and pollutants from entering the respiratory system. It is commonly found in the body's digestive, respiratory, reproductive and urinary tracts. The term mucosa is the singular form of the mucous membrane; more than one mucosa requires the use of the term mucosae instead. The mucous membrane is so named because it secretes mucus."}, {"url": "http://www.answers.com/Q/What_is_the_respiratory_mucosa", "passage_text": "What is the function of the respiratory mucosa? As with all mucus in the body, its a lubricant to keep the lungs moist, prevents the lung lining from sticking to itself and prevents foreign body's like bacterium and dust fr … om in bedding into the lungs causing infection. Specialized membrane that lines the air distrubution tubes in the respiratory tree. Over 125ml of mucus produced each day forms a mucous blanket over much of the respiratory … mucosa. Mucus serves as an air purification mechanism by trapping inspired irritants such as dust and pollen etc."}, {"url": "http://www.medilexicon.com/medicaldictionary.php?t=56374", "passage_text": "The definition information for respiratory mucosa is provided by Stedman's. You can search our medical dictionary here. Stedman's, part of Lippincott Williams & Wilkins, provides a comprehensive line of health-science publications for healthcare professionals and medical students. "}]