[{"url": "http://www.corinthian67.org/", "passage_text": "Our Masonic lodge is located in Farmington, Minnesota and draws brothers from Farmington, Lakeville, Apple Valley, Rosemount and the surrounding areas. Please feel free to look around and learn about our lodge or if you are a brother of our lodge, check our upcoming events. "}, {"url": "http://corinthian241.org/", "passage_text": "Welcome to the website of Corinthian Lodge #241 of Rochester, Michigan. We meet on Monday evenings at the Rochester Masonic Lodge at 318 Walnut Street. This site is intended for use by members of our lodge and any interested visitors. "}, {"url": "http://knoxcorinthian.org/", "passage_text": "Knox-Corinthian Masonic Lodge #851, A.F & A.M., is a daylight lodge that meets at noon on the third Tuesday of each month in the Dallas Scottish Rite Cathedral Green Room.. Installation of WM David Dean and his officers. "}, {"url": "http://corinthianlodge63.org/", "passage_text": "Anthony Amendola Eagle Scout Project. A few years back, Corinthian Lodge sponsored the chartering of a new Boy Scout Troop. Since that time Troop 805 has been holding its meetings in the Lodge Hall and continues to grow and thrive. Anthony Amendola (son of Bro. Michael Amendola) is the first scout from Troop 805 to start his Eagle Scout Project."}, {"url": "http://www.corinthian11.org/", "passage_text": "Making Good Men Better. Welcome to the official site of Corinthian Masonic Lodge No. 11 Free and Accepted Masons of South Carolina Home Page. Our regular stated meeting is on the 2nd Thursday of each month. Our Lodge was chartered on October 1900. "}, {"url": "http://www.masonpost.com/sc/corinthian416/", "passage_text": "Regular and Recognized. Corinthian Lodge #416 is a Regular and Recognized masonic lodge located in Newport, SC, having a charter through the Grand Lodge of SC, AFM, which is recognized by the United Grand Lodge of England. Search."}, {"url": "http://corinthianlodge63.org/", "passage_text": "The January Trestleboard is available for download. A few years back, Corinthian Lodge sponsored the chartering of a new Boy Scout Troop. Since that time Troop 805 has been holding its meetings in the Lodge Hall and continues to grow and thrive. Anthony Amendola (son of Bro. Michael Amendola) is the first scout from Troop 805 to start his Eagle Scout Project."}, {"url": "http://www.corinthianlodge.com/", "passage_text": "Welcome to Corinthian Lodge #96. Freemasonry is a fraternal organisation that traces its origins to the local fraternities of stonemasons, which from the end of the fourteenth century regulated the qualifications of masons and their interaction with authorities and clients. Pay Membership Dues Online!"}, {"url": "http://www.masonpost.com/tn/corinthian414/", "passage_text": "Corinthian Lodge #414 is a Regular and Recognized masonic lodge located in Nashville, TN, having a charter through the Grand Lodge of TN, F&AM, which is recognized by the United Grand Lodge of England. "}]