[{"url": "http://www.waterandhealth.org/swimming-shower/", "passage_text": "Showering before swimming helps keep swimming healthy for everyone in the pool. As the weather heats up and thoughts turn to swimming and cooling off in the pool, the Water Quality & Health Council is highlighting a contradictory finding from our recent swimmer hygiene survey."}, {"url": "https://in.answers.yahoo.com/question/index?qid=20090415040221AAcLLyC", "passage_text": "Use a water resistant sunscreen before entering the pool and after coming out of the pool use a good soap and wash your hair with a mild shampoo and put a moisturizer."}, {"url": "http://amrita-sharma.blogspot.com/2012/03/things-to-do-beforeafter-swimming.html", "passage_text": "3. Take shower in the pool shower room before you expose your skin to chlorine. After Swimming. 1. Take a shower with normal water/soap to remove the chemicals as soon as you get out of the pool. Wash your hair too if you are not wearing a cap. 2. Being in water for a long time can make your skin dry and itchy."}, {"url": "http://www.wikihow.com/Shock-Your-Swimming-Pool", "passage_text": "1. Dissolve the pool shock chemicals. This must be done before adding the pool shock chemicals to the swimming pool. All forms of pool shock chemicals are granular and should dissolve relatively quickly. 1  Fill a 5-gallon/19 liter (5.0 US gal) bucket with water from the pool. 2  Slowly pour the granular pool shock into the bucket of water."}, {"url": "http://www.waterandhealth.org/swimming-shower/", "passage_text": "The Centers for Disease Control and Prevention (CDC) urges people to shower with soap before swimming as part of Three Steps for All Swimmers to Protect Against Recreational Water Illnesses. Yet, our survey found 44 percent of people do not believe it is necessary to shower before going in the pool."}, {"url": "http://www.ctvnews.ca/health/health-headlines/do-i-have-to-shower-before-swimming-pool-safety-questions-answered-1.1346881", "passage_text": "1 Shower before swimming, and use soap, particularly on the hands and backs of the legs. 2  If you leave the pool to go to the washroom, take a rinse shower again before going back in. 3  Wash hands with soap and water after using the toilet or changing diapers."}]