[{"url": "http://courseweb.edteched.uottawa.ca/medicine-histology/English/SS_BasicTissues/Connective_Tissue.htm", "passage_text": "Bone is a connective tissue that is characterized by a mineralized extracellular matrix. The matrix is secreted by cells called osteocytes. It consists mostly of mineralized collagen fibres arranged in lamellae. What little ground substance is present is also mineralized. Connective tissue is the most diverse of the four tissue types with a wide variety of functions. It ranges in consistency from the gel-like softness of areolar connective tissue to the hardness of bone. Blood is also a connective tissue."}, {"url": "http://district.bluegrass.kctcs.edu/rmccane0001/shared_files/bio137website/BIO137/137Tissues/Cartilage.html", "passage_text": "Identification: The numerous round, red blood cells in a featureless matrix are unmistakable. Features to Know: the liquid matrix is called the plasma. The numerous round, red cells are erythrocytes (or red blood cells) that lack nuclei (the center of the cell is depressed and thus may appear lighter colored)."}, {"url": "http://www.training.seer.cancer.gov/leukemia/anatomy/composition.html", "passage_text": "Composition of the Blood. When a sample of blood is spun in a centrifuge, the cells and cell fragments are separated from the liquid intercellular matrix. Because the formed elements are heavier than the liquid matrix, they are packed in the bottom of the tube by the centrifugal force. The light yellow colored liquid on the top is the plasma, which accounts for about 55 percent of the blood volume and red blood cells is called the hematocrit ,or packed cell volume (PCV). The white blood cells and platelets form a thin white layer, called the buffy coat, between plasma and red blood cells."}, {"url": "http://courseweb.edteched.uottawa.ca/medicine-histology/English/SS_BasicTissues/Connective_Tissue.htm", "passage_text": "Connective Tissue A really diverse group of tissues: Connective tissue is the most diverse of the four tissue types with a wide variety of functions. It ranges in consistency from the gel-like softness of areolar connective tissue to the hardness of bone. Blood is also a connective tissue."}, {"url": "https://answers.yahoo.com/question/index?qid=20080724152029AAd2siv", "passage_text": "Answers. Best Answer: The matrix of blood is called plasma. All of the kinds of blood cells (red, white, and platelets) are suspended in blood plasma, along with various dissolved solutes such as Na+ and clotting factors. The main difference between this matrix and those of other tissues is that plasma is liquid, whereas other types of tissues have solid or semisolid matrices. Plasma also doesn't remain solely in the circulatory system-a small amount is squeezed out of the capillarie"}, {"url": "http://www.siumed.edu/~dking2/intro/blood.htm", "passage_text": "Blood is traditionally classified as a specialized form of connective tissue. To appreciate the basic unity of blood and other varieties of connective tissue, consider the following. Blood is a highly specialized, fluid tissue. Blood is traditionally classified as a specialized form of connective tissue. To appreciate the basic unity of blood and other varieties of connective tissue, consider the following. 1  All of the several blood cell types originate in the connective tissue of bone marrow."}, {"url": "http://www.answers.com/Q/What_is_the_matrix_in_blood_called", "passage_text": "1 Possible Causes of Blood in the Stool While blood in your stool is frightening, it doesn't necessarily indicate that anything serious is wrong. 2  Blood in stool has many causes and possibly looks different dependin…. 3  The Five Major Parts of the Brain At its most basic, the brain controls the body. Mathematics: A two dimensional grid of numbers. Biology: The matrix is a part near the origin of your toe or fingernail where the nail grows from. Movie: The Matrix is the … world that has blinded you from the truth. The Matrix is control."}, {"url": "http://courseweb.edteched.uottawa.ca/medicine-histology/English/SS_BasicTissues/Connective_Tissue.htm", "passage_text": "Cartilage is a connective tissue whose cells, called chondrocytes, secrete a very specialized matrix. The basophilia of the matrix is due to the GAGs in its ground substance, specifically hyaluronic acid, chondroitin sulfate and keratan sulfate. Connective tissue is the most diverse of the four tissue types with a wide variety of functions. It ranges in consistency from the gel-like softness of areolar connective tissue to the hardness of bone. Blood is also a connective tissue."}, {"url": "http://www.siumed.edu/~dking2/intro/ct.htm", "passage_text": "As a result of this basic topology, other tissues are either supported upon connective tissue (epithelial surfaces), invaginated into connective tissue (glandular epithelium), or embedded within the connective tissue (blood vessels, muscles, and nerves). The extracellular matrix of connective tissue is composed of ground substance and fibers. In ordinary connective tissue, the ground substanc e consists mainly of water. The principal fiber type is collagen (the most abundant protein in the body), with elastic fibers as a minor element."}, {"url": "http://www.answers.com/Q/What_is_the_matrix_in_blood_called", "passage_text": "Bone cells that liquefy the bone matrix and release calcium into  the blood are called Osteoclasts. Immature or matrix depositing  bone cells are called osteoblasts. Mathematics: A two dimensional grid of numbers. Biology: The matrix is a part near the origin of your toe or fingernail where the nail grows from. Movie: The Matrix is the … world that has blinded you from the truth. The Matrix is control."}]