[{"url": "http://www.constitutionfacts.com/us-declaration-of-independence/fourth-of-july/", "passage_text": "The Story of the Fourth of July. The Declaration of Independence. We celebrate American Independence Day on the Fourth of July every year. We think of July 4, 1776, as a day that represents the Declaration of Independence and the birth of the United States of America as an independent nation. But July 4, 1776 wasn't the day that the Continental Congress decided to declare independence (they did that on July 2, 1776)."}, {"url": "http://www.theusaonline.com/history/independence.htm", "passage_text": "During the war--on July 4, 1776--the colonists boldly declared their independence from their British rulers. In 1783, they defeated the British and established their claim to independence. The Seven Years' War. Great Britain and France had struggled for control of eastern North America throughout the colonial period."}, {"url": "http://www.history.com/this-day-in-history/american-colonies-declare-independence", "passage_text": "On this day in 1776, in Philadelphia, Pennsylvania, the Continental Congress adopts the Declaration of Independence, which proclaims the independence of a new United States of America from Great Britain and its king."}, {"url": "http://www.history.com/this-day-in-history/american-colonies-declare-independence", "passage_text": "On August 2, the declaration was signed. The American War for Independence would last for five years. Yet to come were the Patriot triumphs at Saratoga, the bitter winter at Valley Forge, the intervention of the French and the final victory at Yorktown in 1781."}, {"url": "https://history.state.gov/milestones/1776-1783/declaration", "passage_text": "The Declaration of Independence, 1776. By issuing the Declaration of Independence, adopted by the Continental Congress on July 4, 1776, the 13 American colonies severed their political connections to Great Britain. The Declaration summarized the colonists’ motivations for seeking independence."}]