[{"url": "http://www.innerbody.com/image/endoov.html", "passage_text": "Hormones can only affect target cells that have the appropriate receptors. This property of hormones is known as specificity. Hormone specificity explains how each hormone can have specific effects in widespread parts of the body. Many hormones produced by the endocrine system are classified as tropic hormones. A tropic hormone is a hormone that is able to trigger the release of another hormone in another gland. Tropic hormones provide a pathway of control for hormone production as well as a way for glands to be controlled in distant regions of the body. 1 The anterior pituitary produces 6 important hormones: 2  Thyroid stimulating hormone (TSH), as its name suggests, is a tropic hormone responsible for the stimulation of the thyroid gland. 3  Adrenocorticotropic hormone (ACTH) stimulates the adrenal cortex, the outer part of the adrenal gland, to produce its hormones."}, {"url": "http://courses.washington.edu/conj/bess/hormonal/hormonal.html", "passage_text": "For polar hormones, tropic hormones stimulate endocrine secretion by stimulating cell secretion; that is, exocytosis. An example is the regulation of growth hormone (GH) secretion by the tropic hormone growth hormone releasing hormone (GHRH) . GHRH is a hypophysiotropic hormone. (Recall that endocrine secretion is whatever occurs to increase the amount of hormone in the circulation). An example is the hormone adrenocorticotropic hormone (ACTH) that stimulates secretion of the steroid hormone cortisol by cells of the zona fasciculata in the adrenal cortex."}, {"url": "https://en.wikipedia.org/wiki/Hormone", "passage_text": "One special group of hormones is the tropic hormones that stimulate the hormone production of other endocrine glands. For example, thyroid-stimulating hormone (TSH) causes growth and increased activity of another endocrine gland, the thyroid, which increases output of thyroid hormones. Hormone synthesis may occur in specific tissues of endocrine glands or in other specialized cells. Hormone synthesis occurs in response to specific biochemical signals induced by a wide range of regulatory systems."}, {"url": "https://en.wikipedia.org/wiki/Thyroid-stimulating_hormone", "passage_text": "From Wikipedia, the free encyclopedia. Thyroid-stimulating hormone (also known as thyrotropin, TSH, or hTSH for human TSH) is a pituitary hormone that stimulates the thyroid gland to produce thyroxine (T 4), and then triiodothyronine (T 3) which stimulates the metabolism of almost every tissue in the body. The hypothalamus, in the base of the brain, produces thyrotropin-releasing hormone (TRH). TRH stimulates the pituitary gland to produce TSH. Somatostatin is also produced by the hypothalamus, and has an opposite effect on the pituitary production of TSH, decreasing or inhibiting its release."}, {"url": "https://en.wikipedia.org/wiki/Hormone", "passage_text": "Hormone cells are typically of a specialized cell type, residing within a particular endocrine gland, such as the thyroid gland, ovaries, and testes. Hormones exit their cell of origin via exocytosis or another means of membrane transport. Hormone synthesis may occur in specific tissues of endocrine glands or in other specialized cells. Hormone synthesis occurs in response to specific biochemical signals induced by a wide range of regulatory systems."}, {"url": "http://courses.washington.edu/conj/bess/hormonal/hormonal.html", "passage_text": "Hormonal regulation of hormone release involves a hormone binding to its receptor on an endocrine cell to regulate hormonal secretion. A hormone that stimulates hormone secretion is called a tropic hormone. Tropic hormones may also stimulate proliferation of endocrine cells. (Recall that endocrine secretion is whatever occurs to increase the amount of hormone in the circulation). An example is the hormone adrenocorticotropic hormone (ACTH) that stimulates secretion of the steroid hormone cortisol by cells of the zona fasciculata in the adrenal cortex."}, {"url": "https://en.wikipedia.org/wiki/Hormone", "passage_text": "A hormone (from Greek ὁρμή, impetus) is any member of a class of signaling molecules produced by glands in multicellular organisms that are transported by the circulatory system to target distant organs to regulate physiology and behaviour. Hormone synthesis may occur in specific tissues of endocrine glands or in other specialized cells. Hormone synthesis occurs in response to specific biochemical signals induced by a wide range of regulatory systems."}, {"url": "http://courses.washington.edu/conj/bess/hormonal/hormonal.html", "passage_text": "Other examples of peptide hormones that stimulate nonpolar hormone release are the gonadotropins (FSH and LH) that control gonadal steroid secretion, and thyroid stimulating hormone (TSH) that controls thyroid hormone secretion. (Recall that endocrine secretion is whatever occurs to increase the amount of hormone in the circulation). An example is the hormone adrenocorticotropic hormone (ACTH) that stimulates secretion of the steroid hormone cortisol by cells of the zona fasciculata in the adrenal cortex."}, {"url": "http://courses.washington.edu/conj/bess/hormonal/hormonal.html", "passage_text": "For a nonpolar hormone, the tropic hormone stimulates endocrine secretion by stimulating hormone synthesis in the endocrine cell. (Recall that endocrine secretion is whatever occurs to increase the amount of hormone in the circulation). An example is the hormone adrenocorticotropic hormone (ACTH) that stimulates secretion of the steroid hormone cortisol by cells of the zona fasciculata in the adrenal cortex."}, {"url": "http://www.innerbody.com/image/endoov.html", "passage_text": "The nervous system can control hormone levels through the action of the hypothalamus and its releasing and inhibiting hormones. For example, TRH produced by the hypothalamus stimulates the anterior pituitary to produce TSH. Tropic hormones provide another level of control for the release of hormones. 1 The anterior pituitary produces 6 important hormones: 2  Thyroid stimulating hormone (TSH), as its name suggests, is a tropic hormone responsible for the stimulation of the thyroid gland. 3  Adrenocorticotropic hormone (ACTH) stimulates the adrenal cortex, the outer part of the adrenal gland, to produce its hormones."}]