[{"url": "http://www.definitions.net/definition/gluconolactone", "passage_text": "Gluconolactone. Glucono delta-lactone, also known as gluconolactone, is a food additive with the E number E575 used as a sequestrant, an acidifier, or a curing, pickling, or leavening agent. It is a lactone of D-gluconic acid. Pure GDL is a white odorless crystalline powder. Glucono delta-lactone, also known as gluconolactone, is a food additive with the E number E575 used as a sequestrant, an acidifier, or a curing, pickling, or leavening agent. It is a lactone of D-gluconic acid"}, {"url": "http://www.thedermreview.com/gluconolactone/", "passage_text": "Gluconolactone. Gluconolactone: Ingredient Overview. When you’re trying to fight the signs of aging, such as fine lines and wrinkles, understanding the ingredients of the serums you use is vital, and one ingredient you may notice in your anti-aging serums is Gluconolactone. What to Expect from Gluconolactone. If you are considering the use of products that contain Gluconolactone, you may be wondering how effective this ingredient is when compared to AHAs or beta hydroxy acids that are usually used more frequently."}, {"url": "http://www.experts123.com/q/what-is-gluconolactone-gdl-and-is-it-gluten-free.html", "passage_text": "0. Gluconolactone (GDL) is a gluten-free, fermented food starch derived from corn. Once processed into a pure white, crystalline powder, it carries none of the characteristics of corn. It has been used to make cottage cheese and bread for many years. The final product can be found in its natural state in bee's honey. "}, {"url": "http://www.cosmeticsinfo.org/ingredient/gluconolactone", "passage_text": "Gluconolactone, also called glucono delta-lactone, is an ester of Gluconic Acid. Pure Gluconolactone is a white, odorless crystalline powder. Gluconolactone is formed by the removal of water from Gluconic Acid. Gluconic Acid is a carboxylic acid. Safety Information: The Food and Drug Administration (FDA) includes Gluconolactone (glucono delta-lactone), Calcium Gluconate, Copper Gluconate, Ferrous Gluconate and Manganese Gluconate on its list of direct food substances affirmed as Generally Recognized as Safe (GRAS)."}, {"url": "http://www.thedermreview.com/gluconolactone/", "passage_text": "Gluconolactone is a polyhydroxy acid, which differs from alpha and beta hydroxy acids, such as lactic acid and glycolic acid. While these other acids can often be found in anti-aging creams, serums, and facial peels, they can be damaging to the skin if used in high concentrations. What to Expect from Gluconolactone. If you are considering the use of products that contain Gluconolactone, you may be wondering how effective this ingredient is when compared to AHAs or beta hydroxy acids that are usually used more frequently."}, {"url": "http://www.ingredientstodiefor.com/item.php?item_id=565", "passage_text": "A natural preservative that is a combination of a naturally occurring food additive glucono delta lactone, derived from corn, and a food grade preservative sodium benzoate, the sodium salt of benzoic acid, along with a trace amount of calcium gluconate as a processing agent. "}, {"url": "https://www.truthinaging.com/ingredients/gluconolactone", "passage_text": "According to a study featured in Dermatologic Surgery journal, Gluconolactone is a polyhydroxy acid (PHA) that is capable of chelating metals and may also function by scavenging free radicals, thereby protecting skin from some of the damaging effects of UV radiation. Safety Measures/Side Effects: There are no warnings regarding the use of Gluconolactone, and because of its PHA composition, it may be safer than products containing AHA or BHA. Pregnant women should still consult a doctor before using products with Gluconolactone.* An antioxidant polyhydroxy acid (PHA) that is capable of chelating metals. Functions: Gluconolactone is composed of multiple water-attracting hydroxyl groups, which hydrate the skin, resulting in enhanced degrees of moisturization."}, {"url": "https://en.wikipedia.org/wiki/Glucono_delta-lactone", "passage_text": "Glucono delta-lactone (GDL), also known as gluconolactone, is a food additive with the E number E575 used as a sequestrant, an acidifier, or a curing, pickling, or leavening agent. It is a lactone (cyclic ester) of. - gluconic acid. Pure GDL is a white odorless crystalline powder. It is metabolized to glucose; one gram of GDL yields roughly the same amount of metabolic energy as one gram of sugar. Upon addition to water, GDL is partially hydrolysed to gluconic acid, with the balance between the lactone form and the acid form established as a chemical equilibrium."}]