[{"url": "http://harrypotter.wikia.com/wiki/Harry_Potter_(film_series)", "passage_text": "1 The book series and film series were released over a ten year period. 2  The Philosopher's Stone was first published in the UK in 1997, with the final book The Deathly Hallows published in 2007. "}, {"url": "http://www.answers.com/Q/When_was_Harry_Potter_and_the_Philosopher's_Stone_released_in_theatres", "passage_text": "Harry Potter and the Philosopher's Stone was first published  in the UK on the 26th June 1997. It was released on the 1st  September 1998 in the US with the title Harry Pott … er and the  Sorcerer's Stone.   The movie was released on the 16th November 2001 in the UK and US. The first book and movie in the Harry Potter series, in  America it is known as Harry Potter and the Sorcerer's  Stone.    The story follows Harry, an eleven year old … boy who discovers he is  a wizard and begins attending Hogwarts School of Witchcraft and  Wizarding."}, {"url": "https://en.wikipedia.org/wiki/Harry_potter_movie", "passage_text": "The fifth film, Harry Potter and the Order of the Phoenix, was released by Warner Bros. on 11 July 2007 in English-speaking countries, except for the UK and Ireland, which released the movie on 12 July. Late in 1997, film producer David Heyman's London offices received a copy of the first book in what would become Rowling's series of seven Harry Potter novels."}, {"url": "https://en.wikipedia.org/wiki/Harry_potter_movie", "passage_text": "Harry Potter is a British film series based on the Harry Potter novels by author J. K. Rowling. The series is distributed by Warner Bros. and consists of eight fantasy films beginning with Harry Potter and the Philosopher's Stone (2001) and culminating with Harry Potter and the Deathly Hallows – Part 2 (2011). Late in 1997, film producer David Heyman's London offices received a copy of the first book in what would become Rowling's series of seven Harry Potter novels."}, {"url": "http://www.history.com/this-day-in-history/final-harry-potter-book-released", "passage_text": "Rowling’s first novel, Harry Potter and the Philosopher’s Stone, debuted in Britain in 1997 (it was retitled Harry Potter and the Sorcerer’s Stone when it was released in America the next year) and went on to become an international bestseller. "}, {"url": "http://www.answers.com/Q/When_was_Harry_Potter_and_the_Philosopher's_Stone_released_in_theatres", "passage_text": "Harry Potter and the Philosopher's Stone was released on the 16th of November 2001 in the UK & US. It was released under the title Harry Potter and the Sorcerer's Stone in the US. The first book and movie in the Harry Potter series, in  America it is known as Harry Potter and the Sorcerer's  Stone.    The story follows Harry, an eleven year old … boy who discovers he is  a wizard and begins attending Hogwarts School of Witchcraft and  Wizarding."}, {"url": "http://www.hypable.com/10-years-ago-today-the-first-harry-potter-film-was-released-in-theaters/", "passage_text": "Today is a landmark day in Harry Potter history. On this day in 2001, Harry Potter and the Philosopher’s/Sorcerer’s Stone hit theaters! We want you to share your story about seeing the film in theaters that first time! You can see the theatrical trailer for the film and several posters below. "}, {"url": "https://en.wikipedia.org/wiki/Harry_Potter_and_the_Philosopher%27s_Stone_(film)", "passage_text": "Harry Potter and the Philosopher's Stone (released in some territories with the alternative subtitle the Sorcerer's Stone) is a 2001 fantasy film directed by Chris Columbus and distributed by Warner Bros. Pictures. It is based on the novel of the same name by J. K. Rowling. The film stars Daniel Radcliffe as Harry Potter, with Rupert Grint as Ron Weasley, and Emma Watson as Hermione Granger. It is followed by seven sequels in total, beginning with Harry Potter and the Chamber of Secrets. Warner Bros. bought the film rights to the book in 1999 for a reported £ 1 million."}, {"url": "https://en.wikipedia.org/wiki/Harry_Potter_and_the_Philosopher%27s_Stone_(film)", "passage_text": "The film, which is the first instalment in the Harry Potter film series, was written by Steve Kloves and produced by David Heyman. The story follows Harry Potter 's first year at Hogwarts as he discovers that he is a famous wizard and begins his magical education. The film stars Daniel Radcliffe as Harry Potter, with Rupert Grint as Ron Weasley, and Emma Watson as Hermione Granger. It is followed by seven sequels in total, beginning with Harry Potter and the Chamber of Secrets. Warner Bros. bought the film rights to the book in 1999 for a reported £ 1 million."}]