[{"url": "http://www.everydayhealth.com/drugs/verapamil", "passage_text": "A: Some of the more common side effects of verapamil are constipation, dizziness, nausea, headache, hypotension, edema, skin rash/itching and fatigue. This list is not complete and others may occur. If you think you are having problems or complications from your medication, be sure to notify your doctor."}, {"url": "http://www.drugs.com/verapamil.html", "passage_text": "Common verapamil side effects may include: constipation; headache; dizziness; or. stuffy nose, sinus pain, sore throat. This is not a complete list of side effects and others may occur."}, {"url": "http://www.rxlist.com/isoptin-side-effects-drug-center.htm", "passage_text": "Common side effects of Isoptin SR (verapamil HCl) include dizziness, slow heartbeat, constipation, nausea, headache, tiredness, skin rash or itching, or warmth, itching, redness, or tingly feeling under your skin. The starting dose of sustained-release verapamil is 180 mg, given in the morning."}, {"url": "http://www.drugs.com/verapamil.html", "passage_text": "feeling like you might pass out. Common verapamil side effects may include: constipation; headache; dizziness; or. stuffy nose, sinus pain, sore throat. This is not a complete list of side effects and others may occur. Call your doctor for medical advice about side effects."}, {"url": "http://www.lifescript.com/health/centers/migraine/s.aspx?query=Verapamil%20Side%20Effects", "passage_text": "Verapamil may cause side effects. ... Some side effects can be serious. ... If you experience a serious side effect, you or your doctor may send a report to the Food and Drug Administration's (FDA) MedWatch Adverse Event Reporting program online [at Web Site ] or by phone [1-800 ..."}, {"url": "http://www.lifescript.com/health/centers/migraine/s.aspx?query=Verapamil%20Side%20Effects", "passage_text": "Trandolapril and verapamil may cause side effects. ... If you experience a serious side effect, you or your doctor may send a report to the Food and Drug Administration's (FDA) MedWatch Adverse Event Reporting program online [at Web Site ] or by phone [1-800-332-1088]. ..."}, {"url": "http://www.rxlist.com/calan-side-effects-drug-center.htm", "passage_text": "Less serious side effects may include: 1  constipation, nausea; 2  skin rash or itching; 3  dizziness, headache, tired feeling; or. 4  warmth, itching, redness, or tingly feeling under your skin."}, {"url": "http://www.rxlist.com/calan-side-effects-drug-center.htm", "passage_text": "Calan is available in generic form. Common side effects of Calan include dizziness, slow heartbeat, constipation, nausea, headache, tiredness, skin rash or itching, or warmth, itching, redness, or tingly feeling under your skin."}]