[{"url": "http://www.answers.com/Q/What_is_aviator_in_a_sentence_noun_pronoun_verb_predicate_etc.", "passage_text": "A pronoun is a word that takes the place of a noun in a sentence.    A verb is a word for an action or a s … tate of being.    Example: When the kids visited Aunt Jane, she made cookies for  them.    the nouns in the sentence are kids, Aunt Jane, cookies. The word doesn't is a contraction, a shortened  form for the verb 'does' and the adverb 'not'. The  contraction doesn't functions in a sentence as a  verb or an auxiliary v … erb. Examples:    The red pair fits but the black pair does not."}, {"url": "http://humbleapostrophe.com/nouns/", "passage_text": "A noun is a naming word [shoe, table, car, computer]. verb is an action word [a *doing* word e.g. run, type, talk]. A pronoun is a word used as a place-holder for a noun, or a noun phrase, or a different pronoun. An adjective is a * describing * word used with a * noun * [naming word], to express a quality or circumstance, such as *blue sky* [blue is the adjective, sky is the noun]. A vowel is one of these five letters: a, e, i, o, u. A consonant is every other letter of the alphabet, which is *not* a vowel."}, {"url": "http://humbleapostrophe.com/nouns/", "passage_text": "An adverb is a word which modifies a verb, adjective, or other adverb, such as *running quickly* [where *quickly* is the adverb], and where *quickly* tells you *how* the *running* was being done. An adjective is a * describing * word used with a * noun * [naming word], to express a quality or circumstance, such as *blue sky* [blue is the adjective, sky is the noun]. A vowel is one of these five letters: a, e, i, o, u. A consonant is every other letter of the alphabet, which is *not* a vowel."}, {"url": "http://humbleapostrophe.com/nouns/", "passage_text": "An objective personal pronoun indicates that the pronoun is acting as an object of a verb, compound verb, preposition, or infinitive phrase. An adjective is a * describing * word used with a * noun * [naming word], to express a quality or circumstance, such as *blue sky* [blue is the adjective, sky is the noun]. A vowel is one of these five letters: a, e, i, o, u. A consonant is every other letter of the alphabet, which is *not* a vowel."}, {"url": "https://en.wikipedia.org/wiki/Pronoun", "passage_text": "In linguistics and grammar, a pronoun is a word that substitutes for a noun or noun phrase. It is a particular case of a pro-form. This applies especially to third-person personal pronouns, and to relative pronouns. For example, in the sentence That poor man looks as if he needs a new coat, the antecedent of the pronoun he is the noun phrase that poor man. The adjective associated with pronoun is pronominal."}, {"url": "http://www.learnersdictionary.com/qa/nouns-and-pronouns", "passage_text": "A pronoun is a word that is used instead of a noun or noun phrase. Pronouns refer to nouns that have already been mentioned or are about to be mentioned. For instance, in example 1, below, the pronoun she in the 2nd sentence refers to the noun phrase the school principal in the 1st sentence. A noun phrase is a string of words, consisting of a noun plus any modifiers, that functions as a noun in a sentence. A noun phrase can act as a subject or an object. In the sentence below, ten of her friends from college is a noun phrase that acts as the object of the verb invited."}, {"url": "https://answers.yahoo.com/question/index?qid=20091016023255AAE7nUE", "passage_text": "(pronoun means for a noun) eg: I, we, you,he, she, it. 3.Adjective: Adjective is a word used with a noun to add something (kind,quality,quantity etc). eg:large,honest,five,lazy,etc., 4.Verb:A verb is a word that tells or asserts something about a person or thing. Report Abuse. A noun is the name of a person, place or thing. The word thing is used to mean anything that we can think of. A pronoun is a word used instead of a noun. (pronoun means for a noun) eg: I, we, you,he, she, it. Adjective is a word used with a noun to add something (kind,quality,quantity etc). eg:large,honest,five,lazy,etc., "}, {"url": "http://www.answers.com/Q/What_is_aviator_in_a_sentence_noun_pronoun_verb_predicate_etc.", "passage_text": "The word what'll is a contraction, a short form for the  interrogative pronoun 'what' and the auxiliary verb 'will'.   The contraction what'll functions as the subject an … d auxiliary verb  of an interrogative sentence.    This contraction is an informal form, used for the most part in  spoken English. The word doesn't is a contraction, a shortened  form for the verb 'does' and the adverb 'not'. The  contraction doesn't functions in a sentence as a  verb or an auxiliary v … erb. Examples:    The red pair fits but the black pair does not."}]