[{"url": "https://www.healthpocket.com/obamacare/cost-sharing-reduction-silver-plan", "passage_text": "Obamacare Cost-Sharing Reduction (CSR) Silver Plan Health Insurance. For individuals and families whose income does not exceed 250% of the Federal Poverty Limit (FPL), there are special “cost-sharing reduction” versions of Obamacare plans. These cost-sharing reduction (CSR) health insurance plans reduce the out-of-pocket expenses enrollees pay toward deductibles, copayments, and coinsurance. Cost-sharing reductions do not apply to medical services not covered by the health plan. Services rendered by healthcare providers outside the CSR health plan ’s network are typically not eligible for cost-sharing reductio"}, {"url": "http://kff.org/health-costs/issue-brief/cost-sharing-subsidies-in-federal-marketplace-plans/", "passage_text": "Cost-Sharing Subsidies in Federal Marketplace Plans. Feb 11, 2015 | Gary Claxton and Nirmita Panchal. Most health plans require enrollees to pay a portion of the cost of care when they seek services, in addition to any premium that they must pay for the plan. An out-of-pocket limit is the most that an enrollee must pay for cost sharing under a plan for covered health care services received from network providers. After an enrollee reaches his or her out-of-pocket limit, the plan pays all of the costs for covered services provided in network."}, {"url": "https://www.healthcare.gov/glossary/cost-sharing-reduction/", "passage_text": "Cost Sharing Reduction. A discount that lowers the amount you have to pay out-of-pocket for deductibles, coinsurance, and copayments. You can get this reduction if you get health insurance through the Marketplace, your income is below a certain level, and you choose a health plan from the Silver plan category. If you're a member of a federally recognized tribe, you may qualify for additional cost-sharing benefits"}, {"url": "https://www.healthcare.gov/lower-costs/save-on-out-of-pocket-costs/", "passage_text": "No. You can save on out-of-pocket costs only if you also qualify for a premium tax credit. 1  Households with income between 100% and 400% of the federal poverty level qualify for premium tax credits. 2  Households with income between 100% and 250% of the federal poverty level also qualify for out-of-pocket savings. When you enroll in coverage through the Marketplace, you may be able to save money on out-of-pocket costs – the payments you have to make for doctor’s visits, lab tests, drugs, and other covered services. Whether you save on out-of-pocket costs will depend on your household size and income."}, {"url": "http://www.healthreformbeyondthebasics.org/cost-sharing-charges-in-marketplace-health-insurance-plans-part-2/", "passage_text": "With the premium credit, he could get a silver plan by paying $121 per month of his own money, with the credit taking care of the remaining cost of getting the health insurance. With the cost-sharing reduction, he is able to get a plan with a deductible of $250. The plan also caps his out of pocket costs for in-network, covered benefits at $2,000 for the year. If John picks a bronze plan, he would pay nothing toward the premium because his premium credit covers the entire cost. The gold plan has an actuarial value of 80 percent (with, say, a $600 deductible and $25 physician-visit copayments), while the cost-sharing reduction John can get would make an 87 percent actuarial value plan available to him (with a $250 deductible and $15 physician copayments in our example)."}, {"url": "http://www.maine.gov/pfr/insurance/faq/Assistance_With_Costs.html", "passage_text": "New premium tax credits and cost-sharing reductions are available to help eligible consumers who buy a plan through Maine’s Health Insurance Marketplace. The amount of the tax credit or cost-sharing reduction depends on family size and income. Larger families and families with lower incomes get the most help. Tax credits and cost-sharing reductions aren’t available for individuals who are eligible for MaineCare, Medicare, or qualifying employer-sponsored coverage."}, {"url": "http://kff.org/health-costs/issue-brief/cost-sharing-subsidies-in-federal-marketplace-plans/", "passage_text": "For the cost-sharing variants, the maximum out-of-pocket limit is $2,250 for single coverage and $4,500 for family coverage for the CSR87 and CSR94 plan variants, and $5,200 for single coverage and $10,400 for family coverage for the CSR73 plan variant. An out-of-pocket limit is the most that an enrollee must pay for cost sharing under a plan for covered health care services received from network providers. After an enrollee reaches his or her out-of-pocket limit, the plan pays all of the costs for covered services provided in network."}, {"url": "http://www.healthreformbeyondthebasics.org/cost-sharing-charges-in-marketplace-health-insurance-plans-part-2/", "passage_text": "The 2014 out-of-pocket maximum amounts for the income levels of people receiving cost-sharing reductions appear in Table 2. For example, a person with income at 140 percent of the poverty line will receive a silver plan with an out-of-pocket limit no greater than $2,250. The gold plan has an actuarial value of 80 percent (with, say, a $600 deductible and $25 physician-visit copayments), while the cost-sharing reduction John can get would make an 87 percent actuarial value plan available to him (with a $250 deductible and $15 physician copayments in our example)."}]