[{"url": "http://www.medicinenet.com/script/main/art.asp?articlekey=24502", "passage_text": "Osteoblast: A cell that makes bone. It does so by producing a matrix that then becomes mineralized. Bone mass is maintained by a balance between the activity of osteoblasts that form bone and other cells called osteoclasts that break it down. "}, {"url": "http://www.answers.com/Q/What_is_the_function_of_osteoblasts_osteoclasts_and_osteocytes", "passage_text": "Osteoblast is a type of cell found in bone tissue that constructs new bone. Osteoclast is a type of cell found in bone tissue that removes old bone materials to make … room for new. exists and is an alternate of. Merge this question into. Split and merge into it. Answer by Suzieq181218. Confidence votes 505. Osteocytes are the actual bones. The osteoclasts produce enzymes that break down the bone cells for the calcium and other salts."}, {"url": "http://differentmedicalcareers.com/three-types-of-bone-cells-osteoblasts-osteoclasts-and-osteocytes-in-bone-remodeling/", "passage_text": "Osteoclast functions. An osteoclast is a multinucleated cell, derived from cells in bone marrow, that breaks down bone matrix. Osteoclasts function by moving along a bone surface, channeling grooves with lysosomeal enzymes, breaking down the bone matrix. There are three types of bone cells in bone marrow. Unless you have a fracture or a disease like osteoporosis, your physician may never talk about osteoblasts, osteoclasts, and osteocytes."}, {"url": "http://differentmedicalcareers.com/three-types-of-bone-cells-osteoblasts-osteoclasts-and-osteocytes-in-bone-remodeling/", "passage_text": "Bone is a connective tissue, composed of a solid extracellular matrix and cells, including osteoclasts and osteoblasts. The suffixes of our two words are different, though. “Blasts” means embryonic — a condition related to an early stage of development. There are three types of bone cells in bone marrow. Unless you have a fracture or a disease like osteoporosis, your physician may never talk about osteoblasts, osteoclasts, and osteocytes."}, {"url": "http://www.answers.com/Q/What_is_the_function_of_osteoblasts_osteoclasts_and_osteocytes", "passage_text": "An osteoblast builds bone up (produces osteoid and then mineralizes the osteoid matrix). An osteoclast is a type of cell that breaks bone down. Osteoblasts arise from osteopro … genitor cells which are immature progenitor cells. exists and is an alternate of. Merge this question into. Split and merge into it. Answer by Suzieq181218. Confidence votes 505. Osteocytes are the actual bones. The osteoclasts produce enzymes that break down the bone cells for the calcium and other salts."}, {"url": "https://answers.yahoo.com/question/index?qid=20081013065845AA92DRa", "passage_text": "-- Osteoblasts are the immature cells of bone which are responsible for the production and mineralization of bone matrix or osteoid. As new bone is formed, a few of the active osteoblast become trapped in the matrix and eventually become osteocytes. -- Osteocytes are the mature cells of bone. They are found in open spaces in bone called lacunae."}, {"url": "http://differentmedicalcareers.com/three-types-of-bone-cells-osteoblasts-osteoclasts-and-osteocytes-in-bone-remodeling/", "passage_text": "An osteoblast is a cell that is generating new bone matrix — i.e., a bone forming cell. It does this by creating the organic component in bone, namely collagen. As osteoblasts move along the bone matrix, they get stuck in the tissue and turn into osteocyctes. This creates new bone growth and repair. There are three types of bone cells in bone marrow. Unless you have a fracture or a disease like osteoporosis, your physician may never talk about osteoblasts, osteoclasts, and osteocytes."}, {"url": "https://answers.yahoo.com/question/index?qid=20071104181535AAKf8Wa", "passage_text": "Best Answer: an osteocyte is a bone cell an osteoblast is specific to the building/production of new bone an osteoclast is specific to the tearing down/destruction of bone EX: during growth of your thigh bone the osteoblasts create new bone tissue on the outside while osteoclasts tear down bone tissue on the interior. "}, {"url": "https://en.wikipedia.org/wiki/Osteoblast", "passage_text": "Osteoblast (from the Greek combining forms for  bone , ὀστέο-, osteo-and βλαστάνω, blastanō germinate) are cells with single nuclei that synthesize bone. Individual cells cannot make bone, and the group of organized osteoblasts together with the bone made by a unit of cells is usually called the osteon; the basis of this is discussed in Organization and ultrastructure of osteoblasts below."}, {"url": "http://www.sciencedirect.com/science/article/pii/S1073874612000400", "passage_text": "Bone is remodeled and modeled by the concerted activities of 3 cell types—osteoblasts, osteocytes, and osteoclasts. Osteoblasts are the cells that produce bone extracellular matrix and are responsible for its mineralization. Osteoblasts also have endocrine activity through secretion of osteocalcin, which regulates fat and energy metabolism. These cells also control the differentiation and activity of osteoclasts. Osteocytes are osteoblasts that have been incorporated into bone matrix and are cells with extensive dendritic processes through which the cells communicate with other osteocytes and with osteoblasts. In parallel, osteoblasts degrade the unmineralized bone matrix, which is present between the cells and the mineralized bone, and then retract from the area giving the latent osteoclasts a possibility to migrate into the area and attach to mineralized bone through the sealing zone."}]