[{"url": "http://www.medicinenet.com/snake_bite/article.htm", "passage_text": "A venomous (poisonous) snake bite is a bite or a puncture wound made by a snake that is capable of injecting, secreting, or spitting a toxin into the penetrated skin wound or, mucus membranes or the eyes where the toxin can be absorbed. In North America, there are about 25 species of snakes able to secrete toxin. Consequently, almost any type of venomous snake bite can be encountered in the US. About 7,000 snake bites are reported in the US per year, but because snake bites are not required to be reported, it is estimated that up to 45,000 bites per year may occur with about 8,000 by poisonous snakes."}, {"url": "https://answers.yahoo.com/question/index?qid=20071019194531AAqqugH", "passage_text": "A pin prick or a cat scratch at worst. If a snake bites you and lets go quickly, it is no problem. Put the snake back in the cage, wash the wound off with water, put on some neosporin, and put a band aid over it, if you feel like it is necessary. I usually just rinse off the area I was bitten and get back to business as usual"}, {"url": "http://doctor.ndtv.com/faq/ndtv/fid/4549/My_skin_is_spotted_like_a_snake;_what_should_I_do.html", "passage_text": "I don't know the exact name of this right now, I am using candid ointment and dermaic powder. In the Telugu language this problem is called sobhi. There is no itching or pain but the only the skin looks ugly and is spreading all over the body. My skin looks like snake skin with spots all over. A. In my assessment, you are referring to the condition called as tinea versicolor (Pityriasis versicolor), caused by Malassezia furfur. It produces asymptomatic hypo-or hyperpigmented spots over the upper trunk. "}, {"url": "https://en.wikipedia.org/wiki/Snake_skin", "passage_text": "The moulting of the skin occurs regularly, when old skin is outgrown. In the case of snakes, it is called shedding or ecdysis. Snakes will rub against rough surfaces to shed their skin. A shed skin is much longer than the snake that shed it, as the skin covers the top and bottom of each scale. If the skin is shed intact, each scale is unwrapped on the top and bottom side of the scale which almost doubles the length of the shed skin. "}, {"url": "http://www.answers.com/Q/What_does_reptiles_skin_feel_like", "passage_text": "A snake skin is shiny, lustrous scales may appear wet, in reality the snake's skin feels like a leather belt or a pair of patent leather shoes, smooth, dry, silky and sa … tiny. No their skin is not sticky nor slimy. + 30 others found this useful. they feel lumpy and a bit like leather.. Depends on the animal. Some reptiles are very rough to the touch, others have very slippery scales, and some have scales so small the … re skin feels like suede. Turtles may have hard, tough scales on their shell but some have soft scales that feel like rubber."}, {"url": "http://snakesarelong.blogspot.com/2012/04/identifying-snake-sheds.html", "passage_text": "Often it is possible to identify snakes by their shed skins alone (you can do so too, here). I have had some pretty serious exercise of this skill this week. In the past three days, I have found three fairly fresh snake sheds on islands in the Matanzas River. Most often, though, a shed is either torn apart by the snake as it sheds, or tears itself apart as a result of drying out (it is wet when the snake sheds it off, as a result of lymphatic fluid excreted by the snake’s integument to aid in the shedding process)."}, {"url": "http://www.snake-removal.com/shedskin.html", "passage_text": "How can you tell what type of snake left behind a shed snake skin? This is very difficult for non-experts. I have found that most non-herpetologists have difficulty identifying a complete snake upon seeing it. But just the skin, it's even harder to identify what kind of snake shed a particular skin. All non-venomous North American snake results will be mailed out to you. Note: Do NOT ship snake bodies, carcasses or live snakes in the mail! Strolling into a copy store with a snake, is behavior we strongly discourage, as it may not be in your best interest. 1  Step 1: Place shed skin in a zip-lock or plastic bag."}, {"url": "https://answers.yahoo.com/question/index?qid=20071019194531AAqqugH", "passage_text": "If the snake holds on, assuming it is a small species like the two kinds you mentioned, gently spritzing it with warm, not hot, water near its head and neck seems to work remarkably well. Whatever you do, avoid the knee-jerk reaction to pull your finger or whatever out of the snake's mouth. If a snake bites you and lets go quickly, it is no problem. Put the snake back in the cage, wash the wound off with water, put on some neosporin, and put a band aid over it, if you feel like it is necessary."}]