[{"url": "http://work.chron.com/much-average-alaskan-fisherman-make-24495.html", "passage_text": "In 2011, the average earnings for permit holders, including fishing and other work, was $29,144, according to Alaska's Department of Labor and Workforce. Those catching miscellaneous shellfish earned the most, taking in $31,193 annually. Groundfish and sablefish fishermen earned among the least, with annual salaries of slightly less than $21,000."}, {"url": "https://en.wikipedia.org/wiki/Commercial_fishing_in_Alaska", "passage_text": "Fishing for crabs in the Bering Sea in January 2006. Commercial fishing is a major industry in Alaska, and has been for hundreds of years. Alaska Natives have been harvesting salmon and many other types of fish since the early 17th century. The hazardous work conditions faced by fishermen have a strong impact on their safety. Out of 948 work-related deaths that took place in Alaska during 1990-2006, one-third (311) occurred to fishermen. This is equivalent to an estimated annual fatality rate of 128/100,000 workers/year."}, {"url": "http://work.chron.com/salary-per-year-crab-fisherman-2510.html", "passage_text": "The Harvest. The Alaska Department of Fish and Game estimates that fishermen in the state earn over $1 billion in wages per year. The total harvest usually has a retail value in excess of $3 billion, meaning fishermen keep about one-third of the sale profits. In other instances, deck hands are paid a flat daily wage of between $50 and $100. The wages of deckhands are usually based on experience and job responsibilities. Career fishermen usually earn much more than new recruits."}, {"url": "http://www.fishersofmenapparel.com/alaskan-crab-fishing-salary-jobs/", "passage_text": "Then there is the moneys that have to be taken into factor to consider …. Alaskan crab fishing salary jobs for crab fishermen. Alaskan crab fishing salary work need to provide their industrial crab fishing licenses. In 1999 commercial fishing license fees was $40 for a homeowner and $120 for a non-resident."}, {"url": "http://work.chron.com/much-average-alaskan-fisherman-make-24495.html", "passage_text": "Contributing Factors. Salaries for fisherman in Alaska differ depending on whether a fisherman is a permit holder or a crew member. Generally, permit holders have their own equipment, can employ crews and earn higher incomes. They also usually earn more in offseason non-fishing related jobs than those working for them. Those catching miscellaneous shellfish earned the most, taking in $31,193 annually. Groundfish and sablefish fishermen earned among the least, with annual salaries of slightly less than $21,000."}, {"url": "http://work.chron.com/much-average-alaskan-fisherman-make-24495.html", "passage_text": "Seafood is a billion dollar industry in Alaska, with more than half of U.S. commercially captured fish caught in the state nicknamed The Last Frontier.. According to Alaska's Department of Labor and Workforce, around 32,200 people fished commercially in Alaska in 2011, averaging 8,064 people per month. Those catching miscellaneous shellfish earned the most, taking in $31,193 annually. Groundfish and sablefish fishermen earned among the least, with annual salaries of slightly less than $21,000."}, {"url": "http://work.chron.com/much-average-alaskan-fisherman-make-24495.html", "passage_text": "Permit holders on average make more than $29,000 in non-fishing related jobs. In contrast, crew members earn $18,650 at their other jobs on average, according to Alaska's Department of Labor and Workforce. Those catching miscellaneous shellfish earned the most, taking in $31,193 annually. Groundfish and sablefish fishermen earned among the least, with annual salaries of slightly less than $21,000."}, {"url": "http://www.indeed.com/salary/q-Fishing-Guide-l-Alaska.html", "passage_text": "Average Fishing Guide salaries for job postings in Alaska are 26% lower than average Fishing Guide salaries for job postings nationwide. "}, {"url": "http://www.celebritynetworth.com/articles/how-much-does/crab-fisherman-salary/", "passage_text": "Alaska crab fisherman often make more than commercial fisherman. The median yearly salary for fishermen according to a May 2009 Bureau of Labor Statistics report was $26,600. AOL answers states the median salary for Alaska crab fisherman can be as much as $10,000 a week. How Stuff Works states experienced Alaskan crab fishermen are able to earn as much as $60,000 for a few months work out of the year. Industry And Annual Wages. Scenic and Sightseeing Transportation, Water $21,590"}, {"url": "http://www.iser.uaa.alaska.edu/Publications/2013_04-TheEconomicImportanceOfTheBristolBaySalmonIndustry.pdf", "passage_text": "Alaska’s Bristol Bay salmon fishery is the world’s most valuable salmon fishery. The 2010 Bristol Bay salmon harvest had a value of $165 million. Processing increased the value by $225 million to a total first wholesale value of $390 million for the salmon products produced in Bristol Bay. "}]