[{"url": "http://study.com/requirements_to_become_a_police_officer.html", "passage_text": "Learn about the education and preparation needed to become a police officer. Get a quick view of the requirements as well as details about education, required examinations, training and job duties to find out if this is the career for you."}, {"url": "http://www.collegequest.com/how-to-become-a-police-officer.aspx", "passage_text": "Police officer education requirements range from a high school diploma to a college degree. The minimum requirement is usually a high school diploma, although an increasing number of police departments require applicants to complete at least one or two years of college coursework or have an associate’s degree. A bachelor’s degree is the minimum requirement for federal police jobs."}, {"url": "https://nationalcareersservice.direct.gov.uk/advice/planning/jobprofiles/Pages/policeofficer.aspx", "passage_text": "Skills, interests and qualities. To become a police officer you will need to have: 1  honesty, confidence, social awareness and a responsible attitude. 2  the ability to assess a situation, react quickly and take positive action. 3  resilience."}, {"url": "http://www.collegequest.com/how-to-become-a-police-officer.aspx", "passage_text": "A police officer career is suited to anyone who thrives on challenges. You must be at least 21 years old and pass competitive written exams in order to become a police officer. Being agile and in good shape is also important, because police officers have to be fast on their feet."}, {"url": "http://study.com/requirements_to_become_a_police_officer.html", "passage_text": "In addition to earning a high school diploma, police officers receive training at a police academy. Some police officers complete degree programs in law enforcement or criminal justice as well, which can be helpful for career advancement."}, {"url": "https://uk.answers.yahoo.com/question/index?qid=20080911104327AASmhMY", "passage_text": "It depends on the department. Most large police departments list their qualification requirements on their websites. Police departments want well-rounded, educated, good people to join their ranks. There are several things that you can do now to increase your chances of becoming a police officer."}]