[{"url": "http://www.bottledwater.org/health", "passage_text": "1 With the United States facing high rates of obesity, diabetes and heart disease, drinking water – bottled, filtered, or tap – is always a healthy decision. 2  Convenient access to bottled water as a healthy alternative to sugary beverages helps consumers make better choices. Bottled water is the smart decision and a healthy choice when it comes to you packaged beverage options. 1  According to the Institute of Medicine and the American Journal of Preventative Medicine, one-third of American adults are overweight and another one-third is obese."}, {"url": "http://www.clearlycolorado.com/blog/purified-water-benefits/benefits-of-drinking-purified-water-the-healthier-option.html", "passage_text": "Benefits of Drinking Purified Water-The Healthier Option. The benefits of drinking purified water are more numerous than a single blog post can adequately cover. Consuming plenty of high quality purified water is as important to your overall health and wellbeing as eating a proper diet. This is because the body then does not have to contend with any extra impurities, chemicals, toxins or impurities. It can then simply and efficiently cleanse wastes from each cell of the body. Water can improve how you look and feel in no time at all."}, {"url": "http://blog.watershed.net/2008/06/03/why-purified-water-is-bad-for-you/", "passage_text": "Many health fanatics, however, are often surprised to hear me say that drinking purified water on a regular, daily basis is potentially dangerous. Paavo Airola wrote about the dangers of purified water in the 1970’s when it first became a fad with the health food crowd. Distillation is the process in which water is boiled, evaporated and the vapor condensed. Purified or reverse osmosis water is free of dissolved minerals and, because of this, has the special property of being able to actively absorb toxic substances from the body and eliminate them."}, {"url": "https://en.wikipedia.org/wiki/Purified_water", "passage_text": "Distilled water has been the most common form of purified water, but, in recent years, water is more frequently purified by other processes including Capacitive deionization, reverse osmosis, carbon filtering, microfiltration, ultrafiltration, ultraviolet oxidation, or electrodeionization. It encouraged people to check the mineral content of their drinking water, whether tap or bottled, and choose water most appropriate for their needs. Since distilled water is devoid of minerals, supplemental mineral intake through diet is needed to maintain proper health."}, {"url": "http://www.bottledwater.org/health", "passage_text": "When it comes to quenching your thirst, nothing does it better than convenient, healthy, safe, zero calorie bottled water. It’s the smart beverage choice. When looking to make healthy lifestyle choices, one of the simplest changes you can make is to drink water instead of less-healthy sugary beverages. Bottled water is the smart decision and a healthy choice when it comes to you packaged beverage options. 1  According to the Institute of Medicine and the American Journal of Preventative Medicine, one-third of American adults are overweight and another one-third is obese."}, {"url": "https://en.wikipedia.org/wiki/Purified_water", "passage_text": "Purified water is water that has been mechanically filtered or processed to remove impurities and make it suitable for use. It encouraged people to check the mineral content of their drinking water, whether tap or bottled, and choose water most appropriate for their needs. Since distilled water is devoid of minerals, supplemental mineral intake through diet is needed to maintain proper health."}, {"url": "http://www.mnn.com/food/healthy-eating/stories/5-reasons-not-to-drink-bottled-water", "passage_text": "Just look at the labels or the bottled water ads: deep, pristine pools of spring water; majestic alpine peaks; healthy, active people gulping down icy bottled water between biking in the park and a trip to the yoga studio. In reality, bottled water is just water. That fact isn't stopping people from buying a lot of it. Estimates variously place worldwide bottled water sales at between $50 and $100 billion each year, with the market expanding at the startling annual rate of 7 percent. Bottled water is big business. But in terms of sustainability, bottled water is a dry well. It's costly, wasteful and distracts from the brass ring of public health: the construction and maintenance of safe municipal water systems. Bottled water isn't any healthier than tap water, and the used plastic bottles end up in landfills or oceans. (Photo: Bogac Erguvenc /Shutterstock). Bottled water is healthy water — or so marketers would have us believe."}, {"url": "https://en.wikipedia.org/wiki/Purified_water", "passage_text": "The drinking of purified water as a replacement of drinking water has been both advocated and discouraged for health reasons. Purified water lacks minerals and ions such as calcium that play key roles in biological functions such as in nervous system homeostasis, and are normally found in potable water. It encouraged people to check the mineral content of their drinking water, whether tap or bottled, and choose water most appropriate for their needs. Since distilled water is devoid of minerals, supplemental mineral intake through diet is needed to maintain proper health."}, {"url": "http://www.wateringplace.com/types-of-water/purified-water/purified-water/", "passage_text": "A bottle of purified water cannot be considered a healthy drink option because the minerals which our bodies rely upon have been removed. These minerals (present in ionized water) such as calcium, magnesium and fluoride contribute to our nutritious intake and create a deficiency when not present. Although we can drink purified water, it is actively discouraged so that our bodies maintain a healthy balance. With a total lack of mineral ions in this water, unless we are absorbing the necessary minerals through our food, we are risk of a serious mineral deficiency and an additional source would be required."}]