[{"url": "http://faculty.marianopolis.edu/c.belanger/quebechistory/readings/leaving.htm", "passage_text": "Between 1840 and 1930 roughly 900 000 French Canadians left Canada to emigrate to the United States. This important migration, which has now been largely forgotten in Quebecs collective memory, is certainly one of the major events in Canadian demographic history. "}, {"url": "http://www.answers.com/Q/Why_did_the_French_settle_in_canada", "passage_text": "The first French settlement was at Port-Royal (now Annapolis Royal) in the Annapolis Valley of Nova Scotia. Samuel de Champlain founded Quebec in 1608, and French settlers too … k up land along the St Lawrence River. The majority of Irish settled in Grosse Isle.   The peak period of entry of the Irish to Canada occurred during and shortly after the Great Irish Famine in the mid 19th century; a great number of them settled in the first arriving provinces of Nova Scotia, Prince Edward Island and New Brunswick."}, {"url": "http://www.cic.gc.ca/english/resources/publications/discover/section-06.asp", "passage_text": "Royal New France. In 1604, the first European settlement north of Florida was established by French explorers Pierre de Monts and Samuel de Champlain, first on St. Croix Island (in present-day Maine), then at Port-Royal, in Acadia (present-day Nova Scotia). In 1608 Champlain built a fortress at what is now Quebec Québec. city "}, {"url": "http://www.everyculture.com/multi/Du-Ha/French-Canadian-Americans.html", "passage_text": "Most French Canadians settled in a circular pattern around Boston—in towns such as Lewiston, Maine, Manchester, New Hampshire, and Lowell, Massachusetts, to the north; Worcester and Holyoke, Massachusetts, to the west; and Woonsocket, Rhode Island, and Fall River, Massachusetts, to the south. For all of the hardships, the King of France, Louis XIV, did not give up. In 1665 he sent two ships to Quebec québec containing the first regular troops to be sent To, canada in addition To alexandre De, prouville The marquis De (tracy-1596), 1670 who was made-lieutenant general for All french possessions In North. america"}, {"url": "https://en.wikipedia.org/wiki/New_France", "passage_text": "New France (French: Nouvelle-France) was the area colonized by France in North America during a period beginning with the exploration of the Saint Lawrence River by Jacques Cartier in 1534 and ending with the cession of New France to Spain and Great Britain in 1763. Britain received Canada, Acadia, and the parts of French Louisiana which lay east of the Mississippi River –except for the Île île'D, orleans Orléans while spain Île the'Ile île d orleans orléans and the – territory to the west The. larger portion of louisiana"}, {"url": "http://www.thecanadianencyclopedia.ca/en/article/french-language/", "passage_text": "French Language. Early French Settlers In the early 17th century France founded two colonies in North America: ACADIA (in what is now Nova Scotia) and NEW FRANCE (in what is now the Province of Quebec). Québec between 1755 and 1763 The english deported more than 10 000 of the approximately 14 000. acadians Early French Settlers. In the early 17th century France founded two colonies in North America: Acadia (in what is now Nova Scotia) and New France (in what is now the Province of Quebec). québec"}, {"url": "http://www.answers.com/Q/Where_did_the_French_settle_in_Canada", "passage_text": "The first French settlement was at Port-Royal (now Annapolis Royal) in the Annapolis Valley of Nova Scotia. Samuel de Champlain founded Quebec in 1608, and French settlers took up land along the St Lawrence River. The next major area of French settlement was at present-day Montreal. Ontario --------------- But mostly lower Quebec, along the St Lawrence. Of course as Canada grew so did the French who have settled where ever there are Federal offices as mo … st of those jobs are reserved for people who speak French."}, {"url": "https://answers.yahoo.com/question/index?qid=20071022161354AA3WW2u", "passage_text": "Best Answer: Mostly because the English laid claim to the Atlantic seaboard from Maine to Georgia in the early 1600's, and France wasn't strong enough to dispute it at that time. Also, because they found that they could profit from trading for furs with the Indians in Canada. In the 1530's Jaques Cartier explored the St. Lawrence River, looking for a Northwest Passage, and claimed the land around it for France. During the 1600's, French exploration continued up the St. Lawrence to the Great Lakes in search of beaver and other furs. More settlements were founded and the French became established in Canada, while the English were building their colonies in Virginia, Pennsylvania, New York and New England."}, {"url": "http://www.mccord-museum.qc.ca/scripts/explore.php?elementid=15__true&tableid=11&contentlong", "passage_text": "French settlement. From the founding of the city of Quebec in 1608, to the handing over of Canada to Great Britain in 1763, France controlled three-quarters of the total land mass of North America. The first inhabitants in New France were mostly single men. "}]