[{"url": "http://abcnews.go.com/Health/CommonPainProblems/story?id=4047881", "passage_text": "Answer: Muscle spasm results from inflammation that occurs when a muscle is overstretched or torn. It begins as a muscle strain, which doesn't sound like a serious injury, but it can cause severe low back pain. Many people go to the emergency room each year because of a muscle strain. In fact, most episodes of acute lower back pain are caused by damage to the muscles and/or ligaments in the low back."}, {"url": "http://www.healthline.com/health/strains", "passage_text": "A muscle strain, or pulled muscle, is when your muscle is overstretched or torn. This usually occurs as a result of fatigue, overuse, or improper use of a muscle. Strains can happen in any muscle, but are most common in your lower back, neck, shoulder, and hamstring (the muscle behind your thigh). A muscle strain causes pain and may limit movement within the affected muscle group."}, {"url": "http://www.healthgrades.com/symptoms/neck-spasm--causes", "passage_text": "Neck spasms can be caused by a muscle strain or muscle tension, either from physical exertion or from tensing the muscles unconsciously in response to stress. "}, {"url": "http://www.aans.org/Patient%20Information/Conditions%20and%20Treatments/Low%20Back%20Strain%20and%20Sprain.aspx", "passage_text": "When the lumbar spine is strained or sprained, the soft tissues become inflamed. This inflammation causes pain and may cause muscle spasms. Lumbar strain or sprain can be very debilitating. Three types of muscles support the spine: 1  Extensors (back muscles and gluteal muscles). 2  Flexors (abdominal muscles and iliopsoas muscles). 3  Obliques or rotators (side muscles). "}, {"url": "http://twinboro.com/body/spine/cervical/muscle/conditions/cervical-muscle-spasm-nj.html", "passage_text": "Cervical Muscle Spasm. A muscle spasm is a sudden and involuntary contraction, tightening, or shaking of a muscle. A spasm often occurs as a result of trauma, strain, overuse, weakness, or pain. In the cervical spine, a muscle spasm may or may not cause the head to turn or move without warning. Causes. Cervical muscle spasms often occur in response to another condition, or as a result of pain, fatigue or overuse. Common causes of cervical muscle spasm include: 1  Muscle strain or fatigue. 2  Increased physical exertion. 3  Stress, and having tense muscles. 4  In response to certain medications. 5  As the result of a fracture in the cervical spine"}, {"url": "http://www.healthgrades.com/symptoms/abdominal-muscle-spasm", "passage_text": "Like any other muscles in the body, your abdominal muscles can have spasms that occur as a result of muscle strain during heavy use or overuse, fatigue, dehydration, and alcohol or drug use. Abdominal muscle strain is a common injury among athletes and can cause muscle spasms. Abdominal muscle spasm, also known as abdominal rigidity, is a powerful, involuntary contraction of the muscles of the abdomen. During a spasm, the muscle will feel stiff and tender if you apply pressure"}, {"url": "http://abcnews.go.com/Health/CommonPainProblems/story?id=4047881", "passage_text": "Muscle strains are also known as a pulled muscle. When the muscles in the lower back are strained or torn, the area around the muscles can become inflamed. With inflammation, the muscles can spasm leading to severe low back pain and difficulty moving. Lower back pain from a muscle strain occurs most frequently after lifting a heavy object, lifting while twisting, or a sudden movement or fall. The pain is usually localized, meaning it doesn't radiate to the leg. Many people go to the emergency room each year because of a muscle strain. In fact, most episodes of acute lower back pain are caused by damage to the muscles and/or ligaments in the low back."}, {"url": "http://orthoinfo.aaos.org/topic.cfm?topic=A00111", "passage_text": "Similar to sprains, a strain may be a simple stretch in your muscle or tendon, or it may be a partial or complete tear in the muscle-and-tendon combination. Typical symptoms of a strain include pain, muscle spasm, muscle weakness, swelling, inflammation, and cramping. A strain is an injury to a muscle and/or tendons. Tendons are fibrous cords of tissue that attach muscles to the bone. Strains often occur in your foot, leg (typically the hamstring) or back."}]