[{"url": "http://www.vandevereadvantage.com/carfax-advantage-dealer", "passage_text": "Being a CARFAX Advantage Dealer, you can rest assured that you are buying a quality used car from VanDevere. We provide you with a free CARFAX report on any of our vehicles in stock at any one of our 4 locations. CARFAX is the vehicle history expert for the automotive industry. CARFAX created the Vehicle History Report in 1986 and is trusted across North America to help customers in their car buying research."}, {"url": "https://www.facebook.com/CarfaxForDealers", "passage_text": "Carfax for Dealers. September 30 at 8:40am ·. Just in from our friends at Headquarter Honda is this wonderful picture of Chris Cutting, Internet Manager and Glenn Forsythe, Internet Sales with the CARFAX Advantage Dealer sign they won in our recent facebook contest. Our congrats to your team again guys! Look for our next contest coming soon"}, {"url": "http://www.texascarsdirecttx.com/736006/2013/08/01/what-does-it-mean-to-be-a-carfax%c2%ae-advantage-dealer.html", "passage_text": "Used-car shoppers who want to be confident in their car purchase are encouraged to go to CARFAX Advantage Dealers. To learn more about what is means to be a CARFAX Advantage Dealer and the benefits of shopping at one, continue reading this article. Information about Every Car for Sale. While many dealerships have to pay for CARFAX history reports, CARFAX Advantage Dealers have unlimited access to them. If you are looking for a great value on a used luxury car, Texas Cars Direct has a great selection of vehicles for you. We are proud to be a CARFAX Advantage Dealer. Before you visit us for a test drive, check out our dealership’s website to see our inventory. For more information, give us a call at (214) 736-8557"}, {"url": "http://www.applehonda.net/carfax-advantage-dealer.htm", "passage_text": "Carfax is the vehicle history expert for used car buyers, sellers and the automotive industry. Carfax created the Vehicle History Report in 1986 and is trusted by dealerships across North America to help acquire, advertise and retail used cars. The Carfax Advantage™ Dealer Program distinguishes Carfax-subscribing dealers that are committed to transparency. Through the program, participating dealers can set themselves apart from their competition. Used car shoppers know they can buy with greater confidence when shopping at any Carfax Advantage dealership. As part of the program, participating dealers have unlimited access to Carfax Vehicle History Reports and Carfax Auction Quick Check, plus a Consumer Information Pack for every car being retailed"}, {"url": "http://www.carfax.com/press/releases", "passage_text": "Automotive News from CARFAX. Stay up-to-date with the latest news from CARFAX and see the latest information available from CARFAX on consumer issues, vehicle fraud, and other industry trends. Press. Stay up-to-date with the latest news from CARFAX and see the latest information available from CARFAX on consumer issues, vehicle fraud, and other industry trends."}, {"url": "http://www.prnewswire.com/news-releases/carfax-launches-advantage-program-for-dealers-119184534.html", "passage_text": "CENTREVILLE, Va. , April 4, 2011 /PRNewswire/ -- Carfax is giving dealers a powerful new way to attract customers using the Carfax brand. The Carfax Advantage™ Dealer Program distinguishes Carfax-subscribing dealers that are committed to transparency. Through the program, participating dealers can set themselves apart from their competition. Used car shoppers know they can buy with greater confidence when shopping at any Carfax Advantage dealership"}, {"url": "http://www.nationstrucks.com/carfax-advantage-dealer.htm", "passage_text": "As you look for ways to save money on your next used car purchase, CARFAX can help. There are several ways to get free vehicle history report from CARFAX throughout the used car shopping process-from browsing cars for sale online to looking at cars on a dealer's lot. Nations Trucks prides itself on showing our customers the CARFAX on every truck that we sell. Free CARFAX Reports are available at many car dealerships in your area. Just ask the dealer when you visit their showroom. If you are considering a vehicle for sale by a private seller, ask them for the CARFAX Report. If they do not have the report or are reluctant to share the vehicle's history, you may want to purchase the report for yourself."}, {"url": "http://www.prnewswire.com/news-releases/carfax-launches-advantage-program-for-dealers-119184534.html", "passage_text": "They know immediately that a Carfax Advantage dealer will show them the Carfax. As a result, participating dealers enhance their reputation and sell more cars faster.. About Carfax (www.carfax.com). Carfax is the vehicle history expert for used car buyers, sellers and the automotive industry. Carfax created the Vehicle History Report in 1986 and is trusted by dealerships across North America to help acquire, advertise and retail used cars. , April 4, 2011 /PRNewswire/ -- Carfax is giving dealers a powerful new way to attract customers using the Carfax brand. The Carfax Advantage™ Dealer Program distinguishes Carfax-subscribing dealers that are committed to transparency."}]