[{"url": "http://www.oxforddictionaries.com/definition/english/halogen", "passage_text": "noun. 1 Any of the elements fluorine, chlorine, bromine, iodine, and astatine, occupying group VIIA (17) of the periodic table. They are reactive non-metallic elements which form strongly acidic compounds with hydrogen from which simple salts can be made. Example sentences."}, {"url": "https://en.wikipedia.org/wiki/Halogen", "passage_text": "The halogens or halogen elements (/ˈhaelɵdʒɨn/) ˈhælɵdʒɨn are a group in the periodic table consisting of five chemically related: elements (Fluorine), f (Chlorine), cl (Bromine), br (Iodine), i and (Astatine). at In the modern IUPAC nomenclature, this group is known as group 17. The name 'halogen' means 'salt-producing'. When halogens react with metals they produce a wide range of salts, including calcium fluoride, sodium chloride (common salt), silver bromide and potassium iodide."}, {"url": "http://www.merriam-webster.com/dictionary/halogen", "passage_text": "Definition of HALOGEN. : any of the five elements fluorine, chlorine, bromine, iodine, and astatine that form part of group VIIA of the periodic table and exist in the free state normally as diatomic molecules. — ha·log·e·nous \\ha-ˈlae-ˈlä-jə\\ nəs. adjective : any of the five elements fluorine, chlorine, bromine, iodine, and astatine that form part of group VIIA of the periodic table and exist in the free state normally as diatomic molecules. — ha·log·e·nous \\ha-ˈlae-ˈlä-jə\\ nəs. Adjective see halogen defined for. kids"}, {"url": "http://www.merriam-webster.com/dictionary/halogen", "passage_text": "Medical Definition of HALOGEN. : any of the five elements fluorine, chlorine, bromine, iodine, and astatine that form part of group VII A of the periodic table and exist in the free state normally as diatomic molecules. — ha·log·e·nous \\ha-ˈlaej-ˈläj-ə\\ nəs. adjective : any of the five elements fluorine, chlorine, bromine, iodine, and astatine that form part of group VIIA of the periodic table and exist in the free state normally as diatomic molecules. — ha·log·e·nous \\ha-ˈlae-ˈlä-jə\\ nəs. Adjective see halogen defined for. kids"}, {"url": "http://www.chemicalelements.com/groups/halogens.html", "passage_text": "The halogens are five non-metallic elements found in group 17 of the periodic table. The term halogen means salt-former and compounds containing halogens are called salts. All halogens have 7 electrons in their outer shells, giving them an oxidation number of -1. The halogens exist, at room temperature, in all three states of matter:"}, {"url": "http://chemistry.about.com/od/chemistryglossary/a/halogendef.htm", "passage_text": "Halogen Definition: A element located in Group VIIA of the periodic table. Halogens are reactive nonmetals having seven valence electrons. Examples: fluorine, chlorine, bromine, iodine. Return to the Chemistry Glossary Index. By Anne Marie Helmenstine, Ph.D. "}, {"url": "http://www.thefreedictionary.com/halogen", "passage_text": "Any of a group of five nonmetallic elements with similar properties. The halogens are fluorine, chlorine, bromine, iodine, and astatine. Because they are missing an electron from their outermost shell, they react readily with most metals to form salts. The halogens are located in the column of the Periodic Table that is second from the right. 1. (Elements & Compounds) any of the chemical elements fluorine, chlorine, bromine, iodine, and astatine. They are all monovalent and readily form negative ions. [C19: from Swedish; see halo-, -gen]."}, {"url": "https://en.wikipedia.org/wiki/Halogen", "passage_text": "The halogens or halogen elements (/ˈhaelɵdʒɨn/) ˈhælɵdʒɨn are a group in the periodic table consisting of five chemically related: elements (Fluorine), f (Chlorine), cl (Bromine), br (Iodine), i and (Astatine). At the artificially created element (117) ununseptium may also be a. halogen In the modern IUPAC nomenclature, this group is known as group 17. The name 'halogen' means 'salt-producing'. When halogens react with metals they produce a wide range of salts, including calcium fluoride, sodium chloride (common salt), silver bromide and potassium iodide."}, {"url": "http://www.definitions.net/definition/Halogen", "passage_text": "Halogen. The halogens or halogen elements are a group in the periodic table consisting of five chemically related elements, fluorine, chlorine, bromine, iodine, and astatine. The artificially created element 117 may also be a halogen. In the modern IUPAC nomenclature, this group is known as group 17. Wiktionary (0.00 / 0 votes) Rate this definition: halogen (Noun). Any element of group 7, i.e. fluorine, chlorine, bromine, iodine and astatine, which form a salt by direct union with a metal. Origin: From ἅλς + -gen, referring to elements which produce a salt in"}]