[{"url": "http://www.answers.com/Q/How_much_money_do_marine_biologist_get_per_month", "passage_text": "Marine Biologists make about $200, 000 - $300, 000 a year. Only about 1% of Amercans make that in a year. I'm a marine biologist and it depends on who you are working for I ma … ke $300,500 a year. It's a really great career. At times it can be difficult but worth it in the end. about £50,000 a year. How much does money does a Marine biologist get paid a month? You get Paid about 1250 dollars a WEEK so in a MONTH that is about 5000 so its a pretty good pay and plus after 10years you get paid about 200-500 thousand dollars a YEAR."}, {"url": "http://www.brighthub.com/office/career-planning/articles/101919.aspx", "passage_text": "Now, on to the question--how much money does a marine biologist make? The Bureau of Labor Statistics estimates median wages of all biologists at $31.98 hourly and $66,510 annually in their May 2009 survey. Average entry-level salaries for qualified marine biologists joining consulting firms, and those teaching biology at high schools range from $35000 to $40000 a year."}, {"url": "http://www.ehow.com/info_8085786_much-marine-biologists-make-year.html", "passage_text": "The U.S. Bureau of Labor Statistics shows that in May 2008, biochemists earned a median salary of $82,840. Microbiologists earned $64,350. Zoologists and wildlife biologists who would deal with marine mammals earned a median salary of $55,290. According to the website Sea Grant Marine Careers, a fisheries ecologist would earn a median salary of $32,500 in 2009. Education in the field of marine biology ranges from a bachelor's degree to a doctorate. The more education, the higher the pay. According to the Bureau of Labor Statistics, beginning salary offers for marine biologists with bachelor's degrees in 2009 was $33,254. According to the website PhD Program, a biochemist with a PhD can earn between $110,000 and $150,000 a year"}, {"url": "http://www.access2knowledge.org/jobs-education/how-much-do-marine-biologists-make/", "passage_text": "Salary. How much does a marine biologist make? According to the U.S. Bureau of Labor Statistics records from May 2012, the 18,650 marine and wildlife biologists employed throughout the United States earn a mean annual marine biologist salary of $62,500, which translates to an average hourly wage of $30.05."}, {"url": "http://www.answers.com/Q/How_much_money_do_marine_biologist_get_per_month", "passage_text": "The average salary for a marine biologist with a PhD is around $50,000 a year. About $25,000 - $45,000. With a PhD you do actually make 50,000 and more depending on what part … of marine Biology you go in. How much does money does a Marine biologist get paid a month? You get Paid about 1250 dollars a WEEK so in a MONTH that is about 5000 so its a pretty good pay and plus after 10years you get paid about 200-500 thousand dollars a YEAR."}, {"url": "http://www.answers.com/Q/How_much_money_does_a_marine_biologist_earn", "passage_text": "The average salary for a marine biologist with a PhD is around $50,000 a year. About $25,000 - $45,000. With a PhD you do actually make 50,000 and more depending on what part of marine Biology you go in. $200,000 a year. Marine Biologists make about $200, 000 - $300, 000 a year. Only about 1% of Amercans make that in a year. I'm a marine biologist and it depends on who you are working for I ma … ke $300,500 a year. It's a really great career. At times it can be difficult but worth it in the end. about £50,000 a year."}, {"url": "http://marinelife.about.com/od/marinecareers/f/What-Is-The-Salary-Of-A-Marine-Biologist.htm", "passage_text": "More established marine biologists may earn from about $35,000 (according to Salary.com) to about $110,000 (according to About BioScience). In many organizations and universities, a marine biologist will have to write grants to supply funding for their salaries. "}, {"url": "http://www.ehow.com/info_8710321_much-make-per-month-phd.html", "passage_text": "The average salary of a marine biologist can range from $33,000 all the way up to $140,000, or about $2,750 to $11,667 a month, according to information from the Bureau of Labor Statistics. A marine biologist's salary can vary greatly based on a number of factors. "}, {"url": "http://www.brighthub.com/office/career-planning/articles/101919.aspx", "passage_text": "Marine biologists with less than one year of experience have a starting salary of about $33,000 a year, those with two to five years of experience can earn $45,000 to $57,000 a year, and those with more than five years of experience earn about $60,000 to $70,000 a year. Average entry-level salaries for qualified marine biologists joining consulting firms, and those teaching biology at high schools range from $35000 to $40"}]