[{"url": "http://www.medicinenet.com/phlebitis_and_thrombophlebitis/article.htm", "passage_text": "Phlebitis means inflammation of a vein. Thrombophlebitis refers to a blood clot causing the inflammation. Phlebitis can be superficial, in the skin, or deep, in the tissues beneath the skin. Superficial phlebitis is phlebitis that is in a superficial vein under the surface of the skin. Deep vein thrombophlebitis refers to a blood clot causing phlebitis in the deeper veins."}, {"url": "http://www.emedicinehealth.com/phlebitis/article_em.htm", "passage_text": "Phlebitis (fle-BYE-tis) is a condition in which a vein becomes inflamed (phleb=vein + it is=inflammation). The inflammation may cause pain and swelling. When the inflammation is caused by a blood clot or thrombus, it is called thrombophlebitis. Thrombophlebitis usually occurs in leg veins, but it may also affect the veins in the arms. There are two sets of veins in the arms and legs, 1) the superficial veins that run just under the skin, and 2) the deep veins."}, {"url": "http://patient.info/health/superficial-thrombophlebitis-leaflet", "passage_text": "Superficial thrombophlebitis is inflammation of a vein just under the skin, usually in the leg. A small blood clot also commonly forms in the vein, but is usually not serious. The condition usually settles and goes within 2-6 weeks."}, {"url": "http://www.webmd.boots.com/a-to-z-guides/phlebitis", "passage_text": "Phlebitis causes. Superficial phlebitis is usually caused by a trauma to a vein. It is most often caused by an intravenous catheter (IV) placed in a vein, which irritates the vein. Superficial phlebitis may involve the formation of a blood clot that causes pain and inflammation."}, {"url": "http://www.emedicinehealth.com/phlebitis/page2_em.htm", "passage_text": "Superficial phlebitis is usually caused by local trauma to a vein. Superficial phlebitis is most often caused by an intravenous catheter (IV) placed in a vein, and the vein becomes irritated. Superficial phlebitis may or not have a blood clot form to cause the pain and inflammation."}, {"url": "http://www.webmd.boots.com/skin-problems-and-treatments/guide/thrombophlebitis", "passage_text": "Thrombophlebitis is inflammation or swelling in leg veins caused by blood clots. Thrombophlebitis can be a complication of varicose veins and can look red, feel warm to the touch and can be painful. With thrombophlebitis, a blocked vein in the leg becomes swollen, irritated, and even hard to the touch."}]