[{"url": "http://www.modernmom.com/2c2bb342-051f-11e2-9d62-404062497d7e.html", "passage_text": "A fetus can be detected as early as the sixth week of pregnancy. Many ultrasound technicians prefer to wait until at least that point in the pregnancy to do an ultrasound and many prefer waiting until the eighth week of pregnancy when more of the development of the fetus can be seen. Transvaginal ultrasound can be used to detect a fetus or gestational sac up to a week before traditional ultrasound. A transvaginal ultrasound is performed by inserting a lubricated wand into the vagina and performing the ultrasound internally."}, {"url": "http://www.advancedwomensimaging.com.au/first-trimester-dating-ultrasound", "passage_text": "1 You may have gone to your doctor with vaginal bleeding or you may be anxious because of problems in a previous pregnancy (such as miscarriage). 2  This ultrasound can routinely detect a heartbeat in your baby as early as 6-7 weeks. 3  Confirming the correct dates of your pregnancy. However, in the early pregnancy, the developing embryo is very small (at 6 weeks gestation, the baby is only 5-9mm long) and a transvaginal ultrasound may be required to get a better image of the baby. Transvaginal ultrasound is safe and commonly performed during all stages of pregnancy, including the first trimester."}, {"url": "https://in.answers.yahoo.com/question/index?qid=20090316041350AAbFeLY", "passage_text": "You may need to have another ultrasound a week or so later to detect the pregnancy, if you still feel you are pregnant and/or your blood HCG levels are rising. Generally, blood tests tend to be more relied upon up to 8 weeks of the pregnancy, with ultrasounds being more useful after this time. A tiny sac can be seen, but the baby and their heart beat may not be detected yet. Be aware that while it is possible to see a pregnancy this small, in many cases the pregnancy may not be detected, because the sac is so tiny."}, {"url": "http://www.amazingpregnancy.com/pregnancy-articles/354-html.html", "passage_text": "While it may be possible to detect a pregnancy as early as 5 1/2 weeks. Because the tiny sac containing the baby and its heart is so tiny, an ultrasound may not be able to detect pregnancy at this stage. If the baby can be seen at 6 to 7 weeks, their heart beat may even be detected. Between 7 and 8 weeks, the baby and their heart beat can both be detected relatively easily. After the 8th week of pregnancy the heart beat and the baby can be clearly seen. An ultrasound may be repeated a week or so after this point to check the baby’s progress and growth. A newer type of ultrasound known as a Transvaginal ultrasound is a technique used mainly to visualize the woman’s reproductive organs. This type of ultrasound has a better chance of detecting an early pregnancy."}, {"url": "http://www.advancedwomensimaging.com.au/first-trimester-dating-ultrasound", "passage_text": "1 Confirming the presence of your baby’s heartbeat. 2  You may have gone to your doctor with vaginal bleeding or you may be anxious because of problems in a previous pregnancy (such as miscarriage). 3  This ultrasound can routinely detect a heartbeat in your baby as early as 6-7 weeks. However, in the early pregnancy, the developing embryo is very small (at 6 weeks gestation, the baby is only 5-9mm long) and a transvaginal ultrasound may be required to get a better image of the baby. Transvaginal ultrasound is safe and commonly performed during all stages of pregnancy, including the first trimester."}, {"url": "http://www.modernmom.com/2c2bb342-051f-11e2-9d62-404062497d7e.html", "passage_text": "Detecting a Gestational Sac on Ultrasound. The gestational sac is seen earlier than a fetus can be detected on an ultrasound. A gestational sac can be seen as early as the fifth week of pregnancy or three weeks after conception. If no gestational sac is seen, it could mean that the expectant mother ovulated late. Transvaginal ultrasound can be used to detect a fetus or gestational sac up to a week before traditional ultrasound. A transvaginal ultrasound is performed by inserting a lubricated wand into the vagina and performing the ultrasound internally."}, {"url": "http://www.advancedwomensimaging.com.au/first-trimester-dating-ultrasound", "passage_text": "1 This ultrasound can routinely detect a heartbeat in your baby as early as 6-7 weeks. 2  Confirming the correct dates of your pregnancy. 3  Some women are uncertain of their last menstrual period (LMP) or have irregular menstrual cycles, making it difficult for their doctor to correctly estimate when the baby is due. However, in the early pregnancy, the developing embryo is very small (at 6 weeks gestation, the baby is only 5-9mm long) and a transvaginal ultrasound may be required to get a better image of the baby. Transvaginal ultrasound is safe and commonly performed during all stages of pregnancy, including the first trimester."}, {"url": "https://in.answers.yahoo.com/question/index?qid=20090316041350AAbFeLY", "passage_text": "Report Abuse. Its said to be possible to detect a pregnancy of 5 ½ weeks gestation on ultrasound. A tiny sac can be seen, but the baby and their heart beat may not be detected yet. Be aware that while it is possible to see a pregnancy this small, in many cases the pregnancy may not be detected, because the sac is so tiny."}, {"url": "http://americanpregnancy.org/prenatal-testing/ultrasound/", "passage_text": "Ultrasound dating of conception is not reliable for determining paternity because the ultrasound can be off by at least 5-7 days in early pregnancy. You may have an ultrasound between 18 to 20 weeks to evaluate dates, a multiples pregnancy, placenta location or complications. An ultrasound exam is a procedure that uses high-frequency sound waves to scan a woman’s abdomen and pelvic cavity, creating a picture (sonogram) of the baby and placenta. Although the terms ultrasound and sonogram are technically different, they are used interchangeably and reference the same exam."}]