[{"url": "http://www.learningaboutelectronics.com/Articles/Condenser-microphones", "passage_text": "Condenser Microphones. An Condenser microphone is a type of microphone that consists of a pair of charged plates that can be forced closer or further apart by variations in pressure. In effect, the plates act like a sound-sensitive capacitor."}, {"url": "http://www.differencebetween.com/difference-between-dynamic-microphone-and-vs-condenser-microphone/", "passage_text": "Dynamic Microphone vs Condenser Microphone. The main purpose of a microphone is to capture the sound of the artist performing or the sounds of people speaking. There are various types of microphones available in the market and the most popular ones are the dynamic microphone and condenser microphone."}, {"url": "http://www.youtube.com/watch?v=BCqRa1nCYTY", "passage_text": "So should you get a dynamic microphone or condenser microphone? What is the best microphone for recording vocals-dynamic or condenser? In essence, the only difference between a dynamic microphone and a condenser microphone is that they have different transducers."}, {"url": "http://www.mediacollege.com/audio/microphones/condenser.html", "passage_text": "A capacitor has two plates with a voltage between them. In the condenser mic, one of these plates is made of very light material and acts as the diaphragm. The diaphragm vibrates when struck by sound waves, changing the distance between the two plates and therefore changing the capacitance."}, {"url": "http://homerecording.about.com/od/microphones101/a/mic_types.htm", "passage_text": "When selecting microphones to use both live and in your home studio, you'll commonly come across two different types of microphones, dynamic and condenser. Let's look at both of these microphone types, and what their advantages and disadvantages are."}, {"url": "http://bluemic.com/blog/2010/05/condenser_microphone/", "passage_text": "A condenser microphone works by using a capacitor to convert the compression and rarefaction of sound waves into electrical energy. A capacitor is a passive electronic component consisting of two conductors separated by a dielectric (insulator)."}, {"url": "http://www.mediacollege.com/audio/microphones/condenser.html", "passage_text": "Condenser Microphones. Condenser means capacitor, an electronic component which stores energy in the form of an electrostatic field. The term condenser is actually obsolete but has stuck as the name for this type of microphone, which uses a capacitor to convert acoustical energy into electrical energy."}, {"url": "http://www.soundgearguide.com/condenser-microphone-really-need-one/", "passage_text": "For the most part, condenser microphones will be come in either large-diaphragm or small-diaphragm versions. The large-diaphragm condenser microphone is an all-around workhorse that is good for recording just about anything, from vocals to percussion to brass to strings."}, {"url": "http://www.learningaboutelectronics.com/Articles/Condenser-microphones", "passage_text": "A condenser microphone needs to receive an external voltage to both charge the diaphragm of the microphone so that the microphone can have charged plates (positive and negative plates) and to provide power to the amplifier. Condenser microphones come with a specification to the amount of voltage needed for power."}]