[{"url": "http://www.cosmeticsandtoiletries.com/research/biology/167734175.html", "passage_text": "The terms pathogenic and non-pathogenic are often are applied to various microbes. By definition, a pathogen is a specific cause of a disease, while a non-pathogen is considered harmless. In reality, the distinction is not always clear. In 1890, the German physician Robert Koch formalized the criteria to classify bacteria as pathogenic. (See Koch's Postulates)."}, {"url": "http://www.aquapurefilters.com/contaminants/108/bacteria.html", "passage_text": "The most common non-pathogenic bacteria found in water is iron bacteria. Iron bacteria can be readily identified by the red, feathery floc that forms overnight at the bottom of a sample bottle containing iron and iron bacteria. Not all types of bacteria are harmful. Many organisms found in water are of no health concern since they do not cause disease. Biological contamination may be separated into two groups: (1) pathogenic (disease causing) and (2) non-pathogenic (not disease causing)."}, {"url": "http://www.actionbioscience.org/biodiversity/wassenaar.html", "passage_text": "Confusingly, certain bacteria can be beneficial to some animals, and pathogenic to others. More commonly, pathogenic bacteria are harmful only to a limited number of hosts, or even only to one, whereas they live happily within other hosts without causing trouble. Both viruses and bacteria can cause disease. However, not all types of viruses cause disease in humans, and not all bacteria cause disease. The majority of bacteria are harmless and some are beneficial. Another common misconception is that all bacteria are bad for you."}, {"url": "http://www.healthhype.com/microorganisms-types-harmful-effects-on-human-body-pictures.html", "passage_text": "Microorganisms can be, according to their characteristics, divided into several groups: 1  bacteria, viruses, certain fungi and parasites. 2  pathogenic (capable of causing disease), non-pathogenic, and opportunistic (causing disease when they have an opportunity, like in people with low immune system). Microorganisms, like certain bacteria and yeasts, living on the human skin or in the nose, mouth, throat, small and large intestine and vagina, are part of the normal human flora; they prevent overgrowth of harmful microorganisms. Some of these microbes, when overgrow, may become pathogenic, though."}, {"url": "https://en.wikipedia.org/wiki/Pathogen", "passage_text": "Although the vast majority of bacteria are harmless or beneficial, a few pathogenic bacteria can cause infectious diseases. In biology, a pathogen (Greek: πάθος pathos “suffering, passion” and -γενής -genēs “producer of”) in the oldest and broadest sense is anything that can produce disease, a term which came into use in the 1880s."}, {"url": "http://www.answers.com/Q/Are_non_pathogenic_bacteria_harmful", "passage_text": "A non-pathogen is an organism that is not pathogenic. i.e. does not cause disease. Examples would be many of the organisms that reside in your intestines. 3 people found this useful. Edit. MRSA bacteria are pathogenic, this is the name given to a group of bacteria that belong to the Staphylococcus aureus family of bacteria which have grown resistant to me … thicillin-type antibiotics. MRSA stands for: Methicillin-resistant Staphylococcus aureus."}, {"url": "https://en.wikipedia.org/wiki/Pathogenic_bacteria", "passage_text": "Although most bacteria are harmless or often beneficial, several are pathogenic. One of the bacterial diseases with the highest disease burden is tuberculosis, caused by the bacterium Mycobacterium tuberculosis, which kills about 2 million people a year, mostly in sub-Saharan Africa. Some pathogenic bacteria cause disease under certain conditions, such entry through the skin via a cut, through sexual activity or an compromised immune function. Streptococcus and Staphylococcus are part of the normal skin microbiota and typically reside on healthy skin or in the nasopharangeal region."}, {"url": "http://www.infoplease.com/encyclopedia/science/bacteria-beneficial-bacteria.html", "passage_text": "Harmless and beneficial bacteria far outnumber harmful varieties. Thousands of bacterial species live commensally in humans, and many provide health benefits to humans, aiding in digestion, for example, or helping to prevent the establishment of colonies of pathogenic bacteria. "}, {"url": "http://www.wisegeek.org/what-are-harmful-bacteria.htm", "passage_text": "Most bacteria are harmless, but harmful bacteria, also known as pathogenic bacteria, can cause incredible damage to a person's body, including death. The majority of bacteria are known as nonpathogenic bacteria, and they comprise more than two-thirds of all those found on Earth. "}]