[{"url": "http://study.com/articles/What_Does_PhD_Stand_For.html", "passage_text": "What Does Ph.D. Ph.D. stands for Doctor of Philosophy. A Ph.D. is the terminal degree for many subjects in the United States. This article provides information about this degree and how it is earned. View 10 Popular Schools »."}, {"url": "http://www.getaphd.org/get-a-phd/phd-stand-for/", "passage_text": "PhD Stand For Definition According to Webster’s dictionary, simply put, a PhD stands for doctor of philosophy. This can refer to the actual academic program at a university or one that holds the degree."}, {"url": "http://classroom.synonym.com/phd-degree-stand-for-3565.html", "passage_text": "Ph.D. stands for Doctor of Philosophy. This is a common advanced degree that you can earn in most academic fields. A Ph.D. is a research-focused type of degree that usually takes around three to six years to earn. Typically, students who enter a doctorate program have aspirations of a career in academia or research."}, {"url": "http://www.answers.com/Q/What_does_PhD_stand_for", "passage_text": "To receive a PhD you first must receive a BA or BS degree (4 year under graduate degree). You then apply for a masters degree and then apply to be accepted to a PhD program. Some PhD programs combine the masters and PhD into one. You do not have to have perfect grades (A+) in a certain subject in college/universities."}, {"url": "https://en.wikipedia.org/wiki/Doctor_of_Philosophy", "passage_text": "A Doctor of Philosophy degree (often abbreviated Ph.D. , PhD, D.Phil. , or DPhil) or a Doctorate of Philosophy, from the Latin Doctor Philosophiae, is a type of doctorate awarded by universities in many countries."}, {"url": "http://www.answers.com/Q/What_does_PhD_stand_for", "passage_text": "Yes, the PhD is a doctorate (doctor of philosophy), however it is a research degree intended to prepare those who pursue it for a life of research and/or teaching. Those who h … old the PhD are not, however, physicians or healthcare providers per se with one exception (clinical psychologist)."}, {"url": "http://www.answers.com/Q/What_does_PhD_stand_for", "passage_text": "PhD is an abbreviation for  Doctor of Philosophy  (Philosophiae Doctor). The reason for the name is historical. Most universities used to have only four majors: divinity, law, medicine, and philosophy."}, {"url": "http://www.ehow.com/facts_6371402_phd-degree-stand-for_.html", "passage_text": "A Ph.D. degree is a Doctor of Philosophy, or philosophiae doctor in the original Latin. Philosophy means love of knowledge, and a Ph.D. is the highest graduate degree in the U.S. It's available in many fields, including the humanities, social sciences, natural sciences, business and engineering."}]