[{"url": "http://www.meaning-of-names.com/indian-names/anila.asp", "passage_text": "Meaning of Anila. Indian name. In Indian, the name Anila means-children of the wind.The name Anila originated as an Indian name. The name Anila is most often used as a girl name or female name. Indian Name Meaning-children of the wind. In Indian, the name Anila means-children of the wind.The name Anila originated as an Indian name. The name Anila is most often used as a girl name or female"}, {"url": "http://www.ourbabynamer.com/meaning-of-Anila.html", "passage_text": "Anila is generally used as a girl's name. It consists of 5 letters and 3 syllables and is pronounced A-ni-la. In the U.S. in 2014, it ranked 4999 in baby name popularity for girls with 27 occurrences. Less than 5 boys were given the name. View the Anila Name Popularity Page to see how the popularity trend for Anila has changed since 1880, or to compare the popularity of Anila to other names."}, {"url": "http://hamariweb.com/names/muslim/urdu/girl/anila-meaning_7148", "passage_text": "Find Anila meaning and definition at Hamariweb.com name dictionary a Best place to find your accurate name meanings in Urdu. Anila name reviews, Origin, gender, rating an many more about Anila. "}, {"url": "http://www.sheknows.com/baby-names/name/anita", "passage_text": "English Meaning: The name Anita is an English baby name. In English the meaning of the name Anita is: Aintroduced to Britain in the 13th century, made popular in the 14th century by the cult of St Anne. The form of the name varies with fashion:. Spanish Meaning: The name Anita is a Spanish baby name. The name Anita is an English baby name. In English the meaning of the name Anita is: Aintroduced to Britain in the 13th century, made popular in the 14th century by the cult of St Anne. The form of the name varies with fashion:."}, {"url": "https://en.wikipedia.org/wiki/Anita_(given_name)", "passage_text": "Anita is a common given name for women. In Sanskrit, Anita means full of grace, mercy, favor, variety, a leader, without guile. The name is the Spanish version of Anne. In Hebrew, Anita derives from the name Hannah which means grace or graceful. Furthermore, Anita is the short form for Anahita, the Iranian Water Goddess in Avestan language (an East Iranian language), and also has the meanings of kindness and being personable. The name Anita is mostly used in Hungary and Spanish, Portuguese, Italian speaking countries as well as Indian languages with Sanskrit origins."}, {"url": "http://www.babynamespedia.com/meaning/Anila", "passage_text": "[ 3 syll. a-ni-la, an-ila ] The baby girl name Anila is pronounced as aa-N IY-Laa- †. Anila has its origins in the Sanskrit language and it is used largely in Indian. The name Anila means 'the wind god'. Anila is the feminine version of the Chinese and Vietnamese An and the English and Indian Anil. Forms of Anila include the names Anilah, Anilla, Anyla, Anylah, Anylla, and Anyllah. Anila is not often used as a baby girl name. It is not in the top 1000 names"}, {"url": "http://www.babynology.com/meaning-anila-f79.html", "passage_text": "List of Sindhi baby names, Sindhi baby boy names (male), girl names (female) & Sindhi names meanings has been compiled from various resources. Please use this list of Sindhi baby names only for reference/idea to name your kid/child. Database of baby names has been compiled from various references and suggestions provided by our web site visitors and resources partners. Meaning of Anila in Sindhi origin/culture for Girl name with history and fame details. Many baby names sound really cute when your baby boy or baby girl is still a baby. However, when your baby grows to become a pilot, a sportsperson, a scientist or even the president of your country, it is an entirely different story. The noted tennis star of...."}, {"url": "http://www.sheknows.com/baby-names/name/anita", "passage_text": "Hebrew Meaning: The name Anita is a Hebrew baby name. In Hebrew the meaning of the name Anita is: Grace. Italian Meaning: The name Anita is an Italian baby name. In Italian the meaning of the name Anita is: Grace. The name Anita is an English baby name. In English the meaning of the name Anita is: Aintroduced to Britain in the 13th century, made popular in the 14th century by the cult of St Anne. The form of the name varies with fashion:."}]