[{"url": "http://www.healthcare-salaries.com/therapists/massage-therapist-salary", "passage_text": "In general, a massage therapist in the US receives his or her total earnings ranging from between $20,207 – $104,389 per annum. The starting salary for a massage therapist to about $17,270 per annum, while an average massage therapist receives an annual salary of about $39,789 per year. In addition, a well-established massage therapist receives a much higher salary of about $68,670"}, {"url": "http://www.massagetherapists.org/salary/", "passage_text": "1 Skilled, experienced massage therapists with thriving practices can make a massage therapist salary of over $60,000. 2  According to recent salary statistics, top-tier massage therapists reported making an average salary of $69,000 per year. 3  The median annual massage therapist salary is typically around $34"}, {"url": "http://www.massagetherapists.org/salary/", "passage_text": "1 According to recent salary statistics, top-tier massage therapists reported making an average salary of $69,000 per year. 2  The median annual massage therapist salary is typically around $34,000 per year. 3  Specialty hospitals typically pay the highest massage therapist salaries."}, {"url": "http://www.massagetherapists.org/salary/", "passage_text": "1 The median annual massage therapist salary is typically around $34,000 per year. 2  Specialty hospitals typically pay the highest massage therapist salaries. 3  Massage therapists in these hospitals make an average of $55,02"}, {"url": "http://www.wikiprofessional.org/Massage_Therapist_Salary", "passage_text": "How much does a massage therapist make? According to the U.S. Bureau of Labor Statistics (bls.gov), the median massage therapy salary is $35,970. This is around $10,000 more than the annual earnings of the average worker in other healthcare support occupations."}, {"url": "http://www.healthcare-salaries.com/therapists/massage-therapist-salary", "passage_text": "Average massage therapist salary. Average annual salary for a massage therapist ranges from between $26,579 to $72,250 per year and the hourly wage ranges from between $8.3-$33.01 per hour."}, {"url": "http://money.usnews.com/careers/best-jobs/massage-therapist/salary", "passage_text": "Salary Outlook. The BLS reports the median annual wage for massage therapists was $35,920 in 2013. The best-paid 10 percent in the profession made more than $71,020, while the bottom 10 percent made less than $18,280."}]