[{"url": "http://www.wikihow.com/Tell-Someone-They-Are-Beautiful", "passage_text": "1. Understand the reason you want to tell someone they're beautiful. There are many reasons to let someone know they're beautiful and not all of them are romantic. Understanding the reason you wish to lay this compliment upon them will do more for its acceptance than anything else. 1 Give them reasons to get out of the dumps and reclaim their confidence.  2 That Moment. 3  Sometimes there really isn't a reason to tell someone they're beautiful; but you do it anyway."}, {"url": "http://www.wikihow.com/Say-Beautiful-in-Spanish", "passage_text": "How to Say Beautiful in Spanish. There are many ways to say beautiful in Spanish. Whether you want to compliment a man or a woman, or just say something is beautiful, saying beautiful in Spanish is easy. If you want to learn how to say beautiful in Spanish in any context, just follow these easy tips. Ad. 1. Saying something is beautiful. Just as in English, you can use the word beautiful to describe many things in Spanish, such as the weather, an item of clothing, or a beautiful view. There is no set rule for when to use which synonym for beautiful. It depends on the noun you're defining"}, {"url": "https://answers.yahoo.com/question/index?qid=20060831144349AALYeQD", "passage_text": "SOMEONE IS BEAUTIFUL------in hindi we say it as------tum means the person whom you r saying beautiful and beautiful in hindi means sundar..... If u'd like to say-u r beautiful in first person, its tum sundar ho. If you want to say it formally, its aap sundar hain. You can add bahut (very) for effect."}, {"url": "https://answers.yahoo.com/question/index?qid=20060831144349AALYeQD", "passage_text": "Please no harsh answers, I am serious and want to know how to say Beautiful in Hindi, I am still learning this wonderful language and I appreciate any help I can get. Dahnuwahd, in advance for your answers. Source(s): beautiful hindi: https://every.im/e10/how-do-you-say-some... If u'd like to say-u r beautiful in first person, its tum sundar ho. If you want to say it formally, its aap sundar hain. You can add bahut (very) for effect."}, {"url": "http://www.ehow.com/how_4465232_say-_beautiful_-spanish.html", "passage_text": "Just as in English, there are a few different ways to say beautiful in Spanish. The most common words are bella, hermosa, preciosa, linda, bonita and guapa. Words that Mean Beautiful. Words such as bella, hermosa, linda, bonita, guapa and preciosa can all be used as adjectives to describe a beautiful woman. Spanish uses adjectives that end in 'a' to describe female nouns and adjectives that end in 'o' to describe male nouns."}, {"url": "http://reallifeglobal.com/75-words-beautiful/", "passage_text": "English has so many ways to say the same thing. This rich mix of different tongues and the evolution of English (much thanks to our friend Shakespeare) has made English the beautiful melange [mélange] mixture that it is. Today pay attention to The etymology of some of the words. below 9. Lovely is a synonym for what is generally a feminine beauty that describes an elegant and/or radiant beauty. You can also use it to describe things and events (i.e. I had a lovely time at the park, my vacation was lovely, etc)."}, {"url": "http://thoughtcatalog.com/christine-stockton/2013/11/61-quotes-that-will-make-you-feel-beautiful-no-matter-how-you-look/", "passage_text": "People often say that beauty is in the eye of the beholder, and I say that the most liberating thing about beauty is realizing you are the beholder. Salma Hayek. “I’m beautiful to the one person who matters.”. “Yes. "}, {"url": "http://reallifeglobal.com/75-words-beautiful/", "passage_text": "1 A Beauty/ A Beaut (n) is to describe a particularly perfect example of something (for things and people), mainly used by men. 2  Becoming (adj) is more of an elegant word meaning that it brings out the beauty, such as a nice dress or shirt that makes a person or thing more beautiful. 9. Lovely is a synonym for what is generally a feminine beauty that describes an elegant and/or radiant beauty. You can also use it to describe things and events (i.e. I had a lovely time at the park, my vacation was lovely, etc)."}, {"url": "http://www.wikihow.com/Tell-Someone-They-Are-Beautiful", "passage_text": "Steps. 1. Understand the reason you want to tell someone they're beautiful. There are many reasons to let someone know they're beautiful and not all of them are romantic. Understanding the reason you wish to lay this compliment upon them will do more for its acceptance than anything else. 1  Initiating affections. 1 Give them reasons to get out of the dumps and reclaim their confidence.  2 That Moment. 3  Sometimes there really isn't a reason to tell someone they're beautiful; but you do it anyway."}]