[{"url": "http://genetics.thetech.org/original_news/news16", "passage_text": "To find a DNA fingerprint, a scientist has to first take the DNA out of the nucleus of a cell. The cell that is used to get a DNA fingerprint can be a skin cell, a hair root cell, or even a cheek cell that gets washed out of your mouth in your spit. This is because your unique DNA is the same in all of your cells. "}, {"url": "http://jdutchstevens.tripod.com/id4.html", "passage_text": "(Crime Scene Investigation) This is a very important use of DNA fingerprinting because it can prove an individuals innocents or guilt of committing a crime. To be used a sample of DNA has to be obtained from the scene of the crime and matched with the suspect in question. Diagnosis and Cures for Inherited Diseases DNA fingerprinting can also be used to detect and cure genetically inherited diseases. Using a DNA fingerprinting one can detect genetic diseases like cystic fibrosis, hemophilia, Huntington’s disease and many others."}, {"url": "http://www.wisegeek.org/what-is-dna-fingerprinting.htm", "passage_text": "Fingerprints might be left at a crime scene. DNA fingerprinting can establish a criminal's guilt. The majority of a human's DNA will match that of any other human. The sections of DNA used in DNA fingerprinting are passed doen from parents to their children. DNA fingerprinting is becoming increasingly prevalent in the world of criminal forensics."}, {"url": "http://www.fingerprinting.com/what-is-dna-fingerprinting.php", "passage_text": "DNA Fingerprinting is a procedure whereby the genetic information, called DNA, in a person's cells is analysed and identified. The word fingerprinting is used because, just like a fingerprint, no two person's genetic code is exactly the same. This makes DNA fingerprinting a very useful tool for our modern society. It can be used to: 1  Determine Family Relationship-DNA can help find out who a person's parents or siblings are. 2  Prenatal paternity tests are available to mothers who need to identify the father of their unborn babies."}, {"url": "http://www.wisegeek.org/what-is-a-dna-fingerprint.htm", "passage_text": "A DNA fingerprint is the same thing as DNA testing, DNA typing, DNA profiling, DNA analysis and genetic fingerprinting. It refers to identification of an individual based on his or her DNA profile. A DNA fingerprint can be the material left behind by everything from skin cells to saliva. The term “fingerprint” is used loosely here. It's kind of like how you could say an interior designer really left her fingerprint on a room. You wouldn't be referring to the literal print of her finger."}, {"url": "http://www.wisegeek.org/what-is-a-dna-fingerprint.htm", "passage_text": "DNA fingerprinting does not mean gathering a literal fingerprint. A DNA fingerprint can be the material left behind by everything from skin cells to saliva. The term “fingerprint” is used loosely here. It's kind of like how you could say an interior designer really left her fingerprint on a room. You wouldn't be referring to the literal print of her finger."}, {"url": "http://www.webmd.com/a-to-z-guides/dna-fingerprinting", "passage_text": "Only a small sample of cells is needed for DNA fingerprinting. A drop of blood or the root of a hair contains enough DNA for testing. Semen, hair, or skin scrapings are often used in criminal investigations. A person who has DNA fingerprinting done voluntarily usually provides a sample of blood taken from a vein. Why It Is Done. DNA fingerprinting is done to: 1  Find out who a person's parents or siblings are. 2  This test also may be used to identify the parents of babies who were switched at birth. 3  Solve crimes (forensic science)."}, {"url": "http://www.wisegeek.org/what-is-a-dna-fingerprint.htm", "passage_text": "A person's DNA profile is unique. DNA fingerprinting is a type of identification based on an individuals DNA profile. DNA found on items like cigarette butts can be used to produce a fingerprint.. DNA fingerprinting was first described by English geneticist Alec Jeffreys. A DNA fingerprint can be the material left behind by everything from skin cells to saliva. The term “fingerprint” is used loosely here. It's kind of like how you could say an interior designer really left her fingerprint on a room. You wouldn't be referring to the literal print of her finger."}]