[{"url": "http://www.discoveringireland.com/vacations/the-cliffs-of-moher/", "passage_text": "Outside Liscannor, Co Clare. Situated in County Clare and bordering the Burren Area, the Cliffs of Moher are one of Ireland's most spectacular sights. Standing 230 metres above the ground at their highest point and 8km long, the Cliffs boast one of the most amazing views in Ireland. History. Situated in County Clare and bordering the Burren Area, the Cliffs of Moher are one of Ireland's most spectacular sights."}, {"url": "http://www.ireland.com/en-us/amazing-places/cliffs-of-moher/", "passage_text": "The Cliffs of Moher in County Clare are one of Ireland’s most important bird-breeding sites. The Cliffs hold one of the major colonies of cliff nesting area in Ireland. This area was designated as a Special Protection Area for Birds in 1989. Read more. "}, {"url": "https://en.wikipedia.org/wiki/Cliffs_of_Moher", "passage_text": "The Cliffs of Moher (Irish: Aillte an Mhothair) are located at the southwestern edge of the Burren region in County Clare, Ireland. They rise 120 metres (390 ft) above the Atlantic Ocean at Hag's Head, and reach their maximum height of 214 metres (702 ft) just north of O'Brien's Tower, eight kilometres to the north. The Cliffs of Moher Visitor Experience won an award in the Interpret Britain & Ireland Awards 2007 awarded by the Association of Heritage Interpretation (AHI). Although the award was specifically for the Atlantic Edge exhibition, the AHI assessed the entire visitor centre and site."}, {"url": "http://www.cliffs-moher.com/about.php", "passage_text": "On the west coast of Ireland The Cliffs Of Moher are one of the most outstanding coastal features of Ireland.The cliffs are located in county Clare and lie just south from the Village of Doolin and the Burren. "}, {"url": "http://www.cliffsofmoher.ie/", "passage_text": "The Cliffs of Moher are Ireland’s most visited natural attraction with a magical vista that captures the hearts of up to one million visitors every year. Standing 214m (702 feet) at their highest point they stretch for 8 kilometres (5 miles) along the Atlantic coast of County Clare in the west of Ireland. From the Cliffs of Moher on a clear day one can see the Aran Islands and Galway Bay, as well as the Twelve Pins and the Maum Turk mountains in Connemara, Loop Head to the south and the Dingle Peninsula and Blasket Islands in Kerry."}, {"url": "http://www.cliffs-moher.com/", "passage_text": "On the west coast of Ireland, the Cliffs of Moher are one of the most outstanding coastal features of Ireland and biggest Tourist Attraction. A visit to these cliffs should not be missed. What To See And Do. The cliffs of Moher are located just south of the Village of Doolin in Co Clare Ireland. Rising slowly from Doolin they ascend to over 700 feet (213 metres) stretching south for nearly five miles (8km) to Hags head. They are Irelads premier tourist attraction and a must see for anyone visiting Irelan"}, {"url": "http://www.destination360.com/europe/ireland/cliffs-of-moher", "passage_text": "Share. The spectacular Cliffs of Moher in Ireland are located in County Clare, near the Burren Area. The highest point of the cliffs stands 710 feet high, and the cliffs themselves stretch five miles down the coast. From atop the Cliffs of Moher Ireland, visitors can see one of the most amazing views in Ireland. South of the Cliffs of Moyer in Ireland, Hag’s Head and O’Brien’s Tower look out over the water. The Cliffs reach their highest point just north of O’Brien’s Tower. O’Brien’s Tower is an old sentinel tower."}]