[{"url": "http://www.wikihow.com/Write-a-Letter-Requesting-Sponsorship", "passage_text": "Sponsorship can take many different forms. Before you write a sponsorship letter, you need to determine what you’re asking for. 1  Cash or in-kind donations are both possibilities. 2  In-kind donations mean the business donates materials or products that can be used at the event instead of just giving money. "}, {"url": "http://www.answers.com/Q/How_do_you_write_a_letter_asking_for_money", "passage_text": "1 Be sure to refer to the insert in your fundraising letter. 2  Thank you. 3  A statement of gratitude is polite and subtly assumes that the contribution will be made. 4  Express gratitude for the reader's generosity and for having taken the time to consider your very important cause. If you are writing a letter to your father for him to allow you to  go on a tour during winter break, you need to let him know who you  are going with. If you are asking him … for money, you need to let  him know if you plan on paying him back."}, {"url": "http://www.wikihow.com/Write-a-Letter-Asking-for-Scholarship-Money", "passage_text": "Your letter needs to convince the scholarship committee that you not only have the initiative and leadership necessary to successfully complete the college program that you are seeking to obtain financial support for but that you will be a proud addition to the success of the scholarship program. Tips. 1  Incorporate an active voice when writing the letter. 2  Be professional in your tone, concise, clear and direct. 3  After writing the first letter and using it as a blueprint for the rest, be sure to change pertinent information like addressee, date, etc., in your header."}, {"url": "http://budgeting.thenest.com/write-letter-insurance-company-requesting-money-22477.html", "passage_text": "You may need to write a letter to an insurance company requesting money when you have a claim. Chat with an attorney before you fire off your letter to make sure you hit all the high notes. Keep your letter concise to ensure effective communication. Step 5. Provide details that support your request in the second paragraph. Explain the expenses or charges you have incurred that fall under your insurance benefits, including dates and professionals who have provided you with service. Refer to the portion of your policy that covers your damages."}, {"url": "http://info.legalzoom.com/write-letter-requesting-payment-deceaseds-debt-23257.html", "passage_text": "If someone died owing you money, you may request payment by writing a letter to the personal representative of the deceased's estate. Generally, each state has a statute listing all the information such a letter must include in order for it to constitute a valid creditor's claim. "}, {"url": "http://www.ehow.com/how_8549943_write-letter-requesting-money-trust.html", "passage_text": "Identify yourself as a beneficiary of the irrevocable trust in the body of the letter. State that you are requesting money from the trust, and the reason for the request. Include supporting documentation. For example, if you are requesting money to pay medical bills, enclose copies of the bills. Provide instructions regarding how you would like the funds sent to you, or provide the name and address of another payee, such as a college or hospital. Write a closing for the letter, sign your name, and provide your contact information. Your signature is a critical part of the withdrawal process, since the trust agreement usually requires that the trustee get the request in writing, signed by the beneficiary"}, {"url": "http://nonprofit.about.com/od/grantwritingfaqs/f/corpfoundproposal.htm", "passage_text": "Generally, to request funds from a corporate foundation, it is wise to be brief. In the Nonprofit Kit for Dummies, authors Stan Hutton and Frances Phillips suggest that you write a two-page proposal letter that covers these eight points: 1  Ask for a specific contribution at the beginning of the letter. 1 Ask for a specific contribution at the beginning of the letter. 2  Mention whether or not your nonprofit has had experience with the funder before. 3  Describe briefly the need or the problem you wish to address with the funder's contribution. 4  Explain what your nonprofit will do should the grant be given."}, {"url": "http://www.answers.com/Q/How_do_you_write_a_letter_asking_for_money", "passage_text": "To write a letter to ask for assistance for a wedding personalize  the letter and show interest in who the letter is addressed to.  When asking for assistance do it in a way … that leaves the reader  free to make a donation or not. Don't make them feel uncomfortable  or obligated to donate. If you are writing a letter to your father for him to allow you to  go on a tour during winter break, you need to let him know who you  are going with. If you are asking him … for money, you need to let  him know if you plan on paying him back."}]