[{"url": "http://www.urmc.rochester.edu/encyclopedia/content.aspx?ContentTypeID=90&ContentID=P01960", "passage_text": "Hypoglycemia occurs when the blood sugar is too low to fuel the brain and the body. Glucose is the main source of fuel for the body. The normal range of blood sugar, depending on the timing and nutritional content of the last meal consumed, is approximately 70 to 140 mg/dl (milligrams of glucose per deciliter of blood). However, consult your child's doctor for more specific information. Hypoglycemia may be a condition by itself, or may be a complication of diabetes or another disorder. Hypoglycemia is most often seen as a complication of overdoing insulin in a person with diabetes, which is sometimes referred to as an insulin reaction."}, {"url": "http://www.diabetes.org/living-with-diabetes/treatment-and-care/blood-glucose-control/hypoglycemia-low-blood.html", "passage_text": "Hypoglycemia is a condition characterized by abnormally low blood glucose (blood sugar) levels, usually less than 70 mg/dl. However, it is important to talk to your health care provider about your individual blood glucose targets, and what level is too low for you. Hypoglycemia may also be referred to as an insulin reaction, or insulin shock. Hypoglycemic symptoms are important clues that you have low blood glucose. Each person's reaction to hypoglycemia is different, so it's important that you learn your own signs and symptoms when your blood glucose is low."}, {"url": "https://en.wikipedia.org/wiki/Glucose_meter", "passage_text": "A glucose meter (or glucometer) is a medical device for determining the approximate concentration of glucose in the blood. It can also be a strip of glucose paper dipped into a substance and measured to the glucose chart. It is a key element of home blood glucose monitoring (HBGM) by people with diabetes mellitus or hypoglycemia. "}, {"url": "http://www.urmc.rochester.edu/encyclopedia/content.aspx?ContentTypeID=85&ContentID=P00342", "passage_text": "Blood sugar levels under 70 mg/dL are too low and are considered unhealthy. Hypoglycemia may be a condition by itself, or may be a complication of diabetes or another disorder. It is most often seen as a complication of diabetes, which is sometimes referred to as insulin reaction. To treat low blood sugar immediately, you should eat or drink something that has sugar in it, such as orange juice, milk, or a hard candy. For people who do not have diabetes, treatment (as directed by a doctor) depends on the cause of hypoglycemia."}, {"url": "http://www.medicalnewstoday.com/articles/166815.php", "passage_text": "A person with abnormally low levels of blood sugar (glucose) has hypoglycemia. Glucose is the body's main energy source. Hypoglycemia is not a disease in itself; it is a sign of a health problem. The majority of people know when their blood sugar levels have dropped, and have time to do something about it. According to Medilexicon's medical dictionary, hypoglycemia is Symptoms resulting from low blood glucose (normal glucose range 60-100 mg/dL [3.3-5.6 mmol/L]), which are either autonomic or neuroglycopenic. Autonomic symptoms include sweating, trembling, feelings of warmth, anxiety, and nausea."}, {"url": "http://www.webmd.com/diabetes/hypoglycemia-overview?page=4", "passage_text": "1 The patient complains of symptoms of hypoglycemia. 2  Blood glucose levels are measured while the person is experiencing those symptoms and found to be 45 mg/dL or less in a woman or 55 mg/dL or less in a man. 3  The symptoms are promptly relieved upon ingestion of sugar. Reactive hypoglycemia with no known cause is a condition in which the symptoms of low blood sugar appear 2 to 5 hours after eating foods high in glucose. Ten to 20 years ago, hypoglycemia was a popular diagnosis. However, studies now show that this condition is actually quite rare."}, {"url": "http://www.urmc.rochester.edu/encyclopedia/content.aspx?ContentTypeID=85&ContentID=P00342", "passage_text": "Hypoglycemia (Low Blood Sugar). Hypoglycemia is a condition characterized by a glucose (blood sugar) level that is too low to effectively fuel the body's blood cells. To treat low blood sugar immediately, you should eat or drink something that has sugar in it, such as orange juice, milk, or a hard candy. For people who do not have diabetes, treatment (as directed by a doctor) depends on the cause of hypoglycemia."}, {"url": "http://www.medicalnewstoday.com/articles/166815.php", "passage_text": "If you suffer from diabetes, after you have checked your blood glucose and treated the hypoglycemia wait between 15 to 20 minutes and check your blood glucose again. If your blood glucose is still low repeat the whole process-eat some glucose, wait about 15-20 minutes and check your blood glucose again. According to Medilexicon's medical dictionary, hypoglycemia is Symptoms resulting from low blood glucose (normal glucose range 60-100 mg/dL [3.3-5.6 mmol/L]), which are either autonomic or neuroglycopenic. Autonomic symptoms include sweating, trembling, feelings of warmth, anxiety, and nausea."}, {"url": "https://en.wikipedia.org/wiki/Hypoglycemia", "passage_text": "The glucose level that defines hypoglycemia is variable. In people with diabetes levels below 3.9 mmol/L (70 mg/dL) is diagnostic. In adults without diabetes, symptoms related to low blood sugar, low blood sugar at the time of symptoms, and improvement when blood sugar is restored to normal confirm the diagnosis. In newborns a level below 2.2 mmol/L (40 mg/dL) or less than 3.3 mmol/L (60 mg/dL) if symptoms are present indicates hypoglycemia. Other tests that may be useful in determining the cause include insulin and C peptide levels in the blood."}, {"url": "https://en.wikipedia.org/wiki/Hypoglycemia", "passage_text": "Symptoms typically come on quickly. The most common cause of hypoglycemia is medications used to treat diabetes mellitus such as insulin, sulfonylureas, and biguanides. Risk is greater in diabetics who have eaten less than usual, exercised more than usual, or drunk alcohol. In newborns a level below 2.2 mmol/L (40 mg/dL) or less than 3.3 mmol/L (60 mg/dL) if symptoms are present indicates hypoglycemia. Other tests that may be useful in determining the cause include insulin and C peptide levels in the blood."}]