[{"url": "http://www.tailoronten.com/blogs/news/3401262-bemberg-the-king-of-linings", "passage_text": "The best option for lining is a material called cupro. Bemberg, a high-quality brand of cupro produced in Japan, is breathable, light, durable, and with a silky touch that looks and feels great. Bemberg is made from cotton, but the makeup of the fibre is changed to give it its unique properties. "}, {"url": "http://www.ecouterre.com/cupro-a-cellulose-fiber-made-from-recovered-cotton-waste/", "passage_text": "CUPRO \\¦k(y)ueˈprō\\. üˈprō. n 1: A a regenerated cellulose fiber derived from cotton (linter the, ultrafine silky fibers that stick to the seeds of the cotton plant after’it s been) ginned that has been dissolved in a solution of ammonia and copper. oxide To me, cupro/rayon/viscose processing cancels out the benefits of using cotton waste. says: April 7, 2012 at 7:06 am. If you only look at the fibre part (so not making a fabric out of it) then according to Made-by it’s benchmark for fibres it is as bad as conventional cotton."}, {"url": "https://prettysmartnaturalideas.wordpress.com/2010/08/25/cupro-fabric-what-is-that-and-how-do-you-clean-it/", "passage_text": "All of the fabric/cleaning info sewn into the pants was in German, so I had to google. It turns out that cupro is a fancy “silk substitute” like rayon and tencel are designed to be. It is made from wood fiber and cotton by-products. (I thought I was holding silk, at first, but I recognize the word for silk in most languages, so then I was fearful about cleaning issues). No worries. "}, {"url": "http://www.answers.com/Q/What_is_cupro_fabric", "passage_text": "Cupro-The European cousin of tencel, Cupro is also somewhat similar to rayon in that it is reprocessed cellulose. Like tencel and rayon, the base material for cupro is a regenerated cellulose fiber. In this process, the wood pulp or cotton liners are dissolved in an ammoniac copper oxide solution. Cupro fabric breathes like cotton, drapes beautifully, and feels like silk on your skin. Its slinky, curve-hugging drape makes it great for elegant dresses and blouses."}, {"url": "http://www.asahi-kasei.co.jp/fibers/en/cupro/what/reason.html", "passage_text": "Because Cupro originates in the natural cotton plant and. is reborn with the infusion of human technology, it features both the gentleness of natural fibers and the functionality of man-made fibers. Each Cupro fiber is extremely fine and has circular cross section, largely free from the unevenness of natural fibers, and uniform in thickness. One touch, and the difference is clear-Cupro is softer than cotton"}, {"url": "http://www.fodere-marik.com/english/linings.htm", "passage_text": "Bemberg, Cupro Linings jacquard, and yarn dyed. Our linings are made of Bemberg Cupro® , which is a natural fibre (the raw material it is made of is cotton) and which is very used in the field of tailoring and clothing in general, thanks to its silken, transpiring and thermoregulatoring qualities. The Bemberg Cupro's Jacquard is a very precious material, thanks to its changing quality and its unique brightness, and it doesn't have a back side. Both sides can be used, offering therefore two different changing shades."}, {"url": "http://www.whatisviscose.com/Cupro.html", "passage_text": "The World of. VISCOSE. Cupro is commonly known as a Japanese based developped material. - It is a kind of Rayon (Viscose) group of Fibres. It is more like Liocell, it is reprocessed cellulose. It is made from regenerated cellulose fiber. Cuprammonium, gives the name to the fibre Cupro, it is used in making of process the wood pulp which is the base material. With the process, the wood pulp is dissolved in an ammoniac copper oxide solution. Cupro fabric breathes like cotton, drapes beautifully, and feels like silk on your skin. "}, {"url": "http://forums.vintagefashionguild.org/threads/what-is-cupro-fabric.32693/", "passage_text": "I've got an 80's evening jacket which feels very much like soft velvet. The content label shows the fabric is made from 64% viscose, 34% cupro, 2% metal. The jacket is by Jean Claire for after five. So far I've found that cupro is the European cousin of Tencel®, which in turn is the registered trade name for Lyocell, a biodegradable fabric made from wood pulp cellulose. I'm interested if anyone has heard of cupro or can confirm whether the above information is correct. Here's the jacket and it's definitely European made. I've attached a close-up shot of the fabric around the button but it's black so it's difficult to see."}]