[{"url": "http://www.universetoday.com/21669/temperature-of-neptune/", "passage_text": "According to scientists, the surface of Neptune is one of the coldest places in the Solar System. At its surface, where the clouds of the planet touch space, the temperature of Neptune can dip down to 55 Kelvin. That’s -218 degrees Celsius. Neptune and its Great Dark Spot. Image credit: NASA/JPL. The average temperature of Neptune is 73 K (-200 Celsius)."}, {"url": "http://www.ehow.com/video_4765931_surface-conditions-neptune.html", "passage_text": "The surface of Neptune isn't very solid, being a gas giant, and the surface temperature is -225 degrees Celsius. Learn about the atmosphere of Neptune, which is made of hydrogen, helium and methane, with help from a science teacher in this free video on planetary science."}, {"url": "http://www.space.com/18922-neptune-atmosphere.html", "passage_text": "Atmospheric composition. Neptune's atmosphere is made up predominately of hydrogen and helium, with some methane. The methane is part of what gives Neptune its brilliant blue tint, as it absorbs red light and reflects bluer colors. Uranus also has methane in its atmosphere, but has a duller shading."}, {"url": "http://www.ehow.com/info_8273129_surface-composition-neptune.html", "passage_text": "Neptune is one of the solar system's gas giants, meaning that it is composed entirely of gas. Its upper atmosphere, or surface is composed of three gases. Even though humans will never be able to physically set foot on the planet, satellite visits have revealed a lot about its composition and weather patterns."}, {"url": "http://www.moonphases.info/neptunes-surface.html", "passage_text": "Neptunes Surface is unlike any other surface. The surface of Neptune is known to be the most dynamic and active place in the Solar System. Neptune is one of the planets that hold a lot of energy and heat. If you look at a picture of Neptune, you see this pretty blue-green surface."}, {"url": "http://www.universetoday.com/22070/surface-of-neptune/", "passage_text": "So, we’re clear that the surface of Neptune isn’t solid. There’s no standing on Neptune. That said, the “surface of Neptune” that we see is one the most active and dynamic places in the Solar System."}]