[{"url": "https://www.aupairworld.com/en/au_pair_program/denmark", "passage_text": "The Danish government offers two options to au pairs who wish to live in Denmark for a limited amount of time: they can go there through the au pair programme or the Working Holiday programme. Age: 18 - 29. Working hours: 18-30 hours a week, not more than 3-5 hours per day."}, {"url": "http://aupairmom.com/can-married-couples-get-jobs-as-au-pairs-or-a-person-with-hisher-own-child/2013/01/07/celiaharquail/", "passage_text": "Married couples (or engaged couples) cannot be “au pairs”. Au pair positions in the USA are for one person at a time. Even host families that need two au pairs at the same time don’t look for married or partnered ‘couples’, since the family has two au pairs usually to cover a work week that is more than 45 hours long."}, {"url": "https://www.aupairworld.com/en/faq", "passage_text": "Young persons aged 18-30 can become au pairs. They should neither be married, nor have any children. Every person wishing to work as an au pair should enjoy caring for children and getting to know a new culture and language. Au pairs should have a basic knowledge of the official languages spoken in their host countries."}, {"url": "https://answers.yahoo.com/question/index?qid=20090329225304AA5GvZI", "passage_text": "Hi, I am an au pair in a J-1 visa, I have been in the US for 11 months and I have a contract extended until another 12 months. I have been dating for 6 months and my boyfriend and I decided we want to get married."}, {"url": "https://www.aupairworld.com/en/au_pair_program/denmark", "passage_text": "1 The au pair contract which is signed by both parties, the host family and the au pair, is already included in the application form for a residence permit. 2  The residence permit is granted for one year and can be extended for six months. 3  The maximum period for a residence permit is 18 months."}, {"url": "https://www.berkeleyparentsnetwork.org/advice/childcare/aupair", "passage_text": "If your au pair does not seem to be working out, you talk to the local au pair coordinator who tries to mediate--if after 2 weeks, it is not resolved, you can terminate their employment. It is also worth noting that au pairs can only stay with a family for 12 months."}, {"url": "https://www.aupairworld.com/en/au_pair_program/denmark", "passage_text": "Contract: The au pair and the host family have to sign an au pair contract. In Denmark, this contract is already included in. . The au pair contract may be signed for a maximum of 12 months."}, {"url": "http://aupairmom.com/if-my-au-pair-gets-married-can-she-still-au-pair/2011/01/23/celiaharquail/", "passage_text": "My au pair is engaged and will get married right after her year with us ends, during those few weeks that au pairs are allowed to legally stay in the US. She and her fiance seem to have done a lot of research to find out the process and details."}]