[{"url": "https://www.westerncape.gov.za/Text/2006/2/ward_committee_handbook.pdf.pdf", "passage_text": "In simple terms ward committees are made up of elected members of a particular ward to: 1. raise issues of concern about the local ward to the ward councillor2. have a say in decisions, planning and projects that the council or municipality undertakes which have an impact on the ward."}, {"url": "http://www.grocotts.co.za/content/what-function-ward-committee-10-11-2009-0", "passage_text": "According to Madinda this is because of a communication problem in those wards where ward members say they didn't have knowledge of such meetings. Section 74(b) of the Municipal Structures Act, 1998 provides that a council may also delegate specific municipal duties and powers to a ward committee. The role of a ward councillor is to serve as the chairperson of the ward commitee and act as a liason between the municipality and the community. The ward committee reports problems to the ward councillor who then reports on these issues and/or developments at council meetings. According to the act the official viewpoint is that it is difficult to conceive what functions should be assigned to the ward committees.."}, {"url": "http://ddp.org.za/information-material/research-unit/research-themes/citizenship-participation/Public%20Participation%20and%20Ward%20committees.pdf/download", "passage_text": "The functioning of ward committees is dependent on ward councillors. This is because they are responsible for: scheduling meetings; setting the agenda; the information required by committee members; and the type of information the council required from ward committees (CHORUS, 2006)."}, {"url": "http://www.localgovernmentaction.org/content/committees-and-their-duties", "passage_text": "The ward councillor is responsible for organising meetings and setting the ward committee agendas (s. 72, 73, 77 of the Municipal Structures Act). If the ward councillor does not attend the meeting, the ward committee may set the agenda itself."}, {"url": "http://www.localgovernmentaction.org/content/committees-and-their-duties", "passage_text": "1 Find out what your municipality’s policies or rules are for ward committees in terms of notice and agendas for meetings, and report back. 2  Use the following sources to get this information – the internet, your municipality’s website, or by asking your local municipality."}, {"url": "http://www.lepelle-nkumpi.gov.za/docs/Ward%20Committee%20Membership%20Profile%20WEBSITE%20Content.pdf", "passage_text": "1 WARD COMMITTEES RESPONSIBILITIES Ward committees are an advisory body chaired by a ward councillor and comprising community representatives from every walk of life. Ward committees act as a link between the municipality and communities in facilitating consensus on ways to improve service delivery."}, {"url": "https://www.westerncape.gov.za/Text/2006/2/ward_committee_resource_book.pdf", "passage_text": "Chapter 4 43 Roles and Responsibilities of Ward Committees What is the link between ward committees and CDWs? In the 2004/05 National Ward Committee Survey, only 32% of respondents said there was a link between community development workers and ward committees."}]