[{"url": "http://tribune.com.pk/story/327000/the-meaning-of-shalimar/", "passage_text": "“The name of Lahore’s main garden, Shalimar or Shalamar, remains a mystery. It is usually translated as ‘abode of light’ or ‘moonlight’, without any grammatical or lexical explanations. Several Mughal gardens bear the name Shalimar: like the one built by Jahangir for Empress Nur Jahan, near Srinagar in Kashmir. At times they call it Shalamar, perhaps leaning on the Hindi connection of shala meaning ‘home’. No one can guess what ‘ mar ’ then means. But the name is synonymous today with a garden of great beauty. Mughal Emperor Shah Jahan built the Shalimar Gardens in 1641."}, {"url": "http://www.babynamespedia.com/meaning/Shalimar", "passage_text": "[ syll. (s)ha-li-mar, sh-alim-ar ] The baby girl name Shalimar is pronounced-SHaaL IY MaaR †. Shalimar's origin is Sanskrit. The meaning of Shalimar is 'a Guerlain perfume; a famous garden in Pakistan'. Variant forms of Shalimar include the names Shalimara, Shalimare, Shalimarr, Shalimarra, and Shalimarre. Shalimar is not commonly used as a baby girl name. It is not in the top 1000 names"}, {"url": "http://www.whatisthemeaningofname.com/what-is-the-meaning-of-the-name-shalimar-3239/", "passage_text": "Here is the characteristics of Shalimar in details. advertisements. Meaning of the name Shalimar, analysis of the name Shalimar and so much more… What does Shalimar mean and its numerology, definition, origin, popularity and very interesting information. Please use the menu below. Quick Menu. 1  Information About The Name Shalimar. 2  The Meaning Of The Name Shalimar. "}, {"url": "https://answers.yahoo.com/question/index?qid=20070324223140AAcVK1p", "passage_text": "Rating Newest Oldest. Best Answer: Shalimar has a number of meanings and references. It is a kind of diamond It is a town in Florida It is a type of garden(Shalimar Gardens) It is the name of a Hindi film. It is the name of a book. The name itself is Kashmiri, originally it was just the word for a place."}, {"url": "http://www.thinkbabynames.com/meaning/0/Shalimar", "passage_text": "Shalimar /shal-i-mar/ [3 sylls.] as a girls' name. Name of a Guerlain perfume which was named for the famous Shalimar Gardens near what is now Lahore, Pakistan. The gardens span 80 acres and were built by Shah Jahan, who also had the Taj Mahal built. Kreatif forms: Salimar, Sealimar, Siolimar. "}, {"url": "http://www.answers.com/Q/What_is_the_meaning_of_shalimar", "passage_text": "Shalimar is the name of a palace, the Shalimar Gardens, located in Lahore, Pakistan. The district of Lahore near these gardens is called Shalimar Town. "}, {"url": "http://www.babynamewizard.com/baby-name/girl/shalimar", "passage_text": "Name of a Guerlain perfume which was named for the famous Shalimar Gardens near what is now Lahore, Pakistan. The gardens span 80 acres and were built by Shah Jahan, who also had the Taj Mahal built. Means Abode of Love in Sanskrit. "}, {"url": "http://www.ourbabynamer.com/meaning-of-Shalimar.html", "passage_text": "Shalimar is generally used as a girl's name. It consists of 8 letters and 3 syllables and is pronounced Sha-li-mar. In the U.S. in 2014, it ranked 18659 in baby name popularity for girls with 5 occurrences. Less than 5 boys were given the name. Then just follow the diagram below. Just for fun, see the name Shalimar in Hieroglyphics, learn about ancient Egyptian Hieroglyphics and write a Hieroglyphic message. Learn about nautical flags and see your name or message written in nautical flags, on the Shalimar in Nautical Flags page."}]