[{"url": "http://www.nytimes.com/1993/03/08/theater/review-theater-correspondence-as-conversation.html", "passage_text": "At the Westside Theater, 407 West 43d Street, Clinton. Sir Sydney Cockerell. . . Michael Allinson George Bernard Shaw. . . Roy Dotrice Dame Laurentia McLachlan. . . Diana Douglas. Photo: Roy Dotrice, left, Michael Allinson and Diana Douglas in Hugh Whitemore's play The Best of Friends, at the Westside Theater."}, {"url": "http://www.goodreads.com/author/quotes/5217.George_Bernard_Shaw", "passage_text": "The people who get on in this world are the people who get up and look for the circumstances they want, and if they can't find them, make them.”. ― George Bernard Shaw, Mrs. Warren's Profession. Like. “The liar's punishment is, not in the least that he is not believed, but that he cannot believe anyone else.”."}, {"url": "http://www.nytimes.com/1993/03/08/theater/review-theater-correspondence-as-conversation.html", "passage_text": "The postman is busy in The Best of Friends, an epistolary play that Hugh Whitemore pieced together from the lengthy correspondence that passed between George Bernard Shaw, Sir Sydney Cockerell and Dame Laurentia McLachlan, a Benedictine nun."}, {"url": "http://www.abebooks.com/book-search/title/george-bernard-shaw-autograph-letter-signed/author/george-bernard-shaw/", "passage_text": "Autograph letter signed. Detailed report on his automobile, and filing an insurance claim for an accident, Shropshire, 4 January 1909. A superb five-page Shaw letter on two sheets to O'Gorman, signed-G. Bernard Shaw-tipped to quarto-sized pages, bound with a typed transcript in marbled boards, with a blue morocco spine. This item came from the collection of Harold Ackert. Keywords: Literature-Rare Items-Shaw-Letters. . . . Signed Copy."}, {"url": "http://www.montblanc.com/en-us/discover/limited-editions/writers-editions/george-bernard-shaw.html", "passage_text": "All Details. Dark green marbled lacquer punctuated with platinum-plated fittings. These are the style features of the new Writers Edition in honour of the distinguished Irish free thinker George Bernard Shaw. This pen is inspired by Shaw’s best-known character from his play “Pygmalion”: Eliza Doolittle."}]