[{"url": "https://answers.yahoo.com/question/index?qid=20090811232510AAVTvbH", "passage_text": "Checks are stale after 6 months. The bank may or may not accept the check if it is over 6 months if it is a government check. These are almost always good (money is available to pay the check). Other checks are questionable as to the funds availability. If the chech has a expiration date, you'll have to get the issuer to reissued the check to you. State of Michigan, check is dated 5-4-2009. Has it expired already?? How long do you have to cash/deposit a State Income Tax Check before it expires?? Thanks!!!"}, {"url": "http://www.fivecentnickel.com/2012/04/23/how-long-are-undeposited-checks-good/", "passage_text": "Tweet. “Check are good for 180 days (unless otherwise noted), so if the check came from your personal checkbook, it would be void by now.”. “Yes, that’s correct.”. Just over a year ago, my wife wrote a small check for an end-of-the-year school function of some sort. “Check are good for 180 days (unless otherwise noted), so if the check came from your personal checkbook, it would be void by now.”. That’s about what I figured, but I wanted to be sure, so I asked if he was 100% sure that Bank of America would refuse payment of the check if it ever resurfaced and got deposited."}, {"url": "http://budgeting.thenest.com/long-check-good-for-25084.html", "passage_text": "Discovering an unredeemed check might seem like found money until you consider its expiration date. While some U.S. checks state how long you have to cash them on the check itself, others typically expire in a set number of days after being written. The issuing bank can refuse to pay for the check if the account holder placed a stop payment on the check, the account does not have the funds to pay for the check or the account is closed."}, {"url": "http://www.fivecentnickel.com/2012/04/23/how-long-are-undeposited-checks-good/", "passage_text": "5. If you send a payment via billpay with Bank of America, the check will expire after 90 days. The money is taken out of your account as soon as you issue payment, but if it isn’t cashed then the funds will be returned to you after 90 days. (This happened to me recently, when I sent a check to a friend and she tried to cash it four months later.). “Check are good for 180 days (unless otherwise noted), so if the check came from your personal checkbook, it would be void by now.”. That’s about what I figured, but I wanted to be sure, so I asked if he was 100% sure that Bank of America would refuse payment of the check if it ever resurfaced and got deposited."}, {"url": "http://budgeting.thenest.com/long-check-good-for-25084.html", "passage_text": "Checks from the U.S. Treasury are valid for one year after issuance. The U.S Treasury issues checks from the Internal Revenue Service, Social Security Administration and any other federal agency. Payees must contact the paying agency to request a reissued check. The issuing bank can refuse to pay for the check if the account holder placed a stop payment on the check, the account does not have the funds to pay for the check or the account is closed."}, {"url": "https://uk.answers.yahoo.com/question/index?qid=20061006003013AAHNLWX", "passage_text": "Cheques go out of date after 6 months, but the bank should still honour it up to 6 years as there is still a legal liability on the debt. If it's a dividend cheque then it's 12 months and a 9 year liability. justaguy · 9 years ago. Usually 6 months, but it can be longer for certain cheques. I recently received a dividend cheque which stated in the small print along the side that it was valid for 12 months. I'd get it to the bank within the next couple of weeks if I were you."}, {"url": "http://budgeting.thenest.com/long-check-good-for-25084.html", "passage_text": "The financial institution redeeming a check determines the expiration date of a personal check. The Uniform Commercial Code permits the accepting institution to decide whether it will redeem checks dated more than six months before the date you take the check to the institution. The issuing bank can refuse to pay for the check if the account holder placed a stop payment on the check, the account does not have the funds to pay for the check or the account is closed."}, {"url": "https://answers.yahoo.com/question/index?qid=20070904173733AAPA0Hr", "passage_text": "Report Abuse. A check is considered stale-dated after 6 months from the date on the check. A teller should catch that before they try to cash it because stale-dated checked almost always get returned because of the date. Many business checks say on the front of the check if they are void after 60 or 90 days and many rebate checks don't even have a date they just say void if cashed after XXX, 200X. Kristin · 8 years ago. Thumbs up. 1."}, {"url": "http://budgeting.thenest.com/long-check-good-for-25084.html", "passage_text": "According to Bankrate.com, an oral stop-payment order expires after 14 days and a written stop-payment order expires in six months. You must renew stop-payment orders every six months to ensure that you are not held liable for old checks; banks typically charge a fee for each order. The issuing bank can refuse to pay for the check if the account holder placed a stop payment on the check, the account does not have the funds to pay for the check or the account is closed."}]