[{"url": "https://en.wikipedia.org/wiki/Locus_(genetics)", "passage_text": "A range of loci is specified in a similar way. For example, the locus of gene OCA1 may be written 11q1.4-q2.1, meaning it is on the long arm of chromosome 11, somewhere in the range from sub-band 4 of region 1 to sub-band 1 of region 2."}, {"url": "http://medical-dictionary.thefreedictionary.com/genetic+locus", "passage_text": "The standard designation of a gene locus consists of (1) chromosome number; (2) p for short arm, q for long arm; (3) region and band numbers, written together as a 2-digit numeral; (4) a period; (5) subband and sub-subband numbers, written together as a 2-digit numeral. genetic locus. Each chromosome consists of a short arm and a long arm, which are joined at the centromere. The paired autosomes of the human genome are numbered in the order of decreasing length, 1 being the longest and 22 the shortest. Genes are arrayed in linear sequence along both arms of each chromosome."}, {"url": "https://answers.yahoo.com/question/index?qid=20061202005617AAoy3RV", "passage_text": "Best Answer: In biology and evolutionary computation, a locus is a fixed position on a chromosome, such as the position of a gene. A viable DNA coding at a given locus within a gene is called an allele. The ordered list of loci known for a particular genome is called a genetic map. Diploid and polyploid cells whose chromosomes have the same allele at some locus are called homozygous, while those that have different alleles at a locus, heterozygous. Nomenclature The chromosomal locus of a gene might be written 6p21.3."}, {"url": "http://www.definitions.net/definition/genetic%20loci", "passage_text": "Genetic Loci. Specific regions that are mapped within a GENOME. Genetic loci are usually identified with a shorthand notation that indicates the chromosome number and the position of a specific band along the P or Q arm of the chromosome where they are found. For example the locus 6p21 is found within band 21 of the P-arm of CHROMOSOME 6. Many well known genetic loci are also known by common names that are associated with a genetic function or HEREDITARY DISEASE."}, {"url": "https://answers.yahoo.com/question/index?qid=20061202005617AAoy3RV", "passage_text": "A range of locations is specified in a similar way. For example, the locus of gene OCA1 may be written 11q14-q21, meaning it is on the long arm of chromosome 11, somewhere in the range of sub-band 4 of band 1, and sub-band 1 of band 2. The ends of a chromosome are labeled ptel and qtel, and so 2qtel refers to the telomere of the long arm of chromosome 2. Diploid and polyploid cells whose chromosomes have the same allele at some locus are called homozygous, while those that have different alleles at a locus, heterozygous. Nomenclature The chromosomal locus of a gene might be written 6p21.3."}, {"url": "http://www.biology-online.org/dictionary/Genetic_locus", "passage_text": "Supplement. For example, the locus of the gene OCA1 (or Oculocutaneous Albinism Type 1, the gene associated with albinism) is on 11q1.4-a2.1, which means it is on the long arm of chromosome 11, between sub-band 4 of band 1 to sub-band 1 of band 2. Word origin: locus » Latin stlocus, a place. Also called: gene locus. "}, {"url": "https://en.wikipedia.org/wiki/Locus_(genetics)", "passage_text": "Example of bands. A locus (plural loci) is the specific location or position of a gene, DNA sequence, on a chromosome, in the field of genetics. Each chromosome carries many genes; humans' estimated ' haploid ' protein coding genes are 20,000-25,000, on the 23 different chromosomes. For example, the locus of gene OCA1 may be written 11q1.4-q2.1, meaning it is on the long arm of chromosome 11, somewhere in the range from sub-band 4 of region 1 to sub-band 1 of region 2."}, {"url": "https://en.wikipedia.org/wiki/Quantitative_trait_locus", "passage_text": "A quantitative trait locus (QTL) is a section of DNA (the locus) that correlates with variation in a phenotype (the quantitative trait). The QTL typically is linked to, or contains, the genes that control that phenotype. "}]