[{"url": "https://www.nlm.nih.gov/medlineplus/ency/article/000490.htm", "passage_text": "Nephrotic syndrome is caused by different disorders that damage the kidneys. This damage leads to the release of too much protein in the urine. The most common cause in children is minimal change disease. Membranous glomerulonephritis is the most common cause in adults."}, {"url": "http://www.humanillnesses.com/original/Men-Os/Nephrosis.html", "passage_text": "The filtering units in the kidney are called glomeruli (glom-ER-you-li). Nephrosis is a kidney disease caused by a defect in the glomeruli. If nephrosis leads to kidney failure, dialysis may be necessary. Here a person on a cruise receives dialysis with the assistance of the ship nurse."}, {"url": "http://www.wisegeekhealth.com/what-is-nephrosis.htm", "passage_text": "Nephrosis is a medical term for kidney disease. Sometimes called nephrotic syndrome or nephropathy, nephrosis has numerous possible causes. Nephrosis is typically diagnosed by the results of a urine test, and though treatment varies with the cause, it often requires life long treatment with the hope of preventing permanent kidney failure."}, {"url": "https://www.kidney.org/atoz/content/nephrotic", "passage_text": "Nephrotic syndrome is not a specific kidney disease. It can occur in any kidney disease that damages the filtering units in a certain way that allows them to leak protein into the urine. Some of the diseases that cause nephrotic syndrome, such as nephritis, affect only the kidney."}, {"url": "http://www.medicinenet.com/script/main/art.asp?articlekey=4534", "passage_text": "Nephrosis: Any degenerative disease of the kidney tubules, the tiny canals that make up much of the substance of the kidney. Nephrosis can be caused by kidney disease, or it may be a complication of another disorder, particularly diabetes. Diagnosis is made via urine testing for the presence of protein, blood testing for lower-than-normal levels of protein, and observation of edema. Treatment usually involves use of cortisone-like drugs."}, {"url": "http://www.humanillnesses.com/original/Men-Os/Nephrosis.html", "passage_text": "Nephrosis. Nephrosis (nef-RO-sis), or nephrotic syndrome, is a kidney disease that causes the body to lose protein through the urine. Loss of protein results in edema, loss of appetite, and general tiredness. Nephrosis cannot usually be cured, but it can be treated with medication and diet."}]