[{"url": "http://www.aafp.org/afp/1998/0115/p279.html", "passage_text": "Short-acting insulin analogs are designed to overcome the limitations of regular short-acting insulins. Compared with regular human insulin, the analog insulin lispro offers faster subcutaneous absorption, an earlier and greater insulin peak and a more rapid post-peak decrease. "}, {"url": "http://www.rxlist.com/humalog-drug.htm", "passage_text": "Hypoglycemia, or low blood sugar, is the most common side effect of insulin lispro. Symptoms of low blood sugar may include headache, nausea, hunger, confusion, drowsiness, weakness, dizziness, blurred vision, fast heartbeat, sweating, tremor, trouble concentrating, confusion, or seizure (convulsions). Watch for... HUMALOG is a sterile, aqueous, clear, and colorless solution. Each milliliter of HUMALOG U-100 contains insulin lispro 100 units, 16 mg glycerin, 1.88 mg dibasic sodium phosphate, 3.15 mg Metacresol, zinc oxide content adjusted to provide 0.0197 mg zinc ion, trace amounts of phenol, and Water for Injection."}, {"url": "http://www.rxlist.com/humalog-drug.htm", "passage_text": "DRUG DESCRIPTION. HUMALOG® (insulin lispro injection) is a rapid-acting human insulin analog used to lower blood glucose. Insulin lispro is produced by recombinant DNA technology utilizing a non-pathogenic laboratory strain of Escherichia coli. HUMALOG is a sterile, aqueous, clear, and colorless solution. Each milliliter of HUMALOG U-100 contains insulin lispro 100 units, 16 mg glycerin, 1.88 mg dibasic sodium phosphate, 3.15 mg Metacresol, zinc oxide content adjusted to provide 0.0197 mg zinc ion, trace amounts of phenol, and Water for Injection."}, {"url": "http://medical-dictionary.thefreedictionary.com/analog+insulin", "passage_text": "analogue insulin. A term of art for a synthesised insulin in which insulin’s amino acid sequence is altered by genetic engineering to alter absorption, delivery (e.g., to reduce clumping) or provide another desired characteristic. Examples. Humulin (rapid absorption), Glargine (constant release over 24 hours)."}, {"url": "https://en.wikipedia.org/wiki/Insulin_analog", "passage_text": "The first insulin analog approved for human therapy (insulin Lispro rDNA) was manufactured by Eli Lilly and Company. The basal level of insulin may be maintained for up to 20 hours, but the time is affected by the size of the injected dose. This insulin has a high affinity for serum albumin, increasing its duration of action."}, {"url": "http://www.diabetesselfmanagement.com/diabetes-resources/definitions/insulin-analog/", "passage_text": "One rapid-acting insulin analog is insulin lispro, which is marketed by Eli Lilly and Company as Humalog and became commercially available in 1996. The structure of the insulin lispro molecule is identical to that of human insulin except that the amino acids at two positions on the B chain, B28 and B29, are reversed. Print Text Size: A A A. A man-made substance resembling insulin in which the molecular structure has been altered for a more desirable effect. Insulin is a hormone, or chemical messenger that is released into the bloodstream to be transported throughout the body."}, {"url": "https://www.novolog.com/type-2-diabetes/general-type-2/diabetes-and-mealtime-insulin/what-is-insulin.html", "passage_text": "1 From the 1920s to the 1980s, insulin from animals is used for treatment. 2  In the 1980s, the first generation of man-made insulin, called human insulin, is created. 3  This man-made insulin was genetically identical to the body’s naturally produced insulin. 4  By the late 1990s, man-made insulin analogs were being developed. Insulin helps move sugar from the blood into the body’s cells, where it can be used for energy. The pancreas releases insulin all the time. The pancreas is an organ that sits near the stomach. Special cells in the pancreas, called beta cells, make insulin."}, {"url": "http://medical-dictionary.thefreedictionary.com/analog+insulin", "passage_text": "(redirected from analog insulin). A term of art for a synthesised insulin in which insulin’s amino acid sequence is altered by genetic engineering to alter absorption, delivery (e.g., to reduce clumping) or provide another desired characteristic. Examples. Humulin (rapid absorption), Glargine (constant release over 24 hours)."}, {"url": "https://en.wikipedia.org/wiki/Insulin_analog", "passage_text": "Insulin degludec (INN/USAN) is an ultralong-acting basal insulin analogue that was developed by Novo Nordisk under the brand name Tresiba.[1] It is administered via subcutaneous injection once daily to help control the blood sugar level of those with diabetes. The basal level of insulin may be maintained for up to 20 hours, but the time is affected by the size of the injected dose. This insulin has a high affinity for serum albumin, increasing its duration of action."}, {"url": "http://www.diabetes.co.uk/insulin/analogue-insulin.html", "passage_text": "Analogue insulin refers to laboratory grown and genetically altered insulin. Analogue insulin is a sub-group of human insulin. Analogue insulin is laboratory grown but genetically altered to create either a more rapid acting or more uniformly acting form of the insulin. This can have advantages for blood sugar management. Analogue insulins have been available since just before the start of the new millennium. Examples of analogue insulin: 1  Rapid acting: Humalog, NovoRapid. 2  Long acting: Lantus, Levemir, Tresiba. 3  Premixed analogue insulins: Humalog Mix 25, Humalog Mix 50, NovoMix 30."}]