[{"url": "https://en.wikipedia.org/wiki/Afghan_Hound", "passage_text": "From Wikipedia, the free encyclopedia. The Afghan Hound is a hound that is distinguished by its thick, fine, silky coat and its tail with a ring curl at the end, the breed acquired its unique features in the cold mountains of Afghanistan. The first Afghans in Australia were imported from the United States in 1934, also of the Ghazni strain. The French breed club was formed in 1939 (FALAPA). The mountain and steppe strains became mixed into the modern Afghan Hound breed, and a new standard was written in 1948, which is still used today."}, {"url": "https://uk.pedigree.com/getting-a-dog/breed-selector/afghan-hound", "passage_text": "In the country from which the breed derives its name, the Afghan hound is regarded, though unofficially, as the ‘national’ dog. Native Afghans also uphold the belief that the Afghan is the dog portrayed on the cave walls in the northern province of Balkh, which is why the Afghan has also been called the Balkh Hound. The Afghan hound is a sight hound, rather than a hunter by scent. It has exceptional vision and great speed, both of which were used in the hunt for prey. Its thick, luxurious coat protected it against the extreme cold of the upper snow regions, while also shielding it from the merciless sun as it roamed the desert"}, {"url": "http://www.ukcdogs.com/Web.nsf/Breeds/SighthoundPariah/AfghanHound05012008", "passage_text": "The characteristics that distinguish the Afghan Hound from all other dogs are the long, silky topknot; the sloping croup and low tail set; the prominent pelvic bones; the sparsely coated tail with the ring or upward curve at the end; the unique coat pattern; and the “oriental” expression-inscrutable, piercing, and wise. The Afghan Hound is a medium-sized sighthound whose appearance gives the impression of strength and activity, combining speed with power and agility-in short, an efficient hunting dog, albeit a glamorous one. The Afghan Hound is a unique blend of substance, elegance, and function."}, {"url": "http://afghanhoundclubofamerica.org/index.php/information/grooming", "passage_text": "The Afghan Hound has a coat that requires regular bathing and brushing if his coat is to remain beautiful. Below are tips on grooming your Afghan Hound. Not all Afghan Hounds are show dogs, but a clean healthy coat will certainly enhance your enjoyment and delight in owning this beautiful breed of dog. Hair is the hallmark of the Afghan Hound. Properly cared for it lends excitement and glamour to the Afghan Hound's every move and step. These protective tube-like coverings worn over the Afghan Hound's head, are called snoods.. The snood keeps the long ear fringe out of the dog's mouth when he is eating. Showing of short hair on cuffs on either front or back legs is permissible. and emphasizes the Afghan Hound's large feet.."}, {"url": "https://answers.yahoo.com/question/index?qid=20080505120851AAsEmCN", "passage_text": "The dog with extensive short coated regions is called a 'patterned' Afghan hound. Others may be so full coated that the saddle scarcely appears. Texture of the long hair has a major influence on how easy it is to maintain the dog. However, no matter are silky the coat on the Afghan the is a breed that needs frequent grooming (at least a simple brushing every 2nd or 3rd day) They should not be owned by someone who lacks the time for the regular brushing that the hounds need.."}, {"url": "https://answers.yahoo.com/question/index?qid=20080505120851AAsEmCN", "passage_text": "A fully coated Afghan Hound with a curley or wooley coat is capable of matting very quickly and is best maintained as a clipped down pet. The coats that are easy to maintain are silky in texture and somewhat resistant to matting. However, no matter are silky the coat on the Afghan the is a breed that needs frequent grooming (at least a simple brushing every 2nd or 3rd day) They should not be owned by someone who lacks the time for the regular brushing that the hounds need.."}, {"url": "http://www.xzotika.net/index/grooming.htm", "passage_text": "Grooming Your Afghan Hound. Initially when you think of grooming your afghan it may be a little intimidating at first but believe me with a few simple techniques keeping your hound in a beautiful show coat is very easy. Lucky for you if you are reading this you probably secured your afghan from me and my hounds have very silky coats. White on White Shampoo – this is a good shampoo for your light colored afghan hounds. It also helps remove stains from grass, urine and dirt. Put it in the coat straight out of the bottle and let sit for 15 minutes. This shampoo will add a nice sparkle to your light coated dogs."}, {"url": "http://www.akc.org/dog-breeds/afghan-hound/", "passage_text": "The Afghan Hound should be shown in its natural state; the coat is not clipped or trimmed; the head is surmounted (in the full sense of the word) with a topknot of long, silky hair-that is also an outstanding characteristic of the Afghan Hound. Shoulders have plenty of angulation so that the legs are well set underneath the dog. Too much straightness of shoulder causes the dog to break down in the pasterns, and this is a serious fault. All four feet of the Afghan Hound are in line with the body, turning either in nor out."}, {"url": "http://afghanhoundclubofamerica.org/index.php/information/grooming", "passage_text": "If applying shampoo by hand, it should be worked through the coat with the growth of the hair and never rubbed or scrubbed in. Rinse well until the water runs clean and apply a cream rinse. Some Afghan Hound owners rinse the cream rinse from the dog's coat, other owners leave the cream rinse in the coat. These protective tube-like coverings worn over the Afghan Hound's head, are called snoods.. The snood keeps the long ear fringe out of the dog's mouth when he is eating. Showing of short hair on cuffs on either front or back legs is permissible. and emphasizes the Afghan Hound's large feet.."}]