[{"url": "http://www.answers.com/Q/Is_grass_a_vascular_plant", "passage_text": "A vascular plant is vascular because it has tubes and roots that br … ing water and nutrients to where they shoulod go. A nonvascular plant is nonvascular because it does not have roots or tubes to bring water and nutrients, which is why nonvascular plants are a lot shorter than vascular plants. Phloem tissue carries sugar from the leaves to other cells of the plants. Non vascular plants are plants that lack tissues that transport water, nutrients, and sugar. Some example of non vascular plants are mosses, liverworts, and hornworts."}, {"url": "https://en.wikipedia.org/wiki/Vascular_plant", "passage_text": "1 Vascular plants have vascular tissues which distribute resources through the plant. 2  This feature allows vascular plants to evolve to a larger size than non-vascular plants, which lack these specialized conducting tissues and are therefore restricted to relatively small sizes. 1 In vascular plants, the principal generation phase is the sporophyte, which is usually diploid with two sets of chromosomes per cell. 2  Only the germ cells and gametophytes are haploid."}, {"url": "http://www.answers.com/Q/Is_grass_vascular_or_nonvascular", "passage_text": "exists and is an alternate of. Merge this question into. Split and merge into it. Answer by Tinytot28. Confidence votes 56. grass is vascular. it has specialized vascular tissues that transport water (xylem) and nutrients and minerals (phloem). this is a vascular plant because it can reproduce plants! Edit. Share to: 1  5 Interesting Sea Anemone Facts Most people will agree that sea anemones are some of the most beautiful invertebrates in the oceans, but few really know much about them."}, {"url": "http://www.gardenguides.com/125560-difference-between-vascular-plants-nonvascular-plants.html", "passage_text": "Description. Most plants have a vascular design. Vascular plants are those which have tubes called xylem or phloem inside of them for the transport of liquid. Plants which have roots, stems and leaves are vascular. Nonvascular plants do not have tubes inside and must move water through them in a different manner. Examples of vascular plants would be trees, vegetable plants, grass and anything with flowers. Nonvascular plants include mosses, liverworts and hornworts. Very few kinds of vascular plants are seedless. Instead they produce spores for the purpose of regeneration. Nonvascular plants do not produce fruit or generate seeds. They also produce spores for reproduction, which is a complicated process."}, {"url": "http://www.answers.com/Q/Is_grass_a_vascular_plant", "passage_text": "Grass is a vascular plant because it has vascular tissue that carries food, water, and nutrients, it has a true root system, and it's made of long, tube-like cells. Phloem tissue carries sugar from the leaves to other cells of the plants. Non vascular plants are plants that lack tissues that transport water, nutrients, and sugar. Some example of non vascular plants are mosses, liverworts, and hornworts."}, {"url": "http://www.answers.com/Q/Is_grass_a_vascular_plant", "passage_text": "Xylem tissue carries water and nutrients from the roots to the leaves. Phloem tissue carries sugar from the leaves to other cells of the plants. Non vascular plants are plants that lack tissues that transport water, nutrients, and sugar. Some example of non vascular plants are mosses, liverworts, and hornworts."}, {"url": "https://en.wikipedia.org/wiki/Vascular_plant", "passage_text": "Vascular plants (from Latin vasculum: duct), also known as tracheophytes (from the equivalent Greek term trachea) and also higher plants, form a large group of plants that are defined as those land plants that have lignified tissues (the xylem) for conducting water and minerals throughout the plant. 1 In vascular plants, the principal generation phase is the sporophyte, which is usually diploid with two sets of chromosomes per cell. 2  Only the germ cells and gametophytes are haploid."}, {"url": "http://www.answers.com/Q/Is_grass_a_vascular_plant", "passage_text": "Some simpler plants, like m … oss and ferns, are nonvascular. In plants, a vascular system is analogous to the heart, veins and arteries of an animal (which is why it's called a cardiovascular system). It is a system of tubes that transports water and nutrients throughout the plant. Phloem tissue carries sugar from the leaves to other cells of the plants. Non vascular plants are plants that lack tissues that transport water, nutrients, and sugar. Some example of non vascular plants are mosses, liverworts, and hornworts."}, {"url": "https://en.wikipedia.org/wiki/Non-vascular_plant", "passage_text": "Non-vascular plants are plants without a vascular system (xylem and phloem). Although non-vascular plants lack these particular tissues, many possess simpler tissues that are specialized for internal transport of water. Non-vascular plants do not have a wide variety of specialized tissue types."}, {"url": "http://www.answers.com/Q/Is_grass_vascular_or_nonvascular", "passage_text": "Grass is a vascular plant because it has vascular tissue that carries food, water, and nutrients, it has a true root system, and it's made of long, tube-like cells. I hope thi … s helped a lot :). this is a vascular plant because it can reproduce plants! Edit. Share to: 1  5 Interesting Sea Anemone Facts Most people will agree that sea anemones are some of the most beautiful invertebrates in the oceans, but few really know much about them."}]