[{"url": "https://en.wikipedia.org/wiki/Road_safety_audit", "passage_text": "A Road Safety Audit (RSA) is defined as the formal safety performance examination of an existing or future road or intersection by an independent, multidisciplinary team. It qualitatively estimates and reports on potential road safety issues and identifies opportunities for improvements in safety for all road users.. The road safety audit may investigate general safety conditions, or it may focus on specific concerns or users. Walkability audits concentrate on pedestrian safety and accommodation, and transit audits focus on safety of bus and train users."}, {"url": "http://www.answers.com/Q/Define_a_health_and_safety_audit", "passage_text": "Answer by Johnywalter. Confidence votes 1.4K. An audit is a review to confirm that regulations, processes or rules are being followed. A health and safety audit is an audit that focuses on some or all aspects of health and safety. Health and safety is one of the most important factor to consider in all kind of workplace. OSHA is one of the organization that makes sure that all companies are prioritizing … the health and safety of their workers and that there are no hazards that can cause injuries and accidents in the working environment."}, {"url": "http://www.safetyconsultantsaustralia.com.au/safety-management/workplace-safety-audit", "passage_text": "A WHS audit or Safety Gap Analysis is a proactive approach to ensure your safety management system is effective and complying with WHS regulations. It also emphasises to colleagues that they work in an environment which wants to promote safety as one of its core values. "}, {"url": "http://strategichrinc.com/what-is-a-safety-audit/", "passage_text": "Safety audits (known more formally as health and safety audits) provide an in-depth review of workplace safety programs and are conducted for the purpose of health, safety, and fire hazard identification. There is no “one size fits all” approach to health and safety audits. Audits must be customized to the type of industry, size of the company or location being audited, applicable local, state and federal laws and any other company specific factors that might affect the safety and health of your workforce."}, {"url": "http://strategichrinc.com/what-is-a-safety-audit/", "passage_text": "Have you had a safety audit recently? Do you know which OSHA forms you are required to complete? A safe environment plays a key role in keeping a company Healthy, Safe and Secure. Strategic HR, inc. has the expertise you need to ensure your policies and practices are keeping your workers, customers and visitors safe. There is no “one size fits all” approach to health and safety audits. Audits must be customized to the type of industry, size of the company or location being audited, applicable local, state and federal laws and any other company specific factors that might affect the safety and health of your workforce."}, {"url": "http://www.reliableplant.com/Read/25839/Benefits-of-safety-audits", "passage_text": "An audit is a tool that you can use to assess compliance in the workplace. An audit involves a survey to: 1  Identify what regulations apply to a company or facility. 2  Determine whether environmental and workplace safety requirements, and corporate policies and procedures regarding compliance, are being followed. 3  Assess management systems currently in place to ensure compliance. 1 Determine whether environmental and workplace safety requirements, and corporate policies and procedures regarding compliance, are being followed. 2  Assess management systems currently in place to ensure compliance. 3  An audit may also look at and evaluate the methods used to achiev"}, {"url": "http://safety.fhwa.dot.gov/rsa/", "passage_text": "A Road Safety Audit (RSA) is the formal safety performance examination of an existing or future road or intersection by an independent, multidisciplinary team. The road safety audit process looks at the roadway from a purely technical safety viewpoint without outside influences. It is a valuable process that gives an unbiased view of safety issues with support from safety experts. These recommendations are helpful when working with others, such as political leaders.."}, {"url": "http://www.skybrary.aero/index.php/Safety_Audits", "passage_text": "Safety audits are conducted in order to assess the degree of compliance with the applicable safety regulatory requirements and with the procedural provisions of a Safety Management System if one is in place. Safety auditing is an element of safety management which subjects the activities of airline operators/service providers to a systematic critical evaluation."}, {"url": "http://www.sasa.org.hk/audit.htm", "passage_text": "walk around audit. A  walk around audit is to determine whether the health and safety policies of the company are being properly implemented and to identify areas in which policy effectiveness needs to be improved. H&S management audits. Audit of a Health and Safety Plan. Audit of a Health and Safety Plan is the review of this plan at the end of the year. The audit consists of two parts. The first is intended to provide a simple overview of progress in terms of time."}, {"url": "http://www.sasa.org.hk/audit.htm", "passage_text": "Health and safety audits Objectives of this type of safety auditing are to inform the company: Audit of a Health and Safety Plan Audit of a Health and Safety Plan is the review of this plan at the end of the year. The audit consists of two parts. Audit of a Health and Safety Plan. Audit of a Health and Safety Plan is the review of this plan at the end of the year. The audit consists of two parts. The first is intended to provide a simple overview of progress in terms of time."}]