[{"url": "http://sports.stackexchange.com/questions/1561/in-what-way-do-professional-athletes-mlb-nhl-nfl-nba-get-paid", "passage_text": "Players are paid their season salary in 17 installments during the regular season. All salaries are denominated in USD Players are paid on the 15th and last day of every month starting with September 30th and ending on April 15th. We get paid on the 1st and the 15th. According to this cbafaq.com page, NBA payroll rules can vary by the player's contract, within limits stipulated by the CBA: All salaries are denominated in USD. Players are paid on the 15th and last day of every month starting with September 30th and ending on April 15th. According to this post on baseball-fever.com, MLB players are paid: We get paid on the 1st and the 15th. There is a caveat-these paycheck rules can change periodically due to the CBA rules negotiated by the leagues and their player associations."}, {"url": "http://www.nba.com/dleague/santacruz/dleague_faqs.html", "passage_text": "The minimum age to play in the D-League is 18, unlike the NBA, which requires players to be 19 years old and one year out of high school in order to sign an NBA contract or be eligible for the draft. There is no maximum age and a recent trend has seen NBA veterans attempt to return to the NBA via the D-League. A call-up occurs when a player is signed by an NBA team. An NBA team is allowed to sign any D-League player as long as they are eligible to play in the NBA under the current Collective Bargaining Agreement (CBA)."}, {"url": "https://answers.yahoo.com/question/index?qid=20090429121336AALVTw6", "passage_text": "Rating Newest Oldest. Best Answer: The NBA is a bi-weekly pay schedule system, in which the money is determined by whether or not you are under contract during the previous two weeks. The total numbers of games is not included, unless a player was suspended for a game without pay i.e. breach of contract. A player making 20,000,000 a year makes roughly 192,000 every two weeks. Little known fact, the NBA requires a direct deposit system, where the NFL actually allows cash payments if the player wishes...believe it!"}, {"url": "http://www.nba.com/dleague/santacruz/dleague_faqs.html", "passage_text": "NBA D-League teams acquire players through a draft, NBA player assignments, NBA training camp allocations, tryouts and a returning player pool. What separates players in the NBA D-League from other minor league systems is that players do not sign contracts with specific NBA D-League teams. Instead, all players sign a one-year NBA D-League Standard Player Contract with the league itself. A call-up occurs when a player is signed by an NBA team. An NBA team is allowed to sign any D-League player as long as they are eligible to play in the NBA under the current Collective Bargaining Agreement (CBA)."}, {"url": "https://en.wikipedia.org/wiki/Highest-paid_NBA_players_by_season", "passage_text": "The highest-paid NBA players by season over the past twelve seasons have received contracts with salaries noted in the twenty-million-dollar range. In this twelve-year span, Kevin Garnett received $28,000,000, which was the highest salary payment of any NBA player, during the 2003–2004 season. Garnett has been the highest-paid NBA player per year in seven of the past twelve NBA seasons. Michael Jordan was the first NBA player to sign a contract worth over thirty million dollars in a season. During the 1997–1998 season, Jordan earned $33,000,000. Kobe Bryant become just the second player to reach this milestone when the 2013-2014 season began."}, {"url": "http://bleacherreport.com/articles/1158014-richest-25-players-still-balling-in-the-nba", "passage_text": "2011-2012 Salary: $13.55 Million. Of the 25 highest-paid NBA players this season, there is only one who wasn't a first-round pick in the NBA draft. That's Carlos Boozer. Boozer lasted all the way until the second round of the 2002 NBA draft. He went 35th to the Cleveland Cavaliers. LeBron's Decision has made him one of the highest-paid players in the NBA. LeBron James, Miami Heat: 2011-2012 Salary $16.02 Million. Of all the things that critics can lambast LeBron James for, the one thing they can't say is that he chose Miami for the money."}, {"url": "https://answers.yahoo.com/question/index?qid=1006040100861", "passage_text": "The absurdity of the biweekly checks is exacerbated by the fact that NBA players are paid only during the season. So, the $14.7 million is compacted into a six-month period. "}, {"url": "https://answers.yahoo.com/question/index?qid=20090429121336AALVTw6", "passage_text": "Some player do get lump sum payments. I know Kobe Bryant got 24 million at the start of the 2013-14 season, but there aren't many players that gat paid that way. A player making 20,000,000 a year makes roughly 192,000 every two weeks. Little known fact, the NBA requires a direct deposit system, where the NFL actually allows cash payments if the player wishes...believe it!"}, {"url": "http://bleacherreport.com/articles/1158014-richest-25-players-still-balling-in-the-nba", "passage_text": "With an average salary of over $5 million per year, NBA players are among sports' wealthiest athletes. Yet, even within that stratosphere, there is a hierarchy. Alex Rodriguez will make over $29 million to play baseball for the New York Yankees this season. LeBron's Decision has made him one of the highest-paid players in the NBA. LeBron James, Miami Heat: 2011-2012 Salary $16.02 Million. Of all the things that critics can lambast LeBron James for, the one thing they can't say is that he chose Miami for the money."}]