[{"url": "http://www.ehow.com/info_8564193_average-salary-veterinary-radiologist.html", "passage_text": "Experience plays a role in how much a veterinary radiologist and veterinarian earns. According to PayScale as of May 2011, veterinarians with less than one year of experience earn between $39,950 and $77,765. Veterinarians with 10 to 19 years of experience earn between $49,673 and $108,801, while those with more than 20 years of experience earn between $49,217 and $120,987. According to the BLS, the job outlook for veterinary radiologists and veterinarians in general is positive."}, {"url": "http://www.vettechcolleges.com/veterinary-technicians/veterinary-radiology-technician", "passage_text": "X-Ray Veterinary Tech Salary Data. Pay ranges for vet techs can vary and this includes for those working in specialized areas, such as veterinary radiology technicians. SimplyHired notes that the average pay for all vet tech working in the U.S. was $33,000, as of September 2013. However, it lists the average pay for X ray veterinary technicians at $35,000 and those of diagnostic veterinary technicians at $38,000, as of September 2013"}, {"url": "http://www.healthcare-salaries.com/physicians/radiologist-salary", "passage_text": "And how much does a radiologist make in Mexico. In Mexico, Radiologists earn an average salary of about $382,129 per year .These figures however depend on many factors including experience, company, location and size of the facility. Based on percentiles, the median yearly salary for 50th percentile of radiologists has been around $216,577. Similarly, about 25th percentile of radiologists received $180,813, 15th percentile of them received $157,966 while top 10th percentile received $269,526 per year."}, {"url": "http://www.salary2014.com/How-much-does-a-radiologist-make.html", "passage_text": "So, how much does a radiologist make is not the question with a single answer, as salaries vary among various types of fields that are associated within radiology. However, the middle average salary is rather high, though it varies because of different factors. Besides, there is a great difference between pediatric radiologists, radiology nurses and assistants, radiologist technician salary and that of an MD. The starting salary varies from $35,000 to $140,000 per year. If you choose a private sector, the salary can be $100,000. If you have found the place at a local government institute, you will make a little bit less than $90,000 per year. Radiologists with the experience of a little bit more than 5 years can expect the average annual salary to be about $345,000."}, {"url": "http://www.ehow.com/info_8564193_average-salary-veterinary-radiologist.html", "passage_text": "Average Salary. According to the Salary Expert, the average salary for veterinary radiologists as of June 2011 is about $100,000. The CB Salary website indicates a slightly lower number, at $97,404. According to CB Salary, the middle 50 percent earn between $61,076 and $137,692. Veterinarians with 10 to 19 years of experience earn between $49,673 and $108,801, while those with more than 20 years of experience earn between $49,217 and $120,987. According to the BLS, the job outlook for veterinary radiologists and veterinarians in general is positive."}, {"url": "http://www.healthcare-salaries.com/physicians/radiologist-salary", "passage_text": "An average yearly salary for a radiologist with less than 5 years of work experience is about $157,909 while a radiologist with work experience ranging from between 6 to 12 years receives an annual salary of about $422,400(this is an extreme and proBably happening only in Texas). Based on percentiles, the median yearly salary for 50th percentile of radiologists has been around $216,577. Similarly, about 25th percentile of radiologists received $180,813, 15th percentile of them received $157,966 while top 10th percentile received $269,526 per year."}, {"url": "http://work.chron.com/much-radiologists-make-year-entry-level-21976.html", "passage_text": "According to a salary survey conducted by Medscape, radiologists at all levels of experience earned an average salary of $349,000 as of 2012. However, radiologists tend to earn more as they gain experience. The website Profiles.com reports that radiologists earned a median salary of between $330,000 and $335,000 during their first year of practice, and averaged between $444,850 and $469,800 per year after six years of practice."}, {"url": "http://www.healthcare-salaries.com/technicians/radiology-technician-salary", "passage_text": "Radiology technician salary in Australia. An average annual salary for a radiology technician in Australia is about AU$40,000. According to payscale Australia, a radiology technician receives an average yearly salary ranging from between AU$35,317 – AU$90,042 per hour. The highest salary for the 10 percent of the radiology technicians is around more than $76,850 whereas the lowest 10 percent of them received less than $36,510 per year. radiology technician salary."}, {"url": "http://www.healthcare-salaries.com/physicians/radiologist-salary", "passage_text": "The average expected salary for a radiologist based in United Kingdom is about £98,407 per annum. According to all salary survey, the median salary for a radiologist is about £75,000 per annum. An average hourly wage for a radiologist is about £20.7. The radiologist’s salary varies based on his or her age as the one in 20s earns up to £76,056, in 30s earns about £110,579, in 40s and 50s earns about £120,033 per annum. Based on percentiles, the median yearly salary for 50th percentile of radiologists has been around $216,577. Similarly, about 25th percentile of radiologists received $180,813, 15th percentile of them received $157,966 while top 10th percentile received $269,526 per year."}]