[{"url": "http://www.britannica.com/science/astronomical-unit", "passage_text": "Alternative titles: AU; au. To From Subject Comments. Astronomical unit (AU, or au) , a unit of length effectively equal to the average, or mean, distance between Earth and the Sun, defined as 149,597,870.7 km (92,955,807.3 miles)."}, {"url": "http://www.answers.com/Q/What_is_an_astronomical_unit_used_to_measure", "passage_text": "An astronomical unit measures 97 million miles (149,598,000 km). Which is the distance Earth's orbit is around the sun. It may be used to measure the distance to objects that are a significant fraction or greater than the distance from the sun to the Earth."}, {"url": "http://starchild.gsfc.nasa.gov/docs/StarChild/questions/question19.html", "passage_text": "In our solar system, we tend to describe distances in terms of the Astronomical Unit (AU). The AU is defined as the average distance between the Earth and the Sun. It is approximately 150 million km (93 million miles). Mercury can be said to be about 1/3 of an AU from the Sun and Pluto averages about 40 AU from the Sun."}, {"url": "http://www.telescope.org/nuffield_21_sci/astrounits.htm", "passage_text": "AU (astronomical units). One AU is the distance that the average distance that the Earth orbits the Sun at. The AUis most commonly used for the distances of objects with in our solar system. Pluto, the last planet in the solar system is found at an average distance of 39.47 au from the Sun."}, {"url": "http://www.thefreedictionary.com/astronomical+unit", "passage_text": "A unit of length used in measuring astronomical distances within the solar system or other planetary system equal to the mean distance from Earth to the sun, approximately 150 million kilometers (93 million miles)."}, {"url": "http://www.thefreedictionary.com/Astronomical+Units", "passage_text": "A unit of length used in measuring astronomical distances within the solar system or other planetary system equal to the mean distance from Earth to the sun, approximately 150 million kilometers (93 million miles)."}, {"url": "http://www.wisegeek.com/what-is-an-astronomical-unit-au.htm", "passage_text": "An astronomical unit (AU) is a measure of distance often used in astronomy, equal to the distance between the Earth and the Sun. In terms of more common units of measurement, an AU is equal to about 93 million miles (150 million km), or the distance light travels in a little over eight minutes."}]