[{"url": "http://www.answers.com/Q/What_two_colors_make_brown_paint", "passage_text": "Alot of colors make brown when mixed, but probably the easiest is to mix red with green. Varying the amount of each color will give you different shades of brown. Orange and g … reen will be a more tannish brown."}, {"url": "http://www.wikihow.com/Make-Brown-from-Primary-Colors", "passage_text": "Understand secondary colors. The secondary colors are created by mixing two primary colors. The colors that are created when you mix two colors together appear between the primary colors on the color wheel. Therefore, red and blue make purple, yellow and red make orange, and yellow and blue make green."}, {"url": "http://www.ehow.com/facts_5537188_colors-make-brown-paint.html", "passage_text": "Basic Color Theory. There are three primary colors: red, yellow and blue. Mixing any two of these colors results in the secondary colors. (Yellow and blue create green, for example.) Violet and orange are the other two secondary colors. A color wheel is a device that features all of the colors created when these six secondary colors are mixed again to create tertiary colors. A color wheel is a great tool for understanding color relationships."}, {"url": "http://www.wikihow.com/Make-Brown-from-Primary-Colors", "passage_text": "Mix multiple shades of brown together. Mixing all the shades of brown you have created will make other shades of brown. You can use just the browns you created from one separate method (mixing orange and blue, for example). Mix and match the different browns from different methods and see how the colors turn out."}, {"url": "http://www.elizabethreoch.com/mixing-paint-colours-what-colours-make-brown/", "passage_text": "A good Artist needs to know how to mix colours, for instance, how to make brown paint by mixing paint colours together. Find out what colors make brown below. The very first lesson you will receive in art school will be mixing paint colours from the primary colours (Red, Yellow, Blue) to make the colour wheel."}, {"url": "http://www.wikihow.com/Mix-Paint-Colors-to-Make-Brown", "passage_text": "Brown. It's such plain word, but it covers a wide variety of colors—there are light browns, dark browns, warm browns, cool browns, reddish, greenish, and bluish browns. You learned in primary school that red and green make brown, and while that's true, so do blue and orange, and many other color combinations!"}, {"url": "http://www.wikihow.com/Mix-Paint-Colors-to-Make-Brown", "passage_text": "Mix your colors. Using the proportions provided on the Pantone guide, mix your your paints to create an exact shade of brown. Although this Pantone guide is typically used for mixing ink for prints, you can use magenta, cyan, black, and yellow paint to create the perfect hu"}]