[{"url": "http://marinelife.about.com/od/marinecareers/g/Marine-Biologist.htm", "passage_text": "Definition: Marine biology is the scientific study of organisms that live in salt water. So, a marine biologist is a person that studies, or works with a salt water organism (or organisms). That is a fairly brief definition for a very general term, as marine biology encompasses many things."}, {"url": "http://www.wisegeek.com/what-is-a-marine-biologist.htm", "passage_text": "A marine biologist is usually a person with advanced degrees in life sciences. He or she will study life forms of the ocean from a scientific perspective, and may hold specific bachelors, masters, or PhDs in biology, marine biology, and/or chemistry. There are many different areas in which marine biologists may work. "}, {"url": "http://marinebio.org/oceans/marine-biology/index.aspx", "passage_text": "1 Marine mammology: This is the field of interest to most aspiring marine biologists. 2  It is the study of cetaceans—families of whales and dolphins, and pinnipeds (seals, sea lions, and the walrus). 3  Their behaviors, habitats, health, reproduction, and populations are all studied. These steps are all used in the study of marine biology, which includes numerous sub fields including: 1  Microbiology: The study of microorganisms, such as bacteria, viruses, protozoa and algae, is conducted for numerous reasons."}, {"url": "http://www.payscale.com/research/US/Job=Marine_Biologist/Salary", "passage_text": "Read More... A marine biologist researches and explores organisms, both plants and animals, within the marine biology field. This field has to do with animals and plants that live in salty bodies of water. The marine biologist may carry out observations and assessments, in order to determine the health of an environment. "}, {"url": "http://marinelife.about.com/od/marinecareers/g/Marine-Biologist.htm", "passage_text": "Some jobs that a marine biologist would do include: 1  Working with whales, dolphins or pinnipeds in an aquarium or zoo. 2  Working in a rescue/rehabilitation facility. 3  Studying smaller organisms like sponges, nudibranchs or microbes and using them to learn about neuroscience and medicine. So, a marine biologist is a person that studies, or works with a salt water organism (or organisms). That is a fairly brief definition for a very general term, as marine biology encompasses many things."}, {"url": "http://life.bio.sunysb.edu/marinebio/becoming.html", "passage_text": "There are many answers to this question and I would say that a marine biologist is someone who works in some way in studying, observing, protecting, or managing marine organisms, be they microbe, plant or animal. If you study marine fish populations you are a marine biologist. "}, {"url": "http://www.sciencebuddies.org/science-engineering-careers/life-sciences/marine-biologist", "passage_text": "Because marine biology is so broad, most marine biologists usually specialize in one area. A marine biologist could study a specific species, behavior, or the ecosystem that marine organisms live in. 1  Marine biotechnologists study and apply the functions and behaviors of marine species to improve human life. "}, {"url": "https://en.wikipedia.org/wiki/Marine_biology", "passage_text": "Marine biology differs from marine ecology as marine ecology is focused on how organisms interact with each other and the environment, while biology is the study of the organisms themselves. A large proportion of all life on Earth lives in the ocean. The habitats studied in marine biology include everything from the tiny layers of surface water in which organisms and abiotic items may be trapped in surface tension between the ocean and atmosphere, to the depths of the oceanic trenches, sometimes 10,000 meters or more beneath the surface of"}, {"url": "http://www.aboutbioscience.org/careers/marinebiologist", "passage_text": "Molecular biology — the branch of biology that deals with the formation, structure and function of macromolecules essential to life, such as nucleic acids and proteins, and with their role in cell replication and the transmission of genetic information — is a related area of specialization in marine biology. "}, {"url": "http://www.sciencekids.co.nz/sciencefacts/careers/marinebiologist.html", "passage_text": "Marine biologists study things that live in oceans. Marine biology includes everything from small organisms such as plankton right through the very large such as whales. Subjects important to marine biology include biology, physics, chemistry and mathematics. Marine biologists are usually curious and have a love of the outdoors, especially the ocean. "}]