[{"url": "http://www.austincc.edu/biocr/1406/labm/ex3/prelab_3_5.htm", "passage_text": "A buffer is a mixture of molecules that release or bind H + in order to maintain a relatively stable pH. Note that the function of a buffer is NOT to keep a solution neutral (at pH 7); its function is to minimize the change in pH when base or acid is added to the solution. Also note that there are many different buffers, and each one will stabilize the pH of a solution only within a specific pH range."}, {"url": "http://chemistry.about.com/od/acidsbase1/a/buffers.htm", "passage_text": "A buffer is an aqueous solution that has a highly stable pH. If you add acid or base to a buffered solution, its pH will not change significantly. Similarly, adding water to a buffer or allowing water to evaporate will not change the pH of a buffer. When you select an acid for a buffer solution, try to choose an acid that has a pK a close to your desired pH. This will give your buffer nearly equivalent amounts of acid and conjugate base so it will be able to neutralize as much H + and OH-as possible."}, {"url": "http://chemguide.co.uk/physical/acidbaseeqia/buffers.html", "passage_text": "Definition A buffer solution is one which resists changes in pH when small quantities of an acid or an alkali are added to it. Acidic buffer solutions An acidic buffer solution is simply one which has a pH less than 7. Acidic buffer solutions are commonly made from a weak acid and one of its salts-often a sodium salt. A common example would be a mixture of ethanoic acid and sodium ethanoate in solution."}, {"url": "https://en.wikipedia.org/wiki/Buffer_solution", "passage_text": "For an individual weak acid or weak base component, see Buffering agent. For uses not related to acid-base chemistry, see Buffer (disambiguation). A buffer solution (more precisely, pH buffer or hydrogen ion buffer) is an aqueous solution consisting of a mixture of a weak acid and its conjugate base, or vice versa. "}, {"url": "http://chemistry.about.com/od/acidsbase1/a/buffers.htm", "passage_text": "When hydrogen ions are added to a buffer, they will be neutralized by the base in the buffer. Hydroxide ions will be neutralized by the acid. These neutralization reactions will not have much effect on the overall pH of the buffer solution. When you select an acid for a buffer solution, try to choose an acid that has a pK a close to your desired pH. This will give your buffer nearly equivalent amounts of acid and conjugate base so it will be able to neutralize as much H + and OH-as possible."}, {"url": "http://chemistry.about.com/od/acidsbase1/a/buffers.htm", "passage_text": "A buffer is made by mixing a large volume of a weak acid or weak base together with its conjugate. A weak acid and its conjugate base can remain in solution without neutralizing each other. When you select an acid for a buffer solution, try to choose an acid that has a pK a close to your desired pH. This will give your buffer nearly equivalent amounts of acid and conjugate base so it will be able to neutralize as much H + and OH-as possible."}, {"url": "http://www.chemcollective.org/activities/tutorials/buffers/buffers4", "passage_text": "Predicting the pH of a Buffer. The pH of a buffer is determined by two factors; 1) The equilibrium constant Ka of the weak acid and 2) the ratio of weak base [A - ] to weak acid [HA] in solution. 1) Different weak acids have different equilibrium constants (K a). K a tells us what proportion of HA will be dissociated into H + and A-in solution"}, {"url": "http://www.wisegeek.org/what-is-a-buffer-solution.htm", "passage_text": "A buffer agent’s acid form (HA) is mixed with its conjugate base (A -) in water to make the solution. Once a balance exists between HA and A - , any other acids or bases added will be neutralized when they turn a portion of the buffer agent into either the HA or A-form. Buffer agents, which are added to water to make buffer solutions, resist pH changes when exposed to acids or bases. Borax can be used to make a simple buffer solution. Borax, which can be used to make a buffer solution. Antacids, a type of buffer. Buffering agents are used in detergents."}, {"url": "http://www.sparknotes.com/chemistry/acidsbases/buffers/section1.html", "passage_text": "A buffer is simply a mixture of a weak acid and its conjugate base or a weak base and its conjugate acid. Buffers work by reacting with any added acid or base to control the pH. For example, let's consider the action of a buffer composed of the weak base ammonia, NH 3, and its conjugate acid, NH 4 + . When HCl is added to that buffer, the NH 3 soaks up the acid's proton to become NH 4 + . How Buffers Work. As you have seen in calculating the pH of solutions, only a small amount of a strong acid is necessary to drastically alter the pH. For certain experiments, however, it is desirable to keep a fairly constant pH while acids or bases are added to the solution either by reaction or by the experimenter."}, {"url": "http://chemguide.co.uk/physical/acidbaseeqia/buffers.html", "passage_text": "A buffer solution is one which resists changes in pH when small quantities of an acid or an alkali are added to it. Acidic buffer solutions. An acidic buffer solution is simply one which has a pH less than 7. Acidic buffer solutions are commonly made from a weak acid and one of its salts-often a sodium salt. A common example would be a mixture of ethanoic acid and sodium ethanoate in solution."}]