[{"url": "http://marketbusinessnews.com/financial-glossary/international-banking-facility-ibf/", "passage_text": "An international banking facility time deposit (IBF time deposit) is a deposit, placement, borrowing or other obligation represented by a promissory note – not issued in negotiable or bearer form. An IBF time deposit typically has to remain on deposit at the IBF for at least a day. The Federal Reserve System does not impose requirements on the services provided by an IBF and is not insured by the Federal Deposit Insurance Corporation – this makes IBFs not subject to the interest rate ceilings then in effect."}, {"url": "https://en.wikipedia.org/wiki/Bank", "passage_text": "A bank is a financial intermediary that creates credit by lending money to a borrower, thereby creating a corresponding deposit on the bank's balance sheet. Lending activities can be performed either directly or indirectly through capital markets. In the history of banking, a number of banking dynasties — notably, the Medicis, the Fuggers, the Welsers, the Berenbergs and the Rothschilds — have played a central role over many centuries. The oldest existing retail bank is Monte dei Paschi di Siena, while the oldest existing merchant bank is Berenberg Bank."}, {"url": "http://marketbusinessnews.com/financial-glossary/international-banking-facility-ibf/", "passage_text": "An international banking facility (IBF) is an account that a US bank creates to provide its services (deposit and loan services) to non-American residents and institutions. It essentially allows banks to operate a deposit and loan business with foreign residents and foreign banks. The Federal Reserve System does not impose requirements on the services provided by an IBF and is not insured by the Federal Deposit Insurance Corporation – this makes IBFs not subject to the interest rate ceilings then in effect."}, {"url": "https://en.wikipedia.org/wiki/International_Banking_Facility", "passage_text": "An International Banking Facility (IBF) is a separate account established by a U.S. bank, or a US branch/subsidiary of a foreign bank, or an Edge Act Corporation in the United States to offer services to only non-US residents and institutions. The services offered include deposit and loan services. Banks may maintain IBFs in their existing quarters, but the IBF's accounting must be separate from the bank's main books. Deposit and loan services provided by IBFs are free of Federal Reserve System reserve requirements, and are not insured by the Federal Deposit Insurance Corporation."}, {"url": "http://financial-dictionary.thefreedictionary.com/Bank+Credit+Facilities", "passage_text": "A loan extended by a bank to a business in need of operating capital. This may take several forms, from a short-term loan to a line of credit. Different banks have different facility plans for their clients who own or run businesses. "}, {"url": "http://www.investopedia.com/terms/i/ibf.asp", "passage_text": "DEFINITION of 'International Banking Facility-IBF'. A facility that allows depository institutions in the United States to offer deposit and loan services to foreign residents and institutions, while being exempted from reserve requirements imposed by the Federal Reserve and some state and local income taxes. While banks are permitted to conduct IBF activities from their existing offices, they are required to maintain separate books for their IBF business. The Federal Reserve Board of Governors approved the establishment of IBFs in the early 1980s."}, {"url": "http://financial-dictionary.thefreedictionary.com/Bank+Credit+Facility", "passage_text": "A loan extended by a bank to a business in need of operating capital. This may take several forms, from a short-term loan to a line of credit. Different banks have different facility plans for their clients who own or run businesses. "}, {"url": "http://www.businessdictionary.com/definition/loan-facility.html", "passage_text": "A credit line that a business can use to finance projects or for other purposes. A loan facility might be extended to a company from a bank if the company is deemed to be creditworthy and seems to have a valid purpose for requesting the facility."}, {"url": "http://www.investopedia.com/terms/i/ibf.asp", "passage_text": "BREAKING DOWN 'International Banking Facility-IBF'. While banks are permitted to conduct IBF activities from their existing offices, they are required to maintain separate books for their IBF business. The Federal Reserve Board of Governors approved the establishment of IBFs in the early 1980s."}]