[{"url": "http://education.jlab.org/itselemental/ele030.html", "passage_text": "Zinc oxide (ZnO), a common zinc compound, forms when metallic zinc is exposed to the air and forms a protective coating that protects the rest of the metal. Zinc oxide is used in paints, some rubber products, cosmetics, pharmaceuticals, plastics, printing inks, soap and batteries, among other things."}, {"url": "https://ods.od.nih.gov/factsheets/Zinc-HealthProfessional/", "passage_text": "Oysters contain more zinc per serving than any other food, but red meat and poultry provide the majority of zinc in the American diet. Other good food sources include beans, nuts, certain types of seafood (such as crab and lobster), whole grains, fortified breakfast cereals, and dairy products [ 2, 11 ]."}, {"url": "https://www.nlm.nih.gov/medlineplus/ency/article/002416.htm", "passage_text": "Other good sources of zinc are nuts, whole grains, legumes, and yeast. Fruits and vegetables are not good sources, because the zinc in plant proteins is not as available for use by the body as the zinc from animal proteins. Therefore, low-protein diets and vegetarian diets tend to be low in zinc. Zinc is in most multivitamin and mineral supplements."}, {"url": "http://www.badgerbalm.com/s-33-zinc-oxide-sunscreen-nanoparticles.aspx", "passage_text": "Zinc oxide is the metal zinc that has been oxidized. The chemical formula is ZnO, 1 zinc atom and 1 oxygen atom held together by an ionic bond. Zinc oxide does occur in nature as the mineral zincite, but it is quite rare and commercially unavailable."}, {"url": "http://www.healthaliciousness.com/articles/zinc.php", "passage_text": "Zinc is an essential mineral required by the body for maintaining a sense of smell, keeping a healthy immune system, building proteins, triggering enzymes, and creating DNA. Zinc also helps the cells in your body communicate by functioning as a neurotransmitter."}, {"url": "http://www.dietitians.ca/Your-Health/Nutrition-A-Z/Minerals/Food-Sources-of-Zinc.aspx", "passage_text": "*This amount includes sources of zinc from food and supplements. The best sources of zinc are seafood, meat, seeds, and cooked dried beans, peas and lentils. The following table will show you foods which are sources if zinc."}, {"url": "http://www.williamhunter.co.uk/ZINC/wherefrom.htm", "passage_text": "Zinc comes from natural mineral deposits of ore in the earth s crust. The deposits may be close to the surface, in which case they will be mined from an open pit. Alternatively, they may be some distance underground and cannot be mined directly from the surface."}, {"url": "https://ods.od.nih.gov/factsheets/Zinc-HealthProfessional/", "passage_text": "Phytates—which are present in whole-grain breads, cereals, legumes, and other foods—bind zinc and inhibit its absorption [ 2, 12, 13 ]. Thus, the bioavailability of zinc from grains and plant foods is lower than that from animal foods, although many grain-and plant-based foods are still good sources of zinc [ 2 ]."}, {"url": "http://npic.orst.edu/factsheets/znso4gen.html", "passage_text": "Zinc may come from natural sources, pesticides, or human activities such as farming, and the production of batteries, animal feed, and metals. Zinc is also used as a food additive. Zinc sulfate is an inorganic salt that dissolves in water to form zinc ions."}]