[{"url": "https://en.wikipedia.org/wiki/Attention_deficit_hyperactivity_disorder", "passage_text": "1 ADHD, however, is not considered a learning disability, but it very frequently causes academic difficulties. 2  Tourette syndrome has been found to occur more commonly in the ADHD population. 3  Oppositional defiant disorder (ODD) and conduct disorder (CD), which occur with ADHD in about 50% and 20% of cases respectively. In North America, the DSM-IV or DSM-5 criteria are often used for diagnosis, while European countries usually use the ICD-10. With the DSM-IV criteria a diagnosis of ADHD is 3–4 times more likely than with the ICD-10 criteria. It is classified as neurodevelopmental psychiatric disorder."}, {"url": "http://psychcentral.com/disorders/adhd/", "passage_text": "Attention deficit disorder has been around a lot longer than most people realize. In fact, a condition that appears to be similar to ADHD was described by Hippocrates, who lived from 460 to 370 BC. The name Attention Deficit Disorder was first introduced in 1980 in the third edition of the Diagnostic and Statistical Manual of Mental Disorders. "}, {"url": "http://www.healthline.com/health/adhd/history", "passage_text": "The APA did not recognize ADHD in the first edition. A second DSM was published in 1968. This edition included hyperkinetic impulse disorder for the first time. Boys are more than twice as likely to be diagnosed with ADHD than girls. Adults can develop symptoms and be diagnosed as well. It was originally called hyperkinetic impulse disorder. It wasn’t until the late 1960s that the American Psychiatric Association (APA) formally recognized ADHD as a mental disorder."}, {"url": "http://www.apa.org/topics/adhd/index.aspx", "passage_text": "ADHD. ADHD, or attention-deficit hyperactivity disorder, is a behavioral condition that makes focusing on everyday requests and routines challenging. People with ADHD typically have trouble getting organized, staying focused, making realistic plans and thinking before acting. Children with ADHD can be defiant, socially inept or aggressive. Families considering treatment options should consult a qualified mental health professional for a complete review of their child's behavioral issues and a treatment plan."}, {"url": "https://en.wikipedia.org/wiki/Attention_deficit_hyperactivity_disorder", "passage_text": "Most healthcare providers accept ADHD as a genuine disorder, and the debate in the scientific community mainly centers on how it is diagnosed and treated. Before 1987 the condition was known as attention deficit disorder (ADD). In North America, the DSM-IV or DSM-5 criteria are often used for diagnosis, while European countries usually use the ICD-10. With the DSM-IV criteria a diagnosis of ADHD is 3–4 times more likely than with the ICD-10 criteria. It is classified as neurodevelopmental psychiatric disorder."}, {"url": "http://www.healthline.com/health/adhd/history", "passage_text": "They removed the hyperactivity distinction and changed the name to attention deficit hyperactivity disorder (ADHD). The APA combined the three symptoms (inattentiveness, impulsivity, and hyperactivity) into a single type and did not identify subtypes of the disorder. Boys are more than twice as likely to be diagnosed with ADHD than girls. Adults can develop symptoms and be diagnosed as well. It was originally called hyperkinetic impulse disorder. It wasn’t until the late 1960s that the American Psychiatric Association (APA) formally recognized ADHD as a mental disorder."}, {"url": "https://www.sharecare.com/health/add-adhd/when-was-adhd-first-discovered", "passage_text": "A doctor named Heinrich Hoffman first described Attention Deficit Hyperactivity Disorder, which had not yet been named, in his book published in 1845. Decades later, Sir George Frederick Still, a pediatric doctor in Britain who later served the royalty, delivered lectures describing the condition in 1902. During the 1970s, doctors narrowed ADHD down to three types: primarily inattentive, primarily hyperactive-impulsive, and combined type. ADHD was known as ADD (attention deficit disorder) for quite some time. In 1994, the H was added to the name. Experts changed the name because hyperactivity was such a significant and common symptom of the condition"}, {"url": "http://www.healthline.com/health/adhd/history", "passage_text": "Attention deficit hyperactivity disorder (ADHD) is a common neurobehavioral disorder most commonly diagnosed in children. According to the Centers for Disease Control and Prevention, the average age at diagnosis is 7. Boys are more than twice as likely to be diagnosed with ADHD than girls. Adults can develop symptoms and be diagnosed as well. It was originally called hyperkinetic impulse disorder. It wasn’t until the late 1960s that the American Psychiatric Association (APA) formally recognized ADHD as a mental disorder."}, {"url": "https://en.wikipedia.org/wiki/History_of_attention_deficit_hyperactivity_disorder", "passage_text": "In the second edition of the Diagnostic and Statistical Manual of Mental Disorders, known as DSM-II (1968), it was called the Hyperkinetic Reaction of Childhood. It was in the 1980 DSM-III that ADD (Attention-Deficit Disorder) with or without hyperactivity was introduced. In 1980, the DSM-III introduced the term ADD (Attention-Deficit Disorder) with or without hyperactivity.. That terminology (ADD) technically expired with the revision in 1987 to ADHD in the DSM-III-R."}]