[{"url": "http://transparencyschool.org/faq/", "passage_text": "Transparency International is a global civil society organization leading the fight against corruption that brings people together in a powerful worldwide coalition to end the devastating impact of corruption on men, women and children around the world. "}, {"url": "http://www.investopedia.com/terms/c/corruption-perception-index.asp", "passage_text": "A ranking of countries according to the extent to which corruption is believed to exist. The corruption perception index was created in 1995 by Transparency International. It ranks almost 200 countries on a scale of zero to 10, with zero indicating high levels of corruption and 10 indicating low levels. Developed countries typically rank higher than developing nations due to stronger regulations. "}, {"url": "https://en.wikipedia.org/wiki/Transparency_%28behavior%29", "passage_text": "Transparency is operating in such a way that it is easy for others to see what actions are performed. It has been defined simply as the perceived quality of intentionally shared information from a sender. Transparency is practiced in companies, organizations, administrations, and communities. It guides an organization's decisions and policies on the disclosure of information to its employees and the public, or simply the intended recipient of the information. Transparency, as used in science, engineering, business, the humanities and in other social contexts, implies openness, communication, and accountability."}, {"url": "https://en.wikipedia.org/wiki/Transparency_International", "passage_text": "Transparency International (TI) is a non-governmental organization that monitors and publicizes corporate and political corruption in international development. Originally founded in Germany in May 1993 as a not-for-profit organization, Transparency International is now an international non-governmental organization. It publishes an annual Global Corruption Barometer and Corruption Perceptions Index, a comparative listing of corruption worldwide. Transparency International consists of chapters – locally established, independent organisations – that address corruption in their respective countries. From small bribes to large-scale looting, corruption differs from country to country."}, {"url": "https://en.wikipedia.org/wiki/Transparency_International", "passage_text": "Transparency International is the global civil society organization leading the fight against corruption. It brings people together in a powerful worldwide coalition to end the devastating impact of corruption on men, women and children around the world. Transparency International consists of chapters – locally established, independent organisations – that address corruption in their respective countries. From small bribes to large-scale looting, corruption differs from country to country."}, {"url": "http://www.transparency.org.uk/our-work/uk-corruption/", "passage_text": "UK CORRUPTION. Although corruption is not endemic in the UK, there are significant problems which need to be addressed. Transparency International UK (TI-UK)’s recent Corruption in the UK report highlighted corruption vulnerabilities in some of Britain’s key sectors and institutions. In 2011 Transparency International UK (TI-UK) launched the major findings from a series of studies which examine corruption in the UK. The reports – which represent the most comprehensive research ever undertaken in this area – examine the levels of corruption in 23 UK sectors and institutions."}, {"url": "http://www.transparency.org.uk/who-we-are/", "passage_text": "Transparency International (TI) is a global movement sharing one vision: a world in which government, politics, business, civil society and the daily lives of people are free of corruption. Transparency International UK (TI-UK) is the UK national chapter of this movement. Our vision is a society in which: 1  The lives of people in the UK and around the world are significantly improved. 2  The health of our institutions is enhanced."}, {"url": "http://action.transparency.org/", "passage_text": "Transparency International’s Global Corruption Barometer 2013 reveals that corruption remains a widespread problem internationally, including in the Middle East and North Africa. Corruption often takes place in secret. Access to public information is vital to prevent and uncover corrupt practices. Nevertheless, 82 per cent of Transparency International’s Global Corruption Barometer 2013 participants in Palestine believed or strongly believed that ordinary people can make a difference in the fight against corruption."}]