[{"url": "http://www.mayoclinic.org/tests-procedures/stereotactic-radiosurgery/home/ovc-20130212", "passage_text": "Stereotactic radiosurgery (SRS) uses many precisely focused radiation beams to treat tumors and other problems in the brain, neck and other parts of the body. Like other forms of radiation, stereotactic radiosurgery works by damaging the DNA of the targeted cells. The affected cells then lose the ability to reproduce, which causes tumors to shrink. Stereotactic radiosurgery of the brain and spine is typically completed in a single session. Body radiosurgery is used to treat lung, liver, adrenal and other soft tissue tumors, and treatment typically involves multiple sessions"}, {"url": "http://www.cancercenter.com/treatments/sterotactic-radiosurgery/", "passage_text": "Stereotactic radiosurgery. Stereotactic radiosurgery is a nonsurgical, highly precise form of radiation therapy we use to treat cancers of the brain, lung, as well as other types of cancer that require a high degree of precision. With regular radiation therapy treatment, healthy tissue also receives radiation. "}, {"url": "http://www.rtanswers.org/treatmentinformation/treatmenttypes/stereotacticradiation/", "passage_text": "Stereotactic body radiation therapy (SBRT) is used to treat small tumors in the chest, abdomen or pelvis that cannot be removed surgically or treated with conventional radiation therapy, including: 1  Small lung cancers. 2  Cancers that started elsewhere and spread to the lung (lung metastases). 1 Stereotactic radiosurgery (SRS) refers to a singe or several stereotactic radiation treatments of the brain or spine. 2  SRS is delivered by a team involving a radiation oncologist and a neurosurgeon."}, {"url": "http://www.abta.org/brain-tumor-treatment/treatments/stereotactic-radiosurgery/", "passage_text": "Stereotactic radiosurgery, or SRS, is a special form of radiation therapy. It is not surgery. Description. Radiation either kills tumor cells directly or interferes with their ability to grow. However, radiation cannot tell the difference between tumor cells and healthy cells—it affects both. "}, {"url": "http://www.coloradocyberknife.com/cyberknife-vsi/what-is-stereotactic-body-radiation-therapy-sbrt/", "passage_text": "November 18, 2010January 16, 2014 by Colorado CyberKnife. Stereotactic Body Radiation Therapy (SBRT), also called stereotactic ablative radiotherapy (SABR), is a type of radiation therapy in which a few very high doses of radiation are delivered to small, well-defined tumors. "}, {"url": "http://www.healthline.com/health/stereotactic-radiosurgery", "passage_text": "Stereotactic radiosurgery (SRS) is a type of radiation therapy that is very precise and very powerful. Instead of many doses of radiation therapy to treat a problem area, SRS usually consists of a single treatment of a very high dose of radiation in a very focused location. Sometimes, it may consist of a few treatments. Stereotactic Radiosurgery. Sometimes, surgery is not possible to treat a disease due to the location of the problem or the poor health of the patient. Brain tumors, blood vessel issues, and some nervous system conditions are very difficult to address with a scalpel."}, {"url": "http://www.beaumont.edu/cancer/cancer-services/radiation-oncology/external-beam-radiation-therapy/stereotactic-body-radiation-therapy/", "passage_text": "Stereotactic Body Radiation Therapy (SBRT). Stereotactic body radiation therapy (known as SBRT) is a very precise form of radiation therapy is a non-surgical approach that delivers high doses of radiation therapy in an incredibly targeted manner, in much higher doses. "}, {"url": "http://www.radiologyinfo.org/en/info.cfm?pg=stereotactic", "passage_text": "Stereotactic radiosurgery (SRS) is a non-surgical radiation therapy used to treat functional abnormalities and small tumors of the brain. It can deliver precisely-targeted radiation in fewer high-dose treatments than traditional therapy, which can help preserve healthy tissue. When SRS is used to treat body tumors, it’s called stereotactic body radiotherapy (SBRT). SRS and SBRT are usually performed on an outpatient basis."}, {"url": "http://www.rtanswers.org/treatmentinformation/treatmenttypes/stereotacticradiation/", "passage_text": "There are two types of stereotactic radiation: 1  Stereotactic radiosurgery (SRS) refers to a singe or several stereotactic radiation treatments of the brain or spine. 2  Stereotactic body radiation therapy (SBRT) refers to one or several stereotactic radiation treatments with the body, excluding the brain or spine. 1 Stereotactic radiosurgery (SRS) refers to a singe or several stereotactic radiation treatments of the brain or spine. 2  SRS is delivered by a team involving a radiation oncologist and a neurosurgeon."}]