[{"url": "http://www.merriam-webster.com/dictionary/obdurate", "passage_text": "Full Definition of OBDURATE. 1. a: stubbornly persistent in wrongdoing b: hardened in feelings. 2. : resistant to persuasion or softening influences. — ob·du·rate·ly adverb. — ob·du·rate·ness noun. See obdurate defined for English-language learners. See obdurate defined for kids. "}, {"url": "http://www.definitions.net/definition/obturator", "passage_text": "Obturator (noun). that which closes or stops an opening. Obturator (noun). an apparatus designed to close an unnatural opening, as a fissure of the palate. Obturator (adj). serving as an obturator; closing an opening; pertaining to, or in the region of, the obturator foramen; as, the obturator nerve. Origin: [NL., fr. L. obturare to stop up: cf"}, {"url": "http://www.oxforddictionaries.com/definition/english/obturator", "passage_text": "1.1 [as modifier] Relating to the obturator or to the obturator foramen: obturator neurectomy. More example sentences. 1  Metastatic prostatic and transitional cell carcinomas were present in a single obturator lymph node. 2  No tumor was detected in the right and left obturator lymph nodes. 1 Either of two muscles covering the outer front part of the pelvis on each side and involved in movements of the thigh and hip. Example sentences. 1  The surgeon uses a special hip arthroscopy cannula with cannulated obturators to establish the portals."}, {"url": "http://www.audioenglish.org/dictionary/obturate.htm", "passage_text": "OBTURATE: related words searches. » choke: pronunciation in phonetic transcription. » Definition of barricade. » clog up: pronunciation in phonetic transcription. "}, {"url": "http://medical-dictionary.thefreedictionary.com/obturator", "passage_text": "1. a disk or plate that closes an opening. 2. a prosthesis for closing an acquired or congenital opening of the palate (cleft palate). obturator sign pain on outward pressure on the obturator foramen as a sign of inflammation in the sheath of the obturator nerve, probably caused by appendicitis. (ob'tū-rā'tŏr), Etymology: L, obturare, to close. 1 a device used to block a passage or a canal or to fill in a space, such as a prosthesis implanted to bridge the gap in the roof of the mouth in a cleft palate. 2. an obturator muscle or membrane. Usage notes: nontechnical."}, {"url": "http://www.thefreedictionary.com/obturate", "passage_text": "obturate-block passage through; obstruct the path. occlude, close up, impede, obstruct, jam, block. block off, blockade-obstruct access to. barricado, barricade-block off with barricades. barricade-prevent access to by barricading; The street where the President lives is always barricaded. (bump up) as the expanding powder kicks them in the rear end. Rifle barrel burn out: if you shoot, it'll happen, but you can ... by Barsness, John / Guns Magazine. Under the Obtura brand name, Obtura Spartan offers an obturation system which is used to. , or fill, the canal after the pulp is removed."}, {"url": "https://en.wikipedia.org/wiki/Obturate", "passage_text": "(Redirected from Obturate). In the field of firearms and airguns, obturation denotes necessary barrel blockage or fitment by a deformed soft projectile (obturation in general is closing up an opening). The mechanism by which an undersized soft-metal projectile enlarges to fill the barrel is, for hollow-base bullets, expansion from gas pressure within the base cavity and, for solid-base bullets, upsetting—the combined shortening and thickening that occurs when a malleable metal object is struck forcibly at one end."}]