[{"url": "http://www.currentresults.com/Weather/Florida/Places/orlando-weather-in-january.php", "passage_text": "10 °C. In most years, Orlando averages a daily maximum temperature for January that's between 68 and 75 degrees Fahrenheit (20 to 24 degrees Celsius). The minimum temperature usually falls between 45 and 54 °F (7 to 12 °C). January is the coldest month overall for Orlando and the 11th is its chilliest day."}, {"url": "http://www.currentresults.com/Weather/Florida/Places/orlando-weather-in-january.php", "passage_text": "The temperature rises most days during January to over 60 °F (16 °C) in Orlando. The city averages 5 days this month when the thermometer reaches into the 80s °F (over 26 °C). Temperatures above 90 °F (32 °C) are not expected here this time of year."}, {"url": "http://www.holiday-weather.com/orlando/averages/january/", "passage_text": "Sunshine averages just under 220 hours in January, with the average amount of sunshine expected at 7 hours per day. There’s only a slight chance of rain with an average monthly precipitation of 57 mm, and it’s not too humid, so if you want a pleasant winter holiday, visit in January."}, {"url": "https://weatherspark.com/averages/31163/1/Orlando-Florida-United-States", "passage_text": "This report describes the typical weather at the Orlando Executive Airport (Orlando, Florida, United States) weather station over the course of an average January. It is based on the historical records from 1989 to 2012. Earlier records are either unavailable or unreliable."}, {"url": "http://goflorida.about.com/od/floridaweathe1/qt/Orlando-Weather.htm", "passage_text": "When you stay at the Orlando World Center Marriott, it's like having a water park at your resort!. © Orlando World Center Marriott. Orlando, located in Central Florida, has an overall average high temperature of 83° and an average low of 62°. On average Jacksonville's warmest month is July and January is the average coolest month."}, {"url": "http://www.currentresults.com/Weather/Florida/Places/orlando-weather-in-january.php", "passage_text": "The sun's rays reach the ground in Orlando during 62 percent of daylight hours on average in January, for a total of 203 hours in the month. Typically on 9 days this month the sky is mainly clear, with at most 30 percent cloud cover. Sunlight in January at Orlando lasts for 10 hours and 34 minutes a day on average. The shortest day of the month is the 1st with 10 hours and 22 minutes of daylight. By the end of the month, the days have lengthened to 10:51 from sunrise to sunset."}]