[{"url": "http://www.thebeardeddragon.org/bearded-dragon-price.php", "passage_text": "Heat lights Learn more about heat lights and basking lights for bearded dragons. are very important for your bearded dragon because, as cold bloods, they depend upon external heat to keep their bodies above 85 F° (this means one spot of the tank needs to reach 105 F°-110 F°)."}, {"url": "http://www.thebeardeddragon.org/bearded-dragon-price.php", "passage_text": "The Age of the Bearded Dragon. Your bearded dragon's age will play a big part in the price. If a dragon is very young then he or she will be cheaper to buy. Most pet stores will sell you young bearded dragons between the prices of $30-$60 and the larger (more mature) bearded dragons can cost up to $100. Besides the cost of your bearded dragon you're going to need to get the necessary supplies."}, {"url": "http://www.wikihow.com/Care-for-Bearded-Dragons", "passage_text": "Young bearded dragons can eat anywhere from 20-60 pinhead crickets a day. 1  Provide hatchlings with a diet of small insects. 2  Feed juvenile dragons (two to four months old) a mix of 80 percent small insects and 20 percent greens (see below for recommendations). 3  Young dragons need to be fed two to three times per day."}, {"url": "http://beardeddragoncaresheet.weebly.com/feeding-and-watering.html", "passage_text": "For a Bearded Dragon more than a year old, there should be roughly 70% salad and 30% insects. At this age a Bearded Dragon should get 50 crickets OR 30 worms a week. Obesity is a problem in this age bracket. So a good feeding schedule would be in threes. One day salad, one day insects, one day nothing, and then repeat. For a Bearded Dragon less than a year old, there should be 70% insects and 30% salad in their diet. A young Bearded Dragon should get between 30-80 appropriately sized crickets (smaller than the space between the Bearded Dragon's eyes) a day."}, {"url": "http://www.howmuchisit.org/bearded-dragon-cost/", "passage_text": "1 On average, a bearded dragon is going to cost anywhere from $45 to $125. 2  These dragons can commonly be found through various reptile centers and even your bigger name pet stores such as PetSmart. 3  The bigger they are, the more they are going to cost. 4  These dragons generally have a life span of 10 years."}]