[{"url": "http://www.surnamedb.com/Surname/Anderson", "passage_text": "This interesting surname is of English and Scottish origin, and is a patronymic of the surname Andrew, which is derived from the personal name from the Greek Andreas, a derivative of andreios, manly, from aner, man, male. "}, {"url": "http://genealogy.familyeducation.com/surname-origin/henderson", "passage_text": "Last name origin & meaning: Scottish and northern Irish: patronymic from Hendry, a chiefly Scottish variant of the personal name Henry 1. Some Scottish families with this name have ancestors whose name was Henryson. "}, {"url": "http://www.ancestry.com/name-origin?surname=henderson", "passage_text": "Henderson Name Meaning. Scottish and northern Irish: patronymic from Hendry, a chiefly Scottish variant of the personal name Henry 1. Some Scottish families with this name have ancestors whose name was Henryson. "}, {"url": "https://www.houseofnames.com/henderson-family-crest", "passage_text": "Henderson Early Origins. First found in Caithness, Glencoe, the Shetland Islands, Liddlesdale, and Fordell. One origin claims the Henderson family descend from Great Henry, son of King Nechtan, who was also the progenitor of the MacDonalds of Glencoe."}, {"url": "http://www.answers.com/Q/In_what_country_did_the_surname_Henderson_originate_from", "passage_text": "I have been researching my family tree and many others since I was a teenager! The surname Henderson is a Scottish and northern Irish patronymic from Hendry, a Scottish spelling of the personal name Henry. Some Scottish families with this name have ancestors whose name was Henryson. Paulsen derives from the first name Paul. Another origin but least likely than the first is Paulsell being a variant of English surname Parsell, also as Parsells, and Purcell. See related links below for more information."}, {"url": "http://www.surnamedb.com/Surname/Henderson", "passage_text": "This is an ancient Scottish name, the patronymic (meaning son of) form of Hendry, a mainly Scottish variant of the personal name Henry. Some bearers of the name Henderson are descended from Henrysons, the d being a common intrusive element in many languages between n and r. A branch of the Clan Gunn bears the name Henderson, and there is another Clan Henderson of Glencoe. An interesting namebearer, recorded in the Dictionary of National Biography, was John Henderson (1747 - 1785), who was a notable actor of his day, considered second only to David Garrick."}, {"url": "http://www.chebucto.ns.ca/Heritage/FSCNS/Scots_NS/Clans/Henderson/Origin_Henderson/Henderson_Name.html", "passage_text": "THE NAME HENDERSON. The Name Henderson is the modern version of an ancient Scottish patronymic; that is, a name derived when children of the first generation are known as their father's sons (Henry's sons). In the next step, it becomes a single name (Henrison) and then the name becomes a permanent surname. We are aware on the basis of Henderson family lore of several fathers named Henry who passed their name in this fashion."}, {"url": "https://en.wikipedia.org/wiki/Henderson_(surname)", "passage_text": "For other uses, see Henderson. Henderson is a common Scottish surname. The name is derived from patronymic form of the name Hendry, which is a Scottish form of Henry. Some Hendersons also derive their name from Henryson. The surname Henderson is borne by numerous unrelated families in Scotland. For example, the Hendersons of Fordell, in Fife, were the chief Lowland family of the name. This family descended from a family of Henrysons, from Dumfriesshire"}, {"url": "https://en.wikipedia.org/wiki/Clan_Henderson", "passage_text": "There are three origins for the Scottish surname of Henderson. The Hendersons who lived in the Scottish Borders seem to be simply the sons of Henry, and here the name is often found in the variant of Henryson. Some individuals used multiple surname spellings, and sometimes different surname forms. For example, a traveling Henderson might use the surname MacEanruig in the Scottish Highlands, Henderson in the Lowlands, McHenry in Ulster, and Henry in England."}, {"url": "http://blogs.ancestry.com/cm/2014/07/01/there-are-7-types-of-english-surnames-which-one-is-yours/", "passage_text": "Patronymic, matronymic, or ancestral. Patronymic surnames (those that come from a male given name) include Benson (“the son of Ben”), Davis, Dawson, Evans, Harris, Harrison, Jackson, Jones (Welsh for John), Nicholson, Richardson, Robinson, Rogers, Simpson, Stephenson, Thompson, Watson, and Wilson. "}]