[{"url": "http://healthooze.com/seroma-causes-symptoms-pictures-drainage-treatment/", "passage_text": "Seroma is known as the accumulation of serum in specific body parts after a person undergoes surgery. The serum can be defined as the clear or yellowish fluid found inside the seroma; it is made up of plasma as well as other cells that come from various blood vessels which become damaged while the surgery is ongoing. It is characterized as a small/ big lump depending on the amount of fluid encased in it."}, {"url": "http://www.healthline.com/health/seroma", "passage_text": "A seroma is a collection of fluid that builds up under the surface of your skin. Seromas may develop after a surgical procedure, most often at the site of the surgical incision or where tissue was removed. The fluid, called serum, doesn’t always build up right away. A seroma may form after a surgical procedure. In some cases, a seroma may form after a very minor surgery. Most seromas, though, will appear after a rather extensive procedure, or one in which a lot of tissue is removed or disrupted. Your surgical team will place drainage tubes in and around the incision to try to prevent a seroma"}, {"url": "https://en.wikipedia.org/wiki/Seroma", "passage_text": "A seroma is a pocket of clear serous fluid that sometimes develops in the body after surgery. When small blood vessels are ruptured, blood plasma can seep out; inflammation caused by dying injured cells also contributes to the fluid. Seromas are particularly common after breast surgery (for example after mastectomy), abdominal surgeries, and reconstructive surgery. They are a treatment target in partial-breast radiation therapy, The larger the surgical intervention, the more likely it is that seromas appear."}, {"url": "https://www.sharecare.com/health/cosmetic-surgery/what-is-a-seroma", "passage_text": "A seroma is a pocket of clear serous fluid that sometimes develops in the body after surgery. When small blood vessels are ruptured blood plasma, or sera, can seep out. Inflammation caused by dying cells also contributes to the fluid. "}, {"url": "https://en.wikipedia.org/wiki/Seroma", "passage_text": "Seromas are different from hematomas, which contain red blood cells, and from abscesses, which contain pus and result from an infection. Serous fluid is also different from lymph. Seromas can also sometimes be caused by injury, such as when the initial swelling from a blow or fall does not fully subside. The remaining serous fluid causes a seroma that the body usually gradually absorbs over time (often taking many days or weeks); however, a knot of calcified tissue sometimes remains. Seromas are particularly common after breast surgery (for example after mastectomy), abdominal surgeries, and reconstructive surgery. They are a treatment target in partial-breast radiation therapy, The larger the surgical intervention, the more likely it is that seromas appear."}, {"url": "http://www.healthgrades.com/conditions/seroma", "passage_text": "A seroma is an accumulation of fluid in a tissue or organ that can occur after surgery, or sometimes after an injury such as blunt trauma. The fluid, called serum, leaks out of nearby damaged blood and lymphatic vessels. Cells are typically present in the fluid, which is normally clear. "}, {"url": "http://healthfoxx.com/seroma-definition-symptoms-fluid-treatment-types/", "passage_text": "A Seroma is a collection of serous fluid that develops after surgery or any blunt injury. Serous fluid is the fluid compartment of blood that seeps out when blood vessels are injured or ruptured during operation. Seroma appears like a bump or swelling on the surgical site and may contain clear to yellowish fluid. Surgeons consider seroma as a post-surgical injury that needs proper medical treatment, although seromas are not considered life-threatening."}, {"url": "http://breast-cancer.ca/seromsurgery/", "passage_text": "Seroma is a pocket of clear fluid which sometimes develops following a surgery. They are very common after breast cancer surgical treatments, and also axillary surgeries if there has been metastasis and lymph node involvement. "}, {"url": "http://www.nordesthetics.com/en/articles/seroma-after-plastic-surgery", "passage_text": "Seroma is an abnormal accumulation of serous fluid which sometimes develops after a surgery. It is especially com mon after large dissections, such as mastectomy or breast augmentation, abdominoplasties and body or face lifts. Usually, seroma resolves itself within a few weeks. "}]