[{"url": "http://www.diffen.com/difference/Aerobic_Respiration_vs_Anaerobic_Respiration", "passage_text": "Anaerobic respiration is respiration without oxygen; the process uses a respiratory electron transport chain but does not use oxygen as the electron acceptors. Cells that use it. Aerobic respiration occurs in most cells."}, {"url": "https://www.wyzant.com/resources/lessons/science/biology/cellular-respiration", "passage_text": "Just like we need energy to get through the day, individual cells need energy for survival too. Cellular respiration is the process by which cells get their energy in the form of ATP. There are two types of cellular respiration, aerobic and anaerobic. Aerobic respiration is more efficient and can be utilized in the presence of oxygen, while anaerobic respiration does not require oxygen."}, {"url": "http://www.diffen.com/difference/Aerobic_Respiration_vs_Anaerobic_Respiration", "passage_text": "Diffen › Science › Biology. Aerobic respiration, a process that uses oxygen, and anaerobic respiration, a process that doesn't use oxygen, are two forms of cellular respiration. Although some cells may engage in just one type of respiration, most cells use both types, depending on an organism's needs."}, {"url": "http://www.diffen.com/difference/Aerobic_Respiration_vs_Anaerobic_Respiration", "passage_text": "Aerobic respiration, a process that uses oxygen, and anaerobic respiration, a process that doesn't use oxygen, are two forms of cellular respiration. Although some cells may engage in just one type of respiration, most cells use both types, depending on an organism's needs."}, {"url": "http://hyperphysics.phy-astr.gsu.edu/hbase/biology/celres.html", "passage_text": "Cellular Respiration. The term cellular respiration refers to the biochemical pathway by which cells release energy from the chemical bonds of food molecules and provide that energy for the essential processes of life. All living cells must carry out cellular respiration. It can be aerobic respiration in the presence of oxygen or anaerobic respiration. Prokaryotic cells carry out cellular respiration within the cytoplasm or on the inner surfaces of the cells. More emphasis here will be placed on eukaryotic cells where the mitochondria are the site of most of the reactions."}]