[{"url": "http://wdfw.wa.gov/living/bobcats.html", "passage_text": "Like house cats scratching furniture, bobcats mark their territory boundaries by leaving claw marks on trees, stumps, and occasionally fence posts (Fig. 7). Bobcat claw marks are normally 2 to 3 feet above the ground; domestic cat scratching occurs at a height of about 1-1/2 to 2 feet."}, {"url": "http://wdfw.wa.gov/living/bobcats.html", "passage_text": "Enclose poultry (chickens, ducks, and turkeys) in a secure outdoor pen and house. Bobcats will eat poultry if they can get to them. Note: Other killers of poultry include coyotes, foxes, skunks, raccoons, feral cats, dogs, opossums, weasels, hawks, and large owls."}, {"url": "http://wdfw.wa.gov/living/bobcats.html", "passage_text": "Mortality and Longevity Bobcats are known to live up to 12 years in the wild, but the average life expectancy is probably closer to 3-4 years. In captivity, they may live 25 years. Few predators other than cougars and humans are able to kill an adult bobcat."}, {"url": "http://www.dfwwildlife.org/bobcat.html", "passage_text": "What do bobcats eat? Bobcats eat a variety of animal species, including mice, rats, squirrels, chickens, small fawns, wild birds, feral cats, cottontail and rabbits. It’s very unlikely, but possible, that free-roaming cats or small dogs left outside unattended might be taken as well."}, {"url": "http://www.defenders.org/bobcat/bobcats", "passage_text": "Bobcats mainly hunt rabbits and hares. Bobcats are also known to eat rodents, birds, bats and even. adult deer, which they usually consume during the winter months, as well as lambs, poultry and young pigs when a ranch is near."}, {"url": "http://wdfw.wa.gov/living/bobcats.html", "passage_text": "1 Bobcats are known to live up to 12 years in the wild, but the average life expectancy is probably closer to 3-4 years. 2  In captivity, they may live 25 years. 3  Few predators other than cougars and humans are able to kill an adult bobcat."}, {"url": "http://www.nationaltrappers.com/bobcat.html", "passage_text": "The claws are extended as the bobcat climbs a tree, catches prey, or defends itself. Bobcat have 28 teeth, including four canine teeth. Meat is sheared off in sizes that can be swallowed whole, without chewing. Male bobcats do not breed as a rule until they are nearly two years old."}, {"url": "http://www.desertmuseum.org/kids/oz/long-fact-sheets/Bob-cat.php", "passage_text": "The bobcat (Lynx rufus) can be identified most easily by its short bob-tail which is 2 to 8 inches long. The tail has black fur on the top and is white on the underside. It has a wide flat face with longer fur on the cheek area. It has long legs and big paws."}, {"url": "http://www.nationaltrappers.com/bobcat.html", "passage_text": "Bobcats do not fear the water as much as other cat species. Bobcats commonly wade and swim, and many bobcats do not hesitate to attack a beaver in shallow water. Bobcats are skilled tree climbers, and they do not hesitate to bound up a tree to avoid persecution."}]