[{"url": "https://en.wikipedia.org/wiki/Democracy", "passage_text": "Democracy, or democratic government, is a system of government in which all the people of a state or polity ... are involved in making decisions about its affairs, typically by voting to elect representatives to a parliament or similar assembly, as defined by the Oxford English Dictionary. Representative democracy involves the election of government officials by the people being represented. If the head of state is also democratically elected then it is called a democratic republic. The most common mechanisms involve election of the candidate with a majority or a plurality of the votes."}, {"url": "http://www.livescience.com/33027-what-are-the-different-types-of-governments.html", "passage_text": "Democratic republic-a state in which the supreme power rests in the body of citizens entitled to vote for officers and representatives responsible to them. Dictatorship-a form of government in which a ruler or small clique wield absolute power (not restricted by a constitution or laws). Sultanate-similar to a monarchy, a government in which the supreme power is in the hands of a sultan (the head of a Muslim state); the sultan may be an absolute ruler or a sovereign with constitutionally limited authority."}, {"url": "https://en.wikipedia.org/wiki/Republic", "passage_text": "Most often a republic is a single sovereign state, but there are also sub-sovereign state entities that are referred to as republics, or which have governments that are described as 'republican' in nature. This understanding of a republic as a distinct form of government from a liberal democracy is one of the main theses of the Cambridge School of historical analysis. This grew out of the work of J. G. A. Pocock who in 1975 argued that a series of scholars had expressed a consistent set of republican ideals."}, {"url": "https://answers.yahoo.com/question/index?qid=20080804181727AA8rzis", "passage_text": "Relevance. Rating Newest Oldest. Best Answer: Put simply, a republic is a country that is not led by a monarch. Where the people (or at least a some of people) have impact on government by voting, holding office, etc.Republic comes from latin: res publica, which means public thing or public matter. "}, {"url": "http://www.answers.com/Q/What_kind_of_government_is_a_republic", "passage_text": "Think the United States of America. A republic form of government is a government in which power lies in a group of people who are representatives of the citizens of a country … . They may or may not be elected by their constituents. + 14 others found this useful. Tiffanie Pelka. A republic is a government that does not have have a king or queen, but rather an elected leader."}, {"url": "http://depts.alverno.edu/dgp/GEC/Types%20of%20Government.html", "passage_text": "Some of the more common types of governments are: 1. Democracy The word democracy literally means rule by the people.. In a democracy, the people govern. 2. Republic A literal democracy is impossible in a political system containing more than a few people. All democracies are really republics. In a republic, the people elect representatives to make and enforce laws. 3. Monarchy A monarchy consists of rule by a king or queen."}, {"url": "http://www.thisnation.com/question/011.html", "passage_text": "The United States is, indeed, a republic, not a democracy. Accurately defined, a democracy is a form of government in which the people decide policy matters directly--through town hall meetings or by voting on ballot initiatives and referendums. By popular usage, however, the word democracy come to mean a form of government in which the government derives its power from the people and is accountable to them for the use of that power. In this sense the United States might accurately be called"}, {"url": "https://en.wikipedia.org/wiki/Republic", "passage_text": "A republic (from Latin: res publica) is a form of government or country in which power resides in elected individuals representing the citizen body and government leaders exercise power according to the rule of law. This understanding of a republic as a distinct form of government from a liberal democracy is one of the main theses of the Cambridge School of historical analysis. This grew out of the work of J. G. A. Pocock who in 1975 argued that a series of scholars had expressed a consistent set of republican ideals."}, {"url": "https://en.wikipedia.org/wiki/Democracy", "passage_text": "Representative democracy is a form of democracy in which people vote for representatives who then vote on policy initiatives as opposed to a direct democracy, a form of democracy in which people vote on policy initiatives directly. Representative democracy involves the election of government officials by the people being represented. If the head of state is also democratically elected then it is called a democratic republic. The most common mechanisms involve election of the candidate with a majority or a plurality of the votes."}, {"url": "http://www.livescience.com/33027-what-are-the-different-types-of-governments.html", "passage_text": "Monarchy-a government in which the supreme power is lodged in the hands of a monarch who reigns over a state or territory, usually for life and by hereditary right; the monarch may be either a sole absolute ruler or a sovereign-such as a king, queen or prince-with constitutionally limited authority. Sultanate-similar to a monarchy, a government in which the supreme power is in the hands of a sultan (the head of a Muslim state); the sultan may be an absolute ruler or a sovereign "}]