[{"url": "http://www.merriam-webster.com/dictionary/cognate", "passage_text": "2. : related by blood; also: related on the mother's side. 3. a: related by descent from the same ancestral language b of a word or morpheme: related by derivation, borrowing, or descent c of a substantive: related to a verb usually by derivation and serving as its object to reinforce the meaning. — cog·nate·ly adverb. See cognate defined for English-language learners"}, {"url": "https://simple.wikipedia.org/wiki/Cognate", "passage_text": "A cognate is a word derived from the same root as another word. Cognates are words that have a common origin (source). They may occur in a language or in a group of languages. The word 'cognate' is derived from the Latin word 'cognatus' meaning 'to be born with'. In reading Churchill 's History of the English Speaking Peoples, it would be well to keep in mind (remember) what George Bernard Shaw says:  England and America are two countries divided by a common language.."}, {"url": "https://en.wikipedia.org/wiki/False_cognate", "passage_text": "(April 2010). False cognates are pairs of words that seem to be cognates because of similar sounds and meaning, but actually have different etymologies; these word pairs can be within the same language or be from different ones. This is different from false friends, which may in fact be related but have different meanings. "}, {"url": "http://spanish.about.com/cs/vocabulary/g/cognategloss.htm", "passage_text": "In a popular and less technical sense, the term cognate also is used to refer to words in two languages that are similar but have no common origin, such as the Spanish sopa (meaning soup) and the English soap.. An example of such a change is the English word arena, which usually refers to a sports facility, and the Spanish arena, which usually means sand.. They both come from the Latin harena, which originally meant sand and came in time to also refer to an area of a Roman amphitheater that was covered with sand."}, {"url": "https://en.wikipedia.org/wiki/Cognate", "passage_text": "Characteristics of cognate words [edit]. Cognates do not need to have the same meaning, which may have changed as the languages developed separately. For example, consider English starve and Dutch sterven or German sterben (to die); these three words all derive from the same Proto-Germanic root, *sterbaną (die). False cognates are words that are commonly thought to be related (have a common origin), but which linguistic examination reveals to be unrelated. For example, on the basis of superficial similarities, the Latin verb habēre and German haben, both meaning 'to have', appear to be cognates."}, {"url": "http://www.yourdictionary.com/cognate", "passage_text": "cognate. adjective. 1  Related by blood; having a common ancestor. 2  Related in origin, as certain words in genetically related languages descended from the same ancestral root; for example, English name and Latin nōmen from Indo-European &ast;n&obremac;-men-. 3  Related or analogous in nature, character, or function. "}, {"url": "http://www.thefreedictionary.com/cognate", "passage_text": "1. related by birth; of the same parentage or descent. 2. descended from the same language or form: such cognate languages as French and Spanish. 3. allied or similar in nature or quality. 4. a person or thing cognate with another. 5. a cognate word: The English word cold is a cognate of German kalt. cognātus = co-co - + -gnātus, past participle of (g)nāscī to be born]."}, {"url": "https://en.wikipedia.org/wiki/Cognate", "passage_text": "In linguistics, cognates are words that have a common etymological origin. This learned term derives from the Latin cognatus (blood relative). In linguistic research it is generally understood as excluding doublets and loan words, although broader definitions are used in other areas such as language teaching. False cognates are words that are commonly thought to be related (have a common origin), but which linguistic examination reveals to be unrelated. For example, on the basis of superficial similarities, the Latin verb habēre and German haben, both meaning 'to have', appear to be cognates."}, {"url": "http://spanish.about.com/cs/vocabulary/g/cognategloss.htm", "passage_text": "By Gerald Erichsen. Definition: In a technical sense, two words that have a common origin are cognates. Most often, cognates are words in two languages that have a common etymology and thus are similar or identical. An example of such a change is the English word arena, which usually refers to a sports facility, and the Spanish arena, which usually means sand.. They both come from the Latin harena, which originally meant sand and came in time to also refer to an area of a Roman amphitheater that was covered with sand."}, {"url": "http://www.thefreedictionary.com/cognate", "passage_text": "adj. 1. akin; related: cognate languages. 2. (Law) related by blood or descended from a common maternal ancestor. Compare agnate. 3. (Grammar) cognate object grammar a noun functioning as the object of a verb to which it is etymologically related, as in think a thought or sing a song. 2. descended from the same language or form: such cognate languages as French and Spanish. 3. allied or similar in nature or quality. 4. a person or thing cognate with another. 5. a cognate word: The English word cold is a cognate of German kalt. cognātus = co-co - + -gnātus, past participle of (g)nāscī to be born]."}]