[{"url": "http://www.us-passport-service-guide.com/passport-renewal-faq.html", "passage_text": "The total cost of renewing a passport depends on what service you request, how quickly you need it and what method you use to obtain it. The application fee for renewing a passport book is $110. The State Department charges $60 for expedited service. Fees for professional passport expediting service start at approximately $79 for 10-day service. The highests fee, of course, is for same day passport renewal. "}, {"url": "http://www.cnn.com/2010/TRAVEL/07/07/passport.fees.hike/index.html", "passage_text": "The renewal fee for passport books will rise to $110 -- up from the current $75. There's even a new fee if you'd like formally to renounce your U.S. citizenship -- it costs nothing now, but the price tag will be $450 starting Tuesday. Fees for passport book and cards for children also are set to rise."}, {"url": "http://www.cnn.com/2010/TRAVEL/07/07/passport.fees.hike/index.html", "passage_text": "Starting next Tuesday, adults applying for their first passport book will have to pay $135 -- a 35 percent increase from the current $100 fee. (The cost of the wallet-size passport card, which Americans can use on certain trips closer to home, is rising from $45 to $55 for first-time applicants.). There's even a new fee if you'd like formally to renounce your U.S. citizenship -- it costs nothing now, but the price tag will be $450 starting Tuesday. Fees for passport book and cards for children also are set to rise."}, {"url": "https://georgia.gov/blog/2013-10-03/getting-passport", "passage_text": "1 pay a fee (for a regular adult passport book, it will typically cost $110 for the application and $25 for an execution fee); 2  provide a picture (most post offices can take a picture of you on the spot); and. 3  let them do the rest. Once the post office has your application and documents, you will need to: 1 "}, {"url": "http://www.diffen.com/difference/Passport_Book_vs_Passport_Card", "passage_text": "edit Cost. A first passport book costs $135 for adults and $105 for minors under the age of 16. It costs $110 to renew. A first passport card costs $55 for adults and $40 for minors under the age of 16. It costs $30 to renew. The cost when applying for both is $165 for adults and $120 for minors"}, {"url": "http://www.passport-renewal.org/passport-renewal-fees.html", "passage_text": "When applying for the passport book by itself for minors, the renewal cost is $80. If you wish to apply for the card along with the book, you will be expected to pay a fee of $95 and a fee of $15 for the minor passport card. Adult passport renewal for adults ages 16 and over is $110 if you are applying for the passport book alone. If you are applying for the passport card, along with the book, you will need to send in a fee of $140 along with your completed DS-82 form. When applying for the passport card alone, if you already have an active passport book, the cost for this renewal is $40"}, {"url": "http://seniortravel.about.com/od/seniortravelbasics/f/PassportCard.htm", "passage_text": "A passport card is less expensive than a traditional passport book. Your first-time passport card will cost $55 ($40 for children under 16) and will be valid for ten years (five for children). "}, {"url": "http://www.youtube.com/watch?v=yw9PJYN--rM", "passage_text": "The question we will answer in this video is: How much does it cost to get a new passport book? The application fee for a new passport book is $110 for an applicant age 16 or older or $80 for an applicant age 15 or younger. In addition, there is an execution fee of $25 that is paid to the application acceptance agent. "}, {"url": "http://about.usps.com/news/state-releases/sc/2010/sc_2010_0706.htm", "passage_text": "COLUMBIA – The Department of State has announced that new fees for the U.S. Passport Book, U.S. Passport Card and other passport services will be in effect on Tuesday, July 13. This increase does not apply to acceptance fees collected by the Postal Service (acceptance facility). "}]