[{"url": "http://www.wikihow.com/Make-Money-Selling-Crafts", "passage_text": "Some people simply make crafts as a hobby. However, others make a significant amount of money selling their homemade goods. There are several options available to make money with your crafts. You will be on your way to garnering profits once you have familiarized yourself with the ways to make money selling crafts."}, {"url": "http://sweatingthebigstuff.com/20-things-can-sell-make-money/", "passage_text": "Extra money is always welcome and with job losses and cuts in salaries and benefits, many families are struggling to pay for essentials. You can keep your day job and make a little extra if you know what to sell and where to sell it. A great list but it’s somewhat uneven. Yes, you can make money with all these things but sometimes you need special knowledge; not all clothes and old magazines will sell on ebay and some will sell if you know how to take the photos and write up the ads."}, {"url": "http://www.lifehack.org/articles/money/25-things-you-can-sell-make-money.html", "passage_text": "20. Sometimes you have to spend money to make money. Buying items from eBay, Etsy, or even Craigslist, rehabbing them, and turning them around for sale can net you big profits. A good rule of thumb here is to never spend more than 75% of the item’s list price and never accept less than 25% more than you bought it for. Blog advertising space. If you have a blog, you could be making money at it. High-traffic blogs with interesting or controversial material can be leveraged to create an additional revenue stream for minimal work on your part."}, {"url": "http://www.ebay.com/gds/What-to-Sell-to-Make-Money-as-a-Kid-/10000000178716391/g.html", "passage_text": "Offline, kids can easily sell lemonade, baked goods, and little goodies they've accumulated from their friends and family; but online, food may not be your best bet. However, you may be able to reach a larger audience of interested buyers if you're selling online. Look for items you own that you think can be sold. Kids Can Make Money Online. If you're a kid that's curious about selling their goodies online, or an adult willing to assist a kid in selling online, you're in the right place."}, {"url": "http://www.lifehack.org/articles/money/5-real-ways-actually-make-money-online.html", "passage_text": "Most of them require a lot of work and sometimes a lot of dedication before seeing a return on your time. But if you really want to make money online, work from home or turn an idea into a business, you can do it. You can even earn money with apps if you don’t want to venture all the way to the computer. I’m going to tell you about all kinds of legitimate ways to make money online. 1 If you sell art and you’re fine selling pieces for $5 each, that’s a gig. 2  If you’re a graphic designer and you want to offer your services for $10/hour, simply offer a 30 minute gig. 3  If they need two hours of graphic design, they pay you $20, or $10/hour by buying four gigs."}, {"url": "http://www.allyou.com/budget-home/money-shopping/selling-online", "passage_text": "Rather than throwing your things away, try to earn extra money and sell them online! Follow our guides to selling items on Craigslist, Amazon, eBay and even Facebook! "}, {"url": "http://www.bankrate.com/finance/smart-spending/legal-ways-to-make-money-with-your-body-1.aspx", "passage_text": "Under current law, selling organs is illegal in the U.S., but other organic materials, such as plasma, sperm, eggs and hair, can be legally sold for a (sometimes) tidy profit. Here are seven ways you can legally sell your body for money. Selling your body legally. The world's first 3D-printed liver is expected to hit the market in December, bringing with it the potential to radically change the organ transplant and donation systems. However, until bioprinting goes mainstream, the human body remains the only supplier of live tissue and other matter."}, {"url": "http://www.lifehack.org/articles/money/5-real-ways-actually-make-money-online.html", "passage_text": "1 eBay – Of course you can’t read an article about making money online that doesn’t mention eBay. 2  You can start an eBay store and get serious about it or you can just sell some stuff to declutter your home. 3  Either way, I’ve made my fair share from selling on eBay and it’s still a popular way to earn money. 1 If you sell art and you’re fine selling pieces for $5 each, that’s a gig. 2  If you’re a graphic designer and you want to offer your services for $10/hour, simply offer a 30 minute gig. 3  If they need two hours of graphic design, they pay you $20, or $10/hour by buying four gigs."}, {"url": "http://sweatingthebigstuff.com/20-things-can-sell-make-money/", "passage_text": "Watch out for get rich quick systems since the only people making money on these are the scammers who are selling them. Here is a list of the best things you can sell to make money online and start your home business. 1. Old Books, Magazines and Papers. My cousin has an eBay store where she sells old books, magazines and even Broadway Playbills. A great list but it’s somewhat uneven. Yes, you can make money with all these things but sometimes you need special knowledge; not all clothes and old magazines will sell on ebay and some will sell if you know how to take the photos and write up the ads."}, {"url": "http://www.lifehack.org/articles/money/5-real-ways-actually-make-money-online.html", "passage_text": "Ever since the idea of online auctions came into existence, the online selling market has been on the rise. Many are interested, but don’t know how to get started. There are still all kinds of ways to make money by selling online, whether you’re selling what you already have or buying and selling like a store. 1 If you sell art and you’re fine selling pieces for $5 each, that’s a gig. 2  If you’re a graphic designer and you want to offer your services for $10/hour, simply offer a 30 minute gig. 3  If they need two hours of graphic design, they pay you $20, or $10/hour by buying four gigs."}]