[{"url": "http://www.kompareit.com/homeandgarden/landscaping-compare-asphalt-vs-concrete-driveway.html", "passage_text": "Basic, construction-grade concrete costs about $5 to $10 per square foot, including installation. Opting for fancier, decorative versions such as stamped or colored concrete will add several dollars per square foot to the price. Very high-end concrete could cost as much as $15 per square foot."}, {"url": "http://www.ehow.com/about_5622007_asphalt-vs_-concrete-price.html", "passage_text": "Comparisons. In terms of initial cost, asphalt is a cheaper surface to use than concrete but the maintenance involved raises the overall cost. Asphalt roads and driveways can last for anywhere from 10 to 30 years if well-maintained. Concrete roads and driveways can last for 20 to 60 years if maintained properly."}, {"url": "http://www.greatdayimprovements.com/asphalt-vs-concrete-driveways.aspx", "passage_text": "Cost. Ignoring any maintenance costs, asphalt is generally much cheaper to install than concrete. On average, the cost per square foot for asphalt will run between $2.50 to $4.00. Fluctuations in crude oil prices can cause fluctuations in asphalt prices but the price will remain around this range."}, {"url": "http://www.youtube.com/watch?v=3IoMtvVS5gI", "passage_text": "Comparisons. In terms of initial cost, asphalt is a cheaper surface to use than concrete but the maintenance involved raises the overall cost. Asphalt roads and driveways can last for anywhere from 10 to 30 years if well-maintained. Concrete roads and driveways can last for 20 to 60 years if maintained properly."}, {"url": "http://www.ehow.com/about_5622007_asphalt-vs_-concrete-price.html", "passage_text": "Concrete on the other hand, is one of the more expensive materials used to pave roads and driveways with. Concrete can cost between $3 to $10 per square foot installed. Asphalt can cost anywhere from $1 to $5"}, {"url": "http://www.wolfpaving.com/blog/3-driveway-pros-cons-gravel-vs.-asphalt-paving", "passage_text": "Homeowners appreciate the sleek appearance of an asphalt-paved driveway at a lower cost than concrete or paver surfaces. Flexible in extreme climate conditions. Asphalt driveways typically cost $2 - $5 per sq foot to install-more than gravel, but much less than many other options."}, {"url": "http://www.greatdayimprovements.com/asphalt-vs-concrete-driveways.aspx", "passage_text": "Concrete, on the other hand, can run between $4.00 to $6.00 per square foot for basic installation and can cost more depending on different finishes and detail. It’s not unheard of to have a stained concrete driveway with a smooth finish cost over $15.00 per square foot."}, {"url": "http://www.ehow.com/about_5622007_asphalt-vs_-concrete-price.html", "passage_text": "An asphalt driveway will require more regular maintenance than a concrete driveway. Asphalt requires re-sealing every three years or so. Low-end sealants cost around $5 for a five-gallon bucket and cover around 400 square feet of asphalt. High-end sealants can cost upwards of $20 per bucket."}]