[{"url": "http://www.fcps.edu/islandcreekes/ecology/american_elm.htm", "passage_text": "American Elms are fast growing trees which will quickly take over a field if not diseased. They are sought out by many birds as nest sites. Cavity dwellers, such as woodpeckers, chickadees, squirrels, and raccoons often find homes in this tree. American Elms grow in forests, fields, and along shores of streams. Dutch Elm Disease is a fungal disease transmitted by bark beetles, including the American Bark Beetle. The beetle eats on a diseased tree and then, when it moves to a new one, spreads the disease. Helpful fungi can also be found on the roots of this tree. These fungi transmit nutrients through the tree's roots."}, {"url": "http://www.ehow.com/facts_7154086_fast-do-elm-trees-grow_.html", "passage_text": "A healthy 3- to 4-foot-tall American elm sapling bought from a nursery typically grows 25 to 30 feet high in 8 to 10 years. In about 40 years, it may grow up to 100 feet tall with a 60- to 100-foot-wide canopy and roots spreading the same distance. Native to Japan, Korea and China, the Chinese elm (Ulmus parvifolia), also called the lacebark elm, can grow more than 3 feet each year, topping out at 60 to 80 feet tall. It is hardy in USDA zones 5 through 9. It resists, but is not immune to, Dutch elm disease."}, {"url": "http://www.ehow.com/facts_7154086_fast-do-elm-trees-grow_.html", "passage_text": "Siberian Elm. The Siberian elm (Ulmus pumila) is fast-growing, which means it adds 25 or more inches yearly, topping out at 40 to 60 feet tall and from 35 to 50 feet wide. It is hardy in USDA zones 5 through 9. Although this tree grows rapidly, its wood is brittle, making it prone to splitting during wind storms. Native to Japan, Korea and China, the Chinese elm (Ulmus parvifolia), also called the lacebark elm, can grow more than 3 feet each year, topping out at 60 to 80 feet tall. It is hardy in USDA zones 5 through 9. It resists, but is not immune to, Dutch elm disease."}, {"url": "http://www.fast-growing-trees.com/American-Elm-Tree.htm", "passage_text": "BEST ANSWER: It depends on where exactly you live in California. The American Elm Tree can't withstand the heat outside of zone 9. http://www.fast-growing-trees.com/ZoneMap.htmThey have a very high drought tolerance. They require an average amount of water. "}, {"url": "http://homeguides.sfgate.com/fast-chinese-elm-tree-grow-77061.html", "passage_text": "Growth Rate. Capable of adding 12 to 36 inches of height per season, the Chinese elm is a very rapidly growing tree. It can attain an eventual height of 40 to 50 feet, and so potentially can reach full height in 15 years or so. Its spread is smaller, only 25 to 40 feet, giving it a round vase shape. As the name suggests, Chinese elm is native to the Far East, originating in China, Korea and Japan. It is a rapidly growing tree that eventually gains considerable height and, therefore, is useful as a shade tree, specimen tree or street tree. It also often is trained into bonsai."}, {"url": "http://homeguides.sfgate.com/american-elm-tree-37772.html", "passage_text": "The American elm (Ulmus americana), also commonly known as white elm, water elm or common elm, is a large deciduous tree grown across U.S. Department of Agriculture plant hardiness zones 2 through 9. "}, {"url": "http://www.ehow.com/how_2093381_grow-elm-tree.html", "passage_text": "North American settlers named the elm lady of the forest.. The fully mature elm tree can live up to 300 years. It grows to over 115 feet tall with a diameter of 10 feet or more. Elms have been widely planted. The American elm is majestic and famous for its dappled shade and vase-like shape. "}, {"url": "http://www.ipm.iastate.edu/ipm/hortnews/1995/3-24-1995/fast.html", "passage_text": "Trees are also competing with a stand of grass for water and nutrients. Trees were 10 feet tall (approximately 1 1/2 inches caliper) at establishment. Trees were ranked by their actual growth rate in the first 10 years after planting. Trees rated as fast growing were at least 25 feet tall after 10 years. These included the American Elm (Ulmus americana), Silver Maple (Acer saccharinum), and the Sycamore (Platanus occidentalis). Moderately fast growing trees measured 18 to 25 feet tall"}]