[{"url": "http://www.enotes.com/homework-help/why-important-vote-396048", "passage_text": "(Answer #4). Why I think it is important to vote is because only if you have played your part in the democratic process do you have any right to comment on the actions that the politicians in power are taking."}, {"url": "http://study.com/articles/10_Reasons_Why_College_Students_Should_Vote.html", "passage_text": "1. Just as you've been told since elementary school, voting is an important right we have a duty to exercise. Many governments around the world allow citizens no part in electing officials. You do have the opportunity to help select government leaders, and the health of our democracy relies on your participation."}, {"url": "http://www.elections.ca/content.aspx?section=vot&dir=yth/bas/why&document=index&lang=e", "passage_text": "1 The right to vote is a fundamental democratic right that is protected by the Canadian Charter of Rights and Freedoms. 2  It is the cornerstone of democracy. 3  When we vote, we choose the representatives who will make the laws and policies that govern how we live together."}, {"url": "http://www.annenbergclassroom.org/speakout/path-to-the-presidency-why-is-it-important-to-vote", "passage_text": "Colby/Bellellive Henderson I think that it is important to vote because it helps get your voice out and who you want into office. 1/1/2013 Montgomery/Texas Hunter B. Metzger/Montgomery Democracy is a huge part of our nation. It is all based off of our votes."}, {"url": "http://www.studymode.com/essays/Why-It's-Important-To-Vote-183503.html", "passage_text": "Voting is important because it’s not only a right but also a privilege. Voting lets you express your ideas and opinion on issues in our country. This allows you to learn were the candidate’s stand on certain issues in the world today. Voting is the most powerful way to express your ideas and opinions."}, {"url": "http://www.buzzle.com/articles/why-is-it-important-to-vote.html", "passage_text": "This article shares some insights on why is it important to vote. It will help you understand its importance in a democratic society. Advertisement. By this definition, voting is a privilege, right and duty of each and every component of a democratic system, i.e., us, the people."}, {"url": "http://www.enotes.com/homework-help/why-important-vote-396048", "passage_text": "So there must be some other reason why it is important to vote. To me, voting is a sign that you believe in your democracy and that you feel that it is a worthwhile and important thing. Therefore, every time you vote, it is like you are declaring that you believe in your country."}]