[{"url": "https://en.wikipedia.org/wiki/Apicomplexa", "passage_text": "The Apicomplexa comprise the bulk of what used to be called the Sporozoa, a group of parasitic protozoans, in general without flagella, cilia, or pseudopods. Most of the Apicomplexa are motile however, by use of a gliding mechanism that uses adhesions and small static myosin motors."}, {"url": "https://en.wikipedia.org/wiki/Apicomplexa", "passage_text": "The Apicomplexa (also called Apicomplexia) are a large phylum of parasitic protists. Most of them possess a unique form of organelle that comprises a type of plastid called an apicoplast, and an apical complex structure. The organelle is an adaptation that the organism applies in penetration of a host cell."}, {"url": "http://www.tulane.edu/~wiser/protozoology/notes/api.html", "passage_text": "A defining characteristic of the apicomplexa is a group of organelles found at one end--called the apical end--of the organism. This 'apical complex' includes secretory organelles known as micronemes and rhoptries, polar rings composed of microtubules, and in some species a conoid which lies within the polar rings."}, {"url": "http://tolweb.org/Apicomplexa/", "passage_text": "It is estimated that out of a probable 1.2 - 10 million apicomplexan species, only about 0.1% have been named and described to date (Adl et al., 2007). As a group, apicomplexans are complex organisms that exhibit a wide variety of morphological shapes depending on their genus and lifecycle stage."}, {"url": "http://www.britannica.com/science/apicomplexan", "passage_text": "Apicomplexan, also called sporozoan, any protozoan of the (typically) spore-producing phylum Apicomplexa, which is called by some authorities Sporozoa. All apicomplexans are parasitic and lack contractile vacuoles and locomotor processes."}, {"url": "http://microbewiki.kenyon.edu/index.php/Apicomplex", "passage_text": "Apicomplexa is a phylum made up almost entirely of parasites. Apicomplexans are distinguished by their unique method of entering host cells. Apicomplexan parasites cause a number of serious illnesses, such as babesiosis in dogs and cattle, leucocytozoonosis in birds, and most significantly malaria in humans."}, {"url": "http://www.thefreedictionary.com/Apicomplexan", "passage_text": "ap·i·com·plex·an. n. Any of a phylum (Apicomplexa) of protozoans that have a group of organelles and other structures located in the apical end of the cell. Apicomplexans are parasitic in animals and include the organisms that cause malaria and toxoplasmosis."}]