[{"url": "https://en.wikipedia.org/wiki/Kiln", "passage_text": "1 This type of kiln is generally a multi-car design and is used for processing whitewares, technical ceramics and refractories in batches. 2  Depending upon size and mass of ware, shuttle kilns may be equipped with car moving devices to transfer fired and unfired ware in and out of the kiln. "}, {"url": "https://www.goshen.edu/art/DeptPgs/rework.html", "passage_text": "They not only made pottery from the clay. They built a kiln and wood fired the pots in the kiln. Eric Good Kaufmann, their teacher, is an accomplished potter and teaches art at Bethany Christian High School, Goshen, Indiana, USA. Mr. Kaufmann is an alumnus, class of '97, Goshen College. PROCESS to rework good clay that becomes too dry to use."}, {"url": "http://www.answers.com/Q/What_is_the_name_of_the_oven_in_which_pottery_is_fired", "passage_text": "If a piece does not have the words ovenproof proceed with caution. Although all pottery is kiln-fired, that does NOT mean that it can saf … ely cope with the (much lower) temperatures in a domestic oven. (The reason that non-ovenproof ware cracks in an oven is: (i) expansion takes place too fast; and (ii) there may be a residual water content that expands into steam. First turn off the oven.  If the fire is because of grease spewing, then cover it up with a pan to smother it.  If it won't go out then fires should be doused with baking s … oda or a fire extinguisher-but not water on grease or electrical fires. 3 people found this useful."}, {"url": "https://en.wikipedia.org/wiki/Pottery", "passage_text": "Pottery is the ceramic material which makes up pottery wares, of which major types include earthenware, stoneware and porcelain. Creation of ceramic pottery takes place in workshops that are also called called potteries. Pottery also refers to the art or craft of a potter or the manufacture of pottery. A dictionary definition is simply objects of fired clays. 1 Glaze fired is the final stage of some pottery making. 2  A glaze may be applied to the bisque form and the object can be decorated in several ways. 3  After this the object is glazed fired, which causes the glaze material to melt, then adhere to the object."}, {"url": "http://www.hotkilns.com/sites/default/files/pdf/Spec-Ceramic-Process_0.pdf", "passage_text": "Apply the kiln wash to the thickness of a postcard. The pur-pose of kiln wash is to prevent any glaze that drips from ware from sticking to the floor or shelves. If dripping should occur, remove dripping and cover the spot with new kiln wash. Kiln wash is a powder mixed with wa-ter to a light creamy consistency. The Ceramic Process Firing Tips material in your clay besides quartz, so it is not always that important to account for the quartz while the kiln is heating up. The structure of unfired clay is full of pores and non-glass bound particles, so it can withstand the expansion of a few of its quartz particles."}, {"url": "http://depts.washington.edu/matseed/mse_resources/Webpage/Ceramics/ceramics.htm", "passage_text": "Ceramics are generally made by taking mixtures of clay, earthen elements, powders, and water and shaping them into desired forms. Once the ceramic has been shaped, it is fired in a high temperature oven known as a kiln. Often, ceramics are covered in decorative, waterproof, paint-like substances known as glazes. Ceramics are classified as inorganic and nonmetallic materials that are essential to our daily lifestyle. Ceramic and materials engineers are the people who design the processes in which these products can be made, create new types of ceramic products, and find different uses for ceramic products in everyday life."}, {"url": "http://www.hotkilns.com/sites/default/files/pdf/Spec-Ceramic-Process_0.pdf", "passage_text": "Heat shock, which is usually catastrophic, is something that can happen in the kiln or may occur gradually over time.In truth, simply test-firing the kiln and the ware to be fired is usually enough to deal with the complexity of the process. Every kiln and kiln-load fires differently, and a new kiln is no exception. The Ceramic Process Firing Tips material in your clay besides quartz, so it is not always that important to account for the quartz while the kiln is heating up. The structure of unfired clay is full of pores and non-glass bound particles, so it can withstand the expansion of a few of its quartz particles."}, {"url": "https://en.wikipedia.org/wiki/Pottery", "passage_text": "Pottery is made by forming a clay body into objects of a required shape and heating them to high temperatures in a kiln which removes all the water from the clay, which induces reactions that lead to permanent changes including increasing their strength and hardening and setting their shape. 1 Glaze fired is the final stage of some pottery making. 2  A glaze may be applied to the bisque form and the object can be decorated in several ways. 3  After this the object is glazed fired, which causes the glaze material to melt, then adhere to the object."}, {"url": "https://en.wikipedia.org/wiki/Oven", "passage_text": "1 A kiln is a high-temperature oven used in wood drying, ceramics and cement manufacturing to convert mineral feedstock (in the form of clay or calcium or aluminum rocks) into a glassier, more solid form. 1 Ceramic oven: The ceramic oven is an oven constructed of clay or any other ceramic material and takes different forms depending on the culture. 2  The Indians refer to it as a tandoor, and use it for cooking. 3  They can be dated back as far as 3,000 BC, and they have been argued to have their origins in the Indus Valley."}]