[{"url": "http://www.chem.latech.edu/~deddy/chem121/Carbohydrates.htm", "passage_text": "In a D sugar, the hydroxy functional group is on the right side of the asymmetric carbon atom. D-glyceraldehyde (D for dextrorotatory) rotates light to the right. D-Glucose is an aldohexose with four stereogenic centers stacked on top of one another. It is also referred to as dextrose, grape sugar, or blood sugar. It is a ketohexose. Glucose and fructose are formed in equal amounts when sucrose is hydrolyzed by the enzyme invertase or by heating with dilute acid; the resulting equimolar mixture of fructose and glucose, called invert sugar, is the major component of honey. Fructose is a reducing sugar."}, {"url": "http://www.answers.com/Q/Glucose_is_an_aldohexose_what_does_this_mean", "passage_text": "exists and is an alternate of. Merge this question into. Split and merge into it. Answer by Halfmoonkick. Confidence votes 81. Glucose is an aldohexose means that Glucose is a carbohydrate where it's molecular structure has 6 sides. It is the glucose level (the amount of it) in your blood. Added 2/17/11: Glucose, which can also be listed as GLU on a lab report, is a chemical name for SUGAR."}, {"url": "http://www.audioenglish.org/dictionary/aldohexose.htm", "passage_text": "A monosaccharide sugar having six carbon atoms and an aldehyde group. Classified under: Nouns denoting substances. Hypernyms (aldohexose is a kind of...): hexose (a monosaccharide that contains six carbon atoms per molecule). aldose (a monosaccharide sugar that contains the aldehyde group or is hemiacetal). Hyponyms (each of the following is a kind of aldohexose): glucose (a monosaccharide sugar that has several forms; an important source of physiological energy)."}, {"url": "https://answers.yahoo.com/question/index?qid=20070913074406AAzVcbz", "passage_text": "· just now. Report Abuse. Yes they are; one is an aldehyde and the a ketone in the simplest structure that can be drawn. The aldehyde on Carbon 1 or 6, then ketone on Carbon 2 or 5; that puts them into the carbohydrate or sugar class, no ketone on any other Carbon in the chain. Best Answer: Aldoses, which have an aldehyde group on the first carbon atom, and ketoses, which typically have a ketone group on the second."}, {"url": "http://www.chem.latech.edu/~deddy/chem121/Carbohydrates.htm", "passage_text": "A monosaccharide with an aldehyde group is referred to as an aldose. A 3 carbon sugar is a triose, a 4 carbon sugar is a tetrose, and so on. Combining these designates such sugars as an aldotetrose or a ketopentose. For example, an aldotetrose is a four-carbon sugar that contains an aldehyde functional group. The following table indicates the designation of a monosaccharide based on the number of carbon atoms in the molecule and functional group. It is a ketohexose. Glucose and fructose are formed in equal amounts when sucrose is hydrolyzed by the enzyme invertase or by heating with dilute acid; the resulting equimolar mixture of fructose and glucose, called invert sugar, is the major component of honey. Fructose is a reducing sugar."}, {"url": "http://www.thefreedictionary.com/aldohexose", "passage_text": "Noun. 1. aldohexose-a monosaccharide sugar having six carbon atoms and an aldehyde group. hexose-a monosaccharide that contains six carbon atoms per molecule. aldose-a monosaccharide sugar that contains the aldehyde group or is hemiacetal. aldohexose. n. 1. (Elements & Compounds) any aldose containing six carbon atoms, such as glucose or mannose. Thesaurus AntonymsRelated WordsSynonymsLegend:"}, {"url": "http://www.audioenglish.org/dictionary/aldohexose.htm", "passage_text": "• ALDOHEXOSE (noun). The noun ALDOHEXOSE has 1 sense: 1. a monosaccharide sugar having six carbon atoms and an aldehyde group. Familiarity information: ALDOHEXOSE used as a noun is very rare. aldose (a monosaccharide sugar that contains the aldehyde group or is hemiacetal). Hyponyms (each of the following is a kind of aldohexose): glucose (a monosaccharide sugar that has several forms; an important source of physiological energy)."}, {"url": "https://en.wikipedia.org/wiki/Aldohexose", "passage_text": "- Galactose. - Talose. The chemist Emil Fischer is said to have devised the following mnemonic device for remembering the order given above, which corresponds to the configurations about the chiral centers when ordered as 3-bit binary strings: All alt ruists gl adly ma ke gu m i n gal lon ta nks. "}]