[{"url": "https://answers.yahoo.com/question/index?qid=20130925071505AAdZTPq", "passage_text": "Report Abuse. The only skin or peel I eat of the squash is yellow summer squash and zucchini. Just wash them very well before cooking and eating. Also you can slice and eat them raw in a salad or use with a dip. There are many varieties of squash that have tougher skin or peel. They are not good for eating the skin only the meat or flesh of the squash. Mama Jazzy Geri · 2 years ago."}, {"url": "http://healthyeating.sfgate.com/butternut-squash-health-benefits-4923.html", "passage_text": "Butternut squash resembles a cream-colored elongated bell that's described as tasting sweet, nutty and a little like a sweet potato. Unlike other winter squash, butternut’s skin is thin and easy to peel, but it can also simply be cut in half and roasted with the skin intact."}, {"url": "http://thescienceofeating.com/2015/01/12/benefits-of-butternut-squash/", "passage_text": "Unlike other winter squash, butternut’s skin is thin and easy to peel, but it can easily be cut in half and roasted with the skin intact, providing simple preparation with significant nutrition in the form of vitamin A, vitamin C and fiber. Butternut squash contains both soluble and insoluble dietary fiber. "}, {"url": "http://www.chowhound.com/post/peel-butternut-squash-748009", "passage_text": "In the fall, I buy extraordinary kabocha squash from a farmer at my farmer's market. At his stand he has samples with a big sign advising consumers if you aren't going to eat the skin, keep your hands off the samples. As an aside, you would be amazed by the differences in Kabocha flavor. And you know--he is right. Plus when I make long cooked winter stews of grain and squash, leaving the skin on helps keep more structure in the squash. Now I'm making something with butternut squash. The squashes in my possession are also fully organic."}, {"url": "http://www.wholeliving.com/134734/power-foods-butternut-squash", "passage_text": "Like all members of the gourd family (which includes pumpkin, melon, and cucumber), butternut squash is technically a fruit because it contains seeds. Cut into its pale, yellow-beige hard skin, though, and you'll discover a vibrant flesh that's much denser than that of its relatives. Most winter squash is available late into the fall. Store whole butternut squash in a cool, dry place (not the refrigerator) with plenty of ventilation; it should keep for up to three months. Cut squash will stay fresh for up to a week, wrapped, in the fridge."}, {"url": "http://healthiestfoods.co.uk/how-to-cook-butternut-squash", "passage_text": "Butternut squash skin is edible and actually quite healthy as it’s full of fiber and many of the best antioxidants in butternut are found just under the skin. Steaming butternut squash will make the skin quite soft and if you blend it up for a spicy Thai butternut soup like this you won’t even notice it. Once it is halved, pull out the seeds with your fingers and keep them if you’d like to lightly fry them up while the squash is cooking. While raw hulless pumpkin seeds are a lot easier to eat, you can lightly fry butternut squash seeds with their hulls in a little coconut oil and seasoning for a few minutes."}, {"url": "http://ohmyveggies.com/a-guide-to-winter-squash/", "passage_text": "Some winter squash should be peeled (butternut and spaghetti are two examples), while others have edible skin (like delicata and sweet dumpling). Squash with inedible skin can either be peeled before cooking or after. All squash should have pulp and seeds removed before cooking. While winter squash can be steamed or even sauteed, I prefer to roast it. You can cut it in half, into cubes, into rings or into wedges and bake at 400 degrees for 40-50 minutes. "}, {"url": "http://healthiestfoods.co.uk/how-to-cook-butternut-squash", "passage_text": "There is a method for cooking butternut squash that will retain the most vitamins, minerals, antioxidants and other nutrition when you eat them. This way of preparing butternut squash is also quicker and simpler than any other I’ve tried. Personally I think it tastes the best too. Once it is halved, pull out the seeds with your fingers and keep them if you’d like to lightly fry them up while the squash is cooking. While raw hulless pumpkin seeds are a lot easier to eat, you can lightly fry butternut squash seeds with their hulls in a little coconut oil and seasoning for a few minutes."}, {"url": "http://healthyeating.sfgate.com/roasting-eating-healthy-butternut-squash-3514.html", "passage_text": "The foil holds moisture in, preventing the butternut squash from drying. Roast the butternut squash until a knife meets no resistance when you insert it in the thickest point of the flesh. Allow the squash to cool after cooking so that you can comfortably touch its skin. Cut and Season. Wash the butternut squash and dry it with a clean towel. Use a sharp knife to cut the butternut squash in half horizontally. Cut the two pieces in half vertically. Remove and discard the seeds from the two lower quarters of the butternut squash with a spoon."}, {"url": "https://www.sharecare.com/health/healthy-skin/how-eating-butternut-squash-skin", "passage_text": "Next time you shop for skin care products, make your way to the produce aisle and pick up some squash. Butternut would be ideal. No, you don't rub it on your face. The veggie works from the inside out, thanks to its rich supply of pH-balancing and skin-cell-turnover-boosting vitamin A. Butternut squash is one of the best things you can eat to get more vitamin A from your diet. And you want more, because vitamin A and healthy skin go hand in hand. "}]