[{"url": "http://www.answers.com/Q/What_do_the_colors_on_the_Peruvian_flag_mean", "passage_text": "Red and white colors of the flag symbolize the golden period of Inca Empire in Peru. The red stripes also represent the blood shed in the fight for Peruvian freedom, while the white stands for peace and justice. "}, {"url": "http://www.worldflags101.com/p/peru-flag.aspx", "passage_text": "Peruvian Flag Meaning: The red stripes represent the blood spilt for Peruvian freedom; while the white stands for peace. Peruvian Flag History: The Peruvian flag was adopted on February 25, 1825, making it one of the world's oldest flags. Peru gained independence from Spain on July 28, 1821 and a red and white flag diagonally divided into four sections was adopted."}, {"url": "http://www.mapsofworld.com/flags/peru-flag.html", "passage_text": "The National Flag of Peru integrates three colorful vertical bands with equal dimensions.In the Peru flag picture the stripes on the left side and right side bands are tinged with red and the middle stripe is white. The main difference between the national flag of Peru and its State flag is that the later contains the emblem of the national coat of arms in the central point of the flag. The proportion of the Peruvian flag is described as 2:3."}, {"url": "http://peruflag.facts.co/peruflagof/peruflag.php", "passage_text": "Peru Flag-Information. The flag of Peru is a vertical triband with red outer bands and a single white middle band. Flags displayed by the government incorporate the national coat of arms in the centre. Peru Flag colors symbolism."}, {"url": "http://www.inside-peru.com/peruvian-flag.html", "passage_text": "Home-Facts About Peru-Peruvian Flag. The Peruvian flag is composed of three stripes of equal width running from top to bottom, one white and two red. As is the case of most national flags, it is rectangular with a ration of three to two."}, {"url": "http://www.worldflags101.com/p/peru-flag.aspx", "passage_text": "Country: Peru. Proportions: 2:3. Peruvian Flag Description: The flag of Peru consists of three equal sized vertical stripes-the left and right stripes are red and the middle one is white. Peru also has a state flag which incorporates the shield from the national coat of arms in the middle of the flag. Peruvian Flag History: The Peruvian flag was adopted on February 25, 1825, making it one of the world's oldest flags. Peru gained independence from Spain on July 28, 1821 and a red and white flag diagonally divided into four sections was adopted."}, {"url": "http://www.worldatlas.com/webimage/flags/countrys/samerica/peru.htm", "passage_text": "Peru Flag and Description. Buy this flag, or any country flag here. DESCRIPTION. The current state flag of Peru was officially adopted on February 25, 1825. The colors are said to symbolize the Incas and their lasting impact on the country. Also, red and white are the colors chosen by Jose de San Martin, The Liberator. The coat of arms (not shown on the national flag) features a llama and chichona tree, important symbols of Peru, and a centered cornucopia representing prosperity. all Country Flags here!"}, {"url": "https://en.wikipedia.org/wiki/Flag_of_Peru", "passage_text": "The flag of Peru was adopted by the government of Peru in 1824. It is a vertical triband with red outer bands and a single white middle band. Depending on its use, it may be defaced with different emblems, and has different names. Flag day in Peru is celebrated on June 7, the anniversary of the Battle of Arica."}, {"url": "http://www.worldatlas.com/webimage/countrys/samerica/peru/peflags.htm", "passage_text": "Larger Peru flag Large selection of South American flags Peru Coat of Arms: The Peruvian coat of arms is largely dominated by the central shield, which is divided into three sections. The upper left section show the national animal of Peru, the vincuna. The upper right section shows the cinchona tree. Peru Flag: The current state flag of Peru was officially adopted on February 25, 1825. The colors are said to symbolize the Incas and their lasting impact on the country"}]