[{"url": "https://technet.microsoft.com/en-us/library/aa997490(v=exchg.65).aspx", "passage_text": "Although all servers communicate with each other directly within a routing group, this is not the case when a server in one routing group needs to communicate with a server in another routing group. To allow servers to communicate with servers in other routing groups, you need to create a routing group connector. Capitalizes on configurations where all of the servers in a routing group have the same network connectivity to the servers in other routing groups. Can add complexity in large organizations where all servers communicate in a point-to-point fashion."}, {"url": "https://support.microsoft.com/en-us/kb/822929", "passage_text": "You can use Routing Group connectors to connect two or more Exchange Server routing groups. Routing Group connectors are preferred over Simple Mail Transfer Protocol (SMTP) connectors because Routing Group connectors are easy to configure and automatically pass on Exchange Server link state information. 1 Expand the Routing Groups container, and then either create a new routing group or double-click a pre-existing routing group. 2  Right-click the Connectors container, point to New, and then click Routing Group Connector. 3  On the General tab, in the Name box, type a name for this Routing Group connector."}, {"url": "https://technet.microsoft.com/en-us/library/aa997490(v=exchg.65).aspx", "passage_text": "When you create a routing group connector, you have the option of either keeping all the servers as bridgehead servers for that connector, or specifying that only a selected set of servers act as bridgehead servers for that connector. The following table compares the advantages of each approach. Capitalizes on configurations where all of the servers in a routing group have the same network connectivity to the servers in other routing groups. Can add complexity in large organizations where all servers communicate in a point-to-point fashion."}, {"url": "http://searchexchange.techtarget.com/tip/Understanding-Exchange-Server-routing-groups", "passage_text": "Introduction. Exchange Server routing groups have one job: to keep your network bandwidth links from being overrun by replication traffic. In this article, I explain how Exchange routing groups work, issues to watch out for when using them, and routing group topology options that are available to you. How routing groups work. If you have routing groups implemented, you can have one routing group at the corporate office and a separate routing group at a remote office. The routing groups would be joined by a routing group connector. That connector would designate one server in each routing group as a bridgehead server"}, {"url": "https://support.microsoft.com/en-us/kb/822941", "passage_text": "You can also use an SMTP connector to connect Exchange Server routing groups in scenarios where routing group connectors are not suitable. For example, you can use an SMTP connector if the link between the routing groups is not permanent or if the link has to traverse the Internet. SMTP connectors are slightly more complex to configure than routing group connectors and do not automatically pass on Exchange Server link-state information. With SMTP and X.400, you have to make sure that the connector is configured correctly at the source and the destination; however, you can use routing group connectors only to connect routing groups. Routing group connectors cannot connect a routing group to a mail system that is not running Microsoft Exchange Server."}, {"url": "https://support.microsoft.com/en-us/kb/822929", "passage_text": "1 -or-. 2  To select a server in the remote routing group that you want to connect to, click Any local server can send mail over this connector click the Remote Bridgehead tab, click Add, click the required server and the SMTP virtual server instance that you want to use, and then click OK. 1 Expand the Routing Groups container, and then either create a new routing group or double-click a pre-existing routing group. 2  Right-click the Connectors container, point to New, and then click Routing Group Connector. 3  On the General tab, in the Name box, type a name for this Routing Group connector."}, {"url": "https://technet.microsoft.com/en-us/library/bb124848(v=exchg.65).aspx", "passage_text": "A routing group is a logical collection of servers used to control mail flow and public folder referrals. In a routing group, all servers communicate and transfer messages directly to one another. In a routing group, all servers communicate and transfer messages directly to one another, as follows: A user in your Exchange organization uses a mail client to send mail to another user. Takes advantage of those configurations where all the servers in a routing group have the same network connectivity to the servers in other routing groups. Only a select few servers in a routing group. Makes troubleshooting message flow easier because there are limited points of contact between"}, {"url": "https://support.microsoft.com/en-us/kb/822929", "passage_text": "1 To select a server in the remote routing group that you want to connect to, click Any local server can send mail over this connector click the Remote Bridgehead tab, click Add, click the required server and the SMTP virtual server instance that you want to use, and then click OK. 1 Expand the Routing Groups container, and then either create a new routing group or double-click a pre-existing routing group. 2  Right-click the Connectors container, point to New, and then click Routing Group Connector. 3  On the General tab, in the Name box, type a name for this Routing Group connector."}]