[{"url": "http://www.ehow.com/about_4614434_what-definition-nutrition.html", "passage_text": "Danilin/iStock/Getty Images. Nutrition can be defined as food or nourishment needed to keep an organism growing, healthy and viable. It also refers to the process of providing or receiving food or other life-supporting substances."}, {"url": "http://www.merriam-webster.com/dictionary/nutrition", "passage_text": "Medical Definition of NUTRITION. 1. : the act or process of nourishing or being nourished; specifically: the sum of the processes by which an animal or plant takes in and utilizes food substances. 2. : food 1, nourishment."}, {"url": "http://www.yourdictionary.com/nutrition", "passage_text": "nutrition. noun. 1  The process of nourishing or being nourished, especially the process by which a living organism assimilates food and uses it for growth and for replacement of tissues. 2  The science or study that deals with food and nourishment, especially in humans."}, {"url": "http://www.medicalnewstoday.com/articles/160774.php", "passage_text": "Nutrition, nourishment, or aliment, is the supply of materials-food-required by organisms and cells to stay alive. In science and human medicine, nutrition is the science or practice of consuming and utilizing foods."}, {"url": "http://www.merriam-webster.com/dictionary/nutrition", "passage_text": "Full Definition of NUTRITION. 1. : the act or process of nourishing or being nourished; specifically: the sum of the processes by which an animal or plant takes in and utilizes food substances. 2. : nourishment 1."}, {"url": "http://www.healthguidance.org/entry/9975/1/What-Is-the-Definition-of-Nutrition.html", "passage_text": "What is the definition of nutrition? Nutrition is the sum total of the processes involved in the taking in and the utilization of food substances by which growth, repair and maintenance of the body are accomplished."}, {"url": "http://www.who.int/topics/nutrition/en/", "passage_text": "Nutrition is the intake of food, considered in relation to the body’s dietary needs. Good nutrition – an adequate, well balanced diet combined with regular physical activity – is a cornerstone of good health."}]