[{"url": "http://flexiblelearning.auckland.ac.nz/rocks_minerals/rocks/gneiss.html", "passage_text": "Gneiss is a high grade metamorphic rock, meaning that it has been subjected to higher temperatures and pressures than schist. It is formed by the metamorphosis of granite, or sedimentary rock. Gneiss displays distinct foliation, representing alternating layers composed of different minerals. Gneiss is typically associated with major mountain building episodes. During these episodes, sedimentary or felsic igneous rocks are subjected to great pressures and temperatures generated by great depth of burial, proximity to igneous intrusions and the tectonic forces generated during such episodes."}, {"url": "http://geology.com/rocks/gneiss.shtml", "passage_text": "Although gneiss is not defined by its composition, most specimens have bands of feldspar and quartz grains in an interlocking texture. These bands are usually light in color and alternate with bands of darker-colored minerals with platy or elongate habits. It is a high-grade metamorphic rock in which mineral grains recrystallized under intense heat and pressure. This alteration increased the size of the mineral grains and segregated them into bands, a transformation which made the rock and its minerals more stable in their metamorphic environment."}, {"url": "https://en.wikipedia.org/wiki/Gneiss", "passage_text": "Gneiss /ˈnaɪs/ is a common and widely distributed type of rock formed by high-grade regional metamorphic processes from pre-existing formations that were originally either igneous or sedimentary rocks. It is often foliated (composed of layers of sheet-like planar structures). The banding is developed under high temperature and pressure conditions. The minerals are arranged into layers that appear as bands in cross section. The appearance of layers, called compositional banding, occurs because the layers, or bands, are of different composition."}, {"url": "http://uncyclopedia.wikia.com/wiki/Gneiss", "passage_text": "Gneiss (Rockius Basementus) is a commonplace rock and is one of the most commonplace sedimentary rocks. It is without doubt one of the nicest rocks too, hence where the rock derives it's name from. Gneiss is composed of a number of minerals such as quartz which commonly forms alongside it's silicate by-product olivine, biotite, mica and anticline to a certain extent."}, {"url": "http://geology.about.com/od/rocks/ig/metrockindex/rocpicgneiss.htm", "passage_text": "It means a type of rock texture, not a composition. (more below). Gneiss is a typical rock type formed by regional metamorphism, in which a sedimentary or igneous rock has been deeply buried and subjected to high temperatures and pressures."}, {"url": "http://study.com/academy/lesson/gneiss-rock-definition-uses-formation.html", "passage_text": "Lesson Summary. Gneiss is a high-grade, metamorphic rock that forms as a result of regional metamorphism. It forms from quartz, feldspar, mica, and other clay mineral-rich rocks that are exposed to high temperature and high pressure metamorphic conditions. Gneiss rocks exhibit a unique form of foliation known as gneissic banding, which are thicker bands of foliation than most metamorphic rocks display. It is one of the features that helps differentiate gneiss from other foliated rocks."}, {"url": "http://hyperphysics.phy-astr.gsu.edu/hbase/geophys/gneiss2.html", "passage_text": "Gneiss is a metamorphic rock form characterized by banding caused by segregation of different types of rock, typically light and dark silicates. Rather than an indication of specific mineral composition, the term is an indication of texture. The gneissic texture refers to the segregation of light and dark minerals. Some gneisses will split along the layers of materials, but most break in an irregular fashion. Gneiss often forms from the metamorphism of granite or diorite. The most common minerals in gneiss are quartz, potassium feldspar, and sodium feldspar. Smaller amounts of muscovite, biotite and hornblende are common. Gneiss can also form from gabbro or shale"}, {"url": "http://geomaps.wr.usgs.gov/parks/rxmin/rock3.html", "passage_text": "Metamorphic rocks. Metamorphic rocks started out as some other type of rock, but have been substantially changed from their original igneous, sedimentary, or earlier metamorphic form. Metamorphic rocks form when rocks are subjected to high heat, high pressure, hot, mineral-rich fluids or, more commonly, some combination of these factors. "}, {"url": "http://study.com/academy/lesson/gneiss-rock-definition-uses-formation.html", "passage_text": "While not as well-known as granite, marble, or even slate as a building material, gneiss can be used for similar applications. Gneisses, particularly the shinier varieties, can be found in countertops, flooring, and other artistic building materials. Gneiss rocks exhibit a unique form of foliation known as gneissic banding, which are thicker bands of foliation than most metamorphic rocks display. It is one of the features that helps differentiate gneiss from other foliated rocks."}]