[{"url": "http://pubs.usgs.gov/fs/la-wetlands/", "passage_text": "Atchafalaya delta, Louisiana. [ larger version ]. The swamps and marshes of coastal Louisiana are among the Nation's most fragile and valuable wetlands, vital not only to recreational and agricultural interests but also the State's more than $1 billion per year seafood industry. The State's wetlands extend as much as 130 kilometers inland and along the coast for about 300 kilometers. Not all the wetlands are receding; in fact some wetlands are stable, and others are growing. But, at the present net rate of wetlands loss, Louisiana will have lost this crucial habitat in about 200 years."}, {"url": "http://savelouisianaswetlands.weebly.com/", "passage_text": "Louisiana’s coastal wetlands are disappearing at an alarming rate. According to lacoast.gov, Louisiana has lost nearly 3,000 square miles of land in the past 75 years (www.lacoast.gov). That is 3,000 square miles of Louisiana’s coast that has disappeared into the Gulf of Mexico. According to a study done by americaswetland.com in 2005, Louisiana continues to lose on average 37.8 square miles of wetlands every year (www.americaswetland.com). The wetlands now provide the coast of Louisiana with almost no protection. The rebuilding of these wetlands will aid in the process of slowing down storm surge. With out the wetlands Louisiana’s coastal cities have to take the brunt of the storm surge, which turns out to be a deadly scenario."}, {"url": "http://savelouisianaswetlands.weebly.com/", "passage_text": "One main reason why Louisiana’s coastal wetlands should be preserved is because they provide a natural buffer against storm surge. The wetlands are the first to combat the storm surge. The wetlands will reduce the height and intensity of the waves associated with storm surge. The wetlands now provide the coast of Louisiana with almost no protection. The rebuilding of these wetlands will aid in the process of slowing down storm surge. With out the wetlands Louisiana’s coastal cities have to take the brunt of the storm surge, which turns out to be a deadly scenario."}, {"url": "http://www.nasa.gov/audience/foreducators/k-4/features/F_Disappearing_Wetlands.html", "passage_text": "Focusing on the diminishing marshes and swamps of the Louisiana bayou, Disappearing Wetlands utilizes NASA satellite imagery as it helps students better understand what wetlands are, why they are disappearing, and how to improve ecosystems management. "}, {"url": "http://www.mississippiriverdelta.org/discover-the-delta/what-went-wrong/", "passage_text": "The Mississippi River Delta is disappearing at an astonishing rate: A football field of wetlands vanishes into open water almost every hour. Since the 1930s, Louisiana has lost nearly 1,900 square miles of land, an area roughly equivalent in size to the state of Delaware. Many factors have led to the delta's collapse. "}, {"url": "http://www2.southeastern.edu/orgs/oilspill/wetlands.html", "passage_text": "Wetlands House Oil & Gas Infrastructure. Louisiana is home to the natural gas and oil industry with a value exceeding $16 billion a year. 18% of U.S. oil and 24% of natural gas originates and is processed or transported through Louisiana coastal wetlands. One fourth of the nation’s energy supply depends on the support facilities in south Louisiana."}, {"url": "http://www.lacoast.gov/new/About/Default.aspx", "passage_text": "Unfortunately, this fragile environment is disappearing at an alarming rate. Louisiana has lost up to 40 square miles of marsh per year for several decades – that’s 80 percent of the nation’s annual coastal wetland loss. To date, Louisiana has already lost coastal land area equal to the size of the state of Delaware. Wetlands also provide habitat for a variety of wildlife. Coastal Louisiana lands are the breeding grounds and nurseries for thousands of species of aquatic life, land animals, and birds of all kinds – including our national symbol, the bald eagle."}, {"url": "http://www2.southeastern.edu/orgs/oilspill/wetlands.html", "passage_text": "While Louisiana has 40% of the country’s wetlands, over 90% of the total coastal marsh loss in the continental U.S.’s occurs in the state. It is estimated that between 25-35 square miles of wetlands are lost each year and more than 1,000,000 acres have been lost since the turn of the century. 18% of U.S. oil and 24% of natural gas originates and is processed or transported through Louisiana coastal wetlands. One fourth of the nation’s energy supply depends on the support facilities in south Louisiana."}, {"url": "https://en.wikipedia.org/wiki/Wetlands_of_Louisiana", "passage_text": "The wetlands of Louisiana are water-saturated coastal and swamp regions of southern Louisiana. Although these areas make up a very small percentage of the total land found in the United States, southern Louisiana contains 40 to 45 percent of the wetlands found in the lower states. This is because Louisiana is the drainage gateway to the Gulf of Mexico for the Lower Mississippi Regional Watershed. The Lower Mississippi Regional Watershed drains more than 24 million acres (97,000 km 2) in seven states from southern Illinois to the Gulf of Mexico"}]