[{"url": "https://answers.yahoo.com/question/index?qid=20080102174208AAP8B5L", "passage_text": "Best Answer: YOu can drink caffeinated coffee when you're pregnant. You can safely have up to 300 mg. of caffeine per day when you're pregnant. this is the equivalent of 6 or 7 colas, or 2 or 3 cups of coffee. Unless the pregnancy is high risk this doesn't harm the fetus at all."}, {"url": "http://www.babycentre.co.uk/x536392/is-it-safe-to-drink-coffee-during-pregnancy", "passage_text": "Yes, you can still enjoy a mug of coffee every now and then during your pregnancy. Just make sure that you don't have more than 200mg of caffeine in a day. That's two mugs of instant coffee or one mug of brewed coffee. If you regularly have more than 200mg of caffeine a day while you're pregnant, you'll have a higher risk of miscarriage or having a baby with a low birth weight. Babies born with a low birth weight are at increased risk of health problems when they get older."}, {"url": "http://americanpregnancy.org/pregnancy-health/caffeine-during-pregnancy/", "passage_text": "Remember, caffeine is a stimulant and can keep both you and your baby awake. Caffeine is found in more than just coffee. Caffeine is not only found in coffee but also in tea, soda, chocolate, and even some over-the-counter medications that relieve headaches. Be aware of what you consume."}, {"url": "http://www.webmd.boots.com/pregnancy/guide/10-pregnancy-health-myths-exposed", "passage_text": "You should give up coffee. FALSE. Actually, you can enjoy a brew, but you need to watch quantity. Too much caffeine (also found in tea, cola and chocolate) can increase your risk of miscarriage. The NHS recommends a limit of 200mg a day of caffeine, the equivalent of two mugs of instant coffee."}, {"url": "http://www.babycenter.ca/x536392/is-it-safe-to-drink-coffee-during-pregnancy", "passage_text": "Yes, you can still enjoy a cup of coffee during your pregnancy. But you might want to limit yourself to 300mg of caffeine a day, which is three cups of instant coffee or one cup of brewed coffee. The main concern with coffee is its caffeine content."}]