[{"url": "http://www.ehow.com/about_5035393_moleskin.html", "passage_text": "While moleskin refers to the skin of an animal called a mole, that is not the most common meaning for the term. The most common is a heavy napped cotton twill fabric that is extremely soft. The fabric is woven and then sheared to cause a soft, short pile on one side of the fabric."}, {"url": "https://en.wikipedia.org/wiki/Moleskine", "passage_text": "Inside view of a Moleskine ruled notebook; the elastic band is visible on the right, as is the bookmark in the center. Moleskine SpA (BIT: MSK) is an Italian company based in Milan, co-founded by the Italian designer Maria Sebregondi. Moleskine production includes notebooks, planners, diaries, sketchbooks, and albums."}, {"url": "http://www.ehow.com/about_5035393_moleskin.html", "passage_text": "Moleskin as a cinematic term is actually completely different. Moleskin in the cinema refers to a flesh colored piece of adhesive fabric that is used to cover private areas of a body and simulate nakedness. This form of moleskin may or may not be made from the actual moleskin fabric."}, {"url": "http://www.ehow.com/about_5035393_moleskin.html", "passage_text": "The term moleskin may sound vaguely gross and bring to mind thoughts of animal cruelty and furs, but moleskin is actually a natural fabric made of cotton. Moleskin clothing and first aid bandages are common usages for this material."}, {"url": "http://www.moleskine.com/us/", "passage_text": "MOLESKINE STORE. Shop online and hear about all the new releases from Moleskine. Shop online and hear about all the new releases from Moleskine. Connect and experience the meshing of passions. Connect and experience the meshing of passions. Moleskine Stories, limited editions, special projects and events. Moleskine Stories, limited editions, ..."}, {"url": "http://painting.about.com/od/artglossarym/g/defmoleskine.htm", "passage_text": "Licensed to About.com, Inc. Definition: Moleskine is a brand of notebook that comes in various formats, sizes, and papers. The covers are usually black leather (some special editions have silk, for instance, and diaries come in red) and there is an elastic band for keeping it closed."}]