[{"url": "http://www.heritage.org/initiatives/rule-of-law/judicial-activism/cases/roe-v-wade", "passage_text": "Roe v. Wade. In a 7-2 opinion by Justice Harry Blackmun, the Court ruled that a right to privacy under the Due Process Clause of the Fourteenth Amendment guarantees a woman’s right to an abortion."}, {"url": "http://endroe.org/roeanalysis", "passage_text": "Introduction. In Roe v. Wade, 410 U.S. 113 (1973), the Supreme Court held that a pregnant woman has a fundamental privacy right to obtain an abortion. 410 U.S. at 153, 155-56. The Court’s opinion was written by Justice Harry Blackmun."}, {"url": "http://www.religioustolerance.org/aborvw.htm", "passage_text": "The Supreme Court based its abortion access decision on the right of personal privacy which the court finds implicit in the Due Process Clause of the Fourteenth Amendment to the U.S. Constitution."}, {"url": "http://womenshistory.about.com/od/laws/a/equal_protect_4.htm", "passage_text": "Roe v. Wade. In 1973, the U.S. Supreme Court found in Roe v. Wade that the Fourteenth Amendment restricted, on the basis of the Due Process clause, the government's ability to restrict or prohibit abortions."}, {"url": "http://www.heritage.org/initiatives/rule-of-law/judicial-activism/cases/roe-v-wade", "passage_text": "Summary. In a 7-2 opinion by Justice Harry Blackmun, the Court ruled that a right to privacy under the Due Process Clause of the Fourteenth Amendment guarantees a woman’s right to an abortion."}, {"url": "http://www.answers.com/Q/How_is_Roe_v_Wade_relate_to_the_Fourteenth_Amendment", "passage_text": "The decision in Roe v. Wade, (1973) rests on the judicial concept of  Substantive Due Process , which holds that the Fourteenth Amendment Due Process Clause is intended to protect all unenumerated rights considered fundamental and implicit in the concept of ordered liberty, among these the right to privacy."}, {"url": "http://womenshistory.about.com/od/abortionuslegal/p/roe_v_wade.htm", "passage_text": "The Supreme Court chose to base its decision on the Fourteenth Amendment. Roe v. Wade was decided primarily on the Due Process Clause of the Fourteenth Amendment to the United States Constitution. A criminal statute that did not take into account the stage of pregnancy or other interests than the life of the mother was deemed a violation of Due Process."}]