[{"url": "https://en.wikipedia.org/wiki/Whale_shark", "passage_text": "The whale shark (Rhincodon typus) is a slow-moving filter feeding shark and the largest known extant fish species. The largest confirmed individual had a length of 12.65 m (41.50 ft) and a weight of approximately 21.5 metric tons (47,000 lb), and unconfirmed reports of considerably larger whale sharks exist. The name whale shark comes from the fish's size, being as large as some species of whales and also that it is a filter feeder like baleen whales."}, {"url": "http://www.worldwildlife.org/species/whale-shark", "passage_text": "Oceans. The whale shark is the biggest fish and shark in the world. These gentle marine giants roam the oceans around the globe, generally alone. However, large numbers of whale sharks often gather in areas with abundant plankton food—making them prime tourist attractions. "}, {"url": "http://www.ehow.com/info_10065229_whale-sharks-important-ecosystem.html", "passage_text": "Feeding. Although they are the largest fish in the world, whale sharks feed on tiny animals and plants including plankton, small crustaceans, tuna and squids. A whale shark filter feeds by opening its mouth, pushing out its jaws and sucking in water. Description. Whale sharks have streamlined bodies, flattened heads, large gills and a wide mouth near the front of the snout. Their skin ranges between gray and brown and features white spots and pale stripes in checkerboard-like pattern. Their stomachs are white"}, {"url": "http://www.whalefacts.org/why-are-whales-important/", "passage_text": "1 Whales play an important role in stabilizing the aquatic food chain and reproduction of other species. 2  As more whales are killed the food distribution in the ocean becomes destabilized and causes changes in the food supply of many other kinds of marine life. As you can see whales play an extremely important role in our ecosystem by maintaining a stable food chain and feeding other marine animals that help provide a cleaner atmosphere as well as helping growing economies increase their awareness and profitability through tourism."}, {"url": "http://www.sharksavers.org/en/education/the-value-of-sharks/sharks-role-in-the-ocean/", "passage_text": "Sharks play a very important role in the oceans in a way that an average fish does not. Sharks are at the top of the food chain in virtually every part of every ocean. In that role, they keep populations of other fish healthy and in proper proportion for their ecosystem. "}, {"url": "http://www.answers.com/Q/What_is_so_important_about_whale_sharks", "passage_text": "A whale shark is a shark, the largest living fish in the world,  yet it is a filter feeder.   Even though it doesnt have the same diet as a shark, it is a shark.   …  its a shark but is named a whale shark for its large stature and  feeding    It's a shark. The only thing it got in common with whales is its  size.  A Whale Shark is a fish and a member of the shark family."}, {"url": "http://www.whalefacts.org/why-are-whales-important/", "passage_text": "Four reasons why whales are important to our environment: 1  Whales play an important role in stabilizing the aquatic food chain and reproduction of other species. 2  As more whales are killed the food distribution in the ocean becomes destabilized and causes changes in the food supply of many other kinds of marine life. As you can see whales play an extremely important role in our ecosystem by maintaining a stable food chain and feeding other marine animals that help provide a cleaner atmosphere as well as helping growing economies increase their awareness and profitability through tourism."}, {"url": "http://www.nature.com/scitable/blog/saltwater-science/why_whaling_why_save_the", "passage_text": "Ecology. Whales have an important role to play in nutrient cycling. Their poo, for example, makes organic carbon more accessible to smaller organisms. Even a dead whale carcass is important in carbon cycling, particularly the export of carbon to the deep sea. "}, {"url": "http://www.ehow.com/info_10065229_whale-sharks-important-ecosystem.html", "passage_text": "The whale shark is the largest fish in the world and can be more than 40 feet long. They are found in warm seas throughout the world. They are a docile species that feeds on plankton and other tiny sea creatures. Description. Whale sharks have streamlined bodies, flattened heads, large gills and a wide mouth near the front of the snout. Their skin ranges between gray and brown and features white spots and pale stripes in checkerboard-like pattern. Their stomachs are white"}]