[{"url": "http://www.greymatterresearch.com/index_files/Prayer.htm", "passage_text": "A number of things: The amount of time spent in prayer: pastors who are very satisfied spend an average of 56 minutes a day in prayer; those who are somewhat satisfied average 43 minutes; those who are somewhat dissatisfied average 29 minutes, and those who are very dissatisfied average 21 minutes. Only 9% of pastors under age 45 are very satisfied with their prayer life, along with 13% of those 45 to 59 years old. But 30% of all pastors 60 or older are very satisfied with their prayer life more than three times the proportion of younger ministers."}, {"url": "http://www.churchleaders.com/pastors/pastor-articles/150915-u-s-statistics-on-prayer.html", "passage_text": "Their median amount of prayer time per day is 30 minutes. During that time, a typical pastor spends 12 minutes with prayer requests, 8 in quiet time, 7 giving thanks, 7 more in praise, and 5 confessing sin. Like Us. A collection of statistics and illustrations on the prevalence and efficacy of prayer in the United States. Barna research says slightly more than four out of five adults in the U.S. (84%) claim they had prayed in the past week. That has been the case since Barna began tracking the frequency of prayer in 1993."}, {"url": "http://thomrainer.com/2013/06/how-much-time-do-pastors-spend-preparing-a-sermon/", "passage_text": "1 70% of pastors’ sermon preparation time is the narrow range of 10 to 18 hours per sermon. 2  Keep in mind that these numbers represent sermon preparation time for just one sermon. 3  Many pastors spend 30 or more hours in preparing messages each week. 4  The median time for sermon preparation in this study is 13 hours. 1 The median time for sermon preparation in this study is 13 hours. 2  That means that half of the respondents gave a number under 13 hours; the other half gave a number greater than 13 hours. 3  Most of the respondents who gave a response under 12 hours indicated they were bivocational pastors."}, {"url": "http://thomrainer.com/2013/06/how-much-time-do-pastors-spend-preparing-a-sermon/", "passage_text": "1 Most pastors responded with a range of hours. 2  I took the midpoint of each range for my data. 3  70% of pastors’ sermon preparation time is the narrow range of 10 to 18 hours per sermon. 4  Keep in mind that these numbers represent sermon preparation time for just one sermon. 1 The median time for sermon preparation in this study is 13 hours. 2  That means that half of the respondents gave a number under 13 hours; the other half gave a number greater than 13 hours. 3  Most of the respondents who gave a response under 12 hours indicated they were bivocational pastors."}, {"url": "http://www.bpnews.net/20918", "passage_text": "Pastors also were asked how long they spend in prayer each day, and what they pray for. The median amount of prayer time per day is 30 minutes, with a mean of 39 minutes. Although younger ministers are much less satisfied with their prayer lives, they spend about as much time in prayer per day as do older ministers. How do ministers spend their prayer time? For the average minister, it looks like this: 32 percent in petition/requests, 20 percent in quiet time or listening to God, 18 percent in thanksgiving, 17 percent in praise and 14 percent in confession."}, {"url": "http://thomrainer.com/2013/06/how-much-time-do-pastors-spend-preparing-a-sermon/", "passage_text": "1 Many pastors spend 30 or more hours in preparing messages each week. 2  The median time for sermon preparation in this study is 13 hours. 3  That means that half of the respondents gave a number under 13 hours; the other half gave a number greater than 13 hours. 1 The median time for sermon preparation in this study is 13 hours. 2  That means that half of the respondents gave a number under 13 hours; the other half gave a number greater than 13 hours. 3  Most of the respondents who gave a response under 12 hours indicated they were bivocational pastors."}, {"url": "http://maranathalife.com/lifeline/stats.htm", "passage_text": "Ninety-five percent of pastors do not regularly pray with their spouses. Eighty percent of pastors surveyed spend less than fifteen minutes a day in prayer. Seventy percent said the only time they spend studying the Word is when they are preparing their sermons. 1 Eighty percent of pastors surveyed spend less than fifteen minutes a day in prayer. 2  Seventy percent said the only time they spend studying the Word is when they are preparing their sermons. 3  Find other pastors who you can enter into covenant with."}, {"url": "http://www.bpnews.net/20918", "passage_text": "If these percentages are applied to the average amount of time ministers spend in prayer, the typical pastor spends 12 minutes per day with prayer requests, eight minutes in quiet time, seven minutes giving thanks, seven minutes in praise and five minutes confessing sin. How do ministers spend their prayer time? For the average minister, it looks like this: 32 percent in petition/requests, 20 percent in quiet time or listening to God, 18 percent in thanksgiving, 17 percent in praise and 14 percent in confession."}]