[{"url": "http://www.answers.com/Q/How_long_does_it_take_for_vegie_seeds_to_grow", "passage_text": "Confidence votes 40.5K. That depends on the type of vegetable, but most will germinate in within a few days to up to two weeks. Seeds like carrot, some herbs, parsnips and celery take up to three weeks. Time to harvest also varies but between 8-14 weeks is a common time from sowing to harvest."}, {"url": "http://www.gardeningknowhow.com/edible/vegetables/corn/how-to-grow-corn.htm", "passage_text": "You might be wondering, “how long does it take for corn to grow?” There are many different varieties of corn and a couple of different methods for corn planting, so you can plant 60-day, 70-day or 90-day corn. When most people think about how to grow corn, they are thinking in terms of their own private stash of corn."}, {"url": "http://www.ehow.com/about_5375089_long-grow-vegetables.html", "passage_text": "They will be ready to pick in about 30 days. You can even get a second harvest if you start your second set of seeds indoors in March and place them in the garden after you harvest the first bunch. Beans. There are many types of beans, but they basically all take approximately the same time to grow. Pole bean seeds can be planted directly in the garden around a pole or trellis in May in the northern gardening zones, and they will be ready to harvest in about 60 to 70 days."}, {"url": "http://www.your-vegetable-gardening-helper.com/growing-vegetables.html", "passage_text": "When growing vegetables consider the amount of light your area will be getting. Most vegetables need an average of 6 hours of sunlight. Do not be too concerned if your garden plot is in a shady area as leaf and root vegetables (lettuce, peas, carrots, kale, swiss chard) will tolerate some shade."}, {"url": "http://www.ehow.com/about_5375089_long-grow-vegetables.html", "passage_text": "There are many varieties of corn and it will take between two to a little over three months to harvest, depending on the variety. Lettuce, spinach and some varieties of potatoes also take about two to three months to grow to maturity. Potatoes. Potatoes are very easy vegetables to grow and you can grow them from the potatoes in your kitchen. There are many varieties, and each will be ready to harvest at different times."}, {"url": "http://www.foodispower.org/grow-your-own-food/", "passage_text": "We’ll get you started with a list of different vegetables, how long they take to grow, and what climate zones they grow best in. “Dried” beans (examples include: pinto, navy, kidney, black-eyed, garbanzo, adzuki, hyacinth, and mung beans). Maturation Time: 90 to 150 frost-free days."}]