[{"url": "http://education.seattlepi.com/size-comparisons-bacteria-amoeba-animal-plant-cells-4966.html", "passage_text": "Bacterial Cells. Bacterial cells are very small-about 10 times smaller than most plant and animal cells. Most bacterial cells range in size from 0.2 to 10 microns or micrometers (0.0000079 to 0.00039 inches). Common Escherichia coli, or E.coli, bacteria are rod-shaped bacteria, 1 micron by 2 microns long. Animal Cells. Most animal cells are between 10 to 100 microns in size. The size depends partially on the type of cell and its function. Red blood cells, which don't need to divide and replicate are only about 8 microns in diameter, while many muscle and nerve cells are thin, spindly and extremely long."}, {"url": "http://education.seattlepi.com/size-comparisons-bacteria-amoeba-animal-plant-cells-4966.html", "passage_text": "Smaller cells have a large surface area compared to cell volume, while larger cells have a reduced ratio of surface area to volume. One reason why bacterial cells are so small is that they need a large surface area to cell volume to take in nutrients. Bacteria accumulate nutrients from the environment by diffusion. Animal Cells. Most animal cells are between 10 to 100 microns in size. The size depends partially on the type of cell and its function. Red blood cells, which don't need to divide and replicate are only about 8 microns in diameter, while many muscle and nerve cells are thin, spindly and extremely long."}, {"url": "http://science.howstuffworks.com/life/cellular-microscopic/cell1.htm", "passage_text": "Bacteria are about the simplest cells that exist today. A bacteria is a single, self-contained, living cell. An Escherichia coli bacteria (or E. coli bacteria) is typical -- it is about one-hundredth the size of a human cell (maybe a micron long and one-tenth of a micron wide), so it is invisible without a microscope."}, {"url": "http://science.howstuffworks.com/life/cellular-microscopic/cell1.htm", "passage_text": "Cell Parts. Your body is made of about 10 trillion cells. The largest human cells are about the diameter of a human hair, but most human cells are smaller -- perhaps one-tenth of the diameter of a human hair. Run your fingers through your hair now and look at a single strand. A bacteria is a single, self-contained, living cell. An Escherichia coli bacteria (or E. coli bacteria) is typical -- it is about one-hundredth the size of a human cell (maybe a micron long and one-tenth of a micron wide), so it is invisible without a microscope."}, {"url": "http://www.abc.net.au/science/articles/2010/03/30/2859247.htm", "passage_text": "Bacteria are cells too, but they're only about one tenth the size of our cells. And viruses are smaller again — they're about a hundredth the size of our cells. So we're about 100,000 times bigger than our cells, a million times bigger than bacteria, and 10 million times bigger than your average virus! If a virus was the size of a five cent coin, a bacterium would be the size of a dinner plate, and you would be 200 kilometres tall! The average human cell is about 10 -15 micrometres (µm), which means we're about 100,000 times bigger than our cells. If your cells were the size of a five cent piece, you'd be two kilometres tall."}, {"url": "http://www.answers.com/Q/How_big_is_a_human_cell_compared_to_a_bacteria_cell", "passage_text": "How big is a bacteria compared to a human cell? The size of a typical bacterial cell is 0.5-5.0 micrometers, a average human cell is 10 micrometers. 8 people found this useful. Edit. The consensus among biologists is that only 5 to 10% of the trillions of cells in our bodies are human. The rest are alien cells: yeast, fungi, bacteria, viruses. Some are ess … ential to our digestion, some are potentially dangerous, and most are just enjoying lunch"}, {"url": "http://www.cellsalive.com/howbig.htm", "passage_text": "The head of a pin is about 2mm in diameter. Use this animation to compare the relative sizes of cells and organisms sitting on a pinhead. Nearly invisible without magnification, dust mites dwarf pollen grains and human cells. In turn, bacteria and viruses are even smaller."}, {"url": "http://www.answers.com/Q/How_does_the_size_of_the_average_bacteria_cell_compared_with_the_size_of_the_human_cheek_cells", "passage_text": "The size of a typical bacterial cell is 0.5-5.0 micrometers, a average human cell is 10 micrometers. E coli bacterium are about 2.0 micrometers in length and .25 to 1  micrometer in diameter. In comparison, a red blood cell is about  six to eight micrometers in diameter and … a thickness that ranges  from .8 to 1 micrometer in the center to 2 to 2.5 micrometers at  the thickest point."}]