[{"url": "http://constitution.laws.com/3rd-amendment", "passage_text": "The Third Amendment Defined: The Third Amendment is a part of the Bill of Rights, which are the first 10 Amendments to the United States Constitution and the framework to elucidate upon the freedoms of the individual. The Bill of Rights were proposed and sent to the states by the first session of the First Congress. The Third Amendment prohibits, during times of peace, the quartering of soldiers on private property and in private homes without the consent of the owner. The Third Amendment makes the quartering of soldiers permissible only in times of conflict or war and then only according to the area’s particular laws."}, {"url": "http://www.ducksters.com/history/us_government/third_amendment.php", "passage_text": "From the Constitution. Here is the text of the Third Amendment from the Constitution: No Soldier shall, in time of peace be quartered in any house, without the consent of the owner, nor in time of war, but in a manner to be prescribed by law."}, {"url": "https://en.wikipedia.org/wiki/Third_Amendment_to_the_United_States_Constitution", "passage_text": "Third Amendment to the United States Constitution. From Wikipedia, the free encyclopedia. No Soldier shall, in time of peace be quartered in any house, without the consent of the Owner, nor in time of war, but in a manner to be prescribed by law. The Third Amendment was introduced in Congress in 1789 by James Madison as a part of the United States Bill of Rights, in response to Anti-Federalist objections to the new"}, {"url": "http://kids.laws.com/third-amendment", "passage_text": "A Guide to the Third Amendment. The Third Amendment, or Amendment III of the United States Constitution is the section of the Bill of Rights that prohibits soldiers from temporarily residing in private homes during peace time without getting the permission and consent of the owner. The text of the Third Amendment which is found in the United States Constitution and the Bill of Rights is the following: No soldier shall, in time of peace be quartered in any house, without the consent of the owner, nor in time of war, but in manner to be prescribed by law. History of"}, {"url": "http://kids.laws.com/third-amendment", "passage_text": "The Text of the Third Amendment. The text of the Third Amendment which is found in the United States Constitution and the Bill of Rights is the following: No soldier shall, in time of peace be quartered in any house, without the consent of the owner, nor in time of war, but in manner to be prescribed by law. History of the Third Amendment."}, {"url": "http://www.revolutionary-war-and-beyond.com/third-amendment.html", "passage_text": "The Third Amendment reads like this: No Soldier shall, in time of peace be quartered in any house, without the consent of the Owner, nor in time of war, but in a manner to be prescribed by law.. This law was extremely important to our Founding Fathers, but it is not so well known to modern Americans. "}, {"url": "https://www.law.cornell.edu/constitution/third_amendment", "passage_text": "Third Amendment. Described by some as “ a preference for the Civilian over the Military ,” the Third Amendment forbids the forcible housing of military personnel in a citizen’s home during peacetime and requires the process to be “prescribed by law” in times of war. Amendment III. No soldier shall, in time of peace be quartered in any house, without the consent of the owner, nor in time of war, but in a manner to be prescribed by law."}, {"url": "http://law.jrank.org/pages/10765/Third-Amendment.html", "passage_text": "court quartering rights soldiers. No Soldier shall, in time of peace be quartered in any house, without the consent of the Owner, nor in time of war, but in a manner to be prescribed by law. The Third Amendment to the U.S. Constitution reads: No Soldier shall, in time of peace be quartered in any house, without the consent of the Owner, nor in time of war, but in a manner to be prescribed by law. Ratified in 1791, the Third Amendment to the U.S. Constitution sets forth two basic requirements."}, {"url": "https://en.wikipedia.org/wiki/Third_Amendment_to_the_United_States_Constitution", "passage_text": "The Third Amendment (Amendment III) to the United States Constitution places restrictions on the quartering of soldiers in private homes without the owner's consent, forbidding the practice in peacetime. The Third Amendment was introduced in Congress in 1789 by James Madison as a part of the United States Bill of Rights, in response to Anti-Federalist objections to the new Constitution."}, {"url": "http://legal-dictionary.thefreedictionary.com/Third+Amendment", "passage_text": "Third Amendment. The Third Amendment to the U.S. Constitution reads: No Soldier shall, in time of peace be quartered in any house, without the consent of the Owner, nor in time of war, but in a manner to be prescribed by law. Ratified in 1791, the Third Amendment to the U.S. Constitution sets forth two basic requirements. During times of peace, the military may not house its troops in private residences without the consent of the owners."}]