[{"url": "http://smallbusiness.chron.com/cost-accounting-practices-service-industry-42794.html", "passage_text": "Cost accounting describes several different systems of approximating the cost of producing certain products in the manufacturing industry, or completing certain jobs in the service industry. Activity-based costing (ABC) is the most widely adopted and well-known method of cost accounting. A third system, process costing, is used by companies that have consistent production of the exact same product or service. A cost is assigned to processing units. That cost becomes either the input of the next division in the production chain or part of the final product."}, {"url": "http://yourbusiness.azcentral.com/cost-accounting-practices-service-industry-26920.html", "passage_text": "However, cost accounting techniques also can help service industry companies understand their costs. One difference in cost accounting practices for service companies is the terminology and construction of the cost of goods sold account. "}, {"url": "http://www.investopedia.com/terms/c/cost-accounting.asp", "passage_text": "DEFINITION of 'Cost Accounting'. Cost accounting is a type of accounting process that aims to capture a company's costs of production by assessing the input costs of each step of production as well as fixed costs such as depreciation of capital equipment. Financial accounting is a different representation of costs and financial performance that includes a company's assets and liabilities. Cost accounting can be most beneficial as a tool for management in budgeting and in setting up cost control programs, which can improve net margins for the company in the future."}, {"url": "https://en.wikipedia.org/wiki/Cost_accounting", "passage_text": "Cost accounting is a process of collecting, analyzing, summarizing and evaluating various alternative courses of action. Its goal is to advise the management on the most appropriate course of action based on the cost efficiency and capability. Cost accounting provides the detailed cost information that management needs to control current operations and plan for the future."}, {"url": "http://www.business-literacy.com/financial-concepts/cost-of-goods-sold-cost-of-services/", "passage_text": "Definition: Cost of Goods Sold, (COGS), can also be referred to as cost of sales (COS), cost of revenue, or product cost, depending on if it is a product or service. It includes all the costs directly involved in producing a product or delivering a service. These costs can include labor, material, and shipping."}, {"url": "https://en.wikipedia.org/wiki/Activity-based_costing", "passage_text": "From Wikipedia, the free encyclopedia. Activity-based costing (ABC) is a costing methodology that identifies activities in an organization and assigns the cost of each activity with resources to all products and services according to the actual consumption by each. "}, {"url": "http://www.accountingtools.com/overview-process-costing", "passage_text": "Process Costing Overview. Process costing is used when there is mass production of similar products, where the costs associated with individual units of output cannot be differentiated from each other. In other words, the cost of each product produced is assumed to be the same as the cost of every other product"}, {"url": "http://www.investopedia.com/terms/c/cost-accounting.asp", "passage_text": "While cost accounting is often used within a company to aid in decision making, financial accounting is what the outside investor community typically sees. Financial accounting is a different representation of costs and financial performance that includes a company's assets and liabilities. Cost accounting can be most beneficial as a tool for management in budgeting and in setting up cost control programs, which can improve net margins for the company in the future."}]