[{"url": "http://www.livius.org/articles/concept/procurator/", "passage_text": "Finally, it should be remarked that although the Roman historian Tacitus calls the governor of Judaea, Pontius Pilate, a procurator, he was in fact a prefect. This is proved by an inscription, which is discussed here. Procurator: Roman official, appointed by a magistrate or the emperor. The word 'procurator' is derived from the Latin verb procurare, which means 'to take care'. Rich Romans have always employed caretakers to administer large amounts of money or agricultural domains; usually, these procurators were freedmen"}, {"url": "http://www.biblestudytools.com/dictionary/procurator/", "passage_text": "xv.44) where Pilate is called procurator is not sufficient proof in view of this writer's carelessness in details of this sort. Josephus (Ant., XX, i, 2), however, employs epitropos (procurator) for the time of Claudius, and it is convenient to follow common usage and assume that this title was current from the first. Sometimes a province was governed by a procurator with the functions of a legatus. This was especially the case with the smaller provinces an the outlying districts of a larger province; and such is the relation in which Judea stood to Syria."}, {"url": "http://www.merriam-webster.com/dictionary/procurator", "passage_text": "Definition of PROCURATOR. 1. : one that manages another's affairs: agent. 2. : an officer of the Roman empire entrusted with management of the financial affairs of a province and often having administrative powers as agent of the emperor. — proc·u·ra·to·ri·al \\ˌprae-ˌprä-kyə-rə-ˈtȯr-ē\\ əl. Adjective see procurator defined for. KIDS. advertisement"}, {"url": "http://www.oxforddictionaries.com/definition/english/procurator", "passage_text": "1 Law An agent representing others in a court of law in countries retaining Roman civil law. Example sentences. 1  Nowhere in the flayed skin of Gruenewald grünewald is there a trace of The jesus who looked At pilate through his one good eye and informed The roman procurator that he would have no power were it not given from.  above 1.1 (In Scotland) a lawyer practising before the lower courts. Example sentences. 1  Performing the functions of a public prosecutor, a procurator also had responsibility for ‘overseeing legality’, which meant the operation of the courts and state administration."}, {"url": "https://en.wikipedia.org/wiki/Procurator", "passage_text": "1 Procurator (Roman) , the title of various officials of the Roman Empire. 2  Roman Procurators of Judaea Province, 44–70 AD. 3  Procurator (Teutonic Knights) , a position in the Monastic State of the Teutonic Knights. 4  Procurator of San Marco, the second most prestigious life appointment in the Republic of Venice. Procurator (with procuracy or procuratorate referring to the office itself) may refer to: 1  Procurator (Roman) , the title of various officials of the Roman Empire. 2  Roman Procurators of Judaea Province, 44–70 AD. 3  Procurator (Teutonic Knights) , a position in the Monastic State of the Teutonic Knights"}, {"url": "http://www.newadvent.org/cathen/12451a.htm", "passage_text": "Procurator. Help support New Advent and get the full contents of this website as an instant download. Includes the Catholic Encyclopedia, Church Fathers, Summa, Bible and more  all for only $19.99... A person who manages the affairs of another by virtue of a charge received from him. "}, {"url": "http://www.merriam-webster.com/dictionary/procuratorate", "passage_text": "Definition of PROCURATORATE. : the office or functions of a procurator. ADVERTISEMENT. This word doesn't usually appear in our free dictionary, but the definition from our premium Unabridged Dictionary is offered here on a limited basis. Note that some information is displayed differently in the Unabridged. "}, {"url": "http://www.audioenglish.org/dictionary/procurator.htm", "passage_text": "The noun PROCURATOR has 2 senses: 1. a person authorized to act for another. 2. (ancient Rome) someone employed by the Roman Emperor to manage finance and taxes. Familiarity information: PROCURATOR used as a noun is rare. "}]