[{"url": "http://www.answers.com/Q/How_many_languages_are_spoken_in_Liberia", "passage_text": "Bandi is the most spoken language in Liberia. Over 100,000 people in Liberia speak it. Followed by Bassa, spoken by over 403,300 people in Liberia. Then Dan, spoken by ove … r 175,000 people in Liberia. In order of the percentage of the population which speak them they are: German (63.7%), French (20.4%), Italian (6.5%) and Roman … sh (0.5%). Different languages are spoken in different parts of the country."}, {"url": "https://en.wikipedia.org/wiki/Liberian_Kreyol_language", "passage_text": "From Wikipedia, the free encyclopedia. Kreyol (Liberian Pidgin English, Vernacular Liberian English) is an English-based pidgin spoken in Liberia. It was spoken by 1,500,000 people as a second language (1984 census) which is about 70% of the population in that time. There are regional dialects such as the Kru Pidgin English used by the Kru fishermen. Liberian Kreyol language developed from Liberian Interior Pidgin English, the Liberian version of West African Pidgin English though it has been significantly influenced by Liberian Settler English. Its phonology owes much to Liberia's Niger–Congo languages. It has been analyzed having a post-creole continuum"}, {"url": "http://www.answers.com/Q/What_language_is_spoken_in_Liberia", "passage_text": "Making the world better, one answer at a time. Bandi is the most spoken language in Liberia. Over 100,000 people in Liberia speak it. Followed by Bassa, spoken by over 403,300 people in Liberia. Then Dan, spoken by over 175,000 people in Liberia. What is the top spoken language spoken in Europe? Russian-it is spoken by approximately 125 million people (mainly in European Russia, Ukraine, Belarus, Estonia, and Latvia)."}, {"url": "https://www.alsintl.com/resources/languages/Liberian/", "passage_text": "Development of Liberian Pidgin English (Liberian Kreyol). The unique form of English spoken in Liberia, known as Liberian Pidgin English or Liberian Kreyol language, was developed among the population of Americo-Liberians, the freed slaves who migrated to Liberia from the United States in the 19th century. The Liberian language soon evolved, developing distinct differences from Standard English thanks to the West African and French linguistic influences it came into contact with in Liberia. Since Liberia’s official founding in 1824, English has maintained its status as the most prominent language in the country."}, {"url": "https://www.alsintl.com/resources/languages/Liberian/", "passage_text": "Liberian Languages Today. Although English is the official Liberian language, the form of pidgin English native to the country (known as Liberian Pidgin English or Liberian Kreyol language) is spoken by approximately only 20 percent of the population. The Liberian language soon evolved, developing distinct differences from Standard English thanks to the West African and French linguistic influences it came into contact with in Liberia. Since Liberia’s official founding in 1824, English has maintained its status as the most prominent language in the country."}, {"url": "http://www.mapsofworld.com/liberia/facts.html", "passage_text": "The government of Liberia recognizes English as the official language. There are over thirty-one indigenous languages spoken in the country that include Bandi, Kpelle, Dan, Maninka, Loma, and Tajuasohn. Monrovia is the capital city of Liberia. It is named in honor of James Monroe, president of the United States. With an estimated population of 1,010,970, Monrovia is the most-populated city in the country."}, {"url": "https://en.wikipedia.org/wiki/Languages_of_Liberia", "passage_text": "Liberia is a multilingual country where more than thirty languages are spoken. English is the official language. None of the languages group forms a distinctive majority. These languages can be grouped in four language families: Mande, Kru, Mel, and the divergent language Gola."}, {"url": "https://www.alsintl.com/resources/languages/Liberian/", "passage_text": "The Liberian language has a unique history that dates back to the early 19th century, when the Republic of Liberia was founded by freed African-American slaves. Throughout the 1800s, Liberia served as the destination of resettlement for freed slaves, who brought the English language to their new homeland. The Liberian language soon evolved, developing distinct differences from Standard English thanks to the West African and French linguistic influences it came into contact with in Liberia. Since Liberia’s official founding in 1824, English has maintained its status as the most prominent language in the country."}]