[{"url": "http://medical-dictionary.thefreedictionary.com/Iris", "passage_text": "The periphery of the iris is continuous with the ciliary body and is connected to the cornea by the pectinate ligament. The iris divides the space between the lens and the cornea into an anterior and a posterior chamber. The involuntary muscle of the iris is composed of circular fibers and radiating fibers. In blue eyes the pigment cells are confined to the posterior surface of the iris, but in gray eyes, brown eyes, and black eyes the pigment cells appear in the anterior layer of epithelium and in the stroma. See also dilator pupillae, sphincter pupillae. iridic, adj. Fringe medicine."}, {"url": "http://www.medicinenet.com/script/main/art.asp?articlekey=10544", "passage_text": "Ciliary muscle: A circular muscle that relaxes or tightens the zonules to enable the lens to change shape for focusing. The zonules are fibers that hold the lens suspended in position and enable it to change shape during accommodation. "}, {"url": "http://www.visionaware.org/info/your-eye-condition/eye-health/anatomy-of-the-eye/125", "passage_text": "In bright light, the iris closes (or constricts) and makes the pupil opening smaller to restrict the amount of light that enters your eye. The iris in bright light. In dim light, the iris opens (or dilates) and makes the pupil opening larger to increase the amount of light that enters your eye: The iris in dim light. In addition, it is the iris that determines your eye color. You can get a close-up look at different parts of the eye in this eye diagram from the National Institutes of Health. Diagram of the eye, viewed from the side. To understand this diagram of the eye, try to picture it as being split in two, like an apple that's been cut in half."}, {"url": "http://medical-dictionary.thefreedictionary.com/Iris", "passage_text": "an annular, colored membrane shaped like a disc, suspended in aqueous humor between the cornea and the crystalline lens of the eye and enclosing a circular pupil. Smooth muscle fibers of the iris contract and relax to allow more or less light to enter the eye through the pupil. In blue eyes the pigment cells are confined to the posterior surface of the iris, but in gray eyes, brown eyes, and black eyes the pigment cells appear in the anterior layer of epithelium and in the stroma. See also dilator pupillae, sphincter pupillae. iridic, adj. Fringe medicine."}, {"url": "https://en.wikipedia.org/wiki/Iris_(anatomy)", "passage_text": "For other uses, see Iris (disambiguation) . The iris (plural: irides or irises) is a thin, circular structure in the eye, responsible for controlling the diameter and size of the pupil and thus the amount of light reaching the retina. The iris develops from the anterior two layers of an embryonic neuroectoderm structure called the optic cup. The optic cup also produces the iris sphincter and dilator muscles."}, {"url": "http://www.medicinenet.com/script/main/art.asp?articlekey=9891", "passage_text": "Ciliary body: Part of the eye, the ciliary body is a circular structure just behind the iris composed of the ciliary muscle and ciliary processes which attach to the lens. The ciliary processes secrete the aqueous fluid, and the ciliary muscle modifies focus by changing the shape of the lens. "}, {"url": "http://www.healthline.com/human-body-maps/iris-eye", "passage_text": "The iris is a flat and ring-shaped membrane behind the cornea of the eye with an adjustable circular opening in the center called a pupil. This is the structure that provides an individual with eye color. Together with the pupil, the iris is responsible for regulating the amount of light that gets into the eye. Too much or too little light can hamper vision. The muscular iris moves to shrink the pupil if there is too much light and widen it if there is not enough. This is an involuntary function, controlled by the brain. The iris is made almost entirely of connective tissue and smooth muscle fibers. Despite a common belief, actual change in color of the iris rarely happens. While the color of an eye may appear to change, this is typically due to lighting changes or perception based off nearby colors"}, {"url": "https://en.wikipedia.org/wiki/Iris_(anatomy)", "passage_text": "The color of the iris gives the eye its color. In optical terms, the pupil is the eye's aperture and the iris is the diaphragm that serves as the aperture stop. The iris develops from the anterior two layers of an embryonic neuroectoderm structure called the optic cup. The optic cup also produces the iris sphincter and dilator muscles."}]