[{"url": "http://www.innermind.com/outerlimits/", "passage_text": "There is a big screen movie of Outer Limits in the works. It will be based on the Demon With a Glass Hand episode written by Harlan Ellison. Scott Derrickson and Robert Cargill are the writers, and Mark Victor is producing it. "}, {"url": "http://www.tv.com/shows/the-outer-limits-1963/", "passage_text": "8.0. By tacoman771, Oct 23, 2011. The outer limits is not as great as the twilight zone but it's still a great scifi classic. I consider the twilight zone the greatest scifi show of all time because of things like twist endings, morals, plots. The outer limits has these things but it just doesn't match the twilight zone. Unlike the twilight zone an outer limits episode is an hour so therefore it'll start off slower but ultimately they'll both challenge your assumptions. Their both great shows I personally like the twilight zone more. "}, {"url": "http://www.dvdjournal.com/reviews/o/outerlimits_os.shtml", "passage_text": "Anthology series such as The Outer Limits or The Twilight Zone have the advantage when it comes to characters who can be realistically and irrevocably changed by the events of a story. Even for The Outer Limits, Season One's closing story, The Forms of Things Unknown is a peculiar masterpiece. Its blend of gothic horror and Hitchcockian exhumation of sexual fear comes well crafted with Stefano's lyrical script, taut editing, and Conrad Hall's moody, sophisticated-for-TV cinematography."}, {"url": "http://www.imdb.com/title/tt0112111/reviews", "passage_text": "Author: GeoData. I viewed the original Outer Limits in real time, when first broadcast and have since viewed the entire original series again and again in re-runs and complete on DVD. I find the New Outer Limits WELL MORE than just a remake of old retread episodes, as some of the more adolescent commentators have suggested. Twilight Zone of the 90s. The Outer Limits is quite possibly, the best science fiction show since the X-Files. The Outer Limits is an original 1 hour paranormal show with actors making complex decisions in unusual circumstances. It explores how far people will go and how much terror is actually possible in life."}, {"url": "http://theouterlimits.wikia.com/wiki/The_Outer_Limits_(1963_TV_Series)", "passage_text": "[[[The Outer Limits (1963 TV series)|edit]]] Introduction Edit. Each show would begin with either a cold open or a preview clip, followed by narration by someone identifying himself as the Control Voice, which was played over visuals of an oscilloscope. The earlier and longer version of the narration ran as follows. [[[The Outer Limits (1963 TV series)|edit]]] Special effects Edit. The various monsters and creatures from the first season and most props were developed by a loose-knit group organized under the name Project Unlimited."}, {"url": "http://theouterlimits.wikia.com/wiki/The_Outer_Limits_(1963_TV_Series)", "passage_text": "The Outer Limits is an American television series that aired on ABC from 1963 to 1965. Similar in style to the earlier The Twilight Zone with more science fiction than fantasy stories, The Outer Limits is an anthology of discrete story episodes, sometimes with a plot twist at the end. [[[The Outer Limits (1963 TV series)|edit]]] Special effects Edit. The various monsters and creatures from the first season and most props were developed by a loose-knit group organized under the name Project Unlimited."}, {"url": "http://theouterlimits.wikia.com/wiki/The_Outer_Limits_(1963_TV_Series)", "passage_text": "[[[The Outer Limits (1963 TV series)|edit]]] Production information Edit. The Outer Limits originally was broadcast from 1963 to 1965 on the U.S. network ABC; in total, 49 episodes. It was one of many series influenced by The Twilight Zone and Science Fiction Theatre, though it ultimately proved influential in its own right. [[[The Outer Limits (1963 TV series)|edit]]] Special effects Edit. The various monsters and creatures from the first season and most props were developed by a loose-knit group organized under the name Project Unlimited."}, {"url": "http://www.comettv.com/", "passage_text": "November on COMET, look out for sci-fi hits like Species, Leviathan and Blood and Chocolate. Catch the science fiction series The Outer Limits weeknights at 8/7c followed by Stargate SG-1 weeknights at 10/9c. And discover rare sci-fi like The Eliminators, The Twonky and Solarbabies. So much sci-fi you may need a clone to watch it all. (Clones not included)."}, {"url": "http://www.imdb.com/title/tt0112111/reviews", "passage_text": "You name it, there's been a chilling tale of it on The Outer Limits. I highly recommend watching this for Twilight Zone, The Original Outer Limits, X-Files, Millennium, Poltergeist: The Legacy fans. You might not like each episode, but overall, the quality of the shows is very high. Twilight Zone of the 90s. The Outer Limits is quite possibly, the best science fiction show since the X-Files. The Outer Limits is an original 1 hour paranormal show with actors making complex decisions in unusual circumstances. It explores how far people will go and how much terror is actually possible in life."}, {"url": "http://www.youtube.com/channel/UC7DPMLGLwBBi1xIEmKjk93A", "passage_text": "Outer Limits Of Inner Truth Radio Show lastet opp • la ut et nyhetsbrev For 10 mnd siden. On Thursday, February 26th at 9 pm EST, the Outer Limits Of Inner Truth (www.outerlimitsradio.com) Radio Show will air a special 2-hour live broadcast to commemorate it’s one year Anniversary. The call in number for the show will be (347) 857-2406. Show link. http://www.blogtalkradio.com/examinedlife/2015/02/27/a-fo.."}]