[{"url": "http://www.care.com/housekeeping-housekeeper-cost-p1145-q7470.html", "passage_text": "About how much to charge: I don't know what state you live in, but if you're working for a surgeon living in a 6000 sq ft home, I would go with a minimum of $30 an hour, and do not bust your butt at going super fast. That is a lot of repetitive motion for the shoulders and believe me, bursitis will kick in. "}, {"url": "http://work.chron.com/much-livein-maid-earn-annually-11484.html", "passage_text": "Executive housekeepers, on the other hand, who would oversee other housekeepers, averaged $40,000 to $65,000 a year. The wide gaps in pay are likely due to variance in a family’s wealth and size of home. In 2011, maids averaged $21,440 a year, or 10,31 an hour, according to the Bureau of Labor Statistics. Because higher salaries — as often seen in medical facilities — can skew this figure, median wage is often a better indication of earning potential."}, {"url": "http://www.homeadvisor.com/cost/cleaning-services/housekeeping-services/", "passage_text": "Consider These 10 Housekeeping Cost Factors. If your housekeeping service charges by the hour, expect to pay $9 to $15 an hour, depending on the kind of community you live in. Small rural communities are often on the lower end of the scale due to a relatively low workload. Otherwise you could pay anywhere between $75 and $175 on a per visit basis for a housekeeper. While a housekeeping job can be priced on a number of scales, there are common factors. 1  Size – Your home's size, including the number of bedrooms and bathrooms, influences the cost significantly."}, {"url": "http://cars.costhelper.com/limousine.html", "passage_text": "1 Hourly charges are usually calculated in 15-minute increments, and overtime charges are usually much higher than the standard rate, starting around $130-$300 or more an hour. 2  It can be better to book a limo for a flat fee for the day than to run the risk of running over on a 2-, 3- or 4-hour rental. 1 Most companies have package prices for specific types of events. 2  For 4-8 hours for a wedding or a prom night, expect to pay at least $400-$600 for a 6-8 passenger limousine, and possibly $800-$1,800 or more depending on the type of vehicle and luxury options such as a mini bar, leather interior or video screen."}, {"url": "http://www.drive4me.com/faq/", "passage_text": "5. Q: What is the cost per hour for chauffeur and is there a minimum of hours? A: Our Drive4Me personal chauffeur services are $30.00 per hour with a minimum of 4 consecutive hours of service required. All taxes and fees are included in $30.00 per hour rate except Drive4Me personal chauffeur’s gratuity. We do have special coupons available on our website www.drive4me.com that could save you even more time and money starting from limousine or town car services to hiring a Drive4Me personal chauffeur."}, {"url": "http://cars.costhelper.com/limousine.html", "passage_text": "1 When gas costs soared over $3-$4 a gallon, many limousine companies added a 5-10 percent fuel surcharge for longer trips. 2  Hourly charges are usually calculated in 15-minute increments, and overtime charges are usually much higher than the standard rate, starting around $130-$300 or more an hour. 1 Most companies have package prices for specific types of events. 2  For 4-8 hours for a wedding or a prom night, expect to pay at least $400-$600 for a 6-8 passenger limousine, and possibly $800-$1,800 or more depending on the type of vehicle and luxury options such as a mini bar, leather interior or video screen."}, {"url": "https://answers.yahoo.com/question/index?qid=20090723180014AAMmC9m", "passage_text": "Next. Does anyone know about how much a chauffeur will cost to drive my kids to the same school which takes 5 minutes only in the mornings starting sept-June. Thanks. Add your answer. Source."}]