[{"url": "http://berniemacfoundation.org/about-sarcoidosis/", "passage_text": "Sarcoidosis is a disease which, despite many years of research, still has no known specific cause. Sarcoidosis is not a cancer and is not a contagious disease in some cases it seems to run in families. Medical textbooks twenty years ago listed the disease as being primarily one of African American women and patients of Scandinavian descent."}, {"url": "http://www.webmd.com/lung/understanding-sarcoidosis-basics", "passage_text": "Among African-Americans, the rate is higher. Sarcoidosis is not cancer; nor is it contagious. Although it can occur in families, it is not inherited. Usually the disease is not disabling; most people with sarcoidosis live normal lives. In fact, in the majority of cases, the disease appears only briefly and disappears on its own. It is characterized by the buildup of immune system cells in organs that form small clusters called granulomas, a type of inflammation of the involved tissues. Sarcoidosis is found throughout the world."}, {"url": "http://www.sarcoid-network.org/FAQ/faq-disease.php", "passage_text": "Multi-system sarcoidosis is not caused by any element, but granulomatous disease of the lung and skin may be caused by beryllium. The disease is called berylliosis. Zirconium (used in deodorants) can cause granulomas in the skin, but it does not cause not systemic sarcoidosis. 35. "}, {"url": "http://www.aafp.org/afp/1998/1201/p2055.html", "passage_text": "Sarcoidosis (say “sar-coy-doe-sis”) is a disease that may affect any organ or system in your body. If you have sarcoidosis, you may have no symptoms at all. Only small changes might show up on a chest x-ray, or you may have progressive failure of many organs in your body. The cause of sarcoidosis isn't known. Fever is not often associated with sarcoidosis. Although the nervous system isn't usually affected, sar-coidosis can cause muscle weakness or paralysis, seizures, tremor, poor coordination, hearing loss, blindness or problems with walking."}, {"url": "http://www.lung.org/lung-health-and-diseases/lung-disease-lookup/sarcoidosis/learn-about-sarcoidosis.html", "passage_text": "While no one knows what causes sarcoidosis, it is associated with increased immune system activity. This causes clusters of inflamed tissue (granulomas) to form in your body and lymph nodes (part of the immune system). Sarcoidosis most commonly affects your lungs, but it can affect any organ in your body. People over the age of 20 and women are more likely to develop sarcoidosis. Many patients never have symptoms, and the disease is diagnosed only because a chest X-ray is taken for another reason. In very few cases, sarcoidosis can be life-threatening if it causes heart or severe lung disease. If your symptoms last more than 2 years despite treatment, your disease is considered chronic, and the symptoms may worsen your quality of life."}, {"url": "http://www.equiworld.net/horses/horsecare/veterinary/sarcoids/index.htm", "passage_text": "A Sarcoid is a tumour involving connective tissue {ie. muscle, sub-cutaneos tissue, etc.}. A tumour which may appear outwardly similar is the Lymphoma {cutaneous lymphosarcoma}, which involves the Lymphatic system {glandular system to you or I}. "}, {"url": "https://www.sharecare.com/health/immune-lymphatic-system-disorders/is-sarcoidosis-contagious", "passage_text": "A Honor Society of Nursing (STTI) answered. Although the exact cause or causes of sarcoidosis have not yet been determined, it is not contagious. It is currently believed that sarcoidosis is most likely caused by a pre-existing disorder of the immune system. You cannot catch sarcoidosis from someone who has it. "}, {"url": "https://en.wikipedia.org/wiki/Sarcoidosis", "passage_text": "Sarcoidosis, also called sarcoid, is a disease involving abnormal collections of inflammatory cells (granulomas) that can form as nodules in multiple organs. "}, {"url": "http://www.rightdiagnosis.com/s/sarcoid/contagious.htm", "passage_text": "Sarcoid is not an infection and it is not contagious. Contagion and contagiousness refers to how easily the spread of Sarcoid is possible from one person to another. "}, {"url": "http://www.webmd.com/lung/understanding-sarcoidosis-basics", "passage_text": "Sarcoidosis is a chronic disease that affects multiple systems in the body, from the eyes to the lungs to the brain. It is characterized by the buildup of immune system cells in organs that form small clusters called granulomas, a type of inflammation of the involved tissues. Sarcoidosis is found throughout the world."}]