[{"url": "http://www.livestrong.com/article/486546-why-are-lentils-good-for-you/", "passage_text": "High in Protein and Fiber. Lentils make a satisfying addition to meals because of their protein and fiber content. Fiber helps food remain in your stomach for longer after eating, keeping you feeling full for longer after your meal. A fiber-rich diet also softens your stool, which keeps you regular, and helps control your blood sugar. The protein in lentils provides amino acids -- compounds your body can reassemble into hormones, as well as use for new cell growth. A 1-cup serving of boiled lentils contains 15.6 grams of dietary fiber -- 41 percent of the daily fiber need for men and 60 percent for women, determined by the Institute of Medicine."}, {"url": "http://canigivemydog.com/lentils", "passage_text": "Lentils are a good source of protein,iron and fiber. They are likely harmless but could possibly cause some mild digestive issues for your canine. If you know which types of legumes cause bouts of indigestion or excess gas then you can be selective on giving your dog these healthy foods, occasionally. "}, {"url": "http://www.care2.com/greenliving/9-reasons-to-love-lentils-the-mightly-little-powerfood.html", "passage_text": "3. High Nutrition: Lentils are the mightiest of the beans. If beans are good for you, then lentils — the smallest of the beans — are GREAT for you. In general the smaller the seed, the more nutrition a food has by weight or volume. 4. Low in Fat and Sodium. 5. Most Alkaline of all Protein Sources. 6."}, {"url": "http://healthyeating.sfgate.com/benefits-eating-lentils-4547.html", "passage_text": "Lentils are a rich source of dietary fiber. Lentils are a powerhouse of nutrition. They are a good source of potassium, calcium, zinc, niacin and vitamin K, but are particularly rich in dietary fiber, lean protein, folate and iron. The Centers for Disease Control and Prevention reports that eating plenty of nutrient-dense foods like lentils can lessen your risk of many serious medical problems."}, {"url": "http://www.mindbodygreen.com/0-5488/7-Health-Benefits-of-Lentils.html", "passage_text": "5. Good Protein – Of all legumes and nuts, lentils contain the third-highest levels of protein. 26 percent of lentil’s calories are attributed to protein, which makes them a wonderful source of protein for vegetarians and vegans. 6. Eat lentils and reap their health benefits including: 1. Lower Cholesterol – Lentils help to reduce blood cholesterol since it contains high levels of soluble fiber. Lowering your cholesterol levels reduces your risk of heart disease and stroke by keeping your arteries clean. 2."}, {"url": "http://wholesomebabyfood.momtastic.com/babyfoodlentilrecipes.htm", "passage_text": "Brown lentils are those most commonly found in your local grocery store. I know that the lentils you find are really more like a khaki-green color but they are technically called brown lentils. Like red lentils, brown lentils will cook up mushy and would be a good choice for baby soups and baby food recipes. Red lentils cook faster and are more smooth than other types of lentils. Red lentils are best for soups and purees and this makes them a great choice for baby food. It is thought that the red lentil will not cause gas as easily as other lentils because of the lower level of fiber."}, {"url": "http://www.mindbodygreen.com/0-5488/7-Health-Benefits-of-Lentils.html", "passage_text": "2. Heart Health – Several studies have shown that eating high fiber foods like lentils reduces your risk of heart disease. Lentils are also a great source of folate and magnesium, which are big contributors to heart health. Folate lowers your homocysteine levels, a serious risk factor for heart disease. Eat lentils and reap their health benefits including: 1. Lower Cholesterol – Lentils help to reduce blood cholesterol since it contains high levels of soluble fiber. Lowering your cholesterol levels reduces your risk of heart disease and stroke by keeping your arteries clean. 2."}, {"url": "http://www.whfoods.com/genpage.php?tname=foodspice&dbid=52", "passage_text": "Lentils are legumes along with other types of beans. They grow in pods that contain either one or two lentil seeds that are round, oval or heart-shaped disks and are oftentimes smaller than the tip of a pencil eraser. To boil lentils, use three cups of liquid for each cup of lentils. Lentils placed in already boiling water will be easier to digest than those that were brought to a boil with the water. When the water returns to a boil, turn down the heat to simmer and cover."}, {"url": "http://www.whfoods.com/genpage.php?tname=foodspice&dbid=52", "passage_text": "Lentils—A Fiber All Star. Check a chart of the fiber content in foods; you'll see legumes leading the pack. Lentils, like other beans, are rich in dietary fiber, both the soluble and insoluble type. To boil lentils, use three cups of liquid for each cup of lentils. Lentils placed in already boiling water will be easier to digest than those that were brought to a boil with the water. When the water returns to a boil, turn down the heat to simmer and cover."}, {"url": "http://www.whfoods.com/genpage.php?tname=foodspice&dbid=52", "passage_text": "If you have insulin resistance, hypoglycemia or diabetes, legumes like lentils can really help you balance blood sugar levels while providing steady, slow-burning energy. Studies of high fiber diets and blood sugar levels have shown the dramatic benefits provided by these high fiber foods. To boil lentils, use three cups of liquid for each cup of lentils. Lentils placed in already boiling water will be easier to digest than those that were brought to a boil with the water. When the water returns to a boil, turn down the heat to simmer and cover."}]