[{"url": "http://www.caranddriver.com/reviews/2011-rolls-royce-ghost-review", "passage_text": "Most Definitely Still a Roller. The Ghost truncates one of the great names from Rolls-Royce’s past, the Silver Ghost, a moniker that attached itself to the full line of classically reliable and smooth 40/50s produced from 1906 to 1926. Chief designer Ian Cameron has delivered a shape that is immediately recognizable as a Rolls-Royce, even though the car does not have the traditional Parthenon-type grille. Its sleeker expression of the chrome-vaned radiator housing is in keeping with the car’s trimmer proportions relative to the Phantom."}, {"url": "https://en.wikipedia.org/wiki/Phantom_vehicle", "passage_text": "Phantom vehicle may refer to a supposed ghostly or haunted vehicle, or, for insurance purposes, a vehicle that causes injury, death, or damage without making physical contact. 1 Herbie Both Herbie and Horace (from the 1997 film) the Hate Bug are possessed cars. 2  Herbie, however is possessed by accident, when a photo of his creator Gustav Von Stumpfel's beloved Elsa fell in a vat of molten steel used for the car."}, {"url": "https://answers.yahoo.com/question/index?qid=20070712214949AA2Fi4Q", "passage_text": "Rating Newest Oldest. Best Answer: A whip is what you used to control the horses on a stagecoach. When the steering wheel was first used in a car, it was called the whip, because the steering wheel controls the car. The Mercedes-Benz logo resembles a steering wheel. The old term whip has come to describe a Mercedes-Benz vehicle. The term has now been generalized to classify any car"}, {"url": "http://www.urbandictionary.com/define.php?term=ghost", "passage_text": "4)A poltergeist. There are actually many kinds of ghosts, but to name them all and give definitons would be impossible, due to a limit of space. The kind of human or animal ghost that is an actual sentient being is called an apparition."}, {"url": "http://www.thefreedictionary.com/ghost", "passage_text": "ghost. n. 1. The spirit of a dead person, especially one that is believed to appear to the living in bodily form or to haunt specific locations. 2. A person's spirit or soul: was sick for months and finally gave up the ghost. 3. A returning or haunting memory or image. 4. a. A slight or faint trace: just a ghost of a smile. "}, {"url": "https://en.wikipedia.org/wiki/Rolls-Royce_Ghost", "passage_text": "The Rolls-Royce Ghost is a luxury saloon from Rolls-Royce Motor Cars. The Ghost nameplate, named in honour of the Silver Ghost, a car first produced in 1906, was announced in April 2009 at the Auto Shanghai show. During development, the Ghost was known as the RR04. Designed as a smaller, more measured, more realistic car than the Phantom, aiming for a lower price category for Rolls-Royce models, the retail price is around £170,000 (US$255,000). The production model was officially unveiled at the 2009 Frankfurt Motor Show."}, {"url": "http://www.news.com.au/world/europe/video-of-ghost-car-spooks-the-world/story-fnh81p7g-1226887472412", "passage_text": "THERE are some things that you just have to see to believe. Take ghosts for example. If you don’t believe in ghosts, you will after you see a video of what many are calling the “ghost car”. "}, {"url": "http://paranormalghostsociety.org/ghosts.htm", "passage_text": "Spirit: Often used to define the soul of a person, but it can also be used to represent places such as sacred lakes or objects, shrines, and elemental entities. Spirit Detection: The reading made by scientific equipment (EMF Detectors, Temperature changes, etc.) when a ghost or spirit is present. "}, {"url": "http://supernatural.wikia.com/wiki/Ghosts", "passage_text": "— Sam Winchester explaining Ghosts. Ghosts, also called Spirits, are souls of deceased humans that did not get into Heaven or Hell and are stuck on Earth. The word Ghost is a common term for a soul that did not move on to an after life after they perished. They typically reside in The Veil, but they can occasionally appear in the physical plane. "}, {"url": "https://en.wikipedia.org/wiki/Ghost", "passage_text": "Wraith is a Scots word for ghost, spectre or apparition. It came to be used in Scottish Romanticist literature, and acquired the more general or figurative sense of portent or  omen . In 18th-to 19th-century Scottish literature, it was also applied to aquatic spirits. Haint is a synonym for ghost used in regional English of the southern United States, and the haint tale is a common feature of southern oral and literary tradition. The term poltergeist is a German word, literally a noisy ghost, for a spirit said to manifest itself by invisibly moving and influencing objects."}]