[{"url": "https://en.wikipedia.org/wiki/Distributed_computing", "passage_text": "Distributed computing also refers to the use of distributed systems to solve computational problems. In distributed computing, a problem is divided into many tasks, each of which is solved by one or more computers, which communicate with each other by message passing. A computer program that runs in a distributed system is called a distributed program, and distributed programming is the process of writing such programs."}, {"url": "https://en.wikipedia.org/wiki/Distributed_Computing_Environment", "passage_text": "The Distributed Computing Environment (DCE) is a software system developed in the early 1990s by a consortium that included Apollo Computer (later part of Hewlett-Packard), IBM, Digital Equipment Corporation, and others. "}, {"url": "http://www.yourdictionary.com/distributed-computing", "passage_text": "distributed-computing-Computer Definition. (1) The use of multiple computers networked throughout a geographical area. See grid computing. (2) The use of multiple computers in an enterprise rather than one centralized system. This use of the term was coined in the late 1970s when minicomputers were installed in departments throughout a company instead of deploying terminals to a mainframe. 1  Link/Cite."}, {"url": "http://www.bitpipe.com/tlist/Distributed-Computing.html", "passage_text": "DISTRIBUTED COMPUTING DEFINITION (continued): user interface processing is done in the PC at the user's location, business processing is done in a remote computer, and database access and processing is done in another computer that provides centralized access for many business processes. 1) In business enterprises, distributed computing generally has meant putting various steps in business processes at the most efficient places in a network of computers."}, {"url": "http://whatis.techtarget.com/definition/distributed-computing", "passage_text": "According to the narrowest of definitions, distributed computing is limited to programs with components shared among computers within a limited geographic area. Broader definitions include shared tasks as well as program components. There is a great deal of disagreement over the difference between distributed computing and grid computing. According to some, grid computing is just one type of distributed computing. The SETI project, for example, characterizes the model it’s based on as"}, {"url": "https://en.wikipedia.org/wiki/Distributed_computing", "passage_text": "Examples of distributed systems vary from SOA-based systems to massively multiplayer online games to peer-to-peer applications. A computer program that runs in a distributed system is called a distributed program, and distributed programming is the process of writing such programs. There are many alternatives for the message passing mechanism, including RPC-like connectors and message queue"}, {"url": "http://whatis.techtarget.com/definition/distributed-computing", "passage_text": "Grid computing is a computing model involving a distributed architecture of large numbers of computers connected to solve a complex problem. In the grid computing model, servers or personal computers run independent tasks and are loosely linked by the Internet or low-speed networks. There is a great deal of disagreement over the difference between distributed computing and grid computing. According to some, grid computing is just one type of distributed computing. The SETI project, for example, characterizes the model it’s based on as"}, {"url": "https://en.wikipedia.org/wiki/Distributed_computing", "passage_text": "Distributed computing is a field of computer science that studies distributed systems. A distributed system is a software system in which components located on networked computers communicate and coordinate their actions by passing messages. The components interact with each other in order to achieve a common goal. A computer program that runs in a distributed system is called a distributed program, and distributed programming is the process of writing such programs."}, {"url": "http://whatis.techtarget.com/definition/distributed-computing", "passage_text": "Part of the Software applications glossary: Distributed computing is a model in which components of a software system are shared among multiple computers to improve efficiency and performance. There is a great deal of disagreement over the difference between distributed computing and grid computing. According to some, grid computing is just one type of distributed computing. The SETI project, for example, characterizes the model it’s based on as"}, {"url": "http://www.bitpipe.com/tlist/Distributed-Computing.html", "passage_text": "DEFINITION: In general, distributed computing is any computing that involves multiple computers remote from each other that each have a role in a computation problem or information processing. 1) In business enterprises, distributed computing generally has meant putting various steps in business processes at the most efficient places in a network of computers."}]