[{"url": "http://sovereignty.org.uk/features/articles/sevensov.html", "passage_text": "For example, it has been suggested to us that a manufacturing base is a principle of sovereignty since it creates wealth and allows the nation to sustain itself. However, the existence of a manufacturing base depends, firstly, upon the establishment of the principle of Economic Sovereignty."}, {"url": "http://glossary.econguru.com/economic-term/consumer+sovereignty", "passage_text": "Offline Version: PDF. Term consumer sovereignty Definition: The notion that consumers are king of the economy because they're the ones who will ultimately determine what goods are produced and how our limited resources are used (that is, the three questions of allocation)."}, {"url": "http://yaleglobal.yale.edu/content/globalization-vs-economic-sovereignty", "passage_text": "Globalization vs. Economic Sovereignty. China is often presented as a poster boy for successful globalization. But at least some intellectuals in China are not happy with the course globalization has taken."}, {"url": "http://yaleglobal.yale.edu/content/globalization-vs-economic-sovereignty", "passage_text": "Underlying the economic sovereignty debate “is a hidden power struggle on the world stage,” contested by a number of prominent countries who use the language of globalization in the pursuit of very national agendas. – YaleGlobal."}, {"url": "http://sovereignty.org.uk/features/articles/sevensov.html", "passage_text": "2 - ECONOMIC SOVEREIGNTY. This means the ability of the organism to control its own economy in response to its own needs. This involves keeping its own currency, trading with whom it chooses, controlling imports and exports, and regulating its currency to protect against speculation, if necessary."}, {"url": "http://www.merriam-webster.com/dictionary/consumer%20sovereignty", "passage_text": "Definition of CONSUMER SOVEREIGNTY. : the economic power exercised by the preferences of consumers in a free market. ADVERTISEMENT. This word doesn't usually appear in our free dictionary, but the definition from our premium Unabridged Dictionary is offered here on a limited basis."}]