[{"url": "http://www.insidejobs.com/articles/how-much-does-a-college-professor-make", "passage_text": "Education: Doctorate Salary: $36,000 – $122,000 Communications Professor Teach university students about communications. Education: Doctorate Salary: $33,000 – $114,000 Journalism Professor Teach university students about journalism."}, {"url": "http://www.ehow.com/info_8565244_salary-phd-professor.html", "passage_text": "If a professor with a PhD does not have a teaching background, their salary may be lower. However, experience at corporations or in the field may act as a substitute, according to EduDecisions. The salary of a professor with a PhD will increase modestly until tenure is achieved."}, {"url": "http://www1.salary.com/College-Professor-Salary.html", "passage_text": "Typically reports to a department head. View Professor-English Salaries Alternate Job Titles: Professor-English, College Professor-English, University Professor-English Categories: Education Professor-History Salaries Conducts college-level courses in the field of history."}, {"url": "http://www.insidejobs.com/articles/how-much-does-a-college-professor-make", "passage_text": "Education: Doctorate Salary: $42,000 – $129,000 Physics Professor Teach university students about physics. Education: Doctorate Salary: $43,000 – $143,000 Interior Architecture Professor Teach university students about interior architecture."}, {"url": "http://www.insidejobs.com/articles/how-much-does-a-college-professor-make", "passage_text": "Education: Doctorate Salary: $33,000 – $114,000 Chemistry Professor Teach university students about chemistry. Education: Doctorate Salary: $41,000 – $134,000 Social Work Professor Teach university students about social work."}, {"url": "http://www.insidejobs.com/articles/how-much-does-a-college-professor-make", "passage_text": "Education: Doctorate Salary: $29,000 – $110,000 Statistics Professor Teach university students about statistics. Education: Doctorate Salary: $35,000 – $126,000 Meteorology Professor Teach university students about meteorology."}, {"url": "http://www.insidejobs.com/articles/how-much-does-a-college-professor-make", "passage_text": "Education: Doctorate Salary: $33,000 – $113,000 Biology Professor Teach university students about biology. Education: Doctorate Salary: $40,000 – $154,000 Creative Writing Professor Teach university students about creative writing."}, {"url": "http://www1.salary.com/Professor-History-salary.html", "passage_text": "For example the median expected annual pay for a typical Professor-History in the United States is $89,796 so 50% of the people who perform the job of Professor-History in the United States are expected to make less than $89,796. Source: HR Reported data as of October 2015. Median $89,796. 1  Salary."}, {"url": "http://www1.salary.com/College-Professor-Salary.html", "passage_text": "Typically reports to a department head. View Professor-Nursing Salaries Alternate Job Titles: Professor-Nursing, College Professor-Nursing, University Professor-Nursing Categories: Education Professor-Rehabilitation Salaries Conducts college-level courses in the field of rehabilitation and therapy."}, {"url": "http://www1.salary.com/College-Professor-Salary.html", "passage_text": "Typically reports to a department head. View Professor-Mathematics Salaries Alternate Job Titles: Professor-Mathematics, College Professor-Mathematics, University Professor-Mathematics Categories: Education Professor-Music Salaries Conducts college-level courses in the field of music."}]