[{"url": "http://lightparty.com/Health/Radionics.html", "passage_text": "RADIONICS. Radionics is a method of diagnosis and treatment at a distance which utilizes specially designed instruments practitioner can determine the underlying causes of diseases within a living system, be it human, animal, plant, or the soil itself. The scope of Radionics in theory is unlimited; in practice it is limited by the sensitivity, knowledge and expertise of the practitioner. At one level it can be used to determin the structural and functional integrity of the body, and identify the causes of disease hidden within."}, {"url": "http://www.bibliotecapleyades.net/salud/esp_salud19.htm", "passage_text": "from LightParty Website. Spanish version. Radionics is a method of diagnosis and treatment at a distance which utilizes specially designed instruments practitioner can determine the underlying causes of diseases within a living system, be it human, animal, plant, or the soil itself. "}, {"url": "http://raydionics.com/", "passage_text": "Radionics is based on the understanding that every person's energy patterns, frequencies, signatures, vibrations or rhythms are as unique to them as their fingerprints, and that every part of their body, down to the cell level, reflects these 'vibrations'. The particular form of ESP used in Radionics is often referred to as the radiesthetic faculty through which the practitioner, by means of a series of posed yes/no questions, obtains information. about the health of his patients to which the conscious thinking mind has no direct access."}, {"url": "http://raydionics.com/", "passage_text": "In a radionic assessment the aim is not to categorize a condition by way of a diagnostic term but to find out ALL the factors that have contributed to the clinical presentations of the patient. Such factors could reside in the body physical, the etheric body, the emotional body, or the mental body. The particular form of ESP used in Radionics is often referred to as the radiesthetic faculty through which the practitioner, by means of a series of posed yes/no questions, obtains information. about the health of his patients to which the conscious thinking mind has no direct access."}, {"url": "http://scepticsbook.com/2009/06/21/the-art-of-distant-healing-with-radionics/", "passage_text": "The concept of modern day radionics involves holding a pendulum over the hair sample (or “witness”, as it’s called), and “dowsing” to get information about that state of the patient’s health. “We get the information by interrogating the witness,” they say. "}, {"url": "http://www.radionics.co.uk/What_Is_Radionics.html", "passage_text": "BACK. Radionics is an advanced complementary therapy in which the practitioner uses pendulum dowsing (a form of Radiesthesia) in combination with Radionic instruments to discover and correct what are termed 'energy imbalances' in the patient. Many Radionic practitioners work remotely from their patients, who may be located anywhere in the world. The patient supplies a small sample of hair and describes their symptoms. From this the practitioner is able to build up an analysis, which in turn leads to treatment procedures."}, {"url": "http://www.vitalityandwellness.com.au/food-sensitivity-test", "passage_text": "The food sensitivity testing also known as a Food Intolerance Test and Food Allergy Test is used to determine which foods, beverages and personal hygiene products are not compatible with your body. The results from the Food Sensitivity Test maybe the missing link to your underlying health issues. Bio-Co Food Sensitivity Testing tests your compatibility to 500 foods and beverages. Unfortunately it is not possible to test for every item available in supermarkets but the list of 500+ items provides a good cross section of different food groups and brands that are available and suit most people."}, {"url": "http://raydionics.com/", "passage_text": "Radionics can be both a diagnostic and therapeutic procedure which can be used to discover the higher dimensional energetic disturbances underlying pathology and to encourage the reappearance of normal energetic fields which support health. The particular form of ESP used in Radionics is often referred to as the radiesthetic faculty through which the practitioner, by means of a series of posed yes/no questions, obtains information. about the health of his patients to which the conscious thinking mind has no direct access."}, {"url": "http://raydionics.com/", "passage_text": "Radionics is a method of healing and diagnosing at a distance using the unique extra-sensory faculties of the operator supported and amplified by a physical instrument, device, geometric pattern, energy or substance. The particular form of ESP used in Radionics is often referred to as the radiesthetic faculty through which the practitioner, by means of a series of posed yes/no questions, obtains information. about the health of his patients to which the conscious thinking mind has no direct access."}]