[{"url": "http://www.diffen.com/difference/Hardware_vs_Software", "passage_text": "Hardware is best described as a device, such as a hard drive, that is physically connected to the computer or something that can be physically touched. A CD-ROM, computer display monitor, printer, and video card are all examples of computer hardware. Hardware serve as the delivery system for software solutions. The hardware of a computer is infrequently changed, in comparison with software and data, which are “soft” in the sense that they are readily created, modified, or erased on the comput. To perform the specific task you need to complete."}, {"url": "https://en.wikipedia.org/wiki/Computer_hardware", "passage_text": "Computer hardware (usually simply called hardware when a computing context is implicit) is the collection of physical elements that constitutes a computer system. In contrast, software is instructions that can be stored and run by hardware. Software is any set of machine-readable instructions that directs a computer's processor to perform specific operations. A combination of hardware and software forms a usable computing system."}, {"url": "https://en.wikipedia.org/wiki/Computer_hardware", "passage_text": "Computer hardware is the physical parts or components of a computer, such as the monitor, mouse, keyboard, computer data storage, hard disk drive (HDD), graphic cards, sound cards, memory, motherboard, and so on, all of which are physical objects that are tangible. In contrast, software is instructions that can be stored and run by hardware. Software is any set of machine-readable instructions that directs a computer's processor to perform specific operations. A combination of hardware and software forms a usable computing system."}, {"url": "http://study.com/academy/lesson/what-is-computer-hardware-components-definition-examples.html", "passage_text": "Computer hardware is the collection of physical parts of a computer system. This includes the computer case, monitor, keyboard, and mouse. It also includes all the parts inside the computer case, such as the hard disk drive, motherboard, video card, and many others. Computer hardware is what you can physically touch."}, {"url": "http://www.openprojects.org/hardware-definition.htm", "passage_text": "Computer Hardware Definition. Hardware is a comprehensive term for all of the physical parts of a computer, as distinguished from the data it contains or operates on, and the software that provides instructions for the hardware to acoomplish tasks. "}, {"url": "http://www.computerhope.com/jargon/h/hardware.htm", "passage_text": "Abbreviated as HW, Hardware is best described as any physical component of a computer system that contains a circuit board, ICs, or other electronics. A perfect example of hardware is the screen on which you are viewing this page. Without any hardware, your computer would not exist, and software could not be used. The picture is a Logitech webcam, an example of an external hardware peripheral. This hardware device allows users to take videos or pictures and transmit them over the Internet."}, {"url": "http://study.com/academy/lesson/what-is-computer-hardware-components-definition-examples.html", "passage_text": "Definitions. A computer system consists of two major elements: hardware and software. Computer hardware is the collection of all the parts you can physically touch. Computer software, on the other hand, is not something you can touch. Software is a set of instructions for a computer to perform specific operations. This includes the computer case, monitor, keyboard, and mouse. It also includes all the parts inside the computer case, such as the hard disk drive, motherboard, video card, and many others. Computer hardware is what"}, {"url": "http://www.computerhope.com/issues/ch000039.htm", "passage_text": "Computer hardware is any physical device used in or with your machine, whereas software is a collection of code installed onto your computer's hard drive. For example, the computer monitor you are using to read this text and the mouse you are using to navigate this web page is computer hardware. All software utilizes at least one hardware device to operate. For example, a video game, which is software, uses the computer processor (CPU), memory (RAM), hard drive, and video card to run. Word processing software uses the computer processor, memory, and hard drive to create and save documents."}, {"url": "http://openbookproject.net/courses/intro2ict/hardware/internal.html", "passage_text": "Introduction ¶. Computer Hardware is the physical part of a computer, as distinguished from the that executes or runs on the hardware. The hardware of a computer is infrequently changed, while software and data are modified frequently. The term soft refers to readily created, modified, or erased"}, {"url": "http://pcsupport.about.com/od/termshm/g/hardware.htm", "passage_text": "Computer hardware refers to the physical components that make up a computer system. There are many different kinds of hardware that can be installed inside, and connected to the outside, of a computer. "}]