[{"url": "http://www.dentonisd.org/cms/lib/TX21000245/Centricity/Domain/1023/The%20Progressive%20Era.pdf", "passage_text": "Susan B. Anthony: An early leader of the women's suffrage(right to vote) movement, co-founded the National Women'sSuffrage Association with Elizabeth Cady Stanton in 1869. 13. Theodore Roosevelt: President 1901-1909;Republican/Progressive Power. Roosevelt Corollary: Roosevelt's 1904 extension of the MonroeDoctrine (said different hemispheres would not interfere witheach other), stating that the United States has the right to protectits economic interests in South And Central America by usingmilitary force 10."}, {"url": "https://en.wikipedia.org/wiki/Progressive_Era", "passage_text": "The Progressive Era was a period of widespread social activism and political reform across the United States, from the 1890s to 1920s. The main objective of the Progressive movement was eliminating corruption in government. The movement primarily targeted political machines and their bosses. In the 1940s typically historians saw the Progressive Era as a prelude to the New Deal and dated it from 1901 (when Roosevelt became president) to the start of World War I in 1914 or 1917. Historians have moved back in time emphasizing the Progressive reformers at the municipal and state levels in the 1890s."}, {"url": "https://www.apstudynotes.org/us-history/topics/the-progressive-presidents/", "passage_text": "Taft was a mild progressive and an easygoing man that Roosevelt and other Republican leaders felt they could control. Taft easily defeated the Democratic candidate, William Jennings Bryan, and the Socialist candidate, Eugene Debs, in what can be construed as continued public endorsement of Roosevelt. Roosevelt’s Square Deal. At the dawn of the twentieth century, America was at a crossroads. Presented with abundant opportunity, but also hindered by significant internal and external problems, the country was seeking leaders who could provide a new direction."}, {"url": "http://www.shmoop.com/progressive-era-politics/theodore-roosevelt.html", "passage_text": "Theodore Roosevelt (1858-1919) was the 26th president of the United States and a proponent of the New Nationalist variety of Progressivism. "}, {"url": "http://www.gilderlehrman.org/history-by-era/politics-reform/essays/theodore-roosevelt-making-progressive-reformer", "passage_text": "The McKinley-Roosevelt ticket won the election, but in 1901 an anarchist assassinated President McKinley and T.R. ascended to the presidency. As president, Theodore Roosevelt had to deal with the dominant conservative wing of his party and a Congress hostile to reform. He took the reins of the presidency without much more of a plan than to emulate Abraham Lincoln’s wisdom and his ability to unite the nation. Theodore Roosevelt’s interesting life often tempts biographers to write about him with the history left out. His story offers plenty of drama. Born in 1858 to a wealthy family in New York City he waged a life and death struggle against childhood asthma."}, {"url": "https://en.wikipedia.org/wiki/Progressive_Party_(United_States,_1912)", "passage_text": "The Progressive Party of 1912 was an American political party. It was formed by former President Theodore Roosevelt, after a split in the Republican Party between him and President William Howard Taft. The party also became known as the Bull Moose Party after journalists quoted Roosevelt saying I feel like a bull moose shortly after the new party was formed. He had selected Taft, his Secretary of War, to succeed him as presidential candidate, and Taft easily won the 1908 presidential election. Roosevelt became disappointed by Taft's increasingly conservative policies. Taft upset Roosevelt when he used the Sherman Anti-Trust Act to break up U.S. Steel."}, {"url": "http://www.heritage.org/research/reports/2012/09/theodore-roosevelt-progressive-crusader", "passage_text": "Theodore Roosevelt, 26th President of the United States (1901–1909), was the youngest and arguably most energetic man ever to fill that office. Growing up in the Gilded Age, he regarded commercial ideals as “mean and sordid” and brought these sensibilities with him into public life. "}, {"url": "http://www.u-s-history.com/pages/h1755.html", "passage_text": "Progressive Party. The Progressive Party was a factor in the presidential campaigns of three men Theodore Roosevelt, Robert La Follette, and Henry Wallace. "}, {"url": "https://en.wikipedia.org/wiki/Progressive_Party_(United_States,_1912)", "passage_text": "Theodore Roosevelt was the founder of the Bull Moose Progressive Party and thus is often associated with the party. Roosevelt left office in 1909. He had selected Taft, his Secretary of War, to succeed him as presidential candidate, and Taft easily won the 1908 presidential election. Roosevelt became disappointed by Taft's increasingly conservative policies. Taft upset Roosevelt when he used the Sherman Anti-Trust Act to break up U.S. Steel."}, {"url": "https://en.wikipedia.org/wiki/Progressive_Party_(United_States,_1912)", "passage_text": "Roosevelt far outpolled Taft in the primary elections which were held in a few of the more progressive states. But Taft had worked far harder than TR to control the Republican Party's organizational operations and the mechanism for choosing its presidential nominee, the 1912 Republican National Convention. He had selected Taft, his Secretary of War, to succeed him as presidential candidate, and Taft easily won the 1908 presidential election. Roosevelt became disappointed by Taft's increasingly conservative policies. Taft upset Roosevelt when he used the Sherman Anti-Trust Act to break up U.S. Steel."}]