[{"url": "http://www.thefreedictionary.com/ethnic+minority", "passage_text": "Noun. 1. ethnic minority-a group that has different national or cultural traditions from the majority of the population. ethnic group, ethnos-people of the same race or nationality who share a distinctive culture. Arab-Berbers, Berbers-an ethnic minority descended from Berbers and Arabs and living in northern Africa. Dagestani-an ethnic minority living on the Caspian Sea in southwestern Russia and Azerbaijan. Maori-an ethnic minority of Polynesian and Melanesian descent who speak Maori and live in New Zealand. Mayas-an ethnic minority speaking Mayan languages and living in Yucatan and adjacent areas."}, {"url": "https://en.wikipedia.org/wiki/Minority_group", "passage_text": "Minority group is a term referring to a category of people differentiated from the social majority, i.e. those who hold the majority of positions of social power in a society, and may be defined by law. Rather than a relational  social group , as the term would indicate, minority group refers to the above-described. In the social sciences, the term minority is used to refer to categories of persons who hold fewer positions of social power. The term minority group often occurs alongside a discourse of civil rights and collective rights which gained prominence in the 20th century."}, {"url": "http://www.dailymail.co.uk/news/article-2620957/Ethnic-minorities-make-one-population-2050-Britains-melting-pot-continues-grow.html", "passage_text": "Ethnic minorities 'will make up one third of the population by 2050' as Britain's melting pot continues to grow. 1  One in four children under ten is already from a minority group. 2  Over next few decades the proportion will soar, Policy Exchange says. 3  Currently 14 per cent of the UK population are from ethnic minorities. "}, {"url": "http://www.oxforddictionaries.com/definition/english/ethnic-minority", "passage_text": "A group within a community which has different national or cultural traditions from the main population. Example sentences. 1  The populations of ethnic minorities account for 8.41 percent of the national total. 2  We are not going to let that happen to the Muslim community, to an ethnic minority, whatever happens next."}, {"url": "https://en.wikipedia.org/wiki/Ethnic_minorities_in_China", "passage_text": "Ethnic minorities in China are the non-Han Chinese population in the People's Republic of China. The People's Republic of China (PRC) officially recognizes 55 ethnic minority groups within China in addition to the Han majority. As of 2010, the combined population of officially recognised minority groups comprised 8.49% of the population of mainland China. The ethnic minority groups officially recognized by the PRC reside within mainland China and Taiwan, whose minorities are called the Taiwanese aborigines."}, {"url": "http://www.scholastic.com/teachers/article/ethnic-minorities", "passage_text": "An ethnic minority is a group of people who differ in race or color or in national, religious, or cultural origin from the dominant group — often the majority population — of the country in which they live. The different identity of an ethnic minority may be displayed in any number of ways, ranging from distinctive customs, lifestyles, language or accent, dress, and food preferences to particular attitudes, moral values, and economic or political beliefs espoused by members of the group."}, {"url": "http://www.scholastic.com/teachers/article/ethnic-minorities", "passage_text": "Minority Identity and Assimilation. An unfortunate secondary characteristic of ethnic minority status is that it is often accompanied by prejudice and discrimination. Ethnic minorities tend to be at a disadvantage in most situations, most often because they are stigmatized as different from the norm. The different identity of an ethnic minority may be displayed in any number of ways, ranging from distinctive customs, lifestyles, language or accent, dress, and food preferences to particular attitudes, moral values, and economic or political beliefs espoused by members of the group."}, {"url": "https://www.rt.com/uk/157012-britain-ethnic-minorities/", "passage_text": "Up to 30% of UK population will be from ethnic minorities by 2050 – study. Get short URL. The proportion of UK citizens from ethnic minority communities is expected to double in the next decades and will be between 20 and 30 percent by 2050, “radically changing the face of Britain,” a new report says."}, {"url": "http://www.audioenglish.org/dictionary/ethnic_minority.htm", "passage_text": "• ETHNIC MINORITY (noun). The noun ETHNIC MINORITY has 1 sense: 1. a group that has different national or cultural traditions from the majority of the population. Familiarity information: ETHNIC MINORITY used as a noun is very rare. "}]