[{"url": "http://www.ehow.com/facts_5587749_dettol-liquid-used-for_.html", "passage_text": "The active ingredient in Dettol liquid is an aromatic chemical compound known as chloroxylenol, which makes up 4.8 percent of Dettol's total solution. The remainder is a mixture of pine oil, isopropanol, castor oil soap, caramel and water. Dettol is also commonly used in Australia to kill cane toads, which are a pest species. When toads are sprayed or wiped with the liquid, the Dettol is rapidly absorbed through the toad's skin, causing death."}, {"url": "http://www.answers.com/Q/What_is_dettol_used_for", "passage_text": "Para-chloro-meta-xylenol, shortly noted PCMX (C8H9ClO). (Xylenol is diMethyl-hydroxy-benzene) This makes up 4.8% of Dettol's total mixture. The rest is composed of pine … oil, isopropanol, castor oil soap, caramel, and water. Dettol Antiseptic Liquid Disinfectant (also called PCMX) is the name of commercial liquid and solid antiseptic products belonging to a household product line manufactured by Reckitt Benckiser. Chloroxylenol is extremely toxic to a wide variety of bacteria, fungi and other microbes; however, it is only a mild irritant to humans and other animals (although it is toxic … to fish). This makes it perfect for antiseptic applications in a human environment, including in Dettol as mentioned."}, {"url": "https://en.wikipedia.org/wiki/Dettol", "passage_text": "Dettol is the trade name for a line of hygiene products manufactured by Reckitt Benckiser. It has been in use since before 1936, when it was used after surgery as an antiseptic. Dettol is toxic to many animals, especially cats. Dettol contains the phenol chloroxylenol. Phenols are of particular concern because cats are unable to eliminate the toxins following ingestion. A cat may swallow the product by licking its paws after they have come into contact with it"}, {"url": "http://www.beautyandgroomingtips.com/2009/05/dettol-antibacterial-soap-review.html", "passage_text": "Dettol is a household name associated with cleaning and disinfecting and the very name Dettol has become synonymous with antibacterial protection. And the cleanliness freak, that I am, I have always used ‘ Dettol Original Soap ’ to keep my hands clean and germ-free. Dothese, Dont use cream ,face lotion,try to use normal soap. Drink plenty of water,try to steam bath. Excercise so that sweat itself do the cleaning of ur skin insideout. Dont use too much soap ,washingtwice a day enough. Run from oily ,fried foods,especialy fast food."}, {"url": "http://www.dettol.co.uk/products/first-aid/dettol-liquid/", "passage_text": "A house is not a home without a bottle of iconic Dettol Antiseptic Liquid. Use Dettol Antiseptic Liquid on cuts, scratches and insect bites to kill germs and protect against infection. Always use as directed. Share This Page. -. Scent: 1  Pine. "}, {"url": "http://www.rsc.org/learn-chemistry/resources/chemistry-in-your-cupboard/dettol/3", "passage_text": "A number of disinfectant and antiseptic products are available under the Dettol brand including disinfectants for surfaces, antiseptics for use on the body, wipes and sprays. Here we will concentrate on the ‘core’ product-the liquid antiseptic, Figure 5. Figure 5: Dettol liquid antiseptic, contains chloroxylenol. The active germ-killing ingredient in Dettol is in fact 4-chloro-3,5-dimethylphenol, also known by its non-systematic name para-chloro-meta-xylenol or PCMX, Figure 4. The prefix para is a non-systematic way of indicating the 4- position on the benzene ring, ie opposite the −OH group."}, {"url": "https://en.wikipedia.org/wiki/Dettol", "passage_text": "The active ingredient in Dettol that confers its antiseptic property is chloroxylenol (C 8 H 9 ClO), an aromatic chemical compound. Chloroxylenol comprises 4.8% of Dettol's total admixture, with the rest made up by pine oil, isopropanol, castor oil, soap and water. Dettol is toxic to many animals, especially cats. Dettol contains the phenol chloroxylenol. Phenols are of particular concern because cats are unable to eliminate the toxins following ingestion. A cat may swallow the product by licking its paws after they have come into contact with it"}, {"url": "http://www.ehow.com/facts_5587749_dettol-liquid-used-for_.html", "passage_text": "Other Uses. Dettol is also commonly used in Australia to kill cane toads, which are a pest species. When toads are sprayed or wiped with the liquid, the Dettol is rapidly absorbed through the toad's skin, causing death."}, {"url": "http://www.beautyandgroomingtips.com/2009/05/dettol-antibacterial-soap-review.html", "passage_text": "But, personally I prefer using Dettol liquid handwash over Dettol soap for washing my hands as it gives me that thoroughly cleansed feeling. (You can buy Dettol Liquid Soap 250 ml liquid soap from Amazon .). But be aware of the fact that excessive usage of antibacterial soaps and liquid handwashes is not deemed healthy. Dothese, Dont use cream ,face lotion,try to use normal soap. Drink plenty of water,try to steam bath. Excercise so that sweat itself do the cleaning of ur skin insideout. Dont use too much soap ,washingtwice a day enough. Run from oily ,fried foods,especialy fast food."}]