[{"url": "http://www.thefreedictionary.com/detestable", "passage_text": "detestable. adjective hateful, shocking, offensive, disgusting, revolting, obscene, vile, obnoxious, despicable, repulsive, abhorred, heinous, odious, repugnant, loathsome, abominable, accursed, execrable, yucky or yukky (slang) I find their racist attitude detestable. So objectionable as to elicit despisal or deserve condemnation: abhorrent, abominable, antipathetic, contemptible, despicable, despisable, disgusting, filthy, foul, infamous, loathsome, lousy, low, mean, nasty, nefarious, obnoxious, odious, repugnant, rotten, shabby, vile, wretched.etestable."}, {"url": "http://www.yourdictionary.com/detestable", "passage_text": "adjective. The definition of detestable is disgusting, hateful or awful. An example of something detestable is stabbing a best friend in the back multiple times.that is or should be detested; hateful; execrable; odious."}, {"url": "http://www.merriam-webster.com/dictionary/detestable", "passage_text": "Full Definition of DETESTABLE. : arousing or meriting intense dislike: abominable. — de·test·able·ness noun. — de·test·ably \\-blē\\ adverb. See detestable defined for English-language learners."}, {"url": "http://dictionary.cambridge.org/dictionary/english/detestable", "passage_text": "detestable adjective. › used to refer to ​people or things that you ​hate very much: a detestable ​coward.detestably adverb uk us /-bli/. adverb uk us /-bli/. (Definition of detestable from the Cambridge Advanced Learner’s Dictionary & Thesaurus © Cambridge University Press)."}, {"url": "http://www.webster-dictionary.org/definition/detestable", "passage_text": "1. detestable-offensive to the mind; an abhorrent deed ; the obscene massacre at Wounded Knee ;  morally repugnant customs ;  repulsive behavior ; the most repulsive character in recent novels . Synonyms: abhorrent, repugnant, repulsive, obscene.orthy of being detested; abominable; extremely hateful; very odious; deserving abhorrence; as, detestable vices. Thou hast defiled my sanctuary will all thy detestable things, and with all thine abominations."}, {"url": "http://www.thefreedictionary.com/detestable", "passage_text": "He knew the nature of that good man to be so averse to any baseness or treachery, that the least attempt of such a kind would make the sight of the guilty person for ever odious to his eyes, and his name a detestable sound in his ears. The History of Tom Jones, a Foundling by Fielding, Henry View in context.etestable. So objectionable as to elicit despisal or deserve condemnation: abhorrent, abominable, antipathetic, contemptible, despicable, despisable, disgusting, filthy, foul, infamous, loathsome, lousy, low, mean, nasty, nefarious, obnoxious, odious, repugnant, rotten, shabby, vile, wretched."}, {"url": "http://www.merriam-webster.com/dictionary/detestable", "passage_text": "Learn More About DETESTABLE. Thesaurus: All synonyms and antonyms for detestable. Spanish Central: Spanish translation of detestable. Nglish: Translation of detestable for Spanish speakers. Britannica English: Translation of detestable for Arabic speakers.ull Definition of DETESTABLE. : arousing or meriting intense dislike: abominable. — de·test·able·ness noun. — de·test·ably \\-blē\\ adverb. See detestable defined for English-language learners."}, {"url": "http://www.thefreedictionary.com/testable", "passage_text": "test 1. n. 1. A procedure for critical evaluation; a means of determining the presence, quality, or truth of something; a trial: a test of one's eyesight; subjecting a hypothesis to a test; a test of an athlete's endurance."}, {"url": "http://www.webster-dictionary.org/definition/detestable", "passage_text": "Worthy of being detested; abominable; extremely hateful; very odious; deserving abhorrence; as, detestable vices. Thou hast defiled my sanctuary will all thy detestable things, and with all thine abominations."}, {"url": "http://legal-dictionary.thefreedictionary.com/detestable", "passage_text": "He knew the nature of that good man to be so averse to any baseness or treachery, that the least attempt of such a kind would make the sight of the guilty person for ever odious to his eyes, and his name a detestable sound in his ears. The History of Tom Jones, a Foundling by Fielding, Henry View in context."}]