[{"url": "http://www.answers.com/Q/What_is_grasslands_climate", "passage_text": "The climate for grasslands is basically dry. Precipitation usually does not exceed 100 cm per year, with a minimum near 20 cm per year. Also, grasslands tend to be in temperat … e to subtropical areas, often with cold winters and hot summers. Grasslands are dry, very windy, and the temperature varies from 113 degrees Fahrenheit in the summer and -49 degrees in the winter. Usually no colder than 20 degrees in Africa."}, {"url": "http://grasslandbiomesjjiz.weebly.com/the-climate.html", "passage_text": "The Climate of Grasslands. The two basic types of grasslands are the tall-grassed ones and the short-grassed ones. In grasslands with tall grass, the temperature is moist and humid, allowing for the grass to grow very tall, up to ten feet. The closer to the middle of the country, the dryer it is, meaning that the grass is very short."}, {"url": "http://biology.about.com/od/landbiomes/a/aa042106a.htm", "passage_text": "Temperate grasslands and savannas are two types of grassland biomes. Like savannas, temperate grasslands are areas of open grassland with very few trees. Temperate grasslands, however are located in colder climate regions and receive less precipitation on average than savannas. Temperatures in temperate grasslands vary according to the season. In winter, temperatures can plummet to well below 0 degrees Fahrenheit in some areas. In summer, temperatures can reach above 90 degrees Fahrenheit. Temperate grasslands receive low to moderate precipitation on average per year (20-35 inches). Most of this precipitation is in the form of snow in temperate grasslands of the northern hemisphere"}, {"url": "http://kids.nceas.ucsb.edu/biomes/grassland.html", "passage_text": "WEATHER: Temperatures in this biome vary greatly between summer and winter. The summers are hot and the winters are cold-much colder than Santa Barbara! With cold winters, it’s surprising how hot the grassland summers can get! Sometimes the temperature is more than 100°F (37.8°C). Rain in the temperate grasslands usually occurs in the late spring and early summer. The yearly average is about 20 - 35 inches (55 - 95 cm), but much of this falls as snow in the winter. Fire is not foreign in temperate grasslands. "}, {"url": "http://www.ehow.com/info_8038155_climate-temperate-grasslands.html", "passage_text": "Precipitation. Rainfall in the temperate grasslands of the world falls into the moderate category. The average is 20 to 25 inches per year, occurring mostly in late spring and early summer. An exception are the regions known as steppes, where rainfall can range from 10 to 20 inches per year. "}, {"url": "http://www.ucmp.berkeley.edu/exhibits/biomes/grasslands.php", "passage_text": "Precipitation in the temperate grasslands usually occurs in the late spring and early summer. The annual average is about 50.8 to 88.9 cm (20-35 inches). The temperature range is very large over the course of the year. Temperate grassland. Temperate grasslands are characterized as having grasses as the dominant vegetation. Trees and large shrubs are absent. Temperatures vary more from summer to winter, and the amount of rainfall is less in temperate grasslands than in savannas."}, {"url": "http://www.defenders.org/grasslands/temperate-grasslands", "passage_text": "Temperate grasslands are located north of the Tropic of Cancer (23.5 degrees North) and south of the Tropic of Capricorn (23.5 degrees South). The major temperate grasslands include the veldts of Africa, the pampas of South America, the steppes of Eurasia, and the plains of North America. Climate. Temperate grasslands have hot summers and cold winters. Summer temperatures can be well over 100 degrees Fahrenheit, while winter temperatures can be as low as -40 degrees Fahrenheit. They typically have between 10 and 35 inches of precipitation a year, much of it occurring in the late spring and early summer"}]