[{"url": "http://patient.info/doctor/edwards-syndrome-trisomy-18-pro", "passage_text": "Synonym: trisomy E syndrome. Edwards' syndrome (trisomy 18) is a common autosomal chromosomal disorder due to the presence of an extra chromosome 18. 1  The Edwards' syndrome phenotype results from full, mosaic or partial trisomy 18q. 2  Full trisomy 18 is the most common form occurring in about 94% of cases"}, {"url": "http://www.disabled-world.com/disability/types/edwards-syndrome.php", "passage_text": "Definition: Edwards Syndrome. Edward's Syndrome (also known as Trisomy 18 (T18) or Trisomy E) is a genetic disorder caused by the presence of all or part of an extra 18th chromosome. It is named after John H. Edwards, who first described the syndrome in 1960"}, {"url": "http://ghr.nlm.nih.gov/condition/trisomy-18", "passage_text": "Trisomy 18, also called Edwards syndrome, is a chromosomal condition associated with abnormalities in many parts of the body. Individuals with trisomy 18 often have slow growth before birth (intrauterine growth retardation) and a low birth weight. "}, {"url": "https://en.wikipedia.org/wiki/Edwards_syndrome", "passage_text": "Edwards syndrome is a chromosomal abnormality characterized by the presence of an extra copy of genetic material on the 18th chromosome, either in whole (trisomy 18) or in part (such as due to translocations). The additional chromosome usually occurs before conception. It is the second-most common autosomal trisomy, after Down syndrome, that carries to term. Edwards syndrome occurs in around one in 6,000 live births, and around 80% of those affected are female. The majority of fetuses with the syndrome die before birth. The incidence increases as the mother's age increases."}, {"url": "https://en.wikipedia.org/wiki/Edwards_syndrome", "passage_text": "Edwards syndrome (also known as trisomy 18 [ T18 ]) is a chromosomal abnormality caused by the presence of all, or part of, an extra 18th chromosome. This genetic condition almost always results from nondisjunction during meiosis. It is the second-most common autosomal trisomy, after Down syndrome, that carries to term. Edwards syndrome occurs in around one in 6,000 live births, and around 80% of those affected are female. The majority of fetuses with the syndrome die before birth. The incidence increases as the mother's age increases."}, {"url": "http://www.disabled-world.com/disability/types/edwards-syndrome.php", "passage_text": "Edward's syndrome affects more girls than boys-around 80 percent of those affected are female.. Defining Edward's Syndrome. Edwards Syndrome (also known as Trisomy 18 (T18) or Trisomy E) is a genetic disorder caused by the presence of all or part of an extra 18th chromosome. Edward's Syndrome (also known as Trisomy 18 (T18) or Trisomy E) is a genetic disorder caused by the presence of all or part of an extra 18th chromosome. It is named after John H. Edwards, who first described the syndrome in 1960"}, {"url": "http://symptomstreatment.org/edwards-syndrome/", "passage_text": "Edwards syndrome is caused by a meiotic nondisjunction event. With nondisjunction, a gamete (i.e., a sperm or egg cell) is produced with an extra copy of chromosome 18. The gamete thus has 24 chromosomes. – by admin 0. Edwards syndrome is a genetic disorder, in which a person has a third copy of material from chromosome 18, instead of the usual two copies. It is three times more common in girls than boys."}, {"url": "http://www.nhs.uk/conditions/edwards-syndrome/Pages/Introduction.aspx", "passage_text": "Edwards' syndrome, also known as trisomy 18, is a serious genetic condition caused by an additional copy of chromosome 18 in some or all of the cells in the body. "}]