[{"url": "http://www.calpoly.edu/~mforte/dream/p3.html", "passage_text": "The light reactions and the Calvin cycle cooperate in converting light energy to the chemical energy of food: an overview. The equation for photosynthesis is a deceptively simple summary of a very complex process. Actually, photosynthesis is not a single process, but two, each with multiple steps."}, {"url": "http://plantphys.info/plant_physiology/calvincycle.shtml", "passage_text": "3-PGA is a three-carbon sugar-phosphate. This fact means that the Calvin cycle is sometimes called C-3 photosynthesis too...the product of carbon fixation is a 3-carbon molecule. Next, the 3-PGA is energized and reduced by ATP and NADPH from the light reactions. This phase is labeled a reduction phase."}, {"url": "http://www.eschooltoday.com/photosynthesis/dark-and-light-reactions.html", "passage_text": "Dark reactions make use of these organic energy molecules (ATP and NADPH). This reaction cycle is also called Calvin Benison Cycle, and it occurs in the stroma. ATP provides the energy, while NADPH provides the electrons required to fix the CO2(carbon dioxide) into carbohydrates."}, {"url": "http://chemistry.about.com/od/lecturenoteslab1/ss/Calvin-Cycle.htm", "passage_text": "The Calvin cycle is part of photosynthesis, which occurs in two stages. In the first state, chemical reactions use energy from light to produce ATP and NADPH. In the second stage (Calvin cycle or dark reactions), carbon dioxide and water are converted into organic molecules, such as glucose."}, {"url": "http://www.calpoly.edu/~mforte/dream/p3.html", "passage_text": "Thus, it is the Calvin cycle that makes sugar, but it can do so only with the help of the NADPH and ATP produced by the fight reactions. The metabolic steps of the Calvin cycle are sometimes referred to as the dark reactions, or fight-independent reactions, because none of the steps requires light directly."}, {"url": "https://simple.wikipedia.org/wiki/Light-independent_reaction", "passage_text": "Light-independent reactions take place in plant chloroplasts. In this process sugars are made from carbon dioxide. The process, known as the Calvin cycle, uses products of the light-dependent reactions (ATP and NADPH) and various enzymes. Therefore, the light-independent reaction cannot happen without the light-dependent reaction. Sugars made in the light-independent reactions are then moved around the plant by translocation."}, {"url": "http://www.calpoly.edu/~mforte/dream/p3.html", "passage_text": "Thus, light energy is initially converted to chemical energy in the form of two compounds: NADPH, a source of energized electrons (reducing power); and ATP, the versatile energy currency o that the light reactions produce no sugar; that happens in the second stage of photosynthesis, the Calvin cycle."}, {"url": "http://www.answers.com/Q/Why_are_the_reactions_of_the_Calvin_cycle_also_called_light_independent_reaction", "passage_text": "The light reactions of photosynthesis are also called light dependent reactions. Edit. Share to: 1  The Chemiluminescence Reaction and Its Uses The term chemiluminescence reaction is used to describe light that is created by a chemical reaction."}]