[{"url": "http://www.healthgrades.com/symptoms/neck-itch", "passage_text": "A neck itch is a tickling, irritating sensation accompanied by the persistent need to scratch your neck. The medical term for itching is pruritus. Redness, swelling, soreness, flaking and scarring may occur in the area of itching. Most cases of neck itch are mild and resolve on their own, but your health care provider should evaluate itching that is sudden, severe or unusual. Itching caused by a serious food allergy can come on rapidly with a strong need to scratch."}, {"url": "http://inpurespirit.com/191/the-meaning-of-itches-and-their-omens/", "passage_text": "An itch in the Inside of the nose. You will meet trouble and sorrow. An itchy outside of the nose. You will be annoyed, cursed, kissed or meet with a fool soon. Itchy lips. Someone is saying something disrespectful to you. Itchy back of the neck. There will be an illness in your family. Itching is sometimes thought of as one of the manifestations of the human body connected with omens and fortune. An itchy crown of the head. You will have an advance in position. An itchy right cheek. Someone is speaking well of you. An itchy left cheek. Someone is speaking poorly of you."}, {"url": "http://www.healthgrades.com/symptoms/neck-itch", "passage_text": "Eczema and contact dermatitis are potential causes of neck itch, as are head lice, scabies, and pinworm. Obstructive biliary disease, caused by a blockage of the bile ducts, is condition that causes severe itching. Chronic kidney disease can also cause generalized itching. Most cases of neck itch are mild and resolve on their own, but your health care provider should evaluate itching that is sudden, severe or unusual. Itching caused by a serious food allergy can come on rapidly with a strong need to scratch."}, {"url": "http://www.ehow.com/about_6533753_neck-itch_.html", "passage_text": "Causes. Your neck can itch as a result of an allergic reaction to perfume, soaps, food, medication, cosmetics or jewelry, as well as insect bites, lice, sunburn, sunspots and even herpes zoster. In addition, skin conditions such as acne, eczema, tinea or impetigo can be the root of the problem"}, {"url": "http://www.answers.com/Q/Why_does_your_back_itch_after_you_cough_a_bunch", "passage_text": "An itch is a very slight form of pain from your nerves. There is usually something touching you and your body feels threatened by the contact, and so you itch to remove it fro … m your skin. In bites and stings it's because the nerves are stimulated by the poison/acid/alkali released into the bite. I have this sensation too. It is not skin related (unless it is an allergic reaction that makes you both cough and have a rash), but rather a nervous symptom-that is, related to the nerves in your chest."}, {"url": "http://www.healthgrades.com/symptoms/neck-itch", "passage_text": "Causes of neck itch are numerous and include insect bites, allergies, infections, and trauma. When wounds are healing they often start to itch, which is a sign of improvement. Chickenpox, an extremely common childhood illness, is accompanied by red, oozing blisters that cause intense itching. Most cases of neck itch are mild and resolve on their own, but your health care provider should evaluate itching that is sudden, severe or unusual. Itching caused by a serious food allergy can come on rapidly with a strong need to scratch."}, {"url": "http://www.everydayhealth.com/skin-and-beauty/why-does-my-skin-itch.aspx", "passage_text": "Your itchy skin spots can be a simple case of dry skin or part of a skin condition with noticeable signs, like the hives or rash from an allergic reaction. However, in some cases the reason for the itch could be more serious. Diseases as varied as kidney failure, hepatitis, and HIV can cause itching. Eczema. Itchy skin spots may be from eczema or dermatitis, the catch-all name for inflammation of the skin. There are a few types of eczemas or inflammatory skin conditions that cause itchy skin spots: 1  Atopic dermatitis."}, {"url": "http://ashrt.blogspot.com/2011/01/meaning-of-itches.html", "passage_text": "The meaning of Itches. The other day my right palm was itching and with old wives tales it means i would gain some money where the left palm means i would loose some money and it got me thinking are there other there other wives tales for other parts of your body that itches and well it seems there is. "}, {"url": "http://www.ehow.com/about_6533753_neck-itch_.html", "passage_text": "Elimination. Use the process of elimination if you think your neck itchiness is caused by an allergic reaction. If the itchiness cropped up suddenly after using a new cosmetic, hair dye, skin lotion, shampoo, soap, detergent or perfume, stop using that particular product. Your neck can itch as a result of an allergic reaction to perfume, soaps, food, medication, cosmetics or jewelry, as well as insect bites, lice, sunburn, sunspots and even herpes zoster."}]