[{"url": "https://en.wikipedia.org/wiki/Oriya_language", "passage_text": "Mughalbandi Odia is considered as proper or Standard Odia due to literary traditions. Mughalbandi Odia is spoken in Puri, Khurdha, Cuttack, Jajpur, Jagatsinghpur, Kendrapada, Anandapur, Dhenkanal, Angul and Nayagarh district with little variance. Odia speakers are regarded as one of the ‘Transnational Ethnic Indian Groups’. In India, the language is spoken by over 31 million people, and globally over 45 million speak Odia. It is one of the official languages of India and the major language of Odisha."}, {"url": "https://en.wikipedia.org/wiki/Oriya_language", "passage_text": "Odia /əˈdiːə/ or Oriya /ɒˈriːə/ , both renderings of ଓଡ଼ିଆ oṛiā (help·info) , is an Indian language belonging to the Indo-Aryan branch of the Indo-European language family. Odia speakers are regarded as one of the ‘Transnational Ethnic Indian Groups’. In India, the language is spoken by over 31 million people, and globally over 45 million speak Odia. It is one of the official languages of India and the major language of Odisha."}, {"url": "https://en.wikipedia.org/wiki/Oriya_language", "passage_text": "It is the predominant language of the Indian state of Odisha, where native speakers comprise 80% of the population, and it is spoken in parts of West Bengal, Jharkhand, Chhattisgarh and Andhra Pradesh. Odia speakers are regarded as one of the ‘Transnational Ethnic Indian Groups’. In India, the language is spoken by over 31 million people, and globally over 45 million speak Odia. It is one of the official languages of India and the major language of Odisha."}, {"url": "http://wikitravel.org/en/Odia_phrasebook", "passage_text": "Odia phrasebook. Odia (formerly known as Oriya) is an Indian language, belonging to the Indo-Aryan branch of the Indo-European language family. There are about 40 million Odia speakers, mainly in the Indian state of Odisha. The language is also one of the many official languages in India. "}, {"url": "https://en.wikipedia.org/wiki/Oriya_language", "passage_text": "Odia is the sixth Indian language to be designated a Classical Language in India on the basis of having a long literary history and not having borrowed extensively from other languages. Odia speakers are regarded as one of the ‘Transnational Ethnic Indian Groups’. In India, the language is spoken by over 31 million people, and globally over 45 million speak Odia. It is one of the official languages of India and the major language of Odisha."}, {"url": "http://www.odia.org/sanskrit/allSansBooks.php", "passage_text": "This is an effort to publish the vedic sukta, stotra, mantra and books in Odia (Oriya) script. We have taken care to display the vedic accent (swara mark) for easy chanting. Most of the texts are available in ITRANS format at www.sanskritdocuments.org. "}, {"url": "http://www.omniglot.com/writing/oriya.htm", "passage_text": "Odia. Odia is an Indo-Aryan language spoken by about 33 million people mainly in the Indian state of Odisha, and also in West Bengal, Jharkhand, and Gujarat. Odia is closely related to Bengali and Assamese, and used to be known as Oriya, and Odisha used to be known as Orissa in English. Written Odia. The Odia script developed from the Kalinga script, one of the many descendents of the Brahmi script of ancient India. The earliest known inscription in the Odia language, in the Kalinga script, dates from 1051."}, {"url": "https://en.wikipedia.org/wiki/Oriya_alphabet", "passage_text": "Kharabela's inscription in Kalinga script and Odia language at Hatigumpha, Khandagiri, Bhubaneswar. The Odia script is developed from the Kalinga alphabet, one of the many descendants of the Brahmi script of ancient India. The earliest known inscription in the Odia language, in the Kalinga script, dates from 1051. The script has undergone through several phases. They are broadly:"}]