[{"url": "http://swz.salary.com/salarywizard/layouthtmls/swzl_compresult_national_FA06000757.html", "passage_text": "The median expected salary for a typical Fixed Income Analyst, Sr. in the United States is $74,789. This basic market pricing report was prepared using our Certified Compensation Professionals' analysis of survey data collected from thousands of HR departments at employers of all sizes, industries and geographies."}, {"url": "https://www.fidelity.com/calculators-tools/retirement/overview", "passage_text": "Our calculators & tools will help you take the guesswork out of saving for retirement and assist in building an income strategy to meet your needs. 1  800-343-3548 800-343-3548."}, {"url": "http://www.payscale.com/research/US/Job=Trader%2c_Fixed_Income/Salary", "passage_text": "Job Description for Trader, Fixed Income. 1  Monitor market news and conditions to support advisors and their clients. 2  Seek business opportunities with potential fixed income clients. 3  Stay current with security industry rules and regulations, policies and procedures regarding the securities industry. 4  Buy and sell (trade) securities on behalf of 5  ... Un"}, {"url": "http://www.payscale.com/research/US/Job=Program_Evaluator/Salary", "passage_text": "Program Evaluators with one to two decades of relevant experience report an average salary of approximately $64K. Program Evaluators who have acquired more than 20 years of relevant experience earn significantly more than folks with fewer years on their resumes; the average income in this veteran group is $75K."}, {"url": "http://www.investopedia.com/terms/f/fixedincome.asp", "passage_text": "A type of investing or budgeting style for which real return rates or periodic income is received at regular intervals at reasonably predictable levels. Fixed-income budgeters and investors are often one and the same-typically retired individuals who rely on their investments to provide a regular, stable income stream. This demographic tends to invest heavily in fixed-income investments because of the reliable returns they offer."}, {"url": "https://www.fidelity.com/fixed-income-bonds/fixed-income-tools-services/overview", "passage_text": "Fixed Income Tools & Services. Fidelity offers a wide range of tools and services to help you create a retirement income strategy, manage your fixed income portfolio with laddered maturities, stay on top of market updates, and more. Most tools can be used directly online at Fidelity.com."}]