[{"url": "http://www.businessdictionary.com/definition/membership.html", "passage_text": "Definition. Belonging, either individually or collectively, to a group. Some memberships may require a fee to join or participate while some do not. Others, as in the case of MENSA, have specific skill requirements that must be reached prior to be accepted into the group. Special privileges or benefits are entitled to members although not all members may have the same rights and privileges."}, {"url": "https://msdn.microsoft.com/en-us/library/ms676913(v=vs.85).aspx", "passage_text": "The scope of the group defines what types of object can belong to the group, what types of groups the group can be a member of and the scope of objects that security groups can be given access to. When the domain functional level is set to Windows 2000 mixed mode, security groups with universal scope cannot be created. Accounts from the same domain. Other global groups from the same domain. Can be converted to universal scope as long as the group is not a member of any other global group. On any domain in the same forest or trusting domains or forests. Universal groups from any domain in the same forest. Other global groups from the same domain"}, {"url": "http://dictionary.reverso.net/english-definition/group%20membership", "passage_text": "13 (Maths) a set under an operation involving any two members of the set such that the set is closed, associative, and contains both an identity and the inverse of each member. 14 See → blood group. vb. 15 to arrange or place (things, people, etc.) in or into a group or (of things, etc.) to form into a group. "}, {"url": "http://www.merriam-webster.com/dictionary/membership", "passage_text": "Tweet. : the state of belonging to or being a part of a group or an organization: the state of being a member. : all the people or things that belong to or are part of an organization or a group. Full Definition of MEMBERSHIP. 1. : the state or status of being a member. 2. 3. : the relation between an element of a set or class and the set or class — compare inclusion 3a."}, {"url": "https://en.wikipedia.org/wiki/Social_group", "passage_text": "In-group. It is a social group toward which a member feels respect and loyalty. It is a group that an individual identifies in positive direction. If a person is part of the in-group then they are collectively part of an inner circle of friends. An inner circle may contain sub-groups within the inner circle including the apex (best friends), core (very close friends), outer rim, etc. This is usually a small group, of around 3 to 15 people, who work as a team to accomplish their goals. Dyad. This is a social group with two members. Social interaction in a dyad is typically more intense than in larger groups because neither member shares the other's attention with anyone else."}, {"url": "https://technet.microsoft.com/en-us/library/dd638105(v=exchg.150).aspx", "passage_text": "Management role group The management role group is a special USG that contains mailboxes, USGs, and other role groups that are members of the role group. This is where you add and remove members, and it's also what management roles are assigned to. If so, you can use role group delegation. Role group delegation is controlled by the ManagedBy property on each role group. The ManagedBy property contains a list of users who can add and remove members to and from that role group or change the configuration of a"}, {"url": "http://www.merriam-webster.com/dictionary/member", "passage_text": "Tweet. : someone or something that belongs to or is a part of a group or an organization. : a part of a structure (such as a building or a bridge). : a body part (such as an arm or a leg). "}, {"url": "http://psychologydictionary.org/membership-group/", "passage_text": "is a process which usually either informally or formally accepts members into its ranks granting them membership. Groups such as this include-societies, clubs, teams, cliques and political parties. MEMBERSHIP GROUP: A membership group typically has a formal process before a member of the public can be recognized as one of the group-a member.."}, {"url": "https://technet.microsoft.com/en-us/library/dd638105(v=exchg.150).aspx", "passage_text": "A management role group is a universal security group (USG) used in the Role Based Access Control (RBAC) permissions model in Microsoft Exchange Server 2013. A management role group simplifies the assignment of management roles to a group of users. If so, you can use role group delegation. Role group delegation is controlled by the ManagedBy property on each role group. The ManagedBy property contains a list of users who can add and remove members to and from that role group or change the configuration of a"}]