[{"url": "http://www.livestrong.com/article/342257-foods-for-glandular-fever/", "passage_text": "Glandular fever, also called infectious mononucleosis, is a viral infection caused by the Epstein-Barr virus. Symptoms can include extreme fatigue, fever, sore throat, swollen lymph nodes, weakness, decreased appetite, skin rash, headaches and a swollen spleen. According to the website NHS Choices, glandular fever is usually spread from person to person through saliva. This infection usually improves within two weeks. "}, {"url": "http://www.lucyburney.co.uk/articles/glandular.html", "passage_text": "Symptoms include a fever, swollen glands, sore throat, aching muscles, overwhelming fatigue, an enlarged spleen and abnormal liver function. A child with glandular fever is likely to be very weak and tired. In young children, the virus usually lasts from two to four weeks. "}, {"url": "http://www.medicalnewstoday.com/articles/167390.php", "passage_text": "Glandular fever, also known as infectious mononucleosis, is a type of viral infection. It can cause fever, sore throat, fatigue, swollen lymph nodes and glands. Glandular fever is caused by the Epstein-Barr virus (EBV) and is one of the most common viruses that can affect humans. Extreme fatigue is a common symptom of glandular fever. 1  Flu-like symptoms. 2  As is the case with many virus infections, glandular fever often causes fever and temperature, aches, headaches, and feeling sick. 3  A skin rash can appear in some individuals."}, {"url": "http://www.nhs.uk/Conditions/Glandular-fever/Pages/Introduction.aspx", "passage_text": "Glandular fever is caused by the Epstein-Barr virus (EBV). This virus is found in the saliva of infected people and can be spread through: 1  kissing – glandular fever is often referred to as the kissing disease. 2  exposure to coughs and sneezes. "}, {"url": "http://www.remedies4.com/download/natural-help-for-glandular-fever.pdf", "passage_text": "Glandular fever symptoms are typically characterized by a sore throat, high fever, swollen lymph nodes or glands, and extreme fatigue. Glandular fever is not highly infectious, even though the most common way of spreading the virus is through saliva from person to person. Help for Glandular Fever There is no specific treatment for glandular fever and it is generally symptomatic. Rest and sleep are recommended, as well as drinking plenty of fluids to keep hydrated.Fever and pain can be treated with pain killers such as non-steroidal, anti-inflammatory drugs such as ibuprofen or aspirin."}, {"url": "http://www.healthdirect.gov.au/glandular-fever#!", "passage_text": "Glandular fever, also known as the ‘kissing disease’ occurs commonly in teenagers and young adults. Glandular fever, also known as the ‘kissing disease’ occurs commonly in teenagers and young adults. Glandular fever is caused by an infection with Epstein-Barr virus. The virus is transmitted through saliva, and can be passed from person to person through: 1  kissing (which is why it is sometimes known as the “kissing disease”)"}, {"url": "https://simple.wikipedia.org/wiki/Glandular_fever", "passage_text": "From Wikipedia, the free encyclopedia. Glandular fever is a viral infection caused by the Epstein–Barr virus. Glandular fever is often spread through oral acts such as kissing, which is why it is sometimes called the kissing disease. However, glandular fever can also be spread by airborne saliva droplets. Symptoms of glandular fever include: 1  Fever. "}, {"url": "http://www.webmd.boots.com/a-to-z-guides/understanding-glandular-fever-basics", "passage_text": "Symptoms of glandular fever include fever, sore throat, swollen neck glands and fatigue. Glandular fever is caused by the Epstein-Barr virus, or EBV, named after the two British researchers who first identified it in 1964, although the disease itself had been recognised many years earlier. Glandular fever is a viral infection with unpleasant symptoms that can last several weeks. Glandular fever affects around 1 in 200 people during their lives and mostly affects young adults aged between 15 and 24."}]