[{"url": "http://info.legalzoom.com/definition-selective-incorporation-20349.html", "passage_text": "Selective incorporation refers to the application of federal constitutional rights in the states. 14th Amendment. The concept of selective incorporation first arose with the passage of the 14th Amendment after the Civil War. This amendment laid down important new rights of citizens, including the rights to equal protection and due process."}, {"url": "http://study.com/academy/lesson/selective-incorporation-definition-doctrine.html", "passage_text": "Lesson Summary. Selective incorporation is the process in which the Supreme Court of the United States ensures that the rights guaranteed in the Constitution are not violated by the states. This is done through rulings on court cases that deal in rights violations. In this lesson we will discuss how a person's rights granted under the Constitution of the United States are protected from laws enacted by states through the process of selective incorporation. We also provide an example of selective incorporation in the case of Miranda v. Arizona."}, {"url": "http://dictionary.findlaw.com/definition/total-incorporation.html", "passage_text": ": a doctrine in constitutional law: the Fourteenth Amendment's due process clause embraces all the guarantees in the Bill of Rights and applies them to cases under state law compare selective incorporation NOTE: The total incorporation doctrine has never been adopted by a majority of the U.S. Supreme Court. "}, {"url": "https://www.legalzoom.com/articles/definition-of-selective-incorporation-what-is-selective-incorporation", "passage_text": "But it was another 57 years before the 14th Amendment’s due process clause was interpreted to extend the guarantees in the Bill of Rights to the states. Selective Incorporation of the Bill of Rights to the States. In the 1925 case of Gitlow v. New York, the Supreme Court held for the first time that the states must protect freedom of speech. They advocated a total incorporation of the Bill of Rights so that the states would be prohibited from the same actions as the federal government. Other justices advocated selective incorporation of only certain portions of the Bill of Rights."}, {"url": "http://www.buzzle.com/articles/selective-incorporation.html", "passage_text": "In most places, the definition of selective incorporation is nothing but a doctrine of the Constitution, whereby certain provisions from the Bill of Rights are made applicable to the state governments, as per the 'due process' clause of the Fourteenth Amendment of the Constitution. Selective Incorporation of the Bill of Rights. In simple words, the selective incorporation doctrine states that some provisions that are present in the Bill of Rights of the Constitution are made applicable to certain states as well. In order to understand further, we must know what the Bill of Rights is"}, {"url": "http://study.com/academy/lesson/selective-incorporation-definition-doctrine.html", "passage_text": "Definition. Selective incorporation is the process that has evolved over the years, through court cases and rulings, used by the United Supreme Court to insure the rights of the people are not violated by state laws or procedures. In this lesson we will discuss how a person's rights granted under the Constitution of the United States are protected from laws enacted by states through the process of selective incorporation. We also provide an example of selective incorporation in the case of Miranda v. Arizona."}, {"url": "http://dictionary.findlaw.com/definition/selective-incorporation.html", "passage_text": ": a theory or doctrine of constitutional law that those rights guaranteed by the first eight amendments to the U.S. Constitution that are fundamental to and implicit in the concept of ordered liberty are incorporated into the Fourteenth Amendment's due process clause compare total incorporation. "}, {"url": "http://info.legalzoom.com/meant-selective-incorporation-20152.html", "passage_text": "Selective incorporation is a constitutional doctrine that ensures states cannot enact laws that take away the constitutional rights of American citizens that are enshrined in the Bill of Rights. Selective incorporation is not a law, but has been established over time through court cases and rulings by the United States Supreme Court. At its heart, selective incorporation is about the ability of the federal government to limit the states' lawmaking powers."}, {"url": "http://info.legalzoom.com/definition-selective-incorporation-20349.html", "passage_text": "Selective incorporation is an important term in constitutional law, a part of the long debate over the powers of the federal government versus that of the individual states. 14th Amendment. The concept of selective incorporation first arose with the passage of the 14th Amendment after the Civil War. This amendment laid down important new rights of citizens, including the rights to equal protection and due process."}]