[{"url": "http://www.in2greece.com/english/places/historical/islands/knossos.htm", "passage_text": "Knossos is probably one of the most impressive archaeological sites that anyone can visit in today's Greece. It was once the centre of one of the most powerful civilizations of the ancient world and through excavations, mythology and history it tells us the story of its people, the Masters of the Sea: the Minoans."}, {"url": "http://www.greece-travel-secrets.com/Knossos.html", "passage_text": "one of the best things to do on Crete. The Royal Minoan Palace at Knossos was built on a vast scale, with over 1200 rooms, and it remains the prime tourist attraction on Crete."}, {"url": "http://greece.greekreporter.com/2013/05/06/the-famous-palace-of-knossos-and-its-history/", "passage_text": "Knossos, the famous Minoan Palace lies five kilometers southeast of Heraklion, in the valley of the river Kairatos, in Crete. Ιn Greek mythology, the Palace of Knossos was the residence of the mythical King Minos, the son of Zeus and Europa."}, {"url": "http://greece.greekreporter.com/2013/05/06/the-famous-palace-of-knossos-and-its-history/", "passage_text": "Knossos is the largest Bronze Age archaeological site on Crete, but sections of it were built during different historic periods such as the Neolithic and the Classical period. Around 1700 BC, according to one theory, a powerful earthquake shook the Aegean Sea, devastating Crete."}, {"url": "http://ancient-greece.org/archaeology/knossos.html", "passage_text": "Knossos was inhabited for several thousand years, beginning with a neolithic settlement sometime in the seventh millennium BC, and was abandoned after its destruction in 1375 BC which marked the end of Minoan civilization."}, {"url": "http://ancient-greece.org/archaeology/knossos.html", "passage_text": "Knossos was undeniably the capital of Minoan Crete. It is grander, more complex, and more flamboyant than any of the other palaces known to us, and it is located about twenty minutes south of the modern port town of Iraklio."}, {"url": "http://www.visitgreece.gr/en/culture/archaeological_sites/knossos", "passage_text": "Knossos is the site of the most important and better known palace of Minoan civilisation. According to tradition, it was the seat of the legendary king Minos. The Palace is also connected with thrilling legends, such as the myth of the Labyrinth with the Minotaur, and the story of Daidalos and Icaros."}, {"url": "http://minoancivilization.net/Knossos.html", "passage_text": "Knossos was the capital city of Minoan culture that centered on the island of Crete. The Minoan civilization at Knossos represented a cultural high point in the Mediterranean Sea. According to Greek mythology, it was the capital of King Minos and the home of the labyrinth. Many details about the Minoan culture in Knossos remain lost to history. What is known about Knossos comes mainly from archaeological findings, specifically those of Sir Arthur Evans."}]