[{"url": "http://study.com/basic_adult_education.html", "passage_text": "Basic adult education programs are non-degree programs that offer training for adults. Programs may prepare students to take the GED test, help them strengthen their reading levels or provide them with important life skills. Read on for more information about what is covered in basic adult education programs. Some schools offer GED training and other adult basic education online. Classes in reading, writing and mathematics can often be taken online; students with lower than ninth-grade reading or math skills are often given remote assignments to help them reach this level."}, {"url": "http://www.unescobkk.org/education/resources/resources/education-system-profiles/thailand/basic-education/", "passage_text": "Basic education in Thailand extends from grades 1-12. It consists of six years of primary education, three years of lower secondary, and three years of upper secondary education. The entry age into basic education is at the age of 6. The gross enrolment ratio in lower secondary education is over 90% and for upper secondary education it is about 60% in 2010. Equality in terms of gender parity index (GPI) is impressive, with almost 1:00 for every level of basic education (UIS n.d. )."}, {"url": "https://en.wikipedia.org/wiki/Basic_education", "passage_text": "(Discuss) Proposed since June 2013. Basic education refers to the whole range of educational activities taking place in various settings (formal, non formal and informal), that aim to meet basic learning needs. According to the International Standard Classification of Education (ISCED), basic education comprises primary education (first stage of basic education) and lower secondary education (second stage)."}, {"url": "https://en.wikipedia.org/wiki/Basic_education", "passage_text": "In countries (developing countries in particular), Basic Education often includes also pre-primary education and/or adult literacy programs. Universal basic education is regarded as a priority for developing countries and is the focus of the Education For All movement led by UNESCO. It is also included in the Millennium Development Goals as Goal number 2: Achieve Universal Primary Education by 2015. According to the International Standard Classification of Education (ISCED), basic education comprises primary education (first stage of basic education) and lower secondary education (second stage)."}, {"url": "http://www.ncc.edu/programsandcourses/academic_departments/reading_basic_education/", "passage_text": "Reading and Basic Education. All matriculated students placing in remedial Reading, English and Math are offered a place in the Basic Education Program (BEP). Students are required to successfully complete this program before being permitted to register for the next level of courses in Reading, English and Math. The Reading and Basic Education Lab/Help Centers are department resources that provide the students with reinforcement and tutorial services. The contact information for the various facilities is as follows: 1  Reading 001 Help Center-Building M, Room 207; 516.572.7465."}, {"url": "http://www.ctb.com/ctb.com/control/productFamilyViewAction?productFamilyId=608&p=products", "passage_text": "TABE Overview. TABE® remains the most comprehensive and reliable academic assessment product in adult basic education. Educators use TABE testing to provide a solid foundation for effectively assessing the skills and knowledge of adult learners. "}, {"url": "http://www.ride.ri.gov/InformationAccountability/Accountability/BasicEducationProgram.aspx", "passage_text": "Basic Education Program. The Basic Education Program (BEP) is the overarching set of regulations for the Rhode Island public education system. Together with other federal and state laws and regulations, the BEP outlines the rights of every student in the Rhode Island public education system. It sets basic standards to help ensure that high‐quality education is available to all public school students, regardless of where they live or go to school."}, {"url": "http://stand.org/washington/blog/2013/02/12/what-does-basic-education-mean", "passage_text": "The legislature decides which specific educational programs are included in “Basic Education.” For example, preschool (pre-K) is not currently part of Basic Education. Basic Education is a technical term defined by the Washington State Legislature, meant to capture the knowledge and skills needed to participate in the economy and in our democracy and meant to comply with our state's constitutional paramount duty."}, {"url": "http://www.unesco.org/education/framework.pdf", "passage_text": "YEMEN: Basic education in Yemen is comprised of grade 1 to 9 and is based on the National Constitution of 1994 (article 53) and Education Law (1992). The articles of the General Education Law indicate that education is a basic human right for all citizens. The Education Act of 1961 established the policy of free and compulsory primary and basic education for all school age children: Primary education, or the first stage of basic education, lasts six years and is compulsory. Primary education is divided into two three-year cycles: lower and upper primary."}]