[{"url": "http://www.merriam-webster.com/dictionary/eloquence", "passage_text": "Definition of ELOQUENCE for Kids. 1. : speaking or writing that is forceful and convincing. 2. : the ability to speak or write with force and in a convincing way. Full Definition of ELOQUENCE. 1. : discourse marked by force and persuasiveness; also: the art or power of using such discourse. 2. : the quality of forceful or persuasive expressiveness. See eloquence defined for English-language learners."}, {"url": "https://en.wikiquote.org/wiki/Eloquence", "passage_text": "Eloquence (from Latin eloquentia) is fluent, forcible, elegant or persuasive speaking in public. It is primarily the power of expressing strong emotions in striking and appropriate language, thereby producing conviction or persuasion. Sixteenth century [edit]. 1  Does the painter imitate the body correctly if he guides his brush without any method, and if his hand is moved at random and the lines are not drawn with art? 2  Philipp Melanchthon, “Praise of eloquence” (1523), Orations on Philosophy and Education, C. Salazar, trans. 3  You can see for what reason I commend the study of 4  ... P"}, {"url": "https://en.wikipedia.org/wiki/Eloquence", "passage_text": "Thus, being eloquent is having the ability to project words fluidly out of the mouth and the ability to understand and command the language in such a way that one employs a graceful style coupled with the power of persuasion, or just being extremely graceful in the interpretation of communication. In modern times, colloquial speech entered into presentation styles deemed eloquent. Eloquence is both a natural talent and improved by knowledge of language, study of a specific subject to be addressed, philosophy, rationale and ability to form a persuasive set of tenets within a presentation."}, {"url": "http://www.wikihow.com/Speak-Eloquently", "passage_text": "2. Use what you know. Make attempts to learn new vocabulary whenever possible, but when you’re speaking, stick to words you know. One of the least eloquent things you can do is misuse a large vocabulary word, or combine too many large vocabulary words and leave your listener confused. 1. Overcome speaking and social anxieties. It will be incredibly difficult to sound eloquent if your voice quivers, you speak too quietly, or you get a stutter when you begin speaking. Take the necessary measures to overcome these social anxieties by visiting a speech pathologist, speech therapist, or a counselor."}, {"url": "http://grammar.about.com/od/e/g/eloquencetrem.htm", "passage_text": "1 (Cicero, The Orator).  2 In a word, to feel your subject thoroughly, and to speak without fear, are the only rules of eloquence 3  .. (Oliver Goldsmith, Of Eloquence, 1759).  4 Today it is not the classroom nor the classics which are the repositories of models of eloquence, but the ad agencies.. 1 Talking and eloquence are not the same: to speak and to speak well are two things.. ( 2 Ben Jonson, Timber, or Discoveries, 1630).  3 They are eloquent who can speak low things acutely, and of great things with dignity, and of moderate things with temper.."}, {"url": "http://www.definitions.net/definition/Eloquence", "passage_text": "Eloquence. Eloquence is fluent, forcible, elegant or persuasive speaking. It is primarily the power of expressing strong emotions in striking and appropriate language, thereby producing conviction or persuasion. The term is also used for writing in a fluent style. The concept of eloquence dates to the ancient Greeks, Calliope, being the Muse of epic poetry and e"}, {"url": "http://grammar.about.com/od/e/g/eloquencetrem.htm", "passage_text": "1 In a word, to feel your subject thoroughly, and to speak without fear, are the only rules of eloquence 2  .. (Oliver Goldsmith, Of Eloquence, 1759).  3 Today it is not the classroom nor the classics which are the repositories of models of eloquence, but the ad agencies.. 1 Talking and eloquence are not the same: to speak and to speak well are two things.. ( 2 Ben Jonson, Timber, or Discoveries, 1630).  3 They are eloquent who can speak low things acutely, and of great things with dignity, and of moderate things with temper.."}, {"url": "http://grammar.about.com/od/e/g/eloquencetrem.htm", "passage_text": "1 They are eloquent who can speak low things acutely, and of great things with dignity, and of moderate things with temper.. ( 2 Cicero, The Orator).  3 In a word, to feel your subject thoroughly, and to speak without fear, are the only rules of eloquence 4  .. (Oliver Goldsmith, Of Eloquence, 1759). 1 Talking and eloquence are not the same: to speak and to speak well are two things.. ( 2 Ben Jonson, Timber, or Discoveries, 1630).  3"}, {"url": "https://en.wikipedia.org/wiki/Eloquence", "passage_text": "Eloquence (from Latin eloquentia) is fluent, forcible, elegant or persuasive speaking. It is primarily the power of expressing strong emotions in striking and appropriate language, thereby producing conviction or persuasion. The term is also used for writing in a fluent style. The concept of eloquence dates to the ancient Greeks, Calliope, (one of the nine daughters of Zeus and Mnemosyne) being the Muse of epic poetry and eloquence. In modern times, colloquial speech entered into presentation styles deemed eloquent. Eloquence is both a natural talent and improved by knowledge of language, study of a specific subject to be addressed, philosophy, rationale and ability to form a persuasive set of tenets within a presentation."}]