[{"url": "https://en.wikipedia.org/wiki/Project_M_(video_game)", "passage_text": "Project M first began as a development project to rework Falco to play like his incarnation in Super Smash Bros. Melee. The designers' goal at the time was for the game to be accessible to newcomers and encourage people to get better at the game, which was accomplished by better balancing the characters. Project M includes a number of adjustments and tweaks intended to make the characters from Super Smash Bros. Melee and Brawl more balanced, as well as add touches that felt more true to their games of origin."}, {"url": "http://smashboards.com/threads/project-m-vs-melee.280910/", "passage_text": "As for Project M....You can only compare it to Melee because its not done. Once it is finished then you can't compare it to melee because...it'll be melee with more. just letting you know in advance to stfu and just...don't post here..... Something that is trying to be Melee will never be as good as real Melee. So it wont change thing, or if anything people will go O lemme try project M.. Then they will realize how much they miss Melee and how better of a game it was and we might get more people to show up. This is unlikely though."}, {"url": "http://www.ign.com/boards/threads/smash-bros-wii-u-vs-project-m.453438059/", "passage_text": "with that said, project M is still a mod of brawl, and while its without question the most detailed, and best fan made mod of any game(least IMO, most certainly the best of any console game that's for sure), its not a 100% new smash. The only way we'll find out for sure if this new Smash is going to be on the levels of Project M or Melee is by trying the game out for ourselves, it's hard to judge the balance and speed of the game from trailers and demonstrations because it's not the pros playing it."}, {"url": "https://en.wikipedia.org/wiki/Project_M_(video_game)", "passage_text": "Project M also brings back the characters Mewtwo and Roy, who were present in Melee but did not return for Brawl. In addition, it features a new art style for in-game menus and allows players to choose certain characters individually when they are only accessible as extensions of other ones in Brawl. Project M includes a number of adjustments and tweaks intended to make the characters from Super Smash Bros. Melee and Brawl more balanced, as well as add touches that felt more true to their games of origin."}, {"url": "http://www.ign.com/boards/threads/smash-bros-wii-u-vs-project-m.453438059/", "passage_text": "It is more balanced, the move sets for each characters are better than Brawl's and it feels more fluid/easier to play with Melee physics. I can honestly say everything that is being teased for future updates has made more excited for Project M than SSB4. The only way we'll find out for sure if this new Smash is going to be on the levels of Project M or Melee is by trying the game out for ourselves, it's hard to judge the balance and speed of the game from trailers and demonstrations because it's not the pros playing it."}, {"url": "http://smashboards.com/threads/comparing-melee-and-project-m.337585/", "passage_text": "Tegucigalpa, Honduras. It just annoys me how peopple say: project m is WAY better than melee but when a melee player says that in his opinion melee still better his a fox main hanging onto melee for a long time. dont get me wrong Project M is awesome. Click to expand... Tero. "}, {"url": "http://www.gamefaqs.com/boards/633202-super-smash-bros-for-wii-u/70548192", "passage_text": "#3 Someguy_13 Posted 11/11/2014 1:30:20 PM. I prefer Project M, since it plays not exactly, but similarly to Melee, but has Brawl's better cast (and actually a better roster than Brawl since it adds characters). I know there's some die hard Melee fans who prefer that though. "}, {"url": "http://www.ign.com/boards/threads/smash-bros-wii-u-vs-project-m.453438059/", "passage_text": "I think Smash 4 will try to offer a completely new experience as well, which I wouldn't find with Project M, I'd rather play Melee instead(and I do). tl;dr version: Smash 4 has Megaman, Project M doesn't, thus for the time being, SSB4 is better. No arguments. The only way we'll find out for sure if this new Smash is going to be on the levels of Project M or Melee is by trying the game out for ourselves, it's hard to judge the balance and speed of the game from trailers and demonstrations because it's not the pros playing it."}, {"url": "http://www.ssbwiki.com/Project_M", "passage_text": "The logo for Project M. Project M is a gameplay modification of Super Smash Bros. Brawl designed to make the gameplay more closely resemble that of Super Smash Bros. Melee mainly, and also Super Smash Bros. to a lesser extent. This means that the speed of gameplay has been generally increased, with many Melee mechanics being restored. Final Destination. Reverted to Melee 's version to fix issues with getting stuck underneath Brawl 's edges when returning (despite a Project M fix for Brawl 's Final Destination already being available). Also replaces Opening (Super Smash Bros. Melee) with Multi-Man Melee 2."}]