[{"url": "http://www.purplemath.com/modules/numbbase3.htm", "passage_text": "Octal. An older computer base system is octal, or base eight. The digits in octal math are 0, 1, 2, 3, 4, 5, 6, and 7. The value eight is written as  1 eight and 0 ones, or 108. 1  Convert 35710 to the corresponding base-eight number. Sections: Introduction & binary numbers, Base 4 & base 7, Octal & hexadecimal. "}, {"url": "https://en.wikipedia.org/wiki/Octal", "passage_text": "The octal numeral system, or oct for short, is the base -8 number system, and uses the digits 0 to 7. Octal numerals can be made from binary numerals by grouping consecutive binary digits into groups of three (starting from the right). For example, the binary representation for decimal 74 is 1001010, which can be grouped into (00)1 001 010 – so the octal representation is 112. In the decimal system each decimal place is a power of ten."}, {"url": "http://tibasicdev.wikidot.com/binandhex", "passage_text": "Binary, hexadecimal, and octal refer to different number systems. The one that we typically use is called decimal. These number systems refer to the number of symbols used to represent numbers. In the decimal system, we use ten different symbols: 0, 1, 2, 3, 4, 5, 6, 7, 8, and 9. The hexadecimal system is Base Sixteen. As its base implies, this number system uses sixteen symbols to represent numbers. Unlike binary and octal, hexadecimal has six additional symbols that it uses beyond the conventional ones found in decimal."}, {"url": "http://whatis.techtarget.com/definition/octal", "passage_text": "Octal (pronounced AHK-tuhl, from Latin octo or eight) is a term that describes a base-8 number system. An octal number system consists of eight single-digit numbers: 0, 1, 2, 3, 4, 5, 6, and 7. The number after 7 is 10. The number after 17 is 20 and so forth. In computer programming, the octal equivalent of a binary number is sometimes used to represent it because it is shorter. "}, {"url": "http://www.webopedia.com/TERM/O/octal.html", "passage_text": "Refers to the base-8 number system, which uses just eight unique symbols (0, 1, 2, 3, 4, 5, 6, and 7). Programs often display data in octal format because it is relatively easy for humans to read and can easily be translated into binary format, which is the most important format for computers. "}, {"url": "https://kb.iu.edu/d/agxz", "passage_text": "Octal and hexadecimal notation. Because binary notation can be cumbersome, two more compact notations are often used, octal and hexadecimal. Octal notation represents data as base-8 numbers. Each digit in an octal number represents three bits. Similarly, hexadecimal notation uses base-16 numbers, representing four bits with each digit. Octal numbers use only the digits 0-7, while hexadecimal numbers use all ten base-10 digits (0-9) and the letters a-f (representing the numbers 10-15)."}, {"url": "http://www.tpub.com/neets/book13/53e.htm", "passage_text": "Base (Radix) As with the other systems, the radix, or base, is the number of symbols used in the system. The octal system uses eight symbols - 0 through 7. The base, or radix, is indicated by the subscript 8. Positional Notation The octal number system is a positional notation number system. Just as the decimal system uses powers of 10 and the binary system uses powers of 2, the octal system uses power of 8 to determine the value of a number's position. The following bar graph shows the positions and the power of the base: The terms that you learned in the decimal and binary sections are also used with the octal system. The unit remains a single object, and the number is still a symbol used to represent one or more units. Base (Radix). As with the other systems, the radix, or base, is the number of symbols used in the system. The octal system uses eight symbols - 0 through 7. The base, or radix, is indicated by the subscript 8. Positional Notation."}, {"url": "http://www.tpub.com/neets/book13/53e.htm", "passage_text": "OCTAL NUMBER SYSTEM The octal, or base 8, number system is a common system used with computers. Because of its relationship with the binary system, it is useful in programming some types of computers. Look closely at the comparison of binary and octal number systems in table 1-3. The terms that you learned in the decimal and binary sections are also used with the octal system. The unit remains a single object, and the number is still a symbol used to represent one or more units. Base (Radix). As with the other systems, the radix, or base, is the number of symbols used in the system. The octal system uses eight symbols - 0 through 7. The base, or radix, is indicated by the subscript 8. Positional Notation. The octal number system is a positional notation number system. Just as the decimal system uses powers of 10 and the binary system uses powers of 2, the octal system uses power of 8 to determine the value of a number's position. The following bar graph shows the positions and the power of the base:"}, {"url": "http://www.allaboutcircuits.com/textbook/digital/chpt-1/octal-and-hexadecimal-numeration/", "passage_text": "One of those numeration systems is called octal, because it is a place-weighted system with a base of eight. Valid ciphers include the symbols 0, 1, 2, 3, 4, 5, 6, and 7. Each place weight differs from the one next to it by a factor of eight. Incidentally, hexadecimal notation is more popular, because binary bit groupings in digital equipment are commonly multiples of eight (8, 16, 32, 64, and 128 bit), which are also multiples of 4. Octal, being based on binary bit groups of 3, doesn’t work out evenly with those common bit group sizings."}]