[{"url": "http://skincare.lovetoknow.com/Angel_Kiss_Birthmark", "passage_text": "Other Names. Angel kiss birthmarks are known as vascular birthmarks since they are caused by red blood vessels. They are also referred to as salmon spots. An angel kiss birthmark on the back of the neck is often called a stork bite. Another name a parent may hear a doctor use is macular stain. Cause of the Angel Kiss Birthmark. This birthmark is actually blood vessels, more specifically capillaries, showing through the baby's skin. During development, all babies have these blood vessels present near the skin."}, {"url": "https://en.wikipedia.org/wiki/Birthmark", "passage_text": "Vascular birthmarks (also called red birthmarks) are caused by increased blood vessels and include macular stains (salmon patches), hemangiomas, and Port-wine stains. A little over 1 in 10 babies have a vascular birthmark present by age 1. Several birthmark types are part of the group of skin lesions known as nevi or naevi, which means birthmarks in Latin. The exact cause of most birthmarks is unknown, but vascular birthmarks are not hereditary."}, {"url": "http://angelkisses.org/", "passage_text": "Our Mission. To fund Michigan-based programs that improve care available to families who experience perinatal loss, with a focus on babies delivered during the second or third trimester. "}, {"url": "http://www.babycenter.com/0_birthmarks_75.bc", "passage_text": "1 These birthmarks can become more noticeable when your baby cries or when there's a change in temperature. 2  The ones on the back of the neck, called stork bites, usually last into adulthood. 3  The ones on the forehead or eyelids, called angel kisses, usually go away by age 2. 1 The ones on the forehead or eyelids, called angel kisses, usually go away by age 2. 2  Cafe café au lait: Spots tan or light brown flat patches that sometimes appear in. 3  Multiples between 20 and 50 percent of newborns have one or two of these pigmented. "}, {"url": "http://www.babycenter.com/0_birthmarks_75.bc", "passage_text": "Some birthmarks are referred to as nevi (nevus is the singular). The most common varieties are:  1 Stork bites, angel kisses, salmon patches, and vascular stains: Blotchy pink or purple flat marks that are formed by dilated capillaries near the surface of the skin. 2  This is the most common type of birthmark, with up to 70 percent of babies having one or more. 1 The ones on the forehead or eyelids, called angel kisses, usually go away by age 2. 2  Cafe café au lait: Spots tan or light brown flat patches that sometimes appear in. 3  Multiples between 20 and 50 percent of newborns have one or two of these pigmented. "}, {"url": "https://en.wikipedia.org/wiki/Birthmark", "passage_text": "Colloquially called a stork bite, angel's kiss or salmon patch, telangiectatic nevus appears as a pink or tanned, flat, irregularly shaped mark on the knee, back of the neck, and/or the forehead, eyelids and, sometimes, the top lip. A little over 1 in 10 babies have a vascular birthmark present by age 1. Several birthmark types are part of the group of skin lesions known as nevi or naevi, which means birthmarks in Latin. The exact cause of most birthmarks is unknown, but vascular birthmarks are not hereditary."}, {"url": "https://www.breastfeedingbasics.com/qa/stork-bites-angel-kisses", "passage_text": "Salmon patches will be reddish or dark pink and can usually be found on the eyelids, nose, forehead, neck, nose, or lips. If the patch shows up on the baby’s eyelids, it’s called an ‘Angel’s Kiss’. The beautiful baby in the picture is my grand daughter Charlotte, who was born with an angel kiss on her left eye. This picture was taken when she was 6 weeks old, and the kiss was completely gone by the time she was 6 months old. Here’s a photo of Charlie a few minutes after her birth. Notice the angel’s kiss on one eye, and the vernix that is keeping the other one closed. As a doting grandmother, even I have to admit that this is not the most flattering picture of her in my collection. If the salmon patch shows up on the back of the baby’s head or neck, it’s called a “Stork Bite” . Most will disappear by the time the baby is a year old, but they may continue to turn red when your baby cries or gets overheated. “Stork Bites” on the back of the neck are less likely to fade completely than “Angel Kisses”, but usually the hair covers them up so they aren’t very noticeable. Anne Smith, IBCLC."}, {"url": "http://angelkisses.org/making-a-difference/", "passage_text": "Angel Kisses Donates Over $12,000 to Local Organizations in 2015 Grants. After an amazing year, Angel Kisses is very proud to announce that we have donated $12,400 to some incredible local organizations. It is our great pleasure to announce that Angel Kisses donated $17,820 to Michigan hospitals to attend Resolve Through Sharing® training at Bronson Methodist Hospital. Our donation helped the Bronson Health Foundation host the confernce."}, {"url": "http://www.kingarthurflour.com/recipes/angel-kisses-recipe", "passage_text": "If nice, treat yourself to meringuesairy puffs of sugar and egg white, light as an angel's kiss. If naughty, expect coal! 2 large egg whites 1/4 teaspoon cream of tartar dash of salt 1/2 cup plus 1 tablespoon (4 ounces) granulated sugar white glitter for topping, optional. In a large bowl, combine the egg whites, cream of tartar, and a dash of salt."}]