[{"url": "http://talk.nycsubway.org/perl/read?subtalk=222795", "passage_text": "Posted by Babylon737 on Fri May 25 10:37:27 2001, in response to Re: Entering LIRR Assistant Conductor Training Program, posted by Paul Matus on Fri May 25 09:55:51 2001. Since I am coming off of the street. "}, {"url": "http://www.sandiegosymphony.org/media/Auditions/JobDes_SDSO%20Assistant%20Conductor%202014-FINAL.pdf", "passage_text": "The Assistant Conductor is an integral part of both the Artistic and Education departments and serves as one of its key members. The Assistant Conductor also serves as the principal conductor for all Education-related programs, which comprise approximately 25-30 concerts per year. 1245 7 th Avenue San Diego, CA 92101 PLEASE NOTE: CHOSEN FINALISTS MUST BE AVAILABLE ON APRIL 21 AND 22, 2015 FOR A LIVE (IN PERSON) AUDITION ROUND AND INTERVIEW WITH THE SAN DIEGO SYMPHONY ORCHESTRA IN SAN DIEGO, CA Please submit any queries by email to AssistantCondSearch@sandiegosymphony.org."}, {"url": "http://study.com/articles/Railroad_Conductor_Job_Information_and_Requirements_for_a_Career_as_a_Railroad_Conductor.html", "passage_text": "Career Definition. Railroad conductors can work on either passenger trains or freight trains and might work as a service conductor, passenger agent or yard conductor. Generally, railroad conductors must work in the railroad industry for several years before being promoted to conductor. Education Requirements. For the most part, hands-on experience in the railroad industry is the best education for a railroad conductor. Some train companies require those wishing to become a railroad conductor to complete a formal 5 or 6-week training program offered by a technical school or community college."}, {"url": "http://www.merriam-webster.com/dictionary/concertmaster", "passage_text": "Full Definition of CONCERTMASTER. : the leader of the first violins of an orchestra and by custom usually the assistant to the conductor. See concertmaster defined for English-language learners. See concertmaster defined for kids. "}, {"url": "http://www.oxforddictionaries.com/definition/english/conductor", "passage_text": "1 It soon became a group effort as the train conductor and other workers helped move the supplies and eased the job. 2  I once had a Chief of Police write the train conductor / engineer a ticket for blocking the main drag in town. 3  The assistant conductor from our train went off duty and got on 350 to go back east. 1 It has a high melting point and is a good conductor of heat and electricity. 2  Lead is not a good conductor of electricity, heat, sound, or vibrations. 3  It is one of the best conductors of heat and electricity of all elements."}, {"url": "https://en.wikipedia.org/wiki/Conductor_(transportation)", "passage_text": "In North America, the conductor manages a freight, passenger, or other types of train, and directly supervises the train crew, which can include a brakeman, flagman, ticket collector, assistant conductor, and on board service personnel. All crew members work under the conductor. If there is more than one conductor on a train, then the signal procedure is as follows: After all passengers have left or entered the train and the departure time has arrived, the conductor in chief asks the other conductor for his ready signal."}, {"url": "http://www.oxforddictionaries.com/definition/english/conductor", "passage_text": "3 Physics A material or device that conducts or transmits heat or electricity, especially when regarded in terms of its capacity to do this: most polymers are poor conductors. More example sentences. 1  It has a high melting point and is a good conductor of heat and electricity. 2  Lead is not a good conductor of electricity, heat, sound, or vibrations. 3  It is one of the best conductors of heat and electricity of all elements. 1 It has a high melting point and is a good conductor of heat and electricity. 2  Lead is not a good conductor of electricity, heat, sound, or vibrations. 3  It is one of the best conductors of heat and electricity of all elements."}, {"url": "http://freight.about.com/od/Jobs/a/Railroad-Conductors.htm", "passage_text": "A railroad conductor works aboard the train and coordinates the daily activities of train crews. A freight train conductor oversees the loading and unloading of cargo. A railroad conductor's job requires a high school diploma and on-the-job training. Typically, this is a full-time job with varying hours due to atypical freight schedules. The training may either be on-the-job or via community college classes. "}]