[{"url": "http://www.waxforum.com/showthread.php?t=2274", "passage_text": "Re: how to clean your polishing pads? What I do usually is have a big pale fill with soapy water to the point that the water is only 1/4 to 1/2 filled relative to the pad. And since the pale have some grooves on the bottom part, you gently have to rub them against these uneven parts."}, {"url": "http://www.meguiarsonline.com/forums/showthread.php?29218-How-to-wash-wax-applicator-pads-and-polishing-cloths", "passage_text": "How to clean Meguiar's foam buffing pads Cleaning Your Pad On The Fly Here's Cisco from one of our recent Saturday Detailing Classes learning how to clean a pad on the fly. Originally Posted by Mr. Boogie. I use both hand applicators and machine applicators and would to clean them after each use."}, {"url": "http://www.autogeekonline.net/forum/wool-foam-buffing-pads/39737-how-clean-wax-foam-pads.html", "passage_text": "Re: How to clean wax from foam pads. I use my Grit Guard Universal Pad Washer. I usually spritz the pad with some APC and work it into the pad some then run it on the Pad Washer. I haven't had any problems cleaning them."}, {"url": "http://www.ebay.com/gds/How-to-Buffer-a-Hardwood-Floor-/10000000177630286/g.html", "passage_text": "Along with the buffer, it is necessary to purchase the right screens or buffing pads. Depending on the condition of the floor, various sizes will be required. Medium 100 grit sanding pads will remove most surface scratches, and a fine, 120 grit or 150 grit pad will prepare the floor for the application of the finish."}, {"url": "http://arrc.ebscohost.com/ebsco_static/repair-tips/8852CH28_HOW_TO_USE_BUFFING_MACHINES.htm", "passage_text": "3: With the buffer OFF, use the pad to spread the liquid over the area you intend to polish. To spread evenly, hold the pad flat to the surface and move it back and forth. Fig. 4: A foam pad polishes wax and also removes and swirls left by a wool pad. Always use a foam pad on clearcoat and other high-tech finishes."}, {"url": "http://www.autogeekonline.net/forum/wool-foam-buffing-pads/39737-how-clean-wax-foam-pads.html", "passage_text": "Re: How to clean wax from foam pads. I spray my pads with a degreaser, let them sit then put them in a pail of Detailer s Pro Series Polishing Pad Rejuvenator-DP Polishing Pad Rejuvenator was created to provide detailers with a fast and effective way to clean pads without soapy residue or foamy degreasers."}, {"url": "http://www.autogeekonline.net/forum/wool-foam-buffing-pads/39737-how-clean-wax-foam-pads.html", "passage_text": "Posts: 1,088. Re: How to clean wax from foam pads. When you're done you can use any APC to clean off your pad. Either have a bucket with a APC solution premixed and or spray the pad itself and work the product out with your fingers and wash it out with a hose."}, {"url": "http://www.youtube.com/watch?v=O41QRp_icsE", "passage_text": "Shurhold's Serious Pad Cleaner works on; Foam Pads, Wool Pads, Microfiber and Cotton Bonnets. If you have a Dual Action Polisher or a Rotary Buffer you must always start with clean pads to get the best finish possible."}, {"url": "http://www.meguiarsonline.com/forums/showthread.php?3598-How-to-clean-Meguiar-s-foam-buffing-pads", "passage_text": "How to clean Meguiar's foam buffing pads. How to clean Meguiar's foam buffing pads Meguiar's does not recommend washing any of our foam buffing pads either by hand or by machine."}]