[{"url": "http://www.gethealthyagain.com/enzymes.html", "passage_text": "They quickly tell you about the best value in digestive enzyme supplements, and how to get it. If you don't yet understand the vital role enzymes play in the digestive system, and why they are so important to your health, skim these few paragraphs. You will then get a detailed explanation of digestion, and learn the reasons why digestive enzyme supplementation is vital for your health. First, you chew your food, and it mixes with the saliva in the mouth. The saliva has an enzyme called amylase which starts the predigestion of carbohydrates. The more you chew, the better. Then, the food is swallowed and goes down the esophagus into the upper portion of the stomach."}, {"url": "http://www.enzymeessentials.com/HTML/tour_3.html", "passage_text": "These enzymes have one main job — to digest our food. DIGESTIVE ENZYMES are made by our body's organs. Digestive enzymes are secreted by the salivary glands, stomach, pancreas, and the small intestine. [Technically, digestive enzymes are also considered to be metabolic enzymes whose metabolic role is to digest food. To better understand digestive enzymes, we must first understand the role of NUTRITION in our health. Nutrition is the body's ability to use and metabolize food. There are 45 known essential nutrients that are required in specific amounts for the body to function properly."}, {"url": "http://www.vivo.colostate.edu/hbooks/pathphys/digestion/pancreas/exocrine.html", "passage_text": "1. Proteases Digestion of proteins is initiated by pepsin in the stomach, but the bulk of protein digestion is due to the pancreatic proteases. Several proteases are synthesized in the pancreas and secreted into the lumen of the small intestine. "}, {"url": "http://www.answers.com/Q/What_role_do_enzymes_play_in_the_digestion_process", "passage_text": "Enzymes help to break down substances. In digestion, they break down food molecules, making it easier for the body to absorb nutrients.    I wikied enzymes, to be more … sure of how to answer this question. exists and is an alternate of. Merge this question into. Split and merge into it. Answer by Gale Ency. of Medicine. Confidence votes 20.1K. Enzymes play an important role in breaking down carbohydrates into forms that can pass through the intestine and be used by the body."}, {"url": "http://study.com/academy/lesson/accessory-digestive-organs-pancreas-gallbladder-liver.html", "passage_text": "Your pancreas plays an important role in the digestion of food. In this lesson, you will learn about the enzymes found in pancreatic juice that allow your body to break down carbohydrates, proteins and fats. Let's review. The pancreas is an important organ in digestion because it produces a variety of enzymes that break down all of the major food groups. In addition to the enzymes, your pancreas also secretes bicarbonate, which makes the pancreatic secretions alkaline in nature."}, {"url": "https://en.wikipedia.org/wiki/Digestive_enzyme", "passage_text": "In the human digestive system, the main sites of digestion are the oral cavity, the stomach, and the small intestine. Digestive enzymes are secreted by different exocrine glands including: 1  Salivary glands. 2  Secretory cells in the stomach. The enzymes that are secreted in the stomach are called gastric enzymes. The stomach plays a major role in digestion, both in a mechanical sense by mixing and crushing the food, and also in an enzymatic sense, by digesting it."}, {"url": "http://www.answers.com/Q/What_role_do_enzymes_play_in_the_digestion_process", "passage_text": "In digestion, they break down substances into smaller molecules, so that they can then be absorbed into the bloodstream. Carbohydrase emzymes such as Amylase break sta … rch down into glucose. Lipase enzymes break down lipids into fatty acids and glycerol. Protease enzmes break down protein into amino acids. exists and is an alternate of. Merge this question into. Split and merge into it. Answer by Gale Ency. of Medicine. Confidence votes 20.1K. Enzymes play an important role in breaking down carbohydrates into forms that can pass through the intestine and be used by the body."}]