[{"url": "http://www.jerseyplantsdirect.com/senetti", "passage_text": "Senetti plants have a great ability to cope with early frosts, meaning a guaranteed early splash of colour. Gardeners can have confidence when planting out Senetti, as they will endure light frosts and night temperatures. "}, {"url": "http://www.finegardening.com/senetti-pericallis-senetti", "passage_text": "Plant Senetti with other cool companion bedding plants in early spring, such as pansies. Senetti thrives in full sun and partial sun conditions.Bred by Suntory Flowers in Japan, Senetti is a collection of pericallis hybrids, which were obtained by cross breeding members of the Compositae and Asteraceae familes. Bloom count can be as high as 200 on a plant grown in a 10-inch pot. Senetti also has a unique reblooming ability. Cut plants back 50 percent for a fresh flush of blooms. Plants will stop flowering when temperatures are 80 degrees are higher at night during the summer. Senetti is an early spring plant and likes cool weather. -Suntory Collection"}, {"url": "http://www.greenhousegrower.com/varieties/senetti-pericallis-production-secrets/", "passage_text": "Senetti is the brand for a completely new collection of pericallis hybrids, which were obtained by cross-breeding members of the compositae and asteracea families. Plants produce large, daisy-like flowers from early spring until summer. "}, {"url": "http://www.pikenursery.com/senetti-blue-bi-color.html", "passage_text": "Typically Available in Store in early Spring. Contact your local store to check availability. The original group of Senetti® is the most popular group. The varieties in this category all have the following attributes: large blooms, 2.5 inch to 3 inch flower size, a final plant of 2ft in height and width. Senetti’s® can be grown in 10 inch to 12 inch sized pots. "}, {"url": "http://www.armstronggarden.com/senetti-deep-blue.html", "passage_text": "Typically Available in Store in early Spring. Contact your local store to check availability. The original group of Senetti® is the most popular group. The varieties in this category all have the following attributes: large blooms, 2.5 inch to 3 inch flower size, a final plant of 2ft in height and width. Senetti’s® can be grown in 10 inch to 12 inch sized pots."}, {"url": "http://senetti.com/", "passage_text": "is the trade mark for an exciting new collection of plants made up from pericallis hybrids. Senetti® is renown for its garden performance and reblooming. It is able to cope with temperatures down as low as 35°F and high as 85-90°F. "}, {"url": "http://suntoryflowers.com/flower_brand/senetti/", "passage_text": "Senetti’s® large, daisy flowers bloom from early spring until summer. Bloom count can be as high as 200 on a plant grown in a 10-inch pot. Senetti® is popular bedding plant best suited for outdoors in semi shade. Senetti® Pericallis requires constantly moist soil and regular feeding. "}, {"url": "http://containergardening.about.com/od/photogallery/ig/Wordless-Wednesday-Pictures/Senetti--Pericallis-.htm", "passage_text": "Commonly called cineraria, Senetti® Pericallis, is a great container plant for spring blooms. 'Secrets of Senetti,' is a brand name of new series of Pericallis hybrids. These striking plants are available in four colors, magenta, magenta bicolor, blue and blue bicolor. Senetti® Pericallis love cool wet weather which makes them perfect for early spring planting and prolific early blooms."}, {"url": "http://senetti.com/gardeners/", "passage_text": "Senetti® Flower Launch. Senetti® is the brand name given to a completely new collection of pericallis hybrids.The aim of this brand is to put across the fact that this is an entirely new group of varieties obtained by cross-breeding. Suntory® bred the first vegetatively propagated Trailing Petunia called Surfinia®, Verbena’s Tapien® and Temari®, Viola called Violina® and the very first calibrachoa hybrids to the world’s market place, called Million Bells®."}]