[{"url": "http://www.juliancassell.com/2921/which-paint-for-wood", "passage_text": "1 Satin (water-based or oil-based) – Satin occupies the sheen option area between matt and gloss. 2  In other words it is less shiny than gloss, but more shiny than eggshell. 3  As with an eggshell finish system, the first coat of satin is the ‘undercoat’."}, {"url": "http://reviews.homebase.co.uk/1494-en_gb/703286/reviews.htm", "passage_text": "I have e-mailed Dulux about this problem but they could NOT be bothered to reply, so much for a caring company.How can Dulux say: you do not need an undercoat with this Eggshell, you NEVER put gloss on gloss but that's exactly what you would be doing with this paint and it will peel off."}, {"url": "http://www.littlegreene.com/paint/finish/oil-eggshell", "passage_text": "Oil Eggshell is the traditional paint for woodwork and metalwork. With a low sheen it's the perfect complement to a matt wall paint and is tough enough to withstand wear and tear and repeated cleaning."}, {"url": "http://www.dulux.com.au/products/dulux-interior-products/preparation/product-detail?product=2179", "passage_text": "Apply 1 coat of Dulux 1 Step Oil Based Primer, Sealer & Undercoat. Can be used on most interior and exterior masonry surfaces but other prepcoats such as Dulux 1 Step Acrylic Primer, Sealer & Undercoat may be preferred."}, {"url": "http://community.screwfix.com/threads/blending-undercoat-with-eggshell.124364/", "passage_text": "Otherwise I would have gone for satin or gloss. I spoke to the man on the paint counter at the Builders Depot (New Southgate, London), and he says that mixing undercoat with eggshell is unheard of, and the only reason why my decorator may have done this is to save on doing 2 coats of undiluted eggshell."}, {"url": "http://www.juliancassell.com/2921/which-paint-for-wood", "passage_text": "1 Eggshell (water-based or oil-based) – Eggshell is the most matt (dull) of all top coats, or finishing paints, but although it will provide the top coat as well, you also use it as an undercoat. 2  Satin (water-based or oil-based) – Satin occupies the sheen option area between matt and gloss."}, {"url": "http://community.screwfix.com/threads/which-paint-to-buy-dulux-johnstones-leyland.133061/", "passage_text": "Sand lightly in between coats too. Johnstones, Leyland, or Dulux all do a topcoat (oil or water) that will fit your requirements. On the wood, I'd go for Dulux diamond satinwood, been much improved recently (water based and goes in two coats)."}, {"url": "http://reviews.homebase.co.uk/1494-en_gb/703286/reviews.htm", "passage_text": "Review 1 for Not Eggshell Overall Rating 1 out of 5 ByKRH. 12 October 2013. Keep away! Dulux Eggshell should be called Dulux Semi-Gloss, it has a high shine and it is NOT what I would call Eggshell. I have been a painter for over 40 years, this paint has caused me a lot of problems with my customers."}]