[{"url": "http://cooking.stackexchange.com/questions/16156/cooking-slow-roasted-pork-to-190f", "passage_text": "LOW OVEN Just like in a pot roast, cooking the pork low and slow (325 degrees for 5 to 6 hours) pushes the meat well beyond its “done” mark into the 190-degree range, encouraging intramuscular fat to melt, collagen to break down and tenderize the meat, and the fat cap to render and crisp. up vote 1 down vote. Without question low and slow is best for pork shoulder roasts. Roasting the meat to at least an internal temp of 180 degrees is critical. Once this temp is reached, remove the roast from the oven, cover loosely with foil and rest until the in the internal temp reaches at least 190 degrees."}, {"url": "http://www.thekitchn.com/how-to-make-roasted-pork-tenderloin-cooking-lessons-from-the-kitchn-211998", "passage_text": "The pork is done when its internal temperature registers 140°F to 145°F in the thickest part of the meat (20 to 25 minutes total). Rest for 10 minutes before serving: Transfer the pork to a cutting board, tent with foil, and let it rest for 10 minutes before slicing. Roast the pork for 10 minutes: Set the pork in the pan. (It's fine if your pork tenderloin is a little long for the pan; just bend it to fit as we did here.) Return the pan to the oven. Roast for 10 minutes."}, {"url": "http://www.thekitchn.com/how-to-make-roasted-pork-tenderloin-cooking-lessons-from-the-kitchn-211998", "passage_text": "Swirl to coat the bottom. Roast the pork for 10 minutes: Set the pork in the pan. (It's fine if your pork tenderloin is a little long for the pan; just bend it to fit as we did here.) Return the pan to the oven. Roast for 10 minutes. Flip the pork, reduce the heat, and roast another 10 to 15 minutes: Flip the pork to the other side"}, {"url": "http://www.foodnetwork.com/recipes/michael-chiarello/slow-cooked-pork-recipe.html", "passage_text": "Directions. Preheat oven to 275 degrees F. If necessary, trim fat from top of pork, leaving a 1/8-inch thick layer of fat. Spread Roasted Garlic Rub all over pork and inside any cavities, concentrating on boned side.Put pork, fat side up, in a roasting pan and roast in middle of oven 6 to 8 hours. Transfer roast to cutting board and let stand 15 minutes. Pull shreds apart with tongs into chunks."}, {"url": "http://allrecipes.com/recipe/75861/amazing-pork-tenderloin-in-the-slow-cooker/", "passage_text": "1 Place pork tenderloin in a slow cooker with the contents of the soup packet. 2  Pour water, wine, and soy sauce over the top, turning the pork to coat. 3  Carefully spread garlic over the pork, leaving as much on top of the roast during cooking as possible. "}, {"url": "http://www.chowhound.com/post/pork-tenderloin-question-temperature-time-349567#!", "passage_text": "I marinate my pork tenderloin in a bourbon/soy sauce/brown sugar mixture for about 6 hours and then bake at 425 degrees, basting with the marinade every 5 minutes or so. They only take about 20 minutes to cook at this temperature and I take them out of the oven when the meat thermometer reads about 148 degrees. "}, {"url": "http://cooking.stackexchange.com/questions/10464/what-temperature-to-cook-a-pork-tenderloin-at", "passage_text": "With a pork tenderloin: Season the meat, sear all sides in a very hot pan, and then finish in the oven at 350°F (175°C) degrees until the internal temp. hits 145°F (63°C). Then let it sit for 10 minutes, and cut 'er up. If you need it done faster, a higher oven temp will accomplish this, but may compromise quality. I always season my pork tenderloins, then pan-sear for a crispy brown outer crust, then put into the oven at 350 degrees for about 45 minutes to one hour. At 45 minutes, I begin checking the internal temperature of the meat."}]