[{"url": "http://www.pfizer.com/files/products/uspi_tobramycin.pdf", "passage_text": "Organism MIC Range (mcg/mL) nephrotoxicity.In patients with normal renal function, except neonates, tobramycin administered every 8 hours does not accumulate in the serum. However, in those E. faecalis ATCC 29212 8-32 Aminoglycosides have not been approved for intraocular and/or subconjunctival use."}, {"url": "http://www.johnmuirhealth.com/about-john-muir-health/muirlab/resources-articles/test-updates/therapeutic-drug-monitoring.html", "passage_text": "Vancomycin: New Trough reference range: 10-20 µg/mL; New Peak reference range: 30-50 µg/mL. Vancomycin is one of the most widely used antibiotics for the treatment of serious gram-positive infections involving methicillin-resistant S. aureus (MRSA), and has been in clinical use for nearly 50 years."}, {"url": "http://www.ncbi.nlm.nih.gov/pubmed/6499344", "passage_text": "Tobramycin serum level monitoring in young patients with normal renal function. Green TP, Mirkin BL, Peterson PK, Sinaiko AR, Ramsay NK, O'Dea RF."}, {"url": "https://www.nlm.nih.gov/medlineplus/ency/article/003430.htm", "passage_text": "Following are some of the drugs that are commonly checked and the normal target levels: 1  Acetaminophen: varies with use. 2  Amikacin: 15 to 25 mcg/mL. 3  Aminophylline: 10 to 20 mcg/mL. 4  Amitriptyline: 120 to 150 ng/mL."}, {"url": "http://www.ncbi.nlm.nih.gov/pubmed/6499344", "passage_text": "Five clinical strategies for monitoring serum tobramycin concentrations were compared in a population of children and young adults with normal renal function receiving tobramycin for suspected sepsis. The drug monitoring strategies were evaluated on the basis of the ability of each to predict subsequent drug levels."}, {"url": "http://emedicine.medscape.com/article/2090440-overview", "passage_text": "Subsequent tobramycin doses are either increased or decreased to attain levels within this range. Trough levels, on the other hand, are used to modify the dosing intervals. The goal is to keep the trough levels below the designated reference value to prevent accumulation and toxicity."}, {"url": "http://emedicine.medscape.com/article/2090440-overview", "passage_text": "Conventional (multiple-daily) dosing. For tobramycin administered in multiple daily doses (usually every 8-12 hours), peak and trough levels guide tobramycin dosing. Peak levels are used to adjust the tobramycin dose per administration and should be within the reference range to be considered therapeutic."}, {"url": "http://emedicine.medscape.com/article/2090440-overview", "passage_text": "The reference ranges for serum tobramycin levels are listed below. The reference ranges for tobramycin administered every 8 hours (sometimes up to 12 hours), also called “traditional”, “conventional”, or “multiple-daily” dosing are as follows: Tobramycin, peak."}]