[{"url": "https://en.wikipedia.org/wiki/Platinum", "passage_text": "Platinum is a member of the platinum group of elements and group 10 of the periodic table of elements. It has six naturally occurring isotopes. It is one of the rarer elements in Earth's crust with an average abundance of approximately 5 μg /kg. Platinum has six naturally occurring isotopes: 190 Pt, 192 Pt, 194 Pt, 195 Pt, 196 Pt, and 198 Pt. The most abundant of these is 195 Pt, comprising 33.83% of all platinum."}, {"url": "http://jewelryinfoplace.com/platinum/", "passage_text": "Platinum is an expensive metal commonly found in jewelry, however, the rare metal rhodium holds more value. Part of the platinum family, rhodium is more often used to coat and protect common metals such as silver or gold. This gives jewelry its reflective white surface. "}, {"url": "https://en.wikipedia.org/wiki/Platinum", "passage_text": "Platinum is a chemical element with symbol Pt and atomic number 78. It is a dense, malleable, ductile, highly unreactive, precious, gray-white transition metal. Platinum has six naturally occurring isotopes: 190 Pt, 192 Pt, 194 Pt, 195 Pt, 196 Pt, and 198 Pt. The most abundant of these is 195 Pt, comprising 33.83% of all platinum."}, {"url": "http://education.jlab.org/itselemental/ele078.html", "passage_text": "Credit for the modern rediscovery of platinum is usually given to Antonio de Ulloa. Platinum is a soft, dense, ductile metal that is very resistant to corrosion. It is used to make jewelry, wire, electrical contacts and laboratory vessels. Platinum expands at nearly the same rate as soda-lime-silica glass, so it is used to make sealed electrodes in glass systems. History and Uses: Used by the pre-Columbian Indians of South America, platinum wasn't noticed by western scientists until 1735. Platinum can occur free in nature and is sometimes found in deposits of gold-bearing sands, primarily those found in the Ural mountains, Columbia and the western United States."}, {"url": "https://answers.yahoo.com/question/index?qid=20081022062150AAt7jkg", "passage_text": "Finely divided platinum in the form of platinum sponge or platinum black is used extensively as a catalyst in the chemical industry. A considerable amount of the platinum used in the United States goes into jewelry, in which it is often alloyed with gold. It is also used for dental fillings. Platinum compounds are also used in medicine, with cisplatin being the first to be discovered, and carboplatin is a more recent anti-cancer drug. It is also used as a catalyst in many chemical reactions, such as car exhaust cleaners."}, {"url": "https://answers.yahoo.com/question/index?qid=20081022062150AAt7jkg", "passage_text": "Best Answer: Because of its chemical inertness and high fusing point, platinum is valuable for laboratory apparatus, such as crucibles, tongs, funnels, combustion boats, and evaporating dishes. Small amounts of iridium are usually added to increase its hardness and durability. Platinum compounds are also used in medicine, with cisplatin being the first to be discovered, and carboplatin is a more recent anti-cancer drug. It is also used as a catalyst in many chemical reactions, such as car exhaust cleaners."}, {"url": "http://www.totalmateria.com/page.aspx?ID=CheckArticle&site=ktn&NM=237", "passage_text": "Chemical. Platinum is used in fertilizers and explosives as a gauze for the catalytic conversion of ammonia to nitric acid. It is also used in the fabrication of silicones for the aerospace, automotive and construction sector. Platinum also has 31 synthetic isotopes ranging in atomic mass from 166 to 202, making the total number of known isotopes 37. The least stable of these is 166 Pt with a half-life of 300 µs, while the most stable is 193 Pt with a half-life of 50 years."}, {"url": "http://ebullionguide.com/platinum-uses.aspx", "passage_text": "Platinum Uses: Modern Applications. The reason why platinum is today the most valuable of precious metals is because it is required in so many industrial applications. It is estimated that one-fifth of everything we use either contains platinum or requires platinum in its manufacture. Among all the known modern uses of platinum, most of the annual production is consumed by two dominant categories-catalytic converters and fine jewelry."}, {"url": "http://www.totalmateria.com/page.aspx?ID=CheckArticle&site=ktn&NM=237", "passage_text": "Platinum is a chemical element with the chemical symbol Pt and the atomic number of 78. Its name is derived from the Spanish term “platina del Pinto”, which is literally translated into “little silver of the Pinto River”. It was discovered in South America by Ulloa in 1753 and by Wood in 1741. Platinum also has 31 synthetic isotopes ranging in atomic mass from 166 to 202, making the total number of known isotopes 37. The least stable of these is 166 Pt with a half-life of 300 µs, while the most stable is 193 Pt with a half-life of 50 years."}]