[{"url": "http://www.biology-online.org/dictionary/Genetic_drift", "passage_text": "noun. The process of change in the genetic composition of a population due to chance or random events rather than by natural selection, resulting in changes in allele frequencies over time. Supplement. The effect of genetic drift in large populations is usually negligible whereas in small populations, it predominates. In a small population, genetic drift results in some alleles become more common while others become less common over time."}, {"url": "http://www.nature.com/scitable/definition/random-genetic-drift-genetic-drift-201", "passage_text": "Genetic drift describes random fluctuations in the numbers of gene variants in a population. Genetic drift takes place when the occurrence of variant forms of a gene, called alleles, increases and decreases by chance over time. These variations in the presence of alleles are measured as changes in allele frequencies."}, {"url": "http://study.com/academy/lesson/genetic-drift-definition-examples-types.html", "passage_text": "Genetic Drift Defined. Populations of organisms are constantly changing and adapting to their environment. Drastic changes in environmental conditions can sometimes cause drastic changes to the gene pool of the population. Genetic drift is when chance events cause changes in frequencies of alleles in a population. Alleles are the genetic variations in a population, and they are the driving force behind the evolution of that population. The smaller the population, the greater the impact genetic drift will have"}, {"url": "http://www.evolution.berkeley.edu/evosite/evo101/IIIDGeneticdrift.shtml", "passage_text": "Support this project. Genetic drift. Genetic drift  along with natural selection, mutation, and migration  is one of the basic mechanisms of evolution. In each generation, some individuals may, just by chance, leave behind a few more descendents (and genes, of course!) than other individuals. Earlier we used this hypothetical cartoon. Genetic drift affects the genetic makeup of the population but, unlike natural selection, through an entirely random process. So although genetic drift is a mechanism of evolution, it doesn't work to produce adaptations."}, {"url": "http://www.nature.com/scitable/definition/random-genetic-drift-genetic-drift-201", "passage_text": "Typically, genetic drift occurs in small populations, where infrequently occurring alleles face a greater chance of being lost. Once it begins, genetic drift will continue until the involved allele is either lost by a population or until it is the only allele present in a population at a particular locus. Genetic drift takes place when the occurrence of variant forms of a gene, called alleles, increases and decreases by chance over time. These variations in the presence of alleles are measured as changes in allele frequencies."}, {"url": "http://www.answers.com/Q/What_is_genetic_drift", "passage_text": "There are two types of genetic drift, there is a the population bottle neck effect and the founder effect. The population bottle neck effect is when a population greatly decre … ases in size due to some random ecological event and the small population has a greater chance of genetic variation. Another Answer : Genetic drift is where random chance events which can effect the gene's abundance in a population, regardless of whether the gene is advantageous or not. For example, a natural disaster kills animals indiscriminately, regardless of their genetic makeup. A random change in allele frequencies over time."}, {"url": "https://en.wikipedia.org/wiki/Genetic_drift", "passage_text": "Genetic drift (or allelic drift) is the change in the frequency of a gene variant (allele) in a population due to random sampling of organisms. The alleles in the offspring are a sample of those in the parents, and chance has a role in determining whether a given individual survives and reproduces. Once an allele becomes fixed, genetic drift comes to a halt, and the allele frequency cannot change unless a new allele is introduced in the population via mutation or gene flow. Thus even while genetic drift is a random, directionless process, it acts to eliminate genetic variation over time."}, {"url": "http://www.answers.com/Q/What_is_genetic_drift", "passage_text": "Genetic drift is the random change in the frequency of alleles within a population's gene pool. It can cause the genetic composition of a population to change in one direction or another. Another Answer : Genetic drift is where random chance events which can effect the gene's abundance in a population, regardless of whether the gene is advantageous or not. For example, a natural disaster kills animals indiscriminately, regardless of their genetic makeup. A random change in allele frequencies over time."}, {"url": "https://en.wikipedia.org/wiki/Genetic_drift", "passage_text": "When there are few copies of an allele, the effect of genetic drift is larger, and when there are many copies the effect is smaller. In the early twentieth century vigorous debates occurred over the relative importance of natural selection versus neutral processes, including genetic drift. Once an allele becomes fixed, genetic drift comes to a halt, and the allele frequency cannot change unless a new allele is introduced in the population via mutation or gene flow. Thus even while genetic drift is a random, directionless process, it acts to eliminate genetic variation over time."}]