[{"url": "http://www.behindthename.com/names/usage/indian", "passage_text": "JASWINDER f & m Punjabi. Means Indra of the thunderbolt from the name of the Hindu god INDRA prefixed with Sanskrit jasu, the name of his thunderbolt. JAY (2) जय m Indian. Modern transcription of JAYA. JAYA जया, जय f & m Indian, Hinduism. Derived from Sanskrit जय (jaya) meaning victory ... From the name of a mountain in the Himalayas which is believed to be the paradise of the Hindu god Shiva ... [more]. KAJAL काजल f Indian. Means kohl, medical lotion in Sanskrit. KALA (1) कला f Indian. Means art form, virtue"}, {"url": "http://www.behindthename.com/names/usage/indian", "passage_text": "[more]. ARUNDHATI अरुन्धती, अरुंधती f Indian, Hinduism. The name of a star (also called Alcor), which was named after a type of climbing plant, possibly meaning not restrained in Sanskrit ... [more]. ARYA आरय, आरया m & f Indian. Means honourable, noble in Sanskrit ... From the name of a mountain in the Himalayas which is believed to be the paradise of the Hindu god Shiva ... [more]. KAJAL काजल f Indian. Means kohl, medical lotion in Sanskrit. KALA (1) कला f Indian. Means art form, virtue"}, {"url": "http://www.babynamespedia.com/meaning/Bhuvan", "passage_text": "[ 3 syll. (b)hu-van, bh-uv-an ] The baby boy name Bhuvan is pronounced as B UW OW-Vae-N †. Bhuvan is largely used in the Indian language and its origin is Sanskrit. Bhuvan is a variant transcription of the name Bhuvana (Indian). Bhuvan is a rare baby boy name. It is not listed in the top 1000. "}, {"url": "http://www.behindthename.com/names/usage/indian", "passage_text": "Indian names are used in India and in Indian communities throughout the world. From the name of a mountain in the Himalayas which is believed to be the paradise of the Hindu god Shiva ... [more]. KAJAL काजल f Indian. Means kohl, medical lotion in Sanskrit. KALA (1) कला f Indian. Means art form, virtue"}, {"url": "https://en.wikipedia.org/wiki/Bhuvan", "passage_text": "Bhuvan, (lit: Earth), is a software application which allows users to explore a 2D/3D representation of the surface of the Earth. The browser is specifically tailored to view India, offering the highest resolution in this region and providing content in four local languages. Bhuvan also provides faiclity to view satellite imagery in 3-Dimensional format. Earlier Bhuvan-3D was based on a product of Skyline Software Systems. On the 5th Anniversary of Bhuvan on 12 August 2014 Bhuvan has released an Open-source tool (Cesium: webGL Javascript Library) based Virtual Globe."}, {"url": "http://www.indiachildnames.com/name.aspx?name=Bhuvan", "passage_text": "Name Bhuvan generally means Palace or One of the three worlds, is of Indian origin, Name Bhuvan is a Masculine (or Boy) name. Find qualities of Taurus (Vrushabh), Sagittarian (Dhan) or Find Numerology, Lucky number, lucky days, lucky color, Auspicious stones for Bhuvan or Find Chinese zodiac sign or Birthstone for your birthday or Find compatibility of Vrushabh (Taurus), Dhan (Sagittarius) with other zodiac signs."}, {"url": "http://www.behindthename.com/names/usage/hinduism", "passage_text": "[more]. ARUNDHATI अरुन्धती, अरुंधती f Indian, Hinduism. The name of a star (also called Alcor), which was named after a type of climbing plant, possibly meaning not restrained in Sanskrit ... [more]. Means sun in Sanskrit. This is the name of the Hindu god of the sun. SUSHILA सुशीला, सुशील f & m Indian, Hinduism. Means good-tempered, well-disposed, derived from the Sanskrit prefix सु (su) good combined with शील (shila) conduct ... [more]. TARA (2) तारा f Indian, Hinduism. Means star in Sanskrit ..."}, {"url": "http://www.bachpan.com/hindi-baby-names.aspx", "passage_text": "We have a collection of more than 20,000 Hindi boy and girl names, to choose a suitable baby name! All baby names are organized alphabetically with their meanings and you can view it in English and Hindi language. www.bachpan.com is the only website to display baby names in English and Hindi language. "}]