[{"url": "http://www.definitions.net/definition/Otay", "passage_text": "It is bordered by the Otay River Valley and the city of Chula Vista on the north, Interstate 805 and the neighborhoods of Ocean View Hills and San Ysidro on the west, unincorporated San Diego County on the north and east, and the Otay Centenario borough of Tijuana Municipality, Mexico on the south. Major thoroughfares include Otay Mesa Road/California State Route 905, Otay Valley Road/Heritage Road, Siempre Viva Road, and California State Route 125."}, {"url": "http://www.urbandictionary.com/define.php?term=otay", "passage_text": "2. Otay. A blue collar neighborhood located in southwest Chula Vista, California. The community of Otay was incorporated into the city of Chula Vista in the mid 1980's-which explains why the neighborhoods gangs (Varrio Loco Otay, River Bottom Locos, and Rasta Locos) claim South San Diego instead of Chula Vista. Otay is one of the oldest Barrios in San Diego County. From The Little Rascals movies. Buckwheat always mispronounced okay and said otay."}, {"url": "http://california.hometownlocator.com/ca/san-diego/otay.cfm", "passage_text": "Otay (GNIS FID: 247000) is a populated place LOCATED WITHIN the City of Chula Vista. In turn, the City of Chula Vista is located within San Diego County. Otay is located at latitude 32.595 and longitude -117.064. The elevation of Otay is 59 feet above mean sea level. Since Otay is located within the City of Chula Vista, all of the census and demographic data for residents of Otay are included as part of the information reported for City of Chula Vista in the Data tab above."}, {"url": "http://otaywater.gov/about-otay/", "passage_text": "The potable water delivered by Otay Water District is purchased from the San Diego County Water Authority or the Helix Water District. Imported water is a mix of waters from the Colorado River and Northern California. Otay Water District owns and operates a wastewater collection system providing public sewer service to homes and businesses within the Jamacha drainage basin."}, {"url": "https://en.wikipedia.org/wiki/Otay_Mesa,_San_Diego", "passage_text": "Otay Mesa is a community in the southern section of the city of San Diego, just north of the U.S.–Mexico border. The Otay Mesa Port of Entry is one of two border crossings within the city of San Diego, the other being the San Ysidro Port of Entry six miles to the west. Trucks are generally instructed to use the border crossing in Otay Mesa instead of the San Ysidro one. Otay Mesa also houses an immigration detention cent"}, {"url": "http://otaywater.gov/about-otay/", "passage_text": "Otay Water District is a “revenue neutral” public agency where each end user pays only his or her fair share of the District’s costs of acquiring, treating, transporting, or the operation and maintenance of the public water, recycled water, or sewer facilities. Otay Water District owns and operates a wastewater collection system providing public sewer service to homes and businesses within the Jamacha drainage basin."}, {"url": "https://en.wikipedia.org/wiki/Otay_Mesa,_San_Diego", "passage_text": "Major thoroughfares include Otay Mesa Road/ California State Route 905, Otay Valley Road/Heritage Road, Siempre Viva Road, and California State Route 125. Otay Mesa is the second-least walkable neighborhood of San Diego. The Otay Mesa Port of Entry is one of two border crossings within the city of San Diego, the other being the San Ysidro Port of Entry six miles to the west. Trucks are generally instructed to use the border crossing in Otay Mesa instead of the San Ysidro one. Otay Mesa also houses an immigration detention center"}, {"url": "http://otaywater.gov/about-otay/", "passage_text": "The State Legislature authorized the establishment of the Otay Water District in 1956 as a California Special District under the provisions of the Municipal Water District Law of 1911, Division 20 (commencing with Section 71000) of the Water Code of the State of California. Otay Water District owns and operates a wastewater collection system providing public sewer service to homes and businesses within the Jamacha drainage basin."}, {"url": "https://en.wikipedia.org/wiki/Otay_Mesa,_San_Diego", "passage_text": "Otay (pronounced Oh-Tie) is derived from the Kumeyaay language. Although its meaning is disputed, possible derivations include otai, meaning brushy; Tou-ti meaning big mountain; or etaay meaning big. The Otay Mesa Port of Entry is one of two border crossings within the city of San Diego, the other being the San Ysidro Port of Entry six miles to the west. Trucks are generally instructed to use the border crossing in Otay Mesa instead of the San Ysidro one. Otay Mesa also houses an immigration detention center"}]