[{"url": "http://webspace.ship.edu/cgboer/theneuron.html", "passage_text": "There are estimated to be as many as 100 billion neurons in our nervous system! A typical neuron has all the parts that any cell would have, and a few specialized structures that set it apart. The main portion of the cell is called the soma or cell body. It contains the nucleus, which in turn contains the genetic material in the form of chromosomes. "}, {"url": "https://en.wikipedia.org/wiki/Neuron", "passage_text": "A typical neuron consists of a cell body (soma), dendrites, and an axon. The term neurite is used to describe either a dendrite or an axon, particularly in its undifferentiated stage. Synaptic signals from other neurons are received by the soma and dendrites; signals to other neurons are transmitted by the axon. A typical synapse, then, is a contact between the axon of one neuron and a dendrite or soma of another."}, {"url": "http://biology.about.com/od/humananatomybiology/ss/neurons.htm", "passage_text": "1 Neurons contain the same cellular components as other body cells. 2  The central cell body is the largest part of a neuron and contains the neuron's nucleus, associated cytoplasm, and other cell structures. 3  The cell body produces proteins needed for the construction of other parts of the neuron. A neuron consists of two major parts: Axons and dendrites are bundled together into what are called nerves. These nerves send signals between the brain, spinal cord, and other body organs via nerve impulses. Nerve impulses are received at the neuronal dendrites and are carried along the axon to the terminal branches."}, {"url": "http://www.webmd.com/brain/neuron", "passage_text": "Neuron. A neuron is a nerve cell. Neurons send information to and from your brain to the rest of your body. A neuron is made up of: 1  A cell body. 2  This is where the nucleus is. 3  Dendrites. 4  The dendrites receive signals from other neurons. 5  A long, thin axon. 6  The axon is covered by a myelin sheath. 1 The dendrites receive signals from other neurons. 2  A long, thin axon. 3  The axon is covered by a myelin sheath. 4  The axon passes information to the next neuron or other cell in the body. 5  A myelin sheath. 6  The axons have a protective covering called myelin."}, {"url": "http://medical-dictionary.thefreedictionary.com/neuron", "passage_text": "A neuron consists of a cell body (perikaryon) and its processes, an axon and one or more dendrites. Neurons function in the initiation and conduction of impulses. They transmit impulses to other neurons or cells by releasing neurotransmitters at synapses. preganglionic neuron. A neuron of the autonomic nervous system whose cell body lies in the central nervous system and whose axon terminates in a peripheral ganglion, synapsing with postganglionic neurons."}, {"url": "https://en.wikipedia.org/wiki/Neuron", "passage_text": "A neuron (/ˈnjʊərɒn/ NYEWR-on or /ˈnʊərɒn/ NEWR-on; also known as a neurone or nerve cell) is an electrically excitable cell that processes and transmits information through electrical and chemical signals. These signals between neurons occur via synapses, specialized connections with other cells. Synaptic signals from other neurons are received by the soma and dendrites; signals to other neurons are transmitted by the axon. A typical synapse, then, is a contact between the axon of one neuron and a dendrite or soma of another."}, {"url": "https://en.wikipedia.org/wiki/Neuron", "passage_text": "At the majority of synapses, signals are sent from the axon of one neuron to a dendrite of another. There are, however, many exceptions to these rules: neurons that lack dendrites, neurons that have no axon, synapses that connect an axon to another axon or a dendrite to another dendrite, etc. Synaptic signals from other neurons are received by the soma and dendrites; signals to other neurons are transmitted by the axon. A typical synapse, then, is a contact between the axon of one neuron and a dendrite or soma"}, {"url": "http://science.howstuffworks.com/life/inside-the-mind/human-brain/brain1.htm", "passage_text": "Neuron Structure. Your brain is made of approximately 100 billion nerve cells, called neurons. Neurons have the amazing ability to gather and transmit electrochemical signals -- think of them like the gates and wires in a computer."}, {"url": "http://biology.about.com/od/humananatomybiology/ss/neurons.htm", "passage_text": "1 The central cell body is the largest part of a neuron and contains the neuron's nucleus, associated cytoplasm, and other cell structures. 2  The cell body produces proteins needed for the construction of other parts of the neuron. A neuron consists of two major parts: Axons and dendrites are bundled together into what are called nerves. These nerves send signals between the brain, spinal cord, and other body organs via nerve impulses. Nerve impulses are received at the neuronal dendrites and are carried along the axon to the terminal branches."}, {"url": "https://faculty.washington.edu/chudler/cells.html", "passage_text": "Types of Neurons (Nerve Cells). The human body is made up of trillions of cells. Cells of the nervous system, called nerve cells or neurons, are specialized to carry messages through an electrochemical process. The human brain has approximately 100 billion neurons. To learn how neurons carry messages, read about the action potential. Neurons come in many different shapes and sizes. (Remember that 1 micron is equal to one thousandth of a millimeter!). Neurons are similar to other cells in the body because: 1  Neurons are surrounded by a cell membrane. 2  Neurons have a nucleus that contains genes."}]