[{"url": "http://www.thefreedictionary.com/continental+shelf", "passage_text": "1. continental shelf-the relatively shallow (up to 200 meters) seabed surrounding a continent. Davy Jones, Davy Jones's locker, ocean bottom, ocean floor, sea bottom, sea floor, seabed-the bottom of a sea or ocean. 1  Facebook. "}, {"url": "http://www.boem.gov/Renewable-Energy-Program/Renewable-Energy-Guide/The-Continental-Shelf.aspx", "passage_text": "The continental shelf extends outward to the continental slope and continental rise, where the deep ocean truly begins, ultimately leading to the abyssal plain. The figure below is a schematic diagram of the continental shelf. The continental shelf is an extension of the continent's landmass under the ocean. Much of the continental shelf was exposed dry land during glacial periods. During interglacial periods, like today, the shelf is submerged under relatively shallow waters."}, {"url": "http://www.merriam-webster.com/dictionary/continental%20shelf", "passage_text": "continental shelf. noun. Tweet. : the part of a continent that lies under the ocean and slopes down to the ocean floor. : a shallow submarine plain of varying width forming a border to a continent and typically ending in a comparatively steep slope to the deep ocean floor. See continental shelf defined for English-language learners. See continental shelf defined for kids. ADVERTISEMENT."}, {"url": "http://www.wisegeek.org/what-is-a-continental-shelf.htm", "passage_text": "The continental shelf is an undersea extension of a continent that can stretch a great distance out to sea in some cases. @ Arunil-The width of the continental shelf has to do with plate tectonics and plate boundaries. If you look at a map of the continental shelves, you will notice that they are narrowest around plate boundaries, especially subduction zones."}, {"url": "http://www.boem.gov/Renewable-Energy-Program/Renewable-Energy-Guide/The-Continental-Shelf.aspx", "passage_text": "The Continental Shelf. The Continental Shelf is the gently sloping undersea plain between a continent and the deep ocean. The continental shelf is an extension of the continent's landmass under the ocean. Much of the continental shelf was exposed dry land during glacial periods. During interglacial periods, like today, the shelf is submerged under relatively shallow waters."}, {"url": "https://en.wikipedia.org/wiki/Continental_shelf", "passage_text": "The continental shelf is an underwater landmass which extends from a continent, resulting in an area of relatively shallow water known as a shelf sea. Much of the shelves were exposed during glacial periods and interglacial periods. The shelf surrounding an island is known as an insular shelf. The continental margin, between the continental shelf and the abyssal plain, comprises a steep continental slope followed by the flatter continental rise. Sediment from the continent above cascades down the slope and accumulates as a pile of sediment at the base of the slope, called the continental rise"}, {"url": "http://www.un.org/depts/los/clcs_new/continental_shelf_description.htm", "passage_text": "The definition of the continental shelf and criteria for the establishment of its outer limits. The definition of the continental shelf and the criteria by which a coastal State may establish the outer limits of its continental shelf are set out in article 76 of the Convention. "}, {"url": "http://www.wisegeek.org/what-is-a-continental-shelf.htm", "passage_text": "In some instances, the continental shelf is very short, as is the case in subduction zones where one tectonic plate is being sucked below another. A well known example can be found in the waters off the coast of Chile. In other cases, extension stretches for many miles (or kilometers) out to sea. @ Arunil-The width of the continental shelf has to do with plate tectonics and plate boundaries. If you look at a map of the continental shelves, you will notice that they are narrowest around plate boundaries, especially subduction zones."}, {"url": "http://www.merriam-webster.com/dictionary/continental%20shelf", "passage_text": "Full Definition of CONTINENTAL SHELF. : a shallow submarine plain of varying width forming a border to a continent and typically ending in a comparatively steep slope to the deep ocean floor. See continental shelf defined for English-language learners. See continental shelf defined for kids. ADVERTISEMENT."}]