[{"url": "http://www.uspto.gov/patents-getting-started/patent-basics/types-patent-applications/provisional-application-patent", "passage_text": "A provisional application for patent (provisional application) is a U.S. national application filed in the USPTO under 35 U.S.C. §111(b) . A provisional application is not required to have a formal patent claim or an oath or declaration. 1 Provisional applications for patent may not be filed for design inventions. 2  Provisional applications are not examined on their merits. 3  Provisional applications for patent cannot claim the benefit of a previously-filed application, either foreign or domestic."}, {"url": "http://www.ericksonlawgroup.com/law/patents/patentfaq/how-long-does-it-take-to-get-a-patent/", "passage_text": "In the case that you file a provisional and then file a provisional on the one year anniversary date of the filing of the provisional, one additional year will be added to the times listed above. This is true because you have waited that 1 year to have the non-provisional application placed in a queue to be examined. First, if you choose to have a patentability search performed by our office, that generally takes 1 to 3 weeks to complete, depending on the volume of search results and the workload at the time. Patent Application Drafting:"}, {"url": "https://www.legalzoom.com/knowledge/patent/faq/how-long-process", "passage_text": "If you have filed a Provisional Application for Patent relating to the same invention, and your Non-Provisional Utility Patent Application is filed within 12 months of your Provisional Application, your filing date will be the filing date of your Provisional Application. « PREVIOUS. NEXT ». The Non-Provisional Utility Patent is broken into 2 different packages. Step 1 includes a professional patent drawings and initial consultation with a patent professional. This process generally takes approximately 4 weeks to complete. The optional search and review will require an additional week"}, {"url": "http://www.ipwatchdog.com/2013/09/14/the-benefits-of-a-provisional-patent-application/id=45156/", "passage_text": "To get to 75% complete it takes 25% of the time and the final 25% will take 75% of the time. Thus, the approach to provisional patent applications is to make sure you have all the disclosure we need later when we will prepare the nonprovisional patent application. A provisional patent application lasts a maximum of 12 months and then goes abandoned. You must file a nonprovisional patent application within 12 months of the filing of the provisional patent application in order to continue to seek a utility patent."}, {"url": "http://www.ericksonlawgroup.com/law/patents/patentfaq/how-long-does-it-take-to-get-a-patent/", "passage_text": "After the patent application is filed you will have “patent pending” status in the United States. After Patent Application Filing. After filing, the length of time to patent grant depends on whether you begin with a provisional or a non-provisional patent application in the United States. First, if you choose to have a patentability search performed by our office, that generally takes 1 to 3 weeks to complete, depending on the volume of search results and the workload at the time. Patent Application Drafting:"}, {"url": "http://www.ipwatchdog.com/2013/09/14/the-benefits-of-a-provisional-patent-application/id=45156/", "passage_text": "A fairly typical quote for a provisional patent application (through filing) for a moderately complex mechanical innovation is $2,5000 for attorneys fees plus the cost of the provisional filing fee (typically $130) and the cost of any professional illustrations desired (typically $200 to $300). A provisional patent application lasts a maximum of 12 months and then goes abandoned. You must file a nonprovisional patent application within 12 months of the filing of the provisional patent application in order to continue to seek a utility patent."}, {"url": "http://www.ipwatchdog.com/2014/03/15/an-overview-of-the-u-s-patent-process-2/id=48506/", "passage_text": "In order for the patent prosecution process to begin a non-provisional patent application must be filed. A nonprovisional patent application is the application you file when you want the Patent Office to review the filing and proceed toward issuing a utility patent application. Provisional patent applications are not examined by the Patent Office, they are rather easy to file and the filing fee for a small entity (i.e., individual or business with 500 or fewer employees) is presently $130."}, {"url": "http://www.nolo.com/legal-encyclopedia/provisional-patent-application-deciding-to-file-29830.html", "passage_text": "Filing a provisional patent application (PPA) protects your idea and starts the process of getting a patent and making money from your invention. But before you dive into the PPA process, take the time to assess whether filing is right for you. "}, {"url": "http://www.ipwatchdog.com/2013/09/14/the-benefits-of-a-provisional-patent-application/id=45156/", "passage_text": "If you do file the nonprovisional patent application within 12 months then the filing date of your nonprovisional patent application will be deemed to be the filing date of your earlier filed provisional patent application, at least with respect to whatever you disclosed in the provisional patent application. A provisional patent application lasts a maximum of 12 months and then goes abandoned. You must file a nonprovisional patent application within 12 months of the filing of the provisional patent application in order to continue to seek a utility patent."}, {"url": "http://www.ipwatchdog.com/2013/09/14/the-benefits-of-a-provisional-patent-application/id=45156/", "passage_text": "Software —. A fairly typical quote for a provisional patent application (through filing) for a software innovation is $5,000 for attorneys fees plus the cost of the provisional filing fee (typically $130) and the cost of any professional illustrations desired (typically $300 to $500). A provisional patent application lasts a maximum of 12 months and then goes abandoned. You must file a nonprovisional patent application within 12 months of the filing of the provisional patent application in order to continue to seek a utility patent."}]