[{"url": "http://www.apa.org/topics/personality/", "passage_text": "Personality refers to individual differences in characteristic patterns of thinking, feeling and behaving. The study of personality focuses on two broad areas: One is understanding individual differences in particular personality characteristics, such as sociability or irritability."}, {"url": "http://www.livescience.com/41313-personality-traits.html", "passage_text": "Changing personality is usually considered a tough process, but openness is a personality trait that's been shown to be subject to change in adulthood. In a 2011 study, people who took psilocybin, or hallucinogenic magic mushrooms, became more open after the experience."}, {"url": "http://www.merriam-webster.com/dictionary/personality", "passage_text": "Medical Definition of PERSONALITY. 1. : the complex of characteristics that distinguishes an individual especially in relationships with others. 2. a: the totality of an individual's behavioral and emotional tendencies b: the organization of the individual's distinguishing character traits, attitudes, or habits."}, {"url": "http://examples.yourdictionary.com/examples-of-personality-traits.html", "passage_text": "There are many different personality types, and it is sometimes difficult to classify a person into a single type as there are many different personality traits you can possess. Personality traits are simply: 1  Actions."}, {"url": "http://examples.yourdictionary.com/examples-of-personality-traits.html", "passage_text": "Positive Personality Traits. Some personality traits are positive: 1  Being honest no matter what the consequences are is one personality trait people should aspire to. 2  Having responsibility for all of your actions and being a little bit of a perfectionism are also personality traits."}, {"url": "http://examples.yourdictionary.com/examples-of-personality-traits.html", "passage_text": "1 Being honest no matter what the consequences are is one personality trait people should aspire to. 2  Having responsibility for all of your actions and being a little bit of a perfectionism are also personality traits. 3  Adaptability and compatibility are great and can help you get along with others."}, {"url": "http://character-in-action.com/character-trait-definitions/", "passage_text": "Character Trait Definitions. Character traits have in common particular elements. We do not attempt to list them all, but you will want to make note of five major similarities: 1. Understanding flowing into desire and then action. All character traits are built intellectually first."}, {"url": "http://www.thefreedictionary.com/Traits", "passage_text": "trait. A characteristic or condition that is determined by one's genes. The color of an animal's coat and the shape of a plant's leaves are physical traits. Nesting in birds and burrowing in rodents are examples of behavioral traits."}]