[{"url": "http://geology.com/rocks/sedimentary-rocks.shtml", "passage_text": "Sedimentary Rocks. Picture Gallery of the Most Common Rock Types. Breccia is a clastic sedimentary rock that is composed of large (over two millimeter diameter) angular fragments. The spaces between the large fragments can be filled with a matrix of smaller particles or a mineral cement which binds the rock together. "}, {"url": "https://en.wikipedia.org/wiki/Conglomerate_(company)", "passage_text": "A conglomerate is a combination of two or more corporations engaged in entirely different businesses that fall under one corporate group, usually involving a parent company and many subsidiaries. Often, a conglomerate is a multi-industry company. "}, {"url": "https://en.wikipedia.org/wiki/Conglomerate_(geology)", "passage_text": "Conglomerate /kəŋˈɡlɒmərɨt/ is a coarse-grained clastic sedimentary rock that is composed of a substantial fraction of rounded to subangular gravel-size clasts, e.g., granules, pebbles, cobbles, and boulders, larger than 2 mm (0.079 in) in diameter. Conglomerates form by the consolidation and lithification of gravel. The size and composition of the gravel-size fraction of a conglomerate may or may not vary in composition, sorting, and size. In some conglomerates, the gravel-size class consist almost entirely of what were clay clasts at the time of deposition."}, {"url": "http://www.yourdictionary.com/conglomerate", "passage_text": "noun. The definition of conglomerate is one item consisting of many parts. An example of conglomerate is a rock with many different minerals contained in its structure. A conglomerate is defined as something consisting of many similar elements. An example of conglomerate is a large corporation which was formed after the merger of many smaller corporations"}, {"url": "http://www.investopedia.com/terms/c/conglomerate.asp", "passage_text": "DEFINITION of 'Conglomerate'. A conglomerate is a corporation that is made up of a number of different, seemingly unrelated businesses. In a conglomerate, one company owns a controlling stake in a number of smaller companies, which conduct business separately. Each of a conglomerate's subsidiary businesses runs independently of the other business divisions, but the subsidiaries' management reports to senior management at the parent company"}, {"url": "http://www.sandatlas.org/conglomerate/", "passage_text": "Conglomerate. Conglomerate is a sedimentary rock formed by the lithification of rounded or sub-rounded gravel (grains larger than 2 mm in diameter). Conglomerate is strongly related to sandstone. It is actually a type of sandstone although it may not be technically correct to say so."}, {"url": "http://stoneplus.cst.cmich.edu/conglomerate.htm", "passage_text": "CONGLOMERATE. A. Conglomerate, jasper puddingstone clock (greatest dimension-ca. 25 cm) fashioned from a boulder of the Lorrain Conglomerate that was collected from reworked glacial drift off Richards Landing, St. Joseph Island (in northern Lake Huron), Ontario, Canada. "}, {"url": "http://geology.com/rocks/conglomerate.shtml", "passage_text": "Conglomerate is a clastic sedimentary rock that contains large (greater than two millimeters in diameter) rounded clasts. The space between the clasts is generally filled with smaller particles and/or a chemical cement that binds the rock together. Conglomerate can have a variety of compositions. As a clastic sedimentary rock it can contain clasts of any rock material or weathering product that is washed downstream or down current. The rounded clasts of conglomerate can be mineral particles such as quartz or they can be sedimentary, metamorphic or igneous rock fragments. The matrix that binds the large clasts together can be a mixture of sand, mud and chemical cement"}]