[{"url": "http://www.madehow.com/Volume-4/Licorice.html", "passage_text": "Since sugar is not critical to the texture of the licorice, it can be less refined, reducing the cost of the licorice recipe. Corn syrup is typically used in combination with sugar in licorice candy. It is a modified form of starch, and like sugar, it provides sweetness to the licorice. It also inhibits sugar crystallization, helps control moisture retention and limits microbial spoilage. Since licorice is a sweet candy, sweetening ingredients make up much of their composition. Sugar and corn syrup are two primary sweeteners. Sugar is sucrose, which is derived from beet and cane sugars. It is supplied as small, white crystals, which readily dissolve in water."}, {"url": "https://en.wikipedia.org/wiki/Liquorice_(confectionery)", "passage_text": "Liquorice (spelled licorice in many regions) is a confection flavoured with the extract of the roots of the liquorice plant. However, even regular liquorice candy can contain up to 2 percent ammonium chloride, the taste of which is less prominent due to the higher sugar concentration. Some liquorice candy is flavoured with anise oil instead of or in combination with liquorice root extract."}, {"url": "http://www.americanlicorice.com/about/what-is-licorice/", "passage_text": "Licorice root has been prized for its rich flavor and for over 3,000 years – King Tut, Alexander the Great, Roman Emperor Caesar, the Ancient Chinese and the Native Americans were known to appreciate its natural properties. Licorice root is also referred to as liquorice or sweetroot. The licorice plant, an herbaceous perennial and legume, grows from three to seven feet and the taproot can reach a depth of four feet. The licorice plant is late blossoming, with purple and white flowers and maroon seed pods. The root is ready to harvest after three to five years."}, {"url": "http://www.answers.com/Q/How_is_licorice_candy_made", "passage_text": "The licorice rope extrusion process is another way to make licorice candy. It starts with boiling a mix containing licorice root extract to an exact temperature. Next, hot syrup containing licorice is poured into the molds and cooled. How the syrup is cooked determines if the candy is tough, chewy or soft. After the cooling process, the licorice is dumped onto a packaging table and given a glaze."}, {"url": "https://en.wikipedia.org/wiki/Liquorice_(confectionery)", "passage_text": "In North America, liquorice is called black licorice to distinguish it from similar confectionery varieties that are not flavoured with liquorice extract but commonly manufactured in the form of chewy ropes or tubes. So called black licorice is also a widespread flavour in other forms of candy such as jellybeans. However, even regular liquorice candy can contain up to 2 percent ammonium chloride, the taste of which is less prominent due to the higher sugar concentration. Some liquorice candy is flavoured with anise oil instead of or in combination with liquorice root extract."}, {"url": "http://www.webmd.com/vitamins-supplements/ingredientmono-881-LICORICE.aspx?activeIngredientId=881&activeIngredientName=LICORICE", "passage_text": "Licorice is a plant. You are probably most familiar with it as a flavoring in foods, beverages, and tobacco. The root is used to make medicine. Licorice is used for various digestive system complaints including stomach ulcers, heartburn, colic, and ongoing inflammation of the lining of the stomach (chronic gastritis). "}, {"url": "http://www.food.com/recipe/original-licorice-candy-189100", "passage_text": "Original licorice candy made with the licorice root. This is a delicious treat which is mildly laxative and alleviates symptoms of colds and flu. "}, {"url": "https://en.wikipedia.org/wiki/Liquorice_(confectionery)", "passage_text": "Ammonium chloride is mainly used in salty liquorice candy, with concentrations up to about 8 percent. However, even regular liquorice candy can contain up to 2 percent ammonium chloride, the taste of which is less prominent due to the higher sugar concentration. Some liquorice candy is flavoured with anise oil instead of or in combination with liquorice root extract."}, {"url": "https://en.wikipedia.org/wiki/Liquorice", "passage_text": "Liquorice, or licorice, (/ˈlɪkᵊrɪʃ/ LIK-(ə-)rish or /ˈlɪkᵊrɪs/ LIK-(ə-)ris) is the root of Glycyrrhiza glabra from which a sweet flavour can be extracted. Dried liquorice root can be chewed as a sweet. Black liquorice contains about 100 calories per ounce (15 kJ/g). Liquorice is used by brewers to flavour and colour porter classes of beers, and the enzymes in the root also stabilize the foam heads produced by beers brewed with it."}, {"url": "http://www.madehow.com/Volume-4/Licorice.html", "passage_text": "Licorice is a glossy, gelled candy with a semi-firm consistency that is flavored with licorice root extract. Typically, it is a moderately sweet candy, and is available in a variety of flavors such as black licorice, strawberry, cherry and chocolate. Since licorice is a sweet candy, sweetening ingredients make up much of their composition. Sugar and corn syrup are two primary sweeteners. Sugar is sucrose, which is derived from beet and cane sugars. It is supplied as small, white crystals, which readily dissolve in water."}]