[{"url": "http://blog.dreamhosters.com/kbase/", "passage_text": "This is an unofficial mirror of the DreamHost Knowledge Base from the beginning of 2006. DreamHost has decided to integrate their Knowledge Base to the Community Wiki, but some people preferred the old system, so I've decided to mirror it. More info in my blog …. Please notice that this Knowledge Base will not be updated, and it's no longer possible."}, {"url": "http://www.pcmag.com/article2/0,2817,2423650,00.asp", "passage_text": "By Fahmida Y. Rashid, Jeffrey L. Wilson Dreamhost has a laundry list of features to satisfy your personal-or business-related Web hosting needs. The company's shared Web hosting plans offer unlimited disk storage, domains, and email accounts—it's great for those who have meager hosting needs. Thanks to its extensive tools and security options, unlimited storage, bandwidth, domains, and email, and generous money-back guarantee, Dreamhost is a PCMag Editors' Choice for Web hosting services. Dreamhost has a laundry list of features to satisfy your personal-or business-related Web hosting needs."}, {"url": "https://www.dreamhost.com/", "passage_text": "Voted Best Web Hosting Service by PC Mag for the Second Straight Year! To celebrate, we're offering 40% off our standard hosting + a 97 day money back guarantee. That's just $5.95/mo. 1  Managed WordPress Hosting Optimized for WordPress sites and blogs.Get 20% off by signing up today! "}, {"url": "https://www.quora.com/Should-I-use-Amazon-EC2-S3-or-Dreamhost-for-web-hosting", "passage_text": "The quick answer is: Dreamhost is an inexpensive hosting solution that takes care of the administrative headache for you, but is prone to slowness and downtime. EC2 is fully under your control, but as such is much more painful to administrate and support. If another user on your server is under heavy load or their code is poorly performant, they could slow down your web site. On the plus side, Dreamhost takes care of managing your server, security updates, backups, support, databases, etc."}, {"url": "http://blog.dreamhosters.com/kbase/index.cgi?area=2", "passage_text": "This is an unofficial mirror of the DreamHost Knowledge Base from the beginning of 2006. DreamHost has decided to integrate their Knowledge Base to the Community Wiki, but some people preferred the old system, so I've decided to mirror it. More info in my blog …. Please notice that this Knowledge Base will not be updated, and it's no longer possible. to comment the articles."}, {"url": "https://en.wikipedia.org/wiki/DreamHost", "passage_text": "DreamHost is a Los Angeles-based web hosting provider and domain name registrar. DreamHost's staff contribute to an official blog and a customer support wiki. DreamHost does not offer call-in phone support, but customers can pay extra to request callbacks from support staff. Furthermore, a live chat option is available for all accounts when the level of support emails is low."}, {"url": "https://en.wikipedia.org/wiki/DreamHost", "passage_text": "DreamHost began hosting customers' sites in 1997. In May 2012, DreamHost spun off Inktank. Inktank is a professional services and support company for the open source Ceph file system. In November 2014, DreamHost spun off Akanda, an open source network virtualization solution. DreamHost's staff contribute to an official blog and a customer support wiki. DreamHost does not offer call-in phone support, but customers can pay extra to request callbacks from support staff. Furthermore, a live chat option is available for all accounts when the level of support emails is low."}, {"url": "https://en.wikipedia.org/wiki/DreamHost", "passage_text": "DreamHost's shared, VPS, and dedicated hosting network consists of Apache, nginx and lighttpd web servers running on the Ubuntu operating system. DreamHost also offers cloud storage and computing services for entrepreneurs and developers, launched in 2012. DreamHost's staff contribute to an official blog and a customer support wiki. DreamHost does not offer call-in phone support, but customers can pay extra to request callbacks from support staff. Furthermore, a live chat option is available for all accounts when the level of support emails is low."}]