[{"url": "https://en.wikipedia.org/wiki/Life_expectancy", "passage_text": "Mathematically, life expectancy is the mean number of years of life remaining at a given age, assuming constant mortality rates. It is denoted by, which means the average number of subsequent years of life for someone now aged, according to a particular mortality experience. Longevity refers to the characteristics of the relatively long life span of some members of a population. Moreover, because life expectancy is an average, a particular person may well die many years before or many years after their expected survival."}, {"url": "https://en.wikipedia.org/wiki/List_of_countries_by_life_expectancy", "passage_text": "Life expectancy equals the average number of years a person born in a given country would live if mortality rates at each age were to remain constant in the future. The life expectancy is shown separately for males and females, as well as a combined figure. "}, {"url": "http://www.usatoday.com/story/news/nation/2014/10/08/us-life-expectancy-hits-record-high/16874039/", "passage_text": "The average life expectancy for a person who was 65 years old in 2012 is 19.3 years – 20.5 years for women and 17.9 years for men. The difference in life expectancy at 65 years between males and females increased 0.1 year from 2.5 years in 2011 to 2.6 years in 2012. Life expectancy in the USA hits a record high. Life expectancy in the USA hits a record high: Those born in 2012 have a life expectancy of 78.8 years. People aged 65 in 2012 have a life expectancy of 19.3 years, says a new government report on mortality."}, {"url": "http://www.usatoday.com/story/news/nation/2014/10/08/us-life-expectancy-hits-record-high/16874039/", "passage_text": "Good news, America: We're living longer! Life expectancy in the USA rose in 2012 to 78.8 years – a record high. That was an increase of 0.1 year from 2011 when it was 78.7 years, according to a new report on mortality in the USA from the Centers for Disease Control and Prevention's National Center for Health Statistics. Life expectancy in the USA hits a record high. Life expectancy in the USA hits a record high: Those born in 2012 have a life expectancy of 78.8 years. People aged 65 in 2012 have a life expectancy of 19.3 years, says a new government report on mortality."}, {"url": "https://en.wikipedia.org/wiki/Life_expectancy", "passage_text": "Life expectancy is defined statistically as the average number of years remaining for an individual or a group of people at a given age. Longevity refers to the characteristics of the relatively long life span of some members of a population. Moreover, because life expectancy is an average, a particular person may well die many years before or many years after their expected survival. The term  maximum life span  has a quite different meaning and is more related to longevity"}, {"url": "http://www.usatoday.com/story/news/nation/2014/10/08/us-life-expectancy-hits-record-high/16874039/", "passage_text": "The news is a little better for women, a little worse for men. Life expectancy for females is 81.2 years; for males, it's 76.4 years. That difference of 4.8 years is the same as in 2011. Life expectancy in the USA hits a record high. Life expectancy in the USA hits a record high: Those born in 2012 have a life expectancy of 78.8 years. People aged 65 in 2012 have a life expectancy of 19.3 years, says a new government report on mortality."}, {"url": "http://www.news-medical.net/health/What-is-Life-Expectancy.aspx", "passage_text": "By Dr Ananya Mandal, MD. Life expectancy refers to the number of years a person is expected to live based on the statistical average. Life expectancy varies by geographical area and by era. In the Bronze age, for example, life expectancy was 26 years, while in 2010, it was 67 years. In mathematical terms, life expectancy refers to the expected number of years remaining for an individual at any given age. In formulaic terms, life expectancy is denoted by ex, where, “e” represents the expected number of years remaining and “x” represents the person’s present "}, {"url": "http://aihw.gov.au/deaths/life-expectancy/", "passage_text": "Life expectancy is the most commonly used measure to describe population health and reflects the overall mortality level of a population. Life expectancy measures how long, on average, a person is expected to live based on current age and sex-specific death rates. In summarising mortality patterns, life expectancy is often expressed as the number of years of life a person born today is expected to live"}, {"url": "http://www.who.int/gho/mortality_burden_disease/life_tables/situation_trends_text/en/", "passage_text": "Life expectancy at age 60 reflects the overall mortality level of a population over 60 years. In 2013, the global population aged 60 years can expect to live another 20 years on average, 2 years longer than in 1990. Life expectancy at birth reflects the overall mortality level of a population. It summarizes the mortality pattern that prevails across all age groups in a given year – children and adolescents, adults and the elderly."}]