[{"url": "http://www.medicalnewstoday.com/articles/248215.php", "passage_text": "Knowledge center. Humira (adalimumab) is a TNF inhibitor approved for the treatment of rheumatoid arthritis, chronic plaque psoriasis, Crohn's disease, ankylosing spondylitis, psoriatic arthritis, and polyarticular juvenile idiopathic arthritis. Humira is used for pain relief and to reduce inflammation in a number of autoimmune diseases. Humira belongs to a class of drugs called biologics. Biologics are therapies based on proteins-usually antibodies-which have been developed with DNA technology (genetic engineering)."}, {"url": "http://www.medicinenet.com/adalimumab/article.htm", "passage_text": "DRUG CLASS AND MECHANISM: Adalimumab is an injectable protein(antibody) that blocks the inflammatory effects of tumor necrosis factor alpha (TNF alpha) in rheumatoid arthritis, psoriatic arthritis, ankylosing spondylitis, and Crohn 's disease of the intestine. "}, {"url": "http://www.everydayhealth.com/drugs/humira", "passage_text": "Humira is the brand name for the drug adalimumab, an injectable medicine used to treat adults with inflammatory conditions such as rheumatoid arthritis. Humira is also used to treat juvenile idiopathic arthritis (JIA) in children over age 4. A: Humira (adalimumab) is a medication used to reduce an entity in the body which produces inflammation, swelling, and as a result, pain, and hair loss is not a listed negative reaction."}, {"url": "http://www.ncbi.nlm.nih.gov/pubmedhealth/PMHT0008825/?report=details", "passage_text": "Adalimumab injection is used to treat the symptoms and prevent the progression of active rheumatoid arthritis and ankylosing spondylitis. It is used in children 2 years of age and older for juvenile idiopathic arthritis. Adalimumab injection may also be used to treat chronic plaque psoriasis, which is a skin disease with red patches and white scales that don't go away. This medicine is available only with your doctor's prescription."}, {"url": "http://www.everydayhealth.com/drugs/humira", "passage_text": "A: Humira (adalimumab) is used alone or with other medications to relieve the symptoms of certain autoimmune disorders such as rheumatoid arthritis and Crohn's. Adalimumab injection is in a class of medications called tumor necrosis factor (TNF) inhibitors. A: Humira (adalimumab) is a medication used to reduce an entity in the body which produces inflammation, swelling, and as a result, pain, and hair loss is not a listed negative reaction."}, {"url": "http://www.everydayhealth.com/drugs/humira", "passage_text": "A: Humira (adalimumab) is a medication that is used to treat various conditions including rheumatoid arthritis, Chrohn's disease, and psoriasis. It is in a class of medications called TNF inhibitors. TNF is a chemical in the body that is involved in inflammation and immune system responses. A: Humira (adalimumab) is a medication used to reduce an entity in the body which produces inflammation, swelling, and as a result, pain, and hair loss is not a listed negative reaction."}, {"url": "https://www.humira.com/", "passage_text": "HUMIRA Use 1. HUMIRA is a prescription medicine used alone, with methotrexate, or with certain other medicines to reduce the signs and symptoms of moderate to severe polyarticular juvenile idiopathic arthritis in children 2 years of age and older. HUMIRA Use 1. HUMIRA is a prescription medicine used alone or with certain other medicines to reduce the signs and symptoms of psoriatic arthritis in adults, may prevent further damage to your bones and joints, and may help your ability to perform daily activities."}, {"url": "https://www.humira.com/", "passage_text": "HUMIRA Use 1. HUMIRA is a prescription medicine used alone, with methotrexate, or with certain other medicines to reduce the signs and symptoms of moderate to severe rheumatoid arthritis in adults, may prevent further damage to your bones and joints, and may help your ability to perform daily activities. HUMIRA Use 1. HUMIRA is a prescription medicine used alone or with certain other medicines to reduce the signs and symptoms of psoriatic"}, {"url": "https://en.wikipedia.org/wiki/Adalimumab", "passage_text": "Adalimumab has been approved in the United States for rheumatoid arthritis, psoriatic arthritis, ankylosing spondylitis, Crohn's disease, ulcerative colitis, moderate to severe chronic psoriasis and juvenile idiopathic arthritis. Humira costs approximately $3,100 per month, like the TNF-alpha inhibitor etanercept. In 2012, Humira had $4.3 billion of sales in the US, and $9.3 billion worldwide. In December 2014, Cadila Healthcare Ltd., launched in India the first Adalimumab biosimilar, under the name Exemptia, at a price of $200 a vial."}, {"url": "http://www.everydayhealth.com/drugs/humira", "passage_text": "Humira is a type of medication called a tumor necrosis factor (TNF) blocker, or anti-TNF drug. TNF blockers help reduce inflammation and slow the progression of inflammatory conditions by targeting TNF, a substance produced by the immune system that causes inflammation in the body. A: Humira (adalimumab) is a medication used to reduce an entity in the body which produces inflammation, swelling, and as a result, pain, and hair loss is not a listed negative reaction."}]