[{"url": "http://www.answers.com/Q/How_long_does_marijuana_stay_in_urine_for_occasional_smokers", "passage_text": "For a regular smoker, anywhere from 2 to 6 weeks, or a month on average. You could give or take a week or so depending on your weight and metabolism. 2-5 days for single use / … up to 12 weeks for habitual use. But allot depending on your metabolism, height and weight, amount of consumption, potency of the marijuana."}, {"url": "http://www.answers.com/Q/How_long_will_THC_stay_in_your_system_for_an_occasional_smoker", "passage_text": "THC can stay in your system for up to 30 days, it is stored in your fat cells. So the less body fat you have the shorter amount of time it will stay in your system & the lower … your levels will be. If you smoke everyday you need to quit smoking atleast 25 to 30 days before your drug test."}, {"url": "http://stuffstonerslike.com/2015/05/how-long-does-weed-stay-in-your-system/", "passage_text": "THC will appear as a positive within 2-5 hours of use on a urine drug test. How long it will still show on a urine drug test is estimated based on frequency of use, but does not take into account the weight and body fat of the marijuana user."}, {"url": "http://www.theweedblog.com/how-long-does-marijuana-stay-in-your-system-infographic/", "passage_text": "On a Urine Drug Test, THC will appear as a positive within 2-5 hours of use. How long it will still show on a urine drug test is estimated based on frequency of use, but does not take into account the weight and body fat of the marijuana user:"}, {"url": "http://www.marijuana.com/community/threads/how-long-does-marijuana-stay-in-your-system.272004/", "passage_text": "So, we call this approximate calculation as half life. If you have smoked marijuana then the drug will stay for 3 to 30 days. This is normal for the common drugs. But in the case of marijuana, this can be detected even after a month in Urine drug test marijuana. Marijuana will stay in your system for 10 days if you have been smoking occasionally. If it is smoked on regular basis it will be there up to 45 days and if you smoke constant pace then it will be in the system for as long as 90 days. http://clnk.me/1yc0I."}, {"url": "http://www.answers.com/Q/How_long_does_marijuana_stay_in_urine_for_occasional_smokers", "passage_text": "How long does marijuana stay in your urine if you smoked everyday for years? It will stay for 30 days. If you use water and Cranberry juice these will help remove it from your system faster, but it would still be wise to wait for the full 30 days befor … e you take a drug test."}]