[{"url": "http://www.i-amperfectlyhealthy.com/MSM.html", "passage_text": "MSM stands for methyl-sulfonyl-methane, which is sulfur. MSM is an organic white sulfur powder, which comes from the ocean and is water soluble. IT IS A FOOD found in plants, meats, dairy products and vegetation. It is the third largest nutrient found in your body. We suggest you do not use synthetically produced MSM. The organic sulfur we use and offer on our shopping cart is very well absorbed. The precise dosage is not real critical, since MSM is a macro mineral food. Personally I started with one tsp 3x per day and NOW take one tsp 2x per day."}, {"url": "http://articles.mercola.com/sites/articles/archive/2013/03/03/msm-benefits.aspx", "passage_text": "The nutrient MSM (methylsulfonylmethane) is a naturally occurring sulfur compound found in all vertebrates, including humans. MSM is already well-known for its joint health benefits, but it may be important for a whole host of other reasons as well. Rod Benjamin is the director of technical development for Bergstrom Nutrition, the largest producer of the highest quality MSM that is produced by distillation purification."}, {"url": "http://www.webmd.com/arthritis/osteoarthritis-women-12/arthritis-supplements", "passage_text": "Many people with arthritis -- especially osteoarthritis -- use supplements in their diet to ease the pain of arthritis. Glucosamine and chondroitin are the most well-known. Methyl sulfonylmethane (MSM) is another supplement used to ease the pain of arthritis, but it has not been through as much scientific testing. It is important to check with your doctor before starting any new treatment"}, {"url": "http://www.arthritis-msm-supplements.com/Newsletter%20Archives/msm_purity_test.htm", "passage_text": "OptiMSM is the one product I can guarantee will pass the purity test every time. When you have the purest form of sulfur on the market today, you will find the benefits allow you to live a cleaner, better life. You are in control of your future, and MSM is there to help every step of the way. As we age our sulfur levels fall but the need rises. MSM is the only pure sulfur product you will find on the market today. But not every manufacturer of MSM provides a pure form of sulfur you need. Instead, those companies can and do cut corners to give you MSM but they give you little surprises. When you head to the local vitamin store or supplement store, you may find oodles of MSM products. You may find that they state they are 99% or even 100% pure. The problem is that the purity is not regulated by the FDA"}, {"url": "http://puremsm.com/msmcanhelp.htm", "passage_text": "Years of clinical studies and everyday use have proven that MSM, as a dietary supplement, is highly effective for the treatment of arthritis, emphysema, carpal tunnel, asthma, back pain, acne, fibromyalgia and a long list of other common and serious ailments. We offer you the highest quality patented made in USA MSM. "}, {"url": "http://theshawnstevensonmodel.com/7-benefits-of-msm-the-miracle-supplement/", "passage_text": "What results is a natural and effective reduction in unwanted weight. How to use MSM: MSM can be purchased in powder form or in supplement capsules. For best results using the MSM powder, added it to your water along with a botanical source of vitamin C like Camu Camu Berry or lemon juice."}, {"url": "http://articles.mercola.com/sites/articles/archive/2013/03/03/msm-benefits.aspx", "passage_text": "MSM, which is a metabolite of DMSO, and approved for use in humans, primarily impacts your health by reducing inflammation. It’s widely used as a supplement for arthritic conditions. Like DMSO, MSM also appears to improve cell wall permeability, so it can be used to help deliver other active ingredients. MSM is already well-known for its joint health benefits, but it may be important for a whole host of other reasons as well. Rod Benjamin is the director of technical development for Bergstrom Nutrition, the largest producer of the highest quality MSM that is produced by distillation purification."}, {"url": "http://www.i-amperfectlyhealthy.com/MSM.html", "passage_text": "My Personal Dosing. I personally use 1 teaspoon of MSM powder 2 or 3x a day PLUS 1/4th teaspoon PURE Vitamin C Powder. The PURE Vitamin C (not synthetic/ascorbic acid) enhances the absorption and effectiveness of the MSM and is a wonderful antioxidant. We suggest you do not use synthetically produced MSM. The organic sulfur we use and offer on our shopping cart is very well absorbed. The precise dosage is not real critical, since MSM is a macro mineral food. Personally I started with one tsp 3x per day and NOW take one tsp 2x per day."}, {"url": "http://www.arthritis-msm-supplements.com/Newsletter%20Archives/msm_purity_test.htm", "passage_text": "MSM Purity Test Changing your life starting with a healthy lifestyle, and many people find that getting that lifestyle is not always easy. Dietary supplements help a lot, but getting the right supplement takes a lot of time and patience. As we age our sulfur levels fall but the need rises. MSM is the only pure sulfur product you will find on the market today. But not every manufacturer of MSM provides a pure form of sulfur you need. Instead, those companies can and do cut corners to give you MSM but they give you little surprises. When you head to the local vitamin store or supplement store, you may find oodles of MSM products. You may find that they state they are 99% or even 100% pure. The problem is that the purity is not regulated by the FDA"}]