[{"url": "http://www.ehow.com/info_7840800_benefits-effects-limestone.html", "passage_text": "Effects on Aquatic Life. Another of the effects and benefits of limestone is that is lowers the poisonous effects of toxic metals such as lead, cadmium, zinc and nickel which endanger both fish and human health."}, {"url": "http://www.ehow.com/info_7840800_benefits-effects-limestone.html", "passage_text": "Limestone is a sedimentary rock that is made up mostly of calcium carbonate which is represented by the chemical formula CaCO3. Approximately ten percent of all sedimentary rock is limestone."}, {"url": "https://answers.yahoo.com/question/index?qid=20090108101231AA4pWBb", "passage_text": "Report Abuse. Limestone is plentiful on the surface of the earth and quite useful. Other benefits of quarrying are the possibilities of using the quarry as a water reservoir/recreation area if it is safe enough and in other cases where the water table is very low the quarry could be used for landfill purposes."}, {"url": "http://www.bybeestone.com/green/benefits.php", "passage_text": "Benefits of Limestone. Low Carbon Lifecycle Footprint. Unlike other building materials, all of the work of refining and producing the material has been done for us by the Earth."}, {"url": "http://www.stonepanels.com/the-benefits-of-using-limestone/", "passage_text": "Fun Fact: The Romans and Greeks built numerous limestone statues and buildings about 2,000 years ago. Many landmarks across the world, including the Great Pyramid and its associated complex in Giza, Egypt, are made of limestone."}, {"url": "http://www.14gaam.com/choona-70-help-benefits-of-chuna-limestone-rajiv-dixit.htm", "passage_text": "Please listen to this video, There are 70 benefits of Chuna or Choona or LimeStone By Parm Pujya Shri Rajiv Dixit. Choona or Chuna is the made from the Lime Stone. It is most useful element for our body. Generally in India people use choona with Pan (leaf) (Pan is the one of the most popular mukhwas using in India)."}]