[{"url": "http://www.health.ny.gov/diseases/communicable/hepatitis/docs/policy_statement_on_twinrix_accelerated_dosing.pdf", "passage_text": "Immunization Program. Policy Statement. The accelerated four-dose schedule for combined hepatitis A and B vaccine (Twinrix®) should only be considered for use in patients with impending travel to occur in less than 28 days from the first dose of the vaccine series. Not every traveling patient is a candidate to receive the accelerated dosing schedule. The first three doses of the accelerated Twinrix schedule provide equivalent protection to. the first dose in the standard monovalent hepatitis A vaccine series and the first two doses. in the standard monovalent hepatitis B"}, {"url": "http://www.cdc.gov/vaccines/pubs/pinkbook/downloads/appendices/A/age-interval-table.pdf", "passage_text": "8 Children receiving the first dose of Hib or PCV vaccine at age 7 months or older require fewer doses to complete the series. 10 HepB-3 should be administered at least 8 weeks after HepB-2 and at least 16 weeks after HepB-1, and should not be administered before age. 24 weeks. (. exception. : the minimum age for the first dose of MenHibrix is 6 weeks); the minimum interval between doses is equal to the greatest interval of any of. the individual components. 2 Information on travel vaccines including typhoid, Japanese encephalitis, and yellow fever, is available at. ."}, {"url": "http://www.medscape.com/viewarticle/484857", "passage_text": "Three hepatitis B vaccine schedules have been shown to induce levels of seroprotection of greater than 95% in infants. One schedule uses an initial dose administered at birth, followed by doses at 1 and 6 months of age. The next schedule has doses given at 2, 4, and 6 months of age. The third schedule is for vaccine given at 6, 10, and 14 weeks of age. Once again, the vaccine schedule of doses given at 6, 10, and 14 weeks has seroconversion rates identical to schedules with longer intervals between doses. There are limited data supporting long-term protection for the schedules with shorter intervals, but existing data do support this approach."}, {"url": "http://wwwnc.cdc.gov/travel/yellowbook/2014/chapter-7-international-travel-infants-children/vaccine-recommendations-for-infants-and-children", "passage_text": "1 Hepatitis A vaccine: 2  Immune globulin (IG) for hepatitis A protection: 3  Hepatitis B vaccine: Vaccine can be administered with an accelerated schedule of 4 doses of vaccine given at 0, 1, 2, and 12 months; the last dose may be given on return from travel. Travel-specific vaccine considerations include the following: 1 "}, {"url": "http://www.cdc.gov/vaccines/pubs/pinkbook/downloads/appendices/A/age-interval-table.pdf", "passage_text": "Appendix A Vaccine and dose number Recommended age for this dose Minimum age for this dose Recommended interval to next dose Minimum interval to next dose Diphtheria-tetanus-acellular pertussis (DTaP) -1 5 2 months 6 weeks 8 weeks 4 weeks DTaP-2 4 months 10 weeks. 4 weeks. (. exception. : the minimum age for the first dose of MenHibrix is 6 weeks); the minimum interval between doses is equal to the greatest interval of any of. the individual components. 2 Information on travel vaccines including typhoid, Japanese encephalitis, and yellow fever, is available at. ."}, {"url": "http://www.cdc.gov/vaccines/hcp/vis/vis-statements/hep-a.pdf", "passage_text": "• Anyone 1 year of age or older who wants protection from hepatitis A.Hepatitis A vaccine is not licensed for children younger than 1 year of age. WHENFor children, the first dose should be given at 12 through 23 months of age. Children who are not vaccinated by 2 years of age can be vaccinated at later visits. For others at risk, the hepatitis A vaccine series may be started whenever a person wishes to be protected or is at risk of infection. For travelers, it is best to start the vaccine series at least one month before traveling"}, {"url": "http://www.medscape.com/viewarticle/484857", "passage_text": "The WHO recommends a minimum interval between dose 1 and 2 of 4 weeks, and a minimal interval between dose 2 and 3 of 4 weeks. Once again, the vaccine schedule of doses given at 6, 10, and 14 weeks has seroconversion rates identical to schedules with longer intervals between doses. There are limited data supporting long-term protection for the schedules with shorter intervals, but existing data do support this approach."}, {"url": "http://wwwnc.cdc.gov/travel/yellowbook/2014/chapter-7-international-travel-infants-children/vaccine-recommendations-for-infants-and-children", "passage_text": "1 Immune globulin (IG) for hepatitis A protection: 2  Hepatitis B vaccine: Vaccine can be administered with an accelerated schedule of 4 doses of vaccine given at 0, 1, 2, and 12 months; the last dose may be given on return from travel. Travel-specific vaccine considerations include the following: 1  Hepatitis A vaccine: 2  Immune globulin (IG) for hepatitis A protection: 3"}, {"url": "http://www.health.ny.gov/diseases/communicable/hepatitis/docs/policy_statement_on_twinrix_accelerated_dosing.pdf", "passage_text": "Twinrix was initially approved for a three-dose schedule similar to that of monovalent hepatitis B vaccine (0, 1, and 6 months). 2 In April 2007, the FDA approved an alternative four-dose schedule (0, 7, and 21-30 days, and 12 months). The first three doses of the accelerated Twinrix schedule provide equivalent protection to. the first dose in the standard monovalent hepatitis A vaccine series and the first two doses. in the standard monovalent hepatitis B vaccine series."}, {"url": "http://www.immunize.org/technically-speaking/20120301.asp", "passage_text": "Hepatitis B and infants In general, the hepatitis B vaccine schedule is flexible and can vary as long as ALL of the following minimum intervals are met: at least 4 weeks are needed between doses #1 and #2, at least 8 weeks between doses #2 and #3, and at least 16 weeks between doses #1 and #3. Shorter than the recommended interval, the minimum interval is the shortest time between two doses of a vaccine series in which an adequate immune response to the second dose can be expected. The concern is that a dose given too soon after the previous dose may reduce the response."}]