[{"url": "https://foodtolive.com/", "passage_text": "The food we eat sets the pattern for the life we live. At Food to Live, we’ve learned that good food equals good living, in terms of physical as well as mental health."}, {"url": "https://foodtolive.com/", "passage_text": "At Food to Live, we believe that food is more than a source of nutrition: it’s the key to your health. Every product that we offer reduces the chance of developing many dangerous diseases, such as diabetes, heart disease, cancer, digestive disorders, etc."}, {"url": "http://www.liveaquaria.com/product/aquarium-fish-supplies.cfm?c=3468+2190", "passage_text": "Live Foods. Live foods are great for getting hard-to-feed species such as seahorses, pipefish, wrasse, gobies, lionfish, grunts, and newly born sharks to begin feeding."}, {"url": "https://experiencelife.com/article/live-foods/", "passage_text": "Live foods experts say all these benefits stem from a simple synergy. Live foods naturally contain more nutrients (flavanoids, caratanoids), but they also contain the enzymes and other components that naturally enable our bodies to optimally process those nutrients."}, {"url": "http://freshaquarium.about.com/od/feedingfis1/a/feedinglivefoods.htm", "passage_text": "Brine Shrimp. One of the best live foods is Artemia, more commonly known as Brine Shrimp. If you've looked around for live brine shrimp you've probably discovered they are a bit pricey, or difficult to find at all. Don't give up. Most fish shops carry a good selection of frozen brine shrimp."}, {"url": "http://www.living-foods.com/faq.html", "passage_text": "Raw and Living Foods are foods that contain enzymes. In general, the act of heating food over 116 degrees F destroys enzymes in food. (Enzymes start to degrade in as little as 106 degrees F)."}, {"url": "http://www.livestrong.com/article/437607-eat-to-live-food-list/", "passage_text": "The Eat to Live food list contains all-vegetarian ingredients with a wide variety of vitamins and minerals. The idea is that including such a broad range of nutrients will give your body what it needs. In contrast, eating based on calories doesn't necessarily provide enough nutrients to stay healthy."}]