[{"url": "http://www.answers.com/Q/What_side_of_the_body_is_pancreas_located", "passage_text": "The pancreas is a small (5 to 6 inches) gland that produces insulin and enzymes used for digestion. Insulin regulates the use of blood sugar throughout the body and is therefo … re necessary for life. The pancreas also produces a fluid that neutralizes stomach acid. The pancreas is in the abdomen, behind the stomach. It is shaped a little like a tadpole and is approximately 25cm long. The pancreas is an organ of the digestive system and o … f the endocrine (hormonal) system. The pancreas adds its own digestive juices and enzymes to food in the duodenum, via a small duct."}, {"url": "https://answers.yahoo.com/question/index?qid=20100319101458AAKDvau", "passage_text": "Best Answer: On this site, you can see the location of the pancreas and the liver. It is down a little on the page. The liver right lobe is located under the rib cage and more to the far right of the body. The liver left lobe is connected to the right lobe and extends over where the stomach area is. The pancreas is located more to the back close to the spinal column and in the center of the body. http://www.merck.com/mmhe/sec01/ch001/ch... There is a kidney on either side of the spinal column in the back side of the body."}, {"url": "http://www.innerbody.com/image_endo03/dige09.html", "passage_text": "The body of the pancreas is the main area of the pancreas. It has a prismatic shape and there are three surfaces: the inferior, posterior and anterior surface. The anterior surface points up and forward. Its shape is a bit concave and it has the stomach's posteroinferior surface around it. "}, {"url": "http://www.webmd.com/digestive-disorders/picture-of-the-pancreas", "passage_text": "Front View of the Pancreas. The pancreas is about 6 inches long and sits across the back of the abdomen, behind the stomach. The head of the pancreas is on the right side of the abdomen and is connected to the duodenum (the first section of the small intestine) through a small tube called the pancreatic duct. The narrow end of the pancreas, called the tail, extends to the left side of the body. 1 Pancreatic cancer: The pancreas has many different types of cells, each of which can give rise to a different type of tumor. 2  The most common type arises from the cells that line the pancreatic duct. 3  Because there are usually few or no early symptoms, pancreatic cancer is often advanced by the time it’s discovered."}, {"url": "http://pancreas.ucla.edu/body.cfm?id=21", "passage_text": "The pancreas is divided into the head, body, and tail regions. The head of the pancreas is located on the right side of the abdomen, is the largest part of the organ, and is nestled in the duodenum. The duodenum is the first part of the small intestine and extends immediately from the stomach. The body of the pancreas extends across the spine and is in the midline of the abdomen. The tail of the pancreas is located on the left side of the abdomen and is adjacent to the spleen. The pancreas makes insulin as well as other hormones. These hormones enter the bloodstream and travel throughout the body. They help the body use or store the energy that comes from food"}, {"url": "http://pancreas.ucla.edu/body.cfm?id=21", "passage_text": "Illustration: the pancreas, common bile duct, and small intestine. The pancreas is a gland that is located deep in the abdomen between the stomach and the spine. The pancreas is about 6 inches long and extends from the right to the left side of the abdomen. The body of the pancreas extends across the spine and is in the midline of the abdomen. The tail of the pancreas is located on the left side of the abdomen and is adjacent to the spleen. The pancreas makes insulin as well as other hormones. These hormones enter the bloodstream and travel throughout the body."}, {"url": "http://pathology.jhu.edu/pancreas/BasicOverview2.php?area=ba", "passage_text": "The tail is the thin tip of the pancreas in the left side of the abdomen, in close proximity with the spleen. Using the hand analogy, the tail corresponds to the tips of your 2nd, 3rd and 4th fingers. The head is the widest part of the pancreas. The head of the pancreas is found in the right side of abdomen, nestled in the curve of the duodenum. Using the hand analogy from earlier, the head of the pancreas corresponds to the palm of your hand. uncinate process."}, {"url": "http://www.answers.com/Q/Pancreas_is_on_what_side_of_body", "passage_text": "The pancreas is a small (5 to 6 inches) gland that produces insulin and enzymes used for digestion. Insulin regulates the use of blood sugar throughout the body and is therefo … re necessary for life. The pancreas also produces a fluid that neutralizes stomach acid. The pancreas is in the abdomen, behind the stomach. It is shaped a little like a tadpole and is approximately 25cm long. The pancreas is an organ of the digestive system and o … f the endocrine (hormonal) system. The pancreas adds its own digestive juices and enzymes to food in the duodenum, via a small duct."}, {"url": "https://answers.yahoo.com/question/index?qid=20100319101458AAKDvau", "passage_text": "Right side, near the pubic bone is the Appendix. The liver and pancreas are nowhere near that location. The pancreas is below your left breast and the liver is mostly below your right breast with some of it towards your left. They are both near the lower edge of the rib cage. The pancreas is located more to the back close to the spinal column and in the center of the body. http://www.merck.com/mmhe/sec01/ch001/ch... There is a kidney on either side of the spinal column in the back side"}]