[{"url": "http://ers.usda.gov/publications/eib-economic-information-bulletin/eib14.aspx", "passage_text": "Major Uses of Land in the United States, 2002. Economic Information Bulletin No. (EIB-14) 54 pp, May 2006. This publication presents the results of the latest (2002) inventory of U.S. major land uses, drawing on data from the Census, public land management and conservation agencies, and other sources."}, {"url": "http://ers.usda.gov/publications/eib-economic-information-bulletin/eib14.aspx", "passage_text": "The data are synthesized by State to calculate the use of several broad classes and subclasses of agricultural and nonagricultural land over time. The United States has a total land area of nearly 2.3 billion acres. Economic Information Bulletin No. (EIB-14) 54 pp, May 2006. This publication presents the results of the latest (2002) inventory of U.S. major land uses, drawing on data from the Census, public land management and conservation agencies, and other sources."}, {"url": "http://www.rainforestfoundation.org/commonly-asked-questions-and-facts/", "passage_text": "1 The current rate of destruction is about 1 acre each second, which is a bit less than a US football field. 2  Expanded, that amounts to 60 acres/min, 3,600/hour, 86,400/day, 2.6 million/month, and 31.5 million acres per year. 3  The natural extinction rate is approximately 1 species per year. Did you know? 1 "}, {"url": "https://en.wikipedia.org/wiki/Occupation_of_Japan", "passage_text": "The Allied occupation of Japan at the end of World War II was led by Douglas MacArthur, the Supreme Commander for the Allied Powers, with support from the British Commonwealth. Unlike the occupation of Germany, the Soviet Union was allowed little to no influence over Japan. The occupation, codenamed Operation Blacklist, was ended by the San Francisco Peace Treaty, signed on September 8, 1951 and effective from April 28, 1952, after which Japan's independence – with the exception, until 1972, of the Ryukyu Islands – was restored."}, {"url": "https://www.westernwatersheds.org/watmess/watmess_2002/2002html_summer/article6.htm", "passage_text": "Cropland-About 349 million acres in the U.S. are planted for crops. This is the equivalent of about four states the size of Montana. Four crops -- feeder corn (80 million acres), soybeans (75 million acres), alfalfa hay (61 million acres) and wheat (62 million acres) -- make up 80 percent of total crop acreage. (To order, call 1-800-9996779). The numbers do not change appreciably from year to year. Overview of Land Use in the United States-The U.S. has 2.3 billion acres of land. However, 375 million acres are in Alaska and not suitable for agricultural production. The land area of the lower 48 states is approximately 1.9 billion acres. To put things in perspective, keep in mind that California is 103 million acres, Montana 94 million acres, Oregon 60 million acres and Maine 20 million acres"}, {"url": "http://www.globalresearch.ca/the-worldwide-network-of-us-military-bases/5564", "passage_text": "Adding to the bases inside U.S. territory, the total land area occupied by US military bases domestically within the US and internationally is of the order of 2,202,735 hectares, which makes the Pentagon one of the largest landowners worldwide (Gelman, J., 2007). According to Fig 1, the 396 billion dollars military budget proposed in 2003 has in fact reached 417.4 billion dollars, a 73% increase compared to 2000 (289 billion dollars). This outlay for 2003 was more than half of the total of the US discretionary budget."}, {"url": "http://www.agcensus.usda.gov/Publications/2012/Preliminary_Report/Highlights.pdf", "passage_text": "1).• Between 2007 and 2012, the amount of land in farms in the United States declined from 922 million acres to 915 million acres. This decline of less than one percent was the third smallest decline between Censuses since 1950.• In 2012, the average farm size was 434 acres. This was an increase of more than $52,000 (or 39 percent) over 2007.• From 2007 to 2012, the percent of farms with sales and government payments of $1 million or more increased, but most farms in the United States are small – 75 percent had sales of less than $50,000 in 2012."}, {"url": "http://sharplogger.vt.edu/virginiasfi/faq.html", "passage_text": "Because the United States practices reforestation, its forests have actually grown in size over the past century. About one-third of the United States -- 747 million acres -- is covered with trees. In fact, we have more trees today than we had 70 years ago. And some 4 million more are planted each day. "}]