[{"url": "https://en.wikipedia.org/wiki/Lego_Trains", "passage_text": "A push train could be updated to a battery-operated train, and a battery-operated train could be updated to an electric train. Since 1969 the motor housings for 4.5-volt and 12-volt are equal and can be equipped with either a 4.5-volt or 12-volt Buehler bühler motor. unit All three kinds (push trains, 4.5-volt battery-operated trains and 12-volt electric trains) existed next to each other and even allowed for upgrade. The motors were the same size, the push trains used a motor-shaped dummy block of bricks, and all used the same wheel style."}, {"url": "https://en.wikipedia.org/wiki/Lego_Trains", "passage_text": "Set number 115 introduced 4.5 volt battery-operated trains (initially the battery box was handheld, but train sets soon contained a railcar that carried the battery box), and train sets numbered 720 (1969) and up operated on 12-volt electrified rails, introduced in 1969. All three kinds (push trains, 4.5-volt battery-operated trains and 12-volt electric trains) existed next to each other and even allowed for upgrade. The motors were the same size, the push trains used a motor-shaped dummy block of bricks, and all used the same wheel style."}, {"url": "http://newbright.com/support/battery-powered-train-faq/", "passage_text": "Q: My animated train car does not work for my battery-operated train. A: If the animation does not work on your train set, turn the train car upside down and make sure that the wheels of your train car are making contact with the gears underneath the train car. If your engine still does not have power, check to make sure that the plug that goes from the tender to the engine is fully seated. Finally, make sure that the battery contacts in the tender car are clean of any debris or corrosion."}, {"url": "http://www.trainelectronics.com/Meter_Workshop/", "passage_text": "You can perform a better test with 1.5 volt and 9 volt batteries. Do not use this method with other types of batteries! Move the meter's selector to the battery test position in the upper right between ACV and DCA. Again touch the red probe to the positive terminal and the black to the negative. The display should show about 9 volts depending on the condition of the battery. Repeat the test with a 1.5 volt AA battery. If you inadvertently connect the probes to the incorrect terminals the display will show a negative voltage. This will not damage the meter. Note: Measuring battery voltage in this way does not really perform a very good test as the batteries are not under load"}, {"url": "http://www.wikihow.com/%22Train%22-a-Cellphone-or-Laptop-Battery", "passage_text": "1. Make sure the battery is completely exhausted. Let your electronic device turn off by itself once the battery is dead. It is important to start the process from this position because what you are really doing here is calibrating your device to know how much juice is in the battery. 2. Plug your device in and let it charge until it signifies you have charged it completely. Four bars on a cell phone, full battery on a laptop, whatever it may say, it is probably wrong-and you should be able to tell because the device will not hold a charge for as long as you would like."}, {"url": "https://en.wikipedia.org/wiki/Electric_locomotive", "passage_text": "An electric locomotive is a locomotive powered by electricity from overhead lines, a third rail or on-board energy storage such as a battery or fuel cell. It operates a fleet of electric locomotives to transport coal for export, the most recent of which the 3,000 kW (4,020 HP) 3300/3400 Class. Queensland Rail is currently rebuilding its 3100 and 3200 class locos into the 3700 class, which use AC traction and need only three locomotives on a coal train rather than five."}, {"url": "https://en.wikipedia.org/wiki/Electric_locomotive", "passage_text": "Another use for battery locomotives is in industrial facilities where a combustion-powered locomotive (i.e., steam-or diesel-powered) could cause a safety issue, due to the risks of fire, explosion or fumes in a confined space. It operates a fleet of electric locomotives to transport coal for export, the most recent of which the 3,000 kW (4,020 HP) 3300/3400 Class. Queensland Rail is currently rebuilding its 3100 and 3200 class locos into the 3700 class, which use AC traction and need only three locomotives on a coal train rather than five."}, {"url": "http://www.ucsusa.org/clean-vehicles/electric-vehicles/how-do-battery-electric-cars-work", "passage_text": "Battery electric vehicles, or BEVs, use electricity stored in a battery pack to power an electric motor and turn the wheels. When depleted, the batteries are recharged using grid electricity, either from a wall socket or a dedicated charging unit. "}, {"url": "http://www.learn.eversmoke.com/extend-e-cig-battery-life.html", "passage_text": "You can compare your e-cig battery to a train it s much easier for a slow-moving train to speed up than for a stationary train to start moving in the first place. Likewise, it s much easier for a battery with some life left in it to be recharged than it is for one that s completely dead. "}]