[{"url": "http://homeguides.sfgate.com/install-travertine-tile-23484.html", "passage_text": "Travertine tiles are one of the many stone tiling options available in today’s market. Whether you opt to install travertine wall tiles or install the tiles on the floor, the installation process is similar. In both instances, you need to plan how you want to lay out the tiles to feature the natural veins and texture of the travertine stone."}, {"url": "http://www.travertinemart.com/buyers-guide/what-is-travertine", "passage_text": "Many people come across the term “travertine” while looking at tile and paver options for their next home improvement project. If you’ve seen the term but weren’t exactly sure what travertine is, you’ve come to the right place! Travertine has a long, rich history as a building material, and was used centuries ago in Ancient Rome. Many famous structures, including the Colosseum in Rome and Ephesus in Turkey, were made using travertine stone – a testament to travertine’s long-lasting abilities."}, {"url": "http://www.improvenet.com/r/costs-and-prices/travertine-flooring", "passage_text": "For kitchens, a travertine countertop or floor is often sealed, so that it can be used in heavy traffic and heavy use areas. A layer of sealant will prolong the life of the stone and make it more resistant to scratching and staining. Travertine is commonly be seen in bathrooms. One of the most important aspects of planning a home remodeling project or embarking on a new construction plan is the type of flooring that will be used. Homeowners are looking for quality products at good prices. When it comes to selecting tile flooring, travertine is a popular choice among homeowners."}, {"url": "http://what-is-travertine.com/", "passage_text": "Travertine is a natural stone such as Marble, Granite, Onyx, Limestone, Slate etc. The key difference between Travertine and other natural stones lies in the formation of the rock, the hardness of the stone and the appearance. Travertine is formed in hot springs and/or limestone caves. Travertine is not the same as Marble or Limestone which falls in the metamorphic rock category. Key characteristics of Travertine stone are the holes within the stone which are caused by carbon dioxide evasion. Travertine Tiles are used for indoor projects such as floors and walls while Travertine pavers are primarily used for outdoors such as driveways, pool decks, patio areas and walk ways. Travertine tiles are 0.5'' thick while the standard thickness for Travertine pavers is 1 1/4''."}, {"url": "http://www.improvenet.com/r/costs-and-prices/travertine-flooring", "passage_text": "Travertine is a versatile stone that can be used side by side other natural stones such as slate, brick, marble and granite. It is often bought in large slabs and this is a great way to save money, especially if the homeowner is looking to cover a large square foot of space. One of the most important aspects of planning a home remodeling project or embarking on a new construction plan is the type of flooring that will be used. Homeowners are looking for quality products at good prices. When it comes to selecting tile flooring, travertine is a popular choice among homeowners."}, {"url": "https://en.wikipedia.org/wiki/Travertine", "passage_text": "Travertine is a form of limestone deposited by mineral springs, especially hot springs. It is frequently used in Italy and elsewhere as a building material. Travertine is a terrestrial sedimentary rock, formed by the precipitation of carbonate minerals from solution in ground and surface waters, and/or geothermally heated hot-springs."}, {"url": "http://homerenovations.about.com/od/floors/ss/TravertineFloor.htm", "passage_text": "Travertine floor is serious stuff; it's not something you install lightly. Whereas you might install vinyl, laminate, or even engineered flooring with an eye toward eventual reinstallation, travertine flooring goes on and stays on. If travertine was good enough for the Romans, it's good enough for you. 1 Porous: Travertine flooring is porous, meaning that unsealed and unpolished travertine in the kitchen may not be the best idea. 2  Traction: Unpolished travertine has excellent traction. 3  Yet as mentioned above, it's porous, can trap dirt, and be difficult to clean."}, {"url": "https://en.wikipedia.org/wiki/Travertine", "passage_text": "Travertine forms from geothermal springs and is often linked to siliceous systems that form siliceous sinter. Macrophytes, bryophytes, algae, cyanobacteria, and other organisms often colonise the surface of travertine and are preserved, giving travertine its distinctive porosity. It is frequently used in Italy and elsewhere as a building material. Travertine is a terrestrial sedimentary rock, formed by the precipitation of carbonate minerals from solution in ground and surface waters, and/or geothermally heated hot-springs."}, {"url": "http://www.travertineuk.com/index.php/what-is-travertine", "passage_text": "Travertine is a versatile, natural, durable stone and can be used for wall tiles or floor tiles. It will look amazing in bathrooms, kitchens, conservatories and wet rooms and is a popular choice for worktops, wall tiles and floor tiles. The unique shading and appearance of each tile creates a natural charm and appeal. Travertine is available in a variety of colours and finishes, the colour of the stone is dictated by the iron content and impurities of the stone."}]