[{"url": "http://www.astrology.com/article/zodiac-signs-capricorn-sun-sign.html", "passage_text": "Capricorn, the tenth sign of the zodiac, is all about hard work. Those born under this sign are more than happy to put in a full day at the office, realizing that it will likely take a lot of those days to get to the top. "}, {"url": "http://www.capricornzodiacsign.net/capricornsymbol.htm", "passage_text": "Its Origin and Meaning in Astrology. The above image is the established symbol (also called glyph) for the Zodiac sign Capricorn, the Goat. It's a simplified drawing of a sea-goat, the mythological animal-half goat, half fish-originally associated with the sign. The horned head is implied to the left, and the curved fish tail to the right. Both the Zodiac sign and its symbol have been along for ages. Already the Babylonians connected this Zodiac sign and the constellation with the mythological animal, sort of a mermaid goat. They called it the Goat-Fish."}, {"url": "http://www.compatible-astrology.com/capricorn-symbol.html", "passage_text": "The Capricorn symbol (also called Capricorn glyph) is a shorthand representation of the Capricorn zodiac animal (see below). However, as with the animal itself, much is based both in interpretation and the preference of the writer, and can range from simple to extravagant. Due to this although Capricorn will always be represented by a (sea)goat, there isn't any one 'correct' shape or design for that goat. It's a cosmic game of join the dots, and some constellations even have alternative ways to form the animal from the dots (stars)."}, {"url": "http://www.astrology-online.com/capricrn.htm", "passage_text": "Some more interesting facts about your sign: The animal associated with your sign is this beautiful Goat, it is a surefooted animal that weighs in at an average of 150-300 pounds and reaching heights of 35-45 inches. Due to its hooves, with cushioned skid-proof pads for grip, the goat is very agile. This animal has a narrow head with slender, black horns that rise in a backward curve to a length of 10-12 inches. The coat is white and on the chin is a double beard of long hair. The color of choice for Capricorn isBROWN and most dark colors BLACK ONYX The beautiful Onyx is your starstone. The sign Capricorn is one of the most stable and (mostly) serious of the zodiacal types. These independent, rocklike characters have many sterling qualities. They are normally confident, strong willed and calm. These hardworking, unemotional, shrewd, practical, responsible, persevering, and."}, {"url": "http://www.astrology.com/love/compatibility/capricorn-capricorn.html", "passage_text": "The symbol of Capricorn is the Sea Goat, the animal always on an upward climb from the sea to the mountain summit. This is true of the Capricorn couple who magnifies their energy and strength and climb the staircase to a healthy, mutually beneficial relationship. "}, {"url": "http://astrology.com.au/astrology/zodiac-signs/capricorn", "passage_text": "Capricorn Profile. Capricorn is the cardinal earth sign of the zodiac. It can be likened to the oldest and most valuable tree in the forest. You are sure-footed and thoroughly practical and in the end the Capricorn goat always reaches the heights, beating others who are faster but less determined. "}, {"url": "https://answers.yahoo.com/question/index?qid=20080211063736AAhcwab", "passage_text": "· just now. Report Abuse. It is the Goat, but sometimes Capricorn is either considered a plain old Goat or the Sea Goat. Capricorn is often characterized physically, to have the frontal body of the Goat but the tail fin of a large Fish. It depends really. No, Sagittarius is the horse, actually a Centaur but Capricorn is definitely not a horse."}, {"url": "https://en.wikipedia.org/wiki/Capricorn_(astrology)", "passage_text": "Capricorn (♑)(/kaep.kæp.rɪ/) kɔːn is the tenth astrological sign in the, Zodiac Pining umali originating from the constellation Of. Capricornus it spans the–270 300th degree of the, zodiac corresponding to celestial. Longitude capricorn is ruled by the Planet. saturn In astrology, Capricorn is considered an earth sign, introvert sign, a power sign and one of the four cardinal signs. It is also tagged as the most ambitious starsign."}, {"url": "https://en.wikipedia.org/wiki/Capricorn_(astrology)", "passage_text": "Capricorn (♑)(/kaep.kæp.rɪ/) kɔːn is the tenth astrological sign in the, Zodiac Pining umali originating from the constellation Of. capricornus In astrology, Capricorn is considered an earth sign, introvert sign, a power sign and one of the four cardinal signs. It is also tagged as the most ambitious starsign."}]