[{"url": "http://www.ehow.com/info_8671818_much-mattress-salesman-make-year.html", "passage_text": "Mattress Salesmen. Both Simply Hired and Indeed also published salary information in 2011 that is specific to sales personnel with a direct focus on mattress sales. At the time of publication, Simply Hired estimates that the average annual salary for mattress salesmen is near $47,000. Salespersons with extensive knowledge of mattresses, expansive sales and retail management experience and who have great leadership skills can often find careers as mattress showroom managers. According to Indeed and Simply Hired, mattress showroom managers can earn anywhere from $38,000 to $45,000 per year in 2011. Such salaries begin near -- and extend beyond -- the BLS earnings projections for the 90th percentile of retail salespersons positions in May of 2008"}, {"url": "http://www1.salary.com/Warehouse-Worker-salary.html", "passage_text": "For example the median expected annual pay for a typical Warehouse Worker in the United States is $27,598 so 50% of the people who perform the job of Warehouse Worker in the United States are expected to make less than $27,598. Our team of Certified Compensation Professionals has analyzed survey data collected from thousands of HR departments at companies of all sizes and industries to present this range of annual salaries for people with the job title Warehouse Worker in the United States."}, {"url": "http://boulter.com/blog/2008/08/20/the-mattress-industry-is-one-big-scam/", "passage_text": "I think a 10 year warranty is a little long for something you (and your wife perhaps) sleep on some 10 hours a day. I wouldn’t expect to pay more than 500 to 700 dollars for a mattress, I can’t remember what I paid last time. As far as pillow tops go, they are the same thing as the plush mattress in there line. A $500 pillow top and a $1200 pillow top will not be even close to the same thing. A pillow top takes a little more labor to make and has additional fabric around the border and an additional tape edge."}, {"url": "http://www.ehow.com/info_8671818_much-mattress-salesman-make-year.html", "passage_text": "Broad Statistics. Mattress salesmen can be classified as retail salespersons by the U.S. Bureau of Labor Statistics (BLS). According to the BLS, the median average salary for general retail sales workers was $20,670 per year in May of 2008 and about $28,300 for those employed by home furnishing stores. Salespersons with extensive knowledge of mattresses, expansive sales and retail management experience and who have great leadership skills can often find careers as mattress showroom managers. According to Indeed and Simply Hired, mattress showroom managers can earn anywhere from $38,000 to $45,000 per year in 2011. Such salaries begin near -- and extend beyond -- the BLS earnings projections for the 90th percentile of retail salespersons positions in May of 2008"}, {"url": "http://www.indeed.com/cmp/Mattress-Warehouse", "passage_text": "Delivery Driver, Frederick, MD-July 24, 2015. sales reps at their stores where always helpful and respectful to you as a driver. Management in warehouse would switch your route for no reason-n- messes all the route drivers to stores up. "}, {"url": "http://boulter.com/blog/2008/08/20/the-mattress-industry-is-one-big-scam/", "passage_text": "You could have a 25 year warranty on the bed and it wears out in 8, that’s not a warranty issue that is normal wear and tear. In NC a lifetime warranty on a mattress means the mattress has a 7 year warranty, which is what the state considers the life of a mattress. As far as pillow tops go, they are the same thing as the plush mattress in there line. A $500 pillow top and a $1200 pillow top will not be even close to the same thing. A pillow top takes a little more labor to make and has additional fabric around the border and an additional tape edge."}, {"url": "http://www.simplyhired.com/salaries-k-warehouse-manager-jobs.html", "passage_text": "The average salary for warehouse manager jobs is $59,000. Average warehouse manager salaries can vary greatly due to company, location, industry, experience and benefits. This salary was calculated using the average salary for all jobs with the term warehouse manager anywhere in the job listing."}, {"url": "http://www1.salary.com/Warehouse-Manager-salary.html", "passage_text": "For example the median expected annual pay for a typical Warehouse Manager in the United States is $75,751, so 50% of the people who perform the job of Warehouse Manager in the United States are expected to make less than $75,751. Source: HR Reported data as of October 2015. 1  Salary. 2  Salary + Bonus. 3  Benefits. "}, {"url": "http://www1.salary.com/Warehouse-Worker-salary.html", "passage_text": "The annual salary for someone with the job title Warehouse Worker may vary depending on a number of factors including industry, company size, location, years of experience and level of education. Our team of Certified Compensation Professionals has analyzed survey data collected from thousands of HR departments at companies of all sizes and industries to present this range of annual salaries for people with the job title Warehouse Worker in the United States."}]