[{"url": "http://coinmill.com/BOB_calculator.html", "passage_text": "To show Bolivian Bolivianos and just one other currency click on any other currency. The Bolivian Boliviano is the currency in Bolivia (BO, BOL). The symbol for BOB can be written Bs. The Bolivian Boliviano is divided into 100 centavos. The exchange rate for the Bolivian Boliviano was last updated on October 14, 2015 from Bloomberg. The BOB conversion factor has 4 significant digits."}, {"url": "http://coinmill.com/BOB_USD.html", "passage_text": "The United States Dollar is also known as the American Dollar, and the US Dollar. The symbol for BOB can be written Bs. The symbol for USD can be written $. The Bolivian Boliviano is divided into 100 centavos. The United States Dollar is divided into 100 cents. The exchange rate for the Bolivian Boliviano was last updated on October 14, 2015 from Bloomberg. This Bolivian Boliviano and United States Dollar convertor is up to date with exchange rates from October 14, 2015. Enter the amount to be converted in the box to the left of Bolivian Boliviano. Use Swap currencies to make United States Dollar the default currency"}, {"url": "http://www.answers.com/Q/How_much_is_5.000.000_de_pesos_bolivianos_worth_in_us_dollars", "passage_text": "This is Bolivian money tho most people think it is Mexican because that is the most common peso. Anyway Bolivia went through a currency change in 1985 they now have a new form … of money and your 10000 mil pesos Bolivianos is worth about 10 of there new money. 1 of there new version of money is 14 American cents so it would be worth about a dollar and forty cents. 5 people found this useful."}, {"url": "https://en.wikipedia.org/wiki/Bolivian_peso", "passage_text": "But inflation soon returned and the peso boliviano was devalued 39.4% on October 27, 1972, with a new official rate of 20·00 per US$1. This rate was maintained until November 30, 1979, when the peso boliviano was put on a controlled float, initially at 25·00 per dollar. The peso boliviano (ISO 4217 code: BOB), divided into 100 centavos, was the currency of Bolivia from January 1, 1963 until December 31, 1985. It was replaced by the boliviano at 1,000,000 pesos bolivianos = 1 boliviano  $b.  was the currency symbol for the peso boliviano"}, {"url": "https://en.wikipedia.org/wiki/Bolivian_peso", "passage_text": "The currency reform of January 1, 1963 adopted the peso boliviano, equal to 1,000 bolivianos, with an initial central exchange rate of 11·875 per US$1. The peso boliviano (ISO 4217 code: BOB), divided into 100 centavos, was the currency of Bolivia from January 1, 1963 until December 31, 1985. It was replaced by the boliviano at 1,000,000 pesos bolivianos = 1 boliviano  $b.  was the currency symbol for the peso boliviano"}, {"url": "http://www.answers.com/Q/How_much_is_100000_cien_mil_pesos_bolivianos_worth_in_US_dollars", "passage_text": "This is Bolivian money tho most people think it is Mexican because that is the most common peso. Anyway Bolivia went through a currency change in 1985 they now have a new form … of money and your 10000 mil pesos Bolivianos is worth about 10 of there new money. How much is a 2000 peso note worth in US dollars? If it is a current issue Mexican note, then it's worth $157. An old pre-1989 2000 Peso note is worth 60¢ - $4 in perfect condition to a collector."}, {"url": "https://en.wikipedia.org/wiki/Bolivian_peso", "passage_text": "By September 1985 the US dollar was worth a million pesos bolivianos on the black market. President Paz-Estenssoro announced a free exchange rate for the peso, which was floated on August 29, 1985, resulting in an effective devaluation of 95%. The peso boliviano (ISO 4217 code: BOB), divided into 100 centavos, was the currency of Bolivia from January 1, 1963 until December 31, 1985. It was replaced by the boliviano at 1,000,000 pesos bolivianos = 1 boliviano  $b.  was the currency symbol for the peso boliviano"}, {"url": "http://coinmill.com/BOB_calculator.html", "passage_text": "Bolivian Boliviano (BOB) Currency Exchange Rate Conversion Calculator. This currency convertor is up to date with exchange rates from October 14, 2015. Enter the amount to be converted in the box to the left of the currency and press the convert button. The Bolivian Boliviano is the currency in Bolivia (BO, BOL). The symbol for BOB can be written Bs. The Bolivian Boliviano is divided into 100 centavos. The exchange rate for the Bolivian Boliviano was last updated on October 14, 2015 from Bloomberg. The BOB conversion factor has 4 significant digits."}]