[{"url": "http://cold.emedtv.com/common-cold/common-cold-contagious-period.html", "passage_text": "Second, this contagious period can last until the person no longer shows any symptoms. So in theory, a person is contagious for about two weeks. (Click Cold Symptoms to read about the symptoms of the common cold or Cold and Flu Symptoms to learn the difference between a cold and the flu.). Let's assume you're the one with the cold. During the two-week period when you're contagious, research indicates that you'll be most likely to transmit the cold virus when you're experiencing cold symptoms. The period when you're most contagious is when your symptoms are at their worst -- day 2 to day 4 of the cold."}, {"url": "http://cold.emedtv.com/common-cold/common-cold-contagious-period.html", "passage_text": "First, scientists involved with common cold research do not know exactly how long a person with a cold is contagious. Based on previous studies, their best guess is that a person becomes contagious about two to three days before developing the usual symptoms of a cold."}, {"url": "http://www.healthline.com/health/cold-flu/contagious", "passage_text": "The flu is contagious a day before and five days to a week after its onset. Young children, people over 65, those with compromised immune systems, and people with a terminal illness are at risk of death from the flu. Pregnant women are also at greater risk. The flu can also cause premature birth."}, {"url": "http://health.howstuffworks.com/diseases-conditions/cold-flu/contagious.htm", "passage_text": "Most experts agree that adults with a cold or the flu start being contagious about a day before they start experiencing symptoms. For the flu, the contagious period then lasts five to seven days into the illness. For children, the contagious period for the flu can last up to two weeks after they start feeling sick, even if they start feeling better before that. The contagious period for a cold lasts about three to four days into the illness. As a general rule, people with a cold are most contagious about three days after their initial exposure to the virus. For more information on colds, influenza and related topics, check out the links on the next page. Print."}]