[{"url": "http://www.leadstrat.com/", "passage_text": "A facilitated session is a highly-structured meeting in which the meeting leader (the facilitator) guides the participants through a series of pre-defined steps to arrive at a result that is created, understood and accepted by all participants."}, {"url": "http://www.tellusconsultants.com/facilitator.html", "passage_text": "That is what a facilitator is, someone who is skilled at helping everyone in a group express their leadership qualities. They help things go smoothly without imposing their own ideas upon everyone else."}, {"url": "https://www.mindtools.com/pages/article/RoleofAFacilitator.htm", "passage_text": "The definition of facilitate is to make easy or ease a process.. What a facilitator does is plan, guide and manage a group event to ensure that the group's objectives are met effectively, with clear thinking, good participation and full buy-in from everyone who is involved."}, {"url": "http://www.merriam-webster.com/dictionary/facilitation", "passage_text": ": the act of facilitating: the state of being facilitated. 2. a: the lowering of the threshold for reflex conduction along a particular neural pathway especially from repeated use of that pathway b: the increasing of the ease or intensity of a response by repeated stimulation. ADVERTISEMENT."}, {"url": "http://www.definitions.net/definition/Facilitator", "passage_text": "Facilitator. A facilitator is someone who helps a group of people understand their common objectives and assists them to plan to achieve them without taking a particular position in the discussion."}, {"url": "https://en.wikipedia.org/wiki/Facilitator", "passage_text": "A facilitator is someone who engages in the activity of facilitation. They help a group of people understand their common objectives and assists them to plan how to achieve these objectives; in doing so, the facilitator remains neutral meaning he/she does not take a particular position in the discussion."}, {"url": "http://www.tellusconsultants.com/facilitator.html", "passage_text": "Leadership is something you do to a group; Facilitation is something you do with a group. Honesty. Facilitators express feelings, values, concerns and priorities when working with a group. The open honesty of the facilitator about abilities and knowledge will help elicit honesty from all participants."}]