[{"url": "http://www.fluther.com/36395/is-selling-on-etsy-worth-it/", "passage_text": "It doesn’t take a lot of time to set an item up and it’s very easy. Your success at selling items really depends on how much you get your name out there and get people seeing your work, participating in forums and communities with your Etsy link can help with this. dynamicduo (14290) “Great Answer” (3) Flag as… ¶. I have a good friend who has an Etsy store, augustlan. Personally, I will not use an Etsy store to sell my wares. As I am a web designer, I have set up a beautiful store that’s exactly the way I want it (I find Etsy’s design to be too narrow). I will also keep the amount of money Etsy would have taken."}, {"url": "http://melodys-makings.com/is-selling-on-etsy-really-worth-the-fees/", "passage_text": "Thanks Savanna! Yes – compared to other shop possibilities, I feel that Etsy is definitely worth the fee. That doesn’t mean, however, that Etsy is easier to sell on….still takes a lot of work! It sounds like you’re on the right track. If you do decide to sell on Etsy, then make sure you check out all of the great resources that they’ve included to help you learn about selling successfully. They have all sorts of awesome features from The Seller Handbook to the Etsy Success Newsletter."}, {"url": "http://www.sixfiguresunder.com/can-i-make-money-on-etsy/", "passage_text": "It takes some work to sell on Etsy, but it can be worth it. It’s also helpful to realize that it’s not the only way to sell your items. I’m currently working on a custom order for someone at church. I look forward to the rest of this series. 1 Another thing Etsy really has going for it is trust. 2  You can read reviews on the products and services of a specific seller. 3  When I buy from a random website I am always afraid it might be some fly-by-night operation that has no reason not to just take my money and run. 4  Etsy’s site is easy-to-use and streamlined."}, {"url": "http://www.handmadeology.com/10-real-tips-for-successfully-selling-on-etsy/", "passage_text": "One of the best things you can do to help become successful selling on Etsy is to study the most successful sellers and see what they are doing. Here are the top 10 Etsy sellers with the most sales as of September 2015 (data from Craftcount). I remember when I listed my very first item on Etsy…I was clueless about pricing. There are many factors that come into play when pricing your items, so knowing your product is crucial. You need to know how much it costs to make your item, how much time you spend making it, and how much it costs to ship."}, {"url": "http://www.fluther.com/36395/is-selling-on-etsy-worth-it/", "passage_text": "I have purchased many things from Etsy stores, I have not sold things myself but I am planning on getting into the crafting market soon. It is worth it if you are an artist who doesn’t have the time or skills (or desire) to create and market your own website. Personally, I will not use an Etsy store to sell my wares. As I am a web designer, I have set up a beautiful store that’s exactly the way I want it (I find Etsy’s design to be too narrow). I will also keep the amount of money Etsy would have taken."}, {"url": "https://www.etsy.com/teams/7722/discussions/discuss/8867532/", "passage_text": "Etsy can be helpful to keep you motivated even if you don't make enough sales. It will get you started and give you confidence to venture out in the world. But consider etsy like a 1/10 of your income footprint if you want to work for yourself as a maker. You have to sell at brick and mortar venues too. I like having an Etsy shop so i can show people what i have but i make the real money on my own two feet selling to shops. My Etsy sales have tanked since relevance was introduced. digitaldoodlebug 6:51 pm Aug 22, 2011 EDT. i think most are still reeling from relevancy. you'll get out of it what you put into it."}, {"url": "http://melodys-makings.com/is-selling-on-etsy-really-worth-the-fees/", "passage_text": "I’ve been asked countless times if I think that selling on Etsy is worth the 3% fee that they charge….My answer is, and always will be, YES! YES in huge capital letters. YES shouted from a rooftop! That’s how strongly I feel that Etsy is worth the fees. If you do decide to sell on Etsy, then make sure you check out all of the great resources that they’ve included to help you learn about selling successfully. They have all sorts of awesome features from The Seller Handbook to the Etsy Success Newsletter."}, {"url": "http://www.indiemade.com/blog/etsy-worth-it-whats-right-your-store-online", "passage_text": "According to Etsy.com, the site has 25 million users and receives a whopping 1.5 billion page views each month. Today, it isn't quite as easy to put up a shingle on Etsy and expect to sell items from the start. Realistically speaking, there are 60 thumbnail positions on the first page of any search results page on Etsy, out of 18,000,000 active listings. The Golden Years of Selling Art on Etsy. Etsy delivered a business-making marketplace when the site launched in 2005. Never before had thousands of independent artists enjoyed the kind of exposure Etsy provided. As a consumer of handmade items, I had discovered handmade heaven. Etsy had me at hello"}, {"url": "https://www.etsy.com/teams/7722/discussions/discuss/8867532/", "passage_text": "I personally love it but I don't rely on it as my full-time income (I have an off-Etsy design business that pays the bills). For me, it's definitely worth it but you'll need to think over things for yourself and make your own call. I like having an Etsy shop so i can show people what i have but i make the real money on my own two feet selling to shops. My Etsy sales have tanked since relevance was introduced. digitaldoodlebug 6:51 pm Aug 22, 2011 EDT. i think most are still reeling from relevancy. you'll get out of it what you put into it."}]