[{"url": "http://www.webmd.com/lung/copd/tc/alpha-1-antitrypsin-deficiency-genetic-testing-what-is-alpha1-antitrypsin-deficiency", "passage_text": "Alpha-1 antitrypsin (AAT) is a protein normally found in the lungs and the bloodstream. It helps protect the lungs from diseases such as emphysema and chronic obstructive pulmonary disease (COPD) . Alpha-1 antitrypsin deficiency is caused by a change, or mutation, in the gene that tells the body how to make alpha-1 antitrypsin. There are many kinds of possible changes in this gene, but only a few cause problems. To have this condition, you have to get the changed gene from both parents."}, {"url": "http://ghr.nlm.nih.gov/condition/alpha-1-antitrypsin-deficiency", "passage_text": "Mutations in the SERPINA1 gene can lead to a shortage (deficiency) of alpha-1 antitrypsin or an abnormal form of the protein that cannot control neutrophil elastase. Without enough functional alpha-1 antitrypsin, neutrophil elastase destroys alveoli and causes lung disease. About 10 percent of infants with alpha-1 antitrypsin deficiency develop liver disease, which often causes yellowing of the skin and whites of the eyes (jaundice). Approximately 15 percent of adults with alpha-1 antitrypsin deficiency develop liver damage (cirrhosis) due to the formation of scar tissue in the liver."}, {"url": "http://www.nhlbi.nih.gov/health/health-topics/topics/aat/", "passage_text": "Alpha-1 antitrypsin (an-tee-TRIP-sin) deficiency, or AAT deficiency, is a condition that raises your risk for lung disease (especially if you smoke) and other diseases. Some people who have severe AAT deficiency develop emphysema (em-fi-SE-ma)—often when they're only in their forties or fifties. Alpha-1 antitrypsin, also called AAT, is a protein made in the liver. Normally, the protein travels through the bloodstream. It helps protect the body's organs from the harmful effects of other proteins."}, {"url": "http://www.ncbi.nlm.nih.gov/pubmedhealth/PMH0001178/", "passage_text": "Alpha-1 Antitrypsin Deficiency (AAT Deficiency). Alpha-1 antitrypsin deficiency, or AAT deficiency, is a condition that raises your risk for certain types of lung disease, especially if you smoke. PubMed Health Glossary. (Source: NIH-National Heart, Lung, and Blood Institute). Symptoms Tests Treatments Prevention. About the Lungs. "}, {"url": "https://labtestsonline.org/understanding/analytes/alpha1-antitrypsin/tab/test", "passage_text": "Alpha-1 antitrypsin (AAT) testing is used to help diagnose alpha-1 antitrypsin deficiency as the cause of early onset emphysema, especially when a person does not have obvious risk factors such as smoking or exposure to lung irritants such as dust and fumes. "}, {"url": "http://www.webmd.com/lung/copd/alpha-1-antitrypsin-deficiency-rare", "passage_text": "Alpha-1 antitrypsin deficiency (alpha-1) is a genetic disease, meaning it's passed down from your parents. It can cause serious lung disease that makes it hard to breathe. It can also cause liver disease that leads to jaundice, which makes your skin look yellowish. "}, {"url": "http://www.alpha1.org/What-is-Alpha1", "passage_text": "Alpha-1 Antitrypsin Deficiency (Alpha-1) is a genetic (inherited) condition – it is passed from parents to their children through their genes. Alpha-1 may result in serious lung disease in adults and/or liver disease at any age. Alpha-1 occurs when there is a lack of a protein in the blood called alpha-1 antitrypsin, or AAT. AAT, the alpha-1 protein, is mainly produced by the liver. The main function of AAT is to protect the lungs from inflammation caused by infection and inhaled irritants such as tobacco smoke."}, {"url": "http://ghr.nlm.nih.gov/condition/alpha-1-antitrypsin-deficiency", "passage_text": "Alpha-1 antitrypsin deficiency is an inherited disorder that may cause lung disease and liver disease. The signs and symptoms of the condition and the age at which they appear vary among individuals. About 10 percent of infants with alpha-1 antitrypsin deficiency develop liver disease, which often causes yellowing of the skin and whites of the eyes (jaundice). Approximately 15 percent of adults with alpha-1 antitrypsin deficiency develop liver damage (cirrhosis) due to the formation of scar tissue in the liver."}, {"url": "https://en.wikipedia.org/wiki/Alpha_1-antitrypsin", "passage_text": "Alpha-1 Antitrypsin or α1-antitrypsin (A1AT) is a protease inhibitor belonging to the serpin superfamily. It is generally known as serum trypsin inhibitor. "}, {"url": "https://www.alpha1.org/", "passage_text": "Alpha-1 Antitrypsin Deficiency (Alpha-1) is a genetic (inherited) condition – it is passed from parents to their children through their genes. Alpha-1 may result in serious lung disease in adults and/or liver disease at any age. Read More. "}]