[{"url": "http://www.answers.com/Q/Compare_the_structure_of_the_tricuspid_valve_and_the_pulmonary_valve", "passage_text": "Confidence votes 308. The tricuspid valve is between the right atrium and ventricle. The pulmonary semilunar valve is where the blood flows out of the right ventricle, into the pulmonary circuit. The tricuspid has 3 flaps on it and also has chordae tendineae which attach to papillary muscles. These chords help prevent hold the valve in place. the tricuspid valve is a valve so the flow of blood does not go backwards through the heart. It is located between the right atrium and the right ventricle in the heart. You c … an pull up a picture in google of the lableing of the heart and can see the tricuspid valve in the heart. 2 people found this useful."}, {"url": "http://www.gwheartandvascular.org/education/anatomy-and-function-of-the-heart-valves/", "passage_text": "As the right ventricle contracts, the tricuspid valve closes and the pulmonary valve opens. The closure of the tricuspid valve prevents blood from backing into the right atrium and the opening of the pulmonary valve allows the blood to flow into the pulmonary artery toward the lungs. Pulmonary Valve. Pulmonary Valve: The pulmonary valve separates the right ventricle from the pulmonary artery. As the ventricles contract, it opens to allow the de-oxygenated blood collected in the right ventricle to flow to"}, {"url": "https://answers.yahoo.com/question/index?qid=20080408071852AAdoGzr", "passage_text": "Answers. Best Answer: The tricuspid valve has 3 leaflets, termed the anterior, the septal, and the posterior leaflet; all named for their anatomical position. The leaflets are connected to a respective papillary muscle, also bearing the same name respectively. The pulmonic valve also has 3 leaflets, or cusps as they are more often known as, which are termed the right, the left, and the anterior cusp. They also have corresponding papillary muscles of the same names, just like with the tricuspid valve. Source(s):"}, {"url": "https://en.wikipedia.org/wiki/Tricuspid_valve", "passage_text": "The tricuspid valve, or right atrioventricular valve, is on the right dorsal side of the mammalian heart, between the right atrium and the right ventricle. For the type of tooth, see dental anatomy. The tricuspid valve, or right atrioventricular valve, is on the right dorsal side of the mammalian heart, between the right atrium and the right ventricle. The function of the valve is to prevent back flow of blood into the right atrium."}, {"url": "http://www.answers.com/Q/Compare_the_structure_of_the_tricuspid_valve_with_that_of_the_pulmonary_valve", "passage_text": "The tricuspid valve is between the right atrium and ventricle. The pulmonary semilunar valve is where the blood flows out of the right ventricle, into the pulmonary circuit. T … he tricuspid has 3 flaps on it and also has chordae tendineae which attach to papillary muscles. These chords help prevent hold the valve in place. The pulmonary semilunar valve does not have thes"}, {"url": "https://www.healthtap.com/topics/tricuspid-valve-vs-pulmonary-valve", "passage_text": "The tricuspid is anchored to tiny muscles called papillary muscles. The functional differences are more relevant. The tricuspid regulates blood flow between the right atrium and the right ventricle, while the pulmonary valve stands between the right ventricle and the pulmonary artery. Pulmonary Valve (Definition). The heart has 4 chambers. The right ventricle is the pumping chamber whic h pushes blood into the lungs so oxygen can be put into the blood. When the right ventricle squeezes, the pulmonary valve opens and blood flows into the lungs."}, {"url": "https://answers.yahoo.com/question/index?qid=20110228232107AADsR81", "passage_text": "The mitral valve and the tricuspid valve are known collectively as the atrioventricular valves because they lie between the atria and the ventricles of the heart and control the flow of blood. A normally-functioning mitral valve opens secondary to increased pressure from the left atrium as it fills with blood. It has to withstand the pressure of 15 to 25 mmHg. The usual tricuspid valve area is 4-6 Cm2. * The pulmonary valve (sometimes referred to as the pulmonic valve) is the semilunar valve of the heart that lies between the right ventricle and the pulmonary artery and has three cusps."}]