[{"url": "http://www.webmd.com/a-to-z-guides/comprehensive-metabolic-panel-topic-overview", "passage_text": "Topic Overview. A comprehensive metabolic panel is a blood test that measures your sugar (glucose) level, electrolyte and fluid balance, kidney function, and liver function. Glucose is a type of sugar your body uses for energy. Electrolytes keep your body's fluids in balance. It also controls the amounts of glucose, protein, and fat in the blood and releases substances that keep your immune system healthy. Your doctor may order a comprehensive metabolic panel as part of a regular health examination."}, {"url": "http://www.cancer.org/treatment/understandingyourdiagnosis/examsandtestdescriptions/understanding-your-lab-test-results", "passage_text": "Here are 2 of the most common types of blood tests and what they can tell the doctor about your health: the complete blood count (CBC) and the chemistry panel. Some people find it helps to ask for a copy of their lab results and have a member of their health care team go over the numbers with them. The most common lab test that you’ll have done during treatment is called a complete blood count, or CBC. Blood is made up of water, proteins, nutrients, and living cells. A CBC tells your health care team about the cells in your blood."}, {"url": "https://en.wikipedia.org/wiki/Comprehensive_metabolic_panel", "passage_text": "The comprehensive metabolic panel, or chemical screen, (CMP; CPT code 80053) is a panel of 14 blood tests which serves as an initial broad medical screening tool. "}, {"url": "http://www.nhlbi.nih.gov/health/health-topics/topics/bdt/show", "passage_text": "Blood tests show whether the levels of different substances in your blood fall within a normal range. For many blood substances, the normal range is the range of levels seen in 95 percent of healthy people in a certain group. For many tests, normal ranges vary depending on your age, gender, race, and other factors. Your blood test results may fall outside the normal range for many reasons. Complete Blood Count. The table below shows some normal ranges for different parts of the complete blood count (CBC) test. Some of the normal ranges differ between men and women. Other factors, such as age and race, also may affect normal ranges. Your doctor should discuss your results with you."}, {"url": "http://www.webmd.com/a-to-z-guides/complete-blood-count-cbc", "passage_text": "1 The value is given as a percentage of red blood cells in a volume of blood. 2  For example, a hematocrit of 38 means that 38% of the blood's volume is made of red blood cells. 3  Hematocrit and hemoglobin values are the two major tests that show if anemia or polycythemia is present. 4  Hemoglobin (Hgb). 1 Too many or too few of the different types of white blood cells can help find an infection, an allergic or toxic reaction to medicines or chemicals, and many conditions, such as leukemia. 2  Red blood cell (RBC) count. 3  Red blood cells carry oxygen from the lungs to the rest of the body."}, {"url": "https://answers.yahoo.com/question/index?qid=20070314121202AAZbp1n", "passage_text": "The CMP is a frequently ordered panel that gives your doctor important information about the current status of your kidneys, liver, and electrolyte and acid/base balance as well as of your blood sugar and blood proteins. You may be intending to request a comprehensive metabolic panel. You may also request that your physician give you a copy of your test results. If you continue to have difficulty to communicate with your physician, perhaps you may consider seeking a second opinion."}, {"url": "http://www.webmd.com/a-to-z-guides/complete-blood-count-cbc", "passage_text": "A complete blood count (CBC) gives important information about the kinds and numbers of cells in the blood, especially red blood cells, white blood cells, and platelets. A CBC helps your doctor check any symptoms, such as weakness, fatigue, or bruising, you may have. A CBC also helps him or her diagnose conditions, such as anemia, infection, and many other disorders. A CBC test usually includes: 1  White blood cell (WBC, leukocyte) count. 1 Too many or too few of the different types of white blood cells can help find an infection, an allergic or toxic reaction to medicines or chemicals, and many conditions, such as leukemia. 2  Red blood cell (RBC) count. 3  Red blood cells carry oxygen from the lungs to the rest of the body."}]