[{"url": "http://civil.laws.com/civil-rights-act-of-1964", "passage_text": "The Civil Rights Act of 1964 ended racial segregation and outlawed most forms of discrimination in the workplace, schools, public facilities and separate requirements based on racialized distinctions, such as discriminatory voter registration requirements. Title III of the Civil Rights Act of 1964: Outlawed state and municipal governments from barring access to public facilities based off an individual’s religion, gender, race, or ethnicity."}, {"url": "http://prospect.org/article/supreme-court-v-civil-rights", "passage_text": "Central to Morrison 's holding was the Civil Rights Cases of 1883, in which the Supreme Court struck down provisions of the Civil Rights Act of 1875 that closely resembled later provisions in the Civil Rights Act of 1964. The Supreme Court's decision earlier this year to strike down Section 4 of the Civil Rights Act shares this tendency of inventing extraconstitutional limitations on the authority of Congress to protect civil rights."}, {"url": "http://www.civilrights.org/judiciary/supreme-court/key-cases.html", "passage_text": "1883: In a series of cases known as the Civil Rights Cases, the Supreme Court held that the Civil Rights Act of 1875 was not constitutional under the Thirteenth and Fourteenth Amendments. The Court established the state-action doctrine, thereby allowing segregation and discrimination by private actors. 1978: In Regents of the University of California v. Bakke, the Supreme Court ruled that the medical school's special admission program setting aside a fixed number of seats for minorities violated Title VI of the 1964 Civil Rights Act."}, {"url": "https://en.wikipedia.org/wiki/Civil_Rights_Act_of_1964", "passage_text": "After the Civil Rights Act of 1964 was passed, the Supreme Court upheld the law's application to the private sector, on the grounds that Congress has the power to regulate commerce between the States. Despite its lack of influence during its time, the Civil Rights Act of 1964 had considerable impact on later civil rights legislation in the United States."}, {"url": "https://en.wikipedia.org/wiki/Civil_Rights_Act_of_1964", "passage_text": "The Civil Rights Act of 1964 (Pub.L. 88–352, 78 Stat. 241, enacted July 2, 1964) is a landmark piece of civil rights legislation in the United States that outlawed discrimination based on race, color, religion, sex, or national origin. Despite its lack of influence during its time, the Civil Rights Act of 1964 had considerable impact on later civil rights legislation in the United States."}, {"url": "http://www.history.com/topics/black-history/civil-rights-act", "passage_text": "Introduction. The Civil Rights Act of 1964, which ended segregation in public places and banned employment discrimination on the basis of race, color, religion, sex or national origin, is considered one of the crowning legislative achievements of the civil rights movement. Under the Civil Rights Act, segregation on the grounds of race, religion or national origin was banned at all places of public accommodation, including courthouses, parks, restaurants, theaters, sports arenas and hotels."}, {"url": "http://www.civilrights.org/resources/civilrights101/supremecourt.html", "passage_text": "IN THE STRUCGLE FOR CIVIL RIGHTS, some of the key Supreme Court rulings include: 1857: In Dred Scott v. Sanford, Dred Scott, a slave in Missouri, sued for his freedom on the grounds that he had lived for a time in a free territory. This decision was legislatively reversed with the enactment of the Civil Rights Restoration Act in 1988. 1986: The Court emphasized that lawful affirmative action programs cannot require that incumbent white workers be discharged to make way for minority workers."}, {"url": "https://en.wikipedia.org/wiki/Civil_Rights_Act_of_1964", "passage_text": "In the landmark Civil Rights Cases the United States Supreme Court had ruled that Congress did not have the power to prohibit discrimination in the private sector, thus stripping the Civil Rights Act of 1875 of much of its ability to protect civil rights. Despite its lack of influence during its time, the Civil Rights Act of 1964 had considerable impact on later civil rights legislation in the United States."}, {"url": "http://civilrights.findlaw.com/civil-rights-overview/civil-rights-u-s-supreme-court-decisions.html", "passage_text": "1 A major precursor to the Civil War, this controversial U.S. Supreme Court decision denied citizenship and basic rights to all blacks -- whether slave or free. 2  Plessy v. Ferguson (1896). 3  This decision allowed the use of separate but equal racially segregated accommodations and facilities. 1 In this case, the Court held that sex discrimination consisting of same-sex sexual harassment can form the basis for a valid claim under Title VII of the Civil Rights Act of 1964."}, {"url": "http://www.civilrights.org/resources/civilrights101/supremecourt.html", "passage_text": "1978: In Regents of the University of California v. Bakke, the Supreme Court ruled that the medical school's special admission program setting aside a fixed number of seats for minorities violated Title VI of the 1964 Civil Rights Act. This decision was legislatively reversed with the enactment of the Civil Rights Restoration Act in 1988. 1986: The Court emphasized that lawful affirmative action programs cannot require that incumbent white workers be discharged to make way for minority workers."}]