[{"url": "http://wwf.panda.org/what_we_do/endangered_species/albatross/", "passage_text": "There are 22 albatross species recognised by IUCN. These are divided in 4 Genera : Albatrosses use their morphologically adapted wings and large wingspans to travel long distances without using muscles. Instead of flapping the wings, they use specialised gliding techniques to minimise the use of muscles and energy."}, {"url": "http://www.ourendangeredworld.com/species/birds-bats/amsterdam-albatross/", "passage_text": "Once thought to be a subspecies of the wandering albatross, DNA testing has proven that the Amsterdam albatross is, indeed, a separate species. The Amsterdam albatross is an enormous bird, with a total body length of 110 to 122 centimetres and a wingspan of up to 340 centimetres."}, {"url": "http://wanttoknowit.com/why-are-albatrosses-endangered/", "passage_text": "They are some of the largest flying birds in the world. The great albatrosses have wingspans which can reach 3.7 m (12 feet). Albatrosses mostly nest on remote ocean islands and it is not uncommon for a number of species to nest together. Of the 21 species of albatrosses, 19 are listed as threatened with extinction."}, {"url": "http://www.bagheera.com/inthewild/van_albatros.htm", "passage_text": "Historically, the short-tailed albatross bred on a number of Japanese islands, and its range extended to most of the north Pacific Ocean. In the 19th century, the short-tailed albatross was common in the north Pacific. However, its numbers were reduced from more than a million birds to as few as 40 or 50 in 1940."}, {"url": "http://www.brighthub.com/environment/science-environmental/articles/24849.aspx", "passage_text": "Endangered Species: Albatross. written by: ElijahS•edited by: Niki Fears•updated: 1/31/2009. Why the Albatross is an endangered species and what can be done to remedy the situation."}, {"url": "http://www.answers.com/Q/Why_are_albatrosses_endangered", "passage_text": "Split and merge into it. Answered by The Community. Making the world better, one answer at a time. Albatrosses are endangered due to the high rate of by-catch (accidental catch by commercial fishermen) particularly with longline fishing gear in which by-catch rates can be as high as 1 bird per 10 hooks."}, {"url": "http://www.brighthub.com/environment/science-environmental/articles/24849.aspx", "passage_text": "As of 2009, 19 of the 22 species are officially recognized as either vulnerable, nearly threatened or critically endangered. While most species still have several thousand breeding couples, some, like the Amsterdam Island albatross, have dwindled to less than a few hundred."}, {"url": "http://wwf.panda.org/what_we_do/endangered_species/albatross/", "passage_text": "Commercial fishing practices are considered the greatest threat to the survival of many albatross species. Other threats include loss of habitat, introduced predators, eating or becoming tangled up in plastic, oil spills and climate change."}]