[{"url": "http://web.uvic.ca/~mroth/438/VOLCANO/COMPOSITE.html", "passage_text": "Composite volcanoes are constructed from multiple eruptions, sometimes recurring over hundreds of thousands of years, sometimes over a few hundred. Andesite magma, the most common but not the only magma type forming composite cones, produces lava more brittle than basaltic lava because of its higher viscosity."}, {"url": "http://www.answers.com/Q/What_is_a_Composite_Volcano", "passage_text": "Confidence votes 2.6K. A composite volcano is built up from alternate layers of ash and lava. It has steep sides because when it erupts it lava is thick and viscous (andesitic) meaning that it does not travel great distances and stays on the side of the volcano. An example is Mount Vesuvius (which destroyed Pompeii)."}, {"url": "http://www.kids-fun-science.com/composite-volcano.html", "passage_text": "Stratovolcanoes are typically composed of layers of pyroclastic material. The layers that form the mountain are lava, volcanic ash, tephra, and pumice. Andesite, dacite and rhyolite lavas erupted by these volcanoes have a high percentage of quartz and feldspar minerals."}, {"url": "http://www.bbc.co.uk/science/earth/surface_and_interior/composite_volcano", "passage_text": "Composite volcanoes (also called stratovolcanoes) are much more explosive than shield volcanoes, the other important type of volcano. The large and generally cone-shaped volcanoes form along plate boundaries called subduction zones where one of the Earth's plates moves below another."}, {"url": "http://www.answers.com/Q/What_are_Composite_Volcanoes", "passage_text": "A composite volcano is built up from alternate layers of ash and lava. It has steep sides because when it erupts it lava is thick and viscous (andesitic) meaning that it does … not travel great distances and stays on the side of the volcano. An example is Mount Vesuvius (which destroyed Pompeii)."}, {"url": "http://www.the-science-site.com/composite-volcano.html", "passage_text": "Composite Volcano. A composite volcano forms in subduction zones when a crustal plate is forced into the mantle and begins to melt. Andesite, dacite and rhyolite lavas are the primary types of lava that form these volcanoes. Eruptions on the volcanoes often alternate between tephra and lava flows. Subduction zon"}, {"url": "http://www.answers.com/Q/What_is_a_Composite_Volcano", "passage_text": "A composite volcano is built up from alternate layers of ash and lava. It has steep sides because when it erupts it lava is thick and viscous (andesitic) meaning that it does not travel great distances and stays on the side of the volcano. An example is Mount Vesuvius (which destroyed Pompeii)."}]