[{"url": "http://www.tejastango.com/tango_styles.html", "passage_text": "Named for one of the neighborhoods of Buenos Aires, the Villa Urquiza style of tango is typically danced with an upright body posture with the two dancers maintaining separate axes and looking toward the clasped hands of the embrace. To the extent that orillero-style tango is still danced it has become more like the Villa Urquiza style of tango. It is danced with upright body posture with the dancers maintaining separate axes, and the embrace is typically offset in a V and can be either close or open."}, {"url": "http://www.centraltango.com/TangoInfo/VideoTangoMilonguero.htm", "passage_text": "Videos of Tango Milonguero. Tango milonguero is the tango danced in the milongas of Buenos Aires. Milongueros are men who have danced in these milongas for many years; the milongas are a central part of their lives. The best ways to see how milogueros dance is to watch them dance in the milongas of Buenos Aires. "}, {"url": "http://yangningyuan.blogspot.com/2012/08/the-styles-of-tango.html", "passage_text": "Many terms are used to describe different styles of tango, such as tango milonguero, tango apilado, tango Villa Urquiza, estilo del centro, estilo del barrio, tango de salon, tango fantasia and tango Nuevo, etc. The fundamental cause of stylistic differences lies in human psychologies. "}, {"url": "http://www.siempremilonguero.org/milonguero-style-tango/", "passage_text": "Milonguero Style Tango. The Milongueros are the tango dancers who have spent their lives in the milongas of Buenos Aires. The last of this lineage of dancers from the Golden Era of tango (1935 to 1952) are now in their eighties. They are social dancers who developed their dance within the limits of crowded milongas. As such, their figures are compact, easily navigated, and safe for dancers nearby. For the most part they dance chest to chest in a close, intimate embrace. Their dance, based on walking, was developed by regular people, not professional dancers, and so by its nature is accessible to everyone. Most milongueros do not identify their tango as that associated with flash or posturing."}, {"url": "https://en.wikipedia.org/wiki/Milonguero_style", "passage_text": "Milonguero is a style of close-embrace tango dancing, the name coined by Susana Miller and Oscar Cacho Dante from the Argentine word milonguero. In the milonguero-style embrace, the woman moves her left hand past her partner's right shoulder (where it would be in open embrace) around his neck and back to end up near his left shoulder, depending on the relative heights of the dancers."}, {"url": "http://www.tejastango.com/tango_styles.html", "passage_text": "Milonguero-style tango is typically danced with a slightly leaning posture that typically joins the torsos of the two dancers from the tummy through the solar plexus (in an embrace that some Argentines call apilado) to create a merged axis while allowing a little bit of distance between the couple's feet. To the extent that orillero-style tango is still danced it has become more like the Villa Urquiza style of tango. It is danced with upright body posture with the dancers maintaining separate axes, and the embrace is typically offset in a V and can be either close or open."}, {"url": "http://www.tejastango.com/tango_styles.html", "passage_text": "Club-style tango is typically danced to the ric-tic-tic rhythm that is prominent in the music of Juan D'Arienzo and Rodolfo Biagi and also is found in the playing of many other tango orchestras. Club-style tango uses the ocho cortado and other rhythmic figures that are found in milonguero-style tango. To the extent that orillero-style tango is still danced it has become more like the Villa Urquiza style of tango. It is danced with upright body posture with the dancers maintaining separate axes, and the embrace is typically offset in a V and can be either close or open."}, {"url": "http://www.tejastango.com/tango_styles.html", "passage_text": "In Buenos Aires and other parts of Argentina, tango is danced in a spectrum of individualistic or personal styles, and many tango dancers who are Argentine do not accept a categorization of their own dancing by any broad stylistic name. To the extent that orillero-style tango is still danced it has become more like the Villa Urquiza style of tango. It is danced with upright body posture with the dancers maintaining separate axes, and the embrace is typically offset in a V and can be either close or open."}, {"url": "http://heritageinstitute.com/danceinfo/descriptions/argentine_tango.htm", "passage_text": "A milonguero is a person who dances at milongas-social dances. Milonguero Tango is best suited for small or crowded dance floors such as those found in the downtowns of large cities, or those found in cafe's and restaurants. It is very different from the Tango in International and American ballroom dancing. Argentine Tango is an interpretive, improvisational social dance that allows the dancers to develop a deep connection between themselves, the music, and the environment in which they are dancing."}]