[{"url": "http://www.ehow.com/info_7748564_much-tesol-certified-teachers-make.html", "passage_text": "In the United States. The range of salary for ESL and TESOL related teaching careers is between $25,000 and $75,000, according to the website Guide to Career Education. The median salary is about $44,000. Again, the location in which a teacher works, her education and experience are important in determining her salary. Independent certification programs that offer at least 100 hours of training and a supervised teaching component are the best types of independent TESOL certification."}, {"url": "http://work.chron.com/much-esl-teachers-paid-11499.html", "passage_text": "Pay by State. As of 2011, ESL teachers employed in New Jersey reported the highest average pay, by state: $70,210 a year. California, which employed more ESL and adult literacy teachers than any other state, reported the second-highest average income, $69,460 per year. Oregon ranked third at $68,080. Those employed by elementary and secondary schools averaged $55,970 per year, while those who work at junior colleges averaged $53,100 per year. ESL and adult literacy teachers employed by colleges and universities reported one of the lowest average salaries, $45,95"}, {"url": "http://www.eslteachersboard.com/cgi-bin/tesol/index.pl?page=6;read=4157", "passage_text": "Most TESOL teachers teach overseas, however. In the United States. The range of salary for ESL and TESOL related teaching careers is between $25,000 and $75,000, according to the website Guide to Career Education. The median salary is about $44,000. Again, the location in which a teacher works, her education and experience are important in determining her salary. Independent certification programs that offer at least 100 hours of training and a supervised teaching component are the best types of independent TESOL certification. These certificates are mainly appropriate for teachers who plan to teach overseas."}, {"url": "http://work.chron.com/much-esl-teachers-paid-11499.html", "passage_text": "The lowest-paid 25 percent of ESL and adult literacy instructors reported salaries of $36,240 or less per year, while the highest-paid 25 percent made $64,350 or more per year. ESL teachers operate in a variety of settings, and the type of institution by which they are employed can have an impact on salary. Those employed by elementary and secondary schools averaged $55,970 per year, while those who work at junior colleges averaged $53,100 per year. ESL and adult literacy teachers employed by colleges and universities reported one of the lowest average salaries, $45,95"}, {"url": "http://www.internationalteflacademy.com/faq/bid/102172/How-Much-Money-Can-I-Earn-Teaching-English-Abroad", "passage_text": "Asia-English teacher salaries will typically enable you to save between 30%-50% of your salary after expenses, which can range from $200-$300 a month in a country like Thailand to $ 1,000 or more a month in South Korea. Such benefits will vary from region to region and job to job. To learn more about where English teacher salaries are highest, check out Top 5 Countries to Make the Most Money Teaching English Overseas. Tags: salaries, English teacher salaries abroad, how much can I make teaching English, money."}, {"url": "http://www.eslinsider.com/articles/tefl-tesol-courses-are-a-waste-of-money", "passage_text": "Just a degree in any discipline won't cut it. A TEFL/TESOL certificate won't help. A degree and a TEFL/TESOL certificate won't suffice. Here you need to be a certified teacher to teach English in a public school. This is also the case for teaching in many international schools and UAE. "}, {"url": "http://www.eslteachersboard.com/cgi-bin/tesol/index.pl?page=6;read=4157", "passage_text": "Many factors play into how much money a TESOL certified teacher earns in a year. The type of institution and program for which he teaches, where he teaches, his years of experience and the type of TESOL certification he has will in large part determine how much money he makes. Independent certification programs that offer at least 100 hours of training and a supervised teaching component are the best types of independent TESOL certification. These certificates are mainly appropriate for teachers who plan to teach overseas."}, {"url": "http://work.chron.com/much-esl-teachers-paid-11499.html", "passage_text": "Average National Pay. According to the United States Bureau of Labor Statistics, ESL and other adult literacy teachers brought home an average of about $51,350 per year in 2011. The average wage for this occupation was $24.69 an hour. Those employed by elementary and secondary schools averaged $55,970 per year, while those who work at junior colleges averaged $53,100 per year. ESL and adult literacy teachers employed by colleges and universities reported one of the lowest average salaries, $45,95"}]