[{"url": "http://www.irishtimes.com/news/consumer/water-in-ireland-to-cost-more-than-in-most-eu-states-1.1884342", "passage_text": "This cut will result in an allowed revenue for Irish Water of €2,078 million. When the total costs of providing water services are spread across all households, this results in an average annual cost of €594 for a household with both supply and wastewater services. Annual cost for unmetered household of two adults, two children will be €278. People with water meters installed will be charged €4.88 for every 1,000 litres of water used, but will have their bills capped for six months. Conor Pope."}, {"url": "http://www.rte.ie/news/2014/1119/660616-water-charges/", "passage_text": "The second is the cost of giving the water conservation grant to the 20% of households who are not customers of Irish water. This will cost €64m per year. Minister for the Environment Alan Kelly announced the revised package of measures regarding water charges this afternoon. The starting date for the charges is 1 January and bills will be charged from April next year. If a householder fails to register with Irish Water they will receive a default bill for €260 a year. They will also not be entitled to the €100 Water Conservation Grant."}, {"url": "http://www.inclusionireland.ie/content/page/irish-water-charges-updated-november-19", "passage_text": "1 Water services charges are now capped at a maximum annual amount until the end of 2018. 2  There will be a water conservation grant of €100 per year that will be available for all primary residences of customers who apply to Irish Water. Key information for domestic customers: 1  Water services charges are now capped at a maximum annual amount until the end of 2018. 2  There will be a water conservation grant of €100 per year that will be available for all primary residences of customers who apply to Irish Water. 3  Billing will start from April 2015 and bills will normally be issued 4  ... Wa"}, {"url": "http://www.irishmirror.ie/news/irish-news/politics/irish-water-charges-homeowners-pay-4348909", "passage_text": "An assessed charge is the current best estimate of how much water a household with a certain number of adult occupants will consume. All 1.35 million customers of Irish Water will pay an average or assessed charge for nine months after charges start from tomorrow. The charge is based on adult occupants only, as children are free."}, {"url": "http://www.citizensinformation.ie/en/environment/water_services/water_charges.html", "passage_text": "For both services: The maximum rate of domestic water charges for a single-adult household is €160 per year or €40 per quarter for a household that uses both water supply and wastewater services. The maximum rate for a multi-adult household is €260 per year or €65 per quarter. The table below shows the capped charges for a sample of household types using both water services, including the maximum amount of the quarterly bills that these sample households will receive, starting from April 2015. The minimum charge for unoccupied dwellings is €62.50 per service per year – a total of €125 for a house using both public water supply and public wastewater services. This charge is capped at €260 per year for a house using both services, and €130 for houses using a single service."}, {"url": "http://www.irishexaminer.com/ireland/no-irish-water-rebate-for-charge-defaulters-313977.html", "passage_text": "Irish Water will also be entitled to seek judgments against customers through the courts for unpaid charges. A new regime of reduced charges will see prices capped at €160 per year for a single adult household and €260 for all other households. Households which register with Irish Water will also be entitled to an annual €100 conservation grant. "}, {"url": "http://www.water.ie/billing-and-charges/charges/", "passage_text": "1 Water services charges are capped at a maximum yearly amount until the end of 2018. 2  The Government is making a water conservation grant of €100 per year available to all primary residences that register with Irish Water by 30 June 2015. If the property is unmetered the charge is €125 per year for both water supply and wastewater services and is €62.50 per year for a single service. If the property is metered the minimum charge is €125 per year for both water supply and wastewater services and"}, {"url": "http://www.water.ie/billing-and-charges/charges/", "passage_text": "Key information for domestic customers: 1  Water services charges are capped at a maximum yearly amount until the end of 2018. 2  The Government is making a water conservation grant of €100 per year available to all primary residences that register with Irish Water by 30 June 2015. If the property is unmetered the charge is €125 per year for both water supply and wastewater services and is €62.50 per year for a single service. If the property is metered the minimum charge is €125 per year for both water supply and wastewater services and"}, {"url": "http://www.rte.ie/news/2014/1119/660616-water-charges/", "passage_text": "Charges will be capped for a single adult household at €160 and for others at €260. Households that register will get a €100 Water Conservation Grant each year resulting in net charges of €60 for a single adult household and €160 for other households. The starting date for the charges is 1 January and bills will be charged from April next year. If a householder fails to register with Irish Water they will receive a default bill for €260 a year. They will also not be entitled to the €100 Water Conservation Grant."}]