[{"url": "http://www.seattlechildrens.org/Kids-Health/Parents/Infections/Skin-Infections-and-Rashes/Molluscum-Contagiosum/", "passage_text": "About Molluscum Contagiosum Molluscum contagiosum is a viral infection that causes a mild skin rash. The rash looks like one or more small growths or wart-like bumps (called mollusca) that are usually pink, white, or skin-colored. The bumps are usually soft and smooth and may have an indented center. About Molluscum Contagiosum."}, {"url": "http://www.mayoclinic.org/diseases-conditions/molluscum-contagiosum/basics/definition/con-20026391", "passage_text": "Molluscum contagiosum. Molluscum contagiosum (mo-LUS-kum kun-tay-jee-OH-sum) is a relatively common viral infection of the skin that results in round, firm, painless bumps ranging in size from a pinhead to a pencil eraser. If the bumps are scratched or injured, the infection can spread to surrounding skin. Molluscum contagiosum (mo-LUS-kum kun-tay-jee-OH-sum) is a relatively common viral infection of the skin that results in round, firm, painless bumps ranging in size from a pinhead to a pencil eraser"}, {"url": "http://www.webmd.com/skin-problems-and-treatments/guide/molluscum-contagium", "passage_text": "Causes of Molluscum Contagiosum. Molluscum contagiosum is caused by a virus (the molluscum contagiosum virus) that is part of the pox virus family. The virus is contagious through direct contact and is more common in children. However, the virus also can be spread by sexual contact and can occur in people with compromised immune systems. Molluscum contagiosum can spread on a single individual through scratching and rubbing. "}, {"url": "http://www.nhs.uk/Conditions/Molluscum-contagiosum/Pages/Introduction.aspx", "passage_text": "Introduction. Molluscum contagiosum (MC) is a viral infection that affects the skin. It most commonly affects children, although it can occur at any age. Usually, the only symptom of MC is a number of small, firm, raised papules (spots) that develop on the skin. They are not painful, but can be itchy"}, {"url": "http://www.webmd.com/skin-problems-and-treatments/tc/molluscum-contagiosum-topic-overview", "passage_text": "The infection is contagious until the bumps are gone. The time from exposure to the virus until the bumps appear usually is 2 to 7 weeks, but it can take up to 6 months. To prevent molluscum contagiosum from spreading: 1  Try not to scratch. 2  Put a piece of tape or a bandage over the bumps. 3  Do not share towels or washcloths. 4  If the bumps are on your face, don't shav"}, {"url": "http://www.medicinenet.com/molluscum_contagiosum_facts/page2.htm", "passage_text": "The first signs and symptoms of molluscum contagiosum are small painless papules (raised bumps) on the skin. It often appears as a raised, a pearly pinkish nodule; some nodules contain a dimple in the center. Most lesions are small, about 2-5 mm in diameter. Inside the nodule, sometimes there is a cheesy whitish core. "}, {"url": "http://www.cdc.gov/poxvirus/molluscum-contagiosum/index.html", "passage_text": "Recommend on Facebook Tweet ShareCompartir. Molluscum contagiosum is an infection caused by a poxvirus (molluscum contagiosum virus). The result of the infection is usually a benign, mild skin disease characterized by lesions (growths) that may appear anywhere on the body. Within 6-12 months, Molluscum contagiosum typically resolves without scarring but may take as long as 4 years. "}, {"url": "http://www.rch.org.au/kidsinfo/fact_sheets/Molluscum/", "passage_text": "Molluscum is contagious and can be spread from person to person or to different areas in the same person. It can also be spread by children sharing baths or pools through bath toys and towels. Usually it does not need any treatment. Good personal hygiene can help prevent it spreading. "}, {"url": "http://www.naturalmolluscum.com/contagious", "passage_text": "The molluscum contagiosum virus is, as its name indicates, very contagious. The presence of papules (raised skin bumps) can be provoked by crab lice bites, tattooing, or accidental scratching. They usually occur when MVC is inoculated (placed where it can grow and reproduce) in a tiny abrasion in the skin. "}]