[{"url": "http://www.bbc.com/news/science-environment-27393805", "passage_text": "The government wants to draw a close to the current system two years before it was projected to end. Many parts of Southern England have seen a boom in solar power generation in recent years. There is currently enough photo-voltaic installed capacity to power 620,000 homes."}, {"url": "http://www.gogreenacademy.com/how-to-get-government-grants-for-residential-solar-power/", "passage_text": "If you own a home and have high electric bills, it’s worth it to see if you can get an energy efficient mortgage to cover your solar panels cost. After government incentives, there are cases were people end up paying less in monthly payments for installing a solar PV system than they did for their electric bills."}, {"url": "https://www.gov.uk/feed-in-tariffs/overview", "passage_text": "1. You can get payments from your energy supplier if you generate your own electricity, eg with solar panels or a wind turbine. This is called a ‘Feed-in Tariff’ (. )."}, {"url": "http://ohp.parks.ca.gov/?page_id=25664", "passage_text": "Originally the Solar Rights Act specified an amount not to exceed two thousand dollars ($2,000) over the system cost as originally specified and proposed, or a decrease in system efficiency of an amount exceeding 20 percent as originally specified and proposed."}, {"url": "http://www.resourcesandenergy.nsw.gov.au/energy-consumers/solar/solar-bonus-scheme/solar-bonus-scheme", "passage_text": "The Solar Bonus Scheme (the Scheme) provides a feed-in tariff for eligible customers with small solar or wind generators that are connected to the grid. The Scheme commenced on 1 January 2010 and operates until 31 December 2016."}, {"url": "http://www.theecoexperts.co.uk/government-grants-installing-solar-panels", "passage_text": "The Feed-in Tariff allows you to earn up to £13,450 over 20 years for the energy that you produce with solar panels. You may be able to get free solar panels that means no upfront costs for installation. The government plan to cut the amount the Tariff pays out by 87% in Jan 2016. If you are considering solar panels, install before 2016 otherwise you will miss out on £8,000. Thousands of people use The Eco Experts to find their local installers each year."}, {"url": "http://www.gogreenacademy.com/how-to-get-government-grants-for-residential-solar-power/", "passage_text": "Federal government grants (solar rebates) are given in the form of tax credits. The current program in the United States started in 2006 and expires in 2016. The credit will give you 30 percent of the installation cost of your solar power system."}]