[{"url": "http://www.justanswer.com/real-estate-law/1e67h-real-estate-broker-long-keep-real.html", "passage_text": "HelloCustomer. The time period to keep records depends on why they are being maintained. Generally records should be retained for as long as possible, but for no less than four years. There is no single, simple rule establishing the minimum time to retain records."}, {"url": "http://www.answers.com/Q/How_long_does_a_broker_keep_records", "passage_text": "Generally, 5 years. But read on. According to Chapter 475.5015, Each broker shall keep and make available to the department such books, accounts, and records as will enable th … e department to determine whether such broker is in compliance with the provisions of this chapter."}, {"url": "http://www.answers.com/Q/How_long_does_a_real_estate_broker_keep_transaction_records_in_florida", "passage_text": "According to Chapter 475.5015, Each broker shall keep and make available to the department such books, accounts, and records as will enable the department to determine whether such broker is in compliance with the provisions of this chapter."}, {"url": "http://www.sec.gov/answers/bdrecrd.htm", "passage_text": "The length of time your broker must keep records depends on the type of record. For example, firms must retain blotters containing all purchases and sales of securities for at least six years. But they must keep copies of confirmations for only three years."}, {"url": "http://www.sec.gov/answers/bdrecrd.htm", "passage_text": "You can find a complete list of the records that broker-dealers must keep and how long they must be kept under Securities Exchange Act Rule 17a-3 (Records to Be Made by Certain Exchange Members, Brokers and Dealers) and Rule 17a-4 (Records to Be Preserved by Certain Exchange Members, Brokers and Dealers)."}, {"url": "http://realtormag.realtor.org/news-and-commentary/feature/article/2004/02/know-when-retire-your-records", "passage_text": "It's best if the valuation for the business is broken down. Brokers should keep those records three years after selling.”. According to IRS requirements, your record-keeping system should include a summary of all business transactions, usually made in accounting journals and ledgers. For most small real estate offices, the business checkbook is the main source for entries."}]