[{"url": "https://www.asianfoodgrocer.com/asian-food/snacks-candy/soft-chewy-candy/white-rabbit-milk-candy-6-3-oz", "passage_text": "Details. The original milky sweet candy from China! White Rabbit is a delicious and creamy snack with a thin sheet of edible rice paper wrapped around it. It’s a unique and classic candy that people have loved for decades. There are several chewable and tasty candies in each bag!"}, {"url": "http://www.worldmarket.com/product/white-rabbit-creamy-candy-2c-set-of-10.do", "passage_text": "White Rabbit Creamy Candies are delicious, chewy creamy milk candies. Each one is individually wrapped twice; once in an outer wax paper package and again in an inner rice paper wrap that's edible. Each one is made with whole milk powder. 6.3 oz. "}, {"url": "https://en.wikipedia.org/wiki/White_Rabbit_Creamy_Candy", "passage_text": "White Rabbit Creamy Candy is white, with a soft, chewy texture, and is formed into cylinders approximately 3 cm long and 1 cm in diameter, similar to contemporary western nougat or taffy. White Rabbit Creamy Candy originated at the ABC Candy Factory of Shanghai in 1943, when a merchant from ABC tried a milk candy from England and thought that its taste was not bad. After half a year of development, he then manufactured the factory's own brand of milk candies."}, {"url": "https://en.wikipedia.org/wiki/White_Rabbit_Creamy_Candy", "passage_text": "Each candy contains 20 calories. White Rabbit sweets have been advertised with the slogan, Seven White Rabbit candies is equivalent to one cup of milk  and positioned as a nutritional product in addition to being a sweet. The candies hence accompanied the growth of a generation. White Rabbit Creamy Candy originated at the ABC Candy Factory of Shanghai in 1943, when a merchant from ABC tried a milk candy from England and thought that its taste was not bad. After half a year of development, he then manufactured the factory's own brand of milk candies."}, {"url": "https://www.asianfoodgrocer.com/asian-food/snacks-candy/soft-chewy-candy/white-rabbit-milk-candy-6-3-oz", "passage_text": "Quick Overview. The original milky sweet candy from China! White Rabbit is a delicious and creamy snack with a thin sheet of edible rice paper wrapped around it. It’s a unique and classic candy that people have loved for decades. There are several chewable and tasty candies in each bag!"}, {"url": "https://www.alohagourmet.com/white-rabbit-candy", "passage_text": "White Rabbit Creamy Candy is a popular Asian treat! It is has a smooth, creamy, milk flavor and is chewy like taffy. This candy is especially unique because of the thin, edible, rice paper layer that each candy is wrapped in. "}, {"url": "http://en.wikipilipinas.org/index.php?title=White_Rabbit_Candy", "passage_text": "White Rabbit Creamy Candies originate from Aipixi Candy Factory, Shanghai in 1943. A merchant from Aipixi tried a milk candy from England then, and thought that its taste was not bad. He then manufactured the factory's own brand of milk candies after half a year. White Rabbit sweets were advertised with the line, Seven White Rabbit candies is equivalent to one cup of milk , and was seen as a nutritional product. The candies hence accompanied the growth of a generation."}, {"url": "http://en.wikipilipinas.org/index.php?title=White_Rabbit_Candy", "passage_text": "White Rabbit Creamy Candies (Template:Zh-cp) are perhaps the best known brand of Chinese-made candy in China, and the only one to be marketed significantly outside of that country. In the Philippines in particular it has dominated the creamy candy or toffee market. White Rabbit sweets were advertised with the line, Seven White Rabbit candies is equivalent to one cup of milk , and was seen as a nutritional product. The candies hence accompanied the growth of a generation."}, {"url": "https://kwgls.wordpress.com/2014/09/17/homemade-white-rabbit-creamy-candy-%e8%87%aa%e5%88%b6%e5%a4%a7%e7%99%bd%e5%85%94%e7%89%9b%e5%a5%b6%e7%b3%96%ef%bc%89/", "passage_text": "White Rabbit sweets have been advertised with the slogan, “Seven White Rabbit candies is equivalent to one cup of milk “, and positioned as a nutritional product in addition to being a sweet. The candies hence accompanied the growth of a generation. When Asian Food Channel posted a picture of white rabbit creamy candy in its timeline, it caught my attention because I did not have this sweet for many years."}]