[{"url": "http://www.captainquizz.com/quizz/what-kind-of-psychopath-are-you", "passage_text": "You are the worst psychopath. Not only do you use the worst torture methods, like equations and trigonometry, but also your favorite victims are children... You are a sick man who deserves to be put in an asylum for life. Share on Facebook"}, {"url": "http://cassiopaea.com/cassiopaea/psychopath.htm", "passage_text": "To get a full feeling for this strange need of the psychopath-a need that seems to be evidence that acting human is very stressful to the psychopath-read more of The Mask of Sanity, chapters 25 and 26. Also, read Cleckley's speculations on what was really wrong with these people. All else-all activity-is subsumed to this drive. In short, the psychopath-and the narcissist to a lesser extent-is a predator. If we think about the interactions of predators with their prey in the animal kingdom, we can come to some idea of what is behind the mask of sanity of the psychopath."}, {"url": "http://cassiopaea.com/cassiopaea/psychopath_2.htm", "passage_text": "This of course is more in depth study of the psychopath. Not all psychopaths have a gun collection or a favourite knife or sword, but a great deal of them do tend to be fond of weapons and such symbols of aggression and dominance. If you leave the psychopath, you can expect that he will either be the type who doesn't make any noise but ruins your reputation by spreading lies, or you can expect a lot of open manipulation (a final attempt to gain power and control)."}, {"url": "http://www.telegraph.co.uk/culture/books/10737827/Psychopaths-how-can-you-spot-one.html", "passage_text": "But for a small – but not that small – subset of the population, things are very different. These people lack remorse and empathy and feel emotion only shallowly. In extreme cases, they might not care whether you live or die. These people are called psychopaths. Some of them are violent criminals, murderers. But by no means all. Professor Robert Hare is a criminal psychologist, and the creator of the PCL-R, a psychological assessment used to determine whether someone is a psychopath. "}, {"url": "http://psychcentral.com/quizzes/psychopathy.htm", "passage_text": "Instructions: This quiz is designed to help give you some idea about whether or not you may have psychopathic tendencies. This quiz is not meant to diagnose psychopathy or tell you definitively whether or not you're a psychopath. But it will give you a pretty good idea, based upon the research. For each item, indicate how much you agree or disagree with the statement. This takes most people about 2 minutes to complete."}, {"url": "https://en.wikipedia.org/wiki/Psychopathy", "passage_text": "Psychopathy (/saɪˈkɒpəθi/), also known as—though sometimes distinguished from— sociopathy (/soʊsiˈɒpəθi/), is traditionally defined as a personality disorder characterized by enduring antisocial behavior, diminished empathy and remorse, and disinhibited or bold behavior. "}, {"url": "http://theartofcharm.com/empowerment/know-im-not-psychopath-sociopath-idiot/", "passage_text": "Knowing if you’re a psychopath or a sociopath is the easy part. It’s knowing if you’re an idiot that can be harder, since the signs are subtler and often deliberately hidden. No one thinks they’re an idiot, and yet we live in a world that’s apparently full of them. "}, {"url": "http://www.bibliotecapleyades.net/sociopolitica/sociopol_ponerology15c.htm", "passage_text": "The psychopath can also often identify himself as a revolutionary. On the flip side, the psychopath also often paints a picture of himself as the downcast anti-hero (his own worst enemy type) and some like to see themselves as lone-wolves. The psychopath may even claim he is sensitive and profound, but inside he is nothing but emptiness and greed. Most psychopaths are very arrogant and cocky. However, when charming a potential victim, they say all the right things and make you believe they are kind-hearted souls; not always, but often enough. The truth is, psychopaths are not altruistic and do not really care about friendships or ties."}, {"url": "http://cassiopaea.com/cassiopaea/psychopath_2.htm", "passage_text": "Most victims of the psychopath only see what they want to see, initially. That is why Field says, Naivete is the great enemy.Many also cling to the belief that their loved one (the psychopath) simply has a few problems just like anyone else, not the symptoms of a personality disorder. [Black, 59]. If you leave the psychopath, you can expect that he will either be the type who doesn't make any noise but ruins your reputation by spreading lies, or you can expect a lot of open manipulation (a final attempt to gain power and control)."}]