[{"url": "https://en.wikipedia.org/wiki/Corporate_welfare", "passage_text": "Corporate welfare is a term that analogizes corporate subsidies to welfare payments for the poor."}, {"url": "http://www.cato.org/publications/policy-analysis/corporate-welfare-state-how-federal-government-subsidizes-us-businesses", "passage_text": "For the purposes of this study, “corporate welfare” is defined as any federal spending program that provides payments or unique benefits and advantages to specific companies or industries. Supporters of corporate welfare programs often justify them as remedying some sort of market failure."}, {"url": "http://www.investordictionary.com/definition/corporate-welfare", "passage_text": "Corporate welfare. Corporate welfare is a pejorative term used to describe a government's bestowal of grants and/or tax breaks on one or more corporations."}, {"url": "http://www.welfareinfo.org/corporate/", "passage_text": "Corporate Welfare. Corporate welfare is a general term that refers to financial assistance, tax advantages, or other support given to corporations and other business entities by the United States government."}, {"url": "http://www.definitions.net/definition/corporate%20welfare", "passage_text": "The term is often used to describe a government's bestowal of money grants, tax breaks, or other special favorable treatment on corporations or selected corporations, and implies that corporations are much less needy of such treatment than the poor."}, {"url": "http://www.thefreedictionary.com/corporate+welfare", "passage_text": "Financial aid, such as a subsidy or tax break, provided by a government to corporations or other businesses, especially when viewed as wasteful or unjust: critics who say that letting big companies raise private stock on public land amounts to corporate welfare (Frank Clifford). n."}, {"url": "http://www.davemanuel.com/investor-dictionary/corporate-welfare/", "passage_text": "Welfare is defined in the dictionary as aid in the form of money or necessities to those in need. Corporate welfare can include tax breaks and grants, amongst other things. Proponents of giving grants and tax breaks to corporations argue that they are necessary in order to lure companies to a country or state."}, {"url": "https://en.wikipedia.org/wiki/Corporate_welfare", "passage_text": "The label of corporate welfare is often used to decry projects advertised as benefiting the general welfare that spend a disproportionate amount of funds on large corporations, and often in uncompetitive, or anti-competitive ways."}]