[{"url": "https://en.wikipedia.org/wiki/Polyurethane", "passage_text": "Polyurethane synthesis, wherein the urethane groups — NH-(C=O)-O-link the molecular units. Polyurethane (PUR and PU) is a polymer composed of organic units joined by carbamate (urethane) links. Polyurethane products often are simply called “urethanes”, but should not be confused with ethyl carbamate, which is also called urethane."}, {"url": "https://answers.yahoo.com/question/index?qid=20090219201312AAohR7m", "passage_text": "Report Abuse. PU synthetic leather (also known as bi-cast leather, bycast leather or artificial leather, sometimes described as split leather) is a material made with asplit leather backing covered with a layer of polyurethane (hence the term PU leather) that is applied to the surface and then embossed. There you go. I think it's pretty hard to tell what the term PU leather means now, or even PU synthetic leather. Both terms can mean different things to different people and different firms. What is clear is what bicast leather means, and what faux leather means."}, {"url": "https://en.wikipedia.org/wiki/Pu_pu_platter", "passage_text": "Pu pu platter. From Wikipedia, the free encyclopedia. A Pu Pu platter, Pu-Pu platter or pupu platter is a tray of American Chinese cuisine or Hawaiian cuisine consisting of an assortment of small meat and seafood appetizers. The earliest known print reference to a pupu platter served at a Chinese restaurant is from 1969. Later, other types of restaurants used pu pu platter to mean an appetizer combination platters. However, pu pu platters are currently more closely associated with American Chinese restaurants."}, {"url": "http://www.webmd.com/vitamins-supplements/ingredientmono-1169-PU-ERH%20TEA.aspx?activeIngredientId=1169&activeIngredientName=PU-ERH%20TEA", "passage_text": "PU-ERH TEA Overview Information. Pu-erh tea is made from the leaves and stems of the Camellia sinensis plant. This is the same plant that is used for making green, oolong, and black teas. Though the same source plant is used, the different teas are made by using different processes. The body breaks down the caffeine in pu-erh tea to get rid of it. Fluvoxamine (Luvox) can decrease how quickly the body breaks down caffeine. Taking pu-erh tea along with fluvoxamine (Luvox) might cause too much caffeine in the body, and increase the effects and side effects of caffeine."}, {"url": "http://www.webmd.com/vitamins-supplements/ingredientmono-1169-PU-ERH%20TEA.aspx?activeIngredientId=1169&activeIngredientName=PU-ERH%20TEA", "passage_text": "Pregnancy and breast-feeding: If you are pregnant or breast-feeding, pu-erh tea in small amounts is probably not harmful. However, do not drink more than two cups of pu-erh tea in a day. Too much caffeine might cause miscarriage, premature delivery, low birth weight, and harm to the baby. The body breaks down the caffeine in pu-erh tea to get rid of it. Fluvoxamine (Luvox) can decrease how quickly the body breaks down caffeine. Taking pu-erh tea along with fluvoxamine (Luvox) might cause too much caffeine in the body, and increase the effects and side effects of caffeine."}, {"url": "https://en.wikipedia.org/wiki/Polyurethane", "passage_text": "Polyurethane polymers are traditionally and most commonly formed by reacting a di-or poly isocyanate with a polyol. Polyurethane products often are simply called “urethanes”, but should not be confused with ethyl carbamate, which is also called urethane."}, {"url": "http://www.abbreviations.com/PU", "passage_text": "plutonium, Pu, atomic number 94 (noun). a solid silvery grey radioactive transuranic element whose atoms can be split when bombarded with neutrons; found in minute quantities in uranium ores but is usually synthesized in nuclear reactors; 13 isotopes are known with the most important being plutonium 239. "}, {"url": "http://www.thefreedictionary.com/Pu", "passage_text": "1. Pu-a solid silvery grey radioactive transuranic element whose atoms can be split when bombarded with neutrons; found in minute quantities in uranium ores but is usually synthesized in nuclear reactors; 13 isotopes are known with the most important being plutonium 239. atomic number 94, plutonium."}, {"url": "https://answers.yahoo.com/question/index?qid=20090219201312AAohR7m", "passage_text": "I am going to about PU Leather PU leather, sometimes described as split leather) is a material made with a split leather backing covered with a layer of polyurethane (hence the term PU leather) that is applied to the surface and then embossed. There you go. I think it's pretty hard to tell what the term PU leather means now, or even PU synthetic leather. Both terms can mean different things to different people and different firms. What is clear is what bicast leather means, and what faux leather means."}, {"url": "http://clair.si.umich.edu/clair/corpora/chemical/Plutonium", "passage_text": "It has the symbol Pu and the atomic number 94. It is the element used in most modern nuclear weapons. The most significant isotope of plutonium is 239 Pu, with a half-life of 24,100 years. It can be made from natural uranium and is fissile. The most stable isotope is 244 Pu, with a half-life of about 80 million years, long enough to be found in extremely small quantities in nature."}]