[{"url": "http://www.newadvent.org/cathen/08594b.htm", "passage_text": "This archdiocese embraces within its territories an archdiocese and a diocese founded by St. Stephen of Hungary in 1010. The question of the foundation of, and of the relations between, Kalocsa and Bacs was for a long time uncertain. George Fejer fejér was of opinion That. St stephen Founded kalocsa And bacs as independent, sees and that Subsequently. St ladislau Raised bacs to archiepiscopal rank in, 1093 and united it With. kalocsa "}, {"url": "http://lokalwear.com/collections/kalocsa-lace-tee/", "passage_text": "Originated in the Southern town of Kalocsa, the richelieu lace was introduced to the local craftswomen in the early 1900s, who adapted it with fervor and a traditional local folk flair. The Kalocsa embroidered lace remains popular in Hungary today. "}, {"url": "https://en.wikipedia.org/wiki/Kalocsa", "passage_text": "Kalocsa as a settlement growing paprika is mentioned for the first time in a document of the Archiepiscopal Arch Eves of Kalocsa, dated 1729. From the middle of the 19th century paprika was not milling in ship-mills or dry mills because mills became operated by vapour gas, oil and electricity. The Asztrik Square is named after the first archbishop of Kalocsa (see the history part of this text). The building of the Convent is surrounded by horse-chestnuts. Its north side-wing with the church was built in 1860. The second floor was put on in 1913 and since that time it got its romantic shape."}, {"url": "https://en.wikipedia.org/wiki/Kalocsa", "passage_text": "Kalocsa is the Episcopal see of one of the four Catholic archbishops of Hungary. Amongst its buildings are a fine cathedral, the archiepiscopal palace, an astronomical observatory, a seminary for priests, and colleges for training teachers. The Asztrik Square is named after the first archbishop of Kalocsa (see the history part of this text). The building of the Convent is surrounded by horse-chestnuts. Its north side-wing with the church was built in 1860. The second floor was put on in 1913 and since that time it got its romantic shape."}, {"url": "http://www.countypress.hu/touristinfo/uk/kalocsa.htm", "passage_text": "Kalocsa. Paprika Day of Kalocsa. Kalocsa is a one thousand-year-old town on the left bank of River Danube. Our first king, Saint Stephen founded the Archbishopric of Kalocsa here. From that time the town became an economic, administrational, ecclesiastic and cultural centre. Nowadays it is famous for its Baroque buildings and monuments, its folk art and red pepper (paprika). The Paprika Days is not only the holiday of visitors coming to Kalocsa but also the holiday of all local families producing it and processors as well as companies that try to do their best to make a reputation of red gold both in Hungary and abroad. The Hungarians sit to the table whenever they are happy or sad."}, {"url": "http://www.1hungary.com/info/kalocsa/", "passage_text": "Town with 18,000 inhabitants at the southern edge of the Solt plain. Kalocsa was made the seat of an archdiocese here in 1009. Its first archbishop was Bishop Asztrik, who brought the crown to the king from the pope. The Archbishop´s Palace was built on the place of the former castle in baroque style from 1760 to 1766. Kalocsa is the centre of Hungarian red paprika production and processing. The history of paprika production is shown in the Paprika Museum. Remarkable programmes of the town are the Blue Bird Festival (between June 8 and 10) and the Paprika Days (on 22 September)."}, {"url": "http://www.wegmans.com/webapp/wcs/stores/servlet/ProductDisplay?productId=757170&storeId=10052&langId=-1", "passage_text": "Ingredients. 5 oz. Kalocsa Sweet Hungarian Style Paprika is a mildly pungent spice ground from dried, sweet red peppers. Use it as a garnish for vibrant color or as seasoning to complement the flavor of eggs, fish, pasta, potatoes, and of course, goulash. Pure Paprika."}, {"url": "http://europeantraveler.net/archives/taste-of-europe/paprika.php", "passage_text": "Kalocsa paprika is often packaged for retail sale in small cloth bags sometimes stamped with the image of a ripe pepper plant, or decorated with red, white and green ribbons, the colors of the Hungarian flag. Paprika also comes in less expensive, but still colorful, tin boxes and even cheaper cellophane or plastic bags. "}, {"url": "https://en.wikipedia.org/wiki/Kalocsa", "passage_text": "The residents of Kalocsa and its wide-spreading communal lands are chiefly employed in the cultivation of paprika, fruit, flax, hemp and cereals, in the capture of waterfowl and in fishing. Kalocsa is one of the oldest towns in Hungary. The present archbishopric, founded about 1135, is a development of a bishopric said to have been founded in 1000 by King Stephen the Saint. The Asztrik Square is named after the first archbishop of Kalocsa (see the history part of this text). The building of the Convent is surrounded by horse-chestnuts. Its north side-wing with the church was built in 1860. The second floor was put on in 1913 and since that time it got its romantic shape."}]