[{"url": "http://www.thermoplasticprocesses.com/products-petg.html", "passage_text": "Excelon PETG tube, rod, and wall products offer the same clear Excelon quality as standard Acrylic with a substantially higher success rate when machining than cast Acrylic. With excellent impact strength and easy bond-ability, Excelon PETG ² rod, tube and profiles are the premier choice for any fabrication or display assembly."}, {"url": "http://k-mac-plastics.net/petg-tubes.htm", "passage_text": "PETG Tubing. Chemical Resistance Chart. PETG has a substantially higher success rate when machining than cast acrylic. With excellent impact strength and easy bondability, Petg tubes and profiles are the premier choice for any fabrication or display assembly. Petg stands up to the demands and rigors of fabrication. Drill it, thread it, mill it, machine it and polish it. PETG is the heavy wall mechanical tubing that is less expensive than cast acrylic and does not require any pre or post-annealing, saving time and money. Also available in a UV stabilized formulation."}, {"url": "http://www.polymerplastics.com/transparents_petg.shtml", "passage_text": "PETG / Spectar® Co-polyester sheet is a thermoplastic sheet used in engineering applications. PETG offers the capability to produce complex shapes, precise details, deep draws and compound curves without worrying about durability. It's easily formed, die-cut and punched. PETG sheet has high stiffness, hardness, and toughness as well as good impact strength. Unstressed PETG exhibits good resistance to dilute aqueous solutions of mineral acids, bases, salts, and soaps. PETG also has good resistance to aliphatic hydrocarbons, alcohols, and a variety of oils."}, {"url": "http://petg-rods-tubes.com/", "passage_text": "PETG Tubes and Rods have excellent bondability and machines easier than acrylics. Petg stands up to the demands and rigors of fabrication. Drill it, thread it, mill it, machine it and polish it. Robust and clear, Petg will not gum up your machining or cutting equipment during processing. "}, {"url": "http://www.visipak.com/polycarbonate-tubes.html", "passage_text": "PETG Tubing-The Clear Alternative to Polycarbonate Tubes. Polycarbonate is branded under the familiar name of Lexan and is often extruded into tubes, rods and other profiles. While polycarbonate tubes are used in a wide variety of applications, there is another option that is often overlooked: PETG Tubes. PETG, like polycarbonate, is a thermoplastic or polymer that turns to liquid when heated and hardens to a very glassy state when cooled. PETG (polyethylene terephthalate glycol) shares many characteristics with polycarbonate. Both are highly impact resistant, possess excellent clarity"}, {"url": "http://www.polymerplastics.com/transparents_petg.shtml", "passage_text": "PETG, glycol-modified polyethylene terephthalate, is a copolyester that is a clear amorphous thermoplastic. PETG sheet has high stiffness, hardness, and toughness as well as good impact strength. Unstressed PETG exhibits good resistance to dilute aqueous solutions of mineral acids, bases, salts, and soaps. PETG also has good resistance to aliphatic hydrocarbons, alcohols, and a variety of oils."}, {"url": "http://petg-rods-tubes.com/petg-tubes.htm", "passage_text": "PETG Tubing has a substantially higher success rate when machining than cast acrylic. With excellent impact strength and easy bondability, Petg tubes and profiles are the premier choice for any fabrication or display assembly. Petg stands up to the demands and rigors of fabrication. Drill it, thread it, mill it, machine it and polish it. PETG is the heavy wall mechanical tubing that is less expensive than cast acrylic and does not require any pre or post-annealing, saving time and money. PETG Straight Tubing-Clear 6 ft standard lengths."}, {"url": "http://lairdplastics.com/product/materials/petg", "passage_text": "Polyethylene terephthalate (aka. PET, PETE, PETG) is a plastic resin of the polyester family that is used to make beverage, food and other liquid containers, as well as for some other thermoforming applications. PETG is a clear amorphous thermoplastic that can be injection molded or sheet extruded. It can be colored during processing. PETG can be semi-rigid to rigid, depending on its thickness, and it is very lightweight. The main virtue of PETG is that it is fully recyclable. Unlike other plastics, its polymer chains can be recovered for additional useIt makes a good gas and fair moisture barrier, as well as a good barrier to alcohol and solvents."}]