[{"url": "http://www.babynamewizard.com/baby-name/girl/brianna", "passage_text": "Origin of the name Brianna: Feminine form of Brian, which is believed to be of Celtic origin and of the meaning strength.. From A World of Baby Names by Teresa Norman. "}, {"url": "http://www.babynamespedia.com/meaning/Brianna/f", "passage_text": "Brianna's language of origin is Celtic. It is predominantly used in English and Irish. It is derived from the word brigh brígh with the 'meaning, strength, power'. Force the name was coined recently in the late 20th. Century brianna is a form of The English. abrianna Brianna's language of origin is Celtic. It is predominantly used in English and Irish. It is derived from the word brigh brígh with the 'meaning, strength, power'. Force the name was coined recently in the late 20th. century"}, {"url": "http://www.thinkbabynames.com/meaning/0/Briana", "passage_text": "Briana /bri-ana/ [3 sylls.] as a name for girls. The name Briana means high, noble, exalted. Briana is an alternate form of Brianna (Irish, Gaelic, Celtic): May also possibly mean strong. Brena is a familiar surname. See also Briley. "}, {"url": "http://babynames.allparenting.com/list/Irish_Baby_Names/Brianna/details/", "passage_text": "Baby names meanings search results: The name Brianna is a baby girl name. The name Brianna comes from the Irish origin. In Irish The meaning of the name Brianna is: Strong. "}, {"url": "https://en.wikipedia.org/wiki/Brianna", "passage_text": "Brianna, Breanna, Breanne, Brianne, Brina, and Bryanna. are feminine given names. Brianna is a feminine English language form of the masculine Irish language name Brian. The name is a relatively modern one and was occasionally used in England from about the 16th century and on. In recent years, the name has become more and more popular (especially in the United States). Variant spellings of Brianna include: Bryanna, Breanna (mainly in the United States), Brianne, and Brina. Breanne is variant form of Breanna. Other variant spellings of the name include Briana. "}, {"url": "http://www.thinkbabynames.com/meaning/0/Brianna", "passage_text": "Brianna /bri-an-na/ [3 sylls.] as a girls' name is pronounced bree-AHH-ah. It is of Irish, Gaelic and Celtic origin, and the meaning of Brianna is high, noble, exalted. May also possibly mean strong. A contemporary feminine form of Brian, found occasionally in England since the 16th century. See also Brionna. Brianna is a very popular first name for females (#738 out of 4276, Top 17%) but a unique last name for all people. (2000 U.S. Census). Displayed below is the birth name popularity of Brianna for girls"}, {"url": "http://www.sheknows.com/baby-names/name/brianna", "passage_text": "The name Brianna is an Irish baby name. In Irish the meaning of the name Brianna is: Strong. American Meaning: The name Brianna is an American baby name. In American the meaning of the name Brianna is: Strong. Celtic Meaning: The name Brianna is a Celtic baby name. In Celtic the meaning of the name Brianna is: Strong. She ascends."}, {"url": "http://www.babynamewizard.com/baby-name/girl/breanna", "passage_text": "Origin of the name Brianna: Feminine form of Brian, which is believed to be of Celtic origin and of the meaning strength.. From A World of Baby Names by Teresa Norman. "}, {"url": "http://www.ourbabynamer.com/meaning-of-Brianna.html", "passage_text": "What does Brianna mean, popularity, numerology and more. The name Brianna is of Irish origin. The meaning of Brianna is strong, honorable. It is also of Celtic and origin, where its meaning is . Irish names usually contain a given, middle and family name. Given names frequently have their source in the Roman Catholic faith, or are derived from the traditional Gaelic. Some Gaelic or old Irish names date back to the Celtic origins of Gaelach (Ireland)."}]