[{"url": "http://www.webmd.com/epilepsy/guide/epilepsy-in-children", "passage_text": "The siblings of children with epilepsy, even very young kids, may notice things about the seizures that parents may not. Also, you may want to keep a video camera handy so that you can tape your child during a seizure. In most cases -- about seven out of 10 -- the cause of the seizures can't be identified. This type of seizure is called idiopathic or cryptogenic, meaning that we don't know what causes them. The problem may be with an uncontrolled firing of neurons in the brain that triggers"}, {"url": "http://www.epilepsy.com/learn/epilepsy-101/who-gets-epilepsy", "passage_text": "1 1 in 26 people will develop epilepsy in their lifetime. 2  Factors such as other health conditions, age, and race may make developing epilepsy and seizures more likely. 3  Epilepsy and seizures can develop in any person at any age. 4  Seizures and epilepsy are more common in young children and older people. 1 Epilepsy and seizures can develop in any person at any age. 2  1 in 26 people will develop epilepsy in their lifetime. 3  Factors such as other health conditions, age, and race may make developing epilepsy and seizures more likely. 4"}, {"url": "http://www.uichildrens.org/epilepsy-in-young-children/", "passage_text": "It is important to treat epilepsy for several reasons. Untreated epilepsy places children at increased risk of accidents, such as drowning, head injury from a fall, or choking. Frequent seizures may create both social and academic disadvantages for children. Most seizures do not cause brain damage. Sometimes, however, it can be difficult to control generalized seizures. Sometimes a child having this kind of seizure will need intensive care to prevent brain damage or death."}, {"url": "http://www.epilepsy.com/learn/epilepsy-101/who-gets-epilepsy", "passage_text": "1 Epilepsy and seizures can develop in any person at any age. 2  Seizures and epilepsy are more common in young children and older people. 3  About 1 in 100 people in the U.S. has had a single unprovoked seizure or has been diagnosed with epilepsy. 1 Epilepsy and seizures can develop in any person at any age. 2  1 in 26 people will develop epilepsy in their lifetime. 3  Factors such as other health conditions, age, and race may make developing epilepsy and seizures more likely. 4 "}, {"url": "http://www.webmd.com/epilepsy/guide/epilepsy-in-children", "passage_text": "Diagnosing a Seizure in a Child. Diagnosing a seizure can be tricky. Seizures are over so quickly that your doctor probably will never see your child having one. The first thing a doctor needs to do is rule out other conditions, such as nonepileptic seizures. In most cases -- about seven out of 10 -- the cause of the seizures can't be identified. This type of seizure is called idiopathic or cryptogenic, meaning that we don't know what causes them. The problem may be with an uncontrolled firing of neurons in the brain that triggers a seizure."}, {"url": "http://www2.massgeneral.org/childhoodepilepsy/child/", "passage_text": "Because of the prevalence of learning issues and other developmental problems among children with epilepsy, experts now acknowledge the importance of treating the whole child, rather than simply treating the child's seizures. Even when seizures are well controlled, epilepsy may present a host of other issues that can impact a child's development and ability to function normally. Cognitive impairments that affect language, memory, attention, and other abilities critical to normal development are common among people with epilepsy."}, {"url": "https://www.epilepsy.org.uk/info/developing-epilepsy-later-life", "passage_text": "Introduction. Epilepsy can begin at any age, but you are more likely to develop epilepsy when you are young or in later life. Around one in every four people who are newly diagnosed with epilepsy is over the age of 65. Many of the issues that affect people with epilepsy can be the same for anyone, no matter what their age. "}, {"url": "http://www.epilepsy.com/learn/epilepsy-101/who-gets-epilepsy", "passage_text": "1 Factors such as other health conditions, age, and race may make developing epilepsy and seizures more likely. 2  Epilepsy and seizures can develop in any person at any age. 3  Seizures and epilepsy are more common in young children and older people. 1 Epilepsy and seizures can develop in any person at any age. 2  1 in 26 people will develop epilepsy in their lifetime. 3  Factors such as other health conditions, age, and race may make developing epilepsy and seizures more likely. 4"}, {"url": "http://www.epilepsy.com/learn/epilepsy-101/who-gets-epilepsy", "passage_text": "1 Each year, about 48 of every 100,000 people will develop epilepsy. 2  However, seizures may occur more often in different age groups (very young and older people), in different races, and in different areas of the world. 3  At any one point in time, between 2.2 and 3 million people are treated for epilepsy. 1 Epilepsy and seizures can develop in any person at any age. 2  1 in 26 people will develop epilepsy in their lifetime. 3  Factors such as other health conditions, age, and race may make developing epilepsy and seizures more likely. 4 "}]