[{"url": "http://www.thefreedictionary.com/fluctuation", "passage_text": "A little fluctuation of the wind now carried the path of the forest fire to the north, then blew back and the flames nearly stood still as though held in leash by some master hand. "}, {"url": "http://financial-dictionary.thefreedictionary.com/Fluctuation", "passage_text": "A little fluctuation of the wind now carried the path of the forest fire to the north, then blew back and the flames nearly stood still as though held in leash by some master hand. Tarzan of the Apes by Burroughs, Edgar Rice View in context. "}, {"url": "http://encyclopedia2.thefreedictionary.com/fluctuation", "passage_text": "By using Gibbs distributions it is possible to calculate the fluctuations in a state of statistical equilibrium for systems that are under different physical conditions. Here, the fluctuations are expressed in terms of equilibrium thermodynamic parameters and the derivatives of thermodynamic potentials. It is possible to find not only the fluctuations of quantities xi but also the correlations between fluctuations, which define the interrelation of the fluctuations; it may be noted that only in the case of statistically independent quantities."}, {"url": "http://medical-dictionary.thefreedictionary.com/Fluctuation", "passage_text": "A little fluctuation of the wind now carried the path of the forest fire to the north, then blew back and the flames nearly stood still as though held in leash by some master hand. Tarzan of the Apes by Burroughs, Edgar Rice View in context. By this fluctuation the pond asserts its title to a shore, and thus the shore is shorn, and the trees cannot hold it by right of possession. Walden & on the Duty of Civil Disobedience by Thoreau, Henry David"}, {"url": "http://www.merriam-webster.com/dictionary/fluctuate", "passage_text": "Full Definition of FLUCTUATE. intransitive verb. 1. : to shift back and forth uncertainly. 2. : to ebb and flow in waves. transitive verb. : to cause to fluctuate. — fluc·tu·a·tion \\ˌflək-chə-ˈwā-shən, -chue-chü-\\ ˈā. — noun·fluc·tu·a·tion \\-al, -shnəl-shə\\ nəl. adjective "}, {"url": "https://en.wikipedia.org/wiki/Fluctuation_theorem", "passage_text": "The fluctuation theorem (FT), which originated from statistical mechanics, deals with the relative probability that the entropy of a system which is currently away from thermodynamic equilibrium (i.e., maximum entropy) will increase or decrease over a given amount of time. The mathematical proof of the Fluctuation Theorem and in particular the Second Law Inequality shows that, given a non-equilibrium starting state, the probability of seeing its entropy increase is greater than the probability of seeing its entropy decrease-see The Fluctuation Theorem from Advances in Physics 51: 1529."}, {"url": "http://www.businessdictionary.com/definition/fluctuation.html", "passage_text": "I studied the chart and noticed a definite fluctuation between two variables that caused a lot of chaos in reality. 11 people found this helpful. Roger noticed another sharp fluctuation in the sales figures and wondered to himself what could be responsible for such deviations. The fluctuation in the demand was seasonal so we were planning for the change in the nature of our business."}, {"url": "http://medical-dictionary.thefreedictionary.com/Fluctuation", "passage_text": "fluctuation. (fluk´choowā´shən), n a wavelike motion produced in soft tissues in response to palpation or percussion. Fluctuation is caused by a collection of fluids or exudates in the tissues. By this fluctuation the pond asserts its title to a shore, and thus the shore is shorn, and the trees cannot hold it by right of possession. Walden & on the Duty of Civil Disobedience by Thoreau, Henry David View in context."}, {"url": "http://www.definitions.net/definition/fluctuation", "passage_text": "Fluctuation (noun). a wavering; unsteadiness; as, fluctuations of opinion; fluctuations of prices. Fluctuation (noun). the motion or undulation of a fluid collected in a natural or artifical cavity, which is felt when it is subjected to pressure or percussion. Wiktionary (0.00 / 0 votes) Rate this definition: fluctuation (Noun). A motion like that of waves; a moving in this and that direction. the fluctuations of the sea. fluctuation (Noun). A wavering; unsteadiness."}]