[{"url": "https://en.wikipedia.org/wiki/Primidone", "passage_text": "Primidone is not the only anticonvulsant used for essential tremor; the others include topiramate (Topamax) and gabapentin (Neurontin). Other pharmacological agents include alprazolam (Xanax), clonazepam (Klonopin), atenolol, sotalol, nadolol, clozapine, nimodipine, and botilinum toxin A. Primidone converts to phenobarbital and PEMA; it is still unknown which exact cytochrome P450 enzymes are responsible. The phenobarbital, in turn, is metabolized to p-hydroxyphenobarbital."}, {"url": "http://www.everydayhealth.com/drugs/primidone", "passage_text": "Primidone is the generic form of the brand-name drug Mysoline, which is used to treat and prevent seizures. The medicine can be used alone or combined with other treatments. It’s also used to treat essential tremor and other neurological conditions. Primidone is in a class of drugs known as anticonvulsants. It works by reducing abnormal electrical activity in the brain."}, {"url": "http://www.mayoclinic.org/drugs-supplements/primidone-oral-route/description/DRG-20065638", "passage_text": "Primidone is used alone or in combination with other medicines, to control seizures (convulsions) in the treatment of epilepsy. This medicine is an anticonvulsant that works in the brain tissue to stop seizures. This medicine is available only with your doctor's prescription. "}, {"url": "http://epilepsy.emedtv.com/primidone/what-is-primidone-used-for.html", "passage_text": "Primidone uses mainly consist of the treatment of grand mal and partial seizures in adults and children with epilepsy. Primidone (Mysoline ®) is a prescription medication used to treat epilepsy. "}, {"url": "http://www.1800petmeds.com/Primidone-prod10240.html", "passage_text": "It is important to continue giving primidone to prevent seizures from recurring. Primidone may cause drowsiness or dizziness. What is Primidone: Primidone is used to control seizures in dogs. It is believed that Primidone alters the chemical impulses in the brain that cause seizures. Primidone is a prescription medication available as 250mg scored tablets. The usual dose in dogs is 2.3-6.8 mg/pound per day in 2 or 3 divided doses. "}, {"url": "http://www.webmd.com/drugs/2/drug-8696/primidone-oral/details", "passage_text": "Read the Medication Guide provided by your pharmacist before you start using primidone and each time you get a refill. If you have any questions, ask your doctor or pharmacist. Take this medication by mouth with or without food, usually 3-4 times daily or as directed by your doctor. Do not share this medication with others. Laboratory and/or medical tests (such as primidone blood levels, blood counts, liver/kidney tests) should be performed periodically to monitor your progress or check for side effects. Consult your doctor for more details."}, {"url": "http://drugs.webmd.boots.com/drugs/drug-381-Primidone.aspx", "passage_text": "It should not be used in: patients with allergy to primidone or to any other ingredient in the medicine, patients with acute porphyria (an inherited blood disorder, causing skin blisters, belly pain and brain or nervous system disorders), or severe liver problems. Also see list of precautions and interactions. 1 Primidone is used to treat a number of problems. 2  It is a pyrimidinedione, and is sometimes known as an anticonvulsant. 3  It is used to prevent seizures (fits) and tremors."}, {"url": "https://en.wikipedia.org/wiki/Primidone", "passage_text": "Primidone (INN: desoxyphenobarbital, BAN: desoxyphenobarbitone) is an anticonvulsant of the barbiturate class. It is a structural analog of phenobarbital and related to barbiturate-derivative anticonvulsants. Primidone converts to phenobarbital and PEMA; it is still unknown which exact cytochrome P450 enzymes are responsible. The phenobarbital, in turn, is metabolized to p-hydroxyphenobarbital."}, {"url": "http://www.webmd.com/drugs/2/drug-8696/primidone-oral/details", "passage_text": "Withdrawal from primidone can be severe and include seizures and (rarely) death. To prevent withdrawal reactions, your doctor may reduce your dose gradually. Consult your doctor or pharmacist for more details, and report any withdrawal reactions immediately. Do not share this medication with others. Laboratory and/or medical tests (such as primidone blood levels, blood counts, liver/kidney tests) should be performed periodically to monitor your progress or check for side effects. Consult your doctor for more details."}, {"url": "http://www.webmd.com/drugs/2/drug-8696/primidone-oral/details", "passage_text": "Dosage is based on your medical condition, blood levels of primidone, use of other medications to treat seizures, and response to treatment. It may take several weeks to reach the best dose for you. This medication works best when the amount of drug in your body is kept at a constant level. Do not share this medication with others. Laboratory and/or medical tests (such as primidone blood levels, blood counts, liver/kidney tests) should be performed periodically to monitor your progress or check for side effects. Consult your doctor for more details."}]