[{"url": "https://quizlet.com/4653687/rj-act-iii-flash-cards/", "passage_text": "In Act III, Mercutio and Benvolio get into a conflict with Tybalt. He tries to defuse the situation and to get Tybalt to put his sword away. Tybalt is now his cousin by marriage, and Romeo does not wish to fight with him. "}, {"url": "http://www.sparknotes.com/shakespeare/romeojuliet/section10.rhtml", "passage_text": "The fights between Mercutio and Tybalt and then between Romeo and Tybalt are chaotic; Tybalt kills Mercutio under Romeo’s arm, flees, and then suddenly, and inexplicably, returns to fight Romeo, who kills him in revenge. Passion outweighs reason at every turn. Enraged, Romeo declares that his love for Juliet has made him effeminate, and that he should have fought Tybalt in Mercutio’s place. When Tybalt, still angry, storms back onto the scene, Romeo draws his sword. They fight, and Romeo kills Tybalt."}, {"url": "http://www.gradesaver.com/romeo-and-juliet/q-and-a/how-and-why-did-mercutio-provoked-tybalt-71945/", "passage_text": "Mercutio and Tybalt fought because Tybalt had challenged Romeo to a fight but Mercutio knew that Romeo was not strong enough to fight Tybalt so Mercutio took the burden of fighting Tybalt and eventually dies when he is stabbed by Tybalt under Romeo's arm. Romeo had ran out to block the fight and Mercutio got stabbed. Tybalt leaves, and then returns clearly angry. He is then slain by Romeo and the Prince, Montague, and Capulet and Lady Capulet come out. Romeo exits, and Romeo is banished"}, {"url": "http://www.answers.com/Q/What_is_the_Conflict_between_Romeo_and_Tybalt", "passage_text": "Answered by The Community. Making the world better, one answer at a time. Romeo and Tybalt have a conflict over how Tybalt brutally Murdered Mercutio, and in retaliation Romeo maliciously killed Tybalt for killing his cousin. When he hears Romeo's voice at the Capulet masked ball, to which no Montagues … have been invited, he is outraged and wants to fight him then but is told to quieten down.   Hoever they meet in the street the following day and fight there, which is when Romeo kills Tybalt."}, {"url": "https://en.wikipedia.org/wiki/Tybalt", "passage_text": "Tybalt is the main antagonist in William Shakespeare 's play Romeo and Juliet. He is Lady Capulet's nephew, Juliet 's short-tempered cousin, and Romeo 's rival. Tybalt shares the same name as the character Tibert/Tybalt the Prince of Cats in Reynard the Fox, a point of mockery in the play. As I hate hell, all Montagues, and thee. Have at thee, coward! Later, at the Capulets' ball, Tybalt is the first to recognize Romeo through his disguise, and would kill him if not forbidden by his uncle, Lord Capulet."}, {"url": "http://www.enotes.com/homework-help/how-does-shakespeare-present-conflict-between-475894", "passage_text": "Therefore Romeo accidentally causes Mercutio’s death in the middle of the fight between Tybalt and Mercutio. Shakespeare demonstrates that the conflict between Tybalt and Mercutio grows out of the Montague-Capulet conflict. Tybalt’s problem with Romeo really comes from his being a Montague. When Mercutio and Tybalt get into a duel, they are fighting for honor. As soon as they meet each other on the street, they start insulting each other and it is not long before it turns into a duel, even though fighting has been forbidden by the prince. Tybalt is angry at Romeo."}, {"url": "http://www.enotes.com/homework-help/how-does-shakespeare-present-conflict-between-475894", "passage_text": "The conflict between Tybalt and Mercutio is not personal. They fight because the Capulets and Montagues are fighting. The feud between the Montagues and the Capulets has been going on for a long time. In fact, it has been going on for so long that no one seems to know what started it. When Mercutio and Tybalt get into a duel, they are fighting for honor. As soon as they meet each other on the street, they start insulting each other and it is not long before it turns into a duel, even though fighting has been forbidden by the prince. Tybalt is angry at Romeo."}, {"url": "http://www.answers.com/Q/What_conflict_does_romeo_feel_when_he_comes_upon_Mercutio_and_tybalt_fighting", "passage_text": "Mercutio and Tybalt fought because Tybalt had challenged Romeo to a fight but Mercutio knew that Romeo was not strong enough to fight Tybalt so Mercutio took the burden of fighting Tybalt and eventually dies when he is stabbed by Tybalt under Romeo's arm. Romeo had ran out to block the fight and Mercutio got stabbed. Tybalt leaves, and then returns clearly angry. He is then slain by Romeo and the Prince, Montague, and Capulet and Lady Capulet come out. Romeo exits, and Romeo is banished. No, Tybalt tried to pick a fight with Romeo. Romeo didn't want to fight because he was married to his cousin, Juliet. But when Mercutio saw that Romeo was acting cowardly by n … ot fighting he attempted to stand up for Romeos pride and Challenge Tybalt to a duel."}, {"url": "https://en.wikipedia.org/wiki/Mercutio", "passage_text": "After Romeo receives a death threat from Tybalt, Mercutio expects Romeo to engage Tybalt in a duel. However, Romeo refuses to fight Tybalt, as Tybalt is Juliet's cousin and therefore his kinsman. Mercutio (/mərˈkjuːʃioʊ/ , mur-KYEW-shee-oh) is a fictional character in William Shakespeare 's 1597 tragedy, Romeo and Juliet. He is a close friend to Romeo and Benvolio and a blood relative to Prince Escalus and Count Paris."}, {"url": "http://www.kellybuonauro.com/uploads/8/7/1/5/8715722/_romeo_and_juliet_act_iii.ppt", "passage_text": "Tybalt is now his cousin by marriage, and Romeo does not wish to fight with him. How do Mercutio and Tybalt die? Mercutio is slain by Tybalt (under Romeo's arm), and Tybalt is slain by Romeo (avenging his friend's death). "}]