[{"url": "http://live4x.ru/english/articles.php?id=6809", "passage_text": "Stresam not used for the treatment of patients with a state of shock, functional disorders of the liver and kidneys, as well as myasthenia. Stresam not use in pediatric patients, as well as for the treatment of women during pregnancy and lactation."}, {"url": "https://www.patientslikeme.com/treatments/show/16173-stresam-side-effects-and-efficacy", "passage_text": "Stresam® is an international brand of etifoxine, a nonbenzodiazepine anxiolytic and anticonvulsant drug. It is used in anxiety disorders and to promote peripheral nerve healing."}, {"url": "http://blog.patientslikeme.com/2011/03/19/share-your-experiences-with-stresam/", "passage_text": "Given the prevalence of anxiety disorders, we know there are many others who may have tried Stresam to relieve their anxiousness. If you’ve used Stresam, another formulation of etifoxine or other anti-anxiety medications, we encourage you to share your experiences (including side effects) to help other patients."}, {"url": "https://www.patientslikeme.com/treatments/show/16173-stresam-side-effects-and-efficacy", "passage_text": "PatientsLikeMe would like to remind you that your browser is out of date and many features of the website may not function as expected. Please update your browser for more security and a better experience."}, {"url": "http://live4x.ru/english/articles.php?id=6809", "passage_text": "Stresa-anxiolytic drug containing etifoxine hydrochloride. Stresam can be used as daytime tranquilizer, due to the lack of influence etifoxine hydrochloride speed of psychomotor reactions. For drug Stresam not characteristic withdrawal syndrome and the development of dependence."}, {"url": "http://awakebrain.com/stresam-etifoxine", "passage_text": "As part of the preparation Stresam lactose is present, which should be considered in the appointment of the drug in patients with galactosemia, malabsorption of glucose and galactose, as well as in the case of lactase deficiency. In case of missed doses should not double the dose at the next reception."}]