[{"url": "http://www.answers.com/Q/How_much_do_you_get_paid_at_Publix_for_bagging", "passage_text": "Well, on your first day you can only work 12 hours a week, it depends how old you are. and wage is about $7.50 an hour. so weekly paycheck is about 80 to 90 dollars a week. like i said depends on how old you are. 3 Contributions. ------------------------------------------------------------------- Previous Answer: if you apply for a job at publix, you will probably start off around $6.80 an hour."}, {"url": "http://www.payscale.com/research/US/Employer=Publix_Super_Markets_Inc/Hourly_Rate", "passage_text": "Publix Super Markets Inc offers employees an average of $10.54 per hour, and overtime earnings push that number up to $17.12. How long you've been working primarily drives compensation; however, your role at the company and geography are also reported as secondary influences on salary at Publix Super Markets Inc. High paychecks are not found in Miami, Fla.; in fact, at about $9.24 it is one of the worst-paid cities. Across Publix Super Markets Inc's U.S. offices, employees in the state of Tennessee earn the most, taking home $11.35 per hour."}, {"url": "http://www.xmms.org/qna/How_much_do_14_year_olds_get_paid_at_publix-qna776330.html", "passage_text": "How much do you get paid if you work at publix as a 15 year old in florida. Top Solutions. You want to know how much a 16 year old get paid in autralia. to determine the price a 16 ... 1. You want to know how much a 16 year old get paid in autralia. to determine the price a 16 old get paid in australia. i heard that the initial payment is $250 per month but am increase has been made to $300 a months."}, {"url": "http://www.hireteen.com/supermarkets/publix/", "passage_text": "How Old to Work at Publix. Minimum age of employment at Publix is 14 year old. However, not all of their stores accepts applications from job seekers who are 14 years old due to the positions and shifts available at each location. Job opportunity for 14, 15 and 16 year olds teenagers to work at Publix supermarket, the largest and fastest-growing supermarket chain in the United States."}, {"url": "http://www.indeed.com/cmp/Publix/salaries", "passage_text": "The average Publix salary ranges from approximately $15,000 per year for Customer Service Associate / Cashier to $151,385 per year for IT Manager. Average Publix hourly pay ranges from approximately $7.50 per hour for Front End Manager to $36.40 per hour for Pharmacist. Salary information comes from 3,572 data points collected directly from employees, users, and jobs on Indeed. "}, {"url": "http://www.answers.com/Q/How_much_do_you_get_paid_as_a_14_year_old_worker_at_Publix", "passage_text": "How much do you get paid at Publix for bagging?   Well, on your first day you can only work 12 hours a week, it depends how old you are. and wage is about $7.50 an hour. so weekly paycheck is about 80 to 90 dollars a … week. if you apply for a job at publix, you will probably start off around $6.80 an hour."}, {"url": "http://www.xmms.org/qna/How_much_do_14_year_olds_get_paid_at_publix-qna776330.html", "passage_text": "1. In Australia 16 year old boy will get paid around $16 per an hour when the age is 18 he will get paid up to $18. The wages you received are maybe deffer from place to place and depends on how much hours you are working as a 16 year old boy. 1. You want to know how much a 16 year old get paid in autralia. to determine the price a 16 old get paid in australia. i heard that the initial payment is $250 per month but am increase has been made to $300 a months."}, {"url": "http://www.answers.com/Q/How_much_do_you_get_paid_as_a_14_year_old_worker_at_Publix", "passage_text": "Answer by Brianna Peffley. Confidence votes 615. -------------------------------------------------------------------. Previous Answer: if you apply for a job at publix, you will probably start off around $6.80 an hour. and about $30.90 for a full day if you are 14 years old. -------------------------------------------------------------------. Bree's answer: if you apply for a job at publix, you will probably start off around $6.80 an hour."}]