[{"url": "http://www.webmd.com/diet/guide/fiber-how-much-do-you-need", "passage_text": "The average adult only eats 15 grams of fiber per day. Women need 25 grams of fiber per day, and men need 38 grams per day, according to the Institute of Medicine. Eating more plant foods -- vegetables, beans, fruit, whole grains, and nuts -- is the best way and is one of the major recommendations from the U.S. government's 2010 Dietary Guidelines."}, {"url": "http://www.livestrong.com/article/370487-how-much-soluble-fiber-per-day/", "passage_text": "Total Fiber Needs. The Food and Nutrition Board of the Institute of Medicine assembled an adequate intake, or AI, for total fiber. Adult men should get 30 to 38 grams of fiber each day, while adult women need 21 to 25 grams. During pregnancy and while nursing, however, you should get 28 to 29 grams of total fiber daily. This basic recommendation may be too much or too little, depending on your diet."}, {"url": "http://healthyeating.sfgate.com/many-grams-soluble-fiber-per-day-8084.html", "passage_text": "These total fiber requirements provided by the Institute of Medicine are 21 grams per day for women ages 50 and older, 25 grams for women younger than age 51, 30 grams for men ages 50 and older and 38 grams of total fiber per day for men younger than age 51."}, {"url": "http://www.health.com/health/condition-article/0,,20188703,00.html", "passage_text": "The problem is that 50 grams of fiber per day is a lot of fiber. Most Americans consume only 15 grams every day, according to the American Heart Association, and the American Diabetes Association recommends that people with diabetes eat 25 to 50 grams daily."}, {"url": "http://www.everydayhealth.com/hs/guide-to-daily-fiber/too-much-fiber/", "passage_text": "So just how much fiber do you need? The national fiber recommendations are 30 to 38 grams a day for men and 25 grams a day for women between 18 and 50 years old, and 21 grams a day if a woman is 51 and older. Another general guideline is to get 14 grams of fiber for every 1,000 calories in your diet."}]