[{"url": "http://www.cotf.edu/ete/modules/msese/earthsysFlr/tundra.html", "passage_text": "Arctic Tundra Arctic tundra is found across northern Alaska, Canada, and Siberia. This biome has long cold winters and short cool summers. The Arctic tundra has low precipitation (less than 10 inches per year) and dry winds. These conditions make the Arctic tundra a desert-like climate (see climograph). One unique characteristic of the Arctic tundra is permafrost--ground that is permanently frozen. Because the permafrost has no cracks or pores, nothing can penetrate it--neither plant roots nor water. The surface layer above the permafrost thaws each summer. This layer is called the active layer."}, {"url": "http://www.infoplease.com/ipa/A0769074.html", "passage_text": "Arctic Tundra. The Arctic tundra is a cold, vast, treeless area of low, swampy plains in the far north around the Arctic Ocean. It includes the northern lands of Europe (Lapland and Scandinavia), Asia (Siberia), and North America (Alaska and Canada), as well as most of Greenland."}, {"url": "http://www.ucmp.berkeley.edu/exhibits/biomes/tundra.php", "passage_text": "The tundra biome. Tundra is the coldest of all the biomes. Tundra comes from the Finnish word tunturi, meaning treeless plain. It is noted for its frost-molded landscapes, extremely low temperatures, little precipitation, poor nutrients, and short growing seasons. Dead organic material functions as a nutrient pool."}, {"url": "https://en.wikipedia.org/wiki/Tundra", "passage_text": "There are three types of tundra: arctic tundra, alpine tundra, and Antarctic tundra. In tundra, the vegetation is composed of dwarf shrubs, sedges and grasses, mosses, and lichens. Scattered trees grow in some tundra regions."}, {"url": "http://environment.nationalgeographic.com/environment/habitats/tundra-profile/", "passage_text": "Tundras are among Earth's coldest, harshest biomes. Tundra ecosystems are treeless regions found in the Arctic and on the tops of mountains, where the climate is cold and windy and rainfall is scant. Tundra lands are snow-covered for much of the year, until summer brings a burst of wildflowers."}, {"url": "http://thewildclassroom.com/biomes/arctictundra.html", "passage_text": "Climate In the arctic tundra there are two seasons: winter and summer. In the summer, the sun is present almost 24 hours a day. This sun however, only warms the tundra up to a range of about 3°C to 12°C. In the winter the opposite light conditions are present. There are several weeks where the sun never rises."}]