[{"url": "http://microbewiki.kenyon.edu/index.php/Cholera", "passage_text": "Cholera toxin is an A-B toxin secreted by V. cholerae that causes the host cell to expel large amounts of water and ions. The toxin is made up of five identical B subunits linked to one A subunit."}, {"url": "http://cosmos.ucdavis.edu/archives/2007/cluster7/cabuguason_gleisel.pdf", "passage_text": "The toxin that causes the diarrheal disease cholera is the cholera enterotoxin called choleragen (CT). It has A and B subunit toxins: toxin A is responsible for enzymatic and intracellular functions, while toxin B is responsible for binding the toxin to the eukaryotic cell receptor."}, {"url": "http://www.sumanasinc.com/webcontent/animations/content/diphtheria.html", "passage_text": "GM1. Cholera Toxin The cholera bacterium, Vibrio cholerae, attaches to intestinal epithelial cells and releases cholera toxin. Cholera toxin is an A-B toxin, consisting of a single A subunit (red sphere) and 5 B subunits (shown here as a single green sphere)."}, {"url": "http://www.ebi.ac.uk/interpro/potm/2005_9/Page2.htm", "passage_text": "Cholera Toxin. Action of cholera toxin. See below for description. A, B (cholera toxin subunits); GM1 (GM1 ganglioside receptor); G s a (G protein); AC (adenylate cyclase); G i (G protein); cAMP (cyclic AMP); CFTR (cystic fibrosis transmembrane conductance regulator)."}, {"url": "http://www.ebi.ac.uk/interpro/potm/2005_9/Page1.htm", "passage_text": "Cholera toxin consists of an A subunit coupled to a B subunit: the A subunit consists of an A1 domain containing the enzymatic active site, and an A2 domain that has an a-helical tail, while the B subunit contains five identical peptides that assemble into a pentameric ring surrounding a central pore."}, {"url": "https://www.listlabs.com/products/cholera-toxins/", "passage_text": "View New Customer Application. Produced by Vibrio cholerae, cholera toxin (CT) is a multimeric enterotoxin that transfers ADP-ribose to a G protein, locking adenylate cyclase in an 'on' position."}, {"url": "http://www.cdc.gov/cholera/general/index.html", "passage_text": "Cholera is an acute, diarrheal illness caused by infection of the intestine with the bacterium Vibrio cholerae. An estimated 3-5 million cases and over 100,000 deaths occur each year around the world. The infection is often mild or without symptoms, but can sometimes be severe."}, {"url": "https://www.listlabs.com/products/cholera-toxins/", "passage_text": "Cholera Toxins. Produced by Vibrio cholerae, cholera toxin (CT) is a multimeric enterotoxin that transfers ADP-ribose to a G protein, locking adenylate cyclase in an 'on' position."}]