[{"url": "http://winefolly.com/tutorial/how-many-glasses-bottle-wine/", "passage_text": "1 An average bottle of wine contains 1.65 lbs of wine grapes. 2  A case of 12 bottles of wine weighs about 30–40 lbs. 3  Heavy glass bottles can account for over 50% of total weight of a wine bottle. 4  In 2012, the EU exported 1.57 billion pounds of bottled wine (includes weight of glass) to the US. 1 A case of 12 bottles of wine weighs about 30–40 lbs. 2  Heavy glass bottles can account for over 50% of total weight of a wine bottle. 3  In 2012, the EU exported 1.57 billion pounds of bottled wine (includes weight of glass) to the US."}, {"url": "http://www.answers.com/Q/How_many_syns_is_a_glass_of_wine_on_the_slimming_world_diet", "passage_text": "This depends on the strength of the wine and the size of the glass, though a medium 175ml glass may contain around 2.4 units, whereas a larger (250ml) glass can contain around … 3.5 units. An easy way to calculate the units in wine is to take the % strength (ABV), and multiply by the volume (ml), then divide by 1000, as follows %ABV x ml = X X/1000 = units. So, for 175ml of wine at say 13% strength: 13 x 175= 2275 2275/1000 = 2.275 units."}, {"url": "http://community.babycentre.co.uk/post/a22269785/alcohol_-", "passage_text": "Posted 10/11/2012 Vodka and similar are 2.5 syns for a single measure, so with diet coke you can have a few and still be in your syns. I love wine but tend to just have an occasional glass at home as would have way too many syns if I drink it when out. Posted 10/11/2012 Clear spirits and diet mixers. Wine is ok, can't remember exact syns just that its about 30 for a bottle Beer quite expensive - 9 for a bottle. Steer clear of sweet things like Crabbie's ginger beer."}, {"url": "http://www.socialslimmers.com/syn-values/1445-how-many-syns-bottle-red-wine.html", "passage_text": "Likes: 46. So that's about 4.5 (ish) Syns per small glass and 8.5 syns for a large 250ml glass. I can live with that. Luckily I only had one glass in the end Looks like I'm going to have to either find something else to drink or save up my Syns for the weekends I want a drink. Hahaha I typed the title and just realised that subconsciously I must have already decided to have the bottle I should have asked how many syns in a glass of red wine?"}, {"url": "http://winefolly.com/tutorial/how-many-glasses-bottle-wine/", "passage_text": "1 About 5.5 bunches of grapes go into a bottle of wine. 2  There are 5 bottles in a gallon of wine. 3  In the US, you can legally produce 200 gallons of wine for personal use. 4  There are 295 bottles in a standard wine barrel. 5  About 600 bottles are made with a ton of grapes. 1 A case of 12 bottles of wine weighs about 30–40 lbs. 2  Heavy glass bottles can account for over 50% of total weight of a wine bottle. 3  In 2012, the EU exported 1.57 billion pounds of bottled wine (includes weight of glass) to the US."}, {"url": "http://www.slimmingworld.co.uk/alcohol/weight-management.aspx", "passage_text": "Plus alcohol doesn't have any filling power AND stimulates our appetite — a triple blow for our weight! Our research shows that 83% of people either underestimate or don't know how many calories are in wine and 72% either don't know or underestimate the number of calories in beer."}, {"url": "http://winefolly.com/tutorial/how-many-glasses-bottle-wine/", "passage_text": "1 On average, 2 people can finish a full bottle of wine in 2.5 hours. 2  If you drink a bottle of wine a week for your entire adult life you will consume about 2,970 bottles of wine. 3  If you drink a glass of wine a night every night of your adult life, you will drink an equivalent of 4,160 bottles of wine. 1 A case of 12 bottles of wine weighs about 30–40 lbs. 2  Heavy glass bottles can account for over 50% of total weight of a wine bottle. 3  In 2012, the EU exported 1.57 billion pounds of bottled wine (includes weight of glass) to the US."}, {"url": "http://www.socialslimmers.com/syn-values/633-how-many-syns-bottle-wine.html", "passage_text": "There a few sweeter wines that vary slightly higher in syns but they all seem to average around 28 syns for a bottle of red wine and 26 syns for a bottle white wine. I'm a nice bottle Ruby cabernet kinda person (my OH drinks white wine and soda). I'm saving my syns up this week so thought I'd treat us this weekend!"}, {"url": "http://www.socialslimmers.com/syn-values/633-how-many-syns-bottle-wine.html", "passage_text": "Likes: 2. Tbh I think it can vary quite a bit. I know when I've looked, red wine has ranged from 23 - 29 for a bottle... and thinking about it white varies too (18 - 25 syns), although I do know that a bottle of low alchohol white is about 8 syns. I'm a nice bottle Ruby cabernet kinda person (my OH drinks white wine and soda). I'm saving my syns up this week so thought I'd treat us this weekend!"}]