[{"url": "https://www.sharecare.com/health/thyroid-supplement/synthroid-help-lose-weight", "passage_text": "A Stacy Wiegman, PharmD, Pharmacy, answered. Synthroid should never be used to help you lose weight. Normal doses of Synthroid, which will keep your levothyroxine levels in your body within the normal range, will not cause you to lose any weight. Weight loss only occurs if you take excessively high doses of Synthroid, but these doses can cause serious side effects because of too much levothyroxine in the body."}, {"url": "http://www.livestrong.com/article/497726-weight-loss-with-levothyroxine-medication/", "passage_text": "Levothyroxine is a synthetic thyroid hormone prescribed to treat low thyroid function, also known as hypothyroidism. Part of your endocrine system, your thyroid gland is located at the base of your throat and creates the hormones that control how quickly you use both oxygen and energy -- the basis of your metabolism."}, {"url": "https://www.synthroid.com/support/living-with-hypothyroidism", "passage_text": "SYNTHROID ® (levothyroxine sodium tablets, USP) is a prescription, man-made thyroid hormone that is used to treat a condition called hypothyroidism, except in cases of temporary hypothyroidism, which is usually associated with an inflammation of the thyroid gland (thyroiditis)."}, {"url": "https://answers.yahoo.com/question/index?qid=20120401111600AADlKLz", "passage_text": "So...if I understand you-you are suffering from hypothyroidism. So taking synthroid should help regulate you-and you should find it easier to lose weight. I have a thyroid problem and PCOS (google PCOS-even if you don't have it you should know the symptoms, trust me) and a low carb diet helped me lose 107 pounds. So you can do it. If I can-you can."}, {"url": "https://www.synthroid.com/support/living-with-hypothyroidism", "passage_text": "Thyroid hormones, including SYNTHROID, should not be used either alone or in combination with other drugs for the treatment of obesity or weight loss. In patients with normal thyroid levels, doses of SYNTHROID used daily for hormone replacement are not helpful f"}]