[{"url": "http://www.coral-reef-info.com/types-of-coral-reefs.html", "passage_text": "The fringing reef is by far the most common of the three major types of coral reefs, with numerous examples in all major regions of coral reef development. WHAT IS A LAGOON? - A lagoon-as used in the context of coral reef typology-refers to a comparatively wide band of water that lies between the shore and the main area of reef development, and contains at least some deep portions."}, {"url": "http://www.coral-reef-info.com/types-of-coral-reefs.html", "passage_text": "While patch reefs have sometimes been described as a fourth coral reef type , such comparisons are clearly not appropriate. Rather, patch reefs are more properly considered regular micro-scale reef features of all three of the macro-scale reef types first described by Darwin-fringing reefs, atolls and barrier reefs. WHAT IS A LAGOON? - A lagoon-as used in the context of coral reef typology-refers to a comparatively wide band of water that lies between the shore and the main area of reef development, and contains at least some deep portions."}, {"url": "http://oceanservice.noaa.gov/facts/threecorals.html", "passage_text": "The three main types of coral reefs are fringing, barrier, and atoll. Schools of colorful pennantfish, pyramid, and milletseed butterflyfish live on an atoll reef in the Northwestern Hawaiian Islands. The most common type of reef is the fringing reef. This type of reef grows seaward directly from the shore. They form borders along the shoreline and surrounding islands. When a fringing reef continues to grow upward from a volcanic island that has sunk entirely below sea level, an atoll is formed"}, {"url": "http://www.discovery.com/tv-shows/other-shows/videos/short-attention-four-kinds-of-coral-reef/", "passage_text": "Other Shows. There are 4 main types of coral reef. Watch Dr Stephen Palumbi of Stanford University 'build' each of these different types of reef using a fabulous graphics budget and a sand bar. Comments. Four Kinds of Coral Reef. There are 4 main types of coral reef. Watch Dr Stephen Palumbi of Stanford University 'build' each of these different types of reef using a fabulous graphics budget and a sand bar. 03:10."}, {"url": "http://web.stanford.edu/group/microdocs/typesofreefs.html", "passage_text": "This relationship with land is used to categorize the different types of coral reef. 4 main types of reef exist: 1  Fringing Reef. 2  This is the most common type of reef. 3  They are located very close to land, and often form a shallow lagoon between the beach and the main body of the reef. Coral reefs are underwater rock outcrops covered by a thin layer of living coral polyps. These outcrops can be huge, sometimes over a kilometer (1 km = 0.7 miles) thick and hundreds of kilometers in length."}, {"url": "http://www.unexplainable.net/info-theories/different_types_of_corals_and_coral_reefs.php", "passage_text": "Different Types of Coral Reefs. When hard coral gathers together, it forms reefs. In this category of coral, there are different kinds of reefs that develop. When coral gathers about the coastline, it is referred to as a fringing reef. Soft corals do not form reefs. Examples of this kind of coral include sea whips and sea fingers. Different Types of Coral Reefs When hard coral gathers together, it forms reefs. In this category of coral, there are different kinds of reefs that develop."}, {"url": "http://reefhotspot.com/store/articles/Different-types-of-coral-reefs.php", "passage_text": "Like fringing reefs, barrier reefs have different zones in which different organisms live. Some of the zones in a barrier reef actually see more natural conditions as a threat, and so are designed and will adapt better to change. Typically, you see more types of coral in fish stores coming from a barrier reef. The third type of coral reef is an atoll. Atolls are annular reefs that develop at or near the surface of the sea when islands that are surrounded by reefs subside. Atolls separate a central lagoon and are circular or sub-circular. The different types of coral found throughout the world that you can generally categorize into these general types of coral reefs. While there are thousands of different types of coral found throughout the world, they can be categorized into three different types of coral reefs. The three different types of coral reefs include fringing reefs, barrier reefs and atolls"}, {"url": "http://kids.nceas.ucsb.edu/biomes/coralreef.html", "passage_text": "LOCATION: Coral reefs are generally found in clear, tropical oceans. Coral reefs form in waters from the surface to about 150 feet (45 meters) deep because they need sunlight to survive. The three types of reefs include fringing reefs, barrier reefs, and atolls. "}]