[{"url": "https://www.1040.com/tax-guide/filing-your-taxes-101/how-long-to-keep-tax-records/", "passage_text": "Underreport your income by 25 percent or more, and they can audit you up to six years after you file. If you don’t file, there is no cutoff – you can be audited indefinitely. So for this tax year and two years previous, you need to keep these documents, along a copy of that year’s tax return: 1  Receipts showing cash contributions to charity. 2  Medical expenses you paid, but that weren’t covered by insurance. 3  Work-related expenses you paid, but not paid by your employer, and"}, {"url": "http://www.investopedia.com/ask/answers/020414/how-long-should-i-keep-my-tax-records.asp", "passage_text": "4. You do not file a return: Keep records indefinitely. 5. You file a claim for credit or refund after you file your return: Keep records for three years from the date you filed your original return or two years from the date you paid the tax, whichever is later. 6. You file a claim for a loss from worthless securities or bad debt deduction: Keep records for seven years. 7"}, {"url": "http://blog.turbotax.intuit.com/tax-planning-2/how-long-do-i-need-to-keep-my-tax-records-11641/", "passage_text": "I decided to check the IRS guidelines first. The gist of their guidelines is that you only need to store records for as long as the period of limitations applies. For example, that means that if there is still time for you to amend one of your tax filings, you should keep the records for that tax year. The period of limitations is the period of time in which you can amend your tax return to claim a tax credit or tax refund or that the IRS can assess additional tax"}, {"url": "http://www.bankrate.com/finance/personal-finance/how-long-to-keep-financial-records.aspx", "passage_text": "Records for tax deductions taken. Length of time to keep, and why: Seven years. 1  The IRS has three years from your filing date to audit your return if it suspects good-faith errors. 2  The three-year deadline also applies if you discover a mistake in your return and decide to file an amended return to claim a refund. Bank records. Length of time to keep, and why: From one year to permanently. 1  Go through your checks each year and keep those related to your taxes, business expenses, home improvements and mortgage payments. 2  Shred those that have no long-term importance."}, {"url": "https://www.taxact.com/tax-information/articles/your-tax-documents-what-to-keep-and-shred.asp", "passage_text": "What to keep after filing your taxes and how long. Knowing what information to save and for how long can be confusing. As a general rule of thumb, keep tax returns and related documents for at least three years from the April 15 filing deadline. "}, {"url": "http://publications.usa.gov/epublications/keeprecords/keeprecords.htm", "passage_text": "statements---assuming you are paid in that way---after you check them against your annual W-2 Form. But save cancelled checks that relate directly to an entry on your tax return, and keep all medical bills for 3 years to back up your cancelled checks. The IRS generally keeps records for 6 years. "}, {"url": "http://blogs.hrblock.com/2013/08/18/store-or-shred-how-long-you-should-hang-onto-tax-records/", "passage_text": "In some cases, you may need to hang onto your records longer than three years. For instance, you should plan on keeping tax forms for retirement accounts such as IRAs until seven years after the account is completely wiped out. The three year time period is tied to the IRS statute of limitations. Under the statute of limitations, if you do not file a claim for a refund that you are entitled to, you generally have the later of three years from the date you filed the original return or two years from the date you paid the tax, to file the claim."}, {"url": "http://www.consumerreports.org/cro/news/2014/04/how-long-to-keep-tax-records/index.htm", "passage_text": "You can be randomly audited up to three years after the date you filed the return. But if If you've under-reported your income by 25 percent, the IRS can go six years back, or seven if you claim a loss for bad debt or worthless securities. So keep your tax documents for seven years–just to be safe. (And, by the way, you can be audited at any time if the IRS suspects you of fraud.). Store your tax documents in a secure place, such as a locked file cabinet, a safe, or in password-protected files on your computer"}, {"url": "http://www.nolo.com/legal-encyclopedia/how-long-should-you-keep-business-records.html", "passage_text": "1 Typically, the IRS can come after your business for failing to report income for up to 6 years after your filing if the amount is greater than 25% of your business’s gross income. 2  If you filed for a deduction for a bad debt or worthless security, the IRS suggests you keep your supporting tax records for 7 years. 1 If you filed for a deduction for a bad debt or worthless security, the IRS suggests you keep your supporting tax records for 7 years. 2  Under these circumstances, you may generally wish to retain your supportive records for at least 7 years. 3  Employment Tax Records."}]