[{"url": "http://criminal.lawyers.com/criminal-law-basics/deliberations-in-the-jury-room.html", "passage_text": "In order to return a verdict to the court, the jury must vote and agree to the decisions contained in the verdict. It’s very important to make sure the verdict is accurate. The decisions contained in the verdict will decide whether the defendant will be found guilty or not guilty of a crime. There’s no exact best time the jury has to take a vote during the deliberations. Although jurors can take a vote as soon as they enter the jury room, it’s usually best to first hear all the jurors’ viewpoints and review the evidence and the law."}, {"url": "http://wicourts.gov/services/juror/docs/deliberate.pdf", "passage_text": "A. No, any way is okay. You might vote by raising your hands, by a written ballot, or by a voice ballot. Eventually, a final vote in the jury room will have to be taken with each of you expressing your verdict openly to the other jurors."}, {"url": "http://www.rotlaw.com/legal-library/what-is-jury-deliberation/", "passage_text": "Read more. Before beginning its deliberations, the jury will usually be given detailed instructions by the trial judge. These instructions explain the laws that apply to the case and what the jury should do in applying the law to the facts in order to figure out its verdict. Sometimes, jury instructions can be quite long, particularly in complicated cases with multiple plaintiffs or defendants or cases that are based on complex issues. "}, {"url": "https://ukcrime.wordpress.com/2012/11/18/how-do-juries-decide-a-case/", "passage_text": "The jury will be told when they first retire that they must reach a unanimous verdict. Since 1974 juries have been allowed, in certain circumstances, to reach a majority verdict. This is a verdict of 11-1 or 10-2. If there are 9 or fewer jurors then the verdict has to be unanimous. The minimum period of time that the jury have to have been thinking about their verdict (‘in retirement’) before a jury can return a majority verdict is 2 hours 10 minutes. In practice, Judges will give a jury longer than that."}, {"url": "http://www.americanbar.org/groups/public_education/resources/law_related_education_network/how_courts_work/jurydeliberate.html", "passage_text": "In most cases, though, the jury will be allowed to go home at night. The judge will instruct jurors not to read or view reports of the case in the news. Nor should they consider or discuss the case while outside of the jury room. If the jurors cannot agree on a verdict, a hung jury results, leading to a mistrial. The case is not decided, and it may be tried again at a later date before a new jury. Or the plaintiff or government may decide not to pursue the case further and there will be no subsequent trial. In some states, the jury may take the exhibits introduced into the record and the judge's instructions to the jury room. Sometimes the jury will have a question about the evidence or the judge's instructions. If this happens, the jury will give a note to the bailiff to take to the judge."}, {"url": "https://answers.yahoo.com/question/index?qid=20101110023749AAvSeeq", "passage_text": "Best Answer: There is no minimum or maximum amount of time a jury must deliberate. It is up to the judge. A criminal defendant is not acquitted because of a hung jury. The government can make the person go through another trial. If the parties want a select number of the jurors to agree in a civil case and the current jury is unable to meet that level, the judge will declare a mistrial and the parties will try the case again with a different jury. Source(s): Michael · 5 years ago. Thumbs up."}, {"url": "http://criminal.lawyers.com/criminal-law-basics/deliberations-in-the-jury-room.html", "passage_text": "Voting in the Jury Room. In order to reach a verdict, jurors need to vote on the major issues of the criminal trial. The federal government and most states require a unanimous vote to convict a defendant. There’s no exact best time the jury has to take a vote during the deliberations. Although jurors can take a vote as soon as they enter the jury room, it’s usually best to first hear all the jurors’ viewpoints and review the evidence and the law. The jurors can take a vote in any manner they want, including written ballots and raising their hands"}, {"url": "http://www.oginski-law.com/faqs/how-long-does-a-jury-have-to-deliberate.cfm", "passage_text": "A: The short answer is: As long as they need to. There is no set time limit on how long or short deliberations can take. The judge will allow the jury to take as much time as they need. If that means taking three or four days or a week or even longer to reach a conclusion, they can do that. "}, {"url": "https://answers.yahoo.com/question/index?qid=20101110023749AAvSeeq", "passage_text": "Is there a certain amount of hours before a court case ends with a hung jury because the jury is unable to decide on a persons guilt in a criminal trial or liability in a civil trial. From my understanding, in a criminal trial all the jurors must arrive at the same conclusion while a civil case more than 50% must... If the parties want a select number of the jurors to agree in a civil case and the current jury is unable to meet that level, the judge will declare a mistrial and the parties will try the case again with a different jury. Source(s): Michael · 5 years ago. Thumbs up."}]