[{"url": "https://en.wikipedia.org/wiki/Associate_degree", "passage_text": "Time requirements [edit]. An associate degree is awarded to students who complete 90 quarter credit hours or 60 semester credit hours of schooling. Typically, on a full-time schedule, this requires two years to complete. An associate degree is an undergraduate academic degree awarded by community colleges, junior colleges, technical colleges, bachelor's degree –granting colleges, and universities upon completion of a course of study usually lasting two years."}, {"url": "http://www.bls.gov/ooh/Computer-and-Information-Technology/Computer-support-specialists.htm", "passage_text": "Most computer support specialists have full-time work schedules; however, many do not work typical 9-to-5 jobs. Because computer support is important for businesses, many support specialists must be available 24 hours a day. The wage at which half of the workers in the occupation earned more than that amount and half earned less. Median wage data are from the BLS Occupational Employment Statistics survey. In May 2012, the median annual wage for all workers was $34,750."}, {"url": "http://www.nhsemployers.org/~/media/Employers/Documents/Pay%20and%20reward/FAQs-Specialty-and-Associate-Specialist-Contracts.pdf", "passage_text": "The new associate specialist full time contract is based on 10 Programmed Activities (40 hours) rather than 11 Notional Half Days (38.5 hours). The existing associate specialist scale has 14 pay points; on the new scale the bottom 3 points have been removed. The structure and terms of the specialty doctor and new associate specialist contracts have been largely based on the 2003 consultant contract, but there are some variations between them to take into account the differences between the work of specialty doctor and associate specialist grades and consultants. 2."}, {"url": "http://www.nhsemployers.org/~/media/Employers/Documents/Pay%20and%20reward/FAQs-Specialty-and-Associate-Specialist-Contracts.pdf", "passage_text": "Will my hours need to be rebased? The existing associate specialist contract is based on a notional 38.5 hour week so it will need to be rebased to a 40 hour week, which will mean an addition of 1.5 hours paid work. The structure and terms of the specialty doctor and new associate specialist contracts have been largely based on the 2003 consultant contract, but there are some variations between them to take into account the differences between the work of specialty doctor and associate specialist grades and consultants. 2."}, {"url": "https://www.insidehighered.com/news/2014/04/09/research-shows-professors-work-long-hours-and-spend-much-day-meetings", "passage_text": "Combining work week and weekend, faculty subjects spent about 40 percent of their time on teaching-related tasks, or about 24.5 hours. Ziker points out that 24.5 hours is almost exactly 60 percent of a 40-hour work week. On average, faculty participants reported working 61 hours per week – more than 50 percent over the traditional 40-hour work week. They worked 10 hours per day Monday to Friday and about that much on Saturday and Sunday combined."}, {"url": "http://www.bls.gov/ooh/Computer-and-Information-Technology/Computer-support-specialists.htm", "passage_text": "Work Schedules. Most computer support specialists have full-time work schedules; however, many do not work typical 9-to-5 jobs. Because computer support is important for businesses, support specialists must be available 24 hours a day. As a result, many support specialists must work nights or weekends. The wage at which half of the workers in the occupation earned more than that amount and half earned less. Median wage data are from the BLS Occupational Employment Statistics survey. In May 2012, the median annual wage for all workers was $34,750."}, {"url": "http://work.chron.com/much-should-specialist-make-6952.html", "passage_text": "Salaries. IT specialists made an average $51,820 per year, or $24.91 per hour, as of May 2011 figures, according to the Bureau of Labor Statistics. However, pay rose above $81,190 per year, or $39.03 per hour, or fell to less than $28,980 per year, or $13.93 per hour. Computer systems design offered the most jobs for IT specialists in 2011, with more than 19 percent of the 632,490 positions and average wages of $53,630 per year, or $25.79 per hour, according to the BLS."}, {"url": "http://www.bls.gov/ooh/Computer-and-Information-Technology/Computer-support-specialists.htm", "passage_text": "Most computer support specialists have full-time work schedules; however, many do not work typical 9-to-5 jobs. Because computer support is important for businesses, support specialists must be available 24 hours a day. The wage at which half of the workers in the occupation earned more than that amount and half earned less. Median wage data are from the BLS Occupational Employment Statistics survey. In May 2012, the median annual wage for all workers was $34,750."}]