[{"url": "http://sealmyrecord.com/sealing-expungement/process", "passage_text": "On average, record sealing or record expungement can take anywhere from 5 to 7 months. WARNING: Beware of anyone who tells you they can have your record sealed in less than 5 months. Ask them to put their promise in writing and we expect they won't. There is NO EXPEDITED or RUSH procedure to get this done. The length of time depends on various factors: 1  Whether your case is going to be a sealing or expungement (expungements take a bit more time due to additional legal requirements); 2  How fast the state attorney sign off on the disposition of your case (for expungements only); 3  The county your case is in."}, {"url": "http://sealmyrecord.com/sealing-expungement/process", "passage_text": "1 Whether your case is going to be a sealing or expungement (expungements take a bit more time due to additional legal requirements); 2  How fast the state attorney sign off on the disposition of your case (for expungements only); 3  The county your case is in. The length of time depends on various factors: 1 "}, {"url": "http://www.answers.com/Q/How_long_does_it_take_to_have_a_criminal_record_expunged_in_Illinois", "passage_text": "UK criminal records cannot be expunged but after a certain amount  of time, a criminal record may no longer need to be declared:    The 'Rehabilitation of Offenders Ac … t 1974' allows for  convictions and cautions to become 'spent', after a 'rehabilitation  period'. It varies from charge to charge, and some charges can never be expunged. It also depends upon the outcome. For a dismissed case or a not guilty, the record is eligible to be c … leared immediately. For cases with a supervision, it can be from two to five years after the supervision."}, {"url": "http://www.answers.com/Q/How_long_does_it_take_to_have_a_criminal_record_expunged_in_Illinois", "passage_text": "Getting a record expunged/sealed is a process, sometime taking between 3 to 6 months to get completed. Of course this depends on different factors such as the type of crime it was. It varies from charge to charge, and some charges can never be expunged. It also depends upon the outcome. For a dismissed case or a not guilty, the record is eligible to be c … leared immediately. For cases with a supervision, it can be from two to five years after the supervision."}, {"url": "http://www.clearupmyrecord.com/what-to-expect-how-long-a-record-expungement-can-take.php", "passage_text": "Time to Expunge California Criminal Record. In California, you can apply for a dismissal of criminal charges. If your petition is successful, potential employers cannot ask you about your criminal record. You will need to appear in court to defend your petition. The whole process should take at least eight to ten weeks. Expunging can be a long undertaking. There are forms to fill out. It may take some time to complete them. You may have to gather supplementary evidence to support your case. Then the forms must be processed. This can take a long time depending on the state and how clogged their system i"}, {"url": "http://www.answers.com/Q/How_long_does_it_take_for_your_record_to_be_expunged", "passage_text": "General estimate of the time it takes to have a criminal record expunged in North Carolina can be anywhere from 2-6 months. The thing is even after you do get your record expu … nged it takes time to take effect. It varies from charge to charge, and some charges can never be expunged. It also depends upon the outcome. For a dismissed case or a not guilty, the record is eligible to be c … leared immediately. For cases with a supervision, it can be from two to five years after the supervision."}, {"url": "http://www.recordgone.com/expunge-criminal-records.htm", "passage_text": "Please go to the state page where your record is located. Expungement, the process by which a criminal record is re-opened and changed from convicted to dismissed without guilt, varies from state to state. In order to have a record expunged in most states, it is often required to be a first-time offense. Clearing a criminal record cannot happen overnight, or even right after the conviction. Most often there is a period before a petition can be made to the courts to have an expungement. The need for expungement has greatly increased in the last decade because of the dramatic increase in the use of criminal background checks. For instance, studies showed that about 30 percent of employers conducted criminal background checks in 1994. That number increased to 84 percent by 2004."}, {"url": "http://www.recordgone.com/expungement-pennsylvania/pa-expungement-faq.htm", "passage_text": "Typically, the case takes about five to seven months. We base our estimates of how long a case will take on how long the average is for that service in that state. However, some cases can take less or more time depending on the facts of the case, whether the DA is agreeing or objecting, the age of the case, etc. No, not for most offenses. An expungement will clear the criminal records that relate to the offense. In the case of a DUI for which you received ARD, the Department of Transportation can keep the DUI on your driving record for 10 years."}, {"url": "http://sealmyrecord.com/sealing-expungement/process", "passage_text": "Again, the time to complete a Florida record sealing or record expungement is 5-7 months on average. The length of time depends on various factors: 1  Whether your case is going to be a sealing or expungement (expungements take a bit more time due to additional legal requirements); 2  How fast the state attorney sign off on the disposition of your case (for expungements only); 3  The county your case is in."}]