[{"url": "http://www.paysoncooper.com/101-marketing-strategies/what-is-a-marketing-plan-and-why-is-it-important/", "passage_text": "Why Is A Marketing Plan Important. Frankly, marketing is one of the single most important places you can focus your attention in your business. Particularly if you hope to create a successful business. A marketing plan is basically a way to lay out (to plan) the marketing for your business, your products, and/or your services. It covers everything from information about your target market to specific step-by-step processes you will use to build certain marketing systems and strategie"}, {"url": "http://www.answers.com/Q/What_is_the_importance_of_a_marketing_plan_to_an_organisation", "passage_text": "A properly developed marketing plan is important because: 1. It helps to ensure that marketing activity i spropely focused and integrated. 2. It enables everyone in the organization to know exactly what will happen and when. 3. It enables the business to take advantage of market opportunities. 4. "}, {"url": "http://academic.brooklyn.cuny.edu/economic/friedman/mmmarketingplanning.htm", "passage_text": "Companies should analyze and track what their competitors are doing. It is important to know the strengths, weaknesses, objectives, and strategies of the competition. The marketing plan is an important document used by companies for planning. It is a road map and surveys the business environment, describes problems, threats and opportunities in the industry, contains a marketing strategy, and has financial projections/budgets. Do not confuse a marketing plan with a business plan. "}, {"url": "http://smallbusiness.chron.com/importance-marketing-success-business-589.html", "passage_text": "Considerations. Although marketing is hugely important for a business to succeed, it can also be very expensive. In its first year, a company might spend as much as half of its sales on marketing programs. After the first year, a marketing budget can reach as much as 30 percent--sometimes more--of the annual sale"}, {"url": "http://www.paysoncooper.com/101-marketing-strategies/what-is-a-marketing-plan-and-why-is-it-important/", "passage_text": "So, what is a marketing plan and why is it important? The bottom line is it is a guide to building a successful business, and it’s important because without one, you can get hopelessly lost and never reach your destination which in this case, is a level of success with your business that makes you happy. A marketing plan is basically a way to lay out (to plan) the marketing for your business, your products, and/or your services. It covers everything from information about your target market to specific step-by-step processes you will use to build certain marketing systems and strategies"}, {"url": "http://www.nextavenue.org/why-marketing-plan-important-new-business/", "passage_text": "Credit: iStockphoto | Thinkstock. A marketing plan is an essential tool for business. Developing one will help you think about what makes your business unique and how to get the message out to desired audiences through a variety of channels. A marketing plan is strategic."}, {"url": "http://www.paysoncooper.com/101-marketing-strategies/what-is-a-marketing-plan-and-why-is-it-important/", "passage_text": "What Is A Marketing Plan. A marketing plan is basically a way to lay out (to plan) the marketing for your business, your products, and/or your services. It covers everything from information about your target market to specific step-by-step processes you will use to build certain marketing systems and strategies"}, {"url": "http://smallbusiness.chron.com/importance-marketing-strategy-organization-65269.html", "passage_text": "Importance of a Marketing Strategy in an Organization. A marketing strategy prevents mismanagement of your brand. Creatas Images/Creatas/Getty Images. Because one aspect of a marketing plan affects all of the others, coordinating your activities is critical to eliminating interference and maximizing your profits. "}]