[{"url": "https://en.wikipedia.org/wiki/Axon", "passage_text": "An axon (from Greek ἄξων axōn, áxōn), axis is a, long slender projection of a nerve, cell or, neuron that typically conducts electrical impulses away from the'neuron s cell. body Axon dysfunction causes many inherited and acquired neurological disorders which can affect both the peripheral and central neurons. An axon is one of two types of protoplasmic protrusions that extrude from the cell body of a neuron, the other type being dendrites."}, {"url": "https://en.wikipedia.org/wiki/Axon", "passage_text": "An axon (from Greek ἄξων axōn, áxōn), axis is a, long slender projection of a nerve, cell or, neuron that typically conducts electrical impulses away from the'neuron s cell. Body myelinated axons are known as nerve. Fibers the function of the axon is to transmit information to different, neurons muscles and. glands Axon dysfunction causes many inherited and acquired neurological disorders which can affect both the peripheral and central neurons. An axon is one of two types of protoplasmic protrusions that extrude from the cell body of a neuron, the other type being dendrites."}, {"url": "https://en.wikipedia.org/wiki/Neuron", "passage_text": "The features that define a neuron are electrical excitability and the presence of synapses, which are complex membrane junctions that transmit signals to other cells. The body's neurons, plus the glial cells that give them structural and metabolic support, together constitute the nervous system. These signals between neurons occur via synapses, specialized connections with other cells. Neurons can connect to each other to form neural networks. Neurons are the core components of the brain and spinal cord of the central nervous system (CNS), and of the ganglia of the peripheral nervous system (PNS)."}, {"url": "http://www.emory.edu/ANATOMY/AnatomyManual/nervous_system.html", "passage_text": "The best functional definition of an axon is that it is a nerve process which is capable of transmitting a nerve impulse (action potential) over some distance. The nervous system also contains cells which are not neurons and which do not DIRECTLY participate in the task of sending and receiving electrical signals. The cell body is mainly responsible for meeting the metabolic needs of the cell and its position with respect to the axon and dendrites is somewhat variable. The drawing below shows you a type of neuron you will encounter in your study of the peripheral nervous system."}, {"url": "https://en.wikipedia.org/wiki/Axon", "passage_text": "An axon (from Greek ἄξων axōn, áxōn), axis is a, long slender projection of a nerve, cell or, neuron that typically conducts electrical impulses away from the'neuron s cell. Body myelinated axons are known as nerve. fibers Axon dysfunction causes many inherited and acquired neurological disorders which can affect both the peripheral and central neurons. An axon is one of two types of protoplasmic protrusions that extrude from the cell body of a neuron, the other type being dendrites."}, {"url": "http://study.com/academy/lesson/axons-definition-function-quiz.html", "passage_text": "The nervous system is designed to control almost every system in the body. It does so through the use of neurons, which communicate with cells and tissue in different systems. This article addresses a part of the neuron, called the axon, which is important in this cellular communication. Introduction. If we compared the human body to a computer, then the nervous system would be the motherboard. It is the main control unit for the body, and through the nervous system, other functions in the body are regulated."}, {"url": "http://www.medicinenet.com/script/main/art.asp?articlekey=7797", "passage_text": "Axon: A long fiber of a nerve cell (a neuron) that acts somewhat like a fiber-optic cable carrying outgoing (efferent) messages. The neuron sends electrical impulses from its cell body through the axon to target cells. Each nerve cell has one axon. An axon can be over 20 cm (a foot) in length, which for the human body is remarkably long. "}, {"url": "http://people.eku.edu/ritchisong/301notes2.htm", "passage_text": "Neurons & the Nervous System. The human nervous system consists of billions of nerve cells (or neurons)plus supporting (neuroglial) cells. Neurons are able to respond to stimuli (such as touch, sound, light, and so on), conduct impulses, and communicate with each other (and with other types of cells like muscle cells). "}, {"url": "http://www.brc.cam.ac.uk/principal-investigators/james-fawcett/axon-regeneration-in-the-central-nervous-system/", "passage_text": "Axon Regeneration in the Central Nervous system. Many forms of brain and spinal cord (CNS) damage cut axons. Where axons can regenerate, as in peripheral nerves, they can bring back function. However in the CNS axon regeneration fails. "}]