[{"url": "http://humus101.com/EN/2007/03/16/is-hummus-good-for-your-diet/", "passage_text": "Legumes such as chickpeas from which hummus is made, are a great source for both complex carbohydrates and protein. Tahini, the second most important ingredient, is rich in minerals, fatty acids like Omega-3, and amino acids. So it’s actually the pita which you should try to cut out. "}, {"url": "http://www.huffingtonpost.com/2014/02/26/hummus-health-benefits_n_4834315.html", "passage_text": "Hummus, the simple dip of chickpeas, olive oil, lemon juice and salt, has America under a spell. The New York Times reported that the hummus industry has grown from just a $5 million dollar business 15 years ago, to one that totaled $530 million at U.S. food retailers in 2012. According to this recipe from Food & Wine, all you need to make your own hummus is a food processor, a can of chickpeas, a garlic clove, extra virgin olive oil, tahini, lemon juice and salt. Then all you have to do is throw all the ingredients in the processor."}, {"url": "http://www.webmd.com/diet/hummus-recipe-and-benefits", "passage_text": "Healthy Ingredients. Chickpeas, hummus’s main ingredient, give you protein, good-for-you carbs, and fiber. Like other members of the legume family, they routinely top lists of the world’s healthiest foods. Eating more plant foods is good for you. People who make that a habit are less likely to get certain disease"}, {"url": "http://www.medicaldaily.com/hummus-good-you-6-health-issues-superfood-dip-can-treat-326708", "passage_text": "Hummus’s ingredients, including mashed chickpea, tahini, oil, lemon juice, and garlic, load the thick paste with vitamins, antioxidants and minerals. The superfood is not only heart-healthy, it delivers a myriad of benefits for the mind, body, and soul. "}, {"url": "http://healthyeating.sfgate.com/hummus-good-you-1581.html", "passage_text": "A 2-tablespoon serving of hummus contains about 50 calories, and provides you with 2 grams of fiber and 2 grams of protein. It also contains 5 grams of fat, all of which is the healthier unsaturated type of fat. Hummus is a spread or dip made with chickpeas, olive oil, garlic, tahini, lemon juice and salt. Sometimes it has other added ingredients, like red pepper or pine nuts. Overall, this spread is a good alternative to those that contain mayonnaise since it offers more nutrients, including a small amount of protein"}, {"url": "http://healthyeating.sfgate.com/hummus-good-you-1581.html", "passage_text": "Hummus is good for you in moderation, as it can be high in calories due to its fat content. Use it as a dip for vegetables or whole-wheat pita or as replacement for mayo on sandwiches. Hummus is a spread or dip made with chickpeas, olive oil, garlic, tahini, lemon juice and salt. Sometimes it has other added ingredients, like red pepper or pine nuts. Overall, this spread is a good alternative to those that contain mayonnaise since it offers more nutrients, including a small amount of protein"}]