[{"url": "http://www.diffen.com/difference/Transcription_vs_Translation", "passage_text": "Diffen › Science › Biology › Microbiology. Transcription is the synthesis of RNA from a DNA template where the code in the DNA is converted into a complementary RNA code. Translation is the synthesis of a protein from an mRNA template where the code in the mRNA is converted into an amino acid sequence in a protein. "}, {"url": "http://www.nature.com/scitable/definition/transcription-DNA-transcription-87", "passage_text": "Transcription is carried out by an enzyme called RNA polymerase and a number of accessory proteins called transcription factors. Transcription factors can bind to specific DNA sequences called enhancer and promoter sequences in order to recruit RNA polymerase to an appropriate transcription site. Together, the transcription factors and RNA polymerase form a complex called the transcription initiation complex."}, {"url": "http://www.atdbio.com/content/14/Transcription-Translation-and-Replication", "passage_text": "Transcription is the process by which DNA is copied (transcribed) to mRNA, which carries the information needed for protein synthesis. Transcription takes place in two broad steps. First, pre-messenger RNA is formed, with the involvement of RNA polymerase enzymes. "}, {"url": "http://users.rcn.com/jkimball.ma.ultranet/BiologyPages/T/Transcription.html", "passage_text": "1 transcription of the information encoded in DNA into a molecule of RNA (described here) and. 2  translation of the information encoded in the nucleotides of mRNA into a defined sequence of amino acids in a protein (discussed in. 3  Gene Translation: RNA → Protein). "}, {"url": "https://en.wikipedia.org/wiki/Transcription_(genetics)", "passage_text": "During transcription, a DNA sequence is read by an RNA polymerase, which produces a complementary, antiparallel RNA strand called a primary transcript. Transcription proceeds in the following general steps: 1  One or more sigma factor protein binds to the RNA polymerase holoenzyme, allowing it to bind to promoter DNA. One strand of the DNA, the template strand (or noncoding strand), is used as a template for RNA synthesis. As transcription proceeds, RNA polymerase traverses the template strand and uses base pairing complementarity with the DNA template to create an RNA copy."}, {"url": "http://science.howstuffworks.com/life/cellular-microscopic/dna5.htm", "passage_text": "This copying process is called transcription and the copy is mRNA. Transcription takes place in the cytoplasm (prokaryote) or in the nucleus (eukaryote). The transcription is performed by an enzyme called RNA polymerase. To make mRNA, RNA polymerase: 1  Binds to the DNA strand at a specific sequence of the gene called a promoter. 2  Unwinds and unlinks the two strands of DNA. 3  Uses one of the DNA strands as a guide or template"}, {"url": "http://chemguide.co.uk/organicprops/aminoacids/dna3.html", "passage_text": "Transcription Transcription is the name given to the process where the information in a gene in a DNA strand is transferred to an RNA molecule. The coding strand and the template strand of DNA The important thing to realise is that the genetic information is carried on only one of the two strands of the DNA. Transcription is the name given to the process where the information in a gene in a DNA strand is transferred to an RNA molecule. The coding strand and the template strand of DNA."}, {"url": "https://en.wikipedia.org/wiki/Transcription_(genetics)", "passage_text": "In bacteria, transcription begins with the binding of RNA polymerase to the promoter in DNA. RNA polymerase is a core enzyme consisting of five subunits: 2 α subunits, 1 β subunit, 1 β' subunit, and 1 ω subunit. One strand of the DNA, the template strand (or noncoding strand), is used as a template for RNA synthesis. As transcription proceeds, RNA polymerase traverses the template strand and uses base pairing complementarity with the DNA template to create an RNA copy."}, {"url": "http://biology.about.com/od/cellularprocesses/ss/Dna-Transcription.htm", "passage_text": "DNA transcription is a process that involves transcribing genetic information from DNA to RNA. The transcribed DNA message, or RNA transcript, is used to produce proteins. DNA is housed within the nucleus of our cells. It controls cellular activity by coding for the production of proteins. 1 Elongation. 2  Certain proteins called transcription factors unwind the DNA strand and allow RNA polymerase to transcribe only a single strand of DNA into a single stranded RNA polymer called messenger RNA (mRNA). 3  The strand that serves as the template is called the antisense strand."}, {"url": "http://www.nature.com/scitable/definition/transcription-DNA-transcription-87", "passage_text": "The newly formed mRNA copies of the gene then serve as blueprints for protein synthesis during the process of translation. Transcription is the process by which the information in a strand of DNA is copied into a new molecule of messenger RNA (mRNA). DNA safely and stably stores genetic material in the nuclei of cells as a reference, or template. Transcription factors can bind to specific DNA sequences called enhancer and promoter sequences in order to recruit RNA polymerase to an appropriate transcription site. Together, the transcription factors and RNA polymerase form a complex called the transcription initiation complex."}]