[{"url": "http://www.otplan.com/articles/how-to-obtain-your-occupational-therapy-degree.aspx", "passage_text": "Your first step in becoming certified to practice Occupational Therapy is to get your Bachelor’s degree. There are a few different choices for majors that will assist in becoming a certified occupational therapist. Some of these choices include anthropology, sociology, and psychology. In terms of educational requirements, occupational therapists must have at least a master’s degree. Their degree field must be in occupational therapy and they will need a state license to practice. Other important training to have includes CPR and BCLS."}, {"url": "http://www.allalliedhealthschools.com/health-careers/physical-therapy/occupational-therapy-degree/", "passage_text": "A master's degree is the minimum standard for becoming a practicing occupational therapist, and admission to occupational therapy degree programs is competitive. The average master's degree program takes a student two and a half years to complete. "}, {"url": "http://www.aota.org/Education-Careers/Considering-OT-Career/FAQs/Planning.aspx", "passage_text": "A combined bachelor's/master's program is an accredited program that accepts students without a bachelor's degree; awards a baccalaureate degree; then, upon completion of the master's-level academic coursework and fieldwork, awards an entry-level master's degree in occupational therapy. "}, {"url": "http://www.excite.com/education/healthcare/physical-and-occupational-therapy", "passage_text": "An Associate degree in physical or occupational therapy can lead to a career as an assistant to a therapist. In order to practice physical or occupational therapy, every state requires the therapist to have a Master’s degree in the field and be licensed. "}, {"url": "http://learn.org/articles/What_Type_of_Degree_Do_I_Need_to_Become_an_Occupational_Therapist.html", "passage_text": "To become an occupational therapist, you'll need a minimum of a master's degree in occupational therapy. The following article offers information on preparing for and entering an occupational therapy program, as well as information about certification and licensure. College Education. Once in college, occupational therapy students who don't opt for a dual bachelor's and master's degree program should be sure to adequately prepare by choosing an undergraduate major in occupational therapy or one of the following disciplines:"}, {"url": "http://www.answers.com/Q/What_degree_is_required_to_become_an_Occupational_Therapist", "passage_text": "Occupational therapists must be licensed, requiring a master's degree in occupational therapy, 6 months of supervised fieldwork, and passing scores on national and State examinations. Education and training. A master's degree or higher in occupational therapy is the minimum requirement for entry into the field. In 2007, 124 master's degree programs offered entry-level education, 66 programs offered a combined bachelor's and master's degree, and 5 offered an entry-level doctoral degree. Individuals pursuing a career as an occupational therapist usually need to earn a post-baccalaureate degree from an accredited college or university or education deemed equivalent.  Education and training. A master's degree or higher in occupational therapy is the minimum requirement for entry into the field."}, {"url": "https://nationalcareersservice.direct.gov.uk/advice/planning/jobprofiles/Pages/occupationaltherapist.aspx", "passage_text": "Entry requirements. To become a registered occupational therapist you will need to have a degree, or have completed a postgraduate course, in occupational therapy that is approved by the Health and Care Professions Council (HCPC). See the HCPC website for approved courses and course providers. 1  Health and Care Professions Council"}, {"url": "http://www.wikihow.com/Become-an-Occupational-Therapist", "passage_text": "A career in occupational therapy requires a master's degree for entry level, although many people also earn a doctoral degree. Therapists must pass an initial certifying exam given by the National Board for Certification in Occupational Therapy, and be licensed by their state. 1 For instance, in New York, you must have completed an accredited Occupational Therapist Program earning an entry-level master's degree or post-baccalaureate certificate, finished at least six months of supervised field work, and passed the NBCOT with a score of 450 or higher."}]