[{"url": "http://www.austria.climatemps.com/", "passage_text": "Climate, Average Weather of Austria. 1  Of the land area, 88.2% has a temperate/ mesothermal climate with significant precipitation in all seasons (Cf), 11.8% has a alpine/ highland climate (H). 1 Of the land area, 88.2% has a temperate/ mesothermal climate with significant precipitation in all seasons (Cf), 11.8% has a alpine/ highland climate (H). 2  Of the population, 88.3% live in a temperate/ mesothermal climate with significant precipitation in all seasons (Cf), 11.7% live in"}, {"url": "http://www.salzburg.climatemps.com/temperatures.php", "passage_text": "Average Temperatures in Salzburg, Austria. 1  The average annual temperature in Salzburg, Austria is a little cool at 8 degrees Celsius (46.4 degrees Fahrenheit). 2  The variation of mean monthly temperatures is 21 C (37.8 F) which is a below moderate range. 3  The range/ variation of diurnal mean temperatures is 9.5 C (17.1 F). 1 The range/ variation of diurnal mean temperatures is 9.5 C (17.1 F). 2  The warmest month (July) is somewhat warm with an average temperature of 18 degrees Celsius (64.4 degrees Fahrenheit). 3  The coolest month (January) is slightly cold with an average temperature of -3 degrees Celsius (26.6"}, {"url": "http://www.holiday-weather.com/vienna/averages/", "passage_text": "July is the hottest month in Vienna with an average temperature of 19°C (66°F) and the coldest is January at -1°C (30°F) with the most daily sunshine hours at 11 in August. The wettest month is June with an average of 74mm of rain. Loading weather data. "}, {"url": "http://www.vienna.climatemps.com/temperatures.php", "passage_text": "1 The average annual temperature in Vienna, Austria is a little cool at 9.8 degrees Celsius (49.7 degrees Fahrenheit). 2  Mean monthly temperatures vary by 21.5 C (38.7 F) which is a below moderate range. 3  The range/ variation of diurnal mean temperatures is 7.3 C (13.2 F). Average Temperatures in Vienna, Austria. 1  The average annual temperature in Vienna, Austria is a little cool at 9.8 degrees Celsius (49.7 degrees Fahrenheit)."}, {"url": "http://www.currentresults.com/Weather/Austria/temperature-september.php", "passage_text": "Average Temperatures for Austria in September. Average temperatures for September at cities, towns and ski resorts throughout Austria are listed below in degrees Celsius and Fahrenheit. The tables give the normals for maximum and minimum monthly temperatures based on weather data collected from 1981 to 2010. "}, {"url": "https://weatherspark.com/averages/32356/Vienna-Niederosterreich-Austria", "passage_text": "This report describes the typical weather at the Vienna International Airport (Schwechat Airport) (Vienna, Austria) weather station over the course of an average year. It is based on the historical records from 1974 to 2012. Earlier records are either unavailable or unreliable. Vienna has a humid continental climate with warm summers and no dry season. The area within 25 mi of this station is covered by croplands (78%), grasslands (11%), forests (5%), built-up areas (5%), and lakes and rivers (3%)."}, {"url": "http://www.currentresults.com/Weather/Austria/temperature-october.php", "passage_text": "Average Temperatures for Austria in October. Average temperatures for October at cities, towns and ski resorts throughout Austria are listed below in degrees Celsius and Fahrenheit. The tables give the normals for maximum and minimum monthly temperatures based on weather data collected from 1981 to 2010. "}, {"url": "http://www.worldweatheronline.com/Vienna-weather-averages/Wien/AT.aspx", "passage_text": "Summer. Summer is when Vienna is at its warmest, with temperatures reach an average high of 25 degrees Celsius and a surprisingly high chance of rain when compared to the spring and autumn months, though the rain does nothing to cool the high temperature. The temperatures can fall to as low as -3 degrees Celsius and there are only two hours of sunlight on average each day. The cold in Vienna is also compounded by snow fall, strong winds and some patches of rain."}, {"url": "http://www.salzburg.climatemps.com/temperatures.php", "passage_text": "1 The average annual temperature in Salzburg, Austria is a little cool at 8 degrees Celsius (46.4 degrees Fahrenheit). 2  The variation of mean monthly temperatures is 21 C (37.8 F) which is a below moderate range. 3  The range/ variation of diurnal mean temperatures is 9.5 C (17.1 F). 1 The range/ variation of diurnal mean temperatures is 9.5 C (17.1 F). 2  The warmest month (July) is somewhat warm with an average temperature of 18 degrees Celsius (64.4 degrees Fahrenheit). 3  The coolest month (January) is slightly cold with an average temperature of -3 degrees Celsius (26.6"}]