[{"url": "https://www.quimbee.com/keyterms/facially-unconstitutional", "passage_text": "Facially unconstitutional. A description of a government law, regulation, or rule that is deemed to be unconstitutional as written, as opposed to being unconstitutional as applied. "}, {"url": "http://www.merriam-webster.com/dictionary/unconstitutional", "passage_text": "Definition of UNCONSTITUTIONAL for Kids. : not according to or agreeing with the constitution of a country or government. "}, {"url": "http://www.definitions.net/definition/unconstitutional", "passage_text": "Wiktionary (0.00 / 0 votes) Rate this definition: unconstitutional (Adjective). Contrary to or violative of the constitution of a government or other institution. That recently passed political bill has been declared unconstitutional. "}, {"url": "http://www.learnersdictionary.com/definition/unconstitutional", "passage_text": "/ˌʌnˌkɑːnstəˈtuːʃənl̟/ /ˌʌnˌkɒnstəˈtjuːʃənl̟/. adjective. Learner's definition of UNCONSTITUTIONAL. : not allowed by the constitution of a country or government: not constitutional. "}, {"url": "http://definitions.uslegal.com/u/unconstitutional/", "passage_text": "Unconstitutional Law & Legal Definition. Unconstitutional refers to a government action which is in violation of the authority and rights defined and granted in the government's constitution. Most constitutions set forth the powers of governments, so that the constitution normally applies only to government actions. "}, {"url": "http://www.constitution.org/uslaw/16amjur2nd.htm", "passage_text": "Unconstitutional Official Acts. 16 Am Jur 2d, Sec 177 late 2d, Sec 256: The general misconception is that any statute passed by legislators bearing the appearance of law constitutes the law of the land. The U.S. Constitution is the supreme law of the land, and any statute, to be valid, must be In agreement. "}, {"url": "http://www.yourdictionary.com/unconstitutional", "passage_text": "Sentence Examples. » more... 1  Already at the universities he had proclaimed his Liberal sympathies as a member of the Burschenschaft, and he now threw himself into open opposition to the unconstitutional spirit of the Hessian government, an attitude which led to his dismissal from the state service in 1833. "}, {"url": "http://www.thefreedictionary.com/constitutional", "passage_text": "constitutional. adj. 1. (Government, Politics & Diplomacy) denoting, characteristic of, or relating to a constitution. 2. (Government, Politics & Diplomacy) authorized by or subject to a constitution. 3. of or inherent in the physical make-up or basic nature of a person or thing: a constitutional weakness."}, {"url": "http://definitions.uslegal.com/u/unconstitutional-conditions-doctrine/", "passage_text": "Unconstitutional-Conditions Doctrine Law & Legal Definition. Unconstitutional-conditions doctrine is a rule which describes that the government cannot condition a person's receipt of a governmental benefit on the waiver of a constitutionally protected right. "}, {"url": "http://www.oxforddictionaries.com/definition/english/unconstitutional", "passage_text": "adjective. Not in accordance with the political constitution or with procedural rules: they do not countenance unconstitutional action by the police the Act would be declared unconstitutional in the courts. More example sentences. 1  The law was later ruled unconstitutional by the Florida state Supreme Court. 2  It led to the US supreme court ruling that the segregation of buses was unconstitutional. 3  First of all, the first declaration that you claim is that a certain High Court Rule is unconstitutional."}]