[{"url": "http://www.answers.com/Q/What_are_major_landforms_in_the_amazon_rainforest", "passage_text": "The Amazon rain forest is in South America, North-West. The forest covers the basin of the Amazon, the world's second longest river, but its mostly in Brazil. Around the Amazo … n River in Brazil, South America. The Amazon Rainforest covers most of the Amazon Basin in South America. About 5 1/2 million square kilometers are covered by rainforest. The Amazon Rainforest is hugely in dan … ger because of major deforestation."}, {"url": "http://www.buzzle.com/articles/landforms-in-tropical-rainforests.html", "passage_text": "Advertisement. The tropical rainforests are characterized by a variety of landforms which give rise to a complex ecosystem in this region. The tropical rainforests are found in lowland regions. Topographical features of the rainforest regions include the mountains, valleys, streams, wetlands, rivers, etc. "}, {"url": "https://answers.yahoo.com/question/index?qid=20080220121822AAyEgnz", "passage_text": "Rating Newest Oldest. Best Answer: The two largest rainforests, Amazon (S. America) and Congo (Africa) are located in a basin type landform with a river flowing through it-Amazon Basin and Amazon River and Congo Basin and Congo River. Indonesia has lots of rainforest as well however there are over 400 volcanoes and it is quite mountainous. "}, {"url": "https://au.answers.yahoo.com/question/index?qid=20081107155819AAnkOeE", "passage_text": "The Amazon also has the largest drainage basin in the world. Here is super map of the Amazon Basin, River and major cities. http://en.wikipedia.org/wiki/Image:Amazo... Help support the rainforest-it's free!! You can also support animals rescue, hunger, breast cancer-just by giving a click with your mouse. Same site. Best Answer: I'm not too sure exactly what you want here. First of all the landform is a basin which is a round or oval depression in the earth's surface. The mighty Amazon river flows through this basin and is surrounded by the largest rainforest in the world. The Amazon river has many tributaries most of which start in the Andes Mountains (source of the Amazon)"}, {"url": "http://www.answers.com/Q/What_are_major_landforms_in_the_amazon_rainforest", "passage_text": "The Amazon Rainforest is located in a basin. That is the major landform, a basin. Rocks-minimal in that area as it is a basin shape. The Amazon Rainforest covers most of the Amazon Basin in South America. About 5 1/2 million square kilometers are covered by rainforest. The Amazon Rainforest is hugely in dan … ger because of major deforestation."}, {"url": "http://www.micropoll.com/a/mpresult/1162207-3846325", "passage_text": "The two are the same in some ways, but the diversity of plants and animals in the. . These two types are temperate and tropical. At least 200 cm of it, perhaps up to 350 centimeters. . . . . . . Four major landform types can be. Name the landform and state whether lion are found in the the amazon rainforest. What type of energy is used in Brazil?There are two types of rainforests on earth: the tropical rainforest, and the temperate rainforest. At least 200 cm of it, perhaps up to 350 centimeters. . What type of energy is used in Brazil?There are two types of rainforests on earth: the tropical rainforest, and the temperate rainforest. "}, {"url": "http://www.answers.com/Q/What_are_major_landforms_in_the_amazon_rainforest", "passage_text": "Making the world better, one answer at a time. The Amazon Rainforest is located in a basin. That is the major landform, a basin. Rocks-minimal in that area as it is a basin shape. Soils-Soils of the Amazon Rainforest generally consist of fine sands, silt and clay. The Amazon Rainforest covers most of the Amazon Basin in South America. About 5 1/2 million square kilometers are covered by rainforest. The Amazon Rainforest is hugely in dan … ger because of major deforestation."}, {"url": "http://amazonsjawjaw.blogspot.com/2011/05/climate-and-rainfall.html", "passage_text": "Climate, Rainfall and Landforms. The Amazon rainforest's rainfall per year is between 80 inches of water to about 400 inches of water. the climate of this zone is at an average of 27 degrees Celsius. Some landforms of the amazon include the Andes Mmountains, amazon basin and the Atacama desert. Posted by michael.b at 20:27. Email This BlogThis!"}, {"url": "http://www.worldatlas.com/webimage/countrys/saland.htm", "passage_text": "The Amazon Basin (Amazonia) is covered by the largest tropical rain forest in the world, and running through its heart is the Amazon River and its more than 1,000 tributaries, seven of them more than 1,000 miles in length. "}]