[{"url": "https://en.wikipedia.org/wiki/Fly_fishing", "passage_text": "Fly fishing is an angling method in which an artificial fly is used to catch fish. The fly is cast using a fly rod, reel, and specialized weighted line. Casting a nearly weightless fly or  lure  requires casting techniques significantly different from other forms of casting. Spey casting is a casting technique used in fly fishing. Spey casting requires a longer, heavier two-handed fly rod, referred to as a Spey rod. Spey casting is essentially a large roll cast, developed on the Scottish River Spey where high banks do not allow space for the usual back cast."}, {"url": "http://www.wikihow.com/Cast-a-Fly-Fishing-Rod", "passage_text": "Start your back cast. Begin with your fly line in front of you and cast it back. Anglers may have a personal preference between a sidearm, 45 degree, or overhead cast. Each is useful in its own situation, but start with the casting angle most comfortable to you while learning. 1 As you let more line out of the rod, you add more load. 2  The process is very similar to the length of a whip determining its potential energy load. 3  When done correctly, the torque of your cast combined with the flex in the fly rod will sail the heavier fly line out, carrying the fly with it."}, {"url": "http://www.wikihow.com/Fly-Cast", "passage_text": "1. Strip off about 20 feet (6 meters) of line from the tip of the rod and lay it in front of you. While in the other forms of casting, you're casting a bait or lure, in fly casting, you cast the line in a manner similar to cracking a whip with a weighted tip. 1 If, even with practice, you find using a fly rod too difficult, you can also cast flies using ultralight spinning gear and water-weighted bobbers. 2  Use the casting techniques described in How to Cast Spinning Tackle.."}, {"url": "http://www.wikihow.com/Cast-a-Fly-Fishing-Rod", "passage_text": "Fly rods are much more flexible than spinning rods. Your fly rod will not cast properly if you do not feel the rod bend and unbend in your hand. This is called “feeling the rod load” and can sometimes be a difficult concept for beginners to grasp. 1 As you let more line out of the rod, you add more load. 2  The process is very similar to the length of a whip determining its potential energy load. 3  When done correctly, the torque of your cast combined with the flex in the fly rod will sail the heavier fly line out, carrying the fly with it."}, {"url": "https://en.wikipedia.org/wiki/Fly_fishing", "passage_text": "In fly fishing, fish are caught by using artificial flies that are cast with a fly rod and a fly line. The fly line (today, almost always coated with plastic) is heavy enough to send the fly to the target. Spey casting is a casting technique used in fly fishing. Spey casting requires a longer, heavier two-handed fly rod, referred to as a Spey rod. Spey casting is essentially a large roll cast, developed on the Scottish River Spey where high banks do not allow space for the usual back cast."}, {"url": "http://flycastcharters.com/tips-and-techniques", "passage_text": "After you cast, the first thing you should do is put the line under your forefinger on your rod hand. Always strip the fly with your line under the forefinger of your rod hand. If you have the line under your rod hand forefinger, it helps you control the line, and applies initial pressure to the fish when he takes. "}, {"url": "http://www.wikihow.com/Fly-Cast", "passage_text": "How to Fly Cast. Fly fishing can be seen as much as an art form as a sport. It uses a simple reel that hangs down from the bottom end of a long, whip-like rod and holds a weighted line to cast artificial flies to catch trout, salmon and other fish. 1 If, even with practice, you find using a fly rod too difficult, you can also cast flies using ultralight spinning gear and water-weighted bobbers. 2  Use the casting techniques described in How to Cast Spinning Tackle.."}, {"url": "http://www.bishfish.co.nz/webbooks/smttrout/castflyrod1.htm", "passage_text": "How to cast a fly-fishing rod-Part 1. The sport of fly-fishing could perhaps better be called fly-casting-because you can do a lot of casting per fish hooked. You will do a great deal more casting if you have not learned to find fish to cast to. Learning to cast properly and accurately is absolutely essential if you plan to catch trout using fly-fishing gear"}, {"url": "http://www.wikihow.com/Cast-a-Fly-Fishing-Rod", "passage_text": "5. Stop when the rod tip is still pointing slightly upward. Stopping with the rod tip in an upward position gives the fly line more height and room to roll out in front of you. 1  Casting the rod tip too far forward will sink the rolling line too low, possibly allowing it to contact the ground or water before unfurling. 1 As you let more line out of the rod, you add more load. 2  The process is very similar to the length of a whip determining its potential energy load. 3  When done correctly, the torque of your cast combined with the flex in the fly rod will sail the heavier fly line out, carrying the fly with it."}]