[{"url": "http://www.cat-world.com.au/General-Cat-Articles/why-do-cats-go-away-to-die.html", "passage_text": "According to Desmond Morris in his book Cat World-A Feline Encyclopedia, cats have an advantage over humans in regards to death, they don't actually know what death is. They go away and hide because they are sick and feeling vulnerable. This makes perfect sense from an evolutionary point of view. So it's not just dying cats who do this but injured cats also. What to do if you notice your cat hiding: Cats don't always hide in such an out of the way spot that you can't find him. You may find him hiding in a wardrobe or cupboard. If you notice your cat has suddenly started hiding it may be a warning that he is possibly sick"}, {"url": "http://www.thecatsite.com/t/160987/is-my-cat-dead-do-cats-go-away-to-die", "passage_text": "Yes. They do go away to die. One thing though is that I know a group of people who if they see a cat outdoors will trap the cats and take them to a no kill shelter or to foster homes. They try to find the owners. They are firm believers in indoor only and a bit radical about it. It is not something I would do."}, {"url": "http://www.cat-world.com.au/General-Cat-Articles/why-do-cats-go-away-to-die.html", "passage_text": "Another theory I have as to why cats will often hide when they are dying is because they just want to be alone. They aren't feeling well and would prefer to go somewhere quiet and dark where they can sleep in peace. So it's not just dying cats who do this but injured cats also. What to do if you notice your cat hiding: Cats don't always hide in such an out of the way spot that you can't find him. You may find him hiding in a wardrobe or cupboard. If you notice your cat has suddenly started hiding it may be a warning that he is possibly sick"}, {"url": "https://answers.yahoo.com/question/index?qid=20090103114604AAhyLqX", "passage_text": "Relevance. Rating Newest Oldest. Best Answer: yes, it is true...when they are going to die, they know it.. so they either run away or go somewhere very private to die.. like somewhere where you usually dont go in the house.. To a cat there has to be a physical reason it is in pain and they try to escape that physical reason. This tale of :wandering off is just that a tale. People see the cat leave then find it dead or is never returns and assume the cat went off to die."}, {"url": "http://cats.lovetoknow.com/What_Is_the_Dying_Behavior_of_Cats", "passage_text": "Hiding. Cats seem to have the ability to know that they are going to die. A sick cat will often begin seeking out places that are comfortable to him, yet away from his owners. For pet owners who allow a cat outside, this can cause problems. How Cats Behave When They're Dying. It is an unfortunate fact of life that death must also occur. It is difficult to watch a dear friend reach the end of his days, as many cat owners will attest. It's possible that some cats will die unexpectedly or blessedly in their sleep."}, {"url": "http://www.thecatsite.com/t/84908/do-cats-go-away-to-die", "passage_text": "My guess is that when cats are ill or injured...instead of going away to die, their instinct tells them to hide, in an attempt to avoid becoming the prey of a stronger predator. I would exhaust all attempts to find this kitty before I gave up. Being the age she is she was quite frail and hardly went past her own doorstep for the last couple of years, but she started doing something the last few weeks that she's never done before and thats to lie on her front doorstep in the sunshine, along with curling up beside their labrador Max."}, {"url": "http://www.thecatsite.com/t/160987/is-my-cat-dead-do-cats-go-away-to-die", "passage_text": "Sometimes cats will go away to die, sadly. That happened with a cat that my family had when I was pretty young. She had an abscess on her paw that just refused to heal up and eventually she just left one day and we didn't see her again. They do go away to die. One thing though is that I know a group of people who if they see a cat outdoors will trap the cats and take them to a no kill shelter or to foster homes. They try to find the owners. They are firm believers in indoor only and a bit radical about it. It is not something I would do."}, {"url": "http://www.answers.com/Q/How_do_cats_know_when_people_are_going_to_die", "passage_text": "In the wild many animals go off to die alone away from the pack, this is to avoid the smell from their bodies drawing predators back to their family or young. A cat going off … to die is its one final act of loyalty to its family. Dying alone so it can protect others. T a cat could probably get the feeling that the family is sad, and they know when something is wrong. Cats are smart creatures and shouldn't be underestimated. There is a high probability that they know that someone is going to die, or that they are in pain."}, {"url": "https://answers.yahoo.com/question/index?qid=20090103114604AAhyLqX", "passage_text": "A cat may seem to wander off, but usually the case is a cat in pain will try to escape the pain. This may cause it to leave the area it is in. The cat feels if it gets far enough away from the place it hurts it will leave the hurt behind. To a cat there has to be a physical reason it is in pain and they try to escape that physical reason. This tale of :wandering off is just that a tale. People see the cat leave then find it dead or is never returns and assume the cat went off to die."}]