[{"url": "http://www.colormatters.com/color-and-design/basic-color-theory", "passage_text": "2. A color scheme based on complementary colors. Complementary colors are any two colors which are directly opposite each other, such as red and green and red-purple and yellow-green. In the illustration above, there are several variations of yellow-green in the leaves and several variations of red-purple in the orchid. Primary Colors: Red, yellow and blue. In traditional color theory (used in paint and pigments), primary colors are the 3 pigment colors that can not be mixed or formed by any combination of other colors. All other colors are derived from these 3 hues. Secondary Colors: Green, orange and purple."}, {"url": "http://www.realcolorwheel.com/complementsneutral.htm", "passage_text": "Opaque Cadmium Red Light or Dark are opposite Cyan which is called Thalo Blue. Quinacridone Magenta Transparent, PR122 only, is opposite Thalo Green. Purple and Yellow Green are opposite colors. Green Oxide Opaque is dark yellow-green to use as the opposition color. Real Color Wheel main page On the pigment Real Color Wheel these opposition colors are numbered within the 36 sections. Magenta Transparent, (PR122 is best) and Thalo Green are opposite colors. They make a lot of foreground darks in the early afternoon. It's a very dark medium dark. These are the actual pigments"}, {"url": "https://en.wikipedia.org/wiki/Complementary_color", "passage_text": "Which pairs of colors are considered complementary depends on the color theory one uses: 1  Modern color theory uses either the subtractive color model, or the additive color model, and in these, the complementary/opposite pairs are red & cyan, green & magenta, and blue & yellow. The complementary primary–secondary combinations are red – cyan, green – magenta, and blue – yellow. In the RGB color model, the light of two complementary colors, such as red and cyan, combined at full intensity, will make white light, since two complementary colors contain light with the full range of the spectrum."}, {"url": "http://www.answers.com/Q/What_colors_are_opposite_each_other_on_the_color_wheel", "passage_text": "Color opposites are found across the color wheel from each other.  Red is the opposite of Green, yellow is the opposite of Green, and  Blue is the opposite of Orange. Each o … pposite set includes one  primary color, and the secondary color made by mixing the two other  primary colors. Yellow-green is opposite red-violet. Yellow-orange is opposite blue-violet. Red- … orange is opposite blue-green. Pairs of colors opposite each other are called complement"}, {"url": "http://www.answers.com/Q/What_colors_are_opposite_each_other_on_the_color_wheel", "passage_text": "The three primary colors on the color wheel are red (complement green), yellow (complement purple) and blue (complement orange). When used together, complementary colors (such as red and green) appear to be more intense than they do when used alone or with colors closer to them in the color spectrum. Yellow-green is opposite red-violet. Yellow-orange is opposite blue-violet. Red- … orange is opposite blue-green. Pairs of colors opposite each other are called complementary colors."}, {"url": "http://www.answers.com/Q/What_colors_are_opposite_each_other_on_the_color_wheel", "passage_text": "Yellow is opposite from purple. Blue is opposite orange. Yellow-green is opposite red-violet. Yellow-orange is opposite blue-violet. Red- … orange is opposite blue-green. Pairs of colors opposite each other are called complementary colors."}, {"url": "https://en.wikipedia.org/wiki/Color_wheel", "passage_text": "Colors of the color wheel [edit]. A 1908 color wheel with red, green, and violet plus colors and magenta, yellow, and cyan blue minus colors. The typical artists' paint or pigment color wheel includes the blue, red, and yellow primary colors. The corresponding secondary colors are green, orange, and violet or purple. "}, {"url": "https://en.wikipedia.org/wiki/Complementary_color", "passage_text": "1 In the traditional RYB color model, the complementary/opposite color pairs are red & green, yellow & violet, and blue & orange, though these pairings fail the modern definition of complementary colors, as they produce a brown color when combined. The complementary primary–secondary combinations are red – cyan, green – magenta, and blue – yellow. In the RGB color model, the light of two complementary colors, such as red and cyan, combined at full intensity, will make white light, since two complementary colors contain light with the full range of the spectrum."}]