[{"url": "http://gicare.com/diets/low-protein-diet/", "passage_text": "1 The physician and dietitian can determine how much protein the body is able to handle. 2  However, since the amount of protein is limited, it is important to eat foods that contain high quality protein (meat, milk, fish, poultry, eggs, and peanut butter). 3  These proteins are complete."}, {"url": "https://www.kidney.org/atoz/content/lowprotrecipes", "passage_text": "1 Animal products (fish, poultry, eggs, meat and dairy products) are considered high quality protein.. 2  You may need to limit dairy products because they are high in phosphorus; they may cause your blood phosphorus level to be too high."}, {"url": "http://gicare.com/diets/low-protein-diet/", "passage_text": "1 However, since the amount of protein is limited, it is important to eat foods that contain high quality protein (meat, milk, fish, poultry, eggs, and peanut butter). 2  These proteins are complete."}, {"url": "https://www.nlm.nih.gov/medlineplus/ency/article/002442.htm", "passage_text": "If you do not have a problem eating carbohydrates, these foods are a good source of energy. If your health care provider has recommended a low-protein diet, you may replace the calories from protein with: 1  Fruits, breads, grains, and vegetables."}, {"url": "http://slism.com/diet/protein-diet-by-eating-meat.html", "passage_text": "On the all protein diet you greatly reduce the amount of carbs in your diet. When incorporating carbohydrates in your diet keeping it to a minimum is direly important. This may include simply eating half the amount you would eat when not on the all protein diet."}, {"url": "http://www.nhs.uk/Livewell/Goodfood/Pages/meat.aspx", "passage_text": "Meat is a good source of protein, vitamins and minerals in your diet. However, the Department of Health has advised that people who eat a lot of red and processed meat a day (more than 90g cooked weight) cut down to 70g. Making healthier choices can help you eat meat as part of a healthy, balanced diet."}, {"url": "https://www.nlm.nih.gov/medlineplus/ency/article/002441.htm", "passage_text": "Liver disease can affect the absorption of food and the production of proteins and vitamins. Therefore, your diet may influence your weight, appetite, and the amounts of vitamins in your body. Do not limit protein too much, because it can result in a lack of certain amino acids."}, {"url": "https://www.diabetesaustralia.com.au/Living-with-Diabetes/Eating-Well/Food-What-Should-I-Eat/", "passage_text": "Fats have the highest energy (kilojoule or calorie) content of all foods. Eating too much fat can make you put on weight, which may make it more difficult to manage blood glucose levels. While it is important to try and reduce fat in your diet, especially if you are trying to lose weight, some fat is good for health."}, {"url": "http://www.nhs.uk/Livewell/Goodfood/Pages/meat.aspx", "passage_text": "But some meats are high in saturated fat, which can raise blood cholesterol levels. If you eat a lot of red and processed meat, it is recommended that you cut down as there is likely to be a link between red and processed meat and bowel cancer. Meats such as chicken, pork, lamb and beef are all rich in protein. A balanced diet can include protein from meat, as well as from non-animal sources such as beans and pulses. Red meat provides us with iron, and meat is also one of the main sources of vitamin B12."}]