[{"url": "https://en.wikipedia.org/wiki/Potomac_River", "passage_text": "Salinity in the Potomac River Estuary increases thereafter with distance downstream. The estuary also widens, reaching 11 statute miles (17 km) wide at its mouth, between Point Lookout, Maryland, and Smith Point, Virginia, before flowing into the Chesapeake Bay. In terms of area, this makes the Potomac River the fourth largest river along the Atlantic coast of the United States and the 21st largest in the United States. Over 5 million people live within the Potomac watershed."}, {"url": "http://msa.maryland.gov/msa/mdmanual/01glance/html/rivers.html", "passage_text": "Photo by Diane F. Evartt. Many rivers are tributaries to the Chesapeake Bay, but the three largest are the Potomac, the Patapsco, and the Patuxent. The Potomac River runs west and creates a natural border between Maryland and Virginia, while the Patapsco runs north from the Bay through Baltimore. "}, {"url": "https://en.wikipedia.org/wiki/Potomac_River", "passage_text": "The Potomac River /pəˈtoʊmək/ is located along the mid-Atlantic coast of the United States and flows into the Chesapeake Bay. The river (main stem and North Branch) is approximately 405 miles (652 km) long, with a drainage area of about 14,700 square miles (38,000 km²). In terms of area, this makes the Potomac River the fourth largest river along the Atlantic coast of the United States and the 21st largest in the United States. Over 5 million people live within the Potomac watershed."}, {"url": "https://en.wikipedia.org/wiki/Potomac_River", "passage_text": "The Potomac River runs 405 miles (652 km) from the Fairfax Stone in West Virginia on the Allegheny Plateau to Point Lookout, Maryland, and drains 14,679 square miles (38,020 km 2). The length of the river from the junction of its North and South Branches to Point Lookout is 302 miles (486 km). In terms of area, this makes the Potomac River the fourth largest river along the Atlantic coast of the United States and the 21st largest in the United States. Over 5 million people live within the Potomac watershed."}, {"url": "http://www.washingtonscrossingswim.com/", "passage_text": "Mark your calendar for next year's Washington's Crossing,Sunday June 5, 2016Race Format:The Washington's Crossing race format is swimmers will board a Potomac Riverboat and cruise to the western shore of the Potomac River in Alexandria, Virginia, jump in the river, and begin the race with a water start. Washington's Crossing is destined to be a nationally recognized swim growing in prestige and attendance commensurate with our Nation’s Capital. The 2015 Queen and King of the Potomac River are Amanda Levy and Brewer Matthews with times respectively, 33:12 and 32:15."}, {"url": "http://www.hmdb.org/marker.asp?marker=61574", "passage_text": "The Great Falls of the Potomac is 3 miles downstream from here, to the southeast. Little Falls is 11 miles downstream and the estuary, at sea level, begins 13 miles downstream. The distance to the mouth of the Potomac is 130 miles. The river's overall length, from source to mouth, is 382 miles. Its average width from Harpers Ferry to Washington is 1,500 feet, except at Great Falls where it narrows to a 200-foot gorge. Human habitation in the Potomac River Basin has existed for 9,000 years, according to archeological evidence. The name Potomac derives from the Algonquian word patawomeke, which means trading place.. The first English settlement, St. Mary's City, was founded in 1634."}, {"url": "http://www.answers.com/Q/How_wide_is_the_Potomac_River_in_Maryland", "passage_text": "The Potomac River, which flows through West Virginia, Maryland, Virginia, and Washington, DC   The Delaware River constitutes in part the boundary between Pennsylvani … a and New York, the entire boundary between New Jersey and Pennsylvania, and most of the boundary between Delaware and New Jersey. Fairfax Stone Historical Monument State Park is a West Virginia state park commemorating the Fairfax Stone a surveyor's marker and boundary stone at the source of the North Br … anch Potomac River in West Virginia. 3 people found this useful."}, {"url": "http://www.answers.com/Q/How_wide_is_the_Potomac_River_in_Maryland", "passage_text": "The Potomac River is located in 4 states. The river forms part of the borders between Washington, D.C. and Virginia on the left descending bank and Maryland and Virginia on th … e river's right descending bank. found this useful. Fairfax Stone Historical Monument State Park is a West Virginia state park commemorating the Fairfax Stone a surveyor's marker and boundary stone at the source of the North Br … anch Potomac River in West Virginia. 3 people found this useful."}, {"url": "http://www.hmdb.org/marker.asp?marker=61574", "passage_text": "You are standing 176 feet above sea level, near the mid-point of the Potomac River, and on the intake structure. of the Potomac River Water Filtration Plant of the Washington Suburban Sanitary Commission. The Potomac's source is 252 miles upstream, to the west. Human habitation in the Potomac River Basin has existed for 9,000 years, according to archeological evidence. The name Potomac derives from the Algonquian word patawomeke, which means trading place.. The first English settlement, St. Mary's City, was founded in 1634."}]