[{"url": "http://www.umass.edu/theater/pdf/earnestsg.pdf", "passage_text": "In 1894, Wilde took his family to Worthing, England, where he wrote The Importance of Being Earnest. The play was produced the following year at the St. James’s Theater in London, opening February 14, 1895. Wilde was released in 1897 and left the country. The Importance of Being Earnest (along with another of his plays, An Ideal Husband) was published two years later in 1899. The following year, on November 30, 1900, Wilde died at the age of forty-six in Paris’s Hotel hôtel’D. alsace"}, {"url": "https://en.wikipedia.org/wiki/The_Importance_of_Being_Earnest", "passage_text": "After the success of Wilde's plays Lady Windermere's Fan and A Woman of No Importance, Wilde's producers urged him to write further plays. In July 1894 he mooted his idea for The Importance of Being Earnest to George Alexander, the actor-manager of the St James's Theatre. Wilde spent the summer with his family at Worthing, where he wrote the play quickly in August. As Wilde's work came to be read and performed again, it was The Importance of Being Earnest that received the most productions. By the time of its centenary the journalist Mark Lawson described it as the second most known and quoted play in English after Hamlet .."}, {"url": "https://en.wikipedia.org/wiki/Oscar_Wilde", "passage_text": "At the height of his fame and success, while his masterpiece, The Importance of Being Earnest (1895), was still on stage in London, Wilde had the Marquess of Queensberry prosecuted for libel. The Marquess was the father of Wilde's lover, Lord Alfred Douglas. The charge carried a penalty of up to two years in prison. Oscar Fingal O'Flahertie Wills Wilde (16 October 1854 – 30 November 1900) was an Irish playwright, novelist, essayist, and poet. After writing in different forms throughout the 1880s, he became one of London's most popular playwrights in the early 1890s."}, {"url": "http://www.online-literature.com/wilde/being_earnest/", "passage_text": "Advanced Search. The Importance of Being Earnest is one of Wilde's most famous plays and still commands the affection of the public through its cinematic adaptations; most recently with Reece Witherspoon and Colin Firth. "}, {"url": "http://plays.about.com/od/plays/a/importance.htm", "passage_text": "By Wade Bradford. The Importance of Being Earnest was written by playwright / novelist / poet and all around literary genius, Oscar Wilde. It premiered in London in 1895 at St. James’s Theatre. "}, {"url": "http://www.biography.com/people/oscar-wilde-9531078", "passage_text": "Synopsis. Born on October 16, 1854 in Dublin, Irish writer Oscar Wilde is best known for the novel The Picture of Dorian Gray and the play The Importance of Being Earnest, as well as for his infamous arrest and imprisonment for being gay. Over the next few years, Wilde produced several great plays—witty, highly satirical comedies of manners that nevertheless contained dark and serious undertones. His most notable plays were A Woman of No Importance (1893), An Ideal Husband (1895) and The Importance of Being Earnest (1895), his most famous play."}, {"url": "https://simple.wikipedia.org/wiki/The_Importance_of_Being_Earnest", "passage_text": "The Importance of being Earnest, A Trivial Comedy for Serious People is a play by Oscar Wilde. It was first performed on 14 February 1895 at St. James's Theatre in London. In the play, the protagonists make up people who are not real to try to make their lives easier. The play includes many puns and plays on words. Even the title is a pun, because Ernest is a man's name and earnest is a word that means serious, honest, and sincere.. The play is about morality, style, and hypocrisy, among others, but it is noted for being humorous and lighthearted."}, {"url": "https://en.wikipedia.org/wiki/The_Importance_of_Being_Earnest", "passage_text": "There is widespread agreement among Wilde scholars that the most important influence on the play was W. S. Gilbert 's 1877 farce Engaged; Wilde borrowed from Gilbert not only several incidents but, in Russell Jackson's phrase the gravity of tone demanded by Gilbert of his actors. As Wilde's work came to be read and performed again, it was The Importance of Being Earnest that received the most productions. By the time of its centenary the journalist Mark Lawson described it as the second most known and quoted play in English after Hamlet .."}, {"url": "http://www.sparknotes.com/lit/earnest/summary.html", "passage_text": "Character List. Jack Worthing, the play’s protagonist, is a pillar of the community in Hertfordshire, where he is guardian to Cecily Cardew, the pretty, eighteen-year-old granddaughter of the late Thomas Cardew, who found and adopted Jack when he was a baby."}, {"url": "http://www.shmoop.com/importance-of-being-earnest/", "passage_text": "This is a guy who experimented with achieving the perfect ratio of serious to trivial. And by the time Wilde wrote The Importance of Being Earnest, he had perfected his comedic recipe. The Importance of Being Earnest debuted in London on February 14, 1895, when Wilde was at the height of his powers. But don't be fooled by the title. There is nothing earnest about this play, at least on the surface. All the characters in The Importance of Being Earnest are Bunburying in one way or another. Jack pretends to be Ernest. Algernon visits his friend Bunbury. Cecily writes about a fictitious love affair in her diary."}]