[{"url": "http://www.drali.com/blog/michigan-plastic-surgeon/what-is-the-recovery-time-for-gynecomastia-surgery/", "passage_text": "The first three days require total rest and recovery. In order to ensure that you do not disrupt the healing process you need to rest completely for 72 hours, and immediately after the surgery you may experience some pain, tightness and tenderness in the area. This is generally managed with pain medication and should taper off within a week."}, {"url": "http://www.drali.com/blog/michigan-plastic-surgeon/what-is-the-recovery-time-for-gynecomastia-surgery/", "passage_text": "The total recovery time for gynecomastia surgery is 4-6 weeks depending on how your body is healing. In order to ensure that you do not disrupt the healing process you need to rest completely for 72 hours, and immediately after the surgery you may experience some pain, tightness and tenderness in the area. This is generally managed with pain medication and should taper off within a week."}, {"url": "http://www.yourplasticsurgeryguide.com/breast-reduction/male-breast-reduction-recovery.htm", "passage_text": "Your male breast reduction surgery recovery process will depend on the extent of your surgery. Liposuction-only breast reduction may involve a shorter recovery period than gynecomastia surgery plus liposuction. You will likely need someone to drive you home after surgery and possibly help out at home for a day or two following the procedure. There will be some discomfort for a few days after your surgery. Be sure to discuss the details of your male breast reduction recovery with your surgeon during your consultation. He or she will be able to fill you in on the specifics and let you know how much time you will need to take off work."}, {"url": "http://www.cosmetic-md.com/gynecomastia/information/recovering-from-gynecomastia-surgery/", "passage_text": "The first 3 post op days are the most critical time for the Gynecomastia patient. He must be in full rest at home (not necessarily on bed rest; sitting and watching TV or having meals in the kitchen are permissible). Going out to the mall for a few hours is forbidden. According to my experience any compression dressing is most effective in the first week after surgery. Sun Exposure after Gynecomastia Surgery. As after any surgery, exposure to direct sun or tanning should be avoided for about 6 weeks, until ecchymosis (bruising) and a fair amount of swelling subsides. The main reason is that the sun rays will prolong the swelling and may cause the discoloration to be permanent"}, {"url": "http://www.plasticsurgery.org/cosmetic-procedures/gynecomastia-surgery.html?sub=Gynecomastia+surgery+recovery", "passage_text": "The final results of gynecomastia surgery are permanent in many cases. However, if gynecomastia resulted from the use of certain prescription medications, drugs (including steroids), or weight gain you must be fully free from these substances and remain at a stable weight in order to maintain your results. If you experience shortness of breath, chest pains, or unusual heart beats, seek medical attention immediately. Should any of these complications occur, you may require hospitalization and additional treatment. Following your physician’s instructions is essential to the success of your surgery."}, {"url": "http://www.plasticsurgery.org/cosmetic-procedures/gynecomastia-surgery.html?sub=Gynecomastia+surgery+recovery", "passage_text": "Find Your Surgeon. Find Your Surgeon. During your gynecomastia surgery recovery period, dressings or bandages will be applied to your incisions and an elastic bandage or support garment may be used to minimize swelling and support your new chest contour as it heals after surgery. If you experience shortness of breath, chest pains, or unusual heart beats, seek medical attention immediately. Should any of these complications occur, you may require hospitalization and additional treatment. Following your physician’s instructions is essential to the success of your surgery."}, {"url": "http://www.enhancemyself.com/male-breast-reduction/", "passage_text": "The results from the gynecomastia surgery will stay with you as long as your weight stays right around where it’s at. If you gain weight, some of the weight gained may go back to the chest area. The average cost for gynecomastia is between $4,500 and $7,500. Whenever you are opting for a surgical procedure, it’s best to choose a doctor with the most credentials and the most experience. The best doctor is one who has completed surgical training specifically on gynecomastia surgery and has performed hundreds of male breast reduction procedures with successful outcomes."}, {"url": "http://plasticsurgery.org/reconstructive-procedures/breast-reduction.html?sub=Recovery+time+for+breast+reduction", "passage_text": "Many patients have questions about recovery from breast surgery. When your breast reduction procedure is complete, dressings or bandages will be applied to the incisions. An elastic bandage or support bra may be worn to minimize swelling and support the breasts as they heal. "}]