[{"url": "http://www.apadivisions.org/division-47/about/resources/what-is.aspx", "passage_text": "Exercise psychology and sport psychology involve the scientific study of the psychological factors that are associated with participation and performance in sport, exercise and other types of physical activity. "}, {"url": "http://www.apadivisions.org/division-47/about/resources/defining.pdf", "passage_text": "Implications for Practice Clarifying the definition of the practice of applied sport psychology also has significant implications for improving the practice of performance psychology. To reiterate, it is clear that although athletes and other performers may need therapy, therapy with an athlete is NOT sport psychology. In this sense, sport psychology is really a domain within performance psychology; it is the study of performance psychology principles and interventions in the context of competitive athletics (rather than other types of performance)."}, {"url": "http://www.whatispsychology.biz/about-sports-psychology-definition", "passage_text": "Differences are present not only in the definition of the term itself but also in the roles psychologists are presumed to play” (Horn, 2008), with some persons viewing the field as a branch of psychology, and others seeing it as a subfield of sport and exercise science. [showmyads]. "}, {"url": "http://www.apa.org/ed/graduate/specialize/sports.aspx", "passage_text": "Sport Psychology. Sport psychology is a proficiency that uses psychological knowledge and skills to address optimal performance and well-being of athletes, developmental and social aspects of sports participation, and systemic issues associated with sports settings and organizations. APA recognizes sport psychology as a proficiency acquired after a doctoral degree in one of the primary areas of psychology and licensure as a psychologist."}, {"url": "http://www.apadivisions.org/division-47/about/resources/defining.pdf", "passage_text": "Performance psychology is contrasted with exercise and health psychology, clinical and counseling psychology, positive psychology, and consulting psychology. Lastly, the implications of this definition for education and practice are shared. In this sense, sport psychology is really a domain within performance psychology; it is the study of performance psychology principles and interventions in the context of competitive athletics (rather than other types of performance)."}, {"url": "http://online.brescia.edu/psychology-news/what-is-a-sports-psychologist/", "passage_text": "A sports psychologist applies the theories and principles of psychology to sport and exercise. The field of sports psychology is relatively young, but it is a broad discipline that can help professional and amateur athletes alike. Sports psychology is technically a division of kinesiology and physical education. However, a strong background in psychology is helpful in pursuing this competitive career."}, {"url": "http://www.apadivisions.org/division-47/about/resources/defining.pdf", "passage_text": "To provide clarity for the profession, the authors offer a definition of applied sport psychology conceptualized as a sub-field of performance psychology. The constructs of performance and performance issues are also defined. In this sense, sport psychology is really a domain within performance psychology; it is the study of performance psychology principles and interventions in the context of competitive athletics (rather than other types of performance)."}, {"url": "https://en.wikipedia.org/wiki/Sport_psychology", "passage_text": "Sport psychology is an interdisciplinary science that draws on knowledge from many related fields including biomechanics, physiology, kinesiology and psychology. It involves the study of how psychological factors affect performance and how participation in sport and exercise affect psychological and physical factors. In its formation, sport psychology was primarily the domain of physical educators, not researchers, which can explain the lack of a consistent history."}, {"url": "http://www.appliedsportpsych.org/about/about-applied-sport-and-exercise-psychology/", "passage_text": "About Applied Sport & Exercise Psychology. Applied sport and exercise psychology involves extending theory and research into the field to educate coaches, athletes, parents, exercisers, fitness professionals, and athletic trainers about the psychological aspects of their sport or activity. 1 Coaches at the high school and university levels who seek professionals in the field of applied sport and exercise psychology to work with their athletes and teams on game preparation, team cohesion, communication skills, and other areas that affect performance."}, {"url": "http://www.adams.edu/academics/sportpsych/sportpsychologist.php", "passage_text": "Sport psychology professionals are interested in how participation in sport, exercise, and physical activity may enhance personal development and well-being throughout the life span. Sport psychologists are also involved in assisting coaches in working with athletes as well as helping improve athletes' motivation. "}]