[{"url": "http://www.beddingexperts.com/mattress-sizes-chart/", "passage_text": "It is a tight fit for two adults and the same length as a twin. Two adults sleeping on a full size is equivalent to each person sleeping on a crib mattress (27 inches of sleep space). Most people with a sleeping partner opt for the queen size. Full can sometimes be special ordered in extra long."}, {"url": "http://www.ehow.com/about_6753390_bedding-twin-vs_-twin-xl.html", "passage_text": "The same size is used for twin XL mattresses, so the two sizes are equivalent. Twin comforters are usually 68 inches wide by 88 inches long. Twin XL comforters are 68 inches wide by 90 inches long, or they may be longer."}, {"url": "http://www.backtobed.com/mattress-sizes-guide/default.aspx", "passage_text": "Twin XL Mattress Size 39''x 80'' (inches). Twin XL bed size (Extra-Long) is 5 inches in length longer than the standard twin. This size is great for taller youth or adults. Twin-XL is the same length as a queen or king, In fact two of them side by side equals a king."}, {"url": "http://www.beddingexperts.com/mattress-sizes-chart/", "passage_text": "Twin-XL is the same length as a queen or king, In fact two of them side by side equals a king. Full size or also known as a ‘double/standard’ was commonly used for two adults 30 - 40 years ago when the homes and bedrooms were built much smaller."}, {"url": "http://www.twinxl.com/Articles.asp?ID=253", "passage_text": "A: A Twin extra long is known most commonly as a Twin XL . The XL stands for extra long. The dimensions of a extra long twin beds are 39 inches wide by 80 inches long. This makes a twin extra long mattress measure 5 inches longer than a standard twin size mattress. Shop bedding for twin extra long bed."}, {"url": "http://www.dormsmart.com/All-About-Dorm-Bedding-Sizes-Including-Twin-XL-16.html", "passage_text": "Listed below are the general dimensions; most blankets should fall close to these sizes. 1  Twin = 66 x 90 inches (Blanket size also fits a 39 x 80 inch twin extra long mattress.). 2  Full/Queen = 90 x 90 inches (Blanket size also fits a 54 x 80 inch full"}]