[{"url": "http://dmmclimbing.com/knowledge/how-to-break-nylon-dyneema-slings/", "passage_text": "Nylon (polyamide) and Dyneema®/Spectra® (polyethylene) are two synthetic raw materials with distinct strengths and weaknesses used in the manufacture of slings and quickdraws. Understanding the properties of these man-made fibres will guide us to best practice at the crag for using such products."}, {"url": "http://science.howstuffworks.com/dyneema1.htm", "passage_text": "On a weight-for-weight basis, Dyneema is 15 times stronger than steel and is 40 percent stronger than aramid fibers [source: Dyneema ]. Aramid fibers are another type of synthetic material that has similar characteristics, although not all; one of the most common types of aramid fiber is Kevlar."}, {"url": "http://www.marlowropes.com/dyneema.html", "passage_text": "Dyneema® is an UHMwPE (Ultra High Molecular weight Polyethylene) fibre developed by DSM in the Netherlands little over 20 years ago."}, {"url": "http://www.toyobo-global.com/seihin/dn/dyneema/seihin/tokutyou.htm", "passage_text": "Dyneema ® SK60 is the only super-fiber with a density below 1.0 (the fiber can float on water). The specific gravity of Dyneema ® SK60 is 0.97, which is the lowest value among super fibers and is lighter than water."}, {"url": "http://www.youtube.com/watch?v=GDJ3QjvRZT0", "passage_text": "A strength comparison between Dyneema fiber rope and steel rope. dyneema 57 6.0 rope test 13 1.4 dyneema rope 10 1.1 winch rope splicing 8 0.85 steel rope 4 0.42 rope braiders 4 0.42 dynema vs steel 2 0.21 dyneema® 2 0.21 high speed winches 2 0.21 test rope."}, {"url": "http://science.howstuffworks.com/dyneema.htm", "passage_text": "If you took a block of Dyneema and block of steel, on a weight-for-weight basis the block of Dyneema would be 15 times stronger than the steel block [source: Dyneema ]. The lightweight fiber is strong and moldable, yet it can withstand significant explosions and extreme weather conditions."}, {"url": "http://www.legionsafety.com/dyneema-gloves.html", "passage_text": "Dyneema Gloves-MCR Safety, Ansell & Superior. Dyneema gloves provide a comfortable and lightweight fit, while offering unmatched cut protection in harsh work environments. With a strength-to-weight ratio that is 15 times greater than steel, these highly durable gloves will hold up to a wide range of challenges."}]