[{"url": "http://www.distance-education.org/Answers/What-kind-of-degree-do-you-need-to-be-a-physical-therapist-90.html", "passage_text": "First, you'll need a Bachelor's degree to get into a postgraduate physical therapy program. It doesn't matter what your Bachelor's is, although it's recommended that you take classes in biology, anatomy, social science, and math. It generally takes about four years to earn a Bachelor's. Once you have a Bachelor's degree, you'll need to apply to a physical therapy postgraduate program. You can get a Master's or a Ph.D in physical therapy, and only these advanced degrees are accredited by the Commission on Accreditation in Physical Therapy Education (CAPTE)."}, {"url": "http://www.apta.org/PTAEducation/Overview/", "passage_text": "Physical therapist assistant (PTA) education, obtained in a CAPTE-accredited two-year associate degree program, prepares graduates for taking the national licensure examination and entering the field of physical therapy with the required knowledge, skills, and behaviors of a PTA. "}, {"url": "http://www.apta.org/PTEducation/Overview/", "passage_text": "Physical therapist (PT) professional education refers to the didactic and clinical education that prepares graduates for entry into practice of physical therapy. Education for the advancement of practicing physical therapists is termed post-professional. Physical Therapist Degree. Professional (entry-level) physical therapist education programs in the United States only offer the Doctor of Physical Therapy (DPT) degree to all new students who enroll."}, {"url": "http://www.allalliedhealthschools.com/health-careers/physical-therapy/physical-therapy-degree-guide/", "passage_text": "About the Program. Associate's Degree. Physical therapy assistants must earn a 2-year associate's degree in order to practice. In addition to the theory and practice of physical therapy, you'll study the basic medical sciences, general education courses and gain hands-on experience in a clinical internship. Bachelor's-to-Master's. "}, {"url": "https://answers.yahoo.com/question/index?qid=20080804151634AAOkgLm", "passage_text": "Best Answer: The physical therapy assistant degree is a two year degree. The physical therapy degree is a master's or doctorate level degree which usually takes 6-7 years to complete. Source(s): I am a PT. mistify · 7 years ago. "}, {"url": "http://learn.org/articles/How_Do_I_Become_a_Physical_Therapist.html", "passage_text": "The common requirements to become a physical therapist are a college degree in physical therapy and state licensure. Physical therapists need a strong understanding of health, anatomy, and nutrition, along with good interpersonal skills. They need strength and stamina because the job can be physically demanding. "}, {"url": "https://www.physicaltherapist.com/resources/become-a-physical-therapist/", "passage_text": "In order to become a physical therapist assistant you will need to obtain at least a two-year associate’s degree, which allows you to work under the direction and supervision of a PT. "}, {"url": "https://answers.yahoo.com/question/index?qid=20090218190115AAalS9c", "passage_text": "You should go for physical therapy degree to become physical therapist. Several top accredited universities and colleges offer these degrees in online and on campus programs. For your reference I am forwarding you website link that will give you information about these degrees. The link is. You can major in anything as long as you get the required pre reqs. You may need to be careful of getting the courses at a college that works on quarter hours as opposed to semesters. You generally need to take 1 year of bio, chem, physics, anatomy and physiology, probably psy, statistics, calculus."}, {"url": "http://www.bls.gov/ooh/Healthcare/Physical-therapists.htm", "passage_text": "DPT programs typically last 3 years. Most programs require a bachelor’s degree for admission as well as specific prerequisites, such as anatomy, physiology, biology, chemistry, and physics. Most DPT programs require applicants to apply through the Physical Therapist Centralized Application Service (PTCAS). "}]