[{"url": "http://www.answers.com/Q/Why_do_radioactive_isotopes_emit_radiation", "passage_text": "The reason radioactive isotopes emit radiation is that the emission of radiation is a nutural consequence of being radioactive. Let's look a bit more closely. Radioactive isotopes are unstable atoms, and they will undergo radioactive decay sooner or later. The unstable atomic nuclei undergo a change based on what particular isotope is being considered. In any case, when a nuclear change occurs, radiation of some kind is emitted from that nucleus. A radioactive isotope is a form of an element that is unstable and eventually decays into a different element. For example, most Carbon has 6 protons and 6 neutrons, and is st … able. This is called Carbon12."}, {"url": "https://en.wikipedia.org/wiki/Emission_spectrum", "passage_text": "Emission spectrum of a metal halide lamp. The emission spectrum of a chemical element or chemical compound is the spectrum of frequencies of electromagnetic radiation emitted due to an atom or molecule making a transition from a high energy state to a lower energy state. The energy of the emitted photon is equal to the energy difference between the two states. "}, {"url": "http://www.answers.com/Q/Why_do_atoms_emit_radiation", "passage_text": "The short answer is that some atoms, the ones that are radioactive, have a nucleus that is unstable, and it will break apart at some time. Yes, a plasma TV emits heat which is a form of electromagnetic  radiation called infra-red, as well as visible light which  is also electromagnetic radiation. Both harmless."}, {"url": "https://en.wikipedia.org/wiki/Radioactive_decay", "passage_text": "Alpha decay is one type of radioactive decay, in which an atomic nucleus emits an alpha particle, and thereby transforms (or decays) into an atom with a mass number decreased by 4 and atomic number decreased by 2. Alpha decay occurs when the nucleus ejects an alpha particle (helium nucleus). This is the most common process of emitting nucleons, but in rarer types of decays, nuclei can eject protons, or in the case of cluster decay specific nuclei of other elements."}, {"url": "http://www.answers.com/Q/Why_do_atoms_emit_radiation", "passage_text": "As a result, that nucleus is unstable and likely to decay by some mechanism. When an atom of a radioactive isotope decays, it emits radiation (particulate and/or electromagnetic) as a way to loose energy to shift to a more acceptable nuclear state. Yes, a plasma TV emits heat which is a form of electromagnetic  radiation called infra-red, as well as visible light which  is also electromagnetic radiation. Both harmless."}, {"url": "http://www.imnh.isu.edu/digitalatlas/clima/atmosph/rad.htm", "passage_text": "Each radioactive element emits its own characteristic form of radiation. Types of Radioactive Waste: LOW LEVEL WASTES-do not present a significant hazard. They emit low levels of radiation, usually in the form of alpha particles, and generally have short half-lives. When an atom decays it can form a different isotope of the same element (i.e. it loses neutrons) or it can become a new element (i.e. it loses protons). It is important to realize that, just because atoms have experienced one decay, it does not mean that they are no longer radioactive."}, {"url": "http://www.imnh.isu.edu/digitalatlas/clima/atmosph/rad.htm", "passage_text": "Radiation is everywhere. It is a form of energy. Radiation is produced when the nucleus of an atom is broken apart. Huge amounts of energy are stored in the nucleus. When it splits (called fission) it produces heat and radiation. Nuclear power plants use the heat to turn water into steam and produce electricity. When an atom decays it can form a different isotope of the same element (i.e. it loses neutrons) or it can become a new element (i.e. it loses protons). It is important to realize that, just because atoms have experienced one decay, it does not mean that they are no longer radioactive."}, {"url": "http://web.ead.anl.gov/uranium/guide/ucompound/rad/index.cfm", "passage_text": "Radiation refers to the particles or energy released during radioactive decay. The radiation emitted may be in the form of particles, such as neutrons, alpha particles, and beta particles, or waves of pure energy, such as gamma and X-rays. Each radioactive element, or radionuclide, has a characteristic half-life. "}, {"url": "https://answers.yahoo.com/question/index?qid=20080501200436AAKBaZa", "passage_text": "Report Abuse. Because they're unstable. The nuclei of radioactive isotopes have more neutrons than protons (a stable element would have equal numbers of each) and thus emit neutrons as a way of balancing things out. This process is called decay. The time it takes for half a given amount to decay into a more stable form is called the half-life. "}, {"url": "https://en.wikipedia.org/wiki/Radioactive_decay", "passage_text": "Radioactive decay, also known as nuclear decay or radioactivity, is the process by which a nucleus of an unstable atom loses energy by emitting radiation. Alpha decay occurs when the nucleus ejects an alpha particle (helium nucleus). This is the most common process of emitting nucleons, but in rarer types of decays, nuclei can eject protons, or in the case of cluster decay specific nuclei of other elements."}]