[{"url": "https://www.facebook.com/help/?faq=174987089221178", "passage_text": "Pages are for businesses, brands and organizations to share their stories and connect with people. Like profiles, you can customize Pages by publishing stories, hosting events, adding apps and more. People who like your Page and their friends can get updates in News Feed. You can create and manage a Page from your personal account. Note: If you want to create a Page to represent a business, brand, organization or celebrity, you must be an official representative. More info"}, {"url": "http://www.webopedia.com/TERM/F/Facebook.html", "passage_text": "People use Facebook to keep in touch with friends, post photos, share links and exchange other information. Facebook users can see only the profiles of confirmed friends and the people in their networks. See Social Networking Sites in Webopedia's Quick Reference section. "}, {"url": "https://en.wikipedia.org/wiki/Facebook", "passage_text": "After registering to use the site, users can create a user profile, add other users as friends , exchange messages, post status updates and photos, share videos and receive notifications when others update their profiles. In 2007, Facebook launched Facebook Pages (also called Fan Pages by users) to allow users to interact and affiliate with businesses and organizations in the same way they interact with other Facebook user profiles. On November 6, 2007, more than 100,000 Facebook pages were launched."}, {"url": "http://www.wisegeek.org/what-is-facebook.htm", "passage_text": "Friends can stay connected through the Facebook social networking site. Facebook shouldn't be the sole means that a person uses to connect with friends. Facebook began at Harvard University. A popular Facebook features allows users to upload photos taken with a digital camera to the site. Facebook is a social networking website intended to connect friends, family, and business associates. People can use social media to find new friends with similar interests"}, {"url": "http://www.bbc.co.uk/webwise/guides/about-facebook", "passage_text": "WebWise Team | 10th October 2012. Facebook is a vast, sprawling network and you can make whatever you want of it. You sign up by putting some details, and preferably a photo of yourself, on the Facebook website. Then you’re ready to start posting a few updates. "}, {"url": "http://www.wisegeek.org/what-is-facebook.htm", "passage_text": "Facebook is a social networking website intended to connect friends, family, and business associates. It is the largest of the networking sites, with the runner up being MySpace. It began as a college networking website and has expanded to include anyone and everyone. Facebook shouldn't be the sole means that a person uses to connect with friends. Facebook began at Harvard University. A popular Facebook features allows users to upload photos taken with a digital camera to the site."}, {"url": "http://www.cnet.com/news/newbies-guide-to-facebook/", "passage_text": "Facebook is a social networking service that lets you connect with friends, co-workers, and others who share similar interests or who have common backgrounds. Privacy is one of the key differentiators of Facebook from other social networking services. Facebook gives you the option to control what others see, right down to individual photo albums, or various pieces of personal information such as your address, phone number, and screen name on instant messaging services."}, {"url": "http://whatis.techtarget.com/definition/Facebook", "passage_text": "Facebook is a popular free social networking website that allows registered users to create profiles, upload photos and video, send messages and keep in touch with friends, family and colleagues. The site, which is available in 37 different languages, includes public features such as: "}, {"url": "http://www.facebook.com/facebook", "passage_text": "We're launching 360 video on Facebook. To create 360 videos, a special set of cameras are used to record 360 degrees of a scene simultaneously. So when you watch 360 videos on Facebook, you can choose what angle you want to see it from. "}]