[{"url": "https://en.wikipedia.org/wiki/Mexican_wolf", "passage_text": "After being placed on the Endangered Species Act in 1976, captive-bred Mexican wolves were released into recovery areas in Arizona and New Mexico in the late 1990s in order to assist the animals' recolonization of their former historical range. Though once held in high regard in Pre-Columbian Mexico, it is the most endangered gray wolf in North America, having been extirpated in the wild during the mid-1900s through a combination of hunting, trapping, poisoning and digging pups from dens."}, {"url": "http://www.endangered.org/animal/mexican-gray-wolf/", "passage_text": "Skip to content. The Mexican gray wolf (Canis lupus baileyi), a highly intelligent and socially complex carnivore, is the most endangered wolf subspecies in the world. Mexican Gray Wolf. The Mexican gray wolf (Canis lupus baileyi), a highly intelligent and socially complex carnivore, is the most endangered wolf subspecies in the world."}, {"url": "https://en.wikipedia.org/wiki/Mexican_wolf", "passage_text": "From Wikipedia, the free encyclopedia. The Mexican wolf (Canis lupus baileyi), also known as the lobo, is a subspecies of gray wolf native to the Sierra Madre and the surrounding area of western Mexico, though its range once included the southeastern United States. Though once held in high regard in Pre-Columbian Mexico, it is the most endangered gray wolf in North America, having been extirpated in the wild during the mid-1900s through a combination of hunting, trapping, poisoning and digging pups from dens."}, {"url": "http://www.defenders.org/mexican-gray-wolf/basic-facts", "passage_text": "In fact, their fur is a mix of gray, rust, black and cream. After being wiped out in the U.S. and with only a few animals remaining in Mexico, Mexican gray wolves were bred in captivity and reintroduced to the wild in Arizona beginning in 1998. There are only about 300 Mexican wolves total in captivity. Behavior. Mexican gray wolves are very social animals. They live in packs, which are complex social structures that include the breeding adult pair (the alpha male and female) and their offspring."}, {"url": "http://www.endangered.org/animal/mexican-gray-wolf/", "passage_text": "The Mexican gray wolf has been recognized as an endangered species since 1976 and about 300 individuals currently live in captivity between the United States and Mexico. Twenty years after gaining this endangered status, these rare predators were returned to the Southwest through a bi-national reintroduction program. Mexican Gray Wolf. The Mexican gray wolf (Canis lupus baileyi), a highly intelligent and socially complex carnivore, is the most endangered wolf subspecies in the world."}, {"url": "http://www.endangered.org/animal/mexican-gray-wolf/", "passage_text": "Get Alerts & Updates. The Mexican gray wolf (Canis lupus baileyi), a highly intelligent and socially complex carnivore, is the most endangered wolf subspecies in the world. Mexican Gray Wolf. The Mexican gray wolf (Canis lupus baileyi), a highly intelligent and socially complex carnivore, is the most endangered wolf subspecies in the world."}, {"url": "http://www.biologicaldiversity.org/species/mammals/Mexican_gray_wolf/index.html", "passage_text": "SAVING THE MEXICAN GRAY WOLF. The smallest gray wolf subspecies in North America, the Mexican gray wolf is also one of the rarest and most endangered mammals on the continent. But numbers stayed small. In 2009 we filed a petition to protect Mexican wolves as a subspecies or unique distinct population segment, which would force the Service to finally truly identify coherent goals and strategies to ensure its full recovery. When the agency ignored our petition, we sued in late 2012."}, {"url": "https://en.wikipedia.org/wiki/Mexican_wolf", "passage_text": "The Mexican wolf was listed as endangered under the Ecological Society of America in 1976, with the Mexican Wolf Recovery Team being formed three years later by the United States Fish and Wildlife Service. Though once held in high regard in Pre-Columbian Mexico, it is the most endangered gray wolf in North America, having been extirpated in the wild during the mid-1900s through a combination of hunting, trapping, poisoning and digging pups from dens."}, {"url": "http://www.endangeredwolfcenter.org/educational-resources/red-wolf/", "passage_text": "Sadly, the red wolf was declared extinct in the wild by 1980, with only a few red wolves in captivity. The Endangered Wolf Center received its first pair of red wolves in 1981. It was the first facility to breed both endangered red and Mexican gray wolves in captivity. Approximately 5 percent of red wolves born in captivity began their lives here at the Endangered Wolf Center. Red Wolf. Red wolf facts The red wolf is a distinctly different species from the gray wolf. The red wolf’s historical range included the southeastern United States from southern Missouri south to Texas, across the Gulf Coast states and into North Carolina."}]