[{"url": "http://www.babynamespedia.com/meaning/Alexi/m", "passage_text": "[ 3 syll. a-le-xi, al-exi ] The baby boy name Alexi is also used as a girl name. Its pronunciation is AHL EH KSiy †. Alexi is derived from Old Greek origins. Alexi is a short form of the name Alexander (Dutch, English, German, Hungarian, and Slavic). Alexi is also a variant of the name Alexis (English, Greek, French, and German). Alexi is infrequently used as a baby name for boys. It is not listed in the top 1000 names"}, {"url": "http://www.sheknows.com/baby-names/name/alexis", "passage_text": "The name Alexis is a Greek baby name. In Greek the meaning of the name Alexis is: Defender of man. American Meaning: The name Alexis is an American baby name. In American the meaning of the name Alexis is: Defender of man. Russian Meaning: The name Alexis is a Russian baby name. In Russian the meaning of the name Alexis is: Defender or helper. This Russian masculine name became popular in Britain and the US in the early 20th century, and is now given to children of either sexe."}, {"url": "http://www.thinkbabynames.com/meaning/1/Alexi", "passage_text": "Alexi /ale-xi/ [3 sylls.] as a boys' name (also used as girls' name Alexi) is of Greek origin, and the meaning of Alexi is man's defender, warrior. Alexi is a variant form of Alexander (Greek) with the suffix-i. Alexi is also a derivative of Alexis (Greek). Kreatif forms: Aleri, Alxi. Alexi is a rare given name for males. Alexi is an equivalently unique surname too for both adults and children. (2000 U.S. Census). Prominent alternative forms of Alexi (outside Top 1000) appearing in the Top 1000 are Alexander (#8 a year ago) , Alex (#128) , Alexis (#302) , Alec (#469) , Allie, Al and Alek."}, {"url": "http://www.babynamespedia.com/meaning/Alexis/f", "passage_text": "The meaning of Alexis is 'defender'. It is derived from the word alexein which is of the meaning 'to ward off, to defend'. The feminine use of the name was first popularized by the character Alexis Carrington in the 1980s American soap opera Dynasty, who was portrayed by Joan Collins. Alexis is a very popular baby girl name. The name increased in popularity from the 1960s up to the 1990s. At the peak of its usage in 1998, 1.021% of baby girls were named Alexis."}, {"url": "http://www.thinkbabynames.com/meaning/0/Alexis", "passage_text": "Alexis /alex-is/ [3 sylls.] as a girls' name (also used less commonly as boys' name Alexis) is pronounced a-LEX-iss. It is of Greek origin, and the meaning of Alexis is  defender . Originally a boy's name, but now more commonly given to girls. Actress Alexis Smith. Kreatif forms: Aialexis, Alexisai, Alexissi. "}, {"url": "http://www.babynamespedia.com/meaning/Alexis/f", "passage_text": "The name Alexis is widely used; it has 23 forms that are used in English and foreign languages. English forms of the name include Ahlexis, Alaxis, Alecsis, Alecxis, Aleexis, Aleksis, Alexa, Alexas, Alexias, Alexiou, Alexius, Alexiz, Alexus, Alixis, Alixus, Alyxis, Elexis, Elexus, Lexis, and Lexus. Alexis is a very popular baby girl name. The name increased in popularity from the 1960s up to the 1990s. At the peak of its usage in 1998, 1.021% of baby girls were named Alexis."}, {"url": "http://www.babynamewizard.com/baby-name/girl/alexis", "passage_text": "Meanings and history of the name Alexis : | Edit. Alexis-Defender and Protecter. Alexis: Helper of mankind. From the Greek name αλεξις (Alexis), which meant helper or defender, derived from Greek αλεξω (alexo) to defend, to help. This was the name of a 3rd-century BC Greek comic poet, and also of several saints. "}, {"url": "http://www.ourbabynamer.com/meaning-of-Alexis.html", "passage_text": "Alexis is used as both a boys and girls name. It consists of 6 letters and 3 syllables and is pronounced A-lex-is. In the U.S. in 2014, it ranked 64 in baby name popularity for girls with 4188 occurrences. It ranked 302 in popular baby names for boys with 1172 occurrences."}, {"url": "http://www.behindthename.com/name/alexis", "passage_text": "From the Greek name αλεξις (Alexis) , which meant helper or defender, derived from Greek αλεξω (alexo) to defend, to help. This was the name of a 3rd-century BC Greek comic poet, and also of several saints. "}]