[{"url": "https://en.wikipedia.org/wiki/Windows_Communication_Foundation", "passage_text": "The Windows Communication Foundation (or WCF), previously known as Indigo, is a runtime and a set of APIs in the .NET Framework for building connected, service-oriented applications. Contents. WCF is a tool often used to implement and deploy a service-oriented architecture (SOA). It is designed using service-oriented architecture principles to support distributed computing where services have remote consumers. Clients can consume multiple services; services can be consumed by multiple cli"}, {"url": "http://stackoverflow.com/questions/2577744/what-is-wcf-in-net", "passage_text": "Windows Communication Foundation (WCF) is a framework for building service-oriented applications in .Net. Its an Microsoft Answer to SOA. add a comment |. up vote 2 down vote. The Windows Communication Foundation (or WCF) is an application programming interface (API) in the .NET Framework for building connected, service-oriented applications. WCF is meant for designing and deploying distributed applications under service-oriented architecture (SOA) implementation"}, {"url": "http://www.c-sharpcorner.com/uploadfile/37db1d/what-is-wcf/", "passage_text": "Windows Communication Foundation (WCF) is an SDK for developing and deploying services on Windows. WCF provides a runtime environment for your services, enabling you to expose CLR types as services, and to consume other services as CLR types. [Reference read from http://www.davidchappell.com/introducingwcfv1.2.1.pdf]. WCF is forthcoming Microsoft technology for service-oriented applications; it is designed to address these requirements. WCF is part of .NET 3.0 and requires .NET 2.0, so it can only run on operation systems that support it."}, {"url": "https://msdn.microsoft.com/en-us/library/ms731082(v=vs.110).aspx", "passage_text": "Windows Communication Foundation (WCF) is a framework for building service-oriented applications. Using WCF, you can send data as asynchronous messages from one service endpoint to another. A service endpoint can be part of a continuously available service hosted by IIS, or it can be a service hosted in an application. WCF includes the following set of features. For more information, see WCF Feature Details. Service Orientation. One consequence of using WS standards is that WCF enables you to create service oriented applications. Service-oriented architecture (SOA) is the reliance on Web services to send and receive data. The services have the general advantage of being loosely-coupled instead of hard-coded from one application to another"}, {"url": "http://stackoverflow.com/questions/42740/what-is-wcf-in-simple-terms", "passage_text": "up vote 17 down vote accepted. WCF-Windows Communication Framework-is Microsoft's framework to make inter-process communication easier. It let's you do this communication through various means, plain old asmx web services, Remoting, MS Message Queuing, and a couple more. "}, {"url": "https://msdn.microsoft.com/en-us/library/dd456779(v=vs.110).aspx", "passage_text": "Windows Communication Foundation (WCF) is Microsoft’s unified programming model for building service-oriented applications. It enables developers to build secure, reliable, transacted solutions that integrate across platforms, and interoperate with existing investments. "}, {"url": "http://www.codeproject.com/Articles/139787/What-s-the-Difference-between-WCF-and-Web-Services", "passage_text": "Windows Communication Foundation (WCF) is a framework for building service-oriented applications. Using WCF, you can send data as asynchronous messages from one service endpoint to another. In this article, I will explain the difference between ASP.NET web service and WCF services like ASP.NET web services. I will also discuss how we use both the technologies for developing the"}]