[{"url": "http://michaelminn.net/newyork/infrastructure/manhattan_bridges/triboro_bridge/", "passage_text": "Triboro Bridge. The Triboro Bridge connects Manhattan, the Bronx and Queens through a complex sequence of three long-span bridges plus elevated viaducts and interchanges over Randall's Island. Initial plans for the bridge were announced in 1916 but the bridge did not receive initial funding until 1925. Fixed Truss Span. Perhaps the least glamorous part of the Triboro Bridge is the truss section connecting the Bronx with the main interchange on Randalls Island. The main span over Bronx Kill is a 383-foot-long subdivided Warren Truss span with a clearance above mean high water of 55 feet."}, {"url": "http://www.nycroads.com/crossings/triborough/", "passage_text": "This 2000 photo shows the Robert F. Kennedy (Triborough) Bridge suspension span (I-278) heading from Queens toward the Bronx, prior to reconstruction. The deck on the main suspension span was replaced between 2002 and 2004. (Photo by Jim K. Georges.). During this first phase of the project, the suspender ropes on the main span are being replaced. The westbound exit ramp from the bridge to 31st Street was extended along the viaduct, taking out part of the westbound walkway."}, {"url": "http://www.answers.com/Q/How_much_is_the_toll_on_the_Triborough_Bridge", "passage_text": "Answer by LimeAid. Confidence votes 45.0K. On the Robert F. Kennedy Bridge (aka the Triborough or Triboro Bridge) the current (as of December 30, 2010) toll for cars is $6.50 cash (without E-ZPass) and $4.80 with E-ZPass. For toll prices for other vehicles, see the Related Link below. The Brooklyn, Manhattan, and Williamsburg Bridges currently are toll free. The only crossing that connects Brooklyn to Manhattan that has a toll is the Brooklyn Battery tunnel … . The toll for that crossing is currently (as of December 30, 2010)"}, {"url": "http://web.mta.info/bandt/html/rfk.html", "passage_text": "It is actually three bridges, a viaduct, and 14 miles of approach roads connecting Manhattan, Queens, and the Bronx. The Manhattan branch is the Harlem River Lift Bridge, which links the Harlem River Drive, the FDR Drive, and 125th Street, Harlem's commercial and cultural center. The longest span of the Robert F. Kennedy Bridge, the East River Suspension Bridge to Queens, connects with the Grand Central Parkway and the Brooklyn-Queens Expressway and to Astoria's residential areas, restaurants, and shops."}, {"url": "https://en.wikipedia.org/wiki/MTA_Bridges_and_Tunnels", "passage_text": "From Wikipedia, the free encyclopedia. MTA Bridges and Tunnels, legally known as the Triborough Bridge and Tunnel Authority, is an affiliate agency of the Metropolitan Transportation Authority, that operates seven intrastate toll bridges and two tunnels in New York City. With the last merger in 1946, the authority was renamed the Triborough Bridge and Tunnel Authority. Generating millions of dollars in toll revenue annually, the TBTA easily became a powerful city agency as it was capable of funding large capital projects."}, {"url": "http://www.answers.com/Q/How_much_is_the_toll_on_the_Triborough_Bridge", "passage_text": "The toll on the Robert F. Kennedy Bridge (also known as the Triborough or Triboro Bridge) for 6 Axle vehicles is $35.00 without E-ZPass, and $26.25 with E-ZPass. Source: see R … elated Link below. The Brooklyn, Manhattan, and Williamsburg Bridges currently are toll free. The only crossing that connects Brooklyn to Manhattan that has a toll is the Brooklyn Battery tunnel … . The toll for that crossing is currently (as of December 30, 2010) $6.50 cash (without E-ZPass) and $4.80"}, {"url": "http://www.nycroads.com/crossings/triborough/", "passage_text": "Flanking the movable deck are two 230-foot-long fixed truss spans.With six traffic lanes and two sidewalks, the Harlem River lift span has a weight of 2,200 tons and a deck area of 20,000 square feet, making it the largest such bridge in the world when it opened. During this first phase of the project, the suspender ropes on the main span are being replaced. The westbound exit ramp from the bridge to 31st Street was extended along the viaduct, taking out part of the westbound walkway."}, {"url": "http://www.nycroads.com/crossings/triborough/", "passage_text": "At that time, Ammann had held the position of chief engineer at the Port of New York Authority for seven years. LEFT: The Triborough Bridge suspension span between Queens and Ward's Island, as shown under construction in 1934. During this first phase of the project, the suspender ropes on the main span are being replaced. The westbound exit ramp from the bridge to 31st Street was extended along the viaduct, taking out part of the westbound walkway."}, {"url": "http://www.nyc-architecture.com/BRI/BRI009-TriboroughBridge.htm", "passage_text": "The Triborough Bridge is a complex of three bridges connecting the New York City boroughs of the Bronx, Manhattan, and Queens, using what were two islands, Ward's Island and Randall's Island as intermediate rights-of-way between the water crossings. These two islands have been consolidated by landfill. The bridges span the Hell Gate (a tidal channel of the East River), Harlem River, and Bronx Kill. Construction had begun on Black Friday in 1929, and the Triborough project's outlook began to look bleak."}]