[{"url": "http://www.biography.com/people/banksy-20883111", "passage_text": "Synopsis. Banksy, a street artist whose identity remains unknown, is believed to have been born in Bristol, England, around 1974. He rose to prominence for his provocative stenciled pieces in the late 1990s. Banksy's identity remains unknown, despite intense speculation. The two names most often suggested are Robert Banks and Robin Gunningham. Pictures that surfaced of a man who was supposedly Banksy pointed toward Gunningham, an artist who was born in Bristol in 1973."}, {"url": "http://www.stencilrevolution.com/profiles/about-banksy/", "passage_text": "Banksy has been active on the graffiti scene since the early 1990s. He was first associated with a gang of underground street artists in Bristol who were known as the DryBreadZ Crew (DBZ). In Bristol, he partnered with Inkie and other notable artists who still work with Banksy. If Banksy is Gunningham, which he has denied, he was born in 1973 and had surgery early in life to repair a cleft palate. Banksy also created a pseudo self-portrait that features a picture of Gunningham. Recent news reports have followed Mrs. Banksy, a political activist known as Joy Millward."}, {"url": "https://en.wikipedia.org/wiki/Banksy", "passage_text": "Observers have noted that his style is similar to Blek le Rat, who began to work with stencils in 1981 in Paris. Banksy says that he was inspired by 3D , a graffiti artist who later became a founding member of Massive Attack, an English musical group. Banksy displays his art on publicly visible surfaces such as walls and self-built physical prop pieces. There has also been speculation that Banksy is a woman, or that Banksy is a team of seven artists. In October 2014 an internet hoax circulated that Banksy had been arrested and his identity revealed. It has been stated that the reason for this secrecy is that graffiti is a crime."}, {"url": "https://en.wikipedia.org/wiki/Banksy", "passage_text": "Because of the secretive nature of Banksy's work and identity, it is uncertain what techniques he uses to generate the images in his stencils, though it is assumed he uses computers for some images due to the photocopy nature of much of his work. There has also been speculation that Banksy is a woman, or that Banksy is a team of seven artists. In October 2014 an internet hoax circulated that Banksy had been arrested and his identity revealed. It has been stated that the reason for this secrecy is that graffiti is a crime."}, {"url": "http://www.stencilrevolution.com/profiles/about-banksy/", "passage_text": "The fact that his identity remains unknown after 20 years on the graffiti scene only adds to the intrigue that surrounds his work. The works of Banksy have appeared in America, Australia, Canada, England, France, Israel, Jamaica and Palestine. Wherever Banksy goes, he makes an impact. If Banksy is Gunningham, which he has denied, he was born in 1973 and had surgery early in life to repair a cleft palate. Banksy also created a pseudo self-portrait that features a picture of Gunningham. Recent news reports have followed Mrs. Banksy, a political activist known as Joy Millward."}, {"url": "http://www.stencilrevolution.com/profiles/about-banksy/", "passage_text": "Banksy is the godfather of a new form of pop art that originated on the street. He used a foundation created by peers to spread powerful messages using accessible street art. Anyone can see Banksy’s stencil art, which enables him to reach a large audience and to make strong statements. If Banksy is Gunningham, which he has denied, he was born in 1973 and had surgery early in life to repair a cleft palate. Banksy also created a pseudo self-portrait that features a picture of Gunningham. Recent news reports have followed Mrs. Banksy, a political activist known as Joy Millward."}, {"url": "https://en.wikipedia.org/wiki/Banksy", "passage_text": "Banksy is an English-based graffiti artist, political activist and film director whose real identity is unknown. His satirical street art and subversive epigrams combine dark humour with graffiti executed in a distinctive stenciling technique. There has also been speculation that Banksy is a woman, or that Banksy is a team of seven artists. In October 2014 an internet hoax circulated that Banksy had been arrested and his identity revealed. It has been stated that the reason for this secrecy is that graffiti is a crime."}, {"url": "https://www.icanvas.com/banksy-prints-canvas-art.html", "passage_text": "Banksy. Banksy, born in the early 1974 in Yate, South Gloucestershire is a well-known pseudo name of a British graffiti artist. His early work was first showcased during Bristol aerosol boom of the late 1980s. Banksy's work generated a new-found global interest in street art. While his work can be found all over the world, most are located in Bristol, London and New York City. The HBO documentary Banksy Does New York released Oct. 31, 2014 showcases Banksy's New York Art. "}, {"url": "http://www.biography.com/people/banksy-20883111", "passage_text": "Banksy began his career as a graffiti artist in the early 1990s, in Bristol's graffiti gang DryBreadZ Crew. Although his early work was largely freehand, Banksy used stencils on occasion. In the late '90s, he began using stencils predominantly. His work became more widely recognized around Bristol and in London, as his signature style developed. Banksy's artwork is characterized by striking images, often combined with slogans. His work often engages political themes, satirically critiquing war, capitalism, hypocrisy and greed. Banksy's identity remains unknown, despite intense speculation. The two names most often suggested are Robert Banks and Robin Gunningham. Pictures that surfaced of a man who was supposedly Banksy pointed toward Gunningham, an artist who was born in Bristol in 1973."}]