[{"url": "https://www.facebook.com/notes/royal-bakery/horizontal-stripes-tutorial/464123946942244", "passage_text": "Take a piece of real ribbon that is the width of the gap you want between your first and second strips. I used a piece that was 3/8 wide. Pin one end of the ribbon to the back of the cake, above the seam of your fondant strip. Wind the ribbon all the way around your cake, resting it on top of the fondant strip. If you want to add stripes to the to of the top of the cake, repeat the steps above but use the top of the cake as a guide for your first strip. It is safer to gently coil your strip up and rest it on top of the tier as you unwind it to glue it into place."}, {"url": "http://www.make-fabulous-cakes.com/fondant-ribbon-roses.html", "passage_text": "Here is a illustrated guide on how to make fondant ribbon roses. The tools that I used were a ruler and pizza cutter. I used a ruler as a guide when cutting the fondant with the pizza cutter. You can use a knife or metal spatula in place of the pizza cutter. METHOD. Color the fondant to desired shade. Once it's rolled all the way to the end, cut the excess part off. Next for the leaves, cut the fondant into squares. What I do is roll out the fondant and cut a big square, then I cut smaller squares. This helps the production faster."}, {"url": "http://www.craftsy.com/article/how-to-ruffle-fondant", "passage_text": "1 A cake! 2  Any cake will work, preferably a cake covered in fondant. 3  You can also use a buttercream cake. 4  A Mat to roll out your fondant-I love The Mat System, especially for ruffles and other detail work because the fondant will stay airtight for hours without having to reroll your dried out fondant. Ruffling. Starting with your bottom color, take one strip of fondant and place it on your sponge or foam board, then using your ball tool, gently run the ball tool along one edge, keeping the ball halfway on the fondant and halfway on the foam. You do not need to twist the ball tool."}, {"url": "http://rosebakes.com/how-to-do-fondant-ruffles-on-a-cake/", "passage_text": "Step 1: Take a ball of fondant and roll it out into a long strip. I don’t have a measurement, but you want it pretty thin! Then using the ribbon cutter *, cut strips – for this cake, they were about 1.5 inches wide. Separate out a single strip of fondant and dust it with a little corn starch (not pictured). Slide your foam pad under one end of the strip and you’re about ready to make it ruffly. Step 3: Now, this is where the video will come in handy (scroll down below the two pics to find it)…."}, {"url": "http://www.craftsy.com/blog/2013/03/how-to-make-a-fondant-bow/", "passage_text": "Adding Ribbon. Once your bow has been formed, roll out the remaining fondant and cut it to make the ribbon tails. I have found it is best to cut a long strip and then cut a V in the middle. This will give you the classic cut for the tails of a ribbon. Gather the straight ends and arrange the tails. "}, {"url": "http://www.youtube.com/watch?v=9KMXtHF60KY", "passage_text": "Learn how to use the easy pre-rolled, pre-cut, & pre-embossed Fondant Ribbon. It makes decorating any type of cake so simple. Finish your wedding or birthday cake in seconds. Perfect to use on buttercream and fondant cakes. And if you don't use fondant, now you do!!! It's so easy, you won't believe it. (Video is 3:34 min). Shop Fondant Ribbon: http://caljavaonline.com/collections/..."}, {"url": "http://rosebakes.com/how-to-add-ribbons-and-ribbon-borders-to-cake/", "passage_text": "For the ribbons on the side of the cake, start by rolling out your fondant and measuring to be sure it’s long enough to go from the bottom of the cake, up the side and all the way to the middle. Then you’re going to use your pizza wheel or ribbon cutter to cut ribbons… I did mine about 2″ wide. You could also do this with just a knife or an Xacto blade. Then I cut the ribbons in half…. Then cut the ribbons in half… and get ready to put them on the cake by painting a line of water (or sugar water) on the side."}, {"url": "http://candy.about.com/od/phototutorials/ss/fondant_cake_sbs.htm", "passage_text": "This tutorial will teach you how to cover a cake with fondant. Fondant-covered cakes have a smooth, professional look that's easy to achieve at home with a little practice and patience. For an easily printable recipe, please see this page on covering a cake with fondant. 2. Now position your other hand on the side of the cake toward the top and press the fondant into the side. Use your hands together to press toward each other, forming the corner of the cake."}]