[{"url": "http://www.ehow.com/about_6521997_poured-walls-vs_-concrete-block.html", "passage_text": "Cost. In 2002, the cost of installing blocks per square foot was roughly $3, including labor and materials. During the same year, the cost of installing poured concrete was around $6 per square foot, including material and labor. As of 2010, even though the labor cost has remained the same, the material costs have risen by $1. However, these costs change when you remove the labor cost from the two and decide to do it yourself. The concrete block price drops by $1 per square foot, and the poured concrete price drops by $3."}, {"url": "http://www.ehow.com/info_7931795_cost-foundation-cinder-block-foundation.html", "passage_text": "Considerations. Extras can drive up the cost of both a concrete foundation and concrete block. For instance, an exposed poured concrete foundation may be colored or faux-finished to look like stone. This can increase the cost of your foundation to as much as $4.50 per square foot. The price of concrete varies by region, but as of 2008, it averaged around $75 per cubic yard, or just under $3 per cubic foot. Concrete also requires forms and finishing work at between $1 and $1.50 per square foot and reinforcement with rebar or mesh at a cost of about $.1"}, {"url": "http://www.askthebuilder.com/poured-concrete-vs-block-walls/", "passage_text": "Vertical reinforcing steel is also very important. This steel can be put in both a poured concrete foundation and a concrete block wall that will have the hollow voids filled with cement grout or pea gravel concrete. After the concrete blocks are laid, the voids can be filled with a cement-based mortar or poured concrete that contains small pea gravel. If the builder does this, then the filled concrete block walls are nearly identical to poured concrete walls."}, {"url": "http://highriseindustriesinc.com/concrete-block-foundations-versus-poured-concrete-foundations/", "passage_text": "The block foundation is constructed of large concrete blocks typically measuring 8 inches wide by 16 inches long, they do however, and many other sizes depending on the weight load of the building that’s to be constructed. I like to discuss the benefits of poured concrete foundations and they are as follows; 1. When the foundation treatments, the concrete forms can rapidly be put together quickly and taken down and reuse. 2. Laying a poured foundation can be quicker than building a cement block foundation. 3."}, {"url": "http://www.askthebuilder.com/poured-concrete-vs-block-walls/", "passage_text": "The truth of the matter is that both building materials-concrete block and poured concrete-can yield superior foundation walls so long as they are installed correctly. All too often builders and sub-contractors fail to realize the limitations of certain masonry materials. After the concrete blocks are laid, the voids can be filled with a cement-based mortar or poured concrete that contains small pea gravel. If the builder does this, then the filled concrete block walls are nearly identical to poured concrete walls."}, {"url": "http://www.ehow.com/info_7931795_cost-foundation-cinder-block-foundation.html", "passage_text": "Poured Concrete. According to the Concrete Network, the majority of the cost of a concrete foundation is the concrete itself. The price of concrete varies by region, but as of 2008, it averaged around $75 per cubic yard, or just under $3 per cubic foot. Concrete also requires forms and finishing work at between $1 and $1.50 per square foot and reinforcement with rebar or mesh at a cost of about $.10 per square foot."}, {"url": "http://www.askthebuilder.com/poured-concrete-vs-block-walls/", "passage_text": "You can strengthen poured concrete and concrete block walls by including reinforcing steel. Often you will see horizontal steel bars placed in the lower and upper sections of poured foundation walls. This steel often has a tensile strength of 40,000 pounds per square inch. After the concrete blocks are laid, the voids can be filled with a cement-based mortar or poured concrete that contains small pea gravel. If the builder does this, then the filled concrete block walls are nearly identical to poured concrete walls."}, {"url": "http://www.concretenetwork.com/concrete/poured_concrete_retaining_walls/cost.html", "passage_text": "Retaining Wall Cost. Poured retaining walls with elaborate curves require complex formwork and will drive up cost for a wall. The total cost to have a concrete retaining wall installed will be a combination of material and labor prices. For a basic wall you can expect to pay between $30 and $40 per square foot. If you add a decorative finish, curves, steps, lighting or other upgrades, the cost will rise"}, {"url": "http://www.homeadditionplus.com/foundation-info/Concrete-Block-vs-Poured-Concrete-Foundations.htm", "passage_text": "Poured foundation walls can typically be constructed much more quickly than concrete block based foundations, thus saving both time and money. The complete process of installing concrete forms, pouring the concrete, and breaking the forms down can take as little as 2 or 3 partial days of work. Poured concrete foundations are usually 6-10 inches thick and joint-free, unlike concrete block walls. Consequently they are considered to produce stronger and drier foundation walls, critical for basement walls. Standard concrete blocks contain hollow cells designed to support rebar / steel reinforcing rods, as well as poured concrete/mortar, to maximize wall strength. Besides the standard size concrete block there are a number of alternative sizes, shapes, textures and color tones to choose from."}, {"url": "http://home.costhelper.com/house-foundation.html", "passage_text": "1 A slab foundation for an average 1,600- to 1,800-square-foot family home might cost about $7,000-$16,000 or more, while a slab foundation for a 3,000- to 4,500-square-foot home might cost $13,000-$40,000 or more. 1 And an Illinois log cabin owner-builder estimates about $17,000 in costs for a 24'x36' basement foundation with 8' walls with the concrete poured professionally but the rest done as a serious DIY project.."}]