[{"url": "http://www.urbandictionary.com/define.php?term=HML", "passage_text": "hml. Internet slang for hurt(/ing) myself laughing to express pain in finding something funny, either from being sore in the stomach muscles from laughing so much, from finding it hard to breathe from laughing too hard, or from falling off your chair while laughing. "}, {"url": "http://www.digitaltrends.com/home-theater/what-is-mhl-and-how-does-it-work/", "passage_text": "A typical MHL adapter. After plugging in a compatible device, you’ll then see all of its applications, games, movies, photos, and music right on your television display. For those without cable or Internet, an MHL connection essentially turns your HDTV into a full-blown entertainment center with one simple plug-in. Because of the general lack of knowledge surrounding MHL and how it works with TVs, A/V receivers, smartphones, and tablets, we’ve decided to lay out the basics in a simple walkthrough. The following covers everything there is to know about MHL — what is is, where it’s used, etc."}, {"url": "http://gizmodo.com/5873143/what-is-mhl", "passage_text": "MHL stands for Mobile High-Definition Link, which is a recently introduced standard connection…. The specification for the audio-connection connection was introduced in 2010 by a consortium of major electronics companies including Nokia, Sony, Samsung, and Toshiba. Between the Roku Streaming Stick and these Samsung displays we've seen a few recent products equipped with a new audio/visual connection called MHL. It is not a new way to view hockey."}, {"url": "http://gizmodo.com/5873143/what-is-mhl", "passage_text": "… that is already available on a few products…. So far, only a few devices are MHL capable. These include the Samsung Galaxy S II and Galaxy Tab, several HTC phones including the Amaze 4G as well as the brand new Roku Streaming Stick. Between the Roku Streaming Stick and these Samsung displays we've seen a few recent products equipped with a new audio/visual connection called MHL. It is not a new way to view hockey."}, {"url": "http://gizmodo.com/5873143/what-is-mhl", "passage_text": "… intended to simplify linking mobile devices to HD displays…. The specification is designed to connect smartphones and tablets to HDTVs and HD displays—two types of products don't work together very well yet. But in theory, MHL could be used to connect a variety of devices to each other. Between the Roku Streaming Stick and these Samsung displays we've seen a few recent products equipped with a new audio/visual connection called MHL. It is not a new way to view hockey."}, {"url": "http://www.investopedia.com/terms/h/high_minus_low.asp", "passage_text": "DEFINITION of 'High Minus Low-HML'. One of three factors in the Fama and French asset pricing model. HML accounts for the spread in returns between value and growth stocks. HML argues that companies with high book-to-market ratios (value stocks) outperform those with low ones (growth stocks). "}, {"url": "http://www.askmefast.com/What_does_Hml_mean_in_texting-qna389108.html", "passage_text": "1 Answer. 1. 1. My suggestion is tto go straight to the police let them handle it. source: I have a person that i found out was texting my husband and i asked them to stop texting him because he is married. "}, {"url": "http://gizmodo.com/5873143/what-is-mhl", "passage_text": "… and you can expect more on the way. Speaking of more products, we've already seen a few new MHL ready products in advance of CES. Don't be surprised if you see a bunch more next week, especially from MHL consortium member Sony, which has a long history of introducing slews of new gearat CES. Between the Roku Streaming Stick and these Samsung displays we've seen a few recent products equipped with a new audio/visual connection called MHL. It is not a new way to view hockey."}, {"url": "https://answers.yahoo.com/question/index?qid=20110515094518AA2LAhq", "passage_text": "What does hml mean!? people on facebook say hml alot ! is it something like hmu? cuz they say it like when they are happy so i'm guessing it's not hate my life .. "}, {"url": "http://netforbeginners.about.com/od/h/f/What-Is-HMU-Hit-Me-Up.htm", "passage_text": "Answer: HMU is Hit Me Up. This acronym is used to say contact me, text me, phone me or otherwise reach me to follow up on this. It is a modern shorthand way to invite a person to communicate with you further. HMU is also spelled in all lowercase as 'hmu'. Both uppercase and lowercase versions mean the same thing, and you are welcome to use either. Just avoid typing entire sentences in uppercase, as that is considered rude shouting online. Example of HMU usage: ( 1 User 1): Hey, I could use some good advice on winter tires"}]