[{"url": "http://www.improvenet.com/r/costs-and-prices/clapboard-siding", "passage_text": "Minimum Costs: $5 per square foot. Maximum Costs: $10 per square foot. For a 1,500-square-foot home, the average cost for clapboard installation can be between $7,500 and $15,000. Redwood siding costs around $6 to $9 per square foot while cedar siding costs $6 to $7 per square foot. Cheaper options such as pine, fir and spruce cost $5 to $6 per square foot. Cost depends on home size, area, type of wood and thickness of the board. "}, {"url": "http://www.vinylsidingprices.co/materials/cedar-shake-siding-prices.html", "passage_text": "Cost of Installation. Cedar siding prices for installation vary from $1.00 to $2.00 per square foot. The installation of shingles is an easy process which can be accomplished using a nail gun. The price is along similar lines to that of vinyl siding. You can expect a raise in price to $2 per square foot should the shingles need to be treated or stained on site. Cost of Installation: $1 - $2 per sq. ft."}, {"url": "http://budgeting.thenest.com/average-cost-siding-removal-replacement-23085.html", "passage_text": "Contractor costs can be up to $50 per hour, so you may be able to save some money if you do the work yourself. The price for materials varies, but the cost of the siding itself is only a fraction of the overall price tag. For example, vinyl siding can range between $1.67 and 3.74 per square foot. Aluminum siding can cost between $2.40 and $5.00 per square foot. Insulated vinyl siding costs between $2.12 and $5.04 per square foot. Fiber cement siding costs between $2.07 and $5.64 per square foot. In addition to the basic materials you will need a vapor barrier, soffit and facia for the eaves, and corner trim. "}, {"url": "http://www.qualitysmith.com/request/articles/articles-siding/cost-of-siding-installation/", "passage_text": "The cost of siding installation will vary greatly from house to house, so your home will have it’s own unique quote. Aluminum Siding. Aluminum siding generally runs around $3 per square foot. Aluminum siding will cost anywhere from $3,000-$9,000, depending on the size of your home. A cozy bungalow will obviously cost less to side than that mansion on the hill. Wood siding installation will vary depending on lumber prices in your region, but wood siding is generally more expensive than vinyl or aluminum. If wood siding is what you’re looking for, you’re going to be spending at least $6,000 for a small home sided with pine."}, {"url": "http://www.howmuchisit.org/cedar-siding-cost/", "passage_text": "1 Pre-stained cedar siding can vary anywhere between $1.80 to $4 per square foot, depending on the type of cedar. 2  For example, the online retailer BuildDirect.com sells cedar siding from $5 to $8 per piece. 3  The cedar sidings that they offer come in different measurements as well as colors. 1 On average, the price for the cedar siding can range anywhere from $3 to $8 for cedar siding that has an 1 x 6 to 1 x 8 inches measurement. 2  Pre-stained cedar siding can vary anywhere between $1.80 to $4 per square foot, depending on the type of cedar"}, {"url": "http://www.howmuchisit.org/cedar-siding-cost/", "passage_text": "1 Labor cost can be considered an additional cost as well since cedar siding would almost always require the help of professional contractors for installation. 2  On average, a contractor can cost anywhere from $4,500 to $7,000 to install 1,000 square feet of cedar. 3  Unlike vinyl siding, cedar siding can wear out over time. 1 On average, the price for the cedar siding can range anywhere from $3 to $8 for cedar siding that has an 1 x 6 to 1 x 8 inches measurement. 2  Pre-stained cedar siding can vary anywhere between $1.80 to $4 per square foot, depending on the type of cedar"}, {"url": "http://www.vinylsidingprices.co/materials/cedar-shake-siding-prices.html", "passage_text": "Cedar Shake Siding Prices. Homeowners can expect cedar shake siding prices to vary from $3 - $6.50 installed. The price is inclusive of all costs including the shake shingles, installation, project materials and labor. Price Range: $3 - $6.50 per sq. ft. installed. The price is along similar lines to that of vinyl siding. You can expect a raise in price to $2 per square foot should the shingles need to be treated or stained on site. Cost of Installation: $1 - $2"}, {"url": "http://home.costhelper.com/wood-siding.html", "passage_text": "1 Typically it averages $6,500-$7,500 to have a contractor install 1,250 exterior square feet of yellow pine, spruce or fir clapboard (overlapping rows); $7,000-$8,500 for cedar clapboard over that same size area; and $9,000-$10,000 for cedar shingles (also called cedar shakes). 1 For 3,000 exterior square feet, costs jump to $14,500-$16,000 for yellow pine, spruce or fir clapboard; $15,000-$17,000 for cedar clapboard; and $18,000-$25,000 for cedar shakes. 2  Redwood, which is hard to obtain outside of the western states, costs about the same as or a little more than cedar"}]