[{"url": "http://drlumbago.com/pinched-nerve-neck-pain-relief-compression-treatment-causes-cause-symptoms-cervical-wry-crick-kink/", "passage_text": "Pinched nerves hurt, and large nerves in the neck that get pinched cause severe neck pain.Major nerves in the neck that branch off from the spine that go down into the arms and hands can sometimes get pressed upon in various ways and are pinched as they exit the spinal column. Regardless of where or how the nerve is pinched, symptoms of pain, numbness, tingling or weakness of the neck and arms occur. It is difficult to locate the area of actual pinching because these symptoms are registered in the brain as thought the entire nerve is involved when only one small part is being pinched."}, {"url": "http://drlumbago.com/pinched-nerve-neck-pain-relief-compression-treatment-causes-cause-symptoms-cervical-wry-crick-kink/", "passage_text": "A nerve can be pinched anywhere along its path. It is commonly compressed as it leaves the spine by a bulged or herniated disc, or bone spurs that are part of the changes of spinal arthritis. Regardless of where or how the nerve is pinched, symptoms of pain, numbness, tingling or weakness of the neck and arms occur. It is difficult to locate the area of actual pinching because these symptoms are registered in the brain as thought the entire nerve is involved when only one small part is being pinched."}, {"url": "http://www.necksolutions.com/pinched-nerve.html", "passage_text": "Most commonly, arm weakness & pinched nerve is experienced in the 4th or 5th decade of life. Typical symptoms of a pinched nerve in the neck may be pain, tingling, numbness or muscle weakness in specific areas related to the path that the nerve travels. The symptoms are sometimes made worse by coughing, sneezing or straining as in moving the bowels."}, {"url": "https://www.laserspineinstitute.com/back_problems/pinched_nerve/", "passage_text": "To put it another way, when a person has a pinched nerve in the neck, localized pain can develop, as well as discomfort that travels along the length of the affected nerve, along with numbness and tingling in the fingertips, muscle weakness in the upper body and other similar symptoms. A pinched nerve is a nerve under pressure. This pressure often comes from surrounding bone or soft tissues. A nerve under enough pressure will lose its ability to carry accurate signals, and its wayward signals can cause a variety of sensations in the body."}, {"url": "http://umm.edu/programs/spine/health/guides/cervical-spinal-stenosis", "passage_text": "Pressure on the nerves in the spinal cord can cause numbness, tingling, or pain in the arms, hands, and legs. This condition is sometimes called cervical myelopathy. It is from the simpler problem where only one nerve root is being pinched by a herniated disc or a bone spur. "}, {"url": "http://www.firmoo.com/answer/question/11178.html", "passage_text": "Daniel gerard. Yes, your pinched nerve will cause blurred vision because the neck nerves are interlinked with eye nerves. You'd better find some medical way to treat your neck problems. About your blurred vision, you could use some eye drops to release the symptom and make the eyes get moisture and comfortable. Answers (4). handsdown9871. Yes, it can. Theoretically, the nerves on your neck which connects your eyes and the visual area of your brain can affect your vision, leading to blurred vision. In this case, your eyes and vision are fine, but the blurred vision occur as a result of nerve damage."}, {"url": "http://www.necksolutions.com/pinched-nerve.html", "passage_text": "Pain In The Neck or scapular region is one of the most frequent symptoms of a pinched nerve. This neck pain usually is the first sign of radiculopathy and can appear before any symptoms of pain, numbness, or weakness in the arms or fingers. Typical symptoms of a pinched nerve in the neck may be pain, tingling, numbness or muscle weakness in specific areas related to the path that the nerve travels. The symptoms are sometimes made worse by coughing, sneezing or straining as in moving the bowels."}, {"url": "http://twinboro.com/body/spine/cervical/nerve/conditions/cervical-pinched-nerve-nj.html", "passage_text": "1 Muscle weakness may occur on any muscle that is innervated by the pinched nerve. 2  Long term pressure on the nerve can produce atrophy or wasting of that particular muscle. 3  Pain in the neck or radicular to the shoulder blade and arm. 4  Pain and tenderness localized at the level of the involved nerve. "}, {"url": "https://www.laserspineinstitute.com/back_problems/pinched_nerve/", "passage_text": "All told, a pinched nerve in the cervical region of the spine can lead to pain in the neck, shoulders, biceps, forearms, hands, fingers and various upper body muscle groups. Similarly, a pinched nerve in the lumbar region of the spine (lower back) can cause a variety of symptoms, including low back pain. A pinched nerve is a nerve under pressure. This pressure often comes from surrounding bone or soft tissues. A nerve under enough pressure will lose its ability to carry accurate signals, and its wayward signals can cause a variety of sensations in the body."}]