[{"url": "http://phys.org/news/2015-06-renewable-energy.html", "passage_text": "These types of fuels are popular alternatives to gasoline, and can be burned in vehicles that have been converted to run on them. Solar: Solar power (aka. photovoltaics) is one of the most popular, and fastest-growing, sources of alternative energy. However, it is important to note that are many kinds – biomass, solar, wind, tidal, and geothermal power – and that each has its own share of advantages and drawbacks. Biomass: The most widely used form of renewable energy is biomass."}, {"url": "http://readanddigest.com/what-are-the-different-types-of-energy-sources/", "passage_text": "Types of Energy Sources. There are two types of energy sources, Renewable and Non-Renewable sources. Renewable energy sources are sources that can be replenished or which are available naturally in excess. Non-Renewable energy sources are limited in their availability. Some of the many forms of energy are: 1  Kinetic energy. 2  Potential energy. 3  Gravitational energy. 4  Nuclear energy. 5  Chemical energy. 6  Heat energy. 7  Electrical energy. 8  Electromagnetic energy. 9  Sound energy. 10  Solar energy."}, {"url": "http://www.nmsea.org/Curriculum/Primer/forms_of_energy.htm", "passage_text": "Energy has a number of different forms, all of which measure the ability of an object or system to do work on another object or system. In other words, there are different ways that an object or a system can possess energy. Here are the different basic forms: Kinetic Energy: Consider a baseball flying through the air. "}, {"url": "http://readanddigest.com/what-are-the-different-types-of-energy-sources/", "passage_text": "If we have energy then work can be done. Energy is conserved in systems, meaning that it can neither be created nor destroyed but is inter-convertible into its different forms. Some of the many forms of energy are: 1  Kinetic energy. 2  Potential energy. 3  Gravitational energy. 4  Nuclear energy. 5  Chemical energy. 6  Heat energy. 7  Electrical energy. 8  Electromagnetic energy. 9  Sound energy. 10  Solar energy."}, {"url": "http://www.factmonster.com/ipka/A0907040.html", "passage_text": "Energy is the power we use for transportation, for heat and light in our homes and for the manufacture of all kinds of products. There are two sources of energy: renewable and nonrenewable energy. Nonrenewable Sources of Energy. Most of the energy we use comes from fossil fuels, such as coal, natural gas and petroleum. Uranium is another nonrenewable source, but it is not a fossil fuel. Uranium is converted to a fuel and used in nuclear power plants. Once these natural resources are used up, they are gone forever"}, {"url": "http://www.answers.com/Q/Identify_the_different_sources_of_the_energy", "passage_text": "The different sources of energy are: CoalMineral oilNatural gasHydroelectricityAtomic EnergyOther sources of Energy: sun, wind, tides, geothermal energy obtained in volcanic r … egions, biomass, farm and animal waste, including human excreta. 4 people found this useful. "}, {"url": "http://courses.washington.edu/engr100/Section_Wei/small_project/Energy%20Types1.pdf", "passage_text": "Energy Types In assignment 1, you tried to place the types, sources, and words associated with energy into 10 basic categories or types of energy. Since energy comes in so many forms and, as we will see, is also constantly changing from one form into another, selecting a perfect set of 10 basic types is not easy. The 10 Types of Energy Kinetic energy is energy of motion-the energy is contained in the movement of the object or movement inside of the object. Potential energy is stored energy, energy that can be kept for use at a later time."}, {"url": "http://www.conserve-energy-future.com/AlternativeEnergySources.php", "passage_text": "Solar energy is one the alternative energy source that is used most widely across the globe. About 70% of the sunlight gets reflected back into the space and we have only 30% of sunlight to meet up our energy demands. Dams around the world have been built for this purpose only. Hydropower is the largest producer of alternative energy in the world. There are different types of hydropower plants. The selection of hydropower plant depends on many volume and flow of water. Hydropower is renewable, constant, predictable and controllable source of energy"}]