[{"url": "https://en.wikipedia.org/wiki/Reference_implementation", "passage_text": "In the software development process, a reference implementation (or, less frequently, sample implementation or model implementation) is the standard from which all other implementations and corresponding customizations are derived. An improvement to a reference implementation reflects an unchanging specification. From Wikipedia, the free encyclopedia. A reference implementation is, in general, an implementation of a specification to be used as a definitive interpretation for that specification (This definition is a bit grandiloquent but works). During the development of the .."}, {"url": "https://blogs.oracle.com/henrik/entry/moving_to_openjdk_as_the", "passage_text": "The role of the Reference Implementation (RI) is to be used as the gold standard for all Java implementations. In order to have an implementation certified as Java SE compatible, an implementor must pass a large number of compatibility tests-the Technology Compatibility Kit (TCK). In parallel with the development project, Oracle and the other members of the Java SE 7 Expert Group have been putting the finishing touches to the Java SE 7 specification (JSR 336). In its role as the specification lead, Oracle is responsible for delivering the Java SE 7 Reference Implementation."}, {"url": "https://jdk8.java.net/java-se-8-ri/", "passage_text": "Java Platform, Standard Edition 8 Reference Implementations. The official Reference Implementations for Java SE 8 (JSR 337) are based solely upon open-source code available from the JDK 8 Project in the OpenJDK Community. Binaries are provided for both the Linux x64 and Windows i586 platforms and Compact Profiles for Linux i586. These binaries are for reference use only! These binaries are provided for use by implementers of the Java SE 8 Platform Specification and are for reference purposes only. These draft Reference Implementations are under review prior to being submitted for final approval in the Java Community Process."}, {"url": "https://jdk7.java.net/java-se-7-ri/", "passage_text": "Java Platform, Standard Edition 7 Reference Implementations. The official Reference Implementations for Java SE 7 (JSR 336) are based solely upon open-source code available from the JDK 7 Project in the OpenJDK Community. Binaries are provided for both the linux-x64 and windows-i386 platforms. The official Reference Implementations for Java SE 7 (JSR 336) are based solely upon open-source code available from the JDK 7 Project in the OpenJDK Community"}, {"url": "http://stackoverflow.com/questions/22824843/what-does-reference-implementation-means", "passage_text": "I have come across reference implementation terminology very often. For example, Alternatively, you can use the constructor from the CachedRowSet implementation of your JDBC driver. **However, implementations of the RowSet interface will differ from the reference implementation**. These implementations will have different names and constructors. For example, the Oracle JDBC driver's implementation of the CachedRowSet interface is named oracle.jdbc.rowset.OracleCachedRowSet.. "}, {"url": "http://stackoverflow.com/questions/40480/is-java-pass-by-reference-or-pass-by-value", "passage_text": "Usually in Java reference means a a reference to an object. But the technical terms pass by reference/value from programming language theory is talking about a reference to the memory cell holding the variable, which is someting completely different. If you pass in an object, what you're actually passing in is the address of the object. Some might say the value of the address, and some say it's just a reference to the object. This is the genesis of the holy war between reference and value proponents."}, {"url": "https://jaxp.java.net/", "passage_text": "Project Description. Welcome to the JAXP Reference Implementation Project. This project is part of Project GlassFish and is in the JWSDP subcommunity on Web Services and XML at java.net. This project develops and evolves the code base for the reference implementation of the JAXP specification."}]