[{"url": "http://www.bluewrenstudio.net/hand-carded-wool-batts-for-felting-and-spinning/", "passage_text": "All of Blue Wren Studio’s carded wool batts are made from Tasmanian grown merino fleece. The entire process of going from raw, unprocessed fleece to finished carded wool batts is done entirely by hand. That’s right."}, {"url": "http://www.winghamwoolwork.co.uk/103-carded-wool", "passage_text": "Carded Wool Batts There are 24 products. In response to the needs of feltmakers who need a more robust wool than merino we have produced a range of carded wools that are of a higher micron than the merino range."}, {"url": "http://www.worldofwool.co.uk/products/249/carded_wool_batts/merino_batts.htm", "passage_text": "HOME: CARDED WOOL BATTS: MERINO BATTS. Here is a selection of Carded Merino batts. The batts are made using 23 Micron wool, each batt is approx 40cm x 150cm in size, and approx 2-4cm thick. They are sold in 200g increments."}, {"url": "http://www.worldofwool.co.uk/products/249/carded_wool_batts/merino_batts.htm", "passage_text": "Merino Batts. Here is a selection of Carded Merino batts. The batts are made using 23 Micron wool, each batt is approx 40cm x 150cm in size, and approx 2-4cm thick. They are sold in 200g increments."}, {"url": "http://www.worldofwool.co.uk/products/248/carded_wool_batts.htm", "passage_text": "Carded Wool Batts. Our carded batts are all manufactured on site, and carefully carded to give you the best results for your projects. We have a selection of Carded Wool Batts in natural and dyed shades, and also some Luxury batts for those special projects."}, {"url": "http://www.bennettandgregor.com/products/in-the-woolroom/carded-wool-batts-for-feltmaking", "passage_text": "This naturally coloured carded wool is produced from our own top quality, soft handling Corriedale and Merino type fleeces, which are colour sorted, gently scoured (washed), and then carded into large flat batts of uniform size and thickness, approx 2.4 x 1.8 metres (6’x 8′) in area, and approx 2cm (1″) thick."}, {"url": "http://www.bluewrenstudio.net/hand-carded-wool-batts-for-felting-and-spinning/", "passage_text": "As you can see, going from unprocessed fleece to finished hand carded wool batts is a very labour intensive process. However, we strongly believe one of the biggest advantages of processing our wool batts by hand is that they are far superior to machine processed batts."}]