[{"url": "http://www.webmd.com/fitness-exercise/guide/how-to-stretch", "passage_text": "Stretching a muscle to the full extent of your ability and holding it for 15 to 30 seconds is what's called a static stretch, and there's no harm in stretching that way as long you don't stretch until it hurts. "}, {"url": "https://www.sharecare.com/health/stretching-exercise-warm-up/how-long-hold-stretch-for", "passage_text": "A Dr. Harris McIlwain, MD, Rheumatology, answered. Gently stretch as far as you can, hold the stretch for 30 seconds, and then ease back. Studies show that holding a stretch for 30 seconds produces the same result as holding it for 60 seconds. You will feel a gentle stretch but should not have pain or discomfort. As your muscle adapts, the stretch feeling will diminish"}, {"url": "http://www.runnersworld.co.uk/beating-injury/qa-how-long-should-i-hold-a-stretch/715.html", "passage_text": "Q On a recent visit to a podiatrist I was given a stretching programme in which I was told to hold each stretch for up to 15 minutes. I was surprised by the length of these stretches, as Ive always been told that you should do stretches in three sets of 30 seconds. People can be told to hold stretches from a few seconds to a few minutes, and very definite time periods in between. There is a body of evidence that suggests stretch receptors disengage after approximately 30 seconds of stretching. The standard 3 x 30 seconds on that basis is therefore well considered."}, {"url": "http://www.livestrong.com/article/328926-how-long-to-hold-stretches/", "passage_text": "Before Stretching. Never stretch a cold muscle. Prior to stretching, do about five to 10 minutes of light warm-up activity. Many fitness experts now recommend stretching after a workout instead of before it. Even stretching every day, however, will not give you this benefit unless you perform stretches correctly and hold them for the correct amount of time. Holding them for too short a period defeats the purpose and holding them too long increases your chances of injury."}, {"url": "http://www.popsugar.com/fitness/How-Long-Should-I-Hold-Stretch-25933624", "passage_text": "1 Static stretch: Static stretches, holding a muscle in a lengthened position for between 15 and 20 seconds, are best done in sets of four, according to the American Journal of Sports and Medicine. 2  These stretching exercises, performed daily, will provide the optimum gain for your muscles and ligaments. 1 Warmer muscles are more elastic and respond better to stretching than cold ones. 2 "}, {"url": "http://www.livestrong.com/article/511702-how-long-should-a-warm-up-last/", "passage_text": "Static stretches are those that are held in a stationary position. Hold static stretches for 30 seconds while breathing deeply through the stretch. While most of your static stretching should be done during your cool-down to improve flexibility, some static stretching should be included in your warm-up. Before you do a workout of any kind, you need a thorough warm-up. The warm-up portion of your workout helps to get your muscles ready for action. Thoroughly warming up can help you prevent injury and improve your performance during the workout. How long your warm-up will be depends on what kind of workout you are doing."}, {"url": "https://www.sharecare.com/health/flexibility-training/long-should-hold-a-stretch", "passage_text": "The best way to stretch is to warm up for at least 5 to 10 minutes before you stretch. It can be dangerous to stretch a cold muscle. Once you’re ready to stretch, hold the stretch for 5 seconds, release for 5 seconds, and then execute again, holding for 10-30 seconds. Repeat two or three times. And definitely don’t hearken back to the 80s and bounce. It’s not a good idea."}, {"url": "http://www.livestrong.com/article/328926-how-long-to-hold-stretches/", "passage_text": "Maintain each stretch for about 30 seconds. Holding the position for a longer period increases your chances of tearing the muscle. Holding a stretch for as much as 10 seconds less will make your time efforts less effective. Even stretching every day, however, will not give you this benefit unless you perform stretches correctly and hold them for the correct amount of time. Holding them for too short a period defeats the purpose and holding them too long increases your chances of injury."}, {"url": "http://thewalkingsite.com/stretching.html", "passage_text": "2) Flexibility exercises-These exercises are part of your warm up and should be done after you have warmed up with 5 to 10 minutes of easy walking. The faster you plan to walk the more time you will need to dedicate to flexibility exercises. There are many different exercises in this group. Here are a few to try: "}]