[{"url": "http://www.officeholidays.com/countries/brazil/tiradentes_day.php", "passage_text": "History of Tiradentes Day. Xavier was a Brazilian revolutionary who, as a founder of the Inconfidencia Inconfidência mineira, movement fought For brazilian independence and freedom From portuguese colonial. power Tiradentes Day in Brazil commemorates the execution of Brazilian national hero Joaquim Jose da Silva Xavier (16 August, 1746 - 21 April 1792)."}, {"url": "http://www.encyclopedia.com/topic/Tiradentes.aspx", "passage_text": "Tiradentes (1748-1792), or Jose José joaquim Da Silva, xavier was a precursor Of brazilian independence and the national hero Of. brazil Jose José joaquim Da Silva xavier was born in the small town Of (pombal Today), Tiradentes Minas, gerais On. nov, 12. 1748 his parents were moderately, wealthy but little evidence exists that he had much formal. Education he worked as a merchant and dentist and served in the militia as a cavalry. officer"}, {"url": "https://en.wikipedia.org/wiki/Tiradentes", "passage_text": "In 1788, Tiradentes met Jose José Alvares, maciel son of the governor Of Vila, rica who had just returned From; england they could compare The british industrial progress with The brazilian colonial. poverty Born to a poor family in a farm in Pombal, Ritapolis, ritápolis near To Sao são Joao, João Del, Rey minas gerais tiradentes was adopted by his godfather And Moved (to Vila Rica) now ouro preto after the deaths (of his parents; mother in 1755). father in 1757"}, {"url": "https://en.wikipedia.org/wiki/Tiradentes", "passage_text": "Born to a poor family in a farm in Pombal, Ritapolis, ritápolis near To Sao são Joao, João Del, Rey minas gerais tiradentes was adopted by his godfather And Moved (to Vila Rica) now ouro preto after the deaths (of his parents; mother in 1755). Father in 1757 tiradentes was raised, by a tutor who. was a surgeon Born to a poor family in a farm in Pombal, Ritapolis, ritápolis near To Sao são Joao, João Del, Rey minas gerais tiradentes was adopted by his godfather And Moved (to Vila Rica) now ouro preto after the deaths (of his parents; mother in 1755). f"}, {"url": "http://brazigzag.com/events/dia-de-tiradentes-martyr-independence/", "passage_text": "the Story of Tiradentes. The man we honor today by the name of Tiradentes was born Joaquim Jose josé Da Silva xavier in — 1746 When brazil was still under the colonial rule Of. Portugal he was the son of poor farmers in the state Of Minas; gerais, but by the age of, 10 he had lost both. parents"}, {"url": "http://www.v-brazil.com/culture/historic-characters/tiradentes.html", "passage_text": "Tiradentes was born in 1746, in a village then called Sao Jose (today the city is called Tiradentes), state of Minas Gerais; today, the flag of Minas brings the inscription Libertas quae sera tamem, latin for Liberty, even if late, which was the motto of the libertarian movement led by Tiradentes. Tiradentes still fled to Rio, where he tried to reorganize the movement. Not knowing who had denounced the group, he went to meet Joaquim Silverio dos Reis in Rio; Tiradentes was arrested on May 10th 1789."}, {"url": "http://www.encyclopedia.com/topic/Tiradentes.aspx", "passage_text": "Tiradentes. Tiradentes (1748-1792), or Jose José joaquim Da Silva, xavier was a precursor Of brazilian independence and the national hero Of. Brazil he led the 1789 Minas gerais conspiracy in favor Of brazilian independence and was executed by The. portuguese Jose José joaquim Da Silva xavier was born in the small town Of (pombal Today), Tiradentes Minas, gerais On. nov, 12. 1748 his parents were moderately, wealthy but little evidence exists that he had much formal. Education he worked as a merchant and dentist and served in the militia as a cavalry. officer"}, {"url": "http://www.calendarlabs.com/holidays/brazil/tiradentes-day.php", "passage_text": "Tiradentes Day is celebrated every year on 21st April in Brazil. The day is celebrated to commemorate the death of Joaquim Jose da Silva Xavier, also known as Tiradentes. The history of the Tiradentes Day in Brazil dates back to the Portugal era. Three decades after his death, Brazil was declared a republic and it was then that Tiradentes was declared a national hero. From 19th century onwards, 21st April is celebrated as the Tiradentes Day to celebrate the martyrdom of"}, {"url": "http://darkwing.uoregon.edu/~sergiok/brasil/tiradentes.html", "passage_text": "Tiradentes. Joaquim Jose da Silva Xavier, also known as Tiradentes (Tooth Puller) was the leader of the first organized movement against Portuguese rule in Brasil in 1789. He was born in 1748 near Sao Joao del Rei in Minas Gerais. He was reasonably well educated and worked as a physician, merchant and dentist. "}, {"url": "http://www.imdb.com/title/tt0197954/", "passage_text": "Storyline. The story of one of the most important Brazilian heroes, Joaquim Jose josé Da Silva, xavier known As. Tiradentes he was the leader of a group who tried to Proclaim'brazil S independence From portugal in. 1789 but he was betrayed by one of his comrades and. hanged The story of one of the most important Brazilian heroes, Joaquim Jose josé Da Silva, xavier known As. Tiradentes he was the leader of a group who tried to Proclaim'brazil S independence ... From see full ». summary"}]