[{"url": "http://www.customercarenumbers.co.in/freecharge-customer-care-number/", "passage_text": "Are you looking for Freecharge customer care number, we have provided customer care numbers and other contact details of Freecharge. Freecharge.in was founded in the year 2010, Headquarter in Mumbai, Maharashtra. They provide great services to their consumers."}, {"url": "http://customerkart.com/freecharge-customer-care-number/", "passage_text": "FreeCharge Customer Care Number. Free Charge is popular to provide online prepaid mobile recharge services. Dial the FreeCharge Customer Care Number for issues related to recharges, refunds of payment, delivery or non-delivery of coupons and vouchers etc."}, {"url": "http://asktogeek.com/threads/freecharge-customer-care-number-toll-free-or-helpline-no.338/", "passage_text": "FreeCharge.in is an e-commerce website headquartered in Mumbai, Maharashtra. It provides online facility to recharge any prepaid mobile phone, postpaid mobile, DTH & data card in India. The website was started in August, 2010 by Kunal Shah of Accelyst Solutions Pvt. Ltd.For more details contact +91-22-40770600."}, {"url": "http://www.customercarenumbers.co.in/freecharge-customer-care-number/", "passage_text": "Freecharge Customer care email address for Partnership: partner@freecharge.com. Freecharge Mumbai office address: Vaibhav Chambers, Unit No. 2A, 2nd floor, Bandra Kurla Complex, Bandra East, Mumbai, India, Pin code: 400051, Phone Number: +91-22-40363031. Freerecharge Website: www.freecharge.in. 1  Email."}, {"url": "http://www.1800customercare.com/freecharge-customer-care-number/", "passage_text": "The FreeCharge customer care can support majority of the cities in India from Delhi, Mumbai, Hyderabad, Pune, Kolkata, Chennai, Ahmedabad, Gurgaon etc. Freecharge Head Office Address. Office At – Vaibhav Chambers, Unit No. 2A, , Building – 2nd floor Bandra Kurla Complex,"}, {"url": "http://customer-carenumber.com/recharge/freecharge-customer-care-number/", "passage_text": "Free recharge is website for online recharge for prepaid mobile phones, data cards, DTH and Postpaid Mobile Bill Payment. You can call on FreeCharge Customer Care Number for any kind of issues related to freecharge like recharges, refunds of payment, delivery or non-delivery of coupons and vouchers etc."}]