[{"url": "http://www.military.com/benefits/military-pay/military-travel-and-per-diem-rates.html", "passage_text": "The Per Diem Allowance. Each year the DoD Per Diem, Travel and Transportation Committee sets the Per Diem allowance. The Per Diem is specific to a given travel location and can range from a standard CONUS rate from $140 per day up to $702 per day for Out-of-CONUS rates. The per diem ta bles on this website have the PMRs already computed. The examples below using the Standard CONUS M&IE rate of $46.00 and the Standard GMR of $11.85 show how to compute a PMR amount. The $46.00 consists of $41.00 for meals and $5.00 for incidental expenses."}, {"url": "https://gsablogs.gsa.gov/gsablog/2014/08/15/new-per-diem-rates-for-federal-travelers-released/", "passage_text": "Today we released the fiscal year (FY) 2015 travel per diem rates, which will take effect on October 1, 2014. By law, each year GSA sets these rates for the Continental United States. GSA has released the FY 2015 per diem rates for federal travelers. In addition to setting per diem rates, GSA also provides agencies with travel policies and tools to further reduce costs. These are a part of GSA’s ongoing commitment to responsible spending."}, {"url": "http://www.gsa.gov/portal/content/104877", "passage_text": "Per Diem Rates. You must follow these instructions to view FY2015 and prior years' rates. Select FY2015 or the appropriate year from the drop-down box above the Search By State map, then click directly on the state in the map where you wish to view a rate. You will not be able to see prior year rates if you enter anything at all in the Search By City, State or ZIP Code box on this page. The FY2016 per diem rates are now available. See FTR Per Diem Bulletin 16-01 for more details. Please see the blue box at the top of the page for instructions on how to view"}, {"url": "http://policy.fso.arizona.edu/fsm/1400/1413", "passage_text": "1 Current rates-Effective June 19, 2015: 2  Former rates for travel through June 18, 2015: 3  Instate meal reimbursement and meal reimbursement for cities and counties not listed in the State of Arizona Meals/Lodging Per Diem Allowances are limited to $36.00 per day regardless of location. 1 Instate meal reimbursement and meal reimbursement for cities and counties not listed in the State of Arizona Meals/Lodging Per Diem Allowances are limited to $36.00 per day regardless of location. 2  United States Department of State Foreign Meals/Lodging Per Diem Allowances are available on the State Department website."}, {"url": "http://www.defensetravel.dod.mil/site/perdiem.cfm", "passage_text": "Per Diem Rates. Calculation of travel per diem rates within the Federal government is a shared responsibility of three organizations: 1  The General Services Administration (GSA) prescribes rates for the Continental U.S. GSA updates the Continental U.S. rates once a year, or as necessary."}, {"url": "http://policy.fso.arizona.edu/fsm/1400/1413", "passage_text": "1 Per Diem Allowance: The following rates are available depending on the city and county to which the employee will travel. 2  To determine which rate applies, refer to the State of Arizona Meals/Lodging Per Diem Allowances. 3  Current rates-Effective June 19, 2015: 4  Former rates for travel through June 18, 2015: 1 Instate meal reimbursement and meal reimbursement for cities and counties not listed in the State of Arizona Meals/Lodging Per Diem Allowances are limited to $36.00 per day regardless of location. 2  United States Department of State Foreign Meals/Lodging Per Diem Allowances are available on the State Department website."}, {"url": "https://www.irs.gov/pub/irs-regs/per_diem_faq_%26_a_v1.pdf", "passage_text": "What is the federal per diem rate for my area?Publication 1542, Per Diem Rates provides the rates for all continental U.S. areas.Return to top 3. What does per diem cover? There is a per diem rate for combined lodging and meal costs, and a per diem rate for meal costs alone. An employer mayuse either per diem method for reimbursing employee travel expenses. A self-employed person can only use per diem forthe meal costs.Return to top 4."}, {"url": "http://www.gpo.gov/fdsys/granule/FR-2013-09-05/2013-21599/content-detail.html", "passage_text": "The standard lodging per diem rate will increase to $83. The meals and incidental expense tiers remain unchanged for FY 2014 and range from $46-$71. GSA identified two new non-standard areas (NSAs): Big Spring, TX (Howard County); and Pearsall, TX (Frio, La Salle, and Medina Counties). The General Services Administration's (GSA) Fiscal Year (FY) 2014 per diem review has resulted in lodging and meal allowance changes for certain locations within the Continental United States (CONUS) to provide for reimbursement of Federal employees' expenses covered by per diem."}, {"url": "http://www.gsa.gov/portal/category/100120", "passage_text": "Per Diem Rates Look-Up. Rates are set by fiscal year, effective October 1 each year. Find current rates in the continental United States (CONUS Rates) by searching below with city and state (or ZIP code), or by clicking on the map. "}, {"url": "http://www.military.com/benefits/military-pay/military-travel-and-per-diem-rates.html", "passage_text": "The proportional meal rate (PMR)is based on the locality meal rate and the GOVT meal rate (GMR). The per diem ta bles on this website have the PMRs already computed. The examples below using the Standard CONUS M&IE rate of $46.00 and the Standard GMR of $11.85 show how to compute a PMR amount. The $46.00 consists of $41.00 for meals and $5.00 for incidental expenses."}]