[{"url": "http://www.addbuild.com.au/our-services/extension-renovation-costs/", "passage_text": "When it comes to an addition, extension or renovation you most likely know what you want but the big question is what it all costs. Some will tell you that there is a “cost per m 2 ” or a “cost per room” or that you can build a new home for half the “cost per m 2 ” of an addition, extension or renovation."}, {"url": "http://www.france-renovation.com/costs-of-property-renovation/16", "passage_text": "1) try to estimate the cost per square metre of a renovated house in your chosen area, and of roughly the same size as your propsed project – ideally do this for several properties to get an average value per square metre. 2) calculate how many square metres your renovated property will have, of internal floor space."}, {"url": "http://www.france-renovation.com/costs-of-property-renovation/16", "passage_text": "This should give you a broad idea of how much you can spend per square metre. We look at actual costs per square metre in more detail below. For now, assume that you need 150 euros per metre for a general refresh, 500 euros for a major overhaul and 750 euros per metre for a complete build or build from a ruin. Remember it is always easy to spend more than this, harder to spend less."}, {"url": "http://www.extensionimpressions.com.au/extension_costs.html", "passage_text": "As you can see it is not as simple as a costs per square metre, every home extension is diverse and every need and want is diverse, obviously, the more bathrooms your extension has then the higher it will cost per square metre."}, {"url": "http://www.refreshrenovations.co.nz/project-estimates/home-extension-renovation-cost-estimate/", "passage_text": "A same level house extension in New Zealand will cost approximately $60,000 to $200,000+. Adding a room or extending your living area on the ground floor are affordable ways of creating more space. Here are some key points to consider that will help you keep your renovation costs in check."}, {"url": "http://www.homedesigndirectory.com.au/calculators/bathroom-cost-estimates.php", "passage_text": "Labour includes the cost of installing waterproofing, plumbing, tiling, electrical items, gyprocking, painting and the installation of fittings. The per-square-metre cost for labour that we use is $1100 for a new home and $1600 for a renovation (renovations require the old bathroom to be gutted). We obtained these values by getting prices from various bathroom installation specialists and then taking an average."}]