[{"url": "http://entirelypetspharmacy.com/clavdropml.html", "passage_text": "1 Clavamox is a prescription broad spectrum penicillin antibiotic that fights bacteria in the body, and comes in the form of either a tablet or drops. 2  Clavamox can be used to treat many different types of bacterial infections such as respiratory, ear, urinary tract, and skin infections. 1 Clavamox can be used to treat many different types of bacterial infections such as respiratory, ear, urinary tract, and skin infections. 2  Give Clavamox Tablets and Clavamox Drops with food."}, {"url": "https://answers.yahoo.com/question/index?qid=20071008182519AARYjsL", "passage_text": "Relevance. Rating Newest Oldest. Best Answer: Clavamox will not properly treat an ear infection. Yes, Clava is an antibiotic, but when you run Clava through a culture and senstitivity for the organisms that cause ear infections it does NOT do a good job of killing the organism at all. "}, {"url": "http://www.1800petmeds.com/Clavamox-prod3319.html", "passage_text": "Clavamox is a broad spectrum antibiotic, a combination of amoxicillin and clavulanic Acid, used for infections caused by bacteria. Clavamox requires a prescription from your veterinarian, and is sold by the tablet. It is also available as oral drops. Proven to generally be a safe anti-bacterial treatment. How it works: Clavamox combines the broad-spectrum antibiotic activity of amoxicillin with the unique beta-lactamase inhibiting effect of clavulanic acid which makes this product effective against beta-lactamase and non-beta-lactamase producing organisms."}, {"url": "http://www.1800petmeds.com/Clavamox-prod3319.html", "passage_text": "•. Clavamox is a prescription broad spectrum penicillin antibiotic that fights bacteria in the body, and comes in the form of either a tablet or drops. •. Clavamox can be used to treat many different types of bacterial infections such as respiratory, ear, urinary tract, and skin infections. Proven to generally be a safe anti-bacterial treatment. How it works: Clavamox combines the broad-spectrum antibiotic activity of amoxicillin with the unique beta-lactamase inhibiting effect of clavulanic acid which makes this product effective against beta-lactamase and non-beta-lactamase producing organisms."}, {"url": "http://www.vetinfo.com/antibiotics-common-dog-infections.html", "passage_text": "Ciprofloxacin comes in a few different forms in order to treat specific infections. It is most commonly used for the treatment of ear, eye, urinary tract, skin and respiratory infections. Ciprofloxacin can be given in pill format, liquid format or ointment format depending upon the condition requiring treatment."}, {"url": "http://www.petrescuerx.com/index.cfm/product/39_51/clavamox.cfm", "passage_text": "A broad spectrum antibiotic used to treat many infections in dogs and cats. The combination of amoxicillin and clavulanic acid increases its effectiveness against many types of bacteria and is often used in skin and soft tissue infections as well as upper respiratory, bladder and dental infections (dogs)."}, {"url": "https://answers.yahoo.com/question/index?qid=20080407062715AA4cTqQ", "passage_text": "Report Abuse. Clavamox will help if the problem is due to a bacterial infection. However, for eye problems, it is usually used in conjunction with a topical eye medication. I would really recommend taking your cat to the vet. Eye infections can get really bad if left untreated. If you can't afford to take your cat to the vet, treating it with clavamox is certainly better then doing nothing."}, {"url": "http://entirelypetspharmacy.com/clavdropml.html", "passage_text": "Directions. 1  Clavamox is a prescription broad spectrum penicillin antibiotic that fights bacteria in the body, and comes in the form of either a tablet or drops. 2  Clavamox can be used to treat many different types of bacterial infections such as respiratory, ear, urinary tract, and skin infections. 1 Clavamox can be used to treat many different types of bacterial infections such as respiratory, ear, urinary tract, and skin infections. 2  Give Clavamox Tablets and Clavamox Drops with food."}]