[{"url": "http://lostpedia.wikia.com/wiki/The_Island", "passage_text": "Danielle Rousseau 's map of the Island (English version). The Island is the geographic location of the Lost castaways, covering a period of at least 2000 years. From a literary perspective, the writers of Lost project the Island as both a location and an entity, with its own characteristics and influence."}, {"url": "http://www.thesafaricompany.co.za/Map_Islands.htm", "passage_text": "Bazaruto Island is one of five principal islands in the Bazaruto Archipelago, which lies just 30km off the coast of Vilanculos in Inhambane Province. It is the largest of all the tropical islands, approximately 37km long and up to 7km wide. The string of tropical island s off the coast of Mozambique is part of the Bazaruto Archipelago National Park and is one of the largest marine parks in the Indian Ocean. Three of the tropical island s were given formal protection in 1971 and designated a national park."}, {"url": "http://www.maine.info/islands.php", "passage_text": "Additional islands are included in the Map of Maine Islands above. Downeast Acadia Islands. Mount Desert Island: Mount Desert Island is the largest island off the coast of Maine and the sixth largest island in the contiguous United States. Home to Acadia National Park, Mount Desert Island includes four towns."}, {"url": "http://www.coastalliving.com/travel/gulf-coast/florida-vacation-islands", "passage_text": "We've rounded up a handful of lesser-known islands like Matlacha and Cayo Costa off of Florida's Gulf Coast that offer breathing room, intimate accomodations, and easy access to water for a relaxing, unique vacation. Following is all the information you need to visit one of these five undiscovered paradises. "}, {"url": "http://jurassicpark.wikia.com/wiki/Isla_Nublar_(Movie_canon)", "passage_text": "Isla Nublar is a remote island about 120 miles (190 km) off the west coast of Costa Rica, which is only 87 miles away from Isla Sorna. The island has a surface of 57 square kilometers (22 square miles). Its mountain ridges created varied ecological niches. The island was intended to be the site of Jurassic Park. "}, {"url": "http://www.mapsofworld.com/madagascar/", "passage_text": "Madagascar is an island off the coast of Southeastern Africa, in the Indian Ocean, near the islands of Reunion, Mauritius, Comoros, and Mayotte. The nearest countries on mainland Africa are Mozambique, Tanzania, Swaziland, and South Africa. Geography : Madagascar is an island in the Indian Ocean, off the southeastern coast of Africa. Between Madagascar and mainland Africa is the Mozambique Channel. Geographic features of Madagascar include the plateau of the central highlands, eastern escarpment, tropical forests and coastal mangroves."}, {"url": "http://www.mapsofworld.com/madagascar/", "passage_text": "An island country in the Indian Ocean, Madagascar is located off the southeastern coast of Africa. The nation comprises the island of Madagascar (the 4th largest island of the world), as well as numerous smaller peripheral islands. Geography : Madagascar is an island in the Indian Ocean, off the southeastern coast of Africa. Between Madagascar and mainland Africa is the Mozambique Channel. Geographic features of Madagascar include the plateau of the central highlands, eastern escarpment, tropical forests and coastal mangroves."}, {"url": "http://mvol.com/island-maps/", "passage_text": "Martha’s Vineyard: Latitude 41.39N Longitude 70.62W. Only six miles off the southeastern coast of Massachusetts, Martha’s Vineyard invites you to explore its towns, beaches, historical sites and extraordinary landscapes. Island Map was last modified: August 27th, 2014 by Andrey. "}, {"url": "http://www.touropia.com/best-islands-in-thailand/", "passage_text": "10 Best Islands in Thailand. Last updated on October 2, 2015 in Beaches and Islands, Thailand 20 Comments. The islands off the coast of Thailand in the Andaman Sea and the Gulf of Siam are some of the most popular places for tourists to Southeast Asia to visit. Some of these islands are famous throughout the world for their beautiful beaches and party atmosphere. Ko Lanta is made up of a group of islands off the coast of Thailand in the Krabi province. The largest island of the group is called Ko Lanta Yai also known as simply Ko Lanta. Several beaches on the west coast of Ko Lanta Yai are each strung with a line of resorts and bungalows."}]