[{"url": "http://www.eightforums.com/tutorials/6535-themes-switch-between-windows-8-a.html", "passage_text": "1 Windows Default Themes-The default themes included with Windows 8 that you can use to personalize your PC. 2  These themes are located in the folder below. 3  C:\\Windows\\Resources\\Themes. 4  Installed Themes-Themes that were created by your PC manufacturer (OEM) or other non-Microsoft providers."}, {"url": "http://answers.microsoft.com/en-us/windows/forum/windows_7-desktop/where-are-themes-theme-pack-stored-in-windows-7/f62ca678-fb96-4958-9b78-7f70684a8755", "passage_text": "You can store other themes here; C:\\Windows\\Web\\Wallpaper. Place each image or images of the same theme in a folder (ie. Snow images in a folder named Winter or Holiday images in a folder named Holidays). Downloaded several W7 theme packs but went to a temp folder I have rather then into the themes folder."}, {"url": "http://answers.microsoft.com/en-us/windows/forum/windows_7-desktop/where-are-themes-theme-pack-stored-in-windows-7/f62ca678-fb96-4958-9b78-7f70684a8755", "passage_text": "Example: 1  Create an empty folder on C:\\ named Themes. 2  Open cmd with administrative mode. 3  Go to an user themes location: 4  cd C:\\Users\\MyUser\\AppData\\Local\\Microsoft\\Windows. 5  To make things easier, open an explorer windows using the command: 6  start. 7  Move (if exists) the contents of the folder 'Themes' to C:\\Themes. 8  Delete (if exists) the now empty ...."}, {"url": "http://answers.microsoft.com/en-us/windows/forum/windows_7-desktop/location-of-image-files-for-themes/e22da442-005c-4839-9059-c3329683340e", "passage_text": "The contents of the theme files are located in the Windows folder in System Drive. The system default themes are located at: C:\\Windows\\Resources\\Themes. I would recommend you to follow the article below for creating themes."}, {"url": "http://www.pcmech.com/article/where-are-themes-stored-in-windows/", "passage_text": "Windows Themes are easy to work with but a pain to find the actual files for. The .theme file itself is actually nothing more than plain text settings, similar to an .ini file."}, {"url": "http://www.eightforums.com/tutorials/6535-themes-switch-between-windows-8-a.html", "passage_text": "1 These themes are located in the folder below. 2  C:\\Windows\\Resources\\Themes. 3  Installed Themes-Themes that were created by your PC manufacturer (OEM) or other non-Microsoft providers. 4  High Contrast Themes-Themes that help improve your PC's performance or make items on your screen easier to see."}, {"url": "http://windows7themes.net/en-us/where-are-desktop-themes-stored-in-windows-7/", "passage_text": "Windows 7 introduced a theme format called themepack. All themepack Windows 7 desktop themes are stored in C:\\Users\\yourusername\\AppData\\Local\\Microsoft\\Windows\\Themes. If you can’t see the folder, you might want to read our tutorial how to get access to AppData. The second folder C:\\Windows\\Resources\\Themes is the actual folder where the “real” desktop themes are stored in Windows 7. If you want to install Windows 7 themes (custom themes), then you need to copy the files in there."}, {"url": "http://www.eightforums.com/tutorials/6535-themes-switch-between-windows-8-a.html", "passage_text": "1 C:\\Users\\(user-name)\\AppData\\Local\\Microsoft\\Windows\\Themes. 2  Windows Default Themes-The default themes included with Windows 8 that you can use to personalize your PC. 3  These themes are located in the folder below."}]