[{"url": "http://www.moaf.org/exhibits/checks_balances/andrew-jackson/broadsheet", "passage_text": "Jackson vetoes the re-charter of the Second Bank of the US, 1832. Nicholas Biddle, Philadelphia gentleman and banker. Bank of the United States building on Third Street in Philadelphia. Postcard of the Second Bank of the United States building."}, {"url": "http://www.answers.com/Q/How_many_bills_did_Andrew_Jackson_veto", "passage_text": "Confidence votes 97. Jackson vetoed a total of 12 bills in his two terms in office (5 regular or return vetoes, and 7 pocket vetoes); all of his predecessors combined vetoed 10 bills."}, {"url": "http://www.moaf.org/exhibits/checks_balances/andrew-jackson/broadsheet", "passage_text": "Speech on the Bank of the United States veto and its aftermath. Report of a Committee of Directors of the Second Bank of the United States, 1833 (first edition). Political cartoon: A potential Third Bank of the United States provides Jackson and Van Buren an awful affright."}, {"url": "http://www.ask.com/history/did-andrew-jackson-veto-national-bank-526e7cdac003714a", "passage_text": "By the time Andrew Jackson was sworn into office as President of the United States, the Second National Bank handled an estimated 20 percent of the nation's loans and one-third of all deposits."}, {"url": "http://www.answers.com/Q/How_many_bills_did_Andrew_Jackson_veto", "passage_text": "Andrew Jackson explained his veto of the recharter bill by stating  that he believed the Bank of the United States was elitist and  unconstitutional. Jackson was the country … 's 7th President."}, {"url": "https://en.wikipedia.org/wiki/List_of_United_States_presidential_vetoes", "passage_text": "The phrase presidential veto does not appear in the United States Constitution, but Article I requires every bill, order, resolution or other act of legislation by the Congress of the United States to be presented to the President of the United States for his approval."}, {"url": "http://www.moaf.org/exhibits/checks_balances/andrew-jackson/broadsheet", "passage_text": "Jackson Vetoes Re-Charter of the Second Bank of the US. Andrew Jackson vetoed the bill re-chartering the Second Bank in July 1832 by arguing that in the form presented to him it was incompatible with “justice,” “sound policy” and the Constitution."}, {"url": "http://www.ask.com/history/did-andrew-jackson-veto-national-bank-526e7cdac003714a", "passage_text": "According to the History Channel, President Andrew Jackson vetoed a new charter for the Second Bank of the United States because the bank was heavily biased toward business interests and had no congressional oversight."}, {"url": "http://www.ask.com/history/did-andrew-jackson-veto-national-bank-526e7cdac003714a", "passage_text": "When Congress attempted to renew the Second Bank's charter, President Jackson vetoed the bill after arguing that the bank was unconstitutional. In retaliation, Congress censored President Jackson for abusing his presidential power.Learn more about US History."}]