[{"url": "https://labtestsonline.org/understanding/analytes/bilirubin/tab/test", "passage_text": "Usually, a chemical test is used to first measure the total bilirubin level (unconjugated plus conjugated bilirubin). If the total bilirubin level is increased, the laboratory can use a second chemical test to detect water-soluble forms of bilirubin, called direct bilirubin. The direct bilirubin test provides an estimate of the amount of conjugated bilirubin present. Tests for bilirubin may also be ordered when someone is suspected of having (or known to have) hemolytic anemia as a cause of anemia. In this case, it is often ordered along with other tests used to evaluate hemolysis, such as complete blood count, reticulocyte count, haptoglobin, and LDH."}, {"url": "http://www.webmd.com/digestive-disorders/bilirubin-15434", "passage_text": "When bilirubin levels are high, the skin and whites of the eyes may appear yellow (jaundice). Jaundice may be caused by liver disease (hepatitis), blood disorders (hemolytic anemia), or blockage of the tubes (bile ducts) that allow bile to pass from the liver to the small intestine. The bilirubin test is used to: 1  Check liver function and watch for signs of liver disease, such as hepatitis or cirrhosis, or the effects of medicines that can damage the liver. 2  Find out if something is blocking the bile ducts. 3  This may occur if gallstones, tumors of the pancreas, or other conditions are present."}, {"url": "http://medical-dictionary.thefreedictionary.com/bilirubin", "passage_text": "Failure of the liver cells to excrete bile, or obstruction of the bile ducts, can cause an increased amount of bilirubin in the body fluids and lead to obstructive jaundice. Another type of jaundice, hemolytic jaundice, results from excessive destruction of erythrocytes. "}, {"url": "http://www.mayoclinic.org/tests-procedures/bilirubin/basics/definition/PRC-20019986", "passage_text": "Bilirubin testing checks for levels of bilirubin in your blood. Bilirubin (bil-ih-ROO-bin) is an orange-yellow substance made during the normal breakdown of red blood cells. Bilirubin passes through the liver and is eventually excreted out of the body. Higher than normal levels of bilirubin may indicate different types of liver problems. Occasionally, higher bilirubin levels may indicate an increased rate of destruction of red blood cells (hemolysis). 1  Why it's done"}, {"url": "http://www.webmd.com/digestive-disorders/bilirubin-15434", "passage_text": "A bilirubin test measures the amount of bilirubin in a blood sample. Bilirubin is a brownish yellow substance found in bile. It is produced when the liver breaks down old red blood cells. Bilirubin is then removed from the body through the stool (feces) and gives stool its normal color. The bilirubin test is used to: 1  Check liver function and watch for signs of liver disease, such as hepatitis or cirrhosis, or the effects of medicines that can damage the liver. 2  Find out if something is blocking the bile ducts. 3  This may occur if gallstones, tumors of the pancreas, or other conditions are present."}, {"url": "http://www.urmc.rochester.edu/encyclopedia/content.aspx?ContentTypeID=167&ContentID=total_bilirubin_blood", "passage_text": "A small amount of bilirubin in your blood is normal, but a high level may be a sign of liver disease. The liver produces bile to help you digest food, and bile contains bilirubin. Most bilirubin comes from the body's normal process of breaking down old red blood cells. A healthy liver can normally get rid of bilirubin. But when you have liver problems, it can build up in your body to unhealthy levels. "}, {"url": "https://labtestsonline.org/understanding/analytes/bilirubin/tab/test", "passage_text": "A bilirubin test is used to detect an increased level in the blood. It may be used to help determine the cause of jaundice and/or help diagnose conditions such as liver disease, hemolytic anemia, and blockage of the bile ducts. Tests for bilirubin may also be ordered when someone is suspected of having (or known to have) hemolytic anemia as a cause of anemia. In this case, it is often ordered along with other tests used to evaluate hemolysis, such as complete blood count, reticulocyte count, haptoglobin, and LDH."}, {"url": "http://medical-dictionary.thefreedictionary.com/Total+bilirubin", "passage_text": "Failure of the liver cells to excrete bile, or obstruction of the bile ducts, can cause an increased amount of bilirubin in the body fluids and lead to obstructive jaundice. Another type of jaundice, hemolytic jaundice, results from excessive destruction of erythrocytes. conjugated bilirubin, direct bilirubin bilirubin that has been taken up by the liver cells and conjugated to form the water-soluble bilirubin diglucuronide. indirect bilirubin, unconjugated bilirubin the lipid-soluble form of bilirubin that circulates in loose association with the plasma proteins."}, {"url": "http://www.healthline.com/health/bilirubin-blood", "passage_text": "Bilirubin is a yellow pigment that is in everyone’s blood and stool. If you notice a yellowing of your skin or the whites of your eyes, this is called jaundice, and it may be caused by high levels of bilirubin. Bilirubin is made in the body when old red blood cells are broken down. The breakdown of old cells is a normal, healthy process. After circulating in your blood, bilirubin then travels to your liver. In the liver, bilirubin is excreted into the bile duct and stored in your gall bladder."}]