[{"url": "http://learn.org/articles/What_is_the_Pay_Scale_for_a_Dialysis_Technician.html", "passage_text": "Dialysis technicians are trained in the operation and use of the medical equipment that filters excess fluid and waste from a patient's bloodstream and returns clean blood to the body. Patients with chronic or acute kidney failure often undergo dialysis treatments. "}, {"url": "http://www.wikiprofessional.org/Dialysis_Technician", "passage_text": "Dialysis technicians are trained to perform dialysis on patients who are suffering from kidney disorders and need treatment to remove excess waste from their blood. Their job entails not only operating the dialysis machine, but prepping patients prior to the procedure and then giving patients care after the procedure. On a daily basis, a dialysis technician might perform the following duties: 1  Discuss the dialysis procedure with patients. 2  Operate the dialysis machine. 3  Offer support to patients before, during, and"}, {"url": "http://dialysistechnicianstraining.com/how-to-become-a-dialysis-technician/", "passage_text": "How to Become a Dialysis Technician. A career in the field of dialysis can be quite rewarding, as Dialysis Technicians help those whose kidneys no longer work properly. With effective dialysis treatment, their patients can live a longer life, staying active and healthy. Getting Started as a Dialysis Technician. When applying for dialysis technician training you will need a high school diploma or a GED. It’s best if during earlier education, the student has studied science and health."}, {"url": "http://www.innerbody.com/careers-in-health/how-to-become-a-dialysis-technician.html", "passage_text": "A dialysis technician with many years of experience, as well as additional education and training, can advance to position as head technician in a large hospital or clinic. Internships and job-training programs provide these opportunities. Licensing and/or Certification. Every state has specific regulations regarding certification for dialysis technicians, so technicians should check the necessary requirements of the state where they want to work."}, {"url": "http://www.wikihow.com/Become-a-Dialysis-Tech", "passage_text": "Plan on educational training in preparation for a position as a dialysis tech that will last from 1 to 2 years. Advancement opportunities are available if you decide that you want to continue your education and study for a dialysis nursing position. A dialysis tech performs renal dialysis duties to treat patients suffering from kidney failure or chronic kidney disease. Also known as hemodialysis, the work of a dialysis tech includes operating and monitoring dialysis medical equipment that is used to remove excess waste and fluids from patients' kidneys"}, {"url": "http://www.innerbody.com/careers-in-health/how-to-become-a-dialysis-technician.html", "passage_text": "Opportunities for Advancement. A dialysis technician with many years of experience, as well as additional education and training, can advance to position as head technician in a large hospital or clinic. Technicians who work in small clinics will have less opportunity for advancement. Internships and job-training programs provide these opportunities. Licensing and/or Certification. Every state has specific regulations regarding certification for dialysis technicians, so technicians should check the necessary requirements of the state where they want to work."}, {"url": "http://www.innerbody.com/careers-in-health/how-to-become-a-dialysis-technician.html", "passage_text": "Dialysis technicians should also know emergency procedures such as cardiopulmonary resuscitation (CPR). Training. Dialysis technicians are required to work in a clinical setting under the supervision of a licensed doctor or nurse to gain experience with the dialysis machine and procedures. Internships and job-training programs provide these opportunities. Licensing and/or Certification. Every state has specific regulations regarding certification for dialysis technicians, so technicians should check the necessary requirements of the state where they want to work."}, {"url": "http://www.wikiprofessional.org/Dialysis_Technician", "passage_text": "All dialysis technician programs require that prospective students have either a high school diploma or equivalency. Upon entering a program, students will learn about the kidneys, kidney disease, and they will undergo training in how to use the dialysis machine. On a daily basis, a dialysis technician might perform the following duties: 1  Discuss the dialysis procedure with patients. 2  Operate the dialysis machine. 3  Offer support to patients before, during, and after the procedure."}, {"url": "http://careers.davita.com/careers/clinical-team/patient-care-tech", "passage_text": "Patient Care Tech Careers. Work with the clinical care team to provide safe, comfortable and hygienic dialysis treatments for patients. As a dialysis Patient Care Technician (PCT) you'll play an important role at DaVita-and in the lives of patients and their families. Our dialysis Patient Care Technicians work under the supervision of nephrology nurses to provide safe, comfortable and hygienic dialysis treatments for patients. They are often the teammates who have the most “one on one” time with patients in the facility."}]