[{"url": "https://en.wikipedia.org/wiki/Germinal_epithelium_(male)", "passage_text": "The germinal epithelium is the innermost layer of the testicle. Germinal epithelium is also known as the wall of the seminiferous tubule within the testes. The cells in the epithelium are connected via tight junctions"}, {"url": "http://ntp.niehs.nih.gov/nnl/male_reproductive/testis/geatrophy/testis_germinal_epithelium-atrophy_508.pdf", "passage_text": "Seminiferous tubules lack germ cells and are lined only by Sertoli cells. Comment: Germinal epithelium atrophy (Figure 1, Figure 2, Figure 3, and Figure 4) consists of seminiferous tubules that are completely devoid of germ cells and lined only by Sertoli cells. The seminiferous tubules may have dilated lumens (Figure 1 and Figure 2) or contracted lumens (Figure 4)."}, {"url": "https://en.wikipedia.org/wiki/Germinal_epithelium_(female)", "passage_text": "The ovarian surface epithelium, also called the germinal epithelium of Waldeyer, is a layer of simple squamous-to-cuboidal epithelial cells covering the ovary. The germinal epithelium gives the ovary a dull gray color as compared with the shining smoothness of the peritoneum; and the transition between the mesothelium of the peritoneum and the columnar cells which cover the ovary is usually marked by a line around the anterior border of"}, {"url": "http://medical-dictionary.thefreedictionary.com/germinal+epithelium", "passage_text": "germinal epithelium, 1 the epithelial layer covering the genital ridge from which the gonads are derived in early embryonic development. 2 the epithelial covering of the ovary, formerly thought to be the site of the formation of the oogonia. See also oogenesis. Epithelium is classified into types on the basis of the number of layers deep and the shape of the superficial cells. ciliated epithelium epithelium bearing vibratile, hairlike processes (cilia) on its free surface. columnar epithelium epithelium whose cells are of much greater height than width."}, {"url": "http://www.embryology.ch/anglais/cgametogen/spermato02.html", "passage_text": "Structure of the germinal epithelium. Quiz. The epithelium consists of Sertoli's sustentacular cells and the spermatogenic cells. The Sertoli's cells form a single-layered lamina and extend from the basal lamina to the tubule lumen. With their labyrinthine cellular processes they surround the individual types of germ cells more or less completely"}, {"url": "http://medcell.med.yale.edu/histology/male_reproductive_system_lab.php", "passage_text": "The first two of these are found in the germinal epithelium, the layer of the seminiferous tubule in which gamete production and development occurs: 1  Sertoli cells extend from the basement membrane of the germinal epithelium to the lumen of the tubule. 2  These cells envelope the developing sperm cells. 1 Describe the histological organization of the testis and the process of spermatogenesis in the germinal epithelium of the seminiferous tubule. 2  Contrast spermatogenesis from spermiogenesis. 3  Draw a sperm cell and label its major part"}, {"url": "http://ntp.niehs.nih.gov/nnl/male_reproductive/testis/geatrophy/testis_germinal_epithelium-atrophy_508.pdf", "passage_text": "Testis, Germinal epithelium – Atrophy Figure Legend: Figure 1 Testis, Germinal epithelium-Atrophy in a male F344/N rat from a subchronic study. Seminiferous tubules are lined only by Sertoli cells. Figure 2 Testis, Germinal epithelium-Atrophy in a male F344/N rat from a subchronic study. Higher magnification of Sertoli cell-lined seminiferous tubules in Figure 1. Figure 3 Testis, Germinal epithelium-Atrophy in a male F344/N rat from a subchronic study. The majority of the seminiferous tubules are lined only by Sertoli cells. Comment: Germinal epithelium atrophy (Figure 1, Figure 2, Figure 3, and Figure 4) consists of seminiferous tubules that are completely devoid of germ cells and lined only by Sertoli cells. The seminiferous tubules may have dilated lumens (Figure 1 and Figure 2) or contracted lumens (Figure 4)."}, {"url": "http://www.ncbi.nlm.nih.gov/pubmed/10681472", "passage_text": "The follicle is a derivative of the germinal epithelium and is composed of the oocyte and surrounding follicle cells. It is separated from the encompassing theca by a basement membrane. The cells that form the theca interna are derived from prethecal cells within the extravascular space of the ovarian stroma. The germinal epithelium borders a body cavity, the ovarian lumen, and is supported by a basement membrane that also separates the epithelial compartment of the ovarian lamellae from the stromal compartment."}, {"url": "http://medical-dictionary.thefreedictionary.com/germinal+epithelium", "passage_text": "cuboidal epithelium epithelium whose cells are of approximately the same height and width, and appear square in transverse section. germinal epithelium thickened peritoneal epithelium covering the gonad from earliest development; formerly thought to give rise to germ cells. Epithelium is classified into types on the basis of the number of layers deep and the shape of the superficial cells. ciliated epithelium epithelium bearing vibratile, hairlike processes (cilia) on its free surface. columnar epithelium epithelium whose cells are of much greater height than width."}]