[{"url": "http://www.livescience.com/1312-huge-ocean-discovered-earth.html", "passage_text": "Scientists probing the Earth's interior have found a large reservoir of water equal to the volume of the Arctic Ocean beneath eastern Asia. The left figure is a slice through the Earth, taken from the figure on the right, showing the attenuation anomalies within the mantle at a depth of roughly 620 miles."}, {"url": "http://www.ehow.com/info_7878220_list-found-under-sea-bed.html", "passage_text": "Gabbro. Gabbro is usually dark in color -- black or gray -- and is a coarse-grained igneous rock that makes up most of the seabed. According to Live Science, gabbro is a dense type of rock formed from the slow cooling of magma chambers beneath mid-ocean ridges.."}, {"url": "http://www.learner.org/interactives/rockcycle/glossary.html", "passage_text": "A type of igneous rock. Basalt is the most common rock type in the earth's crust and makes up most of the ocean floor."}, {"url": "http://academic.emporia.edu/aberjame/student/barr1/report.htm", "passage_text": "In Florida, sedimentary rocks are the most common type of rock. These rocks are made up of cemented mineral particles. One example is shell fragments (the mineral aragonite) that are cemented together by calcite to form the sedimentary rock coquina."}, {"url": "https://answers.yahoo.com/question/index?qid=20081006053041AACgKO4", "passage_text": "· just now. Report Abuse. Sedimentary rocks are the most common type of rock formed under water but it is a very slow process in comparison with the formation of igneous deposits. This can be due to a lack of energy and very fine sediments in deep ocean environments, typically something like a mudstone will be formed."}, {"url": "http://www.livescience.com/1312-huge-ocean-discovered-earth.html", "passage_text": "Scientists scanning the deep interior of Earth have found evidence of a vast water reservoir beneath eastern Asia that is at least the volume of the Arctic Ocean. The discovery marks the first time such a large body of water has found in the planet's deep mantle. [ The World's Biggest Oceans and Seas ]."}]