[{"url": "http://circuittechservices.com/services/high-voltage-hipot-test", "passage_text": "Hipot Test. HiPot test, also known as dielectric withstanding voltage test, ensures that the dielectric material of the PCB is able to withstand a higher than working voltage for a certain period of time. Field failures due to dielectric breakdown or circuit failures can be catastrophic. Circuit Technology Services is able to perform Hipot and Hi-Voltage tests that help ensure the long term integrity of the PCB. CTS can perform theses tests according to your specific requirements whether IPC, Military or customer driven."}, {"url": "https://electricalnotes.wordpress.com/2011/12/01/hipot-testing/", "passage_text": "1 when using a dc hipot tester, the capacitors in the circuit could be highly charged and, therefore, a safe-discharge device or setup is needed. 2  However, it is a good practice to always ensure that a product is discharged, regardless of the test voltage or its nature, before it is handled. Test method for HIPOT Test: 1  Hipot testers usually connect one side of the supply to safety ground (Earth ground). 2  The other side of the supply is connected to the conductor being tested. 3  With the supply connected like this there are two places a given conductor can be connected: high voltage or ground."}, {"url": "https://electricalnotes.wordpress.com/2011/12/01/hipot-testing/", "passage_text": "1 The hipot test is a nondestructive test that determines the adequacy of electrical insulation for the normally occurring over voltage transient. 2  This is a high-voltage test that is applied to all devices for a specific time in order to ensure that the insulation is not marginal. Test method for HIPOT Test: 1  Hipot testers usually connect one side of the supply to safety ground (Earth ground). 2  The other side of the supply is connected to the conductor being tested. 3  With the supply connected like this there are two places a given conductor can be connected: high voltage or ground."}, {"url": "http://www.cirris.com/learning-center/general-testing/high-voltage/31-testing-cables-with-high-voltage", "passage_text": "Many people are less familiar with a hipot test. Hipot is short for high potential (high voltage). A hipot test checks for good isolation.. A hipot test checks that no current flows between points where there should be no current. In some ways a hipot test is the opposite of a continuity test. Continuity Test: Makes sure current flows easily from one point to another point.. Hipot Test: Makes sure current does not flow between points where there should be no flow (using high voltage to ensure current does not flow).."}, {"url": "https://en.wikipedia.org/wiki/Hipot", "passage_text": "Hipot is an abbreviation for high potential. Traditionally, hipot is a term given to a class of electrical safety testing instruments used to verify electrical insulation in finished appliances, cables or other wired assemblies, printed circuit boards, electric motors, and transformers. A hipot tester can be very similar to a cable tester and often the two are combined into a single device. In a typical wired assembly a hipot test should connect all circuits in common to ground. Then, one by one the tester will disconnect a given circuit from ground and connect that circuit to high voltage. The current that flows is monitored to verify that it is low enough"}, {"url": "http://www.xmultiple.com/xwebsite-forum21.htm", "passage_text": "Hipot is an abbreviation for high potential. Traditionally, Hipot is a term given to a class of electrical safety testing instruments used to verify electrical insulation in finished appliances, cables or other wired assemblies, printed circuit boards, electric motors, and transformers. In a typical Hipot test, high voltage is applied between a product's current-carrying conductors and its metallic chassis. The resulting current that flows through the insulation, known as leakage current, is monitored by the hipot tester."}, {"url": "http://circuittechservices.com/services/high-voltage-hipot-test", "passage_text": "High Voltage & Hipot Test. Reliability is becoming more critical with modern PCB designs. Field failures due to dielectric breakdown or circuit failures can be catastrophic. Circuit Technology Services is able to perform Hipot and Hi-Voltage tests that help ensure the long term integrity of the PCB. CTS can perform theses tests according to your specific requirements whether IPC, Military or customer driven."}, {"url": "https://en.wikipedia.org/wiki/Hipot", "passage_text": "In a typical hipot test, high voltage is applied between a product's current-carrying conductors and its metallic shielding. The resulting current that flows through the insulation, known as leakage current, is monitored by the hipot tester. A hipot tester can be very similar to a cable tester and often the two are combined into a single device. In a typical wired assembly a hipot test should connect all circuits in common to ground. Then, one by one the tester will disconnect a given circuit from ground and connect that circuit to high voltage. The current that flows is monitored to verify that it is low enough"}]