[{"url": "https://arksped.k12.ar.us/rules_regs_08/RevisionstoRulesandRegulationJuly2010/TRAUMATIC%20BRAIN%20INJURY.pdf", "passage_text": "TRAUMATIC BRAIN INJURY I. DEFINITION Traumatic brain injury means an acquired injury to the brain caused by an external physical force, resulting in total or partial functional disability or psychosocial impairment, or both, that adversely affects a child's educational performance. "}, {"url": "http://www.msktc.org/tbi/factsheets/Returning-To-School-After-Traumatic-Brain-Injury", "passage_text": "Based on Research by TBI Model Systems. Parental involvement is critical when a young person is returning to school after a traumatic brain injury (TBI). Parents have the most knowledge about their child and are deeply invested in their daughter's or son's well-being and future. 1 The effects of TBI vary greatly from student to student; no two will be alike. 2  Sometimes the effects of a brain injury are not obvious at first but become more noticeable later when thinking and social activities increase at school."}, {"url": "http://www.parentcenterhub.org/repository/tbi/", "passage_text": "A traumatic brain injury can also change how a student learns and acts in school. The term TBI is used for head injuries that can cause changes in one or more areas, such as: 1  thinking and reasoning, 2  understanding words, 3  remembering things, 4  paying attention, 5  solving problems, 6  thinking abstractly, 7  talking, 8  behaving, A child with TBI may not have all of the above difficulties. Brain injuries can range from mild to severe, and so can the changes that result from the injury. This means that it’s hard to predict how an individual will recover from the injury. Early and ongoing help can make a big difference in how the child recovers."}, {"url": "http://maketheconnection.net/conditions/traumatic-brain-injury", "passage_text": "Your doctor may recommend counseling to help you learn ways to manage the effects of TBI. Because TBI is a brain injury, it can also affect the way that the brain functions and medications may be needed to help you cope with the effects. Traumatic brain injury can result in changes in someone’s physical functioning, thinking abilities, and behaviors. These effects sometimes cause other difficulties such as sleeping problems, depression, and anxiety. Physical effects may include: “I was having trouble seeing"}, {"url": "http://www.asha.org/public/speech/disorders/TBI/", "passage_text": "Traumatic brain injury (TBI) is a form of brain injury caused by sudden damage to the brain. Depending on the source of the trauma, TBIs can be either open or closed head injuries. 1  Open Head Injuries: Also called penetrating Injuries, these injuries occur when an object (e.g., a bullet) enters the brain and causes damage to specific brain parts. 2  Symptoms vary depending on the part of the brain that is damaged."}, {"url": "http://www.asha.org/public/speech/disorders/TBI/", "passage_text": "A form of TBI called mild traumatic brain injury (mTBI) is typically diagnosed only on the basis of the individual's (or caregiver's) report and clinical signs and symptoms. Brain imaging findings are typically normal in mTBI. Depending on the source of the trauma, TBIs can be either open or closed head injuries. 1  Open Head Injuries: Also called penetrating Injuries, these injuries occur when an object (e.g., a bullet) enters the brain and causes damage to specific brain parts. 2  Symptoms vary depending on the part of the brain that is damaged."}, {"url": "http://www.asha.org/public/speech/disorders/TBI/", "passage_text": "1 Open Head Injuries: Also called penetrating Injuries, these injuries occur when an object (e.g., a bullet) enters the brain and causes damage to specific brain parts. 2  Symptoms vary depending on the part of the brain that is damaged. Depending on the source of the trauma, TBIs can be either open or closed head injuries. 1 "}, {"url": "http://www.brainline.org/content/2009/06/memory-and-brain-injury.html", "passage_text": "A brain injury often damages parts of the brain that are needed for taking in, storing, and retrieving information. A brain injury also can make pre-injury memory problems worse. But some of these new memory problems will improve with time. “Memory” is your brain taking in, keeping, recalling, and using information. A brain injury can affect any of these areas of memory. A brain injury can also make it hard to learn and remember things."}]