[{"url": "http://www.webmd.com/drugs/2/drug-163935/prolensa-ophthalmic/details", "passage_text": "Place one finger at the corner of your eye (near the nose) and apply gentle pressure. This will prevent the medication from draining out. Try not to blink and do not rub your eye. Do not rinse the dropper. If you are wearing contact lenses, remove them before using eye drops. Tilt your head back, look upward, and pull down the lower eyelid to make a pouch. Hold the dropper directly over your eye and place 1 drop into the pouch. Look downward and gently close your eyes for 1 to 2 minutes"}, {"url": "http://www.rxlist.com/prolensa-side-effects-drug-center.htm", "passage_text": "Prolensa is generally dosed as one drop into the affected eye one day before surgery. Prolensa should also be used on the day of eye surgery, as well as for 14 days following. Discuss the dosing and usage with your doctor. Prolensa may be used alongside other topical eye medications. Each additional medication should be given at least five minutes apart. Prolensa may interact with other drugs. The use of Prolensa in late pregnancy should be avoided. Prolensa should be given to a breastfeeding mother under strict caution. Our Prolensa (bromfenac) Side Effects Drug Center provides a comprehensive view of available drug information on the potential side effects when taking this medication."}, {"url": "http://www.rxlist.com/prolensa-drug.htm", "passage_text": "Bromfenac sodium is a yellow to orange crystalline powder. The molecular weight of bromfenac sodium is 383.17. PROLENSA ophthalmic solution is supplied as a sterile aqueous 0.07% solution, with a pH of 7.8. The osmolality of PROLENSA ophthalmic solution is approximately 300 mOsmol/kg. The USAN name for bromfenac sodium sesquihydrate is bromfenac sodium. Bromfenac sodium is designated chemically as sodium [2-amino-3-(4-bromobenzoyl) phenyl] acetate sesquihydrate, with an empirical formula of C 15 H 11 BrNNaO 3 • 1½H 2 O. The chemical structure for bromfenac sodium sesquihydrate is:"}, {"url": "http://eyedocnews.com/006182-ista-pharmaceuticals-announces-phase-3-results-for-prolensatm-eye-drops-for-treatment-of-pain-and-inflammation-after-cataract-surgery/", "passage_text": "There were no serious drug-related ocular or systemic adverse events, and PROLENSA’s safety profile was found to be consistent with ISTA’s currently marketed topical non-steroidal anti-inflammatory (NSAID) compound, BROMDAY(TM) (bromfenac ophthalmic solution) 0.09%. Click here for the full release. Comments. Jump down to form below to submit your own comments. Trackback URL. http://eyedocnews.com/006182-ista-pharmaceuticals-announces-phase-3-results-for-prolensatm-eye-drops-for-treatment-of-pain-and-inflammation-after-cataract-surgery/trackback/."}, {"url": "http://www.rxlist.com/prolensa-drug.htm", "passage_text": "PROLENSA (bromfenac ophthalmic solution) 0.07% is a sterile, topical, nonsteroidal anti-inflammatory drug (NSAID) for ophthalmic use. Each mL of PROLENSA contains 0.805 mg bromfenac sodium sesquihydrate (equivalent to 0.7 mg bromfenac free acid). The USAN name for bromfenac sodium sesquihydrate is bromfenac sodium. Bromfenac sodium is designated chemically as sodium [2-amino-3-(4-bromobenzoyl) phenyl] acetate sesquihydrate, with an empirical formula of C 15 H 11 BrNNaO 3 • 1½H 2 O. The chemical structure for bromfenac sodium sesquihydrate is:"}, {"url": "http://www.prnewswire.com/news-releases/bausch--lomb-receives-fda-approval-for-prolensa-bromfenac-ophthalmic-solution-007-201907971.html", "passage_text": "Bausch + Lomb Receives FDA Approval for PROLENSA™ (bromfenac ophthalmic solution) 0.07%. RELATED LINKS. http://www.bausch.com. Bausch + Lomb is a leading global eye health company that is solely focused on protecting, enhancing, and restoring people's eyesight. PROLENSA will be available in 1.6ml and 3ml bottle sizes. (Logo: http://photos.prnewswire.com/prnh/20121221/MM34011LOGO). PROLENSA provides powerful and rapid resolution of inflammation and pain by leveraging the unique potency of the bromfenac molecule in a formulation designed to facilitate ocular penetration."}, {"url": "http://www.webmd.com/drugs/2/drug-163935/prolensa-ophthalmic/details", "passage_text": "How to use Prolensa ophthalmic. Your doctor may direct you to start using this medication the day before or the day after your surgery. Place 1 drop into the affected eye as directed by your doctor, usually once or twice a day for 2 weeks. Carefully follow your doctor's specific directions. If you are wearing contact lenses, remove them before using eye drops. Tilt your head back, look upward, and pull down the lower eyelid to make a pouch. Hold the dropper directly over your eye and place 1 drop into the pouch. Look downward and gently close your eyes for 1 to 2 minute"}, {"url": "http://www.rxlist.com/prolensa-side-effects-drug-center.htm", "passage_text": "Common side effects of Prolensa include light sensitivity, watery eyes, the feeling that there is a foreign object in the eye, eye pain or irritation, eye itching, and blurred vision. The use of Prolensa in late pregnancy should be avoided. Prolensa should be given to a breastfeeding mother under strict caution. Our Prolensa (bromfenac) Side Effects Drug Center provides a comprehensive view of available drug information on the potential side effects when taking this medication."}, {"url": "http://www.bausch.com/our-products/rx-pharmaceutical/prolensa-bromfenac-ophthalmic-solution-007", "passage_text": "Pay no more than $60.* Most eligible cash-paying patients pay $60 out-of-pocket for each prescription fill of PROLENSA and receive up to $195 off your remaining expenses for that prescription fill. If you are a Medicare Part D patient, find out if Bausch + Lomb can help reduce your costs. "}]