[{"url": "http://sansimeonchamber.org/", "passage_text": "History. By 1852, a whaling station was established at the natural harbor found at San Simeon Point. The whaling industry developed around the migration of the Grey whale as they traveled south to their breeding ground in Scammons Bay in Baja California or on their return trip to the Arctic and Alaskan waters. "}, {"url": "https://en.wikipedia.org/wiki/San_Simeon,_California", "passage_text": "San Simeon (ZIP Code: 93452; area code 805) is a town and census-designated place on the Pacific coast of San Luis Obispo County, California. At Ragged Point, about 15 miles past San Simeon, the party turned inland across the Santa Lucia Range. San Simeon was founded as an asistencia (sub-mission) to Mission San Miguel Arcangel, arcángel founded in 1797 and located to the east across The Santa Lucia. range"}, {"url": "https://www.expedia.com/San-Simeon-Hotels.d6055486.Travel-Guide-Hotels", "passage_text": "Your Guide to San Simeon Hotels. Expedia.com offers a selection of 29 hotels in San Simeon. You are sure to find cheap deals and discount rates among them with our Best Price Guarantee. No matter what type of hotel strikes your fancy, we will let you search for your preferred one to accommodate your travel need"}, {"url": "http://sansimeonchamber.org/attractions/", "passage_text": "San Simeon may be small—boasting a population of about 443 people—but there’s no shortage of exciting attractions and world-famous appeals to explore. Historic castles, elephant seal migrations and pristine beach hotspots—San Simeon’s attractions make it the biggest “little” town in California. Hearst Castle. San Simeon is the perfect place to start your tour of the California Central Coast’s Highway 1 Discovery Route that will take you to 10 renowned destinations featuring breathtaking vistas, award-winning wineries and more."}, {"url": "https://en.wikipedia.org/wiki/San_Simeon,_California", "passage_text": "San Simeon was named for Rancho San Simeon, although the town-site is actually north of that rancho, on the former Rancho Piedra Blanca, a Mexican land grant given in 1840 to Jose josé De Jesus. jesús pico At Ragged Point, about 15 miles past San Simeon, the party turned inland across the Santa Lucia Range. San Simeon was founded as an asistencia (sub-mission) to Mission San Miguel Arcangel, arcángel founded in 1797 and located to the east across The Santa Lucia. range"}, {"url": "https://en.wikipedia.org/wiki/Hearst_Castle", "passage_text": "1 Fabulous San Simeon; a history of the Hearst Castle, a Calif. state monument located on the scenic coast of Calif., together with a guide to the treasures on display. 2  San Francisco: California Historical Society. 3  Collord, M., & Miller, A. (1972). Hearst formally named the estate La Cuesta Encantada (The Enchanted Hill), but usually called it the ranch. Hearst Castle and grounds are also sometimes referred to as  San Simeon  without distinguishing between the Hearst property and the adjacent unincorporated area of the same name."}, {"url": "https://en.wikipedia.org/wiki/Hearst_Castle", "passage_text": "1 Lewis, O. (1958). 2  Fabulous San Simeon; a history of the Hearst Castle, a Calif. state monument located on the scenic coast of Calif., together with a guide to the treasures on display. 3  San Francisco: California Historical Society. Hearst formally named the estate La Cuesta Encantada (The Enchanted Hill), but usually called it the ranch. Hearst Castle and grounds are also sometimes referred to as  San Simeon  without distinguishing between the Hearst property and the adjacent unincorporated area of the same name."}, {"url": "https://en.wikipedia.org/wiki/Hearst_Castle", "passage_text": "Hearst Castle is located near the unincorporated community of San Simeon, California, approximately 250 miles (400 km) from both Los Angeles and San Francisco, and 43 miles (69 km) from San Luis Obispo at the northern end of San Luis Obispo County. Hearst formally named the estate La Cuesta Encantada (The Enchanted Hill), but usually called it the ranch. Hearst Castle and grounds are also sometimes referred to as  San Simeon  without distinguishing between the Hearst property and the adjacent unincorporated area of the same name."}, {"url": "http://www.parks.ca.gov/?page_id=590", "passage_text": "Location-Directions. San Simeon State Park is located 35 miles north of San Luis Obispo on Highway 1, and 5 miles south of the Hearst San Simeon State Historical Monument Visitor Center. The community of Cambria is located 2 miles to the South and offers gas stations and grocery stores. "}]