[{"url": "http://edis.ifas.ufl.edu/hs1195", "passage_text": "Temperature: Tomato plants drop their flowers under extreme temperature regimes, such as high daytime temperatures (above 85°F), high nighttime temperatures (above 70°F), or low nighttime temperatures (below 55°F) (Table 1). Optimal growing conditions for tomatoes are daytime temperatures between 70°F and 85°F. "}, {"url": "http://www.gardenguides.com/123438-greenhouse-temperature-tomatoes.html", "passage_text": "If your greenhouse is in a warmer climate, increasing roof height helps keep warmer temperatures away from tomato plants. Proper ventilation is important to help keep temperatures under control. Greenhouses need an effective ventilation system to maintain air circulation. During the day, greenhouse temperatures should stay between 75 and 85 degrees Fahrenheit. Temperatures in this range encourage plant growth and fruit production. This range also discourages development of certain fungal diseases like gray mold."}, {"url": "http://forums.gardenweb.com/discussions/2180826/lowest-temperature-tomato-plants-can-withstand-in-greenhouse", "passage_text": "I have with my own experience seen my tomato plants take temps in the 40s when I was just a hobby grower with no real damage and I have read in these forums that people have had no problem with tomato plants surviving 40 degree nights when protected from wind in a greenhouse. About May 1 I get tired of dragging all my plants in and out of the garage every day, so move them down to the greenhouse. For the next 30 days, I feel fortunate to keep the temp above 40 every night. My tomato plants suffer no ill effects."}, {"url": "http://www.gardeningknowhow.com/edible/vegetables/tomato/growing-temp-for-tomatoes.htm", "passage_text": "This is doubly true when the air is saturated with relative humidity. Advertisement. The growing temp for tomato seedlings should be maintained at constant temps of between 58-60 degrees F. (14-16 C.), whether starting in the greenhouse or indoors, and then not transplanted until the last frost has passed."}, {"url": "http://forums2.gardenweb.com/discussions/1408288/minimum-temperature-tomatoes-will-allow", "passage_text": "There is also an issue of your plants having been grown indoors and never exposed to low temps. That is exactly what the major plant growers (Bonnie, etc) do. They maintain greenhouse temps at minimum 65 degrees to keep the plants growing rapidly. The result is a plant that cannot tolerate temperatures below 65 degrees. All things considered, you would have been better served to have set your plants outdoors in their pots for the day and then back indoors at night. "}, {"url": "http://www.ext.colostate.edu/mg/gardennotes/723.html", "passage_text": "Off-season vegetable production in the hobby solar greenhouse is an enjoyable way for year-round gardeners to extend the harvest season of fresh vegetables. However, without the expense of a greenhouse, gardener can extend the growing season weeks to even months with cold frames and plastic tunnel gardening. "}, {"url": "http://www.gardeningknowhow.com/edible/vegetables/tomato/growing-temp-for-tomatoes.htm", "passage_text": "Most tomatoes are warm season plants and should only be planted after the danger of frost has passed. Tomato temperature tolerance for extreme heat or cold snaps is of extreme importance to the development of blossoms and subsequent fruit set. Advertisement. The growing temp for tomato seedlings should be maintained at constant temps of between 58-60 degrees F. (14-16 C.), whether starting in the greenhouse or indoors, and then not transplanted until the last"}, {"url": "http://forums.gardenweb.com/discussions/2180826/lowest-temperature-tomato-plants-can-withstand-in-greenhouse", "passage_text": "I have an airtight greenhouse that is 10x20x8 that has greenhouse plastic on it. I need to start growing my plants in the next week or so but I am worried about temperatures. I can keep the greenhouse at about 45-50 if the temp drops to the low 20s other than that the temp will stay in the 50s at night. When I first started growing plants 5 years ago in an unheated greenhouse my tomato seedlings in flats survived in the greenhouse unheated to temps in the low 40s without any damage. About May 1 I get tired of dragging all my plants in and out of the garage every day, so move them down to the greenhouse. For the next 30 days, I feel fortunate to keep the temp above 40 every night. My tomato plants suffer no ill effects."}, {"url": "http://www.gardeningknowhow.com/edible/vegetables/tomato/growing-temp-for-tomatoes.htm", "passage_text": "In the summer when temperatures soar over 90 degrees F. (32 C.) with nights over 76 degrees F. (24 C.), again, the tomato plant will suffer damage to immature fruit or loss of flowers. Advertisement. The growing temp for tomato seedlings should be maintained at constant temps of between 58-60 degrees F. (14-16 C.), whether starting in the greenhouse or indoors, and then not transplanted until the last frost has passed."}, {"url": "http://www.omafra.gov.on.ca/english/crops/facts/info_tomtemp.htm", "passage_text": "Chilling and freezing injury of tomato and pepper fruit. The fruit of warm season crops like tomato and pepper can be injured by low temperatures. Chilling injury occurs in tomato fruit if they experience temperatures of 10 ° C for longer than 14 days or temperatures of 5 ° C for more than 6 to 8 days. "}]