[{"url": "http://www.nationalrail.co.uk/posters/PLU.pdf", "passage_text": "8 49 50 Text station name to the above number for live departure and arrival times direct to your mobile. TrainTrackerTM texts cost 25p for each succesful response (plus usual text costs). nationalrail.co.uk www Online www Online 24 hour Travel Information Scan this code with your mobile to take this poster with you. "}, {"url": "http://www.answers.com/Q/What_zone_is_plumstead_in", "passage_text": "Interior zoning is the interior design technique of creating recognizable sub spaces or zones inside of large spaces through variations in sensory input, rather than using str … uctural isolating features such as walls, ceilings and doors. The Tropical Zone is the middle of the planet, along the … Equator. This is the hottest part of the planet on average, where the Sun's rays are focused for the majority of the year. The temperature here is usually humid and warm year round, and the area is covered in rainforest."}, {"url": "http://www.plumstead.org/zoneabout.html", "passage_text": "A note from the Conservation District: Homeowners, pool companies, landscape contractors-Bucks County Conservation District is delegated to administer the Erosion Control Program on behalf of PADEP. Our Board of Directors has established a threshhold of 1,000 square feet of earth disturbance. Disturbances of 1,000 square feet or more require a plan submission to the Conservation District; 2,000 square feet for swimming pools. Should you plan to be disturbing earth on your property, please contact the District at 215-345-7577 EARLY in the process."}, {"url": "http://www.tonnesen.co.za/dunlop-zone-plumstead/", "passage_text": "This Dunlop Zone Franchise is located on the border of Wynberg & Plumstead. It’s location allows for easy access, with plenty off-street parking for clients. Get your Wheel Balancing, Wheel Alignment, Replacement Batteries & Exhaust System checked, replaced or repaired. "}, {"url": "http://katarakta.livejournal.com/", "passage_text": "There is a school in Plumstead with the drama profile, which has been co-operating with PIP since October. Their students are great, they do their diploma with PIP as a client, and we really learn from them. They have some surprising ideas on how to get through to people, which we need, they wrote press release and produced posters. Some of them even turned up to the screening in a really bad weather. Politics is not possible beyond the embodied experience. It is always subjective and always situated in a particular context. Therefore I will never stop being a Pole exploring Plumstead as some terra incognita which opens through a physical contact or some content analysis of the local maps and images."}, {"url": "http://www.bernardskinner.co.uk/local-area/se18/", "passage_text": "Trains. SE18 has four train stations Plumstead, Woolwich Arsenal and Woolwich Dockyard. Plumstead and Woolwich Arsenal are situated in Zone 4, Woolwich Dockyard in Zone 3. Approximately just under 30 minutes to Charing Cross from all Stations. Trains are operated buy South-eastern. Train timetables are available at southeasternrailway.co.uk. There is no shortage of schools, libraries and colleges in SE18. A short walk from Plumstead station is Greenwich Community College offering a wide range of courses from cookery to languages. Notable schools include the newly re-built Foxfield Primary, Saint Pauls and Plumstead Mannor."}, {"url": "https://en.wikipedia.org/wiki/Plumstead", "passage_text": "Plumstead ward (green) within the Royal Borough of Greenwich (light grey). Plumstead is a district of south east London located in the Royal Borough of Greenwich. It is located east of Woolwich and south west of Thamesmead. Plumstead is a multicultural area with large Asian and Afro-Caribbean communities, in similarity to local areas such as Woolwich and Thamesmead. In 960 King Edgar gave four plough lands, collectively called Plumstead, to a monastery-St Augustine's Abbey near Canterbury, Kent. These were subsequently taken from the monastery by Earl Godwin for his fourth son, Tostig."}, {"url": "http://www.allinlondon.co.uk/rail-plumstead.php", "passage_text": "What's on near Plumstead. Check out our What's On listings for things to do near this station. Pubs and Bars near Plumstead. Find bars, clubs and pubs a short walk from the station. Restaurants near Plumstead. Restaurants within walking distance from this station. "}]