[{"url": "http://www.livestrong.com/article/280442-natural-remedy-for-sour-stomach/", "passage_text": "Natural products, such as ginger root, may help relieve a sour stomach. A sour stomach, another term for indigestion, is a common ailment that is characterized by symptoms such as general discomfort, pain, heartburn, bloating and burping. Sour stomachs can be caused by multiple factors"}, {"url": "http://www.healthhype.com/sour-stomach-symptoms-causes-diet-remedy-and-treatment.html", "passage_text": "The most common symptoms attributed to a sour stomach includes 1  : Regurgitation is reflux (retrograde flow) of the stomach contents up into the esophagus which may reach as high up as the throat. 2  It is not as forceful as vomiting and may not involve reverse peristalsis as is seen in the vomiting process. Since the term sour stomach is not a medically defined condition, it is not uncommon for this term to vary in meaning due to regional and linguistic differences. A sour stomach is usually acute – meaning that it is not persistent, recurrent or constant."}, {"url": "http://www.healthhype.com/sour-stomach-symptoms-causes-diet-remedy-and-treatment.html", "passage_text": "The term “ sour stomach ” is commonly used to describe a range of symptoms associated with upper gastrointestinal disturbances. The most notable symptoms attributed to a sour stomach include regurgitation, nausea, stomach bloating and excessive belching. These symptoms are often related to two common gastroesophageal conditions, namely and acid reflux and indigestion. Since the term sour stomach is not a medically defined condition, it is not uncommon for this term to vary in meaning due to regional and linguistic differences. A sour stomach is usually acute – meaning that it is not persistent, recurrent or constant."}, {"url": "http://www.home-remedies-for-you.com/askquestion/47319/acid-indigestion-treatment-what-is-sour-stomach.html", "passage_text": "Sour stomach is also referred to as acid Indigestion. It is a common problem that affects a large number of people. Acid indigestion results in stomach pain due to an increased level of hydrochloric acid in the digestive tract and stomach. Many individuals with acid indigestion also experience heartburn and acid reflux. There are various reasons why the amount of hydrochloric acid in the stomach and digestive tract increases. Many of these sour stomach causes are associated with poor dietary habits and improper lifestyle choices. One of the most common sour stomach causes is eating an excessive amount of food."}, {"url": "http://www.livestrong.com/article/280442-natural-remedy-for-sour-stomach/", "passage_text": "Causes. A sour stomach may be caused by eating too fast, overeating or too much caffeine. Spicy, fatty or greasy foods can also cause indigestion because they are hard to digest. It may also be caused by more serious ailments, such as gallstones and peptic ulcers. A sour stomach, another term for indigestion, is a common ailment that is characterized by symptoms such as general discomfort, pain, heartburn, bloating and burping."}, {"url": "http://www.wisegeek.org/what-causes-a-sour-stomach.htm", "passage_text": "Eating fatty foods too often can cause a sour stomach. A concoction of baking soda and water can ease indigestion. A sour stomach can be caused by stress and anxiety. Spicy and tomato-based foods, like chili, may sometimes cause a sour stomach. A sour stomach may be caused by contaminated drinking water. If stomach pain lasts a few days, it may be best to see a doctor. Frequent episodes of a sour stomach without treatment can cause a stomach ulcer to develop. The root cause of sour stomach is your stomach is producing too much acid, either due to a dilution of the acid already there or just a bad combination of foods which you may have an intolerance to. I found I can no longer drink RC Cola."}, {"url": "http://symptomstreatment.org/sour-stomach/", "passage_text": "Sour stomach comes about when the body produces too much hydrochloric acid. There are several factors that influence the body to produce huge amounts of hydrochloric acid, and these have been closely associated to improper eating habits. Sour stomach occurs as a result of too much hydrochloric acid present in the digestive tract and stomach. There are several reasons why the levels of hydrochloric acid increase resulting to sour stomach."}, {"url": "http://ehealthwall.com/sour-stomach-home-remedies-symptoms-causes-cure-diagnosis/", "passage_text": "Sour Stomach is commonly known as acid indigestion. It is the result of having an abominable digestion that leads to buildup of acid and reflux into the esophagus. "}, {"url": "http://www.simple-remedies.com/home-remedies/common-digestive-disorders/sour-stomach.html", "passage_text": "What are the Common Causes Sour Stomach. There are several reasons for acid indigestion that can lead to sour stomach. Most of them are related to living a stressful life and bad eating habits. That means it is possible to minimize the symptom of sour stomach by altering your lifestyle and food habits."}, {"url": "http://www.diyhomeremedies.org/sour-stomach-remedies-causes-symptoms/", "passage_text": "Sour stomach is a group of symptoms (mostly related to stomach) that any individuals can experience and feel general uneasiness. Sour stomach also termed as upset stomach, acid re-flux, stomach bloating, stomach pain, excessive belching etc. Ideally speaking sour stomach is nothing but deranged health of upper gastrointestinal track which causes nausea, burning in stomach, belching, indigestion and upper abdominal pain. List of things that causes sour stomach is exhausting. Anything that irritates stomach cells can cause sour stomach. 1  Eating Spicy, Greasy & Fatty Food. 2  Excessive drinking Carbonated Beverages, Alcohol, Coffee or Tea etc. 3  Eating hastily or overeating. 4  Irregular eating intervals."}]