[{"url": "http://www.funtrivia.com/askft/Question118667.html", "passage_text": "2 votes Vote for this answer. Government -- Region of Norway. Svalbard (Russian: шпицберген Spitsbergen) is an archipelago in the Arctic, constituting the northernmost part of Norway. Located north of mainland Europe, it is about midway between mainland Norway and the North Pole"}, {"url": "http://schools-wikipedia.org/wp/s/Svalbard.htm", "passage_text": "Svalbard is completely controlled by the Kingdom of Norway and is part of it. The Svalbard Treaty recognizes Norwegian sovereignty over Svalbard. However Norway's power over Svalbard has some limitations in taxation, environmental conservation, non-discrimination and certain military activity. Svalbard consists of a group of islands in the Arctic Ocean ranging from 76° to 81° North and 10° to 35° East, and forms the northern-most part of Norway and the northern-most lands of Europe."}, {"url": "http://wikitravel.org/en/Svalbard", "passage_text": "Svalbard (Russian: шпицберген, Shpitsbergen or грумант, Grumant) is a group of islands located between the Arctic Ocean, Barents Sea, Greenland Sea, and the Norwegian Sea. The islands are directly North of (and since 1920 an integrated part of) Norway. "}, {"url": "http://schools-wikipedia.org/wp/s/Svalbard.htm", "passage_text": "Svalbard was made a part of Norway by a Norwegian act in 1925, thus Svalbard is not a Norwegian dependency. However, under the terms of the treaty, citizens of signatory states have rights to exploit mineral deposits and other natural resources on a footing of absolute equality. Svalbard consists of a group of islands in the Arctic Ocean ranging from 76° to 81° North and 10° to 35° East, and forms the northern-most part of Norway and the northern-most lands of Europe."}, {"url": "http://schools-wikipedia.org/wp/s/Svalbard.htm", "passage_text": "The archipelago is the northernmost part of Norway. Three islands are populated: Spitsbergen, Bear Island and Hopen. The largest settlement is Longyearbyen. The Svalbard Treaty recognises Norwegian sovereignty over Svalbard and the 1925 Svalbard Act makes Svalbard a full part of the Norwegian Kingdom. Svalbard consists of a group of islands in the Arctic Ocean ranging from 76° to 81° North and 10° to 35° East, and forms the northern-most part of Norway and the northern-most lands of Europe."}, {"url": "http://www.worldatlas.com/aatlas/infopage/svalbard.htm", "passage_text": "Svalbard. Svalbard is an archipelago positioned in the Arctic Ocean to the north of mainland Europe, about midway between Norway and the North Pole. The archipelago is the northernmost part of the Kingdom of Norway. Total population is just over 2,200, with most people living in Longyearbyen on the rugged island of Spitsbergen"}, {"url": "https://en.wikipedia.org/wiki/Svalbard", "passage_text": "The Svalbard Treaty of 1920 recognizes Norwegian sovereignty, and the 1925 Svalbard Act made Svalbard a full part of the Kingdom of Norway. They also established Svalbard as a free economic zone and a demilitarized zone. The Norwegian Store Norske and the Russian Arktikugol remain the only mining companies in place. Since the resettlement of Svalbard in the early 20th century, coal mining has been the dominant commercial activity. Store Norske Spitsbergen Kulkompani, a subsidiary of the Norwegian Ministry of Trade and Industry, operates Svea Nord in Sveagruva and Mine 7 in Longyearbyen."}, {"url": "http://wikitravel.org/en/Longyearbyen", "passage_text": "Longyearbyen is the largest populated area on the territory of Svalbard, located in the high Norwegian Arctic. The settlement is popular as the most easily accessed frontier in the Arctic, and is an ideal base for the greater exploration of Svalbard. "}, {"url": "https://en.wikipedia.org/wiki/Svalbard", "passage_text": "Administratively, the archipelago is not part of any Norwegian county, but rather forms an unincorporated area administered by governor appointed by the Norwegian government. Since 2002, Svalbard's main settlement, Longyearbyen, has had an elected local government, somewhat similar to mainland municipalities. Since the resettlement of Svalbard in the early 20th century, coal mining has been the dominant commercial activity. Store Norske Spitsbergen Kulkompani, a subsidiary of the Norwegian Ministry of Trade and Industry, operates Svea Nord in Sveagruva and Mine 7 in Longyearbyen."}]