[{"url": "http://www.edinformatics.com/math_science/transverse_longitudinal_waves.htm", "passage_text": "Transverse Wave s. A transverse wave is a wave in which the motion of the medium is a right angles to the direction of the wave. A wave on a rope is a transverse wave. Light and other electromagnetic waves are also transverse waves. In a longitudinal wave, the motion of the medium is parallel to the direction of the wave. This means that the particles move left and right which in turn makes the other particles start to oscillate."}, {"url": "https://en.wikipedia.org/wiki/Longitudinal_wave", "passage_text": "In longitudinal waves, the displacement of the medium is parallel to the propagation of the wave. A wave along the length of a stretched Slinky toy, where the distance between coils increases and decreases, is a good visualization. Sound waves in air are longitudinal, pressure waves. From Wikipedia, the free encyclopedia. Longitudinal waves, also known as l-waves, are waves in which the displacement of the medium is in the same direction as, or the opposite direction to, the direction of travel of the wave."}, {"url": "https://en.wikipedia.org/wiki/Longitudinal_wave", "passage_text": "Mechanical longitudinal waves are also called compressional waves or compression waves, because they produce compression and rarefaction when traveling through a medium. The other main type of wave is the transverse wave, in which the displacements of the medium are at right angles to the direction of propagation. From Wikipedia, the free encyclopedia. Longitudinal waves, also known as l-waves, are waves in which the displacement of the medium is in the same direction as, or the opposite direction to, the direction of travel of the wave."}, {"url": "http://hyperphysics.phy-astr.gsu.edu/hbase/Sound/tralon.html", "passage_text": "Transverse Waves. For transverse waves the displacement of the medium is perpendicular to the direction of propagation of the wave. A ripple on a pond and a wave on a string are easily visualized transverse waves. In longitudinal waves the displacement of the medium is parallel to the propagation of the wave. A wave in a slinky is a good visualization. Sound waves in air are longitudinal waves."}, {"url": "http://www.acs.psu.edu/drussell/Demos/waves/wavemotion.html", "passage_text": "Mechanical Waves are waves which propagate through a material medium (solid, liquid, or gas) at a wave speed which depends on the elastic and inertial properties of that medium. There are two basic types of wave motion for mechanical waves: longitudinal waves and transverse waves. The animations below demonstrate both types of wave and illustrate the difference between the motion of the wave and the motion of the particles in the medium through which the wave is travelling. Longitudinal Waves. To see a animations of spherical longitudinal waves check out: In a longitudinal wave the particle displacement is parallel to the direction of wave propagation. The animation at right shows a one-dimensional longitudinal plane wave propagating down a tube."}, {"url": "http://www.answers.com/Q/What_is_the_difference_between_lateral_and_longitudinal_directions", "passage_text": "Particles in transverse waves vibrate perpendicular to the direction of the wave and those in longitudinal waves vibrate parallel to the direction of the wave.   Light wave … s are transverse waves while sound waves are longitudinal. "}, {"url": "http://www.edinformatics.com/math_science/transverse_longitudinal_waves.htm", "passage_text": "Longitudinal Waves. In a longitudinal wave, the motion of the medium is parallel to the direction of the wave. This means that the particles move left and right which in turn makes the other particles start to oscillate. Sound waves are longitudinal w"}, {"url": "http://www.bbc.co.uk/schools/gcsebitesize/science/aqa/waves/generalwavesrev2.shtml", "passage_text": "Transverse waves. In transverse waves, the oscillations (vibrations) are at right angles to the direction of travel and energy transfer. Light and other types of electromagnetic radiation are transverse waves. All types of electromagnetic waves travel at the same speed through a vacuum, such as through space"}]