[{"url": "http://investor.krispykreme.com/phoenix.zhtml?c=120929&p=irol-newsArticle&ID=2053004", "passage_text": "Company Profile Info Krispy Kreme is an international retailer of premium-quality sweet treats, including its signature hot Original Glazed® doughnut. Headquartered in Winston-Salem, NC, the company has offered the highest-quality doughnuts and great-tasting coffee since it was founded in 1937."}, {"url": "http://ncpedia.org/krispy-kreme", "passage_text": "Krispy Kreme Doughnut Corporation was founded in Winston-Salem in 1937 by Vernon Rudolph."}, {"url": "http://ncpedia.org/krispy-kreme", "passage_text": "by Jay Mazzocchi, 2006. Krispy Kreme Doughnut Corporation was founded in Winston-Salem in 1937 by Vernon Rudolph. A few years earlier Rudolph’s uncle, a Paducah, Ky., storeowner, had purchased a secret yeast-raised doughnut recipe and the copyrighted name Krispy Kreme from New Orleans chef Joe LeBeau."}, {"url": "http://yipit.com/business/krispy-kreme/", "passage_text": "Krispy Kreme Coupons 2014. Krispy Kreme Doughnuts, Inc. was founded in 1937 by Vernon Carver Rudolph. Mr. Rudolph began his dream by selling donuts to local stores in Winston Salem, North Carolina. Currently Krispy Kreme sells products in its stores, Walmart, Target, convenient, service station and grocery stores."}, {"url": "https://www.visitnc.com/story/north-carolina-s-famous-foods", "passage_text": "Vernon Rudolph founded Krispy Kreme in Winston-Salem in 1937 and sold his first doughnuts for 25 cents a dozen after borrowing the ingredients from a nearby grocer. Today, Krispy Kreme produces millions of doughnuts a day. The company has grown to serve customers in more than 38 states and Canada."}, {"url": "http://www.franchising.com/krispykreme/", "passage_text": "About Krispy Kreme. Krispy Kreme is a global retailer of premium-quality sweet treats, including its signature Original Glazed® doughnut. Headquartered in Winston-Salem, N.C., the Company has offered the highest-quality doughnuts and great-tasting coffee since it was founded in 1937."}]