[{"url": "http://www.rxlist.com/mobic-side-effects-drug-center.htm", "passage_text": "Mobic (meloxicam) is used to treat pain or inflammation caused by arthritis. It is a non-steroidal anti-inflammatory drug (NSAID). This medication is available in generic form. Common side effects of Mobic include stomach upset, nausea, drowsiness, or diarrhea. "}, {"url": "http://pain.emedtv.com/meloxicam/meloxicam.html", "passage_text": "Meloxicam (Mobic ®) is a prescription medicine used to treat pain, inflammation, swelling, and/or stiffness. It is part of a class of drugs called nonsteroidal anti-inflammatory drugs, or NSAIDs for short. "}, {"url": "http://www.ncbi.nlm.nih.gov/pubmedhealth/PMHT0011069/", "passage_text": "Featured article ». Meloxicam is a nonsteroidal anti-inflammatory drug (NSAID) used to relieve the symptoms of arthritis (juvenile rheumatoid arthritis, osteoarthritis, and rheumatoid arthritis), such as inflammation, swelling, stiffness, and joint pain. "}, {"url": "http://www.emedicinehealth.com/drug-meloxicam/article_em.htm", "passage_text": "Meloxicam is a nonsteroidal anti-inflammatory drug (NSAID). Meloxicam works by reducing hormones that cause inflammation and pain in the body. Meloxicam is used to treat pain or inflammation caused by osteoarthritis or rheumatoid arthritis in adults and children who are at least 2 years old. Meloxicam may also be used for purposes not listed in this medication guide."}, {"url": "http://www.everydayhealth.com/drugs/meloxicam", "passage_text": "A: Meloxicam (Mobic) is used to relieve pain, tenderness, swelling, and stiffness caused by osteoarthritis and rheumatoid arthritis. Meloxicam is also used to relieve the pain, tenderness,swelling, and stiffness caused by juvenile rheumatoid arthritis in children two years of age and older. Meloxicam is in a class of medications called non-steroidal anti-inflammatory drugs (NSAIDs). Meloxicam, a non-steroidal anti-inflammatory drug (NSAID), works by blocking the enzymes responsible for making prostaglandins, compounds that contribute to inflammation, especially joint inflammation. By reducing the levels of prostaglandins, inflammation and other symptoms can be reduced."}, {"url": "http://www.ncbi.nlm.nih.gov/pubmedhealth/PMHT0011069/?report=details", "passage_text": "Uses. Meloxicam is a nonsteroidal anti-inflammatory drug (NSAID) used to relieve the symptoms of arthritis (juvenile rheumatoid arthritis, osteoarthritis, and rheumatoid arthritis), such as inflammation, swelling, stiffness, and joint pain. "}, {"url": "http://www.everydayhealth.com/drugs/meloxicam", "passage_text": "Meloxicam, sold under the brand name Mobic, is a prescription drug used to treat pain and inflammation. Meloxicam is prescribed to people who have tenderness, swelling, and pain caused by the inflammation of osteoarthritis, rheumatoid arthritis, and juvenile rheumatoid and idiopathic arthritis (JRA/JIA). Meloxicam, a non-steroidal anti-inflammatory drug (NSAID), works by blocking the enzymes responsible for making prostaglandins, compounds that contribute to inflammation, especially joint inflammation. By reducing the levels of prostaglandins, inflammation and other symptoms can be reduced."}, {"url": "http://www.medicinenet.com/meloxicam/article.htm", "passage_text": "Meloxicam was approved for use in April 2000. PRESCRIBED FOR: Meloxicam is used to treat tenderness, swelling, and pain caused by the inflammation of osteoarthritis, rheumatoid arthritis, and juvenile rheumatoid arthritis in patients 2 years of age or older. SIDE EFFECTS: Common side effects with NSAIDs are related to the gastrointestinal tract (GI) and include: BRAND NAME: Mobic. DRUG CLASS AND MECHANISM: Meloxicam is in a class of drugs called nonsteroidal anti-inflammatory drugs (NSAIDs) that are used to treat pain and/or inflammation. Other members of this class include ibuprofen (Motrin), indomethacin (Indocin), nabumetone (Relafen) and several others."}, {"url": "http://www.webmd.com/drugs/2/drug-911/meloxicam-oral/details", "passage_text": "Uses. Meloxicam is used to treat arthritis. It reduces pain, swelling, and stiffness of the joints. Meloxicam is known as a nonsteroidal anti-inflammatory drug (NSAID). If you are treating a chronic condition such as arthritis, ask your doctor about non-drug treatments and/or using other medications to treat your pain. See also Warning section"}]