[{"url": "http://livewell.jillianmichaels.com/time-out-rules-basketball-4328.html", "passage_text": "In televised basketball games, each team receives a single 60-second timeout per game and an additional four 30-second timeouts per game. Each team can carry over three of the 30-second timeouts into the second half of the game."}, {"url": "http://www.nba.com/canada/Basketball_U_on_Timeouts-Canada_Generic_Article-18067.html", "passage_text": "The NBA has 20 second and regular timeouts. Each team is entitled to one 20 second timeout per half and six regular timeouts per game (each team is limited to no more than three timeouts in the fourth period and no more than two timeouts in the last two minutes of regulation play)."}, {"url": "http://www.livestrong.com/article/142297-rules-timeouts-basketball/", "passage_text": "Number and Length. The number and length of timeouts varies widely among various basketball leagues. For example, high school rules allow for five timeouts for each team during the course of the game. Three of those timeouts are 60 seconds in length, while two are 30 seconds. In college basketball, televised games feature four timeouts per half, to allow for commercial breaks. Each team also receives one 60-second timeout, and four 30-second timeouts, according to the National Collegiate Athletic Association."}, {"url": "http://www.livestrong.com/article/142297-rules-timeouts-basketball/", "passage_text": "Calling Timeouts. In high school and college basketball, players on the court or the coach may call timeouts. In the NBA, only players in the court are permitted to call timeouts. Players and coaches may only call timeouts when the ball is dead, or when the ball is live and their team has sole possession."}, {"url": "http://offtherim.bangordailynews.com/2012/12/05/high-school/when-basketball-coaches-can-call-a-timeout/", "passage_text": "Both Teams are allowed 5 time outs in high school basketball: 3 – 60 second timeouts and 2 – 30 second time outs. The 60 second timeouts many times are called full timeouts by many basketball people. But there is no such thing as a full time out, as officials don’t call a half a full timre out on a 30 second timeout. Any additional time outs will result in a technical foul."}]