[{"url": "http://people.brandeis.edu/~rafrazer/cholhamoed.shtml", "passage_text": "On Chol Hamoed (the intermediate days of Sukkot and Pesach), some work is prohibited, similar to a holiday, while some is permitted, similar to a weekday. These rules are discussed extensively in Shulchan Aruch Orach Chayim 530-548."}, {"url": "http://www.chabad.org/holidays/JewishNewYear/template_cdo/aid/1000452/jewish/Chol-Hamoed.htm", "passage_text": "On Chol Hamoed, however, we are permitted to do many of these activities. For example, we may use electricity or drive a car. (Unless, of course, the intermediate day is also Shabbat.) Nevertheless, we still try to avoid going to work, doing laundry, writing and certain other"}, {"url": "http://www.yeshiva.co/ask/?id=5825", "passage_text": "Generally writing on Chol HaMoed is forbidden, together with most of the other melachot. However, as writing is a non-skilled task (as opposed to calligraphy or the writing of a Sofer Stam who writes mezzuzot etc), there are certain situations where it is permitted."}, {"url": "http://www.thehalacha.com/wp-content/uploads/Vol5Issue7.pdf", "passage_text": "91 One is permitted to write a cheshbon (list) on chol hamoed even if it is not for chol hamoed use, since one may enjoy doing it; this is considered a Yom Tov need. 92 Under the above halacha falls any lists which one writes in order not to forget something."}, {"url": "http://www.thehalacha.com/wp-content/uploads/Vol5Issue7.pdf", "passage_text": "Puzzles are not considered writing and are permitted on chol hamoed (Chol Hamoed K’hilchoso 6:87). Magic Slate is not writing (Refer to Mishnah Berurah 30, Aruch Ha’shulchan 545:18, Chol Hamoed page 195:54 quoting the opinion of the Be’er Moshe)."}, {"url": "http://people.brandeis.edu/~rafrazer/cholhamoed.shtml", "passage_text": "Laws of Chol Hamoed. On Chol Hamoed (the intermediate days of Sukkot and Pesach), some work is prohibited, similar to a holiday, while some is permitted, similar to a weekday. These rules are discussed extensively in Shulchan Aruch Orach Chayim 530-548."}, {"url": "http://www.yeshiva.co/ask/?id=5825", "passage_text": "When writing on Chol HaMoed, some people have a custom to write the letters slightly on a slant, so as to recall that it is a festival. If this is possible (in your own private notes for example) it would be a good idea, but not an obligation. Blessings."}, {"url": "http://www.theyeshivaworld.com/news/headlines-breaking-stories/264764/hilchos-chol-hamoed.html", "passage_text": "What is important to keep in mind is that even the Melachos that are permitted on Chol Hamoed are only permitted if they are done l’tzorech hamoed (for the sake of Chol Hamoed, i.e. in order to benefit from them on Chol Hamoed)."}, {"url": "http://www.koltorah.org/ravj/Chol%20Hamoed%20Observance%20in%20Modern%20Times.htm", "passage_text": "Accordingly, the nature of the Chol Hamoed restrictions fundamentally differs from the prohibition to work on Shabbat and Yom Tov. The prohibition to work on Shabbat and Yom Tov is not utilitarian in nature. Thus, the Halacha forbids Melacha on Shabbat and Yom Tov in all circumstances except for danger to life."}]