[{"url": "http://www.webmd.com/diet/trans-fats-science-and-risks", "passage_text": "Indeed, trans fats can be found in a laundry list of foods including vegetable shortening, margarine, crackers (even healthy sounding ones like Nabisco Wheat Thins), cereals, candies, baked goods, cookies, granola bars, chips, snack foods, salad dressings, fats, fried foods, and many other processed foods. "}, {"url": "http://www.fda.gov/Food/ResourcesForYou/Consumers/ucm079609.htm", "passage_text": "Trans fat can be found in many of the same foods as saturated fat. These can include: 1  Coffee creamer. 2  Crackers, cookies, cakes, frozen pies, and other baked goods. 3  Fast food. 4  Frozen pizza. 5  Ready-to-use frostings. 6  Refrigerated dough products (such as biscuits and cinnamon rolls). 7  Snack foods (such as microwave popcorn). There are two sources of trans fat, also known as trans fatty acids: 1  Trans fat formed naturally – this type of trans fat is produced in the gut of some grazing animals. 2  That’s why small quantities of trans fat can be found in animal products like meat, milk, and milk products."}, {"url": "http://www.tfx.org.uk/page13.html", "passage_text": "They are also commonly found in restaurant food, especially-but not only-in fast food. You can also make your own trans fat (in small amounts) by repeatedly re-heating cooking oil. Some trans fats occur naturally in ruminants' stomachs and are thus found in meat and dairy produce. However the quantities are small, and in any event these natural trans fats do not appear to be harmful to human health-as are the man-made trans fats found in hydrogenated vegetable oils. Many confectionery products contain trans fats. Hydrogenated vegetable oils are found, for example, in many 'bars', including Mars, Twix, Milky Way, Tracker, Snickers, Picnic, Double Decker, Time Out and Fuse."}, {"url": "https://en.wikipedia.org/wiki/Trans_fat", "passage_text": "Trans fats, or trans-unsaturated fatty acids, trans fatty acids, are a type of unsaturated fats that are uncommon in nature but became commonly produced industrially from vegetable fats for use in margarine, snack food, packaged baked goods and frying fast food starting in the 1950s. Two Canadian studies have shown that the natural trans fat vaccenic acid, found in beef and dairy products, could actually be beneficial compared to hydrogenated vegetable shortening, or a mixture of pork lard and soy fat, by lowering total and LDL and triglyceride levels."}, {"url": "http://www.webmd.com/diet/guide/understanding-trans-fats", "passage_text": "The proposed ban doesn't affect the small amounts of natural trans fats found in beef, lamb, and full-fat dairy products. Food makers once used artificial trans fats to enhance the flavor, texture, and shelf life of processed foods. They're bad for your heart health. Trans fats raise LDL bad cholesterol and make you more likely to get heart disease. They also lower HDL good cholesterol. The FDA wants to ban food companies from using artificial trans fats without special permission."}, {"url": "http://www.mayoclinic.org/diseases-conditions/high-blood-cholesterol/in-depth/trans-fat/ART-20046114", "passage_text": "Trans fat in your food. The manufactured form of trans fat, known as partially hydrogenated oil, is found in a variety of food products, including: 1  Baked goods. 2  Most cakes, cookies, pie crusts and crackers contain shortening, which is usually made from partially hydrogenated vegetable oil. 3  Ready-made frosting is another source of trans fat. The manufactured form of trans fat, known as partially hydrogenated oil, is found in a variety of food products, including: 1  Baked goods. 2  Snacks. 3  Fried food. 4  Refrigerator dough. 5  Creamer and margarine."}, {"url": "http://www.fda.gov/Food/PopularTopics/ucm292278.htm", "passage_text": "Artificial trans fat can be found in many of the same foods as saturated fat, including: 1  Baked goods (cookies, cakes, pies, and crackers). 2  Ready-to-use frostings. 3  Snack food (such as potato chips and microwave popcorn). 4  Fried food typically found in fast food restaurants (such as French fries, fried chicken, and doughnuts). Most of the trans fat in the foods we eat is formed through a manufacturing process that adds hydrogen to vegetable oil, which converts the liquid into a solid fat at room temperature. This process is called hydrogenation. Partially hydrogenated oils are the major source of artificial trans fats in the food supply."}, {"url": "http://www.nhs.uk/chq/Pages/2145.aspx?CategoryID=51", "passage_text": "Artificial trans fats can be found in some processed foods such as biscuits and cakes, where they are sometimes used to help give products a longer shelf life. However, in recent years many food manufacturers have removed trans fats from their products. If you want to reduce your intake of trans fats, you should: 1  avoid products that list partially hydrogenated fat or oil on the label. 2  include lots of fruit and vegetables in your diet. 3  use fat-free or low-fat dairy products. 4  try to eat fewer biscuits, cakes and pastries."}]