[{"url": "http://lpi.oregonstate.edu/mic/food-beverages/whole-grains", "passage_text": "1 Whole-grain foods contain the entire grain, including the bran, the endosperm, and the germ. ( 2 More information). 3  Epidemiological studies have found that diets rich in whole grains are associated with reduced risks of cardiovascular disease and type 2 diabetes compared to diets high in refined grains."}, {"url": "https://www.eatforhealth.gov.au/food-essentials/five-food-groups/grain-cereal-foods-mostly-wholegrain-and-or-high-cereal-fibre", "passage_text": "Wholegrain cereals contain the three layers of the grain. Wholegrain cereals contain more fibre, vitamins, minerals and antioxidants than refined cereal foods such as white bread, because many of the important nutrients occur in the outer layer of the grain which is lost during processing."}, {"url": "http://www.webmd.com/diet/healthy-kitchen-11/reaping-benefits-whole-grains", "passage_text": "Whole grains are packed with nutrients, including protein, fiber, B vitamins, antioxidants, and trace minerals (iron, zinc, copper, and magnesium). A diet rich in whole grains has been shown to reduce the risk of heart disease, type 2 diabetes, obesity, and some forms of cancer."}, {"url": "http://www.choosemyplate.gov/grains", "passage_text": "Any food made from wheat, rice, oats, cornmeal, barley or another cereal grain is a grain product. Bread, pasta, oatmeal, breakfast cereals, tortillas, and grits are examples of grain products. Grains are divided into 2 subgroups, Whole Grains and Refined Grains. Whole grains contain the entire grain kernel ― the bran, germ, and endosperm. Examples of whole grains include whole-wheat flour, bulgur (cracked wheat), oatmeal, whole cornmeal, and brown rice. Refined grains have been milled, a process that removes the bran and germ."}, {"url": "http://preventcancer.aicr.org/site/PageServer?pagename=foodsthatfightcancer_whole_grains", "passage_text": "Brown rice is a whole grain, white rice is not. Other whole-grain foods include wheat breads, rolls, pasta and cereals; whole grain oat cereals such as oatmeal, popcorn, wild rice, tortilla and tortilla chips, corn, kasha (roasted buckwheat) and tabouleh (bulghur wheat)."}, {"url": "http://www.diabetes.org/food-and-fitness/food/what-can-i-eat/making-healthy-food-choices/grains-and-starchy-vegetables.html", "passage_text": "Some foods only contain a small amount of whole grain but will say it contains whole grain on the front of the package. For all cereals and grains, read the ingredient list and look for the following sources of whole grains as the first ingredient: 1  Bulgur (cracked wheat). 2  Whole wheat flour. 3  Whole oats/oatmeal."}, {"url": "http://lpi.oregonstate.edu/mic/food-beverages/whole-grains", "passage_text": "1 Eat whole-grain breakfast cereals, such as wheat flakes, shredded wheat, muesli, and oatmeal. 2  Bran cereals are not actually whole-grain cereals, but their high fiber content also makes them a good breakfast choice."}]