[{"url": "http://www.answers.com/Q/Why_water_is_considered_as_a_pure_substance", "passage_text": "No. A pure substance describes one that contains only one type of element/molecule. Mineral water is a mixture, since it contains many different types of minerals, next to wat … er, and can therefore not be called a pure substance. Its a compound of hydrogen and oxygen. Technically if you had 100 % pure water is would be a pure substance. But in reality it is impossible to have anything 100 % pure."}, {"url": "http://www.waterstore.com/pure-water/", "passage_text": "Water is essential to life. There are many different types of water depending on its sources and processes. All water is different, meaning water will have different elements in various concentrations. Qualities of Water: 1  Water is vital to all known forms of life, and is essential to living a healthy lifestyle. 2  Your body uses water to hydrate, lubricate, and cleanse. 3  The kidney is the body’s filter and uses water to rinse and flush the excess minerals and contaminates from the body"}, {"url": "http://www.sedifilt.com/technical_library/boiler_feedwater_treatment_part_i_why_water_treatment_is_necessary.html", "passage_text": "Pure water, H2O, is a simple combination of hydrogen and oxygen. There are, however, several hybrids forms of water in all supplies. Water often contains about 300 ppm of deuterium oxide, D2O, or ‘heavy water’. It has no use as drinking water or in making plants grow, but in pure form has found use in nuclear reactors. At a pressure of 200 psig, for example, water boils at a temperature of about 388oF. At the critical pressure of 3200 psig (where water is converted to steam without change in volume), the boiling point is 704oF. As the pressure decreases, the boiling point of water decreases."}, {"url": "https://answers.yahoo.com/question/index?qid=20060830173315AAMjXM5", "passage_text": "· just now. Report Abuse. Water is a mixture because it is made up of molecules that are composed of two atoms of hydrogen and one atom of oxygen. An atom is the smallest particle of a pure substance (element) that has all the properties of that substance. A molecule is made up of a number of atoms bonded together. Water is not an element but it is an organic chemical that is required for life as we know it to exist. H2O is pure water. Water can have a lot of other things in it to make it not a pure substance. Water is the standard of our scientific realm. It is the universal solvent (water dissolved the Grand Canyon, ya know)."}, {"url": "http://www.answers.com/Q/Why_water_is_considered_as_a_pure_substance", "passage_text": "A pure substance is matter that contains only one type of particle. Compounds consist of two or more elements, but they are still pure substances because there is only one par … ticle-the elements are chemically joined. (For example, water is a compound made of 2 parts hydrogen to 1 part oxygen.). Its a compound of hydrogen and oxygen. Technically if you had 100 % pure water is would be a pure substance. But in reality it is impossible to have anything 100 % pure."}, {"url": "http://themastercleanse.org/pure-water/", "passage_text": "We all also know how important Pure Water is. Drinking 5 glasses of water daily decreases the risk of colon cancer by 45%, plus it can slash the risk of breast cancer by 79%, and one is 50% less likely to develop bladder cancer. But still we as a people are chronically dehydrated. "}, {"url": "https://en.wikipedia.org/wiki/Pure_Water", "passage_text": "Distilled water has been the most common form of purified water, but, in recent years, water is more frequently purified by other processes including Capacitive deionization, reverse osmosis, carbon filtering, microfiltration, ultrafiltration, ultraviolet oxidation, or electrodeionization. Purified water is water that has been mechanically filtered or processed to remove impurities and make it suitable for use."}]