[{"url": "http://www.didjshop.com/austrAboriginalMusicInstruments.htm", "passage_text": "The Australian Aboriginal people developed three musical instruments-the didjeridu, the bullroarer, and the gum-leaf. Most well known is the didjeridu, a simple wooden tube blown with the lips like a trumpet, which gains its sonic flexibility from controllable resonances of the player's vocal tract. They also developed three musical instruments-the didjeridu, usually spelt didgeridoo in the non-academic literature and actually called a yidaki or yiraki in the Aboriginal language of the region where it originated, the bull-roarer, and the gumleaf."}, {"url": "https://en.wikipedia.org/wiki/Didgeridoo", "passage_text": "Names and etymology [edit]. There are numerous names for the instrument among the Aboriginal peoples of northern Australia, none of which closely resemble the word didgeridoo (see below). Archaeological studies of rock art in Northern Australia suggest that the people of the Kakadu region of the Northern Territory have been using the didgeridoo for less than 1,000 years, based on the dating of paintings on cave walls and shelters from this period."}, {"url": "https://en.wikipedia.org/wiki/Didgeridoo", "passage_text": "Many didgeridoo enthusiasts and some scholars advocate reserving local names for traditional instruments, and this practice has been endorsed by some Aboriginal community organisations. Archaeological studies of rock art in Northern Australia suggest that the people of the Kakadu region of the Northern Territory have been using the didgeridoo for less than 1,000 years, based on the dating of paintings on cave walls and shelters from this period."}, {"url": "https://en.wikipedia.org/wiki/Didgeridoo", "passage_text": "The didgeridoo (/ˌdɪdʒəriːˈduː/) (also known as a didjeridu) is a wind instrument developed by Indigenous Australians of northern Australia potentially within the last 1,500 years and still in widespread use today both in Australia and around the world. Archaeological studies of rock art in Northern Australia suggest that the people of the Kakadu region of the Northern Territory have been using the didgeridoo for less than 1,000 years, based on the dating of paintings on cave walls and shelters from this period."}, {"url": "http://www.youtube.com/watch?v=V1pDPuetPdg", "passage_text": "Australian aboriginals. Australian native music (didgeridoo). Australia. The didgeridoo (also known as a didjeridu) is a wind instrument developed by Indigenous Australians of northern Australia around 1,500 years ago and still in widespread use today both in Australia and around the world. It is sometimes described as a natural wooden trumpet or drone pipe."}, {"url": "http://www.answers.com/Q/What_are_some_aboriginal_instruments", "passage_text": "This is a didgeridoo. The didgeridoo plays an important part in corroborees (aboriginal ceremonial dances), and the sound that comes through the instrument can be altered to r … epresent different animals, e.g. the laughing of a kookaburra, the bounding of a kangaroo, the screech of a cockatoo, and so on. 1 person found this useful."}, {"url": "http://hmcs.scu.edu.au/MUSICARCHIVE/AUSGENERAL.HTML", "passage_text": "In constructing their instruments, Aboriginal Australians use the resources at hand. Most of their instruments fall into the idiophone class, where instruments consist of two separate parts which are stuck together to give a percussive sound. Throughout Australia, this kind of instrument takes many different forms. Of the membraphones, or skinned drum types, there is only one example. There are no chordophones, or string instruments; however in the aerophone, or wind instrument class, one example provides an outstanding exhibition of musical ingenuity. To the Australian aboriginal, music is understood naturally and is an integral part of life. In the west, by contrast, music tends to be separated from life. For example, a Western music student must learn to understand a composed piece of music, like a Beethoven symphony or one of Bach's works."}, {"url": "http://www.toptenz.net/top-10-strangest-musical-instruments.php", "passage_text": "4. Didgeridoo. While there are many “one of a kind” musical instruments that belong on this list of the top 10 strangest musical instruments, one instrument that is not completely unique deserves a place among them: the didgeridoo. This Australian wind instrument is believed to be the oldest wind instrument in the world"}, {"url": "http://www.infoplease.com/spot/aboriginal1.html", "passage_text": "Aboriginal music is often recognizable for its most famous instrument, the didgeridoo. A wind instrument typically made from bamboo, it extends about five feet and produces a low, vibrating hum. Aborigines use didgeridoos in formal ceremonies at such events as sunsets, circumcisions, and funerals. "}]