[{"url": "https://en.wikipedia.org/wiki/Leukemia", "passage_text": "Leukemia (American English) or leukaemia (British English) is a group of cancers that usually begin in the bone marrow and result in high numbers of abnormal white blood cells. These white blood cells are not fully developed and are called blasts or leukemia cells. The exact cause of leukemia is unknown. Different kinds of leukemia are believed to have different causes. Both inherited and environmental (non-inherited) factors are believed to be involved. Risk factors include smoking, ionizing radiation, some chemicals (such as benzene), prior chemotherapy, and Down syndrome."}, {"url": "http://www.cancer.org/cancer/leukemiainchildren/detailedguide/childhood-leukemia-what-causes", "passage_text": "The exact cause of most childhood leukemias is not known. Most children with leukemia do not have any known risk factors. Still, scientists have learned how certain changes in the DNA inside normal bone marrow cells can cause them to become leukemia cells. "}, {"url": "http://www.mayoclinic.org/diseases-conditions/leukemia/basics/causes/CON-20024914", "passage_text": "The major types of leukemia are: 1  Acute lymphocytic leukemia (ALL). 2  This is the most common type of leukemia in young children. 3  ALL can also occur in adults. 4  Acute myelogenous leukemia (AML). 5  AML is a common type of leukemia. 6  It occurs in children and adults. 7  AML is the most common type of acute leukemia in adults. 1 This is the most common type of leukemia in young children. 2  ALL can also occur in adults. 3  Acute myelogenous leukemia (AML). 4  AML is a common type of leukemia. 5  It occurs in children and adults. 6  AML is the most common type of acute leukemia in adults. 7  Chronic lymphocytic leukemia (CLL)."}, {"url": "http://www.medicalnewstoday.com/articles/142595.php", "passage_text": "Lymphocytic and Myelogenous. Leukemias are also subdivided into the type of affected blood cell. If the cancerous transformation occurs in the type of marrow that makes lymphocytes, the disease is called lymphocytic leukemia. A lymphocyte is a kind of white blood cell inside your vertebrae immune system. People sometimes confuse leukemia and lymphoma. Leukemia is a cancer of the blood, lymphoma is cancer of the lymphatic system (lymph glands). The word Leukemia comes from the Greek leukos which means white and aima which means blood. The DNA of immature blood cells, mainly white cells, becomes damaged in some way."}, {"url": "https://en.wikipedia.org/wiki/Leukemia", "passage_text": "In 2012, leukemia developed in 352,000 people globally and caused 265,000 deaths. It is the most common type of cancer in children, with three quarters of leukemia cases in children being ALL. However, about 90% of all leukemias are diagnosed in adults, with AML and CLL being most common in adults. The exact cause of leukemia is unknown. Different kinds of leukemia are believed to have different causes. Both inherited and environmental (non-inherited) factors are believed to be involved. Risk factors include smoking, ionizing radiation, some chemicals (such as benzene), prior chemotherapy, and Down syndrome."}, {"url": "http://www.mayoclinic.org/diseases-conditions/leukemia/basics/causes/CON-20024914", "passage_text": "The second type of classification is by type of white blood cell affected: 1  Lymphocytic leukemia. 2  This type of leukemia affects the lymphoid cells (lymphocytes), which form lymphoid or lymphatic tissue. 3  Lymphatic tissue makes up your immune system. 1 This is the most common type of leukemia in young children. 2  ALL can also occur in adults. 3  Acute myelogenous leukemia (AML). 4  AML is a common type of leukemia. 5  It occurs in children and adults. 6  AML is the most common type of acute leukemia in adults. 7  Chronic lymphocytic leukemia (CLL)."}, {"url": "http://www.mayoclinic.org/diseases-conditions/leukemia/basics/causes/CON-20024914", "passage_text": "Doctors classify leukemia based on its speed of progression and the type of cells involved. The first type of classification is by how fast the leukemia progresses: 1  Acute leukemia. 2  In acute leukemia, the abnormal blood cells are immature blood cells (blasts). 1 This is the most common type of leukemia in young children. 2  ALL can also occur in adults. 3  Acute myelogenous leukemia (AML). 4  AML is a common type of leukemia. 5  It occurs in children and adults. 6  AML is the most common type of acute leukemia in adults. 7  Chronic lymphocytic leukemia (CLL)."}, {"url": "http://www.medicalnewstoday.com/articles/142595.php", "passage_text": "Leukemia (British spelling: leukaemia) is cancer of the blood or bone marrow (which produces blood cells). A person who has leukemia suffers from an abnormal production of blood cells, generally leukocytes (white blood cells). People sometimes confuse leukemia and lymphoma. Leukemia is a cancer of the blood, lymphoma is cancer of the lymphatic system (lymph glands). The word Leukemia comes from the Greek leukos which means white and aima which means blood. The DNA of immature blood cells, mainly white cells, becomes damaged in some way."}, {"url": "http://www.cancer.gov/types/leukemia", "passage_text": "Chemotherapy is often used to treat leukemia. Leukemia is cancer of the blood cells. Most blood cells form in the bone marrow. In leukemia, cancerous blood cells form and crowd out the healthy blood cells in the bone marrow.The type of leukemia depends on the type of blood cell that has become cancerous. For example, acute lymphoblastic leukemia is a cancer of the lymphoblasts (white blood cells that fight infection). "}, {"url": "http://www.medicinenet.com/leukemia/page2.htm", "passage_text": "Leukemia is a malignancy (cancer) of blood cells. In leukemia, abnormal blood cells are produced in the bone marrow. Usually, leukemia involves the production of abnormal white blood cells -- the cells responsible for fighting infection. 1 Acute lymphocytic leukemia (ALL, also known as acute lymphoblastic leukemia) is the most common type of leukemia in children, but it can also affect adults. 2  In this type of leukemia, immature lymphoid cells grow rapidly in the blood."}]