[{"url": "http://www.medicinenet.com/keratitis/article.htm", "passage_text": "Keratitis is the medical term for inflammation of the cornea. The cornea is the dome-shaped window in the front of the eye. When looking at a person's eye, one can see the iris and pupil through the normally clear cornea. Keratitis facts. 1  Keratitis is the medical term for inflammation of the cornea. 2  Keratitis has many causes, including infection, dry eyes, physical and chemical injury, and underlying medical diseases. 3  The diagnosis of keratitis can be confirmed by the use of a slit lamp."}, {"url": "http://www.mersi.com/services/what-we-treat/keratitis", "passage_text": "Keratitis is inflammation of the cornea, the clear window of the front of the eye. The cornea is an incredibly unique tissue in the body, in that it is perfectly transparent, and allows light to pass through to help us see. Decreased vision, often described as blurry or hazy, is a frequent complaint of patients with keratitis. When inflammation affects the front surface of the cornea, it is usually associated with tremendous sharp pain and light sensitivity, sometimes along with redness and tearing."}, {"url": "http://www.medicinenet.com/keratitis/article.htm", "passage_text": "1 Keratitis has many causes, including infection, dry eyes, physical and chemical injury, and underlying medical diseases. 2  The diagnosis of keratitis can be confirmed by the use of a slit lamp. 3  If keratitis is treated correctly and promptly, permanent damage to the eye can usually be avoided. Keratitis facts. 1  Keratitis is the medical term for inflammation of the cornea. 2  Keratitis has many causes, including infection, dry eyes, physical and chemical injury, and underlying medical diseases. 3  The diagnosis of keratitis can be confirmed by the use of a slit lamp."}, {"url": "http://www.mayoclinic.org/diseases-conditions/keratitis/basics/causes/CON-20035288", "passage_text": "1 If an object scratches the surface of one of your corneas or penetrates a cornea, keratitis without an infection may result. 2  In addition, an injury may allow bacteria or fungi to gain access to the cornea through the damaged surface, causing infectious keratitis. 3  Contaminated contact lenses. Causes of keratitis include: 1  Injury. 2  Contaminated contact lenses. 3  Viruses."}, {"url": "https://en.wikipedia.org/wiki/Keratitis", "passage_text": "Keratitis is a condition in which the eye 's cornea, the front part of the eye, becomes inflamed. The condition is often marked by moderate to intense pain and usually involves any of the following symptoms: pain, impaired eyesight, photophobia, red eye and a 'gritty' sensation. 1 Bacterial keratitis. 2  Bacterial infection of the cornea can follow from an injury or from wearing contact lenses. 3  The bacteria involved are Staphylococcus aureus and for contact lens wearers, Pseudomonas aeruginosa. 4  Pseudomonas aeruginosa contains enzymes that can digest the cornea."}, {"url": "http://www.mersi.com/services/what-we-treat/keratitis", "passage_text": "Aside from herpes, bacterial and fungal infections can cause severe keratitis requiring aggressive treatment and sometimes surgery. Diseases which affect the eyelids, such as thyroid disease or rosacea, can lead to a compromised corneal surface, and secondary infection. Decreased vision, often described as blurry or hazy, is a frequent complaint of patients with keratitis. When inflammation affects the front surface of the cornea, it is usually associated with tremendous sharp pain and light sensitivity, sometimes along with redness and tearing."}, {"url": "http://www.hopkinsmedicine.org/wilmer/conditions/keratitis.html", "passage_text": "Keratitis (Corneal Ulcers). Keratitis is an inflammation or irritation of the cornea (the transparent membrane covering the iris and pupil) characterized by typical symptoms of red eye, foreign body sensation, pain, sensitivity to light, watery eyes, and blurred vision. There are various types of keratitis, but most commonly it occurs after an injury to the cornea, dryness or inflammation of the ocular surface or contact lens wear."}, {"url": "http://www.mayoclinic.org/diseases-conditions/keratitis/basics/causes/CON-20035288", "passage_text": "Causes. Causes of keratitis include: 1  Injury. 2  If an object scratches the surface of one of your corneas or penetrates a cornea, keratitis without an infection may result. 3  In addition, an injury may allow bacteria or fungi to gain access to the cornea through the damaged surface, causing infectious keratitis. Causes of keratitis include: 1  Injury. 2  Contaminated contact lenses. 3  Viruses."}, {"url": "http://www.medicinenet.com/keratitis/article.htm", "passage_text": "Keratitis, the eye condition in which the cornea becomes inflamed, has many potential causes. Various types of infections, dry eyes, injury, and a large variety of underlying medical diseases may all lead to keratitis. Some cases of keratitis result from unknown factors. Keratitis facts. 1  Keratitis is the medical term for inflammation of the cornea. 2  Keratitis has many causes, including infection, dry eyes, physical and chemical injury, and underlying medical diseases. 3  The diagnosis of keratitis can be confirmed by the use of a slit lamp."}]