[{"url": "http://www.fallowdeerreserve.org/faq/", "passage_text": "Fallow deer come from the Mediterranean area of Europe and the Middle East (Iran and Iraq). They were taken to Europe and parts of North and South America, Southern Africa and Australia, New Zealand mainly as farm or park animals. The parents of these deer came from British Columbia in 1997. In the wild, fallow deer bucks live in herds most of the year. They like each other’s company. Although they graze all day, they eat most actively at dawn and dusk. In the middle of the day, they rest and chew their cuds."}, {"url": "https://en.wikipedia.org/wiki/Sika_deer", "passage_text": "The sika deer is a member of the genus Cervus, a group of deer also known as the true deer. Formerly, sika were grouped together in this genus with nine other species. Sika deer are found in the temperate and subtropical forests of eastern Asia, preferring areas with dense understory, and where snowfall does not exceed 10–20 cm (3.9–7.9 in). They tend to forage in patchy clearings of forests."}, {"url": "http://www.forestry.gov.uk/forestry/Fallowdeer", "passage_text": "Fallow deer are herbivores and graze all types of ground vegetation. They also browse shrub layers in a wood, and the growing shoots and leaves of holly and beech trees. Fallow deer can be found in most counties in England and Wales, and there are large populations in pockets spread across Scotland. The species was introduced by the Normans and quickly became established in the wild in hunting forests and chas"}, {"url": "http://www.answers.com/Q/Where_do_fallow_deer_live", "passage_text": "Making the world better, one answer at a time. Fallow deer live all over the world but the strongholds are all over europe, new zealand, a bit in australia and also in north and south america all though not so much there. it is native to europe. Many deer live in meadows, grasslands, and forests, but may also be  found in mountainous regions. As human habitation enters these  wilderness areas, deer are being found i … n suburban woods and  parklands."}, {"url": "http://tracker.cci.fsu.edu/deer/about/where/", "passage_text": "White tailed deer are native to 17 different countries, ranging from Canada, throughout the United States and Mexico, down to the South American country of Peru. This species has also been introduced in the Czech Republic, Finland, New Zealand, and Slovakia. Deer will often graze in open areas, but they prefer to dwell in the forests at night and during the winter, for protection and shelter from the weather. Many white tailed deer are beginning to inhabit areas where there is more human interaction due to agricultural practices."}, {"url": "https://en.wikipedia.org/wiki/Fallow_Deer", "passage_text": "It often includes the rarer Persian fallow deer as a subspecies (D. d. mesopotamica), while others treat it as an entirely different species (D. mesopotamica). Agile and fast in case of danger, fallow deer can run up to a maximum speed of 30 mph (48 km/h) over short distances (being naturally less muscular than other cervids such as roe deer, they are not as fast). Fallow deer can also make jumps up to 1.75 metres high and up to 5 metres in length."}, {"url": "https://en.wikipedia.org/wiki/Deer", "passage_text": "Deer live in a variety of biomes, ranging from tundra to the tropical rainforest. While often associated with forests, many deer are ecotone species that live in transitional areas between forests and thickets (for cover) and prairie and savanna (open space). "}, {"url": "http://www.forestry.gov.uk/forestry/Fallowdeer", "passage_text": "Habitat. Fallow deer live in isolated groups in the forest. They range over large areas and spend only a short time in one area. But they can cause a great deal of damage by feeding on buds and leaves, and they will also strip bark from trees. Fallow deer can be found in most counties in England and Wales, and there are large populations in pockets spread across Scotland. The species was introduced by the Normans and quickly became established in the wild in hunting forests and chas"}]