[{"url": "http://one.wikia.com/wiki/Hemispheric_Syndromes", "passage_text": "Introduction Edit. Hemispheric syndrome is otherwise known as anterior circulation syndrome. It is the result of a large vessel stroke, and occurs when there is proximal occlusion of the int carotid artery, middle and/or anterior cerebral arteries supplying the cerebral hemispheres."}, {"url": "http://www.scholarpedia.org/article/Hemineglect", "passage_text": "Figure 1: Drawing of a clock by a patient with left-sided neglect. Hemineglect, also known as unilateral neglect, hemispatial neglect or spatial neglect, is a common and disabling condition following brain damage in which patients fail to be aware of items to one side of space."}, {"url": "http://www.ncbi.nlm.nih.gov/pubmed/19590378", "passage_text": "BACKGROUND: Hemineglect is a difficult neurologic condition to rehabilitate. It arises predominantly from right brain injury, and manifests heterogeneously in clinical deficits such as poor visual exploration to the left, inaccurate assessment of the midpoint of a line, left limb hypokinesis, and anosognosia."}, {"url": "http://www.brainline.org/content/2012/09/the-bizarre-disorder-of-hemineglect.html", "passage_text": "More than 100 years after it was first described, hemineglect—also known as unilateral spatial neglect, or unilateral inattention—is still one of the most fascinating and mysterious of the neuropsychological disorders. I have assessed many patients with this strange disorder and I am still amazed by their behaviors."}, {"url": "http://www.youtube.com/watch?v=d4FhZs-m7hA", "passage_text": "Patients could get hemispatial neglect syndrome after a stroke. Two patients explain the disruption to their everyday lives due to this syndrome. For more information about Stroke-got to http://www.strokefoundation.com."}, {"url": "http://cercor.oxfordjournals.org/content/17/11/2479.full", "passage_text": "Unilateral spatial neglect is a disabling neurological condition that typically results from right hemisphere damage. Neglect patients are unable to take into account information coming from the left side of space."}, {"url": "http://one.wikia.com/wiki/Hemispheric_Syndromes", "passage_text": "The left hemispheric syndrome is thus a stroke syndrome that results from the occlusion of the left ICA, ACA or MCA, and the right hemispheric syndrome results from the occlusion of the right ICA, ACA or MCA."}]