[{"url": "https://www.caring.com/local/nursing-homes", "passage_text": "If your loved one needs short-term, acute care in a skilled nursing facility, Medicare will cover the first 20 days of skilled nursing care in a Medicare-approved facility and up to 80 additional days after a daily coinsurance fee that's adjusted annually."}, {"url": "http://www.webmd.com/health-insurance/nursing-home-care", "passage_text": "Payment for nursing home care can be made through Medicare, Medicaid, private insurance, and personal funds. When evaluating nursing homes, it's important to ask the administrative staff what payment options they accept. Here's a brief summary of some of the financing options."}, {"url": "http://www.nursingworld.org/EspeciallyForYou/What-is-Nursing/Tools-You-Need/Thenursingprocess.html", "passage_text": "Nursing care is implemented according to the care plan, so continuity of care for the patient during hospitalization and in preparation for discharge needs to be assured."}, {"url": "http://www.aplaceformom.com/senior-care-resources/articles/nursing-home-checklist", "passage_text": "1 A doctor needs to confirm that a patient needs to enter a nursing home for care. 2  This order is similar to writing out a prescription. 3  Physician's Order for Medications and Treatment. 4  Your loved one will have a new physician and caregivers at the nursing home."}, {"url": "http://www.rncentral.com/nursing-library/careplans/", "passage_text": "1 The care plan is a means of communicating and organizing the actions of a constantly changing nursing staff. 2  As the patient’s needs are attended to, the updated plan is passed on to the nursing staff at shift change and during nursing rounds. 3  Care plans help teach documentation."}, {"url": "http://www.webmd.com/health-insurance/nursing-home-care", "passage_text": "Long-term care refers to a comprehensive range of medical, personal, and social services coordinated to meet the physical, social, and emotional needs of people who are chronically ill or disabled. A nursing home facility may be the best choice for people who require 24-hour medical care and supervision."}, {"url": "https://www.medicare.gov/nursinghomecompare/Resources/Nursing-Home-Alternatives.html", "passage_text": "Respite care. Some nursing homes and hospice care facilities may provide respite care. Respite care is a very short inpatient stay given to a hospice patient so that the usual caregiver can rest. Medicare covers respite care for up to 5 days if you're getting covered hospice care."}, {"url": "http://www.nmh.org/nm/quality-nursing-care", "passage_text": "Nurses are an important part of each patient’s care, They provide continuous care to patients: assessing the patient, answering questions, giving medications and treatments, and assisting with medical procedures."}, {"url": "https://www.medicare.gov/nursinghomecompare/Resources/Nursing-Home-Alternatives.html", "passage_text": "If you think you need home care, talk to your family to see if they can help with your care or help arrange for other care providers. There are also some home health care agencies that can help with nursing or attendant care in your home."}]