[{"url": "http://www.worldofchemicals.com/wochem/pub/chemcyclohexanol.html", "passage_text": "Cyclohexanol is an organic compound. The molecule is related to cyclohexane ring by replacement of one hydrogen atom by a hydroxyl group. It is an important feedstock in the polymer industry, firstly as a precursor to Nylons, but also to various plasticizers."}, {"url": "http://www.chemicalbook.com/ChemicalProductProperty_EN_CB7852772.htm", "passage_text": "Cyclohexanol is an alcohol. Flammable and/or toxic gases are generated by the combination of alcohols with alkali metals, nitrides, and strong reducing agents. They react with oxoacids and carboxylic acids to form esters plus water. Oxidizing agents convert them to aldehydes or ketones."}, {"url": "http://www.studymode.com/essays/Dehydrating-Cyclohexanol-1504532.html", "passage_text": "The reason behind this is because the cyclohexene is highly flammable, so as to remove any unnecessary risk we used a heating pad. We then created our cyclohexanol mixture of cylcohexanol (6mL), sulfuric acid (10 drops), phosphoric acid (8 mL), and a boiling cheap which we then used on our apparatus."}, {"url": "http://www.chem.umass.edu/~samal/269/cyclohexene.pdf", "passage_text": "The acid used in this experiment is 85% phosphoric acid and the alcohol is cyclohexanol. The phosphoric acid is a catalyst and as such increases the rate of reaction but does not affect the overall stoichiometry. It can be seen from the balanced reaction that 1 mole of alcohol produces 1 mole of alkene."}, {"url": "http://www.studymode.com/essays/Dehydrating-Cyclohexanol-1504532.html", "passage_text": "Second, dehydrating the cyclohexanol using phosphoric acid and sulfuric acid as acid catalysts and heat to create a charged carbocation which then creates the carbon-carbon pi bond of cyclohexene from the release of a proton that is adjacent to the positively charged carbon."}, {"url": "http://www.chemicalbook.com/ChemicalProductProperty_EN_CB7852772.htm", "passage_text": "Less dense than water and slightly soluble in water. Reactivity Profile. Cyclohexanol is an alcohol. Flammable and/or toxic gases are generated by the combination of alcohols with alkali metals, nitrides, and strong reducing agents. They react with oxoacids and carboxylic acids to form esters plus water. Oxidizing agents convert them to aldehydes or ketones."}, {"url": "http://www.studymode.com/essays/Dehydrating-Cyclohexanol-1504532.html", "passage_text": "The purpose of the lab experiment is to prepare cyclohexene from cyclohexanol through an acid-catalyzed dehydration. In order to produce the cyclohexene from cyclohexanol, an elimination reaction was performed."}]