[{"url": "http://www.mayoclinic.org/healthy-lifestyle/nutrition-and-healthy-eating/in-depth/fat/art-20045550", "passage_text": "1 Monounsaturated fat. 2  This is a type of fat found in a variety of foods and oils. 3  Studies show that eating foods rich in monounsaturated fats (MUFAs) improves blood cholesterol levels, which can decrease your risk of heart disease. Some fats are found in foods from plants and animals and are known as dietary fat. Dietary fat is a macronutrient that provides energy for your body. Fat is essential to your health because it supports a number of your body's functions. Some vitamins, for instance, must have fat to dissolve and nourish"}, {"url": "http://bodyecology.com/articles/6_benefits_monosaturated_fats.php", "passage_text": "Monounsaturated fats (MUFAs) are good fats. Liquid at room temperature, they turn solid when they are chilled. Common sources of MUFAs are olive oil, avocadoes and nuts. Monounsaturated fats are a healthy alternative to the trans fats and refined polyunsaturated fats you find in most processed foods. Research shows that diets with healthy amounts of monounsaturated fats have a host of amazing health benefits, including: 1. 1  Decreased risk for breast cancer"}, {"url": "https://en.wikipedia.org/wiki/Monounsaturated_fat", "passage_text": "In biochemistry and nutrition, monounsaturated fatty acids (MUFAs, or more plainly monounsaturated fats) are fatty acids that have one double bond in the fatty acid chain with all of the remainder carbon atoms being single-bonded. Fatty acid viscosity (thickness) and melting temperature increases with decreasing number of double bonds; therefore, monounsaturated fatty acids have a higher melting point than polyunsaturated fatty acids (more double bonds) and a lower melting point than saturated fatty acids (no double bonds)."}, {"url": "https://en.wikipedia.org/wiki/Monounsaturated_fat", "passage_text": "Monounsaturated fats are found in natural foods such as red meat, whole milk products, nuts and high fat fruits such as olives and avocados. Olive oil is about 75% monounsaturated fat. The high oleic variety sunflower oil contains as much as 85% monounsaturated fat. Fatty acid viscosity (thickness) and melting temperature increases with decreasing number of double bonds; therefore, monounsaturated fatty acids have a higher melting point than polyunsaturated fatty acids (more double bonds) and a lower melting point than saturated fatty acids (no double bonds)."}, {"url": "http://www.health.harvard.edu/staying-healthy/the-truth-about-fats-bad-and-good", "passage_text": "This structure keeps monounsaturated fats liquid at room temperature. Good sources of monounsaturated fats are olive oil, peanut oil, canola oil, avocados, and most nuts, as well as high-oleic safflower and sunflower oils. The discovery that monounsaturated fat could be healthful came from the Seven Countries Study during the 1960s. Monounsaturated fats. When you dip your bread in olive oil at an Italian restaurant, you're getting mostly monounsaturated fat. Monounsaturated fats have a single carbon-to-carbon double bond. The result is that it has two fewer hydrogen atoms than a saturated fat and a bend at the"}, {"url": "http://www.mayoclinic.org/healthy-lifestyle/nutrition-and-healthy-eating/expert-answers/mufas/faq-20057775", "passage_text": "Monounsaturated fatty acids (MUFAs) are a healthy type of fat. Replacing less healthy fats, such as saturated fats and trans fats, with unsaturated fats, such as MUFAs and polyunsaturated fats, may offer health benefits. "}, {"url": "http://extension.illinois.edu/diabetes2/subsection.cfm?SubSectionID=46", "passage_text": "1 Canola, olive, and peanut oils, and avocados are sources of monounsaturated fat. 2  Both types of unsaturated fats may help lower your blood cholesterol level when used in place of saturated fat in your diet. 3  Remember to be moderate in your intake of all types of fat. 1 By substituting monounsaturated fat in your diet for saturated and polyunsaturated fats you may be able to keep HDL cholesterol levels high and LDL cholesterol levels low. 2  Overall the highest intake of fat should be from the monounsaturated type (12 – 20 percent of total calories)."}, {"url": "http://www.fitday.com/fitness-articles/nutrition/fats/five-foods-that-contain-monounsaturated-fat.html", "passage_text": "Avocados. Avocados are high in monounsaturated fat, and can be a real asset to a healthy diet. You can use it in place of mayonnaise on sandwiches which not only makes a healthier meal, but it makes for a lower fat meal as well. You can also use them on salads, in pasta, or on crackers as a snack."}, {"url": "http://extension.illinois.edu/diabetes2/subsection.cfm?SubSectionID=46", "passage_text": "Polyunsaturated and monounsaturated fat are both unsaturated fats. “Poly” means many unsaturated chemical bonds and “mono” means one unsaturated chemical bond. These unsaturated fats are often found in liquid vegetable oils. 1 By substituting monounsaturated fat in your diet for saturated and polyunsaturated fats you may be able to keep HDL cholesterol levels high and LDL cholesterol levels low. 2  Overall the highest intake of fat should be from the monounsaturated type (12 – 20 percent of total calories)."}, {"url": "http://extension.illinois.edu/diabetes2/subsection.cfm?SubSectionID=46", "passage_text": "1 Polyunsaturated oils are liquid at room temperature and in the refrigerator. 2  Common sources of polyunsaturated fat are safflower, sesame and sunflower seeds, corn and soybeans, many nuts and seeds, and their oils. 3  Monounsaturated oils are liquid at room temperature but start to solidify at refrigerator temperatures. 1 By substituting monounsaturated fat in your diet for saturated and polyunsaturated fats you may be able to keep HDL cholesterol levels high and LDL cholesterol levels low. 2  Overall the highest intake of fat should be from the monounsaturated type (12 – 20 percent of total calories)."}]