[{"url": "http://www.whfoods.com/genpage.php?tname=nutrient&dbid=106", "passage_text": "The term vitamin A makes it sound like there is one particular nutrient called vitamin A, but that is not true. Vitamin A is a broad group of related nutrients. Each of these nutrients provides us with health benefits, but these benefits may be quite different and they may be provided in different ways. Retinoids forms of vitamin A are provided by animal foods, including the following WHFoods: cow's milk, shrimp, eggs, salmon, halibut, cheese, yogurt, scallops, sardines, tuna, cod, and chicken."}, {"url": "http://www.globalhealingcenter.com/natural-health/vitamin-e-foods/", "passage_text": "Swiss chard is easily one of the healthiest vegetables you can eat on a daily basis. Commonly known to be high in vitamin K, vitamin A and vitamin C, Swiss chard is another food high in vitamin E. Just one cup of boiled swiss chard greens will provide you with almost 17% of your daily recommended values. Almonds. Almonds are one the best vitamin E foods. Just an ounce of almonds offers a whopping 7.4 milligrams of vitamin E. You can also get your vitamin E needs in the form of almond milk and almond oils. We would recommend eating raw almonds, if possible."}, {"url": "http://familydoctor.org/familydoctor/en/prevention-wellness/food-nutrition/healthy-food-choices/changing-your-diet-choosing-nutrient-rich-foods.html", "passage_text": "If you don’t eat a variety of nutrient-rich foods, you may not be getting all the micronutrients your body needs. In fact, Americans tend to eat foods that are high in calories and low in micronutrients. These foods often also contain added sugar, sodium (salt), saturated fat or trans fat. You can get these micronutrients through a variety of healthy foods, such as fruits, vegetables, whole grains, legumes, nuts and seeds, low-fat and fat-free dairy products, and lean meats and fish. Getting vitamins and minerals through food ensures that your body is able to absorb them properly."}, {"url": "http://www.whfoods.com/genpage.php?tname=nutrient&dbid=109", "passage_text": "Our best food sources of vitamin C have a single thing in common: they are all plant foods. Even though many—even most—animals make vitamin C in their bodies, only plants make it to the degree that they provide a rich source of the nutrient when eaten. Vitamin C can increase the absorption of iron (especially the iron found in plant foods) and may help lower the risk of dietary iron deficiency. You'll sometimes see us recommending the additional of a vitamin C-rich food to meals and recipes for this reason."}, {"url": "http://www.livestrong.com/article/276069-examples-of-foods-that-contain-vitamins/", "passage_text": "Photo Credit Ciaran Griffin/Stockbyte/Getty Images. Vitamins are substances found in the food you eat that are necessary for keeping you healthy. Your body needs 13 vitamins, including A, D, E, K, C and the B vitamins (biotin, folate, niacin, pantothenic acid, riboflavin, thiamin, vitamin B-6 and vitamin B-12). Each vitamin has a different role in making your body work properly. Eating a well-balanced diet should supply you with all the vitamins you need."}, {"url": "http://www.globalhealingcenter.com/natural-health/vitamin-e-foods/", "passage_text": "2. Select raw seeds, such as sunflower, pumpkin and sesame, are another common food with vitamin E. In fact, eating just ¼ of a cup of sunflower seeds gives you 90.5% of your recommended daily value, making them one of the best vitamin E foods you can eat daily. Almonds. Almonds are one the best vitamin E foods. Just an ounce of almonds offers a whopping 7.4 milligrams of vitamin E. You can also get your vitamin E needs in the form of almond milk and almond oils. We would recommend eating raw almonds, if possible."}, {"url": "http://www.globalhealingcenter.com/natural-health/vitamin-e-foods/", "passage_text": "Raw Seeds. Select raw seeds, such as sunflower, pumpkin and sesame, are another common food with vitamin E. In fact, eating just ¼ of a cup of sunflower seeds gives you 90.5% of your recommended daily value, making them one of the best vitamin E foods you can eat daily. Almonds. Almonds are one the best vitamin E foods. Just an ounce of almonds offers a whopping 7.4 milligrams of vitamin E. You can also get your vitamin E needs in the form of almond milk and almond oils. We would recommend eating raw almonds, if possible."}, {"url": "http://bembu.com/vitamin-a-foods", "passage_text": "One tablespoon provides 69% of the recommended daily amount of Vitamin A. It’s also an impressive source of Vitamin C, potassium, and calcium. Serving Size (1 tablespoon), 3448 IU of Vitamin A (69% DV), 20 calories. Mangoes. Mangoes are sweet, juicy fruits that have a place both in main dishes and on dessert plates. Vitamin A is a vitamin and antioxidant that’s associated with healthy eyes. A diet rich in Vitamin A can prevent nighttime blindness, eye inflammation, and dry eyes. It’s also used to treat several other health conditions."}, {"url": "http://bembu.com/vitamin-a-foods", "passage_text": "These are foods that contain vitamin A or its precursor called beta-carotene. Animal foods contain vitamin A whereas no plant food provides vitamin A but instead they have beta-carotene which is converted to vitamin A in the liver. The foods listed in this article are good sources of vitamin A or beta-carotene. Vitamin A is a vitamin and antioxidant that’s associated with healthy eyes. A diet rich in Vitamin A can prevent nighttime blindness, eye inflammation, and dry eyes. It’s also used to treat several other health conditions."}, {"url": "http://ods.od.nih.gov/factsheets/VitaminA-HealthProfessional/", "passage_text": "Two forms of vitamin A are available in the human diet: preformed vitamin A (retinol and its esterified form, retinyl ester) and provitamin A carotenoids [ 1-5 ]. Preformed vitamin A is found in foods from animal sources, including dairy products, fish, and meat (especially liver). By far the most important provitamin A carotenoid is beta-carotene; other provitamin A carotenoids are alpha-carotene and beta-cryptoxanthin. A portion of the vitamin A in some supplements is in the form of beta-carotene and the remainder is preformed vitamin A; others contain only preformed vitamin A or only beta-carotene. Supplement labels usually indicate the percentage of each form of the vitamin."}]