[{"url": "http://www.livescience.com/40311-pleistocene-epoch.html", "passage_text": "View full size image. The Pleistocene Epoch is typically defined as the time period that began about 1.8 million years ago and lasted until about 11,700 years ago. The most recent Ice Age occurred then, as glaciers covered huge parts of the planet Earth. There have been at least five documented major ice ages during the 4.6 billion years since the Earth was formed — and most likely many more before humans came on the scene about 2.3 million years ago."}, {"url": "https://answers.yahoo.com/question/index?qid=20111224135848AAKBv0s", "passage_text": "Report Abuse. An Ice Age (and there was more than one) affects the climate of the entire Earth. Ice doesn't cover the entire Earth during an Ice Age, but where it doesn't, the climate is cooler than in a non-ice-age period. There have also been times in Earth's history when the entire planet was covered in ice. These periods are known as Snowball Earth periods"}, {"url": "http://unmaskingevolution.com/11-iceages.htm", "passage_text": "Ice ages are said to have occurred every 150 million years, and last for at least 1 million years. According to the ice age theory, our current warm period will end with the beginning of another cold phase in 23,000 years time. Geologists claim that there have been 5 major ice ages. Several ice ages are evident in the geological record, the most recent ('The Ice Age') being from about 1 million years ago and lasting until about 10 000 years ago, when the ice retreated to its present polar extent. (Taken From: Webster's World Encyclopedia - 1997. Copyright Webster Publishing, and/or contributors.)."}, {"url": "https://en.wikipedia.org/wiki/Timeline_of_glaciation", "passage_text": "The Earth is currently in such an interglacial period of the Quaternary Ice Age, with the last glacial period of the Quaternary having ended approximately 11,700 years ago with the start of the Holocene epoch. Descriptions [edit]. The second ice age, and possibly most severe, is estimated to have occurred from 850 to 635 Ma (million years) ago, in the Neoproterozoic Era and it has been suggested that it produced a second  Snowball Earth  in which the earth iced over completely."}, {"url": "http://www.bbc.co.uk/science/earth/water_and_ice/ice_age", "passage_text": "There have been many ice ages during the last 2.6 million years but when people talk about the Ice Age, they are often referring to the most recent glacial period, which peaked about 21,000 years ago and ended about 11,500 years ago. "}, {"url": "https://en.wikipedia.org/wiki/Timeline_of_glaciation", "passage_text": "There have been five known ice ages in the Earth's history, with the Earth experiencing the Quaternary Ice Age during the present time. Within ice ages, there exist periods of more severe glacial conditions and more temperate referred to as glacial periods and interglacial periods, respectively. Descriptions [edit]. The second ice age, and possibly most severe, is estimated to have occurred from 850 to 635 Ma (million years) ago, in the Neoproterozoic Era and it has been suggested that it produced a second  Snowball Earth  in which the earth iced over completely."}, {"url": "https://en.wikipedia.org/wiki/Ice_age", "passage_text": "An ice age is a period of long-term reduction in the temperature of Earth 's surface and atmosphere, resulting in the presence or expansion of continental and polar ice sheets and alpine glaciers. "}, {"url": "http://www.dailymail.co.uk/sciencetech/article-2630738/How-world-looked-ice-age-The-incredible-map-reveals-just-planet-changed-14-000-years.html", "passage_text": "It is an incredible view of how the world looked during the ice age. An online mapmaker has revealed a unique map showing the world as it would have looked 14,000 years ago, when the last ice age was at its harshest. Designers worked with geologists to accurately map the massive landbridges and ice sheets that made the world a very different place. "}]