[{"url": "http://www.gardeningknowhow.com/garden-how-to/soil-fertilizers/using-potash-in-garden.htm", "passage_text": "How to Use Potash. Potash doesn’t move in soil more than an inch so it is important to till it into the root zone of plants. The average amount for potassium poor soil is ¼ to 1/3 pound of potassium chloride or potassium sulphate per 100 square feet. Excess potassium accumulates as salt, which can be damaging to roots."}, {"url": "http://www.lawncare.net/potash-fertilizer/", "passage_text": "Potash has a number of benefits that help plants grow and soil become healthy: 1  Increase disease resistance: Plants with adequate access to potassium have stronger cell walls, which makes it more difficult for disease to affect plants."}, {"url": "http://www.gardeningtipsnideas.com/2007/03/what_is_potash.html", "passage_text": "4. By definition potash is any compound that contains potassium. It can be sourced from plants such as comfrey, from ash from your fireplace or in chemical forms such as Nitrate of potash (potassium nitrate) or Sulphate of potash (potassium sulphate)."}, {"url": "http://www.lawncare.net/potash-fertilizer/", "passage_text": "If you're establishing a new lawn, potash fertilizer can be a great way to leach out coarse or sandy soil. The only way to know for sure is to do a soil test for potassium levels. If the potassium is too low, apply potash fertilizer to the turf two weeks to one month after planting. Potash fertilizer holds many benefits for the growth of plants and nurturing of soil."}, {"url": "http://www.gardeningtipsnideas.com/2007/03/what_is_potash.html", "passage_text": "Potash is an amazing element to be used in the garden as potassium is the key to helping plants produce fruit. While nitrogen (N) increases foliage and plant growth and phosphorous(P) helps root structure, potassium (K) is the chemical lacking if your plants don’t flower or fruit."}, {"url": "http://www.lawncare.net/potash-fertilizer/", "passage_text": "Potash fertilizer is one way that potassium is administered to plants. The amount of potassium or potash in a bag of fertilizer is indicated by the fertilizer analysis number printed on the side."}, {"url": "http://www.cromalinsupport.com/35908/what-does-potash-in-fertilizer-do/", "passage_text": "However when dividing or shifting large plants to larger pots you may want to use to 1/3 teaspoon of a complete African violet fertilizer for each 5-inch pot volume of soil mixture. What Does Potash In Fertilizer Do question: Tomato Leaves Yellow with Spots."}]