[{"url": "http://www.stihlusa.com/information/articles/hiring-tree-care-service/", "passage_text": "By Mark Chisholm, certified arborist. When it comes to tree care, some jobs are too big and too dangerous, or just need professional expertise to keep the tree healthy. My rule of thumb: unless you can work with both feet on terra firma, you should hire a professional tree service."}, {"url": "http://www.familytreemagazine.com/article/get-motivated-to-write", "passage_text": "No excuse. You can (a) take a writing course, (b) hire someone to write it for you, or (c) write it yourself and have someone edit it. Your family history doesn't have to be a Pulitzer Prize winner. You don't have to be the next Alex Haley or Frank McCourt. Your story is yours to write however you want."}, {"url": "http://ask.metafilter.com/193065/Can-I-hire-someone-to-do-my-genealogy-research", "passage_text": "I'm vaguely curious about my family history and know nothing beyond my grandparents (born in the 1920s). I think we're a pretty typical American immigrant family. I'd like to know more but don't want to spend hours and hours learning how to do genealogy research."}, {"url": "https://answers.yahoo.com/question/index?qid=20090315080522AAJ5kAc", "passage_text": "If you really want to hire someone, ask around at your local Family History Center (in an LDS church) or the county genealogy society. You can subscribe to Ancestry's US collection for $159 for a year."}, {"url": "https://answers.yahoo.com/question/index?qid=20090315080522AAJ5kAc", "passage_text": "I use it for my genealogy work. You can also sign up (and pay) for access to their fast files including census reports, birth and death records, etc. Be careful about hiring someone to do the work for you. Often, they have files on hand with only very basic information that they mail to you."}, {"url": "http://www.ehow.com/how_2107393_hire-genealogist.html", "passage_text": "The scope of genealogy, however, goes well beyond family trees; extending into areas of law, technology, event planning and medicine. Hiring a genealogist can be costly, so you must conduct your own research before hiring someone to do research on your behalf."}, {"url": "http://anthonyadolph.co.uk/family-tree-research/", "passage_text": "You may be enjoying researching your family tree, but are stuck. If so, you can hire me to try to overcome a particular problem. You might want to know all about your family but lack the necessary time or knowledge of the sources, or the ability to travel."}, {"url": "http://anthonyadolph.co.uk/family-tree-research/", "passage_text": "If you already have a large family tree but want to work back from the earliest ancestor, it will only really be necessary for me to know about the earliest couple of generations. You can send the details by e-mail or post them to me."}, {"url": "http://anthonyadolph.co.uk/family-tree-research/", "passage_text": "What can you do? I can trace your family history and also research the meaning of your surname; all aspects of heraldry and applications for new grants of arms; house histories; local history and missing people; conduct in-depth studies for biographies and advise you on using DNA for family history research."}]