[{"url": "http://www.merriam-webster.com/dictionary/myelin%20sheath", "passage_text": "Medical Definition of MYELIN SHEATH. : the insulating covering that surrounds an axon with multiple spiral layers of myelin, that is discontinuous at the nodes of Ranvier, and that increases the speed at which a nerve impulse can travel along an axon—called also medullary sheath. Definition of MYELIN SHEATH. : a layer of myelin surrounding the axons of some neurons —called also medullary sheath. See myelin sheath defined for kids. ADVERTISEMENT. noun."}, {"url": "http://medical-dictionary.thefreedictionary.com/nerve+sheath", "passage_text": "medullary sheath myelin sheath. myelin sheath (nerve sheath) the sheath surrounding the axon of myelinated nerve cells, consisting of concentric layers of myelin formed in the peripheral nervous system by the plasma membrane of Schwann cells, and in the central nervous system by the plasma membrane of oligodendrocytes. a tubular case or envelope. arachnoid sheath the delicate membrane between the pial sheath and the dural sheath of the optic nerve. carotid sheath a portion of the cervical fascia enclosing the carotid artery, internal jugular vein, vagus nerve, and sympathetic nerves supplying the head."}, {"url": "https://en.wikipedia.org/wiki/Malignant_peripheral_nerve_sheath_tumor", "passage_text": "A malignant peripheral nerve sheath tumor (MPNST) (also known as malignant schwannoma, neurofibrosarcoma, and neurosarcoma) is a form of cancer of the connective tissue surrounding nerves. Given its origin and behavior it is classified as a sarcoma. "}, {"url": "http://www.orthopaedicsone.com/display/PORT/Malignant+Peripheral+Nerve+Sheath+Tumor%2C+MPNST", "passage_text": "DEFINITION AND PATHOGENESIS. ( 1 Malignant peripheral nerve sheath tumor, MPNST, neurofibrosarcoma, malignant schwannoma, neurofibrosarcoma, neurogenic sarcoma). 2  Malignant nerve sheath tumor of Schwann or perineural cells or fibroblasts of the nerve sheath. 3  Criteria for dx: 4  Tumor arrises from a peripheral nerve, OR. 1 ("}, {"url": "http://www.mayoclinic.org/diseases-conditions/malignant-peripheral-nerve-sheath-tumors/basics/definition/CON-20035841", "passage_text": "Appointments & care. At Mayo Clinic, we take the time to listen, to find answers and to provide you the best care. Malignant peripheral nerve sheath tumors are a type of cancer that occurs in the protective lining of the nerves that extend from the spinal cord into the body. Malignant peripheral nerve sheath tumors are also called neurofibrosarcomas. Malignant peripheral nerve sheath tumors occur more frequently in people with an inherited condition that causes nerve tumors (neurofibromatosis) and in people who have undergone radiation therapy for cancer."}, {"url": "http://medical-dictionary.thefreedictionary.com/nerve+sheath", "passage_text": "sheath. a tubular case or envelope. arachnoid sheath the delicate membrane between the pial sheath and the dural sheath of the optic nerve. carotid sheath a portion of the cervical fascia enclosing the carotid artery, internal jugular vein, vagus nerve, and sympathetic nerves supplying the head. connective tissue sheath of Key and Retzius endoneurium"}, {"url": "http://medical-dictionary.thefreedictionary.com/myelin+sheath", "passage_text": "myelin sheath. n. The insulating envelope of myelin that surrounds the core of a nerve fiber or axon and that facilitates the transmission of nerve impulses, formed from the cell membrane of the Schwann cell in the peripheral nervous system and from oligodendroglia cells. Also called medullary sheath. medullary sheath myelin sheath. myelin sheath (nerve sheath) the sheath surrounding the axon of myelinated nerve cells, consisting of concentric layers of myelin formed in the peripheral nervous system by the plasma membrane of Schwann cells, and in the central nervous system by the plasma membrane of oligodendrocytes."}, {"url": "https://en.wikipedia.org/wiki/Myelin", "passage_text": "Myelin is a fatty white substance that surrounds the axon dielectric (electrically insulating) material that forms a layer, the myelin sheath, usually around only the axon of a neuron. It is essential for the proper functioning of the nervous system. It is an outgrowth of a type of glial cell. "}]