[{"url": "http://www.rightdiagnosis.com/d/decreased_intestinal_motility/intro.htm", "passage_text": "Disease Topics Related To Decreased intestinal motility. Research the causes of these diseases that are similar to, or related to, Decreased intestinal motility: 1  Diabetes. 2  Hirschsprung disease. 3  Adhesions. 4  Colonic stricture. 5  Neoplasma. 6  Colonic volvulus. 7  Superior mesenteric artery occlusion. Read about other experiences, ask a question about Decreased intestinal motility, or answer someone else's question, on our message boards: 1  I can not get a diagnosis. 2  Tell us your medical story. 3  Share your misdiagnosis story. 4  What is the best treatment for this? 5  See all the forums."}, {"url": "http://emedicine.medscape.com/article/179937-overview", "passage_text": "Coordinated movements of the stomach and intestines are required to digest and propel intestinal contents along the digestive tract. The complex patterns of contraction and relaxation necessary for proper motility of the gastrointestinal (GI) tract are generated in the nerves and muscles within the GI walls. Causes of intestinal motility disorders seem to be multifactorial, and only a few have been detected. Degenerative disorders cause pseudo-obstruction along with other problems; however, in patients with pseudo-obstruction, only changes in the nervous and muscular systems have been observed."}, {"url": "http://www.rightdiagnosis.com/sym/decreased_gastrointestinal_motility.htm", "passage_text": "Decreased gastrointestinal motility: Introduction. Decreased gastrointestinal motility: Decreased gastrointestinal motility is a lowered functioning of the gastrointestinal tract in which food is not digested and moved normally through the gastrointestinal tract. Some of the comorbid or associated medical symptoms for Decreased gastrointestinal motility may include these symptoms: 1  Nerve symptoms. 2  Sensory symptoms. 3  Abdominal symptoms. 4  Body symptoms. 5  Digestive symptoms. 6  Esophagus symptoms. 7  Muscl"}, {"url": "http://medical-dictionary.thefreedictionary.com/intestinal+motility", "passage_text": "Motility is spontaneous movement. One example is the automatic stomach contractions that move the food content along from the stomach into the intestines. A motility disease is one that involves changes in the way the stomach contracts. synchronized contractions and motility of the abomasal wall and the opening of the pyloric sphincter are dependent on the fullness of the abomasum, the degree of trituration and the pH of the contents and the integrity of the vagal and sympathetic nerve supplies. intestinal motility."}, {"url": "http://phelpshospital.org/clinical-services/gastrointestinal-motility/", "passage_text": "Overview. Gastrointestinal (GI) motililty refers to the movement of food from the mouth through the throat, esophagus, stomach, small and large intestines and out of the body. The contraction of muscles in the intestinal tract propels food forward or aids in digestion by increasing the mixing of food. "}, {"url": "http://emedicine.medscape.com/article/179937-overview", "passage_text": "Knowles and Martin attempted to define a novel classification for intestinal motility disorders, in which these conditions are categorized as well-defined entities, entities with a variable dysfunction-symptom relation, questionable entities, and entities associated with behavioral disorders. Causes of intestinal motility disorders seem to be multifactorial, and only a few have been detected. Degenerative disorders cause pseudo-obstruction along with other problems; however, in patients with pseudo-obstruction, only changes in the nervous and muscular systems have been observed."}, {"url": "http://emedicine.medscape.com/article/179937-overview", "passage_text": "Background. The phrase intestinal motility disorders applies to abnormal intestinal contractions, such as spasms and intestinal paralysis. This phrase is used to describe a variety of disorders in which the gut has lost its ability to coordinate muscular activity because of endogenous or exogenous causes. Causes of intestinal motility disorders seem to be multifactorial, and only a few have been detected. Degenerative disorders cause pseudo-obstruction along with other problems; however, in patients with pseudo-obstruction, only changes in the nervous and muscular systems have been observed."}, {"url": "http://emedicine.medscape.com/article/179937-overview", "passage_text": "Etiology. Causes of intestinal motility disorders seem to be multifactorial, and only a few have been detected. Degenerative disorders cause pseudo-obstruction along with other problems; however, in patients with pseudo-obstruction, only changes in the nervous and muscular systems have been observed."}, {"url": "https://en.wikipedia.org/wiki/Gastrointestinal_motility", "passage_text": "The gastrointestinal tract generates motility using smooth muscle subunits linked by gap junctions. These subunits fire spontaneously in either a tonic or a phasic fashion. Tonic contractions are those contractions that are maintained from several minutes up to hours at a time. Gastrointestinal physiology is a branch of human physiology addressing the physical function of the gastrointestinal (GI) system. The major processes occurring in the GI system are that of motility, secretion, regulation, digestion and circulation"}]