[{"url": "http://comicbook.com/blog/2014/04/11/the-walking-dead-daryl-dixon-will-never-be-in-the-comic-book-according-to-robert-kirkman/", "passage_text": "In the past, when Robert Kirkman has been asked if Norman Reedus' character Daryl Dixon from AMC's The Walking Dead TV show will ever be included in the comic books, he’s always indicated that he likes having different character unique to different mediums."}, {"url": "http://www.comicbookresources.com/?page=article&id=57434", "passage_text": "33. The question of The Walking Dead character Daryl Dixon's sexuality has been debated among the show's fanbase since August 2014, when series creator Robert Kirkman said in the letters column of The Walking Dead #130 that the character's possible homosexuality had been discussed.."}, {"url": "http://www.mtv.com/news/1719738/the-walking-dead-hit-list/", "passage_text": "It would be stunning and bold if Rick died on “Walking Dead,” and someone else, like Daryl, took over as lead — which brings us to the outlier: Daryl Dixon. Daryl hasn’t died yet in the comics, because he doesn’t exist in the comics. Norman Reedus’ character was created specifically for the show."}, {"url": "http://dailydead.com/the-walking-dead-is-daryl-dixon-joining-the-comic-book-series/", "passage_text": "Fans of The Walking Dead comic book series know that Norman Reedus' character Daryl Dixon was created specifically for the TV show. To say that Daryl has been a fan favorite is an understatement and Robert Kirkman hints that the character may be joining the comic book series."}, {"url": "http://www.comicbookresources.com/?page=article&id=54884", "passage_text": "The Walking Dead creator Robert Kirkman tackles all kinds of subjects in the comic book's letters column, and this week, he branched out into a question about the popular AMC television series based on the comic -- specifically, one of the show's most popular characters, Daryl Dixon as played by Norman Reedus."}, {"url": "http://www.comicbookresources.com/?page=article&id=54884", "passage_text": "| 60 Comments TAGS: the walking dead, the walking dead (tv), robert kirkman, daryl dixon, norman reedus Tweet Email Print Top Features From CBR EXCL. PREVIEW: Parker Industries is Targeted in Amazing Spider-Man #2 Two X-Men TV Shows in Development: Legion at FX, Hellfire at Fox. Tweet."}]