[{"url": "http://pets.webmd.com/dogs/parvo-parvovirus-dogs?page=2", "passage_text": "In this article. Generally, the first vaccine is given at 6-8 weeks of age and a booster is given at four-week intervals until the puppy is 16-20 weeks of age, and then again at one year of age. A puppy’s vaccination program is not complete before four months of age. "}, {"url": "http://vetmedicine.about.com/od/dogdiseasesconditions/a/CWParvo.htm", "passage_text": "Vaccination is the best defense against parvovirus. Your vet will recommend a course of vaccinations suitable for your dog. In puppies the first vaccine is typically given at about 6-8 weeks of age, and repeated every 4 weeks until 16-20 weeks of age, with yearly vaccines thereafter. Risk Factors. Dogs of any age can get parvo, depending on their vaccination history, but some dogs are more susceptible than others: 1  Puppies 6-20 weeks old are most susceptible (it takes some time for the vaccination series to become fully protective). 2  Unvaccinated dogs"}, {"url": "https://answers.yahoo.com/question/index?qid=20090328115203AA4JStp", "passage_text": "Best Answer: Yes older dogs can catch the virus...Please read the following...I have also included a bit about cats and the Parvo virus as well Canine Parvovirus is spread by their feces and is most common in young dogs 2 years of age and under. That's not to say older dogs are not able to contract this deadly virus. Report Abuse. Parvo afeects puppies much more frequently than adult dogs. The virus likes to grow in rapidly dividing cells in a puppy's body. The breeds that get it the most are Rottweilers (sadly), bulldogs, dobermans, and boxers. But these breeds are not alone--any breed can get parvo."}, {"url": "http://animalfoundation.com/8-tips-to-prevent-parvovirus-in-your-dog-or-puppy/", "passage_text": "Parvovirus is very difficult to kill and can live in the environment for over a year. If you suspect your house or yard has been infected, clean with a 1:32 dilution of bleach (1/2 cup bleach in a gallon of water). Limit your puppy or unvaccinated dog’s exposure to other dogs until he’s had his first two vaccinations, unless you are sure the other dogs are fully vaccinated."}, {"url": "http://www.bdscr.org/info/display?PageID=7002", "passage_text": "Dogs with the typical diarrhea that parvovirus causes shed the virus as well. It can last a long time in the environment, perhaps as long as 9 months or longer. Generally, it takes 7-10 days from the time of exposure for dogs and puppies to start showing symptoms and to test positive for parvo. "}, {"url": "http://animalfoundation.com/8-tips-to-prevent-parvovirus-in-your-dog-or-puppy/", "passage_text": "Keep your dog healthy and parvo-free with these 8 tips: Make sure your dog is properly vaccinated. Puppies should receive their first vaccines at 6-8 weeks of age; boosters should be administered at three-week intervals until the puppy is 16 weeks of age, and then again at one year of age. Previously vaccinated adult dogs need boosters every year. Limit your puppy or unvaccinated dog’s exposure to other dogs until he’s had his first two vaccinations, unless you are sure the other dogs are ful"}]