[{"url": "https://en.wikipedia.org/wiki/Liver", "passage_text": "The liver is a gland and plays a major role in metabolism with numerous functions in the human body, including regulation of glycogen storage, decomposition of red blood cells, plasma protein synthesis, hormone production, and detoxification. The liver has a wide range of functions, including detoxification of various metabolites, protein synthesis, and the production of biochemicals necessary for digestion."}, {"url": "http://www.ehow.com/facts_5347886_five-main-functions-liver.html", "passage_text": "The liver's main function is to produce substances that help the body break down fat. The liver manufactures bile that assists in the breakdown and digestion of food. Denis Raev/iStock/Getty Images. Glucose and Blood. The liver converts glucose to glycogen (sugar), the body's main source of energy. The liver, the body's largest glandular organ, weighs approximately 3 pounds. It appears on the right side of the body near the stomach, below the diaphragm."}, {"url": "http://www.ehow.com/facts_5347886_five-main-functions-liver.html", "passage_text": "Save. The liver, the body's largest glandular organ, weighs approximately 3 pounds. It appears on the right side of the body near the stomach, below the diaphragm. It has many functions that are vital to a healthy person"}, {"url": "https://www.sharecare.com/health/digestive-health/main-functions-of-liver", "passage_text": "Pink and brown and shaped like a boomerang, the liver is the second largest organ in the body (the skin always steals this glory). It's located just below the right rib cage in the upper right side of the abdomen above the pancreas and the small intestine. The liver has many functions, controlling storage and concentration of nutrients such as proteins, fats, carbohydrates, vitamins, and minerals, making proteins and clotting factors, and producing bile, a digestive compound."}, {"url": "http://www.medicinenet.com/liver_anatomy_and_function/article.htm", "passage_text": "The liver is the largest internal organ of the body and is located in the right upper quadrant of the abdomen, beneath the diaphragm and is protected by the lower right ribs. It also extends across the midline toward the left upper quadrant of the abdomen. The liver is one of the vital organs of the body, responsible for hundreds of chemical actions that the body needs to survive. It is also a gland because it secretes chemicals that are used by other parts of the body. For these reasons the liver is both an organ and a gland."}, {"url": "http://www.innerbody.com/image_digeov/card10-new2.html", "passage_text": "Weighing in at around 3 pounds, the liver is the body’s second largest organ; only the skin is larger and heavier. The liver performs many essential functions related to digestion, metabolism, immunity, and the storage of nutrients within the body. The liver functions as an organ of the immune system through the function of the Kupffer cells that line the sinusoids. Kupffer cells are a type of fixed macrophage that form part of the mononuclear phagocyte system along with macrophages in the spleen and lymph nodes."}, {"url": "http://www.webmd.com/digestive-disorders/picture-of-the-liver", "passage_text": "Front View of the Liver. The liver is a large, meaty organ that sits on the right side of the belly. Weighing about 3 pounds, the liver is reddish-brown in color and feels rubbery to the touch. Normally you can't feel the liver, because it's protected by the rib cage. The liver has two large sections, called the right and the left lobes. All rights reserved. The liver is a large, meaty organ that sits on the right side of the belly. Weighing about 3 pounds, the liver is reddish-brown in color and feels rubbery to the touch."}, {"url": "http://www.livestrong.com/article/75284-functions-liver/", "passage_text": "7 Functions of the Liver. The liver is a four-lobed, triangular-shaped organ weighing a little more than 3 pounds. It is the largest gland in the human body, according to Procto-med.com. The liver is part of the gastrointestinal system and is located in the upper abdomen to the right of the stomach. The liver carries out many functions necessary for survival, including processes of metabolism, digestion and cleansing of the blood."}, {"url": "http://www.rnceus.com/lf/lffx.html", "passage_text": "Primary functions of the liver. The liver is the largest organ in the body. It is located below the diaphragm in the right upper quadrant of the abdominal cavity. An adult's liver weighs approximately 3 pounds and extends approximately from the right 5th rib to the lower border of the rib cage."}]