[{"url": "http://www.med-health.net/Swollen-Nose.html", "passage_text": "Other symptoms that may be associated with a swollen nose are headaches, toothaches and pain in the face. The possible causes of swelling in the nose and all symptoms associated with it include local infection, sinusitis, allergic rhinitis, trauma, nasal polyps, and in children, a foreign body."}, {"url": "http://www.niaid.nih.gov/topics/sinusitis/Documents/sinusitis.pdf", "passage_text": "Acute Sinusitis Acute sinusitis usually is caused by a viral or bacterial infection. The common cold, which is caused by a virus, may lead to swelling of the sinuses, trapping air and mucus behind the narrowed sinus openings. Both the nasal and the sinus symptoms usually go away within 2 weeks."}, {"url": "http://www.webmd.com/allergies/sinusitis-and-sinus-infection", "passage_text": "Sinusitis is an inflammation, or swelling, of the tissue lining the sinuses. Normally, sinuses are filled with air, but when sinuses become blocked and filled with fluid, germs (bacteria, viruses, and fungi) can grow and cause an infection."}, {"url": "http://www.niaid.nih.gov/topics/sinusitis/Pages/cause.aspx", "passage_text": "Acute Sinusitis. Acute sinusitis is usually caused by a viral or bacterial infection. The common cold, which is caused by a virus, may lead to swelling of the sinuses, trapping air and mucus behind the narrowed sinus openings. Both the nasal and the sinus symptoms usually go away within two weeks."}, {"url": "https://www.nlm.nih.gov/medlineplus/ency/article/000647.htm", "passage_text": "1 Acute sinusitis is when symptoms are present for 4 weeks or less. 2  It is caused by bacteria growing in the sinuses. 3  Chronic sinusitis is when swelling and inflammation of the sinuses are present for longer than 3 months. 4  It may be caused by bacteria or a fungus."}, {"url": "http://www.mayoclinic.org/diseases-conditions/chronic-sinusitis/basics/definition/CON-20022039", "passage_text": "Definition. Chronic sinusitis is a common condition in which the cavities around nasal passages (sinuses) become inflamed and swollen — for at least eight weeks, despite treatment attempts. Also known as chronic rhinosinusitis, this condition interferes with drainage and causes mucus to build up."}]