[{"url": "http://www.concretenetwork.com/concrete/countertops/thickness_and_weight_of_countertops.htm", "passage_text": "Weight A 1 ½ inch thick countertop made of standard concrete has an approximate weight of 18.75 pounds per square foot. (Granite is approximately 18 pounds per square foot.) Standard cabinetry will typically support this weight because it’s distributed over a large area."}, {"url": "http://www.concrete-countertops.org/thickness.html", "passage_text": "Concrete Countertop Thicknesses. Concrete countertops are so appealing partly because of the variety of looks they can provide. A 6” thick and heavy-looking drop edge front can be achieved but does not require the entire countertop to become 6” thick. The standard slab thickness is 1.5” – 2”."}, {"url": "http://www.concrete-countertops.org/thickness.html", "passage_text": "This countertop illustrates how concrete can be used to create a 3-dimensional look. The interior of this countertop is 2-inches thick, but the exterior (the drop nose feature) is 9-inches thick. It gives the illusion that the countertop is one massive piece of concrete."}, {"url": "http://www.concretecountertopinstitute.com/blog/2013/08/lightweight-concrete-is-it-really-necessary-for-countertops/", "passage_text": "Many concrete countertop makers do not understand reinforcing, and they make their slabs too thick, 2 inches or more, to compensate for their lack of confidence in their concrete. There is no need to make precast concrete more than 1.5″ thick, if you understand how to reinforce it properly."}, {"url": "http://www.concrete-countertops.org/weight.html", "passage_text": "The weight of a concrete countertop has a lot of bearing on how it is built and how it will be installed. A standard 1.5” thick concrete countertop has an approximate weight of 18.75 pounds per square foot. In comparison, granite is approximately 18"}, {"url": "http://www.concrete-countertops.org/weight.html", "passage_text": "Concrete Countertop Weight. The weight of a concrete countertop has a lot of bearing on how it is built and how it will be installed. A standard 1.5” thick concrete countertop has an approximate weight of 18.75 pounds per square foot. In comparison, granite is approximately 18"}, {"url": "http://www.ehow.com/info_8500361_thick-countertops.html", "passage_text": "Stone tile countertops are less expensive than solid stone counters. The tile is real stone but can range from 3/8 to 1/2 inch in thickness. The tile is mortared over a cement board or membrane covered plywood adding an additional 7/8 to 1 1/8 inch. This brings the thickness of the countertop to 1 1/4 to 1 1/2 inch."}]