[{"url": "http://puppies.about.com/od/Puppy_Health/a/Sterilization-Spay-And-Neuter.htm", "passage_text": "Adult dogs can be neutered at any age, but the best time is before sexual maturity. For many years, the recommended spay/neuter age was six to nine months. When a puppy’s future involves performance competition, ask your veterinarian and breeder about timing. Delaying for a couple of months may allow the pup to attain better physical development important to these demands."}, {"url": "http://www.pet-informed-veterinary-advice-online.com/dog-spaying.html", "passage_text": "3. Information about dog spaying age: when to spay a dog. The following two subsections discuss desexing age recommendations and how they have been established as well as the pros and cons of early age (8-16 weeks) dog spaying (spaying a puppy). 3a. Current dog spaying age recommendations. "}, {"url": "http://www.sarahsdogs.com/qa/at-what-age-can-you-spay-or-neuter-a-dog/", "passage_text": "Spaying and neutering are terms used to indicate sterilization of pet animals. Spaying is the process of removing a female dog’s uterus and ovaries while neutering is performed on male dogs to remove his testicles. Experts believe and advise that neutering has to be done at a very young age (around 6 months of age) just prior to the dog reaching puberty. The longer the delay in performing the procedure, the higher the possibility of the dog experiencing health and behavioral problems as they grow older."}, {"url": "https://answers.yahoo.com/question/index?qid=20080929193328AAzLnhS", "passage_text": "Report Abuse. You should be able to get her spayed now. It is a myth that you have to wait until after their first heat cycle. Some experienced vets can spay as early as 8 weeks provided the dog is big enough weight wise. mother2two · 7 years ago. Thumbs up. "}, {"url": "http://www.petmd.com/dog/care/evr_determining_best_age_to_spay_or_neuter", "passage_text": "Why do we perform spay or castration at 6 months of age? Most veterinarians in the United States recommend bitches and dogs be spayed or castrated between 6 and 9 months of age. "}, {"url": "http://pets.webmd.com/dogs/guide/spaying-or-neutering-your-dog-faq", "passage_text": "And it’s better for you because it will make your life easier if your pet is spayed or neutered. Animals can be miserable -- and make you miserable -- when they are in heat. And then there’s always the problem of what to do with the puppies. There’s also the financial side. Just in the Atlanta area alone, more than $15 million is spent annually dealing with stray and unwanted pets. That’s your tax dollars. And for each home you find, there’s one less home for a dog that was already born. Plus, you can’t be responsible for what the new owners do. So unless you spay or neuter all the puppies before placing them, the new owners may let their dog breed as well."}, {"url": "http://dogtime.com/dog-health/general/42-spaying-your-female", "passage_text": "When it’s time to spay your dog. She can be spayed any time after eight weeks of age, and preferably before her first heat for the best health benefits. The first heat cycle occurs somewhere around six months of age, depending on the breed. Benefits. The benefits to your dog are considerable: 1  Spaying reduces risk of certain illnesses, such as pyometra (a common, life-threatening infection of the uterus) or mammary gland cancer. 2  Spaying reduces pet overpopulation. 3  Spaying saves you from dealing with males who are wildly attracted to your dog in heat. 4  You don’t have to choose between a dog in .."}, {"url": "http://pets.webmd.com/dogs/guide/spaying-or-neutering-your-dog-faq", "passage_text": "All the medical evidence suggests a dog should be spayed before her first heat. It’s much easier for her then because it’s a much easier surgery at that time. And the problem with letting your dog have a litter is you’ve just instantly contributed to the pet overpopulation problem. Now you have to find homes for all those puppies. And for each home you find, there’s one less home for a dog that was already born. Plus, you can’t be responsible for what the new owners do. So unless you spay or neuter all the puppies before placing them, the new owners may let their dog breed as well."}, {"url": "http://puppies.about.com/od/Puppy_Health/a/Sterilization-Spay-And-Neuter.htm", "passage_text": "Spay ing and neutering puppies is the responsible thing to do, and it's important to know when to neuter a puppy. When love is in the air, the dogs know it. Girl pups mature more quickly than you might think. They can become pregnant as early as five or six months of age, and most dogs can produce two litters a year. For many years, the recommended spay/neuter age was six to nine months. When a puppy’s future involves performance competition, ask your veterinarian and breeder about timing. Delaying for a couple of months may allow the pup to attain better physical development important to these demands."}]