[{"url": "http://mashable.com/2011/12/06/cost-of-twitter-follower/", "passage_text": "An email from Twitter sales to prospective advertisers today revealed what brands have been paying for followers on the platform. The memo included cost-per-follower (CPF) rates for Promoted Accounts and cost-per-engagement (CPE) for Promoted Tweets. The CPF runs between $2.50 and $4, while the listed CPE rates come in from $0.75 to $2.50. For CPE, engagement refers to clicks, favorites, retweets and @Replies.."}, {"url": "http://www.smartinsights.com/social-media-marketing/twitter-marketing/twitter-advertising-campaign-costs/", "passage_text": "Our commentary on the costs of Twitter advertising. These are the costs revealed in the leaked email from Twitter’s ad sales department: 1  Cost of $2.50 and $4 per follower. 2  $0.75 to $2.50 for each click, favourite, retweet or reply. 3  Commitment to a minimum campaign spend of 3 months and $15,000. Since Twitter introduced it’s advertising through it’s Promoted Tweets we’ve had questions from marketers about costs and whether the service would become available to advertisers with smaller budgets as is possible through Adwords, Facebook and LinkedIn."}, {"url": "http://thenextweb.com/twitter/2011/06/13/inside-twitters-ads-120000-per-day-for-promoted-trends/", "passage_text": "The actual cost of an advertising campaign on Twitter has always been somewhat shrouded in mystery with large campaigns run without direct figures revealed. Well now they have and it’s a huge $120,000 per day to run a Promote Trend on the site. Which, according to Business Insider, is up from the $30,000 per day they cost last year. $5,000 per month on advertising via a relatively new and unproven platform is too much for many small businesses. While the chief of revenue states the minimum ad spend is $15,000 over 3 months, this could change as Twitter has just announced it’s introducing a self-serve ad system by the end of the year."}, {"url": "http://www.pennapowers.com/how-much-do-ads-on-twitter-cost/", "passage_text": "Twitter offers three types of advertising options – promoted tweets, promoted accounts and promoted trends. The first two cost between $.50 – $4.00 per engagement, and promoted trends will cost you $200,000 per day. Twitter Promoted Tweets. Promoted tweets are exactly that – tweets you have already tweeted that you wish to promote. They appear in timelines and search results. The price per follower depends on your targeting, but you can expect $2.50 – $4.00 per new follower. For local campaigns we have seen it on the lower end of $2.50 per follower. Twitter Promoted Trends. If you’re looking for massive exposure in a short amount of time, promoted trends are your best friend."}, {"url": "http://fitsmallbusiness.com/how-much-does-facebook-advertising-cost/", "passage_text": "When setting up your ad campaign, you can choose which option you want. In the United States, the average click costs advertisers $0.24 and the average CPM cost $0.66. However, these numbers varied greatly from advertiser to advertiser based on a number of factors. One Factor Is Type Of Business. In today’s article we are going to discuss how much Facebook advertising will cost your business. (If you don’t know much about Facebook advertising see our full guide on the topic here). Want $50 in free advertising on Bing! – Click Here."}, {"url": "http://smallbusiness.chron.com/much-television-advertising-really-cost-58718.html", "passage_text": "Rates vary depending on the time of day and year as well as your location. If your target market is most likely to see your ad during the local news at noon, you may pay anywhere from $200 to $1,500 for a 30-second spot during that time, says Entrepreneur. Commercials that run between the prime viewing hours between 6 to 7 p.m. cost the most. National commercials produced by an advertising agency cost far more, averaging $342,000 for a 30-second spot in 2008, according to the American Association of Advertising Agencies."}, {"url": "http://smallbusiness.chron.com/much-television-advertising-really-cost-58718.html", "passage_text": "According to Entrepreneur, some independent television stations will produce your ad for free if you sign up for a minimum of three months of commercial spots. Local television stations typically charge from $200 to $1,500 to create a 30-second commercial. National commercials produced by an advertising agency cost far more, averaging $342,000 for a 30-second spot in 2008, according to the American Association of Advertising Agencies."}, {"url": "http://thenextweb.com/twitter/2011/06/13/inside-twitters-ads-120000-per-day-for-promoted-trends/", "passage_text": "At $120,000 per day for promoted tweets alone, you would have to hope that the investment worked for them. And that’s without the additional cost of running the campaign through Twitter, ads, and the screenings. $5,000 per month on advertising via a relatively new and unproven platform is too much for many small businesses. While the chief of revenue states the minimum ad spend is $15,000 over 3 months, this could change as Twitter has just announced it’s introducing a self-serve ad system by the end of the year."}]