[{"url": "http://educators.btnep.org/subsites/water/estuarywater/pollutants/diseasecausingorganisms.aspx", "passage_text": "Definition: A Disease-Causing Organism is a micro-organism that can make you sick if you eat it, inhale it, or come into contact with it (get it on your skin, or in your ears, etc). Standards for disease-causing organisms in Louisiana are based on a group of bacteria called fecal coliform bacteria. These bacteria are used for detecting the level of disease-causing organisms and untreated sewage in water. Fecal coliform bacteria come from intestines of warm-blooded animals. Disease-causing organisms get into the water from untreated sewage. When people go to the bathroom they create waste called sewage. Every home, school, and business is required by law to have some way of treating its sewage or transporting it to a sewage treatment system."}, {"url": "http://www.safewater.org/PDFS/resourcesknowthefacts/Disease_Causing_Micro_Org.pdf", "passage_text": "These “bad-news” microbes are called disease-causing microbes and can make humans, animals and plants sick by causing infection and disease. Most microbes belong to four major groups: bacteria, viruses, protozoa or fungi. (To find out more, see the “Bacteria/Viruses/Protozoa” fact sheets). "}, {"url": "http://microbiologyonline.org.uk/about-microbiology/microbes-and-the-human-body/microbes-and-disease", "passage_text": "1 A pathogen is a micro-organism that has the potential to cause disease. 2  An infection is the invasion and multiplication of pathogenic microbes in an individual or population. 3  Disease is when the infection causes damage to the individual’s vital functions or systems. Microbes and disease. A few harmful microbes, for example less than 1 % of bacteria, can invade our body (the host) and make us ill. Microbes cause infectious diseases such as flu and measles."}, {"url": "https://en.wikipedia.org/wiki/Infectious_disease", "passage_text": "Infection is the invasion of an organism's body tissues by disease-causing agents, their multiplication, and the reaction of host tissues to these organisms and the toxins they produce. Infectious disease, also known as transmissible disease or communicable disease, is illness resulting from an infection. Infections are caused by infectious agents including viruses, viroids, prions, bacteria, nematodes such as parasitic roundworms and pinworms, arthropods such as ticks, mites, fleas, and lice, fungi such as ringworm, and other macroparasites such as tapeworms and other helminths."}, {"url": "http://regentsprep.org/Regents/biology/2011%20Web%20Pages/Human%20Body-%20Immune%20System%20and%20Disease%20page.htm", "passage_text": "Disease is a disturbance of homeostasis or steady state within an organism. Many organisms, such as viruses, bacteria, fungi, and parasites may cause disease. Disease also results from factors which are not living organisms. The immune response is the defensive reaction of the body to foreign substances or organisms. Living organisms which cause disease are known as pathogens. Some viruses, bacteria, fungi, and parasites are examples of living things which are pathogens causing disease. Other factors may be involved which contribute to or cause the body to develop disease."}, {"url": "https://en.wikipedia.org/wiki/Pathogen", "passage_text": "Typically the term is used to describe an infectious agent such as a virus, bacterium, prion, fungus, viroid, or parasite that causes disease in its host. The host may be an animal, a plant, a fungus, or even another microorganism. In biology, a pathogen (Greek: πάθος pathos “suffering, passion” and -γενής -genēs “producer of”) in the oldest and broadest sense is anything that can produce disease, a term which came into use in the 1880s."}, {"url": "https://en.wikipedia.org/wiki/Pathogen", "passage_text": "Fungi comprise a eukaryotic kingdom of microbes that are usually saprophytes (consume dead organisms) but can cause diseases in humans, animals and plants. Fungi are the most common cause of diseases in crops and other plants. The typical fungal spore size is 1-40 micrometers in length. In biology, a pathogen (Greek: πάθος pathos “suffering, passion” and -γενής -genēs “producer of”) in the oldest and broadest sense is anything that can produce disease, a term which came into use in the 1880s."}, {"url": "https://answers.yahoo.com/question/index?qid=20081115104430AAsY0wb", "passage_text": "Best Answer: Answer is A-Pathogens. They can be bacteria, fungus etc etc. Your other three answers could be examples for pathogens, though without the species name you cannot identify any of those micro organisms as a disease causing organism. Archaebacteria, it can cause Lyme disease Bacilli can cause meningitis's Cocci can cause scarlet fever. But a disease causing organism is A, pathogen. B, C, D are all pathogens..... So the answer is A."}]