[{"url": "http://raywhitemackaycity.com.au/", "passage_text": "Welcome To Ray White Mackay City in the 'City Heart'! Real estate is not different from hospitality, or any other business, in that customer service involves understanding someone’s needs and providing solutions to those needs. In challenging times the strength of a strong brand like Ray White really shines through. Featured News. A new streetscape ... a new shopfront ! Ray White Mackay City #RWMackCity, has taken to upgrading it's shopfront to maximise on the rejuvenation program taking place in Mackay's City Heart /CBD."}, {"url": "http://mackay.eldersrealestate.com.au/", "passage_text": "Welcome to Elders Real Estate Mackay. Mackay is a very vibrant and exciting city which is fuelled by the sugar and mining industries and the Mackay Regional local Government area is one of the fastest growing in Queensland, with a population of 119,081 in June 2012. Mackay was settled in 1862 and named after Captain John Mackay who discovered the valley of the Pioneer river."}, {"url": "https://en.wikipedia.org/wiki/Mackay,_Queensland", "passage_text": "The Mackay campus of Central Queensland University is in the rural suburb of Ooralea, while the local campus of James Cook University is in South Mackay. The city is also home to a TAFE (technical/vocational) college, which is in the south of the inner city. On 18 February 1958, Mackay was hit with massive flooding caused by heavy rainfall upstream with 878 mm of rain falling at Finch Hatton in 24 hours. The flood peaked at 9.14 metres (29.99 ft). The water flowed down the valley and flooded Mackay within hours."}, {"url": "https://en.wikipedia.org/wiki/Mackay,_Queensland", "passage_text": "Mackay /məˈkaɪ/ is a city on the eastern coast of Queensland, Australia. It is located about 970 kilometres (603 mi) north of Brisbane, on the Pioneer River. Mackay is nicknamed the sugar capital of Australia because its region produces more than a third of Australia's cane sugar. On 18 February 1958, Mackay was hit with massive flooding caused by heavy rainfall upstream with 878 mm of rain falling at Finch Hatton in 24 hours. The flood peaked at 9.14 metres (29.99 ft). The water flowed down the valley and flooded Mackay within hours."}, {"url": "https://en.wikipedia.org/wiki/Mackay,_Queensland", "passage_text": "One of the first Europeans to travel through the Mackay region was Captain James Cook, who reached the Mackay coast on 1 June 1770 and named several local landmarks, including Cape Palmerston, Slade Point and Cape Hillsborough. On 18 February 1958, Mackay was hit with massive flooding caused by heavy rainfall upstream with 878 mm of rain falling at Finch Hatton in 24 hours. The flood peaked at 9.14 metres (29.99 ft). The water flowed down the valley and flooded Mackay within hours."}, {"url": "http://www.homesales.com.au/buy/rural-in-mackay-queensland/", "passage_text": ". Pinevale Road, Mackay, QLD 4740 0 0 0 Hazelbrook Cane & Grazing Location: Pinevale Road, Mia Mia approx 40 minutes or 65km drive to the city of Mackay. Close to Mirani, Eton & the Peak Downs Highway Area: Approx 5,726.12 acres - 4 Titles Tenure: Freehold. Freeholding of 2 GHFL. Forestry Lease. Approximately 10 km to the Bruce Highway. Approximately 30 kms to Sarina. Approximately 53 kms to Mackay. area: 29.48 HA or 73 acres Freehold water: Production Bore. 5,000 G.P.H. Licence Number 81523L."}, {"url": "https://en.wikipedia.org/wiki/City_of_Mackay", "passage_text": "Prior to 1994, Mackay consisted of the suburbs of Mackay, West Mackay, South Mackay and East Mackay —all other suburbs of Mackay were in the Shire of Pioneer 's area. After the amalgamation, it consisted of the following areas: The Local Government (Mackay and Pioneer) Regulation 1993 was gazetted on 17 December 1993, and on 30 March 1994, the two amalgamated into a larger City of Mackay, which first met on 8 April 1994."}, {"url": "http://www.mackayruralsupplies.com.au/", "passage_text": "welcome to mackay rural supplies. Mackay Rural Supplies is a locally run CRT agribusiness which has been servicing the Mackay and outer regions with all their rural needs since the 1920s. Becoming a member of the CRT group in 2001, Mackay Rural has access to a wide range of products to cater for the small block hobby farmer to the sugar cane farmer and cattle grazier."}, {"url": "http://www.trailcreekrealty.biz/", "passage_text": "We Strongly Believe... By offering outstanding real estate services we will experience a continual friendship with our patrons while ensuring Idaho is a place to visit, live and thrive. Welcome to our website! Whether you are in the market to buy or sell property, you've come to the right place. We invite you to use this site to search for your next Single Family Home, Farm, Ranch, Vacant Land, Recreational or Commercial real estate purchase."}]