[{"url": "https://answers.yahoo.com/question/index?qid=20100117102958AAYBeqG", "passage_text": "To offset the economic hardships Napoleon passed acts that gave French businesses generous trade deals with conquered territories and allies but these acts would only further infuriate French allies. The last problem that caused the failure of the continental system was the nations that openly defied the order. Portugal and Spain both openly defied Napoleon and soon a major war was raging in Iberia, this gave British industry something to focus on. Napoleon was obsessed with conquering the world. He did not spend enough money and time worrying about controlling the lands he had. Then there was the problems of language. Not everyone spoke French and the breakdown in communications hindered quick responses to problems."}, {"url": "http://www.historyhome.co.uk/c-eight/france/consys.htm", "passage_text": "However bad the Continental System was for Britain, it was disastrous for Napoleon because it backfired on him. French custom' revenue fell and European nations were starved of British colonial goods: coffee, sugar, tobacco, cocoa, and cotton textiles. The Continental System. After the death of Pitt in 1806, Britain continued to fight the French for a further nine years. Between 1807 and 1810, Napoleon made his first mistakes."}, {"url": "http://www.funnelbrain.com/c-394608-continental-system.html", "passage_text": "Continental System. Answer: The Continental System was introduce by Napoleon in 1806 in an effort to bankrupt Great Britain (a nation of shopkeepers) by destroying its trade. This system prohibited all of France or France's dependent states and allies from trading with or having any business with Great Britain. Answer: The Continental System was introduce by Napoleon in 1806 in an effort to bankrupt Great Britain (a nation of shopkeepers) by destroying its trade"}, {"url": "https://in.answers.yahoo.com/question/index?qid=20100128061808AAxBsL0", "passage_text": "Report Abuse. Continental System In the Napoleonic Wars, the blockade designed by Napoleon to paralyze Britain through the destruction of British commerce. In the Decrees of Berlin (1806) and Milan (1807), France proclaimed that neutrals and French allies were not to trade with the British. "}, {"url": "https://en.wikipedia.org/wiki/Continental_System", "passage_text": "Blue-grey: Countries forced by France into applying the Continental System. The Continental System or Continental Blockade (known in French as Blocus continental) was the foreign policy of Napoleon I of France in his struggle against Great Britain during the Napoleonic Wars. The Berlin Decree forbade the import of British goods into European countries allied with or dependent upon France, and installed the Continental System in Europe."}, {"url": "https://answers.yahoo.com/question/index?qid=20100117102958AAYBeqG", "passage_text": "Rating Newest Oldest. Best Answer: The main reason was the logistics involved in closing an entire continents ports. The continental system caused serious economic problems across Europe and nations only followed it because Napoleon's foreign policy was to invade any nation that didn't. Napoleon was obsessed with conquering the world. He did not spend enough money and time worrying about controlling the lands he had. Then there was the problems of language. Not everyone spoke French and the breakdown in communications hindered quick responses to problems."}, {"url": "https://en.wikipedia.org/wiki/Continental_System", "passage_text": "Russia also chafed under the embargo, and in 1810 reopened trade with Britain. Russia's withdrawal from the system was a motivating factor behind Napoleon's decision to invade Russia in 1812, which proved the turning point of the war. The Berlin Decree forbade the import of British goods into European countries allied with or dependent upon France, and installed the Continental System in Europe."}, {"url": "http://www.funnelbrain.com/c-394608-continental-system.html", "passage_text": "The continental system failed to destroy England's trade because Portugal was also cut off from trade with the rest of Europe, but it was right next to Spain, which was included in the continental system. So there was a lot of smuggling from England to Portugal and into Spain and other parts of Europe and vise versa. Answer: The Continental System was introduce by Napoleon in 1806 in an effort to bankrupt Great Britain (a nation of shopkeepers) by destroying its trade."}, {"url": "http://www.answers.com/Q/Why_did_Napoleon's_Continental_System_fail", "passage_text": "The Continental System was the foreign-policy cornerstone of Napoleon of France in his long struggle against Great Britain. Napoleon was a great general, and could probably ha … ve defeated the British had he managed to land an army in England. In fact, the Continental System caused more collateral damage to the nations of the Grand Empire than it did to Britain. Russia in particular chafed under the embargo, and in 1812, that country reopened trade with Britain."}]