[{"url": "http://www.ask.com/beauty-fashion/convert-men-s-women-s-pant-sizes-12644e0f9573af61", "passage_text": "A: A simple method to convert men's pants sizes to women's sizes involves subtracting 21 inches from the men's pants waist measurement. This means a size 34-inch men's pants equals a women's size 13. Know More."}, {"url": "http://www.ehow.com/how_5174361_convert-mens-clothing-sizes-womens.html", "passage_text": "Subtract 21 inches from the waist measurement of pants to convert it into the women's pant size. The inseam measurement, usually the second measurement on a men's pant size, should remain the same, regardless of gender. For example, if you normally wear a 31 waist, you would wear a size 10 in women's pants."}, {"url": "http://traveltips.usatoday.com/convert-european-pants-sizes-63140.html", "passage_text": "Subtract the number 16 from the size number on European pants or trousers for men. The resulting number equals the equivalent size in American pant sizes. For example, a size 52 in men's pants in Europe equals a size 36 in American sizes. Step 3. Subtract 28 from the size number on European pants and trousers for women. The resulting number equals the equivalent size in American pant sizes. For example, a size 42 in women's pants in Europe equals a size 14"}, {"url": "http://www.ask.com/beauty-fashion/convert-men-s-women-s-pant-sizes-12644e0f9573af61", "passage_text": "Quick Answer. A simple method to convert men's pants sizes to women's sizes involves subtracting 21 inches from the men's pants waist measurement. This means a size 34-inch men's pants equals a women's size 13. Know More."}, {"url": "http://sizeguide.net/mens-clothing-sizes-international-conversion-chart.html", "passage_text": "Use this table to convert between American, English, European, Russian, Japanese and Korean sizes for men's suits, jackets and coats. The European size covers among others Italian, French, Spanish, German, Swedish, Dutch and Portuguese clothing. The UK size is same as the Austrialian."}, {"url": "http://www.hanksclothing.com/womensconversion.html", "passage_text": "We have many women buy men's jeans in particular. It's easy to convert the women's to the comparable men's size. Add 21 to the ladies size you normally wear and that is the waist size of the men's jean or pant that will come closest to fitting you."}]