[{"url": "http://www.energy.alberta.ca/NaturalGas/Gas.asp", "passage_text": "In the 2014/15 fiscal period, Alberta received about $8.95 billion in non-renewable resource revenue accounting for 20 per cent of government revenue. In 2014/15, natural gas and by-product revenue was $989 million or approximately 11 per cent of non-renewable resource revenue and 2.2 per cent of government revenue. Approximately 48 per cent of Alberta s natural gas production is consumed here in Alberta. Alberta's residential and commercial sectors account for 17 per cent of the province's marketable natural gas consumed in Alberta for home and business heating. The remaining 83 per cent of natural gas consumed in Alberta is used by the industrial, electricity generation, transportation, and other sectors. Natural gas is also an important raw material for the province s oil sands and electric power generation industries"}, {"url": "http://www.riverdalenetzero.ca/DOCUMENTS/Understanding_our_utility_energy_bills.pdf", "passage_text": "g) Typically, homes in Edmonton use an average of 135 GJ of natural gas per year. The annual subscription fee is $320 for Direct Energy/ATCO Gas customers. At the average natural gas price in 2006 of $10.27 /GJ, this equals an annual natural gas cost of $1386 and a natural gas bill of $1706. The maximum potential savings are $1386, then, unless you go completely off the natural gas grid."}, {"url": "http://www.statcan.gc.ca/pub/11-526-s/2010001/part-partie1-eng.htm", "passage_text": "Natural gas can be used for home heating, water heating, and also to fuel other large appliances such as stoves, clothes dryers and barbecues. Total household natural gas consumption was 587,183 TJ in 2007 (Table 3-1). Households that used natural gas consumed on average 92 GJ of this fuel (Table 3-2). Half of the households in Prince Edward Island used a boiler as the main heating system (51%). Natural gas and electricity were the most common types of energy used for home heating in 2007. Almost half (47%) of Canadian households used natural gas as their main heating fuel, while 37% used electricity."}, {"url": "http://www.statcan.gc.ca/pub/11-526-s/2010001/part-partie1-eng.htm", "passage_text": "Natural gas was the principal energy source for households in Alberta, accounting for 77% of their total energy use (Table 3-1). Natural gas made up 70% of household energy use in Saskatchewan, 58% in Ontario, 52% in British Columbia, and 49% in Manitoba. It is generally unavailable to most households east of Ontario. Half of the households in Prince Edward Island used a boiler as the main heating system (51%). Natural gas and electricity were the most common types of energy used for home heating in 2007. Almost half (47%) of Canadian households used natural gas as their main heating fuel, while 37% used electricity."}, {"url": "http://www.statcan.gc.ca/pub/11-621-m/11-621-m2005023-eng.htm", "passage_text": "For example, per capita consumption in some provinces, such as Alberta (0.85 terajoule) and Saskatchewan (0.63 terajoule) is much higher than the national average of 0.33 terajoule per person. Both these provinces are large producers of energy based on non-renewable resources. Alberta is Canada’s biggest per capita consumer of energy. In 2003, Alberta’s per capita consumption was two-and-a-half times higher than the national average. Between 1990 and 2003, per capita energy consumption increased by 11%. That surge was not entirely due to a sizeable increase in population"}, {"url": "http://www.energy.alberta.ca/NaturalGas/726.asp", "passage_text": "In the 2014/15 fiscal period, Alberta received about $8.95 billion in non-renewable resource revenue accounting for 20 per cent of government revenue. In 2014/15, natural gas and by-product revenue was $989 million or approximately 11 per cent of non-renewable resource revenue and 2.2 per cent of government revenue. Natural gas is one of the cleanest burning fossil fuels. Natural gas can form over time from almost any organic material. It is generally located deep underground in porous rock or trapped between more solid rock formations. The first natural gas well was drilled in 1883 in a field near Medicine Hat, Alberta. A gigajoule (GJ), a unit for measuring natural gas, is the energy equivalent of about 30 litres of gasoline. The average Albertan household uses about 120 GJs of natural gas a year. About 67 per cent of Canada s natural gas production is from Alberta. Alberta s total marketable natural gas production, including coalbed methane, was 3.72 trillion cubic feet in 2014"}, {"url": "http://www.nrcan.gc.ca/energy/crude-petroleum/4551", "passage_text": "Due to the abundant supply of natural gas in Western Canada, relatively little furnace oil is consumed in this region. The western provinces (British Columbia, Alberta, Manitoba and Saskatchewan) account for only 6 per cent of the furnace oil consumption in Canada. On average, Ontario and Quebec account for about 60 per cent of the gasoline consumed in Canada. The western provinces account for about 32 per cent of Canada's gasoline consumption, while the remaining 8 per cent of gasoline is consumed in the Atlantic provinces and the Territories."}, {"url": "http://www.energy.gov.ab.ca/About_Us/1132.asp", "passage_text": "The amount of energy represented by one gigajoule is equivalent to about 30 litres of gasoline, 39 litres of propane, 278 kilowatt-hours of electricity or 45.5 kilograms of coal. The average home in Alberta uses about 120 gigajoules of natural gas per year. Examples of average energy consumption for standard household appliances include: 1  40 gigajoules a year to heat a 40-gallon hot water tank for a family of four. 2  4.3 gigajoules for a gas dryer processing 400 loads of laundry a year. 3  4.2 gigajoules a year for natural gas range used two hours per day."}]