[{"url": "http://www.dachs.it/en/kap-1.php", "passage_text": "Occupational therapy focuses on the person wishing to maintain or regain maximum functional ability and quality of life in his daily living and his environment. The terms activity, the person, daily living, environment and quality of life are therefore pivotal for occupational therapy. WWhich activities a person needs in daily living at any one given point in his life and which are of particular importance to him are partly determined by the roles he assumes or has to assume in his environment (e.g. role of a mother, role of an employee). Occupational therapy takes these into account."}, {"url": "http://www.dachs.it/en/kap-1.php", "passage_text": "The following illustration provides an overview of the key terms of this definition of occupational therapy. Occupational therapy makes resources-oriented, targeted use of specific activities, environment adaptation and advice. This enables the client to increase his functional ability in activities of daily living (ADL), his social participation, and his quality of life and life satisfaction. WWhich activities a person needs in daily living at any one given point in his life and which are of particular importance to him are partly determined by the roles he assumes or has to assume in his environment (e.g. role of a mother, role of an employee). Occupational therapy takes these into account."}, {"url": "http://www.ithaca.edu/hshp/depts/ot/faqs/whatisot/", "passage_text": "Occupational therapy is a health and rehabilitation profession. Occupational therapists work with people of all ages who need specialized assistance to lead independent, productive, and satisfying lives due to physical, developmental, social, or emotional problems. Occupational science studies how activities meet the needs of individuals and communities, and provide meaning and purpose to life; how activity produces changes in the individual and different patterns of occupation. This is similar to how sociology is applied in social work, and biology applied in medicine."}, {"url": "http://www.dachs.it/en/kap-1.php", "passage_text": "1.2.1 Activity (being active, functional ability). Activity is used in occupational therapy as the general term for everything a person does, would like to do or what is expected of him. Functional ability means being able to plan activities and to perform them. WWhich activities a person needs in daily living at any one given point in his life and which are of particular importance to him are partly determined by the roles he assumes or has to assume in his environment (e.g. role of a mother, role of an employee). Occupational therapy takes these into account."}, {"url": "https://en.wikipedia.org/wiki/Occupational_therapy", "passage_text": "Occupational therapists also focus much of their work on identifying and eliminating environmental barriers to independence and participation in daily activities. Occupational therapy is a client-centered practice that places emphasis on the progress towards the client's goals. Occupational therapists often work closely with professionals in physical therapy, speech therapy, nursing, social work, and the community."}, {"url": "https://en.wikipedia.org/wiki/Occupational_therapy", "passage_text": "Occupational therapy (OT) is the use of assessment and treatment to develop, recover, or maintain the daily living and work skills of people with a physical, mental, or cognitive disorder. Occupational therapists often work closely with professionals in physical therapy, speech therapy, nursing, social work, and the community."}, {"url": "http://www.merriam-webster.com/dictionary/occupational%20therapy", "passage_text": "Full Definition of OCCUPATIONAL THERAPY. : therapy based on engagement in meaningful activities of daily life (as self-care skills, education, work, or social interaction) especially to enable or encourage participation in such activities despite impairments or limitations in physical or mental functioning. occupational therapy. noun. Tweet. medical: treatment that helps people who have physical or mental problems learn to do the activities of daily life."}, {"url": "http://www.wfot.org/Portals/0/PDF/STATEMENT%20ON%20OCCUPATIONAL%20THERAPY%20300811.pdf", "passage_text": "STATEMENT ON OCCUPATIONAL THERAPY. Occupational therapy is a-centred client health profession concerned with promoting health and well being through occupation. The primary goal of occupational therapy is to enable people to participate in the activities of everyday life. Occupational therapists believe that participation can be supported or restricted by the. physical, affective or cognitive abilities of the individual, the characteristics of the occupation, or the physical, social, cultural, attitudinal and legislative environments."}, {"url": "http://bmjopen.bmj.com/content/2/1/e000556.full", "passage_text": "Leisure time physical activity was found to modify the positive association between occupational physical activity and risk of all-cause mortality. High occupational physical activity imposes harmful effects particularly among men with low levels of leisure time physical activity. Sex differences in the relationship between occupational physical activity and risk of all-cause mortality and myocardial infarction may reflect qualitative as well as quantitative differences with respect to occupational physical exposures."}]