[{"url": "http://legal-dictionary.thefreedictionary.com/Individual+liberty", "passage_text": "7. Political liberty may be defined to be, the security by which, from the constitution, form and nature of the established government, the citizens enjoy civil liberty. No ideas or definitions are more distinguishable than those of civil and political liberty, yet they are generally confounded. 1 Bl. Com. 6, 125. Liberty is divided into civil, natural, personal, and political. 3. Civil liberty is the power to do whatever is permitted by the constitution of the state and the laws of the land."}, {"url": "http://www.heritage.org/constitution/introessays/1/the-meaning-of-the-constitution", "passage_text": "Where the people, through the Constitution, did consent for the central government to have a role, that role would similarly be guided by the people's sense of what was valuable and good as articulated through the political institutions of the central government. "}, {"url": "http://www.civiced.org/resources/publications/resource-materials/390-constitutional-democracy", "passage_text": "In a CONSTITUTIONAL DEMOCRACY the authority of the majority is limited by legal and institutional means so that the rights of individuals and minorities are respected. This is the form of democracy practiced in Germany, Israel, Japan, the United States, and other countries. This framework is intended to assist interested persons in various nations in establishing or improving curricular programs which foster an understanding of and support for constitutional democracy. 1 HISTORY. 2  Citizens should be familiar with the political, economic, and social history of their own country, how the modern world came to be, including how constitutional democracy developed, and the major events, issues and ideas of others of the contemporary world. 3  GEOGRAPHY."}, {"url": "http://www.scotusblog.com/2012/06/the-mandate-is-constitutional-in-plain-english/", "passage_text": "But the government still won, because a different set of five Justices – the Chief Justice, and Justices Ginsburg, Breyer, Sotomayor, and Kagan – agreed that the mandate was constitutional, but for a different reason. The most important part of the Court’s opinion on the mandate came from the Chief Justice, John Roberts. He acknowledged that Congress has a broad power under the Commerce Clause, but he emphasized that Congress’s power to regulate commerce assumes that there is commercial activity to regulate."}, {"url": "http://www.exampleessays.com/viewpaper/52598.html", "passage_text": "The U.S. Constitution in the beginning limited democracy and individual liberty. Our AP U.S. Government/Politics text book leaves this question of whether the U.S. constitution created a system of government that truly respects liberty. There are at least three evidences that support the question. The Electoral College limits democracy because people do not vote for the president directly; instead they vote through the electors. When the Constitution was created it stated that senators would be elected by the state legislators. This once again limits democracy because people cannot vote for senators directly."}, {"url": "http://legal-dictionary.thefreedictionary.com/Individual+liberty", "passage_text": "The Court justified its findings of liberty rights that are not enumerated in the Constitution by stating that some rights are basic and fundamental, and that the government has a duty to protect those rights. Liberty is divided into civil, natural, personal, and political. 3. Civil liberty is the power to do whatever is permitted by the constitution of the state and the laws of the land."}, {"url": "http://www.scotusblog.com/2012/06/the-mandate-is-constitutional-in-plain-english/", "passage_text": "Although the Court had four questions before it, the focus of the challenge to the Affordable Care Act (ACA) was the so-called individual mandate – the requirement that almost all Americans buy health insurance by 2014 or pay a penalty. The most important part of the Court’s opinion on the mandate came from the Chief Justice, John Roberts. He acknowledged that Congress has a broad power under the Commerce Clause, but he emphasized that Congress’s power to regulate commerce assumes that there is commercial activity to regulate."}, {"url": "https://en.wikiquote.org/wiki/First_Amendment_to_the_United_States_Constitution", "passage_text": "The First Amendment to the United States Constitution, relating to the rights to free speech, a free press, freedom of assembly, freedom to petition, and free exercise of religion, was enacted as part of the Bill of Rights, its ratification occuring on December 15, 1791 with the support of the Virginia Legislature. 1 Freedom of speech and of the press are fundamental rights which are safeguarded by the due process clause of the Fourteenth Amendment of the Federal Constitution. [... ] 2  The right of peaceable assembly is a right cognate to those of free speech and free press, and is equally fundamental."}, {"url": "http://www.uniformlaws.org/shared/docs/federalism%20and%20state%20law/Federalism%20and%20State%20Law_DELAWWinterMcBridePepe.pdf", "passage_text": "When the Constitution was adopted, lib-erty was principally conceived as freedom from government power, and the States that ratified the Constitution were concerned that the newly-created central government might pose a threat to both the sovereignty of those States and the freedom of their citizens. WINTER 2011/2012 DELAWARE LAWYER 23 These issues are often seen as a bat-tle over sovereignty between the Fed-eral Government and the States. But there are liberty interests at stake in the answers to both of these questions."}, {"url": "http://www.civiced.org/resources/publications/resource-materials/390-constitutional-democracy", "passage_text": "Democracy is government of, by, and for the people. It is government of a community in which all citizens, rather than favored individuals or groups, have the right and opportunity to participate. In a democracy, the people are sovereign. The people are the ultimate source of authority. 1 HISTORY. 2  Citizens should be familiar with the political, economic, and social history of their own country, how the modern world came to be, including how constitutional democracy developed, and the major events, issues and ideas of others of the contemporary world. 3  GEOGRAPHY."}]