[{"url": "http://www.arthritis.org/about-arthritis/types/osteoarthritis/", "passage_text": "Osteoarthritis. Sometimes called degenerative joint disease or “wear and tear” arthritis, osteoarthritis (OA) is the most common chronic condition of the joints. It occurs when the cartilage or cushion between joints breaks down leading to pain, stiffness and swelling. pain. Osteoarthritis (OA) occurs when the cartilage or cushion between joints breaks down leading to pain, stiffness and swelling. pain. Advertisement."}, {"url": "http://orthoinfo.aaos.org/topic.cfm?topic=A00212", "passage_text": "Osteoarthritis. Osteoarthritis is the most common form of arthritis in the knee. It is a degenerative,wear-and-tear type of arthritis that occurs most often in people 50 years of age and older, but may occur in younger people, too. In osteoarthritis, the cartilage in the knee joint gradually wears away. The most common types of arthritis are osteoarthritis and rheumatoid arthritis, but there are more than 100 different forms. In 2012, more than 51 million people reported that they had been diagnosed with some form of arthritis, according to the National Health Interview Survey."}, {"url": "https://paindoctor.com/conditions/arthritis/", "passage_text": "Osteoarthritis affects approximately 27 million people in the United States, making it the most common form of arthritis. Osteoarthritis is a degenerative disease that results when the cartilage surrounding the joints begins to wear down. "}, {"url": "http://www.arthritis.org/about-arthritis/types/osteoarthritis/symptoms.php", "passage_text": "Symptoms of osteoarthritis vary, depending on which joints are affected and how severely they are affected. However, the most common symptoms are pain and stiffness, particularly first thing in the morning or after resting. Affected joints may get swollen, especially after extended activity. "}, {"url": "http://www.webmd.com/osteoarthritis/guide/osteoarthritis-basics", "passage_text": "A. Arthritis is a general term that means inflammation of the joints. Osteoarthritis, commonly known as wear and tear arthritis, is the most common type of arthritis. It is associated with a breakdown of cartilage in joints and can occur in almost any joint in the body. It commonly occurs in the weight-bearing joints of the hips, knees, and spine. "}, {"url": "http://www.arthritis.com/osteoarthritis_symptoms", "passage_text": "Share +. Text A A A. Often called wear and tear arthritis, osteoarthritis (OA) is the most common form of arthritis in the U.S. In most cases, over time, cartilage in joints breaks down, and OA symptoms begin to occur. OA is most commonly found in the: 1  Knees. 2  Hips."}, {"url": "http://www.niams.nih.gov/Health_Info/Osteoarthritis/default.asp", "passage_text": "Osteoarthritis (AH-stee-oh-ar-THREYE-tis) is the most common type of arthritis and is seen especially among older people. Sometimes it is called degenerative joint disease. Osteoarthritis mostly affects cartilage (KAR-til-uj), the hard but slippery tissue that covers the ends of bones where they meet to form a joint. The most common form of arthritis. It is characterized by the breakdown of joint cartilage, leading to pain, stiffness, and disability. Osteophytes. Small growths of bone that can appear on the edges of a joint affected by osteoarthritis."}, {"url": "http://www.cdc.gov/arthritis/basics/osteoarthritis.htm", "passage_text": "Osteoarthritis (OA) is a disease of the entire joint involving the cartilage, joint lining, ligaments, and underlying bone. The breakdown of these tissues eventually leads to pain and joint stiffness. The joints most commonly affected are the knees, hips, and those in the hands and spine. "}]