[{"url": "http://www.doug-long.com/einstein.htm", "passage_text": "377+). Einstein biographer Ronald Clark has observed that the atomic bomb would have been invented without Einstein's letters, but that without the early U.S. work that resulted from the letters, the a-bombs might not have been ready in time to use during the war on Japan (Clark, pg. 682-683)."}, {"url": "http://www.historylearningsite.co.uk/world-war-two/weapons-of-world-war-two/atomic-bomb/", "passage_text": "Atomic Bomb. The atomic bomb was first used in warfare at Hiroshima and Nagasaki in August 1945 and the bomb played a key role in ending World War Two. The atomic bomb (A bomb), created via the Manhattan Project, was first exploded at the top secret base of Alamogordo on July 16th, 1945. A reconstruction of ‘Little Boy’ at the Imperial War Museum. The bomb that dropped on Hiroshima was code-named ‘Little Boy’."}, {"url": "http://www.debate.org/opinions/should-the-u-s-have-dropped-the-atomic-bomb", "passage_text": "Sure, it could be said that the use of atomic weapons created a nuclear precedent that led to the Cold War, but the Soviets themselves were developing atomic weapons anyway as Soviet spies had gained access to the Manhattan Project and implemented an atomic weapons program in Russia."}, {"url": "http://www.history.com/this-day-in-history/atomic-bomb-dropped-on-hiroshima", "passage_text": "In the years since the two atomic bombs were dropped on Japan, a number of historians have suggested that the weapons had a two-pronged objective. First, of course, was to bring the war with Japan to a speedy end and spare American lives."}, {"url": "http://www.whoinventedit.net/who-invented-the-atomic-bomb.html", "passage_text": "The history of the atomic bomb began with the Manhattan Project. It was tasked to create the bomb beginning in 1939. The scientists who invented the bomb included Robert Oppenheimer, Edward Teller, Rudolf Peierls and many others."}, {"url": "http://www.history.com/this-day-in-history/atomic-bomb-dropped-on-hiroshima", "passage_text": "Publisher. A+E Networks. The United States becomes the first and only nation to use atomic weaponry during wartime when it drops an atomic bomb on the Japanese city of Hiroshima. Though the dropping of the atomic bomb on Japan marked the end of World War II, many historians argue that it also ignited the Cold War."}, {"url": "http://www.answers.com/Q/Why_was_the_atomic_bomb_invented", "passage_text": "Leo Szilard invented the atomic bomb and reactor in 1933 as a more efficient method of transmuting elements. It took another 12 years plus a $2,000,000,000 investment by the US to build the first bombs."}]