[{"url": "http://www.thinkbabynames.com/meaning/1/Faust", "passage_text": "From Roman faustus or fausta. The Roman general Lucius Cornelius Sulla, added Felix happy, fortunate to his name and named his twin children Faustus and Fausta, which then became Latin Faustinus. The name of many saints. The legendary Faust sold his soul to the devil."}, {"url": "http://www.ourbabynamer.com/meaning-of-Faustus.html", "passage_text": "Then just follow the diagram below. Just for fun, see the name Faustus in Hieroglyphics, learn about ancient Egyptian Hieroglyphics and write a Hieroglyphic message. Learn about nautical flags and see your name or message written in nautical flags, on the Faustus in Nautical Flags page. Less than 5 girls were given the name. View the Faustus Name Popularity Page to see how the popularity trend for Faustus has changed since 1880, or to compare the popularity of Faustus to other names."}, {"url": "https://en.wikipedia.org/wiki/Faust", "passage_text": "Faust is the protagonist of a classic German legend. He is a scholar who is highly successful yet dissatisfied with his life, which leads him to make a pact with the Devil, exchanging his soul for unlimited knowledge and worldly pleasures. He makes a bargain with Faust: Mephistopheles will serve Faust with his magic powers for a set number of years, but at the end of the term, the Devil will claim Faust's soul, and Faust will be eternally damned. The term usually stipulated in the early tales is 24 years; one year for each of the hours in a day."}, {"url": "http://www.babynamespedia.com/meaning/Faustus", "passage_text": "[ 2 syll. fau -(s) tus, fa-ust-us ] The baby boy name Faustus is pronounced as F AH-S-TahS- †. Faustus is used predominantly in the German language and its origin is Latin. It is derived literally from the word 'faustus' which means lucky, auspicious. Faustus (Latin) is an original form of Faustus. The names Faustus and Fausta were bestowed by the 1st century BC Roman dicator Sulla upon his twin children"}, {"url": "https://en.wikipedia.org/wiki/Faust", "passage_text": "Faust is bored and depressed with his life as a scholar. After an attempt to take his own life, he calls on the Devil for further knowledge and magic powers with which to indulge all the pleasure and knowledge of the world. He makes a bargain with Faust: Mephistopheles will serve Faust with his magic powers for a set number of years, but at the end of the term, the Devil will claim Faust's soul, and Faust will be eternally damned. The term usually stipulated in the early tales is 24 years; one year for each of the hours in a day."}, {"url": "http://www.thinkbabynames.com/meaning/1/Faustus", "passage_text": "Faustus /faus-tus/ [2 sylls.] as a boys' name is of Latin derivation, and the meaning of the name Faustus is lucky, fortunate. Faustus is a variant transcription of Faust (Latin): from Roman faustus. Fustos is a common surname. Kreatif forms: Fastus, Fistus. Faustus is an equally unique surname for all people. (2000 U.S. Census). Faustino is the only prominent variation form of Faustus (outside Top 1000) listed in the Top 1000. Adoption of this boy name was at its apex during the years 1930-1939 (usage of 0.236%) and is now much less, with Faustino becoming less trendy."}, {"url": "http://www.thinkbabynames.com/meaning/1/Faust", "passage_text": "Faust is a rare first name for males but a very popular surname for both adults and children (#2108 out of 150436, Top 1%). (2000 U.S. Census). The Roman general Lucius Cornelius Sulla, added Felix happy, fortunate to his name and named his twin children Faustus and Fausta, which then became Latin Faustinus. The name of many saints. The legendary Faust sold his soul to the devil."}, {"url": "http://www.ourbabynamer.com/meaning-of-Faustus.html", "passage_text": "Faustus is generally used as a boy's name. It consists of 7 letters and 2 syllables and is pronounced Faus-tus. In the U.S. in 2014 less than 5 boys given the name. Less than 5 girls were given the name. View the Faustus Name Popularity Page to see how the popularity trend for Faustus has changed since 1880, or to compare the popularity of Faustus to other names. The names Fausta, Fausto are all forms of Faustus"}, {"url": "http://www.thinkbabynames.com/meaning/1/Faust", "passage_text": "Faust /fau-st/ [1 syll.] as a boys' name is of Latin origin, and the meaning of Faust is lucky, fortunate . The Roman general Lucius Cornelius Sulla, added Felix happy, fortunate to his name and named his twin children Faustus and Fausta, which then became Latin Faustinus. The name of many saints. The legendary Faust sold his soul to the devil."}, {"url": "http://www.thinkbabynames.com/meaning/1/Faustus", "passage_text": "Faustus is a rare first name for males. Faustus is an equally unique surname for all people. (2000 U.S. Census). Faustino is the only prominent variation form of Faustus (outside Top 1000) listed in the Top 1000. Adoption of this boy name was at its apex during the years 1930-1939 (usage of 0.236%) and is now much less, with Faustino becoming less trendy."}]