[{"url": "http://www.physiologymodels.info/ans/abdominal.htm", "passage_text": "Splanchnic means having to do with the viscera (i.e., internal organs). Sympathetic preganglionic axons (orange lines) emerge from the cord and pass through ganglia of the sympathetic chain (line of yellow circles) without synapsing. They gather into three nerves called the. From here, postganglionic axons (dashed blue line) synapse with their receptors within the organ. These ganglia (large yellow circles) are named the. . They sit just ventral to the aorta and the nerves entering and leaving them are intertwined forming a plexus. This entire region is called the 'solar plexus'."}, {"url": "https://quizlet.com/21372861/anatomy-chapter-18-autonomic-nervous-system-flash-cards/", "passage_text": "Its cell body lies within the brainstem or the spinal cord. A preganglionic axon extends from this cell body and exits the CNS in either a cranial nerve or spinal nerve. It projects to the cell body of the second neuron, which is houses within an autonomic ganglion in the peripheral nervous system. The second neuron in this pathway is called a ganglionic neuron, and a postganglionic axon extends from its cell body to effector cells or an effector organ. Many visceral effectors have dual innervation, meaning that they are innervated by postganglionic axons from both ANS divisions. The actions of the divisions usually oppose each other, and so they are said to exert antagonistic effects on the same organ."}, {"url": "http://www.studystack.com/flashcard-1049747", "passage_text": "Anatomic differences: Sympathetic division: short, branching (axon collaterals) preganglionic axon, and long postganglionic axons; mass activation. The __ __ __ (__) includes processes that are perceived or controlled consciously. ANS is also called __ __ __. It's part of the __. It is composed of a __ neuron chain. It is controlled by the __ in the brain. autonomic nervous system, PNS, two, hypothalamus. First if two ANS motor neurons is called the __ __."}, {"url": "http://www.studystack.com/flashcard-1049747", "passage_text": "The second of two ANS motor neurons is called the __ __. Its cell body resides w/in autonomic ganglion. A __ __ extends from cell body to effector (cardiac muscle, smooth muscle, or gland). Unmyelinated axons, smaller in diamter than preganglionic axons. ganglionic neuron, postganglionic axon. The precentral gyrus is in the __ lobe and is __. ANS is also called __ __ __. It's part of the __. It is composed of a __ neuron chain. It is controlled by the __ in the brain. autonomic nervous system, PNS, two, hypothalamus. First i"}, {"url": "http://www.physiologymodels.info/ans/abdominal.htm", "passage_text": "Parasympathetic preganglionic axons (blue line) emerge from the sacral region of the cord to form the. . These neurons penetrate pelvic organs to synapse with intramural ganglia light blue circle. From here, postganglionic axons (dashed blue line) synapse with their receptors within the organ. These ganglia (large yellow circles) are named the. . They sit just ventral to the aorta and the nerves entering and leaving them are intertwined forming a plexus. This entire region is called the 'solar plexus'."}, {"url": "http://medical-dictionary.thefreedictionary.com/postganglionic+neurons", "passage_text": "preganglionic neuron. A neuron of the autonomic nervous system whose cell body lies in the central nervous system and whose axon terminates in a peripheral ganglion, synapsing with postganglionic neurons. The axon conducts the impulses to the dendrite of another neuron or to an effector organ that is thereby stimulated to action. Many processes are covered with a layer of lipid material called the myelin sheath. Peripheral nerve fibers have a thin outer covering called neurilemma."}, {"url": "http://classes.midlandstech.edu/carterp/Courses/bio210/chap14/lecture1.html", "passage_text": "ANS preganglionic neurons and somatic motor neurons derive from the embryonic neural tube. ANS structures found in the PNS (ganglionic neurons, adrenal medulla, and all autonomic ganglia) derive from the neural crest. Nerve growth factor is a protein secreted by target cells of the postganglionic axons. ACh is released by all ANS preganglionic axons and all parasympathetic postganglionic axons; these fibers are cholinergic fibers. Sympathetic postganglionic axons release NE and are adrenergic fibers (except sympathetic postganglionic fibers that synapse with eccrine sweat glands, these release ACh)."}, {"url": "https://quizlet.com/21372861/anatomy-chapter-18-autonomic-nervous-system-flash-cards/", "passage_text": "Instead, the postganglionic axon extends away from the sympathetic trunk ganglion and goes directly to the effector organ. The esophagus, heart, lungs, and thoracic blood vessels typically receive their sympathetic innervation from this pathway. Many visceral effectors have dual innervation, meaning that they are innervated by postganglionic axons from both ANS divisions. The actions of the divisions usually oppose each other, and so they are said to exert antagonistic effects on the same organ."}, {"url": "https://quizlet.com/21372861/anatomy-chapter-18-autonomic-nervous-system-flash-cards/", "passage_text": "Sympathetic Pathway Uses Splanchnic nerves, which are preganglionic axons that pass through the sympathetic trunk ganglia without synapsing. These nerves extend from the anterior side of the sympathetic trunk ganglia to the prevertebral ganglia. There, the postganglionic axon then travels to the effector organs. Many visceral effectors have dual innervation, meaning that they are innervated by postganglionic axons from both ANS divisions. The actions of the divisions usually oppose each other, and so they are said to exert antagonistic effects on the same organ."}, {"url": "http://www.78stepshealth.us/human-physiology/parasympathetic-division.html", "passage_text": "■ Figure 9.3 The pathway of sympathetic neurons. The preganglionic neurons enter the sympathetic chain of ganglia on the white ramus (one of the two rami communicantes). Some synapse there, and the postganglionic axon leaves on the grey ramus to rejoin a spinal nerve. Others pass through the ganglia without synapsing. "}]