[{"url": "https://answers.yahoo.com/question/index?qid=20110506101917AAwNmOX", "passage_text": "Because of the choice of starting materials, soaps are not as effective an emulsifier as detergents. Water is not an emulsifier. Remember that an emulsion can be oil in water, or water in oil. Either is a fine dispersion of one liquid in another in which it is not soluble or miscible. One answer you missed was eggs. Mayonnaise is a stable emulsion of oil in water. Eggs provide the emulsifier that holds everything together. "}, {"url": "http://www.emulsifiers.org/ViewDocument.asp?ItemId=11&", "passage_text": "What is an emulsifier? When water and oil are mixed together and vigorously shaken, a dispersion of oil droplets in water-and vice versa-is formed. When shaking stops, the phases start to separate. However, when an emulsifier is added to the system, the droplets remain dispersed, and a stable emulsion is obtained. An emulsifier consists of a water-loving hydrophilic head and an oil-loving hydrophobic tail."}, {"url": "http://nsb.wikidot.com/c-9-5-5-4", "passage_text": "Soap, Water and Oil. An emulsion is a type of dispersion in which two normally immiscible substances are stabilised by another substance, called an emulsifier. For example, olive oil and water will not dissolve in one another, as their intermolecular forces differ (like dissolves like)."}, {"url": "http://www.allnaturalbeauty.us/emulsions.htm", "passage_text": "Ingredients are important but the emulsifier is actually the key. An emulsion is a mixture of water and oil. It s the glue that holds it all together. There are 2 basic types of emulsions: Water in Oil W/O-in this emulsion the oil surrounds the water and the oil touches the skin first. The level of greasiness depends on the formula-all of which will be absorbed into the skin."}, {"url": "http://curious-soapmaker.com/glyceryl-stearate-home-made-emulsifier.html", "passage_text": "Glyceryl stearate – home made emulsifier. Glyceryl stearate is a non-ionic low HLB emulsifier and emulsion stabilizer. Because it has low HLB, for emulsions oil-in-water it is being used in combination with another emulsifier. It is said that it brings to creams and solutions a non-greasy, but rich touch. "}, {"url": "http://teachsoap.com/forum/viewtopic.php?f=5&t=10910", "passage_text": "You're welcome. Oils or butters are not emulsifiers. Emulsifier is an ingredient which makes oil(s) and water mix and stay mixed, like E-wax or emulsifying wax. I have never tried xantham gum as a thickener in liquid soap. I used a 30% salt solution. "}, {"url": "http://www.edinformatics.com/interactive_molecules/soap.htm", "passage_text": "When grease or oil (non-polar hydrocarbons) are mixed with a soap-water solution, the soap molecules work as a bridge between polar water molecules and non-polar oil molecules. Since soap molecules have both properties of non-polar and polar molecules the soap can act as an emulsifier. 5. Which of the following statements is not correct a) the soap molecules work as a bridge between polar water molecules and non-polar oil molecules b) soap forms micelles c) soap is an emulsifier d) soap is made of just carbon and hydrogen atoms."}, {"url": "http://chemistry.about.com/od/cleanerchemistry/a/how-soap-cleans.htm", "passage_text": "Soap is an excellent cleanser because of its ability to act as an emulsifying agent. An emulsifier is capable of dispersing one liquid into another immiscible liquid. This means that while oil (which attracts dirt) doesn't naturally mix with water, soap can suspend oil/dirt in such a way that it can be removed. The organic part of a natural soap is a negatively-charged, polar molecule"}, {"url": "http://pslc.ws/macrog/emulsion.htm", "passage_text": "A soap, or surfactant as it is referred to in emulsion polymerizations, has two ends of different solubility. One end, termed the tail, is a long hydrocarbon that is soluble in nonpolar, organic compounds. The other, the head, is often a sodium or potassium salt, which is water soluble. The definition for emulsion is: A stable colloidal suspension as milk, consisting of an immiscible liquid dispersed and held in another liquid by a substance called an emulsifier. In order to understand emulsion polymerization and emulsifiers, we ve got to understand how soap works. Yes, soap!"}]