[{"url": "http://gildedplanet.com/glassgilding.html", "passage_text": "How to gild on glass surfaces. Applying gold leaf to glass is a technique that has been employed for centuries by sign makers, lettering specialists, and specialty mirror makers. Glass gilding is also know as 'Reverse Gilding on Glass' and 'Verre Eglomise'. Glass gilding employs a specific type of adhesive glue know as Gelatin Size. This is dissolved in warm water and floated over the glass surface. While still wet or pooling, the gold is immediately applied. Once dry there is no discolorization when viewing the gold through the glass (and adhesive layer)."}, {"url": "http://glass-gilding.com/crbst_1.html", "passage_text": "Verre eglomise, églomisé from The french term meaning glass, gilded is a process where the backside of the glass is gilded with gold or metal. Leaf the metal leaf may be applied using-oil based (adhesives goldsize) varnish to achieve a matt. finish Each precious leaf is applied by hand and adhered to the back of glass with a gelatin and water solution. When dry, the gold or silver leaf is very gently rubbed and sealed in black paint. The effect is mirror-like with the lap lines between each leaf fully apparent."}, {"url": "https://en.wikipedia.org/wiki/Gold_glass", "passage_text": "Gold sandwich glass was also used for the gold tesserae used in Late Antique, Byzantine and medieval mosaics, as here in Hagia Sophia. Gold glass or gold sandwich glass is a luxury form of glass where a decorative design in gold leaf is fused between two layers of glass. Both of these processes were also used in ancient times, and the German and French languages often use their native terms for what is called gold glass in English. Gold ruby glass or cranberry glass is actually red, coloured by the addition of gold oxide."}, {"url": "http://gildedplanet.com/glassgilding.html", "passage_text": "- 'Reverse Gilding on Glass' and 'Verre Eglomise'. Applying gold leaf to glass is a technique that has been employed for centuries by sign makers, lettering specialists, and specialty mirror makers. Glass gilding is also know as 'Reverse Gilding on Glass' and 'Verre Eglomise'. Glass gilding employs a specific type of adhesive glue know as Gelatin Size. This is dissolved in warm water and floated over the glass surface. While still wet or pooling, the gold is immediately applied. Once dry there is no discolorization when viewing the gold through the glass (and adhesive layer)."}, {"url": "http://howtogoldleaf.com/", "passage_text": "Reverse Glass Gilding Gold Leaf Application usually begins with a Design. A design or pattern is used when reverse glass gilding, I prefer a paper pattern and will use the pattern for placement on the outside the the glass to know where you’ll place the gold leaf required. Lightly dust surface to be gilded with “ Shadow Kaolin ” as a resist, and then lightly blow off any excess powder. If a pattern is needed, now place pattern and use the Shadow Kaolin to pounce your design to the surface. Use brush of choice, then apply “ Gilders Fast Gold Size ” to area being Gilded."}, {"url": "http://www.goldreverre.com/resource/watergilding.php", "passage_text": "Water gilding is used to achieve a mirror finish on glass, also called a bright finish. Only loose leaf is used, not transfer leaf. Sometimes you can blow it up the glass and back into place. The gild is initially satin in appearance but becomes bright as it dries. It can then be lightly rubbed with cotton wool to smooth it down and any holes and damaged areas are patched with a second gild. It is also given a second wash over with size."}, {"url": "http://www.goldreverre.com/resource/watergilding.php", "passage_text": "Water Gilding. Water gilding is used to achieve a mirror finish on glass, also called a bright finish. Only loose leaf is used, not transfer leaf. It shares some similarities with water gilding on bole (clay) used for picture frames and antique furniture. The area to be gilded is wetted fully with the water size made from gelatine dissolved in hot water. The leaf is picked up with a gilders tip and placed onto the wet glass. As soon as part of the leaf touches the size, the whole leaf is sucked onto the glass. Sometimes you can blow it up the glass and back into place. The gild is initially satin in appearance but becomes bright as it dries. It can then be lightly rubbed with cotton wool to smooth it down and any holes and damaged areas are patched with a second gild. It is also given a second wash over with size."}, {"url": "https://en.wikipedia.org/wiki/Gold_glass", "passage_text": "Gold-band glass is a related Hellenistic and Roman technique, where strips of gold leaf, sandwiched between colourless glass, are used as part of the marbling effect in onyx glass. It is mostly found in small perfume bottles and the like. Both of these processes were also used in ancient times, and the German and French languages often use their native terms for what is called gold glass in English. Gold ruby glass or cranberry glass is actually red, coloured by the addition of gold oxide."}]