[{"url": "http://applianceguru.com/forum9/3356.html", "passage_text": "The two most frequent questions I hear while on an appliance service call are 1)  How much is a new one ? and 2) How long should appliances last?. I've already discussed the first question in the linked article and this pearl of appliance wisdom will answer the second one. "}, {"url": "http://money.usnews.com/money/personal-finance/articles/2014/05/05/how-long-should-your-household-purchases-last", "passage_text": "Here's a guide to the life expectancy of big-ticket purchases, from the roof down to the refrigerator. Most kitchen appliances, such as refrigerators, dishwashers and gas range ovens, should be replaced every 10 to 15 years. And while the walls should also last the lifetime of the house, aluminum windows are only expected to hang around for 15 to 20 years. Wooden windows should last as long as 30 years."}, {"url": "http://www.thisoldhouse.com/toh/photos/0,,20219708_20496151,00.html", "passage_text": "Appliances. The life expectancy of a typical appliance depends to a great extent on the use it receives. Moreover, appliances are often replaced long before they are worn out because changes in styling, technology and consumer preferences make newer products more desirable. Of the major appliances in a home, gas ranges have the longest life expectancy: 15 years. Dryers and refrigerators last about 13 years. Some of the appliances with the shortest lifespan are: compactors (6 years), dishwashers (9 years) and microwave ovens (9 years). "}, {"url": "http://blogs.hrblock.com/2013/10/21/the-life-expectancy-of-7-major-appliances/", "passage_text": "I’m wondering if manufacturers have taken such numbers into consideration and as a result take efforts to make sure your appliance does not last that long. Imagine no return customers for 10 to 15 years :/. The longest my major appliances have last with exception of my dishwasher and garbage disposal is 7-8 years. 1 Small efforts, like using a strainer and always running water when operating the disposal, will pay off with a long life. 2  Range or Stove, 13-15 years: Gas stoves last longer than their electric counterparts by 2-5 years, on average."}, {"url": "http://fixitnow.com/2004/03/appliance-tip-of-day-how-long-should.htm", "passage_text": "Appliance half-life is defined as the number of years after which it would not be cost-effective to repair half of the appliances in the group. For example, if the half-life of all dryers is 13 years, this means that in a group of 10 dryers, all 13-years old, it would be cost-effective to repair only five of them. How to use this table. Suppose you have a 15-year old side-by-side refrigerator that breaks. You look up side-by-side fridges and see the half-life is 14 years."}, {"url": "http://www.cbsnews.com/news/kitchen-appliances-how-long-do-they-last/", "passage_text": "A couple of years ago the NAHB, along with Bank of America, put out some research entitled the Study of Life Expectancy of Home Components. According to the results, the average lifespan for a modern dishwasher is just nine years. Although my Maytag was working well up until the accident, I purchased it back in 2001 and it appears to be bumping up against its expiration date. Fortunately, the contractor's insurance should cover the structural damage. But I still need to either fix my appliance -- which will cost me a couple hundred dollars -- or buy a new one, which could run as high as $900. (I know some models are less, but I want something that matches the stove.)."}, {"url": "http://www.kiplinger.com/quiz/real-estate/T029-S001-how-long-should-it-last/index.html", "passage_text": "Sorry, wrong! is incorrect. The right answer is C. Around 15 years. An electric range should keep cooking for about 16 years, manufacturers say, while a gas range will last about 13. Stand-alone versions can make it even longer: 20 years for a wall oven, and 18 years and up for a cooktop. "}, {"url": "http://money.usnews.com/money/personal-finance/articles/2014/05/05/how-long-should-your-household-purchases-last", "passage_text": "The foundation and frame of your house should last a lifetime if they were properly built. And while the walls should also last the lifetime of the house, aluminum windows are only expected to hang around for 15 to 20 years. Wooden windows should last as long as 30 years. Your garage door opener won't have as lucky of a fate, however. Expect it to last 10 to 15 years"}, {"url": "http://www.kiplinger.com/article/real-estate/T029-C000-S002-how-long-will-your-major-home-appliances-last.html", "passage_text": "Hot Water Heater. Expected life: 10 years for gas or electric; 20 years for tankless. Total cost : $548 to $915 for energy-efficient model; $739 to $1,240 for tankless; $2,658 to $3,443 for heat-pump water heater. It's time if: The unit is ten years old or more, leaks around the base, or works erratically. "}]