[{"url": "http://www.sfgms.org/articles/taffelamber.html", "passage_text": "Although the oldest amber comes from The Baltic, amber has also been found in Mexico and The Dominican Republic. Quaternary Amber can be found in Tanzania. This unique amber is older than copal resin, but younger than Baltic amber, Madagascar, Alaska (derived from cypress trees), Sweden, Germany and Poland. Amber's color can vary depending on the source of the hardened tree resin. For example, the most common golden yellow, white, and ivory colored amber comes from pine trees. Cherry and plum trees produce an amber with more red, orange and brown tones."}, {"url": "http://superbeefy.com/where-does-amber-come-from/", "passage_text": "Amber is a hard yellow substance that is usually considered a semi-precious gem. But amber is not a mineral; it’s the remains of trees that lived millions of years ago! In prehistoric times, sap leaked to the ground from pine trees. "}, {"url": "http://www.viavaleron.com/category_s/1824.htm", "passage_text": "Where does Amber come from? Baltic amber is mainly found in the areas surrounding the Baltic Sea which is why it is called “Baltic” amber. Resin has been found in Poland, Germany, Lithuania, Latvia, Estonia, Denmark, Sweden, Holland, Belorussia and as far west as the United Kingdom. Baltic amber accounts for over 90% of the world’s known amber today; however, amber is found all over the world including Mexico and the Dominican Republic. Amber is not to be confused with sap, which flows through the tree's heartwood to transport nutrients to the tree. Resin has a syrupy consistency and piney fragrance, which comes from chemicals known as terpenes (a naturally-occurring hydrocarbon)."}, {"url": "http://www.sfgms.org/articles/taffelamber.html", "passage_text": "The Greeks called amber elektro, from which the word electricity is derived because if you rub amber with a cloth it will become charged, enabling it to attract small pieces of paper. For mineralogists, the Latin word succinum has come into usage as the word succinite, it's official name. However, since amber is organic, and is not inorganic with an ordered crystalline structure, it is NOT a mineral. Amber's color can vary depending on the source of the hardened tree resin. For example, the most common golden yellow, white, and ivory colored amber comes from pine trees. Cherry and plum trees produce an amber with more red, orange and brown tones."}, {"url": "http://www.sfgms.org/articles/taffelamber.html", "passage_text": "Most Baltic Sea amber (Estonia and Latvia) comes from 25-40 meters beneath the ground. Cretaceous amber can be found in California, and Poland (along the northwest side of Gdansk Bay, Bay of Danzig and Baltic coastline, amber can still be found), and in Siberia as well. Amber's color can vary depending on the source of the hardened tree resin. For example, the most common golden yellow, white, and ivory colored amber comes from pine trees. Cherry and plum trees produce an amber with more red, orange and brown tones."}, {"url": "http://www.ambercompany.com/site/index.cfm?action=what_is", "passage_text": "BALTIC AMBER Baltic Amber comes from Eastern Europe countries near the Baltic Sea (Poland, Lithuania, Russia, etc.). It is Eocene in age (approximately 50 million years old). Baltic Amber is usually lemon-yellow to orange in color, and ranges in quality from opaque to clear. WHAT IS AMBER? Amber, simply put, is ancient tree sap that has turned to stone over time. Scientifically, amber is the resin of certain trees that has fossilized over millions of years. It is a light, organic substance that is usually yellow or orange in color and often transparent."}, {"url": "http://academic.emporia.edu/abersusa/whatis.htm", "passage_text": "Amber is the fossilized resin from ancient forests. Amber is not produced from tree sap, but rather from plant resin. This aromatic resin can drip from and ooze down trees, as well as fill internal fissures, trapping debris such as seeds, leaves, feathers and insects."}, {"url": "http://www.answers.com/Q/Where_does_amber_come_from", "passage_text": "Amber is a fossilized resin that comes from ancient coniferous trees. It often has fossilized insects imbedded in it. You may be thinking of ambergris: a waxy substanc … e that comes from sperm whales and is used in perfumes. "}, {"url": "https://en.wikipedia.org/wiki/Amber", "passage_text": "Amber is fossilized tree resin (not sap), which has been appreciated for its color and natural beauty since Neolithic times. Much valued from antiquity to the present as a gemstone, amber is made into a variety of decorative objects. Amber is used as an ingredient in perfumes, as a healing agent in folk medicine, and as jewelry. There are five classes of amber, defined on the basis of their chemical constituents."}, {"url": "http://museumcatalogues.getty.edu/amber/intro/5/", "passage_text": "This early Tertiary (Upper Eocene–Lower Oligocene) amber comes mainly from around the shores of the Baltic Sea, from today’s Lithuania, Latvia, Russia (Kaliningrad), Poland, southern Sweden, northern Germany, and Denmark. "}]