[{"url": "https://www.americanelements.com/pr.html", "passage_text": "Praseodymium is one of the rare earth elements found in didymium glass, which is used in safety goggles that block potentially harmful intense ultraviolet, infrared, and yellow light produced by during some types of welding and glassworking. "}, {"url": "http://www.webelements.com/praseodymium/", "passage_text": "Praseodymium has no biological role but is said to stimulate the metabolism. Praseodymium is never found in nature as the free element. Praseodymium is found in the ores monazite sand [(Ce, La, etc.)PO 4 ] and bastn°site [(Ce, La, etc.)(CO 3)F], ores containing small amounts of all the rare earth metals. It is difficult to separate from other rare earth elements. Isolation: praseodymium metal is available commercially so it is not normally necessary to make it in the laboratory, which is just as well as it is difficult to isolate as the pure metal. This is largely because of the way it is found in nature. The lanthanoids are found in nature in a number of minerals."}, {"url": "http://www.lenntech.com/periodic/elements/pr.htm", "passage_text": "Praseodymium is usually found only in two different kinds of ores. The major commercial ores in which praseodymium is found are monazite and bastnasite. The main mining areas are China, USA, Brazil, India, Sri Lanka and Australia. Reserves of praseodymium are estimated to be around 2 million tonnes. World production of praseodymium is about 2500 tonnes per year. Praseodymium can be used as alloying agent with magnesium to create high strenght metals that are used in aircraft engines. Praseodymium is one of the rare chemicals, that can be found in houses in equipment such as colour televisions, fluorescent lamps, energy-saving lamps and glasses."}, {"url": "http://www.webelements.com/praseodymium/geology.html", "passage_text": "Praseodymium is never found in nature as the free element. Praseodymium is found in the ores monazite sand [(Ce, La, etc.)PO 4 ] and bastn°site [(Ce, La, etc.)(CO 3)F], ores containing small amounts of all the rare earth metals. It is difficult to separate from other rare earth elements"}, {"url": "http://www.livescience.com/37655-praseodymium.html", "passage_text": "Sources of praseodymium. Praseodymium can be found in a variety of minerals. Larger quantities of the element are found in monazite and bastnasite. New techniques, such as ion-exchange and solvent extraction, have led to easier isolation of many rare-earth elements."}, {"url": "https://en.wikipedia.org/wiki/Praseodymium", "passage_text": "Praseodymium is a chemical element with symbol Pr and atomic number 59. Praseodymium is a soft, silvery, malleable and ductile metal in the lanthanide group. It is valued for its magnetic, electrical, chemical, and optical properties. It is too reactive to be found in native form, and when artificially prepared, it slowly develops a green oxide coating. In the 1930s it was found (Beck) that praseodymium dioxide could be precipitated from KOH/NaOH eutectic melts, by oxidation by electrochemistry, or by sodium chlorate. This formed the basis of a small-scale laboratory purification method. The relatively pure free metal itself was not prepared until 1931."}, {"url": "http://www.answers.com/Q/Who_discovered_Praseodymium", "passage_text": "The person who discovered Praseodymium is Carl Auer, Freiherr Von Welsbach. I hope this helps I had an element project and I found this person for the element so I hope this helps a lot. ^.^. - Here's some more info on Praseodymium: Element's Symbol: Pr. praseodymium is the 59th chemical on the periodic table of the elements. Praseodymium is a soft, silvery, malleable and ductile metal in the lanthanide group."}, {"url": "http://www.chemicool.com/elements/praseodymium.html", "passage_text": "Cost, bulk: $ per 100g. Source: Praseodymium is not found free in nature but is found in a number of minerals mainly monazite and bastnaesite. It is recovered commercially by ion exchange techniques and counter-current liquid-liquid extraction processes from monazite sand and bastnaesite. "}]