[{"url": "https://www.selectquote.com/learning/life-insurance-faqs.aspx", "passage_text": "A term life insurance policy covers you for a stated period—typically 10, 15, 20, or 30 years. Because the insurance company's liability is limited to a specific period, term is the most economical kind of life insurance. A whole life insurance policy lasts as long as you pay the premiums. Whole life policies can also have a cash value. Part of the premium you pay covers your insurance, and some of it goes into the policy's cash value. Whole life insurance is much more expensive than term life insurance for the dollar amount of coverage. Most financial planners recommend coverage that's 5 to 10 times your annual income. For example, if you make $50,000, you might consider coverage between $250,000 and $500,000. If you're younger and just starting a family, you might need as much as 15 times your income to allow for salary increases."}, {"url": "https://www.selectquote.com/calculator/how-much-term-life-insurance-do-i-need.aspx", "passage_text": "Start by adding up your family's monthly expenses. Most people have no idea how much life insurance they need. This handy worksheet will help you determine what your family's ongoing and one-time expenses are – and give your SelectQuote agent a head start on determining the right policy amount for you. "}, {"url": "http://www.bankrate.com/finance/insurance/how-much-life-insurance-should-you-buy.aspx", "passage_text": "Insurance » Life Insurance ». You buy life insurance to provide for your dependents when you're no longer around to do so. Since none of us comes with an expiration date and since life by its very nature is all about change, it can be tough to accurately predict your family's financial needs years from now. Right now, you may be just starting to save for retirement, but by the time you actually retire, you'll have $500,000 or $1 million in your retirement plan, so you may no longer need that $500,000 life insurance policy.."}, {"url": "http://www.kiplinger.com/article/insurance/T034-C000-S002-how-much-life-insurance-do-you-need.html", "passage_text": "They also complicate the issue of how much life insurance is right for you. Standard formulas -- such as buying coverage equal to eight to ten times your annual income -- are inadequate shortcuts. Online calculators are apt to tell you to raise your coverage by $1 million even if you already have insurance. Also consider how many years you’ll need insurance. If you’re in fine physical shape, you can buy a new policy and lock in the price for 20 years. Because prices for term have been dropping steadily, you may not pay much more to extend your coverage if you reshop in, say, five years."}, {"url": "http://www.dallasnews.com/business/personal-finance/headlines/20131014-how-much-term-life-insurance-do-i-need.ece", "passage_text": "But if you’re in a residency finishing your medical degree, you can realistically look at making $40,000 to $50,000 for another year or two then making the jump to $200,000. That’s the kind of logical thinking and planning I’m talking about. In that scenario, a huge jump in income is almost assured. "}, {"url": "http://www.kiplinger.com/article/insurance/T034-C000-S002-how-much-life-insurance-do-you-need.html", "passage_text": "But don’t be frightened. With term insurance, boosting your death benefit by hundreds of thousands of dollars should cost just a few hundred dollars a year. For example, a healthy 40-year-old male nonsmoker might be considering a 20-year, $500,000 term policy for $360 per year. Also consider how many years you’ll need insurance. If you’re in fine physical shape, you can buy a new policy and lock in the price for 20 years. Because prices for term have been dropping steadily, you may not pay much more to extend your coverage if you reshop in, say, five years."}, {"url": "http://www.kiplinger.com/article/insurance/T034-C000-S002-how-much-life-insurance-do-you-need.html", "passage_text": "If you shift another $100,000 at age 31, your premium would rise to $2,600. Your premium would gradually increase whenever you shift money to the whole-life policy, topping out at $7,200 at age 40, for the entire $500,000 of whole-life insurance. Also consider how many years you’ll need insurance. If you’re in fine physical shape, you can buy a new policy and lock in the price for 20 years. Because prices for term have been dropping steadily, you may not pay much more to extend your coverage if you reshop in, say, five years."}, {"url": "http://www.kiplinger.com/article/insurance/T034-C000-S002-how-much-life-insurance-do-you-need.html", "passage_text": "The best reason to consider whole-life or universal-life insurance isn’t the accumulating cash value, although that’s part of the deal. The real issue is whether you’ll need coverage beyond 20 or 30 years -- or after age 65, when term gets expensive. Also consider how many years you’ll need insurance. If you’re in fine physical shape, you can buy a new policy and lock in the price for 20 years. Because prices for term have been dropping steadily, you may not pay much more to extend your coverage if you reshop in, say, five years."}, {"url": "http://www.bankrate.com/calculators/insurance/life-insurance-calculator.aspx", "passage_text": "Based on your answers to the following questions, we'll provide you with an estimate of how much life insurance coverage would be best for your situation. We can also help you find the best insurance rates. "}, {"url": "http://www.lifehappens.org/insurance-overview/life-insurance/calculate-your-needs/", "passage_text": "When purchasing life insurance, the question really isn’t how much you need, but how much capital your family will need at the time of your death, which depends on two variables: 1) How much will be needed at death to meet immediate obligations? Includes individual policies, group term coverage available through work, and any other life insurance on your life payable to your family or for the benefit of your family. Do not include accidental death insurance or “double indemnity” insurance."}]