[{"url": "http://richshomeblog.com/blog/2010/07/delicious-grilling-recipes-from-traeger.html", "passage_text": "1 Start your Traeger on smoke.. 2  After fire starts, set to high.” Preheat for 5 minutes. 3  Place whole chicken on grill and cook about 1 hour 20 minutes, or until internal temperature reaches 180 degrees. 4  Remove from grill. 1 After fire starts, set to high.” Preheat for 5 minutes. 2  Place whole chicken on grill and cook about 1 hour 20 minutes, or until internal temperature reaches 180 degrees. 3  Remove from grill. 4  Let rest 20 minutes before eating."}, {"url": "http://www.willamettegraystone.com/pdf/Traegers-Everyday-Cookbook.pdf", "passage_text": "When ready to cook, start the Traeger grill on Smoke with the lid open until the fire is established (4 to 5 minutes). Set the temperature to 275 degrees F and preheat, lid closed, for 10 to 15 minutes. Put the corned beef brisket directly on the grill grate, fat side up, and cook for 2 hours. BEEF 25 Season the steaks with the Traeger Prime Rib Rub, patting it on with your fingertips. When ready to cook, start the Traeger grill on Smoke with the lid open until the fire is established (4 to 5 minutes). Set the temperature to 450 degrees F (High) and preheat, lid closed, for 10 to 15 minutes."}, {"url": "http://www.willamettegraystone.com/pdf/Traegers-Everyday-Cookbook.pdf", "passage_text": "When ready to cook, start the Traeger grill on Smoke with the lid open until the fire is established (4 to 5 minutes). Smoke the ribs, meat-side up, for 2 hours. Set the temperature to 225 degrees F. Continue to cook the ribs for 3 to 4 hours more, or until the meat is tender. BEEF 25 Season the steaks with the Traeger Prime Rib Rub, patting it on with your fingertips. When ready to cook, start the Traeger grill on Smoke with the lid open until the fire is established (4 to 5 minutes). Set the temperature to 450 degrees F (High) and preheat, lid closed, for 10 to 15 minutes."}, {"url": "http://www.willamettegraystone.com/pdf/Traegers-Everyday-Cookbook.pdf", "passage_text": "When ready to cook, start the Traeger grill on Smoke with the lid open until the fire is established (4 to 5 minutes). Set the temperature to 425 degrees F and preheat, lid closed, for 10 to 15 minutes. Lay the tri-tip directly on the grill grate and cook for 45 to 50 minutes. BEEF 25 Season the steaks with the Traeger Prime Rib Rub, patting it on with your fingertips. When ready to cook, start the Traeger grill on Smoke with the lid open until the fire is established (4 to 5 minutes). Set the temperature to 450 degrees F (High) and preheat, lid closed, for 10 to 15 minutes."}, {"url": "http://richshomeblog.com/blog/2010/07/delicious-grilling-recipes-from-traeger.html", "passage_text": "1 Season with Traeger Chicken Rub and let sit for 30 minutes. 2  Start your Traeger on smoke.. 3  After fire starts, set to high.” Preheat for 5 minutes. 4  Place whole chicken on grill and cook about 1 hour 20 minutes, or until internal temperature reaches 180 degrees. 1 After fire starts, set to high.” Preheat for 5 minutes. 2  Place whole chicken on grill and cook about 1 hour 20 minutes, or until internal temperature reaches 180 degrees. 3  Remove from grill. 4  Let rest 20 minutes before eating."}, {"url": "http://www.willamettegraystone.com/pdf/Traegers-Everyday-Cookbook.pdf", "passage_text": "When ready to cook, start the Traeger grill on Smoke with the lid open until the fire is established (4 to 5 minutes). Arrange the steaks on the grill grate and smoke for 30 minutes. Set the temperature to 450 degrees F (High), and preheat, lid closed, for 10 to 15 minutes. BEEF 25 Season the steaks with the Traeger Prime Rib Rub, patting it on with your fingertips. When ready to cook, start the Traeger grill on Smoke with the lid open until the fire is established (4 to 5 minutes). Set the temperature to 450 degrees F (High) and preheat, lid closed, for 10 to 15 minutes."}, {"url": "https://lindakruschke.wordpress.com/2011/06/17/traeger-chicken-for-recipe-friday/", "passage_text": "Rub each breast with Traeger Pork and Poultry Shake. (You can actually use any spices you like for chicken, but on this particular night, I used the Traeger Shake.) Place the chicken breasts on the grill. Cook for 20 minutes and turn. Cook for another 20 – 30 minutes, or until chicken is cooked through. The cooking time depends on the thickness of the chicken pieces. Chicken on the Traeger. Note about quantity: I always get the value pack of chicken, in this case the package I bought was almost 4 pounds."}, {"url": "http://richshomeblog.com/blog/2010/07/delicious-grilling-recipes-from-traeger.html", "passage_text": "1 Place whole chicken on grill and cook about 1 hour 20 minutes, or until internal temperature reaches 180 degrees. 2  Remove from grill. 3  Let rest 20 minutes before eating. 4  Lightly sprinkle Traeger shake on the ribs. 1 After fire starts, set to high.” Preheat for 5 minutes. 2  Place whole chicken on grill and cook about 1 hour 20 minutes, or until internal temperature reaches 180 degrees. 3  Remove from grill. 4"}, {"url": "http://pelletheads.com/index.php?topic=3026.0", "passage_text": "I use a rub-no marinade or sauce. I smoke the thighs for 30 minutes, then crank up the grill to 350 or 375 until internal temp is about 180 degrees. Nice crispy skin, tender, juicy, smokey meat. You cannot beat thighs on a Traeger. I saw a KCBS competitor use a Traeger Lil Tex in a competition in which he used this grill for chicken thighs only. Other meats were cooked in a FEC 100. He placed almost at the top of the chicken category so I KNOW MY Lil Tex (180LV controller) is capable of cooking comp quality meats."}]