[{"url": "http://www.forksoverknives.com/do-vegetarians-and-vegans-eat-enough-protein/", "passage_text": "1 The average recommended intake of protein is 42 grams a day. 2  Non-vegetarians eat way more than that (almost 80 grams), but so does everyone else. 3  Vegetarians and vegans actually average 70% more protein than they need every day (over 70 grams). "}, {"url": "http://www.health.harvard.edu/blog/how-much-protein-do-you-need-every-day-201506188096", "passage_text": "To determine your RDA for protein, you can multiply your weight in pounds by 0.36, or use this online protein calculator. For a 50-year-old woman who weighs 140 pounds woman and who is sedentary (doesn’t exercise), that translates into 53 grams of protein a day. "}, {"url": "http://www.webefit.com/Calculators/Calc_protein.html", "passage_text": ".73 to .78 grams of protein per pound of bodyweight per day. In this category that 180 pound person would need 131 to 140 grams of protein each day. ENDURANCE &TRENGTH TRAINING is the same as strength training. .73 to .78 grams of protein per pound of bodyweight per day. In this category that 180 pound person would need 131 to 140 grams of protein each day. If you're a VEGETARIAN it is suggested you increase your protein intake above suggested levels by another 10%. That means a 180 pound person would need to take in about 58 grams of protein every day. But that's not the final word, there are several other variables. If you're a vegetarian, the number goes up. If you engage in endurance training, the number goes up. If you lift weights"}, {"url": "http://vegetarian.lovetoknow.com/How_Much_Protein_Do_I_Need", "passage_text": "However, the protein RDA is based on a formula that includes weight (0.8 grams/kg/day for adults). Depending on your weight, your protein needs may be higher or lower than the RDA. To determine your specific protein requirements, follow these steps: 1  Divide your weight by 2.2 to determine how much you weigh in kilograms. "}, {"url": "https://answers.yahoo.com/question/index?qid=20100209181230AAYhRsd", "passage_text": "Best Answer: The RDA for protein is 0.36 grams per pound of body weight (for a healthy adult). Thats only 36 grams per day. People don't need that much protein. Only 10-30 percent of total daily calories should come from protein. A bowl of rice and beans has enough protein to get you through one day. Its a myth that vegetarians don't get enough protein (as long as they eat a balanced diet). For healthy adolescents, the guideline is 1 gram for every kilogram of body weight (adults need less). To find out your weight in kilos, divide 100 by 2.2: So, unless you're very physically active, 45 grams a day should do it. Here are some vegetarian protein sources for you: http://www.savvyvegetarian.com/articles/..."}, {"url": "http://www.savvyvegetarian.com/articles/protein-veg-diet3.php", "passage_text": "The body loses about 0.34 g of protein per kg body weight per day. With a safety margin added, apparently we need .45 g/kg per day of ideal protein to replace what's lost. With safety margins for digestion and protein quality, our protein requirement is about .75g/kg. That's 56 grams of protein for a 70 kg man (160 lb, or an average sized guy). "}, {"url": "http://www.webefit.com/Calculators/Calc_protein.html", "passage_text": "According to the Institute of Medicine, Food and Nutrition Board, the average person needs 0.32 grams of protein per pound of body weight. That means a 180 pound person would need to take in about 58 grams of protein every day. But that's not the final word, there are several other variables. If you're a vegetarian, the number goes up. If you engage in endurance training, the number goes up. If you lift weights, the number goes up."}, {"url": "http://www.vrg.org/nutrition/protein.php", "passage_text": "If we do a few calculations we see that the protein recommendation for vegans amounts to close to 10% of calories coming from protein. [For example, a vegan male weighing 174 pounds could have a calorie requirement of 2,600 calories. His protein needs are calculated as 174 pounds x 0.41 g/pound = 71 grams of protein. The recommendation for protein for adult male vegans is around 63 grams per day; for adult female vegans it is around 52 grams per day. It is very easy for a vegan diet to meet the recommendations for protein. Nearly all vegetables, beans, grains, nuts, and seeds contain some, and often much, protein."}, {"url": "http://www.webmd.com/food-recipes/protein", "passage_text": "You need protein for your muscles, bones, and the rest of your body. Exactly how much you need changes with age: 1  Babies need about 10 grams a day. 2  School-age kids need 19-34 grams a day. 3  Teenage boys need up to 52 grams a day. 4  Teenage girls need 46 grams a day. 5  Adult men need about 56 grams a day. "}, {"url": "http://www.nomeatathlete.com/where-vegetarians-get-protein/", "passage_text": "140 pounds * .59 grams/pound = 83 grams of protein per day. Keep in mind that’s for a 140-pound endurance athlete, so you’ll need to plug in your own weight and, if you do a strength sport, use a different protein figure. "}]