[{"url": "http://www.ndaa.org/pdf/Minor%20Consent%20to%20Medical%20Treatment%20(2).pdf", "passage_text": "The consent of the parent, parents, or legal guardian of such minor shall not be necessary to authorize hospital, medical and surgical care related to such disease and such parent, parents, or legal guardian shall not be liable for payment for any care rendered pursuant to this section. ILLINOIS 410 I LL."}, {"url": "http://public.health.oregon.gov/HealthyPeopleFamilies/Youth/HealthSchool/SchoolBasedHealthCenters/Documents/Training1208_MinorConsentStatutes.pdf", "passage_text": "(2) The consent of the parent, parents, or legal guardian of such minor shall not be necessary to authorize such hospital, medical or surgical care and without having given consent the parent, parents, or legal guardian shall not be liable for payment for any such care rendered."}, {"url": "http://www.cahl.org/state-minor-consent-laws-a-summary-third-edition/", "passage_text": "Some of the laws allow minors to consent for health care because they have a specific status – such as emancipated minor – and others allow minors to consent for specific health services – such as testing and treatment for sexually transmitted disease."}, {"url": "http://www.csus.edu/indiv/b/brocks/courses/eds%20245/handouts/week%207/ca_minor_consent.pdf", "passage_text": ". . without the consent of the minor's parent or guardian. “A minor who is 12 years of age or older may consent to medical care and counseling relating to the diagnosis and treatment of a drug or alcohol related problem.” (Cal. Family Code §6929(b))."}, {"url": "http://www.aclupa.org/our-work/duvall-reproductive-freedom-project/minorsaccesstoconfidential/referencecardminorsaccesst/", "passage_text": "Who Can Consent to Health Services. Generally, Pennsylvania law requires the consent of a parent or guardian for the medical treatment of anyone younger than 18 years of age (a “minor”)."}, {"url": "https://www.dhs.wisconsin.gov/clientrights/informedconsent.htm", "passage_text": "Informed consent means written consent voluntarily signed by a patient who is competent and who understands the terms of the consent, or by the patient's legal guardian or the parent of a minor, as permitted under state law, without any form of coercion, or temporary oral consent obtained by telephone. (Wis. Admin."}, {"url": "http://www.aclupa.org/our-work/duvall-reproductive-freedom-project/minorsaccesstoconfidential/referencecardminorsaccesst/", "passage_text": "When a minor has the right to consent, a provider generally may not disclose the minor’s health care information to anyone, including the minor’s parents or guardians, without the minor’s consent, unless there is an explicit exception in the law that permits or requires the disclosure."}]