[{"url": "https://answers.yahoo.com/question/index?qid=20090328083816AAyw9XY", "passage_text": "Best Answer: *Cycle time is the total time from the beginning to the end of your process, as defined by you and your customer. Cycle time includes process time, during which a unit is acted upon to bring it closer to an output, and delay time, during which a unit of work is spent waiting to take the next action."}, {"url": "http://wiki.fool.com/How_to_Calculate_Cycle_Time_Value_Stream", "passage_text": "Step 2. Calculate the cycle time for each specific task occurring within the value stream. Cycle time refers to the amount of time needed to complete a specific task. For example, if welding work for a manufacturing process takes 30 minutes, the cycle time for that step in the value stream is half an hour. If welding happens at multiple steps in the value stream, calculate the cycle time of each welding session separately to maintain the flow of the value stream map."}, {"url": "http://www.inventorycurve.com/Cash_to_Cash_Cycle.html", "passage_text": "Looking at inventory performance improvement through a different lens. Cash to Cash Cycle. Cash is always in season.. The cash to cash cycle (cash conversion cycle) is an easy to use metric to calculate how long cash is tied up in the main cash producing and cash consuming areas: receivables, payables and inventory."}, {"url": "http://www.prenhall.com/weiss_dswin/html/balance.htm", "passage_text": "This time is the product of the number of stations and the cycle time at each station. In this example we have 3 stations each with a cycle time of 10 seconds for a total work time of 30 station-seconds. The time needed to make one unit. This is simply the sum of the task times."}, {"url": "http://www.referenceforbusiness.com/management/Comp-De/Cycle-Time.html", "passage_text": "In finance, performance measures such as cash-to-cash cycle time reflect a company's cash performance. This is the amount of time it takes from the time money is spent on a customer's product for the purchase of components until the cash is recovered from the customer in the form of a payment."}, {"url": "https://answers.yahoo.com/question/index?qid=20090328083816AAyw9XY", "passage_text": "In a nutshell-Cycle Time is the total elapsed time to move a unit of work from the beginning to the end of a physical process. (Note, Cycle Time is not the same as Lead Time). *The amount of time required to turn raw materials in to finished goods is called throughput time, or manufacturing cycle time."}, {"url": "https://en.wikipedia.org/wiki/Duty_cycle", "passage_text": "A duty cycle is the percentage of one period in which a signal is active. A period is the time it takes for a signal to complete an on-and-off cycle. As a formula, a duty cycle may be expressed as: where is the duty cycle, is the time the signal is active, and is the total period of the signal."}, {"url": "http://www.referenceforbusiness.com/management/Comp-De/Cycle-Time.html", "passage_text": "One of many cycle time measures used in management, cycle time is the measure of a business cycle from beginning to end. Production cycle time refers to production activities, such as the total time required to produce a product."}]