[{"url": "http://www.healthguideinfo.com/womens-sexual-health/p67751/", "passage_text": "Neisseria spreads rapidly through the contact of infected parts of the body. Gonorrhea primarily affects the vagina and infections can occur in the throat, eyes, and anus. In this article you will learn the signs and symptoms, transmission, treatment, and what does gonorrhea look like. Gonorrhea is a sexually transmitted disease that is the leading cause for several diseases in women. Over 6,000 new cases of gonorrhea occur per year in the United States alone."}, {"url": "http://www.webmd.com/sexual-conditions/guide/gonorrhea", "passage_text": "A. A. A. Also called the clap or drip, gonorrhea is a contagious disease transmitted most often through sexual contact with an infected person. Gonorrhea may also be spread by contact with infected bodily fluids, so that a mother could pass on the infection to her newborn during childbirth. Both men and women can get gonorrhea. The infection is easily spread and occurs most often in people who have many sex partners. Gonorrhea symptoms in women. 1  Greenish yellow or whitish discharge from the vagina. 2  Lower abdominal or pelvic pain. 3  Burning when urinating. 4  Conjunctivitis (red, itchy eyes). 5  Bleeding between periods. 6  Spotting after intercourse. 7  Swelling of the vulva (vulvitis). 8  Burning in the throat (due to oral sex)."}, {"url": "https://www.healthtap.com/topics/what-does-gonorrhea-look-like-in-the-throat", "passage_text": "Gonorrhea is caused by the bacteria Neisseria gonorrhea. Anyone who has any type of sex can catch gonorrhea. The infection can be spread by contact with the mouth, vagina, penis, or anus. The bacteria grow in warm, moist areas of the body, including the tube that carries urine out of the body (urethra). 2. Get help from a doctor now ›. STD: Gonorrhea is a sexually transmitted infection. It can commonly present with genital, rectal or oral symptoms. In the throat it typically cause a severe exudate in the back of the throat or tonsil area. If left untreated it may cause disseminated symptoms."}, {"url": "https://www.healthtap.com/topics/what-does-gonorrhea-look-like-in-the-throat", "passage_text": "Get help from a doctor now ›. STD: Gonorrhea is a sexually transmitted infection. It can commonly present with genital, rectal or oral symptoms. In the throat it typically cause a severe exudate in the back of the throat or tonsil area. 2. Get help from a doctor now ›. STD: Gonorrhea is a sexually transmitted infection. It can commonly present with genital, rectal or oral symptoms. In the throat it typically cause a severe exudate in the back of the throat or tonsil area. If left untreated it may cause disseminated symptoms."}, {"url": "http://www.medicinenet.com/image-collection/the_clap_gonorrhea_picture/picture.htm", "passage_text": "Get the Latest health and medical information delivered direct to your inbox! Gonorrhea: A bacterial infection that is transmitted by sexual contact. Gonorrhea is one of the oldest known sexually transmitted diseases (STDs), and it is caused by the Neisseria gonorrhoeae bacteria. Men with gonorrhea may have a yellowish discharge from the penis accompanied by itching and burning. "}, {"url": "http://www.std-gov.org/stds/gonorrhea.htm", "passage_text": "Gonorrhea is characterized by thick discharge from the penis or vagina. In addition to male reproductive organs & female genital tract, gonorrhea may infect the rectum, throat, eyes, blood, skin, & joints. "}, {"url": "http://www.cdc.gov/std/Gonorrhea/STDFact-gonorrhea.htm", "passage_text": "Gonorrhea is a sexually transmitted disease (STD) that can infect both men and women. It can cause infections in the genitals, rectum, and throat. It is a very common infection, especially among young people ages 15-24 years. "}, {"url": "http://www.healthguideinfo.com/womens-sexual-health/p67751/", "passage_text": "written by: Finn Orfano • edited by: Emma Lloyd • updated: 4/5/2011. Gonorrhea is a sexually transmitted disease that is very common in the United States. In this article you will learn the signs and symptoms, transmission, treatment, and what does gonorrhea look like. Gonorrhea is a sexually transmitted disease that is the leading cause for several diseases in women. Over 6,000 new cases of gonorrhea occur per year in the United States alone."}]