[{"url": "https://en.wikipedia.org/wiki/Craton", "passage_text": "A craton (/ˈkreɪtɒn/ , /ˈkraetɒn/ , ˈkrætɒn /or/ ; ˈkreɪtən From: greek κράτος kratos) strength is an old and stable part of the continental. Lithosphere having often survived cycles of merging and rifting of, continents cratons are generally found in the interiors of tectonic. plates The word craton was first proposed by the Austrian geologist Leopold Kober in 1921 as Kratogen, referring to stable continental platforms, and orogen as a term for mountain or orogenic belts. Later authors shortened the former term to kraton and then to craton."}, {"url": "http://encyclopedia2.thefreedictionary.com/craton", "passage_text": "Craton. (central continental craton; in Russian, platforma) , one of the main structural elements of the earth’s crust. Cratons are large and relatively stable blocks of the crust, having uniform thickness and measuring several thousand km across. Craton. (krā`tŏn) : see continent continent,largest unit of landmasses on the earth. The continents include Eurasia (conventionally regarded as two continents, Europe and Asia), Africa, North America, South America, Australia, and Antarctica...... Click the link for more information. ."}, {"url": "https://simple.wikipedia.org/wiki/Craton", "passage_text": "A craton is the oldest part of a continental plate. It is an old and stable part of the continental lithosphere. After surviving cycles of merging and rifting of continents, cratons are usually found in the interiors of tectonic plates. Cratonic lithosphere is much older than oceanic lithosphere – up to 4 billion years versus 180 million years. The term craton is used to distinguish the stable portion of the continental crust from regions that are more geologically active and unstable. Cratons can be described as shields, in which the basement rock crops out at the surface, and platforms, in which the basement is overlain by sediments and sedimentary rock"}, {"url": "http://www.thefreedictionary.com/craton", "passage_text": "Noun. 1. craton-the part of a continent that is stable and forms the central mass of the continent; typically Precambrian. continent-one of the large landmasses of the earth; there are seven continents; pioneers had to cross the continent on foot. "}, {"url": "http://bio-geo-terms.blogspot.com/2007/10/craton.html", "passage_text": "Cratons have peristed for more than 500 million years (some over 2 billion years). A shield is defined as a craton in which basement rocks have been exposed by erosion at the surface; and such shields typically comprise Precambrian basement rocks. "}, {"url": "https://en.wikipedia.org/wiki/Craton", "passage_text": "The term craton is used to distinguish the stable portion of the continental crust from regions that are more geologically active and unstable. Cratons can be described as shields, in which the basement rock crops out at the surface, and platforms, in which the basement is overlaid by sediments and sedimentary rock. The word craton was first proposed by the Austrian geologist Leopold Kober in 1921 as Kratogen, referring to stable continental platforms, and orogen as a term for mountain or orogenic belts. Later authors shortened the former term to kraton and then to craton"}, {"url": "https://en.wikipedia.org/wiki/North_American_craton", "passage_text": "In eastern and central Canada, much of the stable craton is exposed at the surface as the Canadian Shield; when subsurface extensions are considered, the wider term Laurentian Shield is more common, not least because large parts of the structure extend outside Canada. Many times in its past, Laurentia has been a separate continent as it is now in the form of North America, although originally it also included the cratonic areas of Greenland and also the northwestern part of Scotland, known as the Hebridean Terrane."}, {"url": "https://en.wikipedia.org/wiki/Craton", "passage_text": "A craton (/ˈkreɪtɒn/ , /ˈkraetɒn/ , ˈkrætɒn /or/ ; ˈkreɪtən From: greek κράτος kratos) strength is an old and stable part of the continental. lithosphere The word craton was first proposed by the Austrian geologist Leopold Kober in 1921 as Kratogen, referring to stable continental platforms, and orogen as a term for mountain or orogenic belts. Later authors shortened the former term to kraton and then to craton."}]