[{"url": "http://www.shmoop.com/book-thief/summary.html", "passage_text": "The Book Thief is narrated by Death, who tells us the story of Liesel Meminger. It's January 1939, and Liesel, who is about ten-years-old, is traveling by train with her mother and her little brother Werner."}, {"url": "http://www.gradesaver.com/the-book-thief/study-guide/summary", "passage_text": "Narrated by Death, The Book Thief is the story of Liesel Meminger, a nine-year-old German girl who given up by her mother to live with Hans and Rosa Hubermann in the small town of Molching in 1939, shortly before World War II."}, {"url": "http://www.imdb.com/title/tt0816442/", "passage_text": "Storyline. In 1938, the young girl Liesel Meminger is traveling by train with her mother and her younger brother when he dies. Her mother buries the boy in a cemetery by the tracks and Liesel picks up a book, The Gravediggers Handbook, which was left on the grave of her brother and brings it with her."}, {"url": "http://www.npr.org/templates/story/story.php?storyId=5318749", "passage_text": "NPR's John Ydstie interviews Markus Zusak, author of The Book Thief, a novel set in World War II Germany with Death himself as the narrator. The book tells the story of Liesel Meminger, a young girl who lives with a foster family in a tough, working-class neighborhood of Molching, Germany."}, {"url": "https://en.wikipedia.org/wiki/The_Book_Thief", "passage_text": "Plot [edit]. The Book Thief is a novel that centers around the life of Liesel Meminger, a nine-year-old girl living in Germany during World War II."}, {"url": "http://www.usatoday.com/picture-gallery/life/movies/2013/08/04/meet-the-young-star-of-the-book-thief/2617143/", "passage_text": "Meet the young star of The Book Thief. Director Brian Percival took a big chance with Sophie Nelisse for The Book Thief giving the 12-year-old girl the central role in the movie adaptation of the international best seller. She was wonderful to work with, says Percival."}, {"url": "http://www.usatoday.com/picture-gallery/life/movies/2013/08/04/meet-the-young-star-of-the-book-thief/2617143/", "passage_text": "Meet the young star of The Book Thief. Last Slide Next Slide. Director Brian Percival took a big chance with Sophie Nelisse for The Book Thief giving the 12-year-old girl the central role in the movie adaptation of the international best seller. She was wonderful to work with, says Percival."}]