[{"url": "http://www.ehow.com/info_8484450_much-make-2-year-degrees.html", "passage_text": "National Associate’s Degree Salaries. According to PayScale, the pay range for an RN with an ADN is $21.76 to $29.66 an hour, or $45,260 to $61,692 per year. These figures are based on data from the 25th to 75th percentiles. Registered nurses with ASNs earn $21.15 to $29.95 an hour, or $43,992 to $62,296 annually. ADN and ASN degrees normally take two years to complete, although some three-year programs exist. Employment status also determines how long it takes to complete an RN associate degree, as working full-time makes completing an associate degree in two years difficult."}, {"url": "http://work.chron.com/much-rn-associate-degree-make-10742.html", "passage_text": "The survey found that nurses with an associate's degree averaged $65,698 per year, while those with a bachelor's degree reported an average of $63,580 per year. While the average entry-level pay for RNs was $44,343 a year, this jumped to an average of $57,882 per year for those who had been in the field between six and 10 years. After 10 years in the profession, the survey found that average salaries tended to level out at about $70,000 per year."}, {"url": "http://work.chron.com/much-rn-associate-degree-make-10742.html", "passage_text": "Most registered nurses hold a diplomoa from a hospital nursing school, a two-year associate's degree or a bachelor's of science in nursing. According to a salary survey by RN Magazine in 2009, obtaining a bachelor's degree doesn't necessarily translate into more money, and in fact may translate into less. While the average entry-level pay for RNs was $44,343 a year, this jumped to an average of $57,882 per year for those who had been in the field between six and 10 years. After 10 years in the profession, the survey found that average salaries tended to level out at about $70,000 per year."}, {"url": "http://www.collegeatlas.org/nurse-salaries.html", "passage_text": "A Labor and delivery nurse’s salary can span a wide range, making it a bit more difficult to pinpoint just how much Labor and Delivery nurses make. On average, their salaries are set anywhere from $40,000 to 90,000 per year depending on experience, education, employer and location. As of 2011, the average median nursing salary for those specializing in hospice care exceeded $65,000 per year. Hospice nurses providing home care with salaries in the upper 10th percentile earn more than $77,000 per year. Hospice nurses practicing in New York City earn the highest salaries, averaging $77,810 annually."}, {"url": "http://www.ehow.com/info_8484450_much-make-2-year-degrees.html", "passage_text": "According to PayScale, the pay range for an RN with an ADN is $21.76 to $29.66 an hour, or $45,260 to $61,692 per year. These figures are based on data from the 25th to 75th percentiles. ADN and ASN degrees normally take two years to complete, although some three-year programs exist. Employment status also determines how long it takes to complete an RN associate degree, as working full-time makes completing an associate degree in two years difficult."}, {"url": "http://work.chron.com/much-rn-make-bsn-11290.html", "passage_text": "RN Magazine reported in 2009 that starting pay for nurses was $23 per hour, or $44,343 per year, on average. Nurses who have put in 11 to 15 years of experience see their pay jump considerably to an average of $33 an hour, or $71,459 a year. Related Reading: Advantages of a BSN Degree in Nursing. The BLS notes that nurses working in outpatient centers and physician's offices were among the highest-paid by employment setting in 2011, averaging between $72,000 and $73,000 per year. Those employed at specialty hospitals average even more, $74,31"}, {"url": "http://www.collegeatlas.org/nurse-salaries.html", "passage_text": "Nurses with 10 to 19 years of neonatal nursing experience earn high annual salaries, averaging between $80,901 and $104,313 per year. The most experienced neonatal nurse practitioners, 20 or more years of work experience, on average earn more than $111,000 per year. As of 2011, the average median nursing salary for those specializing in hospice care exceeded $65,000 per year. Hospice nurses providing home care with salaries in the upper 10th percentile earn more than $77,000 per year. Hospice nurses practicing in New York City earn the highest salaries, averaging $77,810 annually."}, {"url": "http://work.chron.com/much-rn-associate-degree-make-10742.html", "passage_text": "RNs working in specialty hospitals also reported higher than average earnings, about $74,310 per year. Those employed at physician's offices and outpatient clinics averaged between $72,000 and $73,000 per year, while general hospitals -- the largest employer of registered nurses -- paid an average of $69,810 a year. While the average entry-level pay for RNs was $44,343 a year, this jumped to an average of $57,882 per year for those who had been in the field between six and 10 years. After 10 years in the profession, the survey found that average salaries tended to level out at about $70,000 per year."}, {"url": "http://www.registerednursern.com/registered-nurse-rn-salary-pay-wages-and-income-of-registered-nurses/", "passage_text": "The starting salary of a Registered Nurse can range from around $28,000-$50,000 per year on average. The starting hourly wage of an RN can range from $16.50-26.00 per hour. This salary will increase over time, as nurses gain experience, certifications, and specialize in a specific area. According to the Bureau of Labor Statistics lastest data, the average salary of a registered nurse in the United States is $69,790. The average hourly wage of a registered nurse is $33.55."}]