[{"url": "https://en.wikipedia.org/wiki/Sedona,_AZ", "passage_text": "Sedona /sɨˈdoʊnə/ is a city that straddles the county line between Coconino and Yavapai counties in the northern Verde Valley region of the U.S. state of Arizona. As of the 2010 census, its population was 10,031. Sedona Red Rock High School (SRRHS), built in 1994, is located on the western edge of town in West Sedona. The school's mascot is the Scorpion. The high school's new campus, a series of single story buildings, is located opposite the Sedona campus of Yavapai College."}, {"url": "http://www.travelmath.com/nearest-airport/Sedona,+AZ", "passage_text": "Major airports near Sedona, Arizona: The nearest major airport is Flagstaff Pulliam Airport (FLG / KFLG). This airport has domestic flights from Flagstaff, Arizona and is 25 miles from the center of Sedona, AZ. Nearest airports. Travelmath helps you find the closest airport to any city, as well as a list of smaller local airports. You can use these pages to plan your trip and figure out the easiest way to get to your destination."}, {"url": "http://visitsedona.com/", "passage_text": "WELCOME TO SEDONA. Sedona exists at an impossible intersection of soul-nourishing wilderness and pampered luxury—where soaring red rock monoliths cradle an array of resorts, spas, art galleries and boutique wineries. Our singer/songwriter of “Sedona Skies” Brittanny Bickman was born and raised in Phoenix, Arizona. "}, {"url": "https://en.wikipedia.org/wiki/List_of_cities_and_towns_in_Arizona", "passage_text": "As of 2010, Phoenix, the capital and largest city in Arizona, is ranked as the sixth most populous city in the United States. Other Arizona cities among the 100 most populous in the country are Tucson, Mesa, Glendale, Chandler, Gilbert and Scottsdale. Its capital Phoenix is one of the country's largest cities. There are 91 incorporated cities and towns in the U.S. state of Arizona as of 2010. Incorporated places in Arizona are those that have been granted home rule, possessing a local government in the form of a city or town council."}, {"url": "http://wikitravel.org/en/Sedona", "passage_text": "By car [edit]. Sedona is located approximately 90 minutes north of Phoenix, Arizona. From Phoenix, take I-17 north to the Sedona-Oak Creek Canyon exit (exit 298), where you turn west onto SR 179. The Village of Oak Creek is seven miles down this road, and Sedona is another seven. Sedona is surprisingly sprawling, with Oak Creek to the south, West Sedona and Uptown Sedona each providing great views, hikes, dining and arts. Sedona is an outstanding place to experience new-age left wing counterculture Americana. The locals lean far to the left of center, but are warm and welcoming to outsiders."}, {"url": "http://www.azjerome.com/jerome/", "passage_text": "Located high on top of Cleopatra Hill (5,200 feet) between Prescott and Flagstaff is the historic copper mining town of Jerome, Arizona. Once known as the wickedest town in the west, Jerome was a copper mining camp, growing from a settlement of tents to a roaring mining community. Founded in 1876, Jerome was once the fourth largest city in the Arizona Territory. The population peaked at 15,000 in the 1920’s. The Depression of the 1930’s slowed the mining operation and the claim went to Phelps Dodge, who holds the claim today."}, {"url": "http://www.azjerome.com/jerome/", "passage_text": "Jerome is located in the heart of northern Arizona only 90 miles from Phoenix, 60 miles from Flagstaff, 20 miles from Sedona, 30 miles from Prescott, 20 miles from Camp Verde, 10 miles from Cottonwood and about 6 miles from Clarkdale. You can even make a day trip to the Grand Canyon from here. Founded in 1876, Jerome was once the fourth largest city in the Arizona Territory. The population peaked at 15,000 in the 1920’s. The Depression of the 1930’s slowed the mining operation and the claim went to Phelps Dodge, who holds the claim today."}, {"url": "https://sedonaaz.gov/", "passage_text": "1 City of Sedona to Participate in Arizona's 14th Annual Cities & Towns Week. 2  Repainting of Fire Lanes in Uptown Sedona and SR 89A Verde Lynx Bus Stops and Loading Zones. 3  City Helps in Photoshoot for National College Football Championship Playoffs. "}, {"url": "http://www.travelmath.com/cities-near/Sedona,+AZ", "passage_text": "Major cities near Sedona, AZ. This is a list of large cities closest to Sedona, AZ. A big city usually has a population of at least 200,000 and you can often fly into a major airport. If you need to book a flight, search for the nearest airport to Sedona, AZ. 1  94 miles to Scottsdale, AZ. 2  95 miles to Glendale, AZ. "}]