[{"url": "http://www.madehow.com/Volume-3/Magnetic-Resonance-Imaging-MRI.html", "passage_text": "Magnetic resonance imaging (MRI) is a medical device that uses a magnetic field and the natural resonance of atoms in the body to obtain images of human tissues. The basic device was first developed in 1945, and the technology has steadily improved since."}, {"url": "http://www.infinityugent.be/research-development/a-history-of-medical-imaging", "passage_text": "Medical Imaging began with radiography after the discovery of x-rays in 1895 by Wilhelm Roentgen, röntgen A german professor of. Physics-x rays were put to diagnostic use very, early before the dangers of ionizing radiation were. discovered"}, {"url": "http://www.imaginis.com/faq/history-of-medical-diagnosis-and-diagnostic-imaging", "passage_text": "Radiology began as a medical sub-specialty in first decade of the 1900's after the discovery of x-rays by Professor Roentgen. The development of radiology grew at a good pace until World War II."}, {"url": "http://www.imaginis.com/faq/history-of-medical-diagnosis-and-diagnostic-imaging", "passage_text": "In the earliest days, a head x-ray coul d require up to 11 minutes of exposure time. Now, modern x-rays images are made in milliseconds and the x-ray dose currently used is as little as 2% of what was used for that 11 minute head exam 100 years ago."}, {"url": "http://www.infinityugent.be/research-development/a-history-of-medical-imaging", "passage_text": "By the 1960's, this made possible a new radiological application: angiography. This is a medical imaging technique used to visualize the inside or lumen of blood vessels and organs of the body, with particular interest in arteries, veins and the heart chambers."}, {"url": "http://www.infinityugent.be/research-development/a-history-of-medical-imaging", "passage_text": "Medical Imaging began with radiography after the discovery of x-rays in 1895 by Wilhelm Roentgen, röntgen A german professor of. physics"}, {"url": "http://web2.uwindsor.ca/courses/physics/high_schools/2006/Medical_Imaging/mrihistory.html", "passage_text": "The History of MRI. MRI, as with all medical imaging techniques, is a relatively new technology with its foundations beginning during the year of 1946. Felix Bloch and Edward Purcell independently discovered the magnetic resonance phenomena during this year, and were later awarded the Nobel Prize in 1952."}]