[{"url": "http://www.answers.com/Q/What_is_the_largest_rock_in_the_world", "passage_text": "The largest monolith in Australia is commonly thought to be Uluru, or Ayers Rock. However, Uluru is only the world's second-largest free-standing single large rock. Its circum … ference is just over 9km, and it rises 349 metres above the surrounding plain. Only one-seventh of the rock is visible above the ground."}, {"url": "http://www.answers.com/Q/What_is_the_largest_rock_in_the_world", "passage_text": "No. The largest monolith in the world is commonly thought to be Uluru, or Ayers Rock. However, Uluru is only the world's second-largest free-standing single, large rock. Its c … ircumference is just over 9km, and it rises 349 metres above the surrounding plain. Only one-seventh of the rock is visible above the ground."}, {"url": "http://www.smh.com.au/news/Western-Australia/Mount-Augustus/2005/02/17/1108500208314.html", "passage_text": "Mount Augustus. The largest monolith in the world. Located 320 km east of Carnarvon, Mount Augustus is the largest monolith in the world. It is 2.5 times larger than Uluru (Ayers Rock) standing 858 m above the surrounding plain and 1105 metres above sea level."}, {"url": "http://www.answers.com/Q/What_is_the_largest_rock_in_the_world", "passage_text": "The largest monolith in the world is commonly thought to be Uluru, or Ayers Rock. However, Uluru is only the world's second-largest free-standing single, large rock. Its circumference is just over 9km, and it rises 349 metres above the surrounding plain. Only one-seventh of the rock is visible above the ground."}, {"url": "http://www.australiasomuchtosee.com/monoliths.htm", "passage_text": "Uluru is accepted as the largest Monolith in Australia and claims to be the largest monolith in the world. It is 3.6 kilometres long, 1.9 kilometres wide 9.4 kilometres around the base and covers 3.33 square kilometres. Uluru is known as Ayres Rock."}, {"url": "https://ca.answers.yahoo.com/question/index?qid=20070625172401AAVJcH3", "passage_text": "ULURU This is the worlds largest Monolith, meaning worlds largest rock. This rock is located 450 km southwest of Alice Springs in the Northern Territory. This rock is 4.25 km long, and 2.5 km wide, 9 km around the base and it is 348.7 metres above the surrounding plain. It is made of a type of sandstone."}]