[{"url": "https://www.jenesco.com/ozone-generator-safe-use.html", "passage_text": "If so, Ozone generators can be used in these spaces while they are occupied, only as long the ozone concentration remains below the safe level specified by OSHA or the EPA. Typically this can be accomplished with an inexpensive machine like our DC-12."}, {"url": "https://www.jenesco.com/ozone-machine.htm", "passage_text": "Ozone Machines. Both the FM-14 and PRO-44 model Ozone Machines are used commercially by automobile detailers. They place the ozone machine on the dashboard, vacate the vehicle, close all the doors and windows, and let the ozone generator run for several hours until all objectionable odors are gone."}, {"url": "http://www.odorfreemachines.com/", "passage_text": "Ozone Generators Oxidize Odors. Ozone shock treatment is a powerful method of odor elimination without the use of chemicals or masking deodorizers. Just place the ozone machine in the space, set the dial and vacate the area during treatment. Then return to an odor free environment."}, {"url": "http://www.odorfreemachines.com/about-ozone/", "passage_text": "Ozone, or O3, is simply a supercharged form of oxygen. We refer to the regular oxygen molecule that we breathe as O2. Ozone is essentially O2 with an extra oxygen atom attached."}, {"url": "http://www.detailking.com/store-home/auto-detailing-equipment/ozone-generators/", "passage_text": "The PRO-8 is a commercial ozone generator designed for use in commercial applications or wherever high ozone output is needed to reduce odors, mold, mildew, and bacteria. It is our most powerful machine with an ozone output of up to 8000 mgph. (8 Grams per hr.) The PRO-8's high output gets the job done quickly."}, {"url": "http://www.wisegeek.com/what-is-an-ozone-machine.htm", "passage_text": "Ozone is generated in an ozone machine through one of two main methods. The first is known as a corona discharge and uses an electrical charge to split the two oxygen atoms. These single atoms then combine with ambient oxygen (O 2) to form ozone (O 3)."}, {"url": "http://www.ozonesolutions.com/OZONE_MACHINE_RENTAL", "passage_text": "In extreme cases where an ozone machine is being used in an environment with very dusty or dirty air, the ozone output may decrease. For these types of situations, we provide simple maintenance instructions for customers who wish to try and improve the output of the ozone machine by removing dust and dirt from inside."}, {"url": "http://www.wisegeek.com/what-is-an-ozone-machine.htm", "passage_text": "An ozone machine is a device that generates ozone, which is a naturally occurring gas in the earth’s atmosphere that is composed of three oxygen atoms (O 3)."}, {"url": "http://www.detailking.com/store-home/auto-detailing-equipment/ozone-generators/", "passage_text": "Take your auto detailing business to the next level and offer car odor remover services by using a commercial grade ozone generator for cars, we offer several affordable models. Many of our ozone generator for car odors are powerful enough to also be used for odor removal in offices, homes and buildings."}, {"url": "http://www.wisegeek.com/what-is-an-ozone-machine.htm", "passage_text": "Often referred to as an ozone generator, an ozone machine is commonly used to improve the air quality of the interior of a room or building by removing strong odors that may be present. More powerful ozone machines may also be used to kill mold and mildew spores and bacteria present in the interior air."}]