[{"url": "http://www.missouricareereducation.org/doc/soilsci/SRLesson2.pdf", "passage_text": "Soil Formation 7Many parent materials are residual and formed in place from some kind of bedrock, like limestone, shale, or sandstone. This material is called residuum (reh­zij­you-um). The kind of bedrock influences the texture of the soil. The characteristics of the soil are determined by the type of parent material, the organisms (plant and animal life on and in the soil), the climate under which the soil­forming factors were (and are presently) active, the topography, and the length of time that the forces of soil formation have been active."}, {"url": "https://en.wikipedia.org/wiki/Soil", "passage_text": "Soil is considered to be the skin of the earth and interfaces with its lithosphere, hydrosphere, atmosphere, and biosphere. Soil consists of a solid phase (minerals and organic matter) as well as a porous phase that holds gases and water. Accordingly, soils are often treated as a three-state system. Soil particles can be classified by their chemical composition (mineralogy) as well as their size. The particle size distribution of a soil, its texture, determines many of the properties of that soil, but the mineralogy of those particles can strongly modify those properties."}, {"url": "http://www.valdosta.edu/~cdenizma/personal/course2_files/soil", "passage_text": "flat-to-undulating = better soil. Soil-Forming Factors. The source of the rock fragments that make up soil is parent material which may be either bedrock or loose sediments transported from elsewhere by water, wind, or ice. Particularly in the early stages of soil formation, the geologic factor sometimes dominates all others. . "}, {"url": "http://www.physicalgeography.net/fundamentals/10u.html", "passage_text": "Instead, pedogenesis is more influenced by factors like parent material, topography, vegetation, and time. The two most important climatic variables influencing soil formation are temperature and moisture. Temperature has a direct influence on the weathering of bedrock to produce mineral particles. This process involves the accumulations of organic matter in the upper layers of the soil. In lower horizons, mineral layers are stained blue-gray because of the chemical reduction of iron. Introduction. Pedogenesis can be defined as the process of soil development."}, {"url": "https://en.wikipedia.org/wiki/Soil_profile", "passage_text": "R) Bedrock: The parent material in bedrock landscapes. This layer denotes the layer of partially weathered bedrock at the base of the soil profile. Unlike the above layers, R horizons largely comprise continuous masses of hard rock that cannot be excavated by hand. Soils formed in situ will exhibit strong similarities to this bedrock layer. R horizons are the layers of partially weathered bedrock at the base of the soil profile. Unlike the above layers, R horizons are composed largely of consolidated masses of hard rock that cannot be excavated by hand."}, {"url": "https://en.wikipedia.org/wiki/Soil", "passage_text": "The mineral material from which a soil forms is called parent material. Rock, whether its origin is igneous, sedimentary, or metamorphic, is the source of all soil mineral materials and the origin of all plant nutrients with the exceptions of nitrogen, hydrogen and carbon. Soil particles can be classified by their chemical composition (mineralogy) as well as their size. The particle size distribution of a soil, its texture, determines many of the properties of that soil, but the mineralogy of those particles can strongly modify those properties."}, {"url": "https://www.txdot.gov/business/resources/specifications/soil-bedrock.html", "passage_text": "Soil varies with parent material (bedrock), climate, plant and animal life, slope of the land, and time. These factors transform an original geologic deposit into a soil profile. The depth of soil ranges from a few inches to hundreds of feet based on these factors. Igneous rocks are found in approximately 20 counties of the Llano Uplift, South Central Texas, and the Trans-Pecos areas. These rocks are derived from cooled and solidified molten rock material, called magma, that was pushed up from the interior of the earth."}, {"url": "http://www.agronomy.lsu.edu/courses/agro2051/Chapter2.pdf", "passage_text": "Soil Formation Soils may be formed in place from rock or formed in weathered rock and minerals that have been transported from where the original rock occurred. Rocks Consist of mixtures of minerals. Igneous Metamorphic Sedimentary Igneous rocks are formed from molten magma and contain primary minerals. Five Factors of Soil Formation Parent material Climate Organisms Topography Time Soils defined-dynamic natural bodies having properties derived from the combined effect of climate and biotic activities, as modified by topography, acting on parent material over time."}, {"url": "http://www-markinfo.slu.se/eng/soildes/berggr.html", "passage_text": "Bedrock is the rock, usually solid, that underlies soil or other unconsolidated, superficial material (regolithes). The most common bedrock in our country is what usually is called the crystalline basement. This was formed roughly one to two billion years ago, through igneous, sedimentary and metamorphic processes. The bedrock is characterised by its rock types. The rock types, igneous, sedimentary and metamorphic rocks are in turn built from combinations of rock-forming minerals. The rock may be dominated by a number of minerals or of one or two separate minerals, called major minerals."}]