[{"url": "http://www.toandfromtheairport.com/newzealand-south.html", "passage_text": "Super Shuttle Desk located in the main terminal, near baggage collection area. Cost: Queenstown Airport to City $15 + $3 for each extra person travelling in same group together to same destination-Exclusive charter of vehicle $40. Contact: For bookings call 0800 748 885 (0800 SHUTTLE)."}, {"url": "http://www.queenstownnz.co.nz/information/taxis%2Dand%2Dshuttles/", "passage_text": "Taxis and shuttles are available directly outside the airport. You can also catch a taxi in the centre of town at a taxi stand, or you can book a taxi over the phone. Throughout winter, there are a number of ski shuttle buses that transfer skiers and snowboarders between Queenstown and the local ski areas. Browse the Queenstown taxi and shuttle operators below."}, {"url": "http://www.taxiautofare.com/nz/taxi-fare/Queenstown-taxi-fare-from-Queenstown-airport-to-Peninsula-Road,-Kelvin-Heights,-Queenstown,-New-Zealand-(hilton-queenstown)", "passage_text": "distance between queenstown airport and peninsula road kelvin heights queenstown new zealand hilton queenstown is 5 92 km travel time from queenstown airport and peninsula road kelvin heights queenstown new zealand hilton queenstown is 10 minutes"}, {"url": "http://www.newzealand.com/au/feature/queenstown-airport-new-zealand/", "passage_text": "Queenstown Airport is located 10 minutes' drive from the town centre, in the suburb of Frankton. Bus. From $8 adult one way-about 25 minutes. The Connectabus services all major hotels and motels every 15 minutes including Queenstown Airport. The fare to downtown Queenstown is $12 for adults and $5.50 for children."}, {"url": "http://www.fourcorners.co.nz/new-zealand/queenstown-airport/", "passage_text": "Taxi fares into Queenstown start from $25 per vehicle but vary between taxi companies. There are two main shuttle companies operating from the airport. Their airport-Queenstown fares range between $7 and $10 per person. Shuttle information can be found in the arrivals concourse and at the information desk."}, {"url": "http://www.taxiautofare.com/nz/taxi-fare/Queenstown-taxi-fare-from-queenstown-airport-to-hamilton-road", "passage_text": "Distance between queenstown airport and hamilton road is 8.76 Km. Travel time from queenstown airport and hamilton road is 15 Minutes. Click below to see a map from queenstown airport to hamilton road! *Actual fare may vary with traffic, road conditions, etc."}]