[{"url": "http://www.investopedia.com/terms/t/technocracy.asp", "passage_text": "DEFINITION of 'Technocracy'. A form of government where decision-makers are chosen for a governing office based on their technical expertise and background."}, {"url": "http://www.investopedia.com/terms/t/technocracy.asp", "passage_text": "A technocracy differs from a traditional democracy in that individuals elected to a leadership role are chosen through a process that emphasizes their relevant skills and proven performance, as opposed to whether or not they fit the majority interests of a population. A form of government where decision-makers are chosen for a governing office based on their technical expertise and background."}, {"url": "https://en.wikipedia.org/wiki/Technocracy", "passage_text": "The word technocracy has also been used to indicate any kind of management or administration by specialized experts (technocrats) in any field, not just physical science, and the adjective technocratic has been used to describe governments that include non-elected professionals at a ministerial level. In the 1930s, through the influence of Howard Scott and the Technocracy movement he founded, the term technocracy came to mean, 'government by technical decision making', using an energy metric of value."}, {"url": "http://www.investopedia.com/terms/t/technocracy.asp", "passage_text": "BREAKING DOWN 'Technocracy'. A politician who is labeled as a technocrat may not possess the political savvy or charisma that is typically expected of people who sway public opinion in favor of electing him or her to a government position. A form of government where decision-makers are chosen for a governing office based on their technical expertise and background."}, {"url": "http://www.businessdictionary.com/definition/technocracy.html", "passage_text": "Show more usage examples... If you are living in a technocracy you will need to find ways to make the political landscape work for you. 7 people found this helpful. The United States of America is no longer a democracy or a capitalist society, it is now completely and unequivocally a technocracy. Definition. Society which is neither a democracy nor a bureaucracy because the real power has shifted from the elected representatives and bureaucrats to technocrats (engineers, managers, scientists)."}, {"url": "https://en.wikipedia.org/wiki/Technocracy", "passage_text": "Technocracy is an organizational structure or system of governance where decision-makers are selected on the basis of technological knowledge. The concept of a technocracy remains mostly hypothetical. In the 1930s, through the influence of Howard Scott and the Technocracy movement he founded, the term technocracy came to mean, 'government by technical decision making', using an energy metric of value."}, {"url": "https://en.wikipedia.org/wiki/Technocracy_movement", "passage_text": "The technocracy movement is a social movement which arose in the early 20th century. Technocracy was popular in the United States and Canada for a brief period in the early 1930s, before it was overshadowed by other proposals for dealing with the crisis of the Great Depression. The ban was lifted in 1943 when it was apparent that 'Technocracy Inc. was committed to the war effort, proposing a program of total conscription.' The movement continued to expand during the remainder of the war and new sections were formed in Ontario and the Maritime Provinces."}, {"url": "https://en.wikipedia.org/wiki/Technocracy", "passage_text": "Some uses of the word technocracy refer to a form of meritocracy, a system where the most qualified are in charge. In the 1930s, through the influence of Howard Scott and the Technocracy movement he founded, the term technocracy came to mean, 'government by technical decision making', using an energy metric of value."}, {"url": "http://www.audioenglish.org/dictionary/technocracy.htm", "passage_text": "• TECHNOCRACY (noun). The noun TECHNOCRACY has 1 sense: 1. a form of government in which scientists and technical experts are in control. Familiarity information: TECHNOCRACY used as a noun is very rare. Dictionary entry details."}]