[{"url": "http://sewisc.org/invasives/invasive-plants/18-leafy-spurge", "passage_text": "Leafy Spurge. (Euphorbia esula). DESCRIPTION: Leafy spurge is a member of the euphorbiaceae family, and ranges 6 to 36 inches in height. Although the plant appears to be delicate, its strength is in its extensive root system. Erect stems support linear, alternate, and apetiolate leaves of a bluish-green hue. It is allelopathic, which means it emits chemicals from its roots that retard the growth or seed germination of other plants. Also, like other exotic invasive plants, it lacks the insects and fungi that preyed on it in its native land. There are a number of spurges that hybridize with leafy spurge."}, {"url": "http://www.invasiveplantatlas.org/subject.html?sub=3405", "passage_text": "Leafy spurge is an erect, perennial, herbaceous plant that grows from 2 to 3.5 ft. (0.6-1.1 m) tall. Leaves are oval-shaped, smooth and 1-4 in. (2.5-10.2 cm) long. The plant produces a milky sap if stem is broken or a leaf is removed. The stem is smooth and bluish-green. "}, {"url": "http://www.cal-ipc.org/ip/management/plant_profiles/Euphorbia_terracina.php", "passage_text": "Euphorbia terracina. Photo courtesy Joseph DiTomaso. Euphorbia terracina (carnation spurge) is a perennial or biennial species(family Euphorbiaceae) found on California s south coast. Carnation spurge forms dense patches in disturbed grasslands, coastal bluffs, dunes, salt marshes, riparian areas and oak woodlands. "}, {"url": "https://bouldercolorado.gov/ipm/noxious-weeds-myrtle-spurge", "passage_text": "Noxious Weeds-Myrtle Spurge. Myrtle Spurge (Euphorbia myrsinites), also called donkey tail or creeping spurge, is one of Colorado's List A noxious weeds, which requires it to be eradicated and prevented from propagating. Myrtle Spurge is an herbaceous plant with fleshy, waxy, grayish-green leaves that spiral around spreading, prostrate stems. It produces small yellow flowers in the early spring. When mature, it is 4 to 12 inches tall, with stems up to 18 inches long."}, {"url": "http://www.invasivespeciesinfo.gov/plants/leafyspurge.shtml", "passage_text": "1 Maps are organized for 43 invasive plant species into five categories: trees, shrubs, vines, herbs, and grasses. 2  Select the desired species to view the distribution information for northern states. Means of Introduction: Introduced accidentally as a seed contaminant (Gucker 2010). Impact: Crowds out native species (Gucker 2010). Current U.S. Distribution 1  : Pest Tracker-Survey Status of Leafy Spurge. 2  USDA. 3  APHIS. 4  Cooperative Agricultural Pest Survey."}, {"url": "http://www.usna.usda.gov/Gardens/invasives.html", "passage_text": "An invasive plant has the ability to thrive and spread aggressively outside its natural range. A naturally aggressive plant may be especially invasive when it is introduced to a new habitat. An invasive species that colonizes a new area may gain an ecological edge since the insects, diseases, and foraging animals that naturally keep its growth in check in its native range are not present in its new habitat. "}, {"url": "http://www.dnr.state.mn.us/invasives/terrestrialplants/herbaceous/leafyspurge.html", "passage_text": "Leafy spurge (Euphorbia esula). Appearance: Perennial herbaceous plant, 2- 3 1/2' tall, erect branching, smooth stems growing from a deep vertical root. Description: Appearance: Perennial herbaceous plant, 2- 3 1/2' tall, erect branching, smooth stems growing from a deep vertical root. Stems, flowers, and leaves emit a white milky sap when broken. Leaves: Alternate, small, oblong to lance-shaped, on the upper part of stem; scale-like on the lower part of the stem."}, {"url": "http://www.invasive.org/species/subject.cfm?sub=3405", "passage_text": "(4.6 m) away. Ecological Threat. Large infestations of Euphorbia esula give the landscape a yellowish tinge due to the yellow bracts. Leafy spurge invades prairies, pastures, and other open areas. It is a major pest of national parks and nature preserves in the western United States. Appearance. Euphorbia esula is an erect, perennial, herbaceous plant that grows from 2-3.5 ft. (0.6-1.1 m) tall. The stem is smooth and bluish-green. The plant produces a milky sap if stem is broken or a leaf is removed. Foliage. Leaves are lance shaped, smooth and 1-4 in. (2.5-10.2 cm) long"}, {"url": "http://www.cal-ipc.org/ip/management/ipcw/pages/detailreport.cfm@usernumber=49&surveynumber=182.php", "passage_text": "Leafy spurge (Euphorbia esula) is a perennial, rhizomatous, erect herb to three feet tall with distinctive bluish green leaves. It reproduces vegetatively from vigorous rootstocks and by seed. The entire plant contains a milky sap and has forked branching. Leaves are alternate, narrow, and long. "}]