[{"url": "http://www.publichealth.va.gov/exposures/agentorange/benefits/survivors.asp", "passage_text": "Agent Orange and Survivors' Benefits. VA offers a wide range of benefits to surviving spouses, dependent children and dependent parents of Veterans who were exposed to Agent Orange and died as the result of diseases related to Agent Orange exposure. Benefits include compensation and health care benefits. "}, {"url": "http://www.va.gov/survivors/", "passage_text": "Welcome to the Office of Survivors Assistance! The Office of Survivors Assistance (OSA) is a Department of Veterans Affairs (VA) program designed to provide dedicated and comprehensive support to Survivors and dependents of deceased Veterans and members of the Armed Services. The Office of Survivors Assistance was established by Public Law 110-389, Title II, Section 222, in October 2008, to serve as a resource regarding all benefits and services furnished by the Department to Survivors and Dependents of deceased Veterans and members of the Armed Forces."}, {"url": "http://moneyover55.about.com/od/socialsecuritybenefits/a/Social-Security-Survivor-Benefits-For-A-Spouse.htm", "passage_text": "1 If you apply for social security survivor benefits between age 60 and your full retirement age, you will receive somewhere between 71 - 99% of your deceased spouse’s basic benefit amount. ( 2 The amount scales up for each month that you are closer to your full retirement age.). When you apply for social security survivor benefits you will need to take the following documents with you: 1  Proof of death—either from a funeral home or death certificate; 2  Your Social Security number, as well as the deceased worker’s;"}, {"url": "http://www.nolo.com/legal-encyclopedia/survivor-benefits-spouses-children-deceased-veterans-service-members.html", "passage_text": "How to Apply for DIC. The first step will be to notify the VA of the veteran’s death by completing a Report of Casualty form. Then complete the VA Form 21-534 application form and submit it to your nearest VA regional office. You can also request the DIC application form by phone at 800-827-1000. The first step is to notify the VA of the veteran’s death by completing a Report of Casualty form. Next, complete the application form for death pension"}, {"url": "http://explore.va.gov/disability-compensation/spouses-dependents-survivors", "passage_text": "Compensation. The Dependency and Indemnity Compensation (DIC) program provides monthly benefits to surviving spouses and dependent children in recognition of the economic loss caused by a Servicemember’s death during military service, or by the death of a Veteran as a result of a service-connected disability. "}, {"url": "http://www.benefits.va.gov/BENEFITS/Applying.asp", "passage_text": "You can appoint a Veteran Service Officer while you apply online. If you prefer to file your claim by paper, complete VA Form 21-526EZ, Application for Disability Compensation and Related Compensation Benefits and mail the application to your local regional benefit office. Education Benefits for Veterans. You can apply for your education benefits using eBenefits.va.gov. If you don't have an eBenefits account, register today. In eBenefits, apply using the Veterans On-line Application (VONAPP) to complete and submit your application online. You can also submit a paper application. To do this, download and complete VA Form 22-1990, Application for VA Education Benefits and mail it to a VA Regional Processing O"}, {"url": "http://www.benefits.va.gov/pension/spousepen.asp", "passage_text": "How to Apply. To apply for Survivors Pension, download and complete VA Form 21-534EZ, “Application for DIC, Death Pension, and/or Accrued Benefits” and mail it to your local regional benefit office. You can locate your local regional benefit office using the VA Facility Locator. The Survivors Pension benefit, which may also be referred to as Death Pension, is a tax-free monetary benefit payable to a low-income, un-remarried surviving spouse and/or unmarried child(ren) of a deceased Veteran with wartime service."}, {"url": "http://www.va.gov/survivors/", "passage_text": "In the course of perusing this Web site, OSA hopes that Survivors and dependents, Veterans, their families, caregivers and others will become more knowledgeable about the benefits and services offered by VA to eligible Survivors and dependents, and take the next steps to apply, if deemed eligible. The Office of Survivors Assistance was established by Public Law 110-389, Title II, Section 222, in October 2008, to serve as a resource regarding all benefits and services furnished by the Department to Survivors and Dependents of deceased Veterans and members of the Armed Forces."}]