[{"url": "http://allrecipes.com/recipe/218486/moms-beef-shish-kabobs/", "passage_text": "1 Whisk the vegetable oil, soy sauce, lemon juice, mustard, Worcestershire sauce, garlic, black pepper, and salt together in a bowl; pour into a resealable plastic bag. 2  Add the beef, coat with the marinade, squeeze out excess air, and seal the bag. 3  Marinate in the refrigerator 8 hours or overnight. Ready In. 1 "}, {"url": "http://www.bettycrocker.com/how-to/tipslibrary/meat-poultry-fish/how-to-make-kabobs", "passage_text": "You can use wooden or metal skewers that are 10 to 12 inches long. Soak wooden skewers in water for at least an hour to prevent burning, and wrap the ends with a small piece of aluminum foil. Meat. Depending on your taste, you can use steak, beef, chicken or shrimp on your kabobs. Just remember, each cook at different times: 1  Beef-About 15 to 20 minutes. 2  Chicken-About 8 to 10 minutes. Preparing a marinade is a great way to add extra flavor to your grilled kabobs. 1  Our herb marinade goes great with beef kabobs. 2  To add a Mediterranean flavor to chicken kabobs, try our rosemary-lemon marinade. 3  Give shrimp kabobs a citrus twist with our pineapple-lime marinade."}, {"url": "http://www.bettycrocker.com/how-to/tipslibrary/meat-poultry-fish/how-to-make-kabobs", "passage_text": "Use mushrooms and a bell pepper for teriyaki beef kabobs. Cherry tomatoes, squash, mushrooms and bell pepper go great with grilled Caesar beef kabobs. Marinades Preparing a marinade is a great way to add extra flavor to your grilled kabobs. Our herb marinade goes great with beef kabobs. Preparing a marinade is a great way to add extra flavor to your grilled kabobs. 1  Our herb marinade goes great with beef kabobs. 2  To add a Mediterranean flavor to chicken kabobs, try our rosemary-lemon marinade. 3  Give shrimp kabobs a citrus twist with our pineapple-lime marinade."}, {"url": "http://www.simplyrecipes.com/recipes/beef_kebabs/", "passage_text": "Method. 1 Mix the marinade ingredients together in a bowl and add the meat. Cover and chill in the fridge for at least 30 minutes, preferably several hours or even overnight. (Heck, I've kept the meat marinating for a couple days, still great.). 2 Soak the skewers in water for at least 30 minutes before grilling. Kebab Ingredients: 1  1 1/2 lbs top sirloin steak, cut into 1 1/2-inch cubes. 2  1 large bell pepper. 3  1-2 medium red onions."}, {"url": "http://www.tasteofhome.com/recipes/steak-and-shrimp-kabobs", "passage_text": "1 Drain and discard. 2  On metal or soaked wooden skewers, alternately thread the beef, shrimp, mushrooms, green peppers, onions and tomatoes; set aside. 3  In a small saucepan, combine cornstarch and reserved marinade until smooth. 4  Bring to a boil; cook and stir for 1-2 minutes or until sauce is thickened. Directions. 1  In a large bowl, combine the first six ingredients. 2  Pour half of the marinade into a large resealable plastic bag; add beef. 3  Seal bag and turn to coat; refrigerate for 8 hours or overnight, turning occasionally. 4  Cover and refrigerate remaining marinade. 5 "}, {"url": "https://answers.yahoo.com/question/index?qid=20090525052922AAJ0ub6", "passage_text": "Answers. Best Answer: Sirloin may not be the best choice for tender kabobs.It depends on how well done you like your beef. If you are wanting them medium well to well done, then I'd go with another cut of beef, say something from the rib like a rib steak or rib eye steak. Toss well to coat all sides of the kabobs. Cover with plastic wrap and refrigerate 4 hours. You can use the marinade as a basting sauce while grilling, if you want more flavor. ** ps. This is also a wonderful marinade for chicken and turkey."}, {"url": "http://www.bettycrocker.com/how-to/tipslibrary/meat-poultry-fish/how-to-make-kabobs", "passage_text": "Grill the kabobs over direct, medium heat. Beef-Cook 4 to 6 inches from the heat for 15 to 20 minutes. Turn frequently, until the beef is no longer pink. Chicken-Grill for about 8 to 10 minutes or until it’s cooked through or slightly charred. Shrimp-Cook until pink for around 4 to 7 minutes. Preparing a marinade is a great way to add extra flavor to your grilled kabobs. 1  Our herb marinade goes great with beef kabobs. 2  To add a Mediterranean flavor to chicken kabobs, try our rosemary-lemon marinade. 3  Give shrimp kabobs a citrus twist with our pineapple-lime marinade."}, {"url": "http://natashaskitchen.com/2014/06/10/tender-beef-kebabs-shashlik-recipe/", "passage_text": "3 Tbsp fresh or frozen dill, chopped (or 1 Tbsp dry dill weed). 2 dry bay leaves. How to Make Tender Beef Kabobs Shashliki: 1. Combine all of your marinade ingredients in a large glass or plastic bowl (do not use aluminum) and stir to combine. 2. Slice meat and transfer it into the marinade bowl, stirring well to coat. Brush/ pour remaining marinade over skewers. 4. Grill steak kabobs over med/high heat for about 8-10 minutes or until you’ve reached the desired doneness, rotating every 2-3 minutes for even grilling. Remove kebobs from grill and let them rest at least 5 minutes before eating."}, {"url": "http://www.southernplate.com/2013/02/steak-kabobs-a-special-meal-on-a-budget.html", "passage_text": "1 Place the beef in a gallon-size ziplock bag and add 1 cup of the marinade. 2  Let the beef marinate in the refrigerator for at least one hour or up to eight hours. 3  Thirty minutes before you plan to cook the kabobs, preheat the oven to 350 and place 8 to 12 wooden skewers in a bowl and cover them with water to soak. Seal well and put in the refrigerator for at least an hour. You can marinate this the night before if you like. Thirty minutes before you’re going to cook your kabobs, place some skewers in a dish filled"}]