[{"url": "http://www.factzoo.com/mammals/types-of-monkeys.html", "passage_text": "See the taxonomy tree (species list and categories) of all kinds of monkeys or also why not to buy a monkey. Or if you have seen enough monkeys how about other mammal facts or types of snakes or lizards. The major difference, besides living on different continents, is that the New World primates have tails that can grasp and hold things while the Old World primates can't do much with their tails and sometimes have no tail at all."}, {"url": "https://en.wikipedia.org/wiki/List_of_primates", "passage_text": "List of primates contains the species in the order Primates and currently contains 16 families and 72 genera. See list of fossil primates for extinct species and List of lemur species."}, {"url": "http://animals.howstuffworks.com/mammals/monkeys-vs-apes1.htm", "passage_text": "The apes, which include gorillas, chimpanzees, orangutans and gibbons, are much more like human beings than monkeys or lower primates are. They have the same basic body structure, possess a high level of intelligence and may exhibit similar behavior. Apes, such as gorillas and chimpanzees, have evolved along parallel lines with human beings, and are quite close to us in a number of respects (chimpanzees and humans share 98 percent of their genetic material). On the evolutionary tree, apes are no more monkeys than we are."}, {"url": "http://www.factzoo.com/mammals/types-of-monkeys.html", "passage_text": "Types of Monkeys. Types of monkeys are classified into two major groups, the New World primates (South and Central America) and the Old World primates (Asia and Africa). The major difference, besides living on different continents, is that the New World primates have tails that can grasp and hold things while the Old World primates can't do much with their tails and sometimes have no tail at all."}, {"url": "http://www.livescience.com/27944-monkeys.html", "passage_text": "Monkeys live all over the world and come in various shapes, sizes and colors. As one of our closest relatives, these mammals are very intelligent and have opposable thumbs, allowing them to use tools and play games. There are more than 260 different types of monkeys. "}, {"url": "http://www.monkeyworlds.com/types-of-monkeys/", "passage_text": "1 Monkey Species. 2  There are more than 260 species of Monkeys found in the world today. 3  They are derived from early primates that have been around for millions of years. 4  There isn’t enough information about evolution to say with certainty how they came to be. 1 There are more than 260 species of Monkeys found in the world today. 2  They are derived from early primates that have been around for millions of years. 3"}, {"url": "http://www.brighthub.com/environment/science-environmental/articles/112566.aspx", "passage_text": "Here is an overview of different types of monkeys from both the new world and old world. We have listed a few individual species-their names, origins, features, traits, diets and what makes these amazing creatures so amusing and intriguing to the public. Conclusion. There are 264 different types of monkeys ranging in size from as small as the pygmy marmoset (4 ounces) to as large as the male mandrill (77 pounds). Smaller monkeys belong to the New World group and larger ones to the Old World. Monkeys in general, are very intelligent animals"}, {"url": "http://www.sheppardsoftware.com/content/animals/animals/mammals/apevsmonkey.htm", "passage_text": "Briefly on Monkeys: Monkeys have the most variation among the Primates, and there are many kinds of monkeys. Monkeys themselves are divided into two large categories: Old World Monkeys and New World Monkeys. Old World monkeys live in Africa and Asia, and New World Monkeys live in Central and South America. Prosimians are the most primitive of the primates-sometimes they are referred to as pre-monkeys. There name means before monkeys. Prosimians include animals like lemurs, lorises, and tarsiers. They are the ancestors to monkeys, and apes and live a very different lifestyle."}, {"url": "http://www.brighthub.com/environment/science-environmental/articles/112566.aspx", "passage_text": "There are two categorizations of monkeys – New World and Old World primates. They have quite a few differences; for example their eating habits, infant care, habitat, physical features, etc. Conclusion. There are 264 different types of monkeys ranging in size from as small as the pygmy marmoset (4 ounces) to as large as the male mandrill (77 pounds). Smaller monkeys belong to the New World group and larger ones to the Old World. Monkeys in general, are very intelligent animals"}]