[{"url": "http://www.academia.edu/3660319/Jurisdiction_of_Syariah_Court_In_Malaysia", "passage_text": "- According to Article 121 (1A) of the Federal Constitution, exclusive jurisdiction has been given to the Syariah Court in the administration of Islamic laws-Syariah court have jurisdiction only over Muslims. - As State Courts, they have jurisdiction within the respective State Boundaries only."}, {"url": "http://islamicsupremecouncil.org/understanding-islam/legal-rulings/52-understanding-islamic-law.html", "passage_text": "Shariah is the Islamic Law – the disciplines and principles that govern the behavior of a Muslim individual towards his or herself, family, neighbors, community, city, nation and the Muslim polity as a whole, the Ummah."}, {"url": "http://islamicsupremecouncil.org/understanding-islam/legal-rulings/52-understanding-islamic-law.html", "passage_text": "Islamic civilization, since the time of Prophet Muhammad (s) until now, is firmly founded on the concept of ‘rule of law.’ For that reason, the law is published and known, and citizens and courts are expected to uphold it. In addition, Muslim citizens must adhere to Islamic law-Shariah."}, {"url": "http://blog.ipleaders.in/what-is-jurisdiction/", "passage_text": "Jurisdiction can be defined as the limit of a judicial authority or the extent to which a court of law can exercise its authority over suits, cases, appeals etc."}, {"url": "http://blog.ipleaders.in/what-is-jurisdiction/", "passage_text": "Some of the other types of jurisdiction include: 1  Concurrent jurisdiction: A situation in which more than one court of law has the jurisdiction to try certain matters. 2  Sometimes, this type of jurisdiction is also referred to as ‘co-ordinate jurisdiction’."}, {"url": "https://www.scribd.com/doc/7542936/Civil-and-Syariah-Courts-in-Malaysia", "passage_text": "It is where in one case there are issues which are within the jurisdiction of the civil courts and there are also issues which are within the jurisdiction of the syariah court. A very good example is the case of G. Rethinasamy v. Majlis Agama Islam, Pulau Pinang (1993) 2 M.LJ. 166 (2). The Plaintiff was a non-Muslim."}, {"url": "http://blog.ipleaders.in/what-is-jurisdiction/", "passage_text": "Subject-matter jurisdiction: It can be defined as the authority vested in a court of law to try and hear cases of a particular type and pertaining to a particular subject matter. For example, District Forums established under the Consumer Protection Act, 1986 have jurisdiction over only consumer-related cases."}, {"url": "http://www.cfr.org/religion/islam-governing-under-sharia/p8034", "passage_text": "Government Under God. In Muslim countries where Islam is the official religion, sharia is declared to be a source, or the source, of the law. Examples include Saudi Arabia, Kuwait, Bahrain, Yemen, and the United Arab Emirates, where the governments derive their legitimacy from Islam."}, {"url": "http://www.muslim-lawyers.net/news/datoothman.html", "passage_text": "In certain fields of law there is a definite conflict of jurisdiction between the Shariah Courts and the Civil Courts e.g. (i) Application for Grant for Letter of Administration of a Muslim can only be made in the Civil Courts despite Article 121 (1A)."}]