[{"url": "http://public.wsu.edu/~rlee/biol103/animal2.pdf", "passage_text": "PHYLUM ANNELIDA (segmented worms) The name “Annelida” means “little ring”, which refers to the segments that make up their bodies. As in molluscs, a fluid-filled body cavity, the coelom, is present. Earthworms, leeches, and an assortment of segmented marine worms belong to this phylum. "}, {"url": "https://en.wikipedia.org/wiki/Annelid", "passage_text": "The burrowing of marine polychaetes, which may constitute up to a third of all species in near-shore environments, encourages the development of ecosystems by enabling water and oxygen to penetrate the sea floor. In addition to improving soil fertility, annelids serve humans as food and as bait. Each segment has the same sets of organs and, in most polychaetes, has a pair of parapodia that many species use for locomotion. Septa separate the segments of many species, but are poorly defined or absent in others, and Echiura and Sipuncula show no obvious signs of segmentation."}, {"url": "http://www.ucmp.berkeley.edu/annelida/polyintro.html", "passage_text": "the bristleworms. Of the approximately 9000 species of annelids, more than 8000 are polychaetes. These segmented worms are among the most common marine organisms, and can be found living in the depths of the ocean, floating free near the surface, or burrowing in the mud and sand of the beach. The delicate beauty of many polychaetes make them a favored subject for photography, and several are named after nymphs and goddesses of Greek myth, such as Nereis (the common clam worm) and Aphrodite (the sea mouse). Click on the buttons below to learn more about P"}, {"url": "http://animaldiversity.org/accounts/Annelida/", "passage_text": "By Phil Myers. The annelids include earthworms, polychaete worms, and leeches. All members of the group are to some extent segmented, in other words, made up of segments that are formed by subdivisions that partially transect the body cavity. Segmentation is also called metamerism."}, {"url": "http://www.nhm.org/site/research-collections/polychaetous-annelids/faqs", "passage_text": "The phylum Annelida contains all of the segmented worms, which includes two classes: Polychaeta and Clitellata. The Clitellata contains the earthworms (which includes terrestial, freshwater, and marine species) and leeches (which are also terrestrial, freshwater, and marine). The longest polychaetes have been known to be up to 200 feet long, although these are very threadlike. The vast majority of polychaetes, however, range from less than one third of an inch to only several inches in length. This is why they are so easily overlooked when one is casually exploring the sea shore."}, {"url": "https://en.wikipedia.org/wiki/Annelid", "passage_text": "Most textbooks still use the traditional division into polychaetes (almost all marine), oligochaetes (which include earthworms) and leech-like species. Cladistic research since 1997 has radically changed this scheme, viewing leeches as a sub-group of oligochaetes and oligochaetes as a sub-group of polychaetes. Each segment has the same sets of organs and, in most polychaetes, has a pair of parapodia that many species use for locomotion. Septa separate the segments of many species, but are poorly defined or absent in others, and Echiura and Sipuncula show no obvious signs of segmentation."}, {"url": "http://eol.org/pages/84/overview", "passage_text": "Polychaeta, composed of about 10,000 species, is the larger (and apparently not monophyletic) of the two generally recognized major groups of segmented worms (phylum Annelida) – the other being the Clitellata (earthworms and leeches). "}, {"url": "https://en.wikipedia.org/wiki/Polychaete", "passage_text": "Description [edit]. Polychaetes are segmented worms, generally less than 10 cm (3.9 in) in length, although ranging at the extremes from 1 mm (0.039 in) to 3 m (9.8 ft). They can sometimes be brightly coloured, and may be iridescent or even luminescent."}, {"url": "https://en.wikipedia.org/wiki/Polychaete", "passage_text": "The Polychaeta or polychaetes are a paraphyletic class of annelid worms, generally marine. Each body segment has a pair of fleshy protrusions called parapodia that bear many bristles, called chaetae, which are made of chitin. Indeed, polychaetes are sometimes referred to as bristle worms. Polychaetes are segmented worms, generally less than 10 cm (3.9 in) in length, although ranging at the extremes from 1 mm (0.039 in) to 3 m (9.8 ft). They can sometimes be brightly coloured, and may be iridescent or even luminescent."}]