[{"url": "http://www.merriam-webster.com/dictionary/savory", "passage_text": "Full Definition of SAVORY. : having savor: as b: morally exemplary: edifying c: pleasing to the sense of taste especially by reason of effective seasoning d: pungently flavorful without sweetness. — sa·vor·i·ly \\-rə-lē\\ adverb. — sa·vor·i·ness \\-rē-nəs\\ noun. See savory defined for English-language learners. "}, {"url": "http://www.definitions.net/definition/savory", "passage_text": "Princeton's WordNet (0.00 / 0 votes) Rate this definition: savory (noun). any of several aromatic herbs or subshrubs of the genus Satureja having spikes of flowers attractive to bees. savory, Micromeria juliana (noun). Satureja is a genus of aromatic plants of the family Lamiaceae, related to rosemary and thyme. There are about 30 species called savories, of which summer savory and winter savory are the most important in cultivation."}, {"url": "http://www.audioenglish.org/dictionary/savory.htm", "passage_text": "Hyponyms (each of the following is a kind of savory): summer savory; summer savoury (herb with delicately flavored leaves with many uses). winter savory; winter savoury (resinous leaves used in stews and stuffings and meat loaf). Satureia montana; Satureja montana; winter savory (erect perennial subshrub having pink or white flowers and leathery leaves with a flavor of thyme; southern Europe). Holonyms (savory is a member of...): genus Satureia; genus Satureja; Satureia; Satureja (savory)."}, {"url": "http://painintheenglish.com/case/65", "passage_text": "Sweet and Savory. Once I used the term “savory” to mean the opposite of sweet, i.e., pizza as opposed to ice cream. I used it in a sentence similar to: “In the savory genre, the pizza was the best thing they had.”. My friend, who is a professional writer, told me that he had never heard the word “savory” used to mean something not sweet, and therefore to avoid using it in that sense since many people may get confused. Savory cannot mean sweet-in fact many menu planning guides discuss how to balance your sweets and savories-but does cover a range of what a Yorkshire housewife would consider wholesome, usually hot foods. Biscuits with gravy, for instance, could be a savory."}, {"url": "http://www.audioenglish.org/dictionary/savory.htm", "passage_text": "Satureia hortensis; Satureja hortensis; summer savory (erect annual herb with oval leaves and pink flowers; used to flavor e.g. meats or soups or salads; southeastern Europe and naturalized elsewhere). Satureia montana; Satureja montana; winter savory (erect perennial subshrub having pink or white flowers and leathery leaves with a flavor of thyme; southern Europe). Holonyms (savory is a member of...): genus Satureia; genus Satureja; Satureia; Satureja (savory)."}, {"url": "http://boards.straightdope.com/sdmb/showthread.php?t=633801", "passage_text": "Location: Oakland, CA. Posts: 1,133. The reason I like savory things is because there is a taste that sort of mimics salt. For example, a bagel with cream cheese, tomato and onion tastes salty to me, but just cream cheese and onion or cream cheese and tomato alone do not have the salty taste. I, too, have suddenly noticed this word creeping into American English. I always thought it just meant tasty, but I guess the Brits use it to mean something like meaty. You've got your sweet pies (apple, etc.) and your savory pies (meat pies). But I guess meaty is just one type of savory."}, {"url": "http://www.audioenglish.org/dictionary/savoury.htm", "passage_text": "Hyponyms (each of the following is a kind of savoury): summer savory; summer savoury (herb with delicately flavored leaves with many uses). winter savory; winter savoury (resinous leaves used in stews and stuffings and meat loaf). • SAVOURY (adjective). The adjective SAVOURY has 3 senses: 1. morally respectable or inoffensive. 2. having an agreeably pungent taste. 3. pleasing to the sense of taste. Familiarity information: SAVOURY used as an adjective is uncommon."}, {"url": "http://www.audioenglish.org/dictionary/savory.htm", "passage_text": "Hypernyms (savory is a kind of...): herb; herbaceous plant (a plant lacking a permanent woody stem; many are flowering garden plants or potherbs; some having medicinal properties; some are pests). Holonyms (savory is a member of...): genus Micromeria; Micromeria (large genus of fragrant chiefly Old World herbs). Satureia montana; Satureja montana; winter savory (erect perennial subshrub having pink or white flowers and leathery leaves with a flavor of thyme; southern Europe). Holonyms (savory is a member of...): genus Satureia; genus Satureja; Satureia; Satureja (savory)."}]