[{"url": "http://www.hsbcnet.com/gbm/financial-regulation/mifid", "passage_text": "An Organised Trading Facility is a new concept under MiFID II. The OTF is a multilateral trading system operated by an investment firm or a market operator which allows trading in non-equity instruments (MiFID II does not permit trading of equities on an OTF)."}, {"url": "http://www.emissions-euets.com/internal-electricity-market-glossary/507-multilateral-system", "passage_text": "Multilateral system. Multilateral system means any system or facility operated and/or managed by an investment firm or a market operator in which multiple third-party buying and selling trading interests in financial instruments are able to interact in the system."}, {"url": "http://europa.eu/rapid/press-release_MEMO-07-439_en.htm", "passage_text": "The MiFID is the Markets in Financial Instruments Directive – or Directive 2004/39/EC. It replaces the Investment Services Directive (ISD) which was adopted in 1993. It was agreed unanimously by the Member States and by a strong Parliamentary majority."}, {"url": "http://www.hsbcnet.com/gbm/financial-regulation/mifid", "passage_text": "Under MiFID, clients can be categorised as i) eligible counterparties ii) professional clients or iii) retail clients. MiFID II does not change the category of a client, or the various monetary thresholds and experience levels that eligible counterparties and professional clients are required to meet."}, {"url": "http://www.hsbcnet.com/gbm/financial-regulation/mifid", "passage_text": "A Regulated Market is a multilateral system, (as defined by MiFID), which brings together or facilitates the bringing together of multiple third-party buying and selling interests in financial instruments in a way that results in a contract. For example, the London Stock Exchange (LSE)."}, {"url": "http://www.investopedia.com/terms/m/mifid.asp", "passage_text": "DEFINITION of 'Markets in Financial Instruments Directive-MiFID'. A directive that aims to integrate the European Union's financial markets and to increase the amount of cross border investment orders."}, {"url": "http://www.hsbcnet.com/gbm/financial-regulation/mifid", "passage_text": "The political agreement reached on MAR is subject to agreement on MiFID II, because the new MiFID rules contain part of the regulatory framework on which MAR is based. Notably, it is hoped that the new MiFID will ensure that all types of organised trading are regulated."}, {"url": "http://www.emissions-euets.com/internal-electricity-market-glossary/507-multilateral-system", "passage_text": "We use cookies to ensure that we give you the best experience on our website. If you continue without changing your settings, we'll assume that you agree to receive all cookies on this website. Learn more and refer to our privacy policy."}]