[{"url": "http://www.ourbeagleworld.com/forums/beagle-discussion/49144-how-much-should-my-beagle-weigh.html", "passage_text": "Re: How much should my beagle weigh? Kioko is still a puppy (8 months old), so her weight will be bigger as she matures, but she currently weighs 16 pounds and is 13 tall. I think she looks too skinny, but the vet says this is normal for her age and that she is perfect."}, {"url": "http://www.answers.com/Q/How_much_does_beagles_weigh", "passage_text": "Usually a beagle should weigh from 20-25 pounds (10-12kg), but this can depend entirely on the build and fitness of the dog."}, {"url": "http://dogtime.com/dog-breeds/beagle", "passage_text": "The American Kennel Club recognizes two varieties of Beagle. The 13-inch variety is for hounds that don't exceed 13 inches in height at the shoulder, and the 15-inch variety is for hounds that stand 13 inches to 15 inches at the shoulder. Depending on their height, Beagles weigh between 18 and 30 pounds."}, {"url": "http://www.vetstreet.com/dogs/beagle", "passage_text": "Beagles come in two sizes: 13-inch and 15-inch. The smaller variety includes Beagles who are no taller than 13 inches at the shoulder and weigh 22 to 30 pounds, while the larger variety includes Beagles who are taller than 13 inches but not more than 15 inches and weigh up to 35 pounds."}, {"url": "http://www.beaglepro.com/beagle-weight", "passage_text": "Many owners are concerned about Beagle weight. Let’s talk about this issue, from the newborn to the adult dog. Newborns are tiny, less than a pound. Depending on the size of the dam and sire, a newborn Beagle puppy may weigh anywhere between 5 and 10 ounces. A healthy pup will gain weight each and every day. Those who have a litter are urged to weigh each pup, each day at the same time (morning, for example) and record the results."}, {"url": "http://www.ask.com/pets-animals/much-beagles-weigh-78762888b0ff49", "passage_text": "The AKC has two height categories for beagles: 13 inches and 15 inches. A beagle measuring taller than 15 inches is disqualified. A beagle's height is measured at the withers, the ridge between an animal's shoulder blades."}]