[{"url": "http://www.everydayhealth.com/drugs/macrobid", "passage_text": "Macrobid is the brand name for nitrofurantoin, an antibiotic used to treat or prevent urinary tract infections. Macrobid works by killing the bacteria that cause the infection or by preventing the bacteria from growing."}, {"url": "http://www.fpnotebook.com/ID/Pharm/Ntrfrntn.htm", "passage_text": "A urinary anti-infective agent effective against most gram-positive and gram-negative organisms. Although sulfonamides and antibiotics are usually the agents of choice for urinary tract infections, nitrofurantoin is widely used for prophylaxis and long-term suppression."}, {"url": "http://www.rxlist.com/macrobid-drug.htm", "passage_text": "To reduce the development of drug-resistant bacteria and maintain the effectiveness of Macrobid and other antibacterial drugs, Macrobid should be used only to treat or prevent infections that are proven or strongly suspected to be caused by bacteria."}, {"url": "http://www.rxlist.com/macrobid-drug.htm", "passage_text": "Here is a collection of user reviews for the medication Macrobid sorted by most helpful. See User Reviews. Report Problems to the Food and Drug Administration. You are encouraged to report negative side effects of prescription drugs to the FDA. Visit the FDA MedWatch website or call 1-800-FDA-1088."}, {"url": "https://www.nlm.nih.gov/medlineplus/druginfo/meds/a682291.html", "passage_text": "1 ask your doctor about the safe use of alcohol while you are taking this medication. 2  Alcohol can make the side effects of nitrofurantoin worse. 3  plan to avoid unnecessary or prolonged exposure to sunlight and to wear protective clothing, sunglasses, and sunscreen. 4  Nitrofurantoin may make your skin sensitive to sunlight."}, {"url": "https://www.nlm.nih.gov/medlineplus/druginfo/meds/a682291.html", "passage_text": "1 tell your doctor and pharmacist if you are allergic to nitrofurantoin, any othermedications, or any of the ingredients in nitrofurantoin capsules or syrup. 2  Ask your doctor or pharmacist for a list of the ingredients."}, {"url": "http://www.rxlist.com/macrobid-drug.htm", "passage_text": "Nitrofurantoin is an antibacterial agent specific for urinary tract infections. The Macrobid® brand of nitrofurantoin is a hard gelatin capsule shell containing the equivalent of 100 mg of nitrofurantoin in the form of 25 mg of nitrofurantoin macrocrystals and 75 mg of nitrofurantoin monohydrate."}, {"url": "http://www.rxlist.com/macrobid-drug/indications-dosage.htm", "passage_text": "Here is a collection of user reviews for the medication Macrobid sorted by most helpful. See User Reviews. Report Problems to the Food and Drug Administration. You are encouraged to report negative side effects of prescription drugs to the FDA. Visit the FDA MedWatch website or call 1-800-FDA-1088."}, {"url": "https://www.nlm.nih.gov/medlineplus/druginfo/meds/a682291.html", "passage_text": "Before taking nitrofurantoin, 1  tell your doctor and pharmacist if you are allergic to nitrofurantoin, any othermedications, or any of the ingredients in nitrofurantoin capsules or syrup. 2  Ask your doctor or pharmacist for a list of the ingredients."}]