[{"url": "http://www.thinkbabynames.com/meaning/1/William", "passage_text": "From wil meaning will, desire and helm meaning helmet, protection. For a long time after the Norman conquest in AD 1066, three out of four English boys were given some form of the conqueror 's name, William."}, {"url": "https://en.wikipedia.org/wiki/Williams_(surname)", "passage_text": "Williams is a patronymic form of the name William that originated in medieval England and Wales and later came to be extremely common in Wales. The meaning is derived from son or descendant of William, the Northern French form that also gave the English name William."}, {"url": "http://www.thinkbabynames.com/meaning/1/William", "passage_text": "Short forms and variants came into being with a common basic meaning of will, determined, or resolute. William has remained a royal name in the UK for nearly one thousand years. The firstborn son of the current Prince of Wales is named William. See also Willard."}, {"url": "http://babynames.allparenting.com/list/German_Baby_Names/William/details/", "passage_text": "Baby names meanings search results: The name William is a baby boy name. The name William comes from the German origin. In German The meaning of the name William is: Resolute protector; will. For a long time after the Norman conquest in A.D. 1066 many English boys were given some form of William the Conquer's name. William. The firstborn son of Prince Charles is named William."}, {"url": "http://www.ourbabynamer.com/meaning-of-William.html", "passage_text": "Introduced to Britain by the Normans, the name William is an Anglicized form of the German name Wilhelm. It is derived from the Germanic elements Wil meaning will or determination and helm meaning helmet or protection, guardian."}, {"url": "http://www.sheknows.com/baby-names/name/william", "passage_text": "The name William is a French baby name. In French the meaning of the name William is: Determined protector. Teutonic Meaning: The name William is a Teutonic baby name. In Teutonic the meaning of the name William is: Strong helmet. English Meaning: The name William is an English baby name. In English the meaning of the name William is: Resolute protector; will."}]