[{"url": "http://www.ancestry.com/name-origin?surname=leavell", "passage_text": "Click on a circle in the chart to view Leavell birth and death records. An unusually short lifespan might indicate that your ancestors lived in harsh conditions. A short lifespan might also indicate health problems that were once prevalent in your family. The SSDI is a searchable database of more than 70 million names. You can find out when most of the Leavell families immigrated to the United States. You can focus your search to immigration records dating from that era. Immigration records can tell you an ancestor's name, ship name, port of departure, port of arrival and destination. from the Social Security Death Index (SSDI)."}, {"url": "http://www.babynamespedia.com/meaning/Lovell", "passage_text": "[ 2 syll. lo-vel(l) , lov-e- ll ] The baby boy name Lovell is pronounced as L AH V-ehL †. Lovell is used chiefly in the English language and its origin is Old French. The name is of the meaning little wolf, wolf cub. The first name is derived from the surname, which is itself from the medieval nickname Louvel (Old French) in reference to a shrewd or fierce person. Lovell is an uncommon baby name for boys. At the modest height of its usage in 1911, 0.006% of baby boys were given the name Lovell. Its ranking then was #880. The baby name has since fallen in popularity, and is today of infrequent use."}, {"url": "https://en.wikipedia.org/wiki/Sea_Level_(band)", "passage_text": "After the release of their first album, the group expanded to a septet with the additions of Davis Causey guitar, George Weaver (drummer)| (percussion) and Randall Bramblett (saxophones, keyboards and vocals). That configuration recorded the group's second album, Cats on the Coast, in 1978 (which produced a moderate hit with That's Your Secret). By the time of the third album, On the Edge, Jaimoe and Weaver had both left, replaced by Joe English."}, {"url": "http://www.ancestry.com/name-origin?surname=leavell", "passage_text": "You can find out where the majority of the Leavell families were living before they immigrated to the U.S and learn where to focus your search for foreign records. Immigration records can tell you an ancestor's name, ship name, port of departure, port of arrival, and destination. from the New York Passenger Lists. You can find out when most of the Leavell families immigrated to the United States. You can focus your search to immigration records dating from that era. Immigration records can tell you an ancestor's name, ship name, port of departure, port of arrival and destination. from the Social Security Death Index (SSDI)."}, {"url": "http://www.babynamespedia.com/meaning/Lovell", "passage_text": "Various forms of the surname have been recorded, such as Louvel, Louvell, Lowel, Lowell, Leavell, Lewell, Levell, Lovel, and Lovell. The short form Love later saw a revival among 17th-century English Puritans. Lovell is a variant of the name Lowell (English). Louvell, Lovel (English), Lovelle, Lovet (English), Lovey, and Lowell (English) are variants of Lovell. Lovell is an uncommon baby name for boys. At the modest height of its usage in 1911, 0.006% of baby boys were given the name Lovell. Its ranking then was #880. The baby name has since fallen in popularity, and is today of infrequent use."}, {"url": "http://www.answers.com/Q/What_is_the_nationality_of_the_surname_Allen", "passage_text": "English and Scottish: from a Celtic personal name of great antiquity and obscurity. In England the personal name is now usually spelled Alan, the surname Allen; in Scotland the surname is more often Allan. Various suggestions have been put forward regarding its origin; the most plausible is that it originally meant 'little rock'. The first recorded spelling of the family name is shown to be that of Alriz Sellere. This was dated 1086, in the recordfs known as the Inquisitio Eliensis of Cambridgeshire, during the reign of King William 1st of England, 1066 - 1087."}, {"url": "http://www.bmwmotorcycles.com/us/en/bikes/sportbikes/k1300s/k1300s_color.html", "passage_text": "Color variants for your model. The most effective way to get an impression of which color best suits your particular model is to take a look at all the colors together. For an even better idea of the finished result, click on a model to see an enlarged view in a new window. 1  Light Grey Metallic. 2  Save picture (652x489, 163 kB). 3  Save picture (1024x768, 313 kB)."}, {"url": "http://www.ancestry.com/name-origin?surname=leavell", "passage_text": "Leavell census records. Census records can offer a lot of little known facts about your Leavell ancestors, such as occupation. Occupation can tell you about your ancestors' social status and economic status. You can find out when most of the Leavell families immigrated to the United States. You can focus your search to immigration records dating from that era. Immigration records can tell you an ancestor's name, ship name, port of departure, port of arrival and destination. from the Social Security Death Index (SSDI)."}]