[{"url": "https://www.libertytax.com/tax-resources/family/eligible-dependents-for-tax-purposes/", "passage_text": "1 The standard deduction for a dependent is $3,950 for the 2014 tax year. 2  A qualifying dependent must be a U.S. citizen, U.S. national, or a resident of the U.S., Canada, or Mexico. 3  A spouse can never be a dependent. 4  If you can be claimed as a dependent on someone else’s tax return, you cannot claim anyone as a dependent. NOTE: 1 "}, {"url": "http://www.mass.gov/dor/individuals/filing-and-payment-information/guide-to-personal-income-tax/deductions/child-and-dependent-related-deductions.html", "passage_text": "This deduction is $3,600 for a single dependent and $7,200 for two or more dependents. The deduction is limited to a maximum of $7,200 regardless of the total number of dependent household members. Married filing separate taxpayers do not qualify for this deduction. "}, {"url": "http://www.efile.com/claiming-qualifying-dependents-as-tax-return-deductions/", "passage_text": "The IRS definition of a dependent is: a Qualifying Child or Qualifying Relative for whom you can claim a tax exemption. What Are the IRS Dependent Rules? If someone is your Qualifying Child or Qualifying Relative, then you can claim a tax exemption for them, and you may qualify for additional tax benefits. You can claim one exemption for each dependent. A dependent exemption is technically different from a tax deduction for dependents, because an exemption is subtracted from your adjusted gross income before your taxable income is calculated (after that, tax deductions are subtracted from your taxable income)."}, {"url": "http://finance.zacks.com/tax-deductions-dependent-parents-1161.html", "passage_text": "Filing Status. If you’re unmarried and have a dependent parent, you qualify to file as head of household. This filing status awards you with a greater standard deduction, which reduces your taxable income. Tax rates for the head of household status are also lower, providing a double benefit to your end tax result. Medical Expenses. If you itemize deductions on Schedule A, you may qualify to deduct any medical expenses you pay for your dependent parent. These include expenses such as doctor co-payments, prescriptions, supplemental insurance premiums, vision services and dental costs."}, {"url": "https://www.irs.gov/uac/six-important-facts-about-dependents-and-exemptions-1", "passage_text": "For more information on exemptions, dependents and whether you or your dependent needs to file a tax return, see IRS Publication 501. The publication is available at http://www.irs.gov or can be ordered by calling 800-TAX-FORM (800-829-3676). 1 On a joint return, you may claim one exemption for yourself and one for your spouse. 2  If you’re filing a separate return, you may claim the exemption for your spouse only if they had no gross income, are not filing a joint return, and were not the dependent of another taxpayer. 3  Exemptions for dependents."}, {"url": "http://finance.zacks.com/tax-deductions-dependent-parents-1161.html", "passage_text": "A parent may qualify as your dependent if you pay more than half his expenses and he receives less than a certain amount of taxable income. The taxable income threshold changes on an annual basis, but is usually the same amount as the personal exemption deduction established by the Internal Revenue Service each year. Medical Expenses. If you itemize deductions on Schedule A, you may qualify to deduct any medical expenses you pay for your dependent parent. These include expenses such as doctor co-payments, prescriptions, supplemental insurance premiums, vision services and dental costs."}, {"url": "https://www.irs.gov/publications/p501/ar02.html", "passage_text": "The standard deduction for an individual who can be claimed as a dependent on another person's tax return is generally limited to the greater of: $1,000, or. The individual's earned income for the year plus $350 (but not more than the regular standard deduction amount, generally $6,200). The standard deduction amount depends on your filing status, whether you are 65 or older or blind, and whether another taxpayer can claim an exemption for you. Generally, the standard deduction amounts are adjusted each year for inflation."}, {"url": "https://turbotax.intuit.com/tax-tools/tax-tips/Family/Tax-Exemptions-and-Deductions-for-Families/INF12053.html", "passage_text": "Example of personal and dependent exemptions. For a married couple with three children, the total exemption deduction for 2014 is $19,750 ($3,950 x 5). If the marginal income tax rate for this family is 25 percent, the five exemptions save $4,875 in taxes. Tax exemptions for you and your dependents. An exemption is an amount of money you can subtract from your Adjusted Gross Income, just for having dependents. Personal and dependent exemptions for yourself and qualifying family members reduce the amount of income on which you will be taxed."}, {"url": "http://taxation.lawyers.com/income-tax/who-is-considered-a-dependent-for-tax-reasons.html", "passage_text": "The IRS allows you a $3,800 deduction for each of your dependents. Credits come off your tax bill. If you owe the IRS $1,000 after calculating your taxes, and if you have a $1,000 tax credit, you don’t owe the IRS anything. Having at least one dependent can qualify you for the earned income tax credit. Child dependents can also qualify you for a child care credit and a child tax credit. To claim the child tax credit, your dependent must be younger than 17. To claim the credit for child care, your child must be younger than 13. "}]