[{"url": "http://healthyliving.azcentral.com/long-lunges-start-toning-legs-20643.html", "passage_text": "When you start doing lunges, you may feel your leg muscles getting tighter and firmer within two weeks. Generally speaking, it may take up to four weeks before you actually see toned muscles on your legs. It may take longer if you carry a lot of fat"}, {"url": "http://www.answers.com/Q/How_long_does_it_take_two_tone_muscle", "passage_text": "It all depends on your body and if your doing the right things to achieve your goal. The legs and butt are the easiest to tone and usually take about 2-3 months to tone. Arms … depending on what you work can take up to 4-6 months to tone. If you work on your abs everyday you'll start to see results in 4-6 weeks."}, {"url": "http://healthyliving.azcentral.com/long-muscle-toning-take-11146.html", "passage_text": "Muscle toning occurs when you exercise the muscles in your body in a way that makes you gain muscle mass. This can happen from lifting weights, placing resistance on your muscles from various objects or using your own body weight to make your muscles do extra work."}, {"url": "http://www.womenshealthmag.com/fitness/muscle-definition", "passage_text": "The answer: Depending on how often you exercise and the intensity of your workouts, give it between four to eight weeks for your muscles to get ripped, says Kawamoto."}, {"url": "http://www.livestrong.com/article/455223-how-long-does-muscle-toning-take/", "passage_text": "Both men and women can tone and build their muscles by participating in weight training. How long it takes you to see improved muscle tone from your weight training depends on several factors. Although the rate will vary among individuals, it is likely to take about two months to see muscle toning results."}, {"url": "http://healthyliving.azcentral.com/long-muscle-toning-take-11146.html", "passage_text": "SHARE SHARE TWEET EMAIL. Toning muscles in your body can take anywhere from one month onward, depending on certain factors. The amount of time you spend exercising, the type of exercise you do and your diet are important considerations that affect the timeline."}, {"url": "http://healthyliving.azcentral.com/long-muscle-toning-take-11146.html", "passage_text": "Amount of Time. If you begin a healthy and average regimen of diet and strength training, you can expect to begin showing your new muscle tone in as little as one month. This means that you workout at least three days per week, eat well and make an effort to change your body on a regular basis."}]