[{"url": "https://www.law.cornell.edu/constitution/amendmentxiv", "passage_text": "No state shall make or enforce any law which shall abridge the privileges or immunities of citizens of the United States; nor shall any state deprive any person of life, liberty, or property, without due process of law; nor deny to any person within its jurisdiction the equal protection of the laws. See more ... All persons born or naturalized in the United States, and subject to the jurisdiction thereof, are citizens of the United States and of the state wherein they reside."}, {"url": "http://thomaslegion.net/14thamendmenttotheusconstitution.html", "passage_text": "The 14th Amendment* to the Constitution of the United States guarantees the rights of citizens and other persons: The 14th Amendment to the Constitution was ratified on July 9, 1868, and granted citizenship to “all persons born or naturalized in the United States,” which included former slaves recently freed. The Congress proposed the Fourteenth Amendment to the Constitution of the United States on June 13, 1866. Per Article Five of the Constitution, twenty-eight of the thirty-seven states were needed for ratification of the 14th Amendment. By July 9, 1868, twenty-eight states had ratified the Amendment:"}, {"url": "http://www.14thamendment.us/birthright_citizenship/original_intent.html", "passage_text": "The 14th Amendment to the U.S. Constitution reads in part: All persons born or naturalized in the United States, and subject to the jurisdiction thereof, are citizens of the United States and the State wherein they reside.. "}, {"url": "https://en.wikipedia.org/wiki/Equal_Protection_Clause", "passage_text": "The Equal Protection Clause is located at the end of Section 1 of the Fourteenth Amendment: All persons born or naturalized in the United States, and subject to the jurisdiction thereof, are citizens of the United States and of the State wherein they reside. Doubts about whether Congress could legitimately enact the Civil Rights Bill of 1866 under the then-existing Constitution was one factor that led Congress to begin to draft and debate what would become the Equal Protection Clause of the Fourteenth Amendment."}, {"url": "http://www.answers.com/Q/What_was_the_result_of_the_Fourteenth_Amendment", "passage_text": "Ratified July 9, 1868.   Note: Article I, section 2, of the Constitution was modified by section 2 of the 14th am … endment.   Section 1. All persons born or naturalized in the United States, and subject to the jurisdiction thereof, are citizens of the United States and of the State wherein they reside. The Fourteenth Amendment sets a definition for citizenship, including the Constitutional rights of slaves and their descendants.     Section 1. All persons born or nat … "}, {"url": "https://en.wikipedia.org/wiki/Equal_Protection_Clause", "passage_text": "The Equal Protection Clause is part of the Fourteenth Amendment to the United States Constitution. The clause, which took effect in 1868, provides that no state shall deny to any person within its jurisdiction the equal protection of the laws. Doubts about whether Congress could legitimately enact the Civil Rights Bill of 1866 under the then-existing Constitution was one factor that led Congress to begin to draft and debate what would become the Equal Protection Clause of the Fourteenth Amendment."}, {"url": "https://en.wikipedia.org/wiki/Fourteenth_Amendment_to_the_United_States_Constitution", "passage_text": "The Fourteenth Amendment (Amendment XIV) to the United States Constitution was adopted on July 9, 1868, as one of the Reconstruction Amendments. The amendment addresses citizenship rights and equal protection of the laws, and was proposed in response to issues related to former slaves following the American Civil War. The court does not wish to hear argument on the question whether the provision in the Fourteenth Amendment to the Constitution, which forbids a State to deny to any person within its jurisdiction the equal protection of the laws, applies to these corporations."}, {"url": "http://www.softschools.com/timelines/14th_amendment_timeline/171/", "passage_text": "14th Amendment Timeline Timeline Description: The 14th Amendment is one of the three Reconstruction amendments. One of its main clauses is that anyone born in or naturalized in the United States is a United States citizen, granting citizenship to slaves and former slaves. "}]