[{"url": "http://gardeningsolutions.ifas.ufl.edu/giam/plants_and_grasses/houseplants_foliage/perennials_shade.html", "passage_text": "1 For color in shady areas, use plants that produce light-colored flowers. 2  Dark flowers don't show up as well. 3  Your local county Extension office can verify the reliability of a plant in your county. "}, {"url": "http://www.bhg.com/gardening/flowers/perennials/the-best-perennials-for-shade/", "passage_text": "It's not just the flowers that are beautiful; the gray-green leaves of these shade plants are attractive as well. The plant grows about 12 inches tall and is hardy in Zones 5-8. Test Garden Tip: This plant can be a prolific self-seeder. Select varieties of this shade plant offer dark purple or variegated foliage, or pink or white flowers. Ajuga grows best in Zones 3-9 and grows only 6 inches tall. Test Garden Tip: Ajuga can be a vigorous spreader; it's not the best choice for small spaces."}, {"url": "http://extension.psu.edu/plants/gardening/fact-sheets/trees-shrubs/shade-tolerant-trees-shrubs-and-groundcovers", "passage_text": "Most plants grow best in full sunlight and all plants need some light to survive. The amount of shade a plant is growing under will directly affect the density of the foliage, as well as the flowering and fruiting characteristics. Usually fewer flowers develop on plants in the shade. Frequently, fall color or unique foliage colors (e.g., maroon foliage of ‘wine and roses’ Weigela and red leafed Japanese maples) will not be as intense or maybe greener in color under shade conditions."}, {"url": "http://www.ehow.com/info_7923740_flowering-shade-plants.html", "passage_text": "Begonias. Begonias are a flowering shade plant that features glossy green to bronze foliage and blooms ranging in color from white, yellow, red, orange and pink. There are several different varieties of this plant, and they do well in most zones as long as the soil is kept moist. Dwarf Salvia. This is a flowering variety of sage that produces blooms in shades of purple and red. The blooms and long stems resemble arrows when the plant flowers. They typically do well in zones 8 and 9 but can be planted in zones 4 through 7 if they are well watered and cared for."}, {"url": "http://www.sunset.com/garden/flowers-plants/color-plants-for-shade", "passage_text": "Astilbe hybrids. Feathery, plumelike flowers have an airy quality; they come in shades of pink, salmon, lavender, red, and white above fernlike foliage. A mainstay of shaded perennial borders, they’re also great beside garden pools, along shaded paths, and in pots. Give them moist, rich soil"}, {"url": "http://www.extension.umn.edu/garden/yard-garden/landscaping/gardening-in-shade/", "passage_text": "Gardening in the shade doesn't have to be frustrating. Some plants will tolerate relatively low light, and a few actually thrive in it. You can choose from an array of flowering annuals, perennials, bulbs, and woodland plants for color. Many groundcovers do well in problem areas. In light shade you might even be able to grow a few herbs or leafy vegetables. "}, {"url": "http://www.bhg.com/gardening/flowers/perennials/the-best-perennials-for-shade/", "passage_text": "Lilyturf. Lilyturf (Liriope) is an easy-to-grow favorite shade plant. Loved for its grassy foliage and spikes of blue or white flowers in late summer, as well as its resistance to deer and rabbits, lilyturf is practically a plant-it-and-forget garden resident. It grows best in Zones 5-10 and grows a foot tall. Select varieties of this shade plant offer dark purple or variegated foliage, or pink or white flowers. Ajuga grows best in Zones 3-9 and grows only 6 inches tall. Test Garden Tip: Ajuga can be a vigorous spreader; it's not the best choice for small spaces."}, {"url": "http://www.gardeningknowhow.com/special/shade/shade-tolerant-flowers.htm", "passage_text": "Best shade flowers – Perennials. There is a wide variety of flowers that grow in shade that are also perennials. These shade tolerant flowers can be planted once and will come back with lovely flowers year after year. 1  Astilbe. 2  Bee balm. 3  Bellflowers. 4  Bleeding-Heart. 5  Forget-me-not. Some white flowers that grow in shade are: 1  Alyssum. 2  Astilbe. 3  Begonia. 4  Common Shootingstar. 5  Coral Bells. 6  Dropwort. 7  Heliotrope. 8  Impatiens."}, {"url": "http://www.bhg.com/gardening/flowers/annuals/top-shade-loving-annuals/", "passage_text": "Browallia. Browallia is a surefire pick for adding rich color to your shade garden. This delightful annual bears star-shape flowers in blue, lavender, and white over emerald-green foliage. It's a fast grower that does well in shade or sun. In warm-climate areas it may self-seed, but not to the point of being considered a pest. 1  Learn more about browallia."}]