[{"url": "http://www.nhlbi.nih.gov/health/health-topics/topics/heartattack/", "passage_text": "A heart attack happens when the flow of oxygen-rich blood to a section of heart muscle suddenly becomes blocked and the heart can't get oxygen. If blood flow isn't restored quickly, the section of heart muscle begins to die. Heart attacks are a leading killer of both men and women in the United States. Some of the most common warning symptoms of a heart attack for both men and women are: 1  Chest pain or discomfort. 2  Most heart attacks involve discomfort in the center or left side of the chest."}, {"url": "http://www.webmd.com/lung/copd/tc/copd-flare-ups-topic-overview", "passage_text": "Having other health problems, such as heart failure or an abnormal heartbeat (arrhythmia) may also trigger a flare-up. In some cases, the cause is not known. Here's what happens during an attack: 1  Your lungs may suddenly produce more mucus. 2  Or the airways of your lungs (bronchial tubes) may suddenly get narrower. 3  These two things reduce the airflow in your lungs. 4  And that makes it harder to breathe and makes your coughing worse. 1"}, {"url": "https://www.sharecare.com/health/heart-failure/what-happens-during-heart-failure", "passage_text": "Heart Failure is a chronic, progressive condition where the heart's ability to pump blood has become impaired; either while the heart muscle is squeezing, relaxing, or both. The heart's job is to pump the right amount of blood to all parts of the body; during activities, during an illness, or simply resting. "}, {"url": "http://www.hse.gov.uk/asthma/lungs.htm", "passage_text": "Your lungs-an asthma attack. An asthma attack occurs when the airways of the lung become narrowed causing an obstruction to the flow of air. Symptoms include coughing, wheezing, breathlessness and a tightness in the chest. "}, {"url": "http://www.webmd.com/heart-disease/guide/heart-disease-heart-attacks", "passage_text": "While it is unusual, a heart attack can also be caused by a spasm of a coronary artery. During a coronary spasm, the coronary arteries restrict or spasm on and off, reducing blood supply to the heart muscle (ischemia). More than a million Americans have heart attacks each year. A heart attack, or myocardial infarction (MI), is permanent damage to the heart muscle. Myo means muscle, cardial refers to the heart, and infarction means death of tissue due to lack of blood supply."}, {"url": "https://www.sharecare.com/health/asthma-respiratory-problems/what-happens-lungs-asthma-attack", "passage_text": "There are a number of changes in the lungs during an asthma attack. The muscles that line the airway contract (tighten), which makes the airway narrow. The airway gets inflamed and secretions (fluid), are released into the airway. These changes make it difficult to breathe. The attack happens in your body’s airways, which are the paths that carry air to your lungs. As the air moves through your lungs, the airways become smaller, like the branches of a tree are smaller than the tree trunk. During an asthma attack, the sides of the airways in your lungs swell and the airways shrink. Less air gets in and out of your lungs, and mucous that your body makes clogs up the airways even mor"}, {"url": "http://www.upmc.com/patients-visitors/education/cardiology/Pages/heart-failure-what-happens-body.aspx", "passage_text": "In CHF (congestive heart failure), the heart muscle becomes weaker. When the heart muscle is weakened, it is less forceful in pumping blood throughout the body. Less blood moves out of the heart. The body has several ways to try to keep the same amount of blood flow moving. It is the heart’s job to pump blood to the lungs to pick up oxygen, and then to pump this blood to every part of your body. The heart has two independent pumping systems, one on the right side and one on the left side. Each of these systems has 2 chambers: 1  An atrium (pronounced AY-tree-um)"}, {"url": "http://www.mayoclinic.org/diseases-conditions/asthma-attack/multimedia/asthma/vid-20084746", "passage_text": "Video: An asthma attack. When you're not having asthma symptoms, your airways are clear. Air can easily flow in and out of your lungs. When an asthma attack begins, the smooth muscles around the outside of the tubes may tighten. The airways, or bronchial tubes, in the lungs become inflamed and swollen."}]