[{"url": "http://www.audioenglish.org/dictionary/etna.htm", "passage_text": "• ETNA (noun). The noun ETNA has 2 senses: 1. an inactive volcano in Sicily; last erupted in 1961; the highest volcano in Europe (10,500 feet). 2. a gas burner used in laboratories; has an air valve to regulate the mixture of gas and air. Familiarity information: ETNA used as a noun is rare. Dictionary entry details."}, {"url": "http://www.babynamewizard.com/baby-name/girl/etna", "passage_text": "Comments and insights on the name Etna: | Edit. Mount Etna is a volcano in Italy. It is also the name of a town in Maine and a river in Norway. namecandy-Celebrity baby names, ask the Name Lady, & more."}, {"url": "http://www.thinkbabynames.com/meaning/0/Etna", "passage_text": "Etna /et-na/ [2 sylls.] as a name for girls. Etna's roots are Irish and Gaelic, and the meaning of the name Etna is kernel. Etna is a variant transcription of Eithne (Irish, Gaelic). Compare last name Enna. Kreatif forms: Eaetna, Eteno, Etnaea. "}, {"url": "http://www.babynamespedia.com/meaning/Etna", "passage_text": "Etna has its origins in the Celtic language and it is used largely in Irish. Etna is a variant of Eithne (English, Gaelic, Irish, and Scottish). Etna is rare as a baby name for girls. At the peak of its usage in 1902, 0.005% of baby girls were named Etna. Its ranking then was #914"}, {"url": "http://www.merriam-webster.com/dictionary/etna", "passage_text": "Origin of ETNA. from Mt. Etna, Sicily; from its cone shape. First Known Use: 1829. This word doesn't usually appear in our free dictionary, but the definition from our premium Unabridged Dictionary is offered here on a limited basis. : a device formerly used for heating liquids and consisting of a cup fixed in a saucer in which alcohol is burned."}, {"url": "http://www.merriam-webster.com/dictionary/etna", "passage_text": "Definition of ETNA. : a device formerly used for heating liquids and consisting of a cup fixed in a saucer in which alcohol is burned. ADVERTISEMENT"}, {"url": "http://www.ourbabynamer.com/meaning-of-Etna.html", "passage_text": "Etna is generally used as a girl's name. It consists of 4 letters and 2 syllables and is pronounced Et-na. In the U.S. in 2014 less than 5 girls were given the name. Less than 5 boys were given the name. View the Etna Name Popularity Page to see how the popularity trend for Etna has changed since 1880, or to compare the popularity of Etna to other names. Etna is a variant spelling of Eth"}, {"url": "https://www.aetna.com/legal-notices/aetna-company-names.html", "passage_text": "Aetna is the brand name for products and services provided by one or more of the Aetna group of subsidiary companies. Please make a selection to view Aetna's name related to a state. Aetna Advantage Plans for Individuals. Aetna Life Insurance Company directly and/or through an out-of-state blanket trust. Individual Medical (Part of DE Trust). Aetna Life Insurance Company. Aetna Student Health. Underwritten by Aetna Life Insurance Company (ALIC)."}]