[{"url": "http://www.cigna.com/healthwellness/hw/medical-tests/parathyroid-hormone-hw8101", "passage_text": "Results. A parathyroid hormone (PTH) blood test measures the level of parathyroid hormone in the blood. The test is used to help identify hyperparathyroidism, to find the cause of abnormal calcium levels, or to check the status of chronic kidney disease. Why It Is Done. A test for parathyroid hormone (PTH) is done to: 1  Help identify hyperparathyroidism. 2  Find the cause of an abnormal blood calcium level. 3  Check to see whether a problem with the parathyroid glands is causing the abnormal"}, {"url": "http://www.cigna.com/healthwellness/hw/medical-tests/parathyroid-hormone-hw8101", "passage_text": "A parathyroid hormone (PTH) blood test measures the level of parathyroid hormone in the blood. This test is used to help identify hyperparathyroidism, to find the cause of abnormal calcium levels, or to check the status of chronic kidney disease. Why It Is Done. A test for parathyroid hormone (PTH) is done to: 1  Help identify hyperparathyroidism. 2  Find the cause of an abnormal blood calcium level. 3  Check to see whether a problem with the parathyroid glands is causing the abnormal"}, {"url": "http://www.nytimes.com/health/guides/test/pth/overview.html", "passage_text": "PTH stands for parathyroid hormone. It is a protein hormone released by the parathyroid gland. The parathyroid glands are located in the neck, near or attached to the back side of the thyroid gland. Parathyroid hormone controls calcium, phosphorus, and vitamin D levels in the blood and bone. Release of PTH is controlled by the level of calcium in the blood. Low blood calcium levels cause increased PTH to be released, while high blood calcium levels block PTH release."}, {"url": "https://en.wikipedia.org/wiki/Parathyroid_hormone", "passage_text": "While PTH acts to increase the concentration of ionic calcium (Ca 2+) in the blood, calcitonin, a hormone produced by the parafollicular cells (C cells) of the thyroid gland, acts to decrease ionic calcium concentration. "}, {"url": "https://labtestsonline.org/understanding/analytes/pth/tab/test", "passage_text": "The so-called intact PTH is the most frequently ordered parathyroid hormone test. It is used to help diagnose the cause of a low or high calcium level and to help distinguish between parathyroid-related and non-parathyroid-related causes. It may also be used to monitor the effectiveness of treatment when an individual has a parathyroid-related condition. 1 If calcium levels are low and PTH levels high, then the parathyroid glands are responding appropriately, producing appropriate amounts of PTH. Depending on the degree of hypocalcemia, a health practitioner may investigate a low calcium level further by measuring vitamin D, phosphorus, and magnesium levels."}, {"url": "http://www.lifeextension.com/vitamins-supplements/ItemLC015610/Parathyroid-Hormone-PTH-Intact-Blood-Test", "passage_text": "The parathyroid hormone blood test is used in detecting parathyroid disease, detecting and monitoring other diseases of calcium homeostasis and is used for monitoring individuals undergoing renal dialysis. Parathyroid hormone (PTH) is secreted by the parathyroid glands and acts to increase the concentration of calcium (Ca2+) in the blood. PTH acts upon parathyroid hormone receptors in three parts of the body: Bone — takes calcium out of the bones, making bones less dense."}, {"url": "https://labtestsonline.org/understanding/analytes/pth/tab/test", "passage_text": "1 If calcium levels are high and PTH levels are high, then the parathyroid glands are producing inappropriately high amounts of PTH. 2  A health practitioner may order X-rays or other imaging studies to help determine the cause and evaluate the severity of hyperparathyroidism. 1 If calcium levels are low and PTH levels high, then the parathyroid glands are responding appropriately, producing appropriate amounts of PTH. Depending on the degree of hypocalcemia, a health practitioner may investigate a low calcium level further by measuring vitamin D, phosphorus, and magnesium levels."}, {"url": "http://www.webmd.com/a-to-z-guides/parathyroid-hormone", "passage_text": "Parathyroid Hormone. Guide. A parathyroid hormone (PTH) blood test measures the level of parathyroid hormone in the blood. This test is used to help identify hyperparathyroidism, to find the cause of abnormal calcium levels, or to check the status of chronic kidney disease. PTH controls calcium and phosphorus levels in the blood. "}, {"url": "http://www.healthline.com/health/pth", "passage_text": "Parathyroid hormone (PTH), also known as parathormone, is a hormone released by the parathyroid glands. The four parathyroid glands are located in your neck, next to the thyroid gland. These glands are responsible for managing calcium, vitamin D, and phosphorus levels in the blood and bones. "}, {"url": "http://www.privatemdlabs.com/lp/PTH_Intact.php", "passage_text": "Parathyroid Hormone (PTH), Intact. This test is used for diagnosis of parathyroid disease and other diseases of calcium homeostasis including monitoring patients undergoing renal dialysis. PTH is an 84 amino acid peptide hormone which is responsible for the regulation of serum calcium levels within a narrow range. PTH is secreted in response to decrease in serum calcium levels by increasing the renal reabsorption of calcium and lowering reabsorption of phosphorus."}]