[{"url": "http://www.mayoclinic.org/diseases-conditions/infant-jaundice/basics/definition/CON-20019637", "passage_text": "Definition. Infant jaundice is a yellow discoloration in a newborn baby's skin and eyes. Infant jaundice occurs because the baby's blood contains an excess of bilirubin (bil-ih-ROO-bin), a yellow-colored pigment of red blood cells."}, {"url": "http://americanpregnancy.org/breastfeeding/breastfeeding-and-jaundice/", "passage_text": "Jaundice is a condition that can occur in newborns within 2-3 days of birth. Jaundice is a yellowing of the skin or whites of the eyes. This is caused by elevated bilirubin levels in the newborn’s blood. Jaundice normally appears first on the face and then will move down the body to the chest, abdomen, arms, and legs. Bilirubin is a substance created by the normal breakdown of red blood cells. It is processed and removed by the liver. Jaundice will develop when a baby’s liver is not efficient enough to remove the bilirubin from the bloodstream."}, {"url": "http://www.uofmhealth.org/health-library/ue5531", "passage_text": "Types of Jaundice in Newborns. Jaundice in newborns, which produces a yellow color to the skin and eyes, is caused by a buildup of bilirubin in the blood (hyperbilirubinemia). In the womb, a fetus obtains nutrients and eliminates by-products, such as bilirubin, through the umbilical cord. After birth, the baby's organs take over these jobs. "}, {"url": "http://www.cpmc.org/advanced/pediatrics/patients/topics/jaundice.html", "passage_text": "Blood Group Incompatibility (Rh or ABO problems). If a baby and mother have different blood types, sometimes the mother produces antibodies that destroy the newborn's red blood cells. This causes a sudden buildup of bilirubin in the baby's blood. This type of jaundice usually begins during the first 24 hours of life. Rh problems are now preventable with an injection of RhoGAM to the mother within 72 hours after delivery. This prevents her from forming antibodies that might endanger subsequent babies. Breastfeeding Jaundice. Breastfeeding jaundice occurs in 5% to 10% of newborns. It's caused by insufficient intake of breast milk (calories and fluid). It follows the same pattern as physiological jaundice."}, {"url": "http://www.merckmanuals.com/home/children-s-health-issues/problems-in-newborns/jaundice-in-newborns", "passage_text": "Jaundice may result from serious disorders, such as incompatibility of the newborn’s and mother’s blood type, excessive breakdown of red blood cells, or a severe infection. If jaundice develops in a newborn, parents should call their doctor right away. If jaundice is caused by a disorder, that disorder is treated. Breastfeeding jaundice is common. It develops in 1 of 6 breastfed infants a few days after birth. It occurs in newborns who do not consume enough breast milk (often because the mother's milk has not yet come in well). Newborns who consume less breast milk have fewer bowel movements and thus eliminate less bilirubin."}, {"url": "http://www.webmd.com/parenting/baby/understanding-newborn-jaundice-treatment", "passage_text": "Often, physiologic jaundice -- the type seen in most newborns -- does not require aggressive treatment. It will typically disappear in a few days with frequent feedings and exposure to indirect sunlight at home. Doctors may test the baby 's bilirubin levels during that time to make sure it has not gotten worse. "}, {"url": "http://americanpregnancy.org/breastfeeding/breastfeeding-and-jaundice/", "passage_text": "Physiologic Jaundice. Physiologic Jaundice is the most common and normal type of jaundice in babies. It can affect up to 60% of full term babie s in the first week of life, and it is caused by elevated bilirubin levels. Bilirubin is a substance created by the normal breakdown of red blood cells. It is processed and removed by the liver. Jaundice will develop when a baby’s liver is not efficient enough to remove the bilirubin from the bloodstream."}, {"url": "http://www.webmd.com/parenting/baby/tc/jaundice-in-newborns-hyperbilirubinemia-topic-overview", "passage_text": "Jaundice is a yellow tint to a newborn's skin and the white part of the eyes. It is a sign that there's too much bilirubin in the baby's blood. The word for having too much bilirubin in the blood is hyperbilirubinemia (say hy-per-bil-ih-roo-bih-NEE-mee-uh). Jaundice usually appears in the first 5 days of life. Many babies have left the hospital by the time jaundice starts. So your doctor may want to do a follow-up exam when your baby is 3 to 5 days old. Most babies have mild jaundice."}, {"url": "http://www.merckmanuals.com/home/children-s-health-issues/problems-in-newborns/jaundice-in-newborns", "passage_text": "In jaundice, the skin and whites of the eyes look yellow. Jaundice is common in newborns. It occurs when the level of bilirubin (a yellow pigment produced during the normal breakdown of red blood cells) in the blood rises. Breastfeeding jaundice is common. It develops in 1 of 6 breastfed infants a few days after birth. It occurs in newborns who do not consume enough breast milk (often because the mother's milk has not yet come in well). Newborns who consume less breast milk have fewer bowel movements and thus eliminate less bilirubin."}, {"url": "http://www.cerebralpalsy.org/about-cerebral-palsy/risk-factors/blood-incompatibility", "passage_text": "When this occurs, the mother’s blood cells develop antibodies that can attack the newborn’s blood cells and cause jaundice. The risk of this is highest near or during delivery. A-B-O incompatibility occurs when: 1  the mother is type O and the baby is B, A, or AB. 2  the mother is type A and their baby is B or AB. "}]