[{"url": "http://www.newworldencyclopedia.org/entry/Eucalyptus", "passage_text": "The most readily recognizable characteristics of Eucalyptus species are the distinctive flowers and fruits. The name Eucalyptus means well-covered; it describes the bud cap (technically called an operculum). This cap forms from modified petals and falls off as the flower opens. There are more than eight hundred species of Eucalyptus, mostly native to Australia, with a very small number of native species found in parts of adjacent New Guinea and Indonesia and one as far away as the Philippines."}, {"url": "http://bhort.bh.cornell.edu/histology/ffossils/eucalypt.html", "passage_text": "Characteristics of Eucalyptus. Eucalyptus plants are usually trees or have tree-like growth forms that can sometimes reach a massive size. Generally, these plants are characterized by sickle-shape leaves with visible oil glands that look like tiny dots on the leaf surface. The fruit is a woody capsule, a type of dry fruit that opens when mature to release the seeds. The capsule opens by valves. Characteristics of the bark, leaves, flower buds, flowers, and capsules are important for identifying species of Eucalyptus. Eucalyptus globulus. Tree habit, leaves, closer view of oil glands on leaf, flower losing its perianth cap, flower, capsules"}, {"url": "https://en.wikipedia.org/wiki/Eucalyptus", "passage_text": "Species of eucalyptus are cultivated widely in the tropical and temperate world, including the Americas, Europe, Africa, the Mediterranean Basin, the Middle East, China, and the Indian subcontinent, though most species do not tolerate frost. The appearance of eucalyptus bark varies with the age of the plant, the manner of bark shed, the length of the bark fibres, the degree of furrowing, the thickness, the hardness, and the colour. All mature eucalypts put on an annual layer of bark, which contributes to the increasing diameter of the stems."}, {"url": "https://en.wikipedia.org/wiki/Eucalyptus", "passage_text": "The more than 700 species of eucalyptus are mostly native to Australia, and a very small number are found in adjacent areas of New Guinea and Indonesia. One species, Eucalyptus deglupta, ranges as far north as the Philippines. The appearance of eucalyptus bark varies with the age of the plant, the manner of bark shed, the length of the bark fibres, the degree of furrowing, the thickness, the hardness, and the colour. All mature eucalypts put on an annual layer of bark, which contributes to the increasing diameter of the stems."}, {"url": "http://bhort.bh.cornell.edu/histology/ffossils/eucalypt.html", "passage_text": "Eucalyptus is the name for a group of plants that includes over 600 species of trees and shrubs in the plant family Myrtaceae, or the Myrtle Family. Today, Eucalyptus is native to Australia and some surrounding islands, including islands in the countries of Papua New Guinea and Indonesia. The fruit is a woody capsule, a type of dry fruit that opens when mature to release the seeds. The capsule opens by valves. Characteristics of the bark, leaves, flower buds, flowers, and capsules are important for identifying species of Eucalyptus. Eucalyptus globulus. Tree habit, leaves, closer view of oil glands on leaf, flower losing its perianth cap, flower, capsules"}, {"url": "http://homeguides.sfgate.com/characteristics-dwarf-eucalyptus-trees-45693.html", "passage_text": "Many dwarf eucalyptus trees have strikingly round leaves. Eucalyptus plants are a large species group, with trees that tower 200 feet or more and bushes that grow to heights of less than 2 feet. They are desirable for their distinctive appearance and pleasant fragrance. The essential oils of eucalyptus plants are used commercially in soaps, candles and other items. Appearance. Eucalyptus trees are known in part for their tremendous size. Some members of the eucalyptus family are much shorter, but these usually grow as bushes rather than trees, and can spread as much as 16 feet. Therefore, the term dwarf is relative."}, {"url": "http://www.answers.com/Q/What_are_the_physical_characteristics_of_the_eucalyptus_tree", "passage_text": "The eucalyptus tree is a genus of flowering trees and shrubs in the myrtle family, Myrtaceae, common in Australia, to which it is native. There are over 700 species of Eucalyp … tus, and beside Australia, around 15 species are found in their native state in parts of New Guinea and Indonesia. "}, {"url": "https://en.wikipedia.org/wiki/Eucalyptus", "passage_text": "Eucalyptus /ˌjuːkəˈlɪptəs/ L'Heritier 1789 is a diverse genus of flowering trees and shrubs (including a distinct group with a multiple-stem mallee growth habit) in the myrtle family, Myrtaceae. Members of the genus dominate the tree flora of Australia. The appearance of eucalyptus bark varies with the age of the plant, the manner of bark shed, the length of the bark fibres, the degree of furrowing, the thickness, the hardness, and the colour. All mature eucalypts put on an annual layer of bark, which contributes to the increasing diameter of the stems."}, {"url": "http://homeguides.sfgate.com/eucalyptus-tree-features-42491.html", "passage_text": "A common feature of eucalyptus trees is their signature leaf structure. Eucalyptus is a genus of trees and shrubs. It is comprised of over 700 species, almost all of which are native to Australia. Oil. Much of the eucalyptus oil available commercially comes from Eucalyptus globulus. Oil is extracted from 11 other eucalyptus, as well. The oil is used in industrial, medical and perfumery industries. Industrial uses include disinfectants, germicidal preparations and liquid soaps."}]