[{"url": "http://www.aclens.com/contacts/rgp", "passage_text": "All RGP Contact Lenses. RGP, or rigid gas permeable contact lenses are well known for providing unrivaled crisp and clear vision through the use of a hard lens design. Most RGP lenses are designed for long term wear, making them a great choice for people who are experienced with caring for their lenses on a regular basis."}, {"url": "http://www.discountcontactlenses.com/Contact-Lenses/Types/RGP/7/oxygen-permeable-lenses.html", "passage_text": "Most Popular RGP Contact Lenses. RGP, or rigid gas permeable contact lenses are well known for providing unrivaled crisp and clear vision through the use of a hard lens design. Most RGP lenses are designed for long term wear, making them a great choice for people who are experienced with caring for their lenses on a regular basis."}, {"url": "http://www.discountcontactlenses.com/Contact-Lenses/Types/RGP/7/oxygen-permeable-lenses.html", "passage_text": "All RGP Contact Lenses. RGP, or rigid gas permeable contact lenses are well known for providing unrivaled crisp and clear vision through the use of a hard lens design. Most RGP lenses are designed for long term wear, making them a great choice for people who are experienced with caring for their lenses on a regular basis."}, {"url": "http://www.americasbest.com/shop/contact-lenses/rgp", "passage_text": "RGP, or rigid gas permeable contact lenses are well known for providing unrivaled crisp and clear vision through the use of a hard lens design."}, {"url": "http://www.aclens.com/contacts/rgp", "passage_text": "RGP. RGP, or rigid gas permeable contact lenses are well known for providing unrivaled crisp and clear vision through the use of a hard lens design. Most RGP lenses are designed for long term wear, making them a great choice for people who are experienced with caring for their lenses on a regular basis."}, {"url": "http://contacts.eyeglassworld.com/Contact-Lenses/Types/RGP/7/oxygen-permeable-lenses.html", "passage_text": "RGP, or rigid gas permeable contact lenses are well known for providing unrivaled crisp and clear vision through the use of a hard lens design."}, {"url": "http://www.allaboutvision.com/contacts/carergplens.htm", "passage_text": "Custom-made from a rigid oxygen-permeable material, gas permeable contact lenses (also called GP, RGP or oxygen-permeable contacts) are more resistant to proteins and other deposits, making them easy to keep clean."}]