[{"url": "http://healthyeating.sfgate.com/vitamins-minerals-provide-energy-6635.html", "passage_text": "Iron has an important effect on your metabolism, and getting enough of the mineral helps provide you with energy. Energy production relies on a constant supply of oxygen -- without enough oxygen, cells cannot carry out metabolic reactions and you stop producing fuel."}, {"url": "http://healthyeating.sfgate.com/vitamins-minerals-provide-energy-6635.html", "passage_text": "While vitamins and minerals help your body get the most from the food you eat, the best way to maximize energy is to ensure you fill your diet with healthy foods and avoid processed foods and sugar."}, {"url": "http://healthyeating.sfgate.com/vitamins-minerals-provide-energy-6635.html", "passage_text": "Manganese also helps provide you with energy by fueling your metabolism. Like B vitamins, manganese helps you break down food into energy. It also helps your cells access energy through a process called gluconeogenesis, the series of chemical reactions your cells use to make glucose, a convenient source of fuel."}, {"url": "http://www.goodnet.org/articles/11-essential-vitamins-minerals-your-body-needs", "passage_text": "2. B VITAMINS GOOD FOR: Energy production, immune function and iron absorption. NATURAL SOURCE: This crucial group of nutrients can be found in whole unprocessed foods, specifically whole grains, potatoes, bananas, lentils, chili peppers, beans, yeast and molasses."}, {"url": "http://www.webmd.com/parenting/vitamins-for-kids-do-healthy-kids-need-vitamins", "passage_text": "1 Vitamin Bs. 2  The family of B vitamins -- B2, B3, B6, and B12 -- aid metabolism, energy production, and healthy circulatory and nervous systems. 3  Good sources include meat, chicken, fish, nuts, eggs, milk, cheese, beans, and soybeans. 4  Vitamin C promotes healthy muscles, connective tissue, and skin."}, {"url": "http://www.disabled-world.com/artman/publish/vitamins-minerals.shtml", "passage_text": "Iron. Iron is an essential mineral needed for the manufacture of haemoglobin, the part of red blood cells that carries oxygen and is needed for energy production. When iron levels are low, red blood cells can't carry enough oxygen to the body's tissues, causing fatigue. When haemoglobin levels are low, anaemia occurs."}, {"url": "http://www.webmd.com/parenting/vitamins-for-kids-do-healthy-kids-need-vitamins", "passage_text": "1 The family of B vitamins -- B2, B3, B6, and B12 -- aid metabolism, energy production, and healthy circulatory and nervous systems. 2  Good sources include meat, chicken, fish, nuts, eggs, milk, cheese, beans, and soybeans."}, {"url": "http://healthyeating.sfgate.com/vitamins-minerals-provide-energy-6635.html", "passage_text": "The B vitamins -- a family of eight water-soluble nutrients -- help provide energy. These nutrients work together to help you metabolize food, allowing your cells to turn the carbohydrates and fats from your diet into useable energy."}]