[{"url": "http://www.thefreedictionary.com/flexion", "passage_text": "3. flexion-act of bending a joint; especially a joint between the bones of a limb so that the angle between them is decreased. flexure. bending-the act of bending something. flex-the act of flexing; he gave his biceps a flex to impress the ladies. dorsiflexion-the act of bending backward (of the body or a body part). "}, {"url": "http://www.definitions.net/definition/Flexion", "passage_text": "In anatomy, flexion is a joint movement that decreases the angle between the bones that converge at the joint. For example, a person's elbow joint is flexed when the hand is brought nearer to the shoulder. Flexion may be instigated by muscle contraction. A muscle that flexes a joint is called a flexor. In joint extension, the opposite of joint flexion, the angle of the joint increases."}, {"url": "http://medical-dictionary.thefreedictionary.com/flexion", "passage_text": "n movement of a limb to decrease the angle of a joint. Flexion. flexion, bilateral sacral, n condition in which the sacrum has rotated around a central transverse axis so that the sacral base moves forward between the bones of the pelvis. Also called. sacral base anterior. flexion. 1. the act of bending or the condition of being bent. 2. in obstetrics, the normal bending forward of the head of the fetus in the uterus or birth canal so that the chin rests on the chest, thereby presenting the smallest diameter of the vertex."}, {"url": "http://www.spine-health.com/glossary/flexion", "passage_text": "Flexion Definition. Flexion is the anatomical name for forward bending. When treating back pain, many spine specialists encourage exercises to strengthen the muscles that act to bring the spine into flexion. In the lower back, approximately 50% of flexion occurs at the hips, and 50% occurs at the lower spine. "}, {"url": "http://www.youtube.com/watch?v=P9VPVg7WY9Y", "passage_text": "This video lesson describes the basic differences between flexion and extension. Emphasis is placed on joint angle, and the fact that muscles can not flex or extend-only joints. Diagrams and illustrations of various limb positions and exercises are used as visual aids to assist you in understanding this concept. "}, {"url": "http://www.audioenglish.org/dictionary/flexion.htm", "passage_text": "The noun FLEXION has 3 senses: 1. the state of being flexed (as of a joint). 2. deviation from a straight or normal course. 3. act of bending a joint; especially a joint between the bones of a limb so that the angle between them is decreased. Familiarity information: FLEXION used as a noun is uncommon. Dictionary entry details."}, {"url": "https://en.wikipedia.org/wiki/Flexion", "passage_text": "When a joint can move forward and backward, such as the neck and trunk, flexion refers to movement in the anterior direction. Flexion of the shoulder or hip refers to movement of the arm or leg forward. Extension is the opposite of flexion, describing a straightening movement that increases the angle between body parts. When a joint can move forward and backward, such as the neck and trunk, extension refers to movement in the posterior direction. For example, when standing up, the knees are extended. See also: List of flexors of the human body and List of extensors of the human body. Flexion and extension describe movements that affect the angle between two parts of the body. These terms come from the Latin words with the same meaning."}, {"url": "http://www.merriam-webster.com/dictionary/flexion", "passage_text": "Medical Definition of FLEXION. 1. : a bending movement around a joint in a limb (as the knee or elbow) that decreases the angle between the bones of the limb at the joint—compare extension 2. 3. : inflection 3. 4. a: a bending movement around a joint in a limb (as the knee or elbow) that decreases the angle between the bones of the limb at the joint — compare extension 3b b: a forward raising of the arm or leg by a movement at the shoulder or hip joint. See flexion defined for kids. ADVERTISEMENT"}, {"url": "http://www.definitions.net/definition/Flexion", "passage_text": "Flexion. In anatomy, flexion is a joint movement that decreases the angle between the bones that converge at the joint. For example, a person's elbow joint is flexed when the hand is brought nearer to the shoulder. Flexion may be instigated by muscle contraction. A muscle that flexes a joint is called a flexor. In joint extension, the opposite of joint flexion, the angle of the joint increases."}]