[{"url": "https://uk.answers.yahoo.com/question/index?qid=20091001092514AA9bpDc", "passage_text": "The more you earn, the more tax you pay (in terms of number of £'s). At the moment, EUR 40-45K works out at around £36 - £40K, and that is reasonably good salary for the UK. The average salary over all agegroups and types of jobs is about £21K, so you're about double the average. Source(s): Simon M · 6 years ago."}, {"url": "http://www.expatsingapore.com/forum/index.php?topic=25860.0", "passage_text": "it all depends on your lifestyle and your industry. 45K pounds is quite a good salary-but then if you're a bank teller then you'd never get it."}, {"url": "http://www1.salary.com/Entry-Level-Salaries.html", "passage_text": "Well there are a wide range of jobs in the Entry Level category and their pay varies greatly. If you know the pay grade of the job you are searching for you can narrow down this list to only view Entry Level jobs that pay less than $30K, $30K-$50K, $50K-$80K, $80K-$100K, or more than $100K."}, {"url": "http://www.payscale.com/research/UK/Job=Mechanical_Engineer/Salary", "passage_text": "(United Kingdom). The average salary for a Mechanical Engineer is £29,980 per year. A skill in Technical Analysis is associated with high pay for this job. People in this job generally don't have more than 20 years' experience."}, {"url": "http://www.expatsingapore.com/forum/index.php?topic=25860.0", "passage_text": "Quote. You can expect to take home about 2500 a month. as the previous poster sid tax is not 40% - you only pay 40% on that above around 30k. I have a 3 bed house in S.London-it rents out for 950 a month."}, {"url": "http://news.bbc.co.uk/2/hi/8151355.stm", "passage_text": "The average wage throughout the civil service for grades 1 - 5 (which is 80% of all civil servants) is less that £20000 pa. Stuart Wilson, Motherwell. Andrew, Oxford says: To maintain any kind of decent lifestyle in the UK (especially the South East), one requires a salary of at least £60k."}]