[{"url": "http://medical-dictionary.thefreedictionary.com/Heart+Attack", "passage_text": "A heart attack occurs when one or more of the coronary arteries that supply blood to the heart are completely blocked and blood to the heart muscle is cut off. The blockage usually is caused by atherosclerosis, the build-up of plaque in the artery walls, and/or by a blood clot in a coronary artery."}, {"url": "http://www.nhlbi.nih.gov/health/health-topics/topics/heartattack/", "passage_text": "A heart attack happens when the flow of oxygen-rich blood to a section of heart muscle suddenly becomes blocked and the heart can't get oxygen."}, {"url": "http://www.mayoclinic.org/diseases-conditions/heart-attack/basics/definition/con-20019520", "passage_text": "Heart attack. A heart attack occurs when the flow of blood to the heart is blocked, most often by a build-up of fat, cholesterol and other substances, which form a plaque in the arteries that feed the heart (coronary arteries). The interrupted blood flow can damage or destroy part of the heart muscle."}, {"url": "http://www.medicinenet.com/script/main/art.asp?articlekey=3669", "passage_text": "Heart attack: The death of heart muscle due to the loss of blood supply. The loss of blood supply is usually caused by a complete blockage of a coronary artery, one of the arteries that supplies blood to the heart muscle. Death of the heart muscle, in turn, causes chest pain and electrical instability of the heart muscle tissue."}, {"url": "http://www.medicinenet.com/script/main/art.asp?articlekey=3669", "passage_text": "A heart attack is also called a myocardial infarction or an MI. Myocardial refers to the myocardium, the heart muscle. Infarction is tissue death due to a local lack of oxygen."}, {"url": "http://www.webmd.com/heart-disease/guide/heart-disease-heart-attacks", "passage_text": "More than a million Americans have heart attacks each year. A heart attack, or myocardial infarction (MI), is permanent damage to the heart muscle. Myo means muscle, cardial refers to the heart, and infarction means death of tissue due to lack of blood supply."}]