[{"url": "http://www.wisegeek.com/what-are-some-different-types-of-gemstones.htm", "passage_text": "There are other ways to evaluate types of gemstones. People may classify them by hardness on the Mohs scale, by color, by rarity, or by popularity. What is really most important in considering different types is how they appeal and how well they will hold up when used in certain ways."}, {"url": "http://www.gemselect.com/other-info/gemstone-list.php", "passage_text": "Spodumene is a relatively new mineral to science, with gem varieties discovered only in the last 120 years. Spodumene occurs in white, gray, pink, lilac and green. Fluorite. Fluorite is a mineral with a veritable plethora of brilliant colors that include purple, blue, green, yellow, colorless, brown, pink and orange."}, {"url": "http://www.gemselect.com/other-info/gemstone-list.php", "passage_text": "Gems as shown on site---wonderful to be able to see the gem that will be delivered, not one similar to the picturenice to be able to zoom and see gems at different angles, excellant descriptionspackaging great---very ..."}, {"url": "http://www.wisegeek.com/what-are-some-different-types-of-gemstones.htm", "passage_text": "Alternately types of gemstones may be classed by how they are made. Another way to classify gems is by describing them as precious, semi-precious or organic. When gemstones are identified by category, the following categories may apply: 1  Diamonds — considered the most precious stone in the world."}, {"url": "http://geology.com/gemstones/", "passage_text": "Emerald Emerald is the most popular green gemstone in the United States and most of the world. Opal Photos Pictures of Opal A collection of different types of opal from all around the world and Mars too! U.S. Gemstones United States Gemstones Small mines in the U.S. produce a diversity of gemstones. 100+ Gems 100+ Gems-Photos of over 100 beautiful gems ranging from the popular to the obscure."}, {"url": "http://www.indianetzone.com/15/types_gemstones.htm", "passage_text": "Appeal of Various Types of Gemstones. Different types of gemstones have long been used for jewellery and their relation to womenfolk is precious too! Gemstones are beautiful and elegant. The beauty may lie in colour or lack of colour as well."}, {"url": "http://geology.com/gemstones/", "passage_text": "Peridot Peridot is the gem variety of olivine. Derived from the mantle and rarely from meteorites. Spinel Spinel The gemstone that was confused with ruby and sapphire for over 1000 years. Organic Gems Organic Gems are gems formed from or by plants or animals."}, {"url": "http://www.gemselect.com/other-info/gemstone-list.php", "passage_text": "Enstatite is a rare gemstone that belongs to the pyroxene group of minerals. It is typically brown-green with a vitreous luster and is a collector's gem. Sphene. Sphene is a brilliant yellowish-green, green or brown gemstone of high luster, unique color shades and, with brilliant cut, an intense fire."}]