[{"url": "http://www.vrg.org/nutrition/protein.php", "passage_text": "The recommendation for protein for adult male vegans is around 63 grams per day; for adult female vegans it is around 52 grams per day. It is very easy for a vegan diet to meet the recommendations for protein. Nearly all vegetables, beans, grains, nuts, and seeds contain some, and often much, protein. Fruits, sugars, fats, and alcohol do not provide much protein, so a diet based only on these foods would have a good chance of being too low in protein."}, {"url": "http://www.diabetes.org/food-and-fitness/food/what-can-i-eat/making-healthy-food-choices/meat-and-plant-based-protein.html", "passage_text": "Most plant-based protein foods, like beans and soy products, and any breaded meats contain carbohydrate. It's best to read food labels carefully for these foods. In general there is about 15 grams of carbohydrate in ½ cup beans, and between 5 to 15 grams in soy-based products like veggie burgers and chicken nuggets. Plant-based protein foods provide quality protein, healthy fats, and fiber. They vary in how much fat and carbohdyrate they contain, so make sure to read labels. 1  Beans such as black, kidney, and pinto. 2  Bean products like baked beans and refried beans. 3  Hummus and falafel."}, {"url": "http://www.webmd.com/fitness-exercise/guide/good-protein-sources", "passage_text": "Milk, Cheese, and Yogurt. Not only are dairy foods like milk, cheese, and yogurt excellent sources of protein, but they also contain valuable calcium, and many are fortified with vitamin D. Choose skim or low-fat dairy to keep bones and teeth strong and help prevent osteoporosis. Eggs are one of the least expensive forms of protein. Fifty grams of soy protein daily can help lower cholesterol by about 3%. Eating soy protein instead of sources of higher-fat protein -- and maintaining a healthy diet -- can be good for your heart."}, {"url": "http://www.livestrong.com/article/542807-list-of-foods-or-fruits-that-contain-protein/", "passage_text": "Beans, Grains and Vegetables. Beans, grains and vegetables are the main protein sources in many cuisines. Even vegans can meet their daily needs for protein from a diet completely without animal products. One cup of lentils, kidney, pinto or black beans contains 12 to 18 grams of protein. Chicken and beef may contain 18 to 35 grams of protein per 100 grams. Fish have approximately 15 to 20 grams of protein per 100 grams, and many fish also contain heart-healthy omega-3 fatty acids."}, {"url": "http://www.bbcgoodfood.com/howto/guide/best-sources-protein", "passage_text": "Milk. Dairy foods are packed with protein and contain bone-building calcium, too. Chocolate milk is the age-old recovery food after exercise, since it contains energy-replenishing carbohydrates and a blend of both slow and fast release whey and casein proteins. ‘High-quality proteins’ such as eggs and meat offer more muscle-building amino acids than other protein foods, so are considered more valuable sources of protein, particularly if you do lots of exercise."}, {"url": "http://www.allinahealth.org/Health-Conditions-and-Treatments/Eat-healthy/Nutrition-basics/Foods-that-have-protein/", "passage_text": "Learn more about foods that are high in protein. 1  Beans. 2  Dairy. 3  Eggs. 4  Meat, poultry and fish. 5  Nuts. 6  Soup. "}, {"url": "http://www.diabetes.org/food-and-fitness/food/what-can-i-eat/making-healthy-food-choices/meat-and-plant-based-protein.html", "passage_text": "Protein Foods. Foods high in protein such as fish, chicken, meats, soy products, and cheese, are all called “protein foods.” You may also hear them referred to as ‘meats or meat substitutes.”. The biggest difference among foods in this group is how much fat they contain, and for the vegetarian proteins, whether they have carbohydrate. Plant-based protein foods provide quality protein, healthy fats, and fiber. They vary in how much fat and carbohdyrate they contain, so make sure to read labels. 1  Beans such as black, kidney, and pinto. 2  Bean products like baked beans and refried beans. 3  Hummus and falafel."}, {"url": "http://www.livestrong.com/article/542807-list-of-foods-or-fruits-that-contain-protein/", "passage_text": "Photo Credit Skarie20/iStock/Getty Images. Many different foods contain protein. Meat, fish, eggs and dairy are animal-based protein sources. Plant-derived proteins include soy products, beans, grains, nuts, seeds and some vegetables. Chicken and beef may contain 18 to 35 grams of protein per 100 grams. Fish have approximately 15 to 20 grams of protein per 100 grams, and many fish also contain heart-healthy omega-3 fatty acids."}, {"url": "http://livewell.jillianmichaels.com/list-complete-protein-foods-5034.html", "passage_text": "Meat, Poultry and Fish. Animal foods, such as red meat, pork, game meats, poultry and fish, all are complete protein foods. Examples of specific cuts and types of red meats include ground round or sirloin, eye of round steak and beef tenderloin. Fish and shellfish are lean complete protein foods that are particularly rich in essential minerals. Examples include shrimp, scallops, clams, tuna, salmon, halibut, whitefish, cod and swordfish. According to MayoClinic.com, 1 ounce of red meat, pork, poultry or fish provides 7 grams of prote"}]