[{"url": "http://mysite.pratt.edu/~morourke/dda514/stories/OdysseusCyclops.htm", "passage_text": "Odysseus and the Cyclops (Greek, from The Odyssey, by Homer). : The clever Greek leader, Odysseus, and his men become trapped by a viscious one-eyed monster, who eats the men one by one. Odysseus devises a plan, blinds the monster, and escapes with his men."}, {"url": "http://www.livius.org/sh-si/sicily/sicily_t19.html", "passage_text": "Homer (Glyptothek, Munich). In the Odyssey, the legendary blind poet Homer describes many countries and islands in the seas west of Greece, visited by the prototypical traveler Odysseus after the fall of Troy. Among these islands was one that was inhabited by Cyclopes, one-eyed giants that liked to devour human beings."}, {"url": "http://www.in2greece.com/english/historymyth/mythology/names/odysseus.htm", "passage_text": "Next, they landed on the island of Cyclops Polyphemus, this allegedly was the island of Youra in the North Sporades. The giant shut the men inside his cave, ate a few of them and talked with Odysseus, who told the Cyclops his name was No one."}, {"url": "http://www.classicsunveiled.com/mythnet/html/polyphem.html", "passage_text": "Many years after the Prometheus had been punished, and the descendants of the men he helped had become civilized and had learned how to build ships, a Greek prince by the name of Odysseus (Ulysses in Latin) beached his boat on the shore of the land where the Cyclops Polyphemus lived."}, {"url": "http://www.pantheon.org/articles/p/polyphemus.html", "passage_text": "by Ron Leadbetter. Polyphemus, the son of Poseidon and Thoosa. He was a Cyclops (plural Cyclopes) in Greek (Kuklops) meaning round eye, a mythical semi-human monster of huge proportions, with a single eye at the centre of his forehead, usually described as a one-eyed giant."}, {"url": "http://mythicalrealm.com/creatures/cyclops.html", "passage_text": "Polyphemus was the son of Poseidon and the sea nymph Thoosa. He was a Cyclops and was thought to have lived on the island of Sicily. The celebrated traveller, Odysseus, renowned for his wits and silver-tongue, was on his way home from Troy when he beach at Sicily, home of the lawless race of one-eyed giants. He asked for hospitality and called himself by the name of Nobody."}]