[{"url": "http://www.currentresults.com/Environment-Facts/changes-in-earth-temperature.php", "passage_text": "The earth's average temperature rose by 0.8 °C (1.5 °F) during the last century. That change is in the mean global temperature that has been calculated for each year since 1880. The history of average global temperature is based on data gathered around the world at weather stations, on ships and by satellites. The average global annual temperature hovered around 13.7 °C (56.7 °F) from the 1880s through the 1910s. During the 1920s to 1940s, temperatures climbed about 0.1 °C (0.18 °F) each decade. Mean global temperatures then stabilized at roughly 14.0°C (57.2 °F) until the 1980s."}, {"url": "http://www.space.com/17816-earth-temperature.html", "passage_text": "The average temperature on Earth is about 61 degrees F (16 C). But temperatures vary greatly around the world depending on the time of year, ocean and wind currents and weather conditions. Summers tend to be warmer and winters colder. Also, temperatures tend to be higher near the equator and lower near the poles. The distance from Earth to the sun is one of the most important factors in making Earth habitable. The next closest planet to the sun, Venus, for example, is the hottest planet in the solar system. Temperatures there reach more than 750 F (400 C), while the average temperature on Mars is minus 80 F (minus 60 C)."}, {"url": "https://www.climate.gov/news-features/understanding-climate/climate-change-global-temperature", "passage_text": "Temperatures measured on land and at sea for more than a century show that Earth's globally averaged surface temperature is experiencing a long-term warming trend. The concept of an average temperature for the entire globe may seem odd. "}, {"url": "https://en.wikipedia.org/wiki/Instrumental_temperature_record", "passage_text": "The Earth's average surface absolute temperature for the 1961-1990 period has been derived by spatial interpolation of average observed near-surface air temperatures from over the land, oceans and sea ice regions, with a best estimate of 14 °C (57.2 °F). The global average and combined land and ocean surface temperature, show a warming of 0.85 [0.65 to 1.06] °C, in the period 1880 to 2012, based on multiple independently produced datasets. The Earth's average surface temperature rose by 7002273890000000000♠0.74±0.18 °C over the period 1906–2005."}, {"url": "http://www.answers.com/Q/What_is_the_earth's_mean_temperature", "passage_text": "These temperatures are dry bulb temperatures. Most of the Earth is subject to heating and cooling by the oceans and the atmosphere. Except for extreme locations on Earth (deserts, poles), the temperature range is compatible with human activities, falling in the range between -40° and +40° C (-40° to 104°F). The temperature of Earth's core can only be estimated using mathematical and geophysical models, and the current (2011) estimated temperature range is: Outer core--from 4400' … C in the outer regions near the mantle, to around 6100'C in the inner regions near the inner core (7,952 to 11,000oF)."}, {"url": "http://www.ehow.com/about_4616962_what-average-temperature-earth.html", "passage_text": "Temperature Extremes. Earth's surface temperature depends on how much energy it receives from the sun. The equator, which is in direct sunlight all year, tends to be the hottest place, but the highest air temperature ever recorded was at Death Valley, California, in 1913. It was 56.7 degrees Celsius (134 degree Fahrenheit). "}]