[{"url": "http://www.cbsnews.com/news/cost-of-offshore-drilling-rising-as-fast-as-oil-prices/", "passage_text": "Oil and natural gas prices, combined with full capacity world wide in the offshore rig market -- and competition for these fleets -- is hurting the back side of international oil companies, with drilling and production costs more than doubling in recent years. Expect $600,000 day rates to become more common. Last month, Brazilian Petrobras awarded Norway's SeaDrill with contracts for three deepwater rigs worth up to $4.1 billion, with day rates in excess of $600,000."}, {"url": "http://petrowiki.org/AFE%3A_drilling_rig_and_tools", "passage_text": "An interesting point on the illustration is that the over-supply rig costs were reasonably equal regardless of the rig size (i.e., U.S. $6,000 vs. $9,500/day for small to very large rigs). Fig. 2—Rig cost compared to casing capacity of the derrick and substructure. Standby rates for drilling rigs usually range from U.S. $200 to $500/day less than the amounts shown in Fig. 2. The rates include crews and drillpipe. The costs are used to estimate move-in and move-out charges. "}, {"url": "http://www.rigzone.com/news/oil_gas/a/135523/Ocean_Rig_Petrobras_Agree_To_3Year_11B_Drillships_Lease", "passage_text": "The period and price translate into an average rate for each of the vessels of $502,283 per day. The Corcovado was expected to earn an average day rate of $464,800 and Mykonos $459,700 in the second half of 2014, according to Ocean Rig's second-quarter financial statements. Much of the company's five-year plan to invest $221 billion by the end of 2018 will be focused on drilling in new fields, which is expected to help the company's oil and natural gas liquids output in Brazil rise 53 percent to 3.2 million barrels a day."}, {"url": "http://www.pennenergy.com/articles/pennenergy/2015/01/drilling-rig-prices-falling.html", "passage_text": "[Native Advertisement]. Falling oil prices are affecting the drilling rig market in multiple ways. The cost of drilling rigs is expected to fall approximately 40 percent over the next year, Managing Director of Karoon Gas Australia Ltd. Robert Hosking told Bloomberg. A rig that cost upwards of $400,000 per day to rent may only cost $250,000 per day later this year. Why the fall? The decline in oil rig rental prices is a result of the oil and gas exploration market adjusting to lower oil prices and reduced spending on exploration and production projects. "}, {"url": "https://www.quora.com/How-much-does-it-cost-to-maintain-an-offshore-oil-rig-for-a-year", "passage_text": "A deepwater drill ship can run about $250K-500K/ day operating cost (day rate), to an oil company leasing it's services. And that was about 5 years ago. So the annual cost for both operation and maintenance would be around $180 million. These rigs usually last 30-35 years, which works out to a per-day cost of $59k (again, shows up as depreciation). Current day rates for these types of ships are running around $550k/day."}, {"url": "http://www.oil-price.net/en/articles/oil-drilling-expensive-business.php", "passage_text": "Recently the company penned a contract for a well in West Africa for $630,000 a day and its Deepwater Pathfinder is the most expensive drill ship in the world. It also signed a three year contract from a consortium of contractors at $460,000 a day in the Q3 of 2009. The exploration was based on oil stains found. But the well turned out to be a dry hole with no oil. Little wonder then that oil drilling is risky and expensive. According to Arizona Geological Survey, Oil drilling in Arizona costs between $400,000 to $1,000,000, depending on the depth of the hole and its location. A rig capable of drilling most exploratory holes typically costs $8,000-15,000 per day"}, {"url": "http://www.cbsnews.com/news/cost-of-offshore-drilling-rising-as-fast-as-oil-prices/", "passage_text": "The company noted that it was recently rewarded a contract for one well in West Africa at $630,000 a day (with a start date estimated to be Q4:2009). Expect $600,000 day rates to become more common. Last month, Brazilian Petrobras awarded Norway's SeaDrill with contracts for three deepwater rigs worth up to $4.1 billion, with day rates in excess of $600,000."}, {"url": "http://seekingalpha.com/article/1081121-an-introduction-to-investing-in-offshore-drilling-companies", "passage_text": "Profit comes from leasing these drill rigs at contracted day rates that exceed the company's cost of capital and operating costs. The offshore drilling companies are leveraged to long term price trends of oil. It is often stated that the break-even for deepwater drilling is oil over $70 a barrel. The reason it matters is because day rates and operating costs are vastly different. Day rates are typically $75,000 per day for jackups, and $400,000 or more a day for deepwater (rates vary widely, based on market conditions and rig availability)."}, {"url": "https://www.quora.com/How-much-does-it-cost-to-maintain-an-offshore-oil-rig-for-a-year", "passage_text": "Then there is the original cost of the ship, which can be anywhere from $600 to close to $1 billion. These rigs usually last 30-35 years, which works out to a per-day cost of $59k (again, shows up as depreciation). Current day rates for these types of ships are running around $550k/day. This is the cost to the oil company to rent the ship from the owner, companies like Transocean or Noble Corporat"}]