[{"url": "http://wanttoknowit.com/what-do-italians-eat/", "passage_text": "Now that you know the answer to the question what do Italians eat, let’s look at three quick facts about Italy. Fact 1: Italy is shaped like a boot. Fact 2: Italy’s capital Rome is the home of the Catholic Church. Fact 3: The most popular sport in Italy is football (or soccer). To answer the question what do Italians eat it is best to list all the individual meals eaten in a typical day. Breakfast. Italians do not eat bacon, eggs, toast or pancakes for breakfast. Italians typically eat a croissant or some yoghurt for breakfast with a cup of coffee or a cappuccino"}, {"url": "http://www.huffingtonpost.com/whitney-richelle/americans-dining-in-italy_b_4097722.html", "passage_text": "Italian food culture is probably very different from what you're used to at home. And, since Italians have been perfecting it for over 1,000 years, try going with the wine and olive oil flow instead of fighting against the current when you're in Italy. 1. Don't ask for fettuccine alfredo or spaghetti with meatballs. "}, {"url": "http://www.answers.com/Q/What_kind_of_food_do_Italians_eat", "passage_text": "most Italians eat spaggethi, soup, caviar, fish, delious cakes and desserts. *Most Italians in Italy demand fresh food. Depending on where they live in Italy they will eat what is fresh and available. And What they can afford. Fresh fish and seafood, mussels, shrimps, squid and other seafood are enjoyed. Italian people eat lots of things like: Italian people eat lots of pasta, meat, fish as well as chicken and bread. 6 people found this useful. Edit. Share to: 1  Basics of Northern Italian Cuisine Italy is home to some of the world's most loved foods. 2  Most people associate Italian food with pizza and pasta."}, {"url": "http://www.study-in-italy.it/about/eating.html", "passage_text": "Italians are very proud of their cuisine and rightly so, for their food is renowned throughout the world. Italian cooking is still very regional with the different towns and regions having their own traditions and specialities. "}, {"url": "http://www.answers.com/Q/What_foods_do_Italians_eat", "passage_text": "they traditionally eat pasta, rissoles, pizza, salads, seafood, rich wine, bread rice ,meat, and so on.  The Italians love their food and they take great pride in serving th … e best for you so no picking out the bits you don't like (aye).  xx  traditional include pizza, pasta, rich wine, raviolis, bread. Depending on where they live in Italy they will eat … what is fresh and available. And What they can afford. Fresh fish and seafood, mussels, shrimps, squid and other seafood are enjoyed. Pasta is still eaten and enjoyed by most Italians every day. Italians also eat white rice, and potatoes but not with their pasta."}, {"url": "http://www.answers.com/Q/What_foods_do_Italians_eat", "passage_text": "most Italians eat spaggethi, soup, caviar, fish, delious cakes and desserts. *Most Italians in Italy demand fresh food. Depending on where they live in Italy they will eat … what is fresh and available. And What they can afford. Fresh fish and seafood, mussels, shrimps, squid and other seafood are enjoyed. Pasta is still eaten and enjoyed by most Italians every day. Italians also eat white rice, and potatoes but not with their pasta."}, {"url": "http://globerove.com/italy/italian-holiday-food/1211", "passage_text": "The Italians love to eat, especially on holidays. Find out more about the different holiday foods of Italy in our comprehensive guide to Italian Holiday Food. The Italians are known to possess a deep love for eating. The unique and diverse cuisine that Italy now possesses has evolved through the years. "}, {"url": "http://www.livestrong.com/article/316365-what-types-of-food-do-they-eat-in-italy/", "passage_text": "Most people associate food from Italy with spaghetti or pizza, but there are many more foods that Italians prepare and eat. Sophie Braimbridge and Joanne Glynn, authors of Food of Italy, report that Italians take food seriously. The Italian diet is considered quite healthy because of the inclusion of nutrient-rich vegetables and calcium-rich cheeses. Pizza is another food common in Italy and includes shredded or sliced cheese. Cheese is also added to many Italian salads and soups. Sliced or cubed cheese is often served as an appetizer or as a side dish to complement sliced meat, bread and olives."}]