[{"url": "http://www.scholastic.com/browse/lessonplan.jsp?id=523", "passage_text": "1 About the role of science and technology in society and that technology positively influences our quality of life by helping us learn, live safely, and stay healthy. 2  That in benefiting from the conveniences technology offers, society must also recognize the responsibilities that come with technology. DIRECTIONS. 1  Begin by asking students what they know about technology, or if they know examples of technology. 2  Jot all examples on the board. 3  Students should understand that they know quite a bit about technology, by virtue of their daily experience with electronics (MP3s, TVs, computers, printers)."}, {"url": "http://www.treehugger.com/clean-technology/5-ways-technology-can-help-us-consume-less.html", "passage_text": "5. Most recently technology has really helped us to customize the things that we make and buy, leading to consumption that is less wasteful. Here at TreeHugger, we're huge fans of 3D printing, an innovation that defines customization. 2. Another major way that technology is helping us to consume less is through the consolidation of things within one gadget. This has been especially noteworthy in the past few years with the rise of smartphones and tablets. These technologies let us carry just one device that serves several purposes, as opposed to many"}, {"url": "http://www.answers.com/Q/How_does_technology_help_us_daily", "passage_text": "Technology was made to make life easier for humans and that's some of the ways it helps humans. + 14 others found this useful. Tationna Lovee. 1  A List of Wireless Technologies That Failed Wireless technologies are always evolving, like other institutions and focal points in the technology industry. Answer   Information Technology has had a great effect on the evolution of education. 1) it has allowed for more advanced home teaching. 2) it has made teaching in remote … areas easier 3) now that it is taught from an early age, it makes life easier when in the work place."}, {"url": "http://www.theatlantic.com/international/archive/2013/05/how-new-technology-can-help-us-track-illegal-guns/276440/", "passage_text": "A better understanding of the small arms and ammunition trade can help promote accountability, and it can also help us anticipate the next hot spot. For example, MAD documented dramatic spikes in military small arms exports to Libya in 2009, some two years before the 2011 intervention. "}, {"url": "http://www.treehugger.com/clean-technology/5-ways-technology-can-help-us-consume-less.html", "passage_text": "Technology has improved our lives in many ways and not just through making thing faster and more convenient. We are better connected and better informed. Technology lets us travel the globe and get close to wildlife without leaving our desk, our cell phones can help us to make better shopping decisions and software helps us to be more energy efficient. It also has served to dematerialize our lives. 2. Another major way that technology is helping us to consume less is through the consolidation of things within one gadget. This has been especially noteworthy in the past few years with the rise of smartphones and tablets. These technologies let us carry just one device that serves several purposes, as opposed to many"}, {"url": "http://www.scholastic.com/browse/lessonplan.jsp?id=523", "passage_text": "1 What technology is and the differences between science and technology. 2  About the role of science and technology in society and that technology positively influences our quality of life by helping us learn, live safely, and stay healthy. DIRECTIONS. 1  Begin by asking students what they know about technology, or if they know examples of technology. 2  Jot all examples on the board. 3  Students should understand that they know quite a bit about technology, by virtue of their daily experience with electronics (MP3s, TVs, computers, printers)."}, {"url": "http://www.answers.com/Q/How_does_technology_help_us_daily", "passage_text": "Cell phones, computers, laptops, smart boards, GPS systems, etc. all are technology passed. It helps us daily, by providing us with information, or even fun that we wouldn't necessarily get out of a book (a book is also a technology, but good point) as quickly as we'd type it into Google. Answer   Information Technology has had a great effect on the evolution of education. 1) it has allowed for more advanced home teaching. 2) it has made teaching in remote … areas easier 3) now that it is taught from an early age, it makes life easier when in the work place."}, {"url": "http://fortune.com/2014/08/11/can-technology-help-us-survive-californias-drought/", "passage_text": "A full 80 percent of the water used in California goes to agriculture, Gleick points out. “Farmers know how to implement drip irrigation. It’s not a new technology, but they’re learning new ways to do it.” Soil-moisture monitors and smart meters also help reduce waste. “It turns out that with the right feedback delivered in the right way, people cut their water use by 5 percent,” he says. “What we’re trying to offer is a path to market,” he explains. “We have a lot of great technology out there, it just doesn’t make it to market. A lot of our work is reaching out to people who can bring new business models to the sector—that’s almost more important than new technology.”."}, {"url": "http://www.scholastic.com/browse/lessonplan.jsp?id=523", "passage_text": "Students will learn: 1  What technology is and the differences between science and technology. 2  About the role of science and technology in society and that technology positively influences our quality of life by helping us learn, live safely, and stay healthy. DIRECTIONS. 1  Begin by asking students what they know about technology, or if they know examples of technology. 2  Jot all examples on the board. 3  Students should understand that they know quite a bit about technology, by virtue of their daily experience with electronics (MP3s, TVs, computers, printers)."}]