[{"url": "http://www.dnatestingcost.org/", "passage_text": "Normally, to do a paternity test, you have to spend around $200 but, if you want the legal reports to be used in the court or any other similar place then you have to pay around $600. This way, the cost of DNA test varies. If the testing is to be done on more than one sample, the cost will surely vary. Also the way test results are to be used, private or legal, also matters. Normally the cost of DNA test starts from $200 and goes up to $500. The cost can also be more than $500 according to the above factors."}, {"url": "http://health.costhelper.com/paternity-test.html", "passage_text": "1 For example, the Identigene at-home test costs $149 and Genetic Profiles Corporation offers tests for $500 for a standard case and $730 for a case in which the biological mother's DNA is not available. 1 For patients not covered by health insurance, prenatal paternity testing, in which DNA material is collected through a more invasive procedure, typically costs about $1,000 to $2,000."}, {"url": "http://www.answers.com/Q/How_much_does_a_DNA_test_cost", "passage_text": "Confidence votes 260K. DNA Tests A DNA test for paternity analysis costs somewhere in the region of $200. If you require the test to be admissible in court, which is often required in cases of child support or disputed paternity, the costs go up. Some say to $500 or $600. The cost for DNA test could be varying depending on the purpose of the testing. The standard paternity DNA test normally costs ranging from $75 to $100. The cost increases dra … matically for complicated DNA test. But you can always get good deal by search web"}, {"url": "http://www.dnatestingcost.org/", "passage_text": "Ancestral DNA testing actual identifies chromosomes on the Y-DNA and the MTDNA of the sample. A low cost Y-DNA test would identify 12 chromosomes and cost as low as $59 from Family Tree. The cost for identifying 111 chromosomes would see an increase in the price to $359. The MTDNA testing can range from $59 to $199. If the testing is to be done on more than one sample, the cost will surely vary. Also the way test results are to be used, private or legal, also matters. Normally the cost of DNA test starts from $200 and goes up to $500. The cost can also be more than $500 according to the above factors."}, {"url": "http://www.dnatca.com/tests/y-chromosome-testing", "passage_text": "Y-DNA STR Marker Profile Test $119. Y-Chromosome testing can trace the male lineage and is a very useful test for genealogists as well as males who need to know whether they are related along the male line. All males have a Y chromosome (females do not have a Y-chromosome)."}, {"url": "http://ghr.nlm.nih.gov/handbook/testing/costresults", "passage_text": "The cost of genetic testing can range from under $100 to more than $2,000, depending on the nature and complexity of the test. The cost increases if more than one test is necessary or if multiple family members must be tested to obtain a meaningful result. For newborn screening, costs vary by state. Some states cover part of the total cost, but most charge a fee of $15 to $60 per infant. From the date that a sample is taken, it may take a few weeks to several months to receive the test results."}, {"url": "http://www.genealogyjunkie.net/how-much.html", "passage_text": "This page covers the costs of autosomal DNA (atDNA), Y-chromosome DNA (Y-DNA), and mitochondrial DNA at Family Tree DNA, 23andMe, AncestryDNA, and the Genographic Project – I've been tested at all four. Not all tests are available at all companies. Note that X-chromosome DNA (X-DNA) is carried out at the same time as atDNA (and at no additional cost), but not all companies do matching on X-DNA. See Genetic Genealogy for background information on the different types of DNA and what each DNA test can do."}, {"url": "http://www.genealogyjunkie.net/how-much.html", "passage_text": "The cost of DNA testing has come down considerably over the last few years. For only $99, you can have the best test for finding new cousins and the most recent common ancestor within a genealogical time frame: autosomal DNA (atDNA) testing. Not all tests are available at all companies. Note that X-chromosome DNA (X-DNA) is carried out at the same time as atDNA (and at no additional cost), but not all companies do matching on X-DNA. See Genetic Genealogy for background information on the different types of DNA and what each DNA test can do."}, {"url": "http://www.dnatestingcost.org/", "passage_text": "The DNA test cost depends on the lab which does the test. The cost also varies according to the sample. If the scientists have to work for more time on the sample and fetch a lot of information then the cost of the test will be more. If the testing is to be done on more than one sample, the cost will surely vary. Also the way test results are to be used, private or legal, also matters. Normally the cost of DNA test starts from $200 and goes up to $500. The cost can also be more than $500 according to the above factors."}]