[{"url": "http://www.babynamespedia.com/meaning/Vadim", "passage_text": "[ 2 syll. va-dim, vad-im ] The baby boy name Vadim is pronounced as Vaa-D IY-M †. Vadim is of Old Norse and Slavonic origin. It is used mainly in Russian. The name is of obscure origin; it could be derived from Old Norse. In addition, Vadim is a variant form of the Czech, English, and Hungarian Vladimir vladimír in The russian. language"}, {"url": "http://www.meaning-of-names.com/russian-names/vadim.asp", "passage_text": "In Russian, the name Vadim means-a powerful ruler.The name Vadim originated as an Russian name. In Russian, the name Vadim means-a powerful ruler.The name Vadim originated as an Russian name. The name Vadim is most often used as a boy name or male name."}, {"url": "http://www.babynames.com/name/VADIM", "passage_text": "Here are pictures of people with the name Vadim. Help us put a face to the name by uploading your pictures to BabyNames.com!"}, {"url": "http://www.thenamemeaning.com/vadim/", "passage_text": "Also note the spelling and the pronunciation of the name Vadim and check the initials of the name with your last name to discover how it looks and sounds. The history and meaning of the name Vadim is fascinating, learn more about it."}, {"url": "http://www.babynamespedia.com/meaning/Vadim", "passage_text": "Variant forms of Vadim include the name Vad, the name Vadeem, the name Vadeeme, the name Vadem, the Russian Vadik, the name Vadime, the name Vadym, and the name Vadyme. Vadim is not commonly used as a baby boy name. It is not in the top 1000 names."}, {"url": "http://www.thenamemeaning.com/vadim/", "passage_text": "The first thing you should know if you are considering Vadim for your baby's name is that in most countries all over the world the name Vadim is a boy name. The name Vadim is of Russian origin, and is used mostly in Russian speaking countries but also in a few other countries and languages of the world."}, {"url": "http://www.babynamespedia.com/meaning/Vadim", "passage_text": "In addition, Vadim is a variant form of the Czech, English, and Hungarian Vladimir vladimír in The russian. Language variant forms Of vadim include the Name, vad the Name, vadeem the Name, vadeeme the Name, vadem The Russian, vadik the Name, vadime the Name, vadym and the Name. vadyme"}]