[{"url": "http://healthyeating.sfgate.com/benefits-eating-fresh-red-seedless-grapes-5309.html", "passage_text": "While red seedless grapes aren't a great source of minerals, they do provide 176 milligrams of potassium, or five percent of the DV, per one-cup serving, as well as smaller amounts of magnesium, zinc, iron, calcium and phosphorus. Each one-cup serving of grapes contains 62 calories, 0.6 grams of protein, 0.3 grams of fat and 15.8 grams of carbohydrate, including 0.8 grams of fiber. (See Reference 1) This is about three percent of the daily 25-gram value for fiber for people who eat a 2,000-calorie diet."}, {"url": "http://healthyeating.sfgate.com/benefits-eating-fresh-red-seedless-grapes-5309.html", "passage_text": "Grapes are a source of vitamins, with each cup providing 13.4 micrograms of vitamin K, or 17 percent of the daily value; 3.7 milligrams of vitamin C and 0.09 milligrams of thiamine, or six percent of the daily value for each of the latter two nutrients; and 0.1 milligrams of vitamin B-6, or five percent of the DV. Each one-cup serving of grapes contains 62 calories, 0.6 grams of protein, 0.3 grams of fat and 15.8 grams of carbohydrate, including 0.8 grams of fiber. (See Reference 1) This is about three percent of the daily 25-gram value for fiber for people who eat a 2,000-calorie diet."}, {"url": "http://www.livestrong.com/article/247614-what-vitamins-do-grapes-contain/", "passage_text": "Thiamin Source. Every 1-cup serving of fresh grapes supplies 0.1 milligram of thiamin, or vitamin B-1. Consuming this amount of grapes would fulfill 8.3 percent of a man's daily requirement of the nutrient and 9 percent of a woman's recommended intake. "}, {"url": "http://www.nutrition-and-you.com/grapes.html", "passage_text": "Grapes are rich source of micronutrient minerals like copper, iron and manganese. Copper and manganese are an essential co-factor of antioxidant enzyme, superoxide dismutase. Iron is especially concentrated in raisins. In addition, 100 g of fresh grapes contain about 191 mg of health benefiting electrolyte, potassium. Catechins, a type of flavonoid tannin group of anti-oxidants, found in the white/green varieties have also shown to possess these health-protective functions. 1  In addition, the berries are very low in calories. 2  100 g fresh grapes just provide 69 calories but zero cholesterol levels."}, {"url": "http://calraisins.org/professionals/healthy-benefits-of-raisins/nutrition-faqs/", "passage_text": "If so, why? A: The recognized serving of raisins is about 1/4 cup or 43 grams and that contains nearly 1 milligram (0.81mg) of iron while a 1-cup serving of fresh grapes at 126 grams has less than 0.5 milligram (0.45mg). "}, {"url": "http://www.fitday.com/fitness-articles/nutrition/healthy-eating/the-nutritional-food-value-of-grapes.html", "passage_text": "In addition to being a convenient snack for you, grapes are also an excellent source of several different vitamins and nutrients that help keep you healthy. They can even prevent and help treat certain diseases. Here are just a few of the vitamins and nutrients presents in a single serving of grapes: 1. Vitamin C. Grapes contain high levels of vitamin C. Vitamin C is a powerful antioxidant that assists your body in ridding itself of free radicals within the body. These radicals can attack your cells, weaken your immune system and allow your body to catch certain diseases. In addition to the vitamins and nutrients listed above, grapes also have high levels of manganese in them. Manganese helps the body build stronger bones and also builds the connective tissue throughout your body."}, {"url": "http://www.nutrition-and-you.com/grapes.html", "passage_text": "One of the popular among everyday fruits, grapes are widely viewed in many cultures as “the queen of fruits since earlier times. These tiny berries of Europe and Mediterranean regions are the storehouse of numerous health promoting phyto-nutrients such as poly-phenolic antioxidants, vitamins, and minerals. Catechins, a type of flavonoid tannin group of anti-oxidants, found in the white/green varieties have also shown to possess these health-protective functions. 1  In addition, the berries are very low in calories. 2  100 g fresh grapes just provide 69 calories but zero cholesterol levels."}, {"url": "http://www.medicalnewstoday.com/articles/271156.php", "passage_text": "Grapes contain powerful antioxidants known as polyphenols, which may slow or prevent many types of cancer, including esophageal, lung, mouth, pharynx, endometrial, pancreatic, prostate and colon. 1. The resveratrol found in red wine famous for heart health is a type of polyphenol found in the skins of red grapes. Eating foods that are high in water content like grapes, watermelon and cantaloupe can help to keep you hydrated and your bowel movements regular. Grapes also contain fiber, which is essential for minimizing constipation."}, {"url": "http://www.medicalnewstoday.com/articles/271156.php", "passage_text": "Knowledge center. The ways to consume grapes are endless-from red, green and purple grapes to seedless grapes, grape jelly, grape jam and grape juice. And don't forget wine and raisins! This popular fruit's history goes back as far as 8,000 years, when grape vines were first cultivated in what is now the Middle East. Eating foods that are high in water content like grapes, watermelon and cantaloupe can help to keep you hydrated and your bowel movements regular. Grapes also contain fiber, which is essential for minimizing constipation."}]