[{"url": "http://www.answers.com/Q/What_kinds_of_tissues_make_up_the_cardiac_conduction_system", "passage_text": "Cardiac Muscle found in the hearts chambers right and left atrium and riht and left ventricle. This tissue perform the pumping of the heart. Smooth muscle tissues provide sta … bility and flexibility so that the large arteries can contract and expand. Edothelial cells line the chambers and vessels. Cardiac muscle, different from skeletal muscle, is composed of separate cellular elements. A cardiac muscle cell has a large nucleus and numerous mitochondria. The elevated concentration of mitochondria reveals the huge energy burden that predominant"}, {"url": "http://www.innerbody.com/image/nervov.html", "passage_text": "The majority of the nervous system is tissue made up of two classes of cells: neurons and neuroglia. 1  Neurons. 2  There are 3 basic classes of neurons: afferent neurons, efferent neurons, and interneurons. 3  Afferent neurons. 4  Efferent neurons. 5  Interneurons. 6  Neuroglia. Nerves. Nerves are bundles of axons in the peripheral nervous system (PNS) that act as information highways to carry signals between the brain and spinal cord and the rest of the body. Each axon is wrapped in a connective tissue sheath called the endoneurium."}, {"url": "http://emedicine.medscape.com/article/1922987-overview", "passage_text": "Overview. The conducting system of the heart consists of cardiac muscle cells and conducting fibers (not nervous tissue) that are specialized for initiating impulses and conducting them rapidly through the heart (see the image below). They initiate the normal cardiac cycle and coordinate the contractions of cardiac chambers. For the heart to pump efficiently and the systemic and pulmonary circulations to operate in synchrony, the events in the cardiac cycle must be coordinated. Schematic illustration of the cardiac conduction system."}, {"url": "http://www.answers.com/Q/What_kinds_of_tissues_make_up_the_cardiac_conduction_system", "passage_text": "Making the world better, one answer at a time. Cardiac muscle is a type of involuntary striated muscle found in the walls of the heart, particularly the myocardium. Cardiac muscle cells are identified as cardiac myocytes or cardiomyocytes. Cardiac muscle is one of three major types of muscle, the others being skeletal and smooth muscle. Cardiac muscle, different from skeletal muscle, is composed of separate cellular elements. A cardiac muscle cell has a large nucleus and numerous mitochondria. The elevated concentration of mitochondria reveals the huge energy burden that predominant the heart."}, {"url": "http://www.heart-consult.com/articles/electrical-conduction-system-heart", "passage_text": "The structure that makes up the conduction system of the heart are: 1  Sinoatrial node(SA node)– electrical impulses of heart arises form this structure which is situated in the wall of the right atrium. 2  Internodal atrial pathways – there are three conduction pathways between SA node and AV node. The normal electrical conduction in the heart allows the impulse that is generated by the sinoatrial node(SA node), situated in the walls of right atrium of the heart to be propagated to and stimulate the muscle of the atria and ventricles(myocardium)."}, {"url": "http://www.hopkinsmedicine.org/healthlibrary/conditions/cardiovascular_diseases/anatomy_and_function_of_the_hearts_electrical_system_85,P00214/", "passage_text": "The heart's electrical system. The heart is, in the simplest terms, a pump made up of muscle tissue. Like all muscle, the heart requires a source of energy and oxygen in order to function. The heart's pumping action is regulated by an electrical conduction system that coordinates the contraction of the various chambers of the heart."}, {"url": "https://en.wikipedia.org/wiki/Tissue_(biology)", "passage_text": "Grouped in to four basic types: connective, muscle, nervous, and epithelial. Multiple tissue types compose organs and body structures. While all animals can generally be considered to contain the four tissue types, the manifestation of these tissues can differ depending on the type of organism. Epithelial tissue helps to protect organs from microorganisms, injury, and fluid loss. Functions of epithelial tissue: 1  the cells of the body surface form the outer layer of skin. 2  inside the body, epithelial cells form the lining of the mouth & alimentary canal & protect these organs."}, {"url": "https://en.wikipedia.org/wiki/Electrical_conduction_system_of_the_heart", "passage_text": "The normal electrical conduction in the heart allows the impulse that is generated by the sinoatrial node (SA node) of the heart to be propagated to, and stimulate, the cardiac muscle (myocardium). "}, {"url": "https://en.wikipedia.org/wiki/Tissue_(biology)", "passage_text": "Connective tissues are fibrous tissues. They are made up of cells separated by non-living material, which is called an extracellular matrix. This matrix can be liquid or rigid. For example, blood has plasma as its matrix and bone's matrix is rigid.Connective tissue gives shape to organs and holds them in place. Epithelial tissue helps to protect organs from microorganisms, injury, and fluid loss. Functions of epithelial tissue: 1  the cells of the body surface form the outer layer of skin. 2  inside the body, epithelial cells form the lining of the mouth & alimentary canal & protect these organs."}, {"url": "http://www.answers.com/Q/Fibers_of_the_cardiac_conduction_system_are_what_kind_of_specalized_tissue", "passage_text": "Cardiac tissue is made of cardiac muscle cells and a small amount of connective tissue. The cells that make this tissue are called cardiocytes. They have the special ability t … o beat on their own with no nerve stimulation. If one touches another beating cell, they will begin to beat together. "}]