[{"url": "http://www.moneycontrol.com/glossary/bank-deposits/nro_4135.html", "passage_text": "NRO. NRO stands for Non-Resident Ordinary account. It refers to the savings or Fixed Deposit account of a Non-resident Indian in a bank in India. This is a Rupee account. Interest earned in this account is taxable. The account can be jointly held with a resident Indian. "}, {"url": "http://window2india.com/cms/admin/article.jsp?aid=2322", "passage_text": "A Non-Resident Ordinary (NRO) account is the normal bank account opened by an Indian going abroad with the intention of becoming an NRI. An NRI can also open this account by sending remittances from his home country or by transferring funds from his other NRO account. It’s easy to transfer funds fromanNREto an NRO account. But it’s not possible to transfer funds from an NRO account to an NRE account. Once you transfer funds fromanNREtoanNRO account, the amount is non-repatriable."}, {"url": "http://www.moneycontrol.com/news/fixed-income-bank-deposits/knowdifference-between-nrenro-account_875207.html", "passage_text": "Primarily there are two reasons for opening such account: NRI wants to repatriate overseas earned money back to India and/or NRI wants to keep India based earnings in India. NRI has the option of opening a Non Resident Rupee (NRE) account and/or a Non Resident Ordinary Rupee (NRO) account. An NRO account can also be opened by a Person of Indian Origin (PIO) and an Overseas citizen of India (OCI). Similarities between NRE and NRO accounts: Both accounts can be opened as Savings as well as current accounts and are Indian Rupee accounts. Tax Treatment: NRE account is Tax free (no Income tax, wealth tax and gift tax) in India. On the other hand the interest earned in NRO account and credit balances are subject to respective income tax bracket and are also subject to applicable wealth and gift tax."}, {"url": "http://www.deposits.org/dictionary/term/nro-account/", "passage_text": "NRO Account. NRO Account Meaning: In India banking terminology, the term Non-Residential Ordinary or NRO Account refers to funds deposited with an Indian financial institution opened by an Indian national with the intention of becoming a Non-Resident Indian or NRI. An NRO account is kept in Indian rupees and cannot be converted and repatriated into foreign currency. NRO Account Example: For example, a NRO Account is generally opened in India as a normal bank account by an Indian national before leaving the country to work abroad. A Non-Resident Ordinary or NRO Account allows Indian nationals working abroad to receive funds in Indian rupees or in foreign currency"}, {"url": "http://nrirealtynews.com/nri-banking/nro-account.php", "passage_text": "1 Any person or entity residing outside India is entitled to open a NRO account with an authorised dealer or an authorised bank for transactions conducted in Indian Rupees. 2  Individuals or entities of Bangladeshi or Pakistani nationality or ownership require approval from the RBI. Eligibility. 1 "}, {"url": "http://www.compareremit.com/money-transfer-guide/difference-between-nre-and-nro-account/", "passage_text": "An NRE account is a savings or current account held in India that allows the account holder to repatriate funds that come from outside earnings and transfer earnings to India conveniently and securely. Money transferred to an NRE account from any foreign currency is converted to INR. The differences between NRE and NRO accounts are outlined below in the following account features. 1  Repatriation: Repatriation is defined as sending or bringing money back to the foreign country. 2  You can easily repatriate funds from an NRE account including the interest earned in that account."}, {"url": "http://www.compareremit.com/money-transfer-guide/difference-between-nre-and-nro-account/", "passage_text": "An NRO account is a savings or current account held in India that helps NRIs manage income earned in India such as rent, dividends, or pension from abroad. The account holder can deposit and manage accumulated rupee funds conveniently through an NRO account. Foreign currency deposited into the NRO account is converted into Indian Rupees. Any NRI can open a NRO account. NRIs may also convert their existing resident savings account into an NRO account when their status changes from resident to non-resident. The differences between NRE and NRO accounts are outlined below in the following account features. 1  Repatriation: Repatriation is defined as sending or bringing money back to the foreign country. 2  You can easily repatriate funds from an NRE account including the interest earned in that account."}, {"url": "http://www.goodreturns.in/classroom/2013/03/what-is-the-difference-between-nre-nro-account-166233.html", "passage_text": "Share this on your social network: If a person is a Non Resident Indian (NRI), he can open two kinds of account in India-a non-resident rupee accounts (NRE), and non resident ordinary rupee accounts (NRO). Here's the difference between the two. NRE: In this account rupee denominations can be maintained."}]