[{"url": "http://www.healthline.com/health/jaundice-yellow-skin", "passage_text": "Causes of Jaundice. Old red blood cells travel to your liver, where they’re broken down. Bilirubin is the yellow pigment formed by the breakdown of these old cells. Jaundice occurs when your liver doesn’t metabolize bilirubin the way it’s supposed to. Your liver might be damaged and unable to perform this process."}, {"url": "http://www.rightdiagnosis.com/sym/yellow_skin.htm", "passage_text": "Yellow skin is a serious symptom needing prompt professional diagnosis, because it is most commonly caused by jaundice with various possible underlying causes of jaundice including severe liver conditions. It is important to check for yellow eyes in addition to yellow skin. There are likely to be other possible causes, so ask your doctor about your symptoms. 1  Jaundice-see also various causes of jaundice. 2  Carotenemia-causes more orange skin than yellow skin. 3  Beta-carotene dietary excess-usually"}, {"url": "http://www.emedicinehealth.com/jaundice/article_em.htm", "passage_text": "Jaundice is a yellow discoloration of the skin, mucous membranes, and the whites of the eyes caused by increased amounts of bilirubin in the blood. Jaundice is a sign of an underlying disease process. Bilirubin is a by-product of the daily natural breakdown and destruction of red blood cells in the body. "}, {"url": "http://www.rightdiagnosis.com/sym/yellow_skin.htm", "passage_text": "1 Jaundice-see also various causes of jaundice. 2  Carotenemia-causes more orange skin than yellow skin. 3  Beta-carotene dietary excess-usually more orange skin than yellow skin. 4  Hypothyrodism. 5  Pernicious anemia. 6  Uremia-causing a dry yellow-brown skin. 7  Xanthomata-small yellow fat deposits under the skin. There are likely to be other possible causes, so ask your doctor about your symptoms. 1 "}, {"url": "http://www.nytimes.com/health/guides/symptoms/jaundice-yellow-skin/overview.html", "passage_text": "Jaundice is a yellow color in the skin, mucus membranes, or eyes. The yellow pigment is from bilirubin, a byproduct of old red blood cells. Jaundice is also a symptom of other disorders. This article is about jaundice in children and adults. "}, {"url": "http://www.healthline.com/health/jaundice-yellow-skin", "passage_text": "If you only have yellow skin, it’s more likely due to having too much beta-carotene in your system. Beta-carotene is an antioxidant found in carrots and pumpkins. An excess of this antioxidant is not a cause of jaundice. Old red blood cells travel to your liver, where they’re broken down. Bilirubin is the yellow pigment formed by the breakdown of these old cells. Jaundice occurs when your liver doesn’t metabolize bilirubin the way it’s supposed to. Your liver might be damaged and unable to perform this process."}, {"url": "http://www.healthline.com/health/jaundice-yellow-skin", "passage_text": "Jaundice is the medical term that describes yellowing of the skin and eyes. This condition forms when there is too much bilirubin in your system. Bilirubin is a yellow pigment that is formed by the breakdown of dead red blood cells in the liver. Old red blood cells travel to your liver, where they’re broken down. Bilirubin is the yellow pigment formed by the breakdown of these old cells. Jaundice occurs when your liver doesn’t metabolize bilirubin the way it’s supposed to. Your liver might be damaged and unable to perform this process."}, {"url": "http://www.healthline.com/health/jaundice-yellow-skin", "passage_text": "Symptoms of Jaundice. Yellow-tinted skin and eyes characterize jaundice. In more severe cases, the whites of your eyes may turn brown or orang-colored. You may also have dark urine and pale stools. Old red blood cells travel to your liver, where they’re broken down. Bilirubin is the yellow pigment formed by the breakdown of these old cells. Jaundice occurs when your liver doesn’t metabolize bilirubin the way it’s supposed to. Your liver might be damaged and unable to perform this process."}, {"url": "http://symptomchecker.webmd.com/multiple-symptoms?symptoms=pale-skin%7Cyellow-skin&symptomids=174%7C259&locations=66%7C68", "passage_text": "Pale skin and Yellow skin. WebMD Symptom Checker helps you find the most common medical conditions indicated by the symptoms pale skin and yellow skin including Anemia, Anemia, iron deficiency, and Hypothyroidism (adult). There are 26 conditions associated with pale skin and yellow skin. The links below will provide you with more detailed information on these medical conditions from the WebMD Symptom Checker and help provide a better understanding of causes and treatment of these related conditions."}, {"url": "http://www.rightdiagnosis.com/sym/yellow_skin.htm", "passage_text": "1 Carotenemia-causes more orange skin than yellow skin. 2  Beta-carotene dietary excess-usually more orange skin than yellow skin. 3  Hypothyrodism. 4  Pernicious anemia. 5  Uremia-causing a dry yellow-brown skin. 6  Xanthomata-small yellow fat deposits under the skin. There are likely to be other possible causes, so ask your doctor about your symptoms. 1  Jaundice-see also various causes of jaundice. 2  Carotenemia-causes more orange skin than yellow skin. 3"}]