[{"url": "http://www.configure.telstra.com.au/", "passage_text": "This service allows you to set up your compatible Telstra mobile phone for BigPond Mobile Services, Picture and Video Messaging (MMS), e-mail on your phone and much, much more."}, {"url": "http://www.youtube.com/watch?v=h_CGdUT8ieQ", "passage_text": "the outlook.com app for any reason, you can set up your email. directly on your device's email app. Here's how. Go to Apps, Settings, and then tap Accounts. Next, choose Add Account... ..and select Email."}, {"url": "http://www.youtube.com/watch?v=h_CGdUT8ieQ", "passage_text": "set up your email account. if you're on the. outlook.com mailbox service, then we'll look at BigPond. To set up your account. for outlook.com, go to Apps and select Play Store, then enter your Google email. and password if prompted."}, {"url": "http://www.configure.telstra.com.au/", "passage_text": "Search. This service allows you to set up your compatible Telstra mobile phone for BigPond Mobile Services, Picture and Video Messaging (MMS), e-mail on your phone and much, much more. To set up your mobile phone quickly and easily, click Set up."}, {"url": "http://www.youtube.com/watch?v=D6Fq4Qx7OCc", "passage_text": "tests the settings, press 'close'. and 'finish'. To set up your email. on the BigPond mailbox service, go to File. and then Add Account. Next, enter your name, email address and password. and click 'next'."}, {"url": "http://www.youtube.com/watch?v=D6Fq4Qx7OCc", "passage_text": "Transcript: To set up your BigPond. email account, you'll firstly need to confirm. your customer details. If you're not sure what they are, follow this link and it'll. take you to our webmail site. Here, enter either your BigPond. or Telstra username and password."}, {"url": "http://www.youtube.com/watch?v=h_CGdUT8ieQ", "passage_text": "To set up your email. on the BigPond mailbox service, go to Apps, Settings, then tap Accounts. Now Add Account, and select Email. Enter your email address. and password. and then press Manual Setup."}, {"url": "http://www.youtube.com/watch?v=h_CGdUT8ieQ", "passage_text": "To set up your BigPond. email account, you'll firstly need to confirm. your customer details. If you're not sure what they are, follow this link and it'll. take you to our webmail site. Here, enter either your BigPond. or Telstra username and password."}]