[{"url": "http://www.salarylist.com/jobs/Construction-Worker-Salary.htm", "passage_text": "Construction Worker Salary. Construction Worker average salary is $34,775, median salary is $32,053 with a salary range from $23,067 to $65,000. Construction Worker salaries are collected from government agencies and companies. Each salary is associated with a real job position. Construction Worker salary statistics is not exclusive and is for reference only. They are presented as is and updated regularly."}, {"url": "http://www.bls.gov/ooh/Construction-and-Extraction/Construction-laborers-and-helpers.htm", "passage_text": "$26,570. The median annual wage for construction laborers and helpers was $29,160 in May 2012. The median wage is the wage at which half the workers in an occupation earned more than that amount and half earned less. The lowest 10 percent earned less than $18,840, and the top 10 percent earned more than $55,75"}, {"url": "http://money.usnews.com/careers/best-jobs/construction-worker", "passage_text": "Salary. Construction workers perform the important task of building our infrastructure, so their median salary – one that’s just over $30,000 – may seem surprising. In 2013, the highest paid in the profession earned $58,900 per year, and the lowest paid earned less than $20,000. The average salary for construction workers in 2013 was $35,020. The metropolitan areas that best pay their construction workers are Leominster, Massachusetts; Gary, Indiana; and Brockton, Massachusetts"}, {"url": "http://www1.salary.com/Construction-Manager-I-salary.html", "passage_text": "For example the median expected annual pay for a typical Construction Manager I in the United States is $100,612 so 50% of the people who perform the job of Construction Manager I in the United States are expected to make less than $100,612. Source: HR Reported data as of October 2015. Median $100,612. 1  Salary. "}, {"url": "http://www.ehow.com/about_7414297_average-construction-worker_s-salary.html", "passage_text": "National Salary. Construction laborers earned a mean hourly wage of $15.96 and a mean, or average, annual salary of $33,190 in May 2009, according to the Bureau of Labor Statistics. Annual wages for the middle 50 percent of construction laborers ranged from $22,700 to $39,750. "}, {"url": "http://money.usnews.com/careers/best-jobs/construction-worker/salary", "passage_text": "Salary Outlook. Construction workers perform the important task of building our infrastructure, so their median salary – one that’s just over $30,000 – may seem surprising. In 2013, the highest paid in the profession earned $58,900 per year, and the lowest paid earned less than $20,000. The average salary for construction workers in 2013 was $35,020. The metropolitan areas that best pay their construction workers are Leominster, Massachusetts; Gary, Indiana; and Brockton, Massachusetts. Average Construction Worker Pay vs. Other Best Jobs. Those working as general construction laborers made an average salary of $35,020 in 2013, which is generally less than what those who specialize in a specific trade take home."}, {"url": "http://www.simplyhired.com/salaries-k-construction-worker-jobs.html", "passage_text": "Average Construction Worker Salaries. The average salary for construction worker jobs is $38,000. Average construction worker salaries can vary greatly due to company, location, industry, experience and benefits. This salary was calculated using the average salary for all jobs with the term construction worker anywhere in the job listing."}, {"url": "https://www.open.edu.au/careers/construction/construction-workers", "passage_text": "1 Average salary: $52,500 P/A. * 2  Wages will vary according to your level of skill, experience and employer. 3  Employment level: 46,100 as of November 2012 (Projected employment levels in 2017 of 51,900). 4  Average weekly hours: Average weekly hours worked for a full time Construction Worker is 40.2 hours. "}, {"url": "http://www.payscale.com/research/US/Job=Construction_Worker/Hourly_Rate", "passage_text": "Job Description for Construction Worker. Read More... A construction worker typically works as part of a team on a construction site (such as for a building, home, or other structure). This person may be responsible for a number of tasks, including carpentry, demolition, drywall, finishing, and roofing. A construction worker’s hours may vary depending on the needs at the job site; work is typically done during the day and may involve difficult conditions such as extreme heat and cold. Construction workers may work long days, weekends, and holidays, depending on the job deadline. "}]