[{"url": "http://www.answers.com/Q/What_do_black_swallowtail_eat", "passage_text": "Black Swallowtails Usually eat leaves,Dill,fruits,Parsley and rue so if you have plenty of these in your garden your caterpillars won't starve. Black swallowtails eat plenty and grow quicky. If you have more than one caterpillar you may have to buy/plant more Dill and parsley. "}, {"url": "http://www.fcps.edu/islandcreekes/ecology/eastern_black_swallowtail.htm", "passage_text": "Some people consider the caterpillars of this butterfly to be a pest, since they eat parsley, carrots, and other garden plants. Many people enjoy butterfly-watching and collecting, and the Eastern Black Swallowtail is considered by most to be a handsome specimen. The Eastern Black Swallowtail is a common swallowtail butterfly, often confused with the Pipevine Swallowtail or female Tiger Swallowtail. Both male and female Eastern Black Swallowtails are bluish-black with yellow spots on the wings."}, {"url": "http://www.joyfulbutterfly.com/what-do-butterflies-eat/", "passage_text": "In fact, you may find that in one part of the country the butterflies may prefer to eat from one type of nectar plant and in another area they may prefer a different nectar plant. Butterfly nectar plant preferences can even vary from garden to garden which may be due to changes in soil types, pH, etc. Each species of butterflies has nectar plants that they prefer but many adult butterflies will feed from a wide variety of nectar sources. Butterflies are not as specific in their food source as are their caterpillars."}, {"url": "http://www.joyfulbutterfly.com/black-swallowtail-butterflies-indoors/", "passage_text": "Raising a Black Swallowtail butterfly indoors is fun, easy, and educational. Black Swallowtail butterflies are great to raise indoors for several reasons including abundance, plentiful food source, attractive and interesting caterpillars, and of course beautiful butterflies. The host plants of the Black Swallowtail butterfly include such plants as carrots, parsley, dill, fennel, Queen Anne’s Lace and rue. The Anise Swallowtail caterpillar feeds on anise as well and reportedly citrus plants also"}, {"url": "http://queenbjan.com/swallowtail_butterfly_project.htm", "passage_text": "Swallowtail Butterfly Project--Round Two After some searching I found some parsley plants in a roadside plant and produce market. My plan was to set several potted parsley plants in the flowerbed at school since there were many butterflies that frequented these flowers. I saw a black swallowtail butterfly lay eggs on my parsley one Monday morning. I didn't have a camera at the time to get a picture of the butterfly, but here is a picture of a few of her eggs. In about two days the eggs hatched, but I couldn't find the caterpillars."}, {"url": "http://queenbjan.com/swallowtail_butterfly_project.htm", "passage_text": "Swallowtail Butterfly Project Text 2004 Janice Green Photos 2004 Dave Green and Janice Green When my daughter was very young we found a caterpillar on my parsley plant in the yard. We put the caterpillar in a jar and continued to feed it parsley. Eventually it formed a pupa and hatched into a black swallowtail butterfly. This background experience was the inspiration for my butterfly project. I saw a black swallowtail butterfly lay eggs on my parsley one Monday morning. I didn't have a camera at the time to get a picture of the butterfly, but here is a picture of a few of her eggs. In about two days the eggs hatched, but I couldn't find the caterpillars."}, {"url": "http://whatdocaterpillarseat.com/what-black-swallowtail-caterpillar-eats.html", "passage_text": "Black Swallowtail caterpillars will eat parsley, dill, fennel and rue, so if you have plenty of these in your garden your caterpillars won’t starve, unless you have too many caterpillars. Giving parsley or dill from the grocery store to Black Swallowtail caterpillars may be possible if they are starving and you don’t have any suitable plants in your garden. But many caterpillar owners will urge against this: grocery food may contain chemicals toxic to Black Swallowtail"}, {"url": "http://outlawgarden.com/2012/05/22/please-dont-tease-the-parsley-worm/", "passage_text": "Parsley worms (aka. black swallowtail butterfly caterpillars) grow quickly, and the one living in my parsley plant is no exception. This caterpillar is packing on the grams at an impressive pace. You saw the photo I posted a few days ago. Parsley seeds are very easy to start and I have a parsley plant that is now 2 years old. It lives through the winter it seems, at least the north Texas winter. I have now had three hatchings of parsley worms this spring and summer! Three generations of beautiful swallowtails."}, {"url": "http://www.joyfulbutterfly.com/what-do-butterflies-eat/", "passage_text": "Most butterflies eat (actually they “drink”) from nectar plants (while the plants that caterpillars eat are called host plants). Each species of butterflies has nectar plants that they prefer but many adult butterflies will feed from a wide variety of nectar sources. Butterflies are not as specific in their food source as are their caterpillars. A few adult butterfly species even prefer rotting fruit and dung as opposed to nectar"}]