[{"url": "http://www.visitfrasercoast.com/destinations/fraser-island/accommodation/kingfisher-bay-resort", "passage_text": "More Info. Kingfisher Bay Resort is located north of the Sunshine Coast and is the gateway to the World Heritage wilderness of Fraser Island, its ancient rainforest, spectacular fresh-water lakes and famous 75-Mile Beach. "}, {"url": "http://www.seefraserisland.com/", "passage_text": "Welcome to the Fraser Island, one of Queensland's most sought after holiday destinations. Offering a wide range of accommodation and tours Fraser Island is located approximately three and a half hour drive north of Brisbane and is easily accessible via a barge. Fraser Island also has an abundance of experiences to offer, from Whale Watching in Hervey Bay to World Heritage listed Fraser Island and Lady Elliot Island Resort on the Great Barrier Reef."}, {"url": "http://www.kingfisherbay.com/getting-here/fraser-coast/fraser-island-map.html", "passage_text": "About Fraser Island. Stretching over 123 kilometres along the southern coast of Queensland, Fraser Island is the largest sand island in the world. ...read more. "}, {"url": "http://www.tourfraserisland.com.au/fraser_island_about_fraser_island_location.html", "passage_text": "Fraser Island-Location & Getting There. Fraser Island is situated just off the mainland of Australia in the Fraser Coast region of Queensland and is approx 250km north from Queensland's captial city, Brisbane. Access to the island is done via ferry. There are several feries departing and returning to Fraser Island throughout the day. Fraser Island-From Hervey Bay. Hervey Bay is approx a 3hr drive north of Brisbane and approx 2hr's north of Noosa. From Gympie follow ther Bruce Highway north and take the Maryborough exit."}, {"url": "http://www.seefraserisland.com/", "passage_text": "Fraser Island is the largest sand island in the world, its breath taking beauty and natural attractions makes it one of the most sought after destinations on the fraser coast for holiday accommodation and tours. Fraser Island also has an abundance of experiences to offer, from Whale Watching in Hervey Bay to World Heritage listed Fraser Island and Lady Elliot Island Resort on the Great Barrier Reef."}, {"url": "https://en.wikipedia.org/wiki/Fraser_Island", "passage_text": "Fraser Island is a heritage-listed island located along the southern coast of Queensland, Australia, approximately 200 kilometres (120 mi) north of Brisbane. It is a locality within the Fraser Coast Region. Its length is about 120 kilometres (75 mi) and its width is approximately 24 kilometres (15 mi). It was inscribed as a World Heritage site in 1992. The island is considered to be the largest sand island in the world at 1840 km 2. The freshwater lakes on Fraser Island are some of the cleanest lakes in the world. A popular tourist area is Lake McKenzie which is located inland from the small town of Eurong. It is a perched lake sitting on top of compact sand and vegetable matter 100 metres (330 ft) above sea level."}, {"url": "http://www.australia.com/en/places/fraser-island.html", "passage_text": "Queensland. Welcome to World Heritage-listed Fraser Island, the world’s largest sand island. Embrace nature on World Heritage-listed Fraser Island, a short ferry ride from Hervey Bay on Queensland's Fraser Coast. On the world's largest sand island, you can 4WD next to coloured sand cliffs, hike through rainforest, meet native wildlife, whale-watch and swim in freshwater lakes ringed with gold."}, {"url": "http://www.fraserisland.net/", "passage_text": "Fraser Island stretches over 123 kilometres in length and 22 kilometres at its widest point. With an area of 184 000 hectares it is the largest sand island in the world. Fraser Island's World Heritage listing ranks it with Australia's Uluru, Kakadu and the Great Barrier Reef. Fraser Island is a precious part of Australia's natural and cultural heritage, it is protected for all to appreciate and enjoy."}, {"url": "http://www.visitfrasercoast.com/destinations/islands", "passage_text": "Fraser Island. Just off the coast of Hervey Bay, is World Heritage listed Fraser Island; the largest sand island in the world and the only place on the planet where rainforest grows on sand! Over 120 kilometres long, the Island has developed over 800,000 years and is a unique natural environment. Lady Elliot Island is the start of the World Heritage listed Great Barrier Reef located just off the tip of Fraser Island and is a 40 minute scenic flight from Hervey Bay."}]