[{"url": "http://classroom.synonym.com/types-spore-forming-bacteria-2504.html", "passage_text": "Some bacteria are capable of forming spores around themselves, which allow the organism to survive in hostile environmental conditions. Bacterial spores are made of a tough outer layer of keratin that is resistant to chemicals, staining and heat. Bacillus is a fairly large group with many members, including Bacillus cereus, Bacillus clausii and Bacillus halodenitrificans. Bacillus spores, also called endospores, are resistant to harsh chemical and physical conditions. This makes the bacteria able to withstand disinfectants, radiation, desiccation and heat."}, {"url": "https://micro.cornell.edu/research/epulopiscium/bacterial-endospores", "passage_text": "When favored nutrients are exhausted, some bacteria may become motile to seek out nutrients, or they may produce enzymes to exploit alternative resources. One example of an extreme survival strategy employed by certain low G+C Gram-positive bacteria is the formation of endospores. "}, {"url": "https://en.wikipedia.org/wiki/Bacterial_spore", "passage_text": "A bacterial spore is a spore or spore-like structure produced by bacteria. These include endospores, Akinetes, and spores produced by Actinobacteria and Azotobacter. Spore formation in bacteria is not the principal method of reproduction but simply a method of surviving unfavourable conditions. They have a number of features: 1  They can tolerate extreme dryness. "}, {"url": "http://classroom.synonym.com/types-spore-forming-bacteria-2504.html", "passage_text": "Bacillus. Bacillus is a specific genus of rod-shaped bacteria that are capable of forming spores. They are sporulating, aerobic and ubiquitous in nature. Bacillus is a fairly large group with many members, including Bacillus cereus, Bacillus clausii and Bacillus halodenitrificans. Bacillus spores, also called endospores, are resistant to harsh chemical and physical conditions. This makes the bacteria able to withstand disinfectants, radiation, desiccation and heat."}, {"url": "https://en.wikipedia.org/wiki/Endospore", "passage_text": "An endospore is a dormant, tough, and non-reproductive structure produced by certain bacteria from the Firmicute phylum. The name endospore is suggestive of a spore or seed-like form (endo means within), but it is not a true spore (i.e., not an offspring). It is a stripped-down, dormant form to which the bacterium can reduce itself. Examples of bacteria that can form endospores include Bacillus and Clostridium. The endospore consists of the bacterium's DNA, ribosomes and large amounts of dipicolinic acid. Dipicolinic acid is a spore-specific chemical that appears to help in the ability for endospores to maintain dormancy."}, {"url": "http://faculty.ccbcmd.edu/courses/bio141/lecguide/unit1/prostruct/spore.html", "passage_text": "Endospores are dormant alternate life forms produced by the genus Bacillus, the genus Clostridium, and a number other genera of bacteria, including Desulfotomaculum, Sporosarcina, Sporolactobacillus, Oscillospira, and Thermoactinomyces. Fundamental Statements for this Learning Object: 1. Endospores are dormant alternate life forms produced by a few genera of bacteria. 2. The genus Bacillus (an obligate aerobe often living in the soil) and the genus Clostridium (an obligate anaerobe living in the gastrointestinal tract of animals) produce endospores. 3"}, {"url": "http://www.answers.com/Q/Does_bacteria_produce_spores", "passage_text": "spores are also known as endospores. Endospores are produced by Gram-positive bacteria from the Firmicute phylum that forms when a bacterium produces a thick internal wall tha … t encloses its DNA and part of its cytoplasm. Examples include, but are not limited to, Bacillus and Clostridium. 7 people found this useful"}]