[{"url": "https://en.wikipedia.org/wiki/B_vitamins", "passage_text": "B vitamin supplement tablets. B vitamins are a class of water-soluble vitamins that play important roles in cell metabolism. Though these vitamins share similar names, research shows that they are chemically distinct vitamins that often coexist in the same foods. In general, supplements containing all eight are referred to as a vitamin B complex."}, {"url": "http://www.livestrong.com/article/22253-foods-high-b-vitamins/", "passage_text": "The B vitamins include thiamin, riboflavin, niacin, folate (also called folic acid or folacin), vitamin B6, vitamin B12, biotin and pantothenic acid. Photo Credit Jupiterimages/Photos.com/Getty Images. Some of the best sources of vitamin B6 are poultry, seafood, bananas, leafy green vegetables such as spinach, potatoes and fortified cereals. Your diet should include 1.3 milligrams of B-6 daily to support new red blood cell growth."}, {"url": "http://www.livestrong.com/article/36523-foods-vitamin-b-e/", "passage_text": "Of the B vitamins in food—B1, B2, B6, B12, niacin, folic acid, biotin, and pantothenic acid—B6 and B12 are essential vitamins for red blood cell formation and hundreds of other growth and catalyst functions. Vitamin B. Label nutrition facts help you choose prepared cereals enriched with vitamins B6 and B12. Adults ages 19 through 50 need 1.3 mg of B6 vitamins in food or supplements per day. Those ages 14 and up require 2.4 mg of vitamin B12 per day."}, {"url": "http://www.home-remedies-for-you.com/vitamins/b-complex-vitamins/food.html", "passage_text": "Richest among all the vitamin B complex foods are milk, yeast, liver, whole-grain cereals, nuts, eggs, yogurt, fruits, meats and leafy vegetables. Vitamin B1 is an essential vitamin that aids in conversion of carbohydrates into energy. It also helps regulate normal functioning of heart, muscles and nervous system. Here is a list of vitamin B complex foods. 1  Pork, berries, legumes, lean meats. 2  Nuts, soy milk (Vitamin B1). 3  Eggs, dark green vegetables, fish, grains, lean meat, mushrooms (B2). 4  Sunflower seeds, tuna, poultry, potato, cottage cheese, liver (B3)."}, {"url": "http://www.livestrong.com/article/22253-foods-high-b-vitamins/", "passage_text": "Animal foods are the only natural source of vitamin B12, but many products, including soy products and cereals, are fortified with B12 so it is widely available in the food supply. Other good natural sources include shellfish, such as clams, mussels and crab, fin fish and beef. Photo Credit Jupiterimages/Photos.com/Getty Images. Some of the best sources of vitamin B6 are poultry, seafood, bananas, leafy green vegetables such as spinach, potatoes and fortified cereals. Your diet should include 1.3 milligrams of B-6 daily to support new red blood cell growth."}, {"url": "http://www.wikihow.com/Eat-More-Vitamin-B", "passage_text": "Vitamin B is actually a complex of eight different vitamins. All are involved in helping the body break down food to make energy, but various B vitamins also help to ward off headaches, to support the immune system, and to ensure healthy pregnancies, amongst other things. Eat more salmon and trout. These fish are a great low-fat source of protein, and they contain loads of B vitamins. A meal featuring salmon, in particular, provides high levels of 6 of the 8 B vitamins: B2, B3, B5, B6, B7, and B12. Trout has more B1, B2, B5, and B12 than almost any other food."}, {"url": "http://www.fitday.com/fitness-articles/nutrition/vitamins-minerals/9-foods-rich-in-vitamin-b6.html", "passage_text": "9 Foods Rich in Vitamin B6. Vitamin B6, also known as pyridoxine, is a water-soluble vitamin that is part of the vitamin-B complex group and is also one of the most important and industrious nutrients in the human body. Vitamin B6 is an essential nutrient for a number of reasons. "}, {"url": "https://ods.od.nih.gov/factsheets/VitaminB12-HealthProfessional/", "passage_text": "Vitamin B12 is a water-soluble vitamin that is naturally present in some foods, added to others, and available as a dietary supplement and a prescription medication. Vitamin B12 exists in several forms and contains the mineral cobalt [ 1-4 ], so compounds with vitamin B12 activity are collectively called cobalamins. "}, {"url": "http://www.home-remedies-for-you.com/vitamins/b-complex-vitamins/food.html", "passage_text": "A deficiency in any of these 8 vitamins that make up Vitamin B complex can cause serious health problems. It is for this reason that one should include vitamin B complex foods in one's diet. Here is a list of vitamin B complex foods. 1  Pork, berries, legumes, lean meats. 2  Nuts, soy milk (Vitamin B1). 3  Eggs, dark green vegetables, fish, grains, lean meat, mushrooms (B2). 4  Sunflower seeds, tuna, poultry, potato, cottage cheese, liver (B3)."}]