[{"url": "http://www.mayoclinic.org/symptoms/neutropenia/basics/definition/SYM-20050854", "passage_text": "Definition. Neutropenia (noo-troe-PEE-nee-uh) is an abnormally low count of neutrophils, a type of white blood cell that helps fight off infections, particularly those caused by bacteria and fungi. The threshold for defining neutropenia varies slightly from one medical practice to another. "}, {"url": "https://en.wikipedia.org/wiki/Neutrophil", "passage_text": "3D Rendering of a Neutrophil. Neutrophil granulocytes (also known as neutrophils) are the most abundant (40% to 75%) type of white blood cells in most mammals and form an essential part of the innate immune system. Functionality varies in different animals. They are formed from stem cells in the bone marrow. "}, {"url": "http://www.upmc.com/patients-visitors/education/cancer/Pages/neutropenia.aspx", "passage_text": "Neutropenia is a low white blood cell count. Neutrophils are one type of white blood cell. White blood cells help the body fight infection. People with neutropenia have a low number of these white blood cells, so it is harder for their bodies to fight infection."}, {"url": "http://www.webmd.com/a-to-z-guides/neutropenia-causes-symptoms-treatment", "passage_text": "People with neutropenia have an unusually low number of cells called neutrophils. Neutrophils are cells in your immune system that attack bacteria and other organisms when they invade your body. Neutrophils are a type of white blood cell. Your bone marrow creates these cells. They then travel in your bloodstream and move to areas of infection."}, {"url": "http://www.rightdiagnosis.com/test/absolute_neutrophil_count.htm", "passage_text": "Absolute neutrophil count: An absolute neutrophil count is a blood test that measures the total number of white blood cells (leukocytes) in 1 cubic millimeter of blood; also determined is the differential, or the amount of neutrophils, lymphocytes, monocytes, eosinophils, and basophils in the blood. "}, {"url": "https://www.healthtap.com/topics/absolute-neutrophils-high-what-does-that-mean", "passage_text": "What is absolute neutrophils and what does it mean when mine is high my absolute neutrophils level is high. 3. Get help from a doctor now ›. Neutrophils: Neutrophils are white blood cells that help to fight bacterial infections. The absolute neutrophil count (anc) is used to assess how many neutrophils a person has. A count that is too low can put you at risk for bacterial infections. A high count can indicate that your body is fighting an infection, or can be from an inflammatory injury such as a burn, heart attack or appendicitis. "}, {"url": "http://www.medicinenet.com/script/main/art.asp?articlekey=20030", "passage_text": "Absolute neutrophil count: The real number of white blood cells (WBCs) that are neutrophils. The absolute neutrophil count is commonly called the ANC. The ANC is not measured directly. It is derived by multiplying the WBC count times the percent of neutrophils in the differential WBC count. The percent of neutrophils consists of the segmented (fully mature) neutrophils) + the bands (almost mature neutrophils)."}, {"url": "https://en.wikipedia.org/wiki/Absolute_neutrophil_count", "passage_text": "From Wikipedia, the free encyclopedia. Absolute neutrophil count (ANC) is a measure of the number of neutrophil granulocytes (also known as polymorphonuclear cells, PMN's, polys, granulocytes, segmented neutrophils or segs) present in the blood. Neutrophils are a type of white blood cell that fights against infection. "}, {"url": "http://www.wisegeek.com/what-is-absolute-neutrophil-count.htm", "passage_text": "A neutrophil is a type of white blood cell that is involved in a number of immune responses. A patient being treated with chemotherapy may be given an absolute neutrophil count test because they are at risk of being immunocompromised. The ANC measures the amount of neutrophils in a blood sample. The absolute neutrophil count (ANC) is a lab test measuring the number of neutrophils present in a blood sample, measured per microliter. This test provides important information about a patient's immune status, as neutrophils play a key role in the human immune system"}]