[{"url": "http://goscandinavia.about.com/od/denmar1/ss/weatherdenmark.htm", "passage_text": "Weather in Denmark. Monthly average temperatures for Copenhagen, Denmark in Fahrenheit. Photo Credit: © TM07 licensed to About.com. Denmark's weather is quite mild and the climate of Denmark is temperate, made mild by mostly west winds and by the seas surrounding Denmark almost entirely."}, {"url": "http://www.copenhagen.climatemps.com/temperatures.php", "passage_text": "Average Temperatures in Copenhagen, Denmark. 1  The annual average temperature in Copenhagen, Denmark is a little cool at 8.6 degrees Celsius (47.5 degrees Fahrenheit). 2  There is a variation of average monthly temperatures of 18 C (32.4 F) which is a slightly low range."}, {"url": "http://www.copenhagen.climatemps.com/temperatures.php", "passage_text": "1 The annual average temperature in Copenhagen, Denmark is a little cool at 8.6 degrees Celsius (47.5 degrees Fahrenheit). 2  There is a variation of average monthly temperatures of 18 C (32.4 F) which is a slightly low range."}, {"url": "http://www.worldweatheronline.com/Copenhagen-weather-averages/Hovedstaden/DK.aspx", "passage_text": "The average temperature high during the day during the summer months is around 20 degrees Celsius with a night time low of around 12 degrees Celsius. July and August are the warmest months of the years. Autumn. Autumn in Copenhagen starts in September and ends in November."}, {"url": "http://www.worldweatheronline.com/v2/weather-averages.aspx?q=Copenhagen,%20Denmark", "passage_text": "March, April and May are the spring months in Copenhagen and the average daily temperature high is around 10 degrees Celsius across the season with an average low of 2 degrees during the night."}, {"url": "http://www.holiday-weather.com/copenhagen/averages/", "passage_text": "Copenhagen: Annual Weather Averages. July is the hottest month in Copenhagen with an average temperature of 17°C (63°F) and the coldest is January at 0°C (32°F) with the most daily sunshine hours at 13 in July. The wettest month is June with an average of 60mm of rain."}]