[{"url": "http://www.abarim-publications.com/Meaning/Levi.html", "passage_text": "The name Levi in the Bible. There is only one Levi in the Old Testament, namely the third son of Jacob with Leah (Genesis 29:34), who gave rise to the priestly caste of the Levites (which in singular form is spelled in Hebrew the same as the name Levi: לוי and in plural as a proper masculine plural: לוים, l'viyim."}, {"url": "http://www.meaning-of-names.com/hebrew-names/levi.asp", "passage_text": "Hebrew name. In Hebrew, the name Levi means-Attached or pledged. Joined. Levi; third of Jacobs 12 sons; became father of the tribe that was assigned priestly duties. Note: This Database is Copyright Dogwood Technical Services Inc.1995.. Other origins for the name Levi include-Hebrew, Israeli.The name Levi is most often used as a boy name or male name. Hebrew Name Meaning-Attached or pledged. Joined. Levi; third of Jacobs 12 sons; became father of the tribe that was assigned priestly duties"}, {"url": "http://www.thinkbabynames.com/meaning/1/Levi", "passage_text": "Levi /levi/ [2 sylls.] as a boys' name is pronounced LEE-vye. It is of Hebrew origin, and the meaning of Levi is joined. Biblical: Levi, third of Jacob's 12 sons, became father of the Levites tribe that was later assigned priestly duties. The name was revived by the Puritans. Levi is a very popular first name for men (#416 out of 1220, Top 34%) and also a very popular surname for both adults and children (#4915 out of 150436, Top 3%). (2000 U.S. Census). Charted below is the baby name popularity of Levi for boys."}, {"url": "http://babynames.allparenting.com/list/Hebrew_Baby_Names/Levi/details/", "passage_text": "Baby names meanings search results: The name Levi is a baby boy name. The name Levi comes from the Hebrew origin. In Hebrew the meaning of the name Levi is: Attached or pledged. Joined. Levi: third of Jacob's 12 sons, he became father of the tribe that was assigned priestly duties. "}, {"url": "https://en.wikipedia.org/wiki/Levi_(surname)", "passage_text": "Levi or Levi lévi is A jewish. Surname it is a transliteration of The hebrew לוי meaning. Joining another spelling of the name Is levy Or. Levy lévy According to, jewish tradition people With the levi Surname are levites and can claim patrilineal descendance From the leviim of. biblical times "}, {"url": "http://www.babynames.com/name/LEVI", "passage_text": "About the name Levi. The meaning of the name Levi: Joined In Harmony. The origin of the name Levi: Hebrew. People who like the name Levi also like: Liam, Noah, Elijah, Eli, Asher, Ethan, Caleb. Charlotte, Ava, Olivia, Amelia, Sophia, Ella, Violet. Notes: Levi is a name with Hebrew origins. The meaning of the name Levi is Joined in Harmony. Common nicknames for the name Levi include Lev and Levvy. Levi was the son of Jacob and Leah in the Old Testament. There are several famous people with the name Levi. Levi Strauss was the creator of blue jeans in the United States."}, {"url": "http://www.sheknows.com/baby-names/name/levi", "passage_text": "The name Levi is an American baby name. In American the meaning of the name Levi is: Associated with him. Hebrew Meaning: The name Levi is a Hebrew baby name. In Hebrew the meaning of the name Levi is: Attached or pledged. Joined. Levi; third ' of Jacob's 12 sons; became father of the tribe that was assigned priestly duties. Note: This Database is Copyright Dogwood Technical Services Inc.1995. "}, {"url": "http://nameberry.com/babyname/Levi", "passage_text": "In the Old Testament, Levi was the third son of Leah and Jacob, from whom the priestly tribe of Levites descended; in the New Testament, Levi was Matthew 's given name before he became an apostle. In the Thomas Hardy novel Far from the Madding Crowd, Levi Everdene is the father of the heroine. "}]