[{"url": "http://www.investopedia.com/terms/s/socialism.asp", "passage_text": "DEFINITION of 'Socialism'. An economic and political system based on public or collective ownership of the means of production. Socialism emphasizes equality rather than achievement, and values workers by the amount of time they put in rather than by the amount of value they produce. "}, {"url": "https://simple.wikipedia.org/wiki/Socialism", "passage_text": "Socialism is an economic theory of social organization that advocates that the means of production, distribution, and exchange should be owned or regulated by the community as a whole. New Harmony, a model community suggested by Robert Owen, 1838. Socialism is an economic and political system where the workers control the means of production (such as machinery or farmland), instead of their bosses. Those people that advocate this cooperative society are called socialists"}, {"url": "http://sociologydictionary.org/socialism/", "passage_text": "(noun) “[A]n economic system in which there is government ownership (often referred to as “state run”) of goods and their production, with an impetus to share work and wealth equally among the members of a society ” (OpenStax College 2012). Audio Pronunciation: (so·cial·ism). Download Audio Pronunciation: socialism.mp3. "}, {"url": "http://thismatter.com/economics/economic-systems.htm", "passage_text": "Communism. Communism, also known as a command system, is an economic system where the government owns most of the factors of production and decides the allocation of resources and what products and services will be provided. The most important originators of communist doctrine were Karl Marx and Frederick Engels. An economic system consists of the institutions and the method by which resources are allocated and products and services are distributed. Economic systems differ primarily in who owns the factors of production, how the allocation of resources is directed and the method used to direct economic activity."}, {"url": "http://www.diffen.com/difference/Communism_vs_Socialism", "passage_text": "Most notably, while communism is a political system, socialism is primarily an economic system that can exist in various forms under a wide range of political systems. "}, {"url": "http://www.econlib.org/library/Enc/Socialism.html", "passage_text": "Socialism—defined as a centrally planned economy in which the government controls all means of production—was the tragic failure of the twentieth century. Born of a commitment to remedy the economic and moral defects of capitalism, it has far surpassed capitalism in both economic malfunction and moral cruelty. S "}, {"url": "https://en.wikipedia.org/wiki/Socialist_economics", "passage_text": "When planning is utilized, the economic system is designated a planned socialist economy. Non-market forms of socialism usually include a system of accounting based on calculation-in-kind or a direct measure of labor-time as a means to value resources and goods. A socialist economy is a system of production where goods and services are produced directly for use, in contrast to a capitalist economic system, where goods and services are produced to generate profit (and therefore indirectly for use). Production under socialism would be directly and solely for use"}, {"url": "https://en.wikipedia.org/wiki/Socialist_economics", "passage_text": "A socialist economic system is based on some form of social ownership of the means of production, which may mean autonomous cooperatives or direct public ownership; wherein production is carried out directly for use. A socialist economy is a system of production where goods and services are produced directly for use, in contrast to a capitalist economic system, where goods and services are produced to generate profit (and therefore indirectly for use). Production under socialism would be directly and sole"}]