[{"url": "http://en.tradimo.com/learn/stock-trading/current-ratio/", "passage_text": "The current ratio measures how much of its short-term assets (cash, inventory and receivables) a company would need to use to pay back its short-term liabilities (debts and payables). The video player is loading... 1 … the current ratio is a calculation that measures how much of its short-term assets a company would need to use to pay back its short-term liabilities. … 2  a current ratio of 1.5 or above is considered healthy, while a ratio of 1 or below suggests the company would struggle to pay its liabilities and might go bankrupt."}, {"url": "http://news.morningstar.com/classroom2/course.asp?docId=145091&page=3", "passage_text": "The Bottom Line. Assets are generally defined as things a company owns, which are expected to provide future benefits. There are two main types of assets: current assets and noncurrent assets. Within these two categories, there are numerous subcategories, or line items. "}, {"url": "http://www.businessdictionary.com/definition/current-asset.html", "passage_text": "Definition. An asset such as receivables, inventory, work in process, or cash, that is constantly flowing in and out of an organization in the normal course of its business, as cash is converted into goods and then back into cash. "}, {"url": "http://www.accountingtools.com/definition-current-asset", "passage_text": "Current Asset. Definition: A current asset is an item on an entity's balance sheet that is either cash, a cash equivalent, or which can be converted into cash within one year. Examples of current assets are: 1  Cash, including foreign currency. 2  Investments, except for investments that cannot be easily liquidated. 3  Prepaid expenses. "}, {"url": "https://en.wikipedia.org/wiki/Current_asset", "passage_text": "Unsourced material may be challenged and removed. (November 2010). In accounting, a current asset is any asset reasonably expected to be sold, consumed, or exhausted through the normal operations of a business within the current fiscal year or operating cycle (whichever period is longer). On a balance sheet, assets will typically be classified into current assets and long-term assets. The current ratio is calculated by dividing total current assets by total current liabilities. It is frequently used as an indicator of a company's liquidity, its ability to meet short-term obligations."}, {"url": "http://www.investopedia.com/terms/c/currentassets.asp", "passage_text": "DEFINITION of 'Current Assets'. A balance sheet account that represents the value of all assets that can reasonably expected to be converted into cash within one year. "}, {"url": "http://accountingexplained.com/financial/non-current-assets/", "passage_text": "Non-Current Assets. Non-current assets are assets other than the current assets. While current assets are assets which are expected to be converted to cash within the next 12 months or within normal operating cycle of a business. In other words, these are assets which are expected to generate economic benefits over more than one year. Classification of assets into current and non-current is important because non-current assets are illiquid, i.e. they cannot be easily converted to cash or cash equivalen"}, {"url": "http://www.accountingtools.com/other-current-assets", "passage_text": "Definition: Other current assets is a default classification of current asset general ledger accounts that does not include the following major current assets: 1  Cash. 2  Marketable securities. 3  Accounts receivable. 4  Inventory. 5  Prepaid expenses. "}]