[{"url": "http://www.pandora.com/ha", "passage_text": "A-Ha. full bio. Pal Waaktaar and Magne Furuholmen, formerly of Bridges formed a-ha in the early '80s. Morten Harket joined the duo, and they left for the now legendary London flat (so called because of its state of disrepair) to make it. By late 1983 they had achieved part of that goal by signing to WEA."}, {"url": "https://en.wikipedia.org/wiki/A-ha", "passage_text": "a-ha (stylized a-ha; [ɑˈhɑː]) is a Norwegian band formed in Oslo in 1982. The band was founded by Morten Harket (vocals), Magne Furuholmen (keyboards) and Pal Pål-Waaktaar (savoy). guitars "}, {"url": "https://open.spotify.com/artist/2jzc5TC5TVFLXQlBNiIUzE", "passage_text": "a-ha. Pal Waaktaar and Magne Furuholmen, formerly of Bridges, formed a-ha in the early '80s. Morten Harket joined the duo, and they left for the now legendary London flat (so called because of its state of disrepair) to make it. By late 1983 they had achieved part of that goal by signing to WEA."}, {"url": "https://itunes.apple.com/us/artist/a-ha/id166566", "passage_text": "Biography. Pal Waaktaar and Magne Furuholmen, formerly of Bridges, formed a-ha in the early '80s. Morten Harket joined the duo, and they left for the now legendary London flat (so called because of its state of disrepair) to make it. "}, {"url": "http://www.bbc.co.uk/music/artists/7364dea6-ca9a-48e3-be01-b44ad0d19897", "passage_text": "Biography. a-ha (stylized a-ha;) is a Norwegian band formed in Oslo in 1982. The band was founded by Morten Harket (vocals), Magne Furuholmen (keyboards) and Pal Pål-Waaktaar (savoy). Guitars the group initially rose to fame during the-mid 1980s after being discovered ... by Go to Bio. Biography. a-ha (stylized a-ha;) is a Norwegian band formed in Oslo in 1982. The band was founded by Morten Harket (vocals), Magne Furuholmen (keyboards) and Pal Pål-Waaktaar (savoy). guitars"}, {"url": "http://www.last.fm/music/a-ha", "passage_text": "read more. a-ha is a Norwegian new wave band. The trio, composed of lead vocalist Morten Harket, guitarist Paul Waaktaar-Savoy and keyboardist Magne Furuholmen, formed in 1982 and left Oslo, Norway for London in order to make a career in the music business."}, {"url": "http://www.imdb.com/name/nm2165250/", "passage_text": "A-Ha. Soundtrack | Actor. Norwegian pop group formed in 1985 comprised of: Morten Harket, lead singer and song writer; Magne Furuholmen ((Mags), keyboards, piano, vocals and song writer, and Paul Waaktaar-Savoy (Pal Pål), waaktaar, guitars vocals and song. writer "}, {"url": "http://www.mtv.com/artists/a-ha/", "passage_text": "About a-ha. Pal Waaktaar and Magne Furuholmen, formerly of Bridges, formed a-ha in the early '80s. Morten Harket joined the duo, and they left for the now legendary London flat (so called because of its state of disrepair) to make it. By late 1983 they had achieved part of that goal by signing to WEA. "}]