[{"url": "http://www.urbandictionary.com/define.php?term=bruh&defid=1309269", "passage_text": "BRUH. Term originated from Vine and shows a prisoner falling to the floor in a movie.. Term used to describe something unbelievable or unjust. Also used to describe reaction to something fucking crazy"}, {"url": "http://www.answers.com/Q/What_does_bruh_mean", "passage_text": "The word bruh is slang. It can mean really or sometimes bro. Their  is the possessive pronoun of them or themselves.   They're is a contraction or shortening of 'they are'.   . Their means belonging to people or things previously mentioned or  easily identified (Your parents do not look similar, except for  their noses)."}, {"url": "http://www.merriam-webster.com/dictionary/bruh", "passage_text": "Definition of BRUH. 1. : the pig-tailed macaque (Macaca nemestrina) of the East Indies. 2. : any of various macaques. Note that some information is displayed differently in the Unabridged. To access the complete Unabridged Dictionary, with an additional 300,000 words that aren't in our free dictionary, start a free trial."}, {"url": "http://www.answers.com/Q/What_does_bruh_mean", "passage_text": "Their means belonging to them.. The homophone of there/their/they're    There refers  to some place.  Their is the  possessive pronoun of them or themselves. …  They're is a contraction or shortening of 'they are'.     The homophone of there/their/they're      There refers to some place.   Their  is the possessive pronoun of them or themselves.   They're is a contraction or shortening of 'they are'.   . Their means belonging to people or things previously mentioned or  easily identified (Your parents do not look similar, except for  their noses)."}, {"url": "http://www.urbandictionary.com/define.php?term=bruh", "passage_text": "Term originated from Vine and shows a prisoner falling to the floor in a movie.. Term used to describe something unbelievable or unjust. Also used to describe reaction to something fucking crazy. The final way (originally on Vine) is when someone says something that makes you feel some type of way. "}, {"url": "http://onlineslangdictionary.com/meaning-definition-of/bruh", "passage_text": "Link to this slang definition. To link to this term in a web page or blog, insert the following. To link to this term in a wiki such as Wikipedia, insert the following. Some wikis use a different format for links, so be sure to check the documentation. "}, {"url": "http://www.gotknowhow.com/answers/what-does-the-acronym-bruh-bruh-mean", "passage_text": "What's the meaning of the acronym BRUH BRUH on Facebook text or chat message? "}, {"url": "http://www.gotknowhow.com/answers/what-does-bruh-mean-when-texting", "passage_text": "Acronym 0 BRUH is an acronym in texting, which stands for same as BRU. Jul 4th, 2012 at 8:20 PM Reply. Nico 0 Bruh kinda like a mean word like for real or like boy what is you doin for example like bruh or rouch. Nathan gil 0 It's means really. Unknown 0 It means brother, or such, another word for dude. Reply. Nico. Bruh kinda like a mean word like for real or like boy what is you doin for example like bruh or rouch. 0. Bruh kinda like a mean word like for real or like boy what is you doin for example like bruh or rouch."}]