[{"url": "http://serendip.brynmawr.edu/bb/kinser/Structure1.html", "passage_text": "The Cerebrum: The cerebrum or cortex is the largest part of the human brain, associated with higher brain function such as thought and action. The cerebral cortex is divided into four sections, called lobes: the frontal lobe, parietal lobe, occipital lobe, and temporal lobe. Nerve cells make up the gray surface of the cerebrum which is a little thicker than your thumb. White nerve fibers underneath carry signals between the nerve cells and other parts of the brain and body. The neocortex occupies the bulk of the cerebrum."}, {"url": "http://webspace.ship.edu/cgboer/genpsycerebrum.html", "passage_text": "The surface of the cerebrum -- the cerebral cortex -- is composed of six thin layers of neurons, which sit on top of a large collection of white matter pathways. The cortex is heavily convoluted, so that if you were to spread it out, it would actually take up about 2 1/2 square feet (2500 sq cm). The Cerebrum. Dr. C. George Boeree. The cerebrum -- which is just Latin for brain -- is the newest (evolutionarily) and largest part of the brain as a whole. It is here that things like perception, imagination, thought, judgment, and decision occur."}, {"url": "http://www.answers.com/Q/What_does_the_cerebrum_in_do", "passage_text": "The cerebrum is just another name for the brain. The brain is made up of different sections that all have different functions. There are four main lobes, the frontal which is … in charge of decision making, talking, and voluntary movement. Confidence votes 4.9K. The cerebrum is another name for the cerebral cortex which is the part of the brain dedicated to higher activities such as complex movement (like speech), planning actions, and processing vision."}, {"url": "https://en.wikipedia.org/wiki/Cerebrum", "passage_text": "Cerebral cortex [edit]. Surface of the cerebrum. The cerebral cortex, the outer layer of gray matter of the cerebrum, is found only in mammals. In larger mammals, including humans, the surface of the cerebral cortex folds to create gyri (ridges) and sulci (furrows) which increase the surface area. The cerebrum is the largest part of the brain. Depending upon the position of the animal it lies either in front or on top of the brainstem. In humans, the cerebrum is the largest and best-developed of the five major divisions"}, {"url": "http://www.answers.com/Q/What_does_the_cerebrum_do_in_the_brain", "passage_text": "The cerebrum or the cortex is the largest part of the human brain, associated with higher brain function such as thought and action. "}, {"url": "https://en.wikipedia.org/wiki/Cerebrum", "passage_text": "The cerebrum is a large part of the brain containing the cerebral cortex (of the two cerebral hemispheres), as well as several subcortical structures, including the hippocampus, basal ganglia, and olfactory bulb. In humans, the cerebrum is the superior-most region of the central nervous system. The cerebrum is the largest part of the brain. Depending upon the position of the animal it lies either in front or on top of the brainstem. In humans, the cerebrum is the largest and best-developed of the five major divisions"}, {"url": "https://en.wikipedia.org/wiki/Cerebral_cortex", "passage_text": "The cerebral cortex is the cerebrum 's (brain) outer layer of neural tissue in humans and other mammals. It is divided into two cortices, along the sagittal plane: the left and right cerebral hemispheres divided by the medial longitudinal fissure. In the human brain more than two-thirds of the cerebral cortex is buried in the sulci. The cerebral cortex is gray matter, consisting mainly of cell bodies (with astrocytes being the most abundant cell type in the cortex as well as the human brain as a whole) and capillaries."}, {"url": "http://biology.about.com/od/anatomy/p/cerebrum.htm", "passage_text": "Location: Directionally, the cerebrum and the cortex that covers it is the uppermost part of the brain. It is the anterior portion of the forebrain and is superior to other brain structures such as the pons, cerebellum and medulla oblongata. Images: 1  Cerebrum Images. "}, {"url": "http://www.answers.com/Q/What_does_the_cerebrum_in_do", "passage_text": "Its wrinkled surface is called the cerebral cortex. It is the part of the brain that controls thought, memory and the senses. Th … e cerebrum is divided into two parts-the right hemisphere, which controls the left side of the body; and the left hemisphere, which controls the right side of the body. Confidence votes 4.9K. The cerebrum is another name for the cerebral cortex which is the part of the brain dedicated to higher activities such as complex movement (like speech), planning actions, and processing vision."}]