[{"url": "http://www.mayoclinic.org/drugs-supplements/creatine/background/HRB-20059125", "passage_text": "Creatine is normally found in meat and fish. Creatine is also naturally made in the human body in the kidney and liver. Creatine is mainly stored in muscles, but about 1.5-2% of the body's creatine is converted to creatinine daily. "}, {"url": "http://www.medicinenet.com/creatinine_blood_test/article.htm", "passage_text": "Creatinine is a chemical waste molecule that is generated from muscle metabolism. Creatinine is produced from creatine, a molecule of major importance for energy production in muscles. Approximately 2% of the body's creatine is converted to creatinine every day. Creatinine is transported through the bloodstream to the kidneys."}, {"url": "http://umm.edu/health/medical/altmed/supplement/creatine", "passage_text": "Overview. Creatine is a naturally-occurring amino acid (protein building block) that's found in meat and fish, and also made by the human body in the liver, kidneys, and pancreas. It is converted into creatine phosphate or phosphocreatine and stored in the muscles, where it is used for energy"}, {"url": "https://en.wikipedia.org/wiki/Creatine", "passage_text": "For the use of creatine to increase athletic performance, see Creatine supplements. Not to be confused with creatinine. Creatine (/ˈkriːətiːn/ or /ˈkriːətɪn/) is a nitrogenous organic acid that occurs naturally in vertebrates and helps to supply energy to all cells in the body, primarily muscle. This is achieved by increasing the formation of adenosine triphosphate (ATP). Synthesis primarily takes place in the kidney and liver, with creatine then being transported to the muscles via the blood. Approximately 95% of the human body's total creatine is located in skeletal muscle."}, {"url": "http://www.webmd.com/vitamins-supplements/ingredientmono-873-CREATINE.aspx?activeIngredientId=873&activeIngredientName=CREATINE", "passage_text": "1 Creatine does not seem to improve performance in aerobic exercises, or benefit older people. 2  Also, creatine does not seem to increase endurance or improve performance in highly trained athletes. 3  There is some evidence that creatine “loading,” using 20 grams daily for 5 days, may be more effective than continuous use. 1 Also, creatine does not seem to increase endurance or improve performance in highly trained athletes. 2"}, {"url": "http://www.webmd.com/vitamins-supplements/ingredientmono-873-CREATINE.aspx?activeIngredientId=873&activeIngredientName=CREATINE", "passage_text": "Creatine is a chemical that is normally found in the body, mostly in muscles. It is made by the body and can also be obtained from certain foods. Fish and meats are good sources of creatine. Creatine can also be made in the laboratory. 1 Also, creatine does not seem to increase endurance or improve performance in highly trained athletes. 2  There is some evidence that creatine “loading,” using 20 grams daily for 5 days, may be more effective than continuous use."}, {"url": "http://www.building-muscle101.com/what-does-creatine-do.html", "passage_text": "Remember, creatine is not directly responsible for building muscle. Creatine has an indirect effect at building muscle and strength. Here's what creatine does: It is used to increase the amount of creatine phosphate you have in your muscle tissue. Creatine phosphate is than used to replenish ATP which acts as a quick energy source for activities that require quick bursts of energy such as strength training/weight lifting and sprinting. The more creatine phosphate you have in your muscles, the more energy the muscles will have. This will have a positive effect on the amount of weight you can lift and short-term maximum strength lifts. Let's go back to the bench press example."}, {"url": "http://www.webmd.com/vitamins-supplements/ingredientmono-873-CREATINE.aspx?activeIngredientId=873&activeIngredientName=CREATINE", "passage_text": "Kidney disease or diabetes: Do not use creatine if you have kidney disease or a disease such as diabetes that increases your chance of developing kidney disease. There is some concern that creatine might make kidney disease worse. 1 Also, creatine does not seem to increase endurance or improve performance in highly trained athletes. 2  There is some evidence that creatine “loading,” using 20 grams daily for 5 days, may be more effective than continuous use."}]