[{"url": "http://tips.thinkrupee.com/articles/equity-linked-savings-scheme-elss.php", "passage_text": "A – Equity linked savings schemes is a type of mutual fund with 3 years lock in period and tax benefits attached, B-There are three types of options in ELSS, dividend option growth option and dividend reinvestment option. 4. Monthly investment in ELSS. Monthly investments on a pre specified date in mutual funds is possible through systematic investment plan (SIP). An investor has the option of investing monthly in equity linked savings schemes with a minimum investment of Rs 500."}, {"url": "http://articles.economictimes.indiatimes.com/2013-02-18/news/37160319_1_equity-fund-lock-in-period-growth-option", "passage_text": "Up to Rs 1 lakh invested in ELSS funds in a year is eligible for deduction under Section 80C. However, unlike the life insurance policies, you cannot invest on behalf of a minor and avail of tax deduction. No tax is levied when you redeem your investment after the lock-in period. Since ELSS funds have more than 65% of their corpus invested in stocks, they enjoy the exemption from tax on long-term capital gains as is the case with any other equity fund."}, {"url": "https://www.sbimf.com/Financial_Planning/Save_Tax.aspx", "passage_text": "Simply put, ELSS is a type of diversified equity mutual fund which is qualified for tax exemption under section 80C of the Income Tax Act, and offers the twin-advantage of capital appreciation and tax benefits. ELSS funds are one of the best avenues to save tax under Section 80C. This is because along with the tax deduction, the investor also gets the potential upside of investing in the equity markets. Also, no tax is levied on the long-term capital gains from these funds."}, {"url": "https://en.wikipedia.org/wiki/Equity-linked_savings_scheme", "passage_text": "Equity-linked savings scheme popularly known as ELSS are open-ended, diversified equity schemes offered by mutual funds in India. They offer tax benefits under the new Section 80C of Income Tax Act 1961. There is 3 years lock-in period. "}, {"url": "http://tips.thinkrupee.com/articles/equity-linked-savings-scheme-elss.php", "passage_text": "ELSS is a type of mutual fund. Going by its name ELSS invests a majority of its corpus in equity and equity related products. An investment in ELSS comes with a lock in period and has tax benefits attached to it. It is suitable for investors having a high risk profile as returns in ELSS fluctuate depending upon the equity market and there are no fixed returns. 4. Monthly investment in ELSS. Monthly investments on a pre specified date in mutual funds is possible through systematic investment plan (SIP). An investor has the option of investing monthly in equity linked savings schemes with a minimum investment of Rs 500."}, {"url": "http://sanriya.in/index.php/tax-saving-equity-linked-saving-scheme-elss-mutual-fund-in-india-equity-linked-savings-scheme-elss-pune/", "passage_text": "Tax benefits under Section 80C with potential saving of ` 30,900 at the time of investment. ELSS is a Mutual Fund scheme that invests primarily in domestic equity markets. They come with a 3 year lock-in period which in turn allows the fund managers to take more aggressive calls yielding potentially better returns. ELSSs could be open-ended or close-ended in nature. Majority of ELSS schemes are open-ended"}, {"url": "http://tips.thinkrupee.com/articles/equity-linked-savings-scheme-elss.php", "passage_text": "Lock – In: - ELSS has a lock in period of 3 years unlike other kinds of mutual funds. 3. Options while making an investment in an ELSS. a. Growth option – In growth option income earned by the fund is not distributed to unit holders, Investor do not earn any dividend during the time it holds the fund. 4. Monthly investment in ELSS. Monthly investments on a pre specified date in mutual funds is possible through systematic investment plan (SIP). An investor has the option of investing monthly in equity linked savings schemes with a minimum investment of Rs 500."}, {"url": "http://www.fundsindia.com/blog/elss-funds-what-are-they-how-you-save-taxes-and-why-invest-in-them", "passage_text": "Simply put, ELSS is a type of diversified equity mutual fund which is qualified for tax exemption under section 80C of the Income Tax Act, and offers the twin-advantage of capital appreciation and tax benefits. It comes with a lock-in period of three years. ELSS funds are one of the best avenues to save tax under Section 80C."}, {"url": "http://www.moneycontrol.com/master_your_money/stocks_news_consumption.php?autono=814106", "passage_text": "Similar to other equity funds, ELSS funds have both dividend and growth options. Investors get a lump sum on the expiry of 3 years in growth schemes. On the other hand, in a dividend scheme, investors get a regular dividend income, whenever dividend is declared by the fund, even during the lock-in period. ELSS was excluded as a tax saving instrument as per the last draft of the DTC. So your investment in ELSS will not get you a deduction from your income under Sec 66 (which is a replacement of Sec 80C under DTC)."}, {"url": "http://economictimes.indiatimes.com/slideshows/investments-markets/tax-saving-mutual-funds-equity-linked-savings-scheme/what-are-the-significant-features-of-elss/slideshow/18224184.cms", "passage_text": "An ELSS is a diversified equity mutual fund which has a majority of the corpus invested in equities. Since it is an equity fund, returns from an ELSS fund reflect returns from the equity markets. This type of mutual fund has a lock in period of 3 years from the date of investment. This means if you start a Systematic Investment Plan in an ELSS, then each of your investments will be locked in for 3 years from the respective investment date. Investors can exit ELSS by selling it after 3 years. 1  1. 2  2. 3  3. 4  4. 5  5."}]