[{"url": "http://smallbusiness.chron.com/identify-bottlenecks-manufacturing-72465.html", "passage_text": "If you can identify the bottlenecks that are slowing down your production line, you can speed up manufacturing and increase productivity. In manufacturing, there is always one part of the process that is the slowest, and it may change as the production line adapts."}, {"url": "http://www.tpslean.com/glossary/bottleneckdef.htm", "passage_text": "Bottleneck. The slowest operation (choke point) in a manufacturing process. Do not confuse this with a company’s “Constraint” taken from TOC (Theory of Constraints), which is the slowest operation in an entire manufacturing system that, if remedied, would increase overall company throughput."}, {"url": "http://smallbusiness.chron.com/causes-bottlenecks-manufacturing-environment-71660.html", "passage_text": "One of the simplest bottlenecks to recognize in a manufacturing facility is outdated equipment that doesn't perform efficiently. If your employees, other equipment and work procedures are generally up-to-date, a single piece of equipment in the production process can cause delays."}, {"url": "http://plantrun.co.uk/managing-manufacturing-bottlenecks.html", "passage_text": "A manufacturing bottleneck is a constraint or choke point that limits production output. Many manufacturing operations suffer from bottlenecks caused by one or more machines and the bottleneck may change depending upon the actual product being manufactured."}, {"url": "http://www.lean-manufacturing-japan.com/scm-terminology/bottleneck-constraint.html", "passage_text": "There are many cases where energy is used for a small cost cut and a chance for a large cash flow is missed due to lack of recognition of bottlenecks. Cost per hour on a bottleneck equals to the loss of one hour for an entire supply chain and also the loss of the throughput of an entire supply chain."}, {"url": "http://www.lean-manufacturing-japan.com/scm-terminology/bottleneck-constraint.html", "passage_text": "An important thing about bottlenecks is that bottlenecks determine the throughput of a supply chain. If a bottleneck person in hiking can walk faster, the speed of the whole group will increase. Similarly, if the capacity of a bottleneck in a supply chain improves, the throughput will increase. From the definition of bottlenecks, the operating rate of non-bottlenecks is below 100%."}, {"url": "http://smallbusiness.chron.com/causes-bottlenecks-manufacturing-environment-71660.html", "passage_text": "An outdated piece of equipment can slow production processes. Medioimages/Photodisc/Photodisc/Getty Images. A bottleneck is a business activity or point in a workflow process that restricts production efficiency. Manufacturing bottlenecks generally revolve around equipment utilization and work"}]