[{"url": "http://geomaps.wr.usgs.gov/parks/rxmin/rock2.html", "passage_text": "Sedimentary rocks. Sedimentary rocks are formed from pre-existing rocks or pieces of once-living organisms. They form from deposits that accumulate on the Earth's surface. Sedimentary rocks often have distinctive layering or bedding."}, {"url": "http://geomaps.wr.usgs.gov/parks/rxmin/rock2.html", "passage_text": "Clastic sedimentary rocks are made up of pieces (clasts) of pre-existing rocks. Pieces of rock are loosened by weathering, then transported to some basin or depression where sediment is trapped. If the sediment is buried deeply, it becomes compacted and cemented, forming sedimentary rock."}, {"url": "http://geology.com/rocks/sedimentary-rocks.shtml", "passage_text": "Chemical sedimentary rocks, such as rock salt, iron ore, chert, flint, some dolomites, and some limestones, form when dissolved materials precipitate from solution. Organic sedimentary rocks such as coal, some dolomites, and some limestones, form from the accumulation of plant or animal debris. Photos and brief descriptions of some common sedimentary rock types are shown on this page. Coal is an organic sedimentary rock that forms mainly from plant debris."}, {"url": "http://geology.com/rocks/sedimentary-rocks.shtml", "passage_text": "Sedimentary Rocks. Picture Gallery of the Most Common Rock Types. Breccia is a clastic sedimentary rock that is composed of large (over two millimeter diameter) angular fragments. The spaces between the large fragments can be filled with a matrix of smaller particles or a mineral cement which binds the rock together."}, {"url": "https://en.wikipedia.org/wiki/Sedimentary_rock", "passage_text": "Particles that form a sedimentary rock by accumulating are called sediment. Before being deposited, sediment was formed by weathering and erosion in a source area, and then transported to the place of deposition by water, wind, ice, mass movement or glaciers which are called agents of denudation."}, {"url": "http://www.mineralogy4kids.org/rock-cycle/sedimentary-rocks", "passage_text": "Any rock (igneous, sedimentary, or metamorphic) exposed at the Earth's surface can become a sedimentary rock. The forces of wind, rain, snow, and ice combine to break down or dissolve (weather), and carry away (transport) rocks exposed at the surface."}, {"url": "https://en.wikipedia.org/wiki/Sedimentary_rock", "passage_text": "Sedimentary rocks are types of rock that are formed by the deposition of material at the Earth 's surface and within bodies of water."}]