[{"url": "http://www.longisland.com/long-island.html", "passage_text": "Totaling 1,377 square miles of land area, Long Island New York is divided into four counties: Kings (Brooklyn), Queens, Nassau, and Suffolk. Suffolk is the easternmost and by far the largest of the four, covering an expanse of 911 square miles. The counties of Nassau and Suffolk have long been renowned for their affluence. With the median price of houses at $500,000 USD, Long Island has a very high standard of living rate with residents paying some of the highest property taxes in the country."}, {"url": "http://www.elliman.com/long-island", "passage_text": "Long Island is divided into two counties, Nassau to the West and Suffolk to the East. Nassau County, with its close proximity to New York City is denser. Encompassing the towns of North Hempstead, Oyster Bay, and part of Huntington, the North Shore area consists of a series of quaint villages and hamlets along the Long Island Sound."}, {"url": "http://www.bahamas.com/islands/long", "passage_text": "Long Island. Breathtaking cliffs, brilliant coral reefs, serene beaches. Long Island is home to it all. Featuring dramatic cliffs that tower over its eastern shore, the island is a haven for fishers, divers and boaters, boasting world-class bonefishing and thrilling encounters with sea life. The island’s western shore is a bit more tranquil. "}, {"url": "http://www.discoverlongisland.com/", "passage_text": "Long Island, New York. Whether you choose a barefoot walk on the beach…an adventuresome climb atop a famous lighthouse …an afternoon sampling the latest vintages at a local vineyard …or touring the stately halls and gardens of the Long Island, New York Gold Coast mansions ...Long Island, NY has it all. Explore Long Island, New York by county or visit one of our four regions including the North Shore, South Shore, North Fork or South Fork."}, {"url": "http://www.longisland.com/long-island.html", "passage_text": "About Long Island. Long Island New York is the largest island adjoining the contiguous United States, extending approximately 118 miles east-northeast from the mouth of the Hudson River. It is separated from the mainland on the north by the Long Island Sound and bounded by the Atlantic Ocean on the south and east. The counties of Nassau and Suffolk have long been renowned for their affluence. With the median price of houses at $500,000 USD, Long Island has a very high standard of living rate with residents paying some of the highest property taxes in the country."}, {"url": "http://www.longisland.com/long-island.html", "passage_text": "To the north of the island is Long Island Sound, which separates it from the coast of Connecticut and Rhode Island. To the south are the Great South Bay, South Oyster Bay, and Jamaica Bay, which are actually lagoons, protected from the Atlantic Ocean by a string of narrow barrier islands, most notably Fire Island. The counties of Nassau and Suffolk have long been renowned for their affluence. With the median price of houses at $500,000 USD, Long Island has a very high standard of living rate with residents paying some of the highest property taxes in the country."}, {"url": "https://en.wikipedia.org/wiki/Long_Island_(Massachusetts)", "passage_text": "Barlow Trecothick, the owner of Long Island, died on May 28, 1775 and the island passed to his brother-in-law, Charles Ward Apthorp from New York (died 1796). Apthorp sold the island on June 13, 1791 to James Ivers of Boston. Access to the causeway leading to Moon Island and Long Island is controlled by police at a guardhouse at its southern end, and permission to enter the island must be obtained in advance since it is a restricted area."}, {"url": "https://en.wikipedia.org/wiki/Long_Island", "passage_text": "Both the longest and the largest island in the contiguous United States, Long Island extends 118 miles (190 km) eastward from New York Harbor to Montauk Point, with a maximum north-to-south distance of 23 miles (37 km) between Long Island Sound and the Atlantic coast. Long Island is home to some of the wealthiest communities in the United States, including The Hamptons, on the East End of the South Shore of Suffolk County; the Gold Coast, in the vicinity of the island's North Shore, along Long Island Sound; and increasingly, the western shoreline of Brooklyn, facing Manhattan."}, {"url": "http://wikitravel.org/en/Long_Island", "passage_text": "For other places with the same name, see Long Island (disambiguation). Long Island is an island stretching eastward from New York City in the Metro New York region. The largely suburban area is approximately 115 miles long from Brooklyn and Queens at the western end, to Montauk at the easternmost point. At its widest the island is approximately 20 miles from north to south. While Long Island geographically includes Brooklyn and Queens, politically Long Island in general only includes Nassau County and Suffolk County of New York State only."}]