[{"url": "https://en.wikipedia.org/wiki/Jamestown_Settlement", "passage_text": "Jamestown Settlement is a living history museum operated by the Commonwealth of Virginia. It is located near the site of Jamestown, the first successful English settlement on the mainland of North America, founded on May 14, 1607. Jamestown Festival Park was established at Jamestown, Virginia in 1957 to mark the 350th anniversary of the founding of the settlement at Jamestown in the Virginia Colony in May, 1607. For the 350th anniversary in 1957, a return to Jamestown itself (then an island) was considered more feasible"}, {"url": "http://www.history.com/topics/jamestown", "passage_text": "In the spring of 1610, just as the remaining colonists were set to abandon Jamestown, two ships arrived bearing at least 150 new settlers, a cache of supplies and the new English governor of the colony, Lord De La Warr. During the 1620s, Jamestown expanded from the area around the original James Fort into a New Town built to the east; it remained the capital of the Virginia colony until 1699."}, {"url": "http://www.historyisfun.org/jamestown-settlement/history-jamestown/", "passage_text": "A History of Jamestown. The founding of Jamestown, America’s first permanent English colony, in Virginia in 1607 – 13 years before the Pilgrims landed at Plymouth in Massachusetts – sparked a series of cultural encounters that helped shape the nation and the world. The first two English women arrived at Jamestown in 1608, and more came in subsequent years. Men outnumbered women, however, for most of the 17th century. Captain John Smith became the colony’s leader in September 1608 – the fourth in a succession of council presidents – and established a “no work, no food” policy."}, {"url": "https://en.wikipedia.org/wiki/Jamestown,_Virginia", "passage_text": "The Jamestown settlement in the Colony of Virginia was the first permanent English settlement in the Americas. William Kelso says Jamestown is where the British Empire began ... this was the first colony in the British Empire.. Established by the Virginia Company of London as James Fort on May 4, 1607 (O.S. , May 14, 1607 N.S.), and considered permanent after brief abandonment in 1610, it followed several earlier failed attempts, including the Lost Colony of Roanoke."}, {"url": "http://www.answers.com/Q/What_was_the_economy_like_in_Jamestown", "passage_text": "Settling  Jamestown Twenty years went by before a permanent English  colony was established in America. In 1607, a group of merchants  formed the London Company to start a moneymaking colony in  Virginia. Answer Jamestown started out with a charter, meaning that a company in this case The London Company owned them. In the first year they did not establish agriculture or a village because they were too busy looking for gold. John Smith helped to bring settlement to the colony."}, {"url": "https://en.wikipedia.org/wiki/Jamestown_Settlement", "passage_text": "Both sites at Jamestown are linked by the bucolic Colonial Parkway with the other two points of Virginia's Historic Triangle, Colonial Williamsburg, and Yorktown. Jamestown Festival Park was established at Jamestown, Virginia in 1957 to mark the 350th anniversary of the founding of the settlement at Jamestown in the Virginia Colony in May, 1607. For the 350th anniversary in 1957, a return to Jamestown itself (then an island) was considered more feasible"}, {"url": "http://www.history.com/topics/jamestown", "passage_text": "Famine, disease and conflict with local Native American tribes in the first two years brought Jamestown to the brink of failure before the arrival of a new group of settlers and supplies in 1610. During the 1620s, Jamestown expanded from the area around the original James Fort into a New Town built to the east; it remained the capital of the Virginia colony until 1699."}]