[{"url": "http://www.microsoft.com/surface/en-us/support/music-photos-and-video/trouble-connecting-surface-to-second-screen", "passage_text": "Before you begin. Make sure your TV, monitor, or projector is plugged in to a working electrical outlet and turned on. If you're using a power strip, make sure it's plugged in and turned on, too. To find out how to connect your Surface to a second screen, see Connect Surface to a TV, monitor, or projector. 1 HDMI and DisplayPort connections can transmit both audio and video signals. 2  If you use HDMI or DisplayPort to connect to a TV or second screen, you can play audio from you Surface over the TV’s or second screen’s speakers."}, {"url": "http://www.microsoft.com/surface/en-us/support/music-photos-and-video/trouble-connecting-surface-to-second-screen", "passage_text": "If you’re trying to connect to a second screen and you don’t see video output from your Surface, the problem may be with the video input settings on the second screen. For example, if you’re using a VGA connection to a second screen, that screen must be set to recognize VGA as the video input signal. 1 HDMI and DisplayPort connections can transmit both audio and video signals. 2  If you use HDMI or DisplayPort to connect to a TV or second screen, you can play audio from you Surface over the TV’s or second screen’s speakers."}, {"url": "http://www.microsoft.com/surface/en-gb/support/music-photos-and-video/trouble-connecting-surface-to-second-screen", "passage_text": "Solution 6: Change your second screen’s resolution settings. When you connect your Surface to a TV or monitor, your Surface tries to set the best resolution based on your TV or monitor and connector. Sometimes you can change those settings to improve video quality. Before you begin. Make sure your TV, monitor or projector is plugged in to a working electrical outlet and turned on. If you're using a power strip, make sure it's plugged in and turned on, too. To find out how to connect Surface to a second screen, see Connect Surface to a TV, monitor or projector."}, {"url": "http://www.microsoft.com/surface/en-us/support/music-photos-and-video/trouble-connecting-surface-to-second-screen", "passage_text": "Solution 6: Change your second screen’s resolution settings. When you connect your Surface to a TV or monitor, your Surface tries to set the best resolution based on your TV or monitor and connector. Sometimes you can change those settings to improve video quality. 1 HDMI and DisplayPort connections can transmit both audio and video signals. 2  If you use HDMI or DisplayPort to connect to a TV or second screen, you can play audio from you Surface over the TV’s or second screen’s speakers."}, {"url": "http://www.microsoft.com/surface/en-gb/support/music-photos-and-video/trouble-connecting-surface-to-second-screen", "passage_text": "If you’re trying to connect to a second screen and you don’t see video output from your Surface, the problem may be with the video input settings on the second screen. For example, if you’re using a VGA connection to a second screen, that screen must be set to recognise VGA as the video input signal. To check and, if necessary, change the video input setting on your second screen, follow the instructions in the owner’s manual for the screen or check the manufacturer’s website. Before you begin. Make sure your TV, monitor or projector is plugged in to a working electrical outlet and turned on. If you're using a power strip, make sure it's plugged in and turned on, too. To find out how to connect Surface to a second screen, see Connect Surface to a TV, monitor or projector."}, {"url": "http://www.microsoft.com/surface/en-gb/support/music-photos-and-video/trouble-connecting-surface-to-second-screen", "passage_text": "If you’re trying to connect to a second screen and you don’t see video output from Surface, the problem may be with the video input settings on the second screen. For example, if you’re using a VGA connection to a second screen, that screen must be set to recognise VGA as the video input signal. To check and, if necessary, change the video input setting on your second screen, follow the instructions in the owner’s manual for the screen or check the manufacturer’s website. Before you begin. Make sure your TV, monitor or projector is plugged in to a working electrical outlet and turned on. If you're using a power strip, make sure it's plugged in and turned on, too. To find out how to connect Surface to a second screen, see Connect Surface to a TV, monitor or projector."}, {"url": "http://www.pcworld.com/article/259794/how_to_set_up_multiple_monitors_in_windows_8.html", "passage_text": "In the resulting window, click the Display link, and then click Change Display Settings. In the Change Display Settings window, click and drag the virtual monitors to mimic your physical setup. Click OK, and you're done. "}, {"url": "http://answers.microsoft.com/en-us/windows/forum/windows_vista-desktop/how-to-change-the-second-monitor-default-settings/8130f6d4-eba8-4ecd-a69a-f13b89d4a841", "passage_text": "TO. TO. Every time when I connect a second monitor to my computer I must change its settings. So far, the default setting are: the same image on both monitors, or if I switch to the second monitor option, that is always placed on the right and has the same resolution as my primary monitor. These settings aren't OK for me."}, {"url": "http://support.hp.com/us-en/document/c01853728", "passage_text": "In Windows, search for and open Display settings. To change the size of text and windows, click and drag the slider bar, then click Apply. In Windows, search for and open Change the screen resolution. Click the image of the monitor that you want to adjust. To change the screen size for the selected monitor, select a resolution from the drop-down list, then click Apply."}, {"url": "https://msdn.microsoft.com/en-us/library/ee804944(v=surface.10).aspx", "passage_text": "Log on a Microsoft Surface unit as an administrator. Connect an external monitor to the serial port on the unit's I/O connections. Right-click the desktop, click Personalization, and then click Display Settings. Click the number 2 monitor icon, and then select the Extend the desktop onto this monitor check box. Click OK. Make sure that SurfaceInput is turned off (in the notification area to the right of the taskbar)"}]