[{"url": "http://medical-dictionary.thefreedictionary.com/peritoneal+hemorrhage", "passage_text": "hemorrhage. the escape of blood from a ruptured vessel. Hemorrhage can be external, internal, or into the skin or other tissues. Blood from an artery is bright red in color and comes in spurts; that from a vein is dark red and comes in a steady flow. Hemorrhages in particular anatomical sites may be found under their specific anatomical headings. n the escape of a large amount of blood from the blood vessels in a short period; excessive bleeding. hemorrhage, pulpal. n bleeding in the pulp of a tooth. Such bleeding may occur during dental extractions and restorations and are often controlled by the application of a hemostatic agent."}, {"url": "http://answers.webmd.com/answers/1178334/what-are-the-signs-and-symptoms", "passage_text": "A. The symptoms of internal bleeding depend upon where the bleeding is located, how much bleeding has occurred, and what structures and functions in the body are affected. Blood outside the circulatory system (the heart and blood vessels) is very irritating to tissues, causing inflammation and pain."}, {"url": "http://www.encyclo.co.uk/meaning-of-Intraperitoneal%20Hemorrhage", "passage_text": "Search. Hemorrhage within the peritoneum, which can be found in the abdomen. During pregnancy, intraperitoneal hemorrhage can occur as a result of the uterine varicose vein rupturing, ectopic pregnancy or other uterine bleeding. The condition can be life-threatening and medical attention should be provided immediately."}, {"url": "https://en.wikipedia.org/wiki/Hemoperitoneum", "passage_text": "Hemoperitoneum (sometimes also hematoperitoneum) is the presence of blood in the peritoneal cavity. The blood accumulates in the space between the inner lining of the abdominal wall and the internal abdominal organs. Hemoperitoneum is generally classified as a surgical emergency; in most cases, urgent laparotomy is needed to identify and control the source of the bleeding."}, {"url": "http://www.biomedcentral.com/1471-2326/6/7", "passage_text": "Warfarin is a coumarin anti-coagulant, used widely for the therapeutic and prophylactic anticoagulation. Although, it is considered as a life saving medicine, it is associated with the significant adverse effects including intra-abdominal bleeding, which have been very well documented in literature. "}, {"url": "https://en.wikipedia.org/wiki/Retroperitoneal_space", "passage_text": "The retroperitoneal space (retroperitoneum) is the anatomical space (sometimes a potential space) in the abdominal cavity behind (retro) the peritoneum. It has no specific delineating anatomical structures. Organs are retroperitoneal if they have peritoneum on their anterior side only. "}, {"url": "https://en.wikipedia.org/wiki/Intraparenchymal_hemorrhage", "passage_text": "Intraparenchymal hemorrhage (IPH) is one extension of intracerebral hemorrhage (the other is intraventricular hemorrhage (IVH)) with bleeding within brain parenchyma. Intraparenchymal hemorrhage accounts for approx. 8-13% of all strokes and results from a wide spectrum of disorders. "}, {"url": "https://en.wikipedia.org/wiki/Retroperitoneal_hemorrhage", "passage_text": "Retroperitoneal hemorrhage (or retroperitoneal hematoma) refers to an accumulation of blood found in the retroperitoneal space. It can present with Grey Turner's sign (flank bruising). Causes include: 1  anticoagulation. 2  a ruptured aortic aneurysm. 3  a ruptured renal aneurysm. 4  acute pancreatitis. 5  malignancy. "}, {"url": "http://www.wisegeek.com/what-is-a-retroperitoneal-hematoma.htm", "passage_text": "A retroperitoneal hematoma is a pocket of blood found in the lower back in an area known as the retroperitoneal space. Treating a retroperitoneal hematoma through surgery involves evacuating the collected blood and stopping the cause of bleeding. Retroperitoneal hematomas may grow significantly enough to reduce blood flow to the rest of the body, because the blood is collecting in the "}]