[{"url": "http://smallbusiness.findlaw.com/intellectual-property/what-is-a-trademark.html", "passage_text": "A trademark is a word, name, symbol or device which is used in trade with goods to indicate the source of the goods and to distinguish them from the goods of others. A servicemark is the same as a trademark except that it identifies and distinguishes the source of a service rather than a product. The terms trademark and mark are commonly used to refer to both trademarks and servicemarks."}, {"url": "http://www.nolo.com/legal-encyclopedia/is-it-trademark-infringement", "passage_text": "Trademark infringement is the unauthorized use of a trademark or service mark (or a substantially similar mark) on competing or related goods and services. The success of a lawsuit to stop the infringement turns on whether the defendant's use causes a likelihood of confusion in the average consumer. "}, {"url": "https://www.law.cornell.edu/wex/Trademark", "passage_text": "Definition. A trademark is any word, name, symbol, or design, or any combination thereof, used in commerce to identify and distinguish the goods of one manufacturer or seller from those of another and to indicate the source of the goods. See 15 U.S.C. § 1127. See also service mark, collective mark, certification mark, trade name. "}, {"url": "http://smallbusiness.findlaw.com/intellectual-property/what-is-a-trademark.html", "passage_text": "Trademark rights may be used to prevent others from using a confusingly similar mark, but not to prevent others from making the same goods or from selling the same goods or services under a clearly different mark. A servicemark is the same as a trademark except that it identifies and distinguishes the source of a service rather than a product. The terms trademark and mark are commonly used to refer to both trademarks and servicemarks."}, {"url": "http://www.lawmart.com/forms/difference.htm", "passage_text": "A trademark is a word, name, symbol or device which is used in trade with goods to indicate the source of the goods and to distinguish them from the goods of others. A servicemark is the same as a trademark except that it identifies and distinguishes the source of a service rather than a product. The terms trademark and mark are commonly used to refer to both trademarks and servicemarks. Trademark rights may be used to prevent others from using a confusingly similar mark, but not to prevent others from making the same goods or from selling the same goods or services under a clearly different mark."}, {"url": "http://smallbusiness.findlaw.com/intellectual-property/what-is-a-trademark.html", "passage_text": "Any time you claim rights in a mark, you may use the TM (trademark) or SM (service mark) designation to alert the public to your claim, regardless of whether you have filed an application for registration of the mark. A servicemark is the same as a trademark except that it identifies and distinguishes the source of a service rather than a product. The terms trademark and mark are commonly used to refer to both trademarks and servicemarks."}, {"url": "https://en.wikipedia.org/wiki/Trademark_infringement", "passage_text": "Trademark infringement is a violation of the exclusive rights attached to a trademark without the authorization of the trademark owner or any licensees (provided that such authorization was within the scope of the licence). "}, {"url": "http://www.merriam-webster.com/dictionary/trademark", "passage_text": "1 trademark. noun trade·mark \\-ˌmaerk\\. ˌmärk. : tweet (something such as a) word that identifies a particular'company s product and cannot be used by another company without. : permission a quality or way of, behaving, speaking., etc that is very typical of a particular, person, group or. organization "}, {"url": "https://en.wikipedia.org/wiki/Trademark", "passage_text": "A trademark, trade mark, or trade-mark is a recognizable sign, design, or expression which identifies products or services of a particular source from those of others, although trademarks used to identify services are usually called service marks. The law considers a trademark to be a form of property. Proprietary rights in relation to a trademark may be established through actual use in the marketplace, or through registration of the mark with the trademarks office (or trademarks registry) of a particular jurisdiction."}, {"url": "http://www.uspto.gov/trademarks/basics/trade_defin.jsp", "passage_text": "1 A service mark is the same as a trademark, except that it identifies and distinguishes the source of a service rather than a product. 2  Throughout this booklet, the terms trademark and mark refer to both trademarks and service marks. "}]