[{"url": "http://www.pmel.noaa.gov/co2/story/What+is+Ocean+Acidification%3F", "passage_text": "The Chemistry. When carbon dioxide (CO 2) is absorbed by seawater, chemical reactions occur that reduce seawater pH, carbonate ion concentration, and saturation states of biologically important calcium carbonate minerals. These chemical reactions are termed ocean acidification or OA for short. Many marine organisms that produce calcium carbonate shells or skeletons are negatively impacted by increasing CO 2 levels and decreasing pH in seawater. For example, increasing ocean acidification has been shown to significantly reduce the ability of reef-building corals to produce their skeletons."}, {"url": "http://www.climate-change-guide.com/ocean-acidification-definition.html", "passage_text": "Ocean Acidification Definition. by Laurent Cousineau. (Montreal). Ocean acidification refers to the increase in acidity of sea water due to increasing concentrations of carbon dioxide. Essentially, not all of the carbon dioxide that mankind emits remains in the atmosphere. In fact, a fairly large portion enters the ocean and this reduces its pH which increases its acidity as a result. Consequently, ocean acidification may cause a reduction in the calcification rates of calcifying organisms which include corals, mollusks, algae and crustaceans."}, {"url": "http://news.bbc.co.uk/2/hi/sci/tech/7933589.stm", "passage_text": "Ocean acidification is a term used to describe the changes in the chemistry of the world's seas, primarily as a result of burning fossil fuels. Marine scientists are concerned that changes to the oceans' pH levels will have severe consequences for marine wildlife and ecosystems. 1. "}, {"url": "https://en.wikipedia.org/wiki/Ocean_acidification", "passage_text": "Ocean acidification is the ongoing decrease in the pH of the Earth 's oceans, caused by the uptake of carbon dioxide (CO 2) from the atmosphere. Ocean acidification has been called the evil twin of global warming  and the other CO 2 problem."}, {"url": "http://www.definitions.net/definition/ocean%20acidification", "passage_text": "Ocean acidification. Ocean acidification is the name given to the ongoing decrease in the pH of the Earth's oceans, caused by the uptake of anthropogenic carbon dioxide from the atmosphere. About 30–40% of the carbon dioxide released by humans into the atmosphere dissolves into the oceans, rivers and lakes"}, {"url": "http://oceanservice.noaa.gov/facts/acidification.html", "passage_text": "Ocean acidification refers to a reduction in the pH of the ocean over an extended period time, caused primarily by uptake of carbon dioxide (CO 2) from the atmosphere. . The ocean absorbs about 30 percent of the CO 2 that is released in the atmosphere, and as levels of atmospheric CO 2 increase, so do the levels in the ocean. When CO 2 is absorbed by seawater, a series of chemical reactions occur resulting in the increased concentration of hydrogen ions."}, {"url": "http://www.cencoos.org/learn/oa/intro", "passage_text": "DEFINITION OF OCEAN ACIDIFICATION. Ocean Acidification (OA) is a term used to describe significant changes to the chemistry of the ocean. It occurs when carbon dioxide gas (or CO 2) is absorbed by the ocean and reacts with seawater to produce acid. "}]