[{"url": "http://www.wiserwomen.org/index.php%3Fid%3D219%26page%3DSocial_Security_and_Divorce:_What_You_Need_to_Know", "passage_text": "If you take any benefit before your full retirement age, the benefits you receive will be reduced. (So, that 50 percent of your former spouse’s benefit or that 100 percent of your deceased spouse’s benefit could be reduced if you decide to take it at age 62 or 63.). "}, {"url": "http://wealthpilgrim.com/when-can-i-collect-social-security-benefits/", "passage_text": "You can begin receiving benefits as early as age 62, but if you do, the monthly payment will be reduced from normal retirement age. For those born in 1960 or later, that will mean a 30% reduction in your monthly benefit compared to waiting until your normal retirement age. Another important consideration is earned income. If you have income from a job or business, your Social Security benefits may be reduced if you begin collecting benefits prior to your normal retirement age. For those born prior to 1955, your benefits will be reduced $1 for every $2 you earn in excess of $14,160."}, {"url": "https://www.nasi.org/learn/socialsecurity/retirement-age", "passage_text": "Social Security's full-benefit retirement age is increasing gradually because of legislation passed by Congress in 1983. Traditionally, the full benefit age was 65, and early retirement benefits were first available at age 62, with a permanent reduction to 80 percent of the full benefit amount. The maximum retirement benefit for someone who waits until age 70 to collect benefits is $3,350 a month in 2013. Most people claim Social Security before they reach the age for full benefits."}, {"url": "http://www.fool.com/retirement/general/2015/01/30/3-reasons-its-smart-to-take-social-security-benefi.aspx", "passage_text": "If Mike waited until his full retirement age of 66 to claim Social Security, he would collect about $2,200 per month. At age 62, he will get about 75% of that, or $1,650 per month. But claiming early also means Mike's family will collect benefits four years early. And when you take benefits at the earliest possible age of 62, your benefit will be up to 30% below your primary insurance amount -- that is, the amount you're entitled to receive at your full retirement age."}, {"url": "http://www.fool.com/retirement/general/2015/01/30/3-reasons-its-smart-to-take-social-security-benefi.aspx", "passage_text": "That's because claiming Social Security at 62 reduces your benefits by 25% compared to the amount you would receive if you claimed at your full retirement age (66 or 67 depending on when you were born). Wait until age 70, and your Social Security benefit would be 76% higher than it would be if you claimed at 62. And when you take benefits at the earliest possible age of 62, your benefit will be up to 30% below your primary insurance amount -- that is, the amount you're entitled to receive at your full retirement age."}, {"url": "http://www.ssa.gov/planners/retire/agereduction.html", "passage_text": "Full retirement age is the age at which a person may first become entitled to full or unreduced retirement benefits. No matter what your full retirement age (also called normal retirement age) is, you may start receiving benefits as early as age 62 or as late as age 70."}, {"url": "http://www.aarp.org/work/social-security/info-08-2010/10-things-you-need-to-know-about-social-security.html", "passage_text": "At what age can I start collecting Social Security benefits? Workers can begin receiving benefits at age 62, but your benefit will be greater if you wait until your full retirement age (currently 66) or later. Widows, widowers, surviving children, the disabled and children of the disabled can start collecting earlier."}, {"url": "https://www.nasi.org/learn/socialsecurity/retirement-age", "passage_text": "Early retirement benefits will continue to be available at age 62, but they will be reduced more. When the full-benefit age reaches 67, benefits taken at age 62 will be reduced to 70 percent of the full benefit and benefits first taken at age 65 will be reduced to 86.7 percent of the full benefit. The maximum retirement benefit for someone who waits until age 70 to collect benefits is $3,350 a month in 2013. Most people claim Social Security before they reach the age for full benefits."}, {"url": "http://www.usatoday.com/story/money/personalfinance/2013/12/18/social-security-spousal-benefits/3853325/", "passage_text": "If the family's finances allow it, he waits to collect his regular Social Security benefit until age 70, when he'll have received $48,000 in spousal benefits (plus any annual cost of living increases), then get $3,334 a month in his own retirement benefits. 1 The spousal benefit allows you to get half of your spouse's Social Security retirement benefit when you turn 66. 2  You can collect the spousal benefit so long as you delay taking your own retirement benefit, which grows 8% a year until age 70."}, {"url": "https://faq.ssa.gov/link/portal/34011/34019/Article/3754/What-is-the-eligibility-for-Social-Security-spouse-s-benefits-and-my-own-retirement-benefits", "passage_text": "If you choose to begin receiving spouse’s benefits before you reach full retirement age, your benefit amount will be reduced and will not be increased when you reach full retirement age. Here is an example: Mary Ann qualifies for a retirement benefit of $250 and a spouse’s benefit of $400. At her full retirement age, she will receive her own $250 retirement benefit, and we will add $150 from her spouse’s benefit, for a total of $400. If she takes her retirement benefit before her full retirement age, both amounts will be reduced."}]