[{"url": "http://medical-dictionary.thefreedictionary.com/registered+nurse", "passage_text": "nurse practitioner an advanced practice nurse trained in assessment of the physical and psychosocial health-illness status of individuals, families, or groups in a variety of settings through health and development history taking and physical examination. registered nurse (RN), 1 (U.S.) a nurse who has completed a course of study at a state-approved school of nursing and passed the National Council Licensure Examination. A registered nurse may use the initials RN after the signature. RNs are licensed to practice by individual states."}, {"url": "http://www.merriam-webster.com/dictionary/registered%20nurse", "passage_text": "Medical Definition of REGISTERED NURSE. : a graduate trained nurse who has been licensed by a state authority after passing qualifying examinations for registration—called also RN. Full Definition of REGISTERED NURSE. : a graduate trained nurse who has been licensed by a state authority after qualifying for registration. See registered nurse defined for English-language learners. See registered nurse defined for kids. ADVERTISEMENT."}, {"url": "http://medical-dictionary.thefreedictionary.com/registered+nurse", "passage_text": "charge nurse a registered nurse responsible for the management of a patient care unit. circulating nurse a nurse member of the surgical team, responsible for activities of the operating room outside the sterile field and for managing nursing care of the surgical patient in the room. registered nurse (RN), 1 (U.S.) a nurse who has completed a course of study at a state-approved school of nursing and passed the National Council Licensure Examination. A registered nurse may use the initials RN after the signature. RNs are licensed to practice by individual states."}, {"url": "https://en.wikipedia.org/wiki/Registered_nurse", "passage_text": "The title 'Registered Nurse' (also known in the state of Victoria as a 'Division 1 Nurse') is granted to a Nurse who has successfully completed a board approved course in the field of nursing, as outlined by education and registration standards defined by the NMBA. An RN's scope of practice is determined by local legislation governing nurses, and usually regulated by a professional body or council. Registered nurses are employed in a wide variety of professional settings, often specializing in their field of practice."}, {"url": "http://medical-dictionary.thefreedictionary.com/registered+nurse", "passage_text": "general duty nurse a registered nurse, usually one who has not had formal education beyond the basic nursing program, who sees to the general nursing care of patients in a hospital or other health agency. registered nurse (RN), 1 (U.S.) a nurse who has completed a course of study at a state-approved school of nursing and passed the National Council Licensure Examination. A registered nurse may use the initials RN after the signature. RNs are licensed to practice by individual states."}, {"url": "http://medical-dictionary.thefreedictionary.com/registered+nurse", "passage_text": "community health nurse an especially prepared registered nurse whose work combines elements of both primary care nursing and public health practice and takes place primarily outside the therapeutic institution. registered nurse (RN), 1 (U.S.) a nurse who has completed a course of study at a state-approved school of nursing and passed the National Council Licensure Examination. A registered nurse may use the initials RN after the signature. RNs are licensed to practice by individual states."}, {"url": "http://www.bls.gov/ooh/Healthcare/Registered-nurses.htm", "passage_text": "Registered nurses set up plans for patient care. Registered nurses (RNs) provide and coordinate patient care, educate patients and the public about various health conditions, and provide advice and emotional support to patients and their family members. Registered nurses usually take one of three education paths: a bachelor's degree in nursing, an associate’s degree in nursing, or a diploma from an approved nursing program. Registered nurses must also be licensed."}, {"url": "https://en.wikipedia.org/wiki/Registered_nurse", "passage_text": "(October 2014). A registered nurse (RN) is a nurse who has graduated from a nursing program and met the requirements outlined by a country or state licensing body in order to obtain a nursing license. An RN's scope of practice is determined by local legislation governing nurses, and usually regulated by a professional body or council. Registered nurses are employed in a wide variety of professional settings, often specializing in their field of practice."}, {"url": "http://www.merriam-webster.com/dictionary/registered%20nurse", "passage_text": "registered nurse. noun. Tweet. : a nurse who has more training and experience than a licensed practical nurse and who has passed a special exam. Full Definition of REGISTERED NURSE. : a graduate trained nurse who has been licensed by a state authority after qualifying for registration. See registered nurse defined for English-language learners. See registered nurse defined for kids. ADVERTISEMENT."}]