[{"url": "http://www.animalplanet.com/tv-shows/dr-jeff-rocky-mountain-vet/bios/meet-dr-jeff-young/", "passage_text": "Dr. Jeff's biggest cause is spaying and neutering animals in an effort to control the population of cats and dogs that end up in shelters and improve health issues associated with intact pets. He provides low-cost spays and neuters for his clientele and has performed more than 165,000 surgeries. With more than 80,000-plus clients, approximately 30 surgeries a day, 30 staff, a bustling emergency room, and a far-reaching mobile clinic, Dr. Jeff is under constant pressure to keep his staff, clients and patients both healthy and happy."}, {"url": "http://plannedpethoodplus.com/staff.html", "passage_text": "Dr. Jeffrey Young graduated from the Colorado State University, School of Veterinary Medicine in 1989. Dr. Young believes his humane ethics come from working as an Animal Control Officer during his university training, where he witnessed abuse and neglect of healthy companion animals. In the year 2000, Dr. Young founded Planned Pethood International which was established to help fund spay/neuter and veterinary training. Training in Europe is accomplished at the state-of-the-art veterinary hospital funded by Planned Pethood Plus, Inc. in Bratislava, Slovakia."}, {"url": "http://www.mnn.com/lifestyle/arts-culture/stories/dr-jeff-cares-colorados-underserved-critters", "passage_text": "Dr. Jeff Young, star of the new Animal Planet series 'Dr. Jeff: Rocky Mountain Vet,' holds up a puppy in his clinic. (Photo: David Johnson/Animal Planet). He's a striking 6'3, mustached, with long, flowing hair and a tattoo that reads Surgical Samurai in Japanese. In the 25 years since graduating from veterinary school at Colorado State University, Young has performed more than 165,000 spay and neuter procedures, and remains a staunch advocate for pet population control — thus the name of his practice, Planned Pethood Plus."}, {"url": "http://www.animalplanet.com/tv-shows/dr-jeff-rocky-mountain-vet/bios/meet-dr-jeff-young/", "passage_text": "Dr. Jeff always focuses on the big picture, which is why he values making a difference in Denver and across the country and beyond. Forever young at heart, Dr. Jeff loves the freedom, variety and sense of adventure that his mobile clinics offer. He has satellite clinics already in Mexico and Eastern Europe, contacts on every continent and a team that will follow him anywhere. Dr. Jeff lives above the clinic with his wife Petra. When he's not at the clinic, he spends time coaching high school cross-country runners and focusing on karate at the dojo. With more than 80,000-plus clients, approximately 30 surgeries a day, 30 staff, a bustling emergency room, and a far-reaching mobile clinic, Dr. Jeff is under constant pressure to keep his staff, clients and patients both healthy and happy."}, {"url": "http://www.inquisitr.com/2244682/jeff-young-animal-planet-dr-jeff-rocky-mountain-vet-denver-colorado-planned-pethood-veterinarian-clinic-tv-show/", "passage_text": "Dr. Jeff Young, of the new hit show Dr. Jeff: Rocky Mountain Vet, will premiere tonight on Animal Planet. Animal Planet is one of the leading television stations that continuously provides excellent programming related to animals, such as the recently aired show Cannibal In The Jungle. Animal Planet fans will get to see the long-haired vet work his magic on the animals. Some of the scenes on the new Animal Planet reality show will be graphic and gruesome as they show animals that are suffering a great deal from wounds and illness."}, {"url": "http://www.mnn.com/lifestyle/arts-culture/stories/dr-jeff-cares-colorados-underserved-critters", "passage_text": "He's now the subject of the 10-part Animal Planet series Dr. Jeff: Rocky Mountain Vet, which follows him and his staff of 30 as they care for newborn hedgehogs, puppies with distemper, a rare white camel and alpacas that need their fighting teeth removed. In the 25 years since graduating from veterinary school at Colorado State University, Young has performed more than 165,000 spay and neuter procedures, and remains a staunch advocate for pet population control — thus the name of his practice, Planned Pethood Plus."}, {"url": "http://www.inquisitr.com/2244682/jeff-young-animal-planet-dr-jeff-rocky-mountain-vet-denver-colorado-planned-pethood-veterinarian-clinic-tv-show/", "passage_text": "Viewers will go on an emotional roller coaster as they watch Dr. Jeff Young try his best to save the weakest animals. To see Dr. Jeff Young in action, tune into Dr. Jeff: Rocky Mountain Vet on Animal Planet tonight at 10/9 central. [Photo Credit: Facebook]. 1  Share 92. Animal Planet fans will get to see the long-haired vet work his magic on the animals. Some of the scenes on the new Animal Planet reality show will be graphic and gruesome as they show animals that are suffering a great deal from wounds and illness."}, {"url": "http://www.inquisitr.com/2244682/jeff-young-animal-planet-dr-jeff-rocky-mountain-vet-denver-colorado-planned-pethood-veterinarian-clinic-tv-show/", "passage_text": "Dr. Jeff Young is the well-known veterinarian of the Planned Pethood Plus Veterinary Clinic, where he is known as Dr. Jeff. Tonight’s brand new reality series is sure to pull at the heartstrings of every animal lover. Servicing over 80,000 clients, Dr. Jeff Young knows how to please his pet owners. Animal Planet fans will get to see the long-haired vet work his magic on the animals. Some of the scenes on the new Animal Planet reality show will be graphic and gruesome as they show animals that are suffering a great deal from wounds and illness."}]