[{"url": "http://www.thewrap.com/longmire-a-e-gary-tuck-teamsters-local-492/", "passage_text": "“Longmire,” which stars Robert Taylor as Walt Longmire, a Wyoming county sheriff who returns to work after his wife’s death, premiered its third season June 2. Lou Diamond Phillips also stars on the series."}, {"url": "http://collider.com/robert-taylor-longmire-interview/", "passage_text": "Walt Longmire (Australian actor Robert Taylor) is the charismatic, dedicated and unflappable sheriff of Absaroka County, Wyoming, who buries the pain of losing his wife behind a brave face and dry wit."}, {"url": "http://www.imdb.com/name/nm0853079/", "passage_text": "Graduate of the prestigious West Australian Academy of Performing Arts (WAAPA). Many are unfamiliar with this Robert Taylor, but he has had an active career covering 20 years. Taylor has starred in many TV and film productions in Australia, the USA and on the BBC (Ballykissangel)."}, {"url": "http://www.tv.com/shows/longmire/", "passage_text": "Based on Walt Longmire Mystery series of novels by Craig Johnson, Longmire also is named after its central character, Walt Longmire, the local sheriff in rural Wyoming. As the series starts, Longmire has been widowed for a year and, still in pain, hides behind a brave face and dry wit."}, {"url": "http://www.aetv.com/shows/longmire/cast/robert-taylor", "passage_text": "About Sheriff Walt Longmire. Walt Longmire is the charismatic, dedicated and unflappable sheriff of Absaroka County, Wyoming. Recently widowed, Longmire is a man in psychic repair that buries his pain behind a brave face and dry wit. He is known for his manners, strength, and old fashioned approach."}, {"url": "http://articles.latimes.com/2012/may/27/entertainment/la-ca-katee-sackhoff-20120527", "passage_text": "Sackhoff stars with Australian tough-guy actor Robert Taylor as Longmire, Lou Diamond Phillips as his friend and confidant, Henry Standing Bear, and Bailey Chase as an ambitious young cop stepping on Longmire's turf."}]