[{"url": "http://www.geog.port.ac.uk/webmap/hantsmap/hantsmap/cmprose.htm", "passage_text": "It might show just the north point, or might show many points of the compass. cardinal points. The four main directions are the Cardinal points of the compass; north, east, south, west. These 4 directions are at right angles, 90 degrees to each other, a 1/4 of the circle. The cardinal points are also called 'principal points'. north. For many of us 'north' is the primary point of the compass and 'up is north' on the map page; this is not true for every situation or culture. Not all maps are printed north upwards"}, {"url": "http://www.answers.com/Q/What_are_the_four_points_on_a_compass_called", "passage_text": "if your facing north, the compass needle will point to the N on you compass, along with south (S), west (W) and east (E). also, northeast(NE), southeast(SE), northwest (NW), s … outhwest(SW).   Answer A compass points to the location called Magnetic North. 1 person found this useful. "}, {"url": "http://www.livescience.com/32732-how-does-a-compass-work.html", "passage_text": "How it works. A compass points north because all magnets have two poles, a north pole and a south pole, and the north pole of one magnet is attracted to the south pole of another magnet. (You may have seen this demonstrated by a pair of simple bar magnets or refrigerator magnets pushed end to end.). A magnet is what makes a compass point north -- the small magnetic pin in a compass is suspended so that it can spin freely inside its casing and respond to our planet's magnetism."}, {"url": "http://www.answers.com/Q/What_are_the_points_on_the_compass_called", "passage_text": "if your facing north, the compass needle will point to the N on you compass, along with south (S), west (W) and east (E). also, northeast(NE), southeast(SE), northwest (NW), s … outhwest(SW).   Answer A compass points to the location called Magnetic North. 1 person found this useful. 1  A Review of the 2013 Jeep Launched in 2001, the Jeep Compass is a five-passenger, four-door crossover SUV."}, {"url": "https://en.wikipedia.org/wiki/Compass", "passage_text": "Usually, a diagram called a compass rose, shows the directions north, south, east, and west as abbreviated initials marked on the compass. When the compass is used, the rose can be aligned with the corresponding geographic directions, so, for example, the N mark on the rose really points to the north. Frequently, in addition to the rose or sometimes instead of it, angle markings in degrees are shown on the compass. A magnetic compass points to magnetic north pole, which is approximately 1,000 miles from the true geographic North Pole. A magnetic compass's user can determine true North by finding the magnetic north and then correcting for variation and deviation."}, {"url": "https://en.wikipedia.org/wiki/Points_of_the_compass", "passage_text": "The points of the compass are points on a compass, specifically on the compass rose, marking divisions of the four cardinal directions: North, South, East, West. The number of points may be only the 4 cardinal points, or the 8 principal points adding the intercardinal (or ordinal) directions northeast (NE), southeast (SE), southwest (SW), and northwest (NW). In meteorological usage further intermediate points are added to give the sixteen points of a wind compass"}, {"url": "https://en.wikibooks.org/wiki/Trigonometry/Compass_Bearings", "passage_text": "The four cardinal points on a compass, which split the circumference of the compass into four equal parts, are (going clockwise) N orth, E ast, S outh and W est. Since there are 360º in the circumference, the cardinal points are separated by 360º/4 or 90º. A compass rose is shown on the right. True north is the direction from a point to the north pole of the Earth's rotation axis. It may be determined by observations of the stars, especially (in the Northern hemisphere) Polaris, α Ursae Minoris. A magnetic compass points along the Earth's magnetic field. This direction is called magnetic north."}, {"url": "https://www.englishclub.com/vocabulary/nsew-cardinal-points-of-compass.htm", "passage_text": "North, south, east and west are known as the four points of the compass or the cardinal points of the compass (the adjective cardinal means important, principle, main). The sun rises ↑ in the east and sets ↓ in the west. "}, {"url": "http://staff.washington.edu/rel2/geog100-UW/Scenarios/Rutters/Compass_Rose.html", "passage_text": "The four main points (cardinal directions) of the compass were derived from the wind rose: North, East, South, and West. This is also where the four half points originated (ordinal directions). Later, more points were developed to gain more precise bearings, until finally 32 points in total were used. "}]