[{"url": "http://www.thinkbabynames.com/meaning/1/Frasier", "passage_text": "Frasier is a rare first name for men but a very popular last name for both adults and children (#4149 out of 150436, Top 3%). (2000 U.S. Census). Shown below is a comparison of the usage of the boy name Frasier and affiliated names. Frasier /fra-si-er/ [3 sylls.] as a boys' name is of Scottish derivation. Frasier is an alternate spelling of Fraser (Scottish). Freasier is a conventional last name. Kreatif forms: Fasier, Freysier, Frisier."}, {"url": "http://www.sheknows.com/baby-names/name/fraser", "passage_text": "The name Fraser is an English baby name. In English the meaning of the name Fraser is: French town. Scottish Meaning: The name Fraser is a Scottish baby name. In Scottish the meaning of the name Fraser is: Strawberry flowers. Of the forest men. A major Scottish clan. From a Scottish surname based on a French place name. "}, {"url": "http://www.surnamedb.com/Surname/Frazier", "passage_text": "This ancient Scottish clan surname, is widely recorded in the spellings of Fraser, Frazer and Frazier, the latter being an American spelling. Curiously, although alwayts associated with Tweedale, its exact origins remain undetermined. "}, {"url": "http://www.thinkbabynames.com/meaning/1/Frazier", "passage_text": "Frazier is a rare given name for men but a very popular surname for all people (#314 out of 150436, Top 1%). (2000 U.S. Census). Below is a charted analysis of the usage of Frazier and corresponding names. The only prominent related form of Frazier (outside Top 1000) is Fraser. Frazier /fra-zier/ [3 sylls.] as a boys' name is of Scottish origin. Frazier is a variant transcription of Fraser (Scottish)."}, {"url": "http://www.ancestry.com/name-origin?surname=frasier", "passage_text": "Click on a circle in the chart to view Frasier birth and death records. An unusually short lifespan might indicate that your ancestors lived in harsh conditions. A short lifespan might also indicate health problems that were once prevalent in your family. The SSDI is a searchable database of more than 70 million names. You can find out when most of the Frasier families immigrated to the United States. You can focus your search to immigration records dating from that era. Immigration records can tell you an ancestor's name, ship name, port of departure, port of arrival and destination."}, {"url": "https://en.wikipedia.org/wiki/Fraser_(surname)", "passage_text": "Fraser is a surname, of Scottish origin (see Clan Fraser). "}, {"url": "http://www.sheknows.com/baby-names/name/frasier", "passage_text": "English Meaning: The name Frasier is an English baby name. In English the meaning of the name Frasier is: French town. Scottish Meaning: The name Frasier is a Scottish baby name. In Scottish the meaning of the name Frasier is: of the forest men. SoulUrge Number: 6. Expression Number: 4. People with this name have a deep inner desire for a stable, loving family or community, and a need to work with others and to be appreciated."}, {"url": "http://www.ancestry.com/name-origin?surname=frasier", "passage_text": "You can find out where the majority of the Frasier families were living before they immigrated to the U.S and learn where to focus your search for foreign records. Immigration records can tell you an ancestor's name, ship name, port of departure, port of arrival, and destination. from the New York Passenger Lists. You can find out when most of the Frasier families immigrated to the United States. You can focus your search to immigration records dating from that era. Immigration records can tell you an ancestor's name, ship name, port of departure, port of arrival"}]