[{"url": "http://beatles.wikia.com/wiki/Octopus%27s_Garden", "passage_text": "An Octopus's Garden. Octopus's Garden is a song from Abbey Road, The Beatles ' second-to-last album. It is known for being the second song Ringo Starr wrote for the Beatles"}, {"url": "http://www.youtube.com/watch?v=YEHBzZsBEvY", "passage_text": "Voice: Giuseppe De Santis. Guitar and backing vocals: Fortunato Redi. Octopus's Garden is a song by The Beatles written by Ringo Starr (under his real name Richard Starkey) from their 1969 album Abbey Road. George Harrison worked on the song with Starr; perhaps out of solidarity as his own songs were often dismissed by John Lennon and Paul McCartney.[citation needed] Harrison commented: 'Octopus's Garden' is Ringo's song."}, {"url": "https://en.wikipedia.org/wiki/Octopus%27s_Garden", "passage_text": "Octopus's Garden. From Wikipedia, the free encyclopedia.  Octopus's Garden  is a song by The Beatles written and sung by Ringo Starr (credited to his real name Richard Starkey) from The Beatles' 1969 album Abbey Road. George Harrison, who assisted Starr with the song, commented: 'Octopus's Garden' is Ringo's song. It's only the second song Ringo has ever written, mind you, and it's lovely.."}, {"url": "http://www.thebeatles.com/song/octopuss-garden", "passage_text": "I'd like to be under the sea in an octopus's garden with you.  Octopus's Garden  is a song by the Beatles written by Ringo Starr (under his real name Richard Starkey) from their 1969 album Abbey Road. George Harrison, who assisted Starr with the song, commented: 'Octopus's Garden' is Ringo's song. It's only the second song Ringo has ever written, mind you, and it's lovely.. He added that the song gets very deep into your consciousness ...because it's so peaceful. "}, {"url": "http://www.last.fm/music/The+Beatles/_/Octopus%27s+Garden", "passage_text": "Octopus's Garden is a song by The Beatles, written by Ringo Starr. It's from their album Abbey Road (1969). It's the second song he wrote for The Beatles, when he quit The Beatles in 1969. He quit the band and spent some time on a boating trip with his family, where he heard a story of how octopi travel the ocean looking for shiny things to keep."}, {"url": "http://www.songfacts.com/detail.php?id=195", "passage_text": "Chomper2011 - Honesdale,, Pa. I love how innocent and happy Ringo is. When the rest of the Beatles where writing, deep, meaningful songs about the meaning of life and what not, he was just happy banging on his drums in an Octopus's Garden. And this song is really good for someone who never wrote songs. Addie-Portland, Mi. Ringo did return to his post for The White Album, discovering his drum kit covered with flowers to welcome him back (George Harrison's idea). The Beatles completed that album and later included Octopus's Garden on Abbey Road."}, {"url": "http://www.youtube.com/watch?v=LDYJkXktIg4", "passage_text": "The Beatles-Octopus's Garden 1969. Octopus's Garden is a song by The Beatles written by Ringo Starr from their 1969 album Abbey Road. George Harrison worked on the song with Ringo Starr; perhaps out of solidarity as his own songs being dismissed by John Lennon and Paul McCartney. "}, {"url": "http://www.iamthebeatles.com/article1231.html", "passage_text": "Octopus's Garden. Starkey. With some help from George Harrison, who rewrote the chord sequence for him, Ringo wrote his second and last Beatles' song with Octopus's Garden. It came about when Ringo was on a boating trip with his family in Sardina in 1968. The boat's captain had offered him an octopus lunch, but he turned it down. "}]