[{"url": "http://www1.salary.com/Surveillance-Operator-Casino-salary.html", "passage_text": "For example the median expected annual pay for a typical Surveillance Operator-Casino in the United States is $37,012, so 50% of the people who perform the job of Surveillance Operator-Casino in the United States are expected to make less than $37,012. Source: HR Reported data as of October 2015. 1  Salary. This chart describes the expected percentage of people who perform the job of Surveillance Operator-Casino that make less than that salary. For example 50% of the people who perform the job of Surveillance Operator-Casino are expected to make less than the median. Source: HR Reported data as of October 2015"}, {"url": "http://work.chron.com/salary-casino-surveillance-operator-8420.html", "passage_text": "According to the bureau's May 2011 Occupational Employment Statistics report on wages for the occupation, casino surveillance operators earned an average annual wage of $33,210 nationwide, which equals an average hourly wage of $15.97. The median annual wage for the group was $30,410 nationwide. According to the bureau, the type of employer is a major salary factor. Local governments employed 2,900 casino surveillance operators at an annual average wage of $33,350."}, {"url": "http://work.chron.com/pay-security-officer-working-casino-3953.html", "passage_text": "Pay by Employer. As of 2011, the few gaming surveillance officers working in spectator sports reported the lowest wages for their occupation, at an average of $28,500 per year. Those working in private casinos averaged nearly $31,000, while those in hotel casinos averaged nearly $35,500 per year. Pay Scale by State. As of 2011, gaming surveillance officers in Connecticut reported the highest average salary to the BLS, about $46,000 per year. Those in Indiana averaged about $43,000 per year, those in Illinois averaged about $41,500 per year, and those in California averaged just more $40"}, {"url": "http://www.payscale.com/research/US/Job=Surveillance_Operator/Hourly_Rate", "passage_text": "(United States). Median pay for Surveillance Operators in the United States is around $13.34 per hour. Compensation ranges from $9.87 per hour on the lower end to $18.43 on the higher end. Job satisfaction is considered about average by most people in this profession. The vast majority of Surveillance Operators (82 percent) who took the survey are men."}, {"url": "http://work.chron.com/pay-security-officer-working-casino-3953.html", "passage_text": "National Pay Figures. According to data collected by the Bureau of Labor Statistics in May 2011, gaming surveillance officers reported a median salary of $30,410 per year. The middle-earning 50 percent made between $25,000 and $40,000 per year. Pay Scale by State. As of 2011, gaming surveillance officers in Connecticut reported the highest average salary to the BLS, about $46,000 per year. Those in Indiana averaged about $43,000 per year, those in Illinois averaged about $41,500 per year, and those in California averaged just more"}, {"url": "http://work.chron.com/pay-security-officer-working-casino-3953.html", "passage_text": "Gaming surveillance officers reported an average annual salary of $33,210 and an average hourly wage of nearly $16 per hour. This compares favorably to the reported average wages of security guards in other fields, which were $27,000 per year and $13 per hour. Pay Scale by State. As of 2011, gaming surveillance officers in Connecticut reported the highest average salary to the BLS, about $46,000 per year. Those in Indiana averaged about $43,000 per year, those in Illinois averaged about $41,500 per year, and those in California averaged just more $40"}, {"url": "http://work.chron.com/salary-casino-surveillance-operator-8420.html", "passage_text": "Geography is also a key factor in compensation. Casino surveillance operators working in Connecticut reported average annual wages of $46,080, followed closely by operators in Indiana at $43,290. Conversely, those working in South Dakota and West Virginia reported average annual wages of $26,320 and $26,540, respectively. According to the bureau, the type of employer is a major salary factor. Local governments employed 2,900 casino surveillance operators at an annual average wage of $33,350."}, {"url": "http://www1.salary.com/Surveillance-Operator-Casino-salary.html", "passage_text": "The annual salary for someone with the job title Surveillance Operator-Casino may vary depending on a number of factors including industry, company size, location, years of experience and level of education. This chart describes the expected percentage of people who perform the job of Surveillance Operator-Casino that make less than that salary. For example 50% of the people who perform the job of Surveillance Operator-Casino are expected to make less than the median. Source: HR Reported data as of October 2015"}]