[{"url": "http://ecee.colorado.edu/ecen4517/materials/flyback.pdf", "passage_text": "Derivation of the flyback converter: a transformer-isolated version of the buck-boostconverter! Typical waveforms, and derivation of M (D) = V / V g ! Flyback transformer design considerations! Voltage clamp snubber Derivation of the flyback converter The flyback converter is based on the buck-boost converter. Its derivation is illustrated inFig. 1. Figure 1(a) depicts the basic buck-boost converter, with the switch realized using aMOSFET and diode. In Fig."}, {"url": "https://en.wikipedia.org/wiki/Flyback_transformer", "passage_text": "A flyback transformer (FBT), also called a line output transformer (LOPT), is a special type of electrical transformer. It was initially designed to generate high voltage sawtooth signals at a relatively high frequency."}, {"url": "http://www.customcoils.com/blog/what-is-a-flyback-transformer/", "passage_text": "A flyback transformer is traditionally used to generate high voltage signals at a high frequency. Many modern flyback applications allow for high voltage designs (up to or above 30kV) that help reduce component count in switched-mode power supplies."}, {"url": "http://www.eetimes.com/document.asp?doc_id=1273089", "passage_text": "Other advantages of the flyback transformer over circuits with similar topology include isolation between primary and secondary and the ability to provide multiple outputs and a choice of positive or negative voltage for the output."}, {"url": "http://www.merriam-webster.com/dictionary/flyback", "passage_text": "Definition of FLYBACK. 1. : the return to zero of the second hand or the split-second hand of a stopwatch or chronograph. 2. : the return of a cathode-ray beam in a television picture tube after it has traced one picture before it traces the next."}, {"url": "https://en.wikipedia.org/wiki/Flyback_transformer", "passage_text": "The flyback transformer circuit was invented as a means of controlling the horizontal movement of the electron beam in a cathode ray tube (CRT)."}, {"url": "http://www.angelfire.com/80s/sixmhz/flyback.html", "passage_text": "A very simple road to your basic high voltage generator is the transistor driven flyback transformer. This circuit uses a common flyback transformer (you probably have more than one in your house right now) to boost typical battery voltages up to the multi-kilovolt range."}, {"url": "https://en.wikipedia.org/wiki/Flyback_transformer", "passage_text": "The flyback transformer is used in the operation of CRT-display devices such as television sets and CRT computer monitors. The voltage and frequency can each range over a wide scale depending on the device."}]