[{"url": "http://www.homeadvisor.com/cost/cabinets-and-countertops/install-countertops/", "passage_text": "Generally speaking, the cost to install a wood countertop averages between $3,000 and $6,000, but costs will vary depending on the type of wood from which the countertop is fashioned. While wood countertops are popular, they also require monthly sealing."}, {"url": "http://home.costhelper.com/granite-countertops.html", "passage_text": "1 Slab granite countertops--solid pieces of granite custom cut to the width and shape of a countertop -- cost $60-$100 per square foot depending on the color and rarity of the granite, the style of edging. 2  Expect to pay $1,800-$3,000 for a typical kitchen, installed."}, {"url": "http://home.costhelper.com/granite-countertops.html", "passage_text": "1 Some manufacturers require a minimum purchase. 2  Slab granite countertops--solid pieces of granite custom cut to the width and shape of a countertop -- cost $60-$100 per square foot depending on the color and rarity of the granite, the style of edging. 3  Expect to pay $1,800-$3,000 for a typical kitchen, installed."}, {"url": "http://www.homeadvisor.com/cost/cabinets-and-countertops/install-countertops/", "passage_text": "Granite countertops are among the most popular countertops in kitchens today. The average cost to install granite countertops is between $3,100 and $4,500, depending on surface size and materials. Generally, granite is cut into long slabs, negating the need for seams and grout. Then it’s polished and sealed to protect against extreme heat, scratches and stains."}, {"url": "https://www.countertopguides.com/guides/granite-countertops-cost.html", "passage_text": "As we’ve noted in other posts, granite countertop prices for the material and installation range from about $30 per square foot up to $155. That’s a broad spectrum! Here are the factors that affect the price you’ll pay for granite counters."}, {"url": "http://home.howstuffworks.com/home-improvement/construction/materials/granite-countertops-on-their-way-out.htm", "passage_text": "Perhaps best of all, the once-pricey countertops are now very affordable, with prices starting at about $20 to $35 per square foot -- although you can still pay up to $80 or $100 per square foot, too, depending on the granite's color and complexity of fabrication [sources: Alter, Truini, Weber ]."}, {"url": "http://www.diynetwork.com/how-to/rooms-and-spaces/kitchen/installing-a-do-it-yourself-granite-countertop", "passage_text": "After cabinets are installed, it’s time to measure for the granite countertops. It’s wise to be very precise. In this project a do-it-yourself granite countertop service provides the granite countertops, a modular system that eliminates expensive fabrication."}]