[{"url": "https://en.wikipedia.org/wiki/Corn_syrup", "passage_text": "Dark corn syrup in commercial packaging. Corn syrup is a food syrup which is made from the starch of maize (called corn in some countries) and contains varying amounts of maltose and higher oligosaccharides, depending on the grade. 1 Dark corn syrup is a combination of corn syrup and molasses (or Refiners' syrup), caramel color and flavor, salt, and the preservative sodium benzoate. 2  Dark corn syrup is a warm brown color and tastes much stronger than light corn syrup. 3  Molasses in dark corn syrup enhances its flavor and color"}, {"url": "http://www.mayoclinic.org/healthy-lifestyle/nutrition-and-healthy-eating/expert-answers/high-fructose-corn-syrup/faq-20058201", "passage_text": "High-fructose corn syrup is a common sweetener in sodas and fruit-flavored drinks. As use of high-fructose corn syrup has increased, so have levels of obesity and related health problems. Some wonder if there's a connection. Research has shown that high-fructose corn syrup is chemically similar to table sugar. It is known, however, that too much added sugar of all kinds — not just high-fructose corn syrup — can contribute unwanted calories that are linked to health problems, such as weight gain, type 2 diabetes, metabolic syndrome and high triglyceride levels."}, {"url": "https://en.wikipedia.org/wiki/High_fructose_corn_syrup", "passage_text": "Structural formulae of fructose (left) and glucose (right). High fructose corn syrup (HFCS) (also called glucose-fructose, isoglucose and glucose-fructose syrup) is a sweetener made from corn starch that has been processed by glucose isomerase to convert some of its glucose into fructose. Corn syrups, including HFCS, are made from corn starch. Commercial production of corn syrup began in 1864. In the late 1950s scientists at Clinton Corn Processing Company in Iowa tried to turn glucose from corn starch into fructose, but the process was not scalable."}, {"url": "http://www.eatingwell.com/nutrition_health/nutrition_news_information/is_high_fructose_corn_syrup_bad_for_you", "passage_text": "A. High-fructose corn syrup (HFCS) is a manmade sweetener that’s found in a wide range of processed foods, from ketchup and cereals to crackers and salad dressings. It also sweetens just about all of the (regular) soda Americans drink. "}, {"url": "http://www.madehow.com/Volume-4/Corn-Syrup.html", "passage_text": "Background. Corn syrup is one of several natural sweeteners derived from corn starch. It is used in a wide variety of food products including cookies, crackers, catsups, cereals, flavored yogurts, ice cream, preserved meats, canned fruits and vegetables, soups, beers, and many others. One derivative of corn syrup is high fructose corn syrup, which is as sweet as sugar and is often used in soft drinks. Corn syrup may be shipped and used as a thick liquid or it may be dried to form a crystalline powder."}, {"url": "http://www.karosyrup.com/faq.html", "passage_text": "Corn syrup is a mildly sweet syrup derived from corn starch. Its main function in recipes is to provide sweetness and moisture, and to prevent the crystallization of sugar. It provides a smooth texture to cooked sweets, such as candies, as well as no-bake recipes, such as ice cream. Karo light and dark corn syrups perform similarly in recipes and can usually be used interchangeably. Recipes usually specify which type to use but the choice may be guided by personal preference. Typically, light corn syrup is used when a delicately sweet flavor is desired, such as in fruit sauces and jams."}, {"url": "http://www.fitday.com/fitness-articles/nutrition/healthy-eating/high-fructose-corn-syrup-vs-corn-syrup-the-facts.html", "passage_text": "Both high fructose corn syrup and corn syrup are frequently used in processed foods in place of sugar. These sugar substitutes are, however, used because they are cheaper than sugar. They are present in everything from cereals and prepackaged desserts to sodas and different types of bread. "}, {"url": "http://www.wisegeek.com/what-is-corn-syrup.htm", "passage_text": "There is no such thing as a natural corn syrup pressed directly from corn kernels. Instead, the pulpy middle layer called cornstarch is first separated from the outer husk and the inner germ layers. The cornstarch is then stored in giant vats, where natural enzymes are added to break it down into glucose. A bottle of corn syrup, which is often used for baking and making candy. Corn syrup is used as a sweetener for caramel popcorn. Corn syrup is made when corn starch is broken down into glucose. Many soft drinks are sweetened with high fructose corn syrup. Corn syrup is used in candy production"}]