[{"url": "http://www.cnn.com/2009/LIVING/worklife/11/02/cb.hire.reasons.job/", "passage_text": "These days, competition is steep among job seekers; it's important to know what employers want in an employee before going into an interview so candidates can sell how they would be an asset to the company."}, {"url": "http://www.practical-handwriting-analysis.com/2009/10/what-employers-want/", "passage_text": "There are certain “soft skills” or personal qualities that consistently rate very high on the most employers “top ten.”. Knowing what the employer is looking for allows the job seeker to make a point of mentioning in their resume, cover letter and at the interview of these qualities that they possess."}, {"url": "http://www.cnn.com/2009/LIVING/worklife/11/02/cb.hire.reasons.job/", "passage_text": "1 If you know what the employer is looking for, you're more likely to get the position. 2  In a 2009 survey, employers listed multitasking as the most desirable characteristics. 3  Show that you have long-term potential, said one expert. 4  Convince the employer you have the ability to make money, and show how, said an expert."}, {"url": "http://rcg.org/youth/articles/0412-tqoave.html", "passage_text": "These ten traits are just a few of the many qualities employers and managers desire in their workers. Practice them. Make them a part of your thinking. Doing so will dramatically increase your worth in the eyes of current and future employers."}, {"url": "http://work.chron.com/good-negative-qualities-say-during-interview-8486.html", "passage_text": "Don't Say You Work too Hard. Don't use the negative quality that you -- work too much or work too hard -- during a job interview. The goal of a job interview is to assess how qualified you are for the position and how your skills stack up against other applicants' qualifications."}, {"url": "http://www.writteninc.com/whats-in-the-report.php", "passage_text": "Home | Candidate Insight | What's in the Report. Candidate Insight Reports are designed to be quick and easy to read. Take a look at the different sections of the report, and consider the fact that a lot of these specific results can't be gleaned from traditional personality tests:"}, {"url": "http://work.chron.com/good-negative-qualities-say-during-interview-8486.html", "passage_text": "When you interview for a job, be prepared to answer questions about your strengths and weaknesses as a job candidate. The strengths part isn't usually too difficult, but discussing your weaknesses or negative qualities might make or break your standing as a qualified applicant."}, {"url": "http://work.chron.com/good-negative-qualities-say-during-interview-8486.html", "passage_text": "When you discuss negative qualities, the goal is to express self-awareness. Most interviewers realize that you're not going to reveal job-threatening weaknesses, but they want to know you have a realistic view of yourself."}, {"url": "http://www.cnn.com/2009/LIVING/worklife/11/02/cb.hire.reasons.job/", "passage_text": "(CareerBuilder.com) -- When you apply for a job, you know exactly what you're looking for. You want a company you love, great co-workers, a decent salary, a culture where you fit in and, most importantly, you want to love what you'll be doing."}]