[{"url": "http://houseplantz.net/scindapsus-pictus-satin-pothos-silk-pothos/", "passage_text": "scindapsus pictus – satin pothos, silk pothos. the genus scindapsus contains approx. 20 members, native to southeast asia. the climbing plants are suitable for growing in a hanging basket or training up a wall. from scindapsus pictus, known as satin pothos or silk pothos are different cultivars available. the satin pothos does best on a bright to light shaded place without direct sunlight. some morning and/or evening sun will be tolerated. if placed to dark the leaves can loose their variegation. scindapsus pictus can be planted in a good regular mix. keep it moist but not wet and avoid overwatering such as drying out"}, {"url": "http://www.ambius.com/ambius-catalogs/tabletop-credenza-plants/scindapsus-silver-satin/index.html", "passage_text": "This is another harder to find variety but it is also one of the most beautiful. The Satin Pothos has deep green leaves with a satiny finish and splashes of silver. Its leaves are smaller than the other types, but it is also a vine that looks lovely in a hanging basket or climbing over the edge of a pot. 1  Varies according to plant selection. "}, {"url": "http://www.budtoblooms.com/site/558422/product/NN6708", "passage_text": "View Larger Image This beautiful Pothos ledge silk plant will give some life to that window ledge, shelf or mantelpiece. Perfectly sized to fit a ledge, this plant is both stately and whimsical at the same time. With lush greens that will dangle just so, it will bring you years of enjoyment, without any water or other type of care."}, {"url": "http://davesgarden.com/guides/articles/view/4607/", "passage_text": "One of my favorite plants is satin pothos. While it is easy to grow and beautiful in my home, it took lots of research to discover the plant's true identity. At first I thought the plant was a philodendron. Its growth habit is much like Philodendron hederaceum, so it made sense to me that it was a satin leaf form of philodendron."}, {"url": "http://davesgarden.com/guides/articles/view/4607/", "passage_text": "The form of satin pothos most frequently grown is a cultivar called ‘Argyraeus’. Slow-growing, vines of this climber grow about a yard long and cascade readily or climb if a totem or other support is provided. Scindapsus pictus is easy to grow. While it is easy to grow and beautiful in my home, it took lots of research to discover the plant's true identity. At first I thought the plant was a philodendron. Its growth habit is much like Philodendron hederaceum, so it made sense to me that it was a satin leaf form of"}, {"url": "http://www.guide-to-houseplants.com/satin-pothos.html", "passage_text": "Satin Pothos. Botanical Name: Scindapsus pictus 'Argyraeus'. Satin Pothos is just as easy to grow as its relative, golden pothos (Epipremnum aureum). Keep it warm and take care not to overwater this house plant. Cold drafts and soggy soil are two things it won't tolerate. You'll see the best leaf color and variegation by keeping this pothos plant in bright, indirect light. You'll also keep this plant healthy by boosting the humidity around it. In fact, its variegated foliage makes this plant a beautiful addition to a terrarium."}, {"url": "http://davesgarden.com/guides/articles/view/4607/", "passage_text": "Probably the common name, satin pothos, led to some of the confusion. The pothos available in nurseries is usually Epipremnum aureus. Popular and easy to grow, the golden pothos, as it is commonly called, is a very popular houseplant for hanging baskets or where a trailer is wanted. While it is easy to grow and beautiful in my home, it took lots of research to discover the plant's true identity. At first I thought the plant was a philodendron. Its growth habit is much like Philodendron hederaceum, so it made sense to me that it was a satin leaf form of"}, {"url": "https://en.wikipedia.org/wiki/Scindapsus_pictus", "passage_text": "Scindapsus pictus (satin pothos, silver vine) is a species of flowering plant in the arum family Araceae, native to Bangladesh, Thailand, Peninsular Malaysia, Borneo, Java, Sumatra, Sulawesi, and the Philippines. The specific epithet pictus means painted, referring to the variegation on the leaves. With a minimum temperature tolerance of 15 °C (59 °F), this plant is cultivated as a houseplant in temperate regions, where it typically grows to 90 cm (35 in)."}, {"url": "http://www.bhg.com/gardening/plant-dictionary/houseplant/pothos/", "passage_text": "Pothos. Epipremnum. One of the best indoor plants for low-light situations, pothos is an easy-care vining plant equally at home in a hanging basket, climbing a plant pole, or spilling over the edge of a table or shelf. Give it normal room temperature and keep the soil slightly on the dry side."}]