[{"url": "http://nymag.com/daily/intelligencer/2013/03/baseball-players-who-went-cupless-a-history.html", "passage_text": "“I don't wear a cup,” said Crawford, via MLB.com. “Never wore a cup. I do too many moves to wear a cup. ... I'm still not going to wear a cup.” 2009 Skip this one if you’re squeamish: In the ninth inning of a 2009 game against the White Sox, Seattle’s Adrian Beltre was nailed by a hard-hit Alexei Ramirez grounder. It's for your own good. And that's why you wear a cup, kids. Earlier this week, after the Mets’ Jordany Valdespin got hit in a very sensitive place by a 94-mile-an-hour Justin Verlander fastball, manager Terry Collins ripped his player for going to bat without a protective cup."}, {"url": "http://www.ehow.com/how_7335534_insert-cup-baseball-slider-shorts.html", "passage_text": "The most common reasons men don't wear a protective cup is because it is uncomfortable and restricts movement. Inserting a cup into baseball slider shorts is easy to do and is highly recommended to reduce or prevent injury. Most of them will have elastic that helps keep the cup in place. Don't wear anything underneath the slider shorts. You want your genitals to be held tightly against the body so if you do get hit there, you have maximum protection. Place the cup over your genitals so that it fits tightly."}, {"url": "http://www.wikihow.com/Put-on-an-Athletic-Cup", "passage_text": "1. Put on your cup athletic supporter before the athletic compression or support shorts if you are using compression or support shorts that do not have a built-in pocket to hold the protector cup. 1  For athletic underwear (compression shorts) with a built-in cup-pocket, skip this step. 1 The sides of the cup should rest against the tissue over your pubic bone and the cup should completely cover your penis and testicles. 2  If your penis and testicles do not fit properly, graduate to a larger cup. 3  There are two kinds of cups."}, {"url": "http://www.wikihow.com/Put-on-an-Athletic-Cup", "passage_text": "3. Slide your cup into the pouch of the cup athletic supporter. 1  The sides of the cup should rest against the tissue over your pubic bone and the cup should completely cover your penis and testicles. 2  If your penis and testicles do not fit properly, graduate to a larger cup. 3  There are two kinds of cups. 1"}, {"url": "http://sportsmom.sportsstarsoftomorrow.com/athletic-cup-how-to-get-the-perfect-fit/", "passage_text": "Doctors suggest you always wear a cup in a cup-jockstrap, cup-brief, or cup-sliding short that’s designed to hold a cup.. Doctors also suggest a cup (inside a cup-jockstrap, cup-brief, or cup-sliding short)should be worn without anything underneath (don’t wear underwear underneath). Size is the key.because protection that is too large or too small may not properly guard against injury. O.K. moms, this can be uncomfortable, but it’s necessary. Get Dad to do it if it makes you too uncomfortable. Have your boy TRY ON the cup. Make sure the testicles are in the bottom and NARROW end of the cup."}, {"url": "http://www.wikihow.com/Choose-and-Wear-a-Protective-Cup-for-Sports", "passage_text": "Always wear a cup in a cup-jockstrap, cup-brief, or cup-sliding short that's designed to hold a cup. The jockstrap, brief or sliding-short will have a pouch to house the cup. There will be elastic, metal snaps or a Velcro closure to keep the cup in place in the pouch. Warnings. 1  Men should consider shaving or trimming their pubic hair on the scrotum and around the base of the penis before wearing a cup. 2  As with any protective gear, you can still get hurt! 3  Once again, remember to always wear your cup tight-fitting to your genitals."}, {"url": "http://nymag.com/daily/intelligencer/2013/03/baseball-players-who-went-cupless-a-history.html", "passage_text": "Seriously, fellas: Wear a cup. It's for your own good. And that's why you wear a cup, kids. Earlier this week, after the Mets’ Jordany Valdespin got hit in a very sensitive place by a 94-mile-an-hour Justin Verlander fastball, manager Terry Collins ripped his player for going to bat without a protective cup."}, {"url": "http://www.wikihow.com/Choose-and-Wear-a-Protective-Cup-for-Sports", "passage_text": "A loose fitting cup will allow the impact of a blow or hit to slam the cup into the testicles, causing pain and possible injury. If your cup-jockstrap or cup-brief does not hold your cup firmly and tightly against your body you can wear a pair of tight fitting nylon/spandex athletic briefs over them. Warnings. 1  Men should consider shaving or trimming their pubic hair on the scrotum and around the base of the penis before wearing a cup. 2  As with any protective gear, you can still get hurt! 3  Once again, remember to always wear your cup tight-fitting to your genitals."}, {"url": "http://www.ehow.com/how_7335534_insert-cup-baseball-slider-shorts.html", "passage_text": "Instructions. Purchase slider shorts that have a cup pocket. Most of them will have elastic that helps keep the cup in place. Don't wear anything underneath the slider shorts. You want your genitals to be held tightly against the body so if you do get hit there, you have maximum protection. Place the cup over your genitals so that it fits tightly."}, {"url": "http://www.wikihow.com/Choose-and-Wear-a-Protective-Cup-for-Sports", "passage_text": "One Methods: Put on the Cup. Many men choose to leave themselves vulnerable by not wearing a protective cup while playing sports. This is likely a result of cups being considered uncomfortable and restrictive. Warnings. 1  Men should consider shaving or trimming their pubic hair on the scrotum and around the base of the penis before wearing a cup. 2  As with any protective gear, you can still get hurt! 3  Once again, remember to always wear your cup tight-fitting to your genitals."}]