[{"url": "http://emedicine.medscape.com/article/2012185-overview", "passage_text": "Neutropenic fever is a single oral temperature of 38.3 º C (101 º F) or a temperature of greater than 38.0 º C (100.4 º F) sustained for more than 1 hour in a patient with neutropenia. Upon initial evaluation, each patient should be assessed for risk of complications from severe infection."}, {"url": "http://www.fpnotebook.com/ID/Hemeonc/NtrpncFvr.htm", "passage_text": "Definition (NCI). Neutropenia associated with fever, the latter indicating the presence of an infection. Definition (NCI_CTCAE). A disorder characterized by a decrease in neutrophils associated with fever. Definition (NCI_NCI-GLOSS). A condition marked by fever and a lower-than-normal number of neutrophils in the blood."}, {"url": "http://medical-dictionary.thefreedictionary.com/neutropenic", "passage_text": "neonatal neutropenia, alloimmune neutropenia in the newborn due to in utero incompatibility between its immunoglobulin G antigens and those of the mother's blood; the mother's blood produces antibodies that cross the placenta and sensitize fetal neutrophils."}, {"url": "http://chemocare.com/chemotherapy/side-effects/fever-neutropenic-fever-and-their-relationship-to-chemotherapy.aspx", "passage_text": "Characteristics and symptoms of neutropenic fever: 1  When a person is neutropenic (has low white blood cells or neutrophils) the usual signs of infection (redness, swelling and pus formation) are absent."}, {"url": "http://www.mayoclinic.org/symptoms/neutropenia/basics/definition/SYM-20050854", "passage_text": "Definition. Neutropenia (noo-troe-PEE-nee-uh) is an abnormally low count of neutrophils, a type of white blood cell that helps fight off infections, particularly those caused by bacteria and fungi. The threshold for defining neutropenia varies slightly from one medical practice to another."}, {"url": "http://medical-dictionary.thefreedictionary.com/neutropenic", "passage_text": "Neutropenia has no specific symptoms except the severity of the patient's current infection. In severe neutropenia, the patient is likely to develop periodontal disease, oral and rectal ulcers, fever, and bacterial pneumonia."}, {"url": "http://medical-dictionary.thefreedictionary.com/neutropenic", "passage_text": "Neutropenia is an abnormally low level of neutrophils in the blood. Neutrophils are white blood cells (WBCs) produced in the bone marrow that ingest bacteria. Neutropenia is sometimes called agranulocytosis or granulocytopenia because neutrophils make up about 60% of WBCs and have granules inside their cell walls."}, {"url": "http://www.medicalnewstoday.com/articles/265373.php", "passage_text": "Neutropenia is a blood condition, a granulocyte disorder, that characterized by a deficiency of neutrophils, a type of white blood cell that defends the body against bacterial and fungal infections."}, {"url": "https://en.wikipedia.org/wiki/Neutropenic_fever", "passage_text": "(Redirected from Neutropenic fever). Febrile neutropenia is the development of fever, often with other signs of infection, in a patient with neutropenia, an abnormally low number of neutrophil granulocytes (a type of white blood cell) in the blood. The term neutropenic sepsis is also applied, although it tends to be reserved for patients who are less well."}]