[{"url": "http://faculty.ccbcmd.edu/courses/bio141/lecguide/unit1/proeu/proeu.html", "passage_text": "That is why eukaryotic cells require a variety of specialized internal organelles to carry out metabolism, provide energy, and transport chemicals throughout the cell. Both, however, must carry out the same life processes. Some features distinguishing prokaryotic and eukaryotic cells are shown in Table 1. - Eukaryotic cells may have flagella or cilia. Flagella and cilia are organelles involved in locomotion and in eukaryotic cells consist of a distinct arrangement of sliding microtubules surrounded by a membrane. The microtubule arrangement is referred to as a 2X9+2 arrangement (see Fig. 9)."}, {"url": "http://education.seattlepi.com/three-examples-prokaryote-three-examples-eukaryote-4492.html", "passage_text": "A prokaryote is a cell without a nucleus and eukaryotes are cells that contain nuclei. There's one quick test to distinguish prokaryotes from eukaryotes: if you can see a single organism, it's a eukaryote. "}, {"url": "http://faculty.ccbcmd.edu/courses/bio141/lecguide/unit1/proeu/proeu.html", "passage_text": "Bacteria are prokaryotic cells; fungi, protozoa, algae, plants, and animals are composed of eukaryotic cells. 7. Viruses are not cells so they are neither prokaryotic nor eukaryotic. They can replicate only inside a living cell. - Eukaryotic cells may have flagella or cilia. Flagella and cilia are organelles involved in locomotion and in eukaryotic cells consist of a distinct arrangement of sliding microtubules surrounded by a membrane. The microtubule arrangement is referred to as a 2X9+2 arrangement (see Fig. 9)."}, {"url": "https://en.wikipedia.org/wiki/Prokaryotic_cells", "passage_text": "Another difference is that ribosomes in prokaryotes are smaller than in eukaryotes. However, two organelles found in many eukaryotic cells, mitochondria and chloroplasts, contain ribosomes similar in size and makeup to those found in prokaryotes. A prokaryote is a single-celled organism that lacks a membrane-bound nucleus (karyon), mitochondria, or any other membrane-bound organelle."}, {"url": "http://funwithfungus.weebly.com/-prokaryote-or-eukaryote.html", "passage_text": "Fungi are eukaryotes.The hypea of many fungi contain nuclei. To be a eukaryote your cells/hyphea need to contain nuclei. "}, {"url": "http://www.cod.edu/PEOPLE/FACULTY/FANCHER/ProkEuk.htm", "passage_text": "1 Both cell types have many, many ribosomes, but the ribosomes of the eukaryotic cells are larger and more complex than those of the prokaryotic cell. 2  Ribosomes are made out of a special class of RNA molecules (ribosomal RNA, or rRNA) and a specific collection of different proteins. Pro means before, and eu means true, or good.. So Prokaryotic means before a nucleus, and eukaryotic means possessing a true nucleus.. This is a big hint about one of the differences between these two cell types."}, {"url": "https://en.wikipedia.org/wiki/Eukaryotes", "passage_text": "The presence of a nucleus gives eukaryotes their name, which comes from the Greek ευ (eu, well) and κάρυον (karyon, nut or kernel). Eukaryotic cells also contain other membrane-bound organelles such as mitochondria and the Golgi apparatus. In addition, plants and algae contain chloroplasts. Eukaryotes belong to the taxon Eukarya or Eukaryota. The defining feature that sets eukaryotic cells apart from prokaryotic cells (Bacteria and Archaea) is that they have membrane-bound organelles, especially the nucleus, which contains the genetic material, and is enclosed by the nuclear envelope."}, {"url": "http://www.answers.com/Q/Is_fungi_prokaryote_or_eukaryote", "passage_text": "Fungi are eukaryotic which means that on a cellular level they are closely related to other eukaryotic kingdoms such as animals and plants. Eukaryote simply means that they have a true nucleus i.e. one bound with a nuclear membrane. Bacteria and blue-green algae are prokaryotic, which means before nucleus. though some fungi lack the traditional mitochondria that provides a cell with ATP. They are a category of fungi that make their ATP from hydrogenosomes (a struc … ture name for the hydrogen it produces as waste). It is eukaryotic since the cell has a nucleus, has organelles, and is large in size."}, {"url": "http://www.answers.com/Q/Is_fungi_prokaryote_or_eukaryote", "passage_text": "Eukaryotic... though some fungi lack the traditional mitochondria that provides a cell with ATP. They are a category of fungi that make their ATP from hydrogenosomes (a struc … ture name for the hydrogen it produces as waste). It is eukaryotic since the cell has a nucleus, has organelles, and is large in size."}, {"url": "http://www.answers.com/Q/Is_a_mushroom_eukaryote_or_prokaryote", "passage_text": "The nucleoid (meaning nucleus-like) is an irregularly-shaped region within the cell of prokaryotes which has nuclear material without a nuclear membrane and where the genetic … material is localized. Storage of the genome within a nucleoid can be contrasted against that within eukaryotes, where the genome is packed into chromatin and sequestered within a membrane-enclosed organelle called the nucleus."}]