[{"url": "http://manufacturing.dustystrings.com/harps/", "passage_text": "Harps. Celtic harp, folk harp and lever harp are the terms most commonly used to describe the style of harp that we make. While the first two are certainly accurate descriptions, they can imply that these harps are meant for folk music alone, when in fact we have heard everything from the traditional Celtic repertoire to music from other folk traditions, classical, jazz, pop, original compositions and therapy music played on our harps."}, {"url": "https://en.wikipedia.org/wiki/Celtic_harp", "passage_text": "The Celtic harp is a triangular harp traditional to Brittany, Ireland, Scotland and Wales. It is known as a telenn in Breton, clairseach cláirseach In, irish clarsach Clàrsach In scottish gaelic and Telyn. in welsh The Norman-Welsh cleric and scholar Gerald of Wales (c.1146 – c.1223), whose Topographica Hibernica et Expugnatio Hibernica is a description of Ireland from the Anglo-Norman point of view, praised Irish harp music (if little else), but added that, in the opinion of many, the Scots had now surpassed them in that skill."}, {"url": "http://www.harpconnection.com/harpstore/harp-CelticHarps.html", "passage_text": "Celtic Lever Harps. Also called folk harps or troubadour harps, lever harps are distinguished by the lever mechanism that lets you change the pitch of each string. Most of our Celtic lever harps have sharpening levers on each string; certain models only have levers on C's and F's. More levers lets you play in a wider range of keys without re-tuning strings. Our Celtic harps are generally styled after the traditional Irish harp made popular in Ireland centuries ago. Our web site includes short videos of all the Celtic lever harps made by Dusty Strings; you will find links to the videos on our individual harp pages. Our movies use the QuickTime movie format; you can get a free player for all computers directly from Apple's Quicktime Download Site."}, {"url": "http://www.thecelticharp.com/", "passage_text": "The Celtic Harp welcomes you to the historic brewery district. Our dining room features an Irish-American menu, with our Famous Shepherd's pie, Friday fish fry and our Corned Beef and Cabbage on Saturday. Or try our amazing appetizers, such as K.C. Hawg Wings, Irish Chips and our very own Dublin Dippers. "}, {"url": "https://en.wikipedia.org/wiki/Celtic_harp", "passage_text": "The early history of the triangular frame harp in Europe is contested. The first instrument associated with the harping tradition in the Gaelic world was known as a cruit. This word may originally have described a different stringed instrument, being etymologically related to the Welsh crwth. The Norman-Welsh cleric and scholar Gerald of Wales (c.1146 – c.1223), whose Topographica Hibernica et Expugnatio Hibernica is a description of Ireland from the Anglo-Norman point of view, praised Irish harp music (if little else), but added that, in the opinion of many, the Scots had now surpassed them in that skill."}, {"url": "https://en.wikipedia.org/wiki/Harp", "passage_text": "The harp is a stringed musical instrument which has a number of individual strings running at an angle to its soundboard, which are plucked with the fingers. Harps have been known since antiquity in Asia, Africa, and Europe, dating back at least as early as 3500 BC. "}, {"url": "http://www.celticharps.com/", "passage_text": "Celtic Harps by Rick Stanley are custom-crafted by a harper who performs as well as he works the wood, so your original harp is exquisite in both tone and form. Each Celtic Harp is a one-of-a-kind instrument, made with your choice of woods, painting and ornamentation. "}, {"url": "http://www.harpconnection.com/harpstore/harp-CelticHarps.html", "passage_text": "The Harp Connection offers Celtic harps in a huge range of sizes, from 26 to 38 strings, many different kinds of woods and soundboard and body ornamentation. Unlike our classic lever harps, which are all made of maple, Celtic harps can be made of walnut, cherry and more exotic woods like bubinga. Our web site includes short videos of all the Celtic lever harps made by Dusty Strings; you will find links to the videos on our individual harp pages. Our movies use the QuickTime movie format; you can get a free player for all computers directly from Apple's Quicktime Download Site."}, {"url": "http://www.celticharper.com/faq.html", "passage_text": "The Celtic harp also goes by the names folk harp, lever harp and Irish harp. The last is a bit of a misnomer; technically, an Irish harp would be a harp made in Ireland. Just as Celtic music often brings the bonny green isles to mind, so too does the Celtic harp. "}]