[{"url": "http://www.epicurious.com/recipes/food/views/roast-capon-with-lemon-and-thyme-107968", "passage_text": "Preparation. 1  Preheat oven to 375°F. 2  Rinse capon inside and out and discard any excess fat from cavity. 3  While capon is standing, stir together butter, zest, thyme, salt, and pepper in a small bowl. 4  Turn capon so neck cavity is nearest you. 5  Place 6 lemon wedges in cavity of bird and tie legs together with string. 6  Roast capon in middle of oven, ... 7  Ti 1 Pat capon dry and season cavity with salt and pepper. 2  Put in a large roasting pan and let stand at room temperature 20 minutes"}, {"url": "http://culinaryarts.about.com/od/glossary/g/Capon.htm", "passage_text": "A capon is a rooster that has been castrated before reaching sexual maturity. The reason a rooster is made into a capon has mostly to do with the quality of the meat. But also, a capon is less aggressive than a rooster and is easier to handle. The difference between capon meat and rooster meat is due to the absence of sexual hormones. The process of making a rooster into a capon is called caponization. A capon is usually castrated at around 8 weeks of age or earlier."}, {"url": "http://www.epicurious.com/recipes/food/views/roast-capon-with-lemon-and-thyme-107968", "passage_text": "1 Preheat oven to 375°F. 2  Rinse capon inside and out and discard any excess fat from cavity. 3  Pat capon dry and season cavity with salt and pepper. 4  Put in a large roasting pan and let stand at room temperature 20 minutes. 1 Pat capon dry and season cavity with salt and pepper. 2  Put in a large roasting pan and let stand at room temperature 20 minutes. 3  While capon is standing, stir together butter, zest, thyme, salt, and pepper in a small bowl."}, {"url": "http://www.epicurious.com/recipes/food/views/roast-capon-with-lemon-thyme-and-onions-235739", "passage_text": "Preparation. Rinse capon inside and out and discard any excess fat from cavity. Pat capon dry inside and out, then sprinkle cavity with 1/2 teaspoon salt and 1/2 teaspoon pepper. Put capon in a large flameproof roasting pan (17 by 12 by 3 inches) and let stand at room temperature 30 minutes. "}, {"url": "http://www.wisegeek.org/what-is-a-capon.htm", "passage_text": "You won't believe these 10 facts about people. A capon is a castrated rooster. Capons are considered by many people to be a boutique and old fashioned sort of food, and they tend to have more tender, flavorful flesh as well as a higher fat content. Since most poultry is mass produced commercially, it can be difficult to find a capon unless a consumer has access to a quality butcher or small family farm. Experimenting with these birds is considered to be well worth the effort by some."}, {"url": "https://en.wikipedia.org/wiki/Capon", "passage_text": "Capon is produced in France, in many regions, notably Gers and Jura regions. It is a specialty of Bresse (Chapon de Bresse), where it has its own appellation to differentiate it from other capons from other regions. Caponization is the process of turning a cockerel into a capon. Caponization can be done by surgically removing the bird's testes, or may also be accomplished through the use of estrogen implants. With either method, the sex hormones normally present are no longer effective."}, {"url": "http://www.epicurious.com/recipes/food/views/roast-capon-with-lemon-and-thyme-107968", "passage_text": "1 Rinse capon inside and out and discard any excess fat from cavity. 2  Pat capon dry and season cavity with salt and pepper. 3  Put in a large roasting pan and let stand at room temperature 20 minutes. 4  While capon is standing, stir together butter, zest, thyme, salt, and pepper in a small bowl. 1 Pat capon dry and season cavity with salt and pepper. 2  Put in a large roasting pan and let stand at room temperature 20 minutes. 3"}, {"url": "https://en.wikipedia.org/wiki/Capon", "passage_text": "A capon (from Spanish capon) capón is a rooster or cockerel that has been castrated to improve the quality of its flesh for food, and in some countries Like, spain fattened by forced. Feeding in The United, kingdom birds sold as capons are chemically or physically castrated (roosters cocks IN). uk Caponization is the process of turning a cockerel into a capon. Caponization can be done by surgically removing the bird's testes, or may also be accomplished through the use of estrogen implants. With either method, the sex hormones normally present are no longer effective."}, {"url": "http://modernfarmer.com/2014/04/capons-unfairly-forgotten-piece-agriculture-somewhat-disturbing-luxury/", "passage_text": "Share. In 1913, farmer George Beuoy published a pamphlet titled “What’s a Capon and Why.” He believed that the castrated cockerels — which, without their testosterone, plump up to anywhere from 7 to 12 pounds — could change the face of the struggling poultry industry. "}, {"url": "http://culinaryarts.about.com/od/glossary/g/Capon.htm", "passage_text": "Capon meat is also relatively fatty, and has a high proportion of white meat. The difference between capon meat and rooster meat is due to the absence of sexual hormones. The process of making a rooster into a capon is called caponization. A capon is usually castrated at around 8 weeks of age or earlier."}]