[{"url": "http://beltina.org/health-dictionary/artery-definition-function.html", "passage_text": "Artery-definition and function. Artery is a flexible, muscular BLOOD vessel that carries blood from the HEART and oxygenated blood to tissues throughout the body. The wall of an artery has three layers: 1  adventitia, the outermost layer, which is primarily connective tissue that gives the artery its FLEXIBILITY. The body’s largest artery is the aorta, which carries blood from the heart to the network of arteries that then carry the blood throughout the body. Fibrous sheaths enclose most of the body’s arteries, usually along with the companion VEIN and NERVE."}, {"url": "http://www.articlesbase.com/diseases-and-conditions-articles/cardiovascular-system-blood-vessels-4882533.html", "passage_text": "Intima is the inner most layer that comprise the artery wall. It is a thin wall lines that lines the artery wall with endothelial cells successfully separating blood flow from other layers of the wall of artery. The media is the middle and the thickest of the three walls (Wright, 1993). Media contain strength mechanism like smooth muscles, elastin, and collagen. The last layer, Adventia is the outermost layer of the artery wall that mostly contains collagen. Adventia provides form and strength of"}, {"url": "http://subclavianview.blogspot.com/2011/10/cardiovascular-system-blood-vessels.html", "passage_text": "Intima is the inner most layer that comprise the artery wall. It is a thin wall lines that lines the artery wall with endothelial cells successfully separating blood flow from other layers of the wall of artery. The media is the middle and the thickest of the three walls (Wright, 1993). Media contain strength mechanism like smooth muscles, elastin, and collagen. The last layer, Adventia is the outermost layer of the artery wall that mostly contains collagen. Adventia provides form and strength of the artery wall. "}, {"url": "https://quizlet.com/2360749/anatomy-terms-for-lu-5-flash-cards/", "passage_text": "Large Sized, Elastic or Conducting Arteries. 1. The tunica media (middle layer) contain more elastic fibers (hence the name elastic) than smooth muscle smooth muscle 2. These vessels will conduct (hence the name conducting) blood to the muscular arteries 3. They are designated large because the diameter is larger than the medium sized arteries. Capillaries. 1. Microscopic vessels that carry blood from small arteries (arterioles) to small veins (venules). 2. They connect arterioles to venules. 3. The capillary wall is composed of only single layers of cells (endothelium) 4. They have no tunica media or adventitia. 5."}, {"url": "https://www.sharecare.com/health/circulatory-system-health/middle-layer-arteries", "passage_text": "The middle layer of your arteries, the media, supports the entire arterial structure by working a little like a hand squeezing a hose or a boa constrictor squeezing a neck. When you're depressed or anxious, the layer can constrict—narrowing the amount of space where blood can flow through (the lumen). "}, {"url": "https://answers.yahoo.com/question/index?qid=20100513173929AAt2p0M", "passage_text": "Inside this layer is the tunica media, or media, which is made up of smooth muscle cells and elastic tissue. The innermost layer, which is in direct contact with the flow of blood is the tunica intima. This layer is made up of mainly endothelial cells. Veins: The thick, outer-most layer of a vein is made of collagen, wrapped in bands of smooth muscle while the interior is lined with epithelial cells called intima. Most veins have one-way flaps called venous valves that prevent blood from flowing back and pooling in the lower extremities due to the effects of gravity."}, {"url": "https://answers.yahoo.com/question/index?qid=20100513173929AAt2p0M", "passage_text": "Relevance. Rating Newest Oldest. Best Answer: There are three main layers in arteries and veins-A muscular middle which is very elastic and strong, an outer layer of tissue, and an inner layer of smooth epithelial cells. Veins: The thick, outer-most layer of a vein is made of collagen, wrapped in bands of smooth muscle while the interior is lined with epithelial cells called intima. Most veins have one-way flaps called venous valves that prevent blood from flowing back and pooling in the lower extremities due to the effects of gravity."}, {"url": "http://highered.mheducation.com/sites/0077353064/student_view0/lab47/pre-lab_questions.html", "passage_text": "The middle layer of an artery and vein contains mostly. connective tissue. simple squamous epithelium. smooth muscle. nervous tissue. 2. Arteries carry blood. away from the heart. toward the heart. both away and toward the heart. "}, {"url": "https://en.wikipedia.org/wiki/Tunica_media", "passage_text": "The tunica media (New Latin middle coat), or media for short, is the middle tunica (layer) of an artery or vein. It lies between the tunica intima on the inside and the tunica externa on the outside. Tunica media is made up of smooth muscle cells and elastic tissue"}]