[{"url": "http://www.healthgrades.com/symptoms/sugar-in-urine", "passage_text": "Sugar (glucose) is usually present in the urine at very low levels or not at all. Abnormally high amounts of sugar in the urine, known as glycosuria, are usually the result of high blood sugar levels. High blood sugar usually occurs in diabetes, especially when untreated. Normally, when blood is filtered in the kidneys, some sugar remains in the fluid that will later become urine. "}, {"url": "http://www.healthline.com/health/glucose-test-urine", "passage_text": "Renal glycosuria is a rare condition in which the kidneys release glucose into the urine. This condition can cause urine glucose levels to be high even if the blood glucose levels are normal. When too much glucose is found in the urine, the most common culprit is diabetes. Your doctor will probably refer you to an endocrinologist and a nutritionist to help plan the best strategies to get your glucose levels under control. Tell us what you think."}, {"url": "http://www.healthline.com/health/glucose-test-urine", "passage_text": "A urine glucose test is a quick, easy way to check for abnormally high levels of glucose in the urine. You will be asked to urinate into a plastic laboratory cup. A lab technician can check glucose levels immediately by using a small cardboard device known as a dipstick. When too much glucose is found in the urine, the most common culprit is diabetes. Your doctor will probably refer you to an endocrinologist and a nutritionist to help plan the best strategies to get your glucose levels under control. Tell us what you think."}, {"url": "http://www.diabetesselfmanagement.com/diabetes-resources/definitions/urine-glucose-test/", "passage_text": "Test for glycosuria, the excretion of glucose in the urine. The test for urine glucose uses a small dipstick that changes color after it has been dipped in urine. Matching the color on the dipstick against a chart on the test package reveals whether there is glucose in the urine. First, the renal threshold — the blood glucose level at which the kidneys begin to excrete glucose in the urine — is relatively high. In healthy, nondiabetic individuals, the average renal threshold is at a blood glucose level of 160–180 mg/dl."}, {"url": "http://answers.webmd.com/answers/5005222/what-does-sugar-in-the-urine-mean", "passage_text": "26 Followers. A. The kidneys usually don't spill glucose (sugar) in the urine unless you have high blood sugar at a level of 200 mg/dL or higher. The American Diabetic Associaiton (ADA) does not recommend that people with diabetes do routine urine glucose testing if you are able to do fingerstick blood glucose testing. "}, {"url": "http://www.urmc.rochester.edu/encyclopedia/content.aspx?ContentTypeID=167&ContentID=glucose_urine", "passage_text": "A urine glucose test is used to indirectly determine whether your levels of glucose, or blood sugar, are within a healthy range. It's used to monitor both type 1 and type 2 diabetes. If your blood glucose rises above normal, your kidneys get rid of the extra glucose in your urine. That's why a urine glucose test may be able to determine whether your blood glucose is too high. Although easier to perform than a blood test, a urine test for glucose is not as accurate as a blood test. Urine tests are usually used only when blood testing for glucose is difficult or impossible."}, {"url": "https://en.wikipedia.org/wiki/Glycosuria", "passage_text": "Glycosuria or glucosuria is the excretion of glucose into the urine. Ordinarily, urine contains no glucose because the kidneys are able to reclaim all of the filtered glucose back into the bloodstream. Glycosuria is nearly always caused by elevated blood glucose levels, most commonly due to untreated diabetes mellitus. Rarely, glycosuria is due to an intrinsic problem with glucose reabsorption within the kidneys themselves, a condition termed renal glycosuria."}, {"url": "http://www.healthline.com/health/type-2-diabetes/urine-tests", "passage_text": "While blood glucose testing is the primary way to test for high glucose, urine testing can also be useful: because excess glucose in the body eventually passes through urine, testing urine can provide insight into whether or not there is excess glucose throughout the rest of your body. Glucose Testing. Testing for glucose (blood sugar) in your urine is a way to tell how your body is treating excess glucose. Generally, the human body doesn’t “spill” glucose into urine unless levels become very high in your bloodstream."}, {"url": "http://www.anytestkits.com/utk-glucose-in-urine.htm", "passage_text": "Glucose in urine. When abnormal values of glucose are found during a urine test, further investigation is required to ascertain your true health status. Using a urine test is a quick and inexpensive way to check for glucose in your urine, and is one of our test kit products that can be done in the privacy of your home."}, {"url": "http://www.healthline.com/health/glucose-test-urine", "passage_text": "Diabetes. When too much glucose is found in the urine, the most common culprit is diabetes. Your doctor will probably refer you to an endocrinologist and a nutritionist to help plan the best strategies to get your glucose levels under control. Tell us what you think."}]