[{"url": "http://www.mondaq.com/india/x/26049/Healthcare/Biotechnology+Laws+in+India", "passage_text": "1 Laws pertaining to Intellectual Property Rights. 2  Rules for the Manufacture, Use/Import/Export and Storage of Hazardous Micro Organisms/Genetically Engineered Organisms or Cells, 1989 notified by Ministry of Environment & Forests on December 5, 1989 under Environment and Protection Act, 1986."}, {"url": "http://envfor.nic.in/major-initiatives/geac-clearances", "passage_text": "The Genetic Engineering Appraisal Committee (GEAC) is the apex body constituted in the Ministry of Environment and Forests under 'Rules for Manufacture, Use, Import, Export and Storage of Hazardous Microorganisms/Genetically Engineered Organisms or Cells 1989', under the Environment Protection Act, 1986."}, {"url": "http://www.moef.nic.in/division/genetic-engineering-approval-committee-geac", "passage_text": "1 G enetic Engineering Appraisal Committee (GEAC) established under MoEFCC is the apex body to accord notified under Rules 1989. 2  For approval of activities involving large scale use of hazardous microorganisms and recom­binants in research and industrial production from the environ­mental angle."}, {"url": "http://www.thehindu.com/news/national/dont-allow-field-trials-of-gm-crops-farmers-activists/article6234812.ece", "passage_text": "science and technology. The recent decision of the Genetic Engineering Appraisal Committee (GEAC) to allow field trials of GM rice, mustard, cotton, chickpea and brinjal has been met with strong opposition from farmers’ groups and environmental activists."}, {"url": "http://www.prsindia.org/administrator/uploads/general/1349957427_Standing%20Committee%20Report%20Summary-%20GMO%20Final.pdf", "passage_text": "Genetic Engineering Appraisal Committee (GEAC) – functions under the Ministry of Environment and Forests. It is the apex body to accord environmental approval of activities involving large scale use of hazardous micro-organisms and recombinants in research and industrial production."}, {"url": "http://www.moef.nic.in/division/genetic-engineering-approval-committee-geac", "passage_text": "Rules for the Manufacture, Use/Import/Export and Storage of Hazardous Micro Organisms/ Genetically Engineered Organisms or Cells. Biosafety concerns have led to the development of regulatory regimes in various countries for research, testing, safe use and handling of GMOs and products thereof."}, {"url": "http://dbtbiosafety.nic.in/committee/New_geac.htm", "passage_text": "i) The Committee shall function as a Statutory Body under the Ministry of Environment & Forests for approval of activities involving large-scale use of hazardous living microorganisms and recombinants in research and industrial production from the environmental angle as per the provisions of rules 1989."}, {"url": "http://ecowatch.com/2015/07/25/vandana-shiva-end-monsanto/", "passage_text": "India’s biosafety framework—one of the strongest in the world—is governed by The Rules for the Manufacture, Use, Import, Export and Storage of Hazardous Micro Organisms, Genetically Engineered Organisms or Cells (notified under the Environment Protection Act, 1986)."}, {"url": "http://www.isaaa.org/kc/cropbiotechupdate/article/default.asp?ID=6475", "passage_text": "India's apex biotech regulatory committee, the Genetic Engineering Approval Committee (GEAC) that functions as a statutory body under the Environment Protection Act 1986 of the Ministry of Environment & Forests (MoEF), has been changed to Genetic Engineering Appraisal Committee."}, {"url": "http://www.prsindia.org/administrator/uploads/general/1349957427_Standing%20Committee%20Report%20Summary-%20GMO%20Final.pdf", "passage_text": "It is also mandated with approving the release of genetically engineered organisms and products into the environment, including experimental field trials. ii. Review Committee on Genetic Manipulation (RCGM) – functions under the Department of Biotechnology (DBT), Ministry of Science and Technology."}]