[{"url": "http://www.tradingeconomics.com/united-states/personal-income", "passage_text": "Personal Income in the United States averaged 0.54 percent from 1959 until 2015, reaching an all time high of 3.80 percent in December of 1992 and a record low of -5.10 percent in January of 2013. 1Y 5Y 10Y MAX. Forecast Export Data API Access. "}, {"url": "https://en.wikipedia.org/wiki/Household_income_in_the_United_States", "passage_text": "According to the US Census Bureau persons with doctorates in the United States had an average income of roughly $81,400. The average for an advanced degree was $72,824 with men averaging $90,761 and women averaging $50,756 annually. The state with the highest median household income in the United States as of the US Census Bureau 2009 is Maryland with $69,272, followed by New Jersey, Connecticut and Alaska, making the Northeastern United States the wealthiest area by income in the entire country."}, {"url": "https://en.wikipedia.org/wiki/Personal_income_in_the_United_States", "passage_text": "Among different demographics (marital status, race, gender) for those over the age of 18, median personal income ranged from $3,317 for an unemployed, married Asian American female to $55,935 for a full-time, year-round employed Asian American male. In the United States the most widely cited personal income statistics are the Bureau of Economic Analysis 's personal income and the Census Bureau 's per capita money income."}, {"url": "https://en.wikipedia.org/wiki/Household_income_in_the_United_States", "passage_text": "Overall, the mean household income in the United States, according to the US Census Bureau 2014 Annual Social and Economic Supplement, was $72,641, or $20,702 (39.86%) higher than the median household income ($51,939). The state with the highest median household income in the United States as of the US Census Bureau 2009 is Maryland with $69,272, followed by New Jersey, Connecticut and Alaska, making the Northeastern United States the wealthiest area by income in the entire country."}, {"url": "http://www.deptofnumbers.com/income/us/", "passage_text": "US Real Median Household Income Trends since 2005. The current median household income for the United States is $53,657. Real median household income peaked in 2007 at $57,936 and is now $4,279 (7.39%) lower. From a post peak low of $52,970 in 2012, real median household income for the United States has now grown by $687 (1.30%)."}, {"url": "https://en.wikipedia.org/wiki/Household_income_in_the_United_States", "passage_text": "One key measure is the real median level, meaning half of households have income above that level and half below, adjusted for inflation. According to the Federal Reserve, this measure was $51,939 in 2013, below the 1999 peak of around $57,000. The state with the highest median household income in the United States as of the US Census Bureau 2009 is Maryland with $69,272, followed by New Jersey, Connecticut and Alaska, making the Northeastern United States the wealthiest area by income in the entire country."}, {"url": "https://en.wikipedia.org/wiki/Personal_income_in_the_United_States", "passage_text": "The minimum wage is approximately 25% over the official U.S. government-designated poverty income level for a single person unit (before taxes) and about 63% of the designated poverty level for a family of four, assuming only one worker (again before taxes). (See Poverty in the United States). In the United States the most widely cited personal income statistics are the Bureau of Economic Analysis 's personal income and the Census Bureau 's per capita money income."}, {"url": "http://www.averagesalarysurvey.com/united-states", "passage_text": "Average incomes in Florida are $75,000. Average salaries in Michigan and Pennsylvania are $73,000 per annual. By far most paid US city is San Francisco, with average salary about $100,000 per annual. The second largest salaries are in New York City, Washington DC, and Boston, all from $87,000 to $88,000 per annual. You can find salary details for each country on Salaries by countries or check Salaries in EU. If you compare states, the highest incomes are in Massachusetts, New York State, District Of Columbia (DC) , and California all exceeding $82,000 per annual. Employees in Texas receive about $77,500."}, {"url": "https://en.wikipedia.org/wiki/Household_income_in_the_United_States", "passage_text": "In 2007, all households in the United States earned roughly $7.723 trillion. One half, 49.98%, of all income in the US was earned by households with an income over $100,000, the top twenty percent. Over one quarter, 28.5%, of all income was earned by the top 8%, those households earning more than $150,000 a year. The state with the highest median household income in the United States as of the US Census Bureau 2009 is Maryland with $69,272, followed by New Jersey, Connecticut and Alaska, making the Northeastern United States the wealthiest area by income in the entire country."}, {"url": "http://www.deptofnumbers.com/income/us/", "passage_text": "US Household Income. According to the Census ACS survey, the median household income for the United States was $53,657 in 2014, the latest data available. 2015 Census ACS data (including 2015 national household income numbers) will be released in September of 2016. Real median household income peaked in 2007 at $57,936 and is now $4,279 (7.39%) lower. From a post peak low of $52,970 in 2012, real median household income for the United States has now grown by $687 (1.30%)."}]