[{"url": "https://en.wikipedia.org/wiki/Plant_physiology", "passage_text": "The field of plant physiology includes the study of all the internal activities of plants—those chemical and physical processes associated with life as they occur in plants. This includes study at many levels of scale of size and time. Thirdly, plant physiology deals with interactions between cells, tissues, and organs within a plant. Different cells and tissues are physically and chemically specialized to perform different functions."}, {"url": "http://employees.csbsju.edu/SSAUPE/biol327/Lecture/intro-lec.htm", "passage_text": "B. In essence, plant physiology is a study of the plant way of life, which include various aspects of the plant lifestyle and survival including: metabolism, water relations, mineral nutrition, development, movement, irritability (response to the environment), organization, growth, and transport processes. "}, {"url": "http://www.wisegeek.com/what-does-a-plant-physiologist-do.htm", "passage_text": "A plant physiologist is a scientist who concentrates on studying, understanding and often teaching the integral biological processes of plants. These professionals spend most of their time conducting research on certain elements of plant life. Biology and the organic nature of plant life is foundational, but the day-to-day work of an average plant physiologist involves a high degree of both chemistry and math. Physiologists study the internal workings of plants, often on a cellular level."}, {"url": "http://www.wisegeek.com/what-does-a-plant-physiologist-do.htm", "passage_text": "Plant physiologists may work in biology, soil science, or agriculture. A plant physiologist studies the biological processes of plants. Biology and the organic nature of plant life is foundational, but the day-to-day work of an average plant physiologist involves a high degree of both chemistry and math. Physiologists study the internal workings of plants, often on a cellular level."}, {"url": "https://en.wikipedia.org/wiki/Plant_physiology", "passage_text": "Plant physiology is a subdiscipline of botany concerned with the functioning, or physiology, of plants. Thirdly, plant physiology deals with interactions between cells, tissues, and organs within a plant. Different cells and tissues are physically and chemically specialized to perform different functions."}, {"url": "https://en.wikipedia.org/wiki/Plant_physiology", "passage_text": "Secondly, plant physiology includes the study of biological and chemical processes of individual plant cells. Plant cells have a number of features that distinguish them from cells of animals, and which lead to major differences in the way that plant life behaves and responds differently from animal life. Thirdly, plant physiology deals with interactions between cells, tissues, and organs within a plant. Different cells and tissues are physically and chemically specialized to perform different functions."}]