[{"url": "http://learn.org/articles/Quality_Assurance_Management_How_to_Become_a_Quality_Assurance_Manager_in_5_Steps.html", "passage_text": "How to Become a Quality Assurance Manager in 5 Steps. A quality assurance manager supervises and coordinates the activities of a product or service and ensures that it meets client and company standards. Find out the education and experience that could start you in this field."}, {"url": "http://www1.salary.com/Quality-Assurance-Director-salary.html", "passage_text": "For example the median expected annual pay for a typical Quality Assurance Director in the United States is $124,906 so 50% of the people who perform the job of Quality Assurance Director in the United States are expected to make less than $124,906. Source: HR Reported data as of October 2015. Median $124,906. 1  Salary."}, {"url": "http://www.qasinternational.com.au/how-long-will-it-take-how-much-will-it-cost-to-attain-iso-9001-certification/", "passage_text": "This is a question which is frequently asked by business owners and managers that are looking to acquire QA certification. According to the ISO 9001 quality assurance consultants, the answer to the question how long it will take before certification is achieved depends on range of various factors."}, {"url": "http://www.ehow.com/how_2069063_become-quality-assurance-manager.html", "passage_text": "Prepare to become a quality assurance manager by having experience in a management or supervisory position. Many companies require at least 1 to 3 years of management or supervisory experience before they will consider you for a quality assurance manager position."}, {"url": "http://learn.org/articles/Quality_Assurance_Management_How_to_Become_a_Quality_Assurance_Manager_in_5_Steps.html", "passage_text": "Step 5: Work as a Quality Assurance Manager. Quality assurance managers usually work in manufacturing companies and industries where they analyze a variety of electronic data and have different work schedules."}, {"url": "http://www.qaqccrossing.com/article/800068/How-to-Become-a-Successful-Quality-Assurance-Officer/", "passage_text": "The average annual salary of a quality assurance officer is about $65,625 to $117,634. The median annual salary is at $85,000. The salary also depends on the number of years of experience and educational background and the responsibilities assigned you at work."}, {"url": "http://www.ehow.com/how_2069063_become-quality-assurance-manager.html", "passage_text": "Use resources such as the classified section of the local newspaper to identify and apply for quality assurance manager positions. Try an online service, such as Monster.com, to find relevant positions close to where you live (see Resources below)."}, {"url": "http://learn.org/articles/Quality_Assurance_Management_How_to_Become_a_Quality_Assurance_Manager_in_5_Steps.html", "passage_text": "Quality assurance managers must have a Bachelor of Science in Business, Statistics or Quality Assurance and at least six years of experience in the field."}]