[{"url": "http://www.qld.gov.au/environment/land/soil/erosion/management/", "passage_text": "Surface cover and runoff. Surface cover is a major factor to control erosion because it reduces the impact of raindrops falling on bare soils and wind removing soil particles. It also reduces the speed of water flowing over the land. Erosion risk is significantly reduced when there is more than 30% soil cover. Soil erosion can be avoided by using land within its capability. The land’s position, soil type and slope determine how vulnerable it will be to erosion. It may not be suitable for agriculture, or suitable only for an activity which limits erosion."}, {"url": "http://study.com/academy/lesson/soil-erosion-effects-prevention.html", "passage_text": "Soil erosion occurs when natural forces, such as wind and water, act on the soil. Man can also cause soil erosion by such practices as tilling a farmer's field or the clearing of vegetation. Soil erosion impacts the agricultural industry as well as the natural environment. The effects of soil erosion can be felt both on-site, meaning at the site of soil disruption, or off-site, meaning the location where the eroded soil deposits."}, {"url": "http://www.farminfo.org/property/erosion.htm", "passage_text": "Soil deterioration and low quality of water due to erosion and run off has often become a severe problem around the world. Many times the problems become so severe that the land can no longer be cultivated and is abandoned. The key to minimizing soil erosion and saving the farm lands is the farmer himself. Sheet erosion is caused by raindrops. Sheet erosion is defined as the uniform removal of soil in thin layers from sloping land. This, of course, is nearly impossible; in reality the loose soil merely runs off with the rain."}, {"url": "http://www.farminfo.org/property/erosion.htm", "passage_text": "Water erosion occurs when rain, spring run-off, or floodwater carry soil particles away. This can occur through sheet erosion, where soil materials are removed relatively uniformly, or rill erosion where flowing water creates small channels in the soil, called rills, and larger channels, called gullies. Sheet erosion is caused by raindrops. Sheet erosion is defined as the uniform removal of soil in thin layers from sloping land. This, of course, is nearly impossible; in reality the loose soil merely runs off with the rain."}, {"url": "http://www.farminfo.org/property/erosion.htm", "passage_text": "Soil erosion is a gradual process that occurs when the actions of water, wind, and other factors eat away and wear down the land, causing the soil to deteriorate or disappear completely. The main agents of soil erosion are wind, water, and tillage. Sheet erosion is caused by raindrops. Sheet erosion is defined as the uniform removal of soil in thin layers from sloping land. This, of course, is nearly impossible; in reality the loose soil merely runs off with the rain."}, {"url": "http://study.com/academy/lesson/soil-erosion-effects-prevention.html", "passage_text": "Lesson Summary. Soil erosion is the wearing away of topsoil. It is caused by factors such as water, wind and tillage of farm fields. The effects of soil erosion can be felt on-site, meaning at the site of soil disruption, because soil quality is reduced. The effects can also be felt off-site, meaning the location where the eroded soil deposits. Soil erosion impacts the agricultural industry as well as the natural environment. The effects of soil erosion can be felt both on-site, meaning at the site of soil disruption, or"}, {"url": "http://www.ipm.iastate.edu/ipm/icm/2000/7-24-2000/erosion.html", "passage_text": "Soil erosion is a gradual process that occurs when the impact of water or wind detaches and removes soil particles, causing the soil to deteriorate. Soil deterioration and low water quality due to erosion and surface runoff have become severe problems worldwide. The impact of soil erosion on water quality becomes significant, particularly as soil surface runoff. Sediment production and soil erosion are closely related. Therefore, the most effective way to minimize sediment production is the stabilization of the sediment source by controlling erosion."}, {"url": "https://answers.yahoo.com/question/index?qid=20071011162005AA3x7sU", "passage_text": "Using farming methods such as no-till (seeds are planted without plowing the soil), crop rotation (legumes are alternated with high-nitrogen demand crops), and planting or conserving tree cover near croplands we can reduce the effect of wind and rain erosion of cropland. "}, {"url": "https://en.wikipedia.org/wiki/No-till_farming", "passage_text": "No-till is an agricultural technique which increases the amount of water that infiltrates into the soil and increases organic matter retention and cycling of nutrients in the soil. In many agricultural regions it can reduce or eliminate soil erosion. It increases the amount and variety of life in and on the soil, including disease-causing organisms and disease suppression organisms. The most powerful benefit of no-tillage is improvement in soil biological fertility, making soils more resilient. No-till farming is not equivalent to conservation tillage or strip tillage. Conservation tillage is a group of practices that reduce the amount of tillage needed. No-till and strip tillage are both forms of conservation tillage."}, {"url": "http://www.farminfo.org/property/erosion.htm", "passage_text": "Tillage and planting practices that reduce erosion include contour cultivation and strip-cropping. Contour cultivation is cultivation that follows the contours of a field, producing furrows that run perpendicular or at angles to the slope-line of a field. Sheet erosion is caused by raindrops. Sheet erosion is defined as the uniform removal of soil in thin layers from sloping land. This, of course, is nearly impossible; in reality the loose soil merely runs off with the rain."}]