[{"url": "http://www.cellfina.com/frequently-asked-questions", "passage_text": "Results can be seen in as little as three days after treatment. At three months, 85 percent of patients were satisfied, and after one year, 94 percent were satisfied, surpassing patient satisfaction rates versus other leading cellulite treatments.*. Just three days after treatment, patients rated their pain as minimal (2.7 on a scale of 0 to 10; 0=no pain, 10=extreme pain) and most (82%) felt pain only with touch or pressure to the area treated. This minimal pain improved quickly with time. Over 90% of patients had no bruising at four weeks."}, {"url": "https://clderm.com/cellfina/", "passage_text": "Cellfina is FDA-approved, and has been shown in clinical trials to last for up to a year and even beyond. The Cellfina treatment is quick and painless due to the use of a topical numbing agent before treatment. It takes only around an hour for a board-certified dermatologist to treat 25 dimples. Cellfina. Cellulite is the bane of many women. It is genetically passed down and can’t be treated through simple diet and exercise. No matter your lifestyle or weight, if cellulite runs in your family, you will get it."}, {"url": "http://www.marinaplasticsurgery.com/lasers-and-injectable-procedures/cellulite-vein-therapy-los-angeles/cellfina/", "passage_text": "The Cellfina™ System is the only FDA-cleared minimally invasive procedure clinically proven to improve the appearance of cellulite for up to three years. Cellfina™ combines highly advanced proprietary technology with a well-established procedure approach called “subcision” to treat the structural problems that cause cellulite. This innovative solution is a safe and effective method to treat cellulite with precise and reproducible results, in just one treatment."}, {"url": "http://www.cellfina.com/frequently-asked-questions", "passage_text": "The Cellfina™ System treats the connective bands woven throughout the fat that pull down the skin, creating dimpling seen on the skin’s surface. Just three days after treatment, patients rated their pain as minimal (2.7 on a scale of 0 to 10; 0=no pain, 10=extreme pain) and most (82%) felt pain only with touch or pressure to the area treated. This minimal pain improved quickly with time. Over 90% of patients had no bruising at four weeks."}, {"url": "http://liposuction-sandiego.com/cellfina/", "passage_text": "Cellfina is a revolutionary device which automates the process of subcision using microscopic knives which cut the septae tethering the skin to muscle, which is what causes cellulite dimpling. By snapping these septae, the skin bounces back into position and the dimples are smoothed over. Cellfina is painless due to a topical numbing cream being applied beforehand to the targeted dimples, and the process is fairly short, with 25 dimples taking around an hour to treat."}, {"url": "http://www.mdlsv.com/Lasers/Cellfina", "passage_text": "View Before and Afters Cellfina is a revolutionary new cellulite-smoothing device that has been recently FDA-approved. Cellfina has been clinically proven safe and effective, with the longest lasting results of any cellulite smoothing device currently on the market-up to two years! Read Dr. Robert Weiss's discussion with Allure about Cellfina to learn more about the procedure. There are many cellulite smoothing devices available, but Cellfina is the only FDA-approved device clinically proven to last for up to one year after a single session."}, {"url": "http://skinlasers.com/services/treatments/cellfina-cellulite/", "passage_text": "It has not been studied but improvement in the appearance of cellulite with Cellfina treatments have lasted for over one year and are the result of releasing the fibrotic bands, not changing fat volume so minor weight changes are not likely to not affect results. Please contact Laser & Skin Surgery Center of Northern California at 916.456.0400 for more information and to schedule a consultation. We are located in East Sacramento, minutes from Downtown Sacramento, Roseville, Folsom, Davis and El Dorado Hills."}, {"url": "http://www.cellfina.com/frequently-asked-questions", "passage_text": "Performed by a qualified physician in an office setting, Cellfina combines proven and innovative technologies to treat the primary cause of cellulite on the thighs and buttocks. Just three days after treatment, patients rated their pain as minimal (2.7 on a scale of 0 to 10; 0=no pain, 10=extreme pain) and most (82%) felt pain only with touch or pressure to the area treated. This minimal pain improved quickly with time. Over 90% of patients had no bruising at four weeks."}, {"url": "http://www.marinaplasticsurgery.com/lasers-and-injectable-procedures/cellulite-vein-therapy-los-angeles/cellfina/", "passage_text": "Cellfina is the only FDA-cleared minimally invasive procedure clinically proven to improve the appearance of cellulite up to three years. Performed by a qualified physician in an office setting, Cellfina combines proven and innovative technologies to clear the underlying cause of cellulite on the thighs and buttocks. Cellfina™ combines highly advanced proprietary technology with a well-established procedure approach called “subcision” to treat the structural problems that cause cellulite. This innovative solution is a safe and effective method to treat cellulite with precise and reproducible results, in just one treatment."}, {"url": "http://www.cellulitereduction.net/cellfina/", "passage_text": "Cellfina is an advanced, minimally invasive procedure focused on treating the primary cause of cellulite. The problem of ‘orange peel’ skin is caused by connective bands woven within the fat right underneath your skin. These bands pull the skin down which results in the typical cellulite dimpling look. Cellfina technology targets these connective bands and releases them. The dimpling appearance reduces after just one treatment and the smooth skin should last at least one year. As with any other minimally invasive procedure, Cellfina treatment involves minimum downtime. Performed in an outpatient setting, the patient is not limited at all after the treatment, except for taking it easy for the next 24 hours."}]