[{"url": "http://www.everydayhealth.com/drugs/gabapentin", "passage_text": "Gabapentin Dosage. Gabapentin comes in capsule form, as a regular or extended-release tablet, and as a liquid. A typical adult dose for postherpetic neuralgia usually starts at 300 milligrams (mg), and your doctor may increase the dose to up to 1,800 mg a day. A typical adult dose for epilepsy may range from 900 to 1,800 mg a day"}, {"url": "http://labeling.pfizer.com/ShowLabeling.aspx?id=630", "passage_text": "Oral Bioavailability. Gabapentin bioavailability is not dose proportional; i.e., as dose is increased, bioavailability decreases. Bioavailability of gabapentin is approximately 60%, 47%, 34%, 33%, and 27% following 900, 1200, 2400, 3600, and 4800 mg/day given in 3 divided doses, respectively. The recommended maintenance dose of NEURONTIN is 300 mg to 600 mg three times a day. Dosages up to 2400 mg/day have been well tolerated in long-term clinical studies. Doses of 3600 mg/day have also been administered to a small number of patients for a relatively short duration, and have been well tolerated."}, {"url": "http://www.rxlist.com/neurontin-drug/indications-dosage.htm", "passage_text": "The starting dose is 300 mg three times a day. The effective dose of NEURONTIN is 300 mg to 600 mg three times a day. Dosages up to 2400 mg/day have been well tolerated in long-term clinical studies. Doses of 3600 mg/day have also been administered to a small number of patients for a relatively short duration, and have been well tolerated. NEURONTIN should be administered three times a day using 300 mg or 400 mg capsules, or 600 mg or 800 mg tablets. The maximum time between doses should not exceed 12 hours."}, {"url": "http://www.mayoclinic.org/drugs-supplements/gabapentin-oral-route/proper-use/DRG-20064011", "passage_text": "1 For oral dosage forms (capsules, liquid, and tablets): 2  For epilepsy: 3  Adults and children 12 years of age and older—At first, 300 milligrams (mg) three times per day. 4  Your doctor may adjust your dose as needed. 5  However, the dose is usually not more than 2400 mg per day. 1 For postherpetic neuralgia: 2  Adults— At first, 300 milligrams (mg) as a single dose in the evening. 3  Your doctor may adjust your dose as needed. 4  However, the dose is usually not more than 18"}, {"url": "http://labeling.pfizer.com/ShowLabeling.aspx?id=630", "passage_text": "2.1 Dosage for Postherpetic Neuralgia. In adults with postherpetic neuralgia, NEURONTIN may be initiated on Day 1 as a single 300 mg dose, on Day 2 as 600 mg/day (300 mg two times a day), and on Day 3 as 900 mg/day (300 mg three times a day). The recommended maintenance dose of NEURONTIN is 300 mg to 600 mg three times a day. Dosages up to 2400 mg/day have been well tolerated in long-term clinical studies. Doses of 3600 mg/day have also been administered to a small number of patients for a relatively short duration, and have been well tolerated."}, {"url": "http://www.rxlist.com/neurontin-drug/indications-dosage.htm", "passage_text": "In adults with postherpetic neuralgia, NEURONTIN therapy may be initiated on Day 1 as a single 300 mg dose, on Day 2 as 600 mg/day (300 mg two times a day), and on Day 3 as 900 mg/day (300 mg three times a day). Doses of 3600 mg/day have also been administered to a small number of patients for a relatively short duration, and have been well tolerated. NEURONTIN should be administered three times a day using 300 mg or 400 mg capsules, or 600 mg or 800 mg tablets. The maximum time between doses should not exceed 12 hours."}, {"url": "http://www.mayoclinic.org/drugs-supplements/gabapentin-oral-route/proper-use/DRG-20064011", "passage_text": "For patients with epilepsy who take gabapentin three times per day, do not allow more than 12 hours to pass between any 2 doses. The medicine works best if a constant amount is in the blood. Neurontin® capsules, tablets, and solution may be taken with or without food. 1 For postherpetic neuralgia: 2  Adults— At first, 300 milligrams (mg) as a single dose in the evening. 3  Your doctor may adjust your dose as needed. 4  However, the dose is usually not more than 1800 mg per day."}, {"url": "http://www.mayoclinic.org/drugs-supplements/gabapentin-oral-route/proper-use/DRG-20064011", "passage_text": "1 Adults and children 12 years of age and older—At first, 300 milligrams (mg) three times per day. 2  Your doctor may adjust your dose as needed. 3  However, the dose is usually not more than 2400 mg per day. 4  Children 3 to 11 years of age—Dose is based on body weight and must be determined by your doctor. 1 For postherpetic neuralgia: 2  Adults— At first, 300 milligrams (mg) as a single dose in the evening. 3  Your doctor may adjust your dose as needed. 4  However, the dose is usually not more than 18"}, {"url": "http://www.rxlist.com/neurontin-drug/indications-dosage.htm", "passage_text": "The starting dose range is 10 mg/kg/day to 15 mg/kg/day, given in three divided doses, and the effective dose reached by upward titration over a period of approximately 3 days. The effective dose of NEURONTIN in patients 3 to 4 years of age is 40 mg/kg/day, given in three divided doses. The effective dose of NEURONTIN in patients 5 to 11 years of age is 25 mg/kg/day to 35 mg/kg/day, given in three divided doses. Doses of 3600 mg/day have also been administered to a small number of patients for a relatively short duration, and have been well tolerated. NEURONTIN should be administered three times a day using 300 mg or 400 mg capsules, or 600 mg or 800 mg tablets. The maximum time between doses should not exceed 12 hours."}, {"url": "http://www.drugsdb.com/rx/gabapentin/gabapentin-dosage/", "passage_text": "Treatment of Epilepsy. The recommended initial dosage of Gabapentin (Neurontin) for adults being treated for epilepsy is 300 mg taken once up to three times a day. The usual maintenance dose is 900 mg per day given in 3 divided doses. If necessary, the maintenance dose may be increased up to the maximum daily dose of 1,800 mg, until the condition is under control. Children (aged 3 to 12 years old) should be given individualized dosage of gabapentin based on child’s body weight. The recommended initial dose ranges from 10-15 mg/kg/day given in three divided doses, then titrated until the effective dose is reached"}]