[{"url": "http://www.mathsisfun.com/definitions/dividend.html", "passage_text": "more ... The amount that you want to divide up. dividend ÷ divisor = quotient Example: in 12 ÷ 3 = 4, 12 is the dividend. "}, {"url": "http://www.answers.com/Q/What_is_a_divisor", "passage_text": "Adivisor is the same number as your factor, which is a number that you multiply by. Answer Ignore above answer The divisor is the quantity by which another quantity, called the dividend, is to be divided. eg in 3/4 then 3 is the dividend and 4 the divisor A divisor is a number that can divided by other numbers. "}, {"url": "http://www.thefreedictionary.com/divisor", "passage_text": "divisor. n. 1. (Mathematics) a number or quantity to be divided into another number or quantity (the dividend). 2. (Mathematics) a number that is a factor of another number. 2. divisor-the number by which a dividend is divided. number-a concept of quantity involving zero and units; every number has a unique position in the sequence. denominator-the divisor of a fraction. aliquot, aliquot part-an integer that is an exact divisor of some quantity; 4 is an aliquot part of 12"}, {"url": "http://www.ehow.com/about_5139085_dividend-_amp_-divisor_.html", "passage_text": "Jevtic/iStock/Getty Images. Dividends and divisors are the two key ingredients that yield the quotient, or answer, to a division problem. The dividend is the number being divided, while the divisor is the number by which the dividend is divided. In other words, given a÷b, a is the dividend and b is the divisor. 1  What Is a Dividend in Mathematics? 2  What Is a Quotient & Dividend?"}, {"url": "https://en.wikipedia.org/wiki/Divisor", "passage_text": "For example, there are six divisors of 4; they are 1, 2, 4, −1, −2, and −4, but only the positive ones (1, 2, and 4) would usually be mentioned. 1 and −1 divide (are divisors of) every integer. Every integer (and its negation) is a divisor of itself. Every integer is a divisor of 0. Integers divisible by 2 are called even, and numbers not divisible by 2 are called odd. 1, −1, n and − n are known as the trivial divisors of n. A divisor of n that is not a trivial divisor is known as a non-trivial divisor. A non-zero integer with at least one non-trivial divisor is known as a composite number, while the units −1 and 1 and prime numbers have no non-trivial divisors. 1 7 is a divisor of 42 because, so we can say. 2  It can also be said that 42 is divisible by 7, 42 is a multiple of 7, 7 divides 42, or 7 is a factor of 42. 3  The non-trivial divisors of 6 are 2, −2, 3, −3. 4  The positive divisors of 42 are 1, 2, 3, 6, 7, 14, 21, 42."}, {"url": "https://www.mathsisfun.com/definitions/divisor.html", "passage_text": "Divisor. more ... The number you divide by dividend ÷ divisor = quotient Example: in 12 ÷ 3 = 4, 3 is the divisor Divisor can also mean: a number that divides an integer evenly (no remainder). See: Divisor (of an Integer). Division. Search :: Index :: About :: Contact :: Contribute :: Cite This Page :: Privacy. "}, {"url": "http://www.ehow.com/about_5139085_dividend-_amp_-divisor_.html", "passage_text": "Different Notations. The location of the divisor and the dividend change slightly depending on what division notation is being used. When using the short-hand symbols “÷” or “/” to indicate division, the dividend appears to the left and the divisor appears to the right. Dividends and divisors are the two key ingredients that yield the quotient, or answer, to a division problem. The dividend is the number being divided, while the divisor is the number by which the dividend is divided. In other words, given a÷b, a is the dividend and b is the divisor. 1  What Is a Dividend in Mathematics? 2  What Is a Quotient & Dividend?"}, {"url": "http://web.mnstate.edu/peil/MDEV102/U2/S12/S12_print.html", "passage_text": "{ x: x is a whole number divisor of 24} = {1, 2, 3, 4, 6, 8, 12, 24}. Note that the set of factors is the same when the universe is either the natural numbers or the whole numbers. If we are asked for the set of all factors of a value, we must include all the whole number factors for the set to be the correct answer. "}]