[{"url": "http://www.lafujimama.com/2010/05/sushi-rice-the-secret-behind-delicious-sushi/", "passage_text": "1 It is best to mix the seasoned vinegar with the cooked rice in a sushi-oke or an unvarnished wooden bowl, but you can also use a wide shallow glass or ceramic bowl. 2  I use a wide shallow glass mixing bowl, because that is what I have on hand."}, {"url": "https://en.wikipedia.org/wiki/Calrose_rice", "passage_text": "Calrose (USDA # C.I. 8988) originated and was developed at the Rice Experiment Station near Biggs, California and released to California growers in 1948. It grew in popularity with growers, marketers, and consumers to become the prominent rice variety in California until the late 1970s."}, {"url": "http://www.ehow.com/about_5563025_nutrition-calrose-rice.html", "passage_text": "Types. While Calrose rice is an important part of the California rice industry, it is not the only type of rice available. The commission lists a type of premium medium grain 'new variety'  rice that is listed as the preferred sushi rice. The rice, much like Calrose rice, holds up to being rolled into sushi."}, {"url": "http://www.walmart.com/ip/Botan-Calrose-Rice-5-lb/10451689", "passage_text": "Botan: Calrose Rice comes in a convenient 5-lb bag. Botan Rice is quick and easy to cook. Just add water for a fast snack or an easy side dish. This extra fancy rice is specially selected to ensure the finest quality."}, {"url": "http://www.samsclub.com/sams/diamond-g-calrose-rice-50-lbs/160885.ip", "passage_text": "Description. Diamond G Calrose Rice is a medium grain California variety that is a favorite of the Pacific! With our great taste and extra fancy quality, Diamond G Calrose Rice is perfect for any occassion!"}, {"url": "http://www.ehow.com/about_5563025_nutrition-calrose-rice.html", "passage_text": "Calrose rice is a popular American style of rice that is grown predominately in California. Calrose rice is a type of medium-grain rice that is great in multiple cuisines that utilize rice. According to the California Rice Commission, the Calrose variety of rice is the most recognized variety in the United States."}]