[{"url": "http://scienceline.ucsb.edu/getkey.php?key=4554", "passage_text": "By definition, an atom is electrically neutral (i.e. has the same number of protons as it does electrons, plus some number of neutrons depending on the isotope). If a species were charged, it is referred to as an ion (cation for positively charged and anion for negatively charged species), also by definition."}, {"url": "https://au.answers.yahoo.com/question/index?qid=20091006221716AAU9p1g", "passage_text": "Best Answer: 7 is neutral. Any number above 7, to a maximum of 14, means that the chemical is basic (a base). And any number below 7, to a maximum of 0, means the chemical is acidic (an acid)."}, {"url": "http://www.answers.com/Q/What_are_neutral_numbers", "passage_text": "In a neutral atom the number of electrons is equal to the number of  protons. The opposite charge between protons and electrons is what  allows for a neutral atom."}, {"url": "http://chemistry.stackexchange.com/questions/738/what-is-a-neutral-atom", "passage_text": "Now, in a neutral atom, the number of protons must be equal to the number of electrons, otherwise it would not be neutral. Basically, the definition is saying that in a neutral atom, the atomic number is equal to both the number of protons, and the number of electrons, because, well, they both are the same.. Compare this with an ion."}, {"url": "http://chemistry.stackexchange.com/questions/738/what-is-a-neutral-atom", "passage_text": "A neutral atom is an atom where the charges of the electrons and the protons balance. Luckily, one electron has the same charge (with opposite sign) as a proton. Example: Carbon has 6 protons. The neutral Carbon atom has 6 electrons. The atomic number is 6 since there are"}, {"url": "http://www.answers.com/Q/What_are_neutral_numbers", "passage_text": "Answered by The Community. Making the world better, one answer at a time. Neutral numbers or should I say number is a number that isn't prime nor composite and there is only one number that falls into that category. That number is 1, so 1 would be a neutral number."}, {"url": "http://www.answers.com/Q/What_are_neutral_numbers", "passage_text": "Neutral numbers or should I say number is a number that isn't prime nor composite and there is only one number that falls into that category. That number is 1, so 1 would be a neutral number."}]