[{"url": "http://www.ehow.com/facts_7504111_owns-suddenlink.html", "passage_text": "New Name. In 2006, Cebridge changed its name to Suddenlink. Although still privately owned by Cequel Communications, Suddenlink is the seventh largest cable and media provider in the United States in 2010."}, {"url": "https://en.wikipedia.org/wiki/Suddenlink_Communications", "passage_text": "Suddenlink operates in 17 states including Texas, Louisiana, and Arkansas. With its corporate headquarters in St. Louis, Missouri, Suddenlink is part of Cequel Communications, LLC."}, {"url": "https://en.wikipedia.org/wiki/Suddenlink_Communications", "passage_text": "Suddenlink Communications, formerly Cebridge Connections, is a top-ten cable broadband service provider with approximately 1.4 million subscribers."}, {"url": "http://www.ehow.com/facts_7504111_owns-suddenlink.html", "passage_text": "Origin. Suddenlink is the culmination of many years of growth and acquisition by founder Jerry Kent. In 2002, Kent and his partners formed Cequel III and took control of a small wireless company called AAT Communications. By 2003, Cequel had added cable provider Classic Communications to its holdings."}, {"url": "http://www.ehow.com/facts_7504111_owns-suddenlink.html", "passage_text": "Suddenlink is the culmination of many years of growth and acquisition by founder Jerry Kent. In 2002, Kent and his partners formed Cequel III and took control of a small wireless company called AAT Communications. By 2003, Cequel had added cable provider Classic Communications to its holdings."}, {"url": "http://stopthecap.com/2015/05/20/patrick-drahis-altice-buys-suddenlink-in-surprise-9-1-billion-deal-that-is-likely-bad-news-for-customers-employees/", "passage_text": "The billionaire owner of France’s largest cable operator has acquired St. Louis-based Suddenlink in a surprise $9.1 billion deal, and it is likely only the first move for the Altice Group in the U.S. cable business."}, {"url": "http://www.usatoday.com/story/money/2015/05/20/altice-buys-suddenlink/27636889/", "passage_text": "Suddenlink, which is privately held, is currently owned by private equity firm BC Partners, fund manager CPP Investment Board and Suddenlink's management. They will keep a 30% stake. The deal is expected to close in the fourth quarter. Shares of Altice rose 7.7% in trading at Amsterdam to $124.45."}]