[{"url": "http://definitions.uslegal.com/e/exclusivity-agreement/", "passage_text": "Exclusivity agreement means an agreement between two or more parties to purchase goods exclusively from the specified seller in the agreement. Hence it dictates that seller is the exclusive supplier of such goods to buyer. This agreement generally happens in a vertical buyer/seller relationship where a buyer agrees to buy exclusively from the seller."}, {"url": "http://www.yourdictionary.com/exclusivity", "passage_text": "noun. Exclusivity is defined as a state of being limited or hard to access. 1  An example of exclusivity is when a club only lets in people who are extremely wealthy and powerful. 2  An example of exclusivity is when there is only one company which is licensed to make action figures of a popular character. 1 An example of exclusivity is when a club only lets in people who are extremely wealthy and powerful."}, {"url": "http://www.learnersdictionary.com/definition/exclusivity", "passage_text": "Save. exclusivity /ˌɛkˌskluːˈsɪvəti/ noun. exclusivity. /ˌɛkˌskluːˈsɪvəti/. noun. Learner's definition of EXCLUSIVITY. [noncount]. : the quality or state of being exclusive: the quality of being limited to people of wealth or high social class. The private school's exclusivity [= exclusiveness ] was part of its appeal for many parents. a symbol of wealth and exclusivity. [+] more examples [-] hide examples [+] Example sentences [-] Hide examples"}, {"url": "http://www.definitions.net/definition/exclusive", "passage_text": "Wiktionary (5.00 / 2 votes) Rate this definition: exclusive (Noun). Information (or an artefact) that is granted or obtained exclusively. The editor agreed to keep a lid on a potentially distastrous political scoop in exchange for an exclusive of a happier nature. exclusive (Adjective). "}, {"url": "http://definitions.uslegal.com/e/exclusivity-agreement/", "passage_text": "The prime ingredient of an exclusivity agreement is the understanding that the buyer will not obtain or solicit the goods provided by seller from anybody else for the time period of the agreement. Hence it dictates that seller is the exclusive supplier of such goods to buyer. This agreement generally happens in a vertical buyer/seller relationship where a buyer agrees to buy exclusively from the seller."}, {"url": "http://www.merriam-webster.com/dictionary/exclusivity", "passage_text": "Full Definition of EXCLUSIVITY. 1. : the quality or state of being exclusive. 2. : exclusive rights or services. "}, {"url": "http://dictionary.cambridge.org/dictionary/english/exclusive", "passage_text": "› A ​place that is exclusive ​provides ​goods and ​services for a ​limited ​number of ​people, esp. those who are wealthy: an exclusive ​club. (Definition of exclusive from the Cambridge Academic Content Dictionary © Cambridge University Press). C1 ​limited to only one ​person or ​group of ​people: This ​room is for the exclusive use of ​guests. an exclusive ​interview B2 ​expensive and only for ​people who are ​rich or of a high ​social ​class: an exclusive ​private ​club an exclusive ​part of ​town. More examples."}, {"url": "http://www.merriam-webster.com/dictionary/exclusive", "passage_text": "Full Definition of EXCLUSIVE. 1. a: excluding or having power to exclude b: limiting or limited to possession, control, or use by a single individual or group. 2. a: excluding others from participation b: snobbishly aloof. 3. "}]