[{"url": "http://www.independenttraveler.com/travel-tips/travelers-ed/first-class-for-free-how-to-get-an-airline-upgrade", "passage_text": "1 Therefore, on a full flight the airlines sometimes are forced to upgrade people. 2  In this scenario, if you have a good story, you may be lucky. 3  Remember, of course, that business or first class may already be full from prebooked elite-level upgrades."}, {"url": "http://www.businessinsider.com/business-travel-on-a-budget-how-to-score-a-free-upgrade-to-business-class-2010-4", "passage_text": "Note: This article was originally published on OPEN Forum. When your business is on a budget, booking business-class airline tickets is most likely not an option. But there's one way to enjoy all those perks without shelling out: by scoring a complimentary upgrade."}, {"url": "http://www.ausbt.com.au/how-to-get-a-free-upgrade-to-business-class-or-even-first-class", "passage_text": "But instead of an economy seat this one is for business class or, even better on an international flight, first class. Yes, you’ve been upgraded. More precisely, and in airline argot, you’ve received an on-the-spot operational upgrade or ‘op-up’ for short."}, {"url": "https://www.americanexpress.com/us/small-business/openforum/articles/how-to-score-a-free-upgrade-to-business-class-antonina-jedrzejczak/", "passage_text": "If economy class has been overbooked and there are seats in business, make sure you’re quick to offer (this helps when you’re sitting in the first couple of rows). You might also get an upgrade if there is a problem with your seat or your neighboring passenger. 6."}, {"url": "http://www.theglobeandmail.com/globe-investor/personal-finance/household-finances/how-to-get-a-flight-upgrade-to-first-class---hopefully-for-free/article4096039/", "passage_text": "Getting a free upgrade from economy to business class may not be a cake walk, but if you want to experience life at the front of the plane, you need to know what’s myth and what’s going to get you a champagne flute and those comfy slippers."}, {"url": "https://www.americanexpress.com/us/small-business/openforum/articles/how-to-score-a-free-upgrade-to-business-class-antonina-jedrzejczak/", "passage_text": "The more seats, the better the chance of successfully using all the tricks above. 9. Look like you should get an upgrade. To fly business, you need to look business. If you’re wearing jeans, sneakers, or a sweatsuit, the flight attendants are not likely to see you as someone that really should be in business class. Make sure you dress the part."}, {"url": "http://www.ausbt.com.au/how-to-get-a-free-upgrade-to-business-class-or-even-first-class", "passage_text": "So if you want to plan for snaring an upgrade, ensure your chosen airline is upgrade-friendly and work your way to top-tier status in its frequent flyer program. The higher you are in the frequent flyer food chain the better your chance of a bump into business class or even first class."}]