[{"url": "http://www.names.org/n/tanya/about", "passage_text": "The name Tanya is of Russian origin, and it means Fairy Queen . It's a name commonly given to girls. Tanya Roberts is an actress and producer with the most prominent portion of her career being from 1975 to 2006. "}, {"url": "https://en.wikipedia.org/wiki/Tanya_(name)", "passage_text": "Tanya is the Russian hypocoristic of Tatiana. It is now quite commonly used as an independent given name in the English-speaking world. Its popularity grew in many respects thanks to Pushkin 's poem Eugene Onegin whose main character was Tatiana Larina, beloved by Onegin. "}, {"url": "http://www.meaning-of-names.com/slovakian-names/tanya.asp", "passage_text": "Meaning of Tanya. Slovakian name. In Slovakian, the name Tanya means-fairy queen.The name Tanya originated as an Slovakian name. The name Tanya is most often used as a girl name or female name. Slovakian Name Meaning-fairy queen. Origin-Slovaki"}, {"url": "http://www.babynamewizard.com/baby-name/girl/tanya", "passage_text": "An experience from another Tanya: My name is pronounced Tawnya, but spelled Tanya-- and I've always had the opposite issues of course, being pronounced TAN-ya instead, and having to correct for it. I do believe that Tawnya or Tawnia is a better spelling to get the ah sound instead of the tan.... "}, {"url": "http://www.babynamespedia.com/meaning/Tanya", "passage_text": "Tanya-Meaning of Tanya. Tweet. The origin and thus the meaning of Tanya is inherited by all variant forms. See also the related forms, Tanika (English) and Tanisha (Hausa and English). Tanya is of Latin origin, and it is used largely in the English and Russian languages. The name was first adopted by English speakers in the early 20th century."}, {"url": "http://www.ohbabynames.com/meaning/name/tanya/1176", "passage_text": "Etymology & Historical Origin-Tanya. Tanya is the Russian diminutive of Tatiana, which itself is a name of early Christian-Russian origin inspired by a 3rd century saint who was martyred in Rome for her Christian beliefs under the pagan Emperor Alexander Severus. "}, {"url": "http://www.sheknows.com/baby-names/name/tanya", "passage_text": "Russian Meaning: The name Tanya is a Russian baby name. In Russian the meaning of the name Tanya is: Name in honour of an early Christian martyr. American Meaning: The name Tanya is an American baby name. In American the meaning of the name Tanya is: Name in honour of an early Christian martyr."}, {"url": "http://www.babynology.com/meaning-tanya-f59.html", "passage_text": "Tanya is of Latin origin,which is probably derived from the Latin Tatianus or Tatius, a family name of unknown definition; and it is used largely in the English and Russian languages. Tanya is a pet form of Tatiana (German, Russian, and Slavic). Tanya is a diminutive form of Russian name Tatiana. "}, {"url": "http://www.babynamespedia.com/meaning/Tanya", "passage_text": "[ 2 syll. ta-nya, tan-ya ] The baby girl name Tanya is pronounced T AA N-Yah or T AE N-Yah (English) †. Tanya is of Latin origin, and it is used largely in the English and Russian languages. The name was first adopted by English speakers in the early 20th century."}, {"url": "http://www.thinkbabynames.com/meaning/0/Tonya", "passage_text": "Tonya /to-nya/ [3 sylls.] as a girls' name is pronounced TAHN-yah. It is of Russian origin, and the meaning of Tonya is praiseworthy. Short form of Antonina. See also Tanya and Tawny. "}]