[{"url": "http://www.healthguidance.org/entry/14976/1/What-Is-Magnesium-Sulfate-Used-For.html", "passage_text": "By Elizabeth Danish | Medicine | Rating: Magnesium sulfate is also commonly referred to as Epsom salt. This name was derived from the town of Epsom, which is where the salt was originally distilled. There are numerous common uses for the salt and many people find that it is therapeutic. Medical Uses for Magnesium Sulfate. As a bath salt magnesium sulfate is often used to help reduce the appearance of skin pruning, soothing the pain of sore feet, and as a method of reducing inflammation often through soaking the compound in through the skin."}, {"url": "http://www.aluminumsulfate.net/Ammonium-Sulfate.html", "passage_text": "The chemical compound ammonium sulfate is primarily used in fertilizers but is important in other industries as well. While it isn’t considered highly hazardous to humans, there are some important precautions to take if you’re using it. Chemical Properties. "}, {"url": "http://www.everydayhealth.com/drugs/magnesium-sulfate", "passage_text": "Magnesium sulfate, commonly known as Epsom salt, is a mineral. It works by replacing magnesium in the body and increasing water in the intestines. Magnesium sulfate can be used orally as a laxative to relieve occasional constipation, and to treat low levels of magnesium. Known as hypomagnesemia, low magnesium levels can be caused by alcoholism, severe diarrhea, malnutrition, or high calcium levels (hypercalcemia). Follow the directions given to you by your health care provider. Don't use magnesium sulfate if it contains particles or is cloudy or discolored. Magnesium Sulfate as a Soak: You can also use magnesium sulfate as an Epsom salt soak. Dissolve into a large amount of water in a large bowl, bucket, foot tub, or bath tub."}, {"url": "http://www.webmd.com/vitamins-supplements/ingredientmono-807-GLUCOSAMINE%20SULFATE.aspx?activeIngredientId=807&activeIngredientName=GLUCOSAMINE%20SULFATE", "passage_text": "Some researchers think the “sulfate” part of glucosamine sulfate is also important. Sulfate is needed by the body to produce cartilage. This is one reason why researchers believe that glucosamine sulfate might work better than other forms of glucosamine such as glucosamine hydrochloride or N-acetyl glucosamine.t is in the fluid that is around joints. Glucosamine is also found in other places in nature. For example, the glucosamine sulfate that is put into dietary supplements is often harvested from the shells of shellfish. Glucosamine sulfate used in dietary supplements does not always come from natural sources."}, {"url": "http://www.emedicinehealth.com/drug-magnesium_sulfate/article_em.htm", "passage_text": "Magnesium sulfate also increases water in the intestines. Magnesium sulfate is used as a laxative to relieve occasional constipation. Not all external uses for magnesium sulfate have been approved by the FDA. Epsom salt should not be used in place of medication prescribed for you by your doctor. "}, {"url": "http://www.ehow.com/about_5457669_sulfate.html", "passage_text": "Common Uses. Sulfate salts have diverse applications. Magnesium sulfate, or Epsom salt, is used for therapeutic baths; gypsum--the mineral form of hydrated calcium sulfate--produces plaster; and sulfate ions are used in some cationic drugs, according to New World Encyclopedia. Facts. Sulfate is an inorganic salt of sulfuric acid. The ion sulfate is a polyatomic anion with the empirical formula SO4. Many sulfate salts are highly soluble in water. Sulfates increase the acidity of the atmosphere, creating acid rain."}, {"url": "https://en.wikipedia.org/wiki/Sulfate", "passage_text": "The sulfate or sulphate (see spelling differences) ion is a polyatomic anion with the empirical formula SO 4 2− . Sulfate is the spelling recommended by IUPAC, but sulphate is used in British English. Salts, acid derivatives, and peroxides of sulfate are widely used in industry. Sulfates occur widely in everyday life. Sulfates are salts of sulfuric acid and many are prepared from that acid. The sulfate ion carries a negative two charge and is the conjugate base of the bisulfate (or hydrogen sulfate) ion, HSO 4 − , which is the conjugate base of H 2SO 4, sulfuric acid. Organic sulfate esters, such as dimethyl sulfate, are covalent compounds and esters of"}, {"url": "http://www.webmd.com/vitamins-supplements/ingredientmono-807-GLUCOSAMINE%20SULFATE.aspx?activeIngredientId=807&activeIngredientName=GLUCOSAMINE%20SULFATE", "passage_text": "Glucosamine sulfate is a chemical found in the human body. It is used by the body to produce a variety of other chemicals that are involved in building tendons, ligaments, cartilage, and the thick fluid that surrounds joints. Joints are cushioned by the fluid and cartilage that surround them. It is in the fluid that is around joints. Glucosamine is also found in other places in nature. For example, the glucosamine sulfate that is put into dietary supplements is often harvested from the shells of shellfish. Glucosamine sulfate used in dietary supplements does not always come from natural sources. It can also be made in a laboratory"}, {"url": "http://www.ehow.com/about_5457669_sulfate.html", "passage_text": "If you are not used to drinking water that is high in sulfates, there are no serious health risks. Sulfate salts, however, are used for a variety of purposes--from reducing greenhouse gases to leaving a bad taste in drinking water. Facts. Sulfate is an inorganic salt of sulfuric acid. The ion sulfate is a polyatomic anion with the empirical formula SO4. Many sulfate salts are highly soluble in water. Sulfates increase the acidity of the atmosphere, creating acid rain."}]