[{"url": "http://www.zdnet.com/article/microsoft-goes-public-with-retail-pricing-for-windows-10-home-pro/", "passage_text": "The estimated retail pricing (ERP) for Windows 10 Home and Windows 10 Pro will match the ERP for the comparable Windows 8.1 versions, Microsoft officials said on June 1. In a statement issued to Neowin, Microsoft officials said Windows 10 Home will be priced at $119 and Windows 10 Pro will cost $199. Microsoft also plans to charge $99 for the upgrade version of Windows 10 that will allow users to move from Home to Pro, according to the statement Microsoft provided Neowin."}, {"url": "http://www.howtogeek.com/222458/should-you-upgrade-to-the-professional-edition-of-windows-10/", "passage_text": "From within Windows 10 itself, you have the option of paying Microsoft another $99. If you do, your Windows 10 Home system will be upgraded to a Windows 10 Professional system with no Windows reinstall required. Microsoft called the base edition of Windows 8 “Windows 8” and the Professional version “Windows 8 Professional.” With Windows 10, they’re back to “Windows 10 Home” and “Windows 10 Professional,” which is certainly clearer. Microsoft is no longer offering Windows Media Center as a paid upgrade — that’s discontinued."}, {"url": "http://www.techrepublic.com/article/how-much-will-windows-10-really-cost/", "passage_text": "The Windows 10 Pro Pack. Microsoft has released statements to various technology media sites, such as CNET, confirming the existence of an upgrade package called the Windows 10 Pro Pack that will allow you to move up from the Windows 10 Home edition to Pro edition. The Windows 10 Pro Pack will cost $99 (USD). While that might not sound like a lot, when compared to FREE, it seems kind of unfair. I understand that I'm getting a like-to-like edition upgrade, but I was hoping for some kind of break. After all, I've been a loyal Microsoft customer for years. If you get a free Windows 10 Home upgrade, will you be satisfied—or will you want to move up to Windows 10 Pro? If so, would you be willing to pay $39 for the upgrade? If you don't qualify for the free upgrade, would you be willing to pay $69 for Windows 10? Let us know in the discussion thread below."}, {"url": "http://winsupersite.com/windows-10/how-upgrade-windows-10-home-windows-10-pro", "passage_text": "With Windows 10 Microsoft is introducing the Windows 10 Pro Pack. The Pro Pack enables you to upgrade a Windows 10 Home system to Windows 10 Pro to take advantage of the increased features. Available as a retail purchase online or in stores, the Windows 10 Pro Pack will cost $99.99. "}, {"url": "http://winsupersite.com/windows-10/how-easily-upgrade-windows-10-home-windows-10-pro", "passage_text": "Advertisement. If you're waking up to a Windows 10 Home edition every morning since your upgrade and wondering if there might be something more, Microsoft makes it pretty easy to upgrade Windows 10 Home edition to Windows 10 Pro. Of course, this comes at a cost. It's not free like the Windows 10 upgrade. The Windows 10 Pro Pack is $99.99, but offers the following differences…. If you're strictly a home user, most of these additional features won't matter. However, if you'd like to do things like connect your own Windows 10 computer to your company's network or access your PC remotely, the cost might be worth it."}, {"url": "http://www.cnet.com/news/microsoft-prices-single-windows-10-licenses-at-119-for-home-199-for-pro/#!", "passage_text": "tumblr. A copy of Windows 10 Home will run $119, while Windows 10 Pro will cost $199. For those who wish to upgrade from the Home edition to the Pro edition, a Windows 10 Pro Pack will cost $99. You can now reserve your free copy of Windows 10, if you meet the necessary requirements. Screenshot by Lance Whitney/CNET. That means if you had Windows 7 Home, you get Windows 10 Home. If you had Windows 8.1 Pro, you get Windows 10 Pro. See here for more details. For more information on how to check your upgrade eligibility and reserve your upgrade for the July 29 rollout, check out CNET's guide."}, {"url": "http://www.techtimes.com/articles/57862/20150605/windows-10-pricing-heres-how-much-it-will-cost-if-you-cant-upgrade-for-free.htm", "passage_text": "Microsoft has released its official operating system prices and confirmed that Windows 10 Pro would sell at $199 and Windows 10 Home would cost $119. After running the system and the user needs to upgrade from the Home edition to the Pro edition, customers will be shelling out $99 to upgrade to Windows 10 Pro Pack. All copies of the operating system will be available in retail stores and online. That means if you have Windows 7 Home, you would receive a Windows 10 Home upgrade, while if you're a Windows 8.1 Pro user, you'd get Windows 10 Pro. Microsoft has released instructions for Windows 7 and Windows 8 users to reserve an upgrade from a notification icon in their task bar."}, {"url": "http://www.zdnet.com/article/microsoft-goes-public-with-retail-pricing-for-windows-10-home-pro/", "passage_text": "These prices will be for U.S. users in stores and online. (Note: To be precise, the Windows 8.1 ERP pricing is $119.99 for Home, $199.99 for Pro and $99.99 for the upgrade from Home to Pro.). Over the weekend, online retailer Newegg.com published what it claimed to be OEM pricing for Windows 10. Newegg said Windows 10 Home for OEMs/system builders would cost $109.99, and Windows 10 Pro, $149.99. Newegg also said on its site that Windows 10 for OEMs will be available on August 31, 2015. Microsoft also plans to charge $99 for the upgrade version of Windows 10 that will allow users to move from Home to Pro, according to the statement Microsoft provided Neowin."}]