[{"url": "https://en.wikipedia.org/wiki/CARE_(relief_agency)", "passage_text": "CARE (Cooperative for Assistance and Relief Everywhere) is a major international humanitarian agency delivering emergency relief and long-term international development projects. Founded in 1945, CARE is nonsectarian, impartial, and non-governmental. In 1993 CARE, to reflect its international organizational structure, changed the meaning of its acronym for a third time, adopting its current name the Cooperative for Assistance and Relief Everywhere. CARE also marked its 50th anniversary in 1994."}, {"url": "http://www.docareintl.org/", "passage_text": "DOCARE International is a medical outreach organization dedicated to providing much-needed healthcare to indigent and isolated people in remote areas around the world. Our membership is comprised primarily of physicians, and includes healthcare professionals from a wide range of backgrounds, disciplines, and locations. "}, {"url": "https://en.wikipedia.org/wiki/International_health", "passage_text": "International health, also called geographic medicine or global health, is a field of health care, usually with a public health emphasis, dealing with health across regional or national boundaries. One subset of international medicine, travel medicine, prepares travelers with immunizations, prophylactic medications, preventive techniques such as bednets and residual pesticides, in-transit care, and post-travel care for exotic illnesses."}, {"url": "https://en.wikipedia.org/wiki/International_health", "passage_text": "International health, however, more often refers to health personnel or organizations from one area or nation providing direct health care, or health sector development, in another area or nation. It is this sense of the term that is explained here. One subset of international medicine, travel medicine, prepares travelers with immunizations, prophylactic medications, preventive techniques such as bednets and residual pesticides, in-transit care, and post-travel care for exotic illnesses."}, {"url": "http://www.icareinternational.org/", "passage_text": "I CARE International. I Care International, Inc. is a non-religious, non-political, non-discriminatory organization. Volunteers and people in need from all walks of life are welcome. I Care's goal is to help others improve their quality of life by providing the gift of better vision and health. You can help I Care International, just click the Donate button in the top right corner to support."}, {"url": "https://en.wikipedia.org/wiki/CARE_(relief_agency)", "passage_text": "CARE International is a confederation of fourteen CARE National Members, coordinated by the CARE International Secretariat. The Secretariat is based in Geneva, Switzerland, with offices in New York and in Brussels in order to liaise with the United Nations and the European institutions respectively. In 1993 CARE, to reflect its international organizational structure, changed the meaning of its acronym for a third time, adopting its current name the Cooperative for Assistance and Relief Everywhere. CARE also marked its 50th anniversary in 1994."}]