[{"url": "http://dinersjournal.blogs.nytimes.com/2008/05/29/recipe-of-the-day-raita/", "passage_text": "1 Garnish with 2 tablespoons chopped fresh cilantro. 2  Mixed Vegetable Raita: Add to mixture 1 cup diced crunchy vegetables, like bell peppers, celery, radish, fennel or a combination. 3  Season to taste with freshly ground black pepper and garnish with 2 tablespoons chopped fresh cilantro. 1 Tomato Raita: Omit crushed red pepper flakes. 2  To mixture, add 1 large tomato, cored, seeded and diced; 1 onion, peeled and diced; and 1 jalapeo or other hot green chili, stemmed, seeded and minced. 3 "}, {"url": "http://dictionary.cambridge.org/us/pronunciation/english/raita", "passage_text": "/ˈraɪ.tə/. How to pronounce raita in American English. (English pronunciations of raita from the Cambridge Advanced Learners Dictionary & Thesaurus and from the Cambridge Academic Content Dictionary, both sources © Cambridge University Press). How many is a billion? The answer may seem obvious, but the use of this word can lead to confusion. In the UK and Ireland the word traditionally meant the number 1,000,000,000,000 (a million millions), which is called a trillion in the United States."}, {"url": "http://indianfood.about.com/od/sidesandsalads/tp/raitarecipes.htm", "passage_text": "Raita is the most commonly used Indian word for savory yogurt-based side dishes. Raitas are made by combining yogurt all kinds of grated, pureed and chopped vegetables. Ingredients other than vegetables-like Boondi (made from gram flour) or chutneys-can also be used to make Raita. Avocado Raita is the Indian version of guacamole and tastes yummy with just about anything you serve it with. Turn up the heat by adding more red chilli powder and chopped green chillies!"}, {"url": "http://dinersjournal.blogs.nytimes.com/2008/05/29/recipe-of-the-day-raita/", "passage_text": "1 Cucumber-Mint Raita: To basic raita mixture, add 1 large cucumber, peeled, seeded and diced, and cup chopped fresh mint. 2  Tomato Raita: Omit crushed red pepper flakes. 3  To mixture, add 1 large tomato, cored, seeded and diced; 1 onion, peeled and diced; and 1 jalapeo or other hot green chili, stemmed, seeded and minced. 1 Tomato Raita: Omit crushed red pepper flakes. 2  To mixture, add 1 large tomato, cored, seeded and diced; 1 onion, peeled and diced; and 1 jalapeo or other hot green chili, stemmed, seeded and minced. 3  Garnish with 2 tablespoons chopped fresh cilantro."}, {"url": "http://indianfood.about.com/video/How-to-Make-a-Yogurt-Raita.htm", "passage_text": "Yogurt Raita is a side dish which is usually served in South India. This video will show you how easy it is so you can make it at home. Show transcript Hide transcript. "}, {"url": "http://www.merriam-webster.com/dictionary/raita", "passage_text": "Definition of RAITA. : an Indian side dish made of yogurt, usually diced cucumber, and seasonings. ADVERTISEMENT. "}, {"url": "http://www.youtube.com/watch?v=jmzDxcLe1ZQ", "passage_text": "Learn how to say words in English correctly with Emma Saying free pronunciation tutorials. Over 140,000 words were already uploaded... Check them out! Visit my homepage: http://www.emmasaying.com ~. Care to show your support? "}, {"url": "http://www.thekitchn.com/indian-recipe-basic-raita-165453", "passage_text": "Indian Recipe: Basic Raita. Pin it Raita is a mixture of yogurt, vegetables, and often fresh herbs (sometimes a little fruit makes its way in here too) that's served alongside spicy curries across India. It is the ultimate cooling agent when your mouth starts to burn with heat from chilies. Search. Pin it Raita is a mixture of yogurt, vegetables, and often fresh herbs (sometimes a little fruit makes its way in here too) that's served alongside spicy curries across India."}, {"url": "http://www.embedplus.com/dictionary/how-to-pronounce-raita-and-use-it", "passage_text": "Welcome raita learner! how to pronounce book | how to pronounce february | how to pronounce interesting | how to pronounce nevada | how to pronounce salmon | how to pronounce word | how to pronounce android | how to pronounce house | how to pronounce management | how to pronounce advertisement. Raita is a multisyllabic word / phrase. Its diphthong might add complexity when learning its pronunciation and usage. We are building a video-based pronunciation dictionary and usage API to help you learn how to pronounce and use raita, along with tens of thousands of other English words and phrases. Our service extends existing pronunciation dictionaries by adding visual and situational context"}]