[{"url": "http://www.kci.org/meth_info/msg_board_posts/010106/smell%20of%20smoking%20meth.htm", "passage_text": "It depends, Meth that is very close to the chemical formula, or meth that is close to purity doesn't have an odor. Impurities, adulterants, and other elements can have an odor. there is a wide variety of pollutants ranging from a smell similar to Finger nail polish remover (acetone) to rotten eggs. (methamphetamine sulphate). There are other varieties also, cat urine or ammonia is also one of them."}, {"url": "https://en.wikipedia.org/wiki/Methane", "passage_text": "Methane (/ˈmɛθeɪn/ or /ˈmiːθeɪn/) is a chemical compound with the chemical formula CH4 (one atom of carbon and four atoms of hydrogen). "}, {"url": "http://methlabhomes.com/what-does-a-meth-lab-smell-like/", "passage_text": "Meth labs can smell like cat urine, rotten eggs, sewer gas, ether, wet diapers, paint thinners, paint removers, adhesives, cleaning fluids, vinegar, pickled foods, cattle feed lots, and fertilizers. Meth labs can smell like a hospital due to the common use of ethyl ether as an anesthetic. If it’s a meth lab, it needs to be shut down asap! You might also want to contact the health and/or fire department and tell them that you’ve been getting sick from fumes that smell like paint thinner in your apartment building. Ask them if they can come to your apartment and do an air quality check."}, {"url": "http://www.answers.com/Q/What_does_methane_gas_smell_of", "passage_text": "Pure methane when burned produces carbon dioxide, carbon monoxide, and water, all of which are odorless. However the methane available is not pure b … ut has odorants added (e.g. methyl mercaptan) which give it a sulfur like smell and may in some cases pass that smell to the products of combustion. "}, {"url": "https://answers.yahoo.com/question/index?qid=20090319205531AA4RuZV", "passage_text": "Generally the smell you have smelled of 'poop' or other 'gas' smells is due to an additive such as methanethiol, which is added to gases such as propane and methane in order to alert people when there is a leak. I am not looking for poop or whatever, I am talking about methane that is natural. Source(s): methane smell like: https://tr.im/Mxug2."}, {"url": "https://www.dhs.wisconsin.gov/chemical/methane.htm", "passage_text": "Methane. Methane is an odorless, colorless flammable gas. It is used primarily as fuel to make heat and light. It is also used to manufacture organic chemicals. Methane can be formed by the decay of natural materials and is common in landfills, marshes, septic systems and sewers. Methane can form an EXPLOSIVE mixture in air at levels as low as 5 percent. You can smell leaking methane only when commercial gas utility companies add a chemical smell to it or when it mixes naturally with hydrogen sulfide, causing a rotten egg smell. If you can smell it, the level may be too high to be safe. Methane can also be found in coal ga"}, {"url": "http://www.mudomaha.com/blog/why-does-natural-gas-smell-rotten-eggs-2", "passage_text": "Natural gas is an efficient, safe, colorless and odorless gas. For easy detection, we add a harmless chemical called mercaptan to give gas a distinctive odor. Most people describe the smell as rotten eggs or hydrogen sulfide like odor. It smells bad for a good reason-in case of a gas leak! If you smell natural gas, leave the house. "}, {"url": "https://answers.yahoo.com/question/index?qid=20121023091628AAK4Ig0", "passage_text": "Rating Newest Oldest. Best Answer: Sewage won't smell like rotten eggs, it has its own distinct odor. You may have a natural gas leak, which without the sulphur dioxide (smells like rotten eggs) additive has no odor. Call the utility company or local municipality for someone to come and check for a possible natural gas leak. "}]