[{"url": "http://www.wisegeek.org/what-is-cornstarch.htm", "passage_text": "Cornstarch is starch that is ground from the white endosperm at the heart of a kernel of corn. It's used as a thickening agent in cooking, a health-conscious alternative to talc, and the main ingredient in a biodegradable plastic. Powdered sugar also includes a small amount so that it does not clump."}, {"url": "http://www.missvickie.com/howto/cooking101/cornstarch.htm", "passage_text": "Although flour is the traditional thickening agent in most cooking, cornstarch, a lso known as cornflour, i s a fine, powdery flour ground from the endosperm, or white heart, of the corn kernel. People often wonder what the difference is between cornstarch and flour."}, {"url": "https://en.wikipedia.org/wiki/Corn_starch", "passage_text": "Corn starch is a popular food ingredient used in thickening sauces or soups, and is used in making corn syrup and other sugars."}, {"url": "http://foodreference.about.com/od/Food-Additives/a/What-Is-Corn-Starch.htm", "passage_text": "In the kitchen, corn starch is most often used as a thickening agent for sauces, gravies, glazes, soups, casseroles, pies, and other desserts. Because corn starch is made from corn and only contains carbohydrates (no protein), it is a gluten free product. For this reason, corn starch is an excellent gluten free alternative to flour thickeners in recipes."}, {"url": "https://en.wikipedia.org/wiki/Corn_starch", "passage_text": "Corn starch, cornstarch, cornflour or maize starch or maize is the starch derived from the corn (maize) grain. The starch is obtained from the endosperm of the corn kernel."}, {"url": "http://healthyeating.sfgate.com/cornstarch-2243.html", "passage_text": "Cornstarch is made from corn kernels. Cornstarch is a smooth, white powder with many uses, ranging from a common cooking and baking ingredient to an alternative for talc. This versatile product is made from the kernel of the corn plant, specifically the starchy part known as the endosperm."}, {"url": "http://foodreference.about.com/od/Food-Additives/a/What-Is-Corn-Starch.htm", "passage_text": "Corn starch can also be used to coat fruit in pies, tarts, and other deserts before baking. The thin layer of corn starch mixes with the fruit juices and then thickens as it bakes. This prevents pies and other desserts from having a watery or runny texture. Corn starch is also used as an anti-caking agent. Shredded cheese is often coated with a thin dusting of corn starch to prevent it from clumping in the package. The corn starch will also help absorb moisture from condensation and prevent a slimy texture from developing."}]