[{"url": "https://www.healthtap.com/topics/what-does-basic-metabolic-panel-include", "passage_text": "Basic Metabolic Panel (Definition). The basic metabolic panel (bmp) is a panel of blood tests that serves as an initial broad medical screening tool. The bmp provides a rough check of kidney function and electrolyte and fluid balance. The bmp is an smaller version of the comprehensive metabolic panel (cmp), which also includes liver tests."}, {"url": "http://www.urmc.rochester.edu/encyclopedia/content.aspx?ContentTypeID=167&ContentID=basic_metabolic_panel_blood", "passage_text": "A basic metabolic panel test measures the levels of eight important things in your blood: Calcium. Calcium plays a role in keeping your cells working the way they should. It also helps blood clot normally. Carbon dioxide. This can be a measure of how well your kidneys and lungs are working. Chloride."}, {"url": "https://www.healthtap.com/topics/what-does-basic-metabolic-panel-include", "passage_text": "A panel of lab tests: The basic metabolic panel (bmp) is a panel of blood tests that serves as an initial broad medical screening tool. The bmp provides a rough check of kidney function and electrolyte and fluid balance. The bmp is an smaller version of the comprehensive metabolic panel (cmp), which also includes liver tests."}, {"url": "https://labtestsonline.org/understanding/analytes/bmp/tab/test", "passage_text": "The basic metabolic panel (BMP) is used to check the status of a person's kidneys and their electrolyte and acid/base balance, as well as their blood glucose level."}, {"url": "http://www.webmd.com/a-to-z-guides/basic-metabolic-panel-topic-overview", "passage_text": "Topic Overview. A basic metabolic panel is a blood test that measures your sugar (glucose) level, electrolyte and fluid balance, and kidney function. Glucose is a type of sugar your body uses for energy. Electrolytes keep your body's fluids in balance."}, {"url": "http://requestatest.com/basic-metabolic-panel-testing", "passage_text": "A Basic Metabolic Panel (BMP) is a common screening that is often conducted as part of general health testing. This panel provides information about kidney function, electrolyte and fluid balance, and blood sugar levels. The BMP includes most of the same components as a Renal Function Panel."}]