[{"url": "http://www.findaspider.org.au/info/spiderfood.htm", "passage_text": "Their usual food is insects and other spiders but some of the larger species have been seen to eat other small animals such as millipedes, wood lice (slaters), and even small lizards, frogs, and birds. But one kind of food that spiders normally do not eat is plant material. The reason for this is that they have to liquify their food before they can ingest it and are no more able to digest the cellulose of plants than we are."}, {"url": "http://www.findaspider.org.au/info/silk.htm", "passage_text": "Spider silk is primarily composed of a class of proteins collectively known as fibroin. This type of protein has much in common with fibrous proteins found in the human body, including the collagen of tendons and skin and the elastin of artery walls. Spiderlings also use dragline silk as a means of migrating relatively large distances in a short period of time. The tiny spiders secrete an unattached strand of silk then allow the wind to make them airborne with the strand of silk trailing behind them and acting like a kind of hang glider."}, {"url": "http://www.findaspider.org.au/info/silk.htm", "passage_text": "This page summarizes the known facts about the silk spun by spiders. It is now clear that the amino acid sequence in the fibroin molecule is far from random but is different not only from species to species but also from silk gland to silk gland within an individual spider. Spiderlings also use dragline silk as a means of migrating relatively large distances in a short period of time. The tiny spiders secrete an unattached strand of silk then allow the wind to make them airborne with the strand of silk trailing behind them and acting like a kind of hang glider."}, {"url": "https://en.wikipedia.org/wiki/Silk_amino_acid", "passage_text": "Silk amino acids are produced by hydrolyzing (or breaking apart) silk proteins into smaller peptide chains, typically 18 to 19 amino acids in length. Silk amino acids have a lower molecular weight than silk protein powders and are moisturizing to skin and hair. Silk amino acid (SAAs) also known as Sericin is a natural water-soluble glycoprotein extracted from raw silk. It is used as an additive in skin and hair care products due to its high levels of serine which has excellent moisture preservation characteristics."}, {"url": "https://en.wikipedia.org/wiki/Crab_spider", "passage_text": "Thomisidae is a family of spiders. The common name crab spider is often applied to species in this family, but is also applied loosely to many other species of spiders. Among the Thomisidae crab spider refers most often to the familiar species of flower crab spiders, though not all members of the family are limited to ambush hunting in flowers. The most apparent dimorphism, however, is the difference in size – females are roughly twice the size of their male counterparts. On average, for example, the female flower crab spider is 8 mm in length, whereas the male flower crab spider is just 4 mm in length."}, {"url": "https://suite.io/stetson-thacker/5fz921a", "passage_text": "The silk is made in the ampulla, the silk gland, where in the A-zone secretory region the proteins are manufactured and grouped together, then in the B-zone secretory region the proteins are mixed with carbohydrates and peroxidase, which will be the coating on the spider silk. For instance, The Caerostris darwini spider produces silk that is “over 10 times stronger than Kevlar”, which is a synthetic fiber that is woven to make bullet resistant vests."}, {"url": "https://suite.io/stetson-thacker/5fz921a", "passage_text": "Spider Silk. Spider silk has remarkable properties, which ostensibly find there basis in its structure and composition. In general, a spider can produce about six different types of silk all of which serve a specific function for the spider and have slightly different compositions and structures. For instance, The Caerostris darwini spider produces silk that is “over 10 times stronger than Kevlar”, which is a synthetic fiber that is woven to make bullet resistant vests."}, {"url": "http://www.findaspider.org.au/info/silk.htm", "passage_text": "Silk is extruded as a viscous solution that quickly solidifies as its proteins cross-link. It is claimed that the more rapid the extrusion the stronger the threads formed, and this makes sense because we know that many spiders extrude silk to slow down a fall from a high surface. Spiderlings also use dragline silk as a means of migrating relatively large distances in a short period of time. The tiny spiders secrete an unattached strand of silk then allow the wind to make them airborne with the strand of silk trailing behind them and acting like a kind of hang glider."}, {"url": "http://www.findaspider.org.au/info/silk.htm", "passage_text": "It is said that changes in the amounts of these last two amino acids in particular samples of silk lead to differences in strength and other properties but different kinds of silk also vary in the other amino acids they contain and in the presence of carbohydrate components (glycoproteins) and other substances. Spiderlings also use dragline silk as a means of migrating relatively large distances in a short period of time. The tiny spiders secrete an unattached strand of silk then allow the wind to make them airborne with the strand of silk trailing behind them and acting like a kind of hang glider."}]