[{"url": "http://blogmines.com/blog/how-to-insert-or-remove-pages-in-word-2013/", "passage_text": "The most easiest way to add new page is by pressing the Enter key on the Keyboard at the bottom of an existing page. Delete page. Users can remove an empty or blank pages in Word document by. 1  Pressing the Backspace key on the Keyboard from the end of the page that needs to be removed. 2  Pressing the Delete key on the Keyboard from the end of the page after which the pages"}, {"url": "http://www.ehow.com/how_6544889_delete-word-document.html", "passage_text": "You can delete either a single page or a range of pages from your Microsoft Word document from wherever they are located in the document. This includes both pages with and without content, whether they are located midway through the document or at the end."}, {"url": "http://smallbusiness.chron.com/delete-ms-word-46879.html", "passage_text": "Click the Home tab at the top of the Word 2010 window, if the Home tab isn't already selected. Step 4. Click the small arrowhead next to Find in the Editing group at the top, and then select Go To from the drop-down menu to open the Find and Replace window. Step 5. Select Page in the Go To What section."}, {"url": "http://answers.microsoft.com/en-us/office/forum/officeversion_other-word/how-do-i-delete-a-blank-page-from-a-document-using/28990f8f-d22e-41d7-a65f-5f961608144c", "passage_text": "Your directive on how to delete a blank page at the end of a document was of immense help. Followed your instructions to a tee, and it worked like a charm. I was in urgent need of knowing how to remove that pesky last blank page from my CV."}, {"url": "http://answers.microsoft.com/en-us/office/forum/officeversion_other-word/how-do-i-delete-a-blank-page-from-a-document-using/28990f8f-d22e-41d7-a65f-5f961608144c", "passage_text": "For the blank page in the middle of the document, you should look for ===== Page Break ===== This indicates a forced page break. If you delete it the page before and after will combine. For the blank pages at the end of the document: just delete any spare paragraph markers."}, {"url": "http://www.wikihow.com/Remove-a-Blank-Page-in-Word", "passage_text": "Its icon is a black pilcrow 1  (¶). Paragraph marks will show you the invisible marks you've made in your word processing document by pressing the space bar, the enter button, etc. 2  Hitting the paragraph marks button will allow you to see the last pilcrow (¶) on the blank page."}, {"url": "http://wordfaqs.mvps.org/blankpage.htm", "passage_text": "Blank page in the middle of a document. If your blank page occurs in the middle of a document (and is not caused by an Odd/Even Page section break), there is a remote chance that it is caused by a plethora of empty paragraphs, but more often it is the result of a manual page break."}]