[{"url": "http://www.dana.org/Cerebrum/2007/Protecting_the_Brain_from_a_Glutamate_Storm/", "passage_text": "In mammals, glutamate is mainly present in the central nervous system, brain, and spinal cord, where it plays the role of a neuronal messenger, or neurotransmitter. In fact, almost all brain cells use glutamate to exchange messages. "}, {"url": "http://www.alsa.org/research/about-als-research/glutamate.html", "passage_text": "Prolonged excitation is toxic to nerve cells. Neurobiologists recognize that the nerve cell messenger, glutamate, can cause harm when its messages are overwhelming. Normally glutamate is swiftly cleared from the nerve cell junctions to keep the messages brief."}, {"url": "http://rlcure.com/glutamate2.html", "passage_text": "In biochemistry, the glutamate-glutamine cycle is a sequence of events by which an adequate supply of the neurotransmitter glutamate is maintained in the central nervous system. Neurons are not able to perform new synthesis of the neurotransmitter glutamate and y-aminobutyric acid (GABA) from glucose. When GABA binds to a nerve cell receptor, it opens the nerve cell so that chloride ions which are present in the brain are allowed to move into the nerve cell and slow the activity of the cell, and the person normally experiences a calming feeling."}, {"url": "http://www.alsa.org/research/about-als-research/glutamate.html", "passage_text": "Glutamate is then swiftly cleared from the nerve cell junctions to keep the message brief. Prolonged excitation is toxic to nerve cells, and neurobiologists recognize that glutamate can cause harm when the messages are overwhelming, as in stroke or epilepsy. A diseased neuron. Neurobiologists recognize that the nerve cell messenger, glutamate, can cause harm when its messages are overwhelming. Normally glutamate is swiftly cleared from the nerve cell junctions to keep the messages brief."}, {"url": "http://neurotransporter.org/glutamate.html", "passage_text": "65, 1-105. Glutamate. Outside the community of biomedical scientists, glutamate is probably best known as monosodium glutamate or MSG which is used as a flavor or taste enhancer in food. It is usually available together with other food additives and spices in most large food stores. Glutamate taken up by astroglial cells is converted to glutamine. Glutamine is inactive in the sense that it cannot activate glutamate receptors, and is released from the glial cells into to extracellular fluid."}, {"url": "http://www.wellnessresources.com/health/articles/gaba_managing_brain_stimulation_anxiety_and_other_consequences/", "passage_text": "The inhibitory neurotransmitter GABA is made from the main excitatory neurotransmitter glutamate using an enzyme called GAD and B6 in a process called the GABA shunt pathway. The GABA shunt pathway is a by-product of the brain metabolizing glucose and making energy. The pathway does not always convert into GABA. It also continues making the excitatory neurotransmitter glutamate if the pathway is dysfunctional or too much stimulation is present."}, {"url": "http://idealspine.com/pages/AJCC_April_05_glutamate_aspartame_pain_and_your_brain.htm", "passage_text": "Aspartic acid, or aspartate (another amino acid) is the brain’s second prevalent excitatory neurotransmitter. Aspartate poses the same deleterious toxicity to brain neurons as does glutamate, and is therefore also labeled as an excitotoxin. "}, {"url": "https://en.wikipedia.org/wiki/Glutamate_receptor", "passage_text": "Glutamate (Glutamic acid) is the most prominent neurotransmitter in the body, and it is the main excitatory neurotransmitter, being present in over 50% of nervous tissue. Glutamate was initially discovered to be a neurotransmitter in insect studies in the early 1960s. "}, {"url": "http://flipper.diff.org/app/pathways/info/4602", "passage_text": "GLUTAMATE AS NEUROTRANSMITTER. Glutamic acid (abbreviated as Glu or E) is one of the 20-22 proteinogenic amino acids, and its codons are GAA and GAG. It is a non-essential amino acid with a side chain carboxylic acid functional group. The carboxylate anions and salts of glutamic acid are known as glutamates. Glutamate is the most abundant excitatory neurotransmitter in the nervous system and it plays a key role in long-term potentiation. It is involved in most aspects of normal brain functions, including cognition, memory and learning. Glutamate does not pass easily the blood brain barrier but it is instead transported by a high-affinity transport system. It can also be converted into glutamine. Glutamine can cross the blood brain barrier, and then be converted into glutamate by the action of phosphate-activated Glutaminase."}, {"url": "http://www.wellnessresources.com/health/articles/gaba_managing_brain_stimulation_anxiety_and_other_consequences/", "passage_text": "GABA is a critical neurotransmitter and is the primary inhibitory neurotransmitter functioning in the brain. Its purpose is to reduce nerve excitation or stimulation. It also sets the tone of muscles, i.e. too little GABA can lead to significant muscle stiffness or hypertonicity. The GABA shunt pathway is a by-product of the brain metabolizing glucose and making energy. The pathway does not always convert into GABA. It also continues making the excitatory neurotransmitter glutamate if the pathway is dysfunctional or too much stimulation is present."}]