[{"url": "http://www.answers.com/Q/What_is_the_average_temperature_in_a_refrigerator", "passage_text": "Confidence votes 122. The average recommended temperature for a refrigerator is 35 - 38o F(degrees Fahrenheit) and 1.6-3.3 °C (degrees Celsius). It should be about 5 degrees. A properly functioning refrigerator should keep food at a Fahrenheit temperature of 40 degrees-which is just about 5 degrees Celsius. Edit."}, {"url": "http://www.lg.com/us/support/answers/generic-refrigerators/slider-control-panel-tbm.html", "passage_text": "Get to know your Control Panel. For the top/bottom freezer model fridges, you will find the control panel in the refrigerator and the freezer. REFRIGERATOR TEMPERATURE: Shows the set temperature of the refrigerator in Celsius (ºC) or Fahrenheit (°F). FREEZER TEMPERATURE: Shows the set temperature of the freezer in Celsius (ºC) or Fahrenheit (°F). "}, {"url": "https://uk.answers.yahoo.com/question/index?qid=20060816090249AA1Ddvb", "passage_text": "Hold frozen foods in these compartments only a few days. In refrigerator freezers where temperature can be maintained at 0°F (-17°C) in the freezer cabinet, food may be kept for the same storage periods as in a freezer. Date food packages with an expiration date according to maximum storage time recommended if they are not date coded. In most refrigerators, with the control set for normal operation, the temperature in the general storage area is below 40°F (3°C). You can check the temperature in a refrigerator by placing a refrigerator thermometer at different locations in the cabinet. If the temperature is above 40°F (3°C), regulate the control to lower the temperatures"}, {"url": "http://www.immunize.org/catg.d/p3037c.pdf", "passage_text": "Temperature Log for Refrigerator – Celsius Page 2 of 3 DAYS 16–31 Monitor temperatures closely! 1. Write your initials below in “Staff Initials,” and note the time in “Exact Time.”2. Record temps twice each workday.3. Record the min/max temps once each workday—preferably in the morning.4. Temperature Log for Refrigerator – Celsius Page 1 of 3 DAYS 1 –15 Monitor temperatures closely! 1. Write your initials below in “Staff Initials,” and note the time in “Exact Time.”2. Record temps twice each workday.3."}, {"url": "http://home.howstuffworks.com/appliances/energy-efficient/question121.htm", "passage_text": "Therefore, you want your refrigerator to be cold, but not so cold that it freezes things. The preferred temperature is somewhere between 35 and 38 degrees F (1.7 to 3.3 degrees C). Anything higher and foods will spoil too quickly (it also presents food poisoning problems, as described in several of the links below)."}, {"url": "http://www.knowhow.com/article.dhtml?articleReference=786", "passage_text": "1 Fridge: put the thermometer in a glass of water. 2  Check the temperature during the first door opening after not using the fridge for 8 hours or more (such as overnight). 3  Freezer: put thermometer between two bags of vegetables and as above check after 8 hours or more. "}, {"url": "http://www.favoritefreezerfoods.com/ideal-freezer-temperature.html", "passage_text": "The ideal freezer temperature is 0 Fahrenheit (-18 Celsius) for storing food. And -10 Fahrenheit (-23 Celsius) is recommended when freezing food. The faster food freezes the smaller the ice crystals. The smaller the ice crystals the smaller the change in texture and better quality when thawed. "}]