[{"url": "http://www.foodnetwork.com/recipes/aaron-mccargo-jr/simple-roasted-pork-shoulder-recipe.html", "passage_text": "Set the meat on a rack set into a roasting pan. Roast for 20 minutes, and then reduce the heat to 325 degrees F. Continue to cook until an instant-read thermometer inserted into the shoulder reads 185 degrees F, about 4 hours. Remove the pork from the oven and let stand until cool enough to handle, about 30 minutes. "}, {"url": "http://cooking.stackexchange.com/questions/16156/cooking-slow-roasted-pork-to-190f", "passage_text": "Without question low and slow is best for pork shoulder roasts. Roasting the meat to at least an internal temp of 180 degrees is critical. Once this temp is reached, remove the roast from the oven, cover loosely with foil and rest until the in the internal temp reaches at least 190 degrees. They say to cook until 190F because that's the temperature at which the stuff that actually makes your slow-roasted pork moist, the collagen, fat, etc. is breaking down and coating the meat. Less than that and you'll have all those bits still intact in your shoulder, which you don't want."}, {"url": "http://www.wikihow.com/Cook-Pork-Shoulder", "passage_text": "Pork shoulder is best when it's cooked long and slow. Roast uncovered in the oven for about 1 hour per pound of meat. You may reduce the heat as needed if the pork appears to be cooking too quickly-many recipes call for 325 degrees Fahrenheit (163 degrees Celsius) rather than 350 (177 C)."}, {"url": "http://www.food.com/recipe/fall-apart-tender-slow-roast-pork-butt-247715", "passage_text": "1 Cover tightly. 2  Preheat oven to 425 degrees F for 15 minutes. 3  Place the roast in the oven and immediately reduce the temperature down to 200 degrees F. 4  Roast for about 4 hours or until the meat is falling-apart tender (cooking time will vary depending on the size of the roast). 1 Place the roast in the oven and immediately reduce the temperature down to 200 degrees F. 2  Roast for about 4 hours or until the meat is falling-apart tender (cooking time will vary depending on the size of the roast). 3  Stir the salt and black pepper into the juice (do not omit the salt!). 4  Slice meat as desired"}, {"url": "http://nomnompaleo.com/post/6894256523/slow-roasted-pork-shoulder", "passage_text": "Slow-Roasted Pork Shoulder. Forget Febreeze – the best way to make your house smell awesome is to stick a seasoned pork roast in a low temperature oven and slowly cook that sucker over 8-10 hours. My kids were panting like little puppies at the oven window all day waiting for the roast to come out. "}, {"url": "http://www.food.com/recipe/fall-apart-tender-slow-roast-pork-butt-247715", "passage_text": "1 Preheat oven to 425 degrees F for 15 minutes. 2  Place the roast in the oven and immediately reduce the temperature down to 200 degrees F. 3  Roast for about 4 hours or until the meat is falling-apart tender (cooking time will vary depending on the size of the roast). 1 Place the roast in the oven and immediately reduce the temperature down to 200 degrees F. 2  Roast for about 4 hours or until the meat is falling-apart tender (cooking time will vary depending on the size of the roast). 3  Stir the salt and black pepper into the juice (do not omit the salt!). 4  Slice meat as desired"}, {"url": "http://www.food.com/recipe/roasted-pork-shoulder-79014", "passage_text": "1 Place roast in a large roasting pan or dutch oven---add the onion, water (pour around roast, not over it) and bay leaves. 2  Cover, place in oven and cook for 2 1/2- 3 hours, or until internal temperature of meat is 170 degrees F. 3  Remove from oven and pan-- let roast cool for a few minutes. 1 Cover, place in oven and cook for 2 1/2- 3 hours, or until internal temperature of meat is 170 degrees F. 2  Remove from oven and pan-- let roast cool for a few minutes. 3  Slice meat or shred as for pulled pork (I usually do half sliced and half pulled)"}, {"url": "http://bbq.about.com/cs/porkpulled/a/aa080400a.htm", "passage_text": "Overview: The simplified version of preparing pulled pork is to take a pork shoulder and put it in your smoker. Cook until the internal temperature of the meat reaches at least 165 degrees F., the safe temperature for pork. However, higher internal temperature will make the meat easier to pull and more tender. "}]