[{"url": "http://texasastateofmind.tripod.com/id62.html", "passage_text": "Brazos River – 1280 miles of which 840 miles are in Texas, making it the longest section of river in Texas. Pecos River – 926 miles most of which is in New Mexico."}, {"url": "http://www.ehow.com/facts_7254432_longest-river-texas_.html", "passage_text": "The Brazos River. The Brazos River is 1,280 miles in length and runs from Blackwater Draw, Curry County, New Mexico, through the heart of Texas and also empties into the Gulf of Mexico. A length of 840 miles of the river runs through Texas."}, {"url": "https://tshaonline.org/handbook/online/articles/rnr01", "passage_text": "The Red River is in the Mississippi drainage basin and is one of two Red Rivers in the nation. It is the second longest river associated with Texas."}, {"url": "http://www.ehow.com/facts_7254432_longest-river-texas_.html", "passage_text": "The Brazos River is officially considered the longest river in the state of Texas according to the United States Geographic Survey. The Brazos River is historic for being the setting for a battle between the Texas Navy and the Mexican Navy as well as the location where the Texas Navy ship Independence was sunk."}, {"url": "http://www.ehow.com/facts_7254432_longest-river-texas_.html", "passage_text": "Texas is home to many rivers, but two of the longest are the Rio Grande and the Brazos River. The Rio Grande technically spans a greater distance, but it borders the state of Texas and the country of Mexico."}, {"url": "https://answers.yahoo.com/question/index?qid=20070313071442AAVDkMc", "passage_text": "Report Abuse. Depends on if you mean the longest river that passes through Texas, or the longest river located wholly in the state of Texas. If it is the former, it is the Rio Grande. If it is the latter, it is the Brazos."}, {"url": "http://www.mapsofworld.com/usa/states/texas/texas-river-map.html", "passage_text": "The Brazos River: The Brazos River is the eleventh longest river in the United States and the longest river in Texas. The length of the river is 1,280 miles and its source is located in the Blackwater Draw, New Mexico. The river empties into the Gulf of Mexico."}]