[{"url": "http://www.latimes.com/entertainment/movies/la-et-mn-the-longest-ride-review-20150408-column.html", "passage_text": "Michael Tackett / Twentieth Century Fox. The Longest Ride centers on the star-crossed love affair between Luke (Scott Eastwood), a former champion bull rider looking to make a comeback, and Sophia (Britt Robertson), a college student who is about to embark upon her dream job in New York City's art world. (Michael Tackett / Twentieth Century Fox)."}, {"url": "http://www.post-gazette.com/ae/book-reviews/2013/09/28/Book-review-Nicholas-Sparks-Longest-Ride-hits-a-dead-end-for-romance-fan/stories/201309280031", "passage_text": "I love a good romantic story no matter how well written it is (or not). I have to care about the characters. In The Longest Ride, I didn't care about either couple. Of course, Sophia and Luke will have problems. He is a cowboy who labors hard every day of his life."}, {"url": "http://www.post-gazette.com/ae/book-reviews/2013/09/28/Book-review-Nicholas-Sparks-Longest-Ride-hits-a-dead-end-for-romance-fan/stories/201309280031", "passage_text": "Nicholas Sparks' new novel The Longest Ride tells two love stories. One is the love story of Ira Levinson, a Jewish haberdasher in Greensboro, N.C., and his wife, Ruth, who came to North Carolina from Vienna when Hitler's atrocities were merely speculation."}, {"url": "http://www.post-gazette.com/ae/book-reviews/2013/09/28/Book-review-Nicholas-Sparks-Longest-Ride-hits-a-dead-end-for-romance-fan/stories/201309280031", "passage_text": "The other story is the budding romance of Luke, a North Carolina rancher and champion bull rider, and Sophia, a Wake Forest art history student who was raised by immigrant parents in New Jersey. THE LONGEST RIDE. By Nicholas Sparks."}, {"url": "http://www.abriefread.com/the-longest-ride/", "passage_text": "The Longest Ride is an inspiring tale of eternal and enduring love. The plot weaves around two different stories: that of Ira and Ruth and that of Luke and Sophia."}, {"url": "http://www.imdb.com/title/tt2726560/reviews", "passage_text": "Based on yet another Sparks best-seller, The Longest Ride centers on the star-crossed love affair between Luke-a former champion bull rider looking to make a comeback-and Sophia-a college student who is about to embark upon her dream job in New York City's art world."}, {"url": "https://www.movieguide.org/reviews/the-longest-ride.html", "passage_text": "THE LONGEST RIDE tells the story of a rodeo bull-rider named Luke and an art student finishing college named Sophia. On their first date, Luke and Sophia save the life of an elderly, dying man, Ira. Because of Ira’s failing eyesight, Sophia begins reading Ira’s letters to his late wife, Ruth."}, {"url": "http://nicholassparks.com/stories/the-longest-ride/", "passage_text": "Based on the bestselling novel by master storyteller Nicholas Sparks, THE LONGEST RIDE centers on the star-crossed love affair between Luke, a former champion bull rider looking to make a comeback, and Sophia, a college student who is about to embark upon her dream job in New York City’s art world."}]