[{"url": "http://www.answers.com/Q/Why_are_GMOs_produced", "passage_text": "GMOs are not caused, but produced. GMO is the abbreviation for Genetically Modified Organism. Basically, the process of genetic engineering removes a section of DNA from one o … rganism, often a bacteria or virus, and inserts it into another organism, often a crop like corn or soybeans."}, {"url": "http://www.who.int/foodsafety/areas_work/food-technology/faq-genetically-modified-food/en/", "passage_text": "1. Genetically modified organisms (GMOs) can be defined as organisms (i.e. plants, animals or microorganisms) in which the genetic material (DNA) has been altered in a way that does not occur naturally by mating and/or natural recombination."}, {"url": "http://www.ehow.com/about_6633930_purpose-gmos_.html", "passage_text": "According to the World Health Organization, or WHO, genetically modified foods were introduced to the market in the mid-1990s with herbicide-resistant soybeans. The most common genetically modified foods are corn, canola, soybean and cotton, which is used to make cottonseed oil."}, {"url": "http://www.answers.com/Q/Why_are_GMOs_produced", "passage_text": "GMOs can be found in crops, such as corn, soybeans, cotton, canola,  papayas, wheat, acorn squash, Golden rice, and others; medicines,  such as insulin; organic crops that h … ave been contaminated by GMO  crops, foods that include GMO ingredients, dog and other pet foods  made with GMO ingredients, etc."}, {"url": "http://www.answers.com/Q/Why_are_GMOs_produced", "passage_text": "GMOs are genetically modified organisms. In general they are made  by taking DNA from a source and putting it into the cells of a  target organism to produce a desired trait … ."}, {"url": "http://www.nongmoproject.org/about-gmos-2/", "passage_text": "GMOs (or “genetically modified organisms”) are organisms that have been created through the gene-splicing techniques of biotechnology (also called genetic engineering, or GE)."}, {"url": "http://www.answers.com/Q/Why_are_GMOs_produced", "passage_text": "GMOs are also used to create drugs. To answer your question directly, they are produced because some people genuinely believe they will benefit humanity, and because companies make billions of dollars producing patentable modifications."}, {"url": "http://www.answers.com/Q/Why_are_GMOs_produced", "passage_text": "Genetic modification is generally undertaken to create organisms with a beneficial trait, such as crops which are resistant to herbicides like glysophate, or that produce substances in the plant itself that kill insects, which is reported to reduce the use of synthetic pesticides."}, {"url": "http://blogs.usda.gov/2013/05/17/organic-101-can-gmos-be-used-in-organic-products/", "passage_text": "The use of genetic engineering, or genetically modified organisms (GMOs), is prohibited in organic products. This means an organic farmer can’t plant GMO seeds, an organic cow can’t eat GMO alfalfa or corn, and an organic soup producer can’t use any GMO ingredients."}, {"url": "http://janiceperson.com/agriculture/ag-awareness/what-are-gmos-why-do-farmers-plant-gmo-crops/", "passage_text": "So basically, a GMO (genetically modified organism) is a plant, crop, food or something related to those things that was created with biotechnology. There are several kinds of GMOs, all of them involve taking a gene from one species and putting it into another unrelated species."}]