[{"url": "http://www.taxtips.ca/filing/ageamount.htm", "passage_text": "118(2). The age amount tax credit is a non-refundable tax credit, claimed on line 301 of the personal income tax return. This tax credit is available to individuals who are, at the end of the taxation year, aged 65 or older. The federal age amount for 2013 is $6,854 ($6,916 for 2014)."}, {"url": "http://www.milliondollarjourney.com/how-the-age-and-pension-amount-tax-credit-works.htm", "passage_text": "The pension amount tax credit offers up to a $2,000 non-refundable tax credit (worth about $300) to seniors who collect private pension (RRIF counts) or annuity payments. Qualifying pensions do not include Canada Pension Plan (CPP), Old Age Security (OAS), or Guaranteed Income Supplement (GIS)."}, {"url": "https://turbotax.intuit.ca/tax-resources/retirement-taxes/tax-credits-for-seniors.jsp", "passage_text": "You are allowed to claim a credit if you were 65 or older at the end of the tax year. Your net income on your tax return must also be less than $80,256, as of publication. The age amount you can claim depends on your income If your income is less than $34,562, you would claim $6,854."}, {"url": "http://www.cra-arc.gc.ca/tx/ndvdls/tpcs/ncm-tx/rtrn/cmpltng/ddctns/lns300-350/301/menu-eng.html", "passage_text": "Line 301 - Age amount. You can claim this amount if you were 65 years of age or older on December 31, 2014, and your net income (line 236 of your return) is less than $80,980. If your net income was: 1  $34,873 or less, enter $6,916 on line 301 of Schedule 1, Federal Tax;"}, {"url": "http://www.fcac-acfc.gc.ca/Eng/forConsumers/lifeEvents/livingRetirement/Pages/federalt-creditsd.aspx", "passage_text": "1 The age amount: You can claim this amount if you are 65 years of age or older and your net income is less than $80,256 (for 2013). 2  If your net income was $34,562 or less, you would qualify for a $6,854 credit."}, {"url": "http://www.taxtips.ca/filing/ageamount.htm", "passage_text": "Income Tax Act s. The age amount tax credit is a non-refundable tax credit, claimed on line 301 of the personal income tax return. This tax credit is available to individuals who are, at the end of the taxation year, aged 65 or older. The federal age amount for 2013 is $6,854 ($6,916 for 2014)."}]