[{"url": "http://www.medilexicon.com/medicaldictionary.php?t=41532", "passage_text": "thyrotropic hormone. Synonyms: thyrotropin. The definition information for thyrotropic hormone is provided by Stedman's. You can search our medical dictionary here. Stedman's, part of Lippincott Williams & Wilkins, provides a comprehensive line of health-science publications for healthcare professionals and medical students."}, {"url": "http://medical-dictionary.thefreedictionary.com/hormones%2c+thyrotropic", "passage_text": "hormones, thyrotropic (thyroid-stimulating hormone [TSH]), n a pituitary hormone that regulates the growth and activity of the thyroid gland. "}, {"url": "http://medical-dictionary.thefreedictionary.com/thyrotropic+hormone", "passage_text": "luteinizing hormone. A hormone produced by the anterior lobe of the pituitary, in females stimulating the development of the corpus luteum and helping in the secretion of progesterone, and in males stimulating the development of interstitial cells of the testes to produce testosterone. A hormone secreted by the parathyroid glands that regulates blood levels of calcium and phosphorus. A deficiency results in hypoparathyroidism and hypocalcemia; in excess, it causes hyperparathyroidism and hypercalcemia."}, {"url": "http://www.audioenglish.org/dictionary/thyrotropic_hormone.htm", "passage_text": "• THYROTROPIC HORMONE (noun). The noun THYROTROPIC HORMONE has 1 sense: 1. anterior pituitary hormone that stimulates the function of the thyroid gland. Familiarity information: THYROTROPIC HORMONE used as a noun is very rare."}, {"url": "https://en.wikipedia.org/wiki/Thyrotropin-releasing_hormone", "passage_text": "Thyrotropin-releasing hormone (TRH), also called thyrotropin-releasing factor (TRF), thyroliberin or protirelin, is a tropic, tripeptidal hormone, produced by the hypothalamus, that stimulates the release of TSH (thyroid-stimulating hormone) and prolactin from the anterior pituitary. At the beginning, it is synthesized as a 242-amino acid precursor polypeptide that contains 6 copies of the sequence-Gln-His-Pro-Gly-, flanked by Lys-Arg or Arg-Arg sequences. To produce the mature form, a series of enzymes are required."}, {"url": "http://www.thefreedictionary.com/thyrotropic", "passage_text": "thy·ro·tro·pin. n. A hormone secreted by the anterior lobe of the pituitary gland that stimulates and regulates the activity of the thyroid gland. Also called thyroid-stimulating hormone, thyrotropic hormone. [ thyro- + -trop(h)ic + -in .]. thy′ro·tro′pic (-trō′pĭk, -trŏp′ĭk) , thy′ro·tro′phic (-trō′fĭk, -trŏf′ĭk) adj. thyrotropin. n. 1. (Biochemistry) a glycoprotein hormone secreted by the anterior lobe of the pituitary gland: it stimulates the activity of the thyroid gland. Also called: thyroid-stimulating hormone."}, {"url": "http://www.merriam-webster.com/dictionary/thyrotropic", "passage_text": "Medical Definition of THYROTROPIC. : exerting or characterized by a direct influence on the secretory activity of the thyroid gland. thy·ro·tro·pic also thy·ro·tro·phic \\-ˈtrō-fik\\"}, {"url": "http://medical-dictionary.thefreedictionary.com/thyrotropic+hormone", "passage_text": "A glycoprotein hormone produced by the anterior lobe of the hypophysis that stimulates the growth and function of the thyroid gland; also used as a diagnostic test to differentiate primary and secondary hypothyroidism. A hormone secreted by the parathyroid glands that regulates blood levels of calcium and phosphorus. A deficiency results in hypoparathyroidism and hypocalcemia; in excess, it causes hyperparathyroidism and hypercalcemia."}, {"url": "http://www.thefreedictionary.com/thyrotropic", "passage_text": "Noun. 1. thyrotropin-anterior pituitary hormone that stimulates the function of the thyroid gland. thyroid-stimulating hormone, thyrotrophic hormone, thyrotrophin, thyrotropic hormone, TSH. thyrotropin. n. 1. (Biochemistry) a glycoprotein hormone secreted by the anterior lobe of the pituitary gland: it stimulates the activity of the thyroid gland. Also called: thyroid-stimulating hormone."}]