[{"url": "http://www.bls.gov/ooh/community-and-social-service/mobile/social-workers.htm", "passage_text": "Although most social workers need a bachelor’s degree in social work, clinical social workers must have a master’s degree and two years of post-master experience in a supervised clinical setting. Clinical social workers must also be licensed in the state in which they practice. For example, clinical social workers must have a master’s degree in social work and two years of post-master experience in a supervised clinical setting. A master’s degree in social work generally takes 2 years to complete."}, {"url": "https://nationalcareersservice.direct.gov.uk/advice/planning/jobprofiles/Pages/socialworker.aspx", "passage_text": "To become a social worker you will need to study a three-year undergraduate degree or a two-year postgraduate degree in social work that is approved by the Health and Care Professions Council (HCPC). You will also need to pass background checks by the Disclosure and Barring Service (DBS). Entry requirements. To become a social worker in England, you will need to take a three-year undergraduate degree or a two-year postgraduate degree in social work that is approved by the Health and Care Professions Council (HCPC)."}, {"url": "http://www.bls.gov/ooh/Community-and-Social-Service/Social-workers.htm", "passage_text": "How to Become a Social Worker. Although most social workers need a bachelor’s degree in social work, clinical social workers must have a master’s degree and two years of post-master experience in a supervised clinical setting. Clinical social workers must also be licensed in the state in which they practice. However, some states provide exemptions for clinical social workers who work in government agencies. Becoming a licensed clinical social worker usually requires a master’s degree in social work and a minimum of 2 years or 3,000 hours of supervised clinical experience after graduation."}, {"url": "http://study.com/how_to_become_a_social_worker.html", "passage_text": "An MSW can be undertaken with any undergraduate degree, though some programs may require certain prerequisite coursework in related areas, such as psychology and sociology, for applicants not holding a BSW. The MSW is required to become a clinical social worker or to work in schools or the healthcare system. These degree programs typically take two years to complete (though some programs offer more flexible 3 and 4-year degree plans) and prepare students for advanced practice in their specialties. In addition, a Masters in Social Work (MSW) is a very versatile degree which can be used as a stepping stool for other career tracks including public health and policy. Most entry-level positions require a Bachelor of Social Work (BSW). An MSW is necessary for other positions, including that of clinical social worker."}, {"url": "http://www.bls.gov/ooh/Community-and-Social-Service/Social-workers.htm", "passage_text": "For example, clinical social workers must have a master’s degree in social work and two years of post-master experience in a supervised clinical setting. A master’s degree in social work generally takes 2 years to complete. However, some states provide exemptions for clinical social workers who work in government agencies. Becoming a licensed clinical social worker usually requires a master’s degree in social work and a minimum of 2 years or 3,000 hours of supervised clinical experience after graduation."}, {"url": "http://www.socialworklicensure.org/articles/become-a-social-worker.html", "passage_text": "Become a Social Worker: Starting Out. If you are interested in becoming a social worker, the first step, from a licensing standpoint, is to get a Council on Social Work Education (CSWE) accredited social work degree. But in reality, the first step is to make yourself competitive for admission. Learn more about the paths to become a social worker if you don't have a CSWE accredited undergraduate degree by reading through this informative article :  Options for Students Without CSWE Accredited Bachelor’s Degrees ."}, {"url": "http://www.bls.gov/ooh/Community-and-Social-Service/Social-workers.htm", "passage_text": "Although most social workers need a bachelor’s degree in social work, clinical social workers must have a master’s degree and two years of post-master experience in a supervised clinical setting. However, some states provide exemptions for clinical social workers who work in government agencies. Becoming a licensed clinical social worker usually requires a master’s degree in social work and a minimum of 2 years or 3,000 hours of supervised clinical experience after graduation."}, {"url": "http://www.bls.gov/ooh/community-and-social-service/mobile/social-workers.htm", "passage_text": "Becoming a licensed clinical social worker usually requires a master’s degree in social work and a minimum of 2 years or 3,000 hours of supervised clinical experience after graduation. After completing their supervised experience, clinical social workers must pass a clinical exam to be licensed. For example, clinical social workers must have a master’s degree in social work and two years of post-master experience in a supervised clinical setting. A master’s degree in social work generally takes 2 years to complete."}]