[{"url": "http://www.thinkbabynames.com/meaning/0/Maria", "passage_text": "Maria is a very prominent first name for females (#7 out of 4276, Top 1%) and also a very prominent last name for both adults and children (#7915 out of 150436, Top 5%). (2000 U.S. Census). Charted below is the baby name popularity of Maria for girls. Marie, the French variant, was the preferred form of Mary in England until about the time of the Reformation. Maria and Marie are very often blended with other names and suffixes. See also Manon, Mari, Maribel, Marisa, Mia, and Ria."}, {"url": "http://www.abarim-publications.com/Meaning/Maria.html", "passage_text": "Etymology of the name Maria. The name Maria is Greek but it is a transliteration of the Hebrew name Miriam. When the Bible was translated from Greek to Latin, the translators had a problem because μαριαμ, the Greek version of the Hebrew name Miriam, looked like an accusative form. For some reason, the Biblical name Maria was turned into Mary in the English speaking world. But the name Maria is still very popular in the rest of it. And it seems that the name Maria was also quite popular in the time of Jesus."}, {"url": "https://en.wikipedia.org/wiki/Maria_(given_name)", "passage_text": "In the Roman Empire, the name was used as a feminine form of the Roman name Marius (see Maria (gens)). It became popular with the spread of Christianity as a Latinized form of the Hebrew name of Jesus' mother Mary (Miriam in Hebrew or Maryam in Aramaic). As a result of their similarity and syncretism, the Latin original name Maria and the Hebrew-derived Maria combined to form a single name. The meaning of the Semitic-rooted name is uncertain, but it may originally be an Egyptian name, probably derived from mry beloved or mr love (eminent lady or beloved lady). Maria is a female given name in many diverse cultures, including African, Arab, Armenian, Croatian, Dutch, English, Finnish, German, Greek, Hispanic American and Spanish, Italian, Maltese, Norwegian, Polish, Portuguese, Russian, Romanian, Pakistani, Afghan, Serbian, Swedish, and Indonesian."}, {"url": "http://www.thenamemeaning.com/maria/", "passage_text": "Search comprehensively and find the name meaning of Maria and its name origin or of any other name in our database. Also note the spelling and the pronunciation of the name Maria and check the initials of the name with your last name to discover how it looks and sounds. The different meanings of the name Maria are: The meaning of the name “Maria” is different in several languages, countries and cultures and has more than one possibly same or different meanings available."}, {"url": "http://www.babynamewizard.com/baby-name/girl/maria", "passage_text": "Origin of the name Maria: Latin form of Mary, which is derived from the Hebrew Miryām, a name of debated meaning. Many believe it to mean sea of bitterness or sea of sorrow.. However, some sources cite the alternative definitions of rebellion, wished-for child, and mistress or lady of the sea.. Latin form of Mary, which is derived from the Hebrew Miryām, a name of debated meaning. Many believe it to mean sea of bitterness or sea of sorrow.."}, {"url": "http://www.meaning-of-names.com/hebrew-names/maria.asp", "passage_text": "Meaning of Maria. Hebrew name. In Hebrew, the name Maria means-Variant of Mary: Wished-for child; rebellion; bitter.. Other origins for the name Maria include-Hebrew, Spanish, French, Spanish, Italian, German, Portuguese.The name Maria is most often used as a girl name or female name. Hebrew Name Meaning-Variant of Mary: Wished-for child; rebellion; bitter. Origin-Hebrew"}, {"url": "http://www.behindthename.com/name/maria", "passage_text": "Meaning & History. Latin form of Greek μαρια, from Hebrew מִרְיָם (see MARY). Maria is the usual form of the name in many European languages, as well as a secondary form in other languages such as English (where the common spelling is Mary). In some countries, for example Germany, Poland and Italy, Maria is occasionally used as a masculine middle name."}, {"url": "http://www.sheknows.com/baby-names/name/maria", "passage_text": "Hebrew Meaning: The name Maria is a Hebrew baby name. In Hebrew the meaning of the name Maria is: Wished-for child; rebellion; bitter. Latin Meaning: The name Maria is a Latin baby name. In Latin the meaning of the name Maria is: Commonly-used Wished-for child; rebellion; bitter. Popular with both Spanish and non-Spanish cultures. Norse Meaning: The name Maria is a Norse baby name"}, {"url": "http://www.thinkbabynames.com/meaning/0/Maria", "passage_text": "Maria /ma-ria/ [3 sylls.] as a girls' name is pronounced mah-REE-ah. It is of Latin origin, and the meaning of Maria is  star of the sea . Variant for Mary used in English-speaking countries in the 18th century, and popular with both Spanish and non-Spanish cultures. Revived in the 20th century due to the popularity of West Side Story , with its famous ballad . Marie, the French variant, was the preferred form of Mary in England until about the time of the Reformation. Maria and Marie are very often blended with other names and suffixes. See also Manon, Mari, Maribel, Marisa, Mia, and Ria."}]