[{"url": "http://homebuying.about.com/od/realestateagents/qt/102208_AgtIncom.htm", "passage_text": "According to Salary.com, most real estate agents earn on average between $34,000 and $45,000 annually. How much agents make depends on the number of transactions they complete, the commission paid to the brokerage and their split with the sponsoring broker."}, {"url": "http://homebuying.about.com/od/realestateagents/qt/102208_AgtIncom.htm", "passage_text": "All real estate commissions are negotiable, and are paid directly to the broker, not the agent. Agents work for the broker. Typically, it is the seller who designates how much the buyer's agents are paid. A listing commission can vary from a flat fee to a percentage of 1 % to 10% or more of the sales price."}, {"url": "http://www.answers.com/Q/How_much_money_does_a_real_estate_agent_earn", "passage_text": "Answer There's a huge variation in income among Real Estate agents, because earnings are based entirely on how much you sell. Some agents who advertise heavily earn well above $100,000 year after year, while some full-time agents earn as little as $12,500 per year."}, {"url": "http://www.access2knowledge.org/jobs-education/how-much-do-real-estate-agents-make/", "passage_text": "In other words, the 162,560 real estate agents nationwide earned a mean hourly wage of $24.97. The lowest ten percent of real estate agents earn an average $20,700, while the top ten percent make an average of $95,540 annually. For real estate agents employed within a real estate office, the average real estate agent salary is right around normal at $52,870."}, {"url": "http://www.answers.com/Q/How_much_money_does_a_real_estate_agent_earn", "passage_text": "The median annual earnings of salaried real estate agents in the U.S., according to the Department of Labor was $30,930 in 2002. This is including commissions. Median annual earnings of salaried real estate brokers, including commission, was $50,3"}, {"url": "http://www.access2knowledge.org/jobs-education/how-much-do-real-estate-agents-make/", "passage_text": "Salary. Real estate agents work for brokers on a contract basis, which mean their earnings are a portion of the commission from every property they sell. According to the Bureau of Labor Statistics May 2012 record, the mean annual salary for real estate agents is $51,930."}, {"url": "http://homebuying.about.com/od/realestateagents/qt/102208_AgtIncom.htm", "passage_text": "Contrary to popular belief, most real estate agents sell only 4 to 6 homes a year. The saying is 20% of the agents do 80% of the business. In the example above, an agent who comprises part of the 80% category (that wins 20% of the business) would gross about $18,000 a year."}]