[{"url": "http://www.naturestealeaf.com/herbal-tea/organic-moringa-tea.html", "passage_text": "DETAILS. Moringa Tea is made from the leaves of the Moringa oleifera tree, prominent source of the powerful antioxidant EGCG as well as vitamins A & C, calcium, potassium, iron and protein. Moringa is known to boost energy and mental clarity. EGCG kills cancer cells without harming healthy tissue. "}, {"url": "http://www.webmd.com/vitamins-supplements/ingredientmono-1242-MORINGA.aspx?activeIngredientId=1242&activeIngredientName=MORINGA", "passage_text": "Moringa is sometimes applied directly to the skin as a germ-killer or drying agent (astringent). It is also used topically for treating pockets of infection (abscesses), athlete’s foot, dandruff, gum disease (gingivitis), snakebites, warts, and wounds. Moringa has been used safely in doses up to 6 grams daily for up to 3 weeks. There isn’t enough information to know if moringa is safe when used in medicinal amounts. Pregnancy and breast-feeding: It’s LIKELY UNSAFE to use the root, bark or flowers of moringa if you are pregnant."}, {"url": "http://moringaleaves.blogspot.com/2008/08/what-makes-moringa-tea-so-special.html", "passage_text": "The Indian have known about the medicinal benefits of moringa tea since ancient times, using it to treat everything from headaches to depression. One historian writer states that Moringa tea has been used as a medicine in India for at least 4,000 years. Today, scientific research in both Asia and the west is providing hard evidence for the health benefits long associated with drinking moringa tea. The secret of moringa tea lies in the fact it is rich in catechin polyphenols, particularly epigallocatechin gallate (EGCG). EGCG is a powerful anti-oxidant: besides inhibiting the growth of cancer cells, it kills cancer cells without harming healthy tissue."}, {"url": "http://www.webmd.com/vitamins-supplements/ingredientmono-1242-MORINGA.aspx?activeIngredientId=1242&activeIngredientName=MORINGA", "passage_text": "Moringa is a plant that is native to the sub-Himalayan areas of India, Pakistan, Bangladesh, and Afghanistan. It is also grown in the tropics. The leaves, bark, flowers, fruit, seeds, and root are used to make medicine. Moringa has been used safely in doses up to 6 grams daily for up to 3 weeks. There isn’t enough information to know if moringa is safe when used in medicinal amounts. Pregnancy and breast-feeding: It’s LIKELY UNSAFE to use the root, bark or flowers of moringa if you are pregnant."}, {"url": "http://www.purehealingfoods.com/moringaInfo.php", "passage_text": "The Miracle of Moringa Tree Leaves (Moringa Oleifera), commonly called the 'drumstick tree, and 'horseradish tree' is native to India but has been planted around the world and is naturalized in many locales. Moringa is one of the most powerful health-enhancing plants. "}, {"url": "https://en.wikipedia.org/wiki/Moringa_oleifera", "passage_text": "Moringa oleifera is the most widely cultivated species of the genus Moringa, which is the only genus in the family Moringaceae. "}, {"url": "http://miracletrees.org/buy-moringa-tea.html", "passage_text": "Moringa Tea: Nutritious Energy Drink! The Moringa oleifera tea is an excellent energy drink. The tea is loaded with antioxidants and vitamins that will help clear your mind and boost energy levels. You can prepare a tea by steeping a handful of dry leaves in hot water for a few minutes. To make Moringa tea you should harvest fresh leaves from your tree and dry them at room temperature. Place the leaves in a brown paper bag with some holes in it and hang the bag in a cool area of your home. In about 10-14 days your leaves should be dry enough to use. To make the tea, shred or pulverize the leaves."}, {"url": "http://miracletrees.org/buy-moringa-tea.html", "passage_text": "How to make Moringa Tea. Moringa oleifera is one of the most rich sources of nutrients and vitamins that our body needs. It is rich in calcium, potassium, beta-carotene, Vitamin C, and iron. Moringa can be prepared as a vegetable or included in soups, but mostly just the leaves and fruits are used. To make Moringa tea you should harvest fresh leaves from your tree and dry them at room temperature. Place the leaves in a brown paper bag with some holes in it and hang the bag in a cool area of your home. In about 10-14 days your leaves should be dry enough to use. To make the tea, shred or pulverize the leaves."}, {"url": "http://miracletrees.org/moringa_medicine.html", "passage_text": "Moringa oleifera has an impressive range of medicinal uses with high nutritional value and medicinal benefits. Different parts of Moringa contain a profile of important minerals and are a good source of protein, vitamins, beta-carotene, amino acids and various phenolics. Medicinal Properties of Moringa Oleifera: Study on the Promising Healer. Moringa oleifera is a small size tree with approximately 5 to 10 m height. It is cultivated all over the world due to its multiple utilities. Every part of Moringa is used for certain nutritional and/or medicinal propose."}]