[{"url": "http://www.sleeplikethedead.com/mattress-reviews-kingsdown.html", "passage_text": "Depending on the model, Kingsdown beds come with a 10-20 year warranty. For a company of its size, Kingsdown has a fairly high number of Better Business Bureau complaints regarding warranty issues. (See mattress warranties: what you should know."}, {"url": "http://www.mattress-wiz.com/kingsdown-mattress-reviews.html", "passage_text": "Kingsdown mattress dealers are bound to offer different prices on the company's many models, but you can expect to shell out anywhere from $800 to $4000 depending on the model type and mattress size you're after."}, {"url": "http://www.sleeplikethedead.com/mattress-reviews-kingsdown.html", "passage_text": "Kingsdown's below-average owner satisfaction is due mostly to the fact that at least 22% of owners report a loss of support and comfort due to sagging / development of body impressions occurring within the first three years – a rate similar to that of innerspring mattresses in general. Price / affordability."}, {"url": "http://www.rightmove.co.uk/house-prices/Kingsdown-14108.html", "passage_text": "Kingsdown, with an overall average price of £343,105 was more expensive than nearby Walmer (£237,853), Deal (£226,740) and Whitfield (£211,899). During the last year, sold prices in Kingsdown were similar to the previous year and 8% down on 2010 when the average house price was £374,541. Show Map Key Hide Map Key."}, {"url": "http://www.rightmove.co.uk/house-prices/Kingsdown-14107.html", "passage_text": "Kingsdown, with an overall average price of £489,108, was similar in terms of sold prices to nearby Box (£490,475), but was more expensive than Bath (£378,632) and Batheaston (£378,367). In the past year house prices in Kingsdown were similar to the year before and similar to 2007 when they averaged at £501,111."}, {"url": "http://sleepmentor.net/kingsdown-mattress-review-rating-and-comparison/", "passage_text": "Price varies according to the model and size as Kingsdown sells wide range of models and products. The price can range from $500 to $5700. Based on the product or material of the mattress, the company offers ten years to lifetime warranty on their mattresses."}, {"url": "http://www.rightmove.co.uk/house-prices/Kingsdown-14108.html", "passage_text": "During the last year, sold prices in Kingsdown were similar to the previous year and 8% down on 2010 when the average house price was £374,541."}, {"url": "http://idealmattress.com/kingsdown-mattresses/", "passage_text": "Our Ideal Mattress (Mississauga location) lineup includes Chiro series collection, Chiro advance collection, Solo collection, Solo Metro collection and top of the line from Kingsdown Silent Partner Collection, which features (2400 pocket coils in a queen size).."}]