[{"url": "https://en.wikipedia.org/wiki/Pragmatic_ethics", "passage_text": "Pragmatic ethics is a theory of normative philosophical ethics. Ethical pragmatists, such as John Dewey, believe that some societies have progressed morally in much the way they have attained progress in science. "}, {"url": "https://en.wikipedia.org/wiki/Pragmatism", "passage_text": "Pragmatism is a philosophical tradition that began in the United States around 1870. Pragmatism rejects the idea that the function of thought is to describe, represent, or mirror reality. Instead, pragmatists consider thought an instrument or tool for prediction, problem solving and action. In the philosophy of science, instrumentalism is the view that concepts and theories are merely useful instruments and progress in science cannot be couched in terms of concepts and theories somehow mirroring reality."}, {"url": "http://www.iep.utm.edu/pragmati/", "passage_text": "The term “pragmatism” was first used in print to designate a philosophical outlook about a century ago when William James (1842-1910) pressed the word into service during an 1898 address entitled “Philosophical Conceptions and Practical Results,” delivered at the University of California (Berkeley). There has been a recent resurgence of interest in pragmatism, with several high-profile philosophers exploring and selectively appropriating themes and ideas embedded in the rich tradition of Peirce, James, and Dewey."}, {"url": "https://en.wikipedia.org/wiki/Pragmatism", "passage_text": "Pragmatism as a philosophical movement began in the United States in the 1870s. Its direction was determined by The Metaphysical Club members Charles Sanders Peirce, William James, and Chauncey Wright, as well as John Dewey and George Herbert Mead. In the philosophy of science, instrumentalism is the view that concepts and theories are merely useful instruments and progress in science cannot be couched in terms of concepts and theories somehow mirroring reality."}, {"url": "http://atheism.about.com/od/philosophyschoolssystems/p/pragmatism.htm", "passage_text": "Pragmatism is an American philosophy from the early 20th century. According to Pragmatism, the truth or meaning of an idea or a proposition lies in its observable practical consequences rather than anything metaphysical. William James is the most famous philosopher of Pragmatism and hes the one who made Pragmatism itself famous. For James, Pragmatism was about value and morality: the purpose of philosophy was to understand what had value to us and why."}, {"url": "http://www.philosophytalk.org/shows/american-pragmatism", "passage_text": "What is it: Pragmatism is perhaps America's most distinctive contribution to philosophy. Developed by Pierce, Dewey, and James in the late 19th and early 20th centuries, pragmatism holds that both the meaning and the truth of any idea is a function of its practical outcome. "}, {"url": "http://plato.stanford.edu/entries/pragmatism/", "passage_text": "Pragmatism was a philosophical tradition that originated in the United States around 1870. The most important of the ‘classical pragmatists’ were Charles Sanders Peirce (1839–1914), William James (1842–1910) and John Dewey (1859–1952). Most of this entry is devoted to the ideas of the classical pragmatists, Peirce, James, and Dewey. But towards the end of the entry we shall explore what are sometimes called ‘the new pragmatists’. These are philosophers who revitalized pragmatism, developing ideas that evidently belonged to the pragmatist tradition."}, {"url": "http://www.iep.utm.edu/pragmati/", "passage_text": "Pragmatism. Pragmatism is a philosophical movement that includes those who claim that an ideology or proposition is true if it works satisfactorily, that the meaning of a proposition is to be found in the practical consequences of accepting it, and that unpractical ideas are to be rejected. There has been a recent resurgence of interest in pragmatism, with several high-profile philosophers exploring and selectively appropriating themes and ideas embedded in the rich tradition of Peirce, James, and Dewey."}, {"url": "http://www.philosophybasics.com/movements_pragmatism.html", "passage_text": "Pragmatism is a late 19th Century and early 20th Century school of philosophy which considers practical consequences or real effects to be vital components of both meaning and truth. At its simplest, something is true only insofar as it works. The school of Pragmatism reached its peak in the early 20th Century philosophies of William James and John Dewey. The term pragmatism was first used in print by James, who credited Peirce with coining the term during the early 1870s."}, {"url": "http://plato.stanford.edu/entries/pragmatism/", "passage_text": "For much of the twentieth century, pragmatism was largely in eclipse. Few philosophers were familiar with the works of classical pragmatists such as Charles Sanders Piece and William James, and pragmatist ideas were not at the centre of debate. Most of this entry is devoted to the ideas of the classical pragmatists, Peirce, James, and Dewey. But towards the end of the entry we shall explore what are sometimes called ‘the new pragmatists’. These are philosophers who revitalized pragmatism, developing ideas that evidently belonged to the pragmatist tradition."}]