[{"url": "http://www.cnsnews.com/news/article/terence-p-jeffrey/cbo-cost-obamacare-subsidy-will-increase-8-fold-10-years", "passage_text": "In 2024, the last year in the CBO estimates, the Obamacare subsidies will increase to $137 billion. The combined $707 billion that the federal government will spend on Medicaid and Obamacare subsidies in 2024 is roughly equal to the $716 billion the CBO estimates the government will spend on national defense that year. Follow."}, {"url": "http://www.rpc.senate.gov/policy-papers/yes-obamacare-will-make-premiums-go-up", "passage_text": "1 Cadillac Tax. 2  The health care law institutes a 40 percent “Cadillac tax” on generous employer-sponsored health insurance starting in 2018. 3  The $111 billion tax is levied on plans that cost more than $10,200 for individuals and $27,500 for families."}, {"url": "http://www.cnsnews.com/news/article/terence-p-jeffrey/cbo-cost-obamacare-subsidy-will-increase-8-fold-10-years", "passage_text": "In fiscal 2014, the first year of the Obamacare exchanges, the federal government will spend $17 billion on subsidies for people who buy their insurance there. By 2023, the tenth year of the exchanges, the federal government will be spending $134 billion on subsidies for people buying"}, {"url": "http://useconomy.about.com/od/healthcarereform/a/Cost-of-Obamacare.htm", "passage_text": "By Kimberly Amadeo. The cost of Obamacare to the nation can be very confusing, as estimates range from $1.76 trillion to savings of $143 billion over the next decade. And then there's President Obama's initial claim that the Patient Protection and Affordable Care Act (ACA) would cost $940 billion."}, {"url": "http://www.cnsnews.com/news/article/terence-p-jeffrey/cbo-cost-obamacare-subsidy-will-increase-8-fold-10-years", "passage_text": "By 2023, the tenth year that the Obamacare exchanges will be in operation, Medicaid will cost the federal government $539 billion—more than double the $265 billion it cost in 2013. By 2024, the last year in the CBO estimates, Medicaid spending will climb to $570 billion."}, {"url": "http://www.economist.com/blogs/democracyinamerica/2013/06/implementing-obamacare", "passage_text": "That will be the greater of $695 per uninsured person, or 2.5% of household income over the filing threshold, which is not yet set, but this year was about $10,000 for individuals. So in Nicole's case, that's 2.5% of $20,000, which is only $500. So she's on the hook for $695."}, {"url": "https://www.debt.org/medical/obamacare/", "passage_text": "The original 10-year cost estimate for ObamaCare, made in 2010, was $940 billion. In 2012, the Congressional Budget Office (CBO) updated that amount to $1.8 trillion for the period between 2012-2022, offset in part by $510 billion in receipts and cost savings."}, {"url": "http://www.huffingtonpost.com/2014/04/14/cbo-obamacare-report_n_5146896.html", "passage_text": "The cost of the health care law is falling, according to the CBO. Between 2015 and 2024, the price tag of Obamacare will be $1.383 trillion, $104 billion lower than prior estimates."}]