[{"url": "http://www.buildingpermits.com.au/permits/building-permit", "passage_text": "Provided that all compliance issues are met and relevant documents provided, a Building Permit may be issued within 5 working days for smaller projects. Larger jobs will vary according to the project size and complexity however our team will always be on hand to work with you to meet your important deadlines."}, {"url": "http://www.roundrocktexas.gov/faq/how-long-does-it-take-to-get-a-building-permit/", "passage_text": "By cityofroundrock. The time it takes to get a building permit depends on the type of permit. Generally residential permits are issued in 1-5 days. Commercial projects take a little more time. Three to four weeks is the typical time frame. Some permits are issued immediately."}, {"url": "http://www.roundrocktexas.gov/faq/how-long-does-it-take-to-get-a-building-permit/", "passage_text": "The time it takes to get a building permit depends on the type of permit. Generally residential permits are issued in 1-5 days. Commercial projects take a little more time. Three to four weeks is the typical time frame. Some permits are issued immediately."}, {"url": "http://www.homeadvisor.com/cost/architects-and-engineers/get-a-building-permit/", "passage_text": "Building permits are needed for more than just new home construction. The national average cost of a building permit is $853, with most homeowners spending between $366 and $1,340. This data is based on actual project costs according to HomeAdvisor members."}, {"url": "http://www.seattle.gov/dpd/permits/permittypes/constructionnewbuildsingle/default.htm", "passage_text": "The time it takes to get your permit depends on how complex your project is, how many corrections you need to make to your plans, and how quickly and completely you respond to plan review comments. We try to finish our initial review of simple buildings (such as a typical new home) in about 2 weeks."}, {"url": "http://www.city.waltham.ma.us/building-department/faq/how-long-does-it-take-to-get-a-permit", "passage_text": "The processing time for permit requests will vary with the type of permit requested. Some permits may be issued immediately by the inspector when no plans are required. Permits requiring plan review can take from 1 to 30 days, depending on the complexity of the plans and the work load in the permit office."}]