[{"url": "http://www.businesswire.com/news/home/20040903005085/en/Publix-Super-Markets-Selects-HP-Point-of-sale-In-store", "passage_text": "Publix, one of the largest and fastest-growing supermarket chains in the United States, also will deploy other industry-standard retail solutions from HP at its chain of 800-plus supermarket stores in Florida, Georgia, South Carolina, Alabama and Tennessee. The company also selected HP ProLiant servers to support expanding pharmacy operations. In addition, HP will continue to provide notebooks, desktop PCs, monitors and servers for a variety of corporate uses across the Publix enterprise."}, {"url": "http://smallbusiness.chron.com/pos-systems-work-41627.html", "passage_text": "Thinkstock/Comstock/Getty Images. A POS, or point of sale, system can help reduce your paperwork, track inventory and market to your customers through one easy-to-use process, making more time for you to manage your business rather than staying bogged down in details. "}, {"url": "https://posnation.com/", "passage_text": "Finally, a POS System That Fits Your Business. Your search for the perfect POS system is over. POS Nation recognizes that retail store, restaurant, and specialty store owners need a point of sale specifically tailored to their unique businesses. That’s why we sell more than POS systems – we sell complete point of sale solutions."}, {"url": "http://dept.sfcollege.edu/business/susan.crosson/Fall%202011/Fall%202011%20Annual%20Report%20Projects/MMB.Publix%5B1%5D.pdf", "passage_text": "Stock Market Info.  Publix is the Largest employees-owned retail grocery chain in the United States. Publix stock is only available for sale to eligible active employees and non-employee members of its Board of Directors. "}, {"url": "http://www.answers.com/Q/Does_Publix_have_an_electronic_check_system", "passage_text": "Publix uses HP RP5000 series hardware combined with Retalix  StoreLine POS software. Printers are the Epson TM-H6000II, III, and  IV series (depending on installation date). "}, {"url": "https://en.wikipedia.org/wiki/Publix", "passage_text": "Publix Super Markets, Inc. , commonly known as Publix, is an employee-owned, American supermarket chain based in Lakeland, Florida. Publix operates throughout the Southeast, with locations in Florida (764), Georgia (182), Alabama (59), South Carolina (53), Tennessee (38), and North Carolina (10). Founded in 1930 by George W. Jenkins, Publix is a private corporation that is wholly owned by present and past employees. Publix's current stock price is $42.00 per share, though stock in the company is only available for purchase by eligible active employees and non-employee members of its Board of Directors."}, {"url": "http://www.answers.com/Q/What_point_of_sale_system_does_Publix_Supermarkets_use", "passage_text": "Making the world better, one answer at a time. Publix uses HP RP5000 series hardware combined with Retalix StoreLine POS software. Printers are the Epson TM-H6000II, III, and IV series (depending on installation date). Touch and non-touch monitors are from NEC. There's no Publix in Michigan it's in the south in *Florida, Georgia, North/South Carolina, and I believe Alabama but not positive. *Publix originated in Orlando, Fl. The 1st … Publix was located in what is now Thorton Park in Downtown Orlando's Historic District"}, {"url": "http://www.posmatic.com/point-of-sale/what-is-point-of-sale.php", "passage_text": "And Why it is Essential for a Retail Business. POS or PoS is an abbreviation for Point of Sale (or Point-of-Sale, or Point of Service). The term is applicable to a retail shop or store, the checkout/cashier counter in the store, or a location where such transactions can occur in this type of environment. Point of Sale (POS) Technology. The term Point of Sale is often used in connection or relative with the hardware and software for checkouts. In the case of some locations, with wireless capable systems or network wired via TCP/IP."}, {"url": "https://en.wikipedia.org/wiki/Publix", "passage_text": "In 2011, Publix announced they would be moving into the North Carolina market, first opening stores in Charlotte, North Carolina, and later announced construction of a new store in Asheville, North Carolina. Publix's current stock price is $42.00 per share, though stock in the company is only available for purchase by eligible active employees and non-employee members of its Board of Directors."}]