[{"url": "https://en.wikipedia.org/wiki/Lockheed_Martin", "passage_text": "Lockheed Martin abandoned plans for a $8.3 billion merger with Northrop Grumman on July 16, 1998, due to government concerns over the potential strength of the new group; Lockheed/Northrop would have had control of 25% of the Department of Defense's procurement budget. In May 2001, Lockheed Martin sold Lockheed Martin Control Systems to BAE Systems. On November 27, 2000, Lockheed completed the sale of its Aerospace Electronic Systems business to BAE Systems for $1.67 billion, a deal announced in July 2000."}, {"url": "https://en.wikipedia.org/wiki/Lockheed_Martin", "passage_text": "In January 2011, Lockheed Martin agreed to pay the US Government $2 million to settle allegations that the company submitted false claims on a U.S. government contract for that amount. The allegations came from a contract with the Naval Oceanographic Office Major Shared Resource Center in Mississippi. In May 2001, Lockheed Martin sold Lockheed Martin Control Systems to BAE Systems. On November 27, 2000, Lockheed completed the sale of its Aerospace Electronic Systems business to BAE Systems for $1.67 billion, a deal announced in July 2000."}, {"url": "https://en.wikipedia.org/wiki/Lockheed_Martin", "passage_text": "In 2013, 78% of Lockheed Martin's revenues came from military sales; it topped the list of US federal government contractors and received nearly 10% of the funds paid out by the Pentagon. In May 2001, Lockheed Martin sold Lockheed Martin Control Systems to BAE Systems. On November 27, 2000, Lockheed completed the sale of its Aerospace Electronic Systems business to BAE Systems for $1.67 billion, a deal announced in July 2000."}, {"url": "http://www.dividend.com/dividend-stocks/industrial-goods/aerospace-defense-products-and-services/lmt-lockheed-martin/", "passage_text": "Payments... Lockheed Martin (LMT) is the largest defense contractor in the United States. It has a balanced portfolio that services the Army, Navy, Air Force, and IT programs. LMT’s most important project is the F-35 program, which by itself accounted for 17%... Lockheed Martin Corporation Misses Earnings Estimates (LMT). Before the opening bell on Tuesday morning, Lockheed Martin (LMT) reported its fourth quarter results, posting strong gains in revenues and earnings compared to last year’s Q4."}, {"url": "http://www.lockheedmartin.com/us/employees/retirement/faq.html", "passage_text": "If you can’t find the answer to your question online, contact the Lockheed Martin Employee Service Center toll-free at 866-562-2363. You can also use the “Contact Us” or “Click to Chat” features found on the LM Employee Service Center homepage. Understanding Your New Retirement Benefits. 38. "}, {"url": "http://www.indeed.com/cmp/Lockheed-Martin/salaries", "passage_text": "The average Lockheed Martin salary ranges from approximately $15,000 per year for Electronic Associate to $250,000 per year for Site Manager. Average Lockheed Martin hourly pay ranges from approximately $7.93 per hour for Janitor to $70.00 per hour for Mechanical Designer. Salary information comes from 1,914 data points collected directly from employees, users, and jobs on Indeed."}, {"url": "http://www.payscale.com/research/US/Employer=Lockheed_Martin_Corp/Salary", "passage_text": "About: Lockheed Martin (NYSE: LMT) is an American global aerospace, defense, security, and advanced technology company with worldwide interests. It was formed by the merger of Lockheed Corporation with Martin Marietta in March 1995. It is headquartered in Bethesda, Maryland, in the Washington Metropolitan Area. Lockheed Martin employs 123,000 people worldwide. Robert…."}, {"url": "http://www.simplyhired.com/salaries-k-lockheed-martin-jobs.html", "passage_text": "Average Lockheed Martin Salaries. The average salary for lockheed martin jobs is $66,000. Average lockheed martin salaries can vary greatly due to company, location, industry, experience and benefits. This salary was calculated using the average salary for all jobs with the term lockheed martin anywhere in the job listing. "}]