[{"url": "http://www.webmd.com/a-to-z-guides/sinus-x-ray-for-sinusitis", "passage_text": "Why It Is Done. An X-ray of the sinuses may sometimes be used to confirm a suspected diagnosis of acute sinusitis. An X-ray of the sinuses was formerly the standard method of diagnosing acute sinusitis in the sinuses behind the cheeks (maxillary sinuses) or behind the eyebrows (frontal sinuses). What To Think About. 1  X-rays of the sinuses may be unreliable in diagnosing sinusitis in babies under 1 year of age. 2  The sinus cavities are not completely developed in children. 3  A partly developed sinus on X-ray can look like it is infected."}, {"url": "http://www.healthcaremagic.com/search/both-maxillary-frontal-sinuses-are-hazy-due-to-mucosal-thickening-meaning", "passage_text": "Hi. thanks for writing in to HCM Sinus means a cavity or space that is connected to the surface with a tract (e.g paranasal sinuses like frontal sinus, maxillary sinus). Infection of the sinus or sinus tract is called sinusitis. Hope you are satisfied with my answer. Mild maxillary sinus mucosal thickening 3. Thickening of the mucosa of the right, middle ...I had a CT scan of my paranasal sinuses today, due to chronic cough for 7mos and I also have ... my daughter is 3 yrs old (i) Mucosal thickening is seen in both maxillary sinuses .S/O Sinusitis."}, {"url": "http://www.mypacs.net/cases/PENETRATION-LARYNGEAL-VESTIBULE-DURING-SWALLOWING--5463138.html", "passage_text": "Sinus Films. 1. Bony protrusion of lateral aspect of the nose. This may present an osteoma or other bony lesion. The appearance of this density is suggestive of a nonaggressive lesion. 2. Mild hazy opacification suspected over the maxillary antra bilaterally which may represent mucosal thickening secondary to chronic sinusitis. "}, {"url": "https://en.wikipedia.org/wiki/Maxillary_sinus", "passage_text": "The sinus is lined with mucoperiosteum, with cilia that beat toward the ostia. This membrane is also referred to as the  Schneiderian Membrane , which is histologically a bilaminar membrane with ciliated columnar epithelial cells on the internal (or cavernous) side and periosteum on the osseous side. The floor is formed by the alveolar process of the maxilla, and, if the sinus is of an average size, is on a level with the floor of the nose; if the sinus is large it reaches below this level."}, {"url": "http://medical-dictionary.thefreedictionary.com/ethmoid+sinusitis", "passage_text": "As a result, the mucous membranes in the nasal passage swell, and the channels from the nose to the sinus cavities can be blocked; characterized by pain, pressure, fever, headache, local tenderness, and an increase of sinus secretions. Sinusitis. When sinusitis is suspected as the cause of such symptoms, the health care provider may use a light to evaluate the patency of the sinuses. A bright light is held against the forehead and cheeks to determine the amount of light transmitted through the sinuses in these areas."}, {"url": "https://en.wikipedia.org/wiki/Maxillary_sinus", "passage_text": "The pyramid-shaped maxillary sinus (or antrum of Highmore) is the largest of the paranasal sinuses, and drains into the middle meatus of the nose. The floor is formed by the alveolar process of the maxilla, and, if the sinus is of an average size, is on a level with the floor of the nose; if the sinus is large it reaches below this level."}, {"url": "http://www.healthcaremagic.com/search/both-maxillary-frontal-sinuses-are-hazy-due-to-mucosal-thickening-meaning", "passage_text": "Both maxillary frontal sinuses are hazy due to mucosal thickening meaning. Premium Questions. hyperattenuating blood product is also noted within the left maxillary sinus. This is seen in the context of mild left-sided mucosal thickening. High-grade soft tissue opacification is noted within the right maxillary ... Mild maxillary sinus mucosal thickening 3. Thickening of the mucosa of the right, middle ...I had a CT scan of my paranasal sinuses today, due to chronic cough for 7mos and I also have ... my daughter is 3 yrs old (i) Mucosal thickening is seen in both maxillary sinuses .S/O Sinusitis."}, {"url": "http://www.webmd.com/a-to-z-guides/sinus-x-ray-for-sinusitis", "passage_text": "Sinus X-Ray for Sinusitis. Guide. A sinus X-ray is a series of pictures of nasal sinus cavities. X-rays are a form of radiation, like light or radio waves, that can be focused into a beam, much like a flashlight beam. But unlike a beam of light, X-rays can pass through most objects, including the human body. What To Think About. 1  X-rays of the sinuses may be unreliable in diagnosing sinusitis in babies under 1 year of age. 2  The sinus cavities are not completely developed in children. 3  A partly developed sinus on X-ray can look like it is infected."}]