[{"url": "http://www.nolo.com/legal-encyclopedia/how-much-will-i-get-ssi-disability-benefits.html", "passage_text": "The amount of SSI disability benefits that you'll receive will be different depending on whether you are married, whether your state pays a state supplement that increases your payment, and whether you have any countable income that decreases your payment. The ordinary SSI payment in 2015, without any reductions for income or additions for a state supplement, is $733 for an individual and $1,100 for a couple. From year to year, those amounts, called the “federal base rate,” increase to account for increased costs of living."}, {"url": "http://www.nolo.com/legal-encyclopedia/how-much-will-i-get-ssi-disability-benefits.html", "passage_text": "If you are married to and living with another person who collects SSI, then you will receive the SSI amount for couples, $1,100. Notice that $1,100 is less than you would receive if both spouses collected the full SSI amount for individuals ($733 x 2 = $1,466). The ordinary SSI payment in 2015, without any reductions for income or additions for a state supplement, is $733 for an individual and $1,100 for a couple. From year to year, those amounts, called the “federal base rate,” increase to account for increased costs of living."}, {"url": "http://www.ssdrc.com/disabilityquestions3-69.html", "passage_text": "If an individual is approved to receive disability benefits, how much they will receive in disability pay will depend on several factors. The first and primary consideration is which program the person has been approved to receive disability benefits in. Because social security disability is based on what a person has paid in taxes over the course of their working years, the amount that they receive on a social security retirement check or on a social security disability check will be based on this."}, {"url": "http://www.nolo.com/legal-encyclopedia/how-much-social-security-disability-ssdi-benefits-can-you-get.html", "passage_text": "To give you an idea of what you might receive, for 2015, the average SSDI benefit amount is $1,165 per month, but you can receive anywhere up to $2,663. If you're interested in how Social Security calculates your AIME and PIA, here's how. (Social Security Disability Insurance (SSDI) is the federal insurance program that provides benefits to qualified workers who can no longer work. To be eligible, you must be insured under the program and meet the Social Security Administration's (SSA’s) definition of disabled."}, {"url": "http://www.disabilitysecrets.com/page4-44.html", "passage_text": "Everyone on SSI disability (Supplemental Security Income) is eligible for the same base amount, $733. But your actual monthly SSI payment will depend on whether you have any countable income, whether you are married, and what state you live in. But most importantly, your actual monthly payment will depend on how much income you or your family brings in or earns and how much of a state supplemental payment (SSP) your state pays, if any."}, {"url": "http://www.nolo.com/legal-encyclopedia/how-much-will-i-get-ssi-disability-benefits.html", "passage_text": "Your SSI payment will be reduced by the amount of any income that you have, except for certain amounts that Social Security may disregard. In particular, Social Security disregards the first $20 of any monthly income, and the first $65 of any earned income (wages from work or self-employment income). The ordinary SSI payment in 2015, without any reductions for income or additions for a state supplement, is $733 for an individual and $1,100 for a couple. From year to year, those amounts, called the “federal base rate,” increase to account for increased costs of living."}, {"url": "http://www.nolo.com/legal-encyclopedia/how-much-social-security-disability-ssdi-benefits-can-you-get.html", "passage_text": "Enter Your Zip Code to Connect with a Lawyer Serving Your Area. How much your Social Security disability benefit will be is based on your covered earnings -- the wages that you paid Social Security taxes on -- prior to becoming disabled. (Social Security Disability Insurance (SSDI) is the federal insurance program that provides benefits to qualified workers who can no longer work. To be eligible, you must be insured under the program and meet the Social Security Administration's (SSA’s) definition of disabled."}, {"url": "http://www.unum.com/Employees/FAQs/DisabilityFAQ.aspx", "passage_text": "A The length of time you can receive short term disability benefits varies, depending on the policy and how long you are unable to work. At the end of your short term disability duration, long term disability coverage can kick in — if you have this coverage. A Short term disability benefits can pay a portion of your income if you can’t work for several weeks due to a covered injury or illness — or childbirth."}, {"url": "http://www.disabilitysecrets.com/how-much-in-ssd.html", "passage_text": "Share on Google Plus. If you are eligible for Social Security Disability Insurance (SSDI, or sometimes just SSD) benefits, the amount you receive each month will be based on your average lifetime earnings before your disability began. It is not based on how severe your disability is or how much income you have. Most SSDI recipients receive between $700 and $1,700 per month (the average for 2015 is $1,165). However, if you are receiving disability payments from other sources, as discussed below, your payment may be reduced"}, {"url": "http://www.alllaw.com/articles/nolo/disability/collecting-payments.html", "passage_text": "How much your monthly disability check will be depends on whether you'll receive Social Security Disability (SSD) or Supplemental Security Income (SSI). SSD is for workers who are insured under the Social Security retirement system. If you earn more than that amount, Social Security will give you a trial work period of nine months to see if your return to work will be permanent. After that period if up, your benefits will be terminated if you earn more than the SGA amount."}]