[{"url": "http://what-does-my-name-mean.org/name/douglas/", "passage_text": "Douglas-It is of Scottish and Gaelic origin, and its meaning is black river. One from the darkside, fearless leader,one whos strength lies real deep. One who can overcome all problems without help. 1800's men named Douglas were considered to be invulnerable during wars. From the black or dark waters; seeker of light. Douglas-It is of Scottish and Gaelic origin, and its meaning is black river. 44: vote up - 4: vote down"}, {"url": "http://www.behindthename.com/name/douglas", "passage_text": "PRONOUNCED: DUG-ləs [key]. Meaning & History. Anglicized form of the Scottish surname Dubhghlas, meaning dark river from Gaelic dubh dark and glais water, river. Douglas was originally a river name, which then became a Scottish clan name (belonging to a powerful line of Scottish earls). It has been used as a given name since the 16th century. Related Names."}, {"url": "http://www.ourbabynamer.com/meaning-of-Douglas.html", "passage_text": "What does Douglas mean, popularity, numerology and more. The name Douglas is of Scottish and English origin. The meaning of Douglas is dark water, black stream. "}, {"url": "http://www.sheknows.com/baby-names/name/douglas", "passage_text": "Scottish Meaning: The name Douglas is a Scottish baby name. In Scottish the meaning of the name Douglas is: From the Gaelic 'dubhglas' meaning dark water, dark stream, or from the dark river. The name Douglas is an Anglo-Saxon baby name. In Anglo-Saxon the meaning of the name Douglas is: Dweller by the dark stream. American Meaning: The name Douglas is an American baby name. In American the meaning of the name Douglas is: Dweller by the dark stream. Irish Meaning: The name Douglas is an Irish baby name. In Irish the meaning of the name Douglas is: Dark stranger. English Meaning: The name Douglas is an English baby name. In English the meaning of the name Douglas is: Dark water. In the seventeenth century, this name was as popular for girls as for boys. Celtic Meaning: The name Douglas is a Celtic baby name. In Celtic the meaning of the name Douglas is: Dwells by the dark stream"}, {"url": "http://www.urbandictionary.com/define.php?term=Douglas", "passage_text": "Douglas. A very old name, from the 16th century, Scottish in origin, meaning from the dark river.. A man who has deep insights, mystical powers and isn't afraid to explore both the dark and light sides of life, seeing them as all one. A person of great understanding, having wisdom that accrues with age."}, {"url": "http://www.answers.com/Q/What_is_the_Biblical_meaning_of_the_name_Douglas", "passage_text": "Confidence votes 1.8K. The River Douglas is in Scotland. The name of the river is from the old Gaelic words for black water. People who lived near the river took it as their surname (the people from Douglas) and it moved from being a surname to being a given name. Note that in the sixteenth century it was used for girls as well as boys, although nowadays it is exclusively masculine. In the Old Testament this was the name of a son of Lot. He was the ancestor of the Moabites, a people who lived in the region called Moab to t … he east of Israel."}, {"url": "https://en.wikipedia.org/wiki/Douglas_(given_name)", "passage_text": "Douglas (/ˈdʌɡləs/ DUG-ləs) is a Scottish masculine given name which originated from the surname Douglas. Although today the name is almost exclusively given to boys, it was used as girls name in the 17th and 18th centuries, in the north of England. The Scottish surname Douglas was borne by one of the most powerful families of the Kingdom of Scotland (the Earls of Douglas, Angus, Morton, Dukes of Hamilton and others)."}, {"url": "http://www.thinkbabynames.com/meaning/1/Douglas", "passage_text": "Douglas /dou-glas/ [2 sylls.] as a boys' name is pronounced DUG-less. It is of Scottish and Gaelic origin, and the meaning of Douglas is black river. Place name. Historical: there were two branches of this powerful Scottish clan and family-the Black Douglases and the Red Douglases."}]