[{"url": "http://www.telegraph.co.uk/news/worldnews/middleeast/oman/9952970/Muammar-Gaddafis-family-take-refuge-in-Oman.html", "passage_text": "Muammar Gaddafi's family, clockwise from top left: wife Safia, his sons Hannibal and Mohammad and his daughter Aisha Photo: AFP/GETTY. By Damien McElroy, Foreign Affairs Correspondent. Safia Gaddafi, the dictator's widow and three of his children left a hideaway in Algeria last October, more than a year after they crossed the border from Libya."}, {"url": "http://www.bbc.co.uk/news/world-africa-25979532", "passage_text": "Since Muammar Gaddafi's ignominious death at the hands of a rebel mob in October 2011 much has been written and said about him. But now a new film, with unprecedented access to those close to Gaddafi, provides a comprehensive study of Libya's brutal and contradictory long-time leader."}, {"url": "http://www.bbc.com/news/world-africa-26462400", "passage_text": "The Libyan government received today Saadi Gaddafi and he arrived in Tripoli, the Libyan government said in a statement early on Thursday. Two security sources later confirmed to the BBC's Rana Jawad that Saadi Gaddafi had been returned and was now in the hands of the Libyan judicial authorities. Lawyer Nick Kaufman, who has previously represented Saadi and other Gaddafi family members, criticised the move, calling it a rendition. The Libyan government says former leader Col Muammar Gaddafi's son, Saadi, has been extradited from Niger and is now in custody in Tripoli. Pictures posted on the internet showed him having his head and beard shaved."}, {"url": "http://www.dailymail.co.uk/news/article-1361919/Muammar-Gaddafi-familys-astonishing-wealth-revealed.html", "passage_text": "Crisis: Thousands of refugees try to flee Libya over the Tunisian border today. The Gaddafi family's assets have been frozen in a bid to force the tyrant out of power. In all, six of the Gaddafi family have had their assets frozen-including Saif's brothers Hannibal, Khamis and Mutassim, and his sister Aisha. Switzerland was one of the first countries to freeze the assets, making the announcement a week ago. "}, {"url": "http://www.aljazeera.com/news/africa/2011/09/20119115515548681.html", "passage_text": "The family that ruled Libya till only recently now finds itself on the run. Roxanne Horesh |. | Africa, Libya. The family that ruled Libya until only very recently now finds itself on the run. Besides leading Libya for more than four decades until he was deposed, Muammar Gaddafi also headed a large family. Here is a look at members of his immediate family. Here is a look at their roles and relations. Roxanne Horesh |. | Africa, Libya. The family that ruled Libya until only very recently now finds itself on the run. Besides leading Libya for more than four decades until he was deposed, Muammar Gaddafi also headed a large family."}, {"url": "http://www.thetimes.co.uk/tto/news/world/middleeast/article3730151.ece", "passage_text": "The widow and children of the late Muammar Gaddafi are living in luxury while under house arrest in the Gulf state of Oman after being thrown out of their former refuge in Algeria, it is alleged. "}, {"url": "http://world.time.com/2013/03/25/the-case-of-the-disappearing-gaddafis/", "passage_text": "The aftermath of the fall of Libya ’s Muammar Gaddafi continues to generate drama. The current mystery is the disappearance of four family members from Libya’s neighbor Algeria. "}, {"url": "http://www.abc.net.au/7.30/content/2013/s3729270.htm", "passage_text": "Gary Peters lived in Canada, but worked for the Libyan rulers for more than a decade. And as the rebel forces closed in two years ago, he helped Saadi Gaddafi escape across the border. Now, for his links with the family, Mr Peters has been deported by Canada and found complicit in war crimes. LEIGH SALES, PRESENTER: When the Libyan regime of Colonel Gaddafi fell in 2011, the dictator's family fled far and wide. They were helped by an Australian man, a former soldier-turned-bodyguard and a friend of the colonel's son, Saadi Gaddafi."}]