[{"url": "http://www.youtube.com/watch?v=-542IYGBbpg", "passage_text": "Published on Sep 27, 2013. This video show the proper us of dielectric grease on spark plug wires. It also shows where not to use the grease, and the problems you might experience with improper use of di-electric grease. Lectric Limited includes a free tube of dielectric grease in all our reproduction and replacement spark plug wire sets. "}, {"url": "http://www.wisegeek.org/what-is-dielectric-grease.htm", "passage_text": "You won't believe these 10 facts about people. Dielectric grease is a non-conductive, silicone-based grease that's designed to seal out moisture and prevent corrosion on electrical connectors. It also disrupts the flow of electrical current, which makes it good for lubricating and sealing the rubber parts of electrical connectors. Post 14. I've watched marina electricians dab dielectric grease into the wire hole on crimp-on terminals, and on the stripped end of the wire that is going into the aforementioned crimp-on terminal, then the wire and the terminal are crimped together."}, {"url": "http://www.w8ji.com/dielectric_grease_vs_conductive_grease.htm", "passage_text": "I continue to use silicone dielectric grease today. I use it as a lubricant on coaxial connector O-rings and threads. I use it to lube stainless bolts and nuts, to prevent galling. I use it for plug-in connections, in particular in my automotive hobby. Some complaints claim dielectric grease is conductive or abrasive, containing silica that increases wear. (It doesn't contain silica). The most frequent Internet complaint is that dielectric grease insulates connections, making connections less conductive. The general basis for this claim is in the word dielectric used in the name. The word dielectric is assumed to mean the connection will have future problems because dielectrics are insulators"}, {"url": "http://www.qwhatis.com/what-is-dielectric-grease/", "passage_text": "Dielectric grease is a special type of grease which is most commonly used for lubricating purposes. Dielectric grease is neutral in nature. It resists corrosion to a certain extent. It acts by restricting the entry of water and other agents into the electrical connector. It resembles the petroleum jelly Vaseline in general appearance. It acts as a block between the surfaces. Dielectric grease also prevents condensation. The use of dielectric grease should be avoided in heavy bearings. The advantage of using this grease is that it provides lubrication without conducting electricity. Dielectric grease is grey in color and insoluble in water."}, {"url": "http://www.wisegeek.org/what-is-dielectric-grease.htm", "passage_text": "Uses. Dielectric grease is widely used as a sealant for spark plugs in gasoline or diesel engines, as well as on the gaskets of multi-pin connectors in the electrical systems of vehicles and boats. When used with spark plugs, it's applied to the rubber part of the plug wire. Post 14. I've watched marina electricians dab dielectric grease into the wire hole on crimp-on terminals, and on the stripped end of the wire that is going into the aforementioned crimp-on terminal, then the wire and the terminal are crimped together."}, {"url": "https://en.wikipedia.org/wiki/Silicone_grease", "passage_text": "Another common use of dielectric grease is on the rubber mating surfaces or gaskets of multi-pin electrical connectors used in automotive and marine engines. The grease again acts as a lubricant and a sealant on the nonconductive mating surfaces of the connector. A common use of dielectric grease is in high-voltage connections associated with gasoline engine spark plugs. The grease is applied to the rubber boot of the plug wire. This helps the rubber boot slide onto the ceramic insulator of the plug."}, {"url": "http://www.w8ji.com/dielectric_grease_vs_conductive_grease.htm", "passage_text": "One incorrect logic is the dielectric in dielectric grease means the grease should only be used to insulate. All greases work by the low viscosity allowing the grease to completely push out of areas with metal-to-metal contact. Some complaints claim dielectric grease is conductive or abrasive, containing silica that increases wear. (It doesn't contain silica). The most frequent Internet complaint is that dielectric grease insulates connections, making connections less conductive. The general basis for this claim is in the word dielectric used in the name. The word dielectric is assumed to mean the connection will have future problems because dielectrics are insulators"}, {"url": "http://www.youtube.com/watch?v=yuKAmaIkA-U", "passage_text": "Dielectric grease is widely used as a sealant for spark plugs in gasoline or diesel engines, as well as on the gaskets of multi-pin connectors in the electrical systems of vehicles and boats. When used with spark plugs, it's applied to the rubber part of the plug wire. "}]