[{"url": "https://en.wikipedia.org/wiki/Beekeeper", "passage_text": "Most beekeepers are hobby beekeepers. These people typically work or own only a few hives. Their main attraction is an interest in ecology and natural science. Honey is a by-product of this hobby. The term beekeeper refers to a person who keeps honey bees in beehives, boxes, or other receptacles. Honey bees are not domesticated and the beekeeper does not control the creatures. The beekeeper owns the hives or boxes and associated equipment. The bees are free to forage or leave (swarm) as they desire."}, {"url": "https://en.wikipedia.org/wiki/Beekeeping", "passage_text": "Beekeeping, or apiculture, is concerned with the practical management of the social species of honey bees, which live in large colonies of up to 100,000 individuals. In Europe and America the species universally managed by beekeepers is the Western honey bee (Apis mellifera). Top bar hives were originally used as a traditional beekeeping method in Greece and Vietnam. These hives have no frames and the honey-filled comb is not returned after extraction, as it is in the Langstroth hive. Because of this, the production of honey is likely to be somewhat less than that of a"}, {"url": "https://en.wikipedia.org/wiki/Beekeeping", "passage_text": "Beekeeping (or apiculture, from Latin: apis  bee ) is the maintenance of honey bee colonies, commonly in hives, by humans. Top bar hives were originally used as a traditional beekeeping method in Greece and Vietnam. These hives have no frames and the honey-filled comb is not returned after extraction, as it is in the Langstroth hive. Because of this, the production of honey is likely to be somewhat less than that of a"}, {"url": "http://www.simple-green-living.com/what-is-beekeeping-called.html", "passage_text": "On the forums they have a section called How To Start Beekeeping and another called Beekeeping 101. If you want to find a bee club in your area, the be esource.com website also has a section titled Associations & Societies which will help you connect with a local group of. The market demand schedule on the assumption that the good is a private good, and (b) the collective demand schedule on the assumption Why are spillover costs and spillover benefits also called negative leading to an underallocation of resources to both applegrowing and beekeeping. Timber."}, {"url": "https://en.wikipedia.org/wiki/Beekeeper", "passage_text": "A beekeeper is a person who keeps honey bees (i.e. practices beekeeping). Honey bees produce commodities such as honey, beeswax, pollen, and royal jelly, while some beekeepers also raise queens and bees to sell to other farmers, and to satisfy scientific curiosity. The term beekeeper refers to a person who keeps honey bees in beehives, boxes, or other receptacles. Honey bees are not domesticated and the beekeeper does not control the creatures. The beekeeper owns the hives or boxes and associated equipment. The bees are free to forage or leave (swarm) as they desire."}, {"url": "http://www.simple-green-living.com/what-is-beekeeping-called.html", "passage_text": "Langstroth is called the father of modern beekeeping.. In the period between the importation of honey imported Italian queen bees for sale at $20 each. He promised to sell medium-sized colonies of bees, with imported queens, in movable comb hives for. The market demand schedule on the assumption that the good is a private good, and (b) the collective demand schedule on the assumption Why are spillover costs and spillover benefits also called negative leading to an underallocation of resources to both applegrowing and beekeeping. Timber."}, {"url": "https://en.wikipedia.org/wiki/Beekeeping", "passage_text": "A location where bees are kept is called an apiary or bee yard. Depictions of humans collecting honey from wild bees date to 15,000 years ago; efforts to domesticate them are shown in Egyptian art around 4,500 years ago. Top bar hives were originally used as a traditional beekeeping method in Greece and Vietnam. These hives have no frames and the honey-filled comb is not returned after extraction, as it is in the Langstroth hive. Because of this, the production of honey is likely to be somewhat less than that of a"}, {"url": "http://www.answers.com/Q/What_is_a_group_of_bees_called", "passage_text": "A group of bees is called a swarm, grist or hive, or a colony. There are also other names for a group of bees such as: A bike of bees. A cluster of bees. A cast of bees. A drift of bees. An erst of bees. A game of bees. A rabble of bees. "}, {"url": "https://en.wikipedia.org/wiki/Beekeeper", "passage_text": "Beekeepers are also called honey farmers, apiarists, or less commonly, apiculturists (both from the Latin apis, bee; cf. apiary). The term beekeeper refers to a person who keeps honey bees in beehives, boxes, or other receptacles. Honey bees are not domesticated and the beekeeper does not control the creatures. The beekeeper owns the hives or boxes and associated equipment. The bees are free to forage or leave (swarm) as they desire."}, {"url": "http://www.beehives.info/beekeeping/", "passage_text": "Beekeeping, also known as Apiculture is the maintenance of Beehives by Humans. The person who maintains the beehives and collects the Bee products or sells the bees to another person is called the Beekeeper. Bees are kept in a location called the Beehive or an apiary. Beekeeping also includes producing cross-breeds, protecting bees from diseases, along with honey productivity. History and Origin of Beekeeping. Collecting honey from bee hives has been an ancient culture. Primitive man used to collect honey from natural beehives. Today, with more than 20000 species of Honey Bees apiculture has become a complete science."}]