[{"url": "http://www.answers.com/Q/What_does_endocrine_mean", "passage_text": "In physiology, the endocrine system is a system of glands, each of which secretes a type of hormone directly into the bloodstream to regulate the body. The word, endocrine, refers to the internal hormone-producing glandular system of the body. (This is in contradistinction to the word, exocrine, which would refer to sweat glands, for instance.)."}, {"url": "http://www.audioenglish.org/dictionary/endocrine_system.htm", "passage_text": "ductless gland; endocrine; endocrine gland (any of the glands of the endocrine system that secrete hormones directly into the bloodstream). Holonyms (endocrine system is a part of...): body; organic structure; physical structure (the entire structure of an organism (especially an animal or human being)). "}, {"url": "http://www.audioenglish.org/dictionary/endocrine.htm", "passage_text": "• ENDOCRINE (noun). The noun ENDOCRINE has 2 senses: 1. the secretion of an endocrine gland that is transmitted by the blood to the tissue on which it has a specific effect. 2. any of the glands of the endocrine system that secrete hormones directly into the bloodstream. Familiarity information: ENDOCRINE used as a noun is rare. • ENDOCRINE (adjective). "}, {"url": "http://www.answers.com/Q/What_does_the_word_endocrine_means", "passage_text": "Endocrine glands are glands of the endocrine system that secrete  their products, hormones, directly into the blood rather than  through a duct. The endocrine system contain … s glands that release  certain hormones for growth/body functions/body reactions. Confidence votes 5.8K. Endocrine is a word usually used in refference to hormones. It means a sudstance that is produced and sent around the body in the blood. And example of an endocrine hormone is adrenaline/epinephrine which is involved in the autonomic nervous response."}, {"url": "http://www.answers.com/Q/What_does_the_word_endocrine_means", "passage_text": "In physiology, the endocrine system is a system of glands, each of which secretes a type of hormone directly into the bloodstream to regulate the body. Confidence votes 5.8K. Endocrine is a word usually used in refference to hormones. It means a sudstance that is produced and sent around the body in the blood. And example of an endocrine hormone is adrenaline/epinephrine which is involved in the autonomic nervous response."}, {"url": "http://www.answers.com/Q/What_does_endocrine_mean", "passage_text": "Endocrine is a word usually used in refference to hormones. It means a sudstance that is produced and sent around the body in the blood. And example of an endocrine horm … one is adrenaline/epinephrine which is involved in the autonomic nervous response. The word, endocrine, refers to the internal hormone-producing glandular system of the body. (This is in contradistinction to the word, exocrine, which would refer to sweat glands, for instance.)."}, {"url": "http://www.medicinenet.com/script/main/art.asp?articlekey=25210", "passage_text": "Endocrine: Pertaining to hormones and the glands that make and secrete them into the bloodstream through which they travel to affect distant organs. "}, {"url": "http://www.thefreedictionary.com/endocrine", "passage_text": "2. endocrine-any of the glands of the endocrine system that secrete hormones directly into the bloodstream. ductless gland, endocrine gland. gland, secreter, secretor, secretory organ-any of various organs that synthesize substances needed by the body and release it through ducts or directly into the bloodstream. en·do·crine. adj. 1. Secreting internally. 2. Of or relating to endocrine glands or the hormones secreted by them. n. 1. The secretion of an endocrine gland; a hormone."}]