[{"url": "http://smallbusiness.chron.com/statements-purpose-businesses-26026.html", "passage_text": "Your company's statement of purpose shouldn't simply be make money.. The statement of purpose should describe the way in which your small business wants to become successful while carving out a place in the local business community. A statement of purpose focused on function allows your business the flexibility to meet consumer needs regardless of the products your company currently offers for sale."}, {"url": "http://smallbusiness.chron.com/statements-purpose-businesses-26026.html", "passage_text": "The statement of purpose for your small business defines your company's core goals and purpose. According to Web Marketing Today, an Internet marketing website, the statement also forms the basis for your small business's brand and the promises your company intends to make to consumers. A statement of purpose focused on function allows your business the flexibility to meet consumer needs regardless of the products your company currently offers for sale."}, {"url": "http://www.businessnewsdaily.com/3783-mission-statement.html", "passage_text": "When you're coming up with the concept for your business, an important component of your overall strategy plan is a mission statement. This brief statement declares the purpose of an organization and defines the reason for the company's existence. It provides the framework and context to help guide the company's strategies and actions by spelling out the business's overall goal. It is up to the mission statement to set the tone of the company and to outline concrete goals. Here's what business leaders say a mission statement should do for a company: A good vision or mission statement will fill a few roles: It will be toothy enough to engage the media, analysts and other industry watchers."}, {"url": "http://smallbusiness.chron.com/statements-purpose-businesses-26026.html", "passage_text": "A statement of purpose is an integral component of your small business's overall strategic operation plan. This document contains your company's core philosophy and values, from which you measure the worth of all business decisions and strategies. A statement of purpose focused on function allows your business the flexibility to meet consumer needs regardless of the products your company currently offers for sale."}, {"url": "http://smallbusiness.chron.com/statement-purpose-restaurant-18309.html", "passage_text": "A statement of purpose for a restaurant is a statement included in a restaurant business plan or proposal. In some business plans, the statement of purpose is included with the introduction or the description of the business, but this can make the statement less clear to the reader."}, {"url": "http://www.samplestatements.com/small-business-statement.html", "passage_text": "Starting capital: $ 1 million. Purpose of the small business statement: 1  To highlight our goals and how we intend to achieve them. 2  To ensure that we have a reference point to go back to in case of any confusion or dilution of purpose. Leave a reply. A small business statement is a document which outlines the purposes and goals of a small business. Small businesses are those which are often family held, based on comparatively smaller amounts of initial capital, and generally of a small scale and scope."}, {"url": "http://smallbusiness.chron.com/statement-purpose-restaurant-18309.html", "passage_text": "It defines the objectives you have for your restaurant, how you will use your business plan once your business is operational, and answers questions about funding. Everything in your restaurant plan should support your statement of purpose. Similarly, the statement of purpose supports the overall mission statement. In some business plans, the statement of purpose is included with the introduction or the description of the business, but this can make the statement less clear to the reader."}, {"url": "http://articles.bplans.com/mission-statement-examples/", "passage_text": "Mission Statement Examples. The best example of a mission statement will define a company and its purpose in 30 seconds or less. This is an eloquent, concise paragraph that should be full of meaning and impact. With your mission statement, you should be sure to cover what the goals of your business are for three primary components: customers, employees, and owners. Be clear and specific, and you’ll highlight the core of what makes your venture unique and worthwhile."}, {"url": "http://smallbusiness.chron.com/statements-purpose-businesses-26026.html", "passage_text": "Avoid Vague Statements. Just because your small business's statement of purpose doesn't include your company's plans for business operations, doesn't mean you should be vague in crafting its language. A statement of purpose focused on function allows your business the flexibility to meet consumer needs regardless of the products your company currently offers for sale."}]