[{"url": "http://www.definitions.net/definition/Trident", "passage_text": "Trident. A trident, also called a trishula, leister or gig, is a three-pronged spear. It is used for spear fishing and was also a military weapon. Tridents are featured widely in mythical, historical and modern culture. The major Hindu Lord and God Shiva and Greco-Roman sea god Poseidon or the Roman god of the sea Neptune are classically depicted bearing a trident."}, {"url": "http://www.answers.com/Q/What_does_a_trident_tattoo_symbolize", "passage_text": "That's why when a person is called a snake in the grass, it means something bad about that person. The word snake, is used to imply that a person is bad. This is used in many different countries and different cultures around the world."}, {"url": "http://gnosticwarrior.com/trident.html", "passage_text": "In the etymology of the name trident (Latin tridentem, amis, of tridens) we find the two words tri and dent (dens). The meaning of tri is three and the meaning of dent (dens) is tooth. The word dent or dens is where we get the modern English word of dentist."}, {"url": "http://gnosticwarrior.com/trident.html", "passage_text": "The Trident is akin to the symbology of the shepherd's crook in which the shepherd uses the hook of his crook to save fallen animals by ensnaring them by neck or leg. This is why the crook is often used as a religious symbol by the Druids, and by Christian as the bishops crosier."}, {"url": "http://www.oxforddictionaries.com/definition/english/trident", "passage_text": "More. tooth from Old English: An Old English word from an ancient root shared by Latin dens, the source of dental (late 16th century), dentist (mid 18th century), trident (late 16th century) ‘three teeth’, and indent. To fight tooth and nail was in the 16th century to fight with tooth and nail."}, {"url": "http://gnosticwarrior.com/trident.html", "passage_text": "The meaning of the name trident or the Indian Trisula is three-toothed, three-pronged; and as a noun, a three-pronged spear or fork.. Often when you see the symbol of the Trident today, it is usually represented by a three-pronged fork symbolizing power and the holy number three (3), or more appropriately, 3 in 1."}, {"url": "http://www.thefreedictionary.com/trident", "passage_text": "trident. detail of a statue of Britannia outside St. Paul's Cathedral. London, England."}]