[{"url": "http://www.daycor.com/Technology/Corona-phenomenon.html", "passage_text": "Corona discharge is a luminous partial discharge from conductors and insulators due to ionization of the air, where the electrical field exceeds a critical value. A high local electric field ionizes the air and causes a discharge."}, {"url": "http://solarscience.msfc.nasa.gov/corona.shtml", "passage_text": "The White-Light Corona. Click on image for larger version. The Corona is the Sun's outer atmosphere. It is visible during total eclipses of the Sun as a pearly white crown surrounding the Sun. The corona displays a variety of features including streamers, plumes, and loops."}, {"url": "https://en.wikipedia.org/wiki/Corona", "passage_text": "The sun's corona is much hotter (by a factor from 150 to 450) than the visible surface of the Sun: the photosphere 's average temperature is 5800 kelvin compared to the corona's one to three million kelvin. The corona is 10 −12 times as dense as the photosphere, and so produces about one-millionth as much visible light."}, {"url": "http://csep10.phys.utk.edu/astr162/lect/sun/corona.html", "passage_text": "The extended outer atmosphere of the Sun is called the corona. It has a temperature of millions of degrees, but it is 10 billion times less dense than the atmosphere of the Earth at sea level."}, {"url": "https://en.wikipedia.org/wiki/Corona", "passage_text": "A corona (Latin, ' crown ') is an aura of plasma that surrounds the sun and other celestial bodies. The Sun's corona extends millions of kilometres into space and is most easily seen during a total solar eclipse, but it is also observable with a coronagraph."}, {"url": "https://en.wikipedia.org/wiki/Corona", "passage_text": "The corona behaves like a gas which is very hot but very light at the same time: the pressure in the photosphere is usually only 0.1 to 0.6 Pa in active regions, while on the Earth the atmospheric pressure is about 100 kPa, approximatively a million times higher than on the solar surface."}, {"url": "http://ofilsystems.com/technology/corona.html", "passage_text": "Corona discharge is a luminous partial discharge from conductors and insulators due to ionization of the air, where the electrical field exceeds a critical value."}]