[{"url": "http://work.chron.com/much-phlebotomist-make-hourly-6388.html", "passage_text": "These techs earned median wages of $17.76 per hour or $36,950 per year as of May 2011. For phlebotomists specifically, the industry-supported Explore Health Careers website cites a salary range of $25,177 to $30,470 per year, or $12.10 to $14.65 hourly. The best indicator of phlebotomists' incomes is probably the salary survey performed annually by the American Society for Clinical Pathology."}, {"url": "http://www.healthcare-salaries.com/allied-health-professionals/phlebotomist-salary", "passage_text": "The median salary for a phlebotomist in the United States is $27,892, based on PayScale reports. The average salary is $20,605 to $37,814 while the hourly rate is $9.79 to $17.32. The hourly wages vary based on the type of employer, with $12.5 for hospitals, $12.50 for private clinics, and $13 for laboratories. The average yearly salary for phlebotomist in the US with less than a year of experience ranges from $19,727 to $49,493, while those with one to four years of experience $20,180 to $40,462."}, {"url": "http://money.usnews.com/careers/best-jobs/phlebotomist/salary", "passage_text": "Salary Outlook. Phlebotomists made a median salary of $30,150 in 2013, according to the BLS. The highest-paid 10 percent in the profession earned $43,190, while the lowest-paid earned $21,760 that year. Best Paying Cities for Phlebotomists. The highest paid in the phlebotomist profession work in the metropolitan areas of Santa Barbara, California, Vallejo, California, and Merced, California. The Oakland, California area also pays well, as does the city of Stockton"}, {"url": "https://www.bloodtaker.com/phlebotomy-salary/", "passage_text": "Phlebotomy Salary per Hour. According to the U.S. Bureau of Labor Statistics, the average hourly wage was $15.10 in 2013. That mean annual wage was $31,410 for the same year. If you’re starting your career, you can expect between $10.46 and $12.27 hourly and $21,760 and $25,510 annually. For instance, a certified phlebotomy technician will get $15.93, which is more then the median $13.8 a non-certified individual earns. Meanwhile, a certified donor phlebotomist can expect up to $16.51 per hour. As for a certified phlebotomy instructor, they can get $36,00"}, {"url": "http://www.phlebotomistcareer.com/phlebotomist-salaries.php", "passage_text": "Median annual Phlebotomist salaries were about $30,000 in May 2012. The lowest 10 percent earned a Phlebotomist salary of less than about $21,000 and the highest 10 percent earned Phlebotomist pay of more than about $43,000. "}, {"url": "http://work.chron.com/hourly-salary-phlebotomist-2375.html", "passage_text": "The highest-paying state for phlebotomists was California, at an average wage of $23.36 per hour. Illinois was second at $17.10 per hour, followed by Colorado at $16.36 and Minnesota at $15.52. The lowest-paid phlebotomists were in Ohio, at an average of $12.10 per hour. Wisconsin at $12.52, North Carolina at $12.78, Texas at $13.80 and New York at $13.82 round out the lowest-paying states. Related Reading: The Hourly Salary of a Business Manager."}, {"url": "http://www.healthcare-salaries.com/allied-health-professionals/phlebotomist-salary", "passage_text": "The average salary for phlebotomists in South Africa every year is R34,004 to R179,372 with a median salary of R119,830. Bonuses usually range from R4,877 to R92,978. Phlebotomist with one to four years of experience can earn around R34,059 to R137,865. Those who are working in Johannesburg get paid R90,000 to R132,787. The average yearly salary for phlebotomist in the US with less than a year of experience ranges from $19,727 to $49,493, while those with one to four years of experience $20,180 to $40,462."}, {"url": "http://www1.salary.com/Phlebotomist-salary.html", "passage_text": "For example the median expected annual pay for a typical Phlebotomist in the United States is $31,481 so 50% of the people who perform the job of Phlebotomist in the United States are expected to make less than $31,481. Source: HR Reported data as of October 2015. Median $31,481. 1  Salary. "}, {"url": "http://www.phlebotomytrainingspot.com/phlebotomist-salary-and-pay/", "passage_text": "Nationwide Phlebotomist Pay Averages. The average hourly wage in the United States for phlebotomists is $14.29. The average annual wage in the US is $30,900. That wage average is based on the 100,000 phlebotomists that work in the United States. The top 25% of phlebotomists make an average of $17.27 per hour. The top 25% make about $35,900 per year. The top 10% of phlebotomists earn $20.48 per hour and about $42,600 per year"}, {"url": "http://work.chron.com/much-phlebotomist-make-hourly-6388.html", "passage_text": "The 2010 edition of the ASCP survey found that the average hourly wage for phlebotomists was $13.50 per hour or $28,080 per year. The ASCP survey reports an average hourly wage of $20.08 or $41,766 per year for phlebotomy supervisors. For phlebotomists specifically, the industry-supported Explore Health Careers website cites a salary range of $25,177 to $30,470 per year, or $12.10 to $14.65 hourly. The best indicator of phlebotomists' incomes is probably the salary survey performed annually by the American Society for Clinical Pathology."}]