[{"url": "http://www.salarylist.com/jobs/Foundation-President-Salary.htm", "passage_text": "Foundation President Salary. Foundation President average salary is $249,995, median salary is $- with a salary range from $- to $-. Foundation President salaries are collected from government agencies and companies. Each salary is associated with a real job position. "}, {"url": "http://blogs.findlaw.com/free_enterprise/2012/04/can-nonprofit-board-members-receive-salaries.html", "passage_text": "In short, a salary can be paid to a board member of a nonprofit, if the salary is reasonable. The term reasonable however, is a legal term of art that will depend on the facts and circumstances of your situation. Related Resources: 1  Strategic Planning for Nonprofits (FindLaw). 2  Find Legal Forms (FindLaw). Not necessarily. Board members can be salaried, under the tax law of exempt organizations. Their salaries must be reasonable. They should also be determined in accordance with a conflict of interest policy and a compensation policy."}, {"url": "http://www.theglobeandmail.com/news/national/six-figure-salaries-the-norm-at-top-charities/article4352708/", "passage_text": "If I'm giving money to a big complex organization I want to make sure it's managed right and that may mean paying somebody more than $250,000.. Tim Price, chairman of the York University Foundation board, said the foundation paid CEO Paul Marcus $394,000 in salary and bonus last year. For example, the 2010 report included salaries of executives at charities such as the CNIB and the YMCA. However, charitable foundations are exempt, meaning there was no salary information about officials running foundations such as The Princess Margaret Hospital Foundation or St. Michael's Hospital."}, {"url": "http://www.payscale.com/research/US/Job=Chief_Executive_Officer_(CEO)/Salary", "passage_text": "(United States). Average pay for Chief Executive Officers in the United States is more than reasonable, with annual salaries pushing past the six-figure mark ($157K). Median of all compensation (including tips, bonus, and overtime) by years of experience. For many Chief Executive Officers, more experience generally translates to higher pay. The average worker who claims fewer than five years of experience earns around $115K"}, {"url": "http://www.payscale.com/research/US/Job=Program_Officer%2c_Foundation/Salary", "passage_text": "Median of all compensation (including tips, bonus, and overtime) by years of experience. Experience is an important factor influencing the compensation of Foundation Program Officers. The median compensation for relatively untried workers is $52K; in the five-to-10 year group, it's higher at around $61K. Foundation Program Officers with one to two decades of relevant experience report an average salary of approximately $79K."}, {"url": "http://www1.salary.com/Foundation-Director-salary.html", "passage_text": "For example the median expected annual pay for a typical Foundation Director in the United States is $126,770 so 50% of the people who perform the job of Foundation Director in the United States are expected to make less than $126,770. Source: HR Reported data as of October 2015. Median $126,770. "}, {"url": "https://www.501c3.org/nonprofit-executive-compensation/", "passage_text": "Nonprofit executive compensation tops the current list of IRS hot button issues. In recent years, the IRS has been ramping up its oversight and enforcement of nonprofit executive compensation. The Board Compensation Committee of a 501(c)(3) foundation whose mission is to develop and provide funds and programs for a specific organization, is looking at providing an incentive compensation plan to the executive director. The ED's base salary satisfies the reasonable test."}, {"url": "http://www.theglobeandmail.com/news/national/six-figure-salaries-the-norm-at-top-charities/article4352708/", "passage_text": "Those charities all paid their chief executives more than $300,000 last year and some, including York, doled out more than $350,000. Several other charities-including the British Columbia's Children's Hospital Foundation and Toronto General & Western Hospital Foundation-paid top executives between $250,000 and $300,000. For example, the 2010 report included salaries of executives at charities such as the CNIB and the YMCA. However, charitable foundations are exempt, meaning there was no salary information about officials running foundations such as The Princess Margaret Hospital Foundation or St. Michael's Hospital."}, {"url": "http://work.chron.com/average-salary-nonprofits-ceo-9282.html", "passage_text": "The median salary range for all non-profit CEOs was between $50,000 and $75,000 per year, according to a 2011 survey conducted by the Watkins Uiberall accounting firm. Almost 30 percent of respondents reported salaries in this range, while 51.5 percent reported higher salaries and 18.6 percent reported lower salaries. "}]