[{"url": "http://www.ncbi.nlm.nih.gov/pubmedhealth/PMHT0011075/?report=details", "passage_text": "Memantine is used to treat moderate to severe Alzheimer's disease. Memantine is not a cure for Alzheimer's disease but it can help people with the disease. Memantine will not cure Alzheimer's disease, and it will not stop the disease from getting worse. This medicine is available only with your doctor's prescription. You may take this medicine with or without food. Measure the oral liquid medicine with a marked measuring spoon, oral syringe, or medicine cup. Swallow the extended-release capsule whole. Do not crush, break, or chew it. If you cannot swallow the extended-release capsule, you may open it and pour the medicine into a small amount of soft food such as pudding, yogurt, or applesauce. Stir this mixture well and swallow it without chewing"}, {"url": "http://healthquestions.medhelp.org/namenda-crushed", "passage_text": "It is called Namenda. Namenda has helped with my Nerve Damage, and given me energy. I take about 15 to 20 mg every day at 6am’ too help get me going by 9am. Considering I used to get going at 11am the earliest, this is a big improvement. It has also help with social anxiety, and I have clear thought processes. Hope this info helps"}, {"url": "http://www.namenda.com/", "passage_text": "NAMENDA ® (memantine hydrochloride) is indicated for the treatment of moderate to severe dementia of the Alzheimer's type. NAMENDA is available by prescription only. There is no evidence that NAMENDA prevents or slows the underlying disease process in patients with Alzheimer's disease. The most common side effects associated with NAMENDA treatment are dizziness, confusion, headache, and constipation. This is not a complete list of side effects. Please see full Prescribing Information."}, {"url": "http://www.namendaxrhcp.com/new-patients-starting-namenda-xr.aspx", "passage_text": "1 It is recommended that a patient who is on a regimen of 10 mg twice daily of NAMENDA tablets be switched to NAMENDA XR 28 mg once-daily capsules the day following the last dose of a 10 mg NAMENDA tablet. 1 NAMENDA XR may be administered day or night, with or without food 2. 2  NAMENDA XR capsules may be opened, and the contents sprinkled on applesauce for patients who have difficulty swallowing pills 2."}, {"url": "http://www.healthcentral.com/alzheimers/c/question/430515/75971", "passage_text": "Ask A Question. You should know Answers to your question are meant to provide general health information but should not replace medical advice you receive from a doctor. No answers should be viewed as a diagnosis or recommended treatment for a condition. "}, {"url": "http://www.consumermedsafety.org/assets/DoNotCrush2012.pdf", "passage_text": "(b) Liquid dosage forms of the product are available; however, dose, frequency of administration and manufacturers may differ from that of the solid dosage form. (c) Antacids and/or milk may prematurely dissolve the coating of the tablet. (d) Capsule may be opened and the liquid contents removed for administration. (e) The taste of this product form would likely be unacceptable to the patient; administration via nasogastric tube should be acceptable. Halfprin 81 (aspirin) Tablet Enteric-coated. Page 8 of 16 Horizant (gabapentin enacarbil) Tablet Slow-release Hista-Vent DA (combination) Tablet Extended-release (h) Hydrea (hydroxyurea) Capsule Note: exposure to the powder may cause serious skin toxicities; healthcare workers should wear gloves to administer."}, {"url": "http://www.ismp.org/tools/donotcrush.pdf", "passage_text": "(c) Antacids and/or milk may prematurely dissolve the coating of the tablet. (d) Capsule may be opened and the liquid contents removed for administration. (e) The taste of this product form would likely be unacceptable to the patient; administration via nasogastric tube should be acceptable. © ISMP 2015. "}, {"url": "http://www.namendaxrhcp.com/new-patients-starting-namenda-xr.aspx", "passage_text": "1 The recommended starting dose of NAMENDA XR is 7 mg once daily. 2  The recommended target dose is 28 mg once daily. 3  The dose should be increased in 7 mg increments to 28 mg once daily. 4  The minimum recommended interval between dose increases is one week, and only if the previous dose has been well tolerated. 1 NAMENDA XR may be administered day or night, with or without food 2. 2  NAMENDA XR capsules may be opened, and the contents sprinkled on applesauce for patients who have difficulty swallowing pills 2."}, {"url": "http://www.cmecorner.com/wp/alzheimers-disease-edition-page-3", "passage_text": "1 Follow the titration schedule by starting a patient on 5 mg every day and increase the dose by 5 mg every week until a maximum dose of 10 mg BID is reached. 2  If side effects are noted, the titration schedule can be slowed. 3  Memantine tablets should not be crushed or chewed as this may increase the rate of absorption. Strategies to prevent adverse events with memantine: 1 "}]