[{"url": "http://www.care2.com/greenliving/10-benefits-and-uses-for-miso.html", "passage_text": "5. Use the dark rice or barley miso, thinned with cooking water, as a sauce for water sauteed root vegetables or winter squash. 6. Use dark miso in a vegetable-bean casserole to supply plenty of high quality protein. 7. Make cheese for pizza and wraps with yellow miso and firm tofu. 8. Make a spread using white miso, peanut butter and apple juice to thin. 9. Make a pate with tofu, garlic, white miso, tahini, lemon juice and dulse flakes. 10. Add miso to dipping sauce for spring rolls, norimake rolls or raw vegetables. Be careful not to get carried away and use miso in everything."}, {"url": "http://www.wikihow.com/Use-Miso", "passage_text": "Miso is a thick, fermented paste made from soy beans, rice or barley and the addition of a fungus called kōji. How to Use Miso. Miso is a thick, fermented paste made from soy beans, rice or barley and the addition of a fungus called kōji. It is usually combined with sea salt. Miso has a wide range of uses from soups to stews and can add a delicious pick-me-up flavour where a meal needs a lift"}, {"url": "http://foodbabe.com/2014/04/27/what-the-heck-is-miso-miso-soup-recipe/", "passage_text": "Miso paste is created from a mixture of soybeans, sea salt and rice koji and then fermented. The fermentation process creates enzyme-rich compounds that are effective in detoxifying and eliminating industrial pollution, radioactivity and artificial chemicals from the soil and food system from your body. 1 Place water in a large pot and bring to a low simmer. 2  Add nori, tofu and mushrooms and simmer for 5-7 minutes. 3  In the meantime, place miso paste into a small bowl, add a little hot water and whisk until smooth. 4  Then add to the soup with green onions and stir."}, {"url": "http://www.bbc.co.uk/food/miso", "passage_text": "Miso recipes. A fermented paste made from soya beans and rice, barley, wheat or rye, used in Japanese and South East Asian cookery. It imparts a deeply savoury, rich intensity to any dish that's cooked with it, from a classic miso soup to marinated and grilled fish, fowl or vegetables. "}, {"url": "http://www.thekitchn.com/leftover-miso-10-great-dishes-featuring-miso-175199", "passage_text": "Pin it. We love the salty, savory taste of miso, but hate ending up with leftover miso paste. Recipes rarely call for more than a few tablespoons of the stuff and suddenly it's months later and the package is still sitting in the back of your 'fridge. "}, {"url": "http://www.huffingtonpost.com/2012/04/20/cooking-with-miso-paste_n_1441739.html", "passage_text": "What Miso Paste Is. Basically, it's a paste made from a mixture of soy beans, rice or barley that has been fermented with salt, water and a fungus. But don't get alarmed -- it's not as gross as it sounds. Miso is a cornerstone of Japanese cuisine and it's been so for centuries. Use miso paste to glaze meat, fish or even vegetables. Once it's mixed with oil, vinegar, soy sauce or other condiments, simply brush the glaze mixture onto the protein or vegetables and you're ready to grill or broil."}, {"url": "http://www.stuff.co.nz/life-style/food-wine/cuisine/70648645/What-to-do-with-miso", "passage_text": "Akamiso is made from a light coloured miso – one with a relatively high proportion of rice or barley to the amount of soy beans. Akamiso has been aged for up to three years, which is what gives it its dark red colour (as in pictures 1, 3 and 4, which are all examples of akamiso). WHAT TO DO WITH MISO. Traditionally miso was aged in wooden casks for a minimum of six months, but in many commercial varieties the process is accelerated. Other grains such as rice, barley, and buckwheat may be added and each of these provides different flavour characteristics."}, {"url": "http://www.seriouseats.com/2015/07/what-to-do-with-miso-paste.html", "passage_text": "I use miso most often as a glaze for fish. I cook the miso paste with mirin (sweet rice wine) and rice vinegar for a few hours, reducing the mixture down until it's sweet and almost syrupy. Then I braise sea bass in a thin paper pouch made of cedar soaked in water so it doesn't burn out in the oven. "}, {"url": "http://thestonesoup.com/blog/2015/02/7-delicious-ways-to-use-miso-paste/", "passage_text": "Miso soup is probably the first thing you think of when it comes to miso. The traditional form is a light broth usually with some seaweed and a few cubes of tofu. But miso soups can also be lovely meals in their own right…. Heat 3 cups stock to a simmer then stir in 1-2 tablespoons white miso. "}]