[{"url": "http://www.wikihow.com/Use-an-Incubator-to-Hatch-Eggs", "passage_text": "Record the day and how many eggs you've incubated on a calendar. You should be able to estimate your hatch date based on average incubation times for the bird species you want to hatch. For example, chicken eggs typically take 21 days to hatch, whereas many duck varieties and peafowl may take 28 days."}, {"url": "http://www.leggspeafowl.com/incub.htm", "passage_text": "The one-week incubated peafowl eggs were then placed in the incubator for the remainder of the incubation period. By using this method, when we had 100 fertile eggs for one week 90 to 95 chicks would hatch. This was an increase of 10 to 25 chicks per week from the previous year-end of season hatching."}, {"url": "http://www.ehow.com/how_5953892_hatch-peacock-eggs.html", "passage_text": "Save. Peacock eggs are hatched using an incubation system that controls the temperature, humidity and position of the eggs. Hatching the eggs through incubation requires daily attention to ensure the proper climate requirements are met. Peacock eggs require 28 to 30 days of incubation time before they will hatch."}, {"url": "http://www.ehow.com/how_5953892_hatch-peacock-eggs.html", "passage_text": "Timing the Hatch. Peacock eggs will hatch within 28 to 30 days of beginning the incubation process. On day 26, move the eggs into the hatching space and do not touch or turn at all. The hatching area is a simple basket where the chicks can safely move around as they hatch. As the chicks hatch, move them into a safe space for rearing."}, {"url": "http://www.fertilehatchingeggs.net/peacock/", "passage_text": "The natural method is not commercially viable as the peahen will be able to hatch only a limited number of eggs. The artificial method of incubation normally takes about 28 days. Proper temperature, humidity and ventilation are essential for ensuring that the peacock eggs hatch properly."}, {"url": "http://www.answers.com/Q/How_long_does_it_take_a_peacock_egg_to_hatch", "passage_text": "Turkey eggs usually take 21 to 28 days to hatch depending on what they are incubated in like an incubator or by a hen. It also depends on how fertile it is and how it is cared … for. It usually takes closer to 28 days."}, {"url": "https://www.incubators.org/peacock-egg-incubation.html", "passage_text": "Incubating Peacock eggs typically takes 28-29 days, with turning ending on the 26th day. The temperature should be measured in many locations to insure that the proper temperature is kept throughout the incubator. The thermostat should be set so that a temperature of 99 -100 degrees F is consistent throughout."}]