[{"url": "http://nameberry.com/babyname/Rebecca", "passage_text": "Rebecca is a name representing beauty in the Bible, an Old Testament classic that reached the heights of revived popularity in the seventies but is still a pretty and prudent choice. The Becca short form is more stylish now than homespun Becky. The biblical Rebecca was the wife of Isaac and the mother of Esau and Jacob. Rebekah was a common spelling of the name in the Bible."}, {"url": "http://meaning-of-names.com/hebrew-names/rebecca.asp", "passage_text": "Meaning of Rebecca. Hebrew name. In Hebrew, the name Rebecca means-Variant of Rebekah: Captivating; knotted cord.. Other origins for the name Rebecca include-Hebrew, Biblical.The name Rebecca is most often used as a girl name or female name. Hebrew Name Meaning-Variant of Rebekah: Captivating; knotted cord. Origin-Hebrew. Alternate Origins-Biblical."}, {"url": "http://babynames.allparenting.com/list/Hebrew_Baby_Names/Rebecca/details/", "passage_text": "The name Rebecca is a baby girl name. The name Rebecca comes from the Hebrew origin. In Hebrew The meaning of the name Rebecca is: Variant of Rebekah: Captivating; knotted cord. Similar Names: 1  Becca (English). "}, {"url": "http://www.behindthename.com/name/rebecca", "passage_text": "From the Hebrew name רִבְקָה (Rivqah) , possibly meaning a snare in Hebrew, or perhaps derived from an Aramaic name. This is the name of the wife of Isaac and the mother of Esau and Jacob in the Old Testament. It came into use as a Christian name after the Protestant Reformation, and it was popular with the Puritans in the 17th century."}, {"url": "http://www.thinkbabynames.com/meaning/0/Rebecca", "passage_text": "Rebecca /re-bec-ca/ [3 sylls.] as a girls' name is pronounced ree-BEK-ah. It is of Hebrew origin, and the meaning of Rebecca is to bind. Biblical: Rebekah, noted in the Genesis account as a maiden of beauty, modesty, and kindness, became the wife of Abraham's son, Isaac. The name was used by the Puritans and was common through the 19th century. Rebecca is a very popular first name for women (#34 out of 4276, Top 1%) and also a very popular last name for both adults and children (#51945 out of 150436, Top 35%). (2000 U.S. Census). Charted below is the birth name popularity of Rebecca for girls."}, {"url": "http://www.sheknows.com/baby-names/name/rebecca", "passage_text": "Hebrew Meaning: The name Rebecca is a Hebrew baby name. In Hebrew the meaning of the name Rebecca is: Captivating; knotted cord. American Meaning: The name Rebecca is an American baby name. In American the meaning of the name Rebecca is: Captivating; knotted cord."}, {"url": "http://www.sheknows.com/baby-names/name/rebekah", "passage_text": "Biblical Meaning: The name Rebekah is a Biblical baby name. In Biblical the meaning of the name Rebekah is: Fat, fattened, a quarrel appeased. American Meaning: The name Rebekah is an American baby name. In American the meaning of the name Rebekah is: Fat, fattened, a quarrel appeased. Hebrew Meaning: The name Rebekah is a Hebrew baby name. In Hebrew the meaning of the name Rebekah is: Captivating; knotted cord. Wife of Isaac in the Old Testament. "}, {"url": "http://www.thenamemeaning.com/rebecca/", "passage_text": "The name means a snare in Hebrew. In Hebrew the meaning of the name Rebecca is: Captivating or a knotted cord. Other suggested meanings of the name are snare, noose, tied up, secured, and even beautifully ensnaring. The meaning of Rebecca has more than one different etymologies. It has same or different meanings in other countries and languages. The different meanings of the name Rebecca are: 1  American meaning: To tie or bind. 2  Hebrew meaning: Bound to God; a knotted cord; (sometimes also used to refer to a heifer)."}, {"url": "http://www.thenamemeaning.com/rebecca/", "passage_text": "Search comprehensively and find the name meaning of Rebecca and its name origin or of any other name in our database. Also note the spelling and the pronunciation of the name Rebecca and check the initials of the name with your last name to discover how it looks and sounds. The meaning of Rebecca has more than one different etymologies. It has same or different meanings in other countries and languages. The different meanings of the name Rebecca are: 1  American meaning: To tie or bind. 2  Hebrew meaning: Bound to God; a knotted cord; (sometimes also used to refer to a heifer)."}]