[{"url": "http://www.endocrineweb.com/conditions/hyperparathyroidism/hyperparathyroidism", "passage_text": "The most common cause of excess hormone production is the development of a benign (non-cancerous) tumor in one of the parathyroid glands. This enlargement of one parathyroid gland is called a parathyroid adenoma, and it accounts for 96% of all patients with primary hyperparathyroidism. The most common situation is that one of the parathyroid glands has developed a tumor that is secreting all the hormone. Approximately 3% or 4% of all patients with primary hyperparathyroidism will have an enlargement of all 4 parathyroid glands, a term called parathyroid hyperplasia. In this instance, all of the parathyroid glands become enlarged and produce too much parathyroid hormone."}, {"url": "http://www.aafp.org/afp/2013/0815/p249.html", "passage_text": "Disorders of the parathyroid glands most commonly present with abnormalities of serum calcium. Patients with primary hyperparathyroidism, the most common cause of hypercalcemia in outpatients, are often asymptomatic or may have bone disease, nephrolithiasis, or neuromuscular symptoms. "}, {"url": "http://radiopaedia.org/articles/parathyroid-adenoma", "passage_text": "Parathyroid adenomas are benign tumours of the parathyroid glands and are the most common cause of primary hyperparathyroidism. Superior gland parathyroid adenoma may fall posteriorly in the tracheo-oesophageal groove or para-oesophageal location or even fall inferior as far as the mediastinum 12. Up to 5% of parathyroid adenomas can occur in ectopic locations. Common ectopic locations include 1,12 :"}, {"url": "http://www.ncbi.nlm.nih.gov/pubmed/21104031", "passage_text": "Common locations of parathyroid adenomas. Moreno MA, Callender GG, Woodburn K, Edeiken-Monroe BS, Grubbs EG, Evans DB, Lee JE, Perrier ND. BACKGROUND: We have developed a nomenclature system that succinctly specifies the locations of parathyroid adenomas in the neck. We report our experience using the system in a large, contemporary cohort of patients"}, {"url": "http://emedicine.medscape.com/article/1949105-overview", "passage_text": "The superior parathyroid glands are most commonly located in the posterolateral aspect of the superior pole of the thyroid gland at the cricothyroidal cartilage junction. They are most commonly found 1 cm above the intersection of the inferior thyroid artery and the recurrent laryngeal nerve (see the image below). In most cases, the inferior parathyroid glands become localized near the inferior poles of the thyroid, and the thymus continues to migrate toward the mediastinum. The superior parathyroid glands are derived from the fourth pharyngeal pouch and migrate together with the ultimobranchial bodies."}, {"url": "https://en.wikipedia.org/wiki/Parathyroid_gland", "passage_text": "The parathyroid glands are small endocrine glands in the neck of humans and other tetrapods that produce parathyroid hormone. Humans usually have four parathyroid glands, variably located on the back of the thyroid gland, although considerable variation exists. Parathyroid hormone and calcitonin (one of the hormones made by the thyroid gland) have key roles in regulating the amount of calcium in the blood and within the bones. The parathyroid glands are two pairs of glands usually positioned behind the left and right lobes of the thyroid. Each gland is a yellowish-brown flat ovoid that resembles a lentil seed, usually about 6 mm long and 3 to 4 mm wide, and 1 to 2 mm anteroposteriorly. There are typically four parathyroid glands."}, {"url": "http://radiopaedia.org/articles/parathyroid-adenoma", "passage_text": "Location. The majority of parathyroid adenomas are juxtathyroid and located immediately posterior or inferior to the thyroid gland. Superior gland parathyroid adenoma may fall posteriorly in the tracheo-oesophageal groove or para-oesophageal location or even fall inferior as far as the mediastinum 12. Up to 5% of parathyroid adenomas can occur in ectopic locations. Common ectopic locations include 1,12 1  : mediastinum. Superior gland parathyroid adenoma may fall posteriorly in the tracheo-oesophageal groove or para-oesophageal location or even fall inferior as far as the mediastinum 12. Up to 5% of parathyroid adenomas can occur in ectopic locations. Common ectopic locations include 1,12 :"}, {"url": "http://emedicine.medscape.com/article/1949105-overview", "passage_text": "Recurrent laryngeal nerve and parathyroid relationship. Most common location of superior parathyroid (A) and inferior parathyroid (B) glands; shaded areas detail the most common distribution sites of the glands. Anatomy of the recurrent laryngeal nerve (RLN). In most cases, the inferior parathyroid glands become localized near the inferior poles of the thyroid, and the thymus continues to migrate toward the mediastinum. The superior parathyroid glands are derived from the fourth pharyngeal pouch and migrate together with the ultimobranchial bodies."}]