[{"url": "https://en.wikipedia.org/wiki/Nationals_Park", "passage_text": "Nationals Park is a baseball park located along the Anacostia River in the Navy Yard neighborhood of Washington, D.C. It is the home ballpark for the Washington Nationals, the city's Major League Baseball franchise. The park's name echoes the original name of the early-1900s ballpark used by the Washington Senators/Nationals, which was called National Park until it was rebuilt and renamed Griffith Stadium. The name was originally a temporary name, as the Lerner Family had planned to sell its naming rights"}, {"url": "http://www.stadium-advisor.com/washington-nationals-stadium.html", "passage_text": "Scoreboard Walk. In the stands beyond right field at Washington Nationals stadium is the Scoreboard Walk. There you'll find a Miller Lite bar area with counter-top table and chairs near-by. Just across the walkway and next to the escalator is a lounge area. I found this to be a great area to go to before the game. Washington Nationals Stadium (Nationals Park). Located below information on the Washington Nationals stadium, Nationals Park. The stadium is located one block from the green line Metro subway stop at Navy Yard. The city does not have any kind of agreement with the Washington Nationals or with Nationals Park in providing transportation to/from games"}, {"url": "http://www.nationalsseatingchart.com/washington-nationals-scoreboard-pavilion/", "passage_text": "The Washington Nationals Scoreboard Pavilion is named for its location just under the scoreboard at Nationals Park. Within the Nationals scoreboard pavilion seats, the best seats are are in the front rows near aisles. Nationals scoreboard pavilion seats are slanted, granting reasonable sight lines for every seat in the section, but the view of fans in the back rows can still be obstructed by patrons sitting in the front rows."}, {"url": "http://www.nationalsseatingchart.com/washington-nationals-scoreboard-pavilion/", "passage_text": "The Nationals Park seating chart shows the Nationals scoreboard pavilion seats on the second level of seating and above the Nationals outfield reserved seats from the right field corner to right-center field. Within the Nationals scoreboard pavilion seats, the best seats are are in the front rows near aisles. Nationals scoreboard pavilion seats are slanted, granting reasonable sight lines for every seat in the section, but the view of fans in the back rows can still be obstructed by patrons sitting in the front rows."}, {"url": "http://www.parkwhiz.com/nationals-park-parking/", "passage_text": "About Nationals Park. The Nationals moved from Montreal into the nation’s capital in 2005, but they didn’t really arrive in the Washington, D.C. until they moved out of withering RFK Stadium and into the new, baseball-specific Nationals Park. The differences between Nationals Park and RFK are stark. Mainly, RFK was a football stadium, constructed for the Redskins (who, ironically moved in from a baseball park, Griffith Stadium)."}, {"url": "https://en.wikipedia.org/wiki/Nationals_Park", "passage_text": "The park has an out-of-town scoreboard, which is 102 feet (31 m) long, installed in the right field wall. The main scoreboard, at 101 feet (31 m) long and 47 feet (14 m) high, is more than five times the size of the one at RFK Stadium. The park's name echoes the original name of the early-1900s ballpark used by the Washington Senators/Nationals, which was called National Park until it was rebuilt and renamed Griffith Stadium. The name was originally a temporary name, as the Lerner Family had planned to sell its naming rights"}, {"url": "http://washington.nationals.mlb.com/was/fan_forum/scoreboard.jsp", "passage_text": "Scoreboard Messages. Thank you for your interest in having your name in lights! Commemorate a special event, birthday or anniversary by displaying a message on the Nationals Park scoreboard during the end of the fourth inning at a Nationals home game! Scoreboard messages can now be reserved online with a donation of $100 to the Washington Nationals Dream Foundation. "}, {"url": "https://en.wikipedia.org/wiki/Nationals_Park", "passage_text": "Chipper Jones of the Braves hit the first batted ball and first home run, while the Nationals' Cristian Guzman got the first base hit. According to the Elias Sports Bureau, Zimmerman's game-winning home run was the third walk-off home run in major-league history to be hit in the first MLB game played at a stadium. The park's name echoes the original name of the early-1900s ballpark used by the Washington Senators/Nationals, which was called National Park until it was rebuilt and renamed Griffith Stadium. The name was originally a temporary name, as the Lerner Family had planned to sell its naming rights"}]