[{"url": "http://www.paulmilleraudi.com/new-tires-and-wheel-alignement.htm", "passage_text": "For this reason, when tires are rotated on the vehicle every 5-6,000 miles or 6 months, they should be checked and rebalanced if necessary. Wheel alignment. The average price of a newly mounted and balanced tire with a new valve stem is roughly $325* per tire. That's $1,300 * for the set of four. If your wheel alignment is out, you could lose that $1,300* in short order. That's why you should, at the very least, check wheel alignment before venturing out on a new set of tires. CLICK HERE TO READ MORE."}, {"url": "http://cars.costhelper.com/wheel-alignment.html", "passage_text": "1 A four-wheel alignment at a car repair or tire shop also typically costs $20-$100, depending on vehicle make and model, location and warranty. 2  CostHelper readers report paying $30-$80 for this service, at an average cost of $63. 1 If needed, wheel balancing (at an average cost of $10-$12 per tire) may be done at the same time as alignment."}, {"url": "http://www.audiworld.com/forums/a6-c7-platform-discussion-194/cost-alignment-dealer-2886793/", "passage_text": "Posts: 22. Cost for Alignment at Dealer. I recently bought 4 new tires because the two in the rear were bad. One had threads most of the way around on the inside corner and the other had a bubble on the inside 1/3-1/2 that ran the circumference. The tire shop said it looked like the alignment was out. I was expecting to spend maybe $150 for a four-wheel alignment. I was told by the dealer that I should have my alignment done at the dealer rather than, say, firestone, because the dealer does much more than align the wheels. My car has adaptive cruise control and blind spot monitoring."}, {"url": "http://www.audiforum.ca/eastern-canada-discussion-48/price-alignment-dealership-64152/", "passage_text": "Color: black. Re: price for alignment at dealership. I got my alignment done after i got new wheels and raised my car for the winter. His price is $120 i think. Small shop but of all the other places i've been to who charges like crazy, or say that everything seems OK, this shop had it fixed for a great price. Re: price for alignment at dealership. I know the guys at superior tire on yonge and 16th and they put on some new rubber for me and did an alignment past saturday. They have the right tool and the price is 89.99. New tires and alignment = car drives beautifully"}, {"url": "http://www.audiforums.com/forum/audi-a4-8/alignment-cost-28002/", "passage_text": "RE: Alignment cost? I paid 80$ at Michelin for a **** aligment, and 90$ at Autosport Werks (an Audi performance shop, if that wasn't obvious) for a good one. Camber is slant of the tires vertically, toe is horizontal. In as simple of terms as I can put it. If you're in doubt, get one."}, {"url": "http://www.audiforum.ca/a4-b8-typ-8k-2008%C2%96present-78/alignment-cost-69727/", "passage_text": "Originally Posted by sachin. Hi, Can anyone advise me if alignment on a 2009 Audi A4 should be done only at a dealership or can be done outside with any other shops. The dealer quoted me $260 + tax, which I feel is pretty steep. I hit the curb on my front left side wheel by sliding on Friday night after hitting black ice."}, {"url": "http://cars.costhelper.com/wheel-alignment.html", "passage_text": "1 To get a proper alignment, some European and high-end Asian vehicles require special tools and computer equipment that are only available at car dealerships, where wheel alignments can cost $75-$400 or more, depending on location, make and model, and length of warranty. 1 If needed, wheel balancing (at an average cost of $10-$12 per tire) may be done at the same time as alignment."}, {"url": "http://cars.costhelper.com/wheel-alignment.html", "passage_text": "1 CostHelper readers report paying $40-$95 for a two-wheel alignment, at an average cost of $65. 2  A four-wheel alignment at a car repair or tire shop also typically costs $20-$100, depending on vehicle make and model, location and warranty. 1 If needed, wheel balancing (at an average cost of $10-$12 per tire) may be done at the same time as alignment."}, {"url": "http://www.audiworld.com/forums/a4-b6-platform-discussion-34/how-much-should-alignment-cost-2765239/", "passage_text": "Our shop charges $150 for a proper raised toe alignment, since we have the proper tools. The extra cost is due to the extra time involved, but it is absolutely necessary if you want the car to drive correctly. Posts: 3,623. About 70 - 100 dollars. --BUT--. Many shops cannot do a full alignment on A4's because the engine cradle needs to be moved to properly adjust the camber and caster. However, you can take it to most places to have then set the tow (left right angles)."}]