[{"url": "https://en.wikipedia.org/wiki/Limonium", "passage_text": "Limonium is a genus of 120 flower species. Members are also known as sea-lavender, statice, or marsh-rosemary. Despite their common names, species are not related to the lavenders or to rosemary. They are grown both for their flowers and for the appearance of the calyx, which remains on the plant after the true flowers have fallen, and are known as everlasting flowers. There are between 120-150 species in the genus, many of them local endemic species with a very restricted range. Species not given a common name here are generally referred to simply as sea-lavender, statice, or marsh-rosemary. 1  Limonium aragonense (Monegros, endemic). 2  Limonium arborescens (Tree Limonium; Tenerife, endemic). 3  Limonium aureum (central Asia: Siberia, Mongolia, northwest China)"}, {"url": "https://en.wikipedia.org/wiki/Limonium", "passage_text": "Species [edit]. There are between 120-150 species in the genus, many of them local endemic species with a very restricted range. Species not given a common name here are generally referred to simply as sea-lavender, statice, or marsh-rosemary. 1  Limonium aragonense (Monegros, endemic). 2  Limonium arborescens (Tree Limonium; Tenerife, endemic). 3  Limonium aureum (central Asia: Siberia, Mongolia, northwest China). They are grown both for their flowers and for the appearance of the calyx, which remains on the plant after the true flowers have fallen, and are known as everlasting flowers. There are between 120-150 species in the genus, many of them local endemic species with a very restricted range."}, {"url": "http://www.audioenglish.org/dictionary/sium.htm", "passage_text": "• SIUM (noun). The noun SIUM has 1 sense: 1. perennial of wet and marshy places in the northern hemisphere: water parsnips. Familiarity information: SIUM used as a noun is very rare. Sium suave; water parsnip (stout white-flowered perennial found wild in shallow fresh water; northern United States and Asia). greater water parsnip; Sium latifolium (large stout white-flowered perennial found wild in shallow fresh water; Europe)"}, {"url": "http://www.audioenglish.org/dictionary/sium_latifolium.htm", "passage_text": "• SIUM LATIFOLIUM (noun). The noun SIUM LATIFOLIUM has 1 sense: 1. large stout white-flowered perennial found wild in shallow fresh water; Europe. Familiarity information: SIUM LATIFOLIUM used as a noun is very rare. "}, {"url": "https://en.wikipedia.org/wiki/Epilobium_angustifolium", "passage_text": "Etymology [edit]. The species name angustifolium ('narrowleaved') is constructed from the Latin words angustus meaning 'narrow' and folium meaning 'leaved' or 'leaf'. It shares this name with other species of plant including Vaccinium angustifolium"}, {"url": "http://www.merriam-webster.com/dictionary/sea%20oats", "passage_text": "Definition of SEA OATS. : a tall grass (Uniola paniculata) that has panicles resembling those of the oat, grows chiefly on the coast of the southern United States, and is useful as a sand binder; also: a related plant (Chasmanthium latifolium syn. U. latifolia) chiefly of the eastern United States. ADVERTISEMENT."}, {"url": "http://www.edenbrothers.com/store/muscari_bulbs_latifolium.html", "passage_text": "Meaning broad leaved the Muscari Latifolium is a unique member of the Grape Hyacinth clan, with its familiar clusters of bell shaped flowers, Latifolium offers a unique ombre pattern of color on a single bloom. 1  Fast Facts. 2  Bulb Spacing. "}, {"url": "http://prota4u.org/protav8.asp?p=Gongronema+latifolium", "passage_text": "Gongronema latifolium is widely used in West Africa for medicinal and nutritional purposes. An infusion of the aerial parts is taken to treat cough, intestinal worms, dysentery, dyspepsia and malaria. It is also taken as a tonic to treat loss of appetite. A cold maceration of the roots is also taken as a remedy for asthma. A decoction of the roots, combined with other plant species, is taken to treat sickle cell anaemia. A maceration of the leaves in alcohol is taken to treat bilharzia, viral hepatitis and as a general antimicrobial agent."}]