[{"url": "http://www.salarylist.com/company/Southeast-Asia-Center-Salary.htm", "passage_text": "Home South-east Asia Center Salary. South-east Asia Center average salary is $29,223, median salary is $30,000 with a salary range from $25,000 to $31,000. South-east Asia Center salaries are collected from government agencies and companies. Each salary is associated with a real job position. "}, {"url": "http://www.totaljobs.com/salary-checker/average-office-manager-salary-south-east", "passage_text": "salary results for office manager in south east here you can see the average salary for the job you entered based on our most recent job adverts our salary calculator also lets you view the highest and lowest salaries recently offered for that job and how your current salary compares key high the typical high end salary you can expect for this kind of job based on last month s job ads average this is the median or middle salary from a list of last month s related job ads low the typical low range salary for this kind of job again based on last month s job ads"}, {"url": "http://www.totaljobs.com/salary-checker/average-bookkeeper-salary-south-east", "passage_text": "high the typical high end salary you can expect for this kind of job based on last month s job ads average this is the median or middle salary from a list of last month s related job ads low the typical low range salary for this kind of job again based on last month s job ads here you can see the average salary for the job you entered based on our most recent job adverts our salary calculator also lets you view the highest and lowest salaries recently offered for that job and how your current salary compares"}, {"url": "http://www.totaljobs.com/salary-checker/average-bookkeeper-salary-south-east", "passage_text": "salary results for bookkeeper in south east here you can see the average salary for the job you entered based on our most recent job adverts our salary calculator also lets you view the highest and lowest salaries recently offered for that job and how your current salary compares"}, {"url": "http://www.cwjobs.co.uk/salary-checker/average-database-salary-south-east-london", "passage_text": "Salary results for Database in South East London. Here you can see the average salary for the keyword you entered, based on our most recent job adverts. Clicking on the 'Top salaries' tab will provide you with a breakdown of salaries based on industry and location. Key. High: The typical high-end salary you can expect for this kind of job, based on last month's job ads. Average: This is the 'median', or middle salary, from a list of last month's related job ads. Low: The typical low-range salary for this kind of job, again"}, {"url": "http://www.mirror.co.uk/news/uk-news/north-south-divide-growing-pay-inequality-3191258", "passage_text": "The latest available data shows London and the South East are now the only two regions to see wages above the national average. Overall median salaries for the UK increased from £18,848 in 2000 to £27,017 last year, roughly in line with inflation. The median wage in the North East was £17,430 in 2000. This was £1,418 less than the national average. During 2013 the average worker in the region took home £24,084 - a real-terms fall in wages since 2000 after inflation-and the pay gap has grown to £2,933. The north-south divide is growing, with workers in the North East now the worst paid in Britain. Wages in the rest of the country have fallen further behind London since 2000, a major study by the Office for National Statistics has shown."}, {"url": "http://www.salarylist.com/company/Southeast-Salary.htm", "passage_text": "Southeast Salary. Southeast average salary is $81,880, median salary is $34,975 with a salary range from $24,000 to $169,957. Southeast salaries are collected from government agencies and companies. Each salary is associated with a real job position. Southeast salary statistics is not exclusive and is for reference onl"}, {"url": "http://news.bbc.co.uk/2/hi/8151355.stm", "passage_text": "The average wage throughout the civil service for grades 1 - 5 (which is 80% of all civil servants) is less that £20000 pa. Stuart Wilson, Motherwell. Andrew, Oxford says: To maintain any kind of decent lifestyle in the UK (especially the South East), one requires a salary of at least £60k. "}]