[{"url": "http://www.answers.com/Q/What_is_the_Medical_term_meaning_white_blood_cells_in_urine", "passage_text": "White blood cells in your urine can mean that there is an infection  present. You may have a urinary tract infection, kidney infection,  or a bladder infection all of which … can be treated with medication. 4 people found this useful. "}, {"url": "http://www.answers.com/Q/What_is_the_medical_term_meaning_blood_in_the_urine", "passage_text": "1 Common Causes of Hematuria in Men Hematuria is a condition where there is blood in your urine. 2  The blood is either visible by the naked eye, known as gross hematuria, or only visible through a microscope. 3  Eit…. haem is the medical term of blood. for example, hemoglobins are blood cell particles. and bleeding is Hemorrhage. + 18 others found this useful. Telesha Thomas. Edit. Share to: 1  Common Causes of Hematuria in Men Hematuria is a condition where there is blood in your urine. 2  The blood is either visible by the naked eye, known as gross hematuria, or only visible through a microscope"}, {"url": "http://www.uptodate.com/contents/blood-in-the-urine-hematuria-in-adults-beyond-the-basics", "passage_text": "(See Etiology and evaluation of hematuria in adults .). TYPES OF HEMATURIA. There are two main types of hematuria: gross and microscopic. ● Gross hematuria – Gross hematuria means that you can see blood with the naked eye because the urine is pink, red, purplish-red, brownish-red, or tea-colored. If you see blood in your urine, you should call your healthcare provider. BLOOD IN THE URINE OVERVIEW. Hematuria is the medical term for red blood cells in the urine. Red blood cells in the urine can come from the kidney (where urine is made) or anywhere in the urinary tract (figure 1)."}, {"url": "http://medical-dictionary.thefreedictionary.com/Blood+in+the+urine", "passage_text": "the discharge of blood in the urine, making the urine either slightly blood-tinged, grossly bloody, or a smoky brown color. Microscopic examination of a urine specimen can reveal red blood cells not evident to the naked eye; however, this microscopic hematuria is not always pathognomonic. "}, {"url": "http://www.medicinenet.com/script/main/art.asp?articlekey=8345", "passage_text": "Blood in the urine: Blood that appears in the urine. Also known as hematuria. Gross hematuria refers to blood that is so plentiful in the urine that the blood is visible with just the naked eye. Microhematuria refers to blood in urine that is visible only under a microscope; there is so little blood that it cannot be seen without magnification. Hematuria, whether gross or microscopic, is abnormal and should be further investigated. It may or may not be accompanied by pain"}, {"url": "http://www.uptodate.com/contents/blood-in-the-urine-hematuria-in-children-beyond-the-basics", "passage_text": "TYPES OF HEMATURIA. There are two main types of hematuria: ● Gross hematuria — Gross hematuria means that blood can be seen in the urine with the naked eye because it turns the urine pink, red, or tea-colored. If you see blood in your child's urine, you should call your child's healthcare provider. ● Microscopic — Microscopic hematuria means that the urine is normal in color, but it has an increased number of red blood cells (blood) as seen with a microscope. If your child's urine dipstick shows blood in the urine, the urine should be examined with a microscope to confirm that blood is present"}, {"url": "http://www.healthline.com/symptom/blood-in-urine", "passage_text": "Hematuria is the medical term for blood in your urine. Several different conditions and diseases can cause hematuria. These include infections, kidney disease, cancer, and rare blood disorders. The blood may be visible or in such small quantities that it can’t be seen with the naked eye. Another common reason for blood in the urine is the presence of stones in the bladder or kidney. These are crystals that form from the minerals in your urine. They can develop inside your kidneys or bladder."}, {"url": "http://www.uptodate.com/contents/blood-in-the-urine-hematuria-in-adults-beyond-the-basics", "passage_text": "● Microscopic hematuria – Microscopic hematuria means that the urine is normal in color, but there are an increased number of red blood cells seen with a microscope. It is usually discovered when a urine sample is tested with a dipstick. BLOOD IN THE URINE OVERVIEW. Hematuria is the medical term for red blood cells in the urine. Red blood cells in the urine can come from the kidney (where urine is made) or anywhere in the urinary tract (figure 1)."}]