[{"url": "http://www.answers.com/Q/How_long_after_a_wedding_is_it_appropriate_to_give_a_gift", "passage_text": "Typically, you are looking to cover the cost of your plate. It also  depends on how close the friend is to you, and the kind of wedding  they are having. Some wedding gifts … can range from $75-$200. If you  are invited with a guest, remember to take that into consideration  as well. You need to cover their cost in addition to your own."}, {"url": "http://stylecaster.com/wedding-gift-etiquette/", "passage_text": "Anja Winikka: How much you give really depends on your relationship with the bride and groom. Here’s a useful breakdown: If you’re a co-worker or a distant family friend or relative: $75 to $100. If you’re a relative or friend of the bride or groom: $100 to $125. If you’re a close relative or a close friend: $100-$150+. "}, {"url": "http://www.ctvnews.ca/health/wedding-gift-etiquette-cash-is-still-king-but-how-much-1.1836362", "passage_text": "Wedding planner Lynzie Kent says a general rule is to give a gift that at least covers the cost of your reception dinner. It used to be $100 a head is kind of the going rate, but these days I think it's anywhere between $150 and $250 per person, Kent told CTVNews.ca. But there is no etiquette on that for giving a gift.. Andrews Sunkel said one of the most common questions she's asked is how much cash to give, and she believes it should be based on your relationship with the couple, and what you're comfortable with."}, {"url": "http://www.cbsnews.com/news/wedding-gift-etiquette-what-to-give-and-how-much/", "passage_text": "If you're attending a relative or a friend's wedding, the wedding website suggests somewhere between $100 and $125. TheKnot.com also took the pulse of what real brides and grooms have spent on weddings in the past in its registry study. On average, friends spend $79 on the bride and groom's present, said Miles. Meanwhile, if you're heading to a destination or an out-of-town wedding, it's probably OK to spend less on the gift, said Hill. But you should still give something; Hill noted that guests can't simply say that their attendance is gift enough."}, {"url": "http://www.huffingtonpost.com/cheryl-seidel-/wedding-gift-etiquette-ho_b_5504039.html", "passage_text": "Giving gifts to the wedding couple is a longstanding tradition. The gift serves as a tangible representation of your affection and support of the marriage. The #1 gift etiquette rule is: If you're invited to a wedding, you should send a gift, whether or not you are able to attend."}, {"url": "http://www.answers.com/Q/How_long_after_a_wedding_is_it_appropriate_to_give_a_gift", "passage_text": "It depends on how close you are to the bride or groom. Generally it's 6 months to a year, but if there were circumstances why you couldn't give a gift at the time of the wedd … ing feel free to have them over for dinner and present them with a gift, or, send them a nice card with a gift certificate or a check inside. It also  depends on how close the friend is to you, and the kind of wedding  they are having. Some wedding gifts … can range from $75-$200. If you  are invited with a guest, remember to take that into consideration  as well. You need to cover their cost in addition to your own."}, {"url": "http://emilypost.com/advice/choosing-a-wedding-gift/", "passage_text": "Contrary to a current rumor that you have a year to send a gift, it really should be sent soon after you receive your invitation or, on the outside, within three months of the wedding. "}, {"url": "http://www.huffingtonpost.com/cheryl-seidel-/post_9474_b_7455892.html", "passage_text": "I can share that the average amount spent on a wedding gift in 2014 through RegistryFinder.com was $120. If you choose to buy from the couple's wedding registry, we recommend purchasing early, so you have the best selection of gifts and price ranges. We just don't know how much we are expected to spend on a wedding gift. Unfortunately, there's no simple answer and no set amount you should spend (or amount you should give if gifting cash). The amount you spend is dependent upon your budget and relationship with the wedding couple (or their parents)."}, {"url": "http://www.huffingtonpost.com/cheryl-seidel-/wedding-gift-etiquette-ho_b_5504039.html", "passage_text": "So the correct answer is: It's best to send the gift within one month after the wedding, two months at the most. With online gift registries and mobile shopping, there is really no reason, other than finances, not to send your friend a wedding gift before or shortly after the wedding. The gift serves as a tangible representation of your affection and support of the marriage. The #1 gift etiquette rule is: If you're invited to a wedding, you should send a gift, whether or not you are able to attend."}, {"url": "http://weddings.about.com/cs/giftgivingfaqs/f/timeframe.htm", "passage_text": "Ideally, you'll give your wedding present within two months of the wedding. Remember, though there are guidelines about how much to spend on a wedding gift, it truly is the thought that counts. It's better to give something smaller, than wait a long time to be able to afford something more expensive. Answer: Traditional etiquette says that you have up to a year following the wedding. Try to purchase one sooner though, so that there are still items available on the registry, and so that the new couple can start using your gift."}]