[{"url": "https://en.wikipedia.org/wiki/Marzipan", "passage_text": "It is often made into sweets; common uses are chocolate-covered marzipan and small marzipan imitations of fruits and vegetables. It is also rolled into thin sheets and glazed for icing cakes, primarily birthday, wedding cakes and Christmas cakes. This use is particularly common in the UK, on large fruitcakes. Marzipan is also used in Tortell, and in some versions of king cake eaten during the Carnival season. Traditional Swedish Princess Cake is typically covered with a layer of marzipan that has been tinted pale green."}, {"url": "http://allrecipes.com/recipe/7740/marzipan/", "passage_text": "Make your own marzipan instead of buying it. Marzipan is used to frost Christmas cakes and for candies, and all sorts of other goodies. Please note: this recipe contains raw eggs. We recommend that pregnant women, young children, the elderly and the infirm do not consume raw eggs."}, {"url": "http://cake-decorating.lovetoknow.com/cake-decorating-supplies/what-is-marzipan", "passage_text": "By Kelly Roper. Marzipan is a type of sugar dough or paste that's used in baking and cake decorating. It's similar to almond paste, but the marzipan has a smoother texture that's more like fondant and can be used in many of the same ways. Marzipan is a type of sugar dough or paste that's used in baking and cake decorating"}, {"url": "http://candy.about.com/od/marzipancandyrecipes/r/Marzipan.htm", "passage_text": "Marzipan is a smooth almond candy used to make candy centers, form figurines, and cover cakes. This is a great all-purpose marzipan recipe that comes together quickly and requires just three ingredients. I like it because it has a lovely smooth texture and light almond taste. "}, {"url": "http://www.thekitchn.com/almond-paste-and-marzipan-what-46772", "passage_text": "Almond Paste. 1  What it's made out of: The same ingredients as marzipan, but with less sugar and almost double the amount of almonds. 2  Sometimes almond extract is added. 3  How's it sold: In tubes, cans, tubs, or bags. 4  Taste and texture: Not as sweet and coarser than marzipan. 1"}, {"url": "https://en.wikipedia.org/wiki/Marzipan", "passage_text": "Marzipan (or almond paste) may also be used as a cake ingredient, as in stollen. In some countries, it is shaped into small figures of animals as a traditional treat for New Year's Day. Marzipan is also used in Tortell, and in some versions of king cake eaten during the Carnival season. Traditional Swedish Princess Cake is typically covered with a layer of marzipan that has been tinted pale green."}, {"url": "http://www.wikihow.com/Make-Marzipan", "passage_text": "Two Methods: Uncooked Cooked. Marzipan is a confection consisting primarily of ground almonds and some sweetener, usually sugar or honey. If you want to make marzipan from scratch, this article includes two recipes to make this delicious sweet found in cakes and candies. "}, {"url": "http://candy.about.com/od/candyglossary/g/def_marzipan.htm", "passage_text": "Marzipan is a candy paste made primarily from almonds and sugar. It is used as a candy filling, and is a common ingredient in many European pastries and cakes. Because it has a smooth, supple texture, marzipan is also used to shape and mold candy figures, and can be used as an alternative to fondant in covering cakes. "}, {"url": "http://www.wisegeek.org/what-is-marzipan.htm", "passage_text": "Marzipan is an almond and sugar paste that is used to ice cakes and other pastries or sculpted into a variety of shapes to be eaten as candy or used as cake decorations. It is simply a mixture of almond paste, powdered sugar, and a moistening agent such as water, corn syrup, glucose, fondant, or egg whites. Ad. Marzipan is used to decorate cakes in other ways as well. Its soft, pliable texture allows a decorator to shape it into three dimensional shapes such as flowers, fruits, people, or animals."}]