[{"url": "http://forums.gardenweb.com/discussions/2063246/chickweed-in-lawn", "passage_text": "I tried to understand the lifecycle of chickweed to see if it would die off in the summer and allow my grass to thicken in the fall. Instead I was told to pull it out before it grows or get a thick lawn. So thanks again. Anyway, I have a relatively large chickweed invasion. I tried pulling some out with a thatch rake and it seemed to thin it out, but I'm not sure if it just allowed the chickweed to grow better also. The grass is growing pretty well in most of these areas so I guess my question is..."}, {"url": "https://burke.ces.ncsu.edu/Controlling+Chickweed/", "passage_text": "The weed has already disbursed seeds for next year and will die out on its own without the use of herbicides. Seeds will then lie dormant until the cooler weather of fall arrives and then they will start to germinate and will grow throughout the winter. Chickweed may be controlled in two ways. It’s too late this year to go with pre-emergent herbicides. Chickweed and other winter annuals are already up and growing. Post-emergent herbicides should be applied after the weed is up and actively growing. The target application time should be from October to early March."}, {"url": "http://en.allexperts.com/q/Lawns-725/2008/4/post-emergent-organic-control.htm", "passage_text": "A few, maybe. But not the whole Lawn. First, do things that are BAD for Chickweed. Low mowing -- the kind that people do on Colonial or Velvet Bentgrass Lawns, which are naturally VERY short, OR in their Cool Season Grass Lawn -- is GOOD FOR CHICKWEED, i.e., BAD FOR GRASS. This is a ground-hugging Weed. "}, {"url": "http://www.gardeningknowhow.com/plant-problems/weeds/how-to-kill-chickweed-best-way-to-kill-chickweed.htm", "passage_text": "How to Kill Chickweed in the Lawn In lawn areas, pull chickweed from the ground to expose the soil. The soil should then be aerated with an aerator or shovel. If using a shovel, place gashes in the ground at least two to three inches deep and every one or two square foot. Once you do begin to water, continue to do so each day for about two to three weeks. Any leftover chickweed should begin to die while new grass replaces it. Whether you choose to eradicate chickweed manually or with an herbicide is up to you. However, the best way to kill chickweed is before it has time to set seed."}, {"url": "http://www.gardeningknowhow.com/plant-problems/weeds/how-to-kill-chickweed-best-way-to-kill-chickweed.htm", "passage_text": "There are a number of herbicides, however, that will kill chickweed on contact and are best used in early spring to prevent seeds from germinating. Glyphosate herbicide (Round-up) can be used to eradicate chickweed, attacking the root system and killing the entire plant. Once you do begin to water, continue to do so each day for about two to three weeks. Any leftover chickweed should begin to die while new grass replaces it. Whether you choose to eradicate chickweed manually or with an herbicide is up to you. However, the best way to kill chickweed is before it has time to set seed."}, {"url": "https://burke.ces.ncsu.edu/Controlling+Chickweed/", "passage_text": "Summer annuals germinate in the spring and grow during the summer and die with frost. One of the most pesky winter annual weeds is common chickweed. Homeowners tend to overlook its germination in the fall and only notice its presence in the spring when it begins to grow vigorously in thin and bare spots of the lawn. By June, chickweed is on the down hill side of its life span and will die out when the days become hot. We are a very reactive society, however, and when we notice the chickweed, we have an overwhelming desire to do something right now. It’s too late this year to go with pre-emergent herbicides. Chickweed and other winter annuals are already up and growing. Post-emergent herbicides should be applied after the weed is up and actively growing. The target application time should be from October to early March."}, {"url": "http://www.ortho.com/smg/goprod/ortho-weed-b-gon-chickweed-clover-oxalis-killer/prod70214", "passage_text": "Finally I read online about Weed B Gon for Chickweed, Clover & Oxalis and I am sure glad that I did this stuff is great. October 3, 2014. Rated 5 out of 5 by rbartyczak Best product to control oxalis This past spring, my lawn had a serious infestation of oxalis. "}, {"url": "http://forums2.gardenweb.com/discussions/1497771/what-will-happen-if-i-do-not-kill-off-mouse-ear-chickweed", "passage_text": "My front and backyard are pretty weed free. My side yard has a lot of mouse-ear chickweed. I am not keen on using weed killers like Weed-Be-Gone anymore. I am hoping that one day my cultural practices will lead to a lawn that will choke out weeds. I also don't need a trophy lawn and will tolerate some weeds. I had a thick infestation in a renovated area of KBG. After the KBG woke up and started to grow, it overtook the chickweed really fast. However, I did use weed-be-gone on those weeds so I couldn't say that cultural practices alone took my chickweed out."}, {"url": "http://www.scotts.com/smg/goART3/Howto/how-to-kill-chickweed/34300030", "passage_text": "Overview. Chickweed: Kill, Control & Prevent It. Chickweed, also known as starwort, satin flower, and other names, is an annual that grows from seeds that sprout in the fall. It is found throughout North America most commonly as a lawn weed. Treat chickweed in your lawn with a lawn weed control product. To kill weeds and feed your lawns at the same time, use a product such as Scotts® Turf Builder® Weed & Feed."}, {"url": "https://en.wikipedia.org/wiki/9_Chickweed_Lane", "passage_text": "9 Chickweed Lane. From Wikipedia, the free encyclopedia. 9 Chickweed Lane is an American comic strip written and drawn by Brooke McEldowney following the fortunes of the women of three generations of the Burber family – Edna, Juliette, and Edda – as they try to make their way in the world. 9 Chickweed Lane is the address of the characters' former family home. The strip is syndicated by United Media. It debuted on July 12, 1993, and won the National Cartoonists Society Award for Newspaper Strip in 2005. Brooke McEldowney is also the creator of the webcomic Pibgorn, a spin-off. "}]