[{"url": "http://mikesfence.com/concrete/concrete-tips/", "passage_text": "Wind, humidity, and sunlight are all factors in how long it takes for concrete to cure, walking, normally about 1 to 2 days. 5. How long does it take for concrete to cure enough to drive on? Again, wind, humidity, and sunlight are all factors but the standard is about 5 to 7 days. 1 Start with a minimum of 2 people for a 1 cubic yard pour. 2  Add one person for each additional cubic yard of concrete. 3  If you are using wheelbarrows to move the concrete form the truck to the forms, add an additional person."}, {"url": "http://www.diychatroom.com/f19/when-safe-walk-fresh-concrete-10672/", "passage_text": "Conventional concrete setting times are bit more subjective. Assuming that optimum temperatures are present during pouring and setting, you can *possibly* walk it in 24 hours, but gently. I like to wait 48 hours to be on the safe side. It will take 7 days to reach 2,500 lbs. The only stupid question is the one not asked. Not only can you get DIY advice at the Chatroom but a bit of Chinese philosophy as well. ****************************. The fast setting concrete answer is easy. You can walk it in 2 hours and set heavy objects in 4 hours."}, {"url": "http://www.answers.com/Q/How_long_does_it_take_concrete_to_dry", "passage_text": "Concrete gets progressively harder over time its called curing. However it depends on several thing like temperature and moisture. You can typically walk on concrete the next day but it can be prone to scratching. I generally have my customers wait two days to walk on it and 7-10 days to drive. In summer time on hot days concrete can cure to fast and crack within hours. "}, {"url": "http://www.diychatroom.com/f19/when-safe-walk-fresh-concrete-10672/", "passage_text": "The 28 days is not really how long it takes concrete to cure. Concrete continues to gain strength for years as long as some type of moisture (even humidity) is available. The 28 days is the standard time at which they test samples in the a to determine if the mix meets the specifications. The only stupid question is the one not asked. Not only can you get DIY advice at the Chatroom but a bit of Chinese philosophy as well. ****************************. The fast setting concrete answer is easy. You can walk it in 2 hours and set heavy objects in 4 hours."}, {"url": "https://au.answers.yahoo.com/question/index?qid=20080330084148AAMDbHs", "passage_text": "For around home use, you are wondering how soon can you get onto the next phase of the project-whatever that project may be. It does depend on the project as to whether you will be safe or not. For example, mortar in the bottom of a new shower pan can be worked on within a day. Also depends on where you get the cement from .. something like B&Q isnt very potent and so may take longer. Leave it at least 48 hours before you walk on it. Source(s): Work for the largest concrete companies in the world selling concrete, asphalt and aggregates."}, {"url": "http://www.concretecamouflage.com/concrete_stain_scheduling_dryi.cfm", "passage_text": "Usually an hour or two. Once you can walk on it, apply the second coat. Applying Sealer-about 1 hour each coat Drying time (between coats) - about 1-3 hours Drying time (final coat) - 24 hours minimum to 48 hours to 72 hours or more in colder weather. If you are doing an exterior project then you are complete. Once you can walk on it, apply the second thin and even coat. Applying Sealer-about 1 hour each coat. Drying time (between coats) - about 1-3 hours. Drying time (final coat) - 10 hours minimum to 24 hours or more in colder weather or more humid weather."}, {"url": "http://patch.com/new-york/larchmont/how-long-does-it-take-polyurethane-to-dry-on-the-floors", "passage_text": "Water based polyurethane dries faster. 1  4-6 hrs before you can walk on the floors. 2  Hours 6-24, you can walk on the floors with socks. 3  Avoid shoes and bare feet. 4  And, make sure your pets don't walk on the floors during this interval. 5  1 hrs you can walk on it with shoes. 6  After 2 days, you can move furniture back. Oil based polyurethane takes longer to dry than water based poly. 1  24 hrs before you can walk on the floors. 2  Hours 24-48, you can walk on the floors with socks. 3  Avoid shoes and bare feet. 4  And, make sure your pets (who usually have bare feet) do not walk on the floors during this time. 5  48 hrs you can walk on it with shoes"}, {"url": "http://patch.com/new-york/larchmont/how-long-does-it-take-polyurethane-to-dry-on-the-floors", "passage_text": "1 24 hrs before you can walk on the floors. 2  Hours 24-48, you can walk on the floors with socks. 3  Avoid shoes and bare feet. 4  And, make sure your pets (who usually have bare feet) do not walk on the floors during this time. 5  48 hrs you can walk on it with shoes. 6  After 4 days, you can move furniture back on to the floors. Oil based polyurethane takes longer to dry than water based poly. 1  24 hrs before you can walk on the floors. 2  Hours 24-48, you can walk on the floors with socks. 3  Avoid shoes and bare feet. 4  And, make sure your pets (who usually have bare feet) do not walk on the floors during this time. 5  48 hrs you can walk on it with shoe"}]