[{"url": "http://www.medicinenet.com/pheochromocytoma/article.htm", "passage_text": "Some people, however, never develop symptoms of a pheochromocytoma. Up to 10% of cases are discovered incidentally, meaning that they are not suspected and only found when the patient is undergoing diagnostic studies for other conditions. The catecholamine-secreting cells are sometimes referred to as chromaffin cells, and they are found in other areas of the body as well as in the adrenal medulla. Sometimes, pheochromocytomas arise from chromaffin cells that are located outside of the adrenal gland."}, {"url": "http://medical-dictionary.thefreedictionary.com/Phenochromocytoma", "passage_text": "Pheochromocytomas can be found anywhere chromaffin cells are found. They may be found in the heart and in the area around the bladder, but most (90%) are found in the adrenal glands. Every individual has two adrenal glands that are located above the kidneys in the back of the abdomen. "}, {"url": "http://medical-dictionary.thefreedictionary.com/pheochromocytoma", "passage_text": "Pheochromocytomas can be found anywhere chromaffin cells are found. They may be found in the heart and in the area around the bladder, but most (90%) are found in the adrenal glands. Every individual has two adrenal glands that are located above the kidneys in the back of the abdomen. "}, {"url": "http://ghr.nlm.nih.gov/condition/hereditary-paraganglioma-pheochromocytoma", "passage_text": "Hereditary paraganglioma-pheochromocytoma is a condition characterized by the growth of noncancerous (benign) tumors in structures called paraganglia. Paraganglia are groups of cells that are found near nerve cell bunches called ganglia. A tumor involving the paraganglia is known as a paraganglioma. A type of paraganglioma known as a pheochromocytoma develops in the adrenal glands, which are located on top of each kidney and produce hormones in response to stress. Other types of paraganglioma are usually found in the head, neck, or trunk."}, {"url": "http://www.surgery.usc.edu/divisions/tumor/pancreasdiseases/web%20pages/Endocrine%20tumors/adrenal/pheochromocytoma.html", "passage_text": "A pheochromocytoma is a tumor that usually arises in the adrenal medulla and the patient presents with signs and symptoms of excessive production of catecholamines. "}, {"url": "http://www.cancer.gov/types/pheochromocytoma/patient/pheochromocytoma-treatment-pdq", "passage_text": "1 Pheochromocytoma is a rare tumor that forms in the adrenal medulla (the center of the adrenal gland). 2  Paragangliomas form outside the adrenal gland. 3  Certain inherited disorders and changes in certain genes increase the risk of pheochromocytoma or paraganglioma. Localized Pheochromocytoma and Paraganglioma. Treatment of localized benign pheochromocytoma or paraganglioma is usually surgery to completely remove the tumor. If the tumor is in the adrenal gland, the entire adrenal gland is removed."}, {"url": "http://www.medicinenet.com/pheochromocytoma/article.htm", "passage_text": "1 Pheochromocytoma is a relatively rare tumor of the adrenal glands or of similar specialized cells outside of the adrenal glands. 2  Pheochromocytomas secrete catecholamine hormones (adrenaline and related hormones) that are responsible for the characteristic symptoms. The catecholamine-secreting cells are sometimes referred to as chromaffin cells, and they are found in other areas of the body as well as in the adrenal medulla. Sometimes, pheochromocytomas arise from chromaffin cells that are located outside of the adrenal gland."}, {"url": "http://columbiasurgery.org/conditions-and-treatments/pheochromocytoma", "passage_text": "The classic symptoms of pheochromocytoma include: high blood pressure, rapid heart rate (palpitations), headache, flushing, and sweating. In addition, patients may feel like they are having an anxiety or panic attack (difficulty breathing, weakness, a feeling that something bad is happening). High blood pressure (i.e. hypertension) is the most common symptom related to pheochromocytoma, but in 10% of patients, the blood pressure may be normal. The blood pressure may always be high or may happen in bursts (i.e. episodic hypertension)."}, {"url": "http://www.medicinenet.com/pheochromocytoma/article.htm", "passage_text": "Basically, a pheochromocytoma is a tumor of these catecholamine-secreting cells, and that causes the clinical signs and symptoms we will discuss below. The catecholamine-secreting cells are sometimes referred to as chromaffin cells, and they are found in other areas of the body as well as in the adrenal medulla. Sometimes, pheochromocytomas arise from chromaffin cells that are located outside of the adrenal gland."}, {"url": "http://emedicine.medscape.com/article/379861-overview", "passage_text": "Third, approximately 10% of pheochromocytomas are malignant. Incidentally, pheochromocytomas are called the 10% tumor because they are associated with a 10% risk of malignancy, because 10% of the tumors are bilateral, and because 10% of the tumors are extra-adrenal. Early detection may reduce the risk of metastasis. Usually, tumors are larger than 3 cm when seen."}]