[{"url": "http://www.bbc.co.uk/nature/life/Megapode", "passage_text": "These birds have large feet which they use to make big heaps of vegetation or shallow burrows in which they incubate their eggs. Unusually, their chicks are quite well-developed and have their feathers by the time they hatch so they don't need parental care (precocial). Scientific name: Megapodiidae. "}, {"url": "https://en.wikipedia.org/wiki/Megapode", "passage_text": "Their name literally means large foot (Greek: mega = large, poda = foot), and is a reference to the heavy legs and feet typical of these terrestrial birds. All are browsers, and all but the malleefowl occupy wooded habitats. Most are brown or black colored. Megapodes are superprecocial, hatching from their eggs in the most mature condition of any birds. They hatch with open eyes, bodily coordination and strength, full wing feathers and downy body feathers, and are able to run, pursue prey, and, in some species, fly on the same day they hatch. This cross-section of a megapode mound shows a layer of sand (up to 1 m thick) used for insulation, an egg chamber, and a layer of rotting compost."}, {"url": "http://www.yourdictionary.com/megapod", "passage_text": "noun. The definition of a megapod, also spelled megapode, is a member of the family Megapodiidae, which are large-footed, ground-dwelling birds in the East Indies, South Pacific and Australia. An example of a megapod is a bird that buries their eggs to hatch them. mega- + -pod. large-footed. "}, {"url": "http://www.thefreedictionary.com/megapode", "passage_text": "Noun. 1. megapode-large-footed short-winged birds of Australasia; build mounds of decaying vegetation to incubate eggs. mound bird, mound-bird, scrub fowl, mound builder. gallinacean, gallinaceous bird-heavy-bodied largely ground-feeding domestic or game birds. family Megapodiidae, Megapodiidae-megapodes"}, {"url": "http://www.evidenceofdesign.com/the-megapode-or-incubator-bird/", "passage_text": "The bird weighs 3-4 pounds fully grown. The male uses his big feet to build a nest for his mate. And what a nest it is! It measures as large as 50 feet wide and 20 feet high, made of decaying vegetation. Once the male has built the nest, the female tests the nest to see if it will be adequate for her eggs. When she accepts the nest, the female megapode starts to lay eggs deep in the vegetation, one egg every three days for up to seven months. That’s 20 to 35 eggs total. Since the egg is the size of an ostrich egg, that is quite a workout for mom!"}, {"url": "https://www.facebook.com/notes/scientific-miracles-of-islam/the-heat-technology-of-the-megapode-bird/202131689808684", "passage_text": "April 8, 2011 at 2:31pm. A bird called the megapode living in the Pacific islands prepares an interesting incubation machine for its offspring. During the summer season, the female megapode lays one egg every six days. However, the eggs of the megapode are relatively big compared to its size, being almost as big as an ostrich egg. For this purpose, six months before the spawning season comes, the male megapode starts to dig a hole 5 meters in diameter and 1 meter in depth with its gigantic claws. Then, it fills the hole with wet weed and leaves. The main purpose is to use the heat produced by the bacteria in decaying plants to warm the eggs."}, {"url": "http://encyclopedia2.thefreedictionary.com/Megapodidae", "passage_text": "megapode. (mĕg`əpōd') , common name for large, stout-bodied, long-tailed, terrestrial, nonmigratory birds comprising six genera in the family Megapodiidae. Members of the family have large, strong feet, hence the name megapode (from the Greek meaning large foot). "}, {"url": "https://en.wikipedia.org/wiki/Megapode", "passage_text": "Megapode chicks do not have an egg tooth; they use their powerful claws to break out of the egg, and then tunnel their way up to the surface of the mound, lying on their backs and scratching at the sand and vegetable matter. This cross-section of a megapode mound shows a layer of sand (up to 1 m thick) used for insulation, an egg chamber, and a layer of rotting compost."}, {"url": "http://www.astronoo.com/en/articles/megapode.html", "passage_text": "In the archipelago of Papua New Guinea, in the caldera of the extinct volcano Mount Bosavi, the Megapodius (Megapodius affinis) burrow into the hot ashes to bury their eggs oval. The megapode New Guinea, is a bird incubator, squat like a big chicken with small heads and large feet, the family Megapodiidae. Besides their name literally means large foot (from the Greek, mega and Poda). Megapode occupy natural habitats of subtropical forests and wetlands are mostly brown or black. His head is paler than its body, and it has a gray crest, a yellow beak and long legs, dull yellow. At birth the megapodes are super early."}, {"url": "http://www.thefreedictionary.com/megapode", "passage_text": "meg·a·pode. n. Any of various large-footed, ground-dwelling birds of the family Megapodiidae, found in Australia, Southeast Asia, and the South Pacific islands, that build mounds or burrows of earth and compost in which to incubate their eggs. Also called mound builder. megapode-large-footed short-winged birds of Australasia; build mounds of decaying vegetation to incubate eggs. mound bird, mound-bird, scrub fowl, mound builder. gallinacean, gallinaceous bird-heavy-bodied largely ground-feeding domestic or game birds."}]