[{"url": "http://worldpopulationreview.com/countries/equatorial-guinea-population/", "passage_text": "Equatorial Guinea Population 2015. Equatorial Guinea, officially the Republic of Equatorial Guinea, is a small country in Central Africa that has a mainland region and an insular region, which consists of the Bioko islands in the Gulf of Guinea and Annobon, a volcanic island. Most people of Equatorial Guinea are of Bantu origin. The Fang are the largest ethnic group and indigenous to the mainland, but migration to Bioko Island in recent years has allowed the Fang population to surpass that of the earlier Bubi inhabitants. 86% of the population is Fang, with 67 separate clans."}, {"url": "http://mecometer.com/whats/equatorial-guinea/population-denisty/", "passage_text": "10 years growth Equatorial Guinea's Population density had a positive growth of 23.0 (%) in the last 10 years from (2004 to 2014). Value & Rank The Population density of Equatorial Guinea is 25.7 (capita per square kilometer) with a global rank of 167."}, {"url": "http://www.infoplease.com/country/equatorial-guinea.html", "passage_text": "Equatorial Guinea, formerly Spanish Guinea, consists of Rio Río (10,045 10045 sq; 26,117 26117 sq), km on the western coast Of, africa and several islands in The gulf Of, guinea the largest of which Is (bioko Formerly Fernando) (po 785 sq; 2,033 2033 sq). Km the other islands Are, Annobon, Annobón Corisco, elobey Grande And. elobey chico Geography. Equatorial Guinea, formerly Spanish Guinea, consists of Rio Río (10,045 10045 sq; 26,117 26117 sq), km on the western coast Of, africa and several islands in The gulf Of, guinea the largest of which Is (bioko Formerly Fernando) (po 785 sq; 2,033 2033 sq). km"}, {"url": "http://www.tradingeconomics.com/equatorial-guinea/population", "passage_text": "1960 - 2014. Million. Yearly. The population of Equatorial Guinea represents 0.01 percent of the world´s total population which arguably means that one person in every 9690 people on the planet is a resident of Equatorial Guinea. The total population in Equatorial Guinea was last recorded at 0.8 million people in 2014 from 0.3 million in 1960, changing 212 percent during the last 50 years."}, {"url": "http://worldpopulationreview.com/countries/equatorial-guinea-population/", "passage_text": "The estimated 2015 population of Equatorial Guinea is 800,000, which ranks 163rd in the world. Equatorial Guinea 's estimated 2015 population of 800,000 is a fairly sizable increase from the estimated 2012 population of 736,000. Equatorial Guinea has just 28,050 square kilometers of land, ranking 144th in the world, and its population is in line with this. The country also has a low population density of just 24 people per square kilometer (63/square mile), which ranks 187th in the world. Most people of Equatorial Guinea are of Bantu origin. The Fang are the largest ethnic group and indigenous to the mainland, but migration to Bioko Island in recent years has allowed the Fang population to surpass that of the earlier Bubi inhabitants. 86% of the population is Fang, with 67 separate clans."}, {"url": "http://mecometer.com/whats/equatorial-guinea/population-denisty/", "passage_text": "Last 10 years average Equatorial Guinea had an average Population density of 23.5 (capita per square kilometer) in the last 10 years from (2004 to 2014). Value & Rank The Population density of Equatorial Guinea is 25.7 (capita per square kilometer) with a global rank of 167."}, {"url": "http://countryeconomy.com/demography/population/equatorial-guinea", "passage_text": "Increases in Equatoguineans population. Equatorial Guinea ended 2014 with a population of 778,061 people, which represents an increasea of 21,047 people compared to 2013. Equatorial Guinea ranks No. 161 among196 countries which published this information in countryeconomy.com. The male population is greater, with 387,677 men, representing 51.21% of the total, compared to 369,337 or 51.21% women. Equatorial Guinea shows a moderate population density, with 28 people per square km and it was in position 45th in our ranking of density population in 2014. In this page we show you the progression of the population in Equatorial Guinea. "}, {"url": "https://en.wikipedia.org/wiki/Equatorial_Guinea", "passage_text": "Formerly the colony of Spanish Guinea, its post-independence name evokes its location near both the Equator and the Gulf of Guinea. Equatorial Guinea is the only sovereign African state in which Spanish is an official language. As of 2012, the country has a population of 1.6 million. Equatorial Guinea consists of two parts, an insular and a mainland region. The insular region consists of the islands of Bioko (formerly Fernando Po) pó in The gulf Of guinea And, annobon annobón a small volcanic island south of. the equator Bioko Island is the northernmost part of Equatorial Guinea and is the site of the country's capital, Malabo. The island nation of Sao São tome Tomé and principe príncipe Is located Between. bioko and"}]