[{"url": "https://www.gourmet-web.com/Interesting-facts-about-copper-pots-and-copper-cookware", "passage_text": "Maintenance of copper cookware and copper pots. As copper is a very soft material, it is scratch-sensitive. Prior to sale, the manufacturer BAUMALU polishes the copper cookware in order to ensure that it has a mirror finish."}, {"url": "http://www.ehow.co.uk/about_5089217_copper-used-pots-pans.html", "passage_text": "Copper can even be used for the entire outside of a pot. Copper is a shiny metal that's the colour of a penny. Beyond its attractiveness, copper offers several benefits to cooks. Knowing why copper is used in pots and pans will help you decide if you need this type of cookware."}, {"url": "http://www.answers.com/Q/Why_are_pots_and_pans_made_out_of_metals_like_copper_and_aluminum", "passage_text": "Copper and aluminum conduct heat quite a bit better than iron, so pans made of those metals generally get the heat to the food better. The thermal conductivity of copper is ab … out 25% better than aluminum, and aluminum is about 3 times as good as iron, just to ball park the performance."}, {"url": "https://www.gourmet-web.com/Interesting-facts-about-copper-pots-and-copper-cookware", "passage_text": "Copper has been used and cherished for around 9,000 years. Pots that are made of copper are ideal heat conductors; the material is durable, hygienic and corrosion-resistant. Above all, it is the excellent heat conductivity that makes copper a perfect base material for pots and pans."}, {"url": "https://www.gourmet-web.com/Interesting-facts-about-copper-pots-and-copper-cookware", "passage_text": "Tin-coated copper cookware by BAUMALU. Copper pots are often coated with tin, which is used to prevent the direct contact between the food and the copper and makes it possible to leave the food to cool down in a copper pot. However, the tin plating changes colour over time-it turns more or less grey."}, {"url": "http://www.hertzmann.com/articles/2001/copper/", "passage_text": "Copper pots from France are generally available in two varieties: a cooking version, as described above, and a table service version made of thinner copper with brass handles. The table service version is designed for presenting, or serving, a dish at the table."}, {"url": "http://www.ehow.co.uk/about_5089217_copper-used-pots-pans.html", "passage_text": "Types of Copper Cookware. Copper cookware is made of copper on the outside with an inside liner made of stainless steel or tin. This keeps the copper from being absorbed into the food. Copper is also used in the base of stainless steel and aluminium pots and pans to improve heat conductivity. The colour of this cookware is silver, but you will see a layer of copper on the outside of the pan near the bottom. It will be advertised using phrases like copper core, copper clad or copper bottom.."}]