[{"url": "http://www.cic.gc.ca/english/passport/child/", "passage_text": "Passports for children. All Canadian children, from newborns to age 16, require their own passport to travel. Children may only be issued a passport with a maximum validity of 5 years. A child’s passport remains valid until it reaches its expiry date, even after the child turns 16."}, {"url": "http://www.citizensinformation.ie/en/travel_and_recreation/travel_abroad/passports/renewing_an_irish_passport.html", "passage_text": "You can pay for your Irish passport through Passport Express or at a Passport Office public counter if you are living in Ireland. If you are using An Post's Passport Express service, you should pay the passport application fees and the extra Passport Express fee directly to An Post. "}, {"url": "http://www.us-passport-service-guide.com/how-do-i-renew-a-childs-expired-passport.html", "passage_text": "If only one parent can appear, then the applying parent must submit either a notarized consent form from the non-applying parent or evidence of sole legal custody. For a child's passport book, the application fee is $60 and the execution fee is $25. Expedited service is an additional $60. For more information, click the links below. "}, {"url": "https://www.gov.uk/get-a-child-passport", "passage_text": "To get a child passport, your child must be under 16 and one of the following: 1  a British citizen. 2  a British overseas territories citizen. 3  a British overseas citizen. Your child must apply for a 10-year adult passport if they’ll be 16 within the next few weeks or they’re already over 16."}, {"url": "http://www.aph.com/community/know-before-you-go/cost-uk-passports/", "passage_text": "A standard adult first passport or renewal costs £72.50, or £82.25 if you use the Post Office’s Passport Check and Send service. Child passports cost £46, or £55.75 using Check and Send. you can read more here. "}, {"url": "https://www.gov.uk/get-a-child-passport", "passage_text": "Children nearly or over 16 years old. Your child must apply for a 10-year adult passport if they’ll be 16 within the next few weeks or they’re already over 16."}, {"url": "http://traveltips.usatoday.com/renew-child-passport-usa-1700.html", "passage_text": "Step 2. Place in the envelope the child's previously undamaged U.S. passport, along with proof of your relationship with her. The following documents, which must contain both parents' names, are acceptable as proof: the child's U.S. or foreign certified birth certificate, a report of birth abroad, or an adoption decree. The primary difference between renewing a child's passport and an adult's is that the child must appear in front of a passport agent, with his parents and with evidence of parental custody."}, {"url": "https://www.gov.uk/passport-fees", "passage_text": "Passport fees. A standard adult first passport or renewal costs £72.50, or £82.25 if you use the Post Office’s Passport Check and Send service. Child passports cost £46, or £55.75 using Check and Send. You can’t get a refund if you cancel your application or you’re not entitled to a passport. Extending a restricted validity passport is free if the passport was issued before 1 May 2008. An extension for a passport issued on or after 1 May 2008 costs: 1  £72.50 for an adult passport. 2  £46 for a child passport."}, {"url": "https://uspassportnow.com/", "passage_text": "US Passport Now is registered and authorized with the US Government to expedite your passport request. We are not affiliated with the US Government as we charge an additional fee to expedite your passport in 1-14 days. If you are not in a hurry, you can apply for a passport directly from the US Government in 4-8 Weeks. Click here to learn more."}]