[{"url": "http://www.medicinenet.com/script/main/art.asp?articlekey=11772", "passage_text": "Opportunistic infection: An infection that occurs because of a weakened immune system. Opportunistic infections are a particular danger for people with AIDS. The HIV virus itself does not cause death, but the opportunistic infections that occur because of its effect on the immune system can."}, {"url": "http://hivsymptomsonline.com/two-examples-of-opprtunistic-infection.html", "passage_text": "What is mean by opportunistic infection-Two examples of opportunistic infections are given below. In day to day life we unknowingly carry out many germs such as, fungi, bacteria, protozoa and viruses. When a person is HIV infection free the immune system resists such invaders. It controls them properly. Examples of Opportunistic Infection. Before going to see the examples of opportunistic infection, it would be better to learn that what is HIV and how it helps such infections to attack on the immune system. HIV is known as Human Immuno Deficiency Virus. The virus leads to develop the AIDS. It attacks on the CD4 cells"}, {"url": "http://www.womenshealth.gov/hiv-aids/opportunistic-infections-and-other-conditions/", "passage_text": "People with HIV can develop opportunistic infections (OIs). These are infections that take advantage of weakness in the immune system. OIs also include certain types of cancer. Some OIs only affect women or affect women more than men. For example, certain female health problems, like yeast infections, are common to many women. For women with HIV, these problems are harder to treat and can be more serious. If you have HIV and develop one or more OIs, you might have AIDS. The good news is that there are ways to prevent and treat many OIs."}, {"url": "http://hivsymptomsonline.com/two-examples-of-opprtunistic-infection.html", "passage_text": "Examples of opportunistic infections are given here for your sake. You can get the list of such examples in the given article. Moreover you would be able to know that what is opportunistic infection and how it leads a person to the life threatening disease that is AIDS. Examples of Opportunistic Infection. Before going to see the examples of opportunistic infection, it would be better to learn that what is HIV and how it helps such infections to attack on the immune system. HIV is known as Human Immuno Deficiency Virus. The virus leads to develop the AIDS. It attacks on the CD4 cells"}, {"url": "https://en.wikipedia.org/wiki/Opportunistic_infection", "passage_text": "An opportunistic infection is an infection caused by bacterial, viral, fungal, or protozoan pathogens that take advantage of a host with a weakened immune system or an altered microbiota (such as a disrupted gut flora). Many of these pathogens do not cause disease in a healthy host that has a normal immune system. "}, {"url": "http://www.aids.org/topics/aids-factsheets/aids-background-information/what-is-aids/hiv-testing/cd4-t-cell-tests/opportunistic-infections/", "passage_text": "When our immune system is working, it controls these germs. But when the immune system is weakened by HIV disease or by some medications, these germs can get out of control and cause health problems. Infections that take advantage of weakness in the immune defenses are called “opportunistic”. The phrase “opportunistic infection” is often shortened to “OI”. HIV weakens the immune system so that opportunistic infections can develop. If you are HIV-infected and develop opportunistic infections, you might have AIDS. In the US, the Center for Disease Control (CDC) is responsible for deciding who has AIDS. The CDC has developed a list of about 24 opportunistic infections."}, {"url": "http://www.thebody.com/h/examples-of-opportunistic-infections.html/", "passage_text": "The term opportunistic infection is used to describe infections that occur in people who have deficiencies in their immune system-it is opportunistic because these infections take advantage of the defect in the host.-JC Read more ». "}]