[{"url": "http://www.ehow.com/about_4578617_meaning-german-flag.html", "passage_text": "Save. The colors of the German flag have been a point of contention within the country for many years. After World War I and until 1933, the Weimar Germany flag consisted of the same tri-color black, red and gold found in the current flag. The colors of the current flag of Germany don't hold a specific meaning, but have strong ties to the history of Germany and are accepted to represent republican democracy, German unity and freedom, of the country and personal freedom."}, {"url": "https://en.wikipedia.org/wiki/Flag_of_Germany", "passage_text": "The flag of Germany is a tricolour consisting of three equal horizontal bands displaying the national colours of Germany: black, red, and gold. The flag was first adopted as the national flag of modern Germany in 1919, during the Weimar Republic. Germany has two competing traditions of national colours, black-red-gold and black-white-red, which have played an important role in the modern history of Germany."}, {"url": "http://www.worldflags101.com/g/germany-flag.aspx", "passage_text": "German Flag Meaning: The colors black, red and gold have been associated with Germany since the middle ages, but the current German flag colors are traced back to early 19th century volunteers, who fought for the country in the Napoleonic wars. The colors of the German flag now represent the unification of Germany. From 1935 to 1945, the German flag featured a red background with a black Swastika in the middle of it on a white circle. The former East German flag (1959 to 1989) featured Communist emblems on it."}, {"url": "http://www.answers.com/Q/What_do_the_colors_on_the_German_flag_represent", "passage_text": "The colours on the German flag since 1949 are black-red-gold. These were the colours of: 1. The flag of the Holy Roman Empire from about 1402-1806. (The flag consisted of a black double-headed eagle with red claws on a bright golden ground. Obviously, there are also plenty of fanciful, pseudo-poetic ideas about the colors. The colors on the German flag are black, red and yellow. They can be traced back to the m … edieval banner of the Holy Roman Emperor from about 1402-1806. The three equal bands of red, black and gold"}, {"url": "http://germanyflag.facts.co/germanyflagof/germanyflag.php", "passage_text": "Gold Hex code: #FFCC00. Germany Flag-History, Facts & information for kids. Black, red and gold colors have played an important role in German history and can be traced back to the medieval banner of the Holy Roman Emperor-a black eagle with red claws and beak on a gold field."}, {"url": "http://www.answers.com/Q/What_do_the_colors_on_the_German_flag_mean", "passage_text": "the colors of the German flag are black, red, and yellow red:hardiness, bravery, strength & velour black:Determination yellow: a symbol of giving. + 49 others found this useful. The colors on the German flag are black, red and yellow. They can be traced back to the medieval banner of the Holy Roman Emperor from about 1402-1806."}, {"url": "https://answers.yahoo.com/question/index?qid=20070121133736AAZLA7o", "passage_text": "· just now. Report Abuse. German Flag Meaning: The colors black, red and gold have been associated with Germany since the middle ages, but the current German flag colors are traced back to early 19th century volunteers, who fought for the country in the Napoleonic wars. Best Answer: As the above picture of the German Flag indicates the overall background is Red, black and gold The description of the German Flag is as follows: Three equal horizontal bands of black (top), red, and gold According to Ancient and Heraldic traditions much symbolism is associated with colors."}, {"url": "http://www.crwflags.com/fotw/flags/de_color.html", "passage_text": "The German flag consists of the colors of the coat-of-arms of the Holy Roman Empire of the German Nation (i.e. the First Reich) - a black eagle, with red beak and claws, on a gold field. The red, at least, does not mean anything; it is usual to paint the claws red, unless the beast itself is red or on a red field. "}, {"url": "http://www.answers.com/Q/What_do_the_colors_on_the_German_flag_mean", "passage_text": "Obviously, there are also plenty of fanciful, pseudo-poetic ideas about the colors. The colors on the German flag are black, red and yellow. They can be traced back to the medieval banner of the Holy Roman Emperor from about 1402-1806. The three equal bands of red, black and gold consisted of a black double-headed eagle with red claws on a bright golden ground"}]