[{"url": "http://home.costhelper.com/install-gas-line.html", "passage_text": "1 If your gas company charges to install a new gas line and you'd rather hire your own certified plumber or contractor, go ahead and get a quote from the gas company, then make sure the bids from the private companies include the same specifications as the gas company's quote. 1 If not, running a new line from the gas manifold (where the gas service to your house starts) to where you want the new appliance installed might take 20-30 linear feet or more, which works out to $300-$750."}, {"url": "http://home.costhelper.com/gas-fireplace.html", "passage_text": "1 Ventless (also called vent-free or unvented) gas fireplaces don't need a chimney or vent, and are either zero clearance (right against a wall) or close clearance (a few inches away). 2  They cost about $400-$1,500 plus installation of the gas lines and any desired mantle or surround. 1 Options include fans to move the heat, remote controls, wall switches and wall-mounted thermostats. 2  Inserts cost $1,200-$2,900, with professional installation adding another $600-$1,000. 3  A direct-vent gas fireplace doesn't need a chimney and is a way to add a fireplace where there isn't one."}, {"url": "http://www.costowl.com/home-improvement/hvac-gas-line-piping-cost.html", "passage_text": "1 As a very general estimate, installing gas line costs $20 to $30 per foot. 2  In some areas and circumstances, however, the price could be $75 per foot or more. 3  This price should include the costs of trench digging and all necessary permits, drawings, and inspections. 1 Extending a gas line to accommodate a new appliance might cost $250 to $500. 2  If, however, that same appliance requires a new line running back to the manifold, costs could reach $500 to $1,000 or more."}, {"url": "http://www.costowl.com/home-improvement/hvac-gas-line-piping-cost.html", "passage_text": "The actual cost to install a gas line depends on the amount of piping needed, the local economy, the complexity of the installation, and other factors. 1  As a very general estimate, installing gas line costs $20 to $30 per foot. 2  In some areas and circumstances, however, the price could be $75 per foot or more. 1 Extending a gas line to accommodate a new appliance might cost $250 to $500. 2  If, however, that same appliance requires a new line running back to the manifold, costs could reach $500 to $1,000 or more."}, {"url": "http://homewyse.com/services/cost_to_install_gas_furnace.html", "passage_text": "Our free calculator uses recent, trusted data to estimate costs for your Gas Furnace Installation project. For a basic 1 furnace project in zip code 47474, the benchmark cost to Install a Gas Furnace ranges between $1,659.78 - $2,177.35 per furnace. To estimate costs for your project: 1"}, {"url": "http://home.costhelper.com/install-gas-line.html", "passage_text": "1 In estimating the cost having a new gas line professionally installed, expect to pay $15-$25 a linear foot to hire someone to handle everything -- labor, materials, testing and any required permits -- and there's often a minimum charge of at least $100. 1 If not, running a new line from the gas manifold (where the gas service to your house starts) to where you want the new appliance installed might take 20-30 linear feet or more, which works out to $300-$750."}, {"url": "http://www.homewyse.com/services/cost_to_install_gas_line.html", "passage_text": "$260.02. Get an INSTANT estimate of the cost to Install a Gas Line! Our free calculator uses recent, trusted data to estimate costs for your Gas Line Installation project. For a basic 1 line project in zip code 47474, the benchmark cost to Install a Gas Line ranges between $192.34 - $260.02 per line. To estimate costs for your project: 1"}, {"url": "http://www.homeadvisor.com/cost/heating-and-cooling/install-a-furnace/", "passage_text": "If you want to convert from an electric furnace to a gas furnace, you will need to have gas piping and ductwork installed first. This will add an additional up-front cost to the furnace and installation process of around $5,000 to $15,000 or more depending on the space. As with gas and electric furnaces, installation costs are generally higher for the pricier furnaces since they are installed by HVAC professionals with more experience. The oil furnace prices listed below are based on the size of a furnace needed to heat a standard home that is 1600-2000 square feet."}, {"url": "http://home.costhelper.com/gas-fireplace.html", "passage_text": "1 They cost about $400-$1,500 plus installation of the gas lines and any desired mantle or surround. 2  Some states do not allow the use of ventless fireplaces or restrict their use. 3  Some ventless models require you to keep a window open while using the fireplace. 1 Options include fans to move the heat, remote controls, wall switches and wall-mounted thermostats. 2  Inserts cost $1,200-$2,900, with professional installation adding another $600-$1,000. 3  A direct-vent gas fireplace doesn't need a chimney and is a way to add a fireplace where there isn't one."}, {"url": "http://www.homeimprovementpages.com.au/article/how_much_does_it_cost_to_install_gas_in_my_home", "passage_text": "No matter how much your gas installation costs, cooking and heating with gas will save you money over time. Where natural gas is available, switching from an electric oven and cooktop to gas can save up to $300 per year. If you need a gas fitter to install, replace or repair an appliance after gas has been installed in your home, you will probably be charged an hourly rate. Gas fitters typically charge $50 to $90 per hour and may charge a call-out fee of up to $100 even for small jobs."}]