[{"url": "http://www.arthritis.org/about-arthritis/where-it-hurts/hip-pain/hip-anatomy.php", "passage_text": "Advertisement. One of the body's largest weight-bearing joints, the hip is where the thigh bone meets the pelvis to form a ball-and-socket joint. The hip joint consists of two main parts: • Femoral head – a ball-shaped piece of bone located at the top of your thigh bone, or femur. • Acetabulum – a socket in your pelvis into which the femoral head fits. Bands of tissue, called ligaments, connect the ball to the socket, stabilizing the hip and forming the joint capsule"}, {"url": "https://en.wikipedia.org/wiki/Femur", "passage_text": "The femur is the only bone in the thigh. The two femurs converge medially toward the knees, where they articulate with the proximal ends of the tibiae. The femur is categorised as a long bone and comprises a diaphysis, the shaft (or body) and two epiphysis or extremities that articulate with adjacent bones in the hip and knee."}, {"url": "https://en.wikipedia.org/wiki/Femur", "passage_text": "Structure [edit]. The femur is the only bone in the thigh. The two femurs converge medially toward the knees, where they articulate with the proximal ends of the tibiae. The angle of convergence of the femora is a major factor in determining the femoral-tibial angle. The femur is categorised as a long bone and comprises a diaphysis, the shaft (or body) and two epiphysis or extremities that articulate with adjacent bones in the hip and knee."}, {"url": "https://en.wikipedia.org/wiki/Femur", "passage_text": "The femur (/ˈfiːmər/) (pl. femurs or femora (/ˈfɛmərə/)), or thigh bone, is the most proximal (closest to the center of the body) bone of the leg in tetrapod vertebrates capable of walking or jumping, such as most land mammals, birds, many reptiles such as lizards, and amphibians such as frogs. The femur is categorised as a long bone and comprises a diaphysis, the shaft (or body) and two epiphysis or extremities that articulate with adjacent bones in the hip and knee."}, {"url": "http://www.healthline.com/human-body-maps/femur", "passage_text": "Femur. The femur is the only bone located within the human thigh. It is both the longest and the strongest bone in the human body, extending from the hip to the knee. Important features of this bone include the head, medial and lateral condyles, patellar surface, medial and lateral epicondyles, and greater and lesser trochanters. The human femur can resist forces of 1,800 to 2,500 pounds, so it is not easily fractured. A break in this bone can only result from a large amount of force, such as a car accident or a fall from an extreme height. Such an injury can take three to six months to heal."}, {"url": "http://www.innerbody.com/image_skelfov/skel25_new.html", "passage_text": "Click to read more below. The femur, or thigh bone, is the longest, heaviest, and strongest bone in the entire human body. All of the body’s weight is supported by the femurs during many activities, such as running, jumping, walking, and standing. Extreme forces also act upon the femur thanks to the strength of the muscles of the hip and thigh that act on the femur to move the leg. The femur is classified structurally as a long bone and is a major component of the appendicular skeleton...."}, {"url": "http://orthoinfo.aaos.org/topic.cfm?topic=A00521", "passage_text": "Your thighbone (femur) is the longest and strongest bone in your body. Because the femur is so strong, it usually takes a lot of force to break it. Car crashes, for example, are the number one cause of femur fractures. The long, straight part of the femur is called the femoral shaft. 1 X-rays. 2  The most common way to evaluate a fracture is with x-rays, which provide clear images of bone. 3  X-rays can show whether a bone is intact or broken. 4  They can also show the type of fracture and where it is located within the femur."}]