[{"url": "https://helpx.adobe.com/indesign/using/exporting-publishing-pdf.html", "passage_text": "1 To create a PDF/X file, either choose a PDF/X preset from the Adobe PDF Preset menu, or choose a predefined PDF/X format from the Standard menu. 2  To customize options, select a category from the list on the left and then set the options."}, {"url": "http://www.ehow.com/how_6012985_do-open-pdf-indesign_.html", "passage_text": "Import Options. In the Place dialog, select your file, select Show Import Options and then click Open.. You can adjust how your PDF file is imported using this dialog. Specify a page or page range in the Pages group."}, {"url": "http://www.ehow.com/how_6012985_do-open-pdf-indesign_.html", "passage_text": "Place a PDF FIle. Most file types you import into InDesign are handled as graphics. While you can manipulate the imported PDF file as you would an image, you cannot edit a PDF file in InDesign. To import a graphic, click File and then Place… Select the PDF file you want to import and then click the Open button."}, {"url": "http://markzware.com/pdf2dtp/convert-pdf-adobe-indesign-cs6-pdf2dtp-plugin/", "passage_text": "Convert .pdf to Adobe InDesign files with PDF2DTP, the InDesign plugin from Markzware to edit PDF for Adobe Creative Suite INDD workflows for graphic design, print and publishing. Markzware is a well-established publisher of document conversion tools and other quality software products."}, {"url": "https://helpx.adobe.com/indesign/using/exporting-publishing-pdf.html", "passage_text": "You can export a document, a book, or selected documents in a book as a single PDF file. You can also copy content from your InDesign layout to the Clipboard, and automatically create an Adobe PDF file of that content."}, {"url": "http://indesignsecrets.com/pdf-to-indesign-i-have-seen-the-future.php", "passage_text": "The product added an Open PDF file to InDesign's file menu. It then pointed to the PDF document and opened it. Text in the PDF was converted to text frames. Images in the PDF were converted to images with a choice of JPEG, TIFF, or PNG. Vector objects were converted to vector objects (frames) with ID fills and strokes."}, {"url": "http://www.ehow.com/how_6012985_do-open-pdf-indesign_.html", "passage_text": "To export your InDesign document to a PDF file for redistribution, click File and then Export… Select Adobe PDF (Print) from the Save as Type drop-down and then click Save.. The General pane includes options to specify pages, layers and interactive elements to export."}]