[{"url": "http://searchsoa.techtarget.com/definition/alias", "passage_text": "1) In some computer operating system s and programming languages, an alias is an alternative and usually easier-to-understand or more significant name for a defined data object. The data object can be defined once and later a programmer can define one or more equivalent aliases that will also refer to the data object. In general, as a noun, an alias (pronounced AY-lee-uhs) is an alternate name for someone or something."}, {"url": "https://msdn.microsoft.com/en-us/library/ms190445.aspx", "passage_text": "An alias is an alternate name that can be used to make a connection. The alias encapsulates the required elements of a connection string, and exposes them with a name chosen by the user. Aliases can be used with any client application. To create an alias. In SQL Server Configuration Manager, expand SQL Server Native Client Configuration, right-click Aliases, and then click New Alias. In the Alias Name box, type the name of the alias. Client applications use this name when they connect. In the Server box, type the name or IP address of a server. For a named instance append the instance name. In the Protocol box, select the protocol used for this alias"}, {"url": "http://www.linfo.org/alias.html", "passage_text": "p. An alias can be created with the same name as the core name of a command (i.e., a command without any options or arguments). In such case, it is the alias that is called (i.e., activated) first when the name is used, rather than the command with the same name. alias l=ls-a. Then, the alias l could be used with any argument that the command ls could be used with. For example, to list the files and directories in the the /etc directory: l /etc. The alias l could also be used with any option"}, {"url": "https://kb.iu.edu/d/achy", "passage_text": "In Mac OS X, an alias is a pointer file that allows you to quickly open the files, folders, servers, or applications used most often. When you double-click an alias, the operating system finds the file it references and opens it. An alias can be distinguished by its icon, which has an arrow in the bottom left corner. 1 Contextual menus: Hold down the Ctrl key and click the item you wish to alias. 2  From the contextual menu, select. 3  The new alias will appear next to the original. 4  Keystroke: Select the item you wish to alias, and press Command-l (the lowercase L)."}, {"url": "http://legal-dictionary.thefreedictionary.com/Alias", "passage_text": "alias. ALIAS, practice. This word is prefixed to the name of a second writ of the same kind issued in the same cause; as, when a summons has been issued and it is returned by the sheriff, nil, and another is issued, this is called an alias summons. The term is used to all kinds of writs, as alias fi. fa., alias vend. alias. n. 1) a name used other the given name of a person or reference to that other name, which may not be an attempt to hide his/her identity (such as Harry for Harold, initials or a maiden name). (See: a.k.a.)."}, {"url": "http://help.unc.edu/help/what-is-an-email-alias-and-how-do-i-create-one/", "passage_text": "The alias for that address could be jane_doe@unc.edu. When messages are sent to the alias, they automatically go to your real email address. You can have up to a total of five (5) aliases. An alias can be paired with only one email address at a time. Your alias won’t change–just where your email is delivered. The best part of this is, if you’re using an alias and you change your email address, you won’t have to notify any of your correspondents, change your letterhead, or change your business cards! "}, {"url": "http://legal-dictionary.thefreedictionary.com/Alias", "passage_text": "Alias is a short and more popular phrase for alias dictus. The abbreviation a.k.a., also known as, is frequently used in connection with the description of a person sought by law enforcement officers to disclose the names that the person has been known to use. alias. n. 1) a name used other the given name of a person or reference to that other name, which may not be an attempt to hide his/her identity (such as Harry for Harold, initials or a maiden name). (See: a.k.a.)."}]