[{"url": "http://www.girlsaskguys.com/flirting/q141640-what-does-mean-when-guy-gives-you--really", "passage_text": "Even if it's a short tight hug, he likes you. The longer he hugs you it tells you he has time and doesn't want to let go. If it's a short tight hug, he's gotta go but he doesn't want to go. If it's a loose hug, it means just friends. Plain and simple. but yeah loose hugs (friend hug) tight hugs (don't let go). I don't think he meant to do that to me, but what does it mean when a guy hugs you really hard compared to when it's just a... Show More. A few days ago, the guy I like (who I think might like me) gave me a hug... it was actually more like squeezing me, and I felt like I was going to choke or stop breathing."}, {"url": "http://www.answers.com/Q/What_does_it_mean_when_a_guy_hugs_you_and_doesn't_let_go", "passage_text": "actually it doesn't mean anything. when he's you're friend its a friendly hug. and if its you're boyfriend its just saying hallo or goodbye, or he just wants to hold you tight … and never let go! Making the world better, one answer at a time. Well there are 3 types of hugs that have a definiton. For example the 1st hug is when the male or female gives a hug but you lower body is about 2 feet away and the only thing that is close to you is their arms...."}, {"url": "https://ca.answers.yahoo.com/question/index?qid=20071012202943AATcPfk", "passage_text": "Next. what does it mean when a guy hugs you so tight and feels like he doesnt wanna let go lolz..and what does it mean when he asks you for hugs like 3 times in one day..we work with eachother but are friends and 17 years old... Add your answer. Source. See how he hugs other girls if he hugs them like he hugs you than you have your answer your he's Buddy. If he doesn't well than good for you, you got your self a guy."}, {"url": "http://www.answers.com/Q/What_does_it_mean_when_a_guy_hugs_you_and_doesn't_let_go", "passage_text": "What does it mean when a guy throws you over his shoulder and hugs you for ages and won't let u go but he says he docent like u in that way I'm confused? Probably means that he's confused, likes to flirt with you, but doesn't want the awkwardness that can sometimes be associated with a relationship. Making the world better, one answer at a time. Well there are 3 types of hugs that have a definiton. For example the 1st hug is when the male or female gives a hug but you lower body is about 2 feet away and the only thing that is close to you is their arms...."}, {"url": "https://answers.yahoo.com/question/index?qid=20081225062435AAUc8US", "passage_text": "When a guy hugs you tight... I mean if you really feel the warmth of his love(or care) then he really believes in you ...the three magic words...dont say everything...they are just words...But, the feel between you both is what matters. Also, when we were in his car, he keeps on playing these love country music, grabs my hand, holds it and kisses it a lot. He constantly squeezes my left leg also when he is driving. Whenever I am leaving, he hugs me so tight. I have been dating this guy for a month now.We had lots of sex already, been to his place...."}, {"url": "https://answers.yahoo.com/question/index?qid=20090921201914AAaxj9b", "passage_text": "RE: What does a tight hug mean? what does a tight hug from a guy mean... like when a guy holds you really tight for a couple minutes then lets you go.. does that mean something? i mean people hug people all the time but usually its just a light hug.. nothing really special but i feel something with some people like if a guy i know used to like me he hugs me a certain way like a tight firm hug and you feel safe.. i dunno you just feel something.. or just a guy friend will sometimes do that .. lol i dunno its just with certain people. Add your answer. Source. nothing really special but i feel something with some people like if a guy i know used to like... show more what does a tight hug from a guy mean... like when a guy holds you really tight for a couple minutes then lets you go.."}, {"url": "https://answers.yahoo.com/question/index?qid=20081225062435AAUc8US", "passage_text": "Best Answer: He is falling in love with you. When a guy hugs someone tightly, it means one thing. He doesn't want to lose you. He holds you tight, because he wants to you so stay and be with him for longer. As you said, there are many hints to the fact he is falling in love with you. For my opinion, he seems like a sincere man. Also, when we were in his car, he keeps on playing these love country music, grabs my hand, holds it and kisses it a lot. He constantly squeezes my left leg also when he is driving. Whenever I am leaving, he hugs me so tight. I have been dating this guy for a month now.We had lots of sex already, been to his place...."}]