[{"url": "http://www.medicinenet.com/script/main/art.asp?articlekey=11099", "passage_text": "Cast: 1) A protective shell of fiberglass, plastic, or plaster, and bandage that is molded to protect broken or fractured limb(s) as it heals. 2) An abnormal mass of dead cells that forms in a body cavity. For example, cases of cells that form in the tubules of the kidneys are sometimes detected in urine samples. "}, {"url": "http://www.thefreedictionary.com/Cast", "passage_text": "c. Something formed by this means or in a mold or matrix: The sculpture was a bronze cast. They made a cast of her face. 8. A rigid dressing, usually made of gauze and plaster of Paris, used to immobilize an injured body part, as in a fracture or dislocation. Also called plaster cast. 9. The form in which something is made or constructed; arrangement: the close-set cast of her features. 10."}, {"url": "http://www.med.illinois.edu/depts_programs/sciences/clinical/internal_med/residency/edmod/mod1/casts.htm", "passage_text": "Casts. Urine casts are cylindrical, cigar-shaped bodies that represent molds or casts of the lumen of the renal tubule in which they were formed. The common matrix of all casts is a mucoprotein known as Tamm-Horsfall protein which is secreted by the renal tubule at a fairly constant rate. The presence of these casts indicates acute tubular injury but does not indicate the extent or reversibility of the injury. A common scenario is the patient with decreased renal perfusion and oliguria secondary to severe dehydration. Ischemic injury results in degeneration and sloughing of the epithelial cells."}, {"url": "https://en.wikipedia.org/wiki/Urinary_casts", "passage_text": "PAS stain. Urinary casts are cylindrical structures produced by the kidney and present in the urine in certain disease states. They form in the distal convoluted tubule and collecting ducts of nephrons, then dislodge and pass into the urine, where they can be detected by microscopy. As reflected in their cylindrical form, casts are generated in the small distal convoluted tubules and collecting ducts of the kidney, and generally maintain their shape and composition as they pass through the urinary system. Although the most common forms are benign, others indicate disease."}, {"url": "http://www.med.illinois.edu/depts_programs/sciences/clinical/internal_med/residency/edmod/mod1/casts.htm", "passage_text": "Hyaline casts are formed in the absence of cells in the tubular lumen. They have a smooth texture and a refractive index very close to that of the surrounding fluid. Reduced lighting is essential to see hyaline casts. The presence of these casts indicates acute tubular injury but does not indicate the extent or reversibility of the injury. A common scenario is the patient with decreased renal perfusion and oliguria secondary to severe dehydration. Ischemic injury results in degeneration and sloughing of the epithelial cells."}, {"url": "http://www.ucmp.berkeley.edu/paleo/fossilsarchive/casmol.html", "passage_text": "A cast of the organism can then be made using the two types of mold. Natural casts can be formed when minerals are deposited within the mold. Casts can also be synthetically created when the molds are filled or covered with synthetic material such as latex or plaster of paris to generate a replica of the organism. "}, {"url": "http://orthoinfo.aaos.org/topic.cfm?topic=A00095", "passage_text": "Application. Both fiberglass and plaster splints and casts use padding, usually cotton, as a protective layer next to the skin. Both materials come in strips or rolls which are dipped in water and applied over the padding covering the injured area. Casts are custom-made. They must fit the shape of your injured limb correctly to provide the best support. Casts can be made of plaster or fiberglass — a plastic that can be shaped. Splints or half-casts can also be custom-made, especially if an exact fit is necessary."}]