[{"url": "http://www.ukenergy.co.uk/home_energy/resources/kwh_conversion_information", "passage_text": "Gas conversion information: Converting gas use into kWh. Your gas meter may record your gas consumption in hundreds of cubic feet, but your energy company is required to bill you in terms of kilowatt hours (kWh). Follow these steps: 1  Take the current reading of your gas meter and deduct the previous meter reading from it. 2  Take this result and multiply it by 2.83, to convert hundreds of cubic feet to cubic metres. 3  Multiply this result by a correction factor of 1.022640, and then by the value shown on your last gas bill."}, {"url": "https://uk.answers.yahoo.com/question/index?qid=20091214152147AAx1ywM", "passage_text": "Best Answer: •Multiply your units used by 2.83 to give you the number of cubic metres of gas used. (If you have a newer metric meter measuring gas in cubic metres you do not need to do this). •Multiply by the temperature and pressure figure (1.02264). This value should be on your bill. "}, {"url": "http://energy-advise.com/compare-energy-prices/metric-gas-meter-calculator-nsc/", "passage_text": "You can convert you gas reading into KWH with this handy calculator. Whether you pay a standing charge or not, you will be able to work out how much your gas and electricity is costing. Your gas meter probably doesn’t measure KWH’s, so this gas calculator will convert your reading into KWH’s using an average calorific value for the gas you have consumed. Below, you will find a list of the most common types of energy tariff. Just check on your gas and electricity bills for the type of tariff you are on: "}, {"url": "http://www.energylinx.co.uk/gas_meter_conversion.html", "passage_text": "Your gas meter will record your gas consumption in either cubic meters or hundreds of cubic feet. You will however pay for gas using a price per kWh. To convert your gas meter readings to kWhs feel free to use our free gas meter reading calculator. It will convert cubic meters to kWhs or hundreds of cubic feet (100ft3) to kWhs. For Gas Meters that record cubic meters (your gas meter will have m3 beside the reading). Enter your usage. To calculate this figure take your current meter reading and deduct the previous reading."}, {"url": "http://www.qwindow.com/mycosts/gasformula.php", "passage_text": "Click here for a unit to kWh conversion. Formula used to convert gas meter readings to kilowatt hours (kWh): Electricity meters usually show the amount of electricity you have consumed in kWh and the provider bills you directly for that usage."}, {"url": "http://www.bbc.co.uk/programmes/articles/3hjH7Ptrt9tHDG618NQwC3Z/reading-meters", "passage_text": "To convert the readings on an imperial meter from imperial units to kWh's the company should do the following calculation; (The number of units you've used) X (The metric conversion factor) X (The volume correction factor) X (The calorific value of the gas) divided by 3.6 = kWh's. Step 3. All energy bills are priced in kilowatt Hours (kWh), so your supplier has to do a calculation to turn the numbers on your gas meter (units) into kWh's. The only reliable way to see if they are billing you for the correct type of meter, is to do the same calculation."}, {"url": "http://www.ehow.com/how_6464163_convert-meter-kilowatt-hours-bill.html", "passage_text": "Instructions. Check your recent electric bill to see what the last reading was. The reading will be the actual meter reading, not the total of kilowatt hours. Make sure it is not an estimated reading. Check your meter to see what the reading is. If the meter is digital, this will be easy. If it is a dial meter, start on the left and read to the right, one dial for each digit. "}, {"url": "https://www.ukpower.co.uk/home_energy/gas_meter_readings", "passage_text": "Imperial gas meters. If your meter is an old imperial gas meter, which will measure gas in cubic feet, it will have the words cubic feet or the letters ft 3 shown on the front of the meter. If your meter is a newer metric meter, which measures gas in cubic meters, it will state cubic meters or display M 3 on the front of the meter. "}]