[{"url": "http://www.huffingtonpost.ca/2014/02/28/strep-throat-symptoms_n_4874981.html", "passage_text": "The most common symptoms of strep are sudden, severe throat pain, pain when swallowing, a fever above 101F or 38.3C, swelling in your tonsils and lymph nodes, and a bright red throat with white or yellow spots in the back. ADVERTISEMENT. If you've had strep throat, you know exactly what it feels like: that awful sensation in your esophagus that feels like you've swallowed needles. Strep throat is unpleasant, but it's not uncommon, especially at this time of year when we're all already trying to fight off colds and flus."}, {"url": "http://www.cdc.gov/Features/StrepThroat/index.html", "passage_text": "How You Get Strep Throat. Strep throat is an infection in the throat and tonsils caused by group A Streptococcus bacteria (called group A strep). Group A strep bacteria can also live in a person's nose and throat without causing illness. The bacteria are spread through contact with droplets after an infected person coughs or sneezes. "}, {"url": "https://answers.yahoo.com/question/index?qid=20100615201445AAJrRmq", "passage_text": "Report Abuse. Look at the back of your throat, if there are red dots, thats a main sign. A sore throat, trouble swallowing, and dehydration are some other main signs. There are hundreds of different kinds of versions of strep. if it gets worse, go to your doctor and they will swab your throat for the bacteria. first of all you will have sore throat, painful when you swallow. ears can get itchy and hurt a little, bad breath. fever is also common when you have strep throat. tonsils can get swollen and you may notice bumps on the back of your throat. Source(s): medical field."}, {"url": "http://www.huffingtonpost.ca/2014/02/28/strep-throat-symptoms_n_4874981.html", "passage_text": "Once your doctor has confirmed that you have strep throat, an antibiotic like penicillin or amoxicillin will be prescribed. The antibiotics reduce the amount of time that you are contagious and help prevent the spread of the infection to other parts of your body. ADVERTISEMENT. If you've had strep throat, you know exactly what it feels like: that awful sensation in your esophagus that feels like you've swallowed needles. Strep throat is unpleasant, but it's not uncommon, especially at this time of year when we're all already trying to fight off colds and flus."}, {"url": "http://www.webmd.com/oral-health/tc/strep-throat-topic-overview", "passage_text": "A sore throat caused by a virus can be just as painful as strep throat. But if you have cold symptoms such as coughing, sneezing, or a runny or stuffy nose, you probably do not have strep throat. The most common symptoms of strep throat are: 1  A sudden, severe sore throat. 2  Pain when you swallow. 3  Fever over 101°F (38.3°C) . 4  Swollen tonsils and lymph nodes."}, {"url": "http://www.webmd.com/oral-health/tc/strep-throat-topic-overview", "passage_text": "Strep throat is a bacterial infection in the throat and the tonsils. The throat gets irritated and inflamed, causing a sudden, severe sore throat. Strep throat is caused by streptococcal (strep) bacteria. There are many different types of strep bacteria. Some cause more serious illness than others. The most common symptoms of strep throat are: 1  A sudden, severe sore throat. 2  Pain when you swallow. 3  Fever over 101°F (38.3°C) . 4  Swollen tonsils and lymph nodes."}, {"url": "http://www.huffingtonpost.ca/2014/02/28/strep-throat-symptoms_n_4874981.html", "passage_text": "Some people with strep also have a headache or sore stomach, and occasionally you'll see a red rash on your skin, vomiting, lack of appetite, and body aches. The symptoms of strep generally start to appear within two to five days of exposure to the bacteria. As it's caused by bacteria, strep throat is contagious. ADVERTISEMENT. If you've had strep throat, you know exactly what it feels like: that awful sensation in your esophagus that feels like you've swallowed needles. Strep throat is unpleasant, but it's not uncommon, especially at this time of year when we're all already trying to fight off colds and flus."}, {"url": "https://answers.yahoo.com/question/index?qid=20100615201445AAJrRmq", "passage_text": "It's a infection where the throat gets irritated Here are symptoms of strep throat. 1- Severe throat hurting 2- Hurts when you swallow 3- Having a fever over 101 F 4- Swollen tonsils 5- Yellow or white spots on the back of your throat 6- Throat is bright red Other ones are belly ace, throwing up, headaches. first of all you will have sore throat, painful when you swallow. ears can get itchy and hurt a little, bad breath. fever is also common when you have strep throat. tonsils can get swollen and you may notice bumps on the back of your throat. Source(s): medical field."}, {"url": "http://www.wikihow.com/Tell-if-You-Have-Strep-Throat", "passage_text": "7. Take your antibiotics if prescribed by your doctor. Strep throat is a bacterial infection and, as such, is treated effectively with antibiotics. If you have any known allergies to antibiotics (such as penicillin), it is important to let your doctor know so he or she can provide you with appropriate alternatives. 1 If you test negative for strep but your symptoms continue and you have extreme fatigue, ask your doctor about a test for mono. 2  Strep throat must be treated with an antibiotic. 3  Otherwise, it could develop into rheumatic fever, which is a very serious disease that affects the heart and joints of the body."}, {"url": "http://www.wikihow.com/Tell-if-You-Have-Strep-Throat", "passage_text": "Determine how severe your throat pain is. Severe throat pain is usually the first sign of strep throat. You may still have strep throat even if you are only experiencing moderate throat pain, but a mild sore throat that is easily remedied or soothed is not likely to be caused by strep. 1 If you test negative for strep but your symptoms continue and you have extreme fatigue, ask your doctor about a test for mono. 2  Strep throat must be treated with an antibiotic. 3  Otherwise, it could develop into rheumatic fever, which is a very serious disease that affects the heart and joints of the body."}]