[{"url": "http://www.webmd.com/heart-disease/guide/heart-disease-abnormal-heart-rhythm?page=2", "passage_text": "This is another type of fast heartbeat. It's caused by there being an extra pathway through a part of the heart called the AV node. It can cause heart palpitations, fainting, or heart failure. In some cases, you can stop it simply by breathing in and bearing down. Some drugs can also stop this heart rhythm."}, {"url": "http://www.rightdiagnosis.com/symptoms/irregular_heartbeat/side-effects.htm", "passage_text": "The following drugs, medications, substances or toxins are some of the possible causes of Irregular heartbeat as a symptom. This list is incomplete and various other drugs or substances may cause your symptoms (see Irregular heartbeat). Always advise your doctor of any medications or treatments you are using, including prescription, over-the-counter, supplements, herbal or alternative treatments. 1  Aldazine. 2  Amphetamine Sulfate. 3  Anatensol."}, {"url": "http://www.healthline.com/symptom/abnormal-heart-rhythms", "passage_text": "Some medications or substances may cause your heart rate to change. Caffeine, amphetamines (drugs that stimulant the brain), and beta blockers (used to reduce high blood pressure) are examples. Other Causes. A number of other factors can also cause alterations in your heart’s rhythm."}, {"url": "http://my.clevelandclinic.org/services/heart/disorders/arrhythmia", "passage_text": "Here’s what happens during a normal heartbeat: Irregular heart rhythms can also occur in normal, healthy hearts. Arrhythmias can also be caused by certain substances or medications, such as caffeine, nicotine, alcohol, cocaine, inhaled aerosols, diet pills, and cough and cold remedies. Emotional states such as shock, fright or stress can also cause irregular heart rhythms."}, {"url": "http://www.medicinenet.com/arrhythmia_irregular_heartbeat/article.htm", "passage_text": "An irregular heartbeat is an arrhythmia (also called dysrhythmia). Heart rates can also be irregular. A normal heart rate is 50 to 100 beats per minute. Arrhythmias and abnormal heart rates don't necessarily occur together."}]