[{"url": "http://www.otrcat.com/history-of-minstrel-shows-introduction-1", "passage_text": "The Blackface Minstrel show is considered to be the first distinctly American theatrical form. A minstrel show is the imitation and often offensive exaggeration of African-American music, culture, vernacular English, physical traits, etc for entertainment."}, {"url": "http://study.com/academy/lesson/minstrel-show-definition-history.html", "passage_text": "During the 19th and early 20th century, minstrel shows were a popular form of entertainment. In a minstrel show, white performers put black makeup on their faces (often called blackface) to imitate African Americans through stereotypes and caricatures."}, {"url": "http://www.audioenglish.org/dictionary/minstrel_show.htm", "passage_text": "The noun MINSTREL SHOW has 2 senses: 1. a troupe of performers in blackface typically giving a comic program of negro songs and jokes. 2. a variety show in which the performers are made up in blackface. Familiarity information: MINSTREL SHOW used as a noun is rare."}, {"url": "http://chnm.gmu.edu/courses/jackson/minstrel/minstrel.html", "passage_text": "The Minstrel Show presents us with a strange, fascinating and awful phenomenon. Minstrel shows emerged from preindustrial European traditions of masking and carnival. But in the US they began in the 1830s, with working class white men dressing up as plantation slaves."}, {"url": "http://www.thefreedictionary.com/minstrel+show", "passage_text": "1. minstrel show-a troupe of performers in blackface typically giving a comic program of negro songs and jokes. troupe, company-organization of performers and associated personnel (especially theatrical); the traveling company all stayed at the same hotel."}, {"url": "http://twain.lib.virginia.edu/huckfinn/minstrl.html", "passage_text": "Blackface Minstrelsy. The very first minstrel show probably occurred in 1843, in New York City. Within a year it became the most popular form of live entertainment in America, and it remained so from the time Tom Sawyer was a child up to the time MT began writing Huck Finn."}, {"url": "http://www.pbs.org/wgbh/amex/foster/sfeature/sf_minstrelsy.html", "passage_text": "Learn more about the history and legacy of the blackface minstrel show in these excerpts of interviews with historians Dale Cockrell, Eric Lott, Deane Root, Fath Ruffins, and Josephine Wright, writers Ken Emerson and Mel Watkins, and performers Nanci Griffith and Thomas Hampson."}, {"url": "http://www.urbandictionary.com/define.php?term=minstrel%20show", "passage_text": "minstrel show. A form of American entertainment performed by whites in blackface before the Civil War and by blacks after the Civil War. Minstrel shows usually involved dancing and singing. The shows portrayed blacks as ignorant, lazy, buffoonish, joyful, and musical."}, {"url": "http://www.enotes.com/homework-help/what-minstrel-show-138675", "passage_text": "The minstrel show, or minstrelsy, was an American entertainment consisting of comic skits, variety acts, dancing, and music, performed by white people in blackface or, especially after the Civil War, black people in blackface."}]