[{"url": "https://answers.yahoo.com/question/index?qid=20110705153307AAllYQi", "passage_text": "Pitch, Roll, and Yaw are aviation terms. Pitch = change in the angle of the nose along the vertical axis Roll = change in the the angle of the wings along the horizontal axis Yaw = change of overall heading http://en.wikipedia.org/wiki/Flight_dyna..."}, {"url": "https://howthingsfly.si.edu/flight-dynamics/roll-pitch-and-yaw", "passage_text": "1 This tilts the nose of the airplane up and down. 2  The Rudder Controls Yaw. 3  On the vertical tail fin, the rudder swivels from side to side, pushing the tail in a left or right direction. 4  A pilot usually uses the rudder along with the ailerons to turn the airplane. To turn the airplane, the pilot uses the ailerons to tilt the wings in the desired direction. 2  The Elevator Controls Pitch. 3  On the horizontal tail surface, the elevator tilts up or down, decreasing or increasing lift on the tail. 4"}, {"url": "http://www.formula1-dictionary.net/yaw.html", "passage_text": "Yaw describes the rotation of the car about the z-axis. The yaw angle is the angle between a line pointing in the direction the car is moving and the car's x-axis (which is the direction the car is pointed). "}, {"url": "https://howthingsfly.si.edu/flight-dynamics/roll-pitch-and-yaw", "passage_text": "Imagine three lines running through an airplane and intersecting at right angles at the airplane’s center of gravity. 1  Rotation around the front-to-back axis is called roll. 2  Rotation around the side-to-side axis is called pitch. 3  Rotation around the vertical axis is called yaw. To turn the airplane, the pilot uses the ailerons to tilt the wings in the desired direction. 2  The Elevator Controls Pitch. 3  On the horizontal tail surface, the elevator tilts up or down, decreasing or increasing lift on the tail. 4  This tilts the nose of the airplane up and down."}, {"url": "https://en.wikipedia.org/wiki/Yaw_%28rotation%29", "passage_text": "The yaw rate or yaw velocity of a car, aircraft, projectile or other rigid body is the angular velocity of this rotation, or rate of change of the heading angle when the aircraft is horizontal. It is commonly measured in degrees per second or radians per second. yaw rotation is a movement around the yaw axis of a rigid body that changes the direction it is pointing, to the left or right of its direction of motion."}, {"url": "http://physics.stackexchange.com/questions/119886/how-to-calculate-roll-yaw-and-pitch-angles-from-3d-co-ordinates-euler-angles", "passage_text": "Now using these points I wish to know the body angles (yaw, pitch and roll) of the fly with respect to a fixed axis. I have tried the following (which I think is wrong). 1  Using the head and the tail as a head-vector --- I calculated the angle of this vector with the Z axis."}, {"url": "http://www.whyhighend.com/yaw-rate.html", "passage_text": "I've seen the term yaw rate several times in the catalogs of luxury vehicles but I always wondered what it meant. Yaw originated in the aviation industry as yaw, pitch and roll must be controlled for the successful flight of an aircraft but the yaw rate is now an essential part of automotive safety.he yaw rate is something that is continuously measured by the yaw sensors and compared with the tire angle but the system only acts when the necessary action is required."}, {"url": "https://en.wikipedia.org/wiki/Yaw_%28rotation%29", "passage_text": "A yaw rotation is a movement around the yaw axis of a rigid body that changes the direction it is pointing, to the left or right of its direction of motion."}, {"url": "http://www.grc.nasa.gov/WWW/K-12/airplane/yaw.html", "passage_text": "We can then define the orientation of the aircraft by the amount of rotation of the parts of the aircraft along these principal axes. The yaw axis is perpendicular to the wings and lies in the plane of the aircraft centerline. A yaw motion is a side to side movement of the nose of the aircraft as shown in the animation. The yawing motion is being caused by the deflection of the rudder of this aircraft. The rudder is a hinged section at the rear of the vertical stabilizer. As described on the shape effects slide, changing the angle of deflection at the rear of an airfoil changes the amount of lift generated by the foil."}, {"url": "https://en.wikipedia.org/wiki/Flight_dynamics", "passage_text": "Roll, pitch and yaw refer, in this context, to rotations about the respective axes starting from a defined equilibrium state. The equilibrium roll angle is known as wings level or zero bank angle, equivalent to a level heeling angle on a ship. Yaw is known as heading.he three critical flight dynamics parameters are the angles of rotation in three dimensions about the vehicle's center of mass, known as roll, pitch and yaw (quite different from their use as Tait-Bryan angles). Aircraft engineers develop control systems for a vehicle's orientation (attitude) about its center of mass."}]