[{"url": "http://www.diffen.com/difference/Objective_vs_Subjective", "passage_text": "Subjective information or writing is based on personal opinions, interpretations, points of view, emotions and judgment. It is often considered ill-suited for scenarios like news reporting or decision making in business or politics. Objective information or analysis is fact-based, measurable and observable. Here are some examples of objective and subjective statements:  1 47% of Americans pay no federal income tax. 2  These people believe they are victims and would never vote for a Republican candidate.. 3  In this quote (which paraphrases Mitt Romney), the first statement is objective."}, {"url": "http://www.differencebetween.net/language/difference-between-objective-and-subjective/", "passage_text": "In order to do all this, you need to have a firm grip on what is objective and what is subjective. Definition of Objective and Subjective. Objective is a statement that is completely unbiased. It is not touched by the speaker’s previous experiences or tastes. It is verifiable by looking up facts or performing mathematical calculations. 1.Objective and subjective statements are used by speakers to get their points across. 2.Objective statements are facts that can be verified by third parties while subjective statements may or may not be entirely true as they are colored by the opinions of the speaker."}, {"url": "http://www.differencebetween.net/language/difference-between-objective-and-subjective/", "passage_text": "“To be Objective you have to take human emotion, subjective opinion, and human out of it. To first understand the difference of subjectivity and objectivity we must first define them collectively no matter what background anyone has.”. Everything you have said here is subjective & your opinion. 1.Objective and subjective statements are used by speakers to get their points across. 2.Objective statements are facts that can be verified by third parties while subjective statements may or may not be entirely true as they are colored by the opinions of the speaker."}, {"url": "http://www.merriam-webster.com/dictionary/subjective", "passage_text": "Full Definition of SUBJECTIVE. 1. : of, relating to, or constituting a subject: as a obsolete: of, relating to, or characteristic of one that is a subject especially in lack of freedom of action or in submissiveness b: being or relating to a grammatical subject; especially: nominative. 2. Medical Definition of SUBJECTIVE. 1. b: characteristic of or belonging to reality as perceived rather than as independent of mind c: relating to or being experience or knowledge as conditioned by personal mental characteristics or states."}, {"url": "http://www.thefreedictionary.com/subjectively", "passage_text": "1. a. Dependent on or taking place in a person's mind rather than the external world: The sensation of pain is a highly subjective experience that varies by culture as well as by individual temperament and situation (John Hoberman). "}, {"url": "http://www.merriam-webster.com/dictionary/subjective", "passage_text": "Examples of SUBJECTIVE. 1  Dreaming is a subjective experience. 2  a person's subjective perception of the world. 3  Personal taste in clothing is very subjective. 4  In reviewing applicants, we consider both objective criteria, such as test scores, and subjective criteria, such as leadership ability. Medical Definition of SUBJECTIVE. 1. b: characteristic of or belonging to reality as perceived rather than as independent of mind c: relating to or being experience or knowledge as conditioned by personal mental characteristics or states. 2"}, {"url": "http://www.learnersdictionary.com/definition/subjective", "passage_text": "In reviewing applicants, we consider both objective criteria, such as test scores, and subjective criteria, such as leadership ability. Law can be maddeningly subjective. So much is left up to your own interpretation. [+] more examples [-] hide examples [+] Example sentences [-] Hide examples. "}, {"url": "http://www.differencebetween.net/language/difference-between-objective-and-subjective/", "passage_text": "Subjective: is just the opposite. You can’t point to subjective subjects. They are all in your head and your past experiences. Subjective opinions are ephemeral and subject to any number of factors that can range from facts to emotions. 1.Objective and subjective statements are used by speakers to get their points across. 2.Objective statements are facts that can be verified by third parties while subjective statements may or may not be entirely true as they are colored by the opinions of the speaker."}, {"url": "http://www.yourdictionary.com/subjective", "passage_text": "The definition of subjective is something that is based on personal opinion. An example of subjective is someone believing purple is the best color. 1  of, affected by, or produced by the mind or a particular state of mind; of or resulting from the feelings or temperament of the subject, or person thinking; not objective; personal: a subjective judgment. Based on a given person's experience, understanding, and feelings; personal or individual: admitted he was making a highly subjective judgment. 1  Psychology Not caused by external stimuli. 2  Medicine Of, relating to, or designating a symptom or complaint perceived by a patient."}]