[{"url": "http://www.ausbt.com.au/qantas-what-to-do-with-a-spare-airbus-a380", "passage_text": "It's far from the worst problem for an airline to have, but Qantas will soon count an extra Airbus A380 in its fleet and is mulling exactly what to do with this spare superjumbo. 18 on 14/4/14 by maabbot. probably the best option for Qantas is to wet lease the aircraft to BA or Emirates. They could do the Berlin-Dubai flight that Emirates cannot due to German issues as a QF flight in its own right."}, {"url": "http://www.answers.com/Q/Where_did_Qantas_first_originate", "passage_text": "This is because the airline operated out of western Queensland, and serviced the remo … te areas of the Northern Territory. In 1934, QANTAS Limited and Britain's Imperial Airways, forerunner of British Airways, formed a new company, Qantas Empire Airways Limited. Qantas, Queensland and Northern Territory Aerial Services, is the name of Australia's original airline service. Qantas was founded in Winton, Queensland, on 16 November 1920. It began as an air mail service subsidised by the Australian government, linking railheads in western Queenslan"}, {"url": "https://en.wikipedia.org/wiki/Qantas", "passage_text": "The Qantas name comes from  QANTAS , an acronym for its original name,  Queensland and Northern Territory Aerial Services , and it is nicknamed The Flying Kangaroo. The airline is based in the Sydney suburb of Mascot with its main hub at Sydney Airport. The Qantas Club is the airline lounge for Qantas with airport locations around Australia and the world. The Qantas Club offers membership by paid subscription (one year, two years or four years) or by achievement of Gold or Platinum frequent flyer status."}, {"url": "https://en.wikipedia.org/wiki/History_of_Qantas", "passage_text": "Qantas has been one of the most profitable airlines in the world. In 2008, the first Qantas Airbus A380 was handed over by Airbus at a ceremony on 19 September. The first route for the A380 was Melbourne to Los Angeles. Between 1926 and 1928 Qantas built several aircraft in Longreach and made the inaugural flight of the Royal Flying Doctor Service of Australia, departing from Cloncurry. Qantas Empire Airways Limited (QEA) was formed by Qantas and Britain's Imperial Airways in 1934."}, {"url": "https://en.wikipedia.org/wiki/History_of_Qantas", "passage_text": "Qantas is Australia's largest airline and one of the oldest airlines in the world. Qantas was founded in Winton, Queensland on 16 November 1920 as Queensland and Northern Territory Aerial Services Limited by Paul McGinness, Hudson Fysh, Fergus McMaster and Arthur Baird. Initially the airline operated air mail services subsidised by the Australian government, linking railheads in western Queensland. Between 1926 and 1928 Qantas built several aircraft in Longreach and made the inaugural flight of the Royal Flying Doctor Service of Australia, departing from Cloncurry. Qantas Empire Airways Limited (QEA) was formed by Qantas and Britain's Imperial Airways in 1934."}, {"url": "https://en.wikipedia.org/wiki/Qantas", "passage_text": "Qantas was founded in Winton, Queensland on 16 November 1920 as Queensland and Northern Territory Aerial Services Limited. The airline's first aircraft was an Avro 504 K. The airline flew internationally from May 1935, when it commenced service from Darwin, Northern Territory to Singapore. The Qantas Club is the airline lounge for Qantas with airport locations around Australia and the world. The Qantas Club offers membership by paid subscription (one year, two years or four years) or by achievement of Gold or Platinum frequent flyer status."}, {"url": "https://en.wikipedia.org/wiki/Qantas", "passage_text": "Qantas operates a mixed fleet of Airbus and Boeing aircraft. It was the only airline in the world to have a fleet made up solely of Boeing 747s during the 1980s, and in 2008 began to replace the type with the Airbus A380 as part of its fleet renewal. Qantas is a founding member of the Oneworld airline alliance, which at September 2015 comprised 15 international airlines. The Qantas Club is the airline lounge for Qantas with airport locations around Australia and the world. The Qantas Club offers membership by paid subscription (one year, two years or four years) or by achievement of Gold or Platinum frequent flyer status."}, {"url": "http://www.ausbt.com.au/qantas-what-to-do-with-a-spare-airbus-a380", "passage_text": "Qantas' only 'part time' A380 route is Sydney to Hong Kong, which was recently upgraded to see an A380 five days of the week (from Thursday to Monday) with a Boeing 747 on the remaining two days. 18 on 14/4/14 by maabbot. probably the best option for Qantas is to wet lease the aircraft to BA or Emirates. They could do the Berlin-Dubai flight that Emirates cannot due to German issues as a QF flight in its own right."}]