[{"url": "http://www.howmuchisit.org/how-much-does-antivenom-cost/", "passage_text": "1 It is stated on this website that the cost of the anti-venom CroFab is over $1,000 per vial. 2  Other snake anti-venom can be bought at different prices, others reaching as much $5,000. Factors that influence the price: 1  Location. 2  The prices of anti-venom will be drastically lower in other parts of the world outside the US. 3  The Anascorp anti-venom, for example, is just $100 per vial at pharmacies or even less at government-funded clinics in Mexico but are sold over a thousand dollars in Arizona, USA."}, {"url": "http://www.webpronews.com/scorpion-antivenom-costs-arizona-patients-12500-per-vial-2012-09/", "passage_text": "The Arizona Republic, a Phoenix-area newspaper, is reporting that Phoenix hospitals are charging patients as much as $12,467 per vial of the antivenom. With a full treatment calling for three to five vials, medical costs can soar to over $60,000. Scorpion Antivenom Costs Arizona Patients $12,500 Per Vial. A scorpion antivenom that was cleared by the U.S. Food and Drug Administration (FDA) last month is causing sticker shock for Arizona residents."}, {"url": "https://en.wikipedia.org/wiki/Antivenom", "passage_text": "Milking a snake for the production of antivenom. Antivenom (or antivenin or antivenene) is a biological product used in the treatment of venomous bites or stings. Antivenom is created by milking venom from a relevant snake, spider, insect, or fish. The venom is then diluted and injected into a horse, sheep, rabbit, or goat. The first antivenom for snakes (called an anti-ophidic serum) was developed by Albert Calmette, a French scientist of the Pasteur Institute working at its Indochine branch in 1895, against the Indian Cobra (Naja naja)."}, {"url": "http://www.howmuchisit.org/how-much-does-antivenom-cost/", "passage_text": "1 The price, however, depends largely on the type of anti-venom and the severity of damage it poses into the person. 2  Dosage of the anti-venom. 3  Each vial of anti-venom cost relatively higher than any other drugs. 4  However, the costs are not only limited to a single vial. Factors that influence the price: 1  Location. 2  The prices of anti-venom will be drastically lower in other parts of the world outside the US. 3  The Anascorp anti-venom, for example, is just $100 per vial at pharmacies or even less at government-funded clinics in Mexico but are sold over a thousand dollars in Arizona, USA."}, {"url": "http://www.smithsonianmag.com/smart-news/why-single-vial-antivenom-can-cost-14000-180956564/", "passage_text": "The cost of making the antivenom, including research, development, animal care and plasma harvesting? A mere 0.1 percent. As for the remaining 70.1 percent, Boyer found that the cost was due to hospital markups used in negotiations with insurance companies, Ingraham writes. The high cost of antivenom isn’t the only problem with the treatment: because relatively few people need the treatment compared to some other illnesses, pharmaceutical companies tend to put antivenom on the back burner."}, {"url": "http://www.howmuchisit.org/how-much-does-antivenom-cost/", "passage_text": "1 Dosage of the anti-venom. 2  Each vial of anti-venom cost relatively higher than any other drugs. 3  However, the costs are not only limited to a single vial. 4  If a person has been bitten by something poisonous, one vial is usually not enough to rid the body of the toxins. Factors that influence the price: 1  Location. 2  The prices of anti-venom will be drastically lower in other parts of the world outside the US. 3  The Anascorp anti-venom, for example, is just $100 per vial at pharmacies or even less at government-funded clinics in Mexico but are sold over a thousand dollars in Arizona, USA."}, {"url": "http://time.com/2897/north-carolina-hospital-bill-snake-bite/", "passage_text": "The four vials of anti-venom medication Ferguson received reportedly cost about $20,000 each. Ferguson and his wife Laura researched the price of the medicine and found its retail price was between $750 and $12,000 per vial. A couple in North Carolina is speaking out against hospital pricing after receiving a bill for an 18-hour emergency-room stay which they say cost them a whopping $89,000. The Charlotte Observer reports that Eric Ferguson visited a hospital near his home in Mooresville, N.C. over the summer after being bitten by a snake."}, {"url": "http://www.howmuchisit.org/how-much-does-antivenom-cost/", "passage_text": "1 As you can see, the cost of anti-venom will greatly vary. 2  Depending on the rarity of the anti-venom, prices can range anywhere from $100 to as much as $13,000 or more per vial. Factors that influence the price: 1  Location. 2  The prices of anti-venom will be drastically lower in other parts of the world outside the US. 3  The Anascorp anti-venom, for example, is just $100 per vial at pharmacies or even less at government-funded clinics in Mexico but are sold over a thousand dollars in Arizona, USA."}, {"url": "http://www.nydailynews.com/news/national/arizona-woman-feeling-pain-83-046-bill-anti-venom-drug-seeking-medical-treatment-scorpion-sting-article-1.1152754", "passage_text": "Marcie Edmonds of Phoenix says she was shocked last year after she receieved a $83,046 bill for two doses of an anti-venom drug that costs just $100 per dose in Mexico. Edmond's insurance, Humana, covered $57, 509 of the charges. Now, she's being asked to foot the remainder - $25, 537. Chandler Regional told AZ Central in a statement that bill covers the out-of-network costs for Edmond's treatment since the hospital doesn't fall under Humana's network."}]