[{"url": "http://www.freemathhelp.com/domain-range.html", "passage_text": "Definition. Domain: The domain of a function is the set of all possible input values (often the x variable), which produce a valid output from a particular function. Well, if the domain is the set of all real numbers for which the function is defined, then logically we're looking for a function that has certain input values that do not produce a valid output, i.e., the function is undefined for that input. Here is an example: This function is defined for almost any real x."}, {"url": "http://math.stackexchange.com/questions/123864/find-the-maximal-domain-and-range-of-fx-lnx2-7", "passage_text": "Maximal domain is the domain which is the super set of all posible domains-in other words, the maximal domain is the domain which has all possible domains as its subsets. For example, you may choose the domain with only the positive values. This is a subset of the maximal domain. share | cite | improve this answer. Find the maximal domain and range of $f(x) = \\ln(x^2 - 7)$. up vote 2 down vote favorite. Find the maximal domain and range of: $$f(x) = \\ln(x^2 - 7)$$."}, {"url": "http://mathhelpforum.com/algebra/138751-maximal-domain-range.html", "passage_text": "All I can find online are references to maximal domain being what people usually mean by domain, with any difference maybe being between the mathematical domain (being anything allowable mathematically) and the practical domain (being, say, only non-negative values of the radius for an area function). my notes is very vague in the definition of maximal domain, which is why im confused. it says this: 'The maximal domain is the set of points at which the rule f could legitimately be used' which sounds like domain to me."}, {"url": "https://en.wikipedia.org/wiki/Domain_of_a_function", "passage_text": "In mathematics, and more specifically in naive set theory, the domain of definition (or simply the domain) of a function is the set of input or argument values for which the function is defined. That is, the function provides an output or value for each member of the domain. Formal definition [edit]. Given a function f: X → Y, the set X is the domain of f; the set Y is the codomain of f. In the expression f (x), x is the argument and f (x) is the value. One can think of an argument as an input to the function, and the value as the output"}, {"url": "https://en.wikibooks.org/wiki/Abstract_algebra/Integral_domains", "passage_text": "Thus, is an integral domain. Definition If is a ring, then the set of polynomials in powers of with coefficients from is also a ring, called the polynomial ring of and written. Each such polynomial is a finite sum of terms, each term being of the form where and represents the-th power of. Definition Given a ring, a zero-divisor is an element such that such that. Definition An integral domain is a commutative ring with and with no non-zero zero-divisors. Remark An integral domain has a useful cancellation property: Let be an integral domain and let with."}, {"url": "http://www.intmath.com/functions-and-graphs/2a-domain-and-range.php", "passage_text": "Domain. The domain of a function is the complete set of possible values of the independent variable. In plain English, this definition means: The domain is the set of all possible x-values which will make the function work, and will output real y-values. When finding the domain, remember: 1  The denominator (bottom) of a fraction cannot be zero. 2  The number under a square root sign must be positive in this work."}, {"url": "https://en.wikipedia.org/wiki/Maxima_and_minima", "passage_text": "If the domain X is a metric space then f is said to have a local (or relative) maximum point at the point x ∗ if there exists some ε f (x ∗) ≥ f (x) for all x in X within distance ε of x ∗ . Similarly, the function has a local minimum point at x ∗ if f (x ∗) ≤ f (x) for all x in X within distance ε of x ∗ . 1 Note that this function has no global maximum or minimum. 2  The function | x | has a global minimum at x = 0 that cannot be found by taking derivatives, because the derivative does not exist at x = 0. 3  The function cos(x) has infinitely many global maxima at 0, ±2π, ±4π, …, and infinitely many global minima at ±π, ±3π, …."}, {"url": "http://www.intmath.com/functions-and-graphs/2a-domain-and-range.php", "passage_text": "The range of a function is the complete set of all possible resulting values of the dependent variable (y, usually), after we have substituted the domain. In plain English, the definition means: The range is the resulting y-values we get after substituting all the possible x-values. The domain is the set of all possible x-values which will make the function work, and will output real y-values. When finding the domain, remember: 1  The denominator (bottom) of a fraction cannot be zero. 2  The number under a square root sign must be positive in this work."}]