[{"url": "http://www.dha.gov.za/index.php/travel-documents2", "passage_text": "To apply for the passport, you must submit the following documents: 1  A duly completed passport application Form DHA-73. 2  Your original identity document and a copy, or a birth certificate and copy thereof if under 16. 3  If under 18 years, parental consent for issuing of the passport. These passports are issued to SA citizens who are 16 years and older. The passports are valid for 10 years from the date of issue, and are not renewable. When your South African passport expires you have to complete a new application to get a new passport."}, {"url": "http://www.manishsingh.com/tag/passport-police-verification/", "passage_text": "1 Make sure to mention the correct police station in the application as an error here will delay your police verification. 2  Passport authorities will not be able to guide you on filling up such details. 3  Once the application form is filled, you can click submit and the system will generate an application reference number. "}, {"url": "http://www.tigard-or.gov/city_hall/passports.php", "passage_text": "This page provides an overview of the passport application process. It is highly recommended that you visit the U.S. Department of State's passport site for complete information. Their website is http://travel.state.gov/content/passports/english.html. To obtain more information about renewing your passport by mail or to download form DS-82 from the U.S. Department of State, click on http://travel.state.gov/content/passports/english/passports.html."}, {"url": "http://www.passportindia.gov.in/AppOnlineProject/pdf/ApplicationformInstructionBooklet-V3.0.pdf", "passage_text": " Under Tatkaal scheme, no proof of urgency is required and Post police verification shall be done in ALL such cases.  Fee for a Tatkaal scheme is higher than a normal application fee. For details on fees, see Chapter E of the passport instruction booklet. If you are applying for a passport of a minor (below 18 years of age), following details of valid passports (if any) held by BOTH OR EITHER parent(s) or legal guardian must be furnished in the relevant column.  Write the passport number of the minor’s parent(s) or legal guardian."}, {"url": "http://www.mahapolice.gov.in/mahapolice/jsp/temp/passportfaq.jsp", "passage_text": "Ans: VISA refers to an endorsement (writing or branding) on the passport, made by competent authority of a nation State, allowing entry to the passport holder into another country. VISA is necessary for entry into another country. Ans : Passport is an official document, issued by competent authority on behalf of a sovereign nation state, certifying the holders identity and nationality, & authorizing the holder to travel abroad."}, {"url": "http://nashikpolice.com/index.php/communication-centre/passport-verification/", "passage_text": "VISA refers to an endorsement (writing or branding) on the passport, made by competent authority of a nation State, allowing entry to the passport holder into another country. VISA is necessary for entry into another country. "}, {"url": "http://www.passportindia.gov.in/AppOnlineProject/pdf/ApplicationformInstructionBooklet-V3.0.pdf", "passage_text": "For re-issue of passport, details of latest held/existing/lost/damaged passport must be furnished in Column 7.1 of passport application form. Put cross in the appropriate box due to which the change(s) is/ are required in the personal particulars. If you are applying for a passport of a minor (below 18 years of age), following details of valid passports (if any) held by BOTH OR EITHER parent(s) or legal guardian must be furnished in the relevant column.  Write the passport number of the minor’s parent(s) or legal guardian."}, {"url": "http://thanepolice.org/faq13.php", "passage_text": "VISA refers to an endorsement (writing or branding) on the passport, made by competent authority of a nation State, allowing entry to the passport holder into another country. VISA is necessary for entry into another country. "}, {"url": "http://www.passportindia.gov.in/AppOnlineProject/pdf/ApplicationformInstructionBooklet-V3.0.pdf", "passage_text": "This Passport Application Form and Supplementary Form, issued by the Government of India, is machine-readable. It will be scanned by Intelligent Character Recognition (ICR) enabled scanners. Incomplete or inappropriately-filled application form will not be accepted. If you are applying for a passport of a minor (below 18 years of age), following details of valid passports (if any) held by BOTH OR EITHER parent(s) or legal guardian must be furnished in the relevant column.  Write the passport number of the minor’s parent(s) or legal guardian."}, {"url": "https://www.usps.com/international/passports.htm", "passage_text": "1 Schedule an appointment at a Department of State passport agency. 2  Get a Passport in a Hurry Priority Mail Express Track Your Application in the Mail If you mail your application with Priority Mail Express and Priority Mail® services, USPS Tracking® is included for free. 3  Add USPS Tracking® Add Signature Confirmation. Renew by Mail. You can renew your passport by mail with application DS-82 if you meet the criteria listed on the U.S. Department of State web site. Renew by Mail Checklist. You can also renew your passport by bringing your prepared renewal application to a Post Office™ location."}]