[{"url": "http://www.the-science-site.com/crustal-plates.html", "passage_text": "Oceanic crustal plates are constantly forming deep on ocean floors where tectonic plates are separating. The new ocean floor forms in rift valleys where two tectonic plates are separating. Plumes of molten rock form beneath the separating plates at their boundary forming a bulge on the ocean floor."}, {"url": "http://www.kids-earth-science.com/crustal-plates.html", "passage_text": "Crustal plates cover the surface of the Earth. Large tectonic plates are named for the continents and oceans. Smaller plates are named for areas where they are located. For instance the Juan de Fuca Plate is located in the Pacific Northwest off the coasts of California, Oregon, Washington and British Columbia."}, {"url": "http://www.kids-fun-science.com/crustal-plates.html", "passage_text": "Introduction. Crustal plates form the outer layer of the Earth. There are seven major plates and many smaller plates. These tectonic plates are formed from the Earth's crust and uppermost part of the mantle. Types of tectonic plates. There are two t"}, {"url": "http://www.the-science-site.com/crustal-plates.html", "passage_text": "Earth's Crustal Plates. Crustal plates (tectonic plates) are the outer shell of the Earth. Continental crust and oceanic crust are the two main types of plates. Large plates like the North American Plate is considered a continental plate but also contains oceanic crust."}, {"url": "http://www.dummies.com/how-to/content/how-crustal-plates-move-plate-tectonics.html", "passage_text": "Plate tectonics is the unifying theory of geology. This theory explains how crustal plates move around the surface of the earth, and it allows geologists to find explanations for geologic events such as earthquakes and volcanoes, as well as the many other processes that form, transform, and destroy rocks."}, {"url": "http://www.answers.com/Q/What_are_the_seven_crustal_plates", "passage_text": "The seven crustal plates are African Plate, Antarctic Plate, Australian Plate, Eurasian Plate, North American Plate, South American Plate, and Pacific Plate."}, {"url": "http://www.kids-fun-science.com/crustal-plates.html", "passage_text": "Oceanic crust. Oceanic crust is constantly being formed at a mid ocean ridge. Molten rock from the mantle forms beneath spreading ridges where two crustal plates are separating. The lava erupts from vents forming pillow basalt as the plates move apart."}, {"url": "http://www.the-science-site.com/crustal-plates.html", "passage_text": "Crustal plates (tectonic plates) are the outer shell of the Earth. Continental crust and oceanic crust are the two main types of plates."}]