[{"url": "http://www.educationnews.org/career-index/physical-therapy-assistant-schools-in-louisville-ky/", "passage_text": "In Louisville, salaries for physical therapy assistant professionals have increased. Louisville physical therapy assistant professionals made $37,590 per year, on average, in 2010. Physical therapy assistant professionals in Louisville made a yearly average salary of $32,445, four years earlier in 2006. The growth in the salary of physical therapy assistant professionals in Louisville is faster than the salary trend for all careers in the city."}, {"url": "http://www.hackcollege.com/school-finder/schools/kentucky/louisville/physical-therapy-assistant/", "passage_text": "The average salary you can expect to earn as a physical therapy assistant in Louisville is $51,290 per year. This is higher than the state-wide average salary for physical therapy assistants."}, {"url": "http://www.payscale.com/research/US/Job=Physical_Therapist_Assistant/Hourly_Rate", "passage_text": "The average wage for a Physical Therapist Assistant is $24.54 per hour. The highest paying skills associated with this job are Home Health/Home Care and Long Term Care. Most people with this job move on to other positions after 20 years in this career."}, {"url": "http://www.indeed.com/salary/q-Physical-Therapist-Assistant-l-Louisville,-KY.html", "passage_text": "$54,000. Average Physical Therapist Assistant salaries for job postings in Louisville, KY are 21% lower than average Physical Therapist Assistant salaries for job postings nationwide."}, {"url": "http://www.indeed.com/salary/q-Physical-Therapy-Assistant-l-Louisville,-KY.html", "passage_text": "Average Physical Therapy Assistant salaries for job postings in Louisville, KY are 21% lower than average Physical Therapy Assistant salaries for job postings nationwide."}, {"url": "http://www.payscale.com/research/US/Job=Certified_Occupational_Therapy_Assistant_(COTA)/Hourly_Rate/aadb3d7f/Louisville-KY", "passage_text": "The average pay for a Certified Occupational Therapy Assistant (COTA) in Louisville, Kentucky is $24.21 per hour."}]