[{"url": "http://www.nolo.com/legal-encyclopedia/what-public-benefits-can-green-card-holder-receive.html", "passage_text": "If you are a U.S. green card holder (“permanent resident”) who finds yourself in need, you may consider applying for public benefits (government financial or other assistance)."}, {"url": "http://www.nydailynews.com/new-york/u-s-legally-permanent-residents-qualify-social-security-retirement-benefits-article-1.997329", "passage_text": "Cheryl Thompson, Queens. A. Your friend is wrong. As a lawful permanent resident, you qualify for retirement benefits while in the United States and perhaps even if you move abroad. You need not become a U.S. citizen. Your friend’s information represents a common myth. Let’s review the rules."}, {"url": "http://www.nydailynews.com/new-york/u-s-legally-permanent-residents-qualify-social-security-retirement-benefits-article-1.997329", "passage_text": "To get Social Security retirement benefits while in the United States, a retiree must be legally here. However, U.S. citizens, permanent residents and even some undocumented immigrants can get those benefits if they move abroad."}, {"url": "https://www.irs.gov/publications/p597/ar02.html", "passage_text": "Social security benefits. U.S. social security benefits paid to a resident of Canada are taxed in Canada as if they were benefits under the Canada Pension Plan, except that 15% of the amount of the benefit is exempt from Canadian tax. Alimony."}, {"url": "http://www.cic.gc.ca/english/newcomers/about-pr.asp", "passage_text": "What permanent residents can do. As a permanent resident, you have the right to: 1  get most social benefits that Canadian citizens receive, including health care coverage, 2  live, work or study anywhere in Canada, 3  apply for Canadian citizenship, 4  protection under Canadian law and the Canadian Charter of Rights and Freedoms."}, {"url": "http://canadianimmigrant.ca/family/seniors/helping-immigrant-seniors-understand-how-they-can-access-social-security-benefits", "passage_text": "Old age security. Old age security (OAS) is a federally funded monthly pension, which is paid to eligible seniors who have reached the age of 65, are Canadian citizens or permanent residents, and have lived in Canada for at least 10 years after the age of 18."}, {"url": "http://www.nolo.com/legal-encyclopedia/what-public-benefits-can-green-card-holder-receive.html", "passage_text": "Permanent residents cannot apply for SSI benefits until they have lived in the U.S. for five years. After five years in the U.S., a permanent resident will qualify for SSI only if he or she has credit for 40 quarters of work."}]