[{"url": "https://recipes.sparkpeople.com/recipe-detail.asp?recipe=12866", "passage_text": "If using cooling racks, line cookie sheets with aluminum foil. Preheat the oven to 225 degrees. Core, then slice 4 apples as paper thin as possible (a mandoline slicer is helpful if you have one). Spread the apples in a single layer on top of the parchment paper or cooling rack. Sprinkle lightly with a cinnamon/Splenda mix."}, {"url": "http://tasty-yummies.com/2014/10/14/how-to-make-dehydrated-apple-chips/", "passage_text": "Oven: Preheat the oven to 200ºF. Arrange the apple slices in a single layer on a parchment paper lined metal baking pan. Bake the apples slices for 1 hour, then flip them and allow to bake for another 1 to 2 hours until the chips are no longer moist. Flipping occasionally."}, {"url": "http://allrecipes.com/recipe/233281/apple-chips/", "passage_text": "1 Arrange apples slices on a metal baking sheet. 2  Mix sugar and cinnamon together in a bowl; sprinkle over apple slices. 3  Bake in the preheated until apples are dried and edges curl up, 45 minutes to 1 hour. 4  Transfer apple chips, using a metal spatula, to a wire rack until cooled and crispy."}, {"url": "http://www.marthastewart.com/1050671/apple-chips", "passage_text": "Directions. Heat oven to 225 degrees. Arrange apple slices on two parchment-lined baking sheets and bake for 1 1/2 hours. Flip, then continue baking until crisp, about 1 hour more. Remove and let cool completely. Chips keep, stored in an airtight container, 1 week."}, {"url": "http://allrecipes.com/recipe/233281/apple-chips/", "passage_text": "1 Preheat oven to 225 degrees F (110 degrees C). 2  Arrange apples slices on a metal baking sheet. 3  Mix sugar and cinnamon together in a bowl; sprinkle over apple slices. 4  Bake in the preheated until apples are dried and edges curl up, 45 minutes to 1 hour."}, {"url": "http://www.fifteenspatulas.com/cinnamon-sugar-baked-apple-chips/", "passage_text": "Decide whether or not to core your apples, then slice them thinly with a mandolin slicer. Line two sheet pans with parchment paper, and place the apple slices side by side on the parchment, in a single layer. Make sure not to overlap the apple slices or place them on top of each other, otherwise they won't crisp up."}]