[{"url": "http://cooking.stackexchange.com/questions/10464/what-temperature-to-cook-a-pork-tenderloin-at", "passage_text": "I always season my pork tenderloins, then pan-sear for a crispy brown outer crust, then put into the oven at 350 degrees for about 45 minutes to one hour. At 45 minutes, I begin checking the internal temperature of the meat."}, {"url": "http://www.wikihow.com/Cook-Pork-Tenderloin", "passage_text": "1 Place the tenderloin in a roasting pan. 2  Place the pan in the oven and roast for about 15 minutes, or until the internal temperature reaches 145 degrees Fahrenheit (63 degrees Celsius). 3  Allow the pork to rest for 10 minutes before serving."}, {"url": "http://www.porkbeinspired.com/wp-content/uploads/2014/06/2924.pdf", "passage_text": "The National Pork Board recommends cooking pork chops, roasts, and tenderloin to an internal temperature between 145° F. (medium rare) and 160° F. (medium), followed by a 3 minute rest. Since large cuts increase approximately 10° F. while resting, remove them from the heat at 150° F. followed by a 10"}, {"url": "http://www.food.com/recipe/perfect-pork-tenderloin-63828", "passage_text": "1 Preheat oven to 500 degrees. 2  Remove tenderloin from refrigerator. 3  Season meat as desired. 4  Place seasoned meat in an uncovered roasting pan on a shelf in the bottom 1/3 of your oven. 5  Bake EXACTLY 5 1/2 minutes PER POUND. 6  Adjust +/- according to your oven's accuracy and heat retention. 7  NOTE:."}, {"url": "http://www.thekitchn.com/how-to-make-roasted-pork-tenderloin-cooking-lessons-from-the-kitchn-211998", "passage_text": "The pork is done when its internal temperature registers 140°F to 145°F in the thickest part of the meat (20 to 25 minutes total). Rest for 10 minutes before serving: Transfer the pork to a cutting board, tent with foil, and let it rest for 10 minutes before slicing."}, {"url": "http://cooking.stackexchange.com/questions/10464/what-temperature-to-cook-a-pork-tenderloin-at", "passage_text": "With a pork tenderloin: Season the meat, sear all sides in a very hot pan, and then finish in the oven at 350°F (175°C) degrees until the internal temp. hits 145°F (63°C). Then let it sit for 10 minutes, and cut 'er up. If you need it done faster, a higher oven temp will accomplish this, but may compromise quality."}, {"url": "http://www.wikihow.com/Cook-Pork-Tenderloin", "passage_text": "1 For an even juicer meal, remove the pork tenderloin from the heat once the internal temperature measures between 145 to 155 degrees Fahrenheit (63 to 68 degrees Celsius), and let it rest for 5 to 10 minutes before serving."}]