[{"url": "http://www.webmd.com/skin-problems-and-treatments/preventing-body-odor", "passage_text": "1 Change your diet. 2  Sometimes, fatty foods, oils, or strong-smelling foods such as garlic, curry, and onions, can seep through your pores and cause body odor (always see a doctor or dietician before making drastic dietary changes). 3  If you have excessive sweating (called hyperhidrosis), talk to your doctor. While body odor is usually associated with the armpits, bacteria can also produce odor in the groin, anus area, upper thighs, and feet, among other places. Thoroughly washing your skin with a wet washcloth and soap -- especially those areas prone to sweating -- can help prevent body odor."}, {"url": "http://www.naturalnews.com/004417_body_odor_nutrition.html", "passage_text": "Foods that make you stink. Red meat is the number one cause of body odor. Red meat causes stagnation in the body; it putrefies in the digestive tract and releases all sorts of toxins into the bloodstream through the large intestine. As far as other foods that cause body odor, manufactured foods -- those lacking fiber and made with refined white flour, added sugars, hydrogenated oils and other processed ingredients -- are the big culprits."}, {"url": "http://livewell.jillianmichaels.com/foods-cause-body-odor-5074.html", "passage_text": "Garlic and Onions. Foods such as garlic and onions have a strong smell and high sulfur content. After you eat these items, the oils from the food absorb into the blood and can leave the body through sweat. Foods such as garlic and onions may also cause bad breath. Proper hygiene to wash the bacteria off the body will usually keep body odor at bay. Some people experience excessive sweating in a condition called hyperhidrosis, which may lead to an increase in body odor. Some foods may increase the possibility of having a pungent"}, {"url": "http://www.webmd.com/skin-problems-and-treatments/preventing-body-odor", "passage_text": "1 Sweaty gym clothes are a bacteria-breeding ground. 2  Change your diet. 3  Sometimes, fatty foods, oils, or strong-smelling foods such as garlic, curry, and onions, can seep through your pores and cause body odor (always see a doctor or dietician before making drastic dietary changes). While body odor is usually associated with the armpits, bacteria can also produce odor in the groin, anus area, upper thighs, and feet, among other places. Thoroughly washing your skin with a wet washcloth and soap -- especially those areas prone to sweating -- can help prevent body odor."}, {"url": "http://www.webmd.com/skin-problems-and-treatments/preventing-body-odor", "passage_text": "1 Sometimes, fatty foods, oils, or strong-smelling foods such as garlic, curry, and onions, can seep through your pores and cause body odor (always see a doctor or dietician before making drastic dietary changes). 2  If you have excessive sweating (called hyperhidrosis), talk to your doctor. While body odor is usually associated with the armpits, bacteria can also produce odor in the groin, anus area, upper thighs, and feet, among other places. Thoroughly washing your skin with a wet washcloth and soap -- especially those areas prone to sweating -- can help prevent body odor."}, {"url": "http://www.webmd.com/skin-problems-and-treatments/reduce-body-odor", "passage_text": "6. What you eat affects your body odor. Foods that tend to make you sweat more, such as hot peppers or other spicy foods, might also contribute to body odor. And the aroma of foods such as onions or garlic can be carried in the sweat, making you smell bad. Drinks with caffeine or alcohol may also cause you to sweat more. WebMD Medical Reference."}, {"url": "http://bodymint.com/body-odor-what-are-common-body-odor-causes/", "passage_text": "Foods commonly associated with odor issues include red meat, seafood, egg yolks, garlic, onions, yogurt, beans, asparagus, cabbage, and spices such as mustard seed and coriander. Over consumption of these foods can lead to increased body odor. Medication. A common side effect of many drugs is sweating. Body Odor. Body odor is simply defined as the unpleasant odor given off by the body. Body odor causes can vary from person to person based on a number of different factors. It is a direct result of odor compounds that are emitted through the skin and sweat."}, {"url": "http://skinnyms.com/reduce-body-ordor-with-foods-you-eat/", "passage_text": "Recent studies have also shown that diets high in red meats, can affect body odor. The relationship between food and body odor is simply a reflection of what you put in your body. Foods that cause body odor, including bad breath, are commonly caused by red meat. Researchers collected questionnaires from 500,000 people, including both men and women detailing diet and other habits."}, {"url": "http://livewell.jillianmichaels.com/foods-cause-body-odor-5074.html", "passage_text": "Spices. Spices with a strong aroma such as cumin and curry may cause body odor and bad breath. Like with the onions and garlic, the oils from the spices trap in the bloodstream and release through your pores and from the lungs when you breathe. Proper hygiene to wash the bacteria off the body will usually keep body odor at bay. Some people experience excessive sweating in a condition called hyperhidrosis, which may lead to an increase in body odor. Some foods may increase the possibility of having a pungent"}, {"url": "http://www.naturalnews.com/004417.html", "passage_text": "Foods that make you stink. Red meat is the number one cause of body odor. Red meat causes stagnation in the body; it putrefies in the digestive tract and releases all sorts of toxins into the bloodstream through the large intestine. "}]