[{"url": "http://www.thinkbabynames.com/meaning/0/Jenna", "passage_text": "Jenna /jen-na/ [2 sylls.] as a girls' name is pronounced JEN-ah. It is of Arabic origin, and the meaning of Jenna is heaven. Also fanciful alteration of Jenny with the-a ending; diminutive of Jennifer; variant of Jean (Hebrew) God's grace. The name is made famous by a character on the TV series Dallas. Jenna is also used for blends and compound names. See also Genna. Below is a charted comparison of the popularity of the girl name Jenna and related names. Popular varying forms of Jenna (#266 last year) are Jennifer (#220 last year) , Jenny (#822) , Kenna (#842) , Jeanne, Jeannie, Jennie, Jeanna, Jena, Jeanine, Gina, Genie, Gene, Jean, Jeana, Jeanie, Jeane and Eugenia."}, {"url": "http://www.ourbabynamer.com/meaning-of-Jenna.html", "passage_text": "Jenna is a diminutive (nickname) of Jennifer. The name Jennifer is the Cornish form of the Welsh name Gwenhwyfar and a variant of the name Guinevere. It is derived from the elements gwen meaning white, fair, blessed, holy and hwyfar meaning smooth, soft. Some famous bearers of this name include: Jenna Bush. "}, {"url": "http://www.babynology.com/meaning-jenna-f3.html", "passage_text": "Modern variant of Jenny and Jennifer. Form of Jennifer. Jenna name is a short form of name “Jennifer or Genevieve”. Jenna is also an Arabic name meaning small bird. Jenna name a variant of Jenny with the Latinate feminine suffix '-a'. It was first adopted in the late 20th century"}, {"url": "http://www.babynamespedia.com/meaning/Jenna", "passage_text": "Jenna is also an English contraction of the English and German Jennifer. Jenna is also an English form of the English and German Jenny. See also the related forms, Jennabel, Jennalyn, Jennanne, and Jennarae. Jenna is popular as a baby name for girls. The name jumped in popularity from the 1970s up to the 1980s; prior to that, it was of irregular use only"}, {"url": "http://www.meaning-of-names.com/english-names/jenna.asp", "passage_text": "Meaning of Jenna. English name. In English, the name Jenna means-small bird.The name Jenna originated as an English name. The name Jenna is most often used as a girl name or female name. English Name Meaning-small bird. Origin-England"}, {"url": "http://www.answers.com/Q/What_is_the_meaning_of_the_name_jenna", "passage_text": "little Bird. If you have any kind of apple product that you can have apps on than I rec-amend the app called What Does My Name Mean. It has a yellow cover. "}, {"url": "http://www.behindthename.com/name/jena/comments", "passage_text": "My name is Jena Marie. I love my name! 'Jena' also can mean 'white, fair, smooth' in Cornish, 'little bird' in English, and 'white wave' in Welsh (from Jenny/Jennifer/Gwenhwyfar). It is a variant of Jenny, which is a diminutive of Jane and Jennifer. In Scandinavian, it means 'God is gracious'. (Note that the Scandinavian name 'Jena' is for a boy)"}, {"url": "http://www.babynamespedia.com/meaning/Jenna", "passage_text": "Jenna-Meaning of Jenna. Tweet. Jenna's language of origin is Hebrew and it is predominantly used in the English language. The name developed as a variant of Jenny with the Latinate feminine suffix '-a'. It was first adopted in the late 20th century, popularized by a character bearing the name in the popular US TV soap opera Dallas (1978-1991). Jenna is also an English form of the English and German Jenny. See also the related forms, Jennabel, Jennalyn, Jennanne, and Jennarae. Jenna is popular as a baby name for girls."}, {"url": "http://www.babynamewizard.com/baby-name/girl/jenna", "passage_text": "I have been called Jenna all my life,but I answer to both. I love my name, when I was born, Jenna wasn't a popular name, so not many people my age have the same name as me. Also my middle name is Sarah which means princess, so the meaning of my name is pure, fair princess. And honestly especially for a girl like me, it can't get any better than that"}]