[{"url": "https://en.wikipedia.org/wiki/Pluto", "passage_text": "Pluto (minor-planet designation: 134340 Pluto) is a dwarf planet in the Kuiper belt, a ring of bodies beyond Neptune. It was the first Kuiper belt object to be discovered."}, {"url": "http://nineplanets.org/pluto.html", "passage_text": "Pluto orbits beyond the orbit of Neptune (usually). It is much smaller than any of the official planets and now classified as a dwarf planet. Pluto is smaller than seven of the solar system's moons (the Moon, Io, Europa, Ganymede, Callisto, Titan and Triton)."}, {"url": "http://www.universetoday.com/13573/why-pluto-is-no-longer-a-planet/", "passage_text": "And so, Pluto is a dwarf planet. There are still many objects with similar size and mass to Pluto jostling around in its orbit. And until Pluto crashes into many of them and gains mass, it will remain a dwarf planet. Eris suffers from the same problem."}, {"url": "http://space-facts.com/pluto/", "passage_text": "Discovered in 1930, Pluto is the second closest dwarf planet to the Sun and was at one point classified as the ninth planet. Pluto is the largest dwarf planet but only the second most massive, with Eris being the most massive."}, {"url": "http://nineplanets.org/pluto.html", "passage_text": "Pluto Facts. Pluto orbits beyond the orbit of Neptune (usually). It is much smaller than any of the official planets and now classified as a dwarf planet. Pluto is smaller than seven of the solar system's moons (the Moon, Io, Europa, Ganymede, Callisto, Titan and Triton)."}, {"url": "http://www.usatoday.com/story/tech/2014/10/02/pluto-planet-solar-system/16578959/", "passage_text": "Pluto, a celestial snowball with a surface of methane ice 3.6 billion miles from the sun, might be making its way back into the solar system fraternity. First discovered and classified as planet in 1930, Pluto was relegated to dwarf-planet status by the International Astronomical Union in 2006."}, {"url": "http://www.universetoday.com/13573/why-pluto-is-no-longer-a-planet/", "passage_text": "Even though Pluto is a dwarf planet, and no longer officially a planet, it’ll still be a fascinating target for study. And that’s why NASA has sent their New Horizons spacecraft off to visit it. New Horizons will reach Pluto in July 2015, and capture the first close-up images of the (dwarf) planet’s surface."}, {"url": "https://en.wikipedia.org/wiki/Pluto", "passage_text": "Pluto was discovered in 1930 by Clyde Tombaugh, and was originally considered the ninth planet from the Sun. After 1992, its status as a planet fell into question following the discovery of several objects of similar size in the Kuiper belt."}]