[{"url": "http://www.ansto.gov.au/NuclearFacts/AboutNuclearScience/Radioisotopes/", "passage_text": "Radioisotopes are widely used in medicine, industry and scientific research, and new applications for their use are constantly being developed. Radioisotopes are radioactive isotopes of an element. "}, {"url": "https://en.wikipedia.org/wiki/Radiometric_dating", "passage_text": "The precision of a dating method depends in part on the half-life of the radioactive isotope involved. For instance, carbon-14 has a half-life of 5,730 years. After an organism has been dead for 60,000 years, so little carbon-14 is left that accurate dating can not be established. Potassium-40 has a half-life of 1.3 billion years, and so this method is applicable to the oldest rocks. Radioactive potassium-40 is common in micas, feldspars, and hornblendes, though the closure temperature is fairly low in these materials, about 350 °C (mica) to 500 °C (hornblende)."}, {"url": "http://www.answers.com/Q/Which_isotope_is_most_commonlt_used_in_the_radioactive_dating_of_the_remains_of_organic_materials", "passage_text": "Radioa … ctive isotopes decay from their parent isotope to daughter isotope at a constant rate (under any circumstances). The rate at which a parent isotope decays to its daughter isotope is considered one half life. Carbon-14 has a half life of 5730 years and its daughter isotope is Nitrogen-14."}, {"url": "https://en.wikipedia.org/wiki/Commonly_used_gamma-emitting_isotopes", "passage_text": "It has a half-life of 30 years, and decays by pure beta decay to a metastable state of barium -137 (137mBa). Barium-137m has a half-life of minutes and is responsible for all of the gamma ray emission. The ground state of barium-137 is stable. These gamma rays can be used, for example, in radiotherapy such as for the treatment of cancer, in food irradation, or in industrial gauges or sensors. Cs-137 is not widely used for industrial radiography as other nuclides, such as cobalt-60 or iridium-192 for example, offer higher radiation output for a given volume."}, {"url": "https://en.wikipedia.org/wiki/Radiometric_dating", "passage_text": "Radiometric dating (often called radioactive dating) is a technique used to date materials such as rocks or carbon, in which trace radioactive impurities were selectively incorporated when they formed. Potassium-40 has a half-life of 1.3 billion years, and so this method is applicable to the oldest rocks. Radioactive potassium-40 is common in micas, feldspars, and hornblendes, though the closure temperature is fairly low in these materials, about 350 °C (mica) to 500 °C (hornblende)."}, {"url": "http://pubs.usgs.gov/gip/geotime/radiometric.html", "passage_text": "Another important atomic clock used for dating purposes is based on the radioactive decay of the isotope carbon-14, which has a half-life of 5,730 years. Carbon-14 is produced continuously in the Earth's upper atmosphere as a result of the bombardment of nitrogen by neutrons from cosmic rays. Atoms of the same element with differing atomic weights are called isotopes. Radioactive decay is a spontaneous process in which an isotope (the parent) loses particles from its nucleus to form an isotope of a new element (the daughter)."}, {"url": "https://en.wikipedia.org/wiki/Isotopes_of_hydrogen", "passage_text": "Of these, 5 H is the most stable, and 7 H is the least. Hydrogen is the only element whose isotopes have different names that are in common use today. The 2 H (or hydrogen-2) isotope is usually called deuterium, while the 3 H (or hydrogen-3) isotope is usually called tritium. The symbols D and T (instead of 2 H and 3 H) are sometimes used for deuterium and tritium."}, {"url": "http://www.thyroid.org/radioactive-iodine/", "passage_text": "Iodine, in the form of iodide, is made into two radioactive isotopes that are commonly used in patients with thyroid diseases: I-123 (harmless to thyroid cells) and I-131 (destroys thyroid cells). "}, {"url": "http://sciencelearn.org.nz/Contexts/Just-Elemental/Looking-Closer/Using-isotopes-as-tracers", "passage_text": "Radionuclides used in PET scanning are isotopes with short half–lives, such as carbon-11 (~20 min), nitrogen-13 (~10 min), oxygen-15 (~2 min) and fluorine-18 (~110 min). These radionuclides are added into compounds normally used by the body such as glucose (or variations of glucose), water or ammonia. Such labelled compounds are known as radiotracers. In some situations, the patient is required to breath oxygen gas labelled with oxygen-15. Radioactive isotopes and radioactively labelled molecules are used as tracers to identify abnormal bodily processes. This is possible because some elements tend to concentrate (in compound form) in certain parts of the body – iodine in the thyroid, phosphorus in the bones and potassium in the muscles."}, {"url": "http://www.answers.com/Q/Which_isotope_is_most_commonlt_used_in_the_radioactive_dating_of_the_remains_of_organic_materials", "passage_text": "There are many uses of radioactive isotopes. Two of the most common include carbon dating to discover how old fossils and other historical organic (including carbon) artifacts … are and uses of radioactive isotopes in medicine. Radioactive isotopes in medicine are used to help diagnose certain disease states and isolate regions in the body. The rate at which a parent isotope decays to its daughter isotope is considered one half life. Carbon-14 has a half life of 5730 years and its daughter isotope is Nitrogen-14."}]