[{"url": "http://kids.mongabay.com/lesson_plans/lisa_algee/deforestation.html", "passage_text": "1. Deforestation refers to the cutting, clearing, and removal of rainforest or related ecosystems into less bio-diverse ecosystems such as pasture, cropland, or plantations. 2. Logging, mining, oil and gas extraction, cattle ranching, agriculture, and International, National, and Local reasons."}, {"url": "http://earthobservatory.nasa.gov/Features/Deforestation/deforestation_update3.php", "passage_text": "The single biggest direct cause of tropical deforestation is conversion to cropland and pasture, mostly for subsistence, which is growing crops or raising livestock to meet daily needs. The conversion to agricultural land usually results from multiple direct factors."}, {"url": "http://earthobservatory.nasa.gov/Features/Deforestation/deforestation_update3.php", "passage_text": "Direct causes of deforestation are agricultural expansion, wood extraction (e.g., logging or wood harvest for domestic fuel or charcoal), and infrastructure expansion such as road building and urbanization. Rarely is there a single direct cause for deforestation."}, {"url": "http://kanat.jsc.vsc.edu/student/callahan/mainpage.htm", "passage_text": "Deforestation of the world's rainforests has numerous impacts on the environment and is occurring at alarming rates. As a result, species extinction has become a daily occurrence. Other problems are created: flooding, erosion, and global climate change are all interrelated and directly related to deforestation."}, {"url": "http://earthobservatory.nasa.gov/Features/Deforestation/deforestation_update3.php", "passage_text": "In the Amazon, industrial-scale cattle ranching and soybean production for world markets are increasingly important causes of deforestation, and in Indonesia, the conversion of tropical forest to commercial palm tree plantations to produce bio-fuels for export is a major cause of deforestation on Borneo and Sumatra."}, {"url": "http://www.livescience.com/27692-deforestation.html", "passage_text": "Countries with significant deforestation include Brazil, Indonesia, Thailand, the Democratic Republic of Congo and other parts of Africa, and parts of Eastern Europe, according to GRID-Arendal, a United Nations Environment Program collaborating center. The country with the most deforestation is Indonesia."}, {"url": "http://www.worldwildlife.org/threats/deforestation", "passage_text": "Deforestation is a particular concern in tropical rainforests because these forests are home to much of the world’s biodiversity. For example, in the Amazon around 17% of the forest has been lost in the last 50 years, mostly due to forest conversion for cattle ranching."}, {"url": "http://kanat.jsc.vsc.edu/student/callahan/mainpage.htm", "passage_text": "Figure 1. Tropical rainforest deforestation rates (RAN, 1999). Most of the plant and animal life in Madagascar are the world's most endangered species. Slash-and-burn agriculture on poor soil, is the major reason for deforestation, which causes habitat destruction leading to species endangerment."}, {"url": "http://environment.nationalgeographic.com/environment/global-warming/deforestation-overview/", "passage_text": "Deforestation is clearing Earth's forests on a massive scale, often resulting in damage to the quality of the land. Forests still cover about 30 percent of the world’s land area, but swaths the size of Panama are lost each and every year."}, {"url": "http://www.livescience.com/27692-deforestation.html", "passage_text": "Some other statistics: 1  About half of the world's tropical forests have been cleared (FAO). 2  Forests currently cover about 30 percent of the world’s land mass (National Geographic). 3  Forest loss contributes between 6 percent and 12 percent of annual global."}]