[{"url": "http://www.answers.com/Q/Why_does_DNA_replication_occur_before_mitosis_begins", "passage_text": "Confidence votes 174. DNA has to replicate before mitosis to keep the number of chromosomes and DNA in the cell consistent. Mitosis is the process of reproducing cells by splitting one cell in half to make two. If the DNA didn't replicate, the two daughter cells wouldn't be able to have a complete strand. DNA replicates by dividing in half, then creating a mirror image of itself. Replication gives both strands of DNA an EXACT copy"}, {"url": "https://en.wikipedia.org/wiki/Cell_division", "passage_text": "In eukaryotes, there are two distinct types of cell division: a vegetative division, whereby each daughter cell is genetically identical to the parent cell (mitosis), and a reductive cell division, whereby the number of chromosomes in the daughter cells is reduced by half, to produce haploid gametes (meiosis). Before division can occur, the genomic information that is stored in chromosomes must be replicated, and the duplicated genome must be separated cleanly between cells."}, {"url": "http://www.answers.com/Q/Why_must_DNA_replicate_before_mitosis_starts", "passage_text": "DNA has to replicate before mitosis to keep the number of chromosomes and DNA in the cell consistent. Mitosis is the process of reproducing cells by splitting one cell in half … to make two. If the DNA didn't replicate, the two daughter cells wouldn't be able to have a complete strand. DNA replicates by dividing in half, then creating a mirror image of itself. DNA replication mus occur before mitosis starts. Mitosis is another  word for cell division and so there must be two copies of DNA for  each cell at the end stage."}, {"url": "http://virtuallaboratory.colorado.edu/Biofundamentals/lectureNotes-Revision/Topic5-1_CellDivision.htm", "passage_text": "Perhaps the most characteristic feature of life is the ability to replicate, to make copies of itself. During the process of cell division, the genetic material must be replicated. The two strands of the DNA molecule separate locally, and each serves as a template for generating a new strand. Changes in the DNA that accumulate prior to, or which occur during replication, are passed on to the daughter cells. These daughter cells are built using energy and matter captured from the environment."}, {"url": "http://www2.estrellamountain.edu/faculty/farabee/biobk/BioBookmito.html", "passage_text": "Whether the cell was eukaryotic or prokaryotic, these basic events must occur. Cytokinesis is the process where one cell splits off from its sister cell. It usually occurs after cell division. The Cell Cycle is the sequence of growth, DNA replication, growth and cell division that all cells go through. Beginning after cytokinesis, the daughter cells are quite small and low on ATP."}, {"url": "https://en.wikipedia.org/wiki/DNA_replication", "passage_text": "DNA replication is the process of producing two identical replicas from one original DNA molecule. This biological process occurs in all living organisms and is the basis for biological inheritance. DNA is made up of two strands and each strand of the original DNA molecule serves as a template for the production of the complementary strand, a process referred to as semiconservative replication. Cellular proofreading and error-checking mechanisms ensure near perfect fidelity for DNA replication."}, {"url": "http://users.rcn.com/jkimball.ma.ultranet/BiologyPages/D/DNAReplication.html", "passage_text": "1 A portion of the double helix is unwound by a helicase. 2  A molecule of a DNA polymerase binds to one strand of the DNA and begins moving along it in the 3' to 5' direction, using it as a template for assembling a leading strand of nucleotides and reforming a double helix. 1 A molecule of a DNA polymerase binds to one strand of the DNA and begins moving along it in the 3' to 5' direction, using it as a template for assembling a leading strand of nucleotides and reforming a double helix. 2  In eukaryotes, this molecule is called DNA polymerase epsilon (ε)."}]