[{"url": "http://www.rch.org.au/bloodtrans/about_blood_products/Irradiation_of_blood_products/", "passage_text": "Irradiation of blood prod ucts. Irradiation of blood products is undertaken using a dedicated blood irradiator with a long half-life gamma emitting source. Irradiation of red blood cells and whole blood results in reduced post transfusion red cell recovery and increases the rate of efflux of intracellular potassium. At RCH a universal blood irradiation policy applies for patients in the following units: ICU, NNU, Haematology/Oncology. Although not all patients in these units are at risk of TA-GVHD, this policy ensures patients who require irradiated products are not missed."}, {"url": "http://www.ncbi.nlm.nih.gov/pubmed/2386151", "passage_text": "Hyperkalemia after irradiation of packed red blood cells: possible effects with intravascular fetal transfusion. Thorp JA, Plapp FV, Cohen GR, Yeast JD, O'Kell RT, Stephenson S. Plasma potassium, calcium, and albumin concentrations in irradiated blood, and in fetal blood before and after transfusion, were measured. Dangerously high plasma potassium levels were observed in some units of irradiated packed red blood cells (range, 13.9 to 66.5 mEq/L; mean, 44.7 mEq/L) and could be one possible explanation for the high incidence of fetal arrhythmia associated with fetal intravascular transfusion."}, {"url": "https://en.wikipedia.org/wiki/Packed_red_blood_cells", "passage_text": "In transfusion medicine, packed red blood cells (sometimes called stored packed red blood cells or simply packed cells) are red blood cells (RBC, also called erythrocytes) that have been collected, processed, and stored in bags as blood product units available for blood transfusion. The name Red Blood Cells with initial capitals indicates a standardized blood product in the United States. Without capitalization, it is simply generic without specifying whether or not the cells comprise a blood product, patient blood, an etc."}, {"url": "http://bloodbank-egypt.com/Irradiation.htm", "passage_text": "Why are irradiated cellular blood components needed? Irradiated blood is given to prevent rare complications of transfusion called transfusion-associated graft-versus-host disease (TA-GvHD). Some patients are at particular risk of TA-GvHD. these include: 1  Patients receiving transfusions from family members or HLA-matched donors. 2  Patients with inherited or acquired deficiencies in immunity. 3  Patients with a disease such as Hodgkin's disease or due to chemotherapy. 4  Patients have undergone procedures such as bone marrow / stem cell 5  ... Feta"}, {"url": "http://www.rch.org.au/bloodtrans/about_blood_products/Irradiation_of_blood_products/", "passage_text": "Red cell products are irradiated at the time of crossmatch or just prior to release for neonatal, intensive care and cardiac surgery patients. At RCH a universal blood irradiation policy applies for patients in the following units: ICU, NNU, Haematology/Oncology. Although not all patients in these units are at risk of TA-GVHD, this policy ensures patients who require irradiated products are not missed."}, {"url": "http://allnurses.com/first-year-after/irradiated-prbcs-341351.html", "passage_text": "Irradiated Blood is primarily used to prevent GVHD (graft vs host disease) and as a secondary benifit destroys the CMV virus. The irradiation prevents lymphcytes from replicating. "}, {"url": "https://en.wikipedia.org/wiki/Packed_red_blood_cells", "passage_text": "The product is typically abbreviated RBC, pRBC, PRBC, and sometimes StRBC or even LRBC (the latter being to indicate those that have been leukoreduced, which is now true for the vast majority of RBC units). The name Red Blood Cells with initial capitals indicates a standardized blood product in the United States. Without capitalization, it is simply generic without specifying whether or not the cells comprise a blood product, patient blood, an etc."}, {"url": "https://en.wikipedia.org/wiki/Packed_red_blood_cells", "passage_text": "The cells are separated from the fluid portion of the blood after it is collected from a donor, or during the collection process in the case of apheresis. The product is then sometimes modified after collection to meet specific patient requirements. The name Red Blood Cells with initial capitals indicates a standardized blood product in the United States. Without capitalization, it is simply generic without specifying whether or not the cells comprise a blood product, patient blood, an etc."}, {"url": "https://answers.yahoo.com/question/index?qid=20080318031846AAiUNKh", "passage_text": "Best Answer: Many units of red blood cells and platelets ARE irradiated before transfusions. This is done to inactivate lymphocytes in the donor units. Report Abuse. Most blood in the US is not irradiated prior to transfusion. Irradiated blood is generally only given to a patient when requested by their doctor. Liz is correct in stating when (clinical conditions) doctors request irradiated units."}]