[{"url": "http://www.iodine-resource.com/iodized-salt.html", "passage_text": "Iodized salt is created by the simple act of adding a dry or liquid mix of potassium iodate or potassium iodide to salt (sodium chloride) with stabalizing additives. The source of iodide or iodate is obtained from only a few companies world wide. "}, {"url": "http://www.answers.com/Q/What_is_non-iodized_salt", "passage_text": "Table salt is iodized (that is, iodine is included via sodium iodide or potassium iodide) because people used to be unable to get enough iodine from their diets, and iodine is … necessary for a person's thyroid gland to work properly. Non-iodized salt is salt that is packaged and marketed for use without having any iodine added to it."}, {"url": "http://culinaryarts.about.com/od/glossary/g/Iodized-Salt.htm", "passage_text": "Iodized salt. Bob Ingelhart / Getty Images. Iodized salt is a form of table salt which has had iodine added to it to prevent a disease called goiter. Goiter is characterized by the swelling of the thyroid gland due to iodine deficiency. Iodine is a nutrient that usually occurs naturally in vegetables, which absorb it through the soil in which they grow. But a diet consisting of food grown in soil that lacks iodine can cause an iodine deficiency, leading to"}, {"url": "http://www.diffen.com/difference/Iodized_Salt_vs_Sea_Salt", "passage_text": "Iodized salt, otherwise known as table salt, is salt mined from underground, while sea salt is obtained by evaporating sea water. By weight, the two types contain the same amount of sodium, but sea salt is sometimes seen as more healthy, because it contains more minerals. However, these are insignificant amounts. Iodized salt contains added iodine, a nutrient that helps maintain a healthy thyroid. It is also good for pregnant women. Some argue that sea salt is more natural and contains more minerals, and so is better for your health."}, {"url": "http://goaskalice.columbia.edu/answered-questions/whats-iodized-salt-it-better-you-regular-salt", "passage_text": "Dear Wondering, Great question! Iodine is a mineral that is added to table salt and found in a variety of foods. It is important for good health and, fortunately, our bodies require it in relatively small quantities. Iodine is part of a hormone, thyroxin, which is responsible for maintaining a person's metabolic rate."}, {"url": "http://www.differencebetween.net/object/comparisons-of-food-items/difference-between-salt-and-iodized-salt/", "passage_text": "Salt vs Iodized salt. In chemistry, salt is a crystal composed of the elements sodium and chloride. Salt, as a flavour, is one of the most basic tastes. It also has the characteristics in it that makes it as a great preservative. Salt for human consumption is obtained from seawater or rock deposits. Iodized salt is usually, if not absolutely, a refined form of salt. It is stripped off of other minerals other than sodium chloride and added with iodine which is about 1% of the makeup. Summary: 1. Salt generally comes from the sea or rock deposits and can be in many forms depending on the process it undergoes."}, {"url": "http://www.saltinstitute.org/news-articles/iodized-salt/", "passage_text": "Generally, iodized salt contains 0.002% to 0.004% iodine, supplied either as potassium iodide or potassium iodate. In the U.S., iodine is added as potassium iodide in table salt at slightly higher levels (0.006% to 0.01% potassium iodide, equivalent to 0.0046% to 0.0077% iodine. Potassium iodide is one of two sources of iodine permissible by the U.S. Food and Drug Administration. "}]