[{"url": "http://www.imdb.com/name/nm2164172/bio", "passage_text": "Mini Bio (1). Singer for the band Panic at the Disco with members Ryan Ross, Jon Walker and Spencer Smith. Focused on the band after finishing high school."}, {"url": "https://en.wikipedia.org/wiki/Panic!_At_The_Disco", "passage_text": "Panic! at the Disco (stylized for a time as Panic at the Disco) is an American rock band from Las Vegas, Nevada, formed in 2004 and featuring the current lineup of vocalist and guitarist Brendon Urie."}, {"url": "http://panicatthedisco.wikia.com/wiki/Ryan_Ross", "passage_text": "George Ryan Ross III is an American guitarist, singer and songwriter most known for his work as the lead guitarist, backup vocalist and main songwriter for the band Panic! at the Disco. He and Jon Walker, the bassist, left after the second album, Pretty. Odd."}, {"url": "http://www.tmz.com/person/brendon-urie/", "passage_text": "Powered by imdb. Singer for the band Panic at the Disco with members Ryan Ross, Jon Walker and Spencer Smith. Focused on the band after finishing high school. His family are practicing Mormons, but Brendon decided that he did not follow the same beliefs, which created some tension."}, {"url": "http://www.tmz.com/2014/04/29/panic-at-the-disco-brendon-urie-roommate-lawsuit/", "passage_text": "The lead singer of the rock group Panic! at the Disco is a little slow on the uptake -- finally realizing after years his former roommate has been bleeding his bank account dry with unauthorized withdrawals ... at least that's what he claims in a new lawsuit."}, {"url": "https://en.wikipedia.org/wiki/Brendon_Urie", "passage_text": "Urie met Brent Wilson while taking guitar classes offered at their high school and Wilson asked Urie to try out as lead guitarist for Panic! at the Disco, as they were looking for a replacement at the time. Originally, Ryan Ross was their lead singer. When Urie filled in for Ross during a band rehearsal, they were impressed with Urie's vocal abilities and he was chosen as their lead singer. Since then, Panic! at the Disco has released 4 studio albums with Urie as lead vocalist."}]