[{"url": "http://www.easynotecards.com/notecard_set/28906", "passage_text": "Myosin cross-bridges remain in place until the myosin head binds an ATP molecule. In the resting state, a myosin head is bound to an ADP and a phosphate molecule that have been produced by splitting an ATP molecule. When Ca2+ binds to a myosin head, it triggers the formation of a cross-bridge between myosin and actin. A troponin molecule that binds a calcium ion weakens its connection to a G actin molecule. When Ca2+ binds to a myosin head, it triggers the formation of a cross-bridge between myosin and actin."}, {"url": "http://medical-dictionary.thefreedictionary.com/Z+line", "passage_text": "Z line. n. A dark thin protein band to which actin filaments are attached in a striated muscle fiber, marking the boundaries between adjacent sarcomeres. Also called Z band. Z line, a narrow, darkly staining cross-striation that bisects the I band of skeletal muscles. The distance between Z lines is the length of the sarcomere. Also called intermediate disk, Z band, Z disk."}, {"url": "http://www.wisegeek.org/what-is-a-sarcomere.htm", "passage_text": "Top 10 facts about the world. A sarcomere is the basic functional unit of striated muscle, which is to say, it’s the basic building block of most muscle cells. In the human body, each muscle is made up of multiple bundles of muscle fibers. These muscle fibers, in turn, are comprised of numerous finer strands called myofibrils. Muscle movement happens when the filaments slide across each other within the muscular bands. The sliding filament model is made possible by the interaction of the actin and myosin proteins within the filaments."}, {"url": "http://droualb.faculty.mjc.edu/Lecture%20Notes/Unit%203/chapter_9__skeletal_muscle_tiss%20with%20figures.htm", "passage_text": "Perimysium. The muscle fibers bound together by the endomysium form a bundle called a fascicle. The fascicles are surrounded by connective tissue containing collagen and elastic fibers that supports the blood vessels and nerves that serve the fibers of the fascicles. This connective tissue is called the perimysium. 3. Epimysium. The thick filaments are linked in the center of the sarcomere by proteins that form the M line. At either end of the sarcomere, the actin filaments are attached to one another by proteins that form the Z line. The Z lines mark the boundaries of each sarcomere"}, {"url": "https://en.wikipedia.org/wiki/Sarcomere", "passage_text": "A sarcomere (Greek sarx flesh, meros part) is the basic unit of striated muscle tissue. Skeletal muscles are composed of tubular muscle cells (myocytes called muscle fibers) which are formed in a process known as myogenesis. Muscle fibers are composed of tubular myofibrils. The myosin head also binds to ATP, which is the source of energy for muscle movement. Myosin can only bind to actin when the binding sites on actin are exposed by calcium ions. Actin molecules are bound to the Z line, which forms the borders of the sarcomere. Other bands appear when the sarcomere is relaxed. A muscle fiber from a biceps muscle may contain 100,000 sarcomere"}, {"url": "http://www.wisegeek.org/what-is-a-sarcomere.htm", "passage_text": "A sarcomere is the most basic functional unit of a muscle fiber, which makes up striated muscle. Muscle movement happens when the filaments slide across each other within the muscular bands. The sliding filament model is made possible by the interaction of the actin and myosin proteins within the filaments."}, {"url": "http://medical-dictionary.thefreedictionary.com/Z+line", "passage_text": "Z line. A cross-striation bisecting the I band of striated muscle myofibrils and serving as the anchoring point of actin filaments at either end of the sarcomere. Z line, a narrow, darkly staining cross-striation that bisects the I band of skeletal muscles. The distance between Z lines is the length of the sarcomere. Also called intermediate disk, Z band, Z disk."}]