[{"url": "http://www.healthline.com/health/malnutrition", "passage_text": "The most widespread nutritional deficiency worldwide is iron deficiency, which can result in anemia. Iron is found in foods such as red meat, dark, leafy greens, and egg yolks. It helps your body make red blood cells. When you’re iron-deficient, your body produces a reduced amount of red blood cells. "}, {"url": "https://en.wikipedia.org/wiki/Iron_deficiency_anemia", "passage_text": "Iron-deficiency anemia, also spelled iron-deficiency anaemia, is defined as a decrease in the amount of red blood cells (RBCs) or hemoglobin in the blood due to not enough iron. In women over 50 years old, the most common cause of iron-deficiency anemia is chronic gastrointestinal bleeding from nonparasitic causes, such as gastric ulcers, duodenal ulcers or gastrointestinal cancer. Iron deficiency causes approximately half of all anemia cases worldwide, and affects women more often than men."}, {"url": "https://answers.yahoo.com/question/index?qid=20070902134250AAGSKej", "passage_text": "Hemochromatosis is a disease of iron accumulation with resultant damage to the liver, pancreas, heart, and pituitary. Many hypos also seem anemic and it's possible that in hypothyroidism, anemia stems more often from iron deficiency than from copper deficiency. It is the most common type of anemia. A lack of iron in the body can also come from bleeding, not eating enough foods that contain iron, or not absorbing enough iron from food that is eaten."}, {"url": "http://www.stylecraze.com/articles/diseases-caused-by-nutritional-deficiency/", "passage_text": "Iron Deficiency Anaemia: Iron deficiency anaemia is a disease caused by the deficiency of iron in the body. It is characterized by a decrease in the red blood cell count or hemoglobin in the body, resulting in fatigue, weakness, dyspnoea and paleness of the body. "}, {"url": "http://www.mayoclinic.org/diseases-conditions/iron-deficiency-anemia/basics/causes/CON-20019327", "passage_text": "If you aren't consuming enough iron, or if you're losing too much iron, your body can't produce enough hemoglobin, and iron deficiency anemia will eventually develop. Causes of iron deficiency anemia include: 1  Blood loss. 2  Blood contains iron within red blood cells. 3  So if you lose blood, you lose some iron. 4  Women with heavy periods are at risk of iron deficiency anemia because they lose blood during menstruation"}, {"url": "http://www.medicinenet.com/iron_and_iron_deficiency/article.htm", "passage_text": "1 Iron deficiency is the most common nutritional deficiency and the leading cause of anemia in the United States. 2  Iron deficiency is due either to increased need for iron by the body or a decreased absorption or amount of iron taken in. "}, {"url": "http://www.nhs.uk/Conditions/Anaemia-iron-deficiency-/Pages/Causes.aspx", "passage_text": "Iron deficiency anaemia occurs when the body does not have enough iron, leading to the decreased production of red blood cells. Red blood cells carry oxygen around the body. A lack of iron can be caused by several factors. Some of the most common causes of iron deficiency anaemia are outlined below. Other conditions or actions that cause blood loss and may lead to iron deficiency anaemia include: 1  inflammatory bowel disease – a condition that causes inflammation (redness and swelling) in the digestive system, such as Crohn’s disease and ulcerative colitis."}, {"url": "https://answers.yahoo.com/question/index?qid=20070902134250AAGSKej", "passage_text": "Oxygenated blood gives your body energy and your skin a healthy color Iron-deficiency anemia is a common and easily treated condition that occurs when there is not enough iron in the body. It is the most common type of anemia. A lack of iron in the body can also come from bleeding, not eating enough foods that contain iron, or not absorbing enough iron from food that is eaten."}, {"url": "https://answers.yahoo.com/question/index?qid=20070902134250AAGSKej", "passage_text": "Vitamin C, in orange juice or tablet form, helps increase iron absorption. Iron almost always turns stools black, which is a harmless side effect. Prevention You can help prevent iron deficiency anemia by eating foods rich in iron, as part of a balanced diet. Eating plenty of iron-containing foods is particularly important for people who have higher iron requirements, such as children and menstruating or pregnant women. It is the most common type of anemia. A lack of iron in the body can also come from bleeding, not eating enough foods that contain iron, or not absorbing enough iron from food that is eaten."}, {"url": "http://www.medicinenet.com/iron_and_iron_deficiency/related-conditions/index.htm", "passage_text": "Iron and Iron Deficiency Related Diseases & Conditions. Medical conditions are often related to other diseases and conditions. Our doctors have compiled a list of ailments related to the topic of Iron and Iron Deficiency. These conditions may be a cause or symptom of Iron and Iron Deficiency or be a condition for which you may be at increased risk. Anemia Anemia is the condition of having less than the normal number of red blood cells or less than the normal quantity of hemoglobin...learn more ». "}]