[{"url": "http://www.turkeytravelplanner.com/details/Shopping/HowToBargain.html", "passage_text": "Bargaining or haggling is a tradition in Turkey as in many other countries. Shoppers in Europe and America bargain over price when they buy cars, houses and other expensive items."}, {"url": "http://www.buckettripper.com/what-to-buy-in-turkey-souvenir-shopping-in-istanbul/", "passage_text": "The Istanbul Spice Market. Shops selling cell phones sit next to shops selling hand-made carpets, the kind that were once used by nomadic tribes living in tents in the desert. Bright piles of pungent spices send competing aromas drifting toward a store selling gold jewelry, seemingly by the pound."}, {"url": "http://www.turkeytravelcentre.com/blog/best-souvenirs-to-buy-in-turkey/", "passage_text": "Best Souvenirs to Buy in Turkey. Everywhere you look in Turkey; there is one common object in homes, offices, cars, and businesses. Many Turks believe that the blue evil eye wards off evil thoughts and presence."}, {"url": "http://www.buckettripper.com/what-to-buy-in-turkey-souvenir-shopping-in-istanbul/", "passage_text": "Today’s market is the same and more: In addition to spices — many grown in Turkey, such as black and red pepper, wild thyme, cumin, and Anatolian saffron — you can also buy nuts, Turkish coffee, Turkish delight, and dried fruits."}, {"url": "http://wikitravel.org/en/Turkey", "passage_text": "For other places with the same name, see Turkey (disambiguation). Turkey (Turkish: Tuerkiye) türkiye is on The, mediterranean with97 % of its territory In West asia and The Middle, east and with a small section In Southeastern europe separated by The Turkish (Straits, Bosphorus sea Of, marmara And). dardanelles"}, {"url": "http://www.turkeytravelcentre.com/blog/best-souvenirs-to-buy-in-turkey/", "passage_text": "The good news is that Turkey has original souvenirs that will not only be a reminder of your travels, but they also look great in the home as decor décor or. utensils"}, {"url": "http://www.buckettripper.com/what-to-buy-in-turkey-souvenir-shopping-in-istanbul/", "passage_text": "Where to Shop in Istanbul. The city’s two best-known shopping areas are the Spice Market and the Grand Bazaar. Both are located between the Sultanhamet and the Golden Horn, where tourists line up for boat trips to the Bosphorus Strait and the Asian side."}, {"url": "http://www.quovadimus.org/turkey99/tobuy/thumb.html", "passage_text": "The most famous shopping place in Turkey is Istanbul's Covered Market (Kapali Carsi). You can find just about any craft, or anything, really, if you wander around the Covered Market long enough. To wander all the halls takes hours."}, {"url": "http://www.bigloveturkey.com/pages/16-top-ten-souvenirs-to-buy-in-Turkey.asp", "passage_text": "Turkish Delight. An original product of Turkey: Lokum, made since the 15th century, renamed as Turkish Delight is made of sugar and starch. Often flavored with rosewater or lemon, Haci panerai replica uk Bekir, a confectioner, developed the sweet when he obtained white sugar in the late 18th century."}]