[{"url": "https://www.cia.gov/library/publications/the-world-factbook/rankorder/2004rank.html", "passage_text": "COUNTRY COMPARISON :: GDP-PER CAPITA (PPP). GDP-per capita (PPP) compares GDP on a purchasing power parity basis divided by population as of 1 July for the same year."}, {"url": "http://www.indexmundi.com/g/r.aspx?v=67", "passage_text": "The inequitable distribution of income is present at the global level where the nominal gross domestic product (GDP) of the top ten economies ... its GDP (PPP) per capita of $40,445. The country is among the top exporters and importers in the world."}, {"url": "http://databank.worldbank.org/data/download/GNIPC.pdf", "passage_text": "Gross national income per capita 2014, Atlas method and PPP PurchasingAtlas power paritymethodology (internationalRanking Economy (US dollars) Ranking Economy dollars) 1 Monaco .. a 1 Qatar 139,7602 Liechtenstein .."}, {"url": "http://www.indexmundi.com/g/r.aspx?v=67", "passage_text": "World's 10 richest countries, India at a dismal 130! Photograph, courtesy: StellarD/Wikimedia commons Qatar Rank: 1 GDP (PPP) – 2013: $105,091.42 With the world's third largest natural gas reserves and oil reserves, Qatar is the world's richest country in terms of per capita income. A high income ..."}, {"url": "http://www.wisegeek.org/which-country-has-the-highest-income-per-capita-in-the-world.htm", "passage_text": "In nominal GDP, Luxembourg comes out with the highest income per capita at roughly $88,000 US Dollars (USD). The number two country, Norway, comes well behind, at around $72,300 USD. Following Norway is Qatar with roughly $62,900 USD."}, {"url": "http://www.wisegeek.org/which-country-has-the-highest-income-per-capita-in-the-world.htm", "passage_text": "Lastly, the IMF data, which looks only at members of the IMF, and Hong Kong, places Luxembourg first with a per capita income of $81,500 USD. Ireland comes in second with a GDP at PPP of $44,676 USD, just barely ahead of Norway at $44,648 USD."}, {"url": "http://siteresources.worldbank.org/DATASTATISTICS/Resources/GNIPC.pdf", "passage_text": "Gross national income per capita 2010, Atlas method and PPP PurchasingAtlas power paritymethodology (internationalRanking Economy (US dollars) Ranking Economy dollars) 1 Monaco 197,460 a 4 Luxembourg 63,8502 Liechtenstein 136,540 a 6 Macao SAR, China 57,120 a 3 Bermuda .."}, {"url": "http://www2.econ.iastate.edu/classes/econ355/choi/rankh.htm", "passage_text": "The following estimates of per capita income of the world was made by Angus Maddison (Emeritus Professor, University of Groningen, 1999) in his article Poor until 1820.. After the fall of the Roman Empire, the West entered a recession that lasted about a millennium."}]