[{"url": "http://japanesefightingfish.org/how-long-do-betta-fish-live/", "passage_text": "2 – 3 years is a common lifespan of a domesticated betta fish, however up to 6 years is very achievable and 10 can be done! You just need to make sure you can give your Japanese fighting fish the best environment possible."}, {"url": "http://www.alsa.org/about-als/facts-you-should-know.html", "passage_text": "1 Although the life expectancy of a person with ALS averages about two to five years from the time of diagnosis, this disease is variable, and many people can live with the disease for five years and more."}, {"url": "http://www.alsa.org/about-als/facts-you-should-know.html", "passage_text": "En espanol. 1  ESPAñOL als is not. 2  Contagious although the life expectancy of a person WITH als averages about two to five years from the time of, diagnosis this disease is, variable and many people can live with the disease for five years and. 3  More more than half of all people WITH als live more than three years after.  diagnosis"}, {"url": "http://www.answers.com/Q/How_old_do_normal_people_live", "passage_text": "150 Years 20 to 90 years, depending upon the species. There are 36 species of dolphins.Maximum lifespan for bottlenose dolphins is 40 to 45 years if it is male; and 50 to 55 years for females. Another source said they live about 20 years usually. Excellent question! dolphins can live up to 40 years or more! Fancy that! I think the highest racord was 60.   Dolphins can live to be about 50 in captivity and 30 in the wild."}, {"url": "http://www.answers.com/Q/How_long_do_people_with_schizophrenia_usually_live", "passage_text": "Answer by Maniesansdelire. Confidence votes 3.0K. People with schizophrenia live an average of 12-15 fewer years than the general population. In the US, that would be a life expectancy of 64 to 61 years in men and 69 to 66 years in women."}, {"url": "http://www.answers.com/Q/How_old_do_normal_people_live", "passage_text": "The average lifespan of a dolphin ranges from about 17 years to about 25 years, with no significant difference between dolphins in the wild and in captivity."}, {"url": "http://www.answers.com/Q/How_long_do_people_with_schizophrenia_usually_live", "passage_text": "If you are talking about a goldfish then the usual life span if it dies of old age of course, is about twenty to thirty years, occasionally forty. If you want to know about a Betta fish then it usually lives about ten to twenty years."}, {"url": "http://www.alsa.org/about-als/facts-you-should-know.html", "passage_text": "1 ALS is not contagious. 2  Although the life expectancy of a person with ALS averages about two to five years from the time of diagnosis, this disease is variable, and many people can live with the disease for five years and more."}]