[{"url": "https://answers.yahoo.com/question/index?qid=20070729131643AAw6iBz", "passage_text": "This test measures an enzyme in the blood. The enzyme is called creatine kinase (CK). Muscle cells make this enzyme. When muscle cells are injured or diseased, enzymes leak out of the cells and enter the bloodstream. You have a muscle disease. If your CK level is high, the test may be repeated (as often as every 8 hours) to see if the injury is healing or getting worse. Source(s): http://www.med.umich.edu/1libr/aha/aha_c..."}, {"url": "http://www.medicalhealthtests.com/askquestion/29/what-is-the-significance-of-a-slightly-elevated-cr.html", "passage_text": "Creatine kinase, more commonly known as CK, is an enzyme that is present in all muscle tissue of the body including the heart and the brain. The normal creatine kinase levels in a man are between 38 and 174 units/L; while a woman's creatine kinase levels range from between 96 to 140 units/L. The normal creatine kinase levels in a man are between 38 and 174 units/L while a woman's normal range extends from between 96 units/l to 140 units/L. There are also known differences between ethnicity as African Americans show a higher normal range of creatine kinase levels overall."}, {"url": "http://www.answers.com/Q/What_are_normal_levels_of_creatine_kinase", "passage_text": "A lab test is used to find the serum level of creatine kinase (CK)  in blood. The normal CK level for adult females is 40-150 units/L  and 60-400 units/L for adult men. 1 person found this useful. "}, {"url": "http://www.medicalhealthtests.com/articles/252/blood-tests/creatine-kinase-normal-range.html", "passage_text": "See also creatine kinase elevation. The creatine kinase normal range varies from males to females. For adult males, the normal values are between 38 and 174 units per liter of blood whereas for adult females, the normal level is between 90 and 140 units per liter of blood. An elevation beyond this point is likely to be diagnostically relevant. The creatine kinase test is a standard test that is conducted using a blood sample. For the patient, there is no difference from a normal blood test that might be conducted in a clinic. Blood is collected from a vein in the upper forearm and this blood is sent for analysis at a laboratory."}, {"url": "http://www.urmc.rochester.edu/encyclopedia/content.aspx?ContentTypeID=167&ContentID=creatine_kinase_blood", "passage_text": "This test measures the amount of an enzyme called creatine kinase (CK) in your blood. CK is a type of protein. The muscle cells in your body need CK to function. Levels of CK can rise after a heart attack, skeletal muscle injury, strenuous exercise, or drinking too much alcohol, and from taking certain medicines or supplements. If this test shows that your CK levels are high, you may have muscle or heart damage. CK is made up of three enzyme forms. These are CK-MB, CK-MM, and CK-BB. CK-MB is the substance that rises if your heart muscle is damaged. CK-MM rises with other muscle damage. CK-BB is found mostly in the brai"}, {"url": "https://en.wikipedia.org/wiki/Creatine_kinase", "passage_text": ") This test is not specific for the type of CK that is elevated. Creatine kinase in the blood may be high in health and disease. Exercise increases the outflow of creatine kinase to the blood stream for up to a week, and this is the most common cause of high CK in blood. Creatine kinase (CK) — also known as creatine phosphokinase (CPK) or phospho-creatine kinase — is an enzyme (EC 2.7.3.2) expressed by various tissues and cell types."}, {"url": "http://www.medicalhealthtests.com/articles/252/blood-tests/creatine-kinase-normal-range.html", "passage_text": "Tweet. Creatine kinase is a substance that is tested when some form of muscle damage is suspected. The creatine kinase test is a standard test that is conducted using a blood sample. For the patient, there is no difference from a normal blood test that might be conducted in a clinic. Blood is collected from a vein in the upper forearm and this blood is sent for analysis at a laboratory."}, {"url": "http://www.brighthub.com/science/medical/articles/91229.aspx", "passage_text": "An elevated CK level on a blood test usually needs further evaluation and testing. If a person is experiencing chest pain and CK-MB is high, it can be a sign of heart damage due to heart attack. This elevation is usually transient and returns to normal in a few days. Some normal people have creatine kinase levels that are consistently higher than normal. This is more common in African-Americans, bodybuilders, and people with large, bulky muscles. Elevated CK levels are also more common in certain families."}, {"url": "http://www.brighthub.com/science/medical/articles/75706.aspx", "passage_text": "Creatine Kinase. Creatine kinase formerly known as creatine phosphokinase is primarily found in muscle cells including the heart, striated muscles and the brain. The normal range of creatine kinase for men is 38 - 174 units/L and for women 96 - 140 units/L. Men typically have more muscle mass than women which accounts for the higher range values. African Americans have been found to have higher normal range for creatine kinase as well"}]