[{"url": "http://www.whenwasitinvented.org/when-was-the-first-laptop-invented/", "passage_text": "There is a dispute among historians taking up the creation and creator of Laptop. Some historians believe that in 1969 Bill Moggridge, a British invented the first Laptop for GRiD Systems Corp., and some believe that in 1981 Adam Osborne, founder of Osborne Computer, created it."}, {"url": "http://www.computerhope.com/issues/ch000984.htm", "passage_text": "The Z1 was created by German Konrad Zuse in his parents' living room between 1936 and 1938. It is considered to be the first electro-mechanical binary programmable computer, and the first really functional modern computer."}, {"url": "http://www.answers.com/Q/When_was_the_first_electric_computer_invented_and_by_whom", "passage_text": ". The first computer was invented by a British scientist Charles P.Babbage in 1822 but completed in 1871 by Helmet P.Babbage (the son of Charles P.Babbage). The Difference Engine: The first of these devices was conceived in 1786 by J. H. Mueller. It was never built."}, {"url": "http://news.everestonline.edu/post/2009/07/invented-first-computer/", "passage_text": "Who invented the first computer is not a question with a simple answer. There have been a lot of major milestones throughout history that warrant mentioning. The adventure starts in the year 1936. 1936- Konrad Zuse invented the Z1 Computer. This was the first computer that was freely programmable. 1942- John Atanasoff and Clifford Berry created the ABC Computer. 1944- John Presper Eckert and John W. Mauchly came up with the idea for the ENIAC 1 computer."}, {"url": "http://www.computerhope.com/issues/ch000984.htm", "passage_text": "The ENIAC was invented by J. Presper Eckert and John Mauchly at the University of Pennsylvania and began construction in 1943 and was not completed until 1946. It occupied about 1,800 square feet and used about 18,000 vacuum tubes, weighing almost 50 tons."}, {"url": "http://www.computerhope.com/issues/ch000984.htm", "passage_text": "There is no easy answer to this question due to the many different classifications of computers. The first mechanical computer, created by Charles Babbage in 1822, doesn't really resemble what most would consider a computer today."}, {"url": "http://science.howstuffworks.com/innovation/inventions/who-invented-the-computer.htm", "passage_text": "We could argue that the first computer was the abacus or its descendant, the slide rule, invented by William Oughtred in 1622. But the first computer resembling today's modern machines was the Analytical Engine, a device conceived and designed by British mathematician Charles Babbage between 1833 and 1871."}]