[{"url": "http://history1800s.about.com/od/bridgebuilding/p/menaistrbridge.htm", "passage_text": "When finished, the Menai Suspension Bridge, with its 580 foot center span, was the longest span in the world. Sailing ships with tall masts could sail under it, a remarkable feature for its day. The bridge was a highpoint of Thomas Telford's career, and proved the effectiveness of suspension bridges. The Menai Suspension Bridge is still in service, more than 180 years after its opening. And despite the improvements over the years, it retains the graceful form of Telford's original design."}, {"url": "http://menaibridges.co.uk/", "passage_text": "Menai Bridge. We are a community project to celebrate our two world famous bridges; the Menai Suspension Bridge, built by Thomas Telford, and the Britannia Bridge, built by Robert Stephenson. Our fully accredited museum has exhibits of artefacts and drawings, films, quizzes and qualified guides"}, {"url": "https://simple.wikipedia.org/wiki/Menai_Bridge", "passage_text": "Building of the bridge [change | change source]. Before the bridge was built, the only way people could get to Anglesey island was by a ferry from Holyhead. The water of the Menai Strait is very rough and dangerous, so it was hard for people to use their own boats or swim to the island. The people who lived on Anglesey sold cattle that they raised. In 1999, the bridge closed for one month. The road was fixed and the bridge was made stronger. When it was closed, people had to drive over the Britannia Bridge to get to the island. One part of the bridge was closed for six months starting on February 28, 2005."}, {"url": "http://www.anglesey-history.co.uk/places/bridges/", "passage_text": "The traffic on the bridge is monitored by a video camera that is now connected to the Internet. 16 March 2005 - A several month long project of repainting the Menai Bridge has begun, with the paint being completely stripped down to the bare metal for the first time in many decades and repainted. You can find the bridges with this map or an aerial image on Google Maps. If you plan to visit North Wales to see the Menai Strait bridges make sure you stop by to see the Menai Bridges Exhibition, run by the Menai Bridge Community Heritage Trust."}, {"url": "https://en.wikipedia.org/wiki/Menai_Bridge", "passage_text": "Menai Bridge (Welsh: Porthaethwy) is a small town and community on the Isle of Anglesey in north Wales. It overlooks the Menai Strait and lies by the Menai Suspension Bridge, built in 1826 by Thomas Telford. It is the fifth largest settlement on the island, with a population of 3,376, and occupies the area of the former parish of Llandysilio, whose former church continues in use as a mortuary chapel (see below). It is likely that a community has existed at the location of Menai Bridge since Roman times simply because this is the shortest crossing of the Menai Strait. On 12 November 1918 Air Marshal Sir Thomas Elmhirst flew airship SSZ73 under the Menai Bridge following the armistice at the end of World War I."}, {"url": "https://en.wikipedia.org/wiki/Menai_Suspension_Bridge", "passage_text": "The deck of the Menai Bridge was strengthened in 1840 by W. A. Provis and, in 1893, the entire wooden surface was replaced with a steel deck designed by Sir Benjamin Baker. In 1999 the bridge was closed for around a month to resurface the road and strengthen the structure, requiring all traffic to cross via the nearby Britannia Bridge. On 28 February 2005 the bridge was promoted to UNESCO as a candidate World Heritage Site."}, {"url": "https://en.wikipedia.org/wiki/Menai_Bridge", "passage_text": "The Menai Heritage Centre celebrates the two world famous bridges, the Menai Suspension Bridge-built by Thomas Telford and the Britannia Bridge-built by Robert Stephenson. It is likely that a community has existed at the location of Menai Bridge since Roman times simply because this is the shortest crossing of the Menai Strait. On 12 November 1918 Air Marshal Sir Thomas Elmhirst flew airship SSZ73 under the Menai Bridge following the armistice at the end of World War I."}, {"url": "https://en.wikipedia.org/wiki/Menai_Suspension_Bridge", "passage_text": "Before the bridge was completed in 1826, the island had no fixed connection to the mainland and all movements to and from Anglesey were by ferry across the fast flowing and dangerous waters of the Menai Strait. In 1999 the bridge was closed for around a month to resurface the road and strengthen the structure, requiring all traffic to cross via the nearby Britannia Bridge. On 28 February 2005 the bridge was promoted to UNESCO as a candidate World Heritage Site."}]