[{"url": "https://en.wikipedia.org/wiki/The_Windmills_of_Your_Mind", "passage_text": ". The Windmills of Your Mind  is a song with music by French composer Michel Legrand and English lyrics written by Americans Alan Bergman and Marilyn Bergman. The French lyrics, under the title  Les moulins de mon coeur , cœur were written By Eddy. marnay Dusty Springfield 's version of the song from her album Dusty in Memphis is well known; this version reached no. 31 on the US Billboard Hot 100 chart and no. 3 on the Billboard Easy Listening chart in 1969."}, {"url": "http://www.bbc.co.uk/news/entertainment-arts-24621444", "passage_text": "Singer Noel Harrison has died at his home in Devon, aged 79. The son of the actor Rex Harrison, he was best known for recording the hit song The Windmills Of Your Mind on The Thomas Crown Affair soundtrack. It won best song at the 1968 Oscars and was later covered by artists including Dusty Springfield."}, {"url": "https://en.wikipedia.org/wiki/The_Thomas_Crown_Affair_%281968_film%29", "passage_text": "The film won the Academy Award for Best Original Song for  Windmills of Your Mind  by Michel Legrand (music), Marilyn Bergman and Alan Bergman (lyrics). It was also nominated for Original Music Score. The Thomas Crown Affair (1968 film). From Wikipedia, the free encyclopedia. The Thomas Crown Affair is a 1968 film directed and produced by Norman Jewison starring Steve McQueen and Faye Dunaway. It was nominated for two Academy Awards, winning Best Original Song for Michel Legrand 's  Windmills of Your Mind ."}, {"url": "http://www.telegraph.co.uk/culture/music/music-news/10395944/Noel-Harrison-singer-of-The-Windmills-Of-Your-Mind-dies.html", "passage_text": "Comments. Singer Noel Harrison, known to millions for The Windmills Of Your Mind, has died at the age of 79 from a heart attack. Harrison, who was born in London on January 29,1934, was best known for recording the hit song on The Thomas Crown Affair soundtrack. He was the son of the late actor Rex Harrison."}, {"url": "http://www.nytimes.com/2013/10/24/arts/noel-harrison-79-dies-sang-the-windmills-of-your-mind.html", "passage_text": "He recorded “The Windmills of Your Mind,” composed by Michel Legrand with lyrics by Alan and Marilyn Bergman, in 1968. Heard on the soundtrack of the film “The Thomas Crown Affair,” it won the 1968 Oscar for best original song. Continue reading the main story. Noel Harrison, the actor and folk troubadour best known for his role on the NBC spy drama “The Girl From U.N.C.L.E.” and his rendition of the Academy Award-winning song “ The Windmills of Your Mind ,” died on Oct. 20 in Exeter, England. He was 79"}, {"url": "http://variety.com/2013/film/news/noel-harrison-dead-singer-and-actor-was-79-1200751746/", "passage_text": "Associated Press. British actor and musician Noel Harrison, who sang the Oscar-winning ballad “The Windmills of Your Mind,” has died at 79. Harrison’s wife, Lori Chapman, said Tuesday that he suffered a heart attack after a performance on Saturday in Devon, southwest England, and died in a hospital"}, {"url": "https://uk.answers.yahoo.com/question/index?qid=20060801141057AA5PaW9", "passage_text": "Source(s): A little research on Windmills of your Mind, as I knew it was in the Thomas Crown Affair by Grady Faith & I knew Petula Clark had recorded it, as I did know about Percy Faith's recording.The remainder just research. REBELCAT · 9 years ago. Thumbs up. It was Noel Harrison, the son of Rex Harrison. He did the version on The Thomas Crown Affair, which Michel Legrand wrote and arranged the music for. Dusty Springfield's recording of it came out the same year and helped make the movie an even bigger success."}, {"url": "https://en.wikipedia.org/wiki/The_Windmills_of_Your_Mind", "passage_text": "In the original 1968 film, the song was performed by Noel Harrison who took the song to no. 8 in the UK Singles Chart. It won the Academy Award for Best Original Song in 1968. In 2004 that version finished at no. 57 in AFI's 100 Years...100 Songs survey of top tunes in American cinema. Dusty Springfield 's version of the song from her album Dusty in Memphis is well known; this version reached no. 31 on the US Billboard Hot 100 chart and no. 3 on the Billboard Easy Listening chart in 1969."}]