[{"url": "https://en.wikipedia.org/wiki/Dopamine", "passage_text": "L-DOPA, the metabolic precursor of dopamine, does reach the brain and is the most widely used treatment for Parkinson's disease. Dopaminergic stimulants can be addictive in high doses, but some are used at lower doses to treat ADHD. Dopamine itself is used as precursor in the synthesis of the neurotransmitter norepinephrine and the hormone epinephrine. Dopamine is converted into norepinephrine by the enzyme dopamine β-hydroxylase (DBH), with O 2 and L-ascorbic acid as cofactors."}, {"url": "http://ghr.nlm.nih.gov/gene/DRD4", "passage_text": "From NCBI Gene : This gene encodes the D4 subtype of the dopamine receptor. The D4 subtype is a G-protein coupled receptor which inhibits adenylyl cyclase. It is a target for drugs which treat schizophrenia and Parkinson disease. Mutations in this gene have been associated with various behavioral phenotypes, including autonomic nervous system dysfunction, attention deficit/hyperactivity disorder, and the personality trait of novelty seeking."}, {"url": "https://en.wikipedia.org/wiki/Dopamine", "passage_text": "Most types of reward increase the level of dopamine in the brain, and a variety of addictive drugs increase dopamine neuronal activity. Other brain dopamine systems are involved in motor control and in controlling the release of various hormones. Dopamine itself is used as precursor in the synthesis of the neurotransmitter norepinephrine and the hormone epinephrine. Dopamine is converted into norepinephrine by the enzyme dopamine β-hydroxylase (DBH), with O 2 and L-ascorbic acid as cofactors."}, {"url": "https://www.psychologytoday.com/basics/dopamine", "passage_text": "Dopamine is a neurotransmitter that helps control the brain 's reward and pleasure centers. Dopamine also helps regulate movement and emotional responses, and it enables us not only to see rewards, but to take action to move toward them. Dopamine deficiency results in Parkinson's Disease, and people with low dopamine activity may be more prone to addiction. The presence of a certain kind of dopamine receptor is also associated with sensation-seeking people, more commonly known as risk takers.."}, {"url": "https://www.psychologytoday.com/blog/the-hidden-mind/201212/what-does-dopamine-actually-do", "passage_text": "An increase in the firing of these neurons is a sign that more dopamine is being released in the brain. Schultz switched on a light, and then delivered a tasty drop of juice to the animal. Initially, the dopamine cells responded to the juice, consistent with the “reward” theory. A key finding is that dopamine is not the “reward” chemical, at least not in the way that the media would have us believe. In the 1990s, a now-classic experiment was carried out by Wolfram Schultz and colleagues. He recorded from brain cells that produce dopamine and deliver it to other brain areas."}, {"url": "http://ghr.nlm.nih.gov/gene/DRD4", "passage_text": "Dopamine receptor responsible for neuronal signaling in the mesolimbic system of the brain, an area of the brain that regulates emotion and complex behavior. Its activity is mediated by G proteins which inhibit adenylyl cyclase. It is a target for drugs which treat schizophrenia and Parkinson disease. Mutations in this gene have been associated with various behavioral phenotypes, including autonomic nervous system dysfunction, attention deficit/hyperactivity disorder, and the personality trait of novelty seeking."}, {"url": "http://ghr.nlm.nih.gov/gene/SLC6A3", "passage_text": "The SLC6A3 gene provides instructions for making a protein called the dopamine transporter or DAT. This protein is embedded in the membrane of certain nerve cells (neurons) in the brain, where it transports a molecule called dopamine into the cell. "}, {"url": "https://en.wikipedia.org/wiki/Dopamine", "passage_text": "Dopamine does not cross the blood–brain barrier, so its synthesis and functions in peripheral areas are to a large degree independent of its synthesis and functions in the brain. A substantial amount of dopamine circulates in the bloodstream, but its functions there are not entirely clear. Dopamine itself is used as precursor in the synthesis of the neurotransmitter norepinephrine and the hormone epinephrine. Dopamine is converted into norepinephrine by the enzyme dopamine β-hydroxylase (DBH), with O 2 and L-ascorbic acid as cofactors."}, {"url": "http://nihseniorhealth.gov/parkinsonsdisease/whatcausesparkinsonsdisease/01.html", "passage_text": "A Shortage of Dopamine. Parkinson's disease occurs when nerve cells, or neurons, in an area of the brain that controls movement become impaired and/or die. Normally, these neurons produce an important brain chemical known as dopamine, but when the neurons die or become impaired, they produce less dopamine. Dopamine is a chemical messenger, or neurotransmitter. Dopamine is responsible for transmitting signals between the substantia nigra and multiple brain regions. The connection between the substantia nigra and the corpus striatum is critical to produce smooth, purposeful movement."}, {"url": "https://en.wikipedia.org/wiki/Dopamine", "passage_text": "In the brain, dopamine functions as a neurotransmitter —a chemical released by nerve cells to send signals to other nerve cells. The brain includes several distinct dopamine systems, one of which plays a major role in reward-motivated behavior. Dopamine itself is used as precursor in the synthesis of the neurotransmitter norepinephrine and the hormone epinephrine. Dopamine is converted into norepinephrine by the enzyme dopamine β-hydroxylase (DBH), with O 2 and L-ascorbic acid as cofactors."}]