[{"url": "http://www.fda.gov/Food/ResourcesForYou/Consumers/ucm079311.htm", "passage_text": "While more than 160 foods can cause allergic reactions in people with food allergies, the law identifies the eight most common allergenic foods. These foods account for 90 percent of food allergic reactions, and are the food sources from which many other ingredients are derived. Following ingestion of a food allergen(s), a person with food allergies can experience a severe, life-threatening allergic reaction called anaphylaxis. This can lead to: 1  constricted airways in the lungs. 2  severe lowering of blood pressure and shock ( anaphylactic shock ."}, {"url": "https://www.foodallergy.org/allergens", "passage_text": "Allergens. Although nearly any food is capable of causing an allergic reaction, only eight foods account for 90 percent of all food-allergic reactions in the United States. These foods are: 1  Peanut. 2  Tree nuts. 3  Milk. 4  Egg. 5  Wheat. 6  Soy. 7  Fish. 8  Shellfish."}, {"url": "http://acaai.org/allergies/types/food-allergies", "passage_text": "More than 50 million Americans have an allergy of some kind. Food allergies are estimated to affect 4 to 6 percent of children and 4 percent of adults, according to the Centers for Disease Control and Prevention. Food allergy symptoms are most common in babies and children, but they can appear at any age. Learn more about the types of food allergies. Symptoms. Not everyone who experiences symptoms after eating certain foods has a food allergy or needs to avoid that food entirely; for instance, some people experience an itchy mouth and throat after eating a raw or uncooked fruit or vegetable."}, {"url": "http://www.healthline.com/health/allergies/common-food-allergies", "passage_text": "A food allergy may affect the skin, the gastrointestinal tract, or the respiratory or cardiovascular systems. Many types of foods can be allergens, but certain foods are much more likely than others to trigger an allergic reaction. According to FARE, eight foods are responsible for 90 percent of food allergies. Severe symptoms of an allergic reaction to food are: 1  difficulty breathing, including wheezing. 2  swelling of the lips, tongue or throat. 3  hives (an itchy, blotchy and raised rash). 4  dizziness or faintness. 5  nausea or vomiting."}, {"url": "http://www.mayoclinic.org/diseases-conditions/food-allergy/in-depth/food-allergies/ART-20045949", "passage_text": "Food labels list food allergens to help you avoid an allergic reaction. Here are the top eight food allergens listed. In the United States, the Food and Drug Administration (FDA) requires food manufacturers to list the eight most common ingredients that trigger food allergies. Most other countries have similar rules"}, {"url": "https://en.wikipedia.org/wiki/Food_allergy", "passage_text": "A food allergy is an abnormal immune response to food. The signs and symptoms may range from mild to severe. They may include itchiness, swelling of the tongue, vomiting, diarrhea, hives, trouble breathing, or low blood pressure. This typically occurs within minutes to several hours of exposure. The most common food allergens include peanuts, milk, eggs, tree nuts, fish, shellfish, soy, and wheat — these foods account for about 90% of all allergic reactions. The most common food allergies in adults are shellfish, peanuts, tree nuts, fish, and egg."}, {"url": "http://www.webmd.com/allergies/guide/food-allergy-intolerances", "passage_text": "The ability of a given individual to form IgE against something as benign as food is an inherited predisposition. Generally, such people come from families in which allergies are common -- not necessarily food allergies but perhaps hay fever, asthma, or hives. Someone with two allergic parents is more likely to develop food allergies than someone with one allergic parent. "}, {"url": "http://www.fda.gov/Food/IngredientsPackagingLabeling/FoodAllergens/default.htm", "passage_text": "Each year, millions of Americans have allergic reactions to food. Although most food allergies cause relatively mild and minor symptoms, some food allergies can cause severe reactions, and may even be life-threatening. There is no cure for food allergies. Strict avoidance of food allergens—and early recognition and management of allergic reactions to food—are important measures to prevent serious health consequences."}]