[{"url": "http://www.answers.com/Q/How_much_should_brakes_cost_on_a_Honda_odyssey", "passage_text": "Making the world better, one answer at a time. The replacement of brakes, on a Honda Odyssey, should cost approximately $75 per wheel at a Honda dealership. The actual costs varies from mechanic to mechanic. I just had a full brake job done (front and rear pads, plus new front rotors) for my 2004 Honda Pilot, the total for parts and labor was around $600. Labor rate was $85/ … hr so if you find a cheaper shop it may run you a little less (figure 3 hours of labor). 7 people found this useful."}, {"url": "http://www.answers.com/Q/How_much_should_brakes_cost_on_a_Honda_odyssey", "passage_text": "The cost to replace the alternator in a Honda Odyssey will depend  on where it is purchased and installed. The average cost of an  alternator is between $100 and $150. I just had a full brake job done (front and rear pads, plus new front rotors) for my 2004 Honda Pilot, the total for parts and labor was around $600. Labor rate was $85/ … hr so if you find a cheaper shop it may run you a little less (figure 3 hours of labor). 7 people found this useful."}, {"url": "http://www.autowyse.com/honda_odyssey_service/cost_to_replace_odyssey_brakes.html", "passage_text": "Cost to Replace Honda Odyssey Brakes-Notes. Cost estimates are based on industry average productivity levels for the repair and local labor rates charged by experienced automotive professionals. These estimates show a range of fair prices for your vehicle and geographic area. These resources deliver honest real world ownership perspectives and useful facts for anyone researching the cost to replace the brakes on the Honda Odyssey. [ 1 1] Brake System Disk Brakes An accurate, up-to-date overview of automotive brake systems and common disk brake problems and maintenance issues."}, {"url": "http://www.answers.com/Q/How_much_should_brakes_cost_on_a_Honda_odyssey", "passage_text": "If you mean front brakes as in just PADS, the cost of material should be no more than $30. And 2 struts around $70-$90 for the materials. If you were to do it your self you wo … uld save a lot.   With labor, you would be looking at perhaps $80 to $125 per hour. I just had a full brake job done (front and rear pads, plus new front rotors) for my 2004 Honda Pilot, the total for parts and labor was around $600. Labor rate was $85/ … hr so if you find a cheaper shop it may run you a little less (figure 3 hours of labor). 7 people found this useful."}, {"url": "http://www.autoaccessoriesgarage.com/Brakes/_Honda-Odyssey", "passage_text": "Home Brakes Honda Odyssey Brakes. When your van is carrying precious cargo (i.e., your family) it's important that you're able to stop on a dime. Auto Accessories Garage has a wide variety of Honda Odyssey brakes and pads that will greatly enhance your van's handling. For instance, our ceramic Odyssey brake pads give your brakes more bite while also reducing noise. Plus, all of our Odyssey brake systems will ship to you for free. Because of that, the price you see online is the same price you see at checkout. More Popular Odyssey Accessories: Honda Odyssey Exhaust, Honda Odyssey Car Covers, Honda Odyssey Deflectors, Honda Odyssey Headers & Honda Odyssey Catalytic Converters."}, {"url": "http://www.odyclub.com/forums/14-periodic-maintenance/15345-front-brakes-how-much.html", "passage_text": "Front Brakes. Just had front brakes done on my '99 Honda in the whooping amount of $302.00. Discusted but not knowing what to do I said yes to the price. Little did I know that Sts tires could have done them for $140.00. I blame my husband for dealing only with dealers. I was at the local Honda dealership today for an oil change and tranny drain & fill. I asked about cost of front brakes and was told $160 plus tax, etc., includes pads and turning rotors on the wheel."}, {"url": "http://www.answers.com/Q/How_much_do_front_brakes_cost_for_a_2002_Honda_odyssey", "passage_text": "If you mean front brakes as in just PADS, the cost of material should be no more than $30. And 2 struts around $70-$90 for the materials. If you were to do it your self you wo … uld save a lot.   With labor, you would be looking at perhaps $80 to $125 per hour. The cost to replace the alternator in a Honda Odyssey will depend  on where it is purchased and installed. The average cost of an  alternator is between $100 and $150."}, {"url": "http://www.autowyse.com/honda_odyssey_service/cost_to_replace_odyssey_brakes.html", "passage_text": "Labor-Replace The Honda Odyssey Brakes. Remove and dispose of existing brake pads and wear sensor. Install new wear sensor(s). Resurface rotors. Replace worn or damaged clips. Install, adjust and bed new pads. These resources deliver honest real world ownership perspectives and useful facts for anyone researching the cost to replace the brakes on the Honda Odyssey. [ 1 1] Brake System Disk Brakes An accurate, up-to-date overview of automotive brake systems and common disk brake problems and maintenance issues."}]