[{"url": "http://www.rxlist.com/lemon_balm-page2/supplements.htm", "passage_text": "Lemon balm contains chemicals that seem to have a sedative, calming effect. It might also reduce the growth of some viruses. Lemon balm seems to be safe for most adults. It can cause some side effects including nausea, vomiting, abdominal pain, dizziness, and wheezing. Some information suggests that lemon balm might be safe when taken by children under age 12 for up to one month."}, {"url": "http://www.emedicinehealth.com/lemon_balm-page2/vitamins-supplements.htm", "passage_text": "Lemon balm contains chemicals that seem to have a sedative, calming effect. It might also reduce the growth of some viruses. Lemon balm seems to be safe for most adults. It can cause some side effects including nausea, vomiting, abdominal pain, dizziness, and wheezing. Some information suggests that lemon balm might be safe when taken by children under age 12 for up to one month."}, {"url": "http://www.webmd.com/vitamins-supplements/ingredientmono-437-LEMON%20BALM.aspx?activeIngredientId=437&activeIngredientName=LEMON%20BALM", "passage_text": "Some information suggests that lemon balm might be safe when taken in appropriate amounts by infants for up to a week and by older children under age 12 for up to one month. When taken by mouth, lemon balm can cause some side effects including nausea, vomiting, abdominal pain, dizziness, and wheezing. Lemon balm is inhaled as aromatherapy for Alzheimer's disease. Some people apply lemon balm to their skin to treat cold sores (herpes labialis). In foods and beverages, the extract and oil of lemon balm are used for flavoring."}, {"url": "http://www.motherearthnews.com/natural-health/lemon-balm-mosquito-repellent-zmaz07aszsto.aspx", "passage_text": "Lemon balm, the International Herb Association’s 2007 Herb of the Year, is an ancient antidote to modern-day stress. This versatile herb can be used to calm nerves, promote restful sleep, and reduce digestive distress — plus it could be your new best friend in the great outdoors. For a soothing lemon balm bath, put some fresh (or dried) crushed lemon balm leaves into a muslin bag, then let the warm water run through it as you fill the tub. Lemon balm also adds a light lemon flavor to a variety of culinary dishes, such as salads, pasta, fish, chicken, sauces and marinades."}, {"url": "http://www.webmd.com/vitamins-supplements/ingredientmono-437-LEMON%20BALM.aspx?activeIngredientId=437&activeIngredientName=LEMON%20BALM", "passage_text": "Lemon balm is used for digestive problems, including upset stomach, bloating, intestinal gas (flatulence), vomiting, and colic; for pain, including menstrual cramps, headache and toothache; and for mental disorders, including hysteria and melancholia. Lemon balm is inhaled as aromatherapy for Alzheimer's disease. Some people apply lemon balm to their skin to treat cold sores (herpes labialis). In foods and beverages, the extract and oil of lemon balm are used for flavoring."}, {"url": "http://www.webmd.com/vitamins-supplements/ingredientmono-437-LEMON%20BALM.aspx?activeIngredientId=437&activeIngredientName=LEMON%20BALM", "passage_text": "Lemon balm is LIKELY SAFE when used in food amounts. It’s POSSIBLY SAFE in adults when used in medicinal amounts short-term. It’s been used safely in research for up to four months. Not enough is known about the safety of lemon balm when used long-term. Lemon balm is inhaled as aromatherapy for Alzheimer's disease. Some people apply lemon balm to their skin to treat cold sores (herpes labialis). In foods and beverages, the extract and oil of lemon balm are used for flavoring."}, {"url": "http://kitchenherbwife.blogspot.com/2014/02/what-to-do-with-lemon-balm.html", "passage_text": "After such a list of positive attributes, you must also be aware that lemon balm does inhibit the thyroid and most herbalists will advise anyone who suffers with an under-active thyroid not to use this herb. It can be used in the management of hyperthyroidism where the thyroid is over-active. "}, {"url": "http://homespunseasonalliving.com/10-ways-use-lemon-balm/", "passage_text": "1. Smoothies. Lemon balm does indeed have a lemony flavor. It’s not intense or tart like lemons but the light flavor is great in a number of different culinary dishes. Toss a handful of the leaves in with your smoothies to impart that light lemon flavor. "}, {"url": "http://www.webmd.com/vitamins-supplements/ingredientmono-437-LEMON%20BALM.aspx?activeIngredientId=437&activeIngredientName=LEMON%20BALM", "passage_text": "Lemon balm is a perennial herb from the mint family. The leaves, which have a mild lemon aroma, are used to make medicine. Lemon balm is used alone or as part of various multi-herb combination products. Lemon balm is inhaled as aromatherapy for Alzheimer's disease. Some people apply lemon balm to their skin to treat cold sores (herpes labialis). In foods and beverages, the extract and oil of lemon balm are used for flavoring."}]