[{"url": "https://en.wikipedia.org/wiki/Christine_(name)", "passage_text": "It is a name in regular usage in French, English, German, Scandinavian, Dutch and Slavic cultures, and it is often associated with the meaning follower of Christ.. Other ways to say Christine are Christina, Kristina, Kristine, Kristen, Kirsten, Hristina, Cristina (most used in Spain and Latin American countries), etc. "}, {"url": "http://www.sheknows.com/baby-names/name/cristina", "passage_text": "Italian Meaning: The name Cristina is an Italian baby name. In Italian the meaning of the name Cristina is: Follower of Christ. Spanish Meaning: The name Cristina is a Spanish baby name. In Spanish the meaning of the name Cristina is: Follower of Christ. SoulUrge Number: 1. Expression Number: 3. People with this name have a deep inner desire to use their abilities in leadership, and to have personal independence. The name Cristina is a Swedish baby name. In Swedish the meaning of the name Cristina is: Christian. American Meaning: The name Cristina is an American baby name."}, {"url": "http://www.meaning-of-names.com/spanish-names/cristina.asp", "passage_text": "Meaning of Cristina. Spanish name. In Spanish, the name Cristina means-follower of christ. Other origins for the name Cristina include-Spanish, Italian.The name Cristina is most often used as a girl name or female name. Spanish Name Meaning-follower of christ. Origin-Spain"}, {"url": "http://www.babynamewizard.com/baby-name/girl/christina", "passage_text": "Meanings and history of the name Christina : | Edit. Meaning: Follower of Christ. Christina is a female name originating from Christian.Saint Christina (3rd or 5th century AD), a saint and martyr pre-dating the Catholic and Orthodox congregational tradition. Usage: English, German, Scandinavian, Dutch."}, {"url": "http://www.babynamewizard.com/baby-name/girl/christina", "passage_text": "Origin of the name Christina: Derived from the Ecclesiastic Late Latin christiānus which is from the Ecclesiastic Greek christianos (a Christian, a follower of Christ). Var: Christiene, Christine, Cristina, Khristina, Khristine, Kristina, Kristene. Short: Chris, Cris, Khris, Kris, Tina. Meaning: Follower of Christ. Christina is a female name originating from Christian.Saint Christina (3rd or 5th century AD), a saint and martyr pre-dating the Catholic and Orthodox congregational tradition. Usage: English, German, Scandinavian, Dutch."}, {"url": "http://www.thinkbabynames.com/meaning/0/Cristina", "passage_text": "Cristina /cri-sti-na/ [3 sylls.] as a girls' name is pronounced kree-STEE-nah. It is of Latin origin, and the meaning of Cristina is follower of Christ. Italian, Spanish, Portuguese and Romanian form of Christina. Kreatif forms: Caistina, Crestina, Cristita. Cristina is a very prominent first name for females (#437 out of 4276, Top 10%) and also a very prominent last name for all people (#41722 out of 150436, Top 28%). (2000 U.S. Census). Charted below is the birth name popularity of Cristina for girls."}, {"url": "http://www.ohbabynames.com/meaning/name/cristina/893", "passage_text": "Etymology & Historical Origin-Cristina. Cristina (without the “h”) is the Italian, Spanish and Portuguese form of Christina derived from the Latin Christianus meaning “a Christian”. All of the “Christian” names are ultimately derived from the Greek name Christos from “chrio” meaning “to anoint”. "}]