[{"url": "http://www.ancestry.ca/name-origin?surname=sandberg", "passage_text": "You can find out where the majority of the Sandberg families were living before they immigrated to the U.S and learn where to focus your search for foreign records. Immigration records can tell you an ancestor's name, ship name, port of departure, port of arrival, and destination. from the Canadian Passenger Lists. You can find out when most of the Sandberg families immigrated to Canada. You can focus your search to immigration records dating from that era. Immigration records can tell you an ancestor's name, ship name, port of departure, port of arrival and destination. from 1881 CA Census Data."}, {"url": "https://www.houseofnames.com/sandberg-family-crest", "passage_text": "Sandberg Early Origins. First found in Hamburg, where the name contributed greatly to the development of an emerging nation which would later play a large role in the tribal and national conflicts of the area. The Sandberg Family Crest was acquired from the Houseofnames.com archives. The Sandberg Family Crest was drawn according to heraldic standards based on published blazons. We generally include the oldest published family crest once associated with each surname."}, {"url": "http://www.hebrewsurnames.com/SANDBERG", "passage_text": "This is an open forum to discuss the origin, the meaning and the family stories of the surname SANDBERG. Both your knowledge and the oral tradition of the origin and meaning of this surname will be helpfull. Using the Daitch-Mokotoff Soundex Code we can obtain some variants of scripture of the same surname. Below you will find the variants of scripture we have in our database. They will be useful to find and to determine the SANDBERG meaning."}, {"url": "http://www.hebrewsurnames.com/SANDBERG", "passage_text": "SANDBERG Genealogy. The vast majority of Argentine Jews are descended from immigrants who arrived from Europe. These ashkenazic Jews migrated from small towns or shtetels of Poland, Lithuania, Russia, Germany, Romania or Ukraine, leaving behind most of their Jewish relatives. Using the Daitch-Mokotoff Soundex Code we can obtain some variants of scripture of the same surname. Below you will find the variants of scripture we have in our database. They will be useful to find and to determine the SANDBERG meaning."}, {"url": "https://en.wikipedia.org/wiki/Ryne_Sandberg", "passage_text": "His career .989 fielding percentage is a major-league record at second base. Sandberg was elected to the National Baseball Hall of Fame in January 2005; he was formally inducted in ceremonies on July 31, 2005. He resigned from his managerial duties for the Phillies on June 26, 2015. In 1990, Sandberg led the National League in home runs–a rarity for a second baseman–with 40. Sandberg was only the third second baseman to hit 40 home runs; Rogers Hornsby and Davey Johnson hit 42, and no American League second baseman has yet reached forty."}, {"url": "http://www.thecubdom.com/playerpages/rynesandberg.html", "passage_text": "In the tenth inning, Sandberg faced Sutter again with the Cubs down 11-9. Sandberg hit his second home run of the afternoon, this time with Bobby Dernier on base to tie the game again at 11. In the eleventh inning, the Cubs pushed across a run and the Cubs won 12-11. However, in 1983, the Cubs acquired Ron Cey and moved Ryne Sandberg to second base. He started in 157 games, committing 13 errors, and winning the Rawlings Gold Glove award at second base. Sandberg was the first Cub to win a Gold Glove since Don Kessinger in 1970."}, {"url": "http://www.ancestry.com/name-origin?surname=sandberg", "passage_text": "Click on a place to view Sandberg immigration records. The information for this chart came from the U.S. Immigration Collection at Ancestry. You can find out where the majority of the Sandberg families were living before they immigrated to the U.S and learn where to focus your search for foreign records. Immigration records can tell you an ancestor's name, ship name, port of departure, port of arrival, and destination. Click on a circle in the chart to view Sandberg immigration records. You can find out when most of the Sandberg families immigrated to the United States. You can focus your search to immigration records dating from that era. Immigration records can tell you an ancestor's name, ship name, port of departure, port of arrival"}, {"url": "https://en.wikipedia.org/wiki/Ryne_Sandberg", "passage_text": "Ryne Dee Sandberg (born September 18, 1959), nicknamed Ryno , is an American professional baseball player, coach, and manager. He played in Major League Baseball as a second baseman for the Philadelphia Phillies and Chicago Cubs for sixteen years (1981–1994 and 1996–97). In 1990, Sandberg led the National League in home runs–a rarity for a second baseman–with 40. Sandberg was only the third second baseman to hit 40 home runs; Rogers Hornsby and Davey Johnson hit 42, and no American League second baseman has yet reached forty."}]