[{"url": "http://myfamilyfinances.net/2012/07/how-does-the-average-family-budget-compare-to-yours/", "passage_text": "Eating Out Eats a Lot of the Food Budget. Eating away from home makes up about 40% of the average family’s food budget and totals $2,505 annually. Meanwhile, the average grocery bill is only $302 per month. At $3,157, it’s actually far down the list of categories at 6 th on the list by total cost spent. The average American family is paying roughly $263 per month on healthcare. Meanwhile, the insurance category is further up the list at 4 th and is most comprised of your social security payments."}, {"url": "http://www.valuepenguin.com/average-household-budget", "passage_text": "The average cost of utilities per month is about $320. About 71% of us also report expenses for household operations, spending $1,581 on average (or $132 per month) for services that might include babysitting or eldercare, housecleaning or lawn mowing, laundry and dry cleaning, pest control, and home security systems. For the average household, transportation costs are almost as much as what’s spent on rent or the direct costs of home ownership: an average of $9,004 annually. Nearly 90% of U.S. households report spending money on gasoline, an average of nearly $3,000 per year. The average cost of gas per month is $250"}, {"url": "http://myfamilyfinances.net/2012/07/how-does-the-average-family-budget-compare-to-yours/", "passage_text": "Beating the average family budget can actually be a challenge. The average family spends only $1,379.75 on housing per month. That includes mortgage/rent, utilities, cleaning and maintenance. The average grocery bill is only $302. Gas is only $226.25 per month. That’s not to say that there isn’t lots of room for improvement, but I suspect that many of you will find at least some of the average budget categories difficult to beat. I know personally, that my family spends far more on gasoline. At $3,157, it’s actually far down the list of categories at 6 th on the list by total cost spent. The average American family is paying roughly $263 per month on healthcare. Meanwhile, the insurance category is further up the list at 4 th and is most comprised of your social security payments."}, {"url": "http://budgeting.thenest.com/average-cost-running-home-24415.html", "passage_text": "Although costs vary, an average budget should be used for running a home. Before you establish a new home, it’s a good idea to understand what it may cost. According to the 2012 Statistical Abstract from the United States Census Bureau, the average cost of running a household in 2009 was $1,408 per month. That's what you pay before you eat, drive or wear clothes. For example, the average water consumption for a family of four at 100 gallons per day can cost as low as $34 per month in Phoenix and as high a $65 per month in Boston. Likewise, energy costs can fluctuate based on consumption habits, location and size of a home"}, {"url": "http://www.valuepenguin.com/average-household-budget", "passage_text": "Average Food Costs in the U.S. The typical U.S. household spends 10% of its income on food. The average cost of food per month is $550 (that’s $6,602 each year). Approximately 60% of our food budgets are spent on food eaten at home, and the rest on food consumed when we’re out and about. For the average household, transportation costs are almost as much as what’s spent on rent or the direct costs of home ownership: an average of $9,004 annually. Nearly 90% of U.S. households report spending money on gasoline, an average of nearly $3,000 per year. The average cost of gas per month is $250"}, {"url": "http://www.epi.org/publication/ib368-basic-family-budgets/", "passage_text": "1 For a two-parent, two-child household, housing ranges from 10.7 percent to 26.1 percent of a family’s budget. 2  Housing for this family type is most expensive in Nantucket, Mass.,($1,877 per month), and is least expensive in both Macon and Smith counties, Tenn. ( 3 $570 per month). The following is a sample of findings from the 2013 update of EPI’s Family Budget Calculator 1  : The basic family budget for a two-parent, two-child family ranges from $48,166 (Marshall County, Miss.) to $94,676 (New York City)."}, {"url": "http://www.homefair.com/articles/mortgage/housing-affordability.asp", "passage_text": "The average annual expenditure in the Northeast for utilities, household operations, and furnishings in 1988 was about $265 per month. The average total cost of shelter in 1988 in the Northeast was about $648 per month. Your non-mortgage housing expense will depend on your lifestyle and the energy efficiency of your home. If your home is energy efficient, you may be able to afford a higher mortgage because your monthly utility costs will be lower. Using the first rule of thumb, a household should be spending about $562 to $717 per month on shelter, utilities, and other housing-related expenses. If this same average household wanted to buy a house, according to the second rule of thumb, they should be looking in the $67,500 price range."}, {"url": "http://www.homefair.com/articles/mortgage/housing-affordability.asp", "passage_text": "Let's take a look at an average household with an average income. Early in 1988, the average gross income for U.S.. households was about $27,000; the average net income was about $24,580, based on the U.S. Department of Labor's Consumer Expenditure Survey. Using the first rule of thumb, a household should be spending about $562 to $717 per month on shelter, utilities, and other housing-related expenses. If this same average household wanted to buy a house, according to the second rule of thumb, they should be looking in the $67,500 price range."}]