[{"url": "https://en.wikipedia.org/wiki/Environmental_anthropology", "passage_text": "Environmental anthropology is a sub-specialty within the field of anthropology that takes an active role in examining the relationships between humans and their environment across space and time. Applied anthropology utilizes these understandings to work with people on a local basis as well as trying to satisfy share holders working to gain a resolution for problems related to health, education, social welfare, development and environmental protection."}, {"url": "http://www.merriam-webster.com/dictionary/anthropology", "passage_text": "Full Definition of ANTHROPOLOGY. 1. : the science of human beings; especially: the study of human beings and their ancestors through time and space and in relation to physical character, environmental and social relations, and culture. : the science of humans; especially: the study of humans in relation to distribution, origin, classification, and relationship of races, physical character, environmental and social relations, and culture. — an·thro·po·log·i·cal \\-pə-ˈlaej-ˈläj-i\\ kəl. adjective"}, {"url": "https://en.wikipedia.org/wiki/Ecological_anthropology", "passage_text": "From Wikipedia, the free encyclopedia. Ecological anthropology is a sub-field of anthropology and is defined as the “study of cultural adaptations to environments”. The sub-field is also defined as, the study of relationships between a population of humans and their biophysical environment . The first ecological anthropologists explored the idea that humans as ecological populations should be the unit of analysis, and culture became the means by which that population alters and adapts to the environment."}, {"url": "https://en.wikipedia.org/wiki/Anthropology", "passage_text": "Ecological anthropology is defined as the study of cultural adaptations to environments. The sub-field is also defined as, the study of relationships between a population of humans and their biophysical environment . The abstract noun anthropology is first attested in reference to history. Its present use first appeared in Renaissance Germany in the works of Magnus Hundt and Otto Casmann. Their New Latin anthropologia derived from the combining forms of the Greek words anthrōpos (ánthrōpos,  ἄνθρωπος ) human and (logos,  lógos ). λόγος study"}, {"url": "https://en.wikipedia.org/wiki/Ecological_anthropology", "passage_text": "In the 1960s, ecological anthropology first appeared as a response to cultural ecology, a sub-field of anthropology led by Julian Steward. Steward focused on studying different modes of subsistence as methods of energy transfer and then analyzed how they determine other aspects of culture. The first ecological anthropologists explored the idea that humans as ecological populations should be the unit of analysis, and culture became the means by which that population alters and adapts to the environment."}, {"url": "http://www.merriam-webster.com/dictionary/anthropology", "passage_text": ": the science of humans; especially: the study of humans in relation to distribution, origin, classification, and relationship of races, physical character, environmental and social relations, and culture. — an·thro·po·log·i·cal \\-pə-ˈlaej-ˈläj-i\\ kəl. — adjective·an·thro·po·log·i·cal \\-ly-i(k-)ə\\ lē. adverb : the science of humans; especially: the study of humans in relation to distribution, origin, classification, and relationship of races, physical character, environmental and social relations, and culture. — an·thro·po·log·i·cal \\-pə-ˈlaej-ˈläj-i\\ kəl. adjective"}, {"url": "http://www.merriam-webster.com/dictionary/anthropology", "passage_text": "Medical Definition of ANTHROPOLOGY. : the science of humans; especially: the study of humans in relation to distribution, origin, classification, and relationship of races, physical character, environmental and social relations, and culture. — an·thro·po·log·i·cal \\-pə-ˈlaej-ˈläj-i\\ kəl. adjective"}, {"url": "http://scholarcommons.usf.edu/jea/", "passage_text": "Welcome to the Journal of Ecological Anthropology. The Journal of Ecological Anthropology (JEA), ISSN 1528-6509, is a double-blind peer-reviewed interdisciplinary forum for innovative exploration of the interface between humans and their sociocultural and biophysical environments. "}, {"url": "http://www.sociologyguide.com/anthropology/ecological-anthropology.php", "passage_text": "Ecological Anthropology. Ecological anthropology attempts to understand the relative influence of environment on human societies and how it is used by different societies. "}]