[{"url": "https://www.humana.com/medicare-support/information/medicare-history", "passage_text": "The federal Medicare program has changed the lives of millions of Americans. But the roots of Medicare go back to our nation's early efforts to achieve health coverage for its elderly and poor citizens. It's hard to believe, but the gradual evolution of the plans Humana offers today began more than a hundred years ago. Humana is a Medicare Advantage organization and a stand-alone prescription drug plan with a Medicare contract. Enrollment in this Humana plan depends on contract renewal."}, {"url": "https://www.medicare.gov/supplement-other-insurance/medigap/whats-medigap.html", "passage_text": "1 If you have a Medicare Advantage Plan, you can apply for a Medigap policy, but make sure you can leave the Medicare Advantage Plan before your Medigap policy begins. 2  You pay the private insurance company a monthly premium for your Medigap policy in addition to the monthly Part B premium that you pay to Medicare. Then your Medigap policy pays its share. A Medigap policy is different from a Medicare Advantage Plan. Those plans are ways to get Medicare benefits, while a Medigap policy only supplements your Original Medicare benefits."}, {"url": "http://www.ssa.gov/history/corning.html", "passage_text": "In 1969, Peter A. Corning, a journalist and Ph.D. candidate at New York University, completed a contract with SSA's Office of Research and Statistics for a history of developments in health insurance leading up to the passage of Medicare in 1965. "}, {"url": "http://www.nejm.org/doi/full/10.1056/NEJMhpr1411701", "passage_text": "Article. Many Americans have never known a world without Medicare. For 50 years, it has been a reliable guarantor of the health and welfare of older and disabled Americans by paying their medical bills, ensuring their access to needed health care services, and protecting them from potentially crushing health expenses. Origins of Medicare. Medicare was born out of frustration, desperate need, and political opportunity. The intellectual and political architects of the program did not set out to create a health care system for the elderly (defined here as persons 65 years of age or older)."}, {"url": "http://www.gomedicare.com/medicare-information/medicare-history.html", "passage_text": "When the Medicare and Medicaid law was passed, the Medicare Part B premium was set at $3 a month. By the early 1970s, the legislation had evolved to include disabled citizens and those with end-stage renal disease (regardless of age) in the list of people eligible for Medicare coverage. A decade later, the Medicare program included hospice benefits, but only on a temporary basis. Changes were also made to the Medicare legislation to cover federal employees, including the U. S. President and members of Congress."}, {"url": "https://www.medicare.gov/supplement-other-insurance/medigap/whats-medigap.html", "passage_text": "If you have Original Medicare and you buy a Medigap policy, Medicare will pay its share of the Medicare-approved amount for covered health care costs. Then your Medigap policy pays its share. A Medigap policy is different from a Medicare Advantage Plan. Those plans are ways to get Medicare benefits, while a Medigap policy only supplements your Original Medicare benefits."}, {"url": "https://en.wikipedia.org/wiki/Medicare_(United_States)", "passage_text": "In the United States, Medicare is a national social insurance program, administered by the U.S. federal government since 1966, currently using about 30 private insurance companies across the United States. Medicare provides health insurance for Americans aged 65 and older who have worked and paid into the system. "}, {"url": "http://www.gomedicare.com/medicare-information/medicare-history.html", "passage_text": "The Medicare program was instituted with the passing of the Social Security Act of 1965, and it has been providing health care insurance to citizens over the age of 65 - and other Americans in special circumstances-ever since. President Lyndon B. Johnson signed the Social Security amendment on July 30, 1965. ZIP Code. A decade later, the Medicare program included hospice benefits, but only on a temporary basis. Changes were also made to the Medicare legislation to cover federal employees, including the U. S. President and members of Congress."}, {"url": "http://jop.ascopubs.org/content/3/6/296.full", "passage_text": "Coverage with evidence development is a tool used by the Centers for Medicare & Medicaid Services (CMS) in an attempt to bring a new rationale to payment decisions and, ultimately, cost savings to the Medicare program. "}]