[{"url": "https://www.askthe.police.uk/Content/Q584.htm", "passage_text": "You can't suggest that you want to do a Speed Awareness Course, if you are eligible to attend the course you will be notified by the police. The criteria operated by each Police Force in relation to attending SACs differs slightly. The following are the guidelines operated by one police force: "}, {"url": "http://www.honestjohn.co.uk/forum/post/index.htm?t=75675", "passage_text": "I got 3 points back in 2000, that's it for me. nothing until this year. did a speed awareness course for being flashed 4 months ago, I am having a bad year as within 24 hours recently I got two letters for being flashed (honestly not a fast driver) from different authorities. One was for driving through s london too fast at 7:00 AM sunday morning. "}, {"url": "http://www.safetycamera.org/faqs/speed-awareness-course", "passage_text": "The speed awareness course is an educational presentation that lasts approximately four hours. The workshop takes place in a classroom based scenario with up to 23 other motorists. The speed awareness course does not involve any type of test. You have been offered the opportunity to attend a speed awareness course because you were recorded driving above the legal speed limit. Although we do have the power to prosecute those who break the speed limit, we would rather persuade drivers to slow down."}, {"url": "http://www.speedawarenesscourse.co.uk/speed-awareness-course-faq/", "passage_text": "The Speed Awareness Course is an alternative to prosecution for motorists who have been detected speeding. The course is used as an alternative to the £60 fine and 3 penalty points, and is designed as an educational alternative. More information can be found on our Speed Awareness Course page. "}, {"url": "http://www.uknetguide.co.uk/motoring/article/speed_awareness_courses-100266.html", "passage_text": "Two weeks later I had a letter offering speed awareness course or 3 point penalty, I asked a solocitor and they said that I should take the course and that I was lucky to be caught at 94 as anything above that would have been a definite court summons. A national register will be kept of those taking the courses and motorists will be allowed to take only one every three years. Home Office figures this week showed that 1.9 million motorists received penalty points for camera offences in 2003."}, {"url": "http://www.pistonheads.com/gassing/topic.asp?t=1254825", "passage_text": "Drivers are only able to attend a speed awareness course once every three years. If you are recorded speeding again you will only be eligible to attend a further course if more than three years has elapsed since the date of your previous course. "}, {"url": "http://www.safetycamera.org/faqs/speed-awareness-course", "passage_text": "High speed offences and drivers who have already completed a Speed Awareness Course or What Driving Us course in the last 3 years, will not be eligible to take another course of the same kind. A driver cannot request to attend a Driver Behavour Course. The speed awareness course does not involve any type of test. You have been offered the opportunity to attend a speed awareness course because you were recorded driving above the legal speed limit. Although we do have the power to prosecute those who break the speed limit, we would rather persuade drivers to slow down."}, {"url": "http://www.uknetguide.co.uk/motoring/article/speed_awareness_courses-100266.html", "passage_text": "I was doing 37mph in a 30mph zone and have been driving for 14 months so under the 2 years. Would just like to no how reliable the information is on this site I.e that you can be doing 10% + 9mph and if it's under that you will 100% be offered the speed awareness course?.... A national register will be kept of those taking the courses and motorists will be allowed to take only one every three years. Home Office figures this week showed that 1.9 million motorists received penalty points for camera offences in 2003."}, {"url": "http://www.ukspeeding.co.uk/SpeedAwarenessCourse.html", "passage_text": "The length of the course can vary between 2 hours and 6 hours, although 4-6 hours is the norm. You will need to take your driving licence with you and you will be expected to take part constructively in discussions with the other participants. "}]