[{"url": "http://www.prenhall.com/divisions/bp/app/russellcd/PROTECT/CHAPTERS/CHAP12/HEAD05.HTM", "passage_text": "Determining the Reorder Point with Excel. Excel can be used to determine the reorder point for variable demand. Exhibit 12.6 shows the Excel screen for Example 12.6. Notice that the reorder point is computed using the formula in cell E7, which is shown on the formula bar at the top of the screen. Reorder Point with Variable Demand. To compute the reorder point with a safety stock that will meet a specific service level, we will assume the demand during each day of lead time is uncertain, independent, and can be described by a normal distribution."}, {"url": "http://help.sap.com/saphelp_erp60_sp/helpdata/en/f4/7d257044af11d182b40000e829fbfe/content.htm", "passage_text": "Process Flow. The continuous monitoring of available warehouse stock within reorder point planning is carried out in Inventory Management. Every time a material is withdrawn from the warehouse, the system checks whether this withdrawal has caused stock levels to fall below the reorder level. "}, {"url": "http://www.wisegeek.com/what-is-a-reorder-point.htm", "passage_text": "What is a Reorder Point? A reorder point is the level at which a specific item found within an inventory should be replenished by way of placing an order with a supplier. Watch the Did-You-Know slideshow. Follow @wiseGEEK. "}, {"url": "http://www.businessdictionary.com/definition/reorder-point.html", "passage_text": "Definition. Inventory level of an item which signals the need for placement of a replenishment order, taking into account the consumption of the item during order lead time and the quantity required for the safety stock. Nearby Terms. 1  rental pool. 2  rental property. 3  rental value in... 4  renter's insura... 5  rent-to-own. 6  reopening claus... 7  reorder cost. 8  reorder level. 9  reorder point. 10  reorder quantit... 11  reorganization. 12  repair. 13  repair part. 14  repairability. 15  repairable item. 16  repairs and mai... 17  reparation."}, {"url": "http://accountingexplained.com/managerial/inventory-management/reorder-level", "passage_text": "Reorder Level. Reorder level (or reorder point) is the inventory level at which a company would place a new order or start a new manufacturing run. Lead time is the time it takes the supplier or the manufacturing process to provide the ordered units. Daily average usage is the number of units used each day. If a business is holding a safety stock to act as buffer if daily usage accelerates the reorder level would increase by the level of safety stock."}, {"url": "https://www.fishbowlinventory.com/reorder-point-calculator/", "passage_text": "Enter your information below to calculate your reorder point! 1  Lead Time: The number of days between issuing a purchase order and receiving the product(s). 2  Safety Stock: The number of days’ worth of inventory you keep in case of emergency. 3  Basic Stock: The number of days’ worth of inventory you normally keep on hand. The Reorder Point is calculated using this equation: Reorder Point = (Lead Time + Safety Stock + Basic Stock) * Unit Sales Per Day. The Reorder Point Calculator is a small part of the advanced inventory management features you will find in Fishbowl Manufacturing and Fishbowl Warehouse."}, {"url": "http://www.businessdictionary.com/definition/order-point.html", "passage_text": "Definition. Number of units of an item on hand when a purchase order for its replenishment is to be issued. This number equals the lead-time quantity plus the safety (minimum) number of units. Also called order level. Nearby Terms. 1  order notify. 2  order of discha... 3  order of liquid... 4  order of magnit... 5  order of perman... 6  order paper. 7  order parameter. 8  order picking. 9  order point. 10  order point sys... 11  order policy. 12  order processin... 13  order processin... 14  order taker. 15  order ticket. 16  order time. 17  ordering cost."}, {"url": "http://www.prenhall.com/divisions/bp/app/russellcd/PROTECT/CHAPTERS/CHAP12/HEAD05.HTM", "passage_text": "The reorder point for our basic EOQ model with constant demand and a constant lead time to receive an order is equal to the amount demanded during the lead time, The I-75 Discount Carpet Store in Example 12.2 is open 311 days per year. Reorder Point with Variable Demand. To compute the reorder point with a safety stock that will meet a specific service level, we will assume the demand during each day of lead time is uncertain, independent, and can be described by a normal distribution."}]