[{"url": "http://www.aafp.org/afp/2004/0101/p120.html", "passage_text": "Tinnitus is a common disorder with many possible causes. Most cases of tinnitus are subjective, but occasionally the tinnitus can be heard by an examiner. Otologic problems, especially hearing loss, are the most common causes of subjective tinnitus. Common causes of conductive hearing loss include external ear infection, cerumen impaction, and middle ear effusion. Patients with vascular abnormalities complain of pulsatile tinnitus. Arterial bruits may be transmitted to the ear from arterial vessels near the temporal bone. The petrous carotid system is the most common source. 2 Patients experience worsening of symptoms at night and usually do not have other otologic complaints."}, {"url": "https://en.wikipedia.org/wiki/Considered_harmful", "passage_text": "According to linguist Mark Liberman, considered harmful was a journalistic cliche, cliché used in, headlines well before The dijkstra. Article he cites the headline over a letter Published august, 12 1949 In The New York : Times Rent Control / Controversy Enacting now Of Hasty Legislation Considered. harmful The original title of the letter, as submitted to CACM, was A Case Against the Goto Statement, but CACM editor Niklaus Wirth changed the title to Go To Statement Considered Harmful. Regarding this new title, Donald Knuth quipped that  Dr. Goto cheerfully complained that he was always being eliminated.."}, {"url": "http://www.sfgate.com/bayarea/article/Noise-on-BART-How-bad-is-it-and-is-it-harmful-3175757.php", "passage_text": "On stretches of the BART system, which once boasted that its trains were smooth, virtually noiseless and vibration-free, riders cover their ears and have to shout to be heard over the screeching, roaring and banging din. But even if BART's noise isn't a hearing hazard, it can be annoying. People can be irritated by 70 decibels or 80 decibels, Howarth said. BART monitors decibel levels inside trains to protect train operators, who are exposed to high noise levels four to five hours a day, Johnson said."}, {"url": "http://www.nhlbi.nih.gov/health/health-topics/topics/catd/", "passage_text": "Carotid artery disease is serious because it can cause a stroke, also called a “brain attack.” A stroke occurs if blood flow to your brain is cut off. If blood flow is cut off for more than a few minutes, the cells in your brain start to die. This impairs the parts of the body that the brain cells control. Atherosclerosis can affect any artery in the body. For example, if plaque builds up in the coronary (heart) arteries, a heart attack can occur. If plaque builds up in the carotid arteries, a stroke can occur. A stroke also can occur if blood clots form in the carotid arteries."}, {"url": "https://en.wikipedia.org/wiki/Considered_harmful", "passage_text": "Considered harmful is a phrase used in the titles of at least 65 critical essays in computer science and related disciplines. The original title of the letter, as submitted to CACM, was A Case Against the Goto Statement, but CACM editor Niklaus Wirth changed the title to Go To Statement Considered Harmful. Regarding this new title, Donald Knuth quipped that  Dr. Goto cheerfully complained that he was always being eliminated.."}, {"url": "https://www.cedars-sinai.edu/Patients/Programs-and-Services/Heart-Institute/Patient-Resources/FAQ/Questions-about-Aortic-Disease.aspx", "passage_text": "These tests are generally used to evaluate the heart and the aorta. The echocardiogram is used to evaluate the heart valves and the thickness of the heart wall. Either CT scans or MRIs may be used to provide an accurate view of the aorta and a precise measurement of the aneurysm size. I am worried about the effect that a stress test may have on my aorta. Generally an exercise stress test is not recommended for patients with aortic dissection or aortic aneurysm because of the potential of inducing hypertension, which can be harmful to"}, {"url": "http://www.aafp.org/afp/2004/0101/p120.html", "passage_text": "Otologic disorders are the most common cause of subjective tinnitus. 2, 9 Most cases of tinnitus result from the same conditions that cause hearing loss. There are two types of hearing loss: conductive and sensorineural. Conductive hearing loss is caused by the inhibition of sound transmission to the inner ear. Patients with vascular abnormalities complain of pulsatile tinnitus. Arterial bruits may be transmitted to the ear from arterial vessels near the temporal bone. The petrous carotid system is the most common source. 2 Patients experience worsening of symptoms at night and usually do not have other otologic complaints."}, {"url": "http://www.nhlbi.nih.gov/health/health-topics/topics/catd/", "passage_text": "Carotid (ka-ROT-id) artery disease is a disease in which a waxy substance called plaque (plak) builds up inside the carotid arteries. You have two common carotid arteries, one on each side of your neck. They each divide into internal and external carotid arteries. Atherosclerosis can affect any artery in the body. For example, if plaque builds up in the coronary (heart) arteries, a heart attack can occur. If plaque builds up in the carotid arteries, a stroke can occur. A stroke also can occur if blood clots form in"}, {"url": "https://en.wikipedia.org/wiki/Considered_harmful", "passage_text": "It was popularized by Edsger Dijkstra 's letter Go To Statement Considered Harmful, published in the March 1968 Communications of the ACM (CACM), in which he criticized the excessive use of the GOTO statement in programming languages of the day and advocated structured programming instead. The original title of the letter, as submitted to CACM, was A Case Against the Goto Statement, but CACM editor Niklaus Wirth changed the title to Go To Statement Considered Harmful. Regarding this new title, Donald Knuth quipped that  Dr. Goto cheerfully complained that he was always being eliminated.."}, {"url": "http://www.nhlbi.nih.gov/health/health-topics/topics/catd/", "passage_text": "This can block blood flow in the artery and cause a stroke. Carotid artery disease may not cause signs or symptoms until the carotid arteries are severely narrowed or blocked. For some people, a stroke is the first sign of the disease. Atherosclerosis can affect any artery in the body. For example, if plaque builds up in the coronary (heart) arteries, a heart attack can occur. If plaque builds up in the carotid arteries, a stroke can occur. A stroke also can occur if blood clots form in the carotid arteries."}]