[{"url": "http://giraffefacts.org/where-do-giraffes-live.html", "passage_text": "Giraffes live on only one continent-Africa. These animals are found between Chad in Central Africa and South Africa. Giraffes live in savannas, grasslands, and open woodland. The tall giraffe uses their own elongated neck and tongue to get to the top of African trees. Africa gives the ideal balance of heat, vegetation, and rain to keep the giraffe content for about 25 years."}, {"url": "http://www.livescience.com/27336-giraffes.html", "passage_text": "Tallest animal. Giraffes are the tallest living animals in the world, according to the Smithsonian National Zoological Park. A giraffe's neck alone is 6 feet (1.8 meters) long and weighs about 600 lbs. (272 kilograms). The animal's legs are also 6 feet long. In full, females grow up to 14 feet (4.3 m) tall and weigh up to 1,500 lbs. (680 kg), while males grow up to 18 feet (5.5 m) tall and weigh up to 3,000 lbs."}, {"url": "http://giraffefacts.org/where-do-giraffes-live.html", "passage_text": "Giraffes live in sub-Saharan Africa, south of the Sahara Desert, from Niger all the way to Zimbabwe and Botswana. The largest concentration is in central eastern Africa. Many wild giraffes populate Kenya and Tanzania. Giraffes live in savannas, grasslands, and open woodland. The tall giraffe uses their own elongated neck and tongue to get to the top of African trees. Africa gives the ideal balance of heat, vegetation, and rain to keep the giraffe content for about 25 years."}, {"url": "https://uk.answers.yahoo.com/question/index?qid=20080309051444AATWjms", "passage_text": "Giraffes tend to live in hot exotic places for example, some parts of Africa. http://www.wikipedia.org.uk/giraffes There is only one continent in the world where giraffes live. It is Africa. Giraffes choose to live on the flat, grassy areas with some trees and bushes. In Africa these areas are called savannas. We can also call them grasslands or woodlands."}, {"url": "http://www.kidsplanet.org/factsheets/giraffe.html", "passage_text": "HABITAT: Giraffes live in the savannas of Africa, where they roam freely among the tall trees, arid land, dense forests and open plains. FOOD: Their long necks help giraffes eat leaves from tall trees, typically acacia trees. If they need to, giraffes can go for several days without water. "}, {"url": "http://wanttoknowit.com/where-do-giraffes-live/", "passage_text": "Giraffes live in only one continent-Africa. They are found between the countries of Chad (which is in Central Africa) and South Africa. They live in savannas, grassland or open woodland. They enjoy roaming through both dense forests and open plains. They prefer living in areas with lots of acacia trees (which is their favorite food). So now you know where giraffes live! Facts about giraffes. 1  The average weight of a fully grown adult giraffe is 2,630lb (1,190kg). 2  Both male and female giraffes have horns-although males have larger horns than females."}, {"url": "http://www.answers.com/Q/Why_do_Giraffes_live_in_Africa", "passage_text": "Giraffes live in Africa because that's where they evolved and that's the environment that they prefer. Giraffes are found all over Africa. In the north region of this  continent, they live in Chad. Their habitats extend from the north  down to parts of South Africa."}, {"url": "http://www.awf.org/wildlife-conservation/west-african-giraffe", "passage_text": "The West African giraffe is a subspecies of giraffe, distinguished from other types by its light, tan-colored spots. Other giraffes have darker markings. It stands between 16 and 19 ft. tall, and can weigh up to 2,800 lbs. Before World War I, West African Giraffes lived throughout the Sahel and Savanna regions of West Africa. However, due to extreme population decrease, they now inhabit only a small part of Niger."}, {"url": "https://en.wikipedia.org/wiki/Giraffe", "passage_text": "The giraffe's scattered range extends from Chad in the north to South Africa in the south, and from Niger in the west to Somalia in the east. Giraffes usually inhabit savannas, grasslands, and open woodlands. Their primary food source is acacia leaves, which they browse at heights most other herbivores cannot reach. "}, {"url": "http://www.animalfactguide.com/animal-facts/giraffe/", "passage_text": "Characterized by its long legs, long neck, and distinctive spotted pattern, many people first believed the giraffe was a cross between a leopard and a camel, which is reflected in its scientific name, . Giraffes live primarily in savanna areas in the sub-Saharan region of Africa. Their extreme height allows them to eat leaves and shoots located much higher than other animals can reach. In particular, they seek out acacia trees. Their long tongues are helpful in eating because they help pull leaves from the trees. "}]