[{"url": "http://www.homedit.com/what-is-the-difference-between-a-porch-balcony-verandapatio-and-deck/", "passage_text": "The balcony. View in gallery. A balcony is a platform on the outside of a building, enclosed by walls or balustrades, supported by columns or console brackets. The platform is projecting from the wall of a building, usually above the ground floor. Balconies are typically small and are not used as social spaces or for entertainment purposes."}, {"url": "http://www.homedit.com/what-is-the-difference-between-a-porch-balcony-verandapatio-and-deck/", "passage_text": "Whether it’s spring, summer, autumn or winter, it’s also great to enjoy the outdoor, even if it’s only from your balcony, porch, veranda, patio or deck. And speaking of that, what’s the difference between all these spaces. They are certainly similar to a certain extent and we often use them interchangeably."}, {"url": "http://www.homedit.com/difference-between-a-terrace-and-a-balcony-in-modern-times/", "passage_text": "“Balcony” is also a term that comes from Latin. “Balcone” defined a large window. These days, a balcony is an elevated platform which extends from the walls of a building. It can be attached to any of the room of a house and it can also connect two or more spaces."}, {"url": "http://ci.santa-rosa.ca.us/doclib/Documents/STANDARDS%20FOR%20BARBEQUES%20ON%20BALCONIES.pdf", "passage_text": "It is acceptable to operate such a barbeque on a balcony if the balcony, deck, overhang, and adjacent walls are of non-combustible construction, or if the balcony is protected overhead by an automatic fire sprinkler system. It is okay to store a charcoal barbeque unit on a combustible balcony."}, {"url": "http://www.answers.com/Q/Condo_common_area_private_use_balcony_who_pays_for_balcony_damage", "passage_text": "Read your governing documents to determine whether or not the private-use balcony is considered 'limited common area'. If it is, the association is responsible for its upkeep."}, {"url": "http://www.royalcaribbean.com/findacruise/cabinclass/cabinTypes/home.do?cabincls=B", "passage_text": "Imagine opening your balcony door to see a new and breathtaking part of the world each morning. A stateroom with a balcony is a great way to make your cruise adventure even more memorable and truly take in your destination. Note: All stateroom images are representative samples."}]