[{"url": "http://e.hormone.tulane.edu/learning/androgens.html", "passage_text": "Androgens are a group of chemically related sex steroid hormones. Steroids are a special kind of fat molecule with a four-ringed, carbon atom backbone or core, like their cholesterol predecessor. CAPTION: A series of chemical changes turns cholesterol into androgen hormones. The weaker androgens androstenedione and dehydroepiandrosterone (DHEA) occur in small amounts in all vertebrates. Although 11-ketotestosterone is a weak androgen in four-legged vertebrates, it is the most potent variety in bony fishes and sharks."}, {"url": "http://e.hormone.tulane.edu/learning/androgens.html", "passage_text": "Like all steroid hormones, androgens produce effects by docking with receptors on the cell's membrane surface or inside the cell in the liquid cytoplasm. Receptor binding triggers different chemical signaling systems depending on receptor location. The weaker androgens androstenedione and dehydroepiandrosterone (DHEA) occur in small amounts in all vertebrates. Although 11-ketotestosterone is a weak androgen in four-legged vertebrates, it is the most potent variety in bony fishes and sharks."}, {"url": "https://en.wikipedia.org/wiki/Androgen", "passage_text": "Males typically have more skeletal muscle mass than females. Androgens promote the enlargement of skeletal muscle cells and probably act in a coordinated manner to function by acting on several cell types in skeletal muscle tissue. One cell type conveys hormone signals to generating muscle, the myoblast. This includes the activity of the accessory male sex organs and development of male secondary sex characteristics. Androgens were first discovered in 1936. Androgens are also the original anabolic steroids and the precursor of all estrogens. The primary and most well-known androgen is testosterone. Dihydrotestosterone (DHT) and androstenedione are less known generally, but are of equal importance in male developmen"}, {"url": "http://ghr.nlm.nih.gov/gene/AR", "passage_text": "The AR gene provides instructions for making a protein called an androgen receptor. Androgens are hormones (such as testosterone) that are important for normal male sexual development before birth and during puberty. Androgen receptors allow the body to respond appropriately to these hormones. The receptors are present in many of the body's tissues, where they attach (bind) to androgens. The resulting androgen-receptor complex then binds to DNA and regulates the activity of androgen-responsive genes."}, {"url": "http://www.healthywomen.org/condition/androgen", "passage_text": "Mistakenly thought of as only a male sex hormone, androgens are also natural to the female body, where they are produced in the ovaries, adrenal glands and other tissues. Testosterone is the androgen you've probably already heard about. The only time a sudden drop-off in androgen levels occurs is in women who have their ovaries removed (about half of all androgens are produced in a woman's adrenal glands and half in her ovaries). By the time a woman reaches menopause, blood androgen levels are about half of what they were at their peak."}, {"url": "http://www.healthywomen.org/condition/androgen", "passage_text": "About 10 percent of women with high levels of a form of testosterone called free testosterone have. , characterized by irregular or absent menstrual periods, , blood sugar disorders (prediabetes and type 2 diabetes), and, in some cases, symptoms like acne and excess hair growth. The only time a sudden drop-off in androgen levels occurs is in women who have their ovaries removed (about half of all androgens are produced in a woman's adrenal glands and half in her ovaries). By the time a woman reaches menopause, blood androgen levels are about half of what they were at their peak."}, {"url": "https://en.wikipedia.org/wiki/Androgen", "passage_text": "The androgens function as paracrine hormones required by the Sertoli cells to support sperm production. They are also required for masculinization of the developing male fetus (including penis and scrotum formation). This includes the activity of the accessory male sex organs and development of male secondary sex characteristics. Androgens were first discovered in 1936. Androgens are also the original anabolic steroids and the precursor of all estrogens. The primary and most well-known androgen is testosterone. Dihydrotestosterone (DHT) and androstenedione are less known generally, but are of equal importance in male development"}, {"url": "http://e.hormone.tulane.edu/learning/androgens.html", "passage_text": "Say the word androgen and most people think male. Indeed, they are dubbed the male hormones mainly because males make and use more testosterone and other androgens than females. These steroid hormones confer masculinity by triggering and controlling body programs that govern male sexual development and physique. In females, androgens play more subtle roles. The weaker androgens androstenedione and dehydroepiandrosterone (DHEA) occur in small amounts in all vertebrates. Although 11-ketotestosterone is a weak androgen in four-legged vertebrates, it is the most potent variety in bony fishes and sharks."}, {"url": "http://www.healthywomen.org/condition/androgen", "passage_text": "In addition to PCOS, other causes of high androgen levels (called. ) include. (a genetic disorder affecting the adrenal glands that afflicts about one in 10,000 to one in 18,000 Americans, about half of whom are women) and other adrenal abnormalities, and ovarian or adrenal tumors. The only time a sudden drop-off in androgen levels occurs is in women who have their ovaries removed (about half of all androgens are produced in a woman's adrenal glands and half in her ovaries). By the time a woman reaches menopause, blood androgen levels are about half of what they were at their peak."}]