[{"url": "http://money.usnews.com/money/personal-finance/articles/2012/08/01/8-ways-to-trim-moving-costs", "passage_text": "Summertime is peak moving season, but you can lower costs with the right preparations. By Daniel Bortz. + More. The average professional household move costs a whopping $12,230, according to a 2010 report by Worldwide ERC, an association that tracks mobility costs. However, this cost is for a full-service professional move, in which the moving company packs up your belongings and essentially handles the entire move for you. Time it right. A mid-month move will save you the most money, as movers are busiest during the beginning and end of the month as leases turn over. Save on boxes. You can purchase used, recycled boxes and pack small items up yourself to decrease the amount of time the movers will have to spend."}, {"url": "http://money.usnews.com/money/personal-finance/articles/2012/08/01/8-ways-to-trim-moving-costs", "passage_text": "If you hire professionals, there are still ways you can reduce expenses, such as through tax breaks, research, and packing up small belongings before the movers arrive. Approximately 16.7 million households move annually, with a little less than half moving in the summer months, according to the U.S. Census Bureau. Time it right. A mid-month move will save you the most money, as movers are busiest during the beginning and end of the month as leases turn over. Save on boxes. You can purchase used, recycled boxes and pack small items up yourself to decrease the amount of time the movers will have to spend."}, {"url": "http://www.movingservices.com.au/planning-a-move/moving-costs/how-to-reduce-your-moving-costs/", "passage_text": "1 Pack your own boxes: The more work that you require a moving service to do, the more that your total moving costs will be. 2  If you hire a moving company to pack all your boxes and load the truck for you, your moving expenses will be higher. 1 Get rid of old belongings: Lightening your load will help to reduce moving expenses. 2  Get rid of clothing and other items that you haven't used in the past year. 3  If you sell valuable items to consignment shops or have a garage sale, you can actually earn money to put toward your moving budget."}, {"url": "http://www.moneycrashers.com/tips-packing-moving-costs/", "passage_text": "How to Save on Common Moving Expenses. Moving costs add up. In many cases, the best way to keep these costs down is to plan your purchases in advance by shopping for sales, comparing quotes, and claiming freebies (such as moving boxes) from work or friends. Still, they cost money – and moving services aren’t always cheap. You can save money by hiring a firm with a reputation for being quick and efficient, and that takes steps beforehand to make it easier for your movers to do their job."}, {"url": "http://www.wisebread.com/how-to-minimize-the-cost-of-living-when-moving-the-cost-of-living-myth", "passage_text": "I can’t afford to move there — the cost of living is way too high.”. When looking for jobs in new markets people correctly investigate the cost of living. Cost of living is an important consideration when moving to a new location. Nevertheless, there are many false assumptions regarding the cost of living differences. People falsely assume the cost of living calculator is infallible."}, {"url": "http://rentason.ca/blog/reducing-cost-of-move", "passage_text": "It is important to find ways to reduce the cost of moving but stay away from gravitating towards cheaper moving companies. Low hourly rates will most often forecast a roller coaster of a moving experience. Reducing your costs is possible-even when you hire a quality moving company. Here are a list of tips that can help you save on moving day; 1. Get Good Boxes-Low quality boxes that don't hold up will cost you much more than purchasing or renting boxes for your move."}, {"url": "http://www.moneycrashers.com/tips-packing-moving-costs/", "passage_text": "1. Packing. You never know how much stuff you have until you start to pack. When moving – especially for long distances – secure packing can often make a significant difference in the condition of your possessions once they reach your destination, so make sure that you have enough boxes, tape, and bubble wrap on hand. 1  Collect Packing Materials. 2  Reduce/Recycle. Still, they cost money – and moving services aren’t always cheap. You can save money by hiring a firm with a reputation for being quick and efficient, and that takes steps beforehand to make it easier for your movers to do their job."}, {"url": "http://moneyqanda.com/ways-to-cut-costs-on-moving-expenses/", "passage_text": "One way to save over half of the cost of a local move is to simply pack your own belongings instead of having the moving company do it. I was recently quoted over $1,500 in boxes and packing fees alone for my 30 mile local move for the approximate 8,000 pounds of household items and furniture I wanted moved. If you think that you are going to use a moving company, you need to get several quotes before you decide. Three quotes is a great number to give you a sense of how much your move will cost and whether or not you should simply do it yourself."}, {"url": "http://www.mymovingreviews.com/move/save-on-moving-services", "passage_text": "How to save on moving supplies. Here are some proven to work tips on how to save on moving supplies and particularly, how to save on moving boxes. Find free moving boxes online-Yes, you can find free moving boxes for your move. Just search online. Search in your local Craigslist posts or local classifieds websites under free stuff section. Ways to Save on Moving Costs. Get free used moving boxes-save on moving boxes and protect the environment. Moving is expensive and most people usually do not understand and accept that."}, {"url": "http://www.wikihow.com/Reduce-Expenses", "passage_text": "A successful way to save money is to reduce expenses. There are many ways you can stretch your dollars and help avoid that too much money at the end of the month feeling. Some of these steps will take planning and investigation but they will be well worth the effort. Others you will be able to implement immediately. "}]