[{"url": "http://www.maldivesholidays.org/maldives-weather", "passage_text": "Average monthly rainfall in the wet season never drops below 200 mm. It is highest in May and lowest in June. Humidity routinely registers about 80% during the wet season. The chart below shows the average rainfall in mm by month. Statistics are courtesy of the Maldives Meteorological Service for calendar year 2010. Average Monthly Temperatures. The dry season is the ideal time to visit the Maldives. Days are warm and sunny and average from 25-29 degrees Celsius (C) or 77-84 degrees Fahrenheit (F)."}, {"url": "http://www.maldivesdivetravel.com/maldives-weather/maldives-weather-in-september", "passage_text": "Precipitation with regards to the September Maldives weather usually tends to be far above the norm, due to the culmination of the wet season. An average total of 243 mm of rainfall is estimated, along with an average of 16 rainy days in the month. September does find itself in the off-season for holidays in Maldives, however, the Maldives is known for its tropical paradise-like temperatures all year round. Partners. Maldives Weather in September. The September weather in Maldives is towards the back end of the southwest summer monsoon, also known as the rainy season. Thunderstorms and gales can pester the islands of Maldives during this time; fortunately the temperature does not suffer, with a daily average of 27 degrees."}, {"url": "http://www.holiday-weather.com/maldives/averages/", "passage_text": "Maldives: Annual Weather Averages. March is the hottest month in Maldives with an average temperature of 29°C (84°F) and the coldest is January at 27°C (81°F) with the most daily sunshine hours at 10 in February. The wettest month is September with an average of 243mm of rain. The best month to swim in the sea is in April when the average sea temperature is 30°C (86°F)."}, {"url": "http://www.holiday-weather.com/maldives/averages/september/", "passage_text": "The southwestern monsoon winds dominate the weather, bringing about heavy and frequent rains and skyrocketing humidity across the atolls. Monthly total precipitation for September amounts to a whooping 243 mm and heavy rainfall is expected during 14 days of the month. This results in rather low prices for tourists who opt to visit Maldives during September. During this month, average daytime temperature slightly drops from the summer averages down to 27 degrees Celsius. Midday peaks may reach as .."}, {"url": "http://www.maldivesdivetravel.com/maldives-weather", "passage_text": "The rainy season in the Maldives lasts from the end of April until mid-October whereby the average temperature fluctuates between 27 and 33 degrees. With regards to the rainfall in the Maldives, the yearly average lies at around 2,540 millimetres in the North, and 3,810 millimetres in the south of Maldives. The water temperature in Maldives never drops below 25 degrees, and with the average sunshine surpassing 8 hours in a day, it is difficult not to enjoy the blissful weather conditions. For a detailed monthly summary of the weather in the Maldives, please click on one of the links below! 1  Maldives Weather in January."}, {"url": "http://www.holiday-weather.com/maldives/averages/september/", "passage_text": "September represents the culmination of the wet season at the archipelago of Maldives. This is the rainiest month (only contested by December in rare occasions) and sees relatively little tourist activity for that reason. This results in rather low prices for tourists who opt to visit Maldives during September. During this month, average daytime temperature slightly drops from the summer averages down to 27 degrees Celsius. Midday peaks may reach as .."}, {"url": "http://maldives-weather.co.uk/september/", "passage_text": "Below is the typical weather in Maldives in September including day-time maximum and night-time minimum temperatures, monthly rainfall figures and the average number of daily hours of sunshine & daylight and sea temperature. The average maximum daytime temperature in Maldives in September is a hot 30°C (86°F), while the average minimum night-time temperature is a warm 25°C (77°F). On average 217 mm (8.5 inches) of rain normally falls in Maldives during September with rain falling on 15 days of the month. You can expect on average 7 hours of sunshine a day in Maldives during September. Select a month from the list below to see the Maldives weather for a particular month"}]