[{"url": "http://www.answers.com/Q/What_did_the_Mayflower_Compact_establish", "passage_text": "The Mayflower Compact (1620) was the first case of colonial self-government in America. The Mayflower Compact was the first governing document of Plymouth Colony. It was dra … fted by the pilgrims who crossed the Atlantic aboard the Mayflower. It was signed on November 21, 1620 in what is now Provincetown Harbor near Cape Cod. "}, {"url": "http://www.allabouthistory.org/mayflower-compact.htm", "passage_text": "All 41 of the adult male members on the Mayflower signed the Compact. Being the first written laws for the new land, the Compact determined authority within the settlement and was the observed as such until 1691. This established that the colony (mostly persecuted Separatists), was to be free of English law. "}, {"url": "http://www.answers.com/Q/What_was_the_Mayflower_Compact", "passage_text": "The Mayflower Compact (1620) was the first case of colonial self-government in America. The Mayflower Compact was the first governing document of Plymouth Colony. It was drafted by the pilgrims who crossed the Atlantic aboard the Mayflower. the mayflower compact was significant because this was the first governing document of plymouth colony. This signified not a constitution; but an agreement to form a crude gov … ernment, and to submit the will of the majority under the regulations agreed upon."}, {"url": "https://en.wikipedia.org/wiki/Mayflower_Compact", "passage_text": "The Mayflower Compact was the first governing document of Plymouth Colony. It was written by separatist Congregationalists who called themselves Saints. Later they were referred to as Pilgrims or Pilgrim Fathers. They were fleeing from religious persecution by King James of England. Reasons for the Compact. The Mayflower was originally bound for the Colony of Virginia, financed by the Company of Merchant Adventurers of London. Storms forced them to anchor at the hook of Cape Cod in what is now Massachusetts."}, {"url": "http://www.learningtogive.org/resources/mayflower-compact", "passage_text": "The Mayflower Compact, a document signed aboard the ship Mayflower in 1620, set forth principles of tolerance and liberty for the government of a new colony in the New World (The Architect of the Capitol 2001). The Mayflower Compact expressed four main ideals (Cline 2003): Definition. "}, {"url": "https://en.wikipedia.org/wiki/Mayflower_Compact", "passage_text": "The Mayflower Compact was signed aboard ship on November 11, 1620 by the Pilgrims. Reasons for the Compact. The Mayflower was originally bound for the Colony of Virginia, financed by the Company of Merchant Adventurers of London. Storms forced them to anchor at the hook of Cape Cod in what is now Massachusetts."}, {"url": "http://mayflowerhistory.com/mayflower-compact/", "passage_text": "The Mayflower Compact. The Mayflower Compact was signed on 11 November 1620 onboard the Mayflower shortly after she came to anchor off Provincetown Harbor. The Pilgrims had obtained permission from English authorities to settle in Virginia, whose northern border at the time extended up to what is now New York. "}, {"url": "http://score.rims.k12.ca.us/score_lessons/symbols_freedom/pages/mayflower.html", "passage_text": "The version now available follow his spelling and punctuation. The Mayflower Compact was the first agreement for self-government to be created and enforced in America. On September 16, 1620 the Mayflower, a British ship, with 102 passengers, who called themselves Pilgrims, aboard sailed from Plymouth, England. They were bound for the New World. The voyage took 66 days. The Mayflower Compact, which remained in effect until 1691, was he first written attampt at self government in American History.. On September 16, 1620 the Mayflower, a British ship, with 102 passengers, who called themselves Pilgrims, aboard sailed from Plymouth, England. They were bound for the New World"}, {"url": "http://www.history.com/topics/mayflower-compact", "passage_text": "A+E Networks. The Mayflower Compact, signed by 41 English colonists on the ship Mayflower on November 11, 1620, was the first written framework of government established in what is now the United States. "}]