[{"url": "https://volcanoworld.wordpress.com/2009/02/25/what-is-lava-made-of/", "passage_text": "Photo by Steve Mattox. Lava is made up of crystals, volcanic glass, and bubbles (volcanic gases). As magma gets closer to the surface and cools, it begins to crystallize minerals like olivine and form bubbles of volcanic gases. When lava erupts it is made up of a slush of crystals, liquid, and bubbles. The liquid “freezes” to form volcanic glass. Chemically lava is made of the elements silicon, oxygen, aluminum, iron, magnesium, calcium, sodium, potassium, phosphorus, and titanium (plus other elements in very small concentrations. "}, {"url": "https://en.wikipedia.org/wiki/Magma", "passage_text": "Lava is the extrusive equivalent of magma. Magma (from Greek μάγμα, thick unguent) is a mixture of molten or semi-molten rock, volatiles and solids that is found beneath the surface of the Earth, and is expected to exist on other terrestrial planets. Besides molten rock, magma may also contain suspended crystals, dissolved gas and sometimes gas bubbles. Magma often collects in magma chambers that may feed a volcano or solidify underground to form an intrusion. Magma is capable of intrusion into adjacent rocks (forming igneous dikes and sills), extrusion onto the surface as lava, and explosive ejection as tephra to form pyroclastic rock."}, {"url": "http://www.youtube.com/watch?v=UciJ1aYWch8", "passage_text": "A volcano is a vent or 'chimney' that connects molten rock (magma) to the Earth's surface. It includes the surrounding cone of built-up material. Magma erupting from a volcano is called lava. Gases and pieces of rock erupt from volcanoes too. "}, {"url": "http://www.answers.com/Q/What_is_magma", "passage_text": "Magma is highly heated molten rock that comes to the surface of  usually through volcanic eruption. Magma is usually found beneath  the earth located near the earth's core a … nd can sometimes contain  crystals and gases. Answered. "}, {"url": "http://volcano.oregonstate.edu/what-lava-made", "passage_text": "Lava is made up of crystals, volcanic glass, and bubbles (volcanic gases). As magma gets closer to the surface and cools, it begins to crystallize minerals like olivine and form bubbles of volcanic gases. When lava erupts it is made up of a slush of crystals, liquid, and bubbles. The liquid freezes to form volcanic glass. Chemically lava is made of the elements silicon, oxygen, aluminum, iron, magnesium, calcium, sodium, potassium, phosphorus, and titanium (plus other elements in very small concentrations. Have a look at the background information in Minerals, Magma, and Volcanic Rocks."}, {"url": "http://www.buzzle.com/articles/what-is-magma-made-of.html", "passage_text": "Magma is the molten form of rock, stored deep beneath the Earth's surface. The temperature of this hot fluid ranges from 1292 - 2372 °F. At this temperature, it has the ability to melt the surrounding rock structures to produce more magma. ❍ Intermediate magma contains 60 percent silica, but the magnesium and iron content in it is very low. Very explosive in nature, its temperature can be as high as 1832 °F. ❍ Felsic magma contains more than 70 percent silica content, but its iron and magnesium content is negligible."}, {"url": "https://en.wikipedia.org/wiki/Lava", "passage_text": "Lava flow during a rift eruption at Krafla, Iceland in 1984. Lava is the molten rock expelled by a volcano during an eruption and the resulting rock after solidification and cooling. This molten rock is formed in the interior of some planets, including Earth, and some of their satellites. The source of the heat that melts the rock within the earth is geothermal energy. When first erupted from a volcanic vent, lava is a liquid at temperatures from 700 to 1,200 °C (1,292 to 2,192 °F)."}, {"url": "https://en.wikipedia.org/wiki/Magma", "passage_text": "Magma is a complex high-temperature fluid substance. Temperatures of most magmas are in the range 700 °C to 1300 °C (or 1300 °F to 2400 °F), but very rare carbonatite magmas may be as cool as 600 °C, and komatiite magmas may have been as hot as 1600 °C. Most magmas are silicate mixtures. Magma often collects in magma chambers that may feed a volcano or solidify underground to form an intrusion. Magma is capable of intrusion into adjacent rocks (forming igneous dikes and sills), extrusion onto the surface as lava, and explosive ejection as tephra to form pyroclastic rock."}, {"url": "http://www.enotes.com/homework-help/what-lava-made-out-467223", "passage_text": "Lava is made up of crystals, volcanic glass and bubbles (volcanic gases). When the magma gets closer to the surface and cool, it begins to crystallize minerals like olivine and form bubbles of volcanic gases. When the lava erupts, it is made up of crystals, liquid and bubbles. (Answer #9). Lava is made up of molten rock, which contains crystals, volcanic glass, and volcanic gases. Magma cools as it gets closer to the surface which is what crystallizes the minerals and forms the bubbles (gas)."}]