[{"url": "http://www.bbc.co.uk/schools/gcsebitesize/business/aims/aimsandactivitiesrev3.shtml", "passage_text": "Primary, secondary and tertiary sectors. There are three main types of industry in which firms operate. These sectors form a chain of production which provides customers with finished goods or services. Primary production: this involves acquiring raw materials. "}, {"url": "http://www.businessdictionary.com/definition/secondary-industry.html", "passage_text": "Companies that get outsourced to other countries are often part of a secondary industry, just making smaller components for the larger companies at lower employee costs. 9 people found this helpful. My neighbor, Wilson, is a carpentar, this is a secondary industry that makes a whole bunch of people rich in the United States of America."}, {"url": "http://www.investopedia.com/terms/t/tertiaryindustry.asp", "passage_text": "Macroeconomics. The tertiary industry is one of three industry types in a developed economy, the other two being the primary (raw materials) and secondary (goods production) industries. As an economy becomes more developed, it will shift its focus from primary to secondary and tertiary industries. DEFINITION of 'Tertiary Industry'. The segment of the economy that provides services to its consumers. This includes a wide range of businesses including financial institutions, schools, transports and restaurants. Also known as tertiary sector of industry, or service industry/sector"}, {"url": "http://www.definitions.net/definition/secondary%20industry", "passage_text": "Wiktionary (0.00 / 0 votes) Rate this definition: secondary industry (Noun). An industry that processes raw materials produced by primary industry into goods suitable for tertiary industry to provide goods or services to consumers. "}, {"url": "http://www.answers.com/Q/What_are_primary_secondary_and_tertiary_industries", "passage_text": "Primary industries is the term used to describe organizations that are involved in the development and production of raw materials, such as meat, grains, minerals, and timber. It is used in various capacities within the primary industry. Tertiary industries is the term for the field of industries that provide transportation or finance rather than manufacturing or extracting raw materials (for example, Ikea or Ford, car mechanic, T.V. worker, fire fighter, nurse/doctor)."}, {"url": "http://www.businessdictionary.com/definition/secondary-industry.html", "passage_text": "Definition. The industrial sector of an economy that is dominated by the manufacture of finished products. Unlike a primary industry, which collects and produces raw materials for manufacture, a secondary industry makes products that are more likely to be consumed by individuals. Examples of secondary industry divisions include automobile manufacturing, steel production and telecommunications. My neighbor, Wilson, is a carpentar, this is a secondary industry that makes a whole bunch of people rich in the United States of America."}, {"url": "http://www.answers.com/Q/What_is_an_secondary_industry", "passage_text": "A secondary industry is one that produces things that are more likely to be consumed by individuals. Some examples are the automobile industry and telecommunications. Primary industries is the term used to describe  organizations that are involved in the development and production  of raw materials, such as meat, grains, minerals, and tim … ber. It is  used in various capacities within the primary industry."}, {"url": "http://bpimm.weebly.com/secondary-industry.html", "passage_text": "Summary. The secondary industry is also known as the manufacturing industry. The manufacturing industry utilises materials extracted from the primary industry and creates a product useful to the consumer. 22% of the Canadian population is provided with jobs in the secondary industry, usually in factories and close to larger cities where products are of easy reach. 1) Also known as the manufacturing industry2) 22% of industries3) Primary: Transforming raw materials into a product. (eg. Tree into 2x4 planks) 4) Secondary: Taking the product and turning it into a finished product5) Work is done mostly in factories close to large urban areas."}, {"url": "http://www.investopedia.com/terms/t/tertiaryindustry.asp", "passage_text": "BREAKING DOWN 'Tertiary Industry'. The tertiary industry is one of three industry types in a developed economy, the other two being the primary (raw materials) and secondary (goods production) industries. As an economy becomes more developed, it will shift its focus from primary to secondary and tertiary industries. DEFINITION of 'Tertiary Industry'. The segment of the economy that provides services to its consumers. This includes a wide range of businesses including financial institutions, schools, transports and restaurants. Also known as tertiary sector of industry, or service industry/sector"}]