[{"url": "https://en.wikipedia.org/wiki/Thyroid", "passage_text": "The thyroid gland, or simply the thyroid /ˈθaɪrɔɪd/ , is one of the largest endocrine glands in the body, and consists of two connected lobes. It is found in the neck, below the laryngeal prominence (Adam's apple). The thyroid gland is a butterfly-shaped organ and is composed of two cone-like lobes or wings, lobus dexter (right lobe) and lobus sinister (left lobe), connected via the isthmus."}, {"url": "http://www.hormone.org/hormones-and-health/what-do-hormones-do/what-does-the-thyroid-gland-do", "passage_text": "The thyroid (THY-royd) gland, a small butterfly-shaped gland in the front of your neck, makes thyroid hormones. Thyroid hormones travel from the thyroid gland through the blood to all parts of the body, where they do their work. Sometimes the thyroid gland makes too much thyroid hormone, which is called hyperthyroidism. Think of your body as a car and your thyroid as the engine. An overactive thyroid makes your body idle too fast. Symptoms of overactive thyroid gland include. 1  Feeling nervous and irritable. 2  Having trouble concentrating."}, {"url": "http://www.womenshealth.gov/publications/our-publications/fact-sheet/thyroid-Disease.html", "passage_text": "Your thyroid is a small gland at the base of your neck that makes thyroid hormone. Thyroid hormone controls many activities in your body, including how fast you burn calories and how fast your heart beats. Diseases of the thyroid cause it to make either too much or too little of the hormone. Thyroid cancer happens when cancer cells form from the tissues of the thyroid gland. Most people with thyroid cancer have a thyroid nodule that does not cause any symptoms. If you do have symptoms, you may have swelling or a lump in your neck. The lump may cause problems swallowing."}, {"url": "http://www.hormone.org/hormones-and-health/what-do-hormones-do/what-does-the-thyroid-gland-do", "passage_text": "Having thyroid hormone levels that are too high (overactive thyroid gland). Sometimes the thyroid gland makes too much thyroid hormone, which is called hyperthyroidism. Think of your body as a car and your thyroid as the engine. An overactive thyroid makes your body idle too fast. Symptoms of overactive thyroid gland include. 1  Feeling nervous and irritable. 2  Having trouble concentrating."}, {"url": "https://en.wikipedia.org/wiki/Thyroid", "passage_text": "The thyroid gland controls how quickly the body uses energy, makes proteins, and controls the body's sensitivity to other hormones. It participates in these processes by producing thyroid hormones, the principal ones being thyroxine (T 4) and triiodothyronine (T 3), which is more active. The thyroid gland is a butterfly-shaped organ and is composed of two cone-like lobes or wings, lobus dexter (right lobe) and lobus sinister (left lobe), connected via the isthmus."}, {"url": "http://www.endocrineweb.com/conditions/thyroid/how-your-thyroid-works", "passage_text": "Your thyroid gland is a small gland, normally weighing less than one ounce, located in the front of the neck. It is made up of two halves, called lobes, that lie along the windpipe (trachea) and are joined together by a narrow band of thyroid tissue, known as the isthmus. The function of the thyroid gland is to take iodine, found in many foods, and convert it into thyroid hormones: thyroxine (T4) and triiodothyronine (T3). Thyroid cells are the only cells in the body which can absorb iodine. These cells combine iodine and the amino acid tyrosine to make T3 and T4"}, {"url": "http://www.entnet.org/content/thyroid-disorders-and-surgery", "passage_text": "Your thyroid gland is one of the endocrine glands that makes hormones to regulate physiological functions in your body, like metabolism (heart rate, sweating, energy consumed). Other endocrine glands include the pituitary, adrenal, and parathyroid glands and specialized cells within the pancreas. "}, {"url": "http://www.medicinenet.com/script/main/art.asp?articlekey=18119", "passage_text": "The major function of the thyroid gland is to produce thyroid hormone in an amount sufficient to meet the body's needs. To make thyroid hormone, the thyroid uses iodine. If iodine is not available in the diet, the thyroid may produce an insufficient amount of hormone. "}]