[{"url": "http://www.healthline.com/human-body-maps/uterus", "passage_text": "The uterus has three layers: the inner lining (endometrium); the middle muscular layer (myometrium); and the outer layer (perimetrium). The uterus is connected to the fallopian tubes, the cervix, and (via the cervix) the vagina. The main purpose of the uterus is to nourish a fetus prior to birth."}, {"url": "http://www.alternativesurgery.com/education/adenomyosis/", "passage_text": "Adenomyosis, also referred to as “uterine endometriosis,” is a benign disease confined to the uterine muscle. Endometrial cells from the lining of the endometrial cavity, migrate from that lining, most commonly into the posterior side or back wall of the uterus."}, {"url": "https://en.wikipedia.org/wiki/Uterine_smooth_muscle", "passage_text": "The myometrium is the middle layer of the uterine wall, consisting mainly of uterine smooth muscle cells (also called uterine myocytes), but also of supporting stromal and vascular tissue. Its main function is to induce uterine contractions."}, {"url": "http://www.innerbody.com/image_repfov/repo11-new.html", "passage_text": "The uterus, also commonly known as the womb, is a hollow muscular organ of the female reproductive system that is responsible for the development of the embryo and fetus during pregnancy."}, {"url": "http://www.emedicinehealth.com/uterine_fibroids/article_em.htm", "passage_text": "1 Fibroids start in the muscle tissues of the uterus. 2  They can grow into the uterine cavity (submucosal), into the thickness of the uterine wall (intramuscular), or on the surface of the uterus (subsersoal) into the abdominal cavity."}, {"url": "http://www.femail.com.au/theuterus.htm", "passage_text": "The uterus is made up of muscles, these muscles contract during a menstrual cycle and when a woman has a baby (these muscles help to push the baby out), the uterus muscles also contract during orgasm. Lining the cavity of the uterus wall is the endometrial cavity."}, {"url": "https://www.ucsfhealth.org/conditions/pelvic_pain/signs_and_symptoms.html", "passage_text": "Endometriosis. Endometriosis is a condition in which the lining of the uterus (endometrium) grows outside the uterus. The lining can attach to the ovaries, fallopian tubes, intestines or other structures in the pelvis. Adenomyosis occurs when tissue from the lining of the uterus grows in the muscle of the uterus. Endometriosis may cause pelvic pain, especially during menstruation. Hormones of the menstrual cycle cause the endometriosis to bleed each month."}]