[{"url": "http://dish.allrecipes.com/how-to-cook-rice/", "passage_text": "1 To cook wild rice: Use 1 cup of rice to 3 cups of water. 2  Bring the water to a boil, reduce the heat, and simmer for 45 minutes. 3  Let stand, covered, for 10 minutes before serving. 4  To cook rice pilaf: For pilaf dishes, rice is sauteed in oil in order to keep the grains separate during cooking."}, {"url": "http://dish.allrecipes.com/how-to-cook-rice/", "passage_text": "1 To cook brown rice: Use 1 cup of rice and 2 cups of water. 2  Bring the water to a boil, reduce the heat, and simmer for 45 minutes. 3  Let stand, covered, for 10 minutes before serving. 4  To cook basmati or jasmine rice: Follow the instructions for long-grained white rice."}, {"url": "http://www.wikihow.com/Make-Risotto", "passage_text": "Use a ladle to add a cup or two of simmering broth to the rice. Then, stir the rice until it has absorbed the broth. Keep adding broth to the rice and stirring; this cooking technique helps bring the starch out of the rice to combine with the broth for the creamy texture typical of a classic risotto."}, {"url": "http://www.foodnetwork.com/recipes/risotto-recipe.html", "passage_text": "Once the onion is soft, add the rice and cook over medium heat, stirring constantly, for about 3 minutes. Adjust the heat as necessary -- if the rice is cooked at too high a heat, it will turn brown and take on an undesirable flavor. Adding the Liquid to the Rice. Using a ladle, scoop up about 1/2 to 3/4 cup of broth."}, {"url": "http://www.foodnetwork.com/recipes/risotto-recipe.html", "passage_text": "Determining When the Risotto Is Cooked. Continue to add the broth in 1/2-to-3/4-cup batches and stir the rice until you have used most of the broth (this will probably take about 20 minutes). It is now time to test whether the risotto is cooked."}, {"url": "http://www.thekitchn.com/how-to-make-risotto-at-home-cooking-lessons-from-the-kitchn-63452", "passage_text": "Risotto also has a reputation for being fussy and time-consuming, but once you start cooking, it doesn't take more than a 30 minutes to make. Risotto is a dish that's become associated with fancy high end restaurants, but really, it's the epitome of Italian home cooking and comfort food."}, {"url": "http://www.jamieoliver.com/news-and-features/features/low-down-on-rice/", "passage_text": "White rice usually take about 15 minutes to cook in a rice cooker and brown rice around 25 minutes, the same as if you cook it on top of the stove."}, {"url": "http://www.thekitchn.com/how-to-make-risotto-at-home-cooking-lessons-from-the-kitchn-63452", "passage_text": "Risotto also has a reputation for being fussy and time-consuming. It's true that once you start cooking, it does require a fair amount of attention, but it doesn't take more than a 30 minutes to make. In fact, true Italian cooks will tell you that risotto should take no more than 18 to 19 minutes from start to finish. One of our chefs in culinary school made us time him, and sure enough, his risotto was done in exactly 18 1/2 minutes every single time! Risotto is more of a technique than a dish."}, {"url": "http://www.backpackingchef.com/dehydrating-rice.html", "passage_text": "Cook rice following the directions on the bag, but use beef, chicken, or vegetable broth instead of plain water. The usual method is to bring 2 to 2½ cups of liquid to a boil, stir in 1 cup rice, cover and reduce heat to low."}]