[{"url": "http://ibpf.org/about-bipolar-disorder", "passage_text": "Bipolar disorder, also known as manic-depressive illness, is a brain disorder that causes unusual shifts in a person’s mood, energy, and ability to function. Different from the normal ups and downs that everyone goes through, the symptoms of bipolar disorder are severe. "}, {"url": "http://www.exampleessays.com/viewpaper/83995.html", "passage_text": "Bipolar disorder, formerly known as manic-depressive illness, is characterized by episodes of mania and major depression. The person with bipolar disorder will have tremendous highs, known as mania, and incredible lows, known as depression, as well as mixed highs and lows, and everything in between. The three main types of the bipolar disorder are Bipolar I disorder, Bipolar II disorder, and Cyclothymic disorder. The five main episodes of the bipolar disorder are Manic Episode, Major Depressive Episode, Hypo manic Episode, Mixed Episode, and Rapid Cycling or Ultra-Rapid Cycling."}, {"url": "http://www.123helpme.com/search.asp?text=Bipolar", "passage_text": "Bipolar Disorder and the-Bipolar Disorder and the War on Drugs Bipolar disorder, also known as, manic-depressive illness, is a brain disorder that results in unusual shifts in a person's mood, energy, and ability to function. Bipolar Disorder-Bipolar disorder is a disease that effects one in every five Americans. It is second only to heart disease for loss of workdays in the U.S. Due to popular belief the cause of Bipolar disorder is a chemical imbalance in the brain."}, {"url": "http://www.exampleessays.com/papers/Bipolar_Disorder.html", "passage_text": "Bipolar Disorder. Bipolar depression, also known as bipolar disorder, manic depression and manic-depressive illness, is a form of a depressive illness in which mania and depression alternate. ... A person who has bipolar disorder swings between two extreme emotional poles-depression and mania. ... ... One symptom of bipolar disorder is severe irritability and mood swings. ... Mood swings are also common among those suffering from bipolar disorder. ... There are many more signs of the manic stage of bipolar disorder. ... If..."}, {"url": "http://www.123helpme.com/search.asp?text=Bipolar", "passage_text": "Bipolar Disorder-Bipolar Disorder The severe mood fluctuations of bipolar or manic-depressive disorders have been around since the 16-century and affect little more than 2% of the population in both sexes, all races, and all parts of the world (Harmon 3). Bipolar Disorder-Bipolar disorder is a disease that effects one in every five Americans. It is second only to heart disease for loss of workdays in the U.S. Due to popular belief the cause of Bipolar disorder is a chemical imbalance in the brain."}, {"url": "http://www.exampleessays.com/papers/Bipolar_Disorder.html", "passage_text": "9. Bipolar depression, also known as bipolar disorder, manic depression and manic-depressive illness, is a form of a depressive illness in which mania and depression alternate. ... A person who has bipolar disorder swings between two extreme emotional poles-depression and mania. ... ... One symptom of bipolar disorder is severe irritability and mood swings. ... Mood swings are also common among those suffering from bipolar disorder. ... There are many more signs of the manic stage of bipolar disorder. ... If..."}, {"url": "http://www.123helpme.com/search.asp?text=Bipolar", "passage_text": "Bipolar Disorder-Bipolar Disorder INTRODUCTION What is Bipolar Disorder. The word bipolar is defined as relating to, associated with, or occurring in two polar regions7. Bipolar disorder is a concept described as a mental illness in which a person experiences dramatic mood swings. Bipolar Disorder-Bipolar disorder is a disease that effects one in every five Americans. It is second only to heart disease for loss of workdays in the U.S. Due to popular belief the cause of Bipolar disorder is a chemical imbalance in the brain."}, {"url": "https://www.papermasters.com/bipolar_disorder.html", "passage_text": "Subcategorize of Bipolar Disorder to Include in a Research Paper. 1  Bipolar I disorder occurs when the person shows manic and depressive episodes, as well as mixed episodes. 2  Bipolar II disorder occurs when the person displays mild mania (hypomania) and full depressive episodes. 3  This is often misdiagnosed as depression. Paper Masters writes on all these elements of bipolar disorder when you order a custom research paper. It is a mood disorder involving degrees of mania as well as depression. It was previously known as Manic-Depression, but the title was misleading, as many people believed it was a form of"}, {"url": "http://www.exampleessays.com/papers/Bipolar_Disorder.html", "passage_text": "21. Bipolar disorder is the third most common mood disorder after major depression and dysthymic disorder. ... Anxiety disorders, such as post-traumatic stress disorder and obsessive-compulsive disorder, also may be common in people with bipolar disorder.There are two types of this disorder: bipolar I and bipolar II. ... One symptom of bipolar disorder is severe irritability and mood swings. ... Mood swings are also common among those suffering from bipolar disorder. ... There are many more signs of the manic stage of bipolar disorder. ... If..."}, {"url": "http://www.dbsalliance.org/site/PageServer?pagename=education_bipolar_types", "passage_text": "Bipolar I Disorder. Bipolar I disorder is characterized by one or more manic episodes or mixed episodes (symptoms of both a mania and a depression occurring nearly every day for at least one week) and one or more major depressive episodes. Bipolar I disorder is the most severe form of the illness marked by extreme manic episodes. Not Otherwise Specified (NOS). Bipolar disorder that does not follow a particular pattern (for example, re-occuring hypomanic episodes without depressive symptoms, or very rapid swings between some symptoms of mania and some symptoms of depression) is called bipolar disorder"}]