[{"url": "https://en.wikipedia.org/wiki/Modernist_poetry_in_English", "passage_text": "Modernist poetry in English started in the early years of the 20th century with the appearance of the Imagists. In common with many other modernists, these poets wrote in reaction to the perceived excesses of Victorian poetry, with its emphasis on traditional formalism and ornate diction. In setting these criteria for poetry, the Imagists saw themselves as looking backward to the best practices of pre-Romantic writing. Imagists poets used sharp language and embrace imagery. Their work, however, was to have a revolutionary impact on English-language writing for the rest of the 20th century."}, {"url": "http://modernistpoetry.voices.wooster.edu/", "passage_text": "By Matt Hooley on. in Default. Modernist poetry is a literature of crisis: an effect of-and response to-crises of politics (the failure of western diplomacy and the invention of global war), culture (the inadequacy of realism and accepted notions of ‘Tradition’), and economy (the collapse of industrial capitalism). "}, {"url": "http://www.bachelorandmaster.com/literaryterms/modernist-poetry.html", "passage_text": "In poetry, we can discuss the modernist elements in terms of four major subheadings: modern or new experiments in form and style, new themes and word-games, new modes of expression, and complex and open-ended nature of their themes and meaning. Another important element of modernist poetry is the use of new and wide range of subjects, themes and issues. Traditional poetry had to be limited to subjects of universal significance, general human appeal, and so on, even when the poems were romantically personal on their surface."}, {"url": "https://en.wikipedia.org/wiki/Modernist_poetry", "passage_text": "Modernist poetry refers to poetry written, mainly in Europe and North America, between 1890 and 1950 in the tradition of modernist literature, but the dates of the term depend upon a number of factors, including the nation of origin, the particular school in question, and the biases of the critic setting the dates. Not within living memory has there ever been a day when young writers were not coming up, in a threat of iconoclasm Evidence of the truth of Sisson's comment is Arthur Hallam 's 'On Some of the Characteristics of Modern poetry, published in 1830 in Moxon 's English Magazine."}, {"url": "http://www.bachelorandmaster.com/literaryterms/modernist-poetry.html", "passage_text": "Modernist Poetry-Definition of Literary Term. In general, modernist literature is characterized by the radical break with the traditions of literary subjects, forms, concepts and styles. Another important element of modernist poetry is the use of new and wide range of subjects, themes and issues. Traditional poetry had to be limited to subjects of universal significance, general human appeal, and so on, even when the poems were romantically personal on their surface."}, {"url": "http://www.bachelorandmaster.com/literaryterms/modernist-poetry.html", "passage_text": "So, in modernist poetry, the meaning of a poem is the ‘differing’ interpretation of different readers. There can be no single and fixed meaning of any poem. Also, modernist poets have violated all the known conventions and established rules of the past. Another important element of modernist poetry is the use of new and wide range of subjects, themes and issues. Traditional poetry had to be limited to subjects of universal significance, general human appeal, and so on, even when the poems were romantically personal on their surface."}, {"url": "http://www.bachelorandmaster.com/literaryterms/modernist-poetry.html", "passage_text": "The most striking element of modernist poetry is the invention and experimentation of new modes of expression. Modernism includes the many ‘-isms’ and therefore many different ways to express ideas and feelings. Another important element of modernist poetry is the use of new and wide range of subjects, themes and issues. Traditional poetry had to be limited to subjects of universal significance, general human appeal, and so on, even when the poems were romantically personal on their surface."}, {"url": "http://www.online-literature.com/periods/modernism.php", "passage_text": "Modernism. The Modernist Period in English Literature occupied the years from shortly after the beginning of the twentieth century through roughly 1965. In broad terms, the period was marked by sudden and unexpected breaks with traditional ways of viewing and interacting with the world"}, {"url": "http://www.brighthubeducation.com/high-school-english-lessons/29453-modernism-in-literature/", "passage_text": "Don't confuse the Modernists movement with the standard dictionary definition of modern. Modernism in Literature is not a chronological designation; rather it consists of literary work possessing certain loosely defined characteristics. The following are characteristics of Modernism: 1  Marked by a strong and intentional break with tradition. 2  This break includes a strong reaction against established religious, political, and social views. 3  Belief that the world is created in the act of perceiving it; that is, the world is what we say it is."}]