[{"url": "https://www.bluecross.org.uk/pet-advice/neutering-your-dog", "passage_text": "The cost of castration or spaying a dog can vary a lot depending on the type of dog you have so it’s best to check with your vet. Several charities, including The Blue Cross, can help with the cost of neutering dogs so contact your nearest one to find out more. 1 Some breeds of dog can have as many as 12 puppies in just one litter. 2  That’s a lot of mouths to feed and the costs will soon add up. 3  Female dogs in heat can be messy – they produce a bloody discharge for three weeks or more."}, {"url": "https://answers.yahoo.com/question/index?qid=1006032604148", "passage_text": "When my parents neuterd my dog it cost them about $200-400, you cou also get a coupon and have a reduceded price. Your local shelter will tell you of any low=cost neuter clinics in your area. These usually charge from $35-50 for a male, depending on his size."}, {"url": "http://www.answers.com/Q/How_much_does_it_cost_to_get_your_puppy_neutered", "passage_text": "Cost of feline neuter If you have available in your city a LOW COST SPAY & NEUTER CLINIC the cost is anywhere from $15.00 to 25.00. Regular payment approx. $40.00 Another Answ … er: It is usually around $40-60, it depends on where you get it done. Variety of Options, From No-to Low-Cost. You 'Geld' horses, not neuter and it costs alot of money, it depends what vet you go to. Depending on how the procedure is done and what is required it typically costs betwee … n $300 and $3,000 to geld a horse."}, {"url": "http://pets.costhelper.com/spay-neuter-dog.html", "passage_text": "1 Spaying a pregnant dog costs about $50 to $125 extra. 2  Laser surgery can reduce pain, bleeding and swelling, and can be more precise, but costs between one-quarter and one-third more. 3  Most veterinarians offer the option of pre-anesthesia blood work, to make sure the liver and kidneys are working properly, for about $40. 1 Extra pain medication, usually an injection before surgery and a pill for later, usually costs between $10 and $30. 2  For male dogs, testicular implants are available. 3  They cost between $94 and $919 per pair, depending on the size and model. 4  Neuticles.com offers a detailed description of the product."}, {"url": "http://www.answers.com/Q/How_much_does_it_cost_to_get_your_dog_neutered", "passage_text": "Cost of feline neuter If you have available in your city a LOW COST SPAY & NEUTER CLINIC the cost is anywhere from $15.00 to 25.00. Regular payment approx. $40.00 Another Answ … er: It is usually around $40-60, it depends on where you get it done. Variety of Options, From No-to Low-Cost. If your dog has all his shots, it can cost as little as $75-$85, or as much as $200 if your pet is not vaccinated. Call your vet and inquire. Also look at your local news bull … etins for a low cost spay/neuter clinic in your area. The cost for neutering a dog at a low cost place ranges from $45 - $135"}, {"url": "http://www.stocktongov.com/government/departments/police/anSpay.html", "passage_text": "Depending on your locale and the veterinarian you select, it costs between $50 and $120 to castrate a male dog and between $75 and $140 to spay a female dog. For people on public assistance or with lower incomes and for seniors on fixed incomes, spay/neuter clinics are held in most towns and cities. The only way to be sure your dog does not produce unwanted puppies is to get your female dog spayed or your male dog neutered (casterated). Intact male dogs and bitches in heat find one another and breed."}, {"url": "https://answers.yahoo.com/question/index?qid=20080627073529AAQ3VWM", "passage_text": "The cost depends a lot on where you go. Some shelters and low cost clinics will spay and neuter for as low as $50 or less. Other veterinary hospitals will likely charge you around $200 (give or take) for a canine neuter, and $50-100 more for a spay (as it's a more complicated procedure than a neuter). I also depends on where you go. Pet hospitals are ALWAYS a lot more expensive compared to just a vet clinic. For my 9 # male dog it cost $125 but a hostpital wanted to charge me over $400. So go through the yellow pages of your phone book and call every vet office around you and just ask for a estimate."}, {"url": "http://pets.costhelper.com/spay-neuter-dog.html", "passage_text": "1 The cost of spaying, a more complicated surgery, usually ranges from about $50 to $175. 2  Some clinics and animal hospitals can charge up to $200-$300 or more, depending on the weight of the dog. 3  The cost of both neutering and spaying vary greatly by geographic region, and even by veterinarian. 1 Extra pain medication, usually an injection before surgery and a pill for later, usually costs between $10 and $30. 2  For male dogs, testicular implants are available. 3  They cost between $94 and $919 per pair, depending on the size and model. 4  Neuticles.com offers a detailed description of the product."}, {"url": "http://pets.costhelper.com/spay-neuter-dog.html", "passage_text": "1 Some clinics and animal hospitals can charge up to $200-$300 or more, depending on the weight of the dog. 2  The cost of both neutering and spaying vary greatly by geographic region, and even by veterinarian. 1 Extra pain medication, usually an injection before surgery and a pill for later, usually costs between $10 and $30. 2  For male dogs, testicular implants are available. 3  They cost between $94 and $919 per pair, depending on the size and model. 4  Neuticles.com offers a detailed description of the product."}]