[{"url": "http://answers.microsoft.com/en-us/windows/forum/windows_7-hardware/windows-7-how-do-i-cleanup-winsxs-folder-to-free/450e0396-6ba6-4078-8ca0-b16bf4e22ccf", "passage_text": "1. The WinSxS\\Backup folder: In previous versions of Windows, such as XP there was a component called 'Windows File Protection' which was used to make sure that all of the many system files were protected and backed up. These files were backed up in the %systemroot%\\System32\\dllcache folder."}, {"url": "http://answers.microsoft.com/en-us/windows/forum/windows_7-hardware/windows-7-how-do-i-cleanup-winsxs-folder-to-free/450e0396-6ba6-4078-8ca0-b16bf4e22ccf", "passage_text": "Windows Vista and Windows 7 make use of a c:\\windows\\winsxs folder to store backups of various install files and/or files replaced by updates. I'm not completely certain on everything Windows stores there. This seems to be completely separate from System Restore. The WinSxS\\Backup folder: In previous versions of Windows, such as XP there was a component called 'Windows File Protection' which was used to make sure that all of the many system files were protected and backed up. These files were backed up in the %systemroot%\\System32\\dllcache folder."}, {"url": "http://answers.microsoft.com/en-us/windows/forum/windows_7-hardware/windows-7-how-do-i-cleanup-winsxs-folder-to-free/450e0396-6ba6-4078-8ca0-b16bf4e22ccf", "passage_text": "Folder is a backup of your .dll's. When you install program's that need special dll's then you uninstall the program, the winsxs folder makes a backup. This isn't a glitch, it's done by design in windows vista an windows 7. The WinSxS\\Backup folder: In previous versions of Windows, such as XP there was a component called 'Windows File Protection' which was used to make sure that all of the many system files were protected and backed up. These files were backed up in the %systemroot%\\System32\\dllcache folder."}, {"url": "http://www.howtogeek.com/174705/how-to-reduce-the-size-of-your-winsxs-folder-on-windows-7-or-8/", "passage_text": "When Windows installs updates, it drops the new Windows component in the WinSXS folder and keeps the old component in the WinSXS folder. This means that every Windows Update you install increases the size of your WinSXS folder. This allows you to uninstall operating system updates from the Control Panel, which can be useful in the case of a buggy update — but it’s a feature that’s rarely used. The WinSXS folder contains all Windows system components. In fact, component files elsewhere in Windows are just links to files contained in the WinSXS folder. The WinSXS folder contains every operating system file."}, {"url": "http://www.ghacks.net/2010/07/24/the-winsxs-folder-explained/", "passage_text": "The backup folder is displayed as the largest folder in the Winsxs folder, followed by the naturallanguage6 folder and Manifests. A Technet blog post by Jeff Hugh explains the move from an INF described OS to componentization in Windows Vista. "}, {"url": "https://technet.microsoft.com/en-us/library/dn251565.aspx", "passage_text": "Deleting files from the WinSxS folder or deleting the entire WinSxS folder may severely damage your system so that your PC might not boot and make it impossible to update. However, there are ways to reduce the size of the WinSxS folder. For more information about the WinSxS folder, see Manage the Component Store. This topic was written to provide information about the different ways to reduce the size of the WinSxS folder on a running version of Windows 8.1."}, {"url": "http://answers.microsoft.com/en-us/windows/forum/windows_7-files/what-is-this-folder-cwindowswinsxs/330c3307-2569-4043-b2ec-c8016840a17a", "passage_text": "Windows sucks because someone deleted a folder in the Windows folder and the computer crashed. Odd, that has never happened before. If only they marked that folder with a huge sign that says If you alter this folder your system may become unstable... oh wait they did. Microsoft replaced the DLLCACHE folder that existed in Windows XP and Windows 2000 with C:\\Windows\\winsxs this folder is used to store backup DLL files and other system files."}, {"url": "https://technet.microsoft.com/en-us/library/dn251565.aspx", "passage_text": "In Windows 8.1 and Windows Server 2012 R2, you have a number of ways to start the cleanup of the component store, which use a combination of package deletion and component compression to clean up the WinSxS folder: However, there are ways to reduce the size of the WinSxS folder. For more information about the WinSxS folder, see Manage the Component Store. This topic was written to provide information about the different ways to reduce the size of the WinSxS folder on a running version of Windows 8.1."}, {"url": "http://www.thewindowsclub.com/winsxs-folder-windows-7-8", "passage_text": "Mine is almost 5 GB and has around 6000 folders & 25000 files and occupies almost 40% of the Windows folder ! While the size of this Winsxs folder, in XP is around 25-50 MB; its large size in Windows 8, Windows 7 and Windows Vista, is intriguing, to many ! Check the image below. The Winsxs folder, stores multiple copies of dll ‘s in order to let multiple applications run in Windows without any compatibility problem. In Winsxs the ‘backup’ folder is the largest as can be noticed in the image below. Again, as can be seen in the image below, in the Winsxs folder, the ‘Other’ File types takes the bulk of the space."}, {"url": "http://www.thewindowsclub.com/winsxs-folder-windows-7-8", "passage_text": "In Windows 7, there isn’t a ‘dllcache’ folder and nor can you find the ‘i386’ folder, where the system caches (like in XP) all it’s source modules. It is this WinSxS folder which stores the shared components of side-by-side applications. These files can be multiple versions of the same assembly or application. In Winsxs the ‘backup’ folder is the largest as can be noticed in the image below. Again, as can be seen in the image below, in the Winsxs folder, the ‘Other’ File types takes the bulk of the space."}]