[{"url": "http://www.goya.com/english/product_subcategory/Condiments/Adobo", "passage_text": "To make all your dishes taste their very best, make sure you shake on Goya Adobo before cooking. Adobo's perfect blend of garlic, oregano and other Latino spices is the perfect seasoning for all your meat, poultry and fish dishes. A simple shake is all it takes."}, {"url": "http://www.chipotlepeppers.net/info/homemade-chipotles-in-adobo-sauce", "passage_text": "1 Add the onion, chipotle peppers, garlic, ketchup, salt, and the browned chicken to the pot. 2  Add enough water to almost cover the chicken. 3  Simmer the chicken adobo mixture over low heat until the chicken is cooked through and tender, about 30 minutes, turning the pieces of chicken occasionally. 1 Add the onion, chipotle peppers, garlic, ketchup, salt, and the browned beef to the pot. 2  Add enough water to almost cover the beef. 3  Simmer the beef adobo mixture over low heat until the beef is cooked through and tender, about 80 minutes. 4  Stir in the coconut milk and cook for around 5 minutes."}, {"url": "http://latinfood.about.com/od/seasoningmarinade/tp/Adobo-Seasoning.htm", "passage_text": "Pork pieces are marinated in the adobo sauce and then grilled. The adobo sauce can be diluted with water or broth to make a simmering liquid. In the Philippines, a dish of marinated meat or fish seasoned with garlic, soy sauce, vinegar, and spices is referred to as Adobo. For example: Chicken Adobo. "}, {"url": "http://www.wisegeek.org/what-is-adobo-sauce.htm", "passage_text": "Adobo sauce is a type of hot sauce or marinade used in Mexican and Southwestern cuisines. Adobo is a Spanish word for sauce or marinade, and the dark red adobo sauce is used in many contexts in Mexican food. Its main ingredients are typically chile peppers, garlic, and vinegar, though variations are common. Tomatoes, onions, and a variety of herbs and spices often complete the recipe. Meatballs in adobo sauce. Garlic is an ingredient of adobo sauce. Cinnamon is often used to season adobo sauce. Chipotle peppers are often used in abodo sauce. Adobo sauce is a Mexican marinade that often uses apple cider vinegar."}, {"url": "http://www.foodnetwork.com/recipes/emeril-lagasse/pork-tenderloins-with-homemade-adobo-sauce-recipe.html", "passage_text": "In a medium saucepan heat the remaining tablespoon of olive oil until hot. Add the remaining 1/4 cup minced onion and remaining 1 1/2 tablespoons of garlic and cook, stirring, until soft, about 4 minutes. Add 1/4 cup plus 2 tablespoons more of the adobo sauce and cook, stirring, for 1 minute. Add the chicken broth and heavy cream and cook until sauce has reduced and is thick enough to coat the back of a spoon, 6 to 8 minutes. Add the chocolate and stir until melted. "}, {"url": "https://en.wikipedia.org/wiki/Adobo", "passage_text": "Peruvian adobo chicken made from dried aji panca (yellow lantern chili, Capsicum chinense). Adobo or Adobar (Spanish: marinade, sauce, or seasoning) is the immersion of raw food in a stock (or sauce) composed variously of paprika, oregano, salt, garlic, and vinegar to preserve and enhance its flavor. The Portuguese variant is known as Carne de vinha d'alhos. Adobo relates to marinated dishes such as chipotles en adobo in which chipotles (smoked ripe jalapeno jalapeño) peppers are stewed in a sauce with, tomatoes, garlic, vinegar, salt and. spices"}, {"url": "http://www.food.com/recipe/homemade-adobo-sauce-476086", "passage_text": "1 Heat a large skillet over medium heat and toast the chiles, turning frequently, until very pliable and soft; do not allow to char. 2  Remove from the skillet and transfer to a plate. 3  Remove the stems and seeds and place in a saucepan. 4  Add enough hot water to just cover and bring to a boil. Directions. 1 "}, {"url": "http://www.foodrepublic.com/recipes/basic-adobo-sauce-recipe/", "passage_text": "You can’t go wrong with this basic guajillo adobo sauce from the excellent Mexican chef Roberto Santibanez, santibañez Whose brooklyn Restaurant fonda is the-go to Haute mexican spot for-in-the Know New. yorkers Cinco De Mayo is today, but there's still time to plan a kick-ass Mexi-menu. You can'"}]