[{"url": "https://labtestsonline.org/understanding/analytes/ck/tab/test", "passage_text": "The Test. A creatine kinase (CK) test may be used to detect inflammation of muscles (myositis) or serious muscle damage and/or to diagnose rhabdomyolysis if a person has signs and symptoms, such as muscle weakness, muscle aches, and dark urine. "}, {"url": "http://www.brighthub.com/science/medical/articles/91229.aspx", "passage_text": "CK is an abbreviation for creatine kinase-also known as CPK-or phosphocreatine kinase. Creatine kinase is a muscle enzyme found in three different types in the human body. In skeletal muscle it’s in the form of CK-MM, in the brain, CK-BB, and in the heart muscle, CK-MB. These forms are known as isoenzymes. "}, {"url": "http://www.anylabtestnow.com/tests/creatine-kinase/", "passage_text": "Creatine kinase (CK) or Creatine phosphokinase (CPK) is an enzyme produced by the muscles. There are three types of CK produced by major muscle groups: the brain, the heart, and the skeletal muscle tissue. When muscle cells are injured or diseased, enzymes leak out of the cells and enter the bloodstream. "}, {"url": "http://www.summitmedicalgroup.com/library/adult_health/tst_ck_total_test/", "passage_text": "This blood test measures an enzyme called creatine kinase (CK) or creatine phosphokinase (CPK). Enzymes are chemicals that help the cells of your body work. Muscle cells make the creatine kinase enzyme. "}, {"url": "http://medical-dictionary.thefreedictionary.com/Creatine+Kinase+Test", "passage_text": "The creatine kinase test measures the blood levels of certain muscle and brain enzyme proteins. Creatine kinase (CK or CPK) is an enzyme (a type of protein) found in muscle and brain. Normally, very little CK is found circulating in the blood. Elevated levels indicate damage to either muscle or brain; possibly from a myocardial infarction (heart attack), muscle disease, or stroke"}, {"url": "http://www.medicalhealthtests.com/askquestion/607/what-is-creatine-kinase-blood-test.html", "passage_text": "Creatine kinase also known as CPK or Creatine phosphokinase is an enzyme that is found in the brain, heart, and skeletal muscles. This enzyme encourages a particular biochemical reaction to occur. CK normally adds phosphate to creatine present in our body and turns it into molecule phosphocreatine which is high-energy. When there is any muscle damage or degeneration the contents from the muscle cells break open and enter the bloodstream. As most of the CPK is found in the body, any increase found in the blood level during a creatine kinase blood test is indicative of muscle damage. A creatine kinase blood test is used to help diagnose the following: 1  It helps in the diagnosis of heart attacks. 2  It can be used to appraise the cause of chest pain"}, {"url": "https://en.wikipedia.org/wiki/Creatine_kinase", "passage_text": "Creatine kinase (CK) — also known as creatine phosphokinase (CPK) or phospho-creatine kinase — is an enzyme (EC 2.7.3.2) expressed by various tissues and cell types. CK catalyses the conversion of creatine and utilizes adenosine triphosphate (ATP) to create phosphocreatine (PCr) and adenosine diphosphate (ADP). Thus creatine kinase is an important enzyme in such tissues. Clinically, creatine kinase is assayed in blood tests as a marker of damage of CK-rich tissue such as in myocardial infarction (heart attack), rhabdomyolysis (severe muscle breakdown), muscular dystrophy, the autoimmune myositides and in acute renal failure."}, {"url": "http://www.urmc.rochester.edu/encyclopedia/content.aspx?ContentTypeID=167&ContentID=creatine_kinase_blood", "passage_text": "This test measures the amount of an enzyme called creatine kinase (CK) in your blood. CK is a type of protein. The muscle cells in your body need CK to function. Levels of CK can rise after a heart attack, skeletal muscle injury, strenuous exercise, or drinking too much alcohol, and from taking certain medicines or supplements."}]