[{"url": "http://people.umass.edu/~mcclemen/581Lipids.html", "passage_text": "The fact that lipids are soluble in organic solvents, but insoluble in water, provides the food analyst with a convenient method of separating the lipid components in foods from water soluble components, such as proteins, carbohydrates and minerals. 5.6.1. Introduction. Foods which contain high concentrations of unsaturated lipids are particularly susceptible to lipid oxidation. Lipid oxidation is one of the major forms of spoilage in foods, because it leads to the formation of off-flavors and potentially toxic compounds."}, {"url": "https://en.wikipedia.org/wiki/Hydrogenation", "passage_text": "Hydrogenation – to treat with hydrogen – is a chemical reaction between molecular hydrogen (H 2) and another compound or element, usually in the presence of a catalyst such as nickel, palladium or platinum. The process is commonly employed to reduce or saturate organic compounds. "}, {"url": "http://people.umass.edu/~mcclemen/581Lipids.html", "passage_text": "Introduction. In addition to their nutritional importance lipids are also used in foods because of their characteristic physicochemical properties, such as mouthfeel, flavor, texture and appearance. They are also used as heat transfer agents during the preparation of other foods, e.g. for frying. 5.6.1. Introduction. Foods which contain high concentrations of unsaturated lipids are particularly susceptible to lipid oxidation. Lipid oxidation is one of the major forms of spoilage in foods, because it leads to the formation of off-flavors and potentially toxic compounds."}, {"url": "http://2012books.lardbucket.org/books/an-introduction-to-nutrition/s09-06-lipids-and-the-food-industry.html", "passage_text": "This is “Lipids and the Food Industry”, section 5.6 from the book An Introduction to Nutrition (v. 1.0). For details on it (including licensing), click here. This book is licensed under a Creative Commons by-nc-sa 3.0 license. 1 Food manufacturers favor the use of hydrogenated oils because they do not succumb to oxidative damage, they increase the shelf life of food products, and they have a high smoking point. 2  Fat replacers mimic fat but do not have the same chemical configuration as fat."}, {"url": "https://en.wikipedia.org/wiki/Food_chemistry", "passage_text": "This makes them amphiphilic molecules (having both hydrophobic and hydrophilic portions). In the case of cholesterol, the polar group is a mere-OH (hydroxyl or alcohol). Lipids in food include the oils of such grains as corn, soybean, from animal fats, and are parts of many foods such as milk, cheese, and meat. They also act as vitamin carriers as well."}, {"url": "http://people.umass.edu/~mcclemen/581Lipids.html", "passage_text": "The principle physicochemical characteristics of lipids (the  analyte ) used to distinguish them from the other components in foods (the matrix) are their solubility in organic solvents, immiscibility with water, physical characteristics (e.g., relatively low density) and spectroscopic properties. 5.6.1. Introduction. Foods which contain high concentrations of unsaturated lipids are particularly susceptible to lipid oxidation. Lipid oxidation is one of the major forms of spoilage in foods, because it leads to the formation of off-flavors and potentially toxic compounds."}, {"url": "http://www.ncbi.nlm.nih.gov/pubmed/10335367", "passage_text": "Food lipids are principally triacylglycerides, phospholipids and sterols found naturally in most biological materials consumed as food and added as functional ingredients in many processed foods. The effects of all processing steps, including raw product selection, harvesting, storage, refining, manufacturing and distribution, on the quality of lipids in the final commodity are considerable."}, {"url": "http://2012books.lardbucket.org/books/an-introduction-to-nutrition/s09-06-lipids-and-the-food-industry.html", "passage_text": "When lipids are subjected to hydrogenation, the molecular structure of the fat is altered. Hydrogenation is the process of adding hydrogen to unsaturated fatty-acid chains, so that the hydrogen atoms are connected to the points of saturation and results in a more saturated fatty acid. 1 Food manufacturers favor the use of hydrogenated oils because they do not succumb to oxidative damage, they increase the shelf life of food products, and they have a high smoking point. 2  Fat replacers mimic fat but do not have the same chemical configuration as fat."}, {"url": "http://www.ncbi.nlm.nih.gov/pubmed/10335367", "passage_text": "The presence of fat significantly enhances the organoleptic perception of foods, which partly explains the strong preference and market advantage of fat-rich foods. As a class, lipids contribute many desirable qualities to foods, including attributes of texture, structure, mouthfeel, flavor and color. The effects of all processing steps, including raw product selection, harvesting, storage, refining, manufacturing and distribution, on the quality of lipids in the final commodity are considerable."}, {"url": "http://2012books.lardbucket.org/books/an-introduction-to-nutrition/s09-06-lipids-and-the-food-industry.html", "passage_text": "Manufacturers favor hydrogenation as a way to prevent oxidation of oils and ensure longer shelf life. Partially hydrogenated vegetable oils are used in the fast food and processed food industries because they impart the desired texture and crispness to baked and fried foods. 1 Food manufacturers favor the use of hydrogenated oils because they do not succumb to oxidative damage, they increase the shelf life of food products, and they have a high smoking point. 2  Fat replacers mimic fat but do not have the same chemical configuration as fat."}]