[{"url": "https://en.wikipedia.org/wiki/Sequela", "passage_text": "A sequela (UK /sɨˈkwiːlə/ , US /sɨˈkwɛlə/ ; usually used in the plural, sequelae) is a pathological condition resulting from a disease, injury, therapy, or other trauma. Typically, a sequela is, in medical language, a chronic condition that is a complication of an acute condition that begins during that acute condition. In ordinary language it may be described as a further condition that is different from, but a consequence of, the first condition. Chronic kidney disease, for example, is sometimes a sequela of diabetes, chronic constipation or more accurately obstipation (that is, difficulty in passing stool) is a sequela to an intestinal obstruction, and neck pain is a common sequela of whiplash or other trauma to the cervical vertebrae."}, {"url": "http://www.thefreedictionary.com/sequelae", "passage_text": "Noun. 1. sequela-any abnormality following or resulting from a disease or injury or treatment; paralysis is one of the sequelae of poliomyelitis. abnormalcy, abnormality-an abnormal physical condition resulting from defective genes or developmental deficiencies. Translations. n. pl. se·quel·ae (-kwĕl′ē). 1. A pathological condition resulting from a disease. 2. A secondary consequence or result. [Latin. , sequel; see sequel .]"}, {"url": "http://medical-dictionary.thefreedictionary.com/Sequel%c3%a6", "passage_text": "[sikwē′lə] pl. sequelae. Etymology: L, sequi, to follow. any abnormal condition that follows and is the result of a disease, treatment, or injury, such as paralysis after poliomyelitis, deafness after treatment with an ototoxic drug, or scar formation after a laceration. "}, {"url": "http://dictionary.cambridge.org/us/dictionary/english/sequela", "passage_text": "sequela noun [C]. › a ​result or ​condition that ​follows from a ​disease or ​illness: ​neurological sequelae Mild ​cognitive ​impairment is a sequela of having ​multiple concussions while ​playing ​football. (Definition of sequela from the Cambridge Advanced Learners Dictionary & Thesaurus © Cambridge University Press). The answer may seem obvious, but the use of this word can lead to confusion. In the UK and Ireland the word traditionally meant the number 1,000,000,000,000 (a million millions), which is called a trillion in the United States."}, {"url": "http://www.merriam-webster.com/dictionary/sequela", "passage_text": "Definition of SEQUELA. 1. : an aftereffect of a disease, condition, or injury. 2. : a secondary result. 1. : an aftereffect of a disease, condition, or injury"}, {"url": "http://medical-dictionary.thefreedictionary.com/sequelae", "passage_text": "[sikwē′lə] pl. sequelae. Etymology: L, sequi, to follow. any abnormal condition that follows and is the result of a disease, treatment, or injury, such as paralysis after poliomyelitis, deafness after treatment with an ototoxic drug, or scar formation after a laceration. "}, {"url": "http://www.audioenglish.org/dictionary/sequela.htm", "passage_text": "• SEQUELA (noun). The noun SEQUELA has 1 sense: 1. any abnormality following or resulting from a disease or injury or treatment. Familiarity information: SEQUELA used as a noun is very rare. "}, {"url": "http://www.oxforddictionaries.com/definition/english/sequela", "passage_text": "1 Aggressive treatment of suspected pelvic inflammatory disease reduces late sequelae. 2  But depressive syndromes sometimes occur as sequelae to physical illness such as viral infection and may overlap with fatigue syndromes. "}]