[{"url": "https://en.wikipedia.org/wiki/Valence_electron", "passage_text": "In chemistry, a valence electron is an electron that is associated with an atom, and that can participate in the formation of a chemical bond; in a single covalent bond, both atoms in the bond contribute one valence electron in order to form a shared pair. Like an electron in an inner shell, a valence electron has the ability to absorb or release energy in the form of a photon. An energy gain can trigger an electron to move (jump) to an outer shell; this is known as atomic excitation."}, {"url": "https://en.wikipedia.org/wiki/VSEPR_theory", "passage_text": "The number of electron pairs in the valence shell of a central atom is determined after drawing the Lewis structure of the molecule, and expanding it to show all bonding groups and lone pairs of electrons. The premise of VSEPR is that the valence electron pairs surrounding an atom tend to repel each other, and will therefore adopt an arrangement that minimizes this repulsion, thus determining the molecule's geometry."}, {"url": "https://en.wikipedia.org/wiki/Electron_affinity", "passage_text": "E ea generally increases across a period (row) in the periodic table. This is caused by the filling of the valence shell of the atom; a Group 17 atom releases more energy than a Group 1 atom on gaining an electron because it obtains a filled valence shell and therefore is more stable. A trend of decreasing E ea going down the groups in the periodic table might be expected."}, {"url": "https://en.wikibooks.org/wiki/High_School_Chemistry/Electron_Configurations_of_Main_Group_Elements", "passage_text": "1 All elements in the second column of the Periodic Table have 2 valence electrons in an s orbital. 2  These elements are known as Group 2A metals or alkaline earth metals. 3  All elements in column 3A of the Periodic Table have 2 valence electrons in an s orbital and 1 valence electron in a p orbital. 1 All elements in the first column of the Periodic Table have 1 valence electron in an s orbital. 2  These elements are known as Group 1A metals or alkali metals. 3 "}, {"url": "https://en.wikipedia.org/wiki/VSEPR_theory", "passage_text": "Valence shell electron pair repulsion (VSEPR) theory is a model used, in chemistry, to predict the geometry of individual molecules from the number of electron pairs surrounding their central atoms. The premise of VSEPR is that the valence electron pairs surrounding an atom tend to repel each other, and will therefore adopt an arrangement that minimizes this repulsion, thus determining the molecule's geometry."}, {"url": "http://www.mhhe.com/physsci/chemistry/chang7/esp/folder_structure/bo/m3/s2/bom3s2_7.htm", "passage_text": "Electron Groups. In determining the geometry of molecules, the valence shell electron pair repulsion model, or VSEPR, assumes that repulsions between electron pairs causes them to remain as far apart as possible. The geometry that the molecule ultimately adopts minimizes the repulsion between electron pairs."}, {"url": "http://www.chm.uri.edu/cbrittain/molecular_geometry.pdf", "passage_text": "This is the “Valence Shell Electron Pair Repulsion” (VSEPR) Theory. Thus, the “Electron Group” geometry of each central atom in a structure can be determined by simply counting the number of “groups” of electrons around the atom, then considering how those groups would arrange themselves to be as far apart as possible. A “ group ” of electrons can be a single bond, double bond, triple bond, or a lone pair of electrons. The table below indicates the “Molecular Geometry” of the central atom depending on whether the groups of electrons around it are covalent bonds to other atoms or simply lone pairs"}, {"url": "http://www.flashcardmachine.com/chemical-bonding-ii.html", "passage_text": "Definition. a molecule with four or more electron groups would have tetrahedral geometry; there is one group at the top of the central atom, and three groups that are at 109.5 degree angles around the axis in the lower portion. "}, {"url": "http://www.chm.uri.edu/cbrittain/molecular_geometry.pdf", "passage_text": "But – IF an electron group is a LONE PAIR, there is NO ATOM VISIBLE to “ Mark that Corner” of the geometry. Remember – You can only “see” the ATOMS; you CANNOT “see” the ELECTRONS. A “ group ” of electrons can be a single bond, double bond, triple bond, or a lone pair of electrons. The table below indicates the “Molecular Geometry” of the central atom depending on whether the groups of electrons around it are covalent bonds to other atoms or simply lone pairs"}]