[{"url": "http://california.hometownlocator.com/ca/los-angeles/culver-city.cfm", "passage_text": "The primary coordinate point for Culver City is located at latitude 34.0058 and longitude -118.3968 in Los Angeles County. The formal boundaries for the City of Culver City (see map below) encompass a land area of 5.11 sq. miles and a water area of 0.03 sq. miles. Los Angeles County is in the Pacific time zone (GMT -8). The elevation is 95 feet. Culver City, CA-Peer Comparisons by Rank and Percentile. The table below compares Culver City to the other 1,523 incorporated cities, towns and CDPs in California by rank and percentile using July 1, 2015 data."}, {"url": "https://en.wikipedia.org/wiki/Culver_City,_California", "passage_text": "Since the 1920s, Culver City has been a significant center for motion picture and later television production, best known as the home of Metro-Goldwyn-Mayer studios. It was also the headquarters for the Hughes Aircraft Company from 1932 to 1985. In the California State Legislature, Culver City is in the 30th Senate District, represented by Democrat Holly Mitchell, and in the 54th Assembly District, represented by Democrat Sebastian Ridley-Thomas."}, {"url": "http://publichealth.lacounty.gov/place/CulverCity.htm", "passage_text": "The Vision of the Culver City Initiative is three-fold: 1. To create a city where residents, workers, businesses, schools/colleges, transit systems are interconnected 2. For residents of all ages to walk and bicycle safely and comfortably in their community and 3. Policy Change: Culver City is using PLACE Program funds to develop the City s first complete Bicycle and Pedestrian Master Plan. This plan intends to improve the conditions for cycling and walking citywide by implementing policies, programs, and streetscape improvements that encourage safe biking and walking."}, {"url": "http://www.culvercitypolicestation.com/", "passage_text": "The Culver City Police Station is located at 4040 Duquesne Avenue Culver City, CA 90232. For inmate information call (888) 338-5824. If a loved one is arrested by Culver City PD and the individual is a male, he will be booked into that Jail Facility. Females are transported to a womens facility. "}, {"url": "https://www.inmateaid.com/prisons/culver-city-jail", "passage_text": "Los Angeles County. City Jail. Culver City Jail is a City Jail used by the jurisdictions of Culver City to confine inmates for short periods while awaiting trial or processing. As inmates are staying for only a short period, it has fewer amenities than a jail or prison."}, {"url": "http://california.hometownlocator.com/ca/los-angeles/culver-city.cfm", "passage_text": "The City of Culver City had a population of 39,201 as of July 1, 2015. Culver City ranks in the upper quartile for Population Density when compared to the other cities, towns and Census Designated Places (CDPs) in California. Culver City, CA-Peer Comparisons by Rank and Percentile. The table below compares Culver City to the other 1,523 incorporated cities, towns and CDPs in California by rank and percentile using July 1, 2015 data."}, {"url": "http://www.sale-tax.com/CulverCityCA", "passage_text": "Culver City, CA Sales Tax Rate. The current total local sales tax rate in Culver City, CA is 9.500% . The December 2014 total local sales tax rate was also 9.500% "}, {"url": "https://en.wikipedia.org/wiki/Culver_City,_California", "passage_text": "Culver City is a city in western Los Angeles County, California. As of the 2010 census, the city had a population of 38,883. It is mostly surrounded by the city of Los Angeles, but also shares a border with unincorporated areas of Los Angeles County. Over the years, considering its incorporated status, over forty annexations of adjoining areas have occurred. In the California State Legislature, Culver City is in the 30th Senate District, represented by Democrat Holly Mitchell, and in the 54th Assembly District, represented by Democrat Sebastian Ridley-Thomas."}]