[{"url": "https://en.wikipedia.org/wiki/Eurasian_sparrowhawk", "passage_text": "Within the family Accipitridae, the Eurasian sparrowhawk is a member of the large genus Accipiter, which consists of small to medium-sized woodland hawks. Most of the Old World members of the genus are called sparrowhawks or goshawks. The Eurasian sparrowhawk is a small bird of prey with short, broad wings and a long tail, both adaptations to manoeuvring through trees. Females can be up to 25% larger than males and weigh up to twice as much."}, {"url": "https://en.wikipedia.org/wiki/Eurasian_sparrowhawk", "passage_text": "The Eurasian sparrowhawk (Accipiter nisus), also known as the northern sparrowhawk or simply the sparrowhawk, is a small bird of prey in the family Accipitridae. The Eurasian sparrowhawk is a small bird of prey with short, broad wings and a long tail, both adaptations to manoeuvring through trees. Females can be up to 25% larger than males and weigh up to twice as much."}, {"url": "https://simple.wikipedia.org/wiki/Sparrowhawk", "passage_text": "The sparrowhawk (Accipiter nisus) is a small bird of prey in the family Accipitridae. It has a wide distrution in Eurasia and north Africa. The adult male sparrowhawk has a blue-grey back and wings. The sparrowhawk is part of the family Accipitridae and the genus Accipiter. Some English people used to call the sparrowhawk the blue hawk because of the male's colour. Other old names include spar hawk, spur hawk and stone falcon."}, {"url": "https://en.wikipedia.org/wiki/Eurasian_sparrowhawk", "passage_text": "The Eurasian sparrowhawk was described by Linnaeus in his 18th century work, Systema Naturae, as Falco nisus, but moved to its present genus by French zoologist Mathurin Jacques Brisson in 1760. The current scientific name is derived from the Latin accipiter, meaning 'hawk' and nisus, the sparrowhawk. The Eurasian sparrowhawk is a small bird of prey with short, broad wings and a long tail, both adaptations to manoeuvring through trees. Females can be up to 25% larger than males and weigh up to twice as much."}, {"url": "https://en.wikipedia.org/wiki/Sparrowhawk", "passage_text": "Sparrow-hawk or sparhawk originally referred to Accipiter nisus, now called Eurasian or northern sparrowhawk to distinguish it from other species. The American kestrel (Falco sparverius), a North American falcon species, is also commonly referred to as a sparrowhawk. Hawk species include: 1  Chestnut-flanked sparrowhawk, A. castanilius. 2  Collared sparrowhawk, A. cirrocephalus. 3  Eurasian sparrowhawk, A. nisus. 4  Chinese sparrowhawk, A. soloensis. 5  Spot-tailed sparrowhawk, A. trinotatus."}, {"url": "http://www.merriam-webster.com/dictionary/sparrow%20hawk", "passage_text": "Definition of SPARROW HAWK. : any of various small hawks: as a: an Old World accipiter (Accipiter nisus) that is dark gray to blackish above with the female having a grayish-brown barred underside and the male having a chestnut barred underside b: kestrel b. See sparrow hawk defined for kids. ADVERTISEMENT"}, {"url": "https://en.wikipedia.org/wiki/Sparrowhawk", "passage_text": "Sparrowhawk (sometimes sparrow hawk) may refer to several species of small hawk in the genus Accipiter. Hawk species include: 1  Chestnut-flanked sparrowhawk, A. castanilius. 2  Collared sparrowhawk, A. cirrocephalus. 3  Eurasian sparrowhawk, A. nisus. 4  Chinese sparrowhawk, A. soloensis. 5  Spot-tailed sparrowhawk, A. trinotatus."}, {"url": "https://en.wikipedia.org/wiki/Eurasian_sparrowhawk", "passage_text": "The Eurasian sparrowhawk is found throughout the temperate and subtropical parts of the Old World; while birds from the northern parts of the range migrate south for winter, their southern counterparts remain resident or make dispersive movements. The Eurasian sparrowhawk is a small bird of prey with short, broad wings and a long tail, both adaptations to manoeuvring through trees. Females can be up to 25% larger than males and weigh up to twice as much."}, {"url": "http://www.bbc.co.uk/nature/life/Eurasian_Sparrowhawk", "passage_text": "Sparrowhawk. Sparrowhawks are so-named because 98% of their diet consists of other birds. Although sparrowhawk numbers declined very badly as a result of pesticide use, the British population has now recovered almost everywhere and there may be as many sparrowhawks breeding as kestrels. All you need to know about British birds"}]