[{"url": "https://en.wikipedia.org/wiki/Echinacea", "passage_text": "Echinacea /ˌɛkɨˈneɪʃⁱə/ is a genus, or group of herbaceous flowering plants in the daisy family. The Echinacea genus has nine species, which are commonly called purple coneflowers. They are found only in eastern and central North America, where they are found growing in moist to dry prairies and open wooded areas. They have large, showy heads of composite flowers, blooming from early to late summer. Some species are cultivated in gardens for their showy flowers. Echinacea purpurea is used in folk medicine. Two of the species, E. tennesseensis and E. laevigata, are listed in the United States as endangered species."}, {"url": "http://www.webmd.com/vitamins-supplements/ingredientmono-981-ECHINACEA.aspx?activeIngredientId=981&activeIngredientName=ECHINACEA", "passage_text": "Echinacea is also used against many other infections including the flu, urinary tract infections, vaginal yeast infections, genital herpes, bloodstream infections (septicemia), gum disease, tonsillitis, streptococcus infections, syphilis, typhoid, malaria, and diphtheria. 1 A tablet containing 100 mg of a proprietary Echinacea angustifolia root extract (Monoselect Echinacea, PharmExtracta, Italy): 2 tablets daily for 15 days, then 1 tablet daily for 15 days, then 1 tablet every other day for 60 days to help prevent colds and the flu."}, {"url": "http://forums2.gardenweb.com/discussions/1592217/how-do-echinacea-and-portulaca-seeds-look", "passage_text": "I have lots of Echinacea right now, their heads are brown, with almost black spikes. I was looking for the seeds at the base of the spikes, but what I find there is soft, sort of triangular shaped, does not look like a seed to me. And the portulaca were gorgeous all summer, with double flower heads. I would like to safe money next year by starting them from seed."}, {"url": "http://www.gardenguides.com/499-coneflower-echinacea-purpurea-garden-basics-flower-perennial.html", "passage_text": "Coneflower (Echinacea purpurea). Echinacea, popularly known as coneflower, has created a sensation among those who like to dabble in herbal health. German medical studies have proven that echinacea does indeed boost the immune system, and is useful in treating a number of common ailments. There are nine species of echinacea, but the flowers we are most familiar with come from the species E. purpurea. This includes the popular purple coneflower and its white cousin, 'swan' . Given rich, amended soil, plants reach a height of 3 to 4 feet and produce flowers 4 to 6 inches across."}, {"url": "http://www.webmd.com/vitamins-supplements/ingredientmono-981-ECHINACEA.aspx?activeIngredientId=981&activeIngredientName=ECHINACEA", "passage_text": "Echinacea is an herb. Several species of the echinacea plant are used to make medicine from its leaves, flower, and root. Echinacea is widely used to fight infections, especially the common cold and other upper respiratory infections. 1 A tablet containing 100 mg of a proprietary Echinacea angustifolia root extract (Monoselect Echinacea, PharmExtracta, Italy): 2 tablets daily for 15 days, then 1 tablet daily for 15 days, then 1 tablet every other day for 60 days to help prevent colds and the flu."}, {"url": "http://www.gardenandflowers.com/facts_5200060_purple-coneflower-seedling-identification.html", "passage_text": "Purple Coneflower Seedling Identification. Echinacea, more commonly called purple coneflower, is an herbaceous flowering plant that is grown not only for its beauty but also for its legendary health benefits. The roots of the flower are believed to prevent or shorten the effects of the common cold. Next, closely observe the surface of the leaves. The long thin leaves should be slightly fuzzy, and the smaller oval leaves should not be fuzzy. If your leaves do not look like this, the plant is most likely a weed and not a coneflower seedling."}, {"url": "http://www.webmd.com/vitamins-supplements/ingredientmono-981-ECHINACEA.aspx?activeIngredientId=981&activeIngredientName=ECHINACEA", "passage_text": "1 Echinacea purpurea herb juice: a daily dose of 6-9 mL for up to a maximum of 8 weeks. 2  Echinacea purpurea herb juice has also been used in a dose of 20 drops every 2 hours for the first day followed by 20 drops three times daily until cold or flu symptoms improve. 1 A tablet containing 100 mg of a proprietary Echinacea angustifolia root extract (Monoselect Echinacea, PharmExtracta, Italy): 2 tablets daily for 15 days, then 1 tablet daily for 15 days, then 1 tablet every other day for 60 days to help prevent colds and the flu."}, {"url": "http://www.webmd.com/drugs/2/drug-18272/echinacea-root-oral/details", "passage_text": "Uses. Echinacea has been used for virus infections such as the common cold and flu. It is used to strengthen the immune system. It has also been used for returning vaginal fungal infections ( yeast infections ) along with antifungal products applied to the vaginal area"}, {"url": "http://www.webmd.com/vitamins-supplements/ingredientmono-981-ECHINACEA.aspx?activeIngredientId=981&activeIngredientName=ECHINACEA", "passage_text": "There is not enough information to know if echinacea is safe for long-term use. Some side effects have been reported such as fever, nausea, vomiting, unpleasant taste, stomach pain, diarrhea, sore throat, dry mouth, headache, numbness of the tongue, dizziness, insomnia, disorientation, and joint and muscle aches. 1 A tablet containing 100 mg of a proprietary Echinacea angustifolia root extract (Monoselect Echinacea, PharmExtracta, Italy): 2 tablets daily for 15 days, then 1 tablet daily for 15 days, then 1 tablet every other day for 60 days to help prevent colds and the flu."}]