[{"url": "https://en.wikipedia.org/wiki/Hearing_range", "passage_text": "A basic measure of hearing is afforded by an audiogram: a graph of the minimum discernible sound level at various frequencies throughout an organism's nominal hearing range. Behavioural hearing tests or physiological tests can be used to find hearing thresholds of humans and other animals. Their hearing range varies by species; at the lowest it can be 1 kHz for some species and for other species the highest reaches up to 200 kHz. Bats that can detect 200 kHz cannot hear very well below 10 kHz. In any case, the most sensitive range of bat hearing is narrower: about 15 kHz to 90 kHz"}, {"url": "http://www.firstyears.org/lib/howtoread.htm", "passage_text": "Rather, it is the softest sound that a person with normal hearing ability would be able to detect at least 50% of the time. (Some audiograms, in fact, begin at -10 dB HL or lower.). Audiologists consider 0 -15 dB HL to be normal hearing in children (0 - 25 dB HL in adults). In the audiogram to the left, the white area represents the sounds that the child cannot hear (softer than his/her thresholds) and the yellow area indicates all of the sounds that the child can hear (louder than his/her thresholds). Recall that audiologists consider 0-15 dB HL to be normal in children."}, {"url": "http://www.chimehealth.co.uk/web/data/audiogram-hearing-loss-examples-2.pdf", "passage_text": "This loudness is measured in a scale called decibels (dB). Any points that are heard at 20dB or quieter are considered to be within the normal range.The lower down the graph the points are plotted, the worse the hearing. The different shaded areas indicate the different classifications of hearing loss. The audiogram below shows the sounds have to be made louder before they are heard in the high frequencies (the right side of the audiogram), leading to a slope on the audiogram as seen below. This audiogram shows normal hearing up to 1KHz (mid frequency) and a mild hearing loss in the mid to high frequencies."}, {"url": "http://www.hearingdirect.com/pages/Guide-To-Hearing.html", "passage_text": "At the end of a hearing test you may be told that you have normal hearing or a mild, moderate, severe or profound loss of hearing. The image below shows an example of an audiogram. Hearing loss is measured in decibels hearing level (dB HL). Audiology & Speech Pathology. My name is Joan, your audiologist here at HearingDirect.com. The following is a guide to hearing that covers many of the questions I receive on a regular basis about all things hearing. I am constantly adding to the information featured here based on your feedback and questions."}, {"url": "http://www.audiologyonline.com/ask-the-experts/standards-for-normal-hearing-357", "passage_text": "I can't figure out how to interpret my audiogram. I keep finding different standards for 'normal limits.' Some say it is 0-20 db, others 0-15 db. Some say it is 0-15 db for children and 0-25 db for adults. And yet others make it seem as though 0 db is the average threshold at all frequencies for 'normal hearing' young adults. The results themselves, however, fall in a bell-shaped curve, in exactly the same way that other human dimensions do (think average height, weight, age for example). The lower limits of what is considered normal gets influenced by how the information is going to be used."}, {"url": "https://en.wikipedia.org/wiki/Hearing_range", "passage_text": "The human range is commonly given as 20 to 20,000 Hz, though there is considerable variation between individuals, especially at high frequencies, and a gradual loss of sensitivity to higher frequencies with age is considered normal. Their hearing range varies by species; at the lowest it can be 1 kHz for some species and for other species the highest reaches up to 200 kHz. Bats that can detect 200 kHz cannot hear very well below 10 kHz. In any case, the most sensitive range of bat hearing is narrower: about 15 kHz to 90 kHz"}, {"url": "http://www.hearingdirect.com/pages/Guide-To-Hearing.html", "passage_text": "When this occurs, the hearing loss is referred to as a mixed hearing loss. Noise-induced hearing loss. A common cause of hearing loss is caused through prolonged exposure to harmful sound (noise) or a sudden brief but intense noise like an explosion to the ear. The nature of noise-induced hearing loss is sensorineural, and at present, can only be helped and not cured. Audiology & Speech Pathology. My name is Joan, your audiologist here at HearingDirect.com. The following is a guide to hearing that covers many of the questions I receive on a regular basis about all things hearing. I am constantly adding to the information featured here based on your feedback and questions."}]