[{"url": "http://www.answers.com/Q/Does_prince_the_artist_have_children", "passage_text": "Prince had a son back in October 1996 with his wife Mayte Garcia-Nelson. The child died a week later from complications of Pfieffer's syndrome Type 2, a rare skull deformity. … Read more: http://wiki.answers.com/Q/Does_the_singer_prince_have_children#ixzz22hKfNM11. 21 people found this useful."}, {"url": "http://www.answers.com/Q/Does_the_singer_prince_have_children", "passage_text": "He married his singer and dancer Mayte Garcia on Valentine's Day 1996. They had a child that has a genetic disorder a … nd lasted a week. The couple separated in 1998 and formally divorced on June 2000. On New Year's Eve 2001, Prince married Manuela Testolini, a former Paisley Park employee in a hush-hush ceremony."}, {"url": "http://prince.answers.wikia.com/wiki/Does_Prince_have_any_children", "passage_text": "360 pages on this wiki. No, he does not. Though married twice, Prince does not have any children. His first wife, Mayte, did get pregnant but sadly gave birth to a child with severe birth defects (Pfeiffer's syndrome). It did not live long. Categories :"}, {"url": "http://www.answers.com/Q/Does_the_singer_prince_have_children", "passage_text": "Prince had a son back in October 1996 with his wife Mayte Garcia-Nelson. The child died a week later from complications of Pfieffer's syndrome Type 2, a rare skull deformity. … Read more: http://wiki.answers.com/Q/Does_the_singer_prince_have_children#ixzz22hKfNM11."}, {"url": "http://www.answers.com/Q/Does_prince_the_artist_have_children", "passage_text": "Prince Edward has two children with his spouse Sophie, Countess of  Wessex. Their names are Lady Louise Windsor and James, Viscount  Severn."}, {"url": "http://www.themortonreport.com/blog/which-royal-love-child-story-did-princess-diana-believe/", "passage_text": "The existence of royal love children is an interesting subject. Although history is littered with examples, only two children fathered by living royals have been officially acknowledged in recent times: Prince Albert of Monaco has admitted that he is the father of Jazmin Grace Grimaldi and Alexandre Coste."}]