[{"url": "http://www.heraldtribune.com/apps/pbcs.dll/article?AID=/20101101/VISIT/302239841/2130/FEATURES", "passage_text": "That's the color of an alligator in the popular imagination. The mascot for the University of Florida is green and the emblem on a Lacoste shirt is green. The only problem, Yon points out, is that alligators are not green. Alligators are black with pale underbellies. When they're dry, the top of their hides sometimes looks gray."}, {"url": "http://tracker.cci.fsu.edu/alligator/about/who/", "passage_text": "American alligators are the largest members of the class Reptilia that inhabit North America. The term Reptilia is Latin for the phrase “to creep.” Alligators share the order Crocodylia with crocodiles, caimans, and gavials⎯all which are large, voracious animals that live in or near water. Alligators and caimans make up the family Alligatoridae, but alligators have their own genus, Alligator. There are two living species of Alligators, the American alligator and the Chinese alligator. The species that lives in United States is known as the Alligator mississippiensis"}, {"url": "http://www.coloring.ws/alligator1.htm", "passage_text": "The easiest to identify difference between an alligator and a crocodile is that when it's mouth is closed, a crocodile's bottom teeth show while an alligator's doesn't (though you'll often see some of the alligator's front, top teeth). "}, {"url": "http://animals.nationalgeographic.com/animals/reptiles/american-alligator/", "passage_text": "The largest American alligator ever reported was supposedly 19.8 ft (6 m) long, although there are doubts about the claim. Size relative to a 6-ft (2-m) man: The American alligator is a rare success story of an endangered animal not only saved from extinction but now thriving. State and federal protections, habitat preservation efforts, and reduced demand for alligator products have improved the species' wild population to more than one million and growing today. "}, {"url": "http://www.answers.com/Q/What_is_a_color_of_a_alligator", "passage_text": "Alligator's colors range from charcoal grey to black with a creamish to yellow banding. In older Alligators, this banding may no longer be seen/and or will become invisible. They eat whatever will fit into their mouths, just like an alligator. Gars eat alligators, and alligators can eat gars. An … alligator will attack something bigger than it can eat in one sitting and sink it to the bottom and store it. A gar is a fish, and as such they are mobile and snatch what they can eat and run."}, {"url": "https://en.wikipedia.org/wiki/American_alligator", "passage_text": "The American alligator (Alligator mississippiensis), sometimes referred to colloquially as a gator or common alligator, is a large crocodilian reptile endemic to the southeastern United States. They are preyed on by large fish, birds, raccoons, and adult alligators. Mother alligators eventually become more aggressive towards their young, which encourages them to disperse. Young alligators grow 3–8 in (7.6–20.3 cm) a year and reach adulthood at 6 ft (1.8 m). An alligator can live up to 50 years."}, {"url": "https://en.wikipedia.org/wiki/American_alligator", "passage_text": "It is one of two living species in the genus Alligator within the family Alligatoridae; it is larger than the other extant alligator species, the Chinese alligator. Adult male American alligators measure up to 3.4 to 4.6 m (11 to 15 ft) in length, and can weigh up to 453 kg (999 lb). They are preyed on by large fish, birds, raccoons, and adult alligators. Mother alligators eventually become more aggressive towards their young, which encourages them to disperse. Young alligators grow 3–8 in (7.6–20.3 cm) a year and reach adulthood at 6 ft (1.8 m). An alligator can live up to 50 years."}, {"url": "https://en.wikipedia.org/wiki/American_alligator", "passage_text": "Alligators are apex predators and consume fish, amphibians, reptiles, birds, and mammals. Hatchlings feed mostly on invertebrates. They play an important role as ecosystem engineers in wetland ecosystems through the creation of alligator holes, which provide both wet and dry habitats for other organisms. They are preyed on by large fish, birds, raccoons, and adult alligators. Mother alligators eventually become more aggressive towards their young, which encourages them to disperse. Young alligators grow 3–8 in (7.6–20.3 cm) a year and reach adulthood at 6 ft (1.8 m). An alligator can live up to 50 years."}, {"url": "https://en.wikipedia.org/wiki/Alligator", "passage_text": "An alligator is a crocodilian in the genus Alligator of the family Alligatoridae. The two living species are the American alligator (A. mississippiensis) and the Chinese alligator (A. sinensis). In addition, several extinct species of alligator are known from fossil remains. "}]