[{"url": "http://work.chron.com/much-philosophy-professor-make-year-8750.html", "passage_text": "State Earnings. Vermont was the most lucrative state for philosophy and religion professors, where they made an average of $94,440 per year. The next highest-paying state was Massachusetts, where the average salary was $90,550 per year. Of the three primary industries of employment, religious and philosophy professors earned the most working for colleges, universities and professional schools, where they took in an average of $72,210 per year. They made $68,650 per year working at junior colleges, and $46,940 per year at religious organizations."}, {"url": "http://www.cupahr.org/surveys/files/salary2014/FHE4-2014-Executive-Summary.pdf", "passage_text": "© 2014 CUPA-HR 2 2013–14 Faculty in Higher Education Salary Survey Acknowledgments Publication of the 2013–14 Faculty in Higher Education Salary Survey for Four-Year Colleges and Universities marks the 33 rd year for this survey, previously known as the National Faculty Salary Survey. © 2014 CUPA-HR 8 2013–14 Faculty in Higher Education Salary Survey Tenured/Tenure-Track Faculty Salaries. Salary Increases Overall and by Affiliation. Approximately 89% (705) of the institutions participating in the 2013 -14 survey also. completed the 2012-13 survey."}, {"url": "http://www.higheredjobs.com/salary/salaryDisplay.cfm?SurveyID=24", "passage_text": "Tenured/Tenure-Track Faculty Salaries. Below are results of the 2012-13 Faculty in Higher Education Salary Survey by Discipline, Rank and Tenure Status in Four-Year Colleges and Universities conducted by The College and University Professional Association for Human Resources (CUPA-HR). Findings reflect the salaries of 184,924 tenured/tenure-track faculty members at 794 institutions nationwide."}, {"url": "http://www.salarylist.com/jobs/Religion-Professor-Salary.htm", "passage_text": "Religion Professor Salary. Religion Professor average salary is $35,900, median salary is $- with a salary range from $33,500 to $38,300. Religion Professor salaries are collected from government agencies and companies. Each salary is associated with a real job position. Religion Professor salary is full-time annual starting salary. Intern, contractor and hourly pay scale vary from regular exempt employee. Compensation depends on work experience, job location, bonus, benefits and other factors."}, {"url": "http://www.salarylist.com/jobs/Assistant-Professor-Of-Religion-Salary.htm", "passage_text": "Assistant Professor Of Religion Salary. Assistant Professor Of Religion average salary is $52,376, median salary is $52,248 with a salary range from $38,500 to $75,000. Assistant Professor Of Religion salaries are collected from government agencies and companies. Each salary is associated with a real job position. Assistant Professor Of Religion salary is full-time annual starting salary. Intern, contractor and hourly pay scale vary from regular exempt employee."}, {"url": "http://work.chron.com/much-philosophy-professor-make-year-8750.html", "passage_text": "National Earnings. Philosophy and religion teachers earned a national average annual wage of $71,620 in May 2011, according to the bureau. The median earnings of this group was $65,100 per year. The middle 50 percent of philosophy and religion professors earned between $48,370 and $88,030 per year. Of the three primary industries of employment, religious and philosophy professors earned the most working for colleges, universities and professional schools, where they took in an average of $72,210 per year. They made $68,650 per year working at junior colleges, and $46,940 per year at religious organizations."}, {"url": "http://www.salarylist.com/jobs/Religion-Professor-Salary.htm", "passage_text": "Religion Professor average salary is $35,900, median salary is $- with a salary range from $33,500 to $38,300. Religion Professor salaries are collected from government agencies and companies. Religion Professor salary is full-time annual starting salary. Intern, contractor and hourly pay scale vary from regular exempt employee. Compensation depends on work experience, job location, bonus, benefits and other factors."}]