[{"url": "http://www.diabeticlivingonline.com/food-to-eat/dining-out/top-fast-food-picks-people-diabetes", "passage_text": "Top Fast-Food Picks for People with Diabetes. Fast food is not off-limits for people with diabetes, but knowing what to order makes all the difference. Check out our top picks for healthier eating at fast-food restaurants. "}, {"url": "http://www.healthguideinfo.com/diabetes-nutrition-exercise/p88290/", "passage_text": "Your body converts the carbs that you eat into sugar and uses it to provide the body with energy. However, some carbohydrates, particularly simple carbohydrates like white bread and sugar, can cause spikes in your blood sugar levels. This is an essential fact to keep in mind when ordering a fast food meal. If you eat at fast food chains, you may wonder how the food affects diabetes and if there are healthy options. Your concerns are valid since diet is an important aspect of managing diabetes."}, {"url": "http://www.fitday.com/fitness-articles/nutrition/healthy-eating/fast-food-nutrition-junk-foods-effect-on-your-body.html", "passage_text": "Fast food nutrition should make up a minimal part of a healthy diet. Fast foods and junk foods are high in fat, sodium and sugar, which can lead to obesity and a range of attendant health problems, including diabetes, heart disease and arthritis. Here are the facts about how excessive junk food consumption affects your body. Junk Food Affects Your Energy Levels."}, {"url": "http://www.healthline.com/health/type-2-diabetes/junk-food", "passage_text": "1 American Diabetes Association. 2  Retrieved October 25, 2011 from http://www.diabetes.org/food-and-fitness/food/what-can-i-eat/eating-out/the-fast-food-challenge.html. 3  Eating at Fast-food Restaurants More than Twice Per Week is Associated with More Weight Gain and Insulin Resistance in Otherwise Healthy Young Adults. Avoiding Junk Food. If you have diabetes already, you may be wondering why it’s so important to avoid the sugars and fats found in junk foods. The most obvious reason is because keeping your weight down—and avoiding sugary foods—will help you to control your blood sugar."}, {"url": "http://healthyeating.sfgate.com/statistics-health-risks-eating-fast-food-3290.html", "passage_text": "Statistics link fast food to a number of health risks. Fast food is an affordable and convenient way to fill yourself up when on the run. Although you shouldn't feel guilty for an occasional indulgence, regularly eating fast food can seriously damage your health. The 2004 study noted that regularly eating fast food doubles your chance of developing insulin resistance, which heightens risk of developing type 2 diabetes."}, {"url": "http://www.livestrong.com/article/442066-diseases-caused-by-eating-too-much-fast-food/", "passage_text": "Although no one knows if fast foods themselves cause diabetes, health problems related to fast foods can increase your likelihood of getting the disease. Overweight, obesity, high-blood pressure and elevated blood-sugar levels have all been linked to type 2 diabetes. According to a 2005 medical study published in The Lancet, eating fast-food meals more than twice per week can cause an average 10-pound weight increase in young adults over time. Cancer. Again, fast foods themselves may not cause cancer, but they can cause conditions such as weight gain that precipitate cancer. Menus that emphasize fat and sugar at the expense of fiber and other beneficial nutrients have the poor-nutrition building blocks for cancer."}, {"url": "http://healthyeating.sfgate.com/statistics-health-risks-eating-fast-food-3290.html", "passage_text": "Coupled with low nutritional value, the high fat, calorie and sodium content of these foods can lead to a variety of health problems. With statistical associations to weight gain, obesity, diabetes, cardiovascular conditions and all-cause mortality, regularly eating fast food can be a dangerous thing. The 2004 study noted that regularly eating fast food doubles your chance of developing insulin resistance, which heightens risk of developing type 2 diabetes."}, {"url": "http://www.diabetes.co.uk/food/fast-food-and-diabetes.html", "passage_text": "Fast Food and Diabetes (Junk Food). Although quick and convenient, fast foods are highly calorific. Fast food, also commonly referred to as junk food, is undoubtedly very popular in the UK but is closely linked with health problems including obesity, type 2 diabetes and cardiovascular disease. Advantages. The advantages of fast food include convenience and taste. As the name suggests, fast food can be quickly prepared by a restaurant or stall, is often quick to eat and may not require cutlery to eat."}, {"url": "http://www.livestrong.com/article/350570-health-problems-that-fast-food-can-cause/", "passage_text": "Sugar for Diabetes. Fast foods often contain high levels of sugar and can promote weight gain. Photo Credit Bine A å/iStock/Istock Getty. Images fast foods are typically served with soft, drinks milk shakes and other beverages that contain high levels of. sugar"}]