[{"url": "http://www.ehow.com/facts_5019396_forged-steel.html", "passage_text": "History. Traditionally forged steel is manufactured by a smith. An individual would wet the metal with water and pound it with a hammer atop an anvil. Early types of forged steel were developed in Persia and China. Modern methods were developed throughout the 1800s. The bonus of forged steel is that the metal becomes stronger than equivalent types that are cast or machined. The pressure that compresses the steel makes the grains within the steel deform as they are forced together."}, {"url": "http://www.atcgroup.com.au/CustomCastingForging/TheDifferenceBetweenCastingForging.aspx", "passage_text": "The Difference Between Casting & Forging. Casting is the process where metal is heated until molten. While in the molten or liquid state it is poured into a mold or vessel to create a desired shape. Forging is the application of thermal and mechanical energy to steel billets or ingots to cause the material to change shape while in a solid state. "}, {"url": "http://www.ehow.com/facts_5019396_forged-steel.html", "passage_text": "Forged steel is an alloy of carbon and iron that is compressed under extreme pressure to make a very hard and strong substance. It has been used for thousands of years to create all types of materials. The bonus of forged steel is that the metal becomes stronger than equivalent types that are cast or machined. The pressure that compresses the steel makes the grains within the steel deform as they are forced together."}, {"url": "http://www.wisegeek.com/what-is-forged-carbon-steel.htm", "passage_text": "The term forged carbon steel represents a combination of two basic metallurgical components, namely carbon steel and forging. Carbon steel is a broad term applied to a range of steel varieties of various compositions excluding stainless steel. Forging is a metal forming process that utilizes repeated force to compress a piece of heated metal stock into the desired final shape. Forged carbon steel parts are usually believed to be superior to those made by other methods such as casting. This is due to the fact that the hammering of the metal during forming eliminates most of the microscopic crystalline flaws, such as air bubbles and fissures, which characterize cast parts."}, {"url": "http://www.answers.com/Q/Difference_between_forged_steel_and_carbon_steel", "passage_text": "Making the world better, one answer at a time. Forged steel has been subject to high temperature and pressure forcing the crystal structure closer together and increasing tensile strength (used in high pressure gas compressors). Carbon steel is conventional steel produced by the Bessemer process. In the oil industry carbon steel is the default option for casing and tubing used in oil wells but it is not very resistant to corrosion."}, {"url": "https://en.wikipedia.org/wiki/Forging", "passage_text": "The blows are delivered with a hammer (often a power hammer) or a die. Forging is often classified according to the temperature at which it is performed: cold forging (a type of cold working), warm forging, or hot forging (a type of hot working). For the latter two, the metal is heated, usually in a forge. A forging press, often just called a press, is used for press forging. There are two main types: mechanical and hydraulic presses. Mechanical presses function by using cams, cranks and/or toggles to produce a preset (a predetermined force at a certain location in the stroke) and reproducible stroke."}, {"url": "http://www.efunda.com/processes/metal_processing/Forging.cfm", "passage_text": "Introduction. Forging is the process by which metal is heated and is shaped by plastic deformation by suitably applying compressive force. Usually the compressive force is in the form of hammer blows using a power hammer or a press. Forging refines the grain structure and improves physical properties of the metal. "}, {"url": "https://en.wikipedia.org/wiki/Forging", "passage_text": "Forging is one of the oldest known metalworking processes. Traditionally, forging was performed by a smith using hammer and anvil, though introducing water power to the production and working of iron in the 12th century drove the hammer and anvil into obsolescence. A forging press, often just called a press, is used for press forging. There are two main types: mechanical and hydraulic presses. Mechanical presses function by using cams, cranks and/or toggles to produce a preset (a predetermined force at a certain location in the stroke) and reproducible stroke."}]