[{"url": "http://www.dbsalliance.org/site/PageServer?pagename=education_bipolar_types", "passage_text": "While bipolar I disorder is characterized by one or more manic episodes or mixed episodes and one or more major depressive episodes; bipolar II disorder is diagnosed after one or more major depressive episodes and at least one episode of hypomania, with possible periods of level mood between episodes. Cyclothymia is a milder form of bipolar disorder characterized by several hypomanic episodes and less severe episodes of depression that alternate for at least two years. The severity of this illness may change over time."}, {"url": "http://www.webmd.com/bipolar-disorder/guide/bipolar-disorder-symptoms-types", "passage_text": "Bipolar Types. There are several types of bipolar disorder; all involve episodes of depression and mania to a degree. They include bipolar I, bipolar II, cyclothymic disorder, mixed bipolar, and rapid-cycling bipolar disorder. Bipolar I. A person affected by bipolar I disorder has had at least one manic episode in his or her life. There are many different symptoms -- and several different types -- of bipolar disorder. The primary symptoms of the disorder are dramatic and unpredictable mood swings. The various types of bipolar disorder range from mild to sever"}, {"url": "http://www.dbsalliance.org/site/PageServer?pagename=education_bipolar_types", "passage_text": "Bipolar I Disorder. Bipolar I disorder is characterized by one or more manic episodes or mixed episodes (symptoms of both a mania and a depression occurring nearly every day for at least one week) and one or more major depressive episodes. Bipolar I disorder is the most severe form of the illness marked by extreme manic episodes. Cyclothymia is a milder form of bipolar disorder characterized by several hypomanic episodes and less severe episodes of depression that alternate for at least two years. The severity of this illness may change over time."}, {"url": "http://bipolarsymptoms.org/types-bipolar-disorder/", "passage_text": "The types of bipolar disorder include: Bipolar 1 Disorder is also known as manic-depressive disorder or manic depression. The symptoms of this illness include severe mood swings that cycle through episodes of mania and depression. Those with bipolar 1 disorder will have had at least one manic episode in their life. This episode is distinguished by an abnormally happy or elevated mood that involves some behavior that disrupts life."}, {"url": "http://www.webmd.com/bipolar-disorder/guide/bipolar-disorder-symptoms-types", "passage_text": "Bipolar is a complex illness. There are many different symptoms -- and several different types -- of bipolar disorder. The primary symptoms of the disorder are dramatic and unpredictable mood swings. The various types of bipolar disorder range from mild to severe"}, {"url": "http://www.healthyplace.com/bipolar-disorder/bipolar-types/types-of-bipolar-disorder/", "passage_text": "For the purposes of diagnosis, the types of bipolar disorder are defined by the patterns and severity of symptoms. 1. 1  Bipolar I disorder (also noted as bipolar 1) is characterized by one or more manic or mixed episodes and one or more major depressive episodes. The types of bipolar disorder are differentiated by the presence and severity of specific symptoms, but all include cycling between high mood states (like mania or manic symptoms) and low mood states (depression). The following are the mood states found in bipolar disorder :"}, {"url": "http://www.webmd.com/bipolar-disorder/guide/bipolar-disorder-forms", "passage_text": "1 Bipolar I disorder involves periods of severe mood episodes from mania to depression. 2  Bipolar II disorder is a milder form of mood elevation, involving milder episodes of hypomania that alternate with periods of severe depression. There are several types of bipolar disorder; all involve episodes of depression and mania to a degree. Bipolar disorder is a lifelong illness. Episodes of mania and depression eventually can occur again if you don't get treatment. Many people sometimes continue to have symptoms, even after getting treatment for their bipolar disorder. Here are the types of bipolar disorder 1  :"}]