[{"url": "https://answers.yahoo.com/question/index?qid=20070527124003AAUjdFz", "passage_text": "I had a blood test done last week and it came back abnormal for the thyroid. The doctor put me on a medicine called Synthroid for it. If someone can tell me in simple terms, I would appreciate it! Update: My tests showed the following-TSH level - 5.551 and my PTH, intact was 74.1, which seems to be extremely high. I had a blood test done last week and it came back abnormal for the thyroid. The doctor put me on a medicine called Synthroid for it. If someone can tell me in simple terms, I would appreciate it! Source(s): abnormal thyroid test thyroid do: https://tr.im/WLXIe."}, {"url": "https://labtestsonline.org/understanding/analytes/tsh/tab/test", "passage_text": "Other thyroid tests that may be ordered include a free T3 test and thyroid antibodies (if autoimmune-related thyroid disease is suspected). Sometimes TSH, free T4 and free T3 are ordered together as a thyroid panel. TSH testing is used to: 1  Diagnose a thyroid disorder in a person with symptoms. 2  Screen newborns for an underactive thyroid."}, {"url": "https://labtestsonline.org/understanding/analytes/tsh/tab/test", "passage_text": "Whether high or low, an abnormal TSH indicates an excess or deficiency in the amount of thyroid hormone available to the body, but it does not indicate the reason why. An abnormal TSH test result is usually followed by additional testing to investigate the cause of the increase or decrease. Sometimes TSH, free T4 and free T3 are ordered together as a thyroid panel. TSH testing is used to: 1  Diagnose a thyroid disorder in a person with symptoms. 2  Screen newborns for an underactive thyroid."}, {"url": "http://www.healthline.com/health/thyroid-function-tests", "passage_text": "T3 tests, which check for levels of triiodothyronine, are usually ordered if T4 tests and TSH tests suggest hyperthyroidism. The T3 test may also be ordered if you are showing signs of an overactive thyroid gland. The T4 test is known as the thyroxine test. The TSH test measures the level of thyroid-stimulating hormone in your blood. These are the two most common thyroid function tests and are usually ordered together. They are routinely performed on newborn babies to identify a low-functioning"}, {"url": "http://www.inspire.com/groups/stop-sarcoidosis/discussion/abnormal-thyroid-test-heart-palpitations-means-what/", "passage_text": "Well just got a call from the clinic that my blood test of the thyroid is abnormal and the doc wants to see me. Now To this point I have primarily been seeing my pulmonary doc. This new guy I dont think has much knowledge with Sarcoidosis, but it is a free clinic and that helps. "}, {"url": "http://www.mcrh.org/Blood-Tests/194586.htm", "passage_text": "My tests showed the following-TSH level - 5.551 and my PTH, intact was 74.1, which seems to be extremely high. Your thyroid is underactive. The Synthroid will balance out the hormone level to make up for the lack of activity from your thyroid. You may end up having an ultrasound (totally painless) to check out the size of the thyroid and whether there are any nodules/growths on it. Often, Synthroid will lessen any growths"}, {"url": "http://www.md-health.com/High-Tsh.html", "passage_text": "A TSH test is a lab test that analyzes your blood to determine the body's overall TSH levels. If you begin to show signs of a malfunctioning thyroid your doctor my order a test to check for the TSH levels in your system. TSH or thyroid stimulating hormone is a hormone produced in the anterior pituitary gland. This is used to help stimulate the thyroid to produce triiodothyronine (T3) or thyroxine (T4), hormones that help stimulate the metabolism."}, {"url": "https://answers.yahoo.com/question/index?qid=20070527124003AAUjdFz", "passage_text": "Best Answer: Your thyroid is underactive. The Synthroid will balance out the hormone level to make up for the lack of activity from your thyroid. You may end up having an ultrasound (totally painless) to check out the size of the thyroid and whether there are any nodules/growths on it. I had a blood test done last week and it came back abnormal for the thyroid. The doctor put me on a medicine called Synthroid for it. If someone can tell me in simple terms, I would appreciate it! Source(s): abnormal thyroid test thyroid do: https://tr.im/WLXIe."}]