[{"url": "http://www.animalfactsencyclopedia.com/Hyena-facts.html", "passage_text": "Hyena Facts. Although they resemble both dogs and cats, the three species of hyenas and the aardwolf are in their own separate and very unique family called Hyaenidae. The most well-known is called the spotted hyena, also known as the laughing hyena due to the unusual and eerie sounds it makes."}, {"url": "http://www.npr.org/templates/story/story.php?storyId=125541149", "passage_text": "Prof. THEUNISSEN: Correct, yeah. So this is a colony of spotted hyenas and the spotted hyena is the laughing hyena. It's actually the only hyena among the three living hyenas that produces the giggle sound or the laugh."}, {"url": "http://www.bioexpedition.com/spotted-hyena/", "passage_text": "The Spotted Hyena is often called the Laughing Hyena due to the sounds it makes that are so similar to a human laugh. These animals are often not given much credit for their contribution to the ecosystem. They are the subject of many forms of myths and folk tales throughout cultures around the world."}, {"url": "http://www.livescience.com/12327-hyena-giggles-laughing-matter.html", "passage_text": "Hyena Giggles: No Laughing Matter. Though it may sound like a maniacal giggle, the hyena call is actually a sign of frustration, according to research that will be presented May 21, 2009 at an Acoustical Society of America meeting. Credit: LiveScience/Nicolas Mathevon/University of Ca."}, {"url": "http://www.npr.org/templates/story/story.php?storyId=125541149", "passage_text": "Well, the real hyena laugh actually sounds a lot like that. (Soundbite of hyena laughing). WERTHEIMER: And new research from the University of California in Berkeley suggests that the hyena's giggle is really as expressive as it sounds."}, {"url": "http://www.livescience.com/3546-hyena-laugh-fighting-words.html", "passage_text": "A Hyena's giggle is not actually laughter, but a sound of frustration. New research found a way to distinguish individual hyenas based on the peculiarities of their, well, let's call them fighting words."}, {"url": "http://www.soundboard.com/sb/Laughing_Hyenas_audio", "passage_text": "The Spotted Hyena, or Laughing Hyena, is the largest and best-known member of the hyena family. Living mostly in the deserts of Africa, they usually hunt in clans of 40 or more. The females can be Hyper Aggressive dominate the males."}]