[{"url": "http://michaelbluejay.com/electricity/cost.html", "passage_text": "(Then divide by 1000 to get the kilowatt-hours, which is how your utility charges you.) Example: 100-watt bulb x 2 hours 1000 = 0.2 kWh. Trivia. The average U.S. household uses 920 kWh a month. (Dept. of Energy). The U.S. as a whole used nearly 4 trillion kWh in 2009. Here's the formula to figure the cost of running a device: wattage x hours used 1000 x price per kWh = cost of electricity For example, let's say you leave a 100-watt bulb running continuously (730 hours a month), and you're paying 15 /kWh."}, {"url": "http://www.nyserda.ny.gov/Cleantech-and-Innovation/Energy-Prices/Electricity/Monthly-Avg-Electricity-Industrial", "passage_text": "The average price per kilowatt-hour represents the total bill divided by the kilowatt-hour usage. The total bill is the sum of all items appearing on an electricity bill such as fixed costs, variable rate per kWh, taxes, surcharges, late fees, and even credits for rebates. (Prices last updated 09/10/2015.). "}, {"url": "http://cnsnews.com/news/article/terence-p-jeffrey/average-price-electricity-climbs-all-time-record", "passage_text": "The 14.3-cents average price for a KWH recorded this June is about 4.4 percent higher than that previous record. ype=node title=Average Price for a KWH of Electricity. Typically, the cost of electricity peaks in summer, declines in fall, and hits its lowest point of the year during winter. In each of the first six months of this year, the average price for a KWH hour of electricity has hit a record for that month. In June, it hit the all-time record. Although the price for an average KWH hit its all-time record in June, the seasonally adjusted electricity price index--which measures changes in the price of electricity relative to a value of 100 and adjusts for seasonal fluctuations in price--hit its all-time high of 209.341 in March of this year, according to BLS."}, {"url": "http://cnsnews.com/news/article/terence-p-jeffrey/average-price-electricity-climbs-all-time-record", "passage_text": "(CNSNews.com) - For the first time ever, the average price for a kilowatthour (KWH) of electricity in the United States has broken through the 14-cent mark, climbing to a record 14.3 cents in June, according to data released last week by the Bureau of Labor Statistics. Although the price for an average KWH hit its all-time record in June, the seasonally adjusted electricity price index--which measures changes in the price of electricity relative to a value of 100 and adjusts for seasonal fluctuations in price--hit its all-time high of 209.341 in March of this year, according to BLS."}, {"url": "http://www.bls.gov/regions/west/news-release/averageenergyprices_losangeles.htm", "passage_text": "The average price per kilowatt-hour represents the total bill divided by the kilowatt-hour usage. The total bill is the sum of all items applicable to all consumers appearing on an electricity bill including, but not limited to, variable rates per kWh, fixed costs, taxes, surcharges, and credits. Los Angeles area households paid an average of 20.5 cents per kilowatt hour (kWh) of electricity in August 2015, down from 21.5 cents per kWh in August 2014."}, {"url": "http://www.bls.gov/regions/west/news-release/averageenergyprices_losangeles.htm", "passage_text": "For electricity, average prices per kilowatt-hour (kWh) and per 500 kWh are published. For utility (piped) gas, average prices per therm, per 40 therms, and per 100 therms are published. Los Angeles area households paid an average of 20.5 cents per kilowatt hour (kWh) of electricity in August 2015, down from 21.5 cents per kWh in August 2014."}, {"url": "http://www.solarcellcentral.com/cost_page.html", "passage_text": "The chart at the left shows the average cost of electricity for 2014 by consumer group per the EIA (the US Energy Information Administration). For 2014 the average residential cost was 12.50 cents per kilo-watt hour up 3.1% from 2013. Commercial was 10.75 cents and industrial 7.01 cents. The US average residential household used 909 kWh per month and the average monthly electricity bill was $125 before taxes and fees. Prices are higher for residential and commercial customers than industrial customers because it costs more to distribute the electricity and step the voltages down."}, {"url": "http://www.awea.org/Resources/Content.aspx?ItemNumber=5547", "passage_text": "1 The cost of electricity can be reported in dollars per megawatt-hour ($/MWh) or cents per kilowatt-hour (c/kWh) as commonly seen on residential electricity bills. 2  For example, $50 per MWh = 5 cents per kWh. 3  An average U.S. home uses 11,000 kWh or 11 MWh each year. "}, {"url": "http://www.npr.org/sections/money/2011/10/27/141766341/the-price-of-electricity-in-your-state", "passage_text": "A Hawaiian household whose electricity use was around the national average would have a monthly electric bill over $300. The high cost of crude oil used to generate the state's electricity is driving the price, EIA energy economist Tyler Hodge told me. Idaho had the lowest price, at about 8 cents per kWh. So the typical US household would pay about $73 for electricity each month in Idaho. "}, {"url": "http://www.bls.gov/regions/midwest/news-release/AverageEnergyPrices_Chicago.htm", "passage_text": "Chicago area households paid an average of 16.1 cents per kilowatt hour (kWh) of electricity in August 2015, comparable to the 16.2 cents per kWh paid in August 2014. The average cost of utility (piped) gas at 79.3 cents per therm in August was down from $1.122 per therm a year earlier. For electricity, average prices per kilowatt-hour (kWh) are published. For utility (piped) gas, average prices per therm are published. For gasoline, the average price per gallon is"}]