[{"url": "http://www.nhs.uk/Conditions/Hypothermia/Pages/Causes.aspx", "passage_text": "Hypothermia is caused by getting too cold, as the body loses more heat than it can generate and body temperature drops below 35C (95F)."}, {"url": "http://www.medicinenet.com/hypothermia_extended_exposure_to_cold/article.htm", "passage_text": "The cause of hypothermia is the inability of the body's temperature regulation system to keep the body's core temperature between 35.6 C and 37.5 C (96.08 F and 99.5 F), so any body temperature below about 35.6 C (96.08 F) is considered hypothermic by many doctors."}, {"url": "http://www.webmd.com/first-aid/tc/hypothermia-and-cold-temperature-exposure-topic-overview", "passage_text": "Hypothermia occurs when the body gets cold and loses heat faster than the body can make it. A rectal temperature is considered the most accurate body temperature. A normal rectal body temperature ranges from 97.5°F (36.4°C) to 99.6°F (37.6°C) , and for most people it is 98.6°F (37°C) ."}, {"url": "http://www.mayoclinic.org/diseases-conditions/hypothermia/basics/definition/con-20020453", "passage_text": "Definition. Hypothermia is a medical emergency that occurs when your body loses heat faster than it can produce heat, causing a dangerously low body temperature. Normal body temperature is around 98.6 F (37 C). Hypothermia (hi-poe-THUR-me-uh) occurs as your body temperature passes below 95 F (35 C). When your body temperature drops, your heart, nervous system and other organs can't work normally."}, {"url": "http://www.mayoclinic.org/diseases-conditions/hypothermia/basics/definition/con-20020453", "passage_text": "Hypothermia is a medical emergency that occurs when your body loses heat faster than it can produce heat, causing a dangerously low body temperature. Normal body temperature is around 98.6 F (37 C). Hypothermia (hi-poe-THUR-me-uh) occurs as your body temperature passes below 95 F (35 C). When your body temperature drops, your heart, nervous system and other organs can't work normally."}, {"url": "http://seagrant.umn.edu/coastal_communities/hypothermia", "passage_text": "Hypothermia is a physical condition that occurs when the body's core temperature falls below a normal 98.6° F (37° C) to 95° F (35° C) or cooler. Think of hypothermia as the opposite of heat stroke."}, {"url": "http://umm.edu/health/medical/altmed/condition/hypothermia", "passage_text": "Introduction. Hypothermia happens when your body temperature drops way below normal, causing the circulatory, respiratory, and nervous systems to slow down. Normal body temperature is around 98.6 °F (37 °C). Hypothermia happens if your temperature drops to 96 °F (35.5 °C) or below."}, {"url": "http://www.webmd.com/first-aid/tc/hypothermia-and-cold-temperature-exposure-topic-overview", "passage_text": "Sometimes a normal, healthy adult has a low body temperature, such as 96°F (36°C) . If the person with the low body temperature is not ill, does not have any other problems, and is not an infant or an older adult, then evaluation usually is not needed."}]