[{"url": "http://www.simplyhired.com/salaries-k-registered-nurse-l-kansas-city-mo-jobs.html", "passage_text": "Average Registered Nurse Salaries. The average salary for registered nurse jobs in Kansas City, MO is $49,000. Average registered nurse salaries can vary greatly due to company, location, industry, experience and benefits. This salary was calculated using the average salary for all jobs with the term registered nurse anywhere in the job listing."}, {"url": "http://www.payscale.com/research/US/Job=Registered_Nurse_(RN)/Hourly_Rate/a1c3121f/Kansas-City-MO", "passage_text": "A Registered Nurse (RN) in Kansas City, Missouri earns an average wage of $24.74 per hour. The skills that increase pay for this job the most are Case Management and Geriatrics."}, {"url": "http://www.indeed.com/salary/q-RN-l-Kansas-City,-MO.html", "passage_text": "Average RN salaries for job postings in Kansas City, MO are 7% lower than average RN salaries for job postings nationwide."}, {"url": "http://www.simplyhired.com/salaries-k-graduate-nurse-l-kansas-city-mo-jobs.html", "passage_text": "Average Graduate Nurse Salaries. The average salary for graduate nurse jobs in Kansas City, MO is $38,000. Average graduate nurse salaries can vary greatly due to company, location, industry, experience and benefits. This salary was calculated using the average salary for all jobs with the term graduate nurse anywhere in the job listing."}, {"url": "http://www.ehow.com/about_6389152_average-nursing-salary-kansas_.html", "passage_text": "RN Average Hourly Wage. The average annual salary of an RN in Kansas breaks down to a $26.20 average hourly wage, according to the same May 2008 BLS report. The median hourly rate was $25.13. The middle half earned between $21.53 and $29.93 hourly."}, {"url": "http://www.indeed.com/salary/q-Registered-Nurse-l-Kansas-City,-KS.html", "passage_text": "Average Registered Nurse salaries for job postings in Kansas City, KS are 7% lower than average Registered Nurse salaries for job postings nationwide."}]