[{"url": "http://pets.costhelper.com/dog-vaccination.html", "passage_text": "1 The average cost for dog vaccinations ranges from $20 to $150 in the first year, and from $10 to $100 per year afterward."}, {"url": "http://pets.costhelper.com/dog-vaccination.html", "passage_text": "1 Some dog daycare facilities or kennels require vaccinations not included in the standard round of shots, such as for bordatella, known as kennel cough. 2  In certain parts of the country, veterinarians recommend extra vaccinations, such as for Lyme disease. 3  Extra vaccinations usually cost about $10 to $15 or more each."}, {"url": "http://www.vetinfo.com/cost-dog-vaccinations.html", "passage_text": "Average Cost of Pet Vaccinations. The cost for vaccinating puppies or pets in the first year ranges from $20 to $200. Cost of immunization of adult dogs ranges from $60 to $100 annually. Canine vaccination costs differ due to the dog's age and varying vet charges. Since puppies are at a high risk of exposure to disease, puppy vaccinations are recommended as early as 5 weeks of age."}, {"url": "http://www.vetinfo.com/cost-dog-vaccinations.html", "passage_text": "Along with the cost of immunizations, pet owners are required to pay additional costs toward laboratory tests, physical examinations and routine parasite treatment or control. The cost of veterinary care for puppies ranges from $100 to $200. Veterinary care for older dogs costs nearly $150 to $250 annually. Medical and home care expenses for canines in general, are higher for puppies and dogs over 8 years of age."}, {"url": "http://www.mindblowingworld.com/dog-shots-cost/", "passage_text": "Average Cost of Dog Shots. In the first year, the cost of vaccinating puppies ranges from $20-$200 while the cost of immunizing adult dogs can average between $60 and $100. The gap between $60 and $100 is explained by the age of the dog and vet charge variations."}, {"url": "https://uk.answers.yahoo.com/question/index?qid=20061130155645AAooSyW", "passage_text": "Best Answer: in most cases it cost between 32 pounds and 50 pounds for puppy injections and that is a course of 2, but it dose mostly depend on your vets,phone around a few vets to get prices before you book in."}]