[{"url": "https://answers.yahoo.com/question/index?qid=20130422141239AAcUTwZ", "passage_text": "Any home remedies on how to make my hair grow fast! I have hair 19 in. long but I want longer how do I get it to grow about 5-10 longer in the next year or so! Thanks for your help! Update: Also help me with my other question http://answers.yahoo.com/question/index;... 11.) Eat Protein Your hair is made of protein. So eat A LOT of it to be sure your hair grows. 12.) Trim Your Hair You may think that trimming your hair shortens it, but letting it go long and free without trims only causes split ends. Don't trim your hair TOO often, just be sure you do."}, {"url": "http://www.top10homeremedies.com/how-to/make-hair-grow-faster.html", "passage_text": "1 Apply a mixture of two egg yolks and two tablespoons of extra-virgin olive oil on your scalp. 2  Leave it on for 15 to 20 minutes. 3  Wash it out with cold water and then shampoo your hair. 4  Alternatively, whisk an egg and add one cup of milk, two tablespoons of extra-virgin olive oil, and the juice from half a lemon to it. 1 Apply it on your hair and scalp and leave it on for half an hour. 2  Finally, rinse it out and shampoo your hair as usual. 3  Apply a mixture of two egg yolks and two tablespoons of extra-virgin olive oil on your scalp. 4"}, {"url": "http://www.youtube.com/watch?v=AF3ZWOglCXg", "passage_text": "what makes hair grow faster. make your hair grow. vitamins to make hair grow. make hair grow faster. my hair grew back. growing long hair. Another home remedies for hair growth is to give your hair a break with the cutting and really give it some time to be nurtured and also allow room for growth. Don't get it cut too much; every two months is probably OK and finally, what makes your hair grow is really patience,"}, {"url": "http://www.howtomakeyourhairgrowfast.net/home-remedies-to-make-your-hair-grow-faster.html", "passage_text": "Cool and strain the mixture and use it to wash your hair regularly to promote hair growth. Another home remedy is to mix minced onion in a mild shampoo. Allow the mixture stand for about 15 days and then use the shampoo regularly. It will help in hair growth as well as add shine to your hair. 1 These home remedies will be effective only when you eat a healthy diet, sleep well, exercise regularly and avoid using chemicals on your hair. 2  As hair grows more when you are taking rest, it is important to enjoy a sound sleep of 6 to 7 hours daily to make your hair grow faster."}, {"url": "http://www.caretricks.com/haircare/home-remedies-for-longer-hair/", "passage_text": "The best fast way to make your hair longer and stronger naturally is by taking proper care of hair. You can use home remedies for longer hair like eggs, honey, aloe vera, olive oil, coconut oil etc. These tips will help both men and women to make hair long and thick. Hence, to make your hair grow longer you need to have enough proteins in your diet. Fish, eggs, meat are some good source of proteins. Also minerals like zinc, iron are responsible for strong and healthy hair. Deficiency of these minerals can lead to gray and weak hair."}, {"url": "http://www.top10homeremedies.com/how-to/make-hair-grow-faster.html", "passage_text": "3. Massage your scalp. Massaging promotes blood flow to the scalp, which in turn stimulates the hair follicles. In addition, deep condition your hair once a week with a hot oil treatment or deep conditioning hair mask. 1  Apply the oil (preferably warm) or conditioner to your hair. 2  Gently rub your fingers on your scalp in a circular motion for three to five minutes. 1 Apply it on your hair and scalp and leave it on for half an hour. 2  Finally, rinse it out and shampoo your hair as usual. 3  Apply a mixture of two egg yolks and two tablespoons of extra-virgin olive oil on your scalp. 4  Leave it on for 15 to 20 minutes."}, {"url": "http://www.howtomakeyourhairgrowfast.net/home-remedies-to-make-your-hair-grow-faster.html", "passage_text": "In the morning, wash your hair with warm water to make it grow faster. Alternatively, you can make a mixture of 20 ml grapeseed oil, 3ml of jojoba oil, three drops of lavender oil, three drops of rosemary oil, two drops each of thyme oil and cedar wood oil. 1 These home remedies will be effective only when you eat a healthy diet, sleep well, exercise regularly and avoid using chemicals on your hair. 2  As hair grows more when you are taking rest, it is important to enjoy a sound sleep of 6 to 7 hours daily to make your hair"}, {"url": "http://www.top10homeremedies.com/how-to/make-hair-grow-faster.html", "passage_text": "1 Wash it out with cold water and then shampoo your hair. 2  Alternatively, whisk an egg and add one cup of milk, two tablespoons of extra-virgin olive oil, and the juice from half a lemon to it. 3  Apply it on your scalp and leave it on for 20 to 30 minutes before washing it out and shampooing your hair. 1 Apply it on your hair and scalp and leave it on for half an hour. 2  Finally, rinse it out and shampoo your hair as usual. 3  Apply a mixture of two egg yolks and two tablespoons of extra-virgin olive oil on your scalp. 4  Leave it on for 15 to 20 minutes."}, {"url": "http://www.speedyremedies.com/home-remedies-to-make-hair-grow-faster.html", "passage_text": "Home Remedies to make Hair Grow Faster. • Regular hot oil massage (at least once a week) serves as a highly effective home treatment for hair growth as it improves blood circulation and nourishes the hair shafts. The hair and scalp massage can be done with coconut, rosemary, castor or olive oil. Well first off, to make your hair grow, you need to keep it healthy. My frtiaove home remedy is mayonnaise. Mayo has oil and eggs in it, which is really good for moisturizing your hair. Just put some mayo in your hair, cover with a plastic shower cap and leave it in for about 25 min or so."}, {"url": "http://www.howtomakeyourhairgrowfast.net/home-remedies-to-make-your-hair-grow-faster.html", "passage_text": "Let it cool, and rinse your hair with it to encourage new hair growth. With potatoes you can also make hair mask. Extract potato juice and mix it with an egg yolk and little honey and water. Apply this mixture to slightly damp hair and leave it in for about 30 minutes before rinsing it out with warm water. 1 These home remedies will be effective only when you eat a healthy diet, sleep well, exercise regularly and avoid using chemicals on your hair. 2  As hair grows more when you are taking rest, it is important to enjoy a sound sleep of 6 to 7 hours daily to make your hair grow faster."}]