[{"url": "https://en.wikipedia.org/wiki/Anchorage,_Alaska", "passage_text": "Anchorage (officially called the Municipality of Anchorage) is a unified home rule municipality in the U.S. State of Alaska. The Ted Stevens Anchorage International Airport, 6 miles (9.7 km) south of downtown Anchorage, is the airline hub for the state, served by many national and international airlines, including Seattle-based Alaska Airlines as well as many intrastate airlines and charter air services."}, {"url": "http://www.asse.org/assets/1/14/4430_Chapter_7_Anchorages.pdf", "passage_text": "A nchorages, anchorage points, or anchor points are the connections for both vertical and horizontal personal fall arrest systems. They may be as simple as a D-ring or eyebolt mounted at an appropriate location. Alternatively, they can consist of subsystems such as posts, brackets, trolleys, and other mobile devices. And that something is a part of your plant, building, or structure. This means the anchorage point must be carefully planned into the job to ensure continuous and complete protection during the work task, including travel to and from the elevated workstation."}, {"url": "http://www.mpi.mb.ca/en/Rd-Safety/Car-Seats/Pages/uas.aspx", "passage_text": "The Universal Anchorage System (UAS) is a standardized system that can make installing child seats easier. All Canadian vehicles manufactured on or after Sept. 1, 2002 are equipped with lower universal anchorage bars in the rear seats. "}, {"url": "http://www.muni.org/Departments/transit/Pages/Default.aspx", "passage_text": "Sanctioned by local voters in 1973, Anchorage's Public Transportation People Mover bus system began operation on July 1, 1974, carrying 39,505 passengers in the first month of service. In 2008, it set a new annual record of 4,220,677 trips, with an average weekday ridership of 14,297. "}, {"url": "https://en.wikipedia.org/wiki/Anchorage,_Alaska", "passage_text": "Anchorage’s location on the globe puts it within 9 and ½ hours by air to nearly 90% of the industrialized world. For this reason Anchorage is a common refueling stop for many international passenger flights and is home to a major FedEx Hub which the company calls a “critical part”” of its global network of services. The Ted Stevens Anchorage International Airport, 6 miles (9.7 km) south of downtown Anchorage, is the airline hub for the state, served by many national and international airlines, including Seattle-based Alaska Airlines as well as many intrastate airlines and charter air services."}, {"url": "http://www.nhtsa.gov/cars/rules/rulings/UCRA-OMB-J08/FinalRule.html", "passage_text": "Each vehicle anchorage system will consist of an upper anchorage point and two lower anchorage points. Each lower anchorage includes a 6 millimeter (mm) (0.24 inches (in.)) diameter straight rod, or bar, that is attached to the vehicle and is lateral and horizontal in direction. The lower anchorage points for the CAUSFIX were positioned 280 mm (11 inches) apart on the test seat structure, with the inboard anchorage approximately 610 mm (24 inches) from the inner surface of the door. An instrumented 9-month-old dummy was used in all the tests."}, {"url": "http://www.nhtsa.gov/cars/rules/rulings/UCRA-OMB-J08/FinalRule.html", "passage_text": "The NPRM proposed to apply the requirement for a child restraint anchorage system to passenger cars, and to trucks, multipurpose passenger vehicles and buses under 4,536 kg (10,000 lb) gross vehicle weight rating (GVWR). The lower anchorage points for the CAUSFIX were positioned 280 mm (11 inches) apart on the test seat structure, with the inboard anchorage approximately 610 mm (24 inches) from the inner surface of the door. An instrumented 9-month-old dummy was used in all the tests."}, {"url": "https://en.wikipedia.org/wiki/Anchorage,_Alaska", "passage_text": "With an estimated 300,950 residents in 2013, it is Alaska's most populous city and contains more than 40 percent of the state's total population; among the 50 states, only New York has a higher percentage of residents who live in its most populous city. The Ted Stevens Anchorage International Airport, 6 miles (9.7 km) south of downtown Anchorage, is the airline hub for the state, served by many national and international airlines, including Seattle-based Alaska Airlines as well as many intrastate airlines and charter air services."}, {"url": "https://en.wikipedia.org/wiki/Anchorage,_Alaska", "passage_text": "Anchorage is located in the South-central portion of Alaska at the terminus of the Cook Inlet on a peninsula formed by the Knik Arm to the north and the Turnagain Arm to the south. The Ted Stevens Anchorage International Airport, 6 miles (9.7 km) south of downtown Anchorage, is the airline hub for the state, served by many national and international airlines, including Seattle-based Alaska Airlines as well as many intrastate airlines and charter air services."}, {"url": "http://www.gribbins.com/anchorage-points/", "passage_text": "Anchorage Points. Anchorage is defined by OSHA as a secure point of attachment for lifeline, lanyards or deceleration device. The most overlooked component in a personal fall arrest system is planning for a suitable anchorage point. The following guidelines should be followed when planning or determining anchorage and connection: 1 Inspect anchorage connector attachment point for corrosion, cracks, deformities or other defects that may weaken the structure. 2  Do not attach to vertical structures unless a means of restraining the connector from sliding down the structure is present. 3  Never connect a shock-absorbing lanyard to a retractable lanyard."}]