[{"url": "http://encyclopedia2.thefreedictionary.com/Canards", "passage_text": "canard. (aerospace engineering). An aerodynamic vehicle in which horizontal surfaces used for trim and control are forward of the wing or main lifting surface."}, {"url": "http://ntrs.nasa.gov/archive/nasa/casi.ntrs.nasa.gov/19870013196.pdf", "passage_text": "This can be overcome by using the canard (foreplane) as employed on the Viggin fighter. One of the first fighter delta configurations to use the close-coupled canard is the Saab Viggin,16 which made its first flight in February 1967."}, {"url": "http://docs.desktop.aero/appliedaero/configuration/canardProCon.html", "passage_text": "1 This poses a problem for locating a vertical stabilizer and may result in very large vertical surfaces. ( 2 Note, however, that winglets may be used to advantage in this case.). 3  Wing twist distribution is strange and C L dependent: The wing additional load distribution is distorted by the canard wake."}, {"url": "http://thesciencedictionary.org/foreplane/", "passage_text": "Horizontal aerofoil mounted on front fuselage for pitch control. In a tail-first or canard configuration it replaces the function of the tailplane; in a delta wing design it may assist slow-speed behaviour."}, {"url": "http://www.brighthub.com/science/aviation/articles/76877.aspx", "passage_text": "A canard is an aircraft design which places the large main wing behind the smaller horizontal stabilizer. This results in a triangular shape of the aircraft, similar to a duck in flight, which is where the term canard originated (the word canard is french for duck). Many fighter jets use this design because of the increased speed and maneuverability it affords."}, {"url": "http://docs.desktop.aero/appliedaero/configuration/canardProCon.html", "passage_text": "1 Directional stability: The distance from the aircraft c.g. to the most aft part of the airplane is usually smaller on canard aircraft. 2  This poses a problem for locating a vertical stabilizer and may result in very large vertical surfaces. ( 3 Note, however, that winglets may be used to advantage in this case.)."}, {"url": "http://www.brighthub.com/science/aviation/articles/76877.aspx", "passage_text": "The wingspan of the aircraft can be as long as the fuselage, or in some cases, longer. The wings are what generate lift to let the aircraft become airborne. The final major section of an aircraft is called the empennage, or tail."}, {"url": "http://docs.desktop.aero/appliedaero/configuration/canardProCon.html", "passage_text": "1 Note that since the value of a S is usually larger for canard designs, C m0 has a greater impact on L than it does on aft-swept designs. 2  Induced drag / C Lmax incompatibility: Canard designs can achieve equal or better C Lmax values than conventional designs, and similar values of span efficiency."}]