[{"url": "http://www.bbb.org/new-jersey/business-reviews/contractor-commercial/benaka-inc-in-new-brunswick-nj-90103199/", "passage_text": "BBB Customer Review Rating plus BBB Rating is not a guarantee of a business' reliability or performance, and BBB recommends that consumers consider a business' BBB Rating and Customer Review Rating in addition to all other available information about the business. BBB letter grades represent the BBB's opinion of the business. The BBB grade is based on BBB file information about the business. In some cases, a business' grade may be lowered if the BBB does not have sufficient information about the business despite BBB requests for that information from"}, {"url": "https://en.wikipedia.org/wiki/Binaca_(brand)", "passage_text": "Binaca is an oral hygiene brand that is marketed in India and owned by Dabur. It was launched in 1951–52 as a toothpaste brand Binaca Top. It sponsored an extremely popular music show on Radio Ceylon and later on All India Radio, Binaca Geetmala which was hosted by noted radio personality Ameen Sayani. It was owned by Reckitt Benckiser which sold it to Dabur in 1996 for ₹12 million (US$180,000)"}, {"url": "http://www.benakahealthcare.com/", "passage_text": "Benaka Healthcare(A Division Of Benaka Business Consultancy). Established in the year of 2009, we Benaka Healthcare is a prominent supplier, trader, exporter, importer of a best quality assortment of Medical Equipment. Product array provided by us includes Medical Scanner Machine, X Ray Machine and Digital X-Ray System. Welcome to. Established in the year of 2009, we Benaka Healthcare is a prominent supplier, trader, exporter, importer of a best quality assortment of Medical Equipment."}, {"url": "https://en.wikipedia.org/wiki/Breath_spray", "passage_text": "Breath spray is a product sprayed into the mouth for the purpose of eliminating (or at least covering up) halitosis. It is occasionally advertised as being for smokers or those who dip tobacco, and occasionally to cover up the smell of cigarette / cigar smoking. Some breath sprays have an antibacterial or anti-plaque property; some others contain chlorine dioxide. As alcohol is frequently a prime ingredient of breath sprays, some brands advertise that they are alcohol-free."}, {"url": "http://binaca.com/", "passage_text": "Binaca Blasts Away Bad Breath. Binaca is specially formulated to freshen your breath instantly. It kills germs that cause bad breath and dissolves lingering aftertastes. So you can be fresh and ready anytime, anywhere, for anything! Back by popular demand the Binaca breath drops are back! Binaca has once again started producing the popular drops in a 3-pack configuration with peppermint flavor. Look for the breath drops at your local Walgreens, right by the register."}]