[{"url": "http://www.biochem.umd.edu/biochem/kahn/bchm465-01/ribosome/", "passage_text": "The Bacterial Ribosome. The bacterial ribosome is a cytoplasmic nucleoprotein particle whose main function is to serve as the site of mRNA translation and protein synthesis. The ribosome has a mass of about 2.5 MDa, with RNA accounting for 2/3 of the mass. It consists of two subunits denoted 30S (small subunit) and 50S (large). During protein synthesis a ribosome moves along an mRNA molecule, reading the codon and adding the correct amino acid (from the corresponding aminoacyl tRNA) to the growing protein. When a stop codon is reached,translation ceases, and the mRNA and protein are released."}, {"url": "http://biology.tutorvista.com/animal-and-plant-cells/ribosomes.html", "passage_text": "The ribosomes present in the prokaryotes function differently in protein production than the ribosomes of the eukaryote organisms. The ribosomes of bacteria, archea and eukaryotes differ significantly from each other in structure and RNA sequences. Plant cell do have ribosomes and they are composed of proteins and ribosomal RNA. The ribosomes in a plant cell are found in the cytoplasm, the surface of the rough e ndoplasmic reticulum, the mitochondria and on chloroplasts. There are two types of ribosomes-free ribsomes and attached ribosom"}, {"url": "http://faculty.ccbcmd.edu/courses/bio141/lecguide/unit1/prostruct/proribo.html", "passage_text": "B. PROKARYOTIC CELL ANATOMY. d. Ribosomes. 1. Ribosomes are composed of ribosomal RNA (rRNA) and protein. 2. Bacterial ribosomes are composed of two subunits with densities of 50S and 30S, as opposed to 60S and 40S in eukaryotic cells. 3. Ribosomes function as a workbench for protein synthesis whereby they receive and translate genetic instructions for the formation of specific proteins. 4. A. Structure and Composition. Ribosomes are composed of ribosomal RNA (rRNA) and protein. Prokaryotic cells have three types of rRNA: 16S rRNA, 23S rRNA, and 5S rRNA. Like transfer RNA (tRNA), rRNAs use intrastrand H-bonding between comlementary nucleotide bases to form complex folded structures."}, {"url": "http://faculty.ccbcmd.edu/~gkaiser/SoftChalk%20BIOL%20230/Prokaryotic%20Cell%20Anatomy/ribosomes/ribosomes/ribosomes_print.html", "passage_text": "Ribosomes. Fundamental Statements for this Lesson: 1. Ribosomes are composed of ribosomal RNA (rRNA) and protein. 2. Bacterial ribosomes are composed of two subunits with densities of 50S and 30S, as opposed to 60S and 40S in eukaryotic cells. 3. Ribosomes function as a workbench for protein synthesis whereby they receive and translate genetic instructions for the formation of specific proteins"}, {"url": "http://www.shmoop.com/biology-cells/prokaryotic-cells.html", "passage_text": "Prokaryotic ribosomes are smaller and have a slightly different shape and composition than those found in eukaryotic cells. Bacterial ribosomes, for instance, have about half of the amount of ribosomal RNA (rRNA) and one third fewer ribosomal proteins (53 vs. ~83) than eukaryotic ribosomes have. Despite these differences, the function of the prokaryotic ribosome is virtually identical to the eukaryotic version. Just like in eukaryotic cells, prokaryotic ribosomes build proteins by translating messages sent from DNA. All prokaryotic cells contain large quantities of genetic material in the form of DNA and RNA."}, {"url": "http://micro.magnet.fsu.edu/cells/bacteriacell.html", "passage_text": "In gram-negative bacteria, the cell wall is thin and releases the dye readily when washed with an alcohol or acetone solution. Cytoplasm-The cytoplasm, or protoplasm, of bacterial cells is where the functions for cell growth, metabolism, and replication are carried out. It is a gel-like matrix composed of water, enzymes, nutrients, wastes, and gases and contains cell structures such as ribosomes, a chromosome, and plasmids. "}, {"url": "http://biology.tutorvista.com/animal-and-plant-cells/ribosomes.html", "passage_text": "The bacterial ribosomes are present free in the cytoplasm. The bacterial ribosome sediments as 70S particle which is composed of 30S and a large subunit is of 50S. The small subunit of the prokarytoic ribosome functions in the association with messenger RNA during translation and decoding. Plant cell do have ribosomes and they are composed of proteins and ribosomal RNA. The ribosomes in a plant cell are found in the cytoplasm, the surface of the rough e ndoplasmic reticulum, the mitochondria and on chloroplasts. There are two types of ribosomes-free ribsomes and attached ribosomes"}, {"url": "http://www.cellsalive.com/cells/bactcell.htm", "passage_text": "Ribosomes: Ribosomes give the cytoplasm of bacteria a granular appearance in electron micrographs. Though smaller than the ribosomes in eukaryotic cells, these inclusions have a similar function in translating the genetic message in messenger RNA into the production of peptide sequences (proteins). "}, {"url": "https://en.wikipedia.org/wiki/Ribosome", "passage_text": "The ribosome (/ˈraɪbɵˌzoʊm/) is a large and complex molecular machine, found within all living cells, that serves as the site of biological protein synthesis (translation). Ribosomes link amino acids together in the order specified by messenger RNA (mRNA) molecules. Ribosomes consist of two major components: the small ribosomal subunit, which reads the RNA, and the large subunit, which joins amino acids to form a polypeptide chain."}]