[{"url": "http://getfit.jillianmichaels.com/abdominal-internal-oblique-exercises-2190.html", "passage_text": "The rectus abdominis, transverse abdominis, external oblique and the internal oblique make up the abdominal muscles. The internal obliques are located just underneath the external obliques and allow you to bend from the side, as well as twist your torso. These muscles also aid in improving posture. "}, {"url": "https://en.wikipedia.org/wiki/Abdominal_external_oblique_muscle", "passage_text": "From Wikipedia, the free encyclopedia. The external oblique muscle (of the abdomen) (also external abdominal oblique muscle) is the largest and the most superficial (outermost) of the three flat muscles of the lateral anterior abdomen. It is broad, thin, and irregularly quadrilateral, its muscular portion occupying the side, its aponeurosis the anterior wall of the abdomen. In most humans (especially females), the oblique is not visible, due to subcutaneous fat deposits and the small size of the muscle."}, {"url": "https://en.wikipedia.org/wiki/Abdominal_external_oblique_muscle", "passage_text": "The external oblique is situated on the lateral and anterior parts of the abdomen. It is broad, thin, and irregularly quadrilateral, its muscular portion occupying the side, its aponeurosis the anterior wall of the abdomen. In most humans (especially females), the oblique is not visible, due to subcutaneous fat deposits and the small size of the muscle."}, {"url": "http://www.healthline.com/human-body-maps/internal-oblique", "passage_text": "The internal abdominal oblique muscle ends at the bottom edge of the rib cage, the rectus sheath (fibrous tissue that covers the abdominal muscles), and the pubic crest (an area in the lower-front of the pelvis). The internal abdominal oblique muscle is located closer to the skin than the transverse abdominal muscle. This muscle supports the abdominal wall, assists in forced respiration, aids in raising pressure in the abdominal area, and rotates and turns the trunk with help from other muscles"}, {"url": "http://www.answers.com/Q/Where_is_the_obliques_muscle_located", "passage_text": "The oblique muscles are located on both sides of the abdomen running diagonally along the rectus abdominis, which is the center abdominal muscle. There are two sets of oblique … s, the external and the internal. The external obliques are more superficial while the internal obliques are a deeper muscle. 1 The internal oblique muscles are located within each side of your abdomen, attached 2  …. Fantastic Ab and Oblique Workouts for a Stronger Core When people work out at home, they tend to do the exercises they are familiar with. 3  This can lead to an unbalanced workout regimen, and that in turn can produce ineffective r…."}, {"url": "http://www.innerbody.com/image_musfov/musc14-new.html", "passage_text": "External Abdominal Oblique Muscle. The external abdominal obliques are a pair of broad, thin, superficial muscles that lie on the lateral sides of the abdominal region of the body. Contraction of these muscles may result in several different actions, but they are best known for their lateral flexion and rotation of the trunk known as a side bend. The external obliques get their name from their position in the abdomen external to the internal abdominal obliques and from the direction of their fibers, which run obliquely (diagonally) across the sides of the abdomen.... Click to read more below."}, {"url": "http://www.healthline.com/human-body-maps/external-oblique-muscle", "passage_text": "External oblique. The external oblique muscle is one of the largest parts of the trunk area. Each side of the body has an external oblique muscle. The external oblique muscle is one of the outermost abdominal muscles, extending from the lower half of the ribs around and down to the pelvis. Its lowest part connects to the the top corner of the pelvis (called the crest of the ilium), the bottom-front of the pelvis (the pubis), and the linea alba, a band of fibers that runs vertically along the inside of the abdominal wall. Together, the external oblique muscles cover the sides of the abdominal area."}, {"url": "http://www.dartmouth.edu/~humananatomy/part_5/chapter_25.html", "passage_text": "Anteriorly, the abdominal wall includes the rectus abdominis muscles, and the aponeuroses of the three muscles (the external and internal oblique and the transversus) that form much of the side of the abdomen. Posteriorly, the lumbar vertebrae and intervertebral discs project anteriorward (fig. 25-2). "}, {"url": "http://www.answers.com/Q/Where_are_the_Obliques_located", "passage_text": "The oblique muscles are located on both sides of the abdomen running diagonally along the rectus abdominis, which is the center abdominal muscle. There are two sets of obliques, the external and the internal. "}]