[{"url": "http://theemedicalassistants.com/medical-assistant-vs-nurse-similarities-and-differences/", "passage_text": "Salary is a category in which there are significant differences. On average, medical assistants earn $21,000–$31,000 per year. The salary earned by MA is typically based on the training, experience and job duties assigned by the employer. Nursing salaries are dependent upon the education and type of degree."}, {"url": "http://theemedicalassistants.com/medical-assistant-vs-nurse-similarities-and-differences/", "passage_text": "Education is an area in which there are many differences between a medical assistant and nurse. Training is necessary for an individual to successfully work as a MA. Although recommended, medical assistants are not required to go through any type of formal training program in order to"}, {"url": "http://work.chron.com/difference-between-licensed-vocational-nurse-certified-medical-assistant-9587.html", "passage_text": "There are many differences between licensed vocational nurses, or LVNs, and certified medical assistants, or CMAs. In most states, the term licensed practical nurse, or LPN, is used instead of LVN; the two are otherwise the same in terms of education, job tasks and scope of practice."}, {"url": "http://www.medicalassistantprograms.net/articles/medical-assistant-vs-nurse/", "passage_text": "Pay: The majority of medical assistants earned between $21,000 and $31,000 annually in 2007, a roughly comparable wage to a nurse aide or orderly, according to the US Labor Bureau. Meanwhile, LPNs earned between $31 and $43k per year, and most RNs earned between $47 and $69k or higher. The pay difference is mostly due to the increased responsibility and higher educational requirements in the nursing field (see: medical assistant salary)."}, {"url": "http://work.chron.com/salary-comparison-medical-assistants-vs-cnas-11442.html", "passage_text": "Average Salaries. According to the Bureau of Labor Statistics, the median annual salary for a medical assistant is $13.87 per hour, or $28,860 per year, while the median annual salary for nursing aides is $11.54 per hour, or $24,010 per year."}]