[{"url": "http://www.simplyrecipes.com/recipes/classic_meatloaf/", "passage_text": "Cover the meatloaf mixture with the rest of the ketchup. 5 Bake for 1 hour at 350°F, or until a meat thermometer inserted into the center of the meatloaf reads 155°F. Remove from oven and let sit for 10 minutes. Then use a metal spatula to gently lift the meatloaf out of the loaf pan to a serving plate. Make thick slices to serve."}, {"url": "https://chefability.wordpress.com/2009/06/08/how-to-cook-the-perfect-meatloaf/", "passage_text": "Make certain that you spread the tomato sauce evenly over the top of the loaf. 5. Bake for about 1 hour or when the internal temperature of the meatloaf reaches 160 degrees F. Remove from the oven and let it sit for about 5 minutes."}, {"url": "http://www.iknow2.net/what-temperature-do-you-cook-meatloaf/", "passage_text": "What Temperature Do You Cook Meatloaf. Meatloaf can be cooked at 375-400°F in an oven till it reaches an internal temperature of 160°. A large pack of ground meat, about two pounds, takes about one hour fifteen minutes or so. The temperature and time can vary depending on the taste and method of cooking."}, {"url": "http://www.foodnetwork.com/recipes/ina-garten/turkey-meatloaf-recipe.html", "passage_text": "Spread the ketchup evenly on top. Bake for 1 1/2 hours until the internal temperature is 160 degrees F. and the meatloaf is cooked through. (A pan of hot water in the oven under the meatloaf will keep the top from cracking.) Serve hot, at room temperature, or cold in a sandwich."}, {"url": "http://allrecipes.com/recipe/74360/the-best-meatloaf-ive-ever-made/", "passage_text": "1 Transfer the mixture to a 5x9 inch loaf pan. 2  Bake uncovered in the preheated oven 40 minutes. 3  Increase oven temperature to 400 degrees F (200 degrees C), and continue baking 15 minutes, to an internal temperature of 160 degrees F (70 degrees C). 4  In a small bowl, mix the remaining tomato sauce and ketchup."}, {"url": "http://www.iknow2.net/what-temperature-do-you-cook-meatloaf/", "passage_text": "Let it cook in the oven for one and half to two hours. Modify the cooking time depending on the size of the meat loaf. After cooking, let the meat rest for a few minutes before serving. Cut a slice of meat loaf and serve along with the cooked vegetables."}, {"url": "http://www.epicurious.com/recipes/food/views/old-fashioned-meat-loaf-355941", "passage_text": "Bake in the center of the oven until the temperature reaches 160°F in the center of the meat loaf, about 55 minutes. To check, insert an instant-read thermometer into the center of the loaf after 50 minutes and check the temperature."}]