[{"url": "https://answers.yahoo.com/question/index?qid=20071204083006AAu9Fix", "passage_text": "Swelling and induration of the left ovary; also pains in the right ovarian region with delayed scanty menses. Argentum metallicum. Bruised pain in left ovary and sensation as if ovary were growing large. Naja. Violent crampy pain in left ovary. Dr. Hughes valued it in obscure ovarian pains not inflammatory in nature. "}, {"url": "http://www.healthline.com/human-body-maps/ovary", "passage_text": "The ovary is a ductless reproductive gland in which the female reproductive cells are produced. Females have a pair of ovaries, held by a membrane beside the uterus on each side of the lower abdomen. The ovary is needed in reproduction since it is responsible for producing the female reproductive cells, or ova."}, {"url": "http://www.webmd.com/women/guide/ovarian-pain-causes-diagnosis-treatments", "passage_text": "A number of different conditions, from cysts to tumors, can cause ovarian pain. The ovaries are located in the lower abdomen. That means if you have ovarian pain, you'll most likely feel it in your lower abdomen -- below your belly button -- and pelvis. It's important to have any pelvic pain checked out by your regular doctor or obstetrician /gynecologist. Several different conditions can cause it"}, {"url": "http://www.webmd.boots.com/women/guide/ovarian-pain", "passage_text": "Pelvic inflammatory disease (PID) is an infection in the ovaries, uterus, or fallopian tubes. It is most often caused by sexually transmitted infections like gonorrhoea or chlamydia. It is one of the most common causes of pelvic pain in women. Ovarian pain causes. Ovarian pain, affecting the area around the ovaries, may be caused by several different conditions affecting the lower abdomen below the tummy button. Pain in the ovaries can either be acute or chronic. Acute ovarian pain comes on quickly (over a few minutes or days) and goes away in a short period of time"}, {"url": "http://www.innerbody.com/image/repfov.html", "passage_text": "The ovum travels from the ovary to the fallopian tube, where it may be fertilized before reaching the uterus. Fallopian Tubes. The fallopian tubes are a pair of muscular tubes that extend from the left and right superior corners of the uterus to the edge of the ovaries. The ovaries are a pair of small glands about the size and shape of almonds, located on the left and right sides of the pelvic body cavity lateral to the superior portion of"}, {"url": "http://www.healthpages.org/anatomy-function/anatomy-terms/", "passage_text": "Body Regions. Body regions describe areas of the body that have a special function or are supplied by specific blood vessels or nerves. The most widely used terms are those that describe the 9 abdominal regions shown in the image to the right. The regions are named below and the corresponding regions are labeled 1-9. Body Areas. 1  Abdominal — relating to the abdomen. 2  The abdomen is the part of the trunk between the chest and pelvis. 3  It can be divided into three regions: the front, the belly; in back the loins; and on the sides, the flanks."}, {"url": "https://en.wikipedia.org/wiki/Ovaries", "passage_text": "Birds have only one functional ovary (left), while the other remains vestigial. Ovaries in female are analogous to testes in male, in that they are both gonads and endocrine glands. Although ovaries occur in a wide variety of animals, both vertebrate and invertebrate, this article is primarily about human ovaries. In the case of human ovaries, each one is whitish in color and located alongside the lateral wall of the uterus in a region called the ovarian fossa. The fossa usually lies beneath the external iliac artery and in front of the ureter and the internal iliac artery. It is about 4 cm x 3 cm x 2 cm in size"}, {"url": "http://wanttoknowit.com/where-are-the-ovaries-located-in-the-body/", "passage_text": "They are usually found in front of the ureters, which are the tubes that take the urine from the kidneys to the bladder. Ovaries have a left and right side and are connected to the outer layer of the uterus via ligaments called ovarian ligaments. For example, if the left ovary releases the egg in May then the right ovary will release the egg in June. Sometimes one side of the ovaries is absent or non-functioning and if this occurs the other side usually takes over the responsibility for releasing the eggs. Related Article."}]