[{"url": "https://fortress.wa.gov/esd/employmentdata/reports-publications/regional-reports/county-profiles/kittitas-county-profile", "passage_text": "In terms of wages generated in the Kittitas County economy, state and local governments are the dominate sources. In 2013, state government and local government accounted for 39.2 percent, or almost four out of every ten dollars of wages earned in Kittitas County. Ellensburg is the largest city in Kittitas County, with 18,370 residents in 2013 and 44 percent of the county’s total population of 41,765 (see Population section). Per capita income in Kittitas County was estimated at $35,630 in 2012, 77.4 percent of the state average and 81.5 percent of the U.S. average. Kittitas County ranks 26th in the state (out of 39 counties) for per capita income."}, {"url": "https://fortress.wa.gov/esd/employmentdata/reports-publications/regional-reports/county-profiles/kittitas-county-profile", "passage_text": "Kittitas County is in the center of the state, 100 miles east of Seattle across the Cascade Mountain Range. The county is bordered by Chelan, Grant and Yakima counties. With 2,297 square miles, it is one of the largest counties in the state. Per capita income in Kittitas County was estimated at $35,630 in 2012, 77.4 percent of the state average and 81.5 percent of the U.S. average. Kittitas County ranks 26th in the state (out of 39 counties) for per capita income."}, {"url": "https://en.wikipedia.org/wiki/Kittitas_County,_Washington", "passage_text": "Kittitas County /ˈkɪtɨtaes/ ˈkɪtɨtæs is a county located in The.U. s state Of. washington Geography [edit]. According to the U.S. Census Bureau, the county has a total area of 2,333 square miles (6,040 km 2), of which 2,297 square miles (5,950 km 2) is land and 36 square miles (93 km 2) (1.5%) is water. The highest point in the county is Mount Daniel at 7,959 feet (2,426 m) above sea level."}, {"url": "https://fortress.wa.gov/esd/employmentdata/reports-publications/regional-reports/county-profiles/kittitas-county-profile", "passage_text": "Between 2012 and 2013 in Kittitas County: 1  Not seasonally adjusted unemployment declined from 8.3 to 7.4 percent, a nine-tenths percentage point contraction. 2  In comparison, Washington state’s unemployment rate decreased one and one-tenths percentage point (from 8.1 percent in 2012 to 7.0 percent in 2013). Per capita income in Kittitas County was estimated at $35,630 in 2012, 77.4 percent of the state average and 81.5 percent of the U.S. average. Kittitas County ranks 26th in the state (out of 39 counties) for per capita income."}, {"url": "https://gis.co.kittitas.wa.us/", "passage_text": "In using the data, users, direct and indirect, further agree to indemnify, defend, and hold harmless Kittitas County for any and all liability of any nature arising out of or resulting from the lack of accuracy, currency or completeness, or correctness of the data, the use or misuse of the data. "}, {"url": "http://publicrecords.onlinesearches.com/WA_Kittitas.htm", "passage_text": "Find Public Records in. This page lists public record sources in Kittitas County, Washington. Additional resources can be found on our Washington State Public Records page, on city pages, and on topic pages using the navigation above. Recommend a link for this page. Court Directory and Court Records Info. Directory of court locations in Kittitas County, Washington. Includes local links to searching court records, dockets, legal research, self help, and more."}, {"url": "https://en.wikipedia.org/wiki/Kittitas_County,_Washington", "passage_text": "As of the 2010 census, the population was 40,915. Its county seat and largest city is Ellensburg. The county was created on November 24, 1883 when it separated from Yakima County. There are numerous interpretations of the name, which is from the language of the Yakama Nation. Geography [edit]. According to the U.S. Census Bureau, the county has a total area of 2,333 square miles (6,040 km 2), of which 2,297 square miles (5,950 km 2) is land and 36 square miles (93 km 2) (1.5%) is water. The highest point in the county is Mount Daniel at 7,959 feet (2,426 m) above sea level."}, {"url": "http://www.co.kittitas.wa.us/", "passage_text": "The Board of Kittitas County Commissioners will meet at 2:00 pm on November 3, 2015 at the Commissioners' Auditorium, 205 W. 5th, Ellensburg, WA, Room 109, in the County Cour... Notice of Public Hearing to Consider Change in CDS Application Fees. Notice of public hearing to consider adopting the Six-Year Transportation Improvement Program for the Years 2016-2021, and the Annual Construction Program for 2016."}, {"url": "https://en.wikipedia.org/wiki/Ellensburg", "passage_text": "Ellensburg is a city in, and the county seat of, Kittitas County, Washington, United States. The population was 18,174 at the 2010 census. Ellensburg is located just east of the Cascade Range on Interstate 90 and is known as the most centrally located city in the state. Ellensburg is the home of Central Washington University (CWU). The surrounding Kittitas Valley is internationally known for the timothy-hay that it produces."}, {"url": "https://en.wikipedia.org/wiki/Kittitas_County,_Washington", "passage_text": "Kittitas County /ˈkɪtɨtaes/ ˈkɪtɨtæs is a county located in The.U. s state Of. Washington as of the 2010, census the population 40,915. 40915 Geography [edit]. According to the U.S. Census Bureau, the county has a total area of 2,333 square miles (6,040 km 2), of which 2,297 square miles (5,950 km 2) is land and 36 square miles (93 km 2) (1.5%) is water. The highest point in the county is Mount Daniel at 7,959 feet (2,426 m) above sea level."}]