[{"url": "http://rodriguez9-7.pbworks.com/w/page/10300534/Labor%20and%20Child%20labor", "passage_text": "The truth is, in Victorian Era, a child participating in child labor was about as common as a child in 2008 participating in public schooling. The Victorian Era most commonly refers to the reign of Queen Victoria that took place from approximately 1837 to 1901. In 1870, near the midst of her reign, about 750,000 children were engaged in child labor."}, {"url": "http://www.victorianchildren.org/victorian-child-labor/", "passage_text": "Chimney Sweeps – Victorian Child Labor. The life of a chimney sweep in Victorian times was nothing like what you see in Mary Poppins. It was a brutal, dreary existence for Victorian child chimney sweeps. Some were as young as 3 years old."}, {"url": "http://resources.woodlands-junior.kent.sch.uk/homework/victorians/children/working.htm", "passage_text": "Coal was the main source of power in Victorian times. It was used for cooking and heating, and for driving machinery, trains and steam ships. In order to produce more coal, the mines needed more workers and children as young as 5 years old were used to supply this need. They worked for up to 12 hours a day."}, {"url": "http://www.victorianchildren.org/victorian-child-labor/", "passage_text": "As you can see Victorian Child Labor covered a broad spectrum of occupations. To cover all of them in this article would be a monumental task to be sure. However, we will look into some of the more prevalent jobs that children did in Victorian times."}, {"url": "http://www.victorianchildren.org/victorian-child-labor/", "passage_text": "One of the on the job aspects of Victorian Child Labor was the dreadful working conditions. This was particularly magnified in the coal mines. It was dark in the mines making it hard to see and at times would cause permanent problems with sight from the constant strain on the eyes."}, {"url": "http://vichist.blogspot.com/2010/03/child-labour-in-victorian-england.html", "passage_text": "Child Labour in Victorian England. Although child labour was to arouse the strongest of emotions during the Victorian Era, it was certainly not a new phenomenon. In England children had always worked although, while Britain was a primarily agrarian society, much of the work was “hidden,” being in the fields and a part of a family’s work structure."}, {"url": "http://www.victorian-era.org/victorian-era-child-labor.html", "passage_text": "Victorian Era Child Labor. There was a dark side of this progressive nation in the form of child labor which was practiced throughout the Victorian period. Children as small as three or five year olds were employed by industrial units."}, {"url": "http://www.victorianweb.org/history/hist8.html", "passage_text": "Many children worked 16 hour days under atrocious conditions, as their elders did. Ineffective parliamentary acts to regulate the work of workhouse children in factories and cotton mills to 12 hours per day had been passed as early as 1802 and 1819."}]