[{"url": "http://www.grafixplastics.com/acetate_what.asp", "passage_text": "Many people use the term acetate film to generically refer to plastic film. However, acetate film is really a specific type of plastic material called cellulose acetate. It is made of a polymer that is made from wood-pulp and or cotton fibers."}, {"url": "http://www.ehow.com/info_8480974_acetate-fabric.html", "passage_text": "flashfilm/Photodisc/Getty Images. Acetate fabrics are made with spun filaments of cellulose taken from wood pulp. Classified as a chemical fiber textile or semi-synthetic, acetate is sometimes mixed with silk, wool or cotton to make it stronger."}, {"url": "http://www.cirfs.org/ManmadeFibres/Fibrerange/Acetate.aspx", "passage_text": "Acetate and triacetate. The term acetate fibres is used to describe fibres made from cellulose acetate. The difference between acetate and triacetate fibres lies in the number of the cellulose hydroxyl groups that are acetylated."}, {"url": "https://www.fetcheyewear.com/blog/post/all-about-acetate", "passage_text": "Cellulose acetate is hypoallergenic, made from a renewable resource, lightweight, and very strong. It is made from cutting, forming and polishing sheets of plastic. Cellulose acetate is the highest quality plastic material for eyeglasses. As the name implies, injection mold frames are made by injecting a more brittle petroleum based plastic that is liquified, then injected into an aluminum or stainless steel mold."}, {"url": "https://www.fetcheyewear.com/blog/post/all-about-acetate", "passage_text": "Cellulose acetate is a non-petroleum based plastic that is made from natural cotton and wood fibers. While petroleum products can be more expensive and harmful to the environment, cellulose acetate is made from renewable materials."}, {"url": "http://www.typesofclothingfabrics.com/acetate-fabric.shtml", "passage_text": "Acetate fabric is a man-made fibre that is commonly used for making garments and draping for home furnishings. Cellulose acetate (the scientific name) originates from cellulose the fibres of deconstructed wood pulp or cotton."}, {"url": "https://www.fetcheyewear.com/blog/post/all-about-acetate", "passage_text": "What is Acetate? Cellulose acetate is a plant-based plastic that is hypoallergenic. This material was first used for eyewear in the late 1940’s because of brittleness and other problems with previously used plastics. Today’s acetates are known for being strong, lightweight, and flexible."}]