[{"url": "http://blogs.psychcentral.com/bipolar/2013/06/supporting-loved-one-prison/", "passage_text": "I asked him to share his insights and advice for how friends and family members can support a loved one with bipolar or another serious mental illness who is in prison. He wrote this post. Everyone knows the importance of communication in maintaining one’s emotional and psychological well-being."}, {"url": "http://www.bpddemystified.com/resources/for-loved-ones", "passage_text": "Therefore, most loved ones of individuals with borderline disorder are quite relieved to learn that effective treatment is available for the disorder, and that there are ways they can help as well."}, {"url": "http://www.nami.org/template.cfm?section=by_illness&template=/contentmanagement/contentdisplay.cfm&contentid=44780", "passage_text": "Borderline Personality Disorder. Borderline personality disorder (BPD) is a serious mental illness that can be challenging for everyone involved, including the individuals with the illness, as well their friends and family members. BPD is characterized by impulsivity and instability in mood, self-image, and personal relationships."}, {"url": "http://psychgripe.blogspot.com/2011/01/borderline-personality-disorder-crime.html", "passage_text": "1) Borderline Personality Disorder is just as serious as Schizophrenia and sufferers of BPD should be given just as much clinical attention and services. I have to say, no, BPD is not the same as schizophrenia and should not in fact be treated the in the same manner."}, {"url": "http://www.bpddemystified.com/resources/for-loved-ones", "passage_text": "Therefore, a critical first step in the process of helping them and you is to learn as much as you can about the symptoms and nature of borderline disorder, and the specific situational causes of acute episodes in the member of your family with the disorder. 2."}, {"url": "http://www.mind.org.uk/information-support/types-of-mental-health-problems/borderline-personality-disorder-bpd/", "passage_text": "Explains borderline personality disorder (BPD), including possible causes and how you can access treatment and support. Includes tips for helping yourself, and guidance for friends and family. 1  Download PDF (643.0KB). |. 2  Order printed copies from our mail order service."}, {"url": "http://psychcentral.com/lib/how-to-help-a-loved-one-with-borderline-personality-disorder-part-1/", "passage_text": "Skills are learned not hardwired. In Part 2 of How to Help a Loved One with Borderline Personality Disorder, Manning discusses how to help defuse your loved one’s intense emotions, how to handle a crisis, what to do if your loved one refuses treatment and much more."}]