[{"url": "http://www.ghr.nlm.nih.gov/glossary=autosomal", "passage_text": "Refers to any of the chromosomes other than the sex-determining chromosomes (i.e., the X and Y) or the genes on these chromosomes. Definition from: GeneReviews from the University of Washington and the National Center for Biotechnology Information. "}, {"url": "https://en.wikipedia.org/wiki/Autosomal", "passage_text": "An autosome is a chromosome that is not an allosome (a sex chromosome). Autosomes appear in pairs whose members have the same form but differ from other pairs in a diploid cell, whereas members of an allosome pair may differ from one another and thereby determine sex. There are two copies of each autosome (chromosomes 1-22) in both females and males. The sex chromosomes are different: There are two copies of the X-chromosome in females, but males have a single X-chromosome and a Y-chromosome."}, {"url": "http://www.mayoclinic.org/autosomal-dominant-inheritance-pattern/IMG-20006210", "passage_text": "Print. In an autosomal dominant disorder, the mutated gene is a dominant gene located on one of the nonsex chromosomes (autosomes). You need only one mutated gene to be affected by this type of disorder. "}, {"url": "http://www.scripps.org/articles/902-autosomal-dominant", "passage_text": "A single, abnormal gene on one of the first 22 nonsex chromosomes from either parent can cause an autosomal disorder. Dominant inheritance means an abnormal gene from one parent can cause disease, even though the matching gene from the other parent is normal. The abnormal gene dominates. Autosomal dominant is one of several ways that a trait or disorder can be passed down through families. If a disease is autosomal dominant, it means you only need to get the abnormal gene from one parent in order for you to inherit the disease."}, {"url": "http://www.scripps.org/articles/902-autosomal-dominant", "passage_text": "In the case of autosomal dominant genes, a single abnormal gene on one of the autosomal chromosomes (one of the first 22 “non-sex” chromosomes) from either parent can cause the disease. One of the parents will have the disease (since it is dominant) in this mode of inheritance and that person is called the CARRIER. Autosomal dominant is one of several ways that a trait or disorder can be passed down through families. If a disease is autosomal dominant, it means you only need to get the abnormal gene from one parent in order for you to inherit"}, {"url": "http://umm.edu/health/medical/ency/articles/autosomal-dominant", "passage_text": "Definition. Autosomal dominant is one of several ways that a trait or disorder can be passed down (inherited) through families. In an autosomal dominant disease, if you inherit the abnormal gene from only one parent, you can get the disease. Often, one of the parents may also have the disease. It also depends on whether the trait is dominant or recessive. A single abnormal gene on one of the first 22 nonsex (autosomal) chromosomes from either parent can cause an autosomal disorder."}, {"url": "https://answers.yahoo.com/question/index?qid=20120308231401AA9mbgs", "passage_text": "There are only two types of chromosomes, autosomal, or sex chromosomes. There is one pair of sex chromosomes and 22 pairs of autosomes. A gene is the part of a chromosome that codes for a particular function. There can be thousands of genes on a chromosome. An autosomal gene is PKD1, which codes proteins for the kidney. A mutation in PKD1 can cause polycystic kidney disease, or related complications."}, {"url": "http://www.medicinenet.com/script/main/art.asp?articlekey=15971", "passage_text": "Autosomal recessive: A genetic condition that appears only in individuals who have received two copies of an autosomal gene, one copy from each parent. The gene is on an autosome, a nonsex chromosome. The parents are carriers who have only one copy of the gene and do not exhibit the trait because the gene is recessive to its normal counterpart gene."}]