[{"url": "https://en.wikipedia.org/wiki/Block_cipher_modes_of_operation", "passage_text": "Ehrsam, Meyer, Smith and Tuchman invented the Cipher Block Chaining (CBC) mode of operation in 1976. In CBC mode, each block of plaintext is XORed with the previous ciphertext block before being encrypted. This way, each ciphertext block depends on all plaintext blocks processed up to that point. To make each message unique, an initialization vector must be used in the first block. CFB shares two advantages over CBC mode with the stream cipher modes OFB and CTR: the block cipher is only ever used in the encrypting direction, and the message does not need to be padded to a multiple of the cipher block size (though ciphertext stealing can also be used to make padding unnecessary)."}, {"url": "http://www.cryptopp.com/wiki/CBC_Mode", "passage_text": "CBC Mode is cipher block chaining. CBC mode was originally specified by NIST in FIPS 81. The standard, issued in 1981, only offers confidentiality. Other modes, such as CCM and GCM, offer authenticated encryption which places an integrity assurance over the encrpyted data. "}, {"url": "http://www.herongyang.com/Cryptography/DES-Mode-CBC-Cipher-Block-Chaining.html", "passage_text": "As you can see from the formula and the diagram, in CBC mode, each block of plaintext is XORed with the previous ciphertext block before being encrypted to generate the current ciphertext block. In this way, each ciphertext block is depending on all plaintext blocks up to that point. This section describes what is CBC (Cipher Block Chaining) Operation Mode-each plaintext block is XORed with the ciphertext of the previous block before encryption. CBC (Cipher Block Chaining) operation mode can be described with notations defined earlier as the following formula and diagram:"}, {"url": "http://www.cisco.com/c/en/us/support/docs/security/email-security-appliance/118518-technote-esa-00.html", "passage_text": "Introduction. This document describes how to disable Cipher Block Chaining (CBC) Mode Ciphers. A security audit/scan indicated by the Email Security Appliance (ESA) has a Secure Sockets Layer (SSL) v3/Transport Layer Security (TLS) v1 Protocol Weak CBC Mode Vulnerability. "}, {"url": "https://en.wikipedia.org/wiki/CBC-MAC", "passage_text": "The message is encrypted with some block cipher algorithm in CBC mode to create a chain of blocks such that each block depends on the proper encryption of the previous block. To calculate the CBC-MAC of message one encrypts in CBC mode with zero initialization vector. The following figure sketches the computation of the CBC-MAC of a message comprising blocks using a secret key and a block cipher :"}, {"url": "http://www.freesoft.org/CIE/RFC/1423/2.htm", "passage_text": "1.1 DES in CBC Mode (DES-CBC). Message text and, if required, message signatures are encrypted using the Data Encryption Standard (DES) algorithm in the Cipher Block Chaining (CBC) mode of operation. The DES algorithm is defined in FIPS PUB 46-1 [1], and is equivalent to the Data Encryption Algorithm (DEA) provided in ANSI X3.92-1981 [2]. "}, {"url": "http://searchsecurity.techtarget.com/definition/cipher-block-chaining", "passage_text": "Cipher block chaining (CBC) is a mode of operation for a block cipher (one in which a sequence of bits are encrypted as a single unit or block with a cipher key applied to the entire block). Cipher block chaining uses what is known as an initialization vector (IV) of a certain length. "}, {"url": "http://cryptography.wikia.com/wiki/Block_cipher_modes_of_operation", "passage_text": "CBC mode of operation was invented by IBM in 1976. In the cipher-block chaining (CBC) mode, each block of plaintext is XORed with the previous ciphertext block before being encrypted. This way, each ciphertext block is dependent on all plaintext blocks processed up to that point. "}, {"url": "http://www.kb.cert.org/vuls/id/958563", "passage_text": "SSH can create this secure channel by using Cipher Block Chaining (CBC) mode encryption. This mode adds a feedback mechanism to a block cipher that operates in a way that ensures that each block is used to modify the encryption of the next block. The most straightforward solution is to use CTR mode instead of CBC mode, since this renders SSH resistant to the attack. An RFC already exists to standardise counter mode for use in SSH (RFC 4344) ..."}]