[{"url": "http://www.answers.com/Q/How_much_is_the_salary_of_a_Louisiana_State_Senator", "passage_text": "The current salary for senators, representatives and members of the  house is around 174,000 dollars. This is the average in the nation  for these workers. The amount of pay is set by statute. Currently both the Senators and Representatives are paid $1,801.00 per month. The Speaker of the House and the President of the Sena … te are paid twice that amount."}, {"url": "http://www.payscale.com/career-news/2006/11/state_senators_", "passage_text": "Let's take a look at how the state senators' pay scale varies between Arkansas and California. In Arkansas, a lawmaker’s annual salary is a paltry $14,067; while in California, state senators and representatives are paid an annual salary of $110,880. South vs. North, Salary Comparison. When comparing northern and southern states, the salary range is definitely higher up north. For instance, Michigan State Senators earn an annual salary of $79,650 per year, plus a $12,000 yearly expense allowance, which lifts their annual pay rate up to $91,650."}, {"url": "http://www.payscale.com/career-news/2006/11/state_senators_", "passage_text": "The state senators’ pay scale dips down in South Carolina; state lawmakers pull in a lowly annual salary of $10,400, and they get only $95 per day for meals and housing. Let's not even compare this with the northern end of the ACC, Maryland (salary: $40,500). South vs. North, Salary Comparison. When comparing northern and southern states, the salary range is definitely higher up north. For instance, Michigan State Senators earn an annual salary of $79,650 per year, plus a $12,000 yearly expense allowance, which lifts their annual pay rate up to $91,650."}, {"url": "https://www.washingtonpost.com/blogs/govbeat/wp/2013/08/23/how-much-are-your-legislators-paid/", "passage_text": "Legislators in seven states are paid $10,000 a year or less for their service. The 112 members of the New Mexico House and Senate receive no annual salary, while the 424 members of the New Hampshire legislature get only a token $100 a year. Lawmakers in Mississippi, Nevada, Texas, Alabama and Wyoming all take home less than five figures for their work. Legislators in Michigan, Illinois, Ohio, Massachusetts and Alaska all take home more than $50,000 a year. Six more states pay their legislators at least $40,000 a year. It’s not like legislators are shelling out a lot of their own money to get to work."}, {"url": "http://usgovinfo.about.com/od/uscongress/a/congresspay.htm", "passage_text": "That, too, is wrong. Salaries and benefits of members of the U.S. Congress have been the source of taxpayer unhappiness and myths over the years. Here are some facts for your consideration. As of 2015, the base salary for all rank-and-file members of the U.S. House and Senate is $174,000 per year, plus benefits. Salaries have not been increased since 2009. Compared to private-sector salaries, the salaries of members of Congress is lower than many mid-level executives and managers. Also See: The 10 Wealthiest Members of Congress. Rank-and-File Members: The current salary (2015) for rank-and-file members of the House and Senate is $174,000 per year. 1  Members are free to turn down pay increase and some choose to do so"}, {"url": "http://www.bestofneworleans.com/gambit/how-much-are-state-legislators-paid/Content?oid=2272886", "passage_text": "Louisiana abolished retirement benefits for lawmakers who took office after 1996. Arkansas lawmakers are much closer to Louisiana in base pay, making $15,869 annually with a per diem of $147. The figures are even lower in Mississippi: $10,000 per year and a $123 per diem. All seem better off than lawmakers in New Mexico. Other lawmakers get their base compensation of $22,800, although every member of the Legislature also receives per diem pay ($149 for every day the Legislature is in session and for committee meetings between sessions), plus mileage to and from Baton Rouge."}, {"url": "http://www.therichest.com/celebnetworth/lists/celebrity-salary/senator-salary/", "passage_text": "Senators who do not hold a leadership position within the Senate are sometimes referred to as “rank and file” senators. These senators all have the same base pay, and it’s a much more than the six dollars a session the first Senators earned back in 1989. How much does a senator make these days? Senators have a variety of health plans and providers available to them. They pay a bi-weekly premium, and enjoy some of the lowest rates of any other health care program in the nation. Retirement benefits are also important to consider when researching the question how much to senators make."}, {"url": "http://www.bestofneworleans.com/gambit/how-much-are-state-legislators-paid/Content?oid=2272886", "passage_text": "For wielding the really big gavels, Senate President John Alario, R-Westwego, and House Speaker Chuck Kleckley, R-Lake Charles, get pay boosts of about $14,870, giving each a total base pay of roughly $37,680. Other lawmakers get their base compensation of $22,800, although every member of the Legislature also receives per diem pay ($149 for every day the Legislature is in session and for committee meetings between sessions), plus mileage to and from Baton Rouge."}]