[{"url": "http://www.thinkbabynames.com/meaning/1/Macdonald", "passage_text": "Macdonald /mac-don-ald/ [3 sylls.] as a boys' name is of Scottish and Gaelic origin, and the meaning of Macdonald is son of Donald. The McDonalds were a powerful Scottish clan. "}, {"url": "http://genealogy.familyeducation.com/surname-origin/mcdonald", "passage_text": "Save Name. Last name origins & meanings: 1  Scottish: Anglicized form of Gaelic Mac Dhomhnuill, a patronymic from the personal name Domhnall, which is composed of the ancient Celtic elements domno- ‘world’ + val- ‘might’, ‘rule’. 1 Scottish: Anglicized form of Gaelic Mac Dhomhnuill, a patronymic from the personal name Domhnall, which is composed of the ancient Celtic elements domno- ‘world’ + val- ‘might’, ‘rule’. 2  This was the clan name of the Lords of the Isles in medieval Scotland"}, {"url": "http://www.last-name-meanings.com/surnames/McDonald.php", "passage_text": "Last Name Meanings and Origins. Uncover the meaning and origin of your last name, then learn how to create and preserve your own family history for generations to come. Menu › Home | Obituaries | Newspapers. Please visit Ancestry.com for further information about the McDonald last name. "}, {"url": "http://www.ancestry.com/name-origin?surname=mcdonald", "passage_text": "Mcdonald Name Meaning. Scottish: Anglicized form of Gaelic Mac Dhomhnuill, a patronymic from the personal name Domhnall, which is composed of the ancient Celtic elements domno- ‘world’ + val- ‘might’, ‘rule’. Source: Dictionary of American Family Names ©2013, Oxford University Press"}, {"url": "http://www.irishgenealogy.com.ar/genealogia/D/McDonald/mcdonald.php", "passage_text": "The old Scottish-Dalriadan name McDonald is derived from the Anglicized version of the Gaelic personal name Mac Dhomhnuill. McDonald is a patronymic surname, which belongs to the category of hereditary surnames. The surname McDonald arose from the vernacular naming tradition, whereby surnames were formed by adopting the given name of one's father, or another ancestor."}, {"url": "http://www.surnamedb.com/Surname/McDonald", "passage_text": "Recorded in the modern spellings of MacDonald and McDonald, the derivation is from the pre 10th century Gaelic name Mac Dhomhnuill. This is a compound which translates literally as The son of the world ruler. "}, {"url": "https://en.wikipedia.org/wiki/Macdonald", "passage_text": "MacDonald, Macdonald, and McDonald are Anglicised forms of the Scottish Gaelic and Irish Gaelic name MacDhòmhnaill, macdhòmhnaill which in Modern gaelic is approximated McConnell. mcconnell Frequency data from England of 1891 shows a concentration of families bearing the Macdonald surname in Lancashire and Yorkshire with a lower frequency in the northernmost counties, but overall widespread distribution throughout the country."}, {"url": "http://www.searchforancestors.com/surnames/origin/m/mcdonald.php", "passage_text": "McDonald Surname Origin. (Origin Scottish) This family was for many centuries reputed the most powerful of any in the Highlands of Scotland, being styled 'King of the Isles,' for many generations, during which they were successful in asserting their independence. Donald, from whom the clan derived their name, was his grandson. Source: An Etymological Dictionary of Family and Christian Names With an Essay on their Derivation and Import; Arthur, William, M.A.; New York, NY: Sheldon, Blake, Bleeker & CO., 1857."}, {"url": "https://en.wikipedia.org/wiki/Macdonald", "passage_text": "For the global fast food chain, see McDonald's. MacDonald, Macdonald, and McDonald are Anglicised forms of the Scottish Gaelic and Irish Gaelic name MacDhòmhnaill, macdhòmhnaill which in Modern gaelic is approximated McConnell. Mcconnell it is a patronym Where mac means son And dhomhnaill dhòmhnaill Means. of domhnall dòmhnall Frequency data from England of 1891 shows a concentration of families bearing the Macdonald surname in Lancashire and Yorkshire with a lower frequency in the northernmost counties, but overall widespread distribution throughout the country."}]