[{"url": "http://www.majordifferences.com/2014/06/difference-between-striated-and-non.html", "passage_text": "They are striated muscles, non striated muscles and cardiac muscles. Striated Muscle: The muscle which shows cross striations are called striated muscles or striped muscles. They are mostly attached to the bones by tendons and so called skeletal muscles. Their activity is under the control of will. So, they are also called voluntary muscles. Read more: Difference between Striated and Cardiac muscle. The tissue concerned with the movement of body parts and the locomotion of animals is called muscle tissue. It is also called muscular tissue or contractile tissue."}, {"url": "http://www.differencebetween.com/difference-between-smooth-muscle-and-vs-cardiac-muscle/", "passage_text": "• Smooth muscles are found in inner organs while cardiac muscles are found only in the heart. • Cardiac muscles are striated, but smooth muscles are non-striated. • Each cardiac muscle cell has one or more nuclei, but the smooth muscle cells are single nucleated. • Cardiac muscle cells are often branched, but smooth cells are non-branched. "}, {"url": "http://www.emergencymedicalparamedic.com/striated-versus-non-striated-muscles/", "passage_text": "Striated muscles are muscle which are formed by parallel fibers which are formed together to make muscle, where as non-striated muscles are made up of one single unit of muscle tissue and not parallel fibers. Striated Versus Non-Striated Muscles. Striated muscles are muscle which are formed by parallel fibers which are formed together to make muscle, where as non-striated muscles are made up of one single unit of muscle tissue and not parallel fibers. Skeletal muscles and cardiac muscles are striated."}, {"url": "http://www.majordifferences.com/2014/06/difference-between-striated-and-non.html", "passage_text": "Non striated muscle: The muscle which show no cross striations are called non striated muscles or unstriped muscles. They look smooth, hence are called smooth muscles. Their activity of these muscles are not under the control of the will of the animal, so they are known as involuntary muscles. Read more: Difference between Striated and Cardiac muscle. The tissue concerned with the movement of body parts and the locomotion of animals is called muscle tissue. It is also called muscular tissue or contractile tissue."}, {"url": "http://www.answers.com/Q/What_is_th_difference_between_striated_smooth_and_cardiac_muscle", "passage_text": "cardiac and skeletal muscles have one thing in common, that is they are both striated in contrast to the smooth muscles commonly found in the GIT. however the main diffe … rence between them is that cardiac muscles function involuntarily while skeletal muscles are under conscious control.   --thoughtfulobserver. "}, {"url": "http://www.answers.com/Q/What_the_difference_between_striated_and_non_striated_muscles", "passage_text": "There are three types of muscle tissue. Cardiac, which is the heart. Striated, or skeletal muscles and smooth muscle tissue. The smooth muscles create waves that move food dow … n the esophagus and through the intestines. The wave motion is called peristalsis. 1 person found this useful. Answered. straited are multinucleated and unstraited are uni-nucleated. straited has straitions of regular white and black band and unstraited is simple and smooth. striated muscle are voluntary while non-striated muscles r. involuntary.."}, {"url": "https://answers.yahoo.com/question/index?qid=20090409200620AAdZpxO", "passage_text": "This gives it it’s smooth appearance. Striated muscles include the skeletal and cardiac muscles. Skeletal muscle attaches to skeletons and is in charge of movements. Cardiac muscles are found only in the heart and contain multiple nuclei and sarcomeres that lead to its striated appearance. "}, {"url": "https://en.wikipedia.org/wiki/Cardiac_striated_muscle", "passage_text": "An isolated cardiac muscle cell, beating. Cardiac muscle (heart muscle) is involuntary striated muscle that is found in the walls and histological foundation of the heart, specifically the myocardium. Cardiac muscle is one of three major types of muscle, the others being skeletal and smooth muscle. "}]