[{"url": "http://chemteacher.chemeddl.org/services/chemteacher/index.php?option=com_content&view=article&id=56", "passage_text": "Titration is a laboratory method used to determine the unknown concentration of a reactant. This is a delicate procedure that requires patience and a good observation skills. Usually, an indicator is used in titration to determine the endpoint of the reaction. Once the endpoint volume is found, mathematics can be used to determine the concentration of the unknown. This procedure is commonly used in the field of analytical chemistry"}, {"url": "http://www.answers.com/Q/What_is_the_purpose_of_a_titration", "passage_text": "Making the world better, one answer at a time. The purpose of a titration is to find the equivalence point (stoichiometric point) of a solution. At the equivalence point, the moles of the titrant and analyte are equal to one another. At the midpoint of the solution, the pKa value is equal to the pH value. A titration is the use of carefully measured amounts of a known solution to determine the concentration of another. They often involve acid-base neutralisation or oxidat … ion-reduction reactions (examples would be sodium hydroxide with hydrochloric acid, or permanganate with an iron solution)."}, {"url": "http://www.answers.com/Q/What_is_the_purpose_of_a_titration", "passage_text": "The purpose of a titration is to find the equivalence point (stoichiometric point) of a solution. A titration is the use of carefully measured amounts of a known solution to determine the concentration of another. They often involve acid-base neutralisation or oxidat … ion-reduction reactions (examples would be sodium hydroxide with hydrochloric acid, or permanganate with an iron solution)."}, {"url": "http://www.avogadro.co.uk/chemeqm/acidbase/titration/phcurves.htm", "passage_text": "An indicator may be needed. Often a titration is repeated until successive titres are within 0.1 cm 3. An indicator is a substance that undergoes a change in colour when the end-point of a titration is reached. Acid-base indicators are used to signal the end of acid-base titrations. The pH curve for the strong acid-weak base titration shows that phenolphthalein is not a suitable indicator but methyl orange is fine. For the titration of weak acid-strong base, phenolphthalein, but not methyl orange, is a suitable indicator."}, {"url": "http://caitlinchemistrylabs.weebly.com/titration-lab.html", "passage_text": "2. An indicator is used to determine the equivalence point of a solution. Most indicators are weak acids that shift from acid to conjugate base forms. The color will change as the pH of the solution changes as a result. Purpose. The purpose of this lab is to perform a titration, using 10.0 mL of 1.5 M HCl to determine the molarity of a solution of NaOH with an unknown concentration with the use of the indicator phenolphthalein."}, {"url": "https://answers.yahoo.com/question/index?qid=20061017231030AAW74e6", "passage_text": "The undissociated form of the indicator is a different color than the iogenic form of the indicator. An Indicator does not change color from pure acid to pure alkaline at specific hydrogen ion concentration, but rather, color change occurs over a range of hydrogen ion concentrations. So simply: the funciton of an indicator in a titration is to provide a visual cue to indicate the end point or change in pH in the solution."}, {"url": "http://www.ehow.com/about_6549531_indicator-titration_.html", "passage_text": "Choice. Acid-base titrations often require color-changing indicators. In this titration type, an acidic solution reacts with a basic solution, and you don't know the concentration of one of them. The indicators for these titrations will change color at a certain point on the pH scale. When you reach the endpoint of your titration, the indicator changes color. This happens because any unreacted molecules in excess of those needed to reach the endpoint reacts with the indicator molecules. This changes the structure of the indicator molecule so that its color changes."}, {"url": "http://www.avogadro.co.uk/chemeqm/acidbase/titration/phcurves.htm", "passage_text": "The technique of titration is used to find out accurately how much of a chemical substance is dissolved in a given volume of a solution, that is, the concentration of the solution. The technique uses a set of apparatus with which volumes of solutions can be measured to an accuracy of greater than 0.1 cm 3. The pH curve for the strong acid-weak base titration shows that phenolphthalein is not a suitable indicator but methyl orange is fine. For the titration of weak acid-strong base, phenolphthalein, but not methyl orange, is a suitable indicator."}, {"url": "https://answers.yahoo.com/question/index?qid=20061017231030AAW74e6", "passage_text": "Weak bases should be titrated in the presence of indicators which change under slightly acidic conditions. So simply: the funciton of an indicator in a titration is to provide a visual cue to indicate the end point or change in pH in the solution. Source(s): http://chemistry.about.com/library/weekl.."}]