[{"url": "http://www.webmd.com/drugs/2/drug-91515/mucinex-dm-oral/details", "passage_text": "How to use Mucinex DM. Take this medication by mouth with or without food, as directed by your doctor, usually every 12 hours with a full glass of water. If you are self-treating, follow all directions on the product package."}, {"url": "http://www.webmd.com/drugs/2/drug-91515/mucinex-dm-oral/details", "passage_text": "Guaifenesin belongs to a class of drugs known as expectorants. It works by thinning and loosening mucus in the airways, clearing congestion, and making breathing easier. Dextromethorphan belongs to a class of drugs known as cough suppressants. It acts on a part of the brain (cough center) to reduce the urge to cough."}, {"url": "http://www.ehow.com/facts_5716620_mucinex-dm_.html", "passage_text": "Mucinex DM relieves coughing caused by the common cold, bronchitis and allergies. It contains the expectorant guaifenesin, which loosens mucus in the lungs and airways, allowing coughs to be productive. It also contains dextromethorphan, which affects the brain by suppressing the urge to cough."}, {"url": "http://fdb.rxlist.com/drugs/drug-91515-Mucinex+DM+Oral.aspx?drugid=91515&drugname=Mucinex+DM+Oral", "passage_text": "How to use Mucinex DM oral. This combination medication is used to relieve coughs caused by the common cold, bronchitis, and other breathing illnesses. Guaifenesin belongs to a class of drugs known as expectorants. It works by thinning and loosening mucus in the airways, clearing congestion, and making breathing easier."}, {"url": "http://www.everydayhealth.com/drugs/mucinex-dm", "passage_text": "It is distributed by Reckitt Benckiser in two strengths: Mucinex DM has 30 milligrams of dextromethorphan and 600 mg of guaifenesin; Mucinex DM Maximum Strength has 60 mg of dextromethorphan and 1200 mg of guaifenesin. Tablets are formulated as extended release, which are meant to work for 12 hours."}, {"url": "http://www.everydayhealth.com/drugs/mucinex-dm", "passage_text": "Mucinex DM is a cough medicine that contains dextromethorphan, a cough suppressant, and guaifenesin, an expectorant that helps loosen mucus in your throat and lungs. This combination of two drugs helps to loosen mucus or phlegm and thin out bronchial secretions, making coughs more productive."}, {"url": "http://www.everydayhealth.com/drugs/mucinex-dm", "passage_text": "5 Reviews. Mucinex DM is a cough medicine that contains dextromethorphan, a cough suppressant, and guaifenesin, an expectorant that helps loosen mucus in your throat and lungs. This combination of two drugs helps to loosen mucus or phlegm and thin out bronchial secretions, making coughs more productive."}]