[{"url": "https://www.progressive.com/understanding-insurance/entries/2009/8/31/should_you_buy_insu/", "passage_text": "If you have Rental Reimbursement coverage on your policy, you can only use it to rent a car if your personal vehicle on your policy is in the shop because of an accident. Rental coverage does not cover damage to a rental or damage caused while you're driving a rental. "}, {"url": "http://finance.zacks.com/can-car-two-separate-insurance-policies-two-different-people-10938.html", "passage_text": "If your car is worth $10,000 and it’s insured with two companies, you could conceivably get a payout of $20,000 if the car were wrecked and you filed claims with both companies. Even though several parties can have insurable interest, it’s not necessary for each interested party to carry his own policy on the car. In fact, doing so could create significant problems when it comes time to collect. Insurance companies are like any other business in that they’re in it to make money."}, {"url": "http://www.telegraph.co.uk/finance/personalfinance/insurance/motorinsurance/10985219/Car-insurance-Is-it-legal-for-my-dad-to-insure-my-car-and-name-me-as-a-driver.html", "passage_text": "Comments. My dad says he will put himself as the main person for insurance on my car with me as a named, extra driver but my friend says that's not legal and the insurer won't pay out if I crash. "}, {"url": "http://www.rac.co.uk/help/insurance/car-insurance/policy-information", "passage_text": "Depending on your age and the level of policy cover chosen, you may be entitled to drive other people's cars. If you are eligible, then the level of cover provided is third party only irrespective of the cover you have chosen under your policy. Your certificate of motor insurance will confirm if you have this cover. "}, {"url": "http://finance.zacks.com/can-car-two-separate-insurance-policies-two-different-people-10938.html", "passage_text": "Most states require drivers to carry some type of auto insurance on their vehicles. In those cases, the minimum requirement is usually basic liability protection that covers personal injury and property damage. Lenders can also require insurance to protect their financial interest in a vehicle while money is owed on it. Even though several parties can have insurable interest, it’s not necessary for each interested party to carry his own policy on the car. In fact, doing so could create significant problems when it comes time to collect. Insurance companies are like any other business in that they’re in it to make money."}, {"url": "http://www.ehow.com/info_7748520_can-insurance-policies-one-car.html", "passage_text": "Purchasing more than one policy on the same vehicle can be more expensive than adding a driver to your existing policy. Many insurance companies require you to add all licensed drivers in the household onto your policy, so you may be insuring your spouse or child twice if he maintains a separate policy. Save. Most states require all drivers to carry insurance on the vehicles they are driving. The easiest way to insure another driver in your household is to add him to your current policy; however, if you want to maintain separate policies it is legal to do so."}, {"url": "https://uk.answers.yahoo.com/question/index?qid=20130113061909AAYdwbk", "passage_text": "for instance i have a car and i am insured with my insurance company, can my friend/relative then go and take out another insurance policy from a different company so he can drive, with out having me on his policy. two separate insurance policies for two separate drivers but one car. Thank You for your help. · just now. Report Abuse. Insurance follows the car and where the car is parked. If you own the car, you can insure it, but if your friend has no ownership in the car, he has no vested interest. Does your friend live with you, if he does, then you will need to add to your insurance policy as a listed driver."}, {"url": "https://www.esurance.com/info/car/5-steps-to-switching-your-car-insurance", "passage_text": "If you're on the hunt for a new car insurance company, you don't have to wait until your current policy expires. Esurance offers free quotes online and over the phone, making it easy to shop and switch. It's a driver's market, and this 5-step guide can help you make a stress-free transition. "}, {"url": "https://www.esurance.com/info/car/teen-driver-insurance-and-college", "passage_text": "It all depends on your policy. Many car insurance policies cover listed drivers and others who have your permission to drive your car. You'll want to check your policy's stipulations before letting her get behind the wheel. That depends on your state's regulations and the insurance company's standards. Many car insurance companies, including Esurance, will sell car insurance policies to licensed minors — but only if your state allows minors to be the sole owner of a car."}]