[{"url": "http://www.madehow.com/Volume-4/Charcoal-Briquette.html", "passage_text": "Combined with other materials and formed into uniform chunks called briquettes, it is popularly used for outdoor cooking in the United States. According to the barbecue Industry Association, Americans bought 883,748 tons of charcoal briquettes in 1997. "}, {"url": "http://weima.com/usa/briquetting/", "passage_text": "Without the use of any glues or adhesives, the press creates a solid briquette which looks similar to a hockey puck. Machines can be designed for different briquette sizes and individual briquette shapes depending on the application. All models are noted for their robust construction as well as low maintenance technology."}, {"url": "https://en.wikipedia.org/wiki/Briquette", "passage_text": "Biomass briquettes are made from agricultural waste and are a replacement for fossil fuels such as oil or coal, and can be used to heat boilers in manufacturing plants, and also have applications in developing countries. Some briquettes are compressed and dried brown coal extruded into hard blocks. This is a common technique for low rank coals. They are typically dried to 12-18% moisture, and are primarily used in household and industry."}, {"url": "http://weima.com/usa/briquetting/wood.html", "passage_text": "Wood Briquette Press & Briquetting Machines. With wood briquette presses from WEIMA, valuable wood waste can be processed into compact briquettes and sold or used in conjunction with a boiler as a heating source. Wood is a pure, natural product. We should keep it that way, even when it is in briquette form. With WEIMA briquette presses, it is possible to compact wood briquettes through the application of hydraulic pressure only – free of additives or binders. There is a compatible shredder at WEIMA for your wood application."}, {"url": "http://www.ashden.org/briquettes", "passage_text": "Briquettes have been used as fuel for many years in Europe and the USA, mainly on remote farms. Since 2000, there has been a rapid increase in the production and use of wood pellets, particularly in Sweden, Germany and Austria, because they can be used in automated boilers for space heating. Key facts. 1  High pressure briquetting plant can produce over 200 tonnes of briquettes per day. 2  About five million tonnes of biomass pellets used in Europe in 2010. 3  Briquettes and pellets sell for between about US$80 and US$300 per tonne."}, {"url": "http://www.ashden.org/briquettes", "passage_text": "Briquetting makes use of biomass residues that would otherwise go to waste, this can bring a useful income stream to the farms and sawmills that produce residues. By replacing the use of wood and charcoal (often produced unsustainably) and fossil fuels, briquettes cut greenhouse gas emissions and deforestation. Briquettes are easier to store and use for cooking than wood or charcoal, because they are uniform in size and composition. Key facts. 1  High pressure briquetting plant can produce over 200 tonnes of briquettes per day. 2  About five million tonnes of biomass pellets used in Europe in 2010. 3  Briquettes and pellets sell for between about US$80 and US$300 per tonne."}, {"url": "https://en.wikipedia.org/wiki/Briquette", "passage_text": "Briquettes on a record-length barbecue of 156 metres. A briquette (or briquet) is a compressed block of coal dust or other combustible biomass material such as charcoal, sawdust, wood chips, peat, or paper used for fuel and kindling to start a fire. The term comes from the French language and is related to brick. Some briquettes are compressed and dried brown coal extruded into hard blocks. This is a common technique for low rank coals. They are typically dried to 12-18% moisture, and are primarily used in household and industry."}, {"url": "https://en.wikipedia.org/wiki/Biomass_briquettes", "passage_text": "Biomass briquettes are a biofuel substitute to coal and charcoal. Briquettes are mostly used in the developing world, where cooking fuels are not as easily available. There has been a move to the use of briquettes in the developed world, where they are used to heat industrial boilers in order to produce electricity from steam. The use of biomass briquettes has been steadily increasing as industries realize the benefits of decreasing pollution through the use of biomass briquettes. Briquettes provide higher calorific value per dollar than coal when used for firing industrial boilers. Along with higher calorific value, biomass briquettes on average saved 30–40% of boiler fuel cost. But other sources suggest that cofiring is more expensive due to the widespread availability of coal and its low cost"}]