[{"url": "http://petfoodtalk.com/dogfoodreviews/royal-canin/", "passage_text": "Royal Canin Allergies. There are many ingredients in Royal Canin dog food formulas that could cause allergic reactions in some dogs. Corn is a common allergen, and many of Royal Canin’s formulas contain both ground corn, and corn gluten meal. Wheat is another common allergen, and is contained in many of Royal Canin’s dog food formulas. The reviews of Royal Canin Dog Food are generally average. While breed specific dog foods are difficult to distinguish between, an analysis of the ingredient quality shows little differentiation between Royal Canin Dog Food and other dry dog food varieties."}, {"url": "http://www.askthecatdoctor.com/CatVomiting.html", "passage_text": "It is essential to learn about causes of feline vomiting and learn to ask your veterinarian the right cat health questions. Vomiting in cats can be caused by a problem in any part of the gastro/intestinal system from the stomach to the small intestines to the colon as well as the mouth and esophagus. Vomiting in pets can also be caused by disorders of other organs in the body as is the case with feline diabetes or feline kidney disease. "}, {"url": "http://healthypets.royalcanin.com.au/causes-of-pet-vomiting/", "passage_text": "• Intolerances and Allergies: If your pet is sensitive to certain foods, eating those foods will cause negative reactions. For example, many cats are intolerant to lactose in milk, leading to diarrhoea and vomiting when consumed. Some pets suffer from food intolerances, which can also lead to vomiting. Although eating too quickly may be a one-off or a regular occurrence, it can lead to indigestion and vomiting. The best way to combat this is to feed small meals regularly throughout the day. Some breed-specific diets (eg Labradors) help slow their rate of ingestion. You could also try a scoff-stopper bowl."}, {"url": "http://petfoodtalk.com/dogfoodreviews/royal-canin/", "passage_text": "There are many ingredients in Royal Canin dog food that have been the main cause of negative dog food reviews. The inclusion of corn, wheat and other filler ingredients is cited as a negative factor by many dog owners. The reviews of Royal Canin Dog Food are generally average. While breed specific dog foods are difficult to distinguish between, an analysis of the ingredient quality shows little differentiation between Royal Canin Dog Food and other dry dog food varieties."}, {"url": "http://petfoodtalk.com/dogfoodreviews/royal-canin/", "passage_text": "Royal Canin brand dog food formulas are manufactured by Royal Canin, Inc. Royal Canin was founded by a veterinary surgeon in 1967. The surgeon’s name was Jean Cathary. The current headquarters of Royal Canin are located in Aimargues, France. The reviews of Royal Canin Dog Food are generally average. While breed specific dog foods are difficult to distinguish between, an analysis of the ingredient quality shows little differentiation between Royal Canin Dog Food and other dry dog food varieties."}, {"url": "http://petfoodtalk.com/catfoodreviews/royal-canin/", "passage_text": "The Royal Canin Feline Gastrointestinal High Energy dry cat food is great for helping kitties with short term or long term/chronic diarrhea, loose stools, or vomiting. It helps get the kitties gastrointestinal systems back on track. This particular product can be purchased from a veterinarian. My cat, Sierra, has been eating Royal Canin ever since I adopted her from the Petco Adoption Center (Silicon Valley Humane Society) when she was a kitten. This was the food brand they were giving her at the time and I didn’t question it. Now, she’s three years old, going on four this year."}, {"url": "http://healthypets.royalcanin.com.au/causes-of-pet-vomiting/", "passage_text": "Common Causes of Vomiting. Here are some of the things which could be causing your dog or cat to vomit: • Diet Change: If you’ve recently changed your pet’s food, it could upset their digestive system. Although eating too quickly may be a one-off or a regular occurrence, it can lead to indigestion and vomiting. The best way to combat this is to feed small meals regularly throughout the day. Some breed-specific diets (eg Labradors) help slow their rate of ingestion. You could also try a scoff-stopper bowl."}, {"url": "http://healthypets.royalcanin.com.au/causes-of-pet-vomiting/", "passage_text": "Vomiting is one of the symptoms of toxicity, along with nausea and depression. These are just a few of the more common causes of vomiting – there are many more. If your pet is vomiting, it’s important to address it by taking your cat or dog to the vet. Although eating too quickly may be a one-off or a regular occurrence, it can lead to indigestion and vomiting. The best way to combat this is to feed small meals regularly throughout the day. Some breed-specific diets (eg Labradors) help slow their rate of ingestion. You could also try a scoff-stopper bowl."}, {"url": "http://petfoodtalk.com/catfoodreviews/royal-canin/", "passage_text": "Although the main ingredients included in Royal Canin cat food are top notch, the company has a tendency to include corn, and corn gluten meal, as well as some other filler type ingredients which do not offer good nutrition. In fact, some cats are allergic to these types of ingredients. My cat, Sierra, has been eating Royal Canin ever since I adopted her from the Petco Adoption Center (Silicon Valley Humane Society) when she was a kitten. This was the food brand they were giving her at the time and I didn’t question it. Now, she’s three years old, going on four this year."}, {"url": "https://answers.yahoo.com/question/index?qid=20100429181837AArNjYr", "passage_text": "My 7 yr old Maltese had bladder stones. The vet put her immediately on 1 can a day of the Royal Canin So food for urinary problems. Within 2 days my dog was vomiting and having terrible diaherrea. I took her to the vets and found she had developed pancreatitis from too much fat in the dog food. This cost her 2 nights on IV's in the vets, and me, $600. "}]