[{"url": "https://www.myhrtoolkit.com/support/variable-hours-employees/", "passage_text": "All workers qualify for 5.6 weeks paid annual leave (“holiday”) under the Working Time Regulations 1998 (“WTR”), regardless of how long they have been employed. This is called the statutory minimum holiday entitlement, and amounts to 28 days per year (inclusive of public holidays) for a full-time employee."}, {"url": "http://www3.hants.gov.uk/contract_of_employment.doc", "passage_text": "Upon termination of employment, the Employee will be entitled to pay in lieu of any unused holiday entitlement or be required to pay to the Employer pay received for holiday taken in excess of holiday entitlement."}, {"url": "https://www.nibusinessinfo.co.uk/content/holiday-pay-termination-employment", "passage_text": "Holiday pay on termination of employment. When your workers leave-even if you have dismissed them without notice for gross misconduct-they must receive pay for any statutory leave they are entitled to in the current leave year but have not taken. This entitlement is not subject to a minimum period"}, {"url": "http://www.brookes.ac.uk/services/hr/handbook/workinghours/annual/", "passage_text": "Every worker, whether full or part-time, is entitled to a minimum of 5.6 weeks (28 days) annual leave each year inclusive of bank holidays. There is no opting out of the annual leave provisions. In other words, leave must be taken, with no option to pay in lieu except on termination of employment."}, {"url": "http://www.brookes.ac.uk/services/hr/handbook/workinghours/annual/", "passage_text": "Working time regulations. Every worker, whether full or part-time, is entitled to a minimum of 5.6 weeks (28 days) annual leave each year inclusive of bank holidays. There is no opting out of the annual leave provisions. In other words, leave must be taken, with no option to pay in lieu except on termination of employment."}, {"url": "https://www.nibusinessinfo.co.uk/content/holiday-pay-termination-employment", "passage_text": "They leave seven months into the leave year having taken eight days off. This is the equivalent of 2.66 weeks (8 ÷ 3). Applying the formula above: 5.6 x (7 ÷ 12) – 2.66 = 0.61 weeks' leave to be paid in lieu. If you pay a worker on a daily basis, you can also work out their outstanding holiday entitlement in days. For example, a worker working five days per week is entitled to 5.6 weeks per year, the equivalent of 28 days (5.6 x 5). They leave three months into the year having taken four days off."}, {"url": "http://employment.govt.nz/er/holidaysandleave/annualleave/employee-resignation-termination.asp", "passage_text": "1 where the employment ends within 12 months (that is, before the employee is entitled to annual holidays). 2  where the employment ends after 12 months (that is, where an entitlement to take annual holidays has arisen for the first and any subsequent year’s employment)."}, {"url": "http://www.frettens.co.uk/site/library/frettensnews/Employment_law_QA_Annual_Leave", "passage_text": "1 All workers are entitled to a minimum of 5.6 weeks’ paid leave in each leave year, capped at 28 days for an employee working 5 days a week or more (pro-rata for part-time employees). 2  Bank and public holidays can count towards this entitlement."}]