[{"url": "https://answers.yahoo.com/question/index?qid=20081006234218AAftbzh", "passage_text": "A spiculated mass is any lump of tissue with spikes or points on the surface. I don't think it's necessarily a type a cancer. Even non-cancerous lumps can be spiculated. I believe the word just refers to the shape of the tissue mass. Spiculated masses are star shaped, as opposed to round and smooth. In cancer, a spiculated mass is a lump of tissue with spikes or points on the surface. Spiculation measures is an important strategy in the detection of breast cancer with CAD (computer aided detection) http://www.cancer.gov/Templates/db_alpha... http://radiology.rsnajnls.org/cgi/conten... Cynthia LY · 7 years ago."}, {"url": "http://www.wisegeekhealth.com/what-is-a-spiculated-mass.htm", "passage_text": "A spiculated mass is a cluster of barbed tissue that is one of the primary indicators of cancer. Rather than a smooth lump, it has spicules or thin, elongated pieces of tissue sticking out from its perimeter. These spiky tumors can appear anywhere inside the body, but are often found in the breasts or lungs. A spiculated mass will be on the periphery of a breast in instances of breast cancer. Radiotherapy, such as with a linear accelerator, might be used to help treat a spiculated mass."}, {"url": "http://www.wisegeekhealth.com/what-is-a-spiculated-mass.htm", "passage_text": "Ad. In cases of breast cancer, a spiculated mass usually exists on the periphery of the breast, not the center, and is typically discovered through ultrasonography or a mammogram, which is a screening that uses radiation to create images of breast tissue. A spiculated mass will be on the periphery of a breast in instances of breast cancer. Radiotherapy, such as with a linear accelerator, might be used to help treat a spiculated mass."}, {"url": "http://cancergrace.org/topic/lobulated-nodule", "passage_text": "A spiculated nodule would be a more classic description for a lung nodule that represents a primary lung cancer (a cancer that originates in the lung rather than travels there from another location). -Dr. And as Dr. West posted above, “A spiculated nodule would be a more classic description for a lung nodule that represents a primary lung cancer (a cancer that originates in the lung rather than travels there from another location).”."}, {"url": "http://www.wisegeekhealth.com/what-is-a-spiculated-mass.htm", "passage_text": "If a spiculated mass is the cause of breast cancer, it should be discovered by performing a mammogram. In cases of lung cancer, a CT scan of the chest will be able to detect a spiculated mass. Some studies have shown that a spiculated mass typically has at least 30 percent more progesterone receptors. A spiculated mass will be on the periphery of a breast in instances of breast cancer. Radiotherapy, such as with a linear accelerator, might be used to help treat a spiculated mass."}, {"url": "http://www.ncbi.nlm.nih.gov/pubmed/8356272", "passage_text": "Spiculated breast lesions may be caused by both benign and malignant processes, including sclerosing adenosis, postsurgical scar, radial scar, tuberculosis (rare), posttraumatic oil cysts, infiltrating ductal carcinoma, ductal carcinoma in situ (rare), infiltrating lobular carcinoma, and tubular carcinoma. "}, {"url": "http://www.healthboards.com/boards/cancer-lung/253580-does-nodule-spiculation-mean-cancer-sure.html", "passage_text": "Yesterday I had my 3rd CT Scan in 6 months...a solitary lung nodule grew from 10.9 mm to 11.7 mm to, now, 12.9 mm. This scan showed something new about the nodule, it now has spiculation. My regular doctor, who is not a lung or cancer specialist, is adamant that this is malignant cancer...and the internet says spiculations are almost always a sign of malignancy but so far I've found very little information on it. The nodule is small and the report says no adneopathy, I believe that means it hasn't spread, and it's the only nodule there (other than a 30 year old TB scar). It has irregular boarders and low density."}, {"url": "https://answers.yahoo.com/question/index?qid=20081006234218AAftbzh", "passage_text": "Spiculated mass-it refers to a type of breast cancer.Or give link to translate from English to Greek.Altavista has not it. In cancer, a spiculated mass is a lump of tissue with spikes or points on the surface. Spiculation measures is an important strategy in the detection of breast cancer with CAD (computer aided detection) http://www.cancer.gov/Templates/db_alpha... http://radiology.rsnajnls.org/cgi/conten... Cynthia LY · 7 years ago."}]