[{"url": "http://villains.wikia.com/wiki/Tobi", "passage_text": "After being thought dead in Deidara’s suicide explosion, Tobi is revealed to be the real leader of Akatsuki, who makes everyone (readers included) believe that he is Madara Uchiha. He then orders Nagato and Konan to capture Naruto in order to get his hands on Kurama. Road to Ninja. Tobi is the primary antagonist of the semi-canonical movie Road to Ninja. He appears to Naruto and Sakura and traps them into a limited version of the Infinite Tsukuyomi, both to test it and to isolate Naruto to capture him, and get his hands on Kurama."}, {"url": "http://www.thinkbabynames.com/meaning/1/Tobi", "passage_text": "Tobi /to-bi/ [2 sylls.] as a name for boys (also used as girls' name Tobi). Tobi's roots are Hebrew and English, and the name Tobi means God is good. Tobi is a version of Tobias (Hebrew): biblical name from the Old Testament. Tobi is also a form of Toby (English). Kreatif forms: Teibi, Thobi, Tybi."}, {"url": "http://www.thinkbabynames.com/meaning/1/Tobi", "passage_text": "Tobi is an unusual first name for men but a somewhat prominent surname for all people (#146011 out of 150436, Top 97%). (2000 U.S. Census). Prominent alternative forms of Tobi (not in Top 1000) are Tobe, Tobias (#419 last year) , Tobin and Toby (#605) . Tobi's roots are Hebrew and English, and the name Tobi means God is good. Tobi is a version of Tobias (Hebrew): biblical name from the Old Testament. Tobi is also a form of Toby (English). Kreatif forms: Teibi, Thobi, Tybi."}, {"url": "http://www.rxlist.com/tobi-drug.htm", "passage_text": "If you experience any of the following serious side effects, stop using tobramycin and seek emergency medical attention or notify your doctor immediately: 1  an allergic reaction (difficulty breathing; closing of the throat; swelling of the lips, tongue, or face; or hives); 2  ringing in the ears or changes in hearing; Before using tobramycin inhalation solution, tell your doctor or pharmacist if you are allergic to it; or to other aminoglycoside antibiotics (such as gentamicin); or if you have any other allergies. This product may contain inactive ingredients, which can cause allergic reactions or other problems."}, {"url": "http://villains.wikia.com/wiki/Tobi", "passage_text": "Tobi (whose original name is Obito Uchiha) is the central antagonist of the Naruto franchise and the leader of Akatsuki. He is a fallen hero from Konohagakure, the Village Hidden in the Leaves, who follows Madara Uchiha 's goal for his own gain. Road to Ninja. Tobi is the primary antagonist of the semi-canonical movie Road to Ninja. He appears to Naruto and Sakura and traps them into a limited version of the Infinite Tsukuyomi, both to test it and to isolate Naruto to capture him, and get his hands on Kurama."}, {"url": "http://www.rxlist.com/tobi-drug.htm", "passage_text": "Here is a collection of user reviews for the medication Tobi sorted by most helpful. See User Reviews. Report Problems to the Food and Drug Administration. You are encouraged to report negative side effects of prescription drugs to the FDA. Visit the FDA MedWatch website or call 1-800-FDA-1088. Before using tobramycin inhalation solution, tell your doctor or pharmacist if you are allergic to it; or to other aminoglycoside antibiotics (such as gentamicin); or if you have any other allergies. This product may contain inactive ingredients, which can cause allergic reactions or other problems."}, {"url": "http://naruto.wikia.com/wiki/Obito_Uchiha", "passage_text": "Obito Uchiha (うちはオビト, Uchiha Obito) was a member of Konohagakure 's Uchiha clan. He was believed to have died during the Third Shinobi World War, his only surviving legacy being the Sharingan he gave to his team-mate, Kakashi Hatake. Tobi was indeed accepted into Akatsuki as Sasori's replacement, partnered with Deidara. He was assigned to capture the Three-Tails. In the anime, Deidara treated Tobi to some dango before the mission, a ploy to get him to remove his mask. He turned away while he ate, preventing Deidara from seeing anything."}, {"url": "http://villains.wikia.com/wiki/Tobi", "passage_text": "Meanwhile, Tobi intercepts Naruto's squad, who is looking for either Sasuke or Itachi, to keep them away from the battle. He plays is goofy persona and toys with them, phasing through all their attacks. Upon learning about Sasuke's victory, Tobi scornfully dismisses the Konoha ninjas while displaying his Sharingan. Road to Ninja. Tobi is the primary antagonist of the semi-canonical movie Road to Ninja. He appears to Naruto and Sakura and traps them into a limited version of the Infinite Tsukuyomi, both to test it and to isolate Naruto to capture him, and get his hands on Kurama."}, {"url": "http://ling.ohio-state.edu/~tobi/", "passage_text": "ToBI is a framework for developing community-wide conventions for transcribing the intonation and prosodic structure of spoken utterances in a language variety. Because intonation and prosodic organization differ from language to language, and often from dialect to dialect within a language, there are many different ToBI systems, each one specific to a language variety and the community of researchers working on that"}]