[{"url": "http://health.costhelper.com/dentures.html", "passage_text": "1 Two to six dental implants that support a removable denture plate can cost $3,500-$30,000 or more depending on the number and type of implants (mini-implants are less expensive), denture materials (in some cases an existing denture plate can be adapted for use with implants) and any other procedures needed."}, {"url": "http://www.nytimes.com/2010/07/31/health/31patient.html", "passage_text": "An implant to replace a single tooth can cost $3,000 to $4,500, depending on where you live. Implants to replace a full or partial set of teeth can run from $20,000 to as much as $45,000."}, {"url": "http://www.nytimes.com/2010/07/31/health/31patient.html", "passage_text": "If you need to replace most or all of your teeth, dentures are clearly the cheaper alternative, costing around $2,500 for a set (upper and lower jaws). But the implants won’t move around, nor interfere with your sense of taste, as a denture might."}, {"url": "http://health.costhelper.com/dental-implant.html", "passage_text": "1 Two to six implants with a removable denture plate can cost $3,500-$30,000 or more depending on the number and type of implants (mini-implants are less expensive), denture materials (in some cases an existing denture plate can be adapted for use with implants) and any other procedures needed."}, {"url": "http://health.costhelper.com/dental-implant.html", "passage_text": "1 Two to six implants topped with a partial or full-mouth dental bridge can cost $3,500-$30,000 or more, depending on the number of implants, bridge size and materials, and any other needed procedures."}, {"url": "http://health.costhelper.com/dental-implant.html", "passage_text": "1 A single implant typically costs $2,400-$3,000, but can be $4,000-$10,000 or more if additional procedures like extractions, bone grafts, 2  Placing an abutment and a dental crown on a single implant typically adds $500-$3,000 to the cost of just the implant, for a total of $1,500-$13,000 or more."}, {"url": "http://health.costhelper.com/dental-implant.html", "passage_text": "1 Placing an abutment and a dental crown on a single implant typically adds $500-$3,000 to the cost of just the implant, for a total of $1,500-$13,000 or more."}, {"url": "http://health.costhelper.com/dentures.html", "passage_text": "1 Tooth extraction typically costs $75-$450 per tooth for a simple extraction and $150-$650 or more per tooth for a surgical extraction. 2  Depending on the number of teeth to be pulled, the total cost of getting dentures can be $1,500-$20,000 or more for a full set (uppers and lowers)."}, {"url": "http://www.docshop.com/education/dental/general-dentistry/dentures", "passage_text": "1 Patients should expect to pay approximately $1,000 for a full set (upper and lower jaw) of mid-range dentures. 2  Low-end dentures may cost as little as $300, but the difference between low-end dentures and mid-range dentures may be great in terms of comfort, longevity, and appearance."}, {"url": "http://health.costhelper.com/dentures.html", "passage_text": "1 If dentures are medically necessary, insurance might pay 15%-50% of the costs (up to the plan's annual limit, if there is one). 2  A basic denture starts at about $300-$500 per plate, or $600-$1,000 for a full set of upper and lower teeth."}]