[{"url": "http://www.allmusic.com/song/how-can-you-mend-a-broken-heart-mt0013424192", "passage_text": "Song Review by Bill Janovitz. Al Green covered this pop classic from the early Bee Gees for his monumental Let's Stay Together, and though Green's is a soulful reinvention of the song, the Bee Gees' original How Can You Mend a Broken Heart was comprised of as much R&B as any other musical influence. "}, {"url": "http://www.answers.com/Q/Who_wrote_how_can_you_mend_a_broken_heart", "passage_text": "Confidence votes 2. The song was written by Barry and Robin Gibb (of the Bee Gees) in August 1970. It was a big hit for the Bee Gees. It was later released by Al Green in his January 31, 1972 album,Let's stay Together. "}, {"url": "https://en.wikipedia.org/wiki/How_Can_You_Mend_a_Broken_Heart", "passage_text": "It was written mainly by Barry and Robin Gibb. It was the lead and first single on the group's 1971 LP Trafalgar. The B-side, a Maurice Gibb composition  Country Woman . It was their first US No. 1 single. That performance is notable for drummer Geoff Bridgford's first appearance with the band. Following the release of How Can You Mend a Broken Heart, the song had a Grammy nomination for Best Vocal Performance by a Duo, Group or Chorus among George Harrison 's  My Sweet Lord  and others."}, {"url": "https://en.wikipedia.org/wiki/How_Can_You_Mend_a_Broken_Heart", "passage_text": "Maurice Gibb possibly had a hand in the writing of How Can You Mend A Broken Heart although the song is officially credited to Barry and Robin Gibb. That performance is notable for drummer Geoff Bridgford's first appearance with the band. Following the release of How Can You Mend a Broken Heart, the song had a Grammy nomination for Best Vocal Performance by a Duo, Group or Chorus among George Harrison 's  My Sweet Lord  and others."}, {"url": "http://www.songfacts.com/detail.php?id=9099", "passage_text": "Andy Williams did NOT turn this song down! That's a common misconception. Jinny-Brighton, United Kingdom. How Can You Mend A Broken Heart is another of the Bee Gees's great songs credited to Barry and Robin that may have been cowritten by Maurice as well. Barry and Robin Gibb of the Bee Gees wrote this in the style of Andy Williams, who was a popular recording artist and television presenter at the time. It became the first #1 US hit for the group, topping the chart for four weeks"}, {"url": "http://www.azlyrics.com/lyrics/algreen/howcanyoumendabrokenheart.html", "passage_text": "I know my my clothes are all wet, tell me). How can you mend my, please help me mend my broken heart. I think I, I believe I, I've got a feeling that I want to live and live and live. Submit Corrections. Visit www.azlyrics.com for these lyrics. "}, {"url": "https://en.wikipedia.org/wiki/How_Can_You_Mend_a_Broken_Heart", "passage_text": "Barry and Robin Gibb wrote the song in August 1970 with  Lonely Days  when the Gibb brothers had reconvened following a period of break-up and alienation. Robin came to my place says Barry, and that afternoon we wrote 'How Can You Mend a Broken Heart' and that obviously was a link to us coming back together. That performance is notable for drummer Geoff Bridgford's first appearance with the band. Following the release of How Can You Mend a Broken Heart, the song had a Grammy nomination for Best Vocal Performance by a Duo, Group or Chorus among George Harrison 's  My Sweet Lord  and others."}, {"url": "http://www.metrolyrics.com/how-can-you-mend-a-broken-heart-lyrics-al-green.html", "passage_text": "How Can You Mend A Broken Heart was written by Gibb, Barry / Gibb, Robin. How Can You Mend A Broken Heart was written by Gibb, Barry / Gibb, Robin. (No other information is available for this lyric-would you like to add something today?). "}]