[{"url": "http://aboutworldlanguages.com/Finnish", "passage_text": "Finnish (Suomi) is a member of the Finnic branch of the Uralic language family. It is not an Indo-European language. Among its closest living relatives are Karelian, Veps, Ingrian and Estonian, and the almost extinct Votic and Livonian. Finnish is spoken by 4.7 million people in the Republic of Finland. It is also spoken in Canada, Estonia, Norway, Russian Federation, Sweden, United States. "}, {"url": "https://en.wikipedia.org/wiki/Finnish_language", "passage_text": "Finnish is spoken by about five million people, most of whom reside in Finland. There are also notable Finnish-speaking minorities in Sweden, Norway, Russia, Estonia, Brazil, Canada, and the United States. The majority of the population of Finland, 90.37% as of 2010, speak Finnish as their first language. It is one of the two official languages of Finland and an official minority language in Sweden. In Sweden, both standard Finnish and Meaenkieli, meänkieli A finnish, dialect are. Spoken The kven, language a dialect Of, finnish is spoken In Northern. norway"}, {"url": "https://en.wikipedia.org/wiki/Languages_of_Finland", "passage_text": "Knowledge of foreign languages and Swedish as second language in Finland, in percent of the adult population, 2005. Knowledge of the English language in Finland, 2005. According to the Eurobarometer [1] : 63% of the respondents indicated that they know English well enough to have a conversation. The three Sami languages spoken in Finland, Northern Sami, Inari Sami and Skolt Sami, have a combined native speaker population of roughly 1,800."}, {"url": "https://en.wikipedia.org/wiki/Finnish_language", "passage_text": "Finnish is one of two official languages of Finland (the other being Swedish, spoken by 5.42% of the population as of 2010) and an official language of the European Union. It enjoys the status of an official minority language in Sweden. It is one of the two official languages of Finland and an official minority language in Sweden. In Sweden, both standard Finnish and Meaenkieli, meänkieli A finnish, dialect are. Spoken The kven, language a dialect Of, finnish is spoken In Northern. norway"}, {"url": "http://www.bbc.co.uk/languages/european_languages/countries/finland.shtml", "passage_text": "Finland. Of the two official languages of Finland, Finnish is the first language spoken by 93% of the country's 5 million inhabitants. The other official language, Swedish, is spoken by around 6% of the population, most of whom live in the south west and are also speakers of Finnish. Sami sámi is a minority language in The nordic countries that is spoken by 2,000 2000 people living in the north Of, finland which is.003 % of The finnish. population"}, {"url": "https://en.wikipedia.org/wiki/Languages_of_Finland", "passage_text": "The Sami languages are a group of related languages spoken across Lapland. They are distantly related to Finnish. The three Sami languages spoken in Finland, Northern Sami, Inari Sami and Skolt Sami, have a combined native speaker population of roughly 1,800."}, {"url": "https://en.wikipedia.org/wiki/Languages_of_Finland", "passage_text": "The Swedish dialects spoken in Finland mainland are known as Finland-Swedish. There is a rich Finland-Swedish literature, including authors such as Tove Jansson, Johan Ludvig Runeberg, Edith Soedergran södergran And Zacharias. topelius The three Sami languages spoken in Finland, Northern Sami, Inari Sami and Skolt Sami, have a combined native speaker population of roughly 1,800."}, {"url": "https://en.wikipedia.org/wiki/Finnish_language", "passage_text": "Finnish (suomi (help·info) , or suomen kieli) is the language spoken by the majority of the population in Finland and by ethnic Finns outside Finland. It is one of the two official languages of Finland and an official minority language in Sweden. In Sweden, both standard Finnish and Meaenkieli, meänkieli A finnish, dialect are. Spoken The kven, language a dialect Of, finnish is spoken In Northern. norway"}]