[{"url": "http://www.guampedia.com/brown-treesnake/", "passage_text": "The brown treesnake was accidentally introduced most likely by the US military to Guam in the late 1940s or early 1950s. The brown treesnake (Boiga irregularis) is a native of Australia, Papua New Guinea, and the Solomon Islands. The snake is active at night and inhabits trees, shrubs, and forests. Although snakes are usually found in vegetation, they can be encountered almost anywhere. The brown treesnake spends most days coiled in a cool and dark location, such as a treetop or a rotted log."}, {"url": "http://pet-snakes.com/life-span-common-pet-snakes", "passage_text": "Boa Constrictor life span. Boas have a life span of 25 to 30 years on average, but like all other snakes it isn’t unheard of for them to live longer. Burmese Python life span. The Burmese has a potential life span of 25+ years of age, but in captivity the average lifespan is closer to 10 years. Corn snakes have a life span of 15 to 20 years while in captivity. Sometimes they can live longer but that is the average length of their lives. Ball Pythons life span. Ball pythons have a life span of 20 to 30 years. While that is the “average” there are many people who find their beloved pet to get much older."}, {"url": "http://pet-snakes.com/life-span-common-pet-snakes", "passage_text": "Corn Snake life span. Corn snakes have a life span of 15 to 20 years while in captivity. Sometimes they can live longer but that is the average length of their lives. Ball Pythons life span. Ball pythons have a life span of 20 to 30 years. While that is the “average” there are many people who find their beloved pet to get much older."}, {"url": "http://www.answers.com/Q/How_long_do_green_tree_snakes_live_for", "passage_text": "The green tree snake can live up to 20 years or more. The longest living Green tree snake recorded lived up to 28 years and 3 months old.:P. 3 people found this useful. Edit. "}, {"url": "http://www.reptilesmagazine.com/Care-Sheets/Snakes/Green-Tree-Python/", "passage_text": "Juveniles can be shy, so it’s best to start them off in smaller enclosures measuring 1 foot long, 1 foot wide and 1 foot tall. Adult green tree pythons make full use of the larger sizes, such as 2-feet-long-by-2-feet-wide-by-2-feet-tall enclosures or 3-feet-long-by-2-feet-wide-by-2-feet-tall enclosures. One of the biggest misconceptions about green tree pythons and arboreal snakes is that their enclosures should be very tall. Green Tree Python Size. Hatchling green tree pythons usually measure between 8 and 10 inches long. Adults average between 4 and 6 feet, with males on the lower end of this scale and females on the upper end. Males are typically more slender than females as we"}, {"url": "http://www.greenpagesaustralia.com.au/green-tree-snake", "passage_text": "Physical Characteristics. The green tree snake varies in colour. While most are green, they can also be coloured brown or black. They have a yellow throat, but beyond the throat, the underside can be blue, green, gray, brown, or remain yellow. Green tree snakes are in elevated arboreal settings most of the time, but can also be found on the ground. When they are near water sources, they prefer to stay hidden in long grass or other growth. This not only affords them some protection, but it is a good area to find prey."}, {"url": "http://www.lllreptile.com/info/library/animal-care-sheets/snakes/-/green-tree-python/", "passage_text": "The green tree python is considered by many to be one of the most beautiful snakes in the world. These arboreal pythons often exhibit a wide range of colorations. Babies are often maroon or yellow, and slowly change color and pattern as they mature. Most animals complete their color shift by two or three years of age. Green tree pythons are a small python compared to many of their close relatives. Adults may range greatly in size, but the average mature animal is between 3 and 5 feet in total length. As with many python species, chondros are long lived, and with excellent care can be expected to live well over 15 years."}, {"url": "http://2001-2009.state.gov/g/oes/ocns/inv/cs/2309.htm", "passage_text": "The brown tree snake has taken its toll on the human population, as well. Approximately 200 people have been treated for snakebites, as the snake often enters houses through air ducts or sewage lines. The brown tree snake also crawls along electrical lines, causing approximately one power outage every four days, which results in a cost of over $1 million annually. The brown tree snake is able to live for long periods of time without food, allowing the snake to survive in cargo holds of ships or planes. Aggressive and venomous, the brown tree snake has no natural predators on Guam and soon established itself throughout the entire island. It has now reached densities of up to 30,000 per square mile. The brown tree snake feeds on rats, shrews, and lizards, but prefers birds."}]