[{"url": "http://www.webmd.com/skin-problems-and-treatments/guide/plantar-warts-palmer-warts", "passage_text": "The culprit is a strain of virus called human papillomavirus or HPV. Many strains of the virus exist, and those that cause common warts on the hands and feet are not the same strains of HPV that cause genital warts. Some people mistakenly think plantar warts or palmer warts are malignant. In fact, they are not harmful. Eventually, in about two years, most warts go away without treatment"}, {"url": "http://my.clevelandclinic.org/health/diseases_conditions/hic-warts/hic_Plantar_Warts", "passage_text": "A plantar wart is a wart that occurs on the sole (plantar) of the foot, most often on the parts of the sole that receive pressure when standing or walking. Because of this pressure, plantar warts are often flat or grow inward. Plantar warts can appear alone or in a cluster (mosaic warts). Plantar warts are usually small. They tend to grow slowly and can eventually penetrate deep enough into the skin to cause discomfort or pain."}, {"url": "https://en.wikipedia.org/wiki/Plantar_wart", "passage_text": "A plantar wart also known as veruca, myrmecia and veruca plantaris is a wart caused by the human papillomavirus (HPV) occurring on the sole (Latin planta) or toes of the foot. HPV infections in other locations are not plantar; see human papillomavirus. Plantar warts occur on the soles of feet and toes. They may be painful when standing or walking. Plantar warts are often similar to calluses or corns, but can be differentiated by close observation of skin striations. Feet are covered in skin striae, which are akin to fingerprints on the feet."}, {"url": "http://www.webmd.com/skin-problems-and-treatments/tc/warts-and-plantar-warts-cause", "passage_text": "Warts and Plantar Warts-Cause. A wart develops when a human papillomavirus (HPV) infects the outer layer of skin and causes the skin cells to grow rapidly. The virus can then spread from an existing wart to other areas of the body, causing more warts. If the wart on a person's hand is caused by a type of HPV that can also cause genital warts, then there is a chance that skin contact could cause genital warts. But common warts don't cause the type of genital warts that lead to high-risk cancers. 1. WebMD Medical Reference from Healthwise."}, {"url": "http://www.emedicinehealth.com/plantar_warts/article_em.htm", "passage_text": "Plantar Warts Overview. Patient Comments Read 34 Comments Share Your Story. Warts are produced by an infection of the skin by human papillomavirus (HPV), which is the most common viral infection of the skin. Plantar warts grow on the plantar surface or the sole of the foot. They can be found anywhere in this area but tend to produce symptoms in areas of pressure and friction"}, {"url": "http://www.drpribut.com/sports/warts.htm", "passage_text": "Plantar Warts: Cause. Warts are caused by a viral infection. The virus penetrates through the skin and may often enter through traumatized or damaged skin or areas that are under repetitive stress. The virus that causes warts is the Human Papilloma Virus (HPV) of which more than 100 types exist. The subtypes of HPV most often associated with plantar warts are: 1,2,4,27 and 57. The HPV (Wart Virus) is spread by direct contact. Quite often a moist area that has skin residue is an area at risk for spreading warts."}, {"url": "http://www.westlakedermatology.com/blog/plantar-warts-symptoms-causes-and-treatment-options/", "passage_text": "Plantar warts are a distinct type of wart that typically grows on the bottom of the feet (often on pressure points like the ball or heel). Plantar warts are caused by HPV (Human Papillomavirus) which usually penetrates the skin through tiny cuts or breaks. Plantar warts are caused by an infection with the human papillomavirus (HPV) in the outer layer of skin on the sole of your feet. There are more than 100 types of HPV, but only a few types are known to cause warts on your feet."}, {"url": "http://www.emedicinehealth.com/plantar_warts/page2_em.htm", "passage_text": "Plantar Warts Causes. The HPV type 1 causes most plantar warts. The virus gains access to the skin through direct contact. It is presumed that inoculation of the skin occurs in places likely to be contaminated by others with plantar warts, like communal showers. "}, {"url": "http://www.mayoclinic.org/diseases-conditions/plantar-warts/basics/causes/con-20025706", "passage_text": "Causes. Plantar warts are caused by an infection with the human papillomavirus (HPV) in the outer layer of skin on the soles of your feet. More than 100 types of HPV exist, but only a few cause warts on your feet. Other types of HPV are more likely to cause warts on other areas of your skin or on mucous membranes."}]