[{"url": "http://www.metalroofnet.com/metal-roofing-blog/bid/153167/What-s-the-Average-Cost-of-Metal-Roofing-per-Square-Foot", "passage_text": "While metal roofing is primarily measured by the square, which is one hundred square feet, we are routinely asked for metal roof prices by the square foot. Here's what you need to know. "}, {"url": "http://www.qualitysmith.com/request/articles/articles-roofing/metal-roofing-prices/", "passage_text": "1 Steel shingle metal roof: Installation can cost at least $600 per square foot for the shingles. 2  Or run $750 per square foot for a standing seam steel roof. 3  Aluminum metal roof: Can cost anywhere between $700 and $1,200 per square foot. 4  Copper and zinc metal roofs: Averages $800 to $1,100 to purchase the materials. 1 Aluminum metal roof: Can cost anywhere between $700 and $1,200 per square foot. 2  Copper and zinc metal roofs: Averages $800 to $1,100 to purchase the materials. 3  Installation costs around $700 to"}, {"url": "http://www.improvenet.com/r/costs-and-prices/standing-seam-metal-roofing", "passage_text": "Otherwise, the cost of installing standing seam metal roofing generally ranges between $100 per square and $400 per square, depending on the quality of materials used, the experience of the contractor and the area where the home is located. The Costs. Average Minimum Cost: $400 per square ($4.00 per square foot). Average Maximum Cost: $650 per square ($6.50 per square foot). Because it's a premium alternative and may require specialized tools, many home improvement experts recommend having a professional install standing seam metal roofing."}, {"url": "http://www.sheet-metal-roofing.com/price-per-square-for-metal-roof.html", "passage_text": "Roof Costing. The average cost of new residential metal roofs is $5.50 per square foot of roof material. This is the average price per square for metal roof of mid-grade quality. A low-grade roof costs around $1.40 per square foot on the average. Some materials of high-grade quality are around $12 per square foot. Thus, the cost of new metal roof would range anywhere from $3,400 to $28,000 for a total area of 2,500 square feet. Keep in mind, the cost of material installation or removal is not yet included in these figures"}, {"url": "http://www.qualitysmith.com/request/articles/articles-roofing/metal-roofing-prices/", "passage_text": "Steel and aluminum are the most popular metal roof materials. Metal roofing prices vary depending on the material. Costs usually range somewhere between $350 to $1,100 per square. A square equals 100 square feet and is the standard sizing for most roofing materials. 1 Aluminum metal roof: Can cost anywhere between $700 and $1,200 per square foot. 2  Copper and zinc metal roofs: Averages $800 to $1,100 to purchase the materials. 3  Installation costs around $700 to"}, {"url": "https://answers.yahoo.com/question/index?qid=20091120230650AA5GBAX", "passage_text": "For mid-grade, coated metal roofing, one might expect to pay up to $4.00 per square foot, with copper tipping the scales at over $6.50 per square foot. Of course, prices fluctuate according to the market price of the various metals used, as well as their availability for metal roofing manufacturing. On the lower end of the scale, a home owner can expect to spend anywhere from $1.20 to $1.50 per square foot for a decent metal roof, which of course does not include removal and disposal of old roofing material, but covers the average cost of material and installation."}, {"url": "http://www.answers.com/Q/What_is_the_average_cost_per_square_foot_to_install_roof", "passage_text": "Another popular type of metal roof is the 24 gauge standing seam concealed fastener panel. The installed cost and materials for this type of roof typically are between $4.00 to $6.00 per square foot. Both of these roofs are available in many colors and long term warranties. One of the most popular types of metal roofs being use … d today is the 29 gauge thick exposed fastener panel, this type of roof typically cost from $2.25 to $4.00 per square foot complete with all materials and labor needed for instalation, depending on the complexity and difficulty of job."}, {"url": "http://home.costhelper.com/metal-roof.html", "passage_text": "1 Copper is the most expensive metal at $11-$12 a square foot just for the roofing material; with installation it can run $15-$18 and up per square foot, or $25,500-$39,600 for a basic single-story ranch-style house, with the price going up for complex installation work. Typical costs: 1  Installing interlocking steel shingles starts around $3-$7.50 a square foot (for labor and materials), or about $5,100-$16,500 for professional installation on a one-story ranch-style house with a gently sloping roof of 1,700-2,100 square feet."}]