[{"url": "https://en.wikipedia.org/wiki/Rhinoceros", "passage_text": "Rhinoceros (/raɪˈnɒsərəs/), often abbreviated as rhino, is a group of five extant species of odd-toed ungulates in the family Rhinocerotidae. Two of these species are native to Africa and three to Southern Asia. Rhinoceros are killed by humans for their horns, which are bought and sold on the black market, and which are used by some cultures for ornamental or traditional medicinal purposes. East Asia, specifically Vietnam, is the largest market for rhino horns."}, {"url": "http://kids.sandiegozoo.org/animals/mammals", "passage_text": "The females have glands that produce milk, which they feed to their young. There are more than 4,000 different species A group of individuals that have many of the same characteristics, and are different from all other animals in some important way. Hamsters and mice are two different species of rodent. of mammals. 1 Are vertebrates (which means they have a backbone The column of bones (spine) in the back of many animals. 2  It supports the body. 3  An animal with a backbone is called a vertebrate. or spine A stiff, sharp projection on an animal; another word for quill. ). 4  Are endothermic."}, {"url": "http://www.ducksters.com/animals/mammals.php", "passage_text": "Mammals are a particular class of animal. What makes an animal a mammal are several things. First, they must have glands that give milk. This is to feed their babies. Second, they are warm-blooded. Third, all mammals have fur or hair. Humans are mammals and so are dogs, whales, elephants, and horses. The largest land mammal is the elephant followed by the rhino and the hippo (which does spend a lot of time in the water). The smallest mammal is the Kitty's hog-nosed bat. This bat is 1.2 inches long and weighs less than 1/2 a pound."}, {"url": "http://www.awf.org/wildlife-conservation/rhinoceros", "passage_text": "Rhinos may look like prehistoric creatures, and they do date back millions of years to the Miocene era, but they are also mammals like us. There are two species of African rhinos, the white rhino and black rhino, and each is distinct in its own way. The white, or square-lipped, rhino derives its name from the Dutch word “weit,” meaning wide. It is actually gray in color and has a hump on its neck and a long face."}, {"url": "http://animals.nationalgeographic.com/animals/mammals/black-rhinoceros/", "passage_text": "They are different not in color but in lip shape. The black rhino has a pointed upper lip, while its white relative has a squared lip. The difference in lip shape is related to the animals' diets. Black rhinos are browsers that get most of their sustenance from eating trees and bushes. "}, {"url": "http://www.savetherhino.org/rhino_info/for_kids/everything_rhino", "passage_text": "3. White rhinoceros are the second largest land mammal. The white rhino is the largest rhino species and can weigh over 3500 kg (7700 lb) and is the largest land mammal after the elephant. Elephants can grow to be 7,000 kg (15,000 lb). 4. Rhinos can grow to over 6 feet tall and more than 11 feet in length. "}, {"url": "http://www.worldwildlife.org/species/white-rhino", "passage_text": "White rhinos are the second largest land mammal and their name comes from the Afrikaan’s, a West Germanic language, word “weit” which means wide and refers to the animal’s muzzle. Also known as the square-lipped rhinoceros, white rhinos have a square upper lip with almost no hair. "}, {"url": "http://a-z-animals.com/animals/rhino/", "passage_text": "The rhinoceros is a large mammal native to Africa and Asia. There are five species of rhino found in the world with 3 out of the 5 species of rhino now considered to be critically endangered. The rhino is thought to be the second biggest land mammal in the world behind the African elephant. The five species of rhinoceros are the white rhino (which is the largest species of rhino) and the black rhino which are both native to Africa and are only really distinguished in size as they look fairly similar. The rhino is prized for its horn. The horns of a rhinoceros are made of keratin, the same type of protein that makes up hair and fingernails in most animals including humans. Both African species of rhino and the Sumatran rhinoceros have two horns, while the Indian rhino and Javan rhinoceros have just one horn"}]