[{"url": "http://www.columbia.edu/itc/sipa/math/summation.html", "passage_text": "Often mathematical formulae require the addition of many variables Summation or sigma notation is a convenient and simple form of shorthand used to give a concise expression for a sum of the values of a variable. Let x 1, x 2, x 3, …x n denote a set of n numbers. x 1 is the first number in the set."}, {"url": "http://www.biology.arizona.edu/biomath/tutorials/Notation/SummationNotation.html", "passage_text": "Summation notation is used to compactly represent a sum of numbers. For example, suppose we want to compactly write the following sum, 1 + 2 + 3 + 4 + 5 + 6 + 7 + 8 + 9 + 10 + 11 + 12 + 13 + 14 + 15. Sums of numbers, such as the one above, are often called series."}, {"url": "http://www.psychstat.missouristate.edu/introbook/sbk12m.htm", "passage_text": "Sometimes if the summation notation is used in an expression and the expression must be written a number of times, as in a proof, then a shorthand notation for the shorthand notation is employed. When the summation sign  is used without additional notation, then i=1 and N are assumed."}, {"url": "http://www.columbia.edu/itc/sipa/math/summation.html", "passage_text": "Summation Notation. Often mathematical formulae require the addition of many variables Summation or sigma notation is a convenient and simple form of shorthand used to give a concise expression for a sum of the values of a variable. Let x 1, x 2, x 3, …x n denote a set of n numbers. x 1 is the first number in the set."}, {"url": "http://math.illinoisstate.edu/day/courses/old/305/contentsummationnotation.html", "passage_text": "For instance, here is the summation notation to represent the sum of the first 10 positive integers, the first sum described on this page. The annotated symbolism shown below identifies important elements used in summation notation (also called sigma notation)."}, {"url": "http://www.regentsprep.org/regents/math/algtrig/ATP1b/SigmaNotation.htm", "passage_text": "A series can be represented in a compact form, called summation notation, or sigma notation. The Greek capital letter sigma, , is used to indicate a sum. "}]