[{"url": "https://en.wikipedia.org/wiki/Kinesin", "passage_text": "A kinesin is a protein belonging to a class of motor proteins found in eukaryotic cells. Kinesins move along microtubule (MT) filaments, and are powered by the hydrolysis of adenosine triphosphate (ATP) (thus kinesins are ATPases). The active movement of kinesins supports several cellular functions including mitosis, meiosis and transport of cellular cargo, such as in axonal transport. The founding member of this superfamily, kinesin-1, was isolated as a heterotetrameric fast axonal organelle transport motor consisting of 2 identical motor subunits (KHC) and 2 light chains (KLC) via microtubule affinity purification from neuronal cell extracts."}, {"url": "http://www.merriam-webster.com/medical/kinesin", "passage_text": "Medical Definition of KINESIN. : an ATPase similar to dynein that functions as a motor protein in the intracellular transport especially of cell organelles and molecules (as mitochondria and proteins) along microtubules. Tweet. : an ATPase similar to dynein that functions as a motor protein in the intracellular transport especially of cell organelles and molecules (as mitochondria and proteins) along microtubules."}, {"url": "http://www.ks.uiuc.edu/Research/cell_motility/kinesin/", "passage_text": "The recent crystal structure of a kinesin-related motor protein with the name 'nonclaret disjunctional' (ncd) is almost identical to kinesin [Kull et al. and Sablin et al., Nature 380 (1996)], although the two proteins move in opposite directions on microtubules. Recent electron microscopy experiments have shown that the orientation of the kinesin motor domain bound to a microtubule is nucleotide-dependent. We modelled the ATP-bound protein and to identified conformational differences relative to the ADP-bound state which can be attributed to a force-producing power stroke."}, {"url": "http://www.ks.uiuc.edu/Research/cell_motility/kinesin/", "passage_text": "Fig. 1. Kinesin is the founding member of a superfamily of microtubule-based ATPase motors that perform force-generating tasks such as organelle transport and chromosome segregation. Recent electron microscopy experiments have shown that the orientation of the kinesin motor domain bound to a microtubule is nucleotide-dependent. We modelled the ATP-bound protein and to identified conformational differences relative to the ADP-bound state which can be attributed to a force-producing power stroke."}, {"url": "http://www.evolutionnews.org/2011/08/molecular_motors_enter_into_en049491.html", "passage_text": "Kinesin proteins characteristically march towards the plus end of the microtubule (that is, towards the periphery regions of the cell), while a similar motor protein (called dynein) walks in the direction of the minus end (i.e. towards the centrosome near the nucleus). A kinesin molecule typically possesses two tails on one end, which attach to the cargo, in addition to two globular heads (often called motor domains) on the other end. Some readers may recognize this elegant protein from the now-famous Harvard animation, Inner Life of the Cell (time 1:59)."}, {"url": "http://www.evolutionnews.org/2011/08/molecular_motors_enter_into_en049491.html", "passage_text": "Kinesin is responsible for transporting molecular cargo -- including chromosomes (e.g. during cell division), neurotransmitters and other important material -- along microtubule tracks from one region of the cell to another. A kinesin molecule typically possesses two tails on one end, which attach to the cargo, in addition to two globular heads (often called motor domains) on the other end. Some readers may recognize this elegant protein from the now-famous Harvard animation, Inner Life of the Cell (time 1:59)."}, {"url": "http://www.wisegeek.com/what-is-kinesin.htm", "passage_text": "Different types of kinesins may have different motor regions, tail regions of different lengths, or any of a wide variety of other slight differences. The most important feature of kinesin is its ability to walk along microtubules. Microtubules are polar in nature, meaning that they have distinct plus and minus ends. Most kinesins are only able to walk toward the plus end of a microtubule, though at least one type is able to move toward the minus end"}, {"url": "https://en.wikipedia.org/wiki/Kinesin", "passage_text": "Most kinesins walk towards the positive end of a microtubule, which, in most cells, entails transporting cargo such as protein and membrane components from the centre of the cell towards the periphery. This form of transport is known as anterograde transport. The founding member of this superfamily, kinesin-1, was isolated as a heterotetrameric fast axonal organelle transport motor consisting of 2 identical motor subunits (KHC) and 2 light chains (KLC) via microtubule affinity purification from neuronal cell extracts."}, {"url": "http://medical-dictionary.thefreedictionary.com/Kinesin", "passage_text": "kinesin. one of three mechanochemical proteins (the other two are myosin and dynesin) associated with the cytoskeleton that converts chemical energy into mechanical energy and is the driving force for the movement of vesicles and organelles along the microtubule. 1  Facebook. "}]