[{"url": "http://www.answers.com/Q/How_long_is_a_bearded_dragons_gestation_period", "passage_text": "Gestation (Gravid) for Bearded Dragons is 4 to 6 Weeks. After that allow up to 60 to 80 Days for the eggs to hatch. At about 4 months or more you can find them their new homes … . 9 people found this useful. Actually 20 years is really pushing it. Prior to the recent s … urge in breeding of dragons they lived about 12-15 years if well cared for. Due to the increase in breeding and inbreeding these days they will live for about 7-10 years if very"}, {"url": "https://answers.yahoo.com/question/index?qid=20091120083811AAaLFjO", "passage_text": "Bearded dragon gestation period is about 5 weeks. Source(s): I've been breeding and raising reptiles of all kinds for 23 years. I specialize in Beardies, Rat snakes, Boas and Pythons. I currently own 87 snakes/reptiles and growing lol. If you ever have any questions feel free to email me direct cmiz308@yahoo Happy handling! www.freewebs.com/cleveland-snakedude."}, {"url": "http://www.dogbreedinfo.com/pets/beardeddragon.htm", "passage_text": "The bearded dragon will lay about 20-30 eggs. The eggs should be incubated at 82 to 84° F for a period of 65-75 days. About 24 hours before the eggs are due to hatch they will start to collapse. Newly hatched dragons should be left in the incubator for a period of 24 hours to allow the yolk sac to be absorbed. When first born, baby bearded dragons are just under 4 inches in length and weigh about 1/10 of an ounce (2 1/2-3 grams). Adults typically are 19-23 inches and weight at least 3/4 of a pound (250 grams). The German giant morphn type can reach up to 26 inches in length."}, {"url": "http://www.answers.com/Q/How_long_is_a_bearded_dragons_gestation_period", "passage_text": "Bearded dragons can live over 20 years of age if they are properly taken care of but over 30 is kinda pushing it. Actually 20 years is really pushing it. Prior to the recent s … urge in breeding of dragons they lived about 12-15 years if well cared for. Due to the increase in breeding and inbreeding these days they will live for about 7-10 years if very well cared for."}, {"url": "https://uk.answers.yahoo.com/question/index?qid=20070828084242AAvhVBN", "passage_text": "This means that they only have to mate once for her to produce about 3 clutches of eggs, all 3-5 weeks apart. This doesn't always happen though. Eggs need to be incubated for those 65-75 days in 82-85 degree F heat. About 24 hours before they hatch, the eggs will appear to collapse. Don't breed a beardie until she is atleast 2 years old. Any time before that, and her bones might not be devoloped well enough to be able to produce & lay the eggs."}, {"url": "https://answers.yahoo.com/question/index?qid=20091120083811AAaLFjO", "passage_text": "Gestation lasts four to six weeks, once laid you will have to remove the eggs very carefully into an incubator set for 85F the eggs will hatch anywhere from 60 to 80 days, you will have to keep the baby beardies fed on bits of veggies, fruit, and pinhead crickets, they will be a lot of money and upkeep. Source(s): I've been breeding and raising reptiles of all kinds for 23 years. I specialize in Beardies, Rat snakes, Boas and Pythons. I currently own 87 snakes/reptiles and growing lol. If you ever have any questions feel free to email me direct cmiz308@yahoo Happy handling! www.freewebs.com/cleveland-snakedude."}, {"url": "https://answers.yahoo.com/question/index?qid=20091120083811AAaLFjO", "passage_text": "Pregnant usually reffers to a live birth, lizards and fish carry eggs and it's called gravid. You will need to provide your beardy with a tall container filled with peat moss or other soft substrate so she can dig and lay, if you do not provide this she may succomb to egg binding and die, or she may reabsorb the eggs. Source(s): I've been breeding and raising reptiles of all kinds for 23 years. I specialize in Beardies, Rat snakes, Boas and Pythons. I currently own 87 snakes/reptiles and growing lol. If you ever have any questions feel free to email me direct cmiz308@yahoo Happy handling! www.freewebs.com/cleveland-snakedude."}, {"url": "http://www.bio.miami.edu/ktosney/file/BDeggs1.html", "passage_text": "Egg incubation in the Australian Bearded Dragon Below are excerpts on egg incubation in bearded dragons (BD or beardies) from the Pogona list, an internet discussion list dedicated to the topic of bearded dragons (Pogona vitticeps). You will find some redundancy, and I have slightly edited some posts to make them fit this context. "}, {"url": "https://uk.answers.yahoo.com/question/index?qid=20070828084242AAvhVBN", "passage_text": "Best Answer: The gestation period is 5 weeks; after the eggs are layed, they hatch after 65-75 days. The female can lay more than one clutch of eggs, because she has the ability to retain sperm from the male. About 24 hours before they hatch, the eggs will appear to collapse. Don't breed a beardie until she is atleast 2 years old. Any time before that, and her bones might not be devoloped well enough to be able to produce & lay the eggs."}, {"url": "http://www.answers.com/Q/What_is_the_gestation_period_of_a_bearded_dragon", "passage_text": "Making the world better, one answer at a time. Gestation (Gravid) for Bearded Dragons is 4 to 6 Weeks. After that allow up to 60 to 80 Days for the eggs to hatch. At about 4 months or more you can find them their new homes. Gestation for a whitetailed deer is about 6 and 1/2 months or 200 days. Does can mate in their first year but usually not untill the second year. Does usually give birth to on … ly one fawn the first time. The second time around the doe can have twins-triplets and in rare occasions quintuplets."}]