[{"url": "http://healthland.time.com/2013/08/26/why-bmi-isnt-the-best-measure-for-weight-or-health/", "passage_text": "Follow @TIMEHealth. Body Mass Index (BMI) provides an easy way to measure obesity, but more doctors are questioning its accuracy and usefulness. BMI is supposed to estimate the amount of body fat a person carries based on height and weight, and categorizes people based on what is appropriate for their size. BMI is not an accurate measurement of someone’s health. People who might be considered overweight or obese according to their BMI, might be healthier than someone who under the BMI standards have a “perfect weight”."}, {"url": "http://msutoday.msu.edu/news/2007/research-shows-bmi-often-not-an-accurate-indicator-of-body-fat/", "passage_text": "BMI is determined by this equation: A person’s weight divided by his or her height squared. Generally a BMI of 25 or above indicates a person is overweight; 30 or above indicates obesity. A person with a higher BMI is thought to be at a greater risk of heart disease, diabetes and other weight-related problems."}, {"url": "http://healthland.time.com/2013/08/26/why-bmi-isnt-the-best-measure-for-weight-or-health/", "passage_text": "BMI readings under 18.5 mean you are underweight, and could put on a few pounds. If you fall between 18.5 and 24.9, you’re considered normal, while a BMI of 30 or higher qualifies as overweight. But in recent years, more researchers argue that it’s not the most accurate way to measure body weight. BMI is not an accurate measurement of someone’s health. People who might be considered overweight or obese according to their BMI, might be healthier than someone who under the BMI standards have a “perfect weight”."}, {"url": "http://www.medicalnewstoday.com/articles/265215.php", "passage_text": "The news hits the headlines, everybody agrees, and then all goes quiet for a while. You are of normal weight if your BMI is between 18.5 and 25, overweight if it is between 25 and 30. Anybody with a BMI of 30 or more is obese. BMI exaggerates thinness in short people and fatness in tall people. Nick Trefethen, Professor of Numerical Analysis at Oxford University's Mathematical Institute, in a letter to The Economist explained that BMI leads to confusion and misinformation. Adolphe Quetelet devised the BMI for measuring human body shape."}, {"url": "http://www.medicalnewstoday.com/articles/265215.php", "passage_text": "BMI (body mass index), which is based on the height and weight of a person, is an inaccurate measure of body fat content and does not take into account muscle mass, bone density, overall body composition, and racial and sex differences, say researchers from the Perelman School of Medicine, University of Pennsylvania. BMI exaggerates thinness in short people and fatness in tall people. Nick Trefethen, Professor of Numerical Analysis at Oxford University's Mathematical Institute, in a letter to The Economist explained that BMI leads to confusion and misinformation. Adolphe Quetelet devised the BMI for measuring human body shape."}, {"url": "http://health.howstuffworks.com/wellness/diet-fitness/weight-loss/bmi3.htm", "passage_text": "It's important to note that although BMI is accurate most of the time, it may overestimate or underestimate body fat. For example, BMI doesn't distinguish between body fat and muscle mass, which weighs more than fat. Many NFL players have been labeled obese because of their high BMI, when they actually have a low percentage of body fat. The BMI is not always accurate in elderly adults, who have often lost muscle and bone mass. Although their BMI might be within a normal range, they could still be overweight."}, {"url": "http://www.medicalnewstoday.com/articles/265215.php", "passage_text": "Thus a 6ft-tall man should have a waist circumference of 36 inches or less, while a 5ft 4in woman's waist should not exceed 32 inches. The waist-to-height ratio should be considered as a screening tool, Ashwell added. Ashwell explained that BMI does not take into account the distribution of fat around the body. Abdominal fat affects organs like the kidney, liver and heart more severely than fat around the bottom or hips. Waist circumference gives an indication of abdominal fat levels. BMI exaggerates thinness in short people and fatness in tall people. Nick Trefethen, Professor of Numerical Analysis at Oxford University's Mathematical Institute, in a letter to The Economist explained that BMI leads to confusion and misinformation. Adolphe Quetelet devised the BMI for measuring human body shape."}, {"url": "http://www.everydayhealth.com/sanjay-gupta/whats-wrong-with-bmi.aspx", "passage_text": "BMI is a mathematical equation — weight (in pounds) divided by height (in inches) squared, multiplied by 703 — to calculate an individual’s body fat. An adult with a BMI of 30 or higher, for instance, is considered obese. But because BMI is based on body weight rather than body composition, it doesn’t take into account how much of that weight is from muscle, bone or water as opposed to fat."}, {"url": "http://www.livestrong.com/article/93472-problems-bmi/", "passage_text": "Overview. The body mass index (BMI) formula uses height and weight to determine a person's amount of body fat. BMI classifies persons in four different weight ranges: underweight, normal, overweight and obese. While BMI is a fast and easy way to assess body fat content, its limitations question the effectiveness and appropriateness of using BMI as a true measurement of body fat."}, {"url": "http://healthyliving.azcentral.com/bmi-inaccurate-8894.html", "passage_text": "the body mass index has become a tool used by many health professionals because it is a simple way to measure a person s body fat based on a bmi score a doctor can assess whether a person is overweight obese fit or too thin bmi measures the fat on a person by using simple math in men s health adam eaglin reports that bmi is calculated by dividing a person s weight in pounds by height in inches squared then multiplied by 703"}]