[{"url": "https://en.wikipedia.org/wiki/Vacated_judgment", "passage_text": "A vacated judgment makes a previous legal judgment legally void. A vacated judgment is usually the result of the judgment of an appellate court, which overturns, reverses, or sets aside the judgment of a lower court. An appellate court may also vacate its own decisions. "}, {"url": "http://www.lawqa.com/qa/what-does-motion-and-order-to-vacate-judgment-granted-mean", "passage_text": "| Stacy Joel Safion. motion and order to vacate judgment granted means that a judgment was entered (most likely by default) and a party (most likely the defendant) filed a motion to set aside the default. Notice of dismissal filed w/ prej means that the action was dismissed and it cannot be brought again by the plaintiff. "}, {"url": "http://www.answers.com/Q/What_does_'vacate_the_judgment'_mean", "passage_text": "1 The judgment does not then have to be obeyed at that time. 2  A court of appeals can reverse a case and change the judgment, or reverse the case and vacate the judgment (everybody starts over and you retry the case until you get a new judgment). 3  In the UK there is a phrase known as set aside judgment. 1 A court of appeals can reverse a case and change the judgment, or reverse the case and vacate the judgment (everybody starts over and you retry the case until you get a new judgment). 2"}, {"url": "http://definitions.uslegal.com/m/motion-to-vacate-judgment/", "passage_text": "Motion to Vacate Judgment Law & Legal Definition. A motion to vacate judgment refers to a request that is filed before the court that entered the judgment to dismiss the judgment. Law prescribes specific time line and grounds for filing such motions. There are state specific laws on the subject which vary from state to state. "}, {"url": "http://www.answers.com/Q/What_does_motion_to_vacate_mean", "passage_text": "Vacate means to do away with. In court a judgment becomes final when the case is over and a judge has signed a piece of paper. The judgment is then effective until it is satis … fied (by payment, or by doing whatever the judgment says) or until the judge has a legal reason to set the judgment aside. A motion to vacate a judgment asks the court to essentially set aside the judgment. It is different from an appeal, in that an appeal asserts that the trial court either appli … ed the wrong law or applied the correct law incorrectly. A motion to vacate a judgment can be based upon a number of grounds."}, {"url": "http://www.answers.com/Q/What_does_'vacate_the_judgment'_mean", "passage_text": "Vacate is a term subject to different meanings. In GENERAL terms and in the context of a court order or decision, vacate means to overrule or to make void.. If you have a p … articular question about your case, call the Office of The Clerk of Court and ask them what it means to them. 24 people found this useful. 1 A court of appeals can reverse a case and change the judgment, or reverse the case and vacate the judgment (everybody starts over and you retry the case until you get a new judgment). 2  In the UK there is a phrase known as set aside judgment."}, {"url": "http://legal-dictionary.thefreedictionary.com/Vacated+judgment", "passage_text": "Vacate. To annul, set aside, or render void; to surrender possession or occupancy. The term vacate has two common usages in the law. With respect to real property, to vacate the premises means to give up possession of the property and leave the area totally devoid of contents. To vacate a court order or judgment means to cancel it or render it null and void. "}, {"url": "http://legal-dictionary.thefreedictionary.com/Vacate", "passage_text": "The term vacate has two common usages in the law. With respect to real property, to vacate the premises means to give up possession of the property and leave the area totally devoid of contents. To vacate a court order or judgment means to cancel it or render it null and void. A person may vacate property voluntarily or involuntarily through the issuance of an eviction order by a court"}, {"url": "http://www.answers.com/Q/What_does_'vacate_the_judgment'_mean", "passage_text": "1 In court a judgment becomes final when the case is over and a judge has signed a piece of paper. 2  The judgment is then effective until it is satisfied (by payment, or by doing whatever the judgment says) or until the judge has a legal reason to set the judgment aside. 1 A court of appeals can reverse a case and change the judgment, or reverse the case and vacate the judgment (everybody starts over and you retry the case until you get a new judgment). 2  In the UK there is a phrase known as set aside judgment."}, {"url": "https://www.sanmateocourt.org/court_divisions/small_claims/how_to_vacate_default_judgement.php", "passage_text": "You cannot appeal this kind of judgment and have a new trial until you vacate the default judgment, that is until you have the judgment removed or erased. To vacate a Default Judgment do the following: 1  Get the form called Notice of Motion to Vacate Judgment from the Small Claims Clerk. 2  Fill the form out and file it with the Small Claims Clerk together with a filing fee. 1 Get the form called Notice of Motion to Vacate Judgment from the Small Claims Clerk. 2  Fill the form out and file it with the Small Claims Clerk together with a filing fee. 3  You must do this within 30 days of the date of mailing which is written on the Entry of Judgment Notice you received from the court."}]