[{"url": "http://www.confusedaboutenergy.co.uk/index.php/heating-and-hot-water/heating-units", "passage_text": "Also, storage heaters tend to be 3.4 kw, not 3kw. So, to get 3kw of heat for your comparison, you would need two 3.4 kw heaters in your room, which at the time of writing would cost about £1.33 for a full charge, giving a cost per hour of about 16p NOT 29p."}, {"url": "http://www.thegreenage.co.uk/much-electricity-immersion-heater-use/", "passage_text": "Cost of running an immersion heater. The cost of electricity is about 14p/kWh, which means that it would cost about 45p to run a 3kW immersion heater for an hour. Normally though the immersion will turn on and off via the thermostat so the amount of time they are on fluctuates, depending on the existing temperature of the water in the hot water tank. If you take the above example and have a 3kW immersion heater it would take about 2hrs 30 to heat the water (3kW each hour, so in two and a half hours that would give 7.5kW)."}, {"url": "http://heatsave.actimedia.com/immersion.html", "passage_text": "A typical electric immersion heater for you hot water tank is 3kW (Kilowatt). With a typical daytime electric tarriff of 15p per kWh (kilowatt hour), it costs 45p per hour to heat your hot water with an immersion. Heating with gas will be significantly cheaper. Gas is currently 5p per kWh and assuming you have an old inefficient boiler running at 80% efficiency, it will be costing you 7p per kWh. Assuming you are paying 15p per kwh this equates to 15p per day or £54 per year. If the immersion is on just before you need the hot water rather than heating up hours before then the standing losses will be reduced. A simple way to save £54 is turn the immersion on 2 hour before you need the hot water."}, {"url": "https://uk.answers.yahoo.com/question/index?qid=20071215080835AAQ1H59", "passage_text": "Best Answer: It will cost about 30p per hour, 10-12p per Kw.(On a normal tariff) when actually heating the water, as it will cycle on/off via the thermostat when the cylinder is fully heated, so depending on how much hot water you actually use, count on about 40-45 pence average over 2-3 hours. Remember your immersion heater will be heating up at night, and assuming you have the Economy 7 electricity tariff, it will be heating at the cheaper night rate. It is surprising how expensive some appliances can be to run especially if they are used on a daily basis."}, {"url": "http://www.thegreenage.co.uk/much-electricity-immersion-heater-use/", "passage_text": "When you buy an immersion heater it is given a kW rating, so for example 3kW or 6kW. If you take the above example and have a 3kW immersion heater it would take about 2hrs 30 to heat the water (3kW each hour, so in two and a half hours that would give 7.5kW)."}, {"url": "https://uk.answers.yahoo.com/question/index?qid=20070411100808AA5nlnU", "passage_text": "Rating Newest Oldest. Best Answer: The heater is rated at 3Kilowatts. If left on for 1 hour you will use 3 Kw of power. The cost is around 16 pence per Kw so the cost in this case will be 48 pence. If left for a 2nd hour the thermostat will cut of the power when the water is at the preset temperature so the cost will be less. When you use the hot water though the thermostat will turn on the power. "}, {"url": "https://uk.answers.yahoo.com/question/index?qid=20071215080835AAQ1H59", "passage_text": "What size? Divide the watts by 1000, times the hours per day it will run, times .09 cents. That will be close to the daily cost. In stock tanks around here, it would be 750 watts, divided by 1000, times 24 hours, times .09 or $1.62 per day. Source(s): I'm a real electrician, not an impostor. Remember your immersion heater will be heating up at night, and assuming you have the Economy 7 electricity tariff, it will be heating at the cheaper night rate. It is surprising how expensive some appliances can be to run especially if they are used on a daily basis."}, {"url": "http://www.thehelpfulengineer.com/index.php/2011/08/how-much-does-my-immersion-heater-cost-to-heat-my-water", "passage_text": "The water in an immersion heater is heated by a 3kW element and usually takes around two hours to raise the temperature to the maximum throughout the whole tank. The average cost of electricity, day-rate, in Ireland is around 20 cent/kW hour and therefore its an easy sum; 3kW X 20 cent X 2 = 120 cent or €1.20. Once the water in the immersion heater is heated to the maximum, which is approx. 60 degrees Celsius, a thermostat kicks in and turns off the element."}, {"url": "http://www.thegreenage.co.uk/when-should-i-use-my-electric-immersion-heater/", "passage_text": "In terms of hot water, provided the hot water tank is insulated, you should be okay using the immersion for one hour a day. You might prefer 30 mins in the morning (so it is warm when you wake up) and then an hour about 4 (to coincide with coming home). "}, {"url": "http://heatsave.actimedia.com/immersion.html", "passage_text": "If you leave your immersion always switched on, think about when you use hot water. If you have a well insultated cylinder it will lose about 1 kwh per day. That is it loses the heat equivalent to a 1 kw heater being on for 1 hour. Assuming you are paying 15p per kwh this equates to 15p per day or £54 per year. If the immersion is on just before you need the hot water rather than heating up hours before then the standing losses will be reduced. A simple way to save £54 is turn the immersion on 2 hour before you need the hot water."}]