[{"url": "http://www.ask.com/world-view/main-religion-malaysia-7b724861d168c376", "passage_text": "Quick Answer. The main religion in Malaysia is Islam. Out of Malaysia's population of 29.6 million, 61.3 percent of inhabitants are Muslims, and Islam is also the country's state religion."}, {"url": "http://asia.isp.msu.edu/wbwoa/southeast_asia/malaysia/religion.htm", "passage_text": "The tolerance and acceptance of a variety of religions is clearly shown in the calendar of national holidays in Malaysia in which the most important celebrations of the 4 major traditions are all national holidays."}, {"url": "http://www.voyage99.com/culture/religions.html", "passage_text": "And Malaysia is predominantly an Islamic country, though many other religions are practiced here. Besides Islam, the other religions include Buddhism, Hinduism, Christianity, Taoism and Confucianism. Nearly all Chinese have faith in Buddhism and Taoism, but there are others who prefer Christianity."}, {"url": "http://www.ask.com/world-view/main-religion-malaysia-7b724861d168c376", "passage_text": "The three other main faiths in Malaysia are Buddhism, Christianity and Hinduism, which claim 19.8 percent, 9.2 percent and 6.3 percent of the population, respectively. Many members of the sizable Chinese community in Malaysia practice Confucianism, Taoism and traditional Chinese religion."}, {"url": "https://en.wikipedia.org/wiki/Religion_in_Malaysia", "passage_text": "Malaysia is a multicultural and multiconfessional country. As of the 2010 Population and Housing Census, 61.3 percent of the population practices Islam; 19.8 percent Buddhism; 9.2 percent Christianity; 6.3 percent Hinduism; and 1.3 percent traditional Chinese religions."}, {"url": "http://asia.isp.msu.edu/wbwoa/southeast_asia/malaysia/religion.htm", "passage_text": "Malaysia is a multi-ethnic society and as such, has a variety of major religions which occupy an important place in the daily life of its citizens. The country is officially an Islamic nation and Islam is the state religion of Malaysia."}, {"url": "http://www.asia-planet.net/malaysia/religion.htm", "passage_text": "Religion All of the world's major religions have substantial representation in Malaysia, the main adherents of each largely reflecting the multi-ethnic character of the population. The variety of religions found in Malaysia is a direct reflection of the diversity of races living there. Although Islam is the state religion of Malaysia, freedom of religion is guaranteed. The Malays are almost all Muslims."}]