[{"url": "http://www.beefboard.org/library/files/BeefCutsGuide.pdf", "passage_text": "The tables identify the primal and subprimal source of all beef cuts in this booklet and the average weights of subprimal cuts. IMPS/NAMP Numbering System IMPS (Institutional Meat Purchase Specifications) are a series of meat product specifications for the purpose of facilitating industry trade and clarification."}, {"url": "http://www.browerfarms.com/index.php?option=com_content&view=article&id=8&Itemid=7", "passage_text": "This is roughly a yield of 80% from the dressed or hanging weight-this is for a VERY LEAN Beef. A High Quality, USDA Choice Beef will yield approximately 70% of the Hanging or Dressed Weight. The yield on the take home meat weight from the live weight of the (VERY LEAN) steer is approximately 50%."}, {"url": "http://www.askthemeatman.com/yield_on_beef_carcass.htm", "passage_text": "Beef Carcass Breakdown. With an average market (live or on hoof) weight of 1,150 lbs and the average yield of 62.2%, the typical steer will produce a 715 lb. (dressed weight) carcass. The dressed beef (or carcass) will yield approximately 569 lbs. (further details below) of red meat and trim (take home meat-which includes the average weight of 27 lbs of variety meat: liver, heart, tongue, tripe, sweetbreads and brains) and 146 lbs of fat, bone and loss."}, {"url": "http://www.askmarxfoods.com/pounds-of-fillets-from-whole-salmon/", "passage_text": "According to The BoY, you’ll be getting an average fillet yield of 70%, or 11.2 ounces per pound (still pretty close to two restaurant servings per pound). Thus, for a gutted (but otherwise whole) salmon weighing about 20lbs, you can estimate an approximate yield of 14lbs/224 ounces/37 restaurant servings of fillet."}, {"url": "http://www.beefboard.org/library/files/BeefCutsGuide.pdf", "passage_text": "The eight quality grades for beef are Prime, Choice, Select, Standard, Commercial, Utility, Cutter, and Canner. Yield grades are most useful at wholesale as they help identify which carcasses or cuts will provide the greatest yield of edible meat per pound. Yield grades are identified by the numbers 1 through 5 with yield grade 1 offering the greatest yield."}, {"url": "http://www.askthemeatman.com/yield_on_beef_carcass.htm", "passage_text": "A High Quality, USDA Choice Beef will yield approximately 70% of the Hanging or Dressed Weight. The yield on the take home meat weight from the live weight of the (VERY LEAN) steer is approximately 50%. Click here to see the complete breakdown on the weight, percentage and types of cuts available on a VERY LEAN Beef."}]