[{"url": "http://medical-dictionary.thefreedictionary.com/target+organ", "passage_text": "subfornical organ. a small tubercle in the floor of the third ventricle. target organ. the organ affected by a particular hormone. tubular organ. an organ characterized by the presence of a lumen and four concentric tunics in its wall; centrifugally the layers are mucosal, submucosal, muscular and adventitia-serosal. sense o's (sensory o's) organs that receive stimuli that give rise to sensations, i.e., organs that translate certain forms of energy into nerve impulses that are perceived as special sensations. spiral organ organ of Corti. target organ"}, {"url": "http://medical-dictionary.thefreedictionary.com/target+tissue", "passage_text": "target organ. the organ affected by a particular hormone. tubular organ. an organ characterized by the presence of a lumen and four concentric tunics in its wall; centrifugally the layers are mucosal, submucosal, muscular and adventitia-serosal. target organ, 1 an organ intended to receive a therapeutic dose of irradiation, such as the kidney when high-energy x-rays or gamma rays are beamed to the renal area for the treatment of a tumor."}, {"url": "http://medical-dictionary.thefreedictionary.com/target+tissue", "passage_text": "A tissue or organ on which a hormone exerts its action; generally, a tissue or organ with appropriate receptors for a hormone. Synonym(s): target (3) . ; target tissue tissue/cells (e.g. endocrine gland/non-endocrine gland/specific tissues) on which a hormone acts. target organ, 1 an organ intended to receive a therapeutic dose of irradiation, such as the kidney when high-energy x-rays or gamma rays are beamed to the renal area for the treatment of a tumor."}, {"url": "http://www.merriam-webster.com/dictionary/target", "passage_text": "Medical Definition of TARGET. 1. : something to be affected by an action or development; specifically: an organ, part, or tissue that is affected by the action of a hormone. 2. Full Definition of TARGET. 1. : a small round shield. 2. a: a mark to shoot at b: a target marked by shots fired at it c: something or someone fired at or marked for attack d: a goal to be achieved. 3. a: an object of ridicule or criticism b: something or someone to be affected by an action or development. 4."}, {"url": "http://www.biology-online.org/dictionary/Target_organ", "passage_text": "A tissue or organ upon which a hormone exerts its action; generally, a tissue or organ with appropriate receptors for a hormone. Synonym: target. Please contribute to this project, if you have more information about this term feel free to edit this page. "}, {"url": "http://medical-dictionary.thefreedictionary.com/target+tissue", "passage_text": "3 an organ most affected by a specific hormone, such as the thyroid gland, which is the target organ of thyroid stimulating hormone secreted by the anterior pituitary gland. Endocrinology A specific organ that a particular hormone affects. target organ, 1 an organ intended to receive a therapeutic dose of irradiation, such as the kidney when high-energy x-rays or gamma rays are beamed to the renal area for the treatment of a tumor."}, {"url": "http://www.thefreedictionary.com/target+cell", "passage_text": "1. target cell-any cell that has a specific receptor for an antigen or antibody or hormone or drug, or is the focus of contact by a virus or phagocyte or nerve fiber etc. "}, {"url": "http://www.medilexicon.com/medicaldictionary.php?t=63226", "passage_text": "target organ. Definitions: 1. a tissue or organ on which a hormone exerts its action; generally, a tissue or organ with appropriate receptors for a hormone. Synonyms: target3. The definition information for target organ is provided by Stedman's. You can search our medical dictionary here."}, {"url": "http://medical-dictionary.thefreedictionary.com/target+organ", "passage_text": "3 an organ most affected by a specific hormone, such as the thyroid gland, which is the target organ of thyroid stimulating hormone secreted by the anterior pituitary gland. Endocrinology A specific organ that a particular hormone affects. sense o's (sensory o's) organs that receive stimuli that give rise to sensations, i.e., organs that translate certain forms of energy into nerve impulses that are perceived as special sensations. spiral organ organ of Corti. target organ the organ affected by a particular hormone."}]