[{"url": "http://www.ercim.eu/publication/Ercim_News/enw63/sevinc.html", "passage_text": "The (long-term) vision of Document Security is to ensure that information in documents can be protected by mechanisms that enforce a security and privacy policy, and that the mechanisms are not limited to a particular platform or even document processor. Document Security has resulted in a few spin-off projects such as a Trusted Platform Module (TPM) emulator for Linux and an evaluation of XML-diff algorithms."}, {"url": "http://www.ercim.eu/publication/Ercim_News/enw63/sevinc.html", "passage_text": "Document Security is motivated by the fact that enterprises must secure many of the documents they process for reasons that include protecting a customer's privacy in accordance with the law, and gaining an advantage over competitors by not sharing trade secrets. Document Security has resulted in a few spin-off projects such as a Trusted Platform Module (TPM) emulator for Linux and an evaluation of XML-diff algorithms."}, {"url": "http://filebound.com.au/what-is-document-security/", "passage_text": "We use banks to protect our money, insurance plans to protect our physical assets and various systems to protect ourselves. Your company’s documents are a critical component to accomplishing your mission and achieving your goals. Your long-term success is dependent upon your ability to protect and manage these assets. Effectively securing your documents provides protection from unauthorized access and the associated risks."}, {"url": "https://support.office.com/en-us/article/Trusted-documents-CF872BD8-47EC-4C02-BAA5-1FDBA1A11B53", "passage_text": "Use the following instructions to make your file a trusted a document. The following image is an example of the Message Bar when macros are in the file. Click the File tab. Click Info. In the Security Warning section, click Enable Content. Two options appear: Enable All Content and Advanced Options. "}, {"url": "https://www.dsssecure.com/", "passage_text": "Document Security Systems, Inc. (NYSE MKT: DSS), (DSS), a leader in anti-counterfeiting and authentication solutions, reported results for the fourth quarter and for the full-year of 2014. 08.12.2014 Document Security Systems Reports Second Quarter of 2014 Financial Results. ROCHESTER, NY August 12, 2014 Document Security Systems, Inc. (NYSE MKT: DSS) (DSS), a leader in anti-counterfeiting and authentication solutions, reported results for the second quarter ending June 30, 2014."}, {"url": "http://www.answers.com/Q/What_is_document_security", "passage_text": "Split and merge into it. Expert answer by Peter Zavon. Confidence votes 52.5K. Document security is the process of ensuring the a document is correctly marked as to the level of security required for the information it contains, and that it receives that level of security. "}, {"url": "https://www.southwest.com/html/generated/help/faqs/security_document_faq.html", "passage_text": "View All | Close All. A Security Document is a document containing your confirmation code, name, and flight information, and it confirms that you are holding a reservation. A Security Document may be provided to assist you in passing through a TSA Security Checkpoint. An Enhanced Security Document is typically issued in place of a boarding pass when a reservation requires manual processing by an airport Employee, such as when you need to exchange your ticket, verify age, or fill out paperwork at the airport prior to receiving a boarding pass."}, {"url": "http://filebound.com.au/what-is-document-security/", "passage_text": "Other than locking file rooms or storage devices there simply aren’t a lot of options when it comes to securing paper documents. Some Document Management systems provide some level of document security by requiring that paper files be checked out by reading a file ID barcode and identifying the user requesting the file. These systems, are diligently used to prevent unauthorized user from gaining access to files they shouldn’t have. Your company’s documents are a critical component to accomplishing your mission and achieving your goals. Your long-term success is dependent upon your ability to protect and manage these assets. Effectively securing your documents provides protection from unauthorized access and the associated risks."}, {"url": "http://www.adobe.com/security.html", "passage_text": "At Adobe, the security of your digital experiences is our priority. From our rigorous internal software development process and tools to our cross-functional incident response team, we strive to be proactive, nimble, and accurate in all aspects of security. Proactive efforts. Adobe believes it can achieve the best security through ongoing proactive measures and deployment of multiple defense-in-depth methods. We take pride in the company-wide best practices, processes, and tools that help ensure your information is safe whenever you use Adobe products and services."}, {"url": "https://www.southwest.com/html/generated/help/faqs/security_document_faq.html", "passage_text": "A Security Document itself does not permit access to priority lanes. However, if you are traveling on Business Select or are an A-List card holder, you will be able to use your Enhanced Security Document to access priority lanes (where available). An Enhanced Security Document is typically issued in place of a boarding pass when a reservation requires manual processing by an airport Employee, such as when you need to exchange your ticket, verify age, or fill out paperwork at the airport prior to receiving a boarding pass."}]