[{"url": "http://www.outback-australia-travel-secrets.com/australian-outback-facts.html", "passage_text": "1 The Outback covers most of Australia. 2  It neither has a specific size, nor a specific location. 3  Outback is a term that is used for any sparsely populated regions of Australia. 4  Australia's population is very much concentrated in and around a few cities on the eastern, southern and south-western coast."}, {"url": "https://www.ego4u.de/de/read-on/countries/australia/tour/outback", "passage_text": "So maybe, rather than asking to “see the Outback”, investigate the different Outback attractions, or the different options to travel across part of the Australian Outback. Help your travel agent help you, by being more specific about what you want to see or do."}, {"url": "https://www.ego4u.de/de/read-on/countries/australia/tour/outback", "passage_text": "“The Australian Outback” is not an exact location. The term Outback is used to describe the emptiness, (Abgeschiedenheit) remoteness, and the huge distances of inland Australia, and the fact that most people still don’t know much about it."}, {"url": "https://www.ego4u.de/de/read-on/countries/australia/tour/outback", "passage_text": "To understand the Australian Outback you need to know that Australia is one of the most urbanized countries in the world. Our population is concentrated in the cities along the southern and eastern coast, or not far from it."}, {"url": "http://www.outback-australia-travel-secrets.com/australian-outback-facts.html", "passage_text": "1 Therefore the Australian Outback spans several thousand kilometres from east to west, and from north to south. 2  When overseas visitors mention the Outback they usually refer to the area near Alice Springs and Uluru/Ayers Rock."}, {"url": "http://www.outback-australia-travel-secrets.com/australian-outback-facts.html", "passage_text": "How big is the Outback of Australia? 1  The Outback covers most of Australia. 2  Australia's population is very much concentrated in and around a few cities on the eastern, southern and south-western coast. 3  Therefore the Australian Outback spans several thousand kilometres from east to west, and from north to south. 4  When overseas visitors mention the ..."}, {"url": "http://traveloutbackaustralia.com/start-here/where-is-the-outback.html", "passage_text": "In other words, the outback includes the arid/desert regions of the Northern Territory, South Australia, Queensland, New South Wales and Western Australia. The famous outback town, Alice Springs, is roughly at the centre of the outback (and the Australian continent!) and is the outback’s capital."}, {"url": "http://www.outback-australia-travel-secrets.com/australian-outback-facts.html", "passage_text": "1 When overseas visitors mention the Outback they usually refer to the area near Alice Springs and Uluru/Ayers Rock. 2  This region is located in the middle of the Australian continent and is often called the red centre."}, {"url": "http://traveloutbackaustralia.com/where-is-the-outback.html/", "passage_text": "We have our own idea about where the Outback is. To us, the real Outback is Australia’s heart and soul, Central Australia. It’s the arid/desert regions that surround it in the Northern Territory, South Australia, Queensland and Western Australia, with the Outback town, Alice Springs, at its centre."}, {"url": "http://www.outback-australia-travel-secrets.com/australian-outback-dangers.html", "passage_text": "Snakes are the number one fear of most Outback travellers. Australian snakes are the most dangerous in the world. Or so they say... Well, fact is, the  most dangerous snake in the world , the Australian Inland Taipan, never killed anyone. To date not a single person died from the bite of the Inland Taipan."}]