[{"url": "http://community.screwfix.com/threads/laying-foundations-for-an-extension-cost.130223/", "passage_text": "Hi, Can you please help and advise me what a rough cost would be for laying foundations for an extension/conservatory - 3.0m x 3.0m. Hire of digger, removal of soil (3 times what you dig out in volume!!), concrete readymix and oversite including DPM, insulation etc cost me approximately £1500. I had to dig down and have 1m footings 600mm wide."}, {"url": "http://www.costowl.com/home-improvement/foundations-framing-install-cost.html", "passage_text": "1 Labor costs to pour and form concrete run somewhere around $3.50 to $7.00 per square foot. 2  One homeowner paid $11,000 for a crawl space for a 1,500 square foot home. 3  One customer in Texas received a quote for a 2,500 square foot foundation slab of about $20,000. 1 Concrete is typically measured by cubic yards (3’x3’x3’). 2  An average cost for a cubic yard of concrete is $75 to $125, depending on how much is needed and local prices. 3 "}, {"url": "http://www.whatprice.co.uk/cost/concrete-foundations.html", "passage_text": "Costs of Concrete Foundations. A-On small projects such as single or extensions houses it is just not worth the bother of site mixing concrete. Ready mixed, delivered to the site, will cost more but will save you both time and back ache. How much of a problem would you expect this to be and what should I be paying for 60 square metres of slab foundations and drains? A-For a 60m2 of concrete slab foundations sized-house you should expect to pay £5,000 to £6,000 for the foundations and slab and about £3,500 for the drains in normal ground conditions."}, {"url": "http://www.buildingsheriff.com/extensions/extension-foundations.html", "passage_text": "If at all possible, the builder will prefer to use a mini digger. Although more expensive, the speed of the dig can give everyone a lift. On our current extension, the groundwork company, dug all the trenches for a 60m extension, filled them with concrete and cleared the spoil in 2 days! This is all based on the assumption that access for machinery is possible. "}, {"url": "http://www.costowl.com/home-improvement/foundations-framing-install-cost.html", "passage_text": "1 An average cost for a cubic yard of concrete is $75 to $125, depending on how much is needed and local prices. 2  Labor costs to pour and form concrete run somewhere around $3.50 to $7.00 per square foot. 3  One homeowner paid $11,000 for a crawl space for a 1,500 square foot home. 1 Concrete is typically measured by cubic yards (3’x3’x3’). 2  An average cost for a cubic yard of concrete is $75 to $125, depending on how much is needed and local prices. 3"}, {"url": "http://community.screwfix.com/threads/laying-foundations-for-an-extension-cost.130223/", "passage_text": "wb1627 New Member. Down south I've recently dug my own foundations for a 4m x 4m extension. Hire of digger, removal of soil (3 times what you dig out in volume!!), concrete readymix and oversite including DPM, insulation etc cost me approximately £1500. I had to dig down and have 1m footings 600mm wide."}, {"url": "http://www.squirrelconstruction.co.uk/house_extension_cost.php", "passage_text": "A short lesson about foundations. Strip foundation is the most common type of foundation used to build a new building or house extensions, because they offer good strength for their cost. In order to lay down strip foundations you need to excavate a trench at a minimum depth of 1.0m and have solid undisturbed ground. If it deviates from this, then this is considered as additional unforeseen costs which could not be priced up at the start of the project. This is a typical example of why you need a contingency amount of 10-15% set aside for such scenarios."}, {"url": "http://www.squirrelconstruction.co.uk/house_extension_cost.php", "passage_text": "If you have drains where you want your extension building then these need to be bridged. If you have a manhole cover where your extension is being built then these needs to be moved. Cost of this varies and again depending on whether or not it needs to be bridged or moved taking into account of access for digger. If it deviates from this, then this is considered as additional unforeseen costs which could not be priced up at the start of the project. This is a typical example of why you need a contingency amount of 10-15% set aside for such scenarios."}, {"url": "http://www.whatprice.co.uk/cost/concrete-foundations.html", "passage_text": "Q-What is the difference in costs between strip foundations with a concrete slab and concrete filled trenches and a slab for a house size 170 square metres? A-The concrete slab applies to both methods of construction and should cost about £3,500. How much of a problem would you expect this to be and what should I be paying for 60 square metres of slab foundations and drains? A-For a 60m2 of concrete slab foundations sized-house you should expect to pay £5,000 to £6,000 for the foundations and slab and about £3,500 for the drains in normal ground conditions."}]