[{"url": "https://answers.yahoo.com/question/index?qid=20061210205404AAtlnzu", "passage_text": "Report Abuse. There are so many effects of the Renaissance Period that it is hard to know where to start. We have a much greater appreciation for art of all kinds thanks to the wonderful artists of that period. If you take DaVinci as your starting point, he influenced things from art to science, from alchemy to flight"}, {"url": "http://www.answers.com/Q/What_are_the_effects_of_the_Renaissance", "passage_text": "The Harlem Renaissance had many lasting effects-- such as creating a pathway for the Civil Rights Movement some 20 years later and inspiring artists to create jazz, authors an … d poets and playwrights to create pieces of literary work that are now considered classics in literature, etc. The effects of Renaissance can be that the printing press had changed the society because more people became literate. Art had changed the society because art was used f … or architecture. The rediscovery of classical learning was also an effect. Many writers had changed they way people think."}, {"url": "https://en.wikipedia.org/wiki/Harlem_Renaissance", "passage_text": "The Harlem Renaissance was a movement that spanned the 1920s. The Harlem Renaissance was the name given to the cultural, social, and artistic explosion that took place in Harlem, New York. During the time, it was known as the  New Negro Movement , named after the 1925 anthology by Alain Locke. Though it was centered in the Harlem neighborhood of the borough of Manhattan in New York City, in addition, many francophone black writers from African and Caribbean colonies who lived in Paris were also influenced by the Harlem Renaissance."}, {"url": "http://www.pbs.org/wnet/jimcrow/stories_events_harlem.html", "passage_text": "The Harlem Renaissance was the name given to the cultural, social, and artistic explosion that took place in Harlem between the end of World War I and the middle of the 1930s. During this period Harlem was a cultural center, drawing black writers, artists, musicians, photographers, poets, and scholars. "}, {"url": "http://www.answers.com/Q/What_are_the_effects_of_the_Harlem_Renaissance", "passage_text": "The Harlem Renaissance had many lasting effects-- such as creating a pathway for the Civil Rights Movement some 20 years later and inspiring artists to create jazz, authors and poets and playwrights to create pieces of literary work that are now considered classics in literature, etc. It rejected Europeans and  white Americans and instead celebrated black dignity and  creativity. It had a profound effect around the U.S.    The epicenter of the Harlem Renaissance was the West Harlem  neighborhood in New York City (Upper Manhattan).Stupid."}, {"url": "http://ifitaintgotthatswing.weebly.com/short-term-effects.html", "passage_text": "In The Beginning. Although not numerious, the main short term effects of the Harlem Renaissance were: * the spread of jazz: For a few decades, jazz and swing were the most popular American music genres. Later on, rock 'n roll would rise and replace jazz as America's favorite music. Jazz still enjoys success in certain places, however."}, {"url": "http://www.enotes.com/homework-help/what-were-effects-harlem-renaissance-424620", "passage_text": "(Answer #1). One effect of the Harlem Renaissance was to help illuminate the discourse concerning race and ethnicity in America. With about a half a century having passed since the end of the Civil War, there was a great deal of challenge in articulating conditions of racial identity in America. The pride in being African and examining what it meant to be African is one of the lasting effects of the Harlem Renaissance. The African-American was shown to be someone who lived on and at the hyphen of American consciousness."}]