[{"url": "http://www.payscale.com/research/US/Job=Massage_Therapist/Hourly_Rate", "passage_text": "A Massage Therapist earns an average wage of $19.88 per hour. Most people move on to other jobs if they have more than 20 years' experience in this career. Cons: If I don't get enough sessions in a month I may not be able to pay my bills. People may not realize there is even a massage therapist working at that location since there is only a sign for the chiropractor on the side of the building and the door."}, {"url": "http://money.usnews.com/careers/best-jobs/massage-therapist/salary", "passage_text": "But the average worker in this profession makes a low annual salary compared with other occupations on our list of Best Health Care Jobs. Massage therapists, who earned an average salary of $40,400 in 2013, have comparable pay to clinical laboratory technicians ($40,240). However, registered nurses ($68,910) and physical therapists ($82,180) made more"}, {"url": "http://www.massagetherapists.org/salary/", "passage_text": "1 Skilled, experienced massage therapists with thriving practices can make a massage therapist salary of over $60,000. 2  According to recent salary statistics, top-tier massage therapists reported making an average salary of $69,000 per year. 3  The median annual massage therapist salary is typically around $34,000 per year. $24,130. See massage therapist salary figures for all states…. Massage Therapist Salary by City. Here are the highest-paying major US cities for massage therapist salary, showing average massage therapist salary, minimal salary, average hourly wage and minimal hourly wage."}, {"url": "http://www.indeed.com/salary/massage-therapist.html", "passage_text": "Average massage therapist salaries for job postings nationwide are 61% lower than average salaries for all job postings nationwide. "}, {"url": "http://www1.salary.com/Massage-Therapist-salary.html", "passage_text": "For example the median expected annual pay for a typical Massage Therapist in the United States is $47,729 so 50% of the people who perform the job of Massage Therapist in the United States are expected to make less than $47,729. Source: HR Reported data as of October 2015. Median $47,729. Our team of Certified Compensation Professionals has analyzed survey data collected from thousands of HR departments at companies of all sizes and industries to present this range of annual salaries for people with the job title Massage Therapist in the United States."}, {"url": "http://www.indeed.com/salary/Massage-Therapy.html", "passage_text": "Average Massage Therapy salaries for job postings nationwide are 63% lower than average salaries for all job postings nationwide. "}, {"url": "http://money.usnews.com/careers/best-jobs/massage-therapist/salary", "passage_text": "Salary Outlook. The BLS reports the median annual wage for massage therapists was $35,920 in 2013. The best-paid 10 percent in the profession made more than $71,020, while the bottom 10 percent made less than $18,280. Massage therapists, who earned an average salary of $40,400 in 2013, have comparable pay to clinical laboratory technicians ($40,240)."}, {"url": "http://www.massagetherapists.org/salary/", "passage_text": "1 According to recent salary statistics, top-tier massage therapists reported making an average salary of $69,000 per year. 2  The median annual massage therapist salary is typically around $34,000 per year. 3  Specialty hospitals typically pay the highest massage therapist salaries. $24,130. See massage therapist salary figures for all states…. Massage Therapist Salary by City. Here are the highest-paying major US cities for massage therapist salary, showing average massage therapist salary, minimal salary, average hourly wage and minimal hourly wage."}, {"url": "http://money.usnews.com/careers/best-jobs/massage-therapist/salary", "passage_text": "Read more on salaries and benefits here. The BLS reports the median annual wage for massage therapists was $35,920 in 2013. The best-paid 10 percent in the profession made more than $71,020, while the bottom 10 percent made less than $18,280. Massage therapists, who earned an average salary of $40,400 in 2013, have comparable pay to clinical laboratory technicians ($40,240)."}, {"url": "http://www.massagetherapists.org/salary/", "passage_text": "1 The median annual massage therapist salary is typically around $34,000 per year. 2  Specialty hospitals typically pay the highest massage therapist salaries. 3  Massage therapists in these hospitals make an average of $55,020 per year. $24,130. See massage therapist salary figures for all states…. Massage Therapist Salary by City. Here are the highest-paying major US cities for massage therapist salary, showing average massage therapist salary, minimal salary, average hourly wage and minimal hourly wage."}]