[{"url": "http://www.homewyse.com/services/cost_to_polish_concrete.html", "passage_text": "Get an INSTANT estimate of the cost to Polish Concrete! Our free calculator uses recent, trusted data to estimate costs for your Concrete Polishing project. For a basic 250 square feet project in zip code 47474, the benchmark cost to Polish Concrete ranges between $4.40 - $5.25 per square foot* . To estimate costs for your project: 1"}, {"url": "http://www.everything-about-concrete.com/polished-concrete-cost.html", "passage_text": "Other things like decorative scoring and staining will also increase the cost of concrete. polishing. Basic cost for a polished concrete floor up to a 800 grit: $3.00 per square foot. Cost for polished concrete floors requiring decorative scoring and/or staining: Up to $8.00 per square foot. For large commercial floors, may include staining and decorative scoring: From $3.00 - $7.00 per square foot. For polishing residential concrete floors: Cost $5.00 - $12.00 per square foot."}, {"url": "http://www.glossyfloors.com/cost-of-polished-concrete-per-square-foot/", "passage_text": "If you wanted an 800 grit polish, which is still very reflective, there aren’t as many steps, so the price is decreased. Polished concrete, in general, can range anywhere from $2.00 per square foot to $7.00 per square foot. Glossy Floors, before giving an estimate, takes the time to examine the floor very carefully. "}, {"url": "http://www.concretenetwork.com/concrete/interiorfloors/cost.html", "passage_text": "Video on the cost of concrete floors. Depending on the level of complexity, concrete floors can cost as little as $2 to $6 a square foot or be as expensive as $15 to $30 a square foot. As the chart below shows, the average per-square-foot costs of basic stained or polished concrete floors are competitive with what you would expect to pay to install linoleum, vinyl flooring, ceramic tile and high-quality carpeting."}, {"url": "http://www.networx.com/article/concrete-floor-stain-costs", "passage_text": "Costs. A professional concrete contractor will typically charge $2-$4 per square foot for a simple stain application, including the sealer. A stain application with patterning and sawed lines will typically cost between $4 and $10 per square foot. "}, {"url": "http://www.amcrete.net/products.html", "passage_text": "Concrete is sold by the yard and can vary in Price from $80-$200 per cubic yard, which will yield approximately 80 square feet at 4 inches thick. Price will vary based on the amount of site prep, surface prep, rebar, forming, and type of finish applied to the concrete's surface. Starting costs for stamped concrete overlays are usually in the $5 range but have been known to climb to the $15-$20 per square foot cost in the casinos of Las Vegas and high end homes. These systems will run about $7-$10 on average."}, {"url": "http://www.concretenetwork.com/concrete/interiorfloors/cost.html", "passage_text": "1 Extensive surface preparation, such as grinding, crack repair, and spall repair, can add as much as $2 per square foot to the overall cost of the floor. 2  If a full resurfacing is needed, expect to tack on another $2 to $3 per square foot (for a $4 to $5 per square foot increase). As the chart below shows, the average per-square-foot costs of basic stained or polished concrete floors are competitive with what you would expect to pay to install linoleum, vinyl flooring, ceramic tile and high-quality carpeting."}, {"url": "http://www.houzz.com/ideabooks/7977902/list/5-Benefits-to-Concrete-Floors-for-Everyday-Living/", "passage_text": "Economical. The cost of concrete floors is very low, about $2 to $6 per square foot to polish a plain gray slab, giving it a lustrous sheen. The concrete's tonal differences, subtle cracks and aggregates take on a stonelike, natural feel."}, {"url": "http://www.harmonconcrete.com/concrete/much-polished-concrete-per-square-foot/", "passage_text": "Polished concrete, in general, can range anywhere from $3.00 per square foot to $12.00 per square foot. Harmon Concrete can look at a floor and have a general pricing idea with a few minutes, but it takes a thorough examination of the floor to correctly determine price. "}]