[{"url": "http://www.ourbabynamer.com/meaning-of-Sylvia.html", "passage_text": "Sylvia is generally used as a girl's name. It consists of 6 letters and 3 syllables and is pronounced Syl-vi-a. In the U.S. in 2014, it ranked 493 in baby name popularity for girls with 630 occurrences. Less than 5 boys were given the name. View the Sylvia Name Popularity Page to see how the popularity trend for Sylvia has changed since 1880, or to compare the popularity of Sylvia to other names. Sylvia is a variant spelling of Silvia. Sylvia falls into the tree name category. "}, {"url": "http://www.babynamewizard.com/baby-name/girl/silvia", "passage_text": "Origin of the name Silvia: Feminine form of Silvius (of the woods), a name derived from the Latin silva (wood). The name is borne in Roman mythology by Rhea Silvia, a vestal virgin who broke her vows and became mother of Romulus and Remus. From A World of Baby Names by Teresa Norman."}, {"url": "http://www.thinkbabynames.com/meaning/0/Sylvia", "passage_text": "Sylvia /syl-via/ [3 sylls.] as a girls' name is pronounced SIL-vee-ah. It is of Latin origin, and the meaning of Sylvia is woods, forest . The Latin form Silvia was more popular for centuries until recently. Rhea Silvia was an ancient nature goddess, mother to the twin founders of Rome, Romulus and Remus. Affiliated girl name: Xylia. Sylvia ▼ has 7 more different forms via Silvia: Silvestra, Silvi, Silvija, Silvy, Silvya, Sirvana and Sirvanna. Sylvia is a very prominent first name for females (#120 out of 4276, Top 3%) and also a very prominent last name for all people (#5480 out of 150436, Top 4%). (2000 U.S. Census). Displayed below is the baby name popularity of Sylvia for girl"}, {"url": "http://www.sheknows.com/baby-names/name/sylvia", "passage_text": "The name Sylvia is a Latin baby name. In Latin the meaning of the name Sylvia is: From the forest. American Meaning: The name Sylvia is an American baby name. In American the meaning of the name Sylvia is: From the forest."}, {"url": "https://en.wikipedia.org/wiki/Silvia", "passage_text": "Silvia is an Italian female given name of Latin origin, with English-language cognate Sylvia. The name originates from the Latin word for forest Silva and its meaning is spirit of the wood. The mythological god of the forest was associated with the figure of Silvanus. In Roman mythology, Silvia is the goddess of the forest while Rea Silvia was the mother of Romulus and Remus."}, {"url": "http://www.babycenter.com/baby-names-sylvia-4278.htm", "passage_text": "Named our girl born in January 2015 Sylvia Lee.. Lee after her late grandmother. Love the name Sylvia and really can't believe it hasn't gained more popularity recently with the other older names coming back. Plus it means of the woods which holds a beautiful meaning. Everyone comments on how pretty her name is. I love because it is uncommon but recognizable."}, {"url": "http://www.ohbabynames.com/meaning/name/sylvia/729", "passage_text": "Sylvia is derived from an Old Roman family name Silvius from the early Latin “silva” meaning “wood, forest”. Three things make the female name Sylvia/Silvia notable. For one, Rhea Silvia was the mythical mother of the twins Romulus and Remus, legendary founders of Rome in the 8th century B.C. Literary Characters of the Baby Name Sylvia. Silvia (Two Gentlemen of Verona) Silvia is the spirited daughter of the Duke of Milan who is in love with Valentine, one of The Two Gentlemen of Verona, William Shakespeare’s early comedy of about 1590/91."}, {"url": "http://www.behindthename.com/name/silvia", "passage_text": "Meaning & History. Feminine form of SILVIUS. Rhea Silvia was the mother of Romulus and Remus, the founders of Rome. This was also the name of a 6th-century saint, the mother of the pope Gregory the Great. It has been a common name in Italy since the Middle Ages"}]