[{"url": "https://www.metlife.com/assets/cao/pr/SIFI_Designation-Customer_QA.pdf", "passage_text": "First, we do not believe we are a SIFI under the Dodd-Frank Act criteria and we are asking the court to review that decision. Second, singling out two large life insurance companies for SIFI designation will harm competition and lead to higher prices and less financial protection for consumers. "}, {"url": "https://en.wikipedia.org/wiki/Systemically_important_financial_institution", "passage_text": "Global Systemically Important Banks (G-SIBs) are determined based on four main criteria: (a) size, (b) cross-jurisdiction activity, (c) complexity, and (d) substitutability. The list of G-SIBs is published annually by the Financial Stability Board (FSB). However, the Basel Committee has identified factors for assessing whether a financial institution is systemically important: its size, its complexity, its interconnectedness, the lack of readily available substitutes for the financial infrastructure it provides, and its global (cross-jurisdictional) activity."}, {"url": "https://en.wikipedia.org/wiki/Systemically_important_financial_institution", "passage_text": "Overview [edit]. As the 2007-2012 global financial crisis has unfolded, the international community has moved to protect the global financial system through preventing the failure of SIFIs, or, if one does fail, limiting the adverse effects of its failure. However, the Basel Committee has identified factors for assessing whether a financial institution is systemically important: its size, its complexity, its interconnectedness, the lack of readily available substitutes for the financial infrastructure it provides, and its global (cross-jurisdictional) activity."}, {"url": "http://www.syfy.com/scifi", "passage_text": "Scifi.com. SCI FI Channel is now Syfy, but you can still get access to all your favorite SCI FI Channel content right here. Syfy features science fiction, drama, supernatural, fantasy, reality, paranormal, wrestling, and horror programming. Be sure to visit Syfy.com for the latest from the world of the imagination. "}, {"url": "http://www.investopedia.com/terms/s/systemically-important-financial-institution-sifi.asp", "passage_text": "Supervision and regulations of systemically important financial institutions is intended to prevent firms from becoming too big to fail and to prevent any assumptions that the government will provide financial support, in the event the firms do run into financial trouble. New regulations under the Dodd-Frank legislation, mandate that financial institutions that fit SIFI qualifications, will have to meet higher capital standards and develop contingency plans for potential future failures."}, {"url": "https://en.wikipedia.org/wiki/Systemically_important_financial_institution", "passage_text": "For a listing of the banks, see list of systemically important banks. A systemically important financial institution (SIFI) is a bank, insurance company, or other financial institution whose failure might trigger a financial crisis. However, the Basel Committee has identified factors for assessing whether a financial institution is systemically important: its size, its complexity, its interconnectedness, the lack of readily available substitutes for the financial infrastructure it provides, and its global (cross-jurisdictional) activity."}, {"url": "http://sifinetworks.com/what-is-fibercity/", "passage_text": "A SiFi Networks’ FiberCity™ is created once a fiber optic network has been designed, built and funded with service providers delivering gigabit internet connectivity throughout the community. "}, {"url": "http://lexicon.ft.com/Term?term=sifis", "passage_text": "Definition of sifis. Sifis is short for systemically important financial institutions. These are global financial services firms-almost exclusively banks-so big that governments believe they will be forced to rescue these institutions rather than risk lasting damage to the world financial system from a collapse."}, {"url": "http://www.investopedia.com/terms/s/systemically-important-financial-institution-sifi.asp", "passage_text": "Systematically important financial institutions became the target of legislation and regulatory reform by the Obama Administration, due to issues concerning their consolidated supervision and regulation, following the financial crisis of 2008. New regulations under the Dodd-Frank legislation, mandate that financial institutions that fit SIFI qualifications, will have to meet higher capital standards and develop contingency plans for potential future failures."}]