[{"url": "http://www.housepaintingguide.org/why-paint-blisters-and-what-to-do-about-it/", "passage_text": "If a wall is unclean, do not prime or paint it. If a surface is covered in oil-based paint, it’s best to use oil, not latex, when repainting it. Mixing types of primer and paint on the same wall can lead to problems, especially on exteriors. The blisters can be caused by heat, moisture, incompatibility and more. Here are ways you can avoid paint blisters.Clean it Up. Though many do not realize it, dust and grime attaches even to the flat of a wall surface. Of course, you need to check for spider webs in corners, but it is also important to clean the entire surface you plan to paint. Dirt, stains and grime keep the paint from clinging properly to the wall"}, {"url": "http://www.benjaminmoore.com/en-us/for-your-home/blistering-interior-paint-problem", "passage_text": "Paint bubbles can form long after the paint has dried. Take steps to avoid this problem before it occurs. Paint blisters or bubbles occur when there is loss of adhesion between the paint film and underlying surface. It can be corrected, but the cause of the problem must be addressed or it will recur. How to Fix Paint Bubbles. 1  If the blisters do not go all the way down to the substrate, remove them by scraping and sanding. 2  Once the problem area has a smooth finish, coat it with primer before applying a quality acrylic latex interior paint."}, {"url": "http://www.renovateforum.com/f207/air-bubbles-semi-gloss-paint-99030/", "passage_text": "Posts. 4,446. For any enamel paint I use a foam roller. I also add penetrol to the paint. But the best tip I got from a pro was to use the foam roller, coat the surface (say a door) then go over it again fast, which is meant to heat the paint up a bit, then tip it off with a good quality 75 mm brush. No bubbles. "}, {"url": "http://www.krylon.com/how-to/faqs/preparation/how-do-i-prevent-spray-paint-air-bubbles.jsp", "passage_text": "Applying Krylon® spray paint in ideal weather conditions can help prevent air bubbles from forming on the surface of your project. We suggest applying Krylon spray paint when the temperature is between 50 and 90 degrees Fahrenheit and the relative humidity is below 85%. "}, {"url": "http://www.housepaintingguide.org/why-paint-blisters-and-what-to-do-about-it/", "passage_text": "Preparation might be the most important part of exterior painting. A surface that’s experiencing blistering or bubbling is certainly not beyond repair; scraping it and applying a new coat of paint should do the trick. That said, do not take a Band-Aid approach to persistent problems. The blisters can be caused by heat, moisture, incompatibility and more. Here are ways you can avoid paint blisters.Clean it Up. Though many do not realize it, dust and grime attaches even to the flat of a wall surface. Of course, you need to check for spider webs in corners, but it is also important to clean the entire surface you plan to paint. Dirt, stains and grime keep the paint from clinging properly to the wall"}, {"url": "http://www.sherwin-williams.com/homeowners/ask-sherwin-williams/problem-solver/peeling-cracking/blistering/", "passage_text": "1 If blisters go down to the substrate (e.g. the surface that is painted), the cause is likely to be moisture escaping from the surface. 2  Remove all loose paint (by scraping or other method) and sand the surface to smooth out any rough edges. 3  Determine and repair any cause of excess moisture before repainting. "}, {"url": "http://www.diychatroom.com/f4/tiny-bubbles-high-gloss-enamel-finish-72618/", "passage_text": "Tiny Bubbles in High-gloss Enamel Finish. After you roll out your door. Take a brush and brush it all out. Your roller is more to get the paint on the door. The brush is what is used to detail out your material. If you have thinned your material right no streaks or ropes, sags will appear. Tiny Bubbles in High-gloss Enamel Finish. Greetings all from Downunder Land, hope you are enjoying your start to summer, I have spent a couple of days meticulously preparing a hardwood framed front entry area, new door and side glass louvre panels to be installed."}, {"url": "http://www.benjaminmoore.com/en-us/for-your-home/blistering-interior-paint-problem", "passage_text": "How to Prevent Paint from Bubbling. 1  Make sure the surface is clean and dry. 2  Apply primer-sealer over any stains and let it dry completely. 3  Prime new joint compound with flat latex paint or latex primer. 4  Avoid painting in hot or humid conditions. 5  Let paint dry completely before exposing the surface to moisture. How to Fix Paint Bubbles. 1  If the blisters do not go all the way down to the substrate, remove them by scraping and sanding. 2  Once the problem area has a smooth finish, coat it with primer before applying a quality acrylic latex interior paint."}, {"url": "http://www.house-painting-info.com/articles/blistering/", "passage_text": "This type of problem can occur in any type of paint, but latex and acrylic formulas are more susceptible. Bubbling and blistering occur indoors and out, often with no apparent cause. Proper preparation is the single most important thing you can do to avoid bubbles. In other cases, blistering is caused by applying paint to a dirty or incompatibly finished surface. As the paint dries, it shrinks slightly, pulling up poorly adhered sections of old paint. It’s important to thoroughly clean walls (both interior and exterior) before painting."}]