[{"url": "http://www.brusselslife.be/en/article/the-legends-of-the-peeing-kid", "passage_text": "Even if Manneken-pis is an original, he has some 'brothers', in Grammont, in Kobe, in Spain, in Osaka, in Colmar, and he also has a sister: Jeanneke-Pis, located in Brussels, in the impasse de la Fidelite. fidélité Moreover, the oak tree was uprooted and replanted at the Rue du Chene (chêne meaning oak In). French even If-manneken pis is an, original he has 'some', brothers In, grammont In, kobe In, spain In, osaka In, colmar and he also has a: Sister-Jeanneke, pis located In, brussels in the impasse de La. fidelite fidélité"}, {"url": "https://en.wikipedia.org/wiki/Jeanneke_Pis", "passage_text": "Jeanneke Pis is a modern fountain and statue in Brussels, which was intended to form a counterpoint to the city's Manneken Pis, south of the Grand Place. It was commissioned by Denis-Adrien Debouvrie in 1985 and erected in 1987. It is located on the east side of the Impasse de la Fidelite / Fidélité (Getrouwheidsgang Fidelity), alley a narrow-cul-de sac some 30 metres long leading northwards off the-restaurant Packed rue Des / Bouchers. beenhouwersstraat"}, {"url": "https://en.wikipedia.org/wiki/Manneken_Pis", "passage_text": "The famous statue is located at the junction of Rue de l'Étuve/étuve stoofstraat And rue Du/Chene. Chêne eikstraat to, find it one takes the left lane next To The Brussels town hall from The Famous grand place and walks a few hundred metres Southwest Via Rue/Charles Buls. karel bulsstraat Manneken Pis is also the name of a book by Vladimir Radunsky. The Party (film) starring Peter Sellers, includes a reproduction of the statue in the house's extended water feature."}, {"url": "http://www.brusselslife.be/en/article/the-legends-of-the-peeing-kid", "passage_text": "Even if Manneken-pis is an original, he has some 'brothers', in Grammont, in Kobe, in Spain, in Osaka, in Colmar, and he also has a sister: Jeanneke-Pis, located in Brussels, in the impasse de la Fidelite. Fidélité, Yep brussels has a lot of peeing ... statues Moreover, the oak tree was uprooted and replanted at the Rue du Chene (chêne meaning oak In). French even If-manneken pis is an, original he has 'some', brothers In, grammont In, kobe In, spain In, osaka In, colmar and he also has a: Sister-Jeanneke, pis located In, brussels in the impasse de La. fidelite fidélité"}, {"url": "http://mannekenfrites.com/location/", "passage_text": "Location. We are located in Olde Town Arvada, 15 minutes from downtown Denver, near the corner of Olde Wadsworth Blvd and Grandview Avenue in the 95 year old A.L. Davis building. There is plenty of free parking on all streets along with a free parking lot 2 blocks to the NE of Manneken Frites. "}, {"url": "http://www.parkinn.com/hotel-brussels/location/manneken-pis", "passage_text": "As a result, the original statuette is now found at Maison du Roi, the Museum of the City, located on Grand Place. Manneken Pis and the Museum of the City. The residents of Brussels have a fondness for this world renowned little boy. The city also has a rather humorous outlook with regards to Manneken Pis. Manneken Pis is a bronze statuette of a little boy urinating into the fountain basin, which reaches just 61cm tall. In the fifteenth century, the statue played an important role as the first drinking fountain in Brussels."}, {"url": "https://en.wikipedia.org/wiki/Manneken_Pis", "passage_text": "Manneken Pis ([ˌmɑnəkə(m) ˈpɪs] (help·info) ; Little man Pee in Dutch; French: le Petit Julien) is a landmark small bronze sculpture (61 cm) in Brussels, depicting a naked little boy urinating into a fountain's basin. It was designed by Hieronymus Hiëronymus duquesnoy The elder and put in place in 1618 or. 1619 Manneken Pis is also the name of a book by Vladimir Radunsky. The Party (film) starring Peter Sellers, includes a reproduction of the statue in the house's extended water feature."}, {"url": "http://www.brussels.info/peeing-boy/", "passage_text": "Upon arrival in Brussels the first attraction you are shown is definitely the Manneken Pis (little pee man in Flemish). Located close to the Grand Place on rue de l’Etuve 31 (Lievevrouwbroersstraat 31, 1000 Brussels, Belgium) he stands at just 61cm (24 inches). The peeing boy is a tiny bronze fountain statue. In the 80s another statue was built called Jeanneke Pis to give Manneken Pis a playmate. This other statue is a little girl fountain, but she is lesser known and hides in an alleyway a short distance away from Mannekin Pis."}, {"url": "http://www.brussels.info/peeing-boy/", "passage_text": "Location in Brussels The Mannekin Pis is located southwest of the Town Hall. If you are at the Grand Place facing the Town Hall take the exit on the left, the Mannekin Pis is two blocks behind the Town Hall. Alternatively, you can walk from one of the metro stations below. In the 80s another statue was built called Jeanneke Pis to give Manneken Pis a playmate. This other statue is a little girl fountain, but she is lesser known and hides in an alleyway a short distance away from Mannekin Pis."}, {"url": "http://www.parkinn.com/hotel-brussels/location/manneken-pis", "passage_text": "In addition to dressing Manneken Pis, it has been known on occasion for the fountain to be hooked up to a beer keg and beer has been handed out to passers-by. Both Manneken Pis and the Museum of the city are within easy walking distance from the Park Inn by Radisson Brussels Midi Hotel. After a busy day of sightseeing, guests can return to contemporary accommodation in Brussels city centre and take full advantage of the premier facilities on offer. Manneken Pis is a bronze statuette of a little boy urinating into the fountain basin, which reaches just 61cm tall. In the fifteenth century, the statue played an important role as the first drinking fountain in Brussels."}]