[{"url": "https://en.wikibooks.org/wiki/Introduction_to_Sociology/Organizations", "passage_text": "Organizations [edit]. In sociology organization (or organisation) is understood as planned, coordinated and purposeful action of human beings to construct or compile a common tangible or intangible product. This action is usually framed by formal membership and form (institutional rules). Sociology distinguishes the term organization into planned formal and unplanned informal (i.e. spontaneously formed) organizations. Sociology analyzes organizations in the first line from an institutional perspective."}, {"url": "https://en.wikibooks.org/wiki/Introduction_to_Sociology/Organizations", "passage_text": "Leadership in formal organizations [edit]. An organization that is established as an instrument or means for achieving defined objectives has been referred to as a formal organization. Its design specifies how goals are subdivided and reflected in subdivisions of the organization. Sociology distinguishes the term organization into planned formal and unplanned informal (i.e. spontaneously formed) organizations. Sociology analyzes organizations in the first line from an institutional perspective."}, {"url": "http://www.sociologyguide.com/organization-and-individual/formal-organizations.php", "passage_text": "Formal Organizations. Formal organization has its own specific function or functions. A university for example has the main function of promoting education. But it also promotes artistic, literary, athletic and other interests of the members. The rationality of formal organizations has two sources-the predominance of rules that have been devised to help achieve definite results and the systematic reliance on knowledge in the operation of the organization."}, {"url": "http://www.sociologyguide.com/organization-and-individual/informal-organizations.php", "passage_text": "Informal Organization. Informal organization refers to a small group the members of which are tied to one another as persons. The group is characterized by informal and face to face relations, mutual aid, cooperation and companionship. "}, {"url": "http://www.sociologyguide.com/organization-and-individual/formal-organizations.php", "passage_text": "Bureaucracy refers to the administrative aspect of the formal organization. It refers to the arrangement of the organization designed to carry out its day to day business. It is represented by a hierarchy of officials who are assigned different responsibilities and provided with different statuses and roles. The rationality of formal organizations has two sources-the predominance of rules that have been devised to help achieve definite results and the systematic reliance on knowledge in the operation of the"}, {"url": "http://sociology.about.com/od/F_Index/g/Formal-Organization.htm", "passage_text": "Definition: A formal organization is a social system organized around specific goals and usually consisting of several interrelated groups or subsystems. Formal organizations are governed by clearly stated and enforced norms. "}, {"url": "http://study.com/academy/lesson/formal-organization-structure-utilitarian-normative-coercive.html", "passage_text": "In addition to a plethora of social groups, our modern society is filled with formal organizations. A formal organization is a type of group that is deliberately constructed and whose members are organized to achieve a specific goal. Churches, schools, hospitals, and companies are just a few examples. Modern formal organizations allow us to accomplish tasks in the most efficient way possible."}, {"url": "https://en.wikipedia.org/wiki/Formal_organization", "passage_text": "Formal organization is a fixed set of rules of intra-organization procedures and structures. As such, it is usually set out in writing, with a language of rules that ostensibly leave little discretion for interpretation. Formal organizations are typically understood to be systems of coordinated and controlled activities that arise when work is embedded in complex networks of technical relations and boundary-spanning exchanges."}, {"url": "https://en.wikipedia.org/wiki/Formal_organization", "passage_text": "1 To facilitate the accomplishment of the goals of the organization: In a formal organization, the work is delegated to each individual of the organization. 2  He/She works towards the attainment of definite goals, which are in compliance with the goals of the organization. Formal organizations are typically understood to be systems of coordinated and controlled activities that arise when work is embedded in complex networks of technical relations and boundary-spanning exchanges."}]