[{"url": "http://project.wdl.org/standards/metadata.html", "passage_text": "WDL Descriptive Metadata Element Set. A standard set of metadata elements must be used to describe all WDL digital objects. “Digital object” refers to any primary source or other item selected for inclusion as an artifact on the WDL. "}, {"url": "http://www.library.illinois.edu/dcc/bestpractices/chapter_08_descriptive_metadata.html", "passage_text": "8.1 How to Select the Best Metadata Standard. Descriptive metadata is a resource for discovery and identification, used for the indexing, discovery, and identification of the digital resources, e.g., title, author, and keyword. 8.4.1 EAD. _________________________________________________________________________________________________"}, {"url": "https://en.wikipedia.org/wiki/Metadata", "passage_text": "This standard refers to metadata as information objects about data, or data about data. In ISO/IEC 11179 Part-3, the information objects are data about Data Elements, Value Domains, and other reusable semantic and representational information objects that describe the meaning and technical details of a data item. While the metadata application is manyfold covering a large variety of fields, there are specialised and well-accepted models to specify types of metadata. Bretheron & Singley (1994) distinguish between two distinct classes: structural/control metadata and guide metadata."}, {"url": "http://www.loc.gov/standards/mets/METSOverview.v2.html", "passage_text": "Descriptive Metadata-The descriptive metadata section may point to descriptive metadata external to the METS document (e.g., a MARC record in an OPAC or an EAD finding aid maintained on a WWW server), or contain internally embedded descriptive metadata, or both. Without structural metadata, the page image or text files comprising the digital work are of little use, and without technical metadata regarding the digitization process, scholars may be unsure of how accurate a reflection of the original the digital version provides."}, {"url": "https://en.wikipedia.org/wiki/Metadata", "passage_text": "The main purpose of metadata is to facilitate in the discovery of relevant information, more often classified as resource discovery. Metadata also helps organize electronic resources, provide digital identification, and helps support archiving and preservation of the resource. While the metadata application is manyfold covering a large variety of fields, there are specialised and well-accepted models to specify types of metadata. Bretheron & Singley (1994) distinguish between two distinct classes: structural/control metadata and guide metadata."}, {"url": "http://marciazeng.slis.kent.edu/metadatabasics/types.htm", "passage_text": "3.1 NISO's definitions. There are three main types of metadata: • Descriptive metadata describes a resource for purposes such as discovery and identification. It can include elements such as title, abstract, author, and keywords. • Structural metadata indicates how compound objects are put together, for example, how pages are ordered to form chapters. • Administrative metadata provides information to help manage a resource, such as when and how it was created, file type and other technical information, and who can access it."}, {"url": "http://www.library.illinois.edu/dcc/bestpractices/chapter_08_descriptive_metadata.html", "passage_text": "8.4.2 VRA. _________________________________________________________________________________________________. Descriptive metadata is a resource for discovery and identification, used for the indexing, discovery, and identification of the digital resources, e.g., title, author, and keyword. 8.4.1 EAD"}, {"url": "https://en.wikipedia.org/wiki/Metadata", "passage_text": "Metadata is  data about data. Two types of metadata exist: structural metadata and descriptive metadata. Structural metadata is data about the containers of data. Descriptive metadata uses individual instances of application data or the data content. While the metadata application is manyfold covering a large variety of fields, there are specialised and well-accepted models to specify types of metadata. Bretheron & Singley (1994) distinguish between two distinct classes: structural/control metadata and guid"}, {"url": "http://www.library.illinois.edu/dcc/bestpractices/chapter_08_descriptive_metadata.html", "passage_text": "Introduction: A wide variety of descriptive metadata schemas currently exist, but as of yet no single metadata schema has accepted as the 'best metadata standard' for every project. In any case, deciding which metadata schema to use should be determined before materials are digitized. 8.4.1 EAD. _________________________________________________________________________________________________. Descriptive metadata is a resource for discovery and identification, used for the indexing, discovery, and identification of the digital resources, e.g., title, author, and keyword."}]