[{"url": "http://www.minerals.net/mineral/diamond.aspx", "passage_text": "It is scientifically a different mineral than Diamond, and believed to have formed when meteoric Graphite fell to earth. When this happened, great heat and stress transformed the Graphite into Diamond, but it retained Graphite's hexagonal crystal lattice. DISTINGUISHING SIMILAR MINERALS. The only mineral that can possibly be be confused with Diamond is waterworn Quartz pebbles which may resemble waterworn Diamonds, but the hardness and luster of Diamond will easily differentiate the two."}, {"url": "http://www.galleries.com/Diamond", "passage_text": "Diamond is the ultimate gemstone, having few weaknesses and many strengths. It is well known that Diamond is the hardest substance found in nature, but few people realize that Diamond is four times harder than the next hardest natural mineral, corundum (sapphire and ruby). But even as hard as it is, it is not impervious. 1 Diamond is transparent, Graphite is opaque. 2  Diamond crystallizes in the Isometric system and graphite crystallizes in the hexagonal system. 3  Somewhat of a surprise is that at surface temperatures and pressures, Graphite is the stable form of carbon."}, {"url": "http://geology.com/diamond/", "passage_text": "Diamond Producers Diamond Production leaders include: Botswana, Russia, Angola and Canada. Diamond: The Mineral Diamond is a gem with unique properties and hundreds of industrial uses! Facts About Diamonds Interesting Facts About Diamonds You are a diamond expert if you know all of these! USA Diamond Mine You Can Be A Diamond Miner!"}, {"url": "http://flexiblelearning.auckland.ac.nz/rocks_minerals/minerals/diamond.html", "passage_text": "Diamond is the hardest naturally occurring mineral, topping Mohs' Scale of Hardness with a relative hardness value of 10. Diamond is a polymorph of the element carbon, and graphite is another. While the two share the same chemistry, C (elemental carbon), they have very different structures and properties. "}, {"url": "http://www.mindat.org/min-1282.html", "passage_text": "Polymorph of: Chaoite, Graphite, Lonsdaleite. Diamond is the hardest natural substance known. It is formed deep in the mantle, and is only brought to the surface via kimberlite pipes, lamprophyres, eclogites and other rocks that originate deep within the mantle. It is also found in alluvial deposits, along with quartz, corundum, zircon and other minerals, derived from such rocks, and in certain meteorites."}, {"url": "http://www.sciencekids.co.nz/sciencefacts/chemistry/diamond.html", "passage_text": "The carbon atoms in diamonds are arranged in a strong, tetrahedral structure. Diamond is the hardest natural material known and is often used for industrial cutting and polishing tools. Diamond has a hardness of 10 on Mohs scale of mineral hardness, with 1 being the softest (talc) and 10 being the hardest."}, {"url": "http://geology.com/minerals/diamond.shtml", "passage_text": "Diamond is a rare, naturally-occurring mineral composed of carbon. Each carbon atom in a diamond is surrounded by four other carbon atoms and connected to them by strong covalent bonds. This simple, uniform, tightly-bonded arrangement yields one of the most durable substances known. Gem diamonds are stones with color and clarity that make them suitable for jewelry or investment use. These stones are especially rare and make up a minor portion of worldwide diamond production. Gemstone diamonds are sold for their beauty and quality."}, {"url": "http://www.minerals.net/mineral/diamond.aspx", "passage_text": "Diamond has many unequaled qualities and is very unique among minerals. It is the hardest known substance, it is the greatest conductor of heat, it has the highest melting point of any substance (7362° F or 4090° C), and it has the highest refractive index of any natural mineral. DISTINGUISHING SIMILAR MINERALS. The only mineral that can possibly be be confused with Diamond is waterworn Quartz pebbles which may resemble waterworn Diamonds, but the hardness and luster of Diamond will easily differentiate the two."}, {"url": "http://www.minerals.net/mineral/diamond.aspx", "passage_text": "Diamond is number 10 on the Mohs scale, and is 40 times harder than Corundum, which is number 9 on the Moh's scale. It also has the most dense atom ical configuration of any mineral, and is transparent over the greatest number of wavelengths. DISTINGUISHING SIMILAR MINERALS. The only mineral that can possibly be be confused with Diamond is waterworn Quartz pebbles which may resemble waterworn Diamonds, but the hardness and luster of Diamond will easily differentiate the two."}, {"url": "http://www.mineralseducationcoalition.org/minerals/diamond", "passage_text": "Natural diamond has been discovered in 35 countries. Some diamonds have been found in the United States. Colorado, for instance, has produced a small number of diamonds. The following countries produce industrial grade diamonds: Australia, Botswana, Brazil, China, Congo, Russia and South Africa."}]