[{"url": "https://simple.wikipedia.org/wiki/Disneyland", "passage_text": "When Disneyland Park opened on July 17, 1955, the opening was shown on television as it happened. Mr. Disney asked three of his Hollywood friends to help him: Art Linkletter, Robert Cummings and Ronald Reagan. Many things went wrong that day."}, {"url": "http://history1900s.about.com/od/1950s/qt/disneyland.htm", "passage_text": "On July 17, 1955, Disneyland opened for a few thousand specially invited visitors; the following day, Disneyland officially opened to the public. Disneyland, located in Anaheim, California on what used to be a 160-acre orange orchard, cost $17 million to build."}, {"url": "https://simple.wikipedia.org/wiki/Disneyland", "passage_text": "It is the first Disneyland. It was opened on July 17, 1955, by Walt Disney, the man who invented Mickey Mouse. It is one of the most popular theme parks in the world. Disneyland Park celebrated its golden, or 50th, anniversary on July 17, 2005."}, {"url": "https://en.wikipedia.org/wiki/Disneyland", "passage_text": "Disneyland Park, originally Disneyland, is the first of two theme parks built at the Disneyland Resort in Anaheim, California, opened on July 17, 1955. It is the only theme park designed and built under the direct supervision of Walt Disney."}, {"url": "http://traveltips.usatoday.com/history-disneyland-park-anaheim-california-40569.html", "passage_text": "Disney used the television show Disneyland to promote its opening. The park opened on July 17, 1955, and had 18 attractions distributed over five lands, Adventureland, Fantasyland, Frontierland, Tomorrowland and Main Street USA. Ronald Reagan was one of three hosts of the opening ceremony of the $17.5 million park."}, {"url": "http://www.thisdayindisneyhistory.com/DisneylandGrandOpening.html", "passage_text": "A fter years of planning, Walt Disney's very first theme park Disneyland opened its gates at 2:30PM on Sunday July 17, 1955 in Anaheim, California."}, {"url": "https://simple.wikipedia.org/wiki/Disneyland", "passage_text": "Disneyland Park is a theme park in Anaheim, California, United States. It is the first Disneyland. It was opened on July 17, 1955, by Walt Disney, the man who invented Mickey Mouse. It is one of the most popular theme parks in the world. Disneyland Park celebrated its golden, or 50th, anniversary on July 17, 2005."}, {"url": "http://www.answers.com/Q/When_did_Disneyland_open", "passage_text": "Disneyland Paris opened to the public on the 12th of April 1992 and a second park, Walt Disney studios opened on the 16th of March 2002, Disneyland Paris was first called Euro … Disney resort."}]