[{"url": "http://stilltasty.com/articles/view/74", "passage_text": "• Place the frozen turkey in the fridge — be sure your refrigerator temperature is set at 40 °F or below. • You’ll need to a llow about 24 hours for each 4 to 5 pounds of frozen turkey you plan to thaw in the fridge."}, {"url": "http://stilltasty.com/articles/view/9", "passage_text": "Using this thawing method, small packages of frozen meat or poultry (about a pound) can defrost in one hour or less. For larger items, you should estimate about 30 minutes of defrosting time per pound of food. Once the food is thawed completely, you’ll need to cook it immediately."}, {"url": "http://askkaren.custhelp.com/app/answers/detail/a_id/498/~/ham-thawing-time", "passage_text": "It will take about 4 to 6 hours per pound. Cold water thawing is faster than refrigerator thawing but requires more attention. Put ham in a leak-proof package or plastic bag and submerge it in cold tap water, changing the water every 30 minutes. Estimate about 30 minutes per pound of ham."}, {"url": "http://askkaren.custhelp.com/app/answers/detail/a_id/502/~/how-long-does-it-take-for-beef-to-thaw%3F", "passage_text": "1 To thaw beef in cold water, do not remove packaging. 2  Be sure the package is airtight or put it into a leakproof bag. 3  Submerge the beef in cold water, changing the water every 30 minutes so that it continues to thaw. 4  Small packages of beef may thaw in an hour or less; a 3- to 4-pound roast may take 2 to 3 hours."}, {"url": "http://stilltasty.com/articles/view/9", "passage_text": "It usually takes an entire day to thaw even a small amount of frozen food, such as a pound of ground meat or boneless chicken breasts. For large items, like a whole turkey or ham, it’ll take about 24 hours of defrosting time for every 5 pounds of food. All that waiting does have a payoff, though."}, {"url": "http://askkaren.custhelp.com/app/answers/detail/a_id/502/~/how-long-does-it-take-for-beef-to-thaw%3F", "passage_text": "1 Submerge the beef in cold water, changing the water every 30 minutes so that it continues to thaw. 2  Small packages of beef may thaw in an hour or less; a 3- to 4-pound roast may take 2 to 3 hours. 3  Cook immediately. 4  When microwave thawing, refer to your microwave owner's manual for instructions."}, {"url": "http://askkaren.custhelp.com/app/answers/detail/a_id/502/~/how-long-does-it-take-for-beef-to-thaw%3F", "passage_text": "In the refrigerator, ground beef, stew meat, and steaks may thaw within a day. Bone-in parts and whole roasts may take 2 days or longer. Once the raw ground beef thaws, it will be safe in the refrigerator for 1 to 2 days."}]