[{"url": "http://www.answers.com/Q/What_is_Muscular_endurance", "passage_text": "Muscular endurance is the ability of a muscle or group of muscles to sustain repeated contractions against a resistance for an extended period of time. Muscular endurance is very important for people playing sports and who have to sustain an activity for long periods of time. Muscular endurance is determined by how well your slow twitch muscle fibers are developed. In case your wondering what slow twitch muscle fibers are, I will explain."}, {"url": "http://generalfitness.tripod.com/id1.html", "passage_text": "Muscular Endurance-the ability of a muscle to do continous work over a long period of time. Muscular Endurance-the ability of a muscle to do continous work over a long period of time. Muscular endurance is very important for people playing sports and who have to sustain an activity for long periods of time. Muscular endurance is determined by how well your slow twitch muscle fibers are developed. In case your wondering what slow twitch muscle fibers are, I will explain. If you are looking to improve the endurance of your upper body, bodyweight exercises such as chin-ups, push-ups, triceps dips, etc., will improve this, and your strength as well"}, {"url": "http://www.humankinetics.com/excerpts/excerpts/Muscular-strength-and-muscular-endurance-for-elementary-students---The-Physical-Best-Program-NASPE", "passage_text": "Muscular strength and endurance—Muscular strength is the strongest force possible that a group of muscles can produce to perform a task. Muscular endurance is the ability to move your body or an object repeatedly without getting tired. For most activities, you use both muscular strength and endurance. Purpose. "}, {"url": "http://www.livestrong.com/article/392246-what-is-the-definition-of-muscular-endurance/", "passage_text": "Muscular endurance is the ability of a muscle or group of muscles to repeatedly exert force against resistance. Performing multiple repetitions of an exercise is a form of muscular endurance, as is running or swimming. If your muscles have to contract in a similar pattern more than one time you are using muscular endurance. The fibers in your muscles that fatigue can fail because of a lack of energy. Glycogen, or sugar, is required for both peak and sustained muscular effort. A diet low in carbohydrates can sometimes make it difficult to sustain"}, {"url": "http://www.buzzle.com/articles/what-does-muscular-endurance-mean.html", "passage_text": "Muscular endurance is an associated component of physical fitness. It has a lot of significance in sports as well as for general health. Muscular endurance is the ability of a muscle or a group of muscles to undergo repeated contractions against resistance for an extended period of time. It is associated with the muscle's ability to continue to perform without fatigue. There are two types of muscle fibers-slow twitch and fast twitch. Fast twitch fibers enable swift, short movements that last no longer than a few seconds. Slow twitch muscle fibers enable the performance of tedious, repetitive actions, such as climbing, rowing, running a marathon, etc."}, {"url": "http://healthyliving.azcentral.com/meaning-muscular-strength-6953.html", "passage_text": "Muscular strength refers to the maximal force that a muscle or muscle group can generate at a specific velocity, write Thomas R. Baechle and Roger W. Earle in Essentials of Strength Training and Conditioning.” It's important to note that strength does not simply refer to muscle size. SHARE SHARE TWEET EMAIL. Muscular strength is a phrase used liberally in the fitness and athletic world. Strength refers to a specific physical ability, as well as a unique set of training goals. Understanding the components of strength can help you design an effective resistance training program."}, {"url": "http://www.answers.com/Q/What_is_Muscular_endurance", "passage_text": "The combination of strength and endurance. Muscular Endurance is the ability of a muscle to do continuous work over a long period of time. Muscular endurance is a crucial element of fitness for the athletes such as swimmers, rowers, distant runners and cyclists. Muscular endurance is very important for people playing sports and who have to sustain an activity for long periods of time. Muscular endurance is determined by how well your slow twitch muscle fibers are developed. In case your wondering what slow twitch muscle fibers are, I will explain."}, {"url": "http://www.answers.com/Q/What_is_Muscular_endurance", "passage_text": "Muscular endurance is a combination of strength and endurance of muscles. Muscular endurance is the ability of a muscle or a group of muscles to perform repeated muscular contractions against resistance for an extended period of time. It is associated with the muscle's ability to continue to perform without fatigue. Muscular endurance is very important for people playing sports and who have to sustain an activity for long periods of time. Muscular endurance is determined by how well your slow twitch muscle fibers are developed. In case your wondering what slow twitch muscle fibers are, I will explain."}]