[{"url": "https://en.wikipedia.org/wiki/United_States_Constitution", "passage_text": "The United States Constitution is the supreme law of the United States of America. The Constitution, originally comprising seven articles, delineates the national frame of government. The United States Bill of Rights consists of 10 amendments added to the Constitution in 1791, as supporters of the Constitution had promised critics during the debates of 1788. The English Bill of Rights (1689) was an inspiration for the American Bill of Rights."}, {"url": "http://www.scholastic.com/browse/article.jsp?id=7466", "passage_text": "Article VI states that the Constitution is the highest law of the land. Federal and state officers and judges must uphold the Constitution. Article VII. The names of the men who signed and ratified, or approved the Constitution, are in Article VII. Rules for how the President and the Vice President are elected are defined in Article II. It also defines the responsibilities and powers of the President and the executive branch."}, {"url": "http://kids.laws.com/articles-of-the-constitution", "passage_text": "The Constitution is made of the Preamble and seven different articles. Together, these articles are the foundation for how the United States government is organized. The Articles of the Constitution also explain how the federal government interacts with the citizens, states, and people of the country. In the United States, the executive branch is made up of the President and executive officers. Article 3 of the Constitution. Article 3 of the Constitution creates a judicial branch in the United States. The Judicial branch is the court system that interprets the law."}, {"url": "http://kids.laws.com/articles-of-the-constitution", "passage_text": "Article 2 of the Constitution. Article 2 of the Constitution makes the executive branch of the government. The Executive branch has the responsibility and authority for the administration on a daily basis. In the United States, the executive branch is made up of the President and executive officers. Article 3 of the Constitution. Article 3 of the Constitution creates a judicial branch in the United States. The Judicial branch is the court system that interprets the law. In the United States, the judicial branch includes the Supreme Court and the lower courts which are made by Congres"}, {"url": "http://www.scholastic.com/browse/article.jsp?id=7466", "passage_text": "Article II. Rules for how the President and the Vice President are elected are defined in Article II. It also defines the responsibilities and powers of the President and the executive branch. Article III. The judicial branch includes the Supreme Court and lower courts"}, {"url": "https://www.law.cornell.edu/constitution/overview", "passage_text": "The Constitution of the United States of America (see explanation). 1  Preamble [We the people] (see explanation). 2  Article I [The Legislative Branch] (see explanation). 3  Section 1. [Legislative Power Vested] (see explanation). 4  Section 2. [House of Representatives] (see explanation). 5  Section 3. [Senate] (see explanation). "}, {"url": "https://en.wikipedia.org/wiki/United_States_Constitution", "passage_text": "Amendments to the United States Constitution, unlike ones made to many constitutions world-wide, are appended to the end of the document. At seven articles and twenty-seven amendments, it is the shortest written constitution in force. The United States Bill of Rights consists of 10 amendments added to the Constitution in 1791, as supporters of the Constitution had promised critics during the debates of 1788. The English Bill of Rights (1689) was an inspiration for the American Bill of Rights."}, {"url": "https://en.wikipedia.org/wiki/Constitution", "passage_text": "A constitution is a set of fundamental principles or established precedents according to which a state or other organization is governed. These rules together make up, i.e. constitute, what the entity is. Within states, a constitution defines the principles upon which the state is based, the procedure in which laws are made and by whom. Some constitutions, especially codified constitutions, also act as limiters of state power, by establishing lines which a state's rulers cannot cross, such as fundamental rights."}, {"url": "https://en.wikipedia.org/wiki/United_States_Constitution", "passage_text": "The Constitution is interpreted, supplemented, and implemented by a large body of constitutional law. The Constitution of the United States is the first constitution of its kind, and has influenced the constitutions of other nations. The United States Bill of Rights consists of 10 amendments added to the Constitution in 1791, as supporters of the Constitution had promised critics during the debates of 1788. The English Bill of Rights (1689) was an inspiration for the American Bill of Rights."}]