[{"url": "http://hkpp.org/patients/potassium-health", "passage_text": "Potassium is found in a wide range of foods. Many fruits and vegetables are high in potassium and low in sodium and, as discussed, help prevent hypertension. Most of the potassium is lost when processing or canning foods, while less is lost from frozen fruits or vegetables."}, {"url": "http://www.emedicinehealth.com/low_potassium/article_em.htm", "passage_text": "Potassium is a mineral (electrolyte) in the body. Almost 98% of potassium is found inside the cells. Small changes in the level of potassium that is present outside the cells can have severe effects on the heart, nerves, and muscles. Potassium is important to maintain several bodily functions:"}, {"url": "http://education.jlab.org/itselemental/ele019.html", "passage_text": "Potassium is pronounced as poh-TASS-ee-em. History and Uses: Although potassium is the eighth most abundant element on earth and comprises about 2.1% of the earth's crust, it is a very reactive element and is never found free in nature. Metallic potassium was first isolated by Sir Humphry Davy in 1807 through the electrolysis of molten caustic potash (KOH)."}, {"url": "http://umm.edu/health/medical/altmed/supplement/potassium", "passage_text": "Potassium is a very important mineral for the proper function of all cells, tissues, and organs in the human body. It is also an electrolyte, a substance that conducts electricity in the body, along with sodium, chloride, calcium, and magnesium."}, {"url": "http://www.webelements.com/potassium/", "passage_text": "Potassium metal is far too reactive to be found uncombined in nature. The element is quite abundant and makes up about 1.5 % by weight of the earth's crust. Potassium is found extensively as potash (KOH). It is mined in Germany, USA, and elsewhere. Minerals such as sylvite (KCl), carnallite, and langbeinite, are found in ancient lake and sea beds. That as Saskatchewan in Canada contains about 10,000,000,000 tonnes of potassium chloride."}, {"url": "http://www.webelements.com/potassium/", "passage_text": "Potassium: the essentials. Potassium is a metal and is the seventh most abundant and makes up about 1.5 % by weight of the earth's crust. Potassium is an essential constituent for plant growth and it is found in most soils. It is also a vital element in the human diet. Potassium is never found free in nature, but is obtained by electrolysis of the chloride or hydroxide, much in the same manner as prepared by Davy."}]