[{"url": "http://www.diabetesforecast.org/2011/mar/how-the-body-uses-carbohydrates-proteins-and-fats.html", "passage_text": "By Erika Gebel, PhD. WCIE---Nutrition, WCIE---Carbs, The human body is remarkably adept at making do with whatever type of food is available. Our ability to survive on a variety of diets has been a vital adaptation for a species that evolved under conditions where food sources were scarce and unpredictable."}, {"url": "http://www.rawfoodexplained.com/carbohydrates/the-role-of-carbohydrates-in-the-body.html", "passage_text": "When carbohydrates needed for the functioning of the central nervous system, the muscles and the other body systems and functions are insufficient in the diet (as during a fast or on a weight-loss diet), stored adipose tissue (fat) is broken down into glucose to make up the caloric deficit."}, {"url": "http://www.rawfoodexplained.com/carbohydrates/the-role-of-carbohydrates-in-the-body.html", "passage_text": "Glycogen is stored in the liver and muscles and in smaller amounts in the other organs and tissues of the body. Energy is derived from glucose by the splitting of the glucose molecules into smaller compounds and oxidizing these to form water, which frees quite a large amount of energy."}, {"url": "http://www.mckinley.illinois.edu/Handouts/macronutrients.htm", "passage_text": "We need this amount of carbohydrate because: 1  Carbohydrates are the body s main source of fuel. 2  Carbohydrates are easily used by the body for energy. 3  All of the tissues and cells in our body can use glucose for energy. 4  Carbohydrates are needed for the central nervous system, the kidneys, the brain, the muscles (including the heart) to function 5  ... C"}, {"url": "http://www.acaloriecounter.com/diet/daily-carb-intake/", "passage_text": "Quite simply, protein and fat (specifically the omega-3 and omega-6 fatty acids) are essential to your body. Carbs on the other hand are not. Yes, your brain and other tissues do require a small amount, but the human body is actually capable of producing that small amount on its own."}, {"url": "http://www.diabetesforecast.org/2011/mar/how-the-body-uses-carbohydrates-proteins-and-fats.html", "passage_text": "Carbohydrate. Carbohydrates, on the other hand, can only be stored in limited quantities, so the body is eager to use them for energy. We think of carbs as the [nutrient] that's used first, says Eric Westman, MD, MHS, director of the Lifestyle Medicine Clinic at Duke University Medical Center."}, {"url": "http://www.answers.com/Q/What_does_carbohydrate_do_for_your_body", "passage_text": "The main purpose of the carbohydrate is to provide fuel for your body to function. Carbohydrates are types of sugars. They perform several functions. The most important func … tion is as the primary source of energy for the body. But there are many types of carbohydrates that perform a myriad of functions in the body."}, {"url": "http://www.answers.com/Q/What_does_carbohydrate_do_for_your_body", "passage_text": "The function of carbohydrates is to give energy to all the cells in our body and they fuel the basal. metabolic rate (the rate at which we use energy at rest) and activity levels. Carbohydrates are split into four groups each have their own role in the body."}, {"url": "http://healthyeating.sfgate.com/carbohydrate-do-1033.html", "passage_text": "Bread is a rich source of carbohydrates. The term carbohydrate is synonymous with saccharide, which is a chemical group consisting of simple and complex sugars. Carbohydrates are commonly found in many foods, especially breads, pastas, dairy products, fruits and vegetables."}]