[{"url": "http://www.livestrong.com/article/220898-cpr-vs-rescue-breathing/", "passage_text": "Rescue breathing. Rescue breathing is a skill performed for a victim who is not breathing at all, or whose breaths are too slow or irregular to be effective. In rescue breathing, breaths are delivered to the victim by pinching the nose shut and breathing into the victim's mouth"}, {"url": "http://www.wikihow.com/Provide-Rescue-Breathing-for-a-Child", "passage_text": "Rescue breathing can be performed when the individual still has a pulse, but is not breathing. The following instructions involve the process with which to provide rescue breathing for a child (ages 1 to puberty, or approximately age 12). Ad. "}, {"url": "http://www.webmd.com/first-aid/tc/dealing-with-emergencies-rescue-breathing-and-cpr", "passage_text": "CPR (cardiopulmonary resuscitation) is pushing down on a person's chest and breathing into his or her mouth. It is used in emergencies when someone's heart stops beating, or when he or she is not breathing normally (may be gasping for breath) or is not breathing at all. "}, {"url": "http://www.answers.com/Q/What_is_the_difference_between_rescue_breathing_and_cpr", "passage_text": "Mouth-to-mouth resuscitaton (or rescue breathing) is when a person breathes into the mouth and/or nose of an unconscious patient. CPR is solely the act of providing chest compressions and rescue breathing to stimulate the flow of oxygen and blood in a person's body while waiting for intervention to … restart or reset the heart."}, {"url": "http://www.answers.com/Q/What_is_rescue_breathing", "passage_text": "Mouth-to-mouth resuscitaton (or rescue breathing) is when a person breathes into the mouth and/or nose of an unconscious patient. This will allow the lungs to refill with oxygen. When you are administering CPR, you may need to give two rescue  breaths. This is done by tilting the person's head back to open the  airway, holding the person's nose shut, … making a seal with your  mouth and breathing for a full second."}, {"url": "http://www.wisegeek.com/what-is-rescue-breathing.htm", "passage_text": "When someone stops breathing and becomes unconscious, rescue breathing is a crucial tool to revive the individual or keep him or her alive until help comes. Before administering rescue breathing, it is important to clear the scene. Look for obvious hazards and try to eliminate them. For example, if your victim has been in a car accident, you should not administer CPR in the middle of the road. Ideally, you should wear gloves and use a respiration mask to give CPR."}, {"url": "http://harmreduction.org/issues/overdose-prevention/overview/overdose-basics/responding-to-opioid-overdose/perform-rescue-breathing/", "passage_text": "For a person whose breathing is severely impaired, rescue breathing is one of the most important steps in preventing an overdose death. If you are performing rescue breathing, you are getting much needed air into someone’s body who will die without it. The difference between survival and death in an opioid overdose depends on how quickly enough oxygen gets into the person’s body."}, {"url": "http://www.procpr.org/en/training_video/adult-rescue-breathing", "passage_text": "Adult Rescue Breathing Training Summary. If we encounter someone who is unresponsive and is not breathing normally but has a pulse, rescue breathing should be performed. In rescue breathing, the rescuer is basically breathing for the person, helping to prevent brain damage and death in the patient. Rescue breaths should be given at a rate of one breath every five seconds for an adult. After two minutes, check for a pulse. If there is no pulse present, begin CPR on this patient"}, {"url": "http://www.livestrong.com/article/220898-cpr-vs-rescue-breathing/", "passage_text": "Rescue breathing is one skill learned in CPR training. Cardiopulmonary resuscitation and rescue breathing are skills used when a person has fallen victim to sudden cardiac or respiratory arrest. Both of these situations pose an immediate threat to life. Rescue breathing is a skill performed for a victim who is not breathing at all, or whose breaths are too slow or irregular to be effective. In rescue breathing, breaths are delivered to the victim by pinching the nose shut and breathing into the victim's mouth"}]