[{"url": "http://www.theapprenticedoctor.com/what-does-an-anesthetist-do/", "passage_text": "General anesthetic is where the anesthetist puts a patient to sleep (medical terminology: the anesthetist sedates the patient) in preparation for an operation. The obvious reason for putting a patient to sleep for an operation is so that the patient won’t feel pain and discomfort during the operation. (Anesthesiologist). An anesthetist, also called an anesthesiologist, is responsible for administering local or general anesthetic. Local anesthetic is where only the part of the body being operated on is numbed so the patient can’t feel anything in that specific area."}, {"url": "http://www.asanr.com/?qa_faqs=what-does-an-anesthesiologist-do", "passage_text": "The anesthesiologist is a medical doctor who, after medical school and internship, has chosen to specialize in anesthesiology. All anesthesiologists have at least three years of training after medical school; most have four years, and a few have more. It is the anesthesiologist’s job to keep you safe and comfortable during surgery and recovery from anesthesia. Once you enter the operating room, the anesthesiologist never leaves your side until you are safe and stable in the postanesthesia care unit. If the patient encounters a problem during surgery (low blood pressure, asthma, substantial blood loss, inadequate blood flow to the heart, heart arrhythmia and many others), the anesthesiologist works to correct the problem."}, {"url": "https://www.hss.edu/what-is-an-anesthesiologist.asp", "passage_text": "Please see our staff listing. Most of the HSS anesthesiologists have completed fellowship in fields such as regional anesthesia, pediatric anesthesia, critical care medicine, cardiothoracic anesthesia, chronic pain, and anesthesia research. HSS specializes in regional anesthesia. Administration of anesthesia involves first talking with the patient to establish a plan for the anesthesia, as well as making sure that the patient is ready for the operation. The first priority is getting the patient safely through the procedure."}, {"url": "https://www.hss.edu/what-is-an-anesthesiologist.asp", "passage_text": "An anesthesiologist is a doctor (MD or DO) who practices anesthesia. Anesthesiologists are physicians specializing in perioperative care, development of an anesthetic plan, and the administration of anesthetics. HSS specializes in regional anesthesia. Administration of anesthesia involves first talking with the patient to establish a plan for the anesthesia, as well as making sure that the patient is ready for the operation. The first priority is getting the patient safely through the procedure."}, {"url": "http://www.asanr.com/?qa_faqs=what-does-an-anesthesiologist-do", "passage_text": "Some are given intravenously; others are mixed with the oxygen the patient breathes. If the patient encounters a problem during surgery (low blood pressure, asthma, substantial blood loss, inadequate blood flow to the heart, heart arrhythmia and many others), the anesthesiologist works to correct the problem."}, {"url": "http://drbegalke.blogspot.com/2011/01/what-does-anesthesiologist-do.html", "passage_text": "Although anesthesiologists complete a minimum of eight years of medical training after college, many elect to spend an additional fellowship year of specialty training in specific areas such as pain management, cardiac anesthesia, pediatric anesthesia, neuroanesthesia, obstetric anesthesia or critical care medicine. Anesthesiologists in the United States complete a four year undergraduate college degree that includes satisfying pre-med requirements. Like other medical doctors, anesthesiologists must follow undergraduate education with four years of medical school."}, {"url": "http://learn.org/articles/What_Does_a_Nurse_Anesthetist_Do.html", "passage_text": "A nurse anesthetist is an advanced practice nurse who specializes in administering anesthetics to patients and coordinating their care with other medical professionals. A nurse anesthetist is a registered nurse who works closely with doctors to administer and monitor a patient's anesthesia for medical procedures."}, {"url": "https://en.wikipedia.org/wiki/Anesthesiologist", "passage_text": "An anesthesiologist (US English) or anaesthetist (British English) is a physician trained in anesthesia and perioperative medicine. "}, {"url": "http://www.healthcare-salaries.com/physicians/anesthesiologist-salary", "passage_text": "The annual salary for an Anesthesiologist is about $166,400 while the median salary for an anesthesiologist based in US is $335,078. As you can see average anesthesiologist salary is one of the highest salary in medical sector. This is based on PayScale reports about how much anesthesiologists earn in the US. PayScale also showed that anesthesiologists have a base salary ranging from $103,490 to $388,654, bonus of up to $59,714, and profit sharing ranging from $3,393 to $50,457."}]