[{"url": "http://hsv.com/writers/engel/outsou3.html", "passage_text": "It is hard to over-emphasize how important the content of an outsourcing contract is. Once you have an outsourcing contract in place, the clauses of this agreement will guide your outsourcer's every move, and may act to free you to do business or feel like a straitjacket. Here, in layman's terms, are some points to consider when planning the contract. An outsourcing agreement is much like any other contract: it is putting in writing what the two companies agree will be done by each party, and usually how it will be paid for. If you have worked with government contracts, you may see numerous similarities. Typical contracts contain the following parts: 1  Scope of Work."}, {"url": "http://www.slaw.ca/2012/04/04/service-level-agreement-in-outsourcing-contracts/", "passage_text": "More posts by Sue ». A service level agreement (SLA) is a critical part of any outsourcing contract. SLA defines the boundaries of outsourcing project in terms of the functions and services that the service provider will deliver and identifies the service standards that the service provider must meet. "}, {"url": "http://www.wisegeek.com/what-is-a-bpo-agreement.htm", "passage_text": "A business process outsourcing (BPO) agreement is a contract between a client company and a third-party service provider to take over a non-core part of the client's business operations. As a result, the BPO agreement is a unique document that resembles a performance contract much more than it does an ordinary sales or service contract. Ad. The typical BPO agreement addresses core elements of the outsourcing arrangement."}, {"url": "http://www.wisegeek.com/what-is-a-bpo-agreement.htm", "passage_text": "A confidentiality agreement is sometimes signed. A business process outsourcing agreement is a contract between a client company and a third-party service provider to take over a non-core part of the client's business operations. View slideshow of images above. Watch the Did-You-Know slideshow. Follow @wiseGEEK. As a result, the BPO agreement is a unique document that resembles a performance contract much more than it does an ordinary sales or service contract. Ad. The typical BPO agreement addresses core elements of the outsourcing arrangement."}, {"url": "https://en.wikipedia.org/wiki/Outsourcing", "passage_text": "The opposite of outsourcing, insourcing, entails bringing processes handled by third-party firms in-house, and is sometimes accomplished via vertical integration. However, a business can provide a contract service to another business without necessarily insourcing that business process. In business, outsourcing involves the contracting out of a business process to another party (compare business process outsourcing). The concept outsourcing came from American Glossary 'outside resourcing' and it dates back to at least 1981."}, {"url": "http://definitions.uslegal.com/o/outsourcing-agreement/", "passage_text": "Outsourcing Agreement Law & Legal Definition. Outsourcing agreement is an agreement between a business and a service provider in which the service provider promises to provide necessary services. "}, {"url": "https://en.wikipedia.org/wiki/Business_process_outsourcing", "passage_text": "A business process outsourcing office in Cainta, Rizal, Philippines. Business process outsourcing (BPO) is a subset of outsourcing that involves the contracting of the operations and responsibilities of a specific business process to a third-party service provider. BPO that is contracted outside a company's country is called offshore outsourcing. BPO that is contracted to a company's neighbouring (or nearby) country is called near"}, {"url": "http://agreements.realdealdocs.com/Outsourcing-Agreement/", "passage_text": "Governing Law (optional). An outsourcing agreement is a document used when a company or individual (“Client”) decides to use an outside source for a business service (“Outsourcer”). A technology company may outsource their customer support call center to a call center company in another state or country, and would use this type of agreement. Deadlines, reports, taxes, fees, and how to handle costs of the outsourcing process may also be present in the document. The outsourcing agreement will also contain what state's or locality's governing law it shall follow, plus clauses for both parties' right to termination."}, {"url": "http://uk.practicallaw.com/0-202-4551", "passage_text": "Specimen outsourcing agreement, primarily for use in relation to the outsourcing of IT or IT-enabled business process services where the services are being outsourced for the first time on a long-term basis. The agreement covers the transfer of employees to the supplier and the transfer of assets where appropriate. "}]