[{"url": "http://eastwindsor-ct.gov/Public_Documents/index", "passage_text": "This table is used for column layout. Incorporated in 1768, today s East Windsor strives to preserve its quiet, small town feel. East Windsor relies on its citizens to maintain this character, whether they volunteer, join a local club, serve on a Town board, or vote at a Town Meeting. This website supports these efforts by helping the Town s citizens and friends connect with government and community information."}, {"url": "http://www.addresses.com/white-pages/connecticut/windsor", "passage_text": "Windsor, CT White Pages. Run a search by name for anyone in Windsor, Connecticut & get free white pages information instantly. Windsor, Connecticut white page directory listings include full name, phone number and address. "}, {"url": "http://www.yellowpages.com/east-windsor-ct/dentists", "passage_text": "1. Great Expressions Dental Centers East Windsor. (1). (1). 122 Prospect Hill Rd East Windsor, CT 06088. (860) 292-6600. Rooms & Rates ». Dentists Oral & Maxillofacial Surgery. Website Directions More Info. "}, {"url": "https://locators.bankofamerica.com/ct/eastwindsor/financial-centers-east-windsor-13230.html", "passage_text": "Commercial Deposits. You can make deposits to your commercial account here. 1  Night Deposit Accepted More information about Night Deposit AcceptedNight Deposits You can make deposits after business hours using the financial center's night depository. 2  Night depository transactions are credited the following business day. 1 Night Deposit Accepted More information about Night Deposit AcceptedNight Deposits You can make deposits after business hours using the financial center's night depository. 2  Night depository transactions are credited the following business day."}, {"url": "http://local.fedex.com/ct/windsor-locks/EHTA/", "passage_text": "Whether it has to be there overnight or within a couple of days, you have options. Get packaging supplies and tips, plus all the other shipping support you need at this FedEx location at 100 Old County Circle in Windsor Locks, Connecticut. 1  Location Detail"}, {"url": "http://ewpd.com/", "passage_text": "The mission of the East Windsor Township Police Department is to protect life and property and to enhance the quality of life through a broad range of problem solving and professional police services, while working in partnership with our government and community. E-mail comments/suggestions to Webmaster@ewpd.com. "}, {"url": "http://local.fedex.com/ct/windsor-locks/EHTA/", "passage_text": "Whether you’re shipping or waiting for a FedEx ® package, you can quickly and easily request to have it delivered to the FedEx location at 100 Old County Circle. The option is available for free with FedEx Express. Get packaging supplies and tips, plus all the other shipping support you need at this FedEx location at 100 Old County Circle in Windsor Locks, Connecticut."}, {"url": "http://www.yelp.com/biz/geisslers-supermarket-east-windsor-2", "passage_text": "History. Established in 1923. Geissler's started in 1923 with A.F.Geisser delivering groceries to the small village of Broad Brook in the town of East Windsor, Ct. Mr. Geissler's daughter Mary, married Jim Nilsson Sr., who took over and expanded the business into a multi store chain. The Nilsson family still owns and operates the Geissler's stores today."}, {"url": "http://www.uspspostoffices.com/ct/east-windsor/east-windsor", "passage_text": "[+] Services Offered at this location. 1  Burial Flags. 2  Business Reply Mail Account Balance. 3  Business Reply Mail New Permit. 4  Duck Stamps. 5  General Delivery. 6  Money Orders (Domestic). 7  Money Orders (Inquiry). 8  Money Orders (International). 9  Pickup Accountable Mail. 10  Pickup Hold Mail. 11  PO Box Online. 12  Priority Mail International®. 13  Lot Parking. "}]