[{"url": "http://www.vox.com/2014/7/6/5874499/map-heres-how-much-every-country-spends-on-food", "passage_text": "The average American household spends $2,390 per year on food consumed at home, the USDA notes. The average German household spends $2,646 per year. The average French household spends $3,241 per year. The average Norwegian spends a whopping $4,454 per year on food. The USDA doesn't explain the variation. Some of it likely has to do with different tax systems in Europe (here's an international comparison of food prices), as well as differences in eating out. The average American, after all, spends just 6.5 percent of his or her household budget on food consumed at home. (If you include eating out, that rises to around 11 percent. ). In Pakistan, by contrast, the average person spends 41.4"}, {"url": "http://www.fool.com/investing/general/2015/03/07/the-average-american-spends-this-much-on-groceries.aspx", "passage_text": "The lowest-income families, those who make less than $10,000 per year, spend about $200 per month on groceries. That accounts for a disproportionate 11% of their budget. At the highest income levels, those with an average salary above $150,000, the figures flip. Typical grocery spending According to the U.S. Bureau of Labor Statistics, the average American family spent $4,000 per year on groceries in 2013, or about $330 each month."}, {"url": "http://fivejs.com/how-much-money-do-families-spend-on-food/", "passage_text": "While there was a very, very wide range of monthly food expenditures per person among all the respondents to the survey ($30 for some families and up to $300 for others) I did discover through this survey that our family spends somewhat less than the average on our groceries. To that end, I created a survey today and 150 families responded. With the information I gathered, I calculated what the average amount per person each family spent on food. I also took into account that some families need to purchase specialty foods, like dairy free, gluten free, organic, etc."}, {"url": "http://www.dailymail.co.uk/news/article-2617493/Average-American-spends-1-200-year-fast-food.html", "passage_text": "51. View. comments. The average American spends more than $1,200 on fast food every year, research has shown. A study carried out among 1,000 adults found typically they will tuck into fast food on two occasions every week-shelling out around $12.50 per meal-with burgers, pizza and fried chicken the most common meals. "}, {"url": "http://fivejs.com/how-much-money-do-families-spend-on-food/", "passage_text": "We live in northern Ohio and have a tough time, with a family of 5, spending much less than $1000 per month on groceries, paper products, diapers, hygeine products, cleaning supplies and pet food. We purchase a side of beef once a year, so the beef cost is around $2.89 per pound. To that end, I created a survey today and 150 families responded. With the information I gathered, I calculated what the average amount per person each family spent on food. I also took into account that some families need to purchase specialty foods, like dairy free, gluten free, organic, etc."}, {"url": "http://www.huffingtonpost.com/2012/08/02/food-spending_n_1734946.html", "passage_text": "Gallup has released new poll results on how much Americans spend on food per week. The last time Gallup asked this question was 1987, in which the average amount spent per week on food was $108. Over 20 years later, that number has climbed to $151. To give some perspective, in 1943 an average of $15 was spent on food per week (not adjusted for inflation). Interestingly enough, Americans used to spend more on food in the 1960s, with an all-time high at $234 in 1966 and 1967. The chart below illustrates that spending does vary significantly among respondents, with eight percent of the respondents spending less than $50 per week on food and 10 percent spending $300 or more"}, {"url": "http://www.gallup.com/poll/156416/Americans-Spend-151-Week-Food-High-Income-180.aspx", "passage_text": "Young adults' average weekly food spending is $173, more than what older Americans say they spend. Those with incomes of $75,000 or more per year are averaging $180 per week, compared with $144 for those with incomes of $30,000 to $74,999, and $127 for the lowest income group. One in 10 Americans say they spend $300 or more per week and, at the other extreme, 8% spend less than $50. Gallup has asked a version of this question as far back as 1943, but has not asked it since 1987. In 1943, an average of $15 per week was spent on food."}, {"url": "http://lifehacker.com/how-much-money-do-you-spend-on-food-every-month-1696492352", "passage_text": "These are based on meals eaten at home, with food costs estimated for nutritious diets based on MyPyramid recommendations and USDA’s dietary guidelines. The BLS has a more detailed breakdown of food costs, including an average $2,625 per year or $219 a month for food away from home. But let’s hear from you. "}, {"url": "http://www.gallup.com/poll/156416/Americans-Spend-151-Week-Food-High-Income-180.aspx", "passage_text": "WASHINGTON, D.C. -- Americans report spending $151 on food per week on average. One in 10 Americans say they spend $300 or more per week and, at the other extreme, 8% spend less than $50. Gallup has asked a version of this question as far back as 1943, but has not asked it since 1987. In 1943, an average of $15 per week was spent on food. The final 1987 estimate was $106"}]