[{"url": "http://chemistry.about.com/od/waterchemistry/f/What-Is-Heavy-Water.htm", "passage_text": "Here's a look at what heavy water is and some heavy water facts. Answer: Heavy water is water that contains heavy hydrogen or deuterium. Deuterium differs from the hydrogen usually found in water, protium, in that each atom of deuterium contains a proton and a neutron. Heavy water may be deuterium oxide, D 2 O or it may be deuterium protium oxide, DHO. Heavy water occurs naturally, although it is much less common than regular water. Approximately one water molecule per twenty million water molecules are heavy water."}, {"url": "http://www.innovateus.net/science/what-deuterium", "passage_text": "It is also known as heavy hydrogen. Deuterium accounts for about 0.0156% of all naturally occurring hydrogen in the oceans on Earth. The nucleus of deuterium, called a deuteron, consists of one proton and one neutron, whereas the far more common hydrogen nucleus contains no neutron."}, {"url": "http://medical-dictionary.thefreedictionary.com/deuterium+oxide", "passage_text": "deuterium oxide. An isotope of water in which hydrogen has been displaced by its isotope deuterium. Its properties differ from ordinary water in that it has higher freezing and boiling points and is incapable of supporting life."}, {"url": "http://www.thefreedictionary.com/deuterium+oxide", "passage_text": "Noun. 1. deuterium oxide-water containing a substantial proportion of deuterium atoms, used in nuclear reactors. heavy water. moderator-any substance used to slow down neutrons"}, {"url": "http://www.pbs.org/wgbh/nova/hydro/water.html", "passage_text": "In heavy water, each hydrogen atom is indeed heavier, with a neutron as well as a proton in its nucleus. This isotope of hydrogen is called deuterium, and heavy water's more scientific name is deuterium oxide, abbreviated as D 2 0."}, {"url": "http://www.answers.com/Q/What_is_deuterium_oxide", "passage_text": "Deuterium is an example of natural, non-radioactive isotope;  deuterium is the isotope of hydrogen with 1 proton and 1 neutron."}, {"url": "http://www.ncbi.nlm.nih.gov/pubmed/9823430", "passage_text": "Heavy water (deuterium oxide: D2O) contains a neutron and a proton in its hydrogen atoms and shows a variety of biologic activities different from normal light water."}]