[{"url": "http://www.youtube.com/watch?v=ZAKgUVxsLAk", "passage_text": "This popular hot sauce is commonly mispronounced—it's See. Rah. Cha.—according to several Sriracha experts from http://SrirachaMovie.com."}, {"url": "http://communitytable.parade.com/222621/smccook/what-is-sriracha-and-what-is-a-good-brand-substitute/", "passage_text": "(It’s a hot sauce afterall!)What is it used for? In Thailand, sriracha is commonly used in seafood dishes, in omelets, and it’s added to sauces for pad Thai dishes. In the U.S., it’s often used like ketchup and fans use the condiment with just about everything – adding kick to stir-fries, soups, burgers, and more."}, {"url": "http://www.youtube.com/watch?v=ZAKgUVxsLAk", "passage_text": "Featuring David Tran, maker of the popular Huy Fong Foods' Sriracha; Randy Clemens, author of The Sriracha Cookbook; Ann Keochinda of Eastland Food Corporation; and Wattana Pewpukeaw, who produces Sriraja Panich at Thaitheparos."}, {"url": "http://www.youtube.com/watch?v=aSpRboUUBiU", "passage_text": "If you like the video please give it a LIKE and Subscribe to my channel! ---------------------------------------- ­---------------------------------------- ­---------------------------. This is a video that shows you how to pronounce the word sriracha."}, {"url": "http://www.bonappetit.com/trends/article/the-original-sriracha", "passage_text": "Sriraja Panich, the original Thai version of the celebrated Sriracha “rooster sauce” made in America by Huy Fong Foods. Sriraja Panich, however, is hard to come by in the United States; in fact, the only bottle I’d tasted was a gift from gastronaut Pim Techamuanvivit, who’d brought it back from Bangkok."}, {"url": "http://forknplate.com/2015/08/05/sriracha/", "passage_text": "Sriracha (pronounced see-raj-cha) is a hot sauce made from a paste of chili peppers, sugar, garlic, distilled vinegar, and salt. It was originally made in the coastal city of Si Racha in the Chonburi province of eastern Thailand, giving the spicy sauce its name."}, {"url": "http://www.oxforddictionaries.com/definition/english/sriracha", "passage_text": "A spicy sauce made with red chilli and garlic, served especially with Vietnamese and Thai food: pho with a generous dose of sriracha. More example sentences. 1  And this is one of my favorite ingredients, sriracha, it's a Vietnamese hot sauce. 2  So the sauce we've coated the sweetbreads in has a little bit of this sriracha, some fresh lime juice and a little bit of butter to give it a little bit richness."}, {"url": "http://communitytable.parade.com/222621/smccook/what-is-sriracha-and-what-is-a-good-brand-substitute/", "passage_text": "For starters, the sauce is actually called sriracha, and my first introduction to the stuff was through a fiery red-headed roommate in college."}, {"url": "http://greatist.com/health/healthy-sriracha-recipes", "passage_text": "Sriracha (pronounced sir-rotch-ah or sear-raw-chah) is a bright red hot sauce that’s getting seriously popular. The paste-like sauce—named after Sri Racha, Thailand—is made from chili peppers, vinegar, garlic, sugar, and salt."}]