[{"url": "http://www.cure-back-pain.org/spinal-syrinx.html", "passage_text": "A spinal syrinx is a potentially very serious anatomical abnormality that exists within the interior of the spinal cord itself. A syrinx is described as a fluid-filled hollow space within the cord, which sometimes expands and spreads in both length and width, slowly destroying the spinal cord. Not all syrinxes are problematic, although all present risk factors for future catastrophic health concerns if they do grow larger or longer. When a syrinx occurs, this cavity is abnormally filled with cerebral spinal fluid, expanding the space inside the spinal cord. A true syrinx is located at an interior location of the cord which is not lined with protective ependymal cells."}, {"url": "http://www.healthline.com/health/syringomyelia", "passage_text": "Syringomyelia is a rare disorder in which a cyst forms within your spinal cord. As the cyst, which is called a syrinx, expands and lengthens over time, it compresses and damages part of your spinal cord from its center outward. Damage to the spinal cord caused by a syrinx can cause symptoms like progressive pain, stiffness, and weakness in the back, shoulders, arms, and legs. Individuals with the disorder might lose the ability to feel cold and pain normally. Symptoms of the disorder are caused by the pressure the syrinx puts on the spinal cord and the damage that follows. The symptoms may include: 1  progressive weakness and pain in back, shoulders, arms, or legs. 2  inability to feel hot or cold normally."}, {"url": "https://en.wikipedia.org/wiki/Syringomyelia", "passage_text": "Syringomyelia /sɪˌrɪŋɡɵmaɪˈiːliə/ is a generic term referring to a disorder in which a cyst or cavity forms within the spinal cord. This cyst, called a syrinx, can expand and elongate over time, destroying the spinal cord. Syringomyelia causes a wide variety of neuropathic symptoms due to damage of the spinal cord. Patients may experience severe chronic pain, abnormal sensations and loss of sensation particularly in the hands. Some patients experience paralysis or paresis temporarily or permanently."}, {"url": "http://www.chiaricare.com/Related-Disorders/Syringomyelia.aspx", "passage_text": "Related Disorders-Syringomyelia. Syringomyelia (also called syrinx or hydromyelia) is a condition that occurs when spinal fluid collects inside the spinal cord. The spinal cord is connected to the lower part of the brain, called the brainstem. "}, {"url": "http://www.ninds.nih.gov/disorders/syringomyelia/detail_syringomyelia.htm", "passage_text": "This cyst, called a syrinx, expands and elongates over time, destroying a portion of the spinal cord from its center and expanding outward. As a syrinx widens it compresses and injures nerve fibers that carry information from the brain to the extremities. The second major form of syringomyelia occurs as a complication of trauma, meningitis, hemorrhage, a tumor, or arachnoiditis. Here, the syrinx or cyst develops in a segment of the spinal cord damaged by one of these conditions. The syrinx then starts to expand."}, {"url": "http://www.conquerchiari.org/education/syringo-faqs.html", "passage_text": "Syringomyelia (SM) is a neurological disorder where a fluid-filled cyst-or syrinx-develops inside the spinal cord. This cyst can grow over time, causing the spinal cord to expand and stretch nerve tissue. Eventually, the syrinx can cause permanent nerve damage and paralysis. "}, {"url": "http://www.columbianeurosurgery.org/conditions/syringomyelia/", "passage_text": "Syringomyelia (“Syrinx”). Also known as syringomyelia and hydromyelia are commonly known as syrinx. Essentially, a syrinx is a fluid collection in the spinal cord. There are many causes of this such as hydrocephalus, Chiari Malformation, trauma, tethered spinal cord, tumor and a very large number without any clear cause, the so-called idiopathic. "}, {"url": "http://www.mayoclinic.org/diseases-conditions/syringomyelia/basics/causes/CON-20034245", "passage_text": "Syringomyelia cyst (syrinx) in the spinal cord. It's unclear exactly how and why syringomyelia happens. When it develops, cerebrospinal fluid — the fluid that surrounds, cushions and protects your brain and spinal cord — collects within the spinal cord itself, forming a fluid-filled cyst (syrinx)."}, {"url": "http://www.ninds.nih.gov/disorders/syringomyelia/syringomyelia.htm", "passage_text": "Syringomyelia (sear-IN-go-my-EEL-ya) is a disorder in which a cyst forms within the spinal cord. This cyst, called a syrinx, expands and elongates over time, destroying the center of the spinal cord. Since the spinal cord connects the brain to nerves in the extremities, this damage results in pain, weakness, and stiffness in the back, shoulders, arms, or legs."}, {"url": "https://en.wikipedia.org/wiki/Syrinx_(medicine)", "passage_text": "A syrinx is a rare, fluid-filled neuroglial cavity within the spinal cord (syringomyelia), in the brain stem (syringobulbia), or in the nerves of the elbow, usually in a young age. In the case of syringomyelia, the syrinx can expand and elongate over time, destroying the spinal cord. Since the spinal cord connects the brain to nerves in the extremities, this damage may result in pain, weakness, and stiffness in the back, shoulders, arms, or legs."}]