[{"url": "http://learn.org/articles/What_is_an_Aesthetician.html", "passage_text": "An aesthetician or esthetician is a professional who specializes in skincare. Find out about the education, training and licensure required to work in this field, as well as the job duties. Schools offering Esthetics degrees can also be found in these popular choices. "}, {"url": "http://work.chron.com/medical-esthetician-vs-spa-esthetician-6670.html", "passage_text": "Estheticians -- sometimes spelled aestheticians -- are skin care specialists. Traditional medicine is oriented toward the treatment of illness or prevention of disease, while medical esthetics focus on helping to improve people’s appearance. Medical Esthetics. A medical esthetician works for a dermatologist or plastic surgeon. Medical estheticians usually have a background in a health-care profession, such as nursing. Medical estheticians might provide pre-or post-operative skin care treatments."}, {"url": "http://www.wisegeek.org/what-is-a-paramedical-esthetician.htm", "passage_text": "A paramedical esthetician is a skincare specialist who can provide advanced skincare techniques or work in a medical office side by side with a doctor, preparing patients for surgery that is designed to address skin issues. The regulations concerning these estheticians vary widely. "}, {"url": "http://study.com/articles/Whats_the_Difference_Between_an_Aesthetician_and_Esthetician.html", "passage_text": "There really is no difference between aestheticians and estheticians, just a variation in spelling. However, there are estheticians, such as skin care specialists, who work out of salons and spas, and medical aestheticians, who work in medical settings. Traditional estheticians, also known as skin care specialists, clean skin through skin exfoliation, massage, aromatherapy and facials. Esthetician and aestheticians are licensed skin specialists. They are trained to analyze and cleanse skin through a variety of techniques. Estheticians can be found in spas and salons, while aestheticians typically"}, {"url": "http://www.wisegeek.org/what-is-a-medical-esthetician.htm", "passage_text": "Medical estheticians work with dermatologists, surgeons, and other medical professionals to improve the appearance of patients. A medical professional may be involved in recommending a medical esthetician to a patient. Estheticians are typically trained in skin care and makeup application."}, {"url": "http://spas.about.com/od/facialtreatments/a/estheticians.htm", "passage_text": "An esthetician gives facials and other skin care treatments, and can be of great help keeping your skin looking its best. "}, {"url": "http://www.beautyschoolsdirectory.com/faq/esthetics.php", "passage_text": "Esthetics involves beautifying the skin in a variety of ways, including analyzing the skin closely, performing facials, doing microdermabrasion, waxing facial hair, doing extractions and exfoliation, giving facial massages, and recommending skin care regimes to clientele. Esthetics is the field of the beauty business that focuses almost exclusively on skin care. The field of esthetics (sometimes spelled aesthetics) has been growing quickly over the last 10 years, right along with the rest of the cosmetics industry."}, {"url": "http://www.evergreenbeauty.edu/uncategorized/whats-the-difference-between-a-cosmetologist-and-an-esthetician/", "passage_text": "Cosmetology is an area of study and a career that focuses on hair, skin, and nails. Cosmetologists can do both hair and nails, or focus their careers in one area. In comparison, esthetics focuses on skin care only. An esthetician is not qualified to perform pedicures, cut hair, or work with hair chemicals. With additional training and education a cosmetologist can also be an esthetician. However, estheticians are generally not cosmetologists"}]