[{"url": "http://www.shmoop.com/wordsworth/", "passage_text": "William Wordsworth was an English poet, a key figure of Romanticism, and the author of the most famous poem ever written about daffodils. Born in 1770, Wordsworth and his friend Samuel Taylor Coleridge invented a new style of poetry in which nature and the diction of the common man trumped formal, stylized language. "}, {"url": "https://en.wikipedia.org/wiki/William_Wordsworth", "passage_text": "William Wordsworth (7 April 1770 – 23 April 1850) was a major English Romantic poet who, with Samuel Taylor Coleridge, helped to launch the Romantic Age in English literature with their joint publication Lyrical Ballads (1798). After the death of his mother, in 1778, Wordsworth's father sent him to Hawkshead Grammar School in Lancashire (now in Cumbria) and sent Dorothy to live with relatives in Yorkshire. She and William did not meet again for another nine years."}, {"url": "https://en.wikipedia.org/wiki/William_Wordsworth", "passage_text": "Main article: Early life of William Wordsworth. The second of five children born to John Wordsworth and Ann Cookson, William Wordsworth was born on 7 April 1770 in Wordsworth House in Cockermouth, Cumberland, part of the scenic region in northwestern England known as the Lake District. After the death of his mother, in 1778, Wordsworth's father sent him to Hawkshead Grammar School in Lancashire (now in Cumbria) and sent Dorothy to live with relatives in Yorkshire. She and William did not meet again for another nine years."}, {"url": "https://en.wikipedia.org/wiki/William_Wordsworth", "passage_text": "Wordsworth's magnum opus is generally considered to be The Prelude, a semiautobiographical poem of his early years that he revised and expanded a number of times. It was posthumously titled and published, before which it was generally known as the poem to Coleridge. After the death of his mother, in 1778, Wordsworth's father sent him to Hawkshead Grammar School in Lancashire (now in Cumbria) and sent Dorothy to live with relatives in Yorkshire. She and William did not meet again for another nine years."}, {"url": "https://en.wikipedia.org/wiki/I_Wandered_Lonely_as_a_Cloud", "passage_text": ".  I Wandered Lonely as a Cloud  (also commonly known as  Daffodils ) is a lyric poem by William Wordsworth. It is Wordsworth's most famous work. The poem was inspired by an event on 15 April 1802, in which Wordsworth and his sister Dorothy came across a long belt of daffodils. I Wandered Lonely as a Cloud  (also commonly known as  Daffodils ) is a lyric poem by William Wordsworth. It is Wordsworth's most famous work."}, {"url": "http://www.enotes.com/homework-help/why-did-wordsworth-write-about-nature-most-his-117669", "passage_text": "This is probably because William Wordsworth was a Romantic poet (in fact, most say he was THE Romantic poet...the one who really got the movement going). Romanticism, in its simplest definition, was the movement where writers and artists tried to unite the natural world with the mind/emotions/soul of man. For instance, in what is arguably his most famous poem, Daffodils, Wordsworth probably wanted to actually put his reader in that field of daffodils, and he was successful because all of the descriptive detail and sensory images he used: Ten thousand saw I at a glance,/Tossing their heads in sprightly dance.."}, {"url": "http://www.notablebiographies.com/We-Z/Wordsworth-William.html", "passage_text": "His early years. William Wordsworth was born on April 7, 1770, in Cookermouth, Cumberland, England, the second child of an attorney. Unlike the other major English romantic poets, he enjoyed a happy childhood under the loving care of his mother and was very close to his sister Dorothy. "}, {"url": "https://en.wikipedia.org/wiki/I_Wandered_Lonely_as_a_Cloud", "passage_text": "At the time he wrote the poem, Wordsworth was living with his wife, Mary Hutchinson, and sister Dorothy at Town End, in Grasmere in England's Lake District. Mary contributed what Wordsworth later said were the two best lines in the poem, recalling the tranquil restoration of Tintern Abbey, I Wandered Lonely as a Cloud  (also commonly known as  Daffodils ) is a lyric poem by William Wordsworth. It is Wordsworth's most famous work."}]