[{"url": "http://www.lameziaairport.com/", "passage_text": "Located in Calabria, Italy, Lamezia Terme International Airport is roughly situated where the Italian “boot” has its toes. The airport’s IATA code SUF is derived from Sant’Eufemia – a district of Lamezia Terme. The town is just 3 km away and within just 1km there is an exit from the airport onto the motorway A3 for onward travel by hire car. There is no train station serving the airport, however, a bus or taxi can take you to the nearest train station in just a few moments, as the train station is only 2 km away from Lamezia Terme Airport."}, {"url": "http://www.lameziaairport.it/english/airport/", "passage_text": "The International Airport of Lamezia Terme, active since 1976, is the largest airport in Calabria, in terms of passengers (over 2 millions) and both national and international destinations. Lamezia airport is connected with scheduled flights to the main Italian airports: Rome, Milan Linate and Malpensa, Bologna, Bergamo, Pisa, Turin, Venice. There are also many international routes: Paris, Barcelona, Brussels, London, Zurich, Monaco, Luxembourg, Stockholm, Cologne, Toronto, Dusseldorf, just to name a few"}, {"url": "http://www.lameziaairport.com/", "passage_text": "SUF is the 3 letter AATA code for Lamezia terme Airport. The official name for the airport is S Eufemia. To help you in your arrival or departure you can enter the following GPS details – 38.90000, 16.23333 into your Smartphone or in-car GPS system to help you get directions from S Eufemia. There is no train station serving the airport, however, a bus or taxi can take you to the nearest train station in just a few moments, as the train station is only 2 km away from Lamezia T"}, {"url": "https://en.wikipedia.org/wiki/Lamezia_Terme_Airport", "passage_text": "History [edit]. In 1965 a consortium, CONSAER, was formed to build a new airport near the motorway, the railway and the port of Gioia Tauro; level ground near Lamezia Terme was chosen as the site. The airport opened in June 1976. Its IATA airport code SUF derives from the name Sant'Eufemia. Itavia began scheduled flights to Rome-Fiumicino, Milan-Linate, Catania and Palermo in December of that year. The airport was expanded and modernised in 1982."}, {"url": "http://www.airportsineurope.com/airports/lamezia-terme-airport/", "passage_text": "Lamezia Terme Airport is the main airport of the southern Italian region of Calabria. The airport is located southwest of Lamezia Terme, after Reggio Calabria and Catanzaro it’s the third-biggest city of Calabria. The city of Lamezia Terme consists of three districts, namely Nicastro, Sambiase and Sant’Eufemia Lamezia. The A3 motorway is a short drive from Lamezia Terme Airport, making the airport easily reachable from the north and south of Italy. For a taxi to Lamezia Terme (Nicastro) you pay about € 20; the travel time is 15 minutes. A taxi to the train station of Lamezia Terme in Sant’Eufemia Lamezia cost no more than € 10."}, {"url": "http://www.airport-arrivals-departures.com/europe/italy/lamezia-terme-airport.htm", "passage_text": "Lamezia Terme Airport. Lamezia Terme-Airport is one of the medium-sized airports in Italy. It is an international airport with more than 2.2m passengers per year (incoming, outgoing and transit). The runways are located 12 hours away from London and from here the shortest possible connection is a 1 Stop Over flight. To have a look at the Lamezia Terme-Airport Flight Information please check the Arrivals & Departures section. And if you plan to visit Italy please keep in mind that the official currency is Euro. Just use the currency converter in the field Money. Airport. 1  Lamezia Terme Airport. 2  Passengers per Year 2,184,102 (2013)."}, {"url": "http://www.gomapper.com/travel/where-is-airport/lamezia-terme-suf-located.html", "passage_text": "France. Lamezia Terme Airport (SUF) is an airport in the city/town of Lamezia Terme in the state/region of Calabria, Italy which is located in the continent/region of Europe. Cities, towns and places near Lamezia Terme Airport include Gizzeria, Lamezia Terme and Curinga. Lamezia Terme Airport. Lamezia Terme Airport (SUF) is an airport in the city/town of Lamezia Terme in the state/region of Calabria, Italy which is located in the continent/region of Europe."}, {"url": "http://www.maplandia.com/italy/airports/lamezia-terme-airport/", "passage_text": "Map of Lamezia Terme Airport. A detailed map of Lamezia Terme Airport (SUF) is presented below. You may use map navigation tools to adjust map scope and zoom level of Lamezia Terme Airport map. Click the map type buttons to select map type: a street map, a satellite map and a hybrid map is available. Please use the form below the map to search and book hotels near Lamezia Terme Airport, Italy. Hotels nearest to Lamezia Terme Airport, sorted by the distance from the airport. 1  Aerhotel Phelipe *** (at Via Delle Nazioni, 23 in Sant'Eufemia Lamezia, distanced approximately 1.7 km)."}]