[{"url": "http://www.usadiversitylottery.com/news/us-citizenship/us-citizenship-army-faq.php", "passage_text": "Titled “Military Accessions Vital to the National Interest” (MAVNI), the new pilot program allows certain non-citizens who are legally present in the United States to join the Army and apply immediately for US citizenship without first obtaining lawful permanent residence."}, {"url": "http://usmilitary.about.com/od/joiningthemilitary/a/noncitizenjoin.htm", "passage_text": "Non-Citizen Enlistments. First of all, in order to join the U.S. military as a non-citizen, you must be currently living permanently (and legally) in the United States. Tourist visas and student visas aren't good enough."}, {"url": "http://usmilitary.about.com/od/joiningthemilitary/f/noncitizen.htm", "passage_text": "Answer: Yes. A non-citizen can enlist in the military. However, federal law prohibits non-citizens from becoming commission or warrant officers. In order for a non-citizen to enlist in the military, he/she must first be a legal immigrant (with a green card), permamently residing in the United States. It's important to note that the military cannot and will not assist in the immigration process. One must immigrate first, using normal immigration quotas and procedures, and -- once they've established an address in the United States -- they can find a recruiter's office and apply for enlistment."}, {"url": "http://usmilitary.about.com/od/joiningthemilitary/a/noncitizenjoin.htm", "passage_text": "The U.S. Military will not assist in the immigration process. In order to join, you must immigrate first, using the normal immigration procedures, and then - - after immigration is complete - - you can apply to enlist in any branch of the U.S. Military by visiting the nearest Military recruiting office."}, {"url": "http://usmilitary.about.com/od/joiningthemilitary/a/noncitizenjoin.htm", "passage_text": "I get lots of email from non-U.S. citizens asking about joining the U.S. Military. It may surprise some of you to learn that you do not have to be a U.S. citizen in order to join the U.S. Military, but there are certain restrictions."}, {"url": "http://www.militaryhub.com/article?id=298", "passage_text": "In fact, you do not have to be a U.S. citizen to join the U.S. military. However, you must immigrate first, under legal immigration procedures, before applying at any military recruiting office. And there are certain job and rank limitations for non-citizens in the military."}]