[{"url": "http://www.nytimes.com/health/guides/disease/spinal-tumor/overview.html", "passage_text": "Tumors that start in spinal tissue are called primary spinal tumors. Tumors that spread to the spine from some other place (metastasis) are called secondary spinal tumors. Tumors may spread to the spine from the breast, prostate, lung, and other areas. The cause of primary spinal tumors is unknown."}, {"url": "http://www.mayoclinic.org/diseases-conditions/spinal-cord-tumor/home/ovc-20117315", "passage_text": "Spinal cord tumor. Intramedullary tumors are benign or malignant growths that develop in the supporting (glia) cells within the spinal cord. A spinal tumor is a growth that develops within your spinal canal or within the bones of your spine. It may be cancerous or noncancerous. Tumors that affect the bones of the spine (vertebrae) are known as vertebral tumors. Tumors that begin within the spinal cord itself are called spinal cord tumors."}, {"url": "http://www.aans.org/Patient%20Information/Conditions%20and%20Treatments/Spinal%20Tumors.aspx", "passage_text": "A spinal tumor is an abnormal mass of tissue within or surrounding the spinal cord and/or spinal column. These cells grow and multiply uncontrollably, seemingly unchecked by the mechanisms that control normal cells. Spinal tumors can be benign (non-cancerous) or malignant (cancerous)."}, {"url": "http://www.cancercenter.com/spinal-cancer/learning/", "passage_text": "Primary spinal cancer develops from cells within the spinal cord or from its surrounding structures (the bones, tissues, fluid or nerves of the spine). Part of the central nervous system (CNS), the spinal cord is a column of nerve tissue which extends from the base of the brain down the back."}, {"url": "https://www.nlm.nih.gov/medlineplus/ency/article/001403.htm", "passage_text": "A small number of spinal tumors occur in the nerves of the spinal cord itself. Most often these are ependymomas and other gliomas. Tumors that start in spinal tissue are called primary spinal tumors. Tumors that spread to the spine from some other place (metastasize) are called secondary spinal tumors. Tumors may spread to the spine from the breast, prostate, lung, and other areas. The cause of primary spinal tumors is unknown. Some primary spinal tumors occur with certain inherited gene mutations."}]