[{"url": "http://www.niams.nih.gov/health_info/rosacea/", "passage_text": "Sometimes the face is swollen slightly. A condition called vascular rosacea causes persistent flushing and redness. Blood vessels under the skin of the face may dilate (enlarge), showing through the skin as small red lines. This is called telangiectasia (tel-AN-je-ek-tay-ze-ah). Rosacea is a chronic (long-term) disease that affects the skin and sometimes the eyes. The disorder is characterized by redness, pimples, and, in advanced stages, thickened skin. Rosacea usually affects the face."}, {"url": "http://www.medicalnewstoday.com/articles/160281.php", "passage_text": "1 Facial skin hyper-reactivity. 2  Sensitive blood vessels dilate very easily to topical triggers (touch), and some other physical stimuli, such as sunlight. 3  Many mistakenly refer to this as sensitive skin, but with rosacea it is sensitive blood vessels and not sensitive skin cells which cause this. 1 Abnormalities in facial blood vessels. 2  Skin specialists (dermatologists) suggest that a major factor is probably abnormalities in the blood vessels of the face, which cause the flushing, persistent redness and visible"}, {"url": "http://www.medicalnewstoday.com/articles/160281.php", "passage_text": "Rosacea is a chronic, inflammatory skin condition which principally affects the face. Rosacea causes facial redness and produces small, red, pus-filled pustules (bumps). Rosacea worsens with time if left untreated. It is often mistaken for acne or eczema, or some other skin allergy. 1 Abnormalities in facial blood vessels. 2  Skin specialists (dermatologists) suggest that a major factor is probably abnormalities in the blood vessels of the face, which cause the flushing, persistent redness and visible"}, {"url": "https://en.wikipedia.org/wiki/Rosacea", "passage_text": "Rosacea /roʊˈzeɪʃiə/ is a chronic skin condition characterized by facial redness, small and superficial dilated blood vessels on facial skin, papules, pustules, and swelling. Rosacea affects all ages and has four subtypes, three affecting the skin and the fourth affecting the eyes (ocular type). "}, {"url": "http://www.webmd.com/skin-problems-and-treatments/tc/rosacea-topic-overview", "passage_text": "Rosacea is not caused by alcohol abuse, as people thought in the past. But in people who have rosacea, drinking alcohol may cause symptoms to get worse (flare). Rosacea often flares when something causes the blood vessels in the face to expand, which causes redness. Things that cause a flare-up are called triggers. Rosacea-Topic Overview. Rosacea (say roh-ZAY-shuh) is a very common skin disease that affects people over the age of 30. It causes redness on your nose, cheeks, chin, and forehead. Some people get little bumps and pimples on the red parts of their face"}, {"url": "http://www.medicinenet.com/rosacea/article.htm", "passage_text": "Rosacea is not considered contagious or infectious. What does rosacea look like? The redness in rosacea, often aggravated by flushing, may cause small blood vessels in the face to enlarge (dilate) permanently and become more visible through the skin, appearing like tiny red lines (called telangiectasias)."}, {"url": "http://www.medicalnewstoday.com/articles/160281.php", "passage_text": "1 Sensitive blood vessels dilate very easily to topical triggers (touch), and some other physical stimuli, such as sunlight. 2  Many mistakenly refer to this as sensitive skin, but with rosacea it is sensitive blood vessels and not sensitive skin cells which cause this. 1 Abnormalities in facial blood vessels. 2  Skin specialists (dermatologists) suggest that a major factor is probably abnormalities in the blood vessels of the face, which cause the flushing, persistent redness and visible"}, {"url": "http://www.webmd.com/skin-problems-and-treatments/tc/rosacea-topic-overview", "passage_text": "In rare cases, rosacea that is not treated may cause permanent effects, such as thickening of the skin on your face or loss of vision. It may cause knobby bumps on the nose, called rhinophyma (say ry-no-FY-muh). Over time, it can give the nose a swollen, waxy look. Rosacea-Topic Overview. Rosacea (say roh-ZAY-shuh) is a very common skin disease that affects people over the age of 30. It causes redness on your nose, cheeks, chin, and forehead. Some people get little bumps and pimples on the red parts of their faces"}, {"url": "http://www.ncbi.nlm.nih.gov/pubmedhealth/PMH0001882/", "passage_text": "Treatments for rosacea. Rosacea is a common skin condition causing flushing, redness, red pimples and pustules on the face, and should not be confused with acne. Dilated blood vessels may appear near the surface of the skin (telangiectasia). It can also cause inflammation of the eyes or eyelids, or both (ocular rosacea). "}]