[{"url": "http://www.city-data.com/forum/relationships/804049-what-do-women-think-loners-27.html", "passage_text": "the kind of man you're saying women want sounds like the kind of man who has a seriously inflated ego. thats my number one turn off. This is why I'm attracted to loner types..they're much more humble in what they have or don't have. "}, {"url": "http://tvtropes.org/pmwiki/pmwiki.php/Main/LonersAreFreaks", "passage_text": "1 A case of Loners become freaks in Life, where Charlie is clearly a well adjusted guy with a job and a wife and friends until he spends an ungodly amount of time (unspecified, but measured in years) in solitary confinement. 2  When they let him out again, he's kind of crazy. 1 It works on everyone but Sgt. Doakes. 2  A case of Loners become freaks in Life, where Charlie is clearly a well adjusted guy with a job and a wife and friends until he spends an ungodly amount of time (unspecified, but measured in years) in solitary confinement. 3"}, {"url": "http://tvtropes.org/pmwiki/pmwiki.php/Main/LonersAreFreaks", "passage_text": "Friends are great. Which is why having friends is often what separates the hero from the villain. An unfortunate and inevitable side-effect of The Power of Friendship is that if you don't have friends, there's something wrong with you, since being a loner is not natural. 1 It works on everyone but Sgt. Doakes. 2  A case of Loners become freaks in Life, where Charlie is clearly a well adjusted guy with a job and a wife and friends until he spends an ungodly amount of time (unspecified, but measured in years) in solitary confinement. 3  When they let him out again, he's kind of crazy."}, {"url": "http://www.westernjournalism.com/knowing-bergdahl-part-one-bergdahl-weird-creepy-loner-ready-blow/", "passage_text": "“When I first met Bergdahl, he gave me the creeps. He was a very weird, creepy loner who seemed ready to blow. He was really wound very tight.” –Jimmy. “Everybody knew that Bergdahl was losing his mind over there. And he wasn’t just going any kind of regular crazy but ‘Major Hassan/Fort Hood’ crazy. "}, {"url": "http://www.gamesradar.com/50-coolest-movie-loners/", "passage_text": "Does He Find A Friend: Not as such, but he does find a kind of peace by the film’s close…. Anton Chigurh (No Country For Old Men). The Cool Loner: A violent force of nature, Chigurh is unquestionably the baddest man on this list, and probably the most terrifying. The Cool Loner: He might be hard to like, but it’s hard not to marvel at the sheer bloody-mindedness of the power-hungry Plainview. Does He Find A Friend: Nope, and nor does he want one. “I hate most people,” he says, matter-of-factly."}, {"url": "http://www.gamesradar.com/50-coolest-movie-loners/", "passage_text": "The Cool Loner: The creepy old dude Kevin mistakes for a serial killer, who actually ends up saving his ass. Appearances can be deceiving…. Does He Find A Friend: After rescuing Kevin, he’s inspired to reunite with his estranged son and family. The Cool Loner: He might be hard to like, but it’s hard not to marvel at the sheer bloody-mindedness of the power-hungry Plainview. Does He Find A Friend: Nope, and nor does he want one. “I hate most people,” he says, matter-of-factly."}, {"url": "http://love.allwomenstalk.com/tips-on-how-to-spot-a-creep/", "passage_text": "1. He’s a Loner. While some potential creepsters travel in packs, the most serious creeps are loners. Perhaps it’s because they creep out everyone, guys included, so they have no friends, or maybe they prefer to do their creeping work alone, so they don’t invite friends along. If you’re having a hard #time figuring out who’s sincerely nice and who’s just waiting for a restraining order, here are 7 tips on how to spot a creep, in no particular order."}, {"url": "http://tvtropes.org/pmwiki/pmwiki.php/Main/LonersAreFreaks", "passage_text": "1 The X-Files: Mulder is a loner, due to his crazy ideas about aliens and government conspiracy. 2  He's a joke to the FBI and is mocked by his peers, nicknamed Spooky (however, that nickname originated as a sign of respect). 3  He doesn't seem to mind too much, though. 1 It works on everyone but Sgt. Doakes. 2  A case of Loners become freaks in Life, where Charlie is clearly a well adjusted guy with a job and a wife and friends until he spends an ungodly amount of time (unspecified, but measured in years) in solitary confinement. 3  When they let him out again, he's kind of crazy."}, {"url": "http://www.dailymail.co.uk/tvshowbiz/article-3051667/Joel-Edgerton-stars-creepy-loner-dark-feature-film-directorial-debut-Gift-starring-Jason-Bateman.html", "passage_text": "Joel Edgerton stars as a creepy loner in his feature film directorial debut The Gift also starring Jason Bateman. By Marni Dixit for Daily Mail Australia. Published: 00:41 EST, 23 April 2015 | Updated: 04:45 EST, 23 April 2015. Also starring Arrested Development's Jason Bateman and Vicky Cristina Barcelona's Rebecca Hall, the film centres on newlywed couple Simon (Bateman) and Robyn (Hall) whose lives are turned upside down when they run into an old friend of Simon's called Gordo (Edgerton)."}, {"url": "http://www.dailymail.co.uk/tvshowbiz/article-3051667/Joel-Edgerton-stars-creepy-loner-dark-feature-film-directorial-debut-Gift-starring-Jason-Bateman.html", "passage_text": "Creepy! Joel Edgerton stars in his directorial debut The Gift as Gordo, a creepy loner with a dark side. Old friends: The film also stars Joel Edgerton as Simon, a friend of Gordo's from high school who reunite 25 years later. Also starring Arrested Development's Jason Bateman and Vicky Cristina Barcelona's Rebecca Hall, the film centres on newlywed couple Simon (Bateman) and Robyn (Hall) whose lives are turned upside down when they run into an old friend of Simon's called Gordo (Edgerton)."}]