[{"url": "http://www.answers.com/Q/Why_are_asteroids_and_meteoroids_important_to_planetary_scientists", "passage_text": "planets don't have asteroids comet or meteoroids. actually Pluto is not considered a planet because it is located in the Kuiper Belt and it does not have an orbit like the r … est of the planets, it goes through a planets orbit actually as part of its orbit. I think its a comet myself! Meteoroids are the ones still in space. Asteroids a … re large debris in soace that are mainly found in an orbit, not moving around. The most known amount of asteroids near us is the Asteroid belt separating the terrestrial planets and the gas planets. + 3 others found this useful."}, {"url": "http://physics.unm.edu/Courses/Zwartz/Astro101Fa13/homework/HWK-5-Solar-System-ANSWERS.pdf", "passage_text": "Answer: First, the terrestrial planets are all in the inner 1.5 AU of the solar system, while the jovian planets are scattered from 5 to 30 AU. Second, the jovian planets are substantially larger in both mass and radius. As we see them today, the asteroids would not make up much of a planet! A single body would have the following size. Use the formula for density: 317 (4/3)5103000  R = 20,000 m or 20 km, so the diameter would be 40 km."}, {"url": "http://science.nationalgeographic.com/science/space/solar-system/asteroids-comets-article/", "passage_text": "Asteroid Belt. Asteroids are essentially chunks of rock that measure in size from a few feet to several miles in diameter. (Small asteroids are called meteoroids.) The largest asteroid, Ceres, is about 590 miles (950 kilometers) wide. Like most asteroids, it lies in the asteroid belt between Mars and Jupiter. Many astronomers believe the belt is primordial material that never glommed into a planet because of Jupiter's gravitational pull. "}, {"url": "http://neo.jpl.nasa.gov/faq/", "passage_text": "Almost all asteroids are part of the Main Asteroid Belt, with orbits in the vast region of space between Mars and Jupiter. Some asteroids pass very close to Earth's orbit around the Sun. Scientists have found evidence that asteroids have hit our planet in the past. "}, {"url": "http://www.answers.com/Q/Why_are_asteroids_important", "passage_text": "1.) They tell us about the origins of our solar system. Asteroids are the leftover debris from the creation of our solar system. 2.) Sometimes a collision in the asteroid belt can send a large rock hurling towards earth. It if collides, all life on earth could be effected depending on how big the impactor is. Comets, asteroids and meteorites are all leftover pieces of rock from the formation of our solar system. Astronomers get clues of how the early universe was like, by studying … the sizes, locations, chemical composition of the 'space rocks'."}, {"url": "http://www.castlerock.wednet.edu/HS/stello/Astronomy/TEXT/CHAISSON/BG304/HTML/BG304EOC.HTM", "passage_text": "Larger meteoroids are pieces of material chipped off asteroids following collisions in the asteroid belt. Most meteorites are between 4.4 and 4.6 billion years old. The organization of the solar system points to formation as a one-time event that occurred 4.6 billion years ago. "}, {"url": "http://physics.unm.edu/Courses/Zwartz/Astro101Fa13/homework/HWK-5-Solar-System-ANSWERS.pdf", "passage_text": "Answer: Asteroids and meteoroids are important because they often contain material that has undergone little change since the solar system formed. In many cases, they contain the original material that formed the solar system. The surface material of the Earth and Moon, by contrast, has greatly changed over time. As we see them today, the asteroids would not make up much of a planet! A single body would have the following size. Use the formula for density: 317 (4/3)5103000  R = 20,000 m or 20 km, so the diameter would be 40 km."}, {"url": "http://physics.unm.edu/Courses/Zwartz/Astro101Fa13/homework/HWK-5-Solar-System-ANSWERS.pdf", "passage_text": "(a) Compare the total mass of these asteroids to the mass of Earth. (b) Assuming a spherical shape and a density of rho, estimate the diameter of an asteroid ANSWER: The total mass of all asteroids would be 20,000 10 17 21kg = 2 10 kg. As we see them today, the asteroids would not make up much of a planet! A single body would have the following size. Use the formula for density: 317 (4/3)5103000  R = 20,000 m or 20 km, so the diameter would be 40 km."}, {"url": "http://www.answers.com/Q/Why_are_asteroids_and_meteoroids_important_to_planetary_scientists", "passage_text": "Asteroids are irregular shaped rocks that orbit in a belt between Mars and Jupiter. Our solar system is the only one with these rocks that we gave the name Asteroid to. They are thought to be the remains of a planet that broke apart. Meteoroids are the ones still in space. Asteroids a … re large debris in soace that are mainly found in an orbit, not moving around. The most known amount of asteroids near us is the Asteroid belt separating the terrestrial planets and the gas planets. + 3 others found this useful."}, {"url": "http://lifeng.lamost.org/courses/astrotoday/CHAISSON/AT306/HTML/AT306EOC.HTM", "passage_text": "5. Suppose the average mass of each of the 7000 asteroids in the solar system is about 10 17 kg. Compare the total mass of all asteroids with the mass of Earth. Assuming a roughly spherical shape and a density of 3000 kg/m 3, estimate the diameter of an asteroid having this average mass. (Hint). 6. "}]