[{"url": "http://home.costhelper.com/bathroom-addition.html", "passage_text": "Typical costs: 1  Converting existing floor space inside a garage, basement or attic into a simple bathroom starts around $3,000-$6,000. 2  However, costs can be $7,000-$25,000 or more for a more luxurious bathroom, or if the new bathroom is far from existing water and sewer lines."}, {"url": "http://home.costhelper.com/bathroom-addition.html", "passage_text": "A bathroom addition can range from a small half-bath (sink, toilet and mirror) to a spa-like master bath. Adding a bathroom is usually more expensive per square foot than other rooms because it requires specific types of plumbing, heating, electricity and ventilation."}, {"url": "http://www.zillow.com/advice-thread/Can-anyone-give-me-a-cost-estimate-to-add-a-bathroom-and-250-300-sq-ft-addition/475386/", "passage_text": "Cost on adding a bathroom depends if you have an existing room or if you will be adding a new roof to cover the new room. The latter is the most expensive as you will have framing costs (and permits and blueprints,etc) and could cost $10-$15k."}, {"url": "http://www.homeadvisor.com/cost/bathrooms/remodel-a-bathroom/", "passage_text": "And the average cost of a bathroom remodel in New York City is roughly $9,500 to $13,000. Once you have ideas for your renovation planned out, the next step is to find bath remodel accessories in your price range."}, {"url": "http://www.improvenet.com/r/costs-and-prices/bathroom-remodel-cost-estimator", "passage_text": "On average, the cost of a new toilet as well as installation comes in between $360 and $492. Bathroom remodels can include everything from painting the walls to installing a brand new tub. On average, most homeowners will pay between $8,265 and $11,426 to remodel their existing bathrooms."}, {"url": "http://www.fixr.com/costs/bathroom-remodeling", "passage_text": "Bathroom remodeling can be extremely simple or quite complex, but for this discussion we will consider the costs and requirements for a bathroom remodel of a previously 40 square foot bathroom into a 120 square foot bathroom."}, {"url": "http://home.costhelper.com/bathroom-addition.html", "passage_text": "1 Adding new floor space to your home for a basic 6x8-foot bathroom addition starts around $25,000-$50,000 and goes up depending on complexity, quality of fixtures, number of amenities and local labor rates."}, {"url": "http://www.homeadvisor.com/cost/bathrooms/remodel-a-bathroom/", "passage_text": "Homeowners have many options when it comes to bathroom remodels and the total cost depends on style and budget. The average bathroom remodel costs $9,254, but you can spend less-between $3,500 and $7,000 - to fix up the essentials in a small-to medium-sized bathroom."}, {"url": "http://home.costhelper.com/bathroom-remodel.html", "passage_text": "1 According to an annual construction cost survey by Remodeling Magazine, a mid-range remodel of a 5x7-foot bathroom averages $14,109-$18,864; for an upscale expansion of a 5x7 bathroom to 9x9-feet within the existing house footprint, costs run $46,865-$59,456."}]