[{"url": "http://www.food.com/recipe/overnight-turkey-53243", "passage_text": "1 Thus, the cooking time for this example would be 2-1/2 hours at THEIR recommended temperature of 325 degrees. 2  Cooking time for a larger turkey would be calculated in the same manner. 3  When cooking time is up, DO NOT open oven door. 4  No Peeking! 1 Remove all internal organs from both ends of the turkey. 2  I usually cook these in a pot to make broth (strained, of course) for my dressing, discarding the organs after cooking. 3  If you make giblet gravy, chop and include these cooked organs in your gravy. 4  Rinse and drain turkey."}, {"url": "http://deeprootsathome.com/succulent-stress-free-turkey-for-dummies/", "passage_text": "Roast at 400F for 30-40 minutes. (If you have a tiny turkey, leave it at 400F only about 25 minutes.). 3.) Immediately, turn the oven down to 200F and cook the turkey all day (and night if you put it in in the evening) at that temperature. It will cook slowly and stay tender and delicious for hours at 200F. Enjoy! Roasting a turkey at a low temperature overnight will lead to a moist, tender and juicy bird that will impress even the pickiest of family members. To roast your turkey overnight, follow a proven recipe featured in the popular 1940s cookbook “ Let’s Cook it Right ” by Adelle Davis”."}, {"url": "http://www.createdby-diane.com/2014/11/how-to-roast-a-turkey-overnight.html", "passage_text": "I always make at least a 20 pound turkey, I figure why not have extra turkey. I’m already making it, why not make more. It’s really no more work to cook a 20 lb turkey than it is a 10 or 15 lb turkey. I love having the turkey to put in all sorts of meals. You also see people putting a big turkey in the oven frozen or somehow it thaws out in a couple hours, again only on TV does that seem to work. The truth is it takes days to thaw a 20 lb. turkey. 2-3 days in cold water (I thaw my turkey in a cooler) this is my preferred method."}, {"url": "http://www.answers.com/Q/Can_you_cook_your_turkey_overnight_at_200_degrees", "passage_text": "At 350 degrees you usually cook the turkey for 20 minutes per pound, but at the low temperature of 250 you'll need to cook it for 6 to 8 hours. Check with a meat thermometer a … nd make sure if reaches 165 or higher in the deepest part of the turkey. According to the USDA there are many methods of cooking a turkey but in the oven it is not recommended to cook any turkey at a temp below 325degrees F. It seems strange that my mother used to put the bird in the oven the night before and let it cook all night long. Nobody died. This is progress."}, {"url": "http://www.splendidtable.org/story/this-year-roast-the-turkey-while-you-sleep", "passage_text": "Reduce the oven temperature to 170°F and roast your turkey for at least 1 hour per pound. Because the oven temperature is no hotter than you want the bird to be at perfect doneness, it cannot overcook. Then settle down for a good night's sleep while the turkey's roasting. Here's the timeline for a 15- to 25-pounder: Seasoned turkey after 24 hours in the refrigerator."}, {"url": "http://www.foodnetwork.com/recipes/food-network-kitchens/roasted-turkey-recipe.html", "passage_text": "Tent the bird with foil. Roast the turkey for 2 hours. Remove the foil and baste with the remaining butter. Increase oven temperature to 425 degrees F and continue to roast until an instant read thermometer registers 165 degrees F in the thigh of the bird, about 45 minutes more. "}, {"url": "http://www.food.com/recipe/overnight-turkey-53243", "passage_text": "1 If it says cook 4 hours at 325 degrees, DIVIDE THE RECOMMENDED COOKING TIME IN HALF (4/2=2 hours) and ADD 30 MINUTES. 2  Thus, the cooking time for this example would be 2-1/2 hours at THEIR recommended temperature of 325 degrees. 3  Cooking time for a larger turkey would be calculated in the same manner. 1 Remove all internal organs from both ends of the turkey. 2  I usually cook these in a pot to make broth (strained, of course) for my dressing, discarding the organs after cooking. 3  If you make giblet gravy, chop and include these cooked organs in your gravy. 4  Rinse and drain turkey."}, {"url": "http://www.fsis.usda.gov/wps/portal/fsis/topics/food-safety-education/get-answers/food-safety-fact-sheets/poultry-preparation/lets-talk-turkey/ct_index", "passage_text": "1 If using an oven-proof food thermometer, place it in the turkey at the start of the cooking cycle. 2  It will allow you to check the internal temperature of the turkey while it is cooking. 3  For turkey breasts, place thermometer in the thickest part. 4  For whole turkeys, place in the thickest part of the inner thigh. "}, {"url": "http://zabars.typepad.com/recipes/2010/11/andreas-overnight-turkey-recipe.html", "passage_text": "5. Place the turkey in the oven (at 400°) and roast for 30 minutes. 6. After 30 minutes baste the turkey – and lower oven to 250°. COVER THE PAN COMPLETELY BY MAKING A TENT OUT OF HEAVY DUTY ALUMINUM FOIL. You must make sure that all the edges of the pan are covered so that the moisture will remain in the pan. This is the only tricky part to cooking a turkey like this. One year my father, Nathan, recommended that I stay up all night and cook. I knew he was joking – but why not cook and sleep at the same time! So be brave and try my overnight turkey – you will awake to a house that smells divine, an oven that is perfectly warm and ready to be filled with stuffing, yams and pies."}]