[{"url": "http://www.investopedia.com/terms/c/costofcarry.asp", "passage_text": "These costs can include financial costs, such as the interest costs on bonds, interest expenses on margin accounts and interest on loans used to purchase a security, and economic costs, such as the opportunity costs associated with taking the initial position. Next Up. For example, the longer a position is made on margin, the more interest payments will need to be made on the account. When making an informed investment decision consideration must be given to all of the potential costs associated with taking that position."}, {"url": "http://www.investopedia.com/terms/c/costofcarry.asp", "passage_text": "BREAKING DOWN 'Cost Of Carry'. Cost to carry may not be an extremely high financial cost if it is effectively managed. For example, the longer a position is made on margin, the more interest payments will need to be made on the account. When making an informed investment decision consideration must be given to all of the potential costs associated with taking that position."}, {"url": "https://en.wikipedia.org/wiki/Carrying_cost", "passage_text": "In marketing, carrying cost refers to the total cost of holding inventory. This includes warehousing costs such as rent, utilities and salaries, financial costs such as opportunity cost, and inventory costs related to perishability, pilferage, shrinkage and insurance."}, {"url": "http://financial-dictionary.thefreedictionary.com/Cost+of+carry", "passage_text": "Cost of Carry. The cost of storing a commodity over a period of time. It includes incidental costs, insurance coverage, and the physical cost of storage. It does not include depreciation, if any. The carrying charge is incorporated in the price of a commodity on the futures market. See also: Carrying costs"}, {"url": "http://www.investopedia.com/terms/c/carrying-costs.asp", "passage_text": "DEFINITION of 'Carrying Costs'. The price of holding, or carrying, inventory. Carrying costs include storage costs, maintenance (particularly in regard to perishable items), insurance and other less tangible expenses, such as opportunity costs and losses due to theft. Next Up. BREAKING DOWN 'Carrying Costs'. One of the great advantages enjoyed by many cyber stores is the lack of carrying costs. Instead, many online retailers stock items as needed or have them all shipped from a central location, as opposed to having inventory at multiple brick-and-mortar locales."}, {"url": "http://www.brameshtechanalysis.com/2013/01/understanding-cost-of-carry-for-nifty-and-stock-futures/", "passage_text": "When futures trade at a discount to the underlying,the resultant cost of carry is negative. This usually happens for two reasons: when the stock is expected to pay a dividend,or when traders are aggressively executing a “reverse arbitrage” strategy,which involves buying spot and selling futures. Conversely, when the CoC for a stock future rises, it means that traders are willing to incur higher costs for holding the position and,thus,expect a rise in the underlying. CoC is expressed as an annualized figure in percentage. Average CoC of all futures contract is around 0.7-0.9%."}, {"url": "http://www.brameshtechanalysis.com/2013/01/understanding-cost-of-carry-for-nifty-and-stock-futures/", "passage_text": "In derivates market, the cost of carry (CoC) of a futures contract is the cost incurred on holding positions in the underlying security until the expiry of the futures. The cost includes the risk free interest rate and excludes any dividend payouts from the underlying. Conversely, when the CoC for a stock future rises, it means that traders are willing to incur higher costs for holding the position and,thus,expect a rise in the underlying. CoC is expressed as an annualized figure in percentage. Average CoC of all futures contract is around 0.7-0.9%."}, {"url": "http://www.traderji.com/futures/14663-understanding-cost-carry.html", "passage_text": "The cost of carry is the cost of carrying or holding a position. If long, the cost of carry is the cost of interest paid on a margin account. Conversely, if short, the cost of carry is the cost of paying dividends, or opportunity cost the cost of purchasing a particular security rather than an alternative. Re: Understanding Cost Of Carry. 1. Yes, more people buying futures as opposed to cash will push up the CoC. This is because the cost of carry is the annualised premium of the futures to cash. Higher the absolute difference between futures and cash, higher the CoC."}, {"url": "https://in.answers.yahoo.com/question/index?qid=20090731122206AAwOoGB", "passage_text": "Best Answer: The cost to carry, or carrying cost, are costs (or loss of income) associated with a holding a position. (I would have made $200 in interest if I had not bought the contracts.) For contracts that require physical delivery, as opposed to cash-settled contracts, the cost of maintaining and delivering the product are also carrying costs."}, {"url": "http://www.traderji.com/futures/14663-understanding-cost-carry.html", "passage_text": "Cost of carry is the sum of all costs incurred if a similar position is taken in cash market and carried to maturity of the futures contract less any revenue which may result in this period. The costs typically include interest in case of financial futures (also insurance and storage costs in case of commodity futures). Re: Understanding Cost Of Carry. 1. Yes, more people buying futures as opposed to cash will push up the CoC. This is because the cost of carry is the annualised premium of the futures to cash. Higher the absolute difference between futures and cash, higher the CoC."}]