[{"url": "https://www.nlm.nih.gov/medlineplus/ency/imagepages/19841.htm", "passage_text": "Overview. The 3 types of muscle tissue are cardiac, smooth, and skeletal. Cardiac muscle cells are located in the walls of the heart, appear striated, and are under involuntary control."}, {"url": "http://www.cardio-research.com/cardiac-tissue", "passage_text": "At the cellular level, the main components of the postnatal heart are cardiomyocytes, cardiac fibroblasts, endothelial cells and vascular smooth muscle cells (Banerjee I, fusel JW, 2007). In a normal adult heart, cardiomyocytes occupy most of the tissue volume, but they are only 30% of the total number of cells."}, {"url": "http://training.seer.cancer.gov/anatomy/cells_tissues_membranes/tissues/muscle.html", "passage_text": "Muscle tissue can be categorized into skeletal muscle tissue, smooth muscle tissue, and cardiac muscle tissue. Skeletal muscle fibers are cylindrical, multinucleated, striated, and under voluntary control. Smooth muscle cells are spindle shaped, have a single, centrally located nucleus, and lack striations."}, {"url": "http://www.innerbody.com/image_musc01/musc71.html", "passage_text": "Cardiac muscle tissue is made up of many interlocking cardiac muscle cells, or fibers, that give the tissue its properties. Each cardiac muscle fiber contains a single nucleus and is striated, or striped, because it appears to have light and dark bands when seen through a microscope."}, {"url": "http://medcell.med.yale.edu/histology/muscle_lab/cardiac_muscle_cells.php", "passage_text": "Cardiac Muscle Cells. This is a high power view of cardiac muscle cells. Like smooth muscle, each cardiac muscle cell has a single (sometimes two) centrally located nucleus. Like skeletal muscle, cardiac muscle cells are striated due to a similar arrangement of contractile proteins."}, {"url": "http://www.wisegeekhealth.com/what-is-cardiac-muscle-tissue.htm", "passage_text": "Cardiac muscle tissue is a highly specialized type of muscle found only in the walls of the heart. This muscle type has a number of unique properties that allow it to regularly contract in order to force the heart to beat."}, {"url": "https://en.wikipedia.org/wiki/Cardiac_muscle", "passage_text": "An isolated cardiac muscle cell, beating. Cardiac muscle (heart muscle) is involuntary striated muscle that is found in the walls and histological foundation of the heart, specifically the myocardium."}, {"url": "http://www.innerbody.com/image_musc01/musc71.html", "passage_text": "Cardiac muscle tissue is an extremely specialized form of muscle tissue that has evolved to pump blood throughout the body. In fact, cardiac muscle is only found in the heart and makes up the bulk of the heart’s mass."}]