[{"url": "http://www.totalcrb.co.uk/faq/", "passage_text": "Yes. If you have received the results of your DBS disclosure and there is an error on it or you wish to dispute any of the information revealed, please contact the DBS immediately on 0870 90 90 778. Disputes should be raised within 3 months of the date of issue of the Disclosure. Back to Top. Yes, it is possible to track the progress of your DBS disclosure using the online tracking service provided by the DBS. You simply need to insert your date of birth and form reference number from the front page of your disclosure application form."}, {"url": "https://www.gov.uk/disclosure-barring-service-check/overview", "passage_text": "check. The employer gets an application form from DBS or an umbrella body (a registered body that gives access to. checks). The employer gives the applicant the form to fill in and return to them along with documents proving their identity. The employer sends the completed application form to. or their umbrella body. check. An employer can ask for a. check for certain roles. DBS eligibility guidance lists most roles that are eligible for a check. However, the guidance isn’t comprehensive so contact DBS if unsure. Applicants (job candidates) can’t do a criminal records check on themselves."}, {"url": "http://www.dbscheck4u.co.uk/how-long-is-a-dbs-check-crb-check-valid/", "passage_text": "A DBS has no official expiry date. Any information included will be correct at the time of issue. It is up to an employer to decide if and when a new DBS check is needed. "}, {"url": "https://www.gov.uk/disclosure-barring-service-check/overview", "passage_text": "Any information included will be accurate at the time the check was carried out. It is up to an employer to decide if and when a new check is needed. Applicants and employers can use the DBS update service to keep a certificate up to date or carry out checks on a potential employee’s certificate. check. An employer can ask for a. check for certain roles. DBS eligibility guidance lists most roles that are eligible for a check. However, the guidance isn’t comprehensive so contact DBS if unsure. Applicants (job candidates) can’t do a criminal records check on themselves."}, {"url": "http://dbsdirect.co.uk/faq.php", "passage_text": "There is no set or guaranteed time frame for an Enhanced DBS application to be processed. This is due to the individual nature and complexity of each check, and so DBS checks can take different amounts of time for each applicant. The AVERAGE time to complete online DBS/CRB Applications is 8 days. A “DBS Adult First” check (previously called an ISA Adult First or Pova check) is available in the exceptional circumstance that there is a real danger that your staffing levels will fall below statutory obligations, for example: Care Roles or for staff in Care Homes."}, {"url": "https://www.childprotectioncompany.com/CPC/dbs-checks-faq", "passage_text": "Each DBS check will show the date on which it was printed. DBS checks do not carry a pre-determined period of validity because a conviction or other matter could be recorded against the subject of the DBS check at any time after it is issued. DBS (Disclosure and Barring Services) checks replaced the Criminal Records Bureau (CRB) checks on 1st December 2012. The changes are as follows: 1  On 1st December 2012 the Criminal Records Bureau (CRB) merged with the Independent Safeguarding Authority (ISA). 2  The new name is the Disclosure and Barring Service (DBS)."}, {"url": "https://uk.answers.yahoo.com/question/index?qid=20130903121631AAHCr5j", "passage_text": "Rating Newest Oldest. Best Answer: A CRB check (now called DBS) has no valid to date as such. Technically they are out of date the day after they are issued-in theory you could be issued with a disclosure with nothing on it one day, then be in court and convicted the next day. Now called a DBS there is no expiry date. Employers are entitled to have an updated DBS. Anytime during the last 3 years you could have committed a crime. These are really only valid for the day you signed for it."}, {"url": "https://www.childprotectioncompany.com/CPC/dbs-checks-faq", "passage_text": "The current online average turnaround is under 6 days for an Enhanced DBS, without content and 1 day for a Standard DBS check. Disclosure Services commitment to clients is same day processing of all disclosure applications and disclosure results. You can track each stage of an application from your web account. DBS (Disclosure and Barring Services) checks replaced the Criminal Records Bureau (CRB) checks on 1st December 2012. The changes are as follows: 1  On 1st December 2012 the Criminal Records Bureau (CRB) merged with the Independent Safeguarding Authority (ISA). 2  The new name is the Disclosure and Barring Service (DBS)."}, {"url": "https://www.childprotectioncompany.com/CPC/dbs-checks-faq", "passage_text": "There is no official expiry date for a DBS check. Any information revealed on a certificate will be that held by police at the time the check was issued. You should check the date of issue on the certificate to decide whether to request a new one. DBS (Disclosure and Barring Services) checks replaced the Criminal Records Bureau (CRB) checks on 1st December 2012. The changes are as follows: 1  On 1st December 2012 the Criminal Records Bureau (CRB) merged with the Independent Safeguarding Authority (ISA). 2  The new name is the Disclosure and Barring Service (DBS)."}]