[{"url": "http://www.answers.com/Q/What_are_the_lungs_made_of", "passage_text": "The lungs are made up of many air sacs. 3 people found this useful. Edit. Share to: 1  Allergies and Your Lungs: Symptoms to Watch Out For When your body's immune system perceives a threat, it responds in certain ways. 2  Sometimes these responses take the form of allergies."}, {"url": "https://www.sharecare.com/health/functions-of-the-lungs/what-are-lungs-made-of", "passage_text": "The lungs are composed of various specialized cells and tissues -- not just simple tubes or pipes. Lining them are epithelial cells with specialized hairs, or cilia, which help trap particles and prevent infection from reaching the lungs."}, {"url": "http://science.nationalgeographic.com/science/health-and-human-body/human-body/lungs-article/", "passage_text": "Our lungs fuel us with oxygen, the body's life-sustaining gas. They breathe in air, then extract the oxygen and pass it into the bloodstream, where it's rushed off to the tissues and organs that require it to function. Oxygen drives the process of respiration, which provides our cells with energy."}, {"url": "http://www.innerbody.com/anatomy/respiratory/lungs", "passage_text": "At the same time, carbon dioxide diffuses out of the blood and into the air through the respiratory membrane. The exchange of oxygen into the blood and carbon dioxide into the air allows the blood leaving the lungs to provide oxygen to the body’s cells, while depositing carbon dioxide waste into the air. Control of Breathing. Breathing is controlled by the brain and may be controlled both consciously and unconsciously."}, {"url": "https://www.sharecare.com/health/functions-of-the-lungs/what-are-lungs-made-of", "passage_text": "Beneath these cells is the basement membrane that forms a firm foundation for the epithelial cells, and under that is looser tissue full of mucous glands and other specialized cells such as eosinophils, mast cells, lymphocytes, and white blood cells called polys. Under this layer is smooth muscle."}, {"url": "http://www.answers.com/Q/What_are_the_lungs_made_of", "passage_text": "The lungs are a pair of lobed s … tructures made up of a series of highly branched tubules called bronchioles, which end in tiny air sacs called the alveoli (the alveolar membrane is the site of gas exchange).   Lungs allow us to take in oxygen from the external air and allow us to get rid of excess carbon dioxide."}, {"url": "http://science.nationalgeographic.com/science/health-and-human-body/human-body/lungs-article/", "passage_text": "Intricate Construction. Our two lungs are made up of a complex latticework of tubes, which are suspended, on either side of the heart, inside the chest cavity on a framework of elastic fibers. Air is drawn in via the mouth and the nose, the latter acting as an air filter by trapping dust particles on its hairs."}]