[{"url": "http://www.answers.com/Q/What_serious_problems_did_the_republic_of_texas_face_as_a_new_nation", "passage_text": "The Republic of Texas faced attack from Native American tribes and Mexico, though Texas and MExico signed a peace treaty in 1844. Most Texans hoped that the U.S. would annex Texas, making it a state. The U.S. Congress also wanted to annex Texas. But then-President Andrew Jackson refused. He was concerned that admitting Texas as a slave state would upset the fragilie balance of free and slave states. The president also did not want to have a war with Mexico over Texas."}, {"url": "https://tshaonline.org/handbook/online/articles/qja03", "passage_text": "In addition to the regular army, the Republic of Texas was protected by a militia, by companies of minutemen, and by the paramilitary Texas Rangers qv. On December 6, 1836, during Sam Houston's first presidential term, Congress passed legislation establishing the essential militia structure. The army was of immense importance in the life of the Republic of Texas. Such lawmakers as Mirabeau B. Lamar, who favored a strong defense establishment, were a powerful element in the Texas government, and the great expense of the army was perhaps the major factor in the republic's chronic financial difficulties."}, {"url": "http://www.answers.com/Q/4_major_problems_the_republic_of_texas_faced", "passage_text": "ANSWER: The problems between Texas and Mexico would include: A portion of land in Texas, was granted for 100 American families to settle a colony in 1820, and become loyal subjects of Spain. However, by 1835, Americans outnumbered Mexicans by ten to one."}, {"url": "http://www.answers.com/Q/4_major_problems_the_republic_of_texas_faced", "passage_text": "Many settlers had brought their slaves with them to Texas. Periodic attempts by Mexico to abolish slavery in Texas was a problem. Mexico had became alarmed at the large number of Americans in Texas and began to restrict settlement. Some land grants were canceled. The problems between Texas and Mexico would include: A portion of land in Texas, was granted for 100 American families to settle a colony in 1820, and become loyal subjects of Spain."}, {"url": "https://en.wikipedia.org/wiki/History_of_Texas", "passage_text": "Their ancestors had been there for thousands of years. During the period from 1519 to 1848, all or parts of Texas were claimed by five countries: France, Spain, Mexico, the Republic of Texas, the United States of America —as well as the Confederate States of America in 1861–65."}, {"url": "https://en.wikipedia.org/wiki/Republic_of_Texas", "passage_text": "In 1836, five sites served as temporary capitals of Texas (Washington-on-the-Brazos, Harrisburg, Galveston, Velasco and Columbia), before President Sam Houston moved the capital to Houston in 1837. The next president, Mirabeau B. Lamar, moved the capital to the new town of Austin in 1839. The second Congress of the Republic of Texas convened in October 1836 at Columbia (now West Columbia). Stephen F. Austin, known as the Father of Texas, died December 27, 1836, after serving two months as Secretary of State for the new Republic."}, {"url": "http://texasescapes.com/JefferyRobenalt/Sam-Houston-and-Mirabeau-Lamar-A-Contrast-of-Visions.htm", "passage_text": "However, both men were strong leaders, and their vastly different visions for the new Republic would do much to shape the future of Texas. Sam Houston by Elizabet Ney. TE photo. When Sam Houston took office in 1836, as the first elected president of the Republic of Texas, the new nation faced many problems. Foremost among them was Mexico s refusal to recognize the independence of the new republic. Technically, the two nations were still at war. "}, {"url": "https://en.wikipedia.org/wiki/Republic_of_Texas", "passage_text": "It was bordered by the nation of Mexico to the southwest, the Gulf of Mexico to the southeast, the two U.S. states of Louisiana and Arkansas to the east and northeast, and the United States territories encompassing the current U.S. states of Oklahoma, Kansas, Colorado, Wyoming, and New Mexico to the north and west. The second Congress of the Republic of Texas convened in October 1836 at Columbia (now West Columbia). Stephen F. Austin, known as the Father of Texas, died December 27, 1836, after serving two months as Secretary of State for the new Republic."}]