[{"url": "http://www.chemicool.com/definition/ligand.html", "passage_text": "Bidentate Ligands. Bidentate ligands have two atoms capable of binding to a central metal atom or ion. Ethane-1,2-diamine (shown in the image) is an example of a bidentate ligand. Both of the nitrogens in this molecule can act as electron donors, binding with a central metal atom or ion. When H 2 0 is a ligand, oxygen is the donor atom binding to the metal. When NH 3 is a ligand, nitrogen is the donor atom binding to the metal. Examples of monodentate ligands which begin with charges are halide ions, such as: F - , Cl - , Br - , I - , and cyano, CN - ."}, {"url": "https://en.wikipedia.org/wiki/Ligand", "passage_text": "In coordination chemistry, a ligand (/lɪɡənd/) is an ion or molecule (functional group) that binds to a central metal atom to form a coordination complex. The bonding between metal and ligand generally involves formal donation of one or more of the ligand's electron pairs. Metals and metalloids are bound to ligands in virtually all circumstances, although gaseous naked metal ions can be generated in high vacuum. Ligands in a complex dictate the reactivity of the central atom, including ligand substitution rates, the reactivity of the ligands themselves, and redox."}, {"url": "http://ghr.nlm.nih.gov/geneFamily/endogenousligands", "passage_text": "Genes in this family provide instructions for making specialized proteins called endogenous ligands. A ligand is a protein that attaches (binds) to another protein called a receptor; receptor proteins have specific sites into which the ligands fit like keys into locks. Endogenous ligands are those that are produced in the body, not those introduced into the body, such as certain drugs. "}, {"url": "http://chemistry.tutorvista.com/inorganic-chemistry/ligands.html", "passage_text": "All four-Cl ligands get arranged in tetrahedral manner around the central metal ion and form a metal complex. Ligand can be an anion, cation or a neutral molecule. Neutral ligands must have a lone pair of electrons which can be donated to the metal atom or ion to form complexes. A ligand can be defined as a specific substance that is capable of binding and forming a thermodynamically stable complex with other bio molecules through either ionic and hydrogen bonding or Van der Waals forces to perform a specific biologically important function."}, {"url": "http://www.chemicool.com/definition/ligand.html", "passage_text": "Tridentate ligands have three atoms capable of binding to a central metal atom or ion. Molecules with four donor atoms are called tetradentate ligands; five donor atoms, pentadentate; and six donor atoms hexadentate. A complex that contains a polydentate is called a chelate. When H 2 0 is a ligand, oxygen is the donor atom binding to the metal. When NH 3 is a ligand, nitrogen is the donor atom binding to the metal. Examples of monodentate ligands which begin with charges are halide ions, such as: F - , Cl - , Br - , I - , and cyano, CN - ."}, {"url": "http://www.biology-online.org/dictionary/Ligand", "passage_text": "Ligand. Definition. noun, plural: ligands. (1) A molecule, ion or atom bonded to the central metal atom of a coordination compound. (2) Any substance (e.g. hormone, drug, functional group, etc .) that binds specifically and reversibly to another chemical entity to form a larger complex. Supplement. A ligand may function as agonist or antagonist"}, {"url": "http://www.chemguide.co.uk/inorganic/complexions/whatis.html", "passage_text": "The molecules or ions surrounding the central metal ion are called ligands. The nature of ligands Simple ligands include water, ammonia and chloride ions. What all these have got in common is active lone pairs of electrons in the outer energy level. These are used to form co-ordinate bonds with the metal ion. "}, {"url": "https://en.wikipedia.org/wiki/Ligand_(biochemistry)", "passage_text": "In biochemistry and pharmacology, a ligand is a substance that forms a complex with a biomolecule to serve a biological purpose. In protein-ligand binding, the ligand is usually a signal-triggering molecule binding to a site on a target protein. The binding typically results in a change of conformation of the target protein. In DNA-ligand binding studies, the ligand can be a small molecule, ion, or protein that binds to the DNA double helix"}, {"url": "http://www.chemicool.com/definition/ligand.html", "passage_text": "Monodentate ligands have only one atom capable of binding to a central metal atom or ion. H 2 0 and NH 3 are examples of neutral monodentate ligands. When H 2 0 is a ligand, oxygen is the donor atom binding to the metal. When NH 3 is a ligand, nitrogen is the donor atom binding to the metal. Examples of monodentate ligands which begin with charges are halide ions, such as: F - , Cl - , Br - , I - , and cyano, CN - ."}]