[{"url": "http://www.math.uah.edu/stat/special/Gamma.html", "passage_text": "In particular, the arrival times in the Poisson process have gamma distributions, and the chi-square distribution in statistics is a special case of the gamma distribution. Also, the gamma distribution is widely used to model physical quantities that take positive values. The. \\(\\Gamma \\) is defined as follows \\[ \\Gamma(k) = \\int_0^\\infty x^{k-1} e^{-x} \\, dx, \\quad k \\in (0, \\infty) \\] The function is well defined, that is, the integral converges for any \\(k \\gt 0\\)."}, {"url": "http://math.wikia.com/wiki/Gamma_distribution", "passage_text": "Template:Probability distribution In probability theory and statistics, the gamma distribution is a two-parameter family of continuous probability distributions. It has a scale parameter θ and a shape parameter k. 1 If is an integer, the gamma distribution is an Erlang distribution and is the probability distribution of the waiting time until the-th arrival in a one-dimensional Poisson process with intensity 1/θ. 2  If, then X has a Maxwell-Boltzmann distribution with parameter a."}, {"url": "https://en.wikipedia.org/wiki/Gamma_distribution", "passage_text": "In probability theory and statistics, the gamma distribution is a two-parameter family of continuous probability distributions. The common exponential distribution and chi-squared distribution are special cases of the gamma distribution. There are three different parametrizations in common use: 1  With a shape parameter k and a scale parameter θ. 2  With a shape parameter α = k and an inverse scale parameter β = 1/θ, called a rate parameter. In Bayesian inference, the gamma distribution is the conjugate prior to many likelihood distributions: the Poisson, exponential, normal (with known mean), Pareto, gamma with known shape σ, inverse gamma with known shape parameter, and Gompertz with known scal"}, {"url": "http://math.wikia.com/wiki/Gamma_distribution", "passage_text": "The probability density function of the gamma distribution can be expressed in terms of the gamma function : (This parameterization is used in the infobox and the plots.). Alternatively, the gamma distribution can be parameterized in terms of a shape parameter and an inverse scale parameter, called a rate parameter: 1 If is an integer, the gamma distribution is an Erlang distribution and is the probability distribution of the waiting time until the-th arrival in a one-dimensional Poisson process with intensity 1/θ. 2  If, then X has a Maxwell-Boltzmann distribution with parameter a."}, {"url": "http://itl.nist.gov/div898/handbook/eda/section3/eda366b.htm", "passage_text": "Probability Density Function. The general formula for the probability density function of the gamma distribution is. where γ is the shape parameter, μ is the location parameter, β is the scale parameter, and γ is the gamma function which has the formula. The equation for the standard gamma distribution reduces to. Since the general form of probability functions can be expressed in terms of the standard distribution, all subsequent formulas in this section are given for the standard form of the function."}, {"url": "http://itl.nist.gov/div898/handbook/eda/section3/eda366b.htm", "passage_text": "Cumulative Distribution Function. The formula for the cumulative distribution function of the gamma distribution is. where γ is the gamma function defined above and \\(\\Gamma_{x}(a)\\) is the incomplete gamma function. The incomplete gamma function has the formula. The equation for the standard gamma distribution reduces to. Since the general form of probability functions can be expressed in terms of the standard distribution, all subsequent formulas in this section are given for the standard form of the function."}, {"url": "http://www.math.uah.edu/stat/special/Gamma.html", "passage_text": "Definition. The. \\(\\Gamma \\) is defined as follows \\[ \\Gamma(k) = \\int_0^\\infty x^{k-1} e^{-x} \\, dx, \\quad k \\in (0, \\infty) \\] The function is well defined, that is, the integral converges for any \\(k \\gt 0\\). On the other hand, the integral diverges to \\(\\infty \\) for \\(k \\le 0 \\)"}, {"url": "http://mathworld.wolfram.com/GammaDistribution.html", "passage_text": "This is the probability function for the gamma distribution, and the corresponding distribution function is. (14). where is a regularized gamma function. It is implemented in the Wolfram Language as the function. [ alpha, theta ]. (39). (40). The sum therefore has the distribution. (41). which is a gamma distribution, and the ratio has the distribution. (42). (43). (44). where is the beta function, which is a beta distribution. If and are gamma variates with parameters and, the is a variate with a beta prime distribution with parameters and."}, {"url": "http://treethinkers.org/tutorials/the-gamma-distribution/", "passage_text": "The Gamma Distribution. The gamma distribution is a continuous probability distribution that is popular for a range of phylogenetic applications. The gamma distribution is popular in part because its a bit of a shape shifter that can assume a range of shapes, from exponential to normal. "}, {"url": "http://mathworld.wolfram.com/GammaDistribution.html", "passage_text": "A gamma distribution is a general type of statistical distribution that is related to the beta distribution and arises naturally in processes for which the waiting times between Poisson distributed events are relevant. Gamma distributions have two free parameters, labeled and, a few of which are illustrated above. (39). (40). The sum therefore has the distribution. (41). which is a gamma distribution, and the ratio has the distribution. (42). (43). (44). where is the beta function, which is a beta distribution. If and are gamma variates with parameters and, the is a variate with a beta prime distribution with parameters and."}]