[{"url": "https://in.answers.yahoo.com/question/index?qid=20060917000619AAKziMG", "passage_text": "The Land Belongs to the Children Vande Mataram, Vande Mataram. Walk with a sway to the sound of the waves by the oceanside. Boy, see the girl, she answers you back with her bashful eyes. ...and the land, the land belongs to the children, they are the land and the song that they sing: Vande Mataram, Vande Mataram. its very simple. vande means praise, salute and Mataram means your mother, your country, your motherland. i dunno why people are making such a fuss about saluting your motherland.dont listen to who is saying what, just salute your motherland and apna kaam karo."}, {"url": "https://answers.yahoo.com/question/index?qid=1006060104539", "passage_text": "To her I cry who ever her foeman drove Back from plain and Sea And shook herself free. Thou art wisdom, thou art law, Thou art heart, our soul, our breath Though art love divine, the awe In our hearts that conquers death. Thine the strength that nervs the arm, Thine the beauty, thine the charm. Every image made divine In our temples is but thine."}, {"url": "http://blogs.transparent.com/hindi/vande-matram-national-song-of-india/", "passage_text": "One such song is “वन्दे मातरम” (Vande Matram – “I bow to thee, Mother”). From this song, the first two stanza are recognized as the national song of India and holds the equal status as of the national anthem of India. Vande Matram was written by Bankim Chandra Chattopadhyay in 1882. It was written in Bengali and Sanskrit. Let me show you the script of the song. The script is given in Sanskrit, romanized Sanskrit and its translation in English"}, {"url": "http://www.youtube.com/watch?v=3g8nQuX8dUg", "passage_text": "Vande Mataram. -original song. My obeisance to Mother India! With flowing beneficial waters. Filled with choicest fruits. With Sandal scented winds. Green with the harvest. O mother! My obeisance to you! Ecstatic moonlit nights. Thou art wisdom, thou art law, Thou art heart, our soul, our breath. Though art love divine, the awe. In our hearts that conquers death. Thine the strength that nervs the arm, Thine the beauty, thine the charm. Every image made divine. In our temples is but thine."}, {"url": "http://www.swathikiranam.com/swathi/resources/Vande%20Mataram.pdf", "passage_text": "Vande Mataram (Sanskrit: Vande Mātaram I do homage to the mother;) is a poem in the 1882 novel Anandamatha by Bankimchandra Chattopadhyay. It is written in a mixture of Bengali and Sanskrit. It is a hymn to the goddess Durga, identified as the national personification of Bengal. "}, {"url": "https://answers.yahoo.com/question/index?qid=1006060104539", "passage_text": "Following is complete translation of Vande Mataram (NAtional Song of India) by Sir Aurobindo Mother, I bow to thee! Rich with thy hurrying streams, bright with orchard gleams, Cool with thy winds of delight, Dark fields waving Mother of might, Mother free. Thou art wisdom, thou art law, Thou art heart, our soul, our breath Though art love divine, the awe In our hearts that conquers death. Thine the strength that nervs the arm, Thine the beauty, thine the charm. Every image made divine In our temples is but thine."}, {"url": "http://www.youtube.com/watch?v=c6PHJg9D_Sk", "passage_text": "Vande Mataram is the national song of India. The song was composed by Bankim Chandra Chatterjee. More details: http://en.wikipedia.org/wiki/Vande_Ma... Thanks to BharatBala Productions. 1  Entertainment. 2  Standard YouTube License"}, {"url": "https://en.wikipedia.org/wiki/Vande_Mataram", "passage_text": "The core of Vande Mataram is a hymn to goddess Durga: this is so plain that there can be no debate about it. Of course Bankimchandra does show Durga to be inseparably united with Bengal in the end, but no Mussulman [Muslim] can be expected patriotically to worship the ten-handed deity as Swadesh [the nation]. Thou art wisdom, thou art law, Thou art heart, our soul, our breath Though art love divine, the awe In our hearts that conquers death. Thine the strength that nerves the arm, Thine the beauty, thine the charm."}, {"url": "https://en.wikipedia.org/wiki/Vande_Mataram", "passage_text": "Though who savest, arise and save! To her I cry who ever her foeman drove Back from plain and Sea And shook herself free. Thou art wisdom, thou art law, Thou art heart, our soul, our breath Though art love divine, the awe In our hearts that conquers death. Thine the strength that nerves the arm, Thine the beauty, thine the charm. Every image made divine In our temples is but thin"}, {"url": "https://en.wikipedia.org/wiki/Vande_Mataram", "passage_text": "Glory of moonlight dreams, Over thy branches and lordly streams, Clad in thy blossoming trees, Mother, giver of ease Laughing low and sweet! Mother I kiss thy feet, Speaker sweet and low! Mother, to thee I salute. Thou art wisdom, thou art law, Thou art heart, our soul, our breath Though art love divine, the awe In our hearts that conquers death. Thine the strength that nerves the arm, Thine the beauty, thine the charm."}]