[{"url": "https://en.wikipedia.org/wiki/Hydromorphone", "passage_text": "Comparatively, hydromorphone is to morphine as hydrocodone is to codeine -- that is, a semi-synthetic drug. In medical terms, it is an opioid analgesic and, in legal terms, a narcotic. Hydromorphone is metabolized to hydromorphone-3-glucoronide which has no analgesic effects. Like the morphine metabolite, morphine-3-glucoronide, if levels of hm-3-glucoronide build up in one's system, it can produce excitatory neurotoxic effects such as restlessness, myoclonus and hyperalgesia."}, {"url": "https://www.opiates.com/dilaudid/", "passage_text": "Dilaudid. Home » Dilaudid. Dilaudid ®, also known as hydromorphone is a narcotic analgesic of the opiate class prescribed for relief of moderate to severe pain and severe, painful dry coughing. Dilaudid ® is commonly used as an alternative to morphine in cases where a powerful antitussive is needed. The side effects of dilaudid cannot be anticipated. If any develop or change in intensity, inform your doctor as soon as possible. Dilaudid is a narcotic analgesic that treats moderate to severe pain by binding to opioid receptors in the brain and nervous system. It is a semi-synthetic drug derived from morphine."}, {"url": "http://www.rxlist.com/dilaudid-drug/patient-images-side-effects.htm", "passage_text": "Hydromorphone is an opioid pain medication. An opioid is sometimes called a narcotic. Hydromorphone is used to treat moderate to severe pain. The extended-release form of this medication is for around-the-clock treatment of pain. Hydromorphone may also be used for purposes not listed in this medication guide."}, {"url": "http://www.ncbi.nlm.nih.gov/pubmedhealth/PMHT0010613/?report=details", "passage_text": "Uses of This Medicine. Hydromorphone belongs to the group of medicines called narcotic analgesics, which are medicines used to relieve pain. Dilaudid® is used to relieve pain in patients who require a narcotic pain medication. Dilaudid-HP® is used to relieve moderate-to-severe pain in patients who are opioid-tolerant and who require higher doses of opioid medicine. Hydromorphone acts on the central nervous system (CNS) to relieve pain. Some of the side effects are also caused by actions in the CNS."}, {"url": "http://www.ncbi.nlm.nih.gov/pubmedhealth/PMHT0010611/?report=details", "passage_text": "Uses of This Medicine. Hydromorphone oral liquid and tablets are used to relieve pain. The hydromorphone extended-release capsules and extended-release tablets are used to relieve moderate to severe pain in opioid-tolerant patients who require around-the-clock pain relief for a long period of time. "}, {"url": "http://www.webmd.com/drugs/2/drug-9130/dilaudid-oral/details", "passage_text": "Uses. This medication is used to help relieve moderate to severe pain. Hydromorphone belongs to a class of drugs known as narcotic (opiate) analgesics. It works in the brain to change how your body feels and responds to pain. Be sure you know how to take hydromorphone and what other drugs you should avoid taking with it. The risk for breathing problems might also be higher when you start this medication and after a dose increase. Get immediate medical help if you notice unusual slow/shallow breathing."}, {"url": "http://www.everydayhealth.com/drugs/dilaudid", "passage_text": "A: Dilaudid (hydromorphone) is a narcotic pain reliever similar to morphine. Dilaudid is commonly used to treat moderate to severe pain, bone pain, dental pain, and migraines. Dilaudid is the brand name of the drug hydromorphone, which is used to relieve pain. This medicine is in a class of drugs called opiate analgesics."}, {"url": "http://www.everydayhealth.com/drugs/dilaudid", "passage_text": "A: Dilaudid (hydromorphone) is a narcotic pain reliever similar to morphine commonly used to treat moderate to severe pain, bone pain, dental pain, and migraines. Hydromorphone may be habit-forming and should be used only by the person it was prescribed for. Do not drink alcohol. Dilaudid is the brand name of the drug hydromorphone, which is used to relieve pain. This medicine is in a class of drugs called opiate analgesics."}, {"url": "https://en.wikipedia.org/wiki/Hydromorphone", "passage_text": "Hydromorphone is a more common synonym for dihydromorphinone (not to be confused with dihydromorphine, which is a different derivative of the morphine family), commonly a hydrochloride (brand names Palladone, Dilaudid, and numerous others). It is a very potent centrally acting analgesic drug of the opioid class. Hydromorphone is metabolized to hydromorphone-3-glucoronide which has no analgesic effects. Like the morphine metabolite, morphine-3-glucoronide, if levels of hm-3-glucoronide build up in one's system, it can produce excitatory neurotoxic effects such as restlessness, myoclonus and hyperalgesia."}, {"url": "http://www.mayoclinic.org/drugs-supplements/hydromorphone-injection-route/description/DRG-20074244", "passage_text": "Hydromorphone belongs to the group of medicines called narcotic analgesics, which are medicines used to relieve pain. Dilaudid® is used to relieve pain in patients who require a narcotic pain medication. Dilaudid-HP® is used to relieve moderate-to-severe pain in patients who are opioid-tolerant and who require higher doses of opioid medicine. Hydromorphone acts on the central nervous system (CNS) to relieve pain. Some of the side effects are also caused by actions in the CNS."}]