[{"url": "http://darkmountainmovie.com/the-legend/", "passage_text": "Legend has it that somewhere deep within the Superstition Mountains of Arizona lies the most famous lost gold mine in North American history—the Lost Dutchman Mine. Believers estimate its worth to be around 200 million dollars. "}, {"url": "https://en.wikipedia.org/wiki/Superstition_Mountains", "passage_text": "Weavers Needle, a prominent landmark and rock climbing destination set behind and to the east of Superstition Mountain, is a tall eroded remnant that plays a significant role in the legend of the Lost Dutchman's Gold Mine. Some Apaches believe that the hole leading down into the lower world, or hell, is located in the Superstition Mountains. Winds blowing from the hole are supposed to be the cause of severe dust storms in the metropolitan region."}, {"url": "https://itunes.apple.com/us/tv-season/legend-superstition-mountains/id961270382", "passage_text": "Description. On Legend of the Superstition Mountains, an alliance of fearless hunters venture into an area in the Arizona desert – called by the Apache “a portal to hell” – to pursue legendary riches. Armed with a new clue that could unearth the location of the famed Lost Dutchman Mine, lifelong Dutch Hunter Wayne Tuttle, leads a team into Arizona's Superstition Mountains in search of America's deadliest treasure."}, {"url": "https://en.wikipedia.org/wiki/Lost_Dutchman%27s_Gold_Mine", "passage_text": "The earliest Lost Dutchman's mine in Arizona was said to have been near Wickenburg, about 180 km (110 mi) north-west of the Superstition Mountains: a Dutchman was allegedly discovered dead in the desert near Wickenburg in the 1870s alongside saddlebags filled with gold. People have been seeking the Lost Dutchman's mine since at least 1892, while according to one estimate, 8,000 people annually made some effort to locate the Lost Dutchman's mine. Former Arizona Attorney General Bob Corbin is among those who have looked for the mine."}, {"url": "https://en.wikipedia.org/wiki/Lost_Dutchman%27s_Gold_Mine", "passage_text": "The Lost Dutchman's Gold Mine (also known by similar names) is, according to legend, a rich gold mine hidden in the southwestern United States. The location is generally believed to be in the Superstition Mountains, near Apache Junction, east of Phoenix, Arizona. People have been seeking the Lost Dutchman's mine since at least 1892, while according to one estimate, 8,000 people annually made some effort to locate the Lost Dutchman's mine. Former Arizona Attorney General Bob Corbin is among those who have looked for the mine."}, {"url": "https://en.wikipedia.org/wiki/Superstition_Mountains", "passage_text": "They are anchored by Superstition Mountain, a large mountain that is a popular recreation destination for residents of the Phoenix, Arizona area. The mountain range is in the federally designated Superstition Wilderness Area, and includes a variety of natural features in addition to its namesake mountain. Some Apaches believe that the hole leading down into the lower world, or hell, is located in the Superstition Mountains. Winds blowing from the hole are supposed to be the cause of severe dust storms in the metropolitan region."}, {"url": "https://en.wikipedia.org/wiki/Superstition_Mountains", "passage_text": "The Superstition Mountains (Yavapai: Wi:kchsawa), popularly called The Superstitions, are a range of mountains in Arizona located to the east of the Phoenix metropolitan area. Some Apaches believe that the hole leading down into the lower world, or hell, is located in the Superstition Mountains. Winds blowing from the hole are supposed to be the cause of severe dust storms in the metropolitan region."}, {"url": "https://en.wikipedia.org/wiki/Lost_Dutchman%27s_Gold_Mine", "passage_text": "1 Lust for Gold is a 1949 western film about the mine based on Storm's book. 2  A 13-episode serial of the Ruff and Reddy television cartoon series, originally broadcast in 1960, has the titular heroes searching for – and finding – the Lost Dutchman's gold mine, as well as the ghost of the Lost Dutchman. People have been seeking the Lost Dutchman's mine since at least 1892, while according to one estimate, 8,000 people annually made some effort to locate the Lost Dutchman's mine. Former Arizona Attorney General Bob Corbin is among those who have looked for the mine."}, {"url": "http://www.huffingtonpost.com/2015/03/14/superstition-mountains-lost-dutchman-gold-mine_n_6835264.html", "passage_text": "On History channel's series Legend of the Superstition Mountains, a team of adventurers led by hunter Wayne Tuttle (pictured above) is following clues, including those on a mysterious map, hoping they'll hit pay dirt of what's considered America's most famous and deadliest buried treasure. Located east of Phoenix, the Superstition Mountains stretch across 160,000 acres of desert, and somewhere in these almost supernatural-looking canyons is a reported gold mine worth several hundred millions of dollars. The trick, of course, is how to find it."}, {"url": "https://en.wikipedia.org/wiki/Superstition_Mountains", "passage_text": "The legends and lore of the Superstition Mountains can be experienced at the Superstition Mountain Museum on the Apache Trail where artifacts of the Lost Dutchman are on display. Some Apaches believe that the hole leading down into the lower world, or hell, is located in the Superstition Mountains. Winds blowing from the hole are supposed to be the cause of severe dust storms in the metropolitan region."}]