[{"url": "http://www.ehow.com/how_5918544_remove-watch-back-replace-battery.html", "passage_text": "Watches with a Snap-on Back. Work the head of a small screwdriver or the edge of a small, dull knife gently into the groove. Watches with a Snap-on Back. Give the screwdriver or knife a slight twist. This should cause the back plate of the watch to pop off, revealing the battery beneath. Carefully remove the battery and replace it with the new. The back should easily snap back into place. Watches with a Screw-on Back. Push a rubber-tipped opener directly into the center of the back plate of the watch. If you do not have a rubber-tipped opener, you may need to take the watch to a jeweler or purchase a tool kit specifically made for watch repair."}, {"url": "http://www.wikihow.com/Change-a-Watch-Battery", "passage_text": "If you determine your watch case back unscrews them you will need to either purchase an expensive wrench or take your watch to a watchmaker for a battery change. Don't ruin or damage your watch by using the wrong tools to open the case back. 1  Examine the edge of the back cover. 2  If there is one small depression along the edge of the cover then the cover will pry off. 3  Use a watch case opener if you have one, or a blunt kitchen knife or a flat-faced screwdriver if you don't. 1 Use a watch case opener if you have one, or a blunt kitchen knife or a flat-faced screwdriver if you don't. 2  Using a sharp knife can be dangerous if you slip and the knife cuts you. 3  If there are screws present, the cover will lift off after the screws are removed. 4  Remove any screws that keep the back cover to the body."}, {"url": "http://www.wikihow.com/Pry-off-a-Watch-Backing-Without-Proper-Tools", "passage_text": "If you have a watch with a dead battery, you can replace the battery yourself. However, it is often difficult to remove the back cover of the watch case. Every watch is different, some may unscrew, while others will pry off, particularly common in less expensive watches. Things You'll Need. If the watch back doesn't have a tab or indentation then here is what to do.. Take a flat blade jewelers screwdriver and grind or file the tip to a knife edge. Mount the watch horizontally in a vise with the back facing up."}, {"url": "http://www.wikihow.com/Pry-off-a-Watch-Backing-Without-Proper-Tools", "passage_text": "1 Some watches don't have tabs to open the backs with. 2  If you experience any problems or can't figure out how to do it, find a good jeweler. 3  Most charge $1.00 -$5.00 for the battery change. 4  Walmart changes watch batteries for the brands of watches that they sell for free. 5  You just pay for the battery. Things You'll Need. If the watch back doesn't have a tab or indentation then here is what to do.. Take a flat blade jewelers screwdriver and grind or file the tip to a knife edge. Mount the watch horizontally in a vise with the back facing up."}, {"url": "http://blog.esslinger.com/how-to-open-a-watch-back/", "passage_text": "The second type of watch case back is the pressure type. Many watches with this type have a small dent or notch on the side or between the lugs where you can place your knife. Sometimes this type of watch back can’t be closed with your hands and you will have to use a watch case press to close it. How to Close a Snap Off Watch Back with a Watch Press. How to Open a Snap Off Case Back. #3) 4 screws watch back will have a smooth back that is held in place with four, or more, screws. There are several different tools you can use to open a watch back like this, check out these articles and videos to find the style that works for you. How to Open a Screw Down Case Back with Jaxa Wrench. How to Open a Screw Down Case Back with a Case Opener Ball."}, {"url": "http://www.webwatchworld.com/replace-watch-battery/", "passage_text": "Anyway, to replace Felix's battery, I first must remove the watch case back. It is a common snap-on, or snap-back case back, made from a stamped piece of sheet metal. Nothing fancy here, just minimal protection for an inexpensive watch. And even if your watch doesn't need a battery or you're just curious to see what's under the hood, it's nice to learn how to remove and replace all types of watch case backs just for fun. This article describes one of many methods for removing what is called a snap-on"}, {"url": "http://www.youtube.com/watch?v=ZzMrSAlt3jM", "passage_text": "Opening and removing a watch case back without the use of a wrench tool. I needed to make an adjustment to my Seiko 5 Automatic watch and I do not own the proper case wrench to unscrew the case back. You can use a grip ball or stress ball to unscrew open and remove a watch case back. "}, {"url": "http://www.ehow.com/how_5915197_remove-back-movado-watch.html", "passage_text": "Save. Comstock/Comstock/Getty Images. Movado watches have a snap back, meaning the back of the watch case pops open. This is the most common type of watch back. You will need to remove the case back to change the watch battery or to perform watch maintenance. 1  How to Open a Movado Bracelet Watch. 2  How to Replace a Movado Watch Battery. You could use a watch case opener tool, the tip of a small screwdriver, the tip of a butter knife or another similar tool. Be careful not to scratch the watch case with your tool. Wiggle your flat tool and twist it to release the case back. The case back should pop open easily."}, {"url": "http://www.webwatchworld.com/replace-watch-battery/", "passage_text": "But first, you'll have to know how to remove and replace the case back, which is the trickiest part of a battery replacement. This article describes one method for removing a snap-on type case back and how to use a watch case back press to replace it. Click on a photo to start the Lightbox photo viewer. And even if your watch doesn't need a battery or you're just curious to see what's under the hood, it's nice to learn how to remove and replace all types of watch case backs just for fun. This article describes one of many methods for removing what is called a snap-on case back."}]