[{"url": "http://www.nhs.uk/Conditions/hypoparathyroidism-hyperparathyroidism/Pages/Introduction.aspx", "passage_text": "Parathyroid glands. There are four parathyroid glands, each the size of a grain of rice, in your neck behind the thyroid gland, They produce parathyroid hormone (PTH) which helps control the levels of calcium, phosphorus and vitamin D within the bones and blood."}, {"url": "http://www.innerbody.com/image/endo04.html", "passage_text": "The thyroid gland is a butterfly-shaped organ made of mostly glandular tissue and located in the base of the neck.... Click to read more below. The thyroid gland and parathyroid glands are a group of endocrine glands located in the base of the neck. These glands play a vital role in maintaining the body’s homeostasis by producing hormones that regulate the body’s metabolism and free calcium levels."}, {"url": "http://www.medicinenet.com/script/main/art.asp?articlekey=4773", "passage_text": "Parathyroid gland: A gland that regulates calcium, located behind the thyroid gland in the neck. The parathyroid gland secretes a hormone called parathormone (or parathyrin) that is critical to calcium and phosphorus metabolism. Although the number of parathyroid glands can vary, most people have four, one above the other on each side."}, {"url": "http://patient.info/health/the-thyroid-and-parathyroid-glands", "passage_text": "Two parathyroid glands lie behind each 'wing' of the thyroid gland. The parathyroid glands release a hormone called parathyroid hormone. This hormone helps to control the levels of three minerals in the body: calcium, phosphorus and magnesium."}, {"url": "http://endocrinediseases.org/parathyroid/parathyroid_background.shtml", "passage_text": "The parathyroid glands are four tiny glands, located in the neck, that control the body's calcium levels. Each gland is about the size of a grain of rice (weighs approximately 30 milligrams and is 3-4 millimeters in diameter)."}, {"url": "https://www.nlm.nih.gov/medlineplus/ency/article/002931.htm", "passage_text": "Parathyroidectomy is surgery to remove the parathyroid glands or parathyroid tumors. The parathyroid glands are right behind your thyroid gland in your neck. These glands help your body control the calcium level in the blood."}, {"url": "http://www.mayoclinic.org/diseases-conditions/hyperparathyroidism/basics/definition/con-20022086", "passage_text": "Parathyroid glands. Hyperparathyroidism is an excess of parathyroid hormone in the bloodstream due to overactivity of one or more of the body's four parathyroid glands. These glands are about the size of a grain of rice and are located in your neck."}]