[{"url": "http://mingdynastyfk.blogspot.com/2012/02/inventions.html", "passage_text": "Inventions. The huochong gun was invented in China during the Ming dynasty. It was also called the tongjiangjun, which meant bronze general. This was an important invention of the time period because the Ming Dynasty was creating weapons to defend their dynasty, and they came across the gun."}, {"url": "http://sidarsmingdynasty.blogspot.com/2013/02/inventions-porcelain.html", "passage_text": "Inventions: Porcelain. Porcelain was a very gorgeous looking pottery, it was invented in China during the Ming Dynasty. This was a important invention during the Ming Dynasty because the porcelain had been exported all around the world. The porcelain had many types of designs and colors on it, but never blue. Until one day they found out on how to make the blue, they also had founded out about manganese. "}, {"url": "http://themingdynasty.org/ming-dynasty-inventions.html", "passage_text": "This was one of the greatest Ming Dynasty inventions and was introduced in 1403. This inspired today’s encyclopedia. The Ming Dynasty is considered to be one of the most prosperous and glorious periods in the history of China. Apart from the enchanting attractions, spectacular artifacts, and the Great Wall, the Ming Dynasty was also known for its wonderful innovations. This invention occurred around 1498, during the reign of the Hongzhi Emperor of the Ming Dynasty. This was mass-produced in 1780, several years after the fall of the Ming Dynasty. Before the toothbrush was invented, people used sticks and flared edges called chew sticks. After this, pig bristles were used."}, {"url": "http://www.answers.com/Q/What_are_the_inventions_of_the_Ming_Dynasty", "passage_text": "The ming people also 'invented' litreature as four of the classic novels written was written during the Ming Dynasty. "}, {"url": "http://www.visionlaunch.com/qin-dynasty-inventions/", "passage_text": "China is a country full of might, great wonders and important inventions. Its history was formed by different dynasties throughout history. One of the most effective and popular dynasty’s in China was the Qin Dynasty. Qin is pronounced as chin and it is the reason why the western name for the country became China. "}, {"url": "http://www.pbs.org/wgbh/nova/ancient/song-dynasty.html", "passage_text": "Printing, paper money, porcelain, tea, restaurants, gunpowder, the compass—the number of things that Chinese of the Song Dynasty (A.D. 960-1280) gave to the world is mind-boggling. This vibrant period in Chinese history was marked by economic prosperity and remarkable technological innovation. It was this invention that was eventually taken over to the West and used by Gutenberg for the printing of the Bible. Needless to say, this had a profound effect on the nature of knowledge and the development of literature. So this is probably the number-one invention of the Song Dynasty."}, {"url": "http://totallyhistory.com/ming-dynasty-inventions/", "passage_text": "The Ming Dynasty was the most prosperous eras of China. One of the reasons was due to the invention of woodblock color printing, paper, and the two-color printing process. It surpasses all the preceded printing techniques of the previous dynasties. Woodblock carving and wood movable type were enhanced to perfection. These are just few of the great inventions of Ming dynasty which swept through the ages all over the world. These contributions are up to now widely used, leaving a lasting mark not only in the history of China but of the world."}, {"url": "http://totallyhistory.com/tang-dynasty-inventions/", "passage_text": "During the period of the Tang Dynasty, from 618 to 907, many inventions were made in the field of medicine, engineering, and the sciences. "}, {"url": "http://totallyhistory.com/ming-dynasty-inventions/", "passage_text": "Ming Dynasty Inventions. The Ming Dynasty (1368-1644) is regarded to be one of the glorious periods in the history of China. Aside from its spectacular edifices, enchanting tourist attractions, and the wonderful Great Wall, the Ming Dynasty was also known for its amazing innovations. These are just few of the great inventions of Ming dynasty which swept through the ages all over the world. These contributions are up to now widely used, leaving a lasting mark not only in the history of China but of the world."}]