[{"url": "http://www.thefrisky.com/2013-03-25/dont-panic-7-reasons-your-period-might-be-late-besides-pregnancy/", "passage_text": "Stress: Your emotions, particularly stress, can have a major impact on the regularity of your menstrual cycle. And if you’re stressing about why your period is late, that could actually delay its arrival even more. Miscalculation: The average menstrual cycle is 28 days, but many, many women have shorter or longer cycles and don’t chart them correctly — so it may be that your period is not actually late. Additionally, the majority of women have cycles that are irregular and don’t necessarily realize it."}, {"url": "http://www.clutchmagonline.com/2013/03/dont-panic-7-reasons-your-period-might-be-late-besides-pregnancy/", "passage_text": "2. Stress: Your emotions, particularly stress, can have a major impact on the regularity of your menstrual cycle. And if you’re stressing about why your period is late, that could actually delay its arrival even more. Mother Nature is a cruel mistress! Likelihood That This Is Impacting My Period: High."}, {"url": "http://www.answers.com/Q/How_long_can_your_period_be_late", "passage_text": "Yes. If our period is late it is most likely because you ovulated later. The time that it takes to ovulate each month depends on how long your body reaches this estrogen thres … hold. A woman can in fact ovulate anytime between day 8 and day 22 of her menstrual cycle. My period was 2 days late. when i got my period it was only 2 days long.   Answer   Unless you're having sex, then that might be your answer. But if you're not, it's possible you just have a short period term."}, {"url": "http://www.steadyhealth.com/topics/how-late-can-your-period-be-long-enough-to-be-pregnant--1", "passage_text": "The only advice i can give you is that if you are sexually active with no birth control, you could be pregnant. Which brings me to part 2 of my advice for you, get on some birth control. I am responding 4 days after your post, so things may have changed for the better by now, let us know. Reply. Yes i got my period after 6 days late! i must have beeen REALLY stressed. and i plan on goin on birth control. i hate worrying and this will def relieve me! Reply. Loading... Guest. I know what you're going through! (But this is the first time it has happened to me)."}, {"url": "http://www.webmd.com/women/rm-quiz-period-normal", "passage_text": "For most women, periods usually occur from 21 to 35 days apart. In young girls and teenagers, periods are commonly irregular and have cycles ranging between 21 and 45 days. Keep track of your periods on a calendar (which can help you and your doctor determine what pattern is normal for you). 1  Previous. 2  Continue"}, {"url": "http://www.summitmedicalgroup.com/library/pediatric_health/hhg_period_late_or_missed/", "passage_text": "A menstrual cycle is the time from the day a menstrual period starts to the time the next period starts. The average menstrual cycle is 28 days long. However, a normal cycle can be shorter or longer than this. It may be anywhere from 21 to 35 days long. Most periods last 3 to 5 days, but anywhere from 2 to 7 days is normal. Menstrual cycles may happen around the same date every month or they may be irregular. A menstrual period is considered late if it hasn’t started 5 or more days after the day you expected it to start"}, {"url": "http://www.answers.com/Q/How_long_can_your_period_be_late", "passage_text": "Confidence votes 19. Umm, well if you havnt had sex in the last few days then your not pregnant. But your period can be up to 3 weeks late, if your around the ages 11-16 your period is still irragular which is normal but if your over those ages then i suggest you call your doctor or take a home pregnanvy test. My period was 2 days late. when i got my period it was only 2 days long.   Answer   Unless you're having sex, then that might be your answer. But if you're not, it's possible you just have a short period term."}, {"url": "http://www.steadyhealth.com/topics/how-late-can-your-period-be-long-enough-to-be-pregnant--1", "passage_text": "Guest. My period is late about three days and in April it started on the 30th, May on the 30th, and it is now July 1st and i still havent gotten it? it always starts roughly the 28th to the 31st. and I am really scard because I hope I am not pregnant. Yes i got my period after 6 days late! i must have beeen REALLY stressed. and i plan on goin on birth control. i hate worrying and this will def relieve me! Reply. Loading... Guest. I know what you're going through! (But this is the first time it has happened to me)."}, {"url": "http://www.thefrisky.com/2013-03-25/dont-panic-7-reasons-your-period-might-be-late-besides-pregnancy/", "passage_text": "7. Miscalculation: The average menstrual cycle is 28 days, but many, many women have shorter or longer cycles and don’t chart them correctly — so it may be that your period is not actually late. Additionally, the majority of women have cycles that are irregular and don’t necessarily realize it."}]