[{"url": "http://www.cityofhowell.org/city_departments/waste_water_treatment/index.php", "passage_text": "History. In 1936 the City of Howell built it's first wastewater treatment plant. This plant had a treatment capacity of 500,000 gallons of raw treatment processing per day. The initial cost of the plant was $65,000.00. The plant was upgraded in 1960 to treat up to 1.25 million gallons of sewage per day. This expansion provided the plant with primary settling, secondary activated sludge treatment, chlorination, sludge digestion, and sludge drying beds."}, {"url": "http://nature.berkeley.edu/classes/es196/projects/2010final/YeoK_2010.pdf", "passage_text": "Data from 11 wastewater treatment plants which utilized MBR and/or RO in their wastewater treatment process was gathered and analyzed to show that MBR produced water costs $0.057 per gallon whereas RO produced water costs $0.048 per gallon."}, {"url": "http://www.isws.illinois.edu/pubdoc/C/ISWSC-99.pdf", "passage_text": "The median total yearly operating cost was approximately $1000. Only 16 percent of the values exceed $2700; this conservative value is reasonable for estimating purposes. Conventional Plant Operating Costs Operating cost data for 26 conventional sewage treatment plants were avail­able for analysis. Of these, 19 were activated sludge, 5 trickling filter, and 2 primary plants."}, {"url": "http://www.gbra.org/documents/studies/calhoun/05-CostEstimating.pdf", "passage_text": "These treatment plant operating costs, on a per 1,000 gallon basis, along with the electrical costs for pumping wastewater from the subdivisions to either package treatment plants or regional treatment plants make up the bulk of the operations and maintenance costs for the alternatives evaluated."}, {"url": "http://www.cityofhowell.org/city_departments/waste_water_treatment/index.php", "passage_text": "In 1936 the City of Howell built it's first wastewater treatment plant. This plant had a treatment capacity of 500,000 gallons of raw treatment processing per day. The initial cost of the plant was $65,000.00. The plant was upgraded in 1960 to treat up to 1.25 million gallons of sewage per day. This expansion provided the plant with primary settling, secondary activated sludge treatment, chlorination, sludge digestion, and sludge drying beds."}, {"url": "http://www.podtanks.com/wastewater_systems_comparison.html", "passage_text": "Most people only consider the initial purchase cost of Sewage Treatment systems when looking to buy a new plant. As a result they often pay thousands of pounds more than they anticipated because the installation, emptying and maintenance costs of sewage treatment can be seen as hidden expenses."}]