[{"url": "http://www.rxlist.com/pepcid-side-effects-drug-center.htm", "passage_text": "Pepcid (famotidine) is an H2-blocker used to treat and prevent recurrence of stomach and duodenal ulcers. It is also useful in managing heartburn, gastroesophageal reflux disease and Zollinger-Ellison syndrome. Pepcid (famotidine) is available as a generic drug. Side effects of Pepcid are not common, but may include constipation, diarrhea, fatigue, dizziness, weakness, mood changes, headache, insomnia, muscle pain or cramps, joint pain, dry mouth, nausea, or vomiting. Stop using famotidine and call your doctor at once if you have a serious side effect such as: 1  easy bruising or bleeding; 2  fast or pounding heartbeat; 3  confusion, hallucinations, seizure; 4  numbness or tingly feeling; or."}, {"url": "https://en.wikipedia.org/wiki/Famotidine", "passage_text": "Famotidine (/fəˈmɒtɪdiːn/ l trade name Pepcid) is a histamine H2-receptor antagonist that inhibits stomach acid production. It is commonly used in the treatment of peptic ulcer disease and gastroesophageal reflux disease. In the United States and Canada, a product called Pepcid Complete, which combines famotidine with an antacid in a chewable tablet to quickly relieve the symptoms of excess stomach acid, is available. In the UK, this product was known as Pepcidtwo prior to its discontinuation in April 2015."}, {"url": "http://www.vetinfo.com/famotidine-for-dogs.html", "passage_text": "Using Famotidine in your pet may cause some side effects, although the drug is generally a safe and effective way to treat canine stomach ulcers and inflammation. Famotidine should never be given to dogs with an allergy or sensitivity to the drug. The following are the most common reasons Famotidine is used in canines: 1  For the treatment of gastric and intestinal ulcers (also used to prevent such ulcers). 2  Treating stomach erosions. 3  For the treatment of stomach inflammation, often caused by kidney failure."}, {"url": "http://www.petmd.com/pet-medication/famotidine", "passage_text": "Uses. Famotidine is used to help reduce the amount of stomach acid produced. It aids in the treatment of stomach ulcers that are present and helps prevent ulcer formation. "}, {"url": "http://www.everydayhealth.com/drugs/pepcid", "passage_text": "Pepcid is the brand name for famotidine, a drug that works to reduce the amount of acid your stomach produces. It's available as both a prescription medicine and an over-the-counter (OTC) medicine. Pepcid belongs to a class of drug called histamine-2 or H2 blockers, which work by reducing the amount of acid your stomach produces. The Food and Drug Administration (FDA) gave Marathon Pharmaceuticals approval to market prescription Pepcid in 1986."}, {"url": "http://www.everydayhealth.com/drugs/pepcid", "passage_text": "A: Pepcid (famotidine) is a medication that is used to treat acid reflux and other conditions of the stomach and esophagus. It is in the group of medications called histamine blockers that work by blocking histamine in the stomach, which decreases the amount of acid produced, and relieves your symptoms. Pepcid belongs to a class of drug called histamine-2 or H2 blockers, which work by reducing the amount of acid your stomach produces. The Food and Drug Administration (FDA) gave Marathon Pharmaceuticals approval to market prescription Pepcid in 1986."}, {"url": "http://www.vetinfo.com/famotidine-for-dogs.html", "passage_text": "Overview of Famotidine. Famotidine is an anti-ulcer drug designed to be used for the prevention and treatment of ulcers occurring in the stomach. Famotidine is an H-2 blocker that blocks off H-2 receptors that secrete gastric acids into the stomach. The following are the most common reasons Famotidine is used in canines: 1  For the treatment of gastric and intestinal ulcers (also used to prevent such ulcers). 2  Treating stomach erosions. 3  For the treatment of stomach inflammation, often caused by kidney failure."}, {"url": "http://www.rxlist.com/pepcid-drug.htm", "passage_text": "Stop using famotidine and call your doctor at once if you have a serious side effect such as: 1  easy bruising or bleeding; 2  fast or pounding heartbeat; 3  confusion, hallucinations, seizure; 4  numbness or tingly feeling; or. 5  jaundice (yellowing of the skin or eyes). The active ingredient in PEPCID® (famotidine) is a histamine H2-receptor antagonist. Famotidine is N'(aminosulfonyl)-3-[[[2-[(diaminomethylene)amino]-4-thiazolyl]methyl]thio]propanimidamide. The empirical formula of famotidine is C 8 H 15 N 7 O 2 S 3 and its molecular weight is 337.43."}, {"url": "http://www.vetinfo.com/famotidine-for-dogs.html", "passage_text": "Famotidine for dogs is an anti-ulcer drug used for the treatment and prevention of stomach ulcers and other stomach conditions in dogs. Stomach ulcers in dogs often occur with bloat, kidney failure, use of steroids and the use of NSAIDS in dogs. The following are the most common reasons Famotidine is used in canines: 1  For the treatment of gastric and intestinal ulcers (also used to prevent such ulcers). 2  Treating stomach erosions. 3  For the treatment of stomach inflammation, often caused by kidney failure."}, {"url": "http://www.1800petmeds.com/Famotidine-prod11171.html", "passage_text": "famotidine. What is the most important information I should know about famotidine: Famotidine is a non-prescription medication not FDA approved for veterinary use; however, it is a commonly accepted practice for veterinarians to use this medication in dogs and cats to reduce the amount of stomach acid produced. Famotidine is also used to treat gastritis, esophagitis, and GERD. Famotidine may also be used for purposes other than those listed in this guide. What should I discuss with my veterinarian before giving famotidine to my pet: Tell your veterinarian if your pet has heart, liver, or kidney disease."}]