[{"url": "http://www.themedicalquestions.com/psy/how-much-does-the-average-person-lie.html", "passage_text": "How much does the average person lie. A new survey shows the average person tells 4 lies a day, or 1,460 a year for a total of 88,000 by the age of 60. Health related question in topics Psychology .We found some answers as below for this question How much does the average person lie,you can compare them. A new survey shows the average person tells 4 lies a day, or 1,460 a year for a total of 88,000 by the age of 60. ChaCha on! [ Source: http://www.chacha ..."}, {"url": "https://www.psychologytoday.com/blog/homo-consumericus/201111/how-often-do-people-lie-in-their-daily-lives", "passage_text": "This strikes me as surprisingly low. I have the feeling that many participants were lying about the extent of their lying! (2) Only 40.1% of the sample reported telling a lie in the past 24 hours. (3) 22.7% of all lies were told by one percent of the sample, and half of all of the lies were told 5.3% of the sample."}, {"url": "https://www.psychologytoday.com/blog/homo-consumericus/201111/how-often-do-people-lie-in-their-daily-lives", "passage_text": "This leads to the all-important question: how often do people lie in their daily lives? In a paper published in 2010 in Human Communication Research, Kim B. Serota, Timothy R. Levine, Franklin J. Boster tackled this exact issue in three separate studies. (2) Only 40.1% of the sample reported telling a lie in the past 24 hours. (3) 22.7% of all lies were told by one percent of the sample, and half of all of the lies were told 5.3% of the sample."}, {"url": "http://www.dailymail.co.uk/sciencetech/article-2449632/How-check-phone-The-average-person-does-110-times-DAY-6-seconds-evening.html", "passage_text": "The average person does it 110 times a DAY (and up to every 6 seconds in the evening). 1  People look at their phones the most between peak hours of 5pm and 8pm. 2  During these hours, 75% of users are actively using their devices. 3  This drops to a quarter of active users between 3am and 5am. According to figures collected by a screen lock app, the average user actually checks their phone around 110 times day. During peak times this equates to once every six or seven seconds, with some users unlocking their devices up to 900 times over the course of a day, which in reality is around 18 hours."}, {"url": "http://www.answers.com/Q/How_many_times_a_day_does_an_average_person_lie", "passage_text": "The average human usually has one bowel movement a day. However it is not unusual to have two or more in one day, as is having three in a week. If the person is not uncomfort … able and does not pass hard stools, then it is not a cause for concern. Individuals vary as does elimination patterns. around twice a day A Normal Poops around 3 a day to 3 a week it depends on Who the person is and there really is no average because people can poop 5 times a day or 2 times a … week. 21 people found this useful."}, {"url": "http://www.xmms.org/qna/How_many_times_does_the_average_person_lie_per_day-qna783320.html", "passage_text": "1 18% - What does the average person do 120 times in their lifetime? 2  78% - How many times per day does the average person urinate? 3  83% - How many times does the average person lie in 10 minutes? 4  78% - How many times the average person gets on the computer a day? "}, {"url": "http://www.answers.com/Q/How_many_times_a_day_does_an_average_person_lie", "passage_text": "The average woman lies from about 1 - 5 times a day. The average man lies from about 3 - 9 times a day. The average Teenage Girl lies 3 - 10 times a day. The average Teenage Boy lies 3 - 13 times a day. around twice a day A Normal Poops around 3 a day to 3 a week it depends on Who the person is and there really is no average because people can poop 5 times a day or 2 times a … week. 21 people found this useful."}, {"url": "http://mix97-3.com/how-many-times-do-you-lie-a-day/", "passage_text": "1 56% of liars believe they get away with their lies every day. 2  People usually lie under a time crunch. 3  Most lies told aren’t premeditated and usually slip out when the liar doesn’t have time to think about the consequences of telling the lie. 4  The average person tells their first lie around the age of two. "}, {"url": "https://www.psychologytoday.com/blog/homo-consumericus/201111/how-often-do-people-lie-in-their-daily-lives", "passage_text": "To help us understand lying, we are asking many people to tell us how often they lie.. Participants were asked how many lies they had told in the past twenty-four hours. Here are some of the key findings: (1) The average number of lies told per day was 1.65. (2) Only 40.1% of the sample reported telling a lie in the past 24 hours. (3) 22.7% of all lies were told by one percent of the sample, and half of all of the lies were told 5.3% of the sample."}]