[{"url": "http://landscaping.about.com/od/vines-that-are-poisonous/", "passage_text": "Personally, I value vines for their beauty and versatility. But there are poisonous vines out there of which you should be aware. Also, a number of vines are invasive or highly aggressive. Make sure you learn which ones are toxic if small children or pets spend time out in your landscape."}, {"url": "http://www.hgtvgardens.com/ask-and-share/flowering-plants-discussions/plants-toxic-to-dogs-is-sweet-summer-love-clematis-toxic-to-dogs-00000145-3221-d864-afe7-f6bbc1cf0000", "passage_text": "Clematis is on the ASPCA's list of plants that are toxic to dogs, causing salivation, vomiting, and diarrhea. Whether you are comfortable planting it where your dogs roam really depends on what you know of your dogs' behavior."}, {"url": "http://homeguides.sfgate.com/poisonous-flowering-vines-38852.html", "passage_text": "Wisteria (Wisteria spp.) plants are a group of climbing, woody vines or shrubs that produce large white, blue or violet flowers. Wisteria are grown as climbing vines in many home landscapes, but they can also be trained into tree form. Wisteria seeds contain wisterin, which is a glycoside and a toxic resin. Symptoms of poisoning include nausea, stomach pain, vomiting and diarrhea. 1  Dig This."}, {"url": "http://homeguides.sfgate.com/poisonous-flowering-vines-38852.html", "passage_text": "Virginia creeper is often confused with poison ivy (Toxicodendron radicans), but Virginia creeper’s leaves have five leaflets, where poison ivy only has three. Virginia creeper is also toxic. The berries and leaves of this flowering vine are poisonous, causing nausea, headache abdominal pain and bloody vomiting."}, {"url": "http://www.hgtvgardens.com/ask-and-share/flowering-plants-discussions/plants-toxic-to-dogs-is-sweet-summer-love-clematis-toxic-to-dogs-00000145-3221-d864-afe7-f6bbc1cf0000", "passage_text": "I am planning a new garden and would like to include Sweet Summer Love Clematis but have heard that clematis vines are toxic to dogs. My dogs have never bothered any of my flower beds, but I'm not sure I want to take the chance. I have the perfect place for the vine but its in the area the dogs use most."}, {"url": "http://www.ehow.com/facts_7639056_clematis-toxic.html", "passage_text": "Toxicity. All parts of the clematis plant carry a toxin known as anemonin, or irritant glycoside. Clematis vines prove toxic to humans, cats, dogs and horses. Toxic reactions occur when the plant is eaten, inhaled or touched."}, {"url": "http://www.ehow.com/facts_7639056_clematis-toxic.html", "passage_text": "All parts of the clematis plant carry a toxin known as anemonin, or irritant glycoside. Clematis vines prove toxic to humans, cats, dogs and horses. Toxic reactions occur when the plant is eaten, inhaled or touched."}]