[{"url": "http://www.definitions.net/definition/glycation", "passage_text": "Glycation. Glycation is the result of typically covalent bonding of a protein or lipid molecule with a sugar molecule, such as fructose or glucose, without the controlling action of an enzyme. All blood sugars are reducing molecules. Glycation may occur either inside the body or outside the body"}, {"url": "https://www.sharecare.com/health/healthy-skin/what-is-glycation", "passage_text": "A RealAge answered. Glycation is a natural process in which the sugar in your bloodstream attaches to proteins, forming harmful new molecules called advanced glycation end products (ironically, AGEs for short). Glycation, which occurs when insulin doesn't metabolize sugars properly, destroys the collagen in blood vessels (collagen is a structural protein found all over the body, not just in the skin) and ultimately causes it to become brittle and form plaque."}, {"url": "https://en.wikipedia.org/wiki/Glycation", "passage_text": "From Wikipedia, the free encyclopedia. Glycation (sometimes called non-enzymatic glycosylation) is the result of typically covalent bonding of a protein or lipid molecule with a sugar molecule, such as fructose or glucose, without the controlling action of an enzyme. All blood sugars are reducing molecules. Glycation may occur either inside the body (endogenous glycation) or outside the body (exogenous glycation)."}, {"url": "https://www.sharecare.com/health/healthy-skin/what-is-glycation", "passage_text": "A Dr. Ellen Marmur, MD, Dermatology, answered. A hot topic right now in the skin care world is glycation essentially, the idea that glucose (from carbohydrates and sugars) that you digest may attach to proteins such as collagen in your body and form new molecules called advanced glycation end products, or AGEs. Glycation, which occurs when insulin doesn't metabolize sugars properly, destroys the collagen in blood vessels (collagen is a structural protein found all over the body, not just in the skin) and ultimately causes it to become brittle and form plaque."}, {"url": "https://en.wikipedia.org/wiki/Advanced_glycation_end-product", "passage_text": "In human nutrition and biology, advanced glycation end products, known as AGEs, are substances that can be a factor in the development or worsening of many degenerative diseases, such as diabetes, atherosclerosis, chronic renal failure, and Alzheimer's disease. "}, {"url": "https://www.sharecare.com/health/healthy-skin/what-is-glycation", "passage_text": "Glycation refers to the binding of sugars to proteins. Glycated proteins are the products of nonenzymatic reaction between the free aldehyde group of glucose or other sugars and the free, unprotonated form of amino group of proteins. Glycation, which occurs when insulin doesn't metabolize sugars properly, destroys the collagen in blood vessels (collagen is a structural protein found all over the body, not just in the skin) and ultimately causes it to become brittle and form plaque."}, {"url": "http://www.wisegeek.org/what-is-glycation.htm", "passage_text": "Top 10 unbelievable historical concurrencies. Glycation is a reaction that takes place when simple sugar molecules, such as fructose or glucose, become attached to proteins or lipid fats without the moderation of an enzyme. This results in the formation of rogue molecules known as advanced glycation endproducts (AGEs). Exogenous glycation occurs when you cook sugars with fats/proteins resulting in a maillard reaction that may lead to foods containing carcinogens (2-propenade)."}, {"url": "http://livingto150.com/aging-and-longevity-glycation/", "passage_text": "Glycation is a process where sugar and protein molecules combine to form a tangled mess of tissue. Glycated tissue is tough and inflexible, leading to wrinkling not only of the skin, but also of important internal organs. Furthermore, glycated tissues then produce Aged Glycation End-products [AGEs], which further compound the problem by producing large numbers of damaging free radicals. All in all, glycation is a nightmare process which degrades important body tissues. It must be dramatically reduced if aging is to be minimized."}]