[{"url": "http://www.louis-xiv.de/index.php?id=39", "passage_text": "Louis XIV chose the sun as his emblem. The sun was associated with Apollo, god of peace and arts, and was also the heavenly body which gave life to all things, regulating everything as it rose and set. Like Apollo, the warrior-king Louis XIV brought peace, was a patron of the arts, and dispensed his bounty. "}, {"url": "http://www.ancient.eu/Ashurbanipal/", "passage_text": "Ashurbanipal (668-627 BCE, also known as Assurbanipal) was the last of the great kings of Assyria. His name means the god Ashur is creator of an heir and he was the son of King Esarhaddon of the Neo-Assyrian Empire. Ashurbanipal was a popular king who ruled his citizens fairly but was marked for his cruelty toward those whom he defeated (the best known example being a relief depicting the defeated king with a dog chain through his jaw, being forced to live in a kennel after capture)."}, {"url": "http://www.history.com/topics/charlemagne", "passage_text": "Introduction. Charlemagne (c.742-814), also known as Karl and Charles the Great, was a medieval emperor who ruled much of Western Europe from 768 to 814. In 771, Charlemagne became king of the Franks, a Germanic tribe in present-day Belgium, France, Luxembourg, the Netherlands and western Germany. A+E Networks. Charlemagne (c.742-814), also known as Karl and Charles the Great, was a medieval emperor who ruled much of Western Europe from 768 to 814."}, {"url": "http://en.chateauversailles.fr/history/court-people/louis-xiv-time/louis-xiv-", "passage_text": "Known as “Louis-Dieudonne”, Dieudonné LOUIS xiv was born in 1638 In-Saint-germain-En. Laye crowned king at the age of 5 on the death of his Father LOUIS, xiii the young sovereign received from his, Mother anne Of, austria and From Cardinal, mazarin his, godfather a complete. education The “Grand Century” of Louis XIV was marked by the image of an absolute Monarch and a powerful State. Installed in his royal functions at a very young age, and educated by Cardinal Mazarin, the Sun King built the foundations of absolutism around his own person."}, {"url": "http://www.history.com/topics/louis-xiv", "passage_text": "More disastrous for Louis XIV was the War of the Spanish Succession (1701-1714), in which the aging king defended his grandson Philip V’s inheritance of Spain and its empire. A+E Networks. The reign of France’s Louis XIV (1638-1718), known as the Sun King, lasted for 72 years, longer than that of any other known European sovereign."}, {"url": "http://www.jewishvirtuallibrary.org/jsource/biography/Solomon.html", "passage_text": "King Solomon. Tweet. The biblical King Solomon was known for his wisdom, his wealth and his writings. He became ruler in approximately 967 B.C.E. and his kingdom extended from the Euphrates River in the north to Egypt in the south. His crowning achievement was the building of the Holy Temple in Jerusalem."}, {"url": "https://en.wikipedia.org/wiki/Huey_Long", "passage_text": "Huey Pierce Long, Jr. (August 30, 1893 – September 10, 1935), nicknamed The Kingfish, was an American politician who served as the 40th Governor of Louisiana from 1928 to 1932 and as a member of the United States Senate from 1932 until his assassination in 1935. "}, {"url": "http://www.biography.com/people/philip-ii-9439348", "passage_text": "King Philip II of Spain, also known as Philip the Prudent, ruled one of the world's largest empires. His reign as Spain's king began the Golden Age, a period of great cultural growth in literature, music and the visual arts. He was also the King of England through his marriage to Mary Tudor for four years. The Philippines, a former Spanish colony, are named after him. "}]