[{"url": "https://answers.yahoo.com/question/index?qid=20061027173017AA0aUgu", "passage_text": "Actually, a pint of water weighs 1.04375 pounds. So, although this phrase does not provide the EXACT weight of each liquid, it does provide a very simple rule for determining approximately how much liquids weigh. In the case of water, there are eight (8) pints of water in a gallon. Using this rule, a gallon (eight pints) would weigh approximately eight (8) pounds, which is very, very close to a gallon of water's exact weight of 8.35 pounds which is found in the more detailed and scientifically correct answers to this question. Likewise a gallon of ice and a gallon of room temp water have different weights even though they are the same size. One gallon of water, at 20 degrees Celsius, weighs 8.33 pounds. Gallon: Pounds 8.345404 Grams 3785.4118 Kilograms 3.7854118 Some simple calculations: 2 Pints to the quart. 4 quarts to the gallon."}, {"url": "http://www.answers.com/Q/How_much_does_one_gallon_of_water_weigh", "passage_text": "How much does 1 gallon of calcium chloride weigh One gallon of water weighs about 8.33 pounds. A pint is 16 fluid ounces and 16 fluid ounces of water weighs approximately 16 dry ounces. Two pints to the quart, four quarts to the gallon means eight pints to the gallon, so a gallon weighs about eight pounds."}, {"url": "http://www.discoverdef.com/news/2012/5/11/love%E2%80%99s-and-pilot-increase-def-pump-price-by-$010-per-gallon/", "passage_text": "Love’s and Pilot increase DEF pump price by $0.10 per gallon. Love's Travel Stops and Pilot Flying J truck stop chains have implemented a US $0.10 per gallon increase in the price of Diesel Exhaust Fluid (DEF) at the pump. Between them the two chains account for 82% of the total bulk DEF pump network in North America. Pilot has also increased the price of DEF at the pump by $0.10 per gallon. Pilot has 258 locations offering bulk DEF at the pump, accounting for 55% of the network. This follows Kost USA's announcement of a $0.21 per gallon increase in the price of DEF, one of a number of price increases by national DEF distributors."}, {"url": "http://www.smart-trucking.com/weight-of-diesel-fuel.html", "passage_text": "Use the round figure of 7 lb. per gallon, when calculating the weight.... One hundred gallons = 700 lbs. The weight of diesel does vary somewhat. 1  It weighs a little more than 7 lb. per gallon in Canada, as the gallon is larger, 2  a little less than 7 lb. per gallon in the U.S. , but it is a safe round, easy number to work with when doing a little 'mental math'. 1"}, {"url": "http://www.answers.com/Q/How_much_does_one_gallon_of_diesel_fuel_weigh", "passage_text": "About 7.15 pounds The density of No. 2 diesel fuel is 850 grams/liter = 1.874 pounds/liter = 7.15 pounds per US gallon. Regular gasoline is considerably less dense: 6.0 to 6.3 pounds per gallon … .  Depends on temperature, from 6.9lbs when cold to 7.2 lbs per gallon when warm. Diesel fuel weighs about 7.1 pounds per gallon, so a liter, of which there are 3.8 in a gallon, would weigh about 1.9 pounds. --- Since a litre (liter) is a metric measure, … best to keep the whole answer in metric, don't you think? A litre (liter) of diesel fuel weighs 832grams, or 0.832kg."}, {"url": "http://www.dodge.com/bodybuilder/2011/docs/cc/defscrfaq.pdf", "passage_text": "A. DEF weighs approximately 9 pounds per gallon. Q. What is the freeze point of DEF? A. A 32.5% solution of DEF will begin to crystallize and freeze at 12 deg F (-11 deg C). At 32.5%, both the urea and water will freeze at the same rate, ensuring that as it thaws, the fluid does not become diluted, or over concentrated. A. DEF consumption will be approximately 1-2% of the diesel fuel consumed. Another way to consider it is that DEF will be consumed on a 50 to 1 ratio with diesel. (For every 50 gallons of diesel fuel burned, you will use 1 gallon of DEF)."}, {"url": "http://www.discoverdef.com/news/2012/5/11/love%E2%80%99s-and-pilot-increase-def-pump-price-by-$010-per-gallon/", "passage_text": "Love's increased the price of DEF at the pump by $0.10 per gallon, effective May 7, 2012. Love's continues to operate a two-tier pricing strategy: stores previously stocking DEF at the pump for $2.59 per gallon have increased the price to $2.69, and those who sold it at $2.79 have increased the price to $2.89. Pilot has also increased the price of DEF at the pump by $0.10 per gallon. Pilot has 258 locations offering bulk DEF at the pump, accounting for 55% of the network. This follows Kost USA's announcement of a $0.21 per gallon increase in the price of DEF, one of a number of price increases by national DEF distributors."}, {"url": "https://answers.yahoo.com/question/index?qid=20061027173017AA0aUgu", "passage_text": "There are 8 pints in a gallon and a gallon weighs about 8 lbs. A pint is not exactly a pound but unless you are dealing with a lot of water it won't make much difference. As stated above a gallon (8 pints) weights 8 1/3 lbs. 3 gallons (24 pints) will weigh 25 pounds, 1 pound more than you would expect. Likewise a gallon of ice and a gallon of room temp water have different weights even though they are the same size. One gallon of water, at 20 degrees Celsius, weighs 8.33 pounds. Gallon: Pounds 8.345404 Grams 3785.4118 Kilograms 3.7854118 Some simple calculations: 2 Pints to the quart. 4 quarts to the gallon."}, {"url": "http://trucktanks.com/def-diesel-exhaust-fluid-faqs/", "passage_text": "DEF weighs approximately 9 lbs per gallon. Compared to diesel fuel at approx 7.05 lbs and gasoline at an average of 6.19 lbs, DEF is a relatively heavy product. How much DEF can I haul? With DEF weighing in at around 9lbs per gallon, we estimate that with a tandem axle truck tank you will be able to haul just over 3000 gallons in most states. For trailers the capacity will be around 5,000 gallons."}]