[{"url": "http://crushtheeaexam.com/enrolled-agent-salary/", "passage_text": "The responsibilities for a mid-level position exceed that of an entry-level agent, which explains the difference in pay. Senior level internal revenue agents can earn a healthy income in the accounting world. These higher-paying positions can be between $66,000 and $127,000 annually."}, {"url": "http://www.theincometaxschool.com/blog/what-it-takes-to-become-an-enrolled-agent/", "passage_text": "Posted on September 5, 2013 by Chuck. An Enrolled Agent is the highest credential you can receive as a tax professional. Enrolled Agents are unrestricted as to which taxpayers they can represent, what types of tax matters they can handle, and which IRS offices they can represent clients before."}, {"url": "http://www.answers.com/Q/How_much_does_an_enrolled_agent_make", "passage_text": "Representation is where the money is for Enrolled Agents supplemented by preparation. Handling cases for clients/taxpayers who are in deep with the IRS can be extremely lucrative but you usually work on retainer with an agreed upon hourly rate. Some EA's I know earn $250. That's more than most CPA's! The Enrolled Agent Exam is also much more difficult than the CPA exam."}, {"url": "http://www.answers.com/Q/How_much_does_an_enrolled_agent_make", "passage_text": "Making the world better, one answer at a time. How much an Wnrolled Agent earns is dependent on his/her golas and the amount and type of work they wish to perform. If you are solely going to prepare tax returns and you are new at it, you can expect to wait 3-5 years to see any realy bottom line."}, {"url": "http://crushtheeaexam.com/enrolled-agent-salary/", "passage_text": "According to Payscale.com, entry-level EAs generally begin with a salary of about $23,000 per year, but their pay can vary between $8-$24 per hour. Entry-level agents are primarily tax practitioners."}, {"url": "http://www.naea.org/become-enrolled-agent/becoming-enrolled-agent-faqs", "passage_text": "There are two ways to become an enrolled agent: 1) work for the IRS for five years in a position requiring the interpretation of the tax code; or 2) pass all three parts of the Special Enrollment Exam (SEE) and pass a background check."}, {"url": "http://work.chron.com/certified-public-accountant-vs-enrolled-agent-salary-26658.html", "passage_text": "Agent Salaries. According to the BLS, tax examiners and revenue agents earned nearly 27 percent less than accountants, at an average of $56,050 per year, as of 2012. Like the CPA designation, earning the enrolled agent status can improve salaries for these tax professionals."}]