[{"url": "http://abcnews.go.com/blogs/headlines/2012/01/most-models-meet-criteria-for-anorexia-size-6-is-plus-size-magazine/", "passage_text": "Share. Most runway models meet the body mass index criteria for anorexia, according to an editorial pictorial in the January issue of PLUS Model magazine. Twenty years ago, the average fashion model weighed 8 percent less than the average woman. Today, she weighs 23 percent less, it said. When asked for its source, the magazine cited the website of Rader Programs, which treats those with eating disorders. "}, {"url": "http://www.newmodels.com/height.html", "passage_text": "According to the US Center for Health Statistics, only about 3 % of all young women are within an inch of 5 10 in height. The average weight for those women is about 145-150 pounds some 30+ pounds more than the normal fashion model. If you add in factors like facial beauty, body proportions and all the other things that qualify a girl to apply as a fashion model the competition is a very small p art of the population. "}, {"url": "http://www.healthyhorns.utexas.edu/n_bodyimage.html", "passage_text": "For women: 1  Female models in the U.S. average a size 0 or 00. 2  Very few (if any) women are genetically capable of attaining the body shapes and sizes that are presented in the media. 3  The average American woman is 5 feet 4 inches and weighs about 140 pounds. The average clothing size for women in the U.S. is between a 12-14. It's important to remember that men are not immune to these issues. Even models don't look like the air-brushed images that are displayed in magazines and on billboards. The average American woman is 5 feet 4 inches and weighs about 140 pounds. The average clothing size for women in the U.S. is between a 12-14. It's important to remember that men are not immune to these issues."}, {"url": "http://www.livestrong.com/article/357769-weight-height-for-the-average-american-woman/", "passage_text": "Additionally, the average Hispanic women weighs 160.6 pounds and is 5 feet 2 inches tall, and the average Mexican-American woman weight 161.5 pounds and is also 5 feet 2 inches tall. Here is how the average American woman stacks up against women around the world: Photo Credit JGI/Blend Images/Getty Images. The average weight of American women in 2010 is significantly higher than that of women in 1960, when the average American woman weighed 140.2 pounds -- an increase of 26 pounds."}, {"url": "http://thoughtfulwomen.org/2014/03/19/average-woman-vs-average-model/", "passage_text": "As the average weight of American women has increased, the weight of models has been steadily decreasing for decades. By the 1990s, idealized body images of women in the media had reached an average of 13% to 19% below their expected weight. For context, a weight 15% below expected is a major criteria for the diagnosis of anorexia nervosa. 9 These unrealistic depictions are leading women directly into eating disorders.7. In these teen and women’s magazines, advertisements for diets and weight loss programs are 10 times more common than they are in men’s magazines. Girls are being taught to obsess over their appearance, their weight, and whether their bodies are “good enough.”. The average American woman is 5’4″ tall, and weighs 166 lbs."}, {"url": "https://answers.yahoo.com/question/index?qid=20071112174318AAwK0oQ", "passage_text": "Best Answer: Models, I would guess, are around 110 lbs and 5'10 maybe. Average BMI would be somewhere between 15 - 16.5, which is very underweight. The average healthy woman is probably around 130 lbs at 5'5. Healthy BMI, 20-24. Average BMI, probably would be in the late 20's. average bmi for models:16.3 average weight for models:108-125 average height of models:5'8 average bmi of normal women:28 average weight of normal women:164.3 average height of normal women:5'4 hope i helped!"}, {"url": "https://answers.yahoo.com/question/index?qid=20071112174318AAwK0oQ", "passage_text": "RE: what is the average bmi/weight/height for a runway model today and an average woman? i&#39;m doing a project for school explaining how models are too thin, and portray a bad image for women. i need to know the average bmi for a runway model for a given height and weight, and the same for an average woman today. average bmi for models:16.3 average weight for models:108-125 average height of models:5'8 average bmi of normal women:28 average weight of normal women:164.3 average height of normal women:5'4 hope i helped!"}, {"url": "http://www.answers.com/Q/What_is_the_weight_of_an_average_model_and_how_much_should_you_weigh_if_you_are_5%278%27%27_and_want_to_become_a_model", "passage_text": "The average height for a high fashion model is between 5'10 - 5'11 and the weight is anywhere between 105-130. But remember you should be comfortable with your body about 75% of models are anerexic and mean! 4 people found this useful. Remember that models of an average model weight are not seen often because they are a minority. If every model would have the weight of everyone, they wouldn't be special like they are now. If you need to lose weight, just intake less calories than you lose."}, {"url": "http://thoughtfulwomen.org/2014/03/19/average-woman-vs-average-model/", "passage_text": "83% of adolescent girls read fashion magazines for an average of 4 hours every week. In these teen and women’s magazines, advertisements for diets and weight loss programs are 10 times more common than they are in men’s magazines. Girls are being taught to obsess over their appearance, their weight, and whether their bodies are “good enough.”. The average American woman is 5’4″ tall, and weighs 166 lbs. In comparison, the average model is 5’10” tall and weighs only 107 lbs"}]