[{"url": "https://rangolibygowrisavoor.wordpress.com/public-rangoli-2/", "passage_text": "Rangoli is an ancient ephemeral artform practiced throughout India. Designs are drawn onto the ground, usually in chalk or colored powder and embellished with sand, rice, candles or flower petals. Rangoli is an expression of the creative self, often viewed as a form of self-portraiture. Designs are composed of geometric and curvilinear patterns, usually derived from nature. After the Rangoli is complete, the image is simply allowed to blow away with the wind – serving as a metaphor for the impermanence of life"}, {"url": "http://trendinindia.com/rangoli-designs-row-colors/", "passage_text": "The term Rangoli is a Sanskrit origin. In other parts of the world, there are different names for Rangoli. In Tamil Nadu, it is called Kolam, in Bengal, it is called Alpana, in Rajasthan, and it is called Madana, and so on. Rangoli is a form of welcoming guests and different deities into the house. As it is said ‘Athithi Devo Bhava’, which simply means that guests are a form of God, so everyone should treat them with hospitality. Rangoli brings joy and happiness to everyone. Rangoli designs often brings out an artist in you."}, {"url": "http://rangoli.org/art-culture/what-is-rangoli/", "passage_text": "Rangoli patterns involve a floor design and are usually drawn using rice flour, chalk, fine quartz powder, flower petals, grains or other natural materials made of vegetable dyes. Drawing and connecting simple dots or lines is what usually creates these exquisite floor designs. Rangoli, also referred to as ‘Sand Mandala’, has various names throughout India: Kolam, Alpana, and Rangavalli. Rangoli is meant for the moment or the occasion. Like that of a flower, its freshness is short lived. To the uninitiated, the impermanence of the Rangoli art can be a candle in the wind. Once its purpose is served, it is erased and the ritual is repeated with the same intention and zeal"}, {"url": "http://rangoli.org/art-culture/what-is-rangoli/", "passage_text": "In India, the name Rangoli symbolizes Beauty, Hope, and Tradition. The ritual of drawing Rangoli patterns, a skill handed down from mother to daughter is considered an auspicious welcome sign. Rangoli, also referred to as ‘Sand Mandala’, has various names throughout India: Kolam, Alpana, and Rangavalli. Rangoli is meant for the moment or the occasion. Like that of a flower, its freshness is short lived. To the uninitiated, the impermanence of the Rangoli art can be a candle in the wind. Once its purpose is served, it is erased and the ritual is repeated with the same intention and zeal"}, {"url": "http://www.diwalifestival.org/the-tradition-of-rangoli.html", "passage_text": "Diwali Know Diwali. Rangoli is an Indian traditional or folk art, which is generally created on the floor on some festive occasions. "}, {"url": "https://en.wikipedia.org/wiki/Rangoli", "passage_text": "A Rangoli with mixed colors at Tirunelveli, Tamil Nadu. Rangoli, also known as Kolam or Muggu, is a folk art from India in which patterns are created on the floor in living rooms or courtyards using materials such as colored rice, dry flour, colored sand or flower petals. Rangoli is also created using coloured rice, dry flour, flower petals, turmeric (haldi), Vermillion (Sindoor) and coloured sand. The patterns include the face of Hindu deities, geometric shapes peacock motifs and round floral designs. Many of these motifs are traditional and are handed down by the previous generations."}, {"url": "http://www.answers.com/Q/What_is_a_rangoli", "passage_text": "Traditional use of rangoli is to...   Traditional use of rangoli is to decorate our home entrance. It is made on floor in front of the main entrance of our home(tra … ditionally) or after the main entrance in the house(nowadays). Main purpose is to welcome guests and god in the home as well as to feel the home with joy."}, {"url": "http://www.definitions.net/definition/rangoli", "passage_text": "Rangoli. Rangoli, also known as kolam, is a folk art from India. Rangoli are decorative designs made on living room and courtyard floors during Hindu festivals typically consisting of bright colors. They are meant to be sacred welcoming areas for the Hindu deities. "}, {"url": "http://trendinindia.com/rangoli-designs-row-colors/", "passage_text": "Rangoli, which means a row of colors or layer of colors, is a traditional Indian form of art where women decorate the entrance of their houses early in the morning, especially during the Diwali festival. Rangoli designs competition is often held time to time in different regions of India. Rangoli is a form of welcoming guests and different deities into the house. As it is said ‘Athithi Devo Bhava’, which simply means that guests are a form of God, so everyone should treat them with hospitality. Rangoli brings joy and happiness to everyone. Rangoli designs often brings out an artist in you."}]