[{"url": "http://www.indeed.com/salary/q-Physician-Assistant-Interventional-Radiology-l-Boston,-MA.html", "passage_text": "Average Physician Assistant Interventional Radiology salaries for job postings in Boston, MA are 26% higher than average Physician Assistant Interventional Radiology salaries for job postings nationwide. "}, {"url": "http://www.educationnews.org/career-index/physician-assistant-schools-in-massachusetts/", "passage_text": "In Massachusetts, as the number of physician assistant professionals is growing, the salaries earned by physician assistant professionals are increasing. The mean salary for physician assistant professionals in 2006 was $77,800 per year. And in 2010 the mean salary was $87,760 per year. This growth is mirrored by state trends for all professionals. Within the field of physician assistant, there is a huge variation in pay, with the highest paid physician assistant professionals earning 143% more money than those in the bottom 10% of the pay bracket in Massachusetts state."}, {"url": "http://www.indeed.com/salary/q-Physician-Assistant-l-Boston,-MA.html", "passage_text": "$82,000. Average Physician Assistant salaries for job postings in Boston, MA are 26% higher than average Physician Assistant salaries for job postings nationwide. "}, {"url": "http://www1.salary.com/MA/Boston/Physician-Assistant-Medical-salary.html", "passage_text": "This chart describes the expected percentage of people who perform the job of Physician Assistant-Medical in Boston, MA that make less than that salary. For example 50% of the people who perform the job of Physician Assistant-Medical in Boston are expected to make less than the median. Job Description for Physician Assistant-Medical. Assesses, plans and provides patient care under the supervision of a physician. Examines patient, performs comprehensive physical examinations, and compiles patient medical data, including health history and results of physical examination."}, {"url": "http://www.clinicaladvisor.com/2014-nurse-practitioner--physician-assistant-salary-survey/slideshow/1934/", "passage_text": "The average salary for female PAs earning $20,001 to $149,999 per year is $96,585, with their male counterparts bringing down substantially more: $108,228. Overall 3,635 nurse practitioners and 1,232 physician assistants responded to The Clinical Advisor 2014 Salary Survey in March and April 2014. Next Prev. The average salary among all NPs earning between $20,001 and $149,999/year is $94,881.22 and the average salary among all PAs earning between $20,001and $149,999 per year is $100,497.78."}, {"url": "http://www.clinicaladvisor.com/2014-nurse-practitioner--physician-assistant-salary-survey/slideshow/1934/", "passage_text": "The average salary among all nurse practitioners (NPs) earning between $20,001 and $149,999 per year is $94,881.22. The average salary among all physician assistants (PAs) earning between $20,001and $149,999 per year is $100,497.78. In order to create an industry snapshot, we asked our readers to indicate their current annual salaries, including base pay plus any bonuses, in increments of $5,000 (inclusive). Next Prev. The average salary among all NPs earning between $20,001 and $149,999/year is $94,881.22 and the average salary among all PAs"}, {"url": "http://www.payscale.com/research/US/Job=Physician_Assistant_(PA)/Salary/1a268a2c/Boston-MA", "passage_text": "(United States). The average salary for a Physician Assistant (PA) in Boston, Massachusetts is $87,234 per year. The skills that increase pay for this job the most are Surgery and Critical Care. People in this job generally don't have more than 20 years' experience. Experience has a moderate effect on income for this job. X Total Pay combines base annual salary or hourly wage, bonuses, profit sharing, tips, commissions, overtime pay and other forms of cash earnings, as applicable for this job. It does not include equity (stock) compensation, cash value of retirement benefits, or the value of other non-cash benefits (e.g. healthcare)."}, {"url": "http://www1.salary.com/MA/Boston/Physician-Assistant-Medical-salary.html", "passage_text": "The salary for someone with the job title Physician Assistant-Medical in Boston, MA varies depending on a number of factors. Job Description for Physician Assistant-Medical. Assesses, plans and provides patient care under the supervision of a physician. Examines patient, performs comprehensive physical examinations, and compiles patient medical data, including health history and results of physical examination."}, {"url": "http://www.payscale.com/research/US/Job=Physician_Assistant_(PA)/Salary", "passage_text": "(United States). A Physician Assistant (PA) earns an average salary of $86,619 per year. People in this job generally don't have more than 20 years' experience. A skill in Emergency Medicine is associated with high pay for this job"}]