[{"url": "http://budgeting.thenest.com/average-cost-per-square-foot-add-addition-house-23356.html", "passage_text": "Costs Vary Widely. Nationally, estimates of room addition costs vary from $80 to $250 a square foot. A simple room addition with a basic foundation and no plumbing generally costs at least $100 a square foot with typical internal finishing, no expansion of a heating/cooling unit, and minimal structural changes. The cost per square foot decreases as the size of the addition increases. An addition with a kitchen can run $250 to $300 a square foot, not counting finishing details like appliances and countertops. An addition with a bathroom can cost $125 to $200 a square foot, again with a number of cost variables including type of flooring, shower and tub, plumbing appliances or custom lighting."}, {"url": "http://www.hgtv.ca/renosdiy/article/common-renovating-costs-construction-and-demolition/", "passage_text": "1 If you are planning major changes in your home, then demolition is going to be present on your budget breakdown. 2  Average costs of gutting a house, approximately 1500 square foot in size is $6000 - $7000, with disposal. 3  Insulation, at $1 a square foot. 4  Vapor barriers at $0.70 a square foot. Knocking Down/Rebuilding Walls. 1 "}, {"url": "http://buildersontario.com/house-southern-ontario-cost-square-foot", "passage_text": "Nevertheless, the floor covering increases in direct proportion to the size of space. Thus although a Twelve hundred square foot house could cost $200 per square foot to create, a four thousand square foot home might cost $180 for every sq. ft. to build. This relates to the material used. 3. Size and Layout. The size of homes will certainly affect the cost of building a home. The larger it is, the more it will cost in total dollars. Having said that, the larger it is, the less it’ll cost per square foot."}, {"url": "http://www.habitat.ca/faqp4227.php?articleID=18&iaCurrentCatID=3", "passage_text": "The average cost per square foot of a Habitat home in Canada is seventy dollars. This cost reflects building materials and services only. Any costs associated with acquiring land would be in addition to this. "}, {"url": "http://www.b4ubuild.com/faq/faq_0002.shtml", "passage_text": "Home prices of $55, $66, $72, $80, $84, $92, $110, $118, and $328 per square foot combine to produce an average of $112 per square foot, which is probably a reasonable figure for many areas of the country. However, the difference between the lowest figure and the highest is very substantial. "}, {"url": "http://www.homeadvisor.com/cost/architects-and-engineers/build-a-house/", "passage_text": "Custom home design companies may create custom home plans as well. Their costs typically range from $1.50 per square foot to more than $2.50 per square foot for the total project and home size. For smaller homes, this may be a budget-friendly option. However, for larger homes, this can be a substantial budget item. "}, {"url": "http://www.rijus.com/ontario-house-building-costs.php", "passage_text": "1. Local building permit costs & lay of property: Depending on what municipality/region you build in, pricing for building & development costs can range from as low as $10,000 to $30,000. For example, on a 1,800 square foot home, this translates to a difference of $11.00 per square foot. Building a house on a low-grade property most likely requires extra work in regards to raising the grade and bringing in extra loads of fill. This obviously increases the price. An estimate is just that: ‘an estimate;’ until a clearer picture of what is being built, by whom, and where, is finalized. Generally, we find the ‘price per square foot’ rate to be around: 1  $110-$130 per square foot to build a house your own (self build). 2  $160 - $200 per square foot to hire a custom home builder."}, {"url": "http://www.wireservice.ca/index.php?module=News&func=display&sid=8703", "passage_text": "1. Local building permit costs & lay of property: Depending on what municipality/region you build in, pricing for building & development costs can range from as low as $10,000 to $30,000. For example, on a 1,800 square foot home, this translates to a difference of $11.00 per square foot. Building a house on a low-grade property most likely requires extra work in regards to raising the grade and bringing in extra loads of fill. An estimate is just that: 'an estimate;' until a clearer picture of what is being built, by whom, and where, is finalized. Generally, we find the 'price per square foot' rate to be around: •$110-$130 per square foot to build a house your own (self build). •$160 - $200 per square foot to hire a custom home builder."}]