[{"url": "http://multiculturalbeauty.about.com/od/Skincare/a/How-To-Get-Rid-Of-Dark-Spots-From-Mosquito-Bites.htm", "passage_text": "Bite Me! What Happens When Mosquitoes Bite. When a mosquito bites you, it injects an anticoagulant into the skin to make the blood thinner and flow easier and longer to feast on enough of your blood. In reaction, the skin releases histamine, causing an inflammatory reaction. The skin gets red and forms a bump."}, {"url": "http://theorganicbeautyexpert.com/how-to-get-rid-of-mosquito-bites/", "passage_text": "Preventing Mosquito Bites. After being bit, there are several things that you can do to reduce the effects. However, the best way to take care of mosquito bites is to prevent them before they occur. There are a few things that you can do to keep mosquitoes at bay and save your skin from itching and redness."}, {"url": "http://www.wikihow.com/Get-Rid-of-a-Mosquito-Bite", "passage_text": "If you enjoy outdoor activities in the summertime, and you live in a hot, muggy environment, then you are almost bound to get bitten by pesky mosquitoes. Follow these tips to reduce the swelling, get rid of mosquito bites as quickly as possible, and find out how to prevent them altogether."}, {"url": "http://www.city-data.com/forum/health-wellness/1870105-how-do-you-get-rid-swollen.html", "passage_text": "Reputation: 6627. Yep, I get that reaction often, too, from mosquito and other insect bites. What works for me is an anti-histimine such as Benadryl orally and a topical cream of cortisone. They work in concert to take down the swelling ad itching."}, {"url": "http://scarsandspots.com/how-to-get-rid-of-mosquito-bite-scars/", "passage_text": "When a mosquito bites, it injects an anticoagulant substance into the skin that makes the blood thinner and flow longer without clotting. This way, the mosquito can suck the most amount of blood (sorry, I know that sounds disgusting!) Your skin releases histamine, and an inflammatory reaction begins."}, {"url": "http://www.instructables.com/id/How-To-Get-Rid-Of-A-Mosquito-Bite/", "passage_text": "I am allergic to mosquito bites. When I get one, I am usually in misery for days with pulsing, itchy lumps that last for days. I've tried every over the counter remedy and old wives tale to find relief. This one really works."}]