[{"url": "https://en.wikipedia.org/wiki/Exocrine_gland", "passage_text": "The liver and pancreas are both exocrine and endocrine glands; they are exocrine glands because they secrete products— bile and pancreatic juice —into the gastrointestinal tract through a series of ducts, and endocrine because they secrete other substances directly into the bloodstream. Exocrine glands contain a glandular portion and a duct portion, the structures of which can be used to classify the gland. 1  The duct portion may be branched (called compound) or unbranched (called simple)."}, {"url": "http://mhhe.com/biosci/ap/histology_mh/glands.html", "passage_text": "Glands. Glands of the body are classified as either exocrine or endocrine types. Exocrine glands are glands that retain ducts to body surfaces. During development, endocrine glands lose their contacts to embryological surfaces(ducts) and become isolated as small blocks of tissues. In exocrine glands, products of these cells collect in the duct of the gland and flow toward the surface to which the duct is in contact. Since endocrine glands lack ducts, the product is released across the cell membrane into interstitial spaces around the cells. Diffusion of the product into capillaries follows."}, {"url": "http://www.ncbi.nlm.nih.gov/pubmedhealth/PMHT0022074/", "passage_text": "Exocrine Glands. An organ that makes one or more substances, such as sweat, tears, saliva, or milk. Exocrine glands release the substances into a duct or opening to the inside or outside of the body. NIH-National Cancer Institute"}, {"url": "http://www.medicinenet.com/script/main/art.asp?articlekey=39879", "passage_text": "Exocrine gland: A gland that secretes a substance out through a duct. The exocrine glands include the salivary glands, sweat glands and glands within the gastrointestinal tract. The exocrine glands are the glands of external secretion.. "}, {"url": "http://users.rcn.com/jkimball.ma.ultranet/BiologyPages/E/ExocrineGlands.html", "passage_text": "Exocrine Glands. Exocrine glands are glands whose secretions pass into a system of ducts that lead ultimately to the exterior of the body. So the inner surface of the glands and the ducts that drain them are topologically continuous with the exterior of the body (the skin)"}, {"url": "https://en.wikipedia.org/wiki/Exocrine_gland", "passage_text": "Exocrine glands are glands that produce and secrete substances onto an epithelial surface by way of a duct. Examples of exocrine glands include sweat, salivary, mammary, ceruminous, lacrimal, sebaceous, and mucous. Exocrine glands are one of two types of glands in the human body, the other being endocrine glands, which secrete their products directly into the bloodstream. Exocrine glands contain a glandular portion and a duct portion, the structures of which can be used to classify the gland. 1  The duct portion may be branched (called compound) or unbranched (called simple)."}, {"url": "http://www.differencebetween.net/science/health/difference-between-exocrine-and-endocrine/", "passage_text": "1. Exocrine glands have ducts to carry hormones, while endocrine glands are ductless. 2. Exocrine hormones are released into the external environment, or outside of the body. Endocrine hormones are released into the internal environment, or inside of the body. "}, {"url": "http://mhhe.com/biosci/ap/histology_mh/glands.html", "passage_text": "Endocrine and exocrine glands secrete various products. These include hormones, enzymes, metabolites, and other molecules. In exocrine glands, products of these cells collect in the duct of the gland and flow toward the surface to which the duct is in contact. Since endocrine glands lack ducts, the product is released across the cell membrane into interstitial spaces around the cells. Diffusion of the product into capillaries follows."}, {"url": "http://www.answers.com/Q/What_is_the_difference_between_endocrine_and_exocrine_glands", "passage_text": "Endocrine glands secrete their hormones directly into the bloodstream. Exocrine glands secrete their hormones into a duct that leaves the body externally: for example, sweat glands empty onto the skin. Endocrine gland secretes compounds (hormones) into the blood. Exocrine gland secretes compounds outside of the body (including into the GI tract since the GI tract is topologically outside of the body). Exocrine glands have ducts that carry their secretory product to a surface. These glands include the sweat, sebaceous, and mammary glands and, the glands that secrete digestive enzymes.The endocrine glands do not have ducts to carry their product to a surface."}]