[{"url": "http://healthyeating.sfgate.com/leanest-healthiest-pork-chicken-1612.html", "passage_text": "Fat is high in calories, offering 9 calories per gram. If you normally consume around 1,800 calories per day, you can have 40 to 70 grams of fat. Having a 3-ounce portion of grilled skinless chicken breast or pork loin offers fewer than 150 calories, about 7 grams of fat and 21 grams of protein. Any of these lean cuts of pork or chicken offer approximately 45 calories, 2 to 3 grams of fat and 7 grams of protein per ounce, according to the American Dietetic Association."}, {"url": "http://www.fatsecret.com/calories-nutrition/usda/pork-loin-(tenderloin-lean-only)?portionid=33600&portionamount=4.0", "passage_text": "There are 136 calories in 4 ounces of Pork Loin (Tenderloin, Lean Only). Calorie breakdown: 26% fat, 0% carbs, 74% protein. "}, {"url": "http://www.livestrong.com/article/305886-calories-in-pork-steak/", "passage_text": "A roasted pork tenderloin steak weighing 3 ounces gives you fewer than 125 calories. If you have a broiled blade chop, a 3-ounce boneless cut has around 145 calories, while the same amount of a boneless cooked top-loin chop has closer to 170 calories. Center-cut rib chops generally have the most calories -- over 220 per 3-ounce broiled chop. Pork steaks, more commonly known as chops, aren’t always high in calories. They range from approximately 125 to 220 calories for one serving. Lean and trimmed cuts from the loin have about half as many calories as fattier chops from the rib area"}, {"url": "http://healthyeating.sfgate.com/much-protein-pork-5369.html", "passage_text": "Pork tenderloin is one of the leanest cuts of pork. A 4-ounce cut of broiled pork tenderloin has about 160 calories. Nearly 75 percent of the calories come from protein, while only about 25 percent of the calories come from fat."}, {"url": "http://www.caloriecount.com/calories-pork-i76771", "passage_text": "Italian Pork Loin in a Crockpot. Slow-Cooker Recipe: Spicy Country Ribs. Beef, Loin, Bottom Sirloin Butt, Tri-tip Steak-Separable Lean And Fat, Trimmed To 0 Fat, All Grades, Cooked, Broiled. Beef, Top Loin-Separable Lean And Fat, Trimmed To 0 Fat, Choice, Cooked, Broiled. "}, {"url": "http://healthyeating.sfgate.com/much-protein-pork-5369.html", "passage_text": "Pork Chop. A large grilled pork chop weighing 8 ounces, has around 425 total calories. Pork chops are higher in fat than pork tenderloin. Roughly 52 percent of the total calories come from protein, while the remaining amount comes from fat. This size grilled pork chop has a total of 55 grams of protein, which equates to 220 calories from protein. A 4-ounce cut of broiled pork tenderloin has about 160 calories. Nearly 75 percent of the calories come from protein, while only about 25 percent of the calories come from fat."}, {"url": "http://www.livestrong.com/article/305886-calories-in-pork-steak/", "passage_text": "Photo Credit Thomas Northcut/Photodisc/Getty Images. Pork steaks, more commonly known as chops, aren’t always high in calories. They range from approximately 125 to 220 calories for one serving. Lean and trimmed cuts from the loin have about half as many calories as fattier chops from the rib area"}, {"url": "https://recipes.sparkpeople.com/recipe-calories.asp?recipe=173496", "passage_text": "Calories per Ingredient. Here are the foods from our food nutrition database that were used for the nutrition calculations of this recipe. Calories per serving of Baked Pork Steak. 491 calories of Pork, fresh, loin, blade (chops or roasts), bone-in, separable lean and fat, raw, (0.38 lb). 27 calories of Flour, white, (0.06 cup). "}, {"url": "http://calorie-data.com/foods/view/18-264", "passage_text": "* See the NHS Livewell pages for more information on food traffic light labelling. For additional nutritional data about Pork, loin steaks, raw, lean and fat including fibre, sugars, vitamins, minerals, fatty acids and more see the data table below. "}]