[{"url": "http://www.testmasters.com/sat/faq", "passage_text": "The SAT Reasoning Test is a test students usually take for college admissions. The test has three sections: Critical Reading, Writing, and Math, and is about three hours and 45 minutes long. Most people agree that the SAT is the single most important test students can take in high school."}, {"url": "https://greentestprep.com/resources/sat-prep/q-a/find-view-sat-scores/", "passage_text": "Once you take your SAT, it takes about three weeks for the College Board to grade your exam and post your scores online. "}, {"url": "http://www.answers.com/Q/How_long_does_the_ACT_test_take", "passage_text": "Introduced in the 1960s, the ACT has become a viable alternative to the SAT when it comes to college admissions testing. Comprised of four mandatory sections (English, Math, Reading, Science) and one optional (Writing), the ACT is not only structured differently from the SAT, but also shorter. In total, with the optional writing section, the ACT sections take 2 hours and 55 minutes to complete. Once breaks and test administration time are added in, students can expect to spend four hours on the ACT"}, {"url": "http://blog.prepscholar.com/how-long-is-the-act", "passage_text": "Learn the ins and outs of ACT timing so you can study to maximize your time on the ACT. ACT Test Length The ACT is 2 hours and 55 minutes long (or 175 minutes), but 3 hours and 35 minutes long (215 minutes) if you take the ACT Plus Writing. Each section is given in one chunk, and takes between thirty and sixty minutes."}, {"url": "http://blog.prepscholar.com/how-long-is-the-act", "passage_text": "Time Pressure on the ACT Despite the fact that the ACT is almost three hours long (or three and a half hours if you take the ACT Plus Writing), the time pressure can be intense. This table illustrates about how much time you have to spend on each question on the ACT. The ACT is 2 hours and 55 minutes long (or 175 minutes), but 3 hours and 35 minutes long (215 minutes) if you take the ACT Plus Writing."}, {"url": "http://cms.ysu.edu/administrative-offices/testing-center/faqs-placement-testing", "passage_text": "Sample questions for the Math and Reading tests can be found at www.act.org/compass/sample. The Composition test is a forty minute written essay; there is no sample information provided for this exam. Q: How long do the tests take? A: We recommend that you plan on taking one hour for each test that you require. "}, {"url": "http://www.collegecountdown.com/test-prep/act-practice/frequently-asked-questions-about-the-act.html", "passage_text": "It takes a total of 2 hours and 55 minutes to complete the four sections of the ACT. If you take the 30-minute optional writing section, the test lasts a total of 3 hours and 25 minutes. See an overview of how the ACT is structured. This answer is provided by Dr. Gary Gruber. Generally, if you take the ACT or SAT and score well, you will probably score about as well on the other test. While both tests cover many of the same subject areas, like reading comprehension and math, the ACT often requires more knowledge of the material you learn in high school than the SAT does."}]