[{"url": "http://www.quomon.com/44777/What-is-an-average-CPU-Temperature-for-a-laptop-computer", "passage_text": "An average CPU Temperature for a laptop computer is around 65to 70 degree celcious as well it depends on the speed of the laptop computer you can use. Idle temperature varied depending on what kind of processor and cooling setup you have. FULL LOAD temperature (meaning the laptop is working hard) can vary anywhere from 50-100+ degrees celcius. I think most people would agree that anywhere above 70 degrees celcius is getting on the warm side."}, {"url": "http://smallbusiness.chron.com/average-heat-output-computer-69494.html", "passage_text": "The Average Heat Output of a Computer. A laptop generates much less heat than a desktop PC. Jupiterimages/Brand X Pictures/Getty Images. Every computing device produces heat in proportion to the electricity it consumes. In desktop PCs, the microprocessor gets its own fan. By themselves, these chips generate from a few watts of heat to nearly 100 watts, depending on the device and application. The graphics processor, a separate calculating chip, also generates considerable heat."}, {"url": "http://web2.clarkson.edu/projects/subramanian/ch302/notes/Convective%20Heat%20Transfer%201.pdf", "passage_text": "Heat transfer to or from a fluid flowing through a tube R. Shankar Subramanian A common situation encountered by the chemical engineer is heat transfer to fluid flowing through a tube. This can occur in heat exchangers, boilers, condensers, evaporators, and a host of other process equipment. Remember that the purpose of using a heat transfer coefficient is to calculate the heat flux between the wall and the fluid. In the case of uniform wall flux, we can use an energy balance directly to infer the way in which the bulk average temperature of the fluid changes with distance along the axial direction."}, {"url": "http://www.pcper.com/reviews/Cases-and-Cooling/General-Fan-Performance-Guide/Air-Velocity-and-Heat-Sink-Fans", "passage_text": "For case cooling, volumetric flow rate and air temperature are all that really matter. For cooling a heat sink, however, air velocity is also critical. Air velocity is one of the biggest determinants of the convection coefficient. Average air velocity at the fan is defined as flow rate divided by fan area. As air leaves the fan, it will not remain a fixed diameter column of moving air. It will disperse and its average velocity will drop. As it disperses, it will entrain some of the surrounding, static air. To compare the air velocity of different fans, divide the rated flow by the fan diameter squared. As an example, a 60mm fan pumping 38CFM yields a relative velocity of .0106 while an 80mm fan pumping the same volume yields .0059. The air velocity from the 60mm fan will be 78% higher resulting in better air convection."}, {"url": "http://www.quomon.com/44777/What-is-an-average-CPU-Temperature-for-a-laptop-computer", "passage_text": "IDLE temperature (meaning the laptop is not doing anything) around 30-50 degrees celcius is perfectly normal. Idle temperature varied depending on what kind of processor and cooling setup you have. FULL LOAD temperature (meaning the laptop is working hard) can vary anywhere from 50-100+ degrees celcius. I think most people would agree that anywhere above 70 degrees celcius is getting on the warm side."}, {"url": "http://www4.ncsu.edu/~doster/NE400/Text/HeatExchangers/HeatExchangers.PDF", "passage_text": "Example: (From Holman, Heat Transfer 3rd Edition) Water with a mass flow rate of 30,000 lbm/hr is heated from 100 to 130 F in a tube and shell heat exchanger. A single pass of water at 15,000 lbm/hr and 200 F is used on the shell side as the heating fluid. "}, {"url": "http://web2.clarkson.edu/projects/subramanian/ch302/notes/Convective%20Heat%20Transfer%201.pdf", "passage_text": "Principal differences between heat transfer in laminar flow and that in turbulent flow In discussing heat transfer to or from a fluid flowing through a straight circular tube, it is useful to distinguish between the axial or main flow direction, and the directions that lie in a plane perpendicular to the tube axis. Remember that the purpose of using a heat transfer coefficient is to calculate the heat flux between the wall and the fluid. In the case of uniform wall flux, we can use an energy balance directly to infer the way in which the bulk average temperature of the fluid changes with distance along the axial direction."}, {"url": "https://en.wikipedia.org/wiki/Heat_pipe", "passage_text": "At the hot interface of a heat pipe a liquid in contact with a thermally conductive solid surface turns into a vapor by absorbing heat from that surface. The vapor then travels along the heat pipe to the cold interface and condenses back into a liquid-releasing the latent heat. The advantage of heat pipes over many other heat-dissipation mechanisms is their great efficiency in transferring heat. A pipe one inch in diameter and two feet long can transfer 12,500 BTU (3.7 kWh) per hour at 1,800 °F (980 °C) with only 18 °F (10 °C) drop from end to end."}, {"url": "http://smallbusiness.chron.com/average-heat-output-computer-69494.html", "passage_text": "Components and Heat. A handful of components inside a computer account for most of the heat it produces. In desktop PCs, the microprocessor gets its own fan. By themselves, these chips generate from a few watts of heat to nearly 100 watts, depending on the device and application. The graphics processor, a separate calculating chip, also generates considerable heat."}, {"url": "http://www.tomshardware.com/forum/69328-63-laptop-temperature-normal", "passage_text": "February 13, 2013 10:42:25 AM. Touch your laptop, and that's the best way to tell if it is over-heating. From the temperatures that you post, it's a bit high. Keep your laptop on a hard surface while using it, rather than on pillows or beds, to maintain proper air-flow. "}]