[{"url": "http://www.merckmanuals.com/home/hormonal-and-metabolic-disorders/biology-of-the-endocrine-system/endocrine-function", "passage_text": "The main function of endocrine glands is to secrete hormones directly into the bloodstream. Hormones are chemical substances that affect the activity of another part of the body (target site). In essence, hormones serve as messengers, controlling and coordinating activities throughout the body. In contrast, thyroid hormone, produced in the thyroid gland, affects cells throughout the body and is involved in such important functions as regulating growth of cells, controlling the heart rate, and affecting the speed at which calories are burned."}, {"url": "http://www.innovateus.net/health/what-function-ovaries", "passage_text": "The ovaries are the primary source of the female hormones. The female hormones are: 1  Estrogen: Estrogen is secreted by a number of cells in the follicle. 2  On the way to ovulation, the follicle that has the maturing egg goes through the surface of the ovary."}, {"url": "http://www.innovateus.net/health/what-function-ovaries", "passage_text": "The ovary is an ovum-producing reproductive organ, often found in pairs as part of the vertebrate female reproductive system. Ovaries are oval-shaped endocrine system glands, the group of glands that produce a variety of hormones human body needs to function appropriately. Ovaries are found in females, one on each side of the uterus. An ovum is a female reproductive cell. The female hormones are: 1  Estrogen: Estrogen is secreted by a number of cells in the follicle. 2  On the way to ovulation, the follicle that has the maturing egg goes through the surface of the ovary."}, {"url": "https://quizlet.com/1377520/hormone-function-main-hormones-flash-cards/", "passage_text": "Hormone produced by the pancreas that is released when stimulated by elevated glucose levels. This hormone decreases blood sugar levels by accelerating the transport of glucose into the body cells where it is oxidized for energy or converted to glycogen or fat for storage. Produced by the thyroid gland and decreases the blood calcium levels by stimulating calcium deposit in the bones (calcitonin keeps the bone in). The antagonist of the parathyroid hormone."}, {"url": "http://www.answers.com/Q/What_are_the_general_functions_of_hormones", "passage_text": "1 Hormones are chemicals produced by the glands of your endocrine system in response to changes in your body. 2  They are produced to restore homeostasis-the normal, healthy and…. 3  Using Hormones to Get Bigger Breasts During puberty, the pituitary gland activates and the body is flooded with hormones. Hormones are chemical messengers produced by cells that bind to receptors on the plasma membrane of other cells or enter other cells and alter the metabolic function of these cells."}, {"url": "http://www.answers.com/Q/What_are_five_functions_of_hormones", "passage_text": "1 Hormones are chemicals produced by the glands of your endocrine system in response to changes in your body. 2  They are produced to restore homeostasis-the normal, healthy and…. 3  Using Hormones to Get Bigger Breasts During puberty, the pituitary gland activates and the body is flooded with hormones. Luteinizing hormone (LH, also known as lutropin) is a hormone produced by the anterior pituitary gland. In females, an acute rise of LH called the LH surge triggers ovulation … and development of the corpus luteum."}, {"url": "http://www.mydr.com.au/health-images/thyroid-gland-and-thyroid-hormones", "passage_text": "The primary function of your thyroid gland is to secrete thyroid hormones, which are responsible for controlling your body’s metabolism. The 2 main thyroid hormones are T3 (triiodothyronine) and T4 (thyroxine). The amount of thyroid hormones secreted is controlled by another hormone, called thyroid stimulating hormone (TSH), which is released from the pituitary gland in your head. Another hormone that’s produced in your thyroid gland is called calcitonin. This hormone, secreted by a small population of cells known as C cells, is involved in regulating the level of calcium in your blood. Last Reviewed: 02 July 2009."}, {"url": "https://en.wikipedia.org/wiki/Endocrine_gland", "passage_text": "Endocrine glands are glands of the endocrine system that secrete their products, hormones, directly into the blood rather than through a duct. The major glands of the endocrine system include the pineal gland, pituitary gland, pancreas, ovaries, testes, thyroid gland, parathyroid gland, hypothalamus and adrenal glands. The hypothalamus and pituitary gland are neuroendocrine organs. "}, {"url": "https://www.sharecare.com/health/endocrine-system/what-role-hormones-in-body", "passage_text": "Put simply, hormones are the body’s little messengers, which get produced in one part of the body, such as the thyroid, adrenal or pituitary gland, pass into the bloodstream or other body fluid, and go to distant organs and tissues where they act to modify structures and functions. "}]