[{"url": "https://en.wikipedia.org/wiki/Platen", "passage_text": "The platen tends to be the heaviest and strongest part of the press due to the massive forces that it has to withstand. A platen for a 5000-ton press can weigh up to 350 tons. In manufacturing, a platen is a flat plate of a press utilized in laminate, plastic and forest product industries. A platen is typically heated with oil, water, steam or electricity and is used in the production of furniture, tires, gaskets, particle board, composite heaters and plywood. The platen sits between two steel rolls which deliver the moving force to the sanding belt. Sanding heads with a platen are used on finish sanding with papers of finer grits, when the coarser ones are typically used with contact drum type sanding heads. Stock is fed into and out of the machine on a conveyor belt."}, {"url": "http://support-sg.canon-asia.com/contents/SG/EN/8200719700.html", "passage_text": "With a clean, soft, lint-free cloth, wipe the Platen Glass (A), the inner side of the Document Cover (white sheet) (B), the glass of the ADF (C), and the inner side of the ADF (white area) (D) gently. Be sure not to leave any residue, especially on the Platen Glass. "}, {"url": "http://www.computerhope.com/jargon/p/platen.htm", "passage_text": "1. When referring to printing, a platen is a rolling or plate mechanism that impacts the paper with ink creating text or an image. 1  Computer printer help and support. "}, {"url": "http://www.audioenglish.org/dictionary/platen.htm", "passage_text": "• PLATEN (noun). The noun PLATEN has 3 senses: 1. work table of a machine tool. 2. the flat plate of a printing press that presses the paper against the type. 3. the roller on a typewriter against which the keys strike. Familiarity information: PLATEN used as a noun is uncommon."}, {"url": "http://www.thefreedictionary.com/platen", "passage_text": "platen. n. 1. (Printing, Lithography & Bookbinding) a flat plate in a printing press that presses the paper against the type. 2. (Printing, Lithography & Bookbinding) the roller on a typewriter, against which the keys strike. 1. The roller in a typewriter that serves as the backing for the paper against which the type bars strike. 2. The roller in a printer against which the print head strikes. 3. A flat plate or rolling cylinder in a printing press that positions the paper and holds it against the inked typ"}, {"url": "https://en.wikipedia.org/wiki/Platen", "passage_text": "In office copiers and scanners, the platen is a flat glass surface on which operators place papers or books for scanning. The platen is also called the flatbed. Platens are also used in some printers, such as the Dot-matrix printer. The platen sits between two steel rolls which deliver the moving force to the sanding belt. Sanding heads with a platen are used on finish sanding with papers of finer grits, when the coarser ones are typically used with contact drum type sanding heads. Stock is fed into and out of the machine on a conveyor belt."}, {"url": "http://www.merriam-webster.com/dictionary/platen", "passage_text": "Definition of PLATEN. 1. : a flat plate; especially: one that exerts or receives pressure (as in a printing press). 2. : the roller of a typewriter or printer. ADVERTISEMENT"}, {"url": "https://en.wikipedia.org/wiki/Platen", "passage_text": "A platen (or platten) is typically a flat metal (or earlier, wooden) plate pressed against a medium (such as paper) to cause an impression in letterpress printing. The platen sits between two steel rolls which deliver the moving force to the sanding belt. Sanding heads with a platen are used on finish sanding with papers of finer grits, when the coarser ones are typically used with contact drum type sanding heads. Stock is fed into and out of the machine on a conveyor belt."}]