[{"url": "http://www.healthsafetytest.co.uk/answers/3499/how-long-is-your-cscs-pass-valid-for", "passage_text": "It depends which card you are applying for. Most of the CSCS cards are valid for 2-5 years. For more information, please visit http://www.healthsafetytest.co.uk/cscs-card.html or call a member of our support team on 0203 051 1004."}, {"url": "http://www.helpcentreuk.com/cscs-card/", "passage_text": "Most of the CSCS cards are valid for 5 years. The only exception is the Trainee cards (for people who are in the process of gaining their qualifications). Trainee cards are temporary and are valid for 1 or 3 years (duration depends on the course the person is taking). Cookies. This site uses cookies. We have already set cookies which are essential for the operation of this site. Cookies are small files that get saved to your computer from our website.They help us identify your browser's previous activity and preferences on our website without identifying you personally."}, {"url": "http://www.citb.co.uk/cards-testing/construction-skills-certificate-scheme-cscs/", "passage_text": "Quick guide-for individuals and employers wanting to apply for a CSCS card: Individuals-how to apply for your own card. 1  Use cscs.uk/com/cardfinder to find out which card you need. 2  Make sure you have passed the CITB Health, safety and environment test in the last 2 years (exemptions can be found at cscs.com.uk/test). 3  Call 0344 994 4777 and pay £30 using your debit or credit card. How to apply for a CSCS Labourer card and the recent requirement changes. The requirements for labourers changed in July 2014. If you are a labourer, take a look at the guidance video to find out about CSCS card requirements and how to get a card."}, {"url": "http://www.constructionsupport.co.uk/cscs-card/pqp/", "passage_text": "This card is only available if you are a member of one of the CSCS approved professional bodies. You will have to provide a copy a valid professional membership certificate or card when applying. "}, {"url": "http://www.constructioncard.co.uk/answers/762/how-long-is-cscs-valid-for", "passage_text": "Cookies. This site uses cookies. We have already set cookies which are essential for the operation of this site. Cookies are small files that get saved to your computer from our website.They help us identify your browser's previous activity and preferences on our website without identifying you personally."}, {"url": "http://www.constructionsupport.co.uk/answers/179/how-long-is-a-cscs-card-valid-for", "passage_text": "Health & Safety Test Every person wishing to work on a construction site in the UK needs to pass a health and safety test. Passing is also necessary to apply for a skill card such as a CSCS card. Book Health & Safety Test…. CSCS, JIB Cards Required by most construction sites, skill cards show your qualifications skills, and health & safety test pass. This site uses cookies. We have already set cookies which are essential for the operation of this site. Cookies are small files that get saved to your computer from our website.They help us identify your browser's previous activity and preferences on our website without identifying you personally."}, {"url": "https://www.ecscard.org.uk/FAQs", "passage_text": "The time an ECS card is valid for will depend on the card type and the rules of the scheme. Typically an ECS craft card will be valid for a maximum of 3 years, however, some ECS cards have a shorter validity period. An ECS craft card is valid for 3 years, ECS Adult Trainee cards are valid for 24 months with Conditional and Provisional cards valid for 18 months."}, {"url": "https://uk.answers.yahoo.com/question/index?qid=20101021052210AAk0TzO", "passage_text": "Best Answer: Yes you should apply for a new card, because your cscs card determine your position on the site (with some companies e.g St. Georges and Barkley Homes). If you have NVQ's and Diplomas now then your cscs is no longer valid. Also its true that you may need to redo the test every two years. I have one myself but I don't use it anymore because i change my career. There is more on that here http://www.cscs.uk.com/. To check if you card is valid: http://www.cscs.uk.com/card-check Good Luck."}, {"url": "http://www.constructionawards.co.uk/Cards/types/Skilled-Worker.html", "passage_text": "You are welcome to apply for the Skilled Workers CSCS card once you have sat your Health, Safety and Environment test. This card comes in two colours. If you have achieved an NVQ Level 1, you will be issued with a green card; if you have achieved an NVQ or SVQ Level 2 you will receive a Blue card. The card is valid for five years and is renewable on application. For more information on what each card indicates and to find out which test you need to take, have a look at our CSCS Card Types. If you are ready to book your exam, have a look at the preparation materials Construction Awards can offer."}, {"url": "http://www.constructioncard.co.uk/answers/762/how-long-is-cscs-valid-for", "passage_text": "It depends which card you are applying for. The CSCS cards are valid from 2 - 5 years. To apply online or get more information about the CSCS cards, please visit: http://www.constructioncard.co.uk/cscs-card. This site uses cookies. We have already set cookies which are essential for the operation of this site. Cookies are small files that get saved to your computer from our website.They help us identify your browser's previous activity and preferences on our website without identifying you personally."}]