[{"url": "https://en.wikipedia.org/wiki/Yoghurt", "passage_text": "Yogurt is made by inoculating certain bacteria (starter culture), usually Streptococcus thermophilus and Lactobacillus bulgaricus, into milk. Starter culture may be provided by a pre-packaged powder or an amount of existing yogurt with live bacteria. Worldwide, cow 's milk, the protein of which is mainly casein, is most commonly used to make yogurt. Milk from water buffalo, goats, ewes, mares, camels, and yaks, however, is also used to produce yogurt in various parts of the world."}, {"url": "http://www.wisegeek.com/what-are-the-different-types-of-bacteria-in-yogurt.htm", "passage_text": "Different types of bacteria in yogurt commonly include Lactobacillus bulgaricus, Streptococcus thermophilus, and, in some cases, Lactobacillus acidophilus, Lactobacillus casei, and bifidobacteria. The process of pasteurization destroys the active bacterial cultures that make yogurt so healthy and beneficial. The bacteria in yogurt can help one's digestive system, as well as help women prevent yeast infections. A man making yogurt. Acidophilus, often called a good bacteria or probiotic, is found in yogurt"}, {"url": "http://www.livestrong.com/article/349067-list-of-good-bacteria-in-yogurt/", "passage_text": "A bowl of yogurt with fresh fruit. Photo Credit abdone/iStock/Getty Images. Yogurt is made by fermenting many types of milk -- including whole, skim, and evaporated milk -- with lactic acid bacteria. These beneficial bacteria are usually from the types called lactobacillus bulgaricus and Streptococcus thermophilus. Bifidobacterium are a type of good bacteria found naturally in healthy gastrointestinal systems, and also in fermented foods such as yogurt. Some commercial yogurts feature the probiotic Bifidobacterium strains B. animalis and B. lactis."}, {"url": "http://www.milk.co.uk/page.aspx?intPageID=81", "passage_text": "Yogurt is produced through the fermentation of milk by lactic acid bacteria, usually lactobacillus bulgarius and Streptococcus thermophilus. The milk is firstly heat treated, homogenised and is then cooled to allow the addition of bacteria or starter culture. "}, {"url": "http://www.aboutyogurt.com/index.asp?bid=27", "passage_text": "Lowfat and nonfat: There are three types of yogurt: regular yogurt, lowfat yogurt and nonfat yogurt. Yogurt made from whole milk has at least 3.25 percent milk fat. Lowfat yogurt is made from lowfat milk or part-skim milk and has between 2 and 0.5 percent milk fat. "}, {"url": "http://science.howstuffworks.com/innovation/edible-innovations/yogurt1.htm", "passage_text": "Yogurt Bacteria. To understand how yogurt works, you first have to understand how the bacteria in yogurt work. The good bacteria in yogurt are often called probiotics. They come in the form of culture concentrates in certain foods, dietary supplements and fermented dairy products, like yogurt or cheese [source: WHO ]. Probiotics are usually bacteria, but yeast can act as a probiotic, too. These good bacteria are used to ferment milk. "}, {"url": "https://en.wikipedia.org/wiki/Yoghurt", "passage_text": "The bacteria used to make yogurt are known as yogurt cultures. Fermentation of lactose by these bacteria produces lactic acid, which acts on milk protein to give yogurt its texture and characteristic tang. Worldwide, cow 's milk, the protein of which is mainly casein, is most commonly used to make yogurt. Milk from water buffalo, goats, ewes, mares, camels, and yaks, however, is also used to produce yogurt in various parts of the world."}, {"url": "http://www.livestrong.com/article/349067-list-of-good-bacteria-in-yogurt/", "passage_text": "Lactobacillus is a broad name for one type, or genus, of bacteria. The many species of lactobacillus are found naturally in our digestive and urinary tracts, and also in fermented foods such as yogurt. Yogurt is most commonly made with lactobacillus bulgaricus, lactobacillus acidophilus, L. animalis and L. casei. Bifidobacterium are a type of good bacteria found naturally in healthy gastrointestinal systems, and also in fermented foods such as yogurt. Some commercial yogurts feature the probiotic Bifidobacterium strains B. animalis and B. lactis."}, {"url": "https://en.wikipedia.org/wiki/Yoghurt", "passage_text": "Dairy yogurt is produced using a culture of Lactobacillus delbrueckii subsp. bulgaricus and Streptococcus thermophilus bacteria. In addition, other lactobacilli and bifidobacteria are also sometimes added during or after culturing yogurt. Worldwide, cow 's milk, the protein of which is mainly casein, is most commonly used to make yogurt. Milk from water buffalo, goats, ewes, mares, camels, and yaks, however, is also used to produce yogurt in various parts of the world."}]