[{"url": "http://www.healthcareworkersalary.com/physicians/cardiothoracic-surgeon-salary/", "passage_text": "Cardiothoracic Surgeon Salary. The median annual cardiothoracic surgeon salary in the United States is a hefty $412,000. This equates to about $198 per hour. This is well in the range of the middle 50% of surgeons, which is between $332,000 and $514,000. The hourly rates for these ranges can be between $164 and $247 respectivel"}, {"url": "http://www.personalhealthinsurance.com/how-much-does-a-heart-surgeon-make/", "passage_text": "Starting salaries can range from $150,000 to $250,000 for cardiologists. Salaries will increase with years of experience, and the average heart surgeon makes around $300,000 to $500,000 a year. Those in high-paying areas or with very many years of experience can make well over $500,000 annually. "}, {"url": "http://www.answers.com/Q/How_much_do_heart_surgeons_earn", "passage_text": "surgeons make $191,580 annually. neurosurgeon $190,000-$700,000  plastic surgeon $200,000-$1,100,000  oral surgeon $150,000-$400,000  heart surgeon $170000-$600,000 Answer   It depends on the number of customers (patients) and how much profit they average per customer. 1 In the UK, a heart cardiothoracic surgeon: between £200000 and £400000 ($325000). 2  heard of heart surgeons making 1.5 million annually, some making 500,000 depending on how much effort and time put in. ~ 3 500,000 dollars a year. 4  Around $4000 an hour."}, {"url": "http://www.answers.com/Q/How_much_do_heart_surgeons_earn_monthly", "passage_text": "The average salary for an orthopedic surgeon is  between $122,000 and $549,000 per year. 1 million for 6 months It depends on the number of customers (patients) and how much  profit they average per customer. MOST doctors are businessmen who  make money the same as any other business; income-expenses =  profit. In 2009, the average yearly salary for an Orthopedic Surgeon was $219,770. There are other factors to take into account such as location, employer, etc. 300,000 The median exp … ected salary for a typical Surgeon-Orthopedic in  the United States is $426,732."}, {"url": "http://work.chron.com/much-can-heart-surgeon-earn-29488.html", "passage_text": "Heart surgeons are classified as a type of thoracic surgeon, or surgeons of the chest area. All thoracic surgeons undergo the same training, but some choose to specialize in the heart, blood vessels of the chest, lungs or other areas. According to the Profiles physician salary survey, cardiac and thoracic surgeons received median starting salaries of $360,000 annually in 2011. This is the third-highest starting pay, after orthopedic surgery of the spine, paying $465,000 the first year, and neurological surgery, paying $395,000. After six years of surgical practice, the average annual income of a cardiac or thoracic surgeon has increased to $522,875, according to the Profiles salary survey."}, {"url": "http://www.healthcare-salaries.com/physicians/cardiac-surgeon-salary", "passage_text": "Cardiac surgeon salary in the USA. A Cardiac surgeon owns one of the highest paying jobs among surgeons. Typically a cardiac surgeon receives an annual salary of $82,976 – $525,132 in the US with average salary of $296,148 per annum. Cardiac surgeon’s salary differs from state to state. For instance, cardiac surgeons in New York earn an average yearly income of $60,402 to $477,158. Those who practice in California collect an average annual salary from between $57,674 to $489,357. Payscale noted that the average national salary of a cardiac surgeon in the US is from between $78,073 to $497,084 with total bonuses of up to 68,840 per year. The top earning Cardiac Surgeon can earn up to 525,132 yearly salaries. A Cardiac surgeon’s salary in the US varies according to number of years of experience."}, {"url": "http://www.healthcare-salaries.com/physicians/cardiac-surgeon-salary", "passage_text": "The average cardiac surgeon’s annual salary in Australia is from between AU$61,674 to AU$206,450. The average earning for a cardiac surgeon in Australia per annum is AUS$161,191. A Cardiac Surgeon with 1 to 4 years of experience receive an average of AU$60,000 to AU$225,000 per annum. Payscale noted that the average national salary of a cardiac surgeon in the US is from between $78,073 to $497,084 with total bonuses of up to 68,840 per year. The top earning Cardiac Surgeon can earn up to 525,132 yearly salaries. A Cardiac surgeon’s salary in the US varies according to number of years of experience."}, {"url": "http://work.chron.com/much-can-heart-surgeon-earn-29488.html", "passage_text": "Cardiac surgeons are still in third place for pay, following orthopedic surgeons of the spine, who now earn $625,000 yearly on average, and neurological surgeons, receiving average annual wages of $589,500. After six years of surgical practice, the average annual income of a cardiac or thoracic surgeon has increased to $522,875, according to the Profiles salary survey."}, {"url": "http://www.healthcare-salaries.com/physicians/heart-surgeon-salary", "passage_text": "Heart Surgeon Salary in the USA. Heart surgeon’s salary per year in the US differs from city to city. In Illinois, a heart Surgeon earns an average of from between $101,736 to $450,000 per annum. In New York, the average yearly salary of heart surgeon ranges from $60,402 to $477,158. In Florida heart surgeon receives an annual average salary from $57,674 to $489,357. In California, the starting annual pay for heart surgeon ranges from between $57,674 to $489,357. In New Jersey, the average salary per annum is $142,500 to $300,000. Heart surgeon’s median salary in the US is $296,148 with the top heart surgeon’s average salary of up to $525,132 per annum. A heart surgeon can anticipate an average annual take home pay of $62,511 to $408,053 after 1 to 4 years. Top paying heart surgeon’s salary ranges from between $99,666 to $529,391."}]