[{"url": "http://www.disabilitybenefitscenter.org/blog/working-receiving-social-security-disability", "passage_text": "That does not mean that you will lose your Social Security Disability if you earn $720 one month and never earn another penny again, but if you begin to earn $720 a month or more on a regular basis, you need to know that your Social Security Disability benefits are not going to continue after a certain amount of time. First and foremost, you need to understand that you can earn up to $720 per month without it affecting your disability benefits whatsoever. If your income exceeds $720 per month, however, it could have an impact on your benefits over time."}, {"url": "http://www.nolo.com/legal-encyclopedia/how-much-can-you-work-while-receiving-ssi-disability-benefits.html", "passage_text": "For example, if you make $1,465 per month, the SSA will subtract $65 (to get $1,400) and then half of the amount over $65 (to get $700). That $700 is your countable income from work, and it will be subtracted from your monthly SSI payment (which is $733 without a state supplement). The Social Security Administration (SSA) defines a substantial amount of work, which it calls substantial gainful activity (SGA), as earning $1,090 a month from working (in 2015). Therefore, if you are earning this much from work when you apply for benefits, you will be denied."}, {"url": "http://www.charleshallfirm.com/how-much-money-can-you-make-when-on-social-security-disability/", "passage_text": "If you’re on Title II disability benefits there is what is called the Substantial Gainful Activity (SGA) amount. For 2011, the SGA amount is $1,000 a month. I cringe as I write this since I know how easy it is for people to be confused by the SGA amount. Here are a few examples: 1  The SGA amount is gross earnings, before taxes. 2  You can have a lot less than $1,000 a month is take home pay and still be over SGA. 1 The SGA amount is gross earnings, before taxes. 2  You can have a lot less than $1,000 a month is take home pay and still be over SGA. 3  If you are paid on a weekly basis, there are sometimes five paychecks in a month."}, {"url": "http://www.disabilitysecrets.com/page4-44.html", "passage_text": "Everyone on SSI disability (Supplemental Security Income) is eligible for the same base amount, $733. But your actual monthly SSI payment will depend on whether you have any countable income, whether you are married, and what state you live in. "}, {"url": "http://work.chron.com/much-money-can-make-still-receive-ssi-3078.html", "passage_text": "The maximum SSI benefit is $698 per month, as of 2012. If you have unearned income, it will reduce the benefit dollar for dollar, after the first $20. So unearned income of $718 will eliminate one month's benefit. How Income Is Treated. The maximum SSI benefit is $698 per month, as of 2012. If you have unearned income, it will reduce the benefit dollar for dollar, after the first $20. So unearned income of $718 will eliminate one month's benefit. If you have earned income, the first $65 is ignored. After that, the benefit is reduced by 50 percent of your earnings. For example, if you earn $685 in a month, the first $85 is ignored. Then your benefits are reduced by 50 percent of the remaining $600, to $398. Based on this formula, you can earn $1,481 in a month before your SSI benefits are reduced to zero"}, {"url": "http://www.disabilitysecrets.com/page1-13.html", "passage_text": "Working and SSDI Benefits. Generally, you can't start doing substantial gainful activity (SGA) and continue to receive disability benefits. In a nutshell, SGA means you are working and making more than $1,090 per month (or $1,820 if you're blind). There are exceptions to this rule, however. For SSDI recipients, there is a trial work period during which you can make more than the SGA amount without losing your benefits."}, {"url": "http://www.ehow.com/info_8414597_much-disability-earn-per-year.html", "passage_text": "Reduced Benefits. If your extra income is from a job, then the first $85 each month of earned income is not counted against you. After that, your monthly disability benefit will be reduced $1 for every $2 of earned income above the $85. You then divide this amount in half to get $407.50. This is the amount that your disability benefit will be reduced that month. If you are generally earning more than $700 a month or $8,400 a year, you will be earning too much to be eligible for benefits."}, {"url": "http://www.ehow.com/info_8414597_much-disability-earn-per-year.html", "passage_text": "Your disability benefits are based on how much other income you earn. As your income increases, your monthly benefit amount is generally reduced. Your income is considered on a monthly basis so that your disability benefit can change each month and even be eliminated if your income that month is too high. You then divide this amount in half to get $407.50. This is the amount that your disability benefit will be reduced that month. If you are generally earning more than $700 a month or $8,400 a year, you will be earning too much to be eligible for benefits."}, {"url": "https://answers.yahoo.com/question/index?qid=20120307052314AAYHzwU", "passage_text": "· just now. Report Abuse. if you are on SSDI, you can earn up to 1010/month, but you also have 9 months our of a 5 year period that is a Trial Work Period and you can make more. "}]