[{"url": "http://www.grammar-monster.com/glossary/dependent_clause.htm", "passage_text": "When a dependent clause is used as an adjective or an adverb, it will usually be part of a complex sentence (i.e., a sentence with an independent clause and at least one dependent clause). The link between a dependent clause and an independent clause will often be a subordinating conjunction or a relative pronoun."}, {"url": "http://www.grammar-monster.com/glossary/dependent_clause.htm", "passage_text": "A dependent clause (or subordinate clause) is one that cannot stand alone as a complete sentence because it does not express a complete thought. Like all clauses, a dependent clause has a subject and verb. Here are some examples of dependent clauses (shaded). Notice how the shaded clauses could not stand alone as sentences. This is how a dependent clause differs from an independent clause. Dependent clauses can act as adjectives, adverbs, or nouns."}, {"url": "http://owl.english.purdue.edu/owl/resource/598/01/", "passage_text": "A dependent clause is a group of words that contains a subject and verb but does not express a complete thought. A dependent clause cannot be a sentence. Often a dependent clause is marked by a dependent marker word."}, {"url": "http://grammar.about.com/od/il/g/independterm.htm", "passage_text": "Examples and Observations. 1  A clause is a group of words that [contains] a subject and a verb. 2  There are two major types: independent clauses and dependent clauses. 3  An independent clause can stand alone as a sentence, beginning with a capital letter and ending with terminal punctuation such as a period."}, {"url": "http://www.k12reader.com/term/dependent-clause/", "passage_text": "A clause is a group of words containing a subject and a verb or verb phrase. Though an independent clause expresses a complete thought, a dependent clause (also known as a subordinate clause) does not. In other words, a dependent clause cannot stand as a sentence by itself."}, {"url": "http://grammar.about.com/od/il/g/independterm.htm", "passage_text": "Definition. An independent clause is a group of words made up of a subject and a predicate. An independent clause (unlike a dependent clause) can stand alone as a sentence. An independent clause is also known as a main clause or a superordinate clause. Two or more independent clauses can be joined with a coordinating conjunction (such as and) to form a compound sentence."}, {"url": "http://www.myschoolhouse.com/courses/O/1/56.asp", "passage_text": "Dependent Clause-A dependent clause cannot stand alone as a sentence. Here is an example: when the cake is done baking This clause does not express a complete thought and cannot stand alone. Directions: Identify each of the clauses as independent or dependent. 1. when Mr. Jones yelled Independent Dependent 2."}, {"url": "http://grammar.about.com/od/d/g/dependclterm.htm", "passage_text": "A dependent clause is a group of words that has both a subject and a verb but (unlike an independent clause) cannot stand alone as a sentence. Also known as a subordinate clause. Dependent clauses include adverb clauses, adjective clauses, and noun clauses."}]