[{"url": "http://www.graskop.co.za/jock/", "passage_text": "The book Jock of the Bushveld was written by Sir Percy Fitzpatrick in 1905, for his young children, and tell the story of his dog Jock and their adventures in South Africa some 20 years before. Jock-a bull-terrier-was born in the present day Kruger National Park near the Pretorius Kop Camp. Simmons In Fitzpatrick's Footsteps Jock of the Bushveld's Paradise Camp. By D.J. Coetzee, B.P. Simmons and W. Knoesen Recommended Reading: Jock of the Bushveld. By Sir Percy Fitzpatrick. ISBN 0 636 01116 X. Publishers: Maskew Miller Longman (Pty) Ltd, Cape Town."}, {"url": "https://en.wikipedia.org/wiki/Bushveld_Igneous_Complex", "passage_text": "The Bushveld Igneous Complex covers a pear-shaped area in the central Transvaal. It is divided into an eastern and western lobe, with a further northern extension. All three sections of the system were formed around the same time—about 2 billion years ago—and are remarkably similar. The orebodies within the complex include the UG2 (Upper Group 2) reef containing up to 43.5% chromite, and the platinum-bearing horizons Merensky Reef and Plat Reef. The Merensky Reef varies from 30 to 90 cm in thickness. It is a norite with extensive chromitite and sulfide layers or zones containing the ore."}, {"url": "http://www.technology.matthey.com/article/54/4/205-215/", "passage_text": "In the minerals sector of world economics, the Bushveld Complex in South Africa (Figure 1) is renowned for its overwhelming deposits of platinum group elements (PGE) and chromium (over 80% of the world's deposits of each according to Crowson (1)). There are enough platinum group element deposits in the Bushveld Complex in South Africa to supply world demands for many decades or even a century using current mining techniques."}, {"url": "http://www.graskop.co.za/jock/", "passage_text": "The book  Jock of the Bushveld  was written by Sir Percy Fitzpatrick in 1905, for his young children, and tell the story of his dog Jock and their adventures in South Africa some 20 years before. Simmons In Fitzpatrick's Footsteps Jock of the Bushveld's Paradise Camp. By D.J. Coetzee, B.P. Simmons and W. Knoesen Recommended Reading: Jock of the Bushveld. By Sir Percy Fitzpatrick. ISBN 0 636 01116 X. Publishers: Maskew Miller Longman (Pty) Ltd, Cape Town."}, {"url": "https://en.wikipedia.org/wiki/Bushveld", "passage_text": "The Bushveld is a sub-tropical woodland ecoregion of Southern Africa named after the term veld. Geography [edit]. The elevation of this region varies from 750 to 1,400 m and the annual rainfall from 350 mm in the west to 600 mm in parts of the northeast."}, {"url": "https://en.wikipedia.org/wiki/Bushveld", "passage_text": "The Bushveld is one of the most mineral-rich regions of the world. This is due to the Bushveld igneous complex, an extremely rich saucer-shaped geological formation that stretches over more than 50,000 square kilometers. Geography [edit]. The elevation of this region varies from 750 to 1,400 m and the annual rainfall from 350 mm in the west to 600 mm in parts of the northeast."}, {"url": "https://en.wikipedia.org/wiki/Jock_of_the_Bushveld", "passage_text": "The book tells of FitzPatrick's travels with his dog, Jock, a Staffordshire Bull Terrier, during the 1880s, when he worked as a storeman, prospector's assistant, journalist and ox-wagon transport-rider in the Bushveld region of the Transvaal (then the South African Republic). Jock of the Bushveld is a true story by South African author Sir James Percy FitzPatrick."}, {"url": "https://en.wikipedia.org/wiki/Bushveld_Igneous_Complex", "passage_text": "Gabbro-norite (polished slab), marketed as Impala Black Granite, Bushveld Complex. It is composed principally of grayish plagioclase feldspar and black pyroxene. The quarry is north of the town of Rustenburg. The orebodies within the complex include the UG2 (Upper Group 2) reef containing up to 43.5% chromite, and the platinum-bearing horizons Merensky Reef and Plat Reef. The Merensky Reef varies from 30 to 90 cm in thickness. It is a norite with extensive chromitite and sulfide layers or zones containing the ore."}, {"url": "http://www.merriam-webster.com/dictionary/bushveld", "passage_text": "Definition of BUSHVELD. : veld of southern Africa with abundant shrubby and often thorny vegetation. ADVERTISEMENT"}]