[{"url": "http://www.worldatlas.com/as/ph/where-is-the-philippines.html", "passage_text": "Located in the continent of Asia, Philippines covers 298,170 square kilometers of land and 1,830 square kilometers of water, making it the 73rd largest nation in the world with a total area of 300,000 square kilometers. Manila is the capital city of Philippines. It has a population of 10,444,527, and is located on a latitue of 14.6 and longitude of 120.98."}, {"url": "https://en.wikipedia.org/wiki/Philippines", "passage_text": "With a population of about 100 million people, the Philippines is the seventh-most populated country in Asia and the 12th most populated country in the world. An additional 12 million Filipinos live overseas, comprising one of the world's largest diasporas. The longest river is the Cagayan River in northern Luzon. Manila Bay, upon the shore of which the capital city of Manila lies, is connected to Laguna de Bay, the largest lake in the Philippines, by the Pasig River. Subic Bay, the Davao Gulf, and the Moro Gulf are other important bays."}, {"url": "http://www.answers.com/Q/Where_is_the_Philippines_located", "passage_text": "Specifically, the Philippines is located between 116° 40', and 126° 34' E. longitude and 4° 40' and 21° 10' N. latitude and borders the Philippine Sea on the east, the South China Sea on the west, and the Celebes Sea on the south. in Asia The island nation of the Philippines can be found of the coast of mainland Asia in the Pacific ocean. It is officially called The Republic of the Philippines. It is lo … cated between 116 degrees, and 126 degrees east longitude and 4 degrees and 21 degrees north latitude"}, {"url": "http://www.gomapper.com/travel/where-is/philippines-located.html", "passage_text": "Philippines is a country with a large population which is located in the continent/region of Asia. Countries near Philippines include Taiwan, Brunei, Hong Kong and Macao. Its biggest cities and towns include Bulacan, Batangas, Antipolo and Cagayan de Oro. "}, {"url": "http://www.worldatlas.com/as/ph/where-is-the-philippines.html", "passage_text": "Location of Manila on a map. Manila is the capital city of Philippines. It has a population of 10,444,527, and is located on a latitue of 14.6 and longitude of 120.98. Manila is also the political center of Philippines, which is considered a Republic, and home to its Executive head of state"}, {"url": "http://www.whereig.com/philippines/", "passage_text": "Where is Philippines located on the world map? The given Philippines location map shows that Philippines is located in the western Pacific Ocean which is part of south-east of Asia continent. Philippines map also shows that it is a group of islands surrounded by the Philippine Sea in the east, Selebes Sea in the south, Sulu Sea in the south-west, South China Sea in the west, and in the north, it is separated by Luzon Strait from Taiwan."}, {"url": "http://www.nationsencyclopedia.com/economies/Asia-and-the-Pacific/Philippines.html", "passage_text": "LOCATION AND SIZE. Made up of about 7,100 islands, the Philippines is on the southeastern rim of Asia and is bordered by the Philippine Sea on the east, the South China Sea on the west, the Luzon Strait on the north, and the Celebes Sea on the south. "}]