[{"url": "http://www.answers.com/Q/What_is_a_triumvirate", "passage_text": "A Triumvirate in Ancient Rome was a ruling board or commission of three men. Triumvirates were common in the Roman republic. The First Triumvirate was the alliance of Julius Caesar, Pompey, and Marcus Licinius Crassus formed in 60 B.C. This was not strictly a triumvirate, since the alliance had no official sanction."}, {"url": "http://www.thefreedictionary.com/triumvirate", "passage_text": "b. the political alliance of Caesar, Crassus, and Pompey, formed in 60 bc (First Triumvirate). c. the coalition and joint rule of the Roman Empire by Antony, Lepidus, and Octavian, begun in 43 bc (Second Triumvirate). 2. (Government, Politics & Diplomacy) any joint rule by three men."}, {"url": "https://en.wikipedia.org/wiki/The_Triumvirate", "passage_text": "A triumvirate (from Latin, triumvirātus, from trēs three + vir man) is a political regime dominated by three powerful individuals, each a triumvir (pl. triumvirs or triumviri). The arrangement can be formal or informal, and though the three are usually equal on paper, in reality this is rarely the case."}, {"url": "http://www.answers.com/Q/What_is_a_triumvirate", "passage_text": "The were many types of triumviri. First  Triumvirate is a term historians use for a three-man informal  alliance formed by Julius Caesar, Pompey and Crassus. Second  Triumvirate is a term used for the alliance between Octavian, MArc  Antony and Lepidus."}, {"url": "http://www.yourdictionary.com/triumvirate", "passage_text": "The definition of a triumvirate is a three person or position government or other system of authority. An example of a triumvirate was the Han Dynasty consisting of Huo Guang, Jin Midi and Shangguan Jie who ruled in China."}, {"url": "http://encyclopedia2.thefreedictionary.com/Second+Triumvirate", "passage_text": "b. the political alliance of Caesar, Crassus, and Pompey, formed in 60 bc (First Triumvirate). c. the coalition and joint rule of the Roman Empire by Antony, Lepidus, and Octavian, begun in 43 bc (Second Triumvirate). 2. any joint rule by three men. 3. the office of a triumvir."}, {"url": "http://www.oxforddictionaries.com/definition/english/triumvirate", "passage_text": "1 (In ancient Rome) a group of three men holding power, in particular (the First Triumvirate) the unofficial coalition of Julius Caesar, Pompey, and Crassus in 60 bc and (the Second Triumvirate) a coalition formed by Antony, Lepidus, and Octavian in 43 bc."}]