[{"url": "http://medical-dictionary.thefreedictionary.com/ornithine+decarboxylase+test", "passage_text": "alternative name for urea cycle since ornithine is the carrier of the nitrogens. ornithine decarboxylase test. a means of identifying different members of the Enterobacteriaceae as well as other gram-negative bacteria. ornithine-δaminotransferase. deficiency see gyrate atrophy. an amino acid obtained from arginine by the action of the enzyme arginase which also splits off urea; it is an intermediate in urea biosynthesis. ornithine carbamoyl transferase (OCT), ornithine transcarbamoylase. see ornithine carbamoyl "}, {"url": "http://www.austincc.edu/microbugz/decarboxylation_test.php", "passage_text": "We also add a single amino acid to each batch of decarboxylase broth. The three amino acids we test in our decarboxylase media are arginine, lysine, and ornithine. The decarboxylase test is useful for differentiating the Enterobacteriaceae. Decarboxylase broth contains nutrients, dextrose (a fermentable carbohydrate), pyridoxal (an enzyme cofactor for decarboxylase), and the pH indicators bromcresol purple and cresol red. Bromcresol purple turns purple at an alkaline pH and turns yellow at an acidic pH."}, {"url": "https://en.wikipedia.org/wiki/Ornithine_decarboxylase", "passage_text": "The enzyme ornithine decarboxylase (ODC) catalyzes the decarboxylation of ornithine (a product of the urea cycle) to form putrescine. This reaction is the committed step in polyamine synthesis. In humans, this protein has 461 amino acids and forms a homodimer. The ornithine decarboxylation reaction catalyzed by ornithine decarboxylase is the first and committed step in the synthesis of polyamines, particularly putrescine, spermidine and spermine. Polyamines are important for stabilizing DNA structure, the DNA double strand-break repair pathway and as antioxidants"}, {"url": "http://www.vumicro.com/vumie/help/VUMICRO/Ornithine_decarboxylase_Test.htm", "passage_text": "The purpose is to see if the microbe can use the amino acid ornithine as a source of carbon and energy for growth. Use of ornithine is accomplished by the enzyme ornithine decarboxylase. An inoculum from a pure culture is transferred aseptically to a sterile tube of ornithine decarboxylase broth. The inoculated tube is incubated at 35-37 C for 24 hours and the preliminary results are determined. The microbe must first use the glucose present to cause the p H to drop."}, {"url": "http://www.austincc.edu/microbugz/decarboxylation_test.php", "passage_text": "Each decarboxylase enzyme produced by an organism is specific to the amino acid on which it acts. Therefore, we test the ability of organisms to produce arginine decarboxylase, lysine decarboxylase, and ornithine decarboxylase using three different but very similar media. Decarboxylase broth contains nutrients, dextrose (a fermentable carbohydrate), pyridoxal (an enzyme cofactor for decarboxylase), and the pH indicators bromcresol purple and cresol red. Bromcresol purple turns purple at an alkaline pH and turns yellow at an acidic pH."}, {"url": "http://www.vumicro.com/vumie/help/VUMICRO/Ornithine_decarboxylase_Broth.htm", "passage_text": "The range of compounds used depends on the collection of enzymes a species of bacteria can make. Ornithine is an amino acid that some bacteria can use because of an enzyme called ornithine decarboxylase. Ornithine decarboxylase broth is thus used to determine whether the microbe can use the amino acid ornithine for carbon and energy. This is indicated by a change from purple to yellow during the first 24 hours of incubation. Once the medium has been acidified, the enzyme ornithine decarboxylase is activated. The culture is incubated an additional 24 hours at 35-37 C to allow the microbe to now use the ornithine."}, {"url": "http://www.vumicro.com/vumie/help/VUMICRO/Ornithine_decarboxylase_Test.htm", "passage_text": "Once the medium has been acidified, the enzyme ornithine decarboxylase is activated. The culture is incubated an additional 24 hours at 35-37 C to allow the microbe to now use the ornithine. The final results are then obtained by observing the tube at 48 hours. An inoculum from a pure culture is transferred aseptically to a sterile tube of ornithine decarboxylase broth. The inoculated tube is incubated at 35-37 C for 24 hours and the preliminary results are determined. The microbe must first use the glucose present to cause the p H to drop."}, {"url": "http://medical-dictionary.thefreedictionary.com/ornithine+decarboxylase+test", "passage_text": "ornithine. an amino acid obtained from arginine by splitting of urea; it is an intermediate in urea biosynthesis. ornithine carbamoyltransferase (ornithine transcarbamylase) an enzyme that catalyzes a reaction occurring in the liver mitochondria as part of the urea cycle. an amino acid obtained from arginine by the action of the enzyme arginase which also splits off urea; it is an intermediate in urea biosynthesis. ornithine carbamoyl transferase (OCT), ornithine transcarbamoylase. see ornithine carbamoyl transferase."}]