[{"url": "http://nantero.com/nantero-company-overview/", "passage_text": "At the heart of Nantero’s NRAM is its unique use of carbon nanotube technology, which is considered to be one of the strongest materials known to man. As a pioneer in nanotechnology, Nantero has amassed one of the most comprehensive IP portfolios with over 170 US patents issued to date and more than 200 patents pending. Nantero’s business model is based on licensing its IP to major chip manufacturers, foundries, and electronics companies around the world. The company supports its customers in offering NRAM as both embedded and standalone memory and is already working with over a dozen major corporations in partnership."}, {"url": "http://nantero.com/nantero-company-overview/", "passage_text": "Company Overview. As the world leader in carbon nanotube electronics, Nantero has developed a new generation of memory called NRAM ® (non-volatile random access memory). Nantero’s business model is based on licensing its IP to major chip manufacturers, foundries, and electronics companies around the world. The company supports its customers in offering NRAM as both embedded and standalone memory and is already working with over a dozen major corporations in partnership."}, {"url": "https://en.wikipedia.org/wiki/Northern_Rock_(Asset_Management)", "passage_text": "This article is about the 'bad-bank' of Northern Rock. For other uses, see Northern Rock (disambiguation) . NRAM plc (previously Northern Rock (Asset Management) plc) is a British asset holding and management company which was split away from the Northern Rock bank in 2010. It is currently under public ownership, due to the bank's nationalisation in 2008. On 16 May 2014 the company changed its name to the shorter NRAM plc. In 2015 UK Financial Investments announced that it will seek expressions of interest for the divestment of mortgage servicing capabilities of the business as well as the Granite securitisation vehicle."}, {"url": "https://en.wikipedia.org/wiki/Nano-RAM", "passage_text": "The first generation Nantero NRAM technology was based on a three-terminal semiconductor device where a third terminal is used to switch the memory cell between memory states. The second generation NRAM technology is based on a two-terminal memory cell. The two-terminal cell has advantages such as a smaller cell size, better scalability to sub-20 nm nodes (see semiconductor device fabrication), and the ability to passivate the memory cell during fabrication."}, {"url": "http://nantero.com/", "passage_text": "Nantero’s NRAM is in a strong position to fill this void, allowing manufacturers to provide new storage architectures and to design smaller, faster and more innovative products packed with massive amount of storage.”. Michael Yang, Senior Director, Memory and Storage for IHS Technology. Nantero, NRAM. "}, {"url": "https://en.wikipedia.org/wiki/Nano-RAM", "passage_text": "Nano-RAM is a proprietary computer memory technology from the company Nantero. It is a type of nonvolatile random access memory based on the position of carbon nanotubes deposited on a chip-like substrate. In theory, the small size of the nanotubes allows for very high density memories. The second generation NRAM technology is based on a two-terminal memory cell. The two-terminal cell has advantages such as a smaller cell size, better scalability to sub-20 nm nodes (see semiconductor device fabrication), and the ability to passivate the memory cell during fabrication."}, {"url": "http://encyclopedia2.thefreedictionary.com/NRAM", "passage_text": "The Bits Are Nanotubes. An NRAM 0 or 1 bit is determined by whether the tubes are straight up or bent down. Changing the charge on the electrode changes the data state (0 or 1) by attracting or repelling the positively charged nanotube. When straight up, the tubes have high resistance; when bent down, they have low resistance. NRAM is expected to be faster and denser than DRAM and also very scalable; able to handle 5 nm bit cells whenever CMOS fabrication advances to that level. It is also very stable in its 0 or 1 state."}, {"url": "http://www.eetimes.com/document.asp?doc_id=1326794", "passage_text": "Having been working on its NRAM technology for more than a decade, it s time for Nantero to show what they ve got, said Alan Niebel, CEO of WebFeet Research. How quickly it can get its technology into silicon is the acid test. TORONTO — Nantero is coming out of stealth mode and announcing a round of financing because it believes its proprietary NRAM is ready to take its place as a storage class memory and replacement for flash and DRAM."}, {"url": "http://www.wisegeek.com/what-is-nram.htm", "passage_text": "NRAM, short for nano-RAM or nanotube-based/nonvolatile random access memory, is a new memory storage technology owned by the company Nantero. The technology blends together tiny carbon nanotubes with conventional semiconductors. "}, {"url": "http://www.nramvrc.com/", "passage_text": "Is your vehicle in need of paint or body work? If so, you can count on the NRAM Collision Center to get your vehicle looking like new. Our brand new, 36,000-square-foot, state-of-the art Collision Center is your source for all your repair and painting needs. Please call one of our advisors to discuss the different options available. "}]