[{"url": "http://www.mananatomy.com/body-systems/cardiovascular-system/brachiocephalic-veins", "passage_text": "This part of each brachiocephalic vein receives tributaries corresponding to the branches of the first part of the subclavian artery (vertebral, inferior thyroid, internal thoracic and, on the left side only, superior intercostal). "}, {"url": "http://www.healthline.com/human-body-maps/subclavian-artery", "passage_text": "Subclavian artery. There are two subclavian arteries that supply our arms with blood. The subclavian arteries branch to the vertebral arteries. These carry oxygenated blood up to the brain from the base of the neck. The right subclavian artery is located below the clavicle. It branches off the brachiocephalic trunk. The left subclavian artery branches off the arch of the aorta"}, {"url": "http://biology.about.com/od/anatomy/ss/brachiocephalic_artery.htm", "passage_text": "Arteries are blood vessels that carry blood away from the heart. The brachiocephalic (Brachi- , -cephal) artery extends from the aortic arch to the head. It branches off into the right common carotid artery and the right subclavian artery. This relatively short artery supplies oxygenated blood to the head, neck and arm regions of the body."}, {"url": "http://www.healthline.com/human-body-maps/brachiocephalic-vein", "passage_text": "Brachiocephalic vein. The brachiocephalic vein, also known as an innominate vein, is a vein that returns oxygen-depleted blood from the upper limbs, neck, and head to the heart. There is a brachiocephalic vein on the left side of the neck and one on the right. The brachiocephalic vein on the left side of the neck is approximately 6 to 8 cm in length, while the brachiocephalic vein on the right is approximately two centimeters long. "}, {"url": "https://en.wikipedia.org/wiki/Subclavian_artery", "passage_text": "1 On the right side of the body, the subclavian arises from the relatively short brachiocephalic artery (trunk) when it bifurcates into the subclavian and the right common carotid artery. The usual branches of the subclavian on both sides of the body are the vertebral artery, the internal thoracic artery, the thyrocervical trunk, the costocervical trunk and the dorsal scapular artery. The subclavian becomes the axillary artery at the lateral border of the first rib."}, {"url": "https://en.wikipedia.org/wiki/Subclavian_artery", "passage_text": "The left subclavian artery supplies blood to the left arm and the right subclavian artery supplies blood to the right arm, with some branches supplying the head and thorax. 1  On the left side of the body, the subclavian comes directly off the arch of aorta. The usual branches of the subclavian on both sides of the body are the vertebral artery, the internal thoracic artery, the thyrocervical trunk, the costocervical trunk and the dorsal scapular artery. The subclavian becomes the axillary artery at the lateral border of the first rib."}, {"url": "https://en.wikipedia.org/wiki/Subclavian_artery", "passage_text": "1 On the left side of the body, the subclavian comes directly off the arch of aorta. 2  On the right side of the body, the subclavian arises from the relatively short brachiocephalic artery (trunk) when it bifurcates into the subclavian and the right common carotid artery. The usual branches of the subclavian on both sides of the body are the vertebral artery, the internal thoracic artery, the thyrocervical trunk, the costocervical trunk and the dorsal scapular artery. The subclavian becomes the axillary artery at the lateral border of the first rib."}, {"url": "http://www.innerbody.com/image_card01/card32-new3.html", "passage_text": "At this point, it divides, giving rise to the common carotid artery, which carries blood to the right side of the neck and head, and the right subclavian artery, which leads to the right ... Click to read more below. The brachiocephalic trunk is another word for the brachiocephalic artery. The brachiocephalic artery supplies blood to the tissues of the brain and the head. It is the first branch of the aortic arch and rises up to a point near the junction of the sternum (breast bone) and the right clavicle (collarbone). "}, {"url": "https://en.wikipedia.org/wiki/Brachiocephalic_artery", "passage_text": "The brachiocephalic artery (or brachiocephalic trunk or innominate artery) is an artery of the mediastinum that supplies blood to the right arm and the head and neck. It is the first branch of the aortic arch, and soon after it emerges, the brachiocephalic artery divides into the right common carotid artery and the right subclavian artery. There is no brachiocephalic artery for the left side of the body. The left common carotid, and the left subclavian artery, come directly off the aortic arch. However, there are two brachiocephalic veins"}]