[{"url": "http://www.phschool.com/science/biology_place/labbench/lab8/allvgen.html", "passage_text": "If you are told that the frequency of a recessive allele in a population is 10%, you are directly given q, since by definition q is the frequency of the recessive allele."}, {"url": "http://www.k-state.edu/parasitology/biology198/answers1.html", "passage_text": "You have sampled a population in which you know that the percentage of the homozygous recessive genotype (aa) is 36%. Using that 36%, calculate the following: 1  The frequency of the aa genotype. 2  Answer: 36%, as given in the problem itself."}, {"url": "http://www.k-state.edu/parasitology/biology198/answers1.html", "passage_text": "1 The frequency of the recessive allele in the population. 2  Answer: We know from the above that q 2 is 1/2,500 or 0.0004. 3  Therefore, q is the square root, or 0.02. 4  That is the answer to our first question: the frequency of the cystic fibrosis (recessive) allele in the population is 0.02 (or 2%)."}, {"url": "http://www.k-state.edu/parasitology/biology198/answers1.html", "passage_text": "1 The frequency of the recessive allele. 2  Answer: Since we believe that the homozygous recessive for this gene (q 2) represents 4% (i.e. = 0.04), the square root (q) is 0.2 (20%). 3  The frequency of the dominant allele. 4  Answer: Since q = 0.2, and p + q = 1, then p = 0.8 (80%)."}, {"url": "http://anthro.palomar.edu/synthetic/synth_2.htm", "passage_text": "In this equation, p is the predicted frequency of homozygous dominant (AA) people in a population, 2pq is the predicted frequency of heterozygous (Aa) people, and q is the predicted frequency of homozygous recessive (aa) ones."}, {"url": "http://www.phschool.com/science/biology_place/labbench/lab8/allvgen.html", "passage_text": "Genotypic frequency is the frequency of a genotype—homozygous recessive, homozygous dominant, or heterozygous—in a population. If you don't know the frequency of the recessive allele, you can calculate it if you know the frequency of individuals with the recessive phenotype (their genotype must be homozygous recessive)."}, {"url": "http://www.nature.com/scitable/definition/Hardy-Weinberg-equation-299", "passage_text": "where p is the frequency of the A allele and q is the frequency of the a allele in the population. In the equation, p 2 represents the frequency of the homozygous genotype AA, q 2 represents the frequency of the homozygous genotype aa, and 2pq represents the frequency of the heterozygous genotype Aa. In addition, the sum of the allele frequencies for all the alleles at the locus must be 1, so p + q = 1."}, {"url": "http://www.k-state.edu/parasitology/biology198/answers1.html", "passage_text": "1 The frequency of heterozygous individuals. 2  Answer: The frequency of heterozygous individuals is equal to 2pq. 3  In this case, 2pq equals 0.32, which means that the frequency of individuals heterozygous for this gene is equal to 32% (i.e. 2 (0.8)(0.2) = 0.32)."}, {"url": "http://www.k-state.edu/parasitology/biology198/answers1.html", "passage_text": "1 Answer: Since we believe that the homozygous recessive for this gene (q 2) represents 4% (i.e. = 0.04), the square root (q) is 0.2 (20%). 2  The frequency of the dominant allele. 3  Answer: Since q = 0.2, and p + q = 1, then p = 0.8 (80%)."}]