[{"url": "https://uk.answers.yahoo.com/question/index?qid=20100708155911AAyKHMO", "passage_text": "Best Answer: You know I wish pads would work with pool and beaches, but they won't sadly. You can't really go swimming without a tampon because you don't want your blood in the pool/beach etc. There are tampons that are comfy such as Playtex Sport tampons. They also have tampons that are slender which is easier to insert. This is a bit embarrassing-I have had this holiday with my friends planned for ages which is starting Sunday. We organised it specially so we could go swimming and to the beach nearly every day, but literally just this afternoon I noticed that I was on my period."}, {"url": "http://www.wikihow.com/Swim-when-You-Are-on-Your-Period", "passage_text": "Insert a tampon or a menstrual cup before swimming. Though swimming can temporarily reduce your menstrual flow, it's not sanitary for you to go in the water with your friends without inserting a tampon or a menstrual cup first. If you're not comfortable with these items yet, you should try using them at home before you go swimming. Though some girls are nervous about swimming on their periods, you shouldn't let your menstrual cycle prevent you from enjoying a day at the beach or pool with your friends. In fact, getting some exercise while swimming with your period can help you reduce cramps and improve your mood."}, {"url": "https://malaysia.answers.yahoo.com/question/index?qid=20100315062216AAgLxt8", "passage_text": "Pads can be used for swimming, but commercial pads like Always or organic pads like Cottons will go soggy in the water and come unstuck so use cloth pads or something similar, you can only use cloth pads like Lunapads for swimming. you can still wear a tampon when swimming, and its probably best if you still have your period as you are not yet familiar to how long your period lasts."}, {"url": "https://answers.yahoo.com/question/index?qid=20090512235311AAs42yv", "passage_text": "Report Abuse. Your period doesn't stop when you go swimming but that is what it will look like. When you swim your period blood is deluted so much you can't see it. If you sit out on the side of the pool you might be able to see it, so try to stay in the water (personal experience). Good luck! Hope I helped! No, your period does not stop when you go swimming. It may seem lighter but this is only because the water dilutes your menstrual flow – that's why so many girls think their periods do stop in water. When you get out of the water you will get a blood stain and be very embarrassed."}, {"url": "https://malaysia.answers.yahoo.com/question/index?qid=20100315062216AAgLxt8", "passage_text": "you can go swimming without a tampon, if you are in water you will not leak, however once you get out of the water you will. So just wear a tampon and you won't have to worry! you can still wear a tampon when swimming, and its probably best if you still have your period as you are not yet familiar to how long your period lasts."}, {"url": "https://nz.answers.yahoo.com/question/index?qid=20100428160221AADEyKE", "passage_text": "Report Abuse. no. if you are going to go swimming on your period you MUST wear a tampon. even if you don't usually bleed in the bath, you WILL bleed in the pool and there is nothing that will stop that. Edit: a couple girls are telling you you can't bleed in water and one even claims to be a doctor... Alot of people are saying I need a tampon, but I'm not comfortable with that. I have had baths on my period and showers and there wasn't any 'blood'. I'm thinking that if I go in/ out super fast it won't be that bad..."}, {"url": "https://malaysia.answers.yahoo.com/question/index?qid=20100315062216AAgLxt8", "passage_text": "Report Abuse. you can go swimming without a tampon, if you are in water you will not leak, however once you get out of the water you will. So just wear a tampon and you won't have to worry! *steph* · 6 years ago. you can still wear a tampon when swimming, and its probably best if you still have your period as you are not yet familiar to how long your period lasts."}, {"url": "http://www.wikihow.com/Swim-on-Your-Period-Without-a-Tampon", "passage_text": "However, if you have a light flow you can use it while swimming as an alternative to a tampon. 1  A diaphragm can be left in the vagina for up to 24 hours. 2  If you have sex, you must leave your diaphragm in for at least 6 hours following intercourse to prevent pregnancy. 3  Diaphragms do not protect against STDs. 1 Just as you would with a reusable cup, insert the cup before swimming, and leave it in until you can change out of your swimsuit into your regular clothing and switch to another method of period protection."}, {"url": "http://www.wikihow.com/Swim-on-Your-Period-Without-a-Tampon", "passage_text": "Swimming while on your period can help to ease cramps and provide a gentle and fun way to exercise. While most women use tampons to contain their menstrual flow while swimming, other women either dislike tampons or cannot use them. 1 Just as you would with a reusable cup, insert the cup before swimming, and leave it in until you can change out of your swimsuit into your regular clothing and switch to another method of period protection."}]