[{"url": "https://www.quora.com/How-do-you-remove-a-coconut-oil-stain-from-a-cotton-shirt", "passage_text": "2.2k Views. Rub dish soap into the stain. Toss into the wash. If it's still there when it dries, do it again. Practically guaranteed. (Dish soap is MADE to remove food grease, and it does it brilliantly.) I'm a laundry fiend, and this trick discovered was a moment of heavens opening up and angels' chorus bursting out. True story."}, {"url": "http://hybridrastamama.com/removing-coconut-oil-stains/", "passage_text": "1 Blot the excess coconut oil out with towels. 2  Use plain, white towels, as coconut oil can remove dyes from towels or paper towels if the dyes are of a poor quality and not set into the fabric of paper correctly. 3  Apply baking soda, arrowroot powder, or cornstartch to the stain. 4  Sprinkle it generously over the stain. 1 Use plain, white towels, as coconut oil can remove dyes from towels or paper towels if the dyes are of a poor quality and not set into the fabric of paper correctly. 2  Apply baking soda, arrowroot powder, or cornstartch to the stain. 3  Sprinkle it generously over the stain."}, {"url": "http://www.howtocleanstuff.net/how-to-remove-oil-stains-from-cotton/", "passage_text": "1 Then, rub liquid dish soap into the oil stain and wash the garment as usual.². 2  Soak the oil stain with lighter fluid, then launder as usual.³. 3  Cover the stain with a powder to soak up the oil, such as talcum powder⁴ or baking soda. 1 Place the front of the stain on a towel or folded paper towel, apply the nail polish remover to the back of the stain, and blot the back of the stain.¹. 2  Spray the stain with WD-40 and allow the WD-40 to soak for about ten minutes. 3 "}, {"url": "http://www.ehow.com/how_5895057_remove-stains-coconut-oil.html", "passage_text": "Instructions. Mix one part coconut oil to eight parts of the dry cleaning solvent in a cup to create the dry spotter solution. Wash the stain using a sponge saturated with the dry cleaning solvent. Wet the stain using the dry spotter solution. Blot the stain with the absorbent pad. Coconut oil is becoming well-known as a heart healthy source of fat. If people aren’t cooking with it, they are using it to moisturize their skin and hair. But there’s yet another use for that greasy, white tub of coconut oil in your cupboard: You can use it to clean up stains."}, {"url": "http://www.treehugger.com/green-home/how-remove-stains-clothes-and-carpet-naturally.html", "passage_text": "Baking soda: Make a paste of baking soda and water and scrub into carpet stains. Once the powder dries, vacuum it up. Toothpaste: Rub it briskly into stains on clothing or carpet. Wash or rinse as usual. Toothpaste is supposed to be good for reducing stains in tea and coffee cups. Wash as usual. If you don’t have a washing machine, make a salt paste with water and apply to stains before washing by hand. If you have blood stains on clothes, soak in a mixture of 1 quart cold water and 2 tbsp salt before washing."}, {"url": "http://hybridrastamama.com/removing-coconut-oil-stains/", "passage_text": "For new spills. 1  Blot the excess coconut oil out with towels. 2  Use plain, white towels, as coconut oil can remove dyes from towels or paper towels if the dyes are of a poor quality and not set into the fabric of paper correctly. 3  Apply baking soda, arrowroot powder, or cornstartch to the stain. 1 Use plain, white towels, as coconut oil can remove dyes from towels or paper towels if the dyes are of a poor quality and not set into the fabric of paper correctly. 2  Apply baking soda, arrowroot powder, or cornstartch to the stain. 3  Sprinkle it generously over the stain."}, {"url": "http://www.stainsolver.com/Coconut_Oil_Stain.shtml", "passage_text": "Coconut Oil Stain. Coconut oil stains can be both tough and frustrating to remove. Because of your busy, over-scheduled life, it's important to remove a coconut oil stain as quickly as possible. An oxygen bleach cleaner can do this while preserving the integrity of your article of clothing, carpet, tile grout or an upholstered chair or couch. Add the Stain Solver powder to the warm water. Stir until completely dissolved. Saturate stained area of carpet with the solution. Let sit for 10-15 minutes. Dab the stain with the towels at the end of the wait period. Repeat if necessary. Allow carpet to dry, and vacuum up any white powder that may result as the solution dries. Coconut Oil Stains on Clothes. What You'll Need: 1  1-2 Gallons Warm Water. 2  Clean Five-Gallon Bucket"}, {"url": "http://www.howtocleanstuff.net/how-to-remove-oil-stains-from-cotton/", "passage_text": "Oil stains often come out of clothing during a regular wash. If the stain remains or if you want to pre-treat the stain before washing, use one of the steps below. 1 Place the front of the stain on a towel or folded paper towel, apply the nail polish remover to the back of the stain, and blot the back of the stain.¹. 2  Spray the stain with WD-40 and allow the WD-40 to soak for about ten minutes. 3  Then, rub liquid dish soap into the oil stain and wash the garment as usual.²."}]