[{"url": "https://en.wikipedia.org/wiki/Stonehenge", "passage_text": "The site and its surroundings were added to the UNESCO 's list of World Heritage Sites in 1986 in a co-listing with Avebury Henge. It is a national legally protected Scheduled Ancient Monument. Stonehenge is owned by the Crown and managed by English Heritage, while the surrounding land is owned by the National Trust. Archaeological evidence found by the Stonehenge Riverside Project in 2008 indicates that Stonehenge could have been a burial ground from its earliest beginnings. The Heel Stone lies north east of the sarsen circle, beside the end portion of Stonehenge Avenue. It is a rough stone, 16 feet (4.9 m) above ground, leaning inwards towards the stone circle."}, {"url": "http://www.answers.com/Q/Where_is_Stonehenge", "passage_text": "Stonehenge is in the county of Wiltshire on Salisbury Plain. It's just west of Amesbury in England and is visible from the A303 road. The nearest city is Salisbury a few miles to the south. 1 About America's Stonehenge and the World Wonder Itself In North Salem, New Hampshire, a section of New England, there is a park known as America's Stonehenge. 2  This location has several similarities to the Stonehenge monument in E…."}, {"url": "http://www.ancient.eu/stonehenge/", "passage_text": "Stonehenge is a Neolithic / Bronze Age monument located on Salisbury Plain, Wiltshire, southern England. The first monument on the site, began around 3100 BC, was a circular ‘henge’ earthwork about 360 feet (110 metres) in diameter, a 'henge' in the archaeological sense being a circular or oval-shaped flat area enclosed by a boundary earthwork."}, {"url": "https://en.wikipedia.org/wiki/Stonehenge,_Avebury_and_Associated_Sites", "passage_text": "Stonehenge, Avebury and Associated Sites is a UNESCO World Heritage Site located in Wiltshire, England. The WHS covers two large areas of land separated by nearly 30 miles (48 km), rather than a specific monument or building. The sites were inscribed as co-listings in 1986. Boundary and key sites for the Avebury section of the Stonehenge and Avebury World Heritage Site. The Avebury area of the WHS is located in northern Wiltshire. It covers an area of 22.5 square km and is centred on the prehistoric Avebury Henge."}, {"url": "http://travel.nationalgeographic.com/travel/world-heritage/stonehenge/", "passage_text": "How to Get There. Stonehenge is located about 10 miles (16 kilometers) from Salisbury. It’s accessible by road or via public tour buses, which depart from Salisbury’s rail and bus stations. Avebury is about 25 miles from Bath and 11 from Swindon—from which bus service is available. Famously, for example, the Stone Circle and Avenue leading 1.8 miles (3 kilometers) from Stonehenge to the River Avon is built on the axis of the midsummer sunrise. Whether this alignment was constructed for sun worship, calendar keeping, or other purposes remains a matter of much debate."}, {"url": "http://www.livescience.com/22427-stonehenge-facts.html", "passage_text": "View full size image. Stonehenge is a massive stone monument located on a chalky plain north of the modern-day city of Salisbury, England. Research shows that the site has continuously evolved over a period of about 10,000 years. "}, {"url": "http://www.answers.com/Q/Where_is_Stonehenge", "passage_text": "Stonehenge is a prehistoric monument in Wiltshire, England, Stonehenge is a prehistoric monument in Wiltshire, England, north of Salisbury. 1 About America's Stonehenge and the World Wonder Itself In North Salem, New Hampshire, a section of New England, there is a park known as America's Stonehenge. 2  This location has several similarities to the Stonehenge monument in E…."}, {"url": "http://wikitravel.org/en/Stonehenge", "passage_text": "Sunrise over Stonehenge. Stonehenge is a well-known Neolithic and Bronze Age stone monument located in a UNESCO World Heritage Site on Salisbury Plain in Wiltshire, England. The whole WHS is quite large and contains many other structures from the Neolithic and Bronze Ages."}, {"url": "https://en.wikipedia.org/wiki/Stonehenge", "passage_text": "Stonehenge is a prehistoric monument located in Wiltshire, England, about 2 miles (3 km) west of Amesbury and 8 miles (13 km) north of Salisbury. One of the most famous sites in the world, Stonehenge is the remains of a ring of standing stones set within earthworks. The Heel Stone lies north east of the sarsen circle, beside the end portion of Stonehenge Avenue. It is a rough stone, 16 feet (4.9 m) above ground, leaning inwards towards the stone circle."}]