[{"url": "http://www.livestrong.com/article/119879-home-remedies-vinegar-yeast-infection/", "passage_text": "Vinegar Douche. Female yeast infections can be treated using either white or apple cider vinegar in a douche. Vinegar should never be used by itself and should always be mixed in water to avoid irritating delicate vaginal tissue. Infants can even get yeast infections as diaper rashes. At-home treatments for yeast infections are available as over-the-counter products in drugstores, and home remedies using products as simple as household vinegar have been shown to be effective in eliminating yeast infections."}, {"url": "http://www.life-saving-naturalcures-and-naturalremedies.com/natural-remedy-for-yeast-infection.html", "passage_text": "Natural Remedy for Yeast Infection. Here's a potent natural remedy for yeast infection and thrush, along with other highly effective natural cures for yeast infections that work incredibly well... Yeast infection (thrush) is a nasty problem for both men and women (yes it can affect men as well). "}, {"url": "http://www.earthclinic.com/cures/yeast_infection.html", "passage_text": "Treatment of yeast infections with herbal and home remedies can often cure the infection while chronic reoccurrences may necessitate lifestyle changes. Home remedy treatments like yogurt and garlic are inexpensive and extremely effective methods to cure yeast infections. "}, {"url": "http://www.candida-cure-recipes.com/yeast-infection-apple-cider-vinegar.html", "passage_text": "As a douche: Add 3 tablespoons raw unfiltered apple cider vinegar to 2 quarts warm purified (distilled water or filtered water that has been boiled and cooled to warm). Apple cider vinegar naturally has the same acidity as a healthy vagina. Use this cleansing douche for a natural remedy for vaginal yeast infections. "}, {"url": "http://homeremediesforlife.com/apple-cider-vinegar-for-yeast-infection/", "passage_text": "Apple cider vinegar has very effective properties for curing yeast infections. 1  ACV restores the vagina pH level and prevents yeast fungi to thrive and infect the vagina with further yeast infections. 2  ACV is one of nature’s strongest antibiotics. 3  It kills bacteria, viruses, and protozoa providing relief. Method – 1: (ACV in Diet). Including ACV in your regular diet helps prevent yeast infection by maintaining proper pH balance hindering fungal growth. Regular intake also boosts the immune system, fight against Candida, and helps good bacteria prevent yeast infection. 1  Mix 1 – 2 tablespoons of ACV in a glass of filtered water or herbal tea. 2  Drink regularly 2 – 3 times daily on an empty stomach to prevent yeast infection. 3  Put ACV on salads as dressing or on fruit"}, {"url": "http://www.vinegar-home-remedies.com/yeast-infection.html", "passage_text": "Vinegar Cure. Apple Cider Vinegar is well known for its effectiveness as a yeast infection cure because it is lethal to the yeast. Vinegar is most potent at full strength but may sting a bit. Try diluting it with some warm water to make it bearable. "}, {"url": "http://www.livestrong.com/article/340351-apple-cider-vinegar-benefits-for-yeast-infections/", "passage_text": "Apple Cider Vinegar Benefits for Yeast Infections. Candidiasis, commonly known as a yeast infection, is caused by an overgrowth of a yeast-like fungus called candida albicans. Yeast infections can occur in the mouth, gastrointestinal tract, skin and vagina."}, {"url": "http://www.yeastinfection.org/can-i-use-apple-cider-vinegar-on-the-candida-crusher-diet/", "passage_text": "Add 1 to 2 cups of apple cider vinegar and again, if you have a stubborn yeast infection or a particularly irritating one (whether it is jock itch or a vaginal yeast infection) you may want to add at least 1 -2 teaspoons of water soluble tea tree oil to a bath. Good to sip during or between meals. Apple cider vinegar is a good alkalizer of the digestive tract and is a perfect daily drink throughout the Candida Crusher Program. Some folk claim that apple cider vinegar kills a yeast infection, but this is not my experience."}, {"url": "http://www.livestrong.com/article/119879-home-remedies-vinegar-yeast-infection/", "passage_text": "Vinegar Bath Soak. Men and women experiencing external yeast infection symptoms such as itching can find relief with a vinegar bath soak. Pour 1 cup of vinegar into a hot bath and soak for 20 to 30 minutes. When repeated daily, external yeast is killed quickly, as reported by Home Remedies for Yeast Infections. Infants can even get yeast infections as diaper rashes. At-home treatments for yeast infections are available as over-the-counter products in drugstores, and home remedies using products as simple as household vinegar have been shown to be effective in eliminating yeast infections."}]