[{"url": "https://en.wikipedia.org/wiki/Leucanthemum_vulgare", "passage_text": "Leucanthemum vulgare is a perennial herb one to three feet high by 1 foot (0.30 m) wide. The stem is mostly unbranched and sprouts laterally from a creeping rhizomatous rootstock. L. vulgare is a typical grassland perennial wildflower, growing in a variety of plant communities including meadows and fields, under scrub and open-canopy forests, and in disturbed areas. Leucanthemum is from the Ancient Greek λευκός (leukos, leukós) white and (ἄνθος, anthos). ánthos flower symbolic Meaning of: Oxeye (daisy://patience.https.en.m/wikipedia/Org_wiki). plant symbolism"}, {"url": "http://www.thefreedictionary.com/Leucanthemum", "passage_text": "Chrysanthemum leucanthemum, Leucanthemum vulgare, marguerite, moon daisy, ox-eyed daisy, white daisy, oxeye daisy-tall leafy-stemmed Eurasian perennial with white flowers; widely naturalized; often placed in genus Chrysanthemum. Chrysanthemum maximum, Leucanthemum maximum, oxeye daisy-similar to oxeye daisy. Chrysanthemum maximum maximum, Leucanthemum superbum, shasta daisy-hybrid garden flower derived from Chrysanthemum maximum and Chrysanthemum lacustre having large white flower heads resembling oxeye daisies; often placed in the"}, {"url": "https://en.wikipedia.org/wiki/Leucanthemum", "passage_text": "Description [edit]. Leucanthemum species are perennial plants growing from red-tipped rhizomes. The plant produces one erect stem usually reaching 40 to 130 centimeters tall, but known to exceed 2 meters at times. It is branching or unbranched and hairy to hairless. Some species have mainly basal leaves, and some have leaves along the stem, as well. It is mainly distributed in southern and central Europe. Some species are known on other continents as introduced species, and some are cultivated as ornamental plants. The name Leucanthemum derives from the Greek words λευκός - leukos (white) and ἄνθεμον - anthemon (flower)."}, {"url": "http://www.missouribotanicalgarden.org/PlantFinder/PlantFinderDetails.aspx?kempercode=r550", "passage_text": "Noteworthy Characteristics. Leucanthemum x superbum, commonly called Shasta daisy, is a hybrid developed by Luther Burbank (1849-1926) in the 1890s near snow covered Mt. Shasta in northern California. 'Becky' is larger than most other Shasta cultivars, growing 3-4' tall on rigid stems which do not require staking. Features 3-4 diameter flower heads with the classic white rays and yellow center disks and coarsely-toothed, lance-shaped, medium green leaves. Stems"}, {"url": "http://www.missouribotanicalgarden.org/PlantFinder/PlantFinderDetails.aspx?kempercode=r550", "passage_text": "Burbank crossed Leucanthemum vulgare (European oxeye daisy), Leucanthemum maximum (Pyrenees chrysanthemum), Leucanthemum lacustre (Portuguese field daisy) and Nipponanthemum nipponicum (Japanese field daisy) to produce Leucanthemum x superbum which was given the common name of Shasta daisy. 'Becky' is larger than most other Shasta cultivars, growing 3-4' tall on rigid stems which do not require staking. Features 3-4 diameter flower heads with the classic white rays and yellow center disks and coarsely-toothed, lance-shaped, medium green leaves. Stems"}, {"url": "http://homeguides.sfgate.com/plant-grow-leucanthemum-becky-24290.html", "passage_text": "Becky Shasta daisy has a classic daisylike flower. Leucanthemum x superbum, commonly known as the Shasta daisy, is hardy in Sunset’s Climate Zones A1 to A3, 1 to 24, 28 to 43 and H1. Originally bred by Luther Burbank, Shasta daisies bear many-petaled white daisylike flowers with yellow centers. "}, {"url": "http://www.missouribotanicalgarden.org/PlantFinder/PlantFinderDetails.aspx?kempercode=r550", "passage_text": "Divide clumps every 2-3 years to maintain vigor. Leucanthemum x superbum, commonly called Shasta daisy, is a hybrid developed by Luther Burbank (1849-1926) in the 1890s near snow covered Mt. Shasta in northern California. 'Becky' is larger than most other Shasta cultivars, growing 3-4' tall on rigid stems which do not require staking. Features 3-4 diameter flower heads with the classic white rays and yellow center disks and coarsely-toothed, lance-shaped, medium green leaves. Stems"}, {"url": "http://www.missouribotanicalgarden.org/PlantFinder/PlantFinderDetails.aspx?kempercode=i380", "passage_text": "This cultivar can be grown from seed, and will bloom in the first year. Leucanthemum x superbum, commonly called Shasta daisy, is a hybrid developed by Luther Burbank (1849-1926) in the 1890s near snow covered Mt. Shasta in northern California. 'Snow Lady' is a compact, dwarf plant which typically grows on rigid stems to 12 tall. Features 2.5 diameter flower heads with the classic white rays and yellow center disks and coarsely-toothed, lance-shaped, medium green leaves. Stems do not require staking. Blooms most of the summer."}]