[{"url": "http://genealogy.familyeducation.com/surname-origin/dozier", "passage_text": "Save Name. Last name origin & meaning: French (Huguenot): from Old French osier ‘osier’, ‘willow’, with the preposition d(e) ‘from’, applied as a topographic name for someone who lived near a plantation of willows, or perhaps as a metonymic occupational name for a basket maker."}, {"url": "https://www.houseofnames.com/dozier-family-crest", "passage_text": "The Dozier Family Crest was acquired from the Houseofnames.com archives. The Dozier Family Crest was drawn according to heraldic standards based on published blazons. We generally include the oldest published family crest once associated with each surname. First found in Bavaria, where the name was anciently associated with the tribal conflicts of the area. They declared allegiances to many nobles and princes of early history, lending their influence in struggles for power and status within the region."}, {"url": "http://www.ancestry.com/name-origin?surname=dozier", "passage_text": "Click on a place to view Dozier immigration records. The information for this chart came from the U.S. Immigration Collection at Ancestry. You can find out where the majority of the Dozier families were living before they immigrated to the U.S and learn where to focus your search for foreign records. Immigration records can tell you an ancestor's name, ship name, port of departure, port of arrival, and destination. from the New York Passenger Lists. You can find out when most of the Dozier families immigrated to the United States. You can focus your search to immigration records dating from that era. Immigration records can tell you an ancestor's name, ship name, port of departure, port of arrival"}, {"url": "http://www.npr.org/2012/10/15/162941770/floridas-dozier-school-for-boys-a-true-horror-story", "passage_text": "Over the past decade, hundreds of men have come forward to tell gruesome stories of abuse and terrible beatings they suffered at Florida's Dozier School for Boys, a notorious, state-run institution that closed last year after more than a century. Dick Colon, one of the White House Boys, walks through grave sites near the Dozier School for Boys in Marianna, Fla. Several men who suffered abuse and severe beatings believe the crosses mark the graves of boys who were killed at the school, victims of punishments that went too far."}, {"url": "http://military.wikia.com/wiki/James_L._Dozier", "passage_text": "194,810 pages on this wiki. James Lee Dozier (born April 10, 1931) is a retired United States Army officer. In December 1981, he was kidnapped by the leftist Italian Red Brigades Marxist terrorist group. He was rescued by NOCS, an Italian anti-terrorist force, after 42 days of captivity. The Red Brigades held Brigadier General Dozier for 42 days until January 28, 1982, when a team of NOCS (a special operations unit of the Italian police) successfully carried out his rescue from an apartment in Padua, without firing a shot, capturing the entire terrorist cell."}, {"url": "https://www.houseofnames.com/dozier-family-crest", "passage_text": "Dozier Early Origins. First found in Bavaria, where the name was anciently associated with the tribal conflicts of the area. They declared allegiances to many nobles and princes of early history, lending their influence in struggles for power and status within the region."}, {"url": "https://en.wikipedia.org/wiki/James_L._Dozier", "passage_text": "James Lee Dozier (born April 10, 1931) is a retired United States Army officer. In December 1981, he was kidnapped by the Italian Red Brigades Marxist militant group. He was rescued by NOCS, an Italian SWAT force, after 42 days of captivity. Dozier was raised in central Florida a graduate of the United States Military Academy at West Point in 1956. He went to the Armored School at Fort Knox, Kentucky, for basic and advanced training in armored warfare."}, {"url": "http://www.tampabay.com/news/after-a-century-of-pain-former-arthur-g-dozier-school-for-boys-closes/1178208", "passage_text": "After a century of pain, former Arthur G. Dozier School for Boys closes. BEN MONTGOMERY Tampa Bay Times. Thursday, June 30, 2011 9:02pm. MARIANNA — He drove up from Fort Walton Beach, to the front gate, and by the time he arrived his daughter's text had come through. I'm proud of you. "}, {"url": "http://www.ancestry.com/name-origin?surname=dozier", "passage_text": "Dozier Name Meaning. French (Huguenot): from Old French osier ‘osier’, ‘willow’, with the preposition d(e) ‘from’, applied as a topographic name for someone who lived near a plantation of willows, or perhaps as a metonymic occupational name for a basket maker. Not in MTL or Jette. jetté You can find out when most of the Dozier families immigrated to the United States. You can focus your search to immigration records dating from that era. Immigration records can tell you an ancestor's name, ship name, port of departure, port of arrival and destination."}]