[{"url": "http://www.textileschool.com/articles/375/woven-fabrics", "passage_text": "Buckram. It is a stiff coated fabric made from a light weight loosely woven fabric, impregnated with adhesives and fillers. This fabric is used as interfacing so as to provide support and shape rentention to necklines, collars, belts, cuffs, waist bands, button closures etc in garments. Lawn. Lawn is a fine sheet, light weight, crisp fabric either made in cotton or linen. Various finishes are given to this fabric, in which the fabric is called by the name of the finish. It is mainly used as lining in dress."}, {"url": "http://whatthecraft.com/what-is-the-difference-between-knit-fabrics-and-woven-fabrics/", "passage_text": "When you think of woven fabrics, think of fabric you’d use to make a quilt or curtains or upholstery. Woven fabric is generally crisp and not stretchy*. It can be as thin as chiffon or as thick as denim. *Some woven fabrics, like stretch denim or stretch poplin, have spandex woven in to give it some stretch. A stretch poplin may have 15% stretch across the grain, which means a 10″ piece of fabric can stretch up to 11.5″. When you think of knit fabrics, think of t-shirts and leggings. "}, {"url": "http://www.differencebetween.com/difference-between-knit-and-vs-woven/", "passage_text": "When it comes to woven fabric, two or more yarns are interlaced through an ancient weaving art. There the two yarns or threads that are called warp and weft in a loom. The loom converts the threads into fabric. A distinguishing feature of woven fabrics is the lack of stretch. • Woven fabric does not have a problem with washing. Now, that you know the difference between knit and woven, there is an important fact to remember. Stretchability is an important consideration that needs to be kept in mind when deciding on one of the two fabric making methods."}, {"url": "http://www.bbc.co.uk/schools/gcsebitesize/design/textiles/fabricsrev1.shtml", "passage_text": "Woven fabrics. Woven fabrics are made up of a weft-the yarn going across the width of the fabric-and a warp-the yarn going down the length of the loom. The side of the fabric where the wefts are double-backed to form a non-fraying edge is called the selvedge. There are three types of woven fabrics. In satin-weave fabric there is a complex arrangement of warp and weft threads, which allows longer float threads either across the warp or the weft. The long floats mean the light falling on the yarn doesn't scatter and break up, like on a plain-weave."}, {"url": "http://www.craftsy.com/blog/2013/06/knit-vs-woven-fabrics/", "passage_text": "The concept of knit vs. woven fabrics didn’t occur to me until I started knitting. Watching that needle create loops, dipping in and out of each stitch, is fascinating. It’s even more fascinating when you think about it as a fabric that clothes your body. For sewists, knit fabrics are more difficult to work with because they stretch and the edges curl. Beginner sewists, beware! But the nice thing about knit fabrics is that they are usually softer and a bit more breathable than woven fabrics. Read more about identifying knit fabrics on Threads Magazine’s site."}, {"url": "http://www.differencebetween.com/difference-between-knit-and-vs-woven/", "passage_text": "Most of the woven fabrics have a right side and a wrong side that is known as soon as you see the fabric. When it comes to the edges of the woven fabric, the lengthwise edges are strong and they do not move. However, the cut edge or the width of the fabric frays. • Woven fabric does not have a problem with washing. Now, that you know the difference between knit and woven, there is an important fact to remember. Stretchability is an important consideration that needs to be kept in mind when deciding on one of the two fabric making methods."}, {"url": "http://www.craftsy.com/blog/2013/06/knit-vs-woven-fabrics/", "passage_text": "Woven fabrics are often used in sewing, and they’re treated a bit differently than knit fabrics. They unravel easily, so the edges need to be finished with something as simple as a zigzag stitch or something as professional as a serger. For sewists, knit fabrics are more difficult to work with because they stretch and the edges curl. Beginner sewists, beware! But the nice thing about knit fabrics is that they are usually softer and a bit more breathable than woven fabrics. Read more about identifying knit fabrics on Threads Magazine’s site."}, {"url": "https://en.wikipedia.org/wiki/Woven_fabric", "passage_text": "Woven fabric only stretches diagonally on the bias directions (between the warp and weft directions), unless the threads used are elastic. Woven fabric cloth usually frays at the edges, unless techniques are used to counter it, such as the use of pinking shears or hemming. "}, {"url": "http://www.textileschool.com/articles/375/woven-fabrics", "passage_text": "Woven Fabrics. Woven fabrics are made by using two or more sets of yarn interlaced at right angles to each other. Much variety is produced by weaving. Woven fabrics are generally more durable. Lawn. Lawn is a fine sheet, light weight, crisp fabric either made in cotton or linen. Various finishes are given to this fabric, in which the fabric is called by the name of the finish. It is mainly used as lining in dress."}]