[{"url": "http://beersmith.com/blog/2008/04/10/growing-hops-in-the-garden-how-to-grow-beer-hops/", "passage_text": "Location for Growing Hops. Select an area with plenty of sun. Hops need at least 6-8 hours of sun a day, so the South facing side of your home or an exposed site is a good location. Hop vines (called bines) can grow to over 25 feet and weigh over 20 pounds, so vertical space for a trellis is important as well."}, {"url": "http://homeguides.sfgate.com/growing-zones-hops-63095.html", "passage_text": "Hops (Humulus lupulus) are deciduous, perennial vines that grow 15 to 25 feet tall and will climb a trellis, arbor or other structure. The lush foliage creates a quick visual barrier during the growing season and the green papery flowers attract butterflies to the garden in late summer."}, {"url": "http://www.wikihow.com/Grow-Hops-for-Brewing-Beer", "passage_text": "Buy hop rhizomes. Hop plants are grown from hop rhizomes, pieces of a hop plant that sprout into a new plant. Rhizomes are available early in the spring, when hop farmers dig them up and sell them to suppliers. Order rhizomes online or check with your local nursery."}, {"url": "http://herbgardening.com/growinghops.htm", "passage_text": "Most commonly grown in hop yards, but can easily be grown in backyards and containers as well. Hop bines can typically grow to heights of 25 feet (7.6 meters) or more, although some shorter vining cultivars are available. Space hop bines 24 to 36 inches (60-90 cm) apart in rows that are spaced every 10 to 15 feet."}, {"url": "http://homebrew.stackexchange.com/questions/3262/what-is-the-ideal-climate-for-growing-hops", "passage_text": "up vote 5 down vote accepted. Hops can grow well anywhere between the 30th and 50th parallels. How well they do in a small-scale, home gardener setting is really up to how good of a gardener you are, which in turn comes down to how dedicated you are to their upkeep."}, {"url": "http://www.brewery.org/library/HopGrow.html", "passage_text": "Height is very closely linked to the amount of sunshine the plant gets. Hops grow best in full sun and you should pick a spot with the best possible southern exposure. Hops grow best in loose, well drained soil."}, {"url": "http://www.morebeer.com/brewingtechniques/library/backissues/issue2.3/montell.html", "passage_text": "If you choose to grow hops at home they can deliver a great deal of satisfaction as well, bringing you one step closer to a truly unique hand-crafted beer. The hop is a hardy, perennial plant that is easily grown at home, provided sufficient sun and climbing space are available."}, {"url": "http://www.picobrewery.com/askarchive/growhops.htm", "passage_text": "With a couple of plants, you can grow all the hops your homebrew will need. In the meantime, they'll be a pleasant herbal addition to your back yard. To see what you're in for, check out my hop garden at: http://www.picobrewery.com/hopgardn.html. Hops grow from root cuttings known as rhizomes."}]