[{"url": "http://nla.gov.au/nla.party-707075", "passage_text": "She also swam in the company of Mina Wylie, who won the silver medal. The Australian Olympic Committee made a last minute decision to send both her and her father to be official coach. Along with Fanny's sister, who went along as chaperone, they comprised the first ever Australian Olympic Ladies Swimming team. Sarah (Fanny) Durack (1889-1956), swimmer, was born on 27 October 1889 at Elizabeth Street, Sydney, third daughter and sixth child of Irish parents Thomas Durack, publican, a relation of Patrick Durack,... View the full record at Australian Dictionary of Biography."}, {"url": "http://adb.anu.edu.au/biography/wylie-wilhemina-mina-15656", "passage_text": "Wilhemina (Mina) Wylie (1891-1984), swimmer, was born on 27 June 1891 in North Sydney, second of three children of Irish-born Henry Alexander Wylie, house-painter, and his Queensland-born wife Florence Ann, nee Née. Beers Henry wylie was The australasian-distance diving champion in. 1896 In some years she was outstanding in every event at the Australian championships and in 1922 won the New South Wales 880-yards title by an extraordinary 110 yards. From 1928 to 1970 Miss Wylie taught swimming at Presbyterian Ladies’ College, Pymble. In 1975 she was elected to the International Swimming Hall of Fame."}, {"url": "http://nla.gov.au/nla.party-707075", "passage_text": "Australian Women's Register. Sarah (Fanny) Durack battled local swimming authorities to become the first Australian woman to compete at the Olympic Games. In 1912, at Stockholm, she won the gold medal in the 100 meters freestyle event, beating her compatriot and training partner, Wilhelmina (Mina) Wylie. Sarah (Fanny) Durack (1889-1956), swimmer, was born on 27 October 1889 at Elizabeth Street, Sydney, third daughter and sixth child of Irish parents Thomas Durack, publican, a relation of Patrick Durack,... View the full record at Australian Dictionary of Biography."}, {"url": "http://adb.anu.edu.au/biography/wylie-wilhemina-mina-15656", "passage_text": "Mina attended Caerleon College, Randwick. At the age of 5 Mina joined with her father and two brothers in an aquatic act, in which she swam with her hands and feet tied. She competed in the first New South Wales ladies’ championships in 1902, coming second in the under-10 27-yards handicap. In some years she was outstanding in every event at the Australian championships and in 1922 won the New South Wales 880-yards title by an extraordinary 110 yards. From 1928 to 1970 Miss Wylie taught swimming at Presbyterian Ladies’ College, Pymble. In 1975 she was elected to the International Swimming Hall of Fame."}, {"url": "http://adb.anu.edu.au/biography/durack-sarah-fanny-6063", "passage_text": "On 15 July she won the gold medal for the 100 metres, the only individual event for women, beating fellow Australian Wilhelmina (Mina) Wylie. Her Olympic success led to tours with Mina Wylie in Europe and the United States of America, but Fanny's career continued to be dogged by controversy. Between 1912 and 1918 she had broken twelve world records, including swims of 100 yards (91 m) in 1 minute 6 seconds, 100 metres in 1 minute 16.2 seconds, and 1 mile (1.6 km) in 26 minutes 8 seconds."}, {"url": "http://treasure-explorer.nla.gov.au/treasure/fanny-duracks-1912-olympic-gold-medal/resources", "passage_text": "When Fanny Durack began swimming at Wylie Baths, Coogee, she discovered that she wasn’t the only girl interested in swimming. The owner of the baths, Henry Wylie, had a daughter named Mina (short for Wilhelmina). Mina was also a keen swimmer and although she was seven years younger than Durack, they became great friends through training together. At the Wylie Baths they came to perfect their swimming. On 7 April 1906, the Ladies Amateur Swimming Association held its first carnival. Durack won the breaststroke event, followed in second by Wylie. The formation of the NSWLASA was a positive step for female competitors, as it allowed for the recognition and recording of achievements and times made by the women."}, {"url": "http://www.brewsterhjorth.com.au/news_detail.php?id=17", "passage_text": "Marricville Council engages bha to bring a new lease of carbon neutral life to the Fanny Durack Aquatic Centre. Fanny Durack was born Sarah Frances Durack on 27 October 1889 in Sydney. The new President, Mrs Hugh McIntosh, wife of a boxing promoter, opened a public fund to help pay their expenses.Gold at StockholmAt Stockholm Durack set a new world record in the heat of the 100 metre freestyle."}, {"url": "http://www.babynology.com/american-mcelebritywylie.html", "passage_text": "Paul Stanton Wylie: is an American figure skater and 1992 Olympic silver medalist. Born in Dallas, Texas, Wylie began skating at the age of three. At age eleven, his family moved to Denver, Colorado, where he began to train with Carlo Fassi. Please use this list of American baby names only for reference/idea to name your kid/child. Database of baby names has been compiled from various references and suggestions provided by our web site visitors and resources partners. © Copyright 2015 Babynology."}, {"url": "http://adb.anu.edu.au/biography/wylie-wilhemina-mina-15656", "passage_text": "Wilhemina (Mina) Wylie (1891-1984), swimmer, was born on 27 June 1891 in North Sydney, second of three children of Irish-born Henry Alexander Wylie, house-painter, and his Queensland-born wife Florence Ann, nee Née. beers In some years she was outstanding in every event at the Australian championships and in 1922 won the New South Wales 880-yards title by an extraordinary 110 yards. From 1928 to 1970 Miss Wylie taught swimming at Presbyterian Ladies’ College, Pymble. In 1975 she was elected to the International Swimming Hall of Fame."}]