[{"url": "https://answers.yahoo.com/question/index?qid=20090320164427AAUjblX", "passage_text": "In terms of biomass, some think that Copepods or Krill are the most abundant animals on earth. They are both types of zooplankton, and their abundance explains why some whales can subsist on such small prey. However, they may be the most abundant multicellular animals."}, {"url": "http://chemistry.about.com/cs/howthingswork/f/blabundant.htm", "passage_text": "All of the other elements are relatively rare. The chemical composition of the earth is quite a bit different from that of the universe. The most abundant element in the earth's crust is oxygen, making up 46.6% of the earth's mass. Silicon is the second most abundant element (27.7%), followed by aluminum (8.1%), iron (5.0%), calcium (3.6%), sodium (2.8%), potassium (2.6%). and magnesium (2.1%)."}, {"url": "http://www.answers.com/Q/What_is_the_most_abundant_species_on_earth", "passage_text": "Confidence votes 9. Bacteria are the most abundant species on earth. Their total number cannot be exactly known, but estimate puts it at around 5 x 1030. There could be as many as one billion species. A link can be found below to the study and its results."}, {"url": "http://infohost.nmt.edu/~klathrop/Elements%20In%20Living%20things.doc", "passage_text": "The element hydrogen is a gas, and it is the most abundant element in the universe. Most of the hydrogen on earth is combined with other elements. Hydrogen gas is so light that it easily escapes the earth's gravity at the upper edges of the atmosphere and is lost into outer space."}, {"url": "http://www.kgbanswers.com/which-of-the-following-is-the-most-abundant-group-of-organisms-on-earth-aprotists-bplants-cbacteria-dfungi/7409845", "passage_text": "Which of the following is the most abundant group of organisms on earth? a.Protists b.Plants c.Bacteria d.Fungi."}, {"url": "http://www.answers.com/Q/What_is_the_most_abundant_species_on_earth", "passage_text": "Bacteria are not a species of life. They are a domain, which is the broadest classification of life. The most abundant domain on Earth is certainly bacteria and the most abundant species on Earth is likely a particular species of bacteria."}]