[{"url": "http://www2.ed.gov/admins/lead/safety/crisisplanning.html", "passage_text": "Taking action now can save lives, prevent injury, and minimize property damage in the moments of a crisis. If you do not have a crisis plan in place, it is time to develop one. If you have one, review, practice, and update your plan. This brochure is designed to assist schools and communities in either situation."}, {"url": "http://whatis.techtarget.com/definition/crisis-management", "passage_text": "The field of crisis management is generally considered to have originated with Johnson & Johnson's handling of a situation in 1982, when cyanide-laced Tylenol killed seven people in the Chicago area."}, {"url": "https://www.lclark.edu/live/profiles/3653-crisis-managment-plan-policy", "passage_text": "The Crisis Management Plan is designed to effectively coordinate the use of College and community resources to protect life and property during and immediately following a major crisis or disturbance on the Lewis & Clark College Campus."}, {"url": "http://www2.ed.gov/admins/lead/safety/crisisplanning.html", "passage_text": "A crisis is the time to follow the crisis plan and make use of your preparations. Determine if a crisis is occurring. Identify the type of crisis that is occurring and determine the appropriate response. Activate the incident management system. Ascertain whether an evacuation, reverse evacuation, lockdown, or shelter-in-place needs to be implemented."}, {"url": "http://www.maine.gov/dhhs/samhs/mentalhealth/rights-legal/crisis-plan/home.html", "passage_text": "1 Sample Crisis Plan with Instructions (Word* | also in PDF 2  *). The purpose of this document is for you (a mental health consumer) to create a plan you and or your providers can access when you are having a hard time."}, {"url": "http://www.mysticmadness.com/how-to-react-to-crisis-in-office.html", "passage_text": "Case Study Of Crisis Management Strategies. To explain how to react to crisis in office, case study of two companies and how they where able to solve their crisis situation will be examined. First on the line is the case of Pepsi Corporation."}, {"url": "http://whatis.techtarget.com/definition/crisis-management", "passage_text": "Crisis management is the application of strategies designed to help an organization deal with a sudden and significant negative event. A crisis can occur as a result of an unpredictable event or as an unforeseeable consequence of some event that had been considered a potential risk."}, {"url": "http://www2.ed.gov/admins/lead/safety/crisisplanning.html", "passage_text": "A crisis is the time to follow the crisis plan and make use of your preparations. 1  Determine if a crisis is occurring. 2  Identify the type of crisis that is occurring and determine the appropriate response. 3  Activate the incident management system. 4  Ascertain whether an evacuation, reverse evacuation, lockdown, or shelter-in-place needs to be 5  ... Mainta"}]