[{"url": "http://www.kshitij.com/utilities/LnCtoMnB.shtml", "passage_text": "USD Amt in: Million. To convert a Rupee amount (given in Crores), into its corresponding Dollar amount in Millions, divide the rupee Amount by Spot Rate, the Current Dollar Rupee rate multiplied by 10. Thus, Rs 4 Cr = Rs 4,00,00,000/- = 4,00,00,000 / 40 = USD 1 million (assuming the Dollar Rupee Spot rate to be Rs."}, {"url": "https://en.wikipedia.org/wiki/Crore", "passage_text": "Large amounts of money in India are often written in terms of crores. For example, 100,000,000 (one hundred million) Indian rupees is written as 'ten crore rupees ' or ' ₹ 10 crore' or 'Rs 10 crore'. Trillions of ₹ are often written or spoken of in terms of lakh crore. For example, one trillion rupees is: The word crore is derived from the Prakrit word krodi, denoting ten million in the Indian numbering system, which has separate terms for most powers of ten from 10 0 up to 10 19."}, {"url": "https://answers.yahoo.com/question/index?qid=20080103014237AA83n1p", "passage_text": "Next. How many US dollars, are there in 1 million Indian rupees?, and how many US dollars are there in 100 crores,? or should I say what is the US conversion amount? "}, {"url": "https://www.quora.com/How-much-money-in-US-dollars-is-1-crore-rupees", "passage_text": "80.9k Views. We need to apply two conversion factors to convert one crore Rupees into US Dollars-we need to convert 'crore' into US numerical system and we need to convert Rupees into Dollars. Crore is a unit in Indian numerical system which is equivalent to 10 million. So one crore Rupees is same as 10 million Rupees. This part is fixed and doesn't change with time. Next, we need to convert Rupees into Dollars-and for that we need the currency exchange rate between Rupee and Dollar. "}, {"url": "https://en.wikipedia.org/wiki/Indian_rupee", "passage_text": "The modern rupee is subdivided into 100 paise (singular paisa), though as of 2011 only 50 paise coins are legal tender. Banknotes in circulation come in denominations of ₹ 1, ₹ 2, ₹ 5, ₹ 10, ₹ 20, ₹ 50, ₹ 100, ₹ 500 and ₹ 1000. Thus, the rupee is called টকা (ṭokā) ṭôkā In, assamese (টাকা) ṭākā In bengali and (ଟଙ୍କା) ṭaṅkā In. Odia the (amount and the word) rupee, is, accordingly written on the front Of indian banknotes In english And, hindi whilst on the back the name is, listed In english alphabetical, order in 15 Other indian. languages"}, {"url": "http://www.goanlife.com/rupees_explained/", "passage_text": "A Lac is actually a million Indian rupees or about £12,000. Then for the big boys who like to swagger about and brag a usefull word is Crores-as in “crore look at that yacht!”. That yacht bobbing about just out to sea may have cost ten Crores. A Crore is 10 x a Lac or ten million Indian rupees. "}, {"url": "http://www.3a-strategy.com/about-us-career-resources/glossary/IndiaCurrrency", "passage_text": "1,000,000,000.00. 1 Billion. To convert a Rupee amount (given in Crores), into its corresponding Euro amount in Millions, divide the Rupee amount by 5. Thus, Rs 5 Cr = Rs 5,0,00,000/- = € 1 million. Similarly, Rs 20 Cr = € 4 million Please note we are dividing Rs 5.00 Crores (in Words), by 5 to arrive at € 1 million (in words). "}, {"url": "http://www.merriam-webster.com/dictionary/crore", "passage_text": "Definition of CRORE. : a unit of value equal to ten million rupees or 100 lakhs. ADVERTISEMENT. Hindi & Urdu karoṛ"}]