[{"url": "http://www.ebay.com/gds/Panax-Ginseng-Get-More-Energy-Naturally-/10000000000709131/g.html", "passage_text": "Panax Ginseng. Benefits of Panax Ginseng : Ginseng is a medicinal herb used primarily for increased stamina, and for boosting the immune system and immune system responses. It is used to help relieve fatigue, increasing one's capacity to work and. concentrate."}, {"url": "https://www.organixherbalsupplements.com/herbal/ingredient-info/panax-ginseng.html", "passage_text": "In Western medicine, Panax ginseng is used as a stimulant to make people more active. But, in contrast, in Traditional Chinese Medicine (TCM), Panax ginseng is used to make people feel calmer. It is also widely used in China for the heart and blood vessels. Some people use Panax ginseng to treat breast cancer and prevent ovarian cancer, liver cancer, lung cancer, and skin cancer. Other uses include treatment of anemia, diabetes, inflammation of the stomach lining (gastritis), fever, hangover, chronic obstructive pulmonary disease (COPD), and asthma."}, {"url": "http://www.webmd.com/vitamins-supplements/ingredientmono-1000-GINSENG,%20PANAX.aspx?activeIngredientId=1000&activeIngredientName=GINSENG,%20PANAX", "passage_text": "In Western medicine, Panax ginseng is used as a stimulant to make people more active. But, in contrast, in Traditional Chinese Medicine (TCM), Panax ginseng is used to make people feel calmer. It is also widely used in China for the heart and blood vessels. Some people use Panax ginseng to treat breast cancer and prevent ovarian cancer, liver cancer, lung cancer, and skin cancer. Other uses include treatment of anemia, diabetes, inflammation of the stomach lining (gastritis), fever, hangover, chronic obstructive pulmonary disease (COPD), and asthma."}, {"url": "https://www.organixherbalsupplements.com/herbal/ingredient-info/panax-ginseng.html", "passage_text": "Panax ginseng is a plant. People use the root to make medicine. Panax ginseng is used for improving thinking, concentration, memory and work efficiency, physical stamina, and athletic endurance. Some people use Panax ginseng to help them cope with stress and as a general tonic for improving well-being. Some people use Panax ginseng to treat breast cancer and prevent ovarian cancer, liver cancer, lung cancer, and skin cancer. Other uses include treatment of anemia, diabetes, inflammation of the stomach lining (gastritis), fever, hangover, chronic obstructive pulmonary disease (COPD), and asthma."}, {"url": "http://www.webmd.com/vitamins-supplements/ingredientmono-1000-GINSENG,%20PANAX.aspx?activeIngredientId=1000&activeIngredientName=GINSENG,%20PANAX", "passage_text": "GINSENG, PANAX Overview Information. Panax ginseng is a plant. People use the root to make medicine. Do not confuse Panax ginseng with American ginseng, Siberian ginseng, or Panax pseudoginseng. See the separate listings for American ginseng and Siberian ginseng. Panax ginseng is used for improving thinking, concentration, memory and work efficiency, physical stamina, and athletic endurance. Some people use Panax ginseng to help them cope with stress and as a general tonic for improving well-being. Some people use Panax ginseng to treat breast cancer and prevent ovarian cancer, liver cancer, lung cancer, and skin cancer. Other uses include treatment of anemia, diabetes, inflammation of the stomach lining (gastritis), fever, hangover, chronic obstructive pulmonary disease (COPD), and asthma."}, {"url": "http://en.mr-ginseng.com/ginseng-panax/", "passage_text": "Ginseng: Composition. Panax Ginseng is a very nutritionally rich plant. Ginseng root is rich in amino acids (particularly essential amino acids) and numerous mineral elements: aluminium, arsenic, calcium, cobalt, copper, iron, magnesium, manganese, phosphor, potassium, silica, zinc. Ginseng (Panax Ginseng C.A. Meyer) originated in China and North Korea, and has been used for more than 4,000 years. The plant became known as the “root of life” due to its energizing effects."}, {"url": "http://en.mr-ginseng.com/ginseng-panax/", "passage_text": "Ginseng (Panax Ginseng C.A. Meyer) originated in China and Korea and has been used for more than 4,000 years. The plant is often considered a panacea, meaning it is capable of treating all kinds of illnesses and diseases. Ginseng (Panax Ginseng C.A. Meyer) originated in China and North Korea, and has been used for more than 4,000 years. The plant became known as the “root of life” due to its energizing effects."}]