[{"url": "http://www.wikihow.com/End-Your-Period", "passage_text": "A set of regular birth control pills is designed to be similar to the menstrual cycle. There are normally 21 hormone pills (composed of the hormones that control your cycle) and 7 placebo pills that don't contain hormones. In a normal pill cycle, when you take the placebo pills, you bleed. If you skip the placebos and go straight to the next pack of hormone pills, that bleeding won't occur."}, {"url": "http://babybumbleb.com/stop-period-early/", "passage_text": "Contraceptives: Factor in taking birth control pills. Women on contraceptives have their periods end early. This method will you help you on how to stop your period early, on regular basis, rather than only one single event, as it takes one or two cycles for the contraceptive to alter your menstrual cycle."}, {"url": "http://www.wikihow.com/Stop-Your-Period-Early", "passage_text": "Menstruation for some women can be extremely painful, and a heavy flow makes for an unpleasant period. There are ways to shorten, lighten, or even stop your period, depending on your needs. Always consult your doctor first, but if you need a few quick tips about how to stop your period, read on. Ad."}, {"url": "http://babybumbleb.com/make-period-stop/", "passage_text": "The menstrual cycle approximately lasts for 3-7 days, a period that goes for more days than the average, are questionable. The complications that come with periods such as cramping and discomforts could have left you wondering, as a woman, if there is a method with effective results, on how to make your period stop."}, {"url": "http://www.wikihow.com/Stop-Your-Period-Early", "passage_text": "1. Discuss a long-term option with your doctor. To stop periods for around 1-2 years, you can get an injection called Depo-Provera. This is an injected that you receive on a regular basis from your GP. 1  There are surgical options available to permanently stop periods."}, {"url": "https://www.healthtap.com/topics/ways-to-stop-your-period-early", "passage_text": "How to stop your period early i really want to stop it now. 4. Get help from a doctor now ›. Talk to her, see gyn: You should take her to an appointment with a gyn together-if possible, because birth control pills are the best way to stop your periods."}, {"url": "http://babybumbleb.com/stop-period-early/", "passage_text": "Most women wish their periods away because of the unpleasantness that come with menstruation such as cramping, back discomfort and headaches. Regardless of your reasons, if you are looking for ways on how to stop your period early, here are some methods you can use based on your individual need."}, {"url": "http://www.wikihow.com/End-Your-Period", "passage_text": "1. Decide if you want to stop your period altogether. The only way you can really control your menstrual flow is by taking menstrual suppression medication, which is a type of birth control that either limits your flow to a few times a year or stops it"}]