[{"url": "http://www.mayoclinic.org/steroids/ART-20045692", "passage_text": "Corticosteroids also suppress your immune system, which can help control conditions in which your immune system mistakenly attacks its own tissues. Corticosteroid medications are used to treat rheumatoid arthritis, lupus, asthma, allergies and many other conditions. They also treat conditions such as Addison's disease, in which the adrenal glands don't produce enough steroids, and help prevent organ rejection in transplant recipients. You can take corticosteroids: Corticosteroid medications — including cortisone, hydrocortisone and prednisone — have great potential in the treatment of a variety of conditions, from rashes to lupus to asthma."}, {"url": "https://paindoctor.com/treatments/steroid-medications/", "passage_text": "Steroid medications include corticosteroids and the androgen and anabolic steroids. Corticosteroids are used to treat inflammatory, allergic, and autoimmune conditions as well as adrenal insufficiency. Corticosteroids are widely used for their ability to reduce pain and inflammation. For musculoskeletal pain, corticosteroids are often used in conjunction with treatments such as rest, ice, physical therapy, and non-steroidal anti-inflammatory medications. Corticosteroid treatment is often considered a conservative alternative to surgery and can quickly improve a person’s ability to function."}, {"url": "http://drugs.nmihi.com/corticosteroids.htm", "passage_text": "About corticosteroids. Corticosteroids are a type of anti–inflammatory medication that is effective in the treatment and prevention of allergic reactions and asthma attacks. While there are several types of corticosteroids, all work on the same principal – reducing or preventing inflammation. Patients should not take corticosteroid drugs if they have been diagnosed with any of the following conditions: 1  Diabetes mellitus (sugar diabetes). 2  A disease in which the body cannot adequately process glucose (blood sugar) for energy. 3  Some types of corticosteroids affect blood glucose control. 4  Cirrhosis."}, {"url": "http://www.livestrong.com/article/27014-list-corticosteroid-medications/", "passage_text": "Overview. Corticosteroids are a type of steroid hormones that are produced in the adrenal cortex. When the adrenal cortex does not produce enough of these hormones, synthetic versions of the hormones may be administered to prevent unwanted symptoms"}, {"url": "http://my.clevelandclinic.org/health/drugs_devices_supplements/hic_Corticosteroids", "passage_text": "Corticosteroids are man-made drugs that closely resemble cortisol, a hormone that your adrenal glands produce naturally. Corticosteroids are often referred to by the shortened term steroids.. Corticosteroids are different from the male hormone-related steroid compounds that some athletes abuse. "}, {"url": "http://medical-dictionary.thefreedictionary.com/Systemic+Corticosteroids", "passage_text": "Definition. Corticosteroids are a group of drugs which are chemically related to the hormones produced by the adrenal glands as a response to adrenocorticotropic hormone (ACTH), but excluding the sex hormones that are produced by this gland. The primary adrenal corticosteroids are cortisol and aldosterone"}, {"url": "http://www.pamf.org/asthma/medications/oral/corticosteroids.html", "passage_text": "Oral corticosteroids are more likely to cause side effects than inhaled corticosteroids because they are carried to all parts of the body. Inhaled corticosteroids only go to the lungs. The possibility for side effects is low when a short burst is used. Oral corticosteroids are used in combination with short acting beta agonists (also called bronchodilators or rescue medicines) to treat moderate to severe asthma flare-ups. Corticosteroids reduce inflammation and swelling in the airways. During an asthma attack, the inside walls of the airways swell and narrow."}, {"url": "http://drugs.nmihi.com/corticosteroids.htm", "passage_text": "Most corticosteroids used to treat allergies and asthma reduce or prevent inflammation in the respiratory tract to relieve or avoid airway blockages. Corticosteroids are considered the most effective medication currently available for the treatment of inflammation in the bronchial tubes. This drug type can be administered through several different methods. These include: 1  Inhaled methods (e.g., inhalers, nebulizers). Patients should not take corticosteroid drugs if they have been diagnosed with any of the following conditions: 1  Diabetes mellitus (sugar diabetes). 2  A disease in which the body cannot adequately process glucose (blood sugar) for energy. 3  Some types of corticosteroids affect blood glucose control. 4  Cirrhosis."}, {"url": "http://www.livestrong.com/article/27014-list-corticosteroid-medications/", "passage_text": "Budesonide. Budesonide is a corticosteroid used to treat asthma. The University of Maryland Medical Center indicates that this drug is available in oral capsule, oral inhalation and nasal spray forms. It can also be used in a nebulizer. This drug can cause side affects that interfere with normal function of several body systems. Corticosteroids are a type of steroid hormones that are produced in the adrenal cortex."}, {"url": "http://drugs.nmihi.com/corticosteroids.htm", "passage_text": "Corticosteroids are a type of anti–inflammatory medication that is effective in the treatment and prevention of allergic reactions and asthma attacks. Patients should not take corticosteroid drugs if they have been diagnosed with any of the following conditions: 1  Diabetes mellitus (sugar diabetes). 2  A disease in which the body cannot adequately process glucose (blood sugar) for energy. 3  Some types of corticosteroids affect blood glucose control. 4  Cirrhosis."}]