[{"url": "http://www.carsdirect.com/car-repair/how-much-should-replacement-brakes-cost", "passage_text": "If you wish to replace the discs on the front an average price for a set of brake pads is approximately $60.00 - $111.00 but depending on the make and model of your car it could cost a lot more than that. The pads need replacement on disc brakes on a regular basis. How often they need to be replaced will vary depending on your driving habits. The accepted lifespan of the front disc brake pads is roughly 30,000 miles."}, {"url": "http://blog.iseecars.com/2011/06/21/how-much-does-it-cost-to-replace-car-brakes/", "passage_text": "Keep in mind, this is the repair you’ll face most of the time. If you’re going to a local repair facility you can expect to pay somewhere in the range of $150 to $200 for replacement of the pads and rotors, on average. Nearly half of this cost is in parts, so you may want to consider that if you’re a do-it-yourselfer. If you’re getting front brakes done, you can look at roughly an hour or so at the shop, unless you require more than the standard pad/rotor replacement. If you’re getting rear brakes, look closer to two-to-three hours."}, {"url": "http://cars.costhelper.com/brakes.html", "passage_text": "1 CostHelper readers who bought the needed replacement parts and then paid a mobile mechanic or one at a local shop or gas station to install them report total costs of $80-$430, for an average of $251. I took it to this shop and they replaced the piston, the caliper, and the rotors for $300. The radio also didn't work so the guy bought a kenwood (expensive) without my consent and fixed the radio. I told him that I wanted to have it fixed at a later date but he had opened up that part of the car and fixed it already."}, {"url": "https://answers.yahoo.com/question/index?qid=20060913063821AAR8QXP", "passage_text": "it costs 55.00 per rotor and 30.00 for the brake pads. Front only 140.00 and rear obveously 140.00 Grand Total of 280.00 for the whole thing. Make sure that you need the rotors before you replace them though you may not need to replace them. Cost then only 60.00 bucks for the whole thing. If you are looking to do the work yourself, the parts are available at an auto parts store. Approx. $35 for each rotor (required for a front brake service) and approx. $40 for the front"}, {"url": "http://repairpal.com/estimator/brake-pad-and-rotor-replacement-cost", "passage_text": "Parts: $145 - $213. The average cost for a brake pad and rotor replacement is between $297 to $406. Labor costs are estimated between $152 to $193 while parts are priced between $145 to $213. Get a personalized estimate based on your location and specific car. Estimate does not include taxes and fees. Brake rotors should be measured at every brake pad replacement. If found to be at or below the manufacturer's minimum thickness specification, they will require replacement. These measurements should always be noted on your repair order. We recommend braking gently for the first 40 to 50 miles of driving on new pads."}, {"url": "http://cars.costhelper.com/brakes.html", "passage_text": "1 Edmunds provides do-it-yourself instructions for replacing brake pads, calling it an easier-than-expected DIY project that requires standard tools and takes about an hour, for a savings of about $250 in labor costs on most cars. I took it to this shop and they replaced the piston, the caliper, and the rotors for $300. The radio also didn't work so the guy bought a kenwood (expensive) without my consent and fixed the radio. I told him that I wanted to have it fixed at a later date but he had opened up that part of the car and fixed it already."}, {"url": "https://answers.yahoo.com/question/index?qid=20071214083445AA7EA1a", "passage_text": "Best Answer: some people might try to charge upwards of $150 for new brake pads.. If you look on the shop website if its a major place, you can find a place that can do it for $99 or sometimes $69. Ideally you want them to put new brake pads and resurface/machine the rotors. Rating Newest Oldest. "}, {"url": "http://www.carsdirect.com/car-repair/average-brake-repair-cost-for-each-brake-problem", "passage_text": "The average cost of master cylinder repair is usually between $200 and $300, but it can be more, again, depending on the scope of the fix. If individual wheel cylinders need to be replaced, the cost will go up. The repair price for an entire brake job—rotors, calipers, drums, pads, cylinders—can run you $750 or more. Therefore, it's best to stay on top of brake repair and get the pads replaced when you hear squeaking"}]