[{"url": "http://www.answers.com/Q/What_is_the_plural_for_glomerulus", "passage_text": "The glomerulus is a cluster of capillaries that can be found in the kidney. Each cluster is next to a Bowman's capsule, which is the filter unit of the nephron. Blood passes … from the renal artery into the glomerulus at high pressure, allowing small substances to diffuse into the nephron, via the Bowman's capsule. At the beginning of the nephron, the glomerulus /ɡlɒˈmɛrələs/ is a network (tuft) of c … apillariesthat performs the first step of filtering blood. The glomerulus is surrounded by"}, {"url": "https://en.wiktionary.org/wiki/glomerulus", "passage_text": "Wikipedia. glomerulus ‎(plural glomeruli). ( 1 anatomy) A small intertwined group of capillaries within nephrons of the kidney that filter the blood to make urine. 2  Any of several other similar intertwined masses of things."}, {"url": "http://medical-dictionary.thefreedictionary.com/glomeruli", "passage_text": "FILTRATION IN GLOMERULUS. 1. One of the capillary networks that are part of the renal corpuscles in the nephrons of the kidney. Each is surrounded by a Bowman's capsule, the site of renal (glomerular) filtration, which is the first step in the formation of urine. See: illustration. 2.A group of twisted capillaries or nerve fibers.he blood is filtered by the glomeruli. The blood then continues through the circulatory system, but a certain amount of fluid and specific waste products are filtered out of the blood, to be removed from the body in the form of urine."}, {"url": "http://medical-dictionary.thefreedictionary.com/glomerulus", "passage_text": "1. a small tuft or cluster, such as a small convoluted mass of capillaries. 2. a network of vascular tufts encased in the malpighian capsule of the kidney. adj., adj glomer´ular. The glomerulus is an integral part of the nephron, the basic unit of the kidney. Each nephron is capable of forming urine by itself, and each kidney has many nephrons. The specific function of each glomerulus is to bring blood (and the waste products it carries) to the nephron."}, {"url": "https://en.wikipedia.org/wiki/Glomerulus_(olfaction)", "passage_text": "(November 2007). The glomerulus (plural glomeruli) is a spherical structure located in the olfactory bulb of the brain where synapses form between the terminals of the olfactory nerve and the dendrites of mitral, periglomerular and tufted cells. "}, {"url": "http://www.medicinenet.com/script/main/art.asp?articlekey=19009", "passage_text": "The glomerulus in the kidney was so named by the Italian anatomist Marcello Malpighi (1628-1694). The structure was once called a malphigian corpuscle. Glomerulus is the diminutive of the Latin glomus meaning ball of yarn.. It is literally a little ball of yarn.. Plural: glomeruli."}, {"url": "http://www.medicinenet.com/script/main/art.asp?articlekey=19009", "passage_text": "Glomerulus: 1. In the kidney, a tiny ball-shaped structure composed of capillary blood vessels actively involved in the filtration of the blood to form urine. The glomerulus is one of the key structures that make up the nephron, the functional unit of the kidney.2.he glomerulus in the kidney was so named by the Italian anatomist Marcello Malpighi (1628-1694). The structure was once called a malphigian corpuscle. Glomerulus is the diminutive of the Latin glomus meaning ball of yarn.. It is literally a little ball of yarn.. Plural: glomeruli."}, {"url": "http://medical-dictionary.thefreedictionary.com/glomerulus", "passage_text": "FILTRATION IN GLOMERULUS. 1. One of the capillary networks that are part of the renal corpuscles in the nephrons of the kidney. Each is surrounded by a Bowman's capsule, the site of renal (glomerular) filtration, which is the first step in the formation of urine. See: illustration. 2.he glomerulus is an integral part of the nephron, the basic unit of the kidney. Each nephron is capable of forming urine by itself, and each kidney has many nephrons. The specific function of each glomerulus is to bring blood (and the waste products it carries) to the nephron."}, {"url": "http://www.answers.com/Q/What_is_the_plural_for_glomerulus", "passage_text": "In the kidney, a tubular structure called the nephron filters blood to form urine. At the beginning of the nephron, the glomerulus /ɡlɒˈmɛrələs/ is a network (tuft) of c … apillariesthat performs the first step of filtering blood. The glomerulus is surrounded by Bowman's capsule. The blood is filtered through the capillaries of the glomerulus into the Bowman's capsule. The Bowman's capsule empties the filtrate into a tubule that is also part of the nephron"}, {"url": "http://www.merriam-webster.com/dictionary/glomerulus", "passage_text": "Definition of GLOMERULUS. : a small convoluted or intertwined mass; especially: a tuft of capillaries at the point of origin of each vertebrate nephron that passes a protein-free filtrate to the surrounding Bowman's capsule.ADVERTISEMENT."}]