[{"url": "http://atitesting.com/ati_next_gen/skillsmodules/content/physical-assessment-child/equipment/ap_respiratory.html", "passage_text": "Respiratory examination. Begin the respiratory assessment by counting the respiratory rate and simply observing the child’s breathing pattern. If the child is old enough to understand, don’t tell him you are counting his respirations, as that may alter his breathing pattern. Palpation. A thorough respiratory assessment includes palpation over the anterior and posterior chest to assess chest movement, respiratory effort, for any deformities of the chest wall, and tactile fremitus. To palpate, press gently with your fingertips all over the chest wall in a systematic fashion."}, {"url": "http://www.osceskills.com/e-learning/subjects/respiratory-examination/", "passage_text": "The respiratory examination aims to pick up on any respiratory (breathing) pathology that may be causing a patient’s symptoms e.g. shortness of breath, cough, wheeze etc. "}, {"url": "http://webteach.mc.uky.edu/nursing/nur869/webquests/lab5/lab5.htm", "passage_text": "Evaluation. 1. Name the primary muscles of respiration. 2. Describe crepitus and its significance. 3. Describe the correct way to auscultate a patient s lung fields. 4. List risk factors associated with respiratory disability. 5. Name the five traditionally designated auscultatory areas of the heart. 6. "}, {"url": "http://www.wikihow.com/Measure-and-Record-Respiratory-Rate", "passage_text": "How to Measure and Record Respiratory Rate. Respiration is the process that occurs when oxygen is inhaled into the lungs, converted into energy via a chemical reaction and expelled as carbon dioxide. Normal respiration is an automatic process and does not require conscious effort."}, {"url": "https://en.wikipedia.org/wiki/Respiratory_examination", "passage_text": "Respiratory examination. In medicine, the respiratory examination is performed as part of a physical examination, or when a patient presents with a respiratory problem (dyspnea (shortness of breath), cough, chest pain) or a history that suggests a pathology of the lungs. "}, {"url": "http://www.coreknowledge.org/mimik/mimik_uploads/lesson_plans/1321/4_TheRespiratorySystem.pdf", "passage_text": "Fourth Grade, The Respiratory System 2005 Colorado Summer Writing Institute 16 Appendix B, page 2 Parts of the Respiratory System Answer Key Answers 1. diaphragm 2. nose 3. pharynx 4. trachea 5. bronchi 6. lungs 7. alveoli 8. larynx 9. bronchioles 10. Fourth Grade, The Respiratory System 2005 Colorado Summer Writing Institute 17 Appendix C Checklist for Body Diagrams 1. Nose labeled properly Y N 2. Nose in the correct place Y N 3. Pharynx (throat) labeled properly Y N 4. Pharynx in correct place Y N 5. Larynx (voice box) labeled properly Y N 6."}, {"url": "http://ww4.mgh.org/emt/Paramedic%20Student%20Library/RESPIRATORY%20ASSESSMENT%20LECTURE.pdf", "passage_text": "Palpation 3. Percussion 4. Auscultation Inspection involves using your eyes and ears to assess a variety of things regarding your patient. General Appearance Primary assessment General impression • Position • Color • Mental status • Ability to speak • Respiratory effort SKIN COLOR Around mouth/lips Nailbeds. "}, {"url": "http://www.rnceus.com/resp/resphx.html", "passage_text": "Taking a Respiratory History. Every non-emergent assessment should begin by introducing yourself to the patient; provide your name, credentials and your role within the care team. Verify the identity of the patient and her reason for seeking care. Communicate the purpose and value of a thorough respiratory history and elicit the patient's consent. When doing your assessment, keep in mind these six important respiratory symptoms: 1  cough, 2  sputum production, 3  dyspnea, 4  hemoptysis, 5  chest pain, and. 6  wheezing."}, {"url": "http://www.coreknowledge.org/mimik/mimik_uploads/lesson_plans/1321/4_TheRespiratorySystem.pdf", "passage_text": "Fourth Grade, The Respiratory System 2005 Colorado Summer Writing Institute 2 3. The Lungs: Learning How We Breathe, by Chris Hayhurst B. For Students 1. Kindergarten – The Human Body – The Sense of Smell 2. First Grade – The Human Body – Body Systems 3. Third Grade – The Human Body _ The Skeletal System 4. Fourth Grade, The Respiratory System 2005 Colorado Summer Writing Institute 17 Appendix C Checklist for Body Diagrams 1. Nose labeled properly Y N 2. Nose in the correct place Y N 3. Pharynx (throat) labeled properly Y N 4. Pharynx in correct place Y N 5. Larynx (voice box) labeled properly Y N 6."}, {"url": "http://www.atitesting.com/ati_next_gen/skillsmodules/content/physical-assessment-adult/equipment/respiratory_assessment.html", "passage_text": "Observe respiratory rate and rhythm. Begin the respiratory assessment by counting your patient s respiratory rate and simply observing his breathing pattern. Don t tell the patient you are counting his respirations, as that may alter his breathing pattern. A thorough respiratory assessment includes palpation and percussion over the anterior and posterior chest. To palpate, press gently with your fingertips all over the chest wall in a systematic fashion."}]