[{"url": "http://www.insideradiology.com.au/pages/view.php?T_id=73", "passage_text": "The Arthrogram itself usually takes about 15 minutes. You may then have to wait a short time before having the scan performed. A subsequent MRI scan may take 30-45 minutes and a CT scan may take 15 minutes, depending on the joint and the number of scans that have to be done. You should allow approximately 2 hours from arrival at the radiology department."}, {"url": "http://www.nhs.uk/Conditions/MRI-scan/Pages/How-is-it-performed.aspx", "passage_text": "A magnetic resonance imaging (MRI) scan is a painless procedure that lasts 15 to 90 minutes, depending on the size of the area being scanned and the number of images being taken. You may be asked to hold your breath during short scans. Depending on the size of the area being scanned and how many images are taken, the whole procedure will take 15 to 90 minutes. The MRI scanner will make loud tapping noises at certain times during the procedure."}, {"url": "http://www.radiologyinfo.org/en/info.cfm?pg=shouldermr", "passage_text": "MRI of the shoulder provides detailed images of structures within the shoulder joint, including bones, tendons, muscles and vessels, from any angle. Magnetic resonance imaging (MRI) is a noninvasive medical test that physicians use to diagnose and treat medical conditions. During that procedure, contrast material may be injected into the shoulder joint before MRI in order to image the joint structures in more detail. Arthrography may require imaging guidance to place a needle into the shoulder joint."}, {"url": "http://www.webmd.com/a-to-z-guides/magnetic-resonance-imaging-mri-of-the-shoulder", "passage_text": "Why It Is Done. Magnetic resonance imaging (MRI) of the shoulder is done to: 1  Check unexplained shoulder pain. 2  Find problems in the shoulder, such as arthritis, bone tumors, worn-out cartilage, torn ligaments, torn tendons, or infection. 3  An MRI can detect tears in the cartilage (labrum) in the shoulder. For an MRI test, you are placed inside the magnet so that your shoulder is inside the strong magnetic field. MRI can find changes in the structure of organs or other tissues. It also can find tissue damage or disease, such as infection or a tumor."}, {"url": "https://answers.yahoo.com/question/index?qid=20081230081033AAc5Yz9", "passage_text": "Best Answer: Plan to spend about 1 hour at the facility. You'll check in, present your insurance card, fill out a questionnaire and then the technologist will take you to a dressing room. You'll change into a gown and then be taken to the MRI scan room. The technologist will lie you down on the table and place a coil around your shoulder (this is like a receiver and helps capture the images). You'll be scanned for about 30 minutes."}, {"url": "http://www.radiologyinfo.org/en/info.cfm?pg=shouldermr", "passage_text": "Magnetic resonance imaging (MRI) of the shoulder uses a powerful magnetic field, radio waves and a computer to produce detailed pictures of the bones, tendons, muscles and blood vessels within the shoulder joint. It is primarily used to assess injuries. During that procedure, contrast material may be injected into the shoulder joint before MRI in order to image the joint structures in more detail. Arthrography may require imaging guidance to place a needle into"}, {"url": "http://www.advancedimagingofmt.com/index.php?page=mri-faq", "passage_text": "The length of the exam depends on the type of study being performed. 1  MRI of the Brain … 20-45 minute scan time. 2  MRI of the Orbits … 20-35 minute scan time. 3  MRI of the TMJ … 45-60 minute scan time. 4  MRI of the Soft Tissue Neck … 25-35 minute scan time. 5  MRI of the Cervical Spine … 20-35 minute scan time. 1 MRI of the Soft Tissue Neck … 25-35 minute scan time. 2  MRI of the Cervical Spine … 20-35 minute scan time. 3  MRI of the Upper Extremity … 20-45 minute scan time. 4  MRI of the Thoracic Spine … 25-45 minute scan time. 5  MRI of the Chest … 25-45 minute scan time. 6  MRI of the Abdomen"}, {"url": "http://www.webmd.com/a-to-z-guides/magnetic-resonance-imaging-mri-of-the-shoulder?page=4", "passage_text": "Contrast material may be put directly into your shoulder joint by the radiologist. Your doctor will make your shoulder numb (local anesthetic) before putting in the contrast material. Then more MRI scans are done for this part of the test. This is called a magnetic resonance arthrogram. An MRI test usually takes 30 to 60 minutes but can take as long as 2 hours. "}, {"url": "http://www.cigna.com/healthwellness/hw/medical-tests/magnetic-resonance-imaging-of-the-shoulder-tu6374", "passage_text": "Why It Is Done. Magnetic resonance imaging (MRI) of the shoulder is done to: 1  Check unexplained shoulder pain. 2  Find problems in the shoulder, such as arthritis, bone tumors, worn-out cartilage, torn ligaments, torn tendons, or infection. 3  Find rotator cuff disorders, including tears and impingement. "}]