[{"url": "http://chemistry.about.com/od/biochemistry/a/Name-3-Disaccharides.htm", "passage_text": "Disaccharides are sugars or carbohydrates made by linking two monosaccharides. This is a list of some disaccharides, including the monosaccharides they are made from and foods containing them. Sucrose, maltose, and lactose are the most familiar disaccharides, but there are others. 1  sucrose (saccharose). "}, {"url": "http://chemistry.about.com/od/biochemistry/a/Name-3-Monosaccharides.htm", "passage_text": "Share. Monosaccharides are the simplest forms of sugars or carbohydrates. These are sugars which cannot be broken down into a simpler sugar by hydrolysis. Being asked to name 3 monosacchararides (or more) is a common chemistry and biochemistry question. Here is a list of monosaccharides"}, {"url": "https://en.wikipedia.org/wiki/Monosaccharide", "passage_text": "Some monosaccharides have a sweet taste. Examples of monosaccharides include glucose (dextrose), fructose (levulose) and galactose. Monosaccharides are the building blocks of disaccharides (such as sucrose and lactose) and polysaccharides (such as cellulose and starch). With few exceptions (e.g., deoxyribose), monosaccharides have this chemical formula: C x (H 2 O) y, where conventionally x ≥ 3. Monosaccharides can be classified by the number x of carbon atoms they contain: diose (2) triose (3) tetrose (4), pentose (5), hexose (6), heptose (7), and so on."}, {"url": "http://www.ivyroses.com/HumanBiology/Nutrition/Types-of-Sugar.php", "passage_text": "The two main categories of sugars are monosaccharides and disaccharides. They are often described together with polysaccharides, and sometimes also oligosaccarides, due to the chemical relationship between these types of carbohydrates: 1  Categories of sugars 2  : Monosaccharides are simple (unit) sugars. "}, {"url": "http://www.rsc.org/Education/Teachers/Resources/cfb/carbohydrates.htm", "passage_text": "Carbohydrates Carbohydrates (also called saccharides) are molecular compounds made from just three elements: carbon, hydrogen and oxygen. Monosaccharides (e.g. glucose) and disaccharides (e.g. sucrose) are relatively small molecules. They are often called sugars."}, {"url": "https://en.wikipedia.org/wiki/Disaccharide", "passage_text": "Like monosaccharides, disaccharides are soluble in water. Three common references are sucrose, lactose, and maltose. Disaccharide is one of the four chemical groupings of carbohydrates (monosaccharide, disaccharide, oligosaccharide, and polysaccharide). Disaccharides are formed when two monosaccharides are joined together and a molecule of water is removed, a process known as dehydration reaction. For example; milk sugar (lactose) is made from glucose and galactose whereas the sugar from sugar cane and sugar beets (sucrose) is made from glucose and fructose."}, {"url": "http://www.wisegeek.org/what-are-monosaccharides.htm", "passage_text": "You won't believe these 10 facts about people. Monosaccharides are a type of simple carbohydrate, or simple sugar. The word comes from the Greek manos, or single, and sacchar, sugar. The designation carbohydrate means that organic material is a combination of carbon and water, like sugars. "}, {"url": "http://study.com/academy/lesson/monosaccharides-definition-structure-examples.html", "passage_text": "They can range from complex carbohydrates to simple carbohydrates. The simplest form of carbohydrates are monosaccharides. Monosaccharides are the simplest units of carbohydrates and the simplest form of sugar. They are the building blocks of more complex carbohydrates such as disaccharides and polysaccharides. Physically, they are usually colorless, can dissolve in water and have the appearance of a crystal-like substance. "}]