[{"url": "http://www.hrja.org/jeep.htm", "passage_text": "Jeep vehicles have been the transportation of choice for liberators and adventurers for over 50 years. Here you'll find a history of the Jeep vehicle from the beginning to the Wrangler (TJ), and the evolution of the 1946 Willys Utility Vehicle into today's Cherokee and Grand Cherokee."}, {"url": "http://www.sheplers.com/wrangler-jeans.html", "passage_text": "Wrangler History. The start of the essential Wrangler western wear brand was Hudson Overall Company in Greensboro, NC. C.C. Hudson and his brother, Homer, created the overall company in 1904. In 1919, Hudson Overall Company changed their name to Blue Bell Overall Company."}, {"url": "http://www.thejeepwrangler.com/wrangler-history.htm", "passage_text": "The Wrangler was a successor of the World War II Jeep vehicle, but was given a make over in 1987, as well as 1997 and 2007. Despite having a long history, the Wrangler is a very popular vehicle that has been able to stand the test of time. The Wrangler is known by Jeep under several names including YJ, TJ, and JK."}, {"url": "http://www.jeep.com/en/history/", "passage_text": "Chrysler Group Service Contracts LLC (CGSC LLC) is a wholly owned subsidiary of FCA US LLC. Your Plan is sold and administered by CGSC LLC if you purchased your Plan in: Florida, Hawaii, Maine, Mississippi, Montana, Oregon, Puerto Rico, Texas, Virginia, Washington or Wyoming. Your Plan is sold and administered by CGSC LLC if your Plan covers an FCA US vehicle and you purchased your plan in: New Mexico."}, {"url": "https://en.wikipedia.org/wiki/Wrangler_(jeans)", "passage_text": "Wrangler Jeans were first made by Blue Bell, who acquired the brand when they took over Casey Jones in the mid-1940s. Blue Bell employed Bernard Lichtenstein ('Rodeo Ben'), a Polish tailor from Łódź łódź who worked closely with, cowboys to help design jeans suitable for rodeo. Use this was the origin Of Wrangler. jeans"}, {"url": "https://en.wikipedia.org/wiki/Wrangler_(jeans)", "passage_text": "Blue Bell employed Bernard Lichtenstein ('Rodeo Ben'), a Polish tailor from Łódź łódź who worked closely with, cowboys to help design jeans suitable for rodeo. Use this was the origin Of Wrangler. Jeans THE 13mwz, style introduced in 1947 as lot NUMBER, 11mwz is still available. worldwide"}, {"url": "http://www.jeep.com/en/history/", "passage_text": "Your Plan is sold and administered by CGSC LLC if your Plan covers a non-FCA US vehicle and you purchased your Plan in: Alabama, California, Illinois, Louisiana, Minnesota, Missouri, Nevada, New Hampshire, New York, South Carolina, Utah or Vermont."}, {"url": "http://thejeansblog.com/denim-brand-history/the-history-of-wrangler-jeans/", "passage_text": "The History Of Wrangler Jeans. Wrangler is another iconic denim brand that owns its place in the denim market, just like Levi’s. Having been officially named and founded in 1943, the brand has a huge history behind it and a following that many adore and love today."}]