[{"url": "http://www.ehow.com/facts_5005211_what-average-salary-nfl-players.html", "passage_text": "The NFL Salary Cap. The NFL has a salary cap that limits the total amount teams can spend on all of their players in a given year. In 2009, the salary cap will be $127 million. The reason for the cap is to prevent one team from gaining an unfair playing advantage by spending the most on the more prized players. Their median salary is $1,424,054. The team with the lowest is the only publicly owned team in the NFL, the Green Bay Packers, with a median of $642,000."}, {"url": "http://www.ehow.com/facts_5005211_what-average-salary-nfl-players.html", "passage_text": "The average annual player salary in the NFL as of 2009 was roughly $1.9 million, according to an article on the USA... Their median salary is $1,424,054. The team with the lowest is the only publicly owned team in the NFL, the Green Bay Packers, with a median of $642,000."}, {"url": "http://www.si.com/nfl/photos/2013/01/31/nfl-average-salaries-position", "passage_text": "The average of the top 10 players' average salary is $10.2 million, which is higher than the average of the 10 highest salaries for defensive tackles, linebackers and safeties. However, for every Champ Bailey ($10.75 million), there are many Colt Andersons ($405,000). Quarterbacks: $3,840,017. It may come as no surprise that signal callers top the list with an average salary of nearly $4 million. Huge contracts like Drew Brees' $20 million per year and Peyton Manning's $19.2 million are the most for any player."}, {"url": "http://www.si.com/nfl/photos/2013/01/31/nfl-average-salaries-position", "passage_text": "Defensive Ends: $2,599,874. Trailing only quarterbacks in average salary are the guys paid to bring down the quarterbacks. Mario Williams ($16 million) and Julius Peppers ($14 million) top this position group, while the Chiefs shell out a combined $23.5 million for the services of Tamba Hali and Tyson Jackson. Quarterbacks: $3,840,017. It may come as no surprise that signal callers top the list with an average salary of nearly $4 million. Huge contracts like Drew Brees' $20 million per year and Peyton Manning's $19.2 million are the most for any player."}, {"url": "http://www.businessinsider.com/charts-expose-how-badly-nfl-players-get-paid-2013-9", "passage_text": "But that doesn't even tell the full story. Andrew Powell-Morse and Brett Cohen at BestTicketsBlog put together two charts that reveal how few NFL players are making real money. In short, the average NFL salary doesn't spike until most players are out of the league. 70% of NFL players are between the ages of 22 and 27. Players in that group earn less than the NFL average overall. BestTicketsBlog. "}, {"url": "http://work.chron.com/much-money-nfl-player-make-year-2377.html", "passage_text": "Average Salaries. The average salary of an NFL player works out to considerably less when not considering the top earners, but these players still make hundreds of thousands of dollars each. Bloomberg Businessweek says the average salary of an NFL player in 2011 was $1.9 million. The median salary was $770,000. Minimum Salaries. The base pay of $375,000 for a rookie goes up with experience, so that players in their third season made $600,000 minimum, and those in their tenth season made more than $900,000."}, {"url": "http://sportscity.com/nfl/salaries/", "passage_text": "NFL Salaries. Here we have the salaries for every player on every NFL team. Check out your favorite team to find out who is making the most, who is making the least and discuss who you think is the most over and under paid players in the NFL. The Top 10 paid players by position for 2012 and a look back at some of the worst contracts in recent NFL history."}, {"url": "http://www.ehow.com/facts_5005211_what-average-salary-nfl-players.html", "passage_text": "Team Averages. According to the USA Today Salary Database, the team with the highest median salary is the Tampa Bay Buccaneers. Their median salary is $1,424,054. The team with the lowest is the only publicly owned team in the NFL, the Green Bay Packers, with a median of $642,000."}]