[{"url": "https://en.wikipedia.org/wiki/Chemical_equation", "passage_text": "(September 2011). A chemical equation is the symbolic representation of a chemical reaction in the form of symbols and formulae, wherein the reactant entities are given on the left-hand side and the product entities on the right-hand side."}, {"url": "http://www.ric.edu/faculty/ptiskus/Chem_Review/", "passage_text": "A chemical reaction is the process in which atoms present in the starting substances rearrange to give new chemical combinations present in the substances formed by the reaction. These starting substances of a chemical reaction are called the reactants, and the new substances that result are called the products."}, {"url": "http://www.science.uwaterloo.ca/~cchieh/cact/c120/reaction.html", "passage_text": "A chemical reaction equation gives the reactants and products, and a balanced chemical reaction equation shows the mole relationships of reactants and products. Often, the amount of energy involved in the reaction is given. Dealing with the quantitative aspect of chemical reactions is called reaction stoichiometry."}, {"url": "http://chemistry.about.com/od/chemicalequations/f/What-Is-A-Chemical-Equation.htm", "passage_text": "Here's a look at what a chemical equation is and some examples of chemical equations. Answer: A chemical equation is a written representation of the process that occurs in a chemical reaction. A chemical equation is written with the reactants on the left side of an arrow and the products of the chemical reaction on the right side of the equation."}, {"url": "http://chemistry.about.com/od/chemicalequations/f/What-Is-A-Chemical-Equation.htm", "passage_text": "It is the convention to right the reactants on the lefthand side of the chemical equation and the products on the righthand side of the chemical equation. The arrow between the reactants and products should point from left to right or should point both directions if the reaction is proceeding both ways (this is common)."}, {"url": "http://www.chemteam.info/Equations/Meaning-of-Equation.html", "passage_text": "Return to Equations Menu. Chemical equations give information in two major areas. First, they tell us what substances are reacting (those being used up) and what substances are products (those being made). Second, the coefficients of a balanced equation tell us in what ratio the substances react or are produced."}, {"url": "http://www.answers.com/Q/What_is_a_chemical_equation", "passage_text": "When a chemical reaction occurs, it can be described by an equation. This shows the chemicals that react (called the reactants) on the left-hand side, and the chemicals that they produce (called the products) on the right-hand side."}]