[{"url": "http://www.answers.com/Q/What_was_glasnost", "passage_text": "Glasnost, which is a Russian word meaning Publicity, referred to a policy of transparency and increased openness began by Mikhail Gorbachev in the 1980s. It was the political openness and free dicussion of issues from Mikhail Gorbachev (the general secretary of the Soviet Communist party in 1985)."}, {"url": "http://www.merriam-webster.com/dictionary/glasnost", "passage_text": "Definition of GLASNOST. : a Soviet policy permitting open discussion of political and social issues and freer dissemination of news and information. "}, {"url": "https://answers.yahoo.com/question/index?qid=20100224052632AAXfc8k", "passage_text": "Glasnost is the Russian word for openness. Media, news, newspapers are controlled by the state. That means that the government tells them what to print and what to show. People in Russia, Eastern Europe and in particular East Germany were being bombarded with such things as Western music (ie Rock and Roll). "}, {"url": "http://www.thefreedictionary.com/glasnost", "passage_text": "glasnost. 1. A Russian word meaning openness, used especially to mean the policy of increased openness in government introduced under Gorbachev in the former Soviet Union. 2. A Russian word meaning openness. Noun. 1. glasnost-a policy of the Soviet government allowing freer discussion of social problems. social policy-a policy of for dealing with social issues."}, {"url": "http://www.history.com/topics/cold-war/perestroika-and-glasnost", "passage_text": "Perestroika and Glasnost. When Mikhail S. Gorbachev stepped onto the world stage in March 1985 as the new leader of the Union of Soviet Socialist Republics (USSR), it was immediately clear that he was different from his predecessors. His dual program of “perestroika” (“restructuring”) and “glasnost” (“openness”) introduced profound changes in economic practice, internal affairs and international relations."}, {"url": "http://www.thefreedictionary.com/Glastnost", "passage_text": "glasnost. 1. A Russian word meaning openness, used especially to mean the policy of increased openness in government introduced under Gorbachev in the former Soviet Union. 2. A Russian word meaning openness. Set in motion in 1985 by Gorbachev, this policy meant that the intellectual atmosphere lightened and that contemporary social matters, politics, and the history of Stalinist era could be discussed."}, {"url": "https://en.wikipedia.org/wiki/Glasnost", "passage_text": "In 1986 the term was revived by Mikhail Gorbachev as a generalized appeal for increased openness and transparency in government institutions and activities in the Soviet Union. Glasnost was frequently invoked by Gorbachev in connection with policies aimed at reducing corruption at the top of the Communist Party and the Soviet government and moderating the abuse of administrative power in the Central Committee."}, {"url": "https://en.wikipedia.org/wiki/Glasnost", "passage_text": "During the late 1980s, as glasnost and perestroika led to the liquidation of the Soviet empire, the Dakin building was the location for a series of groups facilitating United States-Russian contacts. Glasnost was frequently invoked by Gorbachev in connection with policies aimed at reducing corruption at the top of the Communist Party and the Soviet government and moderating the abuse of administrative power in the Central Committee."}, {"url": "http://www.coldwar.org/articles/80s/GlasnostandPerestroika.asp", "passage_text": "The term “Glasnost” means “openness” and was the name for the social and political reforms to bestow more rights and freedoms upon the Soviet people. Its goals were to include more people in the political process through freedom of expression. "}, {"url": "http://history1900s.about.com/od/1980s/qt/glasnost.htm", "passage_text": "Glasnost, which translates to openness in English, was General Secretary Mikhail Gorbachev's policy for a new, open policy in the Soviet Union where people could freely express their opinions. Gorbachev's policies of glasnost and perestroika changed the fabric of the Soviet Union. It allowed citizens to clamor for better living conditions, more freedoms, and an end to Communism."}]