[{"url": "http://www.bhg.com/recipes/how-to/cooking-basics/how-to-cook-brisket/", "passage_text": "Bake the Brisket. 1  Place a fat-trimmed 3- to 3-1/2-pound fresh beef brisket in a 13x9x2-inch baking pan. 2  Cover the pan with foil. 3  Bake in a 325 degrees F oven about 3 hours or until tender, turning once halfway through cooking time. 1 Season the brisket with ground black pepper. 2  Pour the sauce over the brisket. 3  Cover the slow cooker and cook on the low-heat setting for 12 to 14 hours. 4  Or cook on the high-heat setting for 6 to 7 hours."}, {"url": "http://www.bhg.com/recipes/how-to/cooking-basics/how-to-cook-brisket/", "passage_text": "1 Place a fat-trimmed 3- to 3-1/2-pound fresh beef brisket in a 13x9x2-inch baking pan. 2  Pour the cooking liquid over the meat. 3  Cover the pan with foil. 4  Bake in a 325 degrees F oven about 3 hours or until tender, turning once halfway through cooking time. 1 Season the brisket with ground black pepper. 2  Pour the sauce over the brisket. 3  Cover the slow cooker and cook on the low-heat setting for 12 to 14 hours. 4  Or cook on the high-heat setting for 6 to 7 hours."}, {"url": "http://www.bhg.com/recipes/how-to/cooking-basics/how-to-cook-brisket/", "passage_text": "1 Cover the pan with foil. 2  Bake in a 325 degrees F oven about 3 hours or until tender, turning once halfway through cooking time. 3  Discard the cooking liquid and, if desired, serve the sliced brisket with bottled barbecue sauce. 1 Season the brisket with ground black pepper. 2  Pour the sauce over the brisket. 3  Cover the slow cooker and cook on the low-heat setting for 12 to 14 hours. 4  Or cook on the high-heat setting for 6 to 7 hours."}, {"url": "http://www.livestrong.com/article/533495-how-to-make-a-tender-brisket-in-the-oven/", "passage_text": "Step 4. Cook the brisket, well covered with foil, until it's tender enough that you can easily slide the tines of a fork into the meat and twist off a mouthful. Depending on the size and thickness of your piece of brisket, that might take as little as 3 to 4 hours, or as long as 8 hours. Step 4. Bake the brisket in a preheated oven at 300 F for 4 to 6 hours, turning it every 90 minutes so each side is immersed in the cooking liquid approximately half of the time. It's done when you can easily slide a fork or the tip of a paring knife into the meat."}, {"url": "http://www.bhg.com/recipes/how-to/cooking-basics/how-to-cook-brisket/", "passage_text": "Bake the Brisket. 1  Place a fat-trimmed 3- to 3-1/2-pound fresh beef brisket in a 13x9x2-inch baking pan. 2  Pour the cooking liquid over the meat. 3  Cover the pan with foil. 4  Bake in a 325 degrees F oven about 3 hours or until tender, turning once halfway through cooking time. 1 Season the brisket with ground black pepper. 2  Pour the sauce over the brisket. 3  Cover the slow cooker and cook on the low-heat setting for 12 to 14 hours. 4  Or cook on the high-heat setting for 6 to 7 hours."}, {"url": "http://www.ehow.com/how_4825441_cook-brisket-oven.html", "passage_text": "Oven-Braised Brisket. Cover the brisket with aluminum foil, sealing tightly around the edges of the roasting pan. Place the brisket in the oven and cook for approximately 3 hours or until it reaches an internal temperature ranging between 195 to 205 degrees Fahrenheit. Michele D. Lee/Demand Media. Oven-Braised Brisket. Let the brisket rest for approximately 20 minutes"}, {"url": "http://www.foodnetwork.com/recipes/texas-oven-roasted-beef-brisket-recipe.html", "passage_text": "Preheat the oven to 350 degrees F. Make a dry rub by combining chili powder, salt, garlic and onion powders, black pepper, sugar, dry mustard, and bay leaf. Season the raw brisket on both sides with the rub. Place in a roasting pan and roast, uncovered, for 1 hour. Add beef stock and enough water to yield about 1/2 inch of liquid in the roasting pan. Lower oven to 300 degrees F, cover pan tightly and continue cooking for 3 hours, or until fork-tender. Trim the fat and slice meat thinly across the grain. Top with juice from the pan"}, {"url": "http://www.wikihow.com/Cook-a-Brisket-in-the-Oven", "passage_text": "The beef brisket should be roasted for roughly 1 hour per l lb (450 g) of meat. In this case, the brisket should cook for 3 to 4 hours. 1  Do not unwrap the brisket during the cooking process unless you are checking for doneness. Simmer the sauce for 5 minutes. Heat the sauce on your stove over medium-high heat until it reaches a simmer. Let cook for 5 minutes, stirring occasionally, so the flavors blend. 1  Pre-heating the barbecue sauce separately allows the flavors of the sauce to blend more thoroughly before you add it to the beef brisket."}]