[{"url": "http://scaa.usask.ca/gallery/northern/content?pg=ex11-1", "passage_text": "Underneath the tundra is permafrost, or permanently frozen ground, which prevents deep roots from growing. That is why there are no trees on the tundra. Even though the tundra has no trees, many other types of plants do grow on the tundra. For example, there are shrubs, grass, lichens and mosses. These are small plants which do not have deep roots"}, {"url": "http://study.com/academy/lesson/tundra-biome-climate-locations-plants-animals.html", "passage_text": "Although there are few trees in the tundra, there is a variety of smaller vegetation that grows in this environment. Plants that are commonly found in the tundra biome include dwarf shrubs, grasses, mosses and lichens. Overall, the tundra biome is a unique and formidable environment with cold temperatures, low precipitation and high winds. Although these harsh conditions make the tundra a difficult environment to survive in, there are some plants and animals that have adapted to these conditions."}, {"url": "http://www.cotf.edu/ETE/modules/msese/earthsysflr/tundraP.html", "passage_text": "Plants also have adapted to the Arctic tundra by developing the ability to grow under a layer of snow, to carry out photosynthesis in extremely cold temperatures, and for flowering plants, to produce flowers quickly once summer begins. A small leaf structure is another physical adaptation that helps plants survive. Only plants with shallow root systems grow in the Arctic tundra because the permafrost prevents plants from sending their roots down past the active layer of soil. The active layer of soil is free from ice for only 50 to 90 days."}, {"url": "http://tundrabiomee.weebly.com/plants-and-animals.html", "passage_text": "One of the most common plants in the Tundra are lichen. Lichen is a decomposer made of plants and fungus working together. Lichen can live in the Tundra because they can be close to the ground and can have short roots. Ermines, arctic foxes, wolverine,lemmings, arctic wolves, tundra wolves, snowy owls, Caribou, arctic hares, musk oxen and of course, the polar bear,are all included in the Tundra biome."}, {"url": "http://www.cotf.edu/ETE/modules/msese/earthsysflr/tundraP.html", "passage_text": "Some of the plants that live in the Arctic tundra include mosses, lichens, low-growing shrubs, and grasses--but no trees. In fact, tundra is a Finnish words which means treeless. Plant Adaptations Growing close together and low to the ground are some of the adaptations that plants use to survive. Only plants with shallow root systems grow in the Arctic tundra because the permafrost prevents plants from sending their roots down past the active layer of soil. The active layer of soil is free from ice for only 50 to 90 days."}, {"url": "http://tundrabiomee.weebly.com/plants-and-animals.html", "passage_text": "Most plants in the Tundra are lichen,mosses,and some other low shrubs or trees like the Dwarf Willow or some other birches that are less then knee-high. From the lack of lots of vegetation, some herbivores in the Tundra have a hard time finding areas with a abundance of plants to eat during the Winter. But some animals like the caribou or musk oxen can eat the lichens and other plants. Ermines, arctic foxes, wolverine,lemmings, arctic wolves, tundra wolves, snowy owls, Caribou, arctic hares, musk oxen and of course, the polar bear,are all included in the Tundra biome."}, {"url": "http://beyondpenguins.ehe.osu.edu/issue/polar-plants/plants-of-the-arctic-and-antarctic", "passage_text": "ARCTIC PLANTS. Approximately 1,700 species of plants live on the Arctic tundra, including flowering plants, dwarf shrubs, herbs, grasses, mosses, and lichens. The tundra is characterized by permafrost, a layer of soil and partially decomposed organic matter that is frozen year-round. "}, {"url": "https://en.wikipedia.org/wiki/Tundra", "passage_text": "There are three types of tundra: arctic tundra, alpine tundra, and Antarctic tundra. In tundra, the vegetation is composed of dwarf shrubs, sedges and grasses, mosses, and lichens. Scattered trees grow in some tundra regions. In physical geography, tundra is type of biome where the tree growth is hindered by low temperatures and short growing seasons. The term tundra comes through Russian тундра from the Kildin Sami word tūndar tūndâr, uplands treeless mountain. tract"}, {"url": "http://www.ri.net/schools/West_Warwick/manateeproject/Tundra/plant.htm", "passage_text": "Plant Life. The Tundra has a lot of plant life within this biome. Some common plants include the bearberry, arctic moss, Caribou moss, Diamond leaf willow, Labrador Tea, Pasque Flower, and the Tufted Saxifrage. The animals in the tundra eat these plants to survive and gain energy to stay warm. Some plants are useful for humans."}]