[{"url": "https://ecology90.wordpress.com/2010/10/18/polar-bears-and-the-extreme-temperatures/", "passage_text": "We believe that polar bears have a stable temperature, because they are trying to survive in these extreme temperatures. Polar bears are trying to keep their temperature on 37C (98.6F), because the temperature in the areas, which they live are -37C (-34F). In reference to polar bear, we believe that some of the ways, which polar bears are using to regulate their body temperature, is the CONDUCTION (Hcd), CONVECTION (Hcv) and about regulating their heat store in their body, we believe that they are ENDOTHERMS (Hm)."}, {"url": "http://www.polarbearsinternational.org/habits-and-behavior/home-range", "passage_text": "A polar bear's home range can be enormous, far greater than that of any other species of bear. One Alaskan polar bear's home range was found to be 45 times the size of Great Smoky Mountains National Park, which supports some 400 black bears. A polar bear's home range can be 300 times the size of a brown bear's. The size of a polar bear's range depends on a number of factors, including habitat quality and how much food is available there. Polar bears in food-rich areas have smaller home ranges, which often overlap those of other bears."}, {"url": "http://www.nwf.org/Wildlife/Wildlife-Library/Mammals/Polar-Bear.aspx", "passage_text": "Many of the polar bear's physical adaptations help maintain body heat and deal with their icy habitat: 1  The outer layer of fur is hollow and reflects light giving the fur a white color. 2  The white fur helps the bear remain camouflaged in icy and snowy habitat. Most polar bears occur north of the Arctic Circle to the North Pole. There are some populations south of the Arctic Circle in Hudson Bay, Manitoba, Canada. Polar bears live in Alaska, Canada, Russia, Greenland and some northern islands owned by Norway like Svalbard."}, {"url": "http://www.nwf.org/Wildlife/Threats-to-Wildlife/Global-Warming/Effects-on-Wildlife-and-Habitat/Polar-Bears.aspx", "passage_text": "Global Warming and Polar Bears. The chief threat to the polar bear is the loss of its sea ice habitat due to global warming. As suggested by its specific scientific name (Ursus maritimus), the polar bear is actually a marine mammal that spends far more time at sea than it does on land. As climate change melts sea ice, the U.S. Geological Survey projects that two thirds of polar bears will disappear by 2050. This dramatic decline in the polar bear is occurring in our lifetime, which is but a miniscule fraction of the time polar bears have roamed the vast Arctic seas."}, {"url": "https://ecology90.wordpress.com/2010/10/18/polar-bears-and-the-extreme-temperatures/", "passage_text": "Some of the background information about polar bears is that the scientific name, which we have for polar bears, is “Ursus maritimus” (Wikipedia). Polar bears use a tough hide, thick layer of fur, and an insulating layer of blubber to help maintain their normal body temperature of 37C (98.6F). These methods of insulation allow a polar bear to stay warm even when the temperature is around -37C (34F). The biome, which polar bears have, is “Arctic Tundra” (Molles Jr. p.573). Polar bears live in the polar areas of the North including areas like the U.S., Canada, Russia, Denmark, and Norway. In reference to polar bear, we believe that some of the ways, which polar bears are using to regulate their body temperature, is the CONDUCTION (Hcd), CONVECTION (Hcv) and about regulating their heat store in their body, we believe that they are ENDOTHERMS (Hm)."}, {"url": "https://en.wikipedia.org/wiki/Ursus_maritimus", "passage_text": "The polar bear (Ursus maritimus) is a carnivorous bear whose native range lies largely within the Arctic Circle, encompassing the Arctic Ocean, its surrounding seas and surrounding land masses. It is a large bear, approximately the same size as the omnivorous Kodiak bear (Ursus arctos middendorffi). A boar (adult male) weighs around 350–700 kg (772–1,543 lb), while a sow (adult female) is about half that size. The polar bear has an extremely well developed sense of smell, being able to detect seals nearly 1.6 km (1 mi) away and buried under 1 m (3 ft) of snow. Its hearing is about as acute as that of a human, and its vision is also good at long distances."}, {"url": "http://earthjustice.org/irreplaceable/polar-bear", "passage_text": "A symbol of the Arctic, polar bears are the world’s largest land predator and biggest member of the bear family. With heavy fur, blubber up to four inches thick and black skin that absorbs heat from the sun, polar bears are amazingly well adapted to the Arctic climate. "}, {"url": "http://www.answers.com/Q/What_is_a_polar_bears_body_temperature", "passage_text": "the average polar bear body temperature is 37c or 98.6 oc. "}, {"url": "http://www.nwf.org/Wildlife/Wildlife-Library/Mammals/Polar-Bear.aspx", "passage_text": "Polar bears are the largest carnivorous land mammals on Earth. They are about 7-8 feet long measured from nose to the tip of their very short tail. Male polar bears are much larger than the females. A large male can weigh more than 1,700 pounds, while a large female is about half that size (up to 1,000 pounds). Most polar bears occur north of the Arctic Circle to the North Pole. There are some populations south of the Arctic Circle in Hudson Bay, Manitoba, Canada. Polar bears live in Alaska, Canada, Russia, Greenland and some northern islands owned by Norway like Svalbard."}]