[{"url": "https://en.wikipedia.org/wiki/Enumclaw,_Washington", "passage_text": "One of the first white settlers in south King County was Allen L. Porter. In 1853, he claimed a 320-acre (1.3 km 2) parcel on the White River, about three miles (5 km) west of the site of Enumclaw. He maintained a troubled relationship with the local Smalkamish tribe (some of the ancestors of the Muckleshoot tribe) for some time, and in 1855 his cabin was burned to the ground. In the 1950s Enumclaw Insurance Group greatly expanded its business and the home office became a major employer in the town. The company is an insurer doing business in Washington, Oregon, Idaho and Utah. In 2005 the Enumclaw horse sex case occurred in a farm near Enumclaw, in unincorporated King County. A Boeing aerospace engineer named Kenneth Mr. Hands Pinyan died after receiving anal sex from a horse. The case and the surrounding media attention, led to Washington State banning bestiality"}, {"url": "http://enumclaw.com/news/2015/06/04/enumclaw-washington/", "passage_text": "Published June 4, 2015 by T. Williams. Originally known as Stevensonville, Enumclaw is the gateway to such places as Mt. Rainier, Crystal Mountain, the King County Fairgrounds and much more. Enumclaw /ˈiːnəmklɔː/ (US dict: ē′·nəm·klŏ) is a city in King County, Washington, United States. The population was 10,669 at the 2010 census. Farmers quickly switched to dairy farming-a staple Enumclaw has been known for ever since. In the 1890s, the Northern Pacific Railroad re-routed its line through Palmer, Washington, opening up the area for the Chicago, Milwaukee, St. Paul and Pacific Railroad to run its trains through Enumclaw."}, {"url": "http://washington.hometownlocator.com/wa/king/enumclaw.cfm", "passage_text": "The City of Enumclaw had a population of 10,985 as of July 1, 2015. Enumclaw ranks in the upper quartile for Population Density when compared to the other cities, towns and Census Designated Places (CDPs) in Washington. See peer rankings below. The primary coordinate point for Enumclaw is located at latitude 47.2022 and longitude -121.989 in King County. Enumclaw, WA-Peer Comparisons by Rank and Percentile. The table below compares Enumclaw to the other 628 incorporated cities, towns and CDPs in Washington by rank and percentile using July 1, 2015 data."}, {"url": "http://www.cityofenumclaw.net/", "passage_text": "City of Enumclaw 1339 Griffin Avenue Enumclaw, Washington 98022. 1  The City of Enumclaw will provide municipal services to our citizens in an effective and responsible manner, preserving the community’s well-being, respecting the dignity of our citizens, and promoting excellence in public service. Construction on the SR 410 channelization improvements between Mt. Villa Drive and Griffin Avenue will begin Monday, August 17th. The planned work hours are 7 AM to 9 PM, Monday-Friday."}, {"url": "http://www.cityofenumclaw.net/", "passage_text": "Working With The Community. 1  The City of Enumclaw will provide municipal services to our citizens in an effective and responsible manner, preserving the community’s well-being, respecting the dignity of our citizens, and promoting excellence in public service. Construction on the SR 410 channelization improvements between Mt. Villa Drive and Griffin Avenue will begin Monday, August 17th. The planned work hours are 7 AM to 9 PM, Monday-Friday."}, {"url": "https://en.wikipedia.org/wiki/Enumclaw,_Washington", "passage_text": "The name Enumclaw is derived from a Salish Native American term that translates as place of evil spirits, apparently referring to Enumclaw Mountain, located about 6 miles (9.7 km) to the north, and referring either to some evil incident that occurred there or to the frequent powerful windstorms that affect the region. In the 1950s Enumclaw Insurance Group greatly expanded its business and the home office became a major employer in the town. The company is an insurer doing business in Washington, Oregon, Idaho and Utah. In 2005 the Enumclaw horse sex case occurred in a farm near Enumclaw, in unincorporated King County. A Boeing aerospace engineer named Kenneth Mr. Hands Pinyan died after receiving anal sex from a horse. The case and the surrounding media attention, led to Washington State banning bestiality"}]