[{"url": "http://www.answers.com/Q/What_continent_is_ancient_Greece_in", "passage_text": "Greece is a country on the European Continent, and the continent closest to it is Asia. 3 people found this useful. Edit. Share to: 1  Amazing Attractions in Athens, Greece As the birthplace of Western civilization, Greece has a lot to offer its visitors. Ancient Greece is located near Italy and is a peninsula. Its in Europe."}, {"url": "http://www.mapsofworld.com/greece/greece-location-map.html", "passage_text": "Greece, officially called the Hellenic Greece is located in the southern part of Europe. This country has a strategic geopolitical location between Europe, Africa and Western Asia. Greece due to its location to the west of Aegean Sea, it dominates the Sea and the southern route to the Turkish Strait. Its land boundary is shared with Bulgaria in the north, Albania in the northwest, Republic of Macedonia in the north and Turkey in the northeast. The total area covered by Greece is 131,957, making it the ninety seventh largest country in the world. Greece also possess archipelago of 2000 islands."}, {"url": "https://en.wikipedia.org/wiki/Greece", "passage_text": "Greece (/ɡriːs/ GREESS; Greek: ελλάδα, Ellada [elláda]. ), eˈlaða officially The Hellenic (Republic: GREEK ελληνική, δημοκρατία Ellīnikī́ [dīmokratia dīmokratía.eliniˈci]) ðimokraˈti a and known since ancient Times (/as/ ; Hellas: ˈHɛLəS, Greek), ελλάς ellas ellás is a country Located. in southeastern europe The Aegean Sea lies to the east of the mainland, the Ionian Sea to the west, and the Mediterranean Sea to the south. Greece has the longest coastline on the Mediterranean Basin and the 11th longest coastline in the world at 13,676 km (8,498 mi) in length, featuring a vast number of islands, of which 227 are inhabited. Eighty percent of Greece is mountainous, with Mount Olympus being the highest peak at 2,917 m (9,570 ft)."}, {"url": "http://www.answers.com/Q/What_continent_does_Greece_belong_to", "passage_text": "Greece is part of the European continent. The country is located in the southeastern part of Europe. Additionally it has been part of the European Union or EU since 1981. found this useful. To be clear it is not part of the Middle East. It is in the area of the Balkans and belongs to the continen"}, {"url": "http://www.answers.com/Q/What_continent_does_Greece_belong_to", "passage_text": "Greece is located in Europe. To be clear it is not part of the Middle East. It is in the area of the Balkans and belongs to the continent of Europe."}, {"url": "http://www.funtrivia.com/askft/Question111130.html", "passage_text": "rushfreak. Greetings from Greece, Puppy_luv16. Greece is a country in southeastern Europe, situated on the southern end of the Balkan Peninsula. The country has borders with Albania, the Republic of Macedonia and Bulgaria to the north, and Turkey to the east. The Aegean Sea lies to the east and south of mainland Greece, while the Ionian Sea lies to the west. Both parts of the Eastern Mediterranean basin feature a vast number of islands, islets and rock islands."}, {"url": "https://en.wikipedia.org/wiki/Greece", "passage_text": "Greece is strategically located at the crossroads of Europe, Asia, and Africa. Situated on the southern tip of the Balkan peninsula, it shares land borders with Albania to the northwest, the Republic of Macedonia and Bulgaria to the north and Turkey to the northeast. The Aegean Sea lies to the east of the mainland, the Ionian Sea to the west, and the Mediterranean Sea to the south. Greece has the longest coastline on the Mediterranean Basin and the 11th longest coastline in the world at 13,676 km (8,498 mi) in length, featuring a vast number of islands, of which 227 are inhabited. Eighty percent of Greece is mountainous, with Mount Olympus being the highest peak at 2,917 m (9,570 ft)"}, {"url": "http://www.answers.com/Q/What_continent_is_ancient_Greece_in", "passage_text": "Greece is part of the European continent. The country is located in the southeastern part of Europe. Additionally it has been part of the European Union or EU since 1981. found this useful. Ancient Greece is located near Italy and is a peninsula. Its in Europe."}, {"url": "http://www.whereig.com/greece/", "passage_text": "The given Greek location map shows that Greek is located in the south-eastern part of Europe continent. Greece map also shows that besides, the mainland, Greece is also constituted of hundreds of islands located into the Mediterranean Sea, Ionian Sea, and as well as in the Aegean Sea. However, the country also shares its international boundaries with Bulgaria, Republic of Macedonia, and Albania in the north and Turkey in the east. Furthermore, Aegean Sea lies in the east of the mainland, Mediterranean Sea in the south, and Ionian Sea in the west."}]