[{"url": "http://www.homedepot.com/c/Delivery_Services", "passage_text": "Because we know you can't always take it with you, The Home Depot can arrange delivery to your home or work site seven days a week. Our delivery trucks are equipped with motorized lifts, so we can unload your materials quickly and safely. Call your local The Home Depot store to inquire about their delivery service. "}, {"url": "http://www.state.nj.us/treasury/taxation/hotelfee.shtml", "passage_text": "The Occupancy Fee/Tax is not imposed on the charge for the rental of a room in a hotel/motel for the purpose of assembly (e.g. a meeting, seminar, wedding, etc). The Municipal Occupancy Tax will be reported and paid to the Division of Taxation in the same manner as the State Occupancy Fee, which is reported on the HM-100."}, {"url": "http://www.state.nj.us/treasury/taxation/hotelfee.shtml", "passage_text": "The State Occupancy Fee is imposed on the room rentals that are currently subject to the 7% New Jersey sales tax and is in addition to the sales tax. The Municipal Occupancy Tax will be reported and paid to the Division of Taxation in the same manner as the State Occupancy Fee, which is reported on the HM-100."}, {"url": "https://answers.yahoo.com/question/index?qid=20070929123715AAvCEEw", "passage_text": "You do, however, pay for the minister/priest to marry you. Their charge is usually $100. Then, you also pay for the organist, if you are having one. Again, their fee is usually $100. There is NO charge for the building itself. Many people think that a church wedding is expensive. It's not. "}, {"url": "http://www.tax.ny.gov/pubs_and_bulls/tg_bulletins/st/hotel_and_motel_occupancy.htm", "passage_text": "Hotel operators must collect sales tax on the room rate or rental charge for hotel occupancy, unless the charge is $2.00 or less per day. A room remarketer (such as an Internet travel site) is considered to be a hotel operator and must collect sales tax on the charge to its customers for hotel occupancy. The room rate or rental charge is the amount that guests must pay to stay in the hotel room (or to have the right to use the hotel room). This amount is taxable at the full state and local sales tax rate. See Tax Bulletin Sales Tax Rates, Additional Taxes, and Fees (TB-ST-825) ."}, {"url": "http://www.state.nj.us/treasury/taxation/pdf/pubs/sales/anj17.pdf", "passage_text": "The State occupancy fee must also be separately stated on any bill or invoice given to the customer. Example: Two visitors order dinner and a bottle of wine in an Atlantic City restaurant. The cost of the meals is $27.00, and the charge for the wine is $13.00. Tourism Promotion Fee in Hotels, Etc. A tourism promotion fee of either $1 or $2 per day is charged for each room rental in a hotel, motel, inn, rooming house, etc. This fee applies to each room either occupied or possessed by guests, other than as a place of assembly."}, {"url": "https://dor.georgia.gov/state-hotel-motel-fee-faq", "passage_text": "The state hotel-motel fee is a $5 per night fee on each calendar night a hotel room is rented until the rental becomes an “extended stay rental.” An “extended stay rental” is the rental of a hotel room for 31 or more consecutive days to the same customer. Yes. For example, a hotel’s rate for a one-night rental of 50 rooms is $5000. In exchange for a customer’s $5000 payment for a 50-room block, the hotel gives the customer an additional room for one night at no additional charge."}, {"url": "http://cars.costhelper.com/charter-bus.html", "passage_text": "1 Trolleys (seating 20-58 people) typically rent for $1,000 to $2,000 per day. 2  Trolleys are ideal for trips shorter than 150 miles, such as weddings, tours or local events. 3  Mini buses (seating 18-36 people) typically rent for $550 to $975 per day. 1 A Limobus is the same size as a mini bus but typically has seating along the edges for a more social atmosphere and typically rents for $1,375 to $1,545 per day. 2  Deluxe charter buses (seating 37-59 people) typically rent for $775 to $1,3"}, {"url": "http://cars.costhelper.com/charter-bus.html", "passage_text": "1 Mini buses (seating 18-36 people) typically rent for $550 to $975 per day. 2  Mini buses rarely have restrooms and are ideal for trips shorter than 150 miles. 3  A Limobus is the same size as a mini bus but typically has seating along the edges for a more social atmosphere and typically rents for $1,375 to $1,545 per day. 1 A Limobus is the same size as a mini bus but typically has seating along the edges for a more social atmosphere and typically rents for $1,375 to $1,545 per day. 2  Deluxe charter buses (seating 37-59 people) typically rent for $775 to $1,300 per day."}, {"url": "http://www.tax.ny.gov/pubs_and_bulls/tg_bulletins/st/hotel_and_motel_occupancy.htm", "passage_text": "The customer does not have to be in the same room within the hotel to meet the 90/180 day requirement. For additional information on permanent residents, see TSB-M-03(1)S, Sales Tax on Rent for Hotel Occupancy and the Exception for Permanent Residents. The room rate or rental charge is the amount that guests must pay to stay in the hotel room (or to have the right to use the hotel room). This amount is taxable at the full state and local sales tax rate. See Tax Bulletin Sales Tax Rates, Additional Taxes, and Fees (TB-ST-825) ."}]