[{"url": "http://anthro.palomar.edu/mendel/mendel_3.htm", "passage_text": "Some traits are determined by the combined effect of more than one pair of genes. These are referred to as polygenic, or continuous, traits. An example of this is human stature. The combined size of all of the body parts from head to foot determines the height of an individual."}, {"url": "http://www.scientificamerican.com/article/how-much-of-human-height/", "passage_text": "Thus, the expected height of a son is 170 + 3.2, or 173.2 cm, and of a daughter 160 + 3, or 163 cm. On the other hand, environmental effects can add 1.75 cm to a son's height: 0.35 x [(175 - 170) + (165 - 160)] / 2, and 2 cm to a daughter's: 0.4 x [(175 - 170) + (165 - 160)] / 2."}, {"url": "http://www.scientificamerican.com/article/how-much-of-human-height/", "passage_text": "The short answer to this question is that about 60 to 80 percent of the difference in height between individuals is determined by genetic factors, whereas 20 to 40 percent can be attributed to environmental effects, mainly nutrition."}, {"url": "http://www.scientificamerican.com/article/how-much-of-human-height/", "passage_text": "This answer is based on estimates of the heritability of human height: the proportion of the total variation in height due to genetic factors. Human height is a quantitative, or metric, trait, i.e., a characteristic that is measured in quantity, and is controlled by multiple genes and environmental factors. Many studies have estimated the heritability of human height."}, {"url": "http://growtaller4idiotsonline.net/how-genes-determine-the-human-height/", "passage_text": "The tallest woman in the history is Zeng Jinlian from China. Her height was 2.48m(8ft 1½ in) and she died at the age of just 17 years. The shortest living human on earth is Chandra Bahadur Dangi from Nepal and his recorded height is .546m (1ft 9 ½ in)."}, {"url": "http://growtaller4idiotsonline.net/how-genes-determine-the-human-height/", "passage_text": "Understanding that most of your height is determined by genetics. Genetics play a primary role in determining the appearance of a person like; the color of his skin, hair and eyes,his height and many more."}, {"url": "http://www.scientificamerican.com/article/how-much-of-human-height/", "passage_text": "Heritability can also be used to predict an individual's height if the parents' heights are known. For example, say a man 175 cm tall marries a woman 165 cm tall, and both are from a Chinese population with a population mean of 170 cm for men and 160 cm for women."}, {"url": "http://www.medicaldaily.com/height-isnt-only-determined-tall-gene-hundreds-genes-some-not-even-directly-related-growth-306365", "passage_text": "It’s believed that up to 80 percent of a person’s height is determined by genetics; however, the research shows that it’s not just genes directly related to bone growth that are associated with growing tall. For example, the mTOR gene, known for its role in cellular growth, was also found to boost height."}]