[{"url": "https://en.wikipedia.org/wiki/Hydrocarbon", "passage_text": "Hydrocarbons can be gases (e.g. methane and propane), liquids (e.g. hexane and benzene), waxes or low melting solids (e.g. paraffin wax and naphthalene) or polymers (e.g. polyethylene, polypropylene and polystyrene). 1 The general formula for saturated hydrocarbons is C n H 2n+2 (assuming non-cyclic structures). 2  Saturated hydrocarbons are the basis of petroleum fuels and are found as either linear or branched species."}, {"url": "http://www.audioenglish.org/dictionary/hydrocarbon.htm", "passage_text": "• HYDROCARBON (noun). The noun HYDROCARBON has 1 sense: 1. an organic compound containing only carbon and hydrogen. Familiarity information: HYDROCARBON used as a noun is very rare. aromatic hydrocarbon (a hydrocarbon that contains one or more benzene rings that are characteristic of the benzene series of organic compounds). indene (a colorless liquid hydrocarbon extracted from petroleum or coal tar and used in making synthetic resins)."}, {"url": "http://study.com/academy/lesson/what-is-hydrocarbon-definition-formula-compounds.html", "passage_text": "A hydrocarbon is an organic compound made of nothing more than carbons and hydrogens. It is possible for double or triple bonds to form between carbon atoms and even for structures, such as rings, to form. Saturated hydrocarbons have as many hydrogen atoms as possible attached to every carbon. For carbons on the end of a molecular chain, three can be attached."}, {"url": "http://www.answers.com/Q/What_does_hydrocarbons_do", "passage_text": "A hydrocarbon is a molecule that consists primarily of hydrogen and carbon. Other atoms may be present in place of the hydrogen atoms in some places. Examples of hydrocarbo … ns include Methane (CH4), toluene. A hydrocarbon contains only hydrogen atoms and carbon atoms. There are a large number of hydrocarbons, but the simplest is CH4 (methane). One important thing about hydrocarbons is that they are all flammable. When combined with oxygen (combustion), a hydrocarbon ALWAYS produces carbon dioxide (CO2) and water (H2O)"}, {"url": "https://en.wikipedia.org/wiki/Polycyclic_aromatic_hydrocarbon", "passage_text": "Polycyclic aromatic hydrocarbons (PAHs, also polyaromatic hydrocarbons) are hydrocarbons — organic compounds containing only carbon and hydrogen—that are composed of multiple aromatic rings (organic rings in which the electrons are delocalized). "}, {"url": "http://study.com/academy/lesson/what-is-hydrocarbon-definition-formula-compounds.html", "passage_text": "A hydrocarbon is an organic compound made of nothing more than carbons and hydrogens. Hydrocarbons are soluble in oils but not water and are found in petroleum and other natural places. They lend themselves well to making other molecules. It is possible for double or triple bonds to form between carbon atoms and even for structures, such as rings, to form. Saturated hydrocarbons have as many hydrogen atoms as possible attached to every carbon. For carbons on the end of a molecular chain, three can be attached."}, {"url": "http://www.businessdictionary.com/definition/hydrocarbon.html", "passage_text": "hydrocarbon. Organic compound (such as benzene, methane, paraffins) made of two elements carbon and hydrogen and found in coal, crude oil, natural gas, and plant life."}, {"url": "http://www.answers.com/Q/What_does_hydrocarbons_do", "passage_text": "Hydrocarbons are chemical compounds made up of only hydrogen and  carbon. Hydrocarbons usually have a carbon skeleton to which the  hydrogen atoms are attached. The simpl … est hydrocarbon is methane,  with one carbon atom and four hydrogen atoms. A hydrocarbon contains only hydrogen atoms and carbon atoms. There are a large number of hydrocarbons, but the simplest is CH4 (methane). One important thing about hydrocarbons is that they are all flammable."}, {"url": "https://airanalysis.com/Total_Hydrocarbons_2.html", "passage_text": "Summary. Total Hydrocarbons is a requirement for most specifications. This term is defined by the analytical method which can only detect volatiles and some semi-volatiles. It is therefore, a test of Total Volatile Hydrocarbons (TVHC), and does not determine hydrocarbons that are condensable (Oil Mist)"}, {"url": "https://en.wikipedia.org/wiki/Hydrocarbon", "passage_text": "1 Cycloalkanes are hydrocarbons containing one or more carbon rings to which hydrogen atoms are attached. 2  The general formula for a saturated hydrocarbon containing one ring is C n H 2n. 3  Aromatic hydrocarbons, also known as arenes, are hydrocarbons that have at least one aromatic ring. 1 The general formula for saturated hydrocarbons is C n H 2n+2 (assuming non-cyclic structures). 2  Saturated hydrocarbons are the basis of petroleum fuels and are found as either linear or branched species."}]