[{"url": "http://math.about.com/od/baseten/a/Understanding-Place-Value.htm", "passage_text": "Share. Place value in an extremely important concept that is taught as early as in kindergarten and as students learn about larger numbers, the concept of place value continues throughout the middle grades. Place value refers to the value of the digit based on its position. Place value is a concept that is difficult for young learners. Understanding place value fully requires many hands on experiences."}, {"url": "http://www.math.com/school/subject1/lessons/S1U1L1DP.html", "passage_text": "The idea of place value is at the heart of our number system. First, however, a symbol for nothing--our zero--had to be invented. Zero holds the place for a particular value, when no other digit goes in that position. For example, the number 100 in words means one hundred, no tens, and no ones."}, {"url": "http://www.educationworld.com/a_curr/explainthat/explainthat001.shtml", "passage_text": "We show numbers greater than 9 by using place value, which means that the value of a digit is determined by its place in the entire number. In the base-10 number system, each place has a value that's 10 times the value of the place immediately to its right."}, {"url": "http://www.math.com/school/subject1/lessons/S1U1L1GL.html", "passage_text": "In our decimal number system, the value of a digit depends on its place, or position, in the number. Each place has a value of 10 times the place to its right. A number in standard form is separated into groups of three digits using commas. Each of these groups is called a period. Click the Start, Stop, and Reset buttons on the digital counter below to understand more about how the place value works."}, {"url": "http://www.educationworld.com/a_curr/explainthat/explainthat001.shtml", "passage_text": "1 The next number to the left is in the hundreds' place. 2  The value of a number in the hundreds' place is ten times the value of the same number in the tens' place. 3  The number 258, therefore, contains 2 groups of one hundred."}, {"url": "http://www.educationworld.com/a_curr/explainthat/explainthat001.shtml", "passage_text": "1 The next digit to the left is in the tens' place. 2  The value of a number in the tens' place is ten times the value of the same number in the ones' place. 3  The number 258, therefore, contains 5 groups of ten. 4  The next number to the left is in the hundreds' place."}, {"url": "http://www.eduplace.com/math/mathsteps/2/a/", "passage_text": "Place value is the basis of our entire number system. A place value system is one in which the position of a digit in a number determines its value. In the standard system, called base ten, each place represents ten times the value of the place to its right. You can think of this as making groups of ten of the smaller unit and combining them to make a new unit."}]