[{"url": "http://shakespeare-w.com/english/konnyaku/whatis.html", "passage_text": "Konnyaku is a traditional Japanese jelly-like health food made from a kind of potato called Konnyaku potato and calcium hydroxide or oxide calcium extracted from eggshells. Noodle type of Konnyaku is called Shirataki. Shirataki is sometimes called as Miracle Noodle . The Konnyaku potato is native to Indonesia and is a kind of herbaceous perennial plant called Amorphophallus Konjac(K. Koch). "}, {"url": "http://www.house-foods.com/tofu_shirataki_usa/", "passage_text": "Tofu Shirataki is a blend of Konjac and Tofu. Traditional Shirataki does not contain tofu, and is made only from Konjac. Smart Noodle is also made of Konjac, with added fiber and omega-3. Both Traditional Shirataki and Smart Noodle are soy-free. Shirataki. Check out our line of Shirataki noodles, world's BEST pasta swap! As an added bonus, they are all GLUTEN-FREE! Smart Noodle is our latest pasta alternative with 400mg ALA Omega-3 and 6g fiber per serving!Don't forget about our Tofu Shirataki and Shirataki products too!"}, {"url": "http://www.thekitchn.com/why-its-worth-getting-to-know-zero-calorie-shirataki-noodles-221166", "passage_text": "Shirataki noodles come from a yam-like tuber called Devil's Tongue. Glucomannan starch is extracted from the tubers, then mixed with water and limewater to turn it into a substance called konnyaku. Konnyaku is then shredded into traditional shirataki noodles. "}, {"url": "https://en.wikipedia.org/wiki/Shirataki_noodles", "passage_text": "Shirataki (白滝, often written with the hiragana しらたき) are thin, translucent, gelatinous traditional Japanese noodles made from the konjac yam (devil's tongue yam or elephant yam). The word shirataki means white waterfall, describing the appearance of these noodles. Shirataki noodles can be found both in dry and soft wet forms in Asian markets and some supermarkets. When purchased wet, they are packaged in liquid. They normally have a shelf life of up to one year"}, {"url": "http://www.vitacost.com/miracle-noodle-miracle-rice-gluten-free-shirataki-rice-8-oz-2", "passage_text": "Known for its health benefits for 2000 years in China and Japan, Shirataki is made from the root of a plant called the Konnyaku Imo. Shiratake is made only from the soluble fiber of the plant, as such it only contains a healthy soluble fiber known as Glucomannan. "}, {"url": "http://shiratakinoodlefacts.com/what-are-shirataki-noodles/", "passage_text": "Shirataki noodles are made from a highly soluble fiber called glucomannan which is derived from the root of a plant called konjac, also known as the elephant’s tongue, konnyaku potato or devil’s tongue, which is widely found all over Asia. Shirataki noodles are also known as konjac, konnyaku, and glucomannan noodles. These are all names for the same product. They are a somewhat gelatinous clear noodle that is often packaged in liquid to keep its moisture."}, {"url": "http://www.huffingtonpost.com/2012/09/28/shirataki-noodle-recipes_n_1919696.html", "passage_text": "Oh wait, there is. The Japanase have a noodle by the name of shirataki that's made from a type of yam that's packed with dietary fiber but has no carbohydrates (some shirataki noodles are made out of tofu, which have a small amount of carbs). Shirataki are typically sold in wet form -- the noodles are bagged in liquid. "}, {"url": "http://www.house-foods.com/tofu_shirataki_usa/", "passage_text": "Shirataki noodles are clear, traditional Japanese noodles made from Konjac or Konnyaku, an Asian yam. Its literal translation is white waterfall in Japanese. We make Tofu Shirataki, Traditional Shirataki, and Smart Noodle. Shirataki. Check out our line of Shirataki noodles, world's BEST pasta swap! As an added bonus, they are all GLUTEN-FREE! Smart Noodle is our latest pasta alternative with 400mg ALA Omega-3 and 6g fiber per serving!Don't forget about our Tofu Shirataki and Shirataki products too!"}, {"url": "http://pogogi.com/what-exactly-shirataki-miracle-rice", "passage_text": "Everything Japanese Food. Though shirataki rice or miracle rice is still fairly new to the Western culinary world, it has been a part of the Asian diet for nearly 2000 years. The rice is prepared from konnyaku flour that is obtained from the root of the konnyaku plant. The konnyaku flour is also known as glucomannan. "}]