[{"url": "http://dogtime.com/dog-breeds/whippet", "passage_text": "The Whippet dog breed was a poacher's best friend, speedily going after rabbits and other small game. Today the Whippet competes in agility, flyball, lure coursing, rally, and obedience and is a loving therapy dog. His unique nature, friendly personality, and stylish look make him a favorite as a family companion as well as in the show ring."}, {"url": "http://www.yourpurebredpuppy.com/reviews/whippets.html", "passage_text": "Whippets need access to a large fenced area -- fenced because these independent dogs are likely to take off and not come back. If there is a dog club in your area, get your Whippet involved in lure coursing (chasing a mechanized lure around a track or across an open field)."}, {"url": "http://www.timbreblue.com/about-whippets", "passage_text": "Most whippets are very good with kids, but no dog of any breed should be left alone with young children. Think of your dog as a pair of scissors ... you wouldn't leave your toddler alone with them, but under supervision, she'll learn to use them correctly."}, {"url": "http://www.animalplanet.com/tv-shows/dogs-101/videos/whippet/", "passage_text": "When it comes to speed, the Whippet is the Ferrari of the dog world. This breed can even out pace a kangaroo!"}, {"url": "http://www.vetstreet.com/dogs/whippet", "passage_text": "The Whippet is a sleek, beautifully statuesque, and athletic breed. Although the Whippet is not a watchdog, he is a keen sight hound capable of chasing neighborhood cats, stealing food from the kitchen counter when no one is looking, and keeping your home free of such interlopers as mice."}, {"url": "http://www.merriam-webster.com/dictionary/whippet", "passage_text": "Full Definition of WHIPPET. : any of a breed of small swift slender dogs used for coursing small game and racing. See whippet defined for English-language learners. See whippet defined for kids. ADVERTISEMENT."}, {"url": "https://en.wikipedia.org/wiki/Whippet", "passage_text": "The Whippet (also English Whippet or Snap dog) is a dog breed of medium-size. They are a sighthound breed that originated in England, where they descended from greyhounds."}]