[{"url": "http://www.ehow.com/how_2182038_use-bleach-laundry.html", "passage_text": "Adding bleach to your laundry is an effective way to remove stains from laundry and keep your whites gleaming. Liquid bleach also kills germs. It is important to use care when adding bleach to your laundry. Using chlorine bleach on some fabrics can remove the color. Using too much bleach, even on bleach-safe items, can create holes in the fabric. It is still necessary to use laundry detergent when bleaching fabric. Bleach does not contain soaps or detergents to clean the fabric; it removes stains and disinfects. "}, {"url": "http://laundry.about.com/od/bleachandwhiteners/fl/6-Tips-for-Using-Bleach-in-Laundry.htm", "passage_text": "Chlorine bleach is a 5.25% solution of sodium hypochloride. It is quite powerful and must be diluted with water for safe use on some fabrics. When chlorine bleach is used for laundry, the chemical ingredient oxidizes helping to remove soil and organic matter. It acts as a disinfectant on bacteria and viruses and generally whitens cotton and linen fabrics. "}, {"url": "http://housekeeping.about.com/od/laundry/g/bleach.htm", "passage_text": "Bleach is a specific type of laundry aid that helps remove dirt and stains from clothing, but it also removes color from most clothes. Bleach creates a chemical reaction with soil that breaks it down and removes it from clothing. Bleach also has a whitening and brightening effect on white clothing. "}, {"url": "http://laundry.about.com/od/laundrybasics/a/howtobleach.htm", "passage_text": "How to Use Chlorine Bleach in Laundry. Chlorine bleach is a 5.25% solution of sodium hypochloride and the most powerful. The liquid version is the most common but a dry form is also available. Both must be diluted with water for safe use on fabrics. "}, {"url": "http://www.answers.com/Q/What_does_bleach_do_for_laundry", "passage_text": "Do not pour bleach directly on the laundry, it will burn it.   Consider using Oxygen non-chlorine bleach:  -buy concentrated or ultraconcentrated Sodium Percarbonate in bleach in powder form. You get the best cleaning for least money. The cheap brands contain a lot more fillers than the concentrated kind. Add one cup of bleach to a large load of white laundry.  Use hot water.  If laundry comes out yellow, it means your water contains too much iron, which rusts in contact … with bleach and yellows your laundry. Should this happen, stop using chlorine bleach, try Oxy."}, {"url": "http://www.cleaninginstitute.org/clean_living/cleaning_product_facts_bleach.aspx", "passage_text": "If liquid household bleach is not recommended, you can use a color-safe (oxygen) bleach to help remove stains and odors. Also read the cleaning product label. Some detergents have color-safe bleach or bleach alternative built into the product. However, remember that these products do not disinfect. "}, {"url": "http://home.howstuffworks.com/bleach.htm", "passage_text": "Bleach is a very useful chemical both around the house and for large-scale use. You can use bleach to remove stains on clothing or to whiten your laundry. It's used to disinfect surfaces, too, especially in the kitchen and bathroom. "}, {"url": "https://www.clorox.com/cleaning-and-laundry-tips/laundry/laundry-advice/how-to-use-bleach/", "passage_text": "1 Add ½ cup of Clorox® Regular-Bleach to wash water after your detergent, but before adding clothes. 2  For optimal results, we recommend adding ½ cup of Clorox® Regular-Bleach to water five minutes after the wash cycle has begun. 3  For an even easier pour, try using Clorox® Splash-Less™ Bleach. 1 For larger machines, we recommend using 1 cup Clorox® Regular-Bleach to get your whites their whitest. 2  If your extra large machines does not have a bleach dispenser, follow instructions above using 1 cup Clorox® Regular-Bleach. 3  If your extra large machines has a bleach dispenser, fill dispenser to the maximum fill line."}, {"url": "https://www.clorox.com/cleaning-and-laundry-tips/laundry/laundry-advice/how-to-use-bleach/", "passage_text": "Machines without a bleach dispenser: 1  Add your favorite detergent to wash water before adding clothes or bleach. 2  Add ½ cup of Clorox® Regular-Bleach to wash water after your detergent, but before adding clothes. 3  Add clothes to wash water after the wash cycle begins. 1 For larger machines, we recommend using 1 cup Clorox® Regular-Bleach to get your whites their whitest. 2  If your extra large machines does not have a bleach dispenser, follow instructions above using 1 cup Clorox® Regular-Bleach. 3  If your extra large machines has a bleach dispenser, fill dispenser to the maximum fill line."}]