[{"url": "http://bigthink.com/think-tank/steven-pinker-defense-of-scientism", "passage_text": "Pinker then goes further. Scientism, in its broadest sense, is a worldview. The facts of science, by exposing the absence of purpose in the laws governing the universe, force us to take responsibility for the welfare of ourselves, our species, and our planet, Pinker writes. "}, {"url": "http://skepdic.com/scientism.html", "passage_text": "Scientism is a scientific worldview that encompasses natural explanations for all phenomena, eschews supernatural and paranormal speculations, and embraces empiricism and reason as the twin pillars of a philosophy of life appropriate for an Age of Science (Shermer 2002). "}, {"url": "http://www.worldwisdom.com/public/viewpdf/default.aspx?article-title=Scientism--The_Bedrock_of_the_Modern_Worldview_by_Huston_Smith.pdf", "passage_text": "Huston Smith. instances of scientism, and one of Freud’s assertions can head the parade: “Our science is not illusion, but an illusion it would be to suppose that what science cannot give us we can get elsewhere.” Our ethos teeters precariously on sandy foundations such as this. Scientism: The Bedrock of the Modern Worldview by Huston Smith Features in Science and the Myth of Progress © 2003 World Wisdom, Inc. Edited by Mehrdad M. Zarandi, Foreword by Giovanni Monastra All Rights Reserved, For Personal Usage Only www,worldwisdom.com 248."}, {"url": "https://en.wikipedia.org/wiki/Scientism", "passage_text": "Philosophers such as Alexander Rosenberg have also appropriated scientism as a name for the view that science is the only reliable source of knowledge. Scientism may refer to science applied in excess. The term scientism can apply in either of two senses: 1  To indicate the improper usage of science or scientific claims. 1 An example of this second usage is to label as scientism any attempt to claim science as the only or primary source of human values (a traditional domain of ethics) or as the source of meaning and purpose (a traditional domain of religion and related worldviews)."}, {"url": "http://www.reasons.org/articles/what-in-the-world-is-a-worldview", "passage_text": "In the simplest terms, a worldview may be defined as how one sees life and the world at large. In this manner it can be compared to a pair of glasses.1 How a person makes sense of the world depends upon that person's vision, so to speak. "}, {"url": "http://www.pbs.org/faithandreason/gengloss/sciism-body.html", "passage_text": "Scientism. Unlike the use of the scientific method as only one mode of reaching knowledge, scientism claims that science alone can render truth about the world and reality. Scientism sees it necessary to do away with most, if not all, metaphysical, philosophical, and religious claims, as the truths they proclaim cannot be apprehended by the scientific method. In essence, scientism sees science as the absolute and only justifiable access to the truth."}, {"url": "https://en.wikipedia.org/wiki/Scientism", "passage_text": "Scientism is belief in the universal applicability of the scientific method and approach, and the view that empirical science constitutes the most authoritative worldview or the most valuable part of human learning-to the exclusion of other viewpoints. 1 An example of this second usage is to label as scientism any attempt to claim science as the only or primary source of human values (a traditional domain of ethics) or as the source of meaning and purpose (a traditional domain of religion and related worldviews)."}, {"url": "http://www.asa3.org/ASA/education/views/index.html", "passage_text": "A worldview is a theory of the world, used for living in the world. A world view is a mental model of reality — a framework of ideas & attitudes about the world, ourselves, and life, a comprehensive system of beliefs — with answers for a wide range of questions: "}, {"url": "http://www.merriam-webster.com/dictionary/scientism", "passage_text": "Definition of SCIENTISM. 1. : methods and attitudes typical of or attributed to the natural scientist. 2. : an exaggerated trust in the efficacy of the methods of natural science applied to all areas of investigation (as in philosophy, the social sciences, and the humanities). "}]