[{"url": "http://castles.org/dokuwiki/kids/parts-of-a-castle/parts-of-a-castle", "passage_text": "Parts of a Castle. Welcome to Castles for Kids. Please browse these pages to learn more about the parts of a castle, what they have inside them, and the people that live in a castles. Have fun! Parts. Inisde. People. Activities. This section was created by Carrie Anne Fossum. We appreciate her collaboration with us."}, {"url": "http://www.castlesandmanorhouses.com/architecture.htm", "passage_text": "Although castle architecture developed over the centuries in line with weapons technology, the principles remained much the same. A good castle provided a secure base that could be easily defended. "}, {"url": "http://medievalcastles.stormthecastle.com/parts-of-a-medieval-castle.htm", "passage_text": "The battlements are the top sections of the outer wall of the castle. Now to access these battlements the archers would stand on a walk way that was a wall in it's own right. This walkway is built right up against the outer wall and is called the Rampart. Arrow Loops-These were slots in the walls and structures that were used to shoot arrows through. They came in a wide variety of shapes and sizes. Ashlar-Blocks of smooth square stone."}, {"url": "https://en.wikipedia.org/wiki/Castle", "passage_text": "A castle (from Latin: castellum) is a type of fortified structure built in Europe and the Middle East during the Middle Ages by nobility. Scholars debate the scope of the word castle, but usually consider it to be the private fortified residence of a lord or noble. A keep was a great tower and usually the most strongly defended point of a castle before the introduction of concentric defence. Keep was not a term used in the medieval period – the term was applied from the 16th century onwards – instead  donjon  was used to refer to great towers, or turris in Latin."}, {"url": "http://www.topcastles.com/soorten.php", "passage_text": "Felsenburgen: Castles that are build on top a mountain rock. Parts of the castle, including its main entrance, can be inside the rock. The Wasgau border region of France and Germany is famous for its rock castles. The rock defends the castle against sapping and is considered to be the strongest castle type. "}, {"url": "http://mysingingmonsters.wikia.com/wiki/Castle", "passage_text": "The Castle is a Structure that allows for Monsters to be placed on an Island-each castle provides a certain number of beds for monsters. "}, {"url": "http://www.answers.com/Q/What_type_of_Structure_is_the_Disney_Castle", "passage_text": "Making the world better, one answer at a time. It appeared to be a very nicely decorated medieval-style castle made of some type of stone with metal and wood as well. It is a large palace of many rooms for many purposes. A library and a large, opulent throne room can be seen in KH2 as well as a garden. Warwick castle was first built as a wooden motte-and-bailey castle (a castle built on a mound with a moat/dictch around it) It was rebuilt a century after as a stone castle. 27 people found this useful. Edit. Share to:"}, {"url": "https://en.wikipedia.org/wiki/Castle", "passage_text": "As a static structure, castles could often be avoided. Their immediate area of influence was about 400 metres (1,300 ft) and their weapons had a short range even early in the age of artillery. However, leaving an enemy behind would allow them to interfere with communications and make raids. A keep was a great tower and usually the most strongly defended point of a castle before the introduction of concentric defence. Keep was not a term used in the medieval period – the term was applied from the 16th century onwards – instead  donjon  was used to refer to great towers, or turris in Latin."}, {"url": "http://www.historyonthenet.com/Medieval_Life/types_of_castle.htm", "passage_text": "Stone Keep Castle. This type of castle soon replaced the Motte and Bailey castles as it offered a better form of defence. A stone keep was the central feature, with thick walls and few windows. Entrance to the keep was by stone steps leading to the first floor. Motte and Bailiey castles were the earliest form of castles built completely from scratch by the Normans. As their name suggests they had two parts the Motte and the Bailey. The Motte was a large hill made of earth on which was built a wooden keep or lookout."}]