[{"url": "http://www.rkm.com.au/CALCULATORS/CALCULATOR-circle-sphere.html", "passage_text": "This calculator will work out the radius of a circle, the diameter of a circle, the area of a circle, the surface area of a sphere and the volume of a sphere using any of those values as a starting point. Simply enter the desired value in the relevant box. Please use only numbers (e.g. enter 22 not 22 cm). "}, {"url": "http://www.wikihow.com/Calculate-the-Radius-of-a-Circle", "passage_text": "Calculate the radius from the circumference. To calculate the radius based on the circumference, simply divide the circumference by 2π, or 6.28. 1  For example, if the circumference of a circle is 15, the radius r = 15/2π, or 2.39. The diameter is the longest line that can be drawn through a circle, and cuts the circle into two equal halves. It is also two times the length of the radius. The formula for the diameter is D = 2r, where “D” stands for diameter, and “r” stands for radius. The same formula in terms of r is r = D/2."}, {"url": "http://www.wikihow.com/Calculate-the-Diameter-of-a-Circle", "passage_text": "1. If you know the radius of the circle, double it to get the diameter. The radius is the distance from the center of the circle to its edge. For example, if the radius of the circle is 4 cm, then the diameter of the circle is 4 cm x 2, or 8 cm."}, {"url": "http://www.wikihow.com/Calculate-the-Diameter-of-a-Circle", "passage_text": "This goes back to manipulating the formula for finding the area of a circle, A = πr 2, to get the diameter. For example, if the area of the circle is 25 cm 2, find the square root to get √25 cm 2 = 5 cm. Then, divide the result by π. 5 cm/π =1.59 cm, so the radius of the circle is 1.59 cm. Ad. The radius is the distance from the center of the circle to its edge. For example, if the radius of the circle is 4 cm, then the diameter of the circle is 4 cm x 2, or 8 cm."}, {"url": "http://www.ehow.com/how_7391669_calculate-area-circle-diameter.html", "passage_text": "If you only have the diameter of a circle, convert it to the radius. Do not try to find area until you convert the diameter to the radius. A radius is half the length of the diameter. Divide the diameter by 2 to get the radius, for example: A circle with a diameter of 10 would have a radius of 5. A circle with a diameter of 1,050 would have a radius of 525"}, {"url": "http://www.wikihow.com/Calculate-the-Radius-of-a-Circle", "passage_text": "The radius of a circle is the distance from the center of the circle to its edge. The diameter of the circle is the distance all the way across it, and is equal to two times the radius. You will often be asked to calculate the radius of the circle based on other measurements. The diameter is the longest line that can be drawn through a circle, and cuts the circle into two equal halves. It is also two times the length of the radius. The formula for the diameter is D = 2r, where “D” stands for diameter, and “r” stands for radius. The same formula in terms of r is r = D/2."}, {"url": "http://studyzone.org/mtestprep/math8/e/diamradcircle6l.cfm", "passage_text": "If the diameter of a circle is 14 inches, find the circumference of the circle. C = π x d. Find the circumference of a circle having a diameter of 14 inches. (let π = 3.14). Simply take the formula for the circumference and plug in the given information. Here is another example: If the diameter of a circle is 14 inches, find the circumference of the circle. C = π x d Find the circumference of a circle having a diameter of 14 inches. (let π = 3.14)"}, {"url": "http://www.virtualnerd.com/pre-algebra/perimeter-area-volume/circles/circle-sector-area-examples/circle-area-from-diameter", "passage_text": "Note: If you have the diameter of a circle, you can use it to find the area of that circle. Just plug that value into the formula for the area of a circle and solve. Watch this tutorial to see how it's done! If you have the diameter of a circle, you can use it to find the area of that circle. Just plug that value into the formula for the area of a circle and solve."}, {"url": "http://www.wikihow.com/Calculate-the-Diameter-of-a-Circle", "passage_text": "2. If you know the circumference of the circle, divide it by π to get the diameter. π is equal to approximately 3.14 but you should use your calculator to get the most accurate results. For example, if the circumference of the circle is 10 cm, then the diameter is 10 cm/π, or 3.18 cm. The radius is the distance from the center of the circle to its edge. For example, if the radius of the circle is 4 cm, then the diameter of the circle is 4 cm x 2, or 8 cm."}]