[{"url": "http://animalcareers.about.com/od/Compensation/a/Veterinarian-Salary.htm", "passage_text": "Starting Salary. Vets in their first year of practice can expect to earn a salary of approximately $60,000. A 2008 study by the American Veterinary Medical Association found some variations in starting salary based on area of specialization. Small animal exclusive vets started out with the highest average earnings of $71,462 in the first year. Veterinarians employed by the federal government averaged a salary of $93,398 per year. Corporate veterinarians had the highest earnings with a median salary of over $140,000 per year. Veterinarians in the armed forces had the lowest earnings with a median salary of $8"}, {"url": "http://www.healthcaresalaryonline.com/veterinarian-salary.html", "passage_text": "The average salary for an animal doctor is $86,640 per year. The average Veterinarian Salary is calculated by the US Government Bureau of Labor Statistics from a variety of sources. Veterinarians work in a number of settings including hospitals, clinics and other settings. On an annual basis the average Veterinarian salary is $86,640. The lowest 10% earn less than $53,270 per year while the upper 10% earn more than $149,530 per year. These salaries are calculated as a mean or average."}, {"url": "http://money.usnews.com/careers/best-jobs/veterinarian/salary", "passage_text": "Salary Outlook. The BLS reports that veterinarians earned a median salary of $86,640 in 2013. The best-paid veterinarians earned $149,530, while the lowest-paid earned $53,270. Veterinarians working in scientific research tend to be among the highest paid. The BLS reports that veterinarians earned a median salary of $86,640 in 2013. The best-paid veterinarians earned $149,530, while the lowest-paid earned $53,270"}, {"url": "http://money.usnews.com/careers/best-jobs/veterinarian/salary", "passage_text": "Average Veterinarian Pay vs. Other Best Jobs. With an average salary of $96,140 in 2013, veterinarians earned a healthy take-home pay for health care jobs. While they earned less than physicians ($188,440), they made about three times the pay of veterinary technologists ($31,760) in 2013. They made about the same average salary as physician assistants ($94,530). The BLS reports that veterinarians earned a median salary of $86,640 in 2013. The best-paid veterinarians earned $149,530, while the lowest-paid earned $53,270."}, {"url": "http://work.chron.com/starting-salary-midcareer-salary-large-animal-veterinarians-29193.html", "passage_text": "Entry-Level Salaries Between $40,000 and $45,000. The average starting salary for a large animal veterinarian was $44,000 as of May 2014, according to the job site Simply Hired. Most large animal veterinarians, like all veterinarians, earn bachelor's degrees in any major and four-year Doctor of Veterinary Medicine degrees, according to the Bureau of Labor Statistics. Average Salaries Between $90,000 and $95,000. The BLS groups average salaries for all veterinarians together, including those who work with large animals. These average salaries are reflective of what mid-career large animal veterinarians earn."}, {"url": "http://www.aavmc.org/Funding-Education/Veterinarian-Incomes.aspx", "passage_text": "The Future of Veterinary Medicine. Veterinary Medical Incomes The starting salaries of graduating veterinarians and veterinary medical salaries in general have been increasing at a rate greater than inflation, except for a slight dip in 2011. "}, {"url": "http://veterinarymedicinecareers.org/starting-veterinarian-salaries-in-america/", "passage_text": "Starting Veterinarian Salaries in America. Even starting veterinarians are well-paid individuals. The BLS estimates that the median annual salary for a veterinarian is over $82,000, while the average starting salary for the typical pet-care veterinarian is over $69,000. Even the lowest 10 percent of veterinarians earned nearly $50,000 per year"}, {"url": "http://www.healthcaresalaryonline.com/veterinarian-salary.html", "passage_text": "The 5 highest paying city or metropolitan areas to earn a Veterinarian salary are Honolulu, HI $167,600, Santa Barbara-Santa Maria-Goleta, CA $165,360, San Francisco $156,560, Palm Coast, FL $153,420 and Santa Ana-Anaheim-Irvine, CA Metropolitan Division $147,430. On an annual basis the average Veterinarian salary is $86,640. The lowest 10% earn less than $53,270 per year while the upper 10% earn more than $149,530 per year. These salaries are calculated as a mean or average."}, {"url": "http://veterinarymedicinecareers.org/starting-veterinarian-salaries-in-america/", "passage_text": "Salary Opportunities for Veterinarians. Even starting veterinarians are well-paid individuals. The BLS estimates that the median annual salary for a veterinarian is over $82,000, while the average starting salary for the typical pet-care veterinarian is over $69,000. Even the lowest 10 percent of veterinarians earned nearly $50,000 per year"}]