[{"url": "http://www.nosweatshakespeare.com/quotes/shakespeare-love-quotes/", "passage_text": "Read Shakespeare’s Top 50 Love Quotes. No Sweat Shakespeare has a romantic soul and would like to share our favourite Shakespeare love quotes with you."}, {"url": "http://www.answers.com/Q/Did_William_shakespeare_fall_in_love", "passage_text": "John Shakespeare (c. 1531 - September 1601) was the father of William Shakespeare. He was a glover. John Shakespeare was a successful and well connected man during the early p … art of his career. He ran a business as a maker, worker and seller of leather goods such as purses, belts and gloves."}, {"url": "http://www.answers.com/Q/When_did_shakespeare_fall_in_love", "passage_text": "Shakespeare fell in love with Anne Hathaway, sometime before he married her in 1582."}, {"url": "http://shakespeare.about.com/od/romeoandjuliet/a/romeo_love.htm", "passage_text": "Romeo and Juliet has become forever associated with love. The play has become an iconic story of love and passion, and the name “Romeo” is still used to describe young lovers. Shakespeare’s treatment of love in the play is complex and multifaceted."}, {"url": "http://www.sparknotes.com/shakespeare/muchado/canalysis.html", "passage_text": "Although she appears hardened and sharp, Beatrice is really vulnerable. Once she overhears Hero describing that Benedick is in love with her (Beatrice), she opens herself to the sensitivities and weaknesses of love. Beatrice is a prime example of one of Shakespeare’s strong female characters."}, {"url": "http://www.answers.com/Q/Did_William_shakespeare_fall_in_love", "passage_text": "In 1568 John was appointed High Bailiff-mayor of Stratford in all but name and carrying the title 'Master'. In 1569 John had applied for a coat of arms; it was eventually granted on 20 October 1596 to John Shakespeare after William Shakespeare had applied for one on behalf of his father."}, {"url": "http://archive.lovingyou.com/scripts/quotes/quotes.php?cat=shakespeare&start=21", "passage_text": "1328. And when he shall die, take him and cut him out into little stars. And he will make the face of heaven so fine, that all the world shall fall in love with night, and pay no worship to the garish sun.. Shakespeare's Romeo and JulietSubmitted by Candace Berry. 1726."}, {"url": "http://shakespeare.about.com/od/shakespearebasics/tp/Love-in-Shakespeare.htm", "passage_text": "Love in Shakespeare is a recurrent theme. The treatment of love in Shakespeare’s plays and sonnets is remarkable for the time: the Bard mixes courtly love, unrequited love, compassioinate love and sexual love with skill and heart."}]