[{"url": "http://www.dph.illinois.gov/topics-services/environmental-health-protection/structural-pest-control/bed-bugs", "passage_text": "Bed bugs can survive more than a year without feeding, but most adults and nymphs probably do not live more than six months without a meal. This ability lets them wait for transient hosts that periodically inhabit camp cabins, apartments and temporary housing. It also helps them survive transportation. HEAT. Some infested items can be microwaved to destroy bed bugs. Drying items such as clothing and rugs in a hot dryer for 20 minutes or more also will kill all stages of bed bugs. However, sealing infested items in plastic bags and leaving them in the sun on hot days has not proven effective."}, {"url": "http://www.extension.umn.edu/garden/insects/find/bed-bugs-in-residences/", "passage_text": "Bed bugs are active at night and generally hide during the day. After mating, females lay white, oval eggs (1/16-inch long) into cracks and crevices. An individual bed bug can lay 200-250 eggs in her lifetime. The eggs hatch in about 6-10 days and the newly emerged bed bug nymphs seek a blood meal. Bed bug before and after a blood meal. Adult bed bugs are oval, flattened, brown, and wingless insects approximately 1/4 to 3/8 long (5-9 mm). They are similar in appearance to a wood tick. After the bug has taken a blood meal, its color will change from brown to purplish-red."}, {"url": "http://www.extension.umn.edu/garden/insects/find/bed-bugs-in-residences/", "passage_text": "All ages are found in a reproducing population. Immature bed bugs may live for several months without feeding while adults may survive as long as one year without a meal. Under normal circumstances, adult bed bugs will live for about ten to eleven months. Bed bug before and after a blood meal. Adult bed bugs are oval, flattened, brown, and wingless insects approximately 1/4 to 3/8 long (5-9 mm). They are similar in appearance to a wood tick. After the bug has taken a blood meal, its color will change from brown to purplish-red."}, {"url": "http://www.bed-bugs.com/lifecycle/how-long-do-bed-bugs-live/", "passage_text": "It appears that bed bugs are similar to other animals even including humans: survival depends on genetics, exposure, food sources, and the environment. Without a doubt, bed bugs can survive over a year. They can also survive that time without a blood meal. However, the nymphs are more sensitive to lack of food than adults. Newly hatched nymphs need a blood meal within a few days and first and second instar nymphs are most sensitive to lack of food. Virtually any report of bed bugs surviving over a year can be considered true."}, {"url": "http://www.bed-bugs.com/lifecycle/how-long-do-bed-bugs-live/", "passage_text": "There is a great debate as to how long bed bugs can live. Some scientists new to the study of bed bugs are challenging historic published research showing that bed bugs do not survive as long as previously published. Others believe that published data short changes the bed bugs ability to live a long life. However, the nymphs are more sensitive to lack of food than adults. Newly hatched nymphs need a blood meal within a few days and first and second instar nymphs are most sensitive to lack of food. Virtually any report of bed bugs surviving over a year can be considered true."}, {"url": "http://www.ehow.com/how-does_5199760_long-can-bed-bugs-live_.html", "passage_text": "The Nymph Is Born. After about one to two weeks, the bed bug egg hatches and a nymph is born. A nymph needs blood from humans, dogs, cats or any warm-blooded animal in order to shed its exoskeleton, a process known as molting. The nymph, as with all bed bugs, comes out to feed at night and hides during the day. Laying the Eggs. A female bed bug first lays her eggs, white and oval in shape, in folds or crevices of furniture, often a bed (hence the name). The eggs have a sticky outer shell that helps them adhere to surfaces. Females are capable of laying six to 12 eggs daily in clusters as large as 50"}, {"url": "http://www.bed-bugs.com/lifecycle/how-long-do-bed-bugs-live/", "passage_text": "The truth is that there is no significant data pool to average the life span of the bed bug. That means that there are published observations, but these are just observations and there is no statistically significant study that reports life span of bed bugs. However, the nymphs are more sensitive to lack of food than adults. Newly hatched nymphs need a blood meal within a few days and first and second instar nymphs are most sensitive to lack of food. Virtually any report of bed bugs surviving over a year can be considered true."}, {"url": "http://deadbedbugs.com/faq-articles/index.php?action=article&cat_id=001&id=14", "passage_text": "How long can bed bugs live? Adult bed bugs can survive a full year without feeding, going into a semi hibernation state until activated by the CO2 from a blood source. Normal life cycle for a bed bug is up to a year and a half, while younger bed bugs can go about a month or two without a blood source before dying. It will take about a month for a nymph to go through all 4 stages to become an adult bed bugs and longer if they are outdoors or don't have a ready blood source to accelerated growth and molting. See picture of bed bugs here."}]