[{"url": "http://www.travelchannel.com/shows/ghost-adventures/episodes/return-to-virginia-city", "passage_text": "Zak, Nick & Aaron reexamine former mining town Virginia City, the site of their 2004 documentary that started their Ghost Adventures. The guys explore a former hospital, where a former patient burned himself and a nurse to death."}, {"url": "http://virginiacity.com/", "passage_text": "Virginia City, the best known of these and the sole survivor, became the Capitol of the Territory. The very much alive ghost town, Virginia City, Montana, is frozen in time. It is a remarkably well preserved old west Victorian gold mining town just 20 miles west of Yellowstone National Park (90 miles by road)."}, {"url": "http://www.youtube.com/watch?v=2RHEe6Zxc2Q", "passage_text": "On the evening of July 23, 2011 we took a ghost tour of Virginia City. Thinking it would be more of an interpretive tour of the town's history I wasn't expecting to see much of anything. The ghost walk tour is more of an investigative experience mixed with some interpretive history."}, {"url": "http://ghoststudy.com/new2/vc.html", "passage_text": ". Conference and investigation of Virginia City, NV Ghoststudy team members and our partners at the Northern California Paranormal Research Society attended this Ghost conference on October 13th & 14th. It was hosted by Janice Oberding (author of Haunted Nevada), Michele Hardison, and Khris Hamlet."}, {"url": "http://ghosttowns.com/states/nv/virginiacity.html", "passage_text": "There is no doubt Virginia City is the best known of the early Nevada mining towns. This is where it all began. There is simply not enough space to properly and adequately describe all that happened in the city that gave birth to the fabulous history of Nevada's gold and silver mining processes."}, {"url": "http://www.travelchannel.com/shows/ghost-adventures/episodes/return-to-virginia-city", "passage_text": "Return to Virginia City. Zak, Nick & Aaron reexamine former mining town Virginia City, the site of their 2004 documentary that started their Ghost Adventures. The guys explore a former hospital, where a former patient burned himself and a nurse to death."}, {"url": "http://www.hauntedhouses.com/states/nv/washoe_club.htm", "passage_text": "LOCATION: The Washoe Club is located in the heart of old downtown Virginia City. C street (Highway 341) is between Washington St. and Taylor St., though The Washoe Club is closer to the corner of Taylor Street and C Street."}]