[{"url": "http://www.babynamespedia.com/meaning/Mistral", "passage_text": "[ 2 syll. mis-tral, mi-str-al ] The baby girl name Mistral is pronounced as M IH STRAHL †. Mistral's language of origin is English. Mistral is a variant of Misty (English). Mistral is not popular as a baby girl name. It is not listed within the top 1000. † English pronunciation for Mistral: M as in me (M.IY) ; IH as in it (IH.T) ; S as in see (S.IY) ; T as in tee (T.IY) ; R as in race (R.EY.S) ; AH as in mud (M.AH.D) ; L as in lay (L.EY). "}, {"url": "http://www.thefreedictionary.com/mistral", "passage_text": "mistral. n. 1. (Physical Geography) a strong cold dry wind that blows through the Rhone rhône valley And S france to The mediterranean, coast mainly in the. winter I saw him, the sea gray under the mistral and foam-flecked, watching the vanishing coast of France, which he was destined never to see again; and I thought there was something gallant in his bearing and dauntless in his soul."}, {"url": "http://www.answers.com/Q/What_does_le_mistral_mean", "passage_text": "The mistral is a katabatic wind (caused by the difference in pressure between the cold air of a high pressure system over northwest Europe and a low pressure system in the Med … iterranean). "}, {"url": "https://en.wikipedia.org/wiki/Mistral_(wind)", "passage_text": "The name mistral comes from the Languedoc dialect of the Occitan and means masterly. The same wind is called mistrau in the Provencal provençal variant Of, occitan mestral In, catalan maestrale In italian And, corsican maistrale maistràle or bentu Maestru, in sardinian and Majjistral. in maltese The wind can blow for more than a week. This kind of mistral is often connected with a low pressure area in the Gulf of Genoa, and it can bring unstable weather to the Cote côte'D azur and the east Of, provence sometimes bringing heavy snow to low altitudes in. winter"}, {"url": "http://www.definitions.net/definition/mistral", "passage_text": "Wiktionary (0.00 / 0 votes) Rate this definition: mistral (Noun). A strong cold north-west wind in southern France and the Mediterranean. Origin: mistral, from maestral, compare Catalan mestral, from magistralis, from magister. "}, {"url": "https://en.wikipedia.org/wiki/Mistral_(wind)", "passage_text": "In the Languedoc area, where the tramontane is the strongest wind, the mistral and the tramontane blow together onto the Gulf of Lion and the northwest of the western Mediterranean, and can be felt to the east of the Balearic Islands, in Sardinia, and sometimes as far as the coast of Africa. The wind can blow for more than a week. This kind of mistral is often connected with a low pressure area in the Gulf of Genoa, and it can bring unstable weather to the Cote côte'D azur and the east Of, provence sometimes bringing heavy snow to low altitudes in. winter"}, {"url": "https://en.wikipedia.org/wiki/Mistral_(wind)", "passage_text": "When the mistral blows from the west, the mass of air is not so cold and the wind only affects the plain of the Rhone delta and the Cote côte'D. Azur the good weather is confined to the coast of The, mediterranean while it can rain in the. interior The wind can blow for more than a week. This kind of mistral is often connected with a low pressure area in the Gulf of Genoa, and it can bring unstable weather to the Cote côte'D azur and the east Of, provence sometimes bringing heavy snow to low altitudes in. winter"}, {"url": "http://www.thinkbabynames.com/meaning/1/Mistral", "passage_text": "Mistral /mis-tral/ as a boys' name is of Provencal origin, and the meaning of Mistral is masterful. Name of a seasonal cold, violent wind in the South of France. Kreatif forms of Mistral: Martral, Midtral, Mistralmo, Momistral, Motral. Mistral is an uncommonly occurring first name for men and an unusual surname too for both adults and children. (2000 U.S. Census)."}, {"url": "http://www.thefreedictionary.com/mistral", "passage_text": "mistral-a strong north wind that blows in France during the winter. boreas, north wind, norther, northerly-a wind that blows from the north. I saw him, the sea gray under the mistral and foam-flecked, watching the vanishing coast of France, which he was destined never to see again; and I thought there was something gallant in his bearing and dauntless in his soul."}, {"url": "http://www.merriam-webster.com/dictionary/mistral", "passage_text": "Definition of MISTRAL. : a strong cold dry northerly wind of southern France. ADVERTISEMENT."}]