[{"url": "https://en.wikipedia.org/wiki/Lyme_disease", "passage_text": "Lyme disease, also known as Lyme borreliosis, is an infectious disease caused by bacteria of the Borrelia type. The most common sign of infection is an expanding area of redness, known as erythema migrans, that begins at the site of a tick bite about a week after it has occurred. Lyme disease is caused by spirochetal bacteria from the genus Borrelia. Spirochetes are surrounded by peptidoglycan and flagella, along with an outer membrane similar to other Gram-negative bacteria."}, {"url": "http://medical-dictionary.thefreedictionary.com/Lyme+disease", "passage_text": "Lyme disease. n. An inflammatory disease caused by the spirochete Borrelia burgdorferi transmitted by ticks and characterized initially by a rash followed by flulike symptoms including fever, joint pain, and headache; if untreated, it can result in chronic arthritis and nerve and heart dysfunction. Late disseminated disease and chronic lyme disease. Weeks, months, or even years after an untreated tick bite, symptoms can appear in several forms, including: 1  Fatigue, forgetfulness, confusion, mood swings, irritability, numbness."}, {"url": "http://www.mayoclinic.org/diseases-conditions/lyme-disease/basics/definition/CON-20019701", "passage_text": "The most common tick-borne illness in North America and Europe, Lyme disease is transmitted by the bite of an infected blacklegged tick. You're more likely to get Lyme disease if you live or spend time in grassy and heavily wooded areas where ticks carrying the disease thrive. It's important to take common-sense precautions in areas where ticks are prevalent."}, {"url": "http://medical-dictionary.thefreedictionary.com/Lyme+disease", "passage_text": "An inflammatory disorder typically contracted during the summer and caused by Borrelia burgdorferi, a spirochete transmitted by Ixodes scapularis in the eastern U.S. and I. pacificus in the western U.S., and by various Ixodes species in Europe. (B. valaisiana is another spirochete associated with Lyme disease). Late disseminated disease and chronic lyme disease. Weeks, months, or even years after an untreated tick bite, symptoms can appear in several forms, including: 1  Fatigue, forgetfulness, confusion, mood swings, irritability, numbness."}, {"url": "http://www.thefreedictionary.com/Lyme+disease", "passage_text": "Noun. 1. Lyme disease-an acute inflammatory disease characterized by a rash with joint swelling and fever; caused by bacteria carried by the bite of a deer tick. Lyme arthritis. zoonosis, zoonotic disease-an animal disease that can be transmitted to humans. Translations"}, {"url": "http://www.medicinenet.com/script/main/art.asp?articlekey=10733", "passage_text": "Lyme disease: An inflammatory disease that is caused by the bacterium Borrelia burgdorferi, which is transmitted to humans by the deer tick. The first sign of Lyme disease is a red, circular, expanding rash, usually radiating from the tick bite, followed by flu-like symptoms and joint pains. After the B. burgdorferi has entered the bloodstream, it can infect and inflame many different types of tissues, eventually causing many diverse symptoms. Early treatment with antibiotics is the best strategy for preventing major problems due to Lyme disease. Further prevention of Lyme disease involves avoiding areas where ticks are common, wearing protective clothing and lotion, and immediately removing any ticks from the body."}, {"url": "http://medical-dictionary.thefreedictionary.com/Lyme+disease", "passage_text": "Lyme disease is an infection transmitted by the bite of ticks carrying the spiral-shaped bacterium Borrelia burgdorferi. The disease was named for Lyme, Connecticut, the town where it was first diagnosed in 1975 after a puzzling outbreak of arthritis. Late disseminated disease and chronic lyme disease. Weeks, months, or even years after an untreated tick bite, symptoms can appear in several forms, including: 1  Fatigue, forgetfulness, confusion, mood swings, irritability, numbness."}, {"url": "http://medical-dictionary.thefreedictionary.com/Lyme+disease", "passage_text": "Lyme disease, which is also called Lyme borreliosis, is a vector-borne disease. This term means that it is delivered from one host to another. It is also classified as a zoonosis, which means that it is a disease of animals that can be transmitted to humans under natural conditions. Late disseminated disease and chronic lyme disease. Weeks, months, or even years after an untreated tick bite, symptoms can appear in several forms, including: 1  Fatigue, forgetfulness, confusion, mood swings, irritability, numbness."}, {"url": "https://en.wikipedia.org/wiki/Lyme_disease", "passage_text": "Lyme disease is transmitted to humans by the bite of infected ticks of the Ixodes genus. Usually, the tick must be attached for 36 to 48 hours before the bacteria can spread. Lyme disease is caused by spirochetal bacteria from the genus Borrelia. Spirochetes are surrounded by peptidoglycan and flagella, along with an outer membrane similar to other Gram-negative bacteria."}]