[{"url": "http://www.webmd.com/vitamins-and-supplements/fenugreek", "passage_text": "Fenugreek is a plant that's used as a seasoning in the Middle East, Egypt, and India. As a supplement, fenugreek seeds are used as a treatment for diabetes and high cholesterol. They range from improving appetite to helping nursing women produce more breast milk. As a skin treatment, people use it for swelling, rashes, and wounds. There's no good evidence that these uses of fenugreek help. Because fenugreek is an unproven treatment, there's no established dose."}, {"url": "http://www.webmd.com/vitamins-supplements/ingredientmono-733-FENUGREEK.aspx?activeIngredientId=733&activeIngredientName=FENUGREEK", "passage_text": "In foods, fenugreek is included as an ingredient in spice blends. It is also used as a flavoring agent in imitation maple syrup, foods, beverages, and tobacco. In manufacturing, fenugreek extracts are used in soaps and cosmetics. 1 There are some reports that taking powdered fenugreek seed daily increases milk production in breastfeeding women, but evidence confirming this is limited. 2  In an early study, taking a specific tea containing fenugreek and other ingredients (Humana Still-Tee, Humana, Germany) increased milk volume."}, {"url": "http://foodfacts.mercola.com/fenugreek.html", "passage_text": "Fenugreek is also used as a remedy applied to the skin to treat infections and inflammation. Roasting and grinding of fenugreek seeds are advised before food use. Studies show it not only has the ability to lower blood sugar levels but fight cancer. Try grinding a few tablespoons into your next stir fry or soup. Health Benefits of Fenugreek. Fenugreek seeds are rich in minerals such as iron, potassium, calcium, selenium, copper, zinc, manganese and magnesium."}, {"url": "http://www.webmd.com/vitamins-supplements/ingredientmono-733-FENUGREEK.aspx?activeIngredientId=733&activeIngredientName=FENUGREEK", "passage_text": "Fenugreek is used for kidney ailments, a vitamin deficiency disease called beriberi, mouth ulcers, boils, bronchitis, infection of the tissues beneath the surface of the skin (cellulitis), tuberculosis, chronic coughs, chapped lips, baldness, cancer, and lowering blood sugar in people with diabetes. 1 There are some reports that taking powdered fenugreek seed daily increases milk production in breastfeeding women, but evidence confirming this is limited. 2  In an early study, taking a specific tea containing fenugreek and other ingredients (Humana Still-Tee, Humana, Germany) increased milk volume."}, {"url": "http://www.webmd.boots.com/healthy-eating/fenugreek", "passage_text": "Extract of fenugreek is used as a traditional herbal remedy to help lower cholesterol and triglyceride levels. It has also been used as a laxative and as an appetite stimulant. Fenugreek extract is used in cosmetic products and soaps, and it is also applied to the skin to help relieve inflammation. In some studies, fenugreek seed powder has been found to lower blood glucose and improve glucose tolerance. "}, {"url": "http://www.thehealthsite.com/diseases-conditions/15-health-benefits-of-methi/", "passage_text": "Read this in Hindi. Methi or fenugreek seeds and leaves form an important ingredient in Indian households. It is used in almost every Indian preparation be it dal, paratha or curry. But what you might not know is that methi or fenugreek is a rich reservoir of medicinal properties that imparts many health benefits. #14 Helps treat skin problems. Fenugreek or methi can be used in face packs to help prevent blackheads, pimples, wrinkles, etc. Washing your face with water boiled with fenugreek seeds or applying a paste of fresh fenugreek leaves for twenty minutes on your face can work wonders for your skin."}, {"url": "http://www.nutrition-and-you.com/fenugreek-seeds.html", "passage_text": "Medicinal uses of fenugreek seed. Its seeds have been used in many traditional medicines as a laxative, digestive, and as a remedy for cough and bronchitis. If used regularly, fenugreeks may help control cholesterol, triglyceride as well as high blood sugar (glycemic) levels in diabetics. "}, {"url": "http://www.webmd.com/vitamins-and-supplements/fenugreek", "passage_text": "People use fenugreek for other conditions. They range from improving appetite to helping nursing women produce more breast milk. As a skin treatment, people use it for swelling, rashes, and wounds. There's no good evidence that these uses of fenugreek help. Because fenugreek is an unproven treatment, there's no established dose. Some people take 10 to 15 grams (or more) of the seeds daily for diabete"}, {"url": "http://www.webmd.com/vitamins-supplements/ingredientmono-733-FENUGREEK.aspx?activeIngredientId=733&activeIngredientName=FENUGREEK", "passage_text": "Fenugreek is used for many conditions, but so far, there isn’t enough scientific evidence to determine whether or not it is effective for any of them. Fenugreek is used for digestive problems such as loss of appetite, upset stomach, constipation, and inflammation of the stomach (gastritis). 1 There are some reports that taking powdered fenugreek seed daily increases milk production in breastfeeding women, but evidence confirming this is limited. 2  In an early study, taking a specific tea containing fenugreek and other ingredients (Humana Still-Tee, Humana, Germany) increased milk volume."}, {"url": "http://www.homeremediesweb.com/fenugreek_health_benefits.php", "passage_text": "Fenugreek (also known as Greek Hay and Fenigreek), is an herb that is commonly found growing in the Mediterranean region of the world. While the seeds and leaves are primarily used as a culinary spice, it is also used to treat a variety of health problems in Egypt, Greece, Italy, and South Asia. Fenugreek seeds have been found to contain protein, vitamin C, niacin, potassium, and diosgenin (which is a compound that has properties similar to estrogen)."}]