[{"url": "http://gocaribbean.about.com/od/jamaica/ss/Map-Of-The-Caribbean-Island-Of-Jamaica.htm", "passage_text": "Jamaica Map. Map of the Caribbean Island of Jamaica. Photo Credit: CIA World Fact Book. The vast majority of Jamaica's resorts are located along the west coast and north shore of the island, including those in Negril, Montego Bay, and Ocho Rios. Google Map of Jamaica. 1 of 1"}, {"url": "https://en.wikipedia.org/wiki/Jamaica", "passage_text": "The island, 10,990 square kilometres (4,240 sq mi) in area, lies about 145 kilometres (90 mi) south of Cuba, and 191 kilometres (119 mi) west of Hispaniola, the island containing the nation-states of Haiti and the Dominican Republic. Jamaica is the fifth-largest island country in the Caribbean. With 2.8 million people, Jamaica is the third most populous Anglophone country in the Americas, after the United States and Canada, and the fourth most populous country in the Caribbean. Kingston is the country's capital and largest city, with a population of 937,700."}, {"url": "http://www.caribbeantravel.com/caribbean-islands/jamaica", "passage_text": "Visit Official Website Jamaica is one of the most popular islands in the Caribbean. With a total land area of 10,991 sq. km (4,244 sq. miles) the island stretches about 235 km (146 miles) east in Morant Point to west in Negril, and expands to 82 km (51 miles) at its widest point. ...A destination of diversity for the discerning traveler."}, {"url": "http://www.mapsofworld.com/jamaica/", "passage_text": "Situated in the Caribbean Sea, Jamaica is an island nation of the Greater Antilles, 145 mi in length, up to 50 mi in width and 4,243 sq mi in area. Jamaica is a Commonwealth realm with the Monarchy of Jamaica holding ultimate executive power, where Queen Elizabeth II is the current head of state and Queen of Jamaica. Jamaica is an island nation in the Caribbean Sea, and is part of the Greater Antilles. Jamaica is situated nearest to Cuba, and the island of Hispaniola, which contains Haiti and Dominican Republic, and the Cayman Islands. Geography :"}, {"url": "http://www.nationsonline.org/oneworld/map/google_map_jamaica.htm", "passage_text": "Deo. Satellite view is showing the island nation in the Caribbean Sea, situated 900 km south of Miami. Jamaica shares maritime borders with Cayman Islands (United Kingdom), Colombia, Cuba, and Haiti. Related Caribbean island nations are: Dominican Republic and Haiti on the island of Hispaniola, and Puerto Rico. The Jamaica's landscape is mountainous, with narrow coastal plains. The highest point is Blue Mountain Peak (2,256 m) in the Blue Mountains National Park in the east of the island."}, {"url": "http://www.mapsofworld.com/jamaica/jamaica-location-map.html", "passage_text": "Jamaica is an island nation of the Greater Antillies, located in the northwestern Caribbean Sea, about 145 kilometers (90 miles) south of Cuba and 191 kilometers (119 miles) west of the island of Hispaniola, where Haiti and the Dominican Republic are located. The major cities in Jamaica include the capital Kingston, Portmore, Spanish Town, Mandeville, Ocho Rios, Port Antonio, Negril, and Montego Bay. Jamaica is also home to the seventh largest natural harbor in the world, Kingston Harbour."}, {"url": "http://www.caribbeanislands.us/jamaica-map.htm", "passage_text": "The map of Jamaica on this page shows the country's islands and water features as well as their towns, roads, and airports. To zoom in on the Jamaica map, click or touch the plus (+) button; to zoom out, click or touch the minus (-) button. To display the Jamaica map in full-screen mode, click or touch the full screen button. (To exit the full-screen mode, click or touch the exit [ x ] button.) To scroll the zoomed-in map, swipe it or drag it in any direction. You may print this map of Jamaica for personal, non-commercial use only"}, {"url": "http://www.infoplease.com/country/jamaica.html", "passage_text": "Geography. Jamaica is an island in the West Indies, 90 mi (145 km) south of Cuba and 100 mi (161 km) west of Haiti. It is a little smaller than Connecticut. The island is made up of coastal lowlands, a limestone plateau, and the Blue Mountains, a group of volcanic hills, in the east"}]