[{"url": "https://answers.yahoo.com/question/index?qid=20090424021802AABJmFB", "passage_text": "Report Abuse. There are many countries in which the majority is Islamic. I think Saudi Arabia is the only one that reports 100% Muslim, though I'm sure there are some unaccounted-for individuals of other religions who are not planning on revealing themselves (according to my best friend who lives there). "}, {"url": "https://en.wikipedia.org/wiki/Muslim_world", "passage_text": "As of 2010, over 1.6 billion or about 23.4% of the world population are Muslims. By the percentage of the total population in a region considering themselves Muslim, 24.8% in Asia-Oceania do, 91.2% in the Middle East-North Africa, 29.6% in Sub-Saharan Africa, around 6.0% in Europe, and 0.6% in the Americas. Approximately 23% of the world's population is Muslim. Current estimates conclude that the number of Muslims in the world is around 1.6 billion. Muslims are the majority in 49 countries, they speak hundreds of languages and come from diverse ethnic backgrounds."}, {"url": "http://www.pewforum.org/2011/01/27/future-of-the-global-muslim-population-muslim-majority/", "passage_text": "As of 2010, there are 49 countries in which Muslims comprise more than 50% of the population. A total of 1.2 billion Muslims live in these nations, representing 74% of the global Muslim population of 1.6 billion. By 2030, Nigeria is projected to become the 50th Muslim-majority country. About 3% of the world’s Muslims live in non-Muslim-majority, more-developed countries in 2010."}, {"url": "http://religion.answers.wikia.com/wiki/How_many_muslim_countries_are_there", "passage_text": "Islamic states, and countries that have Islam as state religion. Islamic states are countries that have have adopted Islam as the ideological foundation for their political institution. There are eight countries in the world that are considered Islamic states. These are: 1  Afghanistan. 2  Pakistan. 3  Saudi Arabia. 4  Bahrain. 5  Iran. "}, {"url": "https://en.wikipedia.org/wiki/List_of_Muslim-majority_countries", "passage_text": "Muslims constitute the world's second largest religious group. According to a 2010 study and released January 2011, Islam has 1.57 billion adherents, making up over 23% of the world population. Most Muslims are of two denominations: Sunni (75–93.5%) or Shia (6.6–20%). Ahmadis represent about 1% of the Muslim population. Other parts of the world host large Muslim immigrant communities; in Western Europe, for instance, Islam is the second largest religion after Christianity, where it represents 6% of the total population. According to the Pew Research Center in 2010 there were 50 Muslim-majority countries. Around 62% of the world's Muslims live in South and Southeast Asia, with over 1 billion adherents. The largest Muslim population in a country is in Indonesia, a nation home to 12.7% of the world's Muslims, followed by Pakistan (11.0%), India (10.9%), and Bangladesh (9.2%). About 20% of Muslims live in Arab countries"}, {"url": "http://www.numberof.net/number-of-muslim-countries-in-the-world/", "passage_text": "50. Approximately 50 countries are Muslim-majority. Around 62% of the world’s Muslims live in Asia, with over 683 million adherents in such countries as Indonesia (the largest Muslim country by population, home to 15.6% of the world’s Muslims, Pakistan, India, and Bangladesh. About 20% of Muslims live in Arab countries. In the Middle East, the non-Arab countries of Turkey and Iran are the largest Muslim-majority countries; in Africa, Egypt and Nigeria have the most populous Muslim communities. This fact is verified on: December 9, 2009"}, {"url": "http://www.numberof.net/number-of-muslim-countries-in-the-world/", "passage_text": "Around 62% of the world’s Muslims live in Asia, with over 683 million adherents in such countries as Indonesia (the largest Muslim country by population, home to 15.6% of the world’s Muslims, Pakistan, India, and Bangladesh. About 20% of Muslims live in Arab countries. In the Middle East, the non-Arab countries of Turkey and Iran are the largest Muslim-majority countries; in Africa, Egypt and Nigeria have the most populous Muslim communities."}, {"url": "https://en.wikipedia.org/wiki/Muslim_world", "passage_text": "Islam is the world's second largest religion. According to a 2010 study and released January 2011, Islam has 1.57 billion adherents, making up over 23% of the world population. According to the Pew Research Center in 2015 there were 50 Muslim-majority countries. Approximately 23% of the world's population is Muslim. Current estimates conclude that the number of Muslims in the world is around 1.6 billion. Muslims are the majority in 49 countries, they speak hundreds of languages and come from diverse ethnic backgrounds."}, {"url": "http://www.pewforum.org/2011/01/27/future-of-the-global-muslim-population-muslim-majority/", "passage_text": "In that year, according to the projections in this report, a total of 1.7 billion Muslims are expected to live in Muslim-majority nations, representing 78% of the world’s 2.2 billion Muslims. About 3% of the world’s Muslims live in non-Muslim-majority, more-developed countries in 2010."}]