[{"url": "http://www.greenmedinfo.com/toxic-ingredient/calcium-carbonate", "passage_text": "The primary justification for ingesting Calcium Carbonate is to support bones, however, Lancet and the British Medical Journal, recently published the results of two extensive clinical trails which concluded that Calcium plus Vitamin D does nothing to prevent bone loss. Calcium carbonate has fallen out of favor as a phosphate-binder in chronic kidney disease due to its association with hypercalcemia and calcium toxicity."}, {"url": "http://www.greenmedinfo.com/toxic-ingredient/calcium-carbonate", "passage_text": "Growing evidence suggests that Calcium Carbonate, which is chalk or limestone, is not a biologically appropriate form of calcium for human metabolism. Calcium carbonate has fallen out of favor as a phosphate-binder in chronic kidney disease due to its association with hypercalcemia and calcium toxicity."}, {"url": "https://en.wikipedia.org/wiki/Calcium_carbonate", "passage_text": "Calcium carbonate will react with water that is saturated with carbon dioxide to form the soluble calcium bicarbonate. Calcium carbonate is a chemical compound with the formula Ca C O 3. It is formed by three main elements: carbon, oxygen and calcium. It is a common substance found in rocks in all parts of the world, and is the main component of shells of marine organisms, snails, coal balls, pearls, and eggshells"}, {"url": "http://www.answers.com/Q/Is_calcium_carbonate_harmful_to_breathe", "passage_text": "Calcium is essential to the body, but in higher recommended quantities can be harmful. Calcium is the most common mineral in the body. Bones and teeth have about 99% of the ca … lcium in the body. Without the proper secretion of calcitonin, hypercalcemia occurs; a harmful rise in blood calcium level. Hypercalcemia can lead to kidney stones because the urinary system retains calcium, additionally increasing blood calcium levels."}, {"url": "http://www.answers.com/Q/Is_calcium_carbonate_harmful", "passage_text": "Calcium is an essential body mineral, but excessive calcium can be harmful. About 99% of the body's calcium are stored in the bones. The rest is located in the blood and tis … sue fluids. Calcium is necessary for blood clotting, containing cells, and neuromuscular functions. Without the proper secretion of calcitonin, hypercalcemia occurs; a harmful rise in blood calcium level. Hypercalcemia can lead to kidney stones because the urinary system retains calcium, additionally increasing blood calcium levels."}, {"url": "https://en.wikipedia.org/wiki/Calcium_carbonate", "passage_text": "Calcium carbonate is the active ingredient in agricultural lime, and is created when calcium ions in hard water react with carbonate ions creating limescale. It is commonly used medicinally as a calcium supplement or as an antacid, but excessive consumption can be hazardous. Calcium carbonate is a chemical compound with the formula Ca C O 3. It is formed by three main elements: carbon, oxygen and calcium. It is a common substance found in rocks in all parts of the world, and is the main component of shells of marine organisms, snails, coal balls, pearls, and eggshell"}, {"url": "http://www.answers.com/Q/Is_calcium_carbonate_harmful", "passage_text": "Calcium carbonate is not harmful; of course, it is not recommended to inhale frequently fine powders. Without the proper secretion of calcitonin, hypercalcemia occurs; a harmful rise in blood calcium level. Hypercalcemia can lead to kidney stones because the urinary system retains calcium, additionally increasing blood calcium levels."}, {"url": "https://answers.yahoo.com/question/index?qid=20090519013646AA78X12", "passage_text": "Calcium carbonate isn't harmful at all (unless there's so much that it suffocates the organisms). Most marine life needs calcium carbonate to make shells and bones. Since sodium carbonate isn't so vital I suppose it qualifies as more harmful. (Don't confuse it with the rather harmless sodium hydrogen carbonate or sodium bicarbonate.) I think using washing soda (sodium carbonate) in the house is not a big environmental issue because it is harmless when dissolved. Neutralization of sodium carbonate with hydrochloric acid will produce sodium chloride."}, {"url": "http://www.answers.com/Q/Is_calcium_carbonate_harmful", "passage_text": "Calcium is essential to the body, but in higher recommended quantities can be harmful. Calcium is the most common mineral in the body. Bones and teeth have about 99% of the ca … lcium in the body. Without the proper secretion of calcitonin, hypercalcemia occurs; a harmful rise in blood calcium level. Hypercalcemia can lead to kidney stones because the urinary system retains calcium, additionally increasing blood calcium levels."}]