[{"url": "http://www.zillow.com/mortgage-learning/private-mortgage-insurance/", "passage_text": "Private mortgage insurance, also abbreviated as “PMI”, is a type of mortgage insurance used with conventional loans. Similar to other kinds of mortgage insurance, PMI protects the lender if you stop making payments on your home loan. PMI can be arranged by the lender and provided by private insurance companies. Typically on a conventional loan, if your down payment is less than 20 percent of the value of the home, lenders will require you to carry mortgage insurance."}, {"url": "http://www.inlanta.com/pmi-mip-whats-the-difference/", "passage_text": "What is Mortgage Insurance. Mortgage insurance is a payment required of home buyers who have limited down payments for home loans. Mortgage insurance is designed to offset the borrower default risk for lenders and guaranteeing agencies that loan large amounts of money to borrowers with very little “skin in the game”. "}, {"url": "http://themortgagereports.com/7570/fha-mip-cancel", "passage_text": "Upfront MIP does not affect your loan's loan-to-value (LTV) calculation. You can make a 3.5% downpayment on your purchase, add the UFMIP to your borrowed amount, and still meet the FHA's minimum downpayment guidelines. The 1.75% Upfront MIP is collected at closing and paid into the Mutual Mortgage Insurance fund. The second type of Federal Housing Administration mortgage insurance is the FHA's annual Mortgage Insurance Premium (MIP). Annual MIP is paid in 12 installments per year, and is included in your monthly mortgage payment."}, {"url": "http://www.quickenloans.com/blog/pmi-mip-understanding-mortgage-insurance", "passage_text": "For loans originated as of October 4, 2010, if your FHA term is more than 15 years, your monthly mortgage insurance payments will be cancelled when the LTV reaches 78%. This is calculated based on the original value of your FHA home loan and only if you paid the annual MIP amounts for at least five years. If the term of your FHA loan is 15 years or less, with an LTV of 90% or greater, the monthly mortgage insurance payments will stop when the LTV reaches 78%."}, {"url": "http://www.wikihow.com/Calculate-Mortgage-Insurance-%28PMI%29", "passage_text": "Mortgage insurance (private mortgage insurance--PMI for short), is insurance that protects a lender in the event that a borrower defaults on a home loan. Mortgage insurance is usually required when the down payment on a home is less than 20 percent of the loan amount. Monthly mortgage insurance payments are usually added into the buyer's monthly payments."}, {"url": "http://www.trulia.com/voices/Home_Buying/What_is_the_difference_between_PMI_and_MIP_-405031", "passage_text": "MIP is the FHA mortgage insurance premium. It is paid in two charges: an upfront premium, which is now 1.75% on a high ratio loan (96.5%), and usually financed, AND an annual premium of 1.25% of the loan amount, paid in monthly installments with your PITI payment. PMI is private mortgage insurance, and insures the lender against loan failure on a conventional loan. This charge can be paid in several ways: monthly, one time financed premium, one time cash premium, or a split of the two. The amount depends on the down payment, loan term, and credit score of the buyer"}, {"url": "http://themortgagereports.com/7570/fha-mip-cancel", "passage_text": "FHA Upfront Mortgage Insurance Premiums. The FHA's current upfront mortgage insurance premium (UFMIP) is 1.75 percent of your loan size. For example, if you use an FHA-backed mortgage for a purchase mortgage and your loan size is $300,000, then your Upfront MIP will be 1.75 percent of $300,000, or $5,250. Upfront MIP is not paid as cash. The second type of Federal Housing Administration mortgage insurance is the FHA's annual Mortgage Insurance Premium (MIP). Annual MIP is paid in 12 installments per year, and is included in your monthly mortgage payment."}, {"url": "https://en.wikipedia.org/wiki/Mortgage_insurance", "passage_text": "For information on insurance guaranteeing payment of the mortgage in the event of death or disability, see mortgage life insurance. Mortgage Insurance (also known as mortgage guarantee and home-loan insurance) is an insurance policy which compensates lenders or investors for losses due to the default of a mortgage loan. Mortgage insurance can be either public or private depending upon the insurer. "}]