[{"url": "https://answers.yahoo.com/question/index?qid=20090122184102AAxPM7R", "passage_text": "Report Abuse. You can soak them in either jewelry cleanser or alcohol for certain types of silver. If you don't want to soak it Silpotta has some very nice and well working cloths that wipe dirt off of real silver or gold jewelry. Good luck!"}, {"url": "http://www.overstock.com/guides/how-to-clean-earrings", "passage_text": "Soak earrings made of metals, diamonds and non-absorbent gemstones -- such as rubies, sapphires, emeralds, amethysts, citrines -- in the cleaning solution for 10 to 15 minutes. Soak the backings from post earrings, too. Use the toothbrush to scrub the earrings if you think the soaking wasn't sufficient. Concentrate on the clasps and posts, but be gentle to avoid scratching the metal. Dip the earrings in the bowl of clear water to rinse off the cleaning solution. . 1  Dry the jewelry. After rinsing the earrings, rub them with a cloth to remove water drops and lay them on a towel to dry. You can hang earrings with hooks on a jewelry tree. After the pieces dry, lightly buff the metal with a soft cloth to remove any remaining water spots. Shop Earrings."}, {"url": "http://www.stepbystep.com/how-to-clean-earrings-rubbing-alcohol-32341/", "passage_text": "Take a small bowl and fill it with rubbing alcohol. Put the earrings in the bowl and allow them to soak for at least one hour. It will kill any germs and bacteria present in the earrings. Image courtesy: cotton buddesign.blogspot.com. 1  Now, take a nail brush or an old tooth brush and dip it in the rubbing alcohol. 2  Use the brush to rub the earrings gently. 1 Take a small bowl and fill it with rubbing alcohol. 2  Put the earrings in the bowl and allow them to soak for at least one hour. 3  It will kill any germs and bacteria present in the earrings. 4 "}, {"url": "http://www.sheknows.com/home-and-gardening/articles/966949/how-to-clean-jewelry-at-home", "passage_text": "Ammonia. Diamonds are a girl's best friend, but not when they're dirty! Soak diamond jewelry in a solution of 1 cup warm water and 1/4 cup ammonia for about 15 minutes, then use a soft-bristled toothbrush to scrub away any remaining grime, especially in the crevices of the setting and underneath the diamond."}, {"url": "http://www.answers.com/Q/How_long_do_you_disinfect_earrings", "passage_text": "Soaking the jewellery in 70% Isoproply alcohol for 30 minutes will disinfect them quite well, you can also do a two stage disinfection, soak the earrings in Hydrogen Peroxide for 5 minutes, rinse them off and then into 70% ispoproyl alcohol for 25 minutes. "}, {"url": "http://www.stepbystep.com/how-to-clean-earrings-rubbing-alcohol-32341/", "passage_text": "1 Rinse the earrings well using clean water. 2  Make sure you clear the alcohol from the surface of the earrings. 3  Then place them on a dry towel and allow them to dry. 4  You can also pat the earrings on the towel, which will make it quick for the earrings to get dry. 5  Your earrings are now clean and can be worn again. 1 Take a small bowl and fill it with rubbing alcohol. 2  Put the earrings in the bowl and allow them to soak for at least one hour. 3  It will kill any germs and bacteria present in the earrings. 4  Image courtesy: cotton buddesign.blogspot.com."}, {"url": "http://www.jewelrynotes.com/clean-care-earrings/", "passage_text": "Most of us are familiar with the general cleaning method for earrings: 1. Place your earrings into a small plastic container and fill it halfway with peroxide. 2. Let the earrings soak in the peroxide for ten to twenty minutes. Soak them overnight if they are especially dirty. 3. Take the earrings out of the container and use a small jewelry brush or toothpicks to scour away any remaining dirt and debris. 4. Set the cleaned earrings on a paper towel and let them air dry completely before wearing or storing them. 1. Fill a medium-sized bowl with a cup of warm water. Pour 1/4 cup of ammonia into the water. Put the diamond earrings into the solution and let them sit for about twenty minutes. 2. Make sure to put on rubber gloves before removing the earrings from the ammonia solution."}, {"url": "http://www.livestrong.com/article/197611-how-to-sterilize-earrings/", "passage_text": "1 It's important to keep your piercing holes clean. 2  Every day, wipe piercings gently with a cotton pad dipped in hydrogen peroxide or rubbing alcohol. 3  If you can't remove the earrings, rotate them gently so the pierced holes keep their shape. Tips. 1 "}, {"url": "http://www.wikihow.com/Clean-Diamond-Earrings", "passage_text": "1. Use dish soap. If you don’t have a jewelry cleaning kit, you can make your own solutions with many different home cleaning products. You can use regular dish soap to clean the dirt and oils off diamond earrings. 1  Mix together 1 cup of lukewarm water with 1 teaspoon of mild dish soap. 2  Stir the water with your fingers until you see bubbles. 3  Make sure the dish soap doesn’t have perfume or dye in it or it could damage the earrings. 1 Let the earrings soak another 1-2 minutes. 2  Then remove the earrings, and place them on a paper towel. 3  Take a bowl of clear water and rinse the earrings off. 4  Don’t rinse them under a faucet or you might lose them down the drain."}]