[{"url": "http://healthyeating.sfgate.com/much-beta-carotene-bad-you-11397.html", "passage_text": "Beta carotene from supplements is more concentrated and can be problematic. If you eat a diet high in naturally occurring beta carotene from yellow vegetables such as carrots, sweet potatoes and winter squash or from green vegetables such as broccoli and chard, you might experience an odd result. The Artificial Tan"}, {"url": "http://www.vitaminstuff.com/betacarotene.html", "passage_text": "Beta carotene When it comes to nutritional supplementation, and antioxidants in particular, beta carotene is an antiaging micronutrient of the highest order, standing firmly alongside Vitamin C, Vitamin E, and the mineral Selenium in its ability to reduce illness, improve overall health, and increase longevity. Foods such as carrots, tomatoes, sweet potatoes, cantaloupe, watermelon, apricots, and mangoes are good sources of beta-carotene; romaine lettuce, spinach, kale, and broccoli are also rich in carotenoids (the yellow color is covered up by chlorophyll in green leafy plants)."}, {"url": "http://umm.edu/health/medical/altmed/supplement/betacarotene", "passage_text": "Beta-carotene is a pigment found in plants that gives them their color. The name beta-carotene is derived from the Latin name for carrot. It gives yellow and orange fruits and vegetables their rich hues. Beta-carotene is also used to color foods such as margarine. In the body, beta-carotene converts into vitamin A (retinol). We need vitamin A for good vision and eye health, for a strong immune system, and for healthy skin and mucous membranes. Taking big doses of vitamin A can be toxic, but your body only converts as much vitamin A from beta-carotene as it need"}, {"url": "http://www.vitaminstuff.com/betacarotene.html", "passage_text": "Foods or supplements containing beta-carotene are converted to vitamin A for the maintenance of healthy skin, good vision, and a robust immune system. Beta-carotene is also a powerful antioxidant, and has been shown to help guard against cancer and heart disease. Foods such as carrots, tomatoes, sweet potatoes, cantaloupe, watermelon, apricots, and mangoes are good sources of beta-carotene; romaine lettuce, spinach, kale, and broccoli are also rich in carotenoids (the yellow color is covered up by chlorophyll in green leafy plants)."}, {"url": "http://www.webmd.com/vitamins-supplements/ingredientmono-999-BETA-CAROTENE.aspx?activeIngredientId=999&activeIngredientName=BETA-CAROTENE", "passage_text": "Beta-carotene is one of a group of red, orange, and yellow pigments called carotenoids. Beta-carotene and other carotenoids provide approximately 50% of the vitamin A needed in the American diet. Beta-carotene can be found in fruits, vegetables, and whole grains. It can also be made in a laboratory. "}, {"url": "http://www.medicalnewstoday.com/articles/252758.php", "passage_text": "Beta-carotene in itself is not an essential nutrient, but vitamin A is. Vitamin A can be sourced from the food we eat, through beta-carotene, for example, or in supplement form. The advantage of dietary beta-carotene is that the body only converts as much as it needs. Excess vitamin A is toxic. The human body converts beta-carotene into vitamin A (retinol) - beta-carotene is a precursor of vitamin A. We need vitamin A for healthy skin and mucus membranes, our immune system, and good eye health and vision."}, {"url": "http://umm.edu/health/medical/altmed/supplement/betacarotene", "passage_text": "Foods rich in beta-carotene include those that are orange or yellow, such as peppers, squashes, and carrots. However, a few studies have found that people who take beta-carotene supplements may have a higher risk for conditions such as cancer and heart disease. Beta-carotene is also used to color foods such as margarine. In the body, beta-carotene converts into vitamin A (retinol). We need vitamin A for good vision and eye health, for a strong immune system, and for healthy skin and mucous membranes."}, {"url": "http://www.livestrong.com/article/469656-what-is-beta-carotene-good-for/", "passage_text": "Vitamin A. The body converts beta-carotene and other carotenoids to vitamin A, an essential nutrient. Vitamin A plays an essential role in cell division, reproduction, bone growth, vision, skin health and immune system regulation. Sufficient vitamin A helps the body fight infections. Photo Credit Hemera Technologies/AbleStock.com/Getty Images. Beta-carotene, a fat-soluble, pigmented compound, is one of several types of carotenoids in fruits, vegetables and whole grains. Foods that contain beta-carotene include carrots, sweet potatoes, squash, peppers, apricots, spinach and green, leafy vegetables."}, {"url": "http://www.medicalnewstoday.com/articles/252758.php", "passage_text": "Toxic vitamin A levels can occur if you consume too many supplements. Beta-carotene, like all carotenoids, is an antioxidant. An antioxidant is a substance that inhibits the oxidation of other molecules; it protects the body from free radicals. Free radicals damage cells through oxidation. Eventually, the damage caused by free radicals can cause several chronic illnesses. The human body converts beta-carotene into vitamin A (retinol) - beta-carotene is a precursor of vitamin A. We need vitamin A for healthy skin and mucus membranes, our immune system, and good eye health and vision."}]