[{"url": "http://csep10.phys.utk.edu/astr162/lect/sun/corona.html", "passage_text": "The extended outer atmosphere of the Sun is called the corona. It has a temperature of millions of degrees, but it is 10 billion times less dense than the atmosphere of the Earth at sea level."}, {"url": "https://en.wikipedia.org/wiki/Corona_(planetary_geology)", "passage_text": "In planetary geology, a corona (plural: coronae) is an oval-shaped feature. Coronae appear on both the planet Venus and Uranus 's moon Miranda and may be formed by upwellings of warm material below the surface."}, {"url": "http://solarscience.msfc.nasa.gov/corona.shtml", "passage_text": "Click on image for larger version. The Corona is the Sun's outer atmosphere. It is visible during total eclipses of the Sun as a pearly white crown surrounding the Sun. The corona displays a variety of features including streamers, plumes, and loops."}, {"url": "http://www.geology.sdsu.edu/how_volcanoes_work/venus.html", "passage_text": "Although it is thought that both coronae and arachnoids form in association with rising plumes of mantle, the magmatism associated with arachnoids may be largely intrusive, whereas magmatism associated with coronae is largely extrusive. There have been 265 arachnoids thus far identified on Venus."}, {"url": "http://www.geology.sdsu.edu/how_volcanoes_work/venus.html", "passage_text": "Arachnoids are smaller than most coronae, but have a similar genesis. They features differ from coronae in that they contain a network of both radial and concentric structures that gives the appearance of a spider sitting on interconnected webs of bright lines, hence the name arachnoid, which is Greek for spider."}, {"url": "http://www.windows2universe.org/venus/interior/V_coronae.html", "passage_text": "Venus Coronae. The feature of Venus' geography called a Corona is a deep, curving, trench surrounding an elevated plain. Coronae is the plural term for corona. This is an image of Artemis Corona which is found on Aphrodite Terra, and is the largest of the coronae. This coronae shows a nearly circular trench, called Artemis Chasma, which has a diameter of over 1250 mi."}]