[{"url": "http://www.max-the-schnauzer.com/how-long-do-schnauzers-live.html", "passage_text": "Bella is right, miniature schnauzers may live until their teens. According to the Kennel club, the average lifespan for a Miniature Schnauzer is 10 to 15 years of age. Generally the larger the dog, the shorter the lofespan, so Standard and giant Schnauzers would typically live slightly less long. We have two mini schnauzer's one is 15 and the other one is 13. Our 15 year old sleeps a lot and looks disoriented at times and I believe she is deaf and partially blind. Our 13 year old has started slowing down a lot and I believe she had a heat stroke and since then has really moved very slow."}, {"url": "http://www.dogster.com/dog-breeds/Miniature_Schnauzer", "passage_text": "These dogs, to look their best, will need regular professional grooming. A healthy Miniature Schnauzer can live as long as 15 years, aging gracefully. Relatively healthy, they can sometimes develop eye problems, kidney stones and diabetes. The Look of a Miniature Schnauzer. Miniature Schnauzers have an overall alert, robust stance—much like their cousins, Standard Schnauzers. They have small, square frames with long heads bearing bushy moustaches, beards and eyebrows. They have oval-shaped eyes, strong muzzles and V-shaped ears that bend forward."}, {"url": "https://answers.yahoo.com/question/index?qid=20100711160532AAoQEHk", "passage_text": "Rating Newest Oldest. Best Answer: I've been a breeder of Miniature Schnauzers for 20 years and they should easily live to at least 15 or 16. You should definitely take your dog to the vet, as what you are posting is not a normal way for a MS to act. Source(s): Breeder, Trainer. Marianne · 5 years ago. "}, {"url": "http://www.answers.com/Q/How_long_does_the_Miniature_Schnauzer_live", "passage_text": "Schnauzers have a life span of about 12-16 years. But Miniature Schnauzers can live to about 22 years of age if they are kept happy and healthy. Average lifespan for mini schnauzers is 12-15 years. My neighbor's and mine both passed this month, one from diabetes, the other from cancer. They were 11 and 12 years old. A miniature schnauzer is like a standard schnauzer, but smaller. They tend to have less grooming issues since they are smaller. They don't stand but about 12-16 inches tall an … d weigh between 10-20 pounds."}, {"url": "http://www.answers.com/Q/How_long_do_miniature_schnauzers_live", "passage_text": "Schnauzers have a life span of about 12-16 years. But Miniature  Schnauzers can live to about 22 years of age if they are kept happy  and healthy.   Average lifespan for … mini schnauzers is 12-15 years.    My neighbor's and mine both passed this month, one from diabetes,  the other from cancer. They were 11 and 12 years old. 51 people found this useful. A miniature schnauzer is like a standard schnauzer, but smaller. They tend to have less grooming issues since they are smaller. They don't stand but about 12-16 inches tall an … d weigh between 10-20 pounds. They don't shed, and love to be cuddled."}, {"url": "http://dogsmonthly.co.uk/breed-features/miniature-schnauzer-smart-sassy/", "passage_text": "Other than this, Miniature Schnauzers remain healthy and active all of their lives, although naturally they begin to slow down a bit as they reach old age. As to longevity, they can live for up to 15 years and are one of the longer-lived dog breeds, which again makes them ideal as family pets. "}, {"url": "http://www.myschnauzer.net/forums/index.php?topic=6611.0", "passage_text": "Conservatively schnauzers can live up to 15 years, but I can't tell you how many people I've talked to that have had schnauzers that have lived 18-20 years. It just depends on the health of the dog really. "}, {"url": "https://en.wikipedia.org/wiki/Miniature_Schnauzer", "passage_text": "The Miniature Schnauzer is a breed of small dog of the Schnauzer type that originated in Germany in the mid-to-late 19th century. Miniature Schnauzers have a very square-shaped build, measuring 13 to 14 inches (33 to 36 cm) tall and weighing 10 to 15 pounds (4.5 to 6.8 kg) for females and 11 to 18 pounds (5.0 to 8.2 kg) for males. They have a double coat, with wiry exterior fur and a soft undercoat."}]