[{"url": "http://www.phila.gov/Revenue/Tax%20Returns/2012birtnpt_instructions.pdf", "passage_text": "A single Change Form can be used for all tax types. 2012 Business Income & Receipts and Net Profits Taxes General Information Tax regulations and forms are available at www.phila.gov/revenue. When and Where to File-The 2012 Business Income and Receipts and Net Profits taxes are due by April 15, 2013. Areturn must be filed even if an overall loss is incurred. Failure to file a return by the due date could result in the impositionof fines, legal costs and non-filer penalties."}, {"url": "http://www.ird.govt.nz/business-income-tax/filing-returns/bit-typereturn.html", "passage_text": "Types of business income tax returns. If you're in business, you'll need to complete and send us an income tax return, and attach either a copy of your financial records, or a form that summarises your income and expenses. 1  Which business income tax returns you should use. 2  Companies who need to file an IR4 return. 3  Companies who don't need to file an IR4 return"}, {"url": "http://www.taxes.ca.gov/Income_Tax/incbus.shtml", "passage_text": "The income of an S corporation is generally not subject to federal income tax. Its shareholders include on their tax returns their share of the corporation's separately stated items of income, deduction, loss, credit, and their share of non-separately stated income or loss. Below, we've provided brief definitions for different kinds of business. Each definition has a link that discusses filing requirements, business tips and publications to help you with income tax preparation. 1  Sole Proprietorship. 2  General Partnerships and Limited Partnerships."}, {"url": "https://turbotax.intuit.com/tax-tools/tax-tips/Small-Business-Taxes/How-to-File-Federal-Income-Taxes-for-Small-Businesses/INF14836.html", "passage_text": "However, if you use a Form 1120, you calculate your taxable business income in the same way, but the form requires more details that may not always apply to a small business. The biggest disadvantage of filing a Form 1120 is that it is separate from your personal income tax return. It is generally subject to the same April 15 deadline. If you need to file a Form 1120, you must file it by the 15th day of the third month following the close of the tax year, which for most taxpayers is March 15. You cannot send this form to the IRS with your personal income tax return."}, {"url": "https://www.irs.gov/taxtopics/tc407.html", "passage_text": "A business must include in income payments received in the form of property or services at the fair market value of the property or services. A business may be organized as a sole proprietorship, partnership or corporation. A sole proprietorship is an unincorporated business owned by an individual. Business income may include income received from the sale of products or services. For example, fees received by a person from the regular practice of a profession are business income. Rents received by a person in the real estate business"}, {"url": "http://www.bizymoms.com/taxes/irs-income-tax-forms.html", "passage_text": "This article is aimed at simplifying each of the tax forms that maybe applicable to you. The Form 1040 is one of the most common forms you will come across when filing your tax returns. The Form 1040, U.S. Individual Income Tax Return is the starting form for personal Federal income tax returns filed with the IRS. The Form 1040 is made up of two full pages (exclusive of attachments). The first page would carry information such as taxpayer details, dependents, adjustments to income and income items. Under the 1040 series there are many forms such as 1040A, 1040EZ, 1040EZ-T, 1040X etc. Each form is to facilitate specific taxpayer type. For example, a tax payer with a taxable income of less than 100,000 USD would fill a form 1040 A who chooses the standard deduction instead of the itemized deduction."}, {"url": "https://www.irs.gov/taxtopics/tc407.html", "passage_text": "It also includes certain businesses that elect to be taxed as a corporation by filing Form 8832 (PDF), Entity Classification Election. Corporations report their income and expenses, and calculate their tax on Form 1120 (PDF), U.S. Corporation Income Tax Return. Business income may include income received from the sale of products or services. For example, fees received by a person from the regular practice of a profession are business income. Rents received by a person in the real estate business"}]