[{"url": "http://www.roanestate.edu/OWL/UsingSources_MLA.html", "passage_text": "In-Text Citation: Use an in-text citation in situations where you are not quoting someone directly, but rather using information from another source such as a fact, summary, or paraphrase to support your own ideas."}, {"url": "http://www.roanestate.edu/OWL/UsingSources_MLA.html", "passage_text": "In-text Citations. You CANNOT use information from any website or published book unless you give the author (or site) credit--BOTH inside your text and at the end of your paper. In other words, it is NOT enough to simply list the sources you used on a Works Cited Page or References List."}, {"url": "http://owl.english.purdue.edu/owl/resource/560/01/", "passage_text": "Please use the example at the bottom of this page to cite the Purdue OWL in APA. To see a side-by-side comparison of the three most widely used citation styles, including a chart of all APA citation guidelines, see the Citation Style Chart. You can also watch our APA vidcast series on the Purdue OWL YouTube Channel."}, {"url": "http://www.citationmachine.net/", "passage_text": "Citation Machine automatically generates citations in MLA, APA, Chicago, Turabian, and Harvard."}, {"url": "http://owl.english.purdue.edu/owl/resource/560/01/", "passage_text": "This resource, revised according to the 6 th edition, second printing of the APA manual, offers examples for the general format of APA research papers, in-text citations, endnotes/footnotes, and the reference page."}, {"url": "http://www.metrolyrics.com/youve-got-a-friend-in-me-lyrics-randy-newman.html", "passage_text": "Submit Corrections Cancel. You've got a friend in me. You've got a friend in me. When the road looks rough ahead. And you're miles and miles. From your nice warm bed. You just remember what your old pal said. Boy, you've got a friend in me. Yeah, you've got a friend in me"}, {"url": "http://libguides.dixie.edu/c.php?g=57887&p=371728", "passage_text": "Work has three authors. If a work has three authors, format their names and the page reference as follows or use the names in a signal phrase. Examples: Globalization is an inevitable process."}, {"url": "http://www.roanestate.edu/OWL/UsingSources_MLA.html", "passage_text": "You can give credit to your sources within your text in two different ways: by using a signal phrase or by simply using an in-text citation. Signal phrase: a signal phrase lets the reader know, right at the beginning of the sentence, that the information he or she is about to read comes from another source."}]