[{"url": "http://www.cellsalive.com/cells/bactcell.htm", "passage_text": "Flagella: The purpose of flagella (sing., flagellum) is motility. Flagella are long appendages which rotate by means of a motor in the cell envelope. Bacteria may have one, a few, or many flagella in different positions on the cell."}, {"url": "http://biology.tutorvista.com/cell/bacterial-cell.html", "passage_text": "1 Cell walls of bacteria are made up of glycoprotein murein. 2  The main function of cell wall is it helps in providing support, mechanical strength and rigidity to cell. 3  It protects cell from bursting in a hypotonic medium. 4  It is also known as cytoplasmic membrane (or) cell membrane."}, {"url": "http://www.answers.com/Q/What_is_the_general_structure_of_a_virus", "passage_text": "Typically the protein coat, or capsid, of an individual virus particle, or virion, is composed of multiple copies of one or several types of protein subunits, or capsomeres. Some viruses contain enzymes, and some have an outer membranous envelope."}, {"url": "http://lecturer.ukdw.ac.id/dhira/BacterialStructure/Introduction.html", "passage_text": "The general bacteria. Figure 1 - A cartoon of the general bacteria. In this part of the course, we will be examining a general bacteria. Realize that no one bacteria contains all these structures and that this survey is not exhaustive."}, {"url": "http://lecturer.ukdw.ac.id/dhira/BacterialStructure/Introduction.html", "passage_text": "Universal structures in bacteria. There are some universal structures that all bacteria have. The basic building blocks of life, DNA, RNA, and protein, are common to all organisms not just microbes. Also, all microbes have a cell membrane."}, {"url": "http://www.microbiologyonline.org.uk/about-microbiology/introducing-microbes/bacteria", "passage_text": "The cell structure is simpler than that of other organisms as there is no nucleus or membrane bound organelles. Instead their control centre containing the genetic information is contained in a single loop of DNA. Some bacteria have an extra circle of genetic material called a plasmid."}, {"url": "http://micro.magnet.fsu.edu/cells/bacteriacell.html", "passage_text": "When exposed to a gram stain, gram-positive bacteria retain the purple color of the stain because the structure of their cell walls traps the dye. In gram-negative bacteria, the cell wall is thin and releases the dye readily when washed with an alcohol or acetone solution. Cytoplasm-The cytoplasm, or protoplasm, of bacterial cells is where the functions for cell growth, metabolism, and replication are carried out."}, {"url": "http://www.answers.com/Q/What_is_the_basic_structure_of_bacteria", "passage_text": "The basic structure of a bacteria is a very small organism with a cell membrane, cytoplasm and DNA."}, {"url": "http://micro.magnet.fsu.edu/cells/bacteriacell.html", "passage_text": "Cell wall composition varies widely amongst bacteria and is one of the most important factors in bacterial species analysis and differentiation. For example, a relatively thick, meshlike structure that makes it possible to distinguish two basic types of bacteria."}]