[{"url": "http://www.nolo.com/legal-encyclopedia/when-californias-medi-cal-will-pay-nursing-home-assisted-living-home-health-care.html", "passage_text": "If you do not already qualify for Medi-Cal, you might be eligible if you have little income. Thanks to the Affordable Care Act (ACA), the income limit for Medi-Cal now works out to 138% of the Federal Poverty Level (FPL). That is about $16,100 for an individual and $32,900 for a family of four. For California residents needing long-term care services, Medi-Cal is the most common source of funding. Medi-Cal pays for the nursing home expenses of approximately 65% of the residents in California nursing homes. Medi-Cal is California’s state Medicaid program."}, {"url": "http://www.coveredca.com/medi-cal/", "passage_text": "Medi-Cal is health coverage, just like the coverage from Covered California health plans. If you qualify for Medi-Cal, your health care will be free or at a lower cost to you and your family. Medi-Cal plans and Covered California plans both offer a similar set of important benefits, called “essential health benefits.. You can apply online at CoveredCA.com. A single application will let you know if you qualify for Covered California or Medi-Cal coverage. You can also apply in person at your local county human services agency or over the phone by calling (800) 300-1506."}, {"url": "http://www.nolo.com/legal-encyclopedia/when-californias-medi-cal-will-pay-nursing-home-assisted-living-home-health-care.html", "passage_text": "Medi-Cal will look back 60 months from the date that you apply for Medicaid-paid long-term care and examine any asset transfers to see if they were legitimate. If you give property away for less than it is worth, then Medi-Cal will impose a waiting period before you can start getting your benefits. For California residents needing long-term care services, Medi-Cal is the most common source of funding. Medi-Cal pays for the nursing home expenses of approximately 65% of the residents in California nursing homes. Medi-Cal is California’s state Medicaid program."}, {"url": "http://www.wikihow.com/Apply-for-Medi-Cal", "passage_text": "How to Apply for Medi Cal. Most states do not have their own Medicaid program but California does and has since 1966. It's called Medi-Cal. More than 8 million people, or about 21% of the entire population of the state of California, receive free or discounted insurance for themselves and their families. Understand the eligibility requirements. Not all California citizens are eligible to apply for Medi-Cal and receive benefits. 1  If you receive SSI/SSP payments, your Social Security administration office will automatically set up Medi-Cal for you. 2  You don't need to separately apply for Medi-Cal."}, {"url": "http://www.wikihow.com/Apply-for-Medi-Cal", "passage_text": "Even though it can seem difficult to get approved for Medi-Cal, it is relatively simple to apply for it and have an eligibility worker see if you are eligible or not. Understand the eligibility requirements. Not all California citizens are eligible to apply for Medi-Cal and receive benefits. 1  If you receive SSI/SSP payments, your Social Security administration office will automatically set up Medi-Cal for you. 2  You don't need to separately apply for Medi-Cal."}, {"url": "http://dhs.lacounty.gov/wps/portal/dhs/coverageoptions/medical/", "passage_text": "Medi-Cal and Medi-Cal Managed Care. Medi-Cal is a California health care program for many people with low incomes. Medi-Cal has been expanded to adults 19-64 without children and incomes at or below 138% of the federal poverty level (FPL). If you were eligible for Medi-Cal starting January 1, 2015, you will be required to choose a Medi-Cal Health Plan. In Medi-Cal Health Plans, your Plan will help you find doctors, pharmacies, and other providers in the Plan’s network. The government pays the Plan a fee each month to provide your care."}, {"url": "http://ssa.ocgov.com/health/faq", "passage_text": "Cal-Optima is the managed care program that administers Medi-Cal benefits in Orange County. Once your Medi-Cal application is approved, you will receive enrollment information from Cal-Optima and at that time you will be able to choose a health care provider. Any bill received 3 months prior to your application for Medi-Cal may be covered by requesting Retroactive Medi-Cal Coverage. In addition, certain unpaid, old medical bills can be used to reduce your Medi-Cal share of cost (SOC)."}, {"url": "http://www.dhcs.ca.gov/services/medi-cal/eligibility/pages/InfoPendingMedi-calApps.aspx", "passage_text": "Due to the large number of Medi-Cal applications received through the Covered California website and county human services agencies, the Department of Health Care Services (DHCS) is providing this information to help ensure you can get the care you need. For those who have been found eligible for Medi-Cal and have a Medi-Cal Benefits Identification Card (BIC), but have yet to select a managed care health plan, there are options below to help you find care."}, {"url": "http://www.coveredca.com/medi-cal/", "passage_text": "If you qualify for Medi-Cal, you will get a benefits identification card (BIC) in the mail, and you can start using it to get your health care as a new Medi-Cal member. In some cases, after you apply, we may need more information from you to make sure you qualify for Medi-Cal. You can apply online at CoveredCA.com. A single application will let you know if you qualify for Covered California or Medi-Cal coverage. You can also apply in person at your local county human services agency or over the phone by calling (800) 300-1506."}]