[{"url": "http://whs.rocklinusd.org/documents/Science/Lethal_Dose_Table.pdf", "passage_text": "Lethal Dose Table Lethal dose (LD 50) is the amount of an ingested substance that kills 50 percent of a test sample. It is expressed in mg/kg, or milligrams of substance per kilogram of body weight."}, {"url": "http://www.atsdr.cdc.gov/csem/csem.asp?csem=1&po=12", "passage_text": "In acute arsenic poisoning, death is usually due to cardiovascular collapse and hypovolemic shock. The fatal human dose for ingested arsenic trioxide is 70 to 180 milligrams (mg) or about 600 micrograms per kilograms (kg)/day [ATSDR 2007]."}, {"url": "http://chemsee.com/poison-detection/poison-detection-resources/chemnote-arsenic-poisoning/", "passage_text": "Arsenic Trioxide is very toxic, the LD 50 is 14.6 mg/Kg, (Rats). Exposure to small doses of Arsenic Trioxide over a long time can cause cancer, although small amounts are REQUIRED by the body for proper functioning."}, {"url": "http://www.madsci.org/posts/archives/2001-04/987176844.Me.r.html", "passage_text": "For a bodyweight around 70 kg (155 lb.), the lethal dose of arsenic would be closer to a gram than 100 mg. Current Queue | Current Queue for Medicine | Medicine archives Try the links in the MadSci Library for more information on Medicine."}, {"url": "http://www.answers.com/Q/What_is_lethal_dose_of_arsenic", "passage_text": "Orally, KCl is toxic in excess; the LD50 is around 2500 mg/kg (meaning that a lethal dose for 50% of people weighing 75 kg (165 lb) is about 190 g (6.7 ounces), or about … 38 teaspoons). Table salt is about as toxic."}, {"url": "http://chemsee.com/poison-detection/poison-detection-resources/chemnote-arsenic-poisoning/", "passage_text": "Sources of Exposure to Arsenic During Occupation. The utilization of arsenic compounds in industrial and commercial products is being slowly phased out, to a great extent due to the high toxicity of Arsenic and its compounds and the evidence that certain exposure can cause cancer."}, {"url": "http://www.lenntech.com/periodic/water/arsenic/arsenic-and-water.htm", "passage_text": "Acute toxicity is generally higher for inorganic arsenic compounds than for organic arsenic compounds. Oral intake of more than 100 mg is lethal. The lethal dose of arsenic trioxide is 10-180 mg, and for arsenide this is 70-210 mg. The mechanism of toxicity is binding and blocking sulphur enzymes."}, {"url": "http://chemsee.com/poison-detection/poison-detection-resources/chemnote-arsenic-poisoning/", "passage_text": "However, as long as the Arsenic is in the body, it will continue to cause physiological damage. Exposure to small doses of Arsenic compounds over a long period of time can result in lung, skin or liver cancer, or cancer of the lymphatic system. Damage to organs, such as the esophagus, can cause speaking difficulties. Exposure to small doses of Arsenic may also cause confusion and disorientation."}]