[{"url": "http://www.answers.com/Q/Is_granite_a_rock_or_a_mineral", "passage_text": "Granite is an intrusive igneous rock composed mainly of the minerals feldspar, quartz, and mica. Granite is an igneous rock. It is commonly formed from the following minerals. Quartz, potassium and Plagioclase Feldspars and Biotite Mica."}, {"url": "https://en.wikipedia.org/wiki/Granite", "passage_text": "Granite differs from granodiorite in that at least 35% of the feldspar in granite is alkali feldspar as opposed to plagioclase; it is the potassium feldspar that gives many granites a distinctive pink color. The extrusive igneous rock equivalent of granite is rhyolite. Granites can be predominantly white, pink, or gray in color, depending on their mineralogy. The word granite comes from the Latin granum, a grain, in reference to the coarse-grained structure of such a holocrystalline rock."}, {"url": "http://geology.about.com/od/more_igrocks/a/granite.htm", "passage_text": "First, granite is made of large mineral grains (which is where its name came from) that fit tightly together. Second, granite always consists of the minerals quartz and feldspar, with or without a wide variety of other minerals (accessory minerals). The quartz and feldspar generally give granite a light color, ranging from pinkish to white. That light background color is punctuated by the darker accessory minerals. Thus classic granite has a salt-and-pepper look. The most common accessory minerals are the black mica biotite and the black amphibole hornblende. Third, almost all granite is igneous (it solidified from a magma) and plutonic (it did so in a large, deeply buried body or pluton)."}, {"url": "http://geology.com/rocks/granite.shtml", "passage_text": "Granite is a light-colored igneous rock with grains large enough to be visible with the unaided eye. It forms from the slow crystallization of magma below Earth’s surface. Granite is composed mainly of quartz and feldspar with minor amounts of mica, amphiboles and other minerals. This mineral composition usually gives granite a red, pink, gray or white color with dark mineral grains visible throughout the rock. Granite is the best-known igneous rock. Three common usages of the word granite are explained below. Granite is a coarse-grained, light-colored igneous rock composed mainly of feldspars and quartz with minor amounts of mica and amphibole minerals. This simple definition enables students to easily identify the rock based upon a visual inspection."}, {"url": "http://study.com/academy/lesson/what-is-granite-definition-colors-quiz.html", "passage_text": "Granite is an igneous rock composed of mostly two minerals: quartz and feldspar. It is an intrusive rock, meaning that it crystallized from magma that cooled far below the earth's surface. Its name is derived from the Latin word 'granum', which means 'grain', a reference to the easily-seen minerals in the rock. "}, {"url": "http://egaonline.webpublishpro.com/egaindustry/granite", "passage_text": "The white mineral grains found in granite are feldspar. It is the most abundant mineral found in granite. The light gray, glass-like grains are quartz, and the black, flake-like grains are biotite or black mica. Granite and marble. Marble is also made up of only one mineral -- calcite -- a relatively soft mineral with a hardness of 3. Calcite is a common mineral -- all limestones and nearly all seashells are made of it, but it does not occur"}, {"url": "https://en.wikipedia.org/wiki/Granite", "passage_text": "Granite /ˈɡraenɨt/ ˈɡrænɨt is a common type of felsic intrusive igneous rock that is granular and phaneritic in. Texture granites can be predominantly, white, pink or gray in, color depending on their. mineralogy Granites can be predominantly white, pink, or gray in color, depending on their mineralogy. The word granite comes from the Latin granum, a grain, in reference to the coarse-grained structure of such a holocrystalline rock."}]