[{"url": "http://www.webmd.com/pain-management/carpal-tunnel/carpal-tunnel-syndrome-treatment-overview", "passage_text": "Carpal Tunnel Syndrome-Treatment Overview. The goal of treatment for carpal tunnel syndrome is to allow you to return to your normal function and activities and to prevent nerve damage and loss of muscle strength in your fingers and hand. Treatment options include: 1  Home treatment, such as changing or avoiding activities that may be causing symptoms and wearing a wrist splint. 2  Physical therapy. 3  Medicines, such as nonsteroidal anti-inflammatory drugs (NSAIDs) to relieve pain and reduce inflammation. 4  Surgery."}, {"url": "http://carpaltunnel.com/cure/", "passage_text": "How to Cure Carpal Tunnel Syndrome. Different methods of treatment for Carpal Tunnel Syndrome and their effectiveness. Carpal Tunnel may be treated by surgical and non-surgical means. Doctors may prescribe medication, splints, braces or cortisone injections to a patient. If however the symptoms refuse to go away and seem to be aggravating, it is possible that Doctors move on to a more hands on approach. Open Carpal Tunnel Release Surgery. This surgical cure of carpal tunnel allows doctors to fully see the trouble that the patience has been facing. They get a better view of the tissues and the carpal ligament which needs to be cut. An incision is made on the palm and the wrist."}, {"url": "http://www.mayoclinic.org/diseases-conditions/carpal-tunnel-syndrome/expert-answers/carpal-tunnel-exercises/FAQ-20058125", "passage_text": "Carpal tunnel syndrome is caused by compression of the median nerve as it passes through the carpal tunnel and under the transverse carpal ligament at the wrist. A number of factors can contribute to carpal tunnel syndrome, including wrist anatomy, underlying health problems and patterns of hand use. Probably not. When used alone, carpal tunnel exercises aren't likely to relieve symptoms, such as pain and numbness. And they don't replace other carpal tunnel treatments, such as surgery, behavior modification or wrist splints."}, {"url": "http://carpaltunnel.com/cure/", "passage_text": "Wrist Splints or wrist braces for carpal tunnel are mainly provided to patients for use during the night. Since people may sleep in awkward positions which may cause build up of pressure on the median nerve. A nightly wrist splint may show improvement of the condition within 6 weeks. Open Carpal Tunnel Release Surgery. This surgical cure of carpal tunnel allows doctors to fully see the trouble that the patience has been facing. They get a better view of the tissues and the carpal ligament which needs to be cut. An incision is made on the palm and the wrist."}, {"url": "http://www.nhs.uk/Conditions/Carpal-tunnel-syndrome/Pages/Treatment.aspx", "passage_text": "Treatment for carpal tunnel syndrome (CTS) depends on the severity of the condition and how long you have had it. In some cases, CTS will improve after a few months without treatment. Moving your hand or shaking your wrist can often help relieve the symptoms. During surgery the roof of the carpal tunnel, known as the carpal ligament, is cut to reduce pressure on the median nerve in the wrist. A local anaesthetic is used to numb your hand and wrist, but you will remain awake throughout the operation."}, {"url": "https://en.wikipedia.org/wiki/Carpal_tunnel_syndrome", "passage_text": "Carpal tunnel syndrome (CTS) is a medical condition in which the median nerve is compressed as it travels through the wrist at the carpal tunnel and causes pain, numbness and tingling, in the part of the hand that receives sensation from the median nerve. Pain in carpal tunnel syndrome is primarily numbness that is so intense that it wakes one from sleep. Pain in electrophysiologically verified CTS is associated with misinterpretation of nociception and depression."}, {"url": "http://umm.edu/health/medical/reports/articles/carpal-tunnel-syndrome", "passage_text": "Introduction. Carpal tunnel syndrome (CTS) is a disorder that causes pain and weakness in the hand and wrist. CTS develops from problems in a nerve in the wrist -- not the muscles, as some people believe. The symptoms of CTS can range from mild to incapacitating"}, {"url": "http://umm.edu/health/medical/altmed/condition/carpal-tunnel-syndrome", "passage_text": "Carpal tunnel syndrome (CTS) is an injury caused by a pinched nerve in the wrist. The injury causes pain and numbness in the index and middle fingers and weakness of the thumb. "}, {"url": "http://www.emedicinehealth.com/carpal_tunnel_syndrome/article_em.htm", "passage_text": "Patient Comments Read 8 Comments Share Your Story. Carpal tunnel syndrome is an irritation of the median nerve in the wrist that leads to numbness, tingling, pain, and weakness in the hand. The syndrome typically affects the thumb, index, and middle fingers and is often particularly troublesome at night. Carpal tunnel syndrome affects a low percent of the population and is most common in middle-aged women. Any condition that causes increased direct pressure on the median nerve in the wrist can lead to carpal tunnel syndrome. Many people with carpal tunnel syndrome have no identifiable cause."}]