[{"url": "http://www.cdc.gov/arthritis/basics/rheumatoid.htm", "passage_text": "Rheumatoid arthritis (RA) causes premature mortality, disability and compromised quality of life in the industrialized and developing world (1). Rheumatoid arthritis is a systemic inflammatory disease which manifests itself in multiple joints of the body."}, {"url": "http://www.webmd.com/rheumatoid-arthritis/guide/rheumatoid-arthritis-complications", "passage_text": "Eye Complications. Rheumatoid arthritis can affect the eyes in several ways. Inflammation of the episclera, a thin membrane that covers the sclera, or white of the eye, is a common complication of RA. It is usually mild, but the eye can become red and painful."}, {"url": "http://www.emedicinehealth.com/rheumatoid_arthritis/article_em.htm", "passage_text": "Although rheumatoid arthritis most often affects the joints, it is a disease of the entire body. It can affect many organs and body systems besides the joints. Therefore, rheumatoid arthritis is referred to as a systemic disease. Medically Reviewed by a Doctor on 5/11/2015."}, {"url": "http://www.healthline.com/health/rheumatoid-arthritis/effects-on-body", "passage_text": "Rheumatoid arthritis (RA) is a chronic inflammatory autoimmune disease that causes problems primarily in the joints, but can cause symptoms throughout the body. Inflammation of the finger joints causes stretching of the ligaments and tendons. This leads to the erosion of bone and cartilage and deformity of the joints."}, {"url": "http://niams.nih.gov/Health_Info/Rheumatic_Disease/rheumatoid_arthritis_ff.asp", "passage_text": "Rheumatoid arthritis is a disease that affects the joints. It causes pain, swelling, and stiffness. If one knee or hand has rheumatoid arthritis, usually the other does too. This disease often occurs in more than one joint and can affect any joint in the body."}, {"url": "http://www.emedicinehealth.com/rheumatoid_arthritis/article_em.htm", "passage_text": "Rheumatoid arthritis most often affects the smaller joints, such as those of the hands and/or feet, wrists, elbows, knees, and/or ankles, but any joint can be affected. The symptoms often lead to significant discomfort and disability."}, {"url": "http://orthoinfo.aaos.org/topic.cfm?topic=A00163", "passage_text": "Rheumatoid arthritis is not an isolated disease of the bones and joints. It affects tissues throughout the body, causing damage to the blood vessels, nerves, and tendons. Deformities of the hands and feet are the more obvious signs of RA."}]