[{"url": "http://www.forensicsciencetechnician.net/average-salary-for-forensic-science-technicians/", "passage_text": "Base Salary for a Forensic Science Technician. According to the Bureau of Labor Statistics, forensic science technicians make an average of $55,040, with the top 10 percent in this field making over $82,990. This takes into account forensic science technicians who live all over the country, though in general you can expect to make $40,000 to $67,000 in this year. Location plays a significant role in determining what you get paid as a forensic science technician. The following states have the highest average salaries for this type of career: 1  Illinois: $72,990. 2  Virginia:$69,860. 3  California: $67,720. 4  Connecticut: $67,570. 5  Michigan: $63,440"}, {"url": "http://www.schools.com/news/forensic-science-technician-salary-career-outlook.html", "passage_text": "Forensic science technician salary. According to the Bureau of Labor Statistics (BLS), forensic science technicians in the U.S. earned a mean annual wage of $57,340 in May 2013. However, salaries may vary based on location, employer and experience. The following states had the highest average annual wages for forensic science technicians in 2013: 1  Illinois: $82,110. 2  California: $74,240 (This state also employed the highest number of forensic science technicians in 2013.). 3  Washington, D.C.: $73,660."}, {"url": "http://www.bls.gov/ooh/life-physical-and-social-science/forensic-science-technicians.htm", "passage_text": "The median annual wage for forensic science technicians was $52,840 in May 2012. The median wage is the wage at which half the workers in an occupation earned more than that amount and half earned less. The lowest 10 percent earned less than $32,200, and the top 10 percent earned more than $85,210. "}, {"url": "http://www.healthcare-salaries.com/technicians/forensic-science-technician-salary", "passage_text": "According to the U.S. BLS, an average annual salary for a forensic science technician in the United States is about $52,180 per annum and an hourly wage is $40.86 per hour. 1  Share on Facebook. In addition, a well-established forensic science technician receives a much higher salary ranging from between $48,279 to $86,474 per annum. An average hourly wage for a forensic science technician geneticist ranges from between 14.90–$38.62 per hour."}, {"url": "https://collegegrad.com/careers/forensic-science-technicians.shtml", "passage_text": "The median annual wage for forensic science technicians was $52,840 in May 2012. The median wage is the wage at which half the workers in an occupation earned more than that amount and half earned less. The lowest 10 percent earned less than $32,200, and the top 10 percent earned more than $85,210. "}, {"url": "http://www.healthcare-salaries.com/technicians/forensic-science-technician-salary", "passage_text": "The yearly salary for top 10 percent of forensic science technicians is more than $84,000 while a yearly salary for the lowest 10 percent of them is less than $35,000. In addition, a well-established forensic science technician receives a much higher salary ranging from between $48,279 to $86,474 per annum. An average hourly wage for a forensic science technician geneticist ranges from between 14.90–$38.62 per hour."}, {"url": "https://www.recruiter.com/salaries/forensic-science-technicians-salary/", "passage_text": "Some college training is required for this position. A Forensic Science Technician receives wages between 48000 and 72000 depending on the level of seniority. Forensic Science Technicians will normally get an average compensation of Sixty One Thousand Six Hundred dollars annually. Forensic Science Technicians have the highest average potential salary in Massachusetts, where they earn average pay of close to about $81950. This group of professionals can obtain the highest pay in Finance and Insurance, where they get average pay of $68170. The national wage distribution is shown below"}, {"url": "http://www.healthcare-salaries.com/technicians/forensic-science-technician-salary", "passage_text": "The starting salary for a forensic science technician averages from between $29,577 to $46,255 per annum while an average forensic science technician receives an annual salary ranging from between $28,713 to $43,158 per year. In addition, a well-established forensic science technician receives a much higher salary ranging from between $48,279 to $86,474 per annum. An average hourly wage for a forensic science technician geneticist ranges from between 14.90–$38.62 per hour."}, {"url": "http://www.healthcare-salaries.com/technicians/forensic-science-technician-salary", "passage_text": "Conclusion about forensic science technician salary. The hourly wage for a forensic science technician with less than 1 year experience is around $15.75 per hour while the hourly wage for those with over 5 years of experience is around $32.29 per hour. In addition, a well-established forensic science technician receives a much higher salary ranging from between $48,279 to $86,474 per annum. An average hourly wage for a forensic science technician geneticist ranges from between 14.90–$38.62 per hour."}]