[{"url": "https://www.synthroid.com/hypothyroidism/tsh-test", "passage_text": "TSH is produced by a small gland in the brain called the pituitary, and can be measured by a common blood test. The hypothalamus, located in the brain, produces thyrotropin-releasing hormone (TRH) that tells the pituitary gland to make thyroid-stimulating hormone (TSH). Your TSH level can indicate if your thyroid gland is working properly. While a TSH test is usually used as the initial blood test to detect hypothyroidism, the doctor may need to order additional tests to diagnose hypothyroidism."}, {"url": "http://www.healthline.com/health/tsh", "passage_text": "It is sometimes called a “thyrotropin test.”. TSH is a hormone produced by the pituitary gland that tells the thyroid to make and release thyroxine (T4) and triiodothyronine (T3). Together, these essential hormones help control the rate at which the body uses energy. "}, {"url": "http://education.questdiagnostics.com/faq/FAQ138", "passage_text": "What is TSH and how is it measured? Thyroid stimulating hormone (TSH) is one of the most important hormones currently used to diagnose thyroid abnormalities. This glycoprotein is secreted by the pituitary and stimulates release of thyroxine (T4) and triiodothyronine (T3) from the thyroid gland. Question 1."}, {"url": "https://en.wikipedia.org/wiki/Thyroid-stimulating_hormone", "passage_text": "From Wikipedia, the free encyclopedia. Thyroid-stimulating hormone (also known as thyrotropin, TSH, or hTSH for human TSH) is a pituitary hormone that stimulates the thyroid gland to produce thyroxine (T 4), and then triiodothyronine (T 3) which stimulates the metabolism of almost every tissue in the body. TSH (with a half life of about an hour) stimulates the thyroid gland to secrete the hormone thyroxine (T 4), which has only a slight effect on metabolism. T 4 is converted to triiodothyronine (T 3), which is the active hormone that stimulates"}, {"url": "http://www.webmd.com/women/thyroid-stimulating-hormone-tsh?page=2", "passage_text": "Results. A thyroid-stimulating hormone (TSH) blood test is used to check for thyroid gland problems. The normal values listed here-called a reference range-are just a guide. These ranges vary from lab to lab, and your lab may have a different range for what's normal"}, {"url": "http://www.webmd.com/women/thyroid-stimulating-hormone-tsh", "passage_text": "Thyroid-Stimulating Hormone (TSH). Guide. A thyroid-stimulating hormone (TSH) blood test is used to check for thyroid gland problems. TSH is produced when the hypothalamus releases a substance called thyrotropin-releasing hormone (TRH). TRH then triggers the pituitary gland to release TSH. TSH causes the thyroid gland to make two hormones: triiodothyronine (T3) and thyroxine (T4). T3 and T4 help control your body's metabolism."}, {"url": "https://www.synthroid.com/hypothyroidism/tsh-test", "passage_text": "A TSH test is used to check the level of thyroid-stimulating hormone in the blood. Your TSH level can indicate if your thyroid gland is working properly. While a TSH test is usually used as the initial blood test to detect hypothyroidism, the doctor may need to order additional tests to diagnose hypothyroidism."}, {"url": "https://labtestsonline.org/understanding/analytes/tsh/tab/test", "passage_text": "A TSH test is frequently ordered along with or preceding a free T4 test. Other thyroid tests that may be ordered include a free T3 test and thyroid antibodies (if autoimmune-related thyroid disease is suspected). Sometimes TSH, free T4 and free T3 are ordered together as a thyroid panel. TSH testing is used to: 1  Diagnose a thyroid disorder in a person with symptoms. 2  Screen newborns for an underactive thyroid."}]