[{"url": "http://www.infoplease.com/encyclopedia/world/thailand-government.html", "passage_text": "1 Thailand: Government-Government Thailand is governed under an interim constitution, established after the 2006 coup, its ..."}, {"url": "http://www.infoplease.com/encyclopedia/world/thailand-government.html", "passage_text": "Thailand is governed under the constitution of 2007, adopted after the 2006 coup. The king is the head of state. The prime minister, who is the head of government, is elected by the House of Representatives and cannot serve more than eight consecutive years in the post."}, {"url": "http://countrystudies.us/thailand/75.htm", "passage_text": "Under the Constitution of 1978, Thailand has a British-style cabinet form of government with King Bhumibol Adulyadej (Rama IX, 1946-) reigning as constitutional monarch and Prime Minister Prem Tinsulanonda heading the government."}, {"url": "http://www.thailawforum.com/articles/briggsgov.html", "passage_text": "THAI GOVERNMENTAL STRUCTURE (Under Thailand's 1997 [B.E. 2540] Constitution). The Role of the King: Thailand is a constitutional monarchy, under which form of government the King serves the People of Thailand as HEAD OF STATE, under the terms of the Constitution of Thailand."}, {"url": "https://en.wikipedia.org/wiki/Government_of_Thailand", "passage_text": "The Government of Thailand, or formally the Royal Thai Government (RTG) (Thai: รัฐบาลไทย; rtgs: Ratthaban Thai), is the unitary government of the Kingdom of Thailand. The country emerged as a modern nation state after the foundation of the Chakri Dynasty and the city of Bangkok in 1782."}, {"url": "https://en.wikipedia.org/wiki/Government_of_Thailand", "passage_text": "Thailand has so far had seventeen Constitutions; however the basic structure of government has remained the same. The Government of Thailand is made up of three branches: the executive, the legislative, and the judiciary, the system of government is modelled after the Westminster system. All branches of the government are located within Bangkok, the capital city of Thailand."}]