[{"url": "http://english.stackexchange.com/questions/16704/what-does-email-exchange-mean", "passage_text": "up vote 4 down vote. An email exchange or exchange of emails is a series of emails between two or more participants, each generally a response to the previous email. With multiple participants you can get a tree of parallel responses rather than a simple linear chain, but the principle is the same. share | improve this answer. "}, {"url": "http://www.howtogeek.com/99423/email-whats-the-difference-in-pop3-imap-and-exchange/", "passage_text": "1 If you use Hotmail or an Exchange Server Email, MAPI or Exchange ActiveSync will give you similar cloud-based syncing, like IMAP. 2  If you don’t use Hotmail and you want email sync, use IMAP. 3  If you do use it and want email sync, use MAPI/Exchange ActiveSync. 1 If you use mostly webmail and want your phone or iPad to sync with your webmail, use IMAP, as well. 2  If you’re using one email client on one dedicated machine (say, in your office), you might be fine with POP3, but we’d recommend IMAP."}, {"url": "http://www.webopedia.com/TERM/E/Exchange_email.html", "passage_text": "A line of messaging and collaborative software from Microsoft that is comprised of an email server, email client, and several groupware applications. The Microsoft Exchange line is prevalent in large corporations and is frequently used in conjunction with Microsoft Outlook. Exchange Server enables a company's users to securely access communications like e-mail messages, voice mail, instant messaging and SMS text messages from their desktops, Web browsers or mobile devices. The latest release of Exchange Server, Microsoft Exchange Server 2010, made its debut on November 9, 2009."}, {"url": "http://www.microsoft.com/middleeast/windowsserversystem/exchange/evaluation/whatis.mspx", "passage_text": "Exchange Server, the Microsoft messaging and collaboration server, is software that runs on servers that enables you to send and receive electronic mail and other forms of interactive communication through computer networks. "}, {"url": "https://en.wikipedia.org/wiki/Microsoft_Exchange_Server", "passage_text": "Microsoft Exchange Server is a calendaring and mail server developed by Microsoft that runs exclusively on the Microsoft Windows Server product line. Exchange Server was initially Microsoft's internal mail server. The first version of Exchange Server to be published outside Microsoft was Exchange Server 4.0. Exchange initially used the X.400 directory service but switched to Active Directory later."}, {"url": "https://en.wikipedia.org/wiki/Microsoft_Exchange_Server", "passage_text": "Microsoft Exchange Online is an email, calendar and contacts solution delivered as a cloud service, hosted by Microsoft. It is essentially the same service offered by hosted Exchange providers and it is built on the same technologies as Microsoft Exchange Server. Exchange Server was initially Microsoft's internal mail server. The first version of Exchange Server to be published outside Microsoft was Exchange Server 4.0. Exchange initially used the X.400 directory service but switched to Active Directory later."}, {"url": "http://www.howtogeek.com/99423/email-whats-the-difference-in-pop3-imap-and-exchange/", "passage_text": "1 If you use check your email from a lot of devices, phones, or computers, set up your email clients to use IMAP. 2  If you use mostly webmail and want your phone or iPad to sync with your webmail, use IMAP, as well. 1 If you use mostly webmail and want your phone or iPad to sync with your webmail, use IMAP, as well. 2  If you’re using one email client on one dedicated machine (say, in your office), you might be fine with POP3, but we’d recommend IMAP."}, {"url": "https://en.wikipedia.org/wiki/Microsoft_Exchange_Server", "passage_text": "Exchange Server uses a proprietary protocol called MAPI. Over time, however, it added support for POP3, IMAP, SMTP and EAS. Exchange Server is licensed both in the forms of on-premises software and software as a service. In the on-premises form, customer purchase client access licenses (CALs). In the software as a service form, Microsoft receives a monthly service fee instead. Exchange Server was initially Microsoft's internal mail server. The first version of Exchange Server to be published outside Microsoft was Exchange Server 4.0. Exchange initially used the X.400 directory service but switched to Active Directory later."}, {"url": "https://en.wikipedia.org/wiki/Exchange_ActiveSync", "passage_text": "Microsoft Exchange ActiveSync (commonly known as EAS) is a communications protocol designed for the synchronization of email, contacts, calendar, tasks, and notes from a messaging server to a smartphone or other mobile devices. The protocol also provides mobile device management and policy controls. "}]