[{"url": "http://www.homeadvisor.com/cost/heating-and-cooling/", "passage_text": "Other Heating & Cooling System Factors. 1  Geothermal heating & cooling ($4,500 - $6,000) : Considered an eco-friendly heating and cooling option, these systems use energy in the earth to pump heat into a home. 2  It uses equipment that goes into the earth's crust and pulls heat ou"}, {"url": "http://costowl.com/home-improvement/hvac-system.html", "passage_text": "1 For a 1,000 square foot home, the cost of an HVAC system is $6,000 to $12,000, including a new furnace, air conditioning unit, and ductwork. 2  For larger homes and more complex setups, however, the price could be significantly higher."}, {"url": "http://energyhomes.org/renewable%20technology/geoinstallation.html", "passage_text": "Geothermal heating system price varies depending on the type of loop system, usually either vertical or horizontal. On average, a typical home of 2500 square feet, with a heating load of 60,000 BTU and a cooling load of 60,000 BTU will cost between $20,000 to $25,000 to install."}, {"url": "http://energyhomes.org/renewable%20technology/geoinstallation.html", "passage_text": "Before installing any new heating or cooling system in a home, it is necessary to re evaluate and reduce the energy load of the home. A more energy efficient home will not only reduce the cost of a new system and utility bills, but it will greatly improve the comfort of your home."}, {"url": "http://energyhomes.org/renewable%20technology/geoinstallation.html", "passage_text": "This is around double the cost of a conventional heating, cooling, and hot water system, but geothermal heating/cooling systems can reduce utility bills by 40% to 60%. The payback for a system can range from 2-10 years, while the lifetime of a system can be 18-23 years, almost double a conventional system."}, {"url": "http://costowl.com/home-improvement/hvac-system.html", "passage_text": "1 A new furnace in a central heating system costs $2,500 to $7,500 or more. 2  If you don’t need ductwork, the cost of a new heating and cooling system can be significantly decreased. 3  In cases where new HVAC duct is required, however, you might pay $1,000 to $3,000."}, {"url": "http://www.homeadvisor.com/cost/heating-and-cooling/install-a-geothermal-heating-or-cooling-system/", "passage_text": "NEXT STEP. Find out how much your project will cost. Provide a few details about your project and receive competitive quotes from local pros. The average national cost to install a geothermal heating or cooling system is $5,745, with most homeowners spending between $3,534 and $11,089."}, {"url": "http://www.hgtv.com/remodel/mechanical-systems/replace-old-heating-and-air-unit-with-new-efficient-hvac-system", "passage_text": "The high-end system would cost Jeff $5,800, but for that $2,300 more, he got more features and optimum, 97 percent efficiency. Because the Wilsons mainly used their air conditioning to defuse the thick humidity typical in southeast Ohio during summer, a variable-speed blower was worth the investment."}, {"url": "http://www.qualitysmith.com/request/articles/articles-hvac/geothermal-heat-pump-cost/", "passage_text": "An average home needs 3 tons of heating capacity, and the average cost of a geothermal system is at least $2,500 per ton of capacity. Generally, for each ton of capacity, air source heat pumps are about $3,000 less to install than geothermal heat pumps."}]