[{"url": "https://en.wikipedia.org/wiki/Stucco", "passage_text": "Stucco or render (Persian: گچ بری Gachbori) is a material made of an aggregate, a binder, and water. Stucco is applied wet and hardens to a very dense solid. It is used as decorative coating for walls and ceilings and as a sculptural and artistic material in architecture. Until the latter part of the nineteenth century, it was common that plaster, which was used inside a building, and stucco, which was used outside, would consist of the same primary materials: lime and sand (which are also used in mortar). Animal or plant fibers were often added for additional strength."}, {"url": "https://en.wikipedia.org/wiki/Stucco", "passage_text": "Traditional stucco is made of lime, sand, and water. Modern stucco is made of Portland cement, sand, and water. Lime is added to increase the permeability and workability of modern stucco. Sometimes additives such as acrylics and glass fibers are added to improve the structural properties of the stucco. Until the latter part of the nineteenth century, it was common that plaster, which was used inside a building, and stucco, which was used outside, would consist of the same primary materials: lime and sand (which are also used in mortar). Animal or plant fibers were often added for additional strength."}, {"url": "http://www.buildnaturally.com/EDucate/Articles/Lime.htm", "passage_text": "Do not apply exterior lime stucco if there is any risk of freezing, otherwise moisture in the plaster can freeze, expand, and cause critical failure of the plaster. The temperature needs to be above 40 F for at least a week to keep the curing process going. Chicken wire and lath can impede the lime plaster from bonding fully to the straw. When applying lime stucco over strawbale walls, I recommend 3 coats of lime directly on the strawbales. The first coat can be up to 5/8 thick if it is applied to strawbale, otherwise each coat should be a maximum of 3/8 to 1/2 thick."}, {"url": "http://usheritage.com/plaster-stucco/", "passage_text": "Heritage Natural Hydraulic Lime Stucco/Plaster is a dry material with aggregate preblended into the product. The product is applied in three coats: a scratch coat, a brown coat and a skim coat. This product is ready to use; just add water and mix at the site before applying the stucco. Heritage Hydraulic Lime Stucco/Plaster. This product is a traditional material made from 100% all-natural ingredients, and it is breathable and flexible. Hydraulic lime is distinguished from non-hydraulic lime by its ability to cure in damp/wet conditions."}, {"url": "http://authenticplasterfx.com/lime-based-stucco-plasters/", "passage_text": "Classic lime based stucco. lime based stucco is commonly employed utilizing a 3 layer technique, the initial layer known as the base, scratch, spatter dash or bond coat, is applied on the substrate, which might vary from permeable adobe brick to cement masonry to EPS sheets covered with wire mesh. 1 lime based plaster and stucco hardens by transforming calcium hydroxide to calcium carbonate by reacting using the co2 in the air. 2  Consequently the continuing conversion process heals fine cracks and fissures as it solidifies, in turn this reduces water penetration whilst improving the durability of the stucco finish."}, {"url": "http://www.titanamerica.com/uploads/Cement-Lime%20vs%20%20Masonry-Stucco.pdf", "passage_text": "Portland Cement/Lime vs. Masonry Cement/Stucco. The use of Portland Cement/Lime mortars for unit masonry and/or stucco was the standard of the industry for nearly a century. Though considered antiquated, it is still specified today, primarily on military projects or projects located in the northern states."}, {"url": "https://en.wikipedia.org/wiki/Lime_plaster", "passage_text": "Lime plaster is type of plaster composed of sand, water, and lime, usually non-hydraulic hydrated lime (also known as slaked lime, high calcium lime or air lime). Ancient lime plaster often contained horse hair for reinforcement and pozzolan additives to reduce the working time. The most commonly-used type of lime for lime plaster—non-hydraulic hydrated lime—only sets through carbonatation of CO 2 in the air, and will not set until dry. The water added to the mix is purely to improve workability and stickiness"}, {"url": "http://stucconews.net/column/What_is_lime_plaster,_or_lime_stucco.html", "passage_text": "I have yet to work on a building built after 1930 that was lime and sand, all I have seen are cement stucco. Mystic secret revealed ! On most lime and sand stucco houses we work on. the sheathing an d framing lumber is still in good condition AFTER SITTING WITH GAPING HOLES FOR YEARS. Sheathing is good shape on this 1920 wood lath and lime and stucco house that had fallen into disrepair over the years. "}, {"url": "http://usheritage.com/plaster-stucco/", "passage_text": "Heritage Lime Stucco/Plaster products are ideal for building durable and beautiful exterior or interior finishes on historic masonry, Lime stucco/plaster also recommended for sustainable new-build projects and strawbale construction that rely on breathable, all-natural construction materials. Heritage Hydraulic Lime Stucco/Plaster. This product is a traditional material made from 100% all-natural ingredients, and it is breathable and flexible. Hydraulic lime is distinguished from non-hydraulic lime by its ability to cure in damp/wet conditions."}, {"url": "http://buildsimple.org/resources/See%20How%20to%20Make%20Lime%20Plaster.pdf", "passage_text": "Every 4 or 5 years the plaster needs a thin coat of limewash to maintain its strength. Lime plaster is the best finish to use on earth walls because: 1. It shrinks and swells with heat in a similar way to earth. A thin layer of lime plaster on earth will not suffer serious cracks like cement stucco. It is also easy to repair lime plaster with a thin layer of plaster or limewash. "}]