[{"url": "https://en.wikipedia.org/wiki/Herbaceous_plant", "passage_text": "Examples of herbaceous biennials include carrot, parsnip and common ragwort; herbaceous perennials include potato, peony, hosta, mint, most ferns and most grasses."}, {"url": "http://www.gardenseeker.com/perennials/index.html", "passage_text": "Perennial Herbs. 1  Many of the plants found in the traditional-or modern-herb garden are also perennials-some are evergreen perennials, such as the Thymes and Sages. 2  Others happily partaking in the herbaceous habit of growth, and therefore dying down each winter-to re-appear the following year."}, {"url": "http://homeguides.sfgate.com/list-herbaceous-perennials-63096.html", "passage_text": "Herbaceous perennials are garden plants that die back to the soil line when winter temperatures arrive. The plants enter a dormant period and strengthen the root system while waiting for the coming of spring."}, {"url": "https://en.wikipedia.org/wiki/Herbaceous_plant", "passage_text": "By contrast, non-herbaceous perennial plants are woody plants which have stems above ground that remain alive during the dormant season and grow shoots the next year from the above-ground parts – these include trees, shrubs and vines."}, {"url": "http://www.merriam-webster.com/dictionary/herbaceous%20perennial", "passage_text": ": a plant whose top growth dies down annually but whose crowns, roots, bulbs, or rhizomes survive the winter. ADVERTISEMENT."}, {"url": "http://gardening.about.com/od/perennials/g/herbaceous.htm", "passage_text": "Photo: © Marie Iannotti. Definition: When a plant is called herbaceous, it means that the stems are soft or succulent and green, as opposed to brown and woody. Generally soft, green, herbaceous growth will die back to the ground in cold, winter climates. The roots of the perennial plant are alive and well, and new growth will emerge in the spring."}, {"url": "https://en.wikipedia.org/wiki/Perennial_plant", "passage_text": "A perennial plant or simply perennial is a plant that lives for more than two years. The term is often used to differentiate a plant from shorter-lived annuals and biennials. The term is also widely used to distinguish plants with little or no woody growth from trees and shrubs, which are also technically perennials."}, {"url": "https://en.wikipedia.org/wiki/Herbaceous_plant", "passage_text": "Trientalis latifolia (Broadleaf Starflower) is a perennial herbaceous plant of the ground layer of forests in western North America. An herbaceous plant (in American botanical use simply herb) is a plant that has leaves and stems that die down at the end of the growing season to the soil level. They have no persistent woody stem above ground."}]