[{"url": "http://medical-dictionary.thefreedictionary.com/orbicularis+oculi", "passage_text": "orbicularis oculi, the muscular body of the eyelid, encircling the eye and comprising the palpebral, orbital, and lacrimal muscles. It arises from the nasal part of the frontal bone, the frontal process of the maxilla in front of the lacrimal groove, and the anterior surface of the medial palpebral ligament. The palpebral muscle functions to close the eyelid gently; the orbital muscle functions to close it more energetically, such as in winking."}, {"url": "http://www.merriam-webster.com/medical/orbicularis%20oris", "passage_text": "Medical Definition of ORBICULARIS ORIS. : a muscle made up of several layers of fibers passing in different directions that encircles the mouth and controls most movements of the lips (as compressing, closing, or pursing movements). "}, {"url": "https://en.wikipedia.org/wiki/Orbicularis_oculi_muscle", "passage_text": "The orbicularis oculi is a muscle in the face that closes the eyelids. It arises from the nasal part of the frontal bone, from the frontal process of the maxilla in front of the lacrimal groove, and from the anterior surface and borders of a short fibrous band, the medial palpebral ligament. "}, {"url": "http://www.healthline.com/human-body-maps/orbicularis-oris-muscle", "passage_text": "Orbicularis oris. Located in the face, the orbicularis oris muscle controls movements of the mouth and lips. Specifically, it encircles the mouth, originating in the maxilla (upper jaw and palate) and mandible (lower jaw) bones. The muscle inserts directly into the lips. In common language, the orbicularis oris is often referred to as the kissing muscle.. It allows for facial expression, and more specifically, it is responsible for puckering the lips. While this action is a requirement for kissing, the puckering action is used in a number of other way"}, {"url": "http://www.merriam-webster.com/medical/orbicularis%20oculi", "passage_text": "Medical Definition of ORBICULARIS OCULI. : the muscle encircling the opening of the orbit and functioning to close the eyelids. What made you want to look up orbicularis oculi?"}, {"url": "http://www.medilexicon.com/medicaldictionary.php?t=56952", "passage_text": "Synonyms: musculus orbicularis oris, musculus sphincter oris, orbicular muscle of mouth, sphincter oris. The definition information for orbicularis oris (muscle) is provided by Stedman's. You can search our medical dictionary here. "}, {"url": "https://en.wikipedia.org/wiki/Orbicularis_oris_muscle", "passage_text": "In human anatomy, the orbicularis oris muscle is a complex of muscles in the lips that encircles the mouth. Until recently, it was misinterpreted as a sphincter, or circular muscle, but it is actually composed of four independent quadrants that interlace and give only an appearance of circularity. The orbicularis oris is not a simple sphincter muscle like the orbicularis oculi; it consists of numerous strata of muscular fibers surrounding the orifice of the mouth, but having different direction."}, {"url": "http://medical-dictionary.thefreedictionary.com/orbicularis+oris", "passage_text": "orbicularis oris, the muscle surrounding the mouth. It consists partly of fibers derived from other facial muscles such as the buccinator that are inserted into the lips and partly of fibers proper to the lips. It serves to close and purse the lips. "}]