[{"url": "http://personal.natwest.com/personal/current-accounts/overdrafts.html", "passage_text": "There are no set up fees for an Arranged Overdraft, but you could be charged an Arranged Overdraft Usage Fee and interest for using an Arranged Overdraft, depending on the type of current account you have, how much of the limit you've used and how long you use it for. You’ll also go into an Unarranged Overdraft if you go over the agreed limit of your Arranged Overdraft, if you have one. If you enter an Unarranged Overdraft by more than £10, you will be charged an Unarranged Overdraft Usage Fee of £6 for each day you remain in that position. This is then capped at £90 per charging period. A charging period runs from month to month, usually from the date that your current account was opened"}, {"url": "https://www.moneyadviceservice.org.uk/en/articles/overdrafts-explained", "passage_text": "An authorised overdraft is an overdraft that has been agreed with your bank. You are allowed to borrow up to a pre-set overdraft limit. You will normally be charged for using the overdraft, though how much you pay and the type of fee may vary from bank to bank and how much you are overdrawn. "}, {"url": "http://www.telegraph.co.uk/finance/personalfinance/bank-accounts/10001751/RBS-and-NatWest-push-up-overdraft-charges.html", "passage_text": "However, the bank has reduced the maximum fees that customers will pay if they exceed their agreed overdraft limits. Previously customers would be charged for every day their overdraft remained over this limit; now this is capped at a maximum of 15 days in any one month-reducing the maximum charges from £186 to £90. A spokesman for the bank said this was to reduce the disparity between unauthorised and authorised overdraft charges. Customers who use their overdraft will now pay a £6 monthly charge. This is on top of interest, payable at 19.89pc on the overdraft. In addition the bank has reduced the interest-free buffer from £100 to £10, meaning customers will be hit with these charges sooner."}, {"url": "http://personal.natwest.com/personal/current-accounts/overdrafts/overdraft-calculator.html", "passage_text": "If you go into an Unarranged Overdraft by more than £10, you’ll be charged an Unarranged Overdraft Usage Fee of £6 each day. The fee is capped at 15 fees per charging period (£90). A charging period runs from month to month, usually from the date that the account was opened. Did you know: 1  N o charges apply to unarranged overdrafts of under £10. 2  Unarranged Overdraft Usage Fees are capped at 15 fees per charging period. Your charging period runs from month to month, usually from the date you opened your account. For example, if you opened your account on 15th August your charging period would run from 15th of each month to the 14th of the next."}, {"url": "http://www.telegraph.co.uk/finance/personalfinance/bank-accounts/10001751/RBS-and-NatWest-push-up-overdraft-charges.html", "passage_text": "It also further complicates overdraft charges.. He said that with some banks charging flat fees on overdrafts, some charging an interest rates and banks like RBS now charging a combination of both, it was becoming increasingly difficult for customers to compare accounts and work out which one offered the best deal. Customers who use their overdraft will now pay a £6 monthly charge. This is on top of interest, payable at 19.89pc on the overdraft. In addition the bank has reduced the interest-free buffer from £100 to £10, meaning customers will be hit with these charges sooner."}, {"url": "http://personal.natwest.com/personal/current-accounts/overdrafts.html", "passage_text": "Find out what it costs to use an Arranged Overdraft for a certain number of days. And, you can even work out what you might be charged if you accidentally go over your agreed limit into an Unarranged Overdraft. Go to our cost calculator. All costs shown by our calculator are for illustration purposes only. You’ll also go into an Unarranged Overdraft if you go over the agreed limit of your Arranged Overdraft, if you have one. If you enter an Unarranged Overdraft by more than £10, you will be charged an Unarranged Overdraft Usage Fee of £6 for each day you remain in that position. This is then capped at £90 per charging period. A charging period runs from month to month, usually from the date that your current account was opened"}, {"url": "https://uk.answers.yahoo.com/question/index?qid=20090806223541AAiEtpl", "passage_text": "Rating Newest Oldest. Best Answer: On its main current account NatWests agreed overdraft is charged at 19.24% EAR (1.48% per month), which is payable each month. However, the account offers a £100 interest free buffer, so you wont be charged of the first £100 of any agreed overdraf"}, {"url": "http://www.thisismoney.co.uk/money/saving/article-2310188/Millions-customers-charged-72-Natwest-going-10-overdraft.html", "passage_text": "After that, agreed overdrafts cost £1 a day, capped at £20 a month. Unarranged fees are charged daily at £5 – capped at 20 occasions per month and potentially racking up to £100. The overall overdraft fee cap is a monthly £150. However, it is also cutting back on the number of unarranged overdraft fees it will charge each month — down from £186 to £90. RBS and NatWest argue that even with the extra charges, their overdrafts are still competitive compared with other banks, ‘A new fee has been introduced."}]