[{"url": "http://www.merriam-webster.com/dictionary/whole%20food", "passage_text": "Full Definition of WHOLE FOOD. : a natural food and especially an unprocessed one (as a vegetable or fruit). See whole food defined for English-language learners. "}, {"url": "http://healthyeating.sfgate.com/sample-day-whole-food-diet-1763.html", "passage_text": "Pork chops with green beans and potatoes makes a perfect whole food meal. Following a whole food diet involves maximizing your nutrient intake from natural sources and avoiding nutrient-poor processed foods. Whole foods mainly include plant-based foods such as vegetables, fruits and nuts, and animal foods such as eggs, meat, fish and poultry. A whole food diet can provide you with all of the nutrients you need for optimal health."}, {"url": "https://en.wikipedia.org/wiki/Whole_Foods", "passage_text": "Whole Foods headquarters in Downtown Austin. Whole Foods Market Inc. is an American supermarket chain specializing in organic food that opened on Sept. 20, 1980, in Austin, Texas, its current headquarters. The following Memorial Day, on May 25, 1981, the most damaging flood in 70 years devastated Austin. Whole Foods' inventory was ruined, and most of the equipment was damaged. The loss was approximately $400,000; Whole Foods Market had no insurance."}, {"url": "https://en.wikipedia.org/wiki/Whole_food", "passage_text": "Unrefined, whole foods. Whole foods are foods that are unprocessed and unrefined, or processed and refined as little as possible, before being consumed. Whole foods typically do not contain added salt, carbohydrates, or fat. Examples of whole foods include unpolished grains, beans, fruits, vegetables, and animal products, including meats and non-homogenized dairy products."}, {"url": "http://www.100daysofrealfood.com/real-food-defined-a-k-a-the-rules/", "passage_text": "1 This will help to displace the processed foods in your diet, and will actually make your food selections in general very simple. 2  No more counting calories, fat grams, or carbs when your only concern is selecting whole foods that are more a product of nature than a product of industry. 1 Increase your consumption of whole foods especially vegetables and fruits. 2  I am sure you’ve heard similar advice a thousand times, and I hate to tell you that it couldn’t be more true. 3  This will help to displace the processed foods in your diet, and will actually make your food selections in general very simple."}, {"url": "https://en.wikipedia.org/wiki/Whole_Foods", "passage_text": "As of 2015, founder John Mackey and Walter Robb are co-CEOs of the publicly traded company, with John Elstrott as chairman. Whole Foods Market became a Fortune 500 company in March 2005 and is the 30th largest retailer in the U.S. based on 2014 revenue. The following Memorial Day, on May 25, 1981, the most damaging flood in 70 years devastated Austin. Whole Foods' inventory was ruined, and most of the equipment was damaged. The loss was approximately $400,000; Whole Foods Market had no insurance."}, {"url": "https://www.ttuhsc.edu/som/fammed/wholefoods.aspx", "passage_text": "The Whole Foods Weight Loss Eating Plan controls the intake of refined sugars or flour and encourages intake of whole, unprocessed food. It contains moderate amounts of starch, protein and fat. 1 Concentrate on the quality of the food you eat rather than the number of calories. 2  Eat whole grains (not just grains), raw or lightly cooked vegetables, fresh fruits, low or nonfat dairy products, and lean cuts of protein foods."}, {"url": "https://en.wikipedia.org/wiki/Whole_Foods", "passage_text": "Beginning in 1984, Whole Foods Market expanded out of Austin, first to Houston and Dallas and then into New Orleans with the purchase of The Whole Food Co. in 1988. In 1989, the company expanded to the West Coast with a store in Palo Alto, Calif. The following Memorial Day, on May 25, 1981, the most damaging flood in 70 years devastated Austin. Whole Foods' inventory was ruined, and most of the equipment was damaged. The loss was approximately $400,000; Whole Foods Market had no insurance."}, {"url": "http://www.forksoverknives.com/what-to-eat/", "passage_text": "It’s a diet based on fruits, vegetables, tubers, whole grains, and legumes; and it excludes or minimizes meat (including chicken and fish), dairy products, and eggs, as well as highly refined foods like bleached flour, refined sugar, and oil. What matters most is the overall nutrient profile, i.e., the whole package. Whole, plant-based foods contain all the essential nutrients (with the exception of vitamin B12), and in proportions that are more consistent with human needs than animal-based or processed foods."}]