[{"url": "http://www.mayoclinic.org/diseases-conditions/kidney-infection/basics/definition/con-20032448", "passage_text": "Male urinary system. Kidney infection (pyelonephritis) is a specific type of urinary tract infection (UTI) that generally begins in your urethra or bladder and travels up into your kidneys. A kidney infection requires prompt medical attention. If not treated properly, a kidney infection can permanently damage your kidneys or the bacteria can spread to your bloodstream and cause a life-threatening infection. Kidney infection treatment usually includes antibiotics and often requires hospitalization."}, {"url": "http://www.medicalnewstoday.com/articles/182306.php", "passage_text": "Kidney infection, also known as renal infection or pyelonephritis, is a type of urinary tract infection (UTI) that is usually caused caused by E. coli bacteria. The bacteria may have spread from the bladder or the urethra to one of the kidneys, infecting it. 1 Kidney stones-individuals with kidney stones have a higher risk of developing kidney infection. 2  Kidney stones are the result of a build-up of dissolved minerals on the inner lining of the kidneys. 3  Enlarged prostate-males with an enlarged prostate have a higher risk of developing kidney infections."}, {"url": "http://www.mayoclinic.org/diseases-conditions/kidney-infection/basics/treatment/con-20032448", "passage_text": "Hospitalization for severe kidney infections. For a severe kidney infection, your doctor may admit you to the hospital. Treatment in the hospital may include antibiotics that you receive through a vein in your arm (intravenously). How long you'll stay in the hospital depends on the severity of your condition. Which drugs you use and for how long depend on your health condition and the bacteria found in your urine tests. Usually, the signs and symptoms of a kidney infection begin to clear up within a few days of treatment. But you may need to continue antibiotics for a week or longer."}, {"url": "http://www.mayoclinic.org/diseases-conditions/kidney-infection/basics/treatment/con-20032448", "passage_text": "Antibiotics for kidney infections. Antibiotics are the first line of treatment for kidney infections. Which drugs you use and for how long depend on your health condition and the bacteria found in your urine tests. Usually, the signs and symptoms of a kidney infection begin to clear up within a few days of treatment. But you may need to continue antibiotics for a week or longer."}, {"url": "http://patient.info/health/kidney-infection-pyelonephritis", "passage_text": "1 Antibiotics will usually clear the infection. 2  An antibiotic is usually prescribed straightaway if a kidney infection is suspected, even before the result of the urine test is known. 3  Some germs (bacteria) are resistant to some antibiotics. Most kidney infections develop as a complication of a bladder infection (cystitis). Germs (bacteria) causing cystitis can sometimes travel up to infect a kidney. The bacteria are usually those which live in the bowel."}, {"url": "http://www.medicinenet.com/kidney_infection/page3.htm", "passage_text": "The main components of the urinary tract system are kidneys, ureters, bladder, and urethra. Any part of the urinary system may become infected and this is generally referred to as urinary tract infection (UTI). When a kidney becomes infected, the condition is medically referred to as pyelonephritis. Thus, kidney infection is only one of several types of infections encompassed by the term UTI. A more general classification of urinary tract infection is the following: 1  Lower urinary tract infection involves the urethra, the bladder, and, in men, the prostate gland. 2  Upper urinary tract infection refers to infection of the kidneys. 3  Continue Reading."}, {"url": "http://umm.edu/health/medical/reports/articles/urinary-tract-infection", "passage_text": "Urinary Tract Infections (UTIs). Urinary tract infections (UTIs) are a common type of infection caused by bacteria (most often E. coli) that travel up the urethra to the bladder. A bladder infection is called cystitis. If bacterial infection spreads to the kidneys and ureters, the condition is called pyelonephritis. Cystitis is considered a lower urinary tract infection. Pyelonephritis is an upper urinary tract infection and is much more serious."}, {"url": "http://umm.edu/health/medical/reports/articles/urinary-tract-infection", "passage_text": "A urinary tract infection (UTI) is a condition in which one or more parts of the urinary system (the kidneys, ureters, bladder, and urethra) become infected. UTIs are the most common of all bacterial infections and can occur at any time in the life of an individual. A bladder infection is called cystitis. If bacterial infection spreads to the kidneys and ureters, the condition is called pyelonephritis. Cystitis is considered a lower urinary tract infection. Pyelonephritis is an upper urinary tract infection and is much more serious."}, {"url": "http://www.nhs.uk/Conditions/Kidney-infection/Pages/Treatment.aspx", "passage_text": "Most people with a kidney infection can be treated at home with a course of antibiotics, and possibly painkillers as well. See your GP if you have a fever and persistent tummy, lower back or genital pain, or if you notice a change to your usual pattern of urination. "}]