[{"url": "http://www.livestrong.com/article/189050-list-of-yeast-free-diet-foods/", "passage_text": "Complex carbohydrates are safe to eat in moderation on a yeast-free diet. According to Women to Women's Healthcare Center, grains such as rice, buckwheat, barley, couscous and most whole grain oatmeal are part of a healthy yeast-free diet. Additionally, beans including kidney, lima and red beans are allowed. Certain types of pasta can be eaten on a yeast-free diet, but they must be made of whole wheat, spelt, corn or rice. It is important not to eat too many carbohydrates throughout the diet, so stick to 15 grams per meal or less."}, {"url": "http://www.thecandidadiet.com/foodstoeat.htm", "passage_text": "The good news is that the Foods To Eat list also contains some delicious items. There are lots of tasty sources of proteins, fats and non-starchy carbohydrates that you can use to prepare your meals. And there really is no limit to how you can use herbs, spices and other flavorings to make them even more delicious. The table below contains some of the foods you can eat during your Candida diet. If you need a more comprehensive list, my Ultimate Candida Diet program contains a longer and more comprehensive list"}, {"url": "http://www.thecandidadiet.com/foodstoeat.htm", "passage_text": "Eating non-starchy vegetables starves the Candida of the sugar that feeds it. You should buy your vegetables fresh and eat them raw, steamed or grilled. Avoid starchy vegetables such as sweet potatoes, potatoes, yams, corn, all winter squash, beets, peas, parsnips and beans. There are lots of tasty sources of proteins, fats and non-starchy carbohydrates that you can use to prepare your meals. And there really is no limit to how you can use herbs, spices and other flavorings to make them even more delicious. The table below contains some of the foods you can eat during your Candida diet."}, {"url": "http://www.wikihow.com/Start-a-Yeast-Free-Diet", "passage_text": "A yeast-free diet is one method that's been suggested to combat symptoms caused by Candida yeast infections. Not everyone agrees that it is effective, but anecdotally at least, many people stand by the results, so you may want to try it. But get to know the details so that you can make foods you enjoy! Things you can eat include: 3. 1  fresh meat, chicken and fish. 2  eggs. 3  garbanzo beans and lentils. 4  avocado. 5  walnuts, cashews, hazelnuts, macadamias, and coconut. 6  brown rice (no white rice) and rice cakes. 7  all vegetables, fresh or frozen, including onions and garlic. 8  fruit that is not bruised (but no melons or grapes)"}, {"url": "http://www.allergy-details.com/yeast-allergy/yeast-free-foods/", "passage_text": "Yeast-free Foods. by Allergy Guy. Following a restrictive diet is no fun, especially when faced with the necessary but depressing lists of things you can not eat. If you are following a yeast-free diet, this article provides a list of foods you can eat. It is by no means complete, and quite honestly never will be. There are an endless number of prepared foods. This varies country by country and region by region. Yeast-Free Foods – Basic Ingredients. If you are doing your own cooking, it is relatively easy to avoid yeast. This is more of a general description of foods you can eat since most basic ingredients are find (with a few exceptions, covered in Foods that Contain Yeast."}, {"url": "http://www.livestrong.com/article/435760-candida-diet-cheese/", "passage_text": "Sample Menus With Cheese. When you're following a candida diet, you will need to eliminate all processed foods, grains -- both refined and whole -- sweeteners, dried fruit, starchy vegetables like potatoes and corn, alcohol and yeast-dependent foods like bread from your meals. Photo Credit olgakr/iStock/Getty Images. Most dairy products, including cheese and milk, aren't allowed on a candida diet. That's because dairy contains lactose, a simple sugar thought to provide fuel for candida, the yeast that grows naturally on the skin and in the urinary tract."}, {"url": "http://www.wikihow.com/Start-a-Yeast-Free-Diet", "passage_text": "2. Remove yeast from your diet. If you think a yeast-free diet may be more healthy for your body type overall, try working toward taking yeast out of your diet for good. Rather than thinking about specific foods that are or aren't allowed, imagine creating a diet that will serve your body most effectively. But get to know the details so that you can make foods you enjoy! Things you can eat include: 3. 1  fresh meat, chicken and fish. 2  eggs. 3  garbanzo beans and lentils. 4  avocado. 5  walnuts, cashews, hazelnuts, macadamias, and coconut. 6  brown rice (no white rice) and rice cakes. 7  all vegetables, fresh or frozen, including onions and garlic. 8  fruit that is not bruised (but no melons or grapes)"}, {"url": "http://www.livestrong.com/article/435760-candida-diet-cheese/", "passage_text": "While a candida diet limits products that can serve as food for candida, not all types of cheese are forbidden. Before starting any version of the candida diet, speak to your doctor about the possible benefits and dangers. Photo Credit olgakr/iStock/Getty Images. Most dairy products, including cheese and milk, aren't allowed on a candida diet. That's because dairy contains lactose, a simple sugar thought to provide fuel for candida, the yeast that grows naturally on the skin and in the urinary tract."}, {"url": "http://www.livestrong.com/article/435760-candida-diet-cheese/", "passage_text": "While you're on a candida diet, you're allowed to eat soy cheese as long as it does not include the sweetener maltodextrin or modified food starch as ingredients. Photo Credit olgakr/iStock/Getty Images. Most dairy products, including cheese and milk, aren't allowed on a candida diet. That's because dairy contains lactose, a simple sugar thought to provide fuel for candida, the yeast that grows naturally on the skin and in the urinary tract."}]