[{"url": "http://www.thefreedictionary.com/antibody", "passage_text": "A protein produced in the blood or tissues in response to the presence of a specific foreign antigen. Antibodies provide immunity against certain microorganisms and toxins by binding with them and often by deactivating them. 1. any of numerous protein molecules produced by B cells as a primary immune defense, each kind having a uniquely shaped site that combines with a foreign antigen, as of a virus or bacterium, and disables it. 2. antibodies of a particular type collectively."}, {"url": "http://www.thefreedictionary.com/clonotypic+antibody", "passage_text": "an•ti•bod•y. 1. any of numerous protein molecules produced by B cells as a primary immune defense, each kind having a uniquely shaped site that combines with a foreign antigen, as of a virus or bacterium, and disables it. 2. antibodies of a particular type collectively. Also called immunoglobulin"}, {"url": "http://www.thefreedictionary.com/clonotypic+antibody", "passage_text": "A protein produced in the blood or tissues in response to the presence of a specific foreign antigen. Antibodies provide immunity against certain microorganisms and toxins by binding with them and often by deactivating them. Also called immunoglobulin. 1. any of numerous protein molecules produced by B cells as a primary immune defense, each kind having a uniquely shaped site that combines with a foreign antigen, as of a virus or bacterium, and disables it."}, {"url": "http://www.thefreedictionary.com/clonotypic+antibody", "passage_text": "A Y-shaped protein on the surface of B cells that is secreted into the blood or lymph in response to an antigenic stimulus, such as a bacterium, virus, parasite, or transplanted organ, and that neutralizes the antigen by binding specifically to it; an immunoglobulin. 1. any of numerous protein molecules produced by B cells as a primary immune defense, each kind having a uniquely shaped site that combines with a foreign antigen, as of a virus or bacterium, and disables it."}, {"url": "http://medical-dictionary.thefreedictionary.com/immune+antibody", "passage_text": "antibody. an immunoglobulin molecule having a specific amino acid sequence that gives each antibody the ability to adhere to and interact only with the antigen that induced its synthesis. This antigen-specific property of the antibody is the basis of the antigen-antibody reaction that is essential to an immune response. The antigen-antibody reaction begins as soon as substances interpreted as foreign invaders gain entrance into the body. See also immunity. circulating antibody (usually IgG) that reacts preferentially with an antigen, preventing it from reacting with a cell-bound antibody (IgE) and blocking the induction of anaphylaxis. antibody classes. see immunoglobulin. clonotypic antibody. clone specif"}, {"url": "https://en.wikipedia.org/wiki/Immunosenescence", "passage_text": "Immunosenescence refers to the gradual deterioration of the immune system brought on by natural age advancement. It involves both the host’s capacity to respond to infections and the development of long-term immune memory, especially by vaccination. This age-associated immune deficiency is ubiquitous and found in both long-and short-living species as a function of their age relative to life expectancy rather than chronological time. It is considered a major contributory factor to the increased frequency of morbidity and mortality among the elderly."}, {"url": "http://medical-dictionary.thefreedictionary.com/clonotypic+antibody", "passage_text": "Immunology An immunoglobulin produced by plasma cells, which has a specific amino acid sequence and specifically binds to the antigen(s)–eg, foreign proteins, microbes or toxins, that induced its synthesis; antibodies may bind to closely related antigens. Antibody production, its interaction with a specific antigen, and the activation of complement (C), an interrelated group of eleven proteins, are the major components of the humoral system of immunity."}, {"url": "http://medical-dictionary.thefreedictionary.com/clonotypic+antibody", "passage_text": "antibody. an immunoglobulin molecule having a specific amino acid sequence that gives each antibody the ability to adhere to and interact only with the antigen that induced its synthesis. This antigen-specific property of the antibody is the basis of the antigen-antibody reaction that is essential to an immune response. Antibody production, its interaction with a specific antigen, and the activation of complement (C), an interrelated group of eleven proteins, are the major components of the humoral system of immunity."}, {"url": "http://medical-dictionary.thefreedictionary.com/clonotypic+antibody", "passage_text": "An immunoglobulin produced by plasma cells, which has a specific amino acid sequence and specifically binds to the antigen(s) (e.g., foreign proteins, microbes or toxins) that induced its synthesis; antibodies may also bind to closely related antigens. Antibody production, its interaction with a specific antigen, and the activation of complement (C), an interrelated group of eleven proteins, are the major components of the humoral system of immunity."}]