[{"url": "https://www.liftmaster.com/For-Homes/Accessories/Wireless-Keyless-Entry-System/model-377LM", "passage_text": "Access your garage and home without the use of a key or a remote control. The LiftMaster® Security+® Wireless Keyless Entry can open your garage door using a code that you program directly into the unit."}, {"url": "http://absolutedoor.net/info/operator-programming/", "passage_text": "1 Press and release the “smart” button on garage door opener motor unit. 2  The smart indicator light will glow steadily for 30 seconds. 3  Within 30 seconds, enter a four digit personal identification number (PIN) of your choice on the keypad."}, {"url": "http://www.waynedaltonparts.com/assets/images/PDF/Instructions/WD-KEP4.pdf", "passage_text": "The Wireless Keyless entry, uses a state of the art rolling code radio frequency (RF) transmitter to control compatible peripherals.Your new Wireless Keyless Entry can open and close your garage door when used with a Wayne-Dalton idrive ® or prodrive, garage door opener."}, {"url": "https://www.liftmaster.com/For-Homes/Accessories/Wireless-Keyless-Entry-System/model-377LM", "passage_text": "Add to Cart. Add to Wishlist. Get the added convenience of being able to open your garage door without using a remote control or key. This wireless keyless entry system opens the garage door by a code that you program directly into the unit."}, {"url": "http://www.overheaddooronline.com/blog/bid/96469/Programming-Overhead-Door-Remote-Controls", "passage_text": "When you need to program a remote control into an Overhead Door Code Dodger garage door opener manufactured between November 1995 and 1997 there are specific remote controls that can be programmed."}, {"url": "http://www.amazon.com/Liftmaster-378LM-Wireless-Secondary-Control/dp/B00283XTYG", "passage_text": "I mounted this wireless secondary remote control inside my house, about 50' from the garage. It programmed very easily to the Liftmaster Security+ garage door opener. Just press the learn button on the garage door opener and then press the big button on this remote and it is programmed. Very easy."}, {"url": "http://www.youtube.com/watch?v=8cGTtP9MdCE", "passage_text": "The Go Control Panel is an excellence choice for an easy alarm and some home automation items. The Go Control panel controls 3 items via Zwave: Lights, Door Locks, and Thermostats."}]