[{"url": "http://www.courts.ca.gov/9616.htm", "passage_text": "Suing a person. When you sue a person, you file your lawsuit against that person, using their legal name and any aliases. You also need that person’s address. Often, it is easy to get this information if you do not already have it, by looking at any paperwork you may have about the legal dispute."}, {"url": "http://www.thenewsmanual.net/Manuals%20Volume%203/volume3_69.htm", "passage_text": "The law not only tries to protect a person's good name or reputation, it also tries to protect their livelihood against damage by false claims. If, because of a false statement, a shopkeeper loses customers, an accountant loses clients or a policeman loses his job, they can sue for defamation."}, {"url": "http://www.dmlp.org/legal-guide/using-name-or-likeness-another", "passage_text": "If you use someone's name or likeness in connection with news reporting, commentary, or a creative work protected by the First Amendment, then you can also use it in connection with truthful advertising of your own work. Courts refer to this as the incidental use doctrine."}, {"url": "http://www.courts.ca.gov/9616.htm", "passage_text": "You cannot just be a person who was standing nearby and sue the person who caused the accident if you did not suffer any damages. In the cases this website deals with, standing to sue is very clear. A landlord can sue a tenant to evict him or her. One spouse can take the other one to court for divorce."}, {"url": "http://www.courts.ca.gov/9616.htm", "passage_text": "First, you need to figure out whether you have the right to file a lawsuit against the person or business you have a dispute with. To file a lawsuit in court, you have to be someone directly affected by the legal dispute you are suing about. In legal terms, this is called having “standing” to file the lawsuit."}, {"url": "http://www.worldlawdirect.com/article/342/what-you-need-know-before-you-sue-someone.html", "passage_text": "What you need to know before you sue someone. By WORLD Law Direct [January 12th, 2011]. Think hard before you rush off to the court clerk's office to file a lawsuit. The idea of victory may tempt you, but as you probably know, lawsuits can be expensive, time-consuming and emotionally draining. It's far better to resolve your disputes out of court."}, {"url": "http://www.thenewsmanual.net/Manuals%20Volume%203/volume3_69.htm", "passage_text": "If someone complains to the court that you have defamed them, they are called the plaintiff. Because defamation is usually a civil wrong, when people take court action, they are said to sue for defamation. Before the mass media became so important, defamation was usually done by word of mouth, often by rumour or gossip."}]