[{"url": "http://www.joeskitchen.com/chile/2012/03/07/symbols-of-chile/", "passage_text": "Symbols of Chile on the Flag. The Chilean flag is also rich in symbolism. The red on the Chilean flag represents the blood spilled in its fight for independence. The white represents the snow-covered Andes that guard the eastern border of Chile. The blue is for the color of the sky."}, {"url": "http://www.enchantedlearning.com/southamerica/chile/flag/", "passage_text": "Maps. Flags. Chile's flag is a red, white and blue banner with a white star. The blue square in the canton region of the flag represents the sky, the white stripe represents the snow of the Andes mountains, and the red symbolizes the blood that was spilled fighting for freedom. The single star represents the powers of the government. The height of the flag is two-thirds the width"}, {"url": "http://chileflag.facts.co/chileflagof/chileflag.php", "passage_text": "Chile Flag-facts. The current flag was adopted on 18 October 1817. The colors of the Flag of the Transition were rearranged and, with an inspitation from the American flag, a star was added in the blue canton to represent an independent state. The Chilean flag is also known in Spanish as 'La Estrella Solitaria' (The Lone Star)"}, {"url": "https://en.wikipedia.org/wiki/Flag_of_Chile", "passage_text": "(October 2007). The national flag of Chile, consists of two unequal horizontal bands of white and red and a blue square the same height as the white band in the canton, which bears a white five-pointed star in the center. It was adopted on October 18, 1817. The flag of the U.S. state of Texas is similar to the Chilean flag. The flag of Texas was designed and adopted on 25 January 1839; whereas Chile's flag was adopted 22 years earlier on 18 October 1817."}, {"url": "http://www.donquijote.org/culture/chile/history/chile-flag", "passage_text": "Flag of Chile. Chilean flag comprises of two horizontal stripes of red and white, with a blue square on the left-hand corner which consists of a five pointed white star. Read the Spanish version. "}, {"url": "http://www.worldflags101.com/c/chile-flag.aspx", "passage_text": "The Chilean flag consists of two vertical stripes of equal height. The top stripe is white and the bottom one is red. In the top left hand corner of the flag, over the white stripe, sits a blue square of the same height as the white stripe. In the middle of the blue square is a white five-pointed star. The star on the flag stresses the fact that Chile is a Unitarian republic, and not a federal republic. Chilean Flag History: The Chilean flag was adopted on October 18, 1817, making it one of the oldest flags in the world. Chile gained independence from Spain on February 12, 1818."}, {"url": "http://www.mapsofworld.com/flags/chile-flag.html", "passage_text": "The white part of the Chile flag represents the snow covered Andes mountain range. The red band in the flag represents blood shed by the national heroes in the prolonged struggle for freedom in Chile. The white star is a symbol of honor and pride and the blue square signifies the clear blue skies of Chile. The first flag of Chile was adopted in 1817 after it achieved independence from Spain"}, {"url": "http://chileflag.facts.co/chileflagof/chileflag.php", "passage_text": "Chile Flag-Information. The national flag of Chile, consists of two unequal horizontal bands of white and red and a blue square the same height as the white band in the canton, which bears a white five-pointed star in the center. Chile Flag colors symbolism. blue stands for the sky and the Pacific Ocean. The current flag was adopted on 18 October 1817. The colors of the Flag of the Transition were rearranged and, with an inspitation from the American flag, a star was added in the blue canton to represent an independent state."}, {"url": "http://www.worldflags101.com/c/chile-flag.aspx", "passage_text": "Chilean Flag Meaning: The red stripe represents the blood of patriots who fought for Chile's independence. The white stripe symbolizes the snow of the Andes Mountains; while the blue stripe represents the sky. The star on the flag stresses the fact that Chile is a Unitarian republic, and not a federal republic. Chilean Flag History: The Chilean flag was adopted on October 18, 1817, making it one of the oldest flags in the world. Chile gained independence from Spain on February 12, 1818."}]