[{"url": "http://homeguides.sfgate.com/long-marigolds-germinate-77848.html", "passage_text": "Depending on the variety, marigolds can grow 8 to 40 inches tall, and develop blooms that can range in size from 1 to 5 inches. For germination within about five to 10 days, start the seeds indoors six weeks before the last spring frost and expose them to ideal conditions."}, {"url": "http://www.almanac.com/plant/marigolds", "passage_text": "1 Marigolds need lots of sunshine. 2  Though they grow in almost any soil, marigolds thrive in moderately fertile, well-drained soil. 3  Sow them directly into the garden once the soil is warm, or start seeds indoors about a month to 6 weeks before the last spring-frost date."}, {"url": "http://www.almanac.com/plant/marigolds", "passage_text": "1 Though they grow in almost any soil, marigolds thrive in moderately fertile, well-drained soil. 2  Sow them directly into the garden once the soil is warm, or start seeds indoors about a month to 6 weeks before the last spring-frost date."}, {"url": "http://2007.runescape.wikia.com/wiki/Marigolds", "passage_text": "Growing marigolds in a Farming plot requires a weeded plot, marigold seed, a seed dibber, and level 2 Farming. Marigolds take 17.5 minutes to grow. They are a great way to make an early profit from Farming, as they only require level 2, the seeds are cheap, they grow moderately quickly, and they sell high."}, {"url": "http://2007.runescape.wikia.com/wiki/Marigolds", "passage_text": "Marigolds are flowers that can be planted in a flower patch with the Farming skill using marigold seeds. They are used as the protection payment for growing hammerstone hops. Planting marigolds in a Farming flower plot will protect potato, onion, and tomato allotments from disease."}, {"url": "http://homeguides.sfgate.com/long-until-marigolds-flower-seed-67615.html", "passage_text": "This will improve soil drainage and fertility. Plant marigold seeds in the soil 1/4 inch deep and water the area deeply. The appropriate spacing for marigolds depends on the mature size of the plant. French marigolds (Tagetes patula) are smaller plants and can be spaced 6 to 9 inches apart. The larger African marigolds (Tagetes erecta) need around 18 inches of space between plants."}, {"url": "http://homeguides.sfgate.com/long-until-marigolds-flower-seed-67615.html", "passage_text": "Marigolds take around 45 to 50 days to flower after you plant seeds, so seeds sown in early April should flower by May."}, {"url": "http://homeguides.sfgate.com/long-marigolds-germinate-77848.html", "passage_text": "Marigold seeds can germinate in light and darkness as long as they're exposed to a temperature of 70 degrees Fahrenheit. During the germination period, remove the plastic daily to aerate the tray and check the soil moisture. If needed, moisten the medium with a water-filled spray bottle to avoid washing away the seeds."}]