[{"url": "http://www.kew.org/science-conservation/plants-fungi/fungi/about", "passage_text": "Fungi are not plants. Well, at least since 1969 when they were first officially recognized as a distinct group. And more recently, using DNA sequences and comparisons of cell structure, we have learned that Fungi are in fact more closely related to animals than they are to plants. Fungi v fungi. First, let’s be clear: fungi and Fungi mean different things. The lower case 'fungi' is a general word that refers to organisms that all look and act the same, but are not all related."}, {"url": "https://answers.yahoo.com/question/index?qid=20110214120937AAP1xKG", "passage_text": "I'll won't say that they are more related to animals than to plants it is a border organism, but who knows... maybe in terms of genetics they are more appropiate to animals. zeevs_md · 5 years ago. Thumbs up. - Fungi store their food as glycogen (like animals) while plants and green algae store their food as starch. -- Fungi are decomposers primarily. Fungi are the only Eukarya that can decompose cellulose, lignin & keratin because they are the only eukaryotic osmotrophs."}, {"url": "https://answers.yahoo.com/question/index?qid=20101231180951AAFfwBo", "passage_text": "In other words, animals have a more recent common ancestor with fungi than with plants, and the mushrooms in your salad are more closely related to you than to the lettuce. Some fungi are single-celled organisms, such as the yeasts. Cladistic analysis has demonstrated that despite the differences, animals and fungi are more closely related to each other than they are to plants. The most obvious similarity between fungi and animals is their trophic level, that is, their place in the food chain. Neither fungi nor animals are producers as plants are."}, {"url": "http://www.brighthubeducation.com/science-homework-help/8061-relationship-between-animal-plant-and-fungi-phylogeny/", "passage_text": "Cladistic analysis has demonstrated that despite the differences, animals and fungi are more closely related to each other than they are to plants. Many fungi are superficially plant-like organisms. They grow visible structures that resemble plants or plant parts. On a microscopic level, plants and fungi both have cell walls, a feature that metazoan (animal) cells lack. The study of cladistics, however, results in a phylogeny tree in which fungi are more closely related to animals than to plants. In other words, animals have a more recent common ancestor with fungi than with plants, and the mushrooms in your salad are more closely related to you than to the lettuce. slide 2 of 5"}, {"url": "https://answers.yahoo.com/question/index?qid=20101231180951AAFfwBo", "passage_text": "Best Answer: Fungi and plants may look similar, but they are not closely related. In fact, fungi are more closely related to animals than to plants. Animals, plants, and fungi are the three major multicellular groups of the domain Eukaryota. Cladistic analysis has demonstrated that despite the differences, animals and fungi are more closely related to each other than they are to plants. The most obvious similarity between fungi and animals is their trophic level, that is, their place in the food chain. Neither fungi nor animals are producers as plants are."}, {"url": "http://www.mhhe.com/biosci/genbio/life/articles/article32.mhtml", "passage_text": "In l987, Thomas Cavalier-Smith suggested in Evolutionary Biology of the Fungi (Cambridge University Press, New York) that fungi are more closely related to animals than plants based on biochemical and ultrastructural criteria, such as complex biosynthetic pathways and the structure of cristae in mitochondria. They do not photosynthesize as do plants. Fungi are also distinguished by their ability to form spores and their lack of undulipodia, which are structures that provide cell motility in protists. Fungi are clearly not too closely related to plants."}, {"url": "http://www.nytimes.com/1993/04/16/us/animals-and-fungi-evolutionary-tie.html", "passage_text": "They may seem awfully vegetative in their habits, and the university researchers who study them may often be counted as members of the botany department, but fungi are turning out to be far more closely related to animals than to plants, scientists say. "}, {"url": "http://www.naturalnews.com/044200_fungi_animals_plants.html", "passage_text": "But fungi are actually an entirely separate kingdom of living beings, on the same level of classification as bacteria, plants and animals -- and genetic analysis shows that they are more closely related to animals than to plants! Thus, fungi are primarily biomass consumers rather than producers, whereas plants tend to produce more biomass than they consume. Another major difference separating fungi from plants is that all plants have a complex root system and usually have other structures such as stems and leaves."}]