[{"url": "http://www.dogs-and-dog-advice.com/chihuahua/", "passage_text": "The Chihuahua dog breed is a tiny, loving and affectionate dog that tends to be very playful and funny. Their small size makes them popular as companion dogs. They generally focus intensely on one to two people, making them a favored breed for older couples. Chihuahua Temperament. The Chi is fiercely loyal to one or two people and they thrive on huge amounts of attention. These little, fragile dogs are not very suitable for younger children, but will do better with older, more mature children."}, {"url": "http://dogtime.com/dog-breeds/chihuahua", "passage_text": "The Chihuahua dog breed 's charms include his small size, outsize personality, and variety in coat types and colors. He's all dog, fully capable of competing in dog sports such as agility and obedience, and is among the top 10 watchdogs recommended by experts. The Chihuahua's personality and unique size make him a wonderful go-everywhere companion. People who live with Chihuahuas become devoted to them, and many say that once you share your life with one, there will be no other dog breed for you."}, {"url": "http://www.dogs-and-dog-advice.com/chihuahua/", "passage_text": "While Chihuahuas can be good watch dogs, they can also be very timid as the dog’s temperament varies greatly from dog to dog. They are a fairly “low maintenance” dog, with exercise needs being met running from room to room within a house. The Chi, as they are often known, is the smallest breed of dog. Chihuahua Temperament. The Chi is fiercely loyal to one or two people and they thrive on huge amounts of attention. These little, fragile dogs are not very suitable for younger children, but will do better with older, more mature children."}, {"url": "http://www.bluechihuahua.net/chihuahua-temperament-and-traits/", "passage_text": "Chihuahua Temperament and Traits. The Chihuahua is the smallest of the toy breeds. An energetic, small and fragile dog, the Chihuahua typically has a rounded skull (often called an “apple head”) and large, dark eyes. The two types are the smooth-coated Chihuahua and long-coated Chihuahua"}, {"url": "http://www.chiwawadog.com/temperament.html", "passage_text": "With any breed of dog, temperament is something that can be altered by the environment in which the dog is brought up. With the Chihuahua's temperament there is additional care required to make sure that the dog grows to become a well behaved member of the family. The fact that they are small does not take away from their quick movements and eager personalities. Chihuahua's tend to recognize their own breed of dog, but do not tolerate other dogs as easily as they do their own. They are even aggressive with larger dogs so it is important to socialize a Chihuahua as a puppy in order to bring down the aggressive qualities towards other dogs."}, {"url": "http://www.yourpurebredpuppy.com/reviews/chihuahuas.html", "passage_text": "Copyright © 2000-2015. Chihuahuas are comical, entertaining, and loyal little dogs, absolutely brimming with personality – often a quirky and eccentric personality unmatched by any other breed. Other than that generalization, Chihuahuas are extremely variable. You can find individuals who are lively or placid. Bold or timid. As I explained, Chihuahuas often inherit genes for a bad temperament.....because so many people breed Chihuahuas whose temperaments are bad. In addition, many people treat their Chihuahua like a stuffed toy or doll, or as a substitute for a human infant."}, {"url": "http://www.petwave.com/Dogs/Breeds/Chihuahua/Personality.aspx", "passage_text": "Personality. Small and sassy, the Chihuahua is the tiniest of all dog breeds, often weighing in at less than four pounds. Their personalities are varied, ranging from shy and timid to plucky and outgoing. All Chihuahuas are fiercely loyal to the people they love, and eat up as much attention as they can get. The ease of training a Chihuahua depends upon the dog itself, and it's own particular bloodline. Whereas some dogs can be trained out of fearfulness, timidity, aggression or rowdy behavioral, a Chihuahua's temperament is determined solely on his genetics."}, {"url": "http://www.yourpurebredpuppy.com/reviews/chihuahuas.html", "passage_text": "Chihuahuas: the most honest dog breed review you'll ever find about Chihuahua temperament, personality, behavior, traits, and characteristics. As I explained, Chihuahuas often inherit genes for a bad temperament.....because so many people breed Chihuahuas whose temperaments are bad. In addition, many people treat their Chihuahua like a stuffed toy or doll, or as a substitute for a human infant."}, {"url": "http://www.chiwawadog.com/temperament.html", "passage_text": "Chihuahua Temperament & Personality. The Chihuahua has quite a good temperament. They make excellent companion dogs, and are very courageous, lively, proud, and most of all, enterprising. Many people enjoy their Chihuahua's for a lot of different reasons. Chihuahua's tend to recognize their own breed of dog, but do not tolerate other dogs as easily as they do their own. They are even aggressive with larger dogs so it is important to socialize a Chihuahua as a puppy in order to bring down the aggressive qualities towards other dogs."}, {"url": "http://wikibin.org/articles/corgi-chihuahua.html", "passage_text": "Being a mixed breed, it is not entirely possible to describe the temperament of the Corgi/Chihuahua. However, the known specimens have shown the intelligence and friendliness of the Corgi and the laid-back lap dog attitude of the Chihuahua. "}]