[{"url": "http://earthobservatory.nasa.gov/IOTD/view.php?id=5270", "passage_text": "NASA Earth Observatory. download large image (4 MB, PDF). Methane is an important trace gas in Earth’s atmosphere. Even though it only makes up 0.00017% (1.7 parts per million by volume) of the the atmosphere, methane traps a significant amount of heat, helping the planet remain warm and habitable. "}, {"url": "http://www.nlaurell.com/natural-gas-overview-why-is-methane-a-clean-fuel/", "passage_text": "It should be noted that methane, by itself, when released into the atmosphere, is a potent greenhouse gas. It captures heat [70 times] better and thus, by weight, is 70 times as dangerous as carbon dioxide. This is why it’s so important to flare methane to ensure that it is completely combusted into carbon dioxide. Introduction to Methane. What we call natural gas is mostly the chemical compound methane (95% or more; the rest is ethane or longer carbon chains). Methane, which comes out of the ground as a gas, is produced when microorganisms known as methanogens feed on organic matter in environments with little or no oxygen."}, {"url": "http://www.mnn.com/earth-matters/energy/stories/what-is-methane-and-why-should-you-care", "passage_text": "But at the same time, methane — especially as a component of natural gas — is an important fuel source, one that produces fewer greenhouse gases when it is burned than coal or oil. Methane's potential as energy. Methane is rapidly become the go-to way to power the world. Methane's risk to the climate. Unfortunately, burning natural gas for fuel releases methane into the atmosphere, where it contributes to climate change. Meanwhile, the very production of natural gas is also a methane risk, as much of the gas escapes during the fossil fuel exploration process."}, {"url": "http://www.answers.com/Q/Why_is_methane_an_important_discovery", "passage_text": "Methane is important it is used in electrical generations to burn  it as fuel in steam generators or gas turbines. It is also the  primary component of natural gas. Edit. Share to: Answered. Making the world better, one answer at a time. Methane is a very important discovery, because all animals produce it, and it is very deadly. No joke. If you are in a barn that is not ventilated, with 1 cow, then you will die within 48 hours if you do not get any fresh air."}, {"url": "https://en.wikipedia.org/wiki/Methanogenesis", "passage_text": "Methane in the Earth's atmosphere is an important greenhouse gas with a global warming potential 25 times greater than carbon dioxide (averaged over 100 years), and methanogenesis in livestock and the decay of organic material is thus a considerable contributor to global warming. "}, {"url": "http://earthguide.ucsd.edu/virtualmuseum/climatechange1/03_3.shtml", "passage_text": "Methane (CH4) is a greenhouse gas. It affects the radiation budget of Earth directly (by intercepting heat radiation) but also indirectly, by reacting with other trace gases in the atmosphere, and by delivering water molecules upon oxidation in the stratosphere. Methane is relatively short-lived in the atmosphere; a molecule of methane is oxidized to water and carbon dioxide within a decade or so, mainly by reaction with another trace gas, the hydroxyl radical OH-."}, {"url": "http://www.answers.com/Q/Why_is_methane_important", "passage_text": "Methane is a chemical compound with the chemical formula CH4. It is the simplest alkane, and the principal component of natural gas. Methane's bond angles are 109.5 degrees. B … urning methane in the presence of oxygen produces carbon dioxide and water. The relative abundance of methane makes it an attractive fuel. Split and merge into it. Answered by The Community. Making the world better, one answer at a time. Methane is important it is used in electrical generations to burn it as fuel in steam generators or gas turbines. It is also the primary component of natural gas."}]