[{"url": "http://www.medicinenet.com/script/main/art.asp?articlekey=9300", "passage_text": "Perspiration: 1) The secretion of fluid by the sweat (sudoriferous) glands. These small, tubular glands are situated within the skin, as well as in the subcutaneous tissue under it. They discharge their fluid through tiny openings in the surface of the skin. Perspiration serves at least two purposes: the removal of waste products such as urea and ammonia, and cooling of the body temperature as sweat evaporates. 2) The transparent, colorless, acidic fluid secreted by the sweat glands. It contains some fatty acids and mineral matter"}, {"url": "http://health.howstuffworks.com/skin-care/information/anatomy/skin-eliminate-waste.htm", "passage_text": "Only tiny amounts of toxins and waste products, like the ammonia and urea mentioned above, are found in sweat. Sweat itself has no odor. The smelly effect is the fault of apocrine glands located in the groin, armpits and other hairy body parts. Sweat glands in the skin also play active roles in the excretory system, or the organs and glands that flush out toxins and excess minerals from the body. Dead skin cells are a form of bodily waste that facilitates the growth of new epidermal cells."}, {"url": "http://www.answers.com/Q/What_wastes_are_released_by_sweating", "passage_text": "salt is eliminated through perspiration that's why you have a salty taste when you sweat As your body excretes the sweat to cool you off from the sweat glands, toxins and wastes are carried by the blood and through the skin to the sweat glands, where they go out in the droplet of sweat. Share to: Sweat glands generally release water, salts (mostly NaCl), and urea (a waste product of protein degradation in the liver). Sweat also contains small amounts of 2-methylphenol … and 4-methylphenol (also known as o-cresol and p-cresol, respectively) which are responsible for much of the unpleasant odor."}, {"url": "http://www.livestrong.com/article/107755-causes-strong-smelling-perspiration/", "passage_text": "Bacteria. The primary cause of strong-smelling perspiration is bacterial flora. Sweat is naturally odorless, but when it reaches the skin's surface, bacteria that normally live on the skin digest sweat and excrete the strong-smelling waste associated with smelly sweat. Bacteria break down the sweat produced by the apocrine sweat glands. Eccrine sweat is made up, mostly, of water and certain salts"}, {"url": "http://chemistry.about.com/od/chemicalcomposition/f/What-Is-The-Chemical-Composition-Of-Human-Sweat-Or-Perspiration.htm", "passage_text": "The main reason people perspire is so evaporation of water can cool the body. Therefore, it makes sense that the main component of perspiration is water. However, perspiration also plays a role in excretion of toxins and waste products. Sweat is chemically similar to the plasma, but certain components are selectively retained or excreted. Perspiration consists of water, minerals, lactate and urea. On average, the mineral composition is: Trace metals that the body excretes in sweat include: Sweat mineral-element responses during 7 h of exercise-heat stress, Int J Sport Nutr Exerc Metab 2007 Dec;17(6):574-82. By Anne Marie Helmenstine, Ph.D."}, {"url": "https://en.wikipedia.org/wiki/Perspiration", "passage_text": "Perspiration, also known as sweating or diaphoresis, is the production of fluids secreted by the sweat glands in the skin of mammals. "}, {"url": "http://medical-dictionary.thefreedictionary.com/excretion", "passage_text": "2. waste material eliminated from the body, including feces, urine, and sweat. Mucus and carbon dioxide also can be considered excretions. The organs of excretion are the intestinal tract, kidneys, lungs, and skin. Called also excreta. adj., adj ex´cretory. "}, {"url": "http://medical-dictionary.thefreedictionary.com/perspiration", "passage_text": "1 the act or process of perspiring; the excretion of fluid by the sweat glands through pores in the skin. 2 the fluid excreted by the sweat glands, consisting of water containing sodium chloride, phosphate, urea, ammonia, and other waste products. Perspiration serves as a mechanism for excretion and for regulation of body temperature. "}, {"url": "http://health.howstuffworks.com/skin-care/information/anatomy/skin-eliminate-waste.htm", "passage_text": "Eccrine sweat is almost entirely water with a little salt and potassium, but it also contains trace amounts of ammonia, uric acid and urea -- all waste byproducts of the body's metabolism of nitrogen [source: Huang, et al. Sweat glands in the skin also play active roles in the excretory system, or the organs and glands that flush out toxins and excess minerals from the body. Dead skin cells are a form of bodily waste that facilitates the growth of new epidermal cells."}, {"url": "http://www.answers.com/Q/What_wastes_are_released_by_sweating", "passage_text": "Sweating (also called perspiration or sometimes transpiration) is the loss of a watery fluid, consisting mainly of sodium chloride (commonly known as salt) and urea in solution, that is secreted by the sweat glands in the skin of mammals. Sweat also consist of the chemicals or odorants 2-methylphenol and 4-methylphenol. Share to: Sweat glands generally release water, salts (mostly NaCl), and urea (a waste product of protein degradation in the liver). Sweat also contains small amounts of 2-methylphenol … and 4-methylphenol (also known as o-cresol and p-cresol, respectively) which are responsible for much of the unpleasant odor."}]