[{"url": "http://www.lhsc.on.ca/Health_Professionals/Wound_Care/discuss/hip.htm", "passage_text": "(Unstageable/Unclassified). Goals of treatment: 1  to deal with local infection (infection in this wound is indicated by; pain at wound site, reddened periwound skin, green/yellow exudate with odour, thick yellow slough on wound bed). 2  debride wound"}, {"url": "http://oceanservice.noaa.gov/facts/slough.html", "passage_text": "A slough is a swamp or shallow lake system, usually a backwater to a larger body of water. The Elkhorn Slough NERR is a narrow meandering inlet located off Monterey Bay on California's central coast (Image credit: Elkhorn Slough NERR). A slough (pronounced slew) is typically used to describe wetlands. "}, {"url": "http://www.woundsource.com/blog/identifying-types-tissues-found-pressure-ulcers", "passage_text": "by the WoundSource Editors. Over the course of a wound’s existence, several tissue types can be identified. In order to properly stage an ulcer and determine the best treatment option, it is important for the clinician to be able to determine the tissue type that is present. The following represent the most commonly identified tissue types seen in pressure ulcers, and also in other open wounds: Professionals involved in describing and treating pressure ulcers must be able to differentiate among epithelium, granulation tissue, slough and eschar in order to ensure that pressure wounds are treated accordingly and safely. Tissue identification is also important to note in the healing progress of a wound."}, {"url": "http://www.ehow.com/how_7366691_remove-slough-wound.html", "passage_text": "flesh wound image by Allyson Ricketts from Fotolia.com. In the context of wounds, slough is dead skin tissue that may have a yellow or white appearance. It is important to remove this tissue to prevent infection and promote healing. Infection can lead to death of the surrounding tissues (necrosis), which can be very dangerous to the patient. The technical term for the removal of slough is debridement. Take the rolled up dry gauze and completely cover the damp gauze, using medical tape to secure it in place. Leave the wound alone for 24 hours, then remove the dressing. Repeat this process every 24 hours until all traces of slough have been removed and the wound is clean and healing up nicely."}, {"url": "https://en.wikipedia.org/wiki/Eschar", "passage_text": "An eschar (/ˈɛskɑr/ ; Greek: eschara) is a slough or piece of dead tissue that is cast off from the surface of the skin, particularly after a burn injury, but also seen in gangrene, ulcer, fungal infections, necrotizing spider bite wounds, and exposure to cutaneous anthrax. Eschar is sometimes called a black wound because the wound is covered with thick, dry, black necrotic tissue. Eschar may be allowed to slough off naturally, or it may require surgical removal (debridement) to prevent infection, especially in immunocompromised patients (e.g. if a skin graft is to be conducted)."}, {"url": "http://www.woundsource.com/blog/identifying-types-tissues-found-pressure-ulcers", "passage_text": "This can be a costly mistake, due to the fact that slough is non-viable tissue and requires debridement. When a large amount of slough is present and obscures the wound bed, the wound is unstageable. Slough can be identified as a stringy mass that may or may not be firmly attached to surrounding tissue. Slough can range in color from white (scant bacterial colonization) to yellow or green (larger bacterial counts) to brown (hemoglobin is present). Professionals involved in describing and treating pressure ulcers must be able to differentiate among epithelium, granulation tissue, slough and eschar in order to ensure that pressure wounds are treated accordingly and safely. Tissue identification is also important to note in the healing progress of a wound."}, {"url": "http://www.lhsc.on.ca/Health_Professionals/Wound_Care/discuss/hip.htm", "passage_text": "Things to keep in mind: 1  this wound is a Unstageable/Unclassified because the wound bed cannot be visualized. 2  infection can be managed at a local level. 3  pain management with dressing changes is essential. 4  remove or prevent pressure on the area. Goals of treatment: 1  to deal with local infection (infection in this wound is indicated by; pain at wound site, reddened periwound skin, green/yellow exudate with odour, thick yellow slough on wound bed)."}, {"url": "http://medical-dictionary.thefreedictionary.com/slough", "passage_text": "slough. n. A layer or mass of dead tissue separated from surrounding living tissue, as in a wound, a sore, or an inflammation. v. To separate from surrounding living tissue. 1. a mass of dead tissue in, or cast out from, living tissue. 2. to shed or cast off. anesthetic slough. the iatrogenic slough caused by the injection of a necrotizing anesthetic solution subcutaneously in mistake for an intravenous injection. The common sites are over the anterior aspect of the forearm in small animals and over the jugular furrow in large animals"}]