[{"url": "http://accountingexplained.com/misc/corporate-finance/wacc", "passage_text": "In the formula for WACC, r(E) is the cost of equity i.e. the required rate of return on common stock of the company. It is the minimum rate of return which a company must earn to keep its common stock price from falling. After-tax cost of debt. In the WACC formula, r(D) × (1 – t) represents the after-tax cost of debt i.e. the after-tax rate of return which the debt-holders need to earn till the maturity of the debt. Cost of debt of a company is based on the yield to maturity of the relevant instruments."}, {"url": "http://accountingexplained.com/misc/corporate-finance/wacc", "passage_text": "Weighted Average Cost of Capital. Weighted average cost of capital (WACC) is the average of the minimum after-tax required rate of return which a company must earn for all of its security holders (i.e. common stock-holders, preferred stock-holders and debt-holders). After-tax cost of debt. In the WACC formula, r(D) × (1 – t) represents the after-tax cost of debt i.e. the after-tax rate of return which the debt-holders need to earn till the maturity of the debt. Cost of debt of a company is based on the yield to maturity of the relevant instruments."}, {"url": "https://en.wikipedia.org/wiki/Weighted_average_cost_of_capital", "passage_text": "(Discuss) Proposed since July 2015. The weighted average cost of capital (WACC) is the rate that a company is expected to pay on average to all its security holders to finance its assets. The WACC is commonly referred to as the firm’s cost of capital. Importantly, it is dictated by the external market and not by management. "}, {"url": "http://bizfinance.about.com/od/cost-of-capital/a/Calculate-Weighted-Average-Cost-Of-Capital.htm", "passage_text": "The weighted average cost of capital is the average interest rate a company must pay to finance its assets. As such, it is also the minimum average rate of return it must earn on its current assets to satisfy its shareholders or owners, its investors, and its creditors. WACC = .50(5.85) + .50(6.5) = 6.175%. If your company uses debt and equity financing in the way suggested above, the company's weighted average cost of capital will be 6.175%. If you add other sources of financing, you will need to add their component costs, such as that for new equity or preferred stock."}, {"url": "http://www.taskmanagementsoft.com/products/taskmanagerpro/tutorials/customization-guide/cost-of-goods-sold-cogs-by-the-weighted-average-method.php", "passage_text": "Using the Weighted Average Method every unit sold would have the same Average Cost per Units Sold irrespective of the actual cost this unit is sold. For example, you sell books. The weighted average cost is $30.00 USD per book ($4500 USD/150 books according to the formula above used to calculate Average Cost per Unit). So the inventory price $30 USD will be the same for each book bought, the actual price of one book is $27 USD while another book was sold at $32 USD."}, {"url": "http://www.investopedia.com/ask/answers/063014/what-formula-calculating-weighted-average-cost-capital-wacc.asp", "passage_text": "Weighted average cost of capital (WACC) is the average after-tax cost of a company’s various capital sources, including common stock, preferred stock, bonds and any other long-term debt. A company has two primary sources of financing-debt and equity-and, in simple terms, WACC is the average cost of raising that money. "}, {"url": "http://www.investopedia.com/terms/w/wacc.asp", "passage_text": "Weighted average cost of capital (WACC) is a calculation of a firm's cost of capital in which each category of capital is proportionately weighted. All sources of capital, including common stock, preferred stock, bonds and any other long-term debt, are included in a WACC calculation. BREAKING DOWN 'Weighted Average Cost Of Capital-WACC'. In a broad sense, a company finances its assets either through debt or with equity. WACC is the average of the costs of these types of financing, each of which is weighted by its proportionate use in a given situation. By taking a weighted average in this way, we can determine how much interest a company owes for each dollar it finances"}, {"url": "http://www.accountingtools.com/weighted-average-method", "passage_text": "When using the weighted average method, divide the cost of goods available for sale by the number of units available for sale, which yields the weighted-average cost per unit. In this calculation, the cost of goods available for sale is the sum of beginning inventory and net purchases. The actual total cost of all purchased or beginning inventory units in the preceding table is $116,000 ($33,000 + $54,000 + $29,000). The total of all purchased or beginning inventory units is 450 (150 beginning inventory + 300 purchased). The weighted average cost per unit is therefore $257.78 ($116,000 ÷ 450 units.). The ending inventory valuation is $45,112 (175 units × $257.78 weighted average cost), while the cost of goods sold valuation is $70,890 (275 units × $257.78 weighted average cost). The sum of these two amounts (less a rounding error) equals the $116,000 total actual cost of all purchases and beginning inventory"}]