[{"url": "http://blog.ed.gov/2014/05/student-loan-forgiveness-and-other-ways-the-government-can-help-you-repay-your-loans/", "passage_text": "Loan forgiveness is the cancellation of all or some portion of your federal student loan balance. Yes, that’s right—cancellation of your loan balance. If your loan is forgiven, you are no longer required to repay that loan. There are a number of situations under which you can have your federal student loan balance forgiven, and we’ve provided a few in this post. You will, however, want to research your options at StudentAid.gov/repay and contact your loan servicer for any questions you may have about student loan forgiveness."}, {"url": "http://www.sandiego.edu/financialaid/documents/60-ways-to-get-rid-of-your-student-loans-without-paying-them.pdf", "passage_text": "27 Minnesota Loan Forgiveness Program To Be Eligible …You must be an eligible health professional (see site linked in the title of this section) committed to a minimum of 3 years of service.You may receive up to $25,000 per year for a minimum 3-year commitment and a maximum of 4 years. You may receive up to 100% forgiveness of your loans.• Child or family services agency: You must be a full-time employee of a public or nonprofit child or family services agency providing services to high-risk children and their families from low-income communities."}, {"url": "http://www.sandiego.edu/financialaid/documents/60-ways-to-get-rid-of-your-student-loans-without-paying-them.pdf", "passage_text": "You may receive up to 100% forgiveness of your loans.• Firefighter: You must be a full-time firefighter whose service included August 14, 2008, or began on or after that date. Firefighters may receive up to 100% forgiveness of their loans. You may receive up to 100% forgiveness of your loans.• Child or family services agency: You must be a full-time employee of a public or nonprofit child or family services agency providing services to high-risk children and their families from low-income communities."}, {"url": "http://www.bankrate.com/finance/student-loans/student-loan-debt-retirement.aspx", "passage_text": "Currently, the average student loan balance for borrowers ages 50 to 59 is $23,183. Those ages 60 to 69 are only doing slightly better, with average loan balances of $19,225. According to the Federal Reserve Bank of New York, nearly 17 percent of outstanding student loan debt is held by borrowers age 50 or older."}, {"url": "http://www.usatoday.com/story/money/personalfinance/2013/09/06/student-loan-forgiveness-options/2776545/", "passage_text": "Thanks to the government's Teacher Forgiveness Program, up to $17,500 of your federal Stafford loans or the entirety of your Perkins loans can be forgiven in exchange for five consecutive, full-time years as a teacher at certain low-income elementary or secondary schools. 2. Join the military. "}, {"url": "http://articles.sun-sentinel.com/2012-05-14/news/fl-near-retirement-student-loans-20120511_1_student-borrowers-college-loans-student-loans", "passage_text": "Young said she was resigned to paying on her loan the rest of her life — before she found out about the federal Public Service Loan Forgiveness Program that pardons federal student loans after borrowers have worked 10 years at a federal, state or local government agency or tax-exempt nonprofit agency. I'm $39,000 still in the hole, Young said. She's not alone. Almost 2 million people at least 60 years old are still paying on student loans, according to a recent survey conducted by the Federal Reserve Bank in New York. That's more than 5 percent of the 37 million who have student loans, the study found."}, {"url": "http://www.bankrate.com/finance/debt/retire-student-loan-before-retiring.aspx", "passage_text": "Dear Debt Adviser, I am 56 years old and have about $80,000 in student loans from my master's degree, which I completed about eight years ago. The monthly payments are a huge pain now but will be impossible when I stop working. Is there any way to get the balance forgiven by being a senior citizen? After 25 years, any remaining debt will be discharged, or forgiven. Under current law, the amount of debt discharged is treated as taxable income, so you will have to pay income taxes 25 years from now -- when you are a spry 81-year-old -- on the amount discharged that year."}, {"url": "https://studentaid.ed.gov/sites/default/files/public-service-loan-forgiveness-common-questions.pdf", "passage_text": "No. To be eligible for forgiveness, you must be employed full-time by a qualifying public service organization at the time you made each of the 120 qualifying payments, at the time you apply for loan forgiveness, and at the time you receive loan forgiveness. The following questions and answers (Q&As) provide federal student loan borrowers information about the Public. Service Loan Forgiveness (PSLF) Program that is available to borrowers who have federal student loans made. through the William D. Ford Federal Direct Loan (Direct Loan) Program."}, {"url": "https://www.edvisors.com/repay-student-loans/federal/cancel/forgiveness/", "passage_text": "For example, a typical loan forgiveness program might forgive 20 percent of the borrower’s student loans or $7,500, whichever is less, for each year of service up to five years. Loan Repayment Assistance Programs (LRAP) are an example of such loan forgiveness programs. Public Service Loan Forgiveness forgives the principal and interest balance on a borrower’s federal direct student loans after the borrower has made 120 qualifying payments (= 10 years) while working full-time in a public service job."}]