[{"url": "https://en.wikipedia.org/wiki/Algal_bloom", "passage_text": "An algal bloom is a rapid increase or accumulation in the population of algae (typically microscopic) in a water system."}, {"url": "http://www.oilgae.com/ref/glos/algal_blooms.html", "passage_text": "An algal bloom is a relatively rapid increase in the population of (usually) phytoplankton algae in an aquatic system. Algal blooms can occur in coastal and marine waters as well as freshwater environments."}, {"url": "http://www.definitions.net/definition/harmful%20algal%20bloom", "passage_text": "An algal bloom where the algae produce powerful toxins that can kill fish, birds, and mammals, and ultimately cause illness in humans. The harmful bloom can also cause oxygen depletion in the water due to the death and decomposition of non-toxic algae species."}, {"url": "https://en.wikipedia.org/wiki/Algal_bloom", "passage_text": "Of particular note are harmful algal blooms (HABs), which are algal bloom events involving toxic or otherwise harmful phytoplankton such as dinoflagellates of the genus Alexandrium and Karenia, or diatoms of the genus Pseudo-nitzschia. Such blooms often take on a red or brown hue and are known colloquially as red tides."}, {"url": "https://en.wikipedia.org/wiki/Algal_bloom", "passage_text": "Cyanobacteria blooms are often called blue-green algae. Algal blooms may occur in freshwater as well as marine environments. Typically, only one or a small number of phytoplankton species are involved, and some blooms may be recognized by discoloration of the water resulting from the high density of pigmented cells."}, {"url": "http://www.biology-online.org/dictionary/Algal_bloom", "passage_text": "Algal bloom. algal bloom. An algal bloom is a relatively rapid increase in the population of (usually) phytoplankton algae in an aquatic system. Typically only one or a few species are involved and the bloom is recognized by discoloration of the water resulting from the high density of pigmented cells."}, {"url": "http://www.marbef.org/wiki/Harmful_algal_bloom", "passage_text": "Harmful algal blooms or HABs are algal blooms composed of phytoplankton known to naturally produce biotoxins, they can occur when certain types of microscopic algae grow quickly in water, forming visible patches that may harm the health of the environment, plants, or animals."}, {"url": "http://www.oxforddictionaries.com/definition/english/algal-bloom", "passage_text": "noun. A rapid growth of microscopic algae or cyanobacteria in water, often resulting in a coloured scum on the surface. Example sentences. 1  That could reduce the invertebrates' predation on algae at the surface, potentially leading to algal blooms and poor water quality."}]