[{"url": "http://www.answers.com/Q/What_is_the_main_function_of_the_arteries", "passage_text": "Arteries do NOT mean they carry oxygenated blood. Arteries can carry either oxygenated blood (e.g. aorta) or de-oxygenated blood (pulmonary artery). Artery simply refers to the direction in which blood is flowing. In this case, it means it is flowing away from the heart. Veins mean it is flowing toward the heart arteries carry blood away from the heart. To transport oxygenated blood though the system and into the veins to be oxygenated. The arteries' main functions are to carry blood (mainly erythrocytes, leukocytes, thrombocytes, and plasma) throughout the body. The blood carries oxygen, fights pathogens, clots blood, and maintains body temperature."}, {"url": "http://www.hopkinsmedicine.org/healthlibrary/conditions/cardiovascular_diseases/anatomy_and_function_of_the_coronary_arteries_85,P00196/", "passage_text": "The two main coronary arteries are the left main and right coronary arteries. Left main coronary artery (LMCA). The left main coronary artery supplies blood to the left side of the heart muscle (the left ventricle and left atrium). The left main coronary divides into branches: The left anterior descending artery, which branches off the left coronary artery and supplies blood to the front of the left side of the heart. The circumflex artery, which branches off the left coronary artery and encircles the heart muscle. This artery supplies blood to the outer side and back of the heart."}, {"url": "http://www.diffen.com/difference/Arteries_vs_Veins", "passage_text": "There are two types of blood vessels in the circulatory system of the body: arteries that carry oxygenated blood from the heart to various parts of the body and veins that carry blood towards the heart for purification. Types of arteries and veins. There are two types of arteries in the body: Pulmonary and systemic. The pulmonary artery carries deoxygenated blood from the heart, to the lungs, for purification while the systemic arteries form a network of arteries that carry oxygenated blood from the heart to other parts of the body."}, {"url": "http://www.answers.com/Q/What_is_the_main_function_of_the_arteries", "passage_text": "Most arteries carry oxygenated (oxygen-rich) blood from the heart to the rest of the body. Most veins carry deoxygenated (containing less oxygen and more carbon dioxide and other wastes) blood from the body tissues to the heart, which then sends that blood through the pulmonary system to be oxygenated again. To transport oxygenated blood though the system and into the veins to be oxygenated. The arteries' main functions are to carry blood (mainly erythrocytes, leukocytes, thrombocytes, and plasma) throughout the body. The blood carries oxygen, fights pathogens, clots blood, and maintains body temperature."}, {"url": "http://www.mananatomy.com/basic-anatomy/arteries", "passage_text": "Arteries: Arteries are blood vessels that supply blood to the tissues of body. They carry the blood away from heart and because the blood inside them is oxygenated, they appear red in color. 1 Large arteries of elastic type, e.g. aorta and its main branches (brachiocephalic, common carotid, subclavian and common iliac) and the pulmonary arteries. 2  Medium and small arteries of muscular type, e.g. temporal, occipital, radial, popliteal, etc. 3  Smallest arteries of muscular type are called arterioles."}, {"url": "http://biology.about.com/od/anatomy/ss/artery.htm", "passage_text": "An artery is an elastic blood vessel that transports blood away from the heart. There are two main types of arteries: pulmonary arteries and systemic arteries. Pulmonary arteries carry blood from the heart to the lungs where the blood picks up oxygen. The oxygen rich blood is then returned to the heart via the pulmonary veins. Systemic arteries deliver blood to the rest of the body. The aorta is the main systemic artery and the largest artery of the body. It originates from the heart and branches out into smaller arteries which supply blood to the head region (brachiocephalic artery), the heart itself (coronary arteries), and the lower regions of the body"}, {"url": "http://study.com/academy/lesson/what-are-arteries-function-definition-quiz.html", "passage_text": "The systemic division contains the aorta and all of its branches. From your heart, oxygenated blood is pushed into your aorta, which is the largest artery in your body. Two smaller arteries-the coronary arteries-immediately branch off the aorta to supply oxygenated blood to the heart itself. With the exception of the pulmonary arteries, which carry deoxygenated blood to your lungs, all of your arteries carry oxygenated blood. Your arterial system is in two divisions: pulmonary and systemic."}, {"url": "http://biology-igcse.weebly.com/arteries-veins-and-capillaries---structure-and-functions.html", "passage_text": "There are 3 main kinds of blood vessels – arteries, veins and capillaries. 1  Arteries carry blood away from the heart. 2  The capillaries gradually join up with one another to form large vessels called veins. 3  Veins carry blood towards the heart. # 71 Arteries, veins and capillaries-structure and functions. There are 3 main kinds of blood vessels – arteries, veins and capillaries. 1  Arteries carry blood away from the heart. 2  They divide again and again, and eventually form very tiny vessels called capillaries."}, {"url": "http://www.hopkinsmedicine.org/healthlibrary/conditions/cardiovascular_diseases/anatomy_and_function_of_the_coronary_arteries_85,P00196/", "passage_text": "Coronary arteries supply blood to the heart muscle. Like all other tissues in the body, the heart muscle needs oxygen-rich blood to function, and oxygen-depleted blood must be carried away. The coronary arteries run along the outside of the heart and have small branches that dive into the heart muscle to bring it blood. The left anterior descending artery, which branches off the left coronary artery and supplies blood to the front of the left side of the heart. The circumflex artery, which branches off the left coronary artery and encircles the heart muscle. This artery supplies blood to the outer side and back"}]