[{"url": "http://www.rxwiki.com/doxycycline", "passage_text": "1 The range of doses for all forms of doxycycline is 100 to 200 mg a day, with a maximum daily dose of 600 mg. 2  When taking doxycycline for the prevention of malaria, you should start taking the drug 1 to 2 days before traveling to an area with malaria. Doxycycline is also used to treat Lyme disease, anthrax, and acne. It may also be used by your dentist to treat periodontitis (inflammation within the mouth). This medication may be prescribed for other uses. Ask your doctor or pharmacist for more information."}, {"url": "http://www.rxlist.com/doryx-drug/indications-dosage.htm", "passage_text": "For prophylaxis of malaria: For adults, the recommended dose is 100 mg daily. For children over 8 years of age, the recommended dose is 2 mg/kg given once daily up to the adult dose. Prophylaxis should begin 1 or 2 days before travel to the malarious area. Exceeding the recommended dosage may result in an increased incidence of side effects. Adults: The usual dose of oral doxycycline is 200 mg on the first day of treatment (administered 100 mg every 12 hours), followed by a maintenance dose of"}, {"url": "http://www.everydayhealth.com/drugs/doxycycline", "passage_text": "For adults, the normal dose of oral doxycycline is 200 mg on the first day of treatment. Usually you take that as two 100-mg doses, 12 hours apart. After this initial dose, people usually take a maintenance dose of 100 mg daily for seven to 10 days. In some cases, people may need to take higher doses, 300 mg a day for 10 days. For inhalational anthrax, the usual adult prescription is 100 mg of doxycycline twice a day for 60 days. For the prevention of malaria, you should start taking doxycycline up to two days before traveling."}, {"url": "http://antibiotics.emedtv.com/doxycycline/doxycycline-dosage.html", "passage_text": "Dose of Doxycycline for Bacterial Infections. The recommended doxycycline dosage for most types of bacterial infections in adults is 100 mg to 200 mg per day for 7 to 14 days. For chronic (long-term) or more serious infections, treatment can be carried out for a longer time. For malaria prevention, a dosage of doxycycline 100 mg a day for adults and 2 mg per kilogram of body weight for children is typically prescribed."}, {"url": "http://antibiotics.emedtv.com/doxycycline/doxycycline-dosage.html", "passage_text": "In children ages eight or older, your healthcare provider will prescribe a doxycycline dosage based on a weight chart, usually about 1 to 2 mg per pound of body weight per day. The dose is divided and taken for 7 to 14 days. For malaria prevention, a dosage of doxycycline 100 mg a day for adults and 2 mg per kilogram of body weight for children is typically prescribed."}, {"url": "http://www.druglib.com/druginfo/doxycycline/indications_dosage/", "passage_text": "Adults: The usual dose of oral doxycycline is 200 mg on the first day of treatment (administered 100 mg every 12 hours) followed by a maintenance dose of 100 mg/day. In the management of more severe infections (particularly chronic infections of the urinary tract), 100 mg every 12 hours is recommended. "}, {"url": "http://www.everydayhealth.com/drugs/doxycycline", "passage_text": "For more severe infections, such as chronic infections of the urinary tract, the recommended dose is 100 mg every 12 hours. In some cases, people may need to take higher doses, 300 mg a day for 10 days. For inhalational anthrax, the usual adult prescription is 100 mg of doxycycline twice a day for 60 days. For the prevention of malaria, you should start taking doxycycline up to two days before traveling."}, {"url": "http://www.rxlist.com/doryx-drug/indications-dosage.htm", "passage_text": "Inhalational anthrax (post-exposure): Adults: 100 mg, of doxycycline, by mouth, twice-a-day for 60 days. Children: weighing less than 100 lb (45 kg); 1 mg/lb (2.2 mg/kg) of body weight, by mouth, twice-a day for 60 days. Children weighing 100 lb or more should receive the adult dose. Exceeding the recommended dosage may result in an increased incidence of side effects. Adults: The usual dose of oral doxycycline is 200 mg on the first day of treatment (administered 100 mg every 12 hours), followed by a maintenance dose of 100 mg daily."}, {"url": "http://www.justanswer.com/pet-dog/6okfj-maximum-dosage-mg-lb-doxycycline-used-treat.html", "passage_text": "My vet put my 146 pound dog on 1300 mg of doxycycline a day which seems really high to me....I called today to check to be sure I got the dosage correct and that is what he recommends. I'm concerned it will be harmful to my dog as I have a rescue and have always used the 2 - 5mg per pound rule. As a general rule, the dose of Doxy for a dog is 2-5mg per pound given twice a day. So if your dog weighs 50 pounds, they'd get anywhere from 100-250mgs twice daily. There's more information about Doxy here: http://www.1800petmeds.com/Doxycycline-prod10340.html."}]