[{"url": "http://www.wikihow.com/Consume-Garlic-for-Health", "passage_text": "If you decide to take raw garlic, consume one or two cloves of raw garlic each day. 1  Peel the garlic cloves. 2  Use a meat mallet to crush the cloves. 3  Spread the crushed garlic on bread or mix with honey and then eat."}, {"url": "http://www.youtube.com/watch?v=ceBbQcdhvVk", "passage_text": "Garlic is a superfood and the closest thing to a natural panacea. Garlic can be used to boost immunity, heart-health, lower cholesterol, lower blood pressure, reduce risk of cancer, bacterial infections and naturally boost testosterone and reduce cortisol."}, {"url": "http://www.wikihow.com/Consume-Garlic-for-Health", "passage_text": "If you decide to take raw garlic, consume one or two cloves of raw garlic each day. 1  Peel the garlic cloves. 2  Use a meat mallet to crush the cloves. 3  This is necessary to release the active components of garlic. 4  Spread the crushed garlic on bread or mix with honey and then eat."}, {"url": "http://www.healthextremist.com/garlic-health-benefits-why-you-should-eat-r/", "passage_text": "Garlic is a vegetable and is a species of the onion genus. Garlic is often used to add flavor to recipes and dishes. However, garlic can also be used as a medicine to prevent or treat a wide range of aliments and diseases. Garlic cloves contain many vital nutrients including vitamins, amino acids, and enzymes."}, {"url": "http://www.wikihow.com/Eat-Raw-Garlic", "passage_text": "How to Eat Raw Garlic. Three Methods: Raw garlic on toast Garlic dip Guacamole with garlic. Eating raw garlic is a good way of building up your immune system. Here are a few ways you can go about eating raw garlic by adding it to food, so that you can stay healthy."}, {"url": "http://www.thenourishinggourmet.com/2011/01/4-ways-to-consume-raw-garlic.html", "passage_text": "The first thing to keep in mind is always consuming raw garlic with a bit of some type of fat. Raw garlic can be unpleasant in the stomach when consumed on it’s own (if you eat raw garlic frequently on it’s own, I’ve read it could even lead to eventual damage in your stomach!). It also just tastes a lot better when consumed with something fatty. Keep in mind that these “recipes” aren’t culinary recipes."}, {"url": "http://www.thenourishinggourmet.com/2011/01/4-ways-to-consume-raw-garlic.html", "passage_text": "One of the most common “folk” remedies is eating raw garlic to ward of everything from infections to the common cold. With few side effects (besides making you smell like garlic!), it is a safe way to build your immune system that I’ve used often."}, {"url": "http://www.healthextremist.com/garlic-health-benefits-why-you-should-eat-r/", "passage_text": "Why you should eat garlic raw: When the garlic is cooked this prohibits the garlic’s ability to make allicin. Allicin is one of the primary components of garlic that gives it its health benefits, including the ability to prevent cancer. Allicin is produced in garlic when the garlic enzyme alliinase is cut or chewed."}]