[{"url": "http://pets.costhelper.com/pet-rabbit.html", "passage_text": "1 Among the many distinct breeds of rabbits, common pets include Lops (droopy-eared bunnies) that cost $15-$60, Dwarfs (weighing only 1-3 pounds) priced $25-$40 and Mini Rex (gentle and intelligent creatures with alert pointy ears) for $10-$50. 1 Cages have removable trays for litter cleaning and are priced around $35 for a small 25x16x9-inch unit, up to about $120 for a 42-inch one with wheels. 2  Cages should be long enough so that the rabbit can stretch three lengths and tall enough so he can stand on hind legs, according to KindPlanet.org."}, {"url": "http://www.thesurvivalpodcast.com/forum/index.php?topic=20969.0", "passage_text": "I'll assume 20 rabbits at a time, at a cost of $2.00 per each purchased rabbit. You can assume an up-front cost of about $100-$200 on the cages, water dispensers etc. In this case, you must factor in the cost of the rabbits. I find $2.00 is pretty common in rural areas (about the same as pullets and sold in the same places). Typically, you butcher in 8-12 weeks depending on the breed. When buying rabbits, you must consider the seasonal availability."}, {"url": "http://www.answers.com/Q/How_much_does_rabbit_meat_cost", "passage_text": "First answer: about $100 with vet costs and food. A different answer: The vet costs alone can be $100, and if so that's a good year! No, a rabbit costs much more than that, so … mething like $400-$2,000 a year. It depends on where you live, what resources you have access to, your rabbit's health, and how good you are at finding deals. "}, {"url": "http://pets.costhelper.com/pet-rabbit.html", "passage_text": "1 Rabbit digestive systems need continuous access to food which runs about $5 per 3-pound bag of pellets. 2  Rabbits eat about one ounce of feed for every pound of body weight, so a 5-pound pet will consume about 9 pounds per month, or $15 worth of pellets. 1 Cages have removable trays for litter cleaning and are priced around $35 for a small 25x16x9-inch unit, up to about $120 for a 42-inch one with wheels. 2  Cages should be long enough so that the rabbit can stretch three lengths and tall enough so he can stand on hind legs, according to KindPlanet.org."}, {"url": "http://rabbitbreeders.us/rabbit-prices", "passage_text": "Pet Rabbit Prices. Pet rabbit prices vary more than any other type. You will find a backyard breeder selling bunnies for $10. Drive into town, and you will find a pet shop selling bunnies of the same size, age, and color for up to $200. Most pet store prices seem to be between $40 and $70. If you buy a pet quality rabbit from a show breeder, you should expect to pay from $15 to $50."}, {"url": "http://www.rabbitsetc.us/id14.html", "passage_text": "PEOPLE EATIN' Rabbits: The rabbits are butchered at 8-10 weeks old. They weigh 5-6 pounds live weight and sell whole for $15.75 each. They dress out between 3-3 1/2 pounds. Rabbit meat is much denser than chicken and 1 whole rabbit can easily yeild 4-5 average servings."}, {"url": "http://pets.costhelper.com/pet-rabbit.html", "passage_text": "There are many sources for free or low-cost rabbits, so the biggest cost variable other than breed in keeping one as a pet is its upkeep. Anyone thinking of a rabbit as a springtime surprise should multiply by about 10 since the average lifespan of a rabbit is 7-12 years. 1 Cages have removable trays for litter cleaning and are priced around $35 for a small 25x16x9-inch unit, up to about $120 for a 42-inch one with wheels. 2  Cages should be long enough so that the rabbit can stretch three lengths and tall enough so he can stand on hind legs, according to KindPlanet.org."}, {"url": "http://rabbitbreeders.us/rabbit-prices", "passage_text": "Meat rabbit prices fluctuate, of course, but are more standard across the country than show or pet prices. A processor that buys live animals will usually pay $1.00 to $1.50 per pound. Dressed and processed rabbit meat currently goes for $6 to $7 per pound. Drive into town, and you will find a pet shop selling bunnies of the same size, age, and color for up to $200. Most pet store prices seem to be between $40 and $70. If you buy a pet quality rabbit from a show breeder, you should expect to pay from $15 to $50."}]