[{"url": "http://civil-war-journeys.org/the_lost_cause.htm", "passage_text": "The Lost Cause 1. The Lost Cause is the name commonly given to a literary and intellectual movement that sought to reconcile the traditional Southern white society to the defeat of the Confederate States of America in the Civil War. The Lost Cause theme was taken up by memorial associations such as the United Confederate Veterans and the United Daughters of the Confederacy."}, {"url": "https://en.wikipedia.org/wiki/Lost_Cause_of_the_Confederacy", "passage_text": "Of all the many testimonials to the fact that slavery, and not states' rights, really lay at the heart of their movement, this was the most eloquent of all. ... the Lost Cause legacy to history is a caricature of the truth. The caricature wholly misrepresents and distorts the facts of the matter. Some of the main tenets of the Lost Cause movement were that: 1  Confederate generals such as Lee, Albert Sidney Johnston, and Thomas Stonewall Jackson represented the virtues of Southern nobility and fought bravely and fairly."}, {"url": "http://civil-war-journeys.org/the_lost_cause.htm", "passage_text": "In his farewell order to the Army of Northern Virginia, Lee spoke of the overwhelming resources and numbers that the Confederate army fought against. The Lost Cause theme was taken up by memorial associations such as the United Confederate Veterans and the United Daughters of the Confederacy. The Lost Cause helped Southerners to cope with the social, political, and economic changes after the Civil War especially in the oppressive Reconstruction era"}, {"url": "http://civilwarhome.com/lostcause.htm", "passage_text": "The Lost Cause Only at the moment when Lee handed Grant his sword was the Confederacy born; or to state matters another way, in the moment of death the Confederacy entered upon it immortality.. Robert Penn Warren The Legacy of the Civil War, 1961. The Lost Cause, the title of Edward A. Pollards 1866 history of the Confederacy, first referred to the South's defeat in the Civil War, but in time it came to designate the regions memory of the war as well. By the 1990s the memory of the Civil War had not totally disappeared from Southern culture, but certainly the specificity and power of the Lost Cause had dramatically declined. Source: Encyclopedia of the Confederacy, volume 3, article by Gaines M. Foster."}, {"url": "http://military.wikia.com/wiki/Lost_Cause_of_the_Confederacy", "passage_text": "Many Southerners felt that their way of life had been disrupted by the North both before and after the Civil War. The term Lost Cause first appeared in the title of an 1866 book by the historian Edward A. Pollard, The Lost Cause: A New Southern History of the War of the Confederates. Some of the main tenets of the Lost Cause movement were that: 1  Confederate generals such as Lee, Albert Sidney Johnston and Thomas Stonewall Jackson represented the virtues of Southern nobility and fought bravely and fairly."}, {"url": "https://en.wikipedia.org/wiki/Lost_Cause_of_the_Confederacy", "passage_text": "The Lost Cause is a set of beliefs which endorsed the virtues of the ante-bellum South embodying a view of the American Civil War as an honorable struggle to maintain those virtues as widely espoused in popular culture especially in the South, while overlooking or downplaying the central role of slavery. Some of the main tenets of the Lost Cause movement were that: 1  Confederate generals such as Lee, Albert Sidney Johnston, and Thomas Stonewall Jackson represented the virtues of Southern nobility and fought bravely and fairly."}, {"url": "https://en.wikipedia.org/wiki/Lost_Cause_of_the_Confederacy", "passage_text": "These include the claim that the Confederacy started the Civil War to defend state's rights rather than to preserve slavery, and the related claim that slavery was benevolent, rather than cruel. Historians, including Gaines Foster, generally agree that the Lost Cause narrative also helped preserve white supremacy. Some of the main tenets of the Lost Cause movement were that: 1  Confederate generals such as Lee, Albert Sidney Johnston, and Thomas Stonewall Jackson represented the virtues of Southern nobility and fought bravely and fairly."}, {"url": "http://military.wikia.com/wiki/Lost_Cause_of_the_Confederacy", "passage_text": "The Lost Cause is the name commonly given to an American literary and intellectual movement that sought to reconcile the traditional white society of the U.S. South to the defeat of the Confederate States of America in the American Civil War of 1861–1865. Some of the main tenets of the Lost Cause movement were that: 1  Confederate generals such as Lee, Albert Sidney Johnston and Thomas Stonewall Jackson represented the virtues of Southern nobility and fought bravely and fairly."}, {"url": "http://rationalwiki.org/wiki/Lost_Cause_of_the_South", "passage_text": "The Lost Cause of the South (also Lost Cause of the Confederacy) is a term referring to a number of interpretations of the American Civil War from an effectively pro-Southern perspective. It is important as it is a good example of denialism, especially in regards to the chief underlying cause of the war, slavery. "}]