[{"url": "http://www.healthline.com/health/type-2-diabetes/random-glucose-testing", "passage_text": "Random Glucose Testing: Why It’s Important. A random glucose test is exactly what it sounds like. It’s a random blood test to check glucose levels. It’s a powerful tool for diabetics. Also called casual testing, it can help assess how well the disease is being managed. Health professionals recommend that you use the post-meal glucose level as the standard for random glucose testing. "}, {"url": "https://en.wikipedia.org/wiki/Random_glucose_test", "passage_text": "From Wikipedia, the free encyclopedia. Random glucose test (aka capillary blood glucose) is a blood sugar test taken from a non-fasting subject. This test, also called random blood glucose (RBG) or casual blood glucose (CBG), assumes a recent meal and therefore has higher reference values than the fasting glucose test."}, {"url": "http://www.onetouch.com/articles/random-blood-glucose-test", "passage_text": "A healthy blood glucose level is between 70 and 110 milligrams per deciliter (mg/dL). According to the guidelines of the American Diabetes Association, diabetes is diagnosed if the level is above 200 mg/dL in a random test, and the person has symptoms of diabetes. If someone has symptoms of diabetes but the random blood glucose level is below 200 mg/dL, the doctor will want to follow up with a fasting blood glucose test or other test."}, {"url": "http://www.healthline.com/health/glucose-test-blood", "passage_text": "A glucose test measures the amount of glucose in your blood. Glucose, also known as sugar, is your body’s main source of energy. Your body converts the carbohydrates you eat into glucose. Glucose testing is done primarily to check for type 1 diabetes, type 2 diabetes, and gestational diabetes. Diabetes is a condition that causes your blood glucose to rise. In healthy individuals, the glucose level is managed in the body by a hormone called insulin"}, {"url": "http://www.ncbi.nlm.nih.gov/pubmedhealth/PMH0003953/", "passage_text": "Normal Results. If you had a fasting blood glucose test, a level between 70 and 100 milligrams per deciliter (mg/dL) is considered normal. If you had a random blood glucose test, a normal result depends on when you last ate. Most of the time, the blood glucose level will be below 125 mg/dL. "}, {"url": "http://umm.edu/health/medical/ency/articles/glucose-test-blood", "passage_text": "A blood glucose test measures the amount of a sugar called glucose in a sample of your blood. Glucose is a major source of energy for most cells of the body, including those in the brain. Carbohydrates (or carbs) are found in fruit, cereal, bread, pasta, and rice. They are quickly turned into glucose in your body. "}, {"url": "http://www.onetouch.com/articles/random-blood-glucose-test", "passage_text": "The way to test for diabetes is to measure your blood glucose level. A random test is done at any time, to get a snapshot picture of the glucose concentration in your bloodstream. If someone has symptoms of diabetes but the random blood glucose level is below 200 mg/dL, the doctor will want to follow up with a fasting blood glucose test or other test."}, {"url": "https://en.wikipedia.org/wiki/Random_glucose_test", "passage_text": "The reference values for a normal random glucose test in an average adult are 79 - 140 mg / dl (4.4 - 7.8 mmol /l), between 140 - 200 mg / dl mg / dl mg / dl does not necessarily mean you are diabetic). This test, also called random blood glucose (RBG) or casual blood glucose (CBG), assumes a recent meal and therefore has higher reference values than the fasting glucose test."}, {"url": "http://www.all-about-beating-diabetes.com/random-blood-glucose.html", "passage_text": "Actually, this random sugar test is also called a simple glucose test. You use to do it by yourself when you want to measure your blood sugar levels at any time during the day. You can use any glucose meters that can be found in the market. Basically, this is a test that you perform to get to know what the levels of your blood glucose are at any time of the day to better monitor your diabetes. So, the normal results you should get are between 70 to 100 mg/dl."}]