[{"url": "http://www.answers.com/Q/What_is_the_difference_between_a_radii_and_radius", "passage_text": "Cut that in half-that is the radius. The radius is the … distance from the center to the edge of the circle. A radius is one half the diameter of a circle (the straight line distance from one point of the edge of a circle to the other side, directly in the middle). The plural form of radius is radii. + 7 others found this useful."}, {"url": "http://www.autodesk.com/techpubs/aliasstudio/2009/files/SurfacesSurfacefillet.htm", "passage_text": "When Construction Type is Variable, this is the radius of a constant radius fillet surface that AliasStudio uses as a basis for you to specify the various radii for the final fillet. You will set the final fillet’s radii at different points along the surface. See Choose the type of a fillet surface. See Control the radius along the length of a Variable fillet surface. See Manipulate fillet surface cross section and continuity. See Create a blend surface by specifying profiles."}, {"url": "http://the-difference-between.com/category/terms/fillet", "passage_text": "As nouns the difference between radius and fillet is that radius is (anatomy) the long bone in the forearm, on the side of the thumb while fillet is a headband; a ribbon or other band used to tie the hair up, or keep a headdress in place, or for decoration. As a verb fillet is to slice, bone or make into fillets. As nouns the difference between fillet and galletting is that fillet is a headband; a ribbon or other band used to tie the hair up, or keep a headdress in place, or for decoration while galletting is the insertion of flint fillets into the joints of masonry."}, {"url": "http://the-difference-between.com/category/terms/fillet", "passage_text": "As nouns the difference between fillet and draft is that fillet is a headband; a ribbon or other band used to tie the hair up, or keep a headdress in place, or for decoration while draft is an early version of a written work. As nouns the difference between fillet and galletting is that fillet is a headband; a ribbon or other band used to tie the hair up, or keep a headdress in place, or for decoration while galletting is the insertion of flint fillets into the joints of masonry."}, {"url": "http://docs.autodesk.com/ACD/2010/ENU/AutoCAD%202010%20User%20Documentation/files/WS1a9193826455f5ffa23ce210c4a30acaf-4b3a.htm", "passage_text": "Summary. In the example, an arc is created that is tangent to both of the selected lines. The lines are trimmed to the ends of the arc. To create a sharp corner instead, enter a radius of zero. You can fillet arcs, circles, elipses, elliptical arcs, lines, polylines, rays, splines, and xlines. You can also fillet 3D solids and surfaces."}, {"url": "http://help.autodesk.com/cloudhelp/2015/ENU/InventorLT-Help/files/GUID-2D6F2499-2859-40C8-9DF6-25A9E645BBCE.htm#!", "passage_text": "Constant and variable radius fillets. A constant-radius fillet has the same radius along its entire length. A variable-radius fillet has a radius that varies along its length. You set a different radius for the start point and endpoint. You can also add intermediate points, each of which can have a different radius. 1 Edge fillets Based on selected edges. 2  The fillets can be of constant or variable-radius, of different sizes, and of different continuity (tangent (G1) or smooth G2), all of which can be created in a single operation. 3  All fillets and rounds created in a single operation become a single feature."}, {"url": "http://the-difference-between.com/category/terms/fillet", "passage_text": "In context|anatomy|lang=en terms the difference between radius and fillet is that radius is (anatomy) the long bone in the forearm, on the side of the thumb while fillet is (anatomy) a fascia; a band of fibres; applied especially to certain bands of white matter in the brain. As nouns the difference between fillet and galletting is that fillet is a headband; a ribbon or other band used to tie the hair up, or keep a headdress in place, or for decoration while galletting is the insertion of flint fillets into the joints of masonry."}, {"url": "http://www.g-wlearning.com/CAD/9781605252650/student/ch08/PDF/Glossary.pdf", "passage_text": "Point at which a fillet or round on one edge begins to combine with a fillet or round of at least two other edges.variable fillets and rounds. Fillets and rounds that have different curved radii placed at precise points between the start and end of a feature edge. Angled planar face added to a corner or feature edge.constant fillets and rounds. Fillets and rounds that have a curve radius that does not change.fillet. A curve placed at the inside intersection of two or more faces, adding material to a feature.full radius"}, {"url": "http://www.answers.com/Q/What_is_the_difference_between_a_radii_and_radius", "passage_text": "The formula for the circumference, (C) of a circle is C = 2πr.....where r is the radius. Let R be the radius of the larger circle and r the radius of the smaller circle. Then … 66 = 2πR - 2πr = 2π(R-r) Then R-r = 66/2π = 33/π ≅ 10.504 The difference between the two radii is 10.504 (3dp). The radius is the … distance from the center to the edge of the circle. A radius is one half the diameter of a circle (the straight line distance from one point of the edge of a circle to the other side, directly in the middle). The plural form of radius is radii. + 7 others found this useful."}]