[{"url": "http://www.ifrc.org/en/news-and-media/news-stories/asia-pacific/solomon-islands/solomon-islanders-count-their-blessings-and-search-for-answers/", "passage_text": "Sleeping under canvas. Buri’s residents, who are still living high in the bush, an hour's walk from their village, wonder what the strange events mean. Solomon islanders are mainly Christian and many people believe the disasters are part of a biblical prophecy before the end of the world. The boys were playing on a field, high above the ocean. When the ball rolled towards the edge of the field, 12-year-old Epakera followed it. At that moment, the powerful tremor rocked his home island of Ranongga, along with many other parts of the Solomon Islands."}, {"url": "http://www.legana.org/studies/prayer/Prayer_That_Works.pdf", "passage_text": "In the model prayer which Jesus gave, He rounded off this prayer by leading His followers to acknowledge God as the Ruler of their lives (“Yours is the ‘Kingdom’”), the source of strength to do anything (“Yours is the ‘power’”) and the reason for living (“Yours is the ‘glory’”). 6:11) ! It is just not possible to be a Christian without a work of the Holy Spirit taking place in your life! Upon surrendering to the Holy Spirit, He-fills your dead spirit (Rom. 8:9) and quickens it back to life (Eph. 2:1-5), cleanses your impure soul (Titus 3:5), baptises you into the body of Christ (1Cor."}, {"url": "http://www.bioafrica.co.za/products/creams.htm", "passage_text": "Lengana is still one of the most widely used traditional medicines across Southern Africa. Numerous ailments are treated with it, mainly coughs, colds and influenza but also fever, loss of appetite, colic, headache, earache, malaria and intestinal worms, stomach cramps amongst others. People would take the leaves and either push them up their nostrils or boil them to make a tea with which they would steam, drink or use as an antiseptic. As urbanisation occurred people found it more difficult to find lengana in most parts of the region."}, {"url": "http://www.bioafrica.co.za/products/creams.htm", "passage_text": "1 Lengana Umhlonyane may well be one of the new wonder herbs on the market which has properties to treat sinusitis, laryngitis, tonsillitis, nasal congestion, flu symptoms, piles and ring worm. People would take the leaves and either push them up their nostrils or boil them to make a tea with which they would steam, drink or use as an antiseptic. As urbanisation occurred people found it more difficult to find lengana in most parts of the region."}, {"url": "http://www.legana.org/studies/prayer/Prayer_That_Works.pdf", "passage_text": "Prayer As A Lifestyle-Review last study’s homework-Pray without ceasing-Incorporating prayer into the mundane-Instant in prayer-What to do with answered prayer! Pray Without Ceasing˝ The Gospel of Luke is also known as the Gospel of Prayer. In this Gospel, Jesus is praying all the time. 1. 6:11) ! It is just not possible to be a Christian without a work of the Holy Spirit taking place in your life! Upon surrendering to the Holy Spirit, He-fills your dead spirit (Rom. 8:9) and quickens it back to life (Eph. 2:1-5), cleanses your impure soul (Titus 3:5), baptises you into the body of Christ (1Cor."}, {"url": "http://www.bioafrica.co.za/products/creams.htm", "passage_text": "The range of products includes: 1  a kit to treat pimples, spots and dark facial marks. 2  a skin oil that is very effective against stretch marks superior after shave gel for the most discerning man and a number of other products containing the extract from a very special herb that only grows in certain part of South Africa. People would take the leaves and either push them up their nostrils or boil them to make a tea with which they would steam, drink or use as an antiseptic. As urbanisation occurred people found it more difficult to find lengana in most parts of the region."}, {"url": "http://www.bioafrica.co.za/products/creams.htm", "passage_text": "LipBalm. The BioAfrica lip care comes in a fresh bubble flavor. It helps dry, chapped lips and keeps lips in good condition. Lip balm is applied to the lips of the mouth to relieve chapped or dry lips and cold sores. Lip gloss is similar, but generally has only cosmetic properties and ends up drying ones lips. People would take the leaves and either push them up their nostrils or boil them to make a tea with which they would steam, drink or use as an antiseptic. As urbanisation occurred people found it more difficult to find lengana in most parts of the region."}, {"url": "http://digitalcollections.sit.edu/cgi/viewcontent.cgi?article=1253&context=isp_collection", "passage_text": "Letters of the Bush: A Case Study of Traditional Setswana Herbal Medicine Kristen Danley Academic Director: Stewart Chirova Project Advisor: Keolebogile Mosweu Carleton College Biology Botswana: Goo-Tau, Tswapong Hills, Central District. 2. Acknowledgements First and foremost, I would like to thank Rra Keolebogile Mosweu for accepting me as his student and teaching me tirelessly throughout my period of study. The wealth of knowledge he shared with me was incredible, and without him I would not have had a project."}, {"url": "http://www.bioafrica.co.za/Farming/Herbs/Artemisia.htm", "passage_text": "Essential Oils are the fragrant chemical components of aromatic plants. When steam distillation is used in the manufacture and extraction of essential oils, the botanical material is placed in a still and steam is forced over the material. Pinky Duma, a young Xhosa lady studying marketing, one day came across the BioAfrica website while searching the internet. She was looking for additional cash to supplement her student loan."}]