[{"url": "http://www.newbornlittleladies.com/first-name-meanings-c/meaning-of-carol.htm", "passage_text": "The Origin, Meaning and the Hidden Meaning of the name Carol This page details the origin and literal meaning of the name Carol together with an insight into the hidden meaning and interpretation of the name using numerology. A short form, or variant, of Caroline from which the meaning and origin of the name is derived. The Meaning of the name Carol The meaning of the name Carol is as follows: Female ruler. The Origin of the name Carol The origin of the name Carol is believed to be: Teutonic. The Hidden Meaning of the name Carol using Numerology Numerology is an ancient science which was developed by Pythagoras. Numerology offers an insight into the personality by assigning numeric values to the letters contained in names"}, {"url": "http://www.sheknows.com/baby-names/name/carol", "passage_text": "The name Carol is an American baby name. In American the meaning of the name Carol is: Champion. English Meaning: The name Carol is an English baby name. In English the meaning of the name Carol is: Manly, strong. A; from Carolus, the Latinized form of the name. Famous bearer: Pope John Paul II's real name is Karol Wojtyla. Karol is a variant spelling of Carol used in several European countries."}, {"url": "http://www.sheknows.com/baby-names/name/carole", "passage_text": "French Meaning: The name Carole is a French baby name. In French the meaning of the name Carole is: The french form of the English Carol, a dimunitive of Charles meaning strong. American Meaning: The name Carole is an American baby name. In American the meaning of the name Carole is: The french form of the English Carol, a dimunitive of Charles meaning strong."}, {"url": "http://www.thinkbabynames.com/meaning/0/Carol", "passage_text": "First used toward the end of the 19th century. The French form Carole was made famous in the mid-20th century by actress Carole Lombard. It is sometimes paired with a monosyllabic second name, as in Carol-Ann. Actresses Carol Burnett, Carol Channing; skater Carol Heiss; playwright Caryl Churchhill. Carol is a very popular first name for women (#18 out of 4276, Top 1%) and also a very popular surname for all people (#16745 out of 150436, Top 11%). (2000 U.S. Census). Shown below is the baby name popularity of Carol for girls."}, {"url": "http://www.behindthename.com/name/carol-1", "passage_text": "Short form of CAROLINE. It was formerly a masculine name, derived from CAROLUS. The name can also be given in reference to the English vocabulary word, which means song or hymn. "}, {"url": "http://www.meaning-of-names.com/english-names/carol.asp", "passage_text": "Other origins for the name Carol include-English, French, French, Gaelic.The name Carol is a unisex name and can be used for a boy or girl name (male or female). English Name Meaning-Manly, strong. A variant of Charles; from Carolus, the Latinized form of the name. Famous bearer: Pope John Paul IIs real name is Karol Wojtyla. Karol is a variant spelling of Carol used in several European countries. English name. In English, the name Carol means-Manly, strong. A variant of Charles; from Carolus, the Latinized form of the name. Famous bearer: Pope John Paul IIs real name is Karol Wojtyla. Karol is a variant spelling of Carol used in several European countries."}, {"url": "http://www.babynamewizard.com/baby-name/girl/carol", "passage_text": "Origin of the name Carol: Feminine form of the Latin Carolus, which is a cognate of Charles (full-grown, a man, freeman), and a short form of Caroline, another feminine form of Carolus. Alternatively, the name is derived from the vocabulary word carol (joyous song, a carol). Var: Carol, Carrol, Carroll, Carryl, Caryl. Comments and insights on the name Carol: | Edit. My name is Carol. I have never met anyone younger than 50 with my name, and I'm in my 30s. It seems everyone has an Aunt Carol. I like that it's just Carol. Not Caroline, Carolyn, etc. Of course, that doesn't stop people from assuming it is."}, {"url": "http://www.thinkbabynames.com/meaning/0/Carol", "passage_text": "It is of Old German origin, and the meaning of Carol is free man. Originally a male name, an anglicized form of Carolus (see Charles). Probably originated as a short form of Caroline, but sometimes given in reference to the English word song and associated with Christmas. Carol is a very popular first name for women (#18 out of 4276, Top 1%) and also a very popular surname for all people (#16745 out of 150436, Top 11%). (2000 U.S. Census). Shown below is the baby name popularity of Carol for girls."}]