[{"url": "http://genealogy.familyeducation.com/surname-origin/remis", "passage_text": "Save Name. Last name origins & meanings: 1  Greek: from a medieval Greek personal name, Remis, a vernacular form of the personal name Remigius (see French Remy). 2  Dutch and German: from a vernacular form of the personal name Remigius (see Remy)."}, {"url": "http://www.thinkbabynames.com/meaning/1/Remi", "passage_text": "Remi /re-mi/ [2 sylls.] as a boys' name (also used more widely as girls' name Remi). Remi's name origin is French, and Remi means from Rheims. Remi is a variant transcription of Remy (French). Ramo is a familiar surname. Kreatif forms: Romi, Rumi, Rymi."}, {"url": "http://www.urbandictionary.com/define.php?term=Remi", "passage_text": "Remi spelt in this way is usally a girls name. However when spelt 'Remy' it is commonly a boys name. When used as an European name it is usally a girls name but when French a boys. Remi is the best person ever and is someone you can always count on. Remi a totally awesome person. Remi is beautiful and funny."}, {"url": "http://www.ancestry.com/name-origin?surname=remes", "passage_text": "Remes Name Meaning. Finnish: probably from a vernacular form of the personal name Remigius (see Remy). Found chiefly in eastern Finland.Greek, Dutch, and German: variant of Remis 1 and 2.Jewish (from Belarus): habitational name for someone from Remezy, in Belarus."}, {"url": "http://www.thinkbabynames.com/meaning/1/Remus", "passage_text": "Remus /re-mus/ [2 sylls.] as a boys' name is of Latin origin. The name's spelling is the same as the Latin word for oar, and hence possibly means swiftness. The name of one of the legendary twins (the other was Remo) who founded Rome."}, {"url": "http://genealogy.familyeducation.com/surname-origin/remis", "passage_text": "1 Greek: from a medieval Greek personal name, Remis, a vernacular form of the personal name Remigius (see French Remy). 2  Dutch and German: from a vernacular form of the personal name Remigius (see Remy)."}]