[{"url": "http://www.wikihow.com/Use-an-Incubator-to-Hatch-Eggs", "passage_text": "6. Record the day and how many eggs you've incubated on a calendar. You should be able to estimate your hatch date based on average incubation times for the bird species you want to hatch. For example, chicken eggs typically take 21 days to hatch, whereas many duck varieties and peafowl may take 28 days. 7. Turn the eggs at least three times daily."}, {"url": "http://www.wikihow.com/Hatch-Chicken-Eggs", "passage_text": "Candle the eggs after 7 to 10 days. Candling the eggs is when you use a light source to view how much space the embryo occupies within an egg. After 7 to 10 days, you should see development of the embryo. Candling allows you to remove eggs with embryos that are not viable. 1 The eggs you find in grocery stores are not fertile and cannot be hatched. 2  For disease prevention and health reasons, it's best to get all your eggs from one source. 3  If you are looking for a particular or rare breed of chicken, you may need to contact a specialized hatchery."}, {"url": "http://www.nantahala-farm.com/chicken-duck-hatch-eggs-s.shtml", "passage_text": "How Long Does Hatching Take. Hatching can take place over several days. For chickens, run the incubator for 24 days (3 days more than normal hatch time). For ducks and turkeys run the incubator for 32 days (4 days more than normal hatch time). It is better not to help a chick/duckling/poult crack out of its shell. If you do, they almost always die (unless you follow the instructions in the next paragraphs)"}, {"url": "http://www.backyardchickens.com/a/how-to-incubate-hatch-eggs-just-21-days-from-egg-to-chicken", "passage_text": "A day is counted as a full 24 hours, so Day 1 would be the first 24 after setting the egg, Day 2 the next 24 hours etc. If you set eggs on a Monday, it's usually a safe bet that they will hatch on a Monday, 3 weeks later. Select clean, even shaped, undamaged eggs for incubating. Turning. Turning is essential during the first 14 days of incubation and should be continued until 3 days prior to the eggs expected hatch day. If hand turning, always turn the eggs an uneven number of times a day, so the eggs do not spent two nights in a row in the same position."}, {"url": "http://www.raising-happy-chickens.com/hatching.html", "passage_text": "Usually, if temperature and humidity levels have been ideal, the hatchling will start to break through the shell 21 days after the eggs were first set. However, this is a 'rule of thumb'. Sometimes it takes longer and sometimes shorter times-I've had a hatch as late as day 25 (as in the image below). One of my chicks hatched at day 19. Early hatching is generally due to temperatures being too high, either during shipping if eggs were sent by post, or in the incubator itself. It's possible that the chick will be smaller than others who go the full 21 days, and they can also be weaker."}, {"url": "http://forums2.gardenweb.com/discussions/1439855/how-long-after-pipping-should-they-be-out", "passage_text": "The normal incubation period for chicken eggs is 21 days--hatching at 18 or 19 days is too soon, and usually indicates too high of a temperature in the incubator or some other issue. Chicks that hatch too early or too late invariably have health problems or tend to do poorly. "}, {"url": "http://www.poultryclub.org/eggs/hatching-rearing-and-care-of-young-poultry/", "passage_text": "For the small poultry keeper there is the choice of two methods of hatching chicks-natural or artificial. The best idea is to gain experience and confidence in both. Hen eggs take 21 days to hatch, duck and turkey eggs 28 days, most goose eggs 28 - 30 days and Muscovy eggs 35 days. Some very small bantam eggs may be a day early and really large poultry such as Cochins may be a day extra."}, {"url": "http://www.backyardchickens.com/a/how-to-incubate-hatch-eggs-just-21-days-from-egg-to-chicken", "passage_text": "Related tutorials: How-To #2: The First 60 Days. General Hints. First things first-eggs should hatch in 21 days, though some may hatch a day or 2 early and some a day or 2 late, after the incubation period began. Turning. Turning is essential during the first 14 days of incubation and should be continued until 3 days prior to the eggs expected hatch day. If hand turning, always turn the eggs an uneven number of times a day, so the eggs do not spent two nights in a row in the same position."}, {"url": "http://www.wikihow.com/Hatch-Chicken-Eggs", "passage_text": "Chicken eggs have an incubation period of about 21 days and can be hatched using either a specialized incubator under carefully monitored conditions, or using a broody hen. Use these tips for hatching chicken eggs using both methods. 1 The eggs you find in grocery stores are not fertile and cannot be hatched. 2  For disease prevention and health reasons, it's best to get all your eggs from one source. 3  If you are looking for a particular or rare breed of chicken, you may need to contact a specialized hatchery."}]