[{"url": "http://www.ehow.com/how_4460921_remove-rust-household-items.html", "passage_text": "Rust around the house takes away from the beauty of your home and can lead to further and more serious damage. Fortunately, you can whip up a concoction to clean up most of those rust stains using common household items. Read on for two easy rust removal home remedies. To remove rust with household items, combine 1 teaspoon of cream of tartar, a quarter cup of baking soda and a bit..."}, {"url": "http://www.wisegeek.com/how-can-i-remove-rust-from-metal.htm", "passage_text": "Sandpaper can be used to remove rust from metal. A paste of baking soda and water can remove rust from metal. Rubber gloves should be worn when removing rust from metal. White vinegar works well for removing rust from small metal items. If you want to remove rust from metal and don't mind a little bit of hard work, you can try to remove it manually with sandpaper or another coarse item, such as steel wool. This might take a while, though. If the rust is widespread, it might take several attempts to get down to the clean metal."}, {"url": "http://cleaning.lovetoknow.com/Cleaning_Rust_Off_Metal", "passage_text": "Dissolve Rust with Vinegar. Plain white vinegar can be an effective substance for cleaning rust off metal. You can pour or rub vinegar directly on metal items that have become rusty, or soak small items in a container filled with the clear liquid. When the vinegar starts to dissolve the rust, simply wipe the surface clean and rinse with cold water. Remove Rust with Baking Soda. Add water to baking soda to form a thick paste, being careful that the consistency is not runny at all. Use your fingers or a flat spreader to apply the paste to the rusty surface."}, {"url": "http://www.housecleaningcentral.com/en/cleaning-tips/stain-removal/removing-rust-stains.html", "passage_text": "It removes yellowing, and iron rust stains from whites. Again, if you buy a commercial preparation to remove iron stains from your clothing, be sure to follow the directions to the T. These products contain lots of harsh chemicals and acids. Always use them in well ventilated areas and avoid breathing the fumes. Unfortunately, grease, oil and rust must be treated differently to remove them from the concrete. Here's a tip for removing rust stains from concrete that you'll view with a skeptical eye ... but give it a try anyway."}, {"url": "http://www.wikihow.com/Remove-Rust-from-Metal", "passage_text": "//d5kh2btv85w9n.cloudfront.net/f/f9/Remove Rust from Metal Step 1.360p.mp4. 1  If the object is too big to soak directly in the white vinegar, pour a layer over the top and allow it time to set. 2  You can also wipe it down with a rag soaked in vinegar. 1 You can also wipe it down with a rag soaked in vinegar. 2  Try dipping aluminium foil in the vinegar and using it as a brush to scrub off the rust. 3  It is less abrasive than steel wool, but will still do the trick in removing the rust."}, {"url": "http://www.youtube.com/watch?v=D3NZizE6ieY", "passage_text": "Just a quick vid on how to remove rust really easily with CLR (household product) without sanding, scrubbing and pretty much not even touching the product. This process works great for restoring nuts and bolts! Please subscribe and thanks for watching! 1  Science & Technology. 2  Standard YouTube License. "}, {"url": "http://www.wisegeek.com/how-can-i-remove-rust-from-metal.htm", "passage_text": "Baking Soda. Using baking soda is another way to remove rust from metal. You can make a paste by mixing baking soda and water. Make sure that the solution is pasty enough to adhere to the surface, then spread it onto the metal and let it sit. After the rust is loose, you can scrub it off. If you want to remove rust from metal and don't mind a little bit of hard work, you can try to remove it manually with sandpaper or another coarse item, such as steel wool. This might take a while, though. If the rust is widespread, it might take several attempts to get down to the clean metal."}, {"url": "http://farmersalmanac.com/home-garden/2009/07/13/rust-remedies/", "passage_text": "2 — For more stubborn rust, try using white vinegar. The acetic acid in this common household product is acidic enough to dissolve rust. You can soak smaller things like earrings, wipe it onto a surface with an old cloth, or just pour it directly over rust spots or bolts and screws that have rusted together. "}, {"url": "http://www.wikihow.com/Clean-Chrome-and-Remove-Rust-Without-Expensive-Cleaners", "passage_text": "5. Clean and polish chrome with a metal cleaner like Brasso. While this product is more expensive than household items, a little goes a long way and you only need to use it once a week at the most. Brasso has a strong odor and should be used in ventilated areas and kept away from children and pets. "}]