[{"url": "http://www.turkishbank.co.uk/", "passage_text": "Turkish Bank (UK) Ltd is authorised by the Prudential Regulation Authority and is regulated by the Financial Conduct Authority and the Prudential Regulation Authority. We participate in the Financial Services Compensation Scheme. "}, {"url": "http://www.isbank.co.uk/", "passage_text": "In London, Isbank began its operations as a Representative Office in 1974 and in 1983, having obtained the necessary approval the Representative Office became a fully authorised branch. In 1996, the branch moved to its current prestigious location at Princes Street, next to the Bank of England. In 2014, our second branch was opened in Edmonton, North London. Today, Isbank London Branch provides a wide array of services and products to individuals and businesses alike."}, {"url": "http://www.thetimenow.com/united_kingdom/london/banks-119/turkiye_is_bankasi_as-1229466", "passage_text": "Find out all details about Turkiye Is Bankasi As, listed on Banks category in London, United Kingdom. The Time Now provides Turkiye Is Bankasi As full information. 1  Name. 2  Phone. "}, {"url": "http://www.bloomberg.com/quote/TIBD:LI", "passage_text": "Profile. Turkiye Is Bankasi (Isbank) provides banking services to retail and corporate customers and to public sector. Isbank also offers asset and wealth management, capital markets, securities brokerage and insurance services throughout Turkey. Isbank holds equity investments in Turkish companies mainly in glass industries."}, {"url": "https://thebanks.eu/banks/14142", "passage_text": "Isbank AG is located at France, PARIS 09. It is one of 585 credit institutions operating in France. Any bank can be identified for different purposes and hence can have several different identifiers. The code is alphanumerical, with the first two digits representing the two-digit ISO code for the country of residence of the MFI and the remaining number of digits (no limit has been specified) is any combination of alphanumerical characters."}, {"url": "https://thebanks.eu/banks/14627", "passage_text": "Turkiye Is Bankasi AS is located at United Kingdom, London. It is one of 360 credit institutions operating in United Kingdom. Any bank can be identified for different purposes and hence can have several different identifiers. The code is alphanumerical, with the first two digits representing the two-digit ISO code for the country of residence of the MFI and the remaining number of digits (no limit has been specified) is any combination of alphanumerical characters. MFI ID of Turkiye Is Bankasi AS is shown in the table below"}, {"url": "https://thebanks.eu/banks/14142", "passage_text": "BIC. BIC (Business Identifier Code, also known as SWIFT code or SWIFT BIC) is a the mostly used international identifier of financial institutions. SWIFT is the registration authority for BICs. BICs are used in financial transactions, client and counterparty data bases, compliance documents and many others. The code is alphanumerical, with the first two digits representing the two-digit ISO code for the country of residence of the MFI and the remaining number of digits (no limit has been specified) is any combination of alphanumerical characters."}, {"url": "http://ziraat.co.uk/", "passage_text": "Ziraat Bankası A.ş. London Branch is authorised by the Prudential Regulation Authority and regulated by the Financial Conduct Authority and the Prudential Regulation Authority. "}, {"url": "https://thebanks.eu/banks/14627", "passage_text": "All credit institutions operating in United Kingdom are obliged to participate in British deposit guarantee scheme. In the case of Turkiye Is Bankasi AS failure, eligible depositors having covered accounts in this bank will be paid out the following compensation: The code is alphanumerical, with the first two digits representing the two-digit ISO code for the country of residence of the MFI and the remaining number of digits (no limit has been specified) is any combination of alphanumerical characters. MFI ID of Turkiye Is Bankasi AS is shown in the table below."}]