[{"url": "http://www.answers.com/Q/What_is_the_largest_sea_in_the_world", "passage_text": "The Pacific Ocean is the largest ocean in the world at 155,557,000 sq km. Its deepest point is the Mariana Trench (Challenger Deep) at 11,033 metres.   The Atlantic O … cean is the second largest ocean in the world at 76,762,000 sq km. Its deepest point is the Puerto Rico Trench (Milwaukee Deep) at 8,648 metres."}, {"url": "http://www.answers.com/Q/What_is_the_largest_sea", "passage_text": "The South China Sea, which has an area of 3,500,000 km², is the largest sea. The next largest is the Mediterranean Sea, with an area of 2,500,000 km² . The world's largest inland sea is the Caspian Sea, with an area of about 371,000 km²."}, {"url": "http://www.factofun.com/top-10-largest-seas-in-the-world/", "passage_text": "10. The Bay of Bengal is the largest bay in the world and tenth on our list of top 10 largest seas in the world. Covering an area of 2,172,000 sq. km, this triangular shaped gulf forms the northeastern part of the Indian ocean."}, {"url": "http://www.answers.com/Q/What_is_the_largest_sea_in_the_world", "passage_text": "The largest sea creature is the Great Blue Whale. They can be up to 33 meters (108 feet) long and weigh up to 172 metric tons. Not only is it the largest sea creature in the … world, it is also the largest animal that has ever lived."}, {"url": "http://www.factofun.com/top-10-largest-seas-in-the-world/", "passage_text": "In general, a sea is said to be an extended part of the saline water that is connected with at least one of the five oceans in the world, namely: Atlantic, Pacific, Indian, Arctic and the Southern Oceans. Many geographers regard sea as a small area of ocean that are bounded by land to a greater or a lesser degree."}, {"url": "http://oceanservice.noaa.gov/facts/leatherback.html", "passage_text": "with lengths of up to six feet, the leatherback is a big turtle! Leatherback sea turtles can be distinguished from other species of sea turtle by its lack of a hard shell or scales. Instead, leatherbacks are covered with a firm, rubbery skin."}, {"url": "http://www.answers.com/Q/What_is_the_largest_sea", "passage_text": "The blue whale is considered the largest sea creature to exist or have existed, at up to 108 feet in length (33 m) and weighing up to 200 tons (180,000 kg)."}]