[{"url": "http://www.clearblueeasy.com/pregnancy-symptoms.php", "passage_text": "Changes in your breasts. You may notice your breasts getting larger, feeling tender, or tingling (the way some women’s breasts do just before they get their period) in the early weeks of pregnancy. In addition, the veins on your breasts may show up more and your nipples may get darker."}, {"url": "http://americanpregnancy.org/getting-pregnant/early-pregnancy-symptoms/", "passage_text": "Pregnancy symptoms differ from woman to woman and pregnancy to pregnancy; however, one of the most significant pregnancy symptoms is a delayed or missed period. Understanding the signs of pregnancy is important because each symptom may have causes other than pregnancy."}, {"url": "http://www.goodtoknow.co.uk/family/168757/Early-signs-of-pregnancy", "passage_text": "It could be your pill or you might be due on your period-many early signs of pregnancy are similar to when you're having a period or are due on. This is the most common pregnancy symptom, and is usually the first one you might pick up on."}, {"url": "http://www.mayoclinic.org/healthy-lifestyle/getting-pregnant/in-depth/symptoms-of-pregnancy/art-20043853", "passage_text": "Classic symptoms of pregnancy. In addition to a missed period, the earliest signs and symptoms of pregnancy might include: 1  Tender, swollen breasts. 2  Early in pregnancy hormonal changes might make your breasts tender, sensitive or sore. 3  Or your breasts might feel fuller and heavier."}, {"url": "http://www.goodtoknow.co.uk/family/168757/Early-signs-of-pregnancy", "passage_text": "If you are due on your period you may get pre-menstrual cramps. You might already know that one of the first pregnancy symptoms many women experience is changes to their breast tissue. Towards the end of the first trimester or the beginning of the second trimester you may notice that your breasts begin to grow."}, {"url": "http://www.parents.com/pregnancy/signs/symptoms/", "passage_text": "From very early pregnancy symptoms that get you wondering whether you're pregnant, to symptoms you'll experience when you know you're pregnant, we'll help you sort through the many bodily and emotional changes you'll go through during pregnancy. 1  Facebook."}, {"url": "http://www.webmd.com/baby/guide/pregnancy-am-i-pregnant?page=2", "passage_text": "Missed Period. The most obvious early symptom of pregnancy -- and the one that prompts most women to get a pregnancy test -- is a missed period. But not all missed or delayed periods are caused by pregnancy. Also, women can experience some bleeding during"}, {"url": "http://pregnancy.about.com/od/signssymptoms/a/25signsofpg.htm", "passage_text": "If you're like everyone else you're trying to figure out what the signs of pregnancy or pregnancy symptoms are and how likely they are to mean that you are pregnant."}]