[{"url": "https://labtestsonline.org/understanding/conditions/autoimmune", "passage_text": "Autoimmune diseases arise when the immune system attacks one or more of the body's normal constituents as if they were invaders. When the immune system fails to recognize self it may produce immune cells or antibodies (called autoantibodies) that target its own cells, tissues, and/or organs. In a few types of autoimmune disease (such as rheumatic fever), a virus or infection with bacteria triggers an immune response and the antibodies or immune cells called T-cells attack normal cells because some part of their structure resembles a part of the infecting microorganism."}, {"url": "https://en.wikipedia.org/wiki/Autoimmune_disease", "passage_text": "Autoimmune diseases arise from an abnormal immune response of the body against substances and tissues normally present in the body (autoimmunity). Definition [edit]. For a disease to be regarded as an autoimmune disease it needs to answer to Witebsky's postulates (first formulated by Ernst Witebsky and colleagues in 1957 and modified in 1994): 1  Direct evidence from transfer of disease-causing antibody or disease-causing T lymphocyte white blood cells."}, {"url": "http://www.ncbi.nlm.nih.gov/pubmedhealth/PMH0001819/", "passage_text": "About Autoimmune Disease. More than 80 diseases occur as a result of the immune system attacking the body's own organs, tissues, and cells. Some of the more common autoimmune diseases include type 1 diabetes, rheumatoid arthritis, systemic lupus erythematosus, and inflammatory bowel disease. Disease that results when the immune system mistakenly attacks the body's own tissues. Examples include multiple sclerosis, type 1 diabetes, rheumatoid arthritis, and systemic lupus erythematosus. PubMed Health Glossary."}, {"url": "http://www.webmd.com/a-to-z-guides/autoimmune-diseases", "passage_text": "Immune system disorders cause abnormally low activity or over activity of the immune system. In cases of immune system over activity, the body attacks and damages its own tissues (autoimmune diseases). Immune deficiency diseases decrease the body's ability to fight invaders, causing vulnerability to infections. 1 The immune system attacks and damages blood vessels in this group of autoimmune diseases. 2  Vasculitis can affect any organ, so symptoms vary widely and can occur almost anywhere in the body. 3  Treatment includes reducing immune system activity, usually with prednisone or another corticosteroid."}, {"url": "http://www.webmd.com/a-to-z-guides/autoimmune-diseases", "passage_text": "1 Systemic lupus erythematosus (lupus). 2  People with lupus develop autoimmune antibodies that can attach to tissues throughout the body. 3  The joints, lungs, blood cells, nerves, and kidneys are commonly affected in lupus. 4  Treatment often requires daily oral prednisone, a steroid that reduces immune system function. 1 The immune system attacks and damages blood vessels in this group of autoimmune diseases. 2  Vasculitis can affect any organ, so symptoms vary widely and can occur almost anywhere in the body. 3  Treatment includes reducing immune system activity, usually with prednisone or another corticosteroid."}, {"url": "http://www.lupus.org/answers/entry/what-is-lupus", "passage_text": "Lupus is a chronic, autoimmune disease that can damage any part of the body (skin, joints, and/or organs inside the body). Chronic means that the signs and symptoms tend to last longer than six weeks and often for many years. "}, {"url": "https://en.wikipedia.org/wiki/Autoimmunity", "passage_text": "Autoimmunity is the system of immune responses of an organism against its own cells and tissues. Any disease that results from such an aberrant immune response is termed an autoimmune disease. "}, {"url": "http://womenshealth.gov/publications/our-publications/fact-sheet/autoimmune-diseases.html", "passage_text": "1 People with a family history — Some autoimmune diseases run in families, such as lupus and multiple sclerosis. 2  It is also common for different types of autoimmune diseases to affect different members of a single family. 3  Inheriting certain genes can make it more likely to get an autoimmune disease. Although each disease is unique, many share hallmark symptoms, such as fatigue, dizziness, and low-grade fever. For many autoimmune diseases, symptoms come and go, or can be mild sometimes and severe at others. When symptoms go away for a while, it's called remission. Flares are the sudden and severe onset of symptoms."}, {"url": "http://www.news-medical.net/health/What-is-Autoimmune-Disease.aspx", "passage_text": "When autoimmune disorders occur, these regulatory T cells fail in their function. This results in damage to various organs and tissues that are termed autoimmune disease. The type of autoimmune disorder depends on the type of body tissue that is affected. There are more than 80 known types of autoimmune disorders. The main functions of the immune system are to defend the body from germs and other foreign invaders. The immune system is composed of special cells and organs that deal with invaders and allergens. The cells create antibodies to fight off the infection or foreign intruders."}]