[{"url": "http://abcnews.go.com/Health/ebola-/story?id=24733669", "passage_text": "Two Americans, including a doctor, are infected with the Ebola virus and Liberia's lead Ebola doctor recently died from the virus. That news came amid a heavy toll -- 1,323 infected in the current outbreak as of July 31, according to the World Health Organization. The Ebola virus is described as a group of viruses that cause a deadly kind of hemorrhagic fever. The term hemorrhagic fever means it causes bleeding inside and outside the body. The virus has a long incubation period of approximately eight to 21 days."}, {"url": "http://www.livescience.com/48311-ebola-causes-symptoms-treatment.html", "passage_text": "Ebola virus disease (EVD) is a rare and often-fatal infection caused by one of the five strains of the Ebola virus. Ebola first appeared in 1976 in a simultaneous outbreak in the areas that are now Sudan and the Democratic Republic of the Congo, according to the World Health Organization (WHO). Five virus species have been identified, four of which are known to cause disease in humans: Ebola virus (Zaire ebolavirus); Sudan virus (Sudan ebolavirus); Tai Taï forest (Virus Tai taï, forest Ebolavirus formerly’Cote côte); d Ivoire ebolavirus (And bundibugyo). virus bundibugyo ebolavirus"}, {"url": "https://en.wikipedia.org/wiki/Ebola_virus_disease", "passage_text": "Ebola virus disease (EVD; also Ebola hemorrhagic fever, or EHF), or simply Ebola, is a viral hemorrhagic fever of humans and other primates caused by ebolaviruses. Signs and symptoms typically start between two days and three weeks after contracting the virus with a fever, sore throat, muscular pain, and headaches. EVD in humans is caused by four of five viruses of the genus Ebolavirus. The four are Bundibugyo virus (BDBV), Sudan virus (SUDV), Tai Taï forest (VIRUS) tafv and one simply Called ebola (VIRUS, ebov Formerly Zaire ebola). virus"}, {"url": "http://ebola.emedtv.com/ebola/what-causes-ebola.html", "passage_text": "An infection with the Ebola virus is what causes Ebola. Three of the four identified subtypes have caused disease in humans: Ebola-Zaire, Ebola-Sudan, and Ebola-Ivory Coast. The exact origin, locations, and natural habitat of the virus remain unknown; however, researchers believe that the virus lives in an animal host in Africa. It is not known exactly how an outbreak of Ebola occurs. Researchers theorize that the first person to develop Ebola in an outbreak becomes infected with the virus through contact with an infected animal. Transmission among humans occurs through direct contact with infected people or their blood (or other body fluids)."}, {"url": "http://www.mayoclinic.org/diseases-conditions/ebola-virus/basics/causes/CON-20031241", "passage_text": "Experts suspect that both viruses are transmitted to humans through an infected animal's bodily fluids. Examples include: 1  Blood. 2  Butchering or eating infected animals can spread the viruses. 3  Scientists who have operated on infected animals as part of their research have also contracted the virus. 4  Waste products. A milder strain of Ebola has been discovered in monkeys and pigs in the Philippines. Marburg virus has been found in monkeys, chimps and fruit bats in Africa."}, {"url": "http://www.who.int/mediacentre/factsheets/fs103/en/", "passage_text": "1 Ebola virus disease (EVD), formerly known as Ebola haemorrhagic fever, is a severe, often fatal illness in humans. 2  The virus is transmitted to people from wild animals and spreads in the human population through human-to-human transmission. 3  The average EVD case fatality rate is around 50%. Key facts. 1 "}, {"url": "http://www.cdc.gov/vhf/ebola/about.html", "passage_text": "Ebola, previously known as Ebola hemorrhagic fever, is a rare and deadly disease caused by infection with one of the Ebola virus strains. Ebola can cause disease in humans and nonhuman primates (monkeys, gorillas, and chimpanzees). Ebola is caused by infection with a virus of the family Filoviridae, genus Ebolavirus. The fifth, Reston virus (Reston ebolavirus), has caused disease in nonhuman primates, but not in humans. Ebola viruses are found in several African countries. Ebola was first discovered in 1976 near the Ebola River in what is now the Democratic Republic of the Congo."}, {"url": "http://www.mayoclinic.org/diseases-conditions/ebola-virus/basics/causes/CON-20031241", "passage_text": "Causes. Ebola virus has been found in African monkeys, chimps and other nonhuman primates. A milder strain of Ebola has been discovered in monkeys and pigs in the Philippines. Marburg virus has been found in monkeys, chimps and fruit bats in Africa."}, {"url": "http://www.medicinenet.com/ebola_hemorrhagic_fever_ebola_hf/page2.htm", "passage_text": "Ebola hemorrhagic fever is a viral disease caused by Ebola virus that results in nonspecific symptoms (see symptom section of this article) early in the disease and often causes internal and external hemorrhage (bleeding) as the disease progresses. "}]