[{"url": "http://www.mbgnet.net/pfg/diverse/temp/whats.htm", "passage_text": "One of the most interesting features of the temperate deciduous forest is its four changing seasons. And as the seasons change, so do the colors of the leaves of the deciduous trees. The average temperature of the forest is about 50 degrees Fahrenheit. The average rainfall here in the forest is 30 to 60 inches a year."}, {"url": "http://www.answers.com/Q/What_is_the_average_temperature_in_a_deciduous_forest", "passage_text": "1 Deciduous Forests Deciduous forests are those where broad-leaved trees grow. 2  The average temperature is 50 degrees and the average rainfall is 30 to 60 inches per year."}, {"url": "http://deciduousforestsistvan.weebly.com/", "passage_text": "The average temperature of a Deciduous Forest is around 50 degrees Fahrenheit (10 degrees Celsius). When the temperature is looked at month by month (graph below right), it, unlike precipitation, is a steady incline and decline, peaking during the months of June, July, and August (Summer, in other words)."}, {"url": "http://www.answers.com/Q/What_is_the_average_temperature_in_a_deciduous_forest", "passage_text": "The average temperature annually in the Deciduous Forest is 50 degrees Fahrenheit, or approximately 10 degrees Celsius. 2 people found this useful. Edit. Share to: 1  Average Temperatures in Spain Spain is a beautiful and diverse country. 2  It is also fairly large, at 195,364 square miles."}, {"url": "http://www.answers.com/Q/What_is_the_yearly_average_temperature_in_deciduous_forests", "passage_text": "1 Deciduous Forests Deciduous forests are those where broad-leaved trees grow. 2  The average temperature is 50 degrees and the average rainfall is 30 to 60 inches per year. 3  These forests are locat…. 4  Summer in Rome, Italy Europe is a popular travel destination for many Americans."}, {"url": "http://earthobservatory.nasa.gov/Experiments/Biome/biotemperate.php", "passage_text": "The temperature varies widely from season to season with cold winters and hot, wet summers. The average yearly temperature is about 10°C. The areas in which deciduous forests are located get about 750 to 1,500 mm of precipitation spread fairly evenly throughout the year. During the fall, trees change color and then lose their leaves. This is in preparation for the winter season."}]