[{"url": "http://www.north-ayrshire.gov.uk/resident/planning-and-building-standards/do-i-need-planning-permission.aspx", "passage_text": "Permitted development. Not all developments need planning permission. Permitted Development rights are granted so that many instances of small alterations and extensions can be carried out without the need to submit an application for"}, {"url": "http://www.drawingandplanning.com/residential-planning-application/permitted-development/permitted-development.html", "passage_text": "Please note: permitted development rights only apply to houses and do not apply to flats, maisonettes or other buildings. you will need full planning permission for all works to a flat or maisonette. Read more..."}, {"url": "http://www.drawingandplanning.com/residential-planning-application/permitted-development/permitted-development.html", "passage_text": "A permitted development application must be accompanied by scaled architectural drawings which clearly outline the existing property and proposed development. We compile all the necessary drawings and handle your entire application, ensuring you do not exceed the permitted development rights."}, {"url": "http://www.get-planning.co.uk/permitted-development", "passage_text": "This happens when a project is covered by permitted development rights. These rights come from a general planning permission granted by Parliament and allow you to avoid the more complex process of having to apply for planning permission."}, {"url": "http://www.drawingandplanning.com/residential-planning-application/permitted-development/permitted-development.html", "passage_text": "You should also note that the local planning authority may have removed some of your permitted development rights by issuing an Article 4 direction. This will mean that you have to submit a planning application for work which normally does not need one."}, {"url": "http://www.get-planning.co.uk/permitted-development", "passage_text": "If your project is not covered under permitted development rights, then Get Planning and Architecture is able to assist you with a planning application. For more information on our planning application service, click here."}, {"url": "http://www.north-ayrshire.gov.uk/resident/planning-and-building-standards/do-i-need-planning-permission.aspx", "passage_text": "The Scottish Government's Guidance on permitted development (PDF, 82kb) will help you to determine whether planning permission is required for your development. If you have any questions please contact us. If planning permission is not required, there are other permissions that may be required such as:"}, {"url": "http://www.fairfaxcounty.gov/dpwes/buildingpermits/", "passage_text": "A completed permit application is required to start the process of getting your permit. Applying for your permit can be done in person at 12055 Government Center Parkway, Suite 230, Fairfax, VA, or many permit types can be applied for online."}]