[{"url": "https://en.wikipedia.org/wiki/Dew_point", "passage_text": "Dew point is a measure of atmospheric moisture. It is the temperature to which air must be cooled to reach saturation (assuming air pressure and moisture content are constant). A higher dew point indicates more moisture present in the air. Dew point temperature is never greater than the air temperature, since the relative humidity cannot exceed 100%."}, {"url": "https://en.wikipedia.org/wiki/Relative_humidity", "passage_text": "Relative humidity (abbreviated RH) is the ratio of the partial pressure of water vapor to the equilibrium vapor pressure of water at the same temperature. Relative humidity depends on temperature and the pressure of the system of interest. For example, if the air temperature is 24 °C (75 °F) and the relative humidity is zero percent, then the air temperature feels like 21 °C (69 °F). If the relative humidity is 100 percent at the same air temperature, then it feels like 27 °C (80 °F)."}, {"url": "http://usatoday30.usatoday.com/weather/resources/askjack/wfaqhumi.htm", "passage_text": "A: The warmer air is, the more water vapor it can hold.. Dew point is a measure of how much water vapor is actually in the air. Relative humidity is a measure of the amount of water in the air compared with the amount of water the air can hold at the temperature it happens to be when you measure it. However, sometimes it is just plain hot. Relative humidity is just a measure of the amount of water vapor actually in the air compared to the amount of water vapor that could be in the air at a given temperature and pressure."}, {"url": "https://en.wikipedia.org/wiki/Dew_point", "passage_text": "The dew point is associated with relative humidity. A high relative humidity implies that the dew point is closer to the current air temperature. Relative humidity of 100% indicates the dew point is equal to the current temperature and that the air is maximally saturated with water. Dew point temperature is never greater than the air temperature, since the relative humidity cannot exceed 100%."}, {"url": "http://msue.anr.msu.edu/news/what_is_the_difference_between_a_frost_and_a_freeze", "passage_text": "The dew point measures the absolute amount of water in the air. It is the temperature at which the air is saturated and the relative humidity is 100 percent. So for a given volume of air with a set amount of water vapor in it, the relative humidity varies with the temperature, but the dew point is always the same. A freeze is when the air temperature drops below freezing. Sometimes we get frost when the temperatures are above freezing and we often have a freeze without frost. It all has to do with the amount of water in the air. There are two different ways to measure humidity, the amount of water vapo"}, {"url": "https://en.wikipedia.org/wiki/Relative_humidity", "passage_text": "The relative humidity of an air-water mixture is defined as the ratio of the partial pressure of water vapor in the mixture to the equilibrium vapor pressure of water at a given temperature: Relative humidity is normally expressed as a percentage; a higher percentage means that the air-water mixture is more humid. For example, if the air temperature is 24 °C (75 °F) and the relative humidity is zero percent, then the air temperature feels like 21 °C (69 °F). If the relative humidity is 100 percent at the same air temperature, then it feels like 27 °C (80 °F)."}, {"url": "https://en.wikipedia.org/wiki/Dew_point", "passage_text": "In simpler terms: the dew point, or frost point, is the temperature at which dew or frost will form should the air temperature fall sufficiently. Other things being equal, as the temperature falls, the relative humidity rises, reaching 100% at the dew point, at least at ground level. Dew point temperature is never greater than the air temperature, since the relative humidity cannot exceed 100%."}, {"url": "http://www.theweatherprediction.com/habyhints/347/", "passage_text": "When the temperature is equal to the dewpoint then the relative humidity is 100%. The common ways for the relative humidity to be 100% is to 1) cool the air to the dewpoint, 2) evaporate moisture into the air until the air is saturated, 3) lift the air until it adiabatically cools to the dew point. This fact is important to precipitation growth in clouds. Since the vapor pressure is less over an ice surface as compared to a supercooled liquid surface at the same temperature, when the relative humidity is 100% with respect to water vapor the relative humidity over the ice surface will be greater than 100%."}]