[{"url": "https://www.debt.org/blog/dispute-credit-card-charges/", "passage_text": "If it is a claim about the quality of goods and services, there are some restrictions. If you pay with a debit card, the credit act does not apply, but you do have rights based on other consumer protection laws. You may also have signed a pre-existing contract with a merchant not to dispute charges."}, {"url": "http://www.creditcards.com/credit-card-news/dispute-credit-card-product-merchant-1282.php", "passage_text": "Or the drill won't. Sooner or later, almost every consumer has a dispute with a merchant over goods or services. In such cases, you can and should gripe directly to the merchant, but consumers who use credit cards to make purchases have an added layer of protection when disputes arise -- if they know how to use it."}, {"url": "http://www.creditcards.com/credit-card-news/dispute-credit-card-product-merchant-1282.php", "passage_text": "When a credit card is used in a disputed purchase, the six parties to a dispute are: 1  The consumer: You bought it, but you don't like it. 2  The consumer's card issuer: This is the financial institution that issued the credit card to the consumer."}, {"url": "https://www.discover.com/credit-cards/help-center/statements/dispute-charge.html", "passage_text": "Dispute a Charge. Notify Discover Card if you believe there are incorrect charges on your account. If you have found a charge you believe is incorrect, you may request billing assistance. You have 120 days from the date of the transaction to open a dispute online. For disputes older than 120 days, please contact 1-800-DISCOVER."}, {"url": "http://www.creditcards.com/credit-card-news/dispute-credit-card-product-merchant-1282.php", "passage_text": "1 The consumer's card issuer: This is the financial institution that issued the credit card to the consumer. 2  Many issuers offer protection to the consumer beyond the minimums set under federal law, and an issuer may offer help or mediation in a dispute."}, {"url": "http://www.creditcards.com/credit-card-news/consumer-rights-for-credit-and-debit-cards-1282.php", "passage_text": "Disputing charges. If you decide to dispute an item on your credit card or debit card bill, the card issuer may do little more than pass on the merchant's response, or the issuer may simply indicate that it did not make a mistake."}, {"url": "https://www.consumer.ftc.gov/articles/0219-disputing-credit-card-charges", "passage_text": "To take advantage of this protection, you must have made the purchase (it must be for more than $50) in your home state or within 100 miles of your current billing address, and make a good faith effort to resolve the dispute with the seller first."}]