[{"url": "http://www.protocol-online.org/biology-forums/posts/41050.html", "passage_text": "But cDNA is reverse transcribed RNA, thus it represent the transcript of the genomic DNA. There are several differences between transcript and genomic DNA, first, cDNA doesn't contain introns. cDNAs are much shorter, as introns can span thousands of pase pairs, and therefore easily cloned and worked with."}, {"url": "http://www.majordifferences.com/2013/11/difference-between-genomic-and-cdna.html", "passage_text": "The resulting double stranded DNA fragments are then inserted into a suitable vector and cloned, creating a population of clones called cDNA library. Since, a cDNA library is derived from mRNA, the library contains the coding region of expressed genes only, with no introns or regulatory regions. Such a library lacks the non coding DNA that makes up a large portion of many eukaryotic genomes. Vectors used genomic library include plasmid, cosmid, lambda phage, BAC and YAC in order to accommodate large fragments. Vectors used cDNA library include plasmid, phagemids, lambda phage etc to accommodate small fragments as cDNA has no introns."}, {"url": "http://www.majordifferences.com/2013/11/difference-between-genomic-and-cdna.html", "passage_text": "DNA fragments are generated by cutting the DNA with a specific restriction endonuclease.These fragments are ligated into a vector molecules and the collection of recombinant molecules is transferred into host cells, one molecule in each cell. Vectors used genomic library include plasmid, cosmid, lambda phage, BAC and YAC in order to accommodate large fragments. Vectors used cDNA library include plasmid, phagemids, lambda phage etc to accommodate small fragments as cDNA has no introns."}, {"url": "http://humangenes.org/cdna-complementary-dna", "passage_text": "cDNA (Complementary DNA). The term cDNA refers to complementary DNA. cDNA is known to be synthesized, or manufactured from an mRNA or messenger RNA template. It is synthesized in a reaction that is catalyzed by the reverse transcriptase and DNA polymerase enzymes"}, {"url": "http://passel.unl.edu/pages/informationmodule.php?idinformationmodule=959197140&topicorder=15&maxto=16", "passage_text": "A summary of key differences between cDNA and genomic libraries is given below. cDNA library vs. Genomic Library 1) The cDNA clone will only contain the sequences found in the mRNA, not the entire gene while the genomic clone could have the sequences of the entire gene. The “c” in cDNA stands for copy because a double stranded DNA copy is made from a mRNA. Because of the different starting material, cDNA libraries will have some key distinctions from a genomic library. The reasons for the differences above are because of the nature of gene expression."}, {"url": "http://ocw.mit.edu/courses/biology/7-01sc-fundamentals-of-biology-fall-2011/recombinant-dna/cdna-libraries-and-expression-libraries/", "passage_text": "Session Overview. This session will review how to make a recombinant cDNA library and how to use this library to find a specific gene. This session will outline the differences between a genomic and a cDNA library, and discuss how to use a cDNA library to clone a gene of interest. Learning Objectives. 1  To understand what a recombinant cDNA library is and how it is constructed. "}, {"url": "http://www.differencebetween.com/difference-between-dna-and-vs-cdna/", "passage_text": "DNA vs cDNA. DNA and cDNA are kinds of nucleic acids; both are made up of nucleotides. Even though, they are structurally similar, their function and the way of synthesis differs from each other. DNA. DNA is a nucleic acid that contains the genetic instructions used in all eukaryotes and some prokaryotes. DNA is synthesized naturally while cDNA is a form of DNA which is synthesized by the scientist for their experimental purpose. Genomic DNA contains both introns and exons but cDNA is made up of only exons, which codes for specific functions. cDNAs are much shorter, as introns can span thousands of base pair"}, {"url": "http://funnelbrain.com/c-778948-three-key-differences-between-genomic-cdna-library.html", "passage_text": "A genomic library contains all the DNA sequences found in a genome. A cDNA library contains all the DNA sequences that are transcribed into mRNA. A genomic library must contain a large number of clones to ensure that all DNA sequences are represented. A cDNA library is enriched with fragments from actively transcribed genes and introns do not interrupt the cloned sequences."}, {"url": "http://www.differencebetween.com/difference-between-genomic-and-vs-plasmid-dna/", "passage_text": "They are plasmids. Both genomic and plasmid DNA are composite of nucleotides; therefore, the chemical structure of DNA is same in both. Although, both plasmids and bacterial genomic DNA are circular, eukaryotic DNA are linear, and all genomic DNA, either eukaryotic or prokaryotic, are double stranded. "}]