[{"url": "https://en.wikipedia.org/wiki/Lambada", "passage_text": "Lambada (pronunciation (help·info)) is a dance from Para, Pará. Brazil lambada is An-Afro brazilian dance authentic to people Of/Black african descent who brought much of their music and dance culture with them Into brazil upon arrival into the country during The Transatlantic Slave. trade Although it was recognized as a summer hit, the Lambada was not yet a true worldwide success. Many of the first lambaterias (a place to dance Lambada) which opened in 1988 couldn't survive the low tourism of the winter season, and closed a few months later."}, {"url": "https://en.wikipedia.org/wiki/Lambada_(song)", "passage_text": "Lambada , also known as  Chorando Se Foi (Lambada)  or  Llorando se fue (Lambada) , is a song recorded by French pop group Kaoma. It features guest vocals by Brazilian vocalist Loalwa Braz. It was released on November 2005 as the third single from the album. She also recorded the song on her second live album. The British girl group Spice Girls mention Lambada - either the song or the dance-in their 1998 hit single  Spice Up Your Life ."}, {"url": "https://en.wikipedia.org/wiki/Lambada_(song)", "passage_text": "Chorando Se Foi (Lambada) was the 37th best-selling single of the United Kingdom during 1989. In France, where it topped the chart for 12 weeks and sold almost two million copies, the single was the number-one on the year-end list. It was released on November 2005 as the third single from the album. She also recorded the song on her second live album. The British girl group Spice Girls mention Lambada - either the song or the dance-in their 1998 hit single  Spice Up Your Life ."}, {"url": "https://en.wikipedia.org/wiki/Lambada_(song)", "passage_text": "It was found in her Lambada album, which was released in 1990. Ivete Sangalo recorded a live version of the song as a bonus track for her 2005 album As Super Novas. It was released on November 2005 as the third single from the album. She also recorded the song on her second live album. The British girl group Spice Girls mention Lambada - either the song or the dance-in their 1998 hit single  Spice Up Your Life ."}, {"url": "http://www.songfacts.com/detail.php?id=21968", "passage_text": "Both acts were connected as Kaoma and Chico and Roberta shared the same producer, Jean-Claude Bonaventure, and Kaoma's lead singer Loalwa Braz composed the duo's songs. As part of the Lambada craze, there were two movies released in 1990 that were based on the dance. One was called The Forbidden Dance and the other was simply called Lambada. The Forbidden Dance featured the Kaoma version of the song. Do you remember the Lambada dance craze of the late 1980s? For those of you too young to recall it, the Lambada is a Brazilian dance for couples, which is generally danced with arched legs, with the steps being from side to side or turning, with a pronounced movement of the hips."}, {"url": "https://en.wikipedia.org/wiki/Lambada_(song)", "passage_text": "Owing to its huge success outside Brazil, Chorando Se Foi (Lambada) was also recorded by Kaoma in English and Spanish. The song Sochna Kya from the 1990 Hindi film Ghayal copies the melody of Chorando Se Foi (Lambada).. The Japanese singer Akemi Ishii released a cover version in Japanese on March 21, 1990. It was released on November 2005 as the third single from the album. She also recorded the song on her second live album. The British girl group Spice Girls mention Lambada - either the song or the dance-in their 1998 hit single  Spice Up Your Life ."}, {"url": "http://cinema.theiapolis.com/movie-0YRW/lambada/", "passage_text": "Directed by Joel Silberg & Giandomenico Curi, and written by Sheldon Renan, Joel Silberg, and Giandomenico Curi, « Lambada » is a Drama/Comedy film, released in the USA on March 16 of 1990. Andy J. Forest and J. Eddie Peck are starring, alongside Vya Negromonte, Kayla Blake, Mary Sellers and Carlinhos de Jesus. Lambada was initially released on Friday, March 16, 1990, in the United States."}, {"url": "https://en.wikipedia.org/wiki/Lambada", "passage_text": "His first official disc, Lambada of Quebradas, was recorded in 1976 but officially launched two years later, in 1978. In the late 1980s, the fusion between the metallic and electronic music from Caribbean brought again a new face to the Carimbo. carimbó Although it was recognized as a summer hit, the Lambada was not yet a true worldwide success. Many of the first lambaterias (a place to dance Lambada) which opened in 1988 couldn't survive the low tourism of the winter season, and closed a few months later."}, {"url": "http://cinema.theiapolis.com/movie-0YRW/lambada/", "passage_text": "Joel Silberg was 62 years old in 1990, when Lambada&quot was released. Joel Silberg has directed movies such as  Kuni Leml B'Kahir , released in 1983,  Nisuin Nusah Tel Aviv  (1979) ,  Haham Gamliel  (1973) ,  Rappin'  (1985) ,  Mishpahat Simhon  (1964) , and  Ahava Ilemeth  (1982) . Lambada was initially released on Friday, March 16, 1990, in the United States."}, {"url": "http://www.songfacts.com/detail.php?id=21968", "passage_text": "The song that launched the Lambada dance craze was this 1989 worldwide hit recorded by the French pop group Kaoma with lead vocals by Paris-based Brazilian Loalwa Braz. It sold over 5 million copies in 1989, reached #1 on eleven different charts and was the best selling single in Europe that year. Do you remember the Lambada dance craze of the late 1980s? For those of you too young to recall it, the Lambada is a Brazilian dance for couples, which is generally danced with arched legs, with the steps being from side to side or turning, with a pronounced movement of the hips."}]