[{"url": "http://www.paihia.nz.com/", "passage_text": "Paihia is the hub of the Bay of Islands, where bus tours to other areas leave and boat trips around the bay begin. Paihia has a variety of accommodation types available and is almost wall to wall motels along both the waterfront and the road entering town. From Paihia you can take a ferry across to Russell, or it is a short drive (or thirty minute walk) to Waitangi where, on 6th February each year, the signing of the Treaty of Waitangi is commemorated and a carnival held. This is a great day to visit our most important heritage site."}, {"url": "http://www.bayofislands.net/maps/paihia/", "passage_text": "This is our interactive Map of paihia-you can zoom right in, move the map around, and even see satellite photos of the the Bay. If you're looking to have a wee look-around before you get to Paihia then this Map of Paihia should be what you're looking for. Loading Map of Paihia ... "}, {"url": "https://en.wikipedia.org/wiki/Paihia", "passage_text": "Paihia is the main tourist town in the Bay of Islands in the far north of the North Island of New Zealand. It is located close to the historic towns of Russell and Kerikeri, 60 kilometres north of Whangarei. Missionary Henry Williams named the mission station Marsden's Vale and eventually the Paihia became the accepted name of the settlement. Bishop William Grant Broughton (the first and only Bishop of Australia) visited the Paihia mission in 1838 and performed several firsts in New Zealand including the first Confirmation and Ordination ceremonies."}, {"url": "http://www.newzealand.com/int/paihia/", "passage_text": "If you want to discover the coves and beaches of the Bay of Islands, Paihia is the perfect place to start. Cruises of all types leave from the wharf daily. Paihia is an excellent base from which to explore the Bay of Islands. It has an extensive choice of accommodation, delicious dining options and a good-sized town centre. From the wharf you can arrange a trip to the outer islands, hook into a fishing expedition or catch ferry to Russell. "}, {"url": "http://gonewzealand.about.com/od/Bay-Of-Islands-Destinations/fl/Paihia-Visitors-Guide.htm", "passage_text": "The small village of Paihia is often called The Gateway to the Bay of Islands. It is the main base for all of the tours operating in this most popular spot in Northland. Paihia has an important history in the development of New Zealand as a nation. It is only a kilometer from the Treaty Grounds at Waitangi. Paihia Location and Getting There. Paihia is the Bay of Islands in the center of Northland in the North Island. It is 60 kilometers (37 miles) north of Whangarei and 23 kilometers (14 miles) from Kerikeri. There are two roads leading to Paihia. From the south, take the main highway north from Whangarei and continue on at the Kawakawa turnoff"}, {"url": "http://www.northlandnz.com/visit/northlands-regions/bay-of-islands/paihia-bay-of-islands?p=destinations/paihia", "passage_text": "Paihia is just 3 hours drive North of Auckland and is known as the jewel of the magnificent Bay Of Islands. Amazing beaches and a host of islands make this an aquatic playground and ultimate retreat. Paihia Wharf. If adventure is what you seek, you can skydive, parasail, scuba dive or go exploring on a sea kayak. "}, {"url": "http://www.accommodation.nz.com/bay-of-islands/paihia/", "passage_text": "Hotel Paihia. Hotel Accommodation-Paihia-Bay of Islands. Location. Located close to the centre of Paihia and its major tourist attractions, Hotel Paihia is ideally positioned as a base from where to explore the Bay of Islands. The hotel is situated in an attractive and peaceful bush setting, 400 metres from the shopping centre and waterfront. Rooms. Apartment Accommodation-Paihia-Bay of Islands. Location. Located right in the heart of the bay, the Clarion Collection Edgewater Palms is at the historic part of Russell and Kerikeri. A 5 minutes stroll along the waterfront leads to Paihia's buzzing wharf area, shops, restaurants and cafes."}, {"url": "http://www.tourism.net.nz/region/northland/northland---bay-of-islands/paihia", "passage_text": "Paihia. Paihia is a tourist town in the heart of the Bay of Islands in the Northland region of the North Island. It lies 23km south-east of Kerikeri with Waitangi immediately to its north and Russell on the opposite shore. Paihia is normally accessed by road from nearby Opua. Adjoining Paihia 3km to the north is Waitangi, the site of the historic treaty signed in 1840 between Maori and the British. Paihia is a major tourist destination and well geared for providing accommodation, eateries and tours. BALI HAI MOTEL-Paihia. Bali Hai Motel, located in beautiful Paihia, known as the Jewel of the Bay of Islands, is a small, personable motel, offering spacious studios and one and two-bedroom units."}, {"url": "https://en.wikipedia.org/wiki/Paihia", "passage_text": "Henry Williams and his wife Marianne settled in Paihia in 1823 and built the first church in New Zealand there the same year. William Williams and his wife Jane joined the Paihia mission in 1826. Bishop William Grant Broughton (the first and only Bishop of Australia) visited the Paihia mission in 1838 and performed several firsts in New Zealand including the first Confirmation and Ordination ceremonies."}]