[{"url": "http://www.plant-biology.com/Nucleolus-Function.php", "passage_text": "Nucleolus Function. The nucleolus (nucleoli, plural) is one of the most important components of the cell nucleus, and is far the most easily recognized substructure in the nucleus of eukaryotic cells. It can easily be determined by phase contrast microscopy and with the use of different dyes. Define Nucleolus. The definition of nucleolus can be described as the place where the biogenesis of ribosomal subunits and ribosomal rRNA occurs. Or that of a non-membrane bound structure that is also composed of nucleic acids, found within the nucleus."}, {"url": "http://study.com/academy/lesson/what-is-a-nucleolus-definition-function-quiz.html", "passage_text": "It is not surrounded by a membrane but sits in the nucleus. The nucleolus makes ribosomal subunits from proteins and ribosomal RNA, also known as rRNA. It then sends the subunits out to the rest of the cell where they combine into complete ribosomes. Ribosomes make proteins; therefore, the nucleolus plays a vital role in making proteins in the cell"}, {"url": "http://biology.about.com/od/cellanatomy/p/nucleus.htm", "passage_text": "The Cell Nucleus: The cell nucleus is a membrane bound structure that contains the cell's hereditary information and controls the cell's growth and reproduction. It is the command center of a eukaryotic cell and is commonly the most prominent organelle in a cell. Distinguishing Characteristics: The Nucleolus: Contained within the nucleus is a dense structure composed of RNA and proteins called the nucleolus. The nucleolus contains nucleolar organizers, which are parts of chromosomes with the genes for ribosome synthesis on them."}, {"url": "https://en.wikipedia.org/wiki/Nucleolus", "passage_text": "The talk page may contain suggestions. (October 2012). The nucleolus is contained within the cell nucleus. The nucleolus (/nuːˈkliːɵləs/ ; plural nucleoli /nuːˈkliːɵlaɪ/) is the largest structure in the nucleus of eukaryotic cells, where it primarily serves as the site of ribosome synthesis and assembly. "}, {"url": "http://micro.magnet.fsu.edu/cells/nucleus/nucleolus.html", "passage_text": "The Nucleolus. The nucleolus is a prominent sub-nuclear structure that is not bound by a membrane and resides within the nuclear matrix. Though known to exist since the eighteenth century, the primary function of the nucleolus was not discovered until the 1960s. The Nucleolus The nucleolus is a prominent sub-nuclear structure that is not bound by a membrane and resides within the nuclear matrix."}, {"url": "http://www.biology-online.org/dictionary/Nucleolus", "passage_text": "Nucleolus. Definition. noun, plural: nucleoli. The round granular structure within the nucleus of a cell, and composed of protein and RNA. Supplement. Nucleolus is involved with ribosomal RNA synthesis and formation of ribosomes in eukaryotes. Word origin: New Latin, from Latin, diminutive of nucleus, kernel."}, {"url": "http://www.els.net/WileyCDA/ElsArticle/refId-a0005975.html", "passage_text": "The nucleolus is the nuclear subdomain that assembles ribosomal subunits in eukaryotic cells. The nucleolar organiser regions of chromosomes, which contain the genes for pre‐ribosomal ribonucleic acid (rRNA), serve as the foundation for nucleolar structure. 1 The nucleolus, whose primary function is to assemble ribosomes, is the largest structure in the cell nucleus. 2  The nucleolus organiser regions of chromosomes, which harbour the genes for pre‐rRNA, are the foundation for the nucleolus."}, {"url": "http://biology.tutorvista.com/animal-and-plant-cells/nucleus.html", "passage_text": "The nucleolus is not surrounded by a membrane, it is a densely stained structure found in the nucleus. The nucleoli are formed around the nuclear organizer regions. It synthesizes and assembles ribosomes and r RNA. The number of nucleoli is different from species to species but within a species the number is fixed. Animal cell nucleus is a membrane bound organelle. It is surrounded by double membrane. The nucleus communicates with the surrounding cell cytoplasm through the nuclear pores. The DNA in the nucleus is responsible for the hereditary characteristics and protein synthesis."}, {"url": "http://www.ducksters.com/science/biology/cell_nucleus.php", "passage_text": "1 Nucleolus-The nucleolus is a large structure in the nucleus that mainly makes ribosomes and RNA. 2  Nucleoplasm-The nucleoplasm is the liquid that fills the inside of the nucleus. 3  Chromatin-Chromatin are composed of proteins and DNA. "}]