[{"url": "http://www.learnersdictionary.com/definition/count", "passage_text": "Save. count /ˈkaʊnt/ verb. counts; counted; counting. count. /ˈkaʊnt/. verb. counts; counted; counting. Learner's definition of COUNT. 1. a: to add (people or things) together to find the total number. "}, {"url": "http://www.learnersdictionary.com/definition/count%20noun", "passage_text": "plural count nouns. Learner's definition of COUNT NOUN. [count] grammar. : a noun (such as bean or ball) that has both a singular and plural form and can be used after a numeral, after words such as many or few, or after the indefinite article a or an — compare noncount noun. Comments & Questions. Comments & Questions. "}, {"url": "http://www.yourdictionary.com/count", "passage_text": "count-Legal Definition. multiple counts. separate count. n. 1  In a civil action, the statement of a distinct cause of action in a complaint or similar pleading. The definition of count is the act of adding up or calculating, or the final number. 1  An example of a count is the act of adding up how many fish are in a pond."}, {"url": "http://www.mayoclinic.org/tests-procedures/complete-blood-count/basics/definition/prc-20014088", "passage_text": "Definition. A complete blood count (CBC) is a blood test used to evaluate your overall health and detect a wide range of disorders, including anemia, infection and leukemia. A complete blood count test measures several components and features of your blood, including: 1  Red blood cells, which carry oxygen. 2  White blood cells, which fight infection. "}, {"url": "http://www.webster-dictionary.org/definition/count", "passage_text": "1. To number or be counted; to possess value or carry weight; hence, to increase or add to the strength or influence of some party or interest; as, every vote counts; accidents count for nothing. This excellent man. . . counted among the best and wisest of English statesmen. He was brewer to the palace; and it was apprehended that the government counted on his voice. - Macaulay. I think it a great error to count upon the genius of a nation as a standing argument in all ages. - Swift"}, {"url": "http://idioms.thefreedictionary.com/count+on", "passage_text": "count on somebody. to expect someone to help you when you need them I'm counting on you to tell me everything they say. Usage notes: sometimes used to show that you expect a problem: You can always count on Michael to screw things up. See also: count, on. "}, {"url": "http://www.yourdictionary.com/count", "passage_text": "Counting with cookies. Counting with cookies. The definition of count is the act of adding up or calculating, or the final number. 1  An example of a count is the act of adding up how many fish are in a pond."}, {"url": "http://medical-dictionary.thefreedictionary.com/count", "passage_text": "count. a numerical computation or indication. Addis count the determination of the number of erythrocytes, leukocytes, epithelial cells, and casts, and the protein content in an aliquot of a 12-hour urine specimen; used in the diagnosis and management of kidney disease. blood count (blood cell count) see blood count."}, {"url": "http://www.thefreedictionary.com/count+on", "passage_text": "count. 1. To note (items) one by one so as to get a total: enumerate, number, numerate, reckon, tally, tell. 2. To be of significance or importance: import, matter, signify, weigh. 3. To indicate (time or rhythm), as with repeated gestures or sounds: beat. "}]