[{"url": "http://www.digitalhistory.uh.edu/era.cfm?eraID=3&smtid=1", "passage_text": "Much more than a revolt against British taxes and trade regulations, the American Revolution was the first modern revolution. It marked the first time in history that a people fought for their independence in the name of certain universal principles such as rule of law, constitutional rights, and popular sovereignty. "}, {"url": "https://en.wikipedia.org/wiki/George_Washington_in_the_American_Revolution", "passage_text": "George Washington (February 22, 1732 – December 14, 1799) commanded the Continental Army in American Revolutionary War (1775–1783), and was the first President of the United States, serving from 1789 to 1797. His involvement began as early as 1767, when he first took political stands against the acts of the British Parliament. After the war broke out with the Battles of Lexington and Concord in April 1775, his role became military with his appointment as commander-in-chief of the Continental Army."}, {"url": "http://www.answers.com/Q/What_did_american_revolution_accomplish", "passage_text": "However, the American Revolution did not accomplish what many think it accomplished -- the securing of life, liberty and property for all Americans. When looking at the American Revolution, what it failed to accomplish stands out more than what the Revolution actually accomplished. The colonists were trying to achieve a protection of liberty and a protection of their natural rights."}, {"url": "http://www.answers.com/Q/What_did_american_revolution_accomplish", "passage_text": "George Washington was in charge of the Continental Army in the American Revolution. Many of the troops only joined the army because they trusted and admired Washington. On Dec … ember 25, 1776, Washington's troops rowed across the Delaware River to New Jersey where they attacked the Hessians at Trenton. When looking at the American Revolution, what it failed to accomplish stands out more than what the Revolution actually accomplished. The colonists were trying to achieve a protection of liberty and a protection of their natural rights."}, {"url": "http://www.answers.com/Q/What_did_american_revolution_accomplish", "passage_text": "The American Revolution is called a revolution because it is the  war in which the original 13 colonies of the US decided to revolt  against the British monarchy (this happened because of the high  taxes that the paid on imported goods). When looking at the American Revolution, what it failed to accomplish stands out more than what the Revolution actually accomplished. The colonists were trying to achieve a protection of liberty and a protection of their natural rights."}, {"url": "https://en.wikipedia.org/wiki/American_Revolution", "passage_text": "The American Revolution was a political upheaval that took place between 1765 and 1783 during which colonists in the Thirteen American Colonies rejected the British monarchy and aristocracy, overthrew the authority of Great Britain, and founded the United States of America. The American Revolution was the first wave of the Atlantic Revolutions: the French Revolution, the Haitian Revolution, and the Latin American wars of independence. Aftershocks reached Ireland in the Irish Rebellion of 1798, in the Polish-Lithuanian Commonwealth, and in the Netherlands."}, {"url": "http://www.history.com/topics/american-revolution/american-revolution-history", "passage_text": "The American Revolution (1775-83) is also known as the American Revolutionary War and the U.S. War of Independence. The conflict arose from growing tensions between residents of Great Britain’s 13 North American colonies and the colonial government, which represented the British crown. Lead Up to the Revolutionary War. For more than a decade before the outbreak of the American Revolution in 1775, tensions had been building between colonists and the British authorities."}, {"url": "http://www.mountvernon.org/george-washington/the-revolutionary-war/", "passage_text": "Learn more about how General George Washington led the American army to victory in the Revolutionary War. In June 1775, Congress ordered General George Washington to take command of the Continental Army besieging the British in Boston. "}, {"url": "https://en.wikipedia.org/wiki/American_Revolution", "passage_text": "A combined American–French force captured a second British army at Yorktown in 1781, effectively ending the war in the United States. A peace treaty in 1783 confirmed the new nation's complete separation from the British Empire. The American Revolution was the first wave of the Atlantic Revolutions: the French Revolution, the Haitian Revolution, and the Latin American wars of independence. Aftershocks reached Ireland in the Irish Rebellion of 1798, in the Polish-Lithuanian Commonwealth, and in the Netherlands."}, {"url": "http://www.myrevolutionarywar.com/", "passage_text": "The American Revolutionary War (1775-1783), also known as the American War of Independence, was a war between the Kingdom of Great Britain and thirteen British colonies on the North American continent (as well as some naval conflict). In early 1778, shortly after an American victory at Saratoga, France entered the war against Britain; Spain and the Netherlands joined as allies of France over the next two years."}]