[{"url": "http://publicdomainreview.org/collections/roundhay-garden-scene-1888/", "passage_text": "Roundhay Garden Scene (1888). Roundhay Garden Scene is an 1888 short film directed by inventor Louis Le Prince, considered to be the world’s first film ever made using a motion picture camera. "}, {"url": "http://www.answers.com/Q/What_was_the_first_movie_ever_made", "passage_text": "It was filmed by Georges Melies in France in 1896.    There is a slig … ht conflict as to which movie was the first horror  film. First, The Execution of Mary Stuart was produced by  American inventor Thomas Edison in 1895. In reality  the 1st to make a film was by a  photographic pioneer named Eadweard  Muybridge who in 1878 made The  Horse in Motion which was a series of  Stereographic images of a galloping horse.   * A Brief similar video can be seen on You Tube under the  heading First Movie Ever Made."}, {"url": "http://wanttoknowit.com/what-was-the-first-movie-ever-made/", "passage_text": "Read on to find out. The First Ever Movie. As with most things, it is difficult to pinpoint exactly which movie was the first ever made. Defining “movie” as capturing the movement of someone or something in real time then the first ever movie was taken in 1878 by Eadweard Muybridge. What Was the First Movie Ever Made. 27 May, 2011 what was 0. Today we have thousands of choices when it comes to movies. We can choose to watch a comedy, drama, thriller or even an animated movie. We also have the choice of watching at the cinema or a DVD, Blu-Ray or 3D version of the movie."}, {"url": "http://www.answers.com/Q/What_was_the_first_movie_ever_made", "passage_text": "Nosferatu was the first Dracula movie ever made which came out in 1922. There was a silent film featuring a vampire released in 1913 called the Vampire, which to my knowledge … was actually the first vampire movie. Vampire of the coast in (1909) was the first vampire movie ever made and it was a silent movie. In reality  the 1st to make a film was by a  photographic pioneer named Eadweard  Muybridge who in 1878 made The  Horse in Motion which was a series of  Stereographic images of a galloping horse.   * A Brief similar video can be seen on You Tube under the  heading First Movie Ever Made."}, {"url": "http://www.filmsite.org/pre20sintro.html", "passage_text": "The Kiss (1896) (aka The May Irwin Kiss) was the first film ever made of a couple kissing in cinematic history. May Irwin and John Rice re-enacted a lingering kiss for Thomas Edison's film camera in this 20-second long short, from their 1895 Broadway stage play-musical The Widow Jones. "}, {"url": "http://www.answers.com/Q/What_was_the_first_horror_movie_ever_made", "passage_text": "It was filmed by Georges Melies in France in 1896. There is a slight conflict as to which movie was the first horror film. First, The Execution of Mary Stuart was produced by American inventor Thomas Edison in 1895. It was only 18 seconds in length, and it depicted a woman being beheaded. There was a silent film featuring a vampire released in 1913 called the Vampire, which to my knowledge … was actually the first vampire movie. Vampire of the coast in (1909) was the first vampire movie ever made and it was a silent movie."}, {"url": "http://www.answers.com/Q/What_was_the_first_movie_ever_made", "passage_text": "The first sequel ever made was Fall of a Nation (1916), a follow-up to D.W. Griffith's Birth of a Nation (1915). The first sequel containing a number was The Godfather: P … art II (1974). In reality  the 1st to make a film was by a  photographic pioneer named Eadweard  Muybridge who in 1878 made The  Horse in Motion which was a series of  Stereographic images of a galloping horse.   * A Brief similar video can be seen on You Tube under the  heading First Movie Ever Made."}, {"url": "https://answers.yahoo.com/question/index?qid=20080705175138AA0k8Qk", "passage_text": "The generally accepted answer to the first film shot in color was Cupid Angling made in 1918, the Wizard or Oz and Gone With The Wind were made in Technicolor in 1939, a process that had been around for quite some time by then. There were hand colored segments in movies dating back to 1902. Best Answer: An easy answer would be The Wizard of Oz or Gone With the Wind which were released in 1939, but these are just the most famous of early color movies. To get to the world's first color movie we still have a ways to go back. As early as 1902 short films were made and the frames hand tinted to create color."}, {"url": "http://headsup.boyslife.org/what-was-the-first-movie-ever-made/", "passage_text": "The video provedthat they indeed were and, more importantly, motion photography was born. 1888 – Roundhay Garden Scene. The world’s earliest surviving motion-picture film, showing actual consectuve action is called Roundhay Garden Scene. It’s a short film directed by French inventor Louis Le Prince. While it’s just 2.11 seconds long, it is technically a movie. This is a great question, and a somewhat complicated one. In the late 1880’s various people began experimenting with photo, blending them together to give the illusion of a motion picture. But the technology and difficulty to capture that sort of video made motion pictures rare."}]