[{"url": "https://en.wikipedia.org/wiki/Paracetamol", "passage_text": "Paracetamol, also known as acetaminophen or APAP, is a widely used over-the-counter pain medication and medication to reduce fever. While generally safe for use at recommended doses, even small overdoses can be fatal. Compared to other over-the-counter pain relievers, paracetamol is significantly more toxic in overdose but may be less toxic when used chronically at recommended doses."}, {"url": "http://www.healthnavigator.org.nz/medicines/p/paracetamol/", "passage_text": "1 Paracetamol is the most commonly used pain relief medicine in New Zealand and many countries around the world. 2  It can be safely used by adults, children and pregnant women, to relieve pain and reduce fever. "}, {"url": "https://en.wikipedia.org/wiki/Paracetamol", "passage_text": "It is commonly used to help with headaches, other minor aches and pains, and is a major ingredient in many cold medications. In combination with opioid analgesics, paracetamol is used in the management of more severe pain such as post-surgical and cancer pain. Though paracetamol is used to treat inflammatory pain, it is not classified as an NSAID because it exhibits only weak anti-inflammatory activity. While generally safe for use at recommended doses, even small overdoses can be fatal. Compared to other over-the-counter pain relievers, paracetamol is significantly more toxic in overdose but may be less toxic when used chronically at recommended doses."}, {"url": "http://www.nurofen.co.nz/pain-relief/pain-killers/ingredients.php", "passage_text": "What can ibuprofen be used for? Ibuprofen is effective in the relief of inflammation and/or pain associated with headaches, backache, muscular aches, arthritic pain, rheumatic pain, neuralgia, some cold and flu symptoms, period pain, dental pain, and it reduces fever. Ibuprofen is an NSAID (non-steroidal anti-inflammatory drug) - the term used for a whole group of medicines that have pain-relieving (analgesic), anti-inflammatory and fever-relieving (antipyretic) properties."}, {"url": "http://www.nhs.uk/Livewell/Pain/Pages/Whichpainkiller.aspx", "passage_text": "For pain associated with inflammation, such as back pain or headaches, paracetamol and anti-inflammatory painkillers work best. If the pain is caused by sensitive or damaged nerves, as is the case with shingles or sciatica, it is usually treated with tablets that are also used for epilepsy and depression. "}, {"url": "http://www.nurofen.com.au/advice-on-use/what-is-paracetamol-what-do-i-use-paracetamol-for/", "passage_text": "At over-the-counter doses, paracetamol is commonly used to provide temporary relief of pain and discomfort associated with: 1  Headaches (e.g. migraines, tension headaches). 2  Muscle pain (e.g. strains and sprains, sport injuries). 3  Backache. 4  Toothache. 5  Muscle ache. 6  Arthritis (including osteoarthritis). 7  Cold and flu symptoms. "}, {"url": "http://www.familydoctor.co.nz/categories/medication/paracetamol-a-patients-guide/", "passage_text": "Use: for fever and pain relief. Paracetamol is a medicine that is used for mild to moderate pain and fever in adults and children. Paracetamol is often used in people who cannot take anti-inflammatories (e.g. due to stomach ulcer), as it is gentle on the stomach. Paracetamol is an ingredient in: 1  Many cold and flu tablets. 2  Cold and flu drinks e.g. 3  Lemsip. 4  Some cough mixtures. 5  Combination pain relievers, e.g. 6  Digesic, Panadeine, Codcomol, Pirophen. 7  Some migraine tablets e.g."}, {"url": "http://www.nhs.uk/Conditions/Painkillers-paracetamol/Pages/Introduction.aspx", "passage_text": "Paracetamol is a painkilling (analgesic) medicine available over-the-counter without a prescription. Paracetamol can be used to 1  : ease mild to moderate pain – for example, headaches, sprains, or toothache. 2  control a fever (high temperature, also known as pyrexia) – for example, when someone has the flu (influenza). Paracetamol should be used with caution by those with liver problems, kidney problems, or alcohol dependence. Read more about special considerations for paracetamol. Side effects are rare but can include a rash or swelling. Read more about side effects of"}, {"url": "http://www.nurofen.co.nz/pain-relief/pain-killers/ingredients.php", "passage_text": "Paracetamol is effective in the relief of pain such as headaches, backache, muscular aches, rheumatic pain, neuralgia, cold and flu symptoms, period pain, dental pain and fever. Ibuprofen is an NSAID (non-steroidal anti-inflammatory drug) - the term used for a whole group of medicines that have pain-relieving (analgesic), anti-inflammatory and fever-relieving (antipyretic) properties."}, {"url": "http://www.familydoctor.co.nz/categories/medication/paracetamol-a-patients-guide/", "passage_text": "For children, paracetamol is the most commonly prescribed medicine to reduce a high temperature or for pain relief. It works by blocking the making of prostaglandins (pros-ta-glan-dins) which can cause pain (including headaches), fever (high temperature), and inflammation (swelling and redness). Paracetamol is an ingredient in: 1  Many cold and flu tablets. 2  Cold and flu drinks e.g. 3  Lemsip. 4  Some cough mixtures. 5  Combination pain relievers, e.g. 6  Digesic, Panadeine, Codcomol, Pirophen. 7  Some migraine tablets e.g."}]