[{"url": "http://www.keen.com/CommunityServer/UserBlogPosts/SUPERNATURAL_INTERVENTION/Spell-to-bring-someone-back-with-honey/436166.aspx", "passage_text": "Spell to bring someone back with honey. To Attract a Love one… You will need a photograph of your love one. Pure Honey 100% from the bees. A Red Piece of Clothe A clear cup with a lid A Red Pen. This need to be done in a Tuesday or Friday…. Now the Day that your ready to cast this spell I need you to grab his or her photograph and concentrate on him coming back to you. Open the cup, write his or her complete name with the red pen on back of his photograph. Merge his image on the cup and pour honey on top."}, {"url": "http://www.bbc.com/future/story/20140704-i-bring-the-dead-back-to-life", "passage_text": "“When you are at 10C, with no brain activity, no heartbeat, no blood – everyone would agree that you’re dead,” says Peter Rhee at the University of Arizona, Tucson. “But we can still bring you back.”. Safar’s work began to change our perceptions of death – blurring the point that is meant to mark the end of our lives. “We’ve all been brought up to think death is an absolute moment – when you die you can’t come back,” says Sam Parnia, at the State University of New York in Stony Brook."}, {"url": "http://www.cbsnews.com/news/brought-back-from-the-dead/", "passage_text": "CBS News. A lot of doctors will stop compressions after about 20 minutes, said Dr. Parnia. But we know from research that if you go on for 40 minutes to an hour, your chances of bringing someone back to life is much, much higher.. In Joe Tiralosi's case, it was all by hand. My heart stopped, and the nurse was -- I heard screaming. And that was it.. But that wasn't it. Tiralosi was brought back from the dead. He says it was divine intervention, but it's also a testament to perseverance of his medical team, and the power of some bone-chilling cold."}, {"url": "http://audienceservices.cbs.com/feedback/feedback.htm", "passage_text": "Q. How can I leave a recorded comment about a CBS program? A. If you telephone 212-975-3247 outside the above stated hours, you will hear a recording ....and be given an opportunity to leave a comment. Please be advised that we ....do not, under any circumstances, return phone calls from viewers. "}, {"url": "http://deadline.com/2014/03/spoilers-good-wife-bombshell-josh-charles-703100/", "passage_text": "UPDATED: CBS ‘ The Good Wife already went through a major reset at the beginning of the season when Alicia (Julianna Margulies) left Lockhart Gardner, finding herself locking horns with her former boss, friend (and on-and-off flame) Will Gardner (Josh Charles). Every week I can’t wait to get to my PVR to watch Good Wife. Tonight, I have no desire to watch it. First, Will leaving is a horrible blow to the show. Second, if he had to leave, I could have lived with it if he didn’t leave in a such a violent way."}, {"url": "https://www.facebook.com/CBSEveningNews", "passage_text": "You don’t want to miss part two of our investigation in to Blue Bell Ice Cream on tonight’s CBS Evening News with Scott Pelley. We sit down with the CDC and the South Carolina Department of Health and Environmental Control. CBS Evening News with Scott Pelley shared CBS News's photo. Yesterday at 10:10am ·. Head over to the CBS News page to ask Nancy Cordes a question about tonight's ‪#‎DemDebate‬ ."}, {"url": "http://www.cbsnews.com/news/brought-back-from-the-dead/", "passage_text": "He told Smith the level of progress in resuscitation after people die has advanced enormously: It's astonishing.. Bringing the dead back to life has been a dream of humankind since the beginning of time. My heart stopped, and the nurse was -- I heard screaming. And that was it.. But that wasn't it. Tiralosi was brought back from the dead. He says it was divine intervention, but it's also a testament to perseverance of his medical team, and the power of some bone-chilling cold."}, {"url": "http://www.bbc.com/future/story/20140704-i-bring-the-dead-back-to-life", "passage_text": "The ultimate comeback: Bringing the dead back to life. A radical procedure that involves replacing a patient's blood with cold salt water could retrieve people from the brink of death, says David Robson. facebook. Safar’s work began to change our perceptions of death – blurring the point that is meant to mark the end of our lives. “We’ve all been brought up to think death is an absolute moment – when you die you can’t come back,” says Sam Parnia, at the State University of New York in Stony Brook."}, {"url": "http://www.youtube.com/user/CBSNewsOnline", "passage_text": "CBS News: Original Reporting. 84,221 views 2 years ago. Read more. At CBS News, we take pride in: digging a little deeper, following the story a little farther, asking questions no one else thought to ask, taking the time to make it all clear. So you don't just know what's happening, you know why. Show less"}, {"url": "http://www.keen.com/CommunityServer/UserBlogPosts/SUPERNATURAL_INTERVENTION/Spell-to-bring-someone-back-with-honey/436166.aspx", "passage_text": "# re: Spell to bring someone back with honey. Saturday, February 07, 2009 7:01 AM by SUPERNATURAL INTERVENTION. If you do not have a photograph then we can use a photograph paper and write his full name then use it as a photograph...Visualize him when doing it at all times....as if your looking at his photograph. This need to be done in a Tuesday or Friday…. Now the Day that your ready to cast this spell I need you to grab his or her photograph and concentrate on him coming back to you. Open the cup, write his or her complete name with the red pen on back of his photograph. Merge his image on the cup and pour honey on top."}]