[{"url": "https://en.wikipedia.org/wiki/Iron%28II%29_oxide", "passage_text": "Iron(II) oxide also refers to a family of related non-stoichiometric compounds, which are typically iron deficient with compositions ranging from Fe 0.84 O to Fe 0.95 O. Iron(II) oxide is used as a pigment. It is FDA-approved for use in cosmetics and it is used in some tattoo inks. It can also be used for filtering phosphates from home aquaria."}, {"url": "https://en.wikipedia.org/wiki/Iron(II)_hydroxide", "passage_text": "The iron(II) hydroxide reduces these ions to elemental selenium, which is insoluble in water and precipitates out. Note: pK sp = 15.097 where p is the-log and K sp is the Solubility Product Constant. This means it has a low tendency to dissolve, but is not entirely insoluble. Iron(II) hydroxide. Iron(II) hydroxide or ferrous hydroxide is a compound with the formula Fe(OH) 2. It is produced when iron(II) ions, from a compound such as iron(II) sulfate, react with hydroxide ions. Iron(II) hydroxide itself is practically white, but even traces of oxygen impart a greenish tinge."}, {"url": "https://en.wikipedia.org/wiki/Iron%28II%29_oxide", "passage_text": "Iron(II) oxide is the inorganic compound with the formula FeO. Its mineral form is known as wuestite. Wüstite one of several iron, oxides it is a-black colored powder that is sometimes confused with, rust which consists of hydrated(IRON) iii (oxide ferric). oxide Iron(II) oxide is used as a pigment. It is FDA-approved for use in cosmetics and it is used in some tattoo inks. It can also be used for filtering phosphates from home aquaria."}, {"url": "https://en.wikipedia.org/wiki/Iron(III)_oxide", "passage_text": "Iron(III) oxide or ferric oxide is the inorganic compound with the formula Fe 2 O 3. It is one of the three main oxides of iron, the other two being iron(II) oxide (FeO), which is rare, and iron(II,III) oxide (Fe 3 O 4), which also occurs naturally as the mineral magnetite. As the mineral known as hematite, Fe 2 O 3 is the main source of iron for the steel industry. Iron(III) oxide is a product of the oxidation of iron. It can be prepared in the laboratory by electrolyzing a solution of sodium bicarbonate, an inert electrolyte, with an iron anode:"}, {"url": "https://en.wikipedia.org/wiki/Iron(III)_oxide", "passage_text": "Several hydrates of Iron(III) oxide exists. When alkali is added to solutions of soluble Fe(III) salts, a red-brown gelatinous precipitate forms. This is not Fe(OH) 3, but Fe 2 O 3 ·H 2 O (also written as Fe(O)OH). Several forms of the hydrated oxide of Fe(III) exist as well. Iron(III) oxide is a product of the oxidation of iron. It can be prepared in the laboratory by electrolyzing a solution of sodium bicarbonate, an inert electrolyte, with an iron anode:"}, {"url": "https://en.wikipedia.org/wiki/Iron%28II%29_oxide", "passage_text": "Iron(II) oxide makes up approximately 9% of the Earth's mantle. Within the mantle, it may be electrically conductive, which is a possible explanation for perturbations in Earth's rotation not accounted for by accepted models of the mantle's properties. Iron(II) oxide is used as a pigment. It is FDA-approved for use in cosmetics and it is used in some tattoo inks. It can also be used for filtering phosphates from home aquaria."}, {"url": "http://www.lenntech.com/periodic/water/iron/iron-and-water.htm", "passage_text": "Many iron chelation complexes are water soluble. Usually there is a difference between water soluble Fe 2+ compounds and generally water insoluble Fe 3+ compounds. The latter are only water soluble in strongly acidic solutions, but water solubility increases when these are reduced to Fe 2+ under certain conditions. Usually the oxide layer does not protect iron from further corrosion, but is removed so more metal oxides can be formed. Electrolytes are mostly iron (II) sulphate, which forms during corrosion by atmospheric SO 2. In sea regions atmospheric salt particles may play an important role in this process."}]