[{"url": "http://www.josephbjacobs.com/pages/sinusitis", "passage_text": "Chronic Rhinosinusitis is a persistent inflammation and swelling of the membrane and tissue lining the nose, sinuses and their connecting or osteomeatal channels. The definition of a chronic nasal and sinus disorder is a combination of symptoms, discussed below, persisting more than 12 weeks. This same type of tissue lines all the passages of your nose as well as the small channels which connect the nose and sinuses. These channels, or ostiomeatal complex, which is pictured above with the gray shading, can become blocked by swollen tissue."}, {"url": "http://www.josephbjacobs.com/pages/sinusitis", "passage_text": "Sinusitis is an inflammation, thickening, and swelling of the normal tissue called mucosa, which lines all the sinuses. This same type of tissue lines all the passages of your nose as well as the small channels which connect the nose and sinuses. These channels, or ostiomeatal complex, which is pictured above with the gray shading, can become blocked by swollen tissue."}, {"url": "http://www.sinuses.com/ctscan.htm", "passage_text": "When we evaluate the sinuses for sinusitis, we look for thickening of the lining of the sinus. Note on the patient's left side (your right) at the + sign, there is a very sharp distinct border between the black air in the maxillary sinus and the white bone. Another important structure is the  ostiomeatal unit  which is the outflow tract from the sinuses and includes the ostium of each sinus as well as the meati. When blocked, the ostiomeatal unit can cause obstruction of the sinuses, analogous to putting a plug in a bathtub."}, {"url": "https://en.wikipedia.org/wiki/Sinusitis", "passage_text": "Sinusitis, also known as a sinus infection or rhinosinusitis, is inflammation of the sinuses resulting in symptoms. Common signs and symptoms include thick nasal mucous, a plugged nose, and pain in the face. "}, {"url": "https://www.healthtap.com/topics/polypoid-mucosal-thickening-in-maxillary-sinus", "passage_text": "4. Get help from a doctor now ›. Sinusitis: You have thickening of the right maxillary sinus due to inflammation, likely infection in the sinus. Your nasal septum is the part that divides the two sides of your nose. When deviated it can cause excessive mucosal thickening and difficulty breathing, especially at night"}, {"url": "http://emedicine.medscape.com/article/384649-overview", "passage_text": "Overview. Sinusitis is an inflammation of the mucosal lining of the paranasal sinuses. As the mucosa of the sinuses is continuous with that of the nose, rhinosinusitis is a more suitable term. Sinusitis can be subdivided into acute, subacute, and chronic disease. Acute sinusitis is defined as disease lasting less than 1 month."}, {"url": "http://www.emedicinehealth.com/sinus_infection/page5_em.htm", "passage_text": "1 Thickening of the inner lining (mucosa) of the sinuses. 2  Mucosal thickening can occur in people without symptoms of sinusitis. 3  CT scan findings must be correlated with a person's symptoms and physical examination findings to diagnose a sinus infection. 1 Mucosal thickening can occur in people without symptoms of sinusitis. 2"}, {"url": "http://www.niaid.nih.gov/topics/sinusitis/Pages/cause.aspx", "passage_text": "Acute Sinusitis. Acute sinusitis is usually caused by a viral or bacterial infection. The common cold, which is caused by a virus, may lead to swelling of the sinuses, trapping air and mucus behind the narrowed sinus openings. Both the nasal and the sinus symptoms usually go away within two weeks. "}]