[{"url": "http://salarygenius.com/1/1/salary/dialysis-social-worker-salary", "passage_text": "Dialysis Social Worker Gender and Age Stats. Some professions tend to be geared toward various age groups of workers and certain genders more than others. The average Dialysis Social Worker age in the United States is 38 years old. As it pertains to men vs women, 49% of Dialysis Social Worker are male in the United States, and 51% of the Dialysis Social Worker are female in the United States. As is true for most jobs and careers, you can expect your hourly pay rate or salary to increase as you gain experience and the longer you are employed with the same employer. You could potentially make an average income of around $59,000 after several years on the job with increased wages."}, {"url": "http://salarygenius.com/1/1/salary/dialysis-social-worker-salary", "passage_text": "National Dialysis Social Worker Salary Information. The average yearly salary for Dialysis Social Worker is $50,150. If you are just beginning to work a new job as a Dialysis Social Worker, you could expect a starting pay rate of $41,300 annually. As is true for most jobs and careers, you can expect your hourly pay rate or salary to increase as you gain experience and the longer you are employed with the same employer. You could potentially make an average income of around $59,000 after several years on the job with increased wages."}, {"url": "http://jobs.davita.com/social-worker/new-jobs/", "passage_text": "Provide Your Patients with the Education and Support they Need! A renal social worker is a support person for patients both before and after they start dialysis. Social workers are highly educated and trained to help patients and their families. Social workers help patients adjust to life on dialysis. Informing patients about kidney disease and their treatment options (dialysis and kidney transplant) helps them understand what is happening to their bodies so they can make informed decisions about their care."}, {"url": "http://work.chron.com/salary-dialysis-social-worker-1799.html", "passage_text": "The employment outlook for dialysis social workers is excellent. The Bureau of Labor Statistics estimates that the demand for dialysis social workers and health educators will increase up to 37 percent until the year 2020, far faster than average for all occupations."}, {"url": "http://www.indeed.com/q-Dialysis-Social-Worker-jobs.html", "passage_text": "Cooperates with the Social Worker and Renal Dietician to provide maximum utilization of resources to meet the needs of the patient and family or care partner.... 6 hours ago-save job-email-more... 1  View all NxStage Medical jobs in Boca Raton, FL-Boca Raton jobs. 2  Salary Search: Center Director salaries in Boca Raton, FL. 1 View all Fresenius Medical Care jobs in Phoenix, AZ-Phoenix jobs. 2  Salary Search: Master Social Worker Full Time West salaries in Phoenix, AZ. 3  Learn more about working at Fresenius Medical Care. 4  Related forums: Fresenius Medical Care-Phoenix, Arizona - -."}, {"url": "http://www.davita.com/treatment-options/hemodialysis/in-center-hemodialysis/social-workers:-helping-patients-at-the-dialysis-center/t/5598", "passage_text": "A renal social worker is a support person for patients both before and after they start dialysis. Social workers are highly educated and trained to help patients and their families by providing support in all areas of their lives including: emotional, financial, career, lifestyle adjustment and more. Social workers at DaVita dialysis centers generally have a master’s degree in social work (MSW)."}, {"url": "http://scholarcommons.sc.edu/cgi/viewcontent.cgi?article=1014&context=sowk_facpub", "passage_text": "Caseloads and salaries of nephrology social workers by state, ESRD Network, andNational Kidney Foundation region: Summary findings for 2007 and 2010. Journal of Nephrology Social Work, 34, 9-51.© 2010 National Kidney Foundation. "}, {"url": "http://work.chron.com/salary-dialysis-social-worker-1799.html", "passage_text": "For example, as of May 2010, according to the BLS, entry-level dialysis social workers with a bachelor's degree may earn as little as $26,730 per year, while a dialysis social worker with a master's degree or Certified Health Education Specialist status may earn as much as $81,430. The Bureau of Labor Statistics estimates that the demand for dialysis social workers and health educators will increase up to 37 percent until the year 2020, far faster than average for all occupations."}, {"url": "http://work.chron.com/salary-dialysis-social-worker-1799.html", "passage_text": "Salary. Dialysis social workers are essentially health educators. They counsel clients on how to make health, eating and lifestyle choices that will better their lives and help them cope with kidney diseases while also helping them to find resources to help pay for dialysis treatments, supplies and medications. The Bureau of Labor Statistics estimates that the demand for dialysis social workers and health educators will increase up to 37 percent until the year 2020, far faster than average for all occupations."}, {"url": "http://work.chron.com/salary-dialysis-social-worker-1799.html", "passage_text": "Where you work will impact your salary. For example, dialysis social workers and health educators employed by hospitals have a mean annual wage of $58,440, according to the BLS. The Bureau of Labor Statistics estimates that the demand for dialysis social workers and health educators will increase up to 37 percent until the year 2020, far faster than average for all occupations."}]