[{"url": "http://homeguides.sfgate.com/conditions-tomatoes-need-grow-66550.html", "passage_text": "Starting seeds indoors six to eight weeks before the average last spring frost date, or directly sowing them in the garden after the last frost date once soil temperatures reach 60 F or warmer will produce seedlings. A temperature range of 65 to 75 F is best for tomato plant growth. When temperatures drop below this range, growth slows. Tomatoes will grow in temperatures warmer than 75 F, but you'll need to water more often to prevent wilting. Temperature. Tomato seeds germinate readily in constant temperatures of 68 to 80 degrees Fahrenheit, emerging in six to 14 days. Although tomatoes will germinate in temperatures as low as 60 F, it takes longer."}, {"url": "http://www.gardeningknowhow.com/edible/vegetables/tomato/planting-time-for-tomatoes.htm", "passage_text": "While many people try to plant tomatoes as early as possible, the fact of the matter is that this method will not make an earlier producing tomato and also exposes the tomato plant to unexpected late frosts, which could kill the plant. Beyond this, tomatoes will not grow in temperatures below 50 F. (10 C.). Ideally, the soil temperature for the best time for planting tomatoes is 60 F. (16 C.). A quick and easy way to tell if the soil is warm enough for planting tomato plants is to thrust a finger in the soil."}, {"url": "http://homeguides.sfgate.com/effect-soil-temperature-tomato-growth-45509.html", "passage_text": "Cool soil temperatures affect the tomato plant negatively, especially if they persist for more than a week. Temperatures dipping below 55 degrees Fahrenheit stops both pollen production and overall plant growth. As a result, you see visible stunting to both foliage and fruits, if the plant produces fruits at all. But soil temperatures that exceed 95 degrees Fahrenheit by approximately 10 a.m. are too extreme for even the established tomato plant, states Colorado State University Extension."}, {"url": "http://home.howstuffworks.com/tomatoes1.htm", "passage_text": "Tomatoes grow best when the daytime temperature is between 65 and 85 degrees Fahrenheit. They stop growing above 95 degrees Fahrenheit. If nighttime temperatures are above 85 degrees Fahrenheit, the fruit will not turn red. Tomatoes need full sun and warm, well-drained soil. "}, {"url": "http://www.gardeningknowhow.com/edible/vegetables/tomato/planting-time-for-tomatoes.htm", "passage_text": "The second sign for knowing when do you plant tomatoes is the temperature of the soil that you plant to grow your tomatoes in. Ideally, the soil temperature for the best time for planting tomatoes is 60 F. (16 C.). A quick and easy way to tell if the soil is warm enough for planting tomato plants is to thrust a finger in the soil."}, {"url": "http://www.gardeningknowhow.com/edible/vegetables/tomato/growing-temp-for-tomatoes.htm", "passage_text": "Most tomatoes are warm season plants and should only be planted after the danger of frost has passed. Tomato temperature tolerance for extreme heat or cold snaps is of extreme importance to the development of blossoms and subsequent fruit set. Blossom drop will occur in the spring if daytime temperatures are warm but night temps drop below 55 degrees F. (13 C.). This is doubly true when the air is saturated with relative humidity. Advertisement. The growing temp for tomato seedlings should be maintained at constant temps of between 58-60 degrees F. (14-16 C.), whether starting in the greenhouse or indoors, and then not transplanted until the last frost has passed."}, {"url": "http://www.harvesttotable.com/2009/02/how_to_grow_tomatoes/", "passage_text": "Tomatoes are a warm-season annual that grow best when the soil temperature is at least 55°F and the air temperature ranges between 65° and 90°F. Tomatoes require from 50 to more than 90 warm, frost-free days to reach harvest. Tomatoes are commonly grown from seedlings started indoors and transplanted into the garden. Planted in containers tomatoes require the most soil you can provide and good drainage. Planting time. Tomatoes grow best when the day temperature is between 65° and 85°F. Tomatoes will not grow in soil cooler than 55°F and tomato flowers will not set if the air temperature goes below 55°F."}, {"url": "http://humgardens.com/contents/vegetables/tomato/planting_your_tomato_plants.htm", "passage_text": "But the magic is not associated with them being in the ground versus being in a planter, it's in the soil temperature. Tomato roots will not grow or provide nutrients to the plant at soil temperatures of 50°F or below. Researchers have found that the ideal root temperature for tomatoes is 70°F. "}, {"url": "http://extension.missouri.edu/p/G6461", "passage_text": "Setting out plants Set tomatoes in the garden when the weather has warmed and soil temperatures are above 60 degrees F. Temperatures below 50 degrees F impair tomato growth. In southern Missouri, plant tomatoes outside from April 20 to May 15. "}]