[{"url": "https://uk.answers.yahoo.com/question/index?qid=20110927051606AAFkCZ5", "passage_text": "Asker's rating. Report Abuse. If your refrigerator is more than 10 years, its doe`s not worth fixing because the cost to fix is approaching the cost of a new ones but if your refrigerator is less than 5 years, the cost of freon and labor depend on your locality. hope this help.good luck. Source(s): http://hvacmechanicalsystems.com/Refrige... "}, {"url": "http://on-timeappliance.blogspot.com/2012/08/charging-134a-freon-on-residential.html", "passage_text": "We want to see 3-5 lbs. If you are low on freon it will be negative. If the gauge is 10 or above your compressor is defective or you have a restriction in your sealed system. If that is the case you must call a Appliance Repair Company to repair your refrigerator. After 10 -15 min check and adjust the pressure if needed"}, {"url": "http://www.yourepair.com/819/how-to-replacing-refrigerator-freon-when-making-repairs.html", "passage_text": "If you can buy a comparable refrigerator for $700 and the cost of a compressor is $350 and the cost of a Service Call is $100 then you are putting more then half into an appliance that is past its warranty period. At $50 to $100 and I have seen $150 quoted as an hourly labor fee… and it was in a rural area not 5th avenue in NYC… you are going to get screwed on the service call cost."}, {"url": "http://www.howmuchisit.org/freon-recharge-cost/", "passage_text": "1 The most common freon recharge is done in a car. 2  On average, a freon recharge in a car can vary anywhere from $50 to as much as $150. 3  For a central air conditioning unit in a home, plan on budgeting around $90 to $180 to have the service done. 1 For $100 to $150, you can refill the freon, which can last for several years. 2  This is according to Doityourself.com. 3  An R-22, for example, which retails for $5 per pound plus a system capacity and service fee of around $100, you can spend around $130 for a Freon recharge."}, {"url": "http://www.howmuchisit.org/freon-recharge-cost/", "passage_text": "1 According to Answers.yahoo.com, a freon recharge costs around $55 to $60 as long as the air is still working on it. 2  There are other places though which charge cheaper. 3  For $100 to $150, you can refill the freon, which can last for several years. 4  This is according to Doityourself.com. 1 For $100 to $150, you can refill the freon, which can last for several years. 2  This is according to Doityourself.com. 3  An R-22, for example, which retails for $5 per pound plus a system capacity and service fee of around $100, you can spend around $130 for a Freon recharge."}, {"url": "http://www.howmuchisit.org/freon-recharge-cost/", "passage_text": "1 The cost of Freon recharge basically usually on several factors. 2  Among these factors are the location, service center, duration, processes involved, among others. 3  The most common freon recharge is done in a car. 4  On average, a freon recharge in a car can vary anywhere from $50 to as much as $150. 1 For $100 to $150, you can refill the freon, which can last for several years. 2  This is according to Doityourself.com. 3  An R-22, for example, which retails for $5 per pound plus a system capacity and service fee of around $100, you can spend around $130 for a Freon recharge."}, {"url": "http://www.answers.com/Q/How_much_does_it_cost_to_add_freon_to_your_refrigerator", "passage_text": "Put a vacuum pump on the system and put 2.5 kilo of r22 back into system, I charged the customer $100 in total for the gas and my time. Because of mandated production cuts in R-22 (the most common household refrigerant) the cost of freon has doubled over the last couple of years. You should never have to top up your air conditioner unless there is a leak in the system, simple as that. If some one tells you other wise they do not know what they are talk … ing about. Take for instance, I have a fridge at home it would be 40 years old and has never been looked at."}, {"url": "http://www.answers.com/Q/How_much_does_it_cost_to_add_freon_to_your_refrigerator", "passage_text": "How much it would cost to add Freon to your refrigerator will vary based on several factors. The cost is determined by your supplier and the amount required with the average cost is being about $8. You should never have to top up your air conditioner unless there is a leak in the system, simple as that. If some one tells you other wise they do not know what they are talk … ing about. Take for instance, I have a fridge at home it would be 40 years old and has never been looked at."}, {"url": "http://www.shopyourway.com/questions/1013255", "passage_text": "It is possible that the cost of repairing this type of Freon leak (and refilling it) may exceed the cost of buying a new refrigerator. There are too many variables to accurately predict the cost of this repair. Depending on the location of the Freon leak, it may be able to be repaired for as low as $120. "}]