[{"url": "http://www.merriam-webster.com/dictionary/perfection", "passage_text": "Full Definition of PERFECTION. 1. : the quality or state of being perfect: as a: freedom from fault or defect: flawlessness b: maturity c: the quality or state of being saintly. 2. a: an exemplification of supreme excellence b: an unsurpassable degree of accuracy or excellence."}, {"url": "http://www.thefreedictionary.com/perfection", "passage_text": "perfection. n. 1. the act of perfecting or the state or quality of being perfect. 2. the highest degree of a quality, etc: the perfection of faithfulness. per·fec·tion. n. 1. The quality or condition of being perfect. 2. The act or process of perfecting: Perfection of the invention took years. 3. A person or thing considered to be perfect. 4. An instance of excellence."}, {"url": "https://en.wikipedia.org/wiki/Perfection", "passage_text": "The word perfection derives from the Latin  perfectio , and perfect — from  perfectus .. These expressions in turn come from  perficio  — to finish, to bring to an end.  Perfectio (n) thus literally means a finishing, and perfect (us)  — finished, much as in grammatical parlance ( perfect ). The variants on the concept of perfection would have been quite of a piece for two thousand years, had they not been confused with other, kindred concepts. The chief of these was the concept of that which is the best: in Latin,  excellentia  (excellence)."}, {"url": "https://www.psychologytoday.com/basics/perfectionism", "passage_text": "Perfectionism. For perfectionists, life is an endless report card on accomplishments or looks. It's a fast track to unhappiness, and perfectionism is often accompanied by depression and eating disorders. What makes perfectionism so toxic is that while those in its grip desire success, they are most focused on avoiding failure, so theirs is a negative orientation. "}, {"url": "https://en.wikipedia.org/wiki/Perfection", "passage_text": "The paradox of perfection—that imperfection is perfect—applies not only to human affairs, but to technology. Thus, irregularity in semiconductor crystals (an imperfection, in the form of contaminants) is requisite for the production of semiconductors. The variants on the concept of perfection would have been quite of a piece for two thousand years, had they not been confused with other, kindred concepts. The chief of these was the concept of that which is the best: in Latin,  excellentia  (excellence)."}, {"url": "https://en.wikipedia.org/wiki/Perfection", "passage_text": "Perfection is, broadly, a state of completeness and flawlessness. The term perfection is actually used to designate a range of diverse, if often kindred, concepts. These concepts have historically been addressed in a number of discrete disciplines, notably mathematics, physics, chemistry, ethics, aesthetics, ontology, and theology. The variants on the concept of perfection would have been quite of a piece for two thousand years, had they not been confused with other, kindred concepts. The chief of these was the concept of that which is the best: in Latin,  excellentia  (excellence)."}, {"url": "http://abyssinia-iffat.com/DoesPerfectionExist.htm", "passage_text": "As a last example of the contrived nature of the concept perfection we can take an example for number theory mathematics. This is the idea of a perfect number. By definition a perfect number is one that is the sum of its positive divisors. That is numbers less than the given one and positive. Example 6 = 1+2+3. There is no basis in existence for this to be perfect. It is only when human beings create this category called perfection that this test can have that significance. This is at the heart of the problem with perfection. When human beings create an idea (concept) and set it as a measure, we've gone wrong already."}, {"url": "http://securedtransactions.uslegal.com/personal-property/perfection/", "passage_text": "PERFECTION FOR CONSUMER GOODS. If the collateral is consumer goods, the creditor does not have to file a UCC-1 or take possession of the goods in order to perfect a purchase money security interest in the goods because this type of an interest is perfected as soon as it attaches (automatic perfection) . In most cases, perfection is lost if collateral is removed to another state unless a creditor files a financing statement in the new state within four months after removal. Regarding motor vehicles, perfection is lost if a new title is issued and the lien is not stated on the title."}, {"url": "http://securedtransactions.uslegal.com/personal-property/perfection/", "passage_text": "Perfection. When a security interest in property is superior to other interests and claims to the property, it is said to be perfected. In other words, to secure protection against third parties’ claims to the collateral, the secured party must perfect the security interest. In most cases, perfection is lost if collateral is removed to another state unless a creditor files a financing statement in the new state within four months after removal. Regarding motor vehicles, perfection is lost if a new title is issued and the lien is not stated on the title."}]