[{"url": "http://work.chron.com/beginner-soccer-player-salaries-30579.html", "passage_text": "MLS Salaries. Beginning and lower-echelon players in Major League Soccer make a minimum of $35,125 a year, by far the lowest minimum salary of major professional team sports in America. As of the end of the 2013 season, 154 players made less than $50,000 a year. The average salary in the MLS, however, was $160,000, and the median salary was $100,000. About 45 percent of MLS players -- that's 249 -- made over $100,000. The gap between the highest-paid and lowest-paid players is quite pronounced in professional soccer"}, {"url": "http://www.answers.com/Q/What_is_the_average_salary_for_a_professional_soccer_player", "passage_text": "Some of the best teams get thousands of dollars a week. Depends on the player, club, league etc. A player in the lower devisions of the English leagues could earn $20,000 to $30,000 a year. However a high profile player like David Beckham could roughly get $10 million a year from his salary alone. David Beckham is by far the highest paid Football player in the MLS... He earns over $500,000 per week at L.A Galaxy.     Women's is $40,000 and men's was $85,000 a … few years ago."}, {"url": "http://work.chron.com/much-money-nfl-player-make-year-2377.html", "passage_text": "Average Salaries. The average salary of an NFL player works out to considerably less when not considering the top earners, but these players still make hundreds of thousands of dollars each. Bloomberg Businessweek says the average salary of an NFL player in 2011 was $1.9 million. The median salary was $770,000"}, {"url": "http://www.ehow.com/about_6365024_average-salary-soccer-players.html", "passage_text": "Major League Soccer (United States). According to Deadspin.com, players in the MLS, the top soccer league in the United States, earn an average of $213,048 per season, or $4,097 per week. The top-earning active player in MLS in 2014 is Michael Bradley of Toronto FC, making $6,000,000 base salary this season. Other Major Soccer Leagues. Two of the other top soccer leagues in the world are Bundesliga in Germany and Serie A in Italy. According to Deadspin.com, the average player in these two leagues make over $2,000,000 per year, or $40,000 per week."}, {"url": "http://www.ehow.com/about_6365024_average-salary-soccer-players.html", "passage_text": "The English Premier League is arguably the top soccer league in the world. The average EPL player makes $3,562,600 per year or $68,511 per week, according to Deadspin.com. The league's highest-paid player is Manchester United's Wayne Rooney, who makes about $470,000 per week. Other Major Soccer Leagues. Two of the other top soccer leagues in the world are Bundesliga in Germany and Serie A in Italy. According to Deadspin.com, the average player in these two leagues make over $2,000,000 per year, or $4"}, {"url": "http://www.sounderatheart.com/2013/5/6/4306550/mls-player-salaries-analysis-charts-and-tables", "passage_text": "Most of them are under contract with specific clubs, but two MLS pool goalkeepers and five released players were also included. The average player will make $141,903.13 this year. Robbie Keane has overtaken Thierry Henry as the player with the highest base salary in the league ($4 million to Henry's $3.75 million). In an increase from last year, 62 players will make the minimum $35,125 (43 did last year). That minimum number is up from $33,750 last year, signifying a 4 percent increase. Taking Designated Players out of the equation, the average player will make $102,661.81 in 2012."}, {"url": "http://blogs.denverpost.com/rapids/2014/04/11/mls-player-salaries-2014-list-major-league-soccer-players-union/25753/", "passage_text": "Major League Soccer’s player’s union on Thursday released the 2014 compensation for all of its players in the league, showing the Colorado Rapids’ total base salary for 2014 — as of April 1 — is $3,015,558, with guaranteed compensation totaling $3,488,900.82. Below is the breakdown of salaries by the Rapids players. A few notes for the Rapids: Brian Mullan took the biggest hit to stay with Colorado, dropping from $162,000 in base salary in 2013 to $48,500 in 2014. Forward Edson Buddle received a $50,000 pay bump from last year, when he made $275,000"}]