[{"url": "http://www.elp.com/articles/powergrid_international/print/volume-18/issue-2/features/underground-vs-overhead-power-line-installation-cost-comparison-.html", "passage_text": "This desire surges into prominence whenever natural disasters cause destruction on the overhead distribution and transmission networks across the country. In the past, the largest obstacle to placing overhead power lines underground has been the higher cost of installation and maintenance for underground lines. Frank Alonso, P.E., is a manager of transmission engineering with SAIC. He has a bachelor's degree in electrical engineering from the University of Florida and has more than 40 years of experience in the electric utility industry. Reach him at frank.alonso@saic.com."}, {"url": "http://www.cga.ct.gov/2011/rpt/2011-R-0338.htm", "passage_text": "According to EEI, building a new overhead distribution line costs between $136,000 and $197,000 per mile, depending on several factors including population density of the area served (urban areas being the most expensive). According to EEI, building a new overhead distribution line costs between $136,000 and $197,000 per mile, depending on several factors including population density (urban areas being the most expensive). The cost of new underground lines ranges between $409,000 and $559,000 per mile"}, {"url": "http://www.elp.com/articles/powergrid_international/print/volume-18/issue-2/features/underground-vs-overhead-power-line-installation-cost-comparison-.html", "passage_text": "A new 138 kV overhead line costs approximately $390,000 per mile as opposed to $2 million per mile for underground (without the terminals).. These costs show a potential initial construction cost differential of more than five times for underground lines as opposed to overhead lines for construction in Wisconsin. Frank Alonso, P.E., is a manager of transmission engineering with SAIC. He has a bachelor's degree in electrical engineering from the University of Florida and has more than 40 years of experience in the electric utility industry. Reach him at frank.alonso@saic.com."}, {"url": "http://www.elp.com/articles/powergrid_international/print/volume-18/issue-2/features/underground-vs-overhead-power-line-installation-cost-comparison-.html", "passage_text": "According to the May 2011 paper Underground Electric Transmission Lines published by the Public Service Commission of Wisconsin, The estimated cost for constructing underground transmission lines ranges from 4 to 14 times more expensive than overhead lines of the same voltage and same distance. Frank Alonso, P.E., is a manager of transmission engineering with SAIC. He has a bachelor's degree in electrical engineering from the University of Florida and has more than 40 years of experience in the electric utility industry. Reach him at frank.alonso@saic.com."}, {"url": "http://www.elp.com/articles/powergrid_international/print/volume-18/issue-2/features/underground-vs-overhead-power-line-installation-cost-comparison-.html", "passage_text": "For example, when a developer or homeowner requests electric service for a new home, if there's an overhead distribution line nearby, the service connection can be designed, constructed and made available for connection to the new home in a relatively short time. Frank Alonso, P.E., is a manager of transmission engineering with SAIC. He has a bachelor's degree in electrical engineering from the University of Florida and has more than 40 years of experience in the electric utility industry. Reach him at frank.alonso@saic.com."}, {"url": "http://epu.edu.vn/UpLoadFiles/DS05B_V1.pdf", "passage_text": "D ESIGN OVERHEAD DISTRIBUTION SYSTEMS 53 Wires and Cables The qualities desired in electric-service wires, in so far as the construction is concerned, are mechanical strength, tenacity, and ability to resist corrosion or other deterioration. D ESIGN OVERHEAD DISTRIBUTION SYSTEMS 51 Considering Figure 14, this indicates the voltage variations resulting from where the zone substation tap changer can vary the voltage but the distribution transformers are of fixed ratio. This is the typical arrangement in most power distribution systems."}, {"url": "http://epu.edu.vn/UpLoadFiles/DS05B_V1.pdf", "passage_text": "D ESIGN OVERHEAD DISTRIBUTION SYSTEMS 5 Electric power transmission Electric power transmission is the bulk transfer of electrical energy, a process in the delivery of electricity to consumers. A power transmission network typically connects power plants to multiple substations near a populated area. D ESIGN OVERHEAD DISTRIBUTION SYSTEMS 51 Considering Figure 14, this indicates the voltage variations resulting from where the zone substation tap changer can vary the voltage but the distribution transformers are of fixed ratio. This is the typical arrangement in most power distribution systems."}, {"url": "http://www.cooperindustries.com/content/public/en/power_systems/products/overhead_distributionequipment.html", "passage_text": "&nbsp. Eaton's Cooper Power™ series overhead electrical distribution equipment has a long history of quality and reliability. Products including Distribution Switchgear, M-Force switches, and NOVA reclosers are found in many distribution systems around the world. "}, {"url": "http://epu.edu.vn/UpLoadFiles/DS05B_V1.pdf", "passage_text": "Overhead power lines are often equipped with a ground conductor (shield wire or overhead earth. wire). A ground conductor is a conductor that is usually grounded (earthed) at the top of the supporting. structure to minimise the likelihood of direct lightning strikes to the phase conductors. D ESIGN OVERHEAD DISTRIBUTION SYSTEMS 51 Considering Figure 14, this indicates the voltage variations resulting from where the zone substation tap changer can vary the voltage but the distribution transformers are of fixed ratio. This is the typical arrangement in most power distribution systems."}]