[{"url": "http://www.news-medical.net/health/What-is-Conjugated-Linoleic-Acid.aspx", "passage_text": "Conjugated linoleic acids (CLA) are a family of at least 28 isomers of linoleic acid found especially in the meat and dairy products derived from ruminants. Conjugated Linoleic Acid Biochemistry. Most studies of CLAs have used a mixture of isomers wherein the isomers c9,t11-CLA and t10,c12-CLA were the most abundant. Conjugated linoleic acid is both a ''trans'' fatty acid and a ''cis'' fatty acid."}, {"url": "https://en.wikipedia.org/wiki/Conjugated_linoleic_acid", "passage_text": "Conjugated linoleic acids (CLA) are a family of at least 28 isomers of linoleic acid found mostly in the meat and dairy products derived from ruminants. CLAs can be either cis-or trans-fats and the double bonds of CLAs are conjugated and separated by a single bond between them. "}, {"url": "http://www.eatwild.com/cla.html", "passage_text": "THE BASICS. CLA is a newly discovered good fat called conjugated linoleic acid that may be a potent cancer fighter. In animal studies, very small amounts of CLA have blocked all three stages of cancer: 1) initiation, 2) promotion, and 3) metastasis. Most anti-cancer agents block only one of these stages. "}, {"url": "http://www.news-medical.net/health/What-is-Conjugated-Linoleic-Acid.aspx", "passage_text": "Conjugated Linoleic Acid. Conjugated linoleic acids (CLA) are a family of at least 28 isomers of linoleic acid found especially in the meat and dairy products derived from ruminants. As the name implies, the double bonds of CLAs are conjugated. Conjugated Linoleic Acid Biochemistry. Most studies of CLAs have used a mixture of isomers wherein the isomers c9,t11-CLA and t10,c12-CLA were the most abundant. Conjugated linoleic acid is both a ''trans'' fatty acid and a ''cis'' fatty acid."}, {"url": "http://www.webmd.com/vitamins-supplements/ingredientmono-826-CONJUGATED%20LINOLEIC%20ACID.aspx?activeIngredientId=826&activeIngredientName=CONJUGATED%20LINOLEIC%20ACID", "passage_text": "CONJUGATED LINOLEIC ACID Side Effects & Safety. Conjugated linoleic acid is LIKELY SAFE when taken by mouth in amounts found in foods and is POSSIBLY SAFE when taken by mouth in medicinal amounts (larger amounts than those found in food). It might cause side effects such as stomach upset, diarrhea, nausea, and fatigue. "}, {"url": "http://tonalin.com/", "passage_text": "Tonalin Is The Most Clinically Researched CLA. Tonalin is clinically shown to help reduce body fat up to 10%, while increasing lean muscle mass and preventing fat regain. The safety and effectiveness of Tonalin has been proven in 18 separate research studies. "}, {"url": "http://products.mercola.com/cla-supplement/", "passage_text": "What to Look for when Choosing a CLA Supplement. If you decide that CLA supplementation is for you, then the next step is crucial. A number of CLA supplements are available today, and I believe that many are best avoided, for reasons I'll share with you. While searching for a CLA supplement that met my strict requirements, I was shocked by what I found. "}, {"url": "http://www.unikeyhealth.com/cla-1000", "passage_text": "CLA 1000 - better than other CLA's. CLA 1000 - better than other CLA's. Rating: I've been trying other CLA's but came back to Unikey's brand again. I'd've taken it regularly before & noticed it has kept the weight off specially around the middle. Estimate Shipping. Contains 1000 mg conjugated linoleic acid (CLA), a naturally occurring fatty acid that supports the body to burn stored fat as energy.* All natural fat burning supplement – with study-backed results! A great addition to any diet or fitness regime."}]