[{"url": "http://www.answers.com/Q/How_much_does_David_Cameron_earn_a_year", "passage_text": "As of July 2014, David Cameron is worth approximately $6. 3 million  dollars. He is best known for being the Prime Minister of the  United Kingdom."}, {"url": "http://www.dailymail.co.uk/news/article-2432825/The-3-700-GPs-earn-David-Cameron-Doctors-home-150-000-salaries.html", "passage_text": "16. View. comments. Nearly 3,700 GPs earn more than the Prime Minister, figures show. A total of 3,690 family doctors are on salaries of £150,000 or more including 670 on more than £200,000. GPs’ pay has actually fallen slightly in the last 12 months, according to NHS statistics published today."}, {"url": "http://www.dailymail.co.uk/news/article-2432825/The-3-700-GPs-earn-David-Cameron-Doctors-home-150-000-salaries.html", "passage_text": "The doctors in charge-the partners-each take a share of the remaining funds as their salary. Figures from the Health and Social Care Information Centre show that 3,670 family doctors earn at least £150,000 a year-considerably more than David Cameron’s £142,500 salary. Last year however 3,920 family doctors earned at least £150,000 a year."}, {"url": "http://www.answers.com/Q/How_much_does_David_Cameron_earn_a_year", "passage_text": "The UK Prime Minister receives £142,500 per annum as salary for being Prime Minister. He is also a sitting member of Parliament (MP) and thus receives and additional salary of £65,737."}, {"url": "http://www.answers.com/Q/How_much_money_does_the_Prime_Minister_of_the_United_Kingdom_earn_yearly", "passage_text": "OK-So definitively David Cameron who is the current British Prime Minister earns £142,500 per year. Recently the Civil Service disclosed the salary's of all of the Cabinet members who earn over £150,000. David Cameron's £142,500 was used as a bench mark for this."}, {"url": "http://metro.co.uk/2015/03/21/this-is-how-much-world-leaders-are-paid-5114736/", "passage_text": "The UK’s David Cameron is the sixth-highest paid leader, earning £143,659.71, with Canada’s Stephen Harper, Germany’s Angela Merkel and South Africa’s Jacob Zuma taking up the third, fourth and fifth positions respectively."}, {"url": "http://www.bbc.co.uk/news/10200387", "passage_text": "More than 170 civil servants are paid more than Prime Minister David Cameron's £142,500-a-year salary, according to Cabinet Office figures. The salaries of those earning over £150,000 were revealed for the first time in a bid to aid transparency."}]