[{"url": "http://legal-dictionary.thefreedictionary.com/executed", "passage_text": "1) adj. to have been completed. (Example: it is an executed contract) 2) v. to have completed or fully performed. (Example: he executed all the promises made in the contract) 3) v. completed and formally signed a document, such as a deed, contract, or lease. It is opposed to executory. 2. An executed contract is one which has been fulfilled; as, where the buyer has paid thrice of the thing purchased by him. See Agreement."}, {"url": "http://legaldictionary.net/executed-contract/", "passage_text": "Executed Contract. An executed contract is a legal document that has been signed off by the people necessary for it to become effective. The contract is often made between two or more people, but it can also be between a person and an entity, or two or more entities. Definition of Execute. Noun. 1  To complete, and give effect or validity to, a legal document, decree, law, or judicial sentence. 2  Fulfilling legal requirements of a contract or other instrument by signing or sealing."}, {"url": "https://en.wikipedia.org/wiki/Contract", "passage_text": "A contract is a legally enforceable promise or undertaking that something will or will not occur. The word promise can be used as a legal synonym for contract, although care is required as a promise may not have the full standing of a contract, as when it is an agreement without consideration. The remedy for breach of contract can be damages in the form of compensation of money or specific performance enforced through an injunction. Both of these remedies award the party at loss the benefit of the bargain or expectation damages, which are greater than mere reliance damages, as in promissory estoppel."}, {"url": "http://homeguides.sfgate.com/executed-contract-real-estate-50280.html", "passage_text": "Executed Document. To execute a document means to sign it. People who refer to an executed real estate contract actually mean that the document -- the paper or digital copy of the contract -- has been signed. In this sense, the date of execution is the date on which all parties' signatures appear on the contract. "}, {"url": "https://www.law.cornell.edu/wex/contract", "passage_text": "Definition. An agreement creating obligations enforceable by law. The basic elements of a contract are mutual assent, consideration, capacity, and legality. In some states, the element of consideration can be satisfied by a valid substitute. "}, {"url": "http://legaldictionary.net/executed-contract/", "passage_text": "Types of Contracts. Many types of documents and legal forms may be executed to ensure they become effective and binding. The most common documents that require execution include contracts between two or more parties, such as lease agreements, contracts for services, and sales contracts. Definition of Execute. Noun. 1  To complete, and give effect or validity to, a legal document, decree, law, or judicial sentence. 2  Fulfilling legal requirements of a contract or other instrument by signing or sealing."}, {"url": "http://legal-dictionary.thefreedictionary.com/executed", "passage_text": "EXECUTED. Something done; something completed. This word is frequently used in connexion with others to designate a quality of such other words; as an executed contract; an executed estate; an executed trust, &c. It is opposed to executory. 2. An executed contract is one which has been fulfilled; as, where the buyer has paid thrice of the thing purchased by him. See Agreement."}, {"url": "http://legal-dictionary.thefreedictionary.com/Execute", "passage_text": "This term is frequently used in the law; as, to execute a deed is to make a deed. 2. It also signifies to perform, as to execute a contract; hence some contracts are called executed contracts, and others are called executory contracts. 3. To execute also means to put to death by virtue of a lawful sentence; as, the sheriff executed the convict. 1  Facebook. 2  Twitter"}, {"url": "https://en.wikipedia.org/wiki/Contract", "passage_text": "An unwritten, unspoken contract, also known as a contract implied by the acts of the parties, which can be either an implied-in-fact contract or implied-in-law contract, may also be legally binding. Implied-in-fact contracts are real contracts under which the parties receive the benefit of the bargain. The remedy for breach of contract can be damages in the form of compensation of money or specific performance enforced through an injunction. Both of these remedies award the party at loss the benefit of the bargain or expectation damages, which are greater than mere reliance damages, as in promissory estoppel."}, {"url": "http://definitions.uslegal.com/e/executed-contract/", "passage_text": "Executed Contract Law & Legal Definition. Executed Contract means a contract that has been fully performed by both parties. In other words, a contract whose terms have been completely fulfilled. It could also mean a signed contract. Once all parties sign the contract and the transaction is closed, the contract is considered an executed contract. "}]