[{"url": "http://www.rxlist.com/tetanus-drug/indications-dosage.htm", "passage_text": "This vaccine is NOT to be used for the treatment of tetanus (tetanus toxoid) infection. As with any vaccine, vaccination with Tetanus Toxoid (tetanus (tetanus toxoid) toxoid) may not protect 100% of susceptible individuals. If passive immunization is required, Tetanus (tetanus toxoid) Immune Globulin (TIG) (Human) should be used (see DOSAGE AND ADMINISTRATION section)."}, {"url": "https://en.wikipedia.org/wiki/Tetanus", "passage_text": "Tetanus, also known as lockjaw, is an infection characterized by muscle spasms. In the most common type the spasms begin in the jaw and then progress to the rest of the body. These spasms usually last a few minutes each time and occur frequently for three to four weeks. Tetanus is caused by an infection with the bacterium Clostridium tetani, which is commonly found in soil, dust and manure. The bacteria generally enter through a break in the skin such as a cut or puncture wound by a contaminated object."}, {"url": "http://www.webmd.com/children/vaccines/understanding-tetanus-basics", "passage_text": "Tetanus is a dangerous nerve ailment caused by the toxin of a common bacterium, Clostridium tetani. Bacterial spores are found in soil -- most frequently in cultivated soil, least frequently in virgin soil. The spores can remain infectious for more than 40 years in soil. "}, {"url": "https://en.wikipedia.org/wiki/Tetanus_vaccine", "passage_text": "Before the vaccine there was an average of 580 annual cases of tetanus and 472 annual deaths from tetanus. But since the vaccine there is an average of 41 annual cases of tetanus and 4 annual deaths from tetanus. This is 93% reduction in occurrence of tetanus and a 99% reduction in fatalities resulting from tetanus."}, {"url": "http://www.cdc.gov/vaccines/hcp/vis/vis-statements/tdap.html", "passage_text": "Another vaccine, called Td, protects against tetanus and diphtheria, but not pertussis. A Td booster should be given every 10 years. Tdap may be given as one of these boosters if you have never gotten Tdap before. Tdap may also be given after a severe cut or burn to prevent tetanus infection. Tdap vaccine can protect us from these diseases. And, Tdap vaccine given to pregnant women can protect newborn babies against pertussis. TETANUS (Lockjaw) is rare in the United States today. It causes painful muscle tightening and stiffness, usually all over the body."}, {"url": "http://www.cdc.gov/vaccines/vpd-vac/tetanus/default.htm", "passage_text": "Diphtheria, Tetanus, and Pertussis Vaccines. There are four combination vaccines used to prevent diphtheria, tetanus and pertussis: DTaP, Tdap, DT, and Td. Two of these (DTaP and DT) are given to children younger than 7 years of age, and two (Tdap and Td) are given to older children and adults. At a Glance. Tetanus (lockjaw) is a serious disease that causes painful tightening of the muscles, usually all over the body. It can lead to locking of the jaw so the victim cannot open his mouth or swallow. Tetanus leads to death in about 1 in 10 cases."}, {"url": "https://en.wikipedia.org/wiki/Tetanus_vaccine", "passage_text": "Td and Tdap are the booster shots given every ten years to maintain immunity for adults nineteen years of age to sixty-five years of age. Tdap is given as a onetime, first time only dose that includes the tetanus, diphtheria, and acellular pertussis vaccinations. But since the vaccine there is an average of 41 annual cases of tetanus and 4 annual deaths from tetanus. This is 93% reduction in occurrence of tetanus and a 99% reduction in fatalities resulting"}, {"url": "http://www.cdc.gov/vaccines/vpd-vac/tetanus/default.htm", "passage_text": "Td is a tetanus-diphtheria vaccine given to adolescents and adults as a booster shot every 10 years, or after an exposure to tetanus under some circumstances. Tdap is similar to Td but also containing protection against pertussis. At a Glance. Tetanus (lockjaw) is a serious disease that causes painful tightening of the muscles, usually all over the body. It can lead to locking of the jaw so the victim cannot open his mouth or swallow. Tetanus leads to death in about 1 in 10 cases."}, {"url": "http://www.webmd.com/vaccines/tetanus-vaccine", "passage_text": "The other two doses are a dual vaccine (Td) cover tetanus and diphtheria. You receive these vaccines over a period of seven to 12 months. Vaccination against pertussis is especially important for those in direct contact with young infants or patients. After receiving the primary series, get a Td booster every 10 years. This is how the disease came to be called lockjaw. Symptoms of tetanus may include: 1  Headache. 2  Muscle stiffness, starting in the jaw, then the neck and the arms, legs, or abdomen. 3  Trouble swallowing."}]