[{"url": "https://en.wikipedia.org/wiki/Lactic_acid_fermentation", "passage_text": "The most commercially important genus of lactic acid-fermenting bacteria is Lactobacillus, though other bacteria and even yeast are sometimes used. Two of the most common applications of lactic acid fermentation are in the production of yogurt and sauerkraut. The main type of bacteria used in the production of sauerkraut is of the genus Leuconostoc. As in yogurt, when the acidity rises due to lactic acid-fermenting organisms, many other pathogenic microorganisms are killed."}, {"url": "https://en.wikipedia.org/wiki/Lactic_acid_fermentation", "passage_text": "Lactic acid fermentation is also used in the production of sauerkraut. The main type of bacteria used in the production of sauerkraut is of the genus Leuconostoc. As in yogurt, when the acidity rises due to lactic acid-fermenting organisms, many other pathogenic microorganisms are killed. The bacteria produce lactic acid, as well as simple alcohols and other hydrocarbons"}, {"url": "http://flaganator.weebly.com/uploads/1/3/3/1/13318006/sauerkraut_lab.doc", "passage_text": "Essentially all fermented cabbage foods utilize the natural microbial community already present on the plant to perform the fermentation. Sauerkraut is thus made by shredding cabbage and mixing it with a final concentration of 2.2% to 2.8% salt. Adding salt to the cabbage achieves two purposes. "}, {"url": "http://www.fao.org/docrep/x0560e/x0560e07.htm", "passage_text": "As a result, the important role of bacteria in the fermentation of foods is often overlooked. The most important bacteria in desirable food fermentations are the lactobacillaceae which have the ability to produce lactic acid from carbohydrates. Other important bacteria, especially in the fermentation of fruits and vegetables, are the acetic acid producing acetobacter species."}, {"url": "http://blogs.scientificamerican.com/lab-rat/the-science-of-sauerkraut-bacterial-fermentation-yum/", "passage_text": "I'm not a great fan of sauerkraut, which is a pity because most of the taste comes from the action of bacteria. Not just one bacteria either, but a whole range of different species are involved in the fermentation process. The bacteria don't even need to be added to the sauerkraut, as they live naturally on the cabbage leaves. All that is required to start the process off is shredded cabbage and salt. Captain Cook also travelled with it to Australia, as sauerkraut contains a range of vitamins and minerals that are difficult to obtain when travelling for long periods at sea. As the bacteria required for sauerkraut fermentation are found on the cabbage leaves, it's a very easy and healthy dish to produce."}, {"url": "http://www.extension.umn.edu/food/food-safety/preserving/pickling/making-fermented-pickles-and-sauerkraut/", "passage_text": "These bacteria also generate flavor compounds which are associated with fermented pickles. Other vegetables may be fermented, such as using cabbage to produce sauerkraut. Initial fermentation may be followed by the addition of acid to produce such products as half dills or sweet gherkins. "}, {"url": "http://www.meatsandsausages.com/fermenting-pickling/sauerkraut/fermentation", "passage_text": "Generally, lower temperatures produce higher quality sauerkraut, although at 45.5° F (7.5° C) bacteria are growing so slow that the cabbage might need 6 months to complete fermentation. Higher temperatures produce sauerkraut in 7-10 days but of the lesser quality. This creates such a fast fermentation that some types of lactic acid bacteria don't grow at all and less reaction take place inside what results in a less complex flavor. 1  Below 45.5° F (7.5° C) fermentation time is up to 6 months."}, {"url": "http://blogs.scientificamerican.com/lab-rat/the-science-of-sauerkraut-bacterial-fermentation-yum/", "passage_text": "The first stage of sauerkraut fermentation involves anaerobic bacteria, which is why the shredded cabbage and salt need to be packed in an airtight container. At this stage the surrounding environment is not acidic, just cabbagey. Captain Cook also travelled with it to Australia, as sauerkraut contains a range of vitamins and minerals that are difficult to obtain when travelling for long periods at sea. As the bacteria required for sauerkraut fermentation are found on the cabbage leaves, it's a very easy and healthy dish to produce."}, {"url": "http://www.meatsandsausages.com/fermenting-pickling/sauerkraut/fermentation", "passage_text": "Cabbage contains enough lactic acid bacteria in order to ferment and produce sauerkraut with salt alone. In order to obtain product of the highest quality all those bacteria strains must ferment in a certain sequence. This happens naturally as long as sauerkraut is fermented around 65° F (18° C). Higher temperatures produce sauerkraut in 7-10 days but of the lesser quality. This creates such a fast fermentation that some types of lactic acid bacteria don't grow at all and less reaction take place inside what results in a less complex flavor. 1  Below 45.5° F (7.5° C) fermentation time is up to 6 months."}, {"url": "https://en.wikipedia.org/wiki/Sauerkraut", "passage_text": "Sauerkraut is made by a process of pickling called lactic acid fermentation that is analogous to how traditional (not heat-treated) pickled cucumbers and kimchi are made. The cabbage is finely shredded, layered with salt and left to ferment. Fermented foods have a long history in many cultures, with sauerkraut being one of the most well-known instances of traditional fermented moist cabbage side dishes. The Roman writers Cato (in his De Agri Cultura) and Columella (in his De re Rustica) mentioned preserving cabbages and turnips with salt."}]