[{"url": "http://coolcosmos.ipac.caltech.edu/ask/5-How-large-is-the-Sun-compared-to-Earth-", "passage_text": "It contains 99.86% of all of the mass of the entire Solar System. The Sun is 864,400 miles (1,391,000 kilometers) across. This is about 109 times the diameter of Earth. The Sun weighs about 333,000 times as much as Earth. It is so large that about 1,300,000 planet Earths can fit inside of it. Earth is about the size of an average sunspot! 1  Javascript must be enabled to use Cool Cosmos. "}, {"url": "http://www.space.com/17638-how-big-is-earth.html", "passage_text": "The planet's rotation causes it to bulge at the equator. Earth's equatorial diameter is 7,926 miles (12,756 kilometers), but from pole to pole, the diameter is 7,900 miles (12,720 km) — a difference of only 40 miles (64 km). The circumference of Earth at the equator is about 24,902 miles (40,075 km), but from pole-to-pole — the meridional circumference — Earth is only 24,860 miles (40,008 km) around. This shape, caused by the flattening at the poles, is called an oblate spheroid."}, {"url": "http://www.windows2universe.org/sun/sun_size_distance.html", "passage_text": "Since the Sun is mostly made of hydrogen, which is much less dense than the rock that makes up most of Earth, the Sun outweighs our home planet to a lesser degree than it out-volumes Earth. The Sun's mass (1,989,100 x 10 24 kg) is only 333,000 times as great as Earth's (5.97 x 10 24 kg). The Sun has a diameter of about 1,392,000 km (~865,000 miles). Earth's diameter is 12,742 km (7,917.5 miles). The diameter of the Sun is thus 109 times as great as the Earth's diameter."}, {"url": "http://www.universetoday.com/42186/how-big-is-the-earth/", "passage_text": "The mass of Earth is 5.97 x 10 24 kg. Here that is written out: 5,970,000,000,000,000,000,000,000 kg. Yeah, that’s a really big number. And yet, it’s only 0.3% the mass of Jupiter (and Jupiter is mostly lightweight hydrogen). We have written many articles about Earth for Universe Today. Blue marble Earth. Image credit: NASA. First, the equatorial diameter of Earth is 12,756 km. In other words, if you dug a tunnel on the equator that went straight down and went right through the center of the Earth, it would be about 12,756 km long."}, {"url": "http://www.space.com/17638-how-big-is-earth.html", "passage_text": "Earth is the densest planet in the solar system because of its metallic core and rocky mantle. Jupiter, which is 318 more massive than Earth, is less dense because it is made of gases, such as hydrogen. Earth's mass is 6.6 sextillion ton (5.9722 x 10 24 kilograms). It volume is 1.08321 x 10 12 km. The circumference of Earth at the equator is about 24,902 miles (40,075 km), but from pole-to-pole — the meridional circumference — Earth is only 24,860 miles (40,008 km) around. This shape, caused by the flattening at the poles, is called an oblate spheroid."}, {"url": "http://ds9.ssl.berkeley.edu/solarweek/discussion/howbig.html", "passage_text": "The Sun is about 2,000,000,000,000,000,000,000,000,000,000 kg (a 2 with 30 zeros kg, or about 4.4 with 30 zeros lbs). Maybe you learned in your physics class what's the difference between weight and mass. For example a person of 50 kg weighs 50 kg on Earth, 8.3 on the moon, and 1354 on the Sun. The Sun is 875,000 miles across, though scientists usually use kilometers, in which case it is 1,392,000 kilometers across. It is also very heavy. To write its weight in kilograms (1kg = 2 pounds, more or less) you write 2 followed by 30 zeros! Sarah Gibson."}, {"url": "http://www.windows2universe.org/sun/sun_size_distance.html", "passage_text": "Size of the Sun as compared to Earth. The Sun has a diameter of about 1,392,000 km (~865,000 miles). Earth's diameter is 12,742 km (7,917.5 miles). The diameter of the Sun is thus 109 times as great as the Earth's diameter. In other words, you could line up 109 Earths across the face of the Sun. The Sun is about 109 times as large as Earth, in terms of diameter"}, {"url": "http://whyzz.com/how-big-is-the-earth", "passage_text": "Well, here are some numbers to make you think again! The circumference of the Earth is about 40,000 kilometers or 24,900 miles. This refers to how big the Earth is around it’s fattest middle part, like if you were to measure the length of a string going around the center of the Earth at the equator. The total surface area of the Earth is about 500,000,000 square kilometers. “Surface area” refers to all of the area of the lands surface, such as oceans and continents. It’s sort of like the total amount of space on the Earth that you could walk on or swim through."}, {"url": "http://www.universetoday.com/42186/how-big-is-the-earth/", "passage_text": "Let’s take a look at how big our planet is. Blue marble Earth. Image credit: NASA. First, the equatorial diameter of Earth is 12,756 km. In other words, if you dug a tunnel on the equator that went straight down and went right through the center of the Earth, it would be about 12,756 km long. Just for comparison, that’s about 1.9 times the diameter of Mar"}, {"url": "http://www.universetoday.com/75691/how-big-is-the-milky-way/", "passage_text": "NASA estimates the galaxy at 100,000 light-years across. Since one light year is about 9.5 x 10 12 km, so the diameter of the Milky Way galaxy is about 9.5 x 10 17 km in diameter. The thickness of the galaxy ranges depending on how close you are to the center, but it’s tens of thousands of light-years across. Our galaxy is part of a collection known as the Local Group"}]