[{"url": "http://yetterscience.pbworks.com/w/file/fetch/79383707/2014-04-25%20DNA%20Structure%20and%20Replication%20POGIL%20STUDENT.pdf", "passage_text": "The complementary base-pair rule states that adenine and thymine form pairs across two strands, and guanine and cytosine form pairs across two strands. 9. Fill in the complementary bases on the strand below according to the base-pair rule. A T C C A G 10. The ladder model of DNA is a simpliÞed representation of the actual structure and shape of a DNA molecule. In reality, the strands of DNA form a double helix. Refer to the double helix diagram in Model 1 and describe its shape using a complete sentence. "}, {"url": "http://www.vonsteuben.org/ourpages/auto/2013/2/25/52301263/POGIL_DNA.docx", "passage_text": "The complementary base-pair rule states that adenine and thymine form pairs across two strands, and guanine and cytosine form pairs across two strands. Write the. complementary. bases of the strand below according to the base-pair rule.A T C C A G T A G G A C. __ __ __ __ __ __ __ __ __ __ __ __. The ladder model of DNA is a simplified representation of the actual structure and shape of a DNA molecule."}, {"url": "http://www.atdbio.com/content/14/Transcription-Translation-and-Replication", "passage_text": "Transcription is the process by which DNA is copied (transcribed) to mRNA, which carries the information needed for protein synthesis. Transcription takes place in two broad steps. First, pre-messenger RNA is formed, with the involvement of RNA polymerase enzymes. The genetic material is stored in the form of DNA in most organisms. In humans, the nucleus of each cell contains 3 × 10 9 base pairs of DNA distributed over 23 pairs of chromosomes, and each cell has two copies of the genetic material. This is known collectively as the human genome."}, {"url": "http://www2.le.ac.uk/departments/genetics/vgec/schoolscolleges/topics/dna-genes-chromosomes", "passage_text": "DNA (or deoxyribonucleic acid) is the molecule that carries the genetic information in all cellular forms of life and some viruses. It belongs to a class of molecules called the nucleic acids, which are polynucleotides-that is, long chains of nucleotides. Each nucleotide consists of three components:ach of the sugar groups in this sugar-phosphate backbone is linked to one of the four nitrogenous bases. Strand of polynucleotides. DNA's ability to store-and transmit-information lies in the fact that it consists of two polynucleotide strands that twist around each other to form a double-stranded helix."}, {"url": "http://www.nature.com/scitable/topicpage/Cells-Can-Replicate-Their-DNA-Precisely-6524830", "passage_text": "Replication is the process by which a double-stranded DNA molecule is copied to produce two identical DNA molecules. DNA replication is one of the most basic processes that occurs within a cell. Each time a cell divides, the two resulting daughter cells must contain exactly the same genetic information, or DNA, as the parent cell. To accomplish this, each strand of existing DNA acts as a template for replication. Replication occurs in three major steps: the opening of the double helix and separation of the DNA strands, the priming of the template strand, and the assembly of the new DNA segment."}, {"url": "http://www.garlandscience.com/res/pdf/ecb4_ch6_draft.pdf", "passage_text": "Thus DNA replication produces two identical, double helical molecules, enabling genetic information to be copied and passed on from a cell to its daughter cells and from a parent to its offspring. • During replication, the two strand of a DNA double helix are pulled apart to form two Y-shaped replication forks. "}, {"url": "http://2012books.lardbucket.org/books/introduction-to-chemistry-general-organic-and-biological/s22-03-replication-and-expression-of-.html", "passage_text": "The DNA sequence that is transcribed to make RNA is called the template strand, while the complementary sequence on the other DNA strand is called the coding or informational strand. To initiate RNA synthesis, the two DNA strands unwind at specific sites along the DNA molecule. DNA replication occurs by the sequential unzipping of segments of the double helix. Each new nucleotide is brought into position by DNA polymerase and is added to the growing strand by the formation of a phosphate ester bond."}, {"url": "http://www.kennedyacademy.org/ourpages/auto/2013/11/1/51996247/POGIL%20-%20c16%20DNA%20Structure%20and%20Replication-S.pdf", "passage_text": "The complementary base-pair rule states that adenine and thymine form pairs across two strands, and guanine and cytosine form pairs across two strands. 9. Fill in the complementary bases on the strand below according to the base-pair rule.A T C C GA 10. The ladder model of DNA is a simplified representation of the actual structure and shape of a DNA molecule. In reality, the strands of DNA form a double helix. Refer to the double helix diagram in Model 1 and describe its shape using a complete sentence."}, {"url": "http://ghr.nlm.nih.gov/handbook/basics/dna", "passage_text": "Most DNA is located in the cell nucleus (where it is called nuclear DNA), but a small amount of DNA can also be found in the mitochondria (where it is called mitochondrial DNA or mtDNA). The information in DNA is stored as a code made up of four chemical bases: adenine (A), guanine (G), cytosine (C), and thymine (T)."}]