[{"url": "http://en.wikivet.net/Pleural_Cavity_and_Membranes_-_Anatomy_%26_Physiology", "passage_text": "The heart is invested in a parietal and visceral layer of pericardium with the pericardial space separating the two membranes. Cranially, the costal and mediastinal pleura adjoin to form a 'dome' of pleura which extends to the thoracic inlet. This is known as the cupulae pleurae. The visceral pleura which coats the outer surface of the lung is derived from the splanchnic mesoderm. The parietal pleura lining the thoracic cavity is derived from somatic mesoderm. The pleural cavity is a potential space between the two areas of pleural membrane, which normally are adhesed to each other."}, {"url": "http://www.answers.com/Q/What_separates_the_parietal_and_visceral_pericardium", "passage_text": "The parietal pericardium is an outer layering wall of the Pericardial Cavity between the pericardial membranes. The outer-most layer is the fibrous layer (fibrosa), and contains nerves, blood vessels, and lymphatics. The visceral pericardium is the inner-most layer of the pericardium, and is also known as the Epicardium as it lays upon the heart. The Pericardial Cavity lies between the visceral pericardium and the parietal pericardium"}, {"url": "https://en.wikipedia.org/wiki/Parietal_pleura", "passage_text": "The parietal pleura is the outer membrane that attaches to and lines the inner surface of the thoracic cavity, covers the upper surface of the diaphragm and is reflected over structures within the middle of the thorax. It separates the pleural cavity from the mediastinum. "}, {"url": "http://www.answers.com/Q/What_separates_the_parietal_and_visceral_pericardium", "passage_text": "The pericardium is a sac of fibrous tissue that surrounds the heart and the roots of the large blood vessels. Visceral pericardium is the inner layer of the pericardium sac. The visceral pericardium is the inner-most layer of the pericardium, and is also known as the Epicardium as it lays upon the heart. The Pericardial Cavity lies between the visceral pericardium and the parietal pericardium"}, {"url": "http://medical-dictionary.thefreedictionary.com/parietal+pericardium", "passage_text": "parietal pericardium the parietal layer of the serous pericardium, which is in contact with the fibrous pericardium. serous pericardium the inner, serous portion of pericardium, consisting of two layers, visceral and parietal; the space between the layers is the pericardial cavity. visceral pericardium the inner layer of the serous pericardium, which is in contact with the heart and roots of the great vessels. Called also epicardium. serous pericardium. the inner, serous portion of pericardium, consisting of two layers, visceral and parietal; the space between the layers is the pericardial cavity. visceral pericardium. the inner layer of the serous pericardium, which is intimately attached to the heart and roots of the great vessels."}, {"url": "http://www.answers.com/Q/How_does_the_visceral_pericardium_differ_from_parietal_pericardium", "passage_text": "Most people think of the pericardium as just a double-layered, membranous sac (The Pericardial Cavity) that is around the heart. But, the pericardium is actually TRIPLE layered: the visceral layer, the parietal layer, and the fibrous layer (fibrosa). The visceral pericardium is the inner-most layer of the pericardium, and is also known as the Epicardium as it lays upon the heart. The Pericardial Cavity lies between the visceral pericardium and the parietal pericardium"}, {"url": "http://www.dartmouth.edu/~humananatomy/part_4/chapter_23.html", "passage_text": "The serous pericardium (fig. 23-1) is a closed sac, the parietal layer of which lines the inner surface of the fibrous pericardium and is reflected onto the heart as the visceral layer, or epicardium. "}, {"url": "http://www.embryology.ch/anglais/rrespiratory/korperhohlen01.html", "passage_text": "Fig. 17. The lungs become covered by the visceral layer of the pleural cavity, the pleura visceralis. Towards the outside, the pleural cavity is bounded by the parietal layer, the pleura parietalis. Through their rapid increase in size the two lungs, left and right, enclose the heart that is in their middle."}]