[{"url": "http://home.costhelper.com/foundation-repair.html", "passage_text": "1 An inspection and report by a structural engineer runs about $300-$800; if needed, a soil report by a geotechnical engineer can be $500-$2,000, depending on the complexity of the problem and the level of detail needed in the analysis. Typical costs: 1  It's crucial to determine the exact nature of the problem. 2  An inspection and report by a structural engineer runs about $300-$800; if needed, a soil report by a geotechnical engineer can be $500-$2,000, depending on the complexity of the problem and the level of detail needed in the analysis."}, {"url": "http://www.homeadvisor.com/cost/foundations/repair-a-foundation/", "passage_text": "Find out how much your project will cost. Provide a few details about your project and receive competitive quotes from local pros. On average nationally, home foundation repair costs $3,753, with most homeowners spending between $1,774 and $5,756. This data is based on actual project costs as reported by HomeAdvisor members. Foundation settlement can lead to major structural problems within your home"}, {"url": "http://fortworthfoundationrepair.org/foundation-repair-cost/", "passage_text": "However, we have data from a large number of previous repair jobs in the DFW area. The big picture overview is that most repair jobs fall in the range of $2,500 to $6,000 with the average at about $5,000 and the higher-end at $10,000. Some extensive repair jobs will exceed $20,000 but that is unusual"}, {"url": "http://home.costhelper.com/foundation-repair.html", "passage_text": "1 Repairing a simple crack in a poured concrete foundation can cost about $400-$800, depending on the extent of the damage. 2  Replacing an entire basement floor can add another $200-$400. 3  And in earthquake-prone areas, reinforcing the foundation with anchor bolts runs $1,500-$3,500 or more. 4  Poor soil causes the most damage. Typical costs: 1  It's crucial to determine the exact nature of the problem. 2  An inspection and report by a structural engineer runs about $300-$800; if needed, a soil report by a geotechnical engineer can be $500-$2,000, depending on the complexity of the problem and the level of detail needed in the analysis."}, {"url": "http://www.ramjacksystems.com/how-much-does-foundation-repair-cost/", "passage_text": "Home Advisor’s cost guide reports that most homeowners in Dallas pay an average of roughly $5,300 on foundation repairs. Keeping in mind that this is an average, some repair work costs around $2,500, while other repairs in the Dallas area may hover around $10,000. "}, {"url": "http://www.dryprosystems.com/foundation-repair/foundation-services/foundation-repair-costs.html", "passage_text": "Foundation repair solutions vary in cost, depending on the type and severity of the problem and the tools, materials and time required to complete the work. For example, the amount of excavation required to reach a damaged footing is one factor that can affect the cost of a foundation settlement repair. Although the cost for a foundation repair will vary depending on the type of system and level of difficulty, you can rest assured that you will get a fair, competitive price for your final results. The Foundation Supportworks Network."}, {"url": "http://bluechipdallas.com/foundation-repair-cost-dallas/", "passage_text": "In the context of the overall foundation repair cost in Dallas and the surrounding areas, most projects fall in the range of about $2,500 to $6,000 with $2,500 on the low end and $10,000 on the higher end. Below is a table to give you an idea of repair costs in other cities in Texas and in other states. Give us a call today at Foundation Repair Pros Dallas and schedule a no-obligation, free inspection. We have been in the business for many years and our industry leading team will earn your trust and confidence with a highly competitive proposal! 214-997-1985."}, {"url": "http://bluechipfoundations.com/foundation-repair-cost/", "passage_text": "Forensic Structural Engineer: If you request a structural engineer, the price can range between $500 to $1,200. Tunneling: $225 to $300 per foot. Overall, the average cost that is spent on foundation repair in the area falls somewhere around $5,000 to $6,000. For lower-end projects, the cost can be closer to $1,500, but higher-end foundation repair projects can run as much as $12,500. Again, this all depends on a lot of different factors, so it is best to schedule a free on-site consultation to get a more accurate picture of the costs associated with your home’s needs. "}]