[{"url": "http://www.pbs.org/wgbh/americanexperience/features/interview/dustbowl-witness-jr-davison/", "passage_text": "Interview: J.R. Davison. On The Land. I think the land was good to these people, because it provided 'em with a — I don’t know whether I should say a “good living.” It wasn’t a good living as we would judge it now, but it was an existence. "}, {"url": "http://dictionary.reverso.net/english-definition/dust%20pneumonia", "passage_text": "n. 1 gold in the form of small particles or powder, as found in placer-mining. 2 a valuable or rare thing. tickets for this match are gold dust. English Collins Dictionary-English Definition & Thesaurus &nbsp. See also: dust bowl, angel dust, bull dust, cosmic dust. turn to dust. turn to dust. exp"}, {"url": "http://www.ranker.com/list/dust-pneumonia-symptoms/reference", "passage_text": "List features Chest pain, Cough and more. Many of the symptoms of Dust pneumonia may be related to other illnesses or conditions, so if you're experiencing any of these symptoms don't automatically assume you have Dust pneumonia."}, {"url": "https://en.wikipedia.org/wiki/Dust_pneumonia", "passage_text": "A Dust Bowl-era dust storm in Texas (1935). Dust pneumonia describes disorders caused by excessive exposure to dust storms, particularly during the Dust Bowl in the United States. "}, {"url": "http://www.livestrong.com/article/17213-symptoms-dust-pneumonia/", "passage_text": "Cough. One of the initial symptoms of dust pneumonia is coughing. The cough is the body's natural response to forcing dirt and debris out of the airways and lungs. Beginning as a dry cloth, the lungs work against the debris and uses mucus to attempt to force the dirt and particles out."}, {"url": "http://www.wisegeekhealth.com/what-is-dust-pneumonia.htm", "passage_text": "Top 10 facts about the world. Dust pneumonia is a serious lung infection that develops because of excessive exposure to dust. Often, this type of infection occurs when dust and dirt enter the respiratory system because of a dust storm and interfere with the proper functioning of the lungs. "}, {"url": "http://www.buzzle.com/articles/dust-pneumonia.html", "passage_text": "Major Symptoms. This condition deals with the respiratory system of the body and so the symptoms may be painful and severe. To begin with, cough may be the first symptom of dust pneumonia. Coughing is the body's natural defense mechanisms for getting the dirt out of the lungs. With time, the infection caused by dust pneumonia may make its way into the bloodstream or other parts of the body. This may result in a shut down of the body and the organs, sending the sufferer to what is known as a septic shock. This may turn out to be a life-threatening situation, if not addressed soon."}, {"url": "http://www.lung.org/lung-health-and-diseases/lung-disease-lookup/pneumonia/learn-about-pneumonia.html", "passage_text": "5 Facts You Should Know about Pneumonia. Pneumonia is a common lung infection caused by bacteria, a virus or fungi. It is often spread via coughing, sneezing, or even breathing, and those who don't exhibit symptoms can also spread the illness. "}, {"url": "http://www.healthline.com/health/pneumonia", "passage_text": "Pneumonia is an infection in one or both lungs. The infection may be caused by fungi, bacteria, or viruses. Pneumonia causes inflammation in your lung’s air sacs, also referred to as alveoli. The alveoli fill with fluid or pus, making it difficult to breathe. "}]