[{"url": "http://equalrightsamendment.org/", "passage_text": "Section 1. Equality of rights under the law shall not be denied or abridged by the United States or by any state on account of sex. Section 2. The Congress shall have the power to enforce, by appropriate legislation, the provisions of this article. Section 3. This amendment shall take effect two years after the date of ratification."}, {"url": "http://eraeducationproject.com/what-is-the-equal-rights-amendment/", "passage_text": "The 15 states whose legislatures never ratified the Equal Rights Amendment are Alabama, Arizona, Arkansas, Florida, Georgia, Illinois, Louisiana, Mississippi, Missouri, Nevada, North Carolina, Oklahoma, South Carolina, Utah, and Virginia. Present Strategies For Ratification. "}, {"url": "http://www.archives.gov/legislative/features/griffiths/", "passage_text": "The ERA was a proposed amendment to the U.S. Constitution that guaranteed equal rights under the law for Americans regardless of their sex. The ERA was first drafted in 1923 by suffragist Alice Paul. "}, {"url": "http://www.equalrightsamendment.org/states.htm", "passage_text": "The 15 states that have not yet ratified the Equal Rights Amendment are Alabama, Arizona, Arkansas, Florida, Georgia, Illinois, Louisiana, Mississippi, Missouri, Nevada, North Carolina, Oklahoma, South Carolina, Utah, and Virginia. SPRINGFIELD -- More than 40 years after it passed Congress and 30 years after the 'Equal Rights Amendment' lapsed after failing to get 38 states needed to ratify it, three state Representatives are introducing a bill to have Illinois ratify it."}, {"url": "http://equalrightsamendment.org/", "passage_text": "The Equal Rights Amendment is not yet in the U.S. Constitution. The ERA, affirming the equal application of the Constitution to all persons regardless of their sex, was written in 1923 by Alice Paul, suffragist leader and founder of the National Woman's Party. Section 2. The Congress shall have the power to enforce, by appropriate legislation, the provisions of this article. Section 3. This amendment shall take effect two years after the date of ratification."}, {"url": "http://www.equalrightsamendment.org/states.htm", "passage_text": "The ERA in the States. The Equal Rights Amendment was passed by Congress on March 22, 1972 and sent to the states for ratification by both houses of their state legislatures. A proposed amendment becomes part of the Constitution when approved by three-fourths (38) of the 50 states. During the next five years, 35 states approved the amendment. SPRINGFIELD -- More than 40 years after it passed Congress and 30 years after the 'Equal Rights Amendment' lapsed after failing to get 38 states needed to ratify it, three state Representatives are introducing a bill to have Illinois ratify it."}, {"url": "http://womenshistory.about.com/od/equalrightsamendment/a/equal_rights_amendment_overview.htm", "passage_text": "What the ERA Says. The text of the Equal Rights Amendment is: Section 1. Equality of rights under the law shall not be denied or abridged by the United States or by any state on account of sex. Section 2. The Congress shall have the power to enforce, by appropriate legislation, the provisions of this article. Section 3. In 1923, Alice Paul wrote the  Lucretia Mott Amendment, which said, Men and women shall have equal rights throughout the United States and every place subject to its jurisdiction.. It was introduced annually in Congress for many years. In the 1940s, she rewrote the amendment."}, {"url": "https://en.wikipedia.org/wiki/Equal_Rights_Amendment", "passage_text": "The Equal Rights Amendment (ERA) was a proposed amendment to the United States Constitution designed to guarantee equal rights for women. The ERA was originally written by Alice Paul and Crystal Eastman. In 1923, it was introduced in the Congress for the first time. Eleven states have adopted constitutions or constitutional amendments providing that equal rights under the law shall not be denied because of sex. Most of these provisions mirror the broad language of the ERA, while the wording in others resembles the Equal Protection Clause of the Fourteenth Amendment."}, {"url": "http://feministmajority.org/equal-rights-amendment/", "passage_text": "The Equal Rights Amendment states: Section 1. Equality of rights under the law shall not be denied or abridged by the United States or by any state on account of sex. Section 2. "}]