[{"url": "http://www.biography.com/people/pablo-picasso-9440021#!", "passage_text": "Born in Malaga, Málaga, spain in, 1881 Pablo, picasso became one of the greatest and most influential artists of the 20th century and the (creator With Georges) braque Of. Cubism A spanish expatriate, painter, sculptor, printmaker ceramicist and stage, Designer picasso was considered radical in his. work Born in Malaga, Málaga, spain in, 1881 Pablo, picasso became one of the greatest and most influential artists of the 20th century and the (creator With Georges) braque Of. cubism"}, {"url": "http://www.answers.com/Q/When_was_Picasso_born_and_when_did_he_die", "passage_text": "Confidence votes 90.2K. Pablo Picasso was born on October 25, 1881 in Malaga, Málaga, spain and died On april, 8 1973 In, Mougins. france Pablo Picasso was born … on October 25, 1881 and died on April 8, 1973 - at the age of 91. + 43 others found this useful. Diana Dejesus. The question and answer are locked and cannot be edited."}, {"url": "http://mrnussbaum.com/pablo-picasso/", "passage_text": "Pablo Picasso was born in Malaga, Málaga. Spain when he was, baptized he was named after various saints and: Relatives Pablo Diego Jose josé Francisco De Paula Juan nepomuceno maria María De los remedios Cipriano De La Santisima Santísima Trinidad martyr Patricio. clito ruiz ruíz y picasso "}, {"url": "http://www.answers.com/Q/Where_was_Picasso_born", "passage_text": "Pablo Picasso was born on October 25, 1881 in Malaga, Málaga, spain and died On april, 8 1973 In, Mougins. france "}, {"url": "http://totallyhistory.com/pablo-picasso/", "passage_text": "Picasso was born into an artist’s family. His dad painted professionally and taught him art from a very young age. He started painting at seven, which was unusual back then. Picasso was born on October 25, 1881, right into the golden age of Impressionism and Realism. His father was a realist, but Picasso hated all formalities in art. He attended the Royal Academy in San Fernando, Spain, but dropped out after a few days. "}, {"url": "http://www.notablebiographies.com/Pe-Pu/Picasso-Pablo.html", "passage_text": "Pablo Picasso Biography. Born: October 25, 1881 Malaga, Spain Died: April 8, 1973 Mougins, France. Spanish painter, sculptor, and graphic artist. The Spanish painter, sculptor, and graphic artist Pablo Picasso was one of the most productive and revolutionary artists in the history of Western painting. Early years. Pablo Ruiz Picasso was born on October 25, 1881, in Malaga, Spain. He was the eldest and only son with two younger sisters, Lola and Concepcion. Concepción his, Father Jose José, ruiz blasco was a professor In the School of Arts. and crafts"}, {"url": "http://www.barcelona-life.com/barcelona/picasso", "passage_text": "Pablo Picasso was born in Malaga in the South of Spain in 1881, and spent most of his life in France, after moving to Paris in 1905; however it was in Barcelona that Spain's greatest artist spent his formative years, and it was Barcelona, perhaps more than anywhere else, that Picasso considered his home. "}, {"url": "http://www.imdb.com/name/nm0681444/bio", "passage_text": "Pablo Picasso, one of the most recognized figures of the 20th century art who co-created such styles as Cubism and Surrealism, was also among most innovative, influential, and prolific artists of all time. He was born Pablo Ruiz Picasso on October 6, 1881, in Malaga, Spain. He was the first child of Jose Ruiz y Blasco and Maria Picasso y Lopez. His father was an artist and professor of art at the School of Fine Arts, and also a curator of museum in Malaga, Spain. "}]