[{"url": "http://www.thedailybeast.com/articles/2011/08/18/college-admissions-which-state-schools-give-an-edge-to-out-of-state-students.html", "passage_text": "And opposed to five years ago, when out-of-state kids saw a 22 percent acceptance rate at Berkeley—compared with in-staters' 25 percent—the trend is looking good for out-of-state applicants. At the University of Illinois, in-state students pay annual tuition of $14,414. Their out-of-state roommates pay $28,556. At the University of Michigan, state residents pay $12,634 in annual tuition. Non-Michigan residents pay $37,782."}, {"url": "http://www.dailycamera.com/news/ci_17830151", "passage_text": "On the Web. For the New York Times piece on college admission rates, go to nytimes.com. The New York Times is publishing a blog of admissions data from about 100 schools across the country -- and, at 84 percent, the University of Colorado has by far the highest acceptance rate on the list."}, {"url": "http://www.huffingtonpost.com/2011/03/30/college-admissions-rates-_n_842807.html", "passage_text": "Rounding out the top five most competitive schools are Stanford University, with a 7.1 percent acceptance rate; Yale University, at 7.4 percent, and Princeton University, 8.4 percent. Below, see the acceptance rates of 17 highly selective colleges. We'll be updating this slideshow as more numbers come in. Harvard University saw its acceptance rate drop to an all-time low of 6.2 percent from a record-setting pool of 35,000 applicants. Columbia University, which saw its applicant pool balloon by 32 percent this year, accepted a mere 6.4 percent of prospective students."}, {"url": "http://www.businessinsider.com/ivy-league-acceptance-2018-2014-3", "passage_text": "Brown University accepted 2,619 of 30,291 applicants, or an 8.6% acceptance rate. Last year, the university had a 9.2% acceptance rate. Yale University was the last to release their admissions data, but also posted a lower acceptance rate than last year's 6.72% . Cornell University, which has the highest admissions rate in the Ivy League, dropped over a percentage point this year, with a 14% acceptance rate, taking 6,025 students from 43,041 applications. Cornell accepted 15.2% of applicants last year"}, {"url": "http://www.thedailybeast.com/articles/2011/08/18/college-admissions-which-state-schools-give-an-edge-to-out-of-state-students.html", "passage_text": "Out-of-state families typically pay two to five times what in-state students pay for tuition. At the University of Illinois, in-state students pay annual tuition of $14,414. Their out-of-state roommates pay $28,556. At the University of Michigan, state residents pay $12,634 in annual tuition. Non-Michigan residents pay $37,782."}, {"url": "http://www.acceptancerate.com/schools/the-university-of-texas-at-austin", "passage_text": "Overall UT Austin Acceptance Rate-Fall 2013. 40.2%. The overall acceptance rate for The University of Texas at Austin was reported as 40.2% in Fall 2013 with over 38,200 college applications submitted to this school. Both in state and out of state applicants are included in these figures. We do not have data on transfer acceptance rates currently"}, {"url": "http://www.businessinsider.com/ivy-league-acceptance-2018-2014-3", "passage_text": "Harvard University admitted 5.9% of applicants, up slightly from last year's 5.8% admissions rate. Harvard accepted 2,023 of their 34,295 applications. Columbia University admitted 6.94% of applicants, up from a record low 6.89% acceptance rate for the Class of 2017. Columbia accepted 2,291 of their 32,967 applicants. Cornell University, which has the highest admissions rate in the Ivy League, dropped over a percentage point this year, with a 14% acceptance rate, taking 6,025 students from 43,041 applications. Cornell accepted 15.2% of applicants last year"}, {"url": "http://www.sacbee.com/news/local/education/article2596255.html", "passage_text": "Davis’ admission rate ticked up to 40.6 percent this year from 39.4 percent in 2013 as the university accepted 2,500 more students than last year. Out-of-state and international admissions were up 33 percent. Huge increases in the number of applicants, changing admissions processes and a growing emphasis on out-of-state and international students are driving them down. Preliminary UC admission data released Friday morning showed a record 86,865 freshmen accepted this year, an increase of 4.8 percent from 2013."}, {"url": "http://www.sacbee.com/news/local/education/article2596255.html", "passage_text": "Even as the University of California accepted a record number of freshman for fall 2014, admission rates at its most selective campuses reached new lows. Huge increases in the number of applicants, changing admissions processes and a growing emphasis on out-of-state and international students are driving them down. Preliminary UC admission data released Friday morning showed a record 86,865 freshmen accepted this year, an increase of 4.8 percent from 2013."}]