[{"url": "https://labtestsonline.org/understanding/conditions/hypercoagulable-disorders", "passage_text": "Excessive clotting or thrombophilia can lead to the presence of a blood clot in a vein or artery that can potentially block the flow of blood and cause serious, life-threatening complications. An excessive clotting (hypercoagulable) disorder is a condition in which there is an increase in the risk of inappropriate blood clot (thrombus) formation."}, {"url": "http://medical-dictionary.thefreedictionary.com/Coagulation+Disorders", "passage_text": "Coagulation, or clotting, occurs as a complex process involving several components of the blood. Plasma, the fluid component of the blood, carries a number of proteins and coagulation factors that regulate bleeding. There are a number of other causes of DIC, and it is not commonly understood why or how these various disorders can lead to the coagulation problem. What the underlying causes of DIC have in common is some factor that affects proteins, platelets, or other clotting factors and processes."}, {"url": "http://www.mayoclinic.org/diseases-conditions/factor-v-leiden/basics/definition/CON-20032637", "passage_text": "Definition. Factor V Leiden is a mutation of one of the clotting factors in the blood called factor V. This mutation can increase your chance of developing abnormal blood clots (thrombophilia), usually in your veins. Most people with factor V Leiden (FAK-tur five LIDE-n) never develop abnormal clots."}, {"url": "http://www.heart.org/HEARTORG/Conditions/More/What-Is-Excessive-Blood-Clotting-Hypercoagulation_UCM_448768_Article.jsp", "passage_text": "In a case of excessive blood clotting, these clots can form in, or travel to, the arteries or veins in the brain, heart, kidneys, lungs and limbs, which in turn can cause heart attack, stroke, damage to the body’s organs or even death. Some Possible Effects of Blood Clots Include: Also in this section: When you get a cut or wound, your body forms blood clots, a thickened mass of blood tissue, to help stop the bleeding. Proteins in your blood called fibrins work with small blood cell fragments called platelets, to form the clot."}, {"url": "http://ghr.nlm.nih.gov/condition/prothrombin-thrombophilia", "passage_text": "Prothrombin thrombophilia is an inherited disorder of blood clotting. Thrombophilia is an increased tendency to form abnormal blood clots in blood vessels. People who have prothrombin thrombophilia are at somewhat higher than average risk for a type of clot called a deep venous thrombosis, which typically occurs in the deep veins of the legs."}, {"url": "https://www.hemophilia.org/Bleeding-Disorders", "passage_text": "Bleeding disorders result when the blood’s ability to form a clot at the site of blood vessel injury is impaired. Here you will find information on inherited bleeding disorders, such as hemophilia, von Willebrand disease and rare factor deficiencies. "}, {"url": "https://en.wikipedia.org/wiki/Coagulopathy", "passage_text": "Coagulopathy (also called a clotting disorder) is a condition in which the blood’s ability to coagulate (form clots) is impaired. Coagulopathy may be caused by reduced levels or absence of blood-clotting proteins, known as clotting factors or coagulation factors. Genetic disorders, such as hemophilia and Von Willebrand's disease, can cause a reduction in clotting factors."}, {"url": "http://medical-dictionary.thefreedictionary.com/Coagulation+Disorders", "passage_text": "Coagulation disorders deal with disruption of the body's ability to control blood clotting. The most commonly known coagulation disorder is hemophilia, a condition in which patients bleed for long periods of time before clotting. There are other coagulation disorders with a variety of causes. There are a number of other causes of DIC, and it is not commonly understood why or how these various disorders can lead to the coagulation problem. What the underlying causes of DIC have in common is some factor that affects proteins, platelets, or other clotting factors and processes."}, {"url": "http://medical-dictionary.thefreedictionary.com/Hypercoagulation+Disorders", "passage_text": "In normal hemostasis, or the stoppage of bleeding, clots form at the site of the blood vessel's injury. The difference between that sort of clotting and the clotting present in hypercoagulation is that these clots develop in circulating blood. This disorder can cause clots throughout the body's blood vessels, sometimes creating a condition known as thrombosis. Thrombosis can lead to infarction, or death of tissue, as a result of blocked blood supply to the tissue."}, {"url": "http://medical-dictionary.thefreedictionary.com/Coagulation+Disorders", "passage_text": "1 Disseminated intravascular coagulation disorder, also known as consumption coagulopathy, occurs as a result of other diseases and conditions. 2  This disease accelerates clotting, which can actually cause hemorrhage. 3  Thrombocytopenia is the most common cause of coagulation disorder. There are a number of other causes of DIC, and it is not commonly understood why or how these various disorders can lead to the coagulation problem. What the underlying causes of DIC have in common is some factor that affects proteins, platelets, or other clotting factors and processes."}]