[{"url": "http://arras-france.com/", "passage_text": "http://arras-france.com/mont-saint-eloi-abbey/. The owner and editor of this website is Emilie Sergent, a native of Arras, who has also lived and traveled in other countries including the UK, USA, Spain, Germany, India and the Netherlands to name just a few."}, {"url": "https://en.wikipedia.org/wiki/Arras", "passage_text": "Arras is Pas-de-Calais ’ third most populous town after Calais and Boulogne-sur-Mer. The town counted 43,693 residents in 2012, with the Arras metropolitan area having a population of 124,200. Arras is located 182 kilometers (113 miles) north of Paris and can be reached in 2 hours by car and in 50 minutes by TGV."}, {"url": "https://en.wikipedia.org/wiki/Arras", "passage_text": "Nord-Pas-de-Calais is divided in 2 departments: Nord and Pas-de-Calais. Arras is in the south-east part of the Pas-de-Calais department and forms the Arras district (arrondissement d'Arras in French) in the Artois, a former province of northern France."}, {"url": "http://arras-france.com/north-france/", "passage_text": "North France. The city of Arras is the capital of the Pas-de-Calais department in northern France. Having Gallic and Gallo-Roman origins and more than 2,000 years of history, Arras is packed with heritage. In July 2005, the bell tower of Arras was classified as part of the “World Inheritance of Humanity” by UNESCO."}, {"url": "http://wikitravel.org/en/Arras", "passage_text": "Arras (Dutch: Atrecht) is an attractive town in the Nord-Pas de Calais region of France. It was much fought-over in World War 1 and is mainly visited by tourists travelling from or to the nearby ports of Calais and Boulogne."}, {"url": "http://arras-france.com/", "passage_text": "We will also share interesting information about other famous regions/sites in France. 1  If you are coming to northern France, Notre-Dame-de-Lorette, the Canadian War Memorial of Vimy, the Arras WWI memorial, the Louvre-Lens Museum and Mont-Saint-Eloi abbey should be on your list."}, {"url": "https://en.wikipedia.org/wiki/Arras", "passage_text": "It is located in Northern France on the Scarpe river. The Arras plain lies on a large chalk plateau bordered on the north by the Marqueffles fault, on the southwest by the Artois and Ternois hills, and on the south by the slopes of Beaufort-Blavincourt."}, {"url": "http://arras-france.com/", "passage_text": "For more information about this site, click on the following link : http://arras-france.com/arras-war-memorial/. The Louvre-Lens museum is a branch of the Louvre museum in Paris and has been open to visitors since December 2012. It is located in the industrial city of Lens, near Arras."}]