[{"url": "http://www.cleaning-4-profit.com/2012/12/19/cleaning-apartment-complexes/", "passage_text": "I paid the staff member who cleaned the apartment complex $8.00 per hour. She worked 8 hours each Monday as that was our scheduled day. She cost me $80.00 plus about $16.00 in related taxes and overhead. 4 – The apartment turnovers you’ll be asked to clean can be incredibly dirty. It’s amazing how people can live in a unit for YEARS and yet never clean it. I have some memories that I would rather FORGET! My theory on the matter is to think of turnovers in bunches of 10."}, {"url": "http://www.bbcleaningservice.com/price-quote-apartment.html", "passage_text": "Our maids understand that you may not need someone to clean your apartment everyday so we offer apartment cleaning services on a weekly, bi-weekly, and monthly basis and our apartment cleaning cost cannot be beat. Call us today at (212) 921-2364 for an apartment cleaning price quote. We also offer NYC house cleaning services. Below are some of the basic apartment cleaning services that Busy Bee offers: 1  Trash pickup (we also empty all trash receptacles and replace liners). Whether you are looking for services on a daily, weekly or monthly schedule, we are sure to have something to fit your apartment cleaning needs. We can be reached by email or telephone. Call us at (212)921-2364 or (718)846-1697 for a price quote today or email us at busybee@bbcleaningservice.com with any questions."}, {"url": "http://www.businessownersideacafe.com/bizidea/apartment_cleaning_vis.html", "passage_text": "An Idea for a Small Business You Can Start. Start-up costs range $50 to $500,000+, earnings $5,000 to $2,000,000++, skills from knowing nothing to running an airline. Bon appetit! APARTMENT CLEANING. Start-up cost: About You: My name is Rochelle and I live in California. "}, {"url": "http://www.howmuchisit.org/apartment-cleaning-cost/", "passage_text": "1 All-about-the-details.com, an apartment cleaning company located in Missouri, charges $80 for apartments under 500 square feet to as much as $400 for apartments larger than 5,000 square feet. 2  Another company, b bcleaningservice.com, charges anywhere from $135 to $200 for the initial cleaning. 1 These can be added to your cleaning service for a small fee that ranges from $5 to $40. 2  Also, one may need to provide cleaning supplies for the cleaners in case they do not bring their own. 3  An additional charge may be incurred if you need to have your apartment cleaned on short notice or on a weekend."}, {"url": "http://www.cleaningtalk.com/f19/cleaning-apartments-2674/", "passage_text": "Apartment cleaning. For this situation I would charge by the hour for sure. Apartment cleaning can be difficult and hard to know how long you would be there. A lot of people who are moving out do not care about how they leave the apartments. So most of the time they are a dump."}, {"url": "http://www.howmuchisit.org/apartment-cleaning-cost/", "passage_text": "1 On average, the typical cost to clean an apartment will vary depending on the size of your apartment and the cleaning tasks that you would want performed. 2  The average fee of cleaning a two-bedroom, 900 square-foot apartment is about $75 to $200 for one-time cleaning fees. 1 These can be added to your cleaning service for a small fee that ranges from $5 to $40. 2  Also, one may need to provide cleaning supplies for the cleaners in case they do not bring their own. 3  An additional charge may be incurred if you need to have your apartment cleaned on short notice or on a weekend."}, {"url": "http://www.goftp.com/qna/How_much_does_it_cost_to_clean_an_apartment_complex-qna103964.html", "passage_text": "Apartment complex and also the number of apartments in that complex.... 0. 0. The average cost of building an apartment complex will depend on the number of stories in the apartment complex and also the number of apartments in that complex. It can also depend on the site in which you want to build the complex. The average cost can be about $100,000 per unit. Pricing to build a 10 unit apartment complex is very hard to estimate until all specifications are penned. One of the major cost is the land, if you are choosing to build the apartment out the outskirts of a big city then too the price of the land can be high while cost of land in a small town can be not that expensive."}, {"url": "http://rentlaw.com/normalweartear.htm", "passage_text": "Pictures are worth a thousand words and therefore, dollars. Sign and date the pictures and save them in case your landlord does not return your security deposit. The average cost to clean an average apartment is $135 for the full job. If you do not have time, consider hiring a cleaning service. "}, {"url": "http://www.wikihow.com/Clean-an-Apartment-Before-Moving-Out", "passage_text": "1 Find out whether your landlord or apartment complex automatically cleans the carpet, without charge to you, when you move out or whether they require you to have stayed in the apartment a certain number of years before they will waive the carpet cleaning. 1 Otherwise, you'll lose time stopping to go to the store. 2 "}, {"url": "http://www.howmuchisit.org/apartment-cleaning-cost/", "passage_text": "1 The average fee of cleaning a two-bedroom, 900 square-foot apartment is about $75 to $200 for one-time cleaning fees. 2  All-about-the-details.com, an apartment cleaning company located in Missouri, charges $80 for apartments under 500 square feet to as much as $400 for apartments larger than 5,000 square feet. 1 These can be added to your cleaning service for a small fee that ranges from $5 to $40. 2  Also, one may need to provide cleaning supplies for the cleaners in case they do not bring their own. 3  An additional charge may be incurred if you need to have your apartment cleaned on short notice or on a weekend."}]