[{"url": "http://www.oke-sa.co.za/products/alkor-aluminium-profiles", "passage_text": "ALKOR Aluminium Profiles. ALKOR Industrietechnik GmbH is a global supplier of interlocking aluminium profiles. As authorised resellers of ALKOR products in sub-Saharan Africa, we can vouch for the superior quality and cutting edge design of the extensive product range. "}, {"url": "https://en.wikipedia.org/wiki/Extrusion", "passage_text": "Extrusion is a process used to create objects of a fixed cross-sectional profile. A material is pushed through a die of the desired cross-section. 1 Aluminium is the most commonly extruded material. 2  Aluminium can be hot or cold extruded. 3  If it is hot extruded it is heated to 575 to 1100 °F (300 to 600 °C). 4  Examples of products include profiles for tracks, frames, rails, mullions, and heat sinks."}, {"url": "https://en.wikipedia.org/wiki/Aluminium", "passage_text": "Aluminium (or aluminum; see different endings) is a chemical element in the boron group with symbol Al and atomic number 13. It is a silvery-white, soft, nonmagnetic, ductile metal. Aluminium is the third most abundant element (after oxygen and silicon) in the Earth 's crust, and the most abundant metal there. It makes up about 8% by mass of the crust, though it is less common in the mantle below."}, {"url": "http://www.alpprofile.com/aluminium_profiles.html", "passage_text": "It is possible to make changing in the constructions; all the pieces can be installed later. Standart aluminium profiles and to practice these profiles, it serves connection and combining techniques to help you make projects. You can ask detailed information from our customer service, catalog and web page. There is no need painting or stoning later like needed in steel construction in the means of those factors. A more stablel and harder connection against to static and dynamic charges is possible by the means of 8 mm and 10 mm canal sizes of specially designed profiles according to the practice concepts."}, {"url": "http://www.alpprofile.com/aluminium_profiles.html", "passage_text": "The most important features of aluminium profile are installation, practicability, solidity and property of design. By the means of connection accessories which are designed according to the canals of extruded aluminium profiles that have best appropriate cuts, it is possible to install quicker. There is no need painting or stoning later like needed in steel construction in the means of those factors. A more stablel and harder connection against to static and dynamic charges is possible by the means of 8 mm and 10 mm canal sizes of specially designed profiles according to the practice concepts."}, {"url": "http://www.directindustry.com/industrial-manufacturer/aluminum-profile-60754.html", "passage_text": "aluminum profile / T-slot / sealing XMS. The XMS profiles are based on Line X. The contemporary profile shape with its clear contours and smooth side panels offers both practical functionality and timeless design. aluminum profile / C / guide RLT-AL. Standard executions RLT-AL-AN: anodisedaluminium, natural colour. RLT-AL-BL: aluminium, naturalcolour. RLT-AL-SL: anodisedaluminium, natural colour, slotted holes. Features and applications The profile can hold up to 11 RLT-U roller elements or RLS-U ball elements."}, {"url": "http://www.jinlanaluminium.com/products-aluminium-profiles.html", "passage_text": "Aluminium Profiles. Jinlan is the world's leading aluminium profiles suppliers in China. Our aluminium profiles are used in virtually all industries, and we also provide design solutions for you. JinLan aluminium manufacturers exporting high quality extruded aluminium profile, All of our extruded aluminum profiles can be customized"}]