[{"url": "https://www.ftc.gov/tips-advice/competition-guidance/guide-antitrust-laws/antitrust-laws", "passage_text": "The Antitrust Laws. Congress passed the first antitrust law, the Sherman Act, in 1890 as a comprehensive charter of economic liberty aimed at preserving free and unfettered competition as the rule of trade.. Long ago, the Supreme Court decided that the Sherman Act does not prohibit every restraint of trade, only those that are unreasonable. For instance, in some sense, an agreement between two individuals to form a partnership restrains trade, but may not do so unreasonably, and thus may be lawful under the antitrust laws."}, {"url": "http://legal-dictionary.thefreedictionary.com/Sherman+Anti-Trust+Act", "passage_text": "The Sherman Anti-Trust Act of 1890 (15 U.S.C.A. §§ 1 et seq.), the first and most significant of the U.S. antitrust laws, was signed into law by President Benjamin Harrison and is named after its primary supporter, Ohio Senator John Sherman. Initial enforcement of the Sherman Act was halting, set back in part by the decision of the Supreme Court in United States v. E. C. Knight Co., 156 U.S. 1, 15 S. Ct. 249, 39 L. Ed. 325 (1895), that manufacturing was not interstate commerce"}, {"url": "http://anti-trust.laws.com/monopolization/monopolization", "passage_text": "Contained within the Sherman Antitrust Act are two sections. The first section addresses company behavior through negations and deals, and the second deals with the ability of an individual to monopolize a market. In each section there are different items of focus. "}, {"url": "https://en.wikipedia.org/wiki/United_States_antitrust_law", "passage_text": "It was followed by the Sherman Antitrust Act of 1890, the Clayton Antitrust Act of 1914 and the Federal Trade Commission Act of 1914, the Robinson-Patman Act of 1936, and the Celler-Kefauver Act of 1950. Indeed, at this time hundreds of small short-line railroads were being bought up and consolidated into giant systems. The main statutes are the Sherman Act 1890, the Clayton Act 1914 and the Federal Trade Commission Act 1914. These Acts, first, restrict the formation of cartels and prohibit other collusive practices regarded as being in restraint of trade."}, {"url": "https://en.wikipedia.org/wiki/Sherman_Antitrust_Act", "passage_text": "Sen. John Sherman (R – OH), the principal author of the Sherman Antitrust Act. The Sherman Antitrust Act (Sherman Act, 26 Stat. 209, 15 U.S.C. §§ 1 – 7) is a landmark federal statute in the history of United States antitrust law (or  competition law ) passed by Congress in 1890. See also: United States antitrust law and Competition law. The Sherman Act has seen much controversy. One branch of the criticism focuses on whether the Act improves competition and benefits consumers, or merely aids inefficient businesses at the expense of more innovative ones."}, {"url": "https://en.wikipedia.org/wiki/Sherman_Antitrust_Act", "passage_text": "The Sherman Antitrust Act (Sherman Act, 26 Stat. 209, 15 U.S.C. See also: United States antitrust law and Competition law. The Sherman Act has seen much controversy. One branch of the criticism focuses on whether the Act improves competition and benefits consumers, or merely aids inefficient businesses at the expense of more innovative ones."}, {"url": "http://www.ourdocuments.gov/doc.php?doc=51", "passage_text": "How to use citation info. (on Archives.gov). Approved July 2, 1890, The Sherman Anti-Trust Act was the first Federal act that outlawed monopolistic business practices. The Sherman Antitrust Act of 1890 was the first measure passed by the U.S. Congress to prohibit trusts. It was named for Senator John Sherman of Ohio, who was a chairman of the Senate finance committee and the Secretary of the Treasury under President Hayes. "}, {"url": "http://www.nolo.com/legal-encyclopedia/content/sherman-act.html", "passage_text": "Enter Your Zip Code to Connect with a Lawyer Serving Your Area. The Sherman Antitrust Act -- passed in 1890 -- was the first federal antitrust law and is the source of all American antimonopoly laws. "}, {"url": "http://lawbrain.com/wiki/Sherman_Anti-Trust_Act", "passage_text": "From lawbrain.com. Legal Term. The Sherman Anti-Trust Act of 1890 (15 U.S.C.A. §§ 1 et seq.), the first and most significant of the U.S. Antitrust laws, was signed into law by President Benjamin Harrison and is named after its primary supporter, Ohio Senator John Sherman. Initial enforcement of the Sherman Act was halting, set back in part by the decision of the Supreme Court in United States v. E. C. Knight Co., 156 U.S. 1, 15 S. Ct. 249, 39 L. Ed."}]