[{"url": "https://ca.answers.yahoo.com/question/index?qid=20071001133859AAKqz6s", "passage_text": "Remove steak from milk, dredge in flour mixture, place into skillet and brown on both sides. Continue cooking until all steaks are cooked. CREAM GRAVY: 1/3 c. hot steak drippings 1/4 c. flour 2 c. milk Salt and pepper to taste I use another skillet, let it get hot and add steak drippings, flour, salt and pepper. Stir with wire whisk until blended. Next add 2 cups milk, continuing to stir until gravy thickens."}, {"url": "https://en.wikipedia.org/wiki/Chicken_fried_steak", "passage_text": "Chicken fried steak resembles the Austrian dish Wiener Schnitzel and the Italian-South American dish Milanesa, which is a tenderized veal or pork cutlet, coated with flour, eggs, and bread crumbs, and then fried. It is also similar to the recipe for Scottish collops."}, {"url": "https://en.wikipedia.org/wiki/Chicken_fried_steak", "passage_text": "Chicken fried steak (also known as country fried steak) is an American breaded cutlet dish consisting of a piece of steak (tenderized cube steak) coated with seasoned flour and pan-fried. It is associated with the Southern cuisine of the United States."}, {"url": "http://allrecipes.com/recipe/150306/the-best-chicken-fried-steak/", "passage_text": "1 Pound the steaks to about 1/4-inch thickness. 2  Place 2 cups of flour in a shallow bowl. 3  Stir together the baking powder, baking soda, pepper, and salt in a separate shallow bowl; stir in the buttermilk, egg, Tabasco Sauce, and garlic. 4  Dredge each steak first in the flour, then in the batter, and again in the flour."}, {"url": "http://www.ehow.com/info_8095837_chicken-steaks.html", "passage_text": "Chicken-fried steak is steak that has been prepared like fried chicken. This comfort food consists of a tenderized piece of round steak that has been battered then pan-fried in oil until golden brown."}, {"url": "http://www.food.com/recipe/chicken-fried-steak-151732", "passage_text": "1 Sprinkle 1/4 teaspoon salt and 1/4 teaspoon black pepper evenly over steaks. 2  Combine cracker crumbs, 1 cup flour, 1 teaspoon salt, 1/2 teaspoon black pepper, red pepper, and baking powder. 3  Whisk together 3/4 cup milk and eggs."}, {"url": "http://www.foodnetwork.com/recipes/alton-brown/chicken-fried-steak-recipe.html", "passage_text": "Cook each piece on both sides until golden brown, approximately 4 minutes per side. Remove the steaks to a wire rack set in a half sheet pan and place into the oven. Repeat until all of the meat is browned. Add the remaining vegetable oil, or at least 1 tablespoon, to the pan."}, {"url": "http://www.seriouseats.com/2015/01/texas-food-chicken-fried-steak-history.html", "passage_text": "Chicken fried steak is a dish that's about taking something that's less than palatable, in this case a tough piece of beef, and with a little ingenuity turning it into something delectable, says Lisa Fain, the author of the Homesick Texan."}, {"url": "http://www.food.com/recipe/chicken-fried-steak-chicken-with-creamy-gravy-201511", "passage_text": "1 Season the chicken breasts with black pepper. 2  In a shallow dish combine crushed cracker crumbs with flour 1 teaspoon seasoned salt, 1/2 teaspoon black pepper, cayenne pepper (if using) and baking powder. 3  In another shallow dish whisk together eggs with 3/4 milk."}]