[{"url": "http://www.ehow.com/info_12031230_average-propane-heating-cost.html", "passage_text": "Propane Cost For Average Home. A 1,500 square foot home in a mild climate would require approximately 1.5 million BTUs of propane fuel for heating each month. Based on a cost per gallon of $2.86, it would cost approximately $57 per month to heat the home with propane. The same size home in a moderate climate would require 3 million BTUs per month, and cost $114. A home in a severe climate would need about 5 million BTUs per month, and cost approximately $191 per month to heat. A 2,000 square foot home in a mild climate would require about 2 million BTUs of propane, and cost $76 per month to heat. A home in a moderate climate would require 4.0 million BTUs, and cost $152 per month"}, {"url": "http://www.eia.gov/tools/faqs/faq.cfm?id=97&t=3", "passage_text": "How much electricity does an American home use? In 2013, the average annual electricity consumption for a U.S. residential utility customer was 10,908 kilowatthours (kWh), an average of 909 kWh per month. Louisiana had the highest annual consumption at 15,270 kWh, and Hawaii had the lowest at 6,176 kWh. "}, {"url": "http://www.ehow.com/how_7514198_estimate-usage-per-square-foot.html", "passage_text": "Multiply total gallons by 95,475 to figure total BTUs of usage. To figure the total propane for your home, multiply total gallons of propane for the year by 95,475. The result is the total BTUs your family consumes in a year. Example: 800 gallons * 95,475 = 76,380,000 BTUs. According to Home Energy: Advancing Home Performance, 39.4 percent of homes using propane heating use between 5 and 10 British Thermal Units (BTU) per square foot. Only 12.2 percent use under 5 BTUs"}, {"url": "https://answers.yahoo.com/question/index?qid=20100224075226AAN99KJ", "passage_text": "If you have a gas furnace and a gas stove, you can expect to use between 5-7 gallons per 24 hour period. If you have a gas hot water heater, add about 1/2 - 3/4 gallon per day to that usage. Your girlfriend is using below average amounts of propane each month. Source(s): I sell propane and propane accessories"}, {"url": "http://www.city-data.com/forum/house/1390342-need-advice-propane-electricity-usage-potential.html", "passage_text": "Propane Usage 2000 Gallons over 1 year period. At the current pricing for propane, we find this to be a very high cost for heating and cooling. I am afraid of spending 500+ per month for this, let alone $750. It will be just the 2 of us moving into the home. "}, {"url": "http://www.duke-energy.com/ohio/savings/heating-costs.asp", "passage_text": "Understanding the Real Cost of a Heating Fuel. The fuel cost for heating is usually less than your average cost of the total bill. For many homes, the heating usage is all used in the lowest rate step. In the example above, assume this home requires at least 1000 kWhs per month to operate all the household appliances. "}, {"url": "http://www.ehow.com/how_7514198_estimate-usage-per-square-foot.html", "passage_text": "Estimate propane use per square foot for your home. Divide the total BTUs you figured in step 2 by the total square footage of your home figured in step 4. Divide that answer by the total HDD you figured in step 5. The answer is your average BTUs per square foot per HDD. This gives you the most accurate estimate of your propane usage per square foot for the weather conditions and home location. Example: 76,380,000 BTUs divided by 1,500 square feet divided by 2,500 HDD = 20.368 BTUs per square foot per HDD. According to Home Energy: Advancing Home Performance, 39.4 percent of homes using propane heating use between 5 and 10 British Thermal Units (BTU) per square foot. Only 12.2 percent use under 5 BTUs"}, {"url": "http://www.propane101.com/abnormalusageandleaks.htm", "passage_text": "One gallon of propane has 91,547 BTU's. Appliance BTU ratings indicate the appliance usage at 100% capacity. In other words, a furnace with a 200,000 BTU/hr rating means the furnace will use 200,000 BTU's per hour when it is running at full blast. The furnace will use about 2.2 gallons of propane in one hour's time (200,000 ÷ 91,547 = 2.18). Pool Heater Gas Usage-If you add the propane consumption of a pool heater, the numbers really start to climb. Pool heaters are high capacity appliances that can consume more than 4.5 gallons of propane per hour (425,000 BTU/hr ÷ 91,547 = 4.64 gal/hr)."}, {"url": "http://www.propane101.com/abnormalusageandleaks.htm", "passage_text": "Summer Propane Usage-During off peak months, propane will be used by cooking appliances, water heaters, clothes dryers and the maybe pool heaters. If the gas range, dryer and water heaters are used at a rate of 25% capacity 2 hours per day, the gas usage will be about 1.2 gallons per day. Pool Heater Gas Usage-If you add the propane consumption of a pool heater, the numbers really start to climb. Pool heaters are high capacity appliances that can consume more than 4.5 gallons of propane per hour (425,000 BTU/hr ÷ 91,547 = 4.64 gal/hr)."}]