[{"url": "http://www.akdart.com/postrate.html", "passage_text": "Postal Service seeks 50-cent stamp prices. Mired in red ink, the U.S. Postal Service is warning it will lose as much as $18.2 billion a year by 2015 unless Congress grants it new leeway to eliminate Saturday delivery, slow first-class mail by one day and raise the price of a postage stamp by as much as 5 cents. U.S. Postal Service lifts stamp price by 1 cent. The cash-strapped U.S. Postal Service announced on Tuesday a one-cent increase in the cost of mailing a letter, starting in January. The new prices lift the cost of a first-class stamp to 45 cents starting on January 22, 2012, the first increase in more than two years."}, {"url": "http://www.akdart.com/postrate.html", "passage_text": "USPS raises price of stamps. The U.S. Postal service is now charging Americans a penny more for stamps and postcard mailings. The price of a first-class stamp for domestic mail rose Sunday [1/27/2012] from 45 cents to 46 cents, while postcards cost 33 cents to send. U.S. Postal Service lifts stamp price by 1 cent. The cash-strapped U.S. Postal Service announced on Tuesday a one-cent increase in the cost of mailing a letter, starting in January. The new prices lift the cost of a first-class stamp to 45 cents starting on January 22, 2012, the first increase in more than two years."}, {"url": "http://www.costhowmuch.com/ps/current-postage-stamp.htm", "passage_text": "Letters destined for Canada and Mexico-for the (1) ounce first class letter cost $1.20 as of May 31st, 2015 that was a 5 cent hike from $1.15 effective January 26 `014 with the global forever stamp (then applying to all international destinations forward). Any extra ounce(s) are subject to a fee of $0.22 per added ounce as of May 31st, 2015 (previously $0.21 per oz). Another prior rise in rates occurred January 27, 2013 when the price of a first class letter sent through the United States Post Office went up $0.01 to $0.46."}, {"url": "http://www.stamps.com/whitepapers/2015-usps-postage-rate-increase-guide.pdf", "passage_text": "Each additional ounce will cost an extra $0.22 (one cent increase from 2014). Online Postage For those who print postage online or on a postage meter, the “Metered Mail” rate for a First-Class Mail Letter (1 oz.) will increase by $0.005 to $0.485 from $0.48 in 2014. Flats/Large Envelopes First-Class Mail Flats/Large Envelopes (1 oz.) rates will stay the same at $0.98 in 2015."}, {"url": "http://www.stamps.com/usps/forever-stamps/", "passage_text": "Forever Stamps are ideal for mailing normal-sized, one-ounce letters within the United States. If you suspect that your letter may weigh more than one ounce, be sure to weigh it prior to affixing a Forever Stamp, as heavier letters will be returned due to lack of postage. Avoid placing two Forever Stamps on a mail piece for heavier mail. Additional ounces are much cheaper costing only $0.22 per additional ounce rather than $0.49 for one ounce letter. If you add two Forever Stamps to a 2 ounce letter, you would be paying $0.98 for an item that should only cost $0.71."}, {"url": "http://www.stamps.com/whitepapers/2015-usps-postage-rate-increase-guide.pdf", "passage_text": "2015 ®USPS POSTAGE RATE INCREASE GUIDE • 3 Priority Mail and Priority Mail Express rates are NOT INCREASING in 2015.For customers who print postage online or use a postage meter, the “Metered Mail” rate for a 1 oz. First-Class Letter will increase by $0.005 to $0.485 from $0.48. Online Postage For those who print postage online or on a postage meter, the “Metered Mail” rate for a First-Class Mail Letter (1 oz.) will increase by $0.005 to $0.485 from $0.48 in 2014. Flats/Large Envelopes First-Class Mail Flats/Large Envelopes (1 oz.) rates will stay the same at $0.98 in 2015."}, {"url": "http://priceofstamp.com/", "passage_text": "Price of a Stamp. The current price of a first class stamp is 49 cents. A domestic first class letter (1 oz.) is 49 cents. The price of each additional ounce is 21 cents. It will cost you 34 cents to send a domestic postcard"}, {"url": "http://www.costhowmuch.com/ps/current-postage-stamp.htm", "passage_text": "And the price of a first class (1) ounce letter sent through the United States Post Office remains at $0.49 for letters mailed within the United States. The fee will continue to apply and extend for some indeterminate period of time. Any extra ounce(s) are subject to a fee of $0.22 per added ounce as of May 31st, 2015 (previously $0.21 per oz). Another prior rise in rates occurred January 27, 2013 when the price of a first class letter sent through the United States Post Office went up $0.01 to $0.46."}, {"url": "http://www.stamps.com/usps/forever-stamps/", "passage_text": "They are non-denominational First Class ® postage, which means that they can be used to mail First Class letters no matter what the postal rate. For example, in 2013 it cost $0.46 to mail a normal-sized letter weighing one ounce or less to an address within the United States. In 2014, the rate increased to $0.49. Customers who purchased Forever Stamps in 2013 at the rate of $0.46 each may still use those stamps to mail their First Class letters today without adding additional postage to the envelope. Avoid placing two Forever Stamps on a mail piece for heavier mail. Additional ounces are much cheaper costing only $0.22 per additional ounce rather than $0.49 for one ounce letter. If you add two Forever Stamps to a 2 ounce letter, you would be paying $0.98 for an item that should only cost $0.71."}]