[{"url": "https://en.wikipedia.org/wiki/Richardson,_Texas", "passage_text": "Richardson is a city in Dallas and Collin counties in the State of Texas. As of the 2010 census, the city had a total population of 99,223. In 2014 the population was estimated to be 108,617. Richardson is an affluent inner suburb of Dallas and home of The University of Texas at Dallas and the Telecom Corridor with a high concentration of telecommunications companies."}, {"url": "https://en.wikipedia.org/wiki/Richardson,_Texas", "passage_text": "At the time, Richardson was one of only four cities in the state of Texas and one of 88 cities in the nation with an “AAA” rating from Standard & Poor’s. Richardson is the metropolitan statistical area's second largest employment center with daytime population increasing to more than 140,000."}, {"url": "http://www.citytowninfo.com/places/texas/richardson", "passage_text": "The University of Texas at Dallas is situated in Richardson and is located in the Telecom Corridor accompanied by numerous prominent technology corporations. It is prominent in the areas of engineering, cognitive sciences, natural sciences and computer science."}, {"url": "http://www.rent.com/texas/richardson-apartments/2-133", "passage_text": "Apartments in Richardson-Study. Students renting apartments in Richardson have a variety of community colleges and four universities to choose from, including the University of Texas at Dallas, Collin County Community College District, and Richland College of the Dallas County Community College District."}, {"url": "http://www.rent.com/texas/richardson-apartments/2-133", "passage_text": "Richardson, a thriving suburb of Dallas and home of The University of Dallas, was ranked the 18th best place to live in the United States by Money magazine in 2008."}, {"url": "http://www.city-data.com/city/Richardson-Texas.html", "passage_text": "According to our research of Texas and other state lists there were 26 registered sex offenders living in Richardson, Texas as of October 14, 2015. The ratio of number of residents in Richardson to the number of sex offenders is 3,973 to 1."}, {"url": "http://www.apartments.com/richardson-tx/", "passage_text": "You searched for apartments in Richardson, TX. Let Apartments.com help you find the perfect rental near you. Click to view any of these 452 available rental units in Richardson to see photos, reviews, floor plans and verified information about schools, neighborhoods, unit availability and more."}, {"url": "https://en.wikipedia.org/wiki/Richardson,_Texas", "passage_text": "In 2008, Richardson was ranked as the 18th best place to live in the United States by Money magazine. This ranked Richardson the 4th best place to live in Texas. In 2009, Business Week's annual report on the Best Places to Raise Kids, ranked Richardson in 2nd place in Texas. Richardson was the first North Texas city recognized as a best workplace for commuters by the United States Environmental Protection Agency and the United States Department of Transportation in 2004."}]