[{"url": "http://www.academicinvest.com/science-careers/environmental-science-careers/how-to-become-an-oceanographer", "passage_text": "Oceanographer Salary Canada: According to ECO Canada, the average yearly salary for entry-level Oceanographers in Canada is $44,000, and more experienced oceanographers typically earn between $64,000 and $78,000 per year. Further Training Needed to Become an Oceanographer. Although professional certification is not typically mandatory to be hired as an oceanographer, many practitioners choose to obtain certification voluntarily."}, {"url": "http://oceanservice.noaa.gov/facts/oceanographer.html", "passage_text": "Oceanography covers a wide range of topics, including marine life and ecosystems, ocean circulation, plate tectonics and the geology of the sea floor, and the chemical and physical properties of the ocean. Just as there are many specialties within the medical field, there are many disciplines within oceanography. Biological oceanographers and marine biologists study plants and animals in the marine environment."}, {"url": "http://biocareers.com/tv/oceanographer-career-information-education-required-become-oceanographer", "passage_text": "Rate this video: The education required to become an oceanographer is generally either a master's degree or a doctorate in physical oceanography. Work on a Ph.D. if research oceanography is more interesting to you with tips from a physical oceanographer in this free video on oceanography careers. The education required to become an oceanographer is generally either a master's degree or a doctorate in physical oceanography."}, {"url": "http://study.com/articles/Oceanographer_Job_Outlook_Duties_and_Requirements.html", "passage_text": "Oceanographer: Job Outlook, Duties and Requirements. Learn about the education and preparation needed to become an oceanographer. Get a quick view of the requirements as well as details about training, job duties, licensure and certification to find out if this is the career for you. View 9 Popular Schools ». According to the U.S. Bureau of Labor Statistics (BLS), geoscientists, including oceanographers, made an average annual salary of $108,420. Jobs for geoscientists are expected to grow by 16% between 2012 and 2022 (www.bls.gov)."}, {"url": "http://www.academicinvest.com/science-careers/environmental-science-careers/how-to-become-an-oceanographer", "passage_text": "To become an oceanographer, you need a graduate level education, either a Master of Science (M.Sc.) or a doctoral degree (PhD) in oceanography, marine biology, biochemistry, hydrogeology or a closely related field. Further Training Needed to Become an Oceanographer. Although professional certification is not typically mandatory to be hired as an oceanographer, many practitioners choose to obtain certification voluntarily."}, {"url": "http://study.com/articles/Oceanographer_Job_Outlook_Duties_and_Requirements.html", "passage_text": "Salary and Job Outlook. According to the U.S. Bureau of Labor Statistics (BLS), geoscientists, including oceanographers, made an average annual salary of $108,420. Jobs for geoscientists are expected to grow by 16% between 2012 and 2022 (www.bls.gov)."}, {"url": "https://answers.yahoo.com/question/index?qid=20070814123114AAsE0Yo", "passage_text": "Rating Newest Oldest. Best Answer: You can become a marine biologist or an oceanographer with just 4 years of college. What I would suggest if you are really interested in this field is to volunteer every chance you get. Report Abuse. Four years of undergrad. After that you can be a marine biologist... but you need three or four years of grad school to get your doctorate."}, {"url": "http://www.answers.com/Q/What_education_and_training_is_required_to_become_an_oceanographer", "passage_text": "An oceanographer falls under the umbrella of a geoscientist. Therefore the following is by and according to the U.S. Department of Labor and particular to the education and training required for a geoscientist. What this means is that you must have a 4-year undergraduate degree and a degree from an accredited medical school or college. That is 8 years of higher education. You then have your residency period, which is a hands on training period where you are supervised by other doctors. That is either a 3 or 4 year period."}, {"url": "http://www.academicinvest.com/science-careers/environmental-science-careers/how-to-become-an-oceanographer", "passage_text": "How to Become an Oceanographer: Career Guide. Becoming an oceanographer might be a great career choice for you if you have a scientific mind, an interest in the environment, you enjoy research and you have a strong work ethic. Below we've outlined what you'll need to become an oceanographer. We've also included helpful information for an oceanographer career, such as job description, job duties, salary expectations, a list of possible employers and much more! Further Training Needed to Become an Oceanographer. Although professional certification is not typically mandatory to be hired as an oceanographer, many practitioners choose to obtain certification voluntarily."}]