[{"url": "https://www.health.qld.gov.au/workforus/profiles/Sunshine/SS_Nambour.asp", "passage_text": "Karen McGill Nurse Unit Manager, Nambour The colleagues I work with at Nambour Hospital make work life enjoyable. Life on the Sunshine Coast is like being on holidays."}, {"url": "http://nambourtown.com.au/html/hospitals-nambour-yandina-qld.html", "passage_text": "Nambour General Hospital is the largest regional public hospital in Queensland servicing the entire Sunshine Coast. Selangor Private Hospital is also located in Nambour."}, {"url": "https://www.health.qld.gov.au/workforus/profiles/Sunshine/SS_Nambour.asp", "passage_text": "Location: 106km north Brisbane. About Nambour. Nambour is a major regional town located in the west of the Sunshine Coast. Nambour has grown to become a significant agricultural centre producing a variety of tropical crops including macadamia nuts, bananas, citrus fruits, pineapple and sugar."}, {"url": "https://www.health.qld.gov.au/services/sunshinecoast/nambour.asp", "passage_text": "Capital works or recent improvements. Nambour General Hospital is a large regional public hospital in Queensland, with the most recent addition to services being the commissioning of the state of the art Procedural Suites and a Cardiac Catheter Laboratory."}, {"url": "http://au.indeed.com/Hospitals-jobs-in-Nambour-QLD", "passage_text": "To provide the patients of the Sunshine Coast Hospital and Health Service with best practice pharmaceutical care in accordance with their needs and the policies... 21 days ago-save job-email-more... 1  View all Queensland Government jobs-Sunshine Coast jobs. 2  Learn more about working at Queensland Government."}, {"url": "http://www.nambourselangor.com.au/", "passage_text": "Rehabilitation-Nambour. Nambour Selangor Private Hospital Rehabilitation Unit provides excellence in multidisciplinary, patient focussed care through the use of a holistic approach. Our aim is to help each patient optimise his or her health and functional independence."}, {"url": "https://www.health.qld.gov.au/workforus/profiles/Sunshine/SS_Nambour.asp", "passage_text": "A new tertiary Sunshine Coast University Hospital (SCUH) at Kawana will open with 450 beds in 2016 and expand to a 738 bed facility by 2021. SCUH will offer a range of new and expanded services for the Sunshine Coast, including a Skills, Academic and Research Centre on the site. Living in Nambour."}]