[{"url": "http://www.urbandictionary.com/define.php?term=Ghettoization", "passage_text": "Ghettoization of the Jews occurred during WW2 when they were forced to live in only specific areas. Women's issues are ghettoized when spoken about as 'special interest' and 'marginal' even though they affect more than 50% of the population."}, {"url": "https://en.wikipedia.org/wiki/Ghetto", "passage_text": "The main square of the Venetian Ghetto. A ghetto is a part of a city in which members of a minority group live, especially because of social, legal, or economic pressure. The term was originally used in Venice to describe the part of the city to which Jews were restricted and segregated."}, {"url": "http://www.answers.com/Q/What_is_ghettoization", "passage_text": "a part of the city set aside as a residential area for Jews. The designation ghetto appeared in the 16th century (apparently from Italian ghetta-the cannon workshop around which the Jewish quarter of Venice, set up in 1516, was situated)."}, {"url": "http://www.merriam-webster.com/dictionary/ghettoize", "passage_text": "Full Definition of GHETTOIZE. transitive verb. : to isolate in or as if in a ghetto. — ghet·to·i·za·tion \\ˌge-tō-ə-ˈzā-shən\\ noun. See ghettoize defined for English-language learners."}, {"url": "http://www.merriam-webster.com/dictionary/ghetto", "passage_text": "Full Definition of GHETTO. 1. : a quarter of a city in which Jews were formerly required to live. 2. : a quarter of a city in which members of a minority group live especially because of social, legal, or economic pressure. 3. See ghetto defined for English-language learners. See ghetto defined for kids."}, {"url": "http://www.urbandictionary.com/define.php?term=Ghettoization", "passage_text": "3. ghettoization. The process by which afro-american's influence culture and society with their slang, attitudes, morals, values and jive. The ghettoization of the internet can be often found when viewing afro-american blogs or chat rooms."}]