[{"url": "http://www.innerbody.com/anatomy/cardiovascular/internal-carotid-artery", "passage_text": "Internal Carotid Artery. The internal carotid artery enters the skull and supplies the anterior part of the brain (via cerebral branches), the eye and its appendages, and sends branches to the forehead and nose."}, {"url": "http://www.nhlbi.nih.gov/health/health-topics/topics/catd/", "passage_text": "Carotid (ka-ROT-id) artery disease is a disease in which a waxy substance called plaque (plak) builds up inside the carotid arteries. You have two common carotid arteries, one on each side of your neck. They each divide into internal and external carotid arteries. The internal carotid arteries supply oxygen-rich blood to your brain. The external carotid arteries supply oxygen-rich blood to your face, scalp, and neck."}, {"url": "http://www.mayfieldclinic.com/PE-AneurUn.htm", "passage_text": "Figure 1. (side view) Blood supply of the brain. The internal carotid arteries supply the anterior (front) areas and the vertebral arteries supply the posterior (back) areas of the brain. After passing through the skull, the right and left vertebral arteries join together to form a single basilar artery."}, {"url": "http://www.nhlbi.nih.gov/health/health-topics/topics/cu/", "passage_text": "You have two common carotid arteries, one on each side of your neck. They each divide into internal and external carotid arteries. The internal carotid arteries supply oxygen-rich blood to your brain. The external carotid arteries supply oxygen-rich blood to your face, scalp, and neck."}, {"url": "http://www.innerbody.com/anatomy/cardiovascular/internal-carotid-artery", "passage_text": "Click to read more below. The internal carotid artery enters the skull and supplies the anterior part of the brain (via cerebral branches), the eye and its appendages, and sends branches to the forehead and nose."}, {"url": "http://www.healthline.com/human-body-maps/internal-carotid-artery", "passage_text": "The internal carotid is responsible for supplying blood to the nearest brain hemisphere with the help of the basilar artery. The vertebra-basilar system supplies blood when the carotid artery cannot do so (due to a blockage, for example)."}, {"url": "https://www.nlm.nih.gov/medlineplus/ency/article/002953.htm", "passage_text": "The blood vessels that bring blood to your brain and face are called the carotid arteries. You have a carotid artery on each side of your neck. The blood flow in this artery can become partly or totally blocked by fatty material called plaque. A partial blockage is called carotid artery stenosis (narrowing)."}]