[{"url": "http://www.animated-teeth.com/dentist_laser_whitening/a4_bleaching_costs.htm", "passage_text": "A) In-office whitening treatments. The price range shown below is an estimate of what a dentist might charge for a one bleaching session (professional, in-office or laser whitening, they're all the same procedure). $400.00 - $900.00. The cost of materials that your dentist incurs when providing you with a tray-based at-home whitening kit can be quite low, especially if the items are bought in bulk. Cost estimate for at-home whitening materials: (Your dentist's cost.). 1  One syringe of whitening gel - $3.00 to $8.00."}, {"url": "http://www.animated-teeth.com/dentist_laser_whitening/a4_bleaching_costs.htm", "passage_text": "B) At-home systems. The price range shown below is an estimate what a dentist might charge for bleaching your teeth via the use of an at-home tray-based system that they have dispensed to you. A tray whitening kit. $175.00 - $425.00 (per arch). Low fee = Small rural city or town.High fee = Large metropolitan area. The cost of materials that your dentist incurs when providing you with a tray-based at-home whitening kit can be quite low, especially if the items are bought in bulk. Cost estimate for at-home whitening materials: (Your dentist's cost.). 1  One syringe of whitening gel - $3.00 to $8.00."}, {"url": "http://www.yourdentistryguide.com/professional-whitening/", "passage_text": "1 Its cost, on average, is $650, compared to $400 for take-home trays and under $100 for over-the-counter bleaching trays or whitening strips. 2  Results can be unpredictable, depending on factors such as age, heredity and the type of staining that is present. To help maintain your whitened teeth, you are given a Zoom! home-use touch-up kit, including custom-fitted whitening trays. Total chair time: Approximately one hour. Zoom teeth whitening cost (including take-home trays): $500."}, {"url": "http://www.docshop.com/education/dental/cosmetic-dentistry/teeth-whitening", "passage_text": "1 The final figure will include the cost of whitening trays and gel. 2  If you require a longer treatment, your final cost will be on the higher end of the spectrum. 3  In-office whitening can run anywhere from $300 to $1000. 1 Strips: Whitening strips are thin pieces of plastic coated in peroxide. 2  You will attach the strips to the front of your teeth, and you will wear them about 30 minutes a day for two weeks. 3  The results typically last around four months."}, {"url": "http://www.yourdentistryguide.com/professional-whitening/", "passage_text": "Dentists who use the Deep Bleaching regimen say it provides permanent deep-whitening if patients follow maintenance instructions. Cost: The fee for the two in-office procedures, custom-fabricated trays and 14 days of home bleaching, ranges from $800 to $3,500. On average, the fee is $1,250. To help maintain your whitened teeth, you are given a Zoom! home-use touch-up kit, including custom-fitted whitening trays. Total chair time: Approximately one hour. Zoom teeth whitening cost (including take-home trays): $500."}, {"url": "http://thesmileclinic.com/teeth-whitening-treatments.php", "passage_text": "The Smile Clinic offers one home whitening system and two levels of laser teeth whitening treatments that cost from $119 to $599. 1  Silver: White-FX Home Whitening System | $119. 2  Gold: Cosmetic Laser Teeth Whitening | $299. 3  Platinum: Power Laser Teeth Whitening | $599. You can be assured that a competent, licensed dental professional will administer your laser teeth whitening procedure. You only require one visit, and the result of visibly lighter teeth can last anywhere from 6 to 24 months depending on diet, lifestyle, and oral hygiene."}, {"url": "http://www.yourdentistryguide.com/professional-whitening/", "passage_text": "Disadvantages of In-Office Whitening. 1  In-office bleaching is more expensive than take-home alternatives. 2  Its cost, on average, is $650, compared to $400 for take-home trays and under $100 for over-the-counter bleaching trays or whitening strips. To help maintain your whitened teeth, you are given a Zoom! home-use touch-up kit, including custom-fitted whitening trays. Total chair time: Approximately one hour. Zoom teeth whitening cost (including take-home trays): $500."}, {"url": "http://www.yourdentistryguide.com/professional-whitening/", "passage_text": "1 In-office bleaching is more expensive than take-home alternatives. 2  Its cost, on average, is $650, compared to $400 for take-home trays and under $100 for over-the-counter bleaching trays or whitening strips. To help maintain your whitened teeth, you are given a Zoom! home-use touch-up kit, including custom-fitted whitening trays. Total chair time: Approximately one hour. Zoom teeth whitening cost (including take-home trays): $500."}, {"url": "http://www.yourdentistryguide.com/teeth-whitening/", "passage_text": "The gel is applied to the teeth via one-size-fits-all trays, whitening strips or paint-on applicators. In many cases this may only whiten a few of the front teeth unlike custom trays that can whiten the entire smile. Over-the-counter teeth whitening cost: $20 to $100. Whether in the form of one-hour bleaching sessions at your dentist's office, or home-use bleaching kits purchased at your local drugstore, teeth whitening solutions abound."}]