[{"url": "http://www.macworld.com/article/2045639/diy-ipad-screen-replacement-it-saves-money-but-its-not-for-the-faint-of-heart.html", "passage_text": "(2:11). If you crack your iPad screen and are out of warranty, it's going to cost you a bundle to get it fixed. Or, you could try it yourself. The intrepid Macworld Lab attempted to repair an iPad 2, and here's how it went. You can also take this opportunity to switch from a black iPad model to a white one, if you like. We bought this screen for our damaged iPad 2 on Amazon for $30. It came with no instructions of any kind, and the reviews from buyers suggested seeking out YouTube videos to walk you through the process."}, {"url": "http://www.repairsuniverse.com/ipad-2-screen-replacements-repair-parts.html", "passage_text": "Find all the replacment screens, parts, and tools you need for your iPad 2 here at RepairsUniverse. We offer brand new parts at affordable prices allowing you to repair your iPad 2 and get your Apple Tablet working like new again! We have the parts you need - 100% quality test guaranteed and Apple iPad compliant. Our Price: $2.99. Our Price: When you order your replacement screen from Repairs Universe, we ship it out the same day for orders placed before 4 pm PST, and 7 pm EST. Your order will also include the instructions you need to replace your iPad 2 screen yourself as well as the free, safe opening tool."}, {"url": "http://lifehacker.com/replace-the-glass-on-your-broken-ipad-at-home-1591652113", "passage_text": "Some repair places charge more than $200 to fix iPad glass screens and you can usually find replacement iPad glass screens—with the digitizer necessary for touch functionality—for around $30 or so on eBay. A busted screen on your iPad can cost a pretty penny to get fixed, but you can do it at home if you're up to the challenge."}, {"url": "http://www.apple-questions.com/ipad/how-much-does-it-cost-to-replace-the-screen-on-an-ipad-2.html", "passage_text": "How much does it cost to replace the screen on an iPad 2. ﻿. The cost to replace the screen on an iPad 2 is between $100 – $150 depending on if you can do the work, or have to pay someone to do it for you. 1 What is the cheapest way to replace an iPhone screen. 2  Is it hard to replace the screen on the iPhone 4. 3  How much does an iphone 3g screen replacement cost. 4  Can you use a iphone 4 screen to replace a 3gs screen."}, {"url": "http://www.macworld.com/article/2045639/diy-ipad-screen-replacement-it-saves-money-but-its-not-for-the-faint-of-heart.html", "passage_text": "If you paid the $99 for AppleCare+ for your iPad (available only within 30 days of purchase), and your tablet suffers accidental damage, Apple will replace your broken iPad up to twice, for $49 each time, during the two-year coverage period. Otherwise, getting it fixed by Apple can cost you $200 to $300 dollars. You can also take this opportunity to switch from a black iPad model to a white one, if you like. We bought this screen for our damaged iPad 2 on Amazon for $30. It came with no instructions of any kind, and the reviews from buyers suggested seeking out YouTube videos to walk you through the process."}, {"url": "http://www.macworld.com/article/2045639/diy-ipad-screen-replacement-it-saves-money-but-its-not-for-the-faint-of-heart.html", "passage_text": "The digitizer is what translates your taps and gestures into input on the iPad. If your LCD panel is also damaged, you can replace that at the same time (the LCD panel sits right underneath the front glass). But for just the screen and the digitizer, you can pick up a kit online in the $50 to $100 range. You can also take this opportunity to switch from a black iPad model to a white one, if you like. We bought this screen for our damaged iPad 2 on Amazon for $30. It came with no instructions of any kind, and the reviews from buyers suggested seeking out YouTube videos to walk you through the process."}, {"url": "https://www.quora.com/How-much-does-it-cost-to-fix-a-cracked-iPad-iPad-2-screen", "passage_text": "Assuming we're talking about a serviceable iPad (not obsolete) it is relatively dependent on whether you have AppleCare Plus coverage. AppleCare Plus offers up to two accidental damage incidents for the iPad at $49 apiece (US pricing) This includes cracked screen repair. Outside of AppleCare coverage, because this is classified as accidental damage, the pricing goes up. Your iPad screen can be replaced for a price dependent on its model. In the US, iPad 2 screen repair is priced at 249 USD-https://www.apple.com/sup port/ip... This excludes tax. Prices will vary by country, so look to your regional Apple Store website if you're in a different country."}, {"url": "http://www.youtube.com/watch?v=EaAVI06fSe0", "passage_text": "This free video will give you step by step directions on how to replace the screen, touch panel and lcd for the iPad Mini. iPad Mini parts are available at http://www.directfix.com For 7% off your first order on our webpage use coupon code YT7 at checkout for a limited time only. "}, {"url": "http://www.apple-questions.com/ipad/how-much-does-it-cost-to-replace-the-screen-on-an-ipad-2.html", "passage_text": "How much is to replace an iPad 2 screen with Apple. The cost of a screen replacement on an iPad 2 is $349 with Apple; however, if you take it in and talk to the people at the Genius Bar, they may give you a new one for free. 1 What is the cheapest way to replace an iPhone screen. 2  Is it hard to replace the screen on the iPhone 4. 3  How much does an iphone 3g screen replacement cost. 4  Can you use a iphone 4 screen to replace a 3gs screen."}]