[{"url": "http://www.rates.ups.com/surcharges.html", "passage_text": "UPS On-Call Pickup ®. The Area Surcharge for a UPS On-Call Pickup request for residential addresses will increase $0.15. The Area Surcharge for a UPS On-Call Pickup request for extended residential addresses will increase $0.18. The Residential Surcharge for a UPS On-Call Pickup request will increase $0.20. The Delivery Area Surcharge applied to residential addresses for U.S. UPS Ground Services will increase $0.15. The Delivery Area Surcharge applied to residential extended addresses for U.S. UPS Ground Services will increase $0.18."}, {"url": "http://www.payscale.com/research/US/Employer=United_Parcel_Service_(UPS)%2c_Inc./Hourly_Rate", "passage_text": "About: United Parcel Service, Inc. (NYSE: UPS), typically referred to by the acronym UPS, is a package delivery company. Headquartered in Sandy Springs, Georgia, United States, UPS delivers more than 15 million packages a day to 6.1 million customers in more than 220 countries and territories around the world. UPS is well…. Read more from Wikipedia »."}, {"url": "http://dcvelocity.com/articles/20130429-ups-full-time-teamsters-would-receive-3-80-hour-wage-hike/", "passage_text": "The tentative contract would set starting pay at $10 an hour for part-timers at the package operations, according to the TDU document. This would represent a $1.50-an-hour increase in starting wages for part-timers. The wage increases will be spread over seven separate payments starting Aug. 1, 2013 through the end of the contract on Aug. 1, 2018, according to the TDU communique. Communiqué for-full time, drivers the proposed increases would raise hourly wages to$.36 05 by the end of the. contract"}, {"url": "http://www.indeed.com/forum/cmp/UPS/UPS-Salaries-Bonuses-Benefits/t6392", "passage_text": "During peak season, the pay rate is the same but you will get paid more due to the hours worked. In other words, normally you get anywhere from three and a half hours to as many as 5 to 6 hours worked because of the heavy volume during this time. When you go over 5 hours you will get overtime at 1 1/2 rate of pay. "}, {"url": "http://www.rates.ups.com/surcharges.html", "passage_text": "The Alaska Remote Area Surcharge for a UPS On-Call Pickup request will increase $2.50, and the Hawaii Remote Area Surcharge for a UPS On-Call Pickup request will increase $0.50. The Delivery Area Surcharge applied to residential addresses for U.S. UPS Ground Services will increase $0.15. The Delivery Area Surcharge applied to residential extended addresses for U.S. UPS Ground Services will increase $0.18."}, {"url": "https://www.ups.com/content/us/en/shipping/cost/zones/index.html", "passage_text": "Package Services. Access a printable version of the UPS Rate and Service Guide, view zones by ZIP Code™ origin, and obtain pricing information about value-added services, additional charges, delivery and extended area surcharges, and fuel surcharges. To proceed, choose your location: "}, {"url": "http://www.rates.ups.com/", "passage_text": "The following changes have been made to the 2015 Rate and Service Guide: 1  Prohibited and Restricted Goods-Shark fins are not accepted for transportation. 2  Holiday Season Changes-Applicable to the following services: 3  UPS 2nd Day Air A.M. ®. 4  UPS 2nd Day Air 5  ®. UPS 3 Day Select 6  ®. UPS ® Ground. 7  UPS ® Standard to/from Canada. 8  UPS ® Standard to/from .... UPS Freight ®. UPS Freight rates for shipments rated on the current UPS Freight 560 (US48), 525 (to and from Canada) and 570/571 (to and from Mexico) Tariffs will increase an average net 4.9%. These rates will be available at ltl.upsfreight.com beginning December 29, 2014"}]