[{"url": "http://www.answers.com/Q/What_temperature_do_you_bake_boneless_chicken_thighs_at", "passage_text": "Direct grilling of boneless chicken thighs should take 15 to 20 minutes and grilling indirectly with the grill chamber temperature at 350 degrees should take 35 to 45 minutes. The time varies in accordance to the thickness of the chicken. 49 people found this useful. D … iscard excess marinade, bake chicken thighs at 400 degrees (or 425 for bbq effect) for about 30 minutes. (A bit longer if you prefer crispy grilled-like lool/taste.) BTW, these are excellent cooked on an actual grill.   While chicken is baking, prepare peaches."}, {"url": "http://www.wikihow.com/Cook-Chicken-Thighs", "passage_text": "Sprinkle the chicken with salt and pepper and allow it to sit in the buttermilk for at least 2 hours. 1  The salt and pepper should be to taste, but if you aren't sure how much to use, start with 1/4 tsp (1.25 ml) salt and 1/8 tsp (0.625 ml) black pepper. 2  Make sure that the chicken is in a nonreactive bowl. 1 If you are unsure of how much salt and pepper to use, start with roughly 1/4 tsp (1.25 ml) salt and 1/8 tsp (0.625 ml) black pepper. 2  Use a basting brush to brush the olive oil over the chicken for a more thorough coating. 3  The oil helps the chicken to stay moist and to brown in the oven."}, {"url": "http://www.ehow.com/how_4819911_bake-boneless-chicken-thighs.html", "passage_text": "Check the internal temperature of the boneless chicken thighs by inserting an instant-read thermometer about halfway through the chicken thighs. When the chicken is finished cooking, the thermometer should read 165 degrees Fahrenheit. Tom Smaldone. Brush the boneless chicken thighs lightly all over with extra virgin olive oil. Season the chicken thighs on both sides with the herbs if you are using them and sea salt or kosher salt and freshly ground black pepper to taste."}, {"url": "https://answers.yahoo.com/question/index?qid=20080826163436AAPtZlS", "passage_text": "heres a recipe for you if your trying to go asian 3 tblsp sesseme oil 1 tbsp peanut butter 1/4 cup sesseme ginger maranaid peaheat oven to 400 degrees. coat chicken thighs with sauce, let stand 5 minutes to maranaid. place chicken on pan cook untill internal temp is 170 degrees good luck!! "}, {"url": "http://www.bhg.com/recipes/how-to/cooking-basics/how-to-saute-chicken/", "passage_text": "Dark-meat fans can also use the quick saute cooking method. Opt for skinless, boneless thighs. These can be sauteed similarly to chicken breasts (above), although thights may take a bit longer to cook: 14 to 18 minutes total for 3- to 4-ounce thighs."}, {"url": "http://www.wikihow.com/Prepare-Boneless-Skinless-Chicken-Thighs", "passage_text": "Place the chicken underneath a piece of plastic wrap. Use a small mallet (metal or wood) and gently pound the chicken thighs. Make sure that each of the thighs is of equal thickness, around 1/2 inch-3/4 inch. This will not only make your chicken more tender, but will allow you to cook the chicken evenly. Get out a large enough baking pan to fit all of the chicken thighs you plan to cook. Add 2 tablespoons of olive oil or butter to the pan. Spread it out evenly, so that your chicken will not stick to the pan. This will get your chicken brown and crispy."}, {"url": "http://www.thekitchn.com/how-to-cook-boneless-skinless-chicken-thighs-in-the-oven-180140", "passage_text": "Toss the chicken with the baking sauce. Spread the chicken in the baking dish. No need to grease the dish. Just lay the chicken inside. Bake for 20 minutes or until the chicken has an internal temperature of 165°F. Boneless, skinless thighs cook quickly. Check after 20 minutes, and if they are not quite up to temperature, put back in the oven and continue cooking and checking the temperature in 5-minute increments. Remove the chicken from the oven and rest the meat, covered, for 10 minutes. Cover the baking dish with foil and let the chicken rest. This will help it be more tender. Eat and enjoy! (Image credits: Faith Durand). Pin it. Open Slideshow. I am a huge, huge fan of boneless, skinless chicken thighs."}, {"url": "http://www.wikihow.com/Prepare-Boneless-Skinless-Chicken-Thighs", "passage_text": "If you remove the skin, you're left with a chicken thigh that has about 130 calories and only 7 grams of fat. Boneless, skinless chicken can generally be bought at most grocery stores. There are several ways to prepare boneless, skinless chicken breasts, such as frying, grilling, or baking. Get out a large enough baking pan to fit all of the chicken thighs you plan to cook. Add 2 tablespoons of olive oil or butter to the pan. Spread it out evenly, so that your chicken will not stick to the pan. This will get your chicken brown and crispy."}, {"url": "http://www.wikihow.com/Cook-Chicken-Thighs", "passage_text": "1 Place the broiler pan 4 to 5 inches (10 to 13 cm) under the top heating element of the oven. 2  Carefully turn the chicken over after 10 minutes pass. 3  Brush this side with oil and continue cooking an additional 10 minutes. 4  Thick thighs or bone-in thighs may need to be cooked for a total of 25 to 35 minutes, instead. 1 If you are unsure of how much salt and pepper to use, start with roughly 1/4 tsp (1.25 ml) salt and 1/8 tsp (0.625 ml) black pepper. 2  Use a basting brush to brush the olive oil over the chicken for a more thorough coating. 3  The oil helps the chicken to stay moist and to brown in the oven."}]