[{"url": "http://www.residual-rewards.com/shelf-corporation.html", "passage_text": "Each aged corporation must be clean from liability, claims, hostile action or other negative problems. These shelf corporations are also considered anonymous, meaning there are no Shareholders, Directors, or Officers listed with the Division of Corporations. Anonymity can be a major benefit of forming a corporation. certificate of incorporation and franchise tax documents that have been filed with the Secretary of State of where the shelf corporation was formed."}, {"url": "http://finance.toolbox.com/blogs/business-credit-for-small-business/is-buying-a-shelf-corporation-a-smart-business-strategy-41665", "passage_text": "In an effort to improve the chances of obtaining financing for your startup you may have heard that buying a shelf corp will open the credit floodgates for your new venture. There are bank ratings, credit history, NSF history, and other factors to consider especially if you request more than a $50k line of credit. So if your interest is in applying for bank financing keep in mind shelf corporations have no business history, tax returns, financials and existing revenue."}, {"url": "http://www.atlanticequity.net/shelf_corps__aged_corp.html", "passage_text": "Buyers of shelf corporations have some big advantages over newly filed businesses. First, the benefits mentioned above. Then, the advantage of being able to purchase a well established corporation and yet put themselves in as officers, directors and shareholders, giving them immediate control of the business. Atlantic Financial Services LLC Currently has a list of “pre-filed” shelf companies that you can acquire. By owning a pre-established corporate identity, you are able to take advantage of the following benefits: 1  Instant availability & fast delivery. 2  Immediately own a company with a corporate history."}, {"url": "https://en.wikipedia.org/wiki/Shelf_corporation", "passage_text": "A shelf corporation, shelf company, or aged corporation is a company or corporation that has had no activity. It was created and left with no activity-metaphorically put on the shelf to age. 1 To save the time involved in taking the steps to create a new corporation. 2  To gain the opportunity to bid on contracts. 3  Some jurisdictions require that a company be in business for a certain length of time to have this ability. 4  To show corporate longevity in order to attract consumers or investors."}, {"url": "http://www.residual-rewards.com/shelf-corporation.html", "passage_text": "Shelf corporations should come with a. certificate of incorporation and franchise tax documents that have been filed with the Secretary of State of where the shelf corporation was formed. Shelf or Aged Corporations are used for convenience, to assume a corporate history and to develop a perceived stability of the business operation"}, {"url": "http://finance.toolbox.com/blogs/business-credit-for-small-business/is-buying-a-shelf-corporation-a-smart-business-strategy-41665", "passage_text": "So, purchasing companies with established credit and existing credit lines can give the business a big financial boost. Here are the Top 5 Advantages of Buying a Shelf Corporation: 1. Saving time and expense of forming a brand new corporation. 2. Instant access to contract and government contract bidding. There are bank ratings, credit history, NSF history, and other factors to consider especially if you request more than a $50k line of credit. So if your interest is in applying for bank financing keep in mind shelf corporations have no business history, tax returns, financials and existing revenue."}, {"url": "https://en.wikipedia.org/wiki/Shelf_corporation", "passage_text": "Common reasons for buying a shelf corporation include: 1  To save the time involved in taking the steps to create a new corporation. 2  To gain the opportunity to bid on contracts. 3  Some jurisdictions require that a company be in business for a certain length of time to have this ability. 1 To save the time involved in taking the steps to create a new corporation. 2  To gain the opportunity to bid on contracts. 3  Some jurisdictions require that a company be in business for a certain length of time to have this ability. 4  To show corporate longevity in order to attract consumers or investors."}, {"url": "http://finance.toolbox.com/blogs/business-credit-for-small-business/is-buying-a-shelf-corporation-a-smart-business-strategy-41665", "passage_text": "Another word of caution that you need to consider is there are many companies that sell shelf corporations that have done business in the past, DO NOT buy these! If a shelf corporation has done business in the past and you purchase it you also assume all past liabilities of that company. There are bank ratings, credit history, NSF history, and other factors to consider especially if you request more than a $50k line of credit. So if your interest is in applying for bank financing keep in mind shelf corporations have no business history, tax returns, financials and existing revenue."}, {"url": "http://1800company.com/aged-shelf-corporations/", "passage_text": "1-800-Company has a complete inventory of incorporated businesses that you can buy off the shelf. Depending on your goals, you can benefit from a 2 to 100 year old corporation and have it instantly. The older your business is, the more likely you are to be approved for various types of business financing. Making a small investment into an aged corporation can propel your business start-up and establish the foundation for success, quickly."}]