[{"url": "http://recipes.howstuffworks.com/question233.htm", "passage_text": "Sodium nitrate (NaNO3) and its close relative sodium nitrite (NaNO2) are preservatives that you find in lots of processed meats. Stuff like salami, hot dogs, pepperoni, bologna, ham, bacon and SPAM all normally contain sodium nitrate as one of the ingredients. "}, {"url": "http://www.businessdictionary.com/definition/nitrate-NO3.html", "passage_text": "Definition. Inorganic or organic ester or salt of nitric acid, containing the (NO3-) ion. Nitrates are the most water soluble of all salts, and play a major part in nitrogen cycle and nitrate pollution. Inorganic nitrates are formed by bacteria and are an essential component of agricultural soil. "}, {"url": "http://www.theaquariumwiki.com/Nitrate", "passage_text": "Nitrate (NO3) is a nitrogen by-product of the nitrifying bacteria (Nitrospira) in a filter or substrate consuming Nitrite. It was previously thought species of Nitrobacter did this. but since 1998 it's considered to be species of Nitrospira. 1  Nitrate is far less toxic than nitrite and much less toxic than Ammonia. "}, {"url": "https://en.wikipedia.org/wiki/Nitrate", "passage_text": "Almost all inorganic nitrate salts are soluble in water at standard temperature and pressure. A common example of an inorganic nitrate salt is potassium nitrate (saltpeter). A rich source of inorganic nitrate in the human body comes from diets rich in leafy green foods, such as spinach and arugula. It is now believed that dietary nitrate in the form of plant-based foods is converted in the body to nitrite. Nitrate is a polyatomic ion with the molecular formula NO 3 − and a molecular mass of 62.0049 g/mol. Nitrates also describe the organic functional group RONO 2"}, {"url": "http://www.webmd.com/heart-disease/nitrates-for-coronary-artery-disease", "passage_text": "How It Works. Nitrates open (dilate) the arteries to the heart. This increases blood flow to the heart, relieving angina symptoms such as chest pain or pressure. Nitrates also dilate veins throughout the body so that they can hold more blood. This reduces the amount of blood going back to the heart, reducing the heart's workload. "}, {"url": "http://www.medicinenet.com/nitrates-oral/article.htm", "passage_text": "Nitrates are medications used for treating or preventing chest pain (angina) caused by heart disease, usually of the arteries in the heart. Nitrates are vasodilators (dilators of blood vessels that increase their diameter) that allow blood to flow more easily. "}, {"url": "http://www.co.portage.wi.us/groundwater/undrstnd/no3.htm", "passage_text": "A specific group of microorganisms convert ammonium to nitrate (NO3) . Since nitrate is water-soluble, excess nitrate not used by plants can leach through the soil and into the groundwater. Nitrate (NO 3) is a compound that contains nitrogen and water. Nitrogen comes from decomposing organic materials like manure, plants, and human wastes. Often the nitrogen (N) comes from ammonia (NH 3) or ammonium (NH 4). Although nitrate is necessary, high levels can be harmful to humans, animals, and plants. Nitrate (NO"}, {"url": "https://en.wikipedia.org/wiki/Sodium_nitrate", "passage_text": "Sodium nitrate is the chemical compound with the formula Na N O 3. This salt is also known as Chile saltpeter or Peru saltpeter (due to the large deposits found in the Atacama desert in these countries) to distinguish it from ordinary saltpeter, potassium nitrate. It is a readily available source of the nitrate anion (NO 3 −), which is useful in several reactions carried out on industrial scales for the production of fertilizers, pyrotechnics and smoke bombs, glass and pottery enamels, food preservatives (esp. meats), and solid rocket propellant."}]