[{"url": "http://dogcare.dailypuppy.com/flowering-potato-vine-poisonous-dogs-6286.html", "passage_text": "The flowering potato vine's flowers may be white or blue. Brand X Pictures/Brand X Pictures/Getty Images. The flowering potato vine (Solanum jasminoides) is grown in many gardens because of its fast growth, semi-evergreen foliage and white flowers."}, {"url": "http://www.ehow.com/facts_7358468_sweet-potato-vine-toxic_.html", "passage_text": "Although most gardeners are familiar with annual sweet potato vines (Ipomoea batatas) for their edible, smoky-sweet orange tubers, the ornamental sweet potato vine puts its energy into fountains of deeply lobed or heart-shaped, spring-to-fall leaves. Poison Seeds. Like annual Heavenly Blue morning glories (Ipomoea tricolor Heavenly Blue) and other members of the Morning Glory (Convolvulaceae) family, ornamental sweet potato vines that flower produce seeds laced with the toxic indole LSD."}, {"url": "http://emilycompost.com/morning_glory.htm", "passage_text": "I have a 2 year old and do not want such a poisonous plant around if it is. A: Unfortunately, parts of many plants are poisonous. The Ipomoea batatas 'Blackie' or Sweet Potato Vine is sometimes called Morning Glory. All the plants that I have seen called the Morning Glory are in the Ipomoea species. We have seen the Morning Glory listed as poisonous on a few websites. "}, {"url": "http://dogcare.dailypuppy.com/flowering-potato-vine-poisonous-dogs-6286.html", "passage_text": "A member of the nightshade family, the flowering potato vine is a relative of the familiar garden potato. Like the garden potato, the leaves, stems, flowers and berries are all toxic to man and beast -- including your beloved puppy, Picasso. The flowering potato vine (Solanum jasminoides) is grown in many gardens because of its fast growth, semi-evergreen foliage and white flowers."}, {"url": "http://www.backyardchickens.com/t/233479/i-was-thinking-of-planting-sweet-potato-vine-to-trail-up-my-coop", "passage_text": "There are a couple plants called sweet potato vine. There is a soft vine with green or black leaves that I've mostly seen grown in hanging containers. I don't think this is what you are referring to, as I cannot see this growing up the sides of anything. The other on is a shrubby viney plant that grows with stiff stems. "}, {"url": "http://dogcare.dailypuppy.com/flowering-potato-vine-poisonous-dogs-6286.html", "passage_text": "The members of the nightshade, or Solanum family, including tomatoes, potatoes and the flowering potato vine, all contain alkaloids which may be toxic if eaten in large quantities. Among the symptoms of alkaloid poisoning are confusion, dilated pupils, diarrhea, drooling, sleepiness, vomiting and weakness. The flowering potato vine (Solanum jasminoides) is grown in many gardens because of its fast growth, semi-evergreen foliage and white flowers."}, {"url": "http://homeguides.sfgate.com/flowering-potato-vine-poisonous-dogs-64479.html", "passage_text": "Flowering potato vine (Solanum jasminoides) is a tropical plant with fragrant blooms that last throughout the summer. This showy plant with elegant white or blue-tinged flowers adds interest to a garden space but is also toxic to pets and humans if ingested. Potato vine is an evergreen perennial found growing in U.S. Department of Agriculture plant hardiness zones 9 through 11. Potato vine is an ornamental flowering plant that is distantly related to the edible potato grown in gardens."}, {"url": "http://homeguides.sfgate.com/parts-potato-plants-poisonous-56644.html", "passage_text": "Potatoes are members of the Solanaceae plant family, a group that includes a variety of plants variously regarded as weeds, ornamentals and fruits or vegetables. Belladonna, mandrake and tobacco are members of this group, also known by their common name, nightshade. Perhaps the production of solanine was an evolved defense for plants such as black nightshade (Solanum nigrum) and other weedy plants to ward off vegetarian grazers. The part of the potato you eat grows underground and contains much less solanine. The solamine in potato tubers rests under the skin."}, {"url": "http://homeguides.sfgate.com/flowering-potato-vine-poisonous-dogs-64479.html", "passage_text": "Toxicity Level. The California Poison Control Organization rates the potato vine at a Level 4 toxicity. Ingesting the berries on this plant can cause serious health problems to humans and animals. The toxic chemicals in the berries can affect the liver, kidneys, heart or brain. Potato vine is an ornamental flowering plant that is distantly related to the edible potato grown in gardens."}]