[{"url": "http://www.webmd.com/a-to-z-guides/blood-transfusion-blood-types", "passage_text": "The ABO system consists of A, B, AB, and O blood types. People with type A have antibodies in the blood against type B. People with type B have antibodies in the blood against type A. People with AB have no anti-A or anti-B antibodies. People with type O have both anti-A and"}, {"url": "http://learn.genetics.utah.edu/content/inheritance/blood/", "passage_text": "Each blood type is either positive + (has the Rh protein) or negative - (no Rh protein). For example, a person whose blood type is A positive (A +), has both type A and Rh proteins on the surface of their red blood cells. Type A blood cells are covered with A agglutinogens, type B have B agglutinogens, type AB have both A and B, and type O blood have none."}, {"url": "http://www.infoplease.com/ipa/A0877658.html", "passage_text": "Human blood is grouped into four types: A, B, AB, and O. Each letter refers to a kind of antigen, or protein, on the surface of red blood cells. For example, the surface of red blood cells in Type A blood has antigens known as A-antigens."}, {"url": "http://www.answers.com/Q/How_many_blood_types_are_there", "passage_text": "There are 4 different blood types (A, B, O, & AB). Each blood type can either be Rh positive or Rh negative. (e.g., A+, A-, B+, B-, O+, O-, AB+, AB-). Blood type AB is the universal receiver when it comes to donating blood. That means anyone can donate blood to a person with AB blood."}, {"url": "http://www.redcrossblood.org/learn-about-blood/blood-types", "passage_text": "In general, Rh negative blood is given to Rh-negative patients, and Rh positive blood or Rh negative blood may be given to Rh positive patients. 1  The universal red cell donor has Type O negative blood type. 2  The universal plasma donor has Type AB"}, {"url": "http://learn.genetics.utah.edu/content/inheritance/blood/", "passage_text": "Distinct molecules called agglutinogens (a type of antigen) are attached to the surface of red blood cells. There are two different types of agglutinogens, type A and type B. Each type has different properties."}]