[{"url": "http://healthyeating.sfgate.com/calories-reuben-sandwich-3493.html", "passage_text": "Two slices of rye bread contain 166 calories, and a 3-ounce serving of corned beef contains 213 calories. The butter used to grill the sandwich contains 36 calories per pat. Add a 1/2-cup serving of drained sauerkraut for 14 calories and a slice of Swiss cheese for 106 calories. Top the sandwich with 1 tablespoon of Thousand Island dressing for an additional 56 calories. Assembled, a homemade Reuben sandwich contains about 591 calories. A Reuben sandwich from Arby's, for example, contains 640 calories. A small Reuben sandwich from Schlotzsky's contains 597 calories, while a medium version has 882 calories."}, {"url": "http://www.sparkpeople.com/calories-in.asp?food=pretzel+bread", "passage_text": "1 Calories Burned For Running: 7 mph (8.5 minutes per mile). 2  Calories Burned For Running: 6.3 mph (9.5 minutes per mile). 3  Calories Burned For Running: 5.7 mph (10.5 minutes per mile). 4  Calories Burned For Running: 5.2 mph (11.5 minutes per mile). "}, {"url": "http://healthyeating.sfgate.com/calories-reuben-sandwich-3493.html", "passage_text": "The sandwich has 1,610 milligrams of sodium as well. A small Schlozsky's Reuben contains 25 grams of total fat, of which 12 grams are saturated, and 1,435 milligrams of sodium. The medium Reuben contains 37 grams of total fat, of which 18 grams are saturated, and 2,128 milligrams of sodium. A Reuben sandwich from Arby's, for example, contains 640 calories. A small Reuben sandwich from Schlotzsky's contains 597 calories, while a medium version has 882 calories."}, {"url": "http://www.sparkpeople.com/calories-in.asp?food=pretzel+roll", "passage_text": "1 Calories In Beef Burger on Pretzel Roll with Cheddar. 2  471 calories, 20g fat, -1g carbs, 22g protein, 0g fiber. 3  Calories In Turkey club on a pretzel roll. 4  588 calories, 23g fat, 7g carbs, 21g protein, 0g fiber. 1 471 calories, 20g fat, -1g carbs, 22g protein, 0g fiber. 2  Calories In Turkey club on a pretzel roll. 3  588 calories, 23g fat, 7g carbs, 21g protein, 0g fiber. 4  Calories In Amish Italian Sausage Pretzel Roll with American cheese."}, {"url": "http://www.sparkpeople.com/calories-in.asp?food=pretzel+roll", "passage_text": "1 Calories In Turkey club on a pretzel roll. 2  588 calories, 23g fat, 7g carbs, 21g protein, 0g fiber. 3  Calories In Amish Italian Sausage Pretzel Roll with American cheese. 4  707 calories, 46g fat, 44g carbs, 28g protein, 1g fiber. 1 471 calories, 20g fat, -1g carbs, 22g protein, 0g fiber. 2  Calories In Turkey club on a pretzel roll. 3  588 calories, 23g fat, 7g carbs, 21g protein, 0g fiber. 4  Calories In Amish Italian Sausage Pretzel Roll with American cheese."}, {"url": "http://www.fatsecret.com/calories-nutrition/search?q=Pretzel+Roll", "passage_text": "Use the FatSecret food diary to track your diet. There are thousands of foods and recipes in the FatSecret database to choose from, with detailed nutritional information including calories, fat and protein for each serving size. You may also add one of the many great recipes and food ideas submitted by our members."}, {"url": "https://recipes.sparkpeople.com/recipe-calories.asp?recipe=93782", "passage_text": "Here are the foods from our food nutrition database that were used for the nutrition calculations of this recipe. Calories per serving of Turkey Reuben Sandwich. 213 calories of Swiss Cheese, (2 slice (1 oz)). 165 calories of Bread, rye, (2 slice). 140 calories of Ken's Steak House, Thousand Island Salad Dressing, 2 Tbsp, (1 serving). 119 calories of Olive Oil, (1 tbsp)."}, {"url": "http://www.calorieking.com/calories-in-pretzel+bun.html", "passage_text": "Find nutritional information like calories, carbs, fat, protein and fiber for pretzel bun. "}, {"url": "http://www.sparkpeople.com/calories-in.asp?food=pretzel+roll", "passage_text": "1 490 calories, 14g fat, 70g carbs, 23g protein, 7g fiber. 2  Calories In Beef Burger on Pretzel Roll with Cheddar. 3  471 calories, 20g fat, -1g carbs, 22g protein, 0g fiber. 4  Calories In Turkey club on a pretzel roll. 1 471 calories, 20g fat, -1g carbs, 22g protein, 0g fiber. 2  Calories In Turkey club on a pretzel roll. 3  588 calories, 23g fat, 7g carbs, 21g protein, 0g fiber. 4  Calories In Amish Italian Sausage Pretzel Roll with American cheese."}]