[{"url": "https://en.wikipedia.org/wiki/Kinkajou", "passage_text": "The kinkajou (Potos flavus) is a rainforest mammal of the family Procyonidae related to olingos, coatis, raccoons, and the ringtail and cacomistle. It is the only member of the genus Potos and is also known as the honey bear (a name that it shares with the sun bear). Kinkajous particularly enjoy figs. Studies have shown that 90% of their diet consists of (primarily ripe) fruit. To eat softer fruits they hold it with their forepaws, then scoop out the succulent pulp with their tongue."}, {"url": "https://en.wikipedia.org/wiki/Kinkajou", "passage_text": "An adult kinkajou weighs 1.4–4.6 kg (3–10 lb). The adult body length is 40–60 cm (16–24 in); in addition to body length, the tail length is 40–60 cm (16–24 in). The kinkajou's woolly fur consists of an outer coat of gold (or brownish-gray) overlapping a gray undercoat. It has large eyes and small ears. Kinkajous particularly enjoy figs. Studies have shown that 90% of their diet consists of (primarily ripe) fruit. To eat softer fruits they hold it with their forepaws, then scoop out the succulent pulp with their tongue."}, {"url": "http://sciencehack.com/videos/view/WAONSVdSY14", "passage_text": "The Kinkajou (Potos flavus), also known as the Honey Bear, or Cat-Monkey is a rainforest mammal of the family Procyonidae related to the olingo, ringtail, cacomistle, raccoon, and coati. It is the only member of the genus Potos. "}, {"url": "http://www.maconmagic.com/species_kinkajous.htm", "passage_text": "The Kinkajou (Potos flavus), also known as the Honey Bear, or Cat-Monkey is a rainforest mammal of the family Procyonidae related to the olingo, ringtail, cacomistle, raccoon, and coati. It is the only member of the genus Potos. A n average adult kinkajou weighs 2–3 kg (4–7 lb). Growing to an average body length of 17-22 inches, their tail is 16-22 inches in length in addition to the body."}, {"url": "http://www.answers.com/Q/What_is_the_kinkajou%27s_habitat_look_like", "passage_text": "Making the world better, one answer at a time. It Is Found Around On Tree Branches That Are Not Far From The Ground Floor. Kinkajous (Pronounced Kin-ca-jow) Are Rainforest Mammals That Look Like A Small Primate But Is Actually Related To Racoons And Their Most Closest Relatives Are Primate Like Animals Called Olingos. 1 Keeping a Kinkajou as a Pet Kinkajou pets are exotic mammals that make unique companions. 2  Kinkajous, also known as honey bears, are rainforest mammals related to raccoons and coatis. 3  They can make goo…. 4  Tips for Easy Living With Your Kinkajou Living with kinkajou as pets can be a challenge."}, {"url": "https://en.wikipedia.org/wiki/Procyonidae", "passage_text": "Procyonidae is a New World family of the order Carnivora. It includes the raccoons, coatis, kinkajous, olingos, olinguitos, ringtails and cacomistles. Procyonids inhabit a wide range of environments and are generally omnivorous. Many procyonids have banded tails, and distinctive facial markings – these are especially visible in the raccoons. Like bears, procyonids are plantigrade, walking on the soles of their feet. Most species have non-retractile claws."}, {"url": "http://www.mnh.si.edu/mna/image_info.cfm?species_id=448", "passage_text": "Its big, bright, forward-facing eyes make the Kinkajou look more like a primate than a carnivore, but in fact its closest relatives are not monkeys and humans, but raccoons, ringtails, and coatis. Kinkajous are strictly nocturnal. Even tamed captives usually sleep all day and do their exploring at night. "}, {"url": "http://www.maconmagic.com/species_kinkajous.htm", "passage_text": "The similarities between kinkajous and olingos are thus an example of parallel evolution; the closest relatives of the oligos are actually the coatis. A n average adult kinkajou weighs 2–3 kg (4–7 lb). Growing to an average body length of 17-22 inches, their tail is 16-22 inches in length in addition to the body. Although classified in the order Carnivora and equipped with sharp teeth, they actually primarily eat fruit"}, {"url": "http://eol.org/pages/328067/details", "passage_text": "Kinkajou. Learn more about this article. The kinkajou (Potos flavus) is a rainforest mammal of the family Procyonidae related to olingos, coatis, raccoons, and the ringtail and cacomistle. It is the only member of the genus Potos and is also known as the honey bear (a name that it shares with the sun bear). Kinkajous have distinctive features that at one time were used to place them in the order Primates as Lemur flavus. Kinkajous are arboreal and possess many adaptations common to arboreal species, such as a long, fully prehensile tail, nimble clawed fingers, and fully reversible hind feet."}]