[{"url": "http://livelovefruit.com/best-alkaline-plant-based-foods/", "passage_text": "Celery is one of the most alkaline foods you can eat! It quickly neutralizes acids and is high in potassium and sodium which makes it a great diuretic (helps rid the body of excess fluid). Celery is also a very high-water content food, so it helps hydrate and nourish the cells in your body. […] have an alkaline-forming effect in the body when fully ripe. Eating lots of alkaline-forming foods (fresh, ripe, fruit and vegetables) can help reduce your risk of developing disease and illness […]. Reply. […] Carly Fraser | LiveLoveFruit […]. Reply. […] is bothering your system, or some malabsorption issues."}, {"url": "http://thealkalinefoods.com/alkaline-foods/celery", "passage_text": "Celery. Celery, also known as Apium graveolens, is a biennial plant that belongs to the family of Apiaceae. It is characterized by a group of stalks with green leaves and white flowers during its season. It is connected to the family of some plants like carrots and parsley. Celery plant is not only consumed to satisfy hunger. It is also used to flavor the food because of its aromatic leaves and to garnish the plate. It provides as well many health benefits which include treating high blood pressure."}, {"url": "http://www.rense.com/1.mpicons/acidalka.htm", "passage_text": "To maintain health, the diet should consist of 60% alkaline forming foods and 40% acid forming foods. To restore health, the diet should consist of 80% alkaline forming foods and 20% acid forming foods. Generally, acid forming foods include: meat, fish, poultry, eggs, grains, and legumes. Shifting Your pH Toward Alkaline... This chart is for those trying to adjust their body pH. The pH scale is from 0 to 14, with numbers below 7 acidic (low on oxygen) and numbers above 7 alkaline. An acidic body is a sickness magnet."}, {"url": "http://livelovefruit.com/best-alkaline-plant-based-foods/", "passage_text": "All leafy greens are alkaline forming. Kale is especially high in alkaline-forming minerals like calcium and magnesium, and is one of the most mineral dense greens out there! Kale is a power food, and has a major chlorophyll component which attributes to it’s amazing alkaline properties. […] have an alkaline-forming effect in the body when fully ripe. Eating lots of alkaline-forming foods (fresh, ripe, fruit and vegetables) can help reduce your risk of developing disease and illness […]. Reply. […] Carly Fraser | LiveLoveFruit […]. Reply. […] is bothering your system, or some malabsorption issues."}, {"url": "http://www.rense.com/1.mpicons/acidalka.htm", "passage_text": "Generally, alkaline forming foods include: most fruits, green vegetables, peas, beans, lentils, spices, herbs and seasonings, and seeds and nuts. Generally, acid forming foods include: meat, fish, poultry, eggs, grains, and legumes. Shifting Your pH Toward Alkaline... This chart is for those trying to adjust their body pH. The pH scale is from 0 to 14, with numbers below 7 acidic (low on oxygen) and numbers above 7 alkaline. An acidic body is a sickness magnet."}, {"url": "http://www.balance-ph-diet.com/alkaline_recipes_celery_almond_salad.html", "passage_text": ": Alkaline Celery-Almond Salad. This wonderfully tasting salad includes a lot of celery, which provides low-calorie dietary fibre. Many see celery as an ideal weight loss vegetable, because during digestion it actually burns more calories than the body can extract from it. Celery may even lower blood pressure. So enjoy this quick and healty alkaline salad as main or as side dish"}, {"url": "http://thealkalinefoods.com/alkaline-foods/celery", "passage_text": "The diet of a person must include 60% alkaline forming foods and 40% acid forming foods to maintain healthy lifestyle. However, 80% alkaline forming foods and 20% acid forming foods should be taken in by the body to restore its health. Celery plant is not only consumed to satisfy hunger. It is also used to flavor the food because of its aromatic leaves and to garnish the plate. It provides as well many health benefits which include treating high blood pressure."}, {"url": "http://livelovefruit.com/best-alkaline-plant-based-foods/", "passage_text": "Most peppers, including cayenne peppers, have a pH above 8 which helps transform acidic foods, raising the body’s overall alkaline level. Cut up some red pepper in your salad, or eat it like an apple! Consuming raw foods maintains an alkaline state in the body, whereas cooked foods are more acidifying. […] have an alkaline-forming effect in the body when fully ripe. Eating lots of alkaline-forming foods (fresh, ripe, fruit and vegetables) can help reduce your risk of developing disease and illness […]. Reply. […] Carly Fraser | LiveLoveFruit […]. Reply. […] is bothering your system, or some malabsorption issues."}, {"url": "http://thealkalinefoods.com/alkaline-foods/celery", "passage_text": "It is rich in calcium and is considered as a great replacement for animal products. But the most important of these all is that celery belongs to an alkaline forming food, a very important food component needed by the human body. Human blood pH needs to be slightly alkaline, which means that the pH should be above 7.0. Celery plant is not only consumed to satisfy hunger. It is also used to flavor the food because of its aromatic leaves and to garnish the plate. It provides as well many health benefits which include treating high blood pressure."}, {"url": "http://www.liferesearchuniversal.com/acid.html", "passage_text": "Most grains are acid-forming, except millet and buckwheat, which are considered to be alkaline. Sprouted seeds and grains become more alkaline in the process of sprouting. All foods are burned in the body--more commonly called digested-- leaving an ash as the result of the burning, or the digestion. This food ash can be neutral, acid or alkaline, depending largely on the mineral composition of the foods. Some foods leave an acid residue or ash, some alkaline."}]