[{"url": "http://www.uno.edu/cos/departments/ees/Resources-Docs/L04_Sedimentary_Rocks2.pdf", "passage_text": "Deposition of Sediments. Sedimentary Rocks are formed when sediments have been deposited and undergone lithification, a process that includes compaction(through burial) and cementation (mineral precipitation from intergranular aqueous solutions), or when masses of intergrown crystals precipitate from aqueous solution."}, {"url": "http://www.answers.com/Q/Explain_how_the_processes_of_compaction_and_cementation_form_sedimentary_rock", "passage_text": "----------------------------------------------------------- The combined process of, accumulation, stratification, sedimentation, compaction, cementation, and lithification, of deposited materials and detritus to form sedimentary rocks is called diagenesis."}, {"url": "http://www.bbc.co.uk/bitesize/ks3/science/environment_earth_universe/rock_cycle/revision/3/", "passage_text": "This is called compaction. The water is squeezed out from between the pieces of rock and crystals of different salts form. The crystals form a sort of glue that sticks or cements the pieces of rock together. This process is called cementation. These processes eventually make a type of rock called sedimentary rock."}, {"url": "http://volcano.oregonstate.edu/book/export/html/1056", "passage_text": "Sedimentary rocks are formed in three ways from these different sized sediments. A sedimentary rock is a layered rock that is formed from the compaction, cementation, and the recrystallization of sediments. Compaction is the squeezing together of layers of sediment due to the great weight of overlying layers of rock."}, {"url": "http://volcano.oregonstate.edu/sedimentary-rocks-lesson-13", "passage_text": "Weathering is the process of breaking down rocks and minerals into smaller pieces by water, wind, and ice. Sedimentary rocks are formed from the breaking apart of other rocks (igneous, metamorphic, or sedimentary rocks) and the cementation, compaction and recrystallization of these broken pieces of rock."}, {"url": "http://volcano.oregonstate.edu/sedimentary-rocks-lesson-13", "passage_text": "Sedimentary rocks are formed in three ways from these different sized sediments. A sedimentary rock is a layered rock that is formed from the compaction, cementation, and the recrystallization of sediments. Compaction is the squeezing together of layers of sediment due to the great weight of overlying layers of rock."}, {"url": "http://volcano.oregonstate.edu/book/export/html/1056", "passage_text": "Weathering is the process of breaking down rocks and minerals into smaller pieces by water, wind, and ice. Sedimentary rocks are formed from the breaking apart of other rocks (igneous, metamorphic, or sedimentary rocks) and the cementation, compaction and recrystallization of these broken pieces of rock."}]