[{"url": "http://biology.about.com/od/celldivision/ss/cell-cycle.htm", "passage_text": "The cell cycle is the complex sequence of events by which cells grow and divide. In eukaryotic cells, this process includes a series of four distinct phases. These phases consist of the Mitosis phase (M), Gap 1 phase (G 1), Synthesis phase (S), and Gap 2 phase (G 2) . The G 1, S, and G 2 phases of the cell cycle are collectively referred to as interphase."}, {"url": "http://www.macroevolution.net/interphase.html", "passage_text": "Mitosis. Meiosis. The interphase, or growth, period of the eukaryotic cell cycle (indicated by I in the figure at left below) alternates with mitosis (M in the figure). It's the time when the cell isn't undergoing division."}, {"url": "http://www.macroevolution.net/interphase.html", "passage_text": "Interphase is the stage of the cell cycle in which cells spend most of their time and perform their customary functions, including preparation for cell division."}, {"url": "http://www.macroevolution.net/interphase.html", "passage_text": "The interphase, or growth, period of the eukaryotic cell cycle (indicated by I in the figure at left below) alternates with mitosis (M in the figure). It's the time when the cell isn't undergoing division."}, {"url": "http://www.nature.com/scitable/topicpage/eukaryotes-and-cell-cycle-14046014", "passage_text": "In eukaryotes, the cell cycle consists of four discrete phases: G 1, S, G 2, and M. The S or synthesis phase is when DNA replication occurs, and the M or mitosis phase is when the cell actually divides."}, {"url": "http://www.sparknotes.com/biology/cellreproduction/cellcycle/terms.html", "passage_text": "Mitosis-The shorter phase of the two-phase eukaryotic cell cycle; cells divide during mitosis. Interphase is the second phase of the cell cycle. S phase-The second, middle part of interphase, occurring between G1 and G2; during S phase DNA is duplicated before cell division."}, {"url": "http://www2.oakland.edu/biology/chaudhry/pics/Chapter29F.pdf", "passage_text": "S phase is the restricted part of the eukaryotic cell cycle during which synthesis of DNA occurs. G2 phase is the period of the cell cycle separating the replication of a cell's chromosomes (S phase) from the following mitosis (M phase). The spindle guides the movement of chromosomes during cell division."}]