[{"url": "http://www.ehow.com/about_6546060_oilcloth-fabric_.html", "passage_text": "Modern cotton oilcloth is made from a cotton fabric that has been overplayed with a vinyl coating instead of a linseed coating. Since the base itself is a cotton fabric, users have an option to resew it if the fabric becomes damaged. When oilcloth was first created, it was usually made out of canvas or some other thick fabric that had a strong cotton base. Sometimes thick linen was used. Manufacturers would take this base and coat it with linseed oil, which when dry added the necessary durability and protection."}, {"url": "http://www.mendels.com/Oilcloth/", "passage_text": "The recent Consumer Product Safety Improvement Act of 2008 (CPSIA) prohibits oilcloth garments such as bibs and aprons or toys for children under age 12. This is due to the level of phthalates (a softener present in all vinyl) in the PVC vinyl of which oilcloth is made. Fabric is sold by the running yard. If you purchase one yard of oilcloth you will be sent a piece that is 36 by 47. Fabric is sold in 1/4 yard increments, with a 1/2 yard minimum per fabric."}, {"url": "http://www.curbly.com/users/ModHomeEcTeacher/posts/6857-real-oilcloth-and-how-to-make-it", "passage_text": "However, genuine oilcloth, the real thing grandma had on her kitchen table was made from cotton duck, canvas or linen that was. coated several times with linseed oil to give it a waterproof-ish surface. The fabric could be dyed or printed before the linseed treatment. Genuine oilcloth is biodegradable in a landfill. The falsely advertised real oilcloth made from PVC or polyvinyl chloride does not break down in a landfill. If you need your custom fabric laminated with a PVC coating, here are a number of companies who will do the job for you. If you'd like to give the real thing a try, here's what you need :"}, {"url": "http://www.ebay.com/gds/What-Is-Oilcloth-/10000000178626807/g.html", "passage_text": "Write a guide. Oilcloth is a durable, waterproof fabric made from a mixture of cloth and vinyl. This heavy-duty fabric has been around since the 18th century and has numerous uses, ranging from protective kitchen tablecloths to tents and bedrolls. Oilcloth is a durable, waterproof fabric made from a mixture of cloth and vinyl"}, {"url": "http://www.ehow.com/about_6546060_oilcloth-fabric_.html", "passage_text": "The cotton also makes the cloth more flexible than traditional types of oilcloth. Vinyl oilcloth is made out of a sheet of vinyl bonded to a thin cotton mesh. This is not as flexible as oilcloth made with cotton fabric but tends to be more durable and tear-resistant. Vinyl is a plastic derivative that easily resists water and stains. When oilcloth was first created, it was usually made out of canvas or some other thick fabric that had a strong cotton base. Sometimes thick linen was used. Manufacturers would take this base and coat it with linseed oil, which when dry added the necessary durability and protection."}, {"url": "http://www.ehow.com/about_6546060_oilcloth-fabric_.html", "passage_text": "One of the newer types of oilcloth is made by coating cotton fabric with a PVC, or polyvinyl chloride, layer. PVC is known to be very durable and is expected to last at least as long as vinyl versions. When oilcloth was first created, it was usually made out of canvas or some other thick fabric that had a strong cotton base. Sometimes thick linen was used. Manufacturers would take this base and coat it with linseed oil, which when dry added the necessary durability and protection."}, {"url": "https://en.wikipedia.org/wiki/Oilcloth", "passage_text": "Oilcloth, also known as enameled cloth or (in England) American cloth, was close-woven cotton duck or linen cloth with a coating of boiled linseed oil to make it waterproof. Manufacture [edit]. Boiled linseed oil was prepared by a long boiling of linseed oil with metal salts, originally lead dross. The modern oil is less toxic, but also less suitable for making oilcloth. Re-enactors may boil their own oil in the search for a correctly coloured oilcloth."}]