[{"url": "http://www.webmd.com/brain/nerve-pain-and-nerve-damage-symptoms-and-causes", "passage_text": "With nerve damage there can be a wide array of symptoms. Which ones you may have depends on the location and type of nerves that are affected. Damage can occur to nerves in your brain and spinal cord. It can also occur in the peripheral nerves, which are located throughout the rest of your body. Autonomic nerve damage may produce the following symptoms: 1  Inability to sense chest pain, such as angina or heart attack. "}, {"url": "http://www.webmd.boots.com/pain-management/guide/nerve-pain", "passage_text": "1 Autoimmune diseases. 2  A variety of different types of autoimmune diseases can produce symptoms of nerve pain and nerve damage. 3  These include multiple sclerosis, Guillain-Barre barré (syndrome a rare condition in which the immune system attacks the peripheral), nerves myasthenia, gravis lupus and inflammatory bowel.  disease 1 Motor neuron diseases. 2  The motor neurons are nerves in your brain and spinal column that communicate with the muscles throughout your body. 3  Diseases that affect these nerves, including amyotrophic lateral sclerosis or Lou Gehrig’s disease, can result in progressively worsening nerve damage. 4  Nutritional deficiencies."}, {"url": "http://www.mayo.edu/research/departments-divisions/department-neurology/programs/peripheral-nerve-disorders", "passage_text": "The following are the major types of peripheral neuropathy: 1  Neuropathy is the disease of the nervous system in which there is a disturbance in the function of a nerve or particular group of nerves. 2  The three major forms of nerve damage are: peripheral neuropathy, autonomic neuropathy, and mononeuropathy. 1 The most common form is peripheral neuropathy, which mainly affects the feet and legs. 2  Sciatica is pain, tingling, or numbness produced by an irritation of the sciatic nerve. 3  Sciatica is a pain in the leg due to irritation of the sciatic nerve."}, {"url": "https://en.wikipedia.org/wiki/List_of_neurological_conditions_and_disorders", "passage_text": "From Wikipedia, the free encyclopedia. This is a list of major and frequently observed neurological disorders (e.g., Alzheimer's disease), symptoms (e.g., back pain), signs (e.g., aphasia) and syndromes (e.g., Aicardi syndrome). There is disagreement over the definitions and criteria used to delineate various disorders and whether some of these conditions should be classified as mental disorders or in other ways."}, {"url": "http://www.disabled-world.com/health/neurology/disorders-list.php", "passage_text": "Central Pain Syndrome-is a neurological condition caused by damage to or dysfunction of the central nervous system (CNS), which includes the brain, brainstem, and spinal cord. This syndrome can be caused by stroke, multiple sclerosis, tumors, epilepsy, brain or spinal cord trauma, or Parkinson's disease. The spectrum of neurological disorders is broad and involves the central nervous system, or CNS (brain and spinal cord) and the peripheral nervous system, or PNS (nerves outside the brain and spinal cord, and related muscle)."}, {"url": "http://www.disabled-world.com/health/neurology/disorders-list.php", "passage_text": "AIDS-Neurological complications are common in HIV disease. The spectrum of neurological disorders is broad and involves the central nervous system, or CNS (brain and spinal cord) and the peripheral nervous system, or PNS (nerves outside the brain and spinal cord, and related muscle). Alexander Disease-is a slowly progressing and fatal neurodegenerative"}, {"url": "http://www.ranker.com/list/list-of-central-nervous-system-diseases-and-nerve-disorders/diseases-and-medications-info", "passage_text": "Central Nervous System diseases affect millions of Americans. Diseases of the nervous system can range from the nerve disorder that causes Tourette's to the serious CNS disease of Alzheimer's. CNS disorders can seriously affect the brain, spinal cord, and nerve endings in your body. Feel free to use this list as a starting point to make your own medical diseases flash card list."}, {"url": "http://www.wisegeek.org/what-are-the-different-types-of-nerve-disorders.htm", "passage_text": "Nerve disorders affect one or more of the body’s nervous systems and can potentially impact speech, motor skills, cognitive ability, heart function, and even breathing. In addition to the central nervous system, specific disorders can also involve the autonomic nervous system or the peripheral nervous system. Degenerative, or progressive, nerve disorders are generally the most serious and difficult to treat. They also tend to run in families. These types of disorders include Alzheimer's disease, Parkinson's disease, Huntington's disease, and multiple sclerosis."}, {"url": "http://www.mayo.edu/research/departments-divisions/department-neurology/programs/peripheral-nerve-disorders", "passage_text": "1 Sciatica is pain, tingling, or numbness produced by an irritation of the sciatic nerve. 2  Sciatica is a pain in the leg due to irritation of the sciatic nerve. 3  Sciatica most commonly occurs when a branch of the sciatic nerve is compressed at the base of the spine. 1 The most common form is peripheral neuropathy, which mainly affects the feet and legs. 2  Sciatica is pain, tingling, or numbness produced by an irritation of the sciatic nerve. 3  Sciatica is a pain in the leg due to irritation of the sciatic nerve."}]