[{"url": "http://www.almanac.com/plant/grapes", "passage_text": "Some 15-20 years ago I planted two rows of grapes (8 plts. to a row) and they took off very well. I can not remember now what routine we used a lot of compost and my 160lb. BullMastiff continued to help with that up until 15 years ago. 1 Grapes can be stored for up to six weeks in the cellar, but grapes can absorb the odors of other fruits and vegetables, so keep them separate. 2  Use cardboard boxes or crates lined with clean, dry straw. 3  Separate bunches with straw or sawdust. 4  Check often for spoilage."}, {"url": "http://www.gardenandflowers.com/info_8558652_long-grapevine-grow.html", "passage_text": "Vine Growth. Grapevines grow as quickly to maximize the amount of sunlight they can absorb, and thereby maximize the amount of food they can produce for themselves. A vine, once planted, can grow to appear quite mature inside of a single season. Thirty feet or more of vine in one year's growth is not unheard of. Just because a grapevine can fruit, however, doesn't mean it should fruit. Second-year grape clusters are grown at the expense of your vine expanding its root system, and should be snipped off early in the season to allow the vine to focus its resources on bulking up its root stock."}, {"url": "https://answers.yahoo.com/question/index?qid=20071119132142AA5N0n4", "passage_text": "Report Abuse. A lot depends on what type of grapes your growing, how old was the plant when you first planted it, how much sun does it get, the type of soil, etc. Make sure you give the plants everything they need if you want the earliest grapes. from me to you · 8 years ago. Thumbs up. 0. Thumbs down. 0."}, {"url": "http://www.ehow.com/info_8466301_long-grape-vines-produce-grapes.html", "passage_text": "Selecting a Site. Because grape vines take at least three years to begin producing fruit, planting represents a long-term commitment. Once established, with proper care grape vines can live and produce grapes for 50 to 100 years. So plant the vines in the right spot, because it disrupts their growth to move them. The first several years after grape vines are planted they do not produce fruit. During those first few years grape vine’s root structure grows and the vine develops strong and numerous branches to hold all those grapes it eventually produces. But do not expect to see any grapes until at least the third year. In addition, it takes about five to six years for grapevines to begin producing a consistent, heavy crop of grapes. But the wait is worth it -- one mature vine can produce 10 lbs. or more of fresh grapes per season. Soul/Digital Vision/Getty Images"}, {"url": "http://homeguides.sfgate.com/long-grape-vines-produce-grapes-56962.html", "passage_text": "Grapevines can grow in partial shade, but they are unlikely to produce much fruit unless they get a significant amount of sun -- up to seven or eight hours per day. This is also why neglected vines don't produce many grapes. Pruning. Pruning is one of the most important factors in grape production. Grapes develop only on new growth, which sprouts from 1-year-old wood. This is one reason why most vines don't produce grapes in their second year -- the whole plant is only 1 year old, so its main job is support instead of grapes."}, {"url": "http://homeguides.sfgate.com/long-grape-vines-produce-grapes-56962.html", "passage_text": "Most grapevines give you fruit in their third season. Your backyard grapevine can take up to three years to produce viable grapes, but that timeline is based on several environmental factors as well as how you care for the plant. Sunlight and well-drained soil are key to grape production, as is proper pruning. Pruning. Pruning is one of the most important factors in grape production. Grapes develop only on new growth, which sprouts from 1-year-old wood. This is one reason why most vines don't produce grapes in their second year -- the whole plant is only 1 year old, so its main job is support instead of grapes."}, {"url": "http://www.gardeningknowhow.com/edible/fruits/grapes/growing-grapevines.htm", "passage_text": "Climate for Growing Grapes. The right climate for growing grapevines will always entail a minimum number of days of frost-free temperatures to mature the growing grapevines. You might wonder how long does it take grapes to grow then. It takes 165 to 180 days. This period must also allow for harvesting of the fruit and the acclimation of the wood for winter. If you want to know how to plant grapes, you should know they are grown from hardwood cuttings of the grapevine. When you think about how to plant grapes, remember that the vines have a shallow root system. You have to be careful when you are weeding around the vines."}]