[{"url": "http://www.thewrap.com/the-cw-sets-premiere-dates-for-new-dramas-izombie-the-messengers/", "passage_text": "TCA 2015: Network also announces premiere for “Cedric’s Barber Battle” and return date for “Supernatural”. The CW set premiere dates for new dramas “iZombie” and “The Messengers” on Sunday. The network also announced a return date for “Supernatural,” which will now move to a new night. "}, {"url": "http://tvline.com/2015/05/07/the-messengers-cancelled-cw-season-2/", "passage_text": "The CW is shooting The Messengers. The freshman drama, which followed a group of individuals on a quest to find the Devil and prevent the Apocalypse, will not return for a second season, TVLine has learned. The Messengers premiered April 17 to 1.2 million viewers and a 0.3 rating, down a tenth from Hart of Dixie ‘s final Friday premiere and finale. TVLine readers gave the supernatural drama a C+ average. BuzzFeed was the first to report The Messengers ‘ cancellation."}, {"url": "http://tvseriesfinale.com/tv-show/the-messengers-cw-orders-supernatural-drama-32422/", "passage_text": "The CW has ordered a new supernatural drama for 2014-15 called The Messengers. Created by Eoghan O’Donnell, the show’s cast includes Craig Frank, Diogo Morgado, Joel Courtney, Jon Fletcher, Shantel VanSanten, and Sofia Black-D’Elia. THE MESSENGERS – When a mysterious object crashes down to Earth, a group of seemingly unconnected strangers dies from the energy pulse."}, {"url": "https://en.wikipedia.org/wiki/The_Messengers_(TV_series)", "passage_text": "The main characters of the series are the Messengers (real term: Angels of the Apocalypse), a group of ordinary humans chosen by God to determine if humanity is worth saving. The series was officially picked up on May 8, 2014, and premiered on April 17, 2015. The series was canceled by the CW on May 7, 2015, but aired all of its episodes, and concluded on July 24, 2015."}, {"url": "http://tvseriesfinale.com/tv-show/the-messengers-tv-show-cancelled-no-season-two-for-cw-series-36472/", "passage_text": "The Messengers has performed quite poorly so far, even for a Friday night show. Last week’s installment hit a new low with just 650,000 viewers and a 0.2 rating in the 18-49 demographic. For now, it looks like the series will stay on the air to finish out its run of 13 total episodes. Well, The CW has done just that. The network has cancelled The Messengers after one season. Only three episodes have aired thus far. On The Messengers TV show, a mysterious object plummets to Earth and explodes in a blinding flash. It sends out a shock wave that instantly connects five strangers."}, {"url": "https://en.wikipedia.org/wiki/The_Messengers_(TV_series)", "passage_text": "The Messengers is an American television series that aired on The CW during the 2014–15 season. The series was officially picked up on May 8, 2014, and premiered on April 17, 2015. The series was canceled by the CW on May 7, 2015, but aired all of its episodes, and concluded on July 24, 2015."}, {"url": "http://www.tv.com/shows/the-messengers-2015/", "passage_text": "By AlecFoth, Jul 20, 2015. I know of the CW has already cancelled the Messengers, but starting a show mid season on a Friday night is already a knife in its side, they didn't even give it a chance!. The show has actually gotten better and better each episode. By MagdaOciepka, Jul 28, 2015. To all the fans of The Messengers, if you want to try and save this show, please sign the petition and maybe we can make a difference. I shared it with my friends and I'm trying to pass it on as far as I can. Please do the same! The petition is on http:/ /www .ipetitions"}]