[{"url": "http://www.meaning-of-names.com/english-names/beryl.asp", "passage_text": "English Name Meaning-Derived from the precious stone Beryl, a gemstone of varying colors; often yellow-green. Famous references-Twentieth century British actress and comedienne Beryl Reid; The biblical eighth foundation stone of the wall of New Jerusalem was beryl."}, {"url": "http://www.sheknows.com/baby-names/name/beryl", "passage_text": "In American the meaning of the name Beryl is: Derived from the precious stone Beryl, a gemstone of varying colors; often yellow-green. Famous references-Twentieth century British actress and comedienne Beryl Reid; The biblical eighth foundation stone of the wall of New Jerusalem was beryl. Greek Meaning:"}, {"url": "http://www.thinkbabynames.com/meaning/0/Beryl", "passage_text": "Beryl /be-ryl/ [2 sylls.] as a girls' name is pronounced BEHR-el. It is of Greek origin, and the meaning of Beryl is light green semiprecious gemstone. The word is of Indian origin, from the Sanskrit term veruliya. The beryl was considered a token of good luck."}, {"url": "http://www.babynamewizard.com/baby-name/girl/beryl", "passage_text": "Origin of the name Beryl: Derived from beryl (a type of pale green gem-stone which includes emeralds and aquamarine). Beryl is derived from the Greek bēryllos (sea-green gem), which is from the Prakrit veruliya or the Davidian veluriya (from the city of Vēlūr). From A World of Baby Names by Teresa Norman."}, {"url": "http://www.sheknows.com/baby-names/name/beryl", "passage_text": "English Meaning: The name Beryl is an English baby name. In English the meaning of the name Beryl is: Derived from the precious stone Beryl, a gemstone of varying colors; often yellow-green."}, {"url": "http://www.meaning-of-names.com/english-names/beryl.asp", "passage_text": "English name. In English, the name Beryl means-Derived from the precious stone Beryl, a gemstone of varying colors; often yellow-green. Famous references-Twentieth century British actress and comedienne Beryl Reid; The biblical eighth foundation stone of the wall of New Jerusalem was beryl.."}, {"url": "http://www.sheknows.com/baby-names/name/beryl", "passage_text": "The name Beryl is a Greek baby name. In Greek the meaning of the name Beryl is: Crystal. A gemstone of varying colors; often yellow-green. In the Bible the eighth foundation stone of the wall of New Jerusalem was beryl."}]