[{"url": "http://www.dyer-consequences.com/recycling_symbol.html", "passage_text": "He sits on the board of directors of 1,000 Friends of Maryland, a managed-growth advocacy group. As you celebrate America Recycles Day each year in November, and Earth Day in April, look around and notice how many times you see the recycling symbol displayed. "}, {"url": "https://en.wikipedia.org/wiki/Recycling_symbol", "passage_text": "The universal recycling symbol (U+2672 ♲ universal recycling symbol or U+267B ♻ black universal recycling symbol in Unicode) is an internationally recognized symbol used to designate recyclable materials. It is composed of three mutually chasing arrows that form a Moebius möbius (strip an unending-single sided looped). surface "}, {"url": "http://naturalsociety.com/recycling-symbols-numbers-plastic-bottles-meaning/", "passage_text": "Plastic #4 – LDPE (Low Density Polyethylene). 1  Low density polyethylene is most found in squeezable bottles, shopping bags, clothing, carpet, frozen food, bread bags, and some food wraps. 2  This plastic is recycled into compost bins, paneling, trash can liners and cans, floor tiles, and shipping envelopes. "}, {"url": "http://www.unicode.org/L2/L2001/01146-N2342-Recycling.pdf", "passage_text": "rived symbols or logos. A recent example is shown below right. “ For more on the history of this symbol and the paper recycling symbols that were derived from it, see http://www.afandpa.org/recycling/anders.pdf Summary The set of recycling symbols investigated here has a history spanning over thirty years. "}, {"url": "https://www.plasticsmakeitpossible.com/about-plastics/faqs/professor-plastic/what-does-that-chasing-arrow-symbol-on-plastic-products-mean/", "passage_text": "Other (indicates that a package is made with a resin other than the six listed above or is made of more than one resin.). Uses of other plastic include: three-and five-gallon reusable water bottles and some citrus juice and ketchup bottles. Here’s a list of the types of plastics, common packaging products made from them and some products that may be made with recycled plastic. Uses of PET include: bottles for soft drinks, water, sports drinks, beer, mouthwash, and salad dressing, food jars for peanut butter, jelly, and pickles."}, {"url": "https://www.plasticsmakeitpossible.com/about-plastics/faqs/professor-plastic/what-does-that-chasing-arrow-symbol-on-plastic-products-mean/", "passage_text": "High Density Polyethylene (HDPE). Uses of HDPE include: bottles for milk, water, juice, cosmetics, shampoo, dish and laundry detergents, and household cleaners, containers for margarine and other foods, cereal box liners., trash and retail bags. Here’s a list of the types of plastics, common packaging products made from them and some products that may be made with recycled plastic. Uses of PET include: bottles for soft drinks, water, sports drinks, beer, mouthwash, and salad dressing, food jars for peanut butter, jelly, and pickles."}, {"url": "http://greenliving.about.com/od/recyclingwaste/tp/recycling_symbols.htm", "passage_text": "1. Recycling Symbol. This is the most common form of the symbol and is found on products like plastics, paper, metals and other material that can be recycled. It's also seen, in many different styles, on recycling containers, at recycling centers, and anywhere there's an accent on smart use of materials and products. 4. Recycled Symbol. A circle around three arrows means the product is made of recycled material; it's usually found on paper and cardboard. How much recycled material the product contains is sometimes indicated by a percentage inside the arrows."}, {"url": "http://www.clean-energy-ideas.com/recycling/overview/recycling-symbols", "passage_text": "Today there exists many different recycling symbols that are used across the globe. Although attempts to create an almost universal format for these symbols have been successful to some degree, there are still a wide variety of logos that are featured on different types of packaging. "}, {"url": "http://www.jamesrobertwatson.com/recyclesymbols.html", "passage_text": "Guidelines for recycling symbols on collection bins. Someday recycling materials will be a normal part of our everyday routine and attitude. A program of standardized graphic symbols (both shapes and colors) for use on public recycling bins will help us move towards that point more efficiently. "}]