[{"url": "http://www.thefreedictionary.com/keratotomy", "passage_text": "Noun. 1. keratotomy-surgical incision into the cornea. eye operation, eye surgery-any surgical procedure involving the eyes. radial keratotomy-radial pattern of incisions in the cornea that cause the cornea to bulge; performed to correct myopia. Translations.er·a·tot·o·my. n. pl. ker·a·tot·o·mies. Surgical incision of"}, {"url": "http://www.thefreedictionary.com/keratotomy", "passage_text": "ker·a·tot·o·my. n. pl. ker·a·tot·o·mies. Surgical incision of the cornea."}, {"url": "http://medical-dictionary.thefreedictionary.com/Keratotomy%2c+radial", "passage_text": "keratotomy. incision of the cornea. radial keratotomy an operation in which a series of incisions is made in the cornea from its outer edge toward its center in a spokelike fashion; done to flatten the cornea and thus to correct myopia. Radial keratotomy.A, Before procedure.B, Incisions are made from the center to the periphery.adial keratotomy an operation in which a series of incisions is made in the cornea from its outer edge toward its center in a spokelike fashion; done to flatten the cornea and thus to correct myopia. Radial keratotomy. "}, {"url": "https://en.wikipedia.org/wiki/Keratoconus", "passage_text": "Keratoconus (KC, KTCN) (from Greek: kerato-horn, cornea; and konos cone) is a degenerative disorder of the eye in which structural changes within the cornea cause it to thin and change to a more conical shape than the more normal gradual curve.eratoconus can cause substantial distortion of vision, with multiple images, streaking and sensitivity to light all often reported by the person. It is typically diagnosed in the person's adolescent years."}, {"url": "https://en.wikipedia.org/wiki/Radial_keratotomy", "passage_text": "Beginning in 1936, Japanese ophthalmologist Tsutomu Sato conducted research in anterior and posterior keratotomy, an early form of refractive surgery that attempted to treat keratoconus, myopia and astigmatism by making incisions in the cornea.he incisions of RK are used to relax the steep central cornea in patients with myopia. The original technique — consisting of incisions from periphery to center — was called the Russian technique, while the later advances of performing controlled incision from center to periphery was called the American Technique."}, {"url": "https://en.wikipedia.org/wiki/Radial_keratotomy", "passage_text": "A conceptually opposite technique of using hexagonal incisions in the periphery of the cornea is known has Hexagonal Keratotomy (HK, described by Antonio Mendez of Mexicali, Mexico), which was used to correct low degrees of Hyperopia.he incisions of RK are used to relax the steep central cornea in patients with myopia. The original technique — consisting of incisions from periphery to center — was called the Russian technique, while the later advances of performing controlled incision from center to periphery was called the American Technique."}, {"url": "http://www.audioenglish.org/dictionary/keratotomy.htm", "passage_text": "Surgical incision into the cornea. Classified under: Nouns denoting acts or actions. Hypernyms (keratotomy is a kind of...): incision; section; surgical incision (the cutting of or into body tissues or organs (especially by a surgeon as part of an operation)). Hyponyms (each of the following is a kind of keratotomy):"}, {"url": "https://en.wikipedia.org/wiki/Radial_keratotomy", "passage_text": "Radial keratotomy (RK) is a refractive surgical procedure to correct myopia (nearsightedness) that was developed in 1974, by Svyatoslav Fyodorov, a Russian ophthalmologist.he incisions of RK are used to relax the steep central cornea in patients with myopia. The original technique — consisting of incisions from periphery to center — was called the Russian technique, while the later advances of performing controlled incision from center to periphery was called the American Technique."}, {"url": "https://en.wikipedia.org/wiki/Radial_keratotomy", "passage_text": "The incisions of RK are used to relax the steep central cornea in patients with myopia. The original technique — consisting of incisions from periphery to center — was called the Russian technique, while the later advances of performing controlled incision from center to periphery was called the American Technique."}, {"url": "http://medical-dictionary.thefreedictionary.com/Keratotomy%2c+radial", "passage_text": "Radial keratotomy (RK) is a type of eye surgery used to correct myopia (nearsightedness). It works by changing the shape of the cornea-the transparent part of the eye that covers the iris and the pupil.adial keratotomy an operation in which a series of incisions is made in the cornea from its outer edge toward its center in a spokelike fashion; done to flatten the cornea and thus to correct myopia. Radial keratotomy. A, Before procedure. B, Incisions are made from the center to the periphery."}]