[{"url": "http://www.stylecraze.com/articles/amazing-benefits-of-bitter-melonbitter-gourd/", "passage_text": "8. Bitter melon is very good for the heart in many ways. It helps reduce the bad cholesterol levels which clog the arterial walls and thereby reduces the chances of heart attacks. Also, it is known to lower the blood sugar levels that help in maintaining a good heart health (9). These are just a couple of other names for bitter gourd, which is also known as bitter melon or bitter squash in English. The first thing that comes to my mind seeing it is the bitterness in the name. They are dark or light green in colour depending on the region where they are grown."}, {"url": "http://www.webmd.com/vitamins-supplements/ingredientmono-795-BITTER%20MELON.aspx?activeIngredientId=795&activeIngredientName=BITTER%20MELON", "passage_text": "Bitter melon is a plant. The fruit and seeds are used to make medicine. Bitter melon is used for various stomach and intestinal disorders including gastrointestinal (GI) upset, ulcers, colitis, constipation, and intestinal worms. Certain chemicals in bitter melon fruit, juice, and seeds can start menstrual bleeding and have caused abortion in animals. Not enough is known about the safety of using bitter melon during breast-feeding. Stay on the safe side and avoid use."}, {"url": "http://www.firmoo.com/answer/question/5108.html", "passage_text": "Yes, bitter gourd is good for eye health. Bitter gourd, also called bitter melon because it tastes bitter. But bitter gourd is a healthy food for our body as well as our eyes. Bitter gourd can be used for treat hypertension, eye complications, neuritis and defective metabolism of carbohydrates etc. So, taking bitter gourd properly is a healthy life style. Yes, it's beneficial for our eyes. The bitter gourd is a kind of tropical vegetable, which has precious nutrients with very low calories. It’s an excellent source of vitamin B1, B2, B3, C, Mg, folic acid and other materials. Compared with other vegetables, bitter gourd has twice beta-carotene of broccoli"}, {"url": "http://juicing-for-health.com/health-benefits-of-bitter-gourd.html", "passage_text": "The bitter melon (also known as bitter gourd) looks like a cucumber but with ugly gourd-like bumps all over it. As the name implies, this vegetable is a melon that is bitter. There are two varieties of this vegetable: One grows to about 20 cm long, is oblong and pale green in color. Clean your bitter melon under cold running water and brush with a soft vegetable brush. To prepare, slice the melon length-wise and scoop out the seeds. To lessen the bitter flavor, soak it in salt water for about half an hour before juicing/cooking."}, {"url": "http://www.stylecraze.com/articles/amazing-benefits-of-bitter-melonbitter-gourd/", "passage_text": "Heart Disease: Bitter melon is very good for the heart in many ways. It helps reduce the bad cholesterol levels which clog the arterial walls and thereby reduces the chances of heart attacks. Also, it is known to lower the blood sugar levels that help in maintaining a good heart health (9). These are just a couple of other names for bitter gourd, which is also known as bitter melon or bitter squash in English. The first thing that comes to my mind seeing it is the bitterness in the name. They are dark or light green in colour depending on the region where they are grown."}, {"url": "http://basicayurvedausa.com/index.php/bitter-gourd-karela-juice.html", "passage_text": "Bitter gourd is a vegetable that comes from tropical and subtropical vine. Bitter gourd Juice is enriched with goodness of Calcium, Potassium, Magnesium, Vitamin B1, B2, B3 and C. It is rich in iron, contains twice the beta-carotene of broccoli, twice the calcium of spinach, and twice the potassium of a banana. 480ml, 960ml."}, {"url": "http://basicayurvedausa.com/index.php/bitter-gourd-karela-juice.html", "passage_text": "Ingredients. 1  Blood Disorders: Bitter gourd juice is highly beneficial for treating blood disorders like blood boils and itching due to toxemia. 2  Diabetes Mellitus: Bitter melon juice contains plant insulin that is highly beneficial in lowering sugar levels in blood and urine. Bitter gourd Juice is enriched with goodness of Calcium, Potassium, Magnesium, Vitamin B1, B2, B3 and C. It is rich in iron, contains twice the beta-carotene of broccoli, twice the calcium of spinach, and twice the potassium of a banana. 480ml, 960ml."}, {"url": "http://basicayurvedausa.com/index.php/bitter-gourd-karela-juice.html", "passage_text": "1 Eye problems: The high beta-carotene and other properties in bitter gourd juice makes it one of the finest vegetable-fruit that help alleviate eye problems and improving eyesight. 2  Immune booster: This bitter juice can also help to build your immune system and increase your body's resistance against infection. Bitter gourd Juice is enriched with goodness of Calcium, Potassium, Magnesium, Vitamin B1, B2, B3 and C. It is rich in iron, contains twice the beta-carotene of broccoli, twice the calcium of spinach, and twice the potassium of a banana. 480ml, 960ml."}, {"url": "http://www.diabetes.co.uk/natural-therapies/bitter-melon.html", "passage_text": "Bitter melon, also known as bitter gourd or karela (in India), is a unique vegetable-fruit that can be used as food or medicine. It is the edible part of the plant Momordica Charantia, which is a vine of the Cucurbitaceae family and is considered the most bitter among all fruits and vegetables. "}]