[{"url": "http://ths.sps.lane.edu/biomes/marine4/marine4.html", "passage_text": "Along each shore a group of highly adapted plants and animals, many of them strange to our land, make their homes. ANIMALS. Tropical Fish. There are many types of life in the oceans and other marine biomes. Some major animals are sharks, fish, and whales. There are many individual species in each of the categories. Such as blue whales, salmon, and great white sharks. "}, {"url": "http://www.bioexpedition.com/freshwater-biome/", "passage_text": "Freshwater Biome Flora and Fauna. There is no shortage of animals or plants living in a freshwater biome. It is believed that more than 700 species of fish, 1,200 species of amphibians, mollusks, and insects all live in these areas. Many of them are very tiny so they may seem unimportant or be easy to miss"}, {"url": "http://www.bioexpedition.com/freshwater-biome/", "passage_text": "There are plenty of great animals that live in the water of the freshwater biome. They include frogs, crab, shrimp, turtles, and tadpoles. Some of them live both in the water and on the land around it including the beaver. The otter may be found living here as well. There is no shortage of animals or plants living in a freshwater biome. It is believed that more than 700 species of fish, 1,200 species of amphibians, mollusks, and insects all live in these areas. Many of them are very tiny so they may seem unimportant or be easy to miss"}, {"url": "http://gen.uga.edu/documents/biodiversity/activities/Biomes%20who%20what%20lives.pdf", "passage_text": "The major biomes include: Rainforest, Tundra, Taiga, Deciduous Temperate forest, Desert, Chaparral, Grassland, Freshwater, and Marine. The plant and animal species that live in each biome have special adaptations that help them survive the conditions of that biome. Many species are endemic to certain biomes, meaning they only exist in that biome and nowhere else. Some species are able to adapt to a wider variety of climatic and geographic influences. Plants and microorganisms grow and reproduce during the short summers when the soil thaws for a brief time. The types of plants that can survive here include shrubs, sedges, mosses, lichens, grasses, and some flowering or herbaceous plants. There are only 48 known species of land mammals that live in the tundra biome."}, {"url": "http://www.ducksters.com/science/ecosystems/marine_biome.php", "passage_text": "There are two major aquatic or water biomes, the marine biome and the freshwater biome. The marine biome is primarily made up of the saltwater oceans. It is the largest biome on planet Earth and covers around 70% of the Earth's surface. Go here to learn more about the world's different oceans. "}, {"url": "http://kids.nceas.ucsb.edu/biomes/marine.html", "passage_text": "LOCATION: The marine biome is the biggest biome in the world! It covers about 70% of the earth. It includes five main oceans: the Pacific, Atlantic, Indian, Arctic, and Southern, as well as many smaller Gulfs and Bays. Marine regions are usually very salty! Marine plants live in the euphotic zone of the ocean because they need energy from the sun for photosynthesis. ANIMALS: The Earth's oceans are home to most of the planet’s biodiversity. Here we can find mollusks, fish, whales, crustaceans, bacteria, fungi, sea anemones and many other animals."}, {"url": "http://ths.sps.lane.edu/biomes/marine3/marine3.html", "passage_text": "ANIMALS. ANIMALS. The marine biome covers three fourths of the earth and there are hundreds of different fish to cover each square foot of it. The main kinds of animals in the sea are whales, dolphins, sharks, and seals which are some of the most popular kinds of sea mammals. Other kinds of animals and fish that live in the sea are the walrus, star fish, eel, crabs, jelly fish, and fresh and salt water fish, but this is just a small list compared to the many different kinds of fish that inhabit the marine biome. In general these fish have about five different adaptations."}]