[{"url": "http://www.physicsclassroom.com/Class/momentum/u4l1a.cfm", "passage_text": "In physics, the symbol for the quantity momentum is the lower case p. Thus, the above equation can be rewritten as. where m is the mass and v is the velocity. The equation illustrates that momentum is directly proportional to an object's mass and directly proportional to the object's velocity."}, {"url": "http://hyperphysics.phy-astr.gsu.edu/hbase/Impulse.html", "passage_text": "The product of average force and the time it is exerted is called the impulse of force. From Newton's second law. the impulse of force can be extracted and found to be equal to the change in momentum of an object provided the mass is constant:"}, {"url": "https://en.wikipedia.org/wiki/Impulse_(physics)", "passage_text": "In classical mechanics, impulse (symbolized by J or Imp) is the integral of a force, F, over the time interval, t, for which it acts. Since force is a vector quantity, impulse is also a vector in the same direction."}, {"url": "http://physics.about.com/od/glossary/g/Impulse.htm", "passage_text": "Impulse is defined as a force multiplied by the amount of time it acts over. In calculus terms, the impulse can be calculated as the integral of force with respect to time. Alternately, impulse can be calculated as the difference in momentum between two given instances."}, {"url": "http://www.physicsclassroom.com/Class/momentum/u4l1a.cfm", "passage_text": "In terms of an equation, the momentum of an object is equal to the mass of the object times the velocity of the object. Momentum = mass • velocity In physics, the symbol for the quantity momentum is the lower case p. Thus, the above equation can be rewritten as p = m • v where m is the mass and v is the velocity."}, {"url": "http://www.physics247.com/physics-homework-help/impulse.php", "passage_text": "Impulse-Momentum Theorem. Impulse is the change in momentum of an object, and is a vector quantity: j = δ p. Momentum is the product of the mass and the velocity of an object, and is a vector quantity: p = m v. Since in daily life we do not notice an object's mass change just because its velocity changes, change in momentum is given by:"}, {"url": "http://www.dummies.com/how-to/content/what-is-impulse-in-physics.html", "passage_text": "When you apply a force for a certain amount of time, you create an impulse. In fact, that's the definition of impulse — impulse equals the force applied multiplied by the time it was applied. Here's the equation: Note that this is a vector equation because the force has a direction; therefore the impulse does as well."}, {"url": "http://physics.info/momentum/summary.shtml", "passage_text": "1 is a vector quantity (since force is a vector and time is a scalar). 2  uses the SI unit newton second [N s]. 3  impulse-momentum theorem. 4  The impulse-momentum theorem states that the change in momentum of an object equals the impulse applied to it."}]