[{"url": "http://www.answers.com/Q/What_is_knee_hyperextension", "passage_text": "Knee hyper extension is when your knee extends more behind your than it's suppose (a flamingo bending its leg is an example)without locking. This is caused by weak hamstring muscles and quadriceps muscles that hold the knee in place. Symptoms can vary and are related to those of knee tendinitis. Shoulder hyperextension injury occurs when the glenohumeral joint is hyperextended past it's normal end-range extension barrier. This action can stress or even tear the … anterior joint capsule and surrounding ligaments."}, {"url": "http://www.innerbody.com/image/skel16.html", "passage_text": "Many strong ligaments surround the joint capsule of the knee to reinforce its structure and hold its bones in the proper alignment. On the anterior surface of the knee, the patella is held in place by the patellar ligament, which extends from the inferior border of the patella to the tibial tuberosity of the tibia. Posteriorly, the oblique popliteal ligament and arcuate popliteal ligament join the femur to the tibia and fibula of the lower leg."}, {"url": "http://www.ncbi.nlm.nih.gov/pubmed/1947532", "passage_text": "Its main function is to prevent the posterior dislocation of the tibia in relation to the femur, providing 95% of the strength to resist the tibial posterior displacement. Along with the anterior cruciate ligament (ACL) the PCL controls the passive 'screw home' mechanism of the knee in terminal knee extension. This is due to gravity-assisted posterior displacement of the tibia in relation to the femur. A positive posterior drawer test performed at 90 degrees of flexion and a knee hyperextension sign are sensitive but nonspecific tests. False negative findings are frequent, especially in acute cases."}, {"url": "http://www.answers.com/Q/What_structure_in_the_knee_prevents_hyperextension", "passage_text": "http://danpine.com/77/prevent-shin-splints-with-this-strange-exercise/ To recover from shin splints, the athlete should rest and apply ice to the affected area of the shin in 20-30 minute segments as often as possible. To prevent shin splints from reoccurring, or to prevent them from ever occurring in the first place, one should engage in an exercise program that targets strengthening the tibialis anterior directly. This short video shows a simple exercise that is very effective in preventing shin splints."}, {"url": "http://www.sk8strong.com/articles/article/6311334/177681.htm", "passage_text": "It attaches the tibia to the femur bone, and in conjunction with the hamstring muscle, prevents hyperextension of the knee. The posterior cruciate, which is not commonly injured, connects the same two bones and prevents hyperflexion of the knee joint. The second joint of the knee is the patellofemoral joint (see figure# 3). The patella is a small, odd shaped bone the sits on top of the femur. With flexion and extension of the knee, it glides in a groove that is located on top of the femur and tibia."}, {"url": "http://www.answers.com/Q/What_structure_in_the_knee_prevents_hyperextension", "passage_text": "Knee hyper extension is when your knee extends more behind your than it's suppose (a flamingo bending its leg is an example)without locking. This is caused by weak ham … string muscles and quadriceps muscles that hold the knee in place. Symptoms can vary and are related to those of knee tendinitis. To prevent shin splints from reoccurring, or to prevent them from ever occurring in the first place, one should engage in an exercise program that targets strengthening the tibialis anterior directly. This short video shows a simple exercise that is very effective in preventing shin splints."}, {"url": "http://www.answers.com/Q/What_structure_in_the_knee_prevents_hyperextension", "passage_text": "Shoulder hyperextension injury occurs when the glenohumeral joint is hyperextended past it's normal end-range extension barrier. This action can stress or even tear the … anterior joint capsule and surrounding ligaments. To prevent shin splints from reoccurring, or to prevent them from ever occurring in the first place, one should engage in an exercise program that targets strengthening the tibialis anterior directly. This short video shows a simple exercise that is very effective in preventing shin splints."}, {"url": "http://www.innerbody.com/image/skel16.html", "passage_text": "The knee joint is one of the strongest and most important joints in the human body. On the anterior surface of the knee, the patella is held in place by the patellar ligament, which extends from the inferior border of the patella to the tibial tuberosity of the tibia. Posteriorly, the oblique popliteal ligament and arcuate popliteal ligament join the femur to the tibia and fibula of the lower leg."}, {"url": "http://www.yogajournal.com/article/practice-section/the-hyperextended-knee/", "passage_text": "There are also several large tendons that cross the back of the knee and normally help prevent hyperextension: the hamstring tendons coming down from the back of the thigh and the gastrocnemius tendons coming up from the calf. But in many joints, ligaments and tendons play a major role in preventing excessive motion; if those tissues become too loose, the joint can move in ways that cause damage or set the stage for injury. A joint with such laxity is said to be hypermobile, and the knee is particularly vulnerable to this problem."}, {"url": "http://sinewtherapeutics.com/elbow-hyperextension-injury-information.html", "passage_text": "Elbow hyperextension injuries are common causes of injuries to the ligaments, cartilage, tendons, and other stabilizing structures within the elbow. The hyperextension places a sudden and forceful stress on the tendons, ligaments, cartilage, and muscles (soft tissue surrounding the elbow). If the force of the hyperextension is stronger than the structure, it may cause inflammation and/or stretching or tearing (sprains and strains)."}]