[{"url": "http://www.nordnorge.com/?id=178726952&News=52", "passage_text": "Today, Struve’s Geodetic Arc spans ten countries: Norway, Sweden, Finland, Russia, Estonia, Latvia, Lithuania, Belarus, Moldova and Ukraine. The meridian column on Fuglenes in Hammerfest is a modest monument to one of the biggest scientific tasks in the world: that of measuring the planet itself. It marks the start of a 2820 km arc that ends in the Black Sea."}, {"url": "http://whc.unesco.org/en/list/1187", "passage_text": "Struve Geodetic Arc. The Struve Arc is a chain of survey triangulations stretching from Hammerfest in Norway to the Black Sea, through 10 countries and over 2,820 km. All components of the Struve Geodetic Arc are linked to one chain and a number of the Arc sites belong to national state geodetic reference networks that confer integrity even with the geodetic measurements processed today."}, {"url": "http://wikitravel.org/en/Struve_Geodetic_Arc", "passage_text": "This article is an itinerary. The northernmost station of the Struve Geodetic Arc is located in Fuglenes, Norway. Struve Geodetic Arc is a UNESCO World Heritage Site in Norway, Sweden, Finland, Russia, Estonia, Latvia, Lithuania, Belarus, Moldova and Ukraine. The listed site includes 34 of the original station points, with different markings, i.e. a drilled hole in rock, an iron cross, cairns, or built obelisks. Many of the inscribed sites are small posts in fields and may not reward a visit. However the focal point of the arc is the Dorpat Observatory in Tartu, Estonia."}, {"url": "http://www.ukraine.com/sights/struve-geodetic-arc/", "passage_text": "Struve Geodetic Arc-Calculating the Size of the Earth. It is a concept that started in the year 1816 and was carried out by an astronomer by the name of Friedrich Georg Wilhelm von Struve. During the time of Struve’s existence, the distance between two points was measured by measuring poles. However in order to accomplish the goal that Friedrich von Struve had envisioned-calculating the size of the earth-measuring poles would not be sufficient. To do this a more sophisticated tool would be needed."}, {"url": "http://whc.unesco.org/en/list/1187", "passage_text": "Protection and management requirements. For the inscription of the Struve Geodetic Arc, the ten countries involved collaborated in locating and investigating the sites of historical measurements by using available geodetic observation data and by means of the recent measurement methods as well as satellite geodesy. All components of the Struve Geodetic Arc are linked to one chain and a number of the Arc sites belong to national state geodetic reference networks that confer integrity even with the geodetic measurements processed today."}, {"url": "https://en.wikipedia.org/wiki/Struve_Geodetic_Arc", "passage_text": "At that time, the chain passed merely through two countries: Union of Sweden-Norway and the Russian Empire. The Arc's first point is located in Tartu Observatory in Estonia, where Struve conducted much of his research. The new flattening estimate was one part in 298.257 222 101 and the equatorial radius was 6,378,136.8 metres. An earlier survey, in 1740, had given flattening at one part in 178 and an equatorial radius of 6,396,800 metres."}, {"url": "https://en.wikipedia.org/wiki/Struve_Geodetic_Arc", "passage_text": "The Struve Geodetic Arc is a chain of survey triangulations stretching from Hammerfest in Norway to the Black Sea, through ten countries and over 2,820 km, which yielded the first accurate measurement of a meridian. The new flattening estimate was one part in 298.257 222 101 and the equatorial radius was 6,378,136.8 metres. An earlier survey, in 1740, had given flattening at one part in 178 and an equatorial radius of 6,396,800 metres."}, {"url": "https://simple.wikipedia.org/wiki/Struve_Geodetic_Arc", "passage_text": "The Struve Geodetic Arc is a chain of survey triangulations that go from Hammerfest in Norway to the Black Sea. They go through ten countries and over 2,820 km. It made the first accurate measurement of a meridian. He did this to find the exact size and shape of the earth. At that time, the chain passed through two countries: Union of Sweden-Norway and the Russian Empire. The Arc's first point is in Tartu Observatory. This is where Struve did much of his research. In 2005, the chain was added on the World Heritage List"}, {"url": "http://wikitravel.org/en/Struve_Geodetic_Arc", "passage_text": "The Struve Arc is a chain of survey triangulations stretching from Hammerfest in Norway to the Black Sea, through ten countries and over 2,820km. The listed site includes 34 of the original station points, with different markings, i.e. a drilled hole in rock, an iron cross, cairns, or built obelisks. Many of the inscribed sites are small posts in fields and may not reward a visit. However the focal point of the arc is the Dorpat Observatory in Tartu, Estonia."}]