[{"url": "http://www.myeyes.com/vitamins-for-eyes.shtml", "passage_text": "In general, eye doctors recommend eating plenty of fruits and vegetables that are rich in color. Orange, yellow, red and dark green fruits and vegetables are particularly likely to contain the vitamins good for eye health."}, {"url": "http://coopervision.com/eye-health-and-vision/eye-vitamins-vision", "passage_text": "Carrots contain lots of beta carotene and Vitamin A, which can contribute to your eyes’ health and may provide a fantastic source of eye vitamins for macular degeneration and cataracts. Good sources of Vitamin A and rhodopsin are also abundant in carrots."}, {"url": "http://www.allaboutvision.com/nutrition/", "passage_text": "How to Choose Vision Supplements Learn which vitamins are important to eye health and what to look for when choosing vision supplements. How Diet and Nutrition Protect Aging Eyes Learn which foods and vitamin supplements are the best for maintaining eye health in older people. Lutein and Zeaxanthin Lutein and zeaxanthin are antioxidants found in many vegetables. Read about their effect on the eyes, with information on the best sources (and possible side effects of consuming too much). News About Eye Nutrition Latest news on vitamins and minerals that are good for your vision and eye health. Omega-3 Essential Fatty Acids: Eye Benefits Omega-3 fatty acids are important for keeping your eyes and your heart healthy. Learn the eye benefits of omega-3 fatty acids and the best omega-3 foods to include in your diet."}, {"url": "http://coopervision.com/eye-health-and-vision/eye-vitamins-vision", "passage_text": "Vitamin C for eyes. Vitamin C is a health powerhouse. You can find it in fruits like oranges, kiwi, and strawberries, as well as vegetables like broccoli, mustard greens, and peppers. In addition to providing antioxidants, it can also help slow cataracts and provide needed eye vitamins for macular degeneration."}, {"url": "https://www.sharecare.com/health/vitamins-supplements/what-vitamins-good-eye-health", "passage_text": "Studies show vitamins A, E, zinc and the phytochemicals lutein and zeaxanthin can help maintain the health of your eyes and possibly prevent cataracts. Good sources of vitamin A include sweet potatoes, carrots, fortified milk and dark, leafy greens. For tasty sources of vitamin E, try spinach, vegetable oils and nuts, including almonds, hazelnuts, pecans and sunflower seeds. Lutein and zeaxanthin are found in egg yolks and dark green vegetables."}]