[{"url": "http://www.simplyrecipes.com/recipes/dads_stuffed_bell_peppers/", "passage_text": "3 Drizzle remaining 1 tablespoon of olive oil inside the peppers. Arrange the cut side of the peppers up in a baking dish, then stuff peppers with filling. Combine ketchup, Worcestershire sauce, Tabasco sauce, and 1/4 cup of water in a small bowl, then spoon over filling. Add 1/4 cup of water to the baking dish. Place in oven and bake for 40-50 minutes (or longer, depending on how big the peppers are that you are stuffing), until the internal temperature of the stuffed peppers is 150-160°F."}, {"url": "http://southernfood.about.com/od/stuffedpepperrecipes/r/bl30220q.htm", "passage_text": "Stuff peppers with meat mixture and place in a 3-quart baking dish. Pour remaining tomato mixture over the stuffed peppers. Bake for 55 to 65 minutes. Optional: Top stuffed peppers with a little shredded Cheddar cheese just before they are done; bake until cheese is melted."}, {"url": "http://southernfood.about.com/od/stuffedpepperrecipes/r/bl30220q.htm", "passage_text": "Heat olive oil and butter in a large skillet over medium heat until hot. Saute sauté chopped bell (pepper from), tops chopped, onion and chopped celery for about 5, minutes or until vegetables are. Tender add, tomatoes tomato, sauce crushed, garlic, oregano, basil 1 teaspoon, salt and/1 4 teaspoon of. pepper"}, {"url": "http://southernfood.about.com/od/stuffedpepperrecipes/r/bl30220q.htm", "passage_text": "In a large mixing bowl, combine the egg with the remaining 1 teaspoon of salt, 1/4 teaspoon of pepper, and Worcestershire sauce. Gently stir to blend; add ground beef, cooked rice, and 1 cup of the tomato mixture. Mix well."}, {"url": "http://www.foodnetwork.com/recipes/emeril-lagasse/mr-johns-meat-stuffed-bell-peppers-recipe.html", "passage_text": "In a large saute pan or skillet, heat the oil over medium-high heat. Add the onions and chopped bell peppers and cook, stirring, until soft, about 3 minutes. Add the beef, pork, garlic, parsley, salt, black pepper, and pepper flakes."}, {"url": "http://www.food.com/recipe/ground-beef-stuffed-green-bell-peppers-with-cheese-1356", "passage_text": "1 Chop enough of the tops to make 1/4 cup, set aside. 2  Cook the whole green peppers, uncovered in boiling water for about 5 minutes; invert to drain well. 3  Sprinkle insides of peppers lightly with salt. 4  In a skillet cook ground beef, onion and 1/4 cup chopped pepper till meat is browned and vegetables are tender."}, {"url": "http://www.foodnetwork.com/recipes/emeril-lagasse/mr-johns-meat-stuffed-bell-peppers-recipe.html", "passage_text": "Pour enough water into a baking dish to just cover the bottom, about 1/8-inch deep. Stuff the bell peppers with the rice mixture and place in the baking dish. Bake until the peppers are very tender and the filling is heated through, 25 to 30 minutes. Remove from the oven and let rest for 10 minutes before serving."}]