[{"url": "http://www.spirehealthcare.com/our-treatments/body-map-and-a-z/a-z-treatments/contrast-echocardiogram/", "passage_text": "Contrast echocardiogram. A contrast echocardiogram (or intravenous contrast-enhanced ultrasound) is a type of cardiac ultrasound scan or cardiac echo. It is a specialised ultrasound scan of the heart where you first receive an injection of a special dye to help reveal more information during the scan. A contrast echocardiogram (or intravenous contrast-enhanced ultrasound) is a type of cardiac ultrasound scan or cardiac echo"}, {"url": "https://en.wikipedia.org/wiki/Contrast-enhanced_ultrasound", "passage_text": "Contrast-enhanced ultrasound (CEUS) is the application of ultrasound contrast medium to traditional medical sonography. Ultrasound contrast agents rely on the different ways in which sound waves are reflected from interfaces between substances. This may be the surface of a small air bubble or a more complex structure. Contrast-enhanced ultrasound can be used to image blood perfusion in organs, measure blood flow rate in the heart and other organs, and for other applications."}, {"url": "http://www.wisegeek.com/what-is-contrast-echocardiography.htm", "passage_text": "Adorable animal families that will make you aww. Contrast echocardiography is a type of echocardiogram, which is a cardiac ultrasound and can also be called an echo. By adding a contrast, a cardiac echo has better resolution. The additional, clearer resolution allows doctors to watch blood flow through the heart. An echocardiogram is typically performed by an ultrasound technician. Doctors use contrast echocardiography to diagnose a variety of heart issues. An echocardiogram is a specialized type of ultrasound that only documents the cardiac system. View slideshow of images above."}, {"url": "https://www.sharecare.com/health/cardiovascular-diagnostic-tests/what-is-echocardiogram-with-contrast", "passage_text": "An ultrasound of the heart is called an echocardiogram.. It is done to get pictures of the heart and the areas around the heart. Better pictures are sometimes seen if a material called contrast is used during the ultrasound. The contrast can sometimes help see the different parts of the heart in more detail."}, {"url": "http://www.womens-health-advice.com/heart-disease/echocardiogram.html", "passage_text": "Most physicians feel that contrast echocardiograms can be performed, when required, quite safely. An echocardiogram is also referred to as an echo or echocardiography. Echocardiography uses ultrasound high-frequency sound waves to produce detailed images of the heart."}, {"url": "http://www.heartforlife.co.uk/Heart-Tests/Contrast-echocardiogram/", "passage_text": "A contrast echocardiogram is an ultrasound investigation of the heart. Sound waves are reflected of structures in the heart generating a 2D and 3D picture of the heart. A contrast agent (such as Sonovue® or agitated saline / salty water) is injected into the blood stream to make the pictures clearer."}, {"url": "http://www.womens-health-advice.com/heart-disease/echocardiogram.html", "passage_text": "This is an echocardiogram which involves the use of a contrast agent to help doctors evaluate blood flow and the heart cavity. The most common type of contrast echo is referred to as a bubble echocardiogram or bubble study. It is often used to evaluate patients who have had a stroke (see stroke in women) and checks communications between the left and right side of the heart. An echocardiogram is also referred to as an echo or echocardiography. Echocardiography uses ultrasound high-frequency sound waves to produce detailed images"}]