[{"url": "http://www.history.com/topics/grand-canyon", "passage_text": "Introduction. Located in northern Arizona, the Grand Canyon is known throughout the world for its size and colorful landscape. Measuring over 270 miles long, up to 18 miles wide and a mile deep, the canyon’s walls contain rock layers that reveal a timeline of Earth’s history. "}, {"url": "http://grand-canyon-park.org/general-information/", "passage_text": "Grand Canyon Information. The Grand Canyon, located in the state of Arizona, is considered by some to be one of the seven wonders of the world, due to its sensational decorative colors and majestic natural beauty. It measures 18 miles wide (29 km), 277 miles (446 km) long, and a mile (1.6 km) deep. "}, {"url": "http://grandcanyon.com/", "passage_text": "The hotels at the Grand Canyon are located just 7 miles from the South Rim in Tusayan, Arizona. These hotels have pools and restaurants you won't find in the Grand Canyon Lodges. Each Grand Canyon hotel is just yards from Big E's restaurant and dinner show and the Grand Canyon IMAX theater. It is located at Grand Canyon West on the Hualapai Nation. Most visitor's will approach the Grand Canyon Skywalk from Las Vegas, Nevada and Kingman, Arizona as it is at the western reaches of the Canyon. Learn more about the Grand Canyon Skywalk at Grand Canyon West."}, {"url": "http://www.livescience.com/27489-grand-canyon.html", "passage_text": "The Grand Canyon is indeed a very big hole in the ground. It is 277 miles (446 km) long, up to 18 miles (29 km) wide and more than a mile (6,000 feet / 1,800 meters) deep. It is the result of constant erosion by the Colorado River over millions of years. One popular attraction is the Grand Canyon Skywalk, a horseshoe-shaped glass walkway that is 4,000 feet (1,220 meters) above the canyon floor in the Grand Canyon West area of the main canyon. Since opening in March 2007, about 300,000 visitors have walked the Grand Canyon Skywalk each year."}, {"url": "http://www.forstgov.com/where-is-the-grand-canyon-located.html", "passage_text": "Cities Near Grand Canyon National Park. The nearest cities to the Grand Canyon South Rim are Tusayan, Williams and Flagstaff. Tusayan which is around 2 miles south of the main southern entrance to the Grand Canyon and about 7 miles from the Grand Canyon Village. Williams which is an Arizona city of around 3,000 people and is located about 60 miles south of the Grand Canyon. Page Arizona is a town of around 6,000 people and is located about 120 miles Northeast of the Grand Canyon North Rim. Kanab, Utah has a population of almost 4,000 and is located 80 miles Northwest of the Grand Canyon National Park North Rim. ©2008-Current All Rights Reserved."}, {"url": "https://en.wikipedia.org/wiki/Grand_Canyon_National_Park", "passage_text": "The park's central feature is the Grand Canyon, a gorge of the Colorado River, which is often considered one of the Seven Natural Wonders of the World. The park covers 1,217,262 acres (1,901.972 sq mi; 492,608 ha; 4,926.08 km 2) of unincorporated area in Coconino and Mohave counties. Grand Canyon National Park was named as an official national park in 1919, but the landmark had been well known to Americans for over thirty years prior. In 1903, President Theodore Roosevelt visited the site and said: The Grand Canyon fills me with awe."}, {"url": "http://www.livescience.com/27489-grand-canyon.html", "passage_text": "The Grand Canyon is divided into the North Rim and the South Rim. The South Rim is open all year and receives 90 percent of the park’s visitors. The South Rim has an airport and rail service and is also close to many transportation hubs and the Arizona cities of William and Flagstaff, as well as Las Vegas, Nev. One popular attraction is the Grand Canyon Skywalk, a horseshoe-shaped glass walkway that is 4,000 feet (1,220 meters) above the canyon floor in the Grand Canyon West area of the main canyon. Since opening in March 2007, about 300,000 visitors have walked the Grand Canyon Skywalk each year."}, {"url": "http://www.sciencekids.co.nz/sciencefacts/earth/grandcanyon.html", "passage_text": "Learn where the Grand Canyon is located, how long it is, why it is an important site for geologists, how many visitors it has each year, how deep it is, when it became a national park and much more. The Grand Canyon is found in the US state of Arizona. Many people consider it to be one of the seven wonders of the natural world. The Grand Canyon is 277 miles (446 kilometres) in length. At its widest point the Grand Canyon stretches 18 miles (29 kilometres) across. At its narrowest point it stretches 4 miles (6.4 kilometres) across. The Grand Canyon is around 6000 (1800 metres) feet deep. The Colorado River runs through the Grand Canyon, it has been eroding its steep sides for millions of years."}, {"url": "http://www.wisegeek.com/what-is-the-grand-canyon.htm", "passage_text": "The Grand Canyon is one of the largest gorges in the world, carved over billions of years by the Colorado River in a picturesque part of Arizona. At 277 miles (466 km) long, and as much as 18 miles (29 km) wide, the Grand Canyon is one of the most impressive landforms found anywhere. The Grand Canyon is a short drive from Las Vegas. Cougars roam the Grand Canyon. It took billions of years for the Colorado River to carve out the Grand Canyon. The Grand Canyon is in Arizona, which is located in the American West. Whitewater rafting is available a"}, {"url": "http://www.livescience.com/27489-grand-canyon.html", "passage_text": "The Grand Canyon is in the northwest corner of Arizona, close to the borders of Utah and Nevada. Most of the Grand Canyon lies within Grand Canyon National Park and is managed by the National Park Service, the Hualapai Tribal Nation and the Havasupai Tribe. One popular attraction is the Grand Canyon Skywalk, a horseshoe-shaped glass walkway that is 4,000 feet (1,220 meters) above the canyon floor in the Grand Canyon West area of the main canyon. Since opening in March 2007, about 300,000 visitors have walked the Grand Canyon Skywalk each year."}]