[{"url": "http://www.herbwisdom.com/herb-psyllium-husk.html", "passage_text": "Psyllium seed husks, also known as ispaghula, isabgol, or psyllium, are portions of the seeds of the plant Plantago ovata, (genus Plantago), a native of India and Pakistan. Psyllium is used in weight control and for general intestinal health. Psyllium is quickly becoming one of the top recommendations for people using low-carb Atkins-style diets. It is very difficult to get enough fibre in a diet when you eliminate the carbohydrates in cereals, whole grains and fruits."}, {"url": "https://glutenfreegirl.com/2012/07/what-is-psyllium-husk/", "passage_text": "Just a few notes for you. Psyllium is sold as whole psyllium husks and psyllium powder. In my experience, the whole husks are the most effective. However, if you only have access to psyllium powder, then use that in equal volume as the husks in the recipe. You don’t need psyllium for all gluten-free baked goods. "}, {"url": "http://healthyeating.sfgate.com/psyllium-fiber-good-for-4031.html", "passage_text": "You can increase your psyllium intake by consuming psyllium-enriched cereal. The Plantago ovata plant is a shrub-like herb that is native to India. Each plant produces thousands of tiny seeds covered with a fiber-rich husk. These husks are the source of psyllium, a soluble fiber harvested from the husks that is the main ingredient in several commercial, bulk-forming laxatives. Psyllium fiber has additional benefits that may contribute to your overall health and help you avoid potentially serious chronic diseases. The soluble fiber in psyllium forms a gel when mixed with fluid."}, {"url": "https://en.wikipedia.org/wiki/Psyllium_seed_husks", "passage_text": "Psyllium seed husks, also known as ispaghula, isabgol, or psyllium, are portions of the seeds of the plant Plantago ovata, (genus Plantago), a native of India, Bangladesh and Pakistan. They are hygroscopic, which allows them to expand and become mucilaginous. "}, {"url": "http://umm.edu/health/medical/altmed/supplement/psyllium", "passage_text": "Overview. Psyllium is a soluble fiber used primarily as a gentle bulk-forming laxative in products such as Metamucil. It comes from a shrub-like herb called Plantago ovata that grows worldwide but is most common in India. Each plant can produce up to 15,000 tiny, gel-coated seeds, from which psyllium husk is derived. If you are not used to taking psyllium, it is best to begin with a low dose (such as 1/2 tsp. in an 8 oz. glass of water once a day), then increase to 2 tsp. in 2, 8 oz. glasses of water per day, as needed. Your health care provider may recommend higher doses of psyllium to treat certain conditions."}, {"url": "http://www.medicalhealthguide.com/herb/psyllium.htm", "passage_text": "Psyllium husks are hygroscopic, capable of absorbing fluids primarily used as bulk forming laxative and a good source of dietary fiber and used commercially to produce mucilage. Psyllium husk is an effective herb used to lose weight and in maintaining general intestinal health. What is Psyllium. Psyllium husks also simply called psyllium are parts of the seeds of the plant Plantago ovata of the genus Plantago which native to India but can be found elsewhere."}, {"url": "http://www.konsyl.com/what-is-psyllium-s/1833.htm", "passage_text": "Psyllium fiber comes from the outer coating, or husk of the psyllium plant's seeds. It is not wheat, and is therefore gluten free. The psyllium husk is a natural source of soluble fiber, similar to fiber found in grains such as oats and barley. *The amount of soluble fiber in psyllium is nearly 5X higher than that of oat bran. 100 grams of psyllium = 50 grams of soluble fiber. 100 grams of oat bran = 5 grams of soluble fiber"}, {"url": "http://www.everydayhealth.com/drugs/psyllium", "passage_text": "Metamucil is a bulk-forming fiber that is used to treat constipation and may also reduce cholesterol when taken every day. The generic name for this fiber is psyllium. The fiber absorbs liquid in the intestines and swells and forms a bulky stool, which is easy to pass. The active ingredients are the seed husks of the psyllium plant. The Metamucil brand has been in existence since 1934. "}, {"url": "http://www.healthline.com/health/psyllium-health-benefits", "passage_text": "Psyllium is a form of fiber made from the Plantago ovata plant, specifically from the husks of the plant’s seed. It sometimes goes by the name ispaghula. It’s most commonly known as a laxative. Psyllium provides more benefits to your body than decreasing the amount of time you spend in the bathroom. "}, {"url": "http://umm.edu/health/medical/altmed/supplement/psyllium", "passage_text": "The soluble fiber found in psyllium husks can help lower cholesterol. Psyllium can help relieve both constipation and diarrhea, and is used to treat irritable bowel syndrome, hemorrhoids, and other intestinal problems. Psyllium has also been used to help regulate blood sugar levels in people with diabetes. If you are not used to taking psyllium, it is best to begin with a low dose (such as 1/2 tsp. in an 8 oz. glass of water once a day), then increase to 2 tsp. in 2, 8 oz. glasses of water per day, as needed. Your health care provider may recommend higher doses of psyllium to treat certain conditions."}]