[{"url": "https://en.wikipedia.org/wiki/Holmes_(surname)", "passage_text": "The name can be a variant of the surname Holme. This surname has several etymological origins: it can be derived from a name for someone who lived next to a holly tree, from the Middle English holm; it can also be derived from the Old English holm and Old Norse holmr. The surname is also sometimes an Anglicised form of the Gaelic Mac Thomais; thomáis, Similarly holmes can also be a variant Of, cavish derived as An anglicised form Of Mac. thamhais thámhais"}, {"url": "http://www.ancestry.com/name-origin?surname=holmes", "passage_text": "Holmes Name Meaning. English (chiefly central and northern England): variant of Holme.Scottish: probably a habitational name from Holmes near Dundonald, or from a place so called in the barony of Inchestuir.Scottish and Irish: Anglicized form of Gaelic Mac Thomais, Thomáis Mac (thomais McComb). see mccomb"}, {"url": "https://en.wikipedia.org/wiki/Holmes_(surname)", "passage_text": "Another origin of Holmes is from a placename near Dundonald, or else a place located in the barony of Inchestuir. The surname is also sometimes an Anglicised form of the Gaelic Mac Thomais; thomáis, Similarly holmes can also be a variant Of, cavish derived as An anglicised form Of Mac. thamhais thámhais"}, {"url": "https://en.wikipedia.org/wiki/Holmes_(surname)", "passage_text": "Holmes is an English-language surname with several origins. The surname is also sometimes an Anglicised form of the Gaelic Mac Thomais; thomáis, Similarly holmes can also be a variant Of, cavish derived as An anglicised form Of Mac. thamhais thámhais"}, {"url": "http://www.archives.com/genealogy/family-history-holmes.html", "passage_text": "Holmes family history is first recorded in Lancashire with Roger de Holm (an alternate spelling). Holmes genealogy includes Raymond Holmes, a British fighter pilot who saved Buckingham Palace from the Nazis. Alternately, it could be a topographical name, derived from the Norse-Viking holmr meaning island or haugum meaning hill, or perhaps the Old English holm tree (a common meeting place) or holegn meaning holy woods."}, {"url": "http://genealogy.about.com/od/surname_meaning/p/holmes.htm", "passage_text": "Last Name Meaning & Genealogy Links for the Surname HOLMES. Meaning & Origin: A geographical surname from the northern Middle English holm, meaning island for an individual who lived on an island, or a piece of low-lying meadow lands near or surrounded by water. Also, a geographic surname for someone who lived near where holly trees grew, from the Middle English holm. FamilySearch-HOLMES Genealogy. Find records, queries, and lineage-linked family trees posted for the Holmes surname. HOLMES Surname Mailing List. Free mailing list for researchers of the Holmes surname and its variations includes subscription details and a searchable archives of past messages."}, {"url": "http://selectsurnames.com/holmes.html", "passage_text": "1 The Holmes Family History Society. 2  British Holmes genealogy site. 3  Holmes Family Notes. 4  The Holmes of Charleston, South Carolina. 5  Holmes Blogspot. 6  Holmes in Connecticut. 7  John Holmes from Yorkshire in the 1620's. The main root of Holm is the Viking holm, meaning an island (in particular a slightly raised land lying on flat land or partially surrounded by streams). The explanation below gives one explanation on the transference of Holm as a place name to Holme and Holmes as surnames and why many Holmes have resulted."}, {"url": "http://www.ancestry.co.uk/name-origin?surname=holmes", "passage_text": "Holmes Name Meaning. English (chiefly central and northern England): variant of Holme.Scottish: probably a habitational name from Holmes near Dundonald, or from a place so called in the barony of Inchestuir.Scottish and Irish: Anglicized form of Gaelic Mac Thomais, Thomáis Mac (thomais McComb). see mccomb "}, {"url": "http://www.searchforancestors.com/surnames/origin/h/holmes.php", "passage_text": "If you get the Page is Not Available message, no mailing list is available. Instead, check the index of mailing lists for a sound-alike name. Holmes in Ancestry Message Boards. Browse or post a query about your genealogy, surname origin, or family history in the Holmes surname forum. Look for unknown cousins or relatives with whom you may have lost touch."}, {"url": "http://selectsurnames.com/holmes.html", "passage_text": "Holmes is a locational surname, describing someone who lived by a holm. The main root of Holm is the Viking holm, meaning an island (in particular a slightly raised land lying on flat land or partially surrounded by streams). The explanation below gives one explanation on the transference of Holm as a place name to Holme and Holmes as surnames and why many Holmes have resulted."}]