[{"url": "http://www.economist.com/node/21553017/", "passage_text": "THE first industrial revolution began in Britain in the late 18th century, with the mechanisation of the textile industry. Tasks previously done laboriously by hand in hundreds of weavers' cottages were brought together in a single cotton mill, and the factory was born."}, {"url": "http://www.factmonster.com/dk/encyclopedia/industrial-revolution.html", "passage_text": "URBANIZATION. FIND OUT MORE. The Industrial Revolution changed the way things were made as new machines invented in the 1700s and 1800s meant it was possible to mass produce goods in factories."}, {"url": "http://www.thomasnet.com/articles/custom-manufacturing-fabricating/history-of-the-industrial-revolution", "passage_text": "During the Industrial Revolution changes took place in how goods were produced. Instead of utilizing artisans to produce hand-made items, machines started to help and eventually take the place of the artisans."}, {"url": "http://www.historylearningsite.co.uk/britain-1700-to-1900/industrial-revolution/the-cotton-industry-and-the-industrial-revolution/", "passage_text": "The United Kingdom experienced a huge growth in the cotton industry during the Industrial Revolution. The factories that were required to produce cotton became a legacy of the time – Sir Richard Arkwright at Cromford built the world’s first true factory to produce cotton."}, {"url": "http://www.factmonster.com/dk/encyclopedia/industrial-revolution.html", "passage_text": "During the 18th century, water was an important source of power for industry, and many machines were driven by waterwheels. Steam power was also developed at this time. Steam engines were used to pump water out of mine shafts and to power new TRANSPORTATION systems. Engines and furnaces were all fueled by coal."}, {"url": "http://www.answers.com/Q/What_was_the_first_industry_to_begin_to_use_machines_to_manufacture_goods", "passage_text": "The original electric coffee machine was called an electric percolater and was made in the mid 1800's. Nobody is really sure of the exact date that the machine was manufacture … d but it is the first."}, {"url": "http://www.ushistory.org/us/25d.asp", "passage_text": "The First American Factories. Slater Mill, founded in 1793 by Samuel Slater, is now used as a museum dedicated to textile manufacturing. There was more than one kind of frontier and one kind of pioneer in early America."}, {"url": "http://www.ushistory.org/us/25d.asp", "passage_text": "The first factory in the United States was begun after George Washington became President. In 1790, Samuel Slater, a cotton spinner's apprentice who left England the year before with the secrets of textile machinery, built a factory from memory to produce spindles of yarn."}, {"url": "http://www.ushistory.org/us/25d.asp", "passage_text": "Three years later, John and Arthur Shofield, who also came from England, built the first factory to manufacture woolens in Massachusetts. From these humble beginnings to the time of the Civil War there were over two million spindles in over 1200 cotton factories and 1500 woolen factories in the United States."}]