[{"url": "http://www.foodnavigator-usa.com/R-D/Maple-water-as-a-great-candidate-for-functional-beverage-applications-Study-shows-processing-has-no-effect-on-chemical-and-nutrition-components", "passage_text": "Sterilization and pasteurization have no effects on the chemical composition and antioxidant activity of maple sap, says a new study that supports it as a ‘great candidate for functional beverage applications’. Interest has been building in the beverage, described as ‘refreshing palatable’. 'A great regional product'. Dr Seeram told us that he has been researching maple for about five years, and has already published 13 or 14 papers on maple syrup and maple plant parts. The potential of the maple sap/water beverage is 'exciting', he said. I've tasted it and it's fantastic"}, {"url": "https://answers.yahoo.com/question/index?qid=20080920093534AASfpl4", "passage_text": "Best Answer: The risk is smaller for both corn syrup and maple syrup but not non-existent. http://www.riversideonline.com/health_re... Botulism spores may also be found in undercooked food, corn syrup and even maple syrup. For this reason, feeding an infant any of these foods is risky as well. http://wikiparenting.parentsconnect.com/... Food sources Sources of botulism spores include undercooked food, light and dark corn syrup, maple syrup, and honey. In fact, botulinum can appear in other sweeteners, such as maple syrup, as well as corn syrup. Botulinum can even be found in dust, indicating that it is an extremely widespread toxin. As a result, most humans adapt to it and are able to fend off small amounts of the toxin, such as those present in honey."}, {"url": "http://realmaplesyrup.com/how.html", "passage_text": "Many gallons of sap are needed to make just one gallon of maple syrup. It can range from 35-50 gallons of sap, depending on how much maple sugar there is in the sap. All maple syrup has the same amount of maple sugar, but the maple flavor can be different as we shall learn. The sap is collected into a large holding tank and from there is fed into the sugar house (the place where the magic happens!)."}, {"url": "https://en.wikipedia.org/wiki/Maple_syrup", "passage_text": "In Canada, syrups must be made exclusively from maple sap to qualify as maple syrup and must also be at least 66 percent sugar. In the United States, a syrup must be made almost entirely from maple sap to be labelled as maple, though states such as Vermont and New York have more restrictive definitions (see below). A maple syrup production farm is called a  sugarbush  or sugarwood. Sap is often boiled in a  sugar house  (also known as a sugar shack, sugar shanty, or cabane a à), sucre a building louvered at the top to vent the steam from the boiling. Sap maples are usually tapped beginning at 30 to 40 years of. age"}, {"url": "https://en.wikipedia.org/wiki/Maple_syrup", "passage_text": "A maple syrup production farm is called a  sugarbush  or sugarwood. Sap is often boiled in a  sugar house  (also known as a sugar shack, sugar shanty, or cabane a à), sucre a building louvered at the top to vent the steam from the boiling. sap A maple syrup production farm is called a  sugarbush  or sugarwood. Sap is often boiled in a  sugar house  (also known as a sugar shack, sugar shanty, or cabane a à), sucre a building louvered at the top to vent the steam from the boiling. Sap maples are usually tapped beginning at 30 to 40 years of. age"}, {"url": "http://healthimpactnews.com/2014/the-health-benefits-of-maple-syrup-why-you-should-replace-processed-sugar-with-maple-syrup/", "passage_text": "Health Impact News Editor Comments: Maple syrup is a traditional sweetener rich in nutrients, and a much better choice the most of the cheap highly processed sweeteners currently in the market. Grade B is darker and more nutrient dense than Grade A, and is therefore preferred for its nutritional value. In fact, maple syrup production is approximately one-fifth of what it was in the beginning of the 20th century. Health Potential. Maple syrup was known to have naturally occurring minerals, such as zinc, thiamine, and calcium."}, {"url": "https://en.wikipedia.org/wiki/Maple_syrup", "passage_text": "Maple syrup is a syrup usually made from the xylem sap of sugar maple, red maple, or black maple trees, although it can also be made from other maple species. In cold climates, these trees store starch in their trunks and roots before the winter; the starch is then converted to sugar that rises in the sap in the spring. A maple syrup production farm is called a  sugarbush  or sugarwood. Sap is often boiled in a  sugar house  (also known as a sugar shack, sugar shanty, or cabane a à), sucre a building louvered at the top to vent the steam from the boiling. Sap maples are usually tapped beginning at 30 to 40 years of. age"}, {"url": "http://healthimpactnews.com/2014/the-health-benefits-of-maple-syrup-why-you-should-replace-processed-sugar-with-maple-syrup/", "passage_text": "PreventDisease.com. Maple syrup is one of the many wonders of the world and far more than a simple sweetener. Maple syrup is not only rich in essential nutrients such as manganese as well as zinc, but 34 new beneficial compounds discovered just a few years ago have been confirmed to play a key role in human health. In fact, maple syrup production is approximately one-fifth of what it was in the beginning of the 20th century. Health Potential. Maple syrup was known to have naturally occurring minerals, such as zinc, thiamine, and calcium."}]