[{"url": "http://www.accountingtools.com/dictionary-functional-currency", "passage_text": "Definition: Under international financial reporting standards, a functional currency is the currency used in the primary economic environment where an entity operates. This is the environment in which an entity primarily generates and expends cash. 1 The functional currency is the reporting entity’s if so, and the local currency if not. 2  Debt service. 3  Whether a foreign operation’s cash flows can service its debt obligations without funds transfers from the reporting entity."}, {"url": "http://www.accountingtools.com/dictionary-functional-currency", "passage_text": "1 The functional currency is the reporting entity’s in the first case, and the local currency in the later. 2  Proportion of cash flows. 3  Whether cash flows from the foreign operation directly affect the cash flows of the reporting entity, and are available for remittance. 1 The functional currency is the reporting entity’s if so, and the local currency if not. 2  Debt service. 3  Whether a foreign operation’s cash flows can service its debt obligations without funds transfers from the reporting entity."}, {"url": "http://smallbusiness.chron.com/criteria-cash-flow-functional-currency-37111.html", "passage_text": "Determining the functional currency of a foreign entity requires a close look at the entity's cash flow. The FASB's Accounting Standards Codification states that an entity's primary economic environment is the one where the entity generates and spends cash. The first category includes those entities the operations of which are self-contained in a foreign economic environment and distinct from the parent entity. The functional currency for these foreign entities is the foreign currency."}, {"url": "http://www.accountingtools.com/dictionary-functional-currency", "passage_text": "1 The functional currency is the reporting entity’s in the first case, and the local currency in the later. 2  Proportion of transactions. 3  Whether the foreign operation’s transactions with the reporting entity constitute a high or low proportion of the operation’s activities. 1 The functional currency is the reporting entity’s if so, and the local currency if not. 2  Debt service. 3  Whether a foreign operation’s cash flows can service its debt obligations without funds transfers from the reporting entity."}, {"url": "http://ec.europa.eu/internal_market/accounting/docs/consolidated/ias21_en.pdf", "passage_text": "Foreign currency is a currency other than the functional currency of the entity. Foreign operation is an entity that is a subsidiary, associate, joint venture or branch of a reporting entity, the activities of which are based or conducted in a country or currency other than those of the reporting entity. Net investment in a foreign operation is the amount of the reporting entity’s interest in the net assets of that operation. Presentation currency is the currency in which the financial statements are presented. Spot exchange rate is the exchange rate for immediate delivery."}, {"url": "http://www.fasb.org/st/summary/stsum52.shtml", "passage_text": "An entity's functional currency is the currency of the primary economic environment in which that entity operates. The functional currency can be the dollar or a foreign currency depending on the facts. Normally, it will be the currency of the economic environment in which cash is generated and expended by the entity. An entity can be any form of operation, including a subsidiary, division, branch, or joint venture."}, {"url": "http://www.accountingtools.com/dictionary-functional-currency", "passage_text": "When determining the functional currency of an entity’s foreign operation, consider the following factors: 1  Autonomy. 2  Whether the operation is essentially an extension of the reporting entity, or it can operate with a significant degree of autonomy. 1 The functional currency is the reporting entity’s if so, and the local currency if not. 2  Debt service. 3  Whether a foreign operation’s cash flows can service its debt obligations without funds transfers from the reporting entity."}, {"url": "http://www.iasplus.com/en/standards/ias/ias21", "passage_text": "An entity is required to determine a functional currency (for each of its operations if necessary) based on the primary economic environment in which it operates and generally records foreign currency transactions using the spot conversion rate to that functional currency on the date of the transaction. The objective of IAS 21 is to prescribe how to include foreign currency transactions and foreign operations in the financial statements of an entity and how to translate financial statements into a presentation currency."}, {"url": "http://www.readyratios.com/reference/accounting/functional_and_presentation_currency.html", "passage_text": "The same Standard defines presentation currency as “the currency in which the financial statements are presented”. The functional currency is determined by looking at a number of relevant factors. This currency should be the currency in which an entity usually generates and spends cash. Functional currency should be the one in which the business transactions of an entity are normally denominated. All of the transactions which are not in the functional currency are treated as foreign transactions. An entity can present its financial statements in any currency. Usually they are presented in the functional currency; therefore usually the functional currency and the presentation currency is the same."}]