[{"url": "http://healthyeating.sfgate.com/description-difference-between-carbohydrates-proteins-lipids-nucleic-acids-7424.html", "passage_text": "Carbohydrates. Carbohydrates consist of single-sugar units called monosaccharides, double-monosaccharide units known as disaccharides and multiple-monosaccharide molecules that make up starches. The predominant purpose of the carbohydrates you eat is to provide fuel to your cells. Proteins. The building blocks that make up proteins are called amino acids. Proteins consist of 20 different amino acids, mixed and matched to create a vast array of larger molecules that support every process in your body."}, {"url": "http://www.scienceprofonline.com/chemistry/what-is-organic-chemistry-carbohydrates-proteins-lipids-nucleic-acids.html", "passage_text": "The feature that distinguishes an organic from inorganic molecule is that organic molecules contain carbon-hydrogen bonds, whereas inorganic molecules do not. The four major classes of organic molecules include carbohydrates, proteins, lipids and nucleic acids .​. Carbohydrates. The term carbohydrate is actually a descriptor of what these molecules are composed of; carbon hydrates, in a ratio of one carbon molecule to one water molecule (CH2O)n. "}, {"url": "http://www.biology.iupui.edu/biocourses/N100/2k4ch3carbolipidnotes.html", "passage_text": "The 4 main macromolecules in cells made largely from C, O, H, and N are Carbohydrates, Lipids, Proteins, and Nucleic Acids. For each of these 4 macromolecules, I would like you to know: 1. What the monomer (basic building block) is 2. What types of polymers result 3. "}, {"url": "http://healthyeating.sfgate.com/description-difference-between-carbohydrates-proteins-lipids-nucleic-acids-7424.html", "passage_text": "Nucleic Acids. Your cells contain two types of nucleic acids, ribonucleic acid and deoxyribonucleic acid, or RNA and DNA, respectively. They differ from the other macronutrients in that they are not a source of calories in your diet, and their role is strictly to direct the synthesis of new protein molecules. Proteins. The building blocks that make up proteins are called amino acids. Proteins consist of 20 different amino acids, mixed and matched to create a vast array of larger molecules that support every process in your body."}, {"url": "http://www.livestrong.com/article/281655-functions-of-lipids-carbohydrates-nucleic-acids-proteins/", "passage_text": "The main substances found in every cell are a combination of lipids, carbohydrates, nucleic acids and proteins. Each of these substances plays a different role in the body, and all of them must either come from the diet or be manufactured using other chemicals in the body. Carbohydrates are the preferred source of energy for most of the tissues in the body, including the nervous system and the heart. Carbohydrates from the diet are converted into glucose, which can either be immediately used as a source of energy or stored in the form of glycogen."}, {"url": "http://healthyeating.sfgate.com/description-difference-between-carbohydrates-proteins-lipids-nucleic-acids-7424.html", "passage_text": "Encompassing carbohydrates, proteins, lipids and nucleic acids, macromolecules exhibit a number of similarities. For example, all except lipids are long chains made up of smaller building blocks, and digestion reduces the size of macromolecules so your body can absorb their component parts. Proteins. The building blocks that make up proteins are called amino acids. Proteins consist of 20 different amino acids, mixed and matched to create a vast array of larger molecules that support every process in your body."}, {"url": "http://seplessons.ucsf.edu/node/362", "passage_text": "All living things contain organic macromolecules: Lipids, proteins, carbohydrates and nucleic acids. Characteristic for these organic molecules is that they are made up of only a small number of elements: carbon, hydrogen, oxygen, and to smaller amounts nitrogen, phosphorus and sulfur. "}, {"url": "http://www.ehow.com/facts_5476178_proteins-lipids-nucleic-acids-information.html", "passage_text": "Deoxyribonucleic acid and ribonucleic acid -- DNA and RNA, respectively -- are the types of nucleic acids found in your cells. They're made up of chains of monomers called nucleotides. Nucleic acids make it possible to pass genetic information from one generation to the next. RNA is also essential for protein synthesis. Save. altrendo images/Stockbyte/Getty Images. You are what you eat is more than a cliche -- it's fact. Food is made up of compounds called macromolecules -- protein, carbohydrates, lipids and nucleic acids -- that are also the building material for the cells, tissues and organs in your body. Macromolecules are composed of smaller units called monomer"}]