[{"url": "http://www.usd268.org/", "passage_text": "Core Values. Dedicated staff and students drive ACT scores well above the state average and highest in the last five years for Cheney! English 21.9 (21.3 State), Math 22.8 (21.6 State), Reading 23.2 (22.4),Science 23.2 (21.8), and Composite 22.8 (21.9 State)."}, {"url": "http://www.cheneysd.org/site/default.aspx?PageID=1", "passage_text": "SCHOOL BOARD MEETING OCTOBER 14 The next regularly-scheduled meeting of the Board of Directors will be held at 6:00 p.m. on Wednesday, October 14, at Snowdon Elementary School, 6323 S. Holly Rd., Cheney. Members of the public are always welcome to attend."}, {"url": "http://cheneypubliclibrary.org/", "passage_text": "September 27, 2015 Written by Cheney Public Library. Join Rich Simmons for a book signing at the Cheney Public Library for his debut novel, Magic Carpet Ride! The book signing will be Thursday, October 22 from 5:30-7:00pm at the Cheney Public Library. Books will be available for $10."}, {"url": "http://cheneypubliclibrary.org/", "passage_text": "Join Rich Simmons for a book signing at the Cheney Public Library for his debut novel, Magic Carpet Ride! The book signing will be Thursday, October 22 from 5:30-7:00pm at the Cheney Public Library. Books will be available for $10."}, {"url": "http://cityofcheney.org/index.php?section=recreation", "passage_text": "Please note park fees will be implemented starting January 2015 to help upkeep park shelters. Inclement Weather & Holiday Closure. If inclement weather causes a two-hour delay of the Cheney School District, all programs that begin prior to noon will be cancelled. All afternoon and evening programs will continue to run."}, {"url": "http://www.cheney.ocps.net/", "passage_text": "Cheney Elementary 2000 N. Forsyth Rd.Orlando, FL 32807Phone: 407-672-3120 || Fax: 407-672-3126. Principal-Tracey Gibson. Assistant Principal-Luz HaleSchool Hours8:45 - 3:008:45 - 2:00 (Wed.)Office Hours:7:30 - 4:00. Email:cheney_es@ocps.net. Save the Date..."}]