[{"url": "http://arweb.sdsu.edu/es/virtualtour/calpulli.html", "passage_text": "Calpulli Center. The Calpulli Center houses Counseling and Psychological Services, Student Disability Services, and Student Health Services, all available to students as part of basic tuition and fees. At Student Health Services, students receive high-quality health care from certified nurses and doctors. "}, {"url": "https://en.wikipedia.org/wiki/Calpulli", "passage_text": "In precolumbian Aztec society, a calpulli (from Classical Nahuatl calpōlli, [kaɬˈpoːlːi] , meaning large house) was the designation of an organizational unit below the level of the Altepetl citystate. Newcomers from other altepetl were allowed to settle down and become part of the calpulli. Michael Smith (2003) shows that in some Nahua cities, notably Otumba, each calpulli specialised in a trade and took almost the form of a trade guild."}, {"url": "https://en.wikipedia.org/wiki/Calpulli", "passage_text": "Most rural calpulli were based on lineage. In other words, the members of a rural calpulli believed that they were descended from a common ancestor. In the cities, the calpulli were based more on geographical, political, and occupational similarities than lineage. Newcomers from other altepetl were allowed to settle down and become part of the calpulli. Michael Smith (2003) shows that in some Nahua cities, notably Otumba, each calpulli specialised in a trade and took almost the form of a trade guild."}, {"url": "http://archaeology.about.com/od/caterms/a/Calpulli.htm", "passage_text": "Daniel Sambraus / Moment Mobile / Getty Images. A calpulli (kal-pooh-li) – which in Nahua, the language spoken by the Aztec, means “large house” – was the fundamental core of Aztec society, an organizational unit broadly corresponding to a ward, or a Spanish “ barrio ”. In the Aztec empire, calpulli represented the lowest but most populous social unit under the level of the city-state, called in Nahua an altepetl."}, {"url": "http://calpullidance.org/", "passage_text": "MISSION. Calpulli Mexican Dance Company's mission is to teach and produce dance-based programming incorporating live music and theatre to promote the rich diversity of Mexico's cultural heritage. To this end, the organization focuses on the following: "}, {"url": "https://en.wikipedia.org/wiki/Calpulli", "passage_text": "The nature of the interrelatedness between the members of the calpulli is a matter of debate. Traditionally it has been argued that the calpulli was firstly a family unit in which the inhabitants were related through blood and intermarriage. Newcomers from other altepetl were allowed to settle down and become part of the calpulli. Michael Smith (2003) shows that in some Nahua cities, notably Otumba, each calpulli specialised in a trade and took almost the form of a trade guild."}, {"url": "http://www.merriam-webster.com/dictionary/calpulli", "passage_text": "Nahuatl calpulli, literally, big house, augmentative of calli house. This word doesn't usually appear in our free dictionary, but the definition from our premium Unabridged Dictionary is offered here on a limited basis. Note that some information is displayed differently in the Unabridged. Definition of CALPULLI. : a clan or ward constituting the fundamental unit of Aztec society. cal·pul·li also cal·pol·li \\-ˈȯ-\\ or cal·pul \\ˈkalˌpu̇l\\. ADVERTISEMENT."}, {"url": "http://shs.sdsu.edu/services.asp", "passage_text": "1 Clinical services are provided in our offices at the Calpulli Center [ map ] by physicians, nurse practitioners and other healthcare professionals. 2  These services include: "}, {"url": "https://answers.yahoo.com/question/index?qid=1006050900780", "passage_text": "Best Answer: Calpulli is the Nahuatl term for a group of families (or a single large family) that usually had a particular function in the Pre-Columbian society (such as priests, warriors, etc.) A calpulli was, therefore, one of the main social organizations of the Aztec society. "}]