[{"url": "http://www.seattle.gov/light/conserve/resident/cv5_faq.htm", "passage_text": "1 more appliance FAQ's... 2  For the first 10 kWh per day on average in summer or 16 kWh per day on average in winter, you pay the rate of $0.0376 per kWh. 3  For additional use over 11 kWh per day on average in summer or over 17 kWh on average in winter, you pay the rate of $0.0793 per kWh. NOTE: The normal billing period ranges from 57-63 days. To figure the average kWh use per day, Seattle City Light takes the total number of kWh used and divides by the number of days in the billing period."}, {"url": "http://www.wikihow.com/Calculate-Kilowatt-Hours", "passage_text": "Divide the result by 1,000 to convert watts to kilowatts. So for example, if your large window fan is rated at 250 watts and you use it 5 hours a day, its kWh use per day is 250 (watts) * 5 (hours used per day) / 1,000 (to change watts into kilowatts) = 1.25 kWh per day. To continue the earlier example of the window fan, if energy costs 17 cents/kWh in your area, running the fan as estimated earlier for one year will cost you approximately 1.25 (kWh per day) * 365 (days--the time period) * .17 (cost of energy/kWh) = about $77.56 per year if you use the fan every day."}, {"url": "http://energyusecalculator.com/electricity_refrigerator.htm", "passage_text": "A fridge will use anywhere from 100 to 400 watts depending on size, an average modern fridge will use 180 watts. Click calculate to find the energy consumption of a refrigerator using 180 Watts for 24 hours a day @ $0.10 per a kWh. Cost Per Hour: Hours Used Per Day: Enter how many hours the device is being used on average per a day, if the power consumption is lower than 1 hour per a day enter as a decimal."}, {"url": "http://www.wikihow.com/Calculate-Kilowatt-Hours", "passage_text": "3. Divide the result by 1,000 to convert watts to kilowatts. So for example, if your large window fan is rated at 250 watts and you use it 5 hours a day, its kWh use per day is 250 (watts) * 5 (hours used per day) / 1,000 (to change watts into kilowatts) = 1.25 kWh per day. 1  4 Edit step. To continue the earlier example of the window fan, if energy costs 17 cents/kWh in your area, running the fan as estimated earlier for one year will cost you approximately 1.25 (kWh per day) * 365 (days--the time period) * .17 (cost of energy/kWh) = about $77.56 per year if you use the fan every day."}, {"url": "http://www.answers.com/Q/How_much_electricity_does_an_average_2-story_3-bedroom_house_use_per_day_per_month_or_per_year", "passage_text": "Answer by Noah Modie. Confidence votes 192. As an electrical engineer for a power company I see on average a house that is 1600-2000 square feet and having electric appliances except for the furnace use an average of 1500Kwatt-hours per month making 50 Kwatt-hours per day and a total of 18,000 Kwatt-hours per year. "}, {"url": "http://energyusecalculator.com/electricity_centralac.htm", "passage_text": "The energy use of a central air conditioner highly depends on the climate of the region, a central air conditioner will run 3 to 7 months of the year depending on the outside temperature. An average central ac will use 3000 to 5000 watts of power every hour for around 9 hours a day during the hotter months. Click calculate to find the energy consumption of a central air conditioner using 3500 Watts for 3 hours a day @ $0.10 per a kWh. Running 3 hours a day is the same as running 9 hours a day for 4 of the warmer months. Cost Per Hour: Cost Per Day: "}, {"url": "http://www.eia.gov/tools/faqs/faq.cfm?id=97&t=3", "passage_text": "How much electricity does an American home use? In 2013, the average annual electricity consumption for a U.S. residential utility customer was 10,908 kilowatthours (kWh), an average of 909 kWh per month. Louisiana had the highest annual consumption at 15,270 kWh, and Hawaii had the lowest at 6,176 kWh. "}, {"url": "http://shrinkthatfootprint.com/average-household-electricity-consumption", "passage_text": "In the US typical household power consumption is about 11,700 kWh each year, in France it is 6,400 kWh, in the UK it is 4,600 kWh and in China around 1,300 kWh. The global average electricity consumption for households with electricity was roughly 3,500 kWh in 2010. Our household electricity use has been 2,000 kWh each of the last few years, which means it is about 700 kWh per person. We benefit from not using electricity for heating or cooling, although our electric oven is a big source of demand."}, {"url": "http://www.wikihow.com/Calculate-Kilowatt-Hours", "passage_text": "Multiply the unit's kWh/day by the number of days you'd use it during the period you'd like to calculate. So to estimate an appliance's energy use in kWh per month, multiply its kWh/day by 31 (or 28, 29 or 30 depending on how many days there are in the month you want to measure). To continue the earlier example of the window fan, if energy costs 17 cents/kWh in your area, running the fan as estimated earlier for one year will cost you approximately 1.25 (kWh per day) * 365 (days--the time period) * .17 (cost of energy/kWh) = about $77.56 per year if you use the fan every day."}, {"url": "http://www.seattle.gov/light/conserve/resident/cv5_faq.htm", "passage_text": "1 For the first 10 kWh per day on average in summer or 16 kWh per day on average in winter, you pay the rate of $0.0376 per kWh. 2  For additional use over 11 kWh per day on average in summer or over 17 kWh on average in winter, you pay the rate of $0.0793 per kWh. NOTE: The normal billing period ranges from 57-63 days. To figure the average kWh use per day, Seattle City Light takes the total number of kWh used and divides by the number of days in the billing period."}]