[{"url": "http://www.fatsecret.com/calories-nutrition/usda/chicken-dark-meat-and-skin-(broilers-or-fryers-roasted-cooked)", "passage_text": "There are 287 calories in 4 ounces of Chicken Dark Meat and Skin (Broilers or Fryers, Roasted, Cooked). Calorie breakdown: 56% fat, 0% carbs, 44% protein. All trademarks, copyright and other forms of intellectual property are property of their respective owners. blog|faq|terms|privacy|find buddies|food list|brand list|report abuse|contact|other sites|platform|professional. © 2015 FatSecret. All rights reserved."}, {"url": "http://www.sparkpeople.com/calories-in.asp?food=chicken+dark+meat", "passage_text": "Ingredient specific calorie information from our recipes: 1  Calories In Baked Breaded BBQ Chicken-Dark meat. 2  241 calories, 4g fat, 32g carbs, 19g protein, 3g fiber. 3  Calories In Chicken Dark-meat Stir Fry. 1 117 calories, 4g fat, 6g carbs, 15g protein, 2g fiber. 2  Calories In JA Curry Chicken (dark meat) cooked in the oven. 3  291 calories, 8g fat, 31g carbs, 24g protein, 6g fiber. 4  Calories In Pargiot-- Israeli Grilled Chicken Dark Meat."}, {"url": "http://www.fitday.com/webfit/nutrition/All_Foods/Poultry/Chicken_boneless_light_or_dark_meat__broiled_skin_not_eaten.html", "passage_text": "Nutrition Info For: Chicken, boneless, NS as to part, broiled, light or dark meat, skin not eaten. Calorie Count: 254.4. Calories. Nutrition Facts. "}, {"url": "https://recipes.sparkpeople.com/great-recipes.asp?food=dark+meat+chicken", "passage_text": "Full ingredient & nutrition information of the JA Curry Chicken (dark meat) cooked in the oven Calories. Chicken Dark-meat Stir Fry. (no ratings). A moist, juicy stir fry that is high in protein and veggies (good carbs), low in fat and bad carbs. (1 rating). Not quite Arroz con Pollo, a very mild brown rice sautee with dark meat chicken that imparts a rich flavour."}, {"url": "http://www.caloriegallery.com/foods/calories-in-rotisserie-chicken-dark-meat-no-skin.htm", "passage_text": "1.78 Calories in 1 gram of Chicken Dark Meat. Chicken, Water, Seasoning {Salt, Sodium Phosphate, Modified Food Starch (Potato and Tapioca), Carrageenan, Sugar, Dextrose, Spice Extractives}. This pie chart shows the ratio of carbs to fat to protein in this food or drink. The percentages are based on the Calories that come from each of these macronutrients. The weight of each macronutrient, based on the serving size selected, is also provided."}, {"url": "http://www.muscleandperformance.com/article/food-picks-white-vs-dark-chicken-meat", "passage_text": "About 45% of the calories come from dietary fats. Chicken breast is likely the #1 food in most bodybuilders’ nutrition plan, but is it the best food option? How does it compare to “fatty” dark meat, which many bodybuilders shun? MMI compared 8 ounces of roasted, skinless versions of white and dark chicken meat. • Dark meat has more than double the fats (both healthy and saturated) of breast meat. However, saturated fats provide raw materials to help increase crucial hormones such as testosterone. • Dark meat derives about 50% of its calories from protein; white meat derives about 75%. When you want more protein on a restricted-calorie diet, breast meat is the clear winner; when you want more calories from a food that’s more than 50% protein (and almost 50% fats), opt for dark meat. When you want to strike a balance, mix breast and dark meat. Chicken breast (by a beak … er, nose)"}, {"url": "http://www.acaloriecounter.com/food/chicken-broilers-or-fryers-dark-meat-meat-and-skin-cooked-fried-flour", "passage_text": "Then, enter that amount in as the serving size. This option will ensure that the nutrition facts shown are 100% accurate for your specific amount of Chicken, broilers or fryers, dark meat, meat and skin, cooked, fried, flour. Edit your serving size. prev next. "}, {"url": "http://www.sparkpeople.com/calories-in.asp?food=chicken+dark+meat", "passage_text": "1 Calories In JA Curry Chicken (dark meat) cooked in the oven. 2  291 calories, 8g fat, 31g carbs, 24g protein, 6g fiber. 3  Calories In Pargiot-- Israeli Grilled Chicken Dark Meat. 4  177 calories, 7g fat, 7g carbs, 21g protein, 2g fiber. 1 117 calories, 4g fat, 6g carbs, 15g protein, 2g fiber. 2  Calories In JA Curry Chicken (dark meat) cooked in the oven. 3  291 calories, 8g fat, 31g carbs, 24g protein, 6g fiber. 4  Calories In Pargiot-- Israeli Grilled Chicken Dark Meat."}]