[{"url": "http://study.com/articles/How_to_Become_a_Professional_Referee_Education_and_Career_Roadmap.html", "passage_text": "To referee at the high school, state registration is typically necessary. Every state and sport has different requirements when it comes to the registration process. However, most require completion of a written exam, and some may require formal training classes prior to the exam. A field test may be necessary as well. Step 4: Gain Experience to Move Up in the Field. Career advancement for referees typically comes only after several years' experience. In some cases, sports leagues or conferences may have specific training, evaluation or experience requirements that must be met."}, {"url": "http://www.studentscholarships.org/careers_salary/153/education/athletes_coaches_referees_and_related_occupations.php", "passage_text": "5. To be a referee, you must finish an officiating program from a sport-governing body. 6. To be a program leader or instructor, you usually need a high school diploma as well as a college diploma in recreation or physical education, or extensive experience in a specific recreational or sports program. To be a coach, you usually need to complete the national coaching certificate program and have technical knowledge/experience of the sport. You may need a degree in physical education. 4. To be a sports official, you need certification by and registration with a sport governing body or commission."}, {"url": "http://www.bls.gov/ooh/entertainment-and-sports/umpires-referees-and-other-sports-officials.htm", "passage_text": "Although some states have no formal education requirements, other states require umpires, referees, and other sports officials to have a high school diploma. Training requirements also vary by state and the level and type of sport. All sports, however, require extensive knowledge of the rules of the game. Each state and sport association has its own education requirements for umpires, referees, and other sports officials. Some require no formal education, while others require"}, {"url": "http://requirementstobecome.com/referee.htm", "passage_text": "Colleges that hire referees generally require you to be a graduate of a professional officiating school. To officiate minor or major league baseball games, you must have attended a professional umpire training school. To officiate major league games, umpires must possess 7 to 10 years experience in minor leagues. A referee is a sports official who officiates at athletic events such as football and basketball. Their responsibilities include imposing penalties if rules and regulations of the game are broken. Referees may work as the sole referee in sports such as boxing, or work in a group of referees in sports such as football."}, {"url": "http://requirementstobecome.com/referee.htm", "passage_text": "To become a referee for professional football, a minimum of ten years of experience is required, at least five of which occurred at the college level or higher. A referee is a sports official who officiates at athletic events such as football and basketball. Their responsibilities include imposing penalties if rules and regulations of the game are broken. Referees may work as the sole referee in sports such as boxing, or work in a group of referees in sports such as football."}, {"url": "http://study.com/articles/How_to_Become_a_Professional_Referee_Education_and_Career_Roadmap.html", "passage_text": "Learn how to become a professional referee. Research the education and career requirements, certification and experience required for starting a career as a professional referee. Step 4: Gain Experience to Move Up in the Field. Career advancement for referees typically comes only after several years' experience. In some cases, sports leagues or conferences may have specific training, evaluation or experience requirements that must be met."}, {"url": "http://soccerrefereeusa.com/index.php/become-a-referee", "passage_text": "Become A Referee. General Information. You become a referee by attending and successfully completing a referee training course. As of July, 2013 U.S. Soccer Federation (USSF) authorized two entry-level referee certifications: Recreational Referee Grade 9 and Referee Grade 8. However, Referee Grade 8 entry level is the most popular. Information For New Referees. Once you successfully complete a referee course and register with the USSF, you will receive your badge and will need to get appropriate referee gear, including a soccer referee uniform, soccer referee flags, referee cards, whistle, watch and shoes."}, {"url": "http://www.wikihow.com/Become-an-NFL-Referee", "passage_text": "Approximately 17 percent of referees qualify for this level, usually while working other part or full-time jobs. NFL officials make between $25,000 and $70,000. You can learn how to become an NFL referee by completing the guidelines for training and experience listed below. Work as a substitute referee. You may need to work at the college, minor and NFL levels for a while before you are asked to do a full season in the NFL."}, {"url": "http://www.csmonitor.com/Business/2012/1029/How-to-become-an-NFL-referee-Start-early", "passage_text": "Save for later Saved. NFL referees make a call from the instant replay booth during an NFL football game between the San Diego Chargers and the Denver Broncos earlier this month in San Diego. To become an NFL referee takes years of working through the ranks. "}, {"url": "http://study.com/articles/How_to_Become_a_Professional_Referee_Education_and_Career_Roadmap.html", "passage_text": "Depending on the state and type of sport, referees can become a certified official by attending training clinics. For example, the Southern California chapter of the Amateur Softball Association (ASA) of America lets umpires earn certification through their mechanics clinic program or with a participating provider. Step 4: Gain Experience to Move Up in the Field. Career advancement for referees typically comes only after several years' experience. In some cases, sports leagues or conferences may have specific training, evaluation or experience requirements that must be met."}]