[{"url": "http://homeguides.sfgate.com/way-unclog-bathtub-drain-40674.html", "passage_text": "3. Snake the drain by going through the overflow pipe. Remove both the overflow cover and the stopper assembly and feed a drain snake into the pipe. Fill the tub about one-quarter full of hot water. Feed the snake into the pipe until it stops, then turn the handle on the snake while continuing to feed it down the drain."}, {"url": "http://www.wikihow.com/Unclog-a-Shower-Drain", "passage_text": "Shower drains can become clogged with minerals from hard water, hair and soap. Each of the methods below can help you unclog a shower drain. If the first method does not work, move on to subsequent solutions."}, {"url": "http://www.lowes.com/projects/bed-and-bath/clear-clogged-drain/project", "passage_text": "Remove the strainer or sink pop-up stopper. 1  If there is a strainer over the drain, as in a tub or shower, remove the screws securing it and pry it up with a screwdriver. 2  Be careful to keep the screws from falling down the drain. 3  You can remove some pop-up sink stoppers by twisting and lifting them out."}, {"url": "http://homeguides.sfgate.com/way-unclog-bathtub-drain-40674.html", "passage_text": "Plunge the drain for deeper clogs. Remove the overflow drain cover by unscrewing the screws with a screwdriver and then pulling out the overflow stopper assembly from the overflow pipe. Stuff a rag into the overflow pipe to keep air from entering the pipe when you plunge the drain. Fill the tub with enough water so that the base of the plunger is covered, then perform several up-and-down plunge strokes. The air and water pressure will usually be enough to break through the clog."}, {"url": "http://www.lowes.com/projects/bed-and-bath/clear-clogged-drain/project", "passage_text": "1 On a shower drain, remove the strainer in the shower floor and insert the cable into the drain. 2  On a sink drain, you may be able to remove the stopper and insert the cable or rod directly into the drain. 3  If not, remove the trap and insert the cable or rod into the waste line."}, {"url": "http://www.wikihow.com/Unclog-a-Shower-Drain", "passage_text": "3. Use a flashlight to look down the drain. Most clogs are caused by hair. If the hair is sitting near the surface, remove it with your fingers. 1  If your shower clog is caused by a larger object that is caught in the drain, you may want to call a plumber."}]