[{"url": "http://mhhe.com/biosci/ap/histology_mh/glands.html", "passage_text": "Glands of the body are classified as either exocrine or endocrine types. Exocrine glands are glands that retain ducts to body surfaces. During development, endocrine glands lose their contacts to embryological surfaces(ducts) and become isolated as small blocks of tissues. In exocrine glands, products of these cells collect in the duct of the gland and flow toward the surface to which the duct is in contact. Since endocrine glands lack ducts, the product is released across the cell membrane into interstitial spaces around the cells."}, {"url": "http://mhhe.com/biosci/ap/histology_mh/glands.html", "passage_text": "Modes of Secretion. Secretory cells of exocrine glands release their products into ducts in three different ways. The mode of secretion can be classified as merocrine, apocrine, or holocrine. Cells that secrete products via the merocrine method form membrane-bound secretory vesicles internal to the cell. In exocrine glands, products of these cells collect in the duct of the gland and flow toward the surface to which the duct is in contact. Since endocrine glands lack ducts, the product is released across the cell membrane into interstitial spaces around the cells."}, {"url": "http://www.differencebetween.net/science/health/difference-between-exocrine-and-endocrine/", "passage_text": "Exocrine glands are glands that secrete their products through the ducts, and discharge it into the external environment, to organs or the outside the body. 2. Exocrine hormones are released into the external environment, or outside of the body. Endocrine hormones are released into the internal environment, or inside of the body. 3. Exocrine glands have sub-classifications. 4. Endocrine response is slower because hormones travel through the blood."}, {"url": "https://en.wikipedia.org/wiki/Exocrine_gland", "passage_text": "Exocrine glands are glands that produce and secrete substances onto an epithelial surface by way of a duct. Examples of exocrine glands include sweat, salivary, mammary, ceruminous, lacrimal, sebaceous, and mucous. Exocrine glands are one of two types of glands in the human body, the other being endocrine glands, which secrete their products directly into the bloodstream. The liver and pancreas are both exocrine and endocrine glands; they are exocrine glands because they secrete products— bile and pancreatic juice —into the gastrointestinal tract through a series of ducts, and endocrine because they secrete other substances directly into the bloodstream. Contents."}, {"url": "http://hexanatomy.weebly.com/endocrine-system.html", "passage_text": "Endocrine and exocrine glands are different in that endocrine glands do not have ducts to carry their secretions to specific locations. Exocrine glands usually secrete their products (not hormones or other chemical messengers) into the external environment, while the endocrine glands secrete hormones into the body. Some examples of exocrine glands are sweat glands, salivary glands, "}, {"url": "https://en.wikipedia.org/wiki/Endocrine_gland", "passage_text": "(January 2010). Endocrine glands are glands of the endocrine system that secrete their products, hormones, directly into the blood rather than through a duct. The major glands of the endocrine system include the pineal gland, pituitary gland, pancreas, ovaries, testes, thyroid gland, parathyroid gland, hypothalamus and adrenal glands. "}, {"url": "http://mhhe.com/biosci/ap/histology_mh/glands.html", "passage_text": "Endocrine and exocrine glands secrete various products. These include hormones, enzymes, metabolites, and other molecules. In exocrine glands, products of these cells collect in the duct of the gland and flow toward the surface to which the duct is in contact. Since endocrine glands lack ducts, the product is released across the cell membrane into interstitial spaces around the cells."}, {"url": "http://www.training.seer.cancer.gov/anatomy/endocrine/", "passage_text": "Endocrine Glands. The endocrine glands do not have ducts to carry their product to a surface. They are called ductless glands. The word endocrine is derived from the Greek terms endo, meaning within, and krine, meaning to separate or secrete."}, {"url": "https://quizlet.com/8360605/endocrine-glands-flash-cards/", "passage_text": "how do endocrine glands differ from exocrine glands. how do endocrin glands endocrine glands secrete tiny amounts of hormones directly into the bloodstream (ductless glands) and exocrine glands secret their products onto epithelial surfaces through tiny tubes called ducts(exo means out or external). "}]