[{"url": "https://en.wikipedia.org/wiki/Vaginitis", "passage_text": "Vaginitis is an inflammation of the vagina. It can result in discharge, itching and pain, and is often associated with an irritation or infection of the vulva. It is usually due to infection. The three main kinds of vaginitis are bacterial vaginosis (BV), vaginal candidiasis, and trichomoniasis. "}, {"url": "http://www.medicinenet.com/vaginitis_overview/page2.htm", "passage_text": "Infectious causes of vaginitis include bacteria, yeast, and Trichomonas. 1  Bacterial vaginosis is the most common bacterial infection that causes vaginitis. 2  This condition results from an imbalance in the bacteria normally present in the vagina. 1 The STDs gonorrhea and Chlamydia are other bacterial causes of vaginitis. 2  Yeast infections, such as Candida infection, are a common cause of vaginitis. 3  Yeast infections are not considered to be STDs. 4  Trichomonas (Trich) is a parasitic infection that is transmitted through sexual contact."}, {"url": "http://www.urmc.rochester.edu/encyclopedia/content.aspx?ContentTypeID=85&ContentID=P00595", "passage_text": "Bacterial vaginosis is the most common type of vaginitis in women of reproductive age. This infection is caused by bacteria, not yeast. With a bacterial vaginosis infection, certain species of normal vaginal bacteria grow out of control and trigger inflammation. "}, {"url": "http://www.rightdiagnosis.com/v/vaginitis/intro.htm", "passage_text": "Vaginitis is a common condition in which there is inflammation of the vagina resulting in such symptoms as irritation and heavy vaginal discharge. Vaginitis can be caused by an infection or by non-infectious causes. Infectious causes of vaginitis include a yeast infection caused by the fungus candida. "}, {"url": "http://www.webmd.com/sexual-conditions/guide/vaginitis-topic-overview", "passage_text": "Another type of vaginitis is atrophic vaginitis. This is an irritation of the vagina caused by thinning tissues and less moisture in the vaginal walls. This often occurs with menopause as a result of the decrease in the hormone estrogen. Vaginitis may be caused by bacteria, yeast, or other organisms. Bath products, douches, and spermicides also can irritate the vagina and cause itching and discomfort. The three most common types of vaginitis and their causes are: 1  Yeast infectio"}, {"url": "http://www.medicalnewstoday.com/articles/175101.php", "passage_text": "Vaginitis means inflammation of the vagina. In most cases it is due to a fungal infection. The patient typically has a discharge, itching, burning, and possibly pain. It is frequently linked to an irritation or infection of the vulva. Vaginitis is a very common condition. It is especially common in women with diabetes. The hallmark symptoms of vaginitis include itching, burning and a discharge. Vulvovaginitis-inflammation of the vagina and vulva-can affect all women of all ages from every socioeconomic and ethnic backgrounds. Infectious vaginitis makes up 90% of all cases in post-pubescent females."}, {"url": "http://my.clevelandclinic.org/health/diseases_conditions/hic_Vaginitis", "passage_text": "“Vaginitis” is a medical term used to describe various disorders that cause infection or inflammation of the vagina. Vulvovaginitis refers to inflammation of both the vagina and vulva (the external female genitals). These conditions can result from an infection caused by organisms such as bacteria, yeast, or viruses. "}]