[{"url": "http://www.answers.com/Q/How_are_the_circulatory_system_and_repiratory_system_interrelated", "passage_text": "The circulatory system comprises of the heart, the lungs and the  blood vessels. The main objective of the circulatory system is  transporting oxygenated (rich saturation of oxygen) blood around  the body. The de-oxygenated blood enters through the vena cava and  into the right atrium of the heart. The circulatory system includes: the pulmonary circulation, a loop through the lungs where blood is oxygenated; and the systemic circulation, a loop through the rest of the body to provide oxygenated blood."}, {"url": "http://info.visiblebody.com/bid/243853/Anatomy-and-Physiology-The-Relationships-of-the-Respiratory-System", "passage_text": "The point is, without the respiratory system your blood would be useless. The circulatory and respiratory systems work together to circulate blood and oxygen throughout the body. Air moves in and out of the lungs through the trachea, bronchi, and bronchioles. Blood moves in and out of the lungs through the pulmonary arteries and veins that connect to the heart."}, {"url": "http://www.skwirk.com/p-c_s-4_u-106_t-282_c-939/respiratory-and-circulatory-systems/nsw/respiratory-and-circulatory-systems/all-about-us-the-human-body-/our-body", "passage_text": "The body's circulatory system has three distinct parts: pulmonary circulation, coronary circulation and systemic circulation. Pulmonary circulation is the movement of blood from the heart, to the lungs, and back to the heart again. Coronary circulation refers to the movement of blood through the tissues of the heart. Systemic circulation supplies nourishment to all our body tissues. Each of our circulatory systems works independently. Circulatory system. The circulatory system contains the heart and the blood vessels and moves blood throughout the body. Our body has about five litres of blood continually travelling through the circulatory system. All our circulatory organs work together, forming a very efficient pipe network for our bodies"}, {"url": "https://prezi.com/cqiqr3uplcvp/the-circulatory-and-respiratory-system-how-they-work-together/", "passage_text": "Respiratory System The Respiratory System The Respiratory System supplies the blood with oxygen in order for the blood to deliver oxygen to all parts of the body. The Circulatory System The Circulatory System transports blood and oxygen from the lungs to tissues in the body. Diaphragm The lungs are a very important part of the respiratory system. They bring oxygen into the body and remove carbon dioxide. The bronchioles are the main passageway into the lungs in the bronchus. The alveoli is an air cell of the lungs."}, {"url": "http://regentsprep.org/Regents/biology/2011%20Web%20Pages/Human%20Body-%20Circulatory%20and%20Respiratory%20page.htm", "passage_text": "The circulatory system has a close interrelationship with the respiratory system. The main organ of the respiratory system is the lungs. The diaphragm is a muscle located underneath the heart and lungs that contracts to pull air into the lungs and relaxes to force air out of the lungs. When the air enters the lungs, it travels through the bronchi to tiny air sacs called alveoli."}, {"url": "https://uk.answers.yahoo.com/question/index?qid=20091101232731AAEiOAX", "passage_text": "Report Abuse. You need the circulatory system to pump blood around the body. All body cells require oxygenated blood, we get oxygen into the body through the respiratory system. Circulatory system is linked to respiratory system by pulmonary (lungs) veins and arteries. Oxygen breathed in through the lungs is taken to the heart to be pumped round the body. Oxygen from blood will diffuse into body cells, CO2 will go the other way. "}, {"url": "https://uk.answers.yahoo.com/question/index?qid=20061111051652AAXOp3z", "passage_text": "Explain how the circulatory system and respiratory systems of the body interrelate to perform a named function. Add your answer. Source. Submit Cancel. Rating Newest Oldest. Best Answer: yep-I agree. The respiratory system brings air (Oxygen) into the lungs. Blodd is pumped around the outide of the lining of the lungs and absorbs oxygen. The oxygenated blood is then pumped by the heart around the body"}, {"url": "http://www.livestrong.com/article/18606-cardiovascular-system-work-respiratory-system/", "passage_text": "Cardiovascular System. An understanding of how the respiratory and cardiovascular systems interact requires knowledge of how each of the systems function independently. The cardiovascular system in the human body is made up of the heart and blood vessels, which are divided into arteries, veins and capillaries. Interaction. The cardiovascular and the respiratory system both work toward the same goal: getting oxygen to tissues and getting carbon dioxide out. The respiratory system is involved in supplying oxygen to the blood and removing carbon dioxide."}]