[{"url": "http://faculty-salaries.startclass.com/l/3251/Illinois-Institute-of-Technology", "passage_text": "Professors at Illinois Institute of Technology have an average annual salary of $176,515. This salary is a projection of salary for teaching a full twelve month year. The average annual salary for male professors is $181,300, which is $93,538 more than the average for male professors at universities. Professors at Illinois Institute of Technology make on average $132,386 over the course of nine months, the typical contract for an academic year. This is $81,380 more than the average university professor's nine month salary ($51,006)."}, {"url": "http://www.american-school-search.com/faculty/illinois-institute-of-technology", "passage_text": "In this report for Illinois Institute of Technology we provide you with information about faculty structure, salaries, and class sizes, as well as comparisons to competing and nearby colleges. As a rule, properly compensated instructors are better motivated and have more opportunities to concentrate on teaching; therefore, we consider faculty compensation to be an important factor for evaluating education quality."}, {"url": "http://www.collegefactual.com/colleges/illinois-institute-of-technology/academic-life/academic-majors/engineering/", "passage_text": "Across all specializations under the umbrella of Engineering, Illinois Institute of Technology awarded 277 undergraduate degrees in 2012 - 2013. None of the awards was for a degree at the associate level (2-Year). A significant percentage of degrees (25.0%) were awarded to foreign nationals. The majority of degrees (77.0%) were awarded to men."}, {"url": "http://faculty-salaries.startclass.com/l/3251/Illinois-Institute-of-Technology", "passage_text": "In 2013 professors at Illinois Institute of Technology had an average monthly salary of $14,710. This is $612 more than professors earned per month in 2012, the most recently reported prior year, and a 4.2 percent increase in monthly earnings over the previous year's average monthly salary ($14,098). Professors at Illinois Institute of Technology make on average $132,386 over the course of nine months, the typical contract for an academic year. This is $81,380 more than the average university professor's nine month salary ($51,006)."}, {"url": "http://www.salarylist.com/company/Illinois-Institute-Of-Technology-Salary.htm", "passage_text": "Illinois Institute of Technology Salary. Illinois Institute of Technology average salary is $63,195, median salary is $55,000 with a salary range from $20,010 to $480,000. Illinois Institute of Technology salaries are collected from government agencies and companies. Each salary is associated with a real job position. Illinois Institute of Technology salary is full-time annual starting salary. Intern, contractor and hourly pay scale vary from regular exempt employee. Compensation depends on work experience, job location, bonus, benefits and other factors."}, {"url": "http://faculty-salaries.startclass.com/l/3251/Illinois-Institute-of-Technology", "passage_text": "In 2013 male professors at Illinois Institute of Technology had an average nine month salary of $135,975. This is $6,945 more than male professors earned in 2012, the most recently reported prior year, and a 5.1 percent increase in earnings over the previous year's average nine month salary ($129,030). Professors at Illinois Institute of Technology make on average $132,386 over the course of nine months, the typical contract for an academic year. This is $81,380 more than the average university professor's nine month salary ($51,006)."}, {"url": "http://www.american-school-search.com/faculty/illinois-institute-of-technology", "passage_text": "Women faculty members at the school are paid $10,176 a month on average; it is a bit lower than average men faculty salaries, $11,310 a month. Illinois Institute of Technology has a pretty good, 12:1 students-to-faculty ratio. Low ratios usually imply smaller class size, more attention to students, better quality of education, and higher satisfaction both for students and instructors. High ratios are usually a sign of the opposite. As a rule, properly compensated instructors are better motivated and have more opportunities to concentrate on teaching; therefore, we consider faculty compensation to be an important factor for evaluating education quality."}, {"url": "http://faculty-salaries.startclass.com/l/3251/Illinois-Institute-of-Technology", "passage_text": "In 2013 professors at Illinois Institute of Technology had an average nine month salary of $132,386. This is $5,505 more than professors earned in 2012, the most recently reported prior year, and a 4.2 percent increase in earnings over the previous year's average nine month salary ($126,881). Professors at Illinois Institute of Technology make on average $132,386 over the course of nine months, the typical contract for an academic year. This is $81,380 more than the average university professor's nine month salary ($51,006)."}]