[{"url": "http://my.clevelandclinic.org/health/diseases_conditions/hic_Lactose_Intolerance", "passage_text": "Lactose intolerance is the inability to digest lactose, the sugar primarily found in milk and dairy products. It is caused by a shortage of lactase in the body, an enzyme produced by the small intestine that is needed to digest lactose. While lactose intolerance is not dangerous, its symptoms can be distressing. Symptoms of lactose intolerance occur when there is not enough lactase being produced by the body to digest the lactose consumed. Symptoms of lactose intolerance include nausea, cramps, gas, bloating, or diarrhea within 30 minutes to 2 hours after consuming milk or"}, {"url": "http://www.livestrong.com/article/28513-lactosefree-ingredients/", "passage_text": "Most soups and sauces are made with some form of dairy. Plain herbs and spices are safe choices. Other lactose-free ingredients include vegetable or meat soups that do not contain milk, gravies that are made with water, broth, bouillon and consomme. consommé All freshly-cooked, plain meats, fish and poultry are lactose free (meaning no dairy ingredients have been added). Meat substitutes that do not contain lactose include cooked dried beans or peas, peanut butter and other nut butters, peanuts, seeds, soy cheeses, soybean products and tofu products."}, {"url": "https://www.foodallergy.org/allergens/milk-allergy", "passage_text": "People who are lactose intolerant are missing the enzyme lactase, which breaks down lactose, a sugar found in milk and dairy products. As a result, lactose-intolerant patients are unable to digest these foods, and may experience symptoms such as nausea, cramps, gas, bloating and diarrhea. 1 Many non-dairy products contain casein (a milk derivative), listed on the ingredient labels. 2  Some specialty products made with milk substitutes (i.e., soy-, nut-or rice-based dairy products) are manufactured on equipment shared with milk. 3  Some meats may contain casein as a binder. 4  Check all labels carefully."}, {"url": "http://www.livestrong.com/article/28513-lactosefree-ingredients/", "passage_text": "People who suffer from lactose intolerance are unable to digest foods containing lactose ingredients. Lactose is the sugar that is found in milk and other milk products. People who suffer from lactose intolerance often have symptoms of gas, diarrhea and swelling in the stomach when they consume products containing lactose. There are several sources of food that are completely free of lactose ingredients. All freshly-cooked, plain meats, fish and poultry are lactose free (meaning no dairy ingredients have been added). Meat substitutes that do not contain lactose include cooked dried beans or peas, peanut butter and other nut butters, peanuts, seeds, soy cheeses, soybean products and tofu products."}, {"url": "https://www.foodallergy.org/allergens/milk-allergy", "passage_text": "1 Some brands of canned tuna fish contain casein, a milk protein. 2  Many non-dairy products contain casein (a milk derivative), listed on the ingredient labels. 3  Some specialty products made with milk substitutes (i.e., soy-, nut-or rice-based dairy products) are manufactured on equipment shared with milk. 1 Many non-dairy products contain casein (a milk derivative), listed on the ingredient labels. 2  Some specialty products made with milk substitutes (i.e., soy-, nut-or rice-based dairy products) are manufactured on equipment shared with milk. 3  Some meats may contain casein as a binder. 4  Check all labels carefully."}, {"url": "http://www.godairyfree.org/dairy-free-grocery-shopping-guide/dairy-ingredient-list-2", "passage_text": "Dairy Ingredient List. Here it is – Our handy guide to identifying milk ingredients on food labels, from the obvious to the downright obscure! The list below is from my book, Go Dairy Free: The Guide and Cookbook for Milk Allergies, Lactose Intolerance, and Casein-Free Living. Please do not rely solely on this dairy ingredient list, as it is intended for informational purposes only."}, {"url": "http://www.webmd.com/digestive-disorders/digestive-diseases-lactose-intolerance", "passage_text": "The most common foods that are high in lactose include dairy products such as milk, ice cream, and cheese. Lactose is also added to some foods, such as bread and baked goods, cereals, salad dressings, candies, and snacks. Foods that contain whey, curds, milk by-products, dry milk solids, and nonfat dry milk also contain lactose. Lactose is also present in about 20% of prescription medications, such as birth control pills (oral contraceptives), and about 6% of over-the-counter medications, such as some tablets for stomach acid and gas"}, {"url": "http://www.wegmans.com/webapp/wcs/stores/servlet/CategoryDisplay?categoryId=281567&storeId=10052&langId=-1", "passage_text": "Questionable Foods. Non-Dairy is no assurance that the product is lactose free. A product labeled Non-Dairy often means the milk fat has been replaced by a vegetable fat. Non-Dairy products may contain other ingredients, such as whey, which contain lactose."}, {"url": "http://www.webmd.com/digestive-disorders/digestive-diseases-lactose-intolerance", "passage_text": "Lactose intolerance is the inability to digest lactose, the sugar primarily found in milk and dairy products. It is caused by a shortage in the body of lactase, an enzyme produced by the small intestine, which is needed to digest lactose. While lactose intolerance is not dangerous, its symptoms can be distressing. Lactose is also added to some foods, such as bread and baked goods, cereals, salad dressings, candies, and snacks. Foods that contain whey, curds, milk by-products, dry milk solids, and nonfat dry milk also contain lactose."}]