[{"url": "http://www.cisco.com/c/en/us/td/docs/switches/lan/catalyst4500/15-1/XE_330SG/configuration/guide/config/swmacsec.html", "passage_text": "Between MACsec-capable devices, packets are encrypted on egress from the sending device, decrypted on ingress to the receiving device, and in the clear within the devices. This feature is only available between 802.1AE-capable devices. Link layer security can include both packet authentication between switches and MACsec encryption between switches (encryption is optional). Note MACsec is supported on the Catalyst 4500 series switch universal k9 image. It is not supported with the NPE license or with a LAN Base service image."}, {"url": "https://en.wikipedia.org/wiki/IEEE_802.1AE", "passage_text": "802.1AE is the IEEE MAC Security standard (also known as MACsec) which defines connectionless data confidentiality and integrity for media access independent protocols. The 802.1AE standard specifies the implementation of a MAC Security Entities (SecY) that can be thought of as part of the stations attached to the same LAN, providing secure MAC service to the client. The standard defines. 1  MACsec frame format, which is similar to the Ethernet frame, but includes additional fields:"}, {"url": "https://en.wikipedia.org/wiki/IEEE_802.1AE", "passage_text": "The IEEE 802.1AE (MACsec) standard specifies a set of protocols to meet the security requirements for protecting data traversing Ethernet LANs. This norm assures incomplete network operations by identifying unauthorized actions on a LAN and preventing communication from them. The 802.1AE standard specifies the implementation of a MAC Security Entities (SecY) that can be thought of as part of the stations attached to the same LAN, providing secure MAC service to the client. The standard defines. 1  MACsec frame format, which is similar to the Ethernet frame, but includes additional fields:"}, {"url": "http://mac-sec.blogspot.com/", "passage_text": "IEEE 802.1af provides authentication and cryptographic key distribution framework. Media Access Control (MAC) Security, often known as MACSec is a IEEE standard based protocol for securing communication among the trusted components of a 802.1 LAN. It is important to note that MACSec itself can not operate in itself to provide the promised services. It has to be used in conjunction with appropriate policies for complimentary and higher level protocol, and authentication and authorization framework and network management."}, {"url": "http://mac-sec.blogspot.com/2012/07/why-macsec.html", "passage_text": "MACSec is designed to provide the next possible solution by securing messages present on the physical media. This prevents any rogue node to interpret the message and make use of the information contained in the message. It is important to note that MACSec itself can not operate in itself to provide the promised services. It has to be used in conjunction with appropriate policies for complimentary and higher level protocol, and authentication and authorization framework and network management."}, {"url": "http://mac-sec.blogspot.com/2012/07/why-macsec.html", "passage_text": "IEEE 802.1af provides authentication and cryptographic key distribution framework. Media Access Control (MAC) Security, often known as MACSec is a IEEE standard based protocol for securing communication among the trusted components of a 802.1 LAN. It is important to note that MACSec itself can not operate in itself to provide the promised services. It has to be used in conjunction with appropriate policies for complimentary and higher level protocol, and authentication and authorization framework and network management."}, {"url": "http://mac-sec.blogspot.com/", "passage_text": "MACSec is designed to provide the next possible solution by securing messages present on the physical media. This prevents any rogue node to interpret the message and make use of the information contained in the message. It is important to note that MACSec itself can not operate in itself to provide the promised services. It has to be used in conjunction with appropriate policies for complimentary and higher level protocol, and authentication and authorization framework and network management."}, {"url": "http://www.cisco.com/c/en/us/td/docs/switches/lan/catalyst4500/15-1/XE_330SG/configuration/guide/config/swmacsec.html", "passage_text": "Note Although a Catalyst 4500-X series switch (WS-4500X-32) supports Cisco TrustSec technology, it does not support TrustSec MACsec Encryption. MACsec is the IEEE 802.1AE standard for authenticating and encrypting packets between two MACsec-capable devices. The Catalyst 4500 series switch supports 802.1AE encryption with MACsec Key Agreement (MKA) on downlink ports for encryption between the switch and host devices. Link layer security can include both packet authentication between switches and MACsec encryption between switches (encryption is optional). Note MACsec is supported on the Catalyst 4500 series switch universal k9 image. It is not supported with the NPE license or with a LAN Base service image."}, {"url": "http://www.cisco.com/c/en/us/products/collateral/ios-nx-os-software/identity-based-networking-services/deploy_guide_c17-663760.html", "passage_text": "The most direct way to terminate an IEEE 802.1X session (MACsec secured or not) is to unplug the endpoint. When the link state of the port goes down, the switch completely clears the session. If the original endpoint (or a new endpoint) plugs in, the switch will restart authentication from the beginning. The high-level functional sequence in Figure 5 shows how the components and protocols of MACsec work together. The message exchange is divided into three stages: master key distribution, session key agreement, and session secured. A fourth stage, session termination, is not shown."}]