[{"url": "http://www.oxforddictionaries.com/definition/english/areola", "passage_text": "noun (plural areolae əˈriːəliː). 1 Anatomy A small circular area, in particular the ring of pigmented skin surrounding a nipple. Example sentences. 1  They are encircled by a pigmented ring called the areola, and surrounded by nerve endings and blood vessels."}, {"url": "http://www.wisegeekhealth.com/what-is-an-areola.htm", "passage_text": "Top 10 facts about the world. When used as an anatomical term, areola can refer to any round area, but it is most commonly used to refer to the circular, pigmented area around the human nipple. Though areolas are present in men, women, boys and girls, they are larger and usually darker in color in women."}, {"url": "https://en.wikipedia.org/wiki/Areola", "passage_text": "In anatomy, the areola (/əˈriːələ/ or /ɛriːˈoʊlə/) is a small circular area on the body with a different histology from the surrounding tissue."}, {"url": "http://www.merriam-webster.com/dictionary/areola", "passage_text": "Definition of AREOLA. : a small area between things or about something; especially: a colored ring (as about the nipple, a vesicle, or a pustule). — are·o·lar \\-lər\\ adjective. — are·o·late \\-lət"}, {"url": "http://www.wisegeekhealth.com/what-is-an-areola.htm", "passage_text": "Glands in the areola help lubricate the breast during nursing. Jogger's nipple may occur when the areola is irritated by clothing during jogging. Areola refers to the circular, pigmented area surrounding the human nipple. Some diseases can occur that are specific to the areola and nipple."}, {"url": "http://www.merriam-webster.com/dictionary/areola", "passage_text": "Medical Definition of AREOLA. : a small area between things or about something: as a: the colored ring around the nipple or around a vesicle or pustule b: the portion of the iris that borders the pupil of the eye."}, {"url": "http://www.thefreedictionary.com/areolas", "passage_text": "areola-small circular area such as that around the human nipple or an inflamed area around a pimple or insect bite. ring of color. region, area-a part of an animal that has a special function or is supplied by a given artery or nerve; in the abdominal region."}, {"url": "http://www.thefreedictionary.com/areola", "passage_text": "areola-small circular area such as that around the human nipple or an inflamed area around a pimple or insect bite. ring of color. region, area-a part of an animal that has a special function or is supplied by a given artery or nerve; in the abdominal region."}]