[{"url": "http://www.bbc.co.uk/bitesize/ks3/geography/physical_processes/rivers_flooding/revision/3/", "passage_text": "A river basin or drainage basin is an area of land drained by a river and its tributaries [tributary: Streams or rivers which join another river.] . The edge of the drainage basin is known as the watershed [watershed: The place that divides two river basins.] ."}, {"url": "http://www.thefreedictionary.com/drainage+basin", "passage_text": "Noun. 1. drainage basin-the entire geographical area drained by a river and its tributaries; an area characterized by all runoff being conveyed to the same outlet; flood control in the Missouri basin. catchment area, catchment basin, drainage area, river basin, watershed, basin."}, {"url": "http://greenfieldgeography.wikispaces.com/Drainage+basins", "passage_text": "Drainage basin: The area drained by a river and its tributaries. A drainage basin is considered to be an open system because water can be added or lost from a drainage basin. Source: The beginning of a river. A river may have multiple sources. The source of a river is normally found in upland mountainous areas."}, {"url": "http://www.thefreedictionary.com/basin", "passage_text": "4. basin-the entire geographical area drained by a river and its tributaries; an area characterized by all runoff being conveyed to the same outlet; flood control in the Missouri basin. catchment area, catchment basin, drainage area, drainage basin, river basin, watershed."}, {"url": "http://www.thefreedictionary.com/basin", "passage_text": "basin-the entire geographical area drained by a river and its tributaries; an area characterized by all runoff being conveyed to the same outlet; flood control in the Missouri basin. catchment area, catchment basin, drainage area, drainage basin, river basin, watershed."}, {"url": "http://www.geography-dictionary.org/drainage_basin", "passage_text": "Glossary of water terms. land area where precipitation runs off into streams, rivers, lakes, and reservoirs. It is a land feature that can be identified by tracing a line along the highest elevations between two areas on a map, often a ridge."}]