[{"url": "http://www.hummingbirdsociety.org/hummingbird-flowers/", "passage_text": "Hummingbird favorites usually but not always have long, tubular blossoms that are red, orange, yellow or blue, especially blue Salvia species; the shape limits insect access to the nectar inside. Hummers like blossoms with lots of concentrated nectar, preferring sucrose. Hummingbird Flowers-The Best 18 Plant Families for Natural Nectar. This is Nature's way. Keep something in bloom continuously during the time hummingbirds are expected in your area."}, {"url": "http://www.dianeseeds.com/flowers/hummingbirds.html", "passage_text": "Digitalis (Foxglove) -- The tubular flowers attract hummingbirds, and the plants grow in full sun or part shade. I was surprised to see a hummingbird sipping on the pale yellow Digitalis lutea. That's what I call hummingbird broccoli. Eupatorium maculatum (Joe-Pye Weed) -- A native perennial that blooms in the fall. Ipomoea (Morning Glory) -- Hummingbirds are more attracted to the red varieties like Ipomoea luteola, but all colors are good. Ipomopsis rubra (Standing Cypress) -- Chocolate cake for hummingbirds. Liatris (Blazing Star) -- Tall spikes of purple flowers for hummingbirds and butterflies."}, {"url": "http://howtoenjoyhummingbirds.com/attracting-hummingbirds/", "passage_text": "Types of hanging flowers that attract hummingbirds. A couple types of hanging flowers that attract hummingbirds, that I like to use in hanging baskets, are red Petunias and red Fuchsias. Another choice readily available in hanging baskets, that comes in red, is Impatiens. Impatiens are good for attracting"}, {"url": "http://www.almanac.com/content/plants-attract-hummingbirds", "passage_text": "For centuries, gardeners have been fascinated with the beauty and aerobatics of hummingbirds. This article will show which types of plants will attract hummingbirds and how to create a friendly environment for them in your garden. Attracting Hummingbirds. The key to attracting hummingbirds to your yard is to plant lots of flowers and provide the habitat that will give them shade, shelter, food, and security. 1  Herbs, flowering shrubs, dwarf trees, and vines all can be used to create an ideal tiered habitat from ground level to 10 feet or more."}, {"url": "http://homeguides.sfgate.com/common-hanging-plants-attract-hummingbirds-34541.html", "passage_text": "Hanging plants with bright colors and flowers with long tubules attract hummingbirds. Eating on the go, hummingbirds are not ground feeders, but instead take their nutrition while hovering before a flower. "}, {"url": "http://www.almanac.com/content/plants-attract-hummingbirds", "passage_text": "1 Brightly–colored flowers that are tubular hold the most nectar, and are particularly attractive to hummingbirds. 2  These include perennials such as bee balms, columbines, daylilies, and lupines; biennials such as foxgloves and hollyhocks; and many annuals, including cleomes, impatiens, and petunias. Attracting Hummingbirds. The key to attracting hummingbirds to your yard is to plant lots of flowers and provide the habitat that will give them shade, shelter, food, and security. 1  Herbs, flowering shrubs, dwarf trees, and vines all can be used to create an ideal tiered habitat from ground level to 10 feet or more."}, {"url": "http://www.wild-bird-watching.com/Attracting_Hummingbirds.html", "passage_text": "Tweet. When it comes to attracting hummingbirds, everyone wants to know what types of flowers and plants do these birds like best. And with good reason These birds can be a joy to watch as they hover and flit from flower to flower. You want to create a hummingbird garden, and I say, good for you! You're taking the next step to providing for these birds in a natural kind of way. But before you run out and get a bunch of flowers they love, A word of caution. Be careful about what plants you choose."}, {"url": "http://www.wild-bird-watching.com/Attracting_Hummingbirds.html", "passage_text": "Cypress vine. Weigela. When gardening to attract hummingbirds, select a variety of flowers and plants with different bloom times, spring, early summer, late summer, and fall. Read the labels of any plants you purchase or ask the staff at your local garden center for this type of information. You want to create a hummingbird garden, and I say, good for you! You're taking the next step to providing for these birds in a natural kind of way. But before you run out and get a bunch of flowers they love, A word of caution. Be careful about what plants you choose."}, {"url": "http://landscaping.about.com/cs/forthebirds/a/hummingbirds.htm", "passage_text": "In the following list of flowers commonly used for attracting hummingbirds, you'll see lots of red flowers, but also flowers in purple, white, orange, pink and blue. They're all rich in nectar, the hummingbird food par excellence. Nor is the diversity of plants for attracting hummingbirds restricted to color. Annuals and perennials, vines, shrubs, trees, bedding plants and hanging plants: you can choose from all these categories in selecting flowers for attracting hummingbirds. "}]