[{"url": "https://paindoctor.com/treatments/lumbar-medial-branch-block/", "passage_text": "A lumbar medial branch block is a diagnostic procedure used to discern the etiology of chronic back pain related to the lumbar area of the spinal column. It involves injection of a local anesthetic near or around the medial branch nerves of the lumbar spine. A lumbar medial branch block can be administered in 15 to 30 minutes. The procedure can be performed in the ambulatory surgery wing of a hospital or clinic. The vital signs and pain scores of the patient are monitored for at least 30 minutes post injection in a recovery area."}, {"url": "http://www.brighamandwomens.org/Departments_and_Services/anesthesiology/Pain/Patients/blocks1.aspx", "passage_text": "What is a facet block or medial branch block? A facet block is an injection of local anesthetic and steroid into a joint in the spine. A medial branch block is similar but the medication is placed outside the joint space near the nerve that supplies the joint called the medial branch (steroid may or may not be used). Facet blocks and medial branch blocks are typically ordered for patients who have pain primarily in their back coming from arthritic changes in the facet joints or for mechanical low back pain."}, {"url": "http://www.spine-health.com/video/medial-branch-block-video", "passage_text": "A medial branch nerve block is a type of injection used to determine if the facet joint is causing the patient's back pain. Facet joints are pairs of small joints between the vertebrae in the back of the spine. Medial Branch Block Video. Medial branch nerves are small nerves that feed out from the facet joints in the spine, and therefore carry pain signals from those joints. A medial branch nerve block temporarily interrupts the pain signal being carried from a specific facet joint. This video gives a clear picture of a medial branch block"}, {"url": "http://centralpainmgt.com/FormHandout/Handout/MedialBranchBlock.doc", "passage_text": "What is a medial branch block? A medial branch block is an injection of an anti-inflammatory steroid (e.g., dexamethasone or triamcinolone) on the medial branch nerves that supply the facet joints. The facet joints, also known as the zygapophysial joints, are part of the bony framework of the spine."}, {"url": "https://paindoctor.com/treatments/medial-branch-blocks/", "passage_text": "Medial Branch Blocks work by reducing the inflammation and irritation in the facet joints of the spine that are causing your pain. An exciting aspect of this pain relief modality is that if successful, a more long-term treatment option, radiofrequency ablation of the medial branch, can be employed. Another benefit to the use of the Medial Branch Block is its use as a diagnostic test to see if pain is coming from the joint itself. If pain disappears with the injection, it is clear that the pain originates from the joint."}, {"url": "http://www.brighamandwomens.org/Departments_and_Services/anesthesiology/Pain/Patients/blocks1.aspx", "passage_text": "A facet block or medial branch block may be therapeutic and/or diagnostic. One of three things may happen. 1. The pain does not go away-which means that the pain is probably not coming from the blocked facet joints-this has diagnostic value. Facet blocks and medial branch blocks are typically ordered for patients who have pain primarily in their back coming from arthritic changes in the facet joints or for mechanical low back pain."}, {"url": "http://www.portlandpaincare.com/patient-information/medial-branch-block", "passage_text": "A medial branch block is an injection of a strong local anesthetic on the medial branch nerves that supply the facet joints. The facet joints, also known as the zygapophysial joints, are part of the bony framework of the spine. "}, {"url": "http://www.dartmouth-hitchcock.org/pain_mgt/medial_branch_blocks.html", "passage_text": "What is a medial branch block? Medial branch nerves are very small nerve branches that carry the pain message from the facet joints and the muscles around the joints. If the nerves are blocked or numbed, they will not be able to transfer the pain sensation from the joints to the brain."}, {"url": "http://www.spine-health.com/treatment/injections/medial-branch-nerve-blocks", "passage_text": "Medial branch nerves are small nerves that feed out from the facet joints in the spine and carry pain signals from the facet joints to the brain. Watch: Medial Branch Block Video. The medial branch block is often used as part of a 2-step diagnostic and treatment approach: Role of a Medial Branch Block. A medial branch nerve block is a procedure in which an anesthetic is injected near small medial nerves connected to a specific facet joint. Typically several levels of the spine are injected in one procedure. "}]