[{"url": "http://work.chron.com/much-entry-level-pharmacy-technician-make-22675.html", "passage_text": "According to the Bureau of Labor Statistics, pharmacy technicians working in retail establishments like grocery and department stores earn between $13 and $14 per hour on average, while those in hospital pharmacies average about $16.50 an hour. Starting Salaries. Starting pay for pharmacy technicians can vary significantly depending on the area of the country and the type of establishment. On the lower end, Walter State Community College reports that starting salaries for pharmacy technicians in East Tennessee range from $7 to $9 an hour."}, {"url": "http://www.healthcare-salaries.com/technicians/pharmacy-technician-salary", "passage_text": "An average hourly wage for a certified pharmacy technician in the United States ranges from $9.03 – $16.87 per hour which can earn up to $12.11 – $25.86 overtime. The total mean annual salary ranges between $18,933 – $36,589 and a yearly bonus can go up to $1,016. Conclusion about pharmacy technician salary. The hourly wage for a Pharmacy technician with less than 1 year experience ranges from $7 to $13 per hour while the hourly wage for those with over 5 years of experience is around $17 per hour."}, {"url": "http://www.healthcare-salaries.com/technicians/pharmacy-technician-salary", "passage_text": "Average yearly salary for a pharmacy technician is about $28,400 and an hourly wage is about $13.65 per hour. Compare pharmacy technician salary with pharmacist salary. Conclusion about pharmacy technician salary. The hourly wage for a Pharmacy technician with less than 1 year experience ranges from $7 to $13 per hour while the hourly wage for those with over 5 years of experience is around $17 per hour."}, {"url": "http://www.access2knowledge.org/jobs-education/how-much-does-a-pharmacy-tech-make/", "passage_text": "How much do pharmacy techs make? According to the May 2012 records from the Bureau of Labor Statistics, the mean annual pharmacy tech salary is $30,430, which is equivalent to a $14.63 mean hourly wage for the profession. For instance, technicians employed in pharmacy and drug stores earn $28,940, while those that work within general medical or surgical hospitals make an average salary of $34,410."}, {"url": "http://www.access2knowledge.org/jobs-education/how-much-does-a-pharmacy-tech-make/", "passage_text": "The annual salary of a pharmacy technician highly depends on the industry through which they are employed. For instance, technicians employed in pharmacy and drug stores earn $28,940, while those that work within general medical or surgical hospitals make an average salary of $34,410. The highest-paying industries for this occupation are the federal government at $40,650 and outpatient care centers at $38,750 per year"}, {"url": "http://money.usnews.com/careers/best-jobs/pharmacy-technician/salary", "passage_text": "$30,430. With an average annual salary of $30,840 in 2013, pharmacy technicians don’t earn as much as some other workers in the health care field. For instance, dental hygienists earn an average wage of $71,530 per year, and radiologic technologists earn $56,760. Salary Outlook. Pharmacy technicians earned a median annual wage of $29,650 in 2013, according to the BLS. The best-paid earned $43,230, while the lowest-paid earned $20,640."}, {"url": "http://work.chron.com/much-entry-level-pharmacy-technician-make-22675.html", "passage_text": "Average National Pay. According to the Bureau of Labor Statistics, pharmacy technicians at all levels of experience earned an average wage of $14.63 an hour and an average annual salary of $30,430 per year. Starting Salaries. Starting pay for pharmacy technicians can vary significantly depending on the area of the country and the type of establishment. On the lower end, Walter State Community College reports that starting salaries for pharmacy technicians in East Tennessee range from $7 to $9 an hour."}, {"url": "http://www.scitexas.edu/blog/analysis-pharmacy-technician-salary-in-san-antonio-tx/", "passage_text": "Pharmacy Technician Salary in San Antonio TX. Pharmacy technician salary in San Antonio TX is higher than the national average — at $15.61 per hour. Pharmacy techs can expect to earn around $32,880 per year, according to the annual mean wage from the BLS, and there are around 2,650 jobs across the San Antonio-New Braunfels area. "}, {"url": "http://www.answers.com/Q/How_much_do_pharmacy_technicians_make_in_Texas", "passage_text": "According to the U.S. Bureau of Labor Statistics, the estimated  mean annual wage for pharmacy technicians as of May 2008 is  $28,500. This would amount to $13.70 per hour. … Median hourly wages  of wage and salary pharmacy technicians in May 2008 were $13.32. From the U.S. Department of Labor: According to the U.S. Bureau of Labor Statistics the estimated mean annual wage for Pharmacy Technicians as of May 2008 is, $28,500. This w … ould amount to $13.70 per hour. The middle 50 percent earned between $10.95 and $15.88"}]