[{"url": "http://www.tracys.com/whatiskata.html", "passage_text": "Kata is a series of movements and techniques that are practiced in a pattern. Kata is similar to shadow boxing except each move is prearranged and choreographed in a geometrical pattern. Each kata is designed to teach a central principle or a set of common technique. Each kata is done at a certain speed and tempo."}, {"url": "http://www.lean.org/kata/", "passage_text": "A kata typically refers to fundamental movements in Japanese martial arts, but can refer to any basic form, routine, or pattern of behavior."}, {"url": "https://en.wikipedia.org/wiki/Kata", "passage_text": "Kata are used in many traditional Japanese arts such as theater forms like kabuki and schools of tea ceremony (chado), but are most commonly known for the presence in the martial arts."}, {"url": "http://www.sandovalkarate.net/what-is-a-karate-kata/", "passage_text": "The Japanese word “kata” can translate to “mold”, “style”, “model”, or “shape” in English; all words that can be used to define the purpose of katas. This sequence of movements is designed to train the body in both offensive and defensive postures, based on ideal combat scenarios."}, {"url": "http://www.lean.org/kata/", "passage_text": "In lean management, kata refers to two linked behaviors: improvement kata and coaching kata. Improvement kata is a repeating four-step routine by which an organization improves and adapts. It makes continuous improvement through the scientific problem-solving method of plan, do, check, act (PDCA) a daily habit."}, {"url": "http://www.lean.org/Workshops/WorkshopDescription.cfm?WorkshopId=68", "passage_text": "A kata is a pattern you practice to learn a skill and mindset. Through practice the pattern of a kata becomes second nature-done with little conscious attention-and readily available. Examples are riding a bicycle, driving a car, typing. People who have learned to drive don't think much about using the car's controls."}]