[{"url": "http://usgovinfo.about.com/od/thepresidentandcabinet/a/presrequire.htm", "passage_text": "1 There is no maximum age limit set forth in the Constitution. 2  Ronald Reagan was the oldest president; at the end of his term in 1988, he was nearly 77. 3  Finally, one must live in the United States for at least 14 years to be president, in addition to being a natural-born citizen. 4  The Constitution is vague on this point."}, {"url": "http://usgovinfo.about.com/od/thepresidentandcabinet/a/presrequire.htm", "passage_text": "1 One must also be at least 35 years of age to be president. 2  John F. Kennedy was the youngest person to be elected president; he was 43 years old when he was inaugurated in 1961. 3  There is no maximum age limit set forth in the Constitution."}, {"url": "http://www.sos.la.gov/ElectionsAndVoting/PublishedDocuments/QualificationsOfCandidates.pdf", "passage_text": "By the date of qualification, the candidate shall have attained the age of 25 years, be an elector, and have been a d States and of Louisiana for at least the preceding 5 years and shall have been admitted to the practice of law in Louisiana for at least the 5 years preceding the candidate’s election."}, {"url": "http://www.indiastudychannel.com/experts/26187-Who-can-be-eligible-candidate-election.aspx", "passage_text": "Eligibility criteria for contesting state Legislative Assemblies(MLA),and for LokSabha, 1.He/She should be citizen of India,2. Minimum age for contesting in election is 25 years in both the cases, 3.Candidate should be registered as voter i."}, {"url": "https://in.answers.yahoo.com/question/index?qid=20061103214439AAkl5ly", "passage_text": "Best Answer: To become a member of the Lok Sabha, a person must definitely be a citizen of India, not less than 25 years of age. He/she should be mentally sound and should not be bankrupt. He/she should also state an affidavit that there are no criminal procedures against him/her."}, {"url": "http://www.indiastudychannel.com/experts/25627-Who-can-be-eligible-President-India.aspx", "passage_text": "The main eligibility for a person to become president of India: 1.He must be a citizen of India. 2.His age must be 35 years or above.3.He must have all qualifications to become a member of Lok Sabha.4.He must not hold an office of profit under the central or state government."}]