[{"url": "http://www.webmd.boots.com/children/guide/scarlet-fever-symptoms-diagnosis-treatment", "passage_text": "It's caused by infection with group A streptococcal bacteria-the same bacteria that causes strep throat. Symptoms of scarlet fever typically appear three days after exposure to another person with the illness, although this incubation period can be anywhere from one to seven days."}, {"url": "http://strepthroatsecrets.com/strep-throat-incubation-period/", "passage_text": "Incubation period. The strep throat incubation period can vary from person to person. Usually the incubation period lasts between one to five days, meaning that a person who was exposed to the strep bacteria can manifest symptoms after one, two, three, four or five days. Most people develop the illness three days after contact."}, {"url": "http://www.wisegeekhealth.com/what-is-the-incubation-period-for-strep-throat.htm", "passage_text": "You won't believe these 10 facts about people. Strep throat can have an incubation period that lasts between two to five days. This means a person who is exposed to the bacterium that cause this illness may develop the illness two, three, four, or five days after his exposure. In most cases, however, the incubation period for strep throat lasts for about three days."}, {"url": "http://healthresearchfunding.org/strep-throat-incubation-period/", "passage_text": "In most cases, the incubation period for strep throat will last between one to five days. This causes people who are exposed to the strep bacteria to manifest symptoms as early as one day after infection and as late as five days after infection."}, {"url": "http://www.webmd.com/oral-health/understanding-strep-throat-treatment", "passage_text": "The contagious period is over after being on antibiotics for 24 hours. Relief from the sore throat should come within 24 hours to 36 hours after you start taking antibiotics. Doctors recommend throat lozenges, acetaminophen, or ibuprofen and gargling with warm salt water to ease the pain for the first few hours."}, {"url": "http://www.bannerhealth.com/IncFiles/housecalls/peds/MouthTeethThroatSymptoms/StrepExposure.htm", "passage_text": "1 Close contact with strep: the child lives in a home where a sibling, parent or other household member has a throat culture or rapid-strep test that is positive for strep throat. 2  Usually the contact is within the previous 7 days (reason: incubation period for strep is 2 to 5 days)."}]