[{"url": "http://legal-dictionary.thefreedictionary.com/evoke", "passage_text": "These words made allusion to all the memories which Anne of Austria trembled to evoke. Ten Years Later by Dumas, Alexandre View in context. She had shown him all her favorite treasures without being able to evoke a single spark of enthusiasm. "}, {"url": "http://www.collinsdictionary.com/dictionary/english/evoke", "passage_text": "Example Sentences Including 'evoke'. There are conditions of the nerve endings, it said, the like of which your imagination, however fevered, could not hope to evoke. I walked towards the exit on the far side of the room and considered a collection of icons made to evoke the Russian Orthodox style. "}, {"url": "http://www.merriam-webster.com/dictionary/evoke", "passage_text": "Word Root of EVOKE. The Latin word vox, meaning “ voice, ” and the related word vocāre, meaning “ to call ” , give us the root voc or vok. Words from the Latin vox or vocāre have something to do with the voice or with calling. Anything voc al is produced by the voice. Full Definition of EVOKE. transitive verb. 1. : to call forth or up: as b: to cite especially with approval or for support: invoke. 2. : to re-create imaginatively. See evoke defined for English-language learners. See evoke defined for kids."}, {"url": "https://en.wiktionary.org/wiki/evoke", "passage_text": "evoke ‎(third-person singular simple present evokes, present participle evoking, simple past and past participle evoked). 1  To cause the manifestation of something (emotion, picture, etc.) in someone's mind or imagination. "}, {"url": "http://mtg.wikia.com/wiki/Evoke", "passage_text": "Evoke. 4,805 pages on this wiki. Evoke is an ability that lets you play a creature for a different cost, and then sacrifice it. Creatures with evoke have either a comes-into-play ability or a leaves-play ability. This ability was a staple in the Lorwyn Block. "}, {"url": "http://www.merriam-webster.com/dictionary/evoke", "passage_text": "Synonym Discussion of EVOKE. educe, evoke, elicit, extract, extort mean to draw out something hidden, latent, or reserved. educe implies the bringing out of something potential or latent. evoke implies a strong stimulus that arouses an emotion or an interest or recalls an image or memory. Full Definition of EVOKE. transitive verb. 1. : to call forth or up: as b: to cite especially with approval or for support: invoke. 2. : to re-create imaginatively. See evoke defined for English-language learners. See evoke defined for kids."}, {"url": "http://mtgsalvation.gamepedia.com/Evoke", "passage_text": "Rulings [edit | edit source]. 1  Playing a creature by paying its evoke cost will result in two comes-into-play abilities: The sacrifice ability from evoke, and whatever other ability the creature has. 2  The creature's controller chooses in what order to put them on the stack. 26% 21% 21% 16% 16%. Gatherer search for Evoke. Evoke is a keyword ability that allows a player to play an alternate cost for a creature spell that possesses this ability; however, if the evoke cost is paid, the creature is sacrificed when it comes into play."}, {"url": "http://writingexplained.org/evoke-vs-invoke-difference", "passage_text": "When to Use Evoke. The word evoke means to bring something forth or to recall something to the conscious mind. It typically implies some type of emotion, imagery, or memory. For example, 1  The comic strip will evoke laughter from its audience. 2  This painting evokes childhood memories. 3  His story evoked sympathy from the jury"}]