[{"url": "http://www.mccormick.com/gourmet/spices-and-flavors/spices/chile-pepper-chipotle", "passage_text": "Chile Pepper Chipotle Chile Pepper Chipotle Chipotle chiles are smoke dried jalapenos. Jalapeños essential To mexican, cuisine add to, chili, salsas, soups, stews rubs and. marinades • 1/2 teaspoon = approximately 1 large canned chipotle pepper. • Use 1 teaspoon per 4 servings for chili, tortillo soup, chicken or pork adobo sauce or marinade."}, {"url": "http://www.chipotle-peppers.com/", "passage_text": "Chipotle Peppers: Chipotle Peppers are smoked, dried jalapenos. Jalapenos are green for most of the growing season, but turn red in the fall. Red jalapenos are sold at a premium price in Mexico, but US growers plow them into the ground. 1 Chipotle peppers are smoked dried jalapeno peppers. 2  Jalapeno peppers turn red if left to ripen long enough. 3  Chipotle peppers are dried red jalapenos. 4  Not all chipotle peppers are alike. 5  Chipotle morita is the most popular variety and is deep red in color."}, {"url": "http://www.thespicehouse.com/spices-by-category/chipotle-chile-peppers", "passage_text": "Chipotle (chip-oat-lay) peppers are smoked, dried Jalapeno jalapeño. Chiles The Spice house offers two varieties of Dried chipotle: Chiles morita And. Meco The, moritas available whole and, ground are a smaller chile with a dark red and black. color Chipotle (chip-oat-lay) peppers are smoked, dried Jalapeno jalapeño. Chiles The Spice house offers two varieties of Dried chipotle: Chiles morita And. meco"}, {"url": "http://www.chipotlepeppers.net/", "passage_text": "Chipotle peppers are a smokey, firey chili pepper made by smoking jalapeno peppers. They are a great addition to many Mexican and Southwestern dishes, including salsas, spice rubs, BBQ sauces and hot sauces. For a more mild version of the smokiness of chipotle peppers you can also try using ancho peppers. Explore more about chipotle peppers and their uses, as well as how to make your own chipotle pepper hot sauce and chipotle pepper BBQ sauces. We also provide directions for smoking jalapenos to make your own chipotle peppers and also a recipe for homemade chipotle peppers in adobo sauce"}, {"url": "http://www.wisegeek.org/what-is-a-chipotle-pepper.htm", "passage_text": "Chipotle peppers are made from smoked or dried jalapeno peppers. Chipotle peppers are often used to spice up chili. Once a jalapeno pepper is smoked or dried it is known as a chipolte pepper. Chipotle peppers can be added to tacos for heat and taste. Chipotle peppers are native to the area surrounding Mexico City."}, {"url": "https://www.penzeys.com/cgi-bin/penzeys/p-penzeyschipotle.html", "passage_text": "Chipotle peppers are rich, smoky and fairly hot. Add whole or chopped to chili, beans, sauce. Ground Chipotle Pepper is an attractive, coarse red powder, a tasty all-purpose tabletop shaker. "}, {"url": "http://www.motherearthnews.com/organic-gardening/how-to-smoke-chipotle-peppers.aspx", "passage_text": "By Barbara Pleasant. Tags: peppers, chipotles, drying food, food storage, biochar. A chipotle pepper is a jalapeno that has been smoked, a food preservation method as old as agriculture itself. With a bumper crop of jalapenos, pimentos and roasting peppers in need of attention, I smoked two batches of peppers in my biochar trench, with wonderful results. Here’s my report. "}, {"url": "http://www.chipotle-peppers.com/", "passage_text": "Chipotle peppers are made primarily in Chihuahua, Mexico, although they are produced in much of Mexico and in the US today. Chipotle Morita is the name given to the peppers produced in Chihuahua. 1 Chipotle peppers are smoked dried jalapeno peppers. 2  Jalapeno peppers turn red if left to ripen long enough. 3  Chipotle peppers are dried red jalapenos. 4  Not all chipotle peppers are alike. 5  Chipotle morita is the most popular variety and is deep red in color."}, {"url": "http://allrecipes.com/recipes/2280/fruits-and-vegetables/vegetables/chile-peppers/chipotle/", "passage_text": "Wonderful for entertaining, this high volume hummus recipe is made with chipotle pepper, roasted red peppers, and sun dried tomatoes. The Middle-Eastern-inspired dip is a beautiful color and has a smoky, bright flavor. Serve with pita chips and fresh vegetables. "}]