[{"url": "http://www.healthcareworkersalary.com/physicians/pediatrician-salary/", "passage_text": "On average, a pediatrician earns about $176,000 compared to over $300,000 for a radiologist. The median 50% makes between $150,000 and $210,000. The lowest 10th percentile earns about $130,000 per annum and the highest 10th percentile earns about $237,000 per annum. Factors such as place of employment (private practice, hospital or public sector), size of institution, location of job, number of years of experience as a pediatrician and specialization. The average annual salary is around $176,000. In hourly terms, the earnings come around to an average of $85 per hour."}, {"url": "http://www.wikiprofessional.org/Pediatrician_Salary", "passage_text": "How much does a pediatrician make? The U.S. Bureau of Labor Statistics (BLS) says the median hourly wage of a general pediatrician in 2012 was more than $74 an hour, or nearly $155,000 a year. Most pediatricians work in private physician offices and deal with fairly long work days and demanding schedules. "}, {"url": "http://www.healthcare-salaries.com/physicians/pediatrician-salary", "passage_text": "According to percentiles, the median salary for 90th percentile of pediatricians has been around $222,815 per year. Similarly, about 75th percentile of pediatricians received about $198,344, 25th percentile of them received $152,178 while 10th percentile received $134,616 per year. The salary is also dependent on the location of the employer. The minimum salary for a pediatrician with a master’s degree is ZAR 40,000 on a monthly basis. The maximum salary a pediatrician earns is also ZAR 40,000 on a monthly basis. Thus on average the pay scale for a pediatrician with a master’s degree in South Africa is ZAR 40,000 per month. Subsequently, that translates to approximately ZAR 480,000"}, {"url": "http://www.mommd.com/pediatric-salary.shtml", "passage_text": "For a pediatrician out of residency for just a few years the average starting salary is around $135,000, while overall the average pediatrician salary is in the area of $175,000 a year. As with any medical career, a major determinant of salary is the level of specialization. While the average salary for pediatricians is around $175,000, that of pediatric specialists is typically higher. Pediatricians with at least 3 years experience who are specialized in neurology or oncology/hematology can typically earn up to $250,000, while pediatric surgeons typically earn $400,000-$500"}, {"url": "http://work.chron.com/salary-pediatrician-medical-doctor-2172.html", "passage_text": "Pediatricians in Montana earned slightly less, averaging $216,050 per year. In Oregon, these physicians earned an average of $212,800 per year, and in South Dakota, their average salary was $211,550. Pediatricians in Utah averaged $207,540 per year. Related Reading: How to Keep a Job as a Pediatrician. Salem, Oregon had the highest average salary, at ,$244,760 per year. Pediatricians in the Toledo, Ohio metro area earned an average of $241,390 per year. Next on the list were Des Moines, Iowa; Columbia, South Carolina; and Tampa, Florida."}, {"url": "http://www.mommd.com/pediatric-salary.shtml", "passage_text": "Pediatrician Salary by Subspecialty. As with any medical career, a major determinant of salary is the level of specialization. While the average salary for pediatricians is around $175,000, that of pediatric specialists is typically higher. Pediatricians with at least 3 years experience who are specialized in neurology or oncology/hematology can typically earn up to $250,000, while pediatric surgeons typically earn $400,000-$500,000 a year"}, {"url": "http://work.chron.com/salary-pediatrician-medical-doctor-2172.html", "passage_text": "National Averages. Pediatricians in the United States earn an average annual salary of $168,650, according to May 2011 data from the Bureau of Labor Statistics (BLS). The lowest 10 percent of pediatricians reported income of $85,850 or less per year. Salem, Oregon had the highest average salary, at ,$244,760 per year. Pediatricians in the Toledo, Ohio metro area earned an average of $241,390 per year. Next on the list were Des Moines, Iowa; Columbia, South Carolina; and Tampa, Florida."}, {"url": "http://www.healthcare-salaries.com/physicians/pediatrician-salary", "passage_text": "The overall median salary for a typical pediatrician in the United States is about $171,467 per year while an average hourly wage is about $40.76 per hour. The salary is also dependent on the location of the employer. The minimum salary for a pediatrician with a master’s degree is ZAR 40,000 on a monthly basis. The maximum salary a pediatrician earns is also ZAR 40,000 on a monthly basis. Thus on average the pay scale for a pediatrician with a master’s degree in South Africa is ZAR 40,000 per month. Subsequently, that translates to approximately ZAR 480,000 per yea"}, {"url": "http://www1.salary.com/Pediatric-Physician-Salary.html", "passage_text": "For example the median expected annual pay for a typical Physician-Pediatrics in the United States is $181,714 so 50% of the people who perform the job of Physician-Pediatrics in the United States are expected to make less than $181,714. "}]