[{"url": "http://www.medicinenet.com/torn_acl/page5.htm", "passage_text": "It may take six to nine months to return to full activity after surgery to reconstruct an ACL injury. The first three weeks concentrate on gradually increasing knee range of motion in a controlled way. The new ligament needs time to heal and care is taken not to rip the graft. "}, {"url": "http://uscenterforsportsmedicine.com/how-long-will-it-take-my-anterior-cruciate-ligament-injury-to-heal/", "passage_text": "Still, the longer the knee can be given to heal the stronger it will be and the less likely you will re-injure it. In fact, your new knee ligament continues to heal for up to a year, meaning it won’t be as strong at nine months as it will be at twelve months. The longer you wait, the better. "}, {"url": "http://www.webmd.com/pain-management/knee-pain/news/20060324/torn-knee-ligament-can-be-healed", "passage_text": "March 24, 2006 -- A torn ACL in the knee can be replaced -- but it can't be healed. A new technique now shows promise to change this. Doctors long ago gave up trying to repair a torn ACL (anterior cruciate ligament). "}, {"url": "http://www.wikihow.com/Heal-a-Torn-Dog-ACL-Without-Surgery", "passage_text": "2. Heal your dog's torn ACL ligament by reducing its body weight. The ACL is meant to stabilize the leg and provide support during weight bearing activities. High body weight is a risk factor and a leading cause of ACL injury, because of the extra stress placed on the ligament by an overweight body. 1 In the case of a severe ACL injury with inflammation, exercise should be postponed until after you give your dog some NSAIDs to reduce pain. 2  If your dog has a severely torn ACL, specialized hydrotherapy (walking/swimming in water) is recommended."}, {"url": "https://www.healthtap.com/topics/how-long-does-a-torn-acl-take-to-heal", "passage_text": "Well: After any surgery, it takes time to heal from it. Most people with ACL repair surgeries will take 3-4 months to feel like the knee feels stable and stronger as the graft sets in. It can take up to 9 months to fully heal. Following your doctor's orders are key and when rehab starts follow it to a T. You will do just fine. Most people with ACL repair surgeries will take 3-4 months to feel like the knee feels stable and stronger as the graft sets in. It can take up to 9-12 months to fully heal. Following your doctor's orders are key and when rehab starts follow it to a T. You will do just fine. If you are concerned talk to your doctor."}, {"url": "http://www.themedicalquestions.com/illness/how-long-does-it-take-for-a-acl-tear-to-heal.html", "passage_text": "How long does it take for a ACL tear to heal. The average recovery from ACL tear takes 6-9 months, one of the most common knee injuries suffered by athletes. ChaCha on! [ Source: http://www.chacha.com/question/how-long-does-it-take-for-a-acl-tear-to-heal ]. Q: I tore my acl in soccer about 2 weeks ago and let me tell u how much pain i am in. Is this normal? at first they told me it was just a fracture then i saw the specialist. How long does it take to heal? I have my friends wedding in 2 weeks will i be able to walk down the aile with out the crutches??"}, {"url": "https://www.healthtap.com/topics/how-long-does-a-torn-acl-take-to-heal", "passage_text": "Possible: After any surgery, it takes time to heal from it. Most people with ACL repair surgeries will take 3-4 months to feel like the knee feels stable and stronger as the graft sets in. It can take up to 9-12 months to fully heal. Following your doctor's orders are key and when rehab starts follow it to a T. You will do just fine. If you are concerned talk to your doctor."}, {"url": "http://www.webmd.com/pain-management/knee-pain/news/20100721/torn-acl-may-heal-without-surgery", "passage_text": "July 21, 2010 -- Many patients with a torn ACL -- the ligament that stabilizes the knee -- may avoid surgery by delaying the operation and first giving physical therapy a try. One of the most feared sports and work injuries is a torn anterior cruciate ligament or ACL. It's the tough piece of tissue that keeps the knee from bending sideways when you plant your foot and pivot. Nobody is exactly sure of the best way to treat a torn ACL. Yet every year, at least 200,000 Americans undergo ACL reconstruction, in which the ACL is restored with tendon grafts. Most patients undergo this surgery soon after their injury"}, {"url": "http://www.mcrh.org/ACL/75968.htm", "passage_text": "Approximately 6 months to return to sports that involve cutting and pivoting (basketball, football, soccer, etc.). And then you aren't fully recovered. Things such as running can be done without a repaired ACL, but you can usually get back to them in 2 months. To fully heal and return to normal takes about a year. It's tough to gain all of your strength back as well, that could take years, or never happen."}, {"url": "https://www.ucsfhealth.org/conditions/mcl_tear/treatment.html", "passage_text": "Treatment. On average, it takes six weeks for a MCL injury to heal. The initial treatment for most grade 1, 2 or 3 MCL tears focuses on reducing the pain and inflammation in the knee while immobilizing the knee to keep it stabilized. "}]