[{"url": "http://www.fs.fed.us/wildflowers/pollinators/Monarch_Butterfly/habitat/", "passage_text": "Importance of Milkweed. Many butterflies have a single plant required as a food source for their larval form called a host plant. Milkweed is the host plant for the monarch butterfly. Without milkweed, the larva would not be able to develop into a butterfly. Monarchs use a variety of milkweeds. Monarch larvae ,or caterpillars, feed exclusively on milkweed leaves. "}, {"url": "http://www.gardens.si.edu/our-gardens/butterfly-habitat-garden.html", "passage_text": "Emphasizes natural plant/butterfly partnerships. A significant objective in the Butterfly Habitat Garden is to emphasize natural plant/butterfly partnerships. Plant labels provide a plant's botanical name, common name, region of origin and indicates the specific life cycle it supports. (nectar plants support the adult butterfly and host plants support an immature stage: egg, larva, pupa)."}, {"url": "http://factsaboutbutterflies.net/butterfly-habitat/", "passage_text": "In particular, monarch caterpillars eat milkweed because it makes them an unpleasant-tasting meal to predators. For the butterflies, which are able to suck and are unable to chew, you should include nectar plants with different colors of flowers, such as zinnias, lilacs, and the butterfly bush. Facts About Butterflies. Natural butterfly habitats have been destroyed or affected by construction of housing and shopping developments, as well as by the use of pesticides and other chemicals."}, {"url": "http://animalstime.com/butterfly-facts-kids-butterfly-habitat-diet/", "passage_text": "Here are the most spectacular butterfly facts for kids including butterfly habitat, diet, and reproduction. Fundamentally speaking, a butterfly is a day-flying insect belongs to the Lepidoptera order. There are four parts of the butterfly’s lifecycle namely; egg, larva, pupa and adult. Nearly all species are diurnal. Butterfly Migration. Most species are known to cover great distances. One of the most well-known species is called Monarch butterfly from Mexico to Southern Canada and northern America, a distance of about 4,000 – 4,800 km (2,500 – 3,000 miles)."}, {"url": "http://www.raisingbutterflies.org/habitat/", "passage_text": "A forest is an area with a high density of trees. Forest habitat can be common from the Midwestern prairies east to the eastern seaboard. Many butterfly species fly around the periphery of forested areas. One of the best habitats to visit in the Western U.S. is mountain canyons--especially in canyons with running water. With water comes a wide variety of plants that support butterflies."}, {"url": "http://www.raisingbutterflies.org/habitat/", "passage_text": "There are many types of butterfly habitat. The common element to these habitats usually is the availability of plants that provide a nectar source for adult butterflies and a food source for caterpillars. One of the best habitats to visit in the Western U.S. is mountain canyons--especially in canyons with running water. With water comes a wide variety of plants that support butterflies."}, {"url": "http://www.answers.com/Q/What_is_a_Butterflys_habitat", "passage_text": "the butterfly lives in the trees and plants. Lepidoptera larvae (butterfly) are usually found on their food plant, but may be well hidden. They can often be found by looking for damaged leaves. Frass may be visible around the base of the plant or under a tree."}, {"url": "http://factsaboutbutterflies.net/butterfly-habitat/", "passage_text": "You can provide a suitable butterfly habitat that will help fortify the butterfly population, and as an added bonus, the habitat will bring you enjoyment in watching beautiful butterflies in your yard. The butterfly habitat should be relatively sunny (5-6 hours per day) and out of the wind. Facts About Butterflies. Natural butterfly habitats have been destroyed or affected by construction of housing and shopping developments, as well as by the use of pesticides and other chemicals."}, {"url": "http://www.answers.com/Q/What_is_a_Butterflys_habitat", "passage_text": "The Owl butterfly's habitat is in rainforests in Central and South  America. There are many species of Owl butterflies. They are a  large butterfly and can have a wingspan o … f up to 8 inches. Jane Savage. Lepidoptera larvae (butterfly) are usually found on their food plant, but may be well hidden. They can often be found by looking for damaged leaves. Frass may be visible around the base of the plant or under a tree."}]