[{"url": "http://www.aafp.org/afp/2000/0901/p1119.html", "passage_text": "The most common endogenous cause of Cushing's syndrome is Cushing's disease. Frequent clinical findings include weight gain, truncal obesity, striae, hypertension, glucose intolerance and infections. The syndrome is most commonly caused by the therapeutic administration of exogenous glucocorticoids. 1 The term “Cushing's disease” is reserved for Cushing's syndrome that is caused by excessive secretion of adrenocorticotropin hormone (ACTH) by a pituitary tumor, usually an adenoma."}, {"url": "https://en.wikipedia.org/wiki/Ataxia", "passage_text": "Ataxia is a non-specific clinical manifestation implying dysfunction of the parts of the nervous system that coordinate movement, such as the cerebellum. Ataxia can be limited to one side of the body, which is referred to as hemiataxia. Several possible causes exist for these patterns of neurological dysfunction. Dystaxia is a mild degree of ataxia. Wilson's disease is an autosomal-recessive gene disorder whereby an alteration of the ATP7B gene results in an inability to properly excrete copper from the body. Copper accumulates in the nervous system and liver and can cause ataxia as well as other neurological and organ impairments."}, {"url": "https://en.wikipedia.org/wiki/Ataxia", "passage_text": "Ataxia (from Greek α- [a negative prefix] + -τάξις [order] = lack of order) is a neurological sign consisting of lack of voluntary coordination of muscle movements that includes gait abnormality. Wilson's disease is an autosomal-recessive gene disorder whereby an alteration of the ATP7B gene results in an inability to properly excrete copper from the body. Copper accumulates in the nervous system and liver and can cause ataxia as well as other neurological and organ impairments."}, {"url": "http://www.rightdiagnosis.com/sym/truncal_ataxia.htm", "passage_text": "Conditions listing medical symptoms: Truncal ataxia: The following list of conditions have ' Truncal ataxia ' or similar listed as a symptom in our database. This computer-generated list may be inaccurate or incomplete. Always seek prompt professional medical advice about the cause of any symptom. Some of the comorbid or associated medical symptoms for Truncal ataxia may include these symptoms: 1  Movement symptoms. 2  Muscle symptoms. 3  Musculoskeletal symptoms. 4  Nerve symptoms. 5  Coordination problems."}, {"url": "http://www.dystonia.org.uk/index.php/about-dystonia/types-of-dystonia/abdomen-dystonia", "passage_text": "Abdomen / truncal dystonia. Abdominal wall Dystonia is also known as Belly Dancer’s dyskinesia is uncontrollable and often painful muscle contractions in the abdomen. Symptoms vary but usually consist of writhing movements and contractions of the abdominal muscles. These movements can not be voluntarily suppressed"}, {"url": "http://www.rightdiagnosis.com/sym/truncal_ataxia.htm", "passage_text": "Truncal ataxia: Introduction. Truncal ataxia: ataxia may primarily involve the trunk (truncal ataxia) and the patient may not be able to sit or stand unsupported. See detailed information below for a list of 16 causes of Truncal ataxia, Symptom Checker, including diseases and drug side effect causes. Some of the comorbid or associated medical symptoms for Truncal ataxia may include these symptoms: 1  Movement symptoms. 2  Muscle symptoms. 3  Musculoskeletal symptoms. 4  Nerve symptoms. 5  Coordination problems."}, {"url": "http://www.dystonia.org.uk/index.php/about-dystonia/types-of-dystonia/abdomen-dystonia", "passage_text": "Truncal dystonia is uncontrollable and often painful muscle contractions in the trunk which may cause unusual stretching, bending or twisting of the trunk. Truncal dystonia is believed to be caused by incorrect messages from the brain to the muscles. Abdominal wall Dystonia is also known as Belly Dancer’s dyskinesia is uncontrollable and often painful muscle contractions in the abdomen. Symptoms vary but usually consist of writhing movements and contractions of the abdominal muscles."}, {"url": "http://emedicine.medscape.com/article/1893617-overview", "passage_text": "Vagotomy is an essential component of surgical management of peptic (duodenal and gastric) ulcer disease (PUD). "}, {"url": "http://medical-dictionary.thefreedictionary.com/truncal+obesity", "passage_text": "truncal obesity, obesity that preferentially affects or is located in the trunk of the body as opposed to the extremities. Obesity defined as increased waist-to-hip and waist-to-thigh ratios, waist circumference and sagittal abdominal diameter, which is accompanied by an increased risk of cardiovascular disease."}, {"url": "http://www.rightdiagnosis.com/sym/truncal_ataxia.htm", "passage_text": "Causes of Similar Symptoms to Truncal ataxia. Research the causes of these symptoms that are similar to, or related to, the symptom Truncal ataxia: 1  Vitamin E deficiency. 2  Friedreich's ataxia. 3  Olivopontocerebellar degeneration (1 cause). 4  Dystonia musculorum deformans. 5  Torsion dystonia. Some of the comorbid or associated medical symptoms for Truncal ataxia may include these symptoms: 1  Movement symptoms. 2  Muscle symptoms. 3  Musculoskeletal symptoms. 4  Nerve symptoms. 5  Coordination problems."}]