[{"url": "http://www.searchforancestors.com/surnames/origin/", "passage_text": "The use of a surname was originally adopted in order to distinguish two individuals with the same first name, and, at first, these last names were not passed down to the next generation. In Europe, the first surnames were first used about eight hundred years ago."}, {"url": "http://www.merriam-webster.com/dictionary/surname", "passage_text": "Full Definition of SURNAME. 1. : an added name derived from occupation or other circumstance: nickname 1. 2. : the name borne in common by members of a family. See surname defined for English-language learners. See surname defined for kids."}, {"url": "https://en.wikipedia.org/wiki/Surname", "passage_text": "In some cultures, including those of most Western countries, the surname or family name (last name) is placed after the personal or given name (first name). In other cultures the surname is placed first, followed by the given name or names."}, {"url": "http://surnames.behindthename.com/names/usage/english", "passage_text": "Habitational name for someone from Brackenrig in Lanarkshire, named with the northern Middle English braken meaning bracken (from the Old Norse braekni), brækni and rigg meaning (ridge from The Old norse), hryggr or from a similarly named place located in Northern. england"}, {"url": "https://en.wikipedia.org/wiki/Surname", "passage_text": "In most Spanish-speaking and Portuguese-speaking countries, two or more last names (or surnames) may be used. In China, Japan, Korea, Vietnam, Madagascar, Hungary, Nepal, parts of India and in many other East Asian countries, the family name is placed before a person's given name."}, {"url": "http://nameberry.com/list/358/Surname-Baby-Names", "passage_text": "Surname baby names have been growing in popularity for boys and girls too over the past few decades. Now, anything goes, so look for a long-lost surname in your family or even search the phone book for something you love."}, {"url": "http://english.stackexchange.com/questions/29686/surname-family-name-and-last-name", "passage_text": "Although surname is generally understood as the last name, and used in titles, this is not necessarily so: Here's a definition of surname: a name added to a person's name, as one indicating a circumstance of birth or some characteristic or achievement; epithet."}, {"url": "http://www.searchforancestors.com/surnames/origin/", "passage_text": "Surnames usually originated from one of the five following sources: (although the same surname may have multiple meanings from different sources in different places). 1  From the first name of father used with either a suffix or prefix (which differ from country to country) to identify the person as son of. 2  Examples:"}, {"url": "https://en.wikipedia.org/wiki/Surname", "passage_text": "A surname or family name is a name added to a given name. In many cases, a surname is a family name and many dictionaries define surname as a synonym of family name.. In the western hemisphere, it is commonly synonymous with last name because it is usually placed at the end of a person's"}]