[{"url": "https://en.wikipedia.org/wiki/Paramagnetism", "passage_text": "Paramagnetism is a form of magnetism whereby certain materials are attracted by an externally applied magnetic field, and form internal, induced magnetic fields in the direction of the applied magnetic field. Constituent atoms or molecules of paramagnetic materials have permanent magnetic moments (dipoles), even in the absence of an applied field. The permanent moment generally is due to the spin of unpaired electrons in atomic or molecular electron orbitals (see Magnetic moment)."}, {"url": "http://www.wisegeek.com/what-is-diamagnetic.htm", "passage_text": "Diamagnetic refers to the ability of a material to create an opposing magnetic field when exposed to a strong one. The effect is created by a change in the orbit of electrons, which generate small currents to oppose magnetism from external sources. Diamagnetism was first observed in the late-1700s, but the term was first derived in the mid-1800s by Michael Faraday, who discovered all materials show diamagnetic properties when exposed to a magnetic field. Strong superconductors make use of opposing magnetic forces today."}, {"url": "https://en.wikipedia.org/wiki/Diamagnetism", "passage_text": "Diamagnetic materials create an induced magnetic field in a direction opposite to an externally applied magnetic field, and are repelled by the applied magnetic field. In contrast, the opposite behavior is exhibited by paramagnetic materials. Diamagnetism is a quantum mechanical effect that occurs in all materials; when it is the only contribution to the magnetism the material is called a diamagnet. Unlike a ferromagnet, a diamagnet is not a permanent magnet. Its magnetic permeability is less than μ 0, the permeability of vacuum."}, {"url": "https://en.wikipedia.org/wiki/Diamagnetism", "passage_text": "Diamagnetism, to a greater or lesser degree, is a property of all materials and always makes a weak contribution to the material's response to a magnetic field. For materials that show some other form of magnetism (such as ferromagnetism or paramagnetism), the diamagnetic contribution becomes negligible. Diamagnetism is a quantum mechanical effect that occurs in all materials; when it is the only contribution to the magnetism the material is called a diamagnet. Unlike a ferromagnet, a diamagnet is not a permanent magnet. Its magnetic permeability is less than μ 0, the permeability of vacuum."}, {"url": "http://www.thefreedictionary.com/diamagnetism", "passage_text": "diamagnetism-phenomenon exhibited by materials like copper or bismuth that become magnetized in a magnetic field with a polarity opposite to the magnetic force; unlike iron they are slightly repelled by a magnet. diamagnetism. n. 1. (General Physics) the phenomenon exhibited by substances that have a relative permeability less than unity and a negative susceptibility. It is caused by the orbital motion of electrons in the atoms of the material and is unaffected by temperature."}, {"url": "https://www.nde-ed.org/EducationResources/CommunityCollege/MagParticle/Physics/MagneticMatls.htm", "passage_text": "Quizzes. Diamagnetic, Paramagnetic, and Ferromagnetic Materials. When a material is placed within a magnetic field, the magnetic forces of the material's electrons will be affected. This effect is known as Faraday's Law of Magnetic Induction. Diamagnetic materials have a weak, negative susceptibility to magnetic fields. Diamagnetic materials are slightly repelled by a magnetic field and the material does not retain the magnetic properties when the external field is removed."}, {"url": "http://hyperphysics.phy-astr.gsu.edu/hbase/solids/magpr.html", "passage_text": "Materials may be classified by their response to externally applied magnetic fields as diamagnetic, paramagnetic, or ferromagnetic. These magnetic responses differ greatly in strength. Diamagnetism is a property of all materials and opposes applied magnetic fields, but is very weak. Paramagnetism, when present, is stronger than diamagnetism and produces magnetization in the direction of the applied field, and proportional to the applied field. "}, {"url": "http://encyclopedia2.thefreedictionary.com/diamagnetism", "passage_text": "Diamagnetism. That branch of magnetism which treats of diamagnetic phenomena and of the properties of diamagnetic bodies. Diamagnetism is a property exhibited by substances with a negative magnetic susceptibility, that is, by substances which magnetize in a direction opposite to that of an applied magnetic field. A diamagnetic substance has a magnetic permeability less than 1, and is repelled when placed near a magnet. The induced magnetic moment J acquired by 1 mole of a diamagnetic substance is proportional to the intensity of the external field H, that is, J = χ H. The coefficient X is called the molar diamagnetic susceptibility and has a negative sign, since J and H have opposite directions."}, {"url": "http://chemistry.about.com/od/chemistryglossary/a/Diamagneticdef.htm", "passage_text": "Share. Definition: Descriptive term which indicates that a substance contains no unpaired electrons and thus is not attracted to a magnetic field. Examples: NH 3 is diamagnetic because all of the electrons in NH 3 are paired. Return to the Chemistry Glossary Index. By Anne Marie Helmenstine, Ph.D"}]