[{"url": "http://busycooks.about.com/od/howtocook/a/howtocookham.htm", "passage_text": "1 If you want to glaze the ham, place on a broiler pan and cover with glaze; broil 10 from the heat for 10-15 minutes, watching carefully, until glaze is cooked. 2  Oven Method. 3  The goal is to reheat the ham without drying it out. 4  The best way to do this is to place the ham on a rack in a roasting pan. 1 Make sure that the ham will fit into your slow cooker. 2  Place the ham in the appliance and add the glaze ingredients. 3  You can also just add some Coke or Pepsi, chicken broth, or water; about 1 cup will do it. 4  Cover and cook on low for 5-8 hours, until ham is thoroughly heated."}, {"url": "http://www.weber.com/weber-nation/blog/take-your-grilled-ham-to-another-level", "passage_text": "1 Do not change the cooking time on the recipe. 2  Just because you roast your ham on the grill instead of in the oven, there is no need to alter any cooking times. 3  A good rule of thumb is 12-15 minutes per pound when you stay between 225-250 degrees for a precooked ham. 1 A good rule of thumb is 12-15 minutes per pound when you stay between 225-250 degrees for a precooked ham. 2  Make sure you put your glaze on 10-15 minutes before you are going to remove your ham from the grill. 3  This will be just the right amount of time for your glaze to caramelize and brown."}, {"url": "http://busycooks.about.com/od/howtocook/a/howtocookham.htm", "passage_text": "1 Bake in a preheated 325°F oven for 10-14 minutes per pound, or until a meat thermometer registers 140°F. Remove from oven and let sit for 10 minutes before serving. 2  If the ham came with extra glaze, follow the package directions for adding it and cooking the glaze. 1 Make sure that the ham will fit into your slow cooker. 2  Place the ham in the appliance and add the glaze ingredients. 3  You can also just add some Coke or Pepsi, chicken broth, or water; about 1 cup will do it. 4  Cover and cook on low for 5-8 hours, until ham is thoroughly heated."}, {"url": "http://www.wikihow.com/Bake-a-Ham", "passage_text": "Place the ham in the preheated oven for baking. The amount of cooking time will depend on the size off the ham and whether it has been pre-cooked or not. Follow the guidelines below for cooking times: 1  Bake a partially-or fully-cooked preserved ham for 10 minutes per pound (0.5 kg) to reheat the ham completely through. 2  Bake a preserved ham that has not been precooked at all for 20 minutes per pound (0.5 kg)."}, {"url": "http://ochef.com/473.htm", "passage_text": "It is 15 lbs. A precooked ham does not have to be cooked, but will taste better if you heat it thoroughly to an internal temperature of 140°F (60°C) or so. Place the ham in a 325°F oven (163°C). It will take 12 to 15 minutes per pound for a whole or boneless ham and 18 to 20 minutes per pound for a half ham. You should also let it rest for 20 minutes or so out of the oven before you serve it"}, {"url": "http://busycooks.about.com/od/howtocook/a/howtocookham.htm", "passage_text": "1 Bake at 325°F for 18-20 minutes per pound, until a meat thermometer registers 140°F. 2  Unwrap the ham and apply the glaze; increase the heat to 400°F and bake for 15-20 minutes longer until the glaze is burnished. 1 Make sure that the ham will fit into your slow cooker. 2  Place the ham in the appliance and add the glaze ingredients. 3  You can also just add some Coke or Pepsi, chicken broth, or water; about 1 cup will do it. 4  Cover and cook on low for 5-8 hours, until ham is thoroughly heated."}, {"url": "http://www.answers.com/Q/How_long_do_you_cook_a_precooked_or_smoked_ham", "passage_text": "2 1/2 hours. Here's how: Preheat the oven to 325, place the ham on a rack in a baking dish with a little water in the bottom. Wrap in foil, bake for about 2 hours, or until th … e internal temperature is 135 - 140 degrees. Duh. You do not need to cook precooked ham. This is not a duh question... You need to at least bake it or put it on the pit (indirect heat) at 350 degrees for about 7 minute … s per pound."}, {"url": "http://southernfood.about.com/cs/hamrecipes/ht/heat_ham.htm", "passage_text": "1 Preheat the oven to 350°F. 2  If the ham is labeled 'fully cooked' (does not require heating), heat for 8 to 10 minutes per pound, or to an internal temperature of 140°F. 3  If the ham is labeled 'cook before eating,' heat to an internal temperature of 160°F. 1 First, check the label for instructions. 2  It should be labeled 'fully cooked' or 'cook before eating.'. 3  Preheat the oven to 350°F. 4"}, {"url": "http://www.weber.com/weber-nation/blog/take-your-grilled-ham-to-another-level", "passage_text": "1 Just because you roast your ham on the grill instead of in the oven, there is no need to alter any cooking times. 2  A good rule of thumb is 12-15 minutes per pound when you stay between 225-250 degrees for a precooked ham. 1 A good rule of thumb is 12-15 minutes per pound when you stay between 225-250 degrees for a precooked ham. 2  Make sure you put your glaze on 10-15 minutes before you are going to remove your ham from the grill. 3  This will be just the right amount of time for your glaze to caramelize and brown."}]