[{"url": "https://www.expedia.com/Weihai-Hotels.d3775.Travel-Guide-Hotels", "passage_text": "The Weihai area isn’t only for leisure. Business travelers are fond of Weihai Sweetome Vacation Rental (Longhai International). If you’d like to tap into some local knowledge, check out Weihai Sweetome Vacation Rental (Lotte Century City), a popular choice with local travelers. Locals also like to book rooms at the 5-star Haiyue Jianguo Hotel in Weihai. If you’d like to tap into some local knowledge, check out Weihai Sweetome Vacation Rental (Lotte Century City) , a popular choice with local travelers. Locals also like to book rooms at the 5-star Haiyue Jianguo Hotel in Weihai. More Top Weihai Hotels."}, {"url": "http://wikitravel.org/en/Weihai", "passage_text": "Weihai 威海 (pop:2,500,000) is a city in Shandong Province, North East China. It is located near the tip of the Shandong Peninsula, facing the Bohai Sea. Beaches, Weihai is by the coast and has many nice beaches.Weihai has lots of beautiful parks .Such as Weihai Park,Huancuilou park and so on. Town Hall, In the city centre are the municipal buildings in front of which is a large and stately promenade."}, {"url": "https://en.wikipedia.org/wiki/Shandong", "passage_text": "Weihai Export & Processing Zone (EPZ) was set up by the approval of the State Council on April 27, 2000. Weihai EPZ is located in Weihai Economic & Technological Development Zone with programmed area of 2.6 km 2 (1.0 sq mi). Weihai EPZ belongs to comprehensive export & processing zone. The EPZ is located 30 km (19 mi) to Weihai Airport, 3 km (1.9 mi) to Weihai Railway Station and 4 km (2.5 mi) to Weihai Harbor. Yantai Economic and Technological Development Area is one of the earliest approved state level economic development zones in China. It now has planned area of 10 km 2 (3.9 sq mi) and a population of 115,000."}, {"url": "http://yuanweifishing.com/", "passage_text": "Weihai Yuanwei Fishing Tackle Co.,Ltd. is located in the beautiful city-Weihai ,China. It was established in 1998,speciallized in the manufacturer of the fishing rods .Our products have been worldwidely accepted and are dreaming to be used by anglers. Our rods are enjoying their reputation on their lightness ,flexibility ,reasonalbe structure and the waterproof and sunproof feather."}, {"url": "https://en.wikipedia.org/wiki/Weihai", "passage_text": "Weihai's population was 2,804,800 at the 2010 census. Of those, 591,982 live in the built up area (Huancui urban district). Rongcheng, a county-level city within Weihai, has a built up area with 1,006,795 inhabitants. Weihai Torch Hi-Tech Science Park is a state-level development zone approved by the State Council on March 1991. Located in Weihai's northwest zone of culture, education and science, the Park has the total area of 111.9 km 2 (43.2 sq mi), a coastline of 30.5 km (19.0 mi) and 150,000 residents."}, {"url": "http://wikitravel.org/en/Weihai", "passage_text": "1 You can read about it here: http://www.travelblog.org/Asia/China/Shandong/Weihai/blog-554039.html. 2  The address is Yuan Zhong Yuan 2-1, Yu Gang Road,Huan Cui district, Weihai, China. 3  The phone number is 0631-5333588. Beaches, Weihai is by the coast and has many nice beaches.Weihai has lots of beautiful parks .Such as Weihai Park,Huancuilou park and so on. Town Hall, In the city centre are the municipal buildings in front of which is a large and stately promenade."}, {"url": "https://en.wikipedia.org/wiki/Weihai", "passage_text": "Weihai (Chinese: 威海; pinyin: Wēihǎi, known as Port Edward from 1898 to 1930) is a city in eastern Shandong province, People's Republic of China. It is the easternmost prefecture-level city of the province and a major seaport. Weihai Torch Hi-Tech Science Park is a state-level development zone approved by the State Council on March 1991. Located in Weihai's northwest zone of culture, education and science, the Park has the total area of 111.9 km 2 (43.2 sq mi), a coastline of 30.5 km (19.0 mi) and 150,000 residents."}, {"url": "http://www.travelshandong.com/cities/weihai/", "passage_text": "Shandong Weihai, A Garden-like City by the Sea. Weihai, dubbed China’s “Garden City”, rests along the shoreline in the northeastern section of Shandong. This coastal city boasts lush forests, picturesque islands, and more than 600 miles of beachhead. Lying at the eastern foot of Naigu Mountain in Weihai City, this park offers green trees and fresh flowers that bloom all year round. In the Ming and Qing dynasties, many men of letters climbed the tower and wrote poems to praise it. The park is a best spot for viewing the sunrise."}, {"url": "https://en.wikipedia.org/wiki/Weihai", "passage_text": "Weihai Export & Processing Zone (EPZ) was set up by the approval of the State Council on April 27, 2000. Weihai EPZ is located in Weihai Economic & Technological Development Zone with programmed area of 2.6 km 2 (1.0 sq mi). Weihai EPZ belongs to comprehensive export & processing zone. Weihai Torch Hi-Tech Science Park is a state-level development zone approved by the State Council on March 1991. Located in Weihai's northwest zone of culture, education and science, the Park has the total area of 111.9 km 2 (43.2 sq mi), a coastline of 30.5 km (19.0 mi) and 150,000 residents."}]