[{"url": "https://answers.yahoo.com/question/index?qid=20080407050958AANvtn4", "passage_text": "The female turkey prepares a nest under a wooded bush to lay her eggs, incubating as many as 18 at a time. The chicks hatch approximately one month later. Because her babies are unable to fly for the first two weeks of life, the mother will roost on the ground with them during this period. Source(s): Luke · 8 years ago. "}, {"url": "http://www.answers.com/Q/How_many_eggs_do_wild_turkeys_lay", "passage_text": "How many eggs does a turkey lay in her lifetime?   Roughly 1000 eggs The average turkey will lay between 100 and 120 eggs per year and can produce eggs for up to 10 years if well cared for. Production of eggs drops as … the turkey ages. 8 people found this useful. If you collect their eggs th … ey will continue to lay,  eventually producing an average of 1 egg every 2 days for a  possible total of 80-100 eggs. Most people who breed turkeys  collect the eggs and hatch them to maximize the number of turkey  poults produced."}, {"url": "http://www.ehow.com/how_6607694_hatch-wild-turkey-eggs.html", "passage_text": "Wild turkeys can be fun to raise, and are a healthy alternative to store-bought frozen turkey. In the wild, these beautiful birds mate in late March and lay a total of nine to 12 eggs (laying one egg each day). Hens incubate them for about 28 days, and baby turkeys, called poults, leave the nest in the first 24 hours. Hatching wild turkey eggs in captivity is a very different process."}, {"url": "http://www.backyardchickens.com/t/349321/how-often-do-turkeys-lay-eggs-what-to-do-with-the-eggs", "passage_text": "average of 1 every other day, younger hens often will lay a spert of 1 a day for a few days in a row, at least mine do, after the first year, they all tend to be 1 every other day, except royal palms, those things are egg making machines. I sell or hatch all of mine and sell them as day old poults. "}, {"url": "http://www.answers.com/Q/How_many_eggs_can_a_turkey_lay", "passage_text": "Confidence votes 236. Turkeys lay from early spring to early summer, a span of about 4 months. During that time the turkey will lay 12-18 eggs and then sit on them. If you collect their eggs they will continue to lay, eventually producing an average of 1 egg every 2 days for a possible total of 80-100 eggs. Roughly 1000 eggs The average turkey will lay between 100 and 120 eggs per year and can produce eggs for up to 10 years if well cared for. Production of eggs drops as … the turkey ages. 8 people found this useful. Andrew Larson"}, {"url": "http://www.slate.com/articles/life/explainer/2012/11/why_don_t_we_eat_turkey_eggs_the_differences_among_chicken_duck_goose_and.html", "passage_text": "Because they’re expensive. Chicken hens are egg-laying dynamos, dropping one almost every day, while a turkey produces only about two per week. Chickens begin laying eggs at about five months of age, but turkeys don’t have their first cycle until more than two months later. Commercial egg producers typically, although controversially, allocate less than 50 square inches of space to a hen. A dozen chicken eggs currently cost approximately $1.61. (Cage-free eggs cost twice as much.) There’s no nationwide data on the cost of turkey eggs—the USDA doesn’t even have grading regulation for turkey eggs—but many producers sell them for $2 to $3 per egg."}, {"url": "http://www.answers.com/Q/How_many_eggs_do_wild_turkeys_lay", "passage_text": "Turkeys lay from early spring to early summer, a span of about 4  months. During that time the turkey will lay 12-18 eggs and then  sit on them. If you collect their eggs th … ey will continue to lay,  eventually producing an average of 1 egg every 2 days for a  possible total of 80-100 eggs. Most people who breed turkeys  collect the eggs and hatch them to maximize the number of turkey  poults produced."}, {"url": "https://answers.yahoo.com/question/index?qid=20061114042944AAbqerh", "passage_text": "Why there not in the stores is because..Barnyard economics, Turkeys don't lay that many eggs, and the ones they do lay are used to produce more turkeys. The average egg-laying chicken lays 300 or so eggs per year, while the average turkey produces only 100 to 120. Chickens come into production at 19 to 20 weeks of age, but turkeys don't get cranking until 32 weeks. Turkeys are also much larger, averaging 16 to 17 pounds compared to 3.5 pounds for chicken"}, {"url": "https://answers.yahoo.com/question/index?qid=20061114042944AAbqerh", "passage_text": "Best Answer: Barnyard economics, babe. Turkeys don't lay that many eggs, and the ones they do lay are used to produce more turkeys. The average egg-laying chicken lays 300 or so eggs per year, while the average turkey produces only 100 to 120. Chickens come into production at 19 to 20 weeks of age, but turkeys don't get cranking until 32 weeks. Turkeys are also much larger, averaging 16 to 17 pounds compared to 3.5 pounds for chicken"}]