[{"url": "https://en.wikipedia.org/wiki/Chinese_water_dragon", "passage_text": "¿==Description==↓ Chinese water dragons can to grow up to 1 m (3.3 ft) in total length, including tail, and can live from ten to fifteen years. Coloration ranges from dark to light green, or sometimes purple with an orange stomach. Chinese water dragon (Physignathus cocincinus) is a species of agamid lizard native to China and Indochina."}, {"url": "https://en.wikipedia.org/wiki/Australian_water_dragon", "passage_text": "Description [edit]. Australian water dragons have long powerful limbs and claws for climbing, a long muscular laterally-compressed tail for swimming, and prominent nuchal and vertebral crests. (A nuchal crest is a central row of spikes at the base of the head"}, {"url": "http://dragcave.wikia.com/wiki/Water_dragon", "passage_text": "“ Water dragons are officially Light Blue dragons, actually. Water dragons are an aquatic dragon, and one of the original breeds that appeared early in the site's history. They are common and have no breed specific action. Water dragons can produce Shallow Water Dragons and Two-Finned Blunas if bred with Magi Dragons or Skywing Dragons respectively. "}, {"url": "http://www.reptilesmagazine.com/Chinese-Water-Dragon-Care/", "passage_text": "Stores that sell reptiles often carry Chinese water dragons, also known as the green water dragon or Asian water dragon. They originate from the southeast Asian mainland — Thailand, southern China, Vietnam and Cambodia. Adult water dragons are, of course, green, ranging from a dark forest green to a light mint green. The lower body is generally white or a very light yellow, while the vertical stripes that run along the sides of the water dragon’s body are a pale green, mint green, aqua or even turquoise in color."}, {"url": "http://www.reptilesmagazine.com/Chinese-Water-Dragon-Care/", "passage_text": "Chinese water dragons eat a variety of live food items ranging from crickets, mealworms, king mealworms, waxworms, earthworms, grasshoppers, butterworms, locusts, feeder fish, pinkies and fuzzies. Many care booklets say that water dragons eat some fruit and vegetables. Adult water dragons are, of course, green, ranging from a dark forest green to a light mint green. The lower body is generally white or a very light yellow, while the vertical stripes that run along the sides of the water dragon’s body are a pale green, mint green, aqua or even turquoise in color."}, {"url": "https://en.wikipedia.org/wiki/Australian_water_dragon", "passage_text": "The Australian water dragon (Intellagama lesueurii, formerly Physignathus lesueurii), which includes the eastern water dragon (I. l. lesueurii) and the Gippsland water dragon (I. l. howittii) subspecies, is an arboreal agamid species native to eastern Australia from Victoria northwards to Queensland. Australian water dragons have long powerful limbs and claws for climbing, a long muscular laterally-compressed tail for swimming, and prominent nuchal and vertebral crests. (A nuchal crest is a central row of spikes at the base of the hea"}, {"url": "http://a-z-animals.com/animals/water-dragon/", "passage_text": "The water dragon is a large species of lizard native to the forests and jungles of Asia and Australia. Water dragons are arboreal animals meaning that they spend most of their time in the trees, often close to a large body of water. "}, {"url": "http://dragonsofatlantis.wikia.com/wiki/Water_Dragon", "passage_text": "262 pages on this wiki. The beautiful, but deadly Water Dragon is similar to the Great Dragon found in your City, except it is raised in your Water Outpost. Upgrade your Water Outpost's Dragon Keep in order to raise your new Dragon. Nurtured with care, the Water Dragon will defend your new Outpost with devotion and ferocity. "}]