[{"url": "http://www1.salary.com/Nurse-Practitioner-Salary.html", "passage_text": "For example the median expected annual pay for a typical Nurse Practitioner in the United States is $97,688, so 50% of the people who perform the job of Nurse Practitioner in the United States are expected to make less than $97,688. Source: HR Reported data as of October 2015. 1  Salary. 2  Salary + Bonus. "}, {"url": "http://www.nursepractitionerschools.com/faq/how-much-does-family-np-make", "passage_text": "” FNPs can also work collaboratively with other health-care professionals, including primary care physicians. The average family nurse practitioner salary, as of 2012, was $90,629. This pay was higher than for nurse practitioners practicing in women’s health ($82,331) or pediatrics ($83,937). Starting Salary for Family Nurse Practitionerss. Interestingly, most nurse practitioners have an average of 10 years of experience in nursing before deciding to purse the education to become a nurse practitioner."}, {"url": "http://www.hospitaljobsinc.com/how-much-does-a-nurse-practitioner-make/", "passage_text": "In addition to the type of nurse practitioner, the median annual salary will also depend on the type of healthcare industry worked in. For local, private, and state hospitals, the average annual salary for an ARNP is $94,690 or around $49.20 dollars per hour. A nurse practitioner can expect an average annual salary of $97,990 or $47.11 dollars per hour as stated above. Nurse midwives earn an average annual salary of $97,700 or around $46.97"}, {"url": "http://www.healthcare-salaries.com/nursing/nurse-practitioner-salary", "passage_text": "The nurse practitioner salary in the US ranges between $67,416 and $110,485. According to PayScale, the salary of nurse practitioner with less than a year’s experience is from $57,252 to $97,978, while one with a year to four years of experience is paid a salary ranging between $61,809 and $97,609. However, the basic pay per annum for this type of nurse practitioners is about $67,333 to $125,526. The total pay only increases with the addition of a bonus of up to $5,023 and profit sharing of up to $9,863. Read more about psychiatric nurse practitioner salary."}, {"url": "http://www.healthcare-salaries.com/nursing/pediatric-nurse-practitioner-salary", "passage_text": "The hourly rate for Pediatric Nurse Practitioner depends on number of years of experience. Pediatric Nurse Practitionerswith 1 to 4 years of work experience take home a national average hourly pay of around $39.38. Those with 5 to 9 years of experience receive a national hourly pay of around $39.57. Average pediatric nurse practitioner salary. A Pediatric Nurse Practitioner in the United States gets to collect an average income from between $59,352 to $109,355 per year. A Pediatric Nurse Practitioner can earn up to around $120,000 per annum including profit sharing and benefits/perks."}, {"url": "http://www.payscale.com/research/US/Job=Family_Nurse_Practitioner_(NP)/Salary/f4a14c57/Entry-Level", "passage_text": "Entry-Level Family Nurse Practitioner (NP) Salary. (United States). The average pay for an Entry-Level Family Nurse Practitioner (NP) is $82,611 per year. A skill in Emergency Room (ER) is associated with high pay for this job."}, {"url": "http://www.graduatenursingedu.org/south-carolina/south-carolina-salary/", "passage_text": "In the annual salary survey conducted by Advance for NPs & PAs, nurse practitioners in Columbia were shown to earn an average of $75,720, while the highest salaries in South Carolina were found in Greenville, where NPs earned $95,291 on average. The 2011 National NP Compensation Survey conducted by the American Academy of Nurse Practitioners showed that nurse practitioners in the southeastern United States, including South Carolina, earned an average base salary of $87,653 and an average total income of $96,916 when taking benefits and bonus into consideration."}, {"url": "http://www.healthcare-salaries.com/nursing/pediatric-nurse-practitioner-salary", "passage_text": "Conclusion about pediatric nurse practitioner salary. Pediatric Nurse Practitioner’s average income (pediatric nurse practitioner salary) in the United States is from between $59,352 to $109,355 per year. The national median hourly rate for all Pediatric Nurse Practitioners is $41.14. Average pediatric nurse practitioner salary. A Pediatric Nurse Practitioner in the United States gets to collect an average income from between $59,352 to $109,355 per year. A Pediatric Nurse Practitioner can earn up to around $120,000 per annum including profit sharing and benefits/perks."}, {"url": "http://www.healthcare-salaries.com/nursing/nurse-practitioner-salary", "passage_text": "Based on the type of employer, the nurse practitioner’s salary in a hospital ranges between $63,199 and $108,333. Those working in state and local government earn between $55,000 and $111,711 annually. Nurse practitioners employed by federal government make between $67,686 and $130,893 per year. However, the basic pay per annum for this type of nurse practitioners is about $67,333 to $125,526. The total pay only increases with the addition of a bonus of up to $5,023 and profit sharing of up to $9,863. Read more about psychiatric nurse practitioner salary."}]