[{"url": "https://en.wikipedia.org/wiki/Accuracy_and_precision", "passage_text": "Precision is a description of a level of measurement that yields consistent results when repeated. It is associated with the concept of  random error , a form of observational error that leads to measurable values being inconsistent when repeated. Accuracy has two definitions: 1  The more common definition is that accuracy is a level of measurement with no inherent limitation (ie. 2  free of systemic error, another form of observational error). In addition to accuracy and precision, measurements may also have a measurement resolution, which is the smallest change in the underlying physical quantity that produces a response in the measurement."}, {"url": "https://en.wikipedia.org/wiki/Accuracy_and_precision", "passage_text": "In numerical analysis, accuracy is also the nearness of a calculation to the true value; while precision is the resolution of the representation, typically defined by the number of decimal or binary digits. Statistical literature prefers to use the terms bias and variability instead of accuracy and precision. In addition to accuracy and precision, measurements may also have a measurement resolution, which is the smallest change in the underlying physical quantity that produces a response in the measurement."}, {"url": "http://www.oc.nps.edu/oc2902w/gps/gpsacc.html", "passage_text": "The PPS accuracy level is specified to be 16 m, spherical error probable (SEP). GPS position errors are always about twice as bad in height as along either horizontal axis. This means a horizontal error of about 10 m. The graph below lists the official current level. The graph shows the accuracy levels of all currently available systems. The vertical axis is the expected accuracy or error level, shown both in centimeters and meters. The horizontal axis is the distance along the earth's surface between the reference station and the remote user."}, {"url": "http://www.oc.nps.edu/oc2902w/gps/gpsacc.html", "passage_text": "This is driven by the error level on the range measurements. (See Accuracy Factors .) For standalone users, the extent use of phase is a major factor. The noise on the phase is typically 1 mm, that on the range 10 cm to 1 m. Therefore the use of phase data in any one of several ways can improve the solution. The graph shows the accuracy levels of all currently available systems. The vertical axis is the expected accuracy or error level, shown both in centimeters and meters. The horizontal axis is the distance along the earth's surface between the reference station and the remote user."}, {"url": "https://en.wikipedia.org/wiki/Spirit_level", "passage_text": "To check the accuracy of a carpenter's type level (i.e. whether the level indicates that a truly horizontal surface is, in fact, level), it is placed on a flat and roughly level surface and the reading on the bubble tube is noted. For a precision machinist level with 2mm divisions, when the vial is tilted 5 arc seconds the bubble will move one graduation. This is equivalent to movement of .0005 inches measured one foot from the pivot point; referred to as 5 ten thousands per foot."}, {"url": "http://etutorials.org/Misc/data+quality/Part+I+Understanding+Data+Accuracy/Chapter+2+Definition+of+Accurate+Data/2.3+Data+Accuracy+Defined/", "passage_text": "Data accuracy is one of the components of data quality. It refers to whether the data values stored for an object are the correct values. To be correct, a data values must be the right value and must be represented in a consistent and unambiguous form. For example, my birth date is December 13, 1941. Object-level inaccuracies consist of objects that are missing, have missing parts, or that exist but should not. For example, if a repair is done to a piece of capital equipment and the repair person just failed to complete and submit a record of the action, there would be a missing row or rows in the database."}, {"url": "https://en.wikipedia.org/wiki/Accuracy_and_precision", "passage_text": "1 The more common definition is that accuracy is a level of measurement with no inherent limitation (ie. 2  free of systemic error, another form of observational error). In addition to accuracy and precision, measurements may also have a measurement resolution, which is the smallest change in the underlying physical quantity that produces a response in the measurement."}, {"url": "http://www.yourdictionary.com/accuracy", "passage_text": "Use accuracy in a sentence. LINK / CITE ADD TO WORD LIST. noun. The definition of accuracy is the degree to which something is true or exact. A survey that represents millions of people is an example of something with a high level of accuracy. the quality or state of being accurate or exact; precision; exactness. noun. "}, {"url": "http://www.radio-electronics.com/info/satellite/gps/accuracy-errors-precision.php", "passage_text": "It is also worth defining the difference between accuracy and precision: 1  GPS accuracy: The accuracy refers to the degree of closeness the indicated readings are to the actual position. 2  GPS precision: Is the degree to which the readings can be made. 3  The smaller the circle of unknown the higher the precision. GPS accuracy is far greater than anything that was previously available, and it is sufficiently accurate for most applications. However there are GPS errors that have been significant for some applications, and much work has been undertaken to reduce the level of GPS errors to a level where they are insignificant."}]