[{"url": "http://exoticpets.about.com/cs/reptilesturtles/a/aquaticturtles.htm", "passage_text": "Aquatic and semi-aquatic turtles are popular as pets. The most well known is probably the red eared slider, although there are several other species which are kept as pets. Turtles have been popular for a long time. Many people also do not realize how big aquatic turtles can get. Red eared sliders and a couple of the other commonly available pet species will grow to at least 10-12 inches long and thus will require correspondingly large enclosures."}, {"url": "http://www.cool-small-pets.com/turtles-as-pets.html", "passage_text": "For small apartments the best, and the only proper turtle as pet is an aquatic turtle. So the size of the pet will not play a big role. Although you will need to consider getting a fairly large turtle tank. Aquatic turtles will grow from 5 to 11 inches long. All breeds eat turtle pellets. Most of the common pet turtles (red-eared sliders, painted turtles) will do well on a combination of commercial turtle pellets, fish pellets, gut loaded insects, earthworms, small fish (goldfish, guppies, and minnows), greens, and water plants."}, {"url": "http://pets.petsmart.com/guides/turtles/choosing-the-right-turtle.shtml", "passage_text": "Red Ear Slider Turtle: This water turtle is one of the most popular pets in the world! They are ideal for beginners, are omnivores and as adults, can grow up to 11 inches. Ideal for beginners 12 years and older with adult supervision. These turtles enjoy basking so they require land areas. Now that you've decided to add a turtle or tortoise to your family, your next step is figure out which species is the right one for you. There are several different types of turtles and tortoises and each has its own set of unique needs including dietary."}, {"url": "http://exoticpets.about.com/cs/reptilesturtles/a/aquaticturtles.htm", "passage_text": "Feeding. Although turtle foods have come a long way they are not recommended as a sole source of food for aquatic turtles. Most are omnivores (and preferences for different foods might change at different points in the life cycle), and offering a good variety of foods is the best way to feed most turtles. Many people also do not realize how big aquatic turtles can get. Red eared sliders and a couple of the other commonly available pet species will grow to at least 10-12 inches long and thus will require correspondingly large enclosures."}, {"url": "http://animal-world.com/encyclo/reptiles/turtles/Turtles.php", "passage_text": "Turtles that spend a good deal of time in the water usually have webbed feet for swimming. They are aquatic turtles (water turtles) or semi-aquatic (marsh and swamp type) turtles. There are also turtles that are semi-terrestrial, spending time both in the water and on the land. These 'land' turtles are also known as terrapins (the term terrapin is derived from the word terrapene, which means 'land turtle')."}, {"url": "http://www.hartz.com/Reptiles/Getting_Started/how_to_care_for_aquatic_turtles.aspx", "passage_text": "1 Turtles grow. 2  Make sure your space is suited to the size of the adult turtle you are adopting. 3  Wooden boards or bricks make great land areas as they can be cleaned easily. 4  Just make sure they stay dry and are sloped gently towards the water for easy access. Aquatic turtles are great alternatives to cats and dogs as pets. Turtles are fascinating pets to own, but they are sensitive animals so it is important to learn how to care for them before getting one. Space, light, moisture and food are all important for survival. Understanding these aspects of your pet’s care will help your turtle live a long life"}, {"url": "http://animal-world.com/encyclo/reptiles/turtles/information/SelectingYourTurtle.php", "passage_text": "Water Turtles: Aquatic and Semi-aquatic turtles. Those that are closely tied to the water which includes the aquatic turtles and also some of the semi-aquatic turtles. These turtles have a long history of being kept as successful pets. 1  Aquatic turtles kept indoors are most commonly housed in an aquarium. Though a bit more care intensive than the water turtles, there are several land turtles that can make good pets. Several fairly inexpensive land turtles such as box turtles, are readily available at pet stores and are great for beginners."}, {"url": "http://www.animalhospitals-usa.com/reptiles/water-turtles.html", "passage_text": "Water Turtles. Various species of water turtles are kept as pets in the United States. Most of those purchased by hobbyists originate from the southern and eastern regions of the U.S. By law, imported turtles of most species must be at least 4 inches long."}]