[{"url": "http://study.com/articles/Airfield_Operations_Specialist_Job_Description_Duties_and_Salary.html", "passage_text": "Public and private airports and military airfields employ airfield operations specialists to ensure safe and secure airport environments. Specialists perform a variety of tasks, including maintenance, emergency response, and management. The U.S. Bureau of Labor Statistics reported that the middle half of airfield operations specialists earned annual salaries of $35,310 and $62,770 in May 2013 (www.bls.gov). The highest ten percent of specialists earned $85,900 or more that year"}, {"url": "http://www.airportoperations.net/Certification.html", "passage_text": "Airport Certificate – Purpose. 1  Provides the Airport Operator and aircraft Operators with documented proof that the facilities they operate or use are safe. 2  It is an important Risk management element. 3  Ensure continued Safety, regularity and efficiency of aircraft Operations at Aerodromes. 1"}, {"url": "https://en.wikipedia.org/wiki/Aerodrome", "passage_text": "Pulkovo Airport, near Saint Petersburg, Russia. An aerodrome or airdrome is a location from which aircraft flight operations take place, regardless of whether they involve air cargo, passengers, or neither. "}, {"url": "https://www.airforce.com/careers/detail/airfield-management/", "passage_text": "Career Description. Every Air Force plane around the world requires an airfield in order to take off and land. These aircraft must be able to launch at a moment’s notice, so it’s imperative the airfield be safe and well maintained at all times. That responsibility is the duty of Airfield Management specialists. It may sound like an easy job, but it’s not. Airfield Management specialists ensure runways are clear of foreign objects and lighting systems function properly, in addition to responding to ground emergencies and communicating hazards to pilots. The safe takeoff and landing of aircraft, and more importantly their crews, rest squarely on your shoulder"}, {"url": "http://study.com/articles/Airfield_Operations_Specialist_Job_Description_Duties_and_Salary.html", "passage_text": "Most employers require airfield operations specialists to have at least an associate's degree or work experience, or a combination of both. Universities, community colleges, and technical schools offer degrees and certificates in aviation. The U.S. Bureau of Labor Statistics reported that the middle half of airfield operations specialists earned annual salaries of $35,310 and $62,770 in May 2013 (www.bls.gov). The highest ten percent of specialists earned $85,900 or more that year"}, {"url": "https://en.wikipedia.org/wiki/Airport", "passage_text": "In warfare, airports can become the focus of intense fighting, for example the Battle of Tripoli Airport or the Battle for Donetsk Airport, both taking place in 2014. An airport primarily for military use is called an airbase or air station. Most of the world's airports are owned by local, regional, or national government bodies. An airport for use by seaplanes and amphibious aircraft is called a seaplane base. Such a base typically includes a stretch of open water for takeoffs and landings, and seaplane docks for tying-up. An international airport has additional facilities for customs and immigration."}, {"url": "http://www.avjobs.com/careers/detail.asp?Job_Title=Director%20or%20Manager&Category=Airport&Related=Airport%20Operations&RecID=42", "passage_text": "Airport Operations Career Overview. Airport-Director or Manager-Airport Operations. Under general supervision, this position is responsible for assessing, evaluating, and coordinating airport operations activities, Airport Rescue, Firefighting, safety and security needs. In many cases the airport manager is a part of the local government and is involved in official meetings and community projects, especially those concerned with aviation. Typical Requirements and/or Experience. As with any managerial position, the position of an airport manager requires experience and training."}, {"url": "http://airportoperations.net/", "passage_text": "Please use the navigation bar to your left to view the following aspects of Airport Operations: Airport Operations assists Airports, to provide an operationally Safe Airport that is in compliance with the latest International and National Aviation Regulations, Legislation and Requirements. Airport Operations conducts audits, formulates new and/or modifies existing policies & prodedures. "}, {"url": "http://study.com/articles/Airfield_Operations_Specialist_Job_Description_Duties_and_Salary.html", "passage_text": "Airfield operations specialists maintain the entire airfield area of an airport. Their duties include ensuring the safe take-off and landing of aircraft, maintaining navigational aids, performing inspections, and communicating with air traffic control. The U.S. Bureau of Labor Statistics reported that the middle half of airfield operations specialists earned annual salaries of $35,310 and $62,770 in May 2013 (www.bls.gov). The highest ten percent of specialists earned $85,900 or more that year"}]