[{"url": "http://www.trulia.com/voices/Home_Buying/Townhomes_What_does_Fee_Simple_mean_and_how_wi-88130", "passage_text": "A fee simple (or fee simple absolute) is an estate in land. It is the most common way real estate is owned in common law countries, and is ordinarily the most complete ownership interest that can be had in real property short of allodial title, which is often reserved for governments. "}, {"url": "http://budgeting.thenest.com/fee-simple-title-good-warranty-deed-24368.html", "passage_text": "Fee Simple. Fee simple title refers to how the title to the property is held. This form of vesting implies an absolute form of ownership. The owner of a property held as fee simple has the right to grant the property to anyone via a deed. If the owner keeps the property until his death, his heirs become the owners. "}, {"url": "http://www.ehow.com/about_7293833_fee-title-good-warranty-deed_.html", "passage_text": "Fee simple, also known as fee simple absolute, is a type of legal possession in which the fee simple holder has complete possessory rights to the property. A Warranty Deed is a legal instrument in which the party granting the deed more or less guarantees that he will give the transferee fee simple title. Fee simple is a type of estate that entails full ownership of the property. Those with specific questions about deeds and real estate transfers should seek legal advice."}, {"url": "https://www.redfin.com/definition/fee-simple", "passage_text": "Fee Simple. Fee simple is the most common type of land ownership, meaning that the owners have complete ownership of the land and the home, but are still subject to taxation and debt obligations on their mortgage. "}, {"url": "http://www.zillow.com/wikipages/Fee-Simple-vs-Leasehold-Ownership/", "passage_text": "Fee simple is sometimes called fee simple absolute because it is the most complete form of ownership. A fee simple buyer is given title (ownership) of the property, which includes the land and any improvements to the land in perpetuity. Aside from a few exceptions, no one can legally take that real estate from an owner with fee simple title. Most people only know of one type of real estate ownership; fee simple, also known as freehold. There are a handful of states that have another form of ownership known as leasehold. The difference in these two types of land tenure is very different and affects the value of the real estate."}, {"url": "https://en.wikipedia.org/wiki/Fee_simple", "passage_text": "In English law, a fee simple or fee simple absolute is an estate in land, a form of freehold ownership. It is the way that real estate is owned in common law countries, and is the highest ownership interest possible that can be had in real property. If previous grantors of a fee simple estate do not create any conditions for subsequent grantees, then the title is called fee simple absolute. A fee simple absolute is the highest estate permitted by law and it gives the holder with full possessory rights and obligations now and in the future."}, {"url": "https://en.wikipedia.org/wiki/Fee_simple", "passage_text": "The fee simple estate is also called estate in fee simple or fee-simple title, sometimes simply freehold in England and Wales. From the start of the Norman period, when feudalism was introduced to England, the tenant or holder of a fief could not alienate (sell) it from the possession of his overlord. If previous grantors of a fee simple estate do not create any conditions for subsequent grantees, then the title is called fee simple absolute. A fee simple absolute is the highest estate permitted by law and it gives the holder with full possessory rights and obligations now and in the future."}, {"url": "https://en.wikipedia.org/wiki/Fee_simple", "passage_text": "An estate in fee simple denotes the maximum ownership in land that can be legally granted; it is the greatest possible aggregate of rights, powers, privileges and immunities available in land. If previous grantors of a fee simple estate do not create any conditions for subsequent grantees, then the title is called fee simple absolute. A fee simple absolute is the highest estate permitted by law and it gives the holder with full possessory rights and obligations now and in the future."}, {"url": "http://realestate.findlaw.com/buying-a-home/types-of-home-ownership.html", "passage_text": "Fee Simple. The most common form of ownership, when a homeowner purchases a home, is the fee simple absolute. The holder of a title in fee simple has full possessory rights now and in the future for an infinite duration. There are no limitations on its inheritability. The holder of the estate can sell the entire estate or any part of it and dispose of it by will at time of death. "}, {"url": "https://answers.yahoo.com/question/index?qid=20061211102209AAPDbKB", "passage_text": "Report Abuse. Fee simple is an estate in land in common law. It is the most common way real estate is owned in common law countries, and is ordinarily the most complete ownership interest that can be had in real property short of allodial title, which is often reserved for governments. Best Answer: A nice, short definition is: FEE SIMPLE-An estate under which the owner is entitled to unrestricted powers to dispose of the property, and which can be left by will or inherited. Commonly, a synonym for ownership. Source(s): Licensed Title Examiner definition from http://www.financial-publishing.com/real..."}]