[{"url": "http://www.heart.org/HEARTORG/Conditions/Cholesterol/AboutCholesterol/What-Your-Cholesterol-Levels-Mean_UCM_305562_Article.jsp", "passage_text": "A diet high in saturated and trans fats raises LDL cholesterol. Triglycerides Triglyceride is the most common type of fat in the body. Normal triglyceride levels vary by age and sex. A high triglyceride level combined with low HDL cholesterol or high LDL cholesterol is associated with atherosclerosis, the buildup of fatty deposits in artery walls that increases the risk for heart attack and stroke. Learn How to Get Your Cholesterol Tested. AHA Recommendation. Your total cholesterol score is calculated using the following equation: HDL + LDL + 20 percent of your triglyceride level. HDL (good) cholesterol. With HDL cholesterol, higher levels are better."}, {"url": "http://www.webmd.boots.com/cholesterol-management/guide/triglycerides", "passage_text": "Simply put, triglycerides are fat in the blood, and a high triglyceride level can increase the risk of heart disease. Just what your triglyceride levels mean and how much lowering triglycerides reduces heart disease risk is less clear. Triglycerides and lowering triglyceride levels. Good cholesterol, bad cholesterol, saturated fat, and unsaturated fat-sometimes it seems like you need a programme to keep track of all the fatty players in the story"}, {"url": "http://www.webmd.boots.com/cholesterol-management/guide/triglycerides", "passage_text": "High triglyceride levels often coexist with high total cholesterol and LDL ( bad cholesterol ), low HDL ( good cholesterol ), and diabetes. Triglycerides may be an enabler of other heart disease risk factors. Triglycerides and lowering triglyceride levels. Good cholesterol, bad cholesterol, saturated fat, and unsaturated fat-sometimes it seems like you need a programme to keep track of all the fatty players in the story of heart disease."}, {"url": "http://www.webmd.com/cholesterol-management/lowering-triglyceride-levels", "passage_text": "The National Cholesterol Education Program sets guidelines for triglyceride levels: Normal triglycerides means there are less than 150 milligrams per deciliter (mg/dL). Borderline high triglycerides = 150 to 199 mg/dL. High triglycerides = 200 to 499 mg/dL. Very high triglycerides = 500 mg/dL or higher. High triglyceride levels may lead to heart disease, especially in people with low levels of good cholesterol and high levels of bad cholesterol, and in people with type 2 diabetes. Experts disagree, though, on just how bad of an effect high triglyceride levels by themselves have on the heart. Your total cholesterol level is in the Desirable range, but your level of bad LDL cholesterol is High. This may mean that your level of high-density lipoprotein (HDL), or good cholesterol, is too low. It is best to have a high level of good HDL and a low level of bad LDL."}, {"url": "http://www.heart.org/HEARTORG/Conditions/Cholesterol/AboutCholesterol/What-Your-Cholesterol-Levels-Mean_UCM_305562_Article.jsp", "passage_text": "Total blood (or serum) cholesterol. Your total cholesterol score is calculated using the following equation: HDL + LDL + 20 percent of your triglyceride level. HDL (good) cholesterol. With HDL cholesterol, higher levels are better. Low HDL cholesterol puts you at higher risk for heart disease"}, {"url": "http://www.medicinenet.com/triglyceride_test/page2.htm", "passage_text": "1 Normal triglyceride levels in the blood are less than 150mg per deciliter (mg/dL). 2  Borderline levels are between 150-200 mg/dL. 3  High levels of triglycerides (greater than 200 mg/dl) are associated with a increased risk of atherosclerosis and therefore coronary artery disease and stroke. 1 Borderline levels are between 150-200 mg/dL. 2  High levels of triglycerides (greater than 200 mg/dl) are associated with a increased risk of atherosclerosis and therefore coronary artery disease and stroke. 3  Extremely high triglyceride level s (greater than 500mg/dl) may cause pancreatitis (inflammation of the pancreas)"}, {"url": "http://www.medicinenet.com/triglyceride_test/page2.htm", "passage_text": "Triglyceride levels in the blood are measured by a simple blood test. Often, triglycerides are measured as part of a lipoprotein panel (lipid panel) in which triglycerides, cholesterol, HDL (high density lipoprotein), and LDL (low density lipoprotein) are measured at the same time. 1 Borderline levels are between 150-200 mg/dL. 2  High levels of triglycerides (greater than 200 mg/dl) are associated with a increased risk of atherosclerosis and therefore coronary artery disease and stroke. 3  Extremely high triglyceride level s (greater than 500mg/dl) may cause pancreatitis (inflammation of the pancreas)"}, {"url": "http://www.buzzle.com/articles/triglycerides-too-low.html", "passage_text": "The normal range of triglycerides occurs below 150 mg/dL. A level of 100 mg/dL or lesser is also considered to be optimal as recommended by the American Heart Association (AHA). However, any figure lower than this is considered to be dangerously low. The causes for the triglyceride levels being too low may be narrowed down to the following: You consume a diet low in fats. ☛ So, you are a health-conscious person who follows a low-fat diet and avoids all kinds of foods rich in fats."}]