[{"url": "https://answers.yahoo.com/question/index?qid=20100505151525AASQkWY", "passage_text": "Update: How much on average does a franchise owner earn? Possibly someone living in Orange County, Los Angeles County, Riverside, or San Bernardino County-California. Just looking for a general idea/range. "}, {"url": "http://www.answers.com/Q/How_much_money_does_a_pizza_hut_store_make", "passage_text": "How much does 1 large pizza from Pizza Hut cost?   A large pizza cost $13.99 {Thirteen dollars and ninety-nine cents} Now you can get two for $24.99 {twenty-four dollars and ninety-nine cents} Penny pizza is just one … cent. Pizza Mia cost $5.00 {five dollars } each. ----------------------------------------- I also work at a Pizza Hut. I make $2.35/hour before tips. I usually make $20-$40 in tips per shift (a shift is about 6 hours)."}, {"url": "http://www.kaycircle.com/How-Much-Does-a-Pizza-Hut-Franchise-Make-Per-Year-Average-Pizza-Hut-Franchise-Income-Earnings-Profit", "passage_text": "Opening a Pizza Hut restaurant is considered a worthy concept, for it assures sufficient sales and nets reasonable profits. Usually a Pizza Hut franchisee reports about 15% profit of the total sale which is to the tune of $700,000 to $800,000 per year. A Pizza Hut franchise owner, therefore, earns about $75,000 annually. The income varies depending on several factors such as the area where the store is located and the money that is invested initially. Pizza Hut has worldwide acclaim and only deserving people manage to get ownership for the fast food franchise. On average, it may require $1 million to open a Pizza Hut restaurant and the royalty fee is 6.5%."}, {"url": "http://www.small-business-forum.net/starting-your-business/9457-experience-pizza-hut-franchise.html", "passage_text": "1. Likes (Received). 1. Pizza Hut franchise is part of YUM! Brands and to be considered for a Pizza Hut franchise you will need to have $360,000 in cash and net worth of $1 million. Your total estimated initial investment will be between $1,290,000 and $3,088,000. Usually a Pizza Hut franchisee reports about 15% profit of the total sale which is to the tune of $700,000 to $800,000 per year.  - FranchiseWisdom.com Hope that helps somewhat."}, {"url": "http://www.answers.com/Q/How_much_money_does_a_pizza_hut_store_make", "passage_text": "30K maybe in sales not profit. After all salaries and royalties are paid is much less than you may think... They could be easily be making $5000 and up depending on location. If a Pizza hut makes 30k a week or 120k a month the owner will buy a new pizza hut each month x 2 and x 3 the following months.. ----------------------------------------- I also work at a Pizza Hut. I make $2.35/hour before tips. I usually make $20-$40 in tips per shift (a shift is about 6 hours)."}, {"url": "http://www.pizzatoday.com/departments/back-office/make-20-percent-profit-margin-can-2/", "passage_text": "By: Michael Shepherd. I recently learned that a profit margin of 7 percent is the average for the pizzeria industry. So, for every dollar in sales, only seven cents is left over to take home as profit. This means for every $10 pizza I sell, I should only get to keep 70 cents. My first thought was: This must be wrong. My small-town carryout-only pizzeria with sales of $286,000 makes more than 20 percent in profit. My small-town dine-in, delivery and carryout pizzeria with sales of more than $700,000 makes a profit in the high teens."}, {"url": "http://smallbusiness.chron.com/much-profit-margin-pizza-62139.html", "passage_text": "Rent, labor, utilities and franchise fees must be prorated to each pizza, and that will depend on how many are sold. One estimate of the cost of a Little Caesar large $5.00 pizza is $3.50 for the ingredients and $0.60 for the overhead, leaving a profit of $0.90 per pizza. Basic Pizza. Consider the ingredients -- flour, yeast, water, sauce, cheese and toppings. None of these are expensive -- think about the cost at the grocery store. To build a medium pizza the cheese is the most expensive ingredient at $2.00, with the dough adding about $0.25 and the sauce $0.35."}, {"url": "https://www.pizzahutfranchise.co.uk/", "passage_text": "That’s what you get with a Pizza Hut delivery franchise. Not only will you have that sense of achievement that comes with running your own business, you can also be safe in the knowledge you have the largest pizza business in the world supporting you every step of the way. "}]