[{"url": "http://www.sheknows.com/baby-names/name/emma", "passage_text": "The name Emma is an English baby name. In English the meaning of the name Emma is: Whole; complete. German Meaning: The name Emma is a German baby name. In German the meaning of the name Emma is: Whole. Complete. Universal. Old German 'ermin' or 'irmin', meaning universal. Famous bearer: 1960s television character Emma Peel in 'The Avengers'; Lady Emma Hamilton, mistress to Lord Horatio Nelson."}, {"url": "http://www.thenamemeaning.com/emma/", "passage_text": "Search comprehensively and find the name meaning of Emma and its name origin or of any other name in our database. Also note the spelling and the pronunciation of the name Emma and check the initials of the name with your last name to discover how it looks and sounds. ‘ Ema ’ is the most regularly used foreign variant for Emma, and is used in Croatia, the Czech Republic, Portugal, and Spain. In the Netherlands, they use Ima as a variant spelling. Similar sounding names to Emma are Anna, Ella, Emily, and a similar looking masculine name is Ethan."}, {"url": "http://www.behindthename.com/name/emma", "passage_text": "Originally a short form of Germanic names that began with the element ermen meaning whole or universal. It was introduced to England by Emma of Normandy, who was the wife both of king Ethelred II (and by him the mother of Edward the Confessor) and later of king Canute. "}, {"url": "http://www.ourbabynamer.com/meaning-of-Emma.html", "passage_text": "Introduced to Britain by the Normans, the name Emma originated as a short form of compound names that contained the element erm(en), irm(en) , meaning entire, whole. It is sometimes used as a nickname for Emily, but this is not etymologically justified. Emma Lazarus was an American poet and writer. "}, {"url": "http://www.babynames.com/name/emma", "passage_text": "Notes: Emma is a name with Latin origins. The meaning of the name Emma is universal. It can also be used as the diminutive form of Emily. Common nicknames include Em and Emmy. Emma is a very popular name in the United States as well as abroad, particularly in the United Kingdom. "}, {"url": "https://en.wikipedia.org/wiki/Emma_(given_name)", "passage_text": "Look up Emma in Wiktionary, the free dictionary. Emma is a given female name. It is derived from the Germanic word ermen meaning whole or universal, and was originally a short form of Germanic names that began with ermen. Emma is also used as a diminutive of Emmeline, Amelia or any other name beginning with em. It was introduced to England by Emma of Normandy, who was the wife both of King Ethelred II (and by him the mother of Edward the Confessor) and later of King Canute."}, {"url": "http://www.thinkbabynames.com/meaning/0/Emma", "passage_text": "Emma /em-ma/ [2 sylls.] as a girls' name is pronounced EM-ah. It is of Old French and Old German origin, and the meaning of Emma is entire, universal. Originally a short form of compound names such as Ermintrude and Irma, from the word erm(en) or irm(en) . "}, {"url": "http://www.meaning-of-names.com/english-names/emma.asp", "passage_text": "Meaning of Emma. English name. In English, the name Emma means-Whole; complete.. Other origins for the name Emma include-English, Latin-American, German, Danish.The name Emma is most often used as a girl name or female name. English Name Meaning-Whole; complete. Origin-English. "}, {"url": "http://www.thenamemeaning.com/emma/", "passage_text": "The meaning of Emma has more than one different etymologies. It has same or different meanings in other countries and languages. The different meanings of the name Emma are: 1  Whole, Complete, Universal. 2  American meaning: Industrious. ‘ Ema ’ is the most regularly used foreign variant for Emma, and is used in Croatia, the Czech Republic, Portugal, and Spain. In the Netherlands, they use Ima as a variant spelling. Similar sounding names to Emma are Anna, Ella, Emily, and a similar looking masculine name is Ethan."}]