[{"url": "http://www.ncbi.nlm.nih.gov/pubmedhealth/PMHT0023062/", "passage_text": "Systemic circulation carries oxygenated blood from the left ventricle, through the arteries, to the capillaries in the tissues of the body. From the tissue capillaries, the deoxygenated blood returns through a system of veins to the right atrium of the heart."}, {"url": "http://heartbloodveins.weebly.com/index.html", "passage_text": "Pulmonary Circulation. Pulmonary circulation is the part of the cardiovascular system which carries deoxygenated blood away from the heart, to the lungs, and returns oxygenated blood back to the heart. It is what the Pulmonary Artery and the Pulmonary Veins do."}, {"url": "http://www.mcwdn.org/body/circulatory.html", "passage_text": "Blood Vessels: Arteries: These are large blood vessels that take oxygenated blood away from the heart to be distributed throughout the body. The aorta is the body's largest artery. Veins: These blood vessels take deoxygenated blood from around the body back to the heart and lungs to be oxygenated."}, {"url": "http://www.saburchill.com/chapters/chap0082.html", "passage_text": "The aorta carries oxygenated blood to the body. The pulmonary artery carries deoxygenated blood to the lungs and it is the only artery to carry deoxygenated blood. There are two veins associated with the heart. The vena cava, or great vein, carries deoxygenated blood back to the heart from the body."}, {"url": "https://au.answers.yahoo.com/question/index?qid=20080604035319AAr52VV", "passage_text": "Best Answer: Normally. Deoxygenated blood returns to the heart from the body, and the heart returns oxygenated blood to the body through the aorta. The only place where oxygenated blood would come *to* the heart is from the lungs. Since it goes to the heart, it must be a vein. So the answer is the pulmonary veins."}, {"url": "http://www.answers.com/Q/What_vessel_carries_deoxygenated_blood_back_to_the_heart", "passage_text": "Blood passes from the right ventricle to the lungs via the pulmonary artery (the only artery in the body that contains deoxygenated blood. veins. In the circulatory system, a vein is a blood vessel that carries blood back toward the heart (as opposed to artery, a blood vessel carrying blood away from the heart)."}, {"url": "http://heartbloodveins.weebly.com/index.html", "passage_text": "Systemic circulation is the part of the cardiovascular system which carries oxygenated blood away from the heart to the body, and returns deoxygenated blood back to the heart. Is is what the arteries and veins do."}]