[{"url": "http://physical-therapy-schools.startclass.com/l/419/University-of-Central-Florida", "passage_text": "Admission. Each year, 300 students apply for the program, which is 50% more than the average for all physical therapy schools. The program accepts 15% of these applicants, which is 3% lower"}, {"url": "http://www.uwlax.edu/Physical-Therapy-DPT/Grade-Point-Average-(GPA)/", "passage_text": "Cumulative GPA. A minimum cumulative GPA on all post-high school courses of 3.00, calculated on a 4-point scale, is required of all applicants. The cumulative GPA calculated by PTCAS and listed on the applicant's PTCAS application will serve as the cumulative GPA of record."}, {"url": "http://ptcareertraining.com/average-gpa-physical-therapy-school/", "passage_text": "Sciences/Physical-therapy.html Mayo School of Health Sciences program with an average GPA of 3.47, some schools as high as 3.7. janotjm@uwec.edu The American Physical Therapy Association (APTA)Pre www.apta.org Commission on Accreditation in Physical."}, {"url": "http://www.answers.com/Q/What_is_the_average_gpa_of_students_that_go_into_physical_therapy_school", "passage_text": "Making the world better, one answer at a time. it depends, there are some school that the average is 3.8 and some school average is way lower like around 3.2 or even 3.0. for physical therapy average is not really a big issue for most people."}, {"url": "http://ptcareertraining.com/average-gpa-physical-therapy-school/", "passage_text": "J of athletic training. 2001;36(2). SCHOOL OF PHYSICAL THERAPY. College or university with a minimum grade point average (GPA) of 3.0 on a scale of 4.0 in which School of Physical Therapy Langston University Medical Center P.O. Box 1500 by the School of Physical Therapy Langston, Oklahoma."}, {"url": "http://www.apta.org/ProspectiveStudents/Admissions/PTProcess/", "passage_text": "Minimum GPA-Most PT programs have minimum grade point average (GPA) requirements. These minimum scores vary by institution and may be low as compared with the average GPA of applicants offered admission. The average overall undergraduate GPA for accepted PTCAS applicants in 2011-12 was 3.52."}, {"url": "http://physical-therapy-schools.startclass.com/l/419/University-of-Central-Florida", "passage_text": "The average GPA of incoming students is 3.50, which is roughly the average for all physical therapy schools. Cost. In-state tuition for the program is $25,920, which is 75% more expensive than"}]