[{"url": "http://weddings.costhelper.com/wedding-photographer.html", "passage_text": "1 Packages between $1,000-$3,000 may include an additional photographer and up to 8 hours of coverage, plus special albums, parents albums or photo books, though for some photographers, the fee will cover only the photography. 1 Budget photographers run from under $1,000; moderate photographers average between $1,000 and $3,000; and upscale photographers between $3,000 and $5,000. 2  Luxury weddings photographers average between $5,000 and upwards of $10,000."}, {"url": "http://www.sharpfocusphoto.com/", "passage_text": "sharpfocus headshots photography dc. if you’re looking for a photographer in washington dc sharpfocus studio is a good choice. whether you need actor or corporate headshots, model photography and portraits, the focus is on you. if you’re in a business where image matters, you need professional pictures. sharpfocus photography focuses on you to capture headshots that show your core values and inspire trust. for career promotions, business applications or corporate branding, you can’t get a better deal."}, {"url": "http://www.payscale.com/research/US/Job=Photographer/Hourly_Rate", "passage_text": "The average Photographer in the United States can expect to rake in roughly $14.99 per hour. In the world of Photographers, overall cash allowance can occasionally include more than $4K from bonuses and, in some exceptional cases, $8K from profit sharing, causing incomes to vary widely between $20K and $92K. For Photographers, New York provides a pay rate that is 40 percent greater than the national average. Photographers will also find cushy salaries in San Diego (+32 percent), Dallas (+31 percent), Denver (+28 percent), and San Francisco (+27 percent)."}, {"url": "http://www.unitedwithlove.com/2012/06/19/average-cost-of-wedding-in-the-dc-area/", "passage_text": "In the Washington, DC area, the average couple spends around $30,000 to $35,000 on their wedding ceremony and reception. The same $32,500 average cost is true for weddings in downtown DC, Baltimore, Charlottesville, Annapolis, Northern Virginia and parts of Maryland. […] venues and gave them a criteria of 120 guests for a total wedding budget of $20,000 or less. (The average cost of a wedding in the DC area is around $35,000 and the average size guest list is little bit over 100 guests, so that’s how we got to 120 […]. Reply."}, {"url": "http://www.sheknows.com/love-and-sex/articles/1003945/how-much-your-wedding-photographer-should-cost", "passage_text": "Talent doesn't come cheap. Experience also determines how much a photographer should cost. A new photographer (less than two years pro) would be high-minded to charge $5,000, Smith says. Years of experience add to the value, so make sure to look at plenty of samples. The actual cost of the engagement and wedding photos varies greatly by city and what is included in the package, but a general estimate is $300 to $500 for engagement photo shoots, and $2,500 to $10,000 for wedding shoots, according to Steve Lesnick, photographer at Toastphoto."}, {"url": "http://www.diyphotography.net/much-photographers-charge-per-hour/", "passage_text": "If you earn $30 an hour at the office, chances are you’d like to earn at least $30 an hour from your photography. If you are a full time photographer, you can work backwards from what you need to earn in a year to support your family and your lifestyle. For example, if I want to earn the equivalent of $30 per hour for a 40 hour work week, but I can only bill 20 hours, I have to bill $60 per hour. I am still working 40 hours per week, but only 50% can be billed to a client so my billable rate doubles."}, {"url": "http://www.diyphotography.net/much-photographers-charge-per-hour/", "passage_text": "The long answer depends a lot more on where you personally fit into the photography industry and your local market. In this article I am going to explore the seven critical factors that determine how much should photographers charge per hour, along with an example of how to calculate a reasonable billable rate. For example, if I want to earn the equivalent of $30 per hour for a 40 hour work week, but I can only bill 20 hours, I have to bill $60 per hour. I am still working 40 hours per week, but only 50% can be billed to a client so my billable rate doubles."}, {"url": "http://weddings.costhelper.com/wedding-photographer.html", "passage_text": "All I can say is research. I'm a wedding photographer and it is really difficult to come up with pricing. A lot of time is spent figuring out overhead, how much time will be spent meeting, editing, and any other photo process, and how much your art is worth. All in all I make maybe minimum wage - $11 an hour. 1 Budget photographers run from under $1,000; moderate photographers average between $1,000 and $3,000; and upscale photographers between $3,000 and $5,000. 2  Luxury weddings photographers average between $5,000 and upwards of $10,000."}]