[{"url": "http://phys.org/news/2011-09-facebook-director-privacy.html", "passage_text": "Privacy a Facebook priority, says director Randi Zuckerberg. User privacy is the priority for Internet social networking site Facebook, which has come under fire from users for its privacy settings, the company's director of market development said on Sunday in Dubai. Terrell will also join Facebook's Washington office. In addition, Facebook said it had hired Erika Mann, a former member of the European parliament from Germany, will head a new Brussels office for Facebook and serve as lead spokesperson with EU institutions."}, {"url": "http://www.businessinsider.com/facebook-senior-management-team-2012-8", "passage_text": "Facebook's online press room is next to useless for figuring this out. Only CEO Mark Zuckerberg, COO Sheryl Sandberg, and CFO Mike Ebersman are listed there. But a photo Zuckerberg posted of the Facebook executives who recently took a trip to Walmart headquarters in Bentonville, Ark., is a pretty good clue. Reuters says that the group was Zuckerberg's senior management team.. Some junior staffers who work closely with Walmart also joined in—and we noticed some missing faces, most notably Facebook PR chief Elliot Schrage. Still, Zuckerberg's photo is the best illustration we've seen of the executives he's closest to."}, {"url": "http://phys.org/news/2011-09-facebook-director-privacy.html", "passage_text": "Facebook, which has been dogged by complaints over privacy, announced Tuesday that it has named a director of privacy at the social network. Erin Egan, a privacy and data security lawyer with the firm of Covington & Burling, will join Facebook in mid-October, the Palo Alto, California-based company said in a statement. Terrell will also join Facebook's Washington office. In addition, Facebook said it had hired Erika Mann, a former member of the European parliament from Germany, will head a new Brussels office for Facebook and serve as lead spokesperson with EU institutions."}, {"url": "http://allthingsd.com/20101130/facebook-engineering-director-aditya-agarwal-departs/", "passage_text": "His wife, Ruchi Sanghvi, was Facebook’s first female engineer and left the company in August. (The two joined Facebook as a couple in mid-2005 after graduating from Carnegie Mellon.). Agarwal is not Facebook’s only director of engineering; others with that title include Andrew “Boz” Bosworth and Robert Johnson. Facebook has given employees the option to cash out some of their shares through secondary markets, and plus, early members of the team have at this point just been there a long time. Facebook director of engineering and very early employee Aditya Agarwal is leaving the company after more than five years, he announced last night."}, {"url": "http://www.who.int/dg/en/", "passage_text": "WHO. Dr Margaret Chan is the Director-General of WHO and was first appointed by the World Health Assembly on 9 November 2006. The Assembly appointed Dr Chan for a second five-year term at its sixty-fifth session in May 2012. Dr Chan's current term began on 1 July 2012 and will continue until 30 June 2017. Before being elected Director-General, Dr Chan was WHO Assistant Director-General for Communicable Diseases as well as Representative of the Director-General for Pandemic Influenza. Prior to joining WHO, she was Director of Health in Hong Kong."}, {"url": "http://www.answers.com/Q/Who_is_the_managing_director_of_facebook_uk", "passage_text": "According to recent government statistics the average salary for a  management director is $180,000. However, the salary for a  management director can range from $100,000 t … o over $300,000  depending on the company, location, and specifics of the position  in which the individual holds in their business. The Managing Director of Accenture is the Chairman and CEO, Pierre  Nanterme. He has been the Chairman since 2013 and on the board of  directors since 2010."}, {"url": "http://www.answers.com/Q/Who_is_the_managing_director_of_facebook_uk", "passage_text": "The managing director in most businesses would be the most senior executive post: the person who leads the company on a day to day basis and reports to the board of directors. However note that in some professional services businesses the job title of 'managing director' is sometimes given to less senior people. The Managing Director of Accenture is the Chairman and CEO, Pierre  Nanterme. He has been the Chairman since 2013 and on the board of  directors since 2010."}, {"url": "http://allthingsd.com/20101130/facebook-engineering-director-aditya-agarwal-departs/", "passage_text": "Still others feel stifled by the company’s management structure. Facebook director of engineering and very early employee Aditya Agarwal is leaving the company after more than five years, he announced last night. In a note published on his Facebook profile, Agarwal said:"}, {"url": "https://en.wikipedia.org/wiki/Chris_Cox_(Facebook)", "passage_text": "From Wikipedia, the free encyclopedia. Christopher Chris Cox (born 1982) is Chief Product Officer at Facebook, where he serves as chief of staff to Facebook CEO Mark Zuckerberg on product development and leads the company's worldwide product management, design and marketing functions. Cox received a bachelor's degree in symbolic systems with a concentration in artificial intelligence from Stanford University, which he attended from 2001 to 2004. Cox dropped out of a graduate degree program at Stanford to join Facebook in 2005."}]