[{"url": "http://www.healthline.com/health/pregnancy/complications-delivery-uterine-atony", "passage_text": "In addition, fragments of placenta remaining in the uterus after delivery or benign growths within the walls of the uterus (known as fibroids) can also prevent the uterus from contracting normally. The blood vessels supplying the placenta during pregnancy are severed when the placenta separates from the wall of the uterus. The bleeding that results from these severed vessels normally stops when the uterus contracts, compressing the vessels. However, if the uterus doesn't contract enough, the bleeding can continue."}, {"url": "http://www.medilexicon.com/medicaldictionary.php?t=8333", "passage_text": "uterine atony. Definitions: 1. failure of the myometrium to contract after delivery of the placenta; associated with excessive bleeding from the placental implantation site. The definition information for uterine atony is provided by Stedman's. You can search our medical dictionary here."}, {"url": "http://www.aafp.org/afp/2007/0315/p875.html", "passage_text": "TONE. Uterine atony is the most common cause of postpartum hemorrhage. 28 Because hemostasis associated with placental separation depends on myometrial contraction, atony is treated initially by bimanual uterine compression and massage, followed by drugs that promote uterine contraction. "}, {"url": "http://www.chw.org/medical-care/fetal-concerns-center/conditions/pregnancy-complications/postpartum-hemorrhage/", "passage_text": "If the uterus does not contract strongly enough, called uterine atony, these blood vessels bleed freely and hemorrhage occurs. This is the most common cause of postpartum hemorrhage. If small pieces of the placenta remain attached, bleeding is also likely. Postpartum hemorrhage is excessive bleeding following the birth of a baby. About 4 percent of women have postpartum hemorrhage and it is more likely with a cesarean birth. Hemorrhage may occur before or after the placenta is delivered."}, {"url": "https://en.wikipedia.org/wiki/Postpartum_hemorrhage", "passage_text": "Causes of postpartum hemorrhage are uterine atony, trauma, retained placenta, and coagulopathy, commonly referred to as the four Ts: 1  Tone: uterine atony is the inability of the uterus to contract and may lead to continuous bleeding. 2  Retained placental tissue and infection may contribute to uterine atony. "}, {"url": "http://www.healthline.com/health/pregnancy/complications-delivery-uterine-atony", "passage_text": "Ninety percent of all postpartum hemorrhages are caused by uterine atony-that is, failure of the uterine muscles to contract normally after the baby and placenta are delivered. The blood vessels supplying the placenta during pregnancy are severed when the placenta separates from the wall of the uterus. The bleeding that results from these severed vessels normally stops when the uterus contracts, compressing the vessels. However, if the uterus doesn't contract enough, the bleeding can continue."}, {"url": "https://en.wikipedia.org/wiki/Uterine_atony", "passage_text": "Uterine atony is a loss of tone in the uterine musculature. Normally, contraction of the uterine muscle compresses the vessels and reduces flow. This increases the likelihood of coagulation and prevents bleeds. Thus, lack of uterine muscle contraction can cause an acute hemorrhage. Clinically, 75-80% of postpartum hemorrhages are due to uterine atony."}, {"url": "http://www.symcat.com/conditions/uterine-atony", "passage_text": "Also known as Inertia Uteri. Uterine atony is a loss of tone in the uterine musculature. Normally, contraction of the uterine muscle compresses the vessels and reduces flow. This increases the likelihood of coagulation and prevents bleeds. Thus, lack of uterine muscle contraction can cause an acute hemorrhage"}, {"url": "http://www.urmc.rochester.edu/encyclopedia/content.aspx?ContentTypeID=90&ContentID=P02486", "passage_text": "Postpartum hemorrhage is excessive bleeding following the birth of a baby. About 1% to 5% of women have postpartum hemorrhage and it is more likely with a cesarean birth. Hemorrhage most commonly occurs after the placenta is delivered. The average amount of blood loss after the birth of a single baby in vaginal delivery is about 500 ml (or about a half of a quart)."}]