[{"url": "https://en.wikipedia.org/wiki/Trap_rock", "passage_text": "Trap rock forming a characteristic pavement, Giant's Causeway, Northern Ireland. Trap rock, also known as either trapp or trap, is any dark-colored, fine-grained, nongranitic intrusive or extrusive igneous rock. Types of trap rock include basalt, peridotite, diabase, and gabbro. Trapp (trap) is also used to refer to flood (plateau) basalts, i.e. the Deccan Traps and Siberian Traps."}, {"url": "http://geology.com/articles/trap-rock/", "passage_text": "Trap Rock. A construction industry term used for dark-colored igneous rocks used to make crushed stone. Crushed Trap Rock ready for use in a construction project. Trap rock is any dark-colored igneous rock that is used to produce crushed stone. Image © Brilt and iStockphoto."}, {"url": "http://geology.com/articles/trap-rock/", "passage_text": "Origin of the Name. The name “trap rock” is from the Swedish word “trappa” which means “stair step.” This refers to the step-like landscape that is present in geographic areas where stacked basalt flows and shallow intrusions outcrop to form a landscape of steep cliffs and narrow ledges."}, {"url": "https://en.wikipedia.org/wiki/Trap_rock", "passage_text": "Trap rock, i.e. basalt or diabase, has a variety of uses. A major use for basalt is crushed rock for road and housing construction in concrete, macadam, and paving stones."}, {"url": "http://geology.com/articles/trap-rock/", "passage_text": "Trap rock is a name used in the construction industry for any dark-colored igneous rock that is used to produce crushed stone."}, {"url": "http://www.thesunrockgroup.com/construction-materials/trap-rock", "passage_text": "Trap rock is a type of basalt rock that is crushed and used in several different construction applications. Basalt is dark, dense, fine-grained igneous rock formed from solidified lava in the earth’s crust."}, {"url": "http://geology.com/articles/trap-rock/", "passage_text": "“Trap rock” is not a geological term that you are likely to learn about in a geology course or read about in a geology textbook. Instead it is a term used for convenience in the construction industry when the exact mineral composition or identity of the rock is unimportant or unknown."}]