[{"url": "http://www.realtor.com/local/Sumter_SC", "passage_text": "Foreclosed: 1. The average home price in Sumter is $133,900, which is 3.2% higher than the average sold price in Sumter ($129,750) . The average home price per square foot in Sumter is $72 and about 1% of all homes in Sumter sold in the last 6 months. For Sumter home values, real estate prices, and city market trends, research the 41,046 property records or search our 420 recently sold or 1,011 homes for sale listings"}, {"url": "http://www.realtor.com/local/Sumter_SC", "passage_text": "The listings and properties in Sumter are only a part of the 1,799,432 properties and 70,393 homes for sale in South Carolina. Because of this, the average home price and average home value of Sumter also influence the average home price $168,500 and average sale price $175,000 of South Carolina. The average home price in Sumter is $133,900, which is 3.2% higher than the average sold price in Sumter ($129,750) . The average home price per square foot in Sumter is $72 and about 1% of all homes in Sumter sold in the last 6 months. For Sumter home values, real estate prices, and city market trends, research the 41,046 property records or search our 420 recently sold or 1,011 homes for sale listings"}, {"url": "http://www.berkshirehathawayhs.com/SC/Sumter", "passage_text": "Sumter, South Carolina has a population of 40,533. Sumter is less family-centric than the surrounding county with 27.99% of the households containing married families with children. The county average for households married with children is 29.92%. The median household income in Sumter, South Carolina is $39,476. The median household income for the surrounding county is $40,726 compared to the national median of $53,046. The median age of people living in Sumter is 34.4 years."}, {"url": "http://www.trulia.com/real_estate/29150-Sumter/market-trends/", "passage_text": "Summary for Sumter, 29150. The median sales price for homes in ZIP code 29150 for Jul 15 to Oct 15 was $160,000. This represents an increase of 28.1%, or $35,050, compared to the prior quarter and an increase of 21.4% compared to the prior year. Sales prices have appreciated 20.3% over the last 5 years in 29150, Sumter. The median sales price of $160,000 for 29150 is 18.52% higher than the median sales price for Sumter SC. Average price per square foot for homes in 29150 was $70 in the most recent quarter, which is 1.41% lower than the average price per square foot for homes in Sumter."}, {"url": "http://www.areavibes.com/sumter-sc/housing/", "passage_text": "The median home value in Sumter is 8.2% less than the South Carolina average and 30.4% less than the National average. The median rental rates in Sumter is 8.1% less than the South Carolina average and 22.6% less than the National average. Sumter offers many different types of apartment rentals in many different apartment communities."}, {"url": "http://www.gaspricewatch.com/SC-south-carolina/Sumter/gas-prices/page-1/2.htm", "passage_text": "$1.99update. There are 41 Regular gas price reports in the past 5 days in Sumter, SC. The average Regular gas price in Sumter, SC is $1.99, which is $0.79 lower than U.S. national average Regular gas price $2.78. The lowest Regular gas price is $1.88 of Murphy USA located at 2350 Walmart Blvd, Sumter, SC 29150. The highest Regular gas price is $2.11 of Carolina Petro located at 230 Old Manning Rd, Sumter, SC 29150."}, {"url": "http://www.trulia.com/real_estate/29154-Sumter/market-trends/", "passage_text": "Summary for Sumter, 29154. The median sales price for homes in ZIP code 29154 for Jul 15 to Oct 15 was $122,900. This represents a decline of 4.7%, or $6,100, compared to the prior quarter and a decrease of 5.1% compared to the prior year. Sales prices have depreciated 5.4% over the last 5 years in 29154, Sumter. The median sales price of $122,900 for 29154 is 8.96% lower than the median sales price for Sumter SC"}, {"url": "http://www.zillow.com/sumter-sc/home-values/", "passage_text": "The median home value in Sumter is $90,600. Sumter home values have gone up 7.7% over the past year and Zillow predicts they will rise 4.1% within the next year. Read more. Foreclosures will be a factor impacting home values in the next several years. In Sumter 8.3 homes are foreclosed (per 10,000). This is lower than the Sumter Metro value of 9.7 and also greater than the national value of 3.5. Mortgage delinquency is the first step in the foreclosure process"}]