[{"url": "https://en.wikipedia.org/wiki/Exergy", "passage_text": "In thermodynamics, the exergy of a system is the maximum useful work possible during a process that brings the system into equilibrium with a heat reservoir. However, from a theoretical point of view, exergy may be defined without reference to any environment. If the intensive properties of different finitely extended elements of a system differ, there is always the possibility to extract mechanical work from the system."}, {"url": "http://www.definitions.net/definition/exergy", "passage_text": "Exergy. In thermodynamics, the exergy of a system is the maximum useful work possible during a process that brings the system into equilibrium with a heat reservoir. When the surroundings are the reservoir, exergy is the potential of a system to cause a change as it achieves equilibrium with its environment. Determining exergy was also the first goal of thermodynamics. The term exergy was coined in 1956 by Zoran Rant by using the Greek ex and ergon meaning from work.. Energy is never destroyed during a process; it changes from one form to another."}, {"url": "http://www.swedishexergy.com/what-is-exergy", "passage_text": "Exergy is the available work potential of energy and therefore the usable part of the total energy. As an industrial system performs, its function exergy is used to perform said function. Our technologies maximise the usable part of Energy and are therefore called Exergy technologies. Exergy technologies are ideally suited for sustainable development by maximizing usable part of the energy and minimizing losses. Over the past 35 years we have developed our Exergy technologies and they are today used in a wide range of industries such as Energy production, steel manufacturing, automobile manufacturing, pulp and paper, sludge treatment, sugar, tea, mining, tobacco and may more."}, {"url": "http://www.definitions.net/definition/exergy", "passage_text": "Exergy is the energy that is available to be used. After the system and surroundings reach equilibrium, the exergy is zero. Determining exergy was also the first goal of thermodynamics. The term exergy was coined in 1956 by Zoran Rant by using the Greek ex and ergon meaning from work.. Energy is never destroyed during a process; it changes from one form to another."}, {"url": "http://encyclopedia2.thefreedictionary.com/Exergy", "passage_text": "Exergy. a term used in thermodynamics to designate the maximum work a system can perform on moving from a given state to equilibrium with its surroundings. The work done by a system in a particular thermodynamic process is maximal only if the process is an equilibrium process. The portion of the total energy of a system that is available for conversion to useful work; in particular, the quantity of work that can be performed by a fluid relative to a reference condition, usually the surrounding ambient condition."}, {"url": "https://en.wikipedia.org/wiki/Exergy", "passage_text": "Exergy is a combination property of a system and its environment because it depends on the state of both the system and environment. The exergy of a system in equilibrium with the environment is zero. Exergy is neither a thermodynamic property of matter nor a thermodynamic potential of a system. Exergy and energy both have units of joules. However, from a theoretical point of view, exergy may be defined without reference to any environment. If the intensive properties of different finitely extended elements of a system differ, there is always the possibility to extract mechanical work from the system."}, {"url": "http://encyclopedia2.thefreedictionary.com/Exergy", "passage_text": "exergy. (thermodynamics). The portion of the total energy of a system that is available for conversion to useful work; in particular, the quantity of work that can be performed by a fluid relative to a reference condition, usually the surrounding ambient condition."}, {"url": "https://en.wikipedia.org/wiki/Exergy", "passage_text": "In contrast, exergy accounts for the irreversibility of a process due to increase in entropy (see Second Law of Thermodynamics). Exergy is always destroyed when a process involves a temperature change. This destruction is proportional to the entropy increase of the system together with its surroundings. However, from a theoretical point of view, exergy may be defined without reference to any environment. If the intensive properties of different finitely extended elements of a system differ, there is always the possibility to extract mechanical work from the system."}, {"url": "http://www.wisegeek.com/what-is-exergy.htm", "passage_text": "Calculating the exergy development for a system can be done with a variety of mathematical formulas. They are dependent on to what use energy is put in the system, whether to produce exergy heat, pressure, sound, light, or other forms of useful energy-based work. Measuring chemical exergy can be important as it is a way to represent the consumption of natural resources and the inevitable loss of a part of the mass of these resources on Earth as they are converted to heat, which is lost to space. A automobile engine is a good example of a system that consumes exergy to work."}]