[{"url": "http://www.kinetacore.com/physical-therapy/Overview-of-Dry-Needling-Functional-Dry-Needling-Courses/page150.html", "passage_text": "Functional Dry Needling. Dry Needling is a general term for a therapeutic treatment procedure that involves multiple advances of a filament needle into the muscle in the area of the body which produces pain and typically contains a trigger point. There is no injectable solution and typically the needle that is used is very thin."}, {"url": "https://en.wikipedia.org/wiki/Dry_needling", "passage_text": "Dry needling for the treatment of myofascial (muscular) trigger points is based on theories similar, but not exclusive, to traditional acupuncture; both acupuncture and dry needling target the trigger points, which is a direct and palpable source of patient pain."}, {"url": "http://www.schrierpt.com/dryneedling/", "passage_text": "Dry Needling is a treatment technique often used by physical therapists to eliminate. trigger points within muscles and other soft tissues. It requires using a sterile acupuncture needle that is inserted into the trigger point, causing an immediate release of the trigger point. This reduces pain, muscle tension and."}, {"url": "https://en.wikipedia.org/wiki/Dry_needling", "passage_text": "Dry needling (Myofascial Trigger Point Dry Needling) is the use of either solid filiform needles (also referred to as acupuncture needles) or hollow-core hypodermic needles for therapy of muscle pain, including pain related to myofascial pain syndrome."}, {"url": "http://www.neurosportphysicaltherapy.com/services/dry-needling", "passage_text": "Dry Needling. Dry Needling involves multiple advances of a filament needle into the muscle in the region of a Trigger Point'. The aim of Dry Needling is to achieve a local twitch response to release muscle tension and pain. Dry needling is an effective treatment for chronic pain of neuropathic origin with very few side effects."}, {"url": "http://www.denveracupunctureandchiro.com/dry-needling-denver/", "passage_text": "Dry needling. therapy is used to relieve muscle pain. Thin sterile needles are used in this procedure and are inserted at trigger points specific to the part of the body which is in pain."}, {"url": "http://www.osrpt.com/dry-needling/", "passage_text": "Dry Needling is a general term for a therapeutic treatment procedure that involves multiple advances of a filament needle into the muscle in the area of the body that radiates musculoskeletal pain and typically contains a trigger point."}]