[{"url": "http://www.medicinenet.com/viral_hepatitis/article.htm", "passage_text": "1 Viruses that primarily attack the liver are called hepatitis viruses. 2  There are several types of hepatitis viruses including types A, B, C, D, E, and possibly G. Types A, B, and C are the most common. 3  All hepatitis viruses can cause acute hepatitis. 4  Viral hepatitis types B and C can cause chronic hepatitis. 1 Symptoms of acute viral hepatitis include fatigue, flu-like symptoms, dark urine, light-colored stools, fever, and jaundice; however, acute viral hepatitis may occur with minimal symptoms that go unrecognized. 2  Rarely, acute viral hepatitis causes fulminant hepatic failure."}, {"url": "http://www.womenshealth.gov/publications/our-publications/fact-sheet/viral-hepatitis.html", "passage_text": "Hepatitis is most often caused by one of several viruses, which is why it is often called viral hepatitis. The most common types of viral hepatitis in the United States are hepatitis A, hepatitis B, and hepatitis C. Hepatitis A only causes acute infection. Hepatitis viruses B and C can cause both acute and chronic infections. Chronic hepatitis B and C are serious health problems. They can lead to: 1  Cirrhosis (suh-ROH-suhs). 2  Liver failure."}, {"url": "http://www.cancer.org/cancer/cancercauses/othercarcinogens/infectiousagents/infectiousagentsandcancer/infectious-agents-and-cancer-viruses", "passage_text": "Other viruses can also cause hepatitis (hepatitis A virus, for example), but only HBV and HCV can cause the long-term (chronic) infections that increase a person’s chance of liver cancer. In the United States, less than half of liver cancers are linked to HBV or HCV infection. Of the 2 viruses, infection with HBV is more likely to cause symptoms, such as a flu-like illness and jaundice (yellowing of the eyes and skin). Most adults recover completely from HBV infection within a few months."}, {"url": "http://www.mayoclinic.org/diseases-conditions/hepatitis-a/basics/causes/CON-20022163", "passage_text": "Causes. The hepatitis A virus, which causes the infection, usually is spread when a person ingests even tiny amounts of contaminated fecal matter. The hepatitis A virus infects liver cells and causes inflammation. The inflammation can impair liver function and cause other signs and symptoms of hepatitis A. "}, {"url": "http://www.who.int/features/qa/76/en/", "passage_text": "The condition can be self-limiting or can progress to fibrosis (scarring), cirrhosis or liver cancer. Hepatitis viruses are the most common cause of hepatitis in the world but other infections, toxic substances (e.g. alcohol, certain drugs), and autoimmune diseases can also cause hepatitis."}, {"url": "http://hepc.liverfoundation.org/what-is-hepatitis-c/", "passage_text": "Hepatitis C is a disease caused by a virus that infects the liver. The virus, called the Hepatitis C virus or HCV for short, is just one of the hepatitis viruses. The other common hepatitis viruses are A and B, which differ somewhat from HCV in the way they are spread and treated."}, {"url": "http://www.medicinenet.com/viral_hepatitis/article.htm", "passage_text": "1 All hepatitis viruses can cause acute hepatitis. 2  Viral hepatitis types B and C can cause chronic hepatitis. 3  Symptoms of acute viral hepatitis include fatigue, flu-like symptoms, dark urine, light-colored stools, fever, and jaundice; however, acute viral hepatitis may occur with minimal symptoms that go unrecognized. 1 Symptoms of acute viral hepatitis include fatigue, flu-like symptoms, dark urine, light-colored stools, fever, and jaundice; however, acute viral hepatitis may occur with minimal symptoms that go unrecognized. 2  Rarely, acute viral hepatitis causes fulminant hepatic failure."}, {"url": "http://www.medicinenet.com/viral_hepatitis/article.htm", "passage_text": "1 Viral hepatitis types B and C can cause chronic hepatitis. 2  Symptoms of acute viral hepatitis include fatigue, flu-like symptoms, dark urine, light-colored stools, fever, and jaundice; however, acute viral hepatitis may occur with minimal symptoms that go unrecognized. 1 Symptoms of acute viral hepatitis include fatigue, flu-like symptoms, dark urine, light-colored stools, fever, and jaundice; however, acute viral hepatitis may occur with minimal symptoms that go unrecognized. 2  Rarely, acute viral hepatitis causes fulminant hepatic failure."}, {"url": "https://en.wikipedia.org/wiki/Viral_hepatitis", "passage_text": "It may present in acute (recent infection, relatively rapid onset) or chronic forms. The most common causes of viral hepatitis are the five unrelated hepatotropic viruses Hepatitis A, Hepatitis B, Hepatitis C, Hepatitis D, and Hepatitis E. Main article: Hepatitis A. Hepatitis A or infectious jaundice is caused by hepatitis A virus (HAV), a picornavirus transmitted by the fecal-oral route often associated with ingestion of contaminated food. It causes an acute form of hepatitis and does not have a chronic stage."}, {"url": "https://en.wikipedia.org/wiki/Hepatitis", "passage_text": "Worldwide, viral hepatitis is the most common cause of liver inflammation. Other causes include autoimmune diseases and ingestion of toxic substances (notably alcohol), certain medications (such as paracetamol), some industrial organic solvents, and plants. Viral hepatitis is the most common cause of hepatitis worldwide. Other common causes of non-viral hepatitis include toxic and drug-induced, alcoholic, autoimmune, fatty liver, and metabolic disorders. Less commonly some bacterial, parasitic, fungal, mycobacterial and protozoal infections can cause hepatitis."}]