[{"url": "http://www.carolina.com/teacher-resources/Interactive/teaching-physiology-with-daphnia/tr10873.tr", "passage_text": "Daphnia, also known as the water flea, is a common microcrustacean inhabiting freshwater ponds and lakes of North America and Europe. Useful for demonstrating many physiological phenomena and easily maintained in culture, Daphnia is an ideal animal for experimentation. Daphnia are filter feeders. The setose thoracic legs act as sieves for filtering algae, bacteria, and small particles of debris from the water. Daphnia transfer food to the mouth and grind it with mandibles before it moves through the gut for digestion. Food retention is from ½ to 3 hr"}, {"url": "http://www.carolina.com/teacher-resources/Interactive/teaching-physiology-with-daphnia/tr10873.tr", "passage_text": "Biology. Species of Daphnia range in size from 0.5 to 5.0 mm in length. The Daphnia’s transparent bivalve carapace encloses the body except for the head and antennae. A large, conspicuous compound eye located in the head is sensitive to change in light quality, quantity, and polarization. Daphnia are filter feeders. The setose thoracic legs act as sieves for filtering algae, bacteria, and small particles of debris from the water. Daphnia transfer food to the mouth and grind it with mandibles before it moves through the gut for digestion. Food retention is from ½ to 3 hr"}, {"url": "http://animaldiversity.org/accounts/Daphnia_pulex/", "passage_text": "Daphnia pulex is the most common species of the water flea, an organism which can be found in almost every permanent, eutrophic (nutrient-rich) water body. A few species are marine, but generally Daphnia, including Daphnia pulex, are freshwater organisms. 1  Biogeographic Regions. 2  nearctic. 3  native. Daphnia pulex is the most common species of the group of organisms known as water fleas. Their common name was given because of their general appearance and jerky swimming motions which resembles that of the land flea."}, {"url": "https://en.wikipedia.org/wiki/Daphnia", "passage_text": "An individual Daphnia life-span depends on factors such as temperature and the abundance of predators, but can be 13–14 months in some cold, oligotrophic fish-free lakes. In typical conditions, however, the life cycle is much shorter, not usually exceeding 5–6 months. Play media. The beating heart of Daphnia under the microscope. The body of Daphnia is usually 1–5 millimetres (0.04–0.20 in) long, and is divided into segments, although this division is not visible. The head is fused, and is generally bent down towards the body with a visible notch separating the two."}, {"url": "http://bvsheart.weebly.com/daphnia-anatomy.html", "passage_text": "A BVS^2 WEBSITE. Daphnia are kidney-shaped organisms that contain a single compound eye, one double-branched antenna, and leaf-like limbs inside of the carapace, the exoskeleton of the daphnia, that produce a current to water that carries food and oxygen to different body parts of daphnia. Male vs Female. Male daphnia are usually distinguished from female daphnia by their smaller size, larger antennas, modified post-abdomen, and first legs, which are armed with a hook used in clasping. Female daphnia also contain a brood chamber with eggs, while males do not."}, {"url": "http://bvsheart.weebly.com/daphnia-anatomy.html", "passage_text": "In general, in the case of daphnia, the life span increases as the temperature decreases, due to lowered metabolic activity. The average life span of D. magna is about 40 days at 25 degrees Celsius and about 56 days at 20 degrees Celsius. Male vs Female. Male daphnia are usually distinguished from female daphnia by their smaller size, larger antennas, modified post-abdomen, and first legs, which are armed with a hook used in clasping. Female daphnia also contain a brood chamber with eggs, while males do not."}, {"url": "https://en.wikipedia.org/wiki/Daphnia", "passage_text": "The two most readily available species of Daphnia are D. pulex (small and most common) and D. magna (large). They are often associated with a related genus in the order Cladocera: Moina, which is in the Moinidae family instead of Daphniidae and is much smaller than D. pulex (approximately half the maximum length). Play media. The beating heart of Daphnia under the microscope. The body of Daphnia is usually 1–5 millimetres (0.04–0.20 in) long, and is divided into segments, although this division is not visible. The head is fused, and is generally bent down towards the body with a visible notch separating the two."}, {"url": "http://www.carolina.com/teacher-resources/Interactive/teaching-physiology-with-daphnia/tr10873.tr", "passage_text": "It is simple to restrain Daphnia yet allow free movement of the appendages. Place a small amount of Vaseline® in the bottom of a watch glass and cover with water. Add a Daphnia to the watch glass. Using a pipet, carefully withdraw the water so the animal falls on its side and adheres to the Vaseline®. Daphnia are filter feeders. The setose thoracic legs act as sieves for filtering algae, bacteria, and small particles of debris from the water. Daphnia transfer food to the mouth and grind it with mandibles before it moves through the gut for digestion. Food retention is from ½ to 3 hr"}]