[{"url": "http://www.definitions.net/definition/groyne", "passage_text": "Groyne. A groyne is a rigid hydraulic structure built from an ocean shore or from a bank that interrupts water flow and limits the movement of sediment. In the ocean, groynes create beaches, or avoid having them washed away by longshore drift. In a river, groynes prevent erosion and ice-jamming, which in turn aids navigation. Ocean groynes run generally perpendicular to the shore, extending from the upper foreshore or beach into the water. All of a groyne may be under water, in which case it is a submerged groyne."}, {"url": "http://www.coastalwiki.org/wiki/Groynes", "passage_text": "Introduction. A groyne is an active structure extending from shore into sea, most often perpendicularly or slightly obliquely to the shoreline. Adequate supply of sediment and existence of satisfactorily intensive longshore sediment transport are the sine qua non conditions of groynes efficiency. The wooden groynes are most often one-or two-row palisade structures. Effects of influence of the T-shape wooden pile groyne on the shore (local erosion on the lee side and accumulation on the other) are illustrated in Figure 3."}, {"url": "http://www.thefreedictionary.com/groyne", "passage_text": "groyne. n. 1. (Civil Engineering) a wall or jetty built out from a riverbank or seashore to control erosion. Also called: spur or breakwater. Noun. 1. groyne-a protective structure of stone or concrete; extends from shore into the water to prevent a beach from washing away. breakwater, jetty, seawall, bulwark, groin, mole. barrier-a structure or object that impedes free movement"}, {"url": "http://www.thefreedictionary.com/Groynes", "passage_text": "Noun. 1. groyne-a protective structure of stone or concrete; extends from shore into the water to prevent a beach from washing away. breakwater, jetty, seawall, bulwark, groin, mole. barrier-a structure or object that impedes free movement. Translations. groyne. n. 1. (Civil Engineering) a wall or jetty built out from a riverbank or seashore to control erosion. Also called: spur or breakwater"}, {"url": "https://en.wikipedia.org/wiki/Groyne", "passage_text": "A groyne (groin in the United States) is a rigid hydraulic structure built from an ocean shore (in coastal engineering) or from a bank (in rivers) that interrupts water flow and limits the movement of sediment. It is usually made out of wood or concrete. In the ocean, groynes create beaches, or prevent them being washed away by longshore drift. In a river, groynes prevent erosion and ice-jamming, which in turn aids navigation. Ocean groynes run generally perpendicular to the shore, extending from the upper foreshore or beach into the water. All of a groyne may be under water, in which case it is a submerged groyne. The areas between groups of groynes are groyne fields. Groynes are generally made of wood, concrete, or rock piles, and placed in groups. They are often used in tandem with seawalls"}, {"url": "http://www.audioenglish.org/dictionary/groyne.htm", "passage_text": "• GROYNE (noun). The noun GROYNE has 1 sense: 1. a protective structure of stone or concrete; extends from shore into the water to prevent a beach from washing away. Familiarity information: GROYNE used as a noun is very rare. Dictionary entry details. "}, {"url": "http://www.oxforddictionaries.com/definition/english/groyne", "passage_text": "Example sentences. 1  Four new groynes-timber planking walls running down the beach towards the water-will help trap sand and give greater protection to the base of the wall. 2  Visit any coastal area and you will see defence features such as groynes, sea walls and banks. 1 Visit any coastal area and you will see defence features such as groynes, sea walls and banks. 2  We're blowing all this money to build houses and ruin habitat with so-called beach renourishment and jetties, groins and seawalls."}]