[{"url": "https://en.wikipedia.org/wiki/Culprit", "passage_text": "A culprit, under English law properly the prisoner at the bar, is one accused of a crime. The term is used, generally, of one guilty of an offence. In origin the word is a combination of two Anglo-French legal words, culpable: guilty, and prit or prest: Old French: ready."}, {"url": "http://www.yourdictionary.com/culprit", "passage_text": "1 An example of a culprit is someone who was responsible for robbing a bank. 2  An example of a culprit is a paper jam that is responsible for a printer not printing."}, {"url": "http://shabdkosh.com/translate/culprit/culprit-meaning-in-Hindi-English", "passage_text": "Information provided on culprit. Meaning and definitions of culprit, translation in Hindi language for culprit with similar and opposite words. Also find spoken pronunciation of culprit in Hindi and in English language."}, {"url": "http://www.merriam-webster.com/dictionary/culprit", "passage_text": "Full Definition of CULPRIT. 1. : one accused of or charged with a crime. 2. : one guilty of a crime or a fault. 3. : the source or cause of a problem. See culprit defined for English-language learners. See culprit defined for kids. ADVERTISEMENT."}, {"url": "http://www.definitions.net/definition/culprit", "passage_text": "A culprit, under English law properly the prisoner at the bar, is one accused of a crime. The term is used, generally, of one guilty of an offence. In origin the word is a combination of two Anglo-French legal words, culpable: guilty, and prit or prest: Old French: ready."}, {"url": "http://shabdkosh.com/translate/culprit/culprit-meaning-in-Hindi-English", "passage_text": "Hindi meaning of culprit, culprit meaning in Hindi, culprit definition, examples and pronunciation of culprit in Hindi language."}, {"url": "http://www.yourdictionary.com/culprit", "passage_text": "noun. The culprit is defined as the person who is responsible for something, or is the thing that is causing a bad outcome. 1  An example of a culprit is someone who was responsible for robbing a bank."}]