[{"url": "http://accountingexplained.com/financial/inventories/avco-method", "passage_text": "Average Cost (AVCO) Method. Average cost method (AVCO) calculates the cost of ending inventory and cost of goods sold for a period on the basis of weighted average cost per unit of inventory. Weighted average cost per unit is calculated using the following formula: Apply AVCO method of inventory valuation on the following information, first in periodic inventory system and then in perpetual inventory system to determine the value of inventory on hand on Mar 31 and cost of goods sold during March."}, {"url": "http://www.accountingtools.com/weighted-average-method", "passage_text": "When using the weighted average method, divide the cost of goods available for sale by the number of units available for sale, which yields the weighted-average cost per unit. In this calculation, the cost of goods available for sale is the sum of beginning inventory and net purchases. The total of all purchased or beginning inventory units is 450 (150 beginning inventory + 300 purchased). The weighted average cost per unit is therefore $257.78 ($116,000 ÷ 450 units.)."}, {"url": "http://www.accountingtools.com/weighted-average-method", "passage_text": "Weighted Average Method Overview. The weighted average method is used to assign the average cost of production to a product. Weighted average costing is commonly used in situations where: 1  Inventory items are so intermingled that it is impossible to assign a specific cost to an individual unit. The total of all purchased or beginning inventory units is 450 (150 beginning inventory + 300 purchased). The weighted average cost per unit is therefore $257.78 ($116,000 ÷ 450 units.)."}, {"url": "http://www.investopedia.com/ask/answers/09/weighted-average-fifo-lilo-accounting.asp", "passage_text": "The main difference between weighted average cost accounting, LIFO, and FIFO methods of accounting is the difference in which each method calculates inventory and cost of goods sold. The weighted average cost method uses the average of the costs of the goods to assign costs. In other words, weighted average uses the formula: Total cost of items in inventory available for sale divided by total number of units available for sale. In contrast, FIFO (first in, first out) accounting means that the costs assigned to goods are the costs for the first goods bought."}, {"url": "http://www.accountingtools.com/weighted-average-method", "passage_text": "You then use this weighted-average figure to assign a cost to both ending inventory and the cost of goods sold. The net result of using weighted average costing is that the recorded amount of inventory on hand represents a value somewhere between the oldest and newest units purchased into stock. The total of all purchased or beginning inventory units is 450 (150 beginning inventory + 300 purchased). The weighted average cost per unit is therefore $257.78 ($116,000 ÷ 450 units.)."}, {"url": "http://www.accounting-basics-for-students.com/fifo-method.html", "passage_text": "In our example above (assuming the weighted average cost method was allowed for valuing the lollypops), the value of our closing inventories would be calculated as follows: Using the weighted average cost method, our closing inventory amounts to $1,059. This equates to a cost of $1.06 per lollypop ($1,059/1,000 lollypops). Oddly enough, the LIFO method is the preferred inventory valuation method in the United States but is disallowed in non-US countries."}, {"url": "http://simplestudies.com/accounting-for-inventories.html/page/2", "passage_text": "The weighted-average method (also called the average cost method) provides that the average unit cost is included in the cost of goods sold. Weighted-average (average cost) inventory costing method assumes that the average cost of inventories is to be recognized as the cost of goods sold. In order to determine the weighted-average, you need to add all costs of items on hand and divide the result by the number of items. In our example, the calculation is as follows: ($5,000 + $5,500) ÷ 2 = $5,250. This amount will be charged to the cost of goods sold when an item is sold."}, {"url": "http://accountingexplained.com/financial/inventories/avco-method", "passage_text": "Like FIFO and LIFO methods, AVCO is also applied differently in periodic inventory system and perpetual inventory system. In periodic inventory system, weighted average cost per unit is calculated for the entire class of inventory. Apply AVCO method of inventory valuation on the following information, first in periodic inventory system and then in perpetual inventory system to determine the value of inventory on hand on Mar 31 and cost of goods sold during March."}, {"url": "http://www.accountingformanagement.org/weighted-average-costing-method-of-inventory-valuation/", "passage_text": "Cost of goods sold: 2,500 units × $10.5118 = $26,280 Cost of ending inventory: 900 units × $10.5118 = $9,460. When average costing method is used in a perpetual inventory system, an average unit cost figure is computed each time a purchase is made. Average costing method in periodic inventory system: When average costing method is used in a periodic inventory system, the cost of goods sold and the cost of ending inventory is computed using weighted average unit cost. Weighted average unit cost is computed using the following formula :"}]