[{"url": "http://www.ehow.com/info_8575349_temperature-mold-grow.html", "passage_text": "Finally, mold requires a specific temperature range to grow. Mold does not typically like to grow in cold temperatures, it prefers to grow at temperatures between 60 to 80 degrees Fahrenheit, according to the Department of Health and Human Services in North Carolina."}, {"url": "http://www.intuitiveenvsol.com/What_Is_Mold_.html", "passage_text": "Mold, one type of fungus, is different from plants, animals and bacteria. Molds are eukaryotic micro-organisms that are decomposers of dead organic material such as leaves, wood and plants. The spores and hair-like bodies of individual mold colonies are too small for us to see without a microscope."}, {"url": "http://epi.publichealth.nc.gov/oee/mold/grow.html", "passage_text": "It is normal to find some mold spores in the air and a few mold spores on some surfaces. Unless large numbers of spores become airborne, there is usually little problem. However indoor mold growth on surfaces and materials is abnormal."}, {"url": "http://www.ehow.com/info_8575349_temperature-mold-grow.html", "passage_text": "Although most molds grow best around 70 degrees Fahrenheit, different types of mold require certain temperatures to grow. For example, the mold type Penicillium grows best at 34 degrees Fahrenheit, which is the typical temperature inside of a refrigerator. In contrast, Aspergillus is mold that prefers warmer temperatures of 98 degrees Fahrenheit, which is the normal temperature inside the human body."}, {"url": "http://epi.publichealth.nc.gov/oee/mold/grow.html", "passage_text": "Mold. Where It Can Grow. It is normal to find some mold spores in the air and a few mold spores on some surfaces. Unless large numbers of spores become airborne, there is usually little problem. However indoor mold growth on surfaces and materials is abnormal."}, {"url": "http://www.realtor.org/realtororg.nsf/pages/moldfaq", "passage_text": "Mold requires nutrients, water, oxygen and favorable temperatures to grow. Nutrients for mold are present in dead organic material such as wood, paper or fabrics; mold can also derive nutrients from some synthetic products such as paints and adhesives."}, {"url": "http://epi.publichealth.nc.gov/oee/mold/conditions.html", "passage_text": "Mold. Conditions That Promote Mold Growth. All of the conditions needed for mold growth (food sources and appropriate temperatures) are present in the indoor environment with the exception of adequate moisture. Prevention of mold growth indoors can not be achieved without proper moisture control."}]