[{"url": "http://www.healthline.com/health/kuru", "passage_text": "These diseases (as well as Kuru) are spongiform disease. All spongiform diseases cause sponge-like holes in the brain and are fatal. According to the University of Utah (UT), C-J disease is the most common of the spongiform diseases (UT, 2012). Even so, C-J disease only occurs in one in one million people. Kuru developed from the people of New Guinea eating brains of dead relatives during funeral rites. Women and children were of the majority infected with kuru. This is because they were the primary participants in the funerary rituals. The New Guinea government has discouraged the practice of cannibalism."}, {"url": "http://www.anthropology.ua.edu/bindon/ant570/Papers/McGrath/McGrath.htm", "passage_text": "Kuru Among the South Fore. Kuru is a neurodegenerative disorder that surfaced among the South Fore of New Guinea, and the dynamics of this disease have been explored by various scholars. Lindenbaum worked with the South Fore and studied the kuru disease. Symptoms are generally common among prion diseases, as a comparison with Creutzfeldt-Jakob disease will demonstrate. Comparison to CJD. Creutzfeldt-Jakob disease displays striking similarities to kuru in regards to symptoms displayed and organ damage (mostly to the brain)."}, {"url": "http://www.healthline.com/health/kuru", "passage_text": "Kuru is characterized by difficulty walking, swallowing, and chewing. Symptoms also include loss of coordination and muscle twitching. The name kuru translates to “shiver” or “trembling in fear.” Kuru has no known cure and is generally fatal within one year. Kuru developed from the people of New Guinea eating brains of dead relatives during funeral rites. Women and children were of the majority infected with kuru. This is because they were the primary participants in the funerary rituals. The New Guinea government has discouraged the practice of cannibalism."}, {"url": "https://en.wikipedia.org/wiki/Kuru_(disease)", "passage_text": "Kuru is an incurable degenerative neurological disorder endemic to tribal regions of Papua New Guinea. It is a type of transmissible spongiform encephalopathy, caused by a prion found in humans. The symptoms of kuru are divided into three specific stages. The first, ambulant stage, exhibits unsteady stance and gait, decreased muscle control, tremors, deterioration of speech, and dysarthria (slurred speech)."}, {"url": "http://www.ninds.nih.gov/disorders/cjd/detail_cjd.htm", "passage_text": "CJD is the most common of the known human TSEs. Other human TSEs include kuru, fatal familial insomnia (FFI), and Gerstmann-Straussler-Scheinker disease (GSS). Kuru was identified in people of an isolated tribe in Papua New Guinea and has now almost disappeared. 1 This is by far the most common type of CJD and accounts for at least 85 percent of cases. 2  In hereditary CJD, the person has a family history of the disease and/or tests positive for a genetic mutation associated with CJD. About 5 to 10 percent of cases of CJD in the United States are hereditary."}, {"url": "http://www.encyclopedia.com/topic/Kuru.aspx", "passage_text": "Definition. Kuru is the name of a progressively disabling and ultimately fatal brain infection caused by a unique protein particle called a prion. Kuru was first described in a specific tribal group in Papua, New Guinea. The word kuru means to shake or tremble in this tribal group's language. Individuals in New Guinea are believed to have acquired the infection through a cannibalistic ritual involving the blood and brains of deceased tribal members."}, {"url": "http://www.healthline.com/health/kuru", "passage_text": "Kuru is an extremely rare and fatal nervous system disease. The disease reached its peak during the 1950s and 1960s among the Fore people in the highlands of New Guinea. Kuru developed from the people of New Guinea eating brains of dead relatives during funeral rites. Women and children were of the majority infected with kuru. This is because they were the primary participants in the funerary rituals. The New Guinea government has discouraged the practice of cannibalism."}, {"url": "https://en.wikipedia.org/wiki/Kuru_(disease)", "passage_text": "The term kuru derives from the Fore word kuria/guria (to shake), a reference to the body tremors that are a classic symptom of the disease; it is also known among the Fore as the laughing sickness due to the pathologic bursts of laughter people would display when afflicted with the disease. The symptoms of kuru are divided into three specific stages. The first, ambulant stage, exhibits unsteady stance and gait, decreased muscle control, tremors, deterioration of speech, and dysarthria (slurred speech)."}, {"url": "http://wiki.ggc.usg.edu/wiki/Kuru_Fall_'11", "passage_text": "Prion-caused diseases such as kuru occur due to an accumulation of a disease-related iosoform of host-encoded prion proteins through a posttranslational process involving a conformational change and aggregation (1). This irregular prion protein isoform is believed to be the primary cause of kuru's infectious prion (1). Primarily, the women of the Fore were most affected from the consumption of the brain. Kuru became the most common cause of death in women of childbearing age (2). However, approximately two percent of men were affected from the disease (2)."}, {"url": "https://en.wikipedia.org/wiki/Kuru_(disease)", "passage_text": "Kuru is believed to be caused by prions and is related to CJD. Although it is considered a transmissible prion disease, some evidence shows the origin of the outbreak was due to eating a human (or a corpse) with sporadic CJD, thus implying a common pathophysiology. The symptoms of kuru are divided into three specific stages. The first, ambulant stage, exhibits unsteady stance and gait, decreased muscle control, tremors, deterioration of speech, and dysarthria (slurred speech)."}]