[{"url": "http://thesaurus.yourdictionary.com/consider", "passage_text": "To direct the eyes on an object: 1  chew on (or over), cogitate, contemplate, deliberate, entertain, excogitate, meditate, mull, muse 1, ponder, reflect, revolve, ruminate, study, think, think out, think over, think through, turn over, weigh. 2  Idioms: cudgel one's brains, put on one's thinking cap, rack one's brain. "}, {"url": "http://anotherwordfor.info/consider/", "passage_text": "Another word for consider word list. Below are a number of words whose meaning is similar to consider. 1  be attentive to. 2  contemplate. 3  examine. 4  give a thought to. 5  give heed to. 6  give or pay attention to. 7  heed. 8  mark. 9  mind. 10  ponder. 11  reflect upon. 12  study. 13  take into consideration. 14  weigh."}, {"url": "http://www.macmillandictionary.com/dictionary/british/consider", "passage_text": "90% of the time, speakers of English use just 7,500 words in speech and writing. These words appear in red, and are graded with stars. One-star words are frequent, two-star words are more frequent, and three-star words are the most frequent. Close. Blog. A must for anyone with an interest in the changing face of language. The Macmillan Dictionary blog explores English as it is spoken around the world today. Definition and synonyms of consider from the online English dictionary from Macmillan Publishers Limited."}, {"url": "https://answers.yahoo.com/question/index?qid=20070428095908AA1pogp", "passage_text": "Next. like for examples, the greasers are considered hoodlums in comparison to the other group of people who are considered a better group, both considered, i cant find another word for it. Add your answer."}, {"url": "http://www.thesaurus.com/browse/consider", "passage_text": "verb. examine and determine. 1  assay. 2  beat a dead horse. 3  chew over. 4  confab. 5  consider. 6  estimate. 7  evaluate. 8  figure. 9  figure out. 10  get down to brass tacks. 11  hash. 12  inspect. 13  interpret. 14  investigate. 15  judge. 16  kick around. 17  rehash. 18  resolve. 19  scrutinize. 20  sort out. 21  spell out. 22  study. 23  talk game. 24  test. 25  think through. "}, {"url": "http://english.stackexchange.com/questions/101284/whats-another-word-for-considered", "passage_text": "English Language & Usage Stack Exchange is a question and answer site for linguists, etymologists, and serious English language enthusiasts. It's 100% free, no registration required. If this is indeed part of a resume or some such self portrait, saying that you have always been different to everyone else isn't flattering. Instead you'd say something like you always strived to achieve above others. Just being different isn't an asset. – Chris Jan 24 '13 at 1:07."}, {"url": "http://www.merriam-webster.com/thesaurus/consider", "passage_text": "2. Synonyms chew over, cogitate, consider, contemplate, debate, deliberate, entertain, eye, kick around, meditate, mull (over), perpend, pore (over), question, revolve, ruminate, study, think (about or over), turn, weigh, wrestle (with). "}, {"url": "https://en.wikipedia.org/wiki/Acronym", "passage_text": "An acronym is an abbreviation, used as a word, which is formed from the initial components in a phrase or a word. Usually these components are individual letters (as in NATO or laser) or parts of words or names (as in Benelux). While initial letters are commonly used to form an acronym, the original definition was a word made from the initial letters or syllables of other words, for example UNIVAC from UNIVersal Automatic Computer. In English, acronyms pronounced as words may be a 20th-century phenomenon."}, {"url": "http://www.thesaurus.net/considered", "passage_text": "1 A Shakespearean tragedy as so far considered may be called a story of exceptional calamity leading to the death of a man in high estate. 2  But it is clearly much more than this, and we have now to regard it from another side. 3  Andrew Coyle Bradley. "}]