[{"url": "http://www.thefreedictionary.com/standard+atmosphere", "passage_text": "standard atmosphere-a unit of pressure: the pressure that will support a column of mercury 760 mm high at sea level and 0 degrees centigrade. "}, {"url": "http://www.engineeringtoolbox.com/stp-standard-ntp-normal-air-d_772.html", "passage_text": "SATP-Standard Ambient Temperature and Pressure is also used in chemistry as a reference: 1  SATP-Standard Ambient Temperature and Pressure is a reference with temperature of 25 oC (298.15 K) and pressure of 101 kPa. NTP-Normal Temperature and Pressure. NTP is commonly used as a standard condition for testing and documentation of fan capacities: 1  NTP-Normal Temperature and Pressure-is defined as air at 20oC (293.15 K, 68oF) and 1 atm (101.325 kN/m2, 101.325 kPa, 14.7 psia, 0 psig, 29.92 in Hg, 407 in H2O, 760 torr)."}, {"url": "https://en.wikipedia.org/wiki/Atmosphere_(unit)", "passage_text": "The standard atmosphere (symbol: atm) is a unit of pressure defined as 101325 Pa (1.01325 bar). It is sometimes used as a reference or standard pressure. For example, a partial pressure of oxygen is calibrated typically using air at sea level, so is expressed in units of atm. The old European unit technical atmosphere (at) is equal to 1 kilogram-force per square centimetre (kgf/cm 2), 7004980665000000000♠98066.5 Pa."}, {"url": "http://www.sensorsone.com/atm-standard-atmosphere-pressure-unit/", "passage_text": "atm – Standard Atmosphere Pressure Unit. Standard Atmosphere is mainly used as a reference value for the average atmospheric pressure at sea level. It is often used to indicate the depth rating for a water resistant watch, but otherwise is rarely used as a unit for measuring pressure. The standard atmosphere value has many uses in atmospheric calculations and one example of this is the FAA procedures for setting aircraft altimeters at altitudes of 18,000 feet and above to ensure all aircraft are using the same pressure reference when measuring the height above"}, {"url": "http://www.sensorsone.com/atm-standard-atmosphere-pressure-unit/", "passage_text": "Since the atmospheric pressure varies with changes in weather and altitude, it is convenient to standardise on a single value so that ratings, measurements and specifications can be compared. In particular 1 Standard Atmosphere is used by the Aviation industry as the reference standard for sea level pressure. The standard atmosphere value has many uses in atmospheric calculations and one example of this is the FAA procedures for setting aircraft altimeters at altitudes of 18,000 feet and above to ensure all aircraft are using the same pressure reference when measuring the height above sea level."}, {"url": "http://www.engineeringtoolbox.com/stp-standard-ntp-normal-air-d_772.html", "passage_text": "The definition of STP-Standard Temperature and Pressure and NTP-Normal Temperature and Pressure. Since temperature and air pressure vary from place to place it is necessary with a standard reference condition to compare testing and documentation of chemical and physical processes. Note! There is a variety of alternative definitions for the standard reference conditions of temperature and pressure. NTP-Normal Temperature and Pressure. NTP is commonly used as a standard condition for testing and documentation of fan capacities: 1  NTP-Normal Temperature and Pressure-is defined as air at 20oC (293.15 K, 68oF) and 1 atm (101.325 kN/m2, 101.325 kPa, 14.7 psia, 0 psig, 29.92 in Hg, 407 in H2O, 760 torr)."}, {"url": "http://chemistry.about.com/od/chemistryglossary/g/Atmosphere-Definition.htm", "passage_text": "Atmosphere may refer to the gas surrounding a body or it may be a unit of pressure. Definition: Atmosphere refers to the gases surrounding a star or planetary body held in place by gravity. Atmosphere is also a unit of pressure. One atmosphere (1 atm) is defined to be equal to 101,325 Pascals"}, {"url": "http://chemistry.about.com/od/gas2/f/What-Is-Stp-In-Chemistry.htm", "passage_text": "Answer: STP in chemistry is the abbreviation for Standard Temperature and Pressure. STP most commonly is used when performing calculations on gases, such as gas density. The standard temperature is 273 K (0° Celsius) and the standard pressure is 1 atm pressure. At STP, one mole of gas occupies 22.4 L of volume (molar volume). STP commonly is used when standard state conditions are applied to calculations. Standard state conditions, which include standard temperature and pressure, may be recognized in calculations by the superscript circle."}, {"url": "http://www.sensorsone.com/atm-standard-atmosphere-pressure-unit/", "passage_text": "The standard constant value used for atmospheric pressure at sea level is 1 atm (standard atmosphere) which equals 101325 pascals in SI units, and is equivalent to 29.9213 inches of mercury. The standard atmosphere value has many uses in atmospheric calculations and one example of this is the FAA procedures for setting aircraft altimeters at altitudes of 18,000 feet and above to ensure all aircraft are using the same pressure reference when measuring the height above sea level."}]