[{"url": "http://kingsriverlife.com/07/16/what-is-the-slow-food-movement/", "passage_text": "FROM THE 2011 Articles,andFood Fun,andGoing Green,andMargaret Mendel SECTIONS. by Margaret Mendel. The Slow Food Movement is an international movement that began in Italy in 1986 as an endeavor to keep a McDonald’s from opening near the Spanish Steps in Rome. In that year a Slow Food Manifesto was signed by delegates from fifteen countries in protest against big international business interests."}, {"url": "http://www.slowfoodusa.org/what-we-do", "passage_text": "What We Do. Slow Food is a global, grassroots organization with more than 150,000 members and 2,000 food communities throughout 150+ countries. Slow Food USA, a national association of Slow Food, has 175 local and campus chapters that coordinate local activities, projects and events."}, {"url": "https://en.wikipedia.org/wiki/Slow_Food", "passage_text": "Slow Food began in Italy with the founding of its forerunner organisation, Arcigola, in 1986 to resist the opening of a McDonald's near the Spanish Steps in Rome. In 1989, the founding manifesto of the international Slow Food movement was signed in Paris, France by delegates from 15 countries."}, {"url": "http://www.sheknows.com/food-and-recipes/articles/803375/what-is-slow-food", "passage_text": "According to SlowFood.com, the slow food movement was started to counteract fast food and fast life, and educate locals about their regional fare. What began as a group of 62 eco-conscious, food-loving members in Bra, Italy has now blossomed into an international movement of more than 80,000 enthusiasts."}, {"url": "http://medical-dictionary.thefreedictionary.com/Slow+Food+Movement", "passage_text": "Slow Food Movement. An international movement begun by Carlo Petrini with a forerunner organisation, Arcigola, founded in 1986 to resist the opening of a McDonald's (fast food restaurant) near the Spanish Steps in Rome."}, {"url": "https://www.slowfood.org.uk/about/about/what-we-do/", "passage_text": "Slow Food was initially founded by Carlo Petrini and a group of activists in Italy during the 1980s with the aim of defending regional traditions, good food, gastronomic pleasure and a slow pace of life."}, {"url": "https://en.wikipedia.org/wiki/Slow_Food", "passage_text": "Slow Food is an international movement founded by Carlo Petrini in 1986."}]