[{"url": "http://www.rightdiagnosis.com/v/viral_hepatitis/intro.htm", "passage_text": "Viral hepatitis is a general name for several forms of hepatitis that are caused by a virus. Viral hepatitis is the most common type of hepatitis, a group of serious diseases that cause inflammation of the liver and liver damage. Viral hepatitis is often called infectious hepatitis, and the viruses that cause it are contagious and can be passed from person to person. Viral hepatitis includes hepatitis A, hepatitis B, hepatitis C, hepatitis D, and hepatitis E. Each of these types of viral hepatitis are caused by the hepatitis virus of the same name, such as the hepatitis A virus. The most common forms of viral hepatitis in the U.S. are hepatitis A, hepatitis B, and hepatitis C. All types of viral hepatitis cause inflammation of the liver. The liver is a vital organ, and normal functioning of the liver is crucial to health and life"}, {"url": "http://emedicine.medscape.com/article/775507-overview", "passage_text": "In the United States, viral hepatitis is most commonly caused by hepatitis A virus (HAV), hepatitis B virus (HBV), and hepatitis C virus (HCV). These 3 viruses can all result in acute disease with symptoms of nausea, abdominal pain, fatigue, malaise, and jaundice. Additionally, HBV and HCV can lead to chronic infection. "}, {"url": "http://www.medicinenet.com/viral_hepatitis/article.htm", "passage_text": "1 Viral hepatitis types B and C can cause chronic hepatitis. 2  Symptoms of acute viral hepatitis include fatigue, flu-like symptoms, dark urine, light-colored stools, fever, and jaundice; however, acute viral hepatitis may occur with minimal symptoms that go unrecognized. Viral hepatitis definition and overview. Hepatitis means inflammation of the liver. Many illnesses and conditions can cause inflammation of the liver, for example, drugs, alcohol, chemicals, and autoimmune diseases. Many viruses, for example, the virus of mononucleosis and the cytomegalovirus can inflame"}, {"url": "https://en.wikipedia.org/wiki/Viral_hepatitis", "passage_text": "It may present in acute (recent infection, relatively rapid onset) or chronic forms. The most common causes of viral hepatitis are the five unrelated hepatotropic viruses Hepatitis A, Hepatitis B, Hepatitis C, Hepatitis D, and Hepatitis E. In addition to the nominal hepatitis viruses, other viruses that can also cause liver inflammation include Herpes simplex, Cytomegalovirus, Epstein–Barr virus, and Yellow fever."}, {"url": "https://en.wikipedia.org/wiki/Hepatitis", "passage_text": "Worldwide, viral hepatitis is the most common cause of liver inflammation. Other causes include autoimmune diseases and ingestion of toxic substances (notably alcohol), certain medications (such as paracetamol), some industrial organic solvents, and plants. In viral hepatitis, the presence of the virus in the liver cells causes the immune system to attack the liver, resulting in inflammation and impaired function. In autoimmune hepatitis, the immune system attacks the liver due to the autoimmune disease."}, {"url": "http://www.webmd.com/hepatitis/tc/viral-hepatitis-topic-overview", "passage_text": "A virus that causes hepatitis can be spread from one person to another. Hepatitis B, C, and D viruses are spread when an uninfected person comes in contact with blood, semen, or vaginal fluid (including menstrual blood) that is infected with one of these viruses. Hepatitis C is a liver disease caused by an infection with the hepatitis C virus. The liver becomes inflamed and swollen and stops working as it should. Hepatitis C is a serious disease because the liver is needed to remove toxins that build up in the blood."}, {"url": "http://www.medicinenet.com/viral_hepatitis/article.htm", "passage_text": "1 All hepatitis viruses can cause acute hepatitis. 2  Viral hepatitis types B and C can cause chronic hepatitis. 3  Symptoms of acute viral hepatitis include fatigue, flu-like symptoms, dark urine, light-colored stools, fever, and jaundice; however, acute viral hepatitis may occur with minimal symptoms that go unrecognized. Viral hepatitis definition and overview. Hepatitis means inflammation of the liver. Many illnesses and conditions can cause inflammation of the liver, for example, drugs, alcohol, chemicals, and autoimmune diseases. Many viruses, for example, the virus of mononucleosis and the cytomegalovirus can inflame"}, {"url": "http://www.medicinenet.com/viral_hepatitis/article.htm", "passage_text": "1 Viruses that primarily attack the liver are called hepatitis viruses. 2  There are several types of hepatitis viruses including types A, B, C, D, E, and possibly G. Types A, B, and C are the most common. 3  All hepatitis viruses can cause acute hepatitis. 4  Viral hepatitis types B and C can cause chronic hepatitis. Viral hepatitis definition and overview. Hepatitis means inflammation of the liver. Many illnesses and conditions can cause inflammation of the liver, for example, drugs, alcohol, chemicals, and autoimmune diseases. Many viruses, for example, the virus of mononucleosis and the cytomegalovirus can inflame"}, {"url": "http://www.medicinenet.com/viral_hepatitis/article.htm", "passage_text": "The most common hepatitis viruses are types A, B, and C. Reference to the hepatitis viruses often occurs in an abbreviated form (for example, HAV, HBV, HCV represent hepatitis viruses A, B, and C, respectively.) The focus of this article is on these viruses that cause the majority of human viral hepatitis. Viral hepatitis definition and overview. Hepatitis means inflammation of the liver. Many illnesses and conditions can cause inflammation of the liver, for example, drugs, alcohol, chemicals, and autoimmune diseases. Many viruses, for example, the virus of mononucleosis and the cytomegalovirus can inflame"}]