[{"url": "http://news.travel.aol.com/2010/10/11/safe-and-dangerous-places-in-cancun/", "passage_text": "Some Parts of Downtown Cancun. Downtown Cancun, especially the area closest to the Hotel Zone, is relatively safe for tourists. However, the farther you get from the Hotel Zone, the less glitzy and less touristy it becomes."}, {"url": "http://www.travelandleisure.com/local-experts/cancun/5-things-do-downtown-cancun", "passage_text": "The heart of Cancun recently got a facelift: Downtown Cancun’s main street, Avenida Tulum, was upgraded to feature wide pedestrian paths on either side, perfect for a leisurely stroll lined with shops, small markets, bars, and the City Hall building."}, {"url": "http://www.travelandleisure.com/local-experts/cancun/5-things-do-downtown-cancun", "passage_text": "The city of Cancun is divided into two sections: the Hotel Zone island with the destination’s beaches and resorts, and Downtown Cancun where the locals live."}, {"url": "http://wikitravel.org/en/Cancun", "passage_text": "Also try the clubs at Yaxchilan Avenue, located in downtown Cancun, where all the locals hang out. 1  Los 4 Elementos, Hotel Xbalamque (Ave Yaxchilan 31). 2  Try the live music bar Los 4 Elementos. 3  They open and play live music from 11PM until the last customer leaves."}, {"url": "http://www.travelandleisure.com/local-experts/cancun/5-things-do-downtown-cancun", "passage_text": "Most tourists spend their entire vacation in the Hotel Zone, but more adventurous tourists know that Downtown Cancun has its own inviting attractions. After over a decade living in this city, I often prefer to spend my weekends in the Downtown area because of its fun social vibe."}, {"url": "http://news.travel.aol.com/2010/10/11/safe-and-dangerous-places-in-cancun/", "passage_text": "Xel-Ha, Xcaret, Chichen Itza, and Tulum are all popular day trips from Cancun and are safe areas for travelers to visit."}, {"url": "http://news.travel.aol.com/2010/10/11/safe-and-dangerous-places-in-cancun/", "passage_text": "1. The Hotel Zone. Travelers visiting Cancun usually stay in the area known as the Hotel Zone, which contains several safe places for visitors. This 14-mile stretch of land lies between downtown Cancun and the airport, and also between the Caribbean Sea and Laguna Nichupte."}, {"url": "http://news.travel.aol.com/2010/10/11/safe-and-dangerous-places-in-cancun/", "passage_text": "Tags: Cancun, dangerous places, dangers, mexico, place safe, Safe, safe america, safe areas, safe city, safe places, scary places, tourists, Unsafe. If you are interested in contributing to AOL Travel, join our network of writers and check out travel assignments on Seed.com."}, {"url": "https://www.expedia.com/Downtown-Cancun-Cancun-Hotels-Shopping-Hotel.0-n6050865-0-tShoppingHotel.Travel-Guide-Filter-Hotels", "passage_text": "Also known as El Centro, Cancun Downtown is where locals live and shop. Plaza las Americas is an American-style shopping center with large department stores and small specialty shops. Mercado Veintiocho (Market 28), an open-air flea market, is an alternative to the chain shops."}]