[{"url": "http://whatscookingamerica.net/History/CevicheNotes.htm", "passage_text": "Linda's favorite and easy-to-make ceviche recipe: Shrimp Martini Ceviche with Chili-Cumin Chips. The new in food of the beginning of the 21st century is actually an old world dish from South America called Ceviche. The preparation and consumption of ceviche is practically a religion in parts of Mexico, Central, and South America, and it seems as though there are as many varieties of ceviche as people who eat it. Latin American flavors first found a place on Florida menus with South Florida's New World Cuisine in the late 1980's."}, {"url": "https://en.wikipedia.org/wiki/Ceviche", "passage_text": "Ceviche (. [seˈβitʃe]) is a seafood dish popular in the coastal regions of Latin America. The dish is typically made from fresh raw fish cured in citrus juices, such as lemon or lime, and spiced with aji ají or chili. Peppers additional, seasonings such as chopped, onions, salt and, cilantro may also be. added The classic Peruvian ceviche is composed of chunks of raw fish, marinated in freshly squeezed key lime or bitter orange (naranja agria) juice, with sliced onions, chili peppers, salt and pepper. Corvina or cebo (sea bass) was the fish traditionally used."}, {"url": "http://www.foodrepublic.com/2012/04/13/the-mysterious-origins-of-ceviche/", "passage_text": "For example, a spirited discussion revolves around the origin of conch salad’s cousin ceviche (also spelled cebiche). This seafood salad, made of raw fish or shellfish marinated in sour fruit juices and laced with raw onion rings and hot peppers, is one of the many gifts ancient Peru bestowed on New World cuisine. The Moor-influenced cooks introduced a dish called Sei-vech, made of fish or meat marinated in the juice of Ceuta lemons, which they brought with them from North Africa and planted in the New World."}, {"url": "https://en.wikipedia.org/wiki/Ceviche", "passage_text": "Ceviche (. [seˈβitʃe]) is a seafood dish popular in the coastal regions of Latin America. The dish is typically made from fresh raw fish cured in citrus juices, such as lemon or lime, and spiced with aji ají or chili. peppers The classic Peruvian ceviche is composed of chunks of raw fish, marinated in freshly squeezed key lime or bitter orange (naranja agria) juice, with sliced onions, chili peppers, salt and pepper. Corvina or cebo (sea bass) was the fish traditionally used."}, {"url": "http://whatscookingamerica.net/History/CevicheNotes.htm", "passage_text": "Ceviche is considered Peru's national dish. Diana Nu ez de Smolij, who is Peruvian and now living in Ecuador, sent me the following information on the history of Ceviche: There is a theory that pre-Hispanic peoples cooked fish with a fruit called tumbo.. The Inca's ate salted fish and a chicha-marinated fish dish. The Spanish contributed the Mediterranean custom of using lemons and onions. There are other historians that believe that Ceviche's origin is Arabian, imported to Peru by Arabian immigrants and re-interpreted by the Peruvians of the coastal areas. The preparation and consumption of ceviche is practically a religion in parts of Mexico, Central, and South America, and it seems as though there are as many varieties of ceviche as people who eat it. Latin American flavors first found a place on Florida menus with South Florida's New World Cuisine in the late 1980's."}, {"url": "http://www.merriam-webster.com/dictionary/seviche", "passage_text": ": a dish of raw fish marinated in lime or lemon juice often with oil, onions, peppers, and seasonings and served especially as an appetizer. ADVERTISEMENT. Definition of SEVICHE. : a dish of raw fish marinated in lime or lemon juice often with oil, onions, peppers, and seasonings and served especially as an appetizer. ADVERTISEMENT. American Spanish."}, {"url": "http://samarabeach.com/costarica/ceviche.shtml", "passage_text": "Ceviche. Ceviche is a seafood dish popular in the coastal regions of the Americas, especially Central and South America, and the Philippines. The dish is typically made from fresh raw fish marinated in citrus juices such as lemon or lime and spiced with chili peppers. The origin of Ceviche is disputed. Possible origin sites for the dish include the western coast of north-central South America, or in Central America. Other coastal societies such as the Polynesian islands of the south Pacific are also attributed the invention of the plate."}, {"url": "http://www.howdoyousaythatword.com/word/ceviche/", "passage_text": "Ceviche refers to raw fish marinated in lime, or lemon juice, usually with onions, tomatoes and chillies. The acid in the lime or lemon literally ‘cooks’ the fish, rendering it firmer and more opaque. This dish originates in South America. I have preferred the South American pronunciation because that is the origin of the dish. There is a similar French dish called ‘ escabeche ‘ – escabèche the main difference between an escabeche escabèche and a ceviche is that the fish is fried in, the former before being marinaded, in vinegar vegetables, and spices and. served cold"}, {"url": "http://honest-food.net/2014/09/15/ceviche-recipe-safety-parasites-2/", "passage_text": "Photo by Holly A. Heyser. Ceviche is one of those seemingly esoteric dishes that Americans have truly embraced, especially those of us who live fairly near the ocean. Of Peruvian origin, ceviche is fish or seafood marinated in citrus juices, which then “cook” the fish. I’ve seen all sorts of versions served in restaurants, and if you look on any angler’s forum you’ll see recipes for ceviche of… well anything, really. This can be a very bad idea. "}]