[{"url": "http://www.thinkbabynames.com/meaning/1/Gabriel", "passage_text": "Gabriel /gab-ri-el/ [2 sylls.] as a boys' name (also used less regularly as girls' name Gabriel) is pronounced GAY-bree-el. It is of Hebrew origin, and the meaning of Gabriel is man of God; my strength is God."}, {"url": "http://www.behindthename.com/name/gabriel", "passage_text": "From the Hebrew name גַבְרִיאֵל (Gavri'el) meaning God is my strong man. Gabriel was one of the seven archangels in Hebrew tradition. He appears in both the Old Testament and the New Testament, where he serves as the announcer of the births of John to Zechariah and Jesus to Mary."}, {"url": "http://www.babynames.com/name/GABRIEL", "passage_text": "Notes: Gabriel is a name with Hebrew origins. The meaning of the name Gabriel is God is my Strength. In the Bible, Gabriel is an archangel who was God’s messenger. Common nicknames for the name Gabriel include Gabe and Gabey."}, {"url": "http://www.sheknows.com/baby-names/name/gabriel", "passage_text": "The name Gabriel is a Biblical baby name. In Biblical the meaning of the name Gabriel is: God is my strength. Spanish Meaning: The name Gabriel is a Spanish baby name. In Spanish the meaning of the name Gabriel is: God is my strength. American Meaning: The name Gabriel is an American baby name. In American the meaning of the name Gabriel is: God is my strength. Hebrew Meaning: The name Gabriel is a Hebrew baby name. In Hebrew the meaning of the name Gabriel is: Man of God. God's able-bodied one. Famous bearer: The archangel Gabriel, who appears several times in the Bible."}, {"url": "http://www.babynamewizard.com/baby-name/boy/gabriel", "passage_text": "Origin of the name Gabriel: Derived from the Hebrew gavrīēl (God is my strength). The name is borne in the Bible by one of the seven archangels, the herald of Good News who appeared to Mary to announce her pregnancy and the impending birth of the Christ-child. Short: Gabe."}]