[{"url": "http://www.ok.gov/health2/documents/IMM_PRG_5-2_Vaccine_Licensure_Age_%20Limits.pdf", "passage_text": "RotaTeq, 24 wks. Rotarix Varicella (Varivax) 1 year No upper limit Zoster-Shingles (Zostavax) 50 years No upper limit * Minimum Age is the earliest age at which the vaccine can be administered according to the vaccine’s licensure."}, {"url": "http://www.cdc.gov/vaccines/vpd-vac/rotavirus/vac-faqs.htm", "passage_text": "Vaccination should not be initiated for infants aged 15 weeks and 0 days or older because of insufficient data on safety of dose 1 of rotavirus vaccine in older infants. The minimum interval between doses of rotavirus vaccine is 4 weeks; no maximum interval is set. All doses should be administered by age 8 months and 0 days."}, {"url": "http://www.immunize.org/askexperts/experts_rota.asp", "passage_text": "According to the package inserts the maximum age for a dose of RotaTeq is 32 weeks and the maximum age for Rotarix is 24 weeks. According to ACIP recommendations the maximum age for a dose of rotavirus vaccine is 8 months 0 days. Eight months 0 days is older than age 24 weeks and may be older than age 32 weeks. Before rotavirus vaccines were available, rotavirus was the most common cause of severe gastroenteritis in infants and young children in the United States and worldwide. Almost all children were infected by age 5 years."}, {"url": "http://www.immunize.org/askexperts/experts_rota.asp", "passage_text": "Rotarix (GlaxoSmithKline) is recommended as a 2-dose series at ages 2 and 4 months. ACIP recommendations for use of rotavirus vaccines are available at www.cdc.gov/mmwr/preview/mmwrhtml/rr5802a1.htm. The minimum age for the first dose is 6 weeks and the maximum age for dose #1 is 14 weeks 6 days. Vaccination should not be initiated for infants age 15 weeks 0 days or older because there are insufficient data on the safety of dose #1 in older infants. The minimum interval between doses of rotavirus vaccine is 4 weeks. Before rotavirus vaccines were available, rotavirus was the most common cause of severe gastroenteritis in infants and young children in the United States and worldwide. Almost all children were infected by age 5 years."}, {"url": "http://www.ncirs.edu.au/assets/provider_resources/fact-sheets/rotavirus-fact-sheet.pdf", "passage_text": "† The upper age limit for receipt of the 1st dose of RotaTeq ® is immediately prior to turning 13 weeks old. The 2nd dose of vaccine should preferably be given by 28 weeks of age to allow for a minimum interval of 4 weeks before receipt of the 3rd dose. The upper age limit for the 3rd dose is immediately prior to turning 33 weeks old. Rotavirus vaccines first became available in early 2006, and were added to the NIP across Australia from 1 July 2007. Upper limits on the recommended age of administration of rotavirus vaccines are in place; be sure to check the infant’s age prior to immunisation."}, {"url": "http://www.cdc.gov/vaccines/vpd-vac/rotavirus/vac-faqs.htm", "passage_text": "RotaTeq® is administered in a 3-dose series, with doses administered at ages 2, 4, and 6 months. Rotarix® is administered in a 2-dose series, with doses administered at ages 2 and 4 months. The minimum age for dose 1 of rotavirus vaccine is 6 weeks; the maximum age for dose 1 is 14 weeks and 6 days. The minimum interval between doses of rotavirus vaccine is 4 weeks; no maximum interval is set. All doses should be administered by age 8 months and 0 days."}, {"url": "http://www.rotateq.com/consumer.xhtml", "passage_text": "1 • Your child will receive 3 doses of the vaccine. 2  The first dose is given when your child is 6 to 12 weeks of age, the second dose is given 4 to 10 weeks later and the third dose is given 4 to 10 weeks after the second dose. 3  The last (third) dose should be given to your child by 32 weeks of age. "}, {"url": "http://www.ncirs.edu.au/assets/provider_resources/fact-sheets/rotavirus-fact-sheet.pdf", "passage_text": "Vaccines Two oral live attenuated rotavirus vaccines are available in Australia. They are Rotarix ® , a human monovalent vaccine (given in a 2-dose schedule at 2 and 4 months of age), and RotaTeq ® , a pentavalent human bovine reassortant vaccine (given in a 3-dose schedule at 2, 4 and 6 months of age). Rotavirus vaccines first became available in early 2006, and were added to the NIP across Australia from 1 July 2007. Upper limits on the recommended age of administration of rotavirus vaccines are in place; be sure to check the infant’s age prior to immunisation."}, {"url": "http://www.sciencedirect.com/science/article/pii/S0264410X13000054", "passage_text": "Introduction. In March, 2006, oral rotavirus vaccine was added to Brazil's infant immunization schedule with recommended upper age limits for initiating (by age 14 weeks) and completing (by age 24 weeks) the two-dose series to minimize age-specific risk of intussusception following rotavirus vaccination. Because of “catch-up” vaccination with RotaShield ® [5] . The maximum age of 14 weeks for the first dose of rotavirus vaccine in Brazil was based on age limits used in clinical trials for Rotarix ® , which showed no increased risk of intussusception among vaccinated children [19] ."}]