[{"url": "http://www.delmarfans.com/educate/basics/what-size-downrod-do-i-need/", "passage_text": "However, fan downrods can range up to 177 inches depending on the manufacturer. Here’s a simple guide to help you find the right ceiling fan downrod length for any room in your home. The wrong height can also result in an ill-fitted looking ceiling fan. A method commonly used to find the right downrod length is the ceiling height minus the height of the ceiling fan, minus the desired hanging height (usually 8 feet)."}, {"url": "http://www.ceilingfan.com/ceiling-fan-downrod-guide-s/1454.htm", "passage_text": "This downrod chart helps us to determine which downrod size you need for your fan based on the height of the ceiling. On an 8 foot ceiling, we recommend the standard pole which is a 3 ½, 4 ½ inch downrod that comes with the fan. This will keep the blades at least 7 feet off the ground. We also recommend the standard downrod on a 9 foot ceiling. However, some manufacturers will include a 6 inch downrod."}, {"url": "http://www.ehow.com/info_12144217_size-ceiling-fan-install-vaulted-ceiling.html", "passage_text": "Ceiling Angle. The ceiling's angle is another necessary factor regarding fan size. The angle is measured in degrees and reflects the difference between the ceiling and adjoining walls. Using a roof angle finder and a leveler can help you calculate the ceiling's angle. A ceiling fan with a 12-inch downrod is suitable for a vaulted ceiling that has a 14- to 18.4-degree ceiling angle. "}, {"url": "http://www.delmarfans.com/educate/basics/what-size-downrod-do-i-need/", "passage_text": "For example, if your ceiling is 10 feet in height and your ceiling fan is 12 inches in height, you will need a 1-foot downrod to mount the ceiling fan 8 feet above the floor. The wrong height can also result in an ill-fitted looking ceiling fan. A method commonly used to find the right downrod length is the ceiling height minus the height of the ceiling fan, minus the desired hanging height (usually 8 feet)."}, {"url": "http://www.ehow.com/info_12193893_recommendation-ceiling-fans-drop-rod-lengths.html", "passage_text": "Drop Rod Lengths. A ceiling fan should rest about 7 1/2 to 9 feet from the ground to remain high enough to be out of the way yet low enough to actually make a difference in the room. For example, use a 12-inch drop rod if your ceilings are 9 feet high, or a 24-inch rod if your ceilings are 11 feet high. "}, {"url": "http://blog.ceilingfan.com/tips-for-buying-the-right-ceiling-fan-size/", "passage_text": "Ceiling Fans for Small Rooms. Not surprisingly, smaller rooms need smaller ceiling fans. Ceiling fan size can be determined by measuring the height and width of your room. If you are installing a fan in a patio, bathroom, den, or small bedroom, it is important to measure the height of the ceiling. If you have a low hanging ceiling you may want to purchase a flush mount ceiling fan. The blade span of vaulted ceiling fans can vary. If your vaulted ceiling is low and your slope is small, you should determine the fan size based on the room size. If you have a higher ceiling and need a longer downrod, it’s best to purchase a fan with a larger blade span that can fully circulate the air."}, {"url": "http://www.lowes.com/projects/build-and-remodel/install-a-ceiling-fan/project", "passage_text": "The ceiling fan you install should be the right size for the room: 1  Rooms that measure about 75 square feet need a fan with a 29- to 36-inch blade diameter. 2  For rooms measuring 76 to 144 square feet, choose a fan with a blade diameter of 36 to 42 inches. "}, {"url": "http://www.fanshoppe.com/how-to-select-a-ceiling-fan-downrod/", "passage_text": "Take the popular Fanimation ceiling fan The Huxley for example, which dimensions indicate the blades will be 18.75 inches from the ceiling with the downrod that is included (6 inches). This would mean on a 9 foot ceiling the blades would be 7 feet 5.25 inches from the floor. Now, if you wanted to maintain that 7 foot 5.25 inch blade height, but were installing it on a 12 foot ceiling, you would require an extra 3 feet or a 42 inch extension downrod. Basically, you can use the following mathematical formula to determine the downrod length you need"}, {"url": "http://www.ceilingfan.com/ceiling-fan-downrod-guide-s/1454.htm", "passage_text": "For an 11 foot ceiling, we recommend an 18 inch downrod and this will have your blades 8 ½ feet off the ground. And this 2 foot pole is perfect for a 12 foot ceiling. Likewise on the 13 foot ceiling we recommend a 36 inch downrod, and for a 14 foot ceiling we recommend a 48 inch downrod. On an 8 foot ceiling, we recommend the standard pole which is a 3 ½, 4 ½ inch downrod that comes with the fan. This will keep the blades at least 7 feet off the ground. We also recommend the standard downrod on a 9 foot ceiling. However, some manufacturers will include a 6"}, {"url": "http://www.delmarfans.com/educate/basics/what-size-downrod-do-i-need/", "passage_text": "Downrods range in diameter and length depending on the ceiling fan type and application. Standard ceiling fans include a downrod ranging in length from 3 inches to 6 inches, which is suitable for standard size rooms with a ceiling height of 8 – 9 feet. The wrong height can also result in an ill-fitted looking ceiling fan. A method commonly used to find the right downrod length is the ceiling height minus the height of the ceiling fan, minus the desired hanging height (usually 8 feet)."}]