[{"url": "http://theepicentre.com/spice/dill/", "passage_text": "The word “ dill ” comes from the Norse “ dilla ”, meaning “ to lull ”. Drinking dill tea is recommended to overcome insomnia. A native to Europe, it is a Russian favourite and can be cultivated near the Arctic Circle. Both seeds and leaves are edible."}, {"url": "http://foodreference.about.com/od/Food-Additives/a/What-Is-Annatto.htm", "passage_text": "Annatto is the seed or extract from the achiote tree, which is indigenous to Latin and South America. Annatto is used heavily in Central and South America as a dye, medicine, and as an ingredient in many foods. Annatto is a naturally intense dye which can range in color from bright yellow to deep orange."}, {"url": "http://www.austinscdfriends.com/articles/article/3691416/53827.htm", "passage_text": "Cinnamon is the bark of an evergreen bush native to Sri Lanka. The bark is peeled away from the bush in thin strips, dried, and ground. Cinnamon is a very versatile spice, used in many varieties of dishes. Cinnamon is most popular is sweet dishes, but is also an ingredient in curry powder."}, {"url": "http://foodreference.about.com/od/Food-Additives/a/What-Is-Annatto.htm", "passage_text": "Annatto is also known as the “poor man’s saffron” because it can be used to achieve a similar bright yellow color to saffron without the high price. Many dishes in Central and South America, such as Arroz con Pollo, use annatto for the distinct yellow color. Annatto is also used to color soups, stews, and spice rubs."}, {"url": "http://www.italiancook.ca/spice-herb.htm", "passage_text": "Spices & Herbs Dictionary. A spice is a dried seed, fruit, root, bark, or vegetative substance used in nutritionally insignificant quantities as a food additive for flavor, color, or as a preservative that kills harmful bacteria or prevents their growth."}, {"url": "http://www.italiancook.ca/spice-herb.htm", "passage_text": "Cinnamon is the bark of an evergreen bush native to Sri Lanka. The bark is peeled away from the bush in thin strips, dried, and ground. Our cinnamon in the Kolintji A variety with an oil content of about 3%. Cinnamon is a very versatile spice, used in many varieties of dishes."}, {"url": "http://www.thespicehouse.com/spices/annato-seed", "passage_text": "Annato seed is also known as achiote. This seed grows on the annato tree. It is used primarily in Mexican and Caribbean cooking to impart a rich yellow/orange color. Annato seed makes a good substitute for saffron's golden coloring, at a fraction of the cost. It does NOT, however, duplicate saffron’s unique flavor!"}]