[{"url": "http://www.answers.com/Q/How_long_do_dwarf_hamsters_live", "passage_text": "Answer by Chombyman. Confidence votes 2.2K. Different dwarf hamsters have different lifespans: * Chinese dwarf hamster has a lifespan of 2 to 3 years * a Russian dwarf has a lifespan of 1.5 to 2 years, but if well looked after, can live longer-even 4 or 5 years * roboroski dwarf has a lifespan of 3 to 3.5 years. The roboviski (robo) hamster live up to 2-4 years of age. At least 2 1/2 I have 1 and it's only 5 months old. At least the whiteish grayish ones live up to 4 years. The bl … ack ones (like the one I own) live for about 2-3 years but maybe even 4 (if you take extra good care of it, like me)"}, {"url": "http://www.hamsterfanciers.com/how-long-do-hamsters-live.html", "passage_text": "How long do hamsters live? Many factors would lengthen or shorten a hamster's lifespan such as genetics, diet, diseases, stress, and more. Usually a hamster doesn't live that long. Some kept in great shape can live up to 5 years. "}, {"url": "https://answers.yahoo.com/question/index?qid=20060731160530AAr5l9U", "passage_text": "They may be 20 to 25cm long and weigh 100 to 150g. Syrian hamsters can live together four weeks from birth, thereafter they must be housed separately. Syrian hamsters have a life span of about 2 years. Report Abuse. We had 2 chinease dwarf hamster which we bought from the same litter in October 2003 when they were 8 weeks old. They were both grils. One died October 2005 and the other one dired in May 2006, so the oldest one lived 2 years 9 months."}, {"url": "http://thehamsterhouse.com/hamster-info/hamster-life-span/", "passage_text": "Many different factors affect hamster life span and how long your own pet hamster lives will depend on these factors. That said, it is possible to give a rough idea of how long your hamster is likely to live, based on the average hamster life span. On average, a hamster will live for around 2 to 2.5 years. However, the life span varies depending on the type of hamster and ranges from 1.5 to 3.5 years. From longest to shortest, the following are the average life spans of the five most popular hamster species: Roborovski Hamster: 3 to 3.5 years. "}, {"url": "https://en.wikipedia.org/wiki/Roborovski_hamster", "passage_text": "Roborovski hamsters (Phodopus roborovskii; formerly Cricetulus bedfordiae) also known as desert hamsters or Robos are the smallest of three species of hamster in the genus Phodopus, averaging under 2 cm (1 inch) at birth and between 4.5–5 cm (2 inches) and 20-25 g (1 oz) during adulthood. "}, {"url": "http://www.healthguidance.org/entry/11672/1/Dwarf-Hamsters--How-Long-Do-They-Live.html", "passage_text": "The big question here is that how long can these creatures live? A lifespan of any living creature depends on its variations. A dwarf hamster can live for about 1 years up to 3 years when they are domestically taken care of, but in the wild, they can survive for about 5 years. You can help them live longer by simply giving them nutritious foods. Make an environment similar to what they have in the wild can be a great idea. 3. Chinese dwarf 2 to 3 years. A dwarf hamster s life span can be badly affected by injury, food poisoning, illness or housing conditions. You can prevent them from fatal things if you will just take care of them."}, {"url": "https://thepetreport.wordpress.com/2012/06/06/how-long-do-hamsters-live/", "passage_text": "Regular hamsters (big hamsters like teddies) have an expected lifespan of 3 – 5 years. By Tb240904 (Own work) [Public domain], via Wikimedia Commons. Dwarf hamsters live up to 3 years. Russians tend to live only about 2, while Siberians and “fake” dwarf hamsters (Chinese, Taiwanese, etc…) live about 3. Roborovski dwarf hamsters life spans are more volatile and live anywhere from 1 to 3 years. All of the above is assuming the hamster lives in good condition. "}, {"url": "https://answers.yahoo.com/question/index?qid=20060731160530AAr5l9U", "passage_text": "The average lifespan of the Dwarf Campbells Russian Hamster is 1-2 years. Roborovski Dwarf Hamster The Roborovski is not widely kept as a pet because it is not as easy to handle as other species of Dwarf Hamsters. Report Abuse. We had 2 chinease dwarf hamster which we bought from the same litter in October 2003 when they were 8 weeks old. They were both grils. One died October 2005 and the other one dired in May 2006, so the oldest one lived 2 years 9 months."}, {"url": "https://answers.yahoo.com/question/index?qid=20060731160530AAr5l9U", "passage_text": "They usually can live from about 1.5 years to 3.5 years (although it depends on species). http://www.hamsterific.com/SpeciesTable.... Here's some examples of different dwarf breeds if you're still curious (it's not a syrian if it's a dwarf though) http://goat168.tripod.com/someverygoodha... Report Abuse. We had 2 chinease dwarf hamster which we bought from the same litter in October 2003 when they were 8 weeks old. They were both grils. One died October 2005 and the other one dired in May 2006, so the oldest one lived 2 years 9 months."}]