[{"url": "https://weatherspark.com/averages/31237/5/Portland-Oregon-United-States", "passage_text": "This report describes the typical weather at the Portland International Airport (Portland, Oregon, United States) weather station over the course of an average May. It is based on the historical records from 1974 to 2012. Earlier records are either unavailable or unreliable."}, {"url": "http://www.weatherbyday.com/oregon/portland/may-portland-weather.html", "passage_text": "May Weather In Portland. The highest recorded temperature in May for Portland for the past 70 years was 100 degrees Fahrenheit, most recently measured on May 28, 1983, and the normal high is 67."}, {"url": "https://weatherspark.com/averages/31237/5/Portland-Oregon-United-States", "passage_text": "Portland, Oregon has a mediterranean climate with dry warm summers and mild winters. The area within 25 mi of this station is covered by forests (69%), croplands (15%), built-up areas (11%), and lakes and rivers (4%)."}, {"url": "http://www.weatherbyday.com/oregon/portland/may-portland-weather.html", "passage_text": "Portland Weather In May. The highest recorded temperature in May for Portland for the past 70 years was 100 degrees Fahrenheit, most recently measured on May 28, 1983, and the normal high is 67."}, {"url": "http://www.weatherbyday.com/oregon/portland/may-portland-weather.html", "passage_text": "United States NWS historical Portland May Weather data records that on May 3, 1952, the high temperature did not exceed 60 degrees Fahrenheit, the lowest high measured in Portland in the past 70 years."}, {"url": "http://www.currentresults.com/Weather/Oregon/temperature-may.php", "passage_text": "Average temperatures for May at cities, towns, parks and lakes throughout Oregon are listed below in degrees Fahrenheit and Celsius. The tables give the normals for maximum and minimum temperatures based on weather data collected from 1981 to 2010 by the US National Climatic Data Center. You can jump to a separate table for each region of the state: Oregon Coast, Willamette Valley, Cascade Mountains, Central Oregon and Eastern Oregon."}]