[{"url": "http://newcastlephotos.blogspot.com/2005/12/tyne-bridge.html", "passage_text": "The earliest bridge across the Tyne, Pons Aelius, was built by the Romans near the location of the present Tyne Bridge. Built around 122, it fell into disrepair, and a stone bridge was built in 1270. This was in turn destroyed by the great flood of 1771. The Tyne Bridge is a through arch bridge over the River Tyne linking Newcastle upon Tyne and Gateshead. It was designed by the engineering firm Mott, Hay and Anderson, who later designed the Forth Road Bridge, and was built by Dorman Long and Co. of Middlesbrough."}, {"url": "http://www.newcastlegateshead.com/things-to-do/tyne-bridge-p603151", "passage_text": "The Tyne Bridge was designed by the engineering firm Mott, Hay and Anderson and was built by Dorman Long and Co. of Middlesbrough who later went on to build Sydney Harbour Bridge, which opened three years later in 1932. The Tyne Bridge Towers are regularly opened to the public as part of Heritage Open Days, which take place in September each year. The Tyne Bridge is probably most recognised for the annual Great North Run, as 52,000 runners pass over the bridge accompanied by a display from the Red Arrows."}, {"url": "http://www.newcastlegateshead.com/things-to-do/tyne-bridge-p603151", "passage_text": "At the time of its construction the Tyne Bridge was the world's longest single span bridge and was officially opened on 10 October 1928 by King George V. The Tyne Bridge's towers were built of Cornish granite and were originally designed as warehouses with five storeys. But the inner floors of the warehouses in the bridge's towers were never completed and, as a result, the storage areas were never used. The Tyne Bridge Towers are regularly opened to the public as part of Heritage Open Days, which take place in September each year. The Tyne Bridge is probably most recognised for the annual Great North Run, as 52,000 runners pass over the bridge accompanied by a display from the Red Arrows."}, {"url": "http://newcastlephotos.blogspot.com/2005/12/tyne-bridge.html", "passage_text": "History of operations. Tram lines were built into the Tyne Bridge structure and ready for immediate use after the opening ceremony in October 1928. Tram car No. 289 was the last Newcastle tram to run into Gateshead over the Tyne Bridge on Sunday 5 March 1950 at approximately 10.55 pm. The Tyne Bridge is a through arch bridge over the River Tyne linking Newcastle upon Tyne and Gateshead. It was designed by the engineering firm Mott, Hay and Anderson, who later designed the Forth Road Bridge, and was built by Dorman Long and Co. of Middlesbrough."}, {"url": "http://www.bbc.co.uk/insideout/northeast/series3/tyne_bridge_northeasthistory.shtml", "passage_text": "We turn back time and recall the building of this famous Tyneside icon. The Tyne Bridge is one of the greatest symbols of Tynesides industrial pride and engineering prowess. Built in 1928, the Tyne Bridge was a major engineering triumph in its day and remains a miracle of modern design 75 years on. Built from steel and granite, the bridge has come to symbolise all that is best about the Tyneside industrial tradition and its history of engineering and innovation. "}, {"url": "http://www.bbc.co.uk/nationonfilm/topics/misc-work/tyne-bridge-construction-building.shtml", "passage_text": "The Tyne Bridge is one of Newcastle's most popular icons and a symbol of Tyneside's industrial pride. We take a look at the building of this modern architectural masterpiece. The earliest bridge across the Tyne was built by the Romans, Pons Aelius, near the location of the present Tyne Bridge. After it fell into disrepair, a stone bridge was built in 1270 but this was destroyed by the great flood of 1771. "}, {"url": "https://en.wikipedia.org/wiki/Tyne_Bridge", "passage_text": "The Tyne Bridge is a through arch bridge over the River Tyne in North East England, linking Newcastle upon Tyne and Gateshead. The Bridge was designed by the engineering firm Mott, Hay and Anderson, who later designed the Forth Road Bridge, and was built by Dorman Long and Co. of Middlesbrough. The earliest bridge across the Tyne, Pons Aelius, was built by the Romans near the location of the present Tyne Bridge. Built around 122, it fell into disrepair. The next bridge built was one of stone in 1270. After 500 years, this was destroyed by the great flood of 1771"}, {"url": "https://en.wikipedia.org/wiki/Tyne_Bridge", "passage_text": "Tyne Bridge viewed from Side, Newcastle Quayside. The earliest bridge across the Tyne, Pons Aelius, was built by the Romans near the location of the present Tyne Bridge. Built around 122, it fell into disrepair. The next bridge built was one of stone in 1270. After 500 years, this was destroyed by the great flood of 1771"}]