[{"url": "http://www.answers.com/Q/What_Carries_deoxygenated_blood_to_the_lungs_from_the_heart", "passage_text": "The pulmonary trunk, which splits into the pulmonary arteries carry deoxygenated (oxygen-poor) blood from the right ventricle of the heart to the lungs to drop off its carbon … dioxide and pick up fresh oxygen. 3 people found this useful. Simple answer: Veins Complex answer: a series of blood vessels (excluding arteries) carries deoxygenated blood from the body to the heart. Where the blood is then passed throu … gh an oxygenating process with the lungs."}, {"url": "http://www.healthline.com/human-body-maps/right-pulmonary-veins", "passage_text": "Right pulmonary veins. Veins are the blood vessels that carry blood to the heart. Pulmonary veins are responsible for carrying oxygenated blood from the lungs back to the left atrium of the heart. This differentiates the pulmonary veins from other veins in the body, which are used to carry deoxygenated blood from the rest of the body back to the heart"}, {"url": "http://www.diffen.com/difference/Aorta_vs_Pulmonary_Artery", "passage_text": "The aorta supplies oxygenated blood from the heart's pumping chamber to the rest of the body. Pulmonary artery carries deoxygenated or unaerated blood from the heart to the lungs.Like all arteries, the pulmonary artery carries blood away from the heart. The aorta is the artery that carries oxygenated blood to the entire body. The pulmonary artery carries deoxygenated blood to the lungs. Function. The function of the aorta is to carry oxygenated blood throughout the body. The function of the pulmonary artery is to deliver blood to the lungs for oxygenation."}, {"url": "http://www.csulb.edu/divisions/students/hrc/health_topics/heart.htm", "passage_text": "Blood moves through each side of the heart systematically. Deoxygenated blood is delivered into the right atrium. It then enters the right ventricle, from where it is pumped out into the pulmonary artery and to the lungs. Oxygenated blood returning in the pulmonary veins flows into the left atrium."}, {"url": "https://en.wikipedia.org/wiki/Artery", "passage_text": "Arteries carry oxygenated blood away from the heart to the tissues, except for pulmonary arteries, which carry blood to the lungs for oxygenation. (Usually veins carry deoxygenated blood to the heart but the pulmonary veins carry oxygenated blood.) There are two unique arteries. The pulmonary artery carries blood from the heart to the lungs, where it receives oxygen. It is unique because the blood in it is not oxygenated, as it has not yet passed through the lungs. The other unique artery is the umbilical artery, which carries deoxygenated blood from a fetus to its mother]."}, {"url": "https://en.wikipedia.org/wiki/Pulmonary_artery", "passage_text": "The pulmonary artery carries deoxygenated blood from the heart to the lungs. It is one of the only arteries (other than the umbilical arteries in the fetus) that carries deoxygenated blood. The pulmonary artery carries deoxygenated blood from the right ventricle to the lungs. The blood here passes through capillaries adjacent to alveoli and becomes oxygenated as part of the process of respiration. In contrast to the pulmonary arteries, the bronchial arteries supply nutrition to the lungs themselves"}, {"url": "https://answers.yahoo.com/question/index?qid=20070310073659AAxwgzt", "passage_text": "Report Abuse. Right-deoxygenated blood left-Oxygenated blood Right Heart Right heart is a term used to refer collectively to the right atrium and right ventricle of the heart; occasionally, this term is intended to reference the right atrium, right ventricle, and the pulmonary trunk collectively. "}, {"url": "http://www.mcwdn.org/body/circulatory.html", "passage_text": "Blood Vessels: Arteries: These are large blood vessels that take oxygenated blood away from the heart to be distributed throughout the body. The aorta is the body's largest artery. Veins: These blood vessels take deoxygenated blood from around the body back to the heart and lungs to be oxygenated. "}, {"url": "http://www.diffen.com/difference/Aorta_vs_Pulmonary_Artery", "passage_text": "The aorta and the pulmonary artery are the two most important arteries in the human body. The aorta is the biggest artery and channels oxygenated blood to the rest of the body. The pulmonary artery carries deoxygenated blood to the lungs for purification. The aorta is the artery that carries oxygenated blood to the entire body. The pulmonary artery carries deoxygenated blood to the lungs. Function. The function of the aorta is to carry oxygenated blood throughout the body. The function of the pulmonary artery is to deliver blood to the lungs for oxygenation."}]