[{"url": "http://www.sheknows.com/baby-names/name/robert", "passage_text": "English Meaning: The name Robert is an English baby name. In English the meaning of the name Robert is: Famed; bright; shining. An all-time favorite boys name since the Middle Ages. French Meaning: The name Robert is a French baby name. In French the meaning of the name Robert is: Famed; bright; shining. An all-time favorite boys name since the Middle Ages. Scottish Meaning: The name Robert is a Scottish baby name. In Scottish the meaning of the name Robert is: Famed; bright; shining."}, {"url": "http://www.meaning-of-names.com/english-names/robert.asp", "passage_text": "Meaning of Robert. English name. In English, the name Robert means-bright fame. Other origins for the name Robert include-English, French, German, Scottish.The name Robert is most often used as a boy name or male name. English Name Meaning-bright fame. Origin-England. Alternate Origins-French German Scottish."}, {"url": "http://www.thinkbabynames.com/meaning/1/Robert", "passage_text": "Robert /ro-bert/ [2 sylls.] as a boys' name is pronounced RAH-bert. It is of Old German origin, and the meaning of Robert is bright fame. A favorite name for boys since the Middle Ages. Especially favored by the Scots due to 14th-century King Robert the Bruce and to poet Robert Burns. Name of an 11th-century Duke of Normandy who was also a Crusader"}, {"url": "http://www.sheknows.com/baby-names/name/bob", "passage_text": "The name Bob is an English baby name. In English the meaning of the name Bob is: Abbreviation of Robert. American Meaning: The name Bob is an American baby name. In American the meaning of the name Bob is: Abbreviation of Robert. German Meaning: The name Bob is a German baby name. In German the meaning of the name Bob is: Famed, bright; shining. An all-time favorite boys' name since the Middle Ages. Famous Bearers: Scottish national hero Robert the Bruce and novelist Robert Ludlum"}, {"url": "http://www.babynamespedia.com/meaning/Robin/m", "passage_text": "[ 2 syll. ro-bin, rob-in ] The baby boy name Robin is also used, and more frequently so, as a girl name. Its pronunciation is R AA-BihN †. Robin is used chiefly in the English, French, and Romanian languages, and its origin is Germanic. Robin is a diminutive form of Robert. See also the related form, Robyn (English). Robin is uncommon as a baby name for boys. At the height of its usage in 1956, 0.104% of baby boys were given the name Robin. It ranked at #143 then. The baby name has since dropped out of favor, and is today of very modest use."}, {"url": "http://www.babynamewizard.com/baby-name/boy/robert", "passage_text": "Origin of the name Robert: Introduced to England by the Normans, Robert is derived from the Old High German Hruodperht, a compound name composed of the elements hruod (fame) and perht (bright). The name was borne by Robert I (d. 1035), duke of Normandy and father of William the Conqueror, and by three kings of Scotland."}, {"url": "http://www.sheknows.com/baby-names/name/robert", "passage_text": "German Meaning: The name Robert is a German baby name. In German the meaning of the name Robert is: Famed, bright; shining. An all-time favorite boys' name since the Middle Ages. Famous Bearers: Scottish national hero Robert the Bruce and novelist Robert Ludlum. The name Robert is a French baby name. In French the meaning of the name Robert is: Famed; bright; shining. An all-time favorite boys name since the Middle Ages. Scottish Meaning: The name Robert is a Scottish baby name. In Scottis"}, {"url": "http://www.ourbabynamer.com/meaning-of-Robert.html", "passage_text": "Robert is generally used as a boy's name. It consists of 6 letters and 2 syllables and is pronounced Ro-bert. In the U.S. in 2014, it ranked 61 in baby name popularity for boys with 6572 occurrences. It ranked 16008 in popular baby names for girls with 6 occurrences. "}, {"url": "http://www.babynamespedia.com/meaning/Robert", "passage_text": "See also the related forms, Hopkin (English and Welsh) and John-Robert. Robert is a classic favorite. Today it is still popular as a baby name for boys, though it was in more widespread use previously. At the height of its usage in 1931, 5.659% of baby boys were given the name Robert. Its ranking then was #1. The name Robert has predominantly been a baby boy name, though it has also been given to girls in the past century. In 1988, Robert as a baby boy name outnumbered its use as a girl name by 160 times."}]