[{"url": "http://www.lls.org/myeloproliferative-neoplasms/myelofibrosis", "passage_text": "Myelofibrosis (MF). 1  Is a rare bone marrow cancer. 2  It is one of a related group of blood cancers known as “myeloproliferative neoplasms (MPNs)” in which bone marrow cells that produce the blood cells develop and function abnormally. 1 It is one of a related group of blood cancers known as “myeloproliferative neoplasms (MPNs)” in which bone marrow cells that produce the blood cells develop and function abnormally. 2  The resulting fibrous scar tissue formation leads to severe anemia, weakness, fatigue and an enlarged spleen and liver."}, {"url": "http://www.clevelandclinicmeded.com/medicalpubs/diseasemanagement/hematology-oncology/chronic-myeloproliferative-disorders/", "passage_text": "However, most patients develop symptoms as the hematocrit, platelet count, or both increase. An elevated white blood cell (WBC) count is found in 50% to 60% of patients. Symptoms of hyperviscosity associated with an elevated hematocrit include headache, blurred vision, and plethora. "}, {"url": "http://www.lls.org/myeloproliferative-neoplasms/myelofibrosis", "passage_text": "Myelofibrosis (MF). 1  Is a rare bone marrow cancer. 2  Is a type of chronic leukemia and can occur on its own (primary myelofibrosis) or as a result of another bone marrow disorder. 1 It is one of a related group of blood cancers known as “myeloproliferative neoplasms (MPNs)” in which bone marrow cells that produce the blood cells develop and function abnormally. 2  The resulting fibrous scar tissue formation leads to severe anemia, weakness, fatigue and an enlarged spleen and liver."}, {"url": "http://www.nature.com/leu/journal/v28/n7/full/leu201483a.html", "passage_text": "Calreticulin (CALR) is a multifunctional Ca-binding protein located in the endoplasmic reticulum. CALR mutations are recurrent in JAK2 / MPL-unmutated essential thrombocythemia (ET) and primary myelofibrosis (PMF), with reported mutational frequencies of 49 and 74 % , respectively. Table 1 - Clinical and laboratory features of 282 patients with primary myelofibrosis and type 1 (p.L367fs*46) or type 2 (K385fs*47) CALR or JAK2 mutations."}, {"url": "http://www.mayoclinic.org/diseases-conditions/myelofibrosis/basics/definition/CON-20027210", "passage_text": "Myelofibrosis is a serious bone marrow disorder that disrupts your body's normal production of blood cells. The result is extensive scarring in your bone marrow, leading to severe anemia, weakness, fatigue, and often, an enlarged spleen and liver. Myelofibrosis is an uncommon type of chronic leukemia — a cancer that affects the blood-forming tissues in the body. Myelofibrosis belongs to a group of diseases called myeloproliferative disorders. Many people with myelofibrosis get progressively worse, and some may eventually develop a more serious form of leukemia. Yet it's also possible to have myelofibrosis and live symptom-free for years."}, {"url": "http://www.lls.org/myeloproliferative-neoplasms/myelofibrosis", "passage_text": "1 Hematologists and oncologists are specialists who treat people who have myelofibrosis (MF) or other types of blood cancer. 2  MF usually develops slowly and some people may live symptom-free for years. 3  Others, however, may get progressively worse, requiring treatment. 1 It is one of a related group of blood cancers known as “myeloproliferative neoplasms (MPNs)” in which bone marrow cells that produce the blood cells develop and function abnormally. 2  The resulting fibrous scar tissue formation leads to severe anemia, weakness, fatigue and an enlarged spleen and liver."}, {"url": "http://www.cancer.gov/types/myeloproliferative/hp/chronic-treatment-pdq", "passage_text": "General Information About Chronic Myeloproliferative Neoplasms (MPN). The chronic MPN consist of chronic myelogenous leukemia, polycythemia vera (p. vera), primary myelofibrosis, essential thrombocythemia, chronic neutrophilic leukemia, and chronic eosinophilic leukemia. The preferred citation for this PDQ summary is: http://www.cancer.gov/types/myeloproliferative/hp/chronic-treatment-pdq. Images in this summary are used with permission of the author(s), artist, and/or publisher for use within the PDQ summaries only."}, {"url": "http://www.ncbi.nlm.nih.gov/pubmed/3279751", "passage_text": "A 64-year-old man was found to have a hemolytic anemia with a hematocrit of 0.28 (28%) during a routine evaluation. One month before this his hematocrit had been normal. Further studies revealed a myelodysplastic syndrome and acquired hemoglobin H disease. Eighteen months later this transformed into acute megakaryoblastic leukemia with disappearance of hemoglobin H, and shortly thereafter he had myelofibrosis develop. Acquired hemoglobin H disease, which is an alpha-thalassemia-like syndrome, results in the formation of an unstable hemoglobin composed of beta chain tetramers."}, {"url": "http://www.lls.org/myeloproliferative-neoplasms/myelofibrosis", "passage_text": "1 Is a type of chronic leukemia and can occur on its own (primary myelofibrosis) or as a result of another bone marrow disorder. 2  Other MPNs that can progress to myelofibrosis include polycythemia vera and essential thrombocythemia. 1 It is one of a related group of blood cancers known as “myeloproliferative neoplasms (MPNs)” in which bone marrow cells that produce the blood cells develop and function abnormally. 2  The resulting fibrous scar tissue formation leads to severe anemia, weakness, fatigue and an enlarged spleen and liver."}, {"url": "http://www.cancer.gov/types/myeloproliferative/patient/chronic-treatment-pdq", "passage_text": "1 Chronic eosinophilic leukemia is a disease in which too many white blood cells (eosinophils) are made in the bone marrow. 2  Signs and symptoms of chronic eosinophilic leukemia include fever and feeling very tired. 1 Primary myelofibrosis is a disease in which abnormal blood cells and fibers build up inside the bone marrow. 2  Symptoms of primary myelofibrosis include pain below the ribs on the left side and feeling very tired. 3  Certain factors affect prognosis (chance of recovery) and treatment options for primary myelofibrosis."}]