[{"url": "http://www.answers.com/Q/What_type_of_tissues_make_up_the_trachea.", "passage_text": "The trachea is made up of the following tissues: 1. mucosa-inner layer made up of Pseudostratified ciliated columnar epithelium. 2. submucosa-middle layer which has zero mucus glands and it is made up of connective tissue. 3. adventila-outer layer made up of hyaline cartilage."}, {"url": "http://www.answers.com/Q/What_type_of_tissues_make_up_the_trachea.", "passage_text": "The types of tissues that make up your heart are cardiac muscle tissue, nerve tissue and blood tissue. The cardiac muscle tissue contracts, making the heart pump. The nerve ti … ssue brings messages that tell the heart how fast to beat. The blood tissue is carried from the heart to other organs of the body. 1. mucosa-inner layer made up of Pseudostratified ciliated columnar epithelium. 2. submucosa-middle layer which has zero mucus glands and it is made up of connective tissue. 3. adventila-outer layer made up of hyaline cartilage."}, {"url": "http://www.answers.com/Q/What_is_your_trachea_made_up_of", "passage_text": "The trachea is made up of the following tissues: 1. mucosa-inner layer made up of Pseudostratified ciliated columnar epithelium 2. submucosa-middle layer which has zero muc … us glands and it is made up of connective tissue 3. adventila-outer layer made up of hyaline cartilage. 23 people found this useful. The trachea is made of cartilage.   The trachea, or windpipe, is the bony tube that connects the nose and mouth to the lungs, and is an important part of the vertebrate respiratory system. + 66 others found this useful. Annette Pacheco. Alexander Rowan."}, {"url": "http://www.histology.leeds.ac.uk/respiratory/conducting.php", "passage_text": "Respiratory | Trachea, bronchioles and bronchi. The conducting portion is made up of: nasal cavities, nasopharynx, larynx, trachea, bronchii and bronchioles. The trachea branches to give rise to two primary (main) bronchii. These then branch successively to give rise in turn to secondary and tertiary bronchii. Mucosa and sub-mucosa of Trachea. The respiratory mucosa is made up of the epithelium and supporting lamina propria). The epithelium is tall columnar pseudostratified with cilia and goblet cells."}, {"url": "http://www.histology.leeds.ac.uk/respiratory/conducting.php", "passage_text": "Trachea. The trachea is a wide flexible tube, the lumen of which is kept open by 20 tracheal cartilages, which are C-shaped rings of hyaline cartilage. The gaps between the rings of cartilage are filled by the trachealis muscle-a bundle of smooth muscle, and fibroelastic tissue. Mucosa and sub-mucosa of Trachea. The respiratory mucosa is made up of the epithelium and supporting lamina propria). The epithelium is tall columnar pseudostratified with cilia and goblet cells."}, {"url": "http://www.histology.leeds.ac.uk/respiratory/conducting.php", "passage_text": "The epithelium is made up of ciliated columnar cells in larger bronchioles, or non-ciliated in smaller bronchioles (difficult to see at this magnification). There are no goblet cells, but there are cells called Clara cells. These cells are secretory-they secrete one of the components of surfactant. Mucosa and sub-mucosa of Trachea. The respiratory mucosa is made up of the epithelium and supporting lamina propria). The epithelium is tall columnar pseudostratified with cilia and goblet cells."}, {"url": "https://uk.answers.yahoo.com/question/index?qid=20111011054937AANFXMS", "passage_text": "Best Answer: Connective tissue function:- The cartilage rings support the trachea and prevent it from collapsing when air is taken in. Epithelial Tissue function:- The ciliated epithelium cleans out the particulate material in the air before it enters the lungs. "}, {"url": "http://www.emory.edu/ANATOMY/AnatomyManual/pharynx.html", "passage_text": "The LARYNX is an apparatus made up of cartilage, ligaments, muscles, and mucous membrane, which guards the entrance to the lower respiratory passages (trachea, bronchi, and lungs) and houses the vocal cords. Figure 4 shows the major cartilaginous and ligamentous structures which make up the larynx. The PHARYNX is a fibromuscular tube which extends from the base of the skull to the lower border of the cricoid cartilage (at which point it becomes the esophagus). Portions of the pharynx lie posterior to the nasal cavity (nasal pharynx), oral cavity (oral pharynx) and larynx (laryngeal pharynx)."}, {"url": "http://rrespiratorysystemm.weebly.com/major-organs-and-tissues.html", "passage_text": "major tissues. Press image to view larger. Muscle Tissue-Muscle tissue is made up of muscle cells and it creates movement or action in your internal organs. There are 3 types of muscle tissue: smooth muscle tissue, cardiac muscle tissue, and skeletal muscle tissue. Press image to view larger. Nervous Tissue-The cells that make up nervous tissue are from your central nervous system and your peripheral nervous system."}]