[{"url": "http://webtrickz.com/how-to-insert-sim-card-in-iphone-4/", "passage_text": "Apple iPhone 4 uses a Micro SIM which is 15 mm × 12 mm in size while the standard Mini SIM is 25 mm × 15 mm in size. To insert a SIM in iPhone 4, follow the steps below: 1. Take a simple paper clip and make it straight. You can also use the SIM eject tool if it’s included in the phone package."}, {"url": "http://www.wikihow.com/Put-a-SIM-Card-Into-an-iPhone", "passage_text": "If you're changing carriers for your iPhone, or purchased a used one to use on your network, you'll likely need to insert a SIM card into it. Your SIM card allows you to connect to your carrier, and is required for most mobile carriers. Before you can use your SIM card, you may need to unlock your iPhone. Ad."}, {"url": "http://www.technixupdate.com/change-put-sim-card-in-iphone-4/", "passage_text": "If you don’t have the sim ejecting tool with you, you can use a paper clip. Procedure To Put SIM Card In iPhone 4. 1. Insert the end of a paper clip or SIM eject tool into the hole on the SIM card tray, Push firmly, straight in until the tray pops out. 2."}, {"url": "http://www.youtube.com/watch?v=_LkxT9O-8w8", "passage_text": "This video shows you how to insert the SIM card into the Apple iPhone 4. Directions: 1) Locate the MicroSIM Slot. 2) Use the iclip (or paperclip if you don't have one) align the point with the pinhole. 3) Push in until the tray slide out. 4) Remove the tray and fit the microsim card into it."}, {"url": "https://sites.google.com/site/appleiphone4gpriceinindia/how-to-insert-sim-card-in-iphone-4-card-in-iphone-4", "passage_text": "How To Insert Sim Card In Iphone 4. 1  A subscriber identity module (SIM) on a removable SIM card securely stores the service-subscriber key (IMSI) used to identify a subscriber on mobile telephony devices (such as mobile phones and computers)."}, {"url": "http://www.wikihow.com/Put-a-SIM-Card-Into-an-iPhone", "passage_text": "Steps. 1. Make sure your iPhone is unlocked if you're switching carriers. Many iPhones are locked to the carrier that you bought the phone through. In order to switch to a different carrier, you'll need to have the iPhone's SIM card slot unlocked first. 1  Some iPhones come unlocked. 2  For example, Verizon iPhones use the CDMA network in the US instead of the GSM network, so the SIM card is unlocked for all Verizon iPhones."}, {"url": "http://webtrickz.com/how-to-insert-sim-card-in-iphone-4/", "passage_text": "Check the right side of your iPhone 4 to locate the SIM tray as shown below: 3. Insert the pin into the small hole and push it. firmly until the tray pops-out. Now pull out the Sim card tray with your hands. Watch the video below (By MyRandomReviews): 4. Place your Micro SIM card into the SIM tray."}]