[{"url": "http://www.doctor-salaries.com/psychologist-salary/school-psychologist-salary/", "passage_text": "The basic annual salary for school psychologists is usually in the range from $38,475 to $83,339, the yearly bonuses can amount to up to $3,973, and the reported contributions from profit sharing range from none to $4,069 a year according to Payscale’s salary data."}, {"url": "http://www.healthcare-salaries.com/physicians/school-psychologist-salary", "passage_text": "School psychologist salary in USA. Based on work experience, a school psychologist with less than 1 year of experience earns an annual salary ranging from $34,800 to $48,800 whereas the one more than 20 years of experience receives a salary ranging from $61,500 of $81,900 per year."}, {"url": "http://www.doctor-salaries.com/psychologist-salary/school-psychologist-salary/", "passage_text": "Based on Payscale’s salary figures, school psychologists with 1 to 4 years of work experience under their belt typically report earning an hourly wage in the range from $9.91 to $38.78. School psychologists specializing in counseling earn between $10.70 and $43.50 per hour."}, {"url": "http://money.usnews.com/careers/best-jobs/school-psychologist/salary", "passage_text": "With a mean salary of $72,710 per year, school psychologists earn more than many other social services jobs within the education system. School counselors earn a mean annual salary of $56,160, while elementary school teachers earn $56,320 and special education teachers for middle schools earn $59,540."}, {"url": "http://jobstat.net/jobs/school-psychologist/", "passage_text": "Average annual salary for a School Psychologist is $54078 based on statistics in the U.S. as of 2015. The highest salary recorded was $83338. The lowest salary reported was $36616. These figures will vary on a state to state basis as these are averages across all 50 states."}, {"url": "http://jobstat.net/jobs/school-psychologist/", "passage_text": "Median hourly wage for a School Psychologist is $26.89 based on statistics in the U.S. as of 2015. The highest hourly rate recorded was $41.44. The lowest hourly rate recorded was $18.21."}, {"url": "http://www.doctor-salaries.com/psychologist-salary/school-psychologist-salary/", "passage_text": "Professionals with the degree of Doctor of Psychology (PsyD) in School Psychology report earning salaries in the range from $35,235 to $82,069 a year, and those with a Master of Education (MEd) in Psychology are generally paid between $50,000 and $81,000 a year according to Payscale’s salary data."}, {"url": "http://www.healthcare-salaries.com/physicians/school-psychologist-salary", "passage_text": "School psychologist’s salary in the United States is approximately about $63,000 per year. The salary for a school psychologist depends on qualification degree, location, gender, years of work experience and an employment setting."}, {"url": "http://www.doctor-salaries.com/psychologist-salary/school-psychologist-salary/", "passage_text": "Average salary. The average salary for school psychologists employed in the United States is $56,228 a year according to Payscale and $62,000 a year according to the salary information reported by Indeed."}]