[{"url": "http://www.itc-holdings.com/", "passage_text": "ITC Holdings Corp. is the nation's largest independent electricity transmission company. Our track record and operational excellence model are clear and demonstrated. In just our first decade of operations, ITC has successfully acquired, integrated and improved the reliability of the transmission businesses. Our sole focus continues to be on upgrading and building high voltage transmission systems that are modern, robust and resilient, which is the best protection against unforeseen events. This is an ongoing process, and we continue to work to reach a modernized national power grid."}, {"url": "https://en.wikipedia.org/wiki/ITC_%28company%29", "passage_text": "ITC Limited or ITC is an Indian conglomerate headquartered in Kolkata, West Bengal. Its diversified business includes five segments: Fast Moving Consumer Goods (FMCG), Hotels, Paperboards & Packaging, Agri Business & Information Technology. In 1985, ITC set up Surya Tobacco Co. in Nepal as an Indo-Nepali and British joint venture, with the shares divided between ITC, British American Tobacco and various independent domestic shareholders in Nepal. In 2002, Surya Tobacco became a subsidiary of ITC and its name was changed to Surya Nepal Private Limited."}, {"url": "http://www.itcbridge.com/whatisitc.html", "passage_text": "Apparently the electronic devices are of secondary importance-the main component of ITC is psychic-without a possibility to separate the 'mind' or 'spirit' of the terrestrial operator from that of an entity in the beyond. The term describes communication with non-physical entities through electronic devices. According to WorldITC.org ITC is the use of tape recorder, TVs, radios, computers, telephones, and other technical devices with the intent to get meaningful information from beyond in such forms as voices, images, and text.."}, {"url": "https://en.wikipedia.org/wiki/ITC_%28company%29", "passage_text": "ITC was formed on 24 August 1910 under the name of Imperial Tobacco Company of India Limited, and the company went public on 27 October 1954. The earlier decades of the company's activities centered mainly around tobacco products. In 1985, ITC set up Surya Tobacco Co. in Nepal as an Indo-Nepali and British joint venture, with the shares divided between ITC, British American Tobacco and various independent domestic shareholders in Nepal. In 2002, Surya Tobacco became a subsidiary of ITC and its name was changed to Surya Nepal Private Limited."}, {"url": "http://www.itcbridge.com/whatisitc.html", "passage_text": "ITC is used to define a field of research in which people, many referred to simply as experimenters, use a variety of electronic devices and technology to communicate with spirit. The most common medium through which this is expressed today is audio, in the form of EVP (electronic voice phenomena). The term describes communication with non-physical entities through electronic devices. According to WorldITC.org ITC is the use of tape recorder, TVs, radios, computers, telephones, and other technical devices with the intent to get meaningful information from beyond in such forms as voices, images, and text.."}, {"url": "http://www.itc-holdings.com/", "passage_text": "Building a More Secure Grid. ITC has been investing in electric transmission systems since our inception in 2003. Our sole focus continues to be on upgrading and building high voltage transmission systems that are modern, robust and resilient, which is the best protection against unforeseen events. This is an ongoing process, and we continue to work to reach a modernized national power grid."}, {"url": "http://www.seia.org/policy/finance-tax/solar-investment-tax-credit", "passage_text": "The Investment Tax Credit (“ITC”) is a 30 percent federal tax credit for solar systems on residential (under Section 25D) and commercial (under section 48) properties that, under current law, remains in effect through December 31, 2016. The ITC continues to drive growth in the industry and job creation across the country. Recognizing the signifance of the ITC, SEIA and Bloomberg New Energy Finance (BNEF) have developed an analysis that explores the enormous impact of a five-year extension-and what happens if we let it expire."}, {"url": "http://www.cra-arc.gc.ca/tx/bsnss/tpcs/gst-tps/bspsbch/itc-cti/menu-eng.html", "passage_text": "Input tax credits. As a GST/HST registrant, you may recover the GST/HST you paid or owe on purchases and expenses related to your commercial activities by claiming input tax credits (ITCs) on line 106 of your GST/HST return, or by claiming an ITC in the line 108 calculation if you are filing electronically. Electronic filing."}, {"url": "https://en.wikipedia.org/wiki/ITC_%28company%29", "passage_text": "Established in 1910 as the Imperial Tobacco Company of India Limited, the company was renamed as the Indian Tobacco Company Limited in 1970 and further to I.T.C. Limited in 1974. The periods in the name were removed in September 2001 for the company to be renamed as ITC Ltd. In 1985, ITC set up Surya Tobacco Co. in Nepal as an Indo-Nepali and British joint venture, with the shares divided between ITC, British American Tobacco and various independent domestic shareholders in Nepal. In 2002, Surya Tobacco became a subsidiary of ITC and its name was changed to Surya Nepal Private Limited."}, {"url": "http://www.itcbridge.com/whatisitc.html", "passage_text": "ITC is usually conducted with a specific intent on behalf of both parties. Rather than just collecting evidence as an uninvolved observer, most ITC experimenters have had experiences which lead them to be very confident of the reality of life after death. The term describes communication with non-physical entities through electronic devices. According to WorldITC.org ITC is the use of tape recorder, TVs, radios, computers, telephones, and other technical devices with the intent to get meaningful information from beyond in such forms as voices, images, and text.."}]