[{"url": "http://www.chegg.com/homework-help/definitions/connotation-vs-denotation-41", "passage_text": "Definition of Connotation vs. Denotation. Words can have several meanings. The literal meanings, the denotation, are direct, realistic, and often found in the dictionary. What the word suggests or implies, the connotation, is symbolic, culturally constructed, and often influences the interpretation of poetry or literature."}, {"url": "http://www.poeticterminology.net/55-denotation-literary-term.htm", "passage_text": "Each definition, such as the above definition and example of Denotation Literary Term will provide a glossary of literary terms or a dictionary with the meaning, samples, examples and the rules of specialising in each different type of poem and poetry."}, {"url": "http://literarydevices.net/denotation/", "passage_text": "Denotation Definition. Denotation is generally defined as literal or dictionary meanings of a word in contrast to its connotative or associated meanings. Let us try to understand this term with the help of an example."}, {"url": "http://www.examplesinpoetry.com/denotation-poetry-example-definition", "passage_text": "The dictionary meaning of a word without any emotional associations. Definition of Denotation: Example of denotation #1: From: The doctor put him in the dark of ether. He lay and puffed his lips out with his breath."}, {"url": "http://www.poeticterminology.net/55-denotation-literary-term.htm", "passage_text": "Definition of Denotation Literary Term. Denotation Literary Term is the basic definition or dictionary meaning of a word. The connotation of a word is its emotional content. In the Mending Wall by Robert Frost the word wall acts as both a physical boundary (denotation) and emotional barrier (connotation) preventing friendly interaction between neighbours."}, {"url": "http://www.poetrysoup.com/dictionary/denotation", "passage_text": "Poetry Definition. Denotation\u2028The dictionary meaning of a word. Writers typically play off a word's denotative meaning against its connotations, or suggested and implied associational implications."}]