[{"url": "http://health.costhelper.com/blood-test.html", "passage_text": "1 For patients covered by health insurance, out-of-pocket costs for blood work typically consist of a copay ranging from nothing to $30 or more, or coinsurance of 10%-50% or more; deductibles and out-of-pocket maximums will apply."}, {"url": "http://health.costhelper.com/blood-test.html", "passage_text": "1 Routine blood work done as part of an annual physical or a new patient exam can cost $100 -$1,000 or more. 2  Often ordered in connection with an annual physical, a complete blood count (CBC) test alone can cost $10 -$150 or more."}, {"url": "http://www.howmuchisit.org/cbc-blood-test-cost/", "passage_text": "1 On average, a CBC blood test is going to cost anywhere from $25 to $55 for the test alone. 2  In today’s day and age, many laboratories online can give you the results for a low fee. 3  For example, Medlabusa.com offer the test for a price that ranges from $43 to $48. 4  Another lab that offers the service is YourHealthLab.com."}, {"url": "http://health.costhelper.com/blood-test.html", "passage_text": "1 CostHelper readers with insurance report out-of-pocket costs of $283 -$675 for blood tests, with an average of $432; total billed costs were $312 -$1,200 (averaging $755), with the insurance either paying or discounting the total cost by $29 -$525."}, {"url": "http://health.costhelper.com/blood-test.html", "passage_text": "1 For patients not covered by health insurance, total costs can be $100 -$3,000 or more, depending on the number and type of tests ordered; the cost of any doctor visits to order and interpret the tests; and whether the tests are done on an emergency basis."}, {"url": "http://clearhealthcosts.com/blog/2012/12/how-much-does-a-blood-test-cost-it-could-be-16-or-117/", "passage_text": "SUMMARY: Blood tests can cost a little or a lot–we’ve heard as low as $6 and as high as $167 for a simple complete blood count (CBC) test. The sticker price may be shockingly high — and the cash price can be surprisingly low. Hospitals tend to be more expensive than other providers."}, {"url": "http://health.costhelper.com/thyroid.html", "passage_text": "1 For patients covered by health insurance, out-of-pocket costs for a thyroid test typically consist of a copay of $0-$30 or more, or coinsurance of 10-50% or more. 2  Thyroid tests typically are covered by health insurance when medically necessary."}]