[{"url": "http://www.definitions.net/definition/region", "passage_text": "region (Noun). An administrative subdivision of a city, a territory, a country or the European Union. region (Noun). Such a division of the city of Rome and of the territory about Rome, of which the number varied at different times; a district, quarter, or ward. Any considerable and connected part of a space or surface; specifically, a tract of land or sea of considerable but indefinite extent; a country; a district; in a broad sense, a place without special reference to location or extent but viewed as an entity for geographical, social or cultural reasons."}, {"url": "http://www.audioenglish.org/dictionary/region.htm", "passage_text": "4. the approximate amount of something (usually used prepositionally as in 'in the region of'). 5. a knowledge domain that you are interested in or are communicating about. Familiarity information: REGION used as a noun is common. Dictionary entry details. Hyponyms (each of the following is a kind of region): erogenous zone (any area of the body especially sensitive to sexual stimulation). middle; midriff; midsection (the middle area of the human torso (usually in front)). waist; waistline (the narrowing of the body between the ribs and hips)."}, {"url": "http://www.definitions.net/definition/region", "passage_text": "the farming regions of France; religions in all parts of the world; regions of outer space. area, region (noun). a part of an animal that has a special function or is supplied by a given artery or nerve. Any considerable and connected part of a space or surface; specifically, a tract of land or sea of considerable but indefinite extent; a country; a district; in a broad sense, a place without special reference to location or extent but viewed as an entity for geographical, social or cultural reasons."}, {"url": "http://www.wisegeek.org/what-does-region-free-mean.htm", "passage_text": "When a disc is marked with a particular region code, it means that the disc will only play in DVD players that can handle that region, or all region player. Region six DVDs, for example, will only play in region six or all region players. A manufacturer can also choose to mark a disc as region zero, all region, or region free, meaning that it will play in all players. Top 10 facts about the world. The term “region free” refers either to a DVD that can be played anywhere in the world, on any player, or to a DVD player that is capable of handling discs from anywhere. This term is also used to describe game consoles and games in some areas of the world"}, {"url": "http://www.answers.com/Q/What_does_region_mean", "passage_text": "Usually, any time you read of a breakaway region it is referring to an area or region in a country which does not want to be governed or ruled by the country or government whi … ch claims it as its own. 4. region a district without respect to boundaries or extent: an industrial region. 5. region a large, indefinite area or range of something specified: a region of authority. 6. region an area of interest, activity, pursuit, etc.; field. 7. region an administrative division of a country, territory, or city"}, {"url": "http://www.answers.com/Q/What_does_the_word_region_mean", "passage_text": "Region is a geographical word that means geography. In general, a region a is medium-scale area of land or water, smaller than the whole area of interest (which could be, for example, the world, a nation, a river basin, mountain range, and so on), and larger than a specific site. Land region is defined as the area on a continent where the land is  located. For example, the New England land region of the US,  includes all the states in the upper-easte … rn part of the US."}, {"url": "http://www.answers.com/Q/What_does_region_mean", "passage_text": "A region is a specific area, that can be big or small in size, and is defined by having its own characteristics. 4. region a district without respect to boundaries or extent: an industrial region. 5. region a large, indefinite area or range of something specified: a region of authority. 6. region an area of interest, activity, pursuit, etc.; field. 7. region an administrative division of a country, territory, or city"}, {"url": "http://www.answers.com/Q/What_does_region_mean", "passage_text": "What do region means? A large, usually continuous segment of a surface or space; area.A large, indefinite portion of the earth's surface.A specified district or territory.An area of interest or act … ivity; a sphere.Ecology. 4. region a district without respect to boundaries or extent: an industrial region. 5. region a large, indefinite area or range of something specified: a region of authority. 6. region an area of interest, activity, pursuit, etc.; field. 7. region an administrative division of a country, territory, or cit"}]