[{"url": "https://answers.yahoo.com/question/index?qid=20081214092326AACgaGf", "passage_text": "Rating Newest Oldest. Best Answer: A nuclear submarine can stay underwater indefinitely, it produces it's own air and fresh water. The only constraint on the time it can stay submerged is food for the crew. Once the food runs out it has to be re-supplied. A normal patrol can be between 3 and 6 weeks but could be extended to 12 weeks if necessary and if they had enough food for the crew, probably much longer."}, {"url": "https://answers.yahoo.com/question/index?qid=20081214092326AACgaGf", "passage_text": "US Nuclear Submarines can stay submerged for only as long as they have food. That is what is the limiting factor. I have gotten underway walking on food. Large #10 can stacked 2 high throughout the forward compartment and that is just for starters. Needless to say, it can be a really long time! The only constraint on the time it can stay submerged is food for the crew. Once the food runs out it has to be re-supplied. A normal patrol can be between 3 and 6 weeks but could be extended to 12 weeks if necessary and if they had enough food for the crew, probably much longer."}, {"url": "http://www.answers.com/Q/How_long_can_an_average_submarine_stay_under_water", "passage_text": "How long can an alligator stay under water? Normally, an alligator can stay underwater for up to 30 minutes.  However, if they need to stay under longer because they are hiding  from some danger, they can last up to 2 … hours before coming up for  air. A typical person can stay underwater for between 30 seconds and a minute. Trained divers can last for 2 to 3 minutes. Pearl divers can last for up to around 7 minute … s. The world record for staying underwater (without using pure oxygen first) is just over 9 minutes"}, {"url": "http://metro.co.uk/2014/10/08/british-sub-which-can-stay-underwater-for-25-years-makes-us-wonder-4897767/", "passage_text": "HMS Artful can stay underwater for up to 25 years without surfacing – its nuclear reactor only needs serviced once per quarter-century, and the submarine can produce breathable air and water from the sea around it. The crew just have to remember to pack a LOT of DVD box sets. "}, {"url": "https://www.experts123.com/q/how-long-can-submarines-stay-underwater.html", "passage_text": "Nuclear-powered submarines can stay submerged for long periods of time. They are designed and manned to stay underwater long enough to support a wide variety of missions, which can last for several months. When completely submerged, a diesel-powered submarine uses its battery power and electric motors for propulsion. Depending on speed and other battery use, the submarine could stay underwater for up to several days before recharging batteries and exchanging stale air for fresh air."}, {"url": "http://science.howstuffworks.com/transport/engines-equipment/question286.htm", "passage_text": "The limits of battery technology severely constrain the amount of time a diesel sub can stay underwater. This is the huge benefit of using nuclear power in a sub. Nuclear generators need no oxygen, so a nuclear sub can stay underwater for weeks at a time. See How Nuclear Power Works for a description. "}, {"url": "http://science.howstuffworks.com/transport/engines-equipment/submarine3.htm", "passage_text": "The limits of battery technology severely constrain the amount of time a diesel sub can stay underwater. Because of these limitations of batteries, it was recognized that nuclear power in a submarine provided a huge benefit. Nuclear generators need no oxygen, so a nuclear sub can stay underwater for weeks at a time. Also, because nuclear fuel lasts much longer than diesel fuel (years), a nuclear submarine does not have to come to the surface or to a port to refuel and can stay at sea longer. Nuclear subs and aircraft carriers are powered by nuclear reactors that are nearly identical to the reactors used in commercial power plants."}, {"url": "https://www.experts123.com/q/how-long-can-submarines-stay-underwater.html", "passage_text": "Submarines have equipment to make oxygen and keep the air safe. Food and supplies are the only limitations on submergence time for a nuclear submarine. Normally, submarines carry a 90-day supply of food. Historically, diesel-powered submarines operated internal-combustion, air-breathing engines on the surface or just below the surface by using a snorkel mast (snorkeling). When completely submerged, a diesel-powered submarine uses its battery power and electric motors for propulsion. Depending on speed and other battery use, the submarine could stay underwater for up to several days before recharging batteries and exchanging stale air for fresh air."}]