[{"url": "http://www.livestrong.com/article/401827-how-much-vitamin-a-should-you-take-daily/", "passage_text": "Vitamin A Pediatric Dosage. Infants up to 6 months need 400 micrograms of vitamin A per day, while infants between ages 7 months and 12 months require 500 micrograms per day. For children aged 1 to 2 years, the recommended daily allowance, or RDA, for vitamin A is 300 micrograms. Children from the ages of 4 to 8 should consume 400 micrograms each day, whereas children from 9 to 13 need 600 micrograms daily. The RDA for boys aged 14 years to 18 years is 900 micrograms, whereas for girls in the same age group, the RDA is 700 micrograms."}, {"url": "https://www.sharecare.com/health/vitamin-d/how-much-vitamin-d-day", "passage_text": "The safe upper limit for vitamin D is 1,000 to 1,500 international units (IU) per day for infants. For children aged one to eight years, the safe upper limit is 2,500 to 3,000 IU/day, and 4,000 IU/day for children nine years and older, adults and pregnant and lactating teens and women. Vitamin D is a fat-soluble vitamin that can actually be taken infrequently; for example, once monthly, as long as the dose averages to the daily 800-2,000 international units (I.U.) per day."}, {"url": "http://www.vitamindcouncil.org/about-vitamin-d/am-i-getting-too-much-vitamin-d/", "passage_text": "1 take more than 10,000 IU/day (but not equal to) everyday for 3 months or more. 2  However, vitamin D toxicity is more likely to develop if you take 40,000 IU/day everyday for 3 months or more. 3  take more than 300,000 IU in a 24 hour period. Vitamin D toxicity, where vitamin D can be harmful, usually happens if you take 40,000 IU per day for a couple of months or longer, or take a very large one-time dose. Vitamin D is fat-soluble, which means your body has a hard time getting rid of it if you take too much."}, {"url": "http://ods.od.nih.gov/factsheets/VitaminA-Consumer/", "passage_text": "The amount of vitamin A you need depends on your age and reproductive status. Recommended intakes for vitamin A for people aged 14 years and older range between 700 and 900 micrograms (mcg) of retinol activity equivalents (RAE) per day. Recommended intakes for women who are nursing range between 1,200 and 1,300 RAE."}, {"url": "http://www.vitamindcouncil.org/about-vitamin-d/am-i-getting-too-much-vitamin-d/", "passage_text": "You know if your 25(OH)D levels are toxic by a blood test to measure calcium. If calcium is high and 25(OH)D is high, then you are getting too much vitamin D. Very high levels of 25(OH)D can develop if you: 1  take more than 10,000 IU/day (but not equal to) everyday for 3 months or more. 2  However, vitamin D toxicity is more likely to develop if you take 40,000 IU/day everyday for 3 months or more. 3  take more than 300,000 IU in a 24 hour period. Vitamin D toxicity, where vitamin D can be harmful, usually happens if you take 40,000 IU per day for a couple of months or longer, or take a very large one-time dose. Vitamin D is fat-soluble, which means your body has a hard time getting rid of it if you take too much."}, {"url": "http://healthyeating.sfgate.com/much-vitamin-need-day-5573.html", "passage_text": "Intake Recommendations. Most women need 2,333 International Units, or 700 micrograms, of vitamin A each day, while men need 3,000 IU or 900 micrograms, according to the Linus Pauling Institute. "}, {"url": "http://healthyeating.sfgate.com/vitamin-e-good-much-can-safely-day-4795.html", "passage_text": "It is possible to consume too much vitamin E, according to the University of Florida, which says that your daily intake of vitamin E in the form of alpha-tocopherol should not exceed 1,000 milligrams or 1,500 units. The Recommended Dietary Allowance, or RDA, of vitamin E for adults is 15 milligrams daily, or 22 international units. If you are pregnant or breast-feeding, you need slightly more, about 19 milligrams or 29 international units. You can obtain adequate amounts of vitamin E by eating a healthy, well-balanced diet."}, {"url": "http://www.livestrong.com/article/380411-how-much-vitamin-e-should-you-take-daily/", "passage_text": "Currently, males and females over 14 years should consume 15 mg, or 22.5 IU, of vitamin E every day. If you take vitamin E supplements instead of consuming the vitamin in your diet, RDA increases to 33 IU. Breastfeeding mothers should get 19 mg, or 28.5 IU, daily, while infants and children need less, ranging from 4 to 7 mg respectively, or 6 to 9 IU."}, {"url": "http://www.vitamindcouncil.org/about-vitamin-d/am-i-getting-too-much-vitamin-d/", "passage_text": "Although most people take vitamin D supplements without any problems, it’s possible to take too much. This is called vitamin D toxicity. Vitamin D toxicity, where vitamin D can be harmful, usually happens if you take 40,000 IU per day for a couple of months or longer, or take a very large one-time dose. Vitamin D is fat-soluble, which means your body has a hard time getting rid of it if you take too much."}]