[{"url": "http://www.answers.com/Q/What_is_the_Maghreb", "passage_text": "Maghreb means west. The countries of the Maghreb region of Northwest Africa (which is sometimes called Maghrib)are Tunisia, Algeria, Morocco, Libya, and Mauritania. Traditio … nally the geographical region included only Morocco, Algeria, Tunisia, and Libya. The countries that comprise the Maghreb include Libya, Algeria, Morocco, Tunisia, and Mauritania. These are what is considered the Maghreb region in modern times. Historical … ly the area has seen many countries come and go. Answered. In Uncategorized."}, {"url": "http://www.encyclopedia.com/topic/Maghreb.aspx", "passage_text": "Maghreb or Magrib (both: mae´grĬb) [Grĭb.,=arab The], West arabic term FOR Nw. Africa it is generally applied to all Of, Morocco, algeria And tunisia but actually pertains only to the area of the three countries between the high ranges of The Atlas. mts and The Mediterranean. sea "}, {"url": "http://mideastfood.about.com/od/middleeasternfood101/a/Maghreb.htm", "passage_text": "Along the northwest coast of Africa west of Egypt lays the region of Maghreb, an area dominated by Arabs since the 8th century. Before the formation of the modern nation states in the region in the 20 th century, Maghreb was defined as the smaller territory between the Mediterranean Sea and the Atlas mountains. "}, {"url": "http://www.definitions.net/definition/maghreb", "passage_text": "Maghreb (ProperNoun). Northwest Africa, the region of Africa north of the Sahara and west of the Nile. The lands of the Maghreb are generally considered to be the coastal plains of Morocco, Algeria, Tunisia, and western Libya."}, {"url": "http://www.cfr.org/terrorist-organizations-and-networks/al-qaeda-islamic-maghreb-aqim/p12717", "passage_text": "See More of the Most Viewed. Al-Qaeda in the Islamic Maghreb (AQIM) is a Salafi-jihadist militant group and U.S.-designated foreign terrorist organization (FTO) operating in the Sahara and Sahel. The group traces its provenance to Algeria's civil war in the 1990s and has in the past decade become an al-Qaeda affiliate with regional ambitions. Introduction"}, {"url": "http://www.newworldencyclopedia.org/entry/Maghreb", "passage_text": "The Maghreb (المغرب العربي al-Maġrib al-ʿArabī; also rendered Maghrib, or sometimes—though rarely— Moghreb) is a collection of countries within what is commonly termed Northern Africa. The area lies along the Mediterranean Sea and the Atlantic Ocean. The Maghreb is primarily defined through a series of physical geographic features that separate the area from the rest of Africa. The first feature to shape the Maghreb is the Atlas Mountain Range, which define the region's northern border."}, {"url": "https://en.wiktionary.org/wiki/Maghreb", "passage_text": "Maghreb. 1  Northwest Africa, the region of Africa north of the Sahara and west of the Nile. 2  The lands of the Maghreb are generally considered to be the coastal plains of Morocco, Algeria, Tunisia, and western Libya. 1"}, {"url": "http://www.maghreb-studies-association.co.uk/en/allhome.html", "passage_text": "The east. In modern usage the Maghreb comprises the political units of Morocco, Algeria, Tunisia, Libya and Mauritania. To the north, the region is bounded by the Mediterranean Sea, and to the west by the Atlantic Ocean, running from the Straits of Gibraltar southwestwards to the deserts of Mauritania. The Word MAGHREB. The Maghreb or Maghrib is the name given in pre-modern times by Arab writers on geography and history to the northern part of Africa, that which Europeans often came to call Barbary. The Arabic word maghreb means “place where the sun sets”, i.e."}, {"url": "http://www.answers.com/Q/What_is_the_Maghreb", "passage_text": "The countries of the Maghreb region of Northwest Africa (which is sometimes called Maghrib)are Tunisia, Algeria, Morocco, Libya, and Mauritania. The countries that comprise the Maghreb include Libya, Algeria, Morocco, Tunisia, and Mauritania. These are what is considered the Maghreb region in modern times. Historical … ly the area has seen many countries come and go. Answered. In Uncategorized."}]