[{"url": "https://answers.yahoo.com/question/index?qid=20080110072254AAQvnTU", "passage_text": "Also get a heating pad and place it on your shoulder. If it doesn't go away and it's still severely bothering you then see a doctor. My orthopedist can give xrays so I recommend that type of doctor, but your regular internal medicine specialty doctor is also fine. "}, {"url": "http://www.webmd.com/a-to-z-guides/frozen-shoulder-topic-overview", "passage_text": "Frozen shoulder (adhesive capsulitis) is stiffness, pain, and limited range of movement in your shoulder. It may happen after an injury or overuse or from a disease such as diabetes or a stroke. The tissues around the joint stiffen, scar tissue forms, and shoulder movements become difficult and painful. Any shoulder problem can lead to frozen shoulder if you do not work to keep full range of motion. Frozen shoulder occurs: 1  After surgery or injury. 2  Most often in people 40 to 70 years old. 3  More often in women (especially in postmenopausal women) than in men."}, {"url": "http://www.health.harvard.edu/newsletter_article/how-to-release-a-frozen-shoulder", "passage_text": "Harvard Women's Health Watch. Frozen shoulder (also called adhesive capsulitis) is a common disorder that causes pain, stiffness, and loss of normal range of motion in the shoulder. It is caused by an injury or inflammation, which limits movement and causes the tissue around the joint to thicken and contract. "}, {"url": "http://www.webmd.com/a-to-z-guides/frozen-shoulder-topic-overview", "passage_text": "Gentle, progressive range-of-motion exercises, stretching, and using your shoulder more may help prevent frozen shoulder after surgery or an injury. Experts don't know what causes some cases of frozen shoulder, and it may not be possible to prevent these. But be patient and follow your doctor's advice. Any shoulder problem can lead to frozen shoulder if you do not work to keep full range of motion. Frozen shoulder occurs: 1  After surgery or injury. 2  Most often in people 40 to 70 years old. 3  More often in women (especially in postmenopausal women) than in men."}, {"url": "http://familydoctor.org/familydoctor/en/health-tools/search-by-symptom/shoulder-problems.html", "passage_text": "You may have RHEUMATOID ARTHRITIS, a disease affecting the immune system, or GOUT, an inflammation of the shoulder joint. See your doctor. Apply heat to the affected area and take an anti-inflammatory medicine, such as ibuprofen, for pain. Print this. Share: See complete list of charts. Shoulder injuries, arthritis and inflammation in and around joints are common problems in adults, often causing severe pain, discomfort and immobility. Follow this chart to help you talk to your doctor about your shoulder problem."}, {"url": "http://www.precisemoves.com/impingement-sydrome-v-frozen-shoulder/", "passage_text": "Frozen Shoulder is similar to Impingement syndrome but the capsule of the arm is affected with loss of movement in all directions (over the head, to the side, backwards). It happens during active motion (patient does it) or when the doctor moves it and the patient is relaxing the arm. "}, {"url": "http://www.mayoclinic.org/diseases-conditions/frozen-shoulder/basics/treatment/con-20022510", "passage_text": "Medications. Over-the-counter pain relievers, such as aspirin and ibuprofen (Advil, Motrin IB, others), can help reduce pain and inflammation associated with frozen shoulder. In some cases, your doctor may prescribe stronger pain-relieving and anti-inflammatory drugs. "}, {"url": "https://answers.yahoo.com/question/index?qid=20070727082640AADe0au", "passage_text": "I would suggest probably an orthopedic doctor or a sports medicine doctor, but the best suggestion would be to visit your family doctor and get a referral to another good doctor to help with your shoulder. icesk8er · 8 years ago. Thumbs up. 0. Report Abuse. "}, {"url": "http://www.rightdiagnosis.com/f/frozen_shoulder/doctors.htm", "passage_text": "Doctors and specialists in areas related to Frozen Shoulder: 1  Bone, Joint and Orthopedic Specialists: 2  Orthopedic Surgery. 3  Neuromusculoskeletal Medicine. 4  Rheumatology (Arthritis / Joint Pain). 5  Nerve Specialists: 6  Neurology (Brain/CNS Specialists). 7  Pediatric Neurology (Child Brain Specialist). 8  Spinal Cord Injury Medicine. Doctor and medical specialist list for Frozen Shoulder: The following types of doctors or medical specialists have been listed as possibly involved in diagnosis, treatment or management for Frozen Shoulder: 1  Orthopedic surgeon"}]