[{"url": "http://www.buzzle.com/articles/structure-of-the-human-respiratory-system.html", "passage_text": "Let us look at its structure. The respiratory system in human beings can be divided into the upper respiratory tract that consists of nasal passages, pharynx, and larynx, and the lower respiratory tract that is composed of the trachea, the primary bronchi, and the lungs. The human respiratory system is composed of the nasal passages, the pharynx, larynx, the trachea, bronchi, and the lungs. It is responsible for the process of respiration that is vital to the survival of living beings. Respiration is the process of obtaining and using oxygen, while eliminating carbon dioxide"}, {"url": "http://adrenalfatiguesolution.com/anatomy-of-the-respiratory-system/", "passage_text": "8. The last component of the respiratory system is a muscle structure known as the muscles of respiration. These muscles surround the lungs and allow the inhalation and exhalation of air. The main muscle in this system is known as the diaphragm, a thin sheet of muscle that constitutes the bottom of the thorax. The nose and nasal cavity constitute the main external opening of the respiratory system. They represent the entryway to the respiratory tract – a passage through the body which air uses for travel in order to reach the lungs."}, {"url": "http://www.innerbody.com/anatomy/respiratory", "passage_text": "The respiratory system provides oxygen to the body’s cells while removing carbon dioxide, a waste product that can be lethal if allowed to accumulate. There are 3 major parts of the respiratory system: the airway, the lungs, and the muscles of respiration. The airway, which includes the nose, mouth, pharynx, larynx, trachea, bronchi, and bronchioles, carries air between the lungs and the body’s exterior. The lungs... "}, {"url": "http://www.mada.org.il/en/about/engineer/challenge/respiratory-system", "passage_text": "The respiratory system is the system in the human body that enables us to breathe. The act of breathing includes: inhaling and exhaling air in the body; the absorption of oxygen from the air in order to produce energy; the discharge of carbon dioxide, which is the byproduct of the process. At the same time, carbon dioxide (CO2) is transmitted from the blood capillaries into the alveoli and then expelled through the bronchi and the upper respiratory tract. The inner surface of the lungs where the exchange of gases takes place is very large, due to the structure of the air sacs of the alveoli."}, {"url": "http://adrenalfatiguesolution.com/anatomy-of-the-respiratory-system/", "passage_text": "Anatomy Of The Respiratory System. The respiratory system (also referred to as the ventilator system) is a complex biological system comprised of several organs that facilitate the inhalation and exhalation of oxygen and carbon dioxide in living organisms (or, in other words, breathing). The nose and nasal cavity constitute the main external opening of the respiratory system. They represent the entryway to the respiratory tract – a passage through the body which air uses for travel in order to reach the lungs."}, {"url": "https://en.wikipedia.org/wiki/Respiratory_system", "passage_text": "In humans and other mammals, the anatomical features of the respiratory system include trachea, bronchi, bronchioles, lungs, and diaphragm. Molecules of oxygen and carbon dioxide are passively exchanged, by diffusion, between the gaseous external environment and the blood. See also: Respiratory tract. The respiratory system (called also respiratory apparatus, ventilatory system) is a biological system consisting of specific organs and structures used for the process of respiration in an organism."}, {"url": "http://adrenalfatiguesolution.com/anatomy-of-the-respiratory-system/", "passage_text": "In fact, the system is composed of the following biological structures: nose and nasal cavity, mouth, pharynx, larynx, trachea, bronchi and bronchioles, lungs and the muscles of respiration. (1). A properly functioning respiratory system is a vital part of our good health. The nose and nasal cavity constitute the main external opening of the respiratory system. They represent the entryway to the respiratory tract – a passage through the body which air uses for travel in order to reach the lungs."}, {"url": "http://www.mada.org.il/en/about/engineer/challenge/respiratory-system", "passage_text": "Upper respiratory tract: This includes the nose, mouth, and the beginning of the trachea (the section that takes air in and lets it out). Lower respiratory tract: This includes the trachea, the bronchi, broncheoli and the lungs (the act of breathing takes place in this part of the system). The organs of the lower respiratory tract are located in the chest cavity. At the same time, carbon dioxide (CO2) is transmitted from the blood capillaries into the alveoli and then expelled through the bronchi and the upper respiratory tract. The inner surface of the lungs where the exchange of gases takes place is very large, due to the structure of the air sacs of the alveoli."}]