[{"url": "http://babyandbump.momtastic.com/assisted-conception/867993-ivf-success-know-look-e2-levels-follicle-size-more.html", "passage_text": "Follicle Size and Follicle Count. IVF is all about the eggs and one important indicator of your cycle is follicle size. Follicle size indicates how your eggs are developing and when they will be mature enough for retrieval. Follicles grow approximately two millimeters a day and size is an average. Thus a follicle that is ten by twelve millimeters averages to eleven millimeters."}, {"url": "http://babyandbump.momtastic.com/assisted-conception/867993-ivf-success-know-look-e2-levels-follicle-size-more.html", "passage_text": "The ultrasound technician will count the number of follicles, measure follicle size as well as the thickness of the uterine lining. A thicker lining is better, but thinner linings may not necessarily be a problem. Uterine lining should measure at least 7 to 8 mm in thickness."}, {"url": "http://www.advancedfertility.com/ivfstim.htm", "passage_text": "1 We try to stimulate the woman to get at least 4 follicles with sizes of 14-20mm diameter. 2  Ideally, there would be at least 8 follicles between 13-20 mm. 3  The goal is to get a good number (about 8-15) of quality eggs. 4  Blood hormone levels and developing follicle sizes are monitored."}, {"url": "http://fertilitytoday.org/frequent_questions.html", "passage_text": "How do you determine when to give hCG in respect to follicle size? In a natural (unstimulated cycle) or Clomiphene Citrate cycle, mature follicle size is between 18 - 30 mm. If triggered, these cycles are typically triggered when follicle size is between 17-26mm (dependent of the practice and IVF lab). In a gonadotropin cycle, mature follicle size is between 16 - 20 mm. These cycles are typically triggered when"}, {"url": "http://www.advancedfertility.com/cancellation.htm", "passage_text": "1 The stimulation must result in a minimum of 3 mature (or close to mature) follicles (we consider follicles to be mature if they are 16-20mm in average diameter on the day of HCG). 2  Alternatively, if there are 2 follicles 16-20mm and at least 2 more that are 13-15mm, we can proceed to the egg retrieval."}, {"url": "http://www.fertilethoughts.com/forums/using-injectibles/409683-question-about-follicle-size-e2-levels.html", "passage_text": "It is possible for slightly smaller follicles, 14-15mm, to contain a viable egg. Also, follicles continue to grow until they release, usually at a rate of about 1-2 mm per day. A woman may ovulate more than one follicle in a cycle, but the releases will occur within 24 hours."}]