[{"url": "https://en.wikipedia.org/wiki/Spondyloarthropathy", "passage_text": "As such, it is a class or category of diseases rather than a single, specific entity. It differs from spondylopathy, which is a disease of the vertebra itself. However, many conditions involve both spondylopathy and spondyloarthropathy. Nonvertebral symptoms of spondyloarthropathies include asymmetric peripheral arthritis (which is distinct from rheumatoid arthritis), arthritis of the toe interphalangeal joints, sausage digits, Achilles tendinitis, plantar fasciitis, costochondritis, iritis, and mucocutaneous lesions."}, {"url": "http://ehealthwall.com/spondyloarthropathy-definition-symptoms-causes-treatment/", "passage_text": "Spondyloarthropathy Definition. Spondyloarthropathy is a group of diseases involving the joint in the vertebral column. The presence of inflammation along with the joint disease is known as spondyloarthritis. Generally, spondyloarthropathy involves any joint involvement in the vertebral column that may result from any joint disease. Types of Spondyloarthropathy. Seronegative spondyloarthropathy. Seronegative spondyloarthropathy is a group of joint disease that involves the axial skeleton. Being seronegative, the patient does not exhibit the presence of rheumatoid factor in the blood. This means that the pathophysiologic mechanism of the condition is different from rheumatoid arthritis"}, {"url": "http://www.merriam-webster.com/dictionary/seronegative", "passage_text": "Definition of SERONEGATIVE. : having or being a negative serum reaction especially in a test for the presence of an antibody. — se·ro·neg·a·tiv·i·ty \\-ˌne-gə-ˈti-və-tē\\ noun. "}, {"url": "http://www.nras.org.uk/seropositive-seronegative", "passage_text": "Introduction. The diagnosis of any disease usually progresses along a well defined path that has three parts: a history of the complaint, blood tests and, usually, imaging (x-rays or scans). Seropositive/seronegative is a term that refers to the results of a blood test. The blood test that is ordered by the doctor in order to help establish the diagnosis of rheumatoid arthritis (RA) is looking for the presence of two proteins in the blood"}, {"url": "https://en.wikipedia.org/wiki/Spondyloarthropathy", "passage_text": "For the Italian type of company, see Societa società per. Azioni spondyloarthropathy or spondyloarthrosis refers to any joint disease of the vertebral. Column as, such it is a class or category of diseases rather than a, single specific. Entity it differs from, spondylopathy which is a disease of the vertebra. itself Nonvertebral symptoms of spondyloarthropathies include asymmetric peripheral arthritis (which is distinct from rheumatoid arthritis), arthritis of the toe interphalangeal joints, sausage digits, Achilles tendinitis, plantar fasciitis, costochondritis, iritis, and mucocutaneous lesions."}, {"url": "http://medicine.med.nyu.edu/rheumatology/conditions-we-treat/seronegative-arthritis", "passage_text": "Seronegative arthritis refers to a diverse group of musculoskeletal syndromes linked by common clinical features and common immunopathologic mechanisms. The disease is often incorrectly referred to as seronegative rheumatoid arthritis. This is incorrect because the demographics and clinical presentations of the diseases within this group differ markedly from"}, {"url": "http://www.arthritisresearchuk.org/arthritis-information/q-and-a/drug-information/what-is-seronegative-arthritis-and-treating-with-methotrexate.aspx", "passage_text": "A) Arthritis can be generally divided into seropositive and seronegative – this refers to the presence in the blood of an antibody called rheumatoid factor. About 70 per cent of people with rheumatoid arthritis are seropositive. So seronegative rheumatoid arthritis occurs and this may be the diagnosis in your case. "}, {"url": "https://www.rheumatology.org/I-Am-A/Patient-Caregiver/Diseases-Conditions/Spondyloarthritis", "passage_text": "1 Spondyloarthritis is a type of arthritis that attacks the spine and, in some people, the joints of the arms and legs. 2  It can also involve the skin, intestines and eyes. 3  The main symptom (what you feel) in most patients is low back pain. 4  This occurs most often in axial spondyloarthritis. Spondyloarthritis (or spondyloarthropathy) is the name for a family of inflammatory rheumatic diseases that cause arthritis. It differs from other types of arthritis, because it involves the sites are where ligaments and tendons attach to bones called “entheses.” Symptoms present in two main ways."}, {"url": "http://www.arthritis-treatment-and-relief.com/seronegative-arthritis.html", "passage_text": "It's available exclusively at this website... not available in stores. Click here: Second Opinion Arthritis Treatment Kit. Therm seronegative arthritis refers to a group of conditions causing arthritis of the spine and peripheral joints, often associated with HLA B27, but without a positive rheumatoid factor. "}]