[{"url": "http://articles.latimes.com/2011/dec/18/local/la-me-slab-city-20111218", "passage_text": "— Penny Puckett came to Slab City and fell in love. After four years of bumming around and hopping freight trains, the 25-year-old from Kansas City arrived at this hardscrabble section of the Imperial Valley desert and immediately embraced its sense of liberation from society's rules and norms. Now that the state is broke, Slab City is out of sight and out of mind, just the way its residents like it. This is the last truly free place in America, said Jim Merton, 54, who spends the winter at Slab City and the summer in Washington."}, {"url": "https://en.wikipedia.org/wiki/Slab_City", "passage_text": "For the unincorporated community in Wisconsin, see Slab City, Wisconsin. Slab City or The Slabs is a snowbird campsite in the Sonoran Desert 156 miles northeast of San Diego, used by recreational vehicle owners and squatters from across North America. It takes its name from the concrete slabs that remain from the abandoned World War II Marine barracks of Camp Dunlap. Located just east of State Route 111, the entrance to Slab City is easily recognized by the colorful Salvation Mountain, a small hill approximately three stories high which is entirely covered in acrylic paint, concrete and adobe and festooned with Bible verses."}, {"url": "https://en.wikipedia.org/wiki/Slab_City,_Wisconsin", "passage_text": "Slab City, Wisconsin is an unincorporated community in Shawano County, Wisconsin, in the Town of Hartland. It is located one mile south of Bonduel on Wisconsin Highway 47. "}, {"url": "http://articles.latimes.com/2011/dec/18/local/la-me-slab-city-20111218", "passage_text": "PHOTOS: Slab City. Slab City people have a great need to live with just the bare necessities and are happy about it, she said. Puckett also met and married the man of her dreams: a T-shirt design artist who lives in an art colony-style portion of Slab City known as East Jesus. Now that the state is broke, Slab City is out of sight and out of mind, just the way its residents like it. This is the last truly free place in America, said Jim Merton, 54, who spends the winter at Slab City and the summer in Washington."}, {"url": "http://www.atlasobscura.com/places/slab-city-california", "passage_text": "Edit this place. Slab City, or The Slabs, is a free campsite and alternative living community located near an active bombing range in the desert city of Niland, California."}, {"url": "http://www.npr.org/2012/01/24/145645412/down-and-out-escape-to-slab-in-california-desert", "passage_text": "Gloria Hillard/For NPR. Slab City is an informal community in the California desert on the site of a former WWII artillery range. The recent recession has sent the town a new wave of people who have fallen on hard times and are looking to escape the burdens of modern life. There are no signs leading to Slab City. "}, {"url": "http://content.time.com/time/nation/article/0,8599,2105597,00.html", "passage_text": "Way off. Slab City, their home for the past three months, is a squatters' camp deep in the badlands of California's poorest county, where the road ends and the sun reigns, about 190 miles southeast of Los Angeles and hour's drive from the Mexican border. "}, {"url": "http://www.kpbs.org/news/2015/apr/15/will-slab-city-remain-last-free-place-america/", "passage_text": "The future of Slab City's squatter community — 140 miles east of San Diego — is threatened as the state considers selling the desert land in Imperial County. Slab City's East Jesus. The East Jesus Art Collective operates an artist residency and sculpture garden at the edge of Slab City. The state is open to selling the land again. The nonprofit group that oversees Salvation Mountain, a nearby artwork and tourist draw, is applying to buy the land the mountain sits on."}, {"url": "http://www.motherearthliving.com/green-living/design-for-life-slab-city-where-freedoms-still-free.aspx", "passage_text": "But I’d been intrigued by Slab City for years. I had to see for myself. Slab City is a squatter community on the site of a former military base in the Southern California desert, east of the Salton Sea near the little town of Niland. Aging asphalt roads and concrete slabs are the only reminders of its past. "}]