[{"url": "http://anxiety.emedtv.com/escitalopram/escitalopram-dose.html", "passage_text": "Escitalopram Dosage Recommendations. The recommended starting dosage of escitalopram for adults or adolescents (age 12 to 17 years old) with depression or adults with generalized anxiety disorder is escitalopram 10 mg once a day."}, {"url": "http://www.psych.med.umich.edu/anxiety/treatment.asp", "passage_text": "These allow a low starting dose (12.5mg of Zoloft, 5mg of Celexa) and slow titration (anxiety patients are very vulnerable to initial activation and worsening of symptoms). Effective ranges: 50-200 mg of Zoloft, 20-40 mg of Celexa, and 10-20 mg of Lexapro."}, {"url": "http://depression.emedtv.com/lexapro/lexapro-dosage.html", "passage_text": "For people who are taking Lexapro for the treatment of depression or generalized anxiety disorder, dosage recommendations typically range from 10 mg to 20 mg once a day."}, {"url": "http://www.healthyplace.com/lexapro/patient-center/lexapro-faqs-starting-lexapro-dosage-issues/", "passage_text": "For all patients, 10 mg/day is the recommended starting dose of LEXAPRO. 10 mg/day is also the maintenance dose for many patients. If the dose is increased to 20 mg/day, this should occur after a minimum of 1 week. LEXAPRO can be taken morning or evening once daily, with or without food."}, {"url": "http://depression.emedtv.com/lexapro/lexapro-dosage.html", "passage_text": "Individual doses of Lexapro can range from 10 mg to 20 mg once a day. For elderly people or people with liver problems, the maximum dose is 10 mg once daily."}, {"url": "http://depression.emedtv.com/lexapro/lexapro-dosage.html", "passage_text": "Dosing Recommendations for Lexapro. The recommended starting dose of Lexapro for adults or adolescents (age 12 to 17 years old) with depression or adults with generalized anxiety disorder is 10 mg once a day. Your healthcare provider may choose to increase the dose if symptoms continue, or decrease it if side effects occur."}, {"url": "http://www.rxlist.com/lexapro-drug/indications-dosage.htm", "passage_text": "The recommended dose of Lexapro is 10 mg once daily. A fixed-dose trial of Lexapro demonstrated the effectiveness of both 10 mg and 20 mg of Lexapro, but failed to demonstrate a greater benefit of 20 mg over 10 mg [see Clinical Studies ]."}]