[{"url": "http://salarybystate.org/tag/entry-level-pharmacist-salary", "passage_text": "Reported in 2010 by the BLS the total number of jobs for Pharmacists on the market was 274,900 positions and the Pharmacist job market is expected to expand by 25% from 2010 – 2020. That is a $55,000 a year difference depending on where you get your pharmacist job so it’s smart to do your research before you take your offer. Listed below is information that is specific to Pharmacist job salaries that you can expect to receive in that state area."}, {"url": "http://www.bls.gov/ooh/Healthcare/Pharmacists.htm", "passage_text": "The median annual wage for pharmacists was $116,670 in May 2012. The median wage is the wage at which half the workers in an occupation earned more than that amount and half earned less. The lowest 10 percent earned less than $89,280, and the top 10 percent earned more than $145,910. Prospective pharmacists are required to have a Doctor of Pharmacy (Pharm.D.) degree, a postgraduate professional degree. In July 2012, there were 124 Doctor of Pharmacy programs fully accredited by the Accreditation Council for Pharmacy Education (ACPE)."}, {"url": "http://www.indeed.com/q-Nutrition-Support-Pharmacist-jobs.html", "passage_text": "Pharmacy Coordinator-York Hospital Inpatient Pharmacy. Pharmacists working with the Pharmacy Department participate in providing specialist level care through our work within our Pain Team, Nutrition Support, and... 13 days ago-save job-email-more... 1  View all WellSpan Health Services jobs in York, PA-York jobs. 2  Salary Search: Pharmacy Coordinator salaries in York, PA. Salaries: Clinical Pharmacist salary-Health Educator salary-Pharmacist salary. Get new jobs for this search by email. My email: You can cancel email alerts at any time."}, {"url": "http://salarybystate.org/tag/entry-level-pharmacist-salary", "passage_text": "This will add nearly 69,700 pharmacist jobs at pharmacies all across the United States from 2010 – 2010 for this job outlook. From our detailed job listing salaries of pharmacists you can expect to make as little as $85,000 a year to as much as $135,000 a year depending on what state you decide to be employed in. That is a $55,000 a year difference depending on where you get your pharmacist job so it’s smart to do your research before you take your offer. Listed below is information that is specific to Pharmacist job salaries that you can expect to receive in that state area."}, {"url": "http://money.usnews.com/careers/best-jobs/pharmacist/salary", "passage_text": "Salary Outlook. The median annual salary for a pharmacist was $119,280, or $57.35 per hour, in 2013. The best-paid 10 percent made $147,350, while the lowest-paid made $89,000. The best-compensated pharmacists are employed by merchandise stores"}, {"url": "http://money.usnews.com/careers/best-jobs/pharmacist/salary", "passage_text": "Pharmacists have one of the highest average salaries of any of our Best Health Care Jobs, earning $116,500 in 2013. They make more, on average, than physical therapists ($82,180) and registered nurses ($68,910). The median annual salary for a pharmacist was $119,280, or $57.35 per hour, in 2013. The best-paid 10 percent made $147,350, while the lowest-paid made $89,000. The best-compensated pharmacists are employed by merchandise stores"}, {"url": "http://money.usnews.com/careers/best-jobs/pharmacist/salary", "passage_text": "Read more on salaries and benefits here. The median annual salary for a pharmacist was $119,280, or $57.35 per hour, in 2013. The best-paid 10 percent made $147,350, while the lowest-paid made $89,000. The best-compensated pharmacists are employed by merchandise stores"}, {"url": "http://learningpath.org/articles/Nutrition_Researcher_Career_Summary.html", "passage_text": "For this career, you'll need a bachelor's degree. Programs cover nutrition, biology, physiology, dietetics, food service management and chemistry. Dieticians are also required to have extensive supervised training, and a license is needed in most states. The BLS reported a mean annual salary of about $55,000 in 2011. While this is less than for a nutrition researcher, dieticians can expect a higher job growth rate of 20% from 2010-2020."}]