[{"url": "http://goaskalice.columbia.edu/answered-questions/shin-pains-walking", "passage_text": "What you're describing sounds like the beginnings of a case of shin splints. Walking on pavement increases the stress on your joints and connective tissue. Shin splints are an inflammation of the muscle and/or tendons of the lower leg caused by repetitive walking or running on a hard surface. The symptoms are pain on the inner side of the shinbone (tibia) in the front part of the leg. Sometimes, it comes on very slowly and eventually becomes quite severe."}, {"url": "https://answers.yahoo.com/question/index?qid=20070619154737AA8o1z4", "passage_text": "Sometimes i find that when i pick up pace the front of my shins really ache. Normally i can keep walking and it goes within ten minutes, but there have been times when it really hurts and i have to make my way..."}, {"url": "https://answers.yahoo.com/question/index?qid=20070619154737AA8o1z4", "passage_text": "Sometimes i find that when i pick up pace the front of my shins really ache. Normally i can keep walking and it goes within ten minutes, but there have been times when it really hurts and i have to make my way back."}, {"url": "https://answers.yahoo.com/question/index?qid=20070619154737AA8o1z4", "passage_text": "Sometimes i find that when i pick up pace the front of my shins really ache. Normally i can keep walking and it goes within ten minutes, but there have been times when it really hurts and i have... Source(s): fronts shins hurt walk briskly: https://shortly.im/SLPkl. Wilda · 2 months ago."}, {"url": "https://uk.answers.yahoo.com/question/index?qid=20090304092637AAss1Xu", "passage_text": "I was a cross country runner for years and have suffered shin splints. It really hurts! Shin splints is an inflammation of the tissues in the lower leg causing pain with exercise. It is common in those who walk, jog, or run on hard, uneven surfaces. The pain can radiation down the front and side of the leg, extending down the back and inner leg and ankle."}, {"url": "https://www.nlm.nih.gov/medlineplus/ency/patientinstructions/000654.htm", "passage_text": "Shin splints occurs when you have pain in the front of your lower leg. The pain of shin splints is from the inflammation of the muscles, tendons, and bone tissue around your shin. Shin splints are a common problem for runners, gymnasts, dancers, and military recruits."}]