[{"url": "http://www.intoxalock.com/ignition-interlock-devices/pricing", "passage_text": "A. Getting a DUI is expensive, but getting an ignition interlock installed doesn’t have to be. The pricing is considerably low cost and affordable. Intoxalock ignition interlock leases start as low as $65 per month for court or state mandated Legacy devices. Final pricing depends on your state’s requirements for technology and reporting, and how long you will need the equipment. Voluntary (non-DUI related) leases start at $49.95 per month. Top"}, {"url": "http://www.howmuchisit.org/interlock-device-cost/", "passage_text": "1 Installation fee. 2  As per flhsmv.gov, the cost for installing an interlock device in Florida is $75. 3  Although other states may have different fees, they are all in the same basic range. 4  IgnitionInterlockDevice.org stated on its site that the installation costs around $50 to $200. 1 According to IgnitionInterlockDevice.org, the installation of the device typically costs from $100-$200. 2  The monthly rental fee can range from $70 to $100. 3  The price of the interlock device may vary from one state to another."}, {"url": "http://www.howmuchisit.org/interlock-device-cost/", "passage_text": "1 On the state’s official site, the court stated the price of the interlock device is only $12. 2  The installation, monthly monitoring and a refundable deposit or monthly insurance charges have their corresponding prices as well. 3  These costs are much higher than the device itself. 1 According to IgnitionInterlockDevice.org, the installation of the device typically costs from $100-$200. 2  The monthly rental fee can range from $70 to $100. 3  The price of the interlock device may vary from one state to another."}, {"url": "http://www.duiattorney.com/interlock-costs/", "passage_text": "Ignition interlock devices must be purchased or rented from private companies, and usually cost anywhere from $65 – $100+ per month. Some companies charge additional fees for installation, and often a deposit is required. "}, {"url": "http://www.howmuchisit.org/interlock-device-cost/", "passage_text": "1 As per flhsmv.gov, the cost for installing an interlock device in Florida is $75. 2  Although other states may have different fees, they are all in the same basic range. 3  IgnitionInterlockDevice.org stated on its site that the installation costs around $50 to $200. 1 According to IgnitionInterlockDevice.org, the installation of the device typically costs from $100-$200. 2  The monthly rental fee can range from $70 to $100. 3  The price of the interlock device may vary from one state to another."}, {"url": "http://www.monitechnc.com/ignition-interlock-costs/", "passage_text": "Override Costs: Once an ignition interlock device has been installed in your vehicle, you will be required to pass a breathalyzer test in order to start your vehicle and keep it running. In the event that you fail a breath test, your vehicle will go into a lockdown mode, and you will be unable to start it. "}, {"url": "http://www.totallawyers.com/ignition-interlock/", "passage_text": "Ignition interlocks are sold or rented by private companies authorized or licensed by the state. Renting an ignition interlock device generally costs between $70 and $100 per month, plus tax, and installing one can cost as much as $100 to $200. You are expected to pay these costs, along with any maintenance expenses, and fees for downloading the records the device stores. "}, {"url": "http://www.duiarresthelp.com/ignition-interlock.php", "passage_text": "Ignition Interlock Device Prices. The overall cost of installation, calibration and scheduled maintenance is the responsibility of the offender. An ignition interlock device will cost around $75 per month and a couple hundred dollars to be installed. Some states have programs that will subsidize the monthly cost if the offender can prove that they do not have the financial means to pay the monthly charg"}, {"url": "http://www.howmuchisit.org/interlock-device-cost/", "passage_text": "1 The price of the interlock device may vary from one state to another. 2  In Florida, for example, the state has mandated that those arrested and convicted of DUI/DWI must install an interlock systems into their vehicle. 3  On the state’s official site, the court stated the price of the interlock device is only $12. 1 According to IgnitionInterlockDevice.org, the installation of the device typically costs from $100-$200. 2  The monthly rental fee can range from $70 to $100. 3 "}, {"url": "http://dui.drivinglaws.org/interlock.php", "passage_text": "Prices vary across the United States for the installation and lease of an ignition interlock system. You can expect to pay up to $100 for installation and between $50-$100 per month for the lease. This is a rough estimate and your price may be higher or lower depending on your geographic location. An ignition interlock device (IID) is similar to a breathalyzer, however an IID is connected to the vehicle dashboard or other location inside the vehicle and requires that a driver breath into the device prior to starting the vehicle."}]