[{"url": "https://en.wikipedia.org/wiki/Emancipation_Proclamation", "passage_text": "The Emancipation Proclamation broadened the goals of the Civil War. While slavery had been a major issue that led to the war, Lincoln's only mission at the start of the war was to maintain the Union. The Proclamation made freeing the slaves an explicit goal of the Union war effort. The Emancipation Proclamation was a presidential proclamation and executive order issued by President Abraham Lincoln on January 1, 1863. In a single stroke, it changed the federal legal status of more than 3 million enslaved persons in the designated areas of the South from slave to free."}, {"url": "http://www.civilwar.org/education/history/emancipation-150/10-facts.html", "passage_text": "When the Confederacy did not yield, Lincoln issued the final Emancipation Proclamation on January 1st, 1863. Fact #2: The Emancipation Proclamation only applied to the states in rebellion. President Lincoln justified the Emancipation Proclamation as a war measure intended to cripple the Confederacy. Abraham Lincoln issued the preliminary Emancipation Proclamation on September 22nd, 1862. It stipulated that if the Southern states did not cease their rebellion by January 1st, 1863, then Proclamation would go into effect."}, {"url": "http://www.archives.gov/exhibits/featured_documents/emancipation_proclamation/", "passage_text": "The Emancipation Proclamation. President Abraham Lincoln issued the Emancipation Proclamation on January 1, 1863, as the nation approached its third year of bloody civil war. The proclamation declared that all persons held as slaves within the rebellious states are, and henceforward shall be free.. The original of the Emancipation Proclamation of January 1, 1863, is in the National Archives in Washington, DC. With the text covering five pages the document was originally tied with narrow red and blue ribbons, which were attached to the signature page by a wafered impression of the seal of the United States."}, {"url": "http://www.civilwar.org/education/history/emancipation-150/10-facts.html", "passage_text": "Fact #1: Lincoln actually issued the Emancipation Proclamation twice. Abraham Lincoln issued the preliminary Emancipation Proclamation on September 22nd, 1862. It stipulated that if the Southern states did not cease their rebellion by January 1st, 1863, then Proclamation would go into effect."}, {"url": "http://www.historynet.com/emancipation-proclamation", "passage_text": "Read the transcript of the Emancipation Proclamation. See emancipation proclamation text. Emancipation Proclamation summary: The Emancipation Proclamation was issued by President Abraham Lincoln on January 1, 1863, as the country entered the third year of the Civil War."}, {"url": "http://www.history.com/topics/black-history/thirteenth-amendment", "passage_text": "Introduction. The 13th Amendment to the U.S. Constitution officially abolished slavery in America, and was ratified on December 6, 1865, after the conclusion of the American Civil War. A+E Networks. The 13th Amendment to the U.S. Constitution officially abolished slavery in America, and was ratified on December 6, 1865, after the conclusion of the American Civil War."}, {"url": "https://en.wikipedia.org/wiki/Emancipation_Proclamation", "passage_text": "On September 22, 1862, Lincoln had issued a preliminary proclamation warning that he would order the emancipation of all slaves in any state that did not end its rebellion against the Union by January 1, 1863. The Emancipation Proclamation was a presidential proclamation and executive order issued by President Abraham Lincoln on January 1, 1863. In a single stroke, it changed the federal legal status of more than 3 million enslaved persons in the designated areas of the South from slave to free."}]