[{"url": "https://en.wikipedia.org/wiki/Offer_and_acceptance", "passage_text": "Offer and acceptance analysis is a traditional approach in contract law. The offer and acceptance formula, developed in the 19th century, identifies a moment of formation when the parties are of one mind. This classical approach to contract formation has been weakened by developments in the law of estoppel, misleading conduct, misrepresentation and unjust enrichment."}, {"url": "http://legal-dictionary.thefreedictionary.com/implied+acceptance", "passage_text": "The act of a person to whom something is offered or tendered by another, whereby the offeree demonstrates through an act invited by the offer an intention of retaining the subject of the offer. In the law of contracts, acceptance is one person's compliance with the terms of an offer made by another. Acceptance occurs in the law of insurance when an insurer agrees to receive a person's application for insurance and to issue a policy protecting the person against certain risks, such as fire or theft. 5. Acceptance of a bill of exchange the act by which the drawee or other person evinces his assent or intention to comply with and be bound by, the request contained in a bill of exchange to pay the same; or in other words, it is an engagement to pay the bill when due. 4 East, 72."}, {"url": "http://legal-dictionary.thefreedictionary.com/implied+acceptance", "passage_text": "1; or it may be expressed or implied. 10. An express acceptance is an agreement in direct and express terms to pay a bill of exchange, either by the party on whom it is drawn, or by some other person, for the honor of some of the parties. 5. Acceptance of a bill of exchange the act by which the drawee or other person evinces his assent or intention to comply with and be bound by, the request contained in a bill of exchange to pay the same; or in other words, it is an engagement to pay the bill when due. 4 East, 72."}, {"url": "http://legal-dictionary.thefreedictionary.com/implied+acceptance", "passage_text": "11. An implied acceptance is an agreement to pay a bill, not by direct and express terms, but by any acts of the party from which an express agreement may be fairly inferred. 5. Acceptance of a bill of exchange the act by which the drawee or other person evinces his assent or intention to comply with and be bound by, the request contained in a bill of exchange to pay the same; or in other words, it is an engagement to pay the bill when due. 4 East, 72."}, {"url": "http://legal-dictionary.thefreedictionary.com/acceptance", "passage_text": "5. Acceptance of a bill of exchange the act by which the drawee or other person evinces his assent or intention to comply with and be bound by, the request contained in a bill of exchange to pay the same; or in other words, it is an engagement to pay the bill when due. 4 East, 72."}, {"url": "http://www.4lawschool.com/contracts101/offer.htm", "passage_text": "Offer and acceptance analysis is a traditional approach in contract law used to determine whether an agreement exists between two parties. An offer is an indication by one person to another of their willingness to contract on certain terms without further negotiations. A contract is said to come into existence when acceptance of an offer has been communicated to the offeror by the offeree. The offer and acceptance formula, developed in the 19th century, identifies a moment of formation when the parties are of one mind."}, {"url": "http://legal-dictionary.thefreedictionary.com/acceptance", "passage_text": "11. An implied acceptance is an agreement to pay a bill, not by direct and express terms, but by any acts of the party from which an express agreement may be fairly inferred. Acceptance of a bill of exchange the act by which the drawee or other person evinces his assent or intention to comply with and be bound by, the request contained in a bill of exchange to pay the same; or in other words, it is an engagement to pay the bill when due. 4 East, 72."}, {"url": "http://legal-dictionary.thefreedictionary.com/acceptance", "passage_text": "The act of a person to whom something is offered or tendered by another, whereby the offeree demonstrates through an act invited by the offer an intention of retaining the subject of the offer. In the law of contracts, acceptance is one person's compliance with the terms of an offer made by another. Acceptance occurs in the law of insurance when an insurer agrees to receive a person's application for insurance and to issue a policy protecting the person against certain risks, such as fire or theft. Acceptance of a bill of exchange the act by which the drawee or other person evinces his assent or intention to comply with and be bound by, the request contained in a bill of exchange to pay the same; or in other words, it is an engagement to pay the bill when due. 4 East, 72."}, {"url": "http://www.nolo.com/legal-encyclopedia/acceptance-of-contract-offers-32651.html", "passage_text": "Acceptance isn't always communicated by words; sometimes actions suffice. For example, if a buyer places an order to buy goods at a certain price, and the seller responds by shipping the goods, the seller's actions signal acceptance of the offer. However, silence by itself--that is, if one party doesn't say or do anything--rarely constitutes acceptance. Occasionally, one party disputes whether the other accepted an offer. In general, acceptance has not occurred if any of the following are true. 1  One party's response to an offer doesn't communicate a readiness to be bound. ( 2 Sounds good, let me think about it.)."}]