[{"url": "http://www.wisegeekedu.com/how-do-i-become-a-claims-representative.htm", "passage_text": "Claims representatives must have good customer service skills. A claims representative must have experience working with people. A claims representative works on behalf of an insurance provider to ensure that all guidelines are followed while processing a claim. A claims representative works on behalf of an insurance provider to ensure that all guidelines and established rules are followed in the processing of each insurance claim or appeal."}, {"url": "http://work.chron.com/job-description-property-claims-rep-4179.html", "passage_text": "Customer Service. A property claims representative must interact with claimants who may or may not be customers of the carrier he represents. It is the job of the representative to make contact with claimants and schedule a time to inspect the property damage. Communicating with customers throughout the claims process is a routine aspect of a property claims representative's job."}, {"url": "http://work.chron.com/job-description-property-claims-rep-4179.html", "passage_text": "Insurance carriers rely on claims representatives to investigate and evaluate property damage claims. The process involves local or long-distance travel to damage sites. For instance, a property claims representative may meet a claimant at her place of employment to investigate minor vehicle damage. It is the job of the representative to make contact with claimants and schedule a time to inspect the property damage. Communicating with customers throughout the claims process is a routine aspect of a property claims representative's job."}, {"url": "http://www.wisegeek.com/what-does-a-claims-representative-do.htm", "passage_text": "A claims representative is responsible for providing customer service, processing claims requests and resolving problems. These representatives can be found in multiple industries but are most commonly found in the service sector. Potential employers include government benefit agencies and insurance companies. The claims representative is the first point of contact for customers who need to file a claim. The purpose of a claim is to request reimbursement of a payment or to access benefits paid for through an insurance program. Clients make regular payments to obtain insurance or benefit coverage."}, {"url": "http://work.chron.com/job-description-property-claims-rep-4179.html", "passage_text": "A property claims representative may work for an insurance carrier or be self-employed. Claims adjusters are more likely to become self-employed after gaining years of experience with a carrier. It is the job of the representative to make contact with claimants and schedule a time to inspect the property damage. Communicating with customers throughout the claims process is a routine aspect of a property claims representative's job."}, {"url": "http://www.bls.gov/ooh/Office-and-Administrative-Support/Customer-service-representatives.htm", "passage_text": "Customer service representatives handle customer complaints, process orders, and provide information about an organization’s products and services. Customer service representatives answer questions or requests from customers or the public. They typically answer incoming phone calls, but some also interact with customers face to face, by email, or live chat. The specific duties of customer service representatives vary depending on what kind of company they work for."}, {"url": "http://www.wisegeek.com/what-does-a-claims-representative-do.htm", "passage_text": "A claims representative is the first point of contact for a person who needs to file an insurance claim. Claims representatives may cover workers compensation programs. The claims representative is the first point of contact for customers who need to file a claim. The purpose of a claim is to request reimbursement of a payment or to access benefits paid for through an insurance program. Clients make regular payments to obtain insurance or benefit coverage."}, {"url": "http://www.nolo.com/legal-encyclopedia/insurance-adjusters-who-they-are-how-they-handle-injury-claim.html", "passage_text": "Insurance claims adjusters come with different titles, such as claims specialist, claims representative, or independent claims analyst, but they all do the same job. The result is that while an adjuster will know more than you about the claims business in general, he or she will not know your particular claim nearly as well as you do. You were there during the accident. You know what your injuries are, how much and where they hurt, and how long they have taken to heal."}, {"url": "https://mycareeratva.va.gov/careers/career/099604", "passage_text": "Rating Veterans Service Representatives (RVSR) serve as decision makers for claims involving rating decisions. Rating Veterans Service Representatives are responsible for analyzing claims, applying VA's Schedule for Rating Disabilities (Rating Schedule), and preparing rating decisions. These employees inform the Veterans Service Representatives (VSR) and claimant of the decision and the basis and reasons for the decision. These professionals work to ensure that Veterans receive the care and benefits they have earned through their service."}]