[{"url": "http://www.innovateus.net/innopedia/what-chimerism", "passage_text": "Chimerism is a type of chromosomal disorder. It has been observed that chimerism manifests in the form of two DNA sets or organs that do not match the genetic code of the rest of the population. Presence of hermaphroditic characteristics clearly indicates chimerism disorder."}, {"url": "http://www.ansci.wisc.edu/jjp1/ansci_repro/misc/project_websites_08/tues/Freemartin/Chimerism.html", "passage_text": "Chimerism is what happens when cells from one twin are present in the other. For example, white blood cells with Y chromosomes would be found in the female twin. Vigier et. al, 1989."}, {"url": "http://www.wisegeek.org/what-is-chimerism.htm", "passage_text": "In some cases, chimerism may be the deliberate result of scientists attempting to mix two species. In one case, scientists successfully produced a goat/sheep mix. They have also been able to produce a chimera quail/chicken. Most often these attempts fail, and if they do work, the animal produced is often sterile."}, {"url": "http://house.wikia.com/wiki/Chimerism", "passage_text": "Chimerism is a very rare condition caused by the fusion of zygotes (fertilized eggs) into a single form during early cell duplication. It is extremely rare, with only forty or so known human cases. It is somewhat more common in the animal kingdom."}, {"url": "http://www.wisegeek.org/what-is-chimerism.htm", "passage_text": "Chimerism is an rare disorder that mixes the chromosomal population in a single organism. In these cases, chimerism may manifest as the presence of two sets of DNA, or organs that do not match the DNA of the rest of the organism. In some cases, hermaphroditic characteristics, in other words, having both male and female sex organs, can be signs of chimerism."}, {"url": "http://www.brighthub.com/science/genetics/articles/39124.aspx", "passage_text": "Chimerism refers to organisms possessing more than one genetic identity. The term “chimera” comes from a mythological composite creature made from parts of other animals. In humans, a chimera can be the result of two embryos becoming fused. This is considered to be very rare."}, {"url": "http://www.ansci.wisc.edu/jjp1/ansci_repro/misc/project_websites_08/tues/Freemartin/Chimerism.html", "passage_text": "Chimerism is a method of detection of freemartin cattle. Because chimerism involves cells from one twin being present in the other, it is a visible sign and proof that the placental membranes had fused."}]