[{"url": "http://www.collegecalc.org/colleges/massachusetts/boston-university/", "passage_text": "Tuition for Boston University is $45,686 for the 2014/2015 academic year. This is 81% more expensive than the national average private non-profit four year college tuition of $25,224. Boston University is one of the 100 most expensive colleges in the America, coming in 63rd on our Expensive 100 Ranking. The cost is $17,457 and 62% more expensive than the average Massachusetts tuition of $28,229 for 4 year colleges. Tuition ranks 76th in Massachusetts amongst 4 year colleges for affordability and is the 9th most expensive 4 year college in the state. Price does not vary by residence."}, {"url": "http://www.collegecalc.org/colleges/massachusetts/university-of-massachusetts-boston/", "passage_text": "The total list price for in-state Massachusetts residents to go to University of Massachusetts-Boston is $21,816 for the 2014/2015 academic year. Out-of-state students who don't possess Massachusetts residence can expect a one year cost of $29,860."}, {"url": "http://www.collegecalc.org/colleges/massachusetts/university-of-massachusetts-boston/", "passage_text": "University of Massachusetts Boston tuition is $1,714 per year for in-state residents. This is 73% cheaper than the national average public four year tuition of $6,429. The cost is $26,515 and 94% cheaper than the average Massachusetts tuition of $28,229 for 4 year colleges."}, {"url": "http://grad-schools.usnews.rankingsandreviews.com/best-graduate-schools/top-nursing-schools/university-of-massachusetts-boston-33128", "passage_text": "University of Massachusetts--Boston is a public school. The College of Nursing & Health Sciences has an application deadline of March 1 and an application fee of $60 for U.S. residents."}, {"url": "http://www.collegecalc.org/colleges/massachusetts/university-of-massachusetts-boston/", "passage_text": "Undergraduate Tuition. University of Massachusetts Boston tuition is $1,714 per year for in-state residents. This is 73% cheaper than the national average public four year tuition of $6,429. The cost is $26,515 and 94% cheaper than the average Massachusetts tuition of $28,229 for 4 year colleges."}, {"url": "http://www.collegecalc.org/colleges/massachusetts/university-of-massachusetts-boston/", "passage_text": "The net out-of-pocket total cost you end up paying or financing though student loans is known as the net price. The reported University of Massachusetts-Boston net price for in-state students $10,575* for the 2013/2014 academic year. This net price includes housing and meal expenses."}]