[{"url": "http://histology-world.com/testbank/lymph1a.htm", "passage_text": "The large aggregates of lymphatic tissue in the ileum are called Peyer's patches. A lymph node is an encapsulated lymphatic organ. The random distribution of lymphocytes seen in the lamina propria of the respiratory tract, genitourinary tract, and gastrointestinal tract is called diffuse lymphatic tissue. Answer: d. Bone marrow, lymph nodes, the spleen and the thymus are all part of the lymphatic system. Most lymphatic organs are made of a framework of reticular fibers and reticular cells. However, the thymus is made of epithelioreticular cells instead."}, {"url": "http://teachers.sduhsd.net/ahaas/Anatomy%20Physiology/blood%20and%20lymphatics/lymphatic%20practice%20exam%20questions.pdf", "passage_text": "The lymphatic vessels in the villi of the small intestine, called, are involved in the absorption of The smallest vessels in the lymphatic system are called. The largest vessels are called The walls of lymphatic vessels are most similar to the walls of a, arteries. c. capillaries. b. veins. "}, {"url": "http://clt.astate.edu/mgilmore/lymph.htm", "passage_text": "Specialized lymph capillaries are associated with the vili of the small intestine. These vessels are called lacteals because the lipid they transport makes the lymph look milky. This fluid is called chyle. The lymphatic organs are the red bone marrow, the thymus gland, lymph nodes, lymph nodules, and the spleen. "}, {"url": "http://www.austincc.edu/lesalbin/Chapter%2022%20Lymph%202304.ppt", "passage_text": "Closely tied to the immune system in protecting the body against foreign organisms. Organs and tissues of the lymphatic system: Lymph Lymphatic vessels Lymphatic cells Lymph nodes Spleen Tonsils Peyer’s patches Thymus The lymphatic system Functions: (a). fluid recovery: reabsorbs 2-4 l/day; prevents edema. (b). "}, {"url": "http://www.livescience.com/26983-lymphatic-system.html", "passage_text": "The lymphatic system is a network of tissues and organs that help rid the body of toxins, waste and other unwanted materials. The primary function of the lymphatic system is to transport lymph, a fluid containing infection-fighting white blood cells, throughout the body. The lymphatic system primarily consists of lymphatic vessels, which are similar to the circulatory system's veins and capillaries. "}, {"url": "http://www.cancerindex.org/medterm/medtm9.htm", "passage_text": "1 Peyer's patches: these are clusters of lymphatic nodules in the mucosa that lines the ileum of the small intestine. 2  They play an important role in defending against the large number of pathogens that enter the gastrointestinal system. Lymph is a fluid that circulates throughout the body in the lymphatic system. It forms when tissue fluids/blood plasma (mostly water, with proteins and other dissolved substances) drain into the lymphatic system. It contains a high number of lymphocytes (white cells that fight infection)"}, {"url": "https://en.wikipedia.org/wiki/Peyer%27s_patch", "passage_text": "They are aggregations of lymphoid tissue that are usually found in the lowest portion of the small intestine, the ileum, in humans; as such, they differentiate the ileum from the duodenum and jejunum. The duodenum can be identified by Brunner's glands. The jejunum has neither Brunner's glands nor Peyer's patches. At least 46% of Peyer's patches are concentrated in the distal 25 cm of ileum in humans. It is important to note that there are large variations in size, shape, and distribution of Peyer's patches from one individual to another one."}, {"url": "http://lifesci.dls.rutgers.edu/~babiarz/lympho.htm", "passage_text": "Lymph Nodes. Lymph nodes are found throughout the body associated with the lymphatic vessels, and function to filter the lymph. lymph nodes are surrounded by a connective tissue capsule and are usually found embedded in fat. "}, {"url": "http://www.innerbody.com/anatomy/immune-lymphatic/peyers-patches", "passage_text": "They belong to a class of non-encapsulated lymphatic tissue known as lymphatic nodules, which include the tonsils and lymphatic tissue of the appendix.... Click to read more below. Peyer’s patches are small masses of lymphatic tissue found throughout the ileum region of the small intestine. Also known as aggregated lymphoid nodules, they form an important part of the immune system by monitoring intestinal bacteria populations and preventing the growth of pathogenic bacteria in the intestines. [Continued from above] . . . Special epithelial cells known as microfold cells line the side of the Peyer’s patch facing the intestinal lumen, while the outer side contains many lymphoid cells and lymphatic vessels. The function of Peyer’s patches is to analyze and respond to pathogenic microbes in the ileum."}]