[{"url": "http://www.kitchenchatters.com/steam-mop-reviews", "passage_text": "3 Best Steam Mop Reviews. Steam mops are becoming more and more popular for their ease of use and the fact that they are a much greener and healthier way of cleaning most flooring types. Nobody likes to smell the harsh chemicals from cleaning with a bucket and mop. How Steam Mops Work. Steam mops may be one of the simplest cleaning tools next to a mop you will ever use. All it really takes for a steam mop to operate is the ability to turn hot water into steam. This steam is then fed through the head unit into a cloth pad that is then used to clean your floors."}, {"url": "http://housekeeping.about.com/od/surfacefloors/tp/topsteammops.htm", "passage_text": "The Lysol Steam Mop has a good output of steam, decent cleaning cloths, and good performance on many floor types, for 1/2 the price of most other steam mops. This is definitely not a heavy duty steam mop, but the price makes it a good introductory mop. When looking for a steam mop, the number one priority is how effectively it cleans your floors. The second priority is how easy the steam mop is to use. These are the best of the best."}, {"url": "http://housekeeping.about.com/od/surfacefloors/tp/topsteammops.htm", "passage_text": "It can be difficult to sort between the various bells and whistles, but these steam mops performed well. When looking for a steam mop, the number one priority is how effectively it cleans your floors. The second priority is how easy the steam mop is to use. These are the best of the best. Eureka EnviroSteamer Steam Mop. Photo Credit: Electrolux Home Care Products. The Eureka EnviroSteamer uses continuous steam and a heavy duty magic cleaning cloth to clean vinyl, ceramic tile, sealed hardwood, laminate, and more"}, {"url": "https://en.wikipedia.org/wiki/Steam_mop", "passage_text": "Some of the steam mops feature a two-sided, flip mop head that allows you to clean twice as much floor before changing the mop pad. One pad is soft for use on delicate flooring such as hardwood s and laminate s. The other pad has built-in scrubbing strips that facilitate cleaning tough messes. A steam mop works by heating up the water inside the reservoir to temperatures of about 120 degrees Celsius (248 degrees Fahrenheit). Many steam mops have one jet of dry steam (but may have as many as 15 jets), moistening a microfibre pad placed underneath. The steam helps soak the pad and dirt is drawn off ground"}, {"url": "https://en.wikipedia.org/wiki/Steam_mop", "passage_text": "A steam mop is a mop that uses steam to clean floors and carpets. Unlike a regular mop, which requires cleaning agents such as bleach or detergent, a steam mop uses heat from steam to disinfect the floors. A microfibre pad is often placed right underneath the steam jet to trap dirt. A steam mop works by heating up the water inside the reservoir to temperatures of about 120 degrees Celsius (248 degrees Fahrenheit). Many steam mops have one jet of dry steam (but may have as many as 15 jets), moistening a microfibre pad placed underneath. The steam helps soak the pad and dirt is drawn off ground"}, {"url": "http://www.consumerreports.org/cro/steam-mops/buying-guide.htm", "passage_text": "Getting started. You might expect a steam mop to be more convenient than an ordinary squeeze mop, with no squeegee to squeeze and no pail of water to deal with. You might also expect the steam to loosen dried food spills effectively, and perhaps even sanitize floors and other surfaces. The squeeze mop cleaned our floors at least as well as the steam mops, if not better. Of course, we had to scrub more vigorously and allow extra time to refresh the mop repeatedly in a pail of hot water. Despite that, our testers found the squeeze mop strangely more satisfying."}, {"url": "http://www.sears.com/appliances-vacuums-floor-care-steam-mops-cleaners/b-1202544724", "passage_text": "Floor steam mops and cleaners are the ideal tool for keeping tile and hardwood floors clean. A steam mop not only removes dirt, dust and grime from the floor but it can even sanitize the floor, helping you to maintain a healthy household. "}, {"url": "http://www.consumerreports.org/cro/steam-mops.htm", "passage_text": "Steam mops can be convenient with no squeegee to squeeze and no bucket of water to fill. To find out if steam mops are better at cleaning floors we coated vinyl flooring with spilled food and sticky stuff. Some steam mops were better than others at mopping up the mess. If you're looking for information about steam mops, Consumer Reports is your best resource. Steam mop buying guide. You might expect a steam mop to be more convenient than an ordinary squeeze mop, with no squeegee to squeeze and no pail of water to deal with. You might also expect the steam to loosen dried food spills effectively, and perhaps even sanitize floors and other surfaces."}]