[{"url": "http://www.answers.com/Q/What_continent_touches_Europe_on_its_eastern_border", "passage_text": "Asia is completely to the east of Europe, so any border will be the part of the eastern border. The Ural & Caucus Mountains form the eastern border as well as the Bosphorus St … rait and part of the Mediterranean Sea and Caspian Sea. 1 Crossing the Canadian Border Crossing the Canadian border and dealing with immigration and customs may seem uneventful to the thousands of travelers that go between Canada and the United States every yea…. 2  Europe on a Budget: 21 Free Walking Tours in Europe Walking tours can be a great way to get to know a new city."}, {"url": "http://www.answers.com/Q/What_continent_touches_Europe_on_its_eastern_border", "passage_text": "Australia, who is fully in the Eastern Hemisphere, does not border any other continents. Antarctica, who is partially in the Eastern Hemisphere, does not border any other con … tinents as well. 1 person found this useful. 1 Crossing the Canadian Border Crossing the Canadian border and dealing with immigration and customs may seem uneventful to the thousands of travelers that go between Canada and the United States every yea…. 2  Europe on a Budget: 21 Free Walking Tours in Europe Walking tours can be a great way to get to know a new city."}, {"url": "http://studyzone.org/testprep/ss5/b/comcontocintrol.cfm", "passage_text": "Asia is the largest of the continents. Asia is located east of Europe, so it shares its western border with Europe. To the east of Asia, lies the Pacific Ocean, which also separates Asia from North America. South of Asia, lies the Indian Ocean. The Indian Ocean separates Asia from another continent. The seven continents are: North America, South America, Europe, Asia, Africa, Australia/Oceania, and Antarctica. The United States is located on the continent of North America. Oceans make up most of the world's surface area."}, {"url": "http://www.answers.com/Q/What_continent_is_touching_the_eastern_border_of_Europe", "passage_text": "Confidence votes 19.4K. Mensan, woodworker, building electronics projects since age 12, taught electronics, am in ham radio, very good at biology/astronomy/physics. Asia is the continent that is touching the eastern border of Europe. Australia, who is fully in the Eastern Hemisphere, does not border any other continents. Antarctica, who is partially in the Eastern Hemisphere, does not border any other con … tinents as well."}, {"url": "http://studyzone.org/testprep/ss5/b/comcontocintrol.cfm", "passage_text": "Europe sits to the east of the Atlantic Ocean, and south of the Arctic Ocean. The Atlantic Ocean separates Europe from North America. The continent of Europe shares its eastern border with another continent. This giant land mass is. . . The seven continents are: North America, South America, Europe, Asia, Africa, Australia/Oceania, and Antarctica. The United States is located on the continent of North America. Oceans make up most of the world's surface area."}, {"url": "http://www.commoncoresheets.com/Social%20Studies/Geography/World_Geography/English/1.pdf", "passage_text": "Antarctica C. EuropeB. North America D. Australia 14) Which continent is not touching any other continents?A. Asia C. AfricaB. Antarctica D. North America 15) Which continent is touching the eastern border of Europe?A. North America C. AfricaB. Australia D. Asia 16) Which ocean touches Africa's western border?A. "}, {"url": "http://www.answers.com/Q/What_continent_is_touching_the_eastern_border_of_Europe", "passage_text": "Asia is completely to the east of Europe, so any border will be the part of the eastern border. The Ural & Caucus Mountains form the eastern border as well as the Bosphorus St … rait and part of the Mediterranean Sea and Caspian Sea. 1 person found this useful. Australia, who is fully in the Eastern Hemisphere, does not border any other continents. Antarctica, who is partially in the Eastern Hemisphere, does not border any other con … tinents as well."}, {"url": "http://www.worldatlas.com/aatlas/infopage/contnent.htm", "passage_text": "Politically it is part of North America, but geographically it is not part of any continent. Turkey is officially, politically and geographically part of both the European and Asian continents. Its established dividing line between Asia and Europe is the Bosphorus Strait. All countries listed by continent here. Notes: In some parts of the world students are taught that there are only six continents, as they combine North America and South America into one continent called the Americas. Other experts use only six continents by combining Europe and Asia into a continent called Eurasia."}]