[{"url": "https://www.gov.uk/government/news/millions-start-receiving-break-down-of-how-their-tax-is-spent", "passage_text": "From Monday 3 November over 24 million people will start receiving their first Annual Tax Summary from HM Revenue and Customs (HMRC), which breaks down exactly how their tax is spent by the Exchequer."}, {"url": "http://www.moneyunder30.com/gift-tax", "passage_text": "However, if you gave $14,000 to Friend A, but $15,000 to Friend B, you would then be taxed on that $1,000 gift to Friend B. (So, as you can see, unless you’re regularly throwing around five-figure gifts, the gift tax limitations will exclude the gifts most of us give and receive)."}, {"url": "https://www.gov.uk/guidance/annual-tax-summary", "passage_text": "If you pay your Income Tax through PAYE, you’ll get your tax summary through the post. If you’re a Self Assessment taxpayer, you can go online to see your tax summary. You’ll need to sign up for. ’s online services if you haven’t already. Your summary will be ready to view soon after you’ve submitted your tax return."}, {"url": "https://www.gov.uk/government/news/millions-start-receiving-break-down-of-how-their-tax-is-spent", "passage_text": "There are 29.9 million income taxpayers in the UK. Any taxpayer who does not receive a tax summary can use HMRC’s tax calculator to estimate their tax bill and see how it contributes to public spending. The app can be downloaded free of charge from the Apple app store or Google Play by searching ‘HMRC tax calculator’."}, {"url": "http://www.moneyunder30.com/gift-tax", "passage_text": "In 2015, a taxpayer can give up to $14,000 per person per year without being taxed on the gift. For example, this year you could give Friend A $14,000, Friend B $14,000, and your sister $14,000 and not be taxed on your gifts."}, {"url": "https://www.gov.uk/guidance/annual-tax-summary", "passage_text": "Who gets a tax summary. Most people who pay Income Tax will get a summary. If you don’t get one, and you’re employed and paying tax through PAYE, you can use HMRC’s tax calculator to estimate your tax and see how it contributes to public spending. You can download the free app from the Apple app store or Google Play by searching ‘."}, {"url": "https://www.irs.gov/Businesses/Small-Businesses-&-Self-Employed/Business-Taxes", "passage_text": "The federal income tax is a pay-as-you-go tax. You must pay the tax as you earn or receive income during the year. An employee usually has income tax withheld from his or her pay. If you do not pay your tax through withholding, or do not pay enough tax that way, you might have to pay estimated tax."}, {"url": "https://www.gov.uk/government/news/millions-start-receiving-break-down-of-how-their-tax-is-spent", "passage_text": "8 million taxpayers who complete self-assessment returns will be able to access their tax summary online, while the 16 million PAYE taxpayers who received a tax coding notice from HMRC for 2013 to 2014 will receive their summary in the post over the next seven weeks."}]