[{"url": "http://www.payscale.com/research/US/Job=Concierge/Hourly_Rate", "passage_text": "Median of all compensation (including tips, bonus, and overtime) by years of experience. Salaries of relatively inexperienced workers fall in the neighborhood of $27K, but folks who have racked up five to 10 years see a notably higher median of $30K. Lesconcierges offers the largest salaries in town — $47K on average. Soaring salaries can also be found at Equity Residential, Marriott International, Inc., and Capitol Concierge, Inc., where earnings of $37K, $27K, or $27K are standard for Concierges."}, {"url": "http://www.indeed.com/cmp/Diamond-Resorts-International/salaries", "passage_text": "The average Diamond Resorts International salary ranges from approximately $20,000 per year for Concierge to $140,000 per year for Sales Manager. Average Diamond Resorts International hourly pay ranges from approximately $9.00 per hour for Care Specialist to $40.00 per hour for Concierge. Salary information comes from 50 data points collected directly from employees, users, and jobs on Indeed"}, {"url": "http://www.payscale.com/research/US/Employer=Diamond_Resorts_International/Salary", "passage_text": "In his TED Talk last spring, Michael Kimmel spoke about something he knows something about: men and privilege. Not only is he a middle-class white mal... It's a good thing when you can really be... 3 Reasons Why It's Tough to Teach in West Virginia (and These Other States). There are a lot of wonderful things about being a teacher, but it's a really difficult job, too."}, {"url": "http://www.payscale.com/research/US/Job=Concierge/Hourly_Rate", "passage_text": "Place of residence plays a huge part in a Concierge's salary, with Orlando Concierges earning salaries that are 21 percent less than the national average. Not at the bottom but still paying below the median are employers in Atlanta and Miami (13 percent lower and 7 percent lower, respectively). Lesconcierges offers the largest salaries in town — $47K on average. Soaring salaries can also be found at Equity Residential, Marriott International, Inc., and Capitol Concierge, Inc., where earnings of $37K, $27K, or $27K are standard for Concierges."}, {"url": "http://www.payscale.com/research/US/Job=Concierge/Hourly_Rate", "passage_text": "Median pay for Concierges in the United States lies in the neighborhood of $12.51 per hour. Pay generally varies between $9.66 per hour and $17.71. The most important factor affecting compensation for this group is the particular firm, followed by the particular city and years of experience. Lesconcierges offers the largest salaries in town — $47K on average. Soaring salaries can also be found at Equity Residential, Marriott International, Inc., and Capitol Concierge, Inc., where earnings of $37K, $27K, or $27K are standard for Concierges."}]