[{"url": "https://en.wikipedia.org/wiki/Jute", "passage_text": "Jute is the name of the plant or fiber that is used to make burlap, Hessian or gunny cloth. The word 'jute' is probably coined from the word jhuta or jota, an Oriya word. Jute is one of the most affordable natural fibers and is second only to cotton in amount produced and variety of uses of vegetable fibers. "}, {"url": "http://burlapfabric.com/jute", "passage_text": "Jute Fabric. Jute fiber is another one of the products that we carry that is very similar to burlap. In fact they are both made from fibres from the same plant. It is a natural, coarse vegetable fibre that is sometimes used to manufacture twine, a product which we proudly carry. "}, {"url": "http://www.innovateus.net/content/what-burlap", "passage_text": "Print Email Save. Burlap fabric is one kind of fabric made from jute or from vegetable fibers. Burlap fabric was used to create the camouflage effect on the helmets of the soldiers. It is porous and breathable and so it is used in various sacks and bags for shipping goods. 1 Burlap fabric is used in making potato, grain, onion or rice sacks. 2  This is used in packing of bales of wool and tree roots etc. 3  Burlap fabric can be used as decorative item for home projects."}, {"url": "https://www.burlapwreath.com/", "passage_text": "Burlap fabric, also known as Hessian or Jute, is a strong durable fabric usually made from skin of the jute plant (wiki) . Prized for it’s durability, burlap has historically been used in industrial applications. However, recently burlap decor has made a comeback due to its elegant but rustic look. "}, {"url": "http://www.joann.com/burlap-fabric/prd23682.html", "passage_text": "This item is sold by the yard Offered in an assortment of colors, the 100 percent jute Joann Stores Burlap fabric is ideal for a wide variety of fabric and decor based projects. This heavyweight, odorless and tightly-woven fabric is sanitized to eliminate natural oils. "}, {"url": "https://en.wikipedia.org/wiki/Hessian_(cloth)", "passage_text": "Rug making on burlap. Hessian /ˈhɛsi.ən/ , or burlap in the US and Canada, is a woven fabric usually made from skin of the jute plant or sisal fibres, or may be combined with other vegetable fibres to make rope, nets, and similar products. Gunny cloth is similar. Hessian, a dense woven fabric, has been historically produced as a coarse fabric, but more recently it is being used in a refined state known simply as jute as an eco-friendly material for bags, rugs, and other products."}, {"url": "http://www.ehow.com/how-does_4600964_what-burlap-made.html", "passage_text": "Save. According to Webster's New World College Dictionary, burlap is a coarse cloth made of jute or hemp.. Today, the words burlap, hessian, jute and gunnysack are often used interchangeably to refer to the same textile. Jute, when fully-matured, is a 12-foot long stemmed plant that is grown and manufactured primarily in India; it's commonly known as the golden fiber, due to its natural golden and silky shine. Burlap is extremely environmentally friendly. It's a sustainable, 100 percent biodegradable product and the second most important natural fiber in the world; of all reusable bags, burlap specifically has the lowest carbon and water footprint of all the options."}, {"url": "http://www.ehow.com/about_5030516_chemicals-burlap.html", "passage_text": "Burlap is made from the fibrous jute plant, which is found in India, Pakistan and Bangladesh. Burlap is environmentally friendly because it is 100 percent biodegradable in its natural state. It is used to make sacks, table cloths, curtains and as a backing for carpet or linoleum, among other things."}]