[{"url": "http://www.bloodbook.com/gloss-abrev.html", "passage_text": "Following here is a glossary or dictionary list of the most common of Blood related abbreviations (to the technician), that will leave the rest of us scratching a hole in our heads. We present these here because this is the language of your hospital report, and most of the Blood tests that are returned to you."}, {"url": "http://file.scirp.org/Html/11-1920099_27632.htm", "passage_text": "The concept of withdrawing a percentage of blood and leaving the patient anemic and normovolemic, is intended to minimize the loss of red blood-cells during surgery [1-3,6]. As the hemoglobin concentration is reduced through dilution, the blood that is lost during surgery will contain less hemoglobin."}, {"url": "http://www.ncbi.nlm.nih.gov/pubmed/11556167", "passage_text": "[Changes in blood volume during acute normovolemic hemodilution with 5% albumin or 6% hydroxyethylstarch and intraoperative retransfusion]."}, {"url": "http://www.merriam-webster.com/medical/normovolemia", "passage_text": "Medical Definition of NORMOVOLEMIA. : a normal volume of blood in the body."}, {"url": "http://www.merriam-webster.com/dictionary/hemodilution", "passage_text": "Medical Definition of HEMODILUTION. 1. : decreased concentration (as after hemorrhage) of cells and solids in the blood resulting from gain of fluid—compare hemoconcentration. 2. — he·mo·di·lute or chiefly British hae·mo·di·lute \\-ˈluet\\ ˈlüt, verb·he·mo·di·lut ed·he·mo·di·lut. ing"}, {"url": "http://noblood.org/forum/content/142-acute_normovolemic_hemodilution", "passage_text": "Acute Normovolemic Hemodilution (ANH) is a term used to describe a perioperative blood conservation technique (Figure 1) used predominantly by anesthesiologists."}, {"url": "http://noblood.org/forum/content/142-acute_normovolemic_hemodilution", "passage_text": "Here, one mL is infused for each one mL of blood collected. A mixture of colloid and crystalloid is sometimes used, in a 1.5:1 mL ratio. In order to administer fluid quite rapidly, another intravenous access site is needed-this may be another peripheral intravenous port."}, {"url": "http://www.ncbi.nlm.nih.gov/pubmed/11556167", "passage_text": "QUESTION: What is the impact of acute preoperative normovolemic hemodilution (ANH) on blood volume, intravascular colloid, and loss of red cells in the perioperative period?"}]