[{"url": "http://www.livestrong.com/article/306268-benefits-of-magnesium-potassium-aspartate/", "passage_text": "Magnesium potassium aspartate is sometimes included in supplements or fortified foods to increase the amount of magnesium and potassium they contain. Magnesium and potassium are both minerals essential for good health, and aspartate is a nonessential amino acid. Source of Potassium. Magnesium potassium aspartate is a source of potassium. Adults need about 4,700 milligrams of this mineral per day for nerve and muscle function and to help maintain proper blood pressure levels."}, {"url": "http://www.livestrong.com/article/219651-what-is-magnesium-aspartate/", "passage_text": "Natural Sources. Magnesium is found in a variety of foods including nuts, seeds, legumes, leafy greens, dairy products and fortified foods. Bran cereal is a particularly good source of magnesium, with around 93 milligrams per 1/2- cup serving. Brown rice is another option, with 86 milligrams per cup. Magnesium supplements are sold in a number of preparations. Of these, magnesium aspartate is among the most bioavailable, or readily absorbed by the body, the Office of Dietary Supplements reports. When you look at the nutrition facts label on a bottle of magnesium aspartate, note that the label reports the amount of elemental magnesium"}, {"url": "http://www.efsa.europa.eu/sites/default/files/scientific_output/files/main_documents/ans_ej883_Magnesium_Aspartate_op_en,3.pdf?ssbinary=true", "passage_text": "Magnesium aspartate, potassium aspartate, magnesium potassium aspartate,calcium aspartate, zinc aspartate, and copper aspartate as sources of magnesium,potassium, calcium, zinc and copper The EFSA Journal (2008) 883, 5-23 A SSESSMENT 1. Magnesium aspartate, potassium aspartate, magnesium potassium aspartate,calcium aspartate, zinc aspartate, and copper aspartate as sources of magnesium,potassium, calcium, zinc and copper The EFSA Journal (2008) 883, 20-23 EFSA, 2005a."}, {"url": "http://www.livestrong.com/article/219651-what-is-magnesium-aspartate/", "passage_text": "Magnesium is a mineral essential for blood pressure and blood sugar regulation, muscle and nerve function, and the construction of protein, bone and DNA. Magnesium aspartate is one of the better supplemental forms of magnesium, but it does interact with a number of drugs, including HIV medication dolutegravir. Whether or not you are on other medications, talk to your physician before taking a magnesium supplement. Magnesium supplements are sold in a number of preparations. Of these, magnesium aspartate is among the most bioavailable, or readily absorbed by the body, the Office of Dietary Supplements reports. When you look at the nutrition facts label on a bottle of magnesium aspartate, note that the label reports the amount of elemental magnesium"}, {"url": "http://getfit.jillianmichaels.com/benefits-magnesium-aspartate-1536.html", "passage_text": "Overview. Magnesium is an essential mineral that serves several functions in the body such as contraction of muscles, function of enzymes, protein production, energy production and energy transport. Magnesium aspartate is one of the most absorbable forms of magnesium. It is chelated, or attached, to aspartic acid, an amino acid present in protein rich foods. This helps the body absorb the magnesium. Magnesium aspartate is used in disease prevention, treatment and as a mineral supplement. Magnesium aspartate helps protect the heart by diminishing myocardial calcium uptake, which is responsible for cardiac hazards. Magnesium and potassium deficiencies are a risk factor for cardiac arrhythmias."}, {"url": "http://mineralsinc.com/writeup/magnesiumpotassiumaspartate_w.htm", "passage_text": "As a source for food fortification, magnesium potassium aspartate is a dual salt of magnesium and potassium organically bound to the energy rich substance-aspartate. The anion-aspartate is not only capable physiological metabolism but also bioavailable and innocuous to the body. Potassium and magnesium L-aspartate and DL-aspartate salts have been used clinically to treat fatigue in human subjects. Nutritional role of Magnesium Magnesium is a vital anti-stress mineral, which has cardioprotective properties."}, {"url": "http://www.webmd.com/drugs/2/drug-20754/magnesium-aspartate-hcl-oral/details", "passage_text": "Uses. This medication is a mineral supplement used to prevent and treat low amounts of magnesium in the blood. Magnesium is very important for the normal functioning of cells, nerves, muscles, bones, and the heart. Usually, a well-balanced diet provides normal blood levels of magnesium. However, certain situations cause your body to lose magnesium faster than you can replace it from your diet."}, {"url": "http://www.efsa.europa.eu/sites/default/files/scientific_output/files/main_documents/ans_ej883_Magnesium_Aspartate_op_en,3.pdf?ssbinary=true", "passage_text": "Magnesium aspartate, potassium aspartate, magnesium potassium aspartate,calcium aspartate, zinc aspartate, and copper aspartate as sources of magnesium,potassium, calcium, zinc and copper The EFSA Journal (2008) 883, 17-23 NOAEL for aspartate identified from a 90-day rat study. Magnesium aspartate, potassium aspartate, magnesium potassium aspartate,calcium aspartate, zinc aspartate, and copper aspartate as sources of magnesium,potassium, calcium, zinc and copper The EFSA Journal (2008) 883, 20-23 EFSA, 2005a."}, {"url": "http://www.integratedsupplements.typepad.com/integrated_supplements_bl/2010/05/whats-wrong-with-magnesium-aspartate.html", "passage_text": "For example, one of the most–popular magnesium formulas marketed towards athletes contains a magnesium amino acid chelate called magnesium aspartate. Magnesium aspartate is a mineral amino acid chelate containing magnesium bound to the amino acid known as aspartate or aspartic acid. Aspartate is known to be an excitatory neurotransmitter (i.e., a brain chemical that stimulates neurons to fire). "}]