[{"url": "http://www.w3schools.com/cssref/sel_firstletter.asp", "passage_text": "Definition and Usage. The ::first-letter selector is used to add a style to the first letter of the specified selector. Note: The following properties can be used with ::first-letter: 1  font properties. 2  color properties. 3  background properties. 4  margin properties. 5  padding properties. 6  border properties. 7  text-decoration. "}, {"url": "http://www.youtube.com/watch?v=Fn2gBXjxxzY", "passage_text": "Watch More: http://www.youtube.com/ehowtech. You can make the first letter of a document large in Microsoft Word quickly and easily by changing the size of the font. Make the first letter large in Microsoft Word with help from a professional programmer, designer, and developer in this free video clip. Expert: Geoph Essex. Filmmaker: Victor Varnado. "}, {"url": "http://www.msofficeforums.com/word/8982-adding-giant-first-letter-paragraph-help.html", "passage_text": "Adding giant first letter of paragraph---HELP! In trying to recreate the appearance of an old-style book, I want the first letter of the first paragraph of a new chapter to be three times the size of the surrounding text, with the top of the large letter even with the rest of the text of the first line. "}, {"url": "http://www.ehow.com/how_8325759_make-letter-large-microsoft-word.html", "passage_text": "Large and In Charge. Click the cursor onto the line or paragraph where you want to feature a dropped cap. Note that you do not have to highlight the section of text. Click the “Insert” tab, then click the “Add a Drop Cap” menu, which is a small button in the Text section of the ribbon, with an A and some small lines. Choose “Dropped” or “In the Margin” for the drop cap look"}, {"url": "https://support.office.com/en-us/article/Create-a-large-dropped-initial-capital-letter-5294dc91-e05d-4b30-b93f-9da393dfa7d1", "passage_text": "Create a large dropped initial capital letter. The dropped cap, a large dropped initial capital letter, can be used to begin a document or a chapter, or to add interest to a newsletter or invitation. 1. Dropped cap. 2. In-margin dropped cap. Click in the paragraph that you want to begin with a drop cap. The paragraph must contain text"}, {"url": "http://word-en.blogspot.com/2013/10/how-to-make-first-letter-large-in.html", "passage_text": "1. Type the first word, sentence or paragraph in the document or section that you want to begin with a large first letter. You can insert a dropped cap in any paragraph, but only after you have typed some text. 2. Click anywhere in the paragraph after the first letter that you want to enlarge. If you click at the beginning of the paragraph, to the left of the first letter, then the Drop Cap feature won't be available."}, {"url": "http://www.ehow.com/video_12262627_make-first-letter-large-microsoft-word.html", "passage_text": "5. Cancel. You can make the first letter of a document large in Microsoft Word quickly and easily by changing the size of the font. Make the first letter large in Microsoft Word with help from a professional programmer, designer, and developer in this free video clip. Part of the Video Series: Microsoft Word & Excel. I'm Geoph, and this is how to make the first letter large in Microsoft Word. Now you probably know what I'm talking about, that's probably why you're here. Sometimes you're reading a book and the very first letter of the very first sentence of the very first paragraph of a chapter is just really really big."}, {"url": "http://www.howtogeek.com/213689/how-to-create-a-drop-cap-in-word-2013/", "passage_text": "It’s a large capital letter at the beginning or a paragraph or text block that has the depth of two or more lines of normal text. Drop caps are easy to apply in Word. First, select the first letter in the paragraph to which you want to add a drop cap. Then, click the “Insert” tab. In the “Text” section of the “Insert” tab, click “Drop Cap” and select the type of drop cap you want to apply. "}]