[{"url": "https://quizlet.com/5295654/zygote-development-flash-cards/", "passage_text": "Fusion of the acrosomal vesicle with the plasma membrane of the sperm (in the acrosome reaction) exposes receptors that bind to the egg surface and is necessary for fertilization. now it is a fetus and its job is to grow. when development is complete the womans body will undergo a series of complex hormonal changes that result in birth.contracts of the muscles in the uterus push the fetus out which is then followed by birth."}, {"url": "http://www.biology-online.org/dictionary/Zygote", "passage_text": "To be precise, zygote is the term used to refer to the cell as a result of the fusion of two haploid nuclei during fertilization until the first cleavage. When the zygote starts to divide and multiply, it is called an embryo. Zygote. Definition. noun, plural: zygotes. A cell in diploid state following fertilization or union of haploid male sex cell (e.g. sperm) and haploid female sex cell (e.g. ovum)."}, {"url": "http://americanpregnancy.org/infertility/zygote-intrafallopian-transfer/", "passage_text": "ZIFT is an assisted reproductive procedure similar to in vitro fertilization and embryo transfer, the difference being that the fertilized embryo is transferred into the fallopian tube instead of the uterus. "}, {"url": "https://en.wikipedia.org/wiki/Zygote", "passage_text": "In human fertilization, two 1n haploid cells—an ovum (female gamete) and a sperm cell (male gamete)—combine to form a single 2n diploid cell called the zygote. In fungi, the sexual fusion of haploid cells is called karyogamy. The result of karyogamy is a diploid cell called a zygote or zygospore. This cell may then enter meiosis or mitosis depending on the life cycle of the species."}, {"url": "http://www.differencebetween.net/science/difference-between-zygote-and-embryo/", "passage_text": "Zygote vs Embryo. A zygote or a zygocyte is the original cell that comes to creation when a new organism is formed through sexual reproduction. A zygote is formed from the synthesis resulting out of the union of the two distinctive gametes. The term ‘zygote’ comes from the root Greek word ‘zygotos’ meaning yoked or ‘to yoke’ or ‘joined’ or to ‘join’. On the other hand, embryo comes from the root Latin word ‘embryum’ meaning ‘that which grows’. Zygote is the first stage in the development process of an organism."}, {"url": "http://study.com/academy/lesson/fertilization-and-zygote-formation-definition-and-processes.html", "passage_text": "Next stop: fertilization and oocyte activation. Fertilization is the fusion of two haploid gametes to produce a diploid zygote. Each haploid gamete in humans has 23 chromosomes, while the diploid zygote has 46. This fusion usually occurs within 24 hours after the oocyte has been released from the ovary. In humans, each of these gametes has 23 chromosomes-that's half the amount of DNA required for development, so these cells are called haploid cells. The fusion of these two cells is called fertilization and it produces a diploid cell with 46 chromosomes-twice the amount found in each gamete. The fertilized egg is now called a zygote and has just the right amount of DNA needed for normal human development"}, {"url": "http://www.diffen.com/difference/Gamete_vs_Zygote", "passage_text": "edit Formation and Development of Zygotes. Gamete refers to a haploid sex cell that is a sperm in males and egg (oocyte) in females. Zygote is the diploid cell that results from the fertilization between an egg and a sperm. Etymology. Came from the Greek word “gametes” meaning “husband” and “gamete” meaning “wife.”. Came from the Greek word “zygotos” meaning “joined or yoked or to yoke."}, {"url": "http://www.diffen.com/difference/Gamete_vs_Zygote", "passage_text": "Is a cell that fuses with another cell during fertilization (conception) in organisms that reproduce sexually. Females produced a large gamete called an egg cell while males produce a tadpole-like gamete called a sperm cell. Zygote is the diploid cell that results from the fertilization between an egg and a sperm. Etymology. Came from the Greek word “gametes” meaning “husband” and “gamete” meaning “wife.”. Came from the Greek word “zygotos” meaning “joined or yoked or to yoke."}, {"url": "https://en.wikipedia.org/wiki/Zygote", "passage_text": "The zygote's genome is a combination of the DNA in each gamete, and contains all of the genetic information necessary to form a new individual. In multicellular organisms, the zygote is the earliest developmental stage. In fungi, the sexual fusion of haploid cells is called karyogamy. The result of karyogamy is a diploid cell called a zygote or zygospore. This cell may then enter meiosis or mitosis depending on the life cycle of the species."}]