[{"url": "http://www.answers.com/Q/How_many_feet_go_into_a_mile", "passage_text": "five thousand, two hundred and eighty. 5 280 feet = 1 mile. 5,280 feet equal one mile. 5,280 divided by 10 is 528. Therefore, there are 528 feet in one tenth of a"}, {"url": "http://www.theultralightbackpackingsite.com/how-many-feet-are-in-a-mile.html", "passage_text": "2 feet times 97 steps times 60 minutes, meant I was hiking at about 11, 640 feet per hour. How many feet are in a mile? 5,280 - so there are 10,560 in two miles, and I was doing about 10% more than that. In other words, I was walking at about 2.2 miles per hour. - Hiking up mountain trails, you are unlikely to gain more than 1,500 feet in elevation per hour. 1,000 feet per hour is closer to the average for most people. - The temperature will normally be about 3 degrees cooler for each 1,000 feet higher that you go."}, {"url": "http://www.theultralightbackpackingsite.com/how-many-feet-are-in-a-mile.html", "passage_text": "There are 5,280 feet in a mile, by the way. Oh, and I am not going to convert all the measurements in this chapter to meters and kilometers. It is the principle that matters, not the particular scale. - Hiking up mountain trails, you are unlikely to gain more than 1,500 feet in elevation per hour. 1,000 feet per hour is closer to the average for most people. - The temperature will normally be about 3 degrees cooler for each 1,000 feet higher that you go."}, {"url": "http://www.asknumbers.com/MilesToFeetConversion.aspx", "passage_text": "1 Mile [Nautical] = 6076.12 Feet. Mile and foot (for both imperial and nautical) conversion factors are listed below. To find out how many feet in miles or vice versa, please either use these conversion factors by multplying them to get the result or simply use the converters below. 1 Mile = 5280 Feet."}, {"url": "http://www.answers.com/Q/How_many_feet_go_into_3_miles", "passage_text": "There are 5280 feet in 1 mile. There … are x feet in 3 miles. To get from 1 mile to 3 miles, you multiply the number of miles by 3 (1 mi. * 3 = 3 mi.). You do the same thing with the feet (5280 ft. * 3 = 15840 ft.). So there are 15840 ft. in 3 mi. Hope this helps"}, {"url": "http://www.answers.com/Q/How_many_feet_go_into_a_mile", "passage_text": "There are 5,280 feet in one mile. Put 5280 in the calculator. Hit the multiplication key, (X) and then put the number 43 in there. Next hit the equals key (=) and there is your answer. 5,280 feet equal one mile. 5,280 divided by 10 is 528. Therefore, there are 528 feet in one tenth of a mile"}, {"url": "http://www.convertunits.com/from/1+mile/to/feet", "passage_text": "The answer is 0.000189393939394. We assume you are converting between mile and foot. You can view more details on each measurement unit: mile or feet. The SI base unit for length is the metre. 1 metre is equal to 0.000621371192237 mile, or 3.28083989501 feet. Note that rounding errors may occur, so always check the results. Use this page to learn how to convert between miles and feet."}, {"url": "http://www.asknumbers.com/MilesToFeetConversion.aspx", "passage_text": "1 furlong is 660 feet. It was decided that one mile to have eight furlongs, that's why there are 5280 feet in a mile (8 * 660 = 5280). For other length unit conversions, please go to Length Conversion. Enter a mile value that you want to convert into feet and click on the convert button. To find out how many feet in miles or vice versa, please either use these conversion factors by multplying them to get the result or simply use the converters below. 1 Mile = 5280 Feet."}, {"url": "http://www.convertunits.com/from/feet/minute/to/mph", "passage_text": "We assume you are converting between foot/minute and mile/hour. You can view more details on each measurement unit: feet/minute or mph. The SI derived unit for speed is the meter/second. 1 meter/second is equal to 196.850393701 feet/minute, or 2.23693629205 mph. Note that rounding errors may occur, so always check the results. Use this page to learn how to convert between feet/minute and miles/hour. Type in your own numbers in the form to convert the units! "}]