[{"url": "https://en.wikipedia.org/wiki/Fleance", "passage_text": "When Macbeth returns to the witches later in the play, they show him an apparition of the murdered Banquo, along with eight kings of his family, descending through Fleance. King James, on the throne when Macbeth was written, was the ninth Stuart king. He was depicted by 16th-century historians as the son of Lord Banquo, Thane of Lochaber, and the ancestor of the kings of the House of Stuart. Fleance is best known as a character in William Shakespeare 's play Macbeth, in which the Three Witches prophesy that Banquo's descendants shall be kings. Some screen adaptations of the story expand on Fleance's role by showing his return to the kingdom after Macbeth 's death"}, {"url": "http://www.answers.com/Q/What_happens_to_Macbeth_at_the_end_of_William_Shakespeare's_play", "passage_text": "Death in an on-stage, off-stage battle is what happens to Macbeth at the end of the play Macbeth.. Therefore when Macbeth is faced by Macduff and reveals the prophecy then Macduff exposes the fact … that he was born by caesarean section. Macduff kills Macbeth at the end of the play."}, {"url": "http://www.answers.com/Q/What_happens_to_Macbeth_at_the_end_of_William_Shakespeare's_play", "passage_text": "Specifically, Macduff blames Macbeth for the massacre of his entire household and therefore forces Macbeth into a sword fight. In Act 4 Scene 1, the three witches warn Macbeth against Macduff and against death by a man not born through a normal delivery. Therefore when Macbeth is faced by Macduff and reveals the prophecy then Macduff exposes the fact … that he was born by caesarean section. Macduff kills Macbeth at the end of the play."}, {"url": "https://en.wikipedia.org/wiki/Macbeth", "passage_text": "In the backstage world of theatre, some believe that the play is cursed, and will not mention its title aloud, referring to it instead as  the Scottish play . Over the course of many centuries, the play has attracted some of the most renowned actors to the roles of Macbeth and Lady Macbeth. Macbeth has been compared to Shakespeare's Antony and Cleopatra. Both Antony and Macbeth as characters seek a new world, even at the cost of the old one. Both are fighting for a throne and have a 'nemesis' to face to achieve that throne. For Antony, the nemesis is Octavius; for Macbeth, it is Banquo."}, {"url": "https://en.wikipedia.org/wiki/Macbeth", "passage_text": "Shakespeare's source for the tragedy is the account of Macbeth, King of Scotland, Macduff, and Duncan in Holinshed's Chronicles (1587), a history of England, Scotland, and Ireland familiar to Shakespeare and his contemporaries, although the events in the play differ extensively from the history of the real Macbeth. Macbeth has been compared to Shakespeare's Antony and Cleopatra. Both Antony and Macbeth as characters seek a new world, even at the cost of the old one. Both are fighting for a throne and have a 'nemesis' to face to achieve that throne. For Antony, the nemesis is Octavius; for Macbeth, it is Banquo."}, {"url": "http://www.sparknotes.com/shakespeare/macbeth/summary.html", "passage_text": "Character List. The play begins with the brief appearance of a trio of witches and then moves to a military camp, where the Scottish King Duncan hears the news that his generals, Macbeth and Banquo, have defeated two separate invading armies—one from Ireland, led by the rebel Macdonwald, and one from Norway. Fearful of the witches’ prophecy that Banquo’s heirs will seize the throne, Macbeth hires a group of murderers to kill Banquo and his son Fleance. They ambush Banquo on his way to a royal feast, but they fail to kill Fleance, who escapes into the night."}, {"url": "http://www.enotes.com/homework-help/can-you-provide-short-summary-macbeth-589", "passage_text": "Macbeth is a play about the perils of ambition. Macbeth, encouraged by his wife, attempts to remove the obstacles preventing him from being king. These obstacles happen to be other characters in the play. He accepts the prophecy of witches as a guide for what will be, and misjudges what they tell him. The witches predict that he will one day become king. He decides that he will murder Duncan. Macbeth's wife agrees to his plan. He then murders Duncan assisted by his wife who smears the blood of Duncan on the daggers of the sleeping guards."}, {"url": "http://www.sparknotes.com/shakespeare/macbeth/section1.rhtml", "passage_text": "Macbeth and Banquo, on their way to the king’s court at Forres, come upon the witches and shrink in horror at the sight of the old women. Banquo asks whether they are mortal, noting that they don’t seem to be “inhabitants o’ th’ earth” (1.3.39). Ross tells Macbeth that the king has made him thane of Cawdor, as the former thane is to be executed for treason. Macbeth, amazed that the witches’ prophecy has come true, asks Banquo if he hopes his children will be kings. Banquo replies that devils often tell half-truths in order to “win us to our harm” (1.3.121)."}]