[{"url": "http://www.exploringnature.org/db/view/1113", "passage_text": "Praying Mantis are absolutely harmless to humans. In fact they are considered beneficial insects because they will eat garden pests. They are called preying mantis because they hold their front legs up in front of their faces and it looks like they are praying. This pose is really to wait for prey (no one knows what they are thinking)."}, {"url": "http://www.answers.com/Q/How_are_praying_mantis_harmful", "passage_text": "The praying mantis' diet are other insects, they're carnivores. The mantids eat reptiles such as frogs and lizards.They also eat mice and birds. It is an odd sight to watch an insect devouring a mammal. The praying mantis is a fierce predator. The Praying Mantis is a carnivorous insect that primarily feeds on other insects, such as Fruit flies, crickets, beetles, moths, or bees. It is not uncommon for larger Mantids to consume small reptiles, birds, and even small mammals."}, {"url": "http://www.asktheexterminator.com/garden_pests/Praying_Mantis.shtml", "passage_text": "In addition to dining on other mantises, praying mantises will eat many other insects like flies, aphids, and beetles. Large mantises have also been known to capture small frogs, mice, and hummingbirds. Mantises use camouflage to ambush their victims and to hide from other predators. The praying mantis is a green or brown insect that uses camouflage and spiked, grasping forearms to capture prey. The praying mantis may have a head shaped like a heart, but it is heartless when it comes to how the female treats her mate."}, {"url": "http://www.jcehrlich.com/blog/5-praying-mantis-facts/", "passage_text": "Praying mantises feed on insects, mice, small turtles and even snakes. Striking twice as fast as a blink of an eye, praying mantises will slowly devour the unfortunate prey slowly with its ultra sharp mandibles. Praying mantises are actually quite popular pets. Insect enthusiasts can find complete praying mantis care starter kits online and you can also purchase praying mantis nymph eggs from some garden centers."}, {"url": "http://www.answers.com/Q/How_are_praying_mantis_harmful", "passage_text": "No, praying mantis may spit a brown substance around their mouths as a defensive regurgitation like some other insects do, but this secretion is not dangerous to humans. It … is a myth that they can be harmful to or even kill humans. The Praying Mantis is a carnivorous insect that primarily feeds on other insects, such as Fruit flies, crickets, beetles, moths, or bees. It is not uncommon for larger Mantids to consume small reptiles, birds, and even small mammals."}, {"url": "http://www.answers.com/Q/Are_praying_mantises_helpful_or_harmful_to_people_and_why", "passage_text": "They are predators, and eat other insects, so in that regard they are helpful; while it is unlikely that they would get the opportunity to snack on a mosquito, they certainly would given a chance. They are more helpful than harmful, but in point of fact are really. . . neutral. "}, {"url": "http://www.exploringnature.org/db/view/1113", "passage_text": "I am curious if praying mantis species' found here in the U.S. are poisonous because where I am from (Paraguay,South America) the name that the praying mantis is given translates to mother of the snake because it's venom is more deadly than that of a snake. In fact they are considered beneficial insects because they will eat garden pests. They are called preying mantis because they hold their front legs up in front of their faces and it looks like they are praying. This pose is really to wait for prey (no one knows what they are thinking)."}, {"url": "http://gardeninsects.com/prayingMantis.asp", "passage_text": "Later they will eat larger insects, beetles, grasshoppers, crickets, and other pest insects. Praying mantises are large, solitary, slow moving, and predaceous insects that catch their prey with their front legs. They do not have jumping hind legs. "}, {"url": "http://www.asktheexterminator.com/garden_pests/Praying_Mantis.shtml", "passage_text": "Praying Mantis. Summary: One of the most fascinating insects native to North America is the praying mantis. The praying mantis is a green or brown insect that uses camouflage and spiked, grasping forearms to capture prey. The praying mantis may have a head shaped like a heart, but it is heartless when it comes to how the female treats her mate. Female praying mantises will often eat the male after they mate"}]