[{"url": "http://www.livescience.com/27489-grand-canyon.html", "passage_text": "The Grand Canyon is indeed a very big hole in the ground. It is 277 miles (446 km) long, up to 18 miles (29 km) wide and more than a mile (6,000 feet / 1,800 meters) deep. It is the result of constant erosion by the Colorado River over millions of years."}, {"url": "http://www.desertusa.com/grand-canyon/grand-canyon-climate-geography.html", "passage_text": "The Grand Canyon's South Rim has an elevation 7,000 feet above sea level. Such an elevation means snow in the winter and cool nights, even in summer. The Inner Canyon (below the rim) has a distinctly different climate, since at the bottom along the Coloardo River, elevation is almost a mile lower."}, {"url": "http://www.desertusa.com/grand-canyon/grand-canyon-climate-geography.html", "passage_text": "Grand Canyon National Park encompasses areas of the Kaibab Plateau (on the southern extreme of the Colorado Plateau) at elevations between 7,000 and 8,000 feet, and also the Colorado River gorge which runs through it at elevations as low as 2,000 feet."}, {"url": "http://www.thefreedictionary.com/canyon", "passage_text": "canyonside-the steeply sloping side of a canyon. North America-a continent (the third largest) in the western hemisphere connected to South America by the Isthmus of Panama. ravine-a deep narrow steep-sided valley (especially one formed by running water)."}, {"url": "http://www.desertusa.com/grand-canyon/grand-canyon-climate-geography.html", "passage_text": "Grand Canyon National Park is located in north-central Arizona about 80 miles northwest of Flagstaff."}, {"url": "http://www.thefreedictionary.com/canyon", "passage_text": "canyon. n. 1. (Physical Geography) a gorge or ravine, esp in North America, usually formed by the down-cutting of a river in a dry area where there is insufficient rainfall to erode the sides of the valley. [C19: from Spanish canon, cañón from cana, caña Tube from latin]. canna cane"}, {"url": "https://www.desertusa.com/bryce/du_bry_map.html", "passage_text": "Bryce Canyon National Park is about 80 miles northeast of Zion National Park but is starkly different in climate, topography, geology and scenery. Bryce sits atop the Paunsagunt Plateau of southwestern Utah between the Markagunt Plateau to the west and Aquarius Plateau to the east."}, {"url": "http://www.geography-dictionary.org/CANYON", "passage_text": "(1) A deep valley with steep to vertical walls; in karst frequently formed by a river rising on impervious rocks outside the karst area. (2) A deep, elongated cavity cut by running water in the roof or floor of a cave or forming a cave passage."}]