[{"url": "https://en.wikipedia.org/wiki/Seattle", "passage_text": "With an estimated 668,342 residents as of 2014, Seattle is the largest city in both the state of Washington and the Pacific Northwest region of North America, and, as of July 2013, is the fastest-growing major city in the United States. Sixty miles to the south of Seattle, the state capital Olympia, which is out of the Olympic Mountains' rain shadow, receives an annual average precipitation of 50 in (1,270 mm). The city of Bremerton, about 15 mi (24 km) west of downtown Seattle, receives 56.4 in (1,430 mm) of precipitation annually."}, {"url": "http://www.holiday-weather.com/seattle/averages/", "passage_text": "Seattle: Annual Weather Averages. July is the hottest month in Seattle with an average temperature of 18°C (64°F) and the coldest is January at 5°C (41°F) with the most daily sunshine hours at 10 in July. The wettest month is December with an average of 150mm of rain. The best month to swim in the sea is in July when the average sea temperature is 14°C (57°F)"}, {"url": "http://www.todayifoundout.com/index.php/2010/04/seattle-doesnt-get-that-much-rain/", "passage_text": "But the primary root of this rainy misconception really lies in that Seattle has a relatively high amount of days per year with precipitation (158), compared to such places as New York (119), Boston (127), and Nashville (119). The Olympic mountains and rain forrest, about 80 miles to the west of Seattle on the Olympic Peninsula, gets a staggering 142 inches a year of rain coming off the Pacific Ocean. This trims off most of the precipitation coming from the ocean before it gets to Seattle."}, {"url": "http://www.seattleweatherblog.com/tag/seattle-average-yearly-rainfall/", "passage_text": "Rain Stats. Filed in Posted on January 25, 2013 12:52 pm by Justin Shaw. Seattle averages 37.49 inches of precipitation a year, with the vast majority falling as rain instead of snow. Official precipitation totals for the city are measured at Sea-Tac Airport, which is actually located south of the Seattle city limits. Below are two graphs that, together, show Seattle’s yearly precipitation from 1948 to present. The third chart lists Seattle’s top ten wettest days, with the record-setting rains of Oct. 20, 2003 ranking number one. 55.14 inches of precipitation doused Seattle in 1950—the wettest year on record for the city. Just two years later, however, only a meager 23.78 inches fell—making 1952 the driest year in Seattle’s history"}, {"url": "http://www.todayifoundout.com/index.php/2010/04/seattle-doesnt-get-that-much-rain/", "passage_text": "All cities that get an average of about 16% more rain per year than Seattle, but also average between them about 36 less days a year of precipitation. So it rains a lot less in Seattle, but is spread out over about a month more of days than those cities. The Olympic mountains and rain forrest, about 80 miles to the west of Seattle on the Olympic Peninsula, gets a staggering 142 inches a year of rain coming off the Pacific Ocean. This trims off most of the precipitation coming from the ocean before it gets to Seattle."}, {"url": "http://traveltips.usatoday.com/climate-seattle-103597.html", "passage_text": "Precipitation. Rain is a fact of life in Seattle. According to the city of Seattle's website, it rains 50 percent of the time in the city. On average, Seattle gets around 37 inches of precipitation each year, with the wettest times falling between October and January. "}, {"url": "http://www.bestplaces.net/climate/city/washington/seattle", "passage_text": "Seattle, Washington, gets 36 inches of rain per year. The US average is 37. Snowfall is 11 inches. The average US city gets 25 inches of snow per year. The number of days with any measurable precipitation is 155. On average, there are 152 sunny days per year in Seattle, Washington. The July high is around 75 degrees"}, {"url": "http://www.seattleweatherblog.com/tag/seattle-average-yearly-rainfall/", "passage_text": "Seattle had never seen a daily rainfall of 4 inches or more until Oct. 20, 2003, when a torrential 5.02 inches deluged the city—setting a new record for the wettest day in Seattle history. Below are two graphs that, together, show Seattle’s yearly precipitation from 1948 to present. The third chart lists Seattle’s top ten wettest days, with the record-setting rains of Oct. 20, 2003 ranking number one. 55.14 inches of precipitation doused Seattle in 1950—the wettest year on record for the city. Just two years later, however, only a meager 23.78 inches fell—making 1952 the driest year in Seattle’s"}, {"url": "http://www.todayifoundout.com/index.php/2010/04/seattle-doesnt-get-that-much-rain/", "passage_text": "Today I found out that Seattle doesn’t really get that much rain compared to most U.S. cities. In fact, Seattle ranks 44th among major U.S. cities in average annual rainfall, getting approximately 38 inches annually. The Olympic mountains and rain forrest, about 80 miles to the west of Seattle on the Olympic Peninsula, gets a staggering 142 inches a year of rain coming off the Pacific Ocean. This trims off most of the precipitation coming from the ocean before it gets to Seattle."}]