[{"url": "http://www.zillow.com/washington-dc/home-values/", "passage_text": "The median home value in Washington is $489,800. Washington home values have gone up 5.9% over the past year and Zillow predicts they will rise 1.1% within the next year. The median rent price in Washington is $2,550, which is higher than the Washington Metro median of $2,025. Read more. Foreclosures will be a factor impacting home values in the next several years. In Washington 1.0 homes are foreclosed (per 10,000)."}, {"url": "https://www.rentjungle.com/average-rent-in-washington-rent-trends/", "passage_text": "Washington Average Rent. As of August 2015, average apartment rent within 10 miles of Washington, DC is $2026. One bedroom apartments in Washington rent for $1771 a month on average and two bedroom apartment rents average $2284. See our listings of Washington Apartments."}, {"url": "https://www.rentjungle.com/average-rent-in-washington-rent-trends/", "passage_text": "As of August 2015, average apartment rent within 10 miles of Washington, DC is $2026. One bedroom apartments in Washington rent for $1771 a month on average and two bedroom apartment rents average $2284. See our listings of Washington Apartments."}, {"url": "https://www.rentjungle.com/average-rent-in-washington-rent-trends/", "passage_text": "The average apartment rent over the prior 6 months in Washington has increased by $145 (7.7%). One bedroom units have increased by $33 (1.9%) and two bedroom apartments have increased by $12 (0.5%). See our listings of Washington Apartments."}, {"url": "http://www.rent.com/washington/1-42", "passage_text": "Spokane enjoys a lower cost of living than Seattle, making this a great city to explore houses for sale or apartments for rent. Average house price is $125,000, while the median price for apartment rentals is $530 per month."}, {"url": "http://www.bestplaces.net/cost_of_living/state/washington", "passage_text": "Our cost of living indices are based on a US average of 100. An amount below 100 means Washington, Washington is cheaper than the US average. A cost of living index above 100 means Washington, Washington is more expensive. Overall, Washington, Washington cost of living is 117.30."}]