[{"url": "http://www.vetbact.org/vetbact/?showgrowthmedia=1", "passage_text": "SELMA plates are used for identification of bacteria, which may cause mastitis, and should only be used for milk samples. SELMA means SEL ective MA stitis medium and the agar plate has three (SELMA) or four (SELMA PLUS) fields with different media. The other half (B) is covered with E. coli-agar. Most pathogens of the urinary tract grow on CLED agar and if they are lactose fermenting, the colour of CLED agar changes from green to yellow. The MacConkey agar is used to grow mainly gram negative bacteria."}, {"url": "https://en.wikipedia.org/wiki/FAA", "passage_text": "The Federal Aviation Administration (FAA) is the national aviation authority of the United States. As an agency of the United States Department of Transportation, it has authority to regulate and oversee all aspects of American civil aviation. The FAA has its headquarters in Washington, D.C. as well as the William J. Hughes Technical Center in Atlantic City, the Mike Monroney Aeronautical Center in Oklahoma City, and nine regional offices: 1  Alaskan Region – Anchorage, Alaska. 2  Northwest Mountain – Renton, Washington."}, {"url": "http://www.personal.psu.edu/staff/m/b/mbt102/bisci4online/bone/bone5.htm", "passage_text": "Growth in diameter. Making a bone grow in diameter is a more straightforward process. To make a bone thicker, just add new bone tissue to the outside. It's like taking a pipe and adding layer after layer of duct tape to it. The pipe would get thicker and heavier as you go. The problem is the bone gets thicker and heavier as you go. Growth in length. To make a bone longer just add bone tissue to the ends. The problem is, we can't add directly to the end of a bone, it has to move at the joints. If tissue is added at the end of the bone the skeleton could not move properly."}, {"url": "https://en.wikipedia.org/wiki/Epiphyseal_plate", "passage_text": "The epiphyseal plate (or epiphysial plate, physis, or growth plate) is a hyaline cartilage plate in the metaphysis at each end of a long bone. The plate is found in children and adolescents; in adults, who have stopped growing, the plate is replaced by an epiphyseal line."}, {"url": "http://www.niams.nih.gov/health_info/Growth_Plate_Injuries/growth_plate_injuries_ff.asp", "passage_text": "Fast Facts: An Easy-to-Read Series of Publications for the Public. Growth plates are located on the long bones of children and young people. These plates are areas of growing tissue near the end of the bones. Each long bone has at least two growth plates-one at each end. This is where the long bones grow. When young people finish growing, the growth plates close and are replaced by solid bone. Growth plate injuries occur mainly at the wrist, bones of the legs, or in the ankle, foot, or hip bones. The growth plate is the weakest part of the growing skeleton. Injuries to the plates are called fractures. Growth plate fractures happen twice as often in boys as in girls."}, {"url": "http://www.vetbact.org/vetbact/?showgrowthmedia=1", "passage_text": "Xylose lysine deoxycholate agar (XLD agar) is a selective growth medium, which is used for isolation of Salmonella spp. and Shigella spp. from clinical samples and from food. The pH of XLD agar is 7.4 and it contains the pH indicator methyl red, which gives a red or pink colour. The other half (B) is covered with E. coli-agar. Most pathogens of the urinary tract grow on CLED agar and if they are lactose fermenting, the colour of CLED agar changes from green to yellow. The MacConkey agar is used to grow mainly gram negative bacteria."}, {"url": "http://www.brewersfriend.com/2009/10/25/stir-plates-and-growing-brewing-yeast-quickly/", "passage_text": "1 DO NOT use an airlock on a stir plate starter as it will impede the ability of the stir plate to exchange CO2 from the fermentation for O2, which will help grow yeast. 2  DO use foil to cover the top of the flask instead of an airlock. 3  Ferment the starter at 75F – 80F. Creating a simple yeast starter as outlined here at brewersfriend.com will greatly increase your yeast cell count, but there is a way to easily supercharge this process. By using a stir plate you will be able to grow nearly 100% more yeast cells using the same volume of starter in the same amount of time. Basically, for the same investment in yeast, time and starter liquid, you will be able to double your yeast production with a stir plate. A stir plate is a simple machine consisting of a base which houses a motor with variable speed control"}, {"url": "http://www.vetbact.org/vetbact/?showgrowthmedia=1", "passage_text": "Slanetz and Bartley agar (SlaBa agar) is a selective medium, which is used for surface streaking and enumeration of Enterococcus spp. in drinking water, beverages and other biological products of animal origin. The other half (B) is covered with E. coli-agar. Most pathogens of the urinary tract grow on CLED agar and if they are lactose fermenting, the colour of CLED agar changes from green to yellow. The MacConkey agar is used to grow mainly gram negative bacteria."}, {"url": "http://spot.pcc.edu/~jvolpe/b/bi234/lab/differentialMedia/bloodAgarPlates.htm", "passage_text": "Blood Agar Plates (BAP) (Atlas p. 49). Blood agar is actually a couple of related media, all of which are rich formulations containing peptones, yeast extracts, liver or heart extracts (depending on the medium), and blood. The blood is usually sheep's red blood cells (RBC), though horses and other species may be used. 1 Inoculate one third with the unknown, one third with a negative control (such as E. coli), and one third with a positve control (such as Bacillus cereus). 2  It is best to streak your bacteria in a long W pattern using your inoculating needle with plenty of space between the streak lines."}]