[{"url": "http://www.urbandictionary.com/define.php?term=Bollocks", "passage_text": "5. bollocks. 1.A word that we can say in America to confuse everyone. 2. Balls, nuts, testicles. 3. Expression of dismay or a substandard quality, unless belonging to a dog, in which case it means that the situation is highly satisfactory."}, {"url": "http://onlineslangdictionary.com/meaning-definition-of/dog's-bollocks,-the", "passage_text": "Link to this slang definition. To link to this term in a web page or blog, insert the following. To link to this term in a wiki such as Wikipedia, insert the following. Some wikis use a different format for links, so be sure to check the documentation."}, {"url": "http://www.urbandictionary.com/define.php?term=Bollocks", "passage_text": "Bollocks. A highly flexible term commonly used by the English. 1. something rubbish. 2. a falsehood or series of lies. 3. something great. 4. the best possible. 5. testicles. 6. exclamation on making a error. 1."}, {"url": "https://en.wikipedia.org/wiki/Bollocks", "passage_text": "Bollocks  /ˈbɒləks/ is a word of Middle English origin, meaning  testicles . The word is often used figuratively in British English and Hiberno-English as a noun to mean nonsense, an expletive following a minor accident or misfortune, or an adjective to mean poor quality or useless."}, {"url": "http://www.urbandictionary.com/define.php?term=bullocks", "passage_text": "A derogatory term used to call gays that perform anal sex in a hard fashion. The term comes from the word Bull as in ramming their horn. I don't like to mess with him because he is such a Bullock in bed."}, {"url": "https://en.wiktionary.org/wiki/bollocks", "passage_text": "Noun [edit]. bollocks ‎(uncountable) (rarely used in the singular). ( 1 Britain, vulgar) The testicles (sometimes used in the singular). ( 2 Britain, vulgar) Nonsense or information deliberately intended to mislead."}, {"url": "http://onlineslangdictionary.com/meaning-definition-of/bollocks", "passage_text": "To link to this term in a web page or blog, insert the following. To link to this term in a wiki such as Wikipedia, insert the following. Some wikis use a different format for links, so be sure to check the documentation."}]