[{"url": "http://www.sightline.org/2014/11/17/all-the-worlds-carbon-pricing-systems-in-one-animated-map/", "passage_text": "The US Environmental Protection Agency (EPA) estimates that the social cost of carbon is around $39 per ton, and you can argue the number higher or lower. For now, though, a price starting around $30 per ton would put Oregon or Washington in line with other programs and close to the economist-approved price."}, {"url": "http://www.forbes.com/2009/06/03/cap-and-trade-intelligent-investing-carbon.html", "passage_text": "Looking into the future, the not-for-profit Investor Responsibility Research Center prices carbon at $28.24 per ton in the year 2012, and as such they say annual carbon costs would total $92.8 billion."}, {"url": "http://www.forbes.com/2009/06/03/cap-and-trade-intelligent-investing-carbon.html", "passage_text": "With an average price of $20 per ton of carbon dioxide–which is consistent with European Union prices over the past two years–the S&P 500 companies, should they start paying full value for their carbon emissions, will have to write a collective check for $60 billion to $80 billion each year."}, {"url": "http://ethioembassy.org.uk/trade_and_investment/Investment%20Profiles%20EIA/Chemicals%20and%20Pharmaceuticals/Carbon%20Black.pdf", "passage_text": "From the total investment cost, Birr 4.43 million or 16.69% is required in foreign currency. The project is financially viable with an internal rate of return (IRR) of 25.50% and a net present value (NPV) of Birr 20.04 million, discounted at 10%. The project can create employment opportunities for 82 persons."}, {"url": "http://www.kaycircle.com/What-is-the-Average-Cost-of-Carbon-Black-per-pound-Average-Carbon-Black-Price", "passage_text": "The main use of carbon black is in the industry of automobile tires, as a pigment. In Europe, carbon black of vegetable origin is used as a food coloring. The current production of carbon black is 18 billion pounds per year, from which 90% it is used in rubber applications. The average price of carbon black is $700/ton."}, {"url": "http://pyrolyx.com/en/pyrolyx-technology/profitability/", "passage_text": "A Pyrolyx plant with two or three reactor sections produces approx. 10,000 tons of Pyrolyx carbon black per annum in a three-shift operation, with a capacity utilization of 90% and a granule input of 65 to 70 tons per day."}]