[{"url": "https://en.wikipedia.org/wiki/Gunpowder_tea", "passage_text": "Gunpowder tea (珠 茶; pinyin: zhū cha) chá is a form of Green chinese tea produced In Zhejiang province Of china in which each leaf has been rolled into a small round. Pellet it is believed to take Its english name from the fact that the tea resembles grains of black. powder Gunpowder tea (珠 茶; pinyin: zhū cha) chá is a form of Green chinese tea produced In Zhejiang province Of china in which each leaf has been rolled into a small round. pellet"}, {"url": "http://www.rishi-tea.com/category/matcha-tea-powder", "passage_text": "The Story of Matcha. Matcha is a traditional Japanese green tea powder produced by stone-milling a shade-grown green tea called tencha into a fine powder. The quality of matcha greatly depends on the tea bush cultivar, shading technique and picking standard used to produce tencha. "}, {"url": "http://www.eater.com/drinks/2015/2/11/8006039/everything-you-need-to-know-about-matcha", "passage_text": "The entire tea leaf is consumed in contrast to regular tea, which is a brewed beverage of processed tea leaves steeped in hot water. Matcha is also tea. But instead of a brew, it is a suspension. The matcha powder is whisked and suspended in the water. Let that bowl of matcha sit for too long and it will separate unlike a brewed/steeped beverage. Equipment is an essential part of the experience and key to making great matcha. Start with a chawan, the tea bowl which is used to make and drink the matcha. Also necessary is chashaku, a traditional bamboo tea spoon used to scoop the matcha into the chawan. Also important, the chasen, and a tea sifter to break up all the clumps, which develop because of static in the matcha powder. Start by using the chashaku. Sift a teaspoon of matcha powder into a chawan. Gently pour in three ounces of 175°F water."}, {"url": "http://matchasource.com/about-matcha/", "passage_text": "A Way of Tea Unique to Japan. Matcha is premium green tea powder from Japan used for drinking as tea or as an ingredient in recipes. While other green teas are grown throughout the world, matcha is unique to Japan. "}, {"url": "http://www.eater.com/drinks/2015/2/11/8006039/everything-you-need-to-know-about-matcha", "passage_text": "Regular steeped green tea is considered healthy because the leaves contain antioxidants, but water can only extract a small about of the leaves' nutritional properties. In the case of matcha, one consumes the entire leaf, making it exponentially more healthful. Also important, the chasen, and a tea sifter to break up all the clumps, which develop because of static in the matcha powder. Start by using the chashaku. Sift a teaspoon of matcha powder into a chawan. Gently pour in three ounces of 175°F water."}, {"url": "http://www.ebay.com/gds/Green-Tea-Powder-/10000000000927850/g.html", "passage_text": "Many of our customers ask, what is the difference between green tea powder and Matcha.. Hence, the reason for this guide. Matcha is Superior. There is no comparison of Matcha green tea powder to any other green tea in the world because of its unique cultivation and processing. Matcha Processing-The young tea leaves are picked in early May and lightly steamed to prevent any fermentation."}, {"url": "https://en.wikipedia.org/wiki/Matcha", "passage_text": "In modern times, matcha has also come to be used to flavour and dye foods such as mochi and soba noodles, green tea ice cream and a variety of wagashi (Japanese confectionery). The former is often referred to as ceremonial-grade matcha, meaning that the matcha powder is good enough for tea ceremony. The Japanese snack Pocky has a matcha-flavoured version. Matcha may also be mixed into other forms of tea. For example, it is added to genmaicha to form what is called matcha-iri genmaicha (literally, roasted brown rice and green tea with added matcha)."}, {"url": "http://www.myjapanesegreentea.com/matcha", "passage_text": "Matcha is a high quality green tea that is finely milled into a powder. Besides being enjoyed as any other green tea, it is the tea used for the Japanese tea ceremony. Another common use of matcha is as an ingredient in food for green tea color and flavor. "}, {"url": "http://www.bodybuilding.com/fun/8-wonders-of-matcha-green-tea.html", "passage_text": "Matcha green tea is available as a concentrated powder and can be found at health food stores. I recommend organic matcha, because it is produced without any artificial fertilizers, herbicides or pesticides. Do not add matcha green tea powder to boiling water because it will taste grassy.. Japanese tea leaves grow in the shade to increase chlorophyll content. These chlorophyll-rich leaves are then handpicked, steamed, dried and ground into a fine green powder. The history and cultivation of the tea is interesting, but what matters most to health enthusiasts is its antioxidant content."}]