[{"url": "http://www.hibiclens.com/retail/s/faqs", "passage_text": "HIBICLENS ® is a pharmaceutical antiseptic skin cleanser. It is safe for a child to use, though parents should practice discretion and always supervise use. Keep out of the reach of children, as the product can cause damage to the eyes and ears if used improperly."}, {"url": "http://www.ehow.com/about_5071135_hibiclens-soap.html", "passage_text": "Function. Hibiclens Soap is used by health care professionals, and as a topical treatment of skin infections including Pseudomonas aeruginosa, Staphylococcus aureus, Methicillin Resistant Staphylococcus Aureus."}, {"url": "http://www.hibiclens.com/retail/s/faqs", "passage_text": "Generally speaking, use HIBICLENS ® as you would use other liquid soaps with a few minor changes. For general skin cleansing: thoroughly rinse the area to be cleansed with water. Apply the minimum amount of HIBICLENS ® necessary to cover the skin or wound area and wash gently. Rinse thoroughly. Be sure to keep out of eyes, ears, and mouth, and do not use in the genital area."}, {"url": "http://www.ehow.com/about_5071135_hibiclens-soap.html", "passage_text": "As a topical antiseptic antimicrobial soap, Hibiclens has been shown in tests to effectively kill bacteria on contact, including gram-positive and gram-negative bacteria. For this reason, it is prescribed for patients who test positive for a variety of skin infections."}, {"url": "http://www.hartfordmedicalgroup.com/ed_instr_hibidens.php", "passage_text": "The soap may come in a liquid form or in a scrub brush applicator. Either form is acceptable to use. Not to be used by people allergic to chlorhexidine. Shower or bathe with CHG the night before your surgery and the morning of your surgery."}, {"url": "http://www.hartfordmedicalgroup.com/ed_instr_hibidens.php", "passage_text": "Following these instructions will help you be sure that your skin is clean before surgery. IMPORTANT: You will need to shower with a special soap called chlorhexidine gluconate (CHG)*. A common brand name for this soap is Hibiclens, but any brand is acceptable to use."}, {"url": "http://www.ehow.com/about_5071135_hibiclens-soap.html", "passage_text": "Shares & Saves. Save. Hibiclens Soap is a proprietary topical antiseptic antimicrobial used in the health care industry and prescribed to patients with a variety of skin infections, or as a pre-operative soap. Hibiclens is also sold over-the-counter and is used to treat acne."}, {"url": "http://www.ehow.com/about_5071135_hibiclens-soap.html", "passage_text": "Hibiclens Soap is a proprietary topical antiseptic antimicrobial used in the health care industry and prescribed to patients with a variety of skin infections, or as a pre-operative soap."}]