[{"url": "http://ghr.nlm.nih.gov/gene/HBB", "passage_text": "Sickle cell anemia, a common form of sickle cell disease, is caused by a particular mutation in the HBB gene. This mutation results in the production of an abnormal version of beta-globin called hemoglobin S or HbS. In this condition, hemoglobin S replaces both beta-globin subunits in hemoglobin. In adults, hemoglobin normally consists of four protein subunits: two subunits of beta-globin and two subunits of another protein called alpha-globin, which is produced from another gene called HBA."}, {"url": "http://medical-dictionary.thefreedictionary.com/hemoglobin", "passage_text": "Each erythrocyte contains 200 to 300 molecules of hemoglobin, each molecule of hemoglobin contains four groups of heme, and each group of heme can carry one molecule of oxygen. A hemoglobin molecule contains four globin polypeptide chains composed of amino acids. Each polypeptide chain is composed of 141 to 146 amino acids. The absence, replacement, or addition of only one amino acid modifies the properties of the hemoglobin. The iron is transported to the bone marrow to be incorporated in the hemoglobin of newly formed erythrocytes. The hemoglobin concentration of blood varies with the hematocrit. The normal values for the blood hemoglobin concentration are 13.5 to 18.0 g/100 ml in males and 12.0 to 16.0 g/100 ml in females."}, {"url": "https://en.wikipedia.org/wiki/HBB", "passage_text": "It is 146 amino acids long and has a molecular weight of 15,867 Da. Normal adult human HbA is a heterotetramer consisting of two alpha chains and two beta chains. HBB is encoded by the HBB gene on human chromosome 11. For other uses, see HBB (disambiguation) . Beta globin (also referred to as HBB, β-globin, haemoglobin beta, hemoglobin beta, or preferably haemoglobin subunit beta) is a globin protein, which along with alpha globin (HBA), makes up the most common form of haemoglobin in adult humans, the HbA."}, {"url": "http://medical-dictionary.thefreedictionary.com/Hemoglobinopathies", "passage_text": "Hemoglobinopathies are genetic (inherited) disorders of hemoglobin, the oxygen-carrying protein of the red blood cells. The hemoglobin molecule is composed of four separate polypeptide chains of amino acids, two alpha chains and two beta chains, as well as four iron-bearing heme groups that bind oxygen. The sickle cell mutation results in the substitution of the amino acid valine for glutamic acid in the sixth position of the beta polypeptide. In turn, this alters the conformation of the hemoglobin molecule and causes the red blood cells to assume a characteristic sickle shape under certain conditions."}, {"url": "http://medical-dictionary.thefreedictionary.com/hemoglobin", "passage_text": "Thus, each hemoglobin molecule can bind one molecule of oxygen. The binding of oxygen by one monomer increases the affinity for oxygen of the others in the tetramer. This makes hemoglobin a more efficient transport protein than a monomeric protein such as myoglobin. The iron is transported to the bone marrow to be incorporated in the hemoglobin of newly formed erythrocytes. The hemoglobin concentration of blood varies with the hematocrit. The normal values for the blood hemoglobin concentration are 13.5 to 18.0 g/100 ml in males and 12.0 to 16.0 g/100 ml in females."}, {"url": "http://medical-dictionary.thefreedictionary.com/Hemoglobinopathies", "passage_text": "Description. The hemoglobin molecule is composed of four separate polypeptide chains of amino acids, two alpha chains and two beta chains, as well as four iron-bearing heme groups that bind oxygen. The sickle cell mutation results in the substitution of the amino acid valine for glutamic acid in the sixth position of the beta polypeptide. In turn, this alters the conformation of the hemoglobin molecule and causes the red blood cells to assume a characteristic sickle shape under certain conditions."}, {"url": "http://ghr.nlm.nih.gov/gene/HBB", "passage_text": "The HBB gene provides instructions for making a protein called beta-globin. Beta-globin is a component (subunit) of a larger protein called hemoglobin, which is located inside red blood cells. In adults, hemoglobin normally consists of four protein subunits: two subunits of beta-globin and two subunits of another protein called alpha-globin, which is produced from another gene called HBA."}, {"url": "https://gerdapeacheysviews.wordpress.com/sickle-cell-anemia/", "passage_text": "This mutation in the beta-hemoglobin gene results in the change of just a single amino acid within the polypeptide encoded by that gene. The sixth amino acid in beta-hemoglobin is normally glutamate, which has an acidic, very polar, “hydrophilic” (water-attracting) side chain. Each red blood cell contains millions of molecules of hemoglobin, the protein that does the work of oxygen transport. The hemoglobin molecule is composed of four polypeptides (chains of amino acids): two alpha (α) chains, each with 141 amino acids, and two beta (β) chains, each with 146 amino acids."}]