[{"url": "http://www.seattlecca.org/pulmonary-nodules.cfm", "passage_text": "In general, a “pulmonary nodule” is a small, roundish growth on the lung that measures three centimeters in diameter or less. If the growth is larger than that, it is called a “pulmonary mass.” While pulmonary nodules may grow to become a pulmonary mass, some nodules may not grow at all. "}, {"url": "http://www.wisegeekhealth.com/what-is-a-lung-nodule.htm", "passage_text": "A lung nodule is a mass of tissue located in the lungs. Though about 40% of these growths are benign, they can be cancerous, especially in older people and smokers. Many people with this condition don't have any symptoms, though some do have wheezing, shortness of breath, or a persistent cough. Medical professionals can examine chest X-rays for indications of lung nodules. Smokers are at a serious risk of developing lung nodules. A lung nodule is a mass of tissue located in the lungs. Cancerous lung nodules may be removed through a surgical procedure. Most lung nodules aren't found unless a person has a chest x-ray. View slideshow of images above"}, {"url": "http://my.clevelandclinic.org/health/diseases_conditions/hic_Pulmonary_Nodules", "passage_text": "A pulmonary nodule is a small round or oval-shaped growth in the lung. It is sometimes also called a spot on the lung or a coin lesion. Pulmonary nodules are generally smaller than 3 centimeters in diameter. If the growth is larger than that, it is known as a pulmonary mass. A mass is more likely to represent a cancer than is a nodule. Many are the result of inflammation in the lung as a result of an infection or disease producing inflammation in the body. The nodule may represent an active process or be the result of scar tissue formation related to prior inflammation. Benign developmental lesions may also appear as nodules."}, {"url": "http://answers.webmd.com/answers/2018669/what-causes-lung-nodules", "passage_text": "A. A lung nodule is a small, solid abnormality in the lung. Nodules are most commonly detected on a chest X-ray or CT scan. There are many causes of nodules. Depending on the cause, a nodule may have no importance or it may represent a serious disease. Some of the most common causes of lung nodules include: 1  Scar tissue. A lung nodule is a small, solid abnormality in the lung. Nodules are most commonly detected on a chest X-ray or CT scan. There are many causes of nodules. Depending on the cause, a nodule may have no importance or it may represent a serious disease. Some of the most common causes of lung nodules include:"}, {"url": "http://www.clevelandclinicmeded.com/medicalpubs/diseasemanagement/hematology-oncology/pulmonary-nodules/", "passage_text": "Pulmonary nodules are small, focal, radiographic opacities that may be solitary or multiple. A classic solitary pulmonary nodule (SPN) is a single, spherical, well-circumscribed, radiographic opacity measuring less than or equal to 30 mm in diameter and is surrounded completely by aerated lung. "}, {"url": "http://www.wehealny.org/services/BI_LungNoduleCenter/lung_nodules_cause.html", "passage_text": "Simply, a benign lung nodule is not cancerous. A benign nodule or mass will not spread to other areas of the body. However, the presence of benign nodules—especially if they are large—can cause health problems. Even benign lung nodules may have to be surgically treated and removed. "}, {"url": "http://my.clevelandclinic.org/health/diseases_conditions/hic_Pulmonary_Nodules", "passage_text": "Though most lung nodules are not malignant, it is very important the those representing cancer are identified early in their course, when they are curable. Chest X-rays and CT Scans —Usually, the first sign that a pulmonary nodule is present is a spot on the lung that shows up on a chest X-ray or a CT scan. Many are the result of inflammation in the lung as a result of an infection or disease producing inflammation in the body. The nodule may represent an active process or be the result of scar tissue formation related to prior inflammation. Benign developmental lesions may also appear as nodules."}, {"url": "http://www.mayoclinic.org/diseases-conditions/lung-cancer/expert-answers/lung-nodules/FAQ-20058445", "passage_text": "Yes, lung nodules can be cancerous, though most lung nodules are noncancerous (benign). Lung nodules — small masses of tissue in the lung — are quite common. They appear as round, white shadows on a chest X-ray or computerized tomography (CT) scan. Lung nodules are usually about 0.2 inch (5 millimeters) to 1.2 inches (30 millimeters) in size. "}]