[{"url": "http://www.spinlife.com/category.cfm?categoryID=108", "passage_text": "Recommended Lift: Invacare Manual or Power Lift All of the Invacare Lifts are built with wheels large enough to maneuver easily on thick carpeting. Recommended Lift: Advance Power Lift Substantial enough to transfer a 340-pound patient yet nimble enough to fold for storage or disassemble quickly for transport. These patient lifts are designed to bear a safe working load of a minimum of 400lb, with some models capable of lifting up to 700lb. These heavy duty/high weight patient lifts feature all the same benefits and options as the power patient lifts, just with the added weight support."}, {"url": "http://ablemagazine.co.uk/buyingguide/lifts-hoists/", "passage_text": "Residential hoists and ceiling lifts help many people — for instance, seniors who want to remain in their own homes despite changes in their mobility, strength or agility; and parents of children with a disability who can no longer lift their children. If a wheeled hoist is to be used for transfers in and out of a bathtub, the bathtub should have legs or be raised from the floor the hoist frame will fit under the bathtub. Stationary Hoist. Stationary hoists are mounted to the floor or a wall."}, {"url": "http://www.autochair.com/handicap-accessible-vans-cars/milford-person-lift", "passage_text": "The person lift with first class safety, but not the cost. The Milford Person Lift is an ideal wheelchair to car transfer solution for someone with a disability or reduced mobility. It offers simple transfer from wheelchair to car at a great saving when compared to a complete wheelchair van. If the Milford Person Lift seems like the smart choice to you, one of our friendly Demo Dealers can provide you with a free comprehensive demonstration and advise you on the suitability of a transfer solution."}, {"url": "http://www.cdc.gov/niosh/docs/2006-117/pdfs/2006-117.pdf", "passage_text": "As a general rule, one full-body lift should be provided for approximately every eight to ten non-weight bearing residents and one stand-up lift should be provided for approximately every eight to ten partially-weight bearing residents. The average cost of a mechanical lift can vary from $3,000 to $6,000 per lift. The average cost for a ceiling-mounted lift is approximately $4,000 per room. An effective combination of both floor and ceiling lifts is generally accom­plished with a $50,000 to $60,000 investment per 100 bed facility. A 100-bed facility can expect to spend $25,000 to $30,000 on portable (not ceiling-mounted) mechanical lifts depending on how many residents in your facility require the use of a lift."}, {"url": "http://www.parentgiving.com/shop/patient-lifts-321/c/", "passage_text": "However, using a patient lift is a safety measure that improves both caregiver and patient safety by preventing patient falls and protecting the caregiver from strain injuries due to heavy lifting. A patient lift also reduces the number of people needed to make a bed to chair transfer. Use of this mobility device becomes even more important when the patient weighs 300 pounds or more, and a bariatric lift will be needed to properly support the patient’s weight. When a person being cared for loses their mobility and can no longer get out of bed, up from a chair or to the commode, these patient lifts make transfers from one spot to another much easier and more comfortable for both caregiver and the person for whom they care."}, {"url": "http://ablemagazine.co.uk/buyingguide/lifts-hoists/", "passage_text": "Other considerations include the arc of the hoist swing (ensure it reaches the necessary elements) and making sure that clear space is available for the wheelchair during the transfer to and from the hoist. Ceiling lift. A ceiling lift is a hoist that is mounted on a ceiling. If a wheeled hoist is to be used for transfers in and out of a bathtub, the bathtub should have legs or be raised from the floor the hoist frame will fit under the bathtub. Stationary Hoist. Stationary hoists are mounted to the floor or a wall."}, {"url": "http://www.accessunlimited.com/html/multi-lift-car.html", "passage_text": "If you re like a lot of people with reduced mobility, you were sorry to see your beloved and cost-effective car go when you couldn t make the transfer any more. But with the Multi-Lift, cars are back! Using the portable Multi-Lift and a mounting bracket in your car, you can get in and out again. "}, {"url": "http://www.autochair.com/handicap-accessible-vans-cars/milford-person-lift", "passage_text": "Not only is the Milford Person Lift a cost effect wheelchair transfer solution, it’s also incredibly safe. This safety is due to the Milford Person Lift's ability to transfer a person into a regular auto seat, rather than into the back of an adapted van. If the Milford Person Lift seems like the smart choice to you, one of our friendly Demo Dealers can provide you with a free comprehensive demonstration and advise you on the suitability of a transfer solution."}, {"url": "http://www.1800wheelchair.com/category/patient-lifts-slings/", "passage_text": "Lifts are mechanisms used to hoist the disabled patient that needs to be moved, while slings hook up to the lift’s arm and cradle the patient during transfer. We carry manual, power, stand up, overhead, bath, and pool lifts, along with a variety of patient slings. Patient Lifts. A Patient lift and sling is an assistive device that will help a caregiver transfer a patient, with limited mobility, from the bed to a chair and back. Patient lifts are operated either by hydraulic-manual pumping or are electric motor."}]