[{"url": "https://en.wikipedia.org/wiki/Flag_of_Australia", "passage_text": "The flag's original design (with a six-pointed Commonwealth Star) was chosen in 1901 from entries in a competition held following Federation, and was first flown in Melbourne on 3 September 1901, the date proclaimed as Australian National Flag Day. The Union Flag is thought to symbolise Australia's history as six British colonies and the principles upon which the Australian Federation is based, although a more historic view sees its inclusion in the design as demonstrating loyalty to the British Empire."}, {"url": "http://www.anbg.gov.au/oz/flag.html", "passage_text": "1 The Australian Red Ensign-Merchant Navy, as for the Australian flag, but with a red field with white stars. 2  Proclaimed in the Flags Act 1953. 3  Covers Australian registered ships under section 30 of the Shipping Registration Act 1981. The Commonwealth Blue Ensign was selected a a result of a public competition (over 30 000 designs were submitted); although selected in 1901 and gazetted in 1903, it was not given Royal assent and adopted as the definitive Australian flag until 1954 in the Flags Act 1953 (Act No. 1 of 1954)!"}, {"url": "https://en.wikipedia.org/wiki/Flag_of_Australia", "passage_text": "The flag of Australia is a defaced Blue Ensign: a blue field with the Union Jack in the canton (upper hoist quarter), and a large white seven-pointed star known as the Commonwealth Star in the lower hoist quarter. The Union Flag is thought to symbolise Australia's history as six British colonies and the principles upon which the Australian Federation is based, although a more historic view sees its inclusion in the design as demonstrating loyalty to the British Empire."}, {"url": "http://www.anbg.gov.au/oz/flag.html", "passage_text": "The Australian Flag came into being after the the federation of the Australian States into the Commonwealth of Australian on 1 January, 1901. The Commonwealth Blue Ensign was selected a a result of a public competition (over 30 000 designs were submitted); although selected in 1901 and gazetted in 1903, it was not given Royal assent and adopted as the definitive Australian flag until 1954 in the Flags Act 1953 (Act No. 1 of 1954)!"}, {"url": "http://www.gostudy.com.au/blog/the-australian-flag/", "passage_text": "Most countries use the colours in their flag as their national colours, but not Australia. Australia’s national colours – as used in sport and elsewhere – are the vibrant green and gold, not the red, white and blue of the flag. This is almost certainly a move away from the colours that are found in the British flag. "}, {"url": "http://www.itsanhonour.gov.au/publications/symbols/factsheets/australian_national_flag.pdf", "passage_text": "Australian National Flag The Australian National Flag is Australia’s foremost national symbol. The flag was first flown in 1901 and has become an expression of Australian identity and pride. The flag is an important part of national occasions such as stralia Day, Anzac Day, Au and Australian National Flag Day. "}, {"url": "http://www.mapsofworld.com/flags/australia.html", "passage_text": "The national flag of Australia has a blue background with the British Union Jack in the upper left corner of the flag. There is a big seven-point star (Commonwealth Star) in white just beneath the Union Jack and five stars (four big and one small) stars on the right quadrant of the flag. "}, {"url": "http://www.anbg.gov.au/oz/flag.html", "passage_text": "The present Australian flag can be considered to consist of three main elements: 1  The Union Jack in the upper hoist quadrant or first quarter (also know as the Canton), denoting Australia's historical links with Great Britain. The Commonwealth Blue Ensign was selected a a result of a public competition (over 30 000 designs were submitted); although selected in 1901 and gazetted in 1903, it was not given Royal assent and adopted as the definitive Australian flag until 1954 in the Flags Act 1953 (Act No. 1 of 1954)!"}, {"url": "http://australianflag.facts.co/australiaflagof/australianflag.php", "passage_text": "Australia National Flag-Information. The national flag of Australia is a blue field with the Union Jack in the upper hoist-side quadrant, and a large white seven-pointed star known as the Commonwealth Star or Federation Star in the lower hoist-side quadrant. The seven-pointed “Commonwealth Star” on Australian flag represents the six Australian states and the Northern Territory. Australian Red Ensign (Australian flag with red background, instead of the blue background) is generally restricted to privately owned vessels."}, {"url": "http://www.differencebetween.com/difference-between-australia-flag-and-new-zealand-flag/", "passage_text": "A Defaced Blue Ensign, the Australian flag features the Union Jack in the canton with what is referred to as a Commonwealth Star embedded in the lower hoist quarter of the flag and the Southern Cross constellation on the other side of the flag. • While the Australian flag features the Commonwealth Star, the New Zealand flag does not have it. This is because the Commonwealth star is a symbol of Australia. • The Australian’s flag’s Southern Cross has four seven pointed stars and one with five; the New Zealand flag has only four five pointed stars."}]