[{"url": "http://www.primehealthchannel.com/coughing-up-phlegm-clear-green-yellow-and-with-blood.html", "passage_text": "Go through these suggestions and know how to get rid of phlegm at home 1  : Boil water in a bowl. 2  Drinking hot beverages like tea can work great. 3  Apply warmth to your chest. 4  Eating spicy foods can also help your mucus thin out naturally. 5  Gargling with salt water and spit it out. 6  Taking a hot bath will also prove useful."}, {"url": "http://www.ehow.com/how_5618387_cough-up-mucus.html", "passage_text": "It will thin the mucus in your sinuses, throat and chest. This will allow you to cough up more mucus. Inhale steam treatments of eucalyptus, mint or menthol. Boil water with a few drops of extract (or even a cough drop)."}, {"url": "http://www.home-remedies-for-you.com/askquestion/11862/phlegm-in-throat-home-remedy-how-to-get-rid-of-phl.html", "passage_text": "1 If you have phlegm in throat in the morning, one of the simplest of phlegm in the throat remedies would be to consume warm water with lemon juice and honey. 2  This loosens up the phlegm so that you can easily cough it out."}, {"url": "http://www.thoracic.org/copd-guidelines/for-patients/what-are-the-signs-and-symptoms-of-copd.php", "passage_text": "Cough can be expected with COPD. Cough is a natural reaction of the airways to try and remove mucus or it can be a reaction to protect the airways from inhaled irritants. Coughing is therefore a good thing when it results in moving sputum or phlegm out of the breathing passages."}, {"url": "http://www.home-remedies-for-you.com/askquestion/11862/phlegm-in-throat-home-remedy-how-to-get-rid-of-phl.html", "passage_text": "1 If you have been coughing to expel the phlegm in the throat naturally, your throat may also be very sore. 2  This herbal remedy is not only your answer to how to get phlegm out of the throat but also one of the more effective sore throat remedies."}, {"url": "http://www.primehealthchannel.com/coughing-up-phlegm-clear-green-yellow-and-with-blood.html", "passage_text": "When the mucus gets thick, it is very painful to cough it out. Thinned mucus is easier to expel. There are some home remedies that you can try to thin out the phlegm. Go through these suggestions and know how to get rid of phlegm at home 1  : Boil water in a bowl. 2  Add in eucalyptus, menthol or mint. 3  Inhale the steam deeply into your nostrils."}, {"url": "http://www.wikihow.com/Get-Rid-of-Phlegm-in-Your-Throat-Without-Medicine", "passage_text": "1. Take a hot shower or inhale steam. The heat from the water causes the phlegm to loosen. 1  Use a vaporizer if you have one. 2  Try to strike a good balance of moisture in your room. 3  You want to soothe your throat, but you don't want your room turning into a tropical jungle."}, {"url": "http://www.home-remedies-for-you.com/askquestion/11862/phlegm-in-throat-home-remedy-how-to-get-rid-of-phl.html", "passage_text": "1 If you have phlegm in the throat, causes include irritation in the airways of the lungs. 2  When the airways in the lungs are irrigated, excess mucus and phlegm is secreted to soothe the irritation. 3  Hence, to clear the phlegm and prevent build-up, you need to soothe the irritation in your airways."}]