[{"url": "http://www.nature.com/scitable/topicpage/protein-structure-14122136", "passage_text": "The linear sequence of amino acids within a protein is considered the primary structure of the protein. Proteins are built from a set of only twenty amino acids, each of which has a unique side chain. The side chains of amino acids have different chemistries. The largest group of amino acids have nonpolar side chains. The chemistry of amino acid side chains is critical to protein structure because these side chains can bond with one another to hold a length of protein in a certain shape or conformation. Charged amino acid side chains can form ionic bonds, and polar amino acids are capable of forming hydrogen bonds."}, {"url": "http://www.sigmaaldrich.com/life-science/metabolomics/enzyme-explorer/learning-center/structural-proteins.html", "passage_text": "Collagen is recognized as the most abundant mammalian protein. Structural proteins such as collagen, fibronectin and laminin are utilized in cell culture applications as attachment factors. Sigma ® offers the most comprehensive collection of structural proteins for extracellular matrix and cytoskeletal research as well as tools for cell culture and material science applications"}, {"url": "http://www.vivo.colostate.edu/hbooks/genetics/biotech/basics/prostruct.html", "passage_text": "Proteins are polymers of amino acids covalently linked through peptide bonds into a chain. Within and outside of cells, proteins serve a myriad of functions, including structural roles (cytoskeleton), as catalysts (enzymes), transporter to ferry ions and molecules across membranes, and hormones to name just a few. Levels of Protein Structure Structural features of proteins are usually described at four levels of complexity: Primary structure: the linear arrangment of amino acids in a protein and the location of covalent linkages such as disulfide bonds between amino acids."}, {"url": "http://dl.clackamas.edu/ch106-08/structur1.htm", "passage_text": "Structural proteins are fibrous proteins. The most familiar of the fibrous proteins are probably the keratins, which form the protective covering of all land vertebrates: skin, fur, hair, wool, claws, nails, hooves, horns, scales, beaks and feathers. "}, {"url": "http://www.els.net/WileyCDA/ElsArticle/refId-a0005023.html", "passage_text": "Abstract. Structural proteins are required for the formation and support of body tissues. Collagens, characterised by the repeating Gly–X–Y amino acid sequences, are the most abundant structural proteins in the human body. The collagen gene family comprises 45 genes encoding 28 homo‐ or heterotrimeric collagen types. "}, {"url": "http://www.particlesciences.com/news/technical-briefs/2009/protein-structure.html", "passage_text": "Secondary Structure. Stretches or strands of proteins or peptides have distinct characteristic local structural conformations or secondary structure, dependent on hydrogen bonding. The two main types of secondary structure are the α-helix and the ss-ß. Sheet the-α helix is a-right handed coiled. strand Secondary Structure. Stretches or strands of proteins or peptides have distinct characteristic local structural conformations or secondary structure, dependent on hydrogen bonding. The two main types of secondary structure are the α-helix and the ss-ß. sheet"}, {"url": "https://en.wikipedia.org/wiki/Protein", "passage_text": "Proteins also have structural or mechanical functions, such as actin and myosin in muscle and the proteins in the cytoskeleton, which form a system of scaffolding that maintains cell shape. Other proteins are important in cell signaling, immune responses, cell adhesion, and the cell cycle. "}, {"url": "http://biology.about.com/od/molecularbiology/ss/protein-structure.htm", "passage_text": "1 Secondary Structure-refers to the coiling or folding of a polypeptide chain that gives the protein its 3-D shape. 2  There are two types of secondary structures observed in proteins. 3  One type is the alpha (α) helix structure. 1 Quaternary Structure-refers to the structure of a protein macromolecule formed by interactions between multiple polypeptide chains. 2  Each polypeptide chain is referred to as a subunit. 3  Proteins with quaternary structure may consist of more than one of the same type of protein subunit."}, {"url": "http://www.nature.com/scitable/topicpage/protein-function-14123348", "passage_text": "Not surprisingly, protein functions are as diverse as protein structures. For example, structural proteins maintain cell shape, akin to a skeleton, and they compose structural elements in connective tissues like cartilage and bone in vertebrates. Enzymes are another type of protein, and these molecules catalyze the biochemical reactions that occur in cells."}, {"url": "https://en.wikipedia.org/wiki/Protein_structure", "passage_text": "Main article: Protein primary structure. The primary structure of a protein refers to the linear sequence of amino acids in the polypeptide chain. The primary structure is held together by covalent bonds such as peptide bonds, which are made during the process of protein biosynthesis or translation. A structural domain is an element of the protein's overall structure that is self-stabilizing and often folds independently of the rest of the protein chain. Many domains are not unique to the protein products of one gene or one gene family but instead appear in a variety of proteins."}]