[{"url": "http://dl.ubnt.com/datasheets/airsync/airSync_Design_Guide_2-1-12.pdf", "passage_text": "Design Guide How airSync ™ works airSync reduces problems when co-locating multiple radios near each other. When airSync is enabled, all APs transmit at the same time, and receive at the same time, reducing co-location interference. airSync synchronizes airMAX APs with a satellite reference timing signal. "}, {"url": "https://en.wikipedia.org/wiki/Airsync", "passage_text": "Microsoft Exchange ActiveSync (commonly known as EAS) is a communications protocol designed for the synchronization of email, contacts, calendar, tasks, and notes from a messaging server to a smartphone or other mobile devices. The mobile device communicates over HTTP or HTTPS. Originally branded as AirSync and only supporting Microsoft Exchange Servers and Microsoft Pocket PC devices, the protocol has since become a de facto standard for synchronization between groupware and"}, {"url": "http://www.pocket-lint.com/news/111734-best-android-apps-doubletwist-airsync", "passage_text": "It is, to its credit, a pretty good way of keeping your media organised and syncing it with your iOS device. Android doesn't have the luxury of a single place to sync your phone, which is where doubleTwist and its partner in crime, AirSync come in."}, {"url": "http://www.androidstatic.com/how-to-set-up-doubletwist-and-airsync/", "passage_text": "Now, if you actually click the Airsync icon it is simply going to redirect you towards the Doubletwist app. In the bottom left corner you should see a huge button that’s appropriately named Airsync. Click it and Doubletwist will ask if you want to set up Airsync and, if the answer isn’t obvious enough, you do. This guide assumes that you want to set up Airsync for wireless syncing as well, but if you haven’t bought a copy of it you can still use this to set up syncing by USB connection. So, if you don’t plan to use Airsync be sure you have a USB cable to sync with. Doubletwist: Market Link."}, {"url": "https://msdn.microsoft.com/en-us/library/gg663562(v=exchg.80).aspx", "passage_text": "2.2.3.65.1 FilterType (GetItemEstimate). The airsync:FilterType element is an optional child element of the airsync:Options element and a required child element of the Collection element in GetItemEstimate command requests. In both contexts, it specifies a time window for the objects sent from the server to the client. "}, {"url": "http://www.pcmag.com/article2/0,2817,2415902,00.asp", "passage_text": "Premium Features. Shelling out $4.99 for AirSync lets you wirelessly sync video, and iTunes music and playlists from a Mac or PC to your Android smartphone or tablet. Setting up this feature is easy, too"}, {"url": "https://www.communigate.com/CommuniGatePro/AirSync.html", "passage_text": "The AirSync protocol allows a client device to synchronize its Calendaring, Tasks, and Contacts data with the same data in the user Account on the server. The protocol also allows a user to synchronize some or all of its E-mail mailboxes, to compose and send E-mails, Event invitations, and Event replies. To provide a workaround for this problem, the CommuniGate Pro AirSync module generates a Reply itself, using the standard iCalendar format. As a result, the organizer may receive 2 Event Reply messages-one from the AirSync module, and one from the Windows Mobile client itself."}, {"url": "http://www.pcmag.com/article2/0,2817,2415902,00.asp", "passage_text": "View all 4 photos in gallery Premium FeaturesShelling out $4.99 for AirSync lets you wirelessly sync video, and iTunes music and playlists from a Mac or PC to your Android smartphone or tablet. Setting up this feature is easy, too. "}, {"url": "https://en.wikipedia.org/wiki/DoubleTwist", "passage_text": "AirSync is an additional application that runs through DoubleTwist Media Player allowing for wireless media syncing using a shared wifi connection. It is available in the Android Market for $4.99. It is not required for media syncing. DoubleTwist Media Player is an application available for Android devices. It is compatible with iTunes and Windows Media Player, allowing users to sync movies, pictures, music, and playlists to their mobile device through USB."}]