[{"url": "http://www.cooks.com/rec/search/0,1-0,baked_breaded_fish,FF.html", "passage_text": "Butter baking dish; place fish fillets in dish. ... and mix with bread crumbs. Sprinkle crumb mixture over fillets. Bake at 450 degrees for 15-30 minutes until tender. Combine crumbs, flour ... Place in single layer in baking pan. Bake at 350 degrees for 45 to 60 minutes. For barbecue style, roll in catsup instead of water."}, {"url": "https://uk.answers.yahoo.com/question/index?qid=20081129094807AA4GPt2", "passage_text": "Place fillets on a spray-coated baking sheet; bake for 5 minutes. Remove from oven. Baste cod fillets with olive oil mixture. Bake an additional 7 to 8 minutes for frozen cod or 3 to 5 minutes for fresh/thawed fish, adjusting cook time for smaller fillets. Bake just until fish is opaque throughout."}, {"url": "http://www.recipetips.com/recipe-cards/t--146780/breaded-baked-fish.asp", "passage_text": "1 Slightly coat fish with oil and then coat with bread crumb mix. 2  Place fish into a 9 X 13 pan. 3  After all fish has been added to the pan, take the remaining bread crumbs and distribute evenly onto the fish. 4  Bake in a preheated 400 degrees F. oven for 20 minutes. 1 In another bowl, mix together bread crumbs and seasoning. 2  Slightly coat fish with oil and then coat with bread crumb mix. 3  Place fish into a 9 X 13 pan. 4  After all fish has been added to the pan, take the remaining bread crumbs and distribute evenly onto the fish. 5"}, {"url": "http://www.livestrong.com/article/540081-how-to-cook-a-fish-fillet-in-the-oven/", "passage_text": "Slide the baking sheet into the oven and cook for 10 to 20 minutes or until golden brown. Test one of the fish fillets with a fork before removing the tray from the oven. If it flakes apart when you break it with the fork, cooking is complete. "}, {"url": "http://www.bettycrocker.com/recipes/crispy-oven-baked-fish/95629bd8-9e8a-465d-92e4-586c1f7ff953", "passage_text": "1 2 Dip fish into egg mixture; coat with bread crumb mixture. 2  Place on cookie sheet. 3  Spray fish with cooking spray. 4  3 Bake 10 minutes. 5  Turn fillets; bake 5 to 10 minutes longer or until fish flakes easily with fork. 6  Place fillets on serving platter; garnish with lemon wedges. 1 In another shallow bowl or dish, mix bread crumbs, lemon-pepper seasoning and garlic salt. 2  2 Dip fish into egg mixture; coat with bread crumb mixture. 3  Place on cookie sheet. 4  Spray fish with cooking spray. 5  3 Bake 10 minutes. 6  Turn fillets; bake 5 to 10 minutes longer or until fish flakes easily with fork"}, {"url": "http://www.tasteofhome.com/recipes/breaded-baked-tilapia", "passage_text": "1 Preheat oven to 425°. 2  In a shallow bowl, combine bread crumbs, cheese, garlic salt and oregano. 3  Coat fillets in crumb mixture. 4  Place on a baking sheet coated with cooking spray. 5  Bake 8-12 minutes or until fish flakes easily with a fork. Directions. 1  Preheat oven to 425°. 2  In a shallow bowl, combine bread crumbs, cheese, garlic salt and oregano. 3  Coat fillets in crumb mixture. 4  Place on a baking sheet coated with cooking spray. 5  Bake 8-12 minutes or until fish flakes easily with a fork. 6  Yield: 4 servings"}, {"url": "http://www.sheknows.com/food-and-recipes/articles/3835/breaded-ovenbaked-fish", "passage_text": "1 Dip fish in egg, then roll in crumbs. 2  Arrange breaded fish in baking pan. 3  Sprinkle with lemon pepper and parsley; drizzle melted butter over all. 4  Bake (uncovered) 20 to 40 minutes (depending on thickness) until done (fish should flake easily and be completely opaque). 5  Serve with tartar or fish sauce for dipping. Directions: 1  Preheat oven to 400 degrees F. 2  Lightly oil a shallow baking pan. 3  Rinse fish and pat dry. 4  In a small bowl, beat egg with water. 5 "}]