[{"url": "http://tokyoghoul.wikia.com/wiki/Kagune", "passage_text": "A Kagune (赫子, red child) is a ghoul 's predatory organ and functions as their weapon and claws. It is usually as red as blood (the colours are varied in the anime to distinguish the kagune of each individual); and flexible like the flow of water (Also called liquid muscle.), but firm and sturdy. "}, {"url": "https://en.wikipedia.org/wiki/Ghoul", "passage_text": "A ghoul is a monster or evil spirit in Arabian mythology, associated with graveyards and consuming human flesh. The oldest surviving literature that mention ghouls is likely One Thousand and One Nights. In modern fiction, the term has often been used for a certain kind of undead monster. By extension, the word ghoul is also used in a derogatory sense to refer to a person who delights in the macabre, or whose profession is linked directly to death, such as a gravedigger or graverobber."}, {"url": "http://monster.wikia.com/wiki/Ghoul", "passage_text": "Nature Edit. A ghoul is a demon-like creature who eats children or corpses. Although it is thought that ghouls are only female this not true. A ghoul has many powers like regeneration, shape-shifting and paralyzing touch. A light can harm a ghoul, they tend to avoid it. To kill it you must use fire, acid, lightning, or decapitation."}, {"url": "http://www.thefreedictionary.com/ghoul", "passage_text": "ghoul. n. 1. An evil spirit or demon in Muslim folklore believed to plunder graves and feed on corpses. 2. In popular folklore, an undead or subhuman being, especially one that eats human flesh. 3. A grave robber. 4. One who delights in the revolting, morbid, or loathsome. "}, {"url": "http://powerlisting.wikia.com/wiki/Ghoul_Physiology", "passage_text": "Capabilities. User with this ability either is or can transform into an ghoul a cannibalistic monster that feeds on corpses and living flesh, abducts young children to eat and lures unwary people into abandoned places, often classified as undead. The creatures usually dwells in graveyards and cemeter"}, {"url": "http://harrypotter.wikia.com/wiki/Ghoul", "passage_text": "...in wizarding families the ghoul often becomes a talking point or even a family pet.. — Newt Scamander on the roles ghouls play in wizarding homes. A ghoul is an ugly creature that resembles a slimy, buck-toothed ogre. They tend to live in the attics or barns of wizards and witches. They are relatively harmless creatures and are just seen as nuisances because of the noise they make. They are relatively dimwitted, and live off of bugs and other household pests. "}, {"url": "https://en.wikipedia.org/wiki/Tokyo_Ghoul", "passage_text": "Tokyo Ghoul (Japanese: 東京喰種トーキョーグール, Hepburn: Tōkyō Gūru) is a manga series by Sui Ishida. It was serialized in Shueisha 's seinen manga magazine Weekly Young Jump between September 2011 and September 2014 and has been collected in fourteen tankōbon volumes as of August 2014. "}, {"url": "http://www.merriam-webster.com/dictionary/ghoul", "passage_text": "Full Definition of GHOUL. 1. : a legendary evil being that robs graves and feeds on corpses. 2. : one suggestive of a ghoul; especially: one who shows morbid interest in things considered shocking or repulsive. — ghoul·ish \\ˈgue-ˈgü\\ lish. — adjective·ghoul·ish ly. adverb Full Definition of GHOUL. 1. : a legendary evil being that robs graves and feeds on corpses. 2. : one suggestive of a ghoul; especially: one who shows morbid interest in things considered shocking or repulsive. — ghoul·ish \\ˈgue-ˈgü\\ lish. adjective"}]