[{"url": "http://www.sciencedirect.com/science/article/pii/S0022286010003194", "passage_text": "Abstract. The infrared spectra of methyl isocyanate monomer isolated in cryogenic argon, xenon and nitrogen matrices were studied. Interpretation of the experimental results was supported by harmonic and anharmonic calculations carried out at the DFT, MP2 and CCSD levels of approximation."}, {"url": "http://www.google.com/patents/US5612441", "passage_text": "Patents. Compounds containing a ureido group which are useful in preparing dispersions of polymers having good wet adhesion properties and low volatility. Compounds having the formula: ##STR1## where R1 is H or an alkyl group, R2 is alkylene optionally interrupted with one or more ether oxygen atoms and A is..."}, {"url": "http://www.trivenichemicals.com/monomers.html", "passage_text": "Creating a niche in industry, we have been offering wide variety of Monomers. The range we deal in comprises 1,2,4-Butanetriol, 1,3-Butadiene, 2,2,4,4-Tetramethyl-1,3-cyclobutanediol, 2,5-Diaminotoluene, 2-Acrylamido-2-methylpropane sulfonic acid and 2-Octyl cyanoacrylate."}, {"url": "http://www.trivenichemicals.com/monomers.html", "passage_text": "Methyl isocyanate (MIC) is a colorless, lachrymatory, flammable liquid.[6] Methyl isocyanate is soluble in water to 6–10 parts per 100 parts, but it reacts with the water (see Reactions)."}, {"url": "https://www.osha.gov/SLTC/isocyanates/index.html", "passage_text": "Isocyanates are compounds containing the isocyanate group (-NCO). They react with compounds containing alcohol (hydroxyl) groups to produce polyurethane polymers, which are components of polyurethane foams, thermoplastic elastomers, spandex fibers, and polyurethane paints."}, {"url": "http://www.sciencedirect.com/science/article/pii/S0022286010003194", "passage_text": "Region of the CH stretching vibrations in the experimental FTIR spectra of MIC monomers isolated in xenon (20 K, 1:1000), argon (8 K, 1:850) and nitrogen (8 K, 1:850) matrices compared with the theoretical stick spectrum calculated at the B3LYP/aug-cc-pVTZ level."}, {"url": "http://www.hse.gov.uk/research/hsl_pdf/2007/hsl0747.pdf", "passage_text": "2 The mono-isocyanates (low molecular mass) of interest, studied here, are; isocyanic acid methyl isocyanate ethyl isocyanate propyl isocyanate butyl isocyanate, n-and tert-isomers hexyl isocyanate phenyl isocyanate diisopropylphenyl isocyanate."}, {"url": "http://www.cdc.gov/niosh/docs/2003-154/pdfs/chapter-k.pdf", "passage_text": "BACKGROUNDThe feature common to all diisocyanates (monomers) is the presence of two-N=C=O (isocyanate) functionalgroups attached to an aromatic or aliphatic parent compound. These compounds are widely used in surfacecoatings, polyurethane foams, adhesives, resins, elastomers, binders, and sealants."}]