[{"url": "https://en.wikipedia.org/wiki/Jocelyn", "passage_text": "Jocelyn is a surname and first name. It is a unisex (male/female) name. Variants include Jocilyn, Joscelyn, Joscelin, Josceline, Joseline, Jocelin, Jocelyne, Jocelynne, Jocelynn, Joslin, Joslyn, Joclyn, Joselyn, Joselyne and Josslyn; people that have this name may find it is often misspelled by others. In French, the spelling Jocelyn is exclusively male. The female counterpart is spelled Jocelyne. The Irish name Oisdealbh was originally a translation of Jocelyn, to gaelicize Jocelyn de Angulo 's given name."}, {"url": "http://www.thinkbabynames.com/meaning/0/Jocelyn", "passage_text": "Jocelyn. Jocelyn /jo-ce-lyn/ [3 sylls.] as a girls' name is pronounced JOSS-lin, JOSS-sa-lyn. It is of Old German origin, and the meaning of Jocelyn is a member of the German tribe, the Gauts. From an Old French masculine name brought to Britain by the Normans in the form Joscelin, which was from Gautzelin, a pet name for a member of a Germanic tribe, the Gauts, who may have been the same as the Goths. The name may have been associated with pet forms of the name Josse, which was the French form of Judoc or Jodoc, probably from Celtic jud meaning chief or lord. Josse or Jodoc was the name of a popular saint. Jocelyn was revived in the 19th century and adopted as a feminine name, perhaps because it could be associated with names like Joyce (which also derives from Josse) combined with the-lyn ending. Cellist Jocelyn DuPr. Kreatif forms: Jecelyn, Jucelyn"}, {"url": "http://www.sevenreflections.com/name-numerology/josselyn/", "passage_text": "The Hidden Passion Number represents your hidden talent. It shapes your personality, and guides your life. There are also the Karmic Lessons Numbers, associated with your full name (first name, middle name and last name) as it spelled in your birth certificate. To see these numbers, please, enter your FULL NAME. The number 11 is a Master Number of Revelation. People with a number 11 appearing in the name or birth date generally are endowed with special tendencies toward leadership and inspiration that set them apart from mass consciousness."}, {"url": "http://surnames.meaning-of-names.com/genealogy/josselyn/", "passage_text": "Josselyn in RootsWeb surname mailing lists. Josselyn genealogy mailing list for correspondence and sharing of information pertaining to family histories of the Josselyn surname and its variations. Or check the index of mailing lists for a sound-alike name. Josselyn Genealogy. Welcome to some of the best Josselyn genealogy resources found on the web. We hope you will participate on the Josselyn forums, it is a great place to find or post information on Josselyn genealogy and is completely free to participate."}, {"url": "http://www.behindthename.com/name/jocelyn", "passage_text": "Meaning & History. From a Germanic masculine name, variously written as Gaudelenus, Gautselin, Gauzlin, along with many other spellings. It was derived from the Germanic element Gaut, which was from the name of the Germanic tribe the Gauts, combined with a Latin diminutive suffix. The Normans brought this name to England in the form Goscelin or Joscelin, and it was common until the 14th century. It was revived in the 20th century primarily as a feminine name, perhaps an adaptation of the surname Jocelyn (a medieval derivative of the given name). In France this is a masculine name only. "}, {"url": "http://www.sheknows.com/baby-names/name/jocelyn", "passage_text": "French Meaning: The name Jocelyn is a French baby name. In French the meaning of the name Jocelyn is: Medieval male name adopted as a feminine name. German Meaning: The name Jocelyn is a German baby name. In German the meaning of the name Jocelyn is: One of the Goths. Introduced into Britam as a masculine name during the Norman Conquest, Jocelyn was adopted as a feminine first name in the early 20th century. SoulUrge Number: 11."}, {"url": "http://www.thinkbabynames.com/meaning/0/Josselyn", "passage_text": "Josselyn is an uncommon given name for females but a very popular last name for both adults and children (#34949 out of 150436, Top 23%). (2000 U.S. Census). Shown below is an analysis of the usage of the girl name Josselyn and associated names. Jocelyn (#114 the previous year) , Jocelyne, Jocelynn (#971) , Joseline, Joselyn (#619) , Joslyn (#871) and Joycelyn are the popular varying forms of Josselyn (not ranked) . Variants like Joslynn are seldom used. Josselyn /jos-se-lyn/ [3 sylls.] as a name for girls is of Old German derivation, and Josselyn means a member of the German tribe, the Gauts. Josselyn is a version of Jocelyn (Old German). Kreatif forms: Josselynna, Josselynni, Juselyn."}, {"url": "http://www.thinkbabynames.com/meaning/0/Jocelyn", "passage_text": "Jocelyn was revived in the 19th century and adopted as a feminine name, perhaps because it could be associated with names like Joyce (which also derives from Josse) combined with the-lyn ending. The name may have been associated with pet forms of the name Josse, which was the French form of Judoc or Jodoc, probably from Celtic jud meaning chief or lord. Josse or Jodoc was the name of a popular saint. Jocelyn was revived in the 19th century and adopted as a feminine name, perhaps because it could be associated with names like Joyce (which also derives from Josse) combined with the-lyn ending. Cellist Jocelyn DuPr. Kreatif forms: Jecelyn, Jucelyn"}]