[{"url": "http://www.wikihow.com/Become-an-Aromatherapist", "passage_text": "How to Become an Aromatherapist. Aromatherapists are people who specialize in various essential oils. They know and understand what the oils do to the body and how the oils can treat certain ailments. There is not really an official degree program for people who want to become aromatherapists, but there are many schools that offer aromatherapy-training programs for those who want to become certified. 1 If you've completed a program recognized by the National Association of Holistic Aromatherapy, you may want to list yourself in its directory as an official a"}, {"url": "http://www.healthschoolguide.net/health-careers/how-to-become-an-aromatherapist/", "passage_text": "In order to become an aromatherapist, you will need to receive training in aromatherapy, and become licensed in the field. If you are interested in entering the field of aromatherapy, you have come to the right place. This article will guide you in the right direction! Job Duties. As an aromatherapist, you will be required to document your clients’ medical histories, prior to the therapy. In other words, you will ask your clients about their current physical and mental conditions. You will then discuss possible side-effects, complications, and drug interactions with your clients."}, {"url": "http://www.ehow.com/how_2108093_become-certified-aromatherapist.html", "passage_text": "Although you can be trained as an aromatherapist and receive a certificate for your education, to become a certified aromatherapist, you must complete either a professional or clinical aromatherapy course and pass the certification examination offered by the Aromatherapy Registration Council, or ARC. "}, {"url": "http://learn.org/articles/How_Can_I_Become_an_Aromatherapist.html", "passage_text": "Research what it takes to become an aromatherapist. Learn about certification, career options, education requirements and job duties to find out if this is the career for you. Schools offering Allied Health degrees can also be found in these popular choices. Some aromatherapists choose to work directly with clients, while others choose to manufacture essential oils, work in a retail setting, become an educator, or even become part of the perfume industry. To continue researching, browse degree options below for course curriculum, prerequisites and financial aid information."}, {"url": "http://www.wikihow.com/Become-an-Aromatherapist", "passage_text": "1. Look for an aromatherapy school or any school with a program that will help you learn aromatherapy. There are many different schools offering aromatherapy training all over the world. Choose the school with the program that is most convenient and affordable for you. 1 If you've completed a program recognized by the National Association of Holistic Aromatherapy, you may want to list yourself in its directory as an official aromatherapist."}, {"url": "http://learn.org/articles/What_is_Required_for_Aromatherapy_Certification.html", "passage_text": "Aromatherapy is the study of using essential oils, as opposed to man-made drugs, for medicinal purposes. As an aromatherapist, you'll promote health and wellness through natural means, such as natural oils, massage therapy and proper nutrition. "}, {"url": "http://learn.org/articles/How_Can_I_Become_an_Aromatherapist.html", "passage_text": "Aromatherapist use herbs, plant materials and other aromatic substances to alleviate stress, assist with wellness and alter patients' moods. If you are interested in becoming an aromatherapist, you can enroll in an on-site or online program covering the principles of the alternative healing field. Aromatherapy is a federally unregulated profession, which means that schools and study programs don't have to follow any legal guideline. Some aromatherapists choose to work directly with clients, while others choose to manufacture essential oils, work in a retail setting, become an educator, or even become part of the perfume industry. To continue researching, browse degree options below for course curriculum, prerequisites and financial aid information."}, {"url": "http://www.healthschoolguide.net/health-careers/how-to-become-an-aromatherapist/", "passage_text": "Education. To become an aromatherapist, you will first need to find, apply, and enroll in a college or university that offers an aromatherapy undergraduate program. If you are unable to locate an educational institution that offers this type of program, you will need to find an aromatherapy school or training program. Job Duties. As an aromatherapist, you will be required to document your clients’ medical histories, prior to the therapy. In other words, you will ask your clients about their current physical and mental conditions. You will then discuss possible side-effects, complications, and drug interactions with your clients."}, {"url": "http://study.com/articles/Aromatherapist_Job_Description_Duties_and_Requirements.html", "passage_text": "Aromatherapist: Job Description, Duties and Requirements. Learn about the education and preparation needed to become an aromatherapist. Get a quick view of the requirements as well as details about training, job duties and certification to find out if this is the career for you. In order to carry out the duties of an aromatherapist, practitioners should be able to distinguish between different types of essential oils and know how they affect the body."}]