[{"url": "http://www.payscale.com/research/DK/Job=Software_Developer/Salary", "passage_text": "Software Developer Salary. (Denmark). The average salary for a Software Developer is $63,620 per year. A skill in C++ is associated with high pay for this job. Experience has a moderate effect on income for this job. Most people with this job move on to other positions after 20 years in this career"}, {"url": "http://taxindenmark.com/article.65.html", "passage_text": "The result of this is that Denmark has an average salary level far higher than other countries. The employer will look at his total cost to employ an individual, which will normally in principle be approx 102 % of the salary in Denmark and in other Western European Countries 120 % - 130 % of the salary. 2 % and the part to be paid by the employee also approx. 2 % of the gross salary. This combination is different from most other countries in Western Europe, where PIT marginal rates are smaller (on average 40-45 %) and effective PIT approx. 25% - 30 %"}, {"url": "http://www.ditdanmark.com/article.82.html", "passage_text": "Compared to other countries the direct salary in Denmark is high. After the subtraction of social contribution, labour marked contribution, the Danish salary level equals the salary level in other European countries like Belgium, Sweden and the Netherlands. A newly educated bank assistant earns about DKK 25-28.000 a month + pension. The average salary for a sales manager depends on the size of the firm and varies between DKK 50-55.000 a month + pension. For the key workers, researchers and professional sportsmen there is no monthly pay limit."}, {"url": "http://www.indeed.com/salary/q-Physician-l-Denmark,-SC.html", "passage_text": "Average Physician salaries for job postings in Denmark, SC are 1% lower than average Physician salaries for job postings nationwide. "}, {"url": "http://www.eui.eu/ProgrammesandFellowships/AcademicCareersObservatory/CareerComparisons/SalaryComparisons.aspx", "passage_text": "A few countries (Austria, The Netherlands, Israel, Switzerland and Luxembourg) offered avarage salaries in line with the U.S. considering the cost of living. Other countries outside the EU (Australia, India, Japan) all have average higher remuneration than the EU-25 area considering the cost of living. In Australia and Japan salaries are similar to those of the U.S. The only country in which the average salary was well below the EU was China. Sweden was the country with the highest autonomy (1), and The Netherlands (0.2), Denmark (0.5) and the UK (0.8) are located in between. The total for the ten European was 0.3 (Bruegel, 2007: 5). Another issue is salary dispersion."}, {"url": "http://www.oecdbetterlifeindex.org/countries/denmark/", "passage_text": "Household financial wealth is the total value of a household’s financial worth, such as money or shares held in bank accounts. In Denmark, the average household net financial wealth per capita is estimated at USD 44 488, lower than the OECD average of USD 67 139. In all OECD countries, men still earn more than women, with an average wage gap of 15.5%. In Denmark, men earn 7.8% more than women. Also, whereas the top 20% of the population earn an estimated USD 56 276 per year, the bottom 20% live on an estimated USD 28 524 per year."}, {"url": "http://www.simplyhired.com/salaries-k-denmark-jobs.html", "passage_text": "Average Denmark Salaries. The average salary for denmark jobs is $61,000. Average denmark salaries can vary greatly due to company, location, industry, experience and benefits. This salary was calculated using the average salary for all jobs with the term denmark anywhere in the job listing. "}, {"url": "http://www.oecdbetterlifeindex.org/countries/denmark/", "passage_text": "Money, while it cannot buy happiness, is an important means to achieving higher living standards. In Denmark, the average household net-adjusted disposable income per capita is USD 26 491 a year, more than the OECD average of USD 25 908 a year. But there is a considerable gap between the richest and poorest – the top 20% of the population earn close to four times as much as the bottom 20%. In all OECD countries, men still earn more than women, with an average wage gap of 15.5%. In Denmark, men earn 7.8% more than women. Also, whereas the top 20% of the population earn an estimated USD 56 276 per year, the bottom 20% live on an estimated USD 28 524 per year."}, {"url": "http://www.oecdbetterlifeindex.org/countries/denmark/", "passage_text": "Danish people earn USD 48 347 per year on average, more than the OECD average of USD 36 118. Not everyone earns that amount however. In all OECD countries, men still earn more than women, with an average wage gap of 15.5%. In Denmark, men earn 7.8% more than women. Also, whereas the top 20% of the population earn an estimated USD 56 276 per year, the bottom 20% live on an estimated USD 28 524 per year."}]