[{"url": "http://www.char.txa.cornell.edu/media/print/print.htm", "passage_text": "Printmaking Processes. In contemporary printmaking, artists frequently number their prints. The total number of prints made of one image is an edition. The number may appear on the print with the individual print number as a fraction such as 5/25 meaning that this particular print is number 5 of 25 prints made. "}, {"url": "http://www.answers.com/Q/What_is_printmaking", "passage_text": "Printmaking is an indirect means of creating art by transferring an image or design by contact with a matrix such as a block, plate, stone, or screen. There are many different types of printmaking, just as there are many types of paints. An artist chooses the medium based on the effect he/she is looking to achieve. Printmaking is considered an original art form because it is done completely by hand."}, {"url": "http://www.answers.com/Q/What_is_printmaking_art", "passage_text": "Split and merge into it. Answer by Seth Simmons. Confidence votes 291. Printmaking is an art form in which ink or other materials are transferred from a matrix to a material like paper, fabric, wood, or stone. A wide variety of techniques can be used inprintmaking, and this art is one of the oldest in the world. "}, {"url": "http://www.artoftheprint.com/artmediums.html", "passage_text": "Art of The Print-Printmaking As An Original Art: This summary is intended to acquaint the reader with the basic processes of printmaking as used both in the past and present. The concluding information will deal with some of the more frequent problems nagging the modern collector. "}, {"url": "http://www.artspan.com/printmaking", "passage_text": "Artspan Portal: Printmaking. Printmaking is the process of producing “multiple originals” of an original artwork on to a support surface. Printmaking as a fine art is not the same as “making prints; mechanical reproductions of artwork through an ink jet printer. "}, {"url": "https://www.cca.edu/academics/printmaking", "passage_text": "Discover New Printmaking Possibilities. Develop your craft as a printmaker and refine your voice as an artist. In our program, you’ll explore both traditional and experimental printmaking techniques, while also diving deep into contemporary art theory and cultural dialogue. In our innovative Printmaking Program, you’ll expand your skills as a critical thinker and push your boundaries as an artist. Develop your craft as a printmaker and refine your voice as an artist."}, {"url": "https://en.wikipedia.org/wiki/Printmaking", "passage_text": "Printmaking is the process of making artworks by printing, normally on paper. Printmaking normally covers only the process of creating prints that have an element of originality, rather than just being a photographic reproduction of a painting. Except in the case of monotyping, the process is capable of producing multiples of a same piece, which is called a print. Printmaking (other than monotyping) is not chosen only for its ability to produce multiple impressions, but rather for the unique qualities that each of the printmaking processes lends itself to. Prints are created by transferring ink from a matrix or through a prepared screen to a sheet of paper or other material."}, {"url": "http://www.onlineartcenter.com/printmaking.html", "passage_text": "Printmaking. Albrecht Duerer, Dürer German Master(printmaker-1470) 1528 Knight death and The, Devil, engraving, 1513 8 x. 10 click on the image above to open a great web page On'duerer dürer s techniques In The spencer Museum Of art printroom. web site "}]