[{"url": "http://www.iowachildcare.net/childcare-rates.php", "passage_text": "Usually, child care will be more expensive in the urban areas (where we conducted our survey) than in the rural areas. Infants (usually up to age 2): As of 2008, most centers’ rates fall between $183.00-$232.00 per week. The average center is currently charging around $200.00 per week. Toddlers (age 2 up to 3): The typical range for two year olds is $163.00-$206.00 with most centers charging around $175.00/week. 3-4 year olds: The range for 3-4 year olds is $149.00-$200.00 with most centers charging around $165.00. Usually, child care will be more expensive in the urban areas (where we conducted our survey) than in the rural areas. Iowa Child Care Center Rates Infants (usually up to age 2): As of 2008, most centers’ rates fall between $183.00-$232.00 per week."}, {"url": "http://www.howmuchisit.org/how-much-does-day-care-cost/", "passage_text": "1 According to babycenter, day care costs can average anywhere between $250 and $1200 per month. 2  The average national monthly cost of child care is $611. 3  Larger chains such as Kindercare may cost more than a local daycare center. 1 Generally speaking, the busier the area, the more expensive the daycare rates will be. 2  According to babycenter, day care costs can average anywhere between $250 and $1200 per month. 3  The average national monthly cost of child care is $611. 4  Larger chains such as Kindercare may cost more than a local daycare center."}, {"url": "http://www.howmuchisit.org/how-much-does-day-care-cost/", "passage_text": "1 The cost of daycare can vary greatly from state to state and city to city. 2  Generally speaking, the busier the area, the more expensive the daycare rates will be. 3  According to babycenter, day care costs can average anywhere between $250 and $1200 per month. 4  The average national monthly cost of child care is $611. 1 Generally speaking, the busier the area, the more expensive the daycare rates will be. 2  According to babycenter, day care costs can average anywhere between $250 and $1200 per month. 3  The average national monthly cost of child care is $611. 4  Larger chains such as Kindercare may cost more than a local daycare center."}, {"url": "https://answers.yahoo.com/question/index?qid=20071211123817AAQ2WbV", "passage_text": "Best Answer: I am a child care provider in Iowa. i live in the Quad Cities. The average rate for full time is $115.00 a week. that means you can come Monday thru Friday 7 am to 5:30 Pm. Even if you have the day off, you are more than welcome to bring your child. That cost includes food and activities as well. I lived in Nebraska and found a home daycare for my 2 children for $200 a week (they were 18 months and 4 years old). For that part of the country I'd say anything under $100 is good, around $100 reasonable and at around $150 high unless you are getting a lot of structure/teaching/attention, etc. all weekly costs."}, {"url": "http://www.babycenter.com/0_how-much-youll-spend-on-childcare_1199776.bc", "passage_text": "The average cost of center-based daycare in the United States is $11,666 per year ($972 a month), but prices range from $3,582 to $18,773 a year ($300 to $1,564 monthly), according to the National Association of Child Care Resource & Referral Agencies (NACCRRA). The least expensive states for preschool-age care in a childcare center, with costs ranging from less than $4,000 a year ($333 a month) to around $7,000 a year are Mississippi, Kentucky, Louisiana, Kansas, Missouri, Oklahoma, Idaho, West Virginia, South Carolina, and Alabama."}, {"url": "https://www.bostonglobe.com/2014/07/02/map-the-average-cost-for-child-care-state/LN65rSHXKNjr4eypyxT0WM/story.html", "passage_text": "Map: The average cost for child care by state. Child care is one of the highest budget items for a family and Massachusetts is among the least affordable states with an annual cost of $16,430, according to Child Care Aware of America."}, {"url": "http://www.care.com/child-care-day-care-cost-p1145-q165824.html", "passage_text": "Average Cost. The U.S. average seems to suggest that for one toddler, in full-time day care, on weekdays, the cost is approximately $600.00 per month. But, that figure can rise to well over $1000.00 per month in major metro areas, and fall to less than $350 in rural areas. Factors Impacting Cost. The U.S. average seems to suggest that for one toddler, in full-time day care, on weekdays, the cost is approximately $600.00 per month. But, that figure can rise to well over $1000.00 per month in major metro areas, and fall to less than $350 in rural areas"}]