[{"url": "http://learningpath.org/articles/Divorce_Lawyer_Career_Profile.html", "passage_text": "Education Requirements. To become a divorce lawyer, you'll need at least seven years of postsecondary education. There is no required major for undergraduate studies, according to The State Bar of California. However, the BLS reports that you will benefit from coursework in public speaking, philosophy, political science and English."}, {"url": "http://learn.org/articles/What_Education_is_Needed_for_a_Career_as_a_Divorce_Lawyer.html", "passage_text": "Becoming a divorce lawyer takes seven years of formal higher education, including a four-year bachelor's degree and a three-year law degree. Read on to learn more about required education and skills as well as career statistics. Schools offering Juris Doctor degrees can also be found in these popular choices."}, {"url": "http://www.excite.com/education/legal/paralegal/law-legal/careers/how-to-become-a-lawyer", "passage_text": "A: To become a lawyer you have to earn a law degree. There are many law schools that offer law degree programs. You can opt for law degrees such as the Juris Doctor degree and the master degree in law. A bachelor degree will be required to qualify for admission in any law school."}, {"url": "http://www.wikihow.com/Become-a-Divorce-Lawyer", "passage_text": "2. Focus your interests in your second year of law school. In your second and third years of law school, you will be able to take elective courses. As a budding divorce lawyer, you will have the option to take classes in family law, women and the law, and children's law."}, {"url": "http://learn.org/articles/What_Education_is_Needed_for_a_Career_as_a_Divorce_Lawyer.html", "passage_text": "There is no required undergraduate degree necessary for a career as a divorce lawyer. Many divorce lawyers obtain bachelor's degrees in English, political science or sociology. They also benefit from multidisciplinary studies, which offer foreign language, public speaking, psychology and sociology courses."}]