[{"url": "http://www.spineuniverse.com/treatments/surgery/surgical-wound-care-questions-answers", "passage_text": "Obviously, the longer the wound the greater time it will take to remove your sutures or staples. Removal of the closure material normally ranges from one to five minutes depending on the length of the wound and the number of sutures or staples to be removed."}, {"url": "http://www.webmd.com/a-to-z-guides/incision-care-after-surgery-topic-overview", "passage_text": "1 Scrub or rub incisions. 2  Remove the tape strips (such as Steri-Strips) from incisions unless your doctor tells you to. 3  Use lotion or powder on incisions. 4  Expose incisions to sunlight. 5  Take a bath unless you can keep the incision dry. 6  Instead, take showers or sponge baths until your doctor says it's okay to take baths."}, {"url": "http://www.webmd.com/a-to-z-guides/incision-care-after-surgery-topic-overview", "passage_text": "1 Remove the tape strips (such as Steri-Strips) from incisions unless your doctor tells you to. 2  Use lotion or powder on incisions. 3  Expose incisions to sunlight. 4  Take a bath unless you can keep the incision dry. 5  Instead, take showers or sponge baths until your doctor says it's okay to take baths."}, {"url": "http://www.webmd.com/a-to-z-guides/incision-care-after-surgery-topic-overview", "passage_text": "Topic Overview. After surgery, you will need to take care of the incision as it heals. Doing so may limit scarring, may help you avoid pain or discomfort, and may help lower the risk of problems like infection. Your doctor used either stitches, staples, tissue glue, or tape strips to close the incision."}, {"url": "http://www.emedicinehealth.com/incision_care_after_surgery-health/article_em.htm", "passage_text": "After surgery, you will need to take care of the incision as it heals. Doing so may limit scarring, may help you avoid pain or discomfort, and may help lower the risk of problems like infection. Your doctor used either stitches, staples, tissue glue, or tape strips to close the incision."}, {"url": "http://familydoctor.org/familydoctor/en/prevention-wellness/staying-healthy/first-aid/caring-for-your-incision-after-surgery.html", "passage_text": "Your doctor will remove stitches that don't absorb into the tissues. Stitches are usually removed 3 days to 3 weeks after surgery, depending on where they are and how quickly you heal. Your doctor may apply skin tape after the stitches are removed. Skin tape provides additional wound support. The tape can be removed in 3 to 7 days."}, {"url": "http://www.cts.usc.edu/hpg-takingcareofincisionsafterheartsurgery.html", "passage_text": "Depending on your surgery, your chest incision may extend through layers of skin, muscle and bone. Your skin should be healed by the time of discharge, your breastbone should take six to eight weeks, and your scar should fade in approximately six months to one year."}]