[{"url": "http://www.boldsky.com/beauty/women-fashion/2013/fashion-tricks-hide-belly-fat-032154.html", "passage_text": "There are many diet plans to lose weight and shed the belly fat. However, when you are on a weight loss diet, you need time to see the results. Till that time, the only thing you want to hide is your bulging tummy. There are many fashion tricks that can help you hide your tummy fat easily."}, {"url": "http://www.ehow.com/how_2249937_hide-fat-tummy.html", "passage_text": "How to Hide a Fat Tummy. Wear a tunic and leggings if you have slender legs, but carry a lot of weight in your belly. The tightness of the leggings will draw attention to your slender stems and the flowing and loose nature of the tunic will hide your belly fat."}, {"url": "http://40plusstyle.com/how-to-hide-your-belly/", "passage_text": "5. Make sure that your dresses don’t cling around the tummy area. Dresses with a draping element around the tummy area often work. Asymmetrical dresses work well too as they draw attention away from the belly and create a vertical line. Dresses that don’t cling with patterns are also great to hide"}, {"url": "http://www.more.com/clothing-to-hide-belly-fat", "passage_text": "One way to hide Belly Fat and take away attention from your Belly to some other attractive part of your body like a beautiful neck is by using a attractive scarf. A nicely knotted scarf will make a nice fashion statement provided you have taken care of contrasting the colors of your dress and the scarf."}, {"url": "http://www.complex.com/style/2013/08/ways-to-hide-beer-belly/", "passage_text": "10 Stylish Ways to Hide Your Beer Belly. Some guys push weight, and others just carry it around. While heavyset dudes have a different set of rules for looking good, there's some crossover with so-called skinny-fat guys who are by no means obese, but may have a spare tire under their shirts."}, {"url": "http://fashion.about.com/video/How-to-Hide-a-Belly.htm", "passage_text": "A pattern at the waist is also a great way to hide your belly. It draws the eye to your waistline but, believe it or not, it actually detracts from any sort of imperfections. Pattern at the waist, solid dress, even if it is a black dress with a scarf tied around your waist is a great way to hide the belly."}, {"url": "http://www.boldsky.com/beauty/men-fashion/2014/hide-that-belly-mens-fashion-tips.html", "passage_text": "Jacket. Wearing a good jacket is the best way to conceal your belly bulge. Have a cool jacket handy when you wish to camouflage the belly fat. It draws the attention away from the belly at the same time covers it in a subtle way."}]