[{"url": "https://en.wikipedia.org/wiki/Geography_of_Denmark", "passage_text": "Denmark is a Nordic country located in Northern Europe. It consists of the Jutland peninsula and several islands in the Baltic sea, referred to as the Danish Archipelago. Denmark is located southwest of Sweden and due south of Norway and is bordered by the German state (and former possession) Schleswig-Holstein to the south, on Denmark's only land border, 68 kilometres (42 miles) long."}, {"url": "http://geography.about.com/od/lists/a/whichcontinent.htm", "passage_text": "By Matt Rosenberg. I often receive questions about on which continent one can find a certain place. Below are some of the most frequent questions. I define there to be seven continents - 1) Europe, 2) Australia, 3) Africa, 4) Antarctica, 5) North America, 6) Asia, and 7) South America. Those places which are not part of a continent can be included as part of a region of the world."}, {"url": "http://www.worldatlas.com/webimage/countrys/namerica/gl.htm", "passage_text": "Print this map. Greenland History. Greenland (about 80% ice covered) is the world's largest (non-continent) island, and it dominates the North Atlantic Ocean between North America and Europe It is geographically considered part of the North American continent. So, Greenland is still considered a part of Denmark, and not recognized as an official independent country. In fact, it's a constituent country; a country that remains a part of another entity, such as a sovereign state. In this case, the country of Denmark."}, {"url": "https://en.wikipedia.org/wiki/Denmark", "passage_text": "Denmark (/ˈdɛnmɑrk/ ; Danish: Danmark [ˈd̥aenmɑɡ̊]. ) ˈd̥ænmɑɡ̊ is a country In Northern. Europe the southernmost of The nordic, countries it is southwest Of sweden and south Of, norway and bordered to the south By. Germany denmark is part Of, scandinavia together With sweden And. norway The Kingdom of Denmark is a sovereign state that comprises Denmark and two autonomous constituent countries in the North Atlantic Ocean: the Faroe Islands and Greenland. Denmark proper has an area of 43,094 square kilometres (16,639 sq mi), and a population of 5,678,348 (July 2015)."}, {"url": "http://www.7continentslist.com/europe/", "passage_text": "The world's oldest countries like France, Portugal and Denmark also reside in this continent. The longest lake of Europe is Balaton stretching up to 592 square kilometers. The importance of rivers can never be ignored as they have a massive influence on a country's trade and economy. Europe Continent, Europe Facts. A continent is defined as the earth's main continuous expansion on land. A continent is a huge mass of land primarily defined in terms of convention. There are currently seven continents in the world out of which Europe is the second smallest"}, {"url": "http://www.answers.com/Q/What_continent_does_denmark_belong_to", "passage_text": "Well just now it's Greenland and the Faeroe islands that belong to Denmark. But back in the day Denmark owned modern day Norway, Iceland, and southern part of Sweden called … Skan. skån Well just now it's Greenland and the Faeroe islands that belong to Denmark. But back in the day Denmark owned modern day Norway, Iceland, and southern part of Sweden called … Skan. Skån. answered"}, {"url": "http://geography.about.com/od/lists/a/whichcontinent.htm", "passage_text": "On which continent is Panama? The border between Panama and Colombia is the border between North America and South America so Panama is in North America and Colombia is in South America. Below are some of the most frequent questions. I define there to be seven continents - 1) Europe, 2) Australia, 3) Africa, 4) Antarctica, 5) North America, 6) Asia, and 7) South America. Those places which are not part of a continent can be included as part of a region of the world."}, {"url": "http://wikitravel.org/en/Denmark", "passage_text": "Denmark is a country in Scandinavia. The main part of it is Jutland, a peninsula north of Germany, but also with a number of islands, including the two major ones, Zealand and Funen, in Østersøen østersøen sea Between jutland And. sweden Denmark is not only a gateway to Scandinavia in cultural terms, but also geographically. As such, the country is well connected with the rest of the European continent and Scandinavia. A plethora of ferries connect Denmark with Europe"}, {"url": "https://en.wikipedia.org/wiki/Denmark", "passage_text": "Denmark (/ˈdɛnmɑrk/ ; Danish: Danmark [ˈd̥aenmɑɡ̊]. ) ˈd̥ænmɑɡ̊ is a country In Northern. Europe the southernmost of The nordic, countries it is southwest Of sweden and south Of, norway and bordered to the south By. germany The Kingdom of Denmark is a sovereign state that comprises Denmark and two autonomous constituent countries in the North Atlantic Ocean: the Faroe Islands and Greenland. Denmark proper has an area of 43,094 square kilometres (16,639 sq mi), and a population of 5,678,348 (July 2015)."}, {"url": "http://www.answers.com/Q/Which_continent_is_Denmark_located_on", "passage_text": "Location: Northern Europe, bordering the Baltic Sea and the North Sea, on a peninsula north of Germany. Denmark is located in Northern Europe. South of Norway, west of Sweden, … north of Germany. "}]