[{"url": "https://en.wikipedia.org/wiki/Venus_of_Urbino", "passage_text": "The Venus of Urbino is a 1538 oil painting by the Italian master Titian. It depicts a nude young woman, identified with the goddess Venus, reclining on a couch or bed in the sumptuous surroundings of a Renaissance palace. It hangs in the Galleria degli Uffizi in Florence. Titian contrasts the straight lines of the architecture with the curves of the female form, and the screen behind Venus bisects the painting, a large-scale division that is mitigated by unifying elements such as the use of colour and the floral patterns of the couch, cassoni, and background tapestries."}, {"url": "http://www.radford.edu/rbarris/art462%20Renaissance/Venetian%2520Renaissance.html", "passage_text": "Titian s legacy in terms of the female nude comes from the Venus of Urbino. It has been asked of this painting if it is mythology or if it is pornography, intended for an elite customer, and therefore a painting of a courtesan. "}, {"url": "http://www.oilpaintingfactory.com/Titian.html", "passage_text": "Toperfect Supplies Titian Venus and biography from the artist gallery, Venus of Urbino, Assumption of the Virgin, portrait, Madonna, Diana, Venice, and more Titian art, check the artworks list to buy a beautiful art reproduction. Toperfect, the terminal to your hard journey of searching for paintings by Titian! Search: The famous artists in our art company are good at Venus Titian in Venice, reproductions on canvas and other beautiful painting wholesale in museum quality such as"}, {"url": "https://en.wikipedia.org/wiki/Venus_of_Urbino", "passage_text": "The Venus of Urbino was one of the inspirations for Édouard édouard 'manet s 1863 olympia in which the figure Of venus is replaced with the Model Victorine. meurent Titian contrasts the straight lines of the architecture with the curves of the female form, and the screen behind Venus bisects the painting, a large-scale division that is mitigated by unifying elements such as the use of colour and the floral patterns of the couch, cassoni, and background tapestries."}, {"url": "http://www.oilpaintingfactory.com/Titian.html", "passage_text": "Titian the artist also painted in Rome the famous portrait of Pope Paul III and his Nephews (Museo di Capodimonte). Here is the best gallery and museum to purchase oil painting copies of Titian Venus of Urbino, Assumption of the Virgin as well as other Venetian painters. The famous artists in our art company are good at Venus Titian in Venice, reproductions on canvas and other beautiful painting wholesale in museum quality such as"}, {"url": "https://en.wikipedia.org/wiki/Venus_of_Urbino", "passage_text": "The model for the painting has been identified as Angela del Moro, a highly paid courtesan in Venice and a known dining companion of Titian. The argument for the painting's didacticism was made by the late art historian Rona Goffen in 1997's “Sex, Space, and Social History in Titian’s Venus of Urbino. Titian contrasts the straight lines of the architecture with the curves of the female form, and the screen behind Venus bisects the painting, a large-scale division that is mitigated by unifying elements such as the use of colour and the floral patterns of the couch, cassoni, and background tapestries."}, {"url": "http://www.metmuseum.org/TOAH/HD/tita/hd_tita.htm", "passage_text": "Early Works. Titian trained under two other seminal Venetian artists, Giovanni Bellini (active by 1459, died 1516) and Giorgione (ca. 1477/81510). The latter, with whom Titian also collaborated, was influential for his tonal approach to painting and for his landscape style, which was atmospheric and evocative. Titian derived the subject matter from literary descriptions of classical works of art. Venus, the mythological goddess of love, is the protagonist of a number of works by Titian, the best known probably being the so-called Venus of Urbino (Florence, Galleria degli Uffizi). Painted for Francesco Maria I della Rovere's private chambers, this reclining nude is at once idealized and erotic"}, {"url": "http://taydanhar.blogspot.com/2012/01/renaissance-venuses.html", "passage_text": "During the High Renaissance these ideals are perfected and can be seen within the art work. The Birth of Venus painted by Sandro Botticelli from the Early Renaissance illustrates the development of naturalism. Titian’s painting of the Venus of Urbino from the High Renaissance conveys naturalism at its best. The Renaissance ideas were focused around humanism. There were developing ideas in naturalism, idealism, and illusionism. Painted in 1484-86 The Birth of Venus conveys Early Renaissance ideals"}]