[{"url": "http://vegetarian.about.com/od/healthnutrition/f/arsenic.htm", "passage_text": "Answer: Arsenic is a poisonous chemical often used in herbicides and pesticides and is classified as a Class 1 carcinogen, meaning it is highly toxic to humans. Other Class 1 carcinogens include asbestos, formaldehyde and hepatitis B and C viruses."}, {"url": "http://www.fda.gov/Food/FoodborneIllnessContaminants/Metals/ucm280202.htm", "passage_text": "中国 (Chinese). Arsenic is present in the environment as a naturally occurring substance or as a result of contamination from human activity. It is found in water, air, food, and soil in organic and inorganic forms."}, {"url": "https://www.dhs.wisconsin.gov/chemical/arsenic.htm", "passage_text": "Arsenic level between 10 ppb and 500 ppb*. Do not drink your water or use it to prepare foods that require a lot of water (e.g., infant formula, soups, Jell-O, rice, coffee, tea) if the arsenic level is above 10 ppb. Washing foods and dishes in the water is safe, and is not a significant source of exposure."}, {"url": "http://www.atsdr.cdc.gov/toxfaqs/TF.asp?id=19&tid=3", "passage_text": "Arsenic is a naturally occurring element widely distributed in the earth's crust. In the environment, arsenic is combined with oxygen, chlorine, and sulfur to form inorganic arsenic compounds. Arsenic in animals and plants combines with carbon and hydrogen to form "}, {"url": "http://www.cancer.org/cancer/cancercauses/othercarcinogens/intheworkplace/arsenic", "passage_text": "Arsenic is a natural element that can be found in rocks and soil, water, air, and in plants and animals. It can also be released into the environment from some agricultural and industrial sources. Although it is sometimes found in its pure form as a steel grey metal, arsenic is usually part of chemical compounds."}, {"url": "https://en.wikipedia.org/wiki/Arsenic", "passage_text": "Arsenic is a chemical element with symbol As and atomic number 33. Arsenic occurs in many minerals, usually in conjunction with sulfur and metals, and also as a pure elemental crystal. Arsenic is a metalloid. It can exist in various allotropes, although only the gray form has important use in industry."}, {"url": "https://www.dhs.wisconsin.gov/chemical/arsenic.htm", "passage_text": "Arsenic is a naturally occurring mineral found in soil, bedrock, and water. In its pure form, arsenic is a silver-gray or white brittle metal. Arsenic has no odor and is almost tasteless. Arsenic and its compounds have a variety of commercial uses. Manufacturers use arsenic to make other metals, glass, electronic components, and wood preservatives."}]