[{"url": "https://simple.wikipedia.org/wiki/Period_(physics)", "passage_text": "A period T is the time needed for one complete cycle of vibration to pass a given point. As the frequency of a wave increases, the period of the wave decreases. Frequency and Period are in a reciprocal relationship that can be expressed mathematically as: Period equals the Total time divided by the Number of cycles. 1  Orbital period is the time for something to go round (orbit) something else."}, {"url": "http://www.physicsclassroom.com/class/waves/Lesson-2/Frequency-and-Period-of-a-Wave", "passage_text": "Frequency is the reciprocal of the period. The period is 5 seconds, so the frequency is 1/(5 s) = 0.20 Hz. 8. A common physics lab involves the study of the oscillations of a pendulum. If a pendulum makes 33 complete back-and-forth cycles of vibration in 11 seconds, then its period is ______."}, {"url": "http://www.answers.com/Q/What_is_the_physics_definition_of_period", "passage_text": "The physics definition of period is the duration of one complete cycle of a wave or oscillation."}, {"url": "http://www.physicsclassroom.com/class/waves/Lesson-2/Frequency-and-Period-of-a-Wave", "passage_text": "The period of a wave is the time for a particle on a medium to make one complete vibrational cycle. Period, being a time, is measured in units of time such as seconds, hours, days or years. The period of orbit for the Earth around the Sun is approximately 365 days; it takes 365 days for the Earth to complete a cycle."}, {"url": "https://simple.wikipedia.org/wiki/Period_(physics)", "passage_text": "1 The period of a pendulum is the time it takes from one side to the other and back. 2  An electron moving in a helical orbit that has an axis at right angles to the magnetic field has a period given by T=2πm/qB, where m is the mass of the electron, q is the charge of the electron and B is the magnetic field in the region."}, {"url": "http://www.physicsclassroom.com/class/waves/Lesson-0/Properties-of-Periodic-Motion", "passage_text": "The period of the object's motion is defined as the time for the object to complete one full cycle. Being a time, the period is measured in units such as seconds, milliseconds, days or even years. The standard metric unit for period is the second. An object in periodic motion can have a long period or a short period."}]