[{"url": "http://yourbusiness.azcentral.com/average-length-small-business-loan-21230.html", "passage_text": "Construction. The average term on a construction line of credit is 12 to 18 months. The length of the loan is dependent on the schedule developed along with the budget. The more complex the project, the longer the term will be. Term. A small business term loan is used for short-term needs such as financing the purchase of equipment or inventory. It is rare for a small business term loan to exceed 7 years. This is due to the fact that equipment and inventory are quickly depreciating assets that lose usefulness over tim"}, {"url": "http://www.ehow.com/info_8593663_average-commercial-loan-terms.html", "passage_text": "Commercial Mortgages. Commercial mortgages are used for the purchase or refinance of commercial real estate. Commercial mortgage terms range from five to 25 years. The rate is rarely fixed for more than five years. Either the rate resets every five years or the loan balloons. When the rate resets, the loan is fully amortized over the term. There are a number of loan variations too, ranging from mortgages to term loans to lines of credit. Unlike residential loans, commercial loans do not always have set terms. While the specifics can be negotiated, average commercial loan terms fall into certain ranges."}, {"url": "http://www.investopedia.com/articles/personal-finance/100314/commercial-real-estate-loans.asp", "passage_text": "Unlike residential loans, the terms of commercial loans typically range from five years (or less) to 20 years, and the amortization period is often longer than the term of the loan. Residential loans are amortized over the life of the loan so that the loan is fully repaid at the end of the loan term. A borrower with a $200,000 30-year fixed-rate mortgage at 5%, for example, would make 360 monthly payments of $1,073.64, after which the loan would be fully repaid."}, {"url": "http://www.investopedia.com/articles/personal-finance/100314/commercial-real-estate-loans.asp", "passage_text": "For example, an investor with a $1 million commercial loan at 7% would make monthly payments of $6,653.02 for seven years, followed by a final balloon payment of $918,127.64 that would pay off the loan in full. The length of the loan term and the amortization period will affect the rate the lender charges. Residential loans are amortized over the life of the loan so that the loan is fully repaid at the end of the loan term. A borrower with a $200,000 30-year fixed-rate mortgage at 5%, for example, would make 360 monthly payments of $1,073.64, after which the loan would be fully repaid."}, {"url": "https://answers.yahoo.com/question/index?qid=20080722094627AAPLaXw", "passage_text": "If you apply for a business loan from a bank and have the assets to secure the loan, what is the typical Term Length of the loan the bank is willing to give you? For instance, the typical max term on a home loan is 30/years. "}, {"url": "http://yourbusiness.azcentral.com/average-length-small-business-loan-21230.html", "passage_text": "Small business loan terms vary based on loan type, collateral and whether or not the loan falls under the auspices of the U.S. Small Business Administration (SBA). There are a multitude of loans available to an entrepreneur, you just have to do your research. Term. A small business term loan is used for short-term needs such as financing the purchase of equipment or inventory. It is rare for a small business term loan to exceed 7 years. This is due to the fact that equipment and inventory are quickly depreciating assets that lose usefulness over time"}, {"url": "http://www.investopedia.com/articles/personal-finance/100314/commercial-real-estate-loans.asp", "passage_text": "For example, the LTV for a $90,000 loan on a $100,000 property would be 90% ($90,000 ÷ $100,000 = 0.9, or 90%). For both commercial and residential loans, borrowers with lower LTVs will generally qualify for more favorable financing rates than those with higher LTVs. Residential loans are amortized over the life of the loan so that the loan is fully repaid at the end of the loan term. A borrower with a $200,000 30-year fixed-rate mortgage at 5%, for example, would make 360 monthly payments of $1,073.64, after which the loan would be fully repaid."}, {"url": "http://www.ehow.com/info_8593663_average-commercial-loan-terms.html", "passage_text": "Commercial term loans are short-term financing for non real estate purposes. The rates are typically fixed and the term runs from three to 10 years. Ten-year terms are a bit rare, however, with most commercial term loans capping at seven years. There are a number of loan variations too, ranging from mortgages to term loans to lines of credit. Unlike residential loans, commercial loans do not always have set terms. While the specifics can be negotiated, average commercial loan terms fall into certain ranges."}]