[{"url": "http://www.answers.com/Q/Why_were_aircraft_carriers_invented", "passage_text": "The first aircraft  carrier designed with a flight deck was the Japanese carrier  Hosho (1922), followed by the commissioning of the British  carrier HMS Hermes in 1924. Making the world better, one answer at a time. Aircraft carriers were invented so the products could be transported across the world quicker, because plane is the quickest mode of transport in the world."}, {"url": "http://www.answers.com/Q/Why_were_aircraft_carriers_invented", "passage_text": "The aircraft carrier was preceded by the balloon barges of the US  Civil War, and the first aircraft carriers were seaplane tenders  that did not launch or recover planes ab … oard the ship. This  included the French Foudre in 1911. Making the world better, one answer at a time. Aircraft carriers were invented so the products could be transported across the world quicker, because plane is the quickest mode of transport in the world."}, {"url": "https://en.wikipedia.org/wiki/History_of_the_aircraft_carrier", "passage_text": "Balloon carriers were the first ships to deploy manned aircraft, used during the 19th and early 20th century, mainly for observation purposes. The advent of fixed-wing aircraft in 1903 was followed in 1910 by the first flight from the deck of a US Navy cruiser. Seaplanes and seaplane tender support ships, such as HMS Engadine, followed. The development of flat top vessels produced the first large fleet ships. During the Second World War, these ships would become the backbone of the carrier forces of the US, British, and Japanese navies, known as fleet carriers. World War II saw the first large-scale use of aircraft carriers and induced further refinement of their launch and recovery cycle leading to several design variants."}, {"url": "http://www.answers.com/Q/Who_invented_the_aircraft_carrier", "passage_text": "The first US carrier was a converted coal ship, the Jupiter, which became USS Langley in 1920. The first aircraft carrier designed with a flight deck was the Japanese carrier Hosho (1922), followed by the commissioning of the British carrier HMS Hermes in 1924. The British built the first true aircraft carrier in 1918. Earlier aircraft carriers were cruisers with wooden platforms built over their decks for airplane runways. The first … landing of a plane on a ship was made by Eugene Ely when he landed on a platform on the cruiser Pennsylvania in 1911."}, {"url": "http://www.libertyreferences.com/aircraft-carrier.shtml", "passage_text": "The Invention of the Aircraft Carrier. The Invention of the Aircraft Carrier was a pivotal event in maritime history. The Aircraft Carrier battle group has become a critical element of United States foreign policy and acts as the central force in the nation’s forward deployed presence around the globe. The invention of the aircraft carrier plays a major role in keeping the world safe for democracy. The invention of the aircraft carrier has played a great role in maintaining the United States of America’s freedoms."}, {"url": "http://www.answers.com/Q/Who_invented_the_aircraft_carrier", "passage_text": "The aircraft carrier was preceded by the balloon barges of the US Civil War, and the first aircraft carriers were seaplane tenders that did not launch or recover planes aboard the ship. This included the French Foudre in 1911. The British built the first true aircraft carrier in 1918. Earlier aircraft carriers were cruisers with wooden platforms built over their decks for airplane runways. The first … landing of a plane on a ship was made by Eugene Ely when he landed on a platform on the cruiser Pennsylvania in 1911."}, {"url": "http://guernseydonkey.com/?p=1355", "passage_text": "Pyke’s aircraft-carrier scheme used a material invented by a friend, Max Perutz (later to win the Nobel Prize for other researches), which Pyke modestly called “Pykrete”, perhaps an easier name to say than “Perutzcrete”. It was a simple mixture of 86% ice and 14% per cent wood pulp. Despite the name, Pykrete isn’t a fictional material from Star Trek but a real substance made from wood chips and ice with strange and fantastical properties that were actually considered for use in building Royal Navy aircraft carriers during World War II, especially for use in the battle of the Atlantic."}, {"url": "http://www.libertyreferences.com/aircraft-carrier.shtml", "passage_text": "The invention of the aircraft carrier has immensely influenced the USA’s freedoms. The lasting historical impact of the aircraft carrier is huge. The use of the aircraft carrier is so large because of the amount of sea that it is able to use and the use that it has. The invention of the aircraft carrier plays a major role in keeping the world safe for democracy. The invention of the aircraft carrier has played a great role in maintaining the United States of America"}, {"url": "https://en.wikipedia.org/wiki/History_of_the_aircraft_carrier", "passage_text": "This evolution was well underway by the early to mid-1920s, resulting in the commissioning of ships such as Hōshō (1922), HMS Hermes (1924), Bearn (béarn), 1927 and The-lexington class aircraft (carriers). 1927 During the Second World War, these ships would become the backbone of the carrier forces of the US, British, and Japanese navies, known as fleet carriers. World War II saw the first large-scale use of aircraft carriers and induced further refinement of their launch and recovery cycle leading to several design variants."}]