[{"url": "http://work.chron.com/degree-become-high-school-basketball-coach-15746.html", "passage_text": "High school basketball coaches enjoy the opportunity to share their love of the game with a new generation of athletes. Good high school coaches receive recognition and praise, while helping students achieve success and potentially earn college scholarships and notoriety. To work as a high school basketball coach, you generally need a college degree. Certain degrees give coaches a better chance of breaking into the field. These degrees match well with the knowledge base required for coaching high school basketball and for teaching physical education classes. In fact, most sports management and physical education degrees require students to complete courses in coaching."}, {"url": "http://work.chron.com/degree-become-high-school-basketball-coach-15746.html", "passage_text": "Bachelor’s Degree. Most high school coaches also teach at the school, which requires a minimum of a bachelor’s degree. Often, teachers must teach in a field that matches their bachelor's degree area of study. These degrees match well with the knowledge base required for coaching high school basketball and for teaching physical education classes. In fact, most sports management and physical education degrees require students to complete courses in coaching."}, {"url": "http://learn.org/articles/Degrees_in_Basketball_Coaching_Your_Questions_Answered.html", "passage_text": "Certificate programs in athletic coaching give you an overview of what you will need to know as a youth league or high school varsity coach. For example, required courses are likely to include sports officiating, sports management, sports psychology and fitness testing. Although there aren't any degrees specifically offered for aspiring basketball coaches, you will find several certificate and degree programs devoted to athletic coaching and sports administration. These programs offer courses that cover first aid, coaching theories and techniques and organizational communication."}, {"url": "http://study.com/articles/How_to_Become_a_Basketball_Coach_Step-by-Step_Career_Guide.html", "passage_text": "Step 1: Earn a Bachelor's Degree. Prospective basketball coaches who want to work at the high school or college level need a bachelor's degree. Students have the option to pursue programs in exercise and physical education; however, some schools offer degree programs that specialize in coach training."}, {"url": "http://learn.org/articles/Professional_Basketball_Coach_Career_and_Salary_FAQs.html", "passage_text": "Although there is no minimum education requirement to become a professional basketball coach, the U.S. Bureau of Labor and Statistics (BLS) states that many coaches start their careers at the high school or collegiate level (www.bls.gov). A bachelor's degree may be required for these positions. Explore the career requirements for professional basketball coaches. Get the facts about education and training requirements, necessary experience, and salary information to determine if this is the right career for you. Schools offering Athletic Coaching degrees can also be found in these popular choices."}, {"url": "http://work.chron.com/kind-education-need-become-high-school-physical-education-coach-15508.html", "passage_text": "Coaching Classes. Aspiring high school physical education coaches must take classes in the principles of coaching. At York College in Nebraska, for example, students who seek a physical education degree must take 13 hours in a coaching subject area. Whether it’s the rudiments of a team sport, such as basketball, volleyball or softball, or an individualized sport, such as running or swimming, coaches can leave a lasting impression on the lives of their students. Physical education teachers often have training in health education and the specific sports they coach."}, {"url": "http://learn.org/articles/Professional_Basketball_Coach_Career_and_Salary_FAQs.html", "passage_text": "The salary for a collegiate basketball coach varies widely according to the size and success of a school's program. For example, of the 65 teams making the men's National Collegiate Athletic Association (NCAA) tournament in 2014, the highest earning coach made roughly $9.6 million dollars for the 2013-2014 season. Explore the career requirements for professional basketball coaches. Get the facts about education and training requirements, necessary experience, and salary information to determine if this is the right career for you. Schools offering Athletic Coaching degrees can also be found in these popular choices."}, {"url": "http://www.studentscholarships.org/careers_salary/153/education/athletes_coaches_referees_and_related_occupations.php", "passage_text": "To be an athlete, involves extensive training under a coach's supervision and you may also need certification with a particular sports federation. 3. To be a coach, you usually need to complete the national coaching certificate program and have technical knowledge/experience of the sport. You may need a degree in physical education. 4. To be a sports official, you need certification by and registration with a sport governing body or commission. "}, {"url": "http://money.howstuffworks.com/how-to-become-basketball-coach.htm", "passage_text": "1 If you are want to be a high school or college football coach and your degree is not in the field of education you will be required to take education-related courses such as teaching methods and curriculum planning. 2  Fulfill the certification requirements in your state. 1 Earn a college bachelor's degree in education with a minor in sports training or physical education. 2  While in college it would be beneficial if you worked as a volunteer for the local high school basketball team."}]