[{"url": "https://answers.yahoo.com/question/index?qid=20080827094508AAKGSOK", "passage_text": "Best Answer: After one completes 4 years of college, one is considered a 'graduate.' Postgraduate work is any academic study begun after graduation. It is a general term. The first postgraduate degree is a masters degree. After a masters degree, you can work toward a PhD, which is called a doctorate degree. You can also do post doctorate work, which is academic study after you received your PhD. "}, {"url": "http://www.answers.com/Q/What_is_postgraduate_degree", "passage_text": "The two postgraduate degrees are a master's degree and a doctorate degree (PhD). It would take 2-3 years to earn a master's degree. After you earn a master's degree, it would … take about 4-5 years to earn a PhD. Honours degree is really still classified as undergraduate studies as you are completing your degree, but with higher merit than a regular undergraduate degree. Whereas a post … graduate diploma is postgraduate studies and you dont have to do a research project if you dont want."}, {"url": "http://www.allaboutcareers.com/careers-advice/postgraduate-study/what-is-a-postgraduate-degree", "passage_text": "In medieval universities, a master’s degree or doctorate often took 12 years to complete. Blimey! Thankfully though, nowadays you can get a postgraduate qualification in a much shorter time. Generally, a postgraduate degree is a degree which you study for once you have finished a bachelor’s degree. Some postgraduate degrees require the completion of particular bachelor’s degree, others don’t. You could study a subject which is completely new to you, or you could choose a course which builds on what you learned in your bachelor’s degree. Postgraduate certificates or diplomas can provide a route to particular careers, or they can work as a stepping stone towards studying a maste"}, {"url": "http://gradschool.about.com/od/admissionsadvice/g/masters.htm", "passage_text": "A master's degree is a type of graduate degree, degree earned after completion of an undergraduate degree (BA or BS). Typically the master's degree requires about 30 credits of coursework and takes 2 years of full time study beyond the bachelor's degree. "}, {"url": "http://learn.org/articles/What_is_a_Postgraduate_Diploma.html", "passage_text": "While most postgraduate diploma programs require students to have obtained a bachelor's degree prior to enrolling, some will accept an advanced diploma, graduate certificate or significant professional experience instead. "}, {"url": "https://www.ice.cam.ac.uk/faqs/3-credit-faqs/140-what-do-undergraduate-and-postgraduate-mean", "passage_text": "Answer. An undergraduate student is a student who is studying for his/her first degree (usually entitled Bachelor of Arts [BA] or Bachelor of Science [BSc]). There are three levels of undergraduate study equating to first-year, second-year and third-year study"}, {"url": "https://en.wikipedia.org/wiki/Master%27s_degree", "passage_text": "In countries in which a master's degree is a postgraduate degree, admission to a master's program normally requires holding a bachelor's degree, and in the United Kingdom, Canada and much of the Commonwealth, an honours bachelor degree. 1 Post-graduate research master's degree (M.Res., M.A.Res., M.S.Res., M.Phil.) - the Master by Research is designed for those who hold a bachelor's degree with a significant research component and/or have several publications. 2  It is designed for those wishing to pursue higher research."}, {"url": "http://www.allaboutcareers.com/careers-advice/postgraduate-study/what-is-a-postgraduate-degree", "passage_text": "Taught courses. There are two main types of taught courses: master’s degrees and postgraduate diplomas (or certificates). A taught master’s degree usually takes place over one or two years and mostly involves the completion of a dissertation or project. You could study a subject which is completely new to you, or you could choose a course which builds on what you learned in your bachelor’s degree. Postgraduate certificates or diplomas can provide a route to particular careers, or they can work as a stepping stone towards studying a maste"}, {"url": "https://en.wikipedia.org/wiki/Postgraduate_education", "passage_text": "This article is about education upon the completion of a first degree, known as graduate education within North America. For other uses, see Postgraduate training in education (disambiguation) . The academic year for an Australian postgraduate programme is typically two semesters (eight months of study). Requirements for research-based programmes vary among universities. Generally, however, a student is not required to take taught modules as part of their candidacy."}, {"url": "http://www.answers.com/Q/What_is_postgraduate_degree", "passage_text": "A postgraduate degree is a degree you get after your undergraduate degree, so for example a Master's degree or a Ph.D. A postsecondary degree is a degree you get after h … igh school (high school = secondary school), such as a B.A. or B.Sc. A postsecondary degree is usually referred to as an undergraduate degree. Honours degree is really still classified as undergraduate studies as you are completing your degree, but with higher merit than a regular undergraduate degree. Whereas a post … graduate diploma is postgraduate studies and you dont have to do a research project if you dont want."}]