[{"url": "http://www.youtube.com/watch?v=LG0ef9M3FWI", "passage_text": "This feature is not available right now. Please try again later. The iPhone speakerphone is a great feature to use while driving or in a loud area, and it is as simple as touching the Speaker On or Speaker Off icons within the Call interface. Activate the speakerphone feature with the touch of a button with tips from a digital technology specialist in this free video on the iPhone. "}, {"url": "http://www.wikihow.com/Use-the-iPhone-Speakerphone", "passage_text": "1 Use the Home button and multitask to get yourself to the Contacts app, where you can manage your contacts. 2  You can also still place the phone call on Hold, while using the Speakerphone, along with anything else you were able to do with the phone when it was attached to your ear. Tips. 1  You can still access the contacts list while your phone call is in progress over the Speakerphone function. 2  Use the Home button and multitask to get yourself to the Contacts app, where you can manage your contacts."}, {"url": "http://smallbusiness.chron.com/activating-speaker-mode-iphone-62462.html", "passage_text": "Activating Speaker Mode on an iPhone. Turn on speakerphone during a phone call. Justin Sullivan/Getty Images News/Getty Images. The iPhone includes several phone call options such as the ability to mute a call, place a person on hold or add another caller. The call interface also lets you activate the speakerphone. Once activated, your call transmits to your iPhone's external speaker, greatly increasing the call's volume."}, {"url": "http://osxdaily.com/2015/01/19/speaker-phone-default-iphone-calls/", "passage_text": "Now, tapping the Speaker button will turn it off and return the call audio to the earpiece of headset. This basically reverses the traditional iPhone default setting by enabling Speaker Mode automatically, rather than having it off automatically. 1 Open the “Settings” app on the iPhone and head to “General”, then go to “Accessibility”. 2  Look under the Interaction settings for “Call Audio Routing” and tap on it. 3  Change the setting from “Automatic” (the default) to “Speaker” to make speakerphone the default for all calls made to and from the iPhone."}, {"url": "https://discussions.apple.com/thread/2150723?start=0&tstart=0", "passage_text": "What I want to do is to turn the speaker on so that I can lay the phone down to talk/listen while typing. iPhone 8GB, iPhone OS 2.x. Level 9 (60,530 points). just tap the speaker button when you're on a call. "}, {"url": "http://www.ehow.com/how_2080582_use-iphone-speakerphone.html", "passage_text": "Using the Speakerphone in Calls. You can turn on your iPhone's speakerphone when you make a call and the recipient answers, or when you accept an incoming call. In both cases, a menu screen appears on your iPhone. To switch to speakerphone, tap the Speaker button which turns blue when activated. To turn off the speakerphone at any time during a call, tap the button again."}, {"url": "http://www.ehow.com/how_5931442_turn-iphone-speakerphone-feature.html", "passage_text": "Press the Keypad button on the bottom row of the Phone screen to pull up the keypad, then use your index finger to dial the number that you want to call. When it starts ringing, pull the phone away from your ear and look at the screen. Locate the menu in the middle of the screen. In the top right corner is a button that has an image of a speaker on it. Press this button with your index finger and the speakerphone will activate. Have your conversation with the person you just called. When you're done, either hit the speakerphone button again to turn it off, or hit the end call button on the bottom of the screen with your index finger. Instructions. Press the Home button on the bottom of the iPhone to pull up the unlock screen, then slide your index finger across the bottom of the screen at the arrow to unlock the screen. Press the green phone icon (by default, on the bottom row of your applications) to pull up the Phone app."}, {"url": "http://www.wikihow.com/Use-the-iPhone-Speakerphone", "passage_text": "1 You can still access the contacts list while your phone call is in progress over the Speakerphone function. 2  Use the Home button and multitask to get yourself to the Contacts app, where you can manage your contacts. Tips. 1  You can still access the contacts list while your phone call is in progress over the Speakerphone function. 2  Use the Home button and multitask to get yourself to the Contacts app, where you can manage your contacts."}, {"url": "http://www.wikihow.com/Use-the-iPhone-Speakerphone", "passage_text": "Tips. 1  You can still access the contacts list while your phone call is in progress over the Speakerphone function. 2  You can also still place the phone call on Hold, while using the Speakerphone, along with anything else you were able to do with the phone when it was attached to your ear. Tips. 1  You can still access the contacts list while your phone call is in progress over the Speakerphone function. 2  Use the Home button and multitask to get yourself to the Contacts app, where you can manage your contacts."}]