[{"url": "http://www.last.fm/music/Prince/_/Batdance", "passage_text": "Batdance is a song by Prince. It was the first single released from the 1989 soundtrack album 'Batman'. Like many Prince songs, it mixes elements from a variety of genres from pop to dance to rock to soul and so on. It also features a number of audio clips from the film"}, {"url": "http://www.fast-rewind.com/music_batman.htm", "passage_text": "Originally both Prince and Micheal Jackson were asked to write the soundtrack for Batman. Jackson's music would symbolise the more lighthearted side of our caped crusader and Prince's music would be used to symbolise the darker side. Not that his music is miscast, in fact it works wonderfully in Batman, it's just that using Prince's music for the first Batman film was such an original idea that it seemed almost bizarre. But then again, Tim Burton was the director and he is definitely an original man."}, {"url": "http://www.songfacts.com/detail.php?id=2131", "passage_text": "Director Tim Burton asked Prince to contribute songs for his Batman movie (at the time, he was using 1999 and Baby I'm a Star on a temporary soundtrack). Everything that Prince composed for the movie, whether it was used in the film or not, went onto his album, including Batdance.. The Batman movie took in over $250 million in America, second only to Indiana Jones and the Last Crusade in 1989 box office receipts."}, {"url": "http://prince.org/msg/7/388850", "passage_text": "Tim Burtons reaction to Prince's music for Batman. I heard that Tim Burton the director of '89 Batman movie and Jack Nicholson were a big Prince fans but Tim was very dissapointed with the music Prince contributed. Shortly after assuming his new job, Magnoli was contracted by the acclaimed director Tim Burton, who was shooting the movie Batman, with Jack Nicholson in the role of the Joker. While assembling a rough cut, Nicholson and Burton placed two Prince songs -1999 & Baby, I'm A Star-into scenes as background music."}, {"url": "https://en.wikipedia.org/wiki/Batdance", "passage_text": "From Wikipedia, the free encyclopedia.  Batdance  is a song by American musician Prince, from the 1989 Batman soundtrack. Helped by the film 's popularity, the song reached number one in the U.S., becoming Prince's fourth number-one single, and his first since  Kiss  in 1986."}, {"url": "http://www.fast-rewind.com/music_batman.htm", "passage_text": "Prince was asked to create a soundtrack for the film, and after spending a couple of days on the set of batman, was so inspired that he wrote the entire album within a week! -Thanks to Rich Baldwin. Prince, who wrote and performed the songs in the film, did 3 music videos. Scandalous; Batdance and Partyman. All three can be seen on the 2 Disc Special Edition of Batman.  Curiously, the edited 5 minute version is on the DVD, not the full length 7+ minutes. Not that his music is miscast, in fact it works wonderfully in Batman, it's just that using Prince's music for the first Batman film was such an original idea that it seemed almost bizarre. But then again, Tim Burton was the director and he is definitely an original man."}, {"url": "http://www.avclub.com/article/princes-ibatmani-soundtrack-is-not-the-embarrassme-86404", "passage_text": "In Rolling Stone, Burton said he listened to Prince’s music constantly while filming Batman, particularly when conceiving its version of the Joker. He even included “1999” and “Baby I’m A Star” in a rough cut of the movie before Prince was contacted to write an original song or two for the soundtrack. They are hardly instrumental parts of their respective scenes. If you’re not a Prince fan, it’s easy to overlook these songs as mere background noise. Prince’s Batman is more of a commentary on the film and its themes than a functional part of the film."}, {"url": "https://en.wikipedia.org/wiki/Batman_(album)", "passage_text": "Batman is the eleventh studio album by American recording artist Prince and is the soundtrack album to the 1989 film Batman. It was released on June 20, 1989 by Warner Bros. Records. One of the main songs slated for inclusion on Prince's Batman album was the 7:54 Dance with the Devil. The song was pulled at the last minute and replaced with an edited version of the chaotic Batdance, reportedly because Prince deemed Dance with the Devil to be too dark."}, {"url": "http://www.avclub.com/article/princes-ibatmani-soundtrack-is-not-the-embarrassme-86404", "passage_text": "“Batdance” is the most overtly Batman-centric song on the album; part of why it seems so ridiculous now is that it’s so closely related to a film that pop culture subsequently pushed to the side. The rest of the Batman soundtrack is only tangentially related to the film, in spite of Prince’s best efforts. They are hardly instrumental parts of their respective scenes. If you’re not a Prince fan, it’s easy to overlook these songs as mere background noise. Prince’s Batman is more of a commentary on the film and its themes than a functional part of the film."}]