[{"url": "http://www.brittany-ferries.co.uk/guides/ports/caen", "passage_text": "Taxi fares from the terminal to Caen train station range from 30€ during the day (7am to 7pm) to 40€ in the evening (7pm to 7am). Caen International Port, also known as Ouistreham Ferry Port, is the newest port on the Channel. Caen Harbour is 15km north of Caen itself and has direct access onto the autoroute fast road network for a convenient onward journey into France."}, {"url": "http://www.francetravelguide.com/getting-from-paris-to-normandy.html", "passage_text": "For those heading directly to Normandy from the airport, you can be in Normandy within 3 hours of stepping out of CDG. From the airport, take RER Line B for a 30-minute ride to Paris Nord train station. By Air. Because Normandy is located so close to Paris, it is definitely not worth flying from Paris to this region of France. For those coming to Normandy from an international destination, it is probably best to fly into Charles de Gaulle Airport in Paris and then hop on the train to Normandy from there."}, {"url": "https://en.wikipedia.org/wiki/Oslo_Airport_Station", "passage_text": "Located on the Gardermoen Line, it is served by the Airport Express Trains, express trains to Trondheim and Oslo, regional trains to Lillehammer and Skien (via Oslo) and commuter trains to Eidsvoll and Kongsberg (via Oslo). The station is located 48 kilometres (30 mi) from Oslo Central Station. The station is manned, and there is a single bus route, and several coach services, to and from the airport. It opened in 1998, along with the new airport. During 2000–2001, there were several derailments at the station. South of the station is a terminal for unloading freight trains carrying aviation fuel. "}, {"url": "http://www.brittany-ferries.co.uk/guides/ports/caen", "passage_text": "By train. The nearest railway station is in Caen, about 18km from the port. Regular services depart from Caen train station and a direct TGV service operates to Paris St Lazare, with the fastest service only taking 1 hour and 48 minutes. There are usually taxis waiting outside the terminal for ship arrivals and departures. Caen International Port, also known as Ouistreham Ferry Port, is the newest port on the Channel. Caen Harbour is 15km north of Caen itself and has direct access onto the autoroute fast road network for a convenient onward journey into France."}, {"url": "http://gofrance.about.com/od/lownormandyregion/qt/How-to-get-to-Caen-in-Normandy.htm", "passage_text": "Getting to Caen by plane. Caen Airport is just outside Carpiquet, 7km west of the city. It’s a small modern airport with some UK flights and flights from most major destinations in France as well as other European countries. The major carrier is Air France and its subsidiary Brit Air. High-speed TER and Intercite trains with one change. 1  From Lille (which connects with Eurostar) to Caen station in 3 hrs 41 mins. 2  From Charles de Gaulle Airport to Caen station in 2 hrs 06 mins."}, {"url": "http://gofrance.about.com/od/lownormandyregion/qt/How-to-get-to-Caen-in-Normandy.htm", "passage_text": "Seasonal timetables operates. The ferry terminal at Ouistreham is 15 kilometers north of Caen. 1  From Caen there is direct access on the A13 to Rouen (67 miles/108 kilometers). 2  There is also direct access to the A84 to Le Mont St Michel and Brittany, and south on the N158 to Le Mans. High-speed TER and Intercite trains with one change. 1  From Lille (which connects with Eurostar) to Caen station in 3 hrs 41 mins. 2  From Charles de Gaulle Airport to Caen station in 2 hrs 06 mins."}, {"url": "http://wikitravel.org/en/Caen", "passage_text": "It is a short train ride from Caen to Bayeux. From Bayeux train station, you can catch a bus to some of the D-Day beaches. On the bus website [1] there is a map of the bus route to the D-Day beaches. Bus No. 70 takes you to Omaha beach, the American cemetery, and to Pointe Du Hoc. By train [edit]. Trains leave about every 2 h from Paris Saint-Lazare station to Caen and Cherbourg. It lasts about 2 h long and costs 33.30 €. If you book early, you can get tickets as cheap as 15 €. Out of rush hours, tickets cost 22.40 € for people under 25"}, {"url": "http://gofrance.about.com/od/lownormandyregion/qt/How-to-get-to-Caen-in-Normandy.htm", "passage_text": "Caen is on the high-speed line from Paris to Cherbourg. Direct trains include. 1  Paris to Caen station in 1hrs 46 mins. 2  Cherbourg to Caen station in 1 hr 12 mins. 3  Rouen to Caen station in 1hr 37 mins. High-speed TER and Intercite trains with one change. 1  From Lille (which connects with Eurostar) to Caen station in 3 hrs 41 mins. 2  From Charles de Gaulle Airport to Caen station in 2 hrs 06 mins."}, {"url": "http://gofrance.about.com/od/lownormandyregion/qt/How-to-get-to-Caen-in-Normandy.htm", "passage_text": "Trains to Caen leave from Paris Gare Saint Lazare (13 rue Amsterdam, Paris 8) all through the day. Metro lines to and from Gare Saint Lazare. 1  Ligne 3: Porte de Levallois-Becon to Gallieni. High-speed TER and Intercite trains with one change. 1  From Lille (which connects with Eurostar) to Caen station in 3 hrs 41 mins. 2  From Charles de Gaulle Airport to Caen station in 2 hrs 06 mins."}]