[{"url": "http://symptomsonline.org/symptoms-of-pregnancy/hiccups-during-pregnancy/", "passage_text": "Although hiccups are not a common symptom of pregnancy, they may be experienced at any time during your pregnancy. More than likely they will occur lat the first trimester or early in the second trimester. During pregnancy your lungs will inhale and exhale 30 to 40% more air with each breath. More than likely you are breathing a little faster. More than likely this physiologically change plays a part in any hiccups experienced"}, {"url": "http://www.ithinkimpregnant.net/pregnancy_hiccups/pregnancy_hiccups.html", "passage_text": "Hiccups at any time can be aggravating, but pregnancy and hiccups seem to go hand in hand. Even though they are not necessarily a symptom of pregnancy, or even a common complaint, it does appear that women are more susceptible to getting them while they are pregnant. This can cause the hiccups to form. You can also get hiccups from acid reflux, which tends to be stronger during pregnancy. The acid reflux can also result in the heartburn that you might be feeling, too. Although you might not necessarily feel the acid, the reflux can still cause the hiccups."}, {"url": "https://answers.yahoo.com/question/index?qid=20070608120955AAuZ4MT", "passage_text": "Not at all. I have hiccups all the time, while pregnant and not. Men can hiccup, too. Hiccups are caused by a spasm of the diaphragm, the muscle below the lungs which allows us to breathe. It has nothing to do with pregnancy. Hi I was wondering if hiccups are one of the early symptoms of pregnancy...even before the missed period. I know with my first pregnacy this wasn't an issue, but I have a buddy who swears its a sign, and since I NEVER have the hiccups, and now I do...well...it would just be nice to see what everyone else has to..."}, {"url": "http://symptomsonline.org/symptoms-of-pregnancy/hiccups-during-pregnancy/", "passage_text": "Hiccups are annoying! Although they are not a common symptom of pregnancy, it appears that you may be more susceptible to experiencing hiccups during pregnancy. During pregnancy your lungs will inhale and exhale 30 to 40% more air with each breath. More than likely you are breathing a little faster. More than likely this physiologically change plays a part in any hiccups experienced during your"}, {"url": "http://www.nhs.uk/Conditions/Hiccup/Pages/Causes.aspx", "passage_text": "Causes of hiccups. Hiccups occur when your diaphragm (the thin layer of muscle that separates your chest cavity from your abdomen) suddenly and involuntarily contracts (tightens). As your diaphragm contracts, it causes you to breathe air in very quickly. "}, {"url": "http://www.webmd.com/digestive-disorders/hiccups-chronic", "passage_text": "Some illnesses for which continuing hiccups may be a symptom include: pleurisy of the diaphragm, pneumonia, uremia, alcoholism, disorders of the stomach or esophagus, and bowel diseases. Hiccups may also be associated with pancreatitis, pregnancy, bladder irritation, liver cancer or hepatitis. "}, {"url": "http://optionline.org/pregnant/", "passage_text": "If you are wondering whether or not you’re pregnant, your mind is probably racing with questions. It’s common to feel confused, scared or overwhelmed. Common symptoms of pregnancy include a late or missed period, tender or swollen breasts, frequent urination, fatigue, and nausea. The first step to take to see if you might be pregnant is to take a pregnancy test."}, {"url": "https://answers.yahoo.com/question/index?qid=20070608120955AAuZ4MT", "passage_text": "Hi I was wondering if hiccups are one of the early symptoms of pregnancy...even before the missed period. I know with my first pregnacy this wasn&#39;t an issue, but I have a buddy who swears its a sign, and since I NEVER have the hiccups, and now I do...well...it would just be nice to see what... Hi I was wondering if hiccups are one of the early symptoms of pregnancy...even before the missed period. I know with my first pregnacy this wasn't an issue, but I have a buddy who swears its a sign, and since I NEVER have the hiccups, and now I do...well...it would just be nice to see what everyone else has to..."}, {"url": "http://www.m.webmd.com/a-to-z-guides/tc/hiccups-topic-overview", "passage_text": "Hiccups occur when a spasm contracts the diaphragm, a large sheet of muscle that separates the chest cavity from the abdominal cavity. This spasm causes an intake of breath that is suddenly stopped by the closure of the vocal cords (glottis). This closure causes the characteristic hiccup sound. Both persistent and intractable hiccups may be a sign of a more serious health problem and must be checked by a doctor. There are many known causes of persistent or intractable hiccups, including: 1  Central nervous system problems, such as cancer, infections, stroke, or injury."}, {"url": "https://answers.yahoo.com/question/index?qid=20070608120955AAuZ4MT", "passage_text": "Best Answer: Okay, this is a stretch, but gas is definitely a pregnancy sign, so if you have bloating and gas and hiccups then maybe. But I would think that's stretching it. Hiccups in and of themselves are probably not an early pregnancy sign. If you had them with your first pregnancy, then maybe that would be a quirk for you (I know someone who got a yeast infection with both of her pregnancies early on, so this was a sign for her). Hi I was wondering if hiccups are one of the early symptoms of pregnancy...even before the missed period. I know with my first pregnacy this wasn't an issue, but I have a buddy who swears its a sign, and since I NEVER have the hiccups, and now I do...well...it would just be nice to see what everyone else has to..."}]