[{"url": "http://www.laserhairremovalbysia.com.au/ingrown-hair-removal", "passage_text": "Ingrown hair removal has always been a tricky issue. After all, ingrown hairs are often the result of traditional methods of trying to eliminate the strands that appear on the skin in the first place."}, {"url": "http://www.myingrownhairtreatment.info/laser-pros-cons.html", "passage_text": "Highly Effective for Ingrowns and Coily Hair. Laser hair removal is especially useful for treating ingrown hairs, especially for people with dark coily hair. The laser is most effective for dark hairs because the melanin contained in the hair structure is the pathway that the energy from the laser travels."}, {"url": "http://www.dermanetwork.org/question/would-laser-hair-removal-help-with-ingrown-hairs2-3937#!", "passage_text": "Laser hair removal is an excellent procedure to clear hairs and thereby reducing the incidence of ingrown hairs."}, {"url": "http://www.skinmds.com/hair/ingrown-hair/laser-hair-removal.htm", "passage_text": "Lasers can now effectively remove in-grown hairs, known as hair bumps or pseudofolliculitis barbae. We have many such lasers that are FDA approved to treat this distressing condition. Patients see noticeable results after just one session, and best of all, the reduction of in-grown hairs are permanent."}, {"url": "http://www.laserhairremovalbysia.com.au/ingrown-hair-removal", "passage_text": "A laser treatment kills the hair follicle, so that it can no longer support hair growth. Following your session, the damage caused by the wayward follicle will heal naturally. Even if it had unfortunately become infected, a single session can kick start the healing process and you will see results almost immediately."}, {"url": "http://cosmeticlaserskinsurgery.com/laser-hair-removal/", "passage_text": "Laser hair removal ends the costly repetitive procedures of shaving, tweezing, chemical depilatories, waxing and electrolysis. Based on technology that has been used for nearly a decade, laser hair removal is safe and effective. You will see significant hair reduction of up to 85% to 90% after four treatments."}, {"url": "http://www.hairremoval.org/laser-hair-removal-for-ingrown-hairs/", "passage_text": "While most remedies are usually temporary, laser hair removal is probably the only permanent solution. Given that the person who performs the treatment is experienced enough, laser hair removal is a safe procedure that can treat ingrown hairs with high success. Laser hair removal works by holding a laser device against the skin, one second at a time, until the whole area has been treated."}]