[{"url": "http://orgasmicreactionsaroundchocolate.com/how-many-antioxidants-or-orac-do-we-need-daily/", "passage_text": "How many antioxidants or ORAC do we need daily. The USDA measures antioxidants on a scale called The ORAC Scale (Oxygen Radical Absorbance Capacity, not Orgasmic Reactions Around Chocolate)."}, {"url": "http://organicpassion.info/how-much-antioxidant-do-we-need/", "passage_text": "Nutritionists recommend that we consume around 5000 ORAC units per day to significantly impact antioxidant activity in the body. According to scientific studies, one serving of fruits or vegetables contain 500 ORAC units."}, {"url": "http://www.health-herbal.com/html/orac.html", "passage_text": "The recommended daily antioxidant dose should add up to 5000 ORAC units each day. Looking at Table 1 below, it is clear that one has to be quite selective in the foods chosen so as to easily achieve this. If you at bananas alone, you would need to eat 2.4 kilograms of bananas to get your daily ORAC dose!"}, {"url": "http://www.funwithhealthyfood.com/how-much-chia-seeds-per-day.html", "passage_text": "The first approach you can have about how much chia seeds per day you should eat, is to start out with a small amount, let's say about a teaspoon per day, for a couple days, and see how your body reacts."}, {"url": "http://www.funwithhealthyfood.com/how-much-chia-seeds-per-day.html", "passage_text": "The Consult A Doctor Approach. Another way you can determine how much chia seeds per day you should consume is to consult with a doctor or medical practitioner. They may ask you questions about your health, and based on your responses, they could recommend a certain dosage of chia seeds that would be safe for your body."}, {"url": "http://www.raysahelian.com/oracvalue.html", "passage_text": "ORAC unit dosage recommendations The USDA recommends an ORAC unit ingestion of about 3,000 to 5,000 units daily. ORAC Value Research-Assay Molecules. 2013. Oxygen radical absorbance capacity of different varieties of strawberry and the antioxidant stability in storage."}, {"url": "http://orgasmicreactionsaroundchocolate.com/how-many-antioxidants-or-orac-do-we-need-daily/", "passage_text": "The USDA website recommends a Daily Allowance Intake Range of at LEAST 3,000-5,000 ORAC. The optimal daily recommended ORAC intake is 12,000 ORAC points. The Average American gets only 800 ORAC points per day."}, {"url": "http://drjockers.com/how-much-coconut-oil-should-you-consume-daily/", "passage_text": "Based on body size, an average adult of 150 lbs should consume about 3 ½ tablespoons of coconut oil daily. Taking this amount of coconut oil for your body weight should be enough to benefit from the MCT’s. Fortunately, the immune boosting and anti-microbial effects of MCT’s are accumulative (9)."}, {"url": "http://organicpassion.info/how-much-antioxidant-do-we-need/", "passage_text": "Consuming 5 servings of fruits and vegetables is already a huge challenge let alone to consume 10 servings. However, do not fret, you do not need to consume 8 kilos of blueberries to get that 5000 ORAC units a day. There are supplements and health products in the market to help you to obtain the"}]