[{"url": "http://www.nationsonline.org/oneworld/map/google_map_Seattle.htm", "passage_text": "Satellite view showing the city of Seattle, Washington State in the United States, located on a land neck between Elliott Bay (Puget Sound) and Lake Washington. The Olympic Mountains in west and the Cascade Range with Mount Rainier in east stand sentinel over the city. The page shows a city map of Seattle with expressways, main roads and streets, zoom out to find Seattle-Tacoma International Airport (IATA code: SEA) south of Central District, in a distance of 22 km (14 mi) by road. To find a location use the form below. To view just the map, click on the Map button."}, {"url": "http://www.worldatlas.com/na/us/wa/where-is-seattle.html", "passage_text": "Location of Seattle on a map. Seattle is a city found in Washington, The United States Of America. It is located 47.61 latitude and -122.33 longitude and it is situated at elevation 56 meters above sea level. Seattle has a population of 608,660 making it the biggest city in Washington. It operates on the PDT time zone"}, {"url": "https://en.wikipedia.org/wiki/Seattle", "passage_text": "Logging was Seattle's first major industry, but by the late 19th century the city had become a commercial and shipbuilding center as a gateway to Alaska during the Klondike Gold Rush. By 1910, Seattle was one of the 25 largest cities in the country. However, the Great Depression severely damaged the city's economy. With a land area of 83.9 square miles, Seattle is the northernmost city with at least 500,000 people in the United States, farther north than Canadian cities such as Toronto, Ottawa, and Montreal, at about the same latitude as Salzburg, Austria. The topography of Seattle is hilly."}, {"url": "http://www.whereig.com/usa/states/washington/seattle-location-map.html", "passage_text": "Seattle is the northernmost major city on the mainland of the United States and the largest city of Washington State that situated nearby the narrow isthmus between Puget Sound and Lake Washington. The city is located merely about 140 miles south of Vancouver city of British Columbia Canada. Interestingly, in the past Seattle was known with the name of Queen City; however, in the present, the official nickname of the city is the Emerald City."}, {"url": "http://www.whereig.com/usa/states/washington/seattle-location-map.html", "passage_text": "Name of the city i.e. Seattle is given after Chief Sealth Seattle of the Duwamish and Suquamish native tribes. The city is located merely about 140 miles south of Vancouver city of British Columbia Canada. Interestingly, in the past Seattle was known with the name of Queen City; however, in the present, the official nickname of the city is the Emerald City. Seattle is also recognized as the Gateway to Alaska, Rain City and Jet City. The inhabitants of Seattle are known as Seattleites. Moreover, Seattle became the first 'climate neutral city' by setting the goal of reaching zero net per capita greenhouse gas emissions by 2030 as per the report of February 2010"}, {"url": "http://www.mapsofworld.com/usa/states/washington/seattle-city-map.html", "passage_text": "The Washington State Ferries manages the ferry network in the city. Seattle is also a pedestrian friendly city and according to Walk Score it is the fifth most walkable of the 50 largest cities in the United States. Seattle has quite a few beach parks such as the Matthews Beach Park and the Richmond Beach Saltwater Park. Seattle is also known for its beautiful lakes including Green Lake, Halter Lake, Bitter Lake, and Lake Union. Take a walk around this beautiful city and experience the serenity it has to offer."}, {"url": "http://wikitravel.org/en/Seattle", "passage_text": "Seattle is a huge city with several district articles containing sightseeing, restaurant, nightlife and accommodation listings — have a look at each of them. Seattle, Washington, [1] is the largest city in the Pacific Northwest. 1 Everett lies about 25 miles north of Seattle on I-5 and is home to the Boeing factory-a massive building where 747, 767, 777, and 787 airliners are made-tours are available. 2  The Mountains to Sound Greenway via I-90 is the quickest escape from the city into the nearby Cascade mountains."}, {"url": "http://www.answers.com/Q/Where_is_Seattle", "passage_text": "1 It is Seattle that rules the Northwest region in terms of am…. 2  5 Waterfront Dining Establishments in Seattle Seattle is located in King County, Washington. 3  It is a seaport city with over 600,000 residents. 4  It is the Pacific Northwest's largest city. 1 5 Tasty North Seattle Restaurants The top cities within the United States know that it is important to offer some of the best cuisine in the world. 2  It is Seattle that rules the Northwest region in terms of am…. 3"}, {"url": "https://en.wikipedia.org/wiki/Seattle", "passage_text": "With an estimated 668,342 residents as of 2014, Seattle is the largest city in both the state of Washington and the Pacific Northwest region of North America, and, as of July 2013, is the fastest-growing major city in the United States. With a land area of 83.9 square miles, Seattle is the northernmost city with at least 500,000 people in the United States, farther north than Canadian cities such as Toronto, Ottawa, and Montreal, at about the same latitude as Salzburg, Austria. The topography of Seattle is hilly."}]