[{"url": "https://answers.yahoo.com/question/index?qid=20090820052302AAoiiOa", "passage_text": "But, it does depend on where you live and how clean you keep your hair. If someone is washing their hair once each week or two, then spiders and other critters that creep and crawl common to your area where you live might take up living in your hair. You normally carry dust mites are part of the Normal Human ecosystem."}, {"url": "http://mitetreatments.com/spider-mites/", "passage_text": "Spider mites are plant dwelling arthropods that live on the undersides of leaves and spin silk webs to protect their eggs. They have tiny mouth parts designed to suck chlorophyll from microscopic plant cells. They can inflict significant damage to plant and tree life, but they don’t often bite humans."}, {"url": "http://www.nuketown.com/hoaxes/return-of-the-scalp-eating-braid-inhabiting-spiders", "passage_text": "When she removed the hair piece and let the braids loose, there was a spider in the child's hair. The spider had laid eggs in the child's hair and the spiders were eating her scalp. The child was rushed to the hospital were she later died."}, {"url": "http://urbanlegends.about.com/od/horrors/a/fatal_hairdo.htm", "passage_text": "The teacher assumed that the braids were too tight in the child's hair and attempted to let the ponytail down. When she removed the hair piece and let the braids loose, there was a spider in the childs hair. The spider had laid eggs in the childs hair and the spiders were eating her scalp."}, {"url": "http://www.answers.com/Q/Can_spiders_live_on_a_human_hair", "passage_text": "Answered by The Community. Making the world better, one answer at a time. yes because if you or someone else in the world never brushes their hair or has dread locks red back spiders will live on your hair and if you try get them out they will bite your head and kill you that's what i personally think SO....."}, {"url": "https://answers.yahoo.com/question/index?qid=20100714063034AAuWe4X", "passage_text": "Best Answer: No. they can't live in your hair. One time there was a spider in my hair but i got it out. don't worry about spiders, worry about lice!!!!!!"}, {"url": "http://www.huffingtonpost.com/2012/08/09/spider-living-ear-canal-photo-_n_1761304.html", "passage_text": "In what can only be described as a nightmare-come-true, a spider crawled inside a woman's ear canal and lived there for five days before doctors extracted it. The woman, referred to only as Ms. Lee, arrived at China's Changsha Central Hospital of Otolaryngology and Head and Neck Surgery on Aug. 8, RedNet News notes."}]