[{"url": "http://www.liutilities.com/how-to/get-a-computer-out-of-safe-mode/", "passage_text": "If still unsuccessful, allow the machine to boot into Safe Mode. Click on the 'Start' button and choose the 'Control Panel' option. Step 6. Click on the 'Performance and Maintenance' category and click on the 'System' icon. Repeat Step 2; this should boot the system in Normal Mode. Step 8. If the computer system entered Safe Mode via the System Configuration utility, then it can only boot in Normal Mode using the same tool. Click on the 'Start' button and choose 'All Programs'. Click on the 'System Tools' category and select the 'System Information' option. Step 9"}, {"url": "http://www.howcast.com/videos/415555-How-to-Get-a-PC-Out-of-Safe-Mode/", "passage_text": "In the text box, type “msconfig” and press Enter.Select the Boot.ini tab in the new window and then uncheck “/SafeBoot.” Reboot your computer and it should start in Normal Mode. Step 3 Click Start Click on the Start button and select Shut Down. When the menu prompts, select Shut Down. Step 4 Reboot the computer Reboot your computer if it continues to start in Safe Mode. While it’s rebooting and the Windows logo is displayed, press the F8 key to display the reboot options"}, {"url": "http://www.youtube.com/watch?v=0P8aqsZq0bA", "passage_text": "Allow your computer to boot in Safe Mode if it still doesn't boot in Normal Mode. Click Start and select Control Panel. Select System and Security, and then click Restore your computer to an earlier time in the Action Center field. Step 6: Navigate to System Properties. Click on Performance and Maintenance. Make sure your computer is actually in Safe Mode. People sometimes suspect their machine is in Safe Mode because of incorrect video settings. If the PC is in Safe Mode, your monitor will say Safe Mode in each corner. Step 2: Enter msconfig in Run. Click on Start and go to Accessories or to the side bar and click Run."}, {"url": "http://www.computerhope.com/issues/chsafe.htm", "passage_text": "Windows 95 users. To get into Windows 95 Safe Mode, as the computer is booting, when you either hear a beep or when you see the message Starting Windows 95.. Press your F8 key on the top of your keyboard. If done properly, you should see the Windows 95 Startup Menu screen, similar to the example below. To get into the Windows 2000 and XP Safe mode, as the computer is booting, press and hold your F8 Key, which should bring up the Windows Advanced Options Menu screen as shown below. Use your arrow keys to move to highlight the Safe Mode option and press your Enter key."}, {"url": "http://www.howcast.com/videos/415555-How-to-Get-a-PC-Out-of-Safe-Mode/", "passage_text": "Select the point you want to restore to in Windows 7, click Next, and then Restore. Step 8 Navigate to the System Configuration utility Click the Start button, select All Programs, and then select the System Tools category if you’re still booting in Safe Mode. Then select the System Information option. Step 3 Click Start Click on the Start button and select Shut Down. When the menu prompts, select Shut Down. Step 4 Reboot the computer Reboot your computer if it continues to start"}, {"url": "http://www.computerhope.com/issues/chsafe.htm", "passage_text": "To get into Windows 98 and ME Safe Mode, press and hold either the F8 or Ctrl key as the computer is booting up. If done properly, you should see the Windows 98 Startup Menu or Windows ME Startup Menu screen, similar to the example below. In this menu, choose option 3 by pressing the 3 key and then pressing Enter. To get into the Windows 2000 and XP Safe mode, as the computer is booting, press and hold your F8 Key, which should bring up the Windows Advanced Options Menu screen as shown below. Use your arrow keys to move to highlight the Safe Mode option and press your Enter key."}, {"url": "http://www.youtube.com/watch?v=0P8aqsZq0bA", "passage_text": "Reboot your computer and it should start in Normal Mode. Step 3: Click Start. Click on the Start button and select Shut Down. When the menu prompts, select Shut Down. Step 4: Reboot the computer. Reboot your computer if it continues to start in Safe Mode. Make sure your computer is actually in Safe Mode. People sometimes suspect their machine is in Safe Mode because of incorrect video settings. If the PC is in Safe Mode, your monitor will say Safe Mode in each corner. Step 2: Enter msconfig in Run. Click on Start and go to Accessories or to the side bar and click Run."}, {"url": "http://www.techsupportalert.com/content/how-get-safe-mode-windows-xpvista7.htm", "passage_text": "Trying to get to Safe Mode by using the F8 key can be frustrating and there is another way that uses the System Configuration Utility (msconfig). System Configuration Utility in Windows XP. 1. Open the Start menu and click “Run.”. 2. In the Run box, enter “msconfig” (without quotes). 7. Restart the computer. The system should open in Safe Mode. When finished using Safe Mode, open msconfig again and remove the check by /SAFEBOOT. Otherwise, you will continue to open in Safe Mode whenever you boot. System Configuration Utility in Windows 7/Vista. 1. Open the Start menu. 2"}]