[{"url": "http://pets.webmd.com/dogs/guide/car-chasing-break-dogs-habit", "passage_text": "Prevention. To prevent your dog from ever starting to chase cars, you need to catch the first moment he shows interest in the motion of the car and redirect his attention to you-something else fun! If you have a dog who already has a problem chasing cars, consult with a Certified Applied Animal Behaviorist (CAAB), a board-certified veterinary behaviorist or a Certified Professional Dog Trainer (CPDT). (Please see our article, Finding Professional Help, to help you locate a professional in your area.)."}, {"url": "http://animals.howstuffworks.com/pets/how-to-solve-dog-behavioral-problems3.htm", "passage_text": "Stopping a Dog from Chasing Cars. I'm not so concerned about Old Blue chasing cars, starts the old joke, it's when he brings 'em home and buries 'em in the yard that I start to get worried.Dusty jokes aside, car chasing is a problem for some dogs."}, {"url": "https://hdwebpros.com/blog/how-to-break-your-dog-from-chasing-cars.html", "passage_text": "While you undergo changing your dog’s car chasing behavior, you should consider an invisible fence to help reinforce the idea that while outside, your dog needs to stay in your yard. If you have a tree in the front yard or something else sturdy, you can also tie your dog up with enough slack to enjoy exploring the yard. Make sure you use a strong enough rope or material to keep your dog in place, even when temptations arise. Training. While the above steps can be taken immediately, it is important to also teach your dog to stop chasing when you do not want him to. The best way to do this is to hone in on the command “come.. Once your dog masters this skill he should always fall back and come to you based on your voice command."}, {"url": "http://pets.webmd.com/dogs/guide/car-chasing-break-dogs-habit", "passage_text": "Some dogs like to chase fast-moving things, including motor vehicles. They see a car moving in the distance, and they simply have to give chase. Some dogs are so motivated to chase cars that they’ll even lie in wait at the side of the road or in a ditch and, as a car approaches, they’ll leap out to head it off. If you have a dog who already has a problem chasing cars, consult with a Certified Applied Animal Behaviorist (CAAB), a board-certified veterinary behaviorist or a Certified Professional Dog Trainer (CPDT). (Please see our article, Finding Professional Help, to help you locate a professional in your area.)."}, {"url": "http://www.dogbreedinfo.com/carchase.htm", "passage_text": "This basic obedience training will do wonders for your dog. Teach your dog to only chase what he can bring back to you. Just about all dogs like to chase; it is in their nature. From chasing game to trial criminal chasing, to a dog a car is no different than a huge rabbit. Putting in an underground electric or above-ground fence is your best bet. But if this is not possible or you would like to have your dog out with you outside the fence, you can try using a shock collar with a hand-held control. When the dog chases after a car you shock him. Do not say he word no when"}, {"url": "http://www.dogbreedinfo.com/carchase.htm", "passage_text": "If you can get your dog obedience trained well enough you can train him to stop on command, but if you are not paying attention when the car drives by you may be too late in stopping your dog. Doing special car chasing training is wise if your dog is a car chaser. Putting in an underground electric or above-ground fence is your best bet. But if this is not possible or you would like to have your dog out with you outside the fence, you can try using a shock collar with a hand-held control. When the dog chases after a car you shock him. Do not say he word no when"}, {"url": "http://pets.webmd.com/dogs/guide/car-chasing-break-dogs-habit", "passage_text": "Although chasing is a natural inclination in many dogs, if you can interrupt your dog’s behavior and teach him that doing something else-such as turning toward you-is more enjoyable than chasing cars, you can nip chasing in the bud before it becomes a habitual problem. If you have a dog who already has a problem chasing cars, consult with a Certified Applied Animal Behaviorist (CAAB), a board-certified veterinary behaviorist or a Certified Professional Dog Trainer (CPDT). (Please see our article, Finding Professional Help, to help you locate a professional in your area.)."}, {"url": "https://hdwebpros.com/blog/how-to-break-your-dog-from-chasing-cars.html", "passage_text": "Attention and Exercise. Sometimes dogs are more inclined to chase cars because they have pent-up energy and they have a natural desire to chase. By giving your dog extra attention and plenty of exercise, you can help curb this extra need to chase something. Even better, incorporate chase in play time! Training. While the above steps can be taken immediately, it is important to also teach your dog to stop chasing when you do not want him to. The best way to do this is to hone in on the command “come.. Once your dog masters this skill he should always fall back and come to you based on your voice command."}, {"url": "http://pets.webmd.com/dogs/guide/car-chasing-break-dogs-habit?page=2", "passage_text": "Prevention continued... Not all dogs who chase cars from inside a fenced yard will also chase cars when they’re loose. But some will as the thrill of the chase becomes too strong to ignore. In addition, some dogs get so excited running the fence that they can hurt themselves or jump the fence. Chasing cars from inside a fence can also develop into chasing other things, like joggers or skateboarders, when they pass the yard. If there is virtually no chance that your dog can get out of the yard and your dog doesn’t show any interest in chasing other moving things, car chasing from inside a fenced area is relatively “safe” and good exercise for an understimulated (bored or underexercised) dog."}]