[{"url": "http://www.ucmp.berkeley.edu/mammal/marsupial/marsupial.html", "passage_text": "Marsupial Mammals. Marsupials are the group of mammals commonly thought of as pouched mammals (like the wallaby and kangaroo at left). They give live birth, but they do not have long gestation times like placental mammals. Thylacinus, an extinct marsupial wolf. Though marsupials today do not have as many species as do the placental mammals, they are quite structurally diverse. They range from small four-footed forms like the marsupial mole, Notoryctes, to the large two-legged kangaroos."}, {"url": "http://animals.mom.me/list-marsupial-animals-2371.html", "passage_text": "Possums, which are tree-dwellers, are the most widespread marsupial. Like Tasmanian devils, possums give birth to as many as 20 offspring, but only a few survive. There are 13 species of possums in Australia. North America is home to one species, the Virginia opossum, known to play dead when threatened by a predator. List of Marsupial Animals. At six feet tall, Australia's red kangaroo is the planet's largest marsupial. Tom Brakefield/Stockbyte/Getty Images. Marsupials are mammals that give birth to underdeveloped embryos, which then climb from the birth canal into a pouch on the front of the mother's body."}, {"url": "http://www.merriam-webster.com/dictionary/marsupial", "passage_text": "Full Definition of MARSUPIAL. : any of an order (Marsupialia) of mammals comprising kangaroos, wombats, bandicoots, opossums, and related animals that do not develop a true placenta and that usually have a pouch on the abdomen of the female which covers the teats and serves to carry the young."}, {"url": "http://www.answers.com/Q/What_are_marsupials", "passage_text": "Although a mammal with a pouch is always a marsupial (with the exception of the echidna, which develops a rudimentary pouch during breeding season), not all marsupials have pouches, for example, the numbat of Western Australia. All marsupials are mammals, but not all mammals are marsupials. Penguins are not marsupials, or even mammals. They are members of the bird family, sharing bird characteristics of laying eggs, having feathers (of sorts), and being warm-bloo … ded vertebrates that breathe through lungs. There is only one type of marsupial bird, and it is not a true marsupial"}, {"url": "http://animals.about.com/od/marsupials/p/marsupials.htm", "passage_text": "Marsupials (Marsupialia) are a group of mammals that like most other groups of mammals bear live young when the embryos are in an early stage of development. By Laura Klappenbach. Marsupials (Marsupialia) are a group of mammals that like most other groups of mammals bear live young when the embryos are in an early stage of development. In some species such as the bandicoot, the gestation period is as short as 12 days."}, {"url": "http://www.answers.com/Q/What_are_marsupials", "passage_text": "Marsupials are mammals and, like all mammals, they are warmblooded vertebrates, which breathe using lungs (rather than gills), and are covered with skin, fur or hair. Mammals, including marsupials, suckle their young on mothers' milk. Marsupials are mammals with pouches in which they rear their young. Penguins are not marsupials, or even mammals. They are members of the bird family, sharing bird characteristics of laying eggs, having feathers (of sorts), and being warm-bloo … ded vertebrates that breathe through lungs. There is only one type of marsupial bird, and it is not a true marsupial"}, {"url": "https://en.wikipedia.org/wiki/Marsupial", "passage_text": "Marsupials are an infraclass of mammals living primarily in Australasia and the Americas. A distinctive characteristic, common to most species, is that the young are carried in a pouch. Well-known marsupials include kangaroos, wallabies, the koala, possums, opossums, wombats and the Tasmanian devil. Other marsupials include the numbat, bandicoots, bettongs, the bilby, quolls, and the quokka. Marsupials represent the clade originating with the last common ancestor of extant metatherians"}, {"url": "https://en.wikipedia.org/wiki/Marsupial", "passage_text": "Taxonomically, the two primary divisions of Marsupialia traditionally are: American marsupials and the Australian marsupials. However, the order Microbiotheria (which has only one species, the monito del monte) is found in South America, but is believed to be more closely related to the Australian marsupials. Well-known marsupials include kangaroos, wallabies, the koala, possums, opossums, wombats and the Tasmanian devil. Other marsupials include the numbat, bandicoots, bettongs, the bilby, quolls, and the quokka."}]