[{"url": "http://www.w5qx.org/download_license.html", "passage_text": "Download a copy of your amateur radio license from the FCC. 1. Go to http://wireless2.fcc.gov/UlsApp/UlsSearch/searchLicense.jsp 2. Search for your call sign. 3. Click on your call sign. 4. Click on the ADMIN tab 5. Click on Authorization -- Licensee 6. Your reference copy license will open in a PDF file for printing or saving. This is a lot easier than making photo copies of your original for posting on things like repeaters, digis, etc."}, {"url": "https://www.fcc.gov/help/requesting-duplicate-license-universal-licensing-system-uls", "passage_text": "This article provides information on how to request a Duplicate License in the Universal Licensing System (ULS). You are about to leave the FCC website and visit a third-party, non-governmental website that the FCC does not maintain or control. The FCC does not endorse any product or service, and is not responsible for, nor can it guarantee the validity or timeliness of the content on the page you are about to visit."}, {"url": "http://n4ser.org/2015/license-how-to-print-the-official-copy-and-more/", "passage_text": "Paper License. Now that the FCC has elected to go paperless you will not receive a paper copy of your license when you upgrade or are awarded your new license. Cost savings! Here is information on how to obtain a Reference and/or Official paper copy and change your paper copy preferences from the ARRL VEC: FCC Goes Paperless."}, {"url": "http://www.ehow.com/how_7261024_replace-lost-fcc-license.html", "passage_text": "Obtain an FCC Registration Number (FRN) and password if you don't already have one. You can apply for one online on the FCC website on the FCC Registration Page. Log in to the FCC Universal Licensing System (ULS) using your FRN and password. Select Request Duplicate in the menu on the right-hand side of the page. Fill in any information that is missing, and correct any information that is incorrect on the form that is displayed. "}, {"url": "https://www.fcc.gov/help/requesting-duplicate-license-universal-licensing-system-uls", "passage_text": "Some requests for a duplicate license require a fee. ULS will automatically determine if a fee is required and tell you the amount once you complete your application. If fees are due, they can be paid online as soon as you submit your application. You are about to leave the FCC website and visit a third-party, non-governmental website that the FCC does not maintain or control. The FCC does not endorse any product or service, and is not responsible for, nor can it guarantee the validity or timeliness of the content on the page you are about to visit."}, {"url": "https://www.fcc.gov/help/requesting-duplicate-license-universal-licensing-system-uls", "passage_text": "Note: If you are taken to the My Applications page, click My Licenses to begin the steps below. 1  On the left-hand side of the screen, click Request Duplicates. 2  Select the licenses and click Add. 3  Click Continue to navigate through the application. You are about to leave the FCC website and visit a third-party, non-governmental website that the FCC does not maintain or control. The FCC does not endorse any product or service, and is not responsible for, nor can it guarantee the validity or timeliness of the content on the page you are about to visit."}, {"url": "http://wireless2.fcc.gov/helpfiles/licensemanager/amateur/helpAmateur.html", "passage_text": "Request Duplicates —Request official FCC duplicate authorizations. You may also print informational reference copies of your licenses from within the ULS License Manager. (To do so, select the View Complete License link from the License At A Glance detail screen for a specific license. If the entire license or a component of the license is in termination pending status, a message may appear at the top of the License At A Glance Page. You will not be able to file most applications if the license is in termination pending status."}, {"url": "http://ae7q.com/misc/Generate.php", "passage_text": "1 Remember that the generated license page (from either the FCC or this site) is a reference copy only intended for display where an official copy is not required. 2  The information is extracted from data in the FCC downloadable license data files; the result is not intended to be an exact copy. 1 By default, a light blue FCC seal watermark is generated for the license. 2  You can adjust the color and intensity of the watermark for your printer by adjusting the value of each color component in the watermark between 0 and 255 (increase ALL the values to give a lighter color)."}, {"url": "https://www.fcc.gov/help/requesting-duplicate-license-universal-licensing-system-uls", "passage_text": "A duplicate license is a copy of an original license that is mailed to you; whereas a reference copy is a copy of a license that you can print yourself in ULS License Search. You are about to leave the FCC website and visit a third-party, non-governmental website that the FCC does not maintain or control. The FCC does not endorse any product or service, and is not responsible for, nor can it guarantee the validity or timeliness of the content on the page you are about to visit."}]