[{"url": "http://pets.webmd.com/ask-pet-health-11/dog-feeding", "passage_text": "The general recommendation for adults of all breeds is that they be fed twice a day. Of course, as dogs get older, Carreker says, they may make the decision for us how many times they should be fed. Some dogs don't want to eat twice a day.."}, {"url": "https://www.petfinder.com/dogs/dog-nutrition/how-often-to-feed-your-dog/", "passage_text": "The following is an excerpt from Petfinder.com’s – The Adopted Dog Bible. Most experts recommend feeding your dog twice a day — once in the morning and once in the evening — though puppies under five months of age should be fed three to four times a day, or as directed by your veterinarian. Thinkstock."}, {"url": "http://dogcare.dailypuppy.com/little-dog-eat-2857.html", "passage_text": "How often you feed your small or toy breed of dog is based on his age and health history. Puppies need four to eight feedings each day with puppy formula, mush or solid foods, depending on their life stage. Those over 8 to 10 weeks of age who are already weaned should be fed four times per day. While larger dog breeds can be fed twice a day when they reach around 6 months of age, small ones, less than 20 pounds, need two to four meals a day, recommends Purina."}, {"url": "http://pets.thenest.com/many-times-day-feed-dog-4801.html", "passage_text": "Puppies. Puppies should eat frequently on a set, regular schedule between weaning and 6 months of age. Ideally, they should eat three times each day. Puppies over the age of 6 months can eat less frequently, although they should still be fed at least twice each day."}, {"url": "https://www.petfinder.com/dogs/dog-nutrition/how-often-to-feed-your-dog/", "passage_text": "Most experts recommend feeding your dog twice a day — once in the morning and once in the evening — though puppies under five months of age should be fed three to four times a day, or as directed by your veterinarian. Thinkstock."}, {"url": "https://sg.answers.yahoo.com/question/index?qid=20061121173104AAKR6iJ", "passage_text": "Report Abuse. Guessing that your dog is 60-80 pounds your dog should be fed 2 1/2 to 3 cups of dog food a day. (depending on how active your dog is). it really doesnt matter once or twice a day, the main thing is (2 1/2 to 3 cups) basic feeding tips: Feed your puppy the same kind of food every day."}, {"url": "http://www.dogster.com/dog-food/dog-feeding-schedules", "passage_text": "Modifications for Senior Dogs. Food: Older dogs should be fed twice a day but it should be a smaller amount since their activity is limited. Water: Older dogs may need more water than their younger counterparts. Sleep: A senior dog will sleep more than an active adult dog, on average 16 to 18 hours a day."}]