[{"url": "http://www.answers.com/Q/Relative_location_of_Brazil", "passage_text": "Canada is located in the North Western hemisphere. It continent is North America. relative location-arctic ocean is north of Canada, Atlantic east of Canada, United States S … outh of Canada and Pacific ocean West of Canada. 28 people found this useful. 1 An Overview of Relative and Absolute Location Often, you will find that you need to go somewhere or find something. 2  The first step, of course, is to know where you are going."}, {"url": "http://www.answers.com/Q/Relative_location_of_Brazil", "passage_text": "It continent is North America. relative location-arctic ocean is north of Canada, Atlantic east of Canada, United States S … outh of Canada and Pacific ocean West of Canada. 1 An Overview of Relative and Absolute Location Often, you will find that you need to go somewhere or find something. 2  The first step, of course, is to know where you are going."}, {"url": "http://brazillove3.weebly.com/continent-location--absolute-and-relative-location.html", "passage_text": "Continent, Absolute & Relative Location. Brazil is located in Eastern South America, bordering the Atlantic Ocean. Brazil's absolute location is 15 degrees South (latitude) and 49 degrees West (longitude). "}, {"url": "http://brazilmrmaver.blogspot.com/2011/11/location-of-brazil.html", "passage_text": "Location of Brazil. Location of Brazil. Brazil is a very large country. Brazil's absolute location is 10 degrees south and 55 degrees west.Brazil's relative location is described by looking at the places that surround it. Brazil shares common borders are every South American country except Equdor and Chile. "}, {"url": "https://en.wikipedia.org/wiki/Rio_de_Janeiro", "passage_text": "The metropolis is anchor to the Rio de Janeiro metropolitan area, the second most populous metropolitan area in Brazil, the sixth-most populous in the Americas, and the eighteenth-largest in the world. Rio de Janeiro is the capital of the state of Rio de Janeiro, Brazil's third-most populous state. Part of the city has been designated as a World Heritage Site, named  Rio de Janeiro: Carioca Landscapes between the Mountain and the Sea , by UNESCO on 1 July 2012 as a Cultural Landscape. Rio de Janeiro is home to the largest Portuguese population outside of Lisbon in Portugal. After independence from Portugal, Rio de Janeiro became a destination for hundreds of thousands of immigrants from Portugal, mainly in the early 20th century."}, {"url": "http://www.worldatlas.com/webimage/countrys/samerica/brazil/brlatlog.htm", "passage_text": "Covering almost 50% of South America, Brazil is bordered by Argentina, Paraguay, Uruguay, Bolivia, Peru, Colombia, Venezuela, Guyana, Suriname, French Guiana and the Atlantic Ocean. "}, {"url": "http://www.answers.com/Q/Relative_location_of_Brazil", "passage_text": "Brazil is located South America. It's the biggest country in this continent. It's in the Atlantic Ocean side of the continent. And it borders all the other countries in Sout … h America, except for Equador and Chile. 1 An Overview of Relative and Absolute Location Often, you will find that you need to go somewhere or find something. 2  The first step, of course, is to know where you are going."}, {"url": "http://www.riodejaneiro.com/v/geography/", "passage_text": "The city is geographically located at 22 degrees, 54 minutes south latitude and 43 degrees 12 minutes west longitude. Rio City is also the capital of the Rio de Janeiro state which lies in the south eastern region of Brazil. To the south of the city lies the Atlantic Ocean and to the east Guanabara Bay (Baia baía De). Guanabara the west is covered By Sepetiba (Bay baia Baía). de sepetiba Rio City is also the capital of the Rio de Janeiro state which lies in the south eastern region of Brazil. To the south of the city lies the Atlantic Ocean and to the east Guanabara Bay (Baia baía De). guanabara"}, {"url": "http://www.answers.com/Q/What_relative_and_absolute_location_of_Brazil", "passage_text": "There is some confusion over the terms relative and absolute. If you ask for a relative location you need to state what you want it relative to. For instance Brazil is a very large country in South America, as the previous answerer states, it is west relative to Africa. However it is south relative to North America. Absolute location is also something of a misnomer as this is usually asking for a location in terms of Latitude and Longitude. But once again the co-ordinates are relative to a point in the Atlantic Ocean where the Prime Meridian and the Equator meet. The absolute location of Muscat, Oman (Muscat is the Capital) is: 23.61 N; 58.54 E It is on the Gulf of Oman next to Saudi Arabia, United Arab Emirates and across the gulf fr … om Iran."}]