[{"url": "http://www.worldofchemicals.com/chemicals/chemical-properties/diazepam.html", "passage_text": "Diazepam is a benzodiazepine with anticonvulsant, anxiolytic, sedative, muscle relaxant, and amnesic properties and a long duration of action."}, {"url": "http://www.drugs.com/pro/valium.html", "passage_text": "Valium (diazepam) is a benzodiazepine derivative. The chemical name of diazepam is 7-chloro-1,3-dihydro-1-methyl-5-phenyl-2H-1,4-benzodiazepin-2-one. It is a colorless to light yellow crystalline compound, insoluble in water. The empirical formula is C 16 H 13 ClN 2 O and the molecular weight is 284.75."}, {"url": "http://www.edinformatics.com/interactive_molecules/info/diazepam.htm", "passage_text": "Chemical formula of C16H13ClN2O Molecular mass 284.7 g/mol first marketed as Valium by Hoffmann-La Roche, is a benzodiazepine derivative drug. It possesses anxiolytic, anticonvulsant, sedative, skeletal muscle relaxant and amnestic properties."}, {"url": "http://www.gene.com/download/pdf/valium_prescribing.pdf", "passage_text": "The empirical formula is C 16 H 13 ClN 2 O and the molecular weight is 284.75. The structural formula is as follows: Valium is available for oral administration as tablets containing 2 mg, 5 mg or 10 mg diazepam."}, {"url": "http://www.edinformatics.com/interactive_molecules/3D/diazepam_molecule.htm", "passage_text": "Chemical formula of C16H13ClN2O Molecular mass 284.7 g/mol first marketed as Valium by Hoffmann-La Roche, is a benzodiazepine derivative drug. It possesses anxiolytic, anticonvulsant, sedative, skeletal muscle relaxant and amnestic properties."}, {"url": "http://www.answers.com/Q/What_are_the_chemical_formula_of_diazepam", "passage_text": "Answer     Diazepam, marketed under brand names Valium, Stesolid, Seduxen, Bosaurin and Apozepam) is a drug which is a benzodiazepine derivative. It possesses … anxiolytic, anticonvulsant, sedative, skeletal muscle relaxant and amnestic properties."}, {"url": "http://www.gene.com/download/pdf/valium_prescribing.pdf", "passage_text": "VALIUM  brand of diazepam TABLETS R x Only DESCRIPTION Valium (diazepam) is a benzodiazepine derivative. The chemical name of diazepam is 7-chloro-1,3-dihydro-1-methyl-5-phenyl-2H-1,4-benzodiazepin-2-one. It is a colorless to light yellow crystalline compound, insoluble in water."}, {"url": "http://www.answers.com/Q/What_are_the_chemical_formula_of_diazepam", "passage_text": "The chemical name of diazepam (CAS 439-14-5) is: CHLORO-7 METHYL-1 PHENYL-5 DIHYDRO-1,3 2H-BENZO[E][DIAZEPINE- 1,4]ONE-2."}, {"url": "http://www.worldofchemicals.com/chemicals/chemical-properties/diazepam.html", "passage_text": "Description. Diazepam is a benzodiazepine with anticonvulsant, anxiolytic, sedative, muscle relaxant, and amnesic properties and a long duration of action. Its actions are mediated by enhancement of gamma-aminobutyric acid activity."}]