[{"url": "http://www.bls.gov/ooh/healthcare/veterinary-assistants-and-laboratory-animal-caretakers.htm", "passage_text": "Employment of veterinary assistants and laboratory animal caretakers is projected to grow 10 percent from 2012 to 2022, about as fast as the average for all occupations. Despite average employment growth, high occupational turnover will result in good job opportunities. Veterinary assistants and laboratory animal caretakers play a large role in helping veterinarians and scientists with surgery and other minor procedures. They may prepare equipment and pass surgical instruments and materials to veterinarians during surgery."}, {"url": "http://www.bls.gov/ooh/healthcare/veterinary-assistants-and-laboratory-animal-caretakers.htm", "passage_text": "Veterinary assistants and laboratory animal caretakers are responsible for many daily tasks, such as feeding, weighing, and taking the temperature of animals. Other duties may include giving medication, cleaning cages, and providing nursing care before and after surgery and other medical procedures. Veterinary assistants and laboratory animal caretakers play a large role in helping veterinarians and scientists with surgery and other minor procedures. They may prepare equipment and pass surgical instruments and materials to veterinarians during surgery."}, {"url": "http://work.chron.com/kind-salary-vet-assistants-make-year-2366.html", "passage_text": "Since vet assistants do not need education beyond a high school diploma, pay tends to be lower than that for other veterinary workers who need more education. The Bureau of Labor Statistics reports that the average annual income of veterinary assistants and laboratory animal caretakers is $24,430, as of May 2011. The statistics bureau reports that Massachusetts is the highest paying state for vet assistants in the nation, as of May 2011, and that workers in the state earn $31,230 a year on average."}, {"url": "http://work.chron.com/kind-salary-vet-assistants-make-year-2366.html", "passage_text": "Caring for animals is something pet owners do for free, but workers in the field of veterinary care help animals for living. Veterinary assistants are support workers who perform a variety of routine tasks such as feeding animals, cleaning cages and performing diagnostic tests. The statistics bureau reports that Massachusetts is the highest paying state for vet assistants in the nation, as of May 2011, and that workers in the state earn $31,230 a year on average."}, {"url": "http://www.wisegeek.org/what-does-an-veterinary-assistant-do.htm", "passage_text": "10 most extreme places on Earth. It’s important to understand that a veterinary assistant is not the same as veterinary technician. In general, vet techs are people who have received formal training, certification and licensing. A veterinary assistant is someone who usually has experience working in the animal care field but is not a licensed vet tech. Most are responsible for doing front office work in a veterinary office, clinic, or animal shelter. Post 11. My job duties fell in between veterinary technician and veterinary assistant for awhile. I had the training and experience to do technician work, but the vet desperately needed help answering phones and doing receptionist work, so I stayed really busy until she hired an assistant."}, {"url": "http://www.bls.gov/ooh/healthcare/veterinary-assistants-and-laboratory-animal-caretakers.htm", "passage_text": "Laboratory animal caretakers work in laboratories under the supervision of a veterinarian, scientist, veterinary technician, or veterinary technologist. Their daily tasks include feeding animals, cleaning kennels, and monitoring the general well-being of laboratory animals. Veterinary assistants and laboratory animal caretakers play a large role in helping veterinarians and scientists with surgery and other minor procedures. They may prepare equipment and pass surgical instruments and materials to veterinarians during surgery."}, {"url": "http://www.bls.gov/ooh/healthcare/veterinary-assistants-and-laboratory-animal-caretakers.htm", "passage_text": "Veterinary assistants and laboratory animal caretakers look after animals in laboratories, animal hospitals, and clinics. They care for the well-being of animals by performing routine tasks under the supervision of veterinarians, scientists, and veterinary technologists and technicians. Veterinary assistants and laboratory animal caretakers play a large role in helping veterinarians and scientists with surgery and other minor procedures. They may prepare equipment and pass surgical instruments and materials to veterinarians during surgery."}, {"url": "http://www.allalliedhealthschools.com/health-careers/vet-tech/veterinary-assistant-job-description/", "passage_text": "What you'll do: While veterinary technicians perform tasks such as administering medication and preparing animals for surgery, veterinary assistants fill a different but equally vital role in the veterinarian's office. As a related entry-level veterinary career, laboratory animal caretakers work in labs under the supervision of a veterinarian, scientist, veterinary technician or veterinary technologist. Their daily tasks include feeding animals, cleaning kennels and monitoring lab animals' general well-being."}, {"url": "http://www.allalliedhealthschools.com/health-careers/vet-tech/veterinary-assistant-job-description/", "passage_text": "Job Environment. Veterinary assistants work mainly in clinics and hospitals, helping technicians treat the injuries and illnesses of animals. You can choose to work in small private practices or large veterinary hospitals. Your main job is to ensure a comfortable, safe and sanitary environment. As a related entry-level veterinary career, laboratory animal caretakers work in labs under the supervision of a veterinarian, scientist, veterinary technician or veterinary technologist. Their daily tasks include feeding animals, cleaning kennels and monitoring lab animals' general well-being."}]