[{"url": "http://www.gfrcconstruction.com/about/", "passage_text": "GFRC (glass fiber reinforced concrete) can be used as wall panels, window surrounds, spandrels, column covers, soffits, cornices, brackets, quoins, railings, pilasters, copings, domes, etc. The basic flexibility of use makes this an ideal use for many landscaping jobs. Basically, GFRC is an ultra-strong composite made of Portland cement infused with randomly dispersed glass fibers that reinforce the concrete and increase its load-bearing capacity."}, {"url": "http://www.fiberconfiber.com/pdf/FAQS.pdf", "passage_text": "FAQ’S: Steel Fiber Reinforced Concrete What is steel fiber reinforced concrete (SFRC)? SFRC is a composite material made of hydraulic cements, water, fine and coarse aggregate, and a dispersion of discon-tinuous, small fibers. It may also contain pozzolans and admixtures commonly used with conventional concrete."}, {"url": "https://en.wikipedia.org/wiki/Reinforced_concrete", "passage_text": "Reinforced concrete (RC) is a composite material in which concrete 's relatively low tensile strength and ductility are counteracted by the inclusion of reinforcement having higher tensile strength and/or ductility. Concrete reinforced with fibers (which are usually steel, glass, or plastic fibers) is less expensive than hand-tied rebar, while still increasing the tensile strength many times."}, {"url": "https://en.wikipedia.org/wiki/Fiber-reinforced_concrete", "passage_text": "Fibers include steel fibers, glass fibers, synthetic fibers and natural fibers – each of which lend varying properties to the concrete. In addition, the character of fiber-reinforced concrete changes with varying concretes, fiber materials, geometries, distribution, orientation, and densities. The concept of using fibers as reinforcement is not new. Fibers have been used as reinforcement since ancient times. Historically, horsehair was used in mortar and straw in mud bricks. In the 1900s, asbestos fibers were used in concrete."}, {"url": "http://www.brighthubengineering.com/concrete-technology/52076-steel-fiber-reinforced-concrete/", "passage_text": "Effect of Fibers Utilized with Concrete. Fiber reinforced concrete is a composite material comprised of Portland cement, aggregate, and fibers. Normal unreinforced concrete is brittle with a low tensile strength and strain capacity. Many types of steel fibers are used for concrete reinforcement. Round fibers are the most common type and their diameter ranges from 0.25 to 0.75 mm. Rectangular steel fibers are usually 0.25 mm thick, although 0.3 to 0.5 mm wires have been used in India."}, {"url": "https://en.wikipedia.org/wiki/Fiber-reinforced_concrete", "passage_text": "Fiber-reinforced concrete (FRC) is concrete containing fibrous material which increases its structural integrity. The concept of using fibers as reinforcement is not new. Fibers have been used as reinforcement since ancient times. Historically, horsehair was used in mortar and straw in mud bricks. In the 1900s, asbestos fibers were used in concrete."}, {"url": "http://courses.washington.edu/cm425/frc.pdf", "passage_text": "Concrete Technology Fiber-Reinforced Concrete Professor Kamran M. NematiWinter Quarter 2015 3 Concrete Technology 5 Fiber-Reinforced Concrete (FRC)  Concrete containing a hydraulic cement, water, fine or fine and coarse aggregate, and discontinuous discrete fibers is called fiber-reinforced concrete(FRC). Concrete Technology Fiber-Reinforced Concrete Professor Kamran M. NematiWinter Quarter 2015 6 Concrete Technology 11 Fiber-Reinforced Concrete (FRC)  Examination of fractured specimens of fiber-reinforced concrete shows that failure takes place primarily due to fiber pull-out or debonding."}, {"url": "http://courses.washington.edu/cm425/frc.pdf", "passage_text": "Concrete Technology. Fiber-Reinforced Concrete Professor Kamran M. NematiWinter Quarter 2015 7 Concrete Technology 13 Fiber-Reinforced Concrete (FRC)Strength  The most important contribution of fiber-reinforcement in concrete is not to strength but to the flexural toughness of the material. Concrete Technology Fiber-Reinforced Concrete Professor Kamran M. NematiWinter Quarter 2015 6 Concrete Technology 11 Fiber-Reinforced Concrete (FRC)  Examination of fractured specimens of fiber-reinforced concrete shows that failure takes place primarily due to fiber pull-out or debonding."}, {"url": "http://www.brighthubengineering.com/concrete-technology/47712-basics-of-fiber-reinforced-concrete/", "passage_text": "What Is Fiber Reinforced Concrete. Fiber reinforced concrete is a type of concrete that includes fibrous substances that increase its structural strength and cohesion. Fiber reinforced concrete has small distinct fibers that are homogeneously dispersed and oriented haphazardly. After the reinforcement of concrete by steel, it becomes a composite group in which the steel endures the tensile stresses. When concrete is reinforced by using fiber in the mixture, it further increases the tensile strength of the composite system."}]