[{"url": "http://www.quepublishing.com/articles/article.aspx?p=421051&seqNum=6", "passage_text": "Madeira is a fortified wine made on the island of Madeira, which sits in the Atlantic Ocean about 400 miles off the coast of Portugal. Madeira wine has been famous since the time of the 13 American colonies when the wine was sent in sailing ships, which took up to 2 years to reach our shores. Adding the alcohol during fermentation results in a sweet wine such as Porto. Marsala is made from white grapes grown on the volcanic soil of the island of Sicily, Italy. Marsala has a burnt caramel flavor and is 18%–20% alcohol like all fortified wines."}, {"url": "https://en.wikipedia.org/wiki/Madeira_wine", "passage_text": "Madeira is a fortified Portuguese wine made in the Madeira Islands. Madeira is produced in a variety of styles ranging from dry wines which can be consumed on their own as an aperitif, to sweet wines more usually consumed with dessert. Cheaper versions are often flavoured with salt and pepper for use in cooking. "}, {"url": "https://en.wikipedia.org/wiki/Fortified_wine", "passage_text": "A glass of port, a fortified wine. Fortified wine is a wine to which a distilled spirit, usually brandy, is added. Many different styles of fortified wine have been developed, including Port, Sherry, Madeira, Marsala, Commandaria wine, and the aromatized wine Vermouth. Although grape brandy is most commonly added to produce fortified wines, the additional alcohol may also be neutral spirit that has been distilled from grapes, grain, sugar beets, or sugarcane. Regional appellation laws may dictate the types of spirit that are permitted for fortification."}, {"url": "https://en.wikipedia.org/wiki/Fortified_wine", "passage_text": "Madeira is a fortified wine made in the Madeira Islands. The wine is produced in a variety of styles ranging from dry wines which can be consumed on their own as an aperitif, to sweet wines more usually consumed with dessert. Although grape brandy is most commonly added to produce fortified wines, the additional alcohol may also be neutral spirit that has been distilled from grapes, grain, sugar beets, or sugarcane. Regional appellation laws may dictate the types of spirit that are permitted for fortification."}, {"url": "http://wine.about.com/od/fortifiedwines/a/madeira.htm", "passage_text": "Madeira wine is a delicious fortified white wine find that is produced on the Portuguese island of Madeira. 1 Sercial – Sercial is a white wine grape that is used to produce a dry style of Madeira. 2  Serve this style of Madeira as an aperitif with salty foods, almonds, walnuts, assorted olives, soups that are heavy on broth and the like. 3  Verdelho – Verdelho is a white wine grape used to make a semi-dry variation"}, {"url": "http://www.foodsubs.com/Aperitif.html", "passage_text": "fortified wine Notes: These are wines that have been fortified with brandy and sometimes flavored with herbs, roots, peels, and spices. The most popular examples are sherry, Madeira, Marsala, port, and vermouth. Fortified wines are often used in cooking, or they're served as aperitifs apéritifs or dessert. wines Marsala Notes: This popular Sicilian fortified wine is Italy's answer to sherry and Madeira. It's mostly used as a cooking wine and is a key ingredient in many Italian dishes, including zabaglione, tiramisu, and veal scaloppini."}, {"url": "http://winefolly.com/review/what-is-madeira-wine/", "passage_text": "Madeira is a fortified wine available in a range of dry to sweet styles. It gets its name from the island of Madeira, a small, beautiful rock in the middle of the Atlantic Ocean. Madeira’s unique taste comes from repeatedly heating the wine. The heating creates a wine with fascinating flavors of roasted nuts, stewed fruit, caramel, and toffee."}, {"url": "http://www.musingsonthevine.com/tips_des2.shtml", "passage_text": "Madeira is a fortified wine made on the island of the same name off the coast of Portugal. As with Sherry there are sweet and dry style Madeira. However, unlike Sherry, the sweet varieties are made like to the Port wine process, wherein the fermentation is halted with alcohol prior to all of the sugar being fermented. "}, {"url": "http://www.wine-tastings-guide.com/madeira-wine.html", "passage_text": "Madeira wine is a fortified wine produced on the Madeira Islands, an archipelago of Portugal in the north Atlantic Ocean. Madeira wine is made much in the same way as Sherry and Port wine in that the fermentation is halted at some point by the addition of a neutral grape spirit (brandy) which fortifies the alcohol level, stopping fermentation."}, {"url": "http://www.quepublishing.com/articles/article.aspx?p=421051&seqNum=6", "passage_text": "Fortified wines are fortified by the addition of extra alcohol in the form of brandy or spirits to bring them up to an alcohol content of 18%–20%. Porto, Sherry, Madeira, Marsala, and Vermouth are all fortified wines. If the extra alcohol is added after fermentation, a dry fortified wine such as Sherry is the outcome. Adding the alcohol during fermentation results in a sweet wine such as Porto. Marsala is made from white grapes grown on the volcanic soil of the island of Sicily, Italy. Marsala has a burnt caramel flavor and is 18%–20% alcohol like all fortified wines."}]