[{"url": "https://en.wikipedia.org/wiki/Electronic_Data_Interchange", "passage_text": "Like many other early information technologies, EDI was inspired by developments in military logistics. The complexity of the 1948 Berlin airlift required the development of concepts and methods to exchange, sometimes over a 300 baud teletype modem, vast quantities of data and information about transported goods. In EDI terminology inbound and outbound refer to the direction of transmission of an EDI document in relation to a particular system, not the direction of merchandise, money or other things represented by the document."}, {"url": "http://cerasis.com/2014/12/11/edi-in-transportation/", "passage_text": "Each term in the definition is significant to the understanding of how EDI works: Computer-to-computer – EDI replaces postal mail, fax and email. While email is also an electronic approach, the documents exchanged via email must still be handled by people rather than computers. The most commonly used EDI Transaction Sets in the Transportation Industry are: 1  204 - Motor Carrier Load Tender: The shipper or 3PL via a TMS sends this transaction set to YRC the carrier to request a shipment pickup."}, {"url": "http://www.1edisource.com/logistics", "passage_text": "Time is money, and that’s never been more true than with companies in the logistics and distribution industries, Logistics Service Providers (LSP) and 3PL warehouses. Ensure that orders are shipped and invoiced painlessly by using an EDI solution designed for your particular challenges – EDI/HQ™. EDI/HQ™ has customer data available in a user-friendly dashboard, which tracks shipping orders and invoices at all stages of fulfillment. In today’s fast-paced world, responding quickly to changing customers or market dynamics is a competitive advantage."}, {"url": "https://en.wikipedia.org/wiki/Third-party_logistics", "passage_text": "A third-party logistics provider (abbreviated 3PL, or sometimes TPL) is a firm that provides service to its customers of outsourced (or Third Party) logistics services for part, or all of their supply chain management functions. "}, {"url": "http://cerasis.com/2014/12/11/edi-in-transportation/", "passage_text": "Let’s back up a bit before we specifically address EDI in transportation. First we must understand and get on the same page of what is Electronic Data Interchange, or EDI, as it is not only used in the transportation industry. The most commonly used EDI Transaction Sets in the Transportation Industry are: 1  204 - Motor Carrier Load Tender: The shipper or 3PL via a TMS sends this transaction set to YRC the carrier to request a shipment pickup."}, {"url": "http://en.ecommercewiki.info/logistics/supply_chain/edi", "passage_text": "E lectronic D ata I nterchange (EDI) refers to the computer-to-computer exchange between different companies via electronic communication channels. At the beginning of EDI (1970’s) there were no standards for the data format. When companies decided to establish EDI with a business partner, they agreed bilaterally which format to use. To reduce this complexity and the efforts, time and costs involved there where introduced the first standards in the 1980’s."}, {"url": "https://en.wikipedia.org/wiki/Electronic_Data_Interchange", "passage_text": "EDI can be transmitted using any methodology agreed to by the sender and recipient. This includes a variety of technologies, including modem (asynchronous and synchronous), FTP, e-mail, HTTP, AS1, AS2, etc. It is important to differentiate between the EDI documents and the methods for transmitting them. In EDI terminology inbound and outbound refer to the direction of transmission of an EDI document in relation to a particular system, not the direction of merchandise, money or other things represented by the document."}, {"url": "http://www.cardinallogistics.co.nz/logistics-info/electronic-data-interchange-edi", "passage_text": "EDI is a standard format for exchanging business data between organisations by electronic means. It is used to transfer electronic documents or business data from one computer system to another as an electronic equivalent for paper-based orders, confirmation and invoices between trading partners. Some of the key advantages of EDI include:"}, {"url": "http://www.truckmaster.com/blogs/trucking-software/edi/trucking-industry-edi-101", "passage_text": "What is EDI? Basically it is the electronic exchange of business documents in a standardized format. In the EDI world, these business documents are called transaction sets, and the customers and carriers with whom you do business are trading partners. Most trucking software packages have the ability to send and receive EDI in this format. There are two basic methods for your computer to send or receive EDI transactions with your partner’s computer: direct communication, and Value Added Network (VAN)."}, {"url": "http://www.logisticslist.com/3pl-definition.html", "passage_text": "Definition of Third Party Logistics. Third party supply of logistics related operations between traders by an independent organization. Eyefortransport. Third Party Logistics is the activity of outsourcing activities related to Logistics and Distribution. The 3PL industry includes Logistics Solution Providers (LSPs) and the shippers whose business processes they support."}]