[{"url": "https://en.wikipedia.org/wiki/Plutonium", "passage_text": "Plutonium is a transuranic radioactive chemical element with symbol Pu and atomic number 94. It is an actinide metal of silvery-gray appearance that tarnishes when exposed to air, and forms a dull coating when oxidized. The element normally exhibits six allotropes and four oxidation states. Plutonium-238 has a half-life of 88 years and emits alpha particles. It is a heat source in radioisotope thermoelectric generators, which are used to power some spacecraft. Plutonium isotopes are expensive and inconvenient to separate, so particular isotopes are usually manufactured in specialized reactors."}, {"url": "http://www.webelements.com/plutonium/", "passage_text": "Plutonium: the essentials. Plutonium was the second transuranium element of the actinide series to be discovered. By far of greatest importance is the isotope 239 Pu, which has a half-life of more than 20000 years. One kilogram is equivalent to about 22 million kilowatt hours of heat energy. The complete detonation of a kilogram of plutonium produces an explosion equal to about 20000 tons of chemical explosive."}, {"url": "http://www.chemistryexplained.com/elements/L-P/Plutonium.html", "passage_text": "Plutonium is a member of the actinide family. The actinides occur in Row 7 of the periodic table. The periodic table is a chart that shows how chemical elements are related to one another. The actinides get their name from element 89, actinium, which is sometimes considered the first member of the family. The half life of a radioactive element is the time it takes for half of a sample of the element to break down. Consider the isotope plutonium-242, with its half life of 376,300 years. In 376,300 years (one half life), only half of a sample prepared today would still be plutonium-242."}, {"url": "http://www.chemistryexplained.com/elements/L-P/Plutonium.html", "passage_text": "Plutonium is named after the planet Pluto. The most stable isotopes of plutonium are plutonium-242 and plutonium-244. The half lives of these two isotopes are 376,300 years and 82,600,000 years respectively. The half life of a radioactive element is the time it takes for half of a sample of the element to break down. Consider the isotope plutonium-242, with its half life of 376,300 years. In 376,300 years (one half life), only half of a sample prepared today would still be plutonium-242."}, {"url": "http://www.answers.com/Q/What_family_does_plutonium_belong_to", "passage_text": "Plutonium (pronounced /pluːˈtoʊniəm/) is a rare radioactive, metallic and toxic chemical element. It has th … e symbol Pu and the atomic number 94. It is a fissile element used in most modern nuclear weapons. The most significant isotope of plutonium is 239Pu, with a half-life of 24,100 years. The radioactive metal plutonium is a rare-earth actinide from period 7 of the periodic table."}, {"url": "http://periodic.lanl.gov/94.shtml", "passage_text": "History. Plutonium is the second transuranium element of the actinide series. Element 93 was discovered in 1940/41 by Glenn T. Seaborg, Edwin M. McMillan, J. W. Kennedy, and A. C. Wahl by deuteron bombardment of uranium-238 in the 60-inch cyclotron at the University of California, Berkeley Lab. "}, {"url": "http://www.answers.com/Q/What_element_family_is_plutonium_in", "passage_text": "It has th … e symbol Pu and the atomic number 94. It is a fissile element used in most modern nuclear weapons. The most significant isotope of plutonium is 239Pu, with a half-life of 24,100 years. It can be made from natural uranium. Answer   A family of elements (Or Chemical Family) is used to describe a group of related elements. For example, copper, silver, and gold all belong to the same chemical … family. These 3 elements are often referred to as the coinage metals. These elements share several common properties."}, {"url": "http://www.ducksters.com/science/chemistry/plutonium.php", "passage_text": "Plutonium is a member of the actinide group in the periodic table. Plutonium atoms have 94 electrons and 94 protons with 2 valence electrons in the outer shell. There are 150 neutrons in the most abundant isotope. Plutonium is used in both nuclear reactors and nuclear weapons. It was used to create the second nuclear weapon deployed during World War II which was the Fat Man nuclear bomb dropped on Nagasaki, Japan. Plutonium has also been used as a power and heat source for spacecraft."}]