[{"url": "http://www.city-data.com/city/Eliot-Maine.html", "passage_text": "Part 2: Tell me about Eliot (as a resident!) (3 replies). Latest news from Eliot, ME collected exclusively by city-data.com from local newspapers, TV, and radio stations. Ancestries: English (32.3%), Irish (18.1%), French (12.5%), German (9.6%), United States (7.5%), Scottish (6.6%). Races in Eliot detailed stats: ancestries, foreign born residents, place of birth. Mar. 2013 cost of living index in Eliot: 113.0 (more than average, U.S. average is 100). Recent posts about Eliot, Maine on our local forum with over 1,800,000 registered users."}, {"url": "http://gis.vgsi.com/eliotme/", "passage_text": "Welcome to the Town of Eliot database. You may be prompted to install Silverlight (a free product from Microsoft) after you enter. Follow all the prompts to run the plug-in installer. In some cases, you may need to refresh or restart your browser. "}, {"url": "http://www.city-data.com/city/Eliot-Maine.html", "passage_text": "Eliot-area historical tornado activity is significantly above Maine state average. It is 58% smaller than the overall U.S. average. On 6/9/1953, a category F3 (max. wind speeds 158-206 mph) tornado 14.5 miles away from the Eliot town center injured 5 people and caused between $5000 and $50,000 in damages. Races in Eliot detailed stats: ancestries, foreign born residents, place of birth. Mar. 2013 cost of living index in Eliot: 113.0 (more than average, U.S. average is 100). Recent posts about Eliot, Maine on our local forum with over 1,800,000 registered users."}, {"url": "https://en.wikipedia.org/wiki/Eliot_%26_Me", "passage_text": "Dublin. The present. Ten-year-old Lucy struggles to come to terms with her parents’ separation. She adopts a dog, Eliot, from the local dog shelter. It is love at first sight and her life starts to improve. But tragedy strikes when Eliot goes missing and Lucy undertakes a dangerous journey to find him. Subsequently Eliot & Me was an official selection at the SCHLINGEL International Film Festival in Germany, Cinekid Festival in The Netherlands, Oulu International Children's and Youth Film Festival in Finland and the Olympia International Film Festival for Children and Young People in Greece."}, {"url": "https://en.wikipedia.org/wiki/Eliot,_Maine", "passage_text": "Eliot is a town in York County, Maine, United States. The population was 6,204 at the 2010 census. It is part of the Portland – South Portland – Biddeford, Maine metropolitan statistical area. Eliot is home to Littlebrook Airpark and the Raitt Homestead Farm Museum. Eliot is drained by Sturgeon Creek and the Piscataqua River. Eliot is served by state routes 91, 101, 103 and 236. The town is northwest of Interstate 95 and near the New Hampshire border. See also: South Eliot, Maine As of 2000 the median income for a household in the town was $52,606, and the median income for a family was $63,598. Males had a median income of $44,205 versus $30,530 for females. The per capita income for the town was $24,403"}, {"url": "http://www.priceline.com/hotel/POI-Eliot_ME_Eliot_Maine_United_States-88690106.html", "passage_text": "Hotels Near Eliot, ME. Priceline can help you find great deals on high quality hotels near Eliot, ME. If you know when you're traveling to Eliot, ME, use the search box below to check prices and availability. For the deepest discounts, Name Your Own Price® for a Eliot hotel"}, {"url": "http://www.imdb.com/title/tt2156759/", "passage_text": "Storyline. Lucy struggles to come to terms with her parents' separation. She rescues a dog Eliot from the local dog shelter and her life starts to improve. Tragedy strikes when Eliot goes missing and Lucy must go on a dangerous journey to find him. "}, {"url": "http://www.eliotmaine.org/", "passage_text": "Read more... Welcome to our Website This is the official website for the Town of Eliot, Maine. Whether you are a resident or considering making Eliot your home, we appreciate your visiting our website to find out more about our Town. 1 Download Application Form(link), complete form and either mail to: Town Clerk, 1333 State Road, Eliot, ME 03903 or drop off at the Clerk's Office. 2  File electronically by using the Absentee Ballot Service via the State of Maine Website: Absentee Ballot Service Website."}, {"url": "http://www.eliotmaine.org/", "passage_text": "If you are not familiar with Eliot, we are a friendly, family oriented community in Southern Maine with a population of about 6,200. Eliot offers many services to its residents, yet maintains charming small-town character. 1 Download Application Form(link), complete form and either mail to: Town Clerk, 1333 State Road, Eliot, ME 03903 or drop off at the Clerk's Office. 2  File electronically by using the Absentee Ballot Service via the State of Maine Website: Absentee Ballot Service Website."}]