[{"url": "http://www.livestrong.com/article/268428-aloe-vera-gel-dry-skin/", "passage_text": "The clear gel extracted from the leaves of the aloe vera plant has been used for many years in the treatment of wounds and other skin ailments. Aloe vera gel soothes the skin, reducing soreness and discomfort. It can also help to prevent cracking and flaking."}, {"url": "http://www.bitterrootrestoration.com/skin-care/aloe-vera-to-skin-care.html", "passage_text": "1 Aloe vera oil can be used on the dry skin to make the skin normal and shiny. 2  Aloe Vera acts as a natural barrier and shields our skin from dangerous toxins. 3  Aloe vera is helpful for frostbite, burns, insect bites, blisters and allergic reactions."}, {"url": "http://aloevera.com/aloe-vera-for-dry-skin/", "passage_text": "Aloe Vera Benefits, Aloe Vera for Skin. Although flaky, brittle patches of dry skin tend to be synonymous with the cold winter months, parched legs, arms and hands are prevalently frustrating issues faced by men and women alike year round."}, {"url": "http://www.stylecraze.com/articles/amazing-benefits-of-aloe-vera-for-skin-hair-and-health/", "passage_text": "Instead of aloe vera you can apply coconut oil on your skin has it has a variety of dermatological benefits. Coconut oil can be used as a skin moisturizer, as a remedy for a condition that causes dry, rough, scaly skin and as an antiseptic."}, {"url": "http://www.bitterrootrestoration.com/skin-care/aloe-vera-to-skin-care.html", "passage_text": "1 Aloe vera is beneficial for cracked and dry skin. 2  Aloe vera oil can be used on the dry skin to make the skin normal and shiny. 3  Aloe Vera acts as a natural barrier and shields our skin from dangerous toxins. 4  Aloe vera is helpful for frostbite, burns, insect bites, blisters and allergic reactions."}, {"url": "http://www.livestrong.com/article/268428-aloe-vera-gel-dry-skin/", "passage_text": "Aloe Vera is a succulent plant that originates in North Africa. For centuries, the gel from the plant has been used topically for treating minor burns, wounds and skin disorders such as psoriasis."}, {"url": "http://www.livestrong.com/article/172334-how-to-use-a-fresh-aloe-vera-gel-plant/", "passage_text": "Blend the aloe gel as part of a smoothie, or gently rub the moist inside of the aloe skin on sunburn or other mild skin irritations to moisture and soothe. This reduces waste because it makes use of the gel that remained inside the leaf skin, but you can also apply the pure gel fillet you extracted to your skin as well."}, {"url": "http://www.youtube.com/watch?v=bhECB6RY9yY", "passage_text": "Use fresh Aloe Vera for skin care. Aloe Vera treats dry skin, burns, eczema, psoriasis, cuts, and burns. Learn how to treat yourself with homeopathy visit www.homeopathicremediesandtreatment.com."}, {"url": "http://www.livestrong.com/article/268428-aloe-vera-gel-dry-skin/", "passage_text": "Aloe vera can be used to remedy severely dry skin that is inflamed. According to a study published in the February 2008 edition of Skin Pharmacology and Physiology, aloe vera has calming and anti-inflammatory effects on skin that has been sunburned, within 48 hours of topical application."}, {"url": "http://aloevera.com/aloe-vera-for-dry-skin/", "passage_text": "Though you’re likely to find a slew of home remedies for dry skin, one plant in particular is making serious headway in the skin treatment and cosmetic realms: aloe vera for dry skin. Discover the secrets behind – and recipes for – concocting a homemade remedy of"}]