[{"url": "http://www.answers.com/Q/What_is_the_name_of_three_types_of_tornado", "passage_text": "There are three main types of tornadoes. Supercell tornadoes are the most common and the strongest. These form from the mesocyclone, or strong, rotating updraft, of an especia … lly powerful type of thunderstorm called a supercell. Type 1 tornadoes form from the mesocyclone of a thunderstorm, usually a supercell. These tornadoes usually … have winds under 110 mph, but in some cases winds can exceed 300 mph. Type 2 tornadoes, which include landspouts and most waterspouts are weaker."}, {"url": "http://www.nssl.noaa.gov/education/svrwx101/tornadoes/types/", "passage_text": "Waterspouts are similar to landspouts, except they occur over water. Damage from these types of tornadoes tends to be EF2 or less. Non-supercell tornadoes include (L-R): Gustnadoes, whirls of dust or debris at or near the ground with no condensation funnel, which form along the gust front of a storm."}, {"url": "http://www.basicplanet.com/tornado/", "passage_text": "Types of Tornadoes. There are a few different types of tornadoes that are classified by specific characteristics. These tornadoes include the landspout, the multiple vortex tornadoes, and the waterspout. Other less common tornado-like phenomena that exist are the gustnado, the dust devil, and the fire whirl. Multiple-vortex tornadoes are specific types of tornadoes that have two or more columns spinning in the air that rotate around the same center. This can occur in almost any circulation, but is usually seen in intense tornadoes. These separate vortices cause small areas of heavier damage along the central tornado path."}, {"url": "http://www.answers.com/Q/What_is_the_name_of_three_types_of_tornado", "passage_text": "This type of tornado is formed above the surface of water. There are two types of waterspout tornadoes-tornadic and non-tornadic or fair-weather. Tornadic waterspouts are mesocyclonic tornadoes that are formed over the surface of water. Type 1 tornadoes form from the mesocyclone of a thunderstorm, usually a supercell. These tornadoes usually … have winds under 110 mph, but in some cases winds can exceed 300 mph. Type 2 tornadoes, which include landspouts and most waterspouts are weaker."}, {"url": "http://www.conserve-energy-future.com/types-and-causes-of-tornadoes.php", "passage_text": "There are various types of tornadoes and they can characterized according to the level of damage they can cause. Fujita or Enhanced Fujita(EF) scale scale is a reference scale to characterize the tornado according to the magnitude of the destruction. EF0 being the least destructive and EF6 being the most extreme. "}, {"url": "http://weather.about.com/od/tornadoe1/ss/tornadoes.htm", "passage_text": "Although most people think of tornadoes as the violent rotating columns of air on land, tornadoes can also occur on water. A waterspout is a type of tornado that forms over water. These tornadoes are usually weak, but can cause damage to boats and recreational vehicles. Most all of the large hail and extremely violent tornadoes are as a result of a supercell thunderstorm. These storms often feature wall clouds and mammatus clouds. While a dust devil is not a tornado in the strictest sense of the term, it is a type of vortex."}, {"url": "http://www.nssl.noaa.gov/education/svrwx101/tornadoes/types/", "passage_text": "Tornadoes come from mainly two types of thunderstorms: supercell and non-supercell. Tornadoes that come from a supercell thunderstorm are the most common, and often the most dangerous. A rotating updraft is a key to the development of a supercell, and eventually a tornado. Damage from these types of tornadoes tends to be EF2 or less. Non-supercell tornadoes include (L-R): Gustnadoes, whirls of dust or debris at or near the ground with no condensation funnel, which form along the gust front of a storm."}, {"url": "http://www.answers.com/Q/What_is_the_name_of_three_types_of_tornado", "passage_text": "In terms of development there are really only 2 types of tornado. Type 1 tornadoes form from the mesocyclone of a thunderstorm, usually a supercell. These tornadoes usually … have winds under 110 mph, but in some cases winds can exceed 300 mph. Type 2 tornadoes, which include landspouts and most waterspouts are weaker."}, {"url": "http://www.nssl.noaa.gov/education/svrwx101/tornadoes/types/", "passage_text": "Non-supercell tornadoes are circulations that do not form from organized storm-scale rotation. These tornadoes form from a vertically spinning parcel of air already occurring near the ground caused by wind shear from a warm, cold, or sea breeze front, or a dryline. Damage from these types of tornadoes tends to be EF2 or less. Non-supercell tornadoes include (L-R): Gustnadoes, whirls of dust or debris at or near the ground with no condensation funnel, which form along the gust front of a storm."}]