[{"url": "http://www.cnn.com/2015/07/12/world/americas/mexico-el-chapo-profile/index.html", "passage_text": "Joaquin El Chapo Guzman, already a nearly mythical character in Mexico, added to his legend over the weekend by escaping from prison yet again. After his last escape, in 2001 in a laundry cart, he eluded authorities for more than a dozen years."}, {"url": "http://www.latimes.com/world/mexico-americas/la-fg-mexico-guzman-profile-20150712-story.html", "passage_text": "Mexico drug lord Guzman's escape tunnel is a minor engineering masterpiece Tracy Wilkinson The tunnel stretched a mile long, from the jailhouse shower to an empty building in a cornfield, and was deep enough for drug kingpin Joaquin “El Chapo” Guzman to stand upright as he made his escape."}, {"url": "http://www.csmonitor.com/World/Latest-News-Wires/2013/0215/Who-is-El-Chapo-Guzman-Public-Enemy-Number-One", "passage_text": "Save for later Saved. Joaquin 'El Chapo' Guzman Loera, seen here after his 1993 arrest, escaped from a maximum security federal prison in 2001 and continues to be a fugitive. On Feb. 14, Chicago announced that Guzman, the head of Mexico's Sinaloa crime cartel, is their new Public Enemy No. 1."}, {"url": "http://time.com/3954802/joaquin-el-chapo-guzman-escape/", "passage_text": "The Mexican drug lord Joaquin “El Chapo” Guzman has escaped a high-security Mexican prison for the second time, this time through a one-mile tunnel."}, {"url": "http://www.latimes.com/world/mexico-americas/la-fg-where-is-el-chapo-guzman-20150713-story.html", "passage_text": "Joaquin “El Chapo” Guzman probably had several hours before authorities began chasing him after his brazen escape from a maximum-security prison over the weekend. He apparently fled through a mile-long tunnel from his prison-cell shower to an abandoned house in the middle of a grassy field."}, {"url": "https://en.wikipedia.org/wiki/Joaqu%C3%ADn_Guzm%C3%A1n_Loera", "passage_text": "Guzman guzmán was captured in 1993 In, guatemala extradited and sentenced to 20 years in prison In mexico for murder and drug. Trafficking after bribing prison, guards he was able to escape from a federal-maximum security prison in. 2001 he was wanted by the governments Of mexico and The United, states and BY. interpol"}, {"url": "http://www.dailymail.co.uk/news/article-2566474/Cartel-boss-El-Chapo-cooking-breakfast-beauty-queen-wife-Mexican-officials-smashed-door-secret-hideout-betrayed.html", "passage_text": "Coronel, who is the daughter of one of Guzman's top deputies, Ines Coronel Barreas, had last been seen re-entering Mexico in August 2011. The then 22-year-old had just given birth to Guzman's twin daughters at Antelope Valley Hospital in Lancaster, north of Los Angeles, California."}, {"url": "http://www.latimes.com/world/mexico-americas/la-fg-mexico-guzman-profile-20150712-story.html", "passage_text": "Joaquin “El Chapo” Guzman, one of the world’s biggest drug kingpins, gained folklore status during his... Chicago compared him to Al Capone. Forbes Magazine listed him as one of the richest men in the world. And in Mexico, he was a renegade outlaw whose exploits were the stuff of legend and song."}]