[{"url": "http://www.howmuchisit.org/how-much-does-opal-cost/", "passage_text": "1 When the opal stone is added to jewelry, the cost can go up by more than two to three times the amount. 2  By the carat, plan on spending at least $45 to $65 for an opal. 3  Aside from the carats, an opal stone can be priced depending on the color, body and the transparency."}, {"url": "http://www.howmuchisit.org/how-much-does-opal-cost/", "passage_text": "1 The average opal stone can cost anywhere from $20 to as much as $400 for the stone alone. 2  When the opal stone is added to jewelry, the cost can go up by more than two to three times the amount. 3  By the carat, plan on spending at least $45 to $65 for an opal."}, {"url": "https://www.grahamblackopal.com/rings-with-australian-opals/", "passage_text": "Rings with Australian opals. Hand made opal rings from Australian. So many options when it comes to this particular Australian gemstone, sometimes it’s the pattern of the gemstone that is desirable first of all for the client that wishes to have a custom ring made, and the design comes second."}, {"url": "http://blog.longsjewelers.com/jewelry/how-much-jewelry-repair", "passage_text": "These will cost around $20 and $60 respectively. Setting precious or semi-precious gemstones can cost even less, depending on the value of the stone and the labor needed. Take Away As you can see, there is no set price for a jewelry repair."}, {"url": "http://www.howmuchisit.org/how-much-does-opal-cost/", "passage_text": "1 Aside from the carats, an opal stone can be priced depending on the color, body and the transparency. 2  Rare opal stones such as black cuts can cost upwards of $1,000 per carat. 3  Other colors such as bright blue can cost as much as $600."}, {"url": "http://blog.longsjewelers.com/jewelry/how-much-jewelry-repair", "passage_text": "To give you an idea of the price that you can expect, we have provided some price ranges below: Resetting a round cut diamond into a prong setting will cost you between $35 and $150 depending on the carat weight of the stone. A fancy cut that is in a prong setting will cost you between $55 and $180. If you are remounting a channel set accent stone, it will cost between $35 and $60 for a round cut depending on the size, whereas a fancy cut will cost between $55 and $84."}, {"url": "http://www.jansjewells.com/category.php?category_id=75", "passage_text": "Choose from earring parts and findings to design, repair or replace missing parts of your own earrings. Select from French wires, Shepards hooks, ball on posts, lever backs, clip ons, screw backs, earring backs, friction clutches, hypo allergenic earring backs, etc."}]