[{"url": "http://www.kogarah.nsw.gov.au/__data/assets/pdf_file/0009/4689/Oatley_and_Neverfail_Fauna_Survey_2010_r.pdf", "passage_text": "8 Oatley Point Reserve contains excellent examples of Sandstone Gully Forest and Sandstone Ridgetop Woodland. The gully forest occupies the slopes of the reserve leading down to the water; it is dominated by tall Blackbutts E. pilularis and Grey Ironbark E. paniculata. Access to the reserve is from Herbert Street (where there is a designated car parking area) or from Algernon Street. There are several walking tracks in the reserve; the main one commences from the Herbert Street car park and continues around the base of the reserve to Oatley Point."}, {"url": "http://off.oatleypark.com/wordpress/wp-content/uploads/2010/03/oatley-park-history.pdf", "passage_text": "In March 1922, the name of the reserve was changed to “Oatley Park”. Oatley Baths. The sandy bay of Oatley Park has long been used as a swimming spot for local residents. In December 1919, Mortdale P & C Association applied for the beach as a “bath site”. The Oatley Swimming Club was founded in 1927 and used the beach. OATLEY PARK Notes by Alan Fairley Area. 45 hectares. Adjoins Lime Kiln Bay Wetlands and Oatley Heights Park and linked by bush corridors to narrow but substantial bush reserves fringing South Peakhurst and Lugarno."}, {"url": "http://off.oatleypark.com/wordpress/wp-content/uploads/2013/12/1OATLEY-FF-WALKING-TRACKS-A4-FLYER.pdf", "passage_text": "It is then 12 minutes walk along the lower road back to your starting point. WALKINGOatley Bushland Park is a wooded peninsula of 45 hectares at the junction of Georges River and Lime Kiln Bay. It is managed by Hurstville City Council. Keep right at track junctions. At one point, the track emerges at a fenced lookout point overlooking the ponds then brings you around to the concrete bridge above the sewerage line over the creek near the trash rack. Your starting point is up the wooden steps."}, {"url": "https://en.wikipedia.org/wiki/Oatley,_New_South_Wales", "passage_text": "Oatley is notable as the terminus of the first railway electrification project in Sydney, which reached this station from Sydney Central in 1926. When a group gathered in Oatley Park in December 1959, to form a Bowling Club, it was inevitable that the founding members should choose a clock as the club emblem. Oatley Park is a tree covered area that is almost completely surrounded by water. It covers an area of about 45 hectares and it is one of the most significant areas of bushland remaining in the St George area."}, {"url": "https://en.wikipedia.org/wiki/Oatley,_New_South_Wales", "passage_text": "Oatley is located 18 kilometres south of the Sydney central business district and is part of the St George area. Oatley Park is a tree covered area that is almost completely surrounded by water. It covers an area of about 45 hectares and it is one of the most significant areas of bushland remaining in"}, {"url": "http://www.kogarah.nsw.gov.au/__data/assets/pdf_file/0009/4689/Oatley_and_Neverfail_Fauna_Survey_2010_r.pdf", "passage_text": "Oatley Point Reserve is a more effective conservation area because of its greater size and shape. Unlike Neverfail Bay Reserve, which is long and thin, Oatley Point Reserve is much wider and has less edge impacts as a result. Access to the reserve is from Herbert Street (where there is a designated car parking area) or from Algernon Street. There are several walking tracks in the reserve; the main one commences from the Herbert Street car park and continues around the base of the reserve to Oatley Point."}, {"url": "https://en.wikipedia.org/wiki/Oatley_Point_Reserve", "passage_text": "Oatley Point Reserve is a reserve located in the Sydney suburb of Oatley. It has Panoramic views of Georges River and Oatley Bay, as well as some of the highest quality remnant coastal forest in the Municipality of Kogarah. It is home to a colony of sugar gliders, ringtailed possums and dusky antechinus."}, {"url": "https://en.wikipedia.org/wiki/Oatley,_New_South_Wales", "passage_text": "Oatley Pleasure Grounds is a bush park located on Annette Street. It has a size of 3.4 hectares (34,000 m 2) and was built by Harry Linmark at some point before 1934. Numerous performances were performed in the park previously, and a wine bar was constructed. The bar was later shut down due to noise complaints. Oatley Park is a tree covered area that is almost completely surrounded by water. It covers an area of about 45 hectares and it is one of the most significant areas of bushland remaining in the St George area."}, {"url": "http://www.kogarah.nsw.gov.au/__data/assets/pdf_file/0009/4689/Oatley_and_Neverfail_Fauna_Survey_2010_r.pdf", "passage_text": "2.2 Oatley Point Resrve Oatley Point Reserve is a much larger area of bushland than Neverfail Bay Reserve and is over 3 Ha in area. It is located on Oatley Point, as the south-western headland of Oatley Bay (figure 4). It is surrounded on three sides by water. Figure 4 Oatley Point Reserve. Access to the reserve is from Herbert Street (where there is a designated car parking area) or from Algernon Street. There are several walking tracks in the reserve; the main one commences from the Herbert Street car park and continues around the base of the reserve to Oatley Point."}]