[{"url": "http://www.babynamespedia.com/meaning/Tiziano", "passage_text": "Tweet. [ syll. ti-zia-no, tiz-i- ano ] The baby boy name Tiziano is pronounced as T IY Ziy AA Now †. Tiziano is largely used in the Italian language and its origin is Latin. The name is of the meaning honored. It is from the element 'titulus' meaning title of honor. Titianus (Latin) is an original form of Tiziano. Titianus is derived ultimately from Titus; it was borne by a 6th century bishop of Brescia in Lombardy."}, {"url": "http://www.babynamewizard.com/baby-name/boy/tiziano", "passage_text": "Personal experiences with the name Tiziano: | Edit. Share what you know! Nicknames for Tiziano: | Edit. Share what you know! Meanings and history of the name Tiziano : | Edit. Share what you know! Famous real-life people named Tiziano: | Edit. Venetian Renaissance painter Tiziano Vecellio (better known as Titian)."}, {"url": "http://www.babynamewizard.com/baby-name/boy/tiziano", "passage_text": "From the Greek Titos, an ancient name of uncertain derivation. Some believe it to be from the Greek tīo (to honor). From A World of Baby Names by Teresa Norman. Buy the book."}, {"url": "http://www.ourbabynamer.com/meaning-of-Tiziano.html", "passage_text": "Traditionally, the first born son was named after the father's father, the first daughter after the father's mother, the second son after the mother's father, and the second daughter after the mother's mother."}, {"url": "http://www.babynamespedia.com/meaning/Tiziano", "passage_text": "The name Tiziana (German and Italian) is the female equivalent of Tiziano. The name Titian (English) and the name Tizian (German) are variants of Tiziano. Tiziano is a rarely used baby name for boys. It is not listed in the top 1000 names."}, {"url": "http://www.behindthename.com/name/tiziano", "passage_text": "Meaning & History. Italian form of the Roman cognomen Titianus, which was derived from the Roman praenomen TITUS. A famous bearer was the Venetian Renaissance painter Tiziano Vecellio, known in English as Titian."}]