[{"url": "http://nces.ed.gov/FastFacts/display.asp?id=76", "passage_text": "Question: What are the trends in the cost of college education? Response: For the 2012–13 academic year, annual current dollar prices for undergraduate tuition, room, and board were estimated to be $15,022 at public institutions, $39,173 at private nonprofit institutions, and $23,158 at private for-profit institutions."}, {"url": "http://admissions.utexas.edu/tuition/cost-of-attendance", "passage_text": "Tuition & Fees. The average cost of tuition and fees based on 12 hours per semester enrollment for undergraduate students and nine hours for graduate students (fall or spring), or nine hours of enrollment for undergraduate students and three hours for graduate students (summer). Cost of attendance is broadly defined as the average cost to attend a college or university for one academic year—the fall and spring semesters."}, {"url": "https://www.wellsfargo.com/financial-education/college/how-much-college-costs/", "passage_text": "When it comes to figuring out how much college will cost, tuition is just the beginning. Carefully managing expenses and planning out ways to pay for them can reduce the likelihood of overspending and accumulating unnecessary debt. "}, {"url": "http://www.collegedata.com/cs/content/content_payarticle_tmpl.jhtml?articleId=10064", "passage_text": "Colleges often report a combined tuition and fees figure. According to the College Board, the average cost of tuition and fees for the 2014–2015 school year was $31,231 at private colleges, $9,139 for state residents at public colleges, and $22,958 for out-of-state residents attending public universities. Housing and Meals. The cost of room and board depends on the campus housing and food plans you choose. The College Board reports that the average cost of room and board in 2014–2015 ranged from $9,804 at four-year public schools to $11,188 at private schools. Colleges also provide room and board estimates for living off campus based on typical student cost"}, {"url": "http://www.answers.com/Q/Average_college_semester_cost", "passage_text": "Edit. Share to:   Not factoring in the Financial Aid, a year of college on average costs about $45,000. (this is considering tuition, housing, books, dorm supplies, and misc.) I know I' … m paying close to $45,000 at a school that costs $41,000 to attend. 5 people found this useful. The average cost for a college baseball stadium can range between  $20 to $40 million. This is low compared to Major League stadiums."}, {"url": "https://bigfuture.collegeboard.org/pay-for-college/college-costs/college-costs-faqs#!", "passage_text": "It's a discount of your college costs that you do not have to pay back. For example, the average published price of in-state tuition and fees at a four-year public college is $9,139, but the average net price — what the average family really pays — is just $3,030. Read 9 Things You Need to Know About Net Price. Tuition is the price colleges charge for classes. Students also pay other fees related to enrolling in and attending a college. The cost of tuition and fees varies by college. There is a wide range of prices, as the table below shows. But you should know that half of all full-time undergraduate students at public and private nonprofit four-year colleges attend institutions that charge tuition and fees of $11,550 or less"}, {"url": "http://admissions.utexas.edu/tuition/cost-of-attendance", "passage_text": "Definitions. The average cost of tuition and fees based on 12 hours per semester enrollment for undergraduate students and nine hours for graduate students (fall or spring), or nine hours of enrollment for undergraduate students and three hours for graduate students (summer). Cost of attendance is broadly defined as the average cost to attend a college or university for one academic year—the fall and spring semesters."}]