[{"url": "http://www.foodadditivesworld.com/articles/defoamer.html", "passage_text": "Application of Antifoaming Agents. 1  It is used in some detergents to reduce the formation of foam. 2  Like dishwashers should be less in foam formation than the normal detergents so in this defoamers are used. 3  Coke, Sprite, chicken nuggets and other cold drinks contain anti foaming agents."}, {"url": "http://www.foodadditivesworld.com/articles/defoamer.html", "passage_text": "August 31, 2010-. Defoamer is an antifoaming agent that inhibits the formation of foam on the surface of liquids by reducing the surface tension. In the additive industry it is typically known as defoamer or defoaming agent. It is mostly used in the industrial processes to give speed to the process."}, {"url": "http://encyclopedia2.thefreedictionary.com/Anti-foaming+agent", "passage_text": "antifoaming agent. (organic chemistry). A substance, such as silicones, organic phosphates, and alcohols, that inhibits the formation of bubbles in a liquid during its agitation by reducing its surface tension. 1  Facebook. 2  Twitter."}, {"url": "http://www.foodadditivesworld.com/articles/defoamer.html", "passage_text": "Application of Antifoaming Agents. 1  It is used in some detergents to reduce the formation of foam. 2  Coke, Sprite, chicken nuggets and other cold drinks contain anti foaming agents. 3  Defoamers are also used in number of industrial processes like wood pulp, paint, paper, food processing etc. 4  In pharmaceutical industry defoamers are used as to reduce ..."}, {"url": "https://en.wikipedia.org/wiki/Defoamer", "passage_text": "A defoamer or an anti-foaming agent is a chemical additive that reduces and hinders the formation of foam in industrial process liquids. The terms anti-foam agent and defoamer are often used interchangeably. Commonly used agents are insoluble oils, polydimethylsiloxanes and other silicones, certain alcohols, stearates and glycols. The additive is used to prevent formation of foam or is added to break a foam already formed."}, {"url": "http://www.foodadditivesworld.com/articles/defoamer.html", "passage_text": "Defoamer is an antifoaming agent that inhibits the formation of foam on the surface of liquids by reducing the surface tension. In the additive industry it is typically known as defoamer or defoaming agent."}]