[{"url": "http://www.animalbliss.com/mexican-mole-lizard/", "passage_text": "It is one of four species of amphisbaenians that have legs. It should not be confused with a salamander. Mexican Mole Lizards are pink, lizard-like reptiles, 18–24 cm (7.1–9.4 in) snout-to-vent length and 6–7 mm (0.24–0.28 in) in width. They live for one to two years. Mexican Mole Lizard – Reproduction. This species is oviparous and the females lay one to four eggs in July. The species only breeds underground. The eggs hatch after two months."}, {"url": "http://animals.wikia.com/wiki/Mexican_Mole_Lizard", "passage_text": "Mexican Mole Lizard. 3,543 pages on this wiki. The Mexican mole lizard, (Bipes biporus), also known as the five-toed worm lizard, ajolote, or simply as Bipes, is a species of amphisbaenian, which is endemic to Baja California, Mexico. "}, {"url": "http://www.theworldsbestever.com/2014/09/02/mexican-mole-lizard/", "passage_text": "Neither mole nor lizard, the Mexican mole lizard (Bipes biporus) lives up to a third of its name by being a native of the Baja California peninsula in Mexico. Mexican mole lizards live almost exclusively in a shallow underground environment made of loose or sandy soil, but can dig burrows up to 15 centimetres below the surface in search of food, a good place to mate, or just some valuable time away from all that desert heat."}, {"url": "http://eol.org/pages/453890/details", "passage_text": "Mexican mole lizard. Learn more about this article. The Mexican mole lizard (Bipes biporus), commonly known as the five-toed worm lizard, ajolote, or simply as Bipes, is a species of amphisbaenian, which is endemic to Baja California, Mexico. It is one of four species of amphisbaenians that have legs."}, {"url": "http://www.realmonstrosities.com/2011/07/mexican-mole-lizard.html", "passage_text": "There are 4 species of Mexican Mole Lizard but all the fame seems to be centred on just one, Bipes biporus, who has five toes, is about 20 cm (8 in) long and less than 1 cm wide. It seems like the other species have just 3 or 4 toes. Mexican Mole Lizards aren't really lizards at all but they are a relation, and so too are snakes. These Ajolotes have a genus to themselves called Bipes, referring to their two legs."}, {"url": "https://en.wikipedia.org/wiki/Mexican_mole_lizard", "passage_text": "From Wikipedia, the free encyclopedia. The Mexican mole lizard (Bipes biporus), commonly known as the five-toed worm lizard, or simply as Bipes, is a species of amphisbaenian, which is endemic to the Baja California Peninsula. It is one of four species of amphisbaenians that have legs. Description [edit]. They are pink, lizard-like reptiles, 18–24 cm (7.1–9.4 in) snout-to-vent length and 6–7 mm (0.24–0.28 in) in width, that live for one to two years. Their skin is closely segmented to give a corrugated appearance, and like earthworms, their underground movement is by peristalsis of the segment"}, {"url": "http://www.realmonstrosities.com/2011/07/mexican-mole-lizard.html", "passage_text": "Mexican Mole Lizard. Mexican Mole Lizards, or Ajolotes, are reptiles that meld the comical, the creepy and maybe even the cute to create... confusion. They sort of remind me of the Turtle Frog, which turns out to be quite reasonable because they both spend their lives digging through the earth. Mexican Mole Lizards aren't really lizards at all but they are a relation, and so too are snakes. These Ajolotes have a genus to themselves called Bipes, referring to their two legs."}]