[{"url": "http://localfoods.about.com/od/steaming/qt/How-To-Steam-Cauliflower.htm", "passage_text": "Bring about 1/4 inch of water to a boil in a large frying pan. Add about 1/2 teaspoon fine sea salt and trimmed and cleaned cauliflower florets. Cover and steam until as tender as you like (about 3 minutes for crisp-tender and up to 8 minutes for completely cooked, soft florets). The classic method of steaming uses a steamer basket or insert. Bring about an inch of water to a boil in the bottom of a pot into which your steamer basket or insert fits. If you don't see water in the bottom of the bowl, add a tablespoon of water. Cover the bowl with a microwave-safe lid or plate (avoid plastic wrap in microwaves), and cook on high power for 1 minute. Test for tenderness and repeat at 30-second intervals until the cauliflower is steamed to your liking."}, {"url": "http://localfoods.about.com/od/preparationtips/qt/steambrussels.htm", "passage_text": "Put cleaned and trimmed brussels sprouts in a large bowl with a scant tablespoon or so of water on the bottom, cover the brussels sprouts with a microwave-safe lid or plate (avoid plastic wrap in microwaves), and cook on high power for 1 minute. Bring a scant 1/2 inch salted water to boil in a large frying pan or saute pan. Add the brussels sprouts, cover, reduce the heat to medium-low, and cook until the sprouts are tender to the bite and the water has evaporated, about 5 minutes (depending on how crisp you like your cooked sprouts)."}, {"url": "http://localfoods.about.com/od/preparationtips/qt/steambrussels.htm", "passage_text": "Bring about an inch of water to a boil in the bottom of a pot into which your steamer basket or insert fits. Put trimmed and cleaned brussels sprouts in the steamer basket, set over the boiling water, cover, and steam until tender to the bite, about 5 minutes. Bring a scant 1/2 inch salted water to boil in a large frying pan or saute pan. Add the brussels sprouts, cover, reduce the heat to medium-low, and cook until the sprouts are tender to the bite and the water has evaporated, about 5 minutes (depending on how crisp you like your cooked sprouts)."}, {"url": "http://www.wholefoodsmarket.com/recipe/steamed-carrots-and-brussels-sprouts-tarragon", "passage_text": "Method: Fill a large pot with an inch of water and arrange a large steamer basket in the bottom of the pot. Cover and bring water to a boil. Uncover and arrange Brussels sprouts and carrots in basket. Cover and steam, tossing vegetables halfway through, until tender and bright, 12 to 15 minutes. Transfer to a bowl, add oil or butter, salt, pepper and tarragon and toss well."}, {"url": "http://www.enjoy-how-to-cook.com/how-to-cook-brussels-sprouts.html", "passage_text": "Here how to cook Brussels sprouts by braising them: Take a pot big enough to hold all your Brussels sprouts in a single layer, and fill it with about an inch of water. The water shouldn't be so high that it'll completely cover the Brussels sprouts when you put them in. So no matter how you're doing it, rule #1 of how to cook Brussels sprouts is don't overcook the sprouts ! And if you follow that rule, you'll find that a perfectly cooked Brussels sprout actually has a wonderful taste with a bit of a nutty tone to it."}, {"url": "http://www.wikihow.com/Cook-Brussels-Sprouts", "passage_text": "5. Roast the Brussels sprouts for 35-40 minutes or until they're tender. After 30 minutes, start checking to see if they're tender by piercing them with a fork. Shake the pan from time to time to ensure that they cook more evenly. Cook the Brussels sprouts for 3-5 minutes, or until they're brown. Gently stir the Brussels sprouts to mix them with the other ingredients. If the pan gets too dry, add another tablespoon of butter."}, {"url": "http://www.epicurious.com/archive/seasonalcooking/fall/brussels-sprouts", "passage_text": "If you want to convert a Brussels sprouts hater, simply toss the sprouts with olive oil, salt, and pepper, and stick them in a 425°F oven for approximately 30 minutes. Alternatively, you can pan-fry sliced sprouts for crunch and texture. 1  Cook to Perfection. "}, {"url": "http://www.wikihow.com/Cook-Brussels-Sprouts", "passage_text": "3. Place the Brussels sprouts in the boiling water and cook them for 10-15 minutes. Cook them until they're tender -- when they're ready, you should be able to stick a fork in them. Cook the Brussels sprouts for 3-5 minutes, or until they're brown. Gently stir the Brussels sprouts to mix them with the other ingredients. If the pan gets too dry, add another tablespoon of butter."}]