[{"url": "http://www.askanaturopath.com/faqs/swollen-lymph-glands/p/683", "passage_text": "Causes of swollen lymph glands. 1  allergies (wheat and dairy). 2  recent antibiotic use. 3  sinusitis. 4  Candida. 5  inner ear infection/ blocked ears/ infection/ glue ear. 6  sore throat/ tonsillitis. 7  upper respiratory infection. 8  low immunity. I have three enlarged lymph nodes, all are slightly firm, movable, and very tender to the touch. The lymphatic glands (lymph nodes) are found in the throat area at the side of the neck, down the sternum, groin and armpits."}, {"url": "http://answers.webmd.com/answers/1198511/can-allergies-cause-swollen-glands", "passage_text": "Swelling in the lymph nodes in the area of the neck, jaw, and throat can sometimes occur. However, swollen lymph glands can also be caused by viral and bacterial infections and other causes. Like the other symptoms of seasonal allergies, swollen lymph nodes eventually go away without causing any problems. "}, {"url": "http://www.collectivewizdom.com/SwollenLymphNodes-Top10CausesandRemedies.html", "passage_text": "Think of it as your body's water. In fact, the word lymph comes from the word Lympha, the Roman God of fresh water (in contrast, the god Neptune ruled the seas).When the lymph nodes are malfunctioning, fluid builds in the tissue and the area of the lymph node becomes swollen and inflamed. Similar to toothache, the swollen lymph nodes are caused by bacteria that enter your body through your mouth.The best remedy for gingivitis is prevention. If it is at the stage where your lymph nodes are swollen you need to visit your dentist as it is a very serious condition."}, {"url": "http://www.livestrong.com/article/491075-swollen-lymph-nodes-in-my-neck-after-eating/", "passage_text": "Swelling in your lymph nodes after eating may be a sign of an allergic reaction because food allergies cause increased inflammation in soft tissue throughout your body. Make an appointment with your doctor to discuss the possible foods that trigger your symptoms. "}, {"url": "http://www.cancer.org/cancer/cancerbasics/lymph-nodes-and-cancer", "passage_text": "When there’s a problem, such as infection, injury, or cancer, the node or the group of lymph nodes in that area may swell or enlarge as they work to filter out the “bad” cells. This may be called lymphadenopathy (LIMF-ad-uh-NOP-uh-thee). In most cases, only one area of nodes swells at a time. When more than one area of lymph nodes is swollen it’s called generalized lymphadenopathy. Some infections (such as strep throat and chicken pox), certain medicines, immune system diseases, and cancers like lymphoma and leukemia can cause this kind of swelling."}, {"url": "http://www.everydayhealth.com/lymphoma/specialists/what-makes-lymph-nodes-swell-up.aspx", "passage_text": "Lymph nodes help your body fight infection by producing lymph, a fluid that travels throughout your body and filters impurities such as bacteria and abnormal cells. There are a number of reasons why a lymph node may become swollen, including infection, inflammation and lymphoma. Infection is the most common. "}, {"url": "http://healthquestions.medhelp.org/swollen-breast-milk-glands", "passage_text": "Read More. During each menstrual cycle, breast tissue sometimes swells because hormonal stimulation causes the breast’s milk glands and ducts to enlarge, and in turn, the breast retain water. The breast may feel swollen and painful. "}, {"url": "http://www.healthline.com/symptom/breast-swelling", "passage_text": "Breasts are made up of four main tissue structures: fat tissue, glands, milk ducts, and connective tissue. The fat (or adipose) tissue in particular is subject to fluctuations in fluid volume, which can cause breast swelling. This occurrence can cause sore or tender breasts. Premenstrual syndrome (PMS) is a common cause of breast swelling. Prior to starting her period, a woman’s estrogen production increases. This causes changes to her body, including enlarged breast ducts and milk glands. Women also tend to retain more water during this time, which can cause increased swelling. PMS-related symptoms tend to improve when a woman starts her period"}]