[{"url": "http://bahamasislandproperty.com/building-costs.html", "passage_text": "Cost of construction on the islands. Here, as in any country, construction costs in the Bahamas vary depending on the location, terrain and topography of the construction site, design of the building, the materials used and the quality of finish. Costs can be as low as $65 to $80 per square foot for low cost, wooden housing. However, a modest home of concrete block construction with timber roof framing should cost between $100 to $150. An average home will cost around $150 to $200. A better than average home with good quality finishes can cost $200 to $400. For luxury, high end, homes the cost can be well over $400 per square foot though, naturally, this would include the finest finishes and details associated with such upscale housing."}, {"url": "http://buildgrenada.com/building-costs.html", "passage_text": "The Cost of Building a House in the Caribbean. To find the average price for these houses click on cost per sq ft. The buildings give approx. sizes and price in USD. Long before you are able to consider the actual cost of the particular house that you want to build you will need to know the approximate price of the sort of home that you have in mind."}, {"url": "http://myharbourislandbahamas.com/property/building.htm", "passage_text": "Construction costs vary widely depending on the location of the construction site, the design of the building, the materials used and the finishes. Costs per square foot of finished house may be as low as $65-80 for low cost housing or as high as $400 for a luxury home with the finest finishes and details. The average seems to be about $200 per square foot. Count on the cost being 40% higher than for a similar home in south Florida. This is mainly due to freight, duty and delivery cost to site representing approximately 65% of the F.O.B. material cost."}, {"url": "http://www.concretenetwork.com/concrete-homes/cost.html", "passage_text": "Many homeowners assume that a concrete home will cost considerably more than a comparable stick-built house. But in reality, you may actually save money by building with concrete when you factor in life-cycle costs, utility expenses and maintenance requirements. But in general, a typical 2,000 square foot home in the center of the U.S.will save approximately $200 in heating costs and $65 in air conditioning annually. What's more, ICF construction allows the installation of smaller heating and cooling equipment, which can save you hundreds or even thousands of dollars."}, {"url": "http://buildgrenada.com/building-costs.html", "passage_text": "Let's begin by considering what square foot construction costs really are, nothing more than the total cost of a given project divided by the total number of square feet in that project. So, a 2,000 square foot building with construction costs of $250,000 would be $125 per square foot to build. Long before you are able to consider the actual cost of the particular house that you want to build you will need to know the approximate price of the sort of home that you have in mind."}, {"url": "http://www.concretenetwork.com/concrete-homes/cost.html", "passage_text": "When planning a new house, estimate that building the walls with ICFs and concrete, using an experienced crew, will add about $.25 to $3.25 per square foot to the cost. But in general, a typical 2,000 square foot home in the center of the U.S.will save approximately $200 in heating costs and $65 in air conditioning annually. What's more, ICF construction allows the installation of smaller heating and cooling equipment, which can save you hundreds or even thousands of dollars."}, {"url": "http://buildgrenada.com/building-costs.html", "passage_text": "Builders will tell you how much per square foot they usually charge for construction, they can also give you a ballpark idea of what your house might cost, however it is important to know exactly what is included in the price. Long before you are able to consider the actual cost of the particular house that you want to build you will need to know the approximate price of the sort of home that you have in mind."}, {"url": "https://answers.yahoo.com/question/index?qid=20090307182518AAkP4lx", "passage_text": "This Site Might Help You. RE: How much does it cost to build a house with concrete? Let&#39;s say a midsize house where wood frames are replaced with poured concrete (basement, basement walls, floors, walls, ceilings). A roof with asphalt tiles wouldn&#39;t be necessary tho. "}, {"url": "http://www.ehow.com/how_5008308_build-house-bahamas.html", "passage_text": "Most houses in the Bahamas won't be built for less than $500,000. There is usually a five-step payment option. For the payment plan, there is an initial down payment that totals about 40 percent of the total cost to build; the second payment is made after foundation is laid. The Bahamas is a beautiful chain of islands and the ideal vacation spot for many. Building a home in the Bahamas requires a bit of work and finesse to pull off. Finding the resources to build a home in the Bahamas can be expensive and time consuming."}]