[{"url": "http://www.prevention.com/health/health-concerns/best-treatments-sciatic-nerve-pain", "passage_text": "Sciatica is leg pain caused by a pinched nerve in the lower back. Although the pangs begin in nerve roots located on either side of the lower spine, they then course through the sciatic nerve, which runs the length of each leg from the buttock down to the foot. "}, {"url": "http://www.webmd.com/back-pain/tc/sciatica-topic-overview", "passage_text": "Symptoms of sciatica include pain that begins in your back or buttock and moves down your leg and may move into your foot. Weakness, tingling, or numbness in the leg may also occur. 1  Sitting, standing for a long time, and movements that cause the spine to flex (such as knee-to-chest exercises) may make symptoms worse. Sciatica is pain, tingling, or numbness produced by an irritation of the nerve roots that lead to the sciatic nerve. The sciatic nerve is formed by the nerve roots coming out of the spinal cord into the lower back. It goes down through the buttock, then its branches extend down the back of the leg to the ankle and foot"}, {"url": "http://www.cnn.com/2014/08/19/health/sciatica-pain-relief-yoga/index.html", "passage_text": "Sciatica -- pain that radiates along the path of the sciatic nerve. Sciatic nerve -- this runs from your low back through your hips and buttocks and down each leg. Piriformis muscle -- located on the front part of your body in the hip area. Hip flexor -- a group of muscles that help you move your leg from the hip. (CNN) -- Sciatica is a real pain in the butt -- and, sometimes, in the leg and foot. That's because the sciatic nerves, the longest nerves in your body, run bilaterally from the base of the spine through the deep muscles of the buttocks and all the way down the back of each leg."}, {"url": "http://www.bigbackpain.com/sciatica.html", "passage_text": "Stretching the piriformis can prevent a tight piriformis from putting pressure on the sciatic nerve. Stretching the hamstrings may also help prevent sciatica as tight hamstrings pull the pelvis backward causing uneven compression of discs in the lumbar spine. Causes of Sciatica. Sciatica is caused by inflammation or compression of the sciatic nerve or nerve roots in the lower spine. It may also be caused by damage to nerve roots. Sciatica is not a disease in itself and its causes are various."}, {"url": "http://www.mayoclinic.org/diseases-conditions/sciatica/basics/symptoms/CON-20026478", "passage_text": "Symptoms. Pain that radiates from your lower (lumbar) spine to your buttock and down the back of your leg is the hallmark of sciatica. You might feel the discomfort almost anywhere along the nerve pathway, but it's especially likely to follow a path from your low back to your buttock and the back of your thigh and calf"}, {"url": "http://www.bigbackpain.com/sciatica.html", "passage_text": "Piriformis stretches (muscles deep in the buttocks region) can relieve sciatica that is caused by a tight piriformis putting pressure on the sciatic nerve. Low-impact aerobic exercises such as walking increase the endurance of the core muscles and the legs, increase circulation and promote healing. Causes of Sciatica. Sciatica is caused by inflammation or compression of the sciatic nerve or nerve roots in the lower spine. It may also be caused by damage to nerve roots. Sciatica is not a disease in itself and its causes are various."}, {"url": "http://www.spine-health.com/blog/massage-ease-sciatica-pain", "passage_text": "Shooting pain, numbness, and/or tingling down one side of your lower back and into your leg or foot may be an indication you are suffering from irritation to the sciatic nerve. Sciatica is often caused by a problem in the lower back that compresses nerve roots and sends pain signals down the back of the leg. Many different conditions in the spine can irritate the sciatic nerve. The most common causes of sciatica include: 1  Lumbar Herniated Disc. 2  Lumbar Degenerative Disc Disease (DDD). 3  Isthmic Spondylolisthesis. 4  Lumbar Spinal Stenosis. 5  Piriformis Syndrome. 6  Sacroiliac Joint Dysfunction (SI Joint Pain)."}, {"url": "https://yogainternational.com/article/view/7-poses-to-soothe-sciatica", "passage_text": "Symptoms can include: 1  Pain anywhere along the sciatic nerve pathway: in the lower back, buttock, back of the thigh, and/or calf. 2  Fatigue, numbness, or loss of feeling in your legs and/or feet. 3  An electric, tingling, burning, pinching, or pins-and-needles feeling known as paresthesia. 1"}, {"url": "http://www.nhs.uk/Livewell/Backpain/Pages/sciatica-exercises.aspx", "passage_text": "This exercise routine is designed to help relieve sciatica – a pain caused by the irritation or compression of the sciatic nerve. The sciatic nerve runs from the back of your pelvis, through your buttocks, all the way down both legs, ending at your feet. "}]