[{"url": "http://www.livestrong.com/article/88137-side-effects-eating-expired-yogurt/", "passage_text": "If you experience abdominal cramping within hours or days of eating expired yogurt, the yogurt is a probable culprit. If such cramping is severe, worsens or persists, seek medical attention."}, {"url": "http://www.livestrong.com/article/88137-side-effects-eating-expired-yogurt/", "passage_text": "Diarrhea is a common symptom that occurs after one has consumed expired yogurt, as the body is attempting to rid itself of harmful toxins the yogurt provided. To prevent such a reaction, check expiration dates on yogurt packaging and do not consume it past the expiration date."}, {"url": "http://www.livestrong.com/article/88137-side-effects-eating-expired-yogurt/", "passage_text": "Vomiting can occur as a result of consuming expired foods, such as yogurt. Extensive vomiting can lead to physical weakness, electrolyte imbalances and dehydration. To ensure proper health and safety, contact your doctor if vomiting or related symptoms occur after you eat expired yogurt."}, {"url": "http://health.howstuffworks.com/diseases-conditions/allergies/food-allergy/dairy-eggs-meat/yogurt-allergy-symptoms.htm", "passage_text": "Some symptoms of a yogurt allergy include: 1  Itching or swelling of the mouth, tongue or lips. 2  Skin reactions (eczema, hives, swelling and redness of the extremities or face). 3  Gastrointestinal symptoms (abdominal pain, nausea, vomiting, diarrhea)."}, {"url": "http://www.answers.com/Q/If_you_eat_expired_yogurt_will_it_make_you_sick", "passage_text": "Yogurt is a fermented product, and can last long past the expiration date. Generally, expiration dates are for retailers to determine when products should be pulled off the shelves, and most items are good for several days if not weeks past the expiration date. The longer past the date, the more suspect."}, {"url": "http://www.livestrong.com/article/88137-side-effects-eating-expired-yogurt/", "passage_text": "Cramping in the abdominal area may also develop after consuming expired yogurt. Once you have consumed a contaminated food, there is a delay before symptoms of illness become apparent, which may last from hours to days, depending upon how much bacteria and what type of bacteria has been consumed."}, {"url": "http://www.livestrong.com/article/396116-expired-yogurt-food-poisoning/", "passage_text": "Risks of Eating Expired Yogurt. Most symptoms of food poisoning related to yogurt include intestinal distress such as diarrhea. Mold, slow-growing bacteria or microorganisms introduced to the yogurt from added ingredients are the typical causes of food poisoning from yogurt."}, {"url": "http://www.livestrong.com/article/88137-side-effects-eating-expired-yogurt/", "passage_text": "Yogurt that has been stored long past its sell-by date can cause a range of bothersome side effects. Yet, according to a HealthDay News report published on February 2, 2009, Americans commonly consume expired foods, such as yogurt, simply because they own it and may consume expired foods that still appear to be edible."}]