[{"url": "http://scifi.stackexchange.com/questions/5556/why-some-jedi-disappear-when-they-die-while-others-dont", "passage_text": "Star Wars Episode VI: Return of the Jedi. When Vader/Anakin Skywalker dies on the second Death Star, he does not disappear and he is cremated by Luke. Also, they all became a ghost after their death."}, {"url": "http://www.killermovies.com/forums/archive/index.php/t-4062-i-simply-cant-understand-it-can-somone-explain-me-why-did-obi-wan.html", "passage_text": "The reason that Obi Wan let Vader kill him was because Luke had to confront Vader. If Obi Wan would have fought Vader, Luke may have never gotten the chance and therefore would have never known that Vader was his father and he never would have got to confront him."}, {"url": "http://lucasforums.com/showthread.php?t=120522", "passage_text": "I do not believe that Obi-wan could have wanted luke to see him die. unless he had studied the sith teaching and found some truth in them he would not have wanted Luke to hate Darth Vader. Anger, fear, aggression."}, {"url": "http://scifi.about.com/od/starwarsglossaryandfaq/a/SWAR_jedi-death.htm", "passage_text": "A great many Jedi die onscreen in the Star Wars Prequels, on the other hand, and it would be distractingly over-dramatic for all of them to disappear. But the fact that Jedi bodies sometimes disappear and sometimes don't also helps demonstrate the changes in the Jedi characters."}, {"url": "http://scifi.stackexchange.com/questions/5556/why-some-jedi-disappear-when-they-die-while-others-dont", "passage_text": "Some Jedi disappear when they die 1  : At the end of his duel with Vader on the first Death Star, Obi-Wan Kenobi let down his guard and concentrated for a moment, disappearing entirely just as Vader's lightsaber passed through his empty robe."}, {"url": "http://scifi.about.com/od/starwarsglossaryandfaq/a/SWAR_jedi-death.htm", "passage_text": "Qui-Gon Jinn, whose death was a turning point. Lucasfilm Ltd. In the Star Wars Original Trilogy, the only Jedi characters who die are Obi-Wan Kenobi and Yoda, who both disappear. This led many fans to believe that all Jedi disappeared when they died."}, {"url": "http://starwars.wikia.com/wiki/Obi-Wan_Kenobi", "passage_text": "―Anakin Skywalker. Obi-Wan Kenobi, later known as Ben Kenobi during his exile, was a legendary Jedi Master who played a significant role in the fate of the galaxy during the waning days of the Galactic Republic. He was the mentor of both Anakin and Luke Skywalker, training both in the ways of the Force."}]