[{"url": "http://latinenergydance.com/what-is-salsa/", "passage_text": "Salsa dancing is a dance style associated with the salsa style of music now popular worldwide. Salsa music has its origins sometime in the 1950s to 1970s, with the truly distinct salsa style coming out of New York in the 1970s. Salsa is danced to Salsa music. There is a strong Afro-Caribbean influence in the music as well as the dance. Salsa is usually a partner dance, although there are recognized solo steps and some forms are danced in groups of couples, with frequent exchanges of partner (Rueda de Casino)."}, {"url": "http://www.thelatinworld.nl/salsahistory-english.html", "passage_text": "Salsa  sauce in Spanish, is a notion where much and a few are under defeated. In the only sense, salsa is a kind of music, a modern variant of Latin-American music. In the wide side, salsa is a collective noun of various kinds of Latin-American music and dance. What means it now precisely or what are the roots of the salsa. Sauce Such as said before, Salsa means in Spanish sauce."}, {"url": "http://www.dancelessons.net/dancehistory/HistoryofSalsaDance.html", "passage_text": "History of Salsa Dance. Salsa refers to a fusion of informal dance styles having roots in the Caribbean (especially in Cuba and Puerto Rico), Latin and North America. The dance originated through the mixture of Mambo, Danzn, Guaguanc, Cuban Son, and other typical Cuban dance forms. Salsa is danced to Salsa music. "}, {"url": "http://cybertraveltips.com/south-america/venezuela/Venezuela-Dance-Music.html", "passage_text": "The two most important dance forms that are widely popular in Venezuela are the Joropo and the Red Devils of Yare. The Joropo has been designated as the national dance of Venezuela that is performed throughout the country, and is primarily for couples. Other important dance forms that are also popular in Venezuela include the Meringue of the Dominican Republic, Calypso and the Salsa dance of Puerto Rico."}, {"url": "http://www.mapsofworld.com/venezuela/culture/", "passage_text": "Salsa is one of the most popular dance forms in this country. Folk music of Venezuela also forms an important part of Venezuela Culture. Some of the notable figures in the field of Venezuela fine art and literature, the cultural heritage of the country are as follows: Spanish is spoken by majority. However, native languages are prevalent in certain parts of the country. The Venezuela Art is a fine blend of the pre-colonial and the colonial style in the field of painting, fine arts, literature, music and dance."}, {"url": "http://readanddigest.com/what-is-salsa-dancing/", "passage_text": "by Suruchi Puri. Salsa is generally a partner dance, popular throughout Latin America, and also in the United States, Japan, India, Spain, Portugal, France, Italy, Germany, Israel and Eastern Europe. Salsa has its origins in the Cuban Son and Afro-Cuban dance. Though it is generally performed with salsa music, tropical music is also used in some cases during its performance. The Music suitable for Salsa dancing ranges between 150 to 250 BPM (Beats Per Minute) but generally the dancing is done somewhere between 160–220 BPM."}, {"url": "http://silverinternational.mbhs.edu/v163/V16.3.03a.Salsa.htm", "passage_text": "Even though the Salsa is very important in the Dominican Republic, Puerto Rico, and Cuba, it is also important in other Latin countries. I know a lot of people from El Salvador and Nicaragua who really like Salsa, also Mexicans love Salsa a lot, said Mrs. Castro. But one of the most popular varieties of music in Latin America and in the Caribbean is Salsa. There are many popular Latin performers who feel proud to use Salsa to represent their countries. Marc Anthony is a Puerto Rican."}, {"url": "http://www.improve.com/The-Joropo-Dance/3702", "passage_text": "4. The Joropo, [huh-roh-poh] also known as the Venezuelan Waltz, became Venezuela's national dance in 1882 and is authentically Venezuelan, the word joropo now broadly defining poetry, music, fashion, and dance genres. The joropo musical style, which is similar to the waltz, is played..."}, {"url": "http://www.danceintime.com/history.htm", "passage_text": "LATIN DANCES: Salsa. Salsa is one of the most dynamic and important musical phenomena of the 1900's. In many Hispanic communities, it remains today the most popular style of dance and music. The roots of salsa originated in Eastern Cuba early in the l900s. "}]