[{"url": "https://www.gblawyers.com/blog/how-long-to-get-ssi-or-ssdi-if-you-have-a-lawyer/", "passage_text": "The process can take anywhere from one month to three years, depending on where you live and the complexity of your case. It typically takes up to six months to receive a decision when you initially apply for disability. If you are denied, you have the right to a Request for Reconsideration."}, {"url": "http://www.disabilitysecrets.com/resources/social-security-disability/ssdi/collecting-payments.htm", "passage_text": "Social Security makes payments in arrears, which means that when you receive a check, it is for the previous month. The only time this will probably have an impact on you is when you are waiting for your first check to come."}, {"url": "http://www.disabilityadvisor.com/collecting-social-security-disability-benefits/", "passage_text": "Dear Edith, It can take another month or more after the decision to get the letter. How long it takes to get benefits after that depends on whether you have applied for Social Security Disability (SSDI), Supplemental Security Income (SSI) or both. It can be a month to three months after you receive the judge’s letter."}, {"url": "http://www.disabilitysecrets.com/resources/social-security-disability/ssdi/collecting-payments.htm", "passage_text": "Keep in mind that for Social Security Disability Income (SSDI), there is a mandatory five-month waiting period from the date that Social Security determines your disability began (your onset date) to when your monthly payments can start."}, {"url": "http://www.disabilitysecrets.com/resources/social-security-disability/ssdi/collecting-payments.htm", "passage_text": "When Your Benefits Will Be Paid. Social Security makes payments in arrears, which means that when you receive a check, it is for the previous month. The only time this will probably have an impact on you is when you are waiting for your first check to come. Your payment date depends on whether you receive SSI or SSDI."}, {"url": "http://www.disabilityadvisor.com/collecting-social-security-disability-benefits/", "passage_text": "Many decision letters take sixty days or more. Then, if you applied for Social Security only and not Supplemental Security Income (SSI), and you are currently owed money, it can take from two weeks to two months or more to receive benefits."}, {"url": "https://www.gblawyers.com/blog/how-long-to-get-ssi-or-ssdi-if-you-have-a-lawyer/", "passage_text": "If you want to discuss the length of time it takes to get your SSI or SSDI benefits with a lawyer for free, please fill out a free social security online legal consultation, or call our social security disability lawyers for a free SSI or SSDI legal consultation at (301) 589-2200."}, {"url": "http://www.nolo.com/legal-encyclopedia/long-term-disability-insurance-company-take-social-security-disability-backpay.html", "passage_text": "For example, when a person who receives $1,500 in LTD benefits per month is approved for $1,000 in Social Security disability, he will still collect a total of $1,500, but with $1,000 coming from Social Security and the remaining $500 from the LTD insurance carrier."}, {"url": "https://www.gblawyers.com/blog/how-long-to-get-ssi-or-ssdi-if-you-have-a-lawyer/", "passage_text": "Once you have a hearing, it will take approximately two to three months to receive a written decision in the mail from the Judge. The Judge will write a 10-15 page decision, regardless of the outcome, explaining why she or he decided favorably or unfavorably."}]