[{"url": "http://jamesballenger.com/how-to-remove-xfinity-default-home-page-and-default-search/", "passage_text": "3 thoughts on “ How to remove Comcast Xfinity default home page and default search ”. Yeah I hate them too for doing this. This is so lame …. Anyway, stumbled on your website when trying to do the same in Chrome. Firefox Removal. For the homepage change, go to the Firefox button in the upper left or Tools if you are still using a menu bar. Choose options from tools or options then options from the Firefox button. In the General Tab, you can choose what firefox does when it opens"}, {"url": "http://jamesballenger.com/how-to-remove-xfinity-default-home-page-and-default-search/", "passage_text": "For the homepage change click on the three bars at the top right of Google Chrome which is their menu. Then choose settings from this menu. You will see an option that says on startup. You can click the set pages blue text to change the default web page or open new tab or continue where i left off. Firefox Removal. For the homepage change, go to the Firefox button in the upper left or Tools if you are still using a menu bar. Choose options from tools or options then options from the Firefox button. In the General Tab, you can choose what firefox does when it opens"}, {"url": "http://osxdaily.com/2009/08/09/stop-comcast-from-dns-hijacking-redirects/", "passage_text": "1) Your main Comcast account User ID / email address. 2) Your cable modems MAC address. 3) Visit the Comcast “Domain Helper” opt-out URL. In typical Comcast style, they altered your service without your consent, and you have to actually opt-out of the DNS hijacking service, thankfully you can do it online. Good grief. 1. Switch to OpenDNS – It’s free and it works great. http://opendns.com/. 2. Use Level3’s open DNS Servers 10.0.0.2, 10.0.0.3, 10.0.0.4, 10.0.0.5. I actually like the OpenDNS service because I have kids and I can filter the content by turning on the filters. (Optional). It’s also quite a bit faster then DNS thru my ISP."}, {"url": "http://osxdaily.com/2011/11/22/stop-google-com-redirecting/", "passage_text": "Every country just has it’s own Google URL, so we just go to google.de, google.be, google.nl, google.fr, google.co.uk, google.is and so on. It doesn’t matter where I am, I’ve just set the Google URL of my own country as the start page in Safari, so Google is always in my own language. I’ve never thought about people from the USA using google.com and being redirected."}, {"url": "http://jamesballenger.com/how-to-remove-xfinity-default-home-page-and-default-search/", "passage_text": "On the general table there is a homepage box where you can use default, blank or change the Xfinity option. For the search engine change, on the general tab there is a change search defaults row with a settings button. Click this and then remove the Xfinity system and choose your desired default option. Firefox Removal. For the homepage change, go to the Firefox button in the upper left or Tools if you are still using a menu bar. Choose options from tools or options then options from the Firefox button. In the General Tab, you can choose what firefox does when it opens"}, {"url": "http://www.computing.net/answers/networking/comcast-home-activation-page-keep-poping-up/48636.html", "passage_text": "The problem is the home activation page that comes up is for one of the apartments I set-up for my employer. It seems to be stuck on the final steps of this other persons comcast set-up and I cant get it to go away. I have a Linksys router with a secure network. Specs: Windows 7. Okay, I sometimes am forced to use my computer at work to set-up wireless networks for employees who move into temporary apartments. Now every time I am at my home, my computer, ipad, and iphone keep redirecting to comcast home activation page."}]