[{"url": "https://en.wikipedia.org/wiki/Tenofovir", "passage_text": "Tenofovir disoproxil is a prodrug form of tenofovir. It is also marketed under the brand name Reviro by Dr. Reddy's Laboratories. Tenofovir is also available in a fixed-dose combination with emtricitabine in a product with the brand name Truvada for once-a-day dosing. Atripla, a fixed-dose triple combination of tenofovir, emtricitabine, and efavirenz, was approved by the FDA on 12 July 2006 and is now available, providing a single daily dose for the treatment of HIV."}, {"url": "http://www.cranemedic.com/tenvir-em-(generic-truvada).html", "passage_text": "How to use Tenvir-EM The drug has two purposes: TREAT HIV-1 infected patients PREVENT or reduce the risk of contracting the infection Can be taken by HIV-negative men who have sex with other males, which cause a higher risk of the disease and those who are at high risk of contracting HIV sexually. How to use Tenvir-EM. 1  TREAT HIV-1 infected patients. 2  PREVENT or reduce the risk of contracting the infection. 3  Take the recommended dosage exactly as prescribed by your doctor. 4  The dose may differ for those who have HIV-1 and those who may not. 5  Follow the directions on your prescription label."}, {"url": "http://www.ncbi.nlm.nih.gov/pubmedhealth/PMHT0012333/?report=details", "passage_text": "Uses of This Medicine. Tenofovir is used in combination with other medicines for the treatment of the infection caused by the human immunodeficiency virus (HIV). HIV is the virus that causes acquired immunodeficiency syndrome (AIDS). Tenofovir will not cure or prevent HIV infection or AIDS. Tenofovir will not keep you from spreading HIV to other people. People who receive this medicine may continue to have some of the problems usually related to AIDS or HIV disease. Tenofovir is also used to treat chronic (long-term) hepatitis B virus (HBV) infection."}, {"url": "http://www.ncbi.nlm.nih.gov/pubmedhealth/PMHT0012333/?report=details", "passage_text": "Tenofovir does not cure HIV or AIDS, but it may slow the progress of the disease. Tenofovir is always used together with other medicines to treat HIV. This medicine is also used alone to treat chronic (long-term) hepatitis B virus (HBV) infection. Tenofovir will not keep you from spreading HIV to other people. People who receive this medicine may continue to have some of the problems usually related to AIDS or HIV disease. Tenofovir is also used"}, {"url": "https://en.wikipedia.org/wiki/Tenofovir", "passage_text": "1 This indication is based on analyses of plasma HIV-1 RNA levels and CD4 cell counts in controlled studies of tenofovir in treatment-naive and treatment-experienced adults. 2  Tenofovir is indicated for the treatment of chronic hepatitis B in adults and pediatric patients 12 years of age and older. Atripla, a fixed-dose triple combination of tenofovir, emtricitabine, and efavirenz, was approved by the FDA on 12 July 2006 and is now available, providing a single daily dose for the treatment of HIV."}, {"url": "https://en.wikipedia.org/wiki/Tenofovir", "passage_text": "Tenofovir is on the World Health Organization's List of Essential Medicines, the most important medications needed in a basic health system. It is marketed by Gilead Sciences under the trade name Viread (as the fumarate, TDF). Atripla, a fixed-dose triple combination of tenofovir, emtricitabine, and efavirenz, was approved by the FDA on 12 July 2006 and is now available, providing a single daily dose for the treatment of HIV."}, {"url": "http://www.pharmacygeoff.md/TenvirEM_Tenofovir_Disoproxil_Fumarate_Emtricitabine_300mg_p_1810.html", "passage_text": "Cipla. Tenvir-EM containing the 2 active ingredients tenofovir disoproxil fumarate and emtricitabine is considered a nucleoside reverse transcriptase inhibitors (NRTIs) type of medication. The medication works by controlling and preventing the HIV cells from multiplying in the body to help the immune system work better"}, {"url": "http://apps.who.int/prequal/WHOPAR/WHOPARPRODUCTS/HA439part3v1.pdf", "passage_text": "Emtricitabine/Tenofovir Disoproxil Fumarate WHOPAR part 3 February 2012 200mg/300 mg Tablets (Cipla Ltd), HA439 Page 6 of 8 If you have hepatitis B or HIV and hepatitis B together (co-infection), it is very important not to stop your Tenvir EM treatment without talking to your doctor or health care provider first. If you stop taking Tenvir EM: Don’t stop taking Tenvir EM without your doctor’s or health care provider’s advice. Stopping. treatment with Tenvir EM may reduce the effectiveness of the treatment. Talk to your doctor or health."}]