[{"url": "http://www.nutrition-and-you.com/almonds.html", "passage_text": "Almonds are one of the complete sources of energy as well as nutrients. The nuts, especially, are rich in mono-unsaturated fatty acids like oleic, and palmitoleic acids that help in lowering LDL or bad cholesterol and increasing HDL or good cholesterol in the human body. A handful of almonds a day provides much of recommended levels of minerals, vitamins, and protein. Besides, almond oil extracted from the nuts has been used in cooking, and medicine."}, {"url": "http://www.livestrong.com/article/249332-vitamins-in-almonds/", "passage_text": "Almonds contain an assortment of vitamins in small quantities including thiamin, riboflavin, vitamin B-6 and vitamin A. The nuts are an outstanding source of two vitamins in particular -- folate and vitamin E. Carry a bag of almonds in your purse or briefcase for a quick, nutritious snack. One-half cup of whole almonds has 18.33 milligrams of vitamin E. This nutrient is a fat-soluble antioxidant that protects your cells from the damaging effects of free radicals. Additionally, the vitamin is involved in the immune system, cell signaling, metabolism and gene expression"}, {"url": "http://www.livestrong.com/article/249332-vitamins-in-almonds/", "passage_text": "The E-Ticket. One-half cup of whole almonds has 18.33 milligrams of vitamin E. This nutrient is a fat-soluble antioxidant that protects your cells from the damaging effects of free radicals. Additionally, the vitamin is involved in the immune system, cell signaling, metabolism and gene expression"}, {"url": "http://nutsforalmonds.com/nutrition.htm", "passage_text": "The fat in nuts is unsaturated, or the good fat and there is no cholesterol in these fats. If you think almonds are just for satisfying your mid-afternoon munchies, you're in for a surprise! These tasty tidbits pack a nutritional punch, combining tons of essential nutrients in one very delicious package. 20-25 almonds (approximately one ounce) contain as much calcium as 1/4 cup of milk, a valuable tool in preventing osteoporosis. Almonds are the best whole food source of vitamin E, in the form of alpha-tocopherol, which may help prevent cancer."}, {"url": "http://www.nutrition-and-you.com/almonds.html", "passage_text": "Health benefits of Almonds. Almond nuts are rich sources of vitamins, and minerals and packed with numerous health promoting phyto-chemicals. These nuts compose of well-balanced food principles that are essential for optimum health and wellness. A handful of almonds a day provides much of recommended levels of minerals, vitamins, and protein. Besides, almond oil extracted from the nuts has been used in cooking, and medicine."}, {"url": "http://www.nutrition-and-you.com/almonds.html", "passage_text": "The nuts are packed with many important B-complex groups of vitamins such as riboflavin, niacin, thiamin, pantothenic acid, vitamin B-6, and folates. Altogether, these vitamins work as co-factors for enzymes during cellular substrate metabolism inside the human body. A handful of almonds a day provides much of recommended levels of minerals, vitamins, and protein. Besides, almond oil extracted from the nuts has been used in cooking, and medicine."}, {"url": "http://nutsforalmonds.com/nutrition.htm", "passage_text": "Almonds are rich in the vitamins and minerals that help build a healthy heart, especially vitamin E. And these little nutrient nuggets are cholesterol free. Since cholesterol is a major risk factor for heart disease, adding almonds to your diet is a great way to keep that risk under control. 20-25 almonds (approximately one ounce) contain as much calcium as 1/4 cup of milk, a valuable tool in preventing osteoporosis. Almonds are the best whole food source of vitamin E, in the form of alpha-tocopherol, which may help prevent cancer."}, {"url": "http://www.healthyeating.org/Healthy-Eating/All-Star-Foods/Meat-Beans.aspx", "passage_text": "Meat, poultry, fish, beans and peas, eggs, nuts and seeds supply many nutrients and are an important part of healthy eating. Included in the USDA MyPlate's protein group, these healthy foods include not only proteins, but B vitamins (niacin, thiamin, riboflavin, B6 and B12), vitamin E, magnesium, zinc and iron. Cooking with Meat, Beans + Nuts. Dried beans and peas are inexpensive sources of protein. Meat and poultry are nutritious and economical sources of protein and other important nutrients. Many lean meats like beef chuck are lower in fat and also lower in cost."}, {"url": "http://www.nutrition-and-you.com/almonds.html", "passage_text": "Wonderfully delicious, almonds have long been revered as an epitome of wellness and health. The kernels are among the richest sources of health-benefiting nutrients essential for optimum health. Botanically, they are the fruits obtained from medium size tree belonging to the family of Rosaceae, in the genus: Prunus. A handful of almonds a day provides much of recommended levels of minerals, vitamins, and protein. Besides, almond oil extracted from the nuts has been used in cooking, and medicine."}]