[{"url": "http://www.prweb.com/releases/RiseSmart/outplacement_costs/prweb2922634.htm", "passage_text": "These figures represent more than twice the per-employee cost of RiseSmart's services. Traditional outplacement firms charge too much for 'soft services' that fail to deliver results, while RiseSmart combines sophisticated technology with one-on-one support to help laid-off employees find jobs faster, Sathe said. RiseSmart, based in Silicon Valley, is transforming the way companies provide outplacement services and individuals use the Web to find jobs. The San Jose Mercury News says, RiseSmart typifies the valley's knack for using technology to disrupt standard business practices.."}, {"url": "http://www.wsj.com/articles/SB125069793645343423", "passage_text": "Eighteen months later, Ms. Service says outplacement was a waste of time. She says the job-search training was rushed. During a practice lunch interview, a coach chided her for ordering cranberry juice, saying it could be interpreted as a sign of a urinary-tract infection, she recalls. The company says clients who report back to them about getting jobs do so in an average of 16 weeks. Challenger, Gray & Christmas, which says it pioneered outplacement, says its clients find jobs in a median of 14 weeks."}, {"url": "http://www.prweb.com/releases/RiseSmart/outplacement_costs/prweb2922634.htm", "passage_text": "The 2009 survey by the Institute for Corporate Productivity (i4cp) shows that employers are spending an average of more than $5,000 per executive or manager to provide external outplacement support for a period of three to six months-more than double the cost of RiseSmart Transition Concierge outplacement service. RiseSmart, based in Silicon Valley, is transforming the way companies provide outplacement services and individuals use the Web to find jobs. The San Jose Mercury News says, RiseSmart typifies the valley's knack for using technology to disrupt standard business practices.."}, {"url": "http://www.peoplefindinc.com/employers/outplacement/how-much-does-peoplefind-outplacement-cost/", "passage_text": "Core Service Cost: The fee for core service is $1,800. Further services are billed as needed by the released individual and would not exceed the service fee cap set by the employer. Our services are not time limited by month. Instead, they can be accessed for up to one year from an individual’s release date. 12 months, Core service plus 31 points (Up to 36 hours of coaching plus Core Seminars). 12 Months: $15,000. 12 months, Core service plus 66 points (Up to 61 hours of coaching plus Core Seminars). The chart above is presented for simple illustration purposes only."}, {"url": "http://www.wsj.com/articles/SB125069793645343423", "passage_text": "More than two-thirds of 265 U.S. employers with layoffs during the past two years offered outplacement, at an average cost of $3,589 an employee, according to a June survey for The Wall Street Journal by the American Management Association and Institute for Corporate Productivity. The company says clients who report back to them about getting jobs do so in an average of 16 weeks. Challenger, Gray & Christmas, which says it pioneered outplacement, says its clients find jobs in a median of 14 weeks."}, {"url": "http://www.questcareer.com/employer_services.htm", "passage_text": "We specialize in providing affordable one-on-one outplacement services. We are able to provide personalized outplacement services featuring one-on-one time with a Career Transition Consultant at a price below many group seminar outplacement packages. We offer 5 different outplacement packages to meet your needs. These outplacement packages range from 3 months to 12 months in length and are priced from $795 to $2,950. Each package includes one-on-one outplacement support"}, {"url": "http://humanresources.about.com/od/layoffs-downsizing-strategies/a/outplacement.htm", "passage_text": "Another 17.7% receive outpacement for 3-6 months. Executives are likely to receive more services for a longer period of time. The cost of outplacement ranges from a high of over $10,000 for senior executives to $1,472 for hourly employees. The quantity of services is reflected by the range. "}, {"url": "http://www.peoplefindinc.com/employers/outplacement/how-much-does-peoplefind-outplacement-cost/", "passage_text": "It is likely that a person with more points would also consider services beyond coaching. At Core Service plus 16 points ($5,000), for example, the individual might opt for Psychological/Career Assessment and Financial Planning as part of their package. 12 months, Core service plus 31 points (Up to 36 hours of coaching plus Core Seminars). 12 Months: $15,000. 12 months, Core service plus 66 points (Up to 61 hours of coaching plus Core Seminars). The chart above is presented for simple illustration purposes only."}]