[{"url": "https://en.wikipedia.org/wiki/Anthrax", "passage_text": "Anthrax is an acute disease caused by the bacterium Bacillus anthracis. Most forms of the disease are lethal, and it affects mostly animals. It is contagious and can be transmitted through contact or consumption of infected meat. The lethality of the anthrax disease is due to the bacterium's two principal virulence factors: the poly-D-glutamic acid capsule, which protects the bacterium from phagocytosis by host neutrophils, and the tripartite protein toxin, called anthrax toxin."}, {"url": "https://en.wikipedia.org/wiki/Anthrax", "passage_text": "Anthrax does not spread directly from one infected animal or person to another; rather, it is spread by spores. These spores can be transported by clothing or shoes. The body of an animal that had active anthrax at the time of death can also be a source of anthrax spores. The lethality of the anthrax disease is due to the bacterium's two principal virulence factors: the poly-D-glutamic acid capsule, which protects the bacterium from phagocytosis by host neutrophils, and the tripartite protein toxin, called anthrax toxin."}, {"url": "http://www.ph.ucla.edu/epi/bioter/layanthrax_a.html", "passage_text": "Anthrax is caused by the organism Bacillus anthracis. In some parts of the world, this can be found in cattle or other hoofed mammals. It is infrequent in western Europe and the US, and is more likely to be found in animals in south and central America, south and east Europe, Asia and Africa. "}, {"url": "http://www.medicinenet.com/script/main/art.asp?articlekey=18820", "passage_text": "Bacillus anthracis: The bacterium that causes anthrax. Anthrax differs from most bacteria in that they exist in an inactive (dormant) state called spores. The spores are found in soil, animal carcasses and feces (including sheep, goats, cattle, bison, horses, and deer), and animal products (e.g., hides and wool). Bacillus anthracis was discovered in 1850. Notably, it was actually the first bacterium to be shown to cause a disease. In fact, it was the great German physician, Robert Koch, who discovered this."}, {"url": "http://www.niaid.nih.gov/topics/anthrax/Pages/default.aspx", "passage_text": "Anthrax. Anthrax is the disease caused by the bacterium Bacillus anthracis, which lives in soil. The bacterial cell lives as a hardy spore to survive harsh conditions. The spores germinate into thriving colonies of bacteria once inside an animal or person. Cutaneous Anthrax. Cutaneous anthrax is the most common form of the disease. People with cuts or open sores can get cutaneous anthrax if they come in direct contact with the bacteria or its spores, usually through contaminated animal products."}, {"url": "http://www.sfcdcp.org/anthrax.html", "passage_text": "Anthrax disease is a severe illness caused by bacteria named Bacillus anthracis. Anthrax disease can result in pneumonia, blood infection, and death. Most of the time anthrax bacteria live in an inactive form called spores. 1 Lung Anthrax or Pneumonia is the most likely form of disease after an intentional release of anthrax and occurs by breathing in anthrax spores. 2  After exposure, it usually takes 2-7 days (but sometimes up to 2 months) until illness starts."}, {"url": "http://www.medicinenet.com/anthrax/article.htm", "passage_text": "The agent of anthrax is a bacterium called Bacillus anthracis. While other investigators discovered the anthrax bacillus, it was a German physician and scientist, Dr. Robert Koch, who proved that the anthrax bacterium was the cause of a disease that affected farm animals in his community. Ingestion of anthrax can cause serious, sometimes fatal disease. The most deadly form is inhalation anthrax. If the spores of anthrax are inhaled, they migrate to lymph glands in the chest where they proliferate, spread, and produce toxins that often cause death."}, {"url": "http://web.uconn.edu/mcbstaff/graf/Student%20presentations/Banthracis/Banthracis.html", "passage_text": "Bacillus Anthracis. By Robert Spicuzza. Background: This image provided by the Microbe library. Bacillus anthracis is a gram-positive spore-forming rod. It was the first bacterium to be used to prove that bacteria caused diseases, when Robert Koch (1877) produced anthrax spores and injected them into animals. Bacillus anthracis is a commonly found in soil of grazing area"}, {"url": "http://www.health.ny.gov/diseases/communicable/anthrax/fact_sheet.htm", "passage_text": "Anthrax is diagnosed when the Bacillus anthracis bacterium is found in the blood, skin lesions or respiratory secretions by a laboratory culture. It can also be diagnosed by measuring specific antibodies in the blood of infected persons. Anthrax is usually spread in the form of a spore. (A spore is a dormant form that certain bacteria take when they have no food supply. Spores can grow and cause disease when better conditions are present, as in the human body.) Anthrax is generally spread in one of three ways."}, {"url": "http://www.austincc.edu/microbio/2993s/ba.htm", "passage_text": "Anthrax is a disease of microbial origin caused by the bacterium Bacillus anthracis, a Gram‐positive, endospore‐forming rod. The word nthrax comes from the Greek word for coal; the origin of this word likely being the coal‐black lesions cutaneous anthrax causes on victims skin. "}]