[{"url": "http://www.flightofthebutterflies.com/life-cycle/", "passage_text": "First as an egg, then as a caterpillar, next as a pupa in its chrysalis, and finally, it emerges as a butterfly. This entire process takes about four weeks from start to finish; although the warmer it is, the shorter the cycle."}, {"url": "http://www3.canisius.edu/~grandem/butterflylifecycle/The_Lifecycle_of_a_Butterfly_print.html", "passage_text": "Butterflies go through a life cycle. There are four stages. The first stage is the eggs. This is where a girl butterfly lays eggs. She lays them on a leaf. The second stage is the caterpillar. This is where the eggs hatch. It takes about five days for the eggs to hatch. A caterpillar then comes out."}, {"url": "http://www.answers.com/Q/What_is_the_process_of_metamorphoses_in_a_butterfly", "passage_text": "There are four stages in a butterfly's life. The process of going from one stage to another is called metamorphosis. The first stage begins when the female lays her eggs, usually on a plant which will provide food. Soon, a caterpillar, called a larva, begins to form inside each egg."}, {"url": "http://www3.canisius.edu/~grandem/butterflylifecycle/The_Lifecycle_of_a_Butterfly_print.html", "passage_text": "A butterfly has four stages in its life cycle. Each stage is different. Each stage also has a different goal. A butterfly becoming an adult is called metamorphosis. The life cycle process can take a month to year. It depends on the type of butterfly."}, {"url": "http://www.thebutterflysite.com/life-cycle.shtml", "passage_text": "To grow into an adult they go through 4 stages: egg, larva, pupa and adult. Each stage has a different goal-for instance, caterpillars need to eat a lot, and adults need to reproduce. Depending on the type of butterfly, the life cycle of a butterfly may take anywhere from one month to a whole year."}, {"url": "http://www.butterflybushes.com/monarch_metamorphosis.htm", "passage_text": "Metamorphosis is the series of developmental stages insects go through to become adults. Butterflies and moths have four stages of life: egg, larva (the caterpillar stage), pupa (the chrysalis phase in a butterfly's development), and adult. It takes a monarch butterfly just 28 to 38 days to complete its life cycle, with warmer temperatures generally being responsible for faster development."}, {"url": "http://www.ansp.org/explore/online-exhibits/butterflies/lifecycle/", "passage_text": "Food eaten at this time is stored and used later as an adult. Caterpillars can grow 100 times their size during this stage. For example, a monarch butterfly egg is the size of a pinhead and the caterpillar that hatches from this tiny egg isn't much bigger. But it will grow up to 2 inches long in several weeks."}]