[{"url": "http://www.answers.com/Q/Does_a_polygon_usually_have_more_sides_or_more_angles", "passage_text": "A polygon, by definition, always has the same number of angles and  sides. Each pair of adjacent sides defines an angle and each pair  of adjacent angles are at the ends of … a side."}, {"url": "http://regentsprep.org/regents/math/geometry/GG3/Polygon.htm", "passage_text": "A polygon has the same number of angles as sides. Polygons can be classified as either convex or concave. A polygon is convex if no line that contains a side of the polygon contains a point in the interior of the polygon. In a convex polygon, each interior angle measures less than 180 degrees."}, {"url": "http://www.answers.com/Q/Does_a_polygon_have_more_sides_or_more_angles", "passage_text": "Answer by Csanders0. Confidence votes 12.6K. A polygon, by definition, always has the same number of angles and sides. Each pair of adjacent sides defines an angle and each pair of adjacent angles are at the ends of a side."}, {"url": "http://www.answers.com/Q/Does_a_polygon_have_more_sides_or_more_angles", "passage_text": "Does a polygon usually have more sides or angles? Assuming that the polygon is formed from a closed circuit of ray, then the number of ray and the number of angles will be equal."}, {"url": "http://www.calvarychristianschool.net/students/math/grade5/polygon%20questions.pdf", "passage_text": "Does a rectangle have more sides or angles? ______________4. How many sides does a pentagon have? ______________5. Which has more sides: a hexagon or a pentagon? ______________6. How many pairs of parallel lines does a trapezoid have? ______________7. How many pairs of parallel lines does a square have? ______________8."}, {"url": "http://www.calvarychristianschool.net/students/math/grade5/polygon%20questions.pdf", "passage_text": "Does a rectangle have more sides or angles? the same number of each4. How many sides does a pentagon have? 5 sides5. Which has more sides: a hexagon or a pentagon? hexagon (6 sides)6. How many pairs of parallel lines does a trapezoid have? 1 pair7."}, {"url": "https://www.superteacherworksheets.com/geometry/polygons_TZFMZ.pdf", "passage_text": "How many sides does an octagon have? _____________________ 2. How many angles does a triangle have? _____________________ 3. Does a rectangle have more sides or angles? _____________________ 4. How many sides does a pentagon have? _____________________ 5. Which has more sides: a hexagon or a pentagon? _____________________ 6. How many pairs of parallel lines does a trapezoid have? _____________________ 7."}]