[{"url": "https://en.wikipedia.org/wiki/Hermetic", "passage_text": "The term  hermetic  may refer to: 1  Hermeticism, a magical and religious movement stemming from the teachings of Hermes Trismegistus. 2  Hermeticism (poetry) , a literary movement in poetry started in Italy. 3  Hermeticism (history of science) , reconstructing the mode of thought held by 17th century scientists. 1 Hermeticism, a magical and religious movement stemming from the teachings of Hermes Trismegistus. 2  Hermeticism (poetry) , a literary movement in poetry started in Italy. 3  Hermeticism (history of science) , reconstructing the mode of thought held by 17th century scientists."}, {"url": "http://ezinearticles.com/?What-is-Hermetics?&id=1859034", "passage_text": "Most people I know have never heard of it, though most have heard of the term hermetically sealed. It is very difficult to encapsulate what Hermetics exactly is. It is kind of like trying to define what magic or mysticism is, as it is very nebulous. Hermetics is basically the study and science of magic, alchemy, and astrology"}, {"url": "http://www.merriam-webster.com/dictionary/hermetic", "passage_text": "Full Definition of HERMETIC. 1. often capitalized a: of or relating to the mystical and alchemical writings or teachings arising in the first three centuries a.d. and attributed to Hermes Trismegistus b: relating to or characterized by occultism or abstruseness: recondite. 2. Biographical Note for HERMETIC. Her·mes Tris·me·gis·tus, \\ˈhər-(ˌ)mēz-ˌtris-mə-ˈjis-təs\\ Greek mythological character. Hermes Trismegistus was identified by the Greeks with the Egyptian god Thoth. To him was ascribed authorship of various works on astrology, magic, alchemy, and medicine. It was also believed that he had invented a magic seal to keep vessels airtight, and from his name the adjective hermetic meaning airtight was derived"}, {"url": "https://en.wikipedia.org/wiki/Hermeticism", "passage_text": "The term Hermetic is from the medieval Latin hermeticus, which is derived from the name of the Greek god, Hermes. In English, it has been attested since the 17th century, as in Hermetic writers (e.g., Franz Bardon). The word Hermetic was used by Dr. Everard in his English translation of The Pimander of Hermes (1650). An account of how Hermes Trismegistus received the name Thrice Great is derived from the The Emerald Tablet of Hermes Trismegistus, wherein it is stated that he knew the three parts of the wisdom of the whole universe. The three parts of the wisdom are alchemy, astrology, and theurgy"}, {"url": "http://www.newhermetics.com/", "passage_text": "Click Here to find out how to order the New Hermetics Audio Programs. The New Hermetics community is a large and diverse group of individuals who seek enlightenment, liberation, self-actualization, and are not afraid to apply every possible tool in their quest, both ancient and new. "}, {"url": "http://www.hermeticfellowship.org/HFHermeticism.html", "passage_text": "The Shorter Answer. Hermeticism is an ancient spiritual, philosophical, and magical tradition. It is a path of spiritual growth. Hermeticism takes its name from the God Hermes Hermês (Trismegistos, Greek-Thrice Greatest), hermes A-Graeco græco egyptian form of The Great egyptian God of Wisdom, And. magic thoth thôth"}, {"url": "https://en.wikipedia.org/wiki/Hermeticism", "passage_text": "Not to be confused with Hermit. Hermeticism, also called Hermetism, is a religious and philosophical tradition based primarily upon writings attributed to Hermes Trismegistus (Thrice Great). An account of how Hermes Trismegistus received the name Thrice Great is derived from the The Emerald Tablet of Hermes Trismegistus, wherein it is stated that he knew the three parts of the wisdom of the whole universe. The three parts of the wisdom are alchemy, astrology, and theurgy"}]