[{"url": "https://en.wikipedia.org/wiki/Vascular_plant", "passage_text": "1 Vascular plants have vascular tissues which distribute resources through the plant. 2  This feature allows vascular plants to evolve to a larger size than non-vascular plants, which lack these specialized conducting tissues and are therefore restricted to relatively small sizes. Vascular plants (from Latin vasculum: duct), also known as tracheophytes (from the equivalent Greek term trachea) and also higher plants, form a large group of plants that are defined as those land plants that have lignified tissues (the xylem) for conducting water and minerals throughout"}, {"url": "http://www.differencebetween.com/difference-between-vascular-and-vs-nonvascular-plants/", "passage_text": "Plants, which do not have vascular systems are called non vascular plants or lower plants. These plants do not contain xylem or phloem tissues. But they have special tissues for translocation of water. Bryophytes, including liverworts, mosses, and hornworts belong to non vascular plant group. • Xylem tissues of vascular plants contain lignified tissues, and those provide support and rigidity to plant. Due to unavailability of water conducting tissues non vascular plants are tender and comparatively shorter than vascular plants."}, {"url": "https://en.wikipedia.org/wiki/Non-vascular_plant", "passage_text": "Non-vascular plants include two distantly related groups: 1  Bryophytes-Bryophyta (mosses), Marchantiophyta (liverworts), and Anthocerotophyta (hornworts). 2  In these groups, the primary plants are the haploid gametophytes, with the only diploid portion being the attached sporophyte, consisting of a stalk and sporangium. Although non-vascular plants lack these particular tissues, many possess simpler tissues that are specialized for internal transport of water. Non-vascular plants do not have a wide variety of specialized tissue types."}, {"url": "http://www2.estrellamountain.edu/faculty/farabee/biobk/BioBookDiversity_5.html", "passage_text": "Plants divide into two groups: plants lacking lignin-impregnated conducting cells (the nonvascular plants) and those containing lignin-impregnated conducting cells (the vascular plants). Living groups of nonvascular plants include the bryophytes: liverworts, hornworts, and mosses. Vascular plants are the more common plants like pines, ferns, corn, and oaks. The phylogenetic relationships within the plant kingdom are shown in Figure 1. "}, {"url": "http://mhhe.com/biosci/esp/2001_gbio/folder_structure/di/m6/s5/index.htm", "passage_text": "The non-vascular plants are members of three phyla, the mosses, liverworts, and hornworts. The three phyla are traditionally called bryophytes. In these plants the gametophyte is the dominant portion of the life cycle. The plants appear leafy but lack true stems, roots or leaves. "}, {"url": "http://www.differencebetween.com/difference-between-vascular-and-vs-nonvascular-plants/", "passage_text": "• Vascular plants have true stem, leaves and roots. But non vascular plants have stem and leave like structures and rhizoids, instead of true structures. • Xylem tissues of vascular plants contain lignified tissues, and those provide support and rigidity to plant. Due to unavailability of water conducting tissues non vascular plants are tender and comparatively shorter than vascular plants."}, {"url": "http://study.com/academy/lesson/nonvascular-plants-examples-definition-characteristics.html", "passage_text": "Vascular plants, such as trees and flowering plants most people think about, have vascular vessels to transport water and food throughout the plant. Within vascular plants is the phloem, the vessel that transports food, and the xylem, which transports water. Nonvascular plants are small, simple plants without a vascular system. They do not have a phloem or xylem. Nonvascular plants, also known as bryophytes, are small, simple plants without a vascular system. They are divided into three different types, including mosses, liverworts, and hornworts."}, {"url": "https://simple.wikipedia.org/wiki/Non-vascular_plant", "passage_text": "Non-vascular plants is a general term for those plants without a vascular system (xylem and phloem). Although non-vascular plants do not have these particular tissues, a number of them possess other tissues specialized for internal transport of water. The term non-vascular plant is no longer used in scientific nomenclature. Non-vascular plants include two distantly related groups: 1  The Bryophyta (mosses), the Marchantiophyta (liverworts), and the Anthocerotophyta (hornworts)."}, {"url": "http://faculty.college-prep.org/~bernie/sciproject/project/Kingdoms/Plantae3/non-vascular.htm", "passage_text": "General Information. Non-vascular plants are the simplest of all land dwelling plants. Their closest ancestor is the green algae, and like the green algae, they lack an internal means for transporting water. Also, non-vascular plants do not produce seeds or flowers. In terms of physical appearance, non-vascular plants typically only reach a height of one or two centimeters due to their lack of the woody tissue necessary for support on land. In addition, they are almost always found in damp, shady places. "}, {"url": "https://en.wikipedia.org/wiki/Non-vascular_plant", "passage_text": "Non-vascular plants are plants without a vascular system (xylem and phloem). Although non-vascular plants lack these particular tissues, many possess simpler tissues that are specialized for internal transport of water. Non-vascular plants do not have a wide variety of specialized tissue types."}]