[{"url": "https://en.wikipedia.org/wiki/Pyrimidine_dimer", "passage_text": "Pyrimidine dimers are molecular lesions formed from thymine or cytosine bases in DNA via photochemical reactions. Ultraviolet light induces the formation of covalent linkages by reactions localized on the C=C double bonds. In dsRNA (double-stranded RNA), uracil dimers may also accumulate as a result of UV radiation. Two common UV products are cyclobutane pyrimidine dimers (CPDs, including thymine dimers) and 6,4 photoproducts."}, {"url": "https://en.wikipedia.org/wiki/Pyrimidine", "passage_text": "Pyrimidine is an aromatic heterocyclic organic compound similar to pyridine. One of the three diazines (six-membered heterocyclics with two nitrogen atoms in the ring), it has the nitrogen atoms at positions 1 and 3 in the ring. The other diazines are pyrazine (nitrogen atoms at the 1 and 4 positions) and pyridazine (nitrogen atoms at the 1 and 2 positions). In nucleic acids, three types of nucleobases are pyrimidine derivatives: cytosine (C), thymine (T), and uracil (U)."}, {"url": "http://www.koofers.com/flashcards/micr-lab-33-lab-quiz-4/review", "passage_text": "When DNA absorbs UV light, it causes the formation of ___. pyrimidine dimers. Click Card to flip. When DNA absorbs UV light, it causes the formation of ___. Pyrimidine dimers These form when a covalent bond is formed between 2 adjacent thymine or cytosine molecules in a DNA strand. 260 nm, because this wavelength is the specific wavelength at which DNA maximally absorbs UV light. When DNA absorbs UV light, it causes the formation of ___. pyrimidine dimers. Pyrimidine dimers. These form when a covalent bond is formed between 2 adjacent thymine or cytosine molecules in a DNA strand."}, {"url": "http://www.bx.psu.edu/~ross/workmg/RepairDNACh7.htm", "passage_text": "Figure 7.11. Pyrimidine dimers formed by UV radiation, illustrated for adjacent thymidylates on one strand of the DNA. (A) Formation of a covalent bond between the C atoms at position 5 of each pyrimidine and between the C atoms at position 6 of each pyrimidine makes a cyclobutane ring connecting the two pyrimidines. Misincorporation during replication is the major pathway for introducing transversions into DNA. Normally, DNA is a series of purine:pyrimidine base pairs, but in order to have a transversion, a pyrimidine has to be paired with another pyrimidine, or a purine with a purine."}, {"url": "https://answers.yahoo.com/question/index?qid=20101118133326AAtDqDx", "passage_text": "Best Answer: A dimer product found in DNA chains damaged by ultraviolet irradiation. Most frequently thymidine dimers. They consist of two adjacent pyrimidine nucleotides, usually thymine nucleotides, in which the pyrimidine residues are covalently joined by a cyclobutane ring. These dimers stop DNA replication. http://www.mondofacto.com/facts/dictiona... Report Abuse. Pyrimidine dimer: a product of ultraviolet radiation of pyrimidines in nucleic acids; most frequently thymidine dimers. Source(s): http://www.wrongdiagnosis.com/videos/ind..."}, {"url": "http://www-personal.ksu.edu/~bethmont/mutdes.html", "passage_text": "The major lethal lesions are pyrimidine dimers in DNA (produced by UV-B and UV-C)--these are the result of a covalent attachment between adjacent pyrimidines in one strand. This is shown here for a thymine-thymine dimer and here for a thymine-cytosine dimer. A third type of spontaneous DNA damage that occurs frequently is damage to the bases by free radicals of oxygen. These arise in cells as a result of oxidative metabolism and also are formed by physical agents such as radiation."}, {"url": "http://www-personal.ksu.edu/~bethmont/mutdes.html", "passage_text": "A. Base pair (nucleotide pair) substitutions. These are of two types: transitions (purine to purine or pyrimidine to pyrimidine) and transversions (purine to pyrimidine or pyrimidine to purine). We break these down into the two categories because they can occur in different ways. A third type of spontaneous DNA damage that occurs frequently is damage to the bases by free radicals of oxygen. These arise in cells as a result of oxidative metabolism and also are formed by physical agents such as radiation."}]