[{"url": "http://www.payscale.com/research/US/Job=Sign_Language_Interpreter/Hourly_Rate", "passage_text": "Sign Language Interpreter Salary. (United States). Median pay for Sign Language Interpreters in the United States is around $24.91 per hour. Earnings generally vary between $14.82 per hour and $41.78. Geography and experience level each impact pay for this group, with the former having the largest influence."}, {"url": "http://work.chron.com/much-sign-language-interpreters-paid-8154.html", "passage_text": "Certification. As with many vocations, certifications improve salaries for ASL interpreters. A professional certification from the Registry of Interpreters for the Deaf, or RID, can increase hourly wages to as much as $30 to $35 per hour, or $62,000 to $73,000 per year. A sign language interpreter at the CIA can earn anywhere from $75,000 to $116,000 per year with an RID and National Interpreter Certification. Related Reading: Roles and Duties of Court I"}, {"url": "http://money.usnews.com/careers/best-jobs/interpreter-and-translator/salary", "passage_text": "Salary Outlook. According to the BLS, interpreters and translators earned a median annual salary of $42,420 in 2013. The best-paid earned more than $77,140, while the lowest-paid earned less than $22,180. However, the average salary of interpreters and translators is higher than that of exterminators ($32,480) and garbage collectors ($35,280)."}, {"url": "http://learn.org/articles/What_is_the_Average_Entry-Level_Salary_for_an_Interpreter.html", "passage_text": "Salary Overview. The potential salary for interpreters depends on factors that include training, education and experience. According to data it released in May 2012, the U.S. Bureau of Labor Statistics (BLS), www.bls.gov, listed the average interpreter and translator hourly wage as $25.68 an hour, or $53,410 a year."}, {"url": "http://www.salarylist.com/jobs/Sign-Language-Interpreter-Salary.htm", "passage_text": "Sign Language Interpreter Salary. Sign Language Interpreter average salary is $-, median salary is $- with a salary range from $- to $-. Sign Language Interpreter salaries are collected from government agencies and companies. Each salary is associated with a real job position. Sign Language Interpreter average salary is $-, median salary is $- with a salary range from $- to $-. Sign Language Interpreter salaries are collected from government agencies and companies"}, {"url": "http://learn.org/articles/What_is_the_Average_Salary_for_a_Sign_Language_Interpreter.html", "passage_text": "If you have strong English skills, the commitment to learn a new language and a desire to assist others, then you might enjoy a career as a sign language interpreter. As a sign language interpreter, you translate spoken English into American Sign Language (ASL) for the benefit of deaf or hearing-impaired individuals. Salary Overview. According to the Registry of Interpreters for the Deaf (RID), salary statistics for this field are hard to come by, mostly because sign language interpreter jobs and their pay vary widely (www.rid.org)."}, {"url": "http://learn.org/articles/What_is_the_Average_Salary_for_a_Sign_Language_Interpreter.html", "passage_text": "Mean hourly wages in the states with the highest employment levels of interpreters and translators were $24.68 for California, $43.70 for Virginia, $22.21 for Texas, $27.28 for New York and $19.60 for Florida. Salary Overview. According to the Registry of Interpreters for the Deaf (RID), salary statistics for this field are hard to come by, mostly because sign language interpreter jobs and their pay vary widely (www.rid.org)."}, {"url": "http://study.com/articles/Be_an_American_Sign_Language_Interpreter_Salary_and_Career_Info.html", "passage_text": "Salary Information for ASL Interpreters. In May 2013, translators and interpreters across all fields, including ASL and foreign language translators and interpreters, earned an average annual income of $47,920, the U.S. Bureau of Labor Statistics (BLS) reports (www.bls.gov). Earnings as an ASL interpreter largely depend on one's level of experience and place of work. In May 2013, the BLS reported that the highest paid interpreters and translators worked for engineering services, office administrative services, and the federal government."}, {"url": "http://work.chron.com/much-sign-language-interpreters-paid-8154.html", "passage_text": "But this figure accounts for all interpreters and translators. American Sign Language interpreters earn closer to $39,000, or $18.85 per hour, according to Bridgerland Applied Technology College. This salary is for Utah, which typically aligns with the national average. A sign language interpreter at the CIA can earn anywhere from $75,000 to $116,000 per year with an RID and National Interpreter Certification. Related Reading: Roles and Duties of Court Interpreters."}]