[{"url": "https://en.wikipedia.org/wiki/Grassroots", "passage_text": "Faking a grassroots movement is known as astroturfing, which, as the name suggests, is named after AstroTurf, the iconic brand of artificial grass. Astroturfing means pretending to be a grassroots movement, when in reality the agenda and strategy are controlled by a hidden, non-grassroots organization. Major examples include parts of the American Civil Rights Movement of the 1950s and 1960s and the German peace movement of the 1980s. A particular instantiation of grassroots politics in the American Civil Rights Movement was the 1951 case of William Van Til working on integration of the Nashville Public Schools."}, {"url": "http://www.huffingtonpost.com/stefanie-penn-spear/grassroots-activism-and-environmentalism_b_1559586.html", "passage_text": "Grassroots activism is the core of the environmental movement. Nowhere have I found that to be more evident than at Heartwood Forest Council gatherings. "}, {"url": "https://en.wikipedia.org/wiki/Grassroots", "passage_text": "Grassroots organizations derive their power from the people, thus their strategies seek to engage ordinary people in political discourse to the greatest extent possible. Below is a list of strategies considered to be grassroots because of their focus on engaging the populous. Major examples include parts of the American Civil Rights Movement of the 1950s and 1960s and the German peace movement of the 1980s. A particular instantiation of grassroots politics in the American Civil Rights Movement was the 1951 case of William Van Til working on integration of the Nashville Public Schools."}, {"url": "https://en.wikipedia.org/wiki/Grassroots", "passage_text": "A grassroots movement (often referenced in the context of a political movement) is driven by a community's politics. Major examples include parts of the American Civil Rights Movement of the 1950s and 1960s and the German peace movement of the 1980s. A particular instantiation of grassroots politics in the American Civil Rights Movement was the 1951 case of William Van Til working on integration of the Nashville Public Schools."}, {"url": "http://www.wisegeek.com/what-is-grassroots-activism.htm", "passage_text": "These 10 animal facts will amaze you. Grassroots activism consists of a group of like-minded people coming together for a cause they believe in. Grassroots activists are not usually controlled by any political party. Their issues are often directly opposed to the policies of the major political powers. Grassroots activism is often defined as being at the bottom of the political pyramid. Grassroots causes and issues are often the opposite of those of the political powers at the top of the pyramid. However, many major politicians become involved in grassroots issues if they feel strongly enough about the issue"}, {"url": "http://www.renewamerica.com/grassroots.htm", "passage_text": "Both the march and the rally, which occurred in 2000, were staged entirely by a small group of volunteer activists. Back to Activism page. How the grassroots works Any political strategy that depends on broad grassroots support for its success needs to be based on a sound understanding of how the grassroots works. Without such an understanding, the strategy will tend to miscalculate its approach to handling the grassroots, resulting in failure. Below are principles for working with the grassroots, based on the typical behavior of those who join grassroots movements. These principles cannot be divorced from any serious attempt to reclaim America through broad grassroots activism."}, {"url": "https://en.wikipedia.org/wiki/Grassroots_democracy", "passage_text": "(October 2014). Grassroots democracy is a tendency towards designing political processes where as much decision-making authority as practical is shifted to the organization's lowest geographic or social level of organization. Grassroots organisations can have a variety of structures; depending on the type of organisation and what the members want. These can be non-structured and non-hierarchical organisations that are run by all members, or by whichever member wishes to do something."}, {"url": "http://www.aacn.org/wd/practice/content/publicpolicy/grassroots.pcms?menu=", "passage_text": "Grassroots Activism. Grassroots activities are those that influence legislation or stimulate change through the ability to persuade or change public opinion. It involves making allies of people who can effect change, and persuading others to take your concerns seriously"}, {"url": "https://en.wikipedia.org/wiki/Grassroots", "passage_text": "The term implies that the creation of the movement and the group supporting it are natural and spontaneous, highlighting the differences between this and a movement that is orchestrated by traditional power structures. Major examples include parts of the American Civil Rights Movement of the 1950s and 1960s and the German peace movement of the 1980s. A particular instantiation of grassroots politics in the American Civil Rights Movement was the 1951 case of William Van Til working on integration of the Nashville Public Schools."}]