[{"url": "http://www.bavaria.us/germany-bavaria-tradition-events-customs-july-august", "passage_text": "During 30 Years War (1618 - 1648) broad parts of germany have been destroyed, while the mediaeval city of Dinkelsbuehl dinkelsbühl has been left in good. Condition this is because of the children Of dinkelsbuehl dinkelsbühl who plead for favour with the. swedish colonel"}, {"url": "http://www.bavaria.by/annafest-at-the-forchheim-beer-gardens-bavaria", "passage_text": "Family Days with reduced prices are on Tuesday and Thursday from 1.00 pm to 6.00 pm. With seatings for about 30.000 the Kellerwald provides enough space for the 450.000 - 500.000 visitors who come during the 10-day festival period, so that everyone, from near or far, can always find a seat."}, {"url": "http://www.bavaria.us/beer-wine-festivals-events-bavaria", "passage_text": "Annafest at the Forchheim Beer gardens from 24th July to 3rd August 2015 ». Well known is the annual Anna Festival in Forchheim. It is celebrated annually around July 26th, which is the name day of Saint Anna’s mother Mary. There are 20 beer cellars in the “Cellar Forest” serving food and drinks."}, {"url": "http://event-carnival.com/germany/annafest-forchheim", "passage_text": "- Aug 3rd, 2015. The Annafest Forchheim (Beer Festival) event is a welcoming and charming Franconian folk festival that highlights food, drinks, carnival rides, and live music."}, {"url": "http://event-carnival.com/germany/annafest-forchheim", "passage_text": "This is a family-friendly event, which offers “Family Days,” with reduced prices on the Tuesday and Thursday of the festival, from 1:00 to 6:00 in the afternoon. Annafest Forchheim takes place at Kellerwald in Forchheim, Germany."}, {"url": "http://www.bavaria.by/annafest-at-the-forchheim-beer-gardens-bavaria", "passage_text": "Annafest at the Forchheim Beer gardens from 24th July to 3rd August 2015. Each year at the end of July, the Kellerwald is the center of franconian hospitality. The Annafest celebrated here since 1840 is one of the most interesting and charming folk festivals in Franconia."}, {"url": "http://www.learn-german-online.net/en/learning-german-resources/public-festivals-in-germany.htm", "passage_text": "Every year there are about 10,000 occasions where public festivals are celebrated, so there is always a possibility to have some fun: Whether it's a parish fair, a riflemen's meeting, a religious festivity, a pageant or some sort of jubilee-in Germany about 200 million visitors participate in these events."}, {"url": "http://www.bavaria.by/beer-wine-festivals-events-bavaria", "passage_text": "Annafest at the Forchheim Beer gardens from 24th July to 3rd August 2015 ». Well known is the annual Anna Festival in Forchheim. It is celebrated annually around July 26th, which is the name day of Saint Anna’s mother Mary. There are 20 beer cellars in the “Cellar Forest” serving food and drinks."}, {"url": "https://en.wikipedia.org/wiki/Annafest", "passage_text": "The Annafest is a Franconian folk festival held yearly about 26 July (St. Anna's day) in the Kellerwald (Cellar Woods) in the town of Forchheim."}]