[{"url": "http://www.wikihow.com/Choose-Ductless-Range-Hoods", "passage_text": "How to Choose Ductless Range Hoods. A ductless range hood, also called a recirculating range hood, is one that does not exhaust air outdoors through a duct. Instead, this type of hood draws air through a filter before circulating it back into the room. "}, {"url": "http://www.shopyourway.com/questions/1053604", "passage_text": "2 Answers from these members: The ducted range hoods are definitely better in getting rid of smoke/steam and odors from the kitchen by exhausting them outside. Your current model microwave combination vent hood likely has a higher CFM rating than the 200 CFM rated vent hood that you were considering. "}, {"url": "http://www.bestbrandtobuy.com/ductless-range-hood/", "passage_text": "This type of filter is great for a ductless range hood as it makes sure that no foul odor is circulated through your kitchen. Some ductless range hoods will come with an aluminum filter as well. This filter does not need to be replaced but it must be kept clean. There are three different styles of range hoods available. The styles are ducted, ductless, and convertible range hoods. A ducted range hood requires a duct to be installed and to have access to the outside of your home. The ductless range hood does not require this. The convertible range hood can be effective regardless of if there is a duct being used or not. The ductless range hood is a popular choice for people that do not have the ability to ventilate through a duct that goes outside of your home. If a ducted range hood will work in your home though, it would be a superior option to the ductless model"}, {"url": "http://www.youtube.com/watch?v=f-PEE9j2TTE", "passage_text": "http://www.prolinerangehoods.com/. How to install a PLFW520 Range Hood. 1  Howto & Style. "}, {"url": "http://ths.gardenweb.com/discussions/2322203/ductless-hood-with-a-pro-range", "passage_text": "I can't comment on the performance of that style of hood, but their build quality is excellent and their conventionally-vented hoods are much, much quieter than similar Broan and Best by Broan units. Like Bookmark December 1, 2009 at 12:28PM. Thank you for reporting this comment. "}, {"url": "http://www.wisegeek.org/what-are-ductless-range-hoods.htm", "passage_text": "Top 10 unbelievable historical concurrencies. Ductless range hoods are one of three different types of range hoods, along with ducted, or vented, range hoods and convertible range hoods. Vented range hoods require access to outside from the area in the kitchen where the stove is located. "}, {"url": "http://www.youtube.com/watch?v=zekrgdtty5s", "passage_text": "http://www.prolinerangehoods.com/. When a ducted range hood is not possible, your best choice for kitchen ventiation is a ductless range hood by ProLine Range Hoods. Our recirculating filtration system filters and cleans the air from your cooking in an inexpensive yet efficient way that ensures your cooking environment remains pleasant and odor free"}, {"url": "http://www.sears.com/shc/s/t_10153_12605?tName=ductless-range-hoods.html", "passage_text": "Air King AD1368 Wide Range Hood, 36'', Stainless Steel, 180 CFM-Everything You Need For Your Home & Garden ... The Advantage Series Range Hoods feature a low profile contemporary style with a 60 watt maximum cook top light (bulb not included) and a two speed fan control delivering economical ventilation. "}, {"url": "http://www.thekitchn.com/all-about-ductless-range-hoods-range-hood-spotlight-177269", "passage_text": "Range Hood Style: Ductless. Overview: Unlike a ducted range hood, which vents air to the outside, a ductless range hood consists of a fan (or a blower, motor) with a charcoal filter that sucks up grease particles, heat, smells, and smoke, filters it, and then recirculates it back into the kitchen. "}]