[{"url": "https://uk.answers.yahoo.com/question/index?qid=20070821075023AATMxJo", "passage_text": "DNA means deoxyribonucleic acid and it is one of of the two nucleic acids contained in every cell (not only in fhe blood therefore) of every living being (also in plants). It's a macromolecule in which the sequences of 4 bases (nucleophiles) encodes the gene activity. A and T and C and G fit together, and they form a ladder-like double helix shape. Each of these combinations instructs a single amino acid (small unit of protien) to do a certain job, whether it is A and T, T and A, C and G or G and C. Each person has a unique DNA and so do all animals etc."}, {"url": "http://www.dnasaves.org/dna_testing.php", "passage_text": "And, unlike fingerprints, which can only be found if a suspect touches something, DNA exists in every cell of the human body, from hair and blood to skin and tears, and can be shed or deposited while committing a crime. That means it is often the only means for accurate identification. Because of its ability to link physical evidence found at a crime scene to a single person, it is often referred to as a “digital fingerprint.” This method is so precise that it can ensure pinpoint accuracy, down to one in a billion."}, {"url": "https://uk.answers.yahoo.com/question/index?qid=20070821075023AATMxJo", "passage_text": "Best Answer: DNA is Deoxyribonucleic Acid. It is found in every cell may it be human, animal, plant or fungus. Inside the nucleus of each human cell (excluding the sex cells) you will find 23 pairs (NOT 13) of chomosomes. Chromosomes are made up of very, very long strands of DNA wound up like rope very tightly. A and T and C and G fit together, and they form a ladder-like double helix shape. Each of these combinations instructs a single amino acid (small unit of protien) to do a certain job, whether it is A and T, T and A, C and G or G and C. Each person has a unique DNA and so do all animals etc."}, {"url": "https://uk.answers.yahoo.com/question/index?qid=20070821075023AATMxJo", "passage_text": "DNA, or deoxyribonucleic acid, is the code that determines the way you look. It determines your hair color, eye color, etc. DNA is coiled up (it is a double helix structure and is very long) in every cell, therefore it can be found on your skin, saliva, hair follicles, and almost anywhere else. A and T and C and G fit together, and they form a ladder-like double helix shape. Each of these combinations instructs a single amino acid (small unit of protien) to do a certain job, whether it is A and T, T and A, C and G or G and C. Each person has a unique DNA and so do all animals etc."}, {"url": "http://ghr.nlm.nih.gov/handbook/basics/dna", "passage_text": "Most DNA is located in the cell nucleus (where it is called nuclear DNA), but a small amount of DNA can also be found in the mitochondria (where it is called mitochondrial DNA or mtDNA). The information in DNA is stored as a code made up of four chemical bases: adenine (A), guanine (G), cytosine (C), and thymine (T). The structure of the double helix is somewhat like a ladder, with the base pairs forming the ladder’s rungs and the sugar and phosphate molecules forming the vertical sidepieces of the ladder. An important property of DNA is that it can replicate, or make copies of itself."}, {"url": "https://uk.answers.yahoo.com/question/index?qid=20070821075023AATMxJo", "passage_text": "DNA is a small segment of the chromosome that codes for a specific trait.DNA is found in the nucleus of cells.hence a DNA sample can be obtained from the blood, skin and even hair.but bear in mind that DNA cannot be obtained from red blood cells as they do not have a nucleus. A and T and C and G fit together, and they form a ladder-like double helix shape. Each of these combinations instructs a single amino acid (small unit of protien) to do a certain job, whether it is A and T, T and A, C and G or G and C. Each person has a unique DNA and so do all animals etc."}, {"url": "http://lithium.imascientist.org.au/2012/05/20/i-know-dna-stands-for-deoxyribonucleic-acid-but-what-exactly-is-dna-and-what-is-its-main-purpose/", "passage_text": "DNA is the biological instructions that make each and every species unique, and encodes for all the things that give the organism the ability to grow, survive and reproduce. DNA is found in all living organisms, and consists of a code. It consists of four nucleotides or bases – Adenine (A), Thymine (T), Guanine (G) and Cytosine (C). These four bases are stuck together in various combinations (known as as the DNA sequence) along a backbone made of sugar and phosphates in a long line. The bases match to each other – A to T, and C to G. The bases match together, and end up wound up – what forms is known as a DNA double helix. It looks like this: http://lejeuneusa.org/wp-content/uploads/2010/09/dna-double-helix.jpg. In total humans have 6 billion bases of DNA, which make up our genome."}, {"url": "https://en.wikipedia.org/wiki/DNA", "passage_text": "Deoxyribonucleic acid (/diˌɒksiˌraɪbɵ.njuːˌkleɪ.ɨk ˈaesɪd/ ; ˈæSɪD) dna is a molecule that carries most of the genetic instructions used in the, development functioning and reproduction of all known living organisms and many. viruses The two DNA strands are known as polynucleotides since they are composed of simpler units called nucleotides. Each nucleotide is composed of a nitrogen-containing nucleobase —either cytosine (C), guanine (G), adenine (A), or thymine (T)—as well as a monosaccharide sugar called deoxyribose and a phosphate group."}, {"url": "http://ghr.nlm.nih.gov/handbook/basics/dna", "passage_text": "DNA is a double helix formed by base pairs attached to a sugar-phosphate backbone. DNA, or deoxyribonucleic acid, is the hereditary material in humans and almost all other organisms. Nearly every cell in a person’s body has the same DNA. The structure of the double helix is somewhat like a ladder, with the base pairs forming the ladder’s rungs and the sugar and phosphate molecules forming the vertical sidepieces of the ladder. An important property of DNA is that it can replicate, or make copies of itself."}, {"url": "http://www.nature.com/scitable/topicpage/introduction-what-is-dna-6579978", "passage_text": "Deoxyribonucleic acid, more commonly known as DNA, is a complex molecule that contains all of the information necessary to build and maintain an organism. All living things have DNA within their cells. In fact, nearly every cell in a multicellular organism possesses the full set of DNA required for that organism. However, DNA does more than specify the structure and function of living things — it also serves as the primary unit of heredity in organisms of all types. "}]