[{"url": "http://www.fda.gov/AnimalVeterinary/SafetyHealth/ProductSafetyInformation/ucm055435.htm", "passage_text": "Bovine somatotropin (bST) is an animal drug approved by FDA to increase milk production in dairy cows. This drug is based on the growth hormone naturally produced in cattle. "}, {"url": "http://www.timeanddate.com/time/zones/bst", "passage_text": "Currently observing BST – British Summer Time. Currently has same time zone offset as BST (UTC +1:00) but different time zone name. British Summer Time (BST) is 1 hour ahead of Coordinated Universal Time (UTC) . This time zone is a DST (daylight saving time) time zone and is used in: Europe. This time zone is often called British Summer Time."}, {"url": "http://www.worldtimebuddy.com/bst-to-est-converter", "passage_text": "Converting BST to EST. This time zone converter lets you visually and very quickly convert BST to EST and vice-versa. Simply mouse over the colored hour-tiles and glance at the hours selected by the column... and done! BST stands for British Summer Time. EST is known as Eastern Standard Time. EST is 5 hours behind BST."}, {"url": "http://www.biotech.iastate.edu/publications/biotech_info_series/Bovine_Somatotropin.html", "passage_text": "Bovine somatotropin, abbreviated as bST, is a protein hormone produced in cattle by the pituitary gland located at the base of the animals brain. A hormone similar to bST is produced in all species of animals. In most dairy herds, bST will not be used in cows until they have been in lactation for about 100 days. It will not be used in cows with chronic health or fertility problems. It is expected that bST will be used less in heifers than in adult cows. If 50 percent of farmers adopt the use of bST, and it is used in 60 percent of the lactation days per user herd, milk production will increase about 3.5 percent (assuming an average per cow production increase of 15 percent)"}, {"url": "http://www.biotech.iastate.edu/publications/biotech_info_series/Bovine_Somatotropin.html", "passage_text": "Bovine somatotropin (bST) is a metabolic protein hormone used to increase milk production in dairy cows. It was approved for commercial use in the U.S by the Food and Drug Administration (FDA) on November 5, 1993. The following is a report on bST from the Biotechnology Information Series from Iowa State University. In most dairy herds, bST will not be used in cows until they have been in lactation for about 100 days. It will not be used in cows with chronic health or fertility problems. It is expected that bST will be used less in heifers than in adult cows. If 50 percent of farmers adopt the use of bST, and it is used in 60 percent of the lactation days per user herd, milk production will increase about 3.5 percent (assuming an average per cow production increase of 15 percent)"}, {"url": "https://en.wikipedia.org/wiki/British_Summer_Time", "passage_text": "During British Summer Time (BST), civil time in the United Kingdom is advanced one hour forward of Greenwich Mean Time (GMT) (in effect, changing the time zone from UTC +0 to UTC+1), so that evenings have more daylight and mornings have less. The clocks were brought back in line with GMT at the end of summer in 1945. In 1947, due to severe fuel shortages, clocks were advanced by one hour on two occasions during the spring, and put back by one hour on two occasions during the autumn, meaning that Britain was back on BDST during that summer."}, {"url": "http://www.timebie.com/timelocal/britishsummer.php", "passage_text": "BST starts at 1:00 AM of the last Sunday in March each year, turn the clock 1 hour forward to 2:00 AM at that time. BST ends at 1:00 AM of the last Sunday of October each year, turn the clock 1 hour back to 0"}, {"url": "https://en.wikipedia.org/wiki/Bovine_somatotropin", "passage_text": "rBST is a product primarily given to dairy cattle by injection to increase milk production. Bovine somatotropin or bovine somatotrophin (abbreviated bST and BST), or bovine growth hormone (BGH), is a peptide hormone produced by cows' pituitary gland. Like other hormones, it is produced in small quantities and is used in regulating metabolic processes. After the biotech company Genentech discovered and patented the gene for BST in the 1970s, it became possible to synthesize the hormone using recombinant DNA technology to create recombinant bovine somatotropin (rBST), recombinant bovine growth hormone (rBGH), or artificial growth hormone."}]