[{"url": "http://www.allaboutvision.com/cosmetic/blepharoplasty.htm", "passage_text": "Charges for an ambulatory surgery facility or in-office operating suite are additional and can range from $800 to $2,000 per procedure. If you are undergoing a functional blepharoplasty, then Medicare or your private health insurance likely will cover a major portion of the cost of the procedure. A functional blepharoplasty (in contrast to a cosmetic blepharoplasty) is eyelid surgery performed for medical reasons. In most cases, a functional eye lift is performed to remove loose skin from the upper eyelid if it droops low enough to impair your vision for driving or other visual tasks."}, {"url": "http://www.smartbeautyguide.com/planning-toolkit/cost", "passage_text": "Average Cost. Fees for cosmetic plastic surgery generally are paid prior to surgery. Oftentimes the consultation fee is deducted from the procedure. Costs vary widely and depend on the complexity of the operation, where the surgery takes place and which anesthetic is administered."}, {"url": "http://www.allaboutvision.com/visionsurgery/cost.htm", "passage_text": "Average LASIK Eye Surgery Costs. Keep in mind that these prices are for one procedure, which means one eye only. If you're having LASIK on both eyes, you'll need to double the price quoted. In 2014, the average cost overall for laser vision correction was $2,118 per eye (up from $2,073 the previous year). 1 $2,207 per eye for laser vision correction procedures (LASIK, PRK, LASEK, etc.) at surgery centers where a single price is quoted regardless of technology or vision correction requirements."}, {"url": "http://health.costhelper.com/laser-eye-surgery.html", "passage_text": "Typical costs: Related articles: Eyelid Surgery. 1  The cost of laser eye surgery, known as LASIK, varies widely from surgeon to surgeon, with a national average of about $1,950 per eye. 2  Average prices do not vary much by geographic region, but minimum and maximum fees do. 3  All About Vision provides a chart of regional cost differences. 1 The cost of laser eye surgery, known as LASIK, varies widely from surgeon to surgeon, with a national average of about $1,950 per eye. 2  Average prices do not vary much by geographic region, but minimum and maximum fees do. 3  All About Vision provides a chart of regional cost differences."}, {"url": "http://www.hessplasticsurgery.com/cosmetic-surgery-costs/", "passage_text": "Plastic Surgery Prices. The list of cosmetic surgery costs below is intended as a general guide to procedure prices at our Fairfax, Virginia plastic surgery practice. At your in-office consultation with Dr. Hess, you will receive a detailed individual estimate based on recommendations for your need"}, {"url": "http://www.allaboutvision.com/visionsurgery/cost.htm", "passage_text": "Costs for Other Types of Eye Surgery. Below are typical prices, per eye, for other types of refractive eye surgery. As with LASIK, the costs vary based on many factors, including your individual prescription, where you live and which surgeon you choose. 1  CK : $1,500 to $2,900. 1 $2,207 per eye for laser vision correction procedures (LASIK, PRK, LASEK, etc.) at surgery centers where a single price is quoted regardless of technology or vision correction requirements."}, {"url": "http://plasticsurgery.org/cosmetic-procedures/eyelid-surgery.html?sub=Eyelid+surgery+cost", "passage_text": "The average cost of eyelid surgery is $2,874, according to 2014 statistics from the American Society of Plastic Surgeons. Blepharoplasty costs can vary widely. The average fee referenced above does not include anesthesia, operating room facilities or other related expenses. A surgeon's cost for eyelid surgery may vary based on his or her experience, the type of procedure used, as well as geographic office location. Many plastic surgeons offer patient financing plans to help cover blepharoplasty costs, so be sure to ask. Eyelid surgery cost may include: 1  Surgeon’s fee."}]