[{"url": "http://guides.wsj.com/small-business/starting-a-business/how-to-trademark-a-company-name/", "passage_text": "Online trademark registration costs between $275 and $325 and requires information such as the categories of goods and services for which the mark will be used, date of the mark’s first use in commerce and whether there’s a design component to the mark you’re seeking. Registering a trademark for a company name is pretty straightforward. Many businesses can file an application online in less than 90 minutes, without a lawyer’s help. The simplest way to register is on the U.S. Patent and Trademark Office’s Web site, www.uspto.gov."}, {"url": "https://www.wellsiplaw.com/how-much-does-it-cost-to-register-a-united-states-trademark/", "passage_text": "For example, if you want to register your trademark for jewelry (Class 14) and clothing (class 25), then the government fee would normally be $ 650. You pay that fee directly to the U.S. Patent and Trademark Office at the time that you apply for the trademark. Attorney fees are an additional cost. Most attorneys will prepare and file a trademark application for a flat fee that is normally between $ 500 and $1000. Applications with multiple classes may be more."}, {"url": "http://smallbusiness.chron.com/much-cost-trademark-business-name-57181.html", "passage_text": "The cost of trademarking a business name will vary depending on the type of registration you seek, how elaborate your trademark is and how you go about registration. State trademark registration is generally much less expensive than federal registration, but federal registration grants far more benefits. The fee for filing an online trademark application with the U.S. Patent and Trademark Office, without the assistance of legal counsel, is $275 as of 2012."}, {"url": "https://secureyourtrademark.com/blog/how-much-does-it-cost-to-trademark-a-name/", "passage_text": "The Trademark Office charges a fee of $100 per class of goods/services for filing the Statement of Use. However, it should be noted that only an applicant who is not actually using their trademark at the time of the filing of their trademark application would be required to file a Statement of Use. The Trademark Search Fees. The first step of the trademark process is conducting the trademark search, which will make sure that there are no conflicts with any other prior-existing trademarks or businesses."}, {"url": "http://www.legalzoom.com/trademarks/trademarks-pricing.html", "passage_text": "+ filing fee. Filing of trademark application with the United States Patent and Trademark Office (USPTO). A basic federal direct-hit search of the federal trademark database for direct conflicts with your trademark* (a $75.00 value) or a discount on a Comprehensive Trademark Search Package. The TEAS Plus system streamlines the U.S. Patent and Trademark Office (USPTO) review process and has a lower filing fee of $225, but requires additional LegalZoom labor to process."}, {"url": "http://smallbusiness.costhelper.com/trademark.html", "passage_text": "1 Basic Patents.com charges $1,000 to prepare, docket and file a trademark application. 2  The New York State Science and Technolgy Law Center estimates attorney fees relative to trademark application to run $1,000-$1,500. 1 It costs $275-$375 (paper submissions cost more than online) to file an application for a single trademark for a single class of goods or services with the USPTO."}, {"url": "http://smallbusiness.costhelper.com/trademark.html", "passage_text": "Granted: A number of costs in the article Cost of a Trademark are not accurate. Starting with the Thomson & Thomson search (recommended), a US Full Availability search is priced at $595, and a Company Name Search is $930. This is triple the reported price range. 1 It costs $275-$375 (paper submissions cost more than online) to file an application for a single trademark for a single class of goods or services with the USPTO."}, {"url": "http://www.uspto.gov/trademark/view-fee-schedule-trademark-fee-information", "passage_text": "View Fee Schedule: Trademark Fee Information. Many trademark documents, including an application, require payment of a filing fee. These fees are generally not refundable even if the USPTO does not ultimately register your mark. See additional information below. "}, {"url": "http://smallbusiness.chron.com/much-cost-trademark-business-name-57181.html", "passage_text": "State Registration. State trademark registration is the most inexpensive way to register a trademark for your business name. Depending on the state where your business is located, state trademark registration will generally cost between $50 and $100 without the assistance of legal counsel. State trademark registration is generally much less expensive than federal registration, but federal registration grants far more benefits. The fee for filing an online trademark application with the U.S. Patent and Trademark Office, without the assistance of legal counsel, is $275 as of 2012."}]