[{"url": "http://www.our-happy-cat.com/my-boyfriends-cat-sleeps-on-my-chest-back-and-side.html", "passage_text": "When I sleep over my boyfriend's house, 1 of his 2 female cats (Beluga) prefers to sleep on my chest, back and side when we are in bed. She does not attempt this with my boyfriend, her owner."}, {"url": "http://whydoesmycat.com/articles/122", "passage_text": "Your cat sleeps on your head because it is warm! Cats like to sleep where it is warm, and they also like to sleep with you. Cats will generally do no harm if they sleep on you. However, if your cat is sleeping on your head, you should ensure that you do not have cat allergies."}, {"url": "http://www.our-happy-cat.com/my-boyfriends-cat-sleeps-on-my-chest-back-and-side.html", "passage_text": "My boyfriend's cat sleeps on my chest, back and side. by Debra. (Washington, DC). When I sleep over my boyfriend's house, 1 of his 2 female cats (Beluga) prefers to sleep on my chest, back and side when we are in bed. She does not attempt this with my boyfriend, her owner. What does this mean."}, {"url": "http://whydoesmycat.com/articles/122", "passage_text": "You should keep your cat away from babies or small children so your cat does not attempt to lay on them. Cats may also sleep on your head so they are easily awakened when you wake up. Cats sleep for about 16 hours/day but they are usually awakened quite easily."}, {"url": "https://au.answers.yahoo.com/question/index?qid=20070210085623AAhyYYO", "passage_text": "If I turn the other way, he does the same. I try to get him under my chin instead of in my face and it's fine. I have never experienced this with any other cat in my life. I just don't understand why he needs to be in my face. Most sleep in between my my legs, beside me, or at the bottom of my bed. that I can handle."}, {"url": "http://pets.thenest.com/cats-sleep-neck-face-8766.html", "passage_text": "Sleeping on your face puts the top cat at the highest point on the bed, the primo location for keeping watch over everyone. Your more submissive kitty will probably sleep at the foot of the bed or in her own kitty bed in the corner of the room."}, {"url": "http://pets.thenest.com/cats-sleep-neck-face-8766.html", "passage_text": "Warmth. Cats crave warmth when they head to bed. You'll see your cat sprawl out in the afternoon sun or nuzzle his way under a pile of warm laundry when he needs a nap. Not only is your pillow the softest place in the house, it comes with a heater -- your head."}, {"url": "https://answers.yahoo.com/question/index?qid=20080101212137AAFRQ3U", "passage_text": "Best Answer: He's showing both affection, and comforting. If you ever notice, when cats or dogs are in a litre, they groom, lick, and play with one another as a family (or pack)."}]