[{"url": "http://nij.gov/topics/forensics/evidence/dna/research/pages/mitochondrial.aspx", "passage_text": "Mitochondrial DNA (mtDNA) has provided forensic scientists with a valuable tool for determining the source of DNA recovered from damaged, degraded, or very small biological samples. MtDNA is a small circular genome located in the mitochondria, which are located outside of a cell's nucleus. "}, {"url": "https://en.wikipedia.org/wiki/Mitochondrial_DNA", "passage_text": "Mitochondrial DNA is only a small portion of the DNA in a eukaryotic cell; most of the DNA can be found in the cell nucleus and, in plants, in the chloroplast. In humans, the 16,600 base pairs of mitochondrial DNA encode for only 37 genes. Human mitochondrial DNA was the first significant part of the human genome to be sequenced. In most species, including humans, mtDNA is inherited solely from the mother."}, {"url": "http://scienceline.ucsb.edu/getkey.php?key=205", "passage_text": "Click Here to return to the search form. If I'm remembering correctly, chloroplasts have their own DNA, too. Scientists believe that mitochondria and chloroplasts were primitive cells without nuclei (prokaryotes) that got inside of primitive cells with nuclei (eukaryotes) and then stayed there. So they came in with their own DNA, and now they still have some of their own DNA that carries the code for some of their own proteins. They also need some proteins coded by genes in the nuclear DNA. A woman scientist first suggested all this, Lynn Margulis."}, {"url": "http://www.nature.com/scitable/topicpage/mitochondria-14053590", "passage_text": "Mitochondria are unusual organelles. They act as the power plants of the cell, are surrounded by two membranes, and have their own genome. They also divide independently of the cell in which they reside, meaning mitochondrial replication is not coupled to cell division. Mitochondria cannot be made from scratch because they need both mitochondrial and nuclear gene products. These organelles replicate by dividing in two, using a process similar to the simple, asexual form of cell division employed by bacteria. Video microscopy shows that mitochondria are incredibly dynamic."}, {"url": "https://en.wikipedia.org/wiki/Mitochondrial_DNA", "passage_text": "Origin [edit]. Nuclear and mitochondrial DNA are thought to be of separate evolutionary origin, with the mtDNA being derived from the circular genomes of the bacteria that were engulfed by the early ancestors of today's eukaryotic cells. This theory is called the endosymbiotic theory. In humans, the 16,600 base pairs of mitochondrial DNA encode for only 37 genes. Human mitochondrial DNA was the first significant part of the human genome to be sequenced. In most species, including humans, mtDNA is inherited solely from the mother."}, {"url": "http://ghr.nlm.nih.gov/mitochondrial-dna", "passage_text": "Mitochondria are structures within cells that convert the energy from food into a form that cells can use. Although most DNA is packaged in chromosomes within the nucleus, mitochondria also have a small amount of their own DNA. This genetic material is known as mitochondrial DNA or mtDNA. In humans, mitochondrial DNA spans about 16,500 DNA building blocks (base pairs), representing a small fraction of the total DNA in cells. Mitochondrial DNA contains 37 genes, all of which are essential for normal mitochondrial function."}, {"url": "http://learn.genetics.utah.edu/content/cells/organelles/", "passage_text": "Mitochondria Have DNA. Mitochondria and chloroplasts have striking similarities to bacteria cells. They have their own DNA, which is separate from the DNA found in the nucleus of the cell. And both organelles use their DNA to produce many proteins and enzymes required for their function. A double membrane surrounds both mitochondria and chloroplasts, further evidence that each was ingested by a primitive host. Some of the oldest cells on Earth are single-cell organisms called bacteria. Fossil records indicate that mounds of bacteria once covered young Earth. Some began making their own food using carbon dioxide in the atmosphere and energy they harvested from the sun."}, {"url": "http://biology.stackexchange.com/questions/3245/does-every-mitochondrion-in-a-cell-contain-the-same-dna", "passage_text": "I know that mitochondria of eukaryotes have their own DNA, more similar to that of bacteria than to the rest of the cell's DNA. I also know that a cell can have plenty of mitochondria, and I understand each of them has it's own DNA. "}, {"url": "http://ghr.nlm.nih.gov/handbook/basics/mtdna", "passage_text": "Although most DNA is packaged in chromosomes within the nucleus, mitochondria also have a small amount of their own DNA. This genetic material is known as mitochondrial DNA or mtDNA. Mitochondria (illustration) are structures within cells that convert the energy from food into a form that cells can use. "}, {"url": "http://www2.le.ac.uk/departments/emfpu/genetics/explained/mitochondrial", "passage_text": "Illustration of a eukaryotic cell with contents labelled. Mitochondrial DNA (mtDNA), is a small circular DNA molecule located in mitochondria which are cell’s organelles residing in the cytoplasm. It is approximately 16,569bp (base pairs) long and consists of 37 genes and a control region which is also called a 'non-coding' region since it does not code for any gene products. "}]