[{"url": "https://msdn.microsoft.com/en-us/library/dd293527.aspx", "passage_text": "Network. In addition, there are additional link types used to link work items to other objects in the team project or other elements, such as a web page or network location. For example, the Storyboard link type links work items to storyboards or any file located on a network share."}, {"url": "http://www.netmba.com/finance/statements/common-size/", "passage_text": "The ratios often are expressed as percentages of the reference amount. Common size statements usually are prepared for the income statement and balance sheet, expressing information as follows: 1  Income statement items-expressed as a percentage of total revenue."}, {"url": "https://msdn.microsoft.com/en-us/library/dd293527.aspx", "passage_text": "Network: You can use network links to create basic relationships between work items that are non-restrictive. The link is the same at both end points. Circular relationships are allowed. Example usage: Use a network link, such as Related, to record a relationship between two features that might share dependencies. Directed Network: You can use directed network links to create relationships between work items that indicate directionality. The link name is different at the"}, {"url": "http://www.funtrivia.com/quizzes/brain_teasers/word_play/words_in_common.html", "passage_text": "These are puzzles where all of the answers have a word or word type in common, such as all answers containing the word cat, or all answers containing the name of a brand of cereal."}, {"url": "http://www.yourdictionary.com/interface", "passage_text": "interface. Use interface in a sentence. LINK / CITE ADD TO WORD LIST. noun. The definition of interface is a surface that forms a common boundary between two things or a point of interaction between two components or systems."}, {"url": "http://www.merriam-webster.com/dictionary/between", "passage_text": "See between defined for kids. There is a persistent but unfounded notion that between can be used only of two items and that among must be used for more than two."}]