[{"url": "http://na.fs.fed.us/pubs/silvics_manual/volume_2/casuarina/casaurina.htm", "passage_text": "The wood dries rapidly and burns well. Attempts to saw and season casuarina for use as lumber have not been satisfactory (10). Casuarina bark has been used in tanning and medicine, and the fruits have been used for novelties and decorations (13). 1 Rhoads, A. A. 1952. 2  The destructiveness of Clitocybe root rot on plantings of Casuarina in Florida. 3  Lloydia 15:161-184. 4  Rockwood, D. L., J. B. Huffman, and L. F. Conde."}, {"url": "https://en.wikipedia.org/wiki/Casuarina", "passage_text": "Casuarina species are a food source of the larvae of hepialid moths; members of the genus Aenetus, including A. lewinii and A. splendens, burrow horizontally into the trunk then vertically down. Endoclita malabaricus also feeds on Casuarina. The noctuid Turnip Moth is also recorded feeding on Casuarina. Gardeners in Bermuda can appreciate that all parts of the casuarina tree (needles, sawdust, bark, and prepared mulch) can be useful in lowering the soil pH, as Bermuda's topography consists of naturally high pH limestone rock, and perhaps only a foot of red or sandy soil."}, {"url": "http://edugreen.teri.res.in/explore/forestry/uses.htm", "passage_text": "Some of the wood is converted to charcoal and used for cooking. People began life on this planet as forest dwellers. They were food gatherers and depended on the forest for all their needs: food, clothing, and shelter. They gradually became food growers, clearing a small patch in the forest to grow food. But they continued to depend on forests to meet a lot of their needs."}, {"url": "http://www.worldagroforestry.org/treedb/AFTPDFS/Casuarina_junghuhniana.PDF", "passage_text": "One of the common names of Casuarina species, ‘she-oak’, widely used in Australia, refers to the attractive wood pattern of large lines or rays similar to oak but weaker.BIOLOGYLike other Casuarina species, C. junghuhniana is wind pollinated. Casuarina junghuhniana CasuarinaceaeMiq. TREE MANAGEMENTSeedlings can attain 3 m growth in height per year during the 1st 2-3 years. In plantations with a controlled water regime in Thailand, C. junghuhniana hybrid reaches 20 m in height and 15 cm in diameter in 5 years."}, {"url": "http://na.fs.fed.us/pubs/silvics_manual/volume_2/casuarina/casaurina.htm", "passage_text": "Casuarina species, native to Australia and neighboring areas, have been introduced into many countries. In the United States, three species have been established, primarily in Hawaii, California, and Florida: C. equisetifolia L. ex J. R. & G. Forst., C. cunninghamiana Miq. and C. glauca Sieber ex K. Spreng. 1 Rhoads, A. A. 1952. 2  The destructiveness of Clitocybe root rot on plantings of Casuarina in Florida. 3  Lloydia 15:161-184. 4  Rockwood, D. L., J. B. Huffman, and L. F. Conde."}, {"url": "https://en.wikipedia.org/wiki/Casuarina", "passage_text": "Casuarina is a genus of 17 species in the family Casuarinaceae, native to Australia, the Indian Subcontinent, southeast Asia, and islands of the western Pacific Ocean. It was once treated as the sole genus in the family, but has been split into three genera (see Casuarinaceae). Gardeners in Bermuda can appreciate that all parts of the casuarina tree (needles, sawdust, bark, and prepared mulch) can be useful in lowering the soil pH, as Bermuda's topography consists of naturally high pH limestone rock, and perhaps only a foot of red or sandy soil."}, {"url": "http://edugreen.teri.res.in/explore/forestry/uses.htm", "passage_text": "Go back Uses of forests People began life on this planet as forest dwellers. They were food gatherers and depended on the forest for all their needs: food, clothing, and shelter. They gradually became food growers, clearing a small patch in the forest to grow food. But they continued to depend on forests to meet a lot of their needs."}, {"url": "http://edugreen.teri.res.in/explore/forestry/uses.htm", "passage_text": "Forest products and their uses. Bamboo. These are common in the north-eastern and the south-western parts of India, growing along with deciduous or evergreen forest. The main commercial uses of bamboo are as timber substitutes, fodder, and raw material for basket, paper and pulp, and other small-scale industries. They were food gatherers and depended on the forest for all their needs: food, clothing, and shelter. They gradually became food growers, clearing a small patch in the forest to grow food. But they continued to depend on forests to meet a lot of their needs."}, {"url": "http://edis.ifas.ufl.edu/hs392", "passage_text": "The use of windbreaks is a well established tool for canker management throughout the world. A proven plant species for this purpose is Casuarina cunninghamiana, judging from its common to almost exclusive use in the fresh fruit citrus industries of Argentina, South Africa, and Australia. Florida researchers have also studied possible commercial uses of Casuarina and concluded that because of its fast growth, coppicing abilities, and wood properties, the plants are suitable for use in pulpwood and biomass production (Comer et al., 1986; Rockwood et al., 1983)."}]