[{"url": "http://www.hoaleader.com/public/117.cfm", "passage_text": "Definition: Quorum. A quorum is the smallest number of board members necessary to legally conduct the business of your HOA. Most, but not all, groups define a quorum as a simple majority of the members. It should be defined in your HOA's bylaws. Without a quorum, a vote cannot be taken, and the status quo can't be changed. Unless a quorum is present, minutes should note be taken since official business of the HOA cannot be conducted"}, {"url": "https://en.wikipedia.org/wiki/Quorum", "passage_text": "A quorum is the minimum number of members of a deliberative assembly (a body that uses parliamentary procedure, such as a legislature) necessary to conduct the business of that group. The number of members that constitutes a quorum differs depending on the assembly and is usually provided for in that assembly's governing documents (for example, its constitution, charter, bylaws or standing orders). The quorum may also be set by law."}, {"url": "http://www.yourdictionary.com/quorum", "passage_text": "noun. The definition of a quorum is the minimum number of people needed at a meeting to conduct business. An example of a quorum is having four of the seven committee members present in order to pass a motion at a committee meeting. quorum-Investment & Finance Definition. The smallest number of people that must vote (either in person or by proxy) in shareholder meetings, boards of directors meetings, legislative meetings, or other committee and organization meetings. If a quorum isn’t reached, then the results of the voting are not valid."}, {"url": "http://legal-dictionary.thefreedictionary.com/Quorum", "passage_text": "A quorum is the minimum number of people who must be present to pass a law, make a judgment, or conduct business. Quorum requirements typically are found in a court, legislative assembly, or corporation (where those attending might be directors or stockholders). A quorum also might mean the number of members of a body defined as competent to transact business in the absence of the other members. The purpose of a quorum rule is to give decisions made by a quorum enough authority to allow binding action to be conducted."}, {"url": "http://www.merriam-webster.com/dictionary/quorum", "passage_text": "Full Definition of QUORUM. 1. : a select group. 2. : the number (as a majority) of officers or members of a body that when duly assembled is legally competent to transact business. 3. : a Mormon body comprising those in the same grade of priesthood. See quorum defined for English-language learners. Middle English, quorum of justices of the peace, from Latin, of whom, genitive plural of qui who; from the wording of the commission formerly issued to justices of the peace."}, {"url": "http://legal-dictionary.thefreedictionary.com/Quorum", "passage_text": "quorum. n. the number of people required to be present before a meeting can conduct business. Unless stated differently in by-laws, articles, regulations, or other rules established by the organization, a quorum is usually a majority of members. A quorum also might mean the number of members of a body defined as competent to transact business in the absence of the other members. The purpose of a quorum rule is to give decisions made by a quorum enough authority to allow binding action to be conducted."}, {"url": "http://www.merriam-webster.com/dictionary/quorum", "passage_text": "Definition of QUORUM for Kids. : the smallest number of people who must be present at a meeting in order for business to be carried on. Spanish Central: Spanish translation of quorum. Middle English, quorum of justices of the peace, from Latin, of whom, genitive plural of qui who; from the wording of the commission formerly issued to justices of the peace."}]