[{"url": "http://www.improvenet.com/r/costs-and-prices/shower-tiling", "passage_text": "Granite shower tile is available at an average of $3.49 per square foot to $6.99 per square foot. Polished stone wall tile comes in many choices, including pebble stone that costs about $10 per square foot and $12 per square foot for a smooth surface polished stone tile. Limestone averages at $5 per square foot. Slate wall tile costs $3.78 per square foot. Marble varieties of floor tile are readily available at an average of $6 per square foot, and polished marble wall tile can be found at $10.90"}, {"url": "http://www.networx.com/article/how-much-should-it-cost-to-replace-a-tub", "passage_text": "Much of Nygren’s business involves creating custom shower and/or tub spaces along with complete bathroom remodels. By his estimate, a typical job that includes replacing an old shower or tub with a custom shower pan, new wall tile, a glass surround and a custom glass door ranges in cost from about $4,000 to $5,000. Without the custom door, the price drops about $1,000. "}, {"url": "http://www.improvenet.com/r/costs-and-prices/shower-installation-cost-estimator", "passage_text": "The national average for a new shower installation project, when performed by a capable contractor, is $2,689. At the low-end of the normal cost range, homeowners are paying $1,109, and at the high end of the average range they’re spending $2,459. More luxurious showers can cost in excess of $10,000 to install. The cost of tiling a shower goes from $744 at the low-end to $1,006 at the high-end of the typical range; however, it should be noted that higher-end tiling projects are known to go north of $2,500 without being considered unreasonable or extravagant."}, {"url": "http://www.improvenet.com/r/costs-and-prices/shower-tiling", "passage_text": "Pricier grades of metal wall tile can be as high as $57 per square foot. In regards to tile installation costs, consumers can expect to pay an average of $25 per square foot, depending on the grade of material that is used. For a medium-sized shower, the price can cost about $2,000. Tile installation materials include: Limestone averages at $5 per square foot. Slate wall tile costs $3.78 per square foot. Marble varieties of floor tile are readily available at an average of $6 per square foot, and polished marble wall tile can be found at $10.90"}, {"url": "http://home.costhelper.com/bathroom-retile.html", "passage_text": "1 Expect to pay an additional $200-$800 or more to remove existing tile and repair any damaged areas underneath, for a total of $1,000-$5,000 or more for a typical bathroom (5'x7' to 10'x10'). 2  For details see, How Much Does a Tile Floor Cost. 1 For details see, How Much Does a Tile Floor Cost. 2  Retiling around a bathtub or inside a shower enclosure can cost $800-$2,500 or more, depending on the type of tiles, total square footage, the amount of repairs needed, any special pattern or border, and local labor rates."}, {"url": "http://trianglegranite.com/how-much-does-it-cost-to-remodel-a-bathroom.php", "passage_text": "Remodeling Costs for a Small Bathroom. The cost for a typical small bathroom remodel will range from about $4,000 to $12,000 with the average cost being about $8,000. Let’s look at how the costs breakout starting with the most basic remodel including a new toilet, shower, vanity & sink and tile. We will also compare costs for a lower cost bathroom remodel using less expensive materials to a higher quality option. Small Bathroom photos. The cost for a typical small bathroom remodel will range from about $4,000 to $12,000 with the average cost being about $8,000."}, {"url": "http://trianglegranite.com/how-much-does-it-cost-to-remodel-a-bathroom.php", "passage_text": "The average cost for remodeling a bathroom ranges from around $4,000 to $12,000 for small bathrooms and from about $10,000 to as much as $35,000 for large master bathrooms. Naturally, the cost varies depending on the size of the room, how much you want to have done and the quality of materials selected. We will also compare costs for a lower cost bathroom remodel using less expensive materials to a higher quality option. Small Bathroom photos. The cost for a typical small bathroom remodel will range from about $4,000 to $12,000 with the average cost being about $8,000. Let’s look at how the costs breakout starting with the most basic remodel including a new toilet, shower, vanity & sink and tile"}, {"url": "http://www.howmuchisit.org/tile-shower-cost/", "passage_text": "1 Higher-end tile such as granite or marble is going to cost more than a standard ceramic tile. 2  On average, plan on spending anywhere from $2,500 to as much as $5,000 or more for a standard 3′ x 5′ shower. 3  Showers can widely vary in size, but most of the time the cost will be within this price range. 1 On average, plan on spending anywhere from $2,500 to as much as $5,000 or more for a standard 3′ x 5′ shower. 2  Showers can widely vary in size, but most of the time the cost will be within this price range. 3  The company HartmanConstruction.com offers a glass shower for a flat rate of $3,500."}, {"url": "http://www.howmuchisit.org/tile-shower-cost/", "passage_text": "1 The cost of the materials themselves is going to vary. 2  Tiles are made from different materials and can come in different shapes, sizes, and designs. 3  On average, budget anywhere from $1 to as much as $15 per square foot. 4  It is not uncommon to see higher-end tile cost as much as $25 per tile or square foot. 1 On average, plan on spending anywhere from $2,500 to as much as $5,000 or more for a standard 3′ x 5′ shower. 2  Showers can widely vary in size, but most of the time the cost will be within this price range. 3  The company HartmanConstruction.com offers a glass shower for a flat rate of $3,500."}]