[{"url": "http://www.definitions.net/definition/furry", "passage_text": "Wiktionary (0.00 / 0 votes) Rate this definition: furry (Noun). An animal character with human characteristics; most commonly refers to such characters created by members of the furry fandom. furry (Noun). A member of the furry fandom. A furfan. "}, {"url": "http://medical-dictionary.thefreedictionary.com/furry", "passage_text": "animals bred or trapped in the wild for their pelts. Includes mink, sable, otter, lapin, ermine, marten. fur ball. accumulations of fur, swallowed during the natural grooming procedures of cats, can be a cause of vomiting, enteritis and uncommonly intestinal obstruction. Most troublesome in longhaired cats and those with skin disease that prompts more grooming. fur-bearing animal. see fur animal (above). fur clipping. chewing of fur by captive mink rendering the pelt useless. A vice apparently caused by cage boredom"}, {"url": "http://www.anthrocon.org/node/7217/definition-furry", "passage_text": "Posts: 14. Alright, so I recently had a really unpleasent disscussion on Second Life with a few furry individuals. I have used the same definition of furry for a very long time. My cousin is not a furry but he thinks it's cool I'm into it. He's even thought about coming with me to Anthrocon because he knows it'd be a good time"}, {"url": "http://dictionary.cambridge.org/us/dictionary/english/furry", "passage_text": "furry adjective. › ​covered with ​fur, or ​feeling or ​looking like ​fur: a furry ​animal She was ​wearing her ​bathrobe and ​pink, furry ​slippers. (Definition of furry from the Cambridge Academic Content Dictionary © Cambridge University Press). "}, {"url": "http://dictionary.cambridge.org/dictionary/english/furry", "passage_text": "furry adjective. › ​covered with ​fur, or ​feeling or ​looking like ​fur: a furry ​animal She was ​wearing her ​bathrobe and ​pink, furry ​slippers. (Definition of furry from the Cambridge Academic Content Dictionary © Cambridge University Press). furry adjective. › ​covered with ​fur: ​small furry ​animals › Furry things are made from a ​soft ​material that ​looks like ​fur: furry ​slippers Rosie has a ​massive ​collection of furry ​toys. (Definition of furry from the Cambridge Advanced Learner’s Dictionary & Thesaurus © Cambridge University Press)."}, {"url": "http://www.learnersdictionary.com/definition/furry", "passage_text": "Learner's definition of FURRY. 1. : covered with fur. My children love furry animals. [+] more examples [-] hide examples [+] Example sentences [-] Hide examples. 2. a: covered with something that looks or feels like fur. The plant has furry leaves. "}, {"url": "http://www.thefreedictionary.com/furry", "passage_text": "furry. adj, -rier or-riest. 1. covered with fur or something furlike. 2. of, relating to, or resembling fur. adj. fur•ri•er, fur•ri•est. 1. consisting of or resembling fur. 2. covered with fur; wearing fur: furry animals. 3. obstructed or coated as if with fur."}, {"url": "https://en.wikipedia.org/wiki/Fandom", "passage_text": "Harry Potter fans dressed as Hogwarts students. Fandom is a term used to refer to a subculture composed of fans characterized by a feeling of empathy and camaraderie with others who share a common interest. "}]