[{"url": "https://en.wikipedia.org/wiki/Photosynthesis", "passage_text": "Photosynthesis is a process used by plants and other organisms to convert light energy, normally from the Sun, into chemical energy that can be later released to fuel the organisms' activities. Carbon dioxide is converted into sugars in a process called carbon fixation. Carbon fixation is an endothermic redox reaction, so photosynthesis needs to supply both a source of energy to drive this process, and the electrons needed to convert carbon dioxide into a carbohydrate."}, {"url": "http://www.globalchange.umich.edu/globalchange1/current/lectures/kling/energyflow/PSN_primer.html", "passage_text": "Photosynthesis is the process by which organisms that contain the pigment chlorophyll convert light energy into chemical energy which can be stored in the molecular bonds of organic molecules (e.g., sugars). Photosynthesis powers almost all trophic chains and food webs on the Earth. During the process of photosynthesis, light penetrates the cell and passes into the chloroplast. The light energy is intercepted by chlorophyll molecules on the granal stacks. Some of the light energy is converted to chemical energy."}, {"url": "http://www.nature.com/scitable/topicpage/photosynthetic-cells-14025371", "passage_text": "This process, called photosynthesis, is essential to the global carbon cycle and organisms that conduct photosynthesis represent the lowest level in most food chains (Figure 1). Figure 1: Photosynthetic plants synthesize carbon-based energy molecules from the energy in sunlight. "}, {"url": "http://www.life.illinois.edu/govindjee/encyc/encarta.htm", "passage_text": "PHOTOSYNTHESIS. INTRODUCTION. Photosynthesis, process by which green plants and certain other organisms use the energy of light to convert carbon dioxide and water into the simple sugar glucose. In so doing, photosynthesis provides the basic energy source for virtually all organisms. An extremely important byproduct of photosynthesis is oxygen, on which most organisms depend. Photosynthesis occurs in green plants, seaweeds, algae, and certain bacteria."}, {"url": "http://www.ext.colostate.edu/mg/gardennotes/141.html", "passage_text": "1 Photosynthesis – The process of capturing light energy and converting it to sugar energy, in the presence of chlorophyll using carbon dioxide and water. 2  Respiration – The process of metabolizing (burning) sugars to yield energy for growth, reproduction, and other life processes. The three major functions that are basic to plant growth and development are: 1 "}, {"url": "http://www2.estrellamountain.edu/faculty/farabee/biobk/BioBookPS.html", "passage_text": "Photosynthesis is the process by which plants, some bacteria, and some protistans use the energy from sunlight to produce sugar, which cellular respiration converts into ATP, the fuel used by all living things. "}, {"url": "http://www.globalchange.umich.edu/globalchange1/current/lectures/kling/energyflow/PSN_primer.html", "passage_text": "Sunlight is converted to chemical energy in the form of ATP (adenosine triphosphate), which is the main energy-storing molecule in living organisms. ATP is then transported throughout the chloroplast and used to provide the chemical energy necessary to power other metabolic reactions. During the process of photosynthesis, light penetrates the cell and passes into the chloroplast. The light energy is intercepted by chlorophyll molecules on the granal stacks. Some of the light energy is converted to chemical energy."}, {"url": "http://www.rsc.org/Education/Teachers/Resources/cfb/Photosynthesis.htm", "passage_text": "Photosynthesis Photosynthesis is the process by which plants, some bacteria and some protistans use the energy from sunlight to produce glucose from carbon dioxide and water. This glucose can be converted into pyruvate which releases adenosine triphosphate (ATP) by cellular respiration. Oxygen is also formed. Stages of photosynthesis. When chlorophyll a absorbs light energy, an electron gains energy and is 'excited'. The excited electron is transferred to another molecule (called a primary electron acceptor). The chlorophyll molecule is oxidized (loss of electron) and has a positive charge."}, {"url": "https://en.wikipedia.org/wiki/Photosynthesis", "passage_text": "This chemical energy is stored in carbohydrate molecules, such as sugars, which are synthesized from carbon dioxide and water – hence the name photosynthesis, from the Greek φῶς, phōs, light, and σύνθεσις, synthesis, putting together. Carbon dioxide is converted into sugars in a process called carbon fixation. Carbon fixation is an endothermic redox reaction, so photosynthesis needs to supply both a source of energy to drive this process, and the electrons needed to convert carbon dioxide into a carbohydrate."}, {"url": "http://www.life.illinois.edu/govindjee/encyc/encarta.htm", "passage_text": "Photosynthesis, process by which green plants and certain other organisms use the energy of light to convert carbon dioxide and water into the simple sugar glucose. In so doing, photosynthesis provides the basic energy source for virtually all organisms. An extremely important byproduct of photosynthesis is oxygen, on which most organisms depend. Photosynthesis occurs in green plants, seaweeds, algae, and certain bacteria."}]