[{"url": "https://en.wikipedia.org/wiki/Cartilage", "passage_text": "Cartilage is classified in three types, elastic cartilage, hyaline cartilage and fibrocartilage, which differ in relative amounts of cartilage. Chondroblasts that get caught in the matrix are called chondrocytes. Cartilage does not contain blood vessels (avascular) or nerves (aneural). Cartilage /ˈkɑrtɨlɨdʒ/ is a flexible connective tissue in animals, including the joints between bones, the rib cage, the ear, the nose, the bronchial tubes and the intervertebral discs. It is not as hard and rigid as bone, but it is stiffer and less flexible than muscle"}, {"url": "http://www.news-medical.net/health/What-is-Cartilage.aspx", "passage_text": "Cartilage is an important structural component of the body. It is a firm tissue but is softer and much more flexible than bone. Cartilage is a connective tissue found in many areas of the body including: 1  Joints between bones e.g. the elbows, knees and ankles. 2  Ends of the ribs. 3  Between the vertebrae in the spine. 4  Ears and nose."}, {"url": "http://www.mananatomy.com/basic-anatomy/cartilage-types", "passage_text": "Cartilage is a type of connective tissue composed of special cells known as chondrocytes along with collagen or yellow elastic fibers. The fibers and the cells are embedded in a firm gel like matrix rich in mucopolysaccharides. Cartilage is not as hard and rigid as bone. It is much more flexible and elastic. This type of cartilage has very thin fibers having same refractive index as the matrix of the cartilage and thus these fibers are not seen. Hyaline cartilage is the articular cartilage of long bones, sternum, ribs etc. Its color is bluish white and it is flexible."}, {"url": "http://study.com/academy/lesson/what-is-cartilage-function-definition-types.html", "passage_text": "The number of chondrocytes in cartilage determines how 'bendy' the cartilage is. The three types of cartilage are elastic, hyaline, and fibrocartilage. Elastic cartilage has the greatest number of chondrocytes, so it bends the most. Hyaline cartilage comes next, followed by fibrocartilage. Another integral type of connective tissue is cartilage. The main structural components of our bodies are bone, muscle, and cartilage. Bones are rigid, while muscles bend, stretch, and are flexible."}, {"url": "http://mhhe.com/biosci/ap/histology_mh/cartilag.html", "passage_text": "Unlike bone and all other connective tissue types, cartilage is avascular, lacking blood vessels. For this reason alone, cartilage does not possess the regenerative capacity of bone or the other connective tissue types. Remember, nutrient delivery is essential for tissue repair. There are three varieties of cartilage, hyaline, elastic, and fibrocartilage. The most abundant type is hyaline, found as supportive tissues in the nose, ears, trachea, larynx, and smaller respiratory tubes. As articular cartilage, hyaline is found covering the articular surfaces of bones in synovial joints."}, {"url": "http://www.histology.leeds.ac.uk/bone/cartilage_types.php", "passage_text": "There are three types of cartilage: 1  Hyaline-most common, found in the ribs, nose, larynx, trachea. 2  Fibro-is found in invertebral discs, joint capsules, ligaments. 3  Elastic-is found in the external ear, epiglottis and larynx. There are three types of cartilage: 1  Hyaline-most common, found in the ribs, nose, larynx, trachea. 2  Is a precursor of bone. 3  Fibro-is found in invertebral discs, joint capsules, ligaments. 4"}, {"url": "http://www.histology.leeds.ac.uk/bone/cartilage_types.php", "passage_text": "Cartilage: The three types of cartilage. There are three types of cartilage: 1  Hyaline-most common, found in the ribs, nose, larynx, trachea. 2  Is a precursor of bone. 3  Fibro-is found in invertebral discs, joint capsules, ligaments. 4  Elastic-is found in the external ear, epiglottis and larynx"}, {"url": "http://study.com/academy/lesson/what-is-cartilage-function-definition-types.html", "passage_text": "Cartilage is a strong, flexible type of connective tissue found within a body. Learn more about its structure and function, as well as the different types of cartilage connective tissue we have in our bodies. Another integral type of connective tissue is cartilage. The main structural components of our bodies are bone, muscle, and cartilage. Bones are rigid, while muscles bend, stretch, and are flexible."}]