[{"url": "http://www.dmv.org/oh-ohio/drivers-permits.php", "passage_text": "Behind-the-Wheel Driving Requirements. If you're under 18 years old and have your Ohio learner's permit, in addition to completing Driver's Ed, you're also required to complete 50 hours of supervised driving practice (including 10 hours at night)."}, {"url": "http://www.answers.com/Q/How_old_do_you_have_to_be_to_drive_a_car_in_the_state_of_ohio", "passage_text": "How old do you have to be to drive a motorcycle in Ohio? You have to be 18 to drive a motorcycle. and you also need to take new driving courses and you have to have a motorcycle permit to drive a motorcycle for 6 months. this is the … Ohio law."}, {"url": "http://www.answers.com/Q/How_old_do_you_have_to_be_to_drive_a_car_in_the_state_of_ohio", "passage_text": "How old do you have to be to drive a car by yourself? 18 years old is when you can get your license. _______________________________________________________ Depends on location In the US, the minimum is 16 years old for dri … ving on the streets and highways."}, {"url": "http://www.dmv.org/oh-ohio/other-types.php", "passage_text": "Obtaining an Ohio Moped License. In order to operate a moped, you must be at least 14 years old. If you are between the ages of 14 and 15 years old, or if you do NOT have a valid Ohio driver's license, you must get a probationary motorized bicycle license."}, {"url": "http://www.dmv.org/oh-ohio/other-types.php", "passage_text": "To drive a motor scooter in Ohio, you'll need to be at least 16 years old and have either a motorcycle license or a motorcycle endorsement designated on your driver's license. To be allowed on Ohio's public roads, a motor scooter must be deemed roadworthy.. This means the scooter: 1  Must have a seat or a saddle."}, {"url": "http://www.dmv.org/oh-ohio/drivers-permits.php", "passage_text": "In order to get your Ohio learner's permit, or TIPIC, you'll need to be at least 15 1/2 years old. Visit an OH BMV office and: 1  Show documents proving your: 2  Full legal name and date of birth (e.g. 3  U.S. birth certificate, certified copy of a court order)."}, {"url": "http://www.answers.com/Q/How_old_do_you_have_to_be_to_drive_a_motorcycle_in_Ohio", "passage_text": "You have to be 18 to drive a motorcycle. and you also need to take new driving courses. and you have to have a motorcycle permit to drive a motorcycle for 6 months. this is the Ohio law."}]