[{"url": "http://www.nhlbi.nih.gov/health/health-topics/topics/hbp/", "passage_text": "Normal blood pressure for adults is defined as a systolic pressure below 120 mmHg and a diastolic pressure below 80 mmHg. It is normal for blood pressures to change when you sleep, wake up, or are excited or nervous. When you are active, it is normal for your blood pressure to increase."}, {"url": "http://www.webmd.boots.com/hypertension-high-blood-pressure/guide/diastolic-systolic", "passage_text": "A normal systolic blood pressure is 120 or below. A systolic blood pressure of 120-139 means you have normal blood pressure that is higher than ideal, or borderline high blood pressure. Even people with this level are at a greater risk of developing heart disease."}, {"url": "http://www.bloodpressureuk.org/BloodPressureandyou/Thebasics/Whatisnormal/", "passage_text": "Most adults in the UK have blood pressure readings in the range from 120 over 80 (120/80) to 140 over 90 (140/90). If your blood pressure is within this range, you should be taking steps to bring it down or to stop it rising any further. Our five top tips will show you how."}, {"url": "http://www.livescience.com/42219-blood-pressure.html", "passage_text": "The bottom number, called the diastolic pressure, is the measurement as the heart relaxes between beats. Normal blood pressure is a systolic pressure of less than 120 millimeters of mercury (mm Hg) and a diastolic pressure of less than 80 mm Hg, or 120/80 mm Hg, according to the American Heart Association (AHA). Having a blood pressure greater than 140/90 mm Hg is considered high blood pressure or hypertension."}, {"url": "http://www.webmd.com/hypertension-high-blood-pressure/guide/diastolic-and-systolic-blood-pressure-know-your-numbers", "passage_text": "This force creates pressure on the arteries. This is called systolic blood pressure. A normal systolic blood pressure is below 120. A systolic blood pressure of 120 to 139 means you have prehypertension, or borderline high"}, {"url": "http://www.drdavidwilliams.com/normal-blood-pressure-reading/", "passage_text": "Now a blood pressure of 120/80 is considered normal, and blood pressure readings of 130–139 are considered pre-hypertension. Readings above 140/90 are considered high blood pressure, and the current thinking is that anyone falling into this category should be taking medication to lower blood pressure."}, {"url": "http://www.bloodpressureuk.org/BloodPressureandyou/Thebasics/Whatisnormal/", "passage_text": "Ideally, we should all have a blood pressure below 120 over 80 (120/80). This is the ideal blood pressure for people wishing to have good health. At this level, we have a much lower risk of heart disease or stroke. If your blood pressure is optimal, this is great news."}]