[{"url": "http://www.extremegymfranchise.com/p/cost-to-start-fitness-center.html", "passage_text": "For a big box gym, $400,000 to over a million dollars. An Extreme Gym fitness center franchise will cost you a total investment of around $55,000 for your fitness center equipment, 24 hour access system, 4 to 8 camera surveillance system including freight and installation. Even with our $10,000 franchise fee, Extreme Gym is a much wiser choice. Many fitness center franchises will cost you between $120,000 to $300,000 for a small 24/7 access fitness center. Many big box franchises will cost you in the neighborhood of $500,000 to 1.5"}, {"url": "http://www.startupinformant.com/costs-to-start-a-gym/", "passage_text": "Starting on a business plan early is a good idea. What I recommend people doing is to figure out what it will cost to get started. The three largest expenses will be real estate, gym equipment and renovation costs to get the location ready such as construction, painting, carpeting, etc) Next, figure out the overhead. Everybody has a different vision for their gym so writing an article with an exact number on how much it will cost to start a gym is not realistic, but after with the experience starting several gyms and working with others to start theirs, here are some things to think about."}, {"url": "http://blog.projectionhub.com/a-powerful-financial-model-for-a-startup-gym/", "passage_text": "Startup Costs for a Gym. Next we need to enter the estimated startup costs for a gym. Let’s assume we want to have $20,000 in the bank in cash on day 1. We also assume $1,500 in startup inventory costs for retail products, and $1,500 in other startup costs. We will also assume $3,000 for furniture in the gym. Then we are going to assume $175,000 for Gym Equipment."}, {"url": "http://smallbusiness.chron.com/start-own-gym-business-4854.html", "passage_text": "Write a business plan and get gym financing. Starting a gym will require both a written business plan and a loan. According to Entrepreneur, the average cost of opening a gym is $10,000 to $50,000. Lenders will not consider a business loan application without a complete business plan attached. The U.S. Small Business Administration offer free service to help develop business plans and provide assistance in getting loans."}, {"url": "http://www.startupinformant.com/costs-to-start-a-gym/", "passage_text": "Most gym owners I’ve talked with start their gym in the range of $150,000 – $300,000. There are many gyms that start for under $50,000 but those are the exceptions rather than the norm from what I’ve seen. Everybody has a different vision for their gym so writing an article with an exact number on how much it will cost to start a gym is not realistic, but after with the experience starting several gyms and working with others to start theirs, here are some things to think about."}, {"url": "http://www.startupinformant.com/costs-to-start-a-gym/", "passage_text": "Costs to Start a Gym. The costs associated with starting a gym or fitness center will depend on size, location, equipment, number of employees, and overhead expenses. Everybody has a different vision for their gym so writing an article with an exact number on how much it will cost to start a gym is not realistic, but after with the experience starting several gyms and working with others to start theirs, here are some things to think about."}, {"url": "http://www.getbig.com/boards/index.php?topic=181698.0", "passage_text": "Re: start up cost for a gym. « Reply #9 on: January 02, 2008, 11:30:34 PM ». I'd love to show you my budget for the gym I am opening currently in Vegas. It is just under 40,000 sq. ft. with a 32' ceiling. I have earmarked $2.75 million and that is based on getting between $15 and $25 TI money. "}, {"url": "http://www.extremegymfranchise.com/p/cost-to-start-fitness-center.html", "passage_text": "Cost to start a Fitness Center. The cost to start a fitness center can cost well over a hundred thousand dollars. Many fitness center franchises will cost you between $120,000 to $300,000 for a small 24/7 access fitness center. Many big box franchises will cost you in the neighborhood of $500,000 to 1.5 million dollars."}]