[{"url": "http://www.yourdictionary.com/pink-slime", "passage_text": "pink slime. LINK / CITE ADD TO WORD LIST. noun. Pink slime is defined as finely ground beef scraps, fat and tissue that have been made into a protein paste and treated to kill bacteria, to become a meat additive that is added into ground beef and processed meats as filler."}, {"url": "http://www.collinsdictionary.com/dictionary/english/slime", "passage_text": "Example Sentences Including 'slime'. The body was covered in green slime, which reminded me never to eat Madame Severnou's bush rat dish again. Tonight you'll think about etiquette while you're scraping slime off the tiles in the bathing room. "}, {"url": "http://beefmagazine.com/lean-finely-textured-beef", "passage_text": "Home All Topics. Recent media interest in lean finely textured beef (LFTB), which some have wrongly labeled pink slime, has caused some confusion and backlash among consumers. LFTB is a safe product that producers a leaner, cheaper end product for consumer. Lean Finely Textured Beef. Recent media interest in lean finely textured beef (LFTB), which some have wrongly labeled pink slime, has caused some confusion and backlash among consumers."}, {"url": "http://time.com/3176714/pink-slime-meat-prices-bpi-beef/", "passage_text": "It has something to do with the weather. The attention was damning. In 2012, ABC News ran an 11-segment investigation on a low-cost meat product critics called “pink slime,” a moniker coined by a former USDA employee who argued the filler wasn’t really beef. "}, {"url": "http://www.omnilexica.com/?q=Pink+Slime", "passage_text": "1  Pink Slime  is a 2013 EP album by Pharrell Williams with Mac Miller. 2  artists: Mac Miller & Pharrell Williams. 3  released in.  4  Pink Slime  is a song by La Luz. It started as “ Pink Slime is a Myth” and morphedinto“Beef isBeef”duringthe crisis, and a subsequent version was “Get the Facts on Lean Beef Trimmings .” www. beefisbeef.com/ www.BeefisBeef.com FIGURE 5.8 Janet Riley, senior vice ..."}, {"url": "http://www.omnilexica.com/?q=Pink+Slime", "passage_text": "On this page: 1  Music. 2  Miscellanea. 3  Printed encyclopedias and other books with definitions for Pink Slime. 4  Online dictionaries and encyclopedias with entries for Pink Slime. 5  Photo about Pink Slime. It started as “ Pink Slime is a Myth” and morphedinto“Beef isBeef”duringthe crisis, and a subsequent version was “Get the Facts on Lean Beef Trimmings .” www. beefisbeef.com/ www.BeefisBeef.com FIGURE 5.8 Janet Riley, senior vice ..."}, {"url": "http://www.yourdictionary.com/pink-slime", "passage_text": "(uncountable). 1  Used other than as an idiom: see pink ,‎ slime. ( 2 paper manufacture) An undesirable pink-colored microbial mass occurring in the slurry used in making paper. ( 3 informal, dysphemistic) A meat byproduct produced from scraps by heating and then treating with ammonia to produce a food additive. Pink slime is defined as finely ground beef scraps, fat and tissue that have been made into a protein paste and treated to kill bacteria, to become a meat additive that is added into ground beef and processed meats as filler."}, {"url": "http://www.yourdictionary.com/pink-slime", "passage_text": "(uncountable). 1  Used other than as an idiom: see pink ,‎ slime. 2  Slime which is pink. ( 3 paper manufacture) An undesirable pink-colored microbial mass occurring in the slurry used in making paper. Pink slime is defined as finely ground beef scraps, fat and tissue that have been made into a protein paste and treated to kill bacteria, to become a meat additive that is added into ground beef and processed meats as filler."}, {"url": "http://medical-dictionary.thefreedictionary.com/pink+slime", "passage_text": "pink slime. A popular term for an inexpensive, low-quality meat filler, which comprises up to 70% of ground beef sold in the US. "}]