[{"url": "http://www.runnersworld.com/for-beginners-only/the-importance-of-breaking-in-new-shoes", "passage_text": "Susan-. I did a long run this past Friday in a new pair of shoes. I have been running in this same shoe but just got a new pair. I felt fine during and after the run but was late to get home so I didn't stretch and just jumped in the car."}, {"url": "http://www.wikihow.com/Break-in-a-New-Pair-of-Shoes", "passage_text": "//d5kh2btv85w9n.cloudfront.net/8/84/Break in a New Pair of Shoes Step 2 Version 3.360p.mp4. 1  In fact, start with wearing your shoes 10 minutes at a time in the beginning. 2  Try this for a couple days. 3  Gradually, wear your shoes for 10 minutes more, every couple of days, until you're wearing the shoes for an hour at a time. 1"}, {"url": "http://www.caloriecount.com/forums/fitness/long-break-new-running-shoes-race", "passage_text": "I try to get at least one good long run in my new racing shoes before I wear them in an event. Typically, a 15 to 20 mile run. Marathoners never wear anything for the first time in an event ... not even a new shirt or a new pair of shorts. You are running a 5K though. "}, {"url": "http://www.ehow.com/how_2047714_break-running-shoes.html", "passage_text": "You can alternate pairs from day to day to help extend the life of each and prevent uneven wear. Break in running shoes by running 60 to 70 miles. You should plan on running at least one long distance run in your new shoes as part of the break in process in addition to several shorter runs to help break in the shoes. Break in running shoes for a marathon or other race at least 4 to 6 weeks prior to the event. "}, {"url": "http://www.howcast.com/videos/506902-How-to-Break-in-New-Running-Shoes-Running/", "passage_text": "So you’ve got a new pair of running shoes and you want to break them in a little bit. Well there’s two sides to this. First, when you leave the store with your new pair of running shoes, they really should fit. You shouldn’t really have to break them in. But at the same time if you have a long run or a long race coming up maybe you buy your shoes on Tuesday or Wednesday but you have a long run of six, seven, maybe even ten miles over the weekend you don’t want to wear that brand new pair of shoes for that long run."}, {"url": "http://www.wikihow.com/Break-in-a-New-Pair-of-Shoes", "passage_text": "//d5kh2btv85w9n.cloudfront.net/1/16/Break in a New Pair of Shoes Step 4 Version 3.360p.mp4. 1  Wear your shoes with socks that are a little bigger than you normally would use. 2  Try thick cotton socks, and squeeze into the shoes. 3  Don't do any heavy walking, or you'll give yourself blisters. 1 In fact, start with wearing your shoes 10 minutes at a time in the beginning. 2  Try this for a couple days. 3  Gradually, wear your shoes for 10 minutes more, every couple of days, until you're wearing the shoes for an hour at a time."}, {"url": "http://saltlakerunningco.com/training/articles/getting-a-shoe-ready-for-a-marathon/", "passage_text": "1 The second to last long run should be two to three weeks before that. 2  The shoe should be purchased a week before the second to last long run. 3  That puts the purchase time for the marathon shoe at four to six weeks before race day. 1 The last long run should be no closer than three weeks before the race. 2  The second to last long run should be two to three weeks before that. 3  The shoe should be purchased a week before the second to last long run. 4"}]