[{"url": "http://www.gyprock.com.au/Documents/GYPROCK-220-DIY_Guide-201211.pdf", "passage_text": "They will help you work out how many sheets of plasterboard, lengths of cornice, and quantities of accessories you will need. 12345 Frame Inspection 1. Make sure studs are located at 600mm maximum centres, and ceiling framing is at 450mm maximum centres. Ceiling framing should not change direction within a room.2. Where butt joints are necessary, please consult your Gyprock ™ plasterboard supplier for back-block installation advice. Fixing to Ceilings Check framing for straightness.1. Apply ‘daubs’ of Gyprock Stud Adhesive about 25mm diameter and 15mm thickness, about the size of a walnut, at 230mm maximum spacings.2."}, {"url": "http://www.northernbeachesplastering.com.au/Index.asp?pagename=Vermiculite+Ceilings&site=1&siteid=330", "passage_text": "2. Install a false plasterboard ceiling to encapsulate the vermiculite, this is done by installing battens and lining with 10mm ceilingboard (plasterboard) . Many customers who have the ceiling height of over 2460mm usually opt for a 60mm drop ceiling because it enables them to install down lights. If your vermiculite ceiling contains asbestos there are two ways to handle the issue: 1. Have a certified asbestos removalists safely removal all traces of the vermiculite. After the removal of the vermiculite you will be left with a ugly concrete ceiling."}, {"url": "http://www.renovateforum.com/f208/cost-gyprock-whole-house-54959/", "passage_text": "Here in melbourne the supply and fix rate will be between $12. to $16 + GST depending on the complexity, cornice types etc. Some of the very straight forward homes come out at $11.50 per m2. Material costs are as low as $3.00 per m2 for 10mm plasterboard. You really need to shop around untill you get a fair dinkum price and not someone price gouging. PS Rod1949 shop that price around you can do better than that particularly the villaboard. Try BGC plasterboard in WA they will be competetive. Cost to gyprock whole house. My parents live in Innisfail and their house was badly damaged by cyclone larry in march 2006. They finally got a new roof and windows put in last week only 1 year and 5 months later. Anyway their existing walls are masonite which have bowed due to water damage."}, {"url": "http://www.norwestplastering.com.au/residential", "passage_text": "13mm & 16mm FireStop: A fire rated plasterboard used when fire protections is specified by council. 13mm Impact: A dense & mesh coated plasterboard that is extremely hard to break through. 13mm MultiStop: A new product for 2014 combining Wet Area, Sound, Fire & Impact all-in-one. 6mm & 9mm Villaboard: A fibre cement product for bathrooms. 1 At the same time he can rewire the place for downlights and a smoke alarm, if you require this. 2  We will come and install our new ceiling. 3  This may take two or three days depending on the size and access to the premises."}, {"url": "http://www.homedesigndirectory.com.au/construction/wall-ceiling-junctions.php", "passage_text": "Cornicing. Plain plasterboard cornicing is generally the most cost effective wall to ceiling join detail on the market. This is due to it's cheap installation, ease of application and it's solid acceptance in the Australian construction industry. Square-set. Square-set cornices are a very popular option in the higher end mass Australian housing market. This type of wall to ceiling join type is probably the most cost effective after plain plasterboard cornicing and suites modern style homes. Square set corners however also attract more spiders and are harder to keep clearer of cobwebs than simple plasterboard cornices"}, {"url": "http://www.norwestplastering.com.au/residential", "passage_text": "An average price of $22 per square metre, includes standard plasterboard materials, labour & GST can be used as a guide as to how much your project will cost. This does not take into account any metal components, cornices, deliveries, angles or any other item that is required as per each job. 1 At the same time he can rewire the place for downlights and a smoke alarm, if you require this. 2  We will come and install our new ceiling. 3  This may take two or three days depending on the size and access to the premises."}, {"url": "http://www.gyprock.com.au/resources/faq.aspx", "passage_text": "When the paper is wet, or if the paper lining is subject to any deterioration, board strength and the holding capacity of fixings may be reduced. When fully dry, plasterboard can maintain its properties and strength is not permanently affected. The board must be allowed to dry and be inspected for signs of deterioration or warping. If it can be shown that the strength is not affected, it is expected that the board can be retained. If you are not satisfied that the board strength is unaffected, our recommendation is for wet plasterboard to be replaced. "}, {"url": "http://www.wickes.co.uk/Products/Building-Materials/Plaster+Plasterboard/c/1000178", "passage_text": "Plaster & Plasterboard. Wickes provides premium plastering supplies, including Plaster, Plasterboard & Coving. Our great range of products will help with all DIY plastering jobs. Plasterboard. Wickes Plasterboard is available in a variety of formats, including wallboard, baseboard and insulated plasterboard. Plaster. The Wickes range of British Gypsum bagged plaster has been created to cover most plastering finishes and backgrounds."}]