[{"url": "https://en.wikipedia.org/wiki/Burt_Ward", "passage_text": "Adam West and Burt Ward reprised their TV roles of Batman and Robin in the 20th Century Fox film Batman: The Movie released on July 30, 1966. Burt said of Adam West, his mentor and friend for more than four decades, We were completely opposite. He and Adam West were up against Lyle Waggoner and Peter Deyell for the roles of Batman and Robin, respectively. Selected for the role of Robin, Ward thought people would find Gervis (the 'G' is soft, as in gentleman) hard to pronounce and adopted his mother's maiden name, Ward."}, {"url": "http://www.answers.com/Q/Which_actors_have_played_Batman", "passage_text": "The first actor to portray Batman was Lewis Wilson in 1943. The comic hero had been around for just four years. The second to play the masked hero was Robert Lowery in 1949 in The New Adventures of Batman & Robin. The first actor to play Batman was Lewis Wilson, in the first Batman movie (1943). I have included a link to the page where I got this information (the page also has a still a … nd a video clip of the film)."}, {"url": "http://www.cnn.com/2013/08/23/showbiz/gallery/actors-playing-batman/index.html", "passage_text": "8 photos: Actors who have played Batman. Michael Keaton – Twenty years after Adam West's Batman came Michael Keaton in Tim Burton's 1989 Batman.. He played more of a dark, explosive Batman, the opposite of West's goofy type. 8 photos: Actors who have played Batman. Christian Bale – After the disaster of Batman & Robin, the franchise was destined to remain a joke until director Christopher Nolan came along to reinvent the role and finally make the Dark Knight, well, dark."}, {"url": "http://www.cnn.com/2013/08/23/showbiz/gallery/actors-playing-batman/index.html", "passage_text": "6 of 8. 8 photos: Actors who have played Batman. George Clooney – Handsome, up-and-coming actor George Clooney was cast as the Caped Crusader in 1997's Batman & Robin.. The film received some of the worst reviews, and Clooney once joked that he helped to kill the franchise. 8 photos: Actors who have played Batman. Christian Bale – After the disaster of Batman & Robin, the franchise was destined to remain a joke until director Christopher Nolan came along to reinvent the role and finally make the Dark Knight, well, dark."}, {"url": "http://www.biography.com/people/groups/actors-who-played-batman", "passage_text": "The Batman and his secrect identity Bruce Wayne first appeared in 1939 but many actors since have brought the Dark Knight to life. From Adam Wayne's TV Caped Crusader to Christian Bale's brooding Batman and beyond, check out the actors who have portrayed Gotham City's legendary defender. Actor Adam West played the crime-fighting superhero Batman on the 1966 television series. The phenomenal popularity of the series made West a household name."}, {"url": "http://www.cnn.com/2013/08/23/showbiz/gallery/actors-playing-batman/index.html", "passage_text": "The Batmen: Actors who have played Batman – Holy smokes, Batman!. Adam West might be the best-known of the Batmen. His campy, over-the-top portrayal of the Worlds Greatest Detective led to the popularity of the 1966 to 1968 Batman television series and the first full-length feature film, Batman: The Movie in 1966. 8 photos: Actors who have played Batman. Christian Bale – After the disaster of Batman & Robin, the franchise was destined to remain a joke until director Christopher Nolan came along to reinvent the role and finally make the Dark Knight, well, dark."}, {"url": "http://www.answers.com/Q/Which_actors_have_played_Batman", "passage_text": "Then came actor Adam West, who starred in the 1966 installment of Batman along with the tongue-in-cheek series that followed. Michael Keaton played Batman twice, in the action films Batman (1989) and Batman Returns (1992). Val Kilmer played the caped crusader in Batman Forever (1995) and George Clooney portrayed him in Batman & Robin (1997). Most recently, Christian Bale took on the role, in Batman Begins (2005) and The Dark Knight (2008). The first actor to play Batman was Lewis Wilson, in the first Batman movie (1943). I have included a link to the page where I got this information (the page also has a still a … nd a video clip of the film)."}, {"url": "http://time.com/41436/batman-actors-gallery/", "passage_text": "A look back at the actors who brought them to life. In light of the recent revelation that Hunger Games star Jena Malone may play the next Robin, take a look at all the other actors that have played Batman and Robin throughout the years. 0."}, {"url": "http://www.biography.com/people/groups/actors-who-played-batman", "passage_text": "Actors Who Played Batman. The Batman and his secrect identity Bruce Wayne first appeared in 1939 but many actors since have brought the Dark Knight to life. Ben Affleck and Jennifer Garner-Full Biography (TV-14; 45:18) Ben Affleck and Jennifer Garner have remarkably stayed out of the media spotlight. Actor Adam West played the crime-fighting superhero Batman on the 1966 television series. The phenomenal popularity of the series made West a household name."}]