[{"url": "http://www.definitions.net/definition/Valpolicella", "passage_text": "The red wine known as Valpolicella is typically made from three grape varietals: Corvina Veronese, Rondinella, and Molinara. A variety of wine styles is produced in the area, including a recioto dessert wine and Amarone, a strong wine made from dried grapes."}, {"url": "http://www.oxforddictionaries.com/definition/english/garganega", "passage_text": "1 The 1980s saw a revival of the sweet Recioto di Soave, made from Garganega grapes with a long local tradition. 2  A Veronese variety such as Garganega for a white Recioto will need three to four months."}, {"url": "http://winewordswisdom.com/wine_reviews/passito-wines.html", "passage_text": "Recioto della Valpolicella, or Recioto as it is generally known, is an intensely flavored, sweet red wine from the western part of Italy’s Veneto region. It is made from hand-selected grapes that are naturally dried prior to fermentation in the basic appassimento process."}, {"url": "http://www.wine-tastings-guide.com/amarone-wine.html", "passage_text": "Amarone is the name of a style of wine, not the region the wine comes from. It is produced in the large area in Italy's northeast known as Veneto (Venice is there on the coast). Within that large region is a smaller wine producing region known as Valpolicella."}, {"url": "http://www.oxforddictionaries.com/definition/english/garganega", "passage_text": "More example sentences. 1  The 1980s saw a revival of the sweet Recioto di Soave, made from Garganega grapes with a long local tradition. 2  A Veronese variety such as Garganega for a white Recioto will need three to four months."}, {"url": "http://winewordswisdom.com/wine_reviews/passito-wines.html", "passage_text": "Recioto wines will typically have an intense ruby-red color with a purple rim and intoxicating aromas of dried plums, figs and mocha. The wines should be full-bodied, rich and sweet with smooth tannins, and dried fruit flavors with perhaps a touch of spice from oak ageing."}, {"url": "http://www.winespectator.com/drvinny/show/id/40479", "passage_text": "—Amanda Y., Sydney, Australia. Dear Amanda, “Recioto,” as in “Recioto della Valpolicella,” refers to a dessert wine made from grapes that were dried on mats after picking. This process turns the grapes closer to raisins, concentrating the flavors. The wines are lovely and taste how you’d expect raisins-turned-wine to taste, rich and sweet."}]