[{"url": "https://en.wikipedia.org/wiki/List_of_political_catch_phrases", "passage_text": "The following is a list of political catchphrases, that is, distinctive statements uttered by political figures that have gone on to become well known. 1 ... government of the people, by the people, for the people, shall not perish from the earth, ending of Abraham Lincoln 's Gettysburg Address.  2  Speak softly, and carry a big stick , Theodore Roosevelt 's corollary to the Monroe Doctrine."}, {"url": "http://rationalwiki.org/wiki/Socialism", "passage_text": "Socialism is typically opposed to plutocracy and emphasizes in some form or another that people who work and produce the value in society should be rewarded in monetary terms in accordance to their work effort. Most utopian socialists believed in the term, from each according to his abilities, to each according to his need.. This saying was coined by Marx, but was a reference to a very similar quote from another revolutionary socialist, Louis Blanqui, which was itself an apparent paraphrase of Acts 3:34-35."}, {"url": "https://en.wikipedia.org/wiki/Democracy", "passage_text": "While representative democracy is sometimes equated with the republican form of government, the term  republic  classically has encompassed both democracies and aristocracies. Many democracies are constitutional monarchies, such as the United Kingdom. Parliamentary democracy is a representative democracy where government is appointed by, or can be dismissed by, representatives as opposed to a presidential rule wherein the president is both head of state and the head of government and is elected by the voters."}, {"url": "https://en.wikipedia.org/wiki/Democracy", "passage_text": "Democracy, or democratic government, is a system of government in which all the people of a state or polity ... are involved in making decisions about its affairs, typically by voting to elect representatives to a parliament or similar assembly, as defined by the Oxford English Dictionary. Parliamentary democracy is a representative democracy where government is appointed by, or can be dismissed by, representatives as opposed to a presidential rule wherein the president is both head of state and the head of government and is elected by the voters."}, {"url": "http://www.emersonkent.com/history_dictionary/communism.htm", "passage_text": "The Origin of the Term Communism The following is a quote from the 2002 book Communism in History and Theory-From Utopian Socialism to the Fall of the Soviet Union by Donald F. Busky. As for the word communism, London Owenite * (John) Goodwyn Barmby (1820-1881) claimed in 1848 to have first coined the word in 1840. Not until 1842 did Karl Marx use the word communism in print. And here you can buy Busky's book. So there we have it. The French are at the root of the term communism because it was coined in France shortly after the French Revolution, which was the ultimate French quest for alternatives to absolute monarchy."}, {"url": "https://en.wikipedia.org/wiki/Democracy", "passage_text": "Democracy is further defined as (a:) government by the people; especially: rule of the majority (b:)  a government in which the supreme power is vested in the people and exercised by them directly or indirectly through a system of representation usually involving periodically held free elections.. Parliamentary democracy is a representative democracy where government is appointed by, or can be dismissed by, representatives as opposed to a presidential rule wherein the president is both head of state and the head of government and is elected by the voters."}, {"url": "http://rationalwiki.org/wiki/Socialism", "passage_text": "The Socialist International is a worldwide federation of socialist political parties, including democratic socialist and labor parties. Over thirty nations are governed by a Socialist International member-party, such as Brazil, France, Australia, Iceland, and South Africa. Most utopian socialists believed in the term, from each according to his abilities, to each according to his need.. This saying was coined by Marx, but was a reference to a very similar quote from another revolutionary socialist, Louis Blanqui, which was itself an apparent paraphrase of Acts 3:34-35."}, {"url": "http://rationalwiki.org/wiki/Socialism", "passage_text": "The question of whether the standard Marxist-inspired definition of socialism involving social ownership of the means of production and economic planning is economically feasible has been ongoing, with social democrats having abandoned this pursuit. Most utopian socialists believed in the term, from each according to his abilities, to each according to his need.. This saying was coined by Marx, but was a reference to a very similar quote from another revolutionary socialist, Louis Blanqui, which was itself an apparent paraphrase of Acts 3:34-35."}, {"url": "http://www.econlib.org/library/Enc/Capitalism.html", "passage_text": "Return to top. “ Capitalism,” a term of disparagement coined by socialists in the mid-nineteenth century, is a misnomer for “economic individualism,” which Adam Smith earlier called “the obvious and simple system of natural liberty” (Wealth of Nations). Even nineteenth-century economists—in England, America, and Western Europe—who were supposedly capitalism’s defenders did not defend capitalism effectively because they did not understand it. They came to believe that the most defensible economic system was one of “perfect” or “pure” competition."}]