[{"url": "http://www.ushistory.org/gov/6b.asp", "passage_text": "After each legislative election the party that wins the most representatives is designated the  majority  in each house, and the other party is called the  minority .. These designations are significant because the majority party holds the most significant leadership positions, such as Speaker of the House. The majority leader usually the second ranking member of the majority party, is the party leader on the floor. Often hand-picked by the Speaker, the majority leader helps plan the party's legislative program. Many Speakers came to their positions by serving as majority leader first."}, {"url": "http://www.ushistory.org/gov/6b.asp", "passage_text": "The majority leader is usually the most influential person in the Senate. He has the privilege of beginning debates on legislation, and he usually influences choices for committee assignments. He shares his power with the minority leader, who leads the other party. The majority leader usually the second ranking member of the majority party, is the party leader on the floor. Often hand-picked by the Speaker, the majority leader helps plan the party's legislative program. Many Speakers came to their positions by serving as majority leader first."}, {"url": "https://en.wikipedia.org/wiki/Party_leader", "passage_text": "In politics, the party leader is the most powerful official within a political party. He/She speaks to his/her political party and represents them.The party leader is typically responsible for managing the party's relationship with the general public. Xi Jinping is the party leader of the largest economy in the world. He is the party leader for the communist party in China and was elected by the Central Committee of the Communist Party of China."}, {"url": "http://www.usnews.com/topics/subjects/republican-party", "passage_text": "Republican Party. The Republican Party, or the GOP, currently holds the majority in the US House of Representatives as well as the majority of state legislatures. The Republican leaders are Kentucky’s Mitch McConnell in the Senate and Ohio’s John Boehner in the House"}, {"url": "http://www.cnn.com/2013/03/08/opinion/elleithee-gop-rand-paul/index.html", "passage_text": "That's right. At least for the time being, tea party darling Sen. Rand Paul is the effective leader of the Republican Party. And that's a pretty big deal. Mo Elleithee. The GOP's shellacking in 2012 has thrust a new generation of Republicans -- including leaders like Rubio, Rep. Paul Ryan, Sen. Ted Cruz, and Govs. Bobby Jindal and Chris Christie -- into the spotlight. But it's Paul who has become the clearest voice of the new guard in the Republican Party. "}, {"url": "https://en.wikipedia.org/wiki/Party_leaders_of_the_United_States_Senate", "passage_text": "The current leaders are Republican Majority Leader Mitch McConnell of Kentucky and Democratic Minority Leader Harry Reid of Nevada. The current Assistant Majority Leader is Republican John Cornyn of Texas. The current Assistant Minority Leader is Democrat Dick Durbin of Illinois. "}, {"url": "http://www.cbsnews.com/news/ted-cruz-leader-of-the-republican-party/", "passage_text": "And Cruz was the one that Family Research Council President Tony Perkins called a de facto leader of the Republican Party in an interview with CNN. A freshman senator, Cruz's profile has risen fast because of his dual abilities to excite the base and rankle his colleagues in the Senate. "}, {"url": "http://www.house.gov/leadership/", "passage_text": "The majority party members and the minority party members meet separately to select their leaders. Third parties rarely have had enough members to elect their own leadership, and independents will generally join one of the larger party organizations to receive committee assignments. A party caucus or conference is the name given to a meeting of or organization of all party members in the House. Elected by the whole of the House of Representatives, the Speaker acts as leader of the House and combines several roles: the institutional role of presiding officer and administrative head of the House, the role of leader of the majority party in the House, and the representative role of an elected member of"}, {"url": "https://en.wikipedia.org/wiki/Party_leader", "passage_text": "In parliamentary systems of government, party leaders typically seek to become prime minister. It is thus typical in such states (e.g., in the Westminster system) for the party leader to seek election to the legislature, and, if elected, to simultaneously serve as the party's parliamentary leader. Xi Jinping is the party leader of the largest economy in the world. He is the party leader for the communist party in China and was elected by the Central Committee of the Communist Party of China."}]