[{"url": "http://jwilson.coe.uga.edu/EMAT6680Fa09/Gonterman/Gonterman4/Gonterman4.html", "passage_text": "Proof of Concurrency of Angle Bisectors of a Triangle. - Given a triangle ABC, construct the angle bisectors of angle BAC and angle ABC. - Mark the intersection of of the two rays as the point K. - From the point K, construct segments that are perpendicular to each of the three sides of the triangle."}, {"url": "https://www.wyzant.com/resources/lessons/math/geometry/triangles/bisectors_of_triangles", "passage_text": "The point at which the perpendicular bisectors of a triangle meet, or the circumcenter, is equidistant from the vertices of the triangle. On the other hand, angle bisectors simply split one angle into two congruent angles. Points on angle bisectors are equidistant from the sides of the given angle. We also note that the points at which angle bisectors meet, or the incenter of a triangle, is equidistant from the sid"}, {"url": "http://hotmath.com/hotmath_help/topics/bisectors-in-a-triangle.html", "passage_text": "The three perpendicular bisectors of the sides of a triangle meet in a single point, called the circumcenter. A point where three or more lines intersect is called a point of concurrency. So, the circumcenter is the point of concurrency of perpendicular bisectors of a triangle."}, {"url": "http://www.answers.com/Q/What_is_the_point_of_concurrency_of_the_perpendicular_bisectors_of_a_triangle_called", "passage_text": "The circumcenter, the incenter is the point of concurrency of the angle bisectors of a triangle."}, {"url": "http://www.integral-sk.com/geometry/perpendiculars-and-bisectors/", "passage_text": "Definition: The point of concurrency of the perpendicular bisectors of triangles is called the circumcenter of the triangle. Theorem 3.1 Concurrency of Perpendicular Bisectors of a Triangle. The perpendicular bisector of a triangle intersect at a point that is equidistant from the vertices of the triangle. PA = PB = PC. Definition: The point of concurrency of the angle bisectors is called the incentsr of the triangle and it always lies inside the triangle. Theorem 4.1 Concurrency of Perpendicular Bisectors of a Triangle. The angle bisectors of a triangle intersect at a point that is equidistant from the sides of the triangle. PD = PE = PF. Definition: A median of a triangle is a segment whose endpoints are a vertex of the triangle and the midpoint of the opposite side."}]