[{"url": "http://www.therugbyblog.com/saracens-confirm-ground-move-to-artificial-pitch", "passage_text": "Shaftesbury Barnet Harriers would thrive, Saracens would use the artificial turf pitch around 16 times per year, and the rest of the time – up to 350 days per year – the field could be used by schools, local clubs and the wider community. Saracens confirm ground move to artificial pitch. Saracens have announced today that they are moving from Vicarage Road to a new ground in Barnet, where there is an"}, {"url": "https://en.wikipedia.org/wiki/Barnet_Copthall", "passage_text": "Barnet Copthall Stadium in 2006 before renovation. Barnet Copthall is a leisure complex in Hendon, London NW4, near the border with Mill Hill. At its centre is a stadium known for sponsorship reasons as Allianz Park, the home ground of rugby union Premiership side Saracens since February 2013. Today, the complex houses a local authority-owned swimming pool and gymnasium facilities next to the new Allianz Stadium which is primarily used for Rugby and Athletics. The stadium opened in January 2013, after Saracens began the 2012–13 season as a nomadic club, using 5 different venues for home matches (Twickenham, Wembley, Vicarage Road, King Baudouin Stadium and Stadium MK)."}, {"url": "http://www.saracensamateurrugby.com/", "passage_text": "Latest. Welcome to the Saracens Amateur RFC Limited website. Founded in 1876, Saracens Amateurs continues a proud tradition of providing rugby for all-Men, Women and Juniors. New players are welcome!"}, {"url": "https://en.wikipedia.org/wiki/Saracens_(rugby_club)", "passage_text": "Now incorporated as Saracens Ltd, the club was established in 1876 as the Saracens Football Club. As well as competing in the Aviva Premiership, of which they are the reigning champions, Saracens are the current holders of the Anglo-Welsh Cup and also compete in European rugby cups. The club's colours are black and red. Special games played at Bramley Road during this period include the 1971 match against a select International XV. It was a fantastic occasion, as a 5,000 strong crowd (the largest ever to watch a rugby union game in North London at the time) came to watch a magnificent contest, ending Saracens 34 International XV 34."}, {"url": "https://en.wikipedia.org/wiki/Saracens_(rugby_club)", "passage_text": "Saracens are a professional rugby union team based in London, England – although they formerly played their home games at Vicarage Road, in Watford just outside of the capital. The team returned to London during the 2012–13 season, when they relocated to their newly built and renovated Allianz Park. Special games played at Bramley Road during this period include the 1971 match against a select International XV. It was a fantastic occasion, as a 5,000 strong crowd (the largest ever to watch a rugby union game in North London at the time) came to watch a magnificent contest, ending Saracens 34 International XV 34."}, {"url": "http://www.premiershiprugby.com/matchcentre/fixtures/saracens.php", "passage_text": "Paddy McAllister's home debut for Gloucester Rugby sees them take on reigning Aviva Premiership Rugby champions Saracens and the prop is itching to test himself against the best. Land Rover Premiership Rugby Cup goes off in style at Saracens. Aviva Premiership Rugby wrap: Round 1. "}, {"url": "http://stadiumstay.co.uk/rugby-union/saracens/", "passage_text": "Allianz Park. With a capacity of 10,000, Allianz Park (part of the Barnet Copthall Leisure Centre) has been the home of Rugby Union side Saracens since early 2013. It is conveniently situated close to the M1 motorway, and also within half an hour’s walk from Mill Hill East underground station. Where: Greenlands Lane, Hendon, London. "}, {"url": "http://www.rugbygroundguide.com/saracens.html", "passage_text": "In the ground they serve up real ales (including 'Saracens Ale', which was chosen by the fans prior to their move), cider, craft lagers. There is a large public bar in the East Stand that can cater for 1,000 thirsty supporters, and several smaller bars dotted around the ground. Today the club is home to a significant number of South African-born players amongst a number of other nationalities. In 2006, Saracens moved home ground (something of a trend over the years!) to Vicarage Road, the home of Watford Football Club where the club remained until 2013."}, {"url": "http://www.rugbygroundguide.com/saracens.html", "passage_text": "Ground Information. The home of Saracens since 2013 has been Allianz Park, located in the North London suburb of Hendon. Traditionally an athletics stadium (known as Barnet Copthall), the ground has been completed redeveloped and controversially features an artificial pitch that has been specially developed for rugby. Today the club is home to a significant number of South African-born players amongst a number of other nationalities. In 2006, Saracens moved home ground (something of a trend over the years!) to Vicarage Road, the home of Watford Football Club where the club remained until 2013."}]