[{"url": "http://family-law.lawyers.com/divorce/divorce-in-florida.html", "passage_text": "Going to Trial. The most expensive type of divorce in Florida is one that goes to trial. According to our survey results, the average cost of a divorce case that went to trial in Florida was $24,500, including $19,800 in attorney’s fees. In contrast, cases that settled cost an average of $14,400, including $9,500 in attorney’s fees. The average hourly fee charged by Florida divorce lawyers was $320 per hour, compared to the national average of $236 per hour. Our readers in Florida, however, reported a wide fluctuation in their divorce lawyers’ hourly rates -- some were charged as little as $150 per hour, while others paid as much as $450 per hour."}, {"url": "http://tampabaylawyers.com/how-much-does-a-divorce-cost.aspx", "passage_text": "The question often arises during a divorce “how much does a divorce cost?” Theodore Rechel of Rechel & Associates in Tampa, Florida answers this question. "}, {"url": "http://divorce.laws.com/cost-of-divorce/how-much-does-a-divorce-cost-in-florida", "passage_text": "These attorneys generally charge by the hour and can be very expensive, easily asking for $200 or more per hour. It is crucial to get a detailed, written estimate of the timeline of your case, the number of hours of work involved, and the final cost you will be incurring. Before filing for divorce, couples who cannot agree on the terms of their separation may wish to seek the services of an attorney who can mediate and help craft an agreement."}, {"url": "http://info.legalzoom.com/average-cost-uncontested-divorce-20665.html", "passage_text": "Whether you handle your divorce yourself or hire an attorney, there will be extra costs. State courts charge a filing fee for a divorce petition, usually in the neighborhood of $200. If you use a sheriff or private process server to deliver your petition to your spouse, this will cost an additional $35 to $100. In most states, you can bypass this expense if you’re on amicable terms with your spouse. The average cost is about $300. You can also hire an attorney by the hour to review your paperwork for you. This will cost less than a flat uncontested divorce rate, but would not require putting down a retainer fee. You’re not retaining the attorney; you’re purchasing his time by the hour, just for specific services."}, {"url": "http://www.3stepdivorce.com/states/florida.shtml", "passage_text": "Our 3StepDivorce Online Divorce for Florida is offered with a peace-of-mind 100% guarantee. We offer a 100% guarantee that the documents provided will be accepted by the Florida courts to finalize your divorce. "}, {"url": "http://family-law.lawyers.com/divorce/divorce-in-florida.html", "passage_text": "According to our survey results, the average divorce in Florida cost $18,600, including $13,800 in attorney’s fees. That’s 45% higher than the national average in total costs, and 36% higher than the national average for attorney’s fees. The average hourly fee charged by Florida divorce lawyers was $320 per hour, compared to the national average of $236 per hour. Our readers in Florida, however, reported a wide fluctuation in their divorce lawyers’ hourly rates -- some were charged as little as $150 per hour, while others paid as much as $450 per hour."}, {"url": "http://info.legalzoom.com/file-divorce-jacksonville-florida-24278.html", "passage_text": "If you are filing for divorce in Jacksonville, Florida, everything you need is available from the Office of Family Court Services (FCS), including forms and help with filling them out. FCS also offers free seminars in self-representation, covering various aspects of self-representation throughout the divorce process. "}]