[{"url": "http://www.brisbanetimes.com.au/queensland/gold-coast-cops-mocked-by-colleagues-20140929-10nr7q.html", "passage_text": "Police officers involved in the Network Ten reality show Gold Coast Cops have been mocked by some of their colleagues within police stations and on social media. But other officers involved in Gold Coast Cops have questioned their treatment within the show. It's not fair what they have done to those who agreed to be in the show. Talk about media spin, a friend of a featured officer posted."}, {"url": "https://en.wikipedia.org/wiki/Gold_Coast,_Queensland", "passage_text": "Gold Coast is a coastal city in southeastern Queensland on the east coast of Australia. It is the second most populous city in the state, the sixth most populous city in the country, and the most populous non-capital city and cross-state metropolitan area in Australia. The first settlement in what is now South East Queensland was as a penal colony at Redcliffe. The Gold Coast region remained largely uninhabited by Europeans until 1823 when explorer John Oxley landed at Mermaid Beach. The hinterland's red cedar supply attracted people to the area in the mid-19th century."}, {"url": "http://www.youtube.com/watch?v=o7jYNX_EXao", "passage_text": "This 10 part series follows the work of Gold Coast police officers from the newly created Rapid Action & Patrols Group (RAP). These Police officers are apart of the elite task force responsible for policing everything from bikie gangs and street violence to drug heists and organised crime. "}, {"url": "https://en.wikipedia.org/wiki/Gold_Coast,_Queensland", "passage_text": "Gold Coast City is the major film production centre in Queensland and has accounted for 75% of all film production in Queensland since the 1990s, with an expenditure of around $150 million per year. The first settlement in what is now South East Queensland was as a penal colony at Redcliffe. The Gold Coast region remained largely uninhabited by Europeans until 1823 when explorer John Oxley landed at Mermaid Beach. The hinterland's red cedar supply attracted people to the area in the mid-19th century."}, {"url": "http://www.youtube.com/watch?v=aXQfw3BkEys", "passage_text": "Please try again later. This 10 part series follows the work of Gold Coast police officers from the newly created Rapid Action & Patrols Group (RAP). These Police officers are apart of the elite task force responsible for policing everything from bikie gangs and street violence to drug heists and organised crime. Established earlier this year and led by Superintendent Jim Keogh, the unit offers the community a permanent police presence on the Gold Coast."}, {"url": "http://www.brisbanetimes.com.au/queensland/gold-coast-cops-mocked-by-colleagues-20140929-10nr7q.html", "passage_text": "The Gold Coast's Rapid Action Patrol Group is the focus of the new 10-part Channel Ten series Gold Coast Cops. But other officers involved in Gold Coast Cops have questioned their treatment within the show. It's not fair what they have done to those who agreed to be in the show. Talk about media spin, a friend of a featured officer posted."}, {"url": "http://www.youtube.com/watch?v=aXQfw3BkEys", "passage_text": "This 10 part series follows the work of Gold Coast police officers from the newly created Rapid Action & Patrols Group (RAP). These Police officers are apart of the elite task force responsible for policing everything from bikie gangs and street violence to drug heists and organised crime. Established earlier this year and led by Superintendent Jim Keogh, the unit offers the community a permanent police presence on the Gold Coast."}, {"url": "http://tenplay.com.au/channel-ten/gold-coast-cops", "passage_text": "About The Show. Gold Coast Cops is a 10-part observational documentary series that follows the work of the Gold Coast’s hand-picked police taskforce known as the Rapid Action and Patrols group. "}, {"url": "http://film.moregoldcoast.com.au/", "passage_text": "Film Home. The Gold Coast is at the core of film-making in Australia. Situated just 45 minutes from Queensland’s capital Brisbane, and one hours flight north of Sydney, the Gold Coast provides an myriad of accessible big screen locations that are within easy reach for international producers."}, {"url": "http://www.brisbanetimes.com.au/queensland/gold-coast-cops-mocked-by-colleagues-20140929-10nr7q.html", "passage_text": "That makes us the same and maybe we should be supporting each other not using every opportunity to bag the s**t out of other sections, another officer posted. Queensland police officers mock colleagues involved in Channel Nine's Gold Coast Cops reality show. You have a shot at us, the rank and file of RAP because someone has described us as 'elite'. But other officers involved in Gold Coast Cops have questioned their treatment within the show. It's not fair what they have done to those who agreed to be in the show. Talk about media spin, a friend of a featured"}]