[{"url": "https://en.wikipedia.org/wiki/Grief", "passage_text": "Grief is a multifaceted response to loss, particularly to the loss of someone or something that has died, to which a bond or affection was formed. Although conventionally focused on the emotional response to loss, it also has physical, cognitive, behavioral, social, and philosophical dimensions. The grief associated with death is familiar to most people, but individuals grieve in connection with a variety of losses throughout their lives, such as unemployment, ill health or the end of a relationship."}, {"url": "http://www.naturalnews.com/032362_grief_illness.html", "passage_text": "The loss of one person's pet can be just as devastating as the loss of another person's parent. We tend to equate grief with the death of a friend or loved one, but it can just as easily result from broken relationships, divorce, job loss, or a personal perception of failure."}, {"url": "http://www.psychguides.com/guides/grief-symptoms-causes-and-effects/", "passage_text": "Grief Symptoms, Causes and Effects. Grief is a normal part of coping with a loss, but for some people, it can be far more serious. In some situations, normal grief can lead to a grief disorder, which can require professional help to overcome. In some people, grief can lead to depression. Clinical depression is a serious condition that requires medical care. In fact, according to PBS, depression touches the lives of 15 million Americans each year. If you are, or a loved one is, suffering from depression, it is important to seek help as soon as possible."}, {"url": "https://en.wikipedia.org/wiki/Grief", "passage_text": "Grief is also a reaction to any loss. The grief associated with death is familiar to most people, but individuals grieve in connection with a variety of losses throughout their lives, such as unemployment, ill health or the end of a relationship."}, {"url": "http://www.webmd.com/balance/tc/grief-and-grieving-cause", "passage_text": "Grief and grieving are the natural response to a major loss, such as the death of a loved one. Loss can cause feelings of grief, sometimes when you least expect it. You may find that old feelings of grief from past loss can be triggered by current experiences or anniversaries of that loss. This is normal. Slowing down just a few moments a day can be beneficial to your health, says Frederic Luskin, Ph.D., coauthor of Stress Free... Anticipatory grief is grief that happens in advance of an impending loss. You may feel anticipatory grief because a loved one is sick and dying."}, {"url": "http://www.webmd.com/balance/tc/grief-and-grieving-symptoms", "passage_text": "1 Physical expressions of grief often include crying and sighing, headaches, loss of appetite, difficulty sleeping, weakness, fatigue, feelings of heaviness, aches, pains, and other stress-related ailments. 2  Emotional expressions of grief include feelings of sadness and yearning. "}, {"url": "http://cms.carepages.com/CarePages/en/ArticlesTips/FeatureArticles/Contributors/help-for-severe-depression.html", "passage_text": "The most common symptoms of grief and major depression include changes in sleep patterns (typically insomnia), lack of appetite, fatigue, withdrawal from formerly pleasant activities, and feelings of sadness and loss. Guilt or shame are also very common, as are feelings of anger at the deceased for leaving you. What Severe Depression Symptoms May MeanWhen You're Grieving. Major depression is just one of a number of mental disorders that may be associated with the death of a loved one. Others include generalized anxiety disorder and post-traumatic stress disorder (PTSD)."}, {"url": "https://www.sharecare.com/health/grief-emotional-health/article/coping-with-grief", "passage_text": "But we grieve for many reasons -- be it the loss of a loved one, the loss of a job, the end of a relationship, or the loss of good health. In fact, even events of a wider scale, such as natural disasters or terrorist attacks, can cause people to grieve at the loss of their sense of safety and security. "}, {"url": "http://familydoctor.org/familydoctor/en/prevention-wellness/emotional-wellbeing/mental-health/grieving-facing-illness-death-and-other-losses.html", "passage_text": "Grief is a normal, healthy response to a loss. It describes the emotions you feel when you lose someone or something important to you. People grieve for many different reasons, including the following: 1  Death of a loved one, including pets. 2  Divorce or relationship changes, including friendships. The symptoms of grief and the symptoms of depression are quite similar. While it’s normal for you to feel sad after a loss, the feelings associated with grief should be temporary."}]