[{"url": "http://contract-law.laws.com/enforcing-contracts/enforceable-contract", "passage_text": "A legal contract is never a void contract, though it may be a voidable contract. What was previously an enforceable contract may become unenforceable in the event laws that make the contracted act illegal are passed after the contract has been created."}, {"url": "http://definitions.uslegal.com/e/enforceable/", "passage_text": "Enforce means to compel observance of or obedience to. Enforceable means capable of being enforced. A right or obligation is enforceable if a party obligated to an act can be forced or ordered to comply with the legal process. In other words, enforceable is an action which can be made effective. For example, an agreement or contract between persons in which either of the parties can legally compel the performance of the other is called an enforceable contract."}, {"url": "http://www.lanternlegal.com/contract_enforceability.php", "passage_text": "By definition, contracts are enforceable agreements which people enter so that each party has the reassurance that his or her interests are legally protected. In order for each party’s interests to be protected, the agreement must be a legal contract, as that term is defined by state law."}, {"url": "http://corporate.findlaw.com/business-operations/contracts-law.html", "passage_text": "A contract is a legally enforceable agreement between two or more parties. The core of most contracts is a set of mutual promises (in legal terminology, consideration). The promises made by the parties define the rights and obligations of the parties. Contracts are enforceable in the courts."}, {"url": "http://www.utsa.edu/purchasing/contracts/definition.cfm", "passage_text": "An agreement to purchase marijuana, for example, is not a legal contract. Because the subject matter of the agreement is illegal, the contract is not enforceable and the parties have no legal remedies for breach. Similarly, a contract with a minor is not legally enforceable."}, {"url": "http://www.ilovelibraries.org/article/nuts-and-bolts-enforceable-contract", "passage_text": "In order for a contract to be enforceable, its subject matter cannot be prohibited by law or violate public policy. For example, a contract for the sale of illegal drugs is not enforcable, and a person cannot promise to transfer clear title to real estate if the property is encumbered by a lien or mortgage."}]