[{"url": "http://www.kielichlawfirm.com/employer-background-checks-texas-show/", "passage_text": "The basic rule for employment background checks. The basic rule for criminal background checks in Texas is that an employer may go back as far as seven years in a criminal background check. However, there are several exceptions to this rule."}, {"url": "https://www.criminalwatchdog.com/faq/how-long-does-background-check-take", "passage_text": "Online Services. How long background checks take depends on the type of information you need. Some information can be delivered instantly, while other checks can take up to four days to process. Below is a list of the different places you can gather background check information and how long each takes."}, {"url": "http://smallbusiness.chron.com/long-pre-employment-background-checks-come-back-1226.html", "passage_text": "Average time. Most background checks can be completed between three days to one week. According to the University of Berkeley, FBI checks usually take around 30 days. Although some instant background checks are available, these rely on databases that can be incomplete or inaccurate. Instant criminal records databases, in particular, often contain many errors."}, {"url": "http://smallbusiness.chron.com/long-pre-employment-background-checks-come-back-1226.html", "passage_text": "Most employers, particularly small-and medium-sized companies, outsource background checks to consumer reporting agencies. These agencies are generally very fast, but the time it takes the check to come back to the employer depends on a number of factors."}, {"url": "http://www.amof.info/how-far-back.htm", "passage_text": "It is difficult to say how far back records will be searched if records can be missed because of incomplete or incorrect identifiers. Also, if records are filed and indexed by date and the database is large, how far back the background check goes will depend on the time and money invested in searching the records."}, {"url": "http://www.ehow.com/how-does_5376209_far-go-back-background-checks.html", "passage_text": "How long criminal checks date back vary by state and county. However, most criminal court vendors will perform checks that date back seven to 10 years. Most employers will only search records dating back seven years in counties in which you have lived, worked or studied."}, {"url": "http://www.hirerightexpress.com/express/FAQ/", "passage_text": "1 Depending on the employer's preferences and objectives, the background check can be as basic as checking county criminal records, or as comprehensive as also checking Federal criminal records and motor vehicle records, verifying past employment and education, conducting reference checks, and drug testing."}]