[{"url": "http://www.norxclaritin.com/claritin-seasonal-allergy-relief.htm", "passage_text": "CLARITIN works by blocking the histamine released by your body's immune system, thus relieving some of your seasonal allergy symptoms. Unlike all over-the-counter and some prescription antihistamines (which can make people drowsy), CLARITIN has no drowsy side effects so you feel better, not medicated. In studies, the incidence of drowsiness with CLARITIN was similar to that of a sugar pill at the recommended dose. Now available over the counter (without a prescription), CLARITIN won't cause drowsiness like over-the-counter antihistamines and some prescription antihistamines do. And, unlike many other over-the-counter antihistamines, CLARITIN offers convenient, once-a-day dosing."}, {"url": "http://www.everydayhealth.com/drugs/loratadine", "passage_text": "A: Loratadine is a non-drowsy antihistamine that reduces the natural chemical histamine in the body. Histamine can produce symptoms of sneezing, itching, watery eyes, and runny nose. Loratadine is used to treat the symptoms of allergies, such as sneezing, watery eyes, and runny nose. A: Loratadine (Claritin) is an antihistamine that can be used for the temporary relief of runny nose, sneezing, itchy eyes, watery eyes, and itching in the back of the throat due to hay fever or other upper respiratory allergies. Loratadine works by blocking histamine in the body."}, {"url": "https://answers.yahoo.com/question/index?qid=20070919152659AAaVHp4", "passage_text": "No-Claritin Loratadine is a Non-sedating antihistamine-that being said if you are especially sensitive to Loratadine or other antihistamine blockers, you can experience drowsiness. This and all medications affects individuals differently. yesiamsassy · 7 months ago. "}, {"url": "http://www.rxlist.com/claritin-side-effects-drug-center.htm", "passage_text": "Some common side effects of Claritin include headache, sleepiness, drowsiness, fatigue, nervousness, stomach pain, diarrhea, dry mouth, sore throat, hoarseness, eye redness, blurred vision, nosebleed, or rash. Less serious side effects may include: 1  headache; 2  nervousness; 3  feeling tired or drowsy; 4  stomach pain, diarrhea; 5  dry mouth, sore throat hoarseness; 6  eye redness, blurred vision; 7  nosebleed; or. 8  skin rash."}, {"url": "https://answers.yahoo.com/question/index?qid=20070611123001AAmdxuY", "passage_text": "· just now. Report Abuse. Claritin (Loratadine) is a 2nd generation anti-histamine and is, in all regards, exactly the same as benadryl. It does not, however, cross into the brain as readily and cause the sedative effects people are very familiar with in anti-histamines. That said, every person has a specific does-response relationship. "}, {"url": "http://www.rxlist.com/claritin-side-effects-drug-center.htm", "passage_text": "Claritin (loratadine) is an antihistamine medication that is used to treat allergy symptoms. Claritin is available as a generic drug, called loratadine. Claritin blocks the action of histamine, a substance in the body that initiates allergic symptoms like itching, sneezing, runny nose, and allergic skin rashes. Less serious side effects may include: 1  headache; 2  nervousness; 3  feeling tired or drowsy; 4  stomach pain, diarrhea; 5  dry mouth, sore throat hoarseness; 6  eye redness, blurred vision; 7  nosebleed; or. 8  skin rash."}, {"url": "http://patient.info/medicine/loratadine-for-allergies", "passage_text": "0. 4. Loratadine relieves allergic symptoms. Take one dose a day. Loratadine is called a non-drowsy antihistamine; however, it can still cause drowsiness in a few people. Make sure your reactions are normal before you drive, or use tools or machines. 1 Most people only need to take an antihistamine for a short while when they have symptoms. 2  You should stop taking loratadine once your symptoms have eased. 3  Although loratadine is classed as a non-drowsy antihistamine"}]