[{"url": "http://www.pbakerlaw.com/fees/", "passage_text": "Fees. All fees in Social Security and SSI disability cases are set by Congress and must be approved by the Social Security Administration as part of the process when a case is won. Fees are 25% of any back benefit you receive. As of June 2009, the fee cap/maximum is $6,000"}, {"url": "http://www.nolo.com/legal-encyclopedia/how-much-does-social-security-disability-lawyer-cost.html", "passage_text": "Most lawyers will submit the fee agreement when they take your case. Social Security has suggestions for the language in the fee agreements, but there are really only two main requirements. First, the amount of the fee cannot be more than the maximum that Social Security allows: the lesser of 25% of backpay or $6,000. For example, if your backpay award is $20,000, your attorney can collect $5,000 (25% of $20,000). Second, the agreement must be signed by the Social Security claimant and the attorney. If the claimant is a child, a parent should sign for the child. If the claimant is an adult with a guardian, the guardian should sign. Usually, copying and mailing costs in a case are not more than $100 - $200. While lawyers in Social Security disability cases cannot charge upfront fees for their time, they are allowed to charge a reasonable upfront fee to cover expected expenses in a case."}, {"url": "http://finance.zacks.com/attorney-fees-social-security-benefits-deductible-7413.html", "passage_text": "Prorating the Fee. If you are approved for Social Security disability, your attorney fees would be deductible according to the percentage of benefits that are subject to income tax. The IRS sets this percentage depending on the amount of other income that you earn and your filing status. If, for example, 80 percent of your benefits are taxable, then 80 percent of the fees charged for securing the benefits would be deductible. Note that the federal statutory maximum for attorney's fees in a disability case is $6,000 as of 2013."}, {"url": "http://www.disabilitysecrets.com/question16.html", "passage_text": "For Social Security disability lawyers, the fee is limited to 25% of the past-due benefits you are awarded, up to a maximum of $6,000. Note that the attorney will be paid only out of your past-due benefits, or backpay.. If no back-dated benefits are awarded, the attorney will not receive a fee. Share on Google Plus. Unlike many attorneys, disability lawyers do not charge up-front fees or require a retainer to work on a Social Security disability case. Most disability attorneys and advocates will be paid a fee only if they win the case (this is called a contingency fee.) Here's how it works."}, {"url": "http://www.disabilitysecrets.com/question16.html", "passage_text": "The maximum the disability attorney can charge is 25% of your backpay for his or her services, up to a maximum of $6,000. For example, if your back-dated benefits are calculated to be $10,000, your attorney will be paid $2,500 and you will receive $7,500. Share on Google Plus. Unlike many attorneys, disability lawyers do not charge up-front fees or require a retainer to work on a Social Security disability case. Most disability attorneys and advocates will be paid a fee only if they win the case (this is called a contingency fee.) Here's how it works."}, {"url": "http://www.nickortizlaw.com/frequently-asked-questions/how-much-will-a-social-security-disability-lawyer-charge-in-attorney-fees/", "passage_text": "Posted on: October 13, 2013 in. Attorneys Fees In Social Security Disability Claims. Attorneys are typically paid on one of two ways: (1) by the hour at a set hourly rate and (2) on a contingency fee basis for a percentage of the recovery in a claim. Disability lawyers are paid according to the second method. You do not usually need to pay the attorney’s fee directly out of your pocket. The SSA should withhold the entire lawyer’s fee (up to $6,000) from your first disability check (your calculated award of backpay), before Social Security sends it to you."}, {"url": "http://www.nickortizlaw.com/frequently-asked-questions/how-much-will-a-social-security-disability-lawyer-charge-in-attorney-fees/", "passage_text": "For Social Security disability lawyers, the fee is limited to 25% of the back due or “past-due” benefits you are awarded. Moreover, the maximum fee is set at $6,000. The attorney will be paid only out of your back pay, or past-due benefits. You do not usually need to pay the attorney’s fee directly out of your pocket. The SSA should withhold the entire lawyer’s fee (up to $6,000) from your first disability check (your calculated award of backpay), before Social Security sends it to you."}, {"url": "http://usadisabilitylaw.com/social-security-disability-attorney-fees-what-does-it-cost/", "passage_text": "For example, if the past due benefits are $10,000, the Social Security Disability attorney’s fee would be $2,500.00, which is 25% of $10,000. If the claimant is awarded $100,000 in past-due disability benefits, the attorney’s fee would NOT be $25,000, but would be limited to $6,000 because of the fee cap."}]