[{"url": "http://www.healthline.com/health/thyroid-function-tests", "passage_text": "The T4 test is known as the thyroxine test. The TSH test measures the level of thyroid-stimulating hormone in your blood. These are the two most common thyroid function tests and are usually ordered together. They are routinely performed on newborn babies to identify a low-functioning thyroid gland."}, {"url": "http://womenshealth.gov/publications/our-publications/fact-sheet/hashimoto-disease.html", "passage_text": "Hashimoto’s disease is an autoimmune disease that affects the thyroid. It also is called Hashimoto’s thyroiditis (theye-royd-EYET-uhss). The thyroid is a small gland in the front of the neck. The thyroid makes hormones called T3 and T4 that regulate how the body uses energy."}, {"url": "http://www.nhs.uk/Conditions/Thyroid-under-active/Pages/Diagnosis.aspx", "passage_text": "Thyroid function test. A blood test measuring your hormone levels is the only accurate way to find out whether there's a problem. The test, called a thyroid function test, looks at levels of thyroid-stimulating hormone (TSH) and thyroxine (T4) in the blood."}, {"url": "http://www.thyroid.org/thyroid-function-tests/", "passage_text": "TSH TESTS The best way to initially test thyroid function is to measure the TSH level in a blood sample. A high TSH level indicates that the thyroid gland is failing because of a problem that is directly affecting the thyroid (primary hypothyroidism)."}, {"url": "http://patient.info/health/thyroid-function-tests-leaflet", "passage_text": "Thyroid function tests are blood tests which help to check the function of the thyroid gland. They are mainly used to detect hypothyroidism (underactive thyroid) and hyperthyroidism (overactive thyroid). Note: the information below is a general guide only."}, {"url": "http://www.webmd.com/women/thyroid-hormone-tests", "passage_text": "Thyroid hormone tests are done to: 1  Find out what is causing an abnormal thyroid-stimulating hormone (TSH) test. 2  Check how well treatment of thyroid disease is working. 3  Screen newborns to find out if the thyroid gland function is normal."}, {"url": "http://www.webmd.com/women/thyroid-hormone-tests", "passage_text": "Thyroid hormone blood tests include: 1  Total thyroxine (T4). 2  Most of the thyroxine (T4) in the blood is attached to a protein called thyroxine-binding globulin. 3  Less than 1% of the T4 is unattached. 4  A total T4 blood test measures both bound and free thyroxine."}, {"url": "http://www.thyroid.org/thyroid-function-tests/", "passage_text": "The major thyroid hormone secreted by the thyroid gland is thyroxine, also called T4 because it contains four iodine atoms. To exert its effects, T4 is converted to triiodothyronine (T3) by the removal of an iodine atom."}]