[{"url": "http://www.healthcaremagic.com/search/is-vigamox-used-in-the-ear", "passage_text": "AZEE-500(1/day for 3 days) and ALERID. Ophthalmologist gave me Vigamox eye drops for Bacterial conjunctivitis and Refresh Liquigel. My question is would there be any issue if i use Vigamox eye drops and AZEE ..."}, {"url": "http://healthquestions.medhelp.org/moxifloxacin-ear-infection", "passage_text": "At around 60 days used Azithro for unrelated ear infection. At around 3 mo, found slight pain on left testicle and GP gave Levoflaxacin 750mg for 10 days, pain gone.Urine for GC is neg. At 6 mo, burning sensation on the penis head and 1/2 inch from the tip, GP thought it is UTI and gave cipro for wk."}, {"url": "https://www.nlm.nih.gov/medlineplus/druginfo/meds/a605016.html", "passage_text": "Moxifloxacin ophthalmic solution is used to treat bacterial conjunctivitis (pink eye; infection of the membrane that covers the outside of the eyeballs and the inside of the eyelids). Moxifloxacin is in a class of antibiotics called fluoroquinolones."}, {"url": "http://www.healthcaremagic.com/search/is-vigamox-used-in-the-ear", "passage_text": "Efemoline and vigamox prescribed for corneal infection. Hi, I have been taking Vigamox for 4 days for Pink eye. My eyes are still very swollen, more ... all drops were to stop so I haven t used my drop for the last 3 days."}, {"url": "http://www.everydayhealth.com/drugs/vigamox", "passage_text": "Don’t use Vigamox if you have a fungal or viral eye infection. This medicine is used only to treat bacterial infections. Before taking Vigamox, tell your doctor if you have allergies to any medicines, especially other antibiotics. Vigamox is intended for use in the eyes. Don’t swallow or inject Vigamox."}, {"url": "https://www.nlm.nih.gov/medlineplus/druginfo/meds/a605016.html", "passage_text": "If you stop using moxifloxacin eye drops too soon, your infection may not be completely cured and the bacteria may become resistant to antibiotics. When you use moxifloxacin eye drops, be careful not to let the tip of the bottle touch your eye, fingers, face, or any surface."}, {"url": "https://www.nlm.nih.gov/medlineplus/druginfo/meds/a605016.html", "passage_text": "Moxifloxacin comes as an ophthalmic solution (liquid) to instill in the eyes. It is usually used three times a day for 7 days. Try to use at around the same times every day. Follow the directions on your prescription label carefully, and ask your doctor or pharmacist to explain any part you do not understand."}]