[{"url": "http://hellobeautiful.com/2012/04/28/want-fewer-wrinkles-eat-gelatin/", "passage_text": "The reason for this is because gelatin is made up of collagen. When gelatin is ingested it goes into your bloodstream and from there to your connective tissues, including your skin. It stimulates additional collagen production, which results in a reduction of lines and wrinkles."}, {"url": "http://www.progressivehealth.com/gelatin-and-acne.htm", "passage_text": "Gelatin is derived from any animal part that contains collagen. Collagen is an essential material that is used to repair connective tissue (like nails, skin, hair, bone, and cartilage). Gelatin is the best source of collagen in a person’s diet."}, {"url": "http://www.webmd.com/vitamins-supplements/ingredientmono-1051-GELATIN.aspx?activeIngredientId=1051&activeIngredientName=GELATIN", "passage_text": "Gelatin is LIKELY SAFE for most people in food amounts and POSSIBLY SAFE in the larger amounts used as medicine. There's some evidence that gelatin in doses up to 10 grams daily can be safely used for up to 6 months."}, {"url": "http://www.webmd.com/vitamins-supplements/ingredientmono-1051-GELATIN.aspx?activeIngredientId=1051&activeIngredientName=GELATIN", "passage_text": "Gelatin is a protein made from animal products. Gelatin is used for weight loss and for treating osteoarthritis, rheumatoid arthritis, and brittle bones (osteoporosis). Some people also use it for strengthening bones, joints, and fingernails."}, {"url": "http://paleoleap.com/all-about-gelatin-and-collagen/", "passage_text": "The story of gelatin actually starts with a protein called collagen. Collagen is the most important protein in connective tissue, skin, and bones; you actually have more collagen in your body than any other type of protein. Degradation or lack of collagen can cause problems from skin wrinkles to osteoporosis."}, {"url": "http://www.progressivehealth.com/gelatin-and-acne.htm", "passage_text": "Try Eating Gelatin Gelatin has amazing healing properties for bones and skin. Gelatin contains collagen, which can fight wrinkles and make your skin smooth. However, gelatin may also have hidden acne-fighting ingredients."}, {"url": "http://www.grassfedgirl.com/top-20-health-benefits-of-gelatin-helps-prevent-arthritis-cellulite-stretch-marks-wrinkles-brittle-bones-and-more", "passage_text": "Gelatin makes up the connective tissues of the skin that are responsible for giving skin its strength and firmness. Anti-aging: Collagen depletion usually starts when we are in our late 20’s. It becomes more important to add gelatin to your diet after age 30 to help fight aging."}, {"url": "http://www.grassfedgirl.com/top-20-health-benefits-of-gelatin-helps-prevent-arthritis-cellulite-stretch-marks-wrinkles-brittle-bones-and-more", "passage_text": "Skin Health: Gelatin has amazing skin healing properties because it is a rich source of dietary collagen, which is the key protein in the body made up of amino acids. Gelatin makes up 25% to 35% of the total protein content of human body."}]