[{"url": "http://freshome.com/2011/01/17/think-green-10-best-sustainable-homes-of-2010/", "passage_text": "Freshome readers, we know how much you enjoy seeing an architecture project that has it all: creativity, efficiency and … sustainability. That is why we decided to write a post that will display the top 10 Sustainable Homes of 2010, as voted by our readers. As usual, you can click on the photos in order to see more pictures & details about each project. Collect this idea #10. By using a variety of green technology such as solar panels, vacuum insulation panels, efficient mechanical systems and natural ventilation. Collect this idea. #7. This prefab house with two floors on the Swiss countryside was built taking into account the inhabitants need for privacy and light."}, {"url": "http://www.mnn.com/your-home/remodeling-design/photos/7-affordable-green-starter-homes/welcome-home", "passage_text": "Unfortunately, many are either out of reach of most budgets or too small, quirky and/or offbeat for practical living. Good news: More builders are offering green homes that won’t send you into bankruptcy or catapult you completely out of the mainstream. The following are just some of the available choices — including prefab, modular and sustainable subdivisions — for folks who want green but don’t have a lot of it to spend. "}, {"url": "http://www.greenbuildingadvisor.com/content/do-green-houses-cost-more-build-regular-houses", "passage_text": "Green is often less expensive when all things are considered. Sustainable building often seems more expensive than conventional building. Many of the building materials that make houses more durable and easier to heat and cool aren’t cheap. Complicated systems that allow a certain amount of energy independence-- photovoltaic (PV) Generation of electricity directly from sunlight. Savings can come in other ways. Spending more money for more durable materials is cheaper in the long run because they won’t have to be replaced as often. Considering life-cycle costs, rather than focusing solely on initial costs, can yield some surprising results. Green building isn’t an all-or-nothing proposition."}, {"url": "http://www.motherearthnews.com/green-homes/green-modular-homes-zmaz09onzraw.aspx", "passage_text": "As Passive House Institute standards up the ante, USA Today’s “Best Green Homes of 2010” list reflec... In the midst of all the gloom, we’re happy to report some good news. Clayton Homes, a subsidiary of Warren Buffet’s Berkshire Hathaway, has announced its line of green modular homes. These 750-square-foot eco homes, dubbed “i-houses,” can be purchased online for less than $75,000. Clayton Homes has an attractive line of LEED-certified green modular homes that buyers can purchase"}, {"url": "http://www.cnet.com/news/photos-green-homes-on-the-cheap/#!", "passage_text": "Another recent case study is Bill Nye (the Science Guy), who opened his 1939 home to the New York Times Magazine and offered his prescription for green living with style. Discuss Photos: Green homes on the cheap. My experience with pellet stoves and energy efficiency shows that you don't need a million dollars for a green home retrofit. And if you have a bad back, don't bother. You need to lug 40-pound bags around to feed the stove as often as once a day. Efficiency. Alternative energy sources aside, efficiency is really the name of the game in the home."}, {"url": "http://freshome.com/2011/01/17/think-green-10-best-sustainable-homes-of-2010/", "passage_text": "#5. “Home for Life” is a sustainable residential project coming from Danish architects AART. Located near Aarhus in Denmark, this building is an “Active House”, making a statement in the field of architecture by emphasizing on low energy consumption and a “low-carbon future”. By using a variety of green technology such as solar panels, vacuum insulation panels, efficient mechanical systems and natural ventilation. Collect this idea. #7. This prefab house with two floors on the Swiss countryside was built taking into account the inhabitants need for privacy and light."}, {"url": "http://www.cnet.com/news/photos-green-homes-on-the-cheap/#!", "passage_text": "Click on this image for a photo gallery of assorted green home retrofits, including a pellet stove. Martin LaMonica/CNET Networks. For all the rest of us, I've assembled a photo gallery on ways to green your lifestyle using some examples from my home. For a very thorough run-down of resources, check out  How to green your life  from CNET's Elsa Wenzel. And if you have a bad back, don't bother. You need to lug 40-pound bags around to feed the stove as often as once a day. Efficiency. Alternative energy sources aside, efficiency is really the name of the game in the home."}, {"url": "http://www.popularmechanics.com/home/how-to/g460/small-green-homes/", "passage_text": "The new book Small Eco Houses (Universe, $35) by Cristina Paredes Benitez and Alex Sanchez Vidiella is a wonderful survey of beautiful small homes that are packed with sustainable features, from use of recycled and local materials to natural lighting and landscaping. "}, {"url": "http://www.greenpoddevelopment.com/", "passage_text": "HEALTHY SUSTAINABLE SEATTLE MODULAR HOMES. Woman-owned GreenPod Development, LLC creates green-jobs by building new Seattle modular homes with healthy interiors and furnishings. GreenPod assures basic human needs: clean water, clean air, natural light, temperature-controlled, efficiently-designed homes in a beautiful environment. "}]