[{"url": "http://www.answers.com/Q/What_kind_of_person_is_Iago_from_Othello", "passage_text": "When Othello is overcome with grief after hearing rumours of his wife, Desdemona, committing adultery, Iago tells him to seek revenge. Othello is convinced that she has hurt h … is honour and his good name therefore following Iago's advice. 5: Iago is secretly in love with Desdemona and resents the fact that she seems to like both Othello and Cassio better than him. 6: Iago is secretly in love with Othello, and resents the fact that he seems to love both Cassio and Desdemona"}, {"url": "http://www.answers.com/Q/What_kind_of_person_is_Iago_from_Othello", "passage_text": "Of course Iago is a villain, a malcontent-to be more specific. He schemes ever since the beginning of the play to bring down Othello arguably for no real reason at all. Iago … is abusive to all that know him, including desdemona, Roderigo, Cassio, and his wife Emelia. 5: Iago is secretly in love with Desdemona and resents the fact that she seems to like both Othello and Cassio better than him. 6: Iago is secretly in love with Othello, and resents the fact that he seems to love both Cassio and Desdemona"}, {"url": "http://www.shmoop.com/othello/iago.html", "passage_text": "Later, he claims to suspect that Othello is having an affair with his (Iago's) wife (Emilia): IAGO I hate the Moor, And it is thought abroad, that 'twixt my sheets'Has done my office. I know not if 't be true, But I, for mere suspicion in that kind, Will do as if for surety. Poet Samuel Taylor Coleridge calls Iago a being next to the devil, only not quite the devil and goes on to call Iago's behavior motiveless malignity.. If we agree that Iago has no real motives for hurting Othello, we could also argue that Iago's character is a kind of Vice figure."}, {"url": "http://shakespeare.about.com/od/Othello/a/Iago-Analysis.htm", "passage_text": "Iago analysis is central to understanding Shakespeare's Othello because he holds the longest part in the play: 1,070 lines. Iago’s character is consumed with hatred and jealousy. "}, {"url": "http://www.enotes.com/homework-help/what-sort-person-cassio-act-ii-what-happens-him-241799", "passage_text": "(Answer #1). One of the interesting things about the character of Cassio is that Shakespeare reveals it to us through the way others see him, almost as if he is just a reflection of what people want him to be. Iago's impression of him is the first one we get, but Iago sees him through eyes clouded by jealousy. "}, {"url": "http://www.answers.com/Q/What_kind_of_person_is_Iago_from_Othello", "passage_text": "In the original play of Othello by William Shakespeare, Iago does not die. He is arrested and his fate gets to be decided by Cassio, who is promoted to the position of governo … r of Cyprus. In the 1995 movie version of Othello, however, Iago kills himself. 5: Iago is secretly in love with Desdemona and resents the fact that she seems to like both Othello and Cassio better than him. 6: Iago is secretly in love with Othello, and resents the fact that he seems to love both Cassio and Desdemona"}, {"url": "http://study.com/academy/lesson/iago-from-othello-character-analysis-lesson-quiz.html", "passage_text": "Iago is the antagonist in the play 'Othello' by William Shakespeare. His jealousy and envy causes him to destroy the lives of his boss Othello and his boss's wife, Desdemona. Learn more about Iago's character and test your knowledge with a quiz. Character Analysis. Iago explains that he wants to destroy Othello because he has been passed over for promotion to lieutenant; however, he offers other motives for his hatred of Othello throughout the course of the play. He mentions he believes Othello is having an affair with his wife, Emilia"}, {"url": "https://en.wikipedia.org/wiki/Othello", "passage_text": "Iago plants it in Cassio's lodgings as evidence of Cassio and Desdemona's affair. After he has planted the handkerchief, Iago tells Othello to stand apart and watch Cassio's reactions while Iago questions him about the handkerchief. Iago hates Othello for promoting a younger man named Michael Cassio above him, and tells Roderigo that he plans to use Othello for his own advantage. Iago is also angry because he believes, or at least gives the pretence of belief, that Othello slept with his wife Emilia."}, {"url": "http://www.imdb.com/character/ch0014052/bio", "passage_text": "Warning! Visit our Character Biography Help to learn more. Iago is one of Shakespeare's most sinister villains, often considered such because of the unique trust that Othello places in him, which he betrays while maintaining his reputation of honesty and dedication. Shakespeare contrasts Iago with Othello's nobility and integrity. Iago fits into the malcontent character type because of his bitter and cynical view of the world around him. Iago is General Othello's most trusted advisor. At the beginning of the play, Iago claims to have been unfairly passed over for promotion to the rank of Othello's lieutenant in favour of Michael Cassio."}]