[{"url": "https://en.wikipedia.org/wiki/Metallic_bond", "passage_text": "Metallic bonding is not the only type of chemical bonding a metal can exhibit, even as a pure substance. For example, elemental gallium consists of covalently-bound pairs of atoms in both liquid and solid state—these pairs form a crystal lattice with metallic bonding between them. In a more quantum-mechanical view, the conduction electrons divide their density equally over all atoms that function as neutral (non-charged) entities. Metallic bonding accounts for many physical properties of metals, such as strength, ductility, thermal and electrical resistivity and conductivity, opacity, and luster."}, {"url": "https://en.wikipedia.org/wiki/Metallic_bond", "passage_text": "(Redirected from Metallic bond). Metallic bonding occurs as a result of electromagnetism and describes the electrostatic attractive force that occurs between conduction electrons (in the form of an electron cloud of delocalized electrons) and positively charged metal ions. In a more quantum-mechanical view, the conduction electrons divide their density equally over all atoms that function as neutral (non-charged) entities. Metallic bonding accounts for many physical properties of metals, such as strength, ductility, thermal and electrical resistivity and conductivity, opacity, and luster."}, {"url": "http://www.ausetute.com.au/metallic.html", "passage_text": "1 Metallic bonding refers to the interaction between the delocalised electrons and the metal nuclei. 2  The physical properties of metals are the result of the delocalisation of the electrons involved in metallic bonding. 3  The physical properties of solid metals are: The strength of the metallic bond depends on the. 1  number of electrons in the delocalised 'sea' of electrons. ( 2 More delocalised electrons results in a stronger bond and a higher melting point.). 3  packing arrangement of the metal atoms."}, {"url": "http://www.ausetute.com.au/metallic.html", "passage_text": "Key Concepts. 1  A metal is a lattice of positive metal 'ions' in a 'sea' of delocalised electrons. 2  Metallic bonding refers to the interaction between the delocalised electrons and the metal nuclei. 3  The physical properties of metals are the result of the delocalisation of the electrons involved in metallic bonding. The strength of the metallic bond depends on the. 1  number of electrons in the delocalised 'sea' of electrons. ( 2 More delocalised electrons results in a stronger bond and a higher melting point.). 3  packing arrangement of the metal atoms."}, {"url": "http://www.ausetute.com.au/metallic.html", "passage_text": "1 A metal is a lattice of positive metal 'ions' in a 'sea' of delocalised electrons. 2  Metallic bonding refers to the interaction between the delocalised electrons and the metal nuclei. 3  The physical properties of metals are the result of the delocalisation of the electrons involved in metallic bonding. The strength of the metallic bond depends on the. 1  number of electrons in the delocalised 'sea' of electrons. ( 2 More delocalised electrons results in a stronger bond and a higher melting point.). 3  packing arrangement of the metal atoms."}, {"url": "http://www.bbc.co.uk/schools/gcsebitesize/science/add_aqa_pre_2011/atomic/differentsubrev5.shtml", "passage_text": "] are free to move. The metallic bond is the force of attraction between these free electrons and metal ions [ions: Electrically charged particles, formed when an atom or molecule gains or loses electrons. ] . Metallic bonds are strong, so metals can maintain a regular structure and usually have high melting and boiling points"}, {"url": "http://www.docbrown.info/page04/4_72bond5.htm", "passage_text": "There is a strong electrical force of attraction between these free electrons (mobile electrons or 'sea' of delocalised electrons) () and the 'immobile' positive metal ions (+) that form the giant lattice and this is the metallic bond. The reason for this is the mobility of the electrons involved in the metallic bonding. When planes of metal atoms are 'bent' or slide the electrons can run in between the atoms and maintain a strong bonding situation."}, {"url": "http://study.com/academy/lesson/what-is-a-metallic-bond-definition-properties-examples.html", "passage_text": "The metallic bond is a unique type of chemical bond found in metal elements. In a sample of metal, the valence electrons detach from the atoms and are free to move throughout the metal. This results in a sea of electrons, or big pool of delocalized or valence electrons. The sea of electrons is negative and the metal atoms have become positive ions. The attraction between the two parts of the metal is the metallic bond. This special type of bond gives metals unique properties."}, {"url": "https://answers.yahoo.com/question/index?qid=20100112145554AAXS9pV", "passage_text": "Best Answer: A metallic bond is the electrostatic force of attraction between metal ions and delocalised electrons in a metal lattice In a solid metal the atoms are closely packed together and the electrons in the highest occupied energy level of an atom overlap with those of another atom. not associated to one particular atom and they are free to move through the structure) and the metal atoms become positive ions. Metallic bonds are therefore formed as the positively charged metal ions are attracted to the negatively charged delocalised electrons."}]