[{"url": "http://content.time.com/time/specials/packages/article/0,28804,1903155_1903156_1903152,00.html", "passage_text": "CEO: Tyco International Ltd. Convicted: 06/17/2005 of misappropriation of corporate funds. In a 60 Minutes interview defending his innocence, former Tyco CEO Dennis Kozlowski maintained that nothing was hidden.. That's for sure. Innocent or guilty, Kozlowski clearly wasn't modest, living a life of opulent luxury"}, {"url": "http://www.nytimes.com/2015/03/02/business/dealbook/dennis-kozlowskis-path-from-infamy-to-obscurity.html", "passage_text": "Ten years and a lifetime ago, Mr. Kozlowski reigned as the archetype of avarice. This helped lead to his conviction in 2005 for looting nearly $100 million from Tyco, for which he served six and a half years in prison. That showy shower curtain was in his corporate residence on Fifth Avenue — paid for with Tyco funds — and came to symbolize a life of unabashed excess."}, {"url": "http://www.nydailynews.com/news/crime/staying-put-disgraced-ex-tyco-ceo-dennis-kozlowski-denied-early-bail-hearing-article-1.1388227", "passage_text": "Former Tyco CEO, Dennis Kozlowski, was denied an early bail hearing Tuesday. Tyco's former CEO Dennis Kozlowski lost his bid Tuesday for a new parole hearing to be put on the fast track when the Appellate Division overturned a lower court ruling on the matter. He will continue serving his sentence at a halfway house in upper Manhattan until at least January. Tyco's former CEO Dennis Kozlowski lost his bid Tuesday for a new parole hearing to be put on the fast track when the Appellate Division overturned a lower court ruling on the matter."}, {"url": "http://money.cnn.com/2005/06/17/news/newsmakers/tyco_trialoutcome/index.htm", "passage_text": "NEW YORK (CNN/Money) - In a major victory in the government crackdown on corporate corruption, former Tyco CEO Dennis Kozlowski and ex-CFO Mark Swartz were found guilty Friday of stealing hundreds of millions of dollars from the manufacturing conglomerate. Swartz' wife appeared to be in shock and Kozlowski's wife was crying. The Tyco verdict comes as jury deliberations continue in Alabama, where former HealthSouth CEO Richard Scrushy is accused of directing a $2.7 billion accounting fraud."}, {"url": "http://money.cnn.com/2005/09/19/news/newsmakers/kozlowski_sentence/", "passage_text": "NEW YORK (CNN/Money) - Ex-Tyco CEO Dennis Kozlowski received 8-1/3 to 25 years in prison Monday for his part in stealing hundreds of millions of dollars from the manufacturing conglomerate. Former Tyco CFO Mark Swartz got the same sentence from Manhattan Supreme Court Judge Michael Obus. "}, {"url": "http://www.vanityfair.com/news/2015/03/dennis-kozlowski-life-after-prison", "passage_text": "WhatsApp. In 2002, it was revealed that former Tyco chief executive Dennis Kozlowski had used company funds to purchase a $16.8 million Fifth Avenue apartment for himself, and a $7 million pad on Park Avenue for his ex-wife. Kozlowski’s extravagance earned him infamy. In the intervening years, he served a six and a half year prison sentence on charges related to the misuse of Tyco’s funds. Kozlowski now lives in a two-bedroom apartment with his third wife, Kimberly, whom he met while he was serving time at New York's Mid-State Correctional Facility."}, {"url": "http://www.businessinsider.com/dennis-kozlowski-is-getting-out-of-prison-2014-1", "passage_text": "Reuters/Chip East Former Tyco International Ltd. Chairman Dennis Kozlowski arrives with his wife Karen at New York Supreme court March 30, 2004. After spending more than eight years as an inmate in the New York State prison system, former Tyco International CEO Dennis Kozlowski was granted parole in December 2013."}, {"url": "https://en.wikipedia.org/wiki/Dennis_Kozlowski", "passage_text": "Kozlowski was convicted on June 17, 2005 of crimes related to his receipt of $81 million in purportedly unauthorized bonuses, the purchase of art for $14.725 million and the payment by Tyco of a $20 million investment banking fee to Frank Walsh, a former Tyco director. Kozlowski is a graduate of Seton Hall University, served as Head of the Board at Berwick Academy in South Berwick, ME for many years, and served on the Middlebury College Board of Trustees in the 1990s."}]