[{"url": "http://www.foodnetwork.com/recipes/alton-brown/baked-meatballs-recipe.html", "passage_text": "Place the remaining 1/4 cup of bread crumbs into a small bowl. Using a scale, weigh meatballs into 1.5-ounce portions and place on a sheet pan. Using your hands, shape the meatballs into rounds, roll in the bread crumbs and place the meatballs in individual, miniature muffin tin cups. In a large mixing bowl, combine the pork, lamb, ground round, spinach, cheese, egg, basil, parsley, garlic powder, salt, red pepper flakes, and 1/4 cup of the bread crumbs. Using your hands, mix all ingredients until well incorporated. Use immediately or place in refrigerator for up to 24 hours."}, {"url": "http://www.answers.com/Q/How_long_do_you_cook_meatballs_and_at_what_temperature", "passage_text": "Confidence votes 156. Bake at 350 degrees until cooked through, between 15 and 35 minutes, depending on the size of the meatball and your particular oven. The surest method is to use a meat thermometer, with the internal temperature being at least 165 degrees Fahrenheit. You can fry them, bake them, or simmer them. When you mix the ground meat, seasonings, egg, and bread crumbs, form your meatballs. Brown them in a skillet turning on all sides until the are browned on all sides and break one open to make sure they are cooked through. If you bake them, put them on a cooking sheet and bake at 350 for about 20 minutes"}, {"url": "http://www.foodnetwork.com/recipes/alton-brown/baked-meatballs-recipe.html", "passage_text": "Directions. Preheat the oven to 400 degrees F. In a large mixing bowl, combine the pork, lamb, ground round, spinach, cheese, egg, basil, parsley, garlic powder, salt, red pepper flakes, and 1/4 cup of the bread crumbs. Using your hands, mix all ingredients until well incorporated. Use immediately or place in refrigerator for up to 24 hours."}, {"url": "http://www.wikihow.com/Bake-Italian-Meatballs", "passage_text": "7. Bake the meatballs. Put the baking sheet with the meatballs in the oven for 20- 30 minutes. Cook them until the meatballs are brown and lightly crisped all over. Tips. 1  You can cook meatballs in a skillet if you don't want to wait for the oven to heat up. 2  Add some ingredients-try red peppers or chopped jalapenos. 3  This recipe can also be made with ground turkey instead of ground beef. 4  Use a melon baller or small ice cream scoop for uniformly sized"}, {"url": "http://www.wikihow.com/Bake-Italian-Meatballs", "passage_text": "Add the remaining ingredients to the breadcrumb mixture. Mix the breadcrumbs, onion, garlic, meat, salt, pepper, oregano or Italian seasoning, cheese, and egg together in a casserole dish or another type of deep pan and stir thoroughly. 5. Make the meatball form. Roll the mixture into meatballs that are about 1.5 inches (3.8 cm) thick. They should fit nicely in the palm of your hand, so you can use your hands to make the ball shape by rolling the mixture between your two palms. Tips. 1  You can cook meatballs in a skillet if you don't want to wait for the oven to heat up. 2  Add some ingredients-try red peppers or chopped jalapenos. 3  This recipe can also be made with ground turkey instead of ground beef. 4  Use a melon baller or small ice cream scoop for uniformly sized meatballs."}, {"url": "http://www.epicurious.com/recipes/member/views/extra-large-homemade-meatballs-w-pasta-51123791", "passage_text": "1 Place the meatballs on the baking sheet or foil, spacing them 1 inch apart. 2  Bake until they are cooked through, about 25 minutes. . 3  While the meatballs are cooking, bring a large pot of water to a boil with salt for the spaghetti and warm the spaghetti sauce in a saucepan over medium-low heat. 1 Bake until they are cooked through, about 25 minutes. . 2  While the meatballs are cooking, bring a large pot of water to a boil with salt for the spaghetti and warm the spaghetti sauce in a saucepan over medium-low heat. 3  Add extra seasoning like Italian, parsley, oregano, and basil."}, {"url": "http://hilahcooking.com/baked-turkey-meatballs/", "passage_text": "Baked turkey meatballs are a neat and tidy way to make very lean meatballs, too! I use lean turkey breast, and add grated carrots and an egg to bind them and add moisture so they don’t dry out. Bake for 15 minutes while you get everything else ready for dinner, and literally you have dinner in under 30 minutes. "}, {"url": "https://answers.yahoo.com/question/index?qid=20071024122522AAonPSY", "passage_text": "Asker's rating. Report Abuse. ***I have always baked my 1 1/2 inch meatballs at 350 degrees for approximately 25 minutes, I sacrifice the middle ones to make sure it's not pink in the middle, I make 90 at a time and freeze them in batches of 6. This way they're ready for meatball sandwiches on homemade pizza, and in Lasagna. "}]