[{"url": "https://en.wikipedia.org/wiki/Daktronics", "passage_text": "Daktronics is an American company based in Brookings, South Dakota that designs, manufactures, sells, and services video displays, scoreboards, digital billboards, dynamic message signs, sound systems, and related products. In August 2007, Daktronics announced that four floors of the company's video boards and one monochrome digital display will wrap the corner of the historic crossroads of Broad and High in downtown Columbus, Ohio. Jordan-Hare Stadium at Auburn University-Auburn, Alabama, USA (2007)."}, {"url": "https://en.wikipedia.org/wiki/Daktronics", "passage_text": "Daktronics was founded in 1968 by Aelred Kurtenbach and Duane Sander, professors of electrical engineering at South Dakota State University in Brookings, SD. The company began with the design and manufacture of electronic voting systems for state legislatures. In August 2007, Daktronics announced that four floors of the company's video boards and one monochrome digital display will wrap the corner of the historic crossroads of Broad and High in downtown Columbus, Ohio. Jordan-Hare Stadium at Auburn University-Auburn, Alabama, USA (2007)."}, {"url": "http://www.daktronics.com/", "passage_text": "Experience the Daktronics Difference. From your local high school scoreboard to video systems in major league stadiums, and roadside LED signs to iconic digital signage in Times Square, Piccadilly Circus and around the world, there's a good chance you see our products every day. The end result is a high-performing display that excels in even the most adverse conditions. Committed to customer service.Service and parts, when you need it and how you need it. Our trained technicians, located around the world, provide service to meet your standards of excellence."}, {"url": "https://github.com/xyk2/daktronics", "passage_text": "A python-based and AVR serial data decoder for the Daktronics omnisport 2000 timing console. The console has an RTD port used normally for Venus scoreboards. It is a simple 19200 baud 8N1 serial signal, and carries the running time, splits, and swimmer names. Decoded data is fed into Autobahn with python and then to the browser for graphic rendering. The decoder can be put into test mode by resetting with the split button set to the OFF position. This mode ignores data from the console and simulates a test race, which is useful for testing the rendering engine."}, {"url": "http://www.facebook.com/Daktronics", "passage_text": "BROOKINGS, S.D. – Oct. 14, 2015 – North Carolina Central University (NCCU) turned to Daktronics (NASDAQ-DAKT) of Brookings, South Dakota, for new LED video display technology at McDougald-McLendon Arena on campus in Durham, North Carolina. From our newly released Galaxy eCCB and Galaxy GS6 LED displays and Venus Control Suite software to our reliable digit displays that integrate with many popular POS systems, we’re excited to give everyone at the NACS Show a taste of what’s new at Daktronics."}, {"url": "https://en.wikipedia.org/wiki/Daktronics", "passage_text": "Daktronics currently has its headquarters in Brookings, SD, with other facilities in Sioux Falls, SD, Redwood Falls, MN, Shanghai, China, and Belgium, along with more than 50 regional offices around the world. In August 2007, Daktronics announced that four floors of the company's video boards and one monochrome digital display will wrap the corner of the historic crossroads of Broad and High in downtown Columbus, Ohio. Jordan-Hare Stadium at Auburn University-Auburn, Alabama, USA (2007)."}, {"url": "https://en.wikipedia.org/wiki/Daktronics", "passage_text": "Daktronics' LED technology is on the exterior of the Grand Lisboa hotel. Sun Life Stadium-Miami Gardens, Florida, USA (2006). Two high-definition video displays were installed. The east end zone display was the largest HD LED display in the world at the time of installation. In August 2007, Daktronics announced that four floors of the company's video boards and one monochrome digital display will wrap the corner of the historic crossroads of Broad and High in downtown Columbus, Ohio. Jordan-Hare Stadium at Auburn University-Auburn, Alabama, USA (2007)."}, {"url": "http://www.facebook.com/Daktronics", "passage_text": "BROOKINGS, S.D. – October 6, 2015 – Daktronics Inc. (NASDAQ-DAKT) of Brookings, S.D. announces a $3.2 million order for Metropolitan Transportation Authority (MTA) New York City Transit, provider of mass transit services in New York City. From our newly released Galaxy eCCB and Galaxy GS6 LED displays and Venus Control Suite software to our reliable digit displays that integrate with many popular POS systems, we’re excited to give everyone at the NACS Show a taste of what’s new at Daktronics."}]