[{"url": "http://www.simplyrecipes.com/recipes/indian_style_rice/", "passage_text": "Drain. 2 Bring 8 cups of water and the salt to a boil in a large pot. Add the rice and stir. Add the cloves, cardamom and cinnamon and simmer for 10 minutes. Taste the rice, and test if it is done to your taste; rice can take more or less time to cook depending on how old it is. If still too firm, cook a few minutes longer. "}, {"url": "https://en.wikipedia.org/wiki/Rice_production_in_India", "passage_text": "The India's rice production reached to a record high of 104.32 million tonnes in 2011-2012 crop year(July–June. Rice is one of the chief grains of India. Moreover, this country has the largest area under rice cultivation, as it is one of the principal food crops. It is in fact the dominant crop of the country. In India, it is grown in winter. It needs temperature 10 degree C to 15 degree C for its cultivation. It thrives well in an average temperature of 16-degree C. Warm and sunny weather is essential at the time of ripening. Wheat requires a rainfall of 50 cm to 100 cm during the growing season."}, {"url": "http://agropedia.iitk.ac.in/content/climatic-requirements-rice", "passage_text": "Climatic requirements. In India, rice is grown under widely varying conditions of altitude and climate. Rice cultivation in India extends from 8 to 35 0 N altitude and from sea level to as high as 3000 meters. Rice crop needs a hot and humid climate. It is best suited o regions which have high humidity, prolonged sunshine and an assured supply of water."}, {"url": "https://en.wikipedia.org/wiki/Rice_production_in_India", "passage_text": "Rice is India's pre-eminent crop, and is the staple food of the people of the eastern and southern parts of the country. Production increased from 53.6 million tons in FY 1980 to 74.6 million tons in year 1990, a 39 percent increase over the decade. In India, it is grown in winter. It needs temperature 10 degree C to 15 degree C for its cultivation. It thrives well in an average temperature of 16-degree C. Warm and sunny weather is essential at the time of ripening. Wheat requires a rainfall of 50 cm to 100 cm during the growing season."}, {"url": "http://www.thekitchn.com/how-to-cook-rice-on-the-stove-44333", "passage_text": "1 Measure the rice and water: For most rice, use a 1:2 ratio of one cup of rice to two cups of water. 2  Measure a half cup of uncooked rice per person and scale this ratio up or down depending on how much you're making. Start with just making rice on the stovetop, and upgrade from there. For most rice, use a 1:2 ratio of one cup of rice to two cups of water."}, {"url": "http://irri.org/news/hot-topics/rice-and-climate-change", "passage_text": "The International Food Policy Research Institute (IFPRI) report Climate Change: Impact on Agriculture and Costs of Adaptation forecasts that by 2050 rice prices will increase between 32 and 37% as a result of climate change. They also show that yield losses in rice could be between 10 and 15%. "}, {"url": "http://www.aroma-housewares.com/kitchen/appliances/faq/Rice%20Cookers.html?answer=1", "passage_text": "A: Not only does it cook rice perfectly every time, but a rice cooker will keep rice warm and delicious for several hours after cooking. The rice cooker also makes a perfect vegetable steamer, and can be used to prepare a variety of delicious, healthful one-dish meals that can be served directly from the cooker. A: Generally white rice takes around 10 minutes per uncooked cup of rice to cook in both cool touch and Pot Style rice Cookers. Brown rice will take around 20 minutes per uncooked cup of rice to cook in Pot Style Rice Cookers and 2 hours to cook in Cool Touch Rice Cookers due to the extra bran layers on the grain."}, {"url": "http://www.fao.org/fileadmin/templates/agphome/documents/Rice/rice_fact_sheet.pdf", "passage_text": "Rice production in India under the current and future climate. Pp. 165-181 in Mathews, RB., Kroff, M.J., Bachelet, D. & van Laar, H.H. (eds) Modeling the impact of climate change on rice production in Asia. When measured against the total greenhouse gas emissions of a country, the amount of methane emitted from rice fields ranges from only 0.1% as in USA in 2005 to about 9.8% as in India in 2006 (Table 1).The burning of rice residues such as straw and husks also contributes to greenhouse gas emission."}, {"url": "http://agropedia.iitk.ac.in/content/climatic-requirements-rice", "passage_text": "Climatic requirements In India, rice is grown under widely varying conditions of altitude and climate. Rice cultivation in India extends from 8 to 350N altitude and from sea level to as high as 3000 meters. Rice crop needs a hot and humid climate. Rice cultivation in India extends from 8 to 35 0 N altitude and from sea level to as high as 3000 meters. Rice crop needs a hot and humid climate. It is best suited o regions which have high humidity, prolonged sunshine and an assured supply of water."}]