[{"url": "http://www.theatlantic.com/photo/2011/06/world-war-ii-the-invasion-of-poland-and-the-winter-war/100094/", "passage_text": "Alan Taylor. In August of 1939, Nazi Germany and the Soviet Union signed a non-aggression treaty. One week later, Germany invaded Poland and World War II began. The first attack of the war took place on September 1, 1939, as German aircraft bombarded the Polish town of Wielun, killing nearly 1,200."}, {"url": "http://www.answers.com/Q/When_did_Germany_invade_Poland_and_start_world_war_1", "passage_text": "Germany Invaded the first half of Poland at September 1939, the other half was invaded by the soviet union. But in June 1941 it Invaded t … he second half when it Invaded the soviet union. Poland was freed at from the Nazi occupation at January 1945."}, {"url": "http://www.ducksters.com/history/world_war_ii/ww2_in_europe.php", "passage_text": "World War II in Europe began when Hitler's Nazi Germany attacked Poland. Germany had allies such as Italy, Hungary, Bulgaria, and Romania. These European countries were part of the Axis Powers. The countries that fought against Germany and the Axis Powers in Europe were called the Allied Powers."}, {"url": "http://www.history.com/this-day-in-history/germany-invades-poland", "passage_text": "On this day in 1939, German forces bombard Poland on land and from the air, as Adolf Hitler seeks to regain lost territory and ultimately rule Poland. World War II had begun. The German invasion of Poland was a primer on how Hitler intended to wage war–what would become the “blitzkrieg” strategy."}, {"url": "http://learning.blogs.nytimes.com/2011/09/01/sept-1-1939-nazi-germany-invades-poland-startingworld-war-ii/comment-page-1/", "passage_text": "On Sept. 1, 1939, Nazi Germany invaded Poland, the act that started World War II. The day before, Nazi operatives had posed as Polish military officers to stage an attack on the radio station in the Silesian city of Gleiwitz. Germany used the event as the pretext for its invasion of Poland."}, {"url": "https://uk.answers.yahoo.com/question/index?qid=20090219041803AAEC83W", "passage_text": "The Invasion of Poland in 1939 precipitated World War II. It was carried out by Nazi Germany, the Soviet Union, and a small German-allied Slovak contingent. In Poland the invasion is also known as the September Campaign (Kampania wrześniowa) or the 1939 Defensive War (Wojna obronna 1939 roku)."}, {"url": "https://en.wikipedia.org/wiki/Invasion_of_Poland", "passage_text": "The invasion of Poland led Britain and France to declare war on Germany on 3 September. However, they did little to affect the outcome of the September Campaign. No declaration of war was issued by Britain and France against the Soviet Union."}, {"url": "http://www.vox.com/2014/9/1/6084029/hitlers-invasion-of-poland-explained", "passage_text": "On September 1, 1939, the German army under Adolf Hitler launched an invasion of Poland that triggered the start of World War II (though by 1939 Japan and China were already at war)."}]