[{"url": "https://uk.answers.yahoo.com/question/index?qid=20080122082141AA9zqgj", "passage_text": "Report Abuse. The average annual milage on a car should be 12,000 miles per year,so for example: if the car is 4 years old then the milage should be around 48,000 miles.On engines now a days,a good service history is more important to how many miles the car has done. Source(s): car mechanic for 5 years. Little Big Boy · 8 years ago."}, {"url": "http://www.answers.com/Q/What_is_the_average_annual_car_mileage", "passage_text": "What is the average mileage per car per year? The mileage of a car per year depends on how much you drive it. If you're a commuter that drives 45 minutes to get to work every day, you're going to rack up more miles than a … guy who drives his kids 30 seconds to school. This is based on a total annual miles traveled (3,049,0 … 47 million) divided by the total number of vehicle registrations (247 million). This data from 2007 but statistics like this are often a few years in arrears."}, {"url": "http://www.answers.com/Q/What_is_the_average_annual_car_mileage", "passage_text": "According to the US DOT Federal Highway Administration, the average annual miles per vehicle is 12,334 per year. This is based on a total annual miles traveled (3,049,047 million) divided by the total number of vehicle registrations (247 million). This is based on a total annual miles traveled (3,049,0 … 47 million) divided by the total number of vehicle registrations (247 million). This data from 2007 but statistics like this are often a few years in arrears."}, {"url": "https://answers.yahoo.com/question/index?qid=20060928063416AAH41QT", "passage_text": "· just now. Report Abuse. For that year, 4 years old, I would not buy a secondhand car with more than 50,000 miles on the clock. If you have no reason to believe that it has been 'clocked' (mileage reduced) and there is between 25,000 and 30,000 miles, you will be doing well"}, {"url": "http://www.answers.com/Q/What_is_the_average_gas_mileage_of_the_average_car", "passage_text": "According to the US DOT Federal Highway Administration, the average annual miles per vehicle is 12,334 per year. This is based on a total annual miles traveled (3,049,047 mill … ion) divided by the total number of vehicle registrations (247 million). What is the average gas mileage for a jeep cj7? With proper gear ratios and maintenance you should get around 17 MPG with the 258 cid and about 12 MPG with a 304 cid."}, {"url": "http://business.time.com/2012/03/20/what-you-only-have-100k-miles-on-your-car-thats-nothing/", "passage_text": "Now, the New York Times offers the viewpoint that, in terms of cars and mileage, 200,000 is the new 100,000. Two numbers make it apparent that 100K is no big thing anymore: The average car on the road is about 11 years old, and the average car is driven about 15,000 miles per year. Multiply those figures together and you’ve got a fairly average car with something like 165,000 miles on it. (MORE: Drivers Upgrading to New Cars at Slowest Pace in Years). Automakers may be frustrated that drivers are upgrading to new cars at the slowest pace in years. Now, though, when the average car on the road is over 11 years old, any car that can’t reach 100K is pretty much considered a lemon. Fashion writers might declare blue the new black."}, {"url": "http://answers.edmunds.com/question-What-considered-normal-mileage-car-year-TMV-68972.aspx", "passage_text": "The TMV Used Vehicle Appraiser adds or deducts the appropriate amount if the vehicle's mileage is below or above the normal range for a vehicle of that age. Keep in mind that cars typically have accumulated about 12,000 to 15,000 miles per year. Anything over this mileage reduces the value of the car; anything less increases the car's value. How to Get a Used Car Bargain. For calculating True Cost to Own, Edmunds uses 15,000 miles a year as the baseline. So, I think it's safe to say that normal annual miles is between 12,000 and 15,000 miles a year. I don't have access to the proprietary formula to peg it any closer than that."}, {"url": "http://www.answers.com/Q/What_is_the_average_annual_car_mileage", "passage_text": "According to the  US DOT Federal Highway Administration, the average annual miles per vehicle is 12,334 per year. This is based on a total annual miles traveled (3,049,0 … 47 million) divided by the total number of vehicle registrations (247 million). This data from 2007 but statistics like this are often a few years in arrears.   http://www.fhwa.dot.gov/policyinformation/statistics/2007/vm2.cfm   http://www.fhwa.dot ..."}, {"url": "http://www.answers.com/Q/What_is_the_average_gas_mileage_of_the_average_car", "passage_text": "What is the average gas mileage on the Toyota solara? for a 2001 SE 2.2L 4cyl it has been about 28-29 mpg in all around in real world driving. on the interstate I see 30-32 With my '04 V-6 convertible I consistently see 27-28 m … pg during my 80 mile (round trip) daily commute between home and work. What is the average gas mileage for a jeep cj7? With proper gear ratios and maintenance you should get around 17 MPG with the 258 cid and about 12 MPG with a 304 cid."}]