[{"url": "http://colleges.usnews.rankingsandreviews.com/best-colleges/university-of-central-oklahoma-3152", "passage_text": "It utilizes a semester-based academic calendar. University of Central Oklahoma's ranking in the 2016 edition of Best Colleges is Regional Universities (West), 81. Its in-state tuition and fees are $5,437 (2014-15); out-of-state tuition and fees are $13,552 (2014-15)."}, {"url": "http://colleges.startclass.com/l/3434/University-of-Central-Oklahoma", "passage_text": "Out-of-State : $13,551. University of Central Oklahoma's in-state tuition is more expensive than the average public 4 year college in Oklahoma's in-state tuition ($5,421), but it is cheaper than the average college in Oklahoma's in-state tuition ($10,391). Out of 15,358 total undergraduates enrolled in University of Central Oklahoma, 50% of students received federal grant aid and 43% of students took federal student loan. 1  Grant Aid: 7,616 total undergraduates received on average $5,199 in grant aid."}, {"url": "http://www.collegecalc.org/colleges/oklahoma/oklahoma-city-university/", "passage_text": "Tuition for Oklahoma City University is $27,276 for the 2014/2015 academic year. This is 8% more expensive than the national average private non-profit four year college tuition of $25,224. The cost is $15,811 and 138% more expensive than the average Oklahoma tuition of $11,465 for 4 year colleges. Annual Total Cost. The annual total list price cost to go to Oklahoma City University was $41,976 for the 2014/2015 academic year. The cost is the same for all students regardless of Oklahoma residence status as there is no in-state discount."}, {"url": "http://acm.uco.edu/cost/index.asp", "passage_text": "Tuition and Fees. ACM@UCO offers a unique contemporary music education at an affordable cost. Based on UCO's standard tuition rate, plus an ACM@UCO course fee the estimated annual costs for production and performance programs of study are: 1) These rates are based on 2010-2011 tuition rates and are subject to change if tuition is adjusted. 2) These costs are exclusive of housing and meal costs. To get an up-to-date estimate of costs use the UCO Tuition and Fee Estimate Calculator (Be sure to enter the appropriate credit hours in the ACM@UCO field)."}, {"url": "https://www.uco.edu/", "passage_text": "If you are graduating in the spring 2016 semester, apply for graduation by Nov. 1 to avoid a late fee. UCO Named 'Best College' U.S. News & World Report has once again ranked the UCO the top public regional university in the state. "}, {"url": "http://broncho2.uco.edu/tuitioncalculator_web/tuitioncalculator.aspx", "passage_text": "There are other fees that may be associated with your attendance at Central. For a list of other potential charges, please see our FINANCIAL DISCLOSURE / ENROLLMENT COSTS page. This calculator is designed to provide you with an estimate of tuition and fees for the listed school year. You should enter figures that are appropriate to your individual situation. The results provided by these calculators are intended for illustrative purposes only."}, {"url": "http://broncho2.uco.edu/tuitioncalculator_web/tuitioncalculator.aspx", "passage_text": "The Net Cost is the estimated result of UCO costs that include tuition/fees, books, room/board, transportation and miscellaneous expenses minus the estimated financial aid that you may be eligible to receive upon completion of the Free Application for Federal Student Aid (FAFSA). This calculator is designed to provide you with an estimate of tuition and fees for the listed school year. You should enter figures that are appropriate to your individual situation. The results provided by these calculators are intended for illustrative purposes only."}, {"url": "http://www.collegecalc.org/colleges/oklahoma/university-of-central-oklahoma/", "passage_text": "Annual Total Cost. The total list price for in-state Oklahoma residents to go to UCO-Central is $14,136 for the 2014/2015 academic year. Out-of-state students who don't possess Oklahoma residence can expect a one year cost of $22,616. Some schools offer the ability to take single classes by paying on a per credit hour basis. The reported price per credit hour and estimated cost for one class at University of Central Oklahoma are as follows. Per credit costs are for reference only as many schools will not allow students to pay by credit hour."}, {"url": "http://www.collegecalc.org/colleges/oklahoma/university-of-central-oklahoma/", "passage_text": "Undergraduate Tuition. University of Central Oklahoma tuition is $4,927 per year for in-state residents. This is 23% cheaper than the national average public four year tuition of $6,429. The cost is $6,538 and 57% cheaper than the average Oklahoma tuition of $11,465 for 4 year colleges. Tuition ranks 13th in Oklahoma amongst 4 year colleges for affordability and is the 24th most expensive 4 year college in the state. If attending from out-of-state, the tuition is $13,407 which represents a 172% premium. Some schools offer the ability to take single classes by paying on a per credit hour basis. The reported price per credit hour and estimated cost for one class at University of Central Oklahoma are as follows. Per credit costs are for reference only as many schools will not allow students to pay by credit hour."}]