[{"url": "http://www.xanthangumsubstitute.com/gum-arabic/", "passage_text": "Gum Arabic is a natural gum produced from the sap of the acacia tree located in the regions of the African Sahel including Senegal, Sudan, Somalia, India and Pakistan. It is mainly used as a stabilising agent emulsifier, which means that it can bind together ingredients that would normally fall apart. Gum Arabic has been extensively tested for human consumption and is one of the safest to digest. When used in the food industry, it is commonly used as an additive sweetener in many foods and beverages. It is also used in soft drinks to thicken the liquid, confectionery, chewing gum, jelly, dessert mixes and soup bases."}, {"url": "http://www.merriam-webster.com/dictionary/gum%20arabic", "passage_text": "Medical Definition of GUM ARABIC. : a water-soluble gum obtained from several leguminous plants of the genus Acacia (especially A. senegal and A. arabica) and used especially in pharmacy to suspend insoluble substances in water, to prepare emulsions, and to make pills and lozenges—called also acacia, gum acacia. : a water-soluble gum obtained from several acacias (especially Acacia senegal) and used especially in the manufacture of inks, adhesives, pharmaceuticals, and confections. See gum arabic defined for kids. ADVERTISEMENT."}, {"url": "https://en.wikipedia.org/wiki/Gum_Arabic", "passage_text": "While gum arabic is now produced mostly throughout the African Sahel, it is still harvested and used in the Middle East. For example, Arab populations use the natural gum to make a chilled, sweetened, and flavored gelato-like dessert. Gum arabic is a complex mixture of glycoproteins and polysaccharides. It is the original source of the sugars arabinose and ribose, both of which were first discovered and isolated from it, and are named after it. Gum arabic is used primarily in the food industry as a stabilizer"}, {"url": "http://www.visitchem.com/product/e414-gum-arabic/", "passage_text": "Gum arabic/arabic gum. Gum arabic/arabic gum (E414, also called acacia gum) has a complex molecular structure and mainly contains arabinose, galactose and glucuronic acid. It is a kind of natural plant gum condensed from the juice from the tree called Acacia-hence the name. Gum arabic/arabic gum is often used for the production of chewing gum, with favorable adhesion and soft elasticity, and the usage is generally 20-25%. It can naturally form knots on the bark, known as gummosis."}, {"url": "http://www.lindyscakes.co.uk/2011/08/09/what-is-gum-arabic-used-for/", "passage_text": "The product we’re exited about at the moment is Gum Arabic. Gum Arabic for sugarcraft use. Gum arabic, also known as gum acacia, chaar gund, char goond, meska or E414, is harvested from two types of wild Acacia trees found in the African Sahel from Senegal/Sudan to Somalia. Gum Arabic glue /glaze. Mix Gum Arabic powder with warm water (10ml/2tsp of Gum Arabic with 60ml/2fl oz of water) to create an edible glue for sticking sugar pieces together. It can also be used as varnish for marzipan or sugarpaste."}, {"url": "https://en.wikipedia.org/wiki/Gum_Arabic", "passage_text": "Gum arabic, also known as acacia gum, chaar gund, char goond, or meska, is a natural gum made of the hardened sap of two species of the acacia tree; Senegalia (Acacia) senegal and Vachellia (Acacia) seyal. Gum arabic is a complex mixture of glycoproteins and polysaccharides. It is the original source of the sugars arabinose and ribose, both of which were first discovered and isolated from it, and are named after it. Gum arabic is used primarily in the food industry as a stabilizer"}, {"url": "http://www.merriam-webster.com/dictionary/gum%20arabic", "passage_text": "Definition of GUM ARABIC. : a water-soluble gum obtained from several acacias (especially Acacia senegal) and used especially in the manufacture of inks, adhesives, pharmaceuticals, and confections. See gum arabic defined for kids. ADVERTISEMENT."}, {"url": "http://www.food-info.net/uk/qa/qa-wi5.htm", "passage_text": "Gum arabic is a useful if rather expensive thickening agent, emulsifier, texturizer and film-former, widely used in the drinks industry to stabilize flavours and essential oils, for example in soft drink concentrates. Gum arabic is used in confectionery such as traditional hard (wine) gums, pastilles and as a foam stabilizer in marshmallows. Gum Arabic is chemically a carbohydrate polymer, which is partly degraded in the large intestine."}, {"url": "http://www.ticgums.com/featured-products/arabic.html", "passage_text": "From Source to Resource. Today, gum arabic is harvested in the gum belt of Africa, in nations such as Chad, Eritrea, Kenya, Mali, Mauritania, Niger, Nigeria, Senegal, and Sudan. It is then dried or aged for one year before being processed into spray dried powder. Origins of Gum Arabic. Derived from the sap of the African acacia tree, gum arabic is one of the world’s most common gums with the longest history. Also known as gum acacia, it was used in ancient times for purposes as varied as mummification and inks for hieroglyphics."}]