[{"url": "http://www.funtrivia.com/playquiz/quiz3146372405320.html", "passage_text": "The Battle of Cowpens in South Carolina took place on January 17, 1781. This battle contributed to breaking the back of British control of the Southern front of the American Revolution.. 15 Points Per Correct Answer-No time limit."}, {"url": "https://en.wikipedia.org/wiki/Battle_of_Cowpens", "passage_text": "The Battle of Cowpens (January 17, 1781) was a decisive victory by the Continental Army forces under Brigadier General Daniel Morgan in the Southern campaign of the American Revolutionary War over the British Army led by Colonel Banastre Tarleton."}, {"url": "http://www.weegy.com/?ConversationId=NWTINELK", "passage_text": "User: In which southern colony did the Battle of Cowpens take place? A. Virginia B. North Carolina C. South Carolina D. Georgia Weegy: C. South Carolina latefisher|Points 3420|User: FL Weegy: In which southern colony did the Battle of Cowpens take place? The answer is C. South Carolina."}, {"url": "http://www.answers.com/Q/What_state_was_the_battle_of_cowpens_in", "passage_text": "The Battle of Cowpens took place on January 17, 1781 in South Carolina on the border of North Carolina, in the United States. The war in the southern colonies wasn't making ve … ry much progress because both sides didn't have enough strength to make full offensive attacks."}, {"url": "http://www.exploresouthernhistory.com/Cowpens1.html", "passage_text": "On January 17, 1781, General Daniel Morgan turned the tide of the American Revolution. The Battle of Cowpens in South Carolina started the British down a road that would end with their monumental surrender at Yorktown, Virginia.The battle took place as everything was going wrong in America's fight for independence. George Washington's army was bogged down in the North."}, {"url": "http://www.theamericanrevolution.org/battledetail.aspx?battle=26", "passage_text": "The Battle of Cowpens (January 17, 1781) was a decisive victory by American Revolutionary forces under Brigadier General Daniel Morgan, in the Southern campaign of the American Revolutionary War. It was a turning point in the reconquest of South Carolina from the British."}]