[{"url": "https://en.wikipedia.org/wiki/Victoria_Falls", "passage_text": "For the town in Zimbabwe, see Victoria Falls, Zimbabwe. For the waterfall in Scotland, see Victoria Falls, Wester Ross. Victoria Falls, or Mosi-oa-Tunya (Tokaleya Tonga: the Smoke that Thunders), is a waterfall in southern Africa on the Zambezi River at the border of Zambia and Zimbabwe. The first European to see the falls was David Livingstone on 17 November 1855, during his 1852–56 journey from the upper Zambezi to the mouth of the river. The falls were well known to local tribes, and Voortrekker hunters may have known of them, as may the Arabs under a name equivalent to the end of the world."}, {"url": "http://azambeziriverlodge.com/index.html", "passage_text": "A'Zambezi River Lodge. A'Zambezi River Lodge is located in Victoria Falls, Zimbabwe 25km from the airport, nestling on the banks of the mighty Zambezi river within the periphery of the Zambezi National Park. The imaginative architecture with its sweeping curve of grass thatch blends well with the lash green lawns. "}, {"url": "http://www.zambiatourism.com/destinations/waterfalls/victoria-falls", "passage_text": "ictoria Falls presents a spectacular sight of awe-inspiring beauty and grandeur on the Zambezi River, forming the border between Zambia and Zimbabwe. The wide, basalt cliff over which the falls thunder, transforms the Zambezi from a placid river into a ferocious torrent cutting through a series of dramatic gorges. Facing the Falls is another sheer wall of basalt, rising to the same height, and capped by mist-soaked rain forest."}, {"url": "https://www.expedia.com/Victoria-Falls-Hotels-AZambezi-River-Lodge.h2150535.Hotel-Information", "passage_text": "Location. Located on a river, this family-friendly hotel is within 6 mi (10 km) of Victoria Falls National Park, Zambezi National Park, and Mosi-oa-Tunya National Park. Devil's Pool and Victoria Falls Field Museum are also within 6 mi (10 km). "}, {"url": "http://www.theriverclubafrica.com/", "passage_text": "The River Club. The River Club is a tranquil oasis on Zambia’s mighty Zambezi River and the perfect location for a visit to the renowned Victoria Falls-a World Heritage Site and one of the 7 Natural Wonders of the World. Located a short distance from the historical town of Livingstone, The River Club forms a perfect end to a safari circuit in Southern or East Africa. A host of activities await young and old, on property as well as around the Victoria Falls. 1  Farm 1519a, Nakatindi Road Livingstone, 60469, Zambia."}, {"url": "http://www.victoriafallsriverlodge.com/", "passage_text": "On the 5th October 2013 (at around 11h00) whilst transferring guests out of the... Wonderful Leopard En... Of all Africa’s wildlife, few are as shrouded in secrecy, or so reputed for stea... Victoria Falls River Lodge is the first private game lodge set in the Zambezi National Park. This luxury tented lodge is situated on the banks of the mighty Zambezi River – so close to Victoria Falls one can see the spray in the distance! "}, {"url": "http://www.softschools.com/facts/wonders_of_the_world/victoria_falls_facts/415/", "passage_text": "Victoria Falls Facts. Victoria Falls is one of the Seven Natural Wonders of the World and the major waterfall on the Zambezi River in Africa. It is famous for being the largest waterfall in the world, in the wet season."}, {"url": "https://en.wikipedia.org/wiki/Zambezi", "passage_text": "The Zambezi (also spelled Zambeze and Zambesi) is the fourth-longest river in Africa, the longest east flowing river in Africa and the largest flowing into the Indian Ocean from Africa. The area of its basin is 1,390,000 square kilometres (540,000 sq mi), slightly less than half that of the Nile. "}, {"url": "http://www.softschools.com/facts/wonders_of_the_world/victoria_falls_facts/415/", "passage_text": "Interesting Victoria Falls Facts: Victoria Falls on the Zambezi River is located on the border between the countries of Zambia and Zimbabwe in the continent of Africa. The Zambezi River is the largest river in Africa and one of the longest. It flows. Victoria Falls is one of the Seven Natural Wonders of the World and the major waterfall on the Zambezi River in Africa. It is famous for being the largest waterfall in the world, in the wet season."}, {"url": "http://www.andbeyond.com/partner-accommodation/zimbabwe/victoria-falls-river-lodge.htm", "passage_text": "Victoria Falls River Lodge. Tucked into the banks of the Zambezi River, Zambezi Crescent Victoria Fall River Lodge is close enough to the magnificent Victoria Falls to see the spray in the distance and yet secluded in a remote corner of Zambezi National Park. "}]