[{"url": "http://www.answers.com/Q/What_were_roman_mosaics_made_out_of", "passage_text": "Confidence votes 23. Somebody before me said mosaics were made of wood, but they were actually made of coloured bits of broken glass and tile. Roman mosaic art that is still available for historians to research were typically made of local stone and pebbles. They included glass to a small degree to give color and the glass was mixed with the natural stone and rock of the area."}, {"url": "http://www.howitworksdaily.com/how-mosaics-were-made/", "passage_text": "Colours were achieved using carefully selected stone or shell and, for more elaborate examples, coloured glass and stone coated in gold leaf. In floor mosaics, a ground layer called statumen was packed with small pebbles onto which 25 centimetres (ten inches) of mortar called rudus was poured."}, {"url": "http://www.answers.com/Q/What_were_mosaics_made_out_of", "passage_text": "Somebody before me said mosaics were made of wood, but they were actually made of coloured bits of broken glass and tile Roman mosaic art that is still available for historia … ns to research were typically made of local stone and pebbles."}, {"url": "https://en.wikipedia.org/wiki/Mosaic", "passage_text": "Mosaic has a long history, starting in Mesopotamia in the 3rd millennium BC. Pebble mosaics were made in Tiryns in Mycenean Greece; mosaics with patterns and pictures became widespread in classical times, both in Ancient Greece and Ancient Rome."}, {"url": "http://www.ancient.eu/Mosaic/", "passage_text": "by carinemahy. Mosaic is the art of creating images with an assemblage of small pieces of colored glass, stone, or other materials. The earliest known examples of mosaics made of different materials were found at a temple building in Ubaid, Mesopotamia, and are dated to the second half of 3nd millennium BCE."}, {"url": "http://www.ancient.eu/article/498/", "passage_text": "Technique. Mosaics, otherwise known as opus tesellatum, were made with small black, white and coloured squares typically measuring between 0.5 and 1.5 cm but fine details were often rendered using even smaller pieces as little as 1mm in size."}, {"url": "http://www.answers.com/Q/What_were_roman_mosaics_made_out_of", "passage_text": "They were created by little pieces of glass Originally mosaics were made of pebbles of various natural colours. Later they were made of small pieces of stone, shells, ivory a … nd other materials. Marble and limestone were also used."}]