[{"url": "http://www.vivo.colostate.edu/hbooks/pathphys/endocrine/thyroid/pth.html", "passage_text": "1 Enhancing absorption of calcium from the small intestine: Facilitating calcium absorption from the small intestine would clearly serve to elevate blood levels of calcium. 2  Parathyroid hormone stimulates this process, but indirectly by stimulating production of the active form of vitamin D in the kidney. Low levels of the hormone are secreted even when blood calcium levels are high. The figure to the right depicts parathyroid hormone release from cells cultured in vitro in differing concentration"}, {"url": "http://www.yourhormones.info/hormones/parathyroid_hormone.aspx", "passage_text": "Parathyroid hormone regulates calcium levels in the blood, largely by increasing the levels when they are too low. It does this through its actions on the kidneys, bones and intestine: Bones-Parathyroid hormone stimulates the release of calcium from large calcium stores in the bones into the bloodstream. Parathyroid hormone is secreted by the parathyroid glands and is the most important regulator of calcium levels in the blood and within the bones. Alternative names for parathyroid hormone PTH; parathormone; parathyrin."}, {"url": "http://www.yourhormones.info/hormones/parathyroid_hormone.aspx", "passage_text": "1 Bones-Parathyroid hormone stimulates the release of calcium from large calcium stores in the bones into the bloodstream. 2  This increases bone destruction and decreases the formation of new bone. 3  Kidneys-Parathyroid hormone reduces loss of calcium in urine. Parathyroid hormone is secreted by the parathyroid glands and is the most important regulator of calcium levels in the blood and within the bones. Alternative names for parathyroid hormone PTH; parathormone; parathyrin."}, {"url": "http://www.vivo.colostate.edu/hbooks/pathphys/endocrine/thyroid/pth.html", "passage_text": "1 Suppression of calcium loss in urine: In addition to stimulating fluxes of calcium into blood from bone and intestine, parathyroid hormone puts a brake on excretion of calcium in urine, thus conserving calcium in blood. 2  This effect is mediated by stimulating tubular reabsorption of calcium. Low levels of the hormone are secreted even when blood calcium levels are high. The figure to the right depicts parathyroid hormone release from cells cultured in vitro in differing concentrations"}, {"url": "http://www.vivo.colostate.edu/hbooks/pathphys/endocrine/thyroid/pth.html", "passage_text": "Parathyroid hormone is the most important endocrine regulator of calcium and phosphorus concentration in extracellular fluid. This hormone is secreted from cells of the parathyroid glands and finds its major target cells in bone and kidney. Low levels of the hormone are secreted even when blood calcium levels are high. The figure to the right depicts parathyroid hormone release from cells cultured in vitro in differing concentrations of calcium."}, {"url": "http://patient.info/health/the-thyroid-and-parathyroid-glands", "passage_text": "Normally, parathyroid hormone release is triggered when the level of calcium in the blood is low. When the calcium level rises and is back to normal, the release of parathyroid hormone from the parathyroids is suppressed. However, parathyroid hormone and calcitonin work together to control calcium levels in the blood. This decreases blood calcium levels. When calcium levels decrease, this stimulates the parathyroid gland to release parathyroid hormone. Parathyroid hormone encourages the normal process of bone breakdown (essential for maintenance and growth of the bone). This process of bone breakdown releases calcium into the bloodstream"}, {"url": "https://en.wikipedia.org/wiki/Bone_resorption", "passage_text": "Low levels of calcium stimulates the release of parathyroid hormone (PTH) from chief cells of the parathyroid gland. In addition to its effects on kidney and intestine, PTH also increases the number and activity of osteoclasts. "}, {"url": "https://labtestsonline.org/understanding/analytes/pth/tab/sample", "passage_text": "1 PTH promotes the release of calcium from bones into the bloodstream. 2  It stimulates the kidneys to convert vitamin D from the inactive to the active form, which in turn increases the absorption of calcium from food in the intestines. Parathyroid hormone (PTH) helps the body maintain stable levels of calcium in the blood. It is part of a feedback loop that includes calcium, PTH, vitamin D, and, to some extent, phosphorus (phosphate) and magnesium."}]