[{"url": "http://www.mayoclinic.org/diseases-conditions/spinal-cord-injury/basics/symptoms/CON-20023837", "passage_text": "Your ability to control your limbs after spinal cord injury depends on two factors: the place of the injury along your spinal cord and the severity of injury to the spinal cord. The lowest part of your spinal cord that functions normally after injury is referred to as the neurological level of your injury. 1 If almost all feeling (sensory) and all ability to control movement (motor function) are lost below the spinal cord injury, your injury is called complete. 2  Incomplete. 3  If you have some motor or sensory function below the affected area, your injury is called incomplete. 4  There are varying degrees of incomplete"}, {"url": "http://www.hopkinsmedicine.org/healthlibrary/conditions/physical_medicine_and_rehabilitation/spinal_cord_injury_85,P01180/", "passage_text": "The spinal cord is a bundle of nerves that carries messages between the brain and the rest of the body. Acute spinal cord injury (SCI) is due to a traumatic injury that can either result in a bruise (also called a contusion), a partial tear, or a complete tear (called a transection) in the spinal cord. Complete injury means that there is no function below the level of the injury--either sensation and movement--and both sides of the body are equally affected. Complete injuries can occur at any level of the spinal cord. Incomplete injury."}, {"url": "http://www.necksurgery.com/faq.html?intFAQID=10&txtFAQ=Will_I_have_irreversible_damage_if_I_delay_surgery", "passage_text": "Dr. Douglas Slaughter Mesa, AZ In some cases with nerve root injury or spinal cord injury, delay of surgery can cause permanent damage; however, surgeons cannot tell you exactly when that time of irreversible damage will occur. Dr. Allan Levi Miami, FL Irreversible damage to the spinal cord and to nerves can occur with prolonged compression. Dr. Leon J. Grobler Sun City, AZ Pain in and of itself does not inflict permanent damage, nor is it necessarily a sign that permanent damage to the nerves has occurred."}, {"url": "http://www.webmd.com/brain/nerve-pain-and-nerve-damage-symptoms-and-causes", "passage_text": "With nerve damage there can be a wide array of symptoms. Which ones you may have depends on the location and type of nerves that are affected. Damage can occur to nerves in your brain and spinal cord. It can also occur in the peripheral nerves, which are located throughout the rest of your body. Autonomic nerve damage may produce the following symptoms: 1  Inability to sense chest pain, such as angina or heart attack. "}, {"url": "http://www.livescience.com/41076-spinal-cord-injury.html", "passage_text": "A spinal cord injury (SCI) is damage to any part of the spinal cord, the bundle of nerves that runs from the brain down the vertebral column, or disease. Symptoms of spinal cord injury include: loss of movement; loss of sensation (sense of touch, heat or cold); loss of bowel or bladder control; exaggerated reflexes or spasms; changes in sexual function or sensitivity; pain or stinging due to nerve damage; and difficulty breathing, coughing, or clearing the throat."}, {"url": "http://www.mayoclinic.org/diseases-conditions/spinal-cord-injury/basics/definition/CON-20023837", "passage_text": "At Mayo Clinic, we take the time to listen, to find answers and to provide you the best care. A spinal cord injury — damage to any part of the spinal cord or nerves at the end of the spinal canal — often causes permanent changes in strength, sensation and other body functions below the site of the injury. "}, {"url": "http://www.medicinenet.com/spinal_cord_injury_treatments_and_rehabilitation/article.htm", "passage_text": "A spinal cord injury occurs when there is damage to the spinal cord either from trauma, loss of its normal blood supply, or compression from tumor or infection. There are approximately 12,000 new cases of spinal cord injury each year in the United States. 1 Spinal cord injury can be either complete or incomplete. 2  In complete injuries there is no function below the level of injury. 3  In incomplete injuries there is some function remaining below the level of injury. 4  Early immobilization and treatment are the most important factors in achieving recovery from spinal cord injury."}]