[{"url": "http://www.everydayhealth.com/drugs/metoprolol", "passage_text": "A: Metoprolol (Lopressor, Toprol XL) is a blood pressure medication categorized as a beta blocker. Metoprolol is indicated for the treatment of angina (chest pain) and hypertension (high blood pressure). It is also used to treat or prevent heart attack."}, {"url": "http://www.everydayhealth.com/drugs/metoprolol", "passage_text": "A: Metoprolol belongs to a class of medications called beta blockers, which are used to treat high blood pressure, angina, and congestive heart failure. The most common side effects are dizziness, lightheadedness, or slow heart rate."}, {"url": "http://www.ehealthme.com/ds/metoprolol+tartrate/muscle+weakness/", "passage_text": "Summary: Muscle weakness is found among people who take Metoprolol tartrate, especially for people who are female, 60+ old, have been taking the drug for."}, {"url": "http://www.everydayhealth.com/drugs/metoprolol", "passage_text": "It is used to treat angina (chest pain), hypertension (high blood pressure), and to treat or prevent heart attack. Some of the side effects that may be experienced with metoprolol include: low blood pressure, slow heart rate, rash or itching, shortness of breath, dizziness, drowsiness, and depression."}, {"url": "http://www.peoplespharmacy.com/2008/01/09/metoprolol/", "passage_text": "Metoprolol is usually prescribed for high blood pressure, chest pain, heart attacks, and prevention of a second heart attack. The extended release metoprolol is also used in combination with other medications to treat heart failure."}, {"url": "http://www.everydayhealth.com/drugs/metoprolol", "passage_text": "Metoprolol (Lopressor) is in a class of drugs called beta-blockers. Beta-blockers are used to treat chest pain (angina) and high blood pressure (hypertension). Beta-blockers are also used to treat or prevent heart attack."}, {"url": "http://www.everydayhealth.com/drugs/metoprolol", "passage_text": "Crestor is a medication used to lower cholesterol. The most common side effects are muscle pain or weakness, abdominal pain, nausea, and headache. The weight loss is not indicative of the medications you are taking, but the unsteady gait and lightheadedness may be side effects of metoprolol."}, {"url": "http://www.ehealthme.com/ds/metoprolol+tartrate/muscle+weakness/", "passage_text": "Muscle weakness (a lack of muscle strength) has been reported by people with multiple sclerosis, high blood pressure, high blood cholesterol, osteoporosis, pain. (latest reports from 182,417 Muscle weakness patients). On Oct, 7, 2015: 38,600 people reported to have side effects when taking Metoprolol tartrate. Among them, 2,492 people (6.46%) have Muscle Weakness."}]