[{"url": "http://theturquoisechick.com/dyedturquoise.htm", "passage_text": "If it is advertised turquoise like or if advertised with turquoise in front of the name of the actual stone, i.e., turquoise Howlite, then you know it isn't turquoise and the price should be lower than what you would expect to pay for actual turquoise. The egg photo on this page is used as an example on Wikipedia of what dyed Howlite looks like and how real it can look to an unsuspecting buyer. There are also some photos on this web page of plastic beads next to authentic turquoise beads so you can see the difference."}, {"url": "http://meanings.crystalsandjewelry.com/howlite", "passage_text": "Howlite can also be used to release attachments, or cords, linking old emotional pain, from this life or a past life, to the present. Once these atachments are severed, it allows for processing those emotions and bringing peace in those areas. Howlite is a wonder stone for calming upset states of mind and emotion. Howlite decreases an overly critical state of mind, selfishness, stress, and anxiety, bringing calm and relaxation. Howlite also can decrease anger originating from within or externally."}, {"url": "https://en.wikipedia.org/wiki/Halite", "passage_text": "Halite /ˈhaelaɪt/ , ˈhælaɪt commonly known as rock, salt is a type of, salt the mineral form of sodium (Chloride Na). Cl halite forms isometric. Crystals the mineral is typically colorless or, white but may also be light, blue dark, blue, purple, pink, red, orange yellow or gray depending on the amount and type of. impurities Salt beds may be hundreds of meters thick and underlie broad areas. In the United States and Canada extensive underground beds extend from the Appalachian basin of western New York through parts of Ontario and under much of the Michigan Basin. Other deposits are in Ohio, Kansas, New Mexico, Nova Scotia and Saskatchewan."}, {"url": "http://meanings.crystalsandjewelry.com/howlite", "passage_text": "Howlite is primarily associated with the crown chakra, but can also be used to stimulate and balance all the chakras. Other Information. Howlite takes permanent color enhancement well, so it is often colored to resemble other stones or to have bright, intriguing colors. Howlite is a wonder stone for calming upset states of mind and emotion. Howlite decreases an overly critical state of mind, selfishness, stress, and anxiety, bringing calm and relaxation. Howlite also can decrease anger originating from within or externally."}, {"url": "http://roundsolarlight.com/", "passage_text": "The Touch Of ECO™ HALOLITE™ is a revolutionary round multi-use solar powered LED light that easily attaches to gutters, signs, decks and fences. The HALOLITE™ features four ultra bright LED's with a high performance solar panel that covers almost 50% more surface area than any other light in the marketplace. These spotlights quickly and easily mount to any gutter or flat surface. Plus the two rechargeable batteries are included and already installed"}, {"url": "http://geology.com/minerals/halite.shtml", "passage_text": "Halite is the mineral name for the substance that everyone knows as salt. Its chemical name is sodium chloride and a rock composed primarily of halite is known as rock salt. Halite is mainly a sedimentary mineral that usually forms in arid climates where ocean water evaporates. "}, {"url": "https://en.wikipedia.org/wiki/Halite", "passage_text": "Halite /ˈhaelaɪt/ , ˈhælaɪt commonly known as rock, salt is a type of, salt the mineral form of sodium (Chloride Na). Cl halite forms isometric. crystals Salt beds may be hundreds of meters thick and underlie broad areas. In the United States and Canada extensive underground beds extend from the Appalachian basin of western New York through parts of Ontario and under much of the Michigan Basin. Other deposits are in Ohio, Kansas, New Mexico, Nova Scotia and Saskatchewan."}, {"url": "http://www.minerals.net/mineral/halite.aspx", "passage_text": "The Mineral halite. Halite, the natural form of salt, is a very common and well-known mineral. It is found in solid masses, and as a dissolved solution in the oceans and in salt lake s. The inland lakes that are rich in salt exist in arid regions, and may also be below sea level without an outlet. - Hydrohalite is not really a variety of Halite, but a very rare, similar mineral. Its chemical formula is NaCl · 2H2O, which is in essence Halite containing water. It forms only under very unique conditions where the water does not dissolve the salt."}, {"url": "http://www.minerals.net/mineral/halite.aspx", "passage_text": "Halite also exists in non-arid regions, in underground deposits which can reach great depths. Underground Halite deposits are often mined by drilling wells into the salt layer, and bringing in hot water which quickly dissolves the salt into a brine. The brine is saturated with dissolved salt and is then pumped out. - Hydrohalite is not really a variety of Halite, but a very rare, similar mineral. Its chemical formula is NaCl · 2H2O, which is in essence Halite containing water. It forms only under very unique conditions where the water does not dissolve the salt."}, {"url": "https://en.wikipedia.org/wiki/Halite", "passage_text": "Halite occurs in vast beds of sedimentary evaporite minerals that result from the drying up of enclosed lakes, playas, and seas. Salt beds may be hundreds of meters thick and underlie broad areas. In the United States and Canada extensive underground beds extend from the Appalachian basin of western New York through parts of Ontario and under much of the Michigan Basin. Other deposits are in Ohio, Kansas, New Mexico, Nova Scotia and Saskatchewan."}]