[{"url": "http://www.wisegeek.com/what-does-a-rigger-do.htm", "passage_text": "A rigger may be involved in installing heavy and specialized equipment like MRI machines. Wooden pulleys hold the rigging on a boat. In the military, personnel known as parachute riggers are responsible for packing parachutes and inspecting them. The entertainment industry also has a place for riggers. Riggers who work in entertainment handle the installation of sets, and any movement which needs to happen, including moving set pieces and actors on flies."}, {"url": "http://www.rigger.com/", "passage_text": "Rigger.com is a free resource guide that connects riggers, crane operators, machinery movers & erectors, millwrights, house & vault movers, heavy haul truckers, do-it-yourself load movers... Read more... Articles See a complete list of rigging industry articles. A Rigger is a heavy load mover. A rigger moves heavy commercial and industrial equipment such as manufacturing machines in factories, pizza ovens in restaurants, or x-ray machines in and out of hospitals. Read more..."}, {"url": "https://en.wikipedia.org/wiki/Rigger_(industry)", "passage_text": "A rigger is a person that specializes in the lifting and moving of extremely large or heavy objects, often with the assistance of a crane or derrick. "}, {"url": "https://en.wikipedia.org/wiki/Parachute_rigger", "passage_text": "A parachute rigger is a person who is trained or licensed to pack, maintain or repair parachutes. A rigger is required to understand fabrics, hardware, webbing, regulations, sewing, packing, and other aspects related to the building, packing, repair, and maintenance of parachutes. "}, {"url": "https://www.sokanu.com/careers/rigger/", "passage_text": "A rigger in the oil extraction industry usually works on drilling rigs. Equipment on the rig is used to bore a hole deep into the earth with the drill pipe. The rigger manages all aspects of the machinery used and monitors the rig operation. His responsibility is to ensure that the oil is being pumped out at a safe level so pipes do not burst. When oil is transported to a tanker, the rigger fits and links all the pipes together. Some other specific job duties include: 1  maintaining drilling rig engines and motors, including the fluid systems. 2  managing hydraulic and mechanical systems for the whole drilling assembly."}, {"url": "http://www.definitions.net/definition/rigger", "passage_text": "Rigger. A rigger is a person or company that specializes in the lifting and moving of extremely large or heavy objects. The term comes from the days of sailing ships, where a rigger was a person who worked with rigging, that is, ropes for hoisting the sails."}, {"url": "https://www.sokanu.com/careers/rigger/", "passage_text": "In the military, riggers are responsible for maintaining and setting up things like parachutes or airdrop equipment. In the theater industry, riggers manage pieces of a stage set, moving props and changing production scenes. When oil is transported to a tanker, the rigger fits and links all the pipes together. Some other specific job duties include: 1  maintaining drilling rig engines and motors, including the fluid systems. 2  managing hydraulic and mechanical systems for the whole drilling assembly."}, {"url": "http://www.rigger.com/articles/rigging/what-is-a-rigger", "passage_text": "A rigger moves loads varying in size, weight and shape such as manufacturing machines in factories, X-ray machines in hospitals, and storage silos on farms. A rigger uses cranes, overhead lifting gear, pulleys, load moving dollies, hydraulic jacks, and flat bed trucks. A rigger is primarily found in industrial and commercial industries such as in oil, gas, mining, ship building, construction, manufacturing, power and telecommunication, hospitals, etc."}, {"url": "http://www.wisegeek.com/what-does-a-rigger-do.htm", "passage_text": "A rigger can do a number of different things, depending on which industry he or she is employed in. Numerous sectors including entertainment, manufacturing, and the military sector have job positions known as “riggers” and people in these positions do very different things. The entertainment industry also has a place for riggers. Riggers who work in entertainment handle the installation of sets, and any movement which needs to happen, including moving set pieces and actors on flies."}]