[{"url": "http://web.extension.illinois.edu/meatsafety/thawing.cfm", "passage_text": "After thawing in the refrigerator, ground meat should be used as soon as possible. Once meat has been frozen and thawed, it will deteriorate more rapidly than if it had never been frozen. Whole meat cuts (chops, roasts) will remain useable for another 3-5 days in the refrigerator before cooking. However, once thawed, these bacteria can become active again. Never thaw meat on the counter or let it sit out of the refrigerator for more than two hours. In the summer, reduce this time to 1 hour. Never defrost meat in hot water. There are 3 Safe Ways To Defrost Meat: 1  In the refrigerator."}, {"url": "http://www.fsis.usda.gov/wps/portal/fsis/topics/food-safety-education/get-answers/food-safety-fact-sheets/safe-food-handling/the-big-thaw-safe-defrosting-methods-for-consumers/CT_Index", "passage_text": "Cooking Without Thawing. When there is not enough time to thaw frozen foods, or you're simply in a hurry, just remember: it is safe to cook foods from the frozen state. The cooking will take approximately 50% longer than the recommended time for fully thawed or fresh meat and poultry. A large frozen item like a turkey requires at least a day (24 hours) for every 5 pounds of weight. Even small amounts of frozen food — such as a pound of ground meat or boneless chicken breasts — require a full day to thaw. When thawing foods in the refrigerator, there are variables to take into account."}, {"url": "http://www.answers.com/Q/How_long_can_thawed_sausage_stay_refrigerator_before_cooking", "passage_text": "More detailed research indicates that cooked shrimp stored in the refrigerator should be eaten within 1-2 days. Considering that thawed shrimp was pre-cooked when purchased - … and you do not know the exact conditions that the frozen shrimp was shipped and/or stored-it's wise to discard after 2 days. Meats are kept better in the freezer. Meats can be kept in the refrigerator for 3 to 4 days if raw and 1 to 2 days longer if cooked. Always place cooked meats in an airt … ight container."}, {"url": "http://www.organicprairie.com/thawing", "passage_text": "Larger frozen meat items—roasts, hams, turkeys—require at least 24 hours for every 5 pounds of meat. When thawing foods in the refrigerator, the temperature of the regrigerator matters. Variations in refrigerator temperature can add to thawing time. Items such as ground meat, stew meat, poultry, seafood, remain safe up to 2 days after thawing in the refrigerator. Red meat cuts—beef, pork or lamb roasts, chops, steaks—remain safe up to 3 days. Meats thawed in the refrigerator can be refrozen without cooking. No-thaw Cooking. It is perfectly safe to cook meats from the frozen state. Cooking will be approximately 50% longer than the recommended time for fully thawed or fresh meat and poultry. 1  DO NOT thaw meats on the counter or in hot water. 2  DO NOT leave meat at room temperature for more than two hours."}, {"url": "http://www.mademan.com/mm/how-long-can-you-keep-cooked-sausage-refrigerator.html", "passage_text": "Luncheon meats can also be kept unopened in the refrigerator for up to two weeks and in the freezer for one to two months, but the time in the refrigerator after opening is less than hot dogs at three to five days. Reference: Sausage and Food Safety. T echnically in the sausage family, hot dogs can be kept in the refrigerator for up to two weeks unopened or for seven days in the refrigerator after opening. In the freezer the time is one to two months"}, {"url": "http://www.mademan.com/mm/how-long-can-you-keep-cooked-sausage-refrigerator.html", "passage_text": "Cooked sausage can be kept in the refrigerator longer than raw sausage, so it is best to go ahead and cook it. According to the U.S. Department of Agriculture, fresh uncooked sausage can be kept in the refrigerator only one to two days although it can be kept in the freezer for one to two months. T echnically in the sausage family, hot dogs can be kept in the refrigerator for up to two weeks unopened or for seven days in the refrigerator after opening. In the freezer the time is"}, {"url": "http://web.extension.illinois.edu/meatsafety/thawing.cfm", "passage_text": "Freezing meat keeps bacteria in a dormant stage. However, once thawed, these bacteria can become active again. Never thaw meat on the counter or let it sit out of the refrigerator for more than two hours. In the summer, reduce this time to 1 hour. Never defrost meat in hot water. There are 3 Safe Ways To Defrost Meat: 1  In the refrigerator."}, {"url": "https://answers.yahoo.com/question/index?qid=20060911154353AAu5DmJ", "passage_text": "Report Abuse. thawed meat should be cooked within 3-4 days of defrosting, unless its fish and then cook it asap. You can refreeze meat that has been thawed, as long as you first thawed it in the fridge, not the microwave or on the counter. You can refreeze the meat as long as you have thawed it in the refrigerator and not let it sit out at room temp. Source(s): wish I could rememeber what part of the Dallas Morning News I read this in! Slam64 · 9 years ago."}, {"url": "http://stilltasty.com/questions/index/184/page:2", "passage_text": "Answer: If you thawed the steaks in the refrigerator, you’ve got some time. Steak that’s been defrosted in the fridge can be safely kept for an additional 3 to 5 days in the refrigerator before cooking, says the U.S. Department of Agriculture. You also can safely refreeze the steak within that same timeframe. "}]