[{"url": "http://www.ourbabynamer.com/meaning-of-Roshni.html", "passage_text": "Roshni is generally used as a girl's name. It consists of 6 letters and 2 syllables and is pronounced Ros-hni. In the U.S. in 2014, it ranked 6135 in baby name popularity for girls with 21 occurrences. Less than 5 boys were given the name. View the Roshni Name Popularity Page to see how the popularity trend for Roshni has changed since 1880, or to compare the popularity of Roshni to other names."}, {"url": "http://www.babynology.com/meaning-roshni-f30.html", "passage_text": "List of Hindu baby names, Hindu baby boy names (male), girl names (female) & Hindu names meanings has been compiled from various resources. Please use this list of Hindu baby names only for reference/idea to name your kid/child. Database of baby names has been compiled from various references and suggestions provided by our web site visitors and resources partners. Meaning of Roshni in Hindu origin/culture for Girl name with history and fame detail"}, {"url": "http://www.meaning-of-names.com/muslim-names/roshni.asp", "passage_text": "Meaning of Roshni. Muslim name. In Muslim, the name Roshni means-Light.. Other origins for the name Roshni include-Muslim, Indian.The name Roshni is most often used as a girl name or female name. Muslim Name Meaning-Light"}, {"url": "http://www.babynamespedia.com/meaning/Roshni", "passage_text": "[ syll. ros-hni, ro-sh-ni ] The baby girl name Roshni is pronounced R OW-SHNiy †. Roshni has its origins in the Old Persian and Sanskrit languages. From Sanskrit roots, its meaning is 'brighteners'. Roshni is a variant of Roshan (Indian, Iranian, and Urdu). Roshni is not widely used as a baby name for girls. It is not listed within the top 1000 names. Baby names that sound like Roshni include Roshnee, Roshney, Roshnie, Roshny, Ra'naa, Rachna (Indian), Raegan (English), Ragan, Ragen, Ragene, Raggan, Rajnee, Rajney, Rajni, Rajnie, Rajny, Rakkon, Rakon, Rashane, and Rashaun."}, {"url": "http://www.ourbabynamer.com/meaning-of-Roshni.html", "passage_text": "Indian names or Hindu names are listed in Our Baby Namer under Indian, Hindi and Sanskrit. Other names which may be used my Muslim Indians would be listed under Arabic or Iranian names. Indian names generally contain a given name followed by some number of secondary names. In the U.S. in 2014, it ranked 6135 in baby name popularity for girls with 21 occurrences. Less than 5 boys were given the name. View the Roshni Name Popularity Page to see how the popularity trend for Roshni has changed since 1880, or to compare the popularity of Roshni to other names."}, {"url": "http://www.ourbabynamer.com/meaning-of-Roshni.html", "passage_text": "Then just follow the diagram below. Just for fun, see the name Roshni in Hieroglyphics, learn about ancient Egyptian Hieroglyphics and write a Hieroglyphic message. Learn about nautical flags and see your name or message written in nautical flags, on the Roshni in Nautical Flags page. In the U.S. in 2014, it ranked 6135 in baby name popularity for girls with 21 occurrences. Less than 5 boys were given the name. View the Roshni Name Popularity Page to see how the popularity trend for Roshni has changed since 1880, or to compare the popularity of Roshni to other names."}]