[{"url": "http://time.com/3506707/peace-love-music-and-mud-life-at-woodstock/", "passage_text": "If we are going to make it, you had better remember that the guy next to you is your brother.” Everybody remembered. Woodstock made it. The original plan was for an outdoor rock festival, “three days of peace and music” in the Catskill village of Woodstock. What the young promoters got was the third largest city in New York state, population 400,000 (give or take 100,000), location Max Yasgur’s dairy farm near the town of White Lake"}, {"url": "http://www.history.com/this-day-in-history/woodstock-begins-in-upstate-new-york", "passage_text": "The Woodstock Music and Art Fair, “An Aquarian Exposition,” opens at Max Yasgur’s dairy farm in upstate New York. Promoters expected the music festival, modeled after the famous Monterey Pop Festival, to attract up to 200,000 for the weekend, but nearly a half a million people converged on the concert site. On Aug. 12, 1994, the much-publicized Woodstock II music festival takes place in Saugerties, New York, near the site of the legendary Woodstock concert of 1969. An estimated 300,000 people attended the event, marked—as was the original—by bad weather and pervasive mud."}, {"url": "http://traveltips.usatoday.com/state-parks-near-woodstock-georgia-38124.html", "passage_text": "Red Top Mountain State Park is located outside of Woodstock, in Cartersville. The park is located on the shores of Lake Allatoona, which covers 12,000 acres. The park offers a large marina, over 12 miles of walking and biking trails as well as scenic picnic areas and it's own miniature golf course. Woodstock, Georgia, a suburb of Atlanta, is located in Cherokee County and is considered to be one of Atlanta's fastest-growing suburbs."}, {"url": "http://traveltips.usatoday.com/state-parks-near-woodstock-georgia-38124.html", "passage_text": "Sweetwater Creek State Park is another state park located outside of Woodstock in the town of Lithia Springs. The park, covers an expansive 2,549 acres of land and also contains the 215-acre George Sparks Reservoir, which affords fishing, boating and canoeing. Woodstock, Georgia, a suburb of Atlanta, is located in Cherokee County and is considered to be one of Atlanta's fastest-growing suburbs."}, {"url": "http://traveltips.usatoday.com/state-parks-near-woodstock-georgia-38124.html", "passage_text": "Amicalola Falls State Park is about an hour from Woodstock, in Dawsonville. It is one of Georgia's most visited state parks. Located on the foothills of the Chattahoochee National Forest, the park covers 829 acres and features a 729-foot waterfall--the tallest cascading waterfall east of the Mississippi. Woodstock, Georgia, a suburb of Atlanta, is located in Cherokee County and is considered to be one of Atlanta's fastest-growing suburbs."}, {"url": "https://en.wikipedia.org/wiki/Woodstock", "passage_text": "It was held at Max Yasgur 's 600-acre (240 ha; 0.94 sq mi) dairy farm in the Catskills near the hamlet of White Lake in the town of Bethel, New York, from August 15 to 18, 1969. Bethel, in Sullivan County, is 43 miles (69 km) southwest of the town of Woodstock, New York, in adjoining Ulster County. During the sometimes rainy weekend, 32 acts performed outdoors before an audience of 400,000 people. It is widely regarded as a pivotal moment in popular music history. The original venue plan was for the festival to take place in Woodstock, New York possibly near the proposed recording studio site owned by Alexander Tapooz. After local residents quickly shot down that idea, Lang and Kornfeld thought they had found another possible location in Saugerties, New York."}, {"url": "http://traveltips.usatoday.com/state-parks-near-woodstock-georgia-38124.html", "passage_text": "Overview. Woodstock, Georgia, a suburb of Atlanta, is located in Cherokee County and is considered to be one of Atlanta's fastest-growing suburbs. Although it is located just 30 miles outside of downtown Atlanta, Woodstock is rich with many outdoor recreational areas and is in close proximity to several state parks. Woodstock, Georgia, a suburb of Atlanta, is located in Cherokee County and is considered to be one of Atlanta's fastest-growing suburbs"}, {"url": "https://en.wikipedia.org/wiki/Woodstock,_New_York", "passage_text": "Woodstock is a town in Ulster County, New York, United States. The population was 5,884 at the 2010 census, down from 6,241 at the 2000 census. Woodstock is in the northern part of the county, northwest of Kingston, and lies within the borders of the Catskill Park. A series of Woodstock Sound-Outs were staged at Pan Copeland's Farm just over the town line in Saugerties from 1967 to 1970. These featured folk and rock acts like Richie Havens, Paul Butterfield, Dave van Ronk and Van Morrison and were identified with Woodstock's reputation as a summer arts colony."}]