[{"url": "http://www.ehow.com/info_12010846_much-money-school-resource-officer-make.html", "passage_text": "Police Officer Salary. The average annual salary of a police officer as of May 2010 was $55,620 per year, or $26.74 per hour, according to the Bureau of Labor Statistics. The 10th percentile made up to $31,700 per year, or $15.74 per hour, and the 25th percentile made up to $40,830 per year, or $19.63 per hour."}, {"url": "http://learn.org/articles/How_Much_Does_a_Police_Officer_Make.html", "passage_text": "PayScale.com reported that police officers with less than a year of experience made $28,534-$57,325 as of January 2014. With 1-4 years of experience, officers made higher earnings of $29,443-$61,727, and with 5-9 years of experience, they made $31,820 $78,346."}, {"url": "http://www.access2knowledge.org/jobs-education/how-much-do-police-officers-make/", "passage_text": "How much does a police officer make? According to the U.S. Bureau of Labor Statistics, the 632,000 police and law enforcement officers employed in the United States earn an annual mean police officer salary of $57,770, which is equivalent to an average hourly wage of $27.78."}, {"url": "http://work.chron.com/much-money-police-officer-make-weekly-7363.html", "passage_text": "Police officers reported an average yearly salary of $56,260, or $27.05 an hour, as of 2011, according to the Bureau of Labor Statistics. This works out to average weekly pay of about $1,082. Their median salary was $54,230, or about $1,043 a week. State police reported the highest earnings in 2011, averaging $60,650, or about $1,166 a week. By comparison, police officers employed by local governments reported an average of $1,080 a week, and federal police officers earned an average of $994 a week."}, {"url": "http://work.chron.com/much-money-police-officer-make-weekly-7363.html", "passage_text": "Police officers in the Northeast and West reported some of the highest average earnings in the U.S. in 2011. New Jersey ranked first, with an average annual salary of $81,970, or about $1,576 a week. California was second, where officers earned an average of $1,515 a week."}, {"url": "http://work.chron.com/much-money-average-police-highway-patrol-officer-make-6598.html", "passage_text": "As of 2011, police and highway patrol officers earned an average of $27.05 an hour and $56,260 a year. Half of all police and highway patrol officers made between $19.77 and $33.65 an hour and between $41,110 and $69,990 a year, according to the Bureau of Labor Statistics."}, {"url": "http://work.chron.com/much-money-average-police-highway-patrol-officer-make-6598.html", "passage_text": "Pay by Employer. The average salary for local police officers was $56,160 a year as of 2011. Police officers employed by the federal government earned less, averaging $51,690 a year. State police and highway patrol officers reported the highest earnings, with an average of $60,650 a year."}]