[{"url": "http://www.isciencetimes.com/articles/6424/20131127/cats-recognize-owners-voice-choose-to-not-respond.htm", "passage_text": "Cat owners, you're right: your pet does recognize your voice. She's just choosing not to respond. (Photo: zaimoku_woodpile). Unlike dogs, who, with just a bit of training, can be taught to come gallivanting when their owner calls, cats, as any cat owner will tell you, cannot be bothered. You can beg, plead, or even wave treats in a cat's general direction, but far too often human exhortations fall on deaf cat ears"}, {"url": "http://www.independent.co.uk/news/science/cats-recognise-their-owners-voices-but-never-evolved-to-care-says-study-8966580.html", "passage_text": "However, it's unlikely that this will dismay cat owners (or indeed, be of any surprise) and the paper notes that although “dogs are perceived by their owners as being more affectionate than cats […] dog owners and cat owners do not differ significantly in their reported attachment level to their pets”. Cats recognise their owners' voices but never evolved to care, says study. Japanese researchers tested cats' reactions to their owners, suggesting that because cats domesticated themselves they never needed to take notice."}, {"url": "http://www.independent.co.uk/news/science/cats-recognise-their-owners-voices-but-never-evolved-to-care-says-study-8966580.html", "passage_text": "A new study from the University of Tokyo has confirmed this, showing that although pet cats are more than capable of recognising their owner’s voice they choose to ignore them-for reasons that are perhaps rooted in the evolutionary history of the animal. Cats recognise their owners' voices but never evolved to care, says study. Japanese researchers tested cats' reactions to their owners, suggesting that because cats domesticated themselves they never needed to take notice."}, {"url": "http://www.independent.co.uk/news/science/cats-recognise-their-owners-voices-but-never-evolved-to-care-says-study-8966580.html", "passage_text": "“These results indicate that cats do not actively respond with communicative behavior to owners who are calling them from out of sight, even though they can distinguish their owners’ voices,” write Saito and Shinozuka. “This cat–owner relationship is in contrast to that with dogs.”. Cats recognise their owners' voices but never evolved to care, says study. Japanese researchers tested cats' reactions to their owners, suggesting that because cats domesticated themselves they never needed to take notice."}, {"url": "http://blogs.discovermagazine.com/seriouslyscience/2013/12/10/contrary-cats-believe-recognize-voice/", "passage_text": "There are those of us who believe that our cats love us, and then there are these scientists, who questioned whether cats can even recognize the sounds of their owners’ voices. In this study, they wanted to determine whether a cat was responding specifically to its owner’s voice (rather than just any old voice). "}, {"url": "http://www.careyscats.com/qa/do-cats-know-their-owners/", "passage_text": "Many people have this notion that cats are opportunistic animals…that these pets would only follow people that provide them with a regular supply of food. Non-cat lovers believe that cats would not care what happened to their caretakers precisely because these animals do not know their owners. These theories can’t be farther from the truth. Cats surely know their owners. Cats may not show it but these pets love their owners deeply"}, {"url": "http://www.smithsonianmag.com/smart-news/cats-recognize-their-owners-voice-but-choose-to-ignore-it-180948087/", "passage_text": "Cats, according to new research, recognize their owner's voice. They just can't be bothered to react to it. Researchers in Japan arrived at this conclusion after performing experiments with twenty house cats. They played recordings of the cats' owners' calling to their pets in whatever cat-talk voice they typically used."}, {"url": "http://www.dailymail.co.uk/sciencetech/article-2349770/Cats-really-CAN-understand-owners-voices--just-act-aloof-form-survival.html", "passage_text": "It involved recordings of strangers, as well as of the cats' owners, but that cats could not see who was speaking to them. Cats can distinguish their owner's voices from those of other people-implying that they do pay attention when spoken to. The researchers found that cats responded to voices by moving their heads and/or ears nearer the person who was speaking to them. Or, when the cats detected a familiar voice, they also had dilated pupils, which can signal emotions such as excitement, Discovery News reported. These reactions were more likely to occur when the cats heard their owners voices or when they became increasingly familiar with strangers' voices."}, {"url": "http://www.careyscats.com/qa/do-cats-know-their-owners/", "passage_text": "People that have never owned cats have this mistaken notion that cats don’t even know their owners. Cats only stay with humans as the caretaker is viewed as a meal ticket especially when hunting is nil. People may have a reason for believing so. Non-cat lovers believe that cats would not care what happened to their caretakers precisely because these animals do not know their owners. These theories can’t be farther from the truth. Cats surely"}, {"url": "http://www.dailymail.co.uk/sciencetech/article-2349770/Cats-really-CAN-understand-owners-voices--just-act-aloof-form-survival.html", "passage_text": "comments. They are often considered to be more aloof than their canine counterparts, but cats really can understand their owners' voices, a study has claimed. Japanese researchers have found that cats can distinguish their owners' voices from those of other people-implying that they do pay attention when spoken to. Or, when the cats detected a familiar voice, they also had dilated pupils, which can signal emotions such as excitement, Discovery News reported. These reactions were more likely to occur when the cats heard their owners voices or when they became increasingly familiar with strangers' voices."}]