[{"url": "https://en.wikipedia.org/wiki/London", "passage_text": "The city's metropolitan area is one of the most populous in Europe with 13,879,757 inhabitants, while the Greater London Authority states the population of the city-region (covering a large part of south east England) as 22.7 million. London was the world's most populous city from around 1831 to 1925. It is the world's most-visited city as measured by international arrivals and has the world's largest city airport system measured by passenger traffic. London is the world's leading investment destination, hosting more international retailers and ultra high-net-worth individuals than any other city."}, {"url": "https://en.wikipedia.org/wiki/London", "passage_text": "London's ancient core, the City of London, largely retains its 1.12-square-mile (2.9 km 2) medieval boundaries and in 2011 had a resident population of 7,375, making it the smallest city in England. Since at least the 19th century, the term London has also referred to the metropolis developed around this core. It is the world's most-visited city as measured by international arrivals and has the world's largest city airport system measured by passenger traffic. London is the world's leading investment destination, hosting more international retailers and ultra high-net-worth individuals than any other city."}, {"url": "https://en.wikipedia.org/wiki/London", "passage_text": "The 2011 census recorded that 2,998,264 people or 36.7% of London's population are foreign-born making London the city with the second largest immigrant population, behind New York City, in terms of absolute numbers. The table to the right shows the most common countries of birth of London residents. It is the world's most-visited city as measured by international arrivals and has the world's largest city airport system measured by passenger traffic. London is the world's leading investment destination, hosting more international retailers and ultra high-net-worth individuals than any other city."}, {"url": "http://www.ons.gov.uk/ons/taxonomy/index.html?nscl=Population", "passage_text": "Mid-year population estimates for the UK 2014. The latest ONS analysis shows that the population of the UK was 64,596,800, up 0.77% since 2013. Births in England and Wales, 2013 Infographic on ONS birth statistics, with data on stillbirths, fertility rates and the average age of mothers. "}, {"url": "http://www.sln.org.uk/geography/Documents/Glossaries/Glossary%20for%20Population%20Change2.doc", "passage_text": "Density of population the number of people per unit of area, usually km2 Dependency ratio Shows how many young people aged fewer than 16 and older people over 65 depend on people of working age. It is worked out by the % of people aged fewer than 15, plus the % over 65, divided by the % aged 15-64. "}, {"url": "https://en.wikipedia.org/wiki/London", "passage_text": "London has a diverse range of peoples and cultures, and more than 300 languages are spoken within Greater London. The Office for National Statistics estimated its mid-2014 population to be 8,538,689, the largest of any municipality in the European Union, and accounting for 12.5 percent of the UK population. It is the world's most-visited city as measured by international arrivals and has the world's largest city airport system measured by passenger traffic. London is the world's leading investment destination, hosting more international retailers and ultra high-net-worth individuals than any other city."}, {"url": "https://en.wikipedia.org/wiki/Conurbation", "passage_text": "Greater Montreal (Quebec) [edit]. Greater Montreal is Canada's 2nd largest conurbation, with Statistics Canada defining the Census Metropolitan Area (CMA) as 4,258.31 square kilometres (1,644.14 sq mi) and a population of 3,824,221 as of 2011, which represents almost half of the population of the province of Quebec. The Taiheiyō Belt is the largest conurbation in Japan in every term, extending from Ibaraki Prefecture to Fukuoka Prefecture, running almost 1,200 km, with the total population of 82.9 million."}, {"url": "https://en.wikipedia.org/wiki/Conurbation", "passage_text": "A conurbation is a region comprising a number of cities, large towns, and other urban areas that, through population growth and physical expansion, have merged to form one continuous urban and industrially developed area. The Taiheiyō Belt is the largest conurbation in Japan in every term, extending from Ibaraki Prefecture to Fukuoka Prefecture, running almost 1,200 km, with the total population of 82.9 million."}, {"url": "http://www.tshe.org/ea/pdf/vol3%20no2%20p123-128.pdf", "passage_text": "2. Study area and Methods The study was conducted in Kuala Lumpur city, Malaysia. The total land area of the city is 243.7 km 2 (24,221.05 hectare), which is 100% urban area. It had a population of 1,556,200 people in year 2005 with an average population density of 64 persons per hectare. Data of ambient air quality, population, landuses and trafﬁc volume had been collected from various public authorities and documents."}]