[{"url": "http://costowl.com/home-improvement/electric-bathroom-fan-cost.html", "passage_text": "It depends on how handy you are. It will cost $200 to $400 for an electrician/handyman to install a bathroom fan. Where you fall on the cost spectrum will depend mostly on location of the fan in the home and how difficult it will be to set up exhaust vent. The more complicated that is the more it will cost. © 2015 CostOwl.com. It will cost $85 to $125 to replace a bathroom exhaust fan. You will need to hire an electrician to wire the unit. If all he needs to do is replace the actual unit you it will be a minor project and take an hour or less. If he needs to perform minor construction for venting it will cost more."}, {"url": "http://www.homeadvisor.com/cost/bathrooms/install-a-bath-fan/", "passage_text": "The largest single cost of installing a new bathroom fan is the price of the fan itself. How much that costs will depend entirely on how elaborate you want to get. You can install a small simple exhaust fan that has no extras and gets the job done to adequately ventilate your bathroom. "}, {"url": "http://home.costhelper.com/exhaust-fans.html", "passage_text": "1 Many kitchen exhaust fans are part of a range hood, which can cost $30-$4,500, depending on size, type and cfm; installation adds another $250-$1,500, depending on whether the project is simply connecting and hanging the range hood, or if new metal ductwork must be installed to exhaust the air outdoors. 1 A bathroom fan typically costs $15-$50 for a basic 50-70 cfm model with no extra features and a high noise level (3.0 to 8.0 sones). 2  For example, the Broan Model 671 Ceiling and Wall Mount Bathroom Fan with 70 cfm and 6.0 sones costs $25-$53."}, {"url": "http://www.diyornot.com/Project.aspx?ndx2=4&Rcd=50", "passage_text": "Compare the cost to install a bathroom light with vent and fan by doing it yourself with the labor and material cost of hiring an electrician and learn how to plan the job and what steps are involved. "}, {"url": "http://www.homewyse.com/services/cost_to_install_bathroom_fan.html", "passage_text": "Get an INSTANT estimate of the cost to Install a Bathroom Fan! Our free calculator uses recent, trusted data to estimate costs for your Bathroom Fan Installation project. For a basic 1 fan project in zip code 47474, the benchmark cost to Install a Bathroom Fan ranges between $145.91 - $373.32 per fan. To estimate costs for your project: 1"}, {"url": "http://www.kompareit.com/homeandgarden/electrical-install-bathroom-fan.html", "passage_text": "1 The fan itself can cost anywhere from about $30 to $400, depending on features. 2  A basic, single-speed fan without a light or heater falls on the low end of that range. 3  On the high end, you’ll get a top-of-the-line model with a light, a heater, variable speeds and more. 4  Installation generally costs $200 to $400. Cost of Having a Bathroom Fan Installed. The total cost depends on the type of fan you choose, the difficulty of installation and local labor rates. 1  The fan itself can cost anywhere from about $30 to $400, depending on features. 2  A basic, single-speed fan without a light or heater falls on the low end of that range."}, {"url": "http://home.costhelper.com/exhaust-fans.html", "passage_text": "1 Expect to pay $30-$150 for a bathroom fan with 50-130 cfm plus a simple light fixture or an infrared heater (generally not both), and a few models in this range may qualify for the Energy Star efficiency rating. 2  For example, the Air King AK80 with 80 cfm and 1.5 sones is Energy Star-rated and costs $88-$121. 1 A bathroom fan typically costs $15-$50 for a basic 50-70 cfm model with no extra features and a high noise level (3.0 to 8.0 sones). 2  For example, the Broan Model 671 Ceiling and Wall Mount Bathroom Fan with 70 cfm and 6.0 sones costs $25-$53."}, {"url": "http://www.howmuchisit.org/cost-install-bath-exhaust-fan/", "passage_text": "1 For the bathroom exhaust fan alone, the costs can be within the $25 to $65 range, depending upon the features and brand you want. 2  According to one user on the forum DSLReports.com, most basic jobs will cost $200, and a complicated job that requires the contractor to crawl in the attic can cost upwards of $450. 1 According to one user on the forum DSLReports.com, most basic jobs will cost $200, and a complicated job that requires the contractor to crawl in the attic can cost upwards of $450. 2  RedBeacon.com states that the average job is $152 to $330 to have a bathroom fan installed in the United States."}]