[{"url": "http://www.sheet-metal-roofing.com/install-metal-roofing-over-asphalt-shingles.html", "passage_text": "3. Be sure of the ventilation. According to the installation guide for metal roofing, it is also important to make sure that there is enough or proper ventilation before you install metal roofing over asphalt shingles."}, {"url": "http://www.sheet-metal-roofing.com/install-metal-roofing-over-asphalt-shingles.html", "passage_text": "If these are present in the old shingle, you have to replace or remove the old one so that the new metal roofing will be installed over smooth and flat surfaces. It is also important to check the number of asphalt shingle layers on the roof."}, {"url": "https://www.metalroofingsource.com/install-metal-roof-over-shingles/", "passage_text": "Metal roofing weighs less than one pound per square foot. Asphalt shingles can weigh up to four pounds per square foot depending on the brand. If you don’t want to take our word for it check with your local building department. In some areas building officials only allow a re-roof over one layer of shingles."}, {"url": "http://tricountymetals.com/can-you-install-metal-roofing-over-shingles/", "passage_text": "The second way to install a metal roof over a shingle roof is with the use of purlins or battens. The purlins are screwed or nailed down to the roof deck, depending on how the metal roofing manufacture has testing for their roofing panels, and then the metal is installed to the purlins."}, {"url": "http://www.metalroofing.com/v2/forums/index.cfm?action=mboard.members.viewmessages&ForumTopicID=3829&ForumCategoryID=44", "passage_text": "Briefly I want to install metal shingle roof over two layers of old aspalt shingles on my cottage. Roof slope is 3:12 and there is no attic. Would it make sense to add foam insulation between old roof and new metal shingles to keep house cooler in a summer."}, {"url": "http://www.unioncorrugating.com/installs-over-existing.html", "passage_text": "Metal roofs have the best strength to weight ratio of any roofing material, allowing metal roofs to be installed over existing asphalt shingle roofs without the need to add structural support to the roof. Union's steel roofing panels weigh 50% to 65% less per square foot than most asphalt roofing shingles."}, {"url": "http://www.qualitysmith.com/request/article/install-a-metal-roof-over-shingles/", "passage_text": "Even when a proper ventilation plan is in place, you may not be able to install a metal roof over shingles if your local building codes will not allow it. Many local codes forbid this type of installation, because the weight of the metal roof in addition to the existing shingle roof is too great."}, {"url": "http://www.wikihow.com/Install-Asphalt-Shingles", "passage_text": "Measure the length of a shingle as it lies across the roof. This will help determine how the shingles will lay on the roof width. Most asphalt shingles are 3 feet (91.4 centimeters) in length. If your roof's width is not an even multiple of the shingle's length, you will have a partial piece on one end of each row."}, {"url": "http://www.qualitysmith.com/request/article/install-a-metal-roof-over-shingles/", "passage_text": "A metal roof is an alternative to asphalt shingles. In some instances, it can be installed over an existing shingle roof. If you decide to install a metal roof over shingles, you should be aware that if you have multiple layers of shingles to cover, the application may not work."}]