[{"url": "http://www.upi.com/topic/Miranda_Lambert/", "passage_text": "Lambert has also been honored by the Grammy Awards, the Academy of Country Music Awards, and the Country Music Association Awards. Miranda Leigh Lambert was born November 10, 1983 in Longview, Texas and raised in Lindale, Texas. Blake Shelton, Miranda Lambert intend to 'move on as friends' 2 months ago LOS ANGELES, July 30 (UPI) -- Reports say Blake Shelton and Miranda Lambert want to move on as friends after a friendly Twitter exchange raised suspicion."}, {"url": "http://www.biography.com/people/miranda-lambert-369610", "passage_text": "Miranda Leigh Lambert was born on November 10, 1983, in Longview, Texas. When she was in her 20s, Miranda Lambert emerged as one of country music's rising stars. She grew up in Lindale, a small town where her parents ran a private detective agency. Miranda Lambert was born on November 10, 1983, in Longview, Texas. Her family helped to finance her first recording in 2001. Lambert later became a contestant on Nashville Star. She finished as second runner-up, but landed a contract with Sony Music. Her major label debut album Kerosene (2005) went platinum"}, {"url": "http://www.emusic.com/artist/miranda-lambert/12276025/", "passage_text": "We’re sorry. All Music Guide: Before becoming one of country music's most popular females, songwriter Miranda Lambert grew up in Lindale, Texas, a small town 80 miles east of Dallas. The daughter of a country guitarist (Rick Lambert) and a detective agency owner, she was raised in a house dedicated to country music. Lambert began entering country talent contests when she was 16, including an appearance with the Johnny High Country Music Review in Arlington, Texas. "}, {"url": "http://theboot.com/tags/blake-shelton/", "passage_text": "Blake Shelton. Blake Shelton was born and raised in Ada, Okla., the youngest of three children. His parents, Richard and Dorothy Shelton, divorced when he was nine, and when Shelton was 14, his older brother Richie was killed in a car accident"}, {"url": "http://hollowverse.com/miranda-lambert/", "passage_text": "Miranda Lambert was born in Longview, Texas, and was raised in Lindale, Texas. Lambert often wears a crucifix around her neck, re-tweets Christiany things from televangelists, and sings about God. "}, {"url": "https://itunes.apple.com/us/artist/miranda-lambert/id18732261", "passage_text": "Her status was also elevated by her marriage to fellow country star Blake Shelton in 2011, the same year he landed a starring role on NBC's televised singing competition The Voice and broke into the pop mainstream via his single Honey Bee.. Soon, Lambert and Shelton were gossip favorites but Miranda kept working hard. "}, {"url": "http://tasteofcountry.com/miranda-lambert-pink-pistol-stores/", "passage_text": "Lambert — who has admitted that her husband Blake Shelton is jealous of her ‘big pink baby’ — announced via Facebook that she’s going to set up shop in Lindale, Texas, where she was born and raised. Lambert’s first Pink Pistol store in Tishomingo, Okla. opened its doors a little over a year ago. The venture began as a way to keep the singer busy when not on tour, and with the addition of another storefront, it’s clear that Lambert is having lots of fun with her store."}, {"url": "http://tasteofcountry.com/miranda-lambert-pink-pistol-stores/", "passage_text": "Speaking of home…. the Pink Pistol Texas is coming to Lindale! I was born & raised in East Tx, so it’s only fitting that we have Pink Pistol Texas there! Grand opening is Oct. 12-13!”. Lambert’s first Pink Pistol store in Tishomingo, Okla. opened its doors a little over a year ago. The venture began as a way to keep the singer busy when not on tour, and with the addition of another storefront, it’s clear that Lambert is having lots of fun with her store."}]