[{"url": "https://en.wikipedia.org/wiki/Carbon_cycle", "passage_text": "The carbon cycle is the biogeochemical cycle by which carbon is exchanged among the biosphere, pedosphere, geosphere, hydrosphere, and atmosphere of the Earth. Along with the nitrogen cycle and the water cycle, the carbon cycle comprises a sequence of events that are key to making the Earth capable of sustaining life; it describes the movement of carbon as it is recycled and reused throughout the biosphere. The global carbon budget."}, {"url": "http://www.merriam-webster.com/dictionary/carbon%20cycle", "passage_text": "Definition of CARBON CYCLE. 1. : the cycle of carbon in the earth's ecosystems in which carbon dioxide is fixed by photosynthetic organisms to form organic nutrients and is ultimately restored to the inorganic state (as by respiration, protoplasmic decay, or combustion). 2"}, {"url": "http://teeic.indianaffairs.gov/er/carbon/carboninfo/cycle/", "passage_text": "It takes many forms and moves through the environment via the carbon cycle. The carbon cycle is the circulation and transformation of carbon back and forth between living things and the environment. Carbon is an element, something that cannot be broken down into a simpler substance. The carbon dioxide is converted into carbon compounds that make up the body of the plant, which are stored in both the aboveground parts of the plants (shoots and leaves), and the belowground parts (roots). In the next step, animals eat the plants, breath in the oxygen, and exhale carbon dioxide."}, {"url": "http://www.earthobservatory.nasa.gov/Features/CarbonCycle/page3.php", "passage_text": "The Fast Carbon Cycle. The time it takes carbon to move through the fast carbon cycle is measured in a lifespan. The fast carbon cycle is largely the movement of carbon through life forms on Earth, or the biosphere. Between 10 15 and 10 17 grams (1,000 to 100,000 million metric tons) of carbon move through the fast carbon cycle every year. "}, {"url": "http://www.cotf.edu/ete/modules/carbon/efcarbon.html", "passage_text": "Carbon Cycle The movement of carbon, in its many forms, between the biosphere, atmosphere, oceans, and geosphere is described by the carbon cycle, illustrated in the adjacent diagram. The carbon cycle is one of the biogeochemical cycles. In the cycle there are various sinks, or stores, of carbon (represented by the boxes) and processes by which the various sinks exchange carbon (the arrows)."}, {"url": "https://eo.ucar.edu/kids/green/cycles6.htm", "passage_text": "The Carbon Cycle. All living things are made of carbon. Carbon is also a part of the ocean, air, and even rocks. Because the Earth is a dynamic place, carbon does not stay still. It is on the move! In the atmosphere, carbon is attached to some oxygen in a gas called carbon dioxide. Plants use carbon dioxide and sunlight to make their own food and grow. The carbon becomes part of the plant. Plants that die and are buried may turn into fossil fuels made of carbon like coal and oil over millions of years."}, {"url": "http://study.com/academy/lesson/what-is-the-carbon-cycle-diagram-process-definition.html", "passage_text": "The carbon cycle is the process by which carbon moves from the atmosphere into the Earth and its organisms and then back again. Gain a deeper understanding of how the carbon cycle works in this lesson. The carbon cycle is essentially nature's way of reusing carbon atoms in different ways and in varying places. It is the process in which carbon travels from the atmosphere into organisms and the Earth and then back into the atmosphere."}, {"url": "http://www.thefreedictionary.com/carbon+cycle", "passage_text": "carbon cycle-the organic circulation of carbon from the atmosphere into organisms and back again. biological process, organic process-a process occurring in living organisms. The continuous process by which carbon is exchanged between organisms and the environment. Carbon dioxide is absorbed from the atmosphere by plants and algae and converted to carbohydrates by photosynthesis."}, {"url": "http://study.com/academy/lesson/what-is-the-carbon-cycle-diagram-process-definition.html", "passage_text": "The carbon cycle is the process in which carbon travels from the atmosphere into organisms and the Earth and then back into the atmosphere. Plants take carbon dioxide from the air and use it to make food. Animals then eat the food and carbon is stored in their bodies or released as CO2 through respiration. The carbon cycle is essentially nature's way of reusing carbon atoms in different ways and in varying places. It"}]