[{"url": "http://www.autoblog.com/tag/chery/", "passage_text": "The move comes almost a year after Chery hired James Hope from the General Motors Exterior Design Studio in Russelsheim, Germany to be its corporate director of design."}, {"url": "http://www.cheryinternational.com/", "passage_text": "Different Chery. Every car born in Chery is created by the existing design team of Chery. Chery Design covers four sections, Proportion, Branding, Design Language and Quality, each ingeniously infused with Chinese elements."}, {"url": "https://en.wikipedia.org/wiki/Chery", "passage_text": "Chery Automobile Co., Ltd. , trading as Chery (/ˈʃɛri/) and sometimes known by the pinyin transcription of its Chinese name, Qirui, is a Chinese automobile manufacturing company headquartered in Wuhu, Anhui Province, China. It was founded by the Government of China in 1997 and is a state-owned corporation."}, {"url": "http://www.carsguide.com.au/car-reviews/chinese-chery-j1-j11-j3-review-10466", "passage_text": "Chery J1 Chery J1 Chery J1 Chery J3 hatchback Chery J11 Chery J11 SUV Chery J11 Chery J11 SUV Chery J11 SUV Chery J1 Chery J1 Chery J3 hatchback Chery J1. Chery is mostly state-owned by the government in WuHu and the local province, and has been in the car business since 1997."}, {"url": "http://www.cherymotors.com.au/default.asp?action=article&ID=21565", "passage_text": "About Chery. Chery is one of China s most diverse vehicle manufacturers. The company is based near the city of Wuhu in Anhui province in eastern China, and their headquarters encompasses the largest automotive laboratory in Asia. Chery has five car assembly lines, two engine plants, one transmission plant and sold over 560,000 cars in China in 2012."}, {"url": "http://www.cherymotors.com.au/default.asp?action=article&ID=21565", "passage_text": "Chery is amongst the biggest selling Chinese car brands, and for the past several years the company has ranked among the top 10 of all China based car companies, often ranking as the biggest selling brand behind Volkswagen, General Motors, Toyota and Hyundai."}, {"url": "http://www.carsguide.com.au/car-reviews/chinese-chery-j1-j11-j3-review-10466", "passage_text": "The big hurdle for Australia is safety-Chery trumpets the first four-star car in China NCAP tests-and acceptance of cars from China."}]