[{"url": "http://www.indeed.com/salary/admissions-representative.html", "passage_text": "Average admissions representative salaries for job postings nationwide are 38% lower than average salaries for all job postings nationwide. "}, {"url": "http://www1.salary.com/GA/Atlanta/Admissions-Representative-Higher-Ed-salary.html", "passage_text": "Categories: Education. Similar Job Titles: This chart describes the expected percentage of people who perform the job of Admissions Representative-Higher Ed. in Atlanta, GA that make less than that salary. For example 50% of the people who perform the job of Admissions Representative-Higher Ed. in Atlanta are expected to make less than the median. Our team of Certified Compensation Professionals has analyzed survey data collected from thousands of HR departments at employers of all sizes and industries on"}, {"url": "http://www1.salary.com/Admissions-Representative-Higher-Ed-salary.html", "passage_text": "For example the median expected annual pay for a typical Admissions Representative-Higher Ed. in the United States is $38,022 so 50% of the people who perform the job of Admissions Representative-Higher Ed. in the United States are expected to make less than $38,022. Source: HR Reported data as of October 2015. Job Description for Admissions Representative-Higher Ed. Responsible for recruiting prospective students. Leads college/university information sessions and coordinates campus tours for students and parents. Provides guidance throughout the admissions process."}, {"url": "http://www1.salary.com/Admissions-Representative-Higher-Ed-salary.html", "passage_text": "The annual salary for someone with the job title Admissions Representative-Higher Ed. may vary depending on a number of factors including industry, company size, location, years of experience and level of education. Job Description for Admissions Representative-Higher Ed. Responsible for recruiting prospective students. Leads college/university information sessions and coordinates campus tours for students and parents. Provides guidance throughout the admissions process."}, {"url": "http://www.payscale.com/research/US/Employer=ITT_Technical_Institute/Salary", "passage_text": "Respondents who have been working for five to nine years make about $47K annually on average. Overall, the greater share of ITT Technical Institute folks have one to four years of experience and earn an average $40K per year. Compensation for ITT Technical Institute employees is around $40K annually on average. At ITT Technical Institute, the biggest piece of the paycheck puzzle is your role at the company — it impacts salary more than anything else — though geography and how long you've been working each factor into the equation as well."}, {"url": "http://www.payscale.com/research/US/Job=Admissions_Representative/Salary/ee802938/ITT-Technical-Institute", "passage_text": "(United States). The average salary for an Admissions Representative at ITT Technical Institute is $37,556 per year. Most people move on to other jobs if they have more than 10 years' experience in this field. $30,144 - $44,971. Total Pay (?XTotal Pay combines base annual salary or hourly wage, bonuses, profit sharing, tips, commissions, overtime pay and other forms of cash earnings, as applicable for this job."}, {"url": "http://www.payscale.com/research/US/Employer=ITT_Technical_Institute/Salary", "passage_text": "Read More. Based in Carmel, Ind.,educational services player ITT Technical Institute offers many employment opportunities, including Admissions Representative and Adjunct Professor positions. Compensation for ITT Technical Institute employees is around $40K annually on average. At ITT Technical Institute, the biggest piece of the paycheck puzzle is your role at the company — it impacts salary more than anything else — though geography and how long you've been working each factor into the equation as well."}, {"url": "http://www1.salary.com/GA/Atlanta/Admissions-Representative-Higher-Ed-salary.html", "passage_text": "What is the average Admissions Representative-Higher Ed. The salary for someone with the job title Admissions Representative-Higher Ed. in Atlanta, GA varies depending on a number of factors. Our team of Certified Compensation Professionals has analyzed survey data collected from thousands of HR departments at employers of all sizes and industries on"}, {"url": "http://www.indeed.com/cmp/ITT-Educational-Services-Inc./salaries", "passage_text": "The average ITT Educational Services Inc. salary ranges from approximately $20,000 per year for Adjunct Instructor to $68,000 per year for Director of Recruiting. Salary information comes from 36 data points collected directly from employees, users, and jobs on Indeed. "}]