[{"url": "http://www.gogreenacademy.com/solar-energy-cost-calculator/", "passage_text": "1 Enter your utility electricity rate in dollars per kilowatt-hour. 2  It can be found in your monthly utility bill. 3  U.S. average is $0.115/kWh. 4  Select the installation cost of the solar system per watt. 1 Select the installation cost of the solar system per watt. 2  Typical residential solar systems cost around $7 per watt. 3  Commercial systems cost less. 4  Enter your state/ local utility rebate in $ per watt."}, {"url": "http://www.nmsea.org/Curriculum/7_12/Cost/calculate_solar_cost.htm", "passage_text": "So, for example, if you use 10 kilowatt-hours a day, and the cost of power is about 10 cents per kilowatt-hour, then you electrical costs would be about $1 per day (ten times 10 cents), or $30 per month. Also, we need to know how long the sun shines each day on average. Let this be denoted by Tsun, Therefore, the upfront cost of the solar panels per watt are Costpanels = $600/75 watts = $8/watt Or, by multiplying numerator and denominator by 1000, Costpanels = $600/75 watts = $8000/kilo-watt. As determined from a survey of current market prices, it costs about $600 to purchase and install a 75 watt panel."}, {"url": "http://michaelbluejay.com/electricity/solar.html", "passage_text": "An $18,000 system ($12,600 after the tax credit) that produces 3800 kWh a year in a windy place with 12mph avg. windspeed will produce 76,000 kWh over its 20-year life, for a cost of $0.17 per kWh. That's much more than grid energy, and way more than solar. If you use 900 kWh/mo., that's 900 kWh / 30.4 days per month = 29.6 kWh/day. Figure how many kWh you need to generate each hour. From the map above you can see that if you live in a yellow area that you'll get 5 to 6 hours of peak sun per day on average."}, {"url": "http://www.gogreenacademy.com/solar-energy-cost-calculator/", "passage_text": "Instructions: 1  Enter your monthly energy consumption in kWh. 2  Enter your utility electricity rate in dollars per kilowatt-hour. 3  Select the installation cost of the solar system per watt. 4  Enter your state/ local utility rebate in $ per watt. 1 Select the installation cost of the solar system per watt. 2  Typical residential solar systems cost around $7 per watt. 3  Commercial systems cost less"}, {"url": "http://sroeco.com/solar/calculate-solar-cost/how-calculate-solar-cost/", "passage_text": "Step 2: Estimate your cost per Watt installed. Hint: If solar is popular in your state (CA, CO, NJ) and you have asphalt or composite shingles, then use $4-$6/W. If solar is less popular in your state (VA, TX, MI) and you have a tile roof, then use $6-$8/W. If you’re unsure, $5.5/W is about the National average. This calculator assumes no State or Utility rebate. Go to www.dsireusa.org to see if your area offers solar incentives. If it does, subtract it first from the Estimated System Cost. This is your total cost of installation. Then calculate the Fed Tax credit by multiplying the result by 30% (0.3)."}, {"url": "http://www.gogreenacademy.com/solar-energy-cost-calculator/", "passage_text": "1 U.S. average is $0.115/kWh. 2  Select the installation cost of the solar system per watt. 3  Typical residential solar systems cost around $7 per watt. 4  Commercial systems cost less. 1 Select the installation cost of the solar system per watt. 2  Typical residential solar systems cost around $7 per watt. 3  Commercial systems cost less. 4  Enter your state/ local utility rebate in $ per watt."}, {"url": "http://www.wikihow.com/Calculate-Kilowatt-Hours", "passage_text": "Divide the result by 1,000 to convert watts to kilowatts. So for example, if your large window fan is rated at 250 watts and you use it 5 hours a day, its kWh use per day is 250 (watts) * 5 (hours used per day) / 1,000 (to change watts into kilowatts) = 1.25 kWh per day."}, {"url": "http://sroeco.com/solar/calculate-solar-cost/how-calculate-solar-cost/", "passage_text": "How to Calculate Your Solar Cost. Hint: If solar is popular in your state (CA, CO, NJ) and you have asphalt or composite shingles, then use $4-$6/W. If solar is less popular in your state (VA, TX, MI) and you have a tile roof, then use $6-$8/W. If you’re unsure, $5.5/W is about the National average. This calculator assumes no State or Utility rebate. Go to www.dsireusa.org to see if your area offers solar incentives. If it does, subtract it first from the Estimated System Cost. This is your total cost of installation. Then calculate the Fed Tax credit by multiplying the result by 30% (0.3)."}, {"url": "http://pasolar-electric.com/cost", "passage_text": "Now the addition of battery storage will increase the cost to about $18000 for a 2KW Solar-electric System, and the larger 4KW system would cost about $36000. Next, calculate the approximate cost per kilowatt hour. Multiply the system’s minimum daily output (not its hourly capacity) by 365 to find its yearly output. "}]