[{"url": "http://www.thefreedictionary.com/fund", "passage_text": "fund. 1. a supply of money or monetary resources, as for some purpose. 2. supply; stock: a fund of knowledge. 3. funds, money immediately available; pecuniary resources. 4. an organization created to manage the resources of a monetary fund. 5. to allocate or provide funds for (a program, project, etc.). fund. The monetary resources of a government, organization, or individual.Used in plural: capital, finance (used in plural), money (often used in plural). To supply capital to or for: back, capitalize, finance, grubstake, stake, subsidize."}, {"url": "https://en.wikipedia.org/wiki/With-profits_policy", "passage_text": "A with-profits policy (Commonwealth) or participating policy (U.S.) is an insurance contract that participates in the profits of a life insurance company. The company is often a mutual life insurance company, or had been one when it began its with-profits product line. The premiums paid by with-profits and non-profit policyholders are pooled within the insurance company's life fund (Commonwealth) or general account (USA). The company uses the pooled assets to pay out claims. A large part of the life fund is invested in equities, bonds, property to aim to achieve a high overall return."}, {"url": "http://economictimes.indiatimes.com/definition/inception-date", "passage_text": "Definition of 'Inception Date'. Tweet. Inception date is the date on which the fund or policy is launched. Definition: Inception date is the date on which the fund or policy is launched."}, {"url": "http://www.ouhsc.edu/financialservices/ap/ChangeFunds.asp", "passage_text": "General. Change Funds are to be established when the requirement for such funds exists. The definition of Change Funds for the purpose of this policy is a follows: *Change Funds are used in conjunction with cash receipting activities represented by payments from clinic patients and/or other service/supply activity. "}, {"url": "https://en.wikipedia.org/wiki/Sinking_fund", "passage_text": "(October 2006). A sinking fund is a fund established by an economic entity by setting aside revenue over a period of time to fund a future capital expense, or repayment of a long-term debt. "}, {"url": "http://www.cg.sc.gov/guidanceandformsforstateagencies/Documents/CGsAPP/Fund_Definitions_Policy.pdf", "passage_text": "The fund definitions are applicable to transactional processing in the General Ledger. Other funds starting with a 6XXXXXXX are used to record Composite Account activity and other financial statement activity. 9XXXXXXX funds are used for a specific purpose by CG’s Financial Reporting team. The definition for the GASB 54 fund balance classification is listed on page 70 of the “Year-End Reporting Policies and Procedures Manual”. FUND DEFINITIONS  General Fund:  General Fund amounts are appropriated through the Appropriations Act for funds starting with 1XXXXXXX."}, {"url": "http://www.merriam-webster.com/dictionary/fund", "passage_text": "Full Definition of FUND. 1. a: a sum of money or other resources whose principal or interest is set apart for a specific objective b: money on deposit on which checks or drafts can be drawn —usually used in plural c: capital d plural: the stock of the British national debt —usually used with the. 2."}, {"url": "http://www.investopedia.com/terms/i/investment-fund.asp", "passage_text": "DEFINITION of 'Investment Fund'. A supply of capital belonging to numerous investors that is used to collectively purchase securities while each investor retains ownership and control of his or her own shares. An investment fund provides a broader selection of investment opportunities, greater management expertise and lower investment fees than investors might be able to obtain on their own. Types of investment funds include mutual funds, exchange traded funds, money market funds and hedge funds."}, {"url": "http://www.investopedia.com/terms/i/imf.asp", "passage_text": "The International Monetary Fund (IMF) is an international organization created for the purpose of standardizing global financial relations and exchange rates. The IMF generally monitors the global economy, and its core goal is to economically strengthen its member countries. Specifically, the IMF was created with the intention of: 1. Promoting global monetary and exchange stability. 2. Facilitating the expansion and balanced growth of international trade. 3. Assisting in the establishment of a multilateral system of payments for current transactions."}]