[{"url": "https://answers.yahoo.com/question/index?qid=20090805103859AARdUGe", "passage_text": "Report Abuse. None of these specifically. The RNA's are all formed from the DNA information in the genetic code. However, the RNA is not the blueprint for the DNA with one exception. That exception is viral RNA that uses reverse transcriptase to create complementary DNA which is incorporated into the host DNA. This process is used by HIV"}, {"url": "http://www.diffen.com/difference/DNA_vs_RNA", "passage_text": "1 Messenger RNA (mRNA) transcribes genetic information from the DNA found in a cell 's nucleus, and then carries this information to the cell's cytoplasm and ribosome. 2  Transfer RNA (tRNA) is found in a cell's cytoplasm and is closely related to mRNA as its helper. DNA's genes are expressed, or manifested, through the proteins that its nucleotides produce with the help of RNA. The information found in DNA determines which traits are to be created, activated, or deactivated, while the various forms of RNA do the work."}, {"url": "http://www.answers.com/Q/Which_type_of_RNA_functions_as_a_blueprint_of_the_genetic_code", "passage_text": "mRNA: Carries the genetic information from DNA to ribosome to be translated. tRNA: Carries the anticodon and amino acid to the ribosome. rRNA: Component of ribosome, assists … in protein synthesis. Those are the three main types of RNA. There are other lesser known types as well. Messenger RNA (mRNA) consists of RNA nucleotides in the form of single uncoiled chain. mRNA carries genetic information from the DNA in the nucleus to the cytosol of a eukayot … ic cell."}, {"url": "http://www.answers.com/Q/What_type_of_RNA_functions_blueprint_of_genetic_code", "passage_text": "mRNA: Carries the genetic information from DNA to ribosome to be translated. tRNA: Carries the anticodon and amino acid to the ribosome. rRNA: Component of ribosome, assists … in protein synthesis. Those are the three main types of RNA. Messenger RNA (mRNA) consists of RNA nucleotides in the form of single uncoiled chain. mRNA carries genetic information from the DNA in the nucleus to the cytosol of a eukayot … ic cell."}, {"url": "https://answers.yahoo.com/question/index?qid=20080528193247AA71A2a", "passage_text": "Messenger RNA (mRNA) The Genetic Blueprint Messenger RNA is a copy of the genetic information that was transcribed from the cell’s DNA. It is like a ‘blueprint’ of the genetic information and is brought to the ribosome and translated into protein with the help of tRNA. Molly · 7 years ago. Thumbs up. 0. b)tRNA. c)mRNA. d)RNA polymerase. i think it's mRNA. i looked through the book and it says something about blueprints but doesn't exactly state what type of RNA functions as a blueprint. so.."}, {"url": "http://chemistry.about.com/od/dnarna/f/What-Are-The-Three-Types-Of-Rna-What-Are-Their-Functions.htm", "passage_text": "Answer: There are actually several types of ribonucleic acid or RNA, but most RNA falls into one of three categories: 1  mRNA or Messenger RNA. 2  mRNA transcribes the genetic code from DNA into a form that can be read and used to make proteins. 3  rRNA or Ribosomal RNA. 4  rRNA is located in the cytoplasm of a cell, where ribosomes are found. 5  tRNA or 6  .... Lik 1 mRNA carries genetic information from the nucleus to the cytoplasm of a cell. 2  rRNA or Ribosomal RNA. 3  rRNA is located in the cytoplasm of a cell, where ribosomes are found. 4  rRNA directs the translation of mRNA into proteins."}, {"url": "http://www.weegy.com/?ConversationId=LT8XTAUS", "passage_text": "User: Which type of RNA functions as a blueprint of the genetic code? a. rRNA c. mRNA b. tRNA d. RNA polymerase Weegy: The type of RNA which functions as a blueprint of the genetic code is mRNA (messenger RNA, which is copied from DNA). Which type of RNA functions as a blueprint of the genetic code? a. rRNA c. mRNA b. tRNA d. RNA polymerase."}, {"url": "https://answers.yahoo.com/question/index?qid=20080528193247AA71A2a", "passage_text": "A blueprint of the genetic code would be a list of all three-nucleotide codons, and what amino acids (or stops) they code for. b)tRNA. c)mRNA. d)RNA polymerase. i think it's mRNA. i looked through the book and it says something about blueprints but doesn't exactly state what type of RNA functions as a blueprint. so.."}]