[{"url": "https://en.wikipedia.org/wiki/Final_Fantasy_XII", "passage_text": "Final Fantasy XII received critical acclaim, earning numerous  Game of the Year  awards in various categories from noted video game publications. Selling more than two million copies in Japan, it became the fourth best-selling PlayStation 2 game of 2006 worldwide. Final Fantasy XII was named best PlayStation 2 game and best role-playing game by numerous video game journals and websites, including GameSpot, GameSpy and IGN. Both Edge and Famitsu awarded it Game of the Year 2006."}, {"url": "https://en.wikipedia.org/wiki/Final_Fantasy_XII", "passage_text": "Final Fantasy XII (ファイナルファンタジーXII, Fainaru Fantajī Tuerubu) is a fantasy role-playing video game developed and published by Square Enix for the PlayStation 2 platform. Released in 2006, it is the twelfth title in the mainline Final Fantasy series. Final Fantasy XII was named best PlayStation 2 game and best role-playing game by numerous video game journals and websites, including GameSpot, GameSpy and IGN. Both Edge and Famitsu awarded it Game of the Year 2006."}, {"url": "http://reference.yourdictionary.com/resources/romanums.html", "passage_text": "The position of the letters in relationship to each other is what determines the value of the actual Roman numeral. For example: 1  If smaller numbers follow larger numbers, the numbers are added. 2  For example, the Roman numeral XII calls for the addition of ten and two, resulting in the value of twelve. 3  XII = 10+2. 4  If a smaller number precedes a larger number, the smaller number is subtracted from the larger. "}, {"url": "http://www.audioenglish.org/dictionary/xii.htm", "passage_text": "The noun XII has 1 sense: 1. the cardinal number that is the sum of eleven and one. Familiarity information: XII used as a noun is very rare. • XII (adjective). The adjective XII has 1 sense: 1. denoting a quantity consisting of 12 items or units. Familiarity information: XII used as an adjective is very rare. "}, {"url": "https://en.wikipedia.org/wiki/Factor_XII", "passage_text": "Human Factor XII is 596 amino acids long and consists of two domains, the heavy chain (353 residues) and light chain (243 residues) held together by a disulfide bond. Factor XII deficiency is a rare disorder that is inherited in an autosomal recessive manner. Unlike other clotting factor deficiencies, factor XII deficiency is totally asymptomatic and does not cause excess bleeding."}, {"url": "https://en.wikipedia.org/wiki/Factor_XII", "passage_text": "Coagulation factor XII, also known as Hageman factor, is a plasma protein. It is the zymogen form of factor XIIa, an enzyme (EC 3.4.21.38) of the serine protease (or serine endopeptidase) class. In humans, factor XII is encoded by the F12 gene. Factor XII deficiency is a rare disorder that is inherited in an autosomal recessive manner. Unlike other clotting factor deficiencies, factor XII deficiency is totally asymptomatic and does not cause excess bleeding."}, {"url": "http://www.answers.com/Q/What_is_XII_in_Roman_numerals", "passage_text": "There is no system called Arabic numbers. XII can be defined by a set of Arabic NUMERALS, but not by a single character. Improved Answer:- The Roman numerals of XII equals 1 … 2 in Hindu-Arabic numerals. Answered. Different symbols have different numeral values. For example, I = 1, V = 5, and X = 10. When these symbols are combined … in different ways the other numbers are formed. There are several rules for the placement of the symbols."}, {"url": "http://acronyms.thefreedictionary.com/XII", "passage_text": "[*] Louis XII divorced his wife, Jeanne, daughter of Louis XI, and married in 1499 Anne of Brittany, widow of Charles VIII, in order to retain the Duchy of Brittany for the crown. The Prince by Machiavelli, Nicolo View in context. {82} This line exists in the text here but not in the corresponding passage xii. Balashev, who was on the alert all through the dinner, replied that just as all roads lead to Rome, so all roads lead to Moscow: there were many roads, and among them the road through Poltava, which Charles XII chose."}]