[{"url": "http://www.answers.com/Q/What_is_rqwl", "passage_text": "What are the chances of confirmation of ticket in rqwl quota in railway? I have booked rajdhani from delhi to new jalpaiguri with waiting status RQWL 15-16-17 on 18 oct 2012 but till date 03-Dec-2012 it has not moved a single bit."}, {"url": "https://in.answers.yahoo.com/question/index?qid=20120508005526AAaRX2O", "passage_text": "RQWL: Remote Quota Wait List. This is used for intermediate stations on the train route... PQWL is Pooled Quota Wait List which is quotas of nearby stations pooled together to form this list, that is smaller stations having small quotas, one/two/three each are pooled together to form this waitlist."}, {"url": "http://www.answers.com/Q/What_is_rqwl_at_indian_railway_ticket", "passage_text": "WL means Waiting List. RAC means Reservation against Cancellation. Any of indian railway Ticket is Shows these terms. When the train journey has booked full tickets, the first 50 waiting tickets are booked on RAC, then next WL, afterwards PQWL and finally RLWL/RQWL."}, {"url": "http://www.askmefast.com/What_is_rqwl_waiting_list_in_a_railway_ticket-qna769124.html", "passage_text": "I have booked a ticket from Bhubaneswar to New Delhi on 06/04/2015 by Rajdhani Exp (22823) and my waiting list is RQWL-1 and RQWL-2.What does it mean and what is the chance of getting conformation ticket."}, {"url": "http://www.rushinformation.com/irctc-waiting-list-types/", "passage_text": "PQWL refers to Pooled Quota Waiting List and is a type of Waiting list against pooled quota. You will get a PQWL Ticket status if while booking tickets to a station the tickets are issued from the Pooled Quota or if all the tickets available in the Pooled Quota have been booked already."}, {"url": "https://in.answers.yahoo.com/question/index?qid=20120508005526AAaRX2O", "passage_text": "Rating Newest Oldest. Best Answer: RQWL means Remote Quota Waiting List, The first half i.e. RQWL shows your booking status while second half e.e. RQWL 2 shows your current status. The first half will remain static while second half may change according to cancellation of confirmed ticket booked previously."}, {"url": "http://www.askmefast.com/What_is_RQWL_and_RSWL_in_railway-qna1056067.html", "passage_text": "1. 0. My reservatio in dbrt rajdhani ndls to pnbe,on 22.2.12,my status is rqwl1,whats is the meaning of rqwl,how much waitng wil cnfrm in dbrt rajdhani in 3ac from ndls to pnbe. source: When i booked train ticket status rqwl,after it changed rswl."}, {"url": "http://www.answers.com/Q/What_is_rqwl", "passage_text": "WL means Waiting List. RAC means Reservation against Cancellation. Any of indi … an railway Ticket is Shows these terms. When the train journey has booked full tickets, the first 50 waiting tickets are booked on RAC, then next WL, afterwards PQWL and finally RLWL/RQWL."}, {"url": "http://www.askmefast.com/What_is_rqwl_waiting_list_in_a_railway_ticket-qna769124.html", "passage_text": "I have booked a ticket from Howrah to Mugalsarai for 30th September 14 by kolkata Rajdhani Exp(12301), which shows RQWL 9. what does it means and what is the chance for confirmation."}]