[{"url": "http://www.edinburghcastle.gov.uk/explore-the-castle/about-the-castle/", "passage_text": "About Edinburgh Castle. Edinburgh Castle dominates Scotland's capital city from its great rock. Its story has helped shape the nation's story. Battles and sieges were fought over it, royalty lived and died within its walls, and countless generations have been inspired by it. The military presence remains unbroken, but over the last 200 years the castle has become a national icon. It is now Scotland's leading tourist attraction, and a key element of the Edinburgh World Heritage Site."}, {"url": "http://www.edinburgharchitecture.co.uk/edinburgh-castle", "passage_text": "1 Nov 2013 – Edinburgh Castle has been voted the top UK Heritage Attraction in the prestigious 2013 British Travel Awards, the largest awards programme in the UK. The announcement was made at an industry event in London on 31 October. Edinburgh Castle joins landmarks around the globe by switching off its lights to highlight climate change. Edinburgh Castle is to join landmarks from around the world in switching off its lights later this month to help raise awareness of the impact of climate change."}, {"url": "http://www.exploring-castles.com/edinburgh_castle_history.html", "passage_text": "The history of Edinburgh Castle is closely entwined with the history of Edinburgh-and of Scotland as a whole. It's easy to see why. Edinburgh Castle literally dominates the skyline of Edinburgh-it's a fearsome demonstration of Scottish might, crouched on a massive rocky outcrop at the centre of the city. A misty morning in the castle. You can see, in the distance, the hills and mountains rolling out around Edinburgh. The majority of buildings in the castle are from the c17-c18th, when it was reborn as a military garrison."}, {"url": "https://en.wikipedia.org/wiki/Edinburgh_Castle", "passage_text": "The most notable exceptions are St Margaret's Chapel from the early 12th century, which is regarded as the oldest building in Edinburgh, the Royal Palace and the early-16th-century Great Hall, although the interiors have been much altered from the mid-Victorian period onwards. In the early 15th century, another English invasion, this time under Henry IV, reached Edinburgh Castle and began a siege, but eventually withdrew due to lack of supplies. From 1437, Sir William Crichton was Keeper of Edinburgh Castle, and soon after became Chancellor of Scotland."}, {"url": "https://en.wikipedia.org/wiki/Edinburgh_Castle", "passage_text": "Edinburgh Castle is located at the top of the Royal Mile, at the west end of Edinburgh's Old Town. The volcanic Castle Rock offers a naturally defended position, with sheer cliffs to north and south, and a steep ascent from the west. In the early 15th century, another English invasion, this time under Henry IV, reached Edinburgh Castle and began a siege, but eventually withdrew due to lack of supplies. From 1437, Sir William Crichton was Keeper of Edinburgh Castle, and soon after became Chancellor of Scotland."}, {"url": "https://en.wikipedia.org/wiki/Edinburgh_Castle", "passage_text": "The summit of the Castle Rock is 130 metres (430 ft) above sea level, with rocky cliffs to the south, west and north, rising to a height of 80 metres (260 ft) above the surrounding landscape. This means that the only readily accessible route to the castle lies to the east, where the ridge slopes more gently. In the early 15th century, another English invasion, this time under Henry IV, reached Edinburgh Castle and began a siege, but eventually withdrew due to lack of supplies. From 1437, Sir William Crichton was Keeper of Edinburgh Castle, and soon after became Chancellor of Scotland."}, {"url": "https://en.wikipedia.org/wiki/Edinburgh_Castle", "passage_text": "Edinburgh Castle is a historic fortress which dominates the skyline of the city of Edinburgh, Scotland from its position on the Castle Rock. In the early 15th century, another English invasion, this time under Henry IV, reached Edinburgh Castle and began a siege, but eventually withdrew due to lack of supplies. From 1437, Sir William Crichton was Keeper of Edinburgh Castle, and soon after became Chancellor of Scotland."}, {"url": "http://www.edinburgharchitecture.co.uk/edinburgh-castle", "passage_text": "Edinburgh Castle is one of a number of Historic Scotland attractions that will be turning off their lights for one hour on 29 March 2014 at 8:30pm. Other participating Historic Scotland sites are Linlithgow Palace, Urquhart Castle, Stirling Castle, Castle Campbell, Dundonald Castle, Ruthven Barracks and Arbroath Abbey. Edinburgh Castle joins landmarks around the globe by switching off its lights to highlight climate change. Edinburgh Castle is to join landmarks from around the world in switching off its lights later this month to help raise awareness of the impact of climate change."}]