[{"url": "http://www.livestrong.com/article/417232-how-much-weight-can-i-lose-eating-fruits-vegetables-lean-proteins-for-one-month/", "passage_text": "You're on the right track if you plan to lose weight by eating mainly fruits, vegetables and lean proteins for the next month. Fad diets won't provide you with the weight-loss results you want; instead, you need to make permanent changes in what you eat to lose weight and keep it off. Still, you'll need to count calories and consume fewer of them. To lose 4 to 5 lbs. in one month, you should consume about 500 to 600 fewer calories each day than you would if you weren't trying to lose weight."}, {"url": "http://howtoloseweightfaste.com/how-fast-can-i-lose-weight-eating-only-grilled-meats-and-vegetables-only/", "passage_text": "20 – 50lbs: ———————– 3lbs – 6lbs – 9lbs. Over 50lbs: ———————- 4lbs – 8lbs -12lbs. You can lose more body fat eating protein & fat (don’t eat protein alone) than not eating AT ALL. To lose weight fast, eat all you want, but nothing but meat, eggs, healthy oils, mayo, butter & half an avocado a day (for added potassium). Keep the calories high & the fat percentage high, at least 65% of calories. Green vegetables & some cheese will continue weight loss but at a slower pace."}, {"url": "http://www.livestrong.com/article/417232-how-much-weight-can-i-lose-eating-fruits-vegetables-lean-proteins-for-one-month/", "passage_text": "Considerations. Although you potentially can lose up to 10 lbs. by eating fruits, vegetables and lean proteins for one month, you should view your planned diet changes as more of a lifestyle change than a one-time effort. Still, you'll need to count calories and consume fewer of them. To lose 4 to 5 lbs. in one month, you should consume about 500 to 600 fewer calories each day than you would if you weren't trying to lose weight."}, {"url": "http://www.livestrong.com/article/417232-how-much-weight-can-i-lose-eating-fruits-vegetables-lean-proteins-for-one-month/", "passage_text": "That will translate into an additional 4 lbs. weight loss for one month, bringing your total to around 10 lbs. Although you potentially can lose up to 10 lbs. by eating fruits, vegetables and lean proteins for one month, you should view your planned diet changes as more of a lifestyle change than a one-time effort. Still, you'll need to count calories and consume fewer of them. To lose 4 to 5 lbs. in one month, you should consume about 500 to 600 fewer calories each day than you would if you weren't trying to lose weight."}, {"url": "http://howtoloseweightfaste.com/how-fast-can-i-lose-weight-eating-only-grilled-meats-and-vegetables-only/", "passage_text": "Answer: Some people lose 10lbs in the first two weeks of eating lowcarb. It all depends on metabolic resistance. If your body has a low metabolic resistance you will lose more weight in 14 days than if your body has a high metabolic resistance. To lose weight fast, eat all you want, but nothing but meat, eggs, healthy oils, mayo, butter & half an avocado a day (for added potassium). Keep the calories high & the fat percentage high, at least 65% of calories. Green vegetables & some cheese will continue weight loss but at a slower pace."}, {"url": "http://www.livestrong.com/article/417232-how-much-weight-can-i-lose-eating-fruits-vegetables-lean-proteins-for-one-month/", "passage_text": "Weight Loss Basics. You ate 3,500 calories more than you burned to gain every excess pound, and you'll need to eat 3,500 calories fewer than you burn to take them off. Fortunately, the foods you've chosen -- fruits, vegetables and lean proteins -- generally contain fewer calories than high-fat meats and snack foods. Still, you'll need to count calories and consume fewer of them. To lose 4 to 5 lbs. in one month, you should consume about 500 to 600 fewer calories each day than you would if you weren't trying to lose weight."}, {"url": "http://www.livestrong.com/article/435820-eating-just-salad-protein-for-fast-weight-loss/", "passage_text": "When you eat just salad and protein for fast weight loss, you may be able to get adequate amounts of the nutrients that are in fruits and vegetables, such as dietary fiber, potassium, vitamin A and vitamin C. Your diet may also be sufficient in iron, which is in meats, and vitamin B-12, which is in animal foods. When you only eat salad and proteins, you may lose weight rapidly at first because of losing water weight as the result a low carbohydrate intake, which has a diuretic effect, according to the Mayo Clinic."}, {"url": "https://answers.yahoo.com/question/index?qid=20100425132558AA15GJk", "passage_text": "Rating Newest Oldest. Best Answer: veryyyy bad i dea. you need different nutrients from all different kinds of foods in order to be healthy. you NEED protein, dairy, grains, along with fruits and vegetables to be healthy and lose weight. plus, you'll gain it all back if you lose it that way. also, you will have no strenght for exercise. eating grains before exercising is waht gives you the energy you need. please do not do this. also, if you don't get the proper nutritents.. your hair can fall out, along with many long term side effects and negative effects to your body. no one wants that.."}, {"url": "https://answers.yahoo.com/question/index?qid=20071218101430AADTCLF", "passage_text": "Healthier diet would be fruits and veggies, if possible vine ripe, organic and raw. Protein (meats are directly linked to heart diseases, high blood pressure, cancer, MS, and many more) The most you can expect to safely lose is 2 to 3 pounds a week. More than that is a water loss and an unhealthy loss. How much you lose depends on your body ~ if you eat healthy and exerciser you should drop between 1 to 2 pounds a week... if you drop more than that you're losing muscle mass, too. Morphed_Into_A_Buterfly · 8 years ago. Thumbs up."}]