[{"url": "http://www.phlebotomytrainingspot.com/phlebotomist-salary-and-pay/", "passage_text": "A starting pay is often going to be much different and can be as much as 25% less than a phlebotomist with 30% more experience. The average hourly wage in the United States for phlebotomists is $14.29. The average annual wage in the US is $30,900. That wage average is based on the 100,000 phlebotomists that work in the United States. The top 25% of phlebotomists make an average of $17.27 per hour. The top 25% make about $35,900 per year. The top 10% of phlebotomists earn $20.48 per hour and about $42,600 per year"}, {"url": "http://www.aihtedu.com/blog/phlebotomy-technician-salary-in-ct.html", "passage_text": "The average phlebotomy technician salary in the state of Connecticut, USA is between $ 33,500 and $ 35,000 per annum (the variation is based on location within the state). The hourly wage calculation works out between $ 16 to $ 17 per hour. The salary at this level is $ 30,400 per year ($ 14.61 per hour). On the higher side at 75 percentile, the data shows a salary of $ 38,850 per annum ($ 18.78 per hour). At the highest level, the top 10 percentile of phlebotomy technicians in Connecticut earn about $ 44,810 per annum ($ 21.55"}, {"url": "http://www.healthcare-salaries.com/technicians/phlebotomy-technician-salary", "passage_text": "Phlebotomy technician salary in USA. According to PayScale reports, the yearly salary for the phlebotomy technicians with less than 1 year of practical experience ranges from $19,866 – $39,149 while those with 1 to 4 years of experience ranges from $20,325 – $37,500. According to PayScale, the typical salary of a certified phlebotomy technician ranges from $20,480 to $38,395. They may also receive a bonus of $512 per year. Their wage usually ranges from $9.85 to $17.77, while overtime pay ranges from $14.70 to $26.08 per hour."}, {"url": "http://www.healthcare-salaries.com/technicians/phlebotomy-technician-salary", "passage_text": "Average phlebotomy technician salary. According to PayScale, the average salary for a phlebotomy technician in the United States ranges from $22,970 to $31,842 per year and an average hourly wage ranges from $9.45 – $17.22 per hour. According to PayScale, the typical salary of a certified phlebotomy technician ranges from $20,480 to $38,395. They may also receive a bonus of $512 per year. Their wage usually ranges from $9.85 to $17.77, while overtime pay ranges from $14.70 to $26.08 per hour."}, {"url": "http://www.wikiprofessional.org/Phlebotomist_Salary", "passage_text": "How much does a phlebotomist make? According to the U.S. Bureau of Labor Statistics, Phlebotomists can earn an average of $29,730 a year in the United States. "}, {"url": "http://www.healthcare-salaries.com/technicians/phlebotomy-technician-salary", "passage_text": "The average salary for a phlebotomist in Canada is about $32,000 CAD per year. According to payscale, a phlebotomy technician in Canada receives an annual hourly wage ranging from between C$12.69 – C$22.18. According to PayScale, the typical salary of a certified phlebotomy technician ranges from $20,480 to $38,395. They may also receive a bonus of $512 per year. Their wage usually ranges from $9.85 to $17.77, while overtime pay ranges from $14.70 to $26.08 per hour."}, {"url": "http://work.chron.com/much-phlebotomist-make-hourly-6388.html", "passage_text": "These techs earned median wages of $17.76 per hour or $36,950 per year as of May 2011. For phlebotomists specifically, the industry-supported Explore Health Careers website cites a salary range of $25,177 to $30,470 per year, or $12.10 to $14.65 hourly. The best indicator of phlebotomists' incomes is probably the salary survey performed annually by the American Society for Clinical Pathology"}, {"url": "http://www.phlebotomistcareer.com/phlebotomist-salaries.php", "passage_text": "Median annual Phlebotomist salaries were about $30,000 in May 2012. The lowest 10 percent earned a Phlebotomist salary of less than about $21,000 and the highest 10 percent earned Phlebotomist pay of more than about $43,000. "}, {"url": "http://www.aihtedu.com/blog/phlebotomy-technician-salary-in-ct.html", "passage_text": "The mean wage for phlebotomy technicians in CT is approximately $ 35,000 per annum ($ 16.82 per hour). A further look at the data gives us the salary range in detail. The lower ten percentile of phlebotomy technicians in CT make around $ 26,430 per annum ($ 12.71 per hour). A 25 percentile, this increases by 15%. The salary at this level is $ 30,400 per year ($ 14.61 per hour). On the higher side at 75 percentile, the data shows a salary of $ 38,850 per annum ($ 18.78 per hour). At the highest level, the top 10 percentile of phlebotomy technicians in Connecticut earn about $ 44,810 per annum ($ 21.55 per hour)."}, {"url": "http://www1.salary.com/CT/Hartford/Phlebotomist-salary.html", "passage_text": "For example the median expected annual pay for a typical Phlebotomist in the United States is $32,958 so 50% of the people who perform the job of Phlebotomist in the United States are expected to make less than $32,958. Source: HR Reported data as of October 2015. 1  Salary. "}]