[{"url": "http://www.thefreedictionary.com/breadth", "passage_text": "breadth. n. 1. The measure or dimension from side to side; width. 2. A piece usually produced in a standard width: a breadth of canvas. 3"}, {"url": "http://biblehub.com/ephesians/3-18.htm", "passage_text": "may be strong to apprehend with all the saints what is the breadth and length and height and depth, Webster's Bible Translation. May be able to comprehend with all saints what is the breadth, and length, and depth, and highth. That you can discover with all the holy, what is the height and depth and length and breadth, GOD'S WORD® Translation. This way, with all of God's people you will be able to understand how wide, long, high, and deep his love is."}, {"url": "http://thinkmath.edc.org/resource/measurement-length-width-height-depth", "passage_text": "Length, width, height, depth. FAQs. People often ask about the correct use of length, width, height, and depth. In the most common contexts in elementary school, mathematics does not have a formal definition for these terms, nor does it have rules about proper use. But natural usage does follow some conventions. (See below.)."}, {"url": "http://www.thefreedictionary.com/breadth", "passage_text": "2. breadth-the extent of something from side to side. width. dimension-the magnitude of something in a particular direction (especially length or width or height). broadness, wideness-the property of being wide; having great width. n. 1. The measure or dimension from side to side; width. 2. A piece usually produced in a standard width: a breadth of canvas."}, {"url": "https://en.wikipedia.org/wiki/Length", "passage_text": "For example, it is possible to cut a length of a wire which is shorter than wire thickness. Length may be distinguished from height, which is vertical extent, and width or breadth, which are the distance from side to side, measuring across the object at right angles to the length. Length is a measure of one dimension, whereas area is a measure of two dimensions (length squared) and volume is a measure of three dimensions (length cubed). In most systems of measurement, the unit of length is a base unit, from which other units are defined."}, {"url": "https://answers.yahoo.com/question/index?qid=20090513000724AAWrMwx", "passage_text": "length is the longest side breadth is the thickness (shortest dimension) width is the dimension equal to a value between the first two This changes when you talk about HEIGHT, Width and Breadth Say you are taking about a dead end wall whose height = 3m and thickness of 200mm spanning across a 6 meters wide road. The length is the width of the road. The height is just the height. the breadth is the thickness. So you can either say it is 6m wide or 6m long. Whether the height is 10m. it will not be called the length. In this case the length/width is the horizontal length and not necessarily the longest."}, {"url": "http://biblehub.com/ephesians/3-18.htm", "passage_text": "May be able to comprehend with all saints what is the breadth, and length, and depth, and height; Holman Christian Standard Bible. may be able to comprehend with all the saints what is the length and width, height and depth of God's love, International Standard Version. That you can discover with all the holy, what is the height and depth and length and breadth, GOD'S WORD® Translation. This way, with all of God's people you will be able to understand how wide, long, high, and deep his love is."}, {"url": "https://en.wikipedia.org/wiki/Width,_length,_and_depth", "passage_text": "Three-dimensional space (also: tri-dimensional space) is a geometric three-parameter model of the physical universe (without considering time) in which all known matter exists. These three dimensions can be labeled by a combination of three chosen from the terms length, width, height, depth, and breadth. "}, {"url": "http://thinkmath.edc.org/resource/measurement-length-width-height-depth", "passage_text": "Length, width, height, and depth are nouns are derived from the adjectives long, wide, high, and deep, and follow a common English pattern that involves a vowel change (often to a shorter vowel) and the addition of th. (The lone t in height is modern. People often ask about the correct use of length, width, height, and depth. In the most common contexts in elementary school, mathematics does not have a formal definition for these terms, nor does it have rules about proper use. But natural usage does follow some conventions. (See below.)."}]