[{"url": "http://www.surnamedb.com/Surname/Harbert", "passage_text": "Recorded as Harbert, Herbert, and the patronymics as shown below, this is regarded as an English surname. It derives from the male given name Haribeort, of the pre 7th century. This is composed of the elements heri or hari, meaning an army, and berht, bright or famous. The Norman-French spelt it as Herbert or Latinised as Herbertus, and after 1066 this spelling became confused and diffused with the corresponding Anglo-Saxon Haribeorht."}, {"url": "http://www.sheknows.com/baby-names/name/herbert", "passage_text": "In French the meaning of the name Herbert is: Illustrious warrior. Shakespearean Meaning: The name Herbert is a Shakespearean baby name. In Shakespearean the meaning of the name Herbert is: King Henry IV, Part 1' Sir Walter Blunt. 'Henry VI, Part 2' Walter Whitmore. 'King Richard III' Sir Walter Herbert. The name Herbert is a Swedish baby name. In Swedish the meaning of the name Herbert is: Intelligent warrior. SoulUrge Number: 1. Expression Number: 4. People with this name have a deep inner desire to use their abilities in leadership, and to have personal independence."}, {"url": "http://www.ancestry.com/name-origin?surname=harbert", "passage_text": "The information for this chart came from the U.S. Immigration Collection at Ancestry. You can find out where the majority of the Harbert families were living before they immigrated to the U.S and learn where to focus your search for foreign records. Click on a circle in the chart to view Harbert birth and death records. An unusually short lifespan might indicate that your ancestors lived in harsh conditions. A short lifespan might also indicate health problems that were once prevalent in your family. The SSDI is a searchable database of more than 70 million names."}, {"url": "http://www.behindthename.com/name/herbert", "passage_text": "Meaning & History. Derived from the Germanic elements hari army and beraht bright. The Normans introduced this name to England, where it replaced an Old English cognate Herebeorht. In the course of the Middle Ages it became rare, but it was revived in the 19th century. Related Names."}, {"url": "http://www.thinkbabynames.com/meaning/1/Harbert", "passage_text": "Harbert /har-bert/ [2 sylls.] as a boys' name is of Old German derivation, and Harbert means illustrious warrior. Harbert is an alternate form of Herbert (Old German): Norman name. Compare surname Harbort. Harbert is an unusual given name for males but a very prominent last name for both adults and children (#10163 out of 150436, Top 7%). (2000 U.S. Census). Heriberto, Herbert, Herb, Bertie and Bert are the popular alternative forms of Harbert (outside Top 1000) rated in the Top 1000"}, {"url": "http://www.thinkbabynames.com/meaning/1/Herbert", "passage_text": "Herbert /her-bert/ [2 sylls.] as a boys' name is pronounced HER-bert. It is of Old German origin, and the meaning of Herbert is illustrious warrior. Norman name. An island in Lake Derwentshire, England, is named in honor of Saint Herbert (seventh century). American President Herbert Hoover. Herbert is a very prominent first name for males (#130 out of 1220, Top 11%) and also a very prominent surname for both adults and children (#1285 out of 150436, Top 1%). (2000 U.S. Census). Presented below is the birth name popularity of Herbert for boys."}, {"url": "http://www.babynamespedia.com/meaning/Harbert", "passage_text": "[ 2 syll. har-ber(t) , ha-rbe-rt ] The baby boy name Harbert is pronounced as HH AA-RB-erT †. Harbert is used chiefly in Dutch and Frisian, and its origin is Germanic. Harbert is a variant of the name Herbert (English, French, German, and Polish). The contracted forms Haro (Frisian) and Harro (Frisian) are variants of the name. Harbert is not widely used as a baby name for boys. It is not listed within the top 1000 names"}, {"url": "http://www.sheknows.com/baby-names/name/herbert", "passage_text": "The name Herbert is a German baby name. In German the meaning of the name Herbert is: Illustrious warrior. Army. Bright. Introduced into Britain during the Norman Conquest. Famous Bearer: American president Herbert C. Hoover. American Meaning: The name Herbert is an American baby name. The name Herbert is a Swedish baby name. In Swedish the meaning of the name Herbert is: Intelligent warrior. SoulUrge Number: 1. Expression Number: 4. People with this name have a deep inner desire to use their abilities in leadership, and to have personal independence."}]