[{"url": "http://www.medicinenet.com/esophageal_cancer/page5.htm", "passage_text": "Stage IIB. Cancer is found in the upper or middle part of the esophagus, it has invaded the muscle layer or outer layer of the esophagus, and the grade is 2 or 3. Or, cancer has not invaded the outer layer, and cancer cells are found in one or two nearby lymph nodes. Or, cancer is found in the lower part of the esophagus, it has invaded the muscle layer or outer layer of the esophagus, and the grade is 1. Cancer is found in the upper or middle part of the esophagus, it has invaded the muscle layer or outer layer of the esophagus, and the grade is 1. Or, cancer is found in the lower part of the esophagus, it has invaded the muscle layer or outer layer of the esophagus, and the grade is 2 or 3"}, {"url": "https://answers.yahoo.com/question/index?qid=20061030084221AA4tq82", "passage_text": "Best Answer: Esophageal cancer is a very aggressive cancer. Treatment of stage IV esophageal cancer usually includes chemotherapy, radiation therapy, and surgical removal of the affected part of the esophagus. Unfortunately, once it has spread, especially to places like the liver, long-term survival is not likely. Stage IVA (any T, any N, M1a): This stage indicates that the esophageal cancer has spread to distant lymph nodes. If the esophageal cancer is in the upper part of the chest, it has spread to lymph nodes in the neck. For cancer of the lower part of the esophagus, it has spread to lymph nodes in the abdomen. Stage IVB (any T, any N, M1b): This stage indicates that the esophageal cancer has spread to more distant lymph nodes or other distant sites, such as the liver, bones, or brain"}, {"url": "http://www.mcrh.org/Esophageal-Cancer/28980.htm", "passage_text": "For cancer of the lower part of the esophagus, it has spread to lymph nodes in the abdomen. Stage IVB (any T, any N, M1b): This stage indicates that the esophageal cancer has spread to more distant lymph nodes or other distant sites, such as the liver, bones, or brain. Survival Rates by Stage"}, {"url": "http://csn.cancer.org/node/150159", "passage_text": "My husband of 35 years was dxed with Esophageal Cancer spread to the liver, and not given much hope of lasting more than a year. He has been in the hospital 3 times in 3 months. I need a good source of information and support and haven't found any...Janice. 1  Login or register to post comments. Mar 21, 2013 - 4:11 pm. request for Esophageal Cancer (EC) spread to Liver. My Father-in-law (as dear to me as my real father) is going through EC spread to Liver, he has gone through chemo when it was only EC and now just had a recurrence and found in Liver also."}, {"url": "http://www.seattlecca.org/diseases/metastatic-esophageal-treatment.cfm", "passage_text": "Treatment for Metastatic Esophageal Cancer. Metastatic esophageal cancer (stage IV) is cancer that has spread (metastasized) to distant sites in the body, such as the lungs or the liver. Because the cancer has spread, surgery cannot remove it completely, so people with metastatic esophageal cancer typically do not have surgery as part of their treatment plan. "}, {"url": "http://www.mcrh.org/Esophageal-Cancer/28980.htm", "passage_text": "Esophageal cancer is a very aggressive cancer. Treatment of stage IV esophageal cancer usually includes chemotherapy, radiation therapy, and surgical removal of the affected part of the esophagus. Unfortunately, once it has spread, especially to places like the liver, long-term survival is not likely. Stage IVB (any T, any N, M1b): This stage indicates that the esophageal cancer has spread to more distant lymph nodes or other distant sites, such as the liver, bones, or brain."}, {"url": "http://patients.gi.org/topics/gastrointestinal-cancers/", "passage_text": "Overview. The esophagus is a tube that connects the mouth and throat with the stomach (food pipe). When a person swallows, the muscular wall of the esophagus contracts to help push food down to the stomach. There are two main types of cancer that can occur in the esophagus. Depending on the stage of esophageal cancer the patient may undergo surgery, radiation and/or chemotherapy. Other measures that may improve symptoms include stretching or dilation, tube prosthesis (stent) and radiation or laser treatment to reduce the size of the cancer."}]