[{"url": "https://en.wikipedia.org/wiki/Oak", "passage_text": "Oaks have spirally arranged leaves, with lobate margins in many species; some have serrated leaves or entire leaves with smooth margins. Many deciduous species are marcescent, not dropping dead leaves until spring. In spring, a single oak tree produces both male flowers (in the form of catkins) and small female flowers. Linnaeus described only five species of oak from eastern North America, based on general leaf form. These were white oak, Quercus alba; chestnut oak, Q. montana; red oak, Q. rubra; willow oak Q. phellos; and water oak, Q. nigra."}, {"url": "http://www.treenames.net/ti/quercus/index.html", "passage_text": "Picture of a English Oak Tree. Picture of an English Oak Tree (or Pedunculate Oak), (Quercus robur) outside Warwick Castle, Worcestershire, England. The Quercus genus is classified into two subgenera based on leaf characters, cone and seed. 1  Subgenus Quercus; The red, intermediate, and white Oaks. 2  Subgenus Cyclobalanopsis; The ring-cupped Oaks (synonym genus Cyclobalanopsis). 3  Eastern and Southeastern Asia"}, {"url": "http://forestry.about.com/od/Treebiology/a/Tree-Species.htm", "passage_text": "Unlike common tree names where the species is often named first; for example, red oak, blue spruce and silver maple-the scientific genus name is always named first; for example, Quercus rubra, Picea pungens and Acer saccharinum. These names are based on never-to-change Latin words. So Latin terms, when broken into their respective tree genus and species, are called a tree's scientific name."}, {"url": "http://oregonstate.edu/trees/genus_describe.html", "passage_text": "The genus name refers to the general type of tree (e.g. pine or Pinus), while the species name refers to the specific type of pine (e.g. sugar or lambertiana). Other pines have the same genus name in both English and Latin, but they have different species names. For example: For example, all trees in the Pine genus (Pinus) have long, narrow needles bound in bundles and hard, woody cones with thick, tough scales. All plants have two types of names: a common name and a scientific name."}, {"url": "https://en.wikipedia.org/wiki/Oak", "passage_text": "The common name oak may also appear in the names of species in related genera, notably Lithocarpus. The genus is native to the Northern Hemisphere, and includes deciduous and evergreen species extending from cool temperate to tropical latitudes in the Americas, Asia, Europe, and North Africa. North America contains the largest number of oak species, with approximately 90 occurring in the United States. Linnaeus described only five species of oak from eastern North America, based on general leaf form. These were white oak, Quercus alba; chestnut oak, Q. montana; red oak, Q. rubra; willow oak Q. phellos; and water oak, Q. nigra."}, {"url": "http://www.treenames.net/ti/quercus/oak_trees.html", "passage_text": "Oak is the most common name for trees listed in the genus Quercus. There are a few species that exhibit a shrub type growth form instead of a tree form. There are both deciduous and evergreen species and some are semi-evergreen. Currently there are approximately 600 different species listed in the Quercus (Oak) genus. The tree name  Oak  is also used for the common names of some species in related genera, especially those listed in the Lithocarpus genus. Some evergreen Oak trees (especially certain American Species) are given a grouping common name called Live Oak. This name applies to different species that have an evergreen growth habit, and does not reflect any taxonomic classification group, as these species are distantly related in some cases."}, {"url": "http://forestry.about.com/od/Treebiology/a/Tree-Species.htm", "passage_text": "Linnaeus' grand achievement was the development of what is now called  binomial nomenclature  - a formal system of naming species of living things, including trees, by giving each tree a name composed of two parts called the genus and the species. These names are based on never-to-change Latin words. So Latin terms, when broken into their respective tree genus and species, are called a tree's scientific name. When using that special name, a tree can be identified by botanists and foresters around the world and in any language"}, {"url": "https://en.wikipedia.org/wiki/List_of_Quercus_species", "passage_text": "The genus Quercus (oak) contains about 600 species, some of which are listed here. "}, {"url": "http://forestry.about.com/cs/treeid/a/the_oak.htm", "passage_text": "By Steve Nix. The term oak can be used as part of the common name of any of about 400 species of oak trees and shrubs in the genus Quercus (from Latin oak tree). 1 The most common Ash species in the United States. 2  The 5 Most Common Native Maples in North America. 3  The Hardwoods Including Oak. 4  Easy Identification of Oak. 5  The Beginner eCourse. 6  The best 10 tree species for planting in large yards and landscapes. 7  Essential Tips on Using a Chain Saw to cut a tree."}]