[{"url": "http://www.ehow.com/list_5954830_three-types-brake-noises.html", "passage_text": "If brakes on a vehicle make any type of noise under driving and braking conditions, it is the sign of a malfunction. Noises may be a variety of brake and brake mounting systems failures, or they may be other problems that occur when the motion of braking creates movement in another part. A clunking or banging noise may be audible when applying brakes on a car. Harder braking creates a louder noise at higher speeds. This can be a failure of steering parts like the rack-and-pinion steering on a front-wheel-drive vehicle or tie rod ends on a rear-wheel-drive vehicle."}, {"url": "http://www.aa1car.com/library/tr996.htm", "passage_text": "Fortunately, brake noise is not caused by a virus. It is caused by a combination of factors that sometimes add up to create noise. Brake squeal is really a high frequency vibration. In disc brakes, it can be caused by vibrations between the pads and rotors, the pads and calipers, or the calipers and their mounts. In the photo above, the noise produced by a brake rotor in a test lab has been captured electronically and converted into a color graphic. SHAKY PADS CAN CAUSE DISC BRAKE NOISE. One way to quiet noisy pads is to make sure the pads fit tightly in the calipers. If the pads on a single piston caliper have mounting ears or tabs that need to be bent or hammered to hold the pad in position, make sure the pad can't be wiggled by hand."}, {"url": "http://www.ehow.com/list_5954830_three-types-brake-noises.html", "passage_text": "Shocks and springs can cause a clunking noise when braking if they are loose or broken. At times, these suspension parts can benefit from an adjustment or they may need replacing. Calipers that hold the disc brake pads in place may be out of adjustment, which will cause clunking. A clunking or banging noise may be audible when applying brakes on a car. Harder braking creates a louder noise at higher speeds. This can be a failure of steering parts like the rack-and-pinion steering on a front-wheel-drive vehicle or tie rod ends on a rear-wheel-drive vehicle."}, {"url": "http://www.wikihow.com/Fix-Noisy-Brakes", "passage_text": "1 Noisy brakes are a warning sign that the brakes may be bad, but noise alone is not always a hazard. 2  Have noisy brakes checked if you are not sure. 3  Always have the car inspected if brake noise is accompanied by other braking problems, such as pulling to the side upon braking. Warnings. 1  Bad brakes are a safety issue. 2  Noisy brakes are a warning sign that the brakes may be bad, but noise alone is not always a hazard. 3  Have noisy brakes checked if you are not sure. 4"}, {"url": "http://repairpal.com/why-are-my-brakes-making-noise", "passage_text": "Continually driving a vehicle until the friction lining of the brake pads is worn away will lead to expensive damage—your brakes might even fail. Anytime the brakes make an abnormal noise, they should be inspected and repaired before the braking system becomes compromised in any way. When the brakes are applied, the brake pads put clamping pressure on the brake rotor in the same manner the rubber brake blocks come into contact with the rim of a bicycle. The pressure the brake pads apply to the brake rotor is proportional to the pressure applied to the brake pedal by the driver's foot."}, {"url": "http://www.carsdirect.com/car-repair/understand-brake-noise-for-a-proper-diagnosis", "passage_text": "Unusual brake noise or braking behaviors should serve as a warning that one of the most essential systems on your car is malfunctioning. It's all too common for drivers to ignore minor brake noises or irregularities for too long. "}, {"url": "http://repairpal.com/why-are-my-brakes-making-noise", "passage_text": "Noise heard while braking is an indication of brake wear and the brakes should be inspected. Brakes are very much a safety item, and delaying repair is not a safe strategy. In fact, delaying repair can potentially lead to more expensive repairs because worn brake pads can wear down to the metal backing. When the brakes are applied, the brake pads put clamping pressure on the brake rotor in the same manner the rubber brake blocks come into contact with the rim of a bicycle. The pressure the brake pads apply to the brake rotor is proportional to the pressure applied to the brake pedal by the driver's foot."}, {"url": "http://mycarmakesnoise.com/outside-the-car/suspension-tire-brake-and-wheel-noises/", "passage_text": "Brake and Wheel Noises. When you put your foot down on the brakes you expect your car to quietly slow down and come to a stop. The power your foot applies on the brake pedal is assisted by hydraulic pressure. Your foot’s force engages a piston and caliper with brake pads attached (bonded abrasive and heat resistance metal or ceramic) to put pressure on the rotor. This pressure on the rotor slows the wheels down and stops your car. When you apply the brakes you should hear minimal if any metal to metal noise."}, {"url": "http://www.wikihow.com/Fix-Noisy-Brakes", "passage_text": "1 Bad brakes are a safety issue. 2  Noisy brakes are a warning sign that the brakes may be bad, but noise alone is not always a hazard. 3  Have noisy brakes checked if you are not sure. 4  Always have the car inspected if brake noise is accompanied by other braking problems, such as pulling to the side upon braking. Warnings. 1 "}, {"url": "http://www.wikihow.com/Fix-Noisy-Brakes", "passage_text": "Check the brake pads, and replace them if they are worn. Many disc brakes include a wear indicator designed to make noise if the pad is worn past a certain point. 5. Try different brake pad materials, but remember that noise and effectiveness may be a trade-off. It is best to replace brake pads with a similar material. Warnings. 1  Bad brakes are a safety issue. 2  Noisy brakes are a warning sign that the brakes may be bad, but noise alone is not always a hazard. 3  Have noisy brakes checked if you are not sure. 4  Always have the car inspected if brake noise is accompanied by other braking problems, such as pulling to the side upon braking."}]