[{"url": "http://www.answers.com/Q/How_long_does_a_repo_stay_on_your_credit_report_in_California", "passage_text": "The repossession then occurred in January 2003. This will stay on the credit report until September of 2008 for that 7 year period, regardless of when the loan winds up getting paid off. It can stay on the report a bit longer if it goes to court and the bank gets a judgment against the borrower. A Chapter 7 bankruptcy may display on your credit for 10 years from the date of filing. Chapter 13 may stay for 10 years also, but it is customary for those to be removed afte … r 7 years."}, {"url": "http://www.answers.com/Q/How_long_does_a_repossession_stay_on_your_credit_report", "passage_text": "Repo on Your Credit It stays on your credit report for 7 years to the day the loan became delinquent. Say you made your last complete up to date car payment August 15, 2001 and you fell behind about a month after that staying one month behind until December when you missed another payment becoming 2 months behind. A chapter 13, you will only have to wait a minimum of 1 year from filing date. Seven years in Australia Details of a bankruptcy order in the UK will stay on your credit file for 6 years. 7 to 10 years depending on the state you live in."}, {"url": "http://www.answers.com/Q/How_long_does_a_repo_stay_on_your_credit_report_in_California", "passage_text": "Repo on Your Credit It stays on your credit report for 7 years to the day the loan became delinquent. Say you made your last complete up to date car payment August 15, 2001 an … d you fell behind about a month after that staying one month behind until December when you missed another payment becoming 2 months behind. A Chapter 7 bankruptcy may display on your credit for 10 years from the date of filing. Chapter 13 may stay for 10 years also, but it is customary for those to be removed afte … r 7 years."}, {"url": "http://www.answers.com/Q/How_long_does_a_repossession_stay_on_your_credit_report", "passage_text": "Repo on Your Credit It stays on your credit report for 7 years to the day the loan became delinquent. Say you made your last complete up to date car payment August 15, 2001 an … d you fell behind about a month after that staying one month behind until December when you missed another payment becoming 2 months behind. A chapter 13, you will only have to wait a minimum of 1 year from filing date. Seven years in Australia Details of a bankruptcy order in the UK will stay on your credit file for 6 years. 7 to 10 years depending on the state you live in."}, {"url": "https://answers.yahoo.com/question/index?qid=20090420093254AAQumEs", "passage_text": "Repossession, whether voluntary or involuntary, will show up on your credit report for seven years. Any money owed, if not paid, could also show up on your credit report as a charge off. This could seriously affect your ability to apply for any type of credit. hdhayes60 · 7 years ago. The damage to your credit report will be bad, and will stay on your record for 7 years, once the collection agency gets hold of the debts, then they will also put a negative on your credit report."}, {"url": "http://www.howlongdoes.com/money/how-long-does-a-repossession-stay-on-your-credit/", "passage_text": "This is because of how long does a repossession stay on your credit. The best thing to do would be to sell the house or vehicle and repay the loan in full. If you can save your credit record from getting damaged you will be able to get a loan for a vehicle or home loan again. This is why it is important to keep in mind that how long does a repossession stay on your credit, before you plan to buy a house or a vehicle. The wise thing to do is to go for something that costs lesser than what you can afford at that time."}, {"url": "http://www.howlongdoes.com/money/how-long-does-a-repossession-stay-on-your-credit/", "passage_text": "If you are unable to pay the loan installments, the finance company will repossess your vehicle or house and this will have a great negative impact on your credit score because a repossession stays on your credit record for 7 years. This is why it is important to keep in mind that how long does a repossession stay on your credit, before you plan to buy a house or a vehicle. The wise thing to do is to go for something that costs lesser than what you can afford at that time."}, {"url": "http://credit.about.com/od/or/g/what-is-repossession.htm", "passage_text": "Then, the repossession itself will be listed in the public records section of your credit report. If the lender obtains a deficiency judgment for the balance of the auto loan, that judgment will also go on your credit report. These negative items will remain on your credit report for seven years. With involuntary repossession, the lender comes to take back the car. The lender can sometimes take the car from your property without your permission as long as they do not disturb you or your neighbors."}, {"url": "http://www.answers.com/Q/How_long_does_a_repo_stay_on_your_credit_report_in_California", "passage_text": "Most information (good and bad) will stay on your credit report for seven years. However, some financial disasters (divorce, bankruptcy) can stay for as long as ten years. The … silver lining to this is that, the older the negative information is, the less influence it has on the overall report. A Chapter 7 bankruptcy may display on your credit for 10 years from the date of filing. Chapter 13 may stay for 10 years also, but it is customary for those to be removed afte … r 7 years."}]