[{"url": "http://coolweather.net/statetemperature/delaware_temperature.htm", "passage_text": "Delaware Temperature Records. The climate of Delaware is humid temperate with hot summers and mild winters. The mean annual temperature ranges from 55 F in New Castle County to 56 F over Kent and Sussex counties. 1 Record Coldest year in Delaware - 1904 / Avg temperature 51.35 degrees. 2  Delaware average Summer temperature (June, July, August) - 74.2 F degrees, 16th warmest U.S. summer state. 3  Delaware average Winter temperature (December, January, February) - 36.1 F degrees, 34th coldest U.S. winter state."}, {"url": "http://coolweather.net/staterainfall/delaware.htm", "passage_text": "Delaware received 34.65 inches of precipitation, more than a foot above the average of 22.04 Delaware temperature averages and extremes, precipitation and temperature data for all U.S. states and Top 10 U.S. climate extremes. "}, {"url": "http://climate.udel.edu/delawares-climate", "passage_text": "Mean annual temperatures across the State range from 54.0 ° F in northern New Castle County to 58.1 ° F along the Atlantic coast of southern Delaware. Average annual precipitation is approximately 45” statewide. Even so, the State has a continental climate, with cold winter temperatures, hot summers and ample precipitation throughout the year. However, annual precipitation amounts can vary greatly from one year to another."}, {"url": "http://www.currentresults.com/Weather/Delaware/annual-weather-averages.php", "passage_text": "Annual average temperatures, precipitation, snowfall, humidity and sunshine at cities and towns throughout Delaware are listed below. In the table below, the average number of Sunny Days in Delaware is the total days in a year when the sky is mostly clear. This includes the days when cloud covers up to 30% of the sky during daylight hours."}, {"url": "http://www.currentresults.com/Weather/Delaware/annual-weather-averages.php", "passage_text": "Delaware Precipitation. Here are the yearly averages for rainfall plus snowfall in Delaware. Each place has a total for how many days of wet weather it usually gets in a year and for the normal amount of precipitation, based on the weather during 1981 to 2010. In the table below, the average number of Sunny Days in Delaware is the total days in a year when the sky is mostly clear. This includes the days when cloud covers up to 30% of the sky during daylight hours."}, {"url": "http://www.bestplaces.net/climate/city/delaware/rehoboth_beach", "passage_text": "Rehoboth Beach, Delaware, gets 46 inches of rain per year. The US average is 37. Snowfall is 12 inches. The average US city gets 25 inches of snow per year. The number of days with any measurable precipitation is 115. On average, there are 205 sunny days per year in Rehoboth Beach, Delaware. The July high is around 85 degrees. The January low is 28."}, {"url": "http://coolweather.net/statetemperature/delaware_temperature.htm", "passage_text": "The average length of the growing season based on minimum temperatures higher than 32 F, ranges from about 175 to 195 days. The lowest temperature of record for Delaware is -17 F, at Millsboro on January 17, 1893, came in a month which is quite likely the coldest ever known in Delaware and surrounding areas. 1 Record Coldest year in Delaware - 1904 / Avg temperature 51.35 degrees. 2  Delaware average Summer temperature (June, July, August) - 74.2 F degrees, 16th warmest U.S. summer state. 3  Delaware average Winter temperature (December, January, February) - 36.1 F degrees, 34th coldest U.S. winter state."}, {"url": "http://www.city-data.com/states/Delaware-Climate.html", "passage_text": "Delaware-Climate. Delaware's climate is temperate and humid. The normal daily mean temperature in Wilmington is 54°F (12°C), ranging from 31°F (–1°C) in January to 76°F (24°C) in July. Both the record low and the record high temperatures for the state were established at Millsboro: –17°F (–27°C) on 17 January 1893 and 110°F (43°C) on 21 July 1930. The average annual precipitation (1971–2000) was 42.8 in (108.7 cm) during 1971–2000; about 21 in (53 cm) of snow falls each year"}, {"url": "http://www.bestplaces.net/climate/state/delaware", "passage_text": "Delaware, Delaware, gets 45 inches of rain per year. The US average is 37. Snowfall is 15 inches. The average US city gets 25 inches of snow per year. The number of days with any measurable precipitation is 110. On average, there are 202 sunny days per year in Delaware, Delaware. The July high is around 86 degrees. The January low is 25. Our comfort index, which is based on humidity during the hot months, is a 43 out of 100, where higher is more comfortable."}, {"url": "http://climate.udel.edu/delawares-climate", "passage_text": "Delaware Climate Information. The State of Delaware lies along the Atlantic coast of the United States, occupying the northern two-thirds of the Delmarva Peninsula. It is the second smallest of the United States with a land area of 1,982 mi². Even so, the State has a continental climate, with cold winter temperatures, hot summers and ample precipitation throughout the year. However, annual precipitation amounts can vary greatly from one year to another."}]