[{"url": "http://www.howmanycaloriescounter.com/how-many-calories-in-millet.html", "passage_text": "The total fat content in an equal quantity of puffed millet is 0.71 gram, total carbohydrate content in it is 16.8 grams and protein content in it is 2.73 grams. One oz of puffed millet contains 74 calories and 100 grams of puffed millet has 354 calories. One cup of cooked millet contains 205 calories. The total fat content in an equal quantity of cooked millet is 1.74 grams, total carbohydrate content in it is 41.01 grams and protein content is 6.09 grams. 100 grams of cooked millet contains 118 calories, 1 oz dry yields of millet contain 126 calories, 1 cup dry yields of millet contains 893 calories."}, {"url": "http://skipthepie.org/cereal-grains-and-pasta/millet-cooked/", "passage_text": "174g (6.14 oz) grams of Millet, cooked contains 41.1858 grams of carbohydrates which is 14% of your recommended daily carbohydrate intake acording to the Food and Drug Administration guidelines for a 2000 calorie diet."}, {"url": "http://healthyeating.sfgate.com/eat-millet-breakfast-5272.html", "passage_text": "With 207 calories, 6 grams of protein, 1 gram of fat and 2 grams of fiber per cooked cup, millet is an ideal breakfast choice."}, {"url": "http://www.livestrong.com/article/297689-millet-nutrition-information/", "passage_text": "Complex Carbs and Protein. One cup of cooked millet has 207 calories and 41 grams of total carbs. The carbs consist almost entirely of starches, which digest slowly to provide long-term energy. You’ll also get 2 grams of fiber and 6 grams of protein."}, {"url": "http://healthyeating.sfgate.com/eat-millet-breakfast-5272.html", "passage_text": "The egg whites hold the millet together so that it forms the whole-grain pancake. A 2-tablespoon serving of egg whites is enough to hold together 1/4 cup of cooked millet; 2 tablespoons of egg whites have only 15 calories but 3 grams of protein. Before you cook the millet pancakes, stir in flavorings such as cocoa powder or ground cinnamon."}]