[{"url": "http://livewell.jillianmichaels.com/list-foods-contain-sulfur-5102.html", "passage_text": "Meats including beef, chicken and fish contain sulfur. Legumes, such as beans and jicama also contain protein and sulfur. Nuts such as walnuts, almonds, cashews, as well as certain seeds, such as sesame seeds and sunflower seeds, contain sulfur."}, {"url": "http://www.med-health.net/Foods-High-In-Sulfur.html", "passage_text": "Other Foods. Fruits like watermelon, pineapple, coconut, and bananas are high in sulfur. The high sulfur dairy foods are milk, cheese and sour cream. Some beverages such as tea, cocoa, and coffee also contain sulfur. "}, {"url": "http://livewell.jillianmichaels.com/lowsulfur-diets-5231.html", "passage_text": "Proteins are made up of amino acids, and foods with the amino acid cysteine have high sulfur contents. Most meats contain some sulfur, but red meats have the highest content. Low-sulfur proteins include dark meat chicken, mackerel, mahi mahi, salmon, shrimp, pork and turkey. Read nutrition labels on processed foods because these might contain sulfites. Sulfur dioxide, potassium bisulfite or sodium bisulfite on the ingredients list of packaged foods indicates the presence of sulfites. Jams, potato chips, condiments and canned and frozen foods generally have sulfite additives."}, {"url": "http://www.livingnetwork.co.za/chelationnetwork/food/high-sulfur-sulphur-food-list/", "passage_text": "The only way to determine this is to do a sulfur exclusion trial. Sulfur foods and supplements are those containing a thiol group. Some sulfur foods are not obviously sulfury (like coffee and chocolate). NAC is an example of a thiol supplement. The negative effects of sulfur on high cysteine people may occur over a 4-7 day period after the last sulfur ingestion. The sulfur exclusion trial is done as follows: Many of these misleading ‘sulfur food’ lists on the web are simply indicating the total amount of elemental sulfur, rather than talking about foods that contain thiols, or that metabolically convert into them."}, {"url": "http://www.livestrong.com/article/289250-list-of-foods-high-in-sulfur/", "passage_text": "Cysteine and methionine -- two sulfur-containing amino acids in these foods -- serve as key sources of sulfur for your body's cells. While the majority of amino acid sulfur is needed for making protein, it also serves as a cofactor for certain enzymes, which are substances that help bring about chemical reactions. Protein-rich foods, such as fish, poultry, meats, nuts and legumes, are not only essential for building and maintaining healthy skin, hair and nails, but also are good dietary sources of sulfur."}, {"url": "http://www.livestrong.com/article/289250-list-of-foods-high-in-sulfur/", "passage_text": "Eggs. Eggs are not only a rich source of protein, they're high in sulfur, with the white, or albumen, containing the majority. Each egg yolk contains 0.016 milligram of sulfur, and the white contains 0.195 milligram, according to B. Srilakshmi, author of Food Science.. Protein-rich foods, such as fish, poultry, meats, nuts and legumes, are not only essential for building and maintaining healthy skin, hair and nails, but also are good dietary sources of sulfur."}, {"url": "http://jamaica-gleaner.com/gleaner/20130829/health/health1.html", "passage_text": "One quail's egg offers almost as much sulphur as a serving of meat. Other foods: Other high-sulphur foods include dairy products, chocolate, coffee, tea, grains, sesame seeds, cashews, peanuts, pistachios and other nuts. Sulphur is present in most meats, but I recommend healthier sources of sulphur. Sulphur-rich vegetables contain extremely potent organosulfur compounds that offer special health benefits. Animal sources contain sulphur-rich amino acids, which we do need, but they don't contain the organosulfur compounds in plant foods."}, {"url": "http://healthyeating.sfgate.com/major-sources-dietary-sulfur-4924.html", "passage_text": "Protein Foods. One of sulfur's most important roles is as part of protein molecules. As such, most of the sulfur in your body and your diet is in protein molecules. Protein foods that contain the sulfur amino acids methionine, cystine and cysteine are particularly good dietary sources. Eggs are among the highest dietary sources of sulfur, with meat, poultry and fish also providing large amounts. For vegans and vegetarians, soy products and other legumes are good sources of the sulfur-containing amino acids. Nuts, seeds and grains are also good vegetarian sources of methionine."}, {"url": "http://www.just-health.net/Foods-High-In-Sulfur.html", "passage_text": "Most of the food groups contain at least a few foods that are high in sulfur. The people most likely to be deficient in this mineral are vegans since the list of fruits and vegetables containing sulfur is relatively short and these categories of foods contain relatively low amounts of sulfur. Other vegetables that are high in sulfur are sweet corn, peas, spinach, broccoli, mustard greens, cauliflower, bamboo shoots, cabbage, kale, kohlrabi, asparagus, okra, lettuce, and eggplant. These vegetables contain glucosinolates which are sulfur rich nutrients that may help prevent cancer."}, {"url": "http://livewell.jillianmichaels.com/list-foods-contain-sulfur-5102.html", "passage_text": "Overview. Sulfur is a mineral found in the ground around volcanic craters and hot springs and occurs naturally in some plants, including grains, fruits and vegetables. Protein foods also contain sulfur, which may put vegetarians at risk for developing a sulfur deficiency. The mineral helps form muscles, hair and skin cells. Legumes, such as beans and jicama also contain protein and sulfur. Nuts such as walnuts, almonds, cashews, as well as certain seeds, such as sesame seeds and sunflower seeds, contain sulfur."}]