[{"url": "https://en.wikipedia.org/wiki/Interference_(wave_propagation)", "passage_text": "Constructive interference occurs when the waves are in phase, and destructive interference when they are half a cycle out of phase. Thus, an interference fringe pattern is produced, where the separation of the maxima is. and df is known as the fringe spacing. The energy which is lost at the destructive interference is regained at the constructive interference. One wave is travelling horizontally, and the other is travelling downwards at an angle θ to the first wave. Assuming that the two waves are in phase at the point B, then the relative phase changes along the x-axis."}, {"url": "http://physics.bu.edu/%7Eduffy/py105/WaveInterference.html", "passage_text": "Constructive interference. Constructive interference occurs whenever waves come together so that they are in phase with each other. This means that their oscillations at a given point are in the same direction, the resulting amplitude at that point being much larger than the amplitude of an individual wave. Destructive interference occurs when waves come together in such a way that they completely cancel each other out. When two waves interfere destructively, they must have the same amplitude in opposite directions."}, {"url": "http://www.answers.com/Q/What_is_an_example_of_a_constructive_interference", "passage_text": "This type of in … terference is called constructive interference. on the other hand, when two waves superimposed on each other in the opposit phase (phase diff is 180 degree), then the resultant amplitude becomes the difference of the amplitudes of the two waves. Constructive interference occurs whenever two waves combine to make a wave with a larger amplitude. Destructive interference is when the amplitudes of two waves combine with e … ach other producing a smaller amplitude. + 29 others found this useful. Tariq Islam."}, {"url": "http://physics.tutorvista.com/waves/constructive-interference.html", "passage_text": "1 Constructive interference takes place in sound. 2  The rogue waves in the ocean are the example of constructive interference. 3  When two speakers are put one meter apart and run we get constructive interference between the sound waves. 4  Beats are the example of constructive interference. Constructive Interference: The constructive interference takes place when the phase difference between the two waves is: $\\phi$ = 0, 2 $\\pi$, 4 $\\pi$........... The resultant wave amplitude and intensity are maximum. a = $\\sqrt{(a_{1}^{2} + a_{2}^{2} + 2 a_{1} a_{2} cos \\phi)}$."}, {"url": "https://simple.wikipedia.org/wiki/Interference", "passage_text": "Destructive interference: When the top of one wave meets the trough (bottom) of another wave in the middle, the water stays flat. Constructive interference: When the tops of two waves meet in the middle a taller wave is seen. Constructive interference happens when two or more waves are in the same space and in phase. When this happens, the waves' amplitudes add together and the total is greater than the amplitude of any of the waves by themselves. This causes the waves to appear more intense. "}, {"url": "http://study.com/academy/lesson/constructive-and-destructive-interference.html", "passage_text": "Principle of Superposition. Constructive interference describes a situation where two waves are added together, while in destructive interference, the two waves cancel each other out. But really, the two types of interference are a result of the same thing. "}, {"url": "http://physics.tutorvista.com/waves/constructive-interference.html", "passage_text": "1 The rogue waves in the ocean are the example of constructive interference. 2  When two speakers are put one meter apart and run we get constructive interference between the sound waves. 3  Beats are the example of constructive interference. Constructive Interference: The constructive interference takes place when the phase difference between the two waves is: $\\phi$ = 0, 2 $\\pi$, 4 $\\pi$........... The resultant wave amplitude and intensity are maximum. a = $\\sqrt{(a_{1}^{2} + a_{2}^{2} + 2 a_{1} a_{2} cos \\phi)}$."}, {"url": "http://physics.tutorvista.com/waves/constructive-interference.html", "passage_text": "Constructive Interference Definition. When two waves of same phase difference or constant phase difference superimpose at some points, where the crust of one wave falls on the crust of the other, a resultant maximum amplitude is obtained. This is called Constructive Wave Interference. Constructive Interference: The constructive interference takes place when the phase difference between the two waves is: $\\phi$ = 0, 2 $\\pi$, 4 $\\pi$........... The resultant wave amplitude and intensity are maximum. a = $\\sqrt{(a_{1}^{2} + a_{2}^{2} + 2 a_{1} a_{2} cos \\phi)}$."}, {"url": "http://www.scienceclarified.com/He-In/Interference.html", "passage_text": "In general, waves can interfere with each other in one of two ways: constructively or destructively. When the crests of two waves and the troughs of two waves arrive at a given spot at the same time, their effects are added to each other. The result is constructive interference. When the crest of one wave and the trough of a second wave arrive at the same time, their effects cancel each other out. The result is destructive interference. Interference of sound waves. Constructive and destructive interference can be detected by the intensity of the result. For example, suppose that two sound waves interfere with each other constructively. In that case, the sound is louder than is the case for either wave individually. "}]