[{"url": "http://thehousingforum.com/how-much-does-it-cost-to-build-a-garage/", "passage_text": "In the example given above, the 728 SF garage and 380 SF loft totals 1108 SF. With some frills, it should cost $35-$45K/SF or $35000-$45000. DIY. One way to save money is to buy materials, perhaps a kit, and do as much of the labor as you can, contracting out what you cannot do."}, {"url": "http://home.costhelper.com/build-garage.html", "passage_text": "1 Upgrading the quality of materials can bump the cost to $55 a square foot, or $13,200 for a minimum single-car structure, $21,000 for a two-car garage and $47,000 or more for the dream version."}, {"url": "http://www.behmdesign.com/garage-building-cost.aspx", "passage_text": "by Jay Behm-A very basic way to estimate the cost of building a detached garage is to simply apply a typical average per square foot construction of $30 to $40. That is for an average cost basis for having a contractor / builder build a basic one story garage for you on your property."}, {"url": "http://www.fixr.com/costs/build-attached-garage", "passage_text": "1 According to author Stu Silverman the average cost of adding a garage begins at roughly $7,500, and for a two-car garage the average costs will go much higher. 2  This sort of structure will average at $27,040. 3  The resale value of this update would hold at $21,635, or a nearly 81% return on investment."}, {"url": "http://home.costhelper.com/build-garage.html", "passage_text": "Grittihs) we got a quote in less than 45 mins. for a 1.5 car garage the estimate is $12,354 for a 2 car garage (with a short approaching driveway) will cost us $16,325 this includes the demolition of old garage, 30 year roof, all electrical, slab, garage door, an entrance door and 1 window."}, {"url": "http://www.rempros.com/costs/building_garage_prices.html", "passage_text": "Cost to build a new 2 car garage will vary from $30 to $41 per square foot for standard construction including labor cost and materials prices."}, {"url": "http://www.homeadvisor.com/cost/garages/build-a-garage/", "passage_text": "NEXT STEP. Find out how much your project will cost. Provide a few details about your project and receive competitive quotes from local pros. The average national cost to build a garage is $23,573, with most homeowners spending between $14,621 and $32,525. When it comes to building a garage, a lot of factors come into play, which mimic other large-scale building projects."}]