[{"url": "http://www.christianheadlines.com/columnists/breakpoint/culture-what-makes-a-good-society.html", "passage_text": "At a time when more and more Americans are looking to government to solve so many of life’s problems, we need a reminder that a good society isn’t built by government dictates but by the shared values of what Edmund Burke called the “little platoons” of society — families, churches, civic groups, and other associations. These and other reasons are why the church is in the culture-shaping business. But Brooks goes a little too far in downplaying the role of government policies. On the one hand, he says that government should not only avoid interfering with culture-building institutions."}, {"url": "http://college-ethics.blogspot.com/2010/02/what-makes-good-society.html", "passage_text": "As Americans watch the political stalemate in Washington, we can’t help but notice the conflicting views on what makes a society good. We might agree that it takes good people to make a good society, people reaching out to people. We might say that it takes good leaders to design a good society. Lyndon B. Johnson spoke of the Great Society which for him meant social reforms designed to eliminate poverty and racial injustice. I think that they counteract each other and we can not have a good society with out both. I also think that if we didn’t have rules and guidelines to follow then we would not know the difference in good and bad. Yes we have a conscience, but that conscience only comes from knowing what is right and wrong."}, {"url": "http://www.citizeneconomists.com/blogs/2009/10/22/what-are-the-characteristics-of-a-good-society/", "passage_text": "So, what are the characteristics of a good society? First, as I suggested in my last post, the most important characteristic of a good society is a set of institutions that enable its members to live together in peace. Third, I think there would be widespread agreement that a good society would provide its members with a degree of security against potential threats to individual flourishing."}, {"url": "http://www.answers.com/Q/What_makes_a_good_society", "passage_text": "Making the world better, one answer at a time. A perfect society is. · Peace. · Tolerance. · A good standard of living for everyone. · Freedom to do what you want without hurting other people. · Stability. · Rich culture: art and other forms of expression and entertainment. · Equality. "}, {"url": "https://answers.yahoo.com/question/index?qid=20070202124403AAJzVLw", "passage_text": "simple... Good People. Think about what it is to be a good person, and how you would respond to another good person. also think how the oter good person would respond to you. then multiply like minded good people to create a good society. you all have the interests of the others and society at heart. Col · 9 years ago"}, {"url": "https://en.wikipedia.org/wiki/Society", "passage_text": "Insofar as it is collaborative, a society can enable its members to benefit in ways that would not otherwise be possible on an individual basis; both individual and social (common) benefits can thus be distinguished, or in many cases found to overlap. A society can also consist of like-minded people governed by their own norms and values within a dominant, larger society. This is sometimes referred to as a subculture, a term used extensively within criminology."}, {"url": "https://en.wikipedia.org/wiki/Society", "passage_text": "For other uses, see Society (disambiguation) . A human society is a group of people involved in persistent social interaction, or a large social grouping sharing the same geographical or social territory, typically subject to the same political authority and dominant cultural expectations. A society can also consist of like-minded people governed by their own norms and values within a dominant, larger society. This is sometimes referred to as a subculture, a term used extensively within criminology."}, {"url": "http://college-ethics.blogspot.com/2010/02/what-makes-good-society.html", "passage_text": "In order to have a good society we need to have good people and good leaders. We have to have good leaders that are strong and know what is right and wrong. Having good people in the society helps the leaders be even better than good. Granted we have our own definitions of good and what is good for you or good for me. I think that they counteract each other and we can not have a good society with out both. I also think that if we didn’t have rules and guidelines to follow then we would not know the difference in good and bad. Yes we have a conscience, but that conscience only comes from knowing what is right and wrong."}]