[{"url": "http://forestry.about.com/od/treephysiology/tp/tree_biology.htm", "passage_text": "A Tree's Cambium. The cambium and its zone is a cell generator (reproductive tissue called growth meristem) that produces both the inner bark cells of the phloem and new living wood cells in the xylem. The phloem transports sugars from leaves to roots. The xylem is a transport tissue and both stores starch and conducts water and substances dissolved in water to leaves. A Tree's Inner Bark."}, {"url": "http://forestry.about.com/od/treephysiology/a/tree_tissue.htm", "passage_text": "Actually, this tissue occupies the space between the dermal tissues and the vascular tissues. These cells are much more than just filler, though. In roots the ground tissue may store sugars or starches to fuel the spring sap flow. In leaves, the ground tissue is that layer doing photosythesis, the mesophyll. Bark or Dermal Tissue. Dermal tissues generally occupy the skin layer of all plant organs including trees. These bark tissues are responsible for controlling environmental conditions that continually interact and effect the tree's outside."}, {"url": "http://dendro.cnre.vt.edu/forsite/treetrunk.htm", "passage_text": "Understanding the trunk of a tree is key to understanding how a tree works, and a primary reason why trees are so useful. The trunk is the part of a tree that connects the leafy crown with its roots. This allows the leaves to obtain water and nutrients that are necessary for the manufacture of food from light energy (photosynthesis). Food made in the leaves is then transported down to the roots and to other parts of the tree for growth. The pipes in the trunk are known as vascular tissue. It is this vascular tissue which we exploit to make paper and other forest products. Wood is primarily made of xylem (tracheids in conifers, vessel elements in hardwoods) that behave very much like a bundle of straws. Try crushing a bundle of straws from the side"}, {"url": "http://www.sactree.com/assets/files/greenprint/toolkit/c/huntsvilleTreeGuide.pdf", "passage_text": "Tree Anatomy THE ANATOMY OF A TREE The major parts of a tree are leaves, flowers and fruit, trunk and branches, and roots. LEAVES Leaves are basically sheets (or sticks) of spongy living cells connected by tubular conducting cells to the plumbing system of the tree. "}, {"url": "http://forestry.about.com/od/treephysiology/a/tree_tissue.htm", "passage_text": "Tree tissues are made up mostly of three basic groups: dermal tissue (bark), ground tissue (roots) and vascular tissue (under bark). Bark or Dermal Tissue. Dermal tissues generally occupy the skin layer of all plant organs including trees. These bark tissues are responsible for controlling environmental conditions that continually interact and effect the tree's outside."}, {"url": "http://dendro.cnre.vt.edu/forsite/tait2.htm", "passage_text": "The trunk of a tree is composed of several basic parts. The bark of the tree is probably one of the most familiar parts of a tree. The bark is an outer covering of dead tissue, which protects the tree from weather, disease, insects, fire and mechanical injury. Bark characteristics can vary greatly from tree to tree and can be useful in identification. The next portion of the trunk is called the vascular cambium. The cambium is a very thin layer of living tissue which produces new phloem to its outside and new xylem to its inside. The cambium is most active in the spring and early summer when most tree growth is taking place."}, {"url": "http://hort.ifas.ufl.edu/woody/lower-trunk.shtml", "passage_text": "The lower trunk is where trunk tissue meets with root tissue. It receives all the mechanical stress from other portions of the tree canopy. It must be strong enough to hold the weight of the tree, even in windy weather. As a result, defects in this portion of the plant can result in catastrophic tree failure. "}, {"url": "https://en.wikipedia.org/wiki/Tree_trunk", "passage_text": "The base of a Yellow Birch trunk. In botany, trunk (or bole) refers to the main wooden axis of a tree, which is an important diagnostic feature in tree identification, and which often differs markedly from the bottom of the trunk to the top, depending on the species. "}, {"url": "https://www.ncforestry.org/teachers/parts-of-a-tree/", "passage_text": "Phloem/Inner Bark The phloem or inner bark, which is found between the cambium and the outer bark, acts as a food supply line by carrying sap (sugar and nutrients dissolved in water) from the leaves to the rest of the tree. Bark The trunk, branches and twigs of the tree are covered with bark. The crown, which consists of the leaves and branches at the top of a tree, plays an important role in filtering dust and other particles from the air. It also helps cool the air by providing shade and reduces the impact of raindrops on the soil below."}]