[{"url": "https://answers.yahoo.com/question/index?qid=20060926142409AA7T7VB", "passage_text": "Tropical rainforests are warm, wet forests with many tall trees. They grow in a narrow zone near the equator. Tropical rainforests are found in Africa, Asia, Australia, and Central and South America. The largest rainforest in the world is the Amazon rainforest in South America. Tropical rainforests are home to a huge number of different plants and animals. All tropical rainforests are endangered. All tropical rainforests are found in a belt wrapping around the equator of the earth. This region is called the tropics. In the tropics the sun shines directly overhead about the same length of time every day, each day of the year. As a result, temperature is the same most days of the year."}, {"url": "http://www.experts123.com/q/why-are-most-of-the-worlds-tropical-rainforests-found-near-the-equator.html", "passage_text": "0. It is called a rain forest because at the end of the day you will find that it will always rain. The sun heats the earth and warms the air above it. As it rises it cools and forms clouds. By the time this has happened it is the end of the day and it starts to pour down. The sun only heats the earth to a temperature high enough near the equator because that part is nearest the sun. You won't find this happening anywhere else except the equator and so you don't find tropical rainforests anywhere esle"}, {"url": "https://en.wikipedia.org/wiki/Tropical_rainforest", "passage_text": "These rainforests can be found in Asia; Australia; Africa; South America; Central America; the U.S. of Florida and Hawaii; as well as Mexico and on many of the Pacific, Caribbean, and Indian Ocean islands. 1 Lowland equatorial evergreen rain forests are forests which receive high rainfall (more than 2000 mm, or 80 inches, annually) throughout the year. 2  These forests occur in a belt around the equator, with the largest areas in the Amazon basin of South America, the Congo Basin of Central Africa, Indonesia, and New Guinea."}, {"url": "http://www.answers.com/Q/Why_are_tropical_rainforests_near_the_Equator", "passage_text": "A tropical rainforest is typically hot year round with little temperature change from month to month. Tropical rainforests are near the equator because the climate there is warm, very wet and constant due to the position of the sun over the equator; it's always directly overhead. The plants that live there thrive in these conditions. There are only two seasons in the tropical rainforests: wet season and dry season. Confidence votes 86. The region around the equator is the tropics (both north and south), so any rainforest around the equator which is in the tropics is a tropical rainforest. A rainforest can exist (and does exist) outside the tropics."}, {"url": "https://en.wikipedia.org/wiki/Tropical_rainforest", "passage_text": "The tropical rainforests of South America contain the largest diversity of species on earth. A tropical rainforest is a biome type that occurs roughly within the latitudes 28 degrees north or south of the equator (in the equatorial zone between the Tropic of Cancer and Tropic of Capricorn). This ecosystem experiences high average temperatures and a significant amount of rainfall. 1 Lowland equatorial evergreen rain forests are forests which receive high rainfall (more than 2000 mm, or 80 inches, annually) throughout the year. 2  These forests occur in a belt around the equator, with the largest areas in the Amazon basin of South America, the Congo Basin of Central Africa, Indonesia, and New Guinea."}, {"url": "http://www.savetherainforest.org/savetherainforest_012.htm", "passage_text": "Temperate rainforests are found in the area of the earth known as the temperate zones. Areas that include temperate rainforests are the pacific coast of the United States and Canada, New Zealand, Tasmania, Chile, Ireland, Scotland and Norway. There are fewer temperate forests.. Also they cover a lot less area. Tropical are found close to the equator. Temperate are found along coasts in the temperate zone. Tropical rainforests are located close to the equator, an area known as the tropic zone. Most are in the area between the Tropic of Cancer. and the Tropic of Capricorn."}, {"url": "http://www.savetherainforest.org/savetherainforest_012.htm", "passage_text": "Tropical rainforests are found in South and Central America, Africa, Australia, and Asia. Tropical rainforests cover only about 6% of the Earth's surface. The largest tropical rain forest are in the Amazon River Basin, the Congo River Basin, and throughout much of southeast Asia. Tropical are found close to the equator. Temperate are found along coasts in the temperate zone. Tropical rainforests are located close to the equator, an area known as the tropic zone. Most are in the area between the Tropic of Cancer. and the Tropic of Capricorn."}, {"url": "http://www.cotf.edu/ete/modules/msese/earthsysflr/rforest.html", "passage_text": "Tropical Rainforest The tropical rainforest is a hot, moist biome found near Earth's equator. The world's largest tropical rainforests are in South America, Africa, and Southeast Asia. Tropical rainforests receive from 60 to 160 inches of precipitation that is fairly evenly distributed throughout the year."}]