[{"url": "http://healthquestions.medhelp.org/does-estrogen-patch-cause-weight-gain", "passage_text": "Most of the shift is due to the estrogen. Estrogen will not cause weight gain ..it is the loss of estrogen that causes much of this. Yeah, I wouldn't want you to try the bodyrolling massage for adhesions since it sounds like you are dealing with something different. There have been a number of studies on estrogen and weight gain and estrogen is believed not to increase weight. Many women do gain weight and believe it is due to estrogen, but the studies don't support it. Some increase in breast size and some fluid retention do happen. Having your ovaries out can also affect your thyroid hormone levels and that can cause weight gain. Ask your doctor to check your thyroid levels"}, {"url": "https://www.bodylogicmd.com/for-women/hormones-and-weight-gain", "passage_text": "This means weight gain. Progesterone: It is also common for progesterone levels to decrease during menopause. Progesterone's role in weight gain is more deceiving; low levels of the hormone do not actually cause you to gain weight, but instead cause water retention or bloating. Hormones and weight gain go hand in hand. So, menopause weight gain is actually hormone weight gain. Estrogen: It is common for estrogen levels to diminish during menopause causing cessation of ovulation. The decreased production of estrogen by the ovaries causes a woman's body to search for other sources of estrogen."}, {"url": "http://healthquestions.medhelp.org/estrogen-patch-and-weight-gain", "passage_text": "There have been a number of studies on estrogen and weight gain and estrogen is believed not to increase weight. Many women do gain weight and believe it is due to estrogen, but the studies don't support it. Some increase in breast size and some fluid retention do happen. Having your ovaries out can also affect your thyroid hormone levels and that can cause weight gain. Ask your doctor to check your thyroid levels. There is some evidence that the patch might have a slightly lower risk of blood clots because it does not go into the intestinal tract and bypasses your liver. Weight gain should not differ between one form of estrogen and the other."}, {"url": "http://www.everydayhealth.com/drugs/estradiol", "passage_text": "Estradiol is a form of estrogen, a female sex hormone that's produced by the ovaries. Estradiol comes in an oral form, a transdermal skin patch, a vaginal ring, or as a topical gel, spray, or emulsion. Estradiol gel is also used to treat vaginal dryness, itching, and burning in menopausal women. Estradiol is also commonly combined with progestins in various doses in oral contraceptive pills that prevent pregnancy by preventing ovulation."}, {"url": "http://www.hystersisters.com/vb2/showthread.php?t=416208", "passage_text": "Ovaries: Removed both. Re: vivelle patch and weight gain!!!!! It is not the patch itself that causes weight gain, but hormone imbalance can cause weight gain. Many times women will blame it on the estrogen, but it might be from menopause. thyroid issues or too much or too little estrogen. You can read more about this and much more in the articles at www.hormonejungle.com. One reason to consider if your patch is making you gain weight-get your thyroid levels checked! If your thyroid is low, or if you're using thyroid replacement hormones, and you do not have progesterone on board, then the estrogen will compete with thyroid for binding sites."}, {"url": "http://www.chatelaine.com/health/diet/how-having-too-much-estrogen-can-make-you-gain-weight/", "passage_text": "Estrogen balance is essential for achieving and maintaining fat loss. In men and premenopausal women, too much estrogen — a condition called estrogen dominance — causes toxic fat gain, water retention, bloating, and a host of other health and wellness issues. While premenopausal women with too much estrogen tend to have the pear-shaped body type — with more weight at the hips — both men and menopausal women with this estrogen excess exhibit an apple shape with more fat accumulation in the abdominal area."}, {"url": "http://healthquestions.medhelp.org/estrogen-patch-and-weight-gain", "passage_text": "Progesterone is a natural diuretic and in theory should not cause weight gain and in fact can promote weight loss when necessary (estrogen is cited as a weight maintainer). But, I started to balloon. Talk about distress. My middle grew about six inches and my poor little 36 barely A's were crying for a larger bra. There is some evidence that the patch might have a slightly lower risk of blood clots because it does not go into the intestinal tract and bypasses your liver. Weight gain should not differ between one form of estrogen and the other."}]