[{"url": "http://www.grindtv.com/travel/much-cost-climb-mt-everest/", "passage_text": "For logistical and support purposes, most people climb the south side of Everest in Nepal, where the permit costs $11,000. They can save a bit of money by traveling to the north side in Tibet, however, where the cost is about $7,000. Other climbing fees: $1,500. Sherpas: $5,000 each. Most teams assign a climbing Sherpa to each of their clients to ensure they stay safe on the mountain. The cost of hiring each Sherpa is $5,000 alone. A few teams will even provide two Sherpas for each climber as a safety measure, driving costs even higher."}, {"url": "http://www.thelongestwayhome.com/travel-resources/trekking/mount-everest-base-camp-trek-cost.html", "passage_text": "This is the second cheapest cost for getting to Everest Base Camp. 1  Prices range from USD$150-400 with bargaining. 2  Prices for porter only include: the porter! 3  Price doesn't include: Kathmandu to Lukla flights, accommodation, permits, meals, travel insurance, visa fees, trekking equipment, drinking water. The average cost of a room along the Everest Base camp trail is between $2-6. Above that and you are looking at ensuite's and room heaters. If you are on a package tour your accommodation will be paid for already."}, {"url": "http://www.livescience.com/32851-do-not-post-why-does-a-permit-to-climb-mt-everest-cost-70000.html", "passage_text": "Why does it cost so much to climb a mountain? The permit is issued per expedition, with about seven to ten people on each permit, said Dennis Broadwell, owner of Mountain Gurus, a company that offers guided mountain treks to Mount Everest. Tseten Sherpa, a 9-year-old boy from Nepal, plans to break a world record by becoming the youngest person to scale Mount Everest, the tallest mountain above sea level. But the 29,035-foot summit (8850 meters) might not be his biggest challenge: scaling the mountain's peak comes with a hefty price tag."}, {"url": "http://www.cbc.ca/news/world/mount-everest-climb-carries-hefty-price-tag-1.1168761", "passage_text": "Mount Everest climb carries hefty price tag. CBC News Posted: May 23, 2012 5:15 AM ET Last Updated: May 23, 2012 5:14 AM ET. While climbing Mount Everest takes its toll, as the world learned this week, it also comes with a hefty price tag. At 8,848 metres, the mountain's summit is the highest point on earth. (Tim Chong/Reuters). "}, {"url": "https://en.wikipedia.org/wiki/Mount_Everest", "passage_text": "Mount Everest, also known in Nepal as Sagarmāthā and in Tibet as Chomolungma, is Earth 's highest mountain. It is located in the Mahalangur mountain range in Nepal. Its peak is 8,848 metres (29,029 ft) above sea level. It is not the furthest summit from the centre of the Earth. The international border between China and Nepal runs across Everest's precise summit point. Its massif includes neighbouring peaks Lhotse, 8,516 m (27,940 ft); Nuptse, 7,855 m (25,771 ft) and Changtse, 7,580 m (24,870 ft)."}, {"url": "http://gizmodo.com/5887413/how-much-does-it-cost-to-climb-mount-everest-more-than-a-porsche", "passage_text": "And all those things cost a lot of money! Like $83,000 a lot of money. Arnette details the three ways you can climb Mount Everest: putting together your own expedition, joining a logistics only expedition or joining a fully guided expedition. "}, {"url": "http://www.outsideonline.com/1929131/how-much-does-it-cost-climb-everest", "passage_text": "Share Tweet Email. High-altitude mountaineering is a pay-to-play game. If you’re going to attempt to climb Mount Everest you're going to shell out a minimum of $30,000. Most western guiding companies charge around $65,000, and if you’re going all-out on a private expedition with an imported chef and constant access to Instagram, your trip might run as high as $100,000"}, {"url": "http://business.time.com/2012/01/23/the-economics-of-everest/", "passage_text": "The Everest climbing cost is US$ 35,000.00 - US$ 40,000.00 in range which provide all logistic during the climb except your personal gear about US$ 10,000.00 and extra summit tips for Sherpa cost occur up to US$ 3,000.00 and the total spend about US$ 50,000.00 in approx range. Everest is not the place to skimp on the grade of your down jacket. Buying a cheaper featherweight on your summit mittens might cost you a hand to frostbite. I never knew gloves could cost $300 or that I would own two pairs of them. The Arc’Teryx hard shells start at $600, and down suits run closer to $1,000."}, {"url": "http://business.time.com/2012/01/23/the-economics-of-everest/", "passage_text": "The Climb—$35,000 to $100,000. An Everest climb starts at around $35,000 because mountain permits begin at $10,000 (the price varies based on the number in the expedition). In addition, a virtual village of Sherpas—porters, cooks, and guides—is required to get you to the top. Everest is not the place to skimp on the grade of your down jacket. Buying a cheaper featherweight on your summit mittens might cost you a hand to frostbite. I never knew gloves could cost $300 or that I would own two pairs of them. The Arc’Teryx hard shells start at $600, and down suits run closer to $1,000."}]