[{"url": "http://www.livestrong.com/article/23407-kind-antibiotics-used-diverticulosis/", "passage_text": "Ciprofloxacin (or Cipro) is an antibiotic used to treat bacterial infections such as diverticulitis. Ciprofloxacin stops the multiplication of bacteria by its inhibition and reproduction of the bacteria's DNA. This antibiotic can cause such side effects as headaches, rashes, nausea and vomiting and restlessness. A low-fiber diet and liquid are recommended with acute attacks of diverticulitis. Low residue that lacks in material substance lowers the chances of increased aggravation inside the colon. In severe cases, patients may be hospitalized and given intravenous antibiotics."}, {"url": "http://www.webmd.com/digestive-disorders/tc/diverticulitis-medications", "passage_text": "Medicines to stop infection and to control symptoms often are used to treat attacks of diverticulitis. 1  Antibiotics are given to treat the infection causing the attack. "}, {"url": "http://www.ehow.com/about_5747621_antibiotics-used-treat-diverticulitis_.html", "passage_text": "Shares & Saves. Save. Diverticulitis is the swelling or inflammation that causes pouches in the intestinal wall. It is a common digestive problem and can affect any part of the digestive system, such as the esophagus, small intestine or the stomach, although it is commonly found in the large intestine. Side Effects. The side effects of antibiotics prescribed for diverticulitis often include nausea, changes in appetite, headache, vomiting, skin rash and fever."}, {"url": "http://www.aafp.org/afp/2013/0501/p612.html", "passage_text": "Patients often present with acute, constant abdominal pain that is usually in the left lower quadrant. 1, 9 Other possible symptoms include anorexia, constipation, nausea, diarrhea, and dysuria. 1 Patients may have a history of diverticulosis or diverticulitis. "}, {"url": "http://www.nhs.uk/Conditions/Diverticular-disease-and-diverticulitis/Pages/Treatment.aspx", "passage_text": "Some types of antibiotics used to treat diverticulitis can cause side effects in some people, including vomiting and diarrhoea. Your GP may recommend that you stick to a fluid-only diet for a few days until your symptoms improve. Treatment at home. Mild diverticulitis can often be treated at home. Your GP will prescribe antibiotics for the infection and you should take paracetamol for the pain. It's important that you finish the complete course of antibiotics, even if you are feeling better."}, {"url": "http://www.ehow.com/about_5747621_antibiotics-used-treat-diverticulitis_.html", "passage_text": "Some of the common antibiotics prescribed for diverticulitis include ciprofloxacin, metronidazole, cephalexin and doxycycline. Antibiotics will help to kill bacteria that are present in the gastrointestinal tract. Side Effects. The side effects of antibiotics prescribed for diverticulitis often include nausea, changes in appetite, headache, vomiting, skin rash and fever."}, {"url": "http://www.perfecthealthfit.com/diverticulitis-antibiotics", "passage_text": "The three most common Diverticulitis antibiotics prescribed by doctors are Doxycycline, Ciprofloxacin, and Metronidazole. As with any other types of medication, each of these four types of antibiotics have certain possible side effects that patients may experience during the time of use. "}, {"url": "http://emedicine.medscape.com/article/173388-treatment", "passage_text": "Medical Care. The approach to the treatment of diverticulitis can be broadly classified into either uncomplicated disease or complicated disease, with a few other special considerations to take into account. Acute uncomplicated diverticulitis is successfully treated in 70-100% of patients with conservative management. 1 One typical oral antibiotic regimen is a combination of ciprofloxacin (or trimethoprim-sulfamethoxazole) and metronidazole. 2  Moxifloxacin is appropriate monotherapy for outpatient treatment of uncomplicated diverticulitis. 3  Amoxicillin/clavulanic acid monotherapy is acceptable as well"}, {"url": "http://www.emedexpert.com/conditions/diverticulitis.shtml", "passage_text": "Signs and symptoms of diverticulitis depend on the location of the affected diverticulum, the severity of the inflammatory process, and the presence of complications. The most common symptoms are: 1  Left lower quadrant pain (70% of patients). 2  Change in bowel habits. 3  Nausea and vomiting. 4  Constipation. 5  Diarrhea. 6  Flatulence. 7  Bloating. "}]