[{"url": "http://www.glynns.co.uk/ruptured-bowel/causes-of-a-ruptured-bowel.php", "passage_text": "Causes Of A Ruptured Bowel. The main causes of a ruptured bowel are as follows: 1  A blockage of the intestine; 2  Sufferers of Crohns disease may be more likely to develop a ruptured bowel; 3  Trauma to the bowel can lead to rupture/perforation; and. 4  A rupture can also be caused during surgery to the surrounding area."}, {"url": "http://articles.submityourarticle.com/what-is-a-ruptured-bowel--134430", "passage_text": "Such a rupture is considered a medical emergency, as it is highly likely that-if not treated immediately-the contents of the bowel will empty into the abdominal cavity. This can lead to serious complications, from sepsis (infection of the blood) to death in the most severe cases."}, {"url": "http://www.livestrong.com/article/16444-causes-ruptured-colon/", "passage_text": "Another condition that can cause rupture of the colon is colon cancer. Colon cancer occurs when small growths (known as polyps) begin to divide more rapidly than normal. The tumors then can cause the rupture of the organ by causing swelling and pressure, which can also lead to fecal impaction."}, {"url": "http://www.freemd.com/ruptured-intestine/overview.htm", "passage_text": "A person with a perforated bowel has a hole in the wall of the stomach, small intestine, or large intestine. The perforated bowel allows food or stool to leak into the abdomen."}, {"url": "http://www.glynns.co.uk/ruptured-bowel/index.php", "passage_text": "The most common causes of a bowel rupture is a penatration injury, such as during surgery or through a knife wound. However, crushing injuries which can occur during car accidents or other accidents can also cause a bowel to rupture."}, {"url": "http://www.lifescript.com/health/centers/ulcerative_colitis/s.aspx?query=ruptured+intestine", "passage_text": "Left untreated, your colon can rupture, causing bacteria from the colon to enter your abdominal cavity. A ruptured colon requires emergency surgery and may be fatal. ... A perforated bowel can spill bacteria from the intestine into your abdominal cavity, leading to a life-threatening ..."}, {"url": "http://www.livestrong.com/article/16444-causes-ruptured-colon/", "passage_text": "One cause of a ruptured colon is a condition known as diverticulosis. Diverticulosis is a condition in which small parts of the colon become wrapped around blood vessels, muscle, or the organ itself, causing the blood flow to that portion of the colon to be cut off."}, {"url": "http://articles.submityourarticle.com/what-is-a-ruptured-bowel--134430", "passage_text": "* Bowel changes (such as constipation, diahorrea, or blood in the stool.) . Diagnosis and Treatment Of A Ruptured Bowel. A ruptured bowel is usually diagnosed by an X-Ray or a CT scan which shows the air that has escaped into the peritoneal cavity. Once diagnosis has been confirmed, the rupture must be treated immediately."}, {"url": "http://www.glynns.co.uk/ruptured-bowel/causes-of-a-ruptured-bowel.php", "passage_text": "The main causes of a ruptured bowel are as follows: 1  A blockage of the intestine; 2  Sufferers of Crohns disease may be more likely to develop a ruptured bowel; 3  Trauma to the bowel can lead to rupture/perforation; and."}]