[{"url": "http://homepage.smc.edu/wissmann_paul/physiology/THECRANIALNERVES.pdf", "passage_text": "Other causes of damage to these nerves include head traumaand tearing of the nerves, smoking, cocaine, or brain tumors impinging on the nerves. Optic Nerve (CN-II): Sensory for vision. Its nerve arise from the ganglion cells of the retina and pass through theoptic foramen (optic canal). "}, {"url": "http://medical-dictionary.thefreedictionary.com/optic+canal", "passage_text": "The short canal through the lesser wing of the sphenoid bone at the apex of the eye socket through which the optic nerve and the ophthalmic artery pass. the direct passage through the omasum from the reticulum to the abomasum. optic canal. a passage for the optic nerve through the cranium into the orbit. palatine canal. formed by the maxilla and the palatine bone; transmits the palatine artery and nerve."}, {"url": "http://anatomy.uams.edu/AnatomyHTML/reviewcranialnn.html", "passage_text": "Review of Cranial Nerves. 1  The bony opening in the cranial cavity through which it exits. 2  Its general course and the branches that have been discussed in lecture. 3  Any additional openings in bone that the nerve or its branches pass through. 1 Any additional openings in bone that the nerve or its branches pass through. 2  Whether it is somatic or visceral, motor or sensory, general or special, and if it carries pre-or postganglionic parasympathetic fibers."}, {"url": "http://www.answers.com/Q/What_passes_through_the_optic_foramen", "passage_text": "Spinal cord passes through the vertebral foramen of vertebrae C1-C7, T1-T12 and L1 (sometimes L2). Cauda equina (nerve roots of lower spinal cord) pass through the vertebral … foramen of vertebrae L3-L5 and the sacral canal. Spinal nerve roots pass through all of the intervertebral foramen and the sacral foramen. (From Wikipedia) The internal carotid artery passes superiorly from the carotid canal in the base of the skull, emerging via that part of the foramen lacerum which is not occl … uded by cartilage."}, {"url": "http://www.vnsmessageboard.com/index.php?topic=4224.0", "passage_text": "These nerves all pass through the superior orbital fissure, a foramen in the sphenoid bone at the rear of the eye socket. Cranial nerve 3, the oculomotor nerve, is a motor nerve that controls muscles around the eye, as well as the ability of the pupil to respond to light changes. Cranial nerve 6, the abducent nerve, is a motor nerve that allows the eye to move laterally. Cranial Nerve 5, Maxillary Branch. The maxillary branch of the trigeminal nerve, a sensory branch that supplies the upper lip, sinuses and palate, passes through the foramen rotundum, an opening in the middle of the skull."}, {"url": "http://medical-dictionary.thefreedictionary.com/optic+canal", "passage_text": "n. The short canal through the lesser wing of the sphenoid bone at the apex of the eye socket through which the optic nerve and the ophthalmic artery pass. Also called optic foramen. the direct passage through the omasum from the reticulum to the abomasum. optic canal. a passage for the optic nerve through the cranium into the orbit. palatine canal. formed by the maxilla and the palatine bone; transmits the palatine artery and nerve."}, {"url": "http://anatomyzone.com/tutorials/musculoskeletal/foramina-of-the-skull-and-the-structures-that-pass-through/", "passage_text": "You can see this bit here, which is the optic chiasm. This nerve passes through the optic canal. We can look that from – this is cranial nerve II and you can see it passing through this hole here, so the optic chiasm lies here and the optic nerves run out through the optic canal. It’s this hole here. And what you’ve got, as you can see, you’ve got the second branch of the trigeminal, which passes through this. The foramen rotundum allows the maxillary branch of the trigeminal nerve to pass through. You can see that on either side, this branch here."}, {"url": "http://medical-dictionary.thefreedictionary.com/optic+canal", "passage_text": "optic canal a passage for the optic nerve and ophthalmic artery at the apex of the orbit; called also optic foramen. pulp canal root canal. root canal that part of the pulp cavity extending from the pulp chamber to the apical foramen. Called also pulp canal. the direct passage through the omasum from the reticulum to the abomasum. optic canal. a passage for the optic nerve through the cranium into the orbit. palatine canal. formed by the maxilla and the palatine bone; transmits the palatine artery and nerve."}, {"url": "https://en.wikipedia.org/wiki/List_of_foramina_of_the_human_body", "passage_text": "Within the vertebral column (spine) of vertebrates, including the human spine, each bone has an opening at both its top and bottom to allow nerves, arteries, veins, etc. to pass through. The human skull has numerous holes (foramina) through which cranial nerves, arteries, veins and other structures pass."}]