[{"url": "http://www.naukrihub.com/recruitment/recruitment-process.html", "passage_text": "The recruitment and selection is the major function of the human resource department and recruitment process is the first step towards creating the competitive strength and the strategic advantage for the organisations. A general recruitment process is as follows: 1  Identifying the vacancy: Identifying the vacancy:The recruitment process begins with the human resource department receiving requisitions for recruitment from any department of the company."}, {"url": "http://www.kellyocg.com/Solutions/Recruitment_Process_Outsourcing/What_is_a_Recruitment_Process/", "passage_text": "A Recruitment Process is an organization-specific model of how the sourcing of new employees is undertaken. Typically the ownership of the recruitment process resides within the Human Resources function, although again this may differ depending on the specific organizational structure. A recruitment process can be broken down into respective parts."}, {"url": "https://en.wikipedia.org/wiki/Recruitment", "passage_text": "Recruitment refers to the overall process of attracting, selecting and appointing suitable candidates for jobs (either permanent or temporary) within an organization. These are the steps taken by a recruiter in order to select the best qualified candidate for a position/job in an organization. The process is a guide to how recruitment and selection should be carried out."}, {"url": "https://en.wikipedia.org/wiki/Recruitment", "passage_text": "Internal recruitment (not to be confused with internal recruiters !) refers to the process of a candidate being selected from the existing workforce to take up a new job in the same organization, perhaps as a promotion, or to provide career development opportunity, or to meet a specific or urgent organizational need. These are the steps taken by a recruiter in order to select the best qualified candidate for a position/job in an organization. The process is a guide to how recruitment and selection should be carried out."}, {"url": "http://www.rpoassociation.org/blog/bid/266335/What-is-Recruitment-Process-Outsourcing-RPO", "passage_text": "The Recruitment Process Outsourcing Association (RPOA) defines RPO as “a form of business process outsourcing where an employer transfers all or part of its recruitment processes to an external provider. What RPO is Not Recruitment Process Outsourcing is not remote recruiting or giving your recruiting responsibilities away to someone else. It is not a one-size-fits-all solution, or necessarily an alternative to in-house recruiters or human resource professionals."}, {"url": "http://www.kellyocg.com/Solutions/Recruitment_Process_Outsourcing/What_is_a_Recruitment_Process/", "passage_text": "Whilst the naming and exact process steps are unique to an organization, a typical recruiting process may commence with the identification of a vacancy, then the preparation of a job description, database sourcing, role marketing, response management, short-listing, interviews, reference checking, and selection. Typically the ownership of the recruitment process resides within the Human Resources function, although again this may differ depending on the specific organizational structure. A recruitment process can be broken down into respective parts."}, {"url": "http://smallbusiness.chron.com/definition-recruitment-selection-process-2526.html", "passage_text": "Sourcing Candidates. This is the first step in the recruitment and selection process. Sourcing candidates means your employment specialist is using a variety of methods to find suitable candidates for job vacancies. "}, {"url": "http://www.kellyocg.com/Solutions/Recruitment_Process_Outsourcing/What_is_a_Recruitment_Process/", "passage_text": "The recruitment process itself is the focus of BPO approaches such as recruitment process outsourcing, where an external service provider is engaged to deliver the process. Typically the ownership of the recruitment process resides within the Human Resources function, although again this may differ depending on the specific organizational structure. A recruitment process can be broken down into respective parts."}, {"url": "https://www.recruiter.com/recruitment-process.html", "passage_text": "Recruitment Process Resources. Internal corporate recruiters usually design and manage the hiring and recruitment process. An efficient recruitment process is of course important to both employer and candidate. An unsatisfied employee is also not as productive. The recruitment process begins first with a vacancy created by a new position, a termination of an employee, a promotion, or an employee's resignation. Next the position is evaluated and the job description is written to match it. After that, the qualifications for candidates are written"}]