[{"url": "http://ww2.kqed.org/news/2014/08/29/is-earthquake-insurance-worth-the-cost/", "passage_text": "How much does earthquake insurance cost? The statewide average is about $800 per year, but in San Francisco it costs more — about $2,000-$5,000 per year for a 1,400-square-foot home."}, {"url": "http://www.bankrate.com/finance/insurance/earthquake-insurance-sturdier-home-coverage-1.aspx", "passage_text": "Earthquake insurance premiums could exceed the cost of your homeowners policy in high-risk regions, the CEA's Pomeroy says. Annual coverage rates in California average about $1.75 per $1,000 of coverage, while premiums in lower-risk states can cost as little as 50 cents per $1,000. 1  Share this story. 2  LinkedIn."}, {"url": "http://personalfinance.costhelper.com/earthquake-insurance.html", "passage_text": "1 The average cost statewide is $500, but it can be more than $3,000 a year. 2  Most rates in California are set by the California Earthquake Authority and can be estimated at Earthquake Authority.com."}, {"url": "http://www.howmuchisit.org/earthquake-insurance-cost/", "passage_text": "1 In a state such as California, where earthquakes are quite common, the average bill can vary from $450 to $3,500 a year, depending on the size of your home, the structure and a few other factors. 2  The CEA (California Earthquake Authority) has a simple calculator that you can use to get a fairly accurate quote."}, {"url": "http://www.insure.com/home-insurance/quake.html", "passage_text": "For instance, if the cost to rebuild your house after a quake is $100,000 and your policy has a 2 percent deductible, you would be responsible for the first $2,000. Residents of California can buy insurance from the California Earthquake Authority (CEA) through participating insurance companies."}, {"url": "http://www.howmuchisit.org/earthquake-insurance-cost/", "passage_text": "1 Depending on the deductible that you choose, you can chose policies varying from $10 to as much as $30+ per $100,000. 2  For example, according to UtahEarthquakeInsurance.com, if you had a home worth $200,000, you may pay around $28 per month extra with their policy."}]