[{"url": "http://www.myrecipes.com/how-to/cooking-questions/substitute-evaporated-milk", "passage_text": "If you don't have any, make your own: To produce 1 cup of evaporated milk, simmer 2 1/4 cups of regular milk down until it becomes 1 cup. In many recipes, evaporated milk may also be replaced with a combination of whole milk and half-and-half. "}, {"url": "http://www.wikihow.com/Make-Condensed-Milk", "passage_text": "How to Make Condensed Milk. Three Methods: Condensed milk Microwave condensed milk Indian condensed milk. Condensed milk is used for a variety of dessert recipes. These homemade versions are great to whip up if you are out of stock and don't wish to pay much money for that little can at the store."}, {"url": "http://www.cheesemaking.com/learn/faq/milk.html", "passage_text": "In whole milk, the butterfat (cream) is usually 3.5-4%.). If you have to use milk with little or no butterfat, you can usually add herbs or spices to your cheese to make it taste better. Also, there are some cheeses, like Parmesan, that are traditionally made with partially skimmed milk. Goat's milk is similar to cow's milk, except that the fat globules are smaller and more easily digested. Also, it has no carotene, so it produces a whiter cheese. Sheep's milk has twice the solids as cow's milk, so the cheese yield is higher. The butterfat content of sheep's milk is 9%."}, {"url": "http://www.ebay.com/gds/What-can-you-make-with-Goats-Milk-/10000000011902653/g.html", "passage_text": "Well, almost anything that you would make with regular cow's milk can be made with goat's milk: cheese, yogurt, ice cream, butter, etc. You can also add it in liquid or powdered form to recipes for everything to fudge to soap to skin cream! After several people asked us this question, I began to search the internet. We picked the brains of dairy goat keepers. We found lots of cheese recipes, and tons of other stuff. You can make Mozzarella cheese, ricotta cheese, cottage cheese, cultures for cheese making, goat's milk fudge, and more. We've even found a few recipes of other dairy goat keepers online. Most goat dairys will sell goat milk, goat milk butter, and several varieties of goat cheeses"}, {"url": "http://www.thekitchn.com/how-to-make-a-quick-easy-buttermilk-substitute-cooking-lessons-from-the-kitchn-185757", "passage_text": "1 Combine the milk and lemon juice. 2  Measure 1 scant cup of milk. 3  Stir in 1 tablespoon of lemon juice or white vinegar. 4  Let stand 5-10 minutes. 5  Let the mixture stand at room temperature for 5-10 minutes. 6  When it is ready, the milk will be slightly thickened and you will see small curdled bits. Instructions. 1  Combine the milk and lemon juice. 2  Measure 1 scant cup of milk. 3  Stir in 1 tablespoon of lemon juice or white vinegar. 4  Let stand 5-10 minutes. 5  Let the mixture stand at room temperature for 5-10 minutes. 6  When it is ready, the milk will be slightly thickened and you will see small curdled bits."}, {"url": "http://www.foodnetwork.com/recipes/emeril-lagasse/homemade-buttermilk-recipe.html", "passage_text": "Directions. Place the vinegar in a glass-measuring cup, and add enough milk to make 1 cup total liquid. Stir to combine and let stand for 10 to 15 minutes (The mixture will begin to curdle). Use as needed in a recipe, or cover and refrigerate until needed. Recipe courtesy of Emeril Lagasse, 2002. "}, {"url": "http://www.thekitchn.com/10-ways-to-use-up-a-gallon-of-milk-202264", "passage_text": "Here are 10 simple ways to use up leftover milk, from quick and practical projects like homemade mozzarella and yogurt, to treats like homemade strawberry milk and a sweet, smooth liqueur (yes, booze!). And if all that fails, we have one simple tip that will make sure you never waste milk again. Pin it. "}, {"url": "http://www.thekitchn.com/how-to-make-a-quick-easy-buttermilk-substitute-cooking-lessons-from-the-kitchn-185757", "passage_text": "Stir in 1 tablespoon of lemon juice or white vinegar. Let stand 5-10 minutes. Let the mixture stand at room temperature for 5-10 minutes. When it is ready, the milk will be slightly thickened and you will see small curdled bits. Instructions. 1  Combine the milk and lemon juice. 2  Measure 1 scant cup of milk. 3  Stir in 1 tablespoon of lemon juice or white vinegar. 4  Let stand 5-10 minutes. 5  Let the mixture stand at room temperature for 5-10 minutes. 6  When it is ready, the milk will be slightly thickened and you will see small curdled bits."}]