[{"url": "http://www.businessdictionary.com/definition/standardization.html", "passage_text": "The standardization process was good and it made things run a lot smoother and we knew it would be good for business. 3 people found this helpful. If you are going to try out something new you should make sure that it follows the standardization set out before. Formulation, publication, and implementation of guidelines, rules, and specifications for common and repeated use, aimed at achieving optimum degree of order or uniformity in a given context, discipline, or field."}, {"url": "http://www.definitions.net/definition/Standardization", "passage_text": "Standardization. Standardization or standardisation is the process of developing and implementing technical standards. The goals of right standardization can be to help with independence of single suppliers, compatibility, interoperability, safety, repeatability, or quality. "}, {"url": "https://en.wikipedia.org/wiki/Standardization", "passage_text": "Standardization or standardisation is the process of developing and implementing technical standards. Standardization can help to maximize compatibility, interoperability, safety, repeatability, or quality. It can also facilitate commoditization of formerly custom processes. The negative effects of standardization on technology have to do with its tendency to restrict new technology and innovation. Standards shift competition from features to price because the features are defined by the standard. The degree to which this is true depends on the specificity of"}, {"url": "https://en.wikipedia.org/wiki/Standardization", "passage_text": "Standardization can help to maximize compatibility, interoperability, safety, repeatability, or quality. The negative effects of standardization on technology have to do with its tendency to restrict new technology and innovation. Standards shift competition from features to price because the features are defined by the standard. The degree to which this is true depends on the specificity of"}, {"url": "https://en.wikipedia.org/wiki/Standardization", "passage_text": "In social sciences, including economics, the idea of standardization is close to the solution for a coordination problem, a situation in which all parties can realize mutual gains, but only by making mutually consistent decisions. The negative effects of standardization on technology have to do with its tendency to restrict new technology and innovation. Standards shift competition from features to price because the features are defined by the standard. The degree to which this is true depends on the specificity of"}, {"url": "http://www.referenceforbusiness.com/encyclopedia/Sel-Str/Standardization.html", "passage_text": "STANDARDIZATION. Standardization refers to the creation and use of guidelines for the production of uniform, interchangeable components, especially for use in mass production. It also refers to the establishment and adoption of guidelines for conduct. "}, {"url": "http://www.iso.org/iso/home/standards.htm", "passage_text": "A standard is a document that provides requirements, specifications, guidelines or characteristics that can be used consistently to ensure that materials, products, processes and services are fit for their purpose. ISO International Standards ensure that products and services are safe, reliable and of good quality. For business, they are strategic tools that reduce costs by minimizing waste and errors, and increasing productivity."}, {"url": "http://www.investopedia.com/terms/s/standardization.asp", "passage_text": "Standardization can be found in business processes when companies require that a consistent level of quality be achieved. For example, many fast food franchises have detailed processes documented to make sure that a burger is prepared in the same manner regardless of which chain in its franchise a consumer visits. GAAP is a standardized set of guidelines created by the Financial Accounting Standards Board (FASB) to ensure that all financial statements undergo the same processes so that the disclosed information is relevant, reliable, comparable and consistent."}, {"url": "http://www.investopedia.com/terms/s/standardization.asp", "passage_text": "DEFINITION of 'Standardization'. A framework of agreements to which all relevant parties in an industry or organization must adhere to ensure that all processes associated with the creation of a good or performance of a service are performed within set guidelines. GAAP is a standardized set of guidelines created by the Financial Accounting Standards Board (FASB) to ensure that all financial statements undergo the same processes so that the disclosed information is relevant, reliable, comparable and consistent."}]