[{"url": "http://www.homeadvisor.com/cost/additions-and-remodels/build-an-addition/", "passage_text": "NEXT STEP. Find out how much your project will cost. Provide a few details about your project and receive competitive quotes from local pros. The average national cost of adding a room or building an addition is $40,960, with most homeowners spending between $21,711 and $63,014. This data is based on actual project costs as reported by HomeAdvisor members."}, {"url": "http://lindusconstruction.areavoices.com/2013/01/21/keep-your-sanity-this-winteradd-a-mudroom/", "passage_text": "Add an addition. Adding a mudroom addition to your home is not going to cost you an arm and a leg because the standard size for them is usually 6’x6’ or 8’x8’. If you are intending to have your washer and dryer apart of your mudroom area you may want to increase the size of you space."}, {"url": "http://www.houzz.com/Mudroom-Addition", "passage_text": "“In Minnesota you could spend between $1,000 and $8,000 to do a mudroom in a renovation,” Lindstrom says. “For a mudroom addition, you would expect to spend $15,000 and up.” A comment from fern6951 sums it up nicely: “Each person/family has different lifestyles, so each mudroom needs to be designed differently."}, {"url": "http://livingvintageco.com/2013/01/we-built-a-mudroom/", "passage_text": "So, my husband and I started discussing adding on a small mudroom to the back of our house. Last summer when it was time to start our window, insulation and siding replacement project, we knew that the time was then or never to build on a small mudroom."}, {"url": "http://home.costhelper.com/add-room.html", "passage_text": "1 Adding a small 10x12-foot wood deck can run $500-$1,000 for do-it-yourself materials or $1,000-$1,900 to hire someone to build it. 2  A larger deck of wood or plastic composite can be $4,000-$25,000 or more depending on size, materials and complexity."}, {"url": "http://www.thekimsixfix.com/2012/04/adding-mudroom-built-ins-to-garage.html", "passage_text": "Those cost $150 EACH plus she had to add all the wood on the top and build it in herself. For a total cost of $600. It *IS* gorgeous, but I needed to do it for half of that, although she was my inspiration 100%!"}]