[{"url": "http://www.anniemany.com/2013/07/interesting-facts-about-beagles.html", "passage_text": "1 Popularity of Beagles faced the biggest decline when Fox hounds were being used by hunters to hunt bigger animals.After the World war there were almost no Beagles left in England. 2  A healthy Beagles can run up to 25-30 mph. 1 Beagles are thought to be existed in ancient Greeks in 500 BC.They were carried to England when William I came to rule England. 2  Beagles have passed through lots of changes of development.They were breed to be fast and small.In 1700 pocket Beagles were produced having height about 9 inches to fit in hunters pockets."}, {"url": "http://www.houstonbeaglerescue.org/faq/beagles.htm", "passage_text": "However, you should not get a Beagle if you are wanting a dog to run alongside you when you jog, or to run anywhere off-leash. Beagles are scent-hounds, and will follow a scent until they find the animal, food, or whatever they are tracking. "}, {"url": "http://www.anniemany.com/2013/07/interesting-facts-about-beagles.html", "passage_text": "1 A healthy Beagles can run up to 25-30 mph. 2  Beagles were bred to hunt and they need proper training to learn how to behave with other small pets. 3  Contrary to their size Beagles need a quite large space and exercise to keep themselves healthy.They are often kept in small apartments that is not suitable for them at all. 1 Beagles are thought to be existed in ancient Greeks in 500 BC.They were carried to England when William I came to rule England. 2  Beagles have passed through lots of changes of development.They were breed to be fast and small.In 1700 pocket Beagles were produced having height about 9 inches to fit in hunters pockets."}, {"url": "http://www.gotbeagles.org/index.php?option=com_content&view=article&id=36&Itemid=8", "passage_text": "CONSIDER A BEAGLE. Again, beagles are not necessarily the easiest dogs to housetrain, but they are well suited to crate training, and that may be one of the best forms/ways of house training. We'll be happy to give you some tips and advice on crate training your dog. 6."}, {"url": "http://www.beaglepro.com/beagle-exercise", "passage_text": "A Beagle should be taken for a walk at least 1 time per day. Walking should be moderate and at a fairly brisk pace. Do keep in mind that what is a brisk pace to you is probably a running pace for a little puppy. Adult Beagles will more than be able to keep up with you. The average adult Beagle can run rather fast at about 20 mph (32.2 km/h) while the average male human jogs at 8.5 (13.35 km/h) and the average woman at 6.5 (10.46 km/h). Teaching your Beagle to run after it, time it just right and then catch it mid-air can be a lot of fun for both of you and certainly a way to get their exercise! Tip: Do be sure to never rip the Frisbee out of your dog's mouth."}, {"url": "http://clubs.akc.org/NBC/fat_beagle.html", "passage_text": "All of us have seen fat beagles. It is sad, it is ugly, but most of all it is a horrible health risk for your pet. Beagles are not a bit choosy about what they eat. They consume it so fast, at times, that they have no opportunity to even taste it. They are always hungry, and are always in search of food. However, you need to watch the food intake. Carrots are a great low-calorie snack that most beagles enjoy. Most owners of dangerously obese dogs are in denial about their dogs condition as well as how much food the dog was eating. If you love your dog and want it to be around for a healthy future, you have to get real about what the dog is eating."}, {"url": "http://www.answers.com/Q/How_fast_can_a_beagle_run", "passage_text": "Fast food affects how fast you can run because it clogs your arteries with trans fat and slows down your metabolism which helps digest food. Fast food is usually unhealthy and … junk food puts unwanted fat and sugar into your body that makes you fat and therefor makes you slower and running. How fast does a NFL running back run? The 40 yard dash times of running backs during the 2008 NFL Combine ranged from 4.24 (Chris Johnson) to 4.83 (Bernard Yvenson) with the average time sitting at 4.53."}, {"url": "http://www.cascaderescue.org/beagles101/", "passage_text": "Beagles can’t go on walks or hikes off-leash. For the same reasons as above, they always need to be attached to their human when they are outside. They are not the type of dog that can go hiking or camping with you and just ‘hang out’ by the campsite. You need to have them on a leash at all times. "}, {"url": "http://www.answers.com/Q/How_fast_can_a_beagle_run", "passage_text": "A beagle is one of the best known dogs for families. These dogs are hounds and are sometimes used for hunting because of their fast speed. They are an English dog breed. They … have short hair and are a typically medium sized dog, not too big, not too small, (when full grown.) When they are puppies they are typically small. How fast does a NFL running back run? The 40 yard dash times of running backs during the 2008 NFL Combine ranged from 4.24 (Chris Johnson) to 4.83 (Bernard Yvenson) with the average time sitting at 4.53."}, {"url": "http://www.anniemany.com/2013/07/interesting-facts-about-beagles.html", "passage_text": "1 Beagles have passed through lots of changes of development.They were breed to be fast and small.In 1700 pocket Beagles were produced having height about 9 inches to fit in hunters pockets. 2  Beagles were not fast enough as we see them today.They were bred with Italian Greyhounds to improve their running speed. 1 Beagles are thought to be existed in ancient Greeks in 500 BC.They were carried to England when William I came to rule England. 2 "}]