[{"url": "http://english.stackexchange.com/questions/62397/reading-out-decimal-numbers-in-english", "passage_text": "For numbers to the right of the decimal, however--and also for numbers in bases other than 10--there isn't special terminology, and we simply speak each digit individually. For a simple decimal number, one point twelve is definitely not ok. However for a paragraph number it would be fine, because it's the twelfth paragraph in section one. Such a sequence would normally be 1.1, 1.2 ... 1.9, 1.10, 1.11 ..."}, {"url": "http://www.bzarg.com/p/how-to-pronounce-hexadecimal/", "passage_text": "He’s on to something. We have ordinary English words for decimal numbers, with names based on the digits and their place-value. “Seventy” is the word for two-digit chunks starting with the digit seven, for example. “hxd” would be very difficult to pronounce and no gain. “exml” might be manageable, so that 0x74 would be pronounced as sevenexml-four. Compromises would be needed of course as they are in decimal."}, {"url": "http://www.shmoop.com/fractions-decimals/place-value-naming-decimals.html", "passage_text": "The first thing to understand about decimals is place value. Each digit in a number holds a specific place. Until now, we have mostly dealt with place values to the left of the decimal. The place values to the right end in ths. Here is a number with seven significant digits to the right of the decimal: Look Out: notice there is no such thing as theoneths place. When naming a number, we use the word and to mean everything after the decimal, and you usually only pronounce the last place value. "}, {"url": "http://dictionary.cambridge.org/us/pronunciation/english/decimal", "passage_text": "/ˈdesɪməl/. How to pronounce decimal in British English. (English pronunciations of decimal from the Cambridge Advanced Learners Dictionary & Thesaurus and from the Cambridge Academic Content Dictionary, both sources © Cambridge University Press). The answer may seem obvious, but the use of this word can lead to confusion. In the UK and Ireland the word traditionally meant the number 1,000,000,000,000 (a million millions), which is called a trillion in the United States. A billion in the United States is considerably"}, {"url": "http://dictionary.cambridge.org/pronunciation/english/decimal", "passage_text": "How to pronounce decimal in American English. (English pronunciations of decimal from the Cambridge Advanced Learner’s Dictionary & Thesaurus and from the Cambridge Academic Content Dictionary, both sources © Cambridge University Press). by Kate Woodford, As part of our occasional series on idioms used in or in relation to business, we look today at the important area of making projects happen – getting projects started, making progress with those projects and, as sometimes happens, failing to make progress."}, {"url": "http://www.audioenglish.org/dictionary/decimal.htm", "passage_text": "DECIMAL: related words searches. » proper fraction definition. » circulating decimal meaning. » repeating decimal: pronunciation in phonetic transcription. » number definition. If you tell the truth, people are not happy; if beaten with a stick, dogs are not happy. (Bhutanese proverb). Be careful of your enemy once and of your friend a thousand times, for a double crossing friend knows more about what harms you. (Arabic proverb)."}, {"url": "http://www.bzarg.com/p/how-to-pronounce-hexadecimal/", "passage_text": "You could not use the word “hex” as that strictly means six, which is why the full name of the system is hexadecimal. “hxd” would be very difficult to pronounce and no gain. “exml” might be manageable, so that 0x74 would be pronounced as sevenexml-four. Compromises would be needed of course as they are in decimal."}, {"url": "http://english.stackexchange.com/questions/62397/reading-out-decimal-numbers-in-english", "passage_text": "The treatment of numbers in language is an interesting topic. In base 10, we have terms for numbers to the left of the decimal, according to the powers of 10 they represent: e.g., 496 is four hundred ninety-six. For a simple decimal number, one point twelve is definitely not ok. However for a paragraph number it would be fine, because it's the twelfth paragraph in section one. Such a sequence would normally be 1.1, 1.2 ... 1.9, 1.10, 1.11 ..."}]