[{"url": "http://www1.salary.com/WA/Seattle/case-manager-salary.html", "passage_text": "This chart describes the expected percentage of people who perform the job of Case Manager in Seattle, WA that make less than that salary. For example 50% of the people who perform the job of Case Manager in Seattle are expected to make less than the median. Our team of Certified Compensation Professionals has analyzed survey data collected from thousands of HR departments at employers of all sizes and industries on Case Manager salaries to construct a range which describes the distribution of salaries for people with the job title Case Manager in Seattle, WA."}, {"url": "http://www1.salary.com/WA/Seattle/case-manager-salary.html", "passage_text": "The salary for someone with the job title Case Manager in Seattle, WA varies depending on a number of factors. Our team of Certified Compensation Professionals has analyzed survey data collected from thousands of HR departments at employers of all sizes and industries on Case Manager salaries to construct a range which describes the distribution of salaries for people with the job title Case Manager in Seattle, WA."}, {"url": "http://www.simplyhired.com/salaries-k-project-manager-l-seattle-wa-jobs.html", "passage_text": "The average salary for project manager jobs in Seattle, WA is $80,000. Average project manager salaries can vary greatly due to company, location, industry, experience and benefits. This salary was calculated using the average salary for all jobs with the term project manager anywhere in the job listing."}, {"url": "http://www.indeed.com/salary/q-Manager-l-Seattle,-WA.html", "passage_text": "$ 52000 average manager salaries for job postings in seattle wa are 8 % higher than average manager salaries for job postings nationwide"}, {"url": "http://www.salarylist.com/jobs/Seattle-WA/Household-Manager-Salary.htm", "passage_text": "Household Manager Seattle, WA Salary. Household Manager Seattle, WA average salary is $78,852, median salary is $75,000 with a salary range from $18,170 to $1,644,000. Household Manager Seattle, WA salaries are collected from government agencies and companies. Each salary is associated with a real job position"}, {"url": "http://www.payscale.com/research/US/Job=Property_Manager/Salary/6c904b70/Seattle-WA", "passage_text": "Property Manager Salary in Seattle. (United States). The average salary for a Property Manager in Seattle, Washington is $51,676 per year. Pay for this job rises steadily for more experienced workers, but goes down noticeably for the few employees with more than 20 years' experience. The skills that increase pay for this job the most are Maintenance, Project Management, and Budget Management."}, {"url": "http://www.graduatenursingedu.org/washington/washington-salary/", "passage_text": "The 2011 American Academy of Nurse Practitioners’ National NP Compensation Survey showed that in the Far West region, including Washington, nurse practitioners earned an average base salary of $97,567, and a total average income of $107,518 when looking at their total compensation package. "}, {"url": "http://www.simplyhired.com/salaries-k-office-manager-l-seattle-wa-jobs.html", "passage_text": "The average salary for office manager jobs in Seattle, WA is $68,000. Average office manager salaries can vary greatly due to company, location, industry, experience and benefits. This salary was calculated using the average salary for all jobs with the term office manager anywhere in the job listing."}]