[{"url": "http://nameberry.com/babyname/Kyan", "passage_text": "Hello, Guest Login or Register. Hello, Guest. Kyan is a quintessential twenty-first-century name, a twist on the twentieth-century standard Ryan. Kyan is used by the grooming guru on Queer Eye for the Straight Guy, Kyan Douglas (born Eddie), and increasing numbers of parents."}, {"url": "http://www.quickbabynames.com/meaning-of-Kyan.html", "passage_text": "See worldwide popularity rankings of Kyan as a baby name (outside USA). As a baby boy name, Kyan is currently a popular baby name, with a recent overall USA popularity ranking of 957 out of 1000 (source: 2000s U.S. Census) . In 2009, the name Kyan fell in popularity and moved down the USA Top 1000 charts in Year 2009, by 32 places. For the Year 2009, it ranked 1000 in the Top 1000 charts. "}, {"url": "http://www.babynology.com/meaning-kyan-m0.html", "passage_text": "The meaning of the name kyan is Little King. The origin of the name kyan is African-American. Chotoku Kyan (1870-1945) was an Okinawan karate master who was famous for both his karate skills, and his colorful personal life. "}, {"url": "http://www.babynamespedia.com/meaning/Kyan", "passage_text": "[ 2 syll. kyan, ky-an ] The baby boy name Kyan is pronounced as K IY-aeN †. Kyan is used predominantly in the English and Irish languages, and its origin is Celtic and English. Kyan is a variation of the name Cian (English and Irish). Kyan is also a variation of the name Keon (Irish and English). Kyan is rare as a baby name for boys. At the modest peak of its usage in 2004, 0.018% of baby boys were given the name Kyan. It ranked at #588 then. The baby name has since fallen out of favor, and is currently of sporadic use."}, {"url": "http://www.babynamewizard.com/baby-name/boy/kyan", "passage_text": "Personal experiences with the name Kyan: | Edit. This is my son's name and everyone loves it! It's pronounced like Ryan, but with a K. People always get that wrong and want to say it like the spice. But it's Kyan, Ryan with a K! Originally it was spelled Kian, a Nubian name meaning a long awaited or a celebrated child. We picked Samuel for his middle name, Hebrew meaning asked of God. So his perfectly suited name means a long awaited, celebrated child asked of God."}, {"url": "http://www.thenamemeaning.com/kyan/", "passage_text": "Keep in mind that many names may have different meanings in other countries and languages, so be careful that the name that you choose doesn’t mean something bad or unpleasant. Search comprehensively and find the name meaning of Kyan and its name origin or of any other name in our database. Also note the spelling and the pronunciation of the name Kyan and check the initials of the name with your last name to discover how it looks and sounds. If you consider naming your baby Kyan we recommend you take note of the special meaning and history of the name as your baby’s name will play a big role in its life and your baby will hear it spoken every day."}, {"url": "http://www.meaning-of-names.com/american-names/kyan.asp", "passage_text": "Meaning of Kyan. American name. In American, the name Kyan means-little king.The name Kyan originated as an American name. The name Kyan is most often used as a boy name or male name. American Name Meaning-little king. Origin-America."}, {"url": "http://www.ourbabynamer.com/meaning-of-Kyan.html", "passage_text": "Kyan is generally used as a boy's name. It consists of 4 letters and 1 syllable and is pronounced Kyan. In the U.S. in 2014, it ranked 1292 in baby name popularity for boys with 136 occurrences. It ranked 13781 in popular baby names for girls with 7 occurrences. Last year this name was ranked as one of the top 1000 most popular names within its gender. Keep in mind how popular a name is. Your child may feel that they fit in more with a more popular name. On the other hand, they may feel more special if their name is less popular and more uniquely their own."}, {"url": "http://www.thenamemeaning.com/kyan/", "passage_text": "The different meanings of the name Kyan are: The meaning of the name “Kyan” is different in several languages, countries and cultures and has more than one possibly same or different meanings available. .adslot_1 { width: 336px; height: 280px; } @media (max-width:350px) { .adslot_1 { width: 300px; height: 250px; } }. If you consider naming your baby Kyan we recommend you take note of the special meaning and history of the name as your baby’s name will play a big role in its life and your baby will hear it spoken every day."}]