[{"url": "http://www.babynology.com/meaning-keara-f13.html", "passage_text": "List of Celtic baby names, Celtic baby boy names (male), girl names (female) & Celtic names meanings has been compiled from various resources. Please use this list of Celtic baby names only for reference/idea to name your kid/child. Database of baby names has been compiled from various references and suggestions provided by our web site visitors and resources partners. Meaning of Keara in Celtic origin/culture for Girl name with history and fame details. More About Celtic Name: Keara. Keara is of an English origin and variant of CIARA, which is feminine form of CIAR. Derived from Irish Ciar meaning black. Saint Ciara was an Irish nun who established a monastery at Kilkeary in the 7th century."}, {"url": "http://www.babynamegenie.com/polls/137225/results", "passage_text": "It’s not in our baby name book. I googled it, and their are people with these names and all four of these spellings. How would you spell it to get the pronouciation (uh-LEER-uh). LEER part rhymes with clear or Greer. "}, {"url": "http://www.sheknows.com/baby-names/name/alera", "passage_text": "Latin Meaning: The name Alera is a Latin baby name. In Latin the meaning of the name Alera is: Eagle. SoulUrge Number: 7. Expression Number: 1. People with this name have a deep inner need for quiet, and a desire to understand and analyze the world they live in, and to learn the deeper truths. People with this name tend to initiate events, to be leaders rather than followers, with powerful personalities."}, {"url": "http://www.ourbabynamer.com/meaning-of-Alera.html", "passage_text": "Last year this name was ranked as one of the top 1000 most popular names within its gender. Keep in mind how popular a name is. Your child may feel that they fit in more with a more popular name. On the other hand, they may feel more special if their name is less popular and more uniquely their own. As you see it can go both ways, so just keep this point in mind as you examine the different possibilities. In the U.S. in 2014, it ranked 9495 in baby name popularity for girls with 11 occurrences. Less than 5 boys were given the name. View the Alera Name Popularity Page to see how the popularity trend for Alera has changed since 1880, or to compare the popularity of Alera to other names."}, {"url": "http://www.babynology.com/meaning-aleara-f6.html", "passage_text": "More.. The arrival of a new baby girl in the family brings with it a deep sense of joy and happiness to one and all. This is specially true for the father because the uniquely enchanting place daughters have for Dads is legendary. Choosing a baby girl name for your newly born miss isn't really as complicated as it seems."}, {"url": "http://www.thinkbabynames.com/meaning/0/Alecia", "passage_text": "Alecia /ale-cia/ [3 sylls.] as a girls' name. Alecia's name origin is Old German, and the name Alecia means noble, exalted. Alecia is an alternate spelling of Alice (Old German). Alecia is also a derivative of Alicia (Old German). Kreatif forms: Alcia, Alelia. Shown below is the baby name popularity of Alecia for girls. Alecia entered the list in 1960-1969 and reached its apex position of #602 in the U.S. during 1980-1989, but is not in the Top 1000 currently."}, {"url": "http://www.sevenreflections.com/name/Aleera/", "passage_text": "Powerful and complete. You are good intellectually and require several outlets for your energies. You are not a builder but a planner, and you want others to carry out your plans.You are bold, independent, inquisitive and interested in research. You know what you want and why you want it. You find the best contentment in life when you own your own home and provide well for your family and loved ones. You have a great sense of responsibility and duty. You are comforting, appreciative and affectionate. The Hidden Passion Number represents your hidden talent. It shapes your personality, and guides your life. There are also the Karmic Lessons Numbers, associated with your full name (first name, middle name and last name) as it spelled in your birth certificate. To see these numbers, please, enter your FULL NAME."}, {"url": "http://www.babynology.com/meaning-aleara-f6.html", "passage_text": "List of Australian baby names, Australian baby boy names (male), girl names (female) & Australian names meanings has been compiled from various resources. The arrival of a new baby girl in the family brings with it a deep sense of joy and happiness to one and all. This is specially true for the father because the uniquely enchanting place daughters have for Dads is legendary. Choosing a baby girl name for your newly born miss isn't really as complicated as it seems."}, {"url": "http://www.babynology.com/meaning-aleara-f6.html", "passage_text": "Database of baby names has been compiled from various references and suggestions provided by our web site visitors and resources partners. Meaning of Aleara in Australian origin/culture for Girl name with history and fame details. © Copyright 2015 Babynology. The arrival of a new baby girl in the family brings with it a deep sense of joy and happiness to one and all. This is specially true for the father because the uniquely enchanting place daughters have for Dads is legendary. Choosing a baby girl name for your newly born miss isn't really as complicated as it seems."}]