[{"url": "http://www.babynology.com/meaning-sohani-f55.html", "passage_text": "Name Sohani generally means Beautiful, is of Indian origin, Name Sohani is a Feminine (or Girl) name. Person with name Sohani are mainly Sikh by religion."}, {"url": "http://www.behindthename.com/name/john", "passage_text": "English form of Iohannes, the Latin form of the Greek name ιωαννης (Ioannes) , itself derived from the Hebrew name יוֹחָנָן (Yochanan) meaning  YAHWEH is gracious. This name owes its popularity to two New Testament characters, both highly revered saints."}, {"url": "http://www.thinkbabynames.com/meaning/1/Shaun", "passage_text": "Shaun /shaun/ [1 syll.] as a boys' name (also used less generally as girls' name Shaun). Shaun's name origin is Hebrew, and the name Shaun means God is gracious. Shaun is an alternate spelling of John (Hebrew). Shaun is also a form of Sean (Irish, Hebrew). Shaun is also used as a variant of Shaw"}, {"url": "http://www.babycenter.com/baby-names", "passage_text": "As parents share their baby names with us, we share them with you. These rankings count names that are spelled differently (like Sophia and Sofia) as two separate names. Click on a name to learn the name's meaning, popularity over time, and more."}, {"url": "http://www.babynology.com/meaning-sohani-f55.html", "passage_text": "Please use this list of Sanskrit baby names only for reference/idea to name your kid/child. Database of baby names has been compiled from various references and suggestions provided by our web site visitors and resources partners. Meaning of Sohani in Sanskrit origin/culture for Girl name with history and fame details."}, {"url": "http://meaning-of-names.com/", "passage_text": "Name Meanings and History One of the things that all people and places have in common is (NAMES). Have you ever asked yourself, What does my name mean?."}, {"url": "http://www.thinkbabynames.com/meaning/0/Siobhan", "passage_text": "It is of Irish and Hebrew origin, and the meaning of Siobhan is God is gracious. Variant of Joan, which is a feminine form of John. Phonetic forms of this name are a blend of the Sha-prefix with Yvonne. Actress Siobhan McKenna."}]