[{"url": "http://www.answers.com/Q/What_is_Irish_football", "passage_text": "Tipperary, Republic of Ireland. For more information on Gaelic Football and its sister sports (Hurling, Camogie and Handball), it may be prudent to visit the website of the governing body, the Gaelic Athletic Association, at www.gaa.ie. 1 They cannot be pu…. 2  Luck Be A Lawn: What You Need to Know About Irish Clovers Irish clover is famous for its legendary good luck. 3  Fortunately, you don't need any luck to grow the plant-it practically grows itself."}, {"url": "http://www.youtube.com/watch?v=TEAbWrdB9XU", "passage_text": "This feature is not available right now. Please try again later. Gaelic football combines the suspense of soccer, the skills and scoring of basketball, and the speed of the fastest sports in the world in a free-flowing action-packed sport. It originated in Ireland centuries ago, but it's taking off in North America. Try it! "}, {"url": "https://en.wikipedia.org/wiki/Gaelic_football", "passage_text": "Gaelic football (Irish: Peil Ghaelach; short name Peil or Caid), commonly referred to as football or Gaelic, is an Irish team sport. It is a form of football derived from traditional Irish ball games. It is played between two teams of 15 players on a rectangular grass pitch. The All-Ireland Senior Championship is considered the most prestigious event in Gaelic football. Under the auspices of the GAA, Gaelic football is a male-only sport; however, the related sport of ladies' Gaelic football is governed by the Ladies' Gaelic Football Association."}, {"url": "https://en.wikipedia.org/wiki/Irish_Football_Association", "passage_text": "It should not be confused with the Football Association of Ireland (FAI), which is the organising body in the Republic of Ireland. The IFA was formed in 1880 by seven football clubs mostly in the Belfast area, as the organising body for the sport across all of Ireland. A meeting was called by Cliftonville of other football clubs that followed the rules set out by the Scottish Football Association (SFA)."}, {"url": "http://www.answers.com/Q/What_is_gaelic_football", "passage_text": "Gaelic Football is one of Ireland's national sports. There are too many famous people to mention that have been involved with the sport. One of the most successful playe … rs in the 1940s, Jack Lynch, became the head of the Irish government in 1960s and 1970s. Tipperary, Ireland, and it is now the governing body of Gaelic Football and some other sports.   The main two people who acted as founders of the GAA were Michael Cusack and Maurice Davin. There are some confusion as to who else was at that founding meeting."}, {"url": "https://en.wikipedia.org/wiki/Gaelic_football", "passage_text": "Gaelic football is the most popular sport in Ireland in terms of attendance, with the 2011 All-Ireland Senior Championship Final, held at Croke Park, Dublin, drawing an attendance of 82,300 people. Outside of Ireland, football is mainly played among members of the Irish diaspora. The All-Ireland Senior Championship is considered the most prestigious event in Gaelic football. Under the auspices of the GAA, Gaelic football is a male-only sport; however, the related sport of ladies' Gaelic football is governed by the Ladies' Gaelic Football Association."}, {"url": "https://en.wikipedia.org/wiki/Irish_Football_Association", "passage_text": "This article is about the FA of Northern Ireland. For the FA of the Republic of Ireland, see Football Association of Ireland. The Irish Football Association (IFA) is the organising body for association football in Northern Ireland. It originally organised the Ireland national football team which, after 1921 or 1950, depending on which event is taken as the significant factor, became the Northern Ireland national football team. The IFA was formed in 1880 by seven football clubs mostly in the Belfast area, as the organising body for the sport across all of Ireland. A meeting was called by Cliftonville of other football clubs that followed the rules set out by the Scottish Football Association (SFA)."}, {"url": "http://www.answers.com/Q/What_is_gaelic_football", "passage_text": "Gaelic Football is one of Ireland's two main national sports, the other being a sport called Hurling. At a first glance by the uneducated eye, it could look like a cross between soccer and rugby, but there is a lot more to it than that. Tipperary, Ireland, and it is now the governing body of Gaelic Football and some other sports.   The main two people who acted as founders of the GAA were Michael Cusack and Maurice Davin. There are some confusion as to who else was at that founding meeting."}, {"url": "https://en.wikipedia.org/wiki/Gaelic_football", "passage_text": "Positions in Gaelic football are similar to that in other football codes, and comprise one goalkeeper, six backs, two midfielders, and six forwards, with a variable number of substitutes. The All-Ireland Senior Championship is considered the most prestigious event in Gaelic football. Under the auspices of the GAA, Gaelic football is a male-only sport; however, the related sport of ladies' Gaelic football is governed by the Ladies' Gaelic Football Association."}]