[{"url": "http://www.merriam-webster.com/dictionary/peristalsis", "passage_text": "Definition of PERISTALSIS. : successive waves of involuntary contraction passing along the walls of a hollow muscular structure (as the esophagus or intestine) and forcing the contents onward. See peristalsis defined for kids. ADVERTISEMENT."}, {"url": "http://www.answers.com/Q/What_is_peristalsis", "passage_text": "Peristalsis is a distinctive pattern of smooth muscle contractions that propels food through the esophagus and intestines. Peristalsis is important for the movemen … t of food through the oesophagus (so that the food can reach the stomach) and the large intestine (for prevention of constipation). Peristaltic movement also takes place in the reproductive organs of the body."}, {"url": "http://www.wisegeek.org/what-is-peristalsis.htm", "passage_text": "Top 10 unbelievable historical concurrencies. Peristalsis is a series of muscle contractions and relaxations that occur along the course of the intestinal tract to push food and waste products through. In some cases, people can actually feel the contractions as they occur, especially in the case of movements of the large intestine. Vomiting is an example of the body overriding the usual muscle movements of peristalsis. The large intestine goes through two or three periods of big contractions every day, designed to push fecal material out of the anus. People can sometimes feel the movements of peristalsis in their"}, {"url": "http://encyclopedia2.thefreedictionary.com/peristalsis", "passage_text": "Peristalsis. a wavelike contraction that propels the contents of tubular organs, for example, the intestine, stomach, and ureters, caudally in animals or in a downward direction in man. Peristalsis is the result of many coordinated contractions of the longitudinal and transverse muscles in the walls of a tubular organ. A single peristaltic wave takes the form of a circular constriction around the lumen that moves along the length of the organ."}, {"url": "http://www.answers.com/Q/What_is_peristalsis", "passage_text": "Peristalsis is the contractions and the relaxations made by the muscles of the body especially by the muscles of the alimentary canal. Peristalsis is important for the movemen … t of food through the oesophagus (so that the food can reach the stomach) and the large intestine (for prevention of constipation). Peristaltic movement also takes place in the reproductive organs of the body."}, {"url": "http://medical-dictionary.thefreedictionary.com/Peristalsis", "passage_text": "per·i·stal·sis. n. pl. per·i·stal·ses (-sēz). The wavelike muscular contractions of the intestine or other tubular structure that propel the contents onward by alternate contraction and relaxation. Also called vermicular movement. per′i·stal′tic (-stol′stôl, -tĭk′-) stăl. adj the wormlike movement by which the alimentary canal or other tubular organs with both longitudinal and circular muscle fibers propel their contents, consisting of a wave of contraction passing along the tube."}, {"url": "http://medical-dictionary.thefreedictionary.com/Peristalsis", "passage_text": "peristalsis. the wormlike movement by which the alimentary canal or other tubular organs with both longitudinal and circular muscle fibers propel their contents, consisting of a wave of contraction passing along the tube. adj., adj peristal´tic. When food is swallowed, it passes into the esophagu"}, {"url": "http://www.thefreedictionary.com/peristalsis", "passage_text": "peristalsis. 1. Rhythmic contractions in the walls of tubular organs that push the contents onward, e.g. food in the intestine. 2. Waves of muscular contraction that force substances through passageways, such as the alimentary canal. Noun. 1. peristalsis-the process of wavelike muscle contractions of the alimentary tract that moves food along. vermiculation. bodily function, bodily process, body process, activity-an organic process that takes place in the body; respiratory activity"}, {"url": "http://www.answers.com/Q/What_is_peristalsis", "passage_text": "Answer by Peakay Tea. Confidence votes 50.7K. Peristalsis is a distinctive pattern of smooth muscle contractions that propels food through the esophagus and intestines. radially symmetrical contraction and relaxation of muscles which propagates in a wave down a muscular tube, in an anterograde fashion. Peristalsis is important for the movemen … t of food through the oesophagus (so that the food can reach the stomach) and the large intestine (for prevention of constipation). Peristaltic movement also takes place in the reproductive organs of the body."}]