[{"url": "https://en.wikipedia.org/wiki/Folklore", "passage_text": "Among the most common types of narrative folklore are folktales (folk tales). A folktale is a story that forms part of an oral tradition, and does not have a single, identifiable author. The stories are passed down from one generation to the next, and over time become expanded and reshaped with each retelling. Folktales often reflect the values and customs of the culture from which they come. "}, {"url": "http://644892358441536678.weebly.com/uploads/1/0/4/2/10420289/chapter_4culture1.pdf", "passage_text": "Amish Settlements in the U.S. Fig. 4-4: Amish settlements are distributed through the northeast U.S. Sports: Hierarchical Diffusion of Popular Culture • In contrast with the diffusion of folk customs, organized sports provide examples of how popular culture is diffused. • Many sports originated as isolated folk customs and were diffused like other folk culture, through the migration of individuals. • The contemporary diffusion of organized sports, however, displays the characteristics of popular culture. "}, {"url": "http://staff.camas.wednet.edu/blogs/tweed/files/2011/02/Chp.-4-Folk-and-Popular-Culture-KI-1.doc", "passage_text": "This section looks at the origin and diffusion of specific examples of both folk and popular culture. Specifically examined examples of folk culture are FOLK MUSIC and AMISH CULTURE. Examples used to illustrate popular culture are POPULAR MUSIC and SOCCER. "}, {"url": "https://en.wikipedia.org/wiki/Folk_music", "passage_text": "Starting in the mid-20th century a new form of popular folk music evolved from traditional folk music. This process and period is called the (second) folk revival and reached a zenith in the 1960s. While contemporary folk music is a genre generally distinct from traditional folk music, in English it shares the same name, and it often shares the same performers and venues as traditional folk music. Even individual songs may be a blend of the two."}, {"url": "http://ehsapgeo.weebly.com/uploads/7/8/4/0/7840508/aphg_folk_and_popular_culture_study_guide_2013.docx", "passage_text": "This section looks at the origin and diffusion of specific examples of both folk and popular culture. Specifically examined examples of folk culture are FOLK MUSIC and AMISH CULTURE. Examples used to illustrate popular culture are POPULAR MUSIC and SOCCER. ● ORIGIN OF FOK AND POPULAR CULTURE 1. List elements of the origin and characteristics of FOLK MUSIC. 3. Draw and label some kind of graphic to illustrate how hip-hop music illustrates elements of both folk and popular culture. "}, {"url": "http://lake-central.lcsc.us/userfiles/amanda-schuyler/file/2012_2013%20APHG/unit%203%20(culture)%20-%20student%20copy.pdf", "passage_text": "107 – 111 ORIGIN OF FOLK AND POPULAR CULTURES This section looks at the origin and diffusion of specific examples of both folk and popular culture. Specifically examined examples of folk culture are FOLK MUSIC and AMISH CULTURE. Examples used to illustrate popular culture are POPULAR MUSIC and SOCCER. 1. List elements of the origin and diffusion of FOLK MUSIC. 2. List elements of the origin and characteristics of POPULAR MUSIC."}, {"url": "http://www.eslstation.net/theREALWF/Introduction.htm", "passage_text": "To understand folk stories, we must start with the word folk, which comes from the German word volk, meaning people. A folk story is a tale that originated from a particular cultural group in a distant time and place. "}, {"url": "http://www.phschool.com/atschool/ap_misc/rubenstein_cultland/pdfs/Ch4_Issue1.pdf", "passage_text": "Singers performQuan Ho folk songs as part of the annual Lim Festival. culture and in turn constructs landscapes (what geogra-phers call “built environments”) that modify nature in distin-ctive ways.Geographers observe that popular culture has a more wide-spread distribution than folk culture. Folk culture derived from localnatural elements may be more sensitive to the protection andenhancement of the environment. Popular culture is lesslikely to reflect the diversity of local physical conditions andis more likely to modify the environment in accordance withglobal values."}, {"url": "https://prezi.com/gmvxsx6xfk2n/where-do-folk-and-popular-cultures-originate-and-diffuse/", "passage_text": "Chapter 4 Key Issue 1. This presentation includes topics about folk music, culture, amish culture, spread of soccer culture, etc. In addition includes discussion questions. Created by Shleby Swygert and Josie Banks; presented on October 23, 2012. Tweet. "}, {"url": "http://www.phschool.com/atschool/ap_misc/rubenstein_cultland/pdfs/Ch4_Issue1.pdf", "passage_text": "They may also have multiple hearths, originatingindependently in isolated locations.In contrast to folk customs, popular culture is most often aproduct of MDCs, especially in North America, WesternEurope, and Japan. Popular music and fast food are good exam-ples. Folk culture derived from localnatural elements may be more sensitive to the protection andenhancement of the environment. Popular culture is lesslikely to reflect the diversity of local physical conditions andis more likely to modify the environment in accordance withglobal values."}]