[{"url": "http://www.mtbtips.com/how-to-make-a-chainstay-protector-guard/", "passage_text": "3. Remove and clean. Remove the old chainstay protector and clean the chainstay. -. 4. Remove the valve from the inner tube. Cut across the inner tube each side of the valve to remove that unwanted valve section. -. Super Tips – Different inner tubes give different results. The type of tube you use is up to you."}, {"url": "http://www.youtube.com/watch?v=XIkTBuuzKOU", "passage_text": "Learn how to make a bicycle chainstay protector the Old Skool way using a bicycle inner tube. Close-up video with easy to learn steps and tips to help you make your own durable homemade chainstay protector quickly, easily and inexpensively."}, {"url": "http://pedalbmx.com/Posts/View/208521/what-is-chainstay", "passage_text": "It is called the chainstay because the top of the chain goes over the top of the tube, and the bottom of the chain is below the tube. Depending on what kind of bike you are looking for a 12 to 13.5 inch chainstay is good for flat. 13 to 15 is good for almost anything else. Hope this helps."}, {"url": "http://www.pinkbike.com/forum/listcomments/?threadid=42484", "passage_text": "the chainstay is between the BB shell and the drop out! on a dually is makes a difference. Ryde4Lyef wrote: Im just wondering what the hell a chainstay is, and how its positioning changes a bikes rideability."}, {"url": "http://www.mtbtips.com/the-best-chainstay-protector-guard/", "passage_text": "Mountain bike chainstay protectors or chainstay guards are an important protection item for your bike. They’re there to ensure your chainstay keeps in good condition and doesn’t get damaged from constant chain strikes."}, {"url": "http://pedalbmx.com/Posts/View/208521/what-is-chainstay", "passage_text": "Date: 2006-08-04 14:04:33 Direct Link: Re: what is chainstay Reply. Longer chainstays will give your bike a greater wheelbase, making it more stable in the air (for dirtjumping or racing). shorter chainstays make things like 180's and manuals easy. good for tech-riding or flatland."}, {"url": "http://www.pinkbike.com/forum/listcomments/?threadid=42484", "passage_text": "Posted: Jul 14, 2008 at 22:22. Quote. the chain stay is the part of the frame thats nearest to your chain, and often gets big gashes in it from your chain hitting it. often people have something covering there chainstay to protect it from the"}, {"url": "http://www.thechainstay.com/the-house/about-the-chainstay/", "passage_text": "The ChainStay is located in Oudenaarde, Belgium; situated in the heart of the Flemish Ardennes. Our 7 bedroom home is specifically designed to accommodate cyclists and include all the amenities of home."}]