[{"url": "http://legal-dictionary.thefreedictionary.com/Misrepresentation", "passage_text": "A misrepresentation in a contract can give a party the right to rescind the contract. A Rescission of a contract returns the parties to the positions they held before the contract was made. A party can rescind a contract for misrepresentation only if the statement was material, or critical, to the agreement. A misrepresentation on the part of the insured in an insurance policy can give the insurer the right to cancel the policy or refuse a claim. misrepresentation. MISREPRESENTATION, contracts. The statement made by a party to a contract, that a thing relating to it is in fact in a particular way, when he knows it is not so. 2"}, {"url": "http://definitions.uslegal.com/m/material-representation/", "passage_text": "Material Representation Law & Legal Definition. Material representation is a convincing statement, information or explanation made to a person to induce that person to enter into a contract or to take a decision, which s/he would not have done without such persuasion."}, {"url": "http://www.businessdictionary.com/definition/misrepresentation.html", "passage_text": "Fraudulent, negligent, or innocent misstatement, or an incomplete statement, of a material fact. If a specific misrepresentation induces the other party to enter into a contract, that party may have the legal right to rescind the contract or seek compensation for damages. The guilty party avail of the defense that the wronged party could have checked the facts and have discovered what was wrong. A misstatement of an intention or opinion is generally not considered a misrepresentation."}, {"url": "http://www.duhaime.org/LegalDictionary/M/Misrepresentation.aspx", "passage_text": "A representation is a statement of fact made by one party to the contract (the representor) to the other (the representee) which, while not forming a term of the contract, is yet one of the reasons that induces the representee to enter into the contract. A misrepresentation is simply a representation that is untrue.. It may be made fraudulently, carelessly or innocently. Where one person (the representor) makes a misrepresentation to another (the representee) which has the object and result of inducing the representee to enter into a contract ... with him, the representee may generally elect to regard the contract as rescinded."}, {"url": "http://www.investopedia.com/terms/m/misrepresentation.asp", "passage_text": "DEFINITION of 'Misrepresentation'. A false statement of fact made by one party which affects the other party's decision in agreeing to a contract. If the misrepresentation is discovered, the contract can be later declared void and the situation remedied if the party who relied on the misrepresented fact files suit. For this reason, it is important to be accurate when disclosing facts relevant to a contract negotiation. Next Up."}, {"url": "http://www.businessdictionary.com/definition/material-misrepresentation.html", "passage_text": "material misrepresentation. Deliberate hiding or falsification of a material fact which, if known to the other party, could have aborted, or significantly altered the basis of, a contract, deal, or transaction. Definition. Deliberate hiding or falsification of a material fact which, if known to the other party, could have aborted, or significantly altered the basis of, a contract, deal, or transaction."}, {"url": "http://definitions.uslegal.com/m/material-misrepresentation/", "passage_text": "Material misrepresentation is the act of intentional hiding or fabrication of a material fact which, if known to the other party, could have terminated, or significantly altered the basis of, a contract, deal, or transaction. "}, {"url": "http://legal-dictionary.thefreedictionary.com/Misrepresentation", "passage_text": "A misrepresentation need not be intentionally false to create liability. A statement made with conscious ignorance or a reckless disregard for the truth can create liability. Nondisclosure of material or important facts by a fiduciary or an expert, such as a doctor, lawyer, or accountant, can result in liability. misrepresentation. MISREPRESENTATION, contracts. The statement made by a party to a contract, that a thing relating to it is in fact in a particular way, when he knows it is not so. 2"}]