[{"url": "https://en.wikipedia.org/wiki/Doyen", "passage_text": "Doyen is a surname. The word doyen (doyenne in the feminine grammatical gender) is derived from the French term for dean, e.g. Dean (religion) and Dean (education) . In the English language, its meaning has extended to refer to any senior member of a group, particularly one whose knowledge or abilities exceed that of other members. Doyen may refer to: 1  Charles A. Doyen (1859-1918) - American Marine Corps officer. This page or section lists people with the surname Doyen. If an internal link intending to refer to a specific person led you to this page, you may wish to change that link by adding the person's given name (s) to the link."}, {"url": "http://www.oxforddictionaries.com/definition/english/doyenne", "passage_text": "More example sentences. 1  But if she became a doyenne in her chosen field, she never quite lost touch with her love affair with the opposite end of the lens. 2  She talks to the former doyenne of daytime TV about her comeback. 1 But if she became a doyenne in her chosen field, she never quite lost touch with her love affair with the opposite end of the lens. 2  She talks to the former doyenne of daytime TV about her comeback. 3  She has become the doyenne of historical fiction in this country"}, {"url": "http://www.merriam-webster.com/dictionary/doyen", "passage_text": "Full Definition of DOYEN. 1. a: the senior member of a body or group b: a person considered to be knowledgeable or uniquely skilled as a result of long experience in some field of endeavor. 2. : the oldest example of a category. See doyen defined for English-language learners. ADVERTISEMENT. "}, {"url": "http://doyenne.com/", "passage_text": "Doyenne actively provides myself and others with a variety of online and offline services, ranging from email, to software repository, to consulting services, to sculptural and craft glass commissions. Inquiries welcome by emailing:@diespam. "}, {"url": "http://www.merriam-webster.com/dictionary/doyenne", "passage_text": "Full Definition of DOYENNE. : a woman who is a doyen. See doyenne defined for English-language learners. ADVERTISEMENT. Rhymes with DOYENNE. again, amen, Ardennes, Big Ben, bull pen, Cayenne, Chosen, domaine, doyen, Estienne, fen-phen, game hen, hang ten, hapten, Karen, La Tene, tène light, pen marsh, hen, moorhen, peahen, Pigpen Phnom, penh, PLAYPEN, Rn, sheyenne, Somewhen, Touraine. turenne"}, {"url": "https://en.wikipedia.org/wiki/Doyen_(horse)", "passage_text": "Doyen (foaled 22 April 2000) is a retired Thoroughbred racehorse, who was bred in Ireland but trained in France, Dubai and the United Kingdom during a racing career which lasted from 2002 to 2005. He is best known for winning the 2004 King George VI and Queen Elizabeth Stakes. Doyen is a tall, rangy bay horse with a large white star, bred at the Kildangan Stud in Ireland by his owner Sheikh Mohammed and raised at the Dalham Hall Stud at Newmarket. He was sired by Sadler's Wells out of the mare Moon Cactus, making him a full brother to the Oaks winner Moonshell"}]