[{"url": "http://www.classicfm.com/composers/barber/music/adagio-strings/", "passage_text": "Samuel Barber: Adagio for Strings (Platoon). For many, it was its use in the film Platoon. For others, it was William Orbit’s Pieces in a Modern Style project. But very few of us can claim to have first experienced Barber ’s Adagio for Strings in its original form: as part of a string quartet. The American composer wrote his string Quartet Opus 11, in 1936 – and considered himself happy with the result."}, {"url": "http://www.imdb.com/title/tt0091763/faq", "passage_text": "Platoon is based on a screenplay by director Oliver Stone. That screenplay was actually based on Stone's earlier screenplay, Break, a semi-autobiographical account of his experiences and people he knew in Vietnam. Platoon won the 1987 Academy Award for Best Motion Picture. "}, {"url": "http://www.nytimes.com/movie/review?res=9A0DE5D6113DF93AA25751C1A960948260", "passage_text": "''Platoon'' is a Vietnam film that honors its uneasy, complex, still haunted subject. BATTLEGROUND-PLATOON, written and directed by Oliver. Stone; director of photography, Robert Richardson; film editor, Claire Simpson; music by Georges Delerue; produced by Arnold Kopelson; released by Orion Pictures Corporation. At Loews Astor Plaza, Broadway and 44th Street; New York Twin, Second Avenue at 66th Street. Mr. Stone's control over his own screenplay is such that ''Platoon'' seems to slide into and out of crucial scenes without ever losing its distant cool. He doesn't telegraph emotions, nor does he stomp on them. The movie is a succession of found moments."}, {"url": "https://en.wikipedia.org/wiki/Platoon_(film)", "passage_text": "Platoon is a 1986 American war film written and directed by Oliver Stone and starring Tom Berenger, Willem Dafoe and Charlie Sheen. Stone wrote the story based upon his experiences as a U.S. infantryman in Vietnam to counter the vision of the war portrayed in John Wayne 's The Green Berets. It was the first Hollywood film to be written and directed by a veteran of the Vietnam War."}, {"url": "https://en.wikipedia.org/wiki/Adagio_for_Strings", "passage_text": "Barber's Adagio for Strings began as the second movement of his String Quartet, Op. 11, composed in 1936 while he was spending a summer in Europe with his partner Gian Carlo Menotti, an Italian composer who was a fellow student at the Curtis Institute of Music. The inspiration came from Virgil's Georgics. Barber finished the arrangement in 1936, the same year that he wrote the quartet. It was performed for the first time in 1938, in a radio broadcast from a New York studio attended by an invited audience, conducted by Arturo Toscanini, who also took the piece on tour to Europe and South America."}, {"url": "https://en.wikipedia.org/wiki/Platoon_(film)", "passage_text": "The film won the Academy Award for Best Picture of 1986. It also won Best Director for Oliver Stone, as well as Best Sound Mixing and Best Film Editing. In 1998, the American Film Institute placed Platoon at #83 in their  AFI's 100 Years... Stone wrote the story based upon his experiences as a U.S. infantryman in Vietnam to counter the vision of the war portrayed in John Wayne 's The Green Berets. It was the first Hollywood film to be written and directed by a veteran of the Vietnam War."}, {"url": "http://www.classicfm.com/composers/barber/music/samuel-barber-adagio-strings/", "passage_text": "Samuel Barber: Adagio for Strings. For many, it was its use in the film Platoon. For others, it was William Orbit’s Pieces in a Modern Style project. But very few of us can claim to have first experienced Barber ’s Adagio for Strings in its original form: as part of a string quartet. The American composer wrote his string Quartet Opus 11, in 1936 – and considered himself happy with the result."}, {"url": "https://en.wikipedia.org/wiki/Adagio_for_Strings", "passage_text": "Adagio for Strings is a work by Samuel Barber, arguably his best known, arranged for string orchestra from the second movement of his String Quartet, Op. 11. Barber finished the arrangement in 1936, the same year that he wrote the quartet. It was performed for the first time in 1938, in a radio broadcast from a New York studio attended by an invited audience, conducted by Arturo Toscanini, who also took the piece on tour to Europe and South America."}, {"url": "http://www.fast-rewind.com/music_platoon.htm", "passage_text": "Score Trivia Oliver Stone is a big fan of classical music and film soundtracks albums. When we were mixing the soundtrack album for Platoon he told me: Budd, listen to Tchaikovsky's 1812 Overture, listen to the cannons! I want sound effects from our film mixed into the George's cues on the soundtrack album."}, {"url": "https://en.wikipedia.org/wiki/Platoon_(film)", "passage_text": "From Wikipedia, the free encyclopedia. Platoon is a 1986 American war film written and directed by Oliver Stone and starring Tom Berenger, Willem Dafoe and Charlie Sheen. It is the first film of a trilogy of Vietnam War films by Stone (followed by 1989's Born on the Fourth of July and 1993's Heaven & Earth). Stone wrote the story based upon his experiences as a U.S. infantryman in Vietnam to counter the vision of the war portrayed in John Wayne 's The Green Berets. It was the first Hollywood film to be written and directed by a veteran of the Vietnam War."}]