[{"url": "http://www.foodnetwork.com/recipes/sunny-anderson/easy-bbq-short-ribs-recipe.html", "passage_text": "Directions. Preheat the oven to 300 degrees F. Arrange the short ribs in a 13 by 9-inch baking dish and season with salt and pepper, to taste. In a small bowl, combine all the remaining ingredients and stir to incorporate. Pour the sauce over ribs and toss well, coating all the pieces."}, {"url": "http://www.cleveland.com/taste/index.ssf/2012/01/short_ribs_long_on_flavor_inve.html", "passage_text": "Add half of the short ribs to the pan and cook on all sides until browned, a few minutes for each side. Transfer the ribs to a plate; repeat with the remaining oil and ribs. Prepare the sauce: Pour off all but 2 or 3 tablespoons of the fat from the pan."}, {"url": "http://www.wikihow.com/Cook-Short-Ribs", "passage_text": "1. Preheat the oven to 400 degrees F (204 degrees C). Place the short ribs on a baking sheet, season with salt and pepper, and roast in the oven for 15 minutes. Remove the ribs from the oven, and then reduce oven temperature to 300 degrees F (149"}, {"url": "http://www.cleveland.com/taste/index.ssf/2012/01/short_ribs_long_on_flavor_inve.html", "passage_text": "The day before cooking the short ribs, season them with salt and pepper; cover and refrigerate overnight. The next day, remove from the refrigerator 30 minutes before you plan to cook them. Brown the short ribs: Heat 2 tablespoons of the olive oil in a large enameled cast-iron Dutch oven over medium-high heat."}, {"url": "http://www.kraftrecipes.com/cooking-tips/how-to/how-to-cook-ribs.aspx", "passage_text": "how to cook ribs in the oven. 1  When cooking ribs in the oven, place ribs on rack of a broiler pan. 2  Brush with KRAFT or BULL’S-EYE Barbecue Sauce, then bake at 350°F for 1 hour 15 min. or until ribs are done, turning and brushing occasionally with additional barbecue sauce."}, {"url": "http://www.onceuponachef.com/2014/01/easy-slow-baked-boneless-bbq-short-ribs.html", "passage_text": "1 Pour 1/3 of the sauce (about 1/2 cup) over the short ribs. 2  Using tongs, flip the ribs over and spoon another 1/3 of the sauce over top. 3  Reserve the remaining BBQ sauce to spoon over the cooked ribs. 4  Cover the pan with aluminum foil and roast for 2-1/2 hours."}, {"url": "http://www.cleveland.com/taste/index.ssf/2012/01/short_ribs_long_on_flavor_inve.html", "passage_text": "Brown the short ribs on all sides at medium high heat; remove from the pan. Saute vegetables: Add onions, celery, carrot to Dutch oven; reduce heat to medium and saute for 8-10 minutes. Add the ginger, garlic and jalapeno; continue to cook out for 5 minutes."}, {"url": "http://www.cleveland.com/taste/index.ssf/2012/01/short_ribs_long_on_flavor_inve.html", "passage_text": "Preliminaries: Heat oven to 275 degrees. Season, sear the ribs: Rub the short ribs with salt, pepper and the Chinese five-spice. Heat a large Dutch oven over medium-high heat and add the oil. Sear the short ribs for 6 minutes on each side, or until well browned."}]