[{"url": "http://www.medicinenet.com/celiac_disease_gluten_enteropathy/article.htm", "passage_text": "1 Celiac disease is thought to be an autoimmune disorder and may have a familial or genetic component. 2  The symptoms usually involve the digestive system and cause: 3  abdominal discomfort, 4  bloating, 5  nausea, and. 6  loose bowel movements. 7  However, there is a wide spectrum of symptoms that may occur. Signs and symptoms of celiac disease may include: 1  diarrhea, 2  bloating, 3  gas (flatulence, farting), 4  swollen ankles (edema), 5  anemia, 6  fatigue, 7  vitamin K deficiency, and. 8  excessive bruising and bleeding."}, {"url": "http://www.webmd.com/digestive-disorders/celiac-disease/celiac-disease", "passage_text": "Celiac disease is a digestive disorder that occurs in reaction to gluten, a protein found in rye, barley, wheat, and hundreds of foods made with these grains. The body's immune system reacts to the gluten and causes damage to the intestine. Celiac disease, also known as celiac sprue or gluten-sensitive enteropathy, is fairly common. One in 133 Americans has the disorder and needs to follow a gluten-free diet. Symptoms of celiac disease vary among sufferers and include: 1  Digestive problems (abdominal bloating, pain, gas, diarrhea, pale stools, and weight loss). 2  A severe skin rash called dermatitis herpetiformis."}, {"url": "http://my.clevelandclinic.org/health/diseases_conditions/hic_celiac_disease", "passage_text": "When people with celiac disease eat foods containing gluten, their immune system forms antibodies to gluten, which then attack the intestinal lining. This causes inflammation in the intestines and damages the villi, the hair-like structures on the lining of the small intestine. Symptoms of celiac disease vary among sufferers and include: 1  Digestive problems (abdominal bloating, pain, gas, diarrhea, pale stools, and weight loss). 2  A severe skin rash called dermatitis herpitiformis. 3  Anemia (low blood count). 4  Musculoskeletal problems (muscle cramps, joint and bone pain)"}, {"url": "http://www.webmd.com/digestive-disorders/celiac-disease/celiac-disease-cause", "passage_text": "Celiac Disease-Cause. Although the exact cause of celiac disease isn't known, having certain genes increases your risk. You are more likely to have these genes if you have a first-degree relative (mother, father, brother, sister, son, or daughter) who has celiac disease. Environmental factors, such as infections, may trigger changes in the small intestine of a person with these genes."}, {"url": "http://www.medicinenet.com/celiac_disease_gluten_enteropathy/article.htm", "passage_text": "Gluten is a protein found in wheat, barley, and rye. In some people who are exposed to gluten in their diet, an enzyme called tissue transglutaminase changes the gluten into a chemical that causes an immune response, leading to inflammation of the lining of the small intestine. Signs and symptoms of celiac disease may include: 1  diarrhea, 2  bloating, 3  gas (flatulence, farting), 4  swollen ankles (edema), 5  anemia, 6  fatigue, 7  vitamin K deficiency, and. 8  excessive bruising and bleeding."}, {"url": "http://www.uptodate.com/contents/celiac-disease-in-adults-beyond-the-basics", "passage_text": "Celiac disease is a condition in which the immune system responds abnormally to a protein called gluten, which then leads to damage to the lining of the small intestine. Gluten is found in wheat, rye, barley, and a multitude of prepared foods. Celiac disease is also known as gluten sensitive enteropathy (enter-OH-pathy), celiac sprue, and nontropical sprue. The small intestine is responsible for absorbing food and nutrients. CELIAC DISEASE TREATMENT. Gluten-free diet — The cornerstone of treatment for celiac disease is complete elimination of gluten from the diet for life. Gluten is the group of proteins found in wheat, rye and barley that are toxic to those with celiac disease."}, {"url": "http://www.webmd.com/digestive-disorders/celiac-disease/celiac-disease", "passage_text": "Celiac disease -- also known as celiac sprue or gluten-sensitive enteropathy -- is a digestive and autoimmune disorder that results in damage to the lining of the small intestine when foods with gluten are eaten. Symptoms of celiac disease vary among sufferers and include: 1  Digestive problems (abdominal bloating, pain, gas, diarrhea, pale stools, and weight loss). 2  A severe skin rash called dermatitis herpetiformis."}, {"url": "http://www.nhs.uk/Conditions/Coeliac-disease/Pages/Causes.aspx", "passage_text": "Causes of coeliac disease. Coeliac disease is caused by an abnormal reaction by your immune system to the protein gluten, found in foods such as bread, pasta, cereals and biscuits. Some people with coeliac disease find eating oats can also trigger symptoms. Coeliac disease is an example of an autoimmune condition, when your immune system mistakes healthy cells and substances for harmful ones and produces antibodies against them (antibodies usually fight off bacteria and viruses)."}, {"url": "http://ghr.nlm.nih.gov/condition/celiac-disease", "passage_text": "Celiac disease is a condition in which the immune system is abnormally sensitive to gluten, a protein found in wheat, rye, and barley. Celiac disease is an autoimmune disorder; autoimmune disorders occur when the immune system malfunctions and attacks the body's own tissues and organs. In celiac disease, the villi become shortened and eventually flatten out. Intestinal damage causes diarrhea and poor absorption of nutrients, which may lead to weight loss. Abdominal pain, swelling (distention), and food intolerances are common in celiac disease."}]