[{"url": "http://www.nrmca.org/aboutconcrete/cips/28p.pdf", "passage_text": "Thisreduces the amount of residual moisture in the slab,will require a shorter drying period, and result in alower permeability to vapor transmission. Water re-ducing admixtures can be used to obtain adequateworkability and maintain a low water content. Test Strip – in which a test strip of the proposed primeror adhesive is evaluated for 24 hours to predict its be-havior on the floor. This procedure is not very reliable. Moisture meters – Measure electrical resistance or im-pedance to indicate slab moisture."}, {"url": "http://www.concretenetwork.com/vapor-barriers/moisture.html", "passage_text": "Without a vapor barrier, the relative humidity in the slab just below the surface can often be 100%. Since the air is seldom that humid, moisture is going to move from the slab into the air and as the surface dries a bit it will draw moisture up from the bottom. "}, {"url": "http://www.mymobilehomemakeover.com/2011/10/mobile-home-moisture-its-never-good-news-when-it-rains-inside/", "passage_text": "Here’s a link to a great document about Moisture Problems in Manufactured Homes put out by HUD (Housing and Urban Development). It lays out the many problem areas for moisture in your mobile home and some solutions to these issues. As I was saying, moisture can be a big issue for mobile homes. We tend to suffer with pretty poor insulation. Many states and the federal government developed new building standards for manufactured housing in the late 90’s. Our home was built in ’95"}, {"url": "http://www.energy.gov/energysaver/moisture-control", "passage_text": "If you your new or existing home has a crawlspace, you can also Install a 6-mil polyethylene vapor diffusion barrier across the crawlspace floor to prevent soil moisture from migrating into the crawlspace. Overlap all seams by 12 inches and tape them, and seal the polyethylene 6 inches up the crawlspace walls. "}, {"url": "http://www.ehow.com/how_6117802_stop-walls-sweating-mobile-home.html", "passage_text": "Long-term excess moisture in a home is not normal, and warrants an investigation. If left untreated, it can be quite destructive. Mobile homes with walls that sweat are suffering from condensation. Condensation happens when gases turn into a liquid form. Remove a piece of paneling or drywall from the worst wall in the mobile home. Remove the insulation from each bay of the wall. A layer of plastic should be visible between the exterior wall and the outside sheathing. The plastic acts as a vapor barrier."}, {"url": "http://www.stegoindustries.com/docs/Vapor%20Barriers%20Under%20Concrete%20Slabs.pdf", "passage_text": "A vapor barrier is effective in preventing water inflow from the ground-water through the concrete slab. Using a vapor barrier in combination with a gran-ular capillary break provides the greatest resistance to water inflow. barrier will be placed in contact with acrushed stone base. "}, {"url": "http://www.nrmca.org/aboutconcrete/cips/28p.pdf", "passage_text": "CIP 28 - Concrete Slab Moisture WHAT is the Problem?Concrete slab moisture can cause problems with theadhesion of floor-covering material, such as tile, sheetflooring, or carpet and bond-related failures of non-breathable floor coatings. Test Strip – in which a test strip of the proposed primeror adhesive is evaluated for 24 hours to predict its be-havior on the floor. This procedure is not very reliable. Moisture meters – Measure electrical resistance or im-pedance to indicate slab moisture."}, {"url": "http://www.ehow.com/how_6117802_stop-walls-sweating-mobile-home.html", "passage_text": "Instructions. Look under the mobile home to see if the home is set-up on a concrete slab or on solid ground. If the home is not on a concrete slab, apply a thick plastic sheet to the ground under the mobile home. Using either blocks or rocks, weight the plastic down to prevent transfer of moisture from the earth into the mobile home. Remove a piece of paneling or drywall from the worst wall in the mobile home. Remove the insulation from each bay of the wall. A layer of plastic should be visible between the exterior wall and the outside sheathing. The plastic acts as a vapor barrier."}]