[{"url": "http://www.medicinenet.com/script/main/art.asp?articlekey=3784", "passage_text": "Hormone, aldosterone: A hormone made by the outer portion (cortex) of the adrenal gland that regulates the balance of salt and water in the body. Pronounced AL·do·ste·rone. Aldosterone is secreted in response to low salt levels. Aldosterone then activates the MR (for mineralocorticoid receptor) gene. (Aldosterone is classified as a mineralocorticoid hormone.) The product of the MR gene, in turn, stimulates the kidney to reabsorb and retain salt, thereby retaining water. "}, {"url": "https://www.sharecare.com/health/endocrine-system/what-is-function-aldosterone-hormone", "passage_text": "Aldosterone affects sodium, potassium, total fluid in the body, and blood pressure. Aldosterone causes the kidneys to hold onto more sodium, which leads to more water staying in the body. The more fluid the body holds onto, the higher the blood pressure may become. Potassium may decrease as the amount of aldosterone increases. Aldosterone also directly affects the heart and blood vessels"}, {"url": "https://www.sharecare.com/health/endocrine-system/what-is-function-aldosterone-hormone", "passage_text": "Aldosterone belongs to a class of hormones called mineral corticoids, also produced by the adrenal glands. Aldosterone helps maintain blood pressure (BP) and water and salt balance in the body by helping the kidneys retain sodium and excrete potassium. Aldosterone causes the kidneys to hold onto more sodium, which leads to more water staying in the body. The more fluid the body holds onto, the higher the blood pressure may become. Potassium may decrease as the amount of aldosterone increases."}, {"url": "http://www.thefreedictionary.com/aldosterone", "passage_text": "1. aldosterone-a corticosteroid hormone that is secreted by the cortex of the adrenal gland; regulates salt (sodium and potassium) and water balance. mineralocorticoid-hormone that is one of the steroids of the adrenal cortex that influences the metabolism of sodium and potassium. Translations"}, {"url": "http://www.medicinenet.com/script/main/art.asp?articlekey=2191", "passage_text": "Aldosterone: A hormone produced by the outer portion (cortex) of the adrenal gland. Aldosterone regulates the balance of water and electrolytes in the body, encouraging the kidney to excrete potassium into the urine and retain sodium, thereby retaining water. It is classified as a mineralocorticoid hormone. "}, {"url": "http://www.webmd.com/a-to-z-guides/aldosterone", "passage_text": "An aldosterone test measures the level of aldosterone (a hormone made by the adrenal glands), in the blood. Aldosterone helps regulate sodium and potassium levels in the body. High levels of both renin and aldosterone are normally present when the body is trying to conserve fluid and salt (sodium). When a tumor that makes aldosterone is present, your aldosterone level will be high while a renin level will be low. Usually a renin activity test is done when the aldosterone level is measured."}, {"url": "https://www.sharecare.com/health/endocrine-system/what-is-function-aldosterone-hormone", "passage_text": "The aldosterone hormone is a hormone produced by the adrenal gland. The hormone acts mainly in the functional unit of the kidneys to aid in the conservation of sodium, secretion of potassium, water retention and to stabilize blood pressure. Aldosterone causes the kidneys to hold onto more sodium, which leads to more water staying in the body. The more fluid the body holds onto, the higher the blood pressure may become. Potassium may decrease as the amount of aldosterone increases."}, {"url": "https://en.wikipedia.org/wiki/Aldosterone", "passage_text": "From Wikipedia, the free encyclopedia. Aldosterone is a steroid hormone (mineralocorticoid family) produced by the outer section (zona glomerulosa) of the adrenal cortex in the adrenal gland. "}, {"url": "http://www.yourhormones.info/hormones/aldosterone.aspx", "passage_text": "Aldosterone is a steroid hormone. Its main role is to regulate salt and water in the body, thus having an effect on blood pressure. Alternative names for aldosterone Electrocortin, 11β,21-dihydroxy-3,20-dioxopregn-4-en-18-al. "}, {"url": "http://www.webmd.com/a-to-z-guides/aldosterone", "passage_text": "Guide. An aldosterone test measures the level of aldosterone (a hormone made by the adrenal glands), in the blood. Aldosterone helps regulate sodium and potassium levels in the body. This helps control blood pressure and the balance of fluids and electrolytes in the blood. High levels of both renin and aldosterone are normally present when the body is trying to conserve fluid and salt (sodium). When a tumor that makes aldosterone is present, your aldosterone level will be high while a renin level will be low. Usually a renin activity test is done when the aldosterone level is measured."}]