[{"url": "http://www.investopedia.com/terms/d/delphi-method.asp", "passage_text": "DEFINITION of 'Delphi Method'. A forecasting method based on the results of questionnaires sent to a panel of experts. Several rounds of questionnaires are sent out, and the anonymous responses are aggregated and shared with the group after each round. The experts are allowed to adjust their answers in subsequent rounds. Because multiple rounds of questions are asked and because each member of the panel is told what the group thinks as a whole, the Delphi Method seeks to reach the correct response through consensus."}, {"url": "https://en.wikipedia.org/wiki/Delphi_method", "passage_text": "The name Delphi derives from the Oracle of Delphi. The authors of the method were not happy with this name, because it implies something oracular, something smacking a little of the occult. The Delphi method is based on the assumption that group judgments are more valid than individual judgments. The person coordinating the Delphi method is usually known as a facilitator or Leader, and facilitates the responses of their panel of experts, who are selected for a reason, usually that they hold knowledge on an opinion or view."}, {"url": "http://www.referenceforbusiness.com/encyclopedia/Cos-Des/Delphi-Technique.html", "passage_text": "The Delphi technique is an intensive and fairly specialized group problem-solving method used to harness and reconcile the knowledge and judgment of several experts. ADVANTAGES OF THE DELPHI TECHNIQUE. There are several advantages to the Delphi technique. One of the most significant is its versatility. The technique can be used in a wide range of environments, e.g., government planning, business and industry predictions, volunteer group decisions."}, {"url": "http://www.vlrc.org/articles/110.html", "passage_text": "The process used to “facilitate” the meeting is called the Delphi Technique. This Delphi Technique was developed by the RAND Corporation for the U.S. Department of Defense back in the 1950s. It was originally intended for use as a psychological weapon during the cold war. "}, {"url": "http://project-management-knowledge.com/definitions/d/delphi-technique/", "passage_text": "Delphi Technique. The Delphi Technique is an essential project management technique that refers to an information gathering technique in which the opinions of those whose opinions are most valuable, traditionally industry experts, is solicited, with the ultimate hope and goal of attaining a consensus. "}, {"url": "http://www.pmchamp.com/delphi-technique-explained-for-pmp-exam/", "passage_text": "The Delphi technique is a quick way to reach a consensus for any decision making. In this method, all the feedback from the different experts is collected anonymously by the moderator. The Delphi technique is actually one of the Group Decision-Making Techniques. It is used in. It can also be used in. The Delphi method has been in existence for almost 80 years plus, and has been proven to be useful time and again. It is important that you understand this concept, and use it"}, {"url": "http://www.businessdictionary.com/definition/Delphi-technique.html", "passage_text": "The delphi technique fostered an open air of ideas exchanging and being analyzing and critically thought about for the benefit of all. 9 people found this helpful. You should try to use a delphi technique when you are about to make a very big decision in your company. 5 people found this helpful. I did not like the delphi technique because I knew that it required me to break my comfort zone and talk to other people. 6 people found this helpfu"}, {"url": "https://en.wikipedia.org/wiki/Delphi_method", "passage_text": "The Delphi method (/ˈdɛlfaɪ/ DEL-fy) is a structured communication technique or method, originally developed as a systematic, interactive forecasting method which relies on a panel of experts. The experts answer questionnaires in two or more rounds. The person coordinating the Delphi method is usually known as a facilitator or Leader, and facilitates the responses of their panel of experts, who are selected for a reason, usually that they hold knowledge on an opinion or view."}, {"url": "http://it.toolbox.com/blogs/enterprise-solutions/what-the-heck-is-the-delphi-technique-11731", "passage_text": "Please Sign In or Register to like this blog. The Delphi Technique is a technique in which a group of participants assign ratings to a list of items. Participants rate items again, while aware of the previous ratings of the entire group. The."}]