[{"url": "https://en.wikipedia.org/wiki/Inferior_vena_cava", "passage_text": "The inferior vena cava (or IVC) (Latin: vena, vein, cavus, hollow), is one of the venae cavae, two large veins, that carries deoxygenated blood from the body into the right atrium of the heart. On the right, the gonadal veins and suprarenal veins drain into the inferior vena cava directly. On the left, they drain into the renal vein which in turn drains into the inferior vena cava. By contrast, all the lumbar veins and hepatic veins usually drain directly"}, {"url": "https://www.kenhub.com/en/library/anatomy/inferior-vena-cava", "passage_text": "After circulating through the body systemically, deoxygenated blood returns to the right atrium of the heart through either the superior vena cava, which drains the upper body, or the IVC that drains everything below the diaphragm, including the lower trunk, abdomen, pelvis, and lower limbs. Anatomy. The inferior vena cava (IVC, also known as the posterior vena cava) is a large diameter vein that is located posterior to the abdominal cavity and runs alongside of the right side of the vertebral column (thus making it a retroperitoneal structure), with the aorta lying laterally on the left of the IVC."}, {"url": "http://www.answers.com/Q/Inferior_and_superior_vena_cavas_drain_into", "passage_text": "The superior vena cava is a large, yet short vein that carries deoxygenated blood from the upper half of the body to the heart's right atrium. The inferior vena cava (or IVC) … is the large vein that carries de-oxygenated blood from the lower half of the body into the right atrium of the heart. "}, {"url": "http://www.innerbody.com/image_card01/card46-new2.html", "passage_text": "Deoxygenated blood enters the right atrium through three major veins: the superior and inferior vena cava and the coronary sinus. The superior vena cava returns all of the blood to the heart from tissues superior to the heart in the head, neck, arms and upper thorax. "}, {"url": "http://www.innerbody.com/image_dige07/card26.html", "passage_text": "The inferior vena cava is the largest vein in the human body. It collects blood from veins serving the tissues inferior to the heart and returns this blood to the right atrium of the heart. The inferior vena cava and its tributaries drain blood from the feet, legs, thighs, pelvis and abdomen and deliver this blood to the heart. Many one-way venous valves help to move blood through the veins of the lower extremities against the pull of gravity."}, {"url": "https://en.wikipedia.org/wiki/Superior_vena_cava", "passage_text": "From Wikipedia, the free encyclopedia. The superior vena cava (also known as the cava or cva) is a large diameter (24 mm), yet short, vein that carries deoxygenated blood from the upper half of the body to the heart 's right atrium. It is located in the anterior right superior mediastinum. "}, {"url": "https://en.wikipedia.org/wiki/Inferior_vena_cava", "passage_text": "The inferior vena cava carries blood from the lower half of the body whilst the superior vena cava carries blood from the upper half of the body. It is formed by the joining of the right and the left common iliac veins, usually at the level of the fifth lumbar vertebra. On the right, the gonadal veins and suprarenal veins drain into the inferior vena cava directly. On the left, they drain into the renal vein which in turn drains into the inferior vena cava. By contrast, all the lumbar veins and hepatic veins usually drain directly"}, {"url": "http://www.answers.com/Q/What_does_the_superior_vena_cava_drain", "passage_text": "The superior vena cava is located in the upper thoracic region. It is the main vein that drains into the right atrium of the heart. Blood returning from the brain, upper thora … cic region, and arms travels through this vein to the heart. + 6 others found this useful. "}, {"url": "http://www.anatomyatlases.org/AnatomicVariants/Cardiovascular/Text/Veins/InferiorVenaCava.shtml", "passage_text": "If the inferior vena cava is absent, the blood from the lower limbs may pass through the diaphram into the superior vena cava by way of a large vein in the location of the ascending lumbar and azygos veins. "}]