[{"url": "https://www.mainstreet.com/article/2015-irs-standard-mileage-rates-announced-get-a-tax-deduction-for-driving", "passage_text": "Beginning on January 1, 2015, the standard mileage rates for the use of a car will be: 1  57.5 cents per mile for business miles, up 1.5 cents from 2014. 2  23 cents per mile for medical or moving miles, down 0.5 cents from 2014. 3  14 cents per mile driven in volunteer service of charitable organization, unchanged."}, {"url": "https://www.mainstreet.com/article/2015-irs-standard-mileage-rates-announced-get-a-tax-deduction-for-driving", "passage_text": "The portion of the business standard mileage rate considered to be depreciation is 24 cents for 2015, up 2 cents from 2014. These rates apply no matter where in the United States you drive, and no matter what type, model or make of car you drive."}, {"url": "https://www.irs.gov/pub/irs-drop/N-13-80.pdf", "passage_text": "For automobiles a taxpayer uses for business purposes, the portion of the. business standard mileage rate treated as depreciation is 23 cents per mile for 2010, 22. cents per mile for 2011, 23 cents per mile for 2012, 23 cents per mile for 2013, and 22. cents per mile for 2014."}, {"url": "http://www.efile.com/tax-deduction/mileage-rates/", "passage_text": "The optional standard tax deductible IRS mileage rates for the use of your car, van, pickup truck, or panel truck during 2013 are: 1  56.5 cents per mile driven for business purposes. 2  24 cents per mile driven for medical or moving purposes. 3  14 cents per mile driven in service of charitable organizations."}, {"url": "http://www.efile.com/tax-deduction/mileage-rates/", "passage_text": "The standard mileage rates for the use of a car, van, pickup, or panel truck: 1  55 cents per mile for business miles driven. 2  24 cents per mile driven for medical or moving purposes. 3  14 cents per mile driven in service of charitable organizations."}, {"url": "http://www.journalofaccountancy.com/news/2014/dec/irs-standard-mileage-rates-2015-201411494.html", "passage_text": "Optional standard mileage rates for use of a vehicle will change a little for 2015, the IRS announced on Wednesday, with the business use rate going up and the medical and moving rate going down (Notice 2014-79)."}, {"url": "http://www.scouting.org/sitecore/content/FinanceImpact/FID_e-Letter/Volume_5_Issue_12A/IRS_2013_Standard_Mileage_Rates.aspx", "passage_text": "1 For automobiles a taxpayer uses for business purposes, the portion of the business standard mileage rate treated as depreciation is 21 cents per mile for 2009, 23 cents per mile for 2010, 22 cents per mile for 2011, 23 cents per mile for 2012, and 23 cents per mile for 2013."}, {"url": "http://www.taxsquad.com/35380/IRS-Announces-2013-Automobile-Mileage-Rates/", "passage_text": "1 For automobiles a taxpayer uses for business purposes, the portion of the business standard mileage rate treated as depreciation is 23 cents per mile for 2013, the same as in 2012. 2  The IRS also publishes a standard mileage rate for the use of a vehicle for medical or moving purposes."}, {"url": "http://fairtaxinc.com/files/2014/01/Mileage-Rates.pdf", "passage_text": "Mileage Rates PURPOSE 2013 2014 Standard 56.5 56.0 Charitable 14.0 14.0 Medical/Moving 24.0 23.5 Depreciation Portion of Standard Mileage Rate: 2009 – 21 cents per mile 2010 – 23 cents per mile 2011 – 22 cents per mile 2012 – 23 cents per mile 2013 – 23 cents per mile 2014 – 22 cents per mile."}]