[{"url": "https://en.wikipedia.org/wiki/Bugger", "passage_text": "As an interjection, bugger is sometimes used as a single-word expletive. Buggeration is a derivation occasionally found in British English. As with many expletives, its continued use has reduced its shock value and offensiveness. Bugger all means nothing as in You may not like paying taxes, but there's bugger all you can do about it. and The police are doing bugger all about all this aggro that's going on See also fuck all, sweet FA, and Llareggub."}, {"url": "http://onlineslangdictionary.com/meaning-definition-of/bugaboo", "passage_text": "Link to this slang definition. To link to this term in a web page or blog, insert the following. To link to this term in a wiki such as Wikipedia, insert the following. Some wikis use a different format for links, so be sure to check the documentation. "}, {"url": "http://www.urbandictionary.com/define.php?term=Bugga%20Wolf", "passage_text": "Top Definition. Bugga Wolf. A female that you meet when your getting awesome that seduces you into circumstances you normally would not let happen. mostly found on spring break. you should of saw Tom Leavin with Bugga Wolf last night, with her and teen wolf here i thought i was in the thriller video. by Skrilla Manilla August 12, 2008."}, {"url": "https://uk.answers.yahoo.com/question/index?qid=20080705034444AA1Iv98", "passage_text": "Bugger is term that is used in the dialect British English, South African English, Australian English, New Zealand English and Sri Lankan English. The original meaning is sodomy. The word bugger is used affectionately as well as a negative term. In Welsh English language it is used when one is really fond of something. Bugger literally means to have anal sex. But it was also a fairly acceptable swear word. Someone might shout it if they stubbed their toe. Or you might call someone a bugger, if you didn't like them. You little bugger.. Or, my iPod doesn't work, it's buggered.. Rank can mean disgusting. I went to my friend's house."}, {"url": "https://en.wikipedia.org/wiki/Bugger", "passage_text": "Bugger is a slang word. The term is a general-purpose expletive, used to imply dissatisfaction, or to refer to someone or something whose behaviour is in some way displeasing or perhaps surprising. Bugger all means nothing as in You may not like paying taxes, but there's bugger all you can do about it. and The police are doing bugger all about all this aggro that's going on See also fuck all, sweet FA, and Llareggub."}, {"url": "https://uk.answers.yahoo.com/question/index?qid=20080705034444AA1Iv98", "passage_text": "· just now. Report Abuse. Bugger is Brit slang for Sodomy; rank is just a way of saying: nasty, unpleasant and other variants; mince meat is a single word (mincemeat) it means--in terms of physical violence--to beat someone severely, and in a verbal argument to destroy your opponents argument. Bugger literally means to have anal sex. But it was also a fairly acceptable swear word. Someone might shout it if they stubbed their toe. Or you might call someone a bugger, if you didn't like them. You little bugger.. Or, my iPod doesn't work, it's buggered.. Rank can mean disgusting. I went to my friend's house."}, {"url": "http://www.merriam-webster.com/dictionary/bugaboo", "passage_text": "Full Definition of BUGABOO. 1. : an imaginary object of fear. 2. : bugbear 2; also: something that causes fear or distress out of proportion to its importance. See bugaboo defined for English-language learners. See bugaboo defined for kids. "}, {"url": "https://uk.answers.yahoo.com/question/index?qid=20080705034444AA1Iv98", "passage_text": "Bugger is a swear word that has lost its original sense of a person who indulges in anal sex. When used orally it either describes an awkward or nasty person, or it is a word which people use as an expletive when something goes wrong. Bugger literally means to have anal sex. But it was also a fairly acceptable swear word. Someone might shout it if they stubbed their toe. Or you might call someone a bugger, if you didn't like them. You little bugger.. Or, my iPod doesn't work, it's buggered.. Rank can mean disgusting. I went to my friend's house."}, {"url": "http://www.urbandictionary.com/define.php?term=bugga", "passage_text": "bugga. A burly bloke who gets drunk most nights while wearing scantily clad gym wears and slip slops. Often has an overly baritone voice which he uses to attract nearby females by being as loud as possible and singing rugby war cries. Relationship between 3 sisters/friends/lovers. a good friend will bail you outta jail. a bugga will be right there next to you saying dude that was fucking awesome!!!!!!!. Buggas are very special people in your life. They are the first people you think about when you make plans. They are the first people you go to when you need someone to talk to. You will phone them up just to talk about nothing, or the most important things in your life. When you’re sad they will try their hardest to cheer you up"}]