[{"url": "https://en.wikipedia.org/wiki/Macrophage", "passage_text": "Mφ) are a type of white blood cell that engulfs and digests cellular debris, foreign substances, microbes, cancer cells, and anything else that does not have the types of proteins specific to the surface of healthy body cells on its surface in a process called phagocytosis. After digesting a pathogen, a macrophage will present the antigen (a molecule, most often a protein found on the surface of the pathogen and used by the immune system for identification) of the pathogen to the corresponding helper T cell."}, {"url": "http://www.anatomyatlases.org/MicroscopicAnatomy/Section09/Plate09172.shtml", "passage_text": "The spleen contains both B and T lymphocytes; thus, it is also important in the immune defense system. The spleen, as already suggested, contains massive numbers of macrophages, which also remove lining pathogens as well as inert substances from the blood stream. The spleen is the largest single accumulation of lymphoid tissue in the human body. it is also the most important in-line filter for the blood vascular system. Its primary function is to remove (1 X 10 6 /second) wornout red blood cells and to store and recycle their component parts."}, {"url": "http://biology.about.com/od/anatomy/ss/spleen.htm", "passage_text": "Both white and red pulp contain lymphocytes and immune cells called macrophages. These cells dispose of antigens, dead cells, and debris by engulfing and digesting them. While the spleen functions chiefly to filter blood, it also stores red blood cells and platelets. In instances where extreme bleeding occurs, red blood cells, platelets, and macrophages are released from the spleen. Macrophages help to reduce inflammation and destroy pathogens or damaged cells in the injured area. T-cells contain proteins called T-cell receptors that populate the T-cell membrane. They are capable of recognizing various types of antigens (substances that provoke an immune response). T-lymphocytes are derived from the thymus and travel to the spleen via blood vessels."}, {"url": "http://www.thebody.com/content/art1788.html", "passage_text": "Spleen -- The spleen is an immunologic filter of the blood. It is made up of B cells, T cells, macrophages, dendritic cells, natural killer cells and red blood cells. In addition to capturing foreign materials (antigens) from the blood that passes through the spleen, migratory macrophages and dendritic cells bring antigens to the spleen via the bloodstream. "}, {"url": "http://www2.estrellamountain.edu/faculty/farabee/biobk/BioBookIMMUN.html", "passage_text": "Some lymphocytes migrate to the thymus and become T cells that circulate in the blood and are associated with the lymph nodes and spleen. B cells remain in the bone marrow and develop before moving into the circulatory and lymph systems. B cells produce antibodies. Macrophage Attacking E.coli (SEM x8,800). Lymph organs include the bone marrow, lymph nodes, spleen, and thymus. Bone marrow contains tissue that produces lymphocytes. B-lymphocytes (B-cells) mature in the bone marrow. T-lymphocytes (T-cells) mature in the thymus gland."}, {"url": "http://patient.info/health/the-spleen", "passage_text": "27. 0. 0. 15. This leaflet gives a brief overview of the spleen and its functions. The spleen is an organ about the size of a clenched fist found on the left-hand side of your upper abdomen. Its main functions are to filter your blood, create new blood cells and store platelets. It is also a key part of your body's immune system. "}, {"url": "http://www.ncbi.nlm.nih.gov/pubmed/22327291", "passage_text": "In the lymphoid compartment of the spleen, the white pulp, macrophages are in essence similar to populations found in lymph nodes and other organized secondary lymphoid organs. In the red pulp, large populations of classical scavenger macrophages are found that, in addition to scavenging blood-borne debris, are involved in iron recycling by phagocytosis of effete red blood cells. The most conspicuous macrophage populations of the spleen are located in the marginal zone."}, {"url": "http://textbookofbacteriology.net/adaptive_2.html", "passage_text": "Spleen The spleen is is made up of B cells, T cells, macrophages, dendritic cells, natural killer cells and red blood cells. The spleen filters antigens directly from the blood that passes through it, and migratory macrophages and dendritic cells bring antigens to the spleen via the bloodstream. An immune response is initiated when a macrophage or dendritic cell presents antigen to appropriate B or T cells. In the spleen, B cells become activated and produce large amounts of antibody. Lymph Nodes The lymphatic system parallels the circulatory blood system."}]