[{"url": "http://www.imf.org/external/np/fin/data/rms_sdrv.aspx", "passage_text": "SDR Valuation The currency value of the SDR is determined by summing the values in U.S. dollars, based on market exchange rates, of a basket of major currencies (the U.S. dollar, Euro, Japanese yen, and pound sterling). 2. IMF Rule O-2(a) defines the value of the U.S. dollar in terms of the SDR as the reciprocal of the sum of the equivalents in U.S. dollars of the amounts of the currencies in the SDR basket, rounded to six significant digits."}, {"url": "https://en.wikipedia.org/wiki/Special_drawing_rights", "passage_text": "Special drawing rights (XDR or SDR) are supplementary foreign exchange reserve assets defined and maintained by the International Monetary Fund (IMF). Their value is based on a basket of key international currencies reviewed by IMF every five years. "}, {"url": "http://www.imf.org/external/np/fin/data/rms_sdrv.aspx", "passage_text": "The SDR currency value is calculated daily (except on IMF holidays or whenever the IMF is closed for business) and the valuation basket is reviewed and adjusted every five years. Currency Amounts in New Special Drawing Rights (SDR) Basket. 2. IMF Rule O-2(a) defines the value of the U.S. dollar in terms of the SDR as the reciprocal of the sum of the equivalents in U.S. dollars of the amounts of the currencies in the SDR basket, rounded to six significant digits."}, {"url": "http://fx.sauder.ubc.ca/SDR.html", "passage_text": "To calculate the value of the SDR in national currency (say, ABC), multiply the four exchange rates of the home country vis-a-à vis the-basket currency (countries.i., E/ABC, USD/ABC, EUR/ABC, jpy AND/ABC) gbp with the basket values indicated in the above. table The exchange rates used by the IMF to calculate the official SDR are the noon rates in the London foreign exchange market. When the London market is closed, noon rates in the New York market are used, and Frankfurt fixing rates are employed when the New York market is also closed."}, {"url": "http://www.imf.org/external/np/fin/data/sdr_ir.aspx", "passage_text": "The interest rate on the SDR is based on the sum of the multiplicative products in SDR terms of the currency amounts in the SDR valuation basket, the level of the interest rate on the financial instrument of each component currency in the basket, and the exchange rate of each currency against the SDR. The SDR interest rate for the current week is posted on Sunday morning, Washington D.C. time, on the IMF’s website."}, {"url": "http://coinmill.com/SDR_calculator.html", "passage_text": "This currency convertor is up to date with exchange rates from October 13, 2015. Enter the amount to be converted in the box to the left of the currency and press the convert button. To show Special Drawing Rights and just one other currency click on any other currency. The exchange rate for the Special Drawing Right was last updated on October 13, 2015 from The International Monetary Fund. The SDR conversion factor has 6 significant digits"}, {"url": "http://fx.sauder.ubc.ca/SDR.html", "passage_text": "Initially, the value of the SDR was defined in terms of one US-$, which in turn was defined in terms of an ounce of gold: $35/oz until 18-Dec-1971; $38/oz between 18-Dec-1971 and 11-Feb-1973; $42.22/oz between 12-Feb-1973 and 30-Jun-1974. Since July 1974 the SDR has been defined in terms of a basekt of currencies. The exchange rates used by the IMF to calculate the official SDR are the noon rates in the London foreign exchange market. When the London market is closed, noon rates in the New York market are used, and Frankfurt fixing rates are employed when the New York market is also closed."}, {"url": "http://www.engineeringtoolbox.com/sdr-standard-dimension-ratio-d_318.html", "passage_text": "The SDR is the ratio of pipe diameter to wall thickness and the SDR can be expressed as. SDR = D / s (1). where. D = pipe outside diameter (mm). s = pipe wall thickness (mm). A SDR 11 means that the outside diameter-D - of the pipe is eleven times the thickness-s - of the wall. It is common to use the Standard Dimension Ratio-SDR-as method of rating pressure piping. SDR = D / s (1) where D = pipe outside diameter (mm) s = pipe wall thickness (mm). Many PE pipe manufacturers use the Standard Dimension Ratio - SDR-"}]