[{"url": "http://financial-dictionary.thefreedictionary.com/FHA+Mortgage", "passage_text": "FHA Mortgage. A mortgage on which the lender is insured against loss by the Federal Housing Administration, with the borrower paying the mortgage insurance premium. "}, {"url": "http://www.investopedia.com/terms/f/fhaloan.asp", "passage_text": "DEFINITION of 'FHA Loan'. A mortgage issued by federally qualified lenders and insured by the Federal Housing Administration (FHA). FHA loans are designed for low to moderate income borrowers who are unable to make a large down payment. FHA loans allow the borrower to borrow up to 97% of the value of the home. "}, {"url": "http://www.ehow.com/facts_5125131_fha-mortgage-loan.html", "passage_text": "Lower Credit Means Higher Down Payment. Most buyers are eligible for the minimum down payment requirement of 3.5 percent. However, individuals with marginal credit -- scores less than 580 -- have to come up with a higher down payment of at least 10 percent down. Mortgages for Buying and Refinancing. You can use an FHA-insured mortgage to buy or refinance a primary residence. Individuals may mortgage a one-to four-unit property, including a condominium, manufactured home or single-family house."}, {"url": "http://www.investorwords.com/1926/FHA_Loan.html", "passage_text": "Definition. A government mortgage that is insured by the Federal Housing Administration (FHA). These loans have been insured by the FHA since the creation of the agency in 1934. "}, {"url": "http://www.fha.com/fha_article?id=25", "passage_text": "FHA Streamline Loan Defined. If you own a home you still owe mortgage payments on, chances are you're examining your refinancing options. In today's economy everyone needs a way to lower monthly payments and make housing more affordable. The FHA has a variety of refinancing options, including; "}, {"url": "http://www.zillow.com/mortgage-learning/fha-203k/", "passage_text": "Getting a Mortgage Loan for a Fixer-Upper: A Primer on FHA 203k Loans. The idea of buying a fixer-upper and turning it into your dream abode can seem so perfect — every nook and cranny just to your specifications! The reality, however, can be harsh. "}, {"url": "https://www.redfin.com/definition/FHA-loan", "passage_text": "HIDE DEBUG INFO. One of two types of alternatives to a conventional loan (the other is a Veterans Affairs (VA) loan), FHA loans are insured by the Federal Housing Administration. Federal Housing Administration Loan. One of two types of alternatives to a conventional loan (the other is a Veterans Affairs (VA) loan), FHA loans are insured by the Federal Housing Administration. If the homebuyer can't pay the loan, the government pays the lender for any losses."}, {"url": "http://www.zillow.com/mortgage-learning/fha-loan/", "passage_text": "FHA Loan Rates. You can use Zillow Mortgage Marketplace as an FHA loan calculator. Just submit a loan request with less than a 20% down payment and you will receive custom FHA quotes instantly from a marketplace filled with hundreds of lenders. The process is free, easy and best of all, you are anonymous. "}, {"url": "http://homeguides.sfgate.com/fha-first-time-homebuyer-definition-2053.html", "passage_text": "Importance to FHA. There are good reasons to attempt to qualify for first-time homebuyer status. The FHA gives special consideration to those who have never owned a home, and its loan terms are attractive in that regard. "}]