[{"url": "http://www.nhlbi.nih.gov/health/health-topics/topics/hbc/", "passage_text": "LDL cholesterol sometimes is called “bad” cholesterol. A high LDL level leads to a buildup of cholesterol in your arteries. (Arteries are blood vessels that carry blood from your heart to your body.). HDL cholesterol sometimes is called “good” cholesterol. This is because it carries cholesterol from other parts of your body back to your liver. "}, {"url": "http://www.nytimes.com/health/guides/disease/atherosclerosis/overview.html", "passage_text": "Hardening of the arteries, also called atherosclerosis, is a common disorder. It occurs when fat, cholesterol, and other substances build up in the walls of arteries and form hard structures called plaques. "}, {"url": "http://www.heart.org/HEARTORG/Conditions/Cholesterol/WhyCholesterolMatters/Atherosclerosis_UCM_305564_Article.jsp", "passage_text": "Atherosclerosis, or hardening of the arteries, is a condition in which plaque builds up inside the arteries. Plaque is made of cholesterol, fatty substances, cellular waste products, calcium and fibrin (a clotting material in the blood). Atherosclerosis is a type of arteriosclerosis. Many scientists believe plaque begins to form because the inner lining of the artery, called the endothelium, becomes damaged. Three possible causes of damage to the arterial wall are: 1  Elevated levels of cholesterol and triglycerides in the blood. 2  High blood pressure."}, {"url": "http://www.webmd.com/heart-disease/clogged-arteries-arterial-plaque", "passage_text": "1 HDL is believed to remove some of the bad cholesterol from plaque in clogged arteries and transport it back to the liver, where it is eliminated. 2  High blood pressure. 3  Having high blood pressure increases the rate at which arterial plaque builds up. 4  It also hastens the hardening of clogged arteries. 5  Cigarette smoke. "}, {"url": "http://www.webmd.com/cholesterol-management/cholesterol-and-artery-plaque-buildup", "passage_text": "The sudden blood clot that forms over the rupture then causes a heart attack or stroke. Blocked arteries caused by plaque buildup and blood clots are the leading cause of death in the U.S. Reducing cholesterol and other risk factors can help prevent cholesterol plaques from forming. Occasionally, it can even reverse some plaque buildup. "}, {"url": "http://www.nhlbi.nih.gov/health/health-topics/topics/atherosclerosis/", "passage_text": "Atherosclerosis is a disease in which plaque builds up inside your arteries. Arteries are blood vessels that carry oxygen-rich blood to your heart and other parts of your body. Plaque is made up of fat, cholesterol, calcium, and other substances found in the blood. Over time, plaque hardens and narrows your arteries. This limits the flow of oxygen-rich blood to your organs and other parts of your body. Atherosclerosis can lead to serious problems, including heart attack, stroke, or even death"}, {"url": "http://healthguides.healthgrades.com/taking-cholesterol-seriously/7-things-that-cause-plaque-buildup-in-the-arteries", "passage_text": "You’ve Got the Power. Plaque buildup in the arteries—called atherosclerosis—causes the arteries to narrow, increasing the risk for heart attack and stroke. But you have the power to prevent, stop, and possibly even reverse plaque buildup with lifestyle changes. 7 Things That Cause Plaque Buildup in the Arteries. Plaque buildup in the arteries—called atherosclerosis—causes the arteries to narrow, increasing the risk for heart attack and stroke. But you have the power to prevent, stop, and possibly even reverse plaque buildup with lifestyle changes."}, {"url": "http://healthguides.healthgrades.com/taking-cholesterol-seriously/foods-that-cause-plaque-buildup-in-the-arteries", "passage_text": "The Power of Food. Certain foods can cause the body to make too much of a waxy substance called cholesterol. Cholesterol can combine with fat, calcium, and other substances in the blood to form plaque. Plaque then slowly builds up and hardens in the arteries, causing them to narrow. This buildup of plaque, a condition called atherosclerosis, can lead to heart disease, heart attack, and stroke. Saturated fat is a main dietary culprit in the buildup of plaque in the arteries. As a result, experts suggest trying to keep saturated fat to less than 7% of total daily calories. A primary source of saturated fat is animal products."}, {"url": "http://www.heart.org/HEARTORG/Conditions/Cholesterol/WhyCholesterolMatters/Atherosclerosis_UCM_305564_Article.jsp", "passage_text": "The artery narrows and blood flow is reduced, thus decreasing the oxygen supply. Often a blood clot forms and blocks the artery, stopping the flow of blood. If the oxygen supply to the heart muscle is reduced, a heart attack can occur. If the oxygen supply to the brain is cut off, a stroke can occur. Many scientists believe plaque begins to form because the inner lining of the artery, called the endothelium, becomes damaged. Three possible causes of damage to the arterial wall are: 1  Elevated levels of cholesterol and triglycerides in the blood. 2  High blood pressure."}]