[{"url": "http://www.landscape-design-advice.com/paving-costs.html", "passage_text": "Pavers Concrete pavers are a popular choice. Pavers cost more than stamped concrete. Many of the nice looking pavers of today are tumbled to give a stone-like appearance. Paving costs for pavers will be in the neighborhood of $15.00 per square foot. Find out what this patio costs done in pavers ! I've divided it into the patio, landing, and seat wall."}, {"url": "http://wisercosts.com/toronto-57268-install-interlocking-pavers-costs", "passage_text": "Average Cost per square foot for Interlocking Paver Installation in Toronto. The average cost to Install Interlocking Pavers in Toronto 2015 is $8.61 to $9.54 per square foot. Always make sure to make all hiring decisions carefully and to make sure the contractor is fully insured, bonded and licensed. 1 Non-discounted retail costs for 215 square feet of Interlocking Paver Installation-between $767.29 and $866.95. 2  Direct labor costs to Install Interlocking Pavers in Toronto-between $837.98 and $894.14."}, {"url": "http://www.tiletechpavers.com/cost-of-concrete-pavers", "passage_text": "Bricks and Pavers. Brick Pavers can cost anywhere from .50 cents each, or between $5-$15 per sq/ft. Brick Pavers estimated cost of installation is around $10-$20 per sq/ft. The maintenance costs are not too high, for you really only need to wash and seal your pavers every year or so. The price ranged from $5 to about $20 per sq/ft, depending on the design and patterns you select for your project. The reason for the low price is that concrete is much faster to install than say, Natural Stone Pavers. Natural Stone Pavers will definitely have a higher initial cost. They are not manufactured; they are naturally formed and quarried stone, cut to size. On average you may pay $10-$30 per sq/ft for installation, depending on the type of stone you choose, the rarer the stone the more expensive"}, {"url": "http://wisercosts.com/toronto-57268-install-interlocking-pavers-costs", "passage_text": "1 Direct labor costs to Install Interlocking Pavers in Toronto-between $837.98 and $894.14. 2  Cost of all materials and supplies which may be necessary for Interlocking Paver Installation, which may include: - between $63.65 and $68.93. 1 Non-discounted retail costs for 215 square feet of Interlocking Paver Installation-between $767.29 and $866.95. 2  Direct labor costs to Install Interlocking Pavers in Toronto-between $837.98 and $894.14."}, {"url": "https://trustedpros.ca/forum/home-improvements/average-sq-price-of-stamped-concrete-vs-patio-pavers", "passage_text": "Hi Sandy. The average cost of stamp concrete, prep, form and pour is also by the sq ft. In Toronto, our average is about 15 sq ft + if any steps involved. For pavers, we start at $10.00 per sq ft and up depending on the stone. I am a not a fan of pavers at all, as it is a much more costly product (only in the long run) from sinking, shifting, airborn weeds and such. A good quality paver can be as much as 5.00/square foot and the cost of installation can range anywhere from 3.50-8.00 depending on what is involved such as walkway driveway, patio. Concrete is priced by the yard the cost is generally 120.00 per yard and labor costs vary depending on how good the finisher is."}, {"url": "http://www.tiletechpavers.com/cost-of-concrete-pavers", "passage_text": "Brick Pavers can cost anywhere from .50 cents each, or between $5-$15 per sq/ft. Brick Pavers estimated cost of installation is around $10-$20 per sq/ft. The price ranged from $5 to about $20 per sq/ft, depending on the design and patterns you select for your project. The reason for the low price is that concrete is much faster to install than say, Natural Stone Pavers. Natural Stone Pavers will definitely have a higher initial cost. They are not manufactured; they are naturally formed and quarried stone, cut to size. On average you may pay $10-$30 per sq/ft for installation, depending on the type of stone you choose, the rarer the stone the more expensive"}, {"url": "http://homewyse.com/services/cost_to_install_interlocking_pavers.html", "passage_text": "Our free calculator uses recent, trusted data to estimate costs for your Interlocking Paver Installation project. For a basic 120 square feet project in zip code 47474, the benchmark cost to Install Interlocking Pavers ranges between $9.90 - $13.75 per square foot* . To estimate costs for your project: 1."}]