[{"url": "https://finaid.wisc.edu/213.htm", "passage_text": "Each loan has a six month grace period after the student graduates, withdraws, or is enrolled less than half-time. Loan Fees. Direct Subsidized and Unsubsidized loans that are disbursement on or after October 1, 2014 will have a 1.073% origination fee taken out of the loan funds before disbursement. Loans that are disbursement on or after October 1, 2015 will have a 1.068% origination fee taken out of the loan funds before disbursement. Interest Rates. Currently, the interest rate for Undergraduates (subsidized and unsubsidized loans) is fixed at 4.29%. Effective July 1, 2013, first-time* Direct Loan borrowers are limited in the amount of time they can receive Direct Subsidized Loans. Borrowers may receive Direct Subsidized Loans for no more than 150% of the length of the student’s current academic program (ex. 6 years for a 4-year program)."}, {"url": "http://mhrd.gov.in/sites/upload_files/mhrd/files/upload_document/IBAM.pdf", "passage_text": "------ --- - - ------ AGREEMENT (To be stamped as an Agreement) (Between the Student and the Branch of the Bank) This Agreement for availing of interest subsidy under the Central Sector Scheme of Interest Subsidy on Student's Loan for Professional Education in India made at on this day of in the year-. Format of Letter to be obtained from other Banks Ref: 2008 The General Manager Canara Bank HO: Bangalore Dear Sir, Sub: Central Sector Scheme of Interest Subsidy on Students' Loan for Professional Education in lndia by the Ministry of Human Resources, Government of lndia. '.."}, {"url": "https://www.edvisors.com/college-loans/federal/stafford/subsidized/", "passage_text": "This interest subsidy effectively gives the loan a zero percent interest rate during the in-school and other deferment periods. In contrast, the government does not pay the interest on unsubsidized Federal Stafford loans. (A comparison of subsidized and unsubsidized Federal Stafford Loans discusses other differences between subsidized and unsubsidized Federal Stafford loans.)."}, {"url": "https://www.edvisors.com/ask/faq/subsidized-vs-unsubsidized/", "passage_text": "The main difference between subsidized loans and unsubsidized loans is that the federal government pays the interest on subsidized loans during periods of authorized deferment, such as the in-school and economic hardship deferments, while the interest remains the responsibility of the borrower on an unsubsidized loan. With unsubsidized loans, the interest is capitalized (added to the loan balance) if unpaid by the borrower as it accrues. This is in contrast with a forbearance, where the interest is the responsibility of the borrower on both subsidized and unsubsidized loans. Find Private Student Loans for your School:"}, {"url": "http://www.bankofindia.com/UserFiles/File/SubsidyEDU.pdf", "passage_text": "INTEREST SUBSIDY FOR EDUCATIONAL LOANS An Initiative to help students from Economically Weaker Sections Government of Indi desire that nobody is denied professional education because he/she is poor. Indian Banks’ Association (IBA) has formulated a comprehensive model educational loan scheme for adoption by all Banks. In order to support students from Economically Weaker Sections of the Society, Department of Education, Ministry of Human Resource Development, Government of India, has launched this interest subsidy scheme."}, {"url": "https://finaid.wisc.edu/213.htm", "passage_text": "The Direct Subsidized and Unsubsidized loans are fixed interest rate loans with the same repayment programs and include options for deferment and forbearance, albeit the interest on the loans can be treated differently during in-school and grace periods. Effective July 1, 2013, first-time* Direct Loan borrowers are limited in the amount of time they can receive Direct Subsidized Loans. Borrowers may receive Direct Subsidized Loans for no more than 150% of the length of the student’s current academic program (ex. 6 years for a 4-year program)."}, {"url": "https://www.drew.edu/financialassistance/loans/direct-subsidized-and-direct-unsubsidized-loans", "passage_text": "The Federal Government pays the interest for Direct Subsidized Loans while the student is in college or while the loan is in deferment. Interest begins accruing for Direct Unsubsidized Loans as soon as the loan is taken out. For subsidized loans, the maximum is $3,500 for freshmen, $4,500 for sophomores, and $5,500 for juniors and seniors. Undergraduates who are not eligible for Direct Subsidized Loans may borrow an identical amount in a Direct Unsubsidized Loan"}, {"url": "https://financialaid.uc.edu/loans/interestrates.html", "passage_text": "Now loan interest rates will be based on the 10-year Treasury bill each June 1 plus an added percentage – an added 2.05% for undergraduate Federal Direct Subsidized and Unsubsidized Loans and an added 3.6% for graduate Federal Direct Unsubsidized Loans. Subsidized means that the government is subsidizing (paying) the interest while the student is enrolled and often when in a grace period 2. They are not interest-free loans but are not accumulating interest during defined periods. Unsubsidized loans are collecting interest from the point of disbursement."}, {"url": "https://financialaid.uc.edu/loans/interestrates.html", "passage_text": "Federal Direct Loans 1 are student loans with their interest rate set by federal law and regulations. Student loans come in both subsidized and unsubsidized versions. Subsidized means that the government is subsidizing (paying) the interest while the student is enrolled and often when in a grace period 2. They are not interest-free loans but are not accumulating interest during defined periods. Unsubsidized loans are collecting interest from the point of disbursement."}]