[{"url": "http://www.catster.com/answers/question/do_cats_breed_with_there_own_siblings_ie_mother_sister-3531", "passage_text": "The kittens,however will be born with alot of problems becouse their parents have the same blood. It would be like you having a baby with your brother/sister. Thats becouse cats have Pheremones. Pheremones are chemicals given off by your body that can attract or repulse a potential mate. Member 494894 answered on 1/12/08."}, {"url": "https://in.answers.yahoo.com/question/index?qid=20090629105327AA67UCs", "passage_text": "Yes cats can and will mate with siblings-they don't make choices about their reproduction like humans do, there's only hormones and instinct. Any kittens produced from a brother/sister pairing will be at greatly elevated risk for genetic deformities and diseases. Get the cats fixed and avoid the problem altogether."}, {"url": "http://www.answers.com/Q/Is_it_possible_for_sibling_cats_to_mate", "passage_text": "Cats, when sexually mature, will mate with the first available cat, even if they are related. Unlike humans, cats, dogs and other animals are not bound by social taboos o … r realise that breeding with family members can result in birth defects and deformities."}, {"url": "http://www.askthecatdoctor.com/can-male-cats-mate-with-already-pregnant-cats.html", "passage_text": "Theoretically, a female cat can remain in heat for up to 21 days. She can mate with more than one male during that period of time and can have a litter of kittens which contains kittens from one male AND kittens from the other male."}, {"url": "http://www.careyscats.com/qa/do-brother-and-sister-cats-mate/", "passage_text": "Female cats in heat would be receptive to the attention of any male cat. In a multi-cat household where the cats are not allowed t go out, the cats would look no further for a potential sexual mate. The cats would mate with the other pet cats."}, {"url": "http://www.answers.com/Q/Is_it_possible_for_sibling_cats_to_mate", "passage_text": "Furthermore, when a male cat becomes sexually mature, he will also try to mate with his mother, if she is around. Unlike humans -- well, most humans, anyway -- cats (and dogs) do not recognize that having sex with members of your family is a major no-no."}, {"url": "http://www.answers.com/Q/Is_it_possible_for_sibling_cats_to_mate", "passage_text": "Yes, sexually mature sibling cats can and will mate with each other, if you let them. Letting them mate with each other is, of course, a very, very bad idea, as inbreeding among any species causes numerous birth defects and deformities."}]