[{"url": "http://main.oregonstate.edu/about", "passage_text": "Founded in 1868, Oregon State is the state’s Land Grant university and is one of only two universities in the U.S. to have Sea Grant, Space Grant and Sun Grant designations. "}, {"url": "http://uoregon.edu/our-history", "passage_text": "That funding increased to $47,500 by 1901. On two occasions, in 1913 and again in 1932, efforts to combine the UO with what is now Oregon State University in Corvallis were thwarted—no doubt to the relief of Ducks and Beavers alike. That university is us. Oregon’s pioneers were more concerned with eking out a living than in the refinements of higher education. But in the early 1870s, Judge Joshua Walton convinced residents of Eugene City to become home to what would become the fledgling state’s flagship university."}, {"url": "http://www.vonkleinrentals.com/did-you-know-12-interesting-facts-about-eugene-oregon/", "passage_text": "2. The University of Oregon, founded in 1876, is one of the oldest universities on the West Coast…. 3. Eugene is the only U.S. city to host three consecutive U.S. Olympic Team Trials – Track & Field (1972, 1976, 1980). It’s also home of the 2008 and 2012 U.S. Olympic Team Trials – Track & Field"}, {"url": "https://en.wikipedia.org/wiki/Oregon_University", "passage_text": "The University of Oregon Forensics program was founded in 1876, at the same time as the university. Initially the program consisted of two student-formed forensic societies, which developed into doughnut league inter-dorm competitions in the 1890s. The institution's campus is 295 acres in size and is situated along the Willamette River. Since July 2014, UO has been governed by the Board of Trustees of the University of Oregon. The university is classified as having very high research activity and has 19 research centers and institutes."}, {"url": "https://en.wikipedia.org/wiki/Oregon_University", "passage_text": "The University of Oregon (also referred to as UO or Oregon) is a public flagship research university located in Eugene, Oregon. UO was founded in 1876. The institution's campus is 295 acres in size and is situated along the Willamette River. Since July 2014, UO has been governed by the Board of Trustees of the University of Oregon. The university is classified as having very high research activity and has 19 research centers and institutes."}, {"url": "https://en.wikipedia.org/wiki/Oregon_State_University", "passage_text": "OSU was one of the early members of the federal Space Grant program. Designated in 1991, the additional grant program made Oregon State one of only 13 schools in the United States to serve as a combined Land Grant, Sea Grant and Space Grant university. The Carnegie Foundation classifies Oregon State University as a research university, with very high research activity and designates it a 'Community Engagement' university. OSU is one of 73 land-grant universities in the United States."}, {"url": "http://study.com/directory/school/University_of_Oregon.html", "passage_text": "The University of Oregon (UO) is a 4-year, public university located in Eugene. Established in 1872, the university's first graduating class consisted of only 5 students. In fall 2011, the University of Oregon was home to more than 24,000 students. UO contains several off-campus locations and associated institutes. Originating as a base for UO's marine biology program in the mid-1920's, the Oregon Institute of Marine Biology (OIMB), located along the coast in Charleston, Oregon, offers students a year-round marine research facility. Also located at OIMB is the Loyd and Dorothy Rippey Library"}, {"url": "http://www.wou.edu/wou/history2.html", "passage_text": "The institution was founded as Monmouth University by early pioneers on Jan. 18, 1856, only seven years after the Territorial Government of Oregon was organized in 1849. Western Oregon University 1997. Recognizing WOU's size and the quality of its academic programs, staff, faculty and students, Governor John Kitzhaber signed a bill changing the name of Western Oregon State College to Western Oregon University. Enrollment reached a record high of 4,088."}, {"url": "http://colleges.usnews.rankingsandreviews.com/best-colleges/university-of-oregon-3223", "passage_text": "Summary. University of Oregon is a public institution that was founded in 1876. It has a total undergraduate enrollment of 20,559, its setting is urban, and the campus size is 295 acres. It utilizes a quarter-based academic calendar. University of Oregon's ranking in the 2016 edition of Best Colleges is National Universities, 103. Its in-state tuition and fees are $9,918 (2014-15); out-of-state tuition and fees are $30,888 (2014-15)"}]