[{"url": "http://www.food.com/recipe/tzimmes-a-sweet-savory-jewish-stew-190417", "passage_text": "4 5. I'm NOT a tzimmes person...but for a tzimmes, this was really great. I used figs and apricots (dried) instead of prunes (personal tastes of the family) and a bit more apple and sweet potato since I was out of regular potatoes. Also added a splash of cumin and some clove and maybe some nutmeg. Was good. "}, {"url": "http://toriavey.com/toris-kitchen/2011/09/stovetop-tzimmes/", "passage_text": "Tzimmes is a traditional Ashkenazi Jewish stew made with sweet root vegetables– carrots, sweet potatoes, yams– and dried fruits like raisins or dried plums. The word tzimmes is also a Yiddish expression for “making a fuss” over something. Not surprisingly, tzimmes is a bit of a fussy dish… with all of those root veggies, there is lots of peeling, chopping, then more peeling and more chopping. The side dish is often served for Rosh Hashanah, where sweet foods are served to signify our hope for a sweet new year."}, {"url": "http://www.jewishfoods.org/tzimmes.html", "passage_text": "|. Jewish and Israeli Foods. Tzimmes or tsimmes is a traditional Jewish casserole. It is a sweet dish, a combination of fruit, meat, and vegetables cooked slowly over very low heat, flavored with honey and sometimes cinnamon. There are endless varieties on the theme. Recipes: Tzimmes Tzimmes can be found in every good new year's meal (see Rosh Hashanah)."}, {"url": "http://www.food.com/recipe/sweet-potato-tzimmes-326999", "passage_text": "Cook. Tzimmes is one of those Yiddish words that loses something in translation. It is probably best defined as confusion or a mishmash...which is probably where this casserole gets its name. This recipe can be made 2 days in advance; cover and refrigerate until ready to bake. "}, {"url": "http://www.merriam-webster.com/dictionary/tzimmes", "passage_text": "Tweet. : a sweetened combination of vegetables (as carrots and potatoes) or of meat and vegetables often with dried fruits (as prunes) that is stewed or baked in a casserole. "}, {"url": "http://toriavey.com/toris-kitchen/2011/09/stovetop-tzimmes/", "passage_text": "1 Place cut yams, sweet potatoes, and carrots on the bottom of a large heavy pot. 2  Pour dried apples and cranberries on top. 3  In a medium bowl, whisk together orange juice, honey, brown sugar, cinnamon, salt, and black pepper. 4  Pour mixture over the fruits and vegetables in the pot. Not surprisingly, tzimmes is a bit of a fussy dish… with all of those root veggies, there is lots of peeling, chopping, then more peeling and more chopping. The side dish is often served for Rosh Hashanah, where sweet foods are served to signify our hope for a sweet new year."}, {"url": "http://www.tasteofhome.com/recipes/tzimmes", "passage_text": "1 In a greased 13-in. 2  x 9-in. 3  baking dish, combine the sweet potatoes, carrots and plums. 4  Combine the orange juice, water, honey, brown sugar and cinnamon; pour over vegetables. 5  Cover and bake at 350° for 1 hour. 6  Uncover; dot with butter. 1 x 9-in. 2  baking dish, combine the sweet potatoes, carrots and plums. 3  Combine the orange juice, water, honey, brown sugar and cinnamon; pour over vegetables. 4  Cover and bake at 350° for 1 hour."}, {"url": "https://en.wikipedia.org/wiki/Tzimmes", "passage_text": "Tzimmes, tsimmes, and other spelling variants (Yiddish: צימעס ‎) is a traditional Ashkenazi Jewish sweet stew typically made from carrots and dried fruits such as prunes or raisins, often combined with other root vegetables. "}, {"url": "http://www.thefreedictionary.com/tzimmes", "passage_text": "The book itself is a political statement, a deliberate intermingling of recipes of Arab origin--such as fattoush salad and 7114adra, a dish of lentils, onions and spices--and dishes of Jewish lineage: an egg-and-fava-bean concoction from Iranian Jews and roasted potatoes with caramel and prunes based on the classic. "}]