[{"url": "http://www.audubon.org/field-guide/bird/wood-thrush", "passage_text": "Numbers have declined seriously in recent decades. Cowbirds lay many eggs in their nests, so the thrushes often raise mainly cowbirds, with few young of their own. As forests are cut into smaller fragments, it apparently becomes easier for cowbirds to penetrate these small woodlots and find more of the thrush nests. "}, {"url": "https://en.wikipedia.org/wiki/Wood_thrush", "passage_text": "The wood thrush (Hylocichla mustelina) is a North American passerine bird. It is closely related to other thrushes such as the American robin and is widely distributed across North America, wintering in Central America and southern Mexico. The wood thrush is the official bird of the District of Columbia."}, {"url": "http://www.earthlife.net/birds/nests.html", "passage_text": "Perhaps the strangest nests of all are those built by the species of Swiftlet in the genus Collocalia. They nest in caves and build their nests of saliva. To do this they have enlarged salivary glands during the breeding season. To make them even more amazing, these Swiflets often nest in pitch dark caves. Australasian Bowerbirds are not the only birds to build structures that are not ever destined to be nests. Others include the Tooth-billed Cat Bird (Scenopoeetes dentirostris), also from Australia, and Jackson's Whydah (Euplectes jacksoni) from Kenya and Tanzania."}, {"url": "http://www.answers.com/Q/What_kind_of_places_do_adult_song_thrushes_make_their_nests", "passage_text": "Barn owls do not build nests as such. They use sheltered places under cover: originally rock crevices or better still holes in trees (a wooden base to the breeding site is pre … ferred), but old farm buildings are often ideal, hence their name. Few birds make better use of the structures provided to them for nesting sites than the osprey. Its nest is so large that it requires a sturdy site, so the bird will construct … nests on telephone poles and platforms along coasts and lakes. The osprey's nest is comprised of vines, sticks, sod and other materials."}, {"url": "https://uk.answers.yahoo.com/question/index?qid=20080201134107AAQQg96", "passage_text": "Rating Newest Oldest. Best Answer: Yes, Cuckoos, cowbirds and owls do not build their own nests. Cuckoos and cowbirds lay their eggs in other birds nests. Some duck species will do this as well, but they will also have their own nest in addition. Owls just take over the nest of another bird, usually a hawk, but they tend to their own young"}, {"url": "http://www.rspb.org.uk/discoverandenjoynature/discoverandlearn/funfactsandarticles/features/homesweethome.aspx", "passage_text": "1 House martins, song thrushes and blackbirds use mud in the construction of their nests. 2  A small, wet, muddy patch in your garden, such as a muddy puddle or edge of a pond, may make it easier for them to build a nest, particularly if it has been dry and there are no other nearby sources. Studies have shown long-tailed tits can use up to 2,000 feathers in each nest and in their effort to collect all the various materials, they will fly between 600-700 miles! Spiders’ webs are an essential part of the design of these hanging nests and this just goes to show how closely linked birds and spiders are."}, {"url": "http://www.rspb.org.uk/discoverandenjoynature/discoverandlearn/funfactsandarticles/features/homesweethome.aspx", "passage_text": "Long-tailed tits make the most intricate and delicate of all bird’s nests – and they couldn’t do it without spiders. They spend three weeks creating their pouch-shaped luxury home. This begins with a cup and dome made of moss and stuck together with cobwebs, making it elastic. Studies have shown long-tailed tits can use up to 2,000 feathers in each nest and in their effort to collect all the various materials, they will fly between 600-700 miles! Spiders’ webs are an essential part of the design of these hanging nests and this just goes to show how closely linked birds and spiders are."}, {"url": "http://www.earthlife.net/birds/nests.html", "passage_text": "Quite a few birds do not build any nest at all, though they do make a choice of where to lay. Beyond this is a simple scrape in the ground. Nightjars (Caprimulgidae) do not make even a scrape. They lay their two eggs directly onto the ground. While Short-eared Owls, Asio flammeus, lay simply on some trampled vegetation. Australasian Bowerbirds are not the only birds to build structures that are not ever destined to be nests. Others include the Tooth-billed Cat Bird (Scenopoeetes dentirostris), also from Australia, and Jackson's Whydah (Euplectes jacksoni) from Kenya and Tanzania."}, {"url": "http://www.answers.com/Q/What_kind_of_places_do_adult_song_thrushes_make_their_nests", "passage_text": "The Song Thrush typically nests in forest with good undergrowth and nearby more open areas, and in western Europe also uses gardens and parks. It breeds up to the tree-line, reaching 2,200 metres (7,250 ft) inSwitzerland. Few birds make better use of the structures provided to them for nesting sites than the osprey. Its nest is so large that it requires a sturdy site, so the bird will construct … nests on telephone poles and platforms along coasts and lakes. The osprey's nest is comprised of vines, sticks, sod and other materials."}]