[{"url": "http://www.foodnetwork.com/recipes/stuffed-crab-recipe.html", "passage_text": "Directions. In a skillet over low heat melt the butter, add the onion, yellow pepper, fennel, and garlic. Season with salt and pepper. Cook slowly for about 6 minutes until all are tender, transfer mixture to a bowl, add bread crumbs, and allow to cool. Preheat oven to 375 degrees F. When cooled add crab meat, mayonnaise, lemon zest, lemon juice, tarragon, parsley, scallions, and season with salt and pepper, to taste. Mix the ingredients well and stuff the shells. Bake for 25 minutes until warmed through."}, {"url": "http://www.alwaysfreshfish.com/frozen_stuffed_crabs.html", "passage_text": "Preheat oven to 400 F. Place Stuffed Crabs on a baking sheet with a small amount of water in the pan. Brush the Stuffed Crab with a little butter or margarine and bake for 30-35 minutes until done. You can also place a slice of Monterey Jack cheese on top and sprinkle a little parsley and or paprika on top if desired."}, {"url": "http://www.primalpalate.com/paleo-recipe/crab-stuffed-salmon/", "passage_text": "1 Preheat oven to bake at 400°F. 2  In a small bowl, season crab meat with minced garlic, parsley, the juice of half of a lemon, salt, and pepper. 3  Slice salmon filet lengthwise down the center to create a space for stuffing. 4  Stuff salmon with seasoned crab meat, using about 1/4 cup of crab per salmon filet."}, {"url": "http://www.captnchuckysnewtownsquare.com/cooking-tips/", "passage_text": "*BAKE – Preheat oven to 400 degrees, place crab cake on a baking sheet or in a baking pan, place in a small amount of butter. Bake about 15 minutes.. *BROIL – Bake as above, then broil a minute or two until crispy and browned."}, {"url": "http://www.deepsouthdish.com/2009/06/stuffed-crab.html", "passage_text": "Add the crab, mix gently and put into the crab shells or shape into 8 patties. Sprinkle with a small bit of bread crumbs, if desired. Bake at 400 degrees F for 20 to 30 minutes, checking at 20 minutes, or until the stuffing sizzles and the tops begin to brown."}, {"url": "http://www.ehow.com/how_8190210_cook-frozen-prestuffed-crab.html", "passage_text": "Cook the frozen stuffed crab for 45 minutes or until it has a minimum internal temperature of 165 degrees F. The U.S. Department of Agriculture recommends cooking frozen and stuffed proteins to a minimum internal temperature of 165 degrees F, as the filling can introduce bacteria not eliminated at lower temperatures."}]