[{"url": "https://en.wikipedia.org/wiki/Earth_worm", "passage_text": "An earthworm is a tube-shaped, segmented worm found in the phylum Annelida. They are commonly found living in soil, feeding on live and dead organic matter. 1 Chemical: In addition to dead organic matter, the earthworm also ingests any other soil particles that are small enough—including sand grains up to 1/20 of an inch (1.25 mm)—into its gizzard, wherein those minute fragments of grit grind everything into a fine paste which is then digested in the intestine."}, {"url": "http://animals.mom.me/seven-organ-systems-earthworm-2843.html", "passage_text": "Excretory System. Part of an earthworm's excretory system is directly connected to his digestive system, as the intestines pass waste through the anus and out of the worm. This poop is called castings, and it serves as a type of plant fertilizer. However, some of the waste is picked up by excretory cells and carried outward to the skin. "}, {"url": "https://en.wikipedia.org/wiki/Earth_worm", "passage_text": "The gut of the earthworm is a straight tube which extends from the worm's mouth to its anus. It is differentiated into a buccal cavity (generally running through the first one or two segments of the earthworm), pharynx (running generally about four segments in length), esophagus, crop, gizzard (usually) and intestine. 1 Chemical: In addition to dead organic matter, the earthworm also ingests any other soil particles that are small enough—including sand grains up to 1/20 of an inch (1.25 mm)—into its gizzard, wherein those minute fragments of grit grind everything into a fine paste which is then digested in the"}, {"url": "http://www.answers.com/Q/Is_a_worm_a_mammal", "passage_text": "A mammal is an endothermic vertebrate with a four-chambered heart,  and at least some hair, fur or bristles. A Mammal is normally  defined as a warm-blooded animal with a co … vering of skin and hair  which gives birth to live young who are nourished with milk  produced by the mother's mammary glands. If you meant computer worm then, computer worm is a standalone malware computer program that replicates itself in order to spread to other computers. otherwise the word worm i … s used to describe many different distantly related animals that typically have a long cylindrical tube-like body and no legs."}, {"url": "http://www.answers.com/Q/Is_a_worm_a_mammal", "passage_text": "Some mammals even live in the sea such as dolphins, seals and whales. One group of mammals, the bats, can fly. er mammals, to a certain extent, and birds. However warm blood is not really the question, many reptiles have blood far warmer than ours, but only on hot days. If you meant computer worm then, computer worm is a standalone malware computer program that replicates itself in order to spread to other computers. otherwise the word worm i … s used to describe many different distantly related animals that typically have a long cylindrical tube-like body and no legs."}, {"url": "http://eol.org/info/448", "passage_text": "Tropical rainforest, polar ocean, the digestive tract of an insect or a mammal—they’re all worm habitats. Worms also observe an array of different feeding strategies. Parasites, predators, grazers, detritivores, filter-feeders— there are worms enjoying every menu in nature. Of the thirty-odd phyla in the animal kingdom, at least a third are generally referred to as worms. If you include the more exotic, lesser-known phyla described as “worm-like,” it’s well over half. So, evolutionarily speaking, it might be easier to narrow down what’s not a worm."}, {"url": "https://answers.yahoo.com/question/index?qid=20080417072606AAK9gpO", "passage_text": "Relevance. Rating Newest Oldest. Best Answer: No. An earthworm is not a mammal, because it is not warm blooded, does not have fur and does not give milk. Rather it is an invertebrate (animal without a backbone) and is of the annelida group. Source(s): See web search"}, {"url": "http://www.answers.com/Q/Is_a_worm_a_mammal", "passage_text": "A mammal is an animal that has mammary glands, or breasts with which to feed their babies. {Duck-billed platypuses have mammary glands, but they don't have breasts. The milk for their babies seeps through the mothers fur}. If you meant computer worm then, computer worm is a standalone malware computer program that replicates itself in order to spread to other computers. otherwise the word worm i … s used to describe many different distantly related animals that typically have a long cylindrical tube-like body and no legs."}]