[{"url": "https://en.wikipedia.org/wiki/Marchantiophyta", "passage_text": "Not to be confused with the genus of flowering plants, Hepatica, that may also be called liverwort. The Marchantiophyta /mɑrˌkaentiˈɒfɨtə/ mɑrˌkæntiˈɒfɨtə are a division of-non vascular bryophyte land plants commonly referred to as hepatics or. liverworts Today, liverworts can be found in many ecosystems across the planet except the sea and excessively dry environments, or those exposed to high levels of direct solar radiation. As with most groups of living plants, they are most common (both in numbers and species) in moist tropical areas."}, {"url": "http://www.answers.com/Q/What_is_the_scientific_name_for_liverworts", "passage_text": "Yes, there are approximately 6000 Latin names for liverworts, that being the number of actual known species. The good news, however, is that they are at least all members of t … he phylum Marchantiophyta. These are the true liverworts that are sometimes confused as mosses. A scientific name is the base name. A creature or item may have numerous common names depending on locality, but the scientific name will remain the same no matter where.It is … also called the genus-species name. 25 people found this useful. Answered."}, {"url": "https://en.wikipedia.org/wiki/Marchantiophyta", "passage_text": "Liverworts have a gametophyte-dominant life cycle, with the sporophyte dependent on the gametophyte. Cells in a typical liverwort plant each contain only a single set of genetic information, so the plant's cells are haploid for the majority of its life cycle. Today, liverworts can be found in many ecosystems across the planet except the sea and excessively dry environments, or those exposed to high levels of direct solar radiation. As with most groups of living plants, they are most common (both in numbers and species) in moist tropical areas."}, {"url": "https://en.wikipedia.org/wiki/Marchantiophyta", "passage_text": "Liverwort species may be either dioicous or monoicous. In dioicous liverworts, female and male sex organs are borne on different and separate gametophyte plants. In monoicous liverworts, the two kinds of reproductive structures are borne on different branches of the same plant. Today, liverworts can be found in many ecosystems across the planet except the sea and excessively dry environments, or those exposed to high levels of direct solar radiation. As with most groups of living plants, they are most common (both in numbers and species) in moist tropical areas."}, {"url": "https://en.wikipedia.org/wiki/Marchantia_polymorpha", "passage_text": "Marchantia polymorpha, sometimes known as the common liverwort or umbrella liverwort, is a large liverwort with a wide distribution around the world. It is variable in appearance and has several subspecies. It is a thallose liverwort which forms a rosette of flattened thalli with forked branches. The thalli grow up to 10 cm long with a width of up to 2 cm. It is usually green in colour but older plants can become brown or purplish. The upper surface has a pattern of hexagonal marking"}, {"url": "http://www.answers.com/Q/Scientific_name_for_common_liverwort", "passage_text": "'Asclepias syriaca' is the scientific, Latin or binomial name for 'common milkweed'. Other common names include 'Butterfly flower', 'Silkweed', 'Silky Swallow-wort', and 'Vir … ginia Silkweed'. But whether the scientific or common names are used, the wildflower is colorfully attractive to Monarch butterflies [Danaus plexippus], distasteful to wildlife, and popular and unpopular with environmentalists. The common name is what everyone calls it. For example, Siberian tiger or little blue penguin. The scientific name, or binomial name, is the name given to an organism by its … phylogeny."}, {"url": "http://tundrabiome8j.weebly.com/liverwort.html", "passage_text": "General Information on Liverworts. The Marchantiophyta is a category of bryophyte plants which are commonly known as hepatics or liverworts. Each of its cells carry a single group of genetic information ready for the reproduction. There are approximately 6000 – 8000 species of liverwort in total, however, scientists believe that once they take further research into the Neo-tropical regions (Mexican plateau including Central and South America and the West Indies), the number of liverwort species will increase to 10,000."}, {"url": "https://en.wikipedia.org/wiki/Marchantiophyta", "passage_text": "It is estimated that there are about 9000 species of liverworts. Some of the more familiar species grow as a flattened leafless thallus, but most species are leafy with a form very much like a flattened moss. Today, liverworts can be found in many ecosystems across the planet except the sea and excessively dry environments, or those exposed to high levels of direct solar radiation. As with most groups of living plants, they are most common (both in numbers and species) in moist tropical areas."}, {"url": "https://en.wikipedia.org/wiki/Marchantia_polymorpha", "passage_text": "Description [edit]. It is a thallose liverwort which forms a rosette of flattened thalli with forked branches. The thalli grow up to 10 cm long with a width of up to 2 cm. It is usually green in colour but older plants can become brown or purplish. The upper surface has a pattern of hexagonal markings"}]