[{"url": "http://www.homeadvisor.com/cost/architects-and-engineers/hire-an-engineer/", "passage_text": "Find out how much your project will cost. Provide a few details about your project and receive competitive quotes from local pros. A structural engineer has expertise and training in areas concerning the structural soundness of your home. You would hire one to both advise and plan a home or addition. A structural engineer is also the professional to call when your existing home has issues like foundation problems, sagging roofs or sliding chimneys. They help figure out ways to reconstruct those areas safely"}, {"url": "http://www.homeimprovementpages.com.au/article/how_much_do_structural_engineers_cost", "passage_text": "Most residential consultations are for routine jobs. A short consultancy fee might cost as little as $200 to $400 if no further research is needed. If council requires a structural engineer's drawings and report, it can cost between $3,000 and $5,000 or even more. The structural engineer's job is to provide the technical knowledge to ensure a weight bearing structure is capable of handling the load placed on it. A structural engineer's hourly rate starts at around $100 per hour but can go up to $250 an hour for fully qualified professional service on a complex project."}, {"url": "http://www.trulia.com/voices/Home_Buying/How_much_does_a_structual_engineer_cost_and_is_it_-53418", "passage_text": "Sue Archer, Agent, Orangevale, CA. The cost will be dependent on what type of service you need from the structural engineer. At one property, the seller had violated the truss when installing a whole house fan. The engineer needed to provide a report on how to remediate that ($400). A second structural engineer accepted an up front walk through of $480. I paid. He made a non contractual agreement for a redesign with truss to roof completion at 40% the cost of the first estimate."}, {"url": "http://bedrockfoundation.com/foundation-engineers-report-dallas-tx.html", "passage_text": "Also, remember that the standard engineer’s report is a substructure evaluation, not the superstructure. The superstructure is the area above the floor, such as in the attic and the walls, and the substructure will usually include the floor and the structure below it. However, if the engineer notices a problem in the superstructure, it may be included in his engineer’s report. Superstructure evaluations can be performed for an additional price. The engineer will be required to enter the attic area, and an inspection of the structure from there will commence."}, {"url": "https://answers.yahoo.com/question/index?qid=20100211070834AAUR8b3", "passage_text": "Report Abuse. The amount of destruction has a lot to do with how long it takes someone to make an inspection. As to cost, I would expect an engineer to charge between $100 and $200 an hour to do the inspection and write a report. Any professional engineer should give you a set of rates for their services and an estimate of the time involved. The insurance company had a structural engineer come out and look (he literally spent 15-20 minutes there and has given them a... show more We had a house fire and both town building inspectors (original and his temp replacement) recommend that the house be condemned, torn down and rebuilt due to safety and code issues."}, {"url": "http://hdfoundationrepair.com/engineers-report-foundation-repair/", "passage_text": "The average cost of an engineer’s report before foundation repair is $400 in the Dallas, Fort Worth, Texas area, and the foundation report will be helpful. Estimated Fees For Fixing A Foundation: To obtain an engineer’s report for foundation work, simply call a good contractor and discuss foundation repair costs and the estimated charges associated with having it in the Dallas, Fort Worth area. Average costs can range from $1,800 to $10,000 or more."}, {"url": "http://www.fixr.com/costs/structural-engineer", "passage_text": "For example, a building is designed by an engineering consulting firm, and receives $237,000 for their work. It is reasonable to anticipate that the structural engineer would then receive roughly $18,960. This is because the work performed by any structural engineer is going to ensure the stability of a building. For example, load-bearing walls, foundations, and even design approval will all land on the desk of the modern structural engineer."}, {"url": "http://www.fixr.com/costs/structural-engineer", "passage_text": "A decade later that same structural engineer can ask for $30.43 to $42.28, or between thirty and forty-five thousand per year for the same work. Today, according to Eng-Tips.com, a consumer can expect to pay roughly 8% of a total construction project fee to the structural engineer. This is because the work performed by any structural engineer is going to ensure the stability of a building. For example, load-bearing walls, foundations, and even design approval will all land on the desk of the modern"}, {"url": "http://www.newsnow.co.uk/classifieds/jobs/structural-engineers-report-cost.html", "passage_text": "Structural Engineers report Cost in jobs. 1 - 24 of 379 ads. Classifieds related to: Structural Engineers report Cost in jobs. Senior Structural Engineer At Active Recruitment-Greater London Our well-establised client is an award winning independent consulting engineering business with an ambitious growth strategy. They have offices in Newark, London, Leeds and Nottingham"}]