[{"url": "http://www.foodnetwork.com/recipes/alton-brown/the-baked-potato-recipe1.html#!", "passage_text": "Heat oven to 350 degrees and position racks in top and bottom thirds. Wash potato (or potatoes) thoroughly with a stiff brush and cold running water. Dry, then using a standard fork poke 8 to 12 deep holes all over the spud so that moisture can escape during cooking. Place in a bowl and coat lightly with oil. "}, {"url": "http://www.livestrong.com/article/540225-how-to-bake-a-potato-in-tin-foil-in-a-toaster-oven/", "passage_text": "Along with toasting bread, toaster ovens can bake and broil. If you use yours to bake a potato, you can free up your conventional oven for other dishes. Baked potatoes make a satisfying side dish or main course, especially when topped with lean ground beef or reduced-fat cheese. It generally takes about an hour to bake a potato in a toaster oven, depending on the size of the potato. Wrapping it in foil before baking actually steams the potato, trapping in its natural moisture"}, {"url": "http://www.answers.com/Q/How_do_you_cook_sweet_potato_in_a_toaster_oven", "passage_text": "Confidence votes 18. Turn on the oven function of the toaster oven and set the temp to about 375 degrees. Clean the sweet potato and poke some holes in it with a fork so the steam pressure doesn't cause it to explode. Put it in the toaster oven to cook for at least 20 minutes and then check it by poking it to see how soft or firm it is. "}, {"url": "http://www.youtube.com/watch?v=7JahMS0numk", "passage_text": "I make baked potatoes a lot. They are well suited to put in the oven with other foods. Typically a baked potato takes about and hour in any 400 degree oven. I often make a single baked potato in a toaster oven. I use Russet potatoes that you can readily get a ten pound bag for about four dollars. "}, {"url": "http://www.chowhound.com/post/bake-sweet-potato-toaster-oven-731194#!", "passage_text": "This is what I do at home with a toaster oven. Wash your sweet potato. Puncture a couple of holes or slits in it with either a knife or fork (prevents explosions). Preheat your toaster oven to about 350F. Put it in the oven for 20 minutes, then turn it 180 degrees, and bake for another 20 minutes. Your time in the toaster oven will vary depending on the size and thickness of your spud. It's ready when it is fork-tender -- i.e, you can easily stick a fork in the flesh with little resistance. Enjoy!"}, {"url": "https://www.hamiltonbeach.com/baked-potatoes.html", "passage_text": "1 Scrub potatoes and pierce with a fork. 2  Stack rows of potatoes on top of each other, ensuring the potatoes don't touch the sides of the roaster oven. 3  Place cover on roaster oven and bake for 1 hour and 15 minutes or until tender when pierced with a fork. 1 Stack rows of potatoes on top of each other, ensuring the potatoes don't touch the sides of the roaster oven. 2  Place cover on roaster oven and bake for 1 hour and 15 minutes or until tender when pierced with a fork."}, {"url": "http://www.livestrong.com/article/540225-how-to-bake-a-potato-in-tin-foil-in-a-toaster-oven/", "passage_text": "Tips. 1  You can bake multiple potatoes at the same time in a toaster oven, depending on the size of the oven. 2  Add 10 to 15 minutes cooking time when baking four or more potatoes together. Baked potatoes make a satisfying side dish or main course, especially when topped with lean ground beef or reduced-fat cheese. It generally takes about an hour to bake a potato in a toaster oven, depending on the size of the potato."}, {"url": "https://answers.yahoo.com/question/index?qid=20071105180812AASQInG", "passage_text": "Report Abuse. Scrub potato. Poke a few holes in it with a fork (lets the steam out so it doesn't explode). Set oven at 350. Bake for about an hour. (Depends on the size of the potato.) Best way to check a potato is to give it little squeeze(use a potholder or oven mitt). It will feel soft inside, crunchy on the outside."}]