[{"url": "http://web.stanford.edu/group/hopes/cgi-bin/hopes_test/about-glutamate-toxicity/", "passage_text": "About Glutamate Toxicity. By Stephanie Liou 26 Jun, 2011 Glutamate Toxicity. Glutamate is a powerful excitatory neurotransmitter that is released by nerve cells in the brain. It is responsible for sending signals between nerve cells, and under normal conditions it plays an important role in learning and memory. "}, {"url": "https://en.wikipedia.org/wiki/Excitatory_synapse", "passage_text": "The excitatory neurotransmitters, the most common of which is glutamate, then migrate via diffusion to the dendritic spine of the postsynaptic neuron and bind a specific transmembrane receptor protein that triggers the depolarization of that cell. Glutamate is a small, amino acid neurotransmitter, and is the primary excitatory neurotransmitter at almost all synapses in the central nervous system. This molecule binds multiple postsynaptic receptors including the NMDA receptor, AMPA receptor, and kainate receptors."}, {"url": "http://www.minddisorders.com/Kau-Nu/Neurotransmitters.html", "passage_text": "Neurotransmitters can excite or inhibit neurons (nerve cells). Some common neurotransmitters are acetylcholine, norepinephrine, dopamine, serotonin and gamma aminobutyric acid (GABA). Acetylcholine and norepinephrine are excitatory neurotransmitters while dopamine, serotonin, and GABA are inhibitory. Each neurotransmitter can directly or indirectly influence neurons in a specific portion of the brain, thereby affecting behavior. "}, {"url": "http://amino-acid-therapy.com/neurotransmitters/excitatory-neurotransmitters/", "passage_text": "Excitatory Neurotransmitters. The main excitatory neurotransmitters in the body are dopamine, norepinephrine, epinephrine and glutamate. Dopamine plays a number of important functions in the brain. It is very important in the reward system whereby we feel pleasure, achieve heightened arousal and do much of our learning. Glutamate is the most abundant excitatory neurotransmitter in the human brain. It plays key roles in cognitive functions like learning and memory. Imbalances in glutamate levels are associated with Alzheimer’s disease, seizures and forms of autism."}, {"url": "https://en.wikipedia.org/wiki/Excitatory_synapse", "passage_text": "An excitatory synapse is a synapse in which an action potential in a presynaptic neuron increases the probability of an action potential occurring in a postsynaptic cell. Neurons form networks through which nerve impulses travel, each neuron often making numerous connections with other cells. Glutamate is a small, amino acid neurotransmitter, and is the primary excitatory neurotransmitter at almost all synapses in the central nervous system. This molecule binds multiple postsynaptic receptors including the NMDA receptor, AMPA receptor, and kainate receptors."}, {"url": "https://www.neurogistics.com/TheScience/WhatareNeurotransmi09CE.asp", "passage_text": "SEROTONIN is an inhibitory neurotransmitter – which means that it does not stimulate the brain. Adequate amounts of serotonin are necessary for a stable mood and to balance any excessive excitatory (stimulating) neurotransmitter firing in the brain. Excitatory neurotransmitters are not necessarily exciting – they are what stimulate the brain. Those that calm the brain and help create balance are called inhibitory. Inhibitory neurotransmitters balance mood and are easily depleted when the excitatory neurotransmitters are overactive."}, {"url": "https://www.neurogistics.com/TheScience/WhatareNeurotransmi09CE.asp", "passage_text": "NOREPINEPHRINE is an excitatory neurotransmitter that is responsible for stimulatory processes in the body. Norepinephrine helps to make epinephrine as well. This neurotransmitter can cause ANXIETY at elevated excretion levels as well as some “MOOD DAMPENING” effects. Excitatory neurotransmitters are not necessarily exciting – they are what stimulate the brain. Those that calm the brain and help create balance are called inhibitory. Inhibitory neurotransmitters balance mood and are easily depleted when the excitatory neurotransmitters are overactive."}, {"url": "http://antranik.org/actions-of-excitatory-and-inhibitory-neurotransmitters/", "passage_text": "Presynaptic neurons are the neurons that conduct the AP to release a neurotransmitter and they affect the postsynaptic neurons. What ALWAYS causes a neuron to release any neurotransmitter (whether it is excitatory or inhibitory) is an action potential. Contrast that with exitatory NTs: All excitatory neurotransmitters cause an opening of ligand-gated sodium ion channels. The inhibitory NT could also cause an opening up of ligand-gated Chloride I"}, {"url": "https://www.neurogistics.com/TheScience/WhatareNeurotransmi09CE.asp", "passage_text": "There are two kinds of neurotransmitters – INHIBITORY and EXCITATORY. Excitatory neurotransmitters are not necessarily exciting – they are what stimulate the brain. Those that calm the brain and help create balance are called inhibitory. Inhibitory neurotransmitters balance mood and are easily depleted when the excitatory neurotransmitters are overactive."}, {"url": "http://antranik.org/actions-of-excitatory-and-inhibitory-neurotransmitters/", "passage_text": "ALL excitatory neurotransmitters cause an opening of ligand-gated sodium ion channels. As a result, sodium ions flow in and the cell becomes less negative on the inside. When we talk about acetylcholine, it activates ACh receptor sites and ligand gated sodium ion channels open. Contrast that with exitatory NTs: All excitatory neurotransmitters cause an opening of ligand-gated sodium ion channels. The inhibitory NT could also cause an opening up of ligand-gated Chloride I"}]