[{"url": "https://en.wikipedia.org/wiki/Divergence", "passage_text": "In physical terms, the divergence of a three-dimensional vector field is the extent to which the vector field flow behaves like a source or a sink at a given point. It is a local measure of its outgoingness—the extent to which there is more exiting an infinitesimal region of space than entering it. More rigorously, the divergence of a vector field F at a point p is defined as the limit of the net flow of F across the smooth boundary of a three-dimensional region V divided by the volume of V as V shrinks to p. Formally,"}, {"url": "https://www.rp-photonics.com/beam_divergence.html", "passage_text": "The beam divergence of a laser beam is a measure for how fast the beam expands far from the beam waist, i.e., in the so-called far field. A low beam divergence can be important for applications such as pointing or free-space optical communications. Different quantitative definitions are used in the literature: 1  According to the most common definition, the beam divergence is the derivative of the beam radius with respect to the axial position in the far field, i.e., at a distance from the beam waist which is much larger than the Rayleigh length."}, {"url": "https://en.wikipedia.org/wiki/Beam_divergence", "passage_text": "The divergence of a beam can be calculated if one knows the beam diameter at two separate points far from any focus (Di, Df), and the distance (l) between these points. The beam divergence, , is given by. Beam divergence is often used to characterize electromagnetic beams in the optical regime, for cases in which the aperture from which the beam emerges is very large with respect to the wavelength."}, {"url": "http://www.maxwells-equations.com/divergence.php", "passage_text": "Divergence is a specific measure of how fast the vector field is changing in the x, y, and z directions. In this section, I'll give the definition with no math: Divergence at a point (x,y,z) is the measure of the vector flow out of a surface surrounding that point. That is, imagine a vector field represents water flow. Then if the divergence is a positive number, this means water is flowing out of the point (like a water spout-this location is considered a source)"}, {"url": "https://www.rp-photonics.com/beam_divergence.html", "passage_text": "1 According to the most common definition, the beam divergence is the derivative of the beam radius with respect to the axial position in the far field, i.e., at a distance from the beam waist which is much larger than the Rayleigh length. Different quantitative definitions are used in the literature: 1 "}, {"url": "http://economics.ucr.edu/people/ullah/papers/70.pdf", "passage_text": "A concept closely related to the one of distance measures is that of divergence measures based on the idea of information-theoretic entropy first introduced in communication theory by Shannon (1948) and later by Wiener (1949) in Cybernetics. We also note here that a distance measure can always be considered as a divergence measure, however a divergence measure may not satisfy all the conditions of a distance given in (2.1) and thus may not be a distance measure. Such divergence measures will be referred to as pseudo-distance measures."}, {"url": "http://mathinsight.org/divergence_idea", "passage_text": "The divergence of a vector field simply measures how much the flow is expanding at a given point. It does not indicate in which direction the expansion is occuring. Hence (in contrast to the curl of a vector field), the divergence is a scalar. The fact that fluid is flowing out of the sphere is a sign of the positive divergence of the vector field. Rotate with mouse to change perspective. You can move the sphere by dragging it with the mouse."}, {"url": "https://en.wikipedia.org/wiki/Divergence", "passage_text": "In vector calculus, divergence is a vector operator that measures the magnitude of a vector field 's source or sink at a given point, in terms of a signed scalar. More rigorously, the divergence of a vector field F at a point p is defined as the limit of the net flow of F across the smooth boundary of a three-dimensional region V divided by the volume of V as V shrinks to p. Formally,"}, {"url": "https://en.wikipedia.org/wiki/Beam_divergence", "passage_text": "The beam divergence of an electromagnetic beam is an angular measure of the increase in beam diameter or radius with distance from the optical aperture or antenna aperture from which the electromagnetic beam emerges. The term is relevant only in the far field, away from any focus of the beam. Beam divergence is often used to characterize electromagnetic beams in the optical regime, for cases in which the aperture from which the beam emerges is very large with respect to the wavelength."}]