[{"url": "http://www.ehow.com/how_8433702_make-new-tab-open-google.html", "passage_text": "Using the Settings Feature to Customize Your Tabs. The browser settings feature is another way to open new and recently used tabs quickly. Click on the settings icon -- displaying “Customize and control Google Chrome.” From here, you can open a new tab, one or more recently closed tabs or your favorite sites. You can also set your Chrome browser to ignore the “new tabs” page and instead, open with your favorite tabs already loaded. "}, {"url": "http://smallbusiness.chron.com/reset-new-tab-internet-explorer-9-66021.html", "passage_text": "Tip. 1  Set the new tab page to open your homepage by navigating to the desired page in Internet Explorer 9. 2  Click the Tools option at the top of the screen and select Internet Options.. 3  Click the General tab. 4  Select Use current to set your current page as your homepage. 5  Click OK.. By default, the new tab page in Internet Explorer 9 should open a page containing thumbnails for sites you most frequently visit. However, it may have been reset to display a blank or homepage. You can reset the new tab page by changing your option settings in Internet Explorer. Step 1. Ope"}, {"url": "https://www.google.com/homepage/", "passage_text": "Google Search is installed but not set as your default search provider. To default to Google, here’s how you do it: 1  Click the Tools icon at the far right of the browser window. 2  Select Internet options. 3  In the General tab, find the Search section and click Settings. 4  Select Google. 5  Click Set as default and click Close. "}, {"url": "http://productforums.google.com/d/topic/chrome/gZ3TBoJQN6A", "passage_text": "You can configure Chrome with a home page button, (via the Options menu), and if you set clicking the middle mouse button to open in a new tab, you can middle click that icon for opening your homepage in the new tab. You can similarly one-click any bookmark on the bookmark bar to put it in a new tab. Just go there, install it, then click on the wrench in chrome, select extensions, and either select it to open a blank page for you when you hit the new tab button, or specify what page you want it to open when you click new tab."}, {"url": "http://www.spigot.com/about/contact-us/change-home-page-new-tabs-default-search-settings/", "passage_text": "1 In the General tab, find the Home page section and change your homepage address. 2  For changing your new tabs, go to Tabs sections and click Tabs button. 3  When the window appears, check the “When a new tab is opened, open” section and select your choice. 4  Click OK button. "}, {"url": "https://support.google.com/chrome/answer/99438?hl=en", "passage_text": "1 Click the icon next to the last tab, which opens the New Tab page. 2  To open a link in a new tab, press Ctrl (Windows and Linux) or ⌘ (Mac) on your keyboard when you click the link. 3  Related tabs are grouped together. Open a new tab. 1 "}, {"url": "https://support.google.com/chrome/answer/95314?hl=en", "passage_text": "Set your startup page. You can control what page or pages appear when you launch Chrome on your computer. Have a new tab open. You can tell Chrome to open to a new tab page. 1  Open Chrome on your computer. 2  In the top-right corner, click the Chrome menu. 3  Click Settings. ( 4 If you're using a Chromebook, click Show advanced settings at the bottom of the page.). 5  Under On startup, select Open the New Tab page. You can tell Chrome to open to any webpage. 1  Open Chrome. 2  In the top-right corner, click the Chrome menu. 3  Click Settings. 4  Under On startup, click Open a specific page or set of pages. 5  Click Set pages. 6  Enter the web address of the page you want to see when you open Chrome. 7  Click OK."}, {"url": "http://answers.microsoft.com/en-us/ie/forum/ie8-windows_other/new-tabs-how-can-you-set-up-a-new-tab-to-open-to/7023db72-c2f2-410f-9c73-97f39c87294d", "passage_text": "When selecting a new tab how can you set it up to go to a home page that you select. Lets diagnose and fix the problem. MCP. If you prefer that your home page appear when you open a new tab, follow these steps: Open Internet Explorer by clicking the Start button, and then clicking Internet Explorer. Click the Tools button, and then click Internet Options. In the Tabbed Browsing Settings dialog box, do one of the following: In Internet Explorer 8, click the list under When a new tab is opened, open, click Your first home page, click OK, and then click OK again. In Internet Explorer 7, select the Open home page for new tabs instead of a blank page check box, click OK, and then click OK again"}]