[{"url": "http://patient.info/health/myeloma-leaflet", "passage_text": "In many cases, treatment can control the myeloma and put the disease into remission. Remission is not necessarily a cure. Full remission means that tests cannot detect the abnormal plasma cells in the blood or bone marrow, and the bone marrow is producing normal blood cells again."}, {"url": "http://patient.info/health/myeloma-leaflet", "passage_text": "Myeloma is a cancer that affects cells in the bone marrow, called plasma cells. As the cancerous plasma cells fill the bone marrow, you are not able to make enough normal blood cells. This can lead to anaemia, bleeding problems and infections."}, {"url": "http://www.medicalnewstoday.com/articles/161727.php", "passage_text": "Multiple myeloma, also known as myeloma or plasma cell myeloma, is cancer of the plasma cells-a kind of white blood cell which is present in the bone marrow. Plasma cells make antibodies called immunoglobulin which help fight off infections."}, {"url": "http://www.macmillan.org.uk/cancerinformation/cancertypes/myeloma/aboutmyeloma/whatismyeloma.aspx", "passage_text": "Myeloma-also known as multiple myeloma or myelomatosis-is a cancer of plasma cells in the bone marrow. This video talks about myeloma, its symptoms and how it is treated. To talk to someone about your questions and concerns about cancer, you can call the Macmillan Support Line on 0808 808 00 00."}, {"url": "http://www.hematology.org/Patients/Cancers/Myeloma.aspx", "passage_text": "Myeloma is cancer of the plasma cells. Plasma cells are white blood cells that produce disease-and infection-fighting antibodies in your body."}, {"url": "http://www.cancer.org/cancer/multiplemyeloma/detailedguide/multiple-myeloma-what-is-multiple-myeloma", "passage_text": "Multiple myeloma is a cancer formed by malignant plasma cells. Normal plasma cells are found in the bone marrow and are an important part of the immune system. The immune system is made up of several types of cells that work together to fight infections and other diseases."}, {"url": "http://www.lls.org/disease-information/myeloma", "passage_text": "Myeloma. 1  Is a type of cancer that begins in the bone marrow. 2  It is a cancer of plasma cells, which are a type of white blood cells (also called plasma B cells)."}, {"url": "http://www.webmd.com/cancer/myeloma-overview", "passage_text": "Multiple myeloma is a type of blood cancer. It starts in your bone marrow, the spongy tissue inside bones. This is where your body makes blood cells, including a certain type called plasma cells."}, {"url": "http://www.medicinenet.com/multiple_myeloma/article.htm", "passage_text": "Multiple myeloma is often referred to simply as myeloma. It is a type of cancer that starts in the plasma cells of the bone marrow. These are protein-making cells which normally make all of the different kinds of proteins that comprise the antibodies of the immune system."}, {"url": "http://www.webmd.com/cancer/myeloma-overview", "passage_text": "In this article. Multiple myeloma is a type of blood cancer. It starts in your bone marrow, the spongy tissue inside bones. This is where your body makes blood cells, including a certain type called plasma cells. These cells can grow out of control and crowd out the normal, healthy ones in your bone marrow."}]