[{"url": "http://www.oxforddictionaries.com/definition/english/tuber-cinereum", "passage_text": "noun (plural tuber cinereums). The part of the hypothalamus to which the pituitary gland is attached. Example sentences. 1  The neurohypophysis proper comprises the median eminence of the tuber cinereum, the infundibulum, the pituitary stalk, and the posterior or neural lobe of the pituitary gland."}, {"url": "https://en.wikipedia.org/wiki/Tuber_cinereum_hamartoma", "passage_text": "Tuber cinereum hamartoma (also known as hypothalamic hamartoma) is a non cancerous tumor in which a disorganized collection of neurons and glia accumulate at the tuber cinereum of the hypothalamus on the floor of the third ventricle. It is a congenital malformation, included on the spectrum of gray matter heterotopias. Tuber cinereum hamartoma may be associated with Pallister-Hall syndrome, a diagnosis characterized by multiple malformations, including polydactyly and imperforate anus. Neurologic symptoms are less severe in Pallister-Hall than in isolated cases of hamartoma."}, {"url": "http://radiopaedia.org/articles/hypothalamic-hamartoma", "passage_text": "A hypothalamic or tuber cinereum hamartoma is benign non neoplastic heterotrophic lesion in the brain that typically occurs in the region of the hypothalamus, arising from the tuber cinereum, a part of the hypothalamus located between the mamillary bodies and the optic chiasm. "}, {"url": "http://www.merriam-webster.com/medical/tuber%20cinereum", "passage_text": "Tweet. : an eminence of gray matter which lies on the lower surface of the brain between the optic tracts and in front of the mammillary bodies and of which the upper surface forms part of the floor of the third ventricle and the lower surface bears the infundibulum to which the pituitary gland is attached. "}, {"url": "https://en.wikipedia.org/wiki/Tuber_cinereum", "passage_text": "The tuber cinereum is a hollow eminence of gray matter situated between the mammillary bodies and the optic chiasm. The tuber cinereum is part of the hypothalamus. Structure [edit]. Laterally it is continuous with the anterior perforated substances and anteriorly with a thin lamina, the lamina terminalis. The infundibulum, a hollow conical process, projects from the tuber cinereum. The infundibulum extends forward and down where it is attached to the posterior lobe of the pituitary gland"}, {"url": "http://www.jpgmonline.com/article.asp?issn=0022-3859;year=1987;volume=33;issue=1;spage=1;epage=13;aulast=Sharma", "passage_text": "Absence of precocious puberty in cases of hamartoma of the hypothalamus and tuber cinereum is attributed to the young age at death, or pressure atrophy of hypothalamus (medial eminence), [49] or a lack of neuronal connection between hamartoma and brain. Hamartoma of the hypothalamus and tuber cinereum represents a midline dysraphic syndrome and presents as an ectopic cerebral grey matter, [19] comprising a mass of normal neuronal tissue, [7] , [60] or redundant brain tissue."}, {"url": "https://en.wikipedia.org/wiki/Tuber_cinereum_hamartoma", "passage_text": "Tuber cinereum hamartomas are at the hypothalamus between the mamillary bodies and above the pituitary stalk. Tuber cinereum hamartoma may be associated with Pallister-Hall syndrome, a diagnosis characterized by multiple malformations, including polydactyly and imperforate anus. Neurologic symptoms are less severe in Pallister-Hall than in isolated cases of hamartoma."}, {"url": "http://www.healthline.com/human-body-maps/tuber-cinereum", "passage_text": "Tuber cinereum. The hypothalamus is a part of the brain responsible for controlling emotional behavior and the body's responses to food. The tuber cinereum is located in the hypothalamus. The tuber cinereum is situated above the optic chiasm, where the optic nerves intersect. The tuber cinereum also regulates the circadian cycle in the human body. The circadian cycle refers to a process that completes a full cycle in a 24-hour period. In the human body this is often looked at as the way the body responds to the biological clock"}]