[{"url": "http://geology.com/world/turkmenistan-satellite-image.shtml", "passage_text": "Turkmenistan is located in central Asia. Turkmenistan is bordered by the Caspian Sea, Kazakhstan and Uzbekistan to the north, and Iran and Afghanistan to the south. Afghanistan, Iran, Kazakhstan, Uzbekistan."}, {"url": "http://www.answers.com/Q/Where_is_Turkmenistan", "passage_text": "Turkmenistan is located in central Asia. Iran and Afghanistan are located to the south, Kazakhstan and Uzbekistan are to the north, and the Caspian Sea is to the west."}, {"url": "https://en.wikipedia.org/wiki/Turkmenistan", "passage_text": "Turkmenistan (/tɜrkˈmɛnɨstaen/ tɜrkˈmɛnɨstæn /or/ ; Tɜrkmɛnɨˈstɑːn: Turkmen, [tuerkmenistan]) türkmenistan tyɾkmeniˈθtan is a Country In, central asia Bordered by kazakhstan to, The northwest uzbekistan to the north, And east afghanistan to, The southeast iran to the south, and southwest And The caspian sea to. the west"}, {"url": "http://www.infoplease.com/country/turkmenistan.html", "passage_text": "Geography. Turkmenistan (formerly Turkmenia) is bounded by the Caspian Sea in the west, Kazakhstan in the north, Uzbekistan in the east, and Iran and Afghanistan in the south. About nine-tenths of Turkmenistan is desert, chiefly the Kara-Kum."}, {"url": "https://en.wikipedia.org/wiki/Turkmenistan", "passage_text": "[tyɾkmeniˈθtan]) is a country in Central Asia, bordered by Kazakhstan to the northwest, Uzbekistan to the north and east, Afghanistan to the southeast, Iran to the south and southwest, and the Caspian Sea to the west."}, {"url": "http://wikitravel.org/en/Turkmenistan", "passage_text": "Turkmenistan is a country in Central Asia with a population of about 5 million, and an area around half a million square kilometres, or almost the size of Spain. Neighbouring countries are Iran and Afghanistan to the South, and Uzbekistan and Kazakhstan to the North."}, {"url": "http://www.mapsofworld.com/turkmenistan/", "passage_text": "Geography. Turkmenistan is located in Central Asia, with borders that include: Kazakhstan to the northwest, Uzbekistan to the northeast, Afghanistan to the southeast, Iran to the south, and the Caspian Sea to its west-with a coastline of 1,768 km."}]