[{"url": "http://woman.thenest.com/long-lpn-degree-1911.html", "passage_text": "Full-Time Program. LPN program lengths vary by state for full-time students. For instance, Oakland University in Michigan offers a practical nursing program that takes three semesters to complete on a full-time basis, plus nine semester hours of pre-requisite classes are required for admittance. Average pay for an LPN is just over $40,000 annually. This field is expected to experience a 20 percent growth rate through 2020. LPNs must complete an accreditation program in the state they wish to serve in order to become licensed. The time it takes to get an LPN certification varies by state and program type."}, {"url": "https://answers.yahoo.com/question/index?qid=20080331191426AA2pYWS", "passage_text": "Best Answer: LPN programs involve one year of training at a hospital, vocational technical school or community college. After taking this training you are eligible for licensure as an LPN or LVN. "}, {"url": "http://www.howlongdoes.com/life/how-long-does-it-take-to-be-an-lpn/", "passage_text": "One Year LPN Training Program – In order to become an LPN one can opt for this as this program involves on job training under the supervision of a RN (Registered Nurse). How long does this program take for completion? This program generally takes about 1 year to complete. "}, {"url": "http://learn.org/articles/How_Long_is_an_Accelerated_LPN_Program.html", "passage_text": "To become an LPN, you need to complete a training program in practical nursing and pass the National Council Licensure Examination for Practical Nurses (NCLEX-PN). The LPN program generally takes around a year to complete. Although most schools won't let you shorten the time you'll need to complete an LPN program, you can use your LPN training as a foundation for registered nurse (RN) training. Generally, you will take courses during the summer that act as a bridge between LPN and RN programs before starting the second year of an RN program in the fall. Some schools will require you to complete up to a year of clinical experience as an LPN before you may enter an accelerated program."}, {"url": "http://learn.org/articles/How_Long_is_an_Accelerated_LPN_Program.html", "passage_text": "Most licensed practical nursing (LPN) programs take around a year to complete. While there are very few accelerated LPN programs, this article discusses degree options that can lead to advancements in this profession. Schools offering Nursing degrees can also be found in these popular choices. Generally, you will take courses during the summer that act as a bridge between LPN and RN programs before starting the second year of an RN program in the fall. Some schools will require you to complete up to a year of clinical experience as an LPN before you may enter an accelerated program."}, {"url": "http://www.practicalnursing.org/cost-lpn-program-school", "passage_text": "Average cost of tuition for LPN programs is about $10,000 to $15,000 nationally. Prices range from $4,000 or $5,000 for some programs and upwards of $30,000 for others. This can be daunting and seem like simply too much money to pay out of pocket. "}, {"url": "http://learn.org/articles/How_Long_Does_it_Take_to_Become_a_Licensed_Practical_Nurse_LPN.html", "passage_text": "Education. If you enroll in a full-time licensed practical nurse (LPN) training program, you may be prepared and qualified to take your licensing exam in as little as 9-12 months. These programs are available from many community colleges, vocational schools, and universities, and they may range from 43-78 credit hours. Requirements for admission to an LPN training program vary by state and by school, but you typically must hold a high school diploma or have passed the General Educational Development (GED) exam. State requirements often include a drug test, up-to-date immunizations, and a tuberculosis (TB) screening."}, {"url": "http://www.licensedpracticalnurse.net/lpn-programs/course-duration/", "passage_text": "Variable Hour Programs. Although 12 to 18 months is typical for an LPN program, there are options to complete the courses more quickly. You may choose to attend a program that finishes in less than a year. In this type of program, you will have longer hours during the day for coursework. There are many programs from which to choose. When making your decision, you will want to consider the length of each program. The average duration of an LPN program is 12 to 18 months. There are several considerations that can determine the length and type of the program you choose."}]