[{"url": "http://www.apmex.com/category/20000/silver", "passage_text": "You can expect to pay more for a Silver coin than its Silver bullion counterparts, but because of the coin’s scarcity and collectibility, you’ll have a more fulfilling buying experience. There is almost an unlimited variety of Silver coins for your investing pleasure."}, {"url": "http://www.silver-coin-investor.com/silver-bars.html", "passage_text": "Silver Bars Offer Alternativess. There’s nothing wrong with silver bars—get the bullion when you can. Factors influencing the decision about whether to invest with either coin or bar are becoming irrelevant as investment demand presses on a retail shortage."}, {"url": "https://uk.answers.yahoo.com/question/index?qid=20130418101052AAOJIlf", "passage_text": "Best Answer: In California the silver dealers have paid $50.00 less than spot price on 100 troy ounce bars to buy from you,so it is better to buy 1 to 12 ounce coins or 1 to 10 ounce bars."}, {"url": "https://uk.answers.yahoo.com/question/index?qid=20130418101052AAOJIlf", "passage_text": "It doesn't really matter. You need to consider how you would split your investment if necessary, It may be better to have 10 silver coins rather than one bar of equivelent weight if you wanted to sell half your investment. Some silver coins may have more value than their intrinsic value (due to rarity)."}, {"url": "http://www.preciousmetals.com/blog/2014/11/buy-gold-silver-bars-coins/", "passage_text": "Physical Gold & Silver: Bars, Coins, and Rounds. Physical gold is sold in the form of bars, coins and rounds. These physical forms of gold are internationally regarded as store of value – which is a textbook definition of money."}, {"url": "http://www.silver.com/silver-bullion/", "passage_text": "Silver Coins. Coins are another very popular way to invest in silver bullion. Silver coins, like bars, can offer investors a simple and convenient way to invest in the precious metal. There are many different types of silver coins available today produced by various governments throughout the world."}, {"url": "http://www.silver-coin-investor.com/silver-bars.html", "passage_text": "100 Ounce Bars. Also available is the 100 ounce silver bar. I held a few of these in the beginning of my investment journey in silver and recently traded them for 90% coins and silver rounds. The smaller and lighter 100 ounce bar is more convenient than the 1,000 bar. Four or five 100 ounce bars fit nicely into a small safe and they aren't too cumbersome to transport."}]