[{"url": "https://www.debt.org/small-business/", "passage_text": "Small Business. As an entrepreneur, you may have started your own small business to do what you love. While following your passion can make you happy and successful in your own way, it won’t necessarily pay the bills. It’s important to remember that the inherent purpose of any business is to make a profit. When you first decide to open your own business, you’ll have to find a way to get it off the ground. Most new businesses pay initial costs with startup funds from two main sources: small business loans and personal savings."}, {"url": "http://www.webmd.com/health-insurance/insurance-marketplace/health-care-marketplace-for-small-businesses", "passage_text": "If you do not offer health insurance through your business, your employees can buy coverage through the individual Marketplace. And they may qualify for a tax credit to help them cover the cost. The other Marketplace, called SHOP (Small Business Health Options Program), is for small-business owners like you. Some states work in partnership with the federal government or run their own SHOP. Others rely on the federal government to run the SHOP for their residents through HealthCare.gov."}, {"url": "http://www.inc.com/encyclopedia/small-business-large-business-relationships.html", "passage_text": "Many small business owners see large businesses exclusively in competitive terms. For small enterprises that compete directly with larger companies, this characterization is an accurate one. Larger companies may assume roles as business partners, product distributors, or customers. Indeed, large enterprises wear different hats to different observers. One small business's aggressive competitor may be another small firm's business ally, distributor, or client."}, {"url": "http://www.nolo.com/legal-encyclopedia/small-business-tax-faq-29131-8.html", "passage_text": "If you are ever audited (and small businesses are about three times more likely to be audited than individuals), the IRS is most likely to zero in on business deductions for car expenses and travel and entertainment expenses. Furthermore, the burden will be on you -- not the IRS -- to substantiate your deductions. "}, {"url": "http://smallbusiness.chron.com/smallbusiness-loans-work-54597.html", "passage_text": "A small-business loan can help get your business off the ground. Stockbyte/Stockbyte/Getty Images. Small-business owners often need financial help to turn their entrepreneurial dreams into reality or keep an existing company afloat. If you need cash to purchase business equipment, fund your marketing campaign or cover your payroll, it may be necessary to take out a small-business loan. A small-business loan is different from other types of loans, and it's beneficial to understand how the loans work before you apply for one. You can get small-business loans from several sources, including banks, credit unions and online lenders. When researching potential lenders, it's important to consider the interest rates that are being offered and the repayment terms that are available."}, {"url": "https://www.americanexpress.com/us/small-business/openforum/articles/chart-how-much-do-small-business-ceos-make/", "passage_text": "Executive Editor, Editors. Many entrepreneurs don't start businesses to get rich; they do it because they have a passion for their work and love the freedom of being their own boss. Still, small business CEOs can often carve out a nice salary for themselve"}, {"url": "https://en.wikipedia.org/wiki/Small_business", "passage_text": "Researchers and analysts of small or owner-managed businesses generally behave as if nominal organizational forms (e.g., partnership, sole-trader or corporation) and the consequent legal and accounting boundaries of owner-managed firms are consistently meaningful. Franchising is a way for small business owners to benefit from the economies of scale of the big corporation (franchiser). McDonald's and Subway are examples of a franchise. The small business owner can leverage a strong brand name and purchasing power of the larger company while keeping their own investment affordable."}, {"url": "http://smallbusiness.chron.com/important-small-businesses-local-economies-5251.html", "passage_text": "Economic Growth. Small businesses contribute to local economies by bringing growth and innovation to the community in which the business is established. Small businesses also help stimulate economic growth by providing employment opportunities to people who may not be employable by larger corporations. Contributions. A small business is defined as a business (corporation, limited liability company or proprietorship) with 500 employees or less. According to the U.S. Small Business Administration (SBA), small businesses represent 99.7 percent of all employer firms. Since 1995, small businesses have generated 64 percent of new jobs, and paid 44 percent of the total United States private payroll, according to the SBA"}]