[{"url": "http://repairpal.com/camshaft-actuator", "passage_text": "Auto Systems and Repair. A camshaft actuator is a mechanical or electronic device that is mounted on the camshaft gear. Its purpose is to slightly advance or retard the timing of when the camshaft opens or closes the intake and/or exhaust valves. Symptoms of Wear or Failure. 1  Illumination of the Check Engine Light. 2  Rough idle/engine misfires."}, {"url": "http://www.autozone.com/repairguides/LaCrosse-2006-2007/Components-Systems/Variable-Camshaft-Timing-Oil-Control-Solenoid/_/P-0996b43f80cb220b", "passage_text": "The variable camshaft timing oil control solenoid (also called the Camshaft Position (CMP) actuator) has an outer housing that is driven by an engine timing chain. Removal & Installation. 1  Turn the ignition OFF. 2  Remove the Camshaft Position (CMP) actuator valve electrical connector. 3  The CMP actuator valve is also referred to as the variable camshaft timing oil control solenoid. 4  Remove the CMP actuator valve bolt."}, {"url": "http://www.autozone.com/repairguides/LaCrosse-2006-2007/Components-Systems/Variable-Camshaft-Timing-Oil-Control-Solenoid/_/P-0996b43f80cb220b", "passage_text": "1 Remove the Camshaft Position (CMP) actuator valve electrical connector. 2  The CMP actuator valve is also referred to as the variable camshaft timing oil control solenoid. 3  Remove the CMP actuator valve bolt. 4  Remove the CMP actuator valve. Removal & Installation. 1  Turn the ignition OFF. 2  Remove the Camshaft Position (CMP) actuator valve electrical connector. 3  The CMP actuator valve is also referred to as the variable camshaft timing oil control solenoid. 4"}, {"url": "http://www.answers.com/Q/What_is_a_camshaft_actuator", "passage_text": "The Camshaft position actuator solenoid controls the exhaust camshaft retard position. From 0 to 25 degrees. It is driven by a pulsed electrical signal from the ECM... much like that of a fuel injector. It is located on the front-passenger's side of the motor... on the head. "}, {"url": "http://www.justanswer.com/pontiac/3kfhb-cam-solenoid-estimated-cost-parts.html", "passage_text": "CMP Actuator System Operation. The camshaft position (CMP) actuator system is controlled by the control module. The control module sends a pulse width modulated 12-volt signal to each CMP actuator solenoid to control the amount of engine oil flow to a camshaft actuator passage. Hope this helps shed a little light. Below is a description of the system. Camshaft Actuator System Description Camshaft Position (CMP) Actuator System. CMP Actuator System Operation. camshaft position (CMP) actuator solenoid valve."}, {"url": "http://www.ehow.com/info_7825859_exhaust-cam-actuator-solenoid.html", "passage_text": "The Role of the Solenoids. A camshaft actuator solenoid --normally installed in the front of each cylinder head -- is used to precisely control the flow of oil into the camshaft actuator. This changes the rotation of the camshaft to adjust valve timing and valve overlap on the go. A trouble code related to either camshaft actuator solenoid doesn't necessarily mean the solenoid has failed. If you don't change your oil on a regular basis, gunk buildup will form and block oil flow into the actuator."}, {"url": "http://www.obd-codes.com/p0010", "passage_text": "A P0010 code refers to the VVT (variable valve timing) or VCT (variable camshaft timing) components and the car's PCM (powertrain control module). That consists of an oil control valve (OCV), also called a solenoid valve and other components. "}, {"url": "http://www.autozone.com/repairguides/LaCrosse-2006-2007/Components-Systems/Variable-Camshaft-Timing-Oil-Control-Solenoid/_/P-0996b43f80cb220b", "passage_text": "1 Disconnect the Camshaft Position (CMP) actuator solenoid to be tested. 2  The CMP actuator valve is also referred to as the variable camshaft timing oil control solenoid. 3  Turn ON the ignition, with the engine OFF. Removal & Installation. 1  Turn the ignition OFF. 2  Remove the Camshaft Position (CMP) actuator valve electrical connector. 3  The CMP actuator valve is also referred to as the variable camshaft timing oil control solenoid. 4  Remove the CMP actuator valve bolt."}, {"url": "http://www.justanswer.com/pontiac/3kfhb-cam-solenoid-estimated-cost-parts.html", "passage_text": "Camshaft Position (CMP) Actuator System. The camshaft position (CMP) actuator system is used on both the intake and exhaust camshafts. The CMP actuator system is used for a variety of engine performance enhancements. Hope this helps shed a little light. Below is a description of the system. Camshaft Actuator System Description Camshaft Position (CMP) Actuator System. CMP Actuator System Operation. camshaft position (CMP) actuator solenoid valve."}, {"url": "http://www.ehow.com/info_7825859_exhaust-cam-actuator-solenoid.html", "passage_text": "A camshaft actuator solenoid --normally installed in the front of each cylinder head -- is used to precisely control the flow of oil into the camshaft actuator. A trouble code related to either camshaft actuator solenoid doesn't necessarily mean the solenoid has failed. If you don't change your oil on a regular basis, gunk buildup will form and block oil flow into the actuator."}]