[{"url": "https://en.wikipedia.org/wiki/Lough_Swilly", "passage_text": "(January 2010). Lough Swilly (Irish: Loch Suili, súilí Meaning lake Of shadows or The lake Of) eyes In ireland is a glacial fjord or sea inlet lying between the western side of The Inishowen peninsula and The Fanad, peninsula In County. donegal Along with Carlingford Lough and Killary Harbour it is one of three glacial fjords in Ireland. At the northern extremities of the lough are Fanad Head with its famous lighthouse and Dunaff Head. Towns situated on the lough include Buncrana on Inishowen and Rathmullan on the western side."}, {"url": "https://en.wikipedia.org/wiki/Lough_Swilly", "passage_text": "Lough Swilly (Irish: Loch Suili, súilí Meaning lake Of shadows or The lake Of) eyes In ireland is a glacial fjord or sea inlet lying between the western side of The Inishowen peninsula and The Fanad, peninsula In County. Donegal along With Carlingford lough And Killary harbour it is one of three glacial fjords In. ireland Along with Carlingford Lough and Killary Harbour it is one of three glacial fjords in Ireland. At the northern extremities of the lough are Fanad Head with its famous lighthouse and Dunaff Head. Towns situated on the lough include Buncrana on Inishowen and Rathmullan on the western side."}, {"url": "http://www.sjp.clara.net/nibus/lswilly.htm", "passage_text": "Originally to have been called the Lough Foyle and Lough Swilly Railway Company, the company was incorporated with its current title in June 1853, with the aim of building a railway line to connect Lough Foyle and Lough Swilly (on either side of the Inishowen Peninsula in North Donegal). The standard-gauge line between Derry and Farland Point on Lough Swilly (on the shore opposite the south coast of Inch Island) opened 10 years later on 31st December 1863. This was intended to connect with Steamboats operating on Lough Swilly. You can see where these places are on the Lough Swilly Route Map."}, {"url": "http://www.amazinggrace.ie/index.php/lough-swilly", "passage_text": "Lough Swilly (Loch Suili) súilí is a sea lough stretching 40 km Into County donegal from The Atlantic. Ocean also known as The lake Of, shadows the lough is between 15 and 50 metres. Deep it is bordered on the west By (Inishowen Inis) – Eoghain’ireland s largest – peninsula and by The fanad peninsula on the. east Lough Swilly (Loch Suili) súilí is a sea lough stretching 40 km Into County donegal from The Atlantic. ocean"}, {"url": "http://www.amazinggrace.ie/index.php/lough-swilly", "passage_text": "Introduction. Lough Swilly (Loch Suili) súilí is a sea lough stretching 40 km Into County donegal from The Atlantic. Ocean also known as The lake Of, shadows the lough is between 15 and 50 metres. deep Lough Swilly (Loch Suili) súilí is a sea lough stretching 40 km Into County donegal from The Atlantic. ocean"}, {"url": "http://www.loughswillymarina.com/", "passage_text": "The Lough Swilly Marina at Fahan, in County Donegal, warmly welcomes all visitors to the beautiful Inishowen Peninsula. We are conveniently located between Derry/Londonderry in the North of Ireland and Buncrana in the South along the R238. The village of Fahan is located on the western shores of the Inishowen Peninsula on Lough Swilly, an area of outstanding beauty and a Special Area of Conservation. Public transport passes through the village on a regular basis and it is a short taxi journey to Derry/Londonderry. The City of Derry Airport is nearby. The Marina, when completed will have the capacity to provide sheltered berthing for 406 boats. It is currently able to provide pontoon berthing for approximately 200 boats of various sizes. Water and electricity are available on the pontoons and there are temporary toilets and showers on site."}, {"url": "http://www.geographyinaction.co.uk/Issues/Lough%20Swilly.html", "passage_text": "Aquaculture in Lough Swilly. | Background to the issue | Arguments for development | Arguments against development |. Background to the issue. Lough Swilly is a flooded river valley stretching 40 kilometres into County Donegal from the Atlantic Ocean. To its east is the Inishowen Peninsula and to the west lies the Fanad Peninsula. The Lough reaches 15 and 50 metres deep and is accessible by boats at all stages of the tide as far upstream as Letterkenny. "}, {"url": "http://www.loughswillymarina.com/approach/", "passage_text": "Approach. Lough Swilly is a deep water estuary approximately 12 miles long and up to 3 miles wide running from the Atlantic in the north to Inch Island in its south. The entire length of Lough Swilly is marked with various easily identified navigation lights along the main “deep water” shipping channel. "}, {"url": "http://www.angling-ireland.com/lough_swilly", "passage_text": "For many years, Lough Swilly has been a top venue for my own angling club bookings. It is situated on the picturesque coastline of the Inishowen Peninsula, North Donegal, and offers the sea angler a wide variety of species in its shallow, sheltered waters. "}]