[{"url": "http://medical-dictionary.thefreedictionary.com/Epstein-Barr+Virus+Test", "passage_text": "Definition. The Epstein-Barr virus test is a blood test, or group of tests, to determine the presence or absence of antibodies in the blood stream directed against proteins of the Epstein-Barr virus, the cause of infectious mononucleosis. "}, {"url": "https://labtestsonline.org/understanding/analytes/ebv/tab/test", "passage_text": "Tests for Epstein-Barr virus (EBV) antibodies are used to help diagnose infectious mononucleosis (mono) if a person is symptomatic but has a negative mono test. EBV antibodies may be ordered when someone has symptoms suggesting mono but a negative mono test and when a pregnant woman has flu-like symptoms and the doctor wants to determine whether the symptoms are due to EBV or another microorganism."}, {"url": "http://www.healthline.com/health/epstein-barr-virus-test", "passage_text": "In adolescents and adults, it causes an illness known as infectious mononucleosis between 35 and 50 percent of the time. The virus is spread through saliva or upper respiratory secretions and cannot be spread through contact with the blood. The Epstein-Barr virus test is a blood test used to identify an EBV infection. The test detects the presence of antibodies, which are proteins that your body’s immune system releases in response to a harmful substance, called an antigen. Specifically, the EBV test is used to detect antibodies to EBV antigens"}, {"url": "http://www.mayomedicallaboratories.com/interpretive-guide/?alpha=E&unit_code=84421", "passage_text": "Diagnosing infectious mononucleosis when a mononucleosis screening procedure is negative and infectious mononucleosis or a complication of Epstein-Barr virus infection is suspected. The test has 3 components: viral capsid antigen (VCA) IgG, VCA IgM, and Epstein-Barr nuclear antigen (EBNA). Presence of VCA IgM antibodies indicates recent primary infection with Epstein-Barr virus (EBV). The presence of VCA IgG antibodies indicates infection sometime in the past. Antibodies to EBNA develop 6 to 8 weeks after primary infection and are detectable for life."}, {"url": "https://requestatest.com/ebv-vca", "passage_text": "Description: The EBV VCA IgM & IgG package looks for two types of antibodies which the body typically develops in response to infection with Epstein-Barr Virus. IgM antibodies usually develop shortly after infection and phase out after a couple months. "}, {"url": "https://labtestsonline.org/understanding/analytes/ebv/tab/sample", "passage_text": "Epstein-Barr virus (EBV) is a virus that typically causes a mild to moderate illness. These tests detect antibodies to EBV in the blood and help establish a diagnosis of an EBV infection. Epstein-Barr virus causes an infection that is very common."}, {"url": "https://labtestsonline.org/understanding/analytes/ebv/tab/test", "passage_text": "If the VCA-IgM is negative but VCA-IgG and an EBNA antibody are positive, then it is likely that the person tested had a previous EBV infection. If an individual is asymptomatic and negative for VCA-IgG, then that person has likely not been previously exposed to EBV and is vulnerable to infection. EBV antibodies may be ordered when someone has symptoms suggesting mono but a negative mono test and when a pregnant woman has flu-like symptoms and the doctor wants to determine whether the symptoms are due to EBV or another microorganism."}]