[{"url": "http://thebakingpan.com/cheesecake-hints-and-tips/", "passage_text": "1 Spread it evenly over the surface of the cheesecake and bake for 5 minutes. 2  Remove from the oven and let the cake cool completely to room temperature, then cover and chill in the refrigerator for 12 to 24 hours. Sponge cake makes a nice base for cheesecakes. The cake is prebaked in a regular cake pan up to 1 day ahead, and then cut to fit into the bottom of the springform or cheesecake pan before adding the filling. Cheesecake Filling: 1  The cheese should be softened and at room temperature to avoid lumps."}, {"url": "http://whatscookingamerica.net/Cake/cheesecaketip.htm", "passage_text": "Check Linda's delicious and easy-to-make Cheesecake Recipes. How To Bake Perfect Cheesecakes: I usually bake my cheesecakes 1 1/4 hours or until edges are light brown and center is almost set. I then turn the oven off and let cheesecake stand in oven, with door ajar, 30 minutes or until center is completely set. Then remove from oven and cool completely on a wire rack. Ingredients: It is important to use room temperature ingredients, such as the cream cheese and eggs. "}, {"url": "http://www.stepbystep.com/how-to-tell-if-your-cheesecake-is-done-108476/", "passage_text": "1 Temperature Checking the temperature of a cheesecake is a good idea because if it has reached a temperature of 160 to 165 degrees F, it is ideal and most probably done. 2  This can be done by sticking in an instant-read thermometer and reading the temperature. 3  Anything lower than that or higher could signal trouble. Checking the temperature of a cheesecake is a good idea because if it has reached a temperature of 160 to 165 degrees F, it is ideal and most probably done. This can be done by sticking in an instant-read thermometer and reading the temperature."}, {"url": "http://comfortablydomestic.com/2012/12/perfect-cheesecake/", "passage_text": "Remove the pan from the oven, and place it in the refrigerator to cool while tending to the filling. Reduce the oven temperature to 250°F. As the cheesecake filling is largely comprised of eggs, sugar, and milk products, it can be classified as a custard. 1 At the end of the final hour of baking, carefully remove the cheesecake from the roasting pan, open the foil around the pan to let any water escape, and set the pan on a wire rack to cool for one hour. 2  The center of the cake may still look a little jiggly, but so long as it doesn’t look like soup, this is fine."}, {"url": "http://www.food.com/recipe/classic-cheesecake-baked-in-a-water-bath-109174", "passage_text": "1 Pour into the pan, all the way to the top and set the pan into a larger pan. 2  Set in the oven and then pour the hottest tap water into the outer pan. 3  This is a water bath. 4  Bake until the center is just firm, but when you tap the side the center will jiggle like firm jello. "}, {"url": "http://m.joyofbaking.com/cakes/Cheesecake.html", "passage_text": "Place the cheesecake pan on a larger baking pan and place in the oven. Bake for 15 minutes and then lower the oven temperature to 250 degrees F (120 degrees C) and continue to bake for about another 60 - 90 minutes or until firm and only the center of the cheesecake looks a little wet and wobbly. "}, {"url": "http://www.joyofbaking.com/Cheesecake.html", "passage_text": "Place the cheesecake pan on a larger baking pan and place in the oven. Bake for 15 minutes and then lower the oven temperature to 250 degrees F (120 degrees C) and continue to bake for about another 60 - 90 minutes or until firm and only the center of the cheesecake looks a little wet and wobbly. Chocolate Cheesecake. New York Cheesecake: Grease, or spray with Pam, a 9 inch (23 cm) springform pan. Place the springform pan on a larger baking pan to catch any leakage while the cheesecake is baking. Preheat oven to 350 degrees F (177 degrees C) with rack in center of oven."}, {"url": "http://cooking.stackexchange.com/questions/42050/how-to-tell-when-cheesecake-is-done", "passage_text": "Cheesecake is a custard, so your very best indicator of doneness is temperature. There are a range of opinions, from about 150 F to 165 F / 65 C to 73 C, measured at the center of the pan, in the center of the layer. "}, {"url": "http://www.cheftalk.com/t/11198/cheesecake-internal-temp", "passage_text": "When baking cheesecake I use a water bath to control the temperature. I bake at 325 for 45- 50 minutes, turn off the oven and allow the cake to cool down. I find the cake doesn't sink that way. Also I jiggle the pan to watch how the cake is coming along. It s a defining moment when the cake is ready to the point where it will finish in the oven as it cools."}, {"url": "http://thebakingpan.com/cheesecake-hints-and-tips/", "passage_text": "1 Wait about 1 hour after the baked cheesecake has cooled on a wire rack. 2  Heat the oven to 425 degrees F. 3  In a small bowl, combine 1½ cups sour cream with 2 tablespoons granulated sugar. 4  Spread it evenly over the surface of the cheesecake and bake for 5 minutes. Sponge cake makes a nice base for cheesecakes. The cake is prebaked in a regular cake pan up to 1 day ahead, and then cut to fit into the bottom of the springform or cheesecake pan before adding the filling. Cheesecake Filling: 1  The cheese should be softened and at room temperature to avoid lumps."}]