[{"url": "http://www.perinatology.com/calculators/betahCG.htm", "passage_text": "As pregnancy progresses the doubling time becomes longer. By 6 to 7 weeks beta hCG levels may take as long as 3 1/2 days to double. hCG normally reaches a peak level at about 8 to 10 weeks and then declines for the remainder of the pregnancy. Morse and coworkers (2012) at University of Pennsylvania School of Medicine recommend that the b. Reference Ranges for beta hCG (. If the hCG level is decreasing the the half life will be calculated. To calculate the doubling time of two beta hCG samples: 1. Enter the date the first blood test was drawn and the beta HCG value for the date the sample was drawn 2."}, {"url": "http://www.healthline.com/health/hcg-blood-test-quantitative", "passage_text": "Because hCG levels change so quickly during early pregnancy, the hCG quantitative test should be repeated within 48 to 72 hours to observe how the hormone level is changing. Certain drugs such as diuretics, promethazine, and tranquilizers can also give false-negative test results. The placenta is the sac that nourishes the egg after it’s fertilized and attaches to the uterine wall. HCG can first be detected in a blood sample about 11 days after conception. Levels of hCG continue to double every 72 hours."}, {"url": "http://www.drmalpani.com/knowledge-center/articles/betahcglevels/", "passage_text": "As the embryo grows rapidly, HCG levels normally double every 2 to 3 days. Thus, one reliable sign of a healthy pregnancy is the fact that the HCG levels are increasing rapidly, and often doctors will measure serial beta HCG levels 3 days apart in order to determine the viability of the pregnancy. A rising HCG level is reassuring."}, {"url": "http://www.drmalpani.com/knowledge-center/articles/hcg", "passage_text": "While a single level provides useful information, serial measurements are much more useful. HCG levels should double every 48- 72 hours in a healthy pregnancy. If the HCG levels drop, this confirms the pregnancy is miscarrying. During the very early pregnancy, HCG levels are the only way of monitoring the pregnancy. HCG levels which do not increase as rapidly as they should may mean that there is a problem with the pregnancy-the embryo may miscarry because it is unhealthy; or the pregnancy could be an ectopic"}, {"url": "http://www.drmalpani.com/knowledge-center/articles/hcg", "passage_text": "The reliable indication. As the embryo grows rapidly, HCG levels normally double every 2 to 3 days. Thus, one reliable sign of a healthy pregnancy is the fact that the HCG levels are increasing rapidly, and often doctors may need to do 2 HCG levels 3 days apart in order to determine the viability of the pregnancy. During the very early pregnancy, HCG levels are the only way of monitoring the pregnancy. HCG levels which do not increase as rapidly as they should may mean that there is a problem with the pregnancy-the embryo may miscarry because it is unhealthy; or the pregnancy could be an ectopic"}, {"url": "http://www.healthline.com/health/hcg-blood-test-quantitative", "passage_text": "Cells in the placenta make human chorionic gonadotropin, or hCG. The placenta is the sac that nourishes the egg after it’s fertilized and attaches to the uterine wall. HCG can first be detected in a blood sample about 11 days after conception. Levels of hCG continue to double every 72 hours. They reach their peak around eight to 11 weeks after conception. HCG levels then decline and level off, remaining steady for the rest of your pregnancy"}, {"url": "http://www.ebmedicine.net/topics.php?paction=showTopicSeg&topic_id=130&seg_id=2558", "passage_text": "35. Serial β -hCG levels are more sensitive for detecting an abnormal early pregnancy. Serum levels normally double every 1.8 to 3 days for the first six to seven weeks of pregnancy, beginning eight to nine days after ovulation. 17 After an initial level is drawn, repeat values should be checked 48 hours later. "}, {"url": "http://americanpregnancy.org/while-pregnant/hcg-levels/", "passage_text": "1 In 85% of normal pregnancies, the hCG level will double every 48 – 72 hours. 2  As you get further along in pregnancy and the hCG level gets higher, the time it takes to double can increase to about every 96 hours. 3  Caution must be used in making too much of hCG numbers. Key things to remember about hCG levels. 1  In 85% of normal pregnancies, the hCG level will double every 48 – 72 hours. 2  As you get further along in pregnancy and the hCG level gets higher, the time it takes to double can increase to about every 96 hours."}, {"url": "http://americanpregnancy.org/while-pregnant/hcg-levels/", "passage_text": "Typically, the hCG levels will double every 72 hours. The level will reach its peak in the first 8 – 11 weeks of pregnancy and then will decline and level off for the remainder of the pregnancy. 1  In 85% of normal pregnancies, the hCG level will double every 48 – 72 hours. Key things to remember about hCG levels. 1  In 85% of normal pregnancies, the hCG level will double every 48 – 72 hours. 2  As you get further along in pregnancy and the hCG level gets higher, the time it takes to double can increase to about every 96 hours. 3  Caution must be used in making too much of hCG numbe"}]