[{"url": "http://aboxturtle.com/box_turtle_egg_laying.htm", "passage_text": "Egg Laying. Box turtles lay eggs in the spring and early summer. Here in South Carolina some are known to lay in the fall. The eggs hatch in the fall and the hatchlings over winter in the nest or the eggs hatch in the spring. A gravid female typically becomes very restless and constantly tries to escape."}, {"url": "http://boxturtlesite.info/breed.html", "passage_text": "This is NOT the way to bring baby box turtles into the world. All breeding of captive box turtles should be done in a responsible manner. The stresses and energy drain on both the male and female box turtles during breeding, egg formation, and laying are considerable and can make them more prone to illness and death. They may not feel like eating, but if there is a female box turtle around, he'll feel like reproducing. Many owners of multiple box turtles will tell you stories about their male box turtle's clumsy attempts to mate or about an anxious female looking for a place to lay her eggs."}, {"url": "http://www.tortoise-protection-group.org.uk/site/captive_breeding_133.asp", "passage_text": "Captive Breeding. Incubation and hatching of tortoise eggs in the UK can be an extremely critical time for the tortoise breeder. There are many considerations that the breeder needs to take into account when a reproductively active female is ready to lay her eggs if there is to be a successful outcome. "}, {"url": "http://www.horsefieldtortoise.co.uk/how-to-breed-my-horsefield-tortoise/", "passage_text": "They are at a mature size and able to breed at 10 cm (4 inches) for males and 18 cm (7 inches) for females. Egg Laying. When the female will lay eggs depends on several factors like time of mating, temperature, length of day etc. Most mating happens in the spring after hibernation but the Horsefield tortoise is known to mate year-round. In most case, after hibernation and breeding the egg laying time will come. "}, {"url": "http://www.hermann-tortoise.co.uk/forum/index.php?showtopic=8996", "passage_text": "Posted. my tortoises have recently been mating for the first time, so how long after mating will the female be ready to start laying eggs. my tortoises have recently been mating for the first time, so how long after mating will the female be ready to start laying eggs. "}, {"url": "http://www.fishpondinfo.com/turtles/turbreed.htm", "passage_text": "Female turtles will start to lay eggs when they are mature. They will lay eggs with or without a male present. If there is no male present, the eggs will not be fertile and can be discarded. After mating, a female may be able to lay fertile eggs for a few weeks or perhaps longer. As eggs develop inside a female, her appetite will wane. She may fast for the few weeks before eggs are laid"}, {"url": "http://www.tortoise-protection-group.org.uk/site/165.asp", "passage_text": "The smaller Hermanns (Hermanni) tortoises only lay 2-3 eggs per clutch. In contrast, tropical tortoises such as Leopard tortoises can produce on average between 6-20 eggs or more each month for up to approximately 7 months of the year. The eggs are large and are similar in size and shape to a ping pong ball. The even larger Sulcata tortoise can lay between 15-30 eggs per clutch 2-5 times per year. Please note that tropical tortoises do grow very large, and as they need heat throughout the year they are expensive to maintain."}, {"url": "http://www.redfoottortoise.com/redfoot_eggs.htm", "passage_text": "Redfoot Tortoises lay rather large round eggs. Clutch size ranges from 1-13 eggs. In my colony they usually lay 4-6 eggs. Egg size is variable and seems to be related to the size of the female and the number of eggs per clutch. They weigh 30-50 grams and are usually 40-45 mm in diameter. "}, {"url": "http://www.tortoise-protection-group.org.uk/site/165.asp", "passage_text": "In the wild, most egg laying activity would take place in spring or early summer, to allow the hatchlings to grow a little before their first hibernation. There is, however, no set breeding season for the majority of tortoises in captivity and egg production can take place at any time of year. The eggs are large and are similar in size and shape to a ping pong ball. The even larger Sulcata tortoise can lay between 15-30 eggs per clutch 2-5 times per year. Please note that tropical tortoises do grow very large, and as they need heat throughout the year they are expensive to maintain."}, {"url": "http://www.russiantortoise.net/breeding.htm", "passage_text": "If the female was fertilized, within a month she will be ready to lay eggs. Some females will have multiple clutches. And (at least with mine) some won't lay eggs until the fall. A suitable nesting area needs to be provided whether they are inside or outside. Many will dig test nest or two. Frequently indoors they will lay eggs in the open no matter how nice the nest box is. As a rule the female is very particular about nest site selection. However once the eggs are laid she will take no further interest in her offspring."}]