[{"url": "http://www.webmd.com/baby/features/8-early-signs-of-pregnancy", "passage_text": "One of the first signs is often achy, tender breasts. They may feel fuller and heavier. You might even notice the area around your nipple getting bigger and darker. Most early pregnancy symptoms, including tender breasts, are related to rising levels of the hormone progesterone, says Treesa McLean, a licensed midwife."}, {"url": "http://www.babycenter.com/404_early-signs-of-pregnancy-when-will-i-feel-symptoms_10372077.bc", "passage_text": "Pregnancy symptoms at 6 weeks. For most women, morning sickness begins between 6 and 8 weeks. You may also be exhausted and experiencing mood swings, which could be due to hormonal changes as well as the stress of wondering what lies ahead in your pregnancy. About 25 percent of women have spotting in early"}, {"url": "http://americanpregnancy.org/getting-pregnant/early-pregnancy-symptoms/", "passage_text": "Headaches: The sudden rise of hormones in your body can cause you to have headaches early in pregnancy. Frequent Urination: Around 6-8 weeks after conception, you may find yourself making a few extra trips to the bathroom."}, {"url": "http://americanpregnancy.org/getting-pregnant/early-pregnancy-symptoms/", "passage_text": "Spotting: Implantation bleeding can be one of the earliest pregnancy symptoms. About 6-12 days after conception, the embryo implants itself into the uterine wall. Some women will experience spotting as well as cramping."}, {"url": "http://americanpregnancy.org/getting-pregnant/early-pregnancy-symptoms/", "passage_text": "Swollen or Tender Breasts: Swollen or tender breasts is a pregnancy symptom which may begin as early as 1-2 weeks after conception. Women may notice changes in their breasts; they may be tender to the touch, sore, or swollen."}, {"url": "http://www.healthline.com/health/pregnancy/early-symptoms-timeline", "passage_text": "For many women, the very first detectable sign of a pregnancy is a missed period. During implantation, some women experience mild cramping and blood spotting. You could mistake the signs and symptoms of implantation as your period. In this case, you may not realize that you’re pregnant."}, {"url": "http://www.webmd.com/baby/guide/pregnancy-am-i-pregnant", "passage_text": "A few days after conception, the fertilized egg attaches itself to wall of the uterus. This can cause one of the earliest signs of pregnancy -- spotting and, sometimes, cramping. That's called implantation bleeding. It occurs anywhere from six to 12 days after the egg is fertilized. The cramps resemble menstrual cramps, so some women mistake them and the bleeding for the start of their period."}, {"url": "http://www.mayoclinic.org/healthy-lifestyle/getting-pregnant/in-depth/symptoms-of-pregnancy/art-20043853", "passage_text": "1 Tender, swollen breasts. 2  Early in pregnancy hormonal changes might make your breasts tender, sensitive or sore. 3  Or your breasts might feel fuller and heavier. 4  Nausea with or without vomiting. 5  Morning sickness, which can strike at any time of the day or night, sometimes begins as early as three weeks after conception."}, {"url": "http://americanpregnancy.org/getting-pregnant/early-pregnancy-symptoms/", "passage_text": "Other potential early pregnancy symptoms include fatigue, headaches, lower backaches, and increased urination. You may contact the American Pregnancy Association at 1-800-672-2296 M-F 10am-6pm to discuss your concerns or ask questions about the pregnancy symptoms you may be experiencing."}]