[{"url": "https://en.wikiquote.org/wiki/Theodor_Herzl", "passage_text": "Perhaps in five years, certainly in fifty, everyone will know it. Theodor Herzl (May 2, 1860 – July 3, 1904) was an Austrian Jewish journalist who became the founder of modern political Zionism. His Hebrew personal name was Binyamin Ze'ev. "}, {"url": "http://israelforever.org/programs/myherzl/who_was_theodor_herzl/", "passage_text": "Herzl had one sister, Pauline, a year older than he was, who died suddenly on February 7, 1878, a catalyst for the family to pick up and move to Vienna, Austria There, Herzl attended the University of Vienna, and in 1884 he was awarded a doctorate of law. Here, the World Zionist Organization was founded and Herzl was made its first president (a position he held until his death in 1904) and during this year he also founded his Zionist newspaper, Die Welt, in Vienna."}, {"url": "http://www.biblebelievers.org.au/herzl.htm", "passage_text": "Palestine and Theodor Herzl. In 1896 Austrian journalist and playwright Theodor Herzl (1860-1904) who founded the Zionist movement was the first person to write of the Jewish Question when he wrote, The Jewish State. A modern attempt to solve the JEWISH QUESTION!. Theodor Herzl Theodor Herzl, of Austria, was the founder of Political Zionism. It was established at a secret convention of Zionist leaders August 29th to 31st, 1897, in Bazle, Switzerland. It was at this convention that the Bazle Programme - the Protocols were adopted."}, {"url": "http://judaism.about.com/od/jewishbiographies/a/herzl.htm", "passage_text": "Herzl died in 1904, and was buried on Mount Herzl in Jerusalem. He is credited with being the father of political Zionism. More Biographies of Famous Jewish Leaders Theodor Herzl was born in Budapest. He received a law degree, but chose to concentrate on writing. He was 31 years old in 1891 when he moved to Paris as the correspondent for the Vienna Neue Freie Presse. Encountering anti-Semitism, he assumed that the solution was for Jews to totally assimilate. By Lisa Katz."}, {"url": "https://en.wikipedia.org/wiki/Theodor_Herzl", "passage_text": "He was born in Pest, the eastern, mostly flat part of Budapest, Kingdom of Hungary (now Hungary), to a secular Jewish family. His father's family were originally from Zimony (today Zemun, Serbia). He was the second child of Jeanette and Jakob Herzl, who were German-speaking, assimilated Jews. "}, {"url": "http://www.jewishvirtuallibrary.org/jsource/biography/Herzl.html", "passage_text": "Theodor (Binyamin Ze'ev) Herzl was the visionary behind modern Zionism and the reinstitution of a Jewish homeland. Herzl (born May 2, 1860; died July 3, 1904) was born in Budapest in 1860. He was educated in the spirit of the German-Jewish Enlightenment, and learned to appreciate secular culture. Herzl died in Vienna in 1904, of pneumonia and a weak heart overworked by his incessant efforts on behalf of Zionism. By then the movement had found its place on the world political map. In 1949, Herzl’s remains were brought to Israel and reinterred on Mount Herzl in Jerusalem."}, {"url": "http://israelforever.org/programs/myherzl/who_was_theodor_herzl/", "passage_text": "Herzl convened the First Zionist Congress in Basel, Switzerland. Here, the World Zionist Organization was founded and Herzl was made its first president (a position he held until his death in 1904) and during this year he also founded his Zionist newspaper, Die Welt, in Vienna."}, {"url": "http://israelforever.org/programs/myherzl/who_was_theodor_herzl/", "passage_text": "Herzl and his family, c. 1866–1873. Theodor Herzl was born in the Pest section of Budapest, Hungary on May 2, 1860, to Jeanette and Jacob, a secular Jewish family originally from Zimony (today Zemun, Serbia). Here, the World Zionist Organization was founded and Herzl was made its first president (a position he held until his death in 1904) and during this year he also founded his Zionist newspaper, Die Welt, in Vienna."}, {"url": "https://en.wikipedia.org/wiki/Mount_Herzl", "passage_text": "Mt. Herzl is the burial place of four of Israel's prime ministers: Levi Eshkol, Golda Meir, Yitzhak Shamir and Yitzhak Rabin (who is buried beside his wife Leah). Israeli presidents are also buried on Mt. Herzl, as are other prominent Jewish and Zionist leaders. It is named for Theodor Herzl, the founder of modern political Zionism. Herzl's tomb lies at the top of the hill. Yad Vashem, which commemorates the Holocaust, lies to the west of Mt. Herzl. Israel's war dead are also buried there. Mount Herzl is 834 meters above sea level."}]