[{"url": "http://people.rit.edu/vvrsps/Essays/CultDiff.htm", "passage_text": "In this paper I propose to analyze the topic of cultural differences from the following perspective: It is important to make a clear distinction between the aesthetic, the moral, and the explanatory expressions of a culture in any description or categorization of cultures and civilizations. As a result, there have been some unhappy, if not absurd, manifestations of cultural chauvinism, and there are also potential dangers for the future well-being of some peoples and civilizations in such misunderstandings. Dimensions of culture. By definition, culture is what has been cultivated."}, {"url": "http://www.culturosity.com/articles/whatisculturalawareness.htm", "passage_text": "Degrees of Cultural Awa reness. There are several levels of cultural awareness that reflect how people grow to perceive cultural differences. My way is the only way-At the first level, people are aware of their way of doing things, and their way is the only way. At this stage, they ignore the impact of cultural differences. (Parochial stage). Increasing cultural awareness means to see both the positive and negative aspects of cultural differences. We are generally aware that the first step in managing diversity is recognize it and learning not to fear it. Since everyone is the product of their own culture, we need to increase both self-awareness and cross-cultural awareness."}, {"url": "http://www.academia.edu/1748463/Cross_Cultural_Understanding", "passage_text": "CROSS CULTURAL understanding By Deborah Mackin Adapted from Cultural Intelligence by Brooks Peterson he ability to work with people from other cultures is becoming increasingly necessary in our global work environment. Cross Cultural Understanding 8 CROSS CULTURAL UNDERSTANDING much better than trying to push or pull either group. It’s okay to highlight these differences, as it helps to improve understanding and communication. The process of increasing your cultural awareness is just that, a process."}, {"url": "http://www.ehow.com/about_5340260_meaning-cross-cultural.html", "passage_text": "Identification. The meaning of cross-cultural lies in the impact that culture has on an individual and his community, and the effects of this impact when different cultures are combined. The culture in which a person is raised plays a significant role in shaping his values, morals, behaviors and attitudes. "}, {"url": "http://au.reachout.com/understanding-a-different-culture", "passage_text": "One of the biggest difficulties to overcome in understanding cultural differences is making judgements based on one opinion. Do your own research and make an effort to actually learn about people instead of making broad brush statements. "}, {"url": "http://www.dimensionsofculture.com/2010/10/understanding-your-own-culture-first/", "passage_text": "Understanding Your Own Culture First. “In all affairs it’s a healthy thing now and then to hang a question mark on the things you have long taken for granted.” — Bertrand Russell. Self-reflection is crucial to the cross-cultural learning process. Without understanding that everyone has a culture, and that knowledge of one’s own culture is crucial, we have a tendency to reduce learning about culture to a manual-based approach, applying lists of dos and don’ts too rigidly and thereby stereotyping."}, {"url": "http://ucc.nd.edu/self-help/multicultural-awareness/", "passage_text": "Multicultural Awareness is a greater understanding, sensitivity, and appreciation of the history, values, experiences, and lifestyles of groups that include, but, are not limited to: 1  Race. 2  Ethnicity. 3  Gender. 4  Sexual Orientation. 5  Religious Affiliation. "}, {"url": "http://ethicsofisl.ubc.ca/?page_id=107", "passage_text": "EIESL chose theme of “Intercultural Understanding” to capture the key emerging questions, comments, and concerns arising from faculty and student dialogue sessions that focused on the considerations for effective interactions with people from different cultures. Community Voice on Intercultural Understanding. Community Voice on Intercultural Understanding “Students need to not only know the broad strokes of the culture they are coming into but they need to also understand the divisions within it and they need to go deeper than stereotypes."}, {"url": "https://en.wikipedia.org/wiki/Culture", "passage_text": "As a defining aspect of what it means to be human, culture is a central concept in anthropology, encompassing the range of phenomena that are transmitted through social learning in human societies. When used as a count noun a culture, is the set of customs, traditions and values of a society or community, such as an ethnic group or nation."}]