[{"url": "http://www.businessinsider.com/will-robots-take-our-jobs-2014-7", "passage_text": "Metropolis. It's a common dystopian sci-fi trope: the robots get better at various tasks, the humans become useless, and suddenly the world's population is unemployed (or dead) as the robots take our jobs and everything is terrible. But this simply won't happen, according to several robotics wonks and investors."}, {"url": "http://www.newyorker.com/news/news-desk/will-a-robot-take-your-job", "passage_text": "Two hundred years ago, 70 percent of American workers lived on the farm. Today automation has eliminated all but 1 percent of their jobs, replacing them (and their work animals) with machines. But the displaced workers did not sit idle. Instead, automation created hundreds of millions of jobs in entirely new fields."}, {"url": "http://www.fastcompany.com/3049079/the-future-of-work/robots-might-take-your-job-but-heres-why-you-shouldnt-worry", "passage_text": "Robot staff may already outnumber humans at some companies, but increased automation doesn't mean everyone will be out of work. By. Take a look around any workplace, and it’s hard not to see the radical transformations revolutionizing the way we work."}, {"url": "http://www.wired.com/2012/12/ff-robots-will-take-our-jobs/", "passage_text": "Let’s begin with quadrant A: jobs humans can do but robots can do even better. Humans can weave cotton cloth with great effort, but automated looms make perfect cloth, by the mile, for a few cents. The only reason to buy handmade cloth today is because you want the imperfections humans introduce."}, {"url": "http://www.newyorker.com/news/news-desk/will-a-robot-take-your-job", "passage_text": "Slowly, but surely, robots (and virtual ’bots that exist only as software) are taking over our jobs; according to one back-of-the-envelope projection, in ninety years “70 percent of today’s occupations will likewise be replaced by automation.” Should we be worried?"}, {"url": "http://www.youtube.com/watch?v=EtukhRvBFY0", "passage_text": "In a recent interview, the co-founder of Google discussed how he thinks people shouldn't work so much, and we start having robots do most of the work! Should robots be taking our jobs? Laci discusses how robots might make our lives a lot easier!"}]