[{"url": "http://www.thefreedictionary.com/albinism", "passage_text": "Noun. 1. albinism-the congenital absence of pigmentation in the eyes and skin and hair. hypopigmentation-unusual lack of skin color. birth defect, congenital abnormality, congenital anomaly, congenital defect, congenital disorder-a defect that is present at birth. Translations."}, {"url": "http://medical-dictionary.thefreedictionary.com/albinism", "passage_text": "albinism. a hereditary disorder, usually transmitted as an autosomal recessive trait, in which there is partial or total absence of pigment in the skin, hair, and eyes (oculocutaneous albinism) or in the eyes alone (ocular albinism), caused by defective or absent function of the enzyme tyrosinase. There are 10 types of the most common form of the condition, known as oculocutaneous albinism, which affects the eyes, hair, and skin. In its most severe form, hair and skin remain pure white throughout life. People with a less severe form are born with white hair and skin, which turn slightly darker as they age."}, {"url": "https://en.wikipedia.org/wiki/Albinism_in_biology", "passage_text": "Albinism in biology is the Congenital absence of any pigmentation or coloration in a person, animal or plant, resulting in white hair and pink eyes in mammals.. Varied use and interpretation of the terms means that written reports of albinistic animals can be difficult to verify. One definition states that albinism, (from the Latin albus, meaning “white”), hereditary condition characterized by the absence of pigment in the eyes, skin, hair, scales, or feathers, however, this does not encompass invertebrates, nor does it include plants."}, {"url": "http://www.medicalnewstoday.com/articles/245861.php", "passage_text": "Knowledge center. Albinism is a genetic condition also called achromia, achromasia, or achromatosis. It is characterized by a deficit in the production in melanin and by the partial or complete absence of pigment in the skin, hair and eyes. An individual with complete absence of melanin is called an albino. One with only a small amount of melanin is described as albinoid. People with albinism are very pale with fair hair and very light eyes. In some people, the eyes appear red or purple, depending on the amount of pigment."}, {"url": "http://www.audioenglish.org/dictionary/albino.htm", "passage_text": "• ALBINO (noun). The noun ALBINO has 1 sense: 1. a person with congenital albinism: white hair and milky skin; eyes are usually pink. Familiarity information: ALBINO used as a noun is very rare. "}, {"url": "http://www.merriam-webster.com/dictionary/albino", "passage_text": "Full Definition of ALBINO. : an organism exhibiting deficient pigmentation; especially: a human being that is congenitally deficient in pigment and usually has a milky or translucent skin, white or colorless hair, and eyes with pink or blue iris and deep-red pupil. — albino adjective. Definition of ALBINO for Kids. 1. : a person or an animal that has little or no coloring matter in skin, hair, and eyes. 2. : a plant with little or no coloring matter."}, {"url": "http://medical-dictionary.thefreedictionary.com/albinism", "passage_text": "Definition. Albinism is an inherited condition present at birth, characterized by a lack of pigment that normally gives color to the skin, hair, and eyes. Many types of albinism exist, all of which involve lack of pigment in varying degrees. There are 10 types of the most common form of the condition, known as oculocutaneous albinism, which affects the eyes, hair, and skin. In its most severe form, hair and skin remain pure white throughout life. People with a less severe form are born with white hair and skin, which turn slightly darker as they age."}, {"url": "http://www.merriam-webster.com/dictionary/albino", "passage_text": "Medical Definition of ALBINO. : an organism exhibiting deficient pigmentation; especially: a human being who is congenitally deficient in pigment and usually has a milky or translucent skin, white or colorless hair, and eyes with pink or blue iris and deep-red pupil—compare melano. — al·bin·ic \\-ˈbin-ik\\ adjective. Definition of ALBINO for Kids. 1. : a person or an animal that has little or no coloring matter in skin, hair, and eyes. 2. : a plant with little or no coloring matter."}, {"url": "http://www.yourdictionary.com/albino", "passage_text": "Use albino in a sentence. LINK / CITE ADD TO WORD LIST. noun. A rare albino alligator. A rare albino alligator. The definition of an albino is a living thing that has no color and a white or pale appearance. A white alligator is an example of an albino. "}]