[{"url": "https://www.quora.com/How-much-does-cocaine-cost", "passage_text": "The purity of street cocaine can be anywhere from 30-60%, probably less when amphetamines are involved. So, the average good price for decent coke in the Bay Area is about $45-65/gram, $120-180/ball and $16,000-21,000/key. Back on cutting, unless the dealer is your friend, they will tell you how good their coke is. "}, {"url": "http://www.answers.com/Q/How_much_does_a_gram_of_cocaine_cost_on_the_street", "passage_text": "A gram of cocaine typically sells for $50, $60, or $70 dollars, depending on supply and demand. USA: The cost of cocaine depends on the location you are buying it. In Columbia it costs about $2 per gram. It New zealand cocaine can cost about $700. The cut or amount of filler used. The average price for a gram in New York and LA is 60 bucks, but can be as low as 40 and as high as 70 depending on purity. In more isolated regions like rural Colorado or Minnesotta prices tend to be higher-closer to 80 or 90 dollars"}, {"url": "http://www.crackcocaineaddiction.com/Cocaine_Prices.htm", "passage_text": "Cocaine Prices. Cocaine prices in 2000 remained low and stable, suggesting a steady supply to the United States. Nationwide, wholesale cocaine prices ranged from $12,000 to $35,000 per kilogram. In most major metropolitan areas, however, the price of a kilogram of cocaine ranged from $13,000 to $25,000. Average purity for cocaine at the gram, ounce, and kilogram levels remained stable at high levels. "}, {"url": "http://www.cocaine-abuse.net/How_much_does_Cocaine_Cost.htm", "passage_text": "1 How much does cocaine cost: From January through June 2007, the mid-level wholesale (involving amounts between one and ten ounces) price per pure gram of cocaine increased 33 percent, from $53.09 to $70.39. 1 How much does cocaine cost: From January through June 2007, the retail (involving amounts up to ten grams) price per pure gram of cocaine increased 15 percent, from $145.42 to $166.90."}, {"url": "https://au.answers.yahoo.com/question/index?qid=20090525222537AAOKUNO", "passage_text": "Best Answer: The price varies depending on dealers. I'm a former cocaine user (not proud of it) so I'll try my best to help you. a gram is usually between 20-60 dollars depending on quality of cocaine. an ounce is usually around 1,000-1,400 bucks. If you buy 1/8 of a gram, usually called 8ball, it is usually around 120-150 bucks. If you buy 1/4 of a gram, it is usually 250-350 bucks. Obviously, a pound would cost a lot of money"}, {"url": "http://www.cocaine-abuse.net/How_much_does_Cocaine_Cost.htm", "passage_text": "1 How much does cocaine cost: From January through June 2007, the average price per pure gram of all domestic cocaine purchases increased 24 percent, from $95.89 to $118.70, while purity fell 11 percent, from 67 percent to 59 percent. 1 How much does cocaine cost: From January through June 2007, the retail (involving amounts up to ten grams) price per pure gram of cocaine increased 15 percent, from $145.42 to $166.90."}, {"url": "http://www.cocaine-abuse.net/How_much_does_Cocaine_Cost.htm", "passage_text": "1 How much does cocaine cost: From January through June 2007, the wholesale (involving amounts of one kilogram or more) price per pure gram of cocaine increased 11 percent, from $20.85 to $23.04. 1 How much does cocaine cost: From January through June 2007, the retail (involving amounts up to ten grams) price per pure gram of cocaine increased 15 percent, from $145.42 to $166.90."}, {"url": "http://www.answers.com/Q/How_much_does_cocaine_cost", "passage_text": "1 A gram of cocaine, which is usually a pretty standard amount to buy will run anywhere between 55-65 bucks depending on who you get it from and how good the cocaine is. 2  The cost of coke varies with the quality. 3  Usual price for middle scale is 50 or 60 a gram and and 8 ball can go anywhere from 150 to 200. In the United States, depending on supply, demand, and the quality of the product, cocaine is usually sold for $40, $50, $60, or $70 a gram."}, {"url": "http://www.havocscope.com/black-market-prices/cocaine-prices/", "passage_text": "See additional information about Cocaine Addiction. Cocaine Measurements: The price of cocaine listed below is shown as how much a gram of cocaine costs. 1,000 grams is equal to 1 kilogram. When converting grams to pounds, one pound of cocaine is equal to 453.592 grams. One pound of cocaine is equal to 16 ounces of cocaine. 1 ounce is equal to 28.34 grams. "}]