[{"url": "http://www.businessdictionary.com/definition/commercial-lease.html", "passage_text": "Definition. Agreement between a landlord and a business outlining terms and conditions of property rental. A commercial lease is specific to renters using the property for business or other commercial purposes versus residential use."}, {"url": "https://en.wikipedia.org/wiki/Lease", "passage_text": "Broadly put, a lease agreement is a contract between two parties, the lessor and the lessee. The lessor is the legal owner of the asset, the lessee obtains the right to use the asset in return for rental payments. The narrower term rental agreement can be used to describe a lease in which the asset is tangible property. Language used is that the user rents the land or goods let or rented out by the owner. The verb to lease is less precise because it can refer to either of these actions."}, {"url": "http://www.uslegalforms.com/commercialleases/", "passage_text": "1 A commercial gross lease is a lease in which a lessee pays only rent and the landlord pays property taxes, insurance and maintenance charges. 2  Gross lease agreements can be modified to suit a tenant's multiple needs. Commercial leases are generally of two types: net lease and gross lease: 1  Net lease is when tenants pay an extra amount in addition to office rent as part payment of the commercial lease properties' expenses such as maintenance, taxes, insurance, and utilities."}, {"url": "https://legalvision.com.au/retail-commercial-lease/", "passage_text": "A retail commercial lease, also known as a retail lease, is a legally binding contract that spells out the rights and responsibilities of a tenant and landlord in respect to retail premises. "}, {"url": "http://www.lawdepot.com/contracts/commercial-lease-agreement/?loc=US", "passage_text": "A commercial lease is a binding contract which allows a tenant the right to use the landlord’s property for a business or commercial activity in exchange for rent. Additionally, the lease outlines the rights and responsibilities of the landlord and tenant during the lease term. Generally, a commercial lease covers the landlord and tenant information, which can include a guarantor; the rent; the duration of the lease term; and any pertinent information which constitutes as a term of the lease."}, {"url": "http://www.uslegalforms.com/commercialleases/", "passage_text": "A real estate commercial lease is an agreement for use of a space for business purposes in return for an amount agreed to be payable as rent. The person who owns the property for rent is called a lessor and the person who leases the property is called a lessee. Commercial leases are generally of two types: net lease and gross lease: 1  Net lease is when tenants pay an extra amount in addition to office rent as part payment of the commercial lease properties' expenses such as maintenance, taxes, insurance, and utilities."}, {"url": "https://legalvision.com.au/what-is-a-commercial-lease/", "passage_text": "Back to Leasing/Loans. A commercial lease is a document that sets out the rights and obligations of the owner of a commercial property (known as the landlord or lessor) and a third party that has agreed to occupy the property (known as the tenant or lessee). Commercial leases are generally entered into for a period of 3 to 25 years, which includes an initial term and options for the tenant to renew the lease. For example, a 25 year lease would usually be for an initial term of 5 to 10 years followed by successive options of 5 to 10 years each."}, {"url": "http://www.nolo.com/legal-encyclopedia/commercial-lease-basics-29934.html", "passage_text": "1 Many commercial leases are not based on a standard form or agreement; each commercial lease is customized to the landlord's needs. 2  As a result, you need to carefully examine every commercial lease agreement offered to you. 3  Long-term and binding. 1 As a result, you need to carefully examine every commercial lease agreement offered to you. 2  Long-term and binding. 3  You cannot easily break or change a commercial lease. 4  It is a legally binding contract, and a good deal of money is usually at stake."}, {"url": "http://www.lawdepot.com/contracts/commercial-lease-agreement/?loc=US", "passage_text": "A Commercial Lease Agreement is a contract used when renting business property to or from another individual or company. It gives the tenant (or renter) the right to use the property for business purposes during the term of the lease in exchange for payment to the landlord. Generally, a commercial lease covers the landlord and tenant information, which can include a guarantor; the rent; the duration of the lease term; and any pertinent information which constitutes as a term of the lease."}, {"url": "https://en.wikipedia.org/wiki/Lease", "passage_text": "A lease is a contractual arrangement calling for the lessee (user) to pay the lessor (owner) for use of an asset. The narrower term rental agreement can be used to describe a lease in which the asset is tangible property. Language used is that the user rents the land or goods let or rented out by the owner. The verb to lease is less precise because it can refer to either of these actions."}]