[{"url": "http://www.ied.edu.hk/apfslt/v8_issue2/lingy/index.htm", "passage_text": "The purpose of this study is to examine, in a systematic manner, the effectiveness of concept mapping as a revision tool in enhancing pupils' learning and understanding of primary science concepts."}, {"url": "http://www.kiasuparents.com/kiasu/content/how-teach-primary-school-science", "passage_text": "In fact, nowadays, schools are even introducing simple science concepts through their thematic teaching of English at P1 and P2. So for us parents, we need to support the school and our children prior to P3, where the teaching of Science as a subject starts."}, {"url": "http://scienceonline.tki.org.nz/What-do-my-students-need-to-learn/Building-Science-Concepts", "passage_text": "Building Science Concepts. This series of 64 books published by the Ministry of Education is designed to help primary teachers build students’ science concepts in the contextual strands. You can:"}, {"url": "http://www.readingrockets.org/article/introducing-science-concepts-primary-students-through-read-alouds-interactions-and-multiple", "passage_text": "By: Natalie Heisey, Linda Kucan. This study of first and second graders looked at teacher-led read-alouds as a way to introduce science concepts. Results suggest that multiple exposures to a related concept across different stories gave students more time to build a mental representation of important ideas."}, {"url": "http://www2.ed.gov/pubs/parents/Science/Concepts.html", "passage_text": "Concepts. 1  Organization. 2  Scientists have made the study of science manageable by organizing and classifying natural phenomena. 3  For example, natural objects can be assembled in hierarchies (atoms, molecules, mineral grains, rocks, strata, hills, mountains, and planets)."}, {"url": "http://www.readingrockets.org/article/introducing-science-concepts-primary-students-through-read-alouds-interactions-and-multiple", "passage_text": "An investigation of using read-alouds to introduce science concepts. The study described here attempted to use readalouds to introduce children to national science education standards related to science as inquiry and as a human endeavor."}, {"url": "http://www.nuffieldfoundation.org/primary-science-and-space", "passage_text": "Nuffield Primary Science is a set of curriculum materials published by Collins in 1995. The materials are now out of print but are still widely available in school and college libraries. You can also download the materials from the National STEM Centre archive."}, {"url": "http://www.leeds.ac.uk/educol/documents/000000056.htm", "passage_text": "We surveyed the science lessons of thirty-three teachers with different backgrounds, teaching older children in the primary school (Key Stage 2: 7+ to 10+ years), and found forms of lessons which exemplified these approaches (figure 1)."}]