[{"url": "http://www.healthline.com/human-body-maps/female-chest-muscles", "passage_text": "The major muscle in the chest is the pectoralis major. This large fan-shaped muscle stretches from the armpit up to the collarbone and down across the lower chest region on both sides of the chest. Injuries to this muscle are rare, but symptoms include pain in the chest, bruising, and decreased strength of the muscle. The pectoralis minor resides under the pectoralis major. This thin triangle-shaped muscle runs up and down along the upper ribs. The major muscles in the upper torso of the body include:"}, {"url": "http://healthyliving.azcentral.com/tighten-up-muscles-between-armpits-back-1439.html", "passage_text": "The muscles located between your armpits and back are called the latissimus dorsi. This muscle runs all the way from your chest to the middle of your back, one on each side. To tighten this muscle, you can perform a number of strength training exercises that will make the muscle thicker and harder."}, {"url": "http://www.livestrong.com/video/1008144-tighten-up-muscles-between-armpits-back/", "passage_text": "Hi, my name is Liza. And today, we're going to talk about how to tighten the muscles between the armpits and the back. The armpit muscles are called the lats. And this is an important area because they help aid in shoulder movement and rotation. And they help also support us in our posture, in our upper back. To engage the lats, take the left arm up at a right angle. "}, {"url": "http://www.shapefit.com/questions/exercise-questions-armpit-chest-development.html", "passage_text": "The region where the chest comes in contact with the arms and forms the armpit is a complex anatomical structure that contains the shoulder joint and large muscles attached to it, such as the chest muscle (pectoralis), the deltoid muscle and the biceps. The back of the arm also contains the triceps. The described area where toning and development is desired is actually located at the separation between the chest muscle and the anterior portion (front) deltoid muscle. The biceps prominence is also located in the armpit region when you hold your arm closer to your body. Doing push-ups is a good way to stimulate your chest, but most people forget that it’s actually predominantly a triceps exercise when performed with your elbows in towards your body. The tricep muscle is located on the back of the arm."}, {"url": "http://www.cancer.ca/en/cancer-information/cancer-type/breast/anatomy-and-physiology/?region=on", "passage_text": "Each breast lies over a muscle of the chest called the pectoral muscle. The female breast covers a fairly large area. It extends from just below the collarbone (clavicle), to the armpit (axilla) and across to the breastbone (sternum). "}, {"url": "http://www.livestrong.com/article/262940-a-pulled-muscle-in-the-armpit/", "passage_text": "The armpit area houses many converging muscles, any of which may be injured by muscle strain. Common movements in tennis, baseball, basketball and weightlifting all employ strenuous use of the latissimus dorsi, teres major, teres minor and adjacent muscles that serve the arm and shoulder. "}, {"url": "http://www.innerbody.com/anatomy/muscular/upper-torso", "passage_text": "In addition to moving the arm and pectoral girdle, muscles of the chest and upper back work together as a group to support the vital process of breathing. The diaphragm is a strong, thin, dome-shaped muscle that spans the entire inferior border of the rib cage, separating the thoracic cavity from the abdominal cavity. The muscles of the chest and upper back occupy the thoracic region of the body inferior to the neck and superior to the abdominal region and include the muscles of the shoulders."}, {"url": "http://healthyliving.azcentral.com/exercises-place-emphasis-armpit-area-2073.html", "passage_text": "Sometimes it's not the legs, chest or arms but the small, detailed areas of the body that are most appealing. The armpit area is one of those areas, and it actually contains three main muscles: the teres major, teres minor and latissimus dorsi. The teres major is right under your shoulder, covering the smaller teres minor muscle; the latissimus dorsi extends from your back to your chest, wrapping around the underarm area. "}]