[{"url": "https://www.dmv.org/tx-texas/car-registration.php", "passage_text": "Now you're ready to register your car. Arrive at your local County Tax Office with: 1  Proof of car insurance. 2  Proof of your vehicle passing a safety inspection. 3  Proof that you own the vehicle (registration or title from previous state). 4  A completed Application for Texas Certificate of Title (Form 130-U). To register, visit your local County Tax Office and: 1  Provide proper identification. 2  Provide proof of car insurance. 3  Complete an Application for Texas Certificate of Title (Form 130-U). 4  This form handles titling and registration. 5  Provide a Certificate of Inspection, if applicable."}, {"url": "http://www.dmv.org/car-registration.php", "passage_text": "Vehicle Registration. After you buy a car, you'll need to register it with your local Department of Motor Vehicles (DMV), Secretary of State (SOS), Department of Revenue (DOR), Motor Vehicle Division (MVD), or other local entity that sets vehicle regulations in your state. If someone is asking for your vehicle registration number, they are probably referring to your Vehicle Identification (VIN) number. Before you can register your car, your vehicle will likely need to: 1  Have a title in your name. 2  Pass an emissions test or smog check. 3  Pass a vehicle safety inspection"}, {"url": "https://www.dmv.org/tx-texas/car-registration.php", "passage_text": "After purchasing a vehicle, you have 30 days to have it inspected and registered with the TX DMV. To register, visit your local County Tax Office and: 1  Provide proper identification. 2  Provide proof of car insurance. 3  Complete an Application for Texas Certificate of Title (Form 130-U). 4  Provide a Certificate of Inspection, if applicable. 5  Pay the registration fees (fees vary by county and vehicle type). To register, visit your local County Tax Office and: 1  Provide proper identification. 2  Provide proof of car insurance. 3  Complete an Application for Texas Certificate of Title (Form 130-U). 4  This form handles titling and registration. 5"}, {"url": "http://www.wikihow.com/Register-a-Vehicle-After-Moving", "passage_text": "Find out how soon after you move that you need to register your car. This varies by state. For example, in Tennessee you must register your car within 30 days. In New Jersey, you have 60 days and in California, it's 20 days. You also need to register your car, if you own and drive one. Each state has its own rules and regulations regarding how soon a car must be registered and what documentation is required to complete the process."}, {"url": "http://txdmv.gov/motorists/new-to-texas", "passage_text": "You have 30 days from the time you move here to register your vehicle in the state. To learn how, follow the steps below. In no time at all, we will be proud to call you a Registered Texan! To stay up-to-date on all things Registered Texan follow us on Facebook. Bring your insurance card. In Texas, you must show you have insurance coverage for a minimum of $30,000 per injured person, up to a total of $60,000 for everyone injured in an accident, and $25,000 for property damage."}, {"url": "http://txdmv.gov/motorists/new-to-texas", "passage_text": "The state portion of your vehicle's inspection fee may be due at this time. As a new resident, you also will pay sales tax-related fees required by the state's Comptroller of Public Accounts. Sales tax fees on a vehicle can be $90 or the difference between your previous state's sales tax and the Texas sales tax. Bring your insurance card. In Texas, you must show you have insurance coverage for a minimum of $30,000 per injured person, up to a total of $60,000 for everyone injured in an accident, and $25,000 for property damage."}]