[{"url": "http://www.thyroid.org/thyroid-function-tests/", "passage_text": "Tests to evaluate thyroid function include the following: TSH TESTS The best way to initially test thyroid function is to measure the TSH level in a blood sample. A high TSH level indicates that the thyroid gland is failing because of a problem that is directly affecting the thyroid (primary hypothyroidism). The major thyroid hormone secreted by the thyroid gland is thyroxine, also called T4 because it contains four iodine atoms. To exert its effects, T4 is converted to triiodothyronine (T3) by the removal of an iodine atom."}, {"url": "http://www.nhs.uk/Conditions/Thyroid-under-active/Pages/Diagnosis.aspx", "passage_text": "Thyroid function test. A blood test measuring your hormone levels is the only accurate way to find out whether there's a problem. The test, called a thyroid function test, looks at levels of thyroid-stimulating hormone (TSH) and thyroxine (T4) in the blood."}, {"url": "http://btf-thyroid.org/information/leaflets/34-thyroid-function-tests-guide", "passage_text": "The usual blood tests done for thyroid function are TSH, T4 and sometimes T3. A blood sample is taken from a vein in the arm and sent off to the laboratory for analysis. Usually the ‘free’ or active portion of T4 and T3 is measured (i.e., FT4 and FT3). "}, {"url": "http://www.healthline.com/health/thyroid-function-tests", "passage_text": "If your thyroid gland produces too many hormones, you may experience weight loss, high levels of anxiety, tremors, and a sense of being on a “high.” This is called “hyperthyroidism.”. Thyroid function tests are a series of blood tests used to measure how well your thyroid gland is working. The T4 test is known as the thyroxine test. The TSH test measures the level of thyroid-stimulating hormone in your blood. These are the two most common thyroid function tests and are usually ordered together. They are routinely performed on newborn babies to identify a low-functioning thyroid gland"}, {"url": "http://patient.info/health/thyroid-function-tests-leaflet", "passage_text": "24. Thyroid function tests are blood tests which help to check the function of the thyroid gland. They are mainly used to detect hypothyroidism (underactive thyroid) and hyperthyroidism (overactive thyroid). Note: the information below is a general guide only. These tests may help doctors to find a specific cause of the low TSH. Thyroid function tests are usually done to find out whether the thyroid gland is working properly. This is mainly to diagnose underactive thyroid (hypothyroidism) and overactive thyroid (hyperthyroidism)."}, {"url": "http://www.webmd.com/women/thyroid-stimulating-hormone-tsh", "passage_text": "Guide. A thyroid-stimulating hormone (TSH) blood test is used to check for thyroid gland problems. TSH is produced when the hypothalamus releases a substance called thyrotropin-releasing hormone (TRH). TRH then triggers the pituitary gland to release TSH. Thyroid-Stimulating Hormone (TSH). "}, {"url": "http://www.webmd.com/women/thyroid-hormone-tests", "passage_text": "Guide. Thyroid hormone tests are blood tests that check how well the thyroid gland is working. The thyroid gland makes hormones that regulate the way the body uses energy. The thyroid gland is a butterfly-shaped gland that lies in front of your windpipe (trachea), just below your voice box (larynx). Thyroid hormone tests are done to: 1  Find out what is causing an abnormal thyroid-stimulating hormone (TSH) test. 2  Check how well treatment of thyroid disease is working. 3  Screen newborns to find out if the thyroid gland function is normal."}, {"url": "https://en.wikipedia.org/wiki/Thyroid_function_tests", "passage_text": "Thyroid function tests (TFTs) is a collective term for blood tests used to check the function of the thyroid. It is the most sensitive test for thyroid hormone function. TSH is produced in the pituitary gland. The production of TSH is controlled by TRH, which is produced in the hypothalamus."}]