[{"url": "https://en.wikipedia.org/wiki/Eastern_White_Pine", "passage_text": "Pinus strobus is found in the Nearctic Temperate broadleaf and mixed forests Biome of eastern North America. It prefers well-drained soil and cool, humid climates, but can also grow in boggy areas and rocky highlands. In mixed forests, this dominant tree towers over all others, including the large broadleaf hardwoods. This is the largest collection of 45 m (148 ft) tall eastern white pines in New England. The Jake Swamp Tree located here is 51.54 m (169.1 ft) tall. It is the tallest accurately measured tree of any species within New England. Precise measurements are maintained on this tree by NTS."}, {"url": "http://www.fcps.edu/islandcreekes/ecology/eastern_white_pine.htm", "passage_text": "Like all pine trees, this tree is evergreen, so it keeps its leaves (needles) year-round. Pine needles are in small clumps of five, and each one grows up to five inches long. Eastern White Pine has small yellow cones as flowers. The fruits of this tree are large brown pine cones, four to eight inches long. Each cone has two small seeds in it. OPLIN The bark of Eastern White Pine is gray and smooth when the tree is young, and becomes rougher and furrowed (deep wrinkles) as it gets older. Each cone has two small seeds in it. OPLIN."}, {"url": "http://www.na.fs.fed.us/pubs/silvics_manual/Volume_1/pinus/strobus.htm", "passage_text": "The bark of white pine is used as an astringent and an expectorant, and the wood has been used to produce white pine tar, which is used as an antiseptic, expectorant, and protective (38). White pine wood has medium strength, is easily worked, and stains and finishes well. The climate over the range of white pine is cool and humid. The distribution of white pine coincides reasonably with that part of eastern North America where the July temperature averages between 18° and 23° C (65° and 74° F)."}, {"url": "https://en.wikipedia.org/wiki/White_Pine,_Tennessee", "passage_text": "White Pine is a town in Hamblen and Jefferson counties in the U.S. state of Tennessee. It is part of the Morristown, Tennessee Metropolitan Statistical Area. The population was 2,196 at the 2010 census. History [edit]. European settlers first arrived in what is now White Pine in the 1780s. The community, originally known as Dandridge Crossing, did not become a town until after the Civil War, when a railroad route was constructed in the area."}, {"url": "http://www.dnr.state.mn.us/treecare/whitepine/whereplant.html", "passage_text": "White pine occurs and grows well on a wide range of soil types and textures. White pine is more tolerant of wetter conditions than red or jack pine, but less tolerant of dry conditions. "}, {"url": "http://www.na.fs.fed.us/pubs/silvics_manual/Volume_1/pinus/strobus.htm", "passage_text": "Trees in pure second-growth stands of white pine are noted for their limbiness. The limbs live for about 15 years and persist on the trunk for more than 25 years after they die. In the first log of these stands, there is an average of about 60 limbs (71). Pruning has been recommended to increase quality production. The climate over the range of white pine is cool and humid. The distribution of white pine coincides reasonably with that part of eastern North America where the July temperature averages between 18° and 23° C (65° and 74° F)."}, {"url": "https://edis.ifas.ufl.edu/st473", "passage_text": "Eastern white pine has soft blue-green needles borne in groups of five although foliage color varies greatly from one tree to the next. It is the state tree of Maine and Missouri. Some specimens keep the bluish color throughout the winter, others loose it. White pine weevil is probably the biggest problem. The larvae of white pine weevils feed on the sapwood of the leaders and this is devastating to the tree. The leader is killed and the many shoots replacing it form a bushy head. First symptoms are pearl white drops of resin on the leaders."}, {"url": "http://www.oplin.org/tree/fact%20pages/pine_white/pine_white.html", "passage_text": "White Pine (Eastern White Pine) Pinus strobus. This is the largest conifer in the northeastern United States. The tallest of these trees in Ohio is a 137-foot giant in Ashland County. The bark on young trees is smooth and gray, while on older trees it is broken into small rectangular blocks. "}, {"url": "http://tinytimbers.com/specie_wpine.htm", "passage_text": "Lightweight, soft, even-textured and easily worked, White Pine is the least resinous of all pines. Straight grained with a fine, uniform texture. Creamy white, pale yellow or light brown heartwood and creamy white sapwood. Acquires an amber patina with age. Pine Logs are susceptible to fungus discoloration. Eastern White Pine, Northern Pine, Weymouth Pine. History. Until 1860 the Eastern white pine formed vast forests in the northeastern U.S. and was intimately associated with New England. What was once a seemingly endless supply of timber was used for the construction of houses, barns and stables."}]