[{"url": "https://en.wikipedia.org/wiki/Eastern_world", "passage_text": "Other than Asia and some parts of Africa, Europe has successfully absorbed almost all of the societies of Oceania, the Americas and the Caribbean into the Western world, but not to the degree that they are considered a part of Europe as is the case with Asia."}, {"url": "http://www.livescience.com/21478-what-is-culture-definition-of-culture.html", "passage_text": "Culture is the characteristics and knowledge of a particular group of people, defined by everything from language, religion, cuisine, social habits, music and arts."}, {"url": "http://www.everyculture.com/Africa-Middle-East/Introduction-to-the-Middle-East.html", "passage_text": "The term Middle East is generally recognized today to refer to a region that stretches from the Atlantic Ocean in the west to Afghanistan in the east, a distance of approximately 5,600 kilometers."}, {"url": "http://www.livescience.com/21478-what-is-culture-definition-of-culture.html", "passage_text": "While Spain and Portugal are on the European continent, they are considered the key influencers of what is known as Latin culture, which denotes people using languages derived from Latin, also known as Romance languages. The El-Deir Monastery at Petra, Jordan, is an example of traditional Middle Eastern culture."}, {"url": "http://www.pbs.org/wgbh/globalconnections/mideast/themes/culture/", "passage_text": "Culture: Family, city, and the globe. The family is an important part of culture in the Middle East, as is evident in the Arabic honorific names that are often used in preference to given names. A man may be called Ibn (son of) followed by his father's name or Abu (father of) followed by his child's name."}, {"url": "http://www.livescience.com/21478-what-is-culture-definition-of-culture.html", "passage_text": "Eastern culture generally refers to the societal norms of countries in Far East Asia (including China, Japan, Vietnam, North Korea and South Korea) and the Indian subcontinent."}, {"url": "http://www.livescience.com/21478-what-is-culture-definition-of-culture.html", "passage_text": "Thus, it can be seen as the growth of a group identity fostered by social patterns unique to the group. The word culture derives from a French term, which in turn derives from the Latin colere, which means to tend to the earth and grow, or cultivation and nurture."}, {"url": "https://en.wikipedia.org/wiki/Eastern_world", "passage_text": "An image of the Eastern world defined as Asia. The term Eastern world refers very broadly to the various cultures or social structures and philosophical systems of Asia or geographically the countries and cultures east of Europe."}, {"url": "https://simple.wikipedia.org/wiki/Eastern_world", "passage_text": "The term Eastern world means very broadly the various cultures or social structures and philosophical systems of Eastern Asia or geographically the Eastern Culture."}]