[{"url": "http://fdb.rxlist.com/drugs/drugreview-156198-Theralith+XR+Oral.aspx?drugid=156198&drugname=Theralith+XR+Oral", "passage_text": "Comment: After suffering 10 kidney stones within an 18 month period my urologist gave me a 30 day sample of TheraLith XR and suggested that I continue taking them (2 tablets, twice daily)for 90 days to see if they made a difference. TheraLith XR is an over the counter, non-narcotic and considered a supplement. It is an ...extended-release magnesium, potassium citrate, vitamin B 6 supplement formulated to support and maintain normal urine chemistry (http://www.theralogix.com/index.cfm?fa=products. At one point, I was producing 1-2 stones a year...many emergency room visits, litho treatments as well as numerous surgeries. About 7 years ago, my urologist suggested Theralith XR. At the time, he indicated that it might take up to 5 years of taking this (on a regular basis) for us to know whether it was effective. ..."}, {"url": "http://www.webmd.com/drugs/2/drug-156198/theralith-xr-oral/details", "passage_text": "If overdose is suspected, contact a poison control center or emergency room immediately. US residents can call their local poison control center at 1-800-222-1222. Canada residents can call a provincial poison control center. In the US -. Call your doctor for medical advice about side effects. You may report side effects to FDA at 1-800-FDA-1088. In Canada-"}, {"url": "http://www.webmd.com/drugs/drugreview-156198-Theralith+XR+Oral.aspx?drugid=156198&drugname=Theralith+XR+Oral", "passage_text": "About 7 years ago, my urologist suggested Theralith XR. At the time, he indicated that it might take up to 5 years of taking this (on a regular basis) for us to know whether it was effective. ... Show Full Comment. Comment: I have been producing calcium oxalate stones on a regular basis for 35 years."}, {"url": "http://www.theralogix.com/index.cfm?fa=products.theralithxr.default&dvsn=urology", "passage_text": "TheraLith ® XR. Our extended-release magnesium, potassium citrate, and vitamin B6 supplement formulated to support and maintain normal urine chemistry.*. TheraLith XR includes automatic refills timed to arrive just before you run out. The auto-refill program includes free delivery. The formulation of TheraLith XR is overseen by an advisory board of leading academic physicians and scientists, so it is based on the latest scientific evidence to ensure the right nutrients at the right dosage for optimal effect."}, {"url": "http://www.theralogix.com/index.cfm?fa=products.theralithxr.default&dvsn=urology", "passage_text": "TheraLith XR is an extended-release vitamin and mineral supplement designed to support and maintain normal urine chemistry.* The formulation of TheraLith XR is overseen by an advisory board of leading academic physicians and scientists. The formulation of TheraLith XR is overseen by an advisory board of leading academic physicians and scientists, so it is based on the latest scientific evidence to ensure the right nutrients at the right dosage for optimal effect."}, {"url": "http://www.urologystore.com/nutritional-supplements/theralithxr", "passage_text": "Quantity TheraLith XR is an extended-release vitamin and mineral supplement designed to support and maintain normal urine chemistry.* The formulation of TheraLith XR is overseen by an advisory board of leading academic physicians and scientists. In a group of individuals with low baseline levels of magnesium and citrate, increases of over 300% were seen after taking TheraLith XR for 2 months. All trial participants tolerated TheraLith XR well, with no side effects."}, {"url": "http://www.theralogix.com/index.cfm?fa=products.theralithxr.default&dvsn=urology", "passage_text": "Individuals should take TheraLith XR with food and try to drink at least 8 to 10 glasses of fluid per day. TheraLith XR should ideally be used under the supervision of a healthcare provider, as part of a comprehensive diet and lifestyle program designed to support normal urine chemistry.*. The formulation of TheraLith XR is overseen by an advisory board of leading academic physicians and scientists, so it is based on the latest scientific evidence to ensure the right nutrients at the right dosage for optimal effect."}, {"url": "http://www.webmd.com/drugs/drugreview-156198-Theralith+XR+Oral.aspx?drugid=156198&drugname=Theralith+XR+Oral", "passage_text": "Comment: After suffering 10 kidney stones within an 18 month period my urologist gave me a 30 day sample of TheraLith XR and suggested that I continue taking them (2 tablets, twice daily)for 90 days to see if they made a difference. TheraLith XR is an over the counter, non-narcotic and considered a supplement. It is an ...extended-release magnesium, potassium citrate, vitamin B 6 supplement formulated to support and maintain normal urine chemistry (http://www.theralogix.com/index.cfm?fa=products. At the time, he indicated that it might take up to 5 years of taking this (on a regular basis) for us to know whether it was effective. ... Show Full Comment. Comment: I have been producing calcium oxalate stones on a regular basis for 35 years."}, {"url": "http://www.theralogix.com/index.cfm?fa=products.theralithxr.default&dvsn=urology", "passage_text": "Our extended-release magnesium, potassium citrate, and vitamin B6 supplement formulated to support and maintain normal urine chemistry.*. TheraLith XR includes automatic refills timed to arrive just before you run out. The formulation of TheraLith XR is overseen by an advisory board of leading academic physicians and scientists, so it is based on the latest scientific evidence to ensure the right nutrients at the right dosage for optimal effect."}]