[{"url": "http://reformmovements1800s.weebly.com/temperance-movement.html", "passage_text": "TEMPERANCE MOVEMENT. Alcohol abuse was common in the early 1800s, especially in the West and among urban workers. Reformers blamed alcohol for poverty, the breakup of families, and crime. They called for temperance, drinking little or no alcohol. Temperance crusaders used lectures, pamphlets, and revival-style rallies to warm people of the dangers of alcohol. The movement gained a major victory in 1851, when Maine passed a law banning the manufacture and sale of alcoholic beverages. "}, {"url": "https://en.wikipedia.org/wiki/The_temperance_movement_in_the_United_States", "passage_text": "The Temperance movement in the United States was a movement to curb the consumption of alcohol and had a large influence on American politics and society in the nineteenth and twentieth centuries. The Drunkard's Progress: A lithograph by Nathaniel Currier supporting the temperance movement, January 1846. In Washington DC the Temperance Fountain was donated to the city in 1882 by Temperance crusader Henry D. Cogswell. This fountain was one of a series of fountains he designed and commissioned in a belief that easy access to cool drinking water would keep people from consuming alcohol."}, {"url": "http://www.answers.com/Q/What_was_the_movement_to_ban_alcohol_called", "passage_text": "The reform movement that wanted to ban alcohol is known as  Prohibition. It had success in the U.S. in the 1920s, with an  amendment to the Constitution prohibiting alcohol, … but the  amendment was later appealed in 1933. "}, {"url": "http://www.indiana.edu/~engs/articles/letjsa.htm", "passage_text": "The purpose of this letter is to briefly present some hypotheses for debate. I propose that there are signs that suggest a cresting of the current anti-alcohol movement, and that prohibition of alcohol for those under 21 years of age has done little to decrease negative alcohol-related behaviors in this age group. As was found in the earlier anti-alcohol movements, alcohol again became demonized. Alcohol consumption, the alcohol beverage industry and even individuals who advocated moderate drinking were seen as not respectable. Some health-related organizations even eliminated the cocktail hour at annual conferences."}, {"url": "http://www.sparknotes.com/testprep/books/sat2/history/chapter9section2.rhtml", "passage_text": "The production and consumption of alcohol in the United States rose markedly in the early 1800s. The temperance movement emerged as a backlash against the rising popularity of drinking. Founded in 1826, the American Temperance Society advocated total abstinence from alcohol. The position of American women in the early 1800s was legally and socially inferior to men. Women could not vote and, if married, could not own property or retain their own earnings. The reform movements of the 1830s, specifically abolition and temperance, gave women a chance to get involved in the public arena. Women reformers soon began to agitate not just for temperance and abolition, but also for women’s rights"}, {"url": "https://quizlet.com/8876524/ch-11-society-culture-and-reform-1820-1860-flash-cards/", "passage_text": "temperance. The movement to stop consumption of alcohol because it was thought to be the cause of social ills. This was relatively easy to understand, given the high rate of alcohol consumption (5 gallons of hard liquor per person in 1820). This was the most popular of the reform movements"}, {"url": "http://glencoe.com/sec/socialstudies/ose/tar05_nat/docs/chap14.pdf", "passage_text": "Lyman Beecher, a Connecticutminister and crusader against the use of alcohol,wanted to protect society against “rum-selling,tippling folk, infidels, and ruff-scruff.”Reformers blamed alcohol for poverty, thebreakup of families, crime, and even insanity.They called for temperance, drinking little or noalcohol. They believed the nation should live up to thenoble goals stated in the Declaration of Independence and the Constitution.The spirit of reform brought changes to American religion, politics, educa-tion, art, and literature."}, {"url": "https://iantyrrell.wordpress.com/alcohol-prohibition-in-the-usa/", "passage_text": "It is important to realise that the alcohol prohibition movement had a long nineteenth-century background. Prohibition had been introduced on the state level in the northern states in the 1850s—though the state legislatures repealed these laws during the period 1855-1865. The 1900-1917 period was one of social reform known as Progressivism, and Progressives believed that, through alcohol, other social habits or evils such as prostitution and gambling flourished in association with saloons."}, {"url": "http://glencoe.com/sec/socialstudies/ose/tar05_nat/docs/chap14.pdf", "passage_text": "410 The Age of Reform 1820–1860 Why It Matters The idea of reform—the drive to improve society and the lives of Americans—grewduring the mid-1800s. Reformers set out to improve the lives of the disadvantaged,especially enslaved people and the urban poor. They believed the nation should live up to thenoble goals stated in the Declaration of Independence and the Constitution.The spirit of reform brought changes to American religion, politics, educa-tion, art, and literature."}]