[{"url": "https://en.wikipedia.org/wiki/Mammoth_Cave_National_Park", "passage_text": "Mammoth Cave National Park is a U.S. National Park in central Kentucky, encompassing portions of Mammoth Cave, the longest cave system known in the world. The official name of the system is the Mammoth-Flint Ridge Cave System for the ridge under which the cave has formed. The park was established as a national park on July 1, 1941. It became a World Heritage Site on October 27, 1981, and an international Biosphere Reserve on September 26, 1990."}, {"url": "http://www.answers.com/Q/The_longest_cave_system_in_the_world_is_in_the_US_state_of", "passage_text": "Kentucky. the roaring sea horse that lives in a kelp forest cave system, china (also known as the sao-faung system) What is the world's longest cave? Respuesta: Mammoth Cav … e System in USA (Kentucky) with 370.000 lenght miles. "}, {"url": "http://www.uky.edu/KGS/education/mammothcave.htm", "passage_text": "Not only is the cave the longest in the world, but cave mappers believe the cave system will eventually prove to be 560 miles (900 km) long! Mammoth Cave was formed in Mississippian-age limestone rock. The cave is 379 feet (118 m) deep, and contains at least 5 levels of passages. For all its magnitude, it should be remembered that Mammoth Cave is only one of many large caves in Kentucky. Kentucky is home to another 14 of the longest caves in the world. Prior to 1983, it was 3, but the 50 mile (80 km) long Roppel Cave System was connected to Mammoth Cave and removed from the list. The Fisher Ridge cave system currently ranks seventh on the world list, with a total length of 112 miles (180 km)"}, {"url": "http://www.einfopedia.com/longest-or-largest-cave-top-ten-longest-caves-of-the-world.php", "passage_text": "Mammoth cave system is the largest or longest natural cave system in the world as well as in North America or USA. Situated in Kentucky, USA, this longest cave having 567 km of length. It is centered around the Green River, with a tributary and with 145 miles of passageways. Siebenhengsteholen-system is the longest or biggest cave system of Switzerland, while sixth longest cave of the world with 140 km length. It is famous for its unusual greenery. It presents the most amazing natural scenery with its green routs and vegetation. Fisher Ridge Cave system was discovered in 1981."}, {"url": "http://www.einfopedia.com/longest-or-largest-cave-top-ten-longest-caves-of-the-world.php", "passage_text": "Wind Cave is one of the world’s longest caves. It is located in South Dakota (USA). It is 126 kilometers long therefore it is regarded as the eigth longest or largest cave in the world and fifth longest in United States Of America. Ozernay it is a small shield volcano located in the southern part of Ukraine. Siebenhengsteholen-system is the longest or biggest cave system of Switzerland, while sixth longest cave of the world with 140 km length. It is famous for its unusual greenery. It presents the most amazing natural scenery with its green routs and vegetation. Fisher Ridge Cave system was discovered in 1981."}, {"url": "http://www.epinions.com/review/park-Parks-All-KY-Mammoth_Cave_National_Park/22333921/85955153540", "passage_text": "Cons: Some caves require much physical exertion and some are costly. Located in central Kentucky, Mammoth Cave National Park is the largest known cave system in the world, with more than 336 miles of underground caves that have been explored and mapped. This area was designated as a National Park in 1941. Mammoth Cave can be described in one word: Massive! It&#146s the world&#146s largest cave system and it&#146s continuously growing each and every year. Even today, there are miles and miles of cave passages that have still not"}, {"url": "https://en.wikipedia.org/wiki/Mammoth_Cave_National_Park", "passage_text": "It is centered on the Green River, with a tributary, the Nolin River, feeding into the Green just inside the park. With 400 miles (640 km) of surveyed passageways Mammoth Cave is by far the world's longest known cave system, being over twice as long as the second-longest cave system, Mexico 's Sac Actun underwater cave. The official name of the system is the Mammoth-Flint Ridge Cave System for the ridge under which the cave has formed. The park was established as a national park on July 1, 1941. It became a World Heritage Site on October 27, 1981, and an international Biosphere Reserve on September 26, 1990."}, {"url": "https://en.wikipedia.org/wiki/List_of_longest_caves", "passage_text": "Mammoth Cave, the world's longest known cave system. The following is a list of the world's 10 longest caves per length of documented passageways. Many passageways are still being discovered; this list is based on the latest verifiable data. The highest concentrations of long caves in the world are found in the Pennyrile of Southern Kentucky, USA, in the Black Hills of South Dakota, USA, and in the Yucatan Yucatán, Peninsula. mexico"}]