[{"url": "https://en.wikipedia.org/wiki/Arthritis", "passage_text": "Pain, which can vary in severity, is a common symptom in virtually all types of arthritis. Other symptoms include swelling, joint stiffness and aching around the joint(s). Arthritic disorders like lupus and rheumatoid arthritis can affect other organs in the body, leading to a variety of symptoms. The pain from arthritis is due to inflammation that occurs around the joint, damage to the joint from disease, daily wear and tear of joint, muscle strains caused by forceful movements against stiff painful joints and fatigue."}, {"url": "http://ghr.nlm.nih.gov/condition/juvenile-idiopathic-arthritis", "passage_text": "Juvenile idiopathic arthritis refers to a group of conditions involving joint inflammation (arthritis) that first appears before the age of 16. This condition is an autoimmune disorder, which means that the immune system malfunctions and attacks the body's organs and tissues, in this case the joints. Researchers have described seven types of juvenile idiopathic arthritis."}, {"url": "https://www.hss.edu/conditions_current-future-treatment-childhood-teenage-arthritis.asp", "passage_text": "Oligoarthritis Oligo is the Latin word for few.. Typically, oligoarthritis is seen in young children with fewer than five joints involved during the first six months of disease. Characteristically, this disease affects large joints-almost exclusively the knees and ankles, rarely the wrists or elbows. Outlook: True oligoarthritis is one of the types of arthritis that children usually do outgrow. With proper care, most children can escape the side effects of this disease. However some children are left with a difference in their leg lengths, which proper treatment may help prevent and/or eye disease."}, {"url": "http://www.niams.nih.gov/Health_Info/Juv_Arthritis/default.asp", "passage_text": "Juvenile idiopathic arthritis is currently the most widely accepted term to describe various types of chronic arthritis in children. In general, the symptoms of juvenile idiopathic arthritis include joint pain, swelling, tenderness, warmth, and stiffness that last for more than 6 continuous weeks. The most common symptom of all types of juvenile arthritis is persistent joint swelling, pain, and stiffness that is typically worse in the morning or after a nap. The pain may limit movement of the affected joint, although many children, especially younger ones, will not complain of pain."}, {"url": "http://www.cdc.gov/arthritis/basics/general.htm", "passage_text": "While the word arthritis is used by clinicians to specifically mean joint inflammation it is used in public health to refer more generally to more than 100 rheumatic diseases and conditions that affect joints, the tissues which surround the joint and other connective tissue. "}, {"url": "https://en.wikipedia.org/wiki/Oligoarthritis", "passage_text": "Oligoarthritis (from Greek oligos - 'few') is defined as arthritis affecting one to four joints during the first six months of disease. Two subcategories are recognized: "}, {"url": "http://www.niams.nih.gov/Health_Info/Reactive_Arthritis/", "passage_text": "Reactive arthritis is a form of arthritis, or joint inflammation, that occurs as a “reaction” to an infection elsewhere in the body. Inflammation is a characteristic reaction of tissues to injury or disease and is marked by swelling, redness, heat, and pain. "}, {"url": "http://ghr.nlm.nih.gov/condition/juvenile-idiopathic-arthritis", "passage_text": "Oligoarticular juvenile idiopathic arthritis (also known as oligoarthritis) has no features other than joint inflammation. Oligoarthritis is marked by the occurrence of arthritis in four or fewer joints in the first 6 months of the disease. It is divided into two subtypes depending on the course of disease. If the arthritis is confined to four or fewer joints after 6 months, then the condition is classified as persistent oligoarthritis. This condition is an autoimmune disorder, which means that the immune system malfunctions and attacks the body's organs and tissues, in this case the joints. Researchers have described seven types of juvenile idiopathic arthritis."}, {"url": "http://ghr.nlm.nih.gov/condition/juvenile-idiopathic-arthritis", "passage_text": "Enthesitis-related juvenile idiopathic arthritis is characterized by tenderness where the bone meets a tendon, ligament or other connective tissue. This tenderness, known as enthesitis, accompanies the joint inflammation of arthritis. This condition is an autoimmune disorder, which means that the immune system malfunctions and attacks the body's organs and tissues, in this case the joints. Researchers have described seven types of juvenile idiopathic"}, {"url": "https://en.wikipedia.org/wiki/Arthritis", "passage_text": "There are over 100 different forms of arthritis. The most common form of arthritis is osteoarthritis (degenerative joint disease), a result of trauma to the joint, infection of the joint, or age. Other arthritis forms are rheumatoid arthritis, psoriatic arthritis, and related autoimmune diseases. The pain from arthritis is due to inflammation that occurs around the joint, damage to the joint from disease, daily wear and tear of joint, muscle strains caused by forceful movements against stiff painful joints and fatigue."}]