[{"url": "http://www.helpwithcooking.com/cooking-poultry/roast-chicken.html", "passage_text": "Therefore, a 5 lb chicken will need to be roasting in the oven for at least 1h 50 mins. A 5 lb bird will serve between 4 - 5 people. Some people prefer to set the oven temperature to 450ºF (230ºC) and roast the bird at this high temperature for the first 10 - 15 minutes or the last 10 - 15 minutes. The rest of the time the chicken should be roasted at 375ºF (190ºC). Roasting a chicken does not take quite so long as roasting a turkey, however a large chicken could still take over 2 hours to roast. As a general rule, calculate a cooking time of 20 minutes per pound of meat plus an additional 10 - 20 minutes at a temperature of"}, {"url": "http://www.bbc.co.uk/food/recipes/roastchicken_90247", "passage_text": "Season the chicken generously with sea salt and black pepper. Cover the chicken loosely with foil and roast in the oven for 30 minutes. After 30 minutes, remove the foil and roast for another 20-30 minutes and reduce the temperature to 160C-180C/320F-350F/Gas 3-4. It's fully cooked when the juices run clear when the bird is pierced in the thigh with a skewer. "}, {"url": "http://www.calnanbrothers.co.uk/pages/roasting-poultry", "passage_text": "1 Check oven has reached temperature, 2  Roast chicken for 80 minutes at 190 °C (375 °F-Gas 5). 3  Increase the oven heat to 220 °C (425 °F-Gas 7), for the final 15 minutes to turn the skin crisp and golden. 4  Total cooking time 95 minutes. 1 Let bird breath for 10 minutes. 2  Place into suitable roasting tin. 3  Check oven has reached temperature, 4  Roast bird for 25 minutes at 220 °C (425 °F-Gas 7). 5  Reduce the oven temperature to 180 °C (350 °F-Gas 4). 6  Roast bird for 20 minutes per 450g. 7  Remove the joint from the oven and check that juices run clear."}, {"url": "http://www.marthastewart.com/356165/perfect-roast-chicken", "passage_text": "Let chicken and 1 tablespoon butter stand at room temperature for 30 minutes. Preheat oven to 425 degrees. Remove and discard the plastic pop-up timer from chicken if there is one. Remove the giblets and excess fat from the chicken cavity. "}, {"url": "http://dish.allrecipes.com/the-best-roast-chicken/", "passage_text": "1 Preheat oven to 450 degrees F (230 degrees C) and cook whole (thawed) chicken for 10-15 minutes. 2  Then reduce the temperature to 350 degrees F (175 degrees C) and roast for 20 minutes per pound. Add 15 minutes to the total cooking time if you’re roasting a stuffed chicken. And as with the chicken itself, make sure the stuffing reaches a temperature of at least 165 degrees F (74 degrees C). 1  Chicken. 2  Roasted. 3  Roasting Pan."}, {"url": "http://www.chowhound.com/recipes/basic-whole-roasted-chicken-30264", "passage_text": "1 4 Roast the chicken in the oven for 15 minutes. 2  Reduce the temperature to 375°F and continue roasting until the juices run clear and a thermometer inserted into the inner thigh (but not touching the bone) registers 165°F, about 50 minutes to 1 hour more. 3  5 Remove the chicken from the oven and place on a cutting board. Instructions. 1  1 Heat the oven to 425°F and arrange a rack in the middle. 2  2 Place the chicken on a work surface or cutting board and pat it dry with paper towels. 3  3 Drizzle the oil on the chicken and rub it all over the skin. 4  4 Roast the chicken in the oven for 15 minutes. 5"}, {"url": "http://www.calnanbrothers.co.uk/pages/roasting-poultry", "passage_text": "1 Place into suitable roasting tin. 2  Check oven has reached temperature, 3  Roast chicken for 80 minutes at 190 °C (375 °F-Gas 5). 4  Increase the oven heat to 220 °C (425 °F-Gas 7), for the final 15 minutes to turn the skin crisp and golden. 1 Let bird breath for 10 minutes. 2  Place into suitable roasting tin. 3  Check oven has reached temperature, 4  Roast bird for 25 minutes at 220 °C (425 °F-Gas 7). 5  Reduce the oven temperature to 180 °C (350 °F-Gas 4). 6  Roast bird for 20 minutes per 450g. 7  Remove the joint from the oven and check that juices run clear."}, {"url": "http://dish.allrecipes.com/the-best-roast-chicken/", "passage_text": "High heat method (this creates a crispy, darker skin): 1  Preheat oven to 450 degrees F (230 degrees C) and cook whole (thawed) chicken for 10-15 minutes. 2  Then reduce the temperature to 350 degrees F (175 degrees C) and roast for 20 minutes per pound. Add 15 minutes to the total cooking time if you’re roasting a stuffed chicken. And as with the chicken itself, make sure the stuffing reaches a temperature of at least 165 degrees F (74 degrees C). 1  Chicken. 2  Roasted. 3  Roasting Pan."}, {"url": "http://www.foodnetwork.com/recipes/emeril-lagasse/perfect-roast-chicken-recipe.html", "passage_text": "Rub the chicken both inside and out with the garlic rosemary blend and place in the roasting pan. Place the pan in the oven and roast the chicken for 40 to 50 minutes, or until the juices run clear. To test this, insert a thermometer in the thickest part of a leg. It should register at 160 degrees internal temperature. Remove the chicken from the oven and allow to cool for 10 to 15 minutes before carving. Pour off excess fat from pan and return to heat. Whisk in chicken stock, roasted garlic, white wine and chopped rosemary, scraping up the bits on the bottom of pan. "}, {"url": "http://www.epicurious.com/archive/kitchenequipment/expertadvice/convectionovencooking", "passage_text": "1 The vegetables will cook in about 45 minutes and the chicken will be done in as little as 1 hour and 20 minutes. 2  Herbed Roast Leg of Lamb with Roasted Onions and Potatoes. 3  Start at the higher temperature and then drop it to 325°F after 15 minutes. 4  Start checking the internal temperature for doneness after 50 minutes. Roasting with the Convection Oven. 1  Roast Chicken and Root Vegetables with Mustard-Rosemary Sauce. 2  The vegetables will cook in about 45 minutes and the chicken will be done in as little as 1 hour and 20 minutes. 3"}]