[{"url": "http://www.dmv.org/ca-california/teen-drivers.php", "passage_text": "1 15 1/2 years old: Must take driver's education to get a learner's permit. 2  16 years old: Eligible for a provisional license (with completion of driver's education). 3  17 1/2 years old: Allowed to apply for a provisional permit without taking driver's education."}, {"url": "https://uk.answers.yahoo.com/question/index?qid=20071010084856AAeTJVH", "passage_text": "Best Answer: A brief history of the U.K. driving test: 1903 - Driving Licences are introduced; they originally cost five shillings (25p) and were renewable every three months from the post office. 1930 - Age restrictions and a form of driving test is brought in for disabled drivers."}, {"url": "http://dor.mo.gov/drivers/teens/gradlaw.php", "passage_text": "1 At age 16 or older, you may drive when accompanied in the front seat by a licensed driver who is at least 21 years old and has a valid driver license. 2  Seat belts must be worn by the driver and all passengers. 3  Your test paper alone is not legal for driving. 4  Be sure to carry your permit with you."}, {"url": "http://www.dmv.org/ca-california/teen-drivers.php", "passage_text": "California Provisional License. After you have held your learner's permit for a minimum of 6 months (and you are at least 16 years old), and you have completed your 50 hours of behind-the-wheel training, you may apply for your intermediate driver's license, called "}, {"url": "http://www.ncdot.gov/dmv/driver/license/first/", "passage_text": "Graduated Licensing is a process by which driver license applicants 15 years of age (but less than 18 years old) can start getting their Driver License. There are several levels in this process and strict requirements that need to be met."}, {"url": "http://www.dmv.org/ca-california/teen-drivers.php", "passage_text": "Age Requirements. 1  15 1/2 years old: Must take driver's education to get a learner's permit. 2  16 years old: Eligible for a provisional license (with completion of driver's education). 3  17 1/2 years old: Allowed to apply for a provisional permit without taking driver's education."}, {"url": "http://www.dmv.org/ca-california/teen-drivers.php", "passage_text": "1 16 years old: Eligible for a provisional license (with completion of driver's education). 2  17 1/2 years old: Allowed to apply for a provisional permit without taking driver's education. 3  18 years old and older: Allowed to apply for a driver's license without getting a learner's permit."}, {"url": "http://www.dmv.org/ca-california/teen-drivers.php", "passage_text": "If you're between the ages of 15 1/2 years old and 17 1/2 years old, you'll apply for a provisional permit. The difference is that teens under 17 1/2 years old need to complete Driver's Ed, whereas older teens can obtain their learner's permit without Driver's Ed."}, {"url": "https://www.citizensadvice.org.uk/consumer/transport/driving-and-parking/driving/driving-licences/", "passage_text": "When you can start driving. If you have applied for a first provisional licence, you must not start driving until you receive the licence. This will usually be at least three weeks. If you have a medical condition, you may have to wait longer because more information may be needed before the licence is issued."}, {"url": "https://uk.answers.yahoo.com/question/index?qid=20071010084856AAeTJVH", "passage_text": "Until now vehicle inspectors have carried out P.S.V. driving tests: this is taken over by examiners who are now H.G.V. qualified. 1972 - The demand for driving tests rises by 20%, and a further 15% in the following year, leading to a huge backlog of tests."}]