[{"url": "http://www.wikihow.com/Learn-Makeup-Lingo", "passage_text": "1 l/g is lip gloss. 2  FOTD is Face of the Day, which usually consists of pictures of the eye makeup, blush and lip product used that day. 3  Swatch is a picture of the product rubbed onto the skin or finger to show you the color or texture. 1 FOTD is Face of the Day, which usually consists of pictures of the eye makeup, blush and lip product used that day. 2  Swatch is a picture of the product rubbed onto the skin or finger to show you the color or texture."}, {"url": "http://makeuptutorials.com/mac-lipstick-makeup-dupes/", "passage_text": "MAC Myth & Maybelline Barely Bloomed. One of the best nude dupes you can find at the drugstore! image via. For a sheer nude color, MAC Myth may be the go-to lipstick but that’s not the case anymore. MAC Diva & P2 Corso Como. The perfect dupe for your vampy makeup. image via. If you love deep reds like we do, then we’re sure you’ll be going on a hunt for this. Ditch the MAC Rebel for P2’s Corso Como and you’ll enjoy the rich deep red color while saving $13.8 (Rebel costs $16, Corso Como costs $2.2)."}, {"url": "http://www.definitions.net/definition/dupe", "passage_text": "Wiktionary (0.00 / 0 votes) Rate this definition: dupe (Noun). A person who has been deceived. dupe (Noun). A duplicate of a photographic image. dupe (Noun). A duplicate of an order receipt printed for kitchen staff. dupe (Noun). A duplicate. dupe (Verb). To swindle, deceive, or trick. Dupe (noun). to deceive; to trick; to mislead by imposing on one's credulity; to gull; as, dupe one by flattery. Origin: [F., prob. from Prov. F. dupe, dube; of unknown origin; equiv. to F. huppe hoopoe, a foolish bird, easily caught."}, {"url": "http://www.xovain.com/makeup/make-up-for-ever-vs-coastal-scents#!", "passage_text": "This was one of my primary concerns for both products. After all, even if you're only spending $5 on a product, if it doesn't do what it says it's supposed to, that's still $5 down the drain. Fortunately, they both worked very well in terms of staying power and preserved my makeup through the day and/or night. On the right side I'm wearing the MUFE powder and on the left I'm wearing the Coastal Scents powder. I applied both very carefully with two different--and freshly cleaned--brushes. Here's the MUFE side. And here's the CS side."}, {"url": "https://en.wiktionary.org/wiki/de-dupe", "passage_text": "Verb [edit]. de-dupe (third-person singular simple present de-dupes, present participle de-duping, simple past and past participle de-duped). ( 1 computing) To remove duplicate entries from a list or database. "}, {"url": "http://www.wikihow.com/Learn-Makeup-Lingo", "passage_text": "1 To foil means to use an eye shadow with a damp or wet brush, creating a more vibrant or pigmented effect. 2  When a mascara runs it means it transferred to the under the eye area or down the face. 3  To stipple means to use a duo-fiber stippling brush with a foundation to create an airbrush look. 1 FOTD is Face of the Day, which usually consists of pictures of the eye makeup, blush and lip product used that day. 2  Swatch is a picture of the product rubbed onto the skin or finger to show you the color or texture."}, {"url": "http://www.wikihow.com/Learn-Makeup-Lingo", "passage_text": "1 Low-end means drugstore products or affordable products, while High-end means department store or exclusive makeup. 2  To foil means to use an eye shadow with a damp or wet brush, creating a more vibrant or pigmented effect. 3  When a mascara runs it means it transferred to the under the eye area or down the face. 1 FOTD is Face of the Day, which usually consists of pictures of the eye makeup, blush and lip product used that day. 2  Swatch is a picture of the product rubbed onto the skin or finger to show you the color or texture."}, {"url": "http://www.temptalia.com/makeup-dupe-list/", "passage_text": "The Dupe List makes life just a little easier whenever you're looking for an alternative option, whether the original has long been discontinued, sold out in a hot minute, or you just want something a little easier on your wallet. "}]