[{"url": "http://www.lpn123.com/", "passage_text": "LPN Salary: Salaries for LPN vary depending on the type of facility you work at and the state of the country you work. Average Annual Salary: $34,000 (ALL US, Nationwide Averages), Salary Range: $32,000 to $40,000."}, {"url": "http://www.lpn.com/state/tennessee-lpn/", "passage_text": "Within the state, LPNs make up 29 % of nurses in the state. The Tennessee LPN comfort score is 86 which ranks 13th in the nation. This takes into account the average LPN salary, average state salary and cost of living."}, {"url": "http://www.ehow.com/info_7781800_lpn-salaries-tennessee.html", "passage_text": "The average annual salary for LPNs in the United States was $42,910 in 2013, according to the U.S. Bureau of Labor Statistics. Salaries vary by location, however, and in Tennessee, the annual mean salary for 2013 was $36,260, with a range from $29,320 to $46,190."}, {"url": "http://www.indeed.com/salary/q-LPN-l-Tennessee.html", "passage_text": "Average LPN salaries for job postings in Tennessee are 7% lower than average LPN salaries for job postings nationwide."}, {"url": "http://www1.salary.com/Licensed-Practical-Nurse-salary.html", "passage_text": "For example the median expected annual pay for a typical Licensed Practical Nurse in the United States is $43,716 so 50% of the people who perform the job of Licensed Practical Nurse in the United States are expected to make less than $43,716. Source: HR Reported data as of October 2015. Median $43,716. 1  Salary."}, {"url": "http://www.ehow.com/info_7781800_lpn-salaries-tennessee.html", "passage_text": "Metropolitan Areas. Salaries for LPNs in Tennessee metropolitan areas differed within the state, according to BLS statistics for 2013. LPNs in Jackson earned an annual mean salary of $33,000, while those in Johnson City earned $34,470 and those in Cleveland earned $36,360 a year."}, {"url": "http://learn.org/articles/What_is_the_Average_Starting_Salary_for_an_LPN.html", "passage_text": "According to the U.S. Bureau of Labor Statistics (BLS), the average salary for LPNs and licensed vocational nurses (LVNs) of all experience levels was $42,400 as of May 2012 (www.bls.gov)."}]