[{"url": "https://en.wikipedia.org/wiki/Incarceration_in_the_United_States", "passage_text": "This is the U.S. incarceration rate for adults or people tried as adults. According to the U.S. Bureau of Justice Statistics (BJS), 2,220,300 adults were incarcerated in U.S. federal and state prisons, and county jails in 2013 – about 0.91% of adults (1 in 110) in the U.S. resident population. The United States has the highest prison population (2,220,300 in 2013). It has the second highest documented incarceration rate in the world (698 per 100,000 population in 2013), behind the tiny country, Seychelles, which has the highest rate (899 per 100,000 in 2014)."}, {"url": "https://today.yougov.com/news/2014/07/21/many-americans-think-prison-life-too-easy/", "passage_text": "Americans tend to say that too many people are imprisoned, and that prison's main purpose is to take violent criminals off the street instead of punishment or rehabilitation. The United States imprisons more of its people than any other country, with 2.4 million Americans behind bars at any given moment. Proportional to the population, there are four times as many people in prison today than there were in the 1980s, and most of these people are incarcerated for non-violent offenses. 40% of the country says that too many people who have committed crimes are imprisoned in the US, while 13% says that the incarceration rate is about right. 26% think that too few people are imprisoned."}, {"url": "https://en.wikipedia.org/wiki/Incarceration_in_the_United_States", "passage_text": "The United States has the largest prison population in the world, and the second-highest per-capita incarceration rate, behind Seychelles (which in 2014 had a total prison population of 735 out of a population of around 92,000). In 2013 in the USA, there were 698 people incarcerated per 100,000 population. The United States has the highest prison population (2,220,300 in 2013). It has the second highest documented incarceration rate in the world (698 per 100,000 population in 2013), behind the tiny country, Seychelles, which has the highest rate (899 per 100,000 in 2014)."}, {"url": "http://www.pewresearch.org/fact-tank/2013/09/06/incarceration-gap-between-whites-and-blacks-widens/", "passage_text": "One area where the black-white gap has widened is incarceration. Several speakers at the anniversary took note of this, including former President Jimmy Carter who said “I think we all know how Dr. King would have reacted” to the large numbers of African-American men in prison. In 1960, the white male incarceration rate was 262 per 100,000 white U.S. residents, and the black male rate was 1,313, meaning that black men were five times as likely as white men to be incarcerated."}, {"url": "https://en.wikipedia.org/wiki/United_States_incarceration_rate", "passage_text": "In October 2013, the incarceration rate of the United States of America was the highest in the world, at 716 per 100,000 of the national population. While the United States represents about 4.4 percent of the world's population, it houses around 22 percent of the world's prisoners. If all prisoners are counted (including juvenile, territorial, ICE, Indian country, and military), then in 2008 the USA had around 24.7% of the world's 9.8 million prisoners. The United States has the highest documented incarceration rate in the world, at 754 per 100,000 (as of 2009)."}, {"url": "https://today.yougov.com/news/2014/07/21/many-americans-think-prison-life-too-easy/", "passage_text": "Over 60% of people in American prisons may have been convicted of non-violent crime s, but 46% of Americans say that they think the main purpose of prison is to take violent criminals off the streets. 40% of the country says that too many people who have committed crimes are imprisoned in the US, while 13% says that the incarceration rate is about right. 26% think that too few people are imprisoned."}, {"url": "https://www.americanprogress.org/issues/race/news/2012/03/13/11351/the-top-10-most-startling-facts-about-people-of-color-and-criminal-justice-in-the-united-states/", "passage_text": "1. While people of color make up about 30 percent of the United States’ population, they account for 60 percent of those imprisoned. The prison population grew by 700 percent from 1970 to 2005, a rate that is outpacing crime and population rates. The incarceration rates disproportionately impact men of color: 1 in every 15 African American men and 1 in every 36 Hispanic men are incarcerated in comparison to 1 in every 106 white men. "}, {"url": "http://www.nationalreview.com/article/424059/mass-incarceration-prison-reform", "passage_text": "A merica has the highest incarceration rate in the world, outstripping even Russia, Cuba, Rwanda, Belarus, and Kazakhstan. Though America is home to only about one-twentieth of the world’s population, we house almost a quarter of the world’s prisoners. “Violent crime is not responsible for the prison boom. . . . The uncomfortable reality is that convictions for drug offenses — not violent crime — are the single most important cause of the prison boom in the United States,” and minorities are disproportionately convicted of drug crimes. Alexander’s critique is catnip to liberal"}]