[{"url": "http://www.bhg.com/recipes/how-to/cooking-basics/how-to-fry-pork-chops/", "passage_text": "How to Saute Chops. The easiest way to fry pork chops is to saute them, which means to cook them quickly in a little oil in a skillet. Boneless or bone-in rib or loin chops, cut 1/2 to 3/4 inch thick, work well for this. For four chops, heat 2 teaspoons vegetable oil or olive oil in a large skillet over medium heat. "}, {"url": "http://www.food.com/recipe/pan-grilled-pork-chops-68063", "passage_text": "Directions. 1  Sprinkle the salt, thyme and pepper on the pork chops. 2  Let sit on counter top for 30 minutes. 3  Place oil in large cast iron skillet (or heavy stainless steel skillet) and heat until medium hot. 4  Place chops in the pan, placing them so they don't touch each other. 1 Place oil in large cast iron skillet (or heavy stainless steel skillet) and heat until medium hot. 2  Place chops in the pan, placing them so they don't touch each other. 3  Cook each side slowly (lower heat if necessary) until nice and golden brown on each side. 4  This will take about 4 minutes per side."}, {"url": "http://www.food.com/recipe/pan-grilled-pork-chops-68063", "passage_text": "1 Let sit on counter top for 30 minutes. 2  Place oil in large cast iron skillet (or heavy stainless steel skillet) and heat until medium hot. 3  Place chops in the pan, placing them so they don't touch each other. 4  Cook each side slowly (lower heat if necessary) until nice and golden brown on each side. 1 Place oil in large cast iron skillet (or heavy stainless steel skillet) and heat until medium hot. 2  Place chops in the pan, placing them so they don't touch each other. 3  Cook each side slowly (lower heat if necessary) until nice and golden brown on each side. 4  This will take about 4 minutes per side."}, {"url": "http://www.simplyrecipes.com/recipes/moms_perfect_pork_chops/", "passage_text": "1 Heat a large cast iron frying pan to medium high or high heat (hot enough to sear the meat). While the pan is heating, sprinkle a pinch of dry rub spices (about 1/8 teaspoon or a little more) on each of the pork chops. Using your fingers, rub the spices into the meat. Turn the chops over and repeat on the other side. "}, {"url": "http://www.foodnetwork.com/recipes/ree-drummond/pan-fried-pork-chops-recipe.html", "passage_text": "Directions. Salt and pepper both sides of the pork chops. Combine the flour and some cayenne, salt and black pepper. Dredge each side of the pork chops in the flour mixture, and then set aside on a plate. Heat the canola oil over medium to medium-high heat. Add the butter. When the butter is melted and the butter/oil mixture is hot, cook 3 pork chops at a time, 2 to 3 minutes on the first side. Flip and cook until the chops are golden brown on the other side, 1 to 2 minutes (make sure no pink juices remain). "}, {"url": "http://www.wikihow.com/Cook-Pork-Chops", "passage_text": "1 If you want to make breaded pork chops, mix up 1 cup of flour, 1 teaspoon salt, 1 teaspoon black pepper and 1/2 teaspoon garlic powder. 2  In a separate dish, mix 1 egg and 2 tablespoons water. 3  Dip the pork chops in the egg mixture, then dip them in the flour mixture to coat. 2. Heat a tablespoon of oil in a large skillet. Place the skillet over medium high heat and let the oil get nice and hot. 1  Any type of oil will do-olive oil, canola oil, grapeseed oil-you pick. 2  You could also use butter. 3  If you're frying more than 4 or so pork chops, you might need to heat up a second pan as well."}, {"url": "http://www.thekitchn.com/how-to-cook-perfect-pork-chops-in-the-oven-cooking-lessons-from-the-kitchn-194257", "passage_text": "Set the chops aside to warm while the oven finishes heating. Remove the skillet from the oven: Using oven mitts, carefully remove the hot skillet from the oven and set it over medium-high heat on the stovetop. Turn on a vent fan or open a window. Sear the pork chops: Lay the pork chops in the hot skillet. Bring 1 cup of the water to a boil, add the salt and optional flavorings, and stir to dissolve the salt. Add 2 more cups of cold water to bring the temperature of the brine down to room temperature. Place the pork chops in a shallow dish and pour the brine over top. The brine should cover the chops — if not, add additional water and salt (1 cup water to 1 tablespoon salt) until the chops are submerged. Cover the dish and refrigerate for 30 minutes or up to 4 hours"}, {"url": "http://www.wikihow.com/Cook-Pork-Chops", "passage_text": "1. Preheat the oven to 350 degrees. 2. Season your pork chops. Sprinkle them with salt, pepper, cayenne, paprika, dried oregano, and any other spices you like. 1  If you want to make breaded pork chops, mix up 1 cup of flour, 1 teaspoon salt, 1 teaspoon black pepper and 1/2 teaspoon garlic powder. 2  In a separate dish, mix 1 egg and 2 tablespoons water. 2. Heat a tablespoon of oil in a large skillet. Place the skillet over medium high heat and let the oil get nice and hot. 1  Any type of oil will do-olive oil, canola oil, grapeseed oil-you pick. 2  You could also use butter. 3  If you're frying more than 4 or so pork chops, you might need to heat up a second pan as well."}, {"url": "http://thepioneerwoman.com/cooking/simple-pan-fried-pork-chops/", "passage_text": "Dredge each side of the pork chops in the flour mixture, then set aside on a plate. Heat canola oil over medium to medium-high heat. Add butter. When butter is melted and butter/oil mixture is hot, cook 3 pork chops at a time, 2 to 3 minutes on the first side; 1 to 2 minutes on the other side. (Make sure no pink juices remain.) Remove to a plate and repeat with remaining porch chops. Delicious and simple! Serve with smashed new potatoes."}]