[{"url": "http://msue.anr.msu.edu/news/pricing_freezer_beef", "passage_text": "As feed prices fluctuate, cattle producers should know what the breakeven price is for finishing beef and use it to determine what to charge for freezer beef. The price of beef at a retail level is near record high. The average retail price of Choice beef as of June 2013 was $5.29 per pound. Consumers can save around 20 percent of that cost by purchasing beef in larger quantities of quarters, halves or whole beef carcasses."}, {"url": "http://coyotecreekfarm.org/beef/pricing/", "passage_text": "(plus soup bones & sausage) (sausage is optional). $2,497 / 412 lbs. = $6.06 (This average will run from $6.50 to $6.75) per pound for your organic pasture grazed, grass-fed beef. This is about the price of one pound of ground grass-fed beef at a Farmer’s Market or at Whole Foods Market. Current Pricing for Our Grass-Fed Beef. Our steers are raised and grazed on 100% USDA certified organic pasture. Our grass-fed beef price for this year is $3.70 per pound (same price as last year) hanging weight for the beef, your total cost with slaughter and processing is explained below. All figures are approximate since we won’t know the exact weights until time of processing"}, {"url": "http://www.agweb.com/article/feeder_cattle_prices_set_record_highs_calf_prices_a_runaway/", "passage_text": "The most unbelievable aspect of the current market, however, is that calf prices actually seem reasonable when one studies current feeder cattle prices. A load of 900-pound steers sold last Thursday in Valentine, NE, for $163.50 per hundredweight, a tidy sum of $1,471.50 per head. "}, {"url": "http://247wallst.com/commodities-metals/2014/12/20/cost-of-beef-to-soar/", "passage_text": "The USDA projects that farm prices for beef cattle will rise from an average of $1.5252 a pound in 2014 to $1.5754 a pound in 2015 to a high of $1.63 a pound by 2017, before dropping back to $1.5617 by 2024. "}, {"url": "http://www.cattlenetwork.com/cattle-news/Ground-beef-prices-hit-410-per-pound-280070492.html", "passage_text": "In September 2013, ground beef was averaging $3.502 per pound. In August, the average price per pound of ground beef climbed over $4 for the first time, reaching $4.013. In one year, the price of ground beef has jumped about 17 percent, Ali Meyer reported for CNS News. In September 2009, ground beef averaged $2.138 per pound. In the last five years, the price has increased by 91.6 percent, from $1.958 to the current $4.096 per pound. Read more here."}, {"url": "http://msue.anr.msu.edu/news/pricing_freezer_beef", "passage_text": "Only ten of the processors slaughter beef and three of them charge disposal fees ($10 to $12) in addition to the slaughter fee ($30 to $75 range). The average slaughter fee including the three disposal fees is $50.22 per head. The average processing fee is $0.46 per pound of hanging beef carcass weight. This ranged from $0.36 to $0.55 among the processors and some of them were using cold carcass weights instead of hot carcass weights. The price of beef at a retail level is near record high. The average retail price of Choice beef as of June 2013 was $5.29 per pound. Consumers can save around 20 percent of that cost by purchasing beef in larger quantities of quarters, halves or whole beef carcasses."}, {"url": "http://msue.anr.msu.edu/news/pricing_freezer_beef", "passage_text": "Ultimately the carcass price is determined by the buyer and the seller, but the worksheet goes through an example using current average prices. A hanging weight of $2.42 per pound compares to $1.52 per pound live weight for a beef type steer. The price of beef at a retail level is near record high. The average retail price of Choice beef as of June 2013 was $5.29 per pound. Consumers can save around 20 percent of that cost by purchasing beef in larger quantities of quarters, halves or whole beef carcasses."}, {"url": "http://www.farmandranchguide.com/news/livestock/what-s-a-cow-worth-determining-the-value-of-a/article_94e22c5a-4601-11e1-8214-0019bb2963f4.html", "passage_text": "Beef Cattle Improvement Association, the average cow age in the state is 5.7 years, which means the average number of calf crops per cow is 4.7, since she doesn't calf that first year. Current cull prices would pay $70 per cwt., which would come to $910 for a 1300 pound cow. In calculating the winter feed costs, Hoppe figured a 1400-pound cow will either eat or waste 40 pounds of feed daily. Using a hay price of $65 per ton and figuring 180 days on feed with the winter ration that translates into a feed charge of $1.40 per day or $252 for six months."}, {"url": "http://www.farmandranchguide.com/news/livestock/what-s-a-cow-worth-determining-the-value-of-a/article_94e22c5a-4601-11e1-8214-0019bb2963f4.html", "passage_text": "Looking at the income side, the FBM records from 2010 indicate the average weight of calves sold at weaning time was 594 pounds. Using a current price of $158 per hundredweight (cwt) for 600 pound cattle and rounding the weight off at 600 pounds means a weaned calf value of $948. In calculating the winter feed costs, Hoppe figured a 1400-pound cow will either eat or waste 40 pounds of feed daily. Using a hay price of $65 per ton and figuring 180 days on feed with the winter ration that translates into a feed charge of $1.40 per day or $252 for six months."}]