[{"url": "https://simple.wikipedia.org/wiki/Ben_Johnson_(actor)", "passage_text": "Ben Johnson in a publicity photo for The Wild Bunch. Ben Johnson, Jr. (June 13, 1918 – April 8, 1996), or Son Johnson, was an American actor. He was mostly known for being in Western movies such as Hang 'Em High. He was also a world champion rodeo cowboy, stuntman, and rancher. Johnson won an Academy Award for his role on The Last Picture Show. Johnson was born on June 13, 1918 in Foraker, Oklahoma."}, {"url": "http://www.imdb.com/name/nm0424565/bio", "passage_text": "Born in Oklahoma, Ben Johnson was a ranch hand and rodeo performer when, in 1940, Howard Hughes hired him to take a load of horses to California. He decided to stick around (the pay was good), and for some years was a stunt man, horse wrangler, and double for such stars as John Wayne, Gary Cooper and James Stewart. The Ben Johnson Memorial Award, in honor of his father, is awarded annually to prominent representatives of the western character and spirit (since 1998). Johnson, his father, and nephew have Belt-Buckle awards for team roping."}, {"url": "http://articles.latimes.com/1996-04-09/local/me-56539_1_ben-johnson", "passage_text": "Obituaries: Ben Johnson; Oscar-Winning Actor. April 09, 1996 | MYRNA OLIVER | TIMES STAFF WRITER. Ben Johnson, rugged Western actor of about 300 films who won an Academy Award as the movie theater owner in The Last Picture Show, died Monday He was 75. "}, {"url": "https://en.wikipedia.org/wiki/Ben_Johnson_(actor)", "passage_text": "Johnson was born in Foraker, Oklahoma, on the Osage Indian Reservation, of Irish and Cherokee ancestry, the son of Ollie Susan Johnson (nee Née; workmon-1899) 2000 And Ben, Johnson. (sr-1896). 1952 his father was a rancher and rodeo champion In Osage. county An elegiac portrayal of a former cowboy theatre owner in the '50s coming of age drama, The Last Picture Show, won Johnson the 1971 Academy Award for Best Supporting Actor and the BAFTA Award for Best Supporting Actor."}, {"url": "http://www.imdb.com/name/nm0424565/bio", "passage_text": "Since both he and his father were named Ben, the younger Johnson was known as Son at home. The road marker to the actor's ranch near Shidler, Oklahoma declares it as Ben Son Johnson's ranch. He was awarded a Star on the Hollywood Walk of Fame at 7082 Hollywood Boulevard in Hollywood, California on June 2, 1994. The Ben Johnson Memorial Award, in honor of his father, is awarded annually to prominent representatives of the western character and spirit (since 1998). Johnson, his father, and nephew have Belt-Buckle awards for team roping."}, {"url": "https://en.wikipedia.org/wiki/Ben_Johnson_(actor)", "passage_text": "Ben Johnson (actor). From Wikipedia, the free encyclopedia. Ben Son Johnson, Jr. (June 13, 1918 – April 8, 1996) was an American stuntman, world champion rodeo cowboy and Academy Award-winning actor. The son of a rancher, Johnson arrived in Hollywood to deliver a consignment of horses for a film. An elegiac portrayal of a former cowboy theatre owner in the '50s coming of age drama, The Last Picture Show, won Johnson the 1971 Academy Award for Best Supporting Actor and the BAFTA Award for Best Supporting Actor."}, {"url": "http://www.findagrave.com/cgi-bin/fg.cgi?page=gr&GRid=2252", "passage_text": "Arizona, USA. Actor. He is best remembered for his role of Sam the Lion in The Last Picture Show (1971), for which he won a Best Supporting Actor Oscar. Born in Foraker, Oklahoma, his father, Ben Johnson, Senior, was a cattleman and rancher in Osage County, Oklahoma, as well as a champion rodeo steer roper."}, {"url": "http://www.imdb.com/name/nm0424565/bio", "passage_text": "Johnson and his father, Ben Johnson, Sr., were champion steer ropers. The senior Johnson was also a cattleman and rancher who was inducted into the Hall of Great Westerners of the National Cowboy and Western Heritage Museum in 1961. The Ben Johnson Memorial Award, in honor of his father, is awarded annually to prominent representatives of the western character and spirit (since 1998). Johnson, his father, and nephew have Belt-Buckle awards for team roping."}, {"url": "http://www.imdb.com/name/nm0424565/", "passage_text": "Born in Oklahoma, Ben Johnson was a ranch hand and rodeo performer when, in 1940, Howard Hughes hired him to take a load of horses to California. He decided to stick around (the pay was good), and for some years was a stunt man, horse wrangler, and double for such stars as John Wayne, Gary Cooper and James Stewart. "}]