[{"url": "http://dlib.etc.ucla.edu/projects/Karnak/", "passage_text": "Welcome to Digital Karnak. The colossal site of Karnak is one of the largest temple complexes in the world, with an incredibly rich architectural, ritual, religious, economic, social and political history. Welcome. The colossal site of Karnak is one of the largest temple complexes in the world, with an incredibly rich architectural, ritual, religious, economic, social and political history."}, {"url": "http://www.karnak.org/", "passage_text": "Karnak Temple Complex. Karnak is a complex in Egypt where ancient ruined temples are located. These temples are from the era of Pharoah Ramses II, from around 1391-1351 BC. This area was the most important place for worship during this time. The Great Temple of Amun was a very large building, and it is still available to visitors today. The Karnak Temple Complex is located near Luxor, south of Cairo, Egypt."}, {"url": "http://discoveringegypt.com/karnak-temple/", "passage_text": "The largest religious building ever constructed. The temple of Karnak was known as Ipet-isu—or “most select of places”—by the ancient Egyptians. It is a city of temples built over 2,000 years and dedicated to the Theban triad of Amun, Mut, and Khonsu. To accomplish this magical regeneration the Opet festival was held yearly at Karnak and Luxor. It lasted for twenty-seven days and was also a celebration of the link between pharaoh and the god Amun. The procession began at Karnak and ended at Luxor Temple, one and a half miles (2.4 kilometres) to the south."}, {"url": "http://www.livescience.com/25184-karnak-temple.html", "passage_text": "Karnak is an ancient Egyptian temple precinct located on the east bank of the Nile River in Thebes (modern-day Luxor). It covers more than 100 hectares, an area larger than some ancient cities. Construction at Karnak started by 4,000 years ago and continued up until the time the Romans took control of Egypt, about 2,000 years ago. Each Egyptian ruler who worked at Karnak left his or her own architectural mark. The UCLA Digital Karnak project has reconstructed and modeled these changes online."}, {"url": "http://www.usc.edu/dept/LAS/arc/karnak02/html/history.html", "passage_text": "Cosmology. Karnak is located near the city of Thebes, on the Eastern bank of the Nile River. It was the capital city of the New Kingdom era of Egypt at the time when the Southern Kings ousted their counter parts to the North. The site a Karnak is a complex of temples and monumental offerings to the gods. Karnak is located near the city of Thebes, on the Eastern bank of the Nile River. It was the capital city of the New Kingdom era of Egypt at the time when the Southern Kings ousted their counter parts to the North"}, {"url": "http://www.ancient-wisdom.com/egyptkarnak.htm", "passage_text": "Karnak is the largest of the temple complexes at Thebes (The Egyptian Middle and New Kingdom Capital). It was built over several several episodes of construction and enlargement from around 2055 B.C to 395 A.D (3) . Karnak is the largest of the temple complexes at Thebes (The Egyptian Middle and New Kingdom Capital). It was built over several several episodes of construction and enlargement from around 2055 B.C to 395 A.D."}]