[{"url": "http://www.abpischools.org.uk/page/modules/infectiousdiseases_immunity/immunity2.cfm?coSiteNavigation_allTopic=1", "passage_text": "The white blood cells then produce antibodies to match the shape of the antigens. The antigens on the surface of pathogenic cells are different from those on the surface of your own cells. This enables your immune system to distinguish pathogens from cells that are part of your body. Lymphocyte. A type of white blood cell that make antibodies to fight off infections. Pathogen. A micro-organism that causes disease. Phagocyte. Phagocytes are the white blood cells that protect the body by ingesting harmful foreign particles, bacteria, and dead or dying cells."}, {"url": "https://www.zocdoc.com/answers/11706/what-does-it-mean-to-have-an-elevated-white-blood-cell-count", "passage_text": "It looks at the amount of red blood cells, platelets and white blood cells in your blood. White blood cells are a part of the body's immune system. The white blood cell count usually increases when your body is experiencing an inflammatory process. This is most commonly seen in setting of infection"}, {"url": "http://biology.about.com/od/cellbiology/ss/white-blood-cell.htm", "passage_text": "1 Lymphocytes-After neutrophils, lymphocytes are the most common type of white blood cell. 2  These cells are spherical in shape with large nuclei and very little cytoplasm. 3  There are three main types of lymphocytes: T cells, B cells, and natural killer cells. "}, {"url": "http://www.cancer.gov/types/leukemia/patient/cll-treatment-pdq", "passage_text": "The abnormal lymphocytes may also be called leukemia cells. The lymphocytes are not able to fight infection very well. Also, as the number of lymphocytes increases in the blood and bone marrow, there is less room for healthy white blood cells, red blood cells, and platelets. This may cause infection, anemia, and easy bleeding. This summary is about chronic lymphocytic leukemia. "}, {"url": "http://health.howstuffworks.com/human-body/systems/circulatory/blood2.htm", "passage_text": "White Blood Cells. White blood cells (WBCs), or leukocytes, are a part of the immune system and help our bodies fight infection. They circulate in the blood so that they can be transported to an area where an infection has developed. In a normal adult body there are 4,000 to 10,000 (average 7,000) WBCs per microliter of blood. When the number of WBCs in your blood increases, this is a sign of an infection somewhere in your body. Here are the six main types of WBCs and the average percentage of each type in the blood: 1  Neutrophils - 58 percent. 2  Eosinophils - 2 percent. 3  Basophils - 1 percent"}, {"url": "http://www.hematology.org/Patients/Cancers/", "passage_text": "Lymphocytes are a type of white blood cell that fight infection. Abnormal lymphocytes become lymphoma cells, which multiply and collect in your lymph nodes and other tissues. Over time, these cancerous cells impair your immune system. Myeloma is a cancer of the plasma cells. Plasma cells are white blood cells that produce disease-and infection-fighting antibodies in your body. Myeloma cells prevent the normal production of antibodies, leaving your body's immune system weakened and susceptible to infection. Blood cancers affect the production and function of your blood cells. Most of these cancers start in your bone marrow where blood is produced. Stem cells in your bone marrow mature and develop into three types of blood cells: red blood cells, white blood cells, or platelets. In most blood cancers, the normal blood cell development process is interrupted by uncontrolled growth of an abnormal type of blood cell"}, {"url": "http://www.webmd.com/heart/anatomy-picture-of-blood", "passage_text": "• White blood cells, which fight infections. • Platelets, smaller cells that help blood to clot. Blood is conducted through blood vessels (arteries and veins). Blood is prevented from clotting in the blood vessels by their smoothness, and the finely tuned balance of clotting factors. 1 Leukemia: A form of blood cancer, in which white blood cells multiply abnormally and circulate through the blood. 2  The excessive large numbers of white cells deposit in the body's tissues, causing damage. 3  Multiple myeloma: A form of blood cancer of plasma cells similar to leukemia."}, {"url": "http://www.abpischools.org.uk/page/modules/infectiousdiseases_immunity/immunity2.cfm?coSiteNavigation_allTopic=1", "passage_text": "Primary response to infection. If a pathogen enters your body, white blood cells of your immune system quickly recognise its foreign antigens. This stimulates specific lymphocytes to grow, multiply and finally produce antibodies that will stick to the antigens on the invading pathogens and destroy them. Lymphocyte. A type of white blood cell that make antibodies to fight off infections. Pathogen. A micro-organism that causes disease. Phagocyte. Phagocytes are the white blood cells that protect the body by ingesting harmful foreign particles, bacteria, and dead or dying cells."}]