[{"url": "https://www.mileiq.com/blog/mileage-deduction/", "passage_text": "Travel between offices: You can take a mileage deduction for travel from your office or work site and your drive to a second place of business. Errands/supplies: Driving for business-related errands such as trips to the bank, office supply store or post office all qualify for a mileage deduction."}, {"url": "http://smallbusiness.chron.com/rules-deducting-mileage-selfemployed-subcontractors-21761.html", "passage_text": "An auditor may not allow you to claim side trips between two points if they added to the total length of your reported deductible use. You can deduct mileage driven for non-work reasons related to the business. This includes driving to the bank to make a deposit and meeting with professionals managing your business."}, {"url": "http://financialservices.about.com/od/CompRelatedFA/ht/Deduct-Business-And-Medical-Related-Mileage-On-Your-Tax-Return.htm", "passage_text": "When driving your own car for employment purposes, deduct the business miles you drive. Some caveats: you can't deduct miles driven to your place of employment from home, or from your work place back home."}, {"url": "https://turbotax.intuit.com/tax-tools/tax-tips/Small-Business-Taxes/Driving-Down-Taxes--Auto-Related-Tax-Deductions/INF18123.html", "passage_text": "If you have been temporarily reassigned to another work location that is farther from home, you can deduct the extra distance,” he said. If your employer reimburses you for mileage, however, you cannot deduct these expenses on your taxes. The per-mile rate for 2014 is 56 cents for business miles driven."}, {"url": "https://turbotax.intuit.com/tax-tools/tax-tips/Tax-Deductions-and-Credits/Federal-Tax-Laws-on-Mileage-Reimbursement/INF19464.html", "passage_text": "Your deduction is based on your business use percentage, i.e., your business miles as a percentage of your total miles. The second method is to multiply the miles you drive for work by the Internal Revenue Service standard mileage rate, which changes every year (and sometimes twice a year)."}, {"url": "https://www.mileiq.com/blog/mileage-deduction/", "passage_text": "If you drive your car or other vehicle for business purposes, you can take a mileage deduction of 57.5 cents for every mile you drive for work. Here is everything you need to know in order to get the most out of your mileage write off."}, {"url": "http://www.ehow.com/facts_5780786_can-claim-mileage-work-taxes_.html", "passage_text": "If you work multiple jobs, you can deduct the mileage you travel from one job to another, but not the miles you drive from your home to your workplace or vice versa. The mileage rate for business miles was 55.5 cents per mile in 2012 and 56.5 cents per mile in 2013."}, {"url": "http://work.chron.com/tax-deduction-commuting-miles-second-job-5543.html", "passage_text": "The mileage from your home to your first job or from your second job to your home is not deductible. For example, suppose your home is 15 miles from your first job and 27 miles from your second job. The two jobs are 25 miles apart. You can only claim the 25 miles you drive between your two workplaces."}, {"url": "https://www.irs.gov/publications/p17/ch27.html", "passage_text": "Standard mileage rate. Generally, if you claim a business deduction for work-related education and you drive your car to and from school, the amount you can deduct for miles driven from January 1, 2014, through December 31, 2014, is 56 cents per mile."}, {"url": "http://www.bankrate.com/finance/auto/tax-deduction-for-work-related-driving.aspx", "passage_text": "Per IRS rules, you can only claim the amount of expenses that is more than 2 percent of your adjusted gross income. So if you earn $40,000 a year, you could deduct any mileage expenses of more than $800 annually.To help calculate your deduction, read the 2014 mileage rate schedule."}]