[{"url": "http://www.hairremoval.org/laser-hair-removal-how-long-does-each-session-take/", "passage_text": "Though laser hair removal can take anywhere from a few minutes up to one hour, today’s laser hair removal sessions are faster and more efficient than ever, and you might even be surprised at how fast they are. in Hair Removal 101,Laser hair removal. Traditionally, a laser hair removal session could take anywhere from 20 minutes up to a few hours depending on the area treated. Nowadays, a laser hair removal session rarely takes as long as one hour, and this is because more efficient laser machines are availabl"}, {"url": "http://www.thehairfacts.com/faqs-laser-effectiveness.htm", "passage_text": "The table below shows some examples of the durations for treatments for a good candidate. Laser hair removal does work and results are often permanent, but it is more likely that patients will experience a 50-80% reduction after 3 treatments, performed 6 weeks apart. Patients will need additional treatments if they wish to remove a larger percentage of their hair. What are the likely results? Laser hair removal does work and results are often permanent, but it is more likely that patients will experience a 50-80% reduction after 3 treatments, performed 6 weeks apart."}, {"url": "http://www.surgery.org/consumers/ask-a-surgeon/sessions-needed-laser-hair-removal-parts-body", "passage_text": "A: Thank you for your question. Hair grows in cycles, typically every 4-6 weeks depending on the part of the body. Laser hair removal will only work on hair actively growing. So we recommend that it will take 4-6 treatments to effectively treat an area with our laser. We will get about 80% of the actively growing hairs. You would return every 4-6 weeks depending on the area to treat the new active growth."}, {"url": "http://beauty.about.com/od/laserhairremoval/a/laserfacts.htm", "passage_text": "It takes 4-6 laser hair removal sessions spaced 4 weeks apart to see 70-80 percent reduction in hair growth. Laser hair removal is not cheap. Depending on what body part you treat, it can run from $200 to $2,000 a session, not including tax and tip."}, {"url": "http://www.thehairfacts.com/faqs-laser-effectiveness.htm", "passage_text": "1½ - 3 hours. Laser hair removal does work and results are often permanent, but it is more likely that patients will experience a 50-80% reduction after 3 treatments, performed 6 weeks apart. Patients will need additional treatments if they wish to remove a larger percentage of their hair. What are the likely results? Laser hair removal does work and results are often permanent, but it is more likely that patients will experience a 50-80% reduction after 3 treatments, performed 6 weeks apart."}, {"url": "http://www.advanceddermatologylasercenter.com/hairremoval_faq.aspx", "passage_text": "You should shave the area 1-to-3 days prior to the laser hair removal treatment, depending upon how active your hair follicles are in the area-to-be-treated. We can provide you with the best treatment if there is a very slight stubble of growth that is just barely visible on close inspection. "}, {"url": "http://beauty.about.com/od/laserhairremoval/a/laserfacts.htm", "passage_text": "Lasers and pulsed light target several follicles at once, so you can treat large areas of skin. While it would take years to perform electrolysis on the back or legs, a typical laser hair removal session on both legs usually takes under two hours. Lasers are great for treating the back, shoulders, arm and chest. For upper lip and chin, lasers work but only on dark hair. Laser hair removal is not cheap. Depending on what body part you treat, it can run from $200 to $2,000 a session, not including tax and tip."}, {"url": "http://www.howlongdoes.com/beauty/how-long-does-laser-hair-removal-last/", "passage_text": "Treatments last anywhere from 15 minutes to one hour, as the time depends on the area being treated and the thickness of the hair. Your doctor or technician will usually have the laser penetrate the skin for a few minutes in an area about the size of a quarter and check if you have a negative reaction before continuing. When you are thinking about laser hair removal, you will find you have many questions about the process before you have any treatment preformed. A vital piece of information is how long does laser hair removal last. Although, this can be different for everyone, the short answer is forever."}]