[{"url": "http://www.emedicinehealth.com/thrombocytopenia_low_platelet_count/article_em.htm", "passage_text": "Platelets are important elements in the blood that are important for blood coagulation (clotting and prevention of bleeding). The normal platelet count ranges between 150,000 and 450,000 per microliter (one-millionth of a liter). Although the number of platelets is decreased, their function may remain intact in most cases of thrombocytopenia. All blood cells (white cells, red cells, and platelets) are made in the bone marrow"}, {"url": "http://www.mayoclinic.org/diseases-conditions/thrombocytopenia/basics/definition/CON-20027170", "passage_text": "Thrombocytopenia is a condition in which you have a low blood platelet count. Platelets (thrombocytes) are colorless blood cells that help blood clot. Platelets stop bleeding by clumping and forming plugs in blood vessel injuries. "}, {"url": "http://answers.webmd.com/answers/1198204/what-is-a-normal-platelet-count", "passage_text": "A. Platelets are the tiny blood cells that help stop bleeding by binding together to form a clump or plug at sites of injury inside blood vessels. A normal platelet count is between 150,000 and 450,000 platelets per microliter (one-millionth of a liter, abbreviated mcL). The average platelet count is 237,000 per mcL in men and 266,000 per mcL in women. Spontaneous bleeding doesn’t usually occur unless the platelet count falls to 10,000 or 20,000 per mcL. Platelets are constantly being produced in the bone marrow. A low or high platelet count is not often a problem by itself, but can frequently be a sign of another medical condition. For this reason, high or low platelet counts require additional medical attentio"}, {"url": "http://answers.webmd.com/answers/1198204/what-is-a-normal-platelet-count", "passage_text": "A platelet count below 150,000 per mcL is called thrombocytopenia, while a platelet count over 450,000 is called thrombocytosis. Platelets seem to have a large backup capacity: blood typically still clots normally as long as the platelet count is above 50,000 per mcL (assuming no other problems are present). Spontaneous bleeding doesn’t usually occur unless the platelet count falls to 10,000 or 20,000 per mcL. Platelets are constantly being produced in the bone marrow. A low or high platelet count is not often a problem by itself, but can frequently be a sign of another medical condition. For this reason, high or low platelet counts require additional medical attention"}, {"url": "http://www.wisegeekhealth.com/what-is-a-blood-platelet-count.htm", "passage_text": "Medications used in chemotherapy may lower blood platelet counts. Blood tests can be used to get a platelet count. Individuals with a high blood platelet count are at a higher risk for forming blood clots. A normal blood platelet count ranges between 150,000 and 400,000 platelets per microliter of blood."}, {"url": "http://www.emedicinehealth.com/thrombocytopenia_low_platelet_count/article_em.htm", "passage_text": "Thrombocytopenia means a lower platelet count in the blood compared to the normal range. Thrombocytosis refers to a greater number of platelets compared to the normal range. The normal platelet count ranges between 150,000 and 450,000 per microliter (one-millionth of a liter). Although the number of platelets is decreased, their function may remain intact in most cases of thrombocytopenia."}, {"url": "https://labtestsonline.org/understanding/analytes/platelet/tab/test", "passage_text": "A platelet count is used to detect the number of platelets in the blood. The test is included in a complete blood count (CBC) , a panel of tests often performed as part of a general health examination. Platelets are tiny fragments of cells that are essential for normal blood clotting. "}, {"url": "http://www.medicinenet.com/script/main/art.asp?articlekey=9939", "passage_text": "Platelet count: The calculated number of platelets in a volume of blood, usually expressed as platelets per cubic millimeter (cmm) of whole blood. Platelets are the smallest cell-like structures in the blood and are important for blood clotting and plugging damaged blood vessels. "}, {"url": "http://www.hopkinsmedicine.org/heart_vascular_institute/clinical_services/centers_excellence/womens_cardiovascular_health_center/patient_information/health_topics/platelets.html", "passage_text": "A normal platelet count ranges from 150,000 to 450,000 platelets per microliter of blood. Having more than 450,000 platelets is a condition called thrombocytosis; having less than 150,000 is known as thrombocytopenia. You get your platelet number from a routine blood test called a complete blood count (CBC). "}]