[{"url": "http://www.webmd.com/drugs/2/drug-93965/lyrica-oral/details", "passage_text": "Uses. This medication is used to treat pain caused by nerve damage due to diabetes or to shingles (herpes zoster) infection. It may also be used to treat nerve pain caused by spinal cord injury. This medication is also used to treat pain in people with fibromyalgia. Remember that your doctor has prescribed this medication because he or she has judged that the benefit to you is greater than the risk of side effects. Many people using this medication do not have serious"}, {"url": "http://www.everydayhealth.com/drugs/lyrica", "passage_text": "A: Lyrica (pregabalin) is an anti-epileptic drug, also called an anticonvulsant. It works by slowing down impulses in the brain that cause seizures. Lyrica also affects chemicals in the brain that send pain signals across the nervous system. It's used to control seizures and to treat fibromyalgia. A: Lyrica (pregabalin) is an anticonvulsant or anti-seizure medication. The exact way it works is not completely understood, but it is thought to slow down impulses in the brain and affect pain signals in the body."}, {"url": "http://www.emedicinehealth.com/drug-pregabalin/article_em.htm", "passage_text": "Pregabalin is used to control seizures and to treat fibromyalgia. It is also used to treat pain caused by nerve damage in people with diabetes (diabetic neuropathy), herpes zoster (post-herpetic neuralgia), or spinal cord injury. Pregabalin may also be used for purposes not listed in this medication guide. "}, {"url": "http://www.drugsdb.com/rx/lyrica/", "passage_text": "The prescription medicine Lyrica is a brand of the generic drug pregabalin and is used totreat seizures, relieve nerve pain and prevent anxiety. This drug is manufactured by Pfizer and there are currently no generic forms of it available. It was the first FDA-approved medication for fibromyalgia patients. Lyrica is normally prescribed to patients as an additional treatment when other medications have been unsuccessful in controlling their seizures. Because the Pregabalin is able to stabilize electrical nerve activity, it is also used to treat neuropathic pain in patients who have suffered spinal cord injuries."}, {"url": "http://www.everydayhealth.com/drugs/lyrica", "passage_text": "A: Lyrica (pregabalin) is a medication used to treat nerve pain, seizures, and fibromyalgia. It works by slowing down impulses in the brain that cause seizures and also affects chemicals in the brain that send pain signals across the nervous system. A: Lyrica (pregabalin) is an anticonvulsant or anti-seizure medication. The exact way it works is not completely understood, but it is thought to slow down impulses in the brain and affect pain signals in the body."}, {"url": "http://www.news-medical.net/drugs/Lyrica.aspx", "passage_text": "What Lyrica is used for. Lyrica is used to treat neuropathic pain, which is pain caused by an abnormality of, or damage to, the nerves. Lyrica is also used to control epilepsy. Epilepsy is a condition where you have repeated seizures (fits). There are many different types of seizures, ranging from mild to severe. Lyrica also has pain relieving effects. Lyrica may be used alone, or in combination with other medicines, to treat your condition. Your doctor may prescribe Lyrica in addition to your current therapy when your current treatment is no longer working as well as before."}, {"url": "https://www.sharecare.com/health/fibromyalgia-treatment-medications/why-doctor-prescribe-lyrica", "passage_text": "Your doctor is the best person to tell you why he or she prescribed Lyrica for you. Lyrica is the brand name for pregabalin. It is an oral medication, which means you take it by mouth. It is one of three medications approved by the U.S. Food and Drug Administration (FDA) to treat fibromyalgia. It is also prescribed for treating pain from diabetic neuropathy or from the viral infection shingles"}, {"url": "https://www.sharecare.com/health/fibromyalgia-treatment-medications/why-doctor-prescribe-lyrica", "passage_text": "There are several possible reasons that your doctor prescribed Lyrica for you. Lyrica, also known by its generic name of pregabalin, is a medication taken by mouth that can help people with certain conditions manage their pain, or it can help prevent partial onset seizures. Lyrica is the brand name for pregabalin. It is an oral medication, which means you take it by mouth. It is one of three medications approved by the U.S. Food and Drug Administration (FDA) to treat fibromyalgia."}, {"url": "http://www.lyrica.com/frequently-asked-questions", "passage_text": "LYRICA (LEER-i-kah) is a prescription medicine approved by the US Food and Drug Administration (FDA) to treat fibromyalgia, diabetic nerve pain, spinal cord injury nerve pain and pain after shingles. LYRICA is also indicated to treat partial onset seizures in adults with epilepsy who take 1 or more drugs for seizures. "}]