[{"url": "http://whfoods.org/genpage.php?tname=dailytip&dbid=363", "passage_text": "Molasses produced for human consumption in the United States is made from sugar cane. The two main tasks required to make molasses from sugar cane are to separate out the sugar cane juice from the pulp, and then to extract the sugar (mostly sucrose) from the juice. "}, {"url": "https://en.wikipedia.org/wiki/Sweet_sorghum", "passage_text": "Sweet sorghum syrup is sometimes called  molasses  or sorghum molasses in some regions of the U.S., but the term molasses more properly refers to a different sweet syrup, made as a byproduct of sugarcane or sugar beet sugar extraction. "}, {"url": "http://www.madehow.com/Volume-5/Molasses.html", "passage_text": "Molasses. Molasses, from the Latin word melaceres, meaning honey-like, is a thick dark syrup that is a byproduct of sugar refining. It results when sugar is crystallized out of sugar cane or sugar beet juice. Molasses is sold both for human consumption, to be used in baking, and in the brewing of ale and distillation of rum, and as an ingredient in animal feed. In addition to molasses, which is itself a byproduct of the processing of sugar cane, there are several others materials that are used for other purposes. After pressing the juice out of the cane stalks, the dry stalk residue, called bagasse, are used as fuel in the plant."}, {"url": "http://www.grandmasmolasses.com/questions/", "passage_text": "A: Sulfured molasses is made from immature, green sugarcane that is then treated with sulfur fumes during the sugar extracting process whereas Grandma’s unsulfured molasses is made of the finest quality, pure unsulfured juice of sun-ripened sugarcane. A: Grandma’s Molasses is made from of the finest quality, unsulfured juice of sun-ripened sugarcane. After the sugarcane is cut and crushed, the juices are extracted and boiled."}, {"url": "https://en.wikipedia.org/wiki/Molasses", "passage_text": "Molasses, or black treacle (British, for human consumption; known as molasses otherwise), is a viscous by-product of the refining of sugarcane or sugar beets into sugar. The word comes from the Proto-Indo-European *melid . Mélid cognates Include Ancient greek (μέλι) (meli), Méli honey, Latin mel. portuguese melaco melaço Blackstrap molasses, or simply blackstrap, is the dark, viscous molasses remaining after maximum extraction of sugar from raw sugar cane. This residual product of sugar refining is used in the manufacture of ethanol for industry and as an ingredient in cattle feed."}, {"url": "http://www.thekitchn.com/a-guide-to-molasses-ingredient-intelligence-210864", "passage_text": "How Molasses Is Made. The most common forms of molasses are made from either sugar cane or sugar beet juice which is boiled down to a syrup. Sugar crystals are extracted from the syrup, and the remaining dark liquid is molasses. Molasses can also be made from sorghum, pomegranate, carob, and dates. Blackstrap Molasses. 1  How it's made: Blackstrap is made from the third and final boiling of the molasses. 2  How it tastes: It is the thickest and darkest in color, and also the least sweet with a pronounced bitter flavor. 3  How to use it: Since it is bitter, only use blackstrap molasses if a recipe specifically calls for it."}, {"url": "http://www.thekitchn.com/a-guide-to-molasses-ingredient-intelligence-210864", "passage_text": "1 How it's made: Dark molasses comes from the second boiling of the cane or beet juice. 2  How it tastes: Thicker, less sweet, darker, and stronger in flavor than light molasses. 3  How to use it: It can generally be used in place of light molasses and is what gives gingerbread cookies their distinct color and flavor. Blackstrap Molasses. 1  How it's made: Blackstrap is made from the third and final boiling of the molasses. 2  How it tastes: It is the thickest and darkest in color, and also the least sweet with a pronounced bitter flavor. 3  How to use it: Since it is bitter, only use blackstrap molasses if a recipe specifically calls for it."}, {"url": "http://www.thekitchn.com/a-guide-to-molasses-ingredient-intelligence-210864", "passage_text": "The most common forms of molasses are made from either sugar cane or sugar beet juice which is boiled down to a syrup. Sugar crystals are extracted from the syrup, and the remaining dark liquid is molasses. Blackstrap Molasses. 1  How it's made: Blackstrap is made from the third and final boiling of the molasses. 2  How it tastes: It is the thickest and darkest in color, and also the least sweet with a pronounced bitter flavor. 3  How to use it: Since it is bitter, only use blackstrap molasses if a recipe specifically calls for it."}, {"url": "http://www.grandmasmolasses.com/about/", "passage_text": "Grandma’s is America’s #1 brand of molasses that has been a trusted, household name generation after generation. Grandma’s Molasses is made of the highest grade sugarcane molasses that is unsulfured and contains no preservatives, artificial flavor or artificial color. It’s the secret ingredient for baking and cooking. Grandma’s Molasses is a nutritious alternative to refined sugar that is also Kosher and gluten free. "}, {"url": "http://foodreference.about.com/od/Sweeteners/a/What-Is-Molasses.htm", "passage_text": "Molasses is the dark, sweet, syrupy byproduct made during the extraction of sugars from sugarcane and sugar beets. Molasses can vary in color, sweetness, and nutritional content depending on the variety or how much sugar has been extracted. Molasses Varieties. 1  Light Molasses: This is the syrup left over after the first boiling cycle of sugarcane juice. 2  This molasses is the lightest in color, has the highest sugar content, and the least viscous texture. 3  Dark Molasses: Dark molasses is the byproduct of the second boiling cycle of sugarcane."}]