[{"url": "https://en.wikipedia.org/wiki/Ludendorff_Bridge", "passage_text": "The Ludendorff Bridge (sometimes referred to as the Bridge at Remagen) was in early March 1945 one of two remaining bridges across the River Rhine in Germany when it was captured during the Battle of Remagen by United States Army forces during the closing weeks of World War II."}, {"url": "http://www.imdb.com/title/tt0064110/", "passage_text": "The film is based on real events, though the characters are fictitious, those are the following: The Ludendorff Bridge at Remagenthe last standing on the Rhine was captured by soldiers of the U.S. 9th Armored Division on 7 March 1945, during Operation Lumberjack."}, {"url": "http://www.1940.co.uk/acatalog/the-bridge-at-remagen.html", "passage_text": "All thats left of the Bridge at RemagenThe town of Remagen is situated on the western bank of the River Rhine, roughly mid-way between Cologne and Koblenz. Being an ideal location for a crossing point, the bridge was constructed during the First World War to speed up the transfer of troops from east to west."}, {"url": "http://www.eyewitnesstohistory.com/remagen.htm", "passage_text": "As the Allied armies approached, Hitler ordered the destruction of all the bridges that spanned the Rhine. By March 7, they all had been, except one-the Ludendorff railroad bridge at the little resort town of Remagen a few miles to the southeast of Cologne."}, {"url": "http://militaryhistory.about.com/od/worldwarii/p/remagen.htm", "passage_text": "By Kennedy Hickman. Conflict: The capture of the Ludendorff Bridge at Remagen occurred during the closing stages of World War II (1939-1945). Dates: The battle and capture of the bridge at Remagen took place on March 7-8, 1945. Bridge at Remagen-Overview: In March 1945, with the bulge caused by the German Ardennes offensive effectively reduced, the US 1st Army launched Operation Lumberjack."}, {"url": "http://www.remagenbridge.com/", "passage_text": "There are no walk-ons for the Bridge at Remagen, March 7, 1945 event. Vendors are welcome, cost is $20.00 per person attending, you must be registered to attend. ARMOR IS BACK ! Multiple German and U.S. armor will be attending our Remagen Bridge and Tactical."}, {"url": "http://www.imdb.com/title/tt0064110/", "passage_text": "The real Bridge at Remagen was also known as Ludendorff Bridge. a railway bridge that ran across the Rhine River. It connected the town of Remagen with the town of Erpel, situated between two ridge lines of hills that flanked"}]