[{"url": "http://www.georgiaencyclopedia.org/articles/history-archaeology/albany-movement", "passage_text": "Yet at important moments, Albany's African Americans rose above the divisions. They did so in mid-November 1961, when the major black improvement organizations in town formed the Albany Movement and selected as their president William G. Anderson, a young black osteopath. It was the first mass movement in the modern civil rights era to have as its goal the desegregation of an entire community, and it resulted in the jailing of more than 1,000 African Americans in Albany and surrounding rural counties."}, {"url": "http://www.walb.com/story/16047367/recalling-the-hisotry-of-the-albany-movement", "passage_text": "But they were willing to go to jail.. And Albany Movement leaders called on the leading voice in the national civil rights movement for help. We must be willing to fill up the jails all over the state of Georgia, said King. The King strategy was basically to overwhelm the system like Ghandi did in India. Before Dr. Martin Luther King, Junior dreamed of the March on Washington, before he faced down Billy clubs in Birmingham, before he marched on Selma's Edmund Pettus Bridge on Bloody Sunday, he came to Albany to help lead a group of locals and college students and visiting activists in the Albany Movement."}, {"url": "http://www.answers.com/Q/What_was_the_Albany_Movement", "passage_text": "Martin Luther King Jr. was drawn into the movement in December 1961 when hundreds of black protesters, including himself, were arrested in one week, but eight months later King left Albany admitting that he had failed to accomplish the movement's goals. When told as a chapter in the history of the national civil rights movement, Albany was important because of King's involvement and because of the lessons he learned that he would soon apply in Birmingham, Alabama. Out of Albany's failure, then, came Birmingham's success. 2 people found this useful."}, {"url": "http://crdl.usg.edu/events/albany_movement/", "passage_text": "Background: In November 1961, residents of Albany, Georgia, launched an ambitious campaign to eliminate segregation in all facets of local life. The movement captured national attention one month later when local leaders invited Martin Luther King, Jr. to join the protest. Subsequent appraisals, however, have identified the movement as a formative learning experience for King and other civil rights organizers, and credited it with hastening the ultimate desegregation of Albany's facilities, which occurred only one year following the movement's conclusion in August 1962."}, {"url": "https://answers.yahoo.com/question/index?qid=20100507080952AAZUY0g", "passage_text": "The movement was led by William G. Anderson, a local black physician. In December 1961, Martin Luther King, Jr and the Southern Christian Leadership Conference (SCLC) became involved. The Albany Movement mobilized thousands of citizens and attracted nationwide attention but failed to accomplish its goals because of a determined opposition. Answers. Best Answer: I have to be honest and say that I had to look the answer to your question up on the internet and this is what is says:- The Albany Movement was a desegregation coalition formed in Albany, Georgia, on November 17, 1961."}, {"url": "https://en.wikipedia.org/wiki/Albany_Movement", "passage_text": "(February 2011). The Albany Movement was a desegregation coalition formed in Albany, Georgia, on November 17, 1961, by local activists, the Student Nonviolent Coordinating Committee (SNCC), and the National Association for the Advancement of Colored People (NAACP). They formed the Albany Movement to coordinate their leadership, with William G. Anderson made president on the recommendation of Slater King, and Slater King was made vice president. The incorporation documents were largely the work of C. B. King."}, {"url": "https://en.wikipedia.org/wiki/Albany_Movement", "passage_text": "The Albany Movement mobilized thousands of citizens and attracted nationwide attention, but failed to accomplish its goals because of a determined opposition. However, it was credited as a key lesson in strategy and tactics for the American Civil Rights Movement. They formed the Albany Movement to coordinate their leadership, with William G. Anderson made president on the recommendation of Slater King, and Slater King was made vice president. The incorporation documents were largely the work of C. B. King."}, {"url": "http://www.georgiaencyclopedia.org/articles/history-archaeology/albany-movement", "passage_text": "When told as a chapter in the history of the national civil rights movement, Albany was important because of King's involvement and because of the lessons he learned that he would soon apply in Birmingham, Alabama. It was the first mass movement in the modern civil rights era to have as its goal the desegregation of an entire community, and it resulted in the jailing of more than 1,000 African Americans in Albany and surrounding rural counties."}, {"url": "http://www.georgiaencyclopedia.org/articles/history-archaeology/albany-movement", "passage_text": "Aftereffects. From King's perspective the Albany Movement was a failure, but African Americans in Albany disagreed. King's failure did not mean that the movement failed. SNCC field secretary Charles Sherrod remarked, Now I can't help how Dr. King might have felt, . . . but as far as we were concerned, things moved on. It was the first mass movement in the modern civil rights era to have as its goal the desegregation of an entire community, and it resulted in the jailing of more than 1,000 African Americans in Albany and surrounding rural counties."}]