[{"url": "http://oregonstate.edu/dept/biochem/hhmi/hhmiclasses/bb494/pcrohtwo.html", "passage_text": "To make primers of the correct sequence that will bind to the template DNA, it is necessary to know a little bit of the template sequence, on either side of the region of DNA you wish to amplify. DNA polymerase and dNTPs are commercially available from biotechnology supply companies. The template is the DNA that contains the target you want to amplify. The primers are synthetic DNA molecules whose sequence matches a region flanking the target you are trying to amplify. It is possible nowadays, to chemically synthesize DNA molecules of any given base sequence, to use as primers."}, {"url": "https://agctsequencing.wordpress.com/2012/05/14/primer-selection-guidelines-good-primers-important-for-pcr-and-automated-sequencing/", "passage_text": "Primer sequences are determined from known sequence since there must be a match to the region of DNA to be amplified. PCR amplification requires 2 primers that determine the region of sequence amplified in the forward and reverse direction. Likewise, the reverse primer is designed from the complimentary strand. PCR is exponential amplification in which the newly generated PCR fragment from one cycle also acts as a template for the next cycle (Figure 1A). Amplification of DNA for Sanger sequencing differs from PCR in that a single primer is used. Amplification is the reproduction of one strand using the compliment from the original strand"}, {"url": "http://www.premierbiosoft.com/tech_notes/PCR_Primer_Design.html", "passage_text": "The important design considerations described below are a key to specific amplification with high yield. The preferred values indicated are built into all our products by default. 1. Primer Length: It is generally accepted that the optimal length of PCR primers is 18-22 bp. This length is long enough for adequate specificity and short enough for primers to bind easily to the template at the annealing temperature. 2. Primer Melting Temperature: Primer Melting Temperature (T m) by definition is the temperature at which one half of the DNA duplex will dissociate to become single stranded and indicates the duplex stability. Primers with melting temperatures in the range of 52-58 o C generally produce the best results."}, {"url": "https://www.promega.com/resources/product-guides-and-selectors/protocols-and-applications-guide/pcr-amplification/", "passage_text": "The PCR process was originally developed to amplify short segments of a longer DNA molecule (Saiki et al. 1985). A typical amplification reaction includes target DNA, a thermostable DNA polymerase, two oligonucleotide primers, deoxynucleotide triphosphates (dNTPs), reaction buffer and magnesium. If an amplification reaction fails and you suspect the DNA template is contaminated with an inhibitor, add the suspect DNA preparation to a control reaction with a DNA template and primer pair that has amplified well in the past."}, {"url": "http://oregonstate.edu/dept/biochem/hhmi/hhmiclasses/bb494/pcrohtwo.html", "passage_text": "Since PCR is, basically, replication of DNA in a test-tube, all the usual ingredients needed for DNA replication are required: A template (the DNA that is being copied) Primers (to initiate the synthesis of the new DNA strands) DNA polymerase (to carry out the synthesis) dNTPs (nucleotide precursors). The template is the DNA that contains the target you want to amplify. The primers are synthetic DNA molecules whose sequence matches a region flanking the target you are trying to amplify. It is possible nowadays, to chemically synthesize DNA molecules of any given base sequence, to use as primers."}, {"url": "http://oregonstate.edu/dept/biochem/hhmi/hhmiclasses/bb494/pcrohtwo.html", "passage_text": "PCR stands for Polymerase Chain Reaction, a method for amplifying DNA in vitro. Where, in cloning DNA into a plasmid, the DNA is amplified by the bacterial cell when it replicates the plasmid, PCR amplifies DNA in a test-tube. The template is the DNA that contains the target you want to amplify. The primers are synthetic DNA molecules whose sequence matches a region flanking the target you are trying to amplify. It is possible nowadays, to chemically synthesize DNA molecules of any given base sequence, to use as primers."}, {"url": "http://www.sigmaaldrich.com/life-science/molecular-biology/pcr/pcr-products.html", "passage_text": "The polymerase chain reaction (PCR) is a powerful core molecular biology technique. It is an efficient and rapid in vitro method for enzymatic amplification of specific DNA or RNA sequences from nucleic acids of various sources. A simple PCR reaction consists of a set of synthetic oligonucleotide primers that flank the target DNA sequence, target DNA, a thermostable DNA polymerase and dNTPs. "}, {"url": "http://www.cybertory.org/exercises/primerDesign/index.html", "passage_text": "After completing this exercise, you should be able to: Design PCR primers to amplify given target regions from a DNA template. Identify the direction in which a given primer would be extended by polymerase on a given template. Design a pair of primers to amplify the entire length of the following 45 base pair sequence. Make each primer 14 bases long. Write the sequences of the primers in 5' to 3' order."}, {"url": "http://oregonstate.edu/instruct/bb494/pcr.html", "passage_text": "PCR works by repeated cycles of strand separation, annealing of primers, and extension of the primed strands. Simply put, the target DNA is replicated in vitro, many, many times, to obtain a large amount of the DNA that lies between the two primer regions. To make primers of the correct sequence that will bind to the template DNA, it is necessary to know a little bit of the template sequence, on either side of the region of DNA you wish to amplify."}]