[{"url": "http://www.marcusoil.com/support_faq.html", "passage_text": "Paraffin wax is usually produced as a by-product of oil refining. It has a molecular weight which is usually less than half that of most polyethylene waxes. Because of this and other differences, paraffin wax usually has a much lower melt point and is softer than most polyethylene waxes. 5."}, {"url": "http://www.astroamericanchemical.com/products/emulsions/", "passage_text": "Astro American Chemical supplies a wide range of water-based polyethylene emulsions, silicone emulsions, paraffin-PE emulsions, and polypropylene emulsions. Our emulsions are formulated to improve the rub-resistance of water-based inks and coatings without significant loss of gloss. "}, {"url": "http://stainsfile.info/StainsFile/prepare/process/carbowax.htm", "passage_text": "Stearic acid. Water soluble wax, Carbowax, polyethylene glycol and PEG are all terms used to describe the same material. Chemically they are polyethylene glycols of varying degrees of polymerisation and molecular weights, or polyethylene glycol fatty acid esters, such as polyethylene glycol monostearate. Like paraffin waxes, polyethylene glycol is usually a mixture of materials with varying molecular weights, due in this case to varying degrees of polymerisation, rather than a single molecular entity. When purchasing, the molecular weight has to be specified to ensure the correct material."}, {"url": "http://mitsuichemicals.com/hiwax.htm", "passage_text": "HI-WAX™ Polyethylene Wax. Solid or semisolid matter at room temperature Low melting point, melted at room temperature ~150°C Cystalline low molecular resin Molecular weight: 300 ~10,000 (low molecular). HI-WAX™ is a polyethylene wax with various grades in Polymerization type, Modified type and Thermally Cracking type. The wax can be used as a slip agent, disperant, resin modifier, and mold release agent due to its molecular structure, which enables it to outperform natural waxes. Mold Release Agent for the Molding of Plastics. The polyethylene wax can be used as a mold release agent for plastics due to its releasability which increases productivity, prevents pollution and enables the molding of complex shapes."}, {"url": "http://www.irmwax.com/products/Polyethene_wax.aspx", "passage_text": "Polyethylene Wax, also known as PE Wax, is an ultra low molecular weight polyethylene consisting of ethylene monomer chains. PE wax has a large variety of uses and applications. PE Wax is available from on-purpose production and as a byproduct of polyethylene production. "}, {"url": "http://thaipolychemicals.weebly.com/oxidized-polyethylene-wax.html", "passage_text": "Oxidized Polyethylene Wax(OPE) is widely used in processing of packing materials and thermoshrink film as external lubricant. Oxidized Polyethylene Wax(OPE) is used as processing auxiliaries for PVC shapes, pipes and plates to increase the surface smoothness of the processed products with an amount of 0.3-0.5%. A method of preparation of oxidized polyethylene waxes, which have many applications such as in plastics, rubber, leather, paper, inks and textile, etc. was developed."}, {"url": "http://www.marcusoil.com/", "passage_text": "Polyethylene waxes are low molecular weight ethylene derived polymers supplied in different forms including micronized and oxidized polyethylene wax used in a wide variety of applications including adhesives, candles, plastics and coatings. Marcus Oil is now ISO ISO 9001 and ISO 14001 certified Click Here for details. "}, {"url": "http://www.afpm.org/wax-facts/", "passage_text": "The word wax usually refers to a variety of organic substances that are solid at ambient temperature but become free-flowing liquids at slightly higher temperatures. The chemical composition of waxes is complex, but normal alkanes are always present in high proportion and molecular weight profiles tend to be wide. The main commercial source of wax is crude oil but not all crude oil refiners produce wax. Mineral wax can also be produced from lignite."}, {"url": "http://basstechintl.com/products/polyethylene-wax/", "passage_text": "Polyethylene Wax, referred to as PE Wax, is a thermoplastic polymer consisting of long ethylene monomer chains. Polyethylene is one of the most widely used plastics in the world, and PE wax has a large variety of uses and applications. PE Wax is available from on-purpose production and as a byproduct of polyethylene production. This material is available in both HDPE and LDPE forms."}, {"url": "http://thaipolychemicals.weebly.com/oxidized-polyethylene-wax.html", "passage_text": "Versatile range of applications. Oxidized polyethylene waxes are used as lubricants in the processing of plastics such as polyvinylchloride to prevent the plastic from sticking to the hot surfaces in the machinery, which saves energy and enhances the material properties of products such as PVC pipes and profiles. A method of preparation of oxidized polyethylene waxes, which have many applications such as in plastics, rubber, leather, paper, inks and textile, etc. was developed."}]