[{"url": "http://www.reportlinker.com/ci02033/Breakfast-and-Cereal.html", "passage_text": "Part of the world cereal product business, the breakfast & cereal industry was worth $28 billion in 2010, having recorded close to 4% yearly growth for the four preceding years, reports MarketLine."}, {"url": "http://sellingrestaurants.com/how-do-i-value-my-restaurant.html", "passage_text": "To derive a value, one merely selects a percentage, say 30%, and multiplies it by the revenue or sales of the business not including sales taxes. For example, if the business had revenues of $1,000,000 and the percentage factor of 30% was used, then the business value is $300,000."}, {"url": "http://www.divinechocolate.com/uk/about-us/research-resources/resources/chocolate-facts", "passage_text": "1 This equates to about 3 bars a week. 2  The UK chocolate industry is worth £3.96billion (Source: Mintel 2012) andsales of chocolate just keep growing and growing, with an estimated 35% increase in sales over the next five years."}, {"url": "http://sellingrestaurants.com/how-do-i-value-my-restaurant.html", "passage_text": "Then again I apply the method decribed above and assign a number to the business. The closer the number is to 4, the closer my cap rate will be to 25-30%. The closer the number is to 1 the closer my cap rate will be to 50%."}, {"url": "http://raconteur.net/lifestyle/business-face-of-uk-beauty", "passage_text": "The UK beauty industry is in the pink. Employing more than one million people and worth £17 billion, it is forecast to grow 16 per cent by 2016. Despite the recession, retail sales in the UK beauty market grew 15.5 per cent from £6.1 billion in 2008 to an estimated £7.1 billion in 2013."}, {"url": "http://www.kgbanswers.co.uk/how-much-is-the-uk-night-club-industry-worth-and-also-the-bar-industry-and-where-did-you-find-it-out-thanks/2011477", "passage_text": "How much is the uk night club industry worth and also the bar industry and where did you find it out! thanks. Acc. to Human Geography of the UK: An Introduction by Irene Hardill, et al. the nightclub industry of the UK is worth an estimated £2bn a year. report this answer."}, {"url": "http://www.divinechocolate.com/uk/about-us/research-resources/resources/chocolate-facts", "passage_text": "1 The UK chocolate industry is worth £3.96billion (Source: Mintel 2012) andsales of chocolate just keep growing and growing, with an estimated 35% increase in sales over the next five years."}, {"url": "http://www.reportlinker.com/ci02033/Breakfast-and-Cereal.html", "passage_text": "Ready-to-eat cereals represented the leading market segment, generating almost $24.5 billion in 2010 to account for more than 87% of the overall market in terms of value. Market growth is expected to accelerate to exceed a yearly rate of 4% between 2010 and 2015, when it should generate more than $34 billion."}]