[{"url": "http://www.answers.com/Q/What_is_the_fluid_inside_the_mitochondria_called", "passage_text": "It is called the Cytoplasm. The fluid inside a Cell is called cytoplasm. It serves as a medium were organelles such as vesicles, mitochondria and the Golgi Apparatus are ins … ide, providing the cell with Life's needs; [ALSO the major ingredient of the fluid inside cells is (WATER)]. + 23 others found this useful. Sanjeev Mahajan."}, {"url": "http://faculty.fmcc.suny.edu/mcdarby/Majors101Book/Chapter_04-Cell_Structure&Function/02-Parts_of_Advanced_Cells.htm", "passage_text": "During photosynthesis, light energy is used to produce ATP molecules which are then used to construct sugar molecules from carbon dioxide and hydrogen obtained from water. Chloroplasts have two outer membranes and several stacks of small disc-shaped membranes called thylakoids (also spelled thylacoids) inside."}, {"url": "http://ghr.nlm.nih.gov/handbook/basics/mtdna", "passage_text": "Mitochondria (illustration) are structures within cells that convert the energy from food into a form that cells can use. Each cell contains hundreds to thousands of mitochondria, which are located in the fluid that surrounds the nucleus (the cytoplasm)."}, {"url": "http://sciencelearn.org.nz/Contexts/Digestion-Chemistry/Looking-Closer/Mitochondria-cell-powerhouses", "passage_text": "Image: Cell featuring mitochondria. Mitochondria are tiny organelles inside cells that are involved in releasing energy from food. This process is known as cellular respiration. It is for this reason that mitochondria are often referred to as the powerhouses of the cell."}, {"url": "http://www.answers.com/Q/What_is_the_fluid_inside_the_mitochondria_called", "passage_text": "The fluid found in the innermost part of mitochondria is called the mitochondrial matrix. The mitochondrial matrix is a viscous fluid that contains the mitochondria's DNA an … d ribosomes."}, {"url": "http://www.chegg.com/homework-help/questions-and-answers/gel-like-fluid-substance-within-mitochondrion-called-poisoning-na-k-pump-would-physical-pr-q4884734", "passage_text": "home / study / questions and answers / science / biology / the gel-like fluid substance within a mitochondrion ..."}]