[{"url": "https://answers.yahoo.com/question/index?qid=20080405212503AAelIQD", "passage_text": "Report Abuse. If you (or your parents) had to apply for your citizenship-then you are probably a Naturalized citizen. If one of your parents was already American at the time of your birth then you might be a natural-born US citizen who just happened to be born in a different country. :-). Butterscotch · 8 years ago. Thumbs up. 4"}, {"url": "https://en.wikipedia.org/wiki/Naturalization", "passage_text": "Naturalization (or naturalisation) is the legal act or process by which a non-citizen in a country may acquire citizenship or nationality of that country. It may be done by a statute, without any effort on the part of the individual, or it may involve an application and approval by legal authorities. Today, lawful permanent resident aliens can apply for naturalization in the United States after five years, unless they continue to be married to a U.S. citizen, in which case they can apply after three years of permanent residency."}, {"url": "https://en.wikipedia.org/wiki/Natural-born-citizen_clause", "passage_text": "Status as a natural-born citizen of the United States is one of the eligibility requirements established in the United States Constitution for election to the office of President or Vice President. This requirement was intended to protect the nation from foreign influence. Upon principle, therefore, I can entertain no doubt, but that by the law of the United States, every person born within the dominions and allegiance of the United States, whatever the situation of his parents, is a natural born citizen."}, {"url": "http://legal-dictionary.thefreedictionary.com/Naturalized+citizen", "passage_text": "Naturalized citizen. NATURALIZED CITIZEN. One who, being born an alien, has lawfully become a citizen of the United States Under the constitution and laws. 2. He has all the rights of a natural born citizen, except that of being eligible as president or vice-president of the United States. In foreign countries he has a right to be treated as such, and will be so considered even in the country of his birth, at least for most purposes. 1 Bos. & P. 430."}, {"url": "http://www.definitions.net/definition/Naturalization", "passage_text": "Naturalization is the acquisition of citizenship and nationality by somebody who was not a citizen of that country. "}, {"url": "https://en.wikipedia.org/wiki/Natural-born-citizen_clause", "passage_text": "Therefore every person born within the United States, its territories or districts, whether the parents are citizens or aliens, is a natural born citizen in the sense of the Constitution, and entitled to all the rights and privileges appertaining to that capacity. ... Upon principle, therefore, I can entertain no doubt, but that by the law of the United States, every person born within the dominions and allegiance of the United States, whatever the situation of his parents, is a natural born citizen."}, {"url": "http://www.wisegeek.com/what-is-a-naturalized-citizen.htm", "passage_text": "A naturalized citizen is a foreign national who is granted citizenship in the United States after fulfilling certain requirements. In addition to the United States, many other nations offer naturalization to people who wish to apply for citizenship. A natural citizen is someone born in the United States or born to American parents on foreign soil. A naturalized citizen is someone who was born in a foreign country, but took a series of steps with the end goal of being granted"}, {"url": "http://definitions.uslegal.com/n/naturalized-citizen/", "passage_text": "Naturalized Citizen Law & Legal Definition. A naturalized citizen is a person who was born an alien, but has lawfully become a citizen of the United States under the U.S. Constitution and laws. A naturalized citizen has all the rights of a natural born citizen, except is not eligible as president or vice-president of the United States. In foreign countries he has a right to be treated as such, and will be considered a U.S. citizen even in the country of his birth, at least for most purposes. To become a citizen, one must take the oath of allegiance. By doing so, an applicant swears to: 1  support the Constitution and obey the laws of the U.S.; 2  renounce any foreign allegiance and/or foreign title; and."}, {"url": "http://teacher.scholastic.com/activities/government/civics4.htm", "passage_text": "The U.S. Constitution gives Congress the power to make naturalization laws for the United States. No state can give citizenship to aliens. A person can become a naturalized citizen of the United States individually or as part of a group. Generally any person who has come into the United States as an immigrant may become a naturalized citizen. "}]