[{"url": "http://www.japan-guide.com/e/e2172.html", "passage_text": "Mount Fuji (x m R, Fujisan) is with 3776 meters Japan's highest mountain. It is not surprising that the nearly perfectly shaped volcano has been worshiped as a sacred mountain and experienced big popularity among artists and common people throughout the centuries. Another easy way to view Mount Fuji is from the train on a trip between Tokyo and Osaka. If you take the shinkansen from Tokyo in direction of Nagoya, Kyoto and Osaka, the best view of the mountain can be enjoyed from around Shin-Fuji Station on the right hand side of the train, about 40-45 minutes into the journey."}, {"url": "https://www.quora.com/What-is-the-special-significance-of-Mount-Fuji", "passage_text": "Mt. Fuji is called Fuji-san in Japanese, written as 富士山, with 'san' = mountain. It is actually an active volcano, and is the most important peak symbolically in Japan. (People also call it Fuji-san to mean Mr. Fuji in a sense, because it's so familiar.). Some reasons for its importance: 1. Mt. Fuji is the tallest mountain in Japan (3,776.24 m) and is known widely for it's very symetricaly shaped cone. It is also an active volcano, having erupted last in 1707-8. Fuji-san has also been the subject of much art in Japan, most notably Hokusai's 36 views of Mt. Fuji."}, {"url": "http://www.jnto.go.jp/eng/indepth/scenic/mtfuji/fuji_01.html", "passage_text": "The highest mountain in Japan, Mt. Fuji is 3,776 meters above sea level, and is located more or less in the center of Japan, stretching over Shizuoka and Yamanashi prefectures. Its elegant conical form has frequently been depicted in many paintings and literary works since ancient times. Japan In-depth. Mt. Fuji is the most famous mountain in Japan. The area surrounding Mt. Fuji is a most attractive tourist route for there are all kinds of sightseeing spots as well as resorts. To climb Mt. Fuji, you will need to plan an overnight visit."}, {"url": "http://www.dailymail.co.uk/sciencetech/article-2694249/Will-Mount-Fuji-ERUPT-Volcano-critical-condition-devastating-2011-Tohoku-earthquake.html", "passage_text": "ALL ABOUT MOUNT FUJI. At an elevation of 3,776 metres (12,388 feet), Mount Fuji is the highest mountain in Japan. It is an active stratovolcano found on Honshu island that last erupted in December 1707. Known as the Hoei eruption, this is thought to have expelled a billion cubic metres of ash and debris."}, {"url": "https://en.wikipedia.org/wiki/Mount_Fuji", "passage_text": "Mount Fuji (富士山, Fujisan, IPA: [ɸɯᵝꜜdʑisaɴ] (listen)) , located on Honshu Island, is the highest mountain in Japan at 3,776.24 m (12,389 ft). An active stratovolcano that last erupted in 1707–08, Mount Fuji lies about 100 kilometres (60 mi) south-west of Tokyo, and can be seen from there on a clear day. Today, Mount Fuji is an international destination for tourism and mountain climbing. In the early 20th century, populist educator Frederick Starr 's Chautauqua lectures about his several ascents of Mount Fuji—1913, 1919, and 1923—were widely known in America."}, {"url": "http://akihabaranews.com/2013/09/02/article-en/mt-fuji-danger-lurks-beneath-1035435684", "passage_text": "Only 49 days later, on December 16, 1707, Mt. Fuji erupted. It is commonly thought that a major earthquake in Mt. Fuji's general area could setoff the required chain-reaction for a major eruption, and many say that the Tohoku earthquake of 2011 in the north of Japan could have already set this process in motion. We brought you news that on June 22, Mt. Fuji finally received World Heritage site status by UNESCO. The mountain's symbolism for the country and natural beauty cannot be denied, and it is something of a pilgrimage destination for people, not only from Japan, but from around the world."}, {"url": "http://akihabaranews.com/2013/09/02/article-en/mt-fuji-danger-lurks-beneath-1035435684", "passage_text": "About 100km southwest of Tokyo, rising to a height of 3,776 meters straight up in an almost perfect cone, unique in every respect from the surrounding countryside, it is hard not to admire Mt. Fuji's beauty, and for some, to wonder about how it got there and what is in store for its future. We brought you news that on June 22, Mt. Fuji finally received World Heritage site status by UNESCO. The mountain's symbolism for the country and natural beauty cannot be denied, and it is something of a pilgrimage destination for people, not only from Japan, but from around the world."}, {"url": "https://en.wikipedia.org/wiki/Mount_Fuji", "passage_text": "Mount Fuji is one of Japan's Three Holy Mountains (三霊山, Sanreizan) along with Mount Tate and Mount Haku. It is also a Special Place of Scenic Beauty and one of Japan's Historic Sites. It was added to the World Heritage List as a Cultural Site on June 22, 2013. Today, Mount Fuji is an international destination for tourism and mountain climbing. In the early 20th century, populist educator Frederick Starr 's Chautauqua lectures about his several ascents of Mount Fuji—1913, 1919, and 1923—were widely known in America."}, {"url": "http://www.huffingtonpost.com/2014/07/17/mount-fuji-critical-state-ready-erupt_n_5596656.html", "passage_text": "The seismic waves add to this pressure, causing even more disturbance. Mount Fuji is primed to spew. After 307 years, the massive active volcano in Japan may be due for another eruption as a result of a buildup of pressure from the 9.0-magnitude earthquake that hit the country's eastern coast in 2011. Mount Fuji Volcano Is in a 'Critical State,' New Study Warns. Will Mount Fuji ERUPT Volcano in critical condition after ... - Daily Mail. Japan earthquake has raised pressure below Mount Fuji, says new ..."}]