[{"url": "https://www.medreps.com/medical-sales-careers/pharmaceutical-sales-salary-report/", "passage_text": "Average Pharmaceutical Sales Salary by Age and Experience. Most pharma reps have to pay their dues before earning a big pharmaceutical sales rep salary. Those in their 20s and those with fewer than 2 years of experience report average earnings below $100k."}, {"url": "http://work.chron.com/much-money-pharmaceutical-sales-reps-make-8026.html", "passage_text": "Age and Experience. Older pharmaceutical representatives usually have higher base salaries than younger ones, according to MedReps.com. As of 2012, total income for those with less than two years experience averaged $81,000 per year, while those with 11 to 20 years experience averaged $132,000 annually."}, {"url": "https://www.medreps.com/medical-sales-careers/pharmaceutical-sales-salary-report/", "passage_text": "At $217, 629, the average pharmaceutical sales salary for sales directors and VPs is significantly higher than the second highest earners, sales managers, who earn $168,456. Average pharmaceutical sales rep salaries come in at $121,017, and this accounts for the majority of respondents."}, {"url": "https://www.medreps.com/medical-sales-careers/pharmaceutical-sales-salary-report/", "passage_text": "Pharma sales jobs may not be among the highest paying jobs in medical sales, but the average pharmaceutical sales rep salary is impressive by most standards. According to the 2015 Medical Sales Salary Report, the average pharmaceutical sales salary is $116,334 (Med. $115,000), and the average specialty pharma salary is $134,414 (Med. $125,000) for a combined average of $124,622."}, {"url": "http://work.chron.com/much-money-pharmaceutical-sales-reps-make-8026.html", "passage_text": "MedReps.com, a pharmaceutical jobs website, reported average annual total compensation for pharmaceutical sales representatives of $120,606 as of 2012. The average amount of their base salary was $91,746."}, {"url": "http://work.chron.com/much-money-pharmaceutical-sales-reps-make-8026.html", "passage_text": "Salary Report. MedReps.com, a pharmaceutical jobs website, reported average annual total compensation for pharmaceutical sales representatives of $120,606 as of 2012. The average amount of their base salary was $91,746."}, {"url": "http://work.chron.com/much-money-pharmaceutical-sales-reps-make-8026.html", "passage_text": "Medical device sales reps received total compensation of $155,000 on average, and biotech and biopharma representatives received $156,000 total average annual income. On average, male pharmaceutical sales reps earn 8 percent more than women, according to MedReps.com."}]