[{"url": "http://www.cntraveller.com/guides/europe/belgium/bruges/where-to-eat", "passage_text": "1 Bruges was generally over-priced-the food and drink in particular. 2  As far as I was concerned, the cuisine was-on the whole-sub-standard. Situated in the Sint Anna quarter and dating from 1515, this is one of Bruges' oldest cafes, cafés with walls tanned by the-pipe smoking regulars of. Yesteryear a photo album offers a glimpse of life at the end of the 19th, century though nothing much else seems to have changed since. then"}, {"url": "https://en.wikipedia.org/wiki/Belgian_cuisine", "passage_text": "Outside the country, Belgium is best known for its chocolate, waffles, fries and beer. Though Belgium has many distinctive national dishes, many internationally-popular foods like hamburgers and spaghetti bolognese are also popular in Belgium, and most of what Belgians eat is also eaten in neighbouring countries."}, {"url": "http://www.minube.co.uk/restaurants/belgium/west_flanders/bruges", "passage_text": "This restaurant-brewery is the most visited in Bruges, especially because of the wide variety of beers, not to mention its decor décor and, location which is on the edge of a. Canal you can visit the brewery and then taste the beers at. the 142 times. saved Eating in Belgium can be a bit expensive. We happened to find this place where they had meals for 5 and 6 €, super cheap compared to the rest of the city! Although we went to just have a snack, we ended up having waffles in Brussels."}, {"url": "https://en.wikipedia.org/wiki/Belgian_cuisine", "passage_text": "Belgian cuisine traditionally prizes regional and seasonal ingredients. Ingredients typical in Belgian dishes include potatoes, leeks, grey shrimp, white asparagus, Belgian endives and local beer, in addition to common European staples including meat, cheese and butter. Belgians typically eat three meals a day, with a light breakfast, light or medium-sized lunch and large dinner. Though Belgium has many distinctive national dishes, many internationally-popular foods like hamburgers and spaghetti bolognese are also popular in Belgium, and most of what Belgians eat is also eaten in neighbouring countries."}, {"url": "http://www.cntraveler.com/galleries/2014-09-08/10-things-you-should-eat-in-belgium", "passage_text": "Waffles, fries, chocolate, beer…there’s more to Belgium than junk food. Here are 10 traditional Belgian dishes you should try when you visit. Waffles, fries, chocolate, beer… Belgium may be famous for its junk food, but there's far more to its national cuisine than that. Ahead of the Eat! Brussels food festival, taking place in the capital September 11–14, we've picked 10 lesser-known Belgian dishes that are pleasure filled, not pound heavy"}, {"url": "http://www.cntraveller.com/guides/europe/belgium/bruges/where-to-eat", "passage_text": "Belgium Bruges is a city where the gruesome and the sensual lie side by side. If there is such a thing as a morbid bon viveur, then Bruges is its spiritual home. Primitive paintings of the martyrdoms of saints can be viewed in close proximity to shop-window displays of milk-chocolate breasts. Situated in the Sint Anna quarter and dating from 1515, this is one of Bruges' oldest cafes, cafés with walls tanned by the-pipe smoking regulars of. Yesteryear a photo album offers a glimpse of life at the end of the 19th, century though nothing much else seems to have changed since. then"}, {"url": "http://jetsettimes.com/2013/02/27/streetfoodbruges/", "passage_text": "At the waffle shop, we learned that there are two types of waffles in Belgium. In Bruges, they sell waffles made of dough that when pressed create a rather rounded shape and provide for a softer, more “melt-in-your-mouth” taste. In Brussels, Belgium waffles are made with a liquid batter and served in the typical square/rectangular shape. Belgian Waffles: After a decent amount of wandering in search of lunch, we quickly realized that unlike Spain and much of France, people don’t eat lunch between the hours of 2 and 4 PM in Belgium. Even restaurants sporting signs reading “Non-stop kitchen” were closed for food at this tim"}, {"url": "http://belgium.beertourism.com/cities/bruges/where-to-eat", "passage_text": "Discover Belgian beer and food in Bruges. No.1 travel guide for Belgium. Discover Belgian beer and food in Bruges. "}, {"url": "http://jetsettimes.com/2013/02/27/streetfoodbruges/", "passage_text": "After leaving Brussels on the train, a brief hour passed and we arrived in the small Belgian town of Bruges. Each house, storefront, restaurant, and exterior building featured a typical gable roof, but all featured false fronts that resembled a cascaded staircase. Belgian Waffles: After a decent amount of wandering in search of lunch, we quickly realized that unlike Spain and much of France, people don’t eat lunch between the hours of 2 and 4 PM in Belgium. Even restaurants sporting signs reading “Non-stop kitchen” were closed for food at this tim"}]