[{"url": "http://www.healthline.com/health/womens-health/why-is-my-period-brown", "passage_text": "In most cases, brown blood during your period is completely normal. Throughout your menstrual cycle, the color and consistency of blood can change. It can be thin and watery one day, and thick and clumpy the next. It may be bright red or brown, heavy or light. Typically, brown blood is present towards the end of your cycle. "}, {"url": "http://www.md-health.com/Brown-Period-Blood.html", "passage_text": "Different period blood colors. 1  Bright red: Bright red menstrual blood signifies that the blood was recently shed and released from the body. 2  This type of blood flow is usually light and one may be having frequent periods. 3  Dark red: Dark red blood is usually older blood. A woman's period blood colors and textures may vary during various stages of life and during times when certain conditions may interfere with the normal cycle. Here is a discussion of normal and abnormal conditions, which may affect the characteristics of one's periods."}, {"url": "http://www.md-health.com/Brown-Period-Blood.html", "passage_text": "It is normal for the period blood colors and textures to vary from bright red to brown or somewhat black and from thin to very thick. These changes may be a sign that the blood has been in the uterus for some time and has not been removed quickly. This may be a normal occurrence, which should not be a cause of concern. A woman's period blood colors and textures may vary during various stages of life and during times when certain conditions may interfere with the normal cycle. Here is a discussion of normal and abnormal conditions, which may affect the characteristics of one's periods."}, {"url": "http://www.webmd.com/women/guide/menstrual-blood-problems-clots-color-and-thickness", "passage_text": "You may notice that your menstrual blood becomes dark brown or almost black as you near the end of your period. This is a normal color change. It happens when the blood is older and not being expelled from the body quickly. Temporary thick, heavy flow isn't necessarily cause for concern. The clots may be bright red or dark in color. Often, these clots are shed on the heaviest days of bleeding. The presence of multiple clots in your flow may make your menstrual blood seem thick or denser than usual. Your body typically releases anticoagulants to keep menstrual blood from clotting as it's being released."}, {"url": "http://www.webmd.com/women/guide/menstrual-blood-problems-clots-color-and-thickness", "passage_text": "During your menstrual cycle, the lining of your uterus thickens to get ready for pregnancy. Then, during your period, your body sheds the uterus lining along with blood. The amount of blood and fluid lost is usually between 4 and 12 teaspoons each cycle. The clots may be bright red or dark in color. Often, these clots are shed on the heaviest days of bleeding. The presence of multiple clots in your flow may make your menstrual blood seem thick or denser than usual. Your body typically releases anticoagulants to keep menstrual blood from clotting as it's being released."}, {"url": "http://www.womens-health.co.uk/blood-clots-changing-blood-color-and-thickness-dur", "passage_text": "It is not abnormal for the color and density of menstrual blood to change during the course of a menstrual cycle. However, there are times when changes in the color and thickness of the blood or the presence of clotting may indicate a problem. If you are worried, see your doctor. "}, {"url": "http://www.lifewithgremlins.com/period-blood-colors-and-textures/", "passage_text": "Brown or Black period blood: Black or brown period blood colors are the oldest blood; most women notice these colors at the tail end of their period or during light spotting at the beginning. It usually isn’t that heavy. Keep in mind, that in most cases, changes in period blood colors or texture are entirely irrelevant and don’t suggest any health problem. However, prolonged changes such as frequent heavy periods, odors, irregular periods, short periods, and/or severe pain during menstruation should be evaluated."}, {"url": "http://www.webmd.boots.com/women/guide/menstrual-blood-problems-clots-colour-and-thickness", "passage_text": "Menstrual blood problems: Clots, colour and thickness. It is normal for the colour and consistency of menstrual blood to vary during a period. However, some unusual changes in colour, thickness or clotting may a blood problem that may need medical attention. Seek medical advice if you have concerns. "}, {"url": "http://www.lifewithgremlins.com/period-blood-colors-and-textures/", "passage_text": "Period blood colors: Bright red period blood: Bright red period blood is blood that was produced by the body recently. During a period, this just means what’s being shed was recently released in to the uterus. You may see more bright red blood if you have a lighter flow or frequent periods. Keep in mind, that in most cases, changes in period blood colors or texture are entirely irrelevant and don’t suggest any health problem. However, prolonged changes such as frequent heavy periods, odors, irregular periods, short periods, and/or severe pain during menstruation should be evaluated."}]