[{"url": "http://www.creditscoreresource.com/what-credit-score-is-needed-for-directv-direct-tv/40462", "passage_text": "Pretty much nobody is declined DirecTV and those with a range of credit scores, including poor credit scores, can still qualify to obtain satellite television through DirecTV. If you have a low credit score, you can still qualify to obtain DirecTV services, they will just require a deposit be made. The deposit can range from anywhere between $50 and $300 depending on the entertainment package you want and what your score is. After a specified period of time, with your account in good standing, you will be refunded all of your deposit. A low credit score is considered to be in the mid-500s range. Though there is no requirement for a minimum credit score, you are likely to get approved and pay a smaller deposit if your score is over 580. This does not, however, include the cost of installation."}, {"url": "http://www.askmefast.com/What_credit_score_does_directv_require_for_no_deposit-qna832100.html", "passage_text": "After that get a credit card and find out what day they report to the credit company. One month charge 100 dollars on it and have them report you have a $100 dollar balance then the next month make sure you pay it to a zero balance and have them report you paid off your card. 1 52% - What is the average credit score you need to start a new contract with at&t with no deposit? 2  46% - My credit score is fair will i be charged a deposit if i want a phone plan with at&t?"}, {"url": "http://www.satelliteguys.us/xen/threads/deposit-required-based-on-credit-check.279544/", "passage_text": "0. I am trying to get Directv again after 4 1/2 years of Dish Network. I left both Dish and Directv with my account fully paid and in good standing. Now, I am being told by Directv that I need to post a deposit of about $280 as well as some extra receiver fees after my credit check, and I was told Directv uses Experian. So, for the first time, I decided to pay for my credit score to see if there was a problem"}, {"url": "https://answers.yahoo.com/question/index?qid=20090122151226AAIBsYz", "passage_text": "Report Abuse. They dont. They use it to see if you need to pay a deposit. If you have good credit they dont need a deposit. If bad, then $200. The reason being, they bring equipment that totals around a $1000. They want to make sure you pay for this in their contract. Also, if you pay on time for the first 3 months, they credit your account with the $200. Hope this helps"}, {"url": "http://www.satellitetv-deal.com/blog/satellite-tv/can-you-get-directv-with-bad-credit", "passage_text": "Part of the process of getting DIRECTV involves a necessary evil, a quick credit check (it’s a “soft pull” and takes about 30 seconds). Yeah, it’s annoying but it’s an important step for DIRECTV since they provide customers with a bunch of free equipment and dishes (not to mention the free installation). There’s no hard and fast number, but if your score is over 570, you probably won’t have to pay a deposit and will qualify for every promotion going. If you’re under 570, they may ask you to provide a deposit of anywhere from $50-$200, depending on the type of package and receiver you’re interested in. Keep in mind that’s a deposit not a fee so it’ll be applied to your upcoming bills. DIRECTV is simply looking for a bit of assurance and a deposit does just that"}, {"url": "http://www.satellitetv-deal.com/blog/satellite-tv/can-you-get-directv-with-bad-credit", "passage_text": "Certainly not, but you may have to work with DIRECTV to still get the service. That is, they may waive the deposit if you switch to the smallest package and/or an entry-level receiver. It’s a trade-off but it’ll get your service going. There’s no hard and fast number, but if your score is over 570, you probably won’t have to pay a deposit and will qualify for every promotion going. If you’re under 570, they may ask you to provide a deposit of anywhere from $50-$200, depending on the type of package and receiver you’re interested in. Keep in mind that’s a deposit not a fee so it’ll be applied to your upcoming bills. DIRECTV is simply looking for a bit of assurance and a deposit does just that"}, {"url": "http://www.creditscoreresource.com/what-credit-score-is-needed-for-directv-direct-tv/40462", "passage_text": "This is why a credit report is run when applying to get DirecTV services. DirecTV actually uses their own, proprietary credit scoring system that was created by the company Equifax, which is one of the major credit score and reporting agencies often referred to as the “Big 3”. Though there is no requirement for a minimum credit score, you are likely to get approved and pay a smaller deposit if your score is over 580. This does not, however, include the cost of installation."}]