[{"url": "http://health.costhelper.com/microdermabrasion.html", "passage_text": "Usually, the cost of an individual microdermabrasion is $75, but they were running an amazing sale for the month of October for a set of 10. I purchased a set of 10 for $400+tax. ($438) I am 30 yrs old, African American and a severe cystic acne sufferer with scarring."}, {"url": "http://www.skinabrasion.net/cost.html", "passage_text": "1 The price of a single microdermabrasion varies between $75 and $200 in beauty salons or spas. 2  If you're lucky, you may get a 5-10% discount if you buy a 10 micro abrasion treatment pack."}, {"url": "http://www.medicinenet.com/microdermabrasion/article.htm", "passage_text": "Microdermabrasion costs may range from $100-$250, the average cost being around $100 per session. Costs have decreased considerably over the last five to 10 years as these units have become more readily available."}, {"url": "http://plasticsurgery.org/cosmetic-procedures/microdermabrasion.html?sub=Microdermabrasion+cost", "passage_text": "The average cost of microdermabrasion is $143, according to 2014 statistics from the American Society of Plastic Surgeons. The cost of microdermabrasion treatment can vary. The average fee referenced above does not include anesthesia, facilities or other related expenses."}, {"url": "http://www.docshop.com/education/dermatology/facial/microdermabrasion/cost-financing", "passage_text": "In fact, the price of a microdermabrasion treatment is often lower than that of most cosmetic dermatology procedures. According to the American Society of Plastic Surgeons, the cost of microdermabrasion ranges from $75 to more than $200 per session; in 2005, the average price was $177."}, {"url": "http://www.skinabrasion.net/cost.html", "passage_text": "1 Mild chemical peel-performed around 10 times per year, costs between $150 to $300, a total average of $2,100 per year. 2  Professional dermabrasion treatment costs between $1,500 and $4,000, depending on the size and depth of the treated area."}, {"url": "http://www.skinabrasion.net/cost.html", "passage_text": "1 A single facial microdermabrasion costs somewhere between $100 and $300 (not including the initial consultation which may cost an additional $150)."}, {"url": "http://www.microdermabrasion.net/cost/", "passage_text": "The cost of Microdermabrasion may vary greatly based on the type of microdermabrasion device used, your skin, region of the country the treatment is performed in, and who is performing it. There were over 550,000 microdermabrasion treatments performed in the United States in 2008 costing a little as $75 per session."}]