[{"url": "http://www.u-s-history.com/pages/h675.html", "passage_text": "The first formal committee of correspondence was established in Boston in 1764 and was charged with rallying opposition to the recently enacted Currency Act and the unpopular reforms imposed on the customs service."}, {"url": "http://www.bostonteapartyship.com/committees-of-correspondence", "passage_text": "The most influential Committees of Correspondence on the eve of the American Revolution were located in the colonies of Massachusetts, Rhode Island, New York, Pennsylvania, Delaware, Maryland, Virginia, and North Carolina."}, {"url": "http://www.history.com/topics/american-revolution/committees-of-correspondence", "passage_text": "Committees of Correspondence were the American colonies’ first institution for maintaining communication with one another. They were organized in the decade before the Revolution, when the deteriorating relationship with Great Britain made it increasingly important for the colonies to share ideas and information."}, {"url": "http://www.u-s-history.com/pages/h675.html", "passage_text": "In 1773, a correspondence committee of the House of Burgesses in Virginia wrote to the other assemblies to suggest that permanent committees be formed, a clear reflection that the crisis between mother country and colonies was deepening."}, {"url": "http://www.history.com/topics/american-revolution/committees-of-correspondence", "passage_text": "The Committees of Correspondence were the American colonies’ means for maintaining communication lines in the years before the Revolutionary War. In 1764, Boston formed the earliest Committee of Correspondence to encourage opposition to Britain’s stiffening of customs enforcement and prohibition of American paper money."}, {"url": "http://www.bostonteapartyship.com/committees-of-correspondence", "passage_text": "The Committees of Correspondence: The Voice of the Patriots. The Committees of Correspondence were provisional Patriot emergency governments established in response to British policy on the eve of the American Revolution throughout the Thirteen Colonies."}, {"url": "http://www.bostonteapartyship.com/committees-of-correspondence", "passage_text": "In late 1773, the Boston Committee of Correspondence was charged with managing the “tea crisis” and was the driving force of the December 16, 1773 Boston Tea Party…. These Committees of Correspondence were intercolonial standing provincial governments."}, {"url": "http://www.bostonteapartyship.com/committees-of-correspondence", "passage_text": "Additionally, Committees of Correspondence served as a vast network of communication throughout the Thirteen Colonies between Patriot leaders. On the verge of the American Revolution, Committees of Correspondence were formed in cities and regions throughout the American colonies."}, {"url": "http://www.history.com/topics/american-revolution/committees-of-correspondence", "passage_text": "In March 1773, the Virginia House of Burgesses proposed that each colonial legislature appoint a standing committee for intercolonial correspondence. Within a year, nearly all had joined the network, and more committees were formed at the town and county levels."}, {"url": "http://www.bostonteapartyship.com/committees-of-correspondence", "passage_text": "The first standing Committee of Correspondence was formed by Samuel Adams and twenty other Patriot leaders in November of 1772 in Boston in response to the Gaspee Gaspée, affair which had occurred the Previous june in the colony Of Rhode. island"}]