[{"url": "http://ths.gardenweb.com/discussions/2530239/deck-standard-size", "passage_text": "bruey. There is no standard size but I would keep it in even lengths, if you are thinking about PVC or PVC encapsulated or strait composite I would stay with 12', 16', or 20'. That's the length they are made and to cut off a foot or two just because your deck is a different size can get pricy. Most of the new products cost between a low of 2 dollars a foot to almost 4 dollars a foot. Those pcs in the scrap pile will add up to some big bucks. Like Bookmark April 9, 2012 at 9:14PM"}, {"url": "https://en.wikipedia.org/wiki/Standard_52-card_deck", "passage_text": "The deck of 52 French playing cards is the most common deck of playing cards used today. It includes thirteen ranks of each of the four French suits, clubs (♣), diamonds (♦), hearts (♥) and spades (♠), with reversible court or face cards. Some modern designs, however, have done away with reversible face cards. The weight of an average B8-sized playing card is 0.063 ounces (1.8 g), and a 52 card deck 3.3 ounces (94 g). The thickness and weight of modern playing cards is subject to numerous variables related to their purpose of use and associated material design for durability, stiffness, texture and appearance."}, {"url": "http://www.homedecks.com/deck-dimensions.php", "passage_text": "2. L-Shape Decks and Dimensions. L-Shape decks are broken down to two sets of measurements. The first set is for the left side of the deck and the second set is for the right side. The first dimension of each set is the where the deck meets the house. First set of measurements: The left side or A in the diagram below. "}, {"url": "http://www.landscapingnetwork.com/decks/size.html", "passage_text": "Average Deck Size A small deck intended to hold a round dining table should be at least 12 feet by 12 feet, while a large deck can be designed with much more space. The average deck size is between 300 and 400 square feet. Generally, a deck should be wider than it is deep, with the longer dimension running along the house. With large decks, consider making them multi-level designs. This will help break up the look and designate areas for certain activities. "}, {"url": "http://www.deckspecialists.com/deck_size_article.htm", "passage_text": "Also, a 14 deep deck is a good size for a another reason, at 12 the deck becomes very usable, less than 12 deep and you can barely fit a table and chairs. But 14 is the starting point where there is plenty of room around a table. So a 14 deck becomes a good buy. Deck proportions, we prefer decks to have good proportions, generally wider then deep looks better, so a 18 x14 or even 16 x14 with the bigger size being along the house and the smaller size projecting into the rear yard looks proper and is a good deck size in general."}, {"url": "http://ths.gardenweb.com/discussions/2530239/deck-standard-size", "passage_text": "Is there such a thing as standard size decks or acceptable spanning of the back of the home? We are building and were thinking the deck would spanish the kitchen noon area (approx. 13 ft) but our architect suggested the Span of the kitchen as well. This would mean 26 feet! That's the length they are made and to cut off a foot or two just because your deck is a different size can get pricy. Most of the new products cost between a low of 2 dollars a foot to almost 4 dollars a foot. Those pcs in the scrap pile will add up to some big bucks."}, {"url": "https://www.warehouseskateboards.com/blog/2011/11/23/what-size-skateboard-do-i-need/", "passage_text": "For skaters 9 to 12 years old between 4’5” and 5’2” tall who wear size 7-8 shoes. Decks 7.5” or larger Deck width: 7.5″+ – Deck length: 29”+. For all skaters over age 13, taller than 5’3” with a shoe size of 9 and up.However, individual skating style will determine deck size for these decks: 7.5″ to 8″ – Standard board for adult riders skating streets or doing more technical tricks. 8.0″ to 8.25″ – Skating pools, ramps and parks. Width – The average width of a skateboard deck is 7.5″- 8.25″. Width is influenced by the size of the rider and the type of riding. Bigger riders and those skating ramps and vert ramps typically prefer a wider deck."}, {"url": "https://en.wikipedia.org/wiki/Standard_52-card_deck", "passage_text": "The most common sizes for playing cards are poker size (2.5 × 3.5 inches (64 × 89 mm), or B8 size according to ISO 216) and bridge size (2.25 × 3.5 inches (57 × 89 mm)), the latter being narrower, and thus more suitable for games such as bridge in which a large number of cards must be held concealed in a player's hand. The weight of an average B8-sized playing card is 0.063 ounces (1.8 g), and a 52 card deck 3.3 ounces (94 g). The thickness and weight of modern playing cards is subject to numerous variables related to their purpose of use and associated material design for durability, stiffness, texture and appearance."}, {"url": "https://en.wikipedia.org/wiki/Standard_52-card_deck", "passage_text": "Other sizes are also available, such as a smaller 'patience' size (usually 1.75 × 2.375 inches (44.5 × 60.3 mm)) for solitaire, tall narrow designs (usually 1.25 × 3 inches (32 × 76 mm)) for travel and larger 'jumbo' ones for card tricks. The weight of an average B8-sized playing card is 0.063 ounces (1.8 g), and a 52 card deck 3.3 ounces (94 g). The thickness and weight of modern playing cards is subject to numerous variables related to their purpose of use and associated material design for durability, stiffness, texture and appearance."}]