[{"url": "http://www.weddingdecoratorblog.com/decorating-the-ceiling-with-fabric/", "passage_text": "Ceiling draping is not for amateurs. By the time you buy or rent the fabric, hardware, ladders, lifts, etc…it is quite expensive. I usually use voile and I have it in white and ivory, and have used colored fabric for Proms and parties. I have brides ask me to drape fabric on low, (11′ or lower) ceilings, and it just doesn’t look as good as the pictures of these very high spaces. Venues with ceiling grids are the easiest. You can use ceiling clips or specialty magnets with hooks that are relatively expensive, but are perfect to do this kind of hanging."}, {"url": "http://www.weddingdecoratorblog.com/decorating-the-ceiling-with-fabric/", "passage_text": "Ceiling lights and draping is one of our clients most favorite things to have. But again, like said in the above statment not every venue can handle this. They either need to have had installed hooks or a pulley system or open beams. We use sheer fabric 10ft wide for our fabric draping but we also use tulle. Tulle can still look nice and doesn’t have the weight of sheer fabric. Ceiling lights and draping are a lot of work, but worth it if you can have it at your venue. I have brides ask me to drape fabric on low, (11′ or lower) ceilings, and it just doesn’t look as good as the pictures of these very high spaces. Venues with ceiling grids are the easiest. You can use ceiling clips or specialty magnets with hooks that are relatively expensive, but are perfect to do this kind of hanging."}, {"url": "http://venuesafari.com/dreamy-drapes-using-fabric-draping-at-your-wedding/", "passage_text": "Previously, we talked about ways to transform a ballroom from a meeting space to a wedding ballroom one of the ways we discussed is using fabric draping. It can really change the feel of a room– giving it a softer, romantic feel and often a “clean slate” in a room where the colors might clash with your wedding colors. Sometimes you can use draping to create a beautiful entry to your wedding or make a feeling of an enclosed space outdoors. Draping can also be used at a wedding to break up a large room into individuals spaces and create a more intimate feel. The draping can be white or colors or white with colored uplighting…the draping can lay straight down or swagged (like the first picture below) and tied with ribbons and/or floral accents. And after this post Dreamy Drapes— Using Fabric Draping at Your Wedding | Venue Safari. I was actually moved enough to leave a leave a responsea response I do have. 2 questions for you if you don’t mind. Is it just me or do a few of these remarks come."}, {"url": "http://www.dynamicdrape.com/Ceilingdraping.html", "passage_text": "FABRICS WE USE: Our most popular fabric is 118 wide white Voile drapery sheer. This fabric is the standard for quality ceiling draping. It is flameproof rated, durable and versatile enough to create many different styles of drape design. We can also incorporate other types of fabrics as accents, or do your entire design with a custom color fabric. A good draping design will positively transform the atmosphere of your site and enhance your theme. It can help mask unsightly elements like poorly maintained ceilings and unfortunate ceiling fixtures."}, {"url": "http://eventprotraining.com/2014/02/draping-fabric-40-denier-satin/", "passage_text": "Yes, it does! Another very significant issue to overcome when you want use fabric for draping is the weight of the material. You have to find a satin or sateen that is light enough to use in ceiling draping. Use the wrong fabric, or too much fabric, and you could literally pull down a drop ceiling installation. Because of that, one of the things you want to look for is what the ‘denier’ of the fabric is. In the Past, we have written and talked a lot about the Gossamer Fabric often referred to as Tobacco Cloth. It’s a terrific lightweight fabric that we frequently use on drop down ceilings. What we haven’t talked about much is the ‘ 40 Denier Satin Fabric ‘ that we’re crazy about and use a TON!"}, {"url": "http://www.dynamicdrape.com/Ceilingdraping.html", "passage_text": "BENEFITS OF CEILING DRAPING-Obviously it will add glamour and elegance to your venue, but that's not all. A good draping design will positively transform the atmosphere of your site and enhance your theme. It can help mask unsightly elements like poorly maintained ceilings and unfortunate ceiling fixtures. It can help eliminate acoustic noise in rooms with a lot of hard surfaces like marble and glass"}, {"url": "http://eventprotraining.com/shop/gossamer-draping-fabric-for-weddings-and-events-tobacco-cloth/", "passage_text": "Gossamer Draping Fabric is a romantic translucent fabric that’s very lightweight and versatile. This remarkable fabric (sometimes referred to as tobacco cloth) can be used to completely cover ceilings or make beautiful swags for ceilings, tables, chuppahs, and more! SKU: GosTC12100 Category: Draping Fabric Tags: ceiling draping, Draping for events, Draping for weddings, Gossamer Cloth, Tobacco Cloth. 1  Description. Product Description. Gossamer Draping Fabric is a romantic translucent fabric that’s very lightweight and versatile. This remarkable fabric (sometimes referred to as tobacco cloth) c an be used to completely cover ceilings or make beautiful swags for ceilings, tables, chuppahs, and more!"}, {"url": "http://www.fabricdraper.com/", "passage_text": "Imperial Taffeta is flame retardant. Whether you are converting sparse venue space into an intimate and elegant setting with ceiling fabric draping or creating a festive environment with ceiling lanterns our ceiling decor installation kits will allow you to complete the task quickly, safely and inexpensively. "}, {"url": "http://eventprotraining.com/2014/02/draping-fabric-40-denier-satin/", "passage_text": "And again we used the chair wraps that we made out of the same 40 Denier Fabric. Beautiful and Elegant Aisle Draping: We often use the 40 Denier Satin Fabric for aisle draping too. Because the fabric is so wide, it makes such beautiful pleats with the swags. In the Past, we have written and talked a lot about the Gossamer Fabric often referred to as Tobacco Cloth. It’s a terrific lightweight fabric that we frequently use on drop down ceilings. What we haven’t talked about much is the ‘ 40 Denier Satin Fabric ‘ that we’re crazy about and use a TON!"}]