[{"url": "http://www.ehow.com/how_8090695_remove-spam-folder-yahoo-email.html", "passage_text": "Instructions. Launch a Web browser and then navigate to the Yahoo! Email sign in page. Enter your Yahoo! user name and password in the Sign in to Yahoo! box, and click Sign in.. Click the Spam folder located in the left pane of the page in the Folders box. The emails in the Spam folder open in the right pane of the page. "}, {"url": "http://www.wikihow.com/Stop-Spam", "passage_text": "2. Block and report spam in Yahoo! Mail. Yahoo! has a strong spam filter and most spam messages will automatically be sent to the Spam folder. If you find a message in your inbox that you believe is spam, check the box next to it and click the “Spam” button in the upper toolbar. The entire purpose of spam is to get you to click a link. If an email contains a link and you don’t recognize the sender, chances are it is spam. Hover your mouse over any link to see the destination in your browser or email client’s status bar."}, {"url": "https://help.yahoo.com/kb/SLN3227.html", "passage_text": "Yahoo Mail on a computer. 1  Use the Spam and Not Spam buttons. 2  Block certain senders' email addresses. 3  Block images from displaying in emails. - 4  This prevents spammers from confirming that their images and emails are viewed. "}, {"url": "https://answers.yahoo.com/question/index?qid=20090426055219AAsI3ut", "passage_text": "Answers. Best Answer: If it is going into your spam folder open one and click on Not Spam. Or Go to Options. It is above your email Click on Mail Options Click on Blocked Addresses Click on the Address you want to remove block Click on Remove Block. This should remove the block and allow it to start coming into your inbox. Hope this helps!!!"}, {"url": "https://answers.yahoo.com/question/index?qid=20080222171301AA1Quha", "passage_text": "Report Abuse. Go to the Bulk folder and mark the messages you want to delete, then click on the delete button. And if you dont want the spam messages not to go in to your bulk folder do the folowing. 1. In yahoomail, click on options on the top right corner. 2. Click on Spam Protection once the options page opens. 3. "}, {"url": "http://www.wikihow.com/Block-Spam-on-Yahoo%21-Mail", "passage_text": "1 Look for common terms in your spam messages that don't appear in your regular emails, such as enhancement, supplement, clinical trial, etc. 2  Hover over the Gear button and select Settings. 3  Click the Filters tab. 4  Click the Add button to create a new filter. "}, {"url": "https://forums.att.com/t5/Features-and-How-To/Can-t-stop-the-Spam-on-AT-amp-T-Yahoo-email/td-p/3417733", "passage_text": "1 Click Options in the upper-right corner of your Yahoo! Mail page and select Mail Options. 2  Under Spam, click Block Addresses. 3  Under Add Block, enter the email address from which you don't want to receive mail. 4  Click Add Block. 5  The address now appears on your list of blocked addresses. It's just as easy to remove the block if you want to. Here's how to block an email address: 1 "}, {"url": "http://www.ehow.com/how_5775571_remove-email-address-spam-list.html", "passage_text": "Legitimate companies will remove your email address from their spam lists if you use the unsubscribe link included in their messages. It is much harder to get off a scam company's list, but you can take some steps to stop the barrage of junk email. Spam email can clog your inbox even if you use a good spam filter. Junk emailers are always looking for new ways to defeat filters and get their messages in front of your eyes."}, {"url": "https://forums.att.com/t5/Features-and-How-To/Can-t-stop-the-Spam-on-AT-amp-T-Yahoo-email/td-p/3417733", "passage_text": "How to block and un-block mail from a specific sender. Yahoo! Mail makes it easy to block unwanted messages from a known address. It's just as easy to remove the block if you want to. Here's how to block an email address: 1  Click Options in the upper-right corner of your Yahoo! Mail page and select Mail Options. 2  Under Spam, click Block Addresses. 3  Under Add Block, enter the email address from which you don't want to receive mail. 4  Click Add Block"}]