[{"url": "http://www.wikihow.com/Define-Your-Personal-Values", "passage_text": "Personal values are reflections of our needs, desires, and what we care about most in life. Values are great cohesive forces for our identities, and can be thought of as decision-making guidelines that help us connect to our true selves. Defining your values will help you figure out what to pursue and what to avoid."}, {"url": "https://www.valuescentre.com/our-products/products-individuals/personal-values-assessment-pva", "passage_text": "Find out what is important to you by taking a Personal Values Assessment. Who you are, what you hold dear, what upsets you, and what underlies your decisions, are all connected to your personal values. Your values reflect what is important to you. They are a shorthand way of describing your motivations."}, {"url": "http://wire.wisc.edu/yourself/selfreflectknowyourself/Yourpersonalvalues.aspx", "passage_text": "Personal values are the beliefs, principles or ideas that are important to you in your life. Values are what you stand for in life -- they are often things that you are for or against -- what you believe in and are willing to support and stand up for."}, {"url": "http://www.termpaperwarehouse.com/essay-on/My-Personal-Values/66672", "passage_text": "My personal values. Values are those things that are important, meaningful and valued by an individual, a group of people, or an organization. Whether we are aware of them or not, every individual has his or her core set of values, which consist of many different kinds of values."}, {"url": "http://www.answers.com/Q/What_are_personal_values", "passage_text": "Since these values vary by individual, they are personal and can include many things. Religion, morals, and ethics play a part in personal values. As an example, most people include do not murder as part of their personal values. It is simply not in their ethics set to kill someone else. Many people consider this value to be an axiom of ethics, but it is not."}, {"url": "http://www.answers.com/Q/What_are_personal_values", "passage_text": "Personal values are things that you believe in, and they are important to you. for example, if you are a veryy family orientated person then one of personal values is family. … If you believe in loyalty and being a good friend, then they are your personal values. Hope this helped a little bit (:"}, {"url": "https://www.mindtools.com/pages/article/newTED_85.htm", "passage_text": "In business and in your personal life, values are the foundation of what you believe to be most important and what you want to be known for. They act as a compass providing direction for the choices you make and your actions."}]