[{"url": "https://en.wikipedia.org/wiki/Seed", "passage_text": "A seed is an embryonic plant enclosed in a protective outer covering known as the seed coat. It is a characteristic of spermatophytes (gymnosperm and angiosperm plants) and the product of the ripened ovule which occurs after fertilization and some growth within the mother plant. Seed viability is the ability of the embryo to germinate and is affected by a number of different conditions. Some plants do not produce seeds that have functional complete embryos, or the seed may have no embryo at all, often called empty seeds."}, {"url": "http://www.cropsreview.com/seed-plants.html", "passage_text": "These two types of seed plants are further distinguished: Similar to bryophytes and the ferns and allies, the gymnosperms have no flowers. They are also described as plants with naked seeds because during pollination the ovule is not enclosed by the carpel except some kind of scales during development."}, {"url": "http://schools.look4.net.nz/science/biology/plant/how_plants_reproduce/flowering_plants", "passage_text": "The Two Seed Types of Flowering Plants. The flowering plants, also called angiosperms, can be divided into two groups. These groups have differently structured seeds. The groups are called monocotyledons and diocotyledons. Monocotyledons. Monocotyledons make a seed with a seed coat. Inside the seed there is plant embryo with a primitive root and a supply of food for the new plant. The food supply is called the endosperm, and it is all in one piece. When the little plant comes out, the root goes down and a single spire goes up"}, {"url": "http://www.biology-online.org/11/14_seed_plants.htm", "passage_text": "Seed plants: There are two main subdivisions of seed plants—the ones without covered seeds, the gymnosperms, and the ones with covered seeds, the angiosperms. In this tutorial we will briefly look at both types of plants. Angiosperms are plants that have seeds encased in a protective covering. That covering is the ovary which is part of the flower structure and distinguishes angiosperms from gymnosperms, the other seed plants."}, {"url": "http://www.biology-online.org/11/14_seed_plants.htm", "passage_text": "Angiosperms—flowering seed plants (covered seed plants). Angiosperms are plants that have seeds encased in a protective covering. That covering is the ovary which is part of the flower structure and distinguishes angiosperms from gymnosperms, the other seed plants."}, {"url": "http://www.ehow.com/about_5379965_kinds-seed-plants.html", "passage_text": "Save. There are two main types of seed plants. Gymnosperms are the types of seed plants that produce naked seeds, or seeds that are not covered or grown inside pods of fruits. The second type of seed plant is the angiosperm. The angiosperm is the type of seed plant that produces flowers. The flowers eventually form into fruits that contain the seed"}, {"url": "http://www.cropsreview.com/seed-plants.html", "passage_text": "Seed plants or seed-bearing plants, also called spermatophytes or Spermatophyta, are vascular plants with numerous members belonging to the lignophytes or woody plants. They have the natural ability to produce seeds, a characteristic which likewise distinguishes them from earlier plants. Similar to bryophytes and the ferns and allies, the gymnosperms have no flowers. They are also described as plants with naked seeds because during pollination the ovule is not enclosed by the carpel except some kind of scales during development."}, {"url": "http://www.gardenguides.com/85767-types-plant-seeds.html", "passage_text": "Submit. Botanists divide plants into two large categories: plants that create seeds, and plants that do not. Seed-producing plants are then divided into two more categories. These plants are classified as either gymnosperms, which produce seeds in cones, and angiosperms, which produce seeds in flowers. These two classifications of plants produce the two main types of seeds: naked and enclosed. There are other, less common types of seeds as well. Other seeds, such as sunflower seeds, are not really seeds at all, but the hard fruit of the plant. The actual seed of a sunflower seed is obtained after the hard shell of the fruit is cracked open. Many types of nuts, such as an acorn, are also hard fruits; the nut is actually the seed"}, {"url": "http://www.discoverplants.com/plant-types.html", "passage_text": "Here are our different types of plants, as they are sorted on Discover Plants. You may notice some categories are not actually scientific, or botanical, classifications. For example, the term 'vegetables' is only a culinary term, not an actual plant type. Same for 'fruits', but to a lesser extent. We have separated our types of plants by how people commonly refer to them."}]