[{"url": "http://www.mayoclinic.org/symptoms/hip-pain/basics/definition/SYM-20050684", "passage_text": "Hip pain is a common complaint that can be caused by a wide variety of problems. The precise location of your hip pain can provide valuable clues about the underlying cause. Problems within the hip joint itself tend to result in pain on the inside of your hip or your groin. Hip pain can sometimes be caused by diseases and conditions in other areas of your body, such as your lower back or your knees. This type of pain is called referred pain. Most hip pain can be controlled with self-care at home."}, {"url": "http://www.arthritisresearchuk.org/arthritis-information/conditions/hip-pain/causes.aspx", "passage_text": "The pain is usually caused by strained or inflamed soft tissues such as tendons, and it often clears up within a few days. Long-term hip pain can be caused by specific conditions. Pain caused by a problem in the hip joint can be felt in the groin, down the front of the leg and in the knee. Sometimes knee pain is the only sign of a hip problem. This is called referred pain, and it’s fairly common. Hip pain can also be felt in the buttock (although pain in this area can also be caused by problems with the lower back) or on the outside of the hip."}, {"url": "https://www.sharecare.com/health/pain-management/what-causes-hip-knee-pain", "passage_text": "Hip pain is a common problem, and it can be confusing because there are many causes. It is important to make an accurate diagnosis of the cause of your symptoms so that appropriate treatment can be directed at the underlying problem. If you have hip pain, some common causes include: arthritis and bursitis."}, {"url": "http://www.webmd.com/pain-management/guide/hip-pain-causes-and-treatment", "passage_text": "If your hip pain is caused by a muscle or tendon strain, osteoarthritis, or tendinitis, you can usually relieve it with an over-the-counter pain medication such as Tylenol or a nonsteroidal anti-inflammatory drug such as Motrin or Aleve. Muscles and tendons in the hip can get overused. The hip bone itself can be fractured during a fall or other injury. Any of these conditions can lead to hip pain. If your hips are sore, here is a rundown of what might be causing your discomfort and how to get hip pain relief."}, {"url": "http://www.arthritis.org/about-arthritis/where-it-hurts/hip-pain/causes/", "passage_text": "Arthritis and Diseases that Affect the Hip. Hip joint pain, hip arthritis pain & other hip diseases. Many forms of arthritis & related conditions that affect the joint, muscles & bones can cause hip pain, stiffness & swelling. "}, {"url": "https://www.sharecare.com/health/pain-management/what-causes-hip-knee-pain", "passage_text": "A Dr. Akash Bajaj, MD, Anesthesiology, answered. Finding the cause of knee and hip pain can be a difficult task. Your doctor will use information about your symptoms, examination, imaging studies and other tests to determine the cause of your symptoms. The knee joint is the connection between the thigh and the leg. It is important to make an accurate diagnosis of the cause of your symptoms so that appropriate treatment can be directed at the underlying problem. If you have hip pain, some common causes include: arthritis and bursitis."}, {"url": "http://www.healthline.com/symptom/hip-pain", "passage_text": "Hip pain can be caused by a number of injuries or conditions. The most common cause of acute hip pain is inflamed tendons, often caused by over-exercising. This condition can be very painful, but usually heals within a few days. The most common cause of long-term hip pain is arthritis, or joint swelling. Arthritis can cause pain, stiff and tender joints, and difficulty walking. There are two main types of arthritis: osteoarthritis and rheumatoid arthritis. "}, {"url": "http://www.health.harvard.edu/pain/knees-and-hips-a-troubleshooting-guide-to-knee-and-hip-pain", "passage_text": "Depending on the cause of your pain, the solution might be a set of exercises, pain relief medication, minor surgery, or some combination of these. But for many people, knee and hip problems become so intractable that the best solution is to replace a worn-out knee or hip with a mechanical joint. Most people will at some point have knee or hip pain because these large joints have a demanding task: they must bear the full weight of your body while at the same time allowing for a wide range of motion. Wear and tear, injury, and simple genetic predisposition can all contribute to knee or hip pain."}, {"url": "http://www.fremonthealth.com/body.cfm?id=556169", "passage_text": "Causes of Hip & Knee Pain. The first step in getting the right treatment for your hip or knee problem is simple-a good diagnosis from a joint expert. Knee or hip pain can be caused by a number of conditions, some temporary, others chronic but treatable. A good diagnosis is the key to beginning an effective treatment plan. Some common causes of knee and hip pain include: Bursitis: This is the inflammation of bursa (fluid-filled space keepers) that are located near bony prominences. Synovitis: This is the inflammation of the synovial capsule surrounding the joint"}]