[{"url": "http://www.thefreedictionary.com/aquiline", "passage_text": "aq·ui·line. adj. 1. Relating to or having the characteristics of an eagle. 2. Curved or hooked like an eagle's beak: an aquiline nose. Good day, age about forty, height about five feet nine, black hair, generally rather handsome visage, complexion dark, eyes dark, thin, long and sallow face, aquiline nose but not straight, having a peculiar inclination towards the left cheek which imparts a sinister expression."}, {"url": "https://en.wikipedia.org/wiki/Aquiline_nose", "passage_text": "Although the aquiline nose is found among people from nearly every area of the world, it is generally associated with and thought to be more frequent in certain ethnic groups originating from Southern Europe, the Middle East, North Africa, the Horn of Africa and South Asia. The flat, broad nose is ubiquitous among most populations in Africa, and is noted by nineteenth-century writers and travelers (such as Colin Mackenzie) as a mark of  Negroid  ancestry. It stands in opposition to the narrow aquiline, straight or convex noses (lepthorrine), which are instead deemed  Caucasian ."}, {"url": "http://www.beautyhows.com/nose/nose-types/aquiline-nose-meaning-women-is-aquiline-nose-attractive/", "passage_text": "The name aquiline is of Latin origin meaning ‘eagle-like”. Another name for aquiline types of a nose is Roman nose. A high, curved bridge characterizes the Roman nose. Its name is derived from roman art, which depicted figures with long, high-bridged noses. If you have an it, it often means just that and nothing more. No one ever feels at complete comfort with the natural looks. The eyebrow may seem slightly off or it could be your nose. In truth, not all women with aquiline types of noses are Attractive."}, {"url": "https://en.wikipedia.org/wiki/Aquiline_nose", "passage_text": "While some have ascribed the aquiline nose to specific ethnic, racial, or geographic groups, and in some cases associated it with other supposed non-physical characteristics (i.e. intelligence, status, personality, etc., see below), no scientific studies or evidence support any such linkage. The flat, broad nose is ubiquitous among most populations in Africa, and is noted by nineteenth-century writers and travelers (such as Colin Mackenzie) as a mark of  Negroid  ancestry. It stands in opposition to the narrow aquiline, straight or convex noses (lepthorrine), which are instead deemed  Caucasian ."}, {"url": "http://www.oxforddictionaries.com/definition/english/aquiline", "passage_text": "Mid 17th century: from Latin aquilinus, from aquila 'eagle'. More. eagle from Middle English: Eagle comes from Old French aigle which came in turn from Latin aquila ‘eagle’ also the source of aquiline (mid 17th century)—an aquiline nose is hooked like an eagle's beak. Renowned for its keen sight and soaring flight, the eagle is considered the king of birds. 1.1 (Of a person’s nose) hooked or curved like an eagle’s beak. Example sentences. Synonyms. 1  The new vocation would draw upon his curiosity, but mainly on his looks, his special features: the characteristic oval face, aquiline nose and shocking white beard."}, {"url": "http://www.thefreedictionary.com/aquiline", "passage_text": "aquiline. adj. 1. (Anatomy) (of a nose) having the curved or hooked shape of an eagle's beak. 2. (Zoology) of or resembling an eagle. [C17: from Latin aquilīnus, from aquila eagle]. Good day, age about forty, height about five feet nine, black hair, generally rather handsome visage, complexion dark, eyes dark, thin, long and sallow face, aquiline nose but not straight, having a peculiar inclination towards the left cheek which imparts a sinister expression."}, {"url": "http://www.merriam-webster.com/dictionary/aquiline", "passage_text": "Full Definition of AQUILINE. 1. 2. : of, relating to, or resembling an eagle. — aq·ui·lin·i·ty \\ˌa-kwə-ˈli-nə-tē\\ noun. "}, {"url": "https://en.wikipedia.org/wiki/Aquiline_nose", "passage_text": "An aquiline nose (also called a Roman nose or hook nose) is a human nose with a prominent bridge, giving it the appearance of being curved or slightly bent. The word aquiline comes from the Latin word aquilinus (eagle-like), an allusion to the curved beak of an eagle. The flat, broad nose is ubiquitous among most populations in Africa, and is noted by nineteenth-century writers and travelers (such as Colin Mackenzie) as a mark of  Negroid  ancestry. It stands in opposition to the narrow aquiline, straight or convex noses (lepthorrine), which are instead deemed  Caucasian ."}, {"url": "http://dictionary.cambridge.org/dictionary/english/aquiline", "passage_text": "aquiline adjective. › of or like an ​eagle (= ​large ​bird): an aquiline ​nose (= a ​nose ​curved like an eagle's ​beak) aquiline ​features (= a ​face with this ​type of ​nose). (Definition of aquiline from the Cambridge Advanced Learner’s Dictionary & Thesaurus © Cambridge University Press). How many is a billion? The answer may seem obvious, but the use of this word can lead to confusion. In the UK and Ireland the word traditionally meant the number 1,000,000,000,000 (a million millions), which is called a trillion in the United States."}]