[{"url": "http://www.christianacare.org/UrogynecologyFAQ", "passage_text": "This specialist is also sometimes called a female urologist. Before the urogynecology specialty was created, women with pelvic-floor disorders typically had to visit multiple specialists and receive treatment for problems in the urinary, gastrointestinal and reproductive systems separately. A urogynecologist can manage all these conditions comprehensively. A urogynecologist is a physician who specializes in treating women with a variety of disorders to the pelvic floor."}, {"url": "http://www.mybladdermd.com/", "passage_text": "Atlantic Health Division of Urogynecology. The field of Urogynecology (a subspecialty within Obstetrics and Gynecology) is dedicated to the treatment of women with pelvic floor disorders such as urinary or fecal incontinence and prolapse (bulging) of the vagina, bladder and/or the uterus. "}, {"url": "http://myurogyn.com/what-is-urogynecology.html", "passage_text": "The field of Urogynecology developed in the 1980’s when leading obstetricians and gynecologists observed that the care of women with pelvic floor dysfunction was unsatisfactory and that women with these problems were not receiving the careful attention and effective treatments they deserved. Although some types of pelvic floor dysfunction affect men, pelvic floor dysfunction in general is much more common in women. Nearly 20% of women under age 65 and up to 56% of women over age 65 are affected. On the average, 1 of every 9 women will undergo surgery for pelvic floor dysfunction in her lifetime."}, {"url": "http://www.mybladdermd.com/what-is-urogynecology/", "passage_text": "What is Urogynecology. The field of Urogynecology (a subspecialty within Obstetrics and Gynecology) is dedicated to the treatment of women with pelvic floor disorders such as urinary or fecal incontinence and prolapse (bulging or falling) of the vagina, bladder and/or the uterus. Prolapse simply means displacement from the normal position. When this word is used to describe the female organs, it usually means bulging, sagging or falling. It can occur quickly, but usually happens over the course of many years. On average, 11% of women will undergo surgery for this condition."}, {"url": "http://www.stmarymercy.org/what-is-urogynecology", "passage_text": "A urogynecologist specializes in the treatment of the pelvic floor disorders. These disorders occur when the wall of the pelvic floor becomes weakened or damaged during childbirth, high-impact physical activity or repetitive heavy lifting. Obesity along with certain diseases and surgery may also cause pelvic floor disorders. To make an appointment with Westside Ob/Gyn and Urogynecology's urgogynecologist, Paul Makela, MD, please call 734-655-1980. Dr. Makela also specializes the gynecological use of the minimally-invasive da Vinci robotic surgery system."}, {"url": "http://myurogyn.com/what-is-urogynecology.html", "passage_text": "Urogynecology is a fairly new specialty that focuses exclusively on the care of women with pelvic floor dysfunction such as urinary and fecal leakage (bladder or bowel incontinence), bulging or falling of the vaginal tissues (prolapse), trouble urinating or passing bowel movements, and pelvic pain. Although some types of pelvic floor dysfunction affect men, pelvic floor dysfunction in general is much more common in women. Nearly 20% of women under age 65 and up to 56% of women over age 65 are affected. On the average, 1 of every 9 women will undergo surgery for pelvic floor dysfunction in her lifetime."}, {"url": "https://www.sharecare.com/health/womens-health/what-is-urogynecology", "passage_text": "A Greenville Health System answered. Urogynecology, a subspecialty within OB-GYN, focuses on the diagnosis and the medical and surgical treatment of female urinary disorders and pelvic ﬂoor dysfunction. "}, {"url": "http://www.mybladdermd.com/what-is-urogynecology/", "passage_text": "Urinary incontinence (leakage of urine) is a very common condition affecting at least 10-20% of women under age 65 and up to 56% of women over the age of 65. While incontinence also affects men, it occurs much more commonly in women. Prolapse simply means displacement from the normal position. When this word is used to describe the female organs, it usually means bulging, sagging or falling. It can occur quickly, but usually happens over the course of many years. On average, 11% of women will undergo surgery for this condition."}]