[{"url": "http://brainly.com/question/97375", "passage_text": "A group of organisms that share similar characteristics and can reproduce among themselves to produce fertile offspring is called a. a. generation. b. species. c. hominid. "}, {"url": "http://www.thefreedictionary.com/species", "passage_text": "A group of organisms having many characteristics in common and ranking below a genus. Organisms that reproduce sexually and belong to the same species interbreed and produce fertile offspring. See Table at taxonomy. a group of individuals of common parentage; a sort, kind, or variety. n. pl. species. 1. Biology A group of closely related organisms that are very similar to each other and are usually capable of interbreeding and producing fertile offspring. The species is the fundamental category of taxonomic classification, ranking below a genus or subgenus"}, {"url": "http://www.bbc.co.uk/schools/gcsebitesize/science/ocr_gateway/understanding_environment/classificationrev4.shtml", "passage_text": "Species. A species is a group of organisms that can interbreed to produce fertile offspring. Individuals of the same species have more characteristics in common than they do with organisms of a different species. For example, evolution is a continuing process. Some organisms can only reproduce asexually, while some species can interbreed to produce hybrids. For example the liger is a hybrid cross between a male lion and a female tiger. Page: 1  1. 2  2. 3  3. 4  4. 5  5"}, {"url": "https://en.wikipedia.org/wiki/Species", "passage_text": "Reproductive species. Two organisms that are able to reproduce naturally to produce fertile offspring of both sexes. Organisms that can reproduce but almost always make infertile hybrids of at least one sex, such as a mule, hinny or F1 male cattalo are not considered to be the same species. A species is often defined as the largest group of organisms where two hybrids are capable of reproducing fertile offspring, typically using sexual reproduction. While in many cases this definition is adequate, the difficulty of defining species is known as the species problem."}, {"url": "http://www.answers.com/Q/What_is_it_called_when_a_group_of_simailar_organisms_that_can_mate_with_each_other_and_produce_fertile_offspring", "passage_text": "What is a group of organisms that are physically similar and can mate with each other and produce offspring that can also mate and reproduce? "}]