[{"url": "http://www.lib.utexas.edu/geo/balcones_escarpment/pages77-90.html", "passage_text": "Figure 1: Location of the Edwards Aquifer in relation to the Balcones fault zone and other physiographic features. Note how the aquifer cuts across the surface drainage basins. Figure 3: Topography and rainfall of the central segment of the Edwards Aquifer (modified from Woodruff and Abbott, 1979). The dominant geologic feature in the region is the Balcones fault zone, a system of en echelon, mainly down-to-the-coast, normal faults that extend about 545 km from Del Rio on the Mexican border to near Waco in north-central Texas."}, {"url": "http://www.eardc.txstate.edu/about/aquifer-info.html", "passage_text": "The entire Edwards (Balcones Fault Zone) Aquifer extends along the narrow belt of Balcones Fault Zone from the north of Georgetown through Austin, San Marcos, New Braunfels, San Antonio, Hondo, Sabinal and Uvalde to Brackettville. The Edwards Aquifer is recharged primarily through leaky streambeds atop the porous outcrop of the Edwards Group along the northern margin of Balcones Fault Zone (a complex system of geologic faults and fractures)."}, {"url": "http://www.twdb.texas.gov/groundwater/aquifer/majors/edwards-bfz.asp", "passage_text": "Summary. The Edwards (Balcones Fault Zone) Aquifer is a major aquifer in the southcentral part of the state. It consists primarily of partially dissolved limestone that creates a highly permeable aquifer. Modeled available groundwater for the Edwards (Balcones Fault Zone) Aquifer in Groundwater Management Area 10 for Kinney County."}, {"url": "https://www.lib.utexas.edu/geo/balcones_escarpment/pages163-183.html", "passage_text": "The basic geohydrology of the Edwards aquifer in the Balcones fault zone is, by now, well understood and has been capably described by many authors, especially Arnow (1959), Abbott (1975), Maclay and Small (1984), and Senger and Kreitler (1984). CONCLUSIONS AND RECOMMENDATIONS. 1. There are two Edwards aquifers in Texas, one in the Edwards Plateau and the second in the Balcones fault zone area. Both are fractured, cavernous aquifers developed in carbonate rocks that were deposited in very shallow-marine shelf environments."}, {"url": "http://www.twdb.texas.gov/groundwater/aquifer/majors/edwards-bfz.asp", "passage_text": "San Antonio obtains almost all of its water supply from the Edwards (Balcones Fault Zone) Aquifer. Although water levels periodically and seasonally decline rapidly in wells throughout the aquifer, they also rebound quickly with adequate rainfall. Modeled available groundwater for the Edwards (Balcones Fault Zone) Aquifer in Groundwater Management Area 10 for Kinney County."}, {"url": "http://academic.emporia.edu/schulmem/hydro/TERM%20PROJECTS/Somerholder/edwards.htm", "passage_text": "The part that is unconfined is the smaller recharge area. The Recharge Zone The Edwards aquifer is often referred to as a fault-zone aquifer because recharge in the recharge zone occurs because the limestone is heavily faulted and fractured as it follows the Balcones Fault Line. The Edwards is divided into three parts: the contributing zone, the recharge zone and the artesian zone. The aquifer is mostly confined, the contributing zone, which is the largest part,is confined below by a rock called Glen Rose Limestone and above by mostly impermeable Del Rio Clay."}, {"url": "https://en.wikipedia.org/wiki/Edwards_Aquifer", "passage_text": "The aquifer's recharge zone, where surface water enters the aquifer, follows the Balcones Fault line, from Brackettville (roughly along U.S. Highway 90), through San Antonio, and north to Austin along but a few miles west of Interstate 35. The Aquifer has a recharge zone of 1,250 square miles (3,200 km 2). Most of the water (75%-80%) that is in the Aquifer originated from some of the creeks and rivers flowing in the area. Two creeks that flow into the Aquifer are the Cibolo and Helotes Creeks."}, {"url": "https://en.wikipedia.org/wiki/Edwards_Aquifer", "passage_text": "From Wikipedia, the free encyclopedia. The Edwards Aquifer is one of the most prolific artesian aquifers in the world. Located on the eastern edge of the Edwards Plateau in the U.S. state of Texas, it discharges about 900,000 acre feet (1.1 km 3) of water a year and directly serves about two million people. The Aquifer has a recharge zone of 1,250 square miles (3,200 km 2). Most of the water (75%-80%) that is in the Aquifer originated from some of the creeks and rivers flowing in the area. Two creeks that flow into the Aquifer are the Cibolo and Helotes Creeks."}, {"url": "http://water.usgs.gov/ogw/karst/aquifers/edwards/index", "passage_text": "The Edwards aquifer is the most transmissive of all the aquifers in Texas and Oklahoma. Large discharges from springs and from flowing and pumped wells attest to the highly permeable nature of the aquifer. The area underlain by the Edwards aquifer is a combination of agricultural and ranch land and areas of dense population, including the cities of Austin in Travis County and San Antonio in Bexar County. Direct recharge to the aquifer can be quite rapid through sinkholes. Water levels in wells completed in the Edwards aquifer rise immediately and springflows increase quickly after major recharge events, thus attesting to a dynamic flow system and the rapid movement of large volumes of water."}]