[{"url": "https://en.wikipedia.org/wiki/Electric_current", "passage_text": "The particles that carry the charge in an electric current are called charge carriers. In metals, one or more electrons from each atom are loosely bound to the atom, and can move freely about within the metal. These conduction electrons are the charge carriers in metal conductors. Man-made occurrences of electric current include the flow of conduction electrons in metal wires such as the overhead power lines that deliver electrical energy across long distances and the smaller wires within electrical and electronic equipment."}, {"url": "http://study.com/academy/lesson/what-is-electric-current-definition-unit-types.html", "passage_text": "Like a river current is the flow water of water molecules, electrical current is the flow of charged particles. In this lesson, we're going to explore what electrical current is, what causes it, and that, unlike a water current, electrical current doesn't always flow in one direction. "}, {"url": "https://en.wikipedia.org/wiki/Electric_current", "passage_text": "The SI unit for measuring an electric current is the ampere, which is the flow of electric charge across a surface at the rate of one coulomb per second. Electric current is measured using a device called an ammeter. Electric currents cause Joule heating, which creates light in incandescent light bulbs. Man-made occurrences of electric current include the flow of conduction electrons in metal wires such as the overhead power lines that deliver electrical energy across long distances and the smaller wires within electrical and electronic equipment."}, {"url": "http://www.physicsclassroom.com/class/circuits/Lesson-2/Electric-Current", "passage_text": "Electric Current. If the two requirements of an electric circuit are met, then charge will flow through the external circuit. It is said that there is a current-a flow of charge. Using the word current in this context is to simply use it to say that something is happening in the wires-charge is moving. See Answer Answer: D Current is the rate at which charge flows. Charge will not flow in a circuit unless there is an energy source capable of creating an electric potential difference and unless there is a closed conducting loop through which the charge can move. Answer: D. Current is the rate at which charge flows. Charge will not flow in a circuit unless there is an energy source capable of creating an electric potential difference and unless there is a closed conducting loop through which the charge can move. 2"}, {"url": "http://www.factmonster.com/dk/encyclopedia/circuits.html", "passage_text": "Electric current is a flow of electric charge (usually in the form of electrons) through a substance. The substance or conductor that an electric current flows through is often metal wire, although current can also flow through some gases, liquids, and other materials. Circuits can be wired in two ways. In a series circuit, current flows to each bulb in turn. Both bulbs are dimly lit."}, {"url": "https://en.wikipedia.org/wiki/Electric_shock", "passage_text": "Electric shock is the physiological reaction or injury caused by electric current passing through the (human) body. "}, {"url": "http://www.answers.com/Q/What_causes_current_in_an_electric_circuit", "passage_text": "In the most simple electric circuits, an electric current flows in that circuit in response to the applied voltage. Voltage is electromotive force, and it will cause current t … o flow in a circuit to which it is applied. In an electrical circuit always current flows from-ve terminal of the source voltage to positive terminal in a closed circuit and such nature of flowing is called as conventi … on current flow.  Conventional current flow, positive to negative. Electron flow negative to positive. See related link below"}]