[{"url": "http://www.medicaltechnologyschools.com/surgical-technologist/surgery-tech-salary", "passage_text": "Salary.com provides very similar information about surgical tech pay. It reports that median pay, as of December 2014, was $41,716. Those in the upper 25 percent earned as much as $46,308 while those in the upper 10 percent earned as much as $50,488. In fact, it reports the yearly surgical tech salary as falling between $28,391 and $53,818 with these considerations factored in. It also reports that neuroscience, neurosurgery, open heart and vascular skills can affect pay for the job and that most people move onto other positions after approximately 20 years."}, {"url": "http://surgicaltechnician.yolasite.com/surgical-technician-salaries.php", "passage_text": "Surgical Technician Salaries. Surgical Technician Salaries. Surgical technician salaries were about $40,000 in May 2010. The lowest 10 percent earned a surgical technician salary of less than about $28,000 and the highest 10 percent earned more than about $57,000."}, {"url": "http://study.com/articles/Certified_Surgical_Technologist_Salary_Duties_and_Requirements.html", "passage_text": "Certified Surgical Technologist Salary. According to the U.S. Bureau of Labor Statistics (BLS), surgical technologists earned an average yearly salary of $44,420 as of 2013 (www.bls.gov). The lowest-paid ten percent earned up to $30,450, while the highest-paid ten percent earned $61,300 and above in that year. The average salary varied based on employer and location. Surgical technologists working in California, Nevada and Hawaii earned the highest salaries at that time, with the average annual wage in each of those states listed at more than $54,000 per year, according to BLS data."}, {"url": "http://www.surgicaltech.net/salary/", "passage_text": "Location has the largest impact on surgical tech salary. Currently Alaska, Illinois, Massachusetts and the District of Columbia offer the highest average annual salaries for surgical technologists. Alaska’s average surgical tech salary is around $63,000. The lowest paying states are Mississippi and West Virginia, which trend around $35,000."}, {"url": "http://www.simplyhired.com/salaries-k-surgical-technician-jobs.html", "passage_text": "The average salary for surgical technician jobs is $49,000. Average surgical technician salaries can vary greatly due to company, location, industry, experience and benefits. This salary was calculated using the average salary for all jobs with the term surgical technician anywhere in the job listing. "}, {"url": "http://www.medicaltechnologyschools.com/surgical-technologist/surgery-tech-salary", "passage_text": "Surgical Technologist Salary. According to May 2013 data from the BLS, the median salary for the surgical technologist occupation was $42,720. This means that 50 percent of workers made salaries above this amount and 50 percent earned less than this amount. In fact, it reports the yearly surgical tech salary as falling between $28,391 and $53,818 with these considerations factored in. It also reports that neuroscience, neurosurgery, open heart and vascular skills can affect pay for the job and that most people move onto other positions after approximately 20 years."}, {"url": "http://www.payscale.com/research/US/Job=Surgical_Technologist/Hourly_Rate", "passage_text": "Surgical Technologist Salary. (United States). The average pay for a Surgical Technologist is $18.67 per hour. The skills that increase pay for this job the most are Vascular, plastic surgery, and Neurosurgery. Most people with this job move on to other positions after 20 years in this field"}, {"url": "http://www.payscale.com/research/US/Job=Surgical_Technician/Hourly_Rate", "passage_text": "(United States). For Surgical Technicians, hourly average wages total $18.35 per hour. The income range spans the entire spectrum between $13.23 per hour and $26.09. Location is the biggest factor affecting pay for this group, followed by experience level. Female Surgical Technicians make up most of the survey respondents at 76 percent"}, {"url": "http://money.usnews.com/careers/best-jobs/surgical-technologist/salary", "passage_text": "With an average salary of $44,420 in 2013, surgical technologists earned less than health care professionals who invested more time in education, such as registered nurses ($68,910), but they earned more than clinical lab technicians ($40,240), nursing aides ($26,020) and home health aides ($22,050). "}]