[{"url": "http://minecraft.gamepedia.com/Piston", "passage_text": "Pistons are always placed facing towards the player. When powered, the piston's wooden surface (head) extends outward by one block for 1.5 redstone ticks (0.15 seconds, barring lag), which can be heard within a 31x31x31 cube centered on the activating piston, the piston can push up to 12 blocks in a line with it. When a piston loses power, it will retract by simply pulling its head back instantly (0 redstone ticks), unless it is a sticky piston, in which case it will also pull the block in front of the head."}, {"url": "http://www.gamefaqs.com/boards/606524-minecraft/59801479", "passage_text": "The best you can get with pushing pistons with another piston is is 2. The sticky piston that gets pulled back will not pull back anything with it, so 2 is the longest chain. LinkofHyrule991 posted...No there isn'tThe best you can get with pushing pistons with another piston is is 2 The sticky piston that gets pulled back will not pull back anything with it, so 2 is the longest chain.It's possible. You just need to pulse the pistons: http://www.youtube.com/watch?v=9-g88GKU-wI."}, {"url": "http://www.gamefaqs.com/boards/606524-minecraft/59801479", "passage_text": "LinkofHyrule991 posted... No there isn'tThe best you can get with pushing pistons with another piston is is 2 The sticky piston that gets pulled back will not pull back anything with it, so 2 is the longest chain. It's possible. LinkofHyrule991 posted...No there isn'tThe best you can get with pushing pistons with another piston is is 2 The sticky piston that gets pulled back will not pull back anything with it, so 2 is the longest chain.It's possible. You just need to pulse the pistons: http://www.youtube.com/watch?v=9-g88GKU-wI."}, {"url": "https://en.wikipedia.org/wiki/Piston", "passage_text": "It is the moving component that is contained by a cylinder and is made gas-tight by piston rings. In an engine, its purpose is to transfer force from expanding gas in the cylinder to the crankshaft via a piston rod and/or connecting rod. In a pump, the function is reversed and force is transferred from the crankshaft to the piston for the purpose of compressing or ejecting the fluid in the cylinder. In some engines, the piston also acts as a valve by covering and uncovering ports in the cylinder wall"}, {"url": "http://minecraft.wikia.com/wiki/Sticky_Piston", "passage_text": "645 pages on this wiki. The Sticky Piston is a block nearly identical to the piston, except that it has slime smeared on the end of it and it can pull blocks, hence the name sticky piston. Like regular pistons, sticky pistons can be used in all six directions. It is possible for the block stuck to a sticky piston to be pushed aside by another piston, and sticky pistons do not protect sand and gravel against gravity. Stickiness only affects the retraction of the piston."}, {"url": "https://forum.solidworks.com/thread/54287", "passage_text": "If your piston and connecting rod are fixed, you can get them to move by right clicking on them and choosing float. Use a concentric mate between your piston and cylinder to make the piston go straight up and down. My question is about the piston movement when assemblying the crankshaft and piston-connecting rod so it would work as it should. The crank should have rotary movement, i got that by mating the crank's axis to 2 planes and one side to the 3rd plane."}, {"url": "http://minecraft.wikia.com/wiki/Piston", "passage_text": "1 Adding a Slimeball to a Piston on a Crafting Table creates a Sticky Piston. 2  If a piston pushes a Slime Block which has any movable blocks attached to it, than the Blocks will move as well. 3  This method won't push un-movable blocks. 4  You can create flying machines with this function. 1 Pistons are redstone triggered. 2  When powered, their wooden surface extends outwards by 1 block, pushing up to a maximum of 12 blocks. 3  Similarly, if a block pushed by a piston is pushed into a player/mob, the player/mob will get pushed if there is space."}, {"url": "http://www.answers.com/Q/How_does_a_piston_move_back_up_the_cylinder_after_the_explosion_has_forced_it_down", "passage_text": "The pistons are very much like the pedals on a bicycle. They are attached to a device called a cam shaft that allows the downward thrust of one piston to cause another piston to move back up to be ready to be pushed down again... sort of like pedals on a bicycle. A piston is attached to each of the welded pair of pedals and the cut off ends are connected to the front wheels in a front wheel drive. There are other components in a real car but that's a high level picture that should help to answer your question."}, {"url": "http://minecraft.gamepedia.com/Piston", "passage_text": "When a slime block is pushed or pulled by a piston, while moving, adjacent blocks will also move with the slime block, unless a non-piston movable block stops the blocks that are grabbed by the slime blocks. These blocks may in turn push other blocks, not just the blocks in the line in front of the piston. When a piston loses power, it will retract by simply pulling its head back instantly (0 redstone ticks), unless it is a sticky piston, in which case it will also pull the block in front of the head."}]