[{"url": "http://www.empowher.com/sexual-health/content/why-your-period-two-weeks-late", "passage_text": "If your cycle is usually regular and you’re suddenly late having your period, it can be a worry. Causes of late periods are: • Pregnancy. Sexually active women could be pregnant and it is in fact often the first sign that a woman is pregnant. By two weeks late, all home pregnancy tests should be able to detect HCG, the pregnancy hormone, in your urine."}, {"url": "http://www.healthline.com/health/womens-health/why-is-my-period-late", "passage_text": "Women typically begin getting their periods anywhere from age 10 to 15. During the first two years after starting your period, your hormones may still be adjusting. This can cause late or missed periods. Most women usually have a period every 28 days between starting their period and menopause. However, a healthy menstrual cycle can range from every 21 to 35 days. If your period doesn’t fall within these ranges, it could be because of one of these reasons. SPONSORED: Save a trip to the doctor's office."}, {"url": "http://www.kidsgrowth.com/resources/articledetail.cfm?id=892", "passage_text": "Menstrual Period-Late or Missed. Menstrual cycles vary in length from one woman to the next. They may occur at at the same time each month or be irregular. A menstrual period is considered late if it is 5 or more days overdue according to your usual pattern of periods. A period is considered missed if there is no menstrual flow for 6 or more weeks. Dieting or binging and purging may interrupt menstrual cycles. Changes in your usual routine (for example, going on vacation) may also cause your period to be late or missed. Normal development During the first couple of years of menstruation many teenagers have irregular periods."}, {"url": "http://health.howstuffworks.com/pregnancy-and-parenting/pregnancy/conception/5-common-reasons-for-late-period.htm", "passage_text": "Stockbyte/ Thinkstock. To the uninformed, a missed period can only mean one thing: You're pregnant. But in reality, there are numerous reasons why your period might be late -- or missing altogether. The 28-day menstrual cycle is closely tied to your overall well-being. "}, {"url": "http://www.wsupgdocs.org/family-medicine/WayneStateContentPage.aspx?nd=1680", "passage_text": "Typically, a cycle occurs about once a month, but can be as short as 21 days or as long as 35 days and still be considered normal. Menstrual flow lasts about 3 to 7 days. A menstrual period is considered late if it is 5 or more days overdue according to your usual pattern of periods. A period is considered missed if there is no menstrual flow for 6 or more weeks."}, {"url": "http://www.healthline.com/health/womens-health/why-is-my-period-late", "passage_text": "Missed or late periods happen for many reasons other than pregnancy. Common causes can range from hormonal imbalances to serious medical conditions. There are also two times in a woman’s life when it’s totally normal for her period to be irregular: when it first begins, and when menopause starts. Most women usually have a period every 28 days between starting their period and menopause. However, a healthy menstrual cycle can range from every 21 to 35 days. If your period doesn’t fall within these ranges, it could be because of one of these reasons. SPONSORED: Save a trip to the doctor's office."}, {"url": "http://www.wsupgdocs.org/family-medicine/WayneStateContentPage.aspx?nd=1680", "passage_text": "A menstrual cycle is the period of time from day one of your menstrual period to day one of your next period. Menstrual cycles vary in length from one woman to the next. They may occur at the same time each month or be irregular. Menstrual flow lasts about 3 to 7 days. A menstrual period is considered late if it is 5 or more days overdue according to your usual pattern of periods. A period is considered missed if there is no menstrual flow for 6 or more weeks."}, {"url": "http://www.summitmedicalgroup.com/library/pediatric_health/hhg_period_late_or_missed/", "passage_text": "References. A menstrual cycle is the time from the day a menstrual period starts to the time the next period starts. The average menstrual cycle is 28 days long. However, a normal cycle can be shorter or longer than this. It may be anywhere from 21 to 35 days long. Most periods last 3 to 5 days, but anywhere from 2 to 7 days is normal. A menstrual period is considered late if it hasn’t started 5 or more days after the day you expected it to start. A period is considered missed if you have had no menstrual flow for 6 or more weeks after the start of your last period."}, {"url": "http://www.webmd.com/women/rm-quiz-period-normal", "passage_text": "Missed or delayed periods are common in young women, especially in the early years of menstruation, and things like stress, weight loss, and too much exercise can make periods irregular. Also, several birth control methods can cause periods to stop and can even be designed for just that purpose. "}, {"url": "http://www.wsupgdocs.org/family-medicine/WayneStateContentPage.aspx?nd=1680", "passage_text": "If you've been having periods for 2 years or less and your physical exam is normal, your irregular periods may be part of your normal development. Remember, if you have had sex, go to your doctor's office for a pregnancy test when your period is late for you, even if you normally have irregular cycles. Menstrual flow lasts about 3 to 7 days. A menstrual period is considered late if it is 5 or more days overdue according to your usual pattern of periods. A period is considered missed if there is no menstrual flow for 6 or more weeks."}]