[{"url": "http://www.guidetothailand.com/thailand-travel-information/customs-info.php", "passage_text": "Duties for goods brought into Thailand will be assessed according to Customs Acts, Customs Tariff Decree, and other associated laws. Following are subject to duty charges: 1  Goods which are brought into the country in a limited quantity as personal effects and are not for a commercial purpose. 2  Goods not exceeding 80,000 baht in value. 3  Duties shall be paid in cash on the date of arrival. Thailand Customs General Regulations. 1  Passengers arriving into the Kingdom of Thailand have to fill in the Passenger Declaration Form (Form No. 211) and submit it to the Customs officer while bringing their luggage or belongings through the red or green channel."}, {"url": "http://www.treasury.gov.za/publications/tax%20statistics/2008/Chapter%205%20-%20Customs.pdf", "passage_text": "131 5 Customs/import duties Introduction Customs/import duties are imposed on some goods that are imported into South Africa. Import duties are imposed to protect local producers. In addition, excise duties are also imposed on selected imported goods. "}, {"url": "http://www.dutycalculator.com/country-guides/Import-duty-taxes-when-importing-into-Thailand/", "passage_text": "Import duty & taxes when importing into Thailand. Overview. Import duty and taxes are due when importing goods into Thailand whether by a private individual or a commercial entity. In addition to duty, imports are subject to sales tax (VAT), and in some cases to excise, interior tax and a surcharge. Duty Rates. Duty rates in Thailand vary from 0% to 80%, with an average duty rate of 20.93%. Some products can be imported free of duty, e.g. laptops and other electronic products. Sales Tax. Goods imported into Thailand are subject to VAT at a rate of 7% calculated over the CIF value plus any applicable duty. Minimum thresholds. Imports with a CIF value up to 1000 THB are exempt from duty and VAT"}, {"url": "http://www.sars.gov.za/ClientSegments/Customs-Excise/Pages/Tariff.aspx", "passage_text": "It is important to ensure that an importer has a proper description of goods before the goods are imported into South Africa as the tariff code identified has to be inserted on the customs declaration. The customs duties and VAT payable will be calculated based on the rate of duty dictated by the specific tariff code. Tariff classification of goods is one of the more complex issues under the Customs and Excise Act. Tariff classification relates to the proper classification of goods within the Harmonized Commodity Description and Coding System (tariff book)."}, {"url": "http://www.customs.go.th/wps/wcm/connect/custen/traders+and+business/prohibited+and+restricted+items/general+prohibitions+and+restrictions/generalprohibitionsandrestrictions", "passage_text": "The Thai Government controls the import and export of certain goods into/out of Thailand. The controls either take the form of: 1  an absolute prohibition, which means that you are not allowed to import the goods in any circumstances; or. 02-667-7885, e-mail: customs_clinic@customs.go.th. Additional information may also be obtained from Customs ports of entry/exit. Please consult our telephone directory for a Customs office near you. The listing can be found under the “CONTACT US” section."}, {"url": "http://www.ehow.com/list_6762370_thailand-import-duties.html", "passage_text": "New Items. New items imported into Thailand are subject to import duty depending on the item. For example new furniture is subject to a duty of 71 percent of the CIF (cost insurance and freight) value. Thailand Import Duties. When moving goods from one country to another, in many cases the country into which the item is being......"}, {"url": "http://www.customs.go.th/wps/wcm/connect/custen/traders+and+business/prohibited+and+restricted+items/general+prohibitions+and+restrictions/generalprohibitionsandrestrictions", "passage_text": "1. Prohibited Goods are goods for which either the import into or export out of Thailand are prohibited. Any person imports or exports prohibited goods is considered as committing offences and subject to penalties indicated in the relevant national legislation. 02-667-7885, e-mail: customs_clinic@customs.go.th. Additional information may also be obtained from Customs ports of entry/exit. Please consult our telephone directory for a Customs office near you. The listing can be found under the “CONTACT US” section."}, {"url": "http://www.sars.gov.za/ClientSegments/Customs-Excise/Pages/Tariff.aspx", "passage_text": "1 Compound duties are a combination of rated and ad valorem duties applicable to goods mentioned in the same tariff heading e.g. 20% plus 8 cent per kg or 50 cents per square metre less 20%. Tariff classification of goods is one of the more complex issues under the Customs and Excise Act. Tariff classification relates to the proper classification of goods within the Harmonized Commodity Description and Coding System (tariff book)."}, {"url": "http://www.ehow.com/list_6762370_thailand-import-duties.html", "passage_text": "Under Thai customs regulations there are certain items that are dutiable particularly with luxury goods or on anything which can be manufactured in Thailand. The circumstances of the import, the amount being imported, as well as documentation are all taken into consideration when calculating import duty. Thailand Import Duties. When moving goods from one country to another, in many cases the country into which the item is being......"}]