[{"url": "http://www.pbs.org/howartmadetheworld/episodes/human/venus/", "passage_text": "The Venus of Willendorf is one of the earliest images of the body made by humankind. It stands just over 4 inches high and was carved some 25,000 years ago. It was discovered on the banks of the Danube River, in Austria, and it was most likely made by hunter-gatherers who lived in the area. The environment at that time was much colder and bleaker then present-day, a remnant of Europe's last ice age."}, {"url": "http://www.asu.edu/cfa/wwwcourses/art/SOACore/Willendorf_portfolio.htm", "passage_text": "Venus of Willendorf c. 24,000-22,000 BCE Oolitic limestone 4 3/8 inches (11.1 cm) high (Naturhistorisches Museum, Vienna). "}, {"url": "http://www.thenagain.info/WebChron/World/Willendorf.html", "passage_text": "The 'Venus of Willendorf' is the name that was given to a female figurine that was found in 1908 by an archeologist named Joseph Szombathy in a Aurignacian loess deposit near the town of Willendorf in Austria. "}, {"url": "http://www.visual-arts-cork.com/prehistoric/venus-of-willendorf.htm", "passage_text": "The sites have yielded numerous artifacts dating to Gravettian culture (26-20,000 BCE). The Venus of Willendorf is one of many similar female carvings-known as Venus Figurines - which appeared across Europe during the period of Gravettian art (c.25-20,000 BCE). See also its older Austrian 'sister', found in nearby Stratzing, and known as the Venus of Galgenberg (c.3"}, {"url": "http://www.donsmaps.com/willendorf.html", "passage_text": "Willendorf II, 7th August 1908: discovery of the Venus I of Willendorf. The man standing at the findspot of the figurine is J. Bayer. Johann Veran, one of the workers, found the statuette. Szombathy, who stood nearest to Veran, saw the figurine first and showed it to Bayer, who worked not far away from Veran. This is part of the staggering number of tools from levels 8 and 9 at Willendorf II, the Gravettian, ca 25 000 - 24 000 BP. The Venus of Willendorf was found in Layer 9, 25 cm below the top of the layer, marked by undisturbed ash from a nearby modern brickworks."}, {"url": "https://en.wikipedia.org/wiki/Venus_of_Willendorf", "passage_text": "The Venus of Willendorf, now known in academia as the Woman of Willendorf, is a 11.1-centimetre (4.4 in) high statuette of a female figure estimated to have been made between about 28,000 and 25,000 BCE. Several similar statuettes and other forms of art have been discovered, and they are collectively referred to as Venus figurines, although they pre-date the mythological figure of Venus by millennia."}, {"url": "http://www.answers.com/Q/Where_was_Willendorf_Venus_discovered", "passage_text": "It was discovered in 1908 near Willendorf, a village in Lower Austria near the city of Krems. Galileo in 1610 was first to observe that Venus had a visible disk and that it had phases like the moon so perhaps he could be considered to have discovered the modern Venus. Captain James Cook made observations of a Transit of Venus in 1776-1779."}, {"url": "http://www.ancient-code.com/venus-willendorf/", "passage_text": "Image Credit: Wikimedia Commons. The Venus of Willendorf is a small statuette made out of oolitic limestone found a hundred years ago during the Wachau railway construction in 1908 on the Danube in Lower Austria. It remains an enigma for experts and has fed archaeological research at the site sine its discovery. "}, {"url": "http://anthropology.msu.edu/anp264-ss13/2013/03/28/venus-of-willendorf/", "passage_text": "It is also called the Woman of Willendorf, and is only 11cm tall. I find the fact that something so small as this to be of great archaeological importance fascinating. It is estimated that it was made between 24,000 and 22,000 BCE, but wasn’t found until 1908 by a man named Johann Veran. He found it in during an excavation at a Paleolithic site near Willendorf, a city in lower Austria. The Venus of Willendorf is carved out of oolithic limestone and is tinted with red ochre. This limestone is not a local stone to the area, leaving room for interpretation as to where the stone came from and how it go to they city of Willendorf. There were many other Venus figures found later to match in a set together."}, {"url": "http://www.donsmaps.com/willendorf.html", "passage_text": "Willendorf on the Donau, where the Venus of Willendorf was discovered, viewed from a ship on the Donau. Photo: Don Hitchcock 2000. 'Loesswand lösswand Bei' (Willendorf loess cliff At), willendorf a painting Of willendorf on The danube By Hugo darnaut before the railway was, constructed and before the venus was. discovered This is part of the staggering number of tools from levels 8 and 9 at Willendorf II, the Gravettian, ca 25 000 - 24 000 BP. The Venus of Willendorf was found in Layer 9, 25 cm below the top of the layer, marked by undisturbed ash from a nearby modern brickworks."}]