[{"url": "http://www.a4id.org/sites/default/files/user/documents/english-contract-law.pdf", "passage_text": "A contract is an agreement giving rise to obligations which are enforced or recognised by law. 2. In common law, there are 3 basic essentials to the creation of a contract: (i) agreement; (ii) contractual intention; and (iii) consideration. 3. The first requisite of a contract is that the parties should have reached agreement. Terms implied in law are terms imported by operation of law, whether the parties intended to include them or not. For example, in a contract for the sale of goods, it is an implied term that the goods will be of a certain quality and, if sold for a particular purpose, will be fit for that purpose."}, {"url": "http://legaldictionary.lawin.org/simple-contract/", "passage_text": "1 Simple Contract Alternative Definition. 2  A contract the evl- , dence of which is merely oral or in writing, not under seal nor of record. 3  1 Chit. 4  Cont. 5  1; 1 Chit. Browse or run a search for Simple Contract in the American Encyclopedia of Law, the Asian Encyclopedia of Law, the European Encyclopedia of Law, the UK Encyclopedia of Law or the Latin American and Spanish Encyclopedia of Law."}, {"url": "http://www.lectlaw.com/def2/s157.htm", "passage_text": "SIMPLE CONTRACT. One, the evidence of which is merely oral, or in writing, not under seal, nor of record. As contracts of this nature are frequently entered into without thought or proper deliberation, the law requires that there be some good cause, consideration or motive, before they can be enforced in the courts. "}, {"url": "http://legal-dictionary.thefreedictionary.com/Simple+contract", "passage_text": "Simple contract. SIMPLE CONTRACT. One, the evidence of which is merely oral, or in writing, not under seal, nor of record. 1 Chit. Contr. 1 1 Chit. Pl. 88; and vide 11 Mass. R. 30 11 East, R. 312; 4 Barn. & Ald. 588; Stark. Ev. 995; 2 Bl."}, {"url": "http://contract-law.laws.com/law-of-contract", "passage_text": "As is common with the majority of legal principles, the basic fundamentals of contract law will vary by jurisdictions throughout the United States. In all jurisdictions; however, a contract must require an offer, a subsequent acceptance or agreement to the stipulations within the contract, and consideration. "}, {"url": "http://www.wisegeek.com/what-is-a-simple-contract.htm", "passage_text": "In legal terminology, a simple contract is an agreement made by two parties. A simple contract can be either an oral or a written contract. Any breech of a simple contract can be ruled on by a judge in court. A simple contract may be used by catering companies to provide food for a single event. A breach of contract means that one of the parties ignored one or more terms in the agreement. A simple contract in legal terminology is an oral or written agreement made by two parties. This is never a legally recorded or officially sealed contract, but breeches are still often"}, {"url": "https://simple.wikipedia.org/wiki/Contract", "passage_text": "A contract is an agreement or promise that the law can enforce. The law will enforce some agreements but not others. For example, in most places, if a parent promises to take a child to get ice cream, the law will not enforce that promise as a legal contract. The legal rules about which promises are enforced by the law can be different in different places (or jurisdictions), but a contract is usually enforced only if it is made by people or groups who want it to be enforced and who know what they are doing."}, {"url": "http://www.nolo.com/legal-encyclopedia/contracts-101-make-legally-valid-30247.html", "passage_text": "Offer and Acceptance. The most basic rule of contract law is that a legal contract exists when one party makes an offer and the other party accepts it. For most types of contracts, this can be done either orally or in writing. Let's say, for instance, you're shopping around for a print shop to produce brochures for your business."}, {"url": "http://legal-dictionary.thefreedictionary.com/contract", "passage_text": "4.-1. A parol contract is defined to be a bargain or voluntary agreement made, either orally or in writing not under, seal, upon a good consideration, between two or more persons capable of contracting, to, do a lawful act, or to omit to do something, the performance whereof is not enjoined by law. 1 Com. Contr. 2 Chit. "}]