[{"url": "http://ehealthforum.com/health/prednisone-caused-gerd-t214208.html", "passage_text": "Prednisone/Severe acid reflux. I developed severe acid reflux after two short courses of prednisone. I did not have a history of acid refux. The acid reflux is so severe that I have developed Barrett's esophagus. I currently take nexium twice a day and that doesn't control the acid at all."}, {"url": "http://www.everydayhealth.com/drugs/prednisone", "passage_text": "Prednisone is used for a variety of conditions including skin conditions, allergy conditions, asthma, and inflammation. Side effects associated with prednisone include sleep problems, dry skin, dizziness, nausea, and changes in the shape of body fat. Prednisone may be given to dogs to control pain and swelling from conditions such as arthritis. Because it suppresses the immune system, prednisone may also be used in dogs to manage immune-system conditions such as allergies, asthma, lupus, and other disorders."}, {"url": "http://www.mayoclinic.org/diseases-conditions/asthma/expert-answers/asthma-and-acid-reflux/FAQ-20057993", "passage_text": "Asthma and acid reflux often occur together. It isn't clear why, or whether one causes the other. But we do know that acid reflux can worsen asthma and asthma can worsen acid reflux — especially severe acid reflux, a condition known as gastroesophageal reflux disease (GERD). Asthma and acid reflux can occur together in children as well as in adults."}, {"url": "http://www.webmd.com/asthma/guide/prednisone-asthma", "passage_text": "Prednisone and other systemic steroids may be used to treat asthma attacks and help people gain better asthma control. Steroids are used with other asthma medications to either control sudden and severe asthma attacks or to treat long-term, hard-to-control asthma. Font Size. A. A. A. Steroids, anti-inflammatory drugs such as prednisone, can be used for asthma as well as other lung diseases. Prednisone and other steroids (inhaled, oral, or by injection) help calm airway inflammation in asthma."}, {"url": "http://www.mayoclinic.org/diseases-conditions/asthma/expert-answers/asthma-and-acid-reflux/FAQ-20057993", "passage_text": "In fact, about half the children with asthma also have GERD. When asthma and acid reflux do occur together medications may not work as well to control signs and symptoms of either condition, such as coughing, shortness of breath, wheezing and chest pain. Treating acid reflux may help ease symptoms. But we do know that acid reflux can worsen asthma and asthma can worsen acid reflux — especially severe acid reflux, a condition known as gastroesophageal reflux disease (GERD). Asthma and acid reflux can occur together in children as well as in adults."}, {"url": "http://www.everydayhealth.com/asthma/prednisone-as-asthma-treatment.aspx", "passage_text": "Most people with asthma take daily medications to keep symptoms under control, but this isn’t always enough to prevent an asthma attack. That’s when you may need a stronger drug, such as prednisone, a corticosteroid. However, helpful as it is, this asthma treatment is not without side effects. Prednisone is an oral corticosteroid drug used to treat an asthma attack — it is not used as a preventive medication. This asthma treatment works by reducing inflammation in the airways that cause the bronchi to constrict and make breathing difficult. Long term, the treatment side effects of prednisone become more serious. Risks and side effects of long-term prednisone use include: 1  Weight gain. 2  Loss of bone mass. 3  Cataracts. 4  Glaucoma. 5  Increased blood sugar or diabetes. 6  Increased susceptibility to infections."}, {"url": "http://my.clevelandclinic.org/health/diseases_conditions/hic_gastroesophogeal_reflux_disease_gerd/hic_gerd_and_asthma", "passage_text": "People with asthma are twice as likely to have GERD as those people who do not have asthma. Of those people with asthma, those who have a severe, chronic form that is resistant to treatment are most likely to also have GERD. GERD is the backward flow of stomach acids into the esophagus. When this acid enters the lower part of the esophagus, it can produce a burning sensation, commonly referred to as heartburn. If you have both asthma and GERD, it is important that you consistently take any asthma medications your doctor has prescribed to you, as well as controlling your exposure to asthma triggers as much as possible."}, {"url": "http://www.webmd.com/asthma/guide/heartburn-asthma", "passage_text": "GERD can irritate asthma and damage the esophagus. It is believed that asthma attacks can also cause the sphincter to relax, making it easier for acid reflux to occur. Another potential link to asthma for patients with GERD is that when acid enters the esophagus, a nerve reflex is triggered, causing the airways to narrow in order to prevent the acid from entering. Some asthma medications can increase heartburn and other symptoms of GERD."}, {"url": "http://www.webmd.com/asthma/guide/heartburn-asthma", "passage_text": "People with asthma are twice as likely to have GERD as people who do not have asthma, especially those with treatment-resistant asthma. GERD is the backward flow of acidic stomach content into the esophagus (acid reflux). Another potential link to asthma for patients with GERD is that when acid enters the esophagus, a nerve reflex is triggered, causing the airways to narrow in order to prevent the acid from entering. Some asthma medications can increase heartburn and other symptoms of GERD."}]