[{"url": "http://www.answers.com/Q/Where_does_carbon_dioxide_come_from", "passage_text": "When you breathe in oxygen (O) from the air around you, it travels through your body and is converted to carbon dioxide (CO2). This happens by the time you exhale. It is thus a product of metabolism of hydrocarbons plus oxygen by many organisms on earth including humans. Carbon dioxide moves in and out of the atmosphere, the oceans, animals, trees and the soil as part of the carbon cycle, which neither creates nor destroys carbon. Additional a … tmospheric carbon dioxide comes from the burning of fossil fuels (coal, oil and natural gas)."}, {"url": "http://www.answers.com/Q/Where_does_carbon_dioxide_come_from", "passage_text": "Carbon dioxide (CO2) is produced during respiration by all animals, fungi and microorganisms that depend either directly or indirectly on plants for food. It is thus a major component of the carbon cycle. Carbon dioxide moves in and out of the atmosphere, the oceans, animals, trees and the soil as part of the carbon cycle, which neither creates nor destroys carbon. Additional a … tmospheric carbon dioxide comes from the burning of fossil fuels (coal, oil and natural gas)."}, {"url": "http://www.smh.com.au/news/big-questions/we-breath-in-oxygen-and-breath-out-carbon-dioxide-where-does-thecarbon-come-from/2008/06/06/1212259085199.html", "passage_text": "The carbon we breathe out as carbon dioxide comes from the carbon in the food we eat. The carbohydrates, fat and proteins we consume and digest are eventually converted by a number of different biochemical pathways in the body to glucose (C6H12O6). Jim Dewar, North Gosford. The carbon dioxide breathed out is a by-product of the process of cell respiration, as is water. In this process, energy is produced in the mitochondria of cells. This energy is our physical life force. Both oxygen and glucose are required for this."}, {"url": "http://www.answers.com/Q/Where_does_carbon_dioxide_come_from", "passage_text": "Carbon dioxide is generated as a by-product of the combustion of fossil fuels (coal, oil and natural gas) or the burning of vegetable matter, among other chemical processes. Carbon dioxide is the exhaust compound produced when carbon (or a hydrocarbon) burns and combines with oxygen. Small amounts of carbon dioxide are emitted from volcanoes and other geothermal processes such as hot springs and geysers and by the dissolution of carbonates in crustal rocks. Carbon dioxide moves in and out of the atmosphere, the oceans, animals, trees and the soil as part of the carbon cycle, which neither creates nor destroys carbon. Additional a … tmospheric carbon dioxide comes from the burning of fossil fuels (coal, oil and natural gas)."}, {"url": "https://en.wikipedia.org/wiki/Carbon_dioxide", "passage_text": "Carbon dioxide (CO 2) is a product of respiration of all aerobic organisms. It is returned to water via the gills of fish and to the air via the lungs of air-breathing land animals, including humans. Carbon dioxide exists in the Earth's atmosphere as a trace gas at a concentration of about 0.04 percent (400 ppm) by volume. Natural sources include volcanoes, hot springs and geysers and it is freed from carbonate rocks by dissolution in water and acid"}, {"url": "http://www.windows2universe.org/physical_science/chemistry/carbon_dioxide.html", "passage_text": "Carbon Dioxide-CO 2. Carbon dioxide (CO 2) is a kind of gas. There isn't that much carbon dioxide in Earth's atmosphere, but it is still very important. Carbon dioxide is a greenhouse gas. That means it helps trap heat coming from the Sun in our atmosphere through the greenhouse effect. Without carbon dioxide in our air, the Earth would be very cold. When humans and other animals breathe, we take in oxygen and breathe out carbon dioxide. We use the oxygen to get energy from food-this is called respiration. Burning things also makes lots of carbon dioxide. Natural fires like forest fires make carbon dioxide. Things that humans burn make CO 2, too."}, {"url": "http://www.webmd.com/a-to-z-guides/bicarbonate", "passage_text": "Carbon dioxide (CO2) is a gaseous waste product from metabolism. The blood carries carbon dioxide to your lungs, where it is exhaled. More than 90% of carbon dioxide in your blood exists in the form of bicarbonate (HCO3). The rest of the carbon dioxide is either dissolved carbon dioxide gas (CO2) or carbonic acid (H2CO3). Your kidneys and lungs balance the levels of carbon dioxide, bicarbonate, and carbonic acid in the blood. This test measures the level of bicarbonate in a sample of blood from a vein. Bicarbonate is a chemical (buffer) that keeps the pH of blood from becoming too acidic or too basic"}]