[{"url": "https://en.wikipedia.org/wiki/CoverGirl", "passage_text": "CoverGirl is an American cosmetics brand founded in Maryland, by the Noxzema Chemical Company (later called Noxell) and acquired by Procter & Gamble in 1989. CoverGirl is sold primarily in drugstores, convenience stores, and supermarkets. Maybelline Cosmetics (owned by L'Oreal), oréal CoverGirl'covergirl s biggest, competition as both companies market to similar groups of, consumers and sell their products at similar. prices"}, {"url": "https://en.wikipedia.org/wiki/American_Girl", "passage_text": "American Girl is an American line of 18-inch (46 cm) dolls released in 1986 by Pleasant Company. The dolls portray eight-to eleven-year-old girls of a variety of ethnicities. They are sold with accompanying books told from the viewpoint of the girls. In 1995 Pleasant Company released a line of contemporary dolls called American Girl of Today. In 2006 the product line was renamed Just Like You; it was changed again in 2010, to My American Girl, and in 2015 to Truly Me. This line has included over sixty-one different dolls over the years."}, {"url": "http://www.bloomberg.com/research/stocks/private/snapshot.asp?privcapId=430554", "passage_text": "The American Girl boutiques will feature a curated assortment of dolls from the company’s Girl of the Year™ and Truly Me™ collections, as well as an occasional spotlight character from the historical BeForever™ line. Its products are marketed and distributed through the company’s catalogue; Website, americangirl.com; and retail stores in the United States, as well as Toronto and Vancouver, Canada. The company was f... American Girl Brands, LLC operates as a toy company in the United States."}, {"url": "http://www.ebay.com/gds/Collectible-American-Girl-Dolls-An-Insiders-Guide-/10000000000962859/g.html", "passage_text": "The guide focuses on the first four American Girl dolls from the historical collection--- Molly McIntire, Samantha Parkington, Kirsten Larson and Felicity Merriman. The first three American Girl dolls were released in Fall of 1986 by Pleasant Company, which was founded by its namesake, educator Pleasant T. Rowland. Dolls made in the late 1990's have a tag sewn to the side of the cloth body which states: Made in China Exclusively for American Girl, Middleton, WI 53562. The majority of dolls made before 1998 do NOT have a body tag."}, {"url": "http://www.ebay.com/gds/Collectible-American-Girl-Dolls-An-Insiders-Guide-/10000000000962859/g.html", "passage_text": "The earliest made American Girl dolls were initially manufactured for Pleasant Company by the German doll maker Goetz. Goetz had factories in West Germany, Hungary, Post Berlin Wall Germany, and Baldwinsville, NY. Dolls made in the late 1990's have a tag sewn to the side of the cloth body which states: Made in China Exclusively for American Girl, Middleton, WI 53562. The majority of dolls made before 1998 do NOT have a body tag."}, {"url": "http://www.answers.com/Q/What_company_makes_Girl_Scout_cookies", "passage_text": "It depends on the cookie company chosen by the Girl Scout council. There are two cookie companies which provide Girl Scout cookies and they must offer 8 different kinds of coo … kies. You can also make the check out to the Girl Scout troop, for example: Girl Scout Troop _____, and put the troop number into the blank. Or the check can be made out to the Girl Scout council in charge of the cookie sale."}, {"url": "https://en.wikipedia.org/wiki/CoverGirl", "passage_text": "The Noxell Company advertised this cosmetics line by allowing cover girls, fashion models who appear on the front cover of women's magazines, to wear its products. CoverGirl is sold primarily in drugstores, convenience stores, and supermarkets. Maybelline Cosmetics (owned by L'Oreal), oréal CoverGirl'covergirl s biggest, competition as both companies market to similar groups of, consumers and sell their products at similar. prices"}, {"url": "http://www.ebay.com/gds/Collectible-American-Girl-Dolls-An-Insiders-Guide-/10000000000962859/g.html", "passage_text": "Some people WRONGLY assume that a Pleasant Company neckstamp indicates a pre-Mattel doll. For instance, you could buy a Kaya doll today that has a Pleasant Company stamp on her neck, BUT she wasn't introduced until 2002 and has a side tag on her body that says American Girl. It is impossible to buy a pre Mattel Kaya because she didn't exist prior to 1998. Dolls made in the late 1990's have a tag sewn to the side of the cloth body which states: Made in China Exclusively for American Girl, Middleton, WI 53562. The majority of dolls made before 1998 do NOT have a body tag."}]