[{"url": "https://en.wikipedia.org/wiki/Lateral_flexion", "passage_text": "Anatomists use a unified set of terms to describe most of the movements, although other, more specialized terms are necessary for describing the uniqueness of the movements such as those of the hands, feet, and eyes. In general, motion is classified according to the anatomical plane it occurs in. Flexion and extension are examples of angular motions, in which two axes of a joint are brought closer together or moved further apart. Rotational motion may occur at other joints, for example the shoulder, and are described as internal or external. Other terms, such as elevation and depression, refer to movement above or below the horizontal plane."}, {"url": "http://www.massageschoolnotes.com/joint-movements/", "passage_text": "Types of Movements of the Joints. 1  Flexion and Extension – Extension occurs when the surfaces get farther apart and the bones straighten. 2  Flexion results in a decrease of the angle at the joint and brings the bones closer together. 3  They occur in the sagittal plane around a frontal coronal axis. 1 Abduction and Adduction – frontal plane movements around a sagittal axis occur at multiaxial joints like the bal and socket joint of the shoulder or ellipsoid joints. 2  Abduction is movement away from the midline of the trunk of the body. 3  Adduction is movement medically toward the midline of the body."}, {"url": "http://www.physio-pedia.com/Cardinal_Planes_and_Axes_of_Movement", "passage_text": "An exception is extension of the thumb, which takes place in a frontal plane about a sagittal axis. Flexion occurs when the angle between two adjacent segments in the body decreases as the ventral surfaces of the segments approximate each other and occurs in a sagittal plane about a frontal axis. 1 Median can also refer to the midsagittal plane of other structures, such as a digit. 2  A coronal or frontal plane is perpendicular to the ground and divides the body into dorsal (posterior or back) and ventral (anterior or front) portions."}, {"url": "http://www.angelfire.com/la/dancer/planes.html", "passage_text": "Generally, flexion and extension movements such as biceps curls, knee extensions, and sit-ups occur in this plane. Lateral or frontal plane. The lateral plane, also known as the frontal or coronal plane, bisects the body laterally from side to side, dividing it into front and back halves. Planes of Motion. There are three specific planes of motion in whichthe various joint movements can be classified. As Movement occurs in a given plane, the joint moves or turns about an axis that has a 90 degree relationship to that plane."}, {"url": "http://www.massageschoolnotes.com/joint-movements/", "passage_text": "1 Examples are lateral flexion of the head at the neck and trunk. 2  Abduction and Adduction – frontal plane movements around a sagittal axis occur at multiaxial joints like the bal and socket joint of the shoulder or ellipsoid joints. 3  Abduction is movement away from the midline of the trunk of the body. 1 Abduction and Adduction – frontal plane movements around a sagittal axis occur at multiaxial joints like the bal and socket joint of the shoulder or ellipsoid joints. 2  Abduction is movement away from the midline of the trunk of the body. 3  Adduction is movement medically toward the midline of the body."}, {"url": "http://www.physio-pedia.com/Cardinal_Planes_and_Axes_of_Movement", "passage_text": "An exception is flexion of the thumb, which takes place in a frontal plane about a sagittal axis. Movement in the sagital plane about the frontal axis. Abduction/Adduction These are movements in the frontal plane about the sagital axis and involve moving the body part away or towards an imaginary centre line. Abduction is taking the body part away from the central line and adduction is moving it towards. 1 Median can also refer to the midsagittal plane of other structures, such as a digit. 2  A coronal or frontal plane is perpendicular to the ground and divides the body into dorsal (posterior or back) and ventral (anterior or front) portions."}, {"url": "http://www.massageschoolnotes.com/joint-movements/", "passage_text": "1 Lateral Flexion – side bending of the axial skeleton. 2  Examples are lateral flexion of the head at the neck and trunk. 3  Abduction and Adduction – frontal plane movements around a sagittal axis occur at multiaxial joints like the bal and socket joint of the shoulder or ellipsoid joints. 1 Abduction and Adduction – frontal plane movements around a sagittal axis occur at multiaxial joints like the bal and socket joint of the shoulder or ellipsoid joints. 2  Abduction is movement away from the midline of the trunk of the body. 3  Adduction is movement medically toward the midline of the body."}, {"url": "http://www.answers.com/Q/What_plane_of_body_motion_is_lateral_flexion_of_the_trunk_in", "passage_text": "exists and is an alternate of. Merge this question into. Split and merge into it. Answered by The Community. Making the world better, one answer at a time. Lateral flexion of the trunk involves moving the shoulders left or right towards the hips, therefore it is exercised in the frontal or coronal plane of motion. Flexion is the opposite to extension where the angle between anterior surfaces is decreased (as you being then closer together by 'bending') - except for the knee where the opposite is true.     Lateral flexion is therefore a combination of there two movements."}]