[{"url": "http://calories-calculator.net/Calories_Burned_By_Heart_Rate.html", "passage_text": "The rate at which the heart beats is related to the calorie expenditure rate. The accurate calculation of calories burned by heart rate requires the heart rate to be between 90 bpm and 150 bpm. In order to obtain an approximation of the number of calories burned, one must also include the weight, gender and duration of exercise. The calories burning have some association with heart rate. After large amount of research and investigation, the Journal of Sports Sciences developed a formula to count for calories burned during exercises."}, {"url": "http://livewell.jillianmichaels.com/estimate-calories-burned-heart-rate-4146.html", "passage_text": "Using your average heart rate during an exercise session, you can estimate the calories that you expend while working out. Your heart rate is directly related to your calorie expenditure rate. This calculation will be most accurate when your heart rate is between 90 and 150 beats per minute (bpm). The equation used to calculate calories burned also requires weight, gender and duration of the exercise session. Your heart monitor should give you your average heart rate for the whole session once it stops recording. Step 3. Estimate the calories that you burned during your exercise session. For women, this is given by the equation C = (0.4472 x H – 0.05741 x W + 0.074 x A – 20.4022) x T / 4.184."}, {"url": "http://www.triathlontrainingblog.com/post/calories-burned-calculator-based-on-average-heart-rate/", "passage_text": "I believe this equation/calculator overstates calories for lower heart rates and understates them for higher heart rates (as a percentage of maximum heart rate). This equation tracks well for me (compared to other methods of estimating calorie burn) when my average heart rate is between about 135 and 155. "}, {"url": "http://livewell.jillianmichaels.com/estimate-calories-burned-heart-rate-4146.html", "passage_text": "C is the number of calories that you burned, H is your average heart rate, W is your weight, A is your age and T is the length of your exercise session in minutes. Assume that you’re a 28-year-old female weighing 146 pounds. Your average heart rate during an exercise session that lasted 36 minutes was 138 bpm. Your heart monitor should give you your average heart rate for the whole session once it stops recording. Step 3. Estimate the calories that you burned during your exercise session. For women, this is given by the equation C = (0.4472 x H – 0.05741 x W + 0.074 x A – 20.4022) x T / 4.184."}, {"url": "http://www.livestrong.com/article/39443-heart-rate-vs.-calories-burned/", "passage_text": "The average heart rate may be used to estimate the calories burned by a person during exercise. A reasonably accurate estimate of calorie expenditure should also consider additional factors such as gender, age and weight. The heart rate can be used to estimate calorie expenditure during exercise. This is because the relationship between heart rate and calorie expenditure is relatively linear so long as the heart rate is between 90 and 150 beats per minute (bpm)."}, {"url": "http://www.calculatorpro.com/calculator/calories-burned-by-heart-rate/", "passage_text": "When that same person increases her heart rate to 75, here is what the calculator returns: “You burned roughly 2 calories per minute for a total of 57 calories.”. Keep in mind that our calculator returns results that represent the average person within specific age, weight, and heart rate categories. It just seconds, the “Calories Burned by Heart Rate” calculator will return a set of statistics for you. Here is an example for a 32-year-old female who weighs 133 pounds, is exercising for 30 minutes, and has an average heart rate of 65: “You burned roughly 1 calories per minute for a total of 24"}, {"url": "https://www.easycalculation.com/health/heart-rate-calorie-burn.php", "passage_text": "Online calories burned calculator based on average heart rate for unknown VO 2 max. VO2max is the measure of oxygen consumption of body while exercising. "}, {"url": "https://itunes.apple.com/us/app/calories-burned-by-heart-rate/id480464662?mt=8", "passage_text": "Description. Calories Burned By Heart Rate provides an estimate of calories burnt during exercise, based on your average heart rate during exercise. Calculation is most accurate with heart rate (123 - 171 beats/per min). To buy and download Calories Burned By Heart Rate-Track your fitness and calories to help you lose weight and meet your goal by Keld Sperry, get iTunes now."}]