[{"url": "http://www.bonappetit.com/recipe/homemade-breadcrumbs", "passage_text": "To make toasted breadcrumbs, spread the fresh crumbs in an even layer on a large rimmed baking sheet. Bake in a 350° oven, stirring occasionally, until browned and dry, then transfer hot breadcrumbs to a large bowl. Drizzle with 1 Tbsp. extra-virgin olive oil, season, and toss to coat. "}, {"url": "http://whatscookingamerica.net/Bread/BreadCrumbs.htm", "passage_text": "Stale bread makes for stale tasting breadcrumbs. You need to use dry bread only. If you bread is too fresh, just bake fresh bread slices in a slow oven a oven until slightly dry. I usually wait until I have enough bread slices to fill my food processor before making the crumbs. Making your own bread crumbs also saves money since commercial bread crumbs are expensive. Since I like to make homemade bread, I always seem to have end pieces around that I target and save for making homemade bread crumbs. Any type of bread (white, wheat, sourdough, rye, etc.) can be used."}, {"url": "http://www.taste.com.au/how+to/articles/638/how+to+make+freeze+breadcrumbs", "passage_text": "How to make your own breadcrumbs. You can use bought breadcrumbs to crumb foods, but if you have a food processor it's easy to make your own. Remove the crusts from day-old white bread slices and cut into cubes. Transfer the cubes to the bowl of a food processor and process until finely chopped. Fresh breadcrumbs freeze well and are a great way to use up leftover bread. You can use bought breadcrumbs to crumb foods, but if you have a food processor it's easy to make your own."}, {"url": "http://www.goodtoknow.co.uk/recipes/493894/how-to-make-breadcrumbs", "passage_text": "1 Place the bread into a processor and process into fine fresh breadcrumbs. ( 2 For dried breadcrumbs, toast the bread first). 3  You could also try grating the bread to make fine breadcrumbs if you don't have a food processor. 4  Add the nuts and process again to mix together. Method. 1  Place the bread into a processor and process into fine fresh breadcrumbs. ( 2 For dried breadcrumbs, toast the bread first). 3  You could also try grating the bread to make fine breadcrumbs if you don't have a food processor."}, {"url": "http://www.marthastewart.com/308894/homemade-breadcrumbs", "passage_text": "Lucinda's breadcrumbs are a snap to make and can be prepared by hand or in a food processor. You can purchase fresh bread to make these, but Lucinda simply saves heels of old bread. If you're using fresh bread, place slices on a baking sheet and dry out slightly in a 300-degree-Fahrenheit oven for 15 minutes. To make the breadcrumbs in the food processor, place chunks of bread into the processor or blender jar. Pulse to desired crumb size, approximately the size of grains of rice. For the best results, add the bread chunks in small batch"}, {"url": "http://www.goodtoknow.co.uk/recipes/493894/how-to-make-breadcrumbs", "passage_text": "1 You could also try grating the bread to make fine breadcrumbs if you don't have a food processor. 2  Add the nuts and process again to mix together. 3  Use the fresh breadcrumbs in our sweet or savoury recipes like chicken goujons or treacle tart. 4  Store fresh breadcrumbs in the freezer and use them as and when. Method. 1  Place the bread into a processor and process into fine fresh breadcrumbs. ( 2 For dried breadcrumbs, toast the bread first). 3  You could also try grating the bread to make fine breadcrumbs if you don't have a food processor. 4  Add the nuts and process again to mix together"}, {"url": "http://startcooking.com/how-to-make-bread-crumbs", "passage_text": "You can buy dry bread crumbs at the grocery store (which I always do) but you have to make your own fresh bread crumbs. You can freeze fresh bread crumbs, just be sure to date the freezer bag and use the crumbs within two months of freezing. I always have a box of dry breadcrumbs in the cupboard. I particularly like the seasoned variety. Fresh bread crumbs are really a snap to make! You can use any bread you have in the house. There are basically three ways to make bread crumbs; 1  with a knife."}]