[{"url": "http://www.kiplinger.com/article/credit/T017-C011-S001-six-habits-of-people-with-excellent-credit-scores.html", "passage_text": "The FICO credit score is the most widely used score in lending decisions and ranges from 300 to 850. A FICO score of 750 to 850 is considered excellent, and those with a score in that range have access to the lowest rates and best loan terms, according to myFICO.com, the consumer division of FICO. "}, {"url": "http://www.myfico.com/CreditEducation/articles/", "passage_text": "Credit Score Range. Take a look at the example FICO ® Scores report and you can see that it shows your FICO ® Scores in big bold numbers as well as a general indication of how your score relates to other U.S. consumers (poor to exceptional). Base FICO® Scores range from 300-850, and industry-specific FICO® Scores range from 250-900 — higher is better. For more information, see the What's in your score page. Your FICO ® Scores are calculated using the information in your credit reports."}, {"url": "http://www.thetruthaboutcreditcards.com/credit-score-range/", "passage_text": "760-799 Credit Score. A credit score of 760-799 is considered good to great credit, and will typically result in interest rates and approval rates that a credit score in the 800-850+ bucket would yield. The only difference might be a few more pricing incentives at the 800-850+ range, and a more thorough credit check. Check out the illustration I created of the standard consumer FICO score range above, which is based on a median FICO score of around 710. This should give you a quick idea as to where you fit in, assuming you already know your credit score(s)."}, {"url": "http://freescore.com/good-bad-credit-score-range.aspx", "passage_text": "Good credit score: 680 to 719. A credit report score in the 680-and-up range is good news for you. You can still get decent terms from lenders, although not as nice as those offered to borrowers with truly excellent credit scores. Excellent credit score: 720 and Up. Credit scores in this range will open up the best interest rates and repayment terms for loans. If you want to make major purchases, such as an investment property, this credit score range is where you want to be."}, {"url": "http://creditscoresrange.net/", "passage_text": "The Credit Score Range. The credit score range doesn’t start at 0 or 1, and it doesn’t end at 100 or 1000. It starts at the odd figure of 300 and ends at 850. So no matter whether you have a good score or a bad one, the credit score range will always be within 300 and 850. FICO and the Credit Score Range. FICO is the acronym of the “Fair Isaac & Company”. This is the company that came out with the mathematical calculation based on which the credit score and the credit score range is determined. Credit score is thus often also referred to as the “FICO score”."}, {"url": "http://www.adjustcredit.com/fico-credit-scores-ranges-meanings/", "passage_text": "The FICO credit score ranges between 300 and 850 which is used often by, banks, lenders and financial institution to determine whether to provide you, the consumer, with financial solutions and at what interest rate. A rule of thumb is: “The higher the credit score, the lower your rate will be.”. FICO scores were developed in 1958 by Fair Isaac Corporation – an Analytics company in the United States. A credit score is a number, based on a consumers credit report, which represents the creditworthiness of an individual, or the probability that the person will pay his or her debts."}, {"url": "https://help.equifax.com/app/answers/detail/a_id/244/~/equifax-credit-score%E2%84%A2-vs-fico%C2%AE-score", "passage_text": "The Equifax Credit Score uses a numerical range of 280 to 850, where higher scores indicate lower credit risk. The FICO Score uses a numerical range of 300 to 850, where higher scores also indicate lower credit risk. The Equifax Credit Score can be used to calculate a score for not only your Equifax credit file, but also your Experian and TransUnion credit files."}, {"url": "http://www.thetruthaboutcreditcards.com/credit-score-range/", "passage_text": "A credit score in this range isn’t all that different from the 760-799 category, though there are some thresholds for FICO scores of 760 and above. For example, when applying for a mortgage, a borrower with a 760 credit score may secure a slightly lower interest rate than a borrower with a 730 credit score. Check out the illustration I created of the standard consumer FICO score range above, which is based on a median FICO score of around 710. This should give you a quick idea as to where you fit in, assuming you already know your credit score(s)."}]