[{"url": "https://en.wikipedia.org/wiki/Prune", "passage_text": "Dried prunes have been found to contain surprising amounts of acrylamide, a known neurotoxin and a probable carcinogen. Acrylamide does not occur naturally in foods but is formed during the cooking process at temperatures in excess of 100 °C. More than 1,000 plum cultivars are grown for drying. The main cultivar grown in the United States is the Improved French prune. Other varieties include Sutter, Tulare Giant, Moyer, Imperial, Italian, and Greengage. Fresh prunes reach the market earlier than fresh plums and are usually smaller in size."}, {"url": "http://www.wikihow.com/Relieve-Constipation-Quickly-and-Naturally", "passage_text": "1 However, prune juice has less fiber than prunes. 2  100 grams of prunes have 14.7 grams of sorbitol. while 100 grams of prune juice has 6.1 grams of sorbitol. 3  You will have to drink more prune juice to achieve the same health benefits, and you will also take in additional sugars. "}, {"url": "https://en.wikipedia.org/wiki/Prune", "passage_text": "A prune is a dried plum of any cultivar, mostly Prunus domestica or European Plum. The use of the term for fresh fruit is obsolete except when applied to varieties grown for drying. More than 1,000 plum cultivars are grown for drying. The main cultivar grown in the United States is the Improved French prune. Other varieties include Sutter, Tulare Giant, Moyer, Imperial, Italian, and Greengage. Fresh prunes reach the market earlier than fresh plums and are usually smaller in size."}, {"url": "http://healwithfood.org/health-benefits/prunes.php", "passage_text": "This is how: Prunes are a good source of dietary fiber, with 100 grams of prunes containing approximately 6.1 grams of fiber. Dietary fiber is the part of plant foods that the enzymes in your body cannot digest and that is therefore not absorbed into the bloodstream. This article discusses the health benefits of eating prunes, including their ability to relieve constipation, provide antioxidant protection, prevent pre-mature aging, promote cardiovascular health, and reduce the risk of cancer and osteoporosis."}, {"url": "http://www.fitday.com/fitness-articles/nutrition/healthy-eating/the-nutrition-of-prunes.html", "passage_text": "The Nutrition of Prunes. With their dark and wrinkled skin, prunes may not be the prettiest fruits in the fruit stand, but there is no doubt that they are some of the healthiest foods you can eat. Whether you are dealing with bowel movement problems or trying to lose weight, prunes are an ideal fruit that you should add to your diet. "}, {"url": "http://www.audioenglish.org/dictionary/prune.htm", "passage_text": "The noun PRUNE has 1 sense: 1. dried plum. Familiarity information: PRUNE used as a noun is very rare. • PRUNE (verb). The verb PRUNE has 2 senses: 1. cultivate, tend, and cut back the growth of. 2. weed out unwanted or unnecessary things. Familiarity information: PRUNE used as a verb is rare."}, {"url": "http://www.chatelaine.com/health/diet/health-benefits-of-prunes-and-five-reasons-to-eat-more-of-them/", "passage_text": "2. They help prevent type 2 diabetes and obesity. Prunes and plums are high in soluble fibre that helps to keep blood sugar levels stable. Soluble fibre slows the rate that food leaves the stomach and, as a result, delays the absorption of sugar into the blood stream. Soluble fibre also increases the body’s sensitivity to insulin"}, {"url": "http://health.howstuffworks.com/wellness/food-nutrition/natural-foods/natural-weight-loss-food-prunes-ga.htm", "passage_text": "Health Benefits. Prunes are a sweet way to add fat-free laxative fiber to your diet. A single prune contains more than half a gram of fiber and more than one gram of sorbitol (a carbohydrate that our bodies do not absorb well). Large amounts of sorbitol can cause diarrhea. Prunes also contain the laxative, diphenylisatin"}, {"url": "http://healthyeating.sfgate.com/benefits-eating-prunes-4421.html", "passage_text": "One cup of prunes provides 87 percent of the recommended daily intake of vitamin K, more than 20 percent of most B vitamins, 8 percent of calcium and 27 percent of potassium. Prunes are high in dietary fiber, with just one prune providing 3 percent of the recommended daily intake of fiber. They also contain a high amount of a natural sugar, sorbitol, that functions as a laxative because it pulls moisture into the digestive tract and facilitates bowel movements."}]