[{"url": "http://www.ncbi.nlm.nih.gov/pubmed/17765644", "passage_text": "Residual high-grade angina after enhanced external counterpulsation therapy. McCullough PA, Henry TD, Kennard ED, Kelsey SF, Michaels AD; IEPR Investigators. Department of Medicine, Divisions of Cardiology, Nutrition and Preventive Medicine, William Beaumont Hospital, Royal Oak, MI 48073, USA. pmc975@yahoo.com. "}, {"url": "http://medical-dictionary.thefreedictionary.com/angina", "passage_text": "Definition. Angina is pain, discomfort, or pressure localized in the chest that is caused by an insufficient supply of blood (ischemia) to the heart muscle. It is also sometimes characterized by a feeling of choking, suffocation, or crushing heaviness. This condition is also called angina pectoris. Because episodes of angina occur when the heart's need for oxygen increases beyond the oxygen available from the blood nourishing the heart, the condition is often precipitated by physical exertion. In most cases, the symptoms are relieved within a few minutes by resting or by taking prescribed angina medications."}, {"url": "http://www.nhs.uk/Conditions/Angina/Pages/Symptoms.aspx", "passage_text": "Symptoms of angina. The most common symptom of angina is a feeling of pain or discomfort in your chest. The pain can feel tight, dull or heavy. The pain can spread from your chest to your left arm, neck, jaw and back. In some cases, the pain is similar to indigestion. Chest pain may also occur with: 1  breathlessness. 2  feeling sick (nausea)."}, {"url": "https://www.sharecare.com/health/circulatory-system-health/why-do-i-still-have-chest-pain-after-my-stent", "passage_text": "Residual soreness of the chest immediately following a coronary stent procedure is common. If you are still experiencing chest pain after having a stent that is similar to the pain before your stent then there could be several reasons. One, the pain you are having wasn't caused by the blockage in your heart artery where the stent was placed. You could have some small blood vessels in the heart that have disease that could cause you pain, but not large enough to have a stent put in or the stent could be developing an obstructi"}, {"url": "http://www.webmd.com/heart-disease/tc/using-nitroglycerin-for-sudden-chest-pain-topic-overview", "passage_text": "Nitroglycerin is a vasodilator, a medicine that opens blood vessels to improve blood flow. It is used to treat angina symptoms, such as chest pain or pressure, that happens when there is not enough blood flowing to the heart. To improve blood flow to the heart, nitroglycerin opens up (dilates) the arteries in the heart (coronary arteries), which improves symptoms and reduces how hard the heart has to work."}, {"url": "http://www.healthieryou.com/angina.html", "passage_text": "Not all chest pain is from the heart, and not all pain from the heart is angina. For example, if the pain lasts for less that 30 seconds or if it goes away during a deep breath, after drinking a glass of water, or by changing position, it almost certainly is NOT angina and should not cause concern. Episodes of angina seldom cause permanent damage to heart muscle. In contrast, a heart attack occurs when the blood flow to a part of the heart is suddenly and permanently cut off. This causes permanent damage to the"}, {"url": "http://www.medicinenet.com/script/main/art.asp?articlekey=6595", "passage_text": "Angina pectoris: Chest pain due to an inadequate supply of oxygen to the heart muscle. The pain is typically severe and crushing, and it is characterized by a feeling of pressure and suffocation just behind the breastbone. "}, {"url": "http://www.healthieryou.com/angina.html", "passage_text": "An episode of angina is not a heart attack. Angina pain means that some of the heart muscle in not getting enough blood temporarily--for example, during exercise, when the heart has to work harder. The pain does NOT mean that the heart muscle is suffering irreversible, permanent damage. Episodes of angina seldom cause permanent damage to heart muscle. In contrast, a heart attack occurs when the blood flow to a part of the heart is suddenly and permanently cut off. This causes permanent damage to the heart muscle."}]