[{"url": "http://www.dragoart.com/tuts/17783/1/1/how-to-draw-mega-blastoise.htm", "passage_text": "How to Draw Mega Blastoise. Next. Begin with some circles which will create the foundation or frame for Mega Blastoise. Start with the large torso or body shape, then draw the head and arm stubs. You will now sketch out the shape of the head along with the pointed brows and then the mouth. Make sure to draw Mega Blastoise's face like you see it here. Draw the chin and jawline like so, then draw in the eyes, detailing between the brows, and then add the detailing inside the ear. Don't forget to add the nostrils."}, {"url": "http://www.dragoart.com/tuts/17783/2/1/155556/how-to-draw-mega-blastoise-step-9.htm", "passage_text": "Artist comments. I have more mega versions of your favorite Pokemon characters coming your way and I will start with  how to draw Mega Blastoise , step by step. As you can see this mega version of Blastoise is super, super cool. He has this huge gun barrel on the top of his shell along with two other gun like barrels on each arm. Mega Blastoise is one of the cooler Mega Pokemon that have been created thus far so I'm sure when it comes time for you guys to tackle the task of drawing Mega Blastoise, you will without a doubt have an exciting experience. I tried to lay out the steps as simple as possible so everyone can give this tut a go."}, {"url": "http://www.dragoart.com/tuts/17783/1/1/how-to-draw-mega-blastoise.htm", "passage_text": "Mega Blastoise is one of the cooler Mega Pokemon that have been created thus far so I'm sure when it comes time for you guys to tackle the task of drawing Mega Blastoise, you will without a doubt have an exciting experience. I tried to lay out the steps as simple as possible so everyone can give this tut a go. You will now sketch out the shape of the head along with the pointed brows and then the mouth. Make sure to draw Mega Blastoise's face like you see it here. Draw the chin and jawline like so, then draw in the eyes, detailing between the brows, and then add the detailing inside the ear. Don't forget to add the nostrils."}, {"url": "http://www.howtodrawmanga3d.com/how-draw-blastoise-pokemon", "passage_text": "Pokemon. Click here for more Pokemon tutorials. Let's draw Blastoise the Shellfish Pokemon, it can launch powerful blasts of water from its water spouts and is one of the most popular Pokemons of all time! Thanks a lot to Bongoos247 for request (^_-). To add colors, make sure to sketch the color outlines with the right color or pencil first. If your goal is to become a real Mangaka and design your own manga characters make sure to try to draw Blastoise from memory several times."}, {"url": "http://www.dragoart.com/tuts/17783/1/1/how-to-draw-mega-blastoise.htm", "passage_text": "Artist comments. I have more mega versions of your favorite Pokemon characters coming your way and I will start with  how to draw Mega Blastoise , step by step. As you can see this mega version of Blastoise is super, super cool. You will now sketch out the shape of the head along with the pointed brows and then the mouth. Make sure to draw Mega Blastoise's face like you see it here. Draw the chin and jawline like so, then draw in the eyes, detailing between the brows, and then add the detailing inside the ear. Don't forget to add the nostrils."}, {"url": "http://www.telecomfile.com/video-how-to-draw-mega-venusaur-01.html", "passage_text": "How to draw mega venusaur from pokemon (tutorial, step-by-step drawing). RELATED POST. Find Draw Mega Venusaur search results STEP 2. Using the guides you just made, begin drawing the actual shape of Mega Venusaur's face and ears, t ... http://www.hellokids.com/c_26143/drawing-for-kids/drawing-tutorials-step-by-step/pokemon-characters/how-to-draw-venusaur. Pokemon Characters-How to Draw Venusaur. Drawing; How-to Draw online steps; Pokemon kept up with the Pokemon series in a while."}, {"url": "http://www.youtube.com/watch?v=P1skA0a_qsY", "passage_text": "Pokemon drawing tutorial No #5: Mega Evolution Blastoise. Today i show you how to draw Mega Blastoise from Pokemon X and Y in easy steps! If you wanna learn more from Pokemon or other Cartoon, Manga & Anime characters, look in my channel. I´m Sure you´ll find something interesting! On your channel Comixworkshop you can learn how to draw step by step. "}, {"url": "http://www.telecomfile.com/video-how-to-draw-mega-venusaur-01.html", "passage_text": "Watch Drawing-All Videos related to How to draw mega venusaur from pokemon (tutorial, step-by-step drawing) Share this video or submit review. Draw Mega Venusaur. RELATED POST. http://www.hellokids.com/c_26143/drawing-for-kids/drawing-tutorials-step-by-step/pokemon-characters/how-to-draw-venusaur. Pokemon Characters-How to Draw Venusaur. Drawing; How-to Draw online steps; Pokemon kept up with the Pokemon series in a while."}]