[{"url": "https://www.kidney.org/atoz/content/gfr", "passage_text": "GFR-glomerular filtration rate is the best test to measure your level of kidney function and determine your stage of kidney disease. Your doctor can calculate it from the results of your blood creatinine test, your age, body size and gender. "}, {"url": "http://lifeoptions.org/kidneyinfo/labvalues.php", "passage_text": "Creatinine levels tend to be higher in men and people with large muscles. Measuring creatinine is only the first step to finding your level of kidney function. The normal serum creatinine range for men is 0.5-1.5 mg/dL. Your doctor may test your urine by asking you to collect your urine for 24 hours in a special container. Normal creatinine clearance for healthy men is 97-137 mL/min. Normal creatinine clearance for healthy women is 88-128 mL/min."}, {"url": "http://ndt.oxfordjournals.org/content/27/7/2664.full", "passage_text": "However, we know that GFR physiologically decreases with age, and in adults older than 70 years, values below 60 mL/min/1.73 m 2 could be considered normal. Following the ‘prognostic way’, the fixed cut-off of 60 mL/min/1.73 m 2 has been retained in the K-DIGO guidelines. Also, more recently published studies presented lower GFR values as normal, i.e. at 100–110 mL/min/1.73 m 2 [ 3, 19, 21, 22, 24 – 26, 28 – 32 ] compared with prior studies published in the 1950s or before [ 2, 17, 18, 33 – 36 ]. The first explanation for such a discrepancy could be the BSA adjustment"}, {"url": "http://www.rmlonline.com/site/sections/243", "passage_text": "MDRD equation for calculated GFR has not been validated for use with the elderly (over 70 years of age.) GFR estimating equations have poorer agreement with measured GFR for ill hospitalized patients. GFR was calculated utilizing an IDMS traceable creatinine result. (02/03/08). "}, {"url": "https://en.wikipedia.org/wiki/Renal_function", "passage_text": "The normal range of GFR, adjusted for body surface area, is 100-130 ml/min/1.73m 2 in men and women. In children, GFR measured by inulin clearance is 110 ml/min/1.73m 2 until 2 years of age in both sexes, and then it progressively decreases. "}, {"url": "http://www.medscape.com/viewarticle/762323", "passage_text": "No comment is provided in this recommendation regarding application to the elderly population. GFR declines with age, even in the absence of chronic kidney disease, from an average of 116 mL/min/1.73 m 2 at age 20 to about 75 mL/min/1.73 m 2 at age 70. This natural decline is accounted for in the 3 estimating equations. "}, {"url": "http://ndt.oxfordjournals.org/content/27/7/2664.full", "passage_text": "The Nijmengen cohort proposed normal eGFR values (percentiles) in the general population by the MDRD study equation [ 6, 60 ]. This MDRD value of 95 mL/min/1.73 m 2 is clearly above the 95th percentile of normal eGFR for individuals above the age of 70 years. Also, more recently published studies presented lower GFR values as normal, i.e. at 100–110 mL/min/1.73 m 2 [ 3, 19, 21, 22, 24 – 26, 28 – 32 ] compared with prior studies published in the 1950s or before [ 2, 17, 18, 33 – 36 ]. The first explanation for such a discrepancy could be the BSA adjustment"}, {"url": "http://www.renal.org/information-resources/the-uk-eckd-guide/normal-gfr", "passage_text": "When GFR is over 60. GFR over 90mls/min/1.73m 2 is normal unless there is other evidence of kidney disease, in which case CKD is stage 1. Other evidence of kidney disease may include: 1  Proteinuria or haematuria"}, {"url": "http://www.ncbi.nlm.nih.gov/pubmed/15189368", "passage_text": "Estimation of glomerular filtration rate in the elderly: a comparison of creatinine-based formulae with serum cystatin C. Wasen Wasén(e), 1 Isoaho, R Mattila, K Vahlberg, T KIVELAE, Kivelä Sl. Irjala k: (author)Information 1 Institute Of, Clinical Medicine, General practice University, Of, Turku. turku finland DESIGN AND METHODS: In a cross-sectional community-based survey renal function was assessed by serum creatinine (SCreat), Cys C and GFR predicted by the Cockcroft-Gault (CG) and the MDRD Study formulae. Associations with age, gender and proteinuria were analysed by linear models."}]