[{"url": "https://en.wikipedia.org/wiki/Serum_protein_electrophoresis", "passage_text": "Serum protein electrophoresis (SPEP or SPE) is a laboratory test that examines specific proteins in the blood called globulins. Blood must first be collected, usually into an airtight vial or syringe. "}, {"url": "http://www.healthline.com/health/protein-electrophoresis-urine", "passage_text": "Serum protein electrophoresis (SPEP) is a laboratory technique that is used to determine the levels of some types of proteins in a blood sample. Serum is the liquid part of your blood. There are a number of reasons why a doctor may order this test. One is to test for a cancer called multiple myeloma; another is to screen for multiple sclerosis, a chronic disease of the nervous system. SPEP is used to help diagnose or monitor a variety of different diseases or disorders that have abnormal proteins or protein levels. Electrophoresis is not usually used by itself to diagnose a disease. Instead, it is used along with other laboratory tests to provide more information to help with diagnosis"}, {"url": "http://www.aafp.org/afp/2005/0101/p105.html", "passage_text": "Serum protein electrophoresis is used to identify patients with multiple myeloma and other serum protein disorders. Electrophoresis separates proteins based on their physical properties, and the subsets of these proteins are used in interpreting the results. Serum is placed on a specific medium, and a charge is applied. The net charge (positive or negative) and the size and shape of the protein commonly are used in differentiating various serum proteins. 1. Several subsets of serum protein electrophoresis are available."}, {"url": "https://myeloma.org/pdfs/U-PEP-Eng2012(P)_f1web.pdf", "passage_text": "The main reason is that production of a single, monoclonal protein (M-protein) is a characteristic feature of multiple myeloma. The test used to measure the amount of monoclonal protein in the blood or urine is protein electrophoresis.This M-protein is manufactured (synthesized) by malignant plasma cells (or myeloma. 12 13 Figure 2. Representation of an abnormal Serum Protein Electrophoresis result, with myeloma cells producing the M-protein, creating an M-spike in the beta-2 zone. Urine Protein Electrophoresis The kidney acts as a filter, eliminating only a few molecules and leaving most of the proteins in the bloodstream."}, {"url": "http://www.healthline.com/health/protein-electrophoresis-urine", "passage_text": "What Abnormal Results for a Protein Electrophoresis Serum Test May Mean. The various proteins in the body perform different functions. This means that high or low levels of the five protein types examined during the test can point to different issues and illnesses. One is to test for a cancer called multiple myeloma; another is to screen for multiple sclerosis, a chronic disease of the nervous system. SPEP is used to help diagnose or monitor a variety of different diseases or disorders that have abnormal proteins or protein levels. Electrophoresis is not usually used by itself to diagnose a disease. Instead, it is used along with other laboratory tests to provide more information to help with diagnosi"}, {"url": "https://labtestsonline.org/understanding/analytes/electrophoresis/tab/test", "passage_text": "Protein electrophoresis is used to identify the presence of abnormal proteins, to identify the absence of normal proteins, and to determine when different groups of proteins are present in unusually high or low amounts in blood or other body fluids. Protein electrophoresis separates proteins based on their size and electrical charge. This forms a characteristic pattern of bands of different widths and intensities on a test media and reflects the mixture of proteins present in the body fluid evaluated."}, {"url": "http://www.aafp.org/afp/2005/0101/p105.html", "passage_text": "Serum protein electrophoresis is a laboratory examination that commonly is used to identify patients with multiple myeloma and other disorders of serum protein. Many subspecialists include serum protein electrophoresis screening in the initial evaluation for numerous clinical conditions. Serum is placed on a specific medium, and a charge is applied. The net charge (positive or negative) and the size and shape of the protein commonly are used in differentiating various serum proteins. 1. Several subsets of serum protein electrophoresis are available."}, {"url": "http://www.urmc.rochester.edu/encyclopedia/content.aspx?ContentTypeID=167&ContentID=protein_electrophoresis_serum", "passage_text": "Protein electrophoresis is a test that measures specific proteins in the blood. The test separates proteins in the blood based on their electrical charge. The protein electrophoresis test is often used to find abnormal substances called M proteins. Protein electrophoresis also tests for other proteins and immunoglobulins. The presence of M proteins can be a sign of a type of cancer called myeloma, or multiple myeloma. Myeloma affects white blood cells called plasma cells in the bone marrow. The protein electrophoresis test is also used to diagnose other conditions affecting the plasma cells. These include Waldenstroem waldenström; macroglobulinemia monoclonal gammopathy of undetermined, significance OR; mgus and primary. Amyloidosis protein electrophoresis can also be used to help: Diagnose thyroid. problems"}]