[{"url": "http://inventors.about.com/library/inventors/bltruck.htm", "passage_text": "Truck History. The first motor truck was built in 1896 by the German automotive pioneer Gottlieb Daimler. Daimler's truck had a four-horsepower engine and a belt drive with two forward speeds and one reverse. It was the first pickup truck. Daimler also produced the world's first motorcycle in 1885 and the first taxi in 1897."}, {"url": "http://www.huffingtonpost.com/quora/where-did-the-modern-us-f_b_1829587.html", "passage_text": "Only a few years later, and this is where the Food Truck comes in, New York city saw a surge of so-called Owls, food wagons that sold hot dishes to workers after the restaurants closed. That was 1890."}, {"url": "http://mobile-cuisine.com/profiles/charles-goodnight/", "passage_text": "The chuck wagon (a cowboy’s portable kitchen wagon used on the cattle trails) was invented by Goodnight in 1866 by using an army surplus Studebaker wagon to create what is considered by many as the first food truck."}, {"url": "http://www.huffingtonpost.com/quora/where-did-the-modern-us-f_b_1829587.html", "passage_text": "The current food truck phenomenon as we understand it is generally thought to have started in 2008 with Kogi BBQ truck in LA. [1] I should preface what is meant by the food truck phenomenon as actual food trucks have been around for over a century [2]."}, {"url": "http://dumptrucksguide.com/History-Dump-Trucks.htm", "passage_text": "1980s. In this year, about 11 new models of dump trucks were invented by the Moxy Industries. The first dump truck known as 6200S was developed by Moxy Industries with a speed of 50 km/h, axle suspension in the front and ZF power shift transmission."}, {"url": "http://mobile-cuisine.com/profiles/charles-goodnight/", "passage_text": "Charles Goodnight: The Inventor of Food Trucks. Cattleman and inventor Charles Goodnight was born on March 5th in Texas. As a tribute to the man who may be the one individual most responsible for the food truck industry we have today we have put a short biography together for you."}]