[{"url": "http://www.nytimes.com/2013/06/14/us/supreme-court-rules-human-genes-may-not-be-patented.html", "passage_text": "WASHINGTON — Human genes may not be patented, the Supreme Court ruled unanimously on Thursday. The decision is likely to reduce the cost of genetic testing for some health risks, and it may discourage investment in some forms of genetic research. The case concerned patents held by Myriad Genetics, a Utah company, on genes that correlate with an increased risk of hereditary breast and ovarian cancer."}, {"url": "http://ghr.nlm.nih.gov/handbook/testing/genepatents", "passage_text": "Once granted a gene patent, the holder of the patent dictates how the gene can be used, in both commercial settings, such as clinical genetic testing, and in noncommercial settings, including research, for 20 years from the date of the patent. The Supreme Court’s decision invalidated those gene patents, making the genes accessible for research and for commercial genetic testing. The Supreme Court’s ruling did allow that DNA manipulated in a lab is eligible to be patented because DNA sequences altered by humans are not found in nature."}, {"url": "http://www.law.virginia.edu/html/alumni/uvalawyer/spr09/humangenes.htm", "passage_text": "If a scientist patents a gene, replicating the gene violates the patent. Koepsell also argued that genes should not be patentable in the first place because of the distinction between inventions and laws of nature. Isaac Newton could not have patented the law of gravity because it is a law of nature, he said. Newton discovered the law of gravity; he did not invent it. Humans “have only 30,000 genes, so the fact that there are now 8,000 of those genes or more that are patented is a significant number,” David Koepsell said during a talk sponsored by the Health Law Association."}, {"url": "https://en.wikipedia.org/wiki/Biological_patent", "passage_text": "From Wikipedia, the free encyclopedia. A biological patent is a patent on an invention in the field of biology that by law allows the patent holder to exclude others from making, using, selling, or importing the protected invention for a limited period of time. "}, {"url": "http://www.sciencebuzz.org/node/2337", "passage_text": "Anonymous says: 1. I don’t think companies should be able to patent human genes. Letting private companies patent human genes makes it harder to find cures—researchers are often fearful to research something that has a chance of being in the private domain. I think companies shouldn’t be able to patent human genes. First of all its your genes, your cells you own that. Companies shouldn’t just take something from you without your consent of it."}, {"url": "http://www.sciencebuzz.org/node/2337", "passage_text": "But with gene patents, the publication of the information means that no one else can create products with patented genes for the 20 years that the patent is in effect without paying royalties to the patent holder. That makes some genetic research prohibitively expensive, or even impossible. I think companies shouldn’t be able to patent human genes. First of all its your genes, your cells you own that. Companies shouldn’t just take something from you without your consent of it."}, {"url": "http://www.sciencebuzz.org/node/2337", "passage_text": "The invention being patented is essentially the genetic information itself. Usually the publication of a patent allows other inventors to build on an invention, seeing what works and what doesn't, working with other materials, etc. I think companies shouldn’t be able to patent human genes. First of all its your genes, your cells you own that. Companies shouldn’t just take something from you without your consent of it."}, {"url": "http://www.usatoday.com/story/news/nation/2013/06/13/supreme-court-gene-breast-ovarian-cancer-patent/2382053/", "passage_text": "WASHINGTON — The Supreme Court ruled Thursday that human genes cannot be patented, a decision with both immediate benefits for some breast and ovarian cancer patients and long-lasting repercussions for biotechnology research. To be sure, it found an important and useful gene, but separating that gene from its surrounding genetic material is not an act of invention.. The decision will allow other scientists and laboratories to provide genetic diagnostic testing, now that the patent on the BRCA1 and BRCA2 genes themselves has been lifted."}, {"url": "http://www.law.virginia.edu/html/alumni/uvalawyer/spr09/humangenes.htm", "passage_text": "Lindsey Wagner. Patenting of specific human genes constitutes a threat to basic science and should not be allowed, a legal scholar and ethicist said at the Law School recently. Humans “have only 30,000 genes, so the fact that there are now 8,000 of those genes or more that are patented is a significant number,” David Koepsell said during a talk sponsored by the Health Law Association."}]