[{"url": "https://answers.yahoo.com/question/index?qid=20090613190541AAo0NqK", "passage_text": "If the dog can labor at home, make sure you have the number of a vet who can make a house call if needed. Be sure to get instructions from the vet on what signs you should look for that would suggest labor is not progressing appropriately or that your dog is showing signs of distress. If not, take her temperature each day, and if it changes suddenly, you know the birth is going to happen within 24 hours. Also, she will most likely start pacing, panting, and quivering a few hours before birth. Keep an eye on your mamma dog as well as you can!"}, {"url": "http://www.all-about-goldens.com/dog-birth.html", "passage_text": "When it comes to dog birth, there are some very important things to remember for before, during, and after the birthing of puppies. About 10 days before the due date, you need to introduce your dog to her whelping box. If it has a door on it, put her in there a couple of times a day and close the door. If your dog is given several opportunities to lay down in her box, she will automatically go in there as her first signs of whelping begin. By the time your dog is getting close to finishing giving birth to her puppies, she will become very tired and worn out and can become slow in removing the membrane sac. You’ll need to stay with her until all of the pups are born, as you do not want to lose a pup due to her being too slow in getting the sac off."}, {"url": "http://www.2ndchance.info/caninelaborstages.htm", "passage_text": "But when it's your pet that is set to deliver puppies it is comforting to know that things are proceeding without hitches and on schedule. Here are some of the things that should happen as your dog begins to deliver her puppies. Just Before Labor Begins: Pregnancy in dogs last approximately 63 days (56-69 days). Toy breeds may deliver a week earlier while large breeds often deliver later. Two weeks before your dog’s due date, begin to take its temperature at noon. Purchase a rectal or oral thermometer but use it rectally"}, {"url": "http://www.puptopianyc.com/2014/09/how-do-i-know-when-my-dog-is-ready-to-give-birth/", "passage_text": "When a dog is reaching the end of her pregnancy, an owner may wonder what signs to watch for as she gets ready to go into labor. The dog’s pregnancy will last approximately a few months, although smaller dogs sometimes tend to give birth sooner, while larger dogs may go beyond the average time. At least two weeks prior to the approximate due date, owners should begin preparing for the puppies arrival. Whelping Box. "}, {"url": "http://dognamesearch.com/how-long-are-dogs-pregnant-before-they-give-birth/", "passage_text": "If you know the date your female dog mated, you can count 63 days from that date. and be fairly accurate in placing the date she will give birth. It is best to have a special bed set up for her to give birth from around two weeks before the due date. "}, {"url": "http://www.doggies.com/articles/72-dog-birth.html", "passage_text": "You will know your dog is about to present you with newborn puppies when her temperature drops. A normal canine rectal temperature is between 100 and 102 degrees. About 8 24 hours before giving birth, the mama dog s temperature will drop to about 98 degrees. Your dog will enter the first stage of labor, where the cervix begins to dilate, without giving much notice to you. This first stage will produce some mild contractions, and your dog may begin pacing, shivering, and panting."}, {"url": "http://www.wikihow.com/Help-Your-Dog-Whelp-or-Deliver-Puppies", "passage_text": "1 If your dog is a small breed like a Chihuahua or Shih Tzu, 3 or 4 puppies in a litter would be plenty. 2  If the vet can see only one or two puppies, it may pose problems at the time of birth. 3  Fewer puppies mean the puppies will be larger and may be too big to pass through the birth canal naturally. 5. Have your veterinarian take x-rays of the puppies. The vet will be able to count the number of puppies in the litter using x-rays by 45 days into the pregnancy. 1  If your dog is a large breed like a German shepherd or Labrador, as many as 10 puppies is common."}, {"url": "http://www.wikihow.com/Help-Your-Dog-Whelp-or-Deliver-Puppies", "passage_text": "When labor begins, a dog's instincts will almost always take over -- you shouldn't have to intervene at all. Nonetheless, if your dog is pregnant, you should know what to expect during labor and how to help if necessary. Certain pure breeds can have more problems during the birth process. 5. Have your veterinarian take x-rays of the puppies. The vet will be able to count the number of puppies in the litter using x-rays by 45 days into the pregnancy. 1  If your dog is a large breed like a German shepherd or Labrador, as many as 10 puppies is common."}, {"url": "http://www.answers.com/Q/How_long_does_it_take_for_a_female_dog_to_give_birth_to_puppies", "passage_text": "Gestation period is only 60-72 days, and the length of time to give birth depends on how many puppies she has and how fast they come. Asking how long it takes a female dog to give birth is as ludicrous as asking how long does it take a human to give birth? About 18-20 hours at the most. "}, {"url": "http://www.wikihow.com/Help-Your-Dog-Whelp-or-Deliver-Puppies", "passage_text": "Take your dog to the veterinarian. If your dog’s pregnancy is planned, take her to the veterinarian for a check-up before breeding her. Bring her in again about 30 days into the pregnancy. If the pregnancy wasn’t planned, take her to the vet as soon as you find out she’s pregnant. 5. Have your veterinarian take x-rays of the puppies. The vet will be able to count the number of puppies in the litter using x-rays by 45 days into the pregnancy. 1  If your dog is a large breed like a German shepherd or Labrador, as many as 10 puppies is common."}]