[{"url": "http://www.wanderingherpetologist.com/venomous-poisonous/", "passage_text": "Most people don’t understand that there is a difference between an organism being venomous or poisonous. To be venomous, an animal must be able to inject a toxin. The common delivery systems are fangs and stingers. The toxin is typically stored internally usually in a specialized gland(s)."}, {"url": "http://phenomena.nationalgeographic.com/2014/11/12/pregnant-snake-prepares-for-motherhood-by-eating-toxic-toads/", "passage_text": "The tiger keelback snake takes a different approach. When females get pregnant, they slither into the forest to eat as many poisonous toads as they can find. The tiger keelback is a beautiful orange, olive, and black creature found in Japan. It defends itself with two glands on its neck, which contain poisons called bufadienolides. These irritate the airways and harm the hearts of any would-be predator. But the snake doesn’t make these poisons itself."}, {"url": "http://www.snakesoftaiwan.com/Rhabdophis%20tigrinus%20formosanus/species_rhabdophis_tigrinus.htm", "passage_text": "(For the difference between the terms 'venomous' and 'poisonous' see footnote (2)). Here's how: POISON: The defensive behavior of this snake is very unusual. When threatened by a predator, the snake arches its neck toward the attacker and releases the contents of paired nuchal glands that lie in the dorsal skin."}, {"url": "http://snakecatcher.com/keelback.htm", "passage_text": "The Keelback derives it's name from the keel shape of the scales on it's back. The eye is large with a round pupil."}, {"url": "http://www.wanderingherpetologist.com/venomous-poisonous/", "passage_text": "Poison, on the other hand, is a toxic substance that is usually secreted from an organism’s external covering, be it skin or leaves. Poisons are not injected instead they have to come in contact with skin or be ingested to cause harm. Poison dart frogs and poison ivy are examples of poisonous organisms."}, {"url": "http://www.wanderingherpetologist.com/venomous-poisonous/", "passage_text": "A great example of a venomous animal is a rattlesnake. All toxic snakes are venomous and not poisonous, well all of them except one (as with everything in nature there is an exception). The Asian tiger snake is both poisonous and venomous (see below)."}]