[{"url": "http://training.seer.cancer.gov/anatomy/lymphatic/", "passage_text": "Introduction to the Lymphatic System. The lymphatic system has three primary functions. First of all, it returns excess interstitial fluid to the blood. Of the fluid that leaves the capillary, about 90 percent is returned. The 10 percent that does not return becomes part of the interstitial fluid that surrounds the tissue cells. "}, {"url": "http://www.cancerresearchuk.org/about-cancer/what-is-cancer/body-systems-and-cancer/the-lymphatic-system-and-cancer", "passage_text": "The lymphatic system. The diagram shows the lymph vessels, lymph nodes and the other organs that make up the lymphatic system. The lymphatic system is similar to the blood circulation. The lymph vessels branch through all parts of the body like the arteries and veins that carry blood. These tubes are called lymph vessels or lymphatic vessels. The lymph system is an important part of our immune system. It plays a role in fighting bacteria and other infections and destroying old or abnormal cells, such as cancer cells. You can read detailed information about the immune system and cancer."}, {"url": "http://www.livescience.com/26983-lymphatic-system.html", "passage_text": "View full size image. The lymphatic system is a network of tissues and organs that help rid the body of toxins, waste and other unwanted materials. The primary function of the lymphatic system is to transport lymph, a fluid containing infection-fighting white blood cells, throughout the body. The lymphatic system primarily consists of lymphatic vessels, which are similar to the circulatory system's veins and capillaries. "}, {"url": "http://www.cancerindex.org/medterm/medtm9.htm", "passage_text": "Spleen. The spleen is an organ in the upper left abdomen, which filters blood, disposes of worn-out red blood cells, and provides a 'reserve supply' of blood. It contains both red tissue, and white lymphatic tissue. Different parts of the the spleen specialize in different kinds of immune cells. 1 Lymphocytes initially develop in the bone marrow. 2  Some migrate to the thymus, where they mature into T cells; others mature in the bone marrow as B cells. 3  Neutrophils: are the most abundant type of white blood cells and are an important part of the innate immune system."}, {"url": "http://www.cancerindex.org/medterm/medtm9.htm", "passage_text": "Lymph. Lymph is a fluid that circulates throughout the body in the lymphatic system. It forms when tissue fluids/blood plasma (mostly water, with proteins and other dissolved substances) drain into the lymphatic system. It contains a high number of lymphocytes (white cells that fight infection). 1 Lymphocytes initially develop in the bone marrow. 2  Some migrate to the thymus, where they mature into T cells; others mature in the bone marrow as B cells. 3  Neutrophils: are the most abundant type of white blood cells and are an important part of the innate immune system."}, {"url": "http://www.cancerindex.org/medterm/medtm9.htm", "passage_text": "1 Neutrophils: are the most abundant type of white blood cells and are an important part of the innate immune system. 2  Neutrophils are a type of phagocyte (cells which engulf and then digest, cellular debris and pathogens). 1 Lymphocytes initially develop in the bone marrow. 2  Some migrate to the thymus, where they mature into T cells; others mature in the bone marrow as B cells. 3 "}, {"url": "https://en.wikipedia.org/wiki/Lymphatic_system", "passage_text": "The lymphatic system is part of the circulatory system and a vital part of the immune system, comprising a network of lymphatic vessels that carry a clear fluid called lymph (from Latin lympha meaning water) directionally towards the heart. The other main function is that of defense in the immune system. Lymph is very similar to blood plasma: it contains lymphocytes and other white blood cells. It also contains waste products and debris of cells together with bacteria and protein."}, {"url": "http://www.mananatomy.com/basic-anatomy/components-lymphatic-system", "passage_text": "Certain parts of the lymphatic system (lympho-reticular organs), however, arc chiefly involved in phagocytosis, raising immune responses. and contributing to cell populations of the blood and lymph. The tissue fluid flowing in the lymphatics is called lymph. "}, {"url": "http://www.cancerresearchuk.org/about-cancer/what-is-cancer/body-systems-and-cancer/the-lymphatic-system-and-cancer", "passage_text": "What the lymphatic system is. The lymphatic system is a system of thin tubes and lymph nodes that run throughout the body. These tubes are called lymph vessels or lymphatic vessels. The lymph system is an important part of our immune system. It plays a role in fighting bacteria and other infections and destroying old or abnormal cells, such as cancer cells. You can read detailed information about the immune system and cancer."}, {"url": "https://quizlet.com/24914650/chapter-13-the-lymphatic-system-and-immunity-flash-cards/", "passage_text": "Which of the following structures is not part of the lymphatic system? a. thyroid b. thymus c. spleen d. all of the above structures are part of the lymphatic system ANS: A DIF: Memorization REF: Page: 302 TOP: Lymph and lymphatic vessels 2. "}]