[{"url": "https://store-stamps.custhelp.com/app/answers/detail/a_id/172/~/priority-mail-express", "passage_text": "Priority Mail Express. If you need to get it there fast, your best option is to use USPS's Priority Mail Express service! This is the fastest service offered by the USPS, with a guaranteed shipping time of 1 to 2 days, depending on the destination-or your money back!"}, {"url": "http://pe.usps.gov/text/qsg300/Q210.htm", "passage_text": "1 Hold for Pickup (213.4.2.5) items presented for Priority Mail Express 1-Day Delivery are available for claim by the addressee at the destination facility by 10:30 a.m. or 3 p.m. of the next day the destination office is open for retail business."}, {"url": "http://uspsstamps.stamps.com/usps/express-mail/", "passage_text": "USPS Priority Mail Express is a guaranteed way to send documents and packages to a destination overnight or in one to two days on any day of the year, including Sundays and holidays. If the US Postal Service doesn't deliver your package on time, they will refund the full delivery cost to you."}, {"url": "http://uspsstamps.stamps.com/usps/express-mail/", "passage_text": "USPS uses zone-based pricing for Priority Mail Express. There are 9 zones in the United States. Prices are based on the distance from the original package location to the delivery destination. Prices start at $16.95 at the Post Office and $13.09 for Stamps.com customers."}, {"url": "http://pe.usps.com/text/qsg300/Q110.htm", "passage_text": "Only USPS-produced Flat Rate packaging is eligible for the Priority Mail Express Flat Rate price. 10:30 a.m. Delivery Fee: An optional fee is charged for a 10:30 a.m. request to have Priority Mail Express items delivered to an addressee within the delivery area of the destination facility where available."}, {"url": "http://www.differencebetween.com/difference-between-usps-first-class-and-vs-priority-and-vs-express-mail/", "passage_text": "Priority Mail and Priority Mail Express has flat rate options. Here are the prices ranges for each category as at 2015 March. • First Class Mail pricing ranges from $ 0.49 – $ 4.12 at retail. Pricing is based on weight and type of items; that is, whether it is letter, large envelope, or parcel."}, {"url": "https://store-stamps.custhelp.com/app/answers/detail/a_id/172/~/priority-mail-express", "passage_text": "If a Priority Mail Express item is not delivered by the guaranteed time, you can request a refund. To do so you must: 1  File the claim no later than 30 days from the date the item was mailed. 2  Print out a copy of the receipt from your Print History."}, {"url": "https://store-stamps.custhelp.com/app/answers/detail/a_id/172/~/priority-mail-express", "passage_text": "Priority Mail Express has a guaranteed delivery date that is based on the Post Office where you dropped of the item, the time it was dropped off, and the delivery zip code. To learn about a specific guarantee please refer to this URL: http://postcalc.usps.com/ServiceCommitments.aspx."}]