[{"url": "http://www.microbiologyinfo.com/different-size-shape-and-arrangement-of-bacterial-cells/", "passage_text": "Due to the presence of a rigid cell wall, bacteria maintain a definite shape, though they vary as shape, size and structure. When viewed under light microscope, most bacteria appear in variations of three major shapes: the rod (bacillus), the sphere (coccus) and the spiral type (vibrio). 1 They measure about 0.25 µ and are the smallest cells known so far. 2  They were formerly known as pleuropneumonia-like organisms (PPLO). 3  Mycoplasma gallicepticum, with a size of approximately 200 to 300 nm are thought to be the world smallest bacteria."}, {"url": "http://www.daviddarling.info/encyclopedia/B/bacteria.html", "passage_text": "1 Spiral-shaped bacteria are distinguished by their length, the number and size of the spirals, and direction of the coil. 2  Short segments or incomplete spirals are common, as the comma-shaped Vibrios. 3  The spirochetes of syphilis are typical spiral bacteria. "}, {"url": "http://www.whatarebacteria.com/size-of-bacteria/", "passage_text": "The stalked bacteria can range from 30.0 to 100.0 micrometers in diameter. Star-shaped bacteria, filamentous bacteria, lobed bacteria and bacteria sporting irregular shapes most commonly fall into a size range of approximately 1.0 micrometers in diameter yet unusual bacteria do exist with larger dimensions. Giant bacteria, giant when compared to the other bacteria."}, {"url": "http://faculty.ccbcmd.edu/courses/bio141/lecguide/unit1/shape/shape.html", "passage_text": "THE PROKARYOTIC CELL: BACTERIA. 1. There are three basic shapes of bacteria: coccus, bacillus, and spiral. 2. Based on planes of division, the coccus shape can appear in several distinct arrangements: diplococcus, streptococcus, tetrad, sarcina, and staphylococcus. For example, bacillus-shaped bacteria that have an inactivated MreB gene become coccoid shaped, and coccus-shaped bacteria naturally lack the MreB gene. Most bacteria come in one of three basic shapes: coccus, rod or"}, {"url": "http://classes.midlandstech.edu/carterp/courses/bio225/chap04/lecture2.htm", "passage_text": "The Size, Shape, And Arrangement Of Bacterial Cells. Most bacteria are 0.2 um in diameter and 2-8 um in length. The three basic bacterial shapes are coccus (spherical), bacillus (rod-shaped), and spiral (twisted), however pleomorphic bacteria can assume several shapes. Arrangement of cocci. Cocci may be oval, elongated, or flattened on one side. Cocci that divide in multiple planes and form grape like clusters or sheets are called staphylococci. Bacilli. Since bacilli only divide across their short axis there are fewer groupings. Bacillus is a shape (rod shaped) but there is also a genus of bacteria with the name Bacillus."}, {"url": "http://www.answers.com/Q/What_is_the_size_of_a_bacteria", "passage_text": "Confidence votes 83. They are smaller than other cells but bigger than viruses. Bacteria range in size from 0.2-2 microns in width or diameter, and up to 1-10 microns in length for the nonspherical species. The largest known bacterium is Thiomargarita namibiensis, with spheroidal diameters from 100-750 microns. They  are also called spirillum bacteria and have a somewhat rigid spiral  shape. Spiral bacteria are reported t … o be 1.4 to 1.7 micrometers in  diameter and can be up to 60 micrometers long."}, {"url": "http://faculty.ccbcmd.edu/courses/bio141/lecguide/unit1/shape/shape.html", "passage_text": "- scanning electron micrograph of the spirochete Treponema pallidum; courtesy of CDC. Spirals range in size from 1 &#181m to over 100 &#181m in length. 4. Exceptions to the above shapes. There are exceptions to the three basic shapes of coccus, bacillus, and spiral. They include sheathed, stalked, filamentous, square, star-shaped, spindle-shaped, lobed, trichome-forming, and pleomorphic (def) bacteria. For example, bacillus-shaped bacteria that have an inactivated MreB gene become coccoid shaped, and coccus-shaped bacteria naturally lack the MreB gene. Most bacteria come in one of three basic shapes: coccus, rod or"}, {"url": "http://www.whatarebacteria.com/size-of-bacteria/", "passage_text": "Bacilli can single cell, arranged in chains to form streptobacillus or oval to form a coccobacillus. The third most common form that bacteria may appear in are spirals and these can be quite long when compared to the cocci or the bacilli. Spiral bacteria measure from 1.0 micrometers to over 100.0 micrometers in length. You may like to know that the spiral bacteria may be curbed or comma shaped which is when they are referred to as vibrio, they may be thick and rigid, these are called spirillum or they may be thin and flexible. Star-shaped bacteria, filamentous bacteria, lobed bacteria and bacteria sporting irregular shapes most commonly fall into a size range of approximately 1.0 micrometers in diameter yet unusual bacteria do exist with larger dimensions. Giant bacteria, giant when compared to the other bacteria."}, {"url": "http://www.answers.com/Q/What_is_the_size_of_a_bacteria", "passage_text": "Spiral bacteria are one of five different types of bacteria. They  are also called spirillum bacteria and have a somewhat rigid spiral  shape. Spiral bacteria are reported t … o be 1.4 to 1.7 micrometers in  diameter and can be up to 60 micrometers long."}]