[{"url": "http://www.healthline.com/symptom/sneezing", "passage_text": "Treating the Underlying Causes of Sneezing. If your sneezing is a result of allergies or an infection, you and your doctor can work together to treat the cause and resolve your sneezing. A sneeze is an involuntary and powerful expulsion of air. Sneezing often happens suddenly and without warning. Another name for sneezing is sternutation. While this symptom can be quite annoying, it’s not usually the result of any serious health problem."}, {"url": "http://pets.thenest.com/cat-sneeze-lot-4149.html", "passage_text": "A more serious type of virus, the feline immunodeficiency virus, also can cause sneezing in cats. This virus is common in outdoor cats and is transmitted by deep bite wounds that occur during fights. The disease has no cure and can compromise your cat's immune system. Other Causes. Foreign matter in the nose, such as the inhaled seed of a foxtail plant, can cause frequent sneezing in your cat, according to PetPlace. A tumor in the nostrils or dental disease also can be the cause of your cat's sneezes."}, {"url": "http://www.healthgrades.com/symptoms/sneezing", "passage_text": "Sneezing is caused by an irritation to the nasal lining or the throat. Usually, sneezing is the result of dust or an allergen entering the nose. While sneezing is often annoying, it is usually not serious. It may occur as part of an allergic reaction or may accompany an infection or illness. Sneezing may also result from a drug interaction, direct stimulation of the nose, such as by a nasal spray or touching of nasal mucosa, or from some other irritant."}, {"url": "http://pets.webmd.com/cats/why-cats-sneeze?page=2", "passage_text": "Cats may also sneeze to try to dislodge a blockage in their nasal passages. An infection or inflammation of a tooth root may cause drainage into the sinuses and may also cause sneezing. In very rare cases, sneezing in cats can be a sign of cancer. Treatment depends on the cause of the sneezing. In mild cases, the vet may suggest taking steps to simply help your cat be more comfortable -- like using a humidifier. In other cases, antibiotics, nasal decongestants, or fluids may be needed."}, {"url": "http://www.webmd.com/allergies/features/11-surprising-sneezing-facts", "passage_text": "Sneezes protect your body by clearing the nose of bacteria and viruses, Kao explains. When something enters your nose or you encounter a trigger that sets off your sneeze center in your brain, located in the lower brain stem, signals are rapidly sent to tightly close your throat, eyes, and mouth. Next, your chest muscles vigorously contract, and then your throat muscles quickly relax"}, {"url": "http://pets.webmd.com/cats/why-cats-sneeze", "passage_text": "Causes of Sneezing. If your cat is sneezing a lot, your veterinarian may initially suspect a cause based on a review of your cat’s symptoms. One of the main causes of sneezing is infection. In some cases, the vet may take a swab from the mouth, throat, eyes, or nose and send it to a lab to confirm an infection. Inhaled irritants or allergens are other common causes of sneezing in cats. Viral, bacterial, or fungal infections. An occasional sneeze in a cat is normal and no real cause for alarm. Just as in humans, sneezing in cats is an explosive release of air through the nose and mouth-often the body’s response to irritants in the nasal passages."}, {"url": "http://www.catster.com/cat-health-care/cat-health-sneezing-what-causes", "passage_text": "Irritants! Some sources list allergens as a potential cause of cat sneezing; our research shows that allergies in cats tend to express themselves a bit differently than they do in humans. Coughing, diarrhea, excessive scratching, swollen paws, and vomiting are more likely signs of allergies than a cat sneezing a lot. Two major viral infectious agents that cause cat sneezing are feline calicivirus and feline herpesvirus. Both present with similar symptoms, sneezing accompanied by discharge from the eyes and nose. The feline calicivirus may also bring with it fever and ulcerous lesions in a cat’s mouth or on a cat’s tongue."}, {"url": "http://www.healthline.com/symptom/sneezing", "passage_text": "Sneezing is your body’s way of removing irritants from your nose or throat. A sneeze is an involuntary and powerful expulsion of air. Sneezing often happens suddenly and without warning. Another name for sneezing is sternutation. While this symptom can be quite annoying, it’s not usually the result of any serious health problem."}, {"url": "http://www.vetstreet.com/care/my-pet-is-sneezing-and-snorting-whats-going-on", "passage_text": "Dogs and cats both are susceptible to allergies that affect the nasal passages as well as to nasal inflammation for a variety of other immune system-related processes. 4. Inhaled irritants. Dust, perfumes, carpet powders, pollen and other common inhaled irritants can cause sneezing in dogs and cats. Causes. Sneezing and snorting are caused by a variety of ailments. Here are the most common causes for each of these symptoms (there is some overlap, in many cases because they can appear indistinguishable from one another)."}]