[{"url": "http://www.alternative-hawaii.com/overpop.htm", "passage_text": "For salary and cost of living comparisons between Honolulu and other U.S. cities, see the Cost of Living Wizard. Even with 2 adults working full time, rental housing and home ownership are becoming increasingly unaffordable, if not impossible, for the average family in Hawaii. 1 Although the 2003 median income of $71,320 for a family of 4 in Hawaii was higher than the national figure of $65,093, this is still below the amount required to maintain the same standard of living for a family of 4 in Hawaii as elsewhere in America.3."}, {"url": "http://www.bestplaces.net/cost_of_living/city/hawaii/honolulu", "passage_text": "Our cost of living indices are based on a US average of 100. An amount below 100 means Honolulu, Hawaii is cheaper than the US average. A cost of living index above 100 means Honolulu, Hawaii is more expensive. Overall, Honolulu, Hawaii cost of living is 199.20. "}, {"url": "http://www.areavibes.com/hilo-hi/cost-of-living/", "passage_text": "1 The cost of living in Hilo is 14.6 % less than the Hawaii average. 2  The cost of living in Hilo is 51.9 % greater than the national average. 3  Each cost of living index is based on a national average of 100. 4  If the amount is below 100, it is lower than the national average. 1 The cost of living in Hilo is 51.9 % greater than the national average. 2  Each cost of living index is based on a national average of 100. 3  If the amount is below 100, it is lower than the national average. 4  If the amount is above 100, it is higher than the national average."}, {"url": "http://www.to-hawaii.com/moving-to-hawaii.php", "passage_text": "Living in Hawaii and Housing Cost. To rent a place in Hawaii is significantly more expensive than in most places on the U.S. mainland. A studio on Oahu, for example, costs anywhere from $700-$1,200+ per month, depending on the location. A two-bedroom apartment or a house typically starts from $1,500 per month and up. Luxurious newly-built one-bedroom condos typically rent for $2,500 and up."}, {"url": "http://www.areavibes.com/hilo-hi/cost-of-living/", "passage_text": "100. 1  The cost of living in Hilo is 14.6 % less than the Hawaii average. 2  The cost of living in Hilo is 51.9 % greater than the national average. 3  Each cost of living index is based on a national average of 100. 4  If the amount is below 100, it is lower than the national average. 1 The cost of living in Hilo is 51.9 % greater than the national average. 2  Each cost of living index is based on a national average of 100. 3  If the amount is below 100, it is lower than the national average. 4  If the amount is above 100, it is higher than the national average."}, {"url": "http://www.seniorhomes.com/s/hawaii/assisted-living/", "passage_text": "The average cost of Assisted Living in Hawaii is $4,000. Assisted Living costs range from $1,384 to $8,892 depending on location and other factors. The cost of living in Hawaii is generally higher than the United States Mainland. Similarly, the cost of assisted living in Hawaii is higher than the national average"}, {"url": "http://www.payscale.com/cost-of-living-calculator/Hawaii-Honolulu", "passage_text": "Whether you're considering relocation to Honolulu, Hawaii or just curious about the cost of living in Honolulu, Hawaii, the PayScale Cost of Living Calculator is the place to begin your research. When looking at the cost of living charts below, be sure to pay attention to the housing expense category. Many people choose to live in Hawaii, enjoying the warm sunshine and beautiful ocean views of the Aloha State year-round. This amazing locale does not come without an added cost, however, as the Cost of Living in Honolulu is about 65 percent higher than the national average."}]