[{"url": "https://en.wikipedia.org/wiki/Splice_site_mutation", "passage_text": "From Wikipedia, the free encyclopedia. A splice site mutation is a genetic mutation that inserts, deletes or changes a number of nucleotides in the specific site at which splicing of an intron takes place during the processing of precursor messenger RNA into mature messenger RNA. "}, {"url": "http://link.springer.com/referenceworkentry/10.1007%2F978-3-642-16483-5_6698", "passage_text": "Download PDF (4,675 KB). Refers to a point mutation in the genetic code of a gene that generates one of three known stop codons (also referred to as “nonsense codon”): 1  1. A stop codon signals the end of protein synthesis. As a result, the translation of the mRNA into protein is interrupted at this codon within the gene with the consequence of the synthesis of an incomplete (“truncated”) protein."}, {"url": "http://link.springer.com/referenceworkentry/10.1007%2F978-3-642-16483-5_6698", "passage_text": "Definition. Refers to a point mutation in the genetic code of a gene that generates one of three known stop codons (also referred to as “nonsense codon”): 1  1. A stop codon signals the end of protein synthesis. As a result, the translation of the mRNA into protein is interrupted at this codon within the gene with the consequence of the synthesis of an incomplete (“truncated”) protein."}, {"url": "http://www.medicinenet.com/script/main/art.asp?articlekey=4580", "passage_text": "Nonsense mutation: A mutation (a change) in a base in the DNA that prematurely stops the translation (reading) of messenger RNA (mRNA) resulting in a polypeptide chain that ends prematurely and a protein product that is truncated (abbreviated) and incomplete and usually nonfunctional. One of them comes normally at the end of each polypeptide. A nonsense codon is a stop codon which is out of place. Catching such a defective messenger RNA (mRNA) before a truncated and potentially harmful protein is synthesized is the job of what is called the nonsense-mediated mRNA decay (NMD) pathway."}, {"url": "http://link.springer.com/referenceworkentry/10.1007%2F978-3-642-16483-5_6698", "passage_text": "UGA (in RNA)/TGA (in DNA), “opal”, or “amber”. A stop codon signals the end of protein synthesis. As a result, the translation of the mRNA into protein is interrupted at this codon within the gene with the consequence of the synthesis of an incomplete (“truncated”) protein."}, {"url": "http://www.ncbi.nlm.nih.gov/pubmed/24105469", "passage_text": "Heart disease is not considered part of the typical CM spectrum. No congenital heart defect has been reported, and childhood-onset cardiomyopathy has been documented in only two CM families with homozygous mutations of the TTN gene. TTN encodes titin, a giant protein of striated muscles."}, {"url": "https://en.wikipedia.org/wiki/Mutation", "passage_text": "In biology, a mutation is a permanent change of the nucleotide sequence of the genome of an organism, virus, or extrachromosomal DNA or other genetic elements. Mutations result from damage to DNA which is not repaired, errors in the process of replication, or from the insertion or deletion of segments of DNA by mobile genetic elements. Mutations may or may not produce discernible changes in the observable characteristics (phenotype) of an organism."}, {"url": "https://en.wikipedia.org/wiki/Mutation", "passage_text": "1 A heterozygous mutation is a mutation of only one allele. 2  A homozygous mutation is an identical mutation of both the paternal and maternal alleles. 3  Compound heterozygous mutations or a genetic compound comprises two different mutations in the paternal and maternal alleles. Mutations result from damage to DNA which is not repaired, errors in the process of replication, or from the insertion or deletion of segments of DNA by mobile genetic elements. Mutations may or may not produce discernible changes in the observable characteristics (phenotype) of an organism."}, {"url": "https://en.wikipedia.org/wiki/Mutation", "passage_text": "Mutation can result in several different types of change in sequences. Mutations in genes can either have no effect, alter the product of a gene, or prevent the gene from functioning properly or completely. Mutations result from damage to DNA which is not repaired, errors in the process of replication, or from the insertion or deletion of segments of DNA by mobile genetic elements. Mutations may or may not produce discernible changes in the observable characteristics (phenotype) of an organism."}, {"url": "https://en.wikipedia.org/wiki/Mutation", "passage_text": "Cells with heterozygous mutations (one good copy of gene and one mutated copy) may function normally with the unmutated copy until the good copy has been spontaneously somatically mutated. This kind of mutation happens all the time in living organisms, but it is difficult to measure the rate. Mutations result from damage to DNA which is not repaired, errors in the process of replication, or from the insertion or deletion of segments of DNA by mobile genetic elements. Mutations may or may not produce discernible changes in the observable characteristics (phenotype) of an organism."}]