[{"url": "http://www.answers.com/Q/What_is_the_best_age_to_breed_dogs", "passage_text": "The best age to breed a dog is at the age of 3-4years old."}, {"url": "http://askabreeder.com/Male_Female_Dog_Breeding_Age", "passage_text": "(Male and Female). A female dog, (bitch) can begin puberty around 6 months of age. If she has not had her first heat, or cycle, by 12 months of age, talk to your vet. The bitch will typically come into heat twice a year after her first heat. Keep track on your calendar so you can plan your trips around her cycle."}, {"url": "http://askabreeder.com/Male_Female_Dog_Breeding_Age", "passage_text": "A male dog, (stud) can go through puberty between 5 and 12 months of age. If your dog has not reached sexual maturity by 12 months, talk to your vet. The age varies by breed with smaller dogs maturing earlier than larger breeds. A male can be sexually viable as early as 5 months."}, {"url": "http://www.sarahsdogs.com/qa/at-what-age-can-a-male-dog-breed/", "passage_text": "Right age for allowing breeding. Males like the female dogs attain puberty at different ages. Different breeds reach maturity at different times with the smaller breeds attaining it at a much younger age. The average age for reaching puberty is around 6-12 months of age, depending on the type of breed."}, {"url": "http://www.answers.com/Q/What_is_the_breeding_age_limit_for_male_dogs", "passage_text": "They will not die, of course if they are to become 'active', but a responsible breeder will not breed their dogs until the age of 2. The maximum age varies, depending on the breed and condition of the animal, not to exceed 10 years- 8 years of age being the standard."}, {"url": "http://www.answers.com/Q/What_is_the_best_age_to_breed_dogs", "passage_text": "Confidence votes 28. The best age to breed a dog is at the age of 3-4years old. If your were to breed them at a young age they are possible to die because they are still devoliping and if your were to do it at on older age 6 and older they can have a chance of dying their self!"}]