[{"url": "http://www.mainlesson.com/display.php?author=bachman&book=inventors&story=mccormick", "passage_text": "When Robert McCormick, the father of Cyrus, drew his crude reaper out to a field of wheat in the early harvest of 1831, to make a trial of the invention on which he had spent fifteen years, Cyrus, you may be sure, was more than an onlooker. He had doubtless had a considerable [149] part in the making of this machine. "}, {"url": "http://www.ideafinder.com/history/inventions/reaper.htm", "passage_text": "The reaper was a horse drawn farm implement invented by Cyrus Hall McCormick in 1831 to cut small grain crops. The mechanical reaper replaced the manual cutting of the crop with scythes and sickles. Developed to cut down wheat more quickly and more efficiently. "}, {"url": "http://www.farmcollector.com/Farm-life/The-Reaper-Revolution.aspx", "passage_text": "Few people changed American agriculture more than Cyrus McCormick. His invention, the McCormick 'Virginia' reaper, revolutionized farming by combining many steps involved in harvesting crops into one machine. McCormick's reaper could cut more wheat in a day than a half-dozen farmhands. Cyrus McCormick's farm. Visit Cyrus McCormick's Virginia farm in Steeles Tavern, Va., which is a National Historic Landmark. A grist mill and a blacksmith shop-as well as a life-sized replica of the original reaper and other farm equipment-are on display."}, {"url": "http://study.com/academy/lesson/mechanical-reaper-invention-impact-facts.html", "passage_text": "One such invention was the mechanical reaper. The mechanical reaper was invented by Cyrus McCormick in 1831. This machine was used by farmers to harvest crops mechanically. For hundreds of years, farmers and field workers had to harvest crops by hand using a sickle or other methods, which was an arduous task at best. "}, {"url": "http://inventors.about.com/od/famousinventions/fl/Cyrus-McCormick-Inventor-of-the-Mechanical-Reaper.htm", "passage_text": "Cyrus McCormick, engraving by George Smillie. Library of Congress. Cyrus McCormick (1809-1884) was a Chicago industrialist who in 1831 invented the first commercially successful mechanical reaper, a horse-drawn machine to harvest wheat. Meanwhile, Cyrus McCormick had moved to Chicago, built a factory in 1847, begun the mass manufacture of his reaper, and founded what eventually became the International Harvester Company. In 1872 he produced a reaper which automatically bound the bundles with wire."}, {"url": "https://en.wikipedia.org/wiki/Cyrus_McCormick", "passage_text": "Although McCormick is credited as the inventor of the mechanical reaper, he based his work on that of many others, including Roman, Scottish and American men, more than two decades of work by his father, and the aid of Jo Anderson, a slave held by his family. Cyrus McCormick filed patents for the invention, and his achievements were chiefly in the development of a company, marketing and sales force to market his products."}, {"url": "http://www.american-inventor.com/cyrus-mccormick.aspx", "passage_text": "Not long after Eli Whitney invented the Cotton Gin, Cyrus McCormick invented another significant agricultural invention that revolutionized farming: the mechanical reaper. Prior to this invention, reaping was a painstaking process (done by hand with a scythe) that limited a farm's harvest. In 1831, twenty-two-year-old Cyrus took over his father's project and, within six weeks, he had built, field-tested, remodeled and successfully demonstrated the world's first mechanical reaper. McCormick's invention automatically cut, threshed and bundled grain while being pulled through a field by horses."}, {"url": "http://lemelson.mit.edu/resources/cyrus-mccormick", "passage_text": "Cyrus Hall McCormick was born in 1809. He grew up on his family's 532-acre farm, Walnut Grove, north of Lexington, Virginia. As a boy, McCormick had a talent for both agriculture and inventing. At the age of 15, he invented a lightweight cradle for carting harvested grain (1824). Meanwhile, McCormick's father, Robert, was working from time to time in the farm's smithy on an invention of his own, a horse-drawn reaping machine."}, {"url": "https://en.wikipedia.org/wiki/Cyrus_McCormick", "passage_text": "Cyrus McCormick was born February 15, 1809 in the Shenandoah Valley of Virginia. He was the eldest of eight children born to inventor Robert McCormick, Jr. (1780–1846) and Mary Ann Polly Hall (1780–1853). As Cyrus' father saw the potential of the design for a mechanical reaper, he applied for a patent to claim it as his own invention. Cyrus McCormick filed patents for the invention, and his achievements were chiefly in the development of a company, marketing and sales force to market his products."}, {"url": "http://www.lib.niu.edu/1992/ihy921205.html", "passage_text": "Making Illinois the Hub of Agriculture. The McCormick reaper was a boon to wheat farmers; the first model could do the work of three men. As Cyrus McCormick perfected and improved the capabilities of the new implement, more land was put into production. What made the reaper a success was the demonstrations and its good quality. Because McCormick was concerned with quality, he was an innovator. Even today, more than 160 years later, farming machinery for cutting wheat is similar to what he invented back in the 1830s."}]