[{"url": "http://www.definitions.net/definition/Comprehensive", "passage_text": "Rank popularity for the word 'Comprehensive' in Spoken Corpus Frequency: #2836. "}, {"url": "http://www.audioenglish.org/dictionary/comprehensive.htm", "passage_text": "• COMPREHENSIVE (noun). The noun COMPREHENSIVE has 1 sense: 1. an intensive examination testing a student's proficiency in some special field of knowledge. Familiarity information: COMPREHENSIVE used as a noun is very rare. • COMPREHENSIVE (adjective). The adjective COMPREHENSIVE has 2 senses: 1. including all or everything. 2. broad in scope. Familiarity information: COMPREHENSIVE used as an adjective is rare. "}, {"url": "http://www.carinsurance.com/coverage-definition/comprehensive-insurance.aspx", "passage_text": "Comprehensive insurance (COMP, Other Than Collision, OTC) covers your insured vehicle for physical damage losses resulting from incidents other than collision. This normally includes coverage for: 1  Theft. 2  Vandalism. 3  Glass damage (such as a broken windshield). 4  Damage sustained from hitting an animal or bird. "}, {"url": "https://answers.yahoo.com/question/index?qid=20100118185931AADOpHD", "passage_text": "Best Answer: Comprehensive means there are few limitations and exclusions, no annual limits to doctor visits and lab work, generally lower out-of-pocket costs, and no annual maximums to the coverage. Nearly all employer based health insurance is comprehensive. "}, {"url": "http://www.thefreedictionary.com/comprehensive", "passage_text": "comprehensive. adj. 1. of broad scope or content; including all or much. 2. (Insurance) (of a car insurance policy) providing protection against most risks, including third-party liability, fire, theft, and damage. 3. having the ability to understand. 4. (Education) of, relating to, or being a comprehensive school. n. com·pre·hen·sive. adj. 1. So large in scope or content as to include much: a comprehensive history of the revolution. 2."}, {"url": "https://en.wikipedia.org/wiki/Comprehensive_examination", "passage_text": "In higher education, a comprehensive examination (or comprehensive exam or exams), often abbreviated as comps, is a specific type of examination that must be completed by graduate students in some disciplines and courses of study, and also by undergraduate students in some institutions and departments. "}, {"url": "https://www.esurance.com/info/car/myth-comprehensive-covers-everything", "passage_text": "Comprehensive insurance can help you pay for your car's repair, or even help you replace it entirely in the case of a total loss, due to any of the following: 1  Damage not resulting from a collision, including: 2  Falling objects. 3  Fire. 4  Certain natural disasters. 5  Vandalism. 6  Theft. 7  Glass damage. 8  Damage from hitting an animal. Just because it doesn't cover everything outside of collisions doesn't mean comprehensive insurance isn't valuable. In fact, it covers a wide array of events that can damage your car, including rockslides on twisting mountain roads, vandalism, and fires."}, {"url": "http://thelawdictionary.org/article/what-does-comprehensive-cover-on-auto-insurance-mean/", "passage_text": "Comprehensive Auto Insurance now covers all type of incidents that may cause damage to an insured vehicle which include, but are not limited to, theft, fire, vandalism, weather, falling objects and animal damage. Not all causes of damages are covered by a Comprehensive Auto Insurance. There are also certain exclusions that would apply which include damage to the normal wear and tear, vehicle defects and other collision damages which are not included in the comprehensive coverage definition. Comprehensive Auto Insurance is not compulsory. Comprehensive Auto Insurance is an innovation introduced by insurers to their product due to the demand of expansion of the coverage of auto insurance which, before the change, was only limited to vehicle collision."}, {"url": "https://www.allstate.com/tools-and-resources/car-insurance/what-is-comprehensive-auto-insurance.aspx", "passage_text": "Comprehensive Coverage: A Definition. When people hear the word comprehensive, they might think all-encompassing— but in car insurance terms, the word has a different meaning. Simply put, comprehensive coverage protects you against damages to your car that are the result of covered perils not related to a collision. Think of a scenario that could cause damage to your car that has nothing to do with striking another vehicle. In many cases, this can include: 1  Theft"}]