[{"url": "http://www.psychologyandsociety.com/creativitydefinition.html", "passage_text": "Below is one possible definition of creativity: Creativity Definition: Creativity is the development of ideas and products that are both original and valuable. It is essential for something to be both original and valuable to be creative. It is possible that something could be very original but not valuable. Creativity Creativity is a very important concept. It is relevant to creating art, music, and fiction. It is important in the workplace. One important question concerns how to define creativity"}, {"url": "http://www.allpsychologycareers.com/topics/psychology-of-creativity.html", "passage_text": "In addition to understanding big-C creative contributions, researchers also refer to an academic definition of creativity when studying consequential and life changing acts of creativity. Simonton explains this definition as having two connected parts: originality and functionality. His research along with his admonition for others to begin studying the psychology of creativity led to an explosion of studies and numerous theories on creativity. The plethora of creativity theories developed over the past thirty years necessitated that scientists group the current theories into 10 categories."}, {"url": "http://apa.org/monitor/nov03/creativity.aspx", "passage_text": "November 2003, Vol 34, No. 10. Print version: page 40. Not all creative people are alike, which makes defining creativity a challenge and assessing it a monumental undertaking. The traditional psychological definition of creativity includes two parts: originality and functionality. You can't be creative unless you come up with something that hasn't been done before, says psychologist Dean Keith Simonton, PhD, of the University of California, Davis"}, {"url": "http://encyclopedia2.thefreedictionary.com/creativity", "passage_text": "Creativity. activity that engenders something qualitatively new, something that has never existed before. Any field of endeavor in which something new is created, discovered, or invented may be a source of creative activity: science, industrial engineering, the arts, politics, and other fields. Creativity has both psychological and philosophical aspects."}, {"url": "http://www.merriam-webster.com/dictionary/creativity", "passage_text": "Full Definition of CREATIVITY. 1. : the quality of being creative. 2. : the ability to create. See creativity defined for English-language learners. ADVERTISEMENT. "}, {"url": "http://psychology.wikia.com/wiki/Creativity", "passage_text": "Main article: Creativity in clinical practice. Main article: The physiological basis of creativity. Creativity is a mental and social process involving the generation of new ideas or concepts, or new associations of the creative mind between existing ideas or concepts. An alternative conception of creativness is that it is simply the act of making something new. "}, {"url": "https://en.wikipedia.org/wiki/Creativity", "passage_text": "Honing theory posits that creativity arises due to the self-organizing, self-mending nature of a worldview, and that it is by way of the creative process the individual hones (and re-hones) an integrated worldview. This investment theory of creativity views creativity in a unique perspective compared to others, by asserting that creativity might rely to some extent on the right investment of effort being added to a field at the right time in the right way."}, {"url": "https://en.wikipedia.org/wiki/Creativity", "passage_text": "Theories of creativity that include intelligence as a subset of creativity. 1  Sternberg & Lubart’s Investment Theory. 2  Using the metaphor of a stock market, they demonstrate that creative thinkers are like good investors – they buy low and sell high (in their ideas). This investment theory of creativity views creativity in a unique perspective compared to others, by asserting that creativity might rely to some extent on the right investment of effort being added to a field at the right time in the right way."}, {"url": "http://apa.org/monitor/nov03/creativity.aspx", "passage_text": "Another important factor in creativity is intelligence, but contrary to beliefs at the turn of the 20th century, it is not the only factor, says Simonton. In the 1920s, psychologist Louis Terman, PhD, began looking at the relationship between intelligence and creativity. Not all creative people are alike, which makes defining creativity a challenge and assessing it a monumental undertaking."}]