[{"url": "http://www.healthyhorns.utexas.edu/smokeless_tobacco.html", "passage_text": "http://www.healthyhorns.utexas.edu/. I nstead of smoking tobacco, smokeless tobacco products consist of tobacco or a tobacco blend that is most often chewed, sucked on, or sniffed. There are many different types of smokeless tobacco. The main types are: Smokeless tobacco is NOT safe or an effective alternative for people who want to quit smoking."}, {"url": "http://studenthealth.oregonstate.edu/health-promotion/tobacco-cessation/types-tobacco", "passage_text": "Several different forms of tobacco are widely used in the United States. Cigarettes, smokeless tobacco, and cigars are the most common types of tobacco. Hookah, a less common form of tobacco, has recently become increasingly popular."}, {"url": "http://www.ct.gov/dph/lib/dph/hems/tobacco/tobacco_products.pdf", "passage_text": "Smokeless Tobacco The two main types of smokeless tobacco in the United States are chewing tobacco and snuff. Chewing tobacco comes in the form of loose leaf, plug, or twist. Snuff is finely ground tobacco that can be dry, moist, or in sachets (tea bag-like pouches)."}, {"url": "http://www.medicalnewstoday.com/articles/240820.php", "passage_text": "Nicotine is a nitrogen-containing chemical-an alkaloid, which is made by several types of plants, including the tobacco plant. Nicotine is also produced synthetically. Nicotiana tabacum, the type of nicotine found in tobacco plants, comes from the nightshade family."}, {"url": "http://www.wisegeek.com/what-are-the-different-kinds-of-nicotine-products.htm", "passage_text": "There are many different nicotine products, including anything with tobacco— cigarettes, chewing tobacco, cigars, etc.,—to special products intended to help wean people off smoking, such as gums and patches."}, {"url": "http://www.healthyhorns.utexas.edu/smokeless_tobacco.html", "passage_text": "I nstead of smoking tobacco, smokeless tobacco products consist of tobacco or a tobacco blend that is most often chewed, sucked on, or sniffed. There are many different types of smokeless tobacco. The main types are: Smokeless tobacco is NOT safe or an effective alternative for people who want to quit smoking."}, {"url": "http://www.answers.com/Q/How_many_types_of_smoking_are_there", "passage_text": "Lip, tongue, other parts of the mouth, throat, esophagus, stomach and lung are the most common. Smoking can cause, mouth, lung, eye, heart, and all sorts of different types … of cancer. Lung cancer is the biggest risk. You can also get mouth, eye, heart, and a hole in your throat. 1: Lung cancer. 2: Throat cancer."}]