[{"url": "http://weddings.costhelper.com/dress-alterations.html", "passage_text": "1 The three alterations most likely to be done are hemming, bodice alterations and shortening of sleeves. 2  A bodice alteration can cost $30 for a simple dress to $100 or more for a dress with boning or beading that needs to be removed, then reinserted or reapplied."}, {"url": "http://www.weddingstats.org/average-cost-of-a-wedding-dress-alteration.html", "passage_text": "- Bridal shops offering alteration services are the best option since they have the expertise and the experience. $219. In 2015, the average cost of a wedding dress alteration is between $184 - $255. 1  The complexity of the dress details and degree of difficulty will ultimately determine the cost of your alteration. 2  As a rule of thumb, all alterations should be completed at least six to eight weeks before the wedding."}, {"url": "http://www.realsimple.com/beauty-fashion/clothing/prices-common-clothing-alterations", "passage_text": "The cost of alterations can vary greatly, though, depending on the difficulty of the service and the shop providing it. 1  Shorten sleeves on a dress shirt: $19. 2  Shorten sleeves on a jacket: $23 (without buttons) to $28 (with buttons). 3  Take in the body of a jacket: $40 (two seams) to $52 (three seams)."}, {"url": "http://weddings.costhelper.com/dress-alterations.html", "passage_text": "1 Sleeve alterations usually run between $40 and $80, depending on how much decoration or beading is on the sleeves. 2  Leanna Studios offers a primer on alterations costs. 3  Bridal salons, especially in large cities, tend to charge more than independent seamstresses."}, {"url": "http://weddings.costhelper.com/dress-alterations.html", "passage_text": "1 A bodice alteration can cost $30 for a simple dress to $100 or more for a dress with boning or beading that needs to be removed, then reinserted or reapplied. 2  A hem might run $80 for a simple dress to $200 or more for a multi-layered dress."}, {"url": "http://weddings.costhelper.com/dress-alterations.html", "passage_text": "Alterations Made: taking in. I am just wondering how much someone on average would charge to alter a dress from a size 10 to a size 6. I bought my dress at david's bridal for $275 and its a tiny bit loose around my chest (fits everywhere else perfect), but I also intend to loose about 15-25 lbs before the big day."}]