[{"url": "http://www.answers.com/Q/What_was_the_purpose_of_the_Gettysburg_Address", "passage_text": "Gettysburg is a borough in Adams County of Pennsylvania in the United States. It was the site for the 1863 Battle of Gettysburg, and where one of the most famous speeches in … US history, the Gettysburg Address, was delivered by President Abraham Lincoln. 1 Lincoln's aim in his Gettysburg Address was to extol liberty and honor the people fighting for our nation who died in hope that there would still be a nation in the end. 2  The Battle of Gettysburg and the Gettysburg Address occurred four months apart."}, {"url": "http://www.answers.com/Q/What_is_the_Gettysburg_Address", "passage_text": "Gettysburg is a borough in Adams County of Pennsylvania in the United States. It was the site for the 1863 Battle of Gettysburg, and where one of the most famous speeches in … US history, the Gettysburg Address, was delivered by President Abraham Lincoln. 1 person found this useful"}, {"url": "http://www.gettysburg.com/bog/address.htm", "passage_text": "The Gettysburg Address. The Gettysburg National Cemetery was dedicated by President Abraham Lincoln a brief four months after the Battle. Lincoln's speech lasted only two minutes, but it went into history as the immortal"}, {"url": "http://www.answers.com/Q/What_is_the_Gettysburg_Address", "passage_text": "The Gettysburg Address is the most famous speech of U.S. President Abraham Lincoln and one of the most quoted famous speeches in United States history. It was the site for the 1863 Battle of Gettysburg, and where one of the most famous speeches in … US history, the Gettysburg Address, was delivered by President Abraham Lincoln."}, {"url": "http://www.historynet.com/the-gettysburg-address", "passage_text": "Lincoln Delivering Gettysburg Address. The Gettysburg Address is a speech delivered by Abraham Lincoln at the November 19, 1863, dedication of Soldier’s National Cemetery, a cemetery for Union soldiers killed at the Battle Of Gettysburg during the American Civil War. The Gettysburg Address is now recognized as one of Lincoln’s greatest speeches and as one of the most famous speeches in U.S. history. Read the full transcript of the Gettysburg Address Text to appreciate Lincoln’s eloquence, brevity, and the significance of the Battle Of Gettysburg."}, {"url": "http://www.answers.com/Q/What_was_the_purpose_of_the_Gettysburg_Address", "passage_text": "It was delivered at the … dedication of the Soldiers' National Cemetery in Gettysburg, Pennsylvania, on November 19, 1863, during the American Civil War, four and a half months after the Battle of Gettysburg. 1 Lincoln's aim in his Gettysburg Address was to extol liberty and honor the people fighting for our nation who died in hope that there would still be a nation in the end. 2  The Battle of Gettysburg and the Gettysburg Address occurred four months apart."}, {"url": "https://simple.wikipedia.org/wiki/Gettysburg_Address", "passage_text": "The Gettysburg Address is a speech by U.S. President Abraham Lincoln. It was delivered on the afternoon of Thursday, November 19, 1863. "}, {"url": "http://www.history.com/this-day-in-history/lincolns-gettysburg-address", "passage_text": "Lead Story. Lincoln delivers Gettysburg Address. On November 19, 1863, at the dedication of a military cemetery at Gettysburg, Pennsylvania, during the American Civil War, President Abraham Lincoln delivers one of the most memorable speeches in American history. "}, {"url": "http://www.allabouthistory.org/gettysburg-address.htm", "passage_text": "Gettysburg Address The History. The Gettysburg Address was delivered by Abraham Lincoln on November 19, 1863 to dedicate the Soldiers National Cemetery in Gettysburg, Pennsylvania. The Battle of Gettysburg was a decisive battle at the turn of the American Civil War, fought between July 1 and July 3, 1863. Gettysburg Address The Purpose. "}]