[{"url": "https://www.caring.com/questions/long-term-care-insurance-age-limits", "passage_text": "86% helpful. Steve Weisman answered... Generally, insurance companies do not sell long-term care insurance policies to people over the age of 84. Even if you were able to find a company that would sell you long-term care insurance at that age, the premium would probably be prohibitive."}, {"url": "http://www.onlinemortgageadvisor.co.uk/life-insurance/life-insurance-age-limit/", "passage_text": "The number of years you are looking to take the cover over can impact which providers will consider an application. Some limit the term to 30 years, some to 40, and others don’t have a limit. If you are looking for cover longer than 40 years then you’ll usually need to consider more specialist providers. The type of cover applied for has an impact on age limit and eligibility, where critical illness protection is often restricted to applicants under 65, life only cover restricted to 75/80, and some whole of life protection policies that don’t have any limit on age or restrictions on health."}, {"url": "http://mozdex.com/life-insurance-over-60.php", "passage_text": "Senior citizens, most likely, will not have the option of purchasing term life insurance. Most companies have an age limit for these products, and people over 60 are just about to reach that limit for these types of products. For example, most companies will only sell a 10 year term life insurance policy to someone 65 and under. "}, {"url": "http://www.moneycontrol.com/news/life-insurance/all-you-want-to-know-about-term-insurance-policy_992742.html", "passage_text": "The eligibility criterion for term insurance plan varies according to the insurers, the minimum age of entry is 18 years and the maximum age limit is 65 years. "}, {"url": "http://www.dfs.ny.gov/consumer/que_top10/que_life_cre.htm", "passage_text": "Some credit insurance policies will not cover the full term and amount of your loan. Under New York State Law, the maximum allowable amount of coverage for credit life insurance is generally $220,000 for a mortgage loan and $55,000 for all other debts. "}, {"url": "http://longtermcare.wi.gov/sublink.asp?linksubcat2id=1995&linksubcatid=2699", "passage_text": "Long-term care insurance policies have either a defined benefit period or a lifetime benefit maximum, which is the total amount of time or total amount of dollars up to which benefits will be paid. Common benefit periods for long-term care policies are two, three, four, and five years. "}, {"url": "http://www.ehow.com/info_8220212_age-limits-term-insurance.html", "passage_text": "States limit the number of times you may renew your policy. Your state's age limit may be different from that of other states. It is common for states to cap the maximum age for term life at 80 or 85, but again, this depends on your state. After this maximum age, you cannot buy term life any longer. Term life insurance is a policy which provides death benefit coverage for a set number of years. The policy accepts premium payments in exchange for a death benefit. This death benefit is guaranteed for the life of the policy. When the policy expires, you may renew it up to a certain age limit."}, {"url": "https://www.allstate.com/auto-insurance/car-insurance-limits-deductibles.aspx", "passage_text": "Simply put, a limit is the highest amount Allstate will pay you for a claim that your insurance policy covers. For example, if your limit is $100,000 and the cost of your accident is $105,000, you'll have to pay the remaining $5,000. You'll often see coverage limits that look like this: $50,000/$100,000. "}]