[{"url": "http://www.dougaldrich.net/en/da/bands/bmr.html", "passage_text": "Kal Swan and Doug Aldrich formed BAD MOON RISING in the fall of 1990. The original rhythm section included ex-FIFTH ANGEL drummer Ken Mary and bassist Chuck Wright of HOUSE OF LORDS fame. The band's debut album was released in 1991, and included 4 songs demoed and recorded during the LION years. A second album, Blood, was released about 2 years later. Bassist Sean McNabb performed in Japan after the debut album, but later left to join HOUSE OF LORDS. Although the bass parts were done with Chuck Wright, he left the band after recording was completed."}, {"url": "https://en.wikipedia.org/wiki/Bad_Moon_Rising_(album)", "passage_text": "This article is about the Sonic Youth album. For other uses, see Bad Moon Rising. Bad Moon Rising is the second studio album by American alternative rock / noise rock band Sonic Youth. It was released on vinyl in March 1985 by record label Homestead. The album was loosely themed around the dark side of America, and included references to obsession and insanity, Charles Manson, heavy metal, Satanism, and early European settlers' encounters with Native Americans. The album was preceded by the single Death Valley '69, which did not chart in either the US or UK (the track was re-recorded for the album and released again as a single in June 1985)."}, {"url": "https://en.wikipedia.org/wiki/Bad_Moon_Rising_(song)", "passage_text": "It was the lead single from their album Green River and was released in April 1969, four months before the album. The song reached No. 2 on the Billboard Hot 100 singles chart and No. 1 on the UK Singles Chart for three weeks in September 1969 (see 1969 in music). The song has been recorded by at least 20 different artists, in styles ranging from folk to reggae to psychedelic rock. In 2011, Rolling Stone ranked it #364 on its  500 Greatest Songs of All Time  list."}, {"url": "https://en.wikipedia.org/wiki/Bad_Moon_Rising_(song)", "passage_text": "Bad Moon Rising  is a song written by John Fogerty and performed by Creedence Clearwater Revival. The song has been recorded by at least 20 different artists, in styles ranging from folk to reggae to psychedelic rock. In 2011, Rolling Stone ranked it #364 on its  500 Greatest Songs of All Time  list."}, {"url": "http://www.last.fm/music/Creedence+Clearwater+Revival/_/Bad+Moon+Rising", "passage_text": "read more. Bad Moon Rising was released in 1969 by Creedence Clearwater Revival. The track was written by John Fogerty and was the lead single from their album Green River .The track reached #2 on the Billboard hot 100 singles chart and #1 on the UK singles chart for three weeks in September 1969. The live version can be heard here Bad Moon Rising (Live 1970). Play on youtube"}, {"url": "http://cathyschords.com/UKULELE/Uke%20songs%20L%2011-13/Uke_L.13.%20Bad%20Moon%20Rising_D,G,A%20_ccTy.pdf", "passage_text": "Bad Moon Rising for Ukulele Key: D Level 13 (A chord) Recorded by Creedence Clearwater Revival in key of D Intro: D,,, A, G, D,,, / (D) A G D / 1. "}, {"url": "https://en.wikipedia.org/wiki/Bad_Moon_Rising_(song)", "passage_text": "Fogerty reportedly wrote Bad Moon Rising after watching The Devil and Daniel Webster. Inspired by a scene in the film involving a hurricane, Fogerty claims the song is about the apocalypse that was going to be visited upon us.. The song has been recorded by at least 20 different artists, in styles ranging from folk to reggae to psychedelic rock. In 2011, Rolling Stone ranked it #364 on its  500 Greatest Songs of All Time  list."}, {"url": "http://sonicyouth.com/mustang/lp/lp3.html", "passage_text": "Between September and December 1984, they recorded Bad Moon Rising at Before Christ studios on 24-track, w/ Martin Bisi engineering. The album came out on vinyl and cassette in March 1985 on Homestead in the United States and Blast First in the UK, beginning SY's long relationship with Blast First. One spine reads SONIC-YOUTH 1985, the other reads SONIC YOUTH: BAD MOON RISING, SATAN, FLOWER, HALLOWE'EN. The back of the CD has a purple-splotched photo of the band all wearing sunglasses next to the track list (again, Death Valley is noted as (w."}]