[{"url": "http://www.viralnova.com/real-animal-hybrids/", "passage_text": "Hybrid animals may sound like science fiction, but they're not. Hybrids are typically the topic of my own secret dreams. Said dreams usually revolve around owning a gorilladillo (a cross between a gorilla and an armadillo). Apparently, I might be closer to achieving that goal than I thought. You wouldn't think that the animals below are real, but there are many living examples of such creatures. Unfortunately, most (not all) hybrids end up being sterile so they cannot be bred even further. That doesn't mean we can't clone an army of Ligers, though!"}, {"url": "http://www.bromygod.com/2014/08/07/12-hybrid-animals-actually-exist/", "passage_text": "0 Comments. No this isn’t out of a ScFi movie this is actually what science has brought us. Some how they have gotten cross bred animals to survive, these are some pretty strange hybrid animals. "}, {"url": "https://en.wikipedia.org/wiki/Human%E2%80%93animal_hybrid", "passage_text": "Defined by the magazine H+ as genetic alterations that are blendings [sic] of animal and human forms, such hybrids may be referred by other names occasionally such as para-humans. They may additionally may be called humanized animals. In various mythologies throughout history, many particularly famous hybrids have existed, including as a part of Egyptian and Indian spirituality. According to artist and scholar Pietro Gaietto, representations of human-animal hybrids always have their origins in religion."}, {"url": "http://www.rantpets.com/2015/06/03/15-strangest-hybrid-animal-breeds-you-didnt-know-existed/", "passage_text": "This hybrid of two oceanic dolphin species is extremely rare. They've been reported to exist in the wild, but only one is known to exist for sure. Her name is Kekaimalu, and she's a resident of Hawaii's Sea Life Park. She's had viable offspring with other bottlenose dolphins, though only one has survived into adulthood. "}, {"url": "http://boredomtherapy.com/real-animal-hybrids/", "passage_text": "Individuals from different but genetically closely related species do occasionally mate and produce offsprings, and the result is a hybrid: a distinct creature that shares genetic traits of both parent species, and is many times stronger or larger than the originals. Some half-breeds are well known, like the mule which is a horse and donkey mix. But since hybrids are usually infertile, most are much more rare, like the ones you are about to see below. Some may look fake, but we assure you they’re in fact completely real. 1. Wolfdog – Wolf / Dog hybrid. 2. Liger – Lion / Tiger hybrid. Ligers are HUGE. 3. Zebroid – Zebra / Donkey hybrid. An adult zebroid"}, {"url": "http://www.curiosityaroused.com/nature/8-incredible-real-life-hybrid-animals/", "passage_text": "Believe it or not these are not the first lines of terrible jokes, but real scientific questions with real living answers. Hybrid animals are the offspring produced when two animals of closely related – but different – species breed. The young produced will usually not be fertile, and so hybrid species are not normally seen in the wild. In order for more of these hybrid animals to exist the original two species must be cross-bred again. "}, {"url": "https://en.wikipedia.org/wiki/Human%E2%80%93animal_hybrid", "passage_text": "The term human–animal hybrid or animal–human hybrid refers to an entity that incorporates elements from both humans and non-human animals. In various mythologies throughout history, many particularly famous hybrids have existed, including as a part of Egyptian and Indian spirituality. According to artist and scholar Pietro Gaietto, representations of human-animal hybrids always have their origins in religion."}, {"url": "https://en.wikipedia.org/wiki/Liger", "passage_text": "It is a huge and very powerful beast. The liger is a hybrid cross between a male lion (Panthera leo) and a female tiger (Panthera tigris). Thus, the liger has parents of the same genus but of different species. The liger is distinct from the similar hybrid tigon. While the Siberian tiger is the largest pure sub-species, ligers are believed to be the largest of all known extant felines. Ligers exist only in captivity or zoos because the habitats of the parental species do not overlap in the wild. Other big cat hybrids can reach similar sizes; the litigon, a rare hybrid of a male lion and a female tigon, is roughly the same size as the liger, with a male named Cubanacan (at the Alipore Zoo in India) reaching 363 kg (800 lb)."}]