[{"url": "http://www.wikihow.com/Roast-a-Chicken", "passage_text": "7. Rub a little salt and pepper onto all sides of the chicken, place it in the roasting pan breast-side down (the picture above shows the bird breast-side up), and place it in on the rack in the top third of your oven."}, {"url": "http://www.foodnetwork.com/recipes/tyler-florence/the-ultimate-roast-chicken-recipe.html", "passage_text": "Place the chicken, breast-side up, in a roasting pan. Put the remaining onion into the pan, which will help color and flavor the sauce. Lay the strips of bacon across the breast of the chicken and roast for 25 minutes."}, {"url": "http://www.answers.com/Q/Do_you_roast_a_chicken_breast_side_down_or_up", "passage_text": "Most cooking instructions say to roast a chicken breast side up. But, if you cook it breast side down for 30 min longer, the breast meat is much more juicy and tender."}, {"url": "http://whatscookingamerica.net/Poultry/GuidelinesRoastingChicken.htm", "passage_text": "Placing Chicken in Roasting Pan-Place chicken breast-side up on a flat wire rack in a shallow roasting pan, 2 to 2 1/2 inches deep. Optional steps: Truss or Not to Truss-You do not need to bother with complicated trussing. Instead, secure the legs by tucking the ankle joints into the pocket of skin at the tail end."}, {"url": "http://whatscookingamerica.net/Poultry/GuidelinesRoastingChicken.htm", "passage_text": "In the prepared roasting pan, place the chicken breast side up on bottom of the pan. Spread the carrots and potatoes around the chicken. Chicken ready for the oven. Roasting the Chicken: Place in the oven and allow the chicken to brown slightly for 15 minutes."}, {"url": "http://www.finecooking.com/recipes/best-ever-roast-chicken.aspx", "passage_text": "Roast the chicken breast side down for 30 minutes. Turn it over by inserting sturdy tongs into the cavity and flipping it. Continue roasting until an instant-read thermometer inserted into the thigh reads 165° to 170°F, an additional 30 to 35 minutes."}, {"url": "http://www.finecooking.com/recipes/best-ever-roast-chicken.aspx", "passage_text": "Roast the chicken: Position a rack in the center of the oven and heat the oven to 450°F. Put the chicken breast side up on a roasting rack in a medium (9x13-inch or similar) flameproof baking dish or roasting pan. Tuck the wing tips behind the neck and loosely tie the legs together with a piece of kitchen twine. Season the breast all over with 1/2 tsp. each salt and pepper."}]