[{"url": "http://www.infoplease.com/encyclopedia/science/aerodynamics-the-basic-forces-thrust-drag-lift.html", "passage_text": "More on aerodynamics The Basic Forces of Thrust Drag and Lift from Infoplease: 1  aerodynamics: The Basic Forces of Thrust, Drag, and Lift-The Basic Forces of Thrust, Drag, and Lift There are three basic forces to be considered in ... There are three basic forces to be considered in aerodynamics: thrust, which moves an airplane forward; drag, which holds it back; and lift, which keeps it airborne."}, {"url": "http://www.infoplease.com/encyclopedia/science/aerodynamics-the-basic-forces-thrust-drag-lift.html", "passage_text": "More on aerodynamics The Basic Forces of Thrust Drag and Lift from Infoplease: 1  aerodynamics: The Basic Forces of Thrust, Drag, and Lift-The Basic Forces of Thrust, Drag, and Lift There are three basic forces to be considered in 2  ... Calculator. 3  Spelling Checker. There are three basic forces to be considered in aerodynamics: thrust, which moves an airplane forward; drag, which holds it back; and lift, which keeps it airborne."}, {"url": "https://en.wikipedia.org/wiki/Aerodynamic_force", "passage_text": "When an airfoil (or a wing) is moving relative to the air it generates an aerodynamic force, in a rearward direction at an angle with the direction of relative motion. This aerodynamic force is commonly resolved into two components : Forces on an aerofoil. Aerodynamic force is exerted on a body by the air (or some other gas) in which the body is immersed, and is due to the relative motion between the body and the gas. Aerodynamic force arises from two causes: 1  the normal force due to the pressure on the surface of the body."}, {"url": "http://howthingsfly.si.edu/forces-flight/four-forces", "passage_text": "1 Lift is the force that acts at a right angle to the direction of motion through the air. 2  Lift is created by differences in air pressure. 3  Thrust is the force that propels a flying machine in the direction of motion. 4  Engines produce thrust. 1 Lift is created by differences in air pressure. 2  Thrust is the force that propels a flying machine in the direction of motion. 3  Engines produce thrust. 4  Drag is the force that acts opposite to"}, {"url": "http://www.infoplease.com/encyclopedia/science/aerodynamics-the-basic-forces-thrust-drag-lift.html", "passage_text": "| Share | Cite. There are three basic forces to be considered in aerodynamics: thrust, which moves an airplane forward; drag, which holds it back; and lift, which keeps it airborne."}, {"url": "http://howthingsfly.si.edu/aerodynamics", "passage_text": "Aerodynamics. Aerodynamics is the study of forces and the resulting motion of objects through the air. Studying the motion of air around an object allows us to measure the forces of lift, which allows an aircraft to overcome gravity, and drag, which is the resistance an aircraft “feels” as it moves through the air. Everything moving through the air (including airplanes, rockets, and birds) is affected by aerodynamics."}, {"url": "https://en.wikipedia.org/wiki/Aerodynamics", "passage_text": "In many aerodynamics problems, the forces of interest are the fundamental forces of flight: lift, drag, thrust, and weight. Of these, lift and drag are aerodynamic forces, i.e. forces due to air flow over a solid body. The term aerodynamics is often used synonymously with gas dynamics, with the difference being that gas dynamics applies to the study of the motion of all gases, not limited to air."}, {"url": "http://howthingsfly.si.edu/forces-flight/four-forces", "passage_text": "Four Forces Affect Things That Fly: 1  Weight is the force of gravity. 2  Lift is the force that acts at a right angle to the direction of motion through the air. 3  Thrust is the force that propels a flying machine in the direction of motion. 4  Drag is the force that acts opposite to the direction of motion. 1 Lift is created by differences in air pressure. 2  Thrust is the force that propels a flying machine in the direction of motion. 3  Engines produce thrust"}, {"url": "https://en.wikipedia.org/wiki/Aerodynamic_force", "passage_text": "When an airfoil (or a wing) is moving relative to the air it generates an aerodynamic force, in a rearward direction at an angle with the direction of relative motion. This aerodynamic force is commonly resolved into two components 1  : drag is the force component parallel to the direction of relative motion, Forces on an aerofoil. Aerodynamic force is exerted on a body by the air (or some other gas) in which the body is immersed, and is due to the relative motion between the body and the gas. Aerodynamic force arises from two causes: 1  the normal force due to the pressure on the surface of the body."}]