[{"url": "https://answers.yahoo.com/question/index?qid=20071216144721AA2aaWm", "passage_text": "Submit. · just now. Report Abuse. it depends on the breed. if you see your dog about to pee or crap in the house, take it outside, and after it goes, reward it. your dog will soon find out where the proper place to go is. a dog door would aslo help. it depends on the breed. if you see your dog about to pee or crap in the house, take it outside, and after it goes, reward it"}, {"url": "http://www.answers.com/Q/How_long_does_it_usually_take_to_potty_train_a_dog", "passage_text": "A rule of thumb is for every week old the dog is they should be able to hold it for 1 hour but don't make they try to hold it while training. When you feed or water them give, them about 5 to 15 minutes at first and take them outside. When you see that this is working you can increase the time span. Night time is the worst since you have to take them out a few times for the first few weeks. DO NOT USE THE CRATE FOR PUNISHMENT. If through out the night if your dog barks allot, try putting the dog in the crate a few minutes at a time through out the day. Using a reward to get them in helps."}, {"url": "http://www.perfectpaws.com/htrp.html", "passage_text": "However, the more time you spend with your puppy, the quicker he will be house trained. Your objective is to take your puppy to his toilet area every time he needs to eliminate. This should be about once every 30-45 minutes; just upon waking; just after eating or drinking; and just after a play session. Provide house training taxi service to avoid unnecessary mistakes. So, if they potty in the wrong place, you didn't take them to their potty area soon enough-plain and simple. However, with a poop you might get some warning-sometimes sniffing; usually circling by the puppy. By paying close attention to your puppy when they are out and about in the house, you may get a heads-up."}, {"url": "http://pets.webmd.com/dogs/guide/house-training-your-puppy", "passage_text": "If your puppy is older than 12 weeks when you bring him home and he’s been eliminating in a cage (and possibly eating his waste), house training may take longer. You will have to reshape the dog ’s behavior -- with encouragement and reward. It typically takes 4-6 months for a puppy to be fully house trained, but some puppies may take up to a year. Size can be a predictor. For instance, smaller breeds have smaller bladders and higher metabolisms and require more frequent trips outside. Your puppy's previous living conditions are another"}, {"url": "http://dogcare.dailypuppy.com/long-average-pottytrain-puppy-4172.html", "passage_text": "Supervision. Consistently supervising your puppy is essential to your success during the housebreaking process -- it's the only way you can prevent mistakes. Take your puppy to go potty at least every two hours, as well as each time you notice him circling, sniffing and getting restless. Also take him to go potty after he eats and drinks, after play time and after he wakes up. Develop a set schedule for all activities so both parties get used to the routine. Lax training will result in accidents that aren't really accidents. Chris Amaral/Photodisc/Getty Images. If you think your new puppy instantly knows not to soil the house when you bring him home, you're in for a big surprise."}, {"url": "http://www.humanesociety.org/animals/dogs/tips/housetraining_puppies.html", "passage_text": "1 Immediately take him to his bathroom spot, praise him, and give him a treat if he finishes eliminating there. 2  Don't punish your puppy for eliminating in the house. 3  If you find a soiled area, it's too late to administer a correction. 1 Make a startling noise (be careful not to scare him) or say OUTSIDE!. 2  Immediately take him to his bathroom spot, praise him, and give him a treat if he finishes eliminating there. 3  Don't punish your puppy for eliminating in the house. 4"}, {"url": "http://www.drsfostersmith.com/pic/article.cfm?articleid=1062", "passage_text": "This method may take longer before there are no accidents since your dog does not only associate the outdoors with going to the bathroom. I live in a high rise and can't get my puppy outside for potty training. The amount of time it takes to housetrain your puppy is primarily dependent upon you. Do it right and it shouldn't take long at all-perhaps just a few weeks. Dogs, like babies, are unique-some get it right away and others don't."}, {"url": "http://www.answers.com/Q/How_long_does_it_usually_take_to_potty_train_a_dog", "passage_text": "We use kennel or crate training (with out potty pads) for this and we usually accomplish this in 3 to5 weeks. Night time is the worst since you have to take them out a few times for the first few weeks. DO NOT USE THE CRATE FOR PUNISHMENT. If through out the night if your dog barks allot, try putting the dog in the crate a few minutes at a time through out the day. Using a reward to get them in helps."}]