[{"url": "http://www.dmv.ca.gov/portal/dmv/detail/boatsinfo/boatreg", "passage_text": "Generally, every sail-powered vessel over eight feet in length and every motor-driven vessel (regardless of length) that is not documented by the U.S. Coast Guard which is used or on the waters of this state are subject to registration by the Department of Motor Vehicles (DMV). The vessel must be located in California. The following vessels do not have to be registered in California: 1  Vessels propelled solely by oars or paddles. 2  Nonmotorized sailboats that are eight feet or less in length. 3  Nonmotorized surfboards propelled by a sail and with a mast that the operator must hold upright. 4  A ship's lifeboat (a dinghy is not a lifeboat)"}, {"url": "http://gfp.sd.gov/licenses/boat/", "passage_text": "Boats over 12 feet long and motorboats of any length, including those using electric trolling motors, must be registered to be operated on public waters. Boat registration, transferring of boat ownership and replacing lost boat registration stickers are done through your local county treasurer office. 1 Non-motorized boats over 12 feet in length must have a validation sticker, but boat numbering is optional. 2  Non-motorized boats 12 feet in length or less are not required to be licensed or numbered. 3  The boat number assigned to your boat can be found on your boat license registration"}, {"url": "http://watercraft.ohiodnr.gov/registration", "passage_text": "...But Not All Boats Need Titles. Titles show proof of ownership and are required for all boats 14 feet or greater, outboard motors 10HP or greater, and PWCs (ie. Jetski, Sea-Doo, etc.). For those boats that require a title, the title must be an Ohio title in order to get an Ohio registration. Canoes and kayaks do not need to be titled. 1  All About Titles."}, {"url": "http://doa.alaska.gov/dmv/reg/boat.htm", "passage_text": "When the USCG issued registration expires, boat owners must renew the registration with us. Prior to June 4th, 2004, non-powered boats 10 feet or greater in length used on any water of the state were required to be registered. These boats are no longer required to be registered; however, you may register a non-powered boat if you wish to. "}, {"url": "http://www.georgiawildlife.com/node/2972", "passage_text": "Sailboats less than 12 feet in length without mechanical prolusion do not require registration. Sailboats 12 feet or longer must be registered whether or not they have mechanical propulsion. Boats operated exclusively on private ponds or lakes do not have to be registered. "}, {"url": "http://gfp.sd.gov/licenses/boat/", "passage_text": "Boats are registered for a one year period. Fees are based on the length of boat and the type of propulsion. All registration needs to be done at the county treasurer's office in the county of residence, not where a boat is kept or primarily used. 1 Non-motorized boats over 12 feet in length must have a validation sticker, but boat numbering is optional. 2  Non-motorized boats 12 feet in length or less are not required to be licensed or numbered. 3  The boat number assigned to your boat can be found on your boat license registration"}, {"url": "http://www.state.nj.us/mvc/Vehicle/VehicleBoats.htm", "passage_text": "Most boats must be registered in New Jersey to operate on waterways. If you need to register a boat more than 12 feet in length. If you need to register a boat 12 feet or less in length (including jet skis and other non-titled watercrafts). Boats and marine equipment that do not have to be registered. "}, {"url": "http://www.dol.wa.gov/vehicleregistration/registerboat.html", "passage_text": "You must title and register your boat in Washington State: 1  Within 60 days of moving to Washington with the boat. 2  Within 15 days of buying the boat, if you live in Washington and bought the boat in another state. This means you must register your boat in Washington: 1  Within 60 days of moving to Washington with the vessel. 2  Within 15 days of buying the vessel, if bought it in another state and you live in Washington."}]