[{"url": "http://www.babynamespedia.com/meaning/Lalita", "passage_text": "Lalita is a seldom used baby name for girls. It is not in the top 1000 names. Baby names that sound like Lalita include La Toya, LaToya, Latoya, Latoyia, Laudyne, Leotey, Leotie, Leticia, Lidewij, Lidiya, Lolita, Louetta, Lucia, Lucía, Luetta, Lydia, Lynnet, Lolotea, Ladi, lady And. laidey [ 3 syll. la-li-ta, lal-ita ] The baby girl name Lalita is pronounced as Luw-Lih-T AA - †. Lalita is used mostly in Indian and it is of Sanskrit origin. Lalita's meaning is charming; desirable; playful. In Hindu mythology, Lalita is one of Krishna's lovers and playmates. It is also another name for Durga, the wife of Shiva. Lalita has 14 derivatives."}, {"url": "https://en.wikipedia.org/wiki/Lalita_sahasranama", "passage_text": "Names [edit]. Lalita Sahasranamam contains the thousand names of the Hindu mother goddess Lalita. The names are organized in a hymns (stotras). It is the only sahasranama that does not repeat a single name. Further, in order to maintain the meter, sahasranamas s use the artifice of adding words like tu, api, ca, and hi, which are conjunctions that do not necessarily add to the meaning of the name except in cases of interpretation."}, {"url": "http://www.ourbabynamer.com/meaning-of-Lalita.html", "passage_text": "What does Lalita mean, popularity, numerology and more. The name Lalita is of Hindi origin. The meaning of Lalita is caress, charm. It is also of Sanskrit origin, where its meaning is caress, charm . Less than 5 boys were given the name. View the Lalita Name Popularity Page to see how the popularity trend for Lalita has changed since 1880, or to compare the popularity of Lalita to other names. Lalita is a variant spelling of Lali."}, {"url": "http://www.thinkbabynames.com/meaning/0/Lalita", "passage_text": "Lalita is a rare given name for women and also a unique last name for both adults and children. (2000 U.S. Census). Shown below is the birth name popularity of Lalita for girls. Lalita is pronounced similarly to Lillita, Loleta, Lolita ▼ and Lulita. Other recommended similar baby names are Lalia, Lalika, Lanita, Larita, Lilith ▲ , Malita and Talita. These names tend to be more frequently used than Lalita."}, {"url": "http://www.behindthename.com/name/lalita", "passage_text": "Means playful, charming, desirable in Sanskrit. This is a transcription of both the feminine form ललिता and the masculine form ललित. In Hindu belief this is the name of one of the playmates of the young Krishna. Related Names. "}, {"url": "http://www.ourbabynamer.com/meaning-of-Lalita.html", "passage_text": "Lalita is generally used as a girl's name. It consists of 6 letters and 3 syllables and is pronounced La-li-ta. In the U.S. in 2014, it ranked 13802 in baby name popularity for girls with 7 occurrences. Less than 5 boys were given the name. View the Lalita Name Popularity Page to see how the popularity trend for Lalita has changed since 1880, or to compare the popularity of Lalita to other names. Lalita is a variant spelling of Lali."}, {"url": "http://www.sheknows.com/baby-names/name/lalita", "passage_text": "Hindi Meaning: The name Lalita is a Hindi baby name. In Hindi the meaning of the name Lalita is: Named for the Lalita Vistara. Sanskrit Meaning: The name Lalita is a Sanskrit baby name. In Sanskrit the meaning of the name Lalita is: Pleasant; Playful. In Hindu mythology Lalita is mistress and playmate to the Krishn"}, {"url": "http://www.thinkbabynames.com/meaning/0/Lalita", "passage_text": "Lalita /lali-ta/ [3 sylls.] as a girls' name is pronounced la-LEE-tah. It is of Hindi and Sanskrit origin, and the meaning of Lalita is playful. Hindu mythology: the mistress-playmate of the young Krishna. Lalita is pronounced similarly to Lillita, Loleta, Lolita ▼ and Lulita. Other recommended similar baby names are Lalia, Lalika, Lanita, Larita, Lilith ▲ , Malita and Talita. These names tend to be more frequently used than Lalita."}]