[{"url": "http://community.ebay.com/t5/Archive-PayPal/how-long-does-it-take-to-get-paypal-refund-in-my-account/qaq-p/10063635", "passage_text": "how long does it take to get paypal refund in my account. on ‎12-15-2012 07:08 AM. Posts: 1. Registered: ‎12-15-2012. Return item & seller said they refunded my paypal account, its been 24 hrs & i have seen no balance in my account-. You must be a registered user to add a comment."}, {"url": "https://uk.answers.yahoo.com/question/index?qid=20110921100325AATBtJG", "passage_text": "Answers. Best Answer: PayPal refunds are very quick.. PayPal refunds can take 3-5 days.. PayPal refunds can take up to 10 business days. All of these statements are true. If you paid for the item with your outstanding PayPal balance, the refund should show up very quickly, as in a matter of hours. If you paid for the item via PayPal but used an attached credit or debit card, the refund will probably take 3-5 business days, since the CC needs to be notified of the refund."}, {"url": "https://uk.answers.yahoo.com/question/index?qid=20110921100325AATBtJG", "passage_text": "Best Answer: PayPal refunds are very quick.. PayPal refunds can take 3-5 days.. PayPal refunds can take up to 10 business days. All of these statements are true. If you paid for the item with your outstanding PayPal balance, the refund should show up very quickly, as in a matter of hours. If you paid for the item via PayPal but used an attached credit or debit card, the refund will probably take 3-5 business days, since the CC needs to be notified of the refund."}, {"url": "http://smallbusiness.chron.com/long-until-receive-refunds-paypal-65570.html", "passage_text": "Refunds to a credit or debit card will take longer than PayPal account refunds. Jupiterimages/Goodshoot/Getty Images. When it comes to getting a refund on PayPal, two factors affect the time it takes for money to arrive: the human element and the PayPal system."}, {"url": "https://developer.paypal.com/docs/classic/admin/refunds/", "passage_text": "If you issue a refund within 60 days, PayPal credits the original transaction fee for receiving the payment to your account. For partial refunds, PayPal credits a percentage of the original transaction fee based on the refunded amount."}, {"url": "https://uk.answers.yahoo.com/question/index?qid=20090917130416AAB9uWC", "passage_text": "How long does it take for a refund to go back into... show more i ordered something online on sept the 14th through paypal. then on the 15th the company ran out of the item so they refunded my money on paypal."}, {"url": "http://smallbusiness.chron.com/long-until-receive-refunds-paypal-65570.html", "passage_text": "The refund request must be made within 60 days of purchase. If the seller does not agree to refund your money, you may be able to open a dispute. For purchases made with your credit or debit card, the refund can take up to 30 days to show up on your account. If you bought the item using your bank account or PayPal balance, the balance will be credited to your PayPal account. Funds can take three to five days to arrive i"}]