[{"url": "https://www.law.cornell.edu/constitution/amendmentxvii", "passage_text": "Amendment XVII. The Senate of the United States shall be composed of two Senators from each state, elected by the people thereof, for six years; and each Senator shall have one vote. The electors in each state shall have the qualifications requisite for electors of the most numerous branch of the state legislatures. "}, {"url": "https://en.wikipedia.org/wiki/Seventeenth_Amendment_to_the_United_States_Constitution", "passage_text": "Text [edit]. The Senate of the United States shall be composed of two Senators from each State, elected by the people thereof, for six years; and each Senator shall have one vote. The electors in each State shall have the qualifications requisite for electors of the most numerous branch of the State legislatures. Originally, under Article I, § 3, Clauses 1 and 2 of the Constitution, each state legislature elected its state's senators for a six-year term. Each state, regardless of size, is entitled to two senators as part of the Connecticut Compromise between the small and large states."}, {"url": "http://www.archives.gov/legislative/features/17th-amendment/", "passage_text": "17th Amendment to the U.S. Constitution: Direct Election of U.S. Senators. Americans did not directly vote for senators for the first 125 years of the Federal Government. The Constitution, as it was adopted in 1788, stated that senators would be elected by state legislatures."}, {"url": "http://www.answers.com/Q/What_was_the_impact_of_the_seventeenth_amendment", "passage_text": "required that U.S. Senators be elected directly by the people   DIRECT ELECTION OF SENATORS(1913) Passed by Congress May 13,1912.Ratified Alpril 8 ,1913. NOTE: Article 1 S … ection 3, of the Constitution was modified by the Seventeenth Amendment. ...it was passed on May 13, 1912, ratified by the states within a year and formally declared an amendment to the Constitution on May 31, 1913 by Bryan, in his role as Secreta … ry of State, becoming the Seventeenth Amendment. http://en.wikipedia.org/wiki/Seventeenth_Amendment_to_the_United_States_Constitution."}, {"url": "https://en.wikipedia.org/wiki/Seventeenth_Amendment_to_the_United_States_Constitution", "passage_text": "The Seventeenth Amendment in the National Archives. The Seventeenth Amendment (Amendment XVII) to the United States Constitution established the popular election of United States Senators by the people of the states. Originally, under Article I, § 3, Clauses 1 and 2 of the Constitution, each state legislature elected its state's senators for a six-year term. Each state, regardless of size, is entitled to two senators as part of the Connecticut Compromise between the small and large states."}, {"url": "http://www.answers.com/Q/How_did_the_passage_of_the_17th_amendment_affect_senatorial_elections", "passage_text": "Amendment XVII (the Seventeenth Amendment) of the United States  Constitution was passed by the Senate on June 12, 1911 and by the  House on May 13, 1912. It was ratified on … April 8, 1913 and was  first put into effect for the election of 1914. "}, {"url": "http://www.answers.com/Q/What_was_the_impact_of_the_seventeenth_amendment", "passage_text": "The Seventeenth Amendment is ratified? The Seventeenth Amendment to the United States Constitution was passed by the Senate on June 12, 1911, the House of Representatives on May 13, 1912, and ratified by the states … on April 8, 1913. 1 person found this useful. ...it was passed on May 13, 1912, ratified by the states within a year and formally declared an amendment to the Constitution on May 31, 1913 by Bryan, in his role as Secreta … ry of State, becoming the Seventeenth Amendment. http://en.wikipedia.org/wiki/Seventeenth_Amendment_to_the_United_States_Constitution."}, {"url": "http://legal-dictionary.thefreedictionary.com/17th+Amendment", "passage_text": "From 1787 until 1913, the U.S. Constitution specified that state legislatures would elect U.S. senators. Article 1, Section 3, reads: The Senate of the United States shall be composed of two Senators from each State, chosen by the Legislature thereof, for six Years; and each Senator shall have one Vote. The Seventeenth Amendment, which was ratified in 1913, provided for the direct election of U.S. senators by citizens."}, {"url": "http://legal-dictionary.thefreedictionary.com/17th+Amendment", "passage_text": "Seventeenth Amendment. The Seventeenth Amendment to the U.S. Constitution reads: The Senate of the United States shall be composed of two Senators from each State, elected by the people thereof for six years; and each Senator shall have one vote. The Seventeenth Amendment, which was ratified in 1913, provided for the direct election of U.S. senators by citizens."}, {"url": "http://www.weegy.com/?ConversationId=IW15FVIQ&Link=i", "passage_text": "The Seventeenth Amendment has an impact to the citizen in America thief' did not have to 'steal' in the shadows the balance guaranteed in the Constitution...the power was given away with the open hand of forgotten memory and ignorance.. "}]