[{"url": "https://en.wikipedia.org/wiki/Bochdalek_hernia", "passage_text": "A Bochdalek hernia is one of two forms of a congenital diaphragmatic hernia, the other form being Morgagni hernia. Babies who are born with a Bochdalek hernia are more than likely to have another birth defect caused by the hernia. About twenty percent of those children born with a Bochdalek hernia, also have a congenital heart defect. In addition, infants born with this condition may also have other abnormalities."}, {"url": "http://www.chw.org/medical-care/gastroenterology-and-hepatology-program/conditions/disphramatic-hernia/", "passage_text": "A diaphragmatic hernia is a birth defect, which is an abnormality that occurs before birth as a fetus is forming in the mother's uterus. An opening is present in the diaphragm (the muscle that separates the chest cavity from the abdominal cavity). 1 Bochdalek hernia-A Bochdalek hernia involves an opening on the left side of the diaphragm. 2  The stomach and intestines usually move up into the chest cavity. 3  Morgagni hernia-A Morgagni hernia involves an opening on the right side of the diaphragm. 4  The liver and intestines usually move up into the chest cavity."}, {"url": "http://radiopaedia.org/articles/bochdalek-hernia", "passage_text": "Dr Behrang Amini et al. A Bochdalek hernia is a form of congenital diaphragmatic hernia. They occur posteriorly and are due to a defect in the posterior attachment of the diaphragm when there is a failure of pleuroperitoneal membrane closure in utero. "}, {"url": "https://en.wikipedia.org/wiki/Bochdalek_hernia", "passage_text": "A Bochdalek hernia is a congenital abnormality in which an opening exists in the infant’s diaphragm, allowing normally intra-abdominal organs (particularly the stomach and intestines) to protrude into the thoracic cavity. Babies who are born with a Bochdalek hernia are more than likely to have another birth defect caused by the hernia. About twenty percent of those children born with a Bochdalek hernia, also have a congenital heart defect. In addition, infants born with this condition may also have other abnormalities."}, {"url": "http://www.chw.org/medical-care/gastroenterology-and-hepatology-program/conditions/disphramatic-hernia/", "passage_text": "There are two types of diaphragmatic hernia: 1  Bochdalek hernia-A Bochdalek hernia involves an opening on the left side of the diaphragm. 2  The stomach and intestines usually move up into the chest cavity. 3  Morgagni hernia-A Morgagni hernia involves an opening on the right side of the diaphragm. 1 Bochdalek hernia-A Bochdalek hernia involves an opening on the left side of the diaphragm. 2  The stomach and intestines usually move up into the chest cavity. 3  Morgagni hernia-A Morgagni hernia involves an opening on the right side of the diaphragm. 4  The liver and intestines usually move up into the chest cavity."}, {"url": "http://www.chw.org/medical-care/gastroenterology-and-hepatology-program/conditions/disphramatic-hernia/", "passage_text": "In a Bochdalek hernia, the diaphragm may not develop properly, or the intestine may become trapped in the chest cavity as the diaphragm is forming. In a Morgagni hernia, the tendon that should develop in the middle of the diaphragm does not develop properly. 1 Bochdalek hernia-A Bochdalek hernia involves an opening on the left side of the diaphragm. 2  The stomach and intestines usually move up into the chest cavity. 3  Morgagni hernia-A Morgagni hernia involves an opening on the right side of the diaphragm. 4  The liver and intestines usually move up into the chest cavity."}, {"url": "http://www.wisegeek.com/what-is-a-bochdalek-hernia.htm", "passage_text": "A Bochdalek hernia is a potentially life-threatening congenital defect in which the diaphragm fails to close correctly. As a result, it is possible for abdominal organs and other tissues to push upward into the chest cavity. "}, {"url": "http://medical-dictionary.thefreedictionary.com/Bochdalek's+hernia", "passage_text": "Bochdalek's hernia congenital posterolateral diaphragmatic hernia, with extrusion of bowel and other abdominal viscera into the thorax; due to failure of closure of the pleuroperitoneal hiatus. cerebral hernia (hernia ce´rebri) protrusion of brain substance through a defect in the skull. fat hernia hernial protrusion of peritoneal fat through the abdominal wall. femoral hernia protrusion of a loop of intestine into the femoral canal, a tubular passageway that carries nerves and blood vessels to the thigh; this type occurs more often in women than in men."}, {"url": "https://en.wikipedia.org/wiki/Congenital_diaphragmatic_hernia", "passage_text": "Congenital diaphragmatic hernia (CDH) is a congenital malformation (birth defect) of the diaphragm. The most common type of CDH is a Bochdalek hernia; other types include Morgagni hernia, diaphragm eventration and central tendon defects of the diaphragm. "}]