[{"url": "http://www.investopedia.com/terms/b/backdating.asp", "passage_text": "DEFINITION of 'Backdating'. Dating any document by a date earlier than the one on which the document was originally drawn up. Under most circumstances, backdating is seen as fraudulent and illegal, although there are some situations in which backdating can be used in a legal and beneficial way, such as backdating a claim for a past period. BREAKING DOWN 'Backdating'. Sometimes certain claims (such as insurance claims) can be backdated if the could not be completed at an earlier date, although there must be good reason for neglecting to claim in advance."}, {"url": "https://en.wikipedia.org/wiki/Options_backdating", "passage_text": "The SEC’s opinions regarding backdating and fraud were primarily due to the various tax rules that apply when issuing “in the money” stock options vs. the much different – and more financially beneficial – tax rules that apply when issuing “at the money” or out of the money stock options. While options backdating is not always illegal, many options in corporations are granted to upper management. Backdating has been called cheating the corporation in order to give the CEO more money than was authorized. and a way of rewarding managers when stock prices fall."}, {"url": "http://www.oxforddictionaries.com/definition/english/backdate", "passage_text": "1 Most of the agreements and other documents were backdated and there is uncertainty with respect to the actual dates on which-and the order in which-some of them were executed. 2  He writes that he was backdating the Officer Efficiency Training report. 1 Best of all, the increase is backdated to February last year. 2  Union members are not only discontented with the increase on offer but also the pay differential between staff and to the proposal that any pay increase be backdated only to May 1."}, {"url": "http://financial-dictionary.thefreedictionary.com/backdate", "passage_text": "The act of dating a document before the date it was actually signed. For example, if one signs a contract on February 1, one may backdate it to January 31. Backdating is usually illegal; for example, one may use backdating to evade taxes. However, it can be permissible under certain circumstances. For instance, one may backdate an insurance claim if there was an unavoidable delay between the date the insured event occurred and the day the claim was made. "}, {"url": "http://www.oxforddictionaries.com/definition/english/backdate", "passage_text": "1.1 Put an earlier date to (a document) than the actual one: they backdated the sale documents to evade a court order. More example sentences. 1  Most of the agreements and other documents were backdated and there is uncertainty with respect to the actual dates on which-and the order in which-some of them were executed. 2  He writes that he was backdating the Officer Efficiency Training report. 1 Best of all, the increase is backdated to February last year. 2  Union members are not only discontented with the increase on offer but also the pay differential between staff and to the proposal that any pay increase be backdated only to May 1."}, {"url": "http://financial-dictionary.thefreedictionary.com/backdating", "passage_text": "Backdating. The act of dating a document before the date it was actually signed. For example, if one signs a contract on February 1, one may backdate it to January 31. Backdating is usually illegal; for example, one may use backdating to evade taxes. However, it can be permissible under certain circumstances. For instance, one may backdate an insurance claim if there was an unavoidable delay between the date the insured event occurred and the day the claim was made"}, {"url": "http://www.thefreedictionary.com/backdated", "passage_text": "backdate-make effective from an earlier date; The increase in tax was backdated to January. effect-act so as to bring into existence; effect a change. 1. backdate-make effective from an earlier date; The increase in tax was backdated to January. effect-act so as to bring into existence; effect a change. Translations. [ˈbaekˈdeɪt] ˈBæKˈDEɪT [+ vt ] → cheque poner fecha anterior, a; [+ antedatar pay ] → rise dar efecto retroactivo. a"}, {"url": "http://www.merriam-webster.com/dictionary/backdate", "passage_text": ": to give (something) an earlier date than the actual date. : to say that something began or became effective at a date earlier than the current date. "}]