[{"url": "https://en.wikipedia.org/wiki/Flagellin", "passage_text": "Flagellin is a globular protein that arranges itself in a hollow cylinder to form the filament in a bacterial flagellum. It has a mass of about 30,000 to 60,000 daltons. Flagellin is the principal substituent of bacterial flagellum, and is present in large amounts on nearly all flagellated bacteria."}, {"url": "https://labtestsonline.org/understanding/analytes/asca/tab/test/", "passage_text": "The presence of ASCA is more common in CD, while pANCA is more common in UC. Anti-CBir1 (anti-flagellin antibody) and anti-Omp C (anti-outer membrane protein antibody) are indicative of CD and may also be used in combination with ASCA testing. In some cases, however, it can be difficult to distinguish between CD and UC. An ASCA test is often ordered along with a test for perinuclear anti-neutrophil cytoplasmic antibody (pANCA) to help determine which type of IBD a person has."}, {"url": "http://www.invivogen.com/anti-flagellin", "passage_text": "Anti-Flagellin. Anti-Flagellin FliC is a mouse monoclonal antibody to Salmonella typhimurium flagellin. Flagellin is the major component of the bacterial flagellar filament, which confers motility on a wide range of bacterial species. Flagellin is recognized by TLR5 [1] and induces the activation of NF-κB and the production of cytokines and nitric oxide depending on the nature of the TLR5 signaling complex [2]."}, {"url": "http://www.rockland-inc.com/Product.aspx?id=33980", "passage_text": "Flagellin Antibody Description. Background. Flagellin is a protein found in the hollow cylinder forming the filament in bacterial flagellum. Its structure is helical, which is important for its function. Studies comparing aflagellate Borrelia to flagellated indicate that the flagella have a role in the invasion of human tissue. The N-and C-termini of flagellin form the inner core of the flagellar filament, and the central portion of the protein makes up the outer surface. While the terminus of the protein is quite similar between all bacterial flagellins, the central portion is variable."}, {"url": "https://en.wikipedia.org/wiki/Flagellin", "passage_text": "The N-and C-termini of flagellin form the inner core of the flagellin protein, and is responsible for flagellin's ability to polymerize into a filament. The middle residues make up the outer surface of the flagellar filament. Flagellin is the principal substituent of bacterial flagellum, and is present in large amounts on nearly all flagellated bacteria."}, {"url": "http://www.biolegend.com/purified-anti-flic-flagellin-antibody-3594.html", "passage_text": "Reactivity: FliC is expressed in motile bacteria including Salmonella and E. Coli. The epitope recognized by this antibody is not known. There is a possibility that some flagellins are not recognized by this FLIC-1 antibody. For example, E. coli flagellin have been reported to vary in size from 36 K to 69 K in MW. The epitope recognized by this FLIC-1 monoclonal antibody is not known. FliC is a subunit protein that polymerizes (in conjunction with other proteins) to form the filaments of bacterial flagella in a precise order. Flagellin is a potent ligand of toll-like receptor 5 (TLR5)"}, {"url": "https://labtestsonline.org/understanding/analytes/asca/tab/test/", "passage_text": "The test for anti-Saccharomyces cerevisiae antibodies (ASCA) is used to help distinguish between Crohn disease (CD) and ulcerative colitis (UC), the two most common types of inflammatory bowel disease (IBD) . Testing usually includes detecting two different classes of ASCA in the blood, IgG and IgA. In some cases, however, it can be difficult to distinguish between CD and UC. An ASCA test is often ordered along with a test for perinuclear anti-neutrophil cytoplasmic antibody (pANCA) to help determine which type of IBD a person has."}, {"url": "http://www.abcam.com/Flagellin-antibody-ab93713.html", "passage_text": "1 Relevance Flagellin (FliC) is a subunit protein that polymerizes (along with other proteins) to form the filaments of bacterial flagella. The total protein concentration of ab93713, lot GR35089-1, is around 30-40 mg/ml. However, since this is whole serum containing a wide variety of proteins, the concentration of the specific anti-Flagellin antibody canno..."}]