[{"url": "http://www.food.com/recipe/jamaican-sorrel-drink-212257", "passage_text": "Cook. Sorrel is a typical drink served at Christmas in Jamaica which is also know for its health benefits. This dried Hibiscus flower can be purchased at any caribbean or west indies store. This recipe is really made to taste, and everyone makes it different"}, {"url": "http://www.foodnetwork.com/recipes/caribbean-sorrel-cocktail-recipe.html#!", "passage_text": "I'm from Jamaica and it's pretty close to what we make. The only thing missing is cinnamon sticks and whole cloves. Sorrel is a drink best made in advance, the longer the steep the stronger the Sorrel. In response to Chef Jim in Jamaica the flower and drink is called Sorrel. I've seen it in latin markets listed as Hibiscus and Jamaica flower, but Jamaicans and carribean people call it Sorrel. "}, {"url": "http://www.youtube.com/watch?v=B4GX9SBmFRU", "passage_text": "How to make Sorrel as it's made in the Caribbean using a traditional recipe from Trinidad and Tobago. This spiced sorrel drink is popular around the Christmas season in the Caribbean, since that's when the sorrel flower blooms and is available for use. However I'm using dried sorrel in this recipe for the drink. 1  Howto & Style. 2  Standard YouTube .... "}, {"url": "http://hungry-belly-recipes.tumblr.com/post/40522408967/sorrel-drink-caribbean-drink", "passage_text": "SORREL DRINK (Caribbean drink). Sorrel is a typical drink made religiously at Christmas time in the Trinidad and Tobago although no one is restricted to making it at Christmas time only ;). Sorrel is made from the sepals of the Sorrel Flowers….and it is said sorrel is a type of Hibiscus. RECIPE. Fresh Sorrel. Dried Sorrel. You can use the Dried or Fresh Sorrel. INGREDIENTS. 1  1 lb. fresh sorrel or 1 bag dried sorrel. 2  11 cups water. 3  1 to 2 cups sugar (sweeten to taste). 4  10 cloves. 5  1 stick cinnamon (i used some mixed spice in substitute of the cinnamon). 6  1tsp grated ginger."}, {"url": "http://www.wikihow.com/Make-Sorrel-Juice", "passage_text": "Sorrel juice is a red, tangy juice made from the sepals or petals of the sorrel plant. The flavor of sorrel is naturally a little sour, so the juice is usually sweetened with sugar and flavored with spices like cinnamon and orange peel. "}, {"url": "https://en.wikipedia.org/wiki/Sorrel", "passage_text": "A drink called zobo (sorrel squash) is made from a decoction of the plant calyx. In Romania, wild or garden sorrel, known as măcriş or ştevie, is used to make sour soups, stewed with spinach, added fresh to lettuce and spinach in salads or over open sandwiches. Common sorrel or garden sorrel (Rumex acetosa), often simply called sorrel, is a perennial herb in the family Polygonaceae. Other names for sorrel include spinach dock and narrow-leaved dock. It is a common plant in grassland habitats and is cultivated as a garden herb or leaf vegetable (pot herb)"}]