[{"url": "http://www.babyhopes.com/articles/weight-fertility.html", "passage_text": "Weight can play a role in fertility. Both being underweight or overweight can affect how likely you are to be able to conceive. For maximum fertility, you should try to stay within a recommended weight range."}, {"url": "http://www.conceiveeasy.com/get-pregnant/does-weight-affect-fertility/", "passage_text": "Being overweight. For overweight women, the biggest problem it can cause with fertility is that it makes your ovulation irregular and cause irregular menstrual periods. There is also a chance that you can develop other obesity related conditions during pregnancy if you are"}, {"url": "http://www.webmd.com/infertility-and-reproduction/guide/infertility-age-weight-exercise", "passage_text": "Weight and Fertility. A healthy diet is very important for women who are trying for a baby. Being overweight can affect a woman's fertility and can cause complications during pregnancy. A woman who is overweight and who is planning a pregnancy would be advised to lose weight before she conceives."}, {"url": "http://www.fertilitytexas.com/how-weight-affects-female-fertility/", "passage_text": "Though body weight is a sensitive topic, it can have a major impact on your overall health and is an important topic to discuss with your health care provider. In regards to fertility, your weight can affect your ability to become pregnant, keep a pregnancy, and have a good pregnancy outcome."}, {"url": "http://www.conceiveeasy.com/get-pregnant/does-weight-affect-fertility/", "passage_text": "Rating: 4.0/ 5 (1 vote cast). If you are struggling with getting pregnant, take a look to see how your weight affects your fertility. Being both underweight and overweight can cause disruptions in fertility-find out what you can do. When you are trying to get pregnant, there are so many things to take into consideration, and so many factors that can affect things. One factor that a lot of people don’t stop to think about is their weight."}, {"url": "http://www.babyhopes.com/articles/weight-fertility.html", "passage_text": "Being overweight can affect fertility in a variety of ways. For some women, their weight may affect their ovulation. Being overweight can disrupt a woman’s regular monthly cycle, making it difficult for her to ovulate, and making it difficult to know exactly when she is ovulating."}]