[{"url": "https://en.wikipedia.org/wiki/The_Prince", "passage_text": "The Prince (Italian: Il Principe [il ˈprintʃipe]) is a 16th-century political treatise by the Italian diplomat and political theorist Niccolo Niccolò. Machiavelli from correspondence a version appears to have been distributed in, 1513 using A latin, Title De (Principatibus About). principalities The Prince (Italian: Il Principe [il ˈprintʃipe]) is a 16th-century political treatise by the Italian diplomat and political theorist Niccolo Niccolò. machiavelli"}, {"url": "http://www.rollingstone.com/music/artists/prince/biography", "passage_text": "Biography. Prince is one of the most naturally gifted artists of all time, and also one of the most mysterious. In the Eighties, at a time when other megastars such as Michael Jackson, Bruce Springsteen, and Madonna, were delivering an album every three years or so, Prince remained prolific to an almost inhuman degree. In fact, Prince played nearly all the instruments on his first five albums, and has produced himself since signing with Warner Bros. at age 21. Under the name Prince Rogers, Prince's father John Nelson was the leader of a Minneapolis-area jazz band, in which his mother was the vocalist."}, {"url": "http://prince.org/msg/7/248862", "passage_text": "mozfonky said: I'd say in the broadest sense, he's influenced by just about any great artist that came before him. But, the vintage Prince, the quintessential Prince will always be remembered as an amalgamation of primarily Sly Stone, Jimi Hendrix and James Brown. Of course there were many more in there but I think it's fair to say those are the major ones. He was also influenced by Elvis, Santana, Little Richard and many many more."}, {"url": "https://en.wikipedia.org/wiki/Prince_singer", "passage_text": "Prince Roger Nelson (born June 7, 1958), known by his mononym Prince, is an American singer-songwriter, multi-instrumentalist, and actor, a major figure in popular music for over three decades. Prince is renowned as an innovator and is widely known for his eclectic work, flamboyant stage presence, and wide vocal range. Prince's sister Tika Evene (usually called Tyka) was born in 1960. Both siblings developed a keen interest in music, and this was encouraged by their father. Prince wrote his first tune, Funk Machine, on his father's piano when he was seven. When Prince was ten years old, his parents separated."}, {"url": "http://www.popmatters.com/feature/94059-maybe-im-just-like-my-father-princes-anxiety-of-influence-and-purple-/", "passage_text": "During the summer of 1984, Prince accomplished a fete only one other musical act—The Beatles—had accomplished before: he was at the top of the charts with an album (Purple Rain), a film (Purple Rain) and a single (“When Doves Cry”). Prince's Anxiety of Influence and 'Purple Rain' in the Context of '80s Pop Music."}, {"url": "http://prince.org/msg/7/258790", "passage_text": "Prince was influenced by good soul singers like mavis staples. I saw in a documentary, him and mavis recording a song called God is Love. Mavis said that it was cool that Prince felt that there singing and style had influenced him. "}, {"url": "http://prince.org/msg/7/248862", "passage_text": "Larry has definitely influenced Prince's bass playing. But, the vintage Prince, the quintessential Prince will always be remembered as an amalgamation of primarily Sly Stone, Jimi Hendrix and James Brown. Of course there were many more in there but I think it's fair to say those are the major ones. He was also influenced by Elvis, Santana, Little Richard and many many more."}, {"url": "http://www.mtv.com/news/1658041/kelly-clarkson-new-album/", "passage_text": "“PS: I record my last song on the 25th of this month and then we will be releasing the album!” she wrote. “This album was influenced by Prince, Tina Turner, Sheryl Crow, Radiohead and there’s a little bit of a Country vibe/influence on a couple of songs.”. "}, {"url": "http://s-endz.tumblr.com/post/6283837452/why-prince-is-the-biggest-influence-on-modern", "passage_text": "Why Prince is the biggest influence on modern music. Genius. Legend. Visionary. Unique. The modern day Mozart. One of the greatest artists and performers the world has ever known. The songwriter with the most songs in Rolling Stone’s “500 Greatest Songs Of All Time”. "}]