[{"url": "http://faculty-salaries.startclass.com/l/6334/University-of-Minnesota-Duluth", "passage_text": "Professors at University of Minnesota-Duluth make on average $92,904 over the course of nine months, the typical contract for an academic year. This is $41,898 more than the average university professor's nine month salary ($51,006)."}, {"url": "http://faculty-salaries.startclass.com/l/6334/University-of-Minnesota-Duluth", "passage_text": "Female professors at University of Minnesota-Duluth make on average $83,482 over the course of nine months, the typical contract for an academic year. This is $33,892 more than the average female university professor's nine month salary ($49,590)."}, {"url": "http://www.salarylist.com/company/University-Of-Minnesota/Professor-Salary.htm", "passage_text": "University of Minnesota Professor Salary. University of Minnesota Professor average salary is $166,836, median salary is $137,250 with a salary range from $88,000 to $286,312. University of Minnesota Professor salaries are collected from government agencies and companies. Each salary is associated with a real job position."}, {"url": "http://faculty-salaries.startclass.com/l/6334/University-of-Minnesota-Duluth", "passage_text": "In 2013 professors at University of Minnesota-Duluth had an average nine month salary of $92,904. This is $1,034 more than professors earned in 2012, the most recently reported prior year, and a 1.1 percent increase in earnings over the previous year's average nine month salary ($91,870)."}, {"url": "http://faculty-salaries.startclass.com/l/6334/University-of-Minnesota-Duluth", "passage_text": "In 2013 male professors at University of Minnesota-Duluth had an average monthly salary of $10,579. This is $174 more than male professors earned per month in 2012, the most recently reported prior year, and a 1.6 percent increase in monthly earnings over the previous year's average monthly salary ($10,405)."}, {"url": "http://faculty-salaries.startclass.com/l/6334/University-of-Minnesota-Duluth", "passage_text": "In 2013 professors at University of Minnesota-Duluth had an average monthly salary of $10,323. This is $115 more than professors earned per month in 2012, the most recently reported prior year, and a 1.1 percent increase in monthly earnings over the previous year's average monthly salary ($10,208)."}]