[{"url": "http://www.simplyhired.com/salaries-k-music-major-jobs.html", "passage_text": "Average Music Major Salaries. The average salary for music major jobs is $48,000. Average music major salaries can vary greatly due to company, location, industry, experience and benefits. This salary was calculated using the average salary for all jobs with the term music major anywhere in the job listing. Music Major Salary Information. This free salary calculator uses salary data from millions of job listings indexed by Simply Hired's job search engine. The music major salary comparisons feature allows job seekers to get the information required to make important career decisions and negotiate salary ranges."}, {"url": "https://www.careersinmusic.com/music-therapist/", "passage_text": "MUSIC THERAPIST. Career Overview: A Music Therapist works with clients to improve any issues with their emotional, physical, cognitive and social wellbeing through the use of music lessons, sing-a-longs, etc. Average Annual Earnings: $50,000. General Earnings Range: $20,000–$135,000. "}, {"url": "http://salarygenius.com/1/1/salary/music-major-salary", "passage_text": "National Music Major Salary Information. The average yearly salary for Music Major is $36,550. If you are just beginning to work a new job as a Music Major, you could expect a starting pay rate of $30,100 annually. "}, {"url": "http://www.popsugar.com/smart-living/Forbes-Ranks-College-Majors-Average-Starting-Salary-1764731", "passage_text": "I was a former computer science major-then international studies (not on list) and now in health policy and management (masters). The article DID say they didnt focus on public degrees only private so I guess I cant compare. lisseth0221 7 years. I'm a Business Mgt. Follow us on Pinterest. Maybe your degree doesn't hold the title of most lucrative college major, but that hardly means all your four years got you was a meager paycheck."}, {"url": "http://work.chron.com/salary-business-management-majors-7993.html", "passage_text": "Basics. The median pay of business management and administration undergraduates was $58,000 per year in 2011, according to Georgetown University. The 25th percentile earned $40,000 per year and the 75th percentile earned $85,000 per year, a difference of more than double the lower salary. "}, {"url": "http://learn.org/articles/Music_Management_Career_and_Salary_Your_Questions_Answered.html", "passage_text": "Music Management Salary and Career Facts. Explore the career requirements for music managers. Get the facts about the education requirements, job outlook and salary information to determine if this is the right career for you. Schools offering Music Business degrees can also be found in these popular choices. "}, {"url": "http://work.chron.com/average-salary-musical-education-degree-20711.html", "passage_text": "Starting Salaries. A survey conducted by the National Association of Colleges and Employers found that music education majors earned an average starting salary of $36,400 a year as of 2012. This figure, however, doesn’t account for occupation. Your line of work has a direct impact on your earnings. "}, {"url": "http://study.com/articles/Average_Salary_With_A_Bachelors_Degree.html", "passage_text": "Show me popular schools. The National Center for Education Statistics (NCES) reported that the median (not average) salary for young adults with a bachelor's degree was $46,900 in 2012. "}]