[{"url": "http://www.pregnancyloss.info/waitingforaf.htm", "passage_text": "Your bleeding will taper off to spotting within a week, and maybe random spotting will continue for another week. Your hCG drops steadily, usually hitting zero during the end of the spotting, or about 10 days after the miscarriage or D&C. When the spotting ends, you will get strange symptoms. In a normal recovery, it can take three weeks for the hormone chain to fire up again, and it will not be marked by bleeding or any physical symptom. You will only know that the new cycle worked by having a period at the end of it, between five and seven weeks after your miscarriage."}, {"url": "http://www.thelaboroflove.com/articles/when-to-expect-your-period-after-a-miscarriage", "passage_text": "Every woman is different, but generally you can expect to get your period in four to six weeks. Some women get their period just a couple weeks later, while some women do not get their period for three or more months. Hi I had a miscarriage on March 29th had a normal period April 26 and had no period in may but got it in June 25th is that normal. Made an apt with my doctor just want to hear any feed back if this has happen to any one before."}, {"url": "http://www.md-health.com/Period-After-Miscarriage.html", "passage_text": "You will need to watch your symptoms after you miscarry to determine if your recovery is progressing at a normal and healthy pace. Spontaneous miscarriage refers to a condition that is caused when the body aborts a fetus within 20 weeks of gestation. As your body heals it may take time for your menstrual cycle to return to normal. Your first period after your miscarriage should occur four weeks after the hCG levels return to zero. Many examinations only measure these levels until the hCG levels fall below 5, so it can be difficult to determine when exactly normal bleeding can be expected. Fertility after Miscarriage. Your fertility after miscarriage should return to normal within 4-6 weeks. Working to improve your overall health and wellness can help you conceive a healthy pregnancy when you are ready to start trying again. Several effective ways are present to assist with fertility after m"}, {"url": "http://www.thelaboroflove.com/articles/when-to-expect-your-period-after-a-miscarriage", "passage_text": "You should expect to get your period about four weeks after a D&C and you might expect to see your period around six weeks after a miscarriage that did not require a D&C. Hi I had a miscarriage on March 29th had a normal period April 26 and had no period in may but got it in June 25th is that normal. Made an apt with my doctor just want to hear any feed back if this has happen to any one before."}, {"url": "http://www.nhs.uk/chq/Pages/954.aspx?CategoryID=54", "passage_text": "It usually takes four to six weeks for your periods to return after a miscarriage, although it can take longer to settle into a regular cycle. The length of time it takes will depend on how regular your periods were before your pregnancy. It’s worth seeing your GP for advice if your periods haven’t returned after four to six weeks and your cycle was regular before your pregnancy."}, {"url": "http://www.thelaboroflove.com/articles/when-to-expect-your-period-after-a-miscarriage", "passage_text": "So, when will you get your period? Every woman is different, but generally you can expect to get your period in four to six weeks. Some women get their period just a couple weeks later, while some women do not get their period for three or more months. Your specific situation will be different than any other womans. Hi I had a miscarriage on March 29th had a normal period April 26 and had no period in may but got it in June 25th is that normal. Made an apt with my doctor just want to hear any feed back if this has happen to any one before."}, {"url": "http://www.md-health.com/Period-After-Miscarriage.html", "passage_text": "And you also need further examination to check your condition. Spontaneous miscarriage refers to a condition that is caused when the body aborts a fetus within 20 weeks of gestation. As your body heals it may take time for your menstrual cycle to return to normal. Your first period after your miscarriage should occur four weeks after the hCG levels return to zero. Many examinations only measure these levels until the hCG levels fall below 5, so it can be difficult to determine when exactly normal bleeding can be expected. Fertility after Miscarriage. Your fertility after miscarriage should return to normal within 4-6 weeks. Working to improve your overall health and wellness can help you conceive a healthy pregnancy when you are ready to start trying again. Several effective ways are present to assist with fertility after m"}, {"url": "http://www.miscarriagesupport.org.nz/your-health-after-miscarriage/", "passage_text": "Menstrual cycle. You may resume a normal cycle immediately with the next period 28 days after the miscarriage but there is a great personal variation, and it can take up to 6 or 7 weeks for your period to return, especially if you had a “natural” miscarriage (i.e. no D&C or tablets)."}, {"url": "http://www.newkidscenter.com/First-Period-after-Miscarriage.html", "passage_text": "If you experience any bleeding period after this 20 days, it will probably be the real period. This normally comes at about 4 to 6 weeks after the miscarriage. This period will be heavy as compared to the normal light periods that you usually get, and may be accompanied by severe cramping. Blood clots can be experienced and the period lasts for about 4 to 7 days, but it does not apply to all women since it is individual specific. Also, there is a great difference between the first period after an abortion and the first period after a normal"}]