[{"url": "https://www.nytimes.com/books/98/01/11/home/morrison-bluest.html", "passage_text": "November 13, 1970 Books of the Times By JOHN LEONARD THE BLUEST EYE By Toni Morrison 164 pp. Holt, Rinehart, and Winston. Toni Morrison's The Bluest Eye is an inquiry into the reasons why beauty gets wasted in this country. "}, {"url": "https://en.wikipedia.org/wiki/The_Bluest_Eye", "passage_text": "1 Pecola Breedlove: The focal character and possible protagonist of the novel. 2  A poor black girl, she believes that she is ugly because she and her community base their ideals of beauty on whiteness. 3  The title The Bluest Eye refers to Pecola's fervent wishes for beautiful blue eyes. 1 Pauline Polly Breedlove: Pecola's mother. 2  Mrs. Breedlove is married to Cholly and lives the self-righteous life of a martyr, enduring her drunk husband and raising her two awkward children as best she can."}, {"url": "http://www.litcharts.com/lit/the-bluest-eye/themes", "passage_text": "Beauty vs. Ugliness. The black characters of the The Bluest Eye have been taught to believe that whiteness is the paragon of beauty. The characters are constantly subjected to images of whiteness offered through movies, books, candy, magazines, toys, and advertisements. Home in The Bluest Eye represents more than the physical structure where a family lives. In Morrison's novel, home is an idea that defines the characters' sense of self and self-worth, and likewise, informs the way they are perceived by those around them."}, {"url": "https://en.wikipedia.org/wiki/The_Bluest_Eye", "passage_text": "The Bluest Eye is a 1970 novel by American author Toni Morrison. It is Morrison's first novel and was written while she was teaching at Howard University and raising her two sons on her own. 1 Pauline Polly Breedlove: Pecola's mother. 2  Mrs. Breedlove is married to Cholly and lives the self-righteous life of a martyr, enduring her drunk husband and raising her two awkward children as best she can."}, {"url": "http://www.sparknotes.com/lit/bluesteye/context.html", "passage_text": "Answer: Toni Morrison’s The Bluest Eye is definitely a masterpiece in English Literature. Here in this writing, Toni Morrison has included some of important themes and symbols which make the writing more prominent. The Bluest Eye contains a number of autobiographical elements. It is set in the town where Morrison grew up, and it is told from the point of view of a nine-year-old, the age Morrison would have been the year the novel takes place (1941)."}, {"url": "http://www.barnesandnoble.com/w/bluest-eye-toni-morrison/1100608830", "passage_text": "Overview. The Bluest Eye, published in 1970, is the first novel written by Toni Morrison, winner of the 1993 Nobel Prize in Literature. View All Available Formats & Editions. The Bluest Eye, published in 1970, is the first novel written by Toni Morrison, winner of the 1993 Nobel Prize in Literature."}, {"url": "http://www.sparknotes.com/lit/bluesteye/themes.html", "passage_text": "Answer: Toni Morrison’s The Bluest Eye is definitely a masterpiece in English Literature. Here in this writing, Toni Morrison has included some of important themes and symbols which make the writing more prominent. Read the full answer at. Answer: The Bluest Eye, written by Toni Morrison is a very noteworthy work in English Literature. However, a tragic character is a creative art suffers from a tragic flaw. In a modern tragedy the tragic protagonist may suffer from the reason he or she is not responsible."}, {"url": "https://www.lexile.com/book/details/9780679433736/", "passage_text": "Summary. The Bluest Eye,published in 1970, is the first novel written by Toni Morrison, winner of the 1993 Nobel Prize in Literature. "}, {"url": "http://www.shmoop.com/bluest-eye/", "passage_text": "The Bluest Eye is Toni Morrison 's first novel, published in 1970. It tells the tragic story of Pecola Breedlove, a young black girl growing up in Morrison's hometown of Lorain, Ohio, after the Great Depression. "}]