[{"url": "http://budgeting.thenest.com/average-cost-siding-removal-replacement-23085.html", "passage_text": "Project estimates vary depending on your choice in contractors, materials and the size of your house. The average total cost for replacing 1,250 square feet of vinyl siding, including trim like soffit and facia, in 2011 was $11,387, according to Remodeling Magazine. The average cost to replace the same amount of siding with a premium foam-backed vinyl was $13,927. Using fiber cement siding as a replacement, the average cost was $13,382. Of course, much of this investment can be recovered if you plan to sell your house."}, {"url": "http://www.rempros.com/installation-prices/cost_to_install_siding.html", "passage_text": "Read about remodeling costs and estimating labor expenses first. Siding installation cost vary from $190 per square (100 sq. ft.) for 0.40 gauge horizontal vinyl siding and standard installation to $1,860 per square for high quality stone veneer siding and complex work. Siding prices chart and installation expenses. Type of siding materials."}, {"url": "http://homewyse.com/services/cost_to_install_vinyl_siding.html", "passage_text": "$6.16. Get an INSTANT estimate of the cost to Install Vinyl Siding! Our free calculator uses recent, trusted data to estimate costs for your Vinyl Siding Installation project. For a basic 120 square feet project in zip code 47474, the benchmark cost to Install Vinyl Siding ranges between $4.52 - $6.16 per square foot* . To estimate costs for your project: 1. Set Project Zip Code Enter the Zip Code for the location where labor is hired and materials purchased"}, {"url": "http://www.all-about-siding.com/vinyl-siding-cost.html", "passage_text": "If the question is 'what does vinyl siding cost, the short answer is about $3 to $10 per sq ft installed. But if you are trying to figure out about what it would cost you install new vinyl siding on your house, that is a little different and requires more information. Average cost of vinyl siding is about $3 per sq ft to up over $10 per square foot for the higher qualities of siding. Vinyl siding like all other products comes in different qualities."}, {"url": "http://budgeting.thenest.com/average-cost-siding-removal-replacement-23085.html", "passage_text": "Materials and Labor. Contractor costs can be up to $50 per hour, so you may be able to save some money if you do the work yourself. The price for materials varies, but the cost of the siding itself is only a fraction of the overall price tag. For example, vinyl siding can range between $1.67 and 3.74 per square foot. Aluminum siding can cost between $2.40 and $5.00 per square foot. The average cost to replace the same amount of siding with a premium foam-backed vinyl was $13,927. Using fiber cement siding as a replacement, the average cost was $13,382. Of course, much of this investment can be recovered if you plan to sell your house."}, {"url": "http://www.kudzu.com/article/How-much-does-it-cost-to-install-home-siding-id10170", "passage_text": "1 Aluminum: A longer-lasting option, aluminum siding is both fireproof and impervious to termites, but more susceptible to denting and corrosion. 2  The siding alone costs around $2 - $3 per square foot, and professional installation usually costs $3 - $4.50 for both labor and materials. 1 The siding alone costs around $2 - $3 per square foot, and professional installation usually costs $3 - $4.50 for both labor and materials. 2  A 1,000 square-foot area can cost up to $4,500 or more to have siding installed professionally"}, {"url": "http://home.costhelper.com/vinyl-siding.html", "passage_text": "1 Range from less than $1/square foot for do-it-yourself panels from a building supply store to $2-$7 or more if installed by a contractor. 2  For an 1,800-square-foot exterior (50' long, 40' wide and 10' tall'), that's $3,600 to $12,600 and up for professionally hung vinyl. "}, {"url": "http://www.kudzu.com/article/How-much-does-it-cost-to-install-home-siding-id10170", "passage_text": "1 Professional installation can cost $2 - $3 per square foot for both labor and materials, or $2,000 - $3,000 per 1,000 square feet. 2  Aluminum: A longer-lasting option, aluminum siding is both fireproof and impervious to termites, but more susceptible to denting and corrosion. 1 The siding alone costs around $2 - $3 per square foot, and professional installation usually costs $3 - $4.50 for both labor and materials. 2  A 1,000 square-foot area can cost up to $4,500 or more to have siding installed professionally"}, {"url": "http://www.rempros.com/installation-prices/cost_to_install_siding.html", "passage_text": "In the chart total cost to get a new siding installed divided by the labor expenses and average siding prices per square. Cost of materials is a charge will be added to the total price if a contractor will purchase siding and additional materials for proper installation at his own discretion. Siding installation cost vary from $190 per square (100 sq. ft.) for 0.40 gauge horizontal vinyl siding and standard installation to $1,860 per square for high quality stone veneer siding and complex work. Siding prices chart and installation expenses. Type of siding materials."}]