[{"url": "http://www.geeks.com/techtips/2010/safeguard-your-equipment-with-a-surge-protector.htm", "passage_text": "Here are four things to look for when buying surge protectors: 1  First, the clamping voltage. 2  This is the voltage at which the varistor will kick in. 3  Common clamping voltages are 500 volts, 400 volts, and 330 volts. 4  A surge protector with a clamping voltage of 400 volts or 330 volts will give you the best protection."}, {"url": "http://www.tripplite.com/products/surge-buying-guide", "passage_text": "A Surge Protector is a device that is designed to protect PCs, servers, network equipment, audio/video equipment, computer peripherals and other electronic devices from damaging power surges and line noise interference."}, {"url": "http://www.homedepot.com/c/surge_protector_buying_guide_HT_BG_EL", "passage_text": "Surge Protector Strips. The most common form of point-of-use protection is the surge protector strip. You plug multiple devices into the strip and plug the strip into a standard electrical outlet."}, {"url": "http://www.cnet.com/news/what-makes-a-good-surge-protector-part-1/#!", "passage_text": "A surge protector is not a power strip, although a low end model may look like a power strip. Power strips are just extension cords and won't protect a computer from power surges. If it doesn't say Surge Suppressor, it is probably just a power strip. You can also judge by the price, power strips are cheaper than surge suppressors. A device with no Joules rating is a power strip. There are many features that go into making a good surge protector. To begin with, electrical surges can happen on any wire."}, {"url": "https://en.wikipedia.org/wiki/Surge_protector", "passage_text": "A surge protector (or surge suppressor) is an appliance/device designed to protect electrical devices from voltage spikes. A surge protector attempts to limit the voltage supplied to an electric device by either blocking or by shorting to ground any unwanted voltages above a safe threshold."}]