[{"url": "http://www.benefits.va.gov/HOMELOANS/purchasecashout.asp", "passage_text": "VA's Cash-Out Refinance Loan is for homeowners who want to take cash out of your home equity to take care of concerns like paying off debt, funding school, or making home improvements. The Cash-Out Refinance Loan can also be used to refinance a non-VA loan into a VA loan. "}, {"url": "http://www.trulia.com/voices/Foreclosure/How_long_does_it_take_for_bank_owned_chase_prope-565328", "passage_text": "Reply. Think about it: all sales are cash to the bank or owner of the property. The only difference is the amount of time for closing. If a home as been on the market more than a month or so, it is not a big deal for the banks to wait a few more weeks for a good offer (as they perceive it). Cash is king only if the sale has a bona fide time constraint and must be completed by a date certain. Oneal Gordon, Home Buyer, Fort Lauderdale, FL. Its not a clear answer but the time to respond depends on the bank and their foreclosure/short sale departments procedure for handling foreclosures. e.g bank of america may take forever. Ive closed a short sale with Chase in under 60 days."}, {"url": "http://www.hotukdeals.com/misc/how-long-does-take-a-house-sale-go-through-generally-1117543", "passage_text": "Reply. When we bought ours the house was empty, we weren't in a chain, neither were they and it took 5 weeks from offer accepted to the keys being in our hands. I think that's reasonably quick though, plus I was on holiday for the summer so spent the time phoning solicitors/mortgage company etc. Put an offer in, accepted and mortgage talks are underway.... we are not in a chain, neither are the other end....so roughly when would one be ready to move into their new place?? magicbeans3y, 9m agoPosted 3 years, 9 months ago."}, {"url": "http://www.homes.com/question/39423/how-long-does-it-usually-take-to-close-on-a-home-in-forecloser/", "passage_text": "The time to close varies. A guide line would be 2 weeks for cash on a bank owned foreclosure and 2 months on a non approved short sale, 1 month on an approved short sale. If you have a home that fits you and your price is 50-70% of previous market value hang in there until you succeed."}, {"url": "https://uk.answers.yahoo.com/question/index?qid=20061027035406AAtqeX8", "passage_text": "· just now. Report Abuse. it normally takes 3 months but it all depends on how good your agents and solicitors are my mother in law has bought a house last month but that was meant to have been no chain and quick move but now there completion is end of January."}, {"url": "https://houseconveyancing.org/how-long-does-house-conveyancing-take-in-the-uk/", "passage_text": "How Long Does House Conveyancing Take. The average time it takes for the conveyancing work to be carried out on a property purchase is around 6 to 8 weeks. This can change a lot depending on the circumstance of the transaction. For leasehold property it generally takes longer than a freehold property. 6. A property can be on the market for a number of months and in some cases years. This is why a large percentage of sellers do not start looking for a new property until theirs is under offer. This process can take a long time and if they need to arrange for mortgage finance can delay it even further."}, {"url": "http://www.theanswerbank.co.uk/How-it-Works/Question1001298.html", "passage_text": "It's usually the searches that cause it to take about 3 months. jomifl. six weeks shouldn't be a problem, my wife once bought a house in 1 month but the solicitor was a friend of hers. What takes time is finding out if the vendor is the real owner and if there are any debts attached to it. Bought one for cash towards the end of last year, no chain cos they were renting. Told 4 weeks but that was in October and we didn't move in till January. Eve. It can be done very quickly depending on how cautious you want to be (searches etc...)."}, {"url": "https://uk.answers.yahoo.com/question/index?qid=20061027035406AAtqeX8", "passage_text": "I accepted an offer on my house this Monday. The couple who are buying it are not in a chain and neither am I. I wanted to know if I would be in my new house before christmas. My solictior has said it will probably take only 6 weeks. Report Abuse. it normally takes 3 months but it all depends on how good your agents and solicitors are my mother in law has bought a house last month but that was meant to have been no chain and quick move but now there completion is end of January."}, {"url": "http://www.homes.com/question/39423/how-long-does-it-usually-take-to-close-on-a-home-in-forecloser/", "passage_text": "It depends are you paying cash or are you financing the home, if cash anywhere from 3 weeks to a little over a month, if your financing the home from 45 days to 2 months basically as long as it would take a normal real estate transaction. answer by Richard Williams | Contact Me. A guide line would be 2 weeks for cash on a bank owned foreclosure and 2 months on a non approved short sale, 1 month on an approved short sale. If you have a home that fits you and your price is 50-70% of previous market value hang in there until you succeed."}]