[{"url": "https://www.nolhga.com/policyholderinfo/main.cfm/location/insolvencyprocess", "passage_text": "[ Back ]. Role of the Receiver. By obtaining control of a company, the commissioner (or the insurance department) is, by law, the rehabilitator or liquidator of the company. In this capacity, the commissioner or department takes control of the company’s operations. [ Back ]. Role of the Guaranty Associations. State life and health insurance guaranty associations are state entities (in all 50 states as well as Puerto Rico and the District of Columbia) created to protect policyholders of an insolvent insurance company."}, {"url": "http://www.dinsmore.com/what_happens_when_an_insurance_company_goes_bust/", "passage_text": "If the state court agrees with the commissioner's petition or if the board of directors of the insurer join in the petition, a liquidation order is issued appointing the insurance commissioner liquidator of the company. The liquidation proceeding then takes place, governed by the state's liquidation statute. The financial news coming out of the insurance industry lately has been anything but good. American International Group (AIG), the nation's largest insurer, teetered on the verge of collapse until the federal government rushed in with an $85 billion bailout package."}, {"url": "http://www.flahiga.org/faqprint.cfm", "passage_text": "If your insurance company is liquidated, you will receive a notice from the court-appointed Receiver (typically the Insurance Commissioner of the company’s state of domicile), who will oversee the liquidation of the company and inform you of any new claims procedures. In general, a court of competent jurisdiction will work with the department of insurance in determining when an insurance company requires special regulatory control. Some steps that might be taken are not publicly announced, but may include supervision of some kind."}, {"url": "http://www.dinsmore.com/what_happens_when_an_insurance_company_goes_bust/", "passage_text": "When an insurance regulator determines that an insurance company based in the state is insolvent, the state's insurance commissioner petitions the court for an order placing the company into liquidation. The financial news coming out of the insurance industry lately has been anything but good. American International Group (AIG), the nation's largest insurer, teetered on the verge of collapse until the federal government rushed in with an $85 billion bailout package."}, {"url": "http://www.nstates.com/faq.asp", "passage_text": "When a company is placed into liquidation, the state insurance guaranty associations are typically activated to pay claims as soon as the court orders the liquidation. Claim payments usually begin within 90 days after the liquidation order is issued. The Circuit Court of Cole County, Missouri has declared National States insolvent and has ordered the company into liquidation effective November 15, 2010. This document will help to answer frequently asked questions about making claims and the liquidation procedure."}, {"url": "http://iowa.ncigf.org/node/177", "passage_text": "The state insurance commissioner or a representative is appointed receiver and begins the process of collecting assets and determining the company’s outstanding liabilities. When this process is concluded a final distribution is made to the company’s creditors. This is almost always less than 100 percent of what is owed; usually this final distribution is made a number of years after the company is ordered liquidated. In most cases, an estate will not yield sufficient money to pay claims in full; and most are not able to pay claims in a timely manner."}, {"url": "https://www.nolhga.com/policyholderinfo/main.cfm/location/insolvencyprocess", "passage_text": "When a company enters a period of financial difficulty and is unable to meet its obligations, the insurance commissioner in the company’s home state initiates a process—dictated by the laws of the state—whereby every attempt is first made to help the company regain its financial footing. [ Back ]. Role of the Guaranty Associations. State life and health insurance guaranty associations are state entities (in all 50 states as well as Puerto Rico and the District of Columbia) created to protect policyholders of an insolvent insurance company."}, {"url": "http://www.insure.com/general-insurance/bankrupt-company.html", "passage_text": "They will get it automatically.. A defunct insurance company will send you a letter soon after it has been placed under regulatory control. You might also be contacted by the insurance company's rehabilitator and your state's guaranty association. If your insurance company does not notify you of its insolvency, you can always call your state guaranty association or your state's department of insurance for instructions on what to do. Most states have two guaranty associations. "}, {"url": "https://en.wikipedia.org/wiki/Liquidation", "passage_text": "In law and business, liquidation is the process by which a company (or part of a company) is brought to an end, and the assets and property of the company are redistributed. Liquidation is also sometimes referred to as winding-up or dissolution, although dissolution technically refers to the last stage of liquidation. The main purpose of a liquidation where the company is insolvent is to collect its assets, determine the outstanding claims against the company, and satisfy those claims in the manner and order prescribed by law."}]