[{"url": "http://www.theprojectorpros.com/learn-s-learn-p-theater_throw_ratios.htm", "passage_text": "If the screen width is 7 feet and the projector's throw ratio is 2.0 - 2.4:1 (because projectors have zoom lenses, they also have a range of throw ratios) then you can place your projector anywhere from 14 to 16.8 feet away from the screen. (7 * 2 and 7 * 2.4 = 14-16.8). Example 2."}, {"url": "http://theprojectorpros.com/learn-s-learn-p-theater_setting_up.htm", "passage_text": "So, 7.5 feet * 1.8 equals 13.5 feet, and 7.5 feet * 2.2 equals 16.5 feet, as is indicated in the example below. Next, make sure your room is set up so that you can place a projector in that area (either using a ceiling mount, a stand or a coffee table)."}, {"url": "http://www.theprojectorpros.com/learn-s-learn-p-theater_throw_ratios.htm", "passage_text": "The ratio, like any ratio, is dimensionless. For example, if D equals 10 feet and W equals 5 feet, then 10 feet divided by 5 feet equals 2. The dimension of feet is thereby cancelled out. So, in knowing this formula, a projector's throw ratio will provide you with all of the information you'll need to set up a room."}, {"url": "http://theprojectorpros.com/learn-s-learn-p-theater_setting_up.htm", "passage_text": "The projector you want has a throw ratio of 1.8-2.2:1. So, 7.5 feet * 1.8 equals 13.5 feet, and 7.5 feet * 2.2 equals 16.5 feet, as is indicated in the example below. Next, make sure your room is set up so that you can place a projector in that area (either using a ceiling mount, a stand or a coffee table). Step 5."}, {"url": "http://www.audioholics.com/projector-screen-reviews/how-to-mount-projector-and-screen-in-home-theater", "passage_text": "Throw distance x width of screen in inches = distance from screen to projector lens. Throw distance is the distance from the screen to the projector. For example, if your screen is 87” wide and the throw distance of your projector is 1.3, the projector should be 113” (87x1.3=113”) from the screen. Remember to measure from the center of the projector’s lens straight to the screen, like the above image shows."}, {"url": "https://uk.answers.yahoo.com/question/index?qid=20110701075945AAxRqy2", "passage_text": "You should place the projector at less 10 to 12 feet away. Keep in mind that projectors needs to be in a dark room to be effective. The lamps on a projector only last about 2,000 hours and the cost of replacing them starts at $50 to around $300."}]