[{"url": "http://chemocare.com/chemotherapy/what-is-chemotherapy/how-long-is-chemotherapy-given.aspx", "passage_text": "The length of chemotherapy treatment is determined by a variety of factors. These include the type of cancer, the extent of cancer, the types of drugs that are given, as well as the expected toxicities of the drugs and the amount of time necessary to recover from these toxicities. There are really three issues regarding the cycle time, duration of the cycle, frequency of the cycle, and how many cycles. Duration of the cycle: Chemotherapy treatment may be a single drug or a combination of drugs. The drugs may all be given on a single day, several consecutive days, or continuously as an outpatient or as an inpatient"}, {"url": "http://www.beyondtheshock.com/questions/39421", "passage_text": "The first session takes linger but after that it took 31/2 to 4 hours. I used my i pod, I listened to books, downloaded a movie to my phone. Pretty soon, we(my husband always went with me)made friends so most of the time we ate, drank(no booze), and visited. It seemed like a once every 3 weeks lunch date. My sessions took 3-4 hours as well. It was chilly in the infusion room so you any want to bring a cozy sweater or small blanket. Where comfortable xotheing I found reading magazines was distracting. It helped me not to look at the needles or nurse procedures. Deep breathing helped to relax me."}, {"url": "http://www.mayoclinic.org/tests-procedures/chemotherapy-for-breast-cancer/basics/what-you-can-expect/PRC-20013035", "passage_text": "Timing and frequency of chemotherapy sessions. Chemotherapy for breast cancer is given in cycles. The cycle for chemotherapy can vary from once a week to once every three weeks. Typically, you'll undergo chemotherapy treatments for three to four months, but your doctor will adjust the timing to your circumstances. If you have advanced breast cancer, treatment may continue beyond six months. "}, {"url": "http://ww5.komen.org/BreastCancer/Chemotherapy.html", "passage_text": "Chemotherapy usually lasts three to six months, but you have days or weeks off between treatments. Your treatment schedule will depend on the combination of drugs given. Learn how chemotherapy is given and what to expect at each chemotherapy session. "}, {"url": "http://www.nhs.uk/Conditions/Chemotherapy/Pages/How-it-is-performed.aspx", "passage_text": "You'll need regular chemotherapy over a set period of time for it to be effective. Your care team will draw up a treatment plan detailing how many sessions you'll need, how long the course should last, and how much time should pass between each session. It's common for there to be a break after each session, to allow your body to recover. The treatment plan is known as a chemotherapy protocol."}, {"url": "https://answers.yahoo.com/question/index?qid=20090601010548AAes0RR", "passage_text": "We went to the chemotherapy ward for two different types of chemotherapy drugs. Over the course of 27 weeks our longest session was 2.5 hours. I talked to an oncology nurse about how long some patients are there for and she said sometimes up to 6 hours. Depending upon the drug. But one drug was about an hour and the other was 2.5 hours."}, {"url": "http://chemocare.com/chemotherapy/what-is-chemotherapy/how-long-is-chemotherapy-given.aspx", "passage_text": "For example, two bi-weekly chemotherapy sessions may be classified as one cycle. The number of cycles: In most cases, the number of cycles-or the length of chemotherapy from start to finish-has been determined by research and clinical trials. 1  When cure is the treatment goal. There are really three issues regarding the cycle time, duration of the cycle, frequency of the cycle, and how many cycles. Duration of the cycle: Chemotherapy treatment may be a single drug or a combination of drugs. The drugs may all be given on a single day, several consecutive days, or continuously as an outpatient or as an inpatient"}, {"url": "http://www.cancercouncil.com.au/781/b1000/chemotherapy-37/understanding-chemotherapy-qa/", "passage_text": "How often and how long you have chemotherapy depends on the type of cancer you have and the drugs that are used. You may have treatment daily, weekly or monthly for several months to a year. Chemotherapy is commonly given in courses (cycles), with rest periods in between. When you have chemotherapy you may spend a lot of time waiting, usually in the hospital or clinic: waiting for the doctor, for blood tests, for test results, for your drugs to be prepared and for the drugs to be given."}, {"url": "http://community.macmillan.org.uk/cancer_experiences/chemotherapy/f/205/t/59167", "passage_text": "Hi Lynne, The length of each chemo session depends on the chemo regime you will be following. Some are relatively short and some can go on for most of the day. It's very likely that 2 hours is an accurate guide if that is what the doctor has sent you. Hope the first session goes okay. "}]