[{"url": "http://christianity.about.com/od/glossary/a/Apostle.htm", "passage_text": "The term apostle was used in a second way in Scripture, as one who was commissioned and sent by a community to preach the gospel. Saul of Tarsus, a persecutor of Christians who was converted when he had a vision of Jesus on the road to Damascus, is also called an apostle. We know him as the Apostle Paul. The word apostle is derived from the Greek apostolos, meaning one who is sent.. A modern-day apostle would typically function as a church planter—one who is sent out by the body of Christ to spread the gospel and establish new communities of believers."}, {"url": "http://av1611.com/kjbp/kjv-dictionary/apostle.html", "passage_text": "Apostle, in the Greek liturgy, is a book contained the epistles of St. Paul, printed in the order in which they are to be read in churches, through the year. Definitions from Webster's American Dictionary of the English Language, 1828. Previous word: apollyon. Next word: apothecary. "}, {"url": "http://www.yourdictionary.com/apostle", "passage_text": "noun. A painting of Jesus with his apostles. A painting of Jesus with his apostles. The definition of an apostle is one of the specific twelve individuals who Jesus called upon to help spread his word. An example of an apostle is Judas Iscariot. An apostle is defined as someone who followed Jesus as a missionary of the Christian message. An example of an apostle is James the son of Alpheus."}, {"url": "http://www.icaleaders.com/about-ical/definition-of-apostle", "passage_text": "Definition of 'Apostle'. The Second Apostolic Age began roughly in 2001, heralding the most radical change in the way church is done since the Protestant Reformation. This New Apostolic Reformation embraces the largest segment of non-Catholic Christianity worldwide and is the fastest growing. "}, {"url": "http://www.thefreedictionary.com/apostle", "passage_text": "a·pos·tle. n. 1. a. Apostle One of a group made up especially of the 12 disciples chosen by Jesus to preach the gospel. b. A missionary of the early Christian Church. c. A leader of the first Christian mission to a country or region. 2. "}, {"url": "http://www.keyway.ca/htm2000/20001122.htm", "passage_text": "(Romans 16:7 RSV). Then He appeared to James, then to all the apostles. (1 Corinthians 15:7 RSV). Many others have claimed to be an apostle during and since the time of the New Testament, even including some in our present time. Jesus said to them again, Peace be with you. As the Father has sent Me, even so I send you. (John 20:21 RSV). The term apostle is however best known from the twelve apostles, who were sometimes recognized by more than one name."}, {"url": "http://christianity.about.com/od/glossary/a/Apostle.htm", "passage_text": "Definition: An apostle was one of Jesus Christ 's 12 closest disciples, chosen by him early in his ministry to spread the gospel after his death and resurrection. In the Bible, they are called Jesus' disciples until the Lord's ascension into heaven, then they are referred to as apostles. The word apostle is derived from the Greek apostolos, meaning one who is sent.. A modern-day apostle would typically function as a church planter—one who is sent out by the body of Christ to spread the gospel and establish new communities of believers."}, {"url": "http://www.oxforddictionaries.com/definition/english/apostle", "passage_text": "noun. 1 (Apostle) Each of the twelve chief disciples of Jesus Christ. Example sentences. 1  This is evident in the lives of the prophets, John the Baptist, the Apostles and the Lord Jesus Christ himself. 2  At the last supper, Jesus Christ tells the Apostles: ‘Now I'm going to turn the water into wine.’. 3  Christ, the Virgin Mary, the Apostles, saints, angels and religious events are depicted. 1.2 A vigorous and pioneering advocate or supporter of a particular policy, idea, or cause: a man once known as the apostle of free-market economics. More example sentences. Synonyms. 1  While the idea of human improvement may be implicit in notions of renaissance, he was anything but an apostle of the idea of progress."}]