[{"url": "https://answers.yahoo.com/question/index?qid=20070726210715AA8nfTt", "passage_text": "Best Answer: ETOH stands for ethanol. It is a common term used in medical histories to designate alcoholic beverages. When combined in the term 'ETOH abuse', it usually refers to a patient's history of over consumption of alcoholic beverages such as beer or hard liquor. ETOH is an abbreviation for ethanol, a two-carbon-containing alcohol that is found in beverage alcohol. ETOH is a medical or scientific abbreviation for ethanol, the substance found in"}, {"url": "https://en.wikipedia.org/wiki/EtOH", "passage_text": "Ethanol /ˈɛθənɒl/ , also commonly called ethyl alcohol, drinking alcohol, or simply alcohol is the principal type of alcohol found in alcoholic beverages, produced by the fermentation of sugars by yeasts. It is a neurotoxic psychoactive drug and one of the oldest recreational drugs used by humans. Ethanol is a volatile, flammable, colorless liquid with a slight chemical odor. It is used as an antiseptic, a solvent, a fuel, and, due to its low freezing point, the active fluid in post-mercury thermometers. Its structural formula, CH 3CH 2OH, is often abbreviated as C 2H 5OH, C 2H 6O or EtOH"}, {"url": "https://answers.yahoo.com/question/index?qid=20070726210715AA8nfTt", "passage_text": "ETOH is an abbreviation for ethanol, a two-carbon-containing alcohol that is found in beverage alcohol. ETOH is an abbreviation for ethanol, a two-carbon-containing alcohol that is found in beverage alcohol. ETOH is a medical or scientific abbreviation for ethanol, the substance found in alcoholic beverages. Thus, ETOH abuse refers to abuse of drinking"}, {"url": "http://www.chacha.com/question/what-does-etoh-stand-for-in-medical-terms", "passage_text": "Answers. ETOH, when used in a medical context, is an abbreviation for ethanol (i.e. alcohol). For instance, ETOH 10g/day denotes that the patient drinks 10 grams (roughly one standard drink) of alcohol a day on average. EtOH is a term (sometimes E.T.O.H.) used by Emergency Medical Technicians (EMTs) and other first responders to describe a patient who is displaying symptoms of over-consumption, or withdrawal from, alcoholic beverages. 3 years ago. ETOH, when used in a medical context, is an abbreviation for ethanol (i.e. alcohol)"}, {"url": "http://www.merriam-webster.com/dictionary/ethanol", "passage_text": "Medical Definition of ETHANOL. : a colorless volatile flammable liquid C2H5OH that is the intoxicating agent in liquors and is also used as a solvent—called also ethyl alcohol, grain alcohol; see alcohol 1. Spanish Central: Spanish translation of ethanol. : a colorless volatile flammable liquid C2H5OH that is the intoxicating agent in liquors and is also used as a solvent and in fuel —called also ethyl alcohol, grain alcohol. See ethanol defined for English-language learners."}, {"url": "http://www.medilexicon.com/medicaldictionary.php?t=30629", "passage_text": "Definitions: 1. Abbreviation for ethyl alcohol. The definition information for EtOH is provided by Stedman's. You can search our medical dictionary here. Stedman's, part of Lippincott Williams & Wilkins, provides a comprehensive line of health-science publications for healthcare professionals and medical students. "}, {"url": "http://www.merriam-webster.com/dictionary/ethanol", "passage_text": "Definition of ETHANOL. : a colorless volatile flammable liquid C2H5OH that is the intoxicating agent in liquors and is also used as a solvent and in fuel —called also ethyl alcohol, grain alcohol. See ethanol defined for English-language learners. See ethanol defined for kids. ADVERTISEMENT"}, {"url": "https://answers.yahoo.com/question/index?qid=20090715183153AAhSuN3", "passage_text": "Report Abuse. Ethanol is the alcohol in alcoholic drinks, as opposed to methanol (wood grain alcohol) or isopropanol (rubbing alcohol), both of which are poisonous. It is abbreviated in chemical and medical terms as ETOH. Means you have a drink occasionally. "}]