[{"url": "http://www.howmuchisit.org/fat-grafting-cost/", "passage_text": "1 Making your cheeks fuller can be done with the cheek lift method. 2  This can cost anywhere from $1,000 to $3,100. 3  Buttocks augmentation is one of the more expensive procedures done. 4  The initial price for this type of grafting is anywhere from $3,150 to $6,500."}, {"url": "http://doctorbeam.com/fat-transfer-glastonbury/", "passage_text": "Fat grafting is a cosmetic procedure technique with many benefits. By removing unwanted fat from one area of the body and using that to fill other areas in the face such as lips, wrinkles or cheeks, or may be injected into other areas of your body."}, {"url": "http://www.howmuchisit.org/fat-grafting-cost/", "passage_text": "1 Chin augmentation can start at $1,750 and cost up to $2,900. 2  Making your cheeks fuller can be done with the cheek lift method. 3  This can cost anywhere from $1,000 to $3,100. 4  Buttocks augmentation is one of the more expensive procedures done. 5  The initial price for this type of grafting is anywhere from $3,150 to $6,500."}, {"url": "http://www.docshop.com/education/dermatology/injectables/fat-transfer/cost-financing", "passage_text": "Fat Transfer Costs. Many factors affect the cost of fat transfer (microlipoinjection) treatment. A primary consideration is the reason for the fat transfer (for example, the cost for lip enhancement may differ significantly from that for scar revision or lipoatrophy correction)."}, {"url": "http://www.drvitenas.com/fat-grafting.html", "passage_text": "The area that the fat will be harvested from and the volume of fat to be deposited will have a significant influence on the total price of the procedure. The cost of Fat Transfer generally ranges from $3,500.00 to $9,500.00. For a more precise idea of the cost of this procedure feel free to upload your photos to our contact us form with your contact information."}, {"url": "http://www.howmuchisit.org/fat-grafting-cost/", "passage_text": "1 A lip fat filler procedure starts at $1,500 and can cost as much as $3,700. 2  Another procedure involving the lip is a lip enhancement. 3  This procedure also costs $1,500 to $3,700 which is the same as the lip fat filler procedure."}, {"url": "http://www.cosmeticsurg.net/procedures/fat-transfer/", "passage_text": "The total cost for a facial fat transfer ranges from $4500-$8200, depending on the area(s) to be injected, and the type of anesthesia used. In most cases, the procedure can be performed under local anesthesia."}, {"url": "http://www.howmuchisit.org/fat-grafting-cost/", "passage_text": "1 Fat grafting prices depend heavily on how complicated the process is. 2  Different parts of the body generally have a different level of difficulty to operate. 3  A lip fat filler procedure starts at $1,500 and can cost as much as $3,700. 4  Another procedure involving the lip is a lip enhancement."}, {"url": "http://www.smartbeautyguide.com/procedures/injectables/fat-transfer", "passage_text": "Fat Transfer. Also known as fat grafting or fat injection. A fat grafting procedure transfers fat from areas in which you have excess fat, such as the outer thighs, and injects it into areas that may be lacking in volume, such as your face, hands, breasts or buttocks."}]