[{"url": "http://www.ansto.gov.au/NuclearFacts/BenefitsofNuclearScience/", "passage_text": "On average, every Australian can expect to have a nuclear medicine procedure that uses a radioisotope for diagnostic or therapeutic purposes at some stage in their life. Nuclear medicine and radiology are the medical techniques that involve the use of radiation or radioactivity to diagnose, treat and prevent disease. While radiology has been used for close to a century, the term nuclear medicine began to be used around 50 years ago. Discover more. Nuclear power has been in use for decades and is one of the fastest growing energy options for countries seeking energy security and low-emission energy solutions. Globally nuclear power is the only proven base-load energy option available that has low carbon-dioxide emissions."}, {"url": "http://www.nei.org/Knowledge-Center/Other-Nuclear-Energy-Applications/Medicine-Scientific-Research", "passage_text": "Medicine & Scientific Research. In nuclear medicine, medical professionals inject a tiny amount of a radioisotope—a chemical element that produces radiation—into a patient’s body. A specific organ picks up the radioisotope, enabling a special camera to take a detailed picture of how that organ is functioning. For example: "}, {"url": "https://en.wikipedia.org/wiki/Nuclear_power", "passage_text": "Nuclear power is the use of nuclear reactions that release nuclear energy to generate heat, which most frequently is then used in steam turbines to produce electricity in a nuclear power station. The term includes nuclear fission, nuclear decay and nuclear fusion. "}, {"url": "http://nuclear-energy.net/applications/nuclear-medicin", "passage_text": "Nuclear medicine. Nuclear medicine is defined as the branch of medicine that uses radioactive isotopes, nuclear radiation, electromagnetic variations of the components of the atomic nucleus and related biophysical techniques for the prevention, diagnosis, therapy and medical research. "}, {"url": "http://www.ehow.com/info_8354367_pros-energy-use-medical-science.html", "passage_text": "John Foxx/Stockbyte/Getty Images. Radioactive isotopes are a byproduct of the generation of nuclear energy in power plants. Since the discovery of nuclear medicine in the 1950s, the use of radio isotopes in imaging and diagnosis as well as treatment has increased dramatically. "}, {"url": "http://nuclearconnect.org/know-nuclear/applications/medical-uses", "passage_text": "Medical Applications. Nuclear medicine and radiology are the whole of medical techniques that involve radiation or radioactivity to diagnose, treat and prevent disease. While radiology have been used for close to a century, “nuclear medicine” began approximately 50 years ago. "}, {"url": "http://www.buzzle.com/articles/medical-uses-of-nuclear-energy.html", "passage_text": "Uses of Nuclear Energy in the Field of Medicine. Radiation is used in medicine, which helps in giving information about the functioning of a specific organs in the body. The information given by this method is quick, which helps in accurate diagnosis of the condition of the patient. One of the fields, where nuclear energy is widely used is the field of medicine. As a matter of fact, nuclear medicine is fast emerging as a specialty branch of medicine. Like I have previously mentioned, it is used both for diagnosis as well as treatment of disease."}, {"url": "http://www.buzzle.com/articles/medical-uses-of-nuclear-energy.html", "passage_text": "The medicinal uses of nuclear energy include: These were some of the important uses of nuclear energy in the field of medicine. However, it is important to remember that there are certain medical implications of nuclear power as well. The implications are seen at different stages. One of the fields, where nuclear energy is widely used is the field of medicine. As a matter of fact, nuclear medicine is fast emerging as a specialty branch of medicine. Like I have previously mentioned, it is used both for diagnosis as well as treatment of disease."}, {"url": "http://www.buzzle.com/articles/medical-uses-of-nuclear-energy.html", "passage_text": "The most common of the medical uses of nuclear energy is its use in both medical and dental imaging. There are different radioactive organic molecules used for different types of imaging. Like for medical and dental imaging Cobalt-60 is used, while Technetium-99m is used as a tracer in the human body to detect diseases. One of the fields, where nuclear energy is widely used is the field of medicine. As a matter of fact, nuclear medicine is fast emerging as a specialty branch of medicine. Like I have previously mentioned, it is used both for diagnosis as well as treatment of disease."}]