[{"url": "https://en.wikipedia.org/wiki/Saint_Joseph", "passage_text": "Joseph (Hebrew יוֹסֵף, Yosef; Greek: ἰωσήφ, Ioseph) is a figure in the Gospels, the husband of Mary, the mother of Jesus, and is venerated as Saint Joseph in some Christian traditions. Christian tradition places Joseph as Jesus ' foster father. Some historians state that Joseph was Jesus's father. "}, {"url": "http://www.merriam-webster.com/dictionary/joseph", "passage_text": "Definition of JOSEPH. 1. capitalized a: a son of Jacob who according to the account in Genesis rose to high political office in Egypt after being sold into slavery by his brothers b: the husband of Mary the mother of Jesus according to the Gospel accounts. 2. : a long cloak worn especially by women in the 18th century. "}, {"url": "https://themeaningofthename.com/joseph/", "passage_text": "Usage: Joseph, of Hebrew origin, is a very popular first name. It is more often used as a boy (male) name. People having the name Joseph are in general originating from Austria, Belgium, France, Germany, Ireland, Luxembourg, Malta, Netherlands, Singapore, Tonga, United Kingdom, United States of America. For another variant of the name Joseph across the world, see Yosef."}, {"url": "http://www.behindthename.com/name/joseph", "passage_text": "Meaning & History. From Ioseph, the Latin form of Greek ιωσηφ (Ioseph) , which was from the Hebrew name יוֹסֵף (Yosef) meaning he will add. In the Old Testament, Joseph is the eleventh son of Jacob. Because he was the favourite of his father, his older brothers sent him to Egypt and told their father that he had died. In Egypt, Joseph became an advisor to the pharaoh, and was eventually reconciled with his brothers when they came to Egypt during a famine."}, {"url": "http://www.sheknows.com/baby-names/name/joseph", "passage_text": "In American the meaning of the name Joseph is: Increase; addition. Hebrew Meaning: The name Joseph is a Hebrew baby name. In Hebrew the meaning of the name Joseph is: May Jehovah add/give increase. St Joseph of Arimathea undertook the burial of Jesus (in Holy Grail lore). In the bible Joseph was sold by his brothers into slavery and later rose to become a supreme power in Egypt. Also Jesus' legal father."}, {"url": "http://www.thinkbabynames.com/meaning/1/Joseph", "passage_text": "Joseph /jo-se-ph/ [2 sylls.] as a boys' name is pronounced JOH-sef. It is of Hebrew origin, and the meaning of Joseph is Jehovah increases. Biblical: the son of Jacob who, sold by his brothers into slavery, but later became a supreme power in Egypt. Also Jesus' earthly father, a carpenter. See also Joe. Actors Josef Sommer, Joseph Fiennes; writers Joseph Conrad, Joseph Wambaugh; revolutionary Che Guevara; painter Joseph M. W. Turner."}, {"url": "http://www.abarim-publications.com/Meaning/Joseph.html", "passage_text": "For a meaning of the name Joseph, NOBSE Study Bible Name List reads two meanings: (1) May He (Yahweh) Add (assuming that the He of our name is YHWH), and (2) Increaser. Jones' Dictionary of Old Testament Proper Names reads He Shall Add. Joseph meaning. The name Joseph means Increaser, Repeater or Doubler, and even the fulfillment of his name is dual: Benjamin becomes Joseph's younger brother, and Joseph himself becomes father of two sons, Ephraim and Manasseh (see Ezekiel 47:13)."}]