[{"url": "https://en.wikipedia.org/wiki/Data_definition_language", "passage_text": "The data definition language concept and name was first introduced in relation to the Codasyl database model, where the schema of the database was written in a language syntax describing the records, fields, and sets of the user data model. Finally, another kind of DDL sentence in SQL is one used to define referential integrity relationships, usually implemented as primary key and foreign key tags in some columns of the tables. These two statements can be included inside a CREATE TABLE or an ALTER TABLE sentence."}, {"url": "http://www.webopedia.com/TERM/D/DDL.html", "passage_text": "Short for Data Definition Language, DDL is a computer language that is used to define data structures. In Database Management Systems (DBMS), it is used to specify a database scheme as a set of definitions (expressed in DDL). "}, {"url": "https://en.wikipedia.org/wiki/Data_definition_language", "passage_text": "A data definition language or data description language (DDL) is a syntax similar to a computer programming language for defining data structures, especially database schemas. Finally, another kind of DDL sentence in SQL is one used to define referential integrity relationships, usually implemented as primary key and foreign key tags in some columns of the tables. These two statements can be included inside a CREATE TABLE or an ALTER TABLE sentence."}, {"url": "http://superuser.com/questions/40097/what-is-a-ddl-script-in-the-context-of-databases", "passage_text": "Initially it referred to a subset of SQL, but is now used in a generic sense to refer to any formal language for describing data or information structures, like XML schemas. So, for databases, a DDL script is a script that creates the structure (tables, columns, indexes, ...) of a database. The term was first introduced in relation to the Codasyl database model, where the schema of the database was written in a Data Definition Language describing the records, fields, and sets making up the user Data Model."}, {"url": "http://stackoverflow.com/questions/2578194/what-is-ddl-and-dml", "passage_text": "up vote 53 down vote. DDL is Data Definition Language: it is used to define data structures. For example, with SQL, it would be instructions such as create table, alter table, ... DML is Data Manipulation Language: it is used to manipulate data itself. DML is abbreviation of Data Manipulation Language. It is used to retrieve, store, modify, delete, insert and update data in database. Examples: SELECT, UPDATE, INSERT statements. DDL is abbreviation of Data Definition Language. It is used to create and modify the structure of database objects in database. Examples: CREATE, ALTER, DROP statements. try visiting these site for more info: http://blog.sqlauthority.com/2008/01/15/sql-server-what-is-dml-ddl-dcl-and-tcl-introduction-and-examples/"}, {"url": "http://superuser.com/questions/40097/what-is-a-ddl-script-in-the-context-of-databases", "passage_text": "DDL = Data Definition Language. From the Wikipedia entry for DDL : A Data Definition Language (DDL) is a computer language for defining data structures. The term was first introduced in relation to the Codasyl database model, where the schema of the database was written in a Data Definition Language describing the records, fields, and sets making up the user Data Model."}, {"url": "http://stackoverflow.com/questions/13088012/create-database-from-ddl-script", "passage_text": ", and DELETE ... .). Your .ddl file is probably just an ordinary SQL script consisting of DDL statements; the extension .ddl is for the benefit of human readers, so they know what kind of SQL script it is. But if you know how to run a .sql script, then you can probably run your .ddl script in the same way. (If you're worried, you can first try opening your .ddl file in Notepad, and confirming that what it consists of is CREATE TABLE ... –type statements, before actually running it in your database.)."}, {"url": "https://msdn.microsoft.com/en-us/library/ff848799.aspx", "passage_text": "Applies To: SQL Server 2014, SQL Server 2016 Preview. Data Definition Language (DDL) is a vocabulary used to define data structures in SQL Server 2016. Use these statements to create, alter, or drop data structures in an instance of SQL Server. ALTER Statements (Transact-SQL). CREATE Statements (Transact-SQL)."}]