[{"url": "http://www.healthgrades.com/conditions/salmonella-food-poisoning", "passage_text": "Salmonella food poisoning is the most common cause of foodborne illness. Salmonella food poisoning, also known as salmonellosis, is a bacterial infection caused by a variety of types of Salmonella bacteria. Salmonella food poisoning is spread from the feces of infected people or animals through food or beverages."}, {"url": "http://www.nhs.uk/Conditions/Food-poisoning/Pages/Causes.aspx", "passage_text": "Salmonella. Salmonella bacteria are often found in raw or undercooked meat, raw eggs, milk, and other dairy products. The incubation period is usually between 12 and 72 hours. The symptoms usually last around four to seven days."}, {"url": "http://www.webmd.com/food-recipes/food-poisoning/food-poisoning", "passage_text": "Depending on the type of infection, people can even die as a result of food poisoning. More than 250 different diseases can cause food poisoning. Some of the most common diseases are infections caused by bacteria, such as Campylobacter, Salmonella, Shigella, E. coli O157:H7, Listeria, botulism, and norovirus."}, {"url": "http://umm.edu/health/medical/altmed/condition/food-poisoning", "passage_text": "Introduction. Food poisoning occurs when you eat food contaminated with bacteria or other toxins. Symptoms include diarrhea, vomiting, and stomach cramps, and generally start 4 to 36 hours after eating contaminated food."}, {"url": "http://www.healthgrades.com/conditions/salmonella-food-poisoning", "passage_text": "Common foods contaminated with Salmonella bacteria include undercooked eggs and poultry. However, any food can become contaminated with Salmonella bacteria if it is handled by an infected person with unwashed hands or if the food comes in contact with other food that is contaminated."}, {"url": "http://www.webmd.com/food-recipes/food-poisoning/ss/slideshow-food-poisoning-dangers", "passage_text": "Salmonella bacteria can taint any food, although there's a greater risk from animal products because of contact with animal feces. In chickens, it can infect eggs before the shell forms, so even clean, fresh eggs may harbor salmonella. Symptoms include stomach cramps, fever, and diarrhea 12 to 72 hours after exposure."}, {"url": "http://www.cdc.gov/features/salmonellaineggs/", "passage_text": "Although anyone can get Salmonella food poisoning, older adults, infants, and people with weakened immune systems are at increased risk for serious illness. A person infected with Salmonella usually has a fever, abdominal cramps, and diarrhea beginning 12 to 72 hours after consuming a contaminated food or beverage."}]