[{"url": "http://www.nhs.uk/conditions/Coeliac-disease/Pages/Introduction.aspx", "passage_text": "Coeliac disease is a common digestive condition where a person has an adverse reaction to gluten. Eating foods containing gluten can trigger a range of symptoms, such as: 1  diarrhoea, which may smell particularly unpleasant. 2  bloating and flatulence (passing wind). 3  abdominal pain. 4  weight loss. There is no cure for coeliac disease, but switching to a gluten-free diet should help control symptoms and prevent the long-term consequences of the disease. Even if symptoms are mild or non-existent, it is still recommended to change your diet, as continuing to eat gluten can lead to serious complications."}, {"url": "https://www.isitcoeliacdisease.org.uk/", "passage_text": "Coeliac disease is a lifelong autoimmune disease where the body’s immune system reacts to gluten, a protein found in wheat, barley and rye. About 500,000 people in the UK are living with undiagnosed coeliac disease without realising it. There are a range of symptoms including constant mouth ulcers, crippling fatigue, stomach pain, regular bouts of diarrhoea, anaemia and weight loss."}, {"url": "http://www.webmd.com/digestive-disorders/celiac-disease/celiac-disease", "passage_text": "Celiac disease is a digestive disorder that occurs in reaction to gluten, a protein found in rye, barley, wheat, and hundreds of foods made with these grains. The body's immune system reacts to the gluten and causes damage to the intestine. When the small intestine is damaged due to celiac disease, it doesn't absorb nutrients well. People with celiac disease are at risk for osteoporosis, and many of them will need aggressive treatment to address their low bone density."}, {"url": "https://www.isitcoeliacdisease.org.uk/", "passage_text": "ABOUT COELIAC DISEASE. Coeliac disease is a lifelong autoimmune disease where the body’s immune system reacts to gluten, a protein found in wheat, barley and rye. The body’s reaction to gluten causes damage to the lining of the intestine, preventing the body from absorbing important nutrients. About 500,000 people in the UK are living with undiagnosed coeliac disease without realising it. There are a range of symptoms including constant mouth ulcers, crippling fatigue, stomach pain, regular bouts of diarrhoea, anaemia and weight loss."}, {"url": "http://www.webmd.com/digestive-disorders/celiac-disease/celiac-disease", "passage_text": "Celiac disease -- also known as celiac sprue or gluten-sensitive enteropathy -- is a digestive and autoimmune disorder that results in damage to the lining of the small intestine when foods with gluten are eaten. When the small intestine is damaged due to celiac disease, it doesn't absorb nutrients well. People with celiac disease are at risk for osteoporosis, and many of them will need aggressive treatment to address their low bone density."}, {"url": "http://patient.info/health/coeliac-disease-leaflet", "passage_text": "Coeliac disease is caused by a reaction of the gut to gluten. Gluten is part of certain foods-mainly foods made from wheat, barley and rye. Various symptoms can develop including tummy (abdominal) pains, tiredness and weight loss. The cause is a sensitivity to gluten. Gluten occurs in common foods including wheat, barley and rye, and any foods made from these such as bread, pasta and biscuits. Some people with coeliac disease are also sensitive to oats. People with coeliac disease make antibodies against gluten."}, {"url": "http://www.nhs.uk/conditions/Coeliac-disease/Pages/Introduction.aspx", "passage_text": "Coeliac disease isn't an allergy or an intolerance to gluten. In cases of coeliac disease, the immune system mistakes substances found inside gluten as a threat to the body and attacks them. This damages the surface of the small bowel (intestines), disrupting the body's ability to absorb nutrients from food. There is no cure for coeliac disease, but switching to a gluten-free diet should help control symptoms and prevent the long-term consequences of the disease. Even if symptoms are mild or non-existent, it is still recommended to change your diet, as continuing to eat gluten can lead to serious complications."}, {"url": "http://www.coeliac.org.au/coeliac-disease/", "passage_text": "In people with coeliac disease (pronounced ‘seel-ee-ak’ and spelt celiac in some countries) the immune system reacts abnormally to gluten (a protein found in wheat, rye, barley and oats), causing small bowel damage. A first degree relative (parent, sibling, child) of someone with coeliac disease has about a 10% chance of also having the disease. If one identical twin has coeliac disease there is an approximate 70% chance that the other twin will also have coeliac disease (but may not necessarily be diagnosed at the same time)."}, {"url": "http://www.ncbi.nlm.nih.gov/pubmedhealth/PMH0001280/", "passage_text": "About Celiac Disease. Celiac disease is a digestive disease that damages the small intestine and interferes with absorption of nutrients from food. People who have celiac disease cannot tolerate gluten, a protein in wheat, rye, and barley. Gluten is found mainly in foods but may also be found in everyday products such as medicines, vitamins, and lip balms. When people with celiac disease eat foods or use products containing gluten, their immune system responds by damaging or destroying villi—the tiny, fingerlike protrusions lining the small intestine. Villi normally allow nutrients from food to be absorbed through the walls of the small intestine into the bloodstream."}, {"url": "http://www.celiac.com/", "passage_text": "Celiac disease, also known as gluten intolerance, is a genetic disorder that affects at least 1 in 133 Americans. Symptoms of celiac disease can range from the classic features, such as diarrhea, weight loss, and malnutrition, to latent symptoms such as isolated nutrient deficiencies but no gastrointestinal symptoms. "}]