[{"url": "http://www.babynamewizard.com/baby-name/boy/mattox", "passage_text": "Most new names created from surnames sound like they're ready to lounge around at prep school. This one's too busy skinning bears and catching bullets with its teeth. The name was nearly unheard of before actress Angelina Jolie chose it for her son, but hundreds of parents quickly jumped on the idea. Macho, yet surprisingly elegant. From The Baby Name Wizard by Laura Wattenberg. "}, {"url": "http://nameberry.com/babyname/Maddox", "passage_text": "Hello, Guest. Maddox, a previously obscure Welsh family name with a powerfully masculine image, suddenly came into the spotlight when Angelina Jolie chose it for her son in 2003. By the following year it was in the middle of the Top 1000, and by 2014 had reached Number 163, with more than two thousand baby boys inheriting the name. "}, {"url": "http://www.meaning-of-names.com/english-names/mattox.asp", "passage_text": "Meaning of Mattox. English name. In English, the name Mattox means-gods gift.The name Mattox originated as an English name. The name Mattox is a unisex name and can be used for a boy or girl name (male or female). English Name Meaning-gods gift. Origin-England"}, {"url": "http://www.thenamemeaning.com/mattox/", "passage_text": "Instead, we recommend that you pay a greater attention to the origin and meaning of the name Mattox. Read our baby name articles for useful tips regarding baby names and naming your baby. If you are thinking of giving your baby the beautiful name Mattox, spread the love and share this with your friends. If you consider naming your baby Mattox we recommend you take note of the special meaning and history of the name as your baby’s name will play a big role in its life and your baby will hear it spoken every day."}, {"url": "http://www.babynamespedia.com/meaning/Mattox/m", "passage_text": "[ 2 syll. mat-tox, ma-tt-ox ] The baby boy name Mattox is also used as a girl name. Its pronunciation is M AE TAHKS †. Mattox is derived from Hebrew origins. Mattox is a variant of the name Matthew (English). Mattox is infrequently used as a baby name for boys. It is not listed in the top 1000 names. In 2012, within the group of boy names directly linked to Mattox, Matthew was the most regularly used. "}, {"url": "http://www.thenamemeaning.com/mattox/", "passage_text": "Mattox Name Meaning. The meaning of Mattox is “Sweet; A blessing from God”. Keep in mind that many names may have different meanings in other countries and languages, so be careful that the name that you choose doesn’t mean something bad or unpleasant. If you consider naming your baby Mattox we recommend you take note of the special meaning and history of the name as your baby’s name will play a big role in its life and your baby will hear it spoken every day."}, {"url": "http://www.thenamemeaning.com/mattox/", "passage_text": "Search comprehensively and find the name meaning of Mattox and its name origin or of any other name in our database. Also note the spelling and the pronunciation of the name Mattox and check the initials of the name with your last name to discover how it looks and sounds. If you consider naming your baby Mattox we recommend you take note of the special meaning and history of the name as your baby’s name will play a big role in its life and your baby will hear it spoken every day."}, {"url": "https://en.wikipedia.org/wiki/Maddox_(given_name)", "passage_text": "Maddox is a mainly male name in use in English speaking countries derived from a Welsh surname meaning son of Madoc.. Madoc or Madog was a legendary Welsh prince who in Welsh folklore sailed to the New World three hundred years before Christopher Columbus. "}, {"url": "http://www.ancestry.com/name-origin?surname=mattox", "passage_text": "You can find out where the majority of the Mattox families were living before they immigrated to the U.S and learn where to focus your search for foreign records. Immigration records can tell you an ancestor's name, ship name, port of departure, port of arrival, and destination. from the New York Passenger Lists. You can find out when most of the Mattox families immigrated to the United States. You can focus your search to immigration records dating from that era. Immigration records can tell you an ancestor's name, ship name, port of departure, port of arrival"}]