[{"url": "https://en.wikipedia.org/wiki/Glucokinase", "passage_text": "Glucokinase (EC 2.7.1.2) is an enzyme that facilitates phosphorylation of glucose to glucose-6-phosphate. Glucokinase occurs in cells in the liver, pancreas, gut, and brain of humans and most other vertebrates. 1 Glucokinase has a lower affinity for glucose than the other hexokinases. 2  Glucokinase changes conformation and/or function in parallel with rising glucose concentrations in the physiologically important range of 4–10 mmol/L (72–180 mg / dl). 3  It is half-saturated at a glucose concentration of about 8 mmol/L (144 mg/dl)"}, {"url": "http://www.merriam-webster.com/dictionary/glucokinase", "passage_text": "Medical Definition of GLUCOKINASE. : a hexokinase found especially in the liver that catalyzes the phosphorylation of glucose in metabolic processes. Definition of GLUCOKINASE. : a hexokinase found especially in the liver that catalyzes the phosphorylation of glucose. ADVERTISEMENT. noun glu·co·ki·nase \\-ˈkī-ˌnās, -ˌnāz\\"}, {"url": "http://www.diabetesgenes.org/content/glucokinase", "passage_text": "Glucokinase is a gene which plays an important role in recognising how high the blood glucose is in the body. It acts as the “glucose sensor” for the pancreas, so that when the blood glucose rises, the amount of insulin produced also increases. In people without a change in glucokinase, the blood glucose is usually around 5.5 mmol/L but in people with a change in the glucokinase gene, the fasting blood glucose is typically between 5.5 and 8mmol/L."}, {"url": "https://answers.yahoo.com/question/index?qid=20090501104224AAX1SMc", "passage_text": "· just now. Report Abuse. Hexokinase is the enzyme which phosphorylates hexose (six-carbon sugar). Glucokinase is a type of hexokinase (hexokinase IV), that specifically phosphorylates glucose (a hexose sugar) when it is present in high titre level. In the process of glycolysis in liver cells glucose is converted to glucose 6 phosphate by glucokinase (a hexokinase). It is Glucokinase that turns Glucose into Glucose-6-phosphate. And a hexokinase is an enzyme that phosphorylates a six-carbon sugar, a hexose, to a hexose phosphate."}, {"url": "http://www.proteopedia.org/wiki/index.php/Kyle_Schroering_Sandbox", "passage_text": "Glucokinase (hexokinase D) is a monomeric cytoplasmic enzyme found in the liver and pancreas that serves to regulate glucose levels in these organs. Glucokinase is used in the first step of the metabolism of glucose, during this step the phosphorylation of glucose by ATP generates glucose-6-phosphate and ADP. Glucokinase vs. Other Hexokinases: Glucokinase is unique from other hexokinase in kinetic properties and is coded by a different gene. The difference of glucokinase from the other hexokinases is that glucokinase has a lower affinity, thus a higher Km, for glucose."}, {"url": "https://en.wikipedia.org/wiki/Hexokinase", "passage_text": "A hexokinase is an enzyme that phosphorylates hexoses (six-carbon sugars), forming hexose phosphate. In most organisms, glucose is the most important substrate of hexokinases, and glucose-6-phosphate the most important product. Hexokinase can transfer an inorganic phosphate group from ATP to a substrate. Hexokinases should not be confused with glucokinase, which is a specific isoform of hexokinase."}, {"url": "http://www.uniprot.org/uniprot/P35557", "passage_text": "Catalyzes the initial step in utilization of glucose by the beta-cell and liver at physiological glucose concentration. Glucokinase has a high Km for glucose, and so it is effective only when glucose is abundant. The role of GCK is to provide G6P for the synthesis of glycogen. Pancreatic glucokinase plays an important role in modulating insulin secretion. "}, {"url": "https://en.wikipedia.org/wiki/Glucokinase", "passage_text": "Glucokinase has a lower affinity for glucose than the other hexokinases do, and its activity is localized to a few cell types, leaving the other three hexokinases as more important preparers of glucose for glycolysis and glycogen synthesis for most tissues and organs. 1 Glucokinase has a lower affinity for glucose than the other hexokinases. 2  Glucokinase changes conformation and/or function in parallel with rising glucose concentrations in the physiologically important range of 4–10 mmol/L (72–180 mg / dl). 3  It is half-saturated at a glucose concentration of about 8 mmol/L (144 mg/dl)"}]