[{"url": "http://pets.thenest.com/talcum-powder-poisonous-cats-12597.html", "passage_text": "Talcum Powder. Talcum powder is a product made from a mineral called talc; it's mostly magnesium, silicon and oxygen. In its natural form, talc may contain asbestos, although home-use talcum powders have been asbestos-free since the 1970s."}, {"url": "http://pets.thenest.com/talcum-powder-poisonous-cats-12597.html", "passage_text": "Cats should not inhale or swallow talcum powder. Talcum powder, made from the mineral talc, is the primary ingredient in baby powder, many adult topical powders and some pet grooming products. If inhaled or swallowed, talcum powder can poison a cat. Meanwhile, some studies link talcum powder and cancer, although the tests were inconclusive at the time of publication."}, {"url": "http://www.drfranklipman.com/talcum-powder-the-hidden-dangers/", "passage_text": "It’s processed from a soft mineral compound of magnesium silicate, and is called talcum powder or just talc. Talcum dusting powder is commonly used to reduce rashes and diaper irritation in babies and infants. But this practice is dangerous."}, {"url": "http://www.cancer.org/cancer/cancercauses/othercarcinogens/athome/talcum-powder-and-cancer", "passage_text": "When talking about whether or not talcum powder is linked to cancer, it is important to distinguish between talc that contains asbestos and talc that is asbestos-free. Talc that has asbestos is generally accepted as being able to cause cancer if it is inhaled. This type of talc is not used in modern consumer products."}, {"url": "http://www.babycentre.co.uk/x25006277/is-it-safe-to-use-talcum-powder-on-my-baby", "passage_text": "Our panel of health writers. It is safe, as long as you use it carefully and sparingly, and ensure your baby doesn't breathe in the powder. Talcum powder is made from tiny particles of a naturally occurring, soft mineral called talc."}, {"url": "http://www.babycentre.co.uk/x25006277/is-it-safe-to-use-talcum-powder-on-my-baby", "passage_text": "If you do want to use talc, tip a little into your hand, away from your baby, and dab it onto your baby's skin. Don't sprinkle the talc directly onto your baby. Keep the bottle of talc well away from your baby when drying her after a bath, or during a nappy change."}, {"url": "http://pets.thenest.com/talcum-powder-poisonous-cats-12597.html", "passage_text": "Talcum powder, made from the mineral talc, is the primary ingredient in baby powder, many adult topical powders and some pet grooming products. If inhaled or swallowed, talcum powder can poison a cat. Meanwhile, some studies link talcum powder and cancer, although the tests were inconclusive at the time of publication."}, {"url": "http://www.cancer.org/cancer/cancercauses/othercarcinogens/athome/talcum-powder-and-cancer", "passage_text": "Talcum powder is made from talc, a mineral made up mainly of the elements magnesium, silicon, and oxygen. As a powder, it absorbs moisture well and helps cut down on friction, making it useful for keeping skin dry and helping to prevent rashes."}]