[{"url": "http://www.businessdictionary.com/definition/mechanistic-organization.html", "passage_text": "Definition. Hierarchical, bureaucratic, organizational-structure characterized by (1) centralization of authority, (2) formalization of procedures and practices, and (3) specialization of functions. Mechanistic organization are comparatively simpler and easy to organize, but find it difficult to cope with rapid change."}, {"url": "http://study.com/academy/lesson/bureaucratic-organizations-mechanic-organic-bureacracies.html", "passage_text": "Let's review. The organizational structure refers to the type of framework a company uses to distinguish power and authority, roles and responsibilities, and the manner in which information flows through the organization. There are two basic forms of organizational structure: mechanistic and organic structures."}, {"url": "http://thelawdictionary.org/mechanistic-organization/", "passage_text": "This type of organization is hierarchical and bureaucratic. It is characterized by its (1) highly centralized authority, (2) formalized procedures and practices, and (3) specialized functions. Mechanistic organization are relatively easier and simpler to organize, but rapid change is very challenging. Contrast to organic organization."}, {"url": "http://study.com/academy/lesson/bureaucratic-organizations-mechanic-organic-bureacracies.html", "passage_text": "Mechanistic Structure. A mechanistic structure, also known as a bureaucratic structure, describes an organizational structure that is based on a formal, centralized network. The mechanistic structure is best suited for companies that operate in a stable and certain environment."}, {"url": "http://www.merriam-webster.com/dictionary/mechanistic", "passage_text": "Definition of MECHANISTIC. 1. : mechanically determined. 2. : of or relating to a mechanism or the doctrine of mechanism."}, {"url": "http://www.businessdictionary.com/definition/mechanistic.html", "passage_text": "Mechanistic theories are in opposition to philosophies such as vitalism, which claim that the behavior of a system is influenced by a separate or external quality, such as the spirit of a nation or the mood of an economy."}, {"url": "http://www.businessdictionary.com/definition/mechanistic-organization.html", "passage_text": "mechanistic organization. Hierarchical, bureaucratic, organizational-structure characterized by (1) centralization of authority, (2) formalization of procedures and practices, and (3) specialization of functions. Mechanistic organization are comparatively simpler and easy to organize, but find it difficult to cope with rapid change."}]