[{"url": "https://answers.yahoo.com/question/index?qid=20080125005704AAutE71", "passage_text": "In RV 6.45.31, the word Ganga is also mentioned, but it is not clear whether this reference is to the river. According to Hindus the river Ganga (feminine) is sacred. It is worshipped by Hindus and personified as a goddess, who holds an important place in the Hindu religion [3] [4] . Hindu belief holds that bathing in the river (especially on certain occasions) causes the forgiveness of sins and helps attain salvation. Several places sacred to Hindus lie along the banks of the river Ganga, including Haridwar and Kashi. People carry sacred water from the Ganges that is sealed in copper pots after making the pilgrimage to Kashi. It is believed that drinking water from the Ganga with one's last breath will take the soul to heaven."}, {"url": "https://answers.yahoo.com/question/index?qid=20080125005704AAutE71", "passage_text": "Best Answer: According to Hindus the river Ganga (feminine) is sacred. It is worshipped by Hindus and personified as a goddess, who holds an important place in the Hindu religion [3] [4] . Hindu belief holds that bathing in the river (especially on certain occasions) causes the forgiveness of sins and helps attain salvation. Several places sacred to Hindus lie along the banks of the river Ganga, including Haridwar and Kashi. People carry sacred water from the Ganges that is sealed in copper pots after making the pilgrimage to Kashi. It is believed that drinking water from the Ganga with one's last breath will take the soul to heaven."}, {"url": "https://en.wikiquote.org/wiki/Ganges_in_Hinduism", "passage_text": "Ganges in Hinduism, is about the river Ganges, which is considered sacred and is personified as a goddess known as Ganga. "}, {"url": "http://edenkeeper.org/2014/10/01/india-sacred-rivers/", "passage_text": "Most people recognize the Ganges River as the most sacred river in India. But Hindus also bathe in the Yamuna, Godavari, Narmada, Sindhu (Indus), and Kaveri rivers to wash away their sins. (They would bathe in the Sarasvati if it actually existed — scientists think that the river dried up thousands of years ago .). India’s Sacred Rivers: Purity and Pollution. Sunset over the Ganges River. Hinduism is an ancient and highly complex religion. Because it is practiced in so many varied ways by such a large population of people, it’s nearly impossible to give it one precise description."}, {"url": "https://en.wikipedia.org/wiki/Ganges_in_Hinduism", "passage_text": "Ganga is mentioned in the Rigveda, the earliest and theoretically the holiest of the Hindu scriptures. Ganga is mentioned in the nadistuti(Rigveda 10.75), which lists the rivers from east to west. In RV 6.45.31, the word Ganga is also mentioned, but it is not clear if the reference is to the river. Bhagavata Purana depicts the birth of the Ganges. According to Bhagavata Purana, Lord Vishnu in one of his incarnations, appeared as Vamana in the sacrificial arena of Asura King Mahabali."}, {"url": "http://hinduism.about.com/od/godsgoddesses/a/ganga.htm", "passage_text": "The Hallowed River. Hindus believe that rituals performed by the river Ganga multiply in their blessedness. The water of Ganges, called 'Gangajal' (Ganga = Ganges; jal = water), is held so sacred that holding this water in hand no Hindu dares to lie or be deceitful. Ganga originates from the Gangotri glacier at Gaumukh in the Indian Himalayas at 4,100 meters above sea level, and flows 2,525 km across northern India before meeting the Bay of Bengal in the east India and Bangladesh. As a river, the Ganga contributes to more than 25 per cent of India's total water resources."}, {"url": "https://en.wikipedia.org/wiki/Ganges_in_Hinduism", "passage_text": "In Hinduism, the river Ganges is considered sacred and is personified as a goddess known as Ganga. It is worshipped by Hindus who believe that bathing in the river causes the remission of sins and facilitates Moksha (liberation from the cycle of life and death) the water of Ganga is considered very pure. Bhagavata Purana depicts the birth of the Ganges. According to Bhagavata Purana, Lord Vishnu in one of his incarnations, appeared as Vamana in the sacrificial arena of Asura King Mahabali."}, {"url": "http://hinduism.about.com/od/godsgoddesses/a/ganga.htm", "passage_text": "Besides being a sacred river, Ganga is also worshiped as a deity in Hinduism and respectfully referred to as 'Gangaji' or 'Ganga Maiya' (Mother Ganga). Ganga originates from the Gangotri glacier at Gaumukh in the Indian Himalayas at 4,100 meters above sea level, and flows 2,525 km across northern India before meeting the Bay of Bengal in the east India and Bangladesh. As a river, the Ganga contributes to more than 25 per cent of India's total water resources."}, {"url": "http://articles.chicagotribune.com/1993-02-03/news/9303175264_1_ganges-river-fires-crackling-world-bank-reports", "passage_text": "Hindus believe the Ganges is the world's most sacred river and those who bathe in its waters achieve purity. Similarly, those whose bodies are deposited in the Ganges-whether as ashes or corpses-are believed to break the cycle of reincarnation. They become one with God. "}, {"url": "http://www.ancient.eu/Ganges/", "passage_text": "The River Ganges, also known as the Ganga, flows 2,700 km from the Himalaya mountains to the Bay of Bengal in northern India and Bangladesh. Regarded as sacred by Hindus, the river is personified as the goddess Ganga in ancient texts and art. Ritual bathing in the Ganges was and is an important part of Hindu pilgrimage and the ashes of the cremated are often spread across her waters. Described in the Mahabharata as the 'best of rivers, born of all the sacred waters', the Ganges is personified as the goddess Ganga. Ganga's mother is Mena and her father is Himavat, the personification of the Himalaya mountains."}]