[{"url": "http://www.dengue.gov.sg/subject.asp?id=12", "passage_text": "1 4. 2  The average lifespan of an Aedes mosquito in Nature is two weeks. 3  5. 4  The mosquito can lay eggs about three times in its lifetime, and about 100 eggs are produced each time. "}, {"url": "https://answers.yahoo.com/question/index?qid=20060904210239AA7MNPT", "passage_text": "Culex tarsalis may complete its life cycle in 14 days at 20 °C (68 °F) and only ten days at 25 °C (77 °F). Some species have a life cycle of as little as four days, whereas in other species some adult females can live through the winter, laying their eggs in the spring. This Site Might Help You. RE: What is the average life span of a mosquito? if the mosquito has no one to sting does that shorten its life span?does blood consumption feed the mosquito or only its young."}, {"url": "http://www.rocketswag.com/anatomy/epidemiology/mosquito/What-Is-The-Life-Expectancy-Of-A-Mosquito.html", "passage_text": "Only female mosquitoes bite because they require protein rich blood meals for their egg growth; nevertheless, both male and female mosquitoes feed on flower nectar. The majority species of an adult mosquito have life expectancy from three to four weeks. Their average life span is from 10 - 14 days. Nonetheless, if they cope to get away from predators, female mosquito species can survive to about two to three months. More Articles 1  : Facts About The Mosquito."}, {"url": "https://answers.yahoo.com/question/index?qid=20060904210239AA7MNPT", "passage_text": "Best Answer: The mosquito undergoes complete metamorphosis, going through four distinct stages in its life cycle: egg, larva, pupa, and adult — a process that was first described by the Greek philosopher Aristotle. The length of the first three stages is dependent on the species and temperature. This Site Might Help You. RE: What is the average life span of a mosquito? if the mosquito has no one to sting does that shorten its life span?does blood consumption feed the mosquito or only its young."}, {"url": "http://malheurvector.com/mosquito-faqs", "passage_text": "On average a mosquito’s life span is typically 2-3 weeks however for the lucky mosquitoes who can find a hideout for the winter such as a garage, culvert, or attic, have a chance of living for up to 6 months. Top of page. All mosquitoes require water to complete the 3 of 4 stages of their life cycle. "}, {"url": "http://www.rocketswag.com/anatomy/epidemiology/mosquito/What-Is-The-Life-Expectancy-Of-A-Mosquito.html", "passage_text": "By and large mosquitoes survive anywhere from four days to a month depending upon temperatures and adjustment to its circumstances. Their average life span is from 10 - 14 days. Nonetheless, if they cope to get away from predators, female mosquito species can survive to about two to three months. More Articles 1  : Facts About The Mosquito. 2  How Long Do Mosquitos Live. 3  Mosquito Bite Itch Remedy"}, {"url": "http://www.buzzle.com/articles/lifespan-of-a-mosquito.html", "passage_text": "The average lifespan, including all four stages, depends largely on the temperature mosquito is in. On an average, female mosquitoes are known to live anywhere between 15 to 50 days, while the male mosquito is known to live anywhere between 15 to 25 days. The females of the species fly into this swarm and mate. The lifespan of a male mosquito is less than the lifespan of a female mosquito. The males live for about a week, feeding on nectar from plants. The females live for about 15 to 18 days, feeding on blood. Usually the female feeds herself on blood and then rests for a few"}, {"url": "http://www.answers.com/Q/How_long_is_the_life_span_of_a_mosquito", "passage_text": "Yes, a grasshopper's life cycle consists of three stages (Egg-Nymph-Adult) and one life cycle is completed in about 12 months which means that a grasshopper lives for about … one year on an average. A mosquito on the other hand has four stages in its life span (Egg, Larva, Pupa and Adult). A female adult mosquito is expected to live for 3-100 days. A male however, live for only about 10-20 days. There are four stages to a mosquitoes live. These are egg, larval, pupa and adult. The total time it takes for a mosquito to go through all four stages depends greatly on both temperature and species. In a typically warm weather, the life cycle takes 14 days or less, but it can vary from 4 to 30 days."}]