[{"url": "http://www.acronymfinder.com/Slang/BBU.html", "passage_text": "The World's most comprehensive professionally edited abbreviations and acronyms database. All trademarks/service marks referenced on this site are properties of their respective owners. The Acronym Finder is ©1988-2015, Acronym Finder, All Rights Reserved. "}, {"url": "http://www.askmefast.com/What_does_the_text_bbu_meani_am_not_good_with_text_slang-qna7321987.html", "passage_text": "What does the text bbu meani am not good with text slang? 1  33% - I receive a square in a text message from an ipone what does this meani have a samsung? 2  66% - What does rbi mean in text slang? 3  64% - What does ldc mean in text slang? 4  47% - Hello! what does `bet` mean in the slang? like text messaging? 5  65% - What dose kk mean in text slang? 6  63% - ... 1. 1. That means part exchange or post exchange. In terms of military base, it means convenience store. That is the short term for the post exchange. It is among the g hoods on the mtl."}, {"url": "http://www.exfo.com/glossary/baseband-unit", "passage_text": "Baseband Unit (BBU). Baseband refers to the original frequency range of a transmission signal before it is modulated. Baseband can also refer to a type of data transmission in which digital or analog data is sent over a single non-multiplexed channel. A baseband unit (BBU) is a unit that processes baseband in telecomm systems. A typical wireless telecom station consists of the baseband processing unit and the RF processing unit (remote radio unit-RRU)"}, {"url": "http://www.exfo.com/glossary/remote-radio-unit", "passage_text": "Remote Radio Unit (RRU). A remote radio unit (RRU) in a radio base station system can include a cyclic prefix (CP) module with a CP adder for downlink channel processing and a CP remover for uplink channel processing. "}, {"url": "http://www.exfo.com/glossary/baseband-unit", "passage_text": "A BBU in a cellular telephone cell site is comprised of a digital signal processor to process forward voice signals for transmission to a mobile unit and to process reverse voice signals received from the mobile unit. Baseband can also refer to a type of data transmission in which digital or analog data is sent over a single non-multiplexed channel. A baseband unit (BBU) is a unit that processes baseband in telecomm systems."}, {"url": "http://serverfault.com/questions/114547/what-is-a-raid-controller-bbu-for", "passage_text": "I am wondering what's the purpose of a BBU. My first understanding was, that it enables the cache to write the data to the disc during a power failure. But some specifications say that a BBU can hold its data for up to 72h. For this reason, RAID-5 controllers are equipped with their own caches. What the RAID controller does is it writes the data to its cache instead and LIES to the OS, telling it that it committed the data to disk whereas the data is actually still in RAID cache."}, {"url": "http://www.acronymfinder.com/BBU.html", "passage_text": "The World's most comprehensive professionally edited abbreviations and acronyms database. All trademarks/service marks referenced on this site are properties of their respective owners. The Acronym Finder is ©1988-2015, Acronym Finder, All Rights Reserved. "}, {"url": "http://acronyms.thefreedictionary.com/BBU", "passage_text": "3900  to their offering. Huawei W-CDMA/HSPA Baseband Unit WD2BBBUC-HERT BBU Model BBU3900 by PR Newswire Europe. 9, 2014 /PRNewswire/ -- Research and Markets has announced the addition of EJL Wireless Research's new report Huawei W-CDMA/HSPA Baseband Unit WD2BBBUC-HERT. "}, {"url": "http://serverfault.com/questions/114547/what-is-a-raid-controller-bbu-for", "passage_text": "All the BBU does is keep the data in the cache until you restart the computer. The controller knows what has been flushed out to disk (the disk signals that the operation has been finished). Anything not flushed out to disk is preserved until the machine is restarted. – ConcernedOfTunbridgeWells Feb 19 '10 at 20:12. For this reason, RAID-5 controllers are equipped with their own caches. What the RAID controller does is it writes the data to its cache instead and LIES to the OS, telling it that it committed the data to disk whereas the data is actually still in RAID cache."}]