[{"url": "https://answers.yahoo.com/question/index?qid=20100225142535AAOQhrW", "passage_text": "Stuff with the onion and rosemary. Place chicken in a 9x13 inch baking dish or roasting dish. 3. Roast in the preheated oven for 2 to 2 1/2 hours, or until chicken is cooked through and juices run clear. Cooking time will vary a bit depending on the size of the bird. ======================================... CheddarCheese · 6 years ago. Thumbs up. 0."}, {"url": "http://community.tasteofhome.com/community_forums/f/29/p/176779/2415416.aspx", "passage_text": "Baking your Chicken Legs... Preheat the oven to 400°F. Bake the chicken, uncovered, for 35 to 40 minutes or until the chicken is no longer pink inside. You can bake the chicken legs in a 375°F. oven, if desired. Increase the baking time to 45 to 50 minutes. "}, {"url": "http://www.answers.com/Q/What_temperature_to_bake_a_small_chicken", "passage_text": "The best temperature for baking chicken is 350 degrees F. Bake for 45 minutes before testing for doneness by poking with a fork or knife. If the juices run clear, chicken is d … one; if juices run pinkish, more baking is required. 400 degrees for 15 minutes to brown then reduce heat to 350 for another 15-20 minutes. Chicken is done when you pierce the meat with a fork, press on it and the juices are cle … ar, not red or pink. + 31 others found this useful. Su Su Htain."}, {"url": "https://answers.yahoo.com/question/index?qid=20091019144029AAwhd4C", "passage_text": "I would strongly suggest that you use a meat thermometer. A 2 lb chicken can roast within 40 minutes or less depending on the temperature, but it's very important that it reach 165 degrees F. Tie the legs and wings up close to the bird, otherwise they will finish cooking before the breast and thighs do. Rating Newest Oldest. Best Answer: Place chicken on a rack (cake rack or something), add about a cup of water to the roasting pan, place rack in pan, cook in oven pre-heated to 350deg F for 25 min/pound. Chicken will be crisp-skinned and delightfully juicy inside. Source(s): BigTone · 6 years ag"}, {"url": "http://www.answers.com/Q/What_temperature_to_bake_a_small_chicken", "passage_text": "Roast the chicken in the oven for 15 minutes. Reduce the  temperature to 375°F and continue roasting until the juices run  clear and a thermometer inserted into the inner t … high (but not  touching the bone) registers 165°F, about 50 minutes to 1  hour more. 400 degrees for 15 minutes to brown then reduce heat to 350 for another 15-20 minutes. Chicken is done when you pierce the meat with a fork, press on it and the juices are cle … ar, not red or pink. + 31 others found this useful. Su Su Htain."}, {"url": "http://healthyrecipesblogs.com/2011/08/09/how-to-bake-chicken-breast/", "passage_text": "The secret to juicy baked chicken breast? Bake for a short time at a high temperature. Baking for 30 minutes at 350 degrees will yield dry meat. But baking for just 20 minutes at 450 degrees will result in delightfully juicy baked chicken breast, every time. Baked Chicken Breast."}, {"url": "http://www.livestrong.com/article/437164-how-to-cook-a-small-whole-chicken/", "passage_text": "Step 5. Roast the chicken for one hour. Remove a corner of the foil and insert a meat thermometer into the breast of the chicken without touching any of the bones. Replace the foil if the thermometer does not register at least 165 degrees and cook for an additional 15 minutes before testing the temperature again. Step 9. Close the grill cover and allow the chicken to cook for 10 to 15 minutes. Turn the chicken and grill for an additional 10 minutes before checking the temperature with a meat thermometer in the thickest part of the breast and thigh."}, {"url": "http://www.answers.com/Q/What_temperature_to_bake_a_small_chicken", "passage_text": "At 300F I bake a chicken for 1/2 hour per pound. At 350F I bake it for 20 minutes per pound. Always test it before preparing to serve it, stabbing the thigh meat, the juices s … hould run clear, and no pinkness or redness. Or with a meat thermometer it should read at least 165F. 400 degrees for 15 minutes to brown then reduce heat to 350 for another 15-20 minutes. Chicken is done when you pierce the meat with a fork, press on it and the juices are cle … ar, not red or pink. + 31 others found this useful. Su Su Htain."}]