[{"url": "http://energy.gov/energysaver/articles/15-ways-save-your-water-heating-bill", "passage_text": "1 Install heat traps on your water heater tank. 2  You could save $15–$30 on your water heating bill. 3  You may need a professional to help you install them on your existing tank, but some new storage water heaters include heat traps. 4  Learn more about heat traps. 5  Insulate your hot-water storage tank."}, {"url": "https://www.bchydro.com/news/conservation/2013/winter-electric-heating-efficiency.html", "passage_text": "The fact is that most portable space heaters use a lot of energy, so if the room you're trying to heat is large, or you have multiple heaters in multiple rooms, you could see big changes on your bill."}, {"url": "http://www.consumerenergycenter.org/residential/appliances/waterheaters.html", "passage_text": "A decade ago 25 percent of our home energy dollars typically went to heating water; today the Department of Energy claims water heating accounts for about 18 percent of your utility bill. Water heaters last 10 to 15 years on average."}, {"url": "https://tankless-water-heaters.com/Gas-Electric.html", "passage_text": "Over time, the gas tankless heater’s heat exchanger will scale resulting in a loss of efficiency. If you spent $600 more for the gas model than the electric, you would have to save $30 a year for 20 years just to make up this difference. That’s unlikely to happen."}, {"url": "http://energy.gov/energysaver/articles/15-ways-save-your-water-heating-bill", "passage_text": "1 You could save $15–$30 on your water heating bill. 2  You may need a professional to help you install them on your existing tank, but some new storage water heaters include heat traps. 3  Learn more about heat traps. 4  Insulate your hot-water storage tank."}, {"url": "http://energy.gov/articles/you-asked-we-are-answering-your-home-efficiency-questions", "passage_text": "Most central air conditioning units last about 20 years. At 12 years old, your air conditioning unit is passing its mid-life point. Even if your air conditioner is only 10 years old, you may save 20-40 percent of your cooling energy costs by replacing it with a newer, more efficient model."}, {"url": "https://www.bchydro.com/news/conservation/2013/winter-electric-heating-efficiency.html", "passage_text": "Being smart with your heat will save energy and save money. It's no secret that most of us use more energy in the winter. And if your home is heated electrically, you'll likely see big changes in your electricity bill for the winter months compared to summer. That might be true even if your home has a gas furnace."}, {"url": "https://www.energystar.gov/index.cfm?c=heat_cool.pr_checklist_consumers", "passage_text": "Your furnace or boiler is more than 15 years old. Consider replacing with an ENERGY STAR qualified furnace, which is 15% more efficient than a conventional furnace. If you have a boiler, consider replacing with an ENERGY STAR qualified boiler that is 5% more efficient than a new, standard model."}]