[{"url": "http://www.lifehack.org/articles/money/5-real-ways-actually-make-money-online.html", "passage_text": "1 eBay – Of course you can’t read an article about making money online that doesn’t mention eBay. 2  You can start an eBay store and get serious about it or you can just sell some stuff to declutter your home. 3  Either way, I’ve made my fair share from selling on eBay and it’s still a popular way to earn money."}, {"url": "http://www.today.com/money/cash-12-ways-earn-extra-money-online-2D79417746", "passage_text": "At Associated Content there are three ways to earn money: Upfront payments for content you write ($2 to $15 per article), assigned articles ($10 to $100 per article) and performance payments ($1.50 for every 1,000 page views of your article if it’s posted online)."}, {"url": "http://www.khaimun.com/how-to-make-money-online-for-free/", "passage_text": "Of course there are tons of ways to make money online. This post only shows you two recession-proof ways to make money online for free. You can also refer to the chart above and see whether you are a specialized expert in any of the in-demand skills listed."}, {"url": "http://www.lifehack.org/articles/money/5-real-ways-actually-make-money-online.html", "passage_text": "There are legitimate ways to make money online. The problem is that the real ways to make money aren’t “get rich quick” schemes. Most of them require a lot of work and sometimes a lot of dedication before seeing a return on your time. But if you really want to make money online, work from home or turn an idea into a business, you can do it. You can even earn money with apps if you don’t want to venture all the way to the computer. I’m going to tell you about all kinds of"}, {"url": "http://abcnews.go.com/Business/real-ways-make-money-online-home/story?id=17671102", "passage_text": "Email. It pays to cast your financial net online, where possibilities abound. Monetizing your expertise -- whether in social networking or transcribing -- is one way to make money while sitting at your computer at home. But others also are popping up, such as taking online surveys or even predicting election results. The good part: You don't have to pay a dime."}]