[{"url": "http://finance.zacks.com/much-gift-can-give-someone-buy-house-1616.html", "passage_text": "If your generosity qualifies as a gift with the IRS, you'll have to pay taxes twice on the amount that exceeds the exclusion: once in income tax, then again for the federal gift tax. The 2012 federal gift tax rate is 35 percent. Exclusions. The entire $50,000 you give isn't vulnerable to taxation. The IRS allows exclusions, a dollar limit you can give away tax-free. As of the 2012 tax year, the exclusion amount is $13,000 for each person you make a gift to."}, {"url": "http://www.moneyunder30.com/gift-tax", "passage_text": "In 2015, a taxpayer can give up to $14,000 per person per year without being taxed on the gift. For example, this year you could give Friend A $14,000, Friend B $14,000, and your sister $14,000 and not be taxed on your gifts. "}, {"url": "https://answers.yahoo.com/question/index?qid=20070727102006AAabapQ", "passage_text": "· just now. Report Abuse. If you received a gift, you don't have to report it for income tax purposes no matter how much it was. If you gave gifts of over $12,000 in one year to any one person, then you have to file a gift tax return, and might have to pay a gift tax on it. Judy · 8 years ago. Thumbs up"}, {"url": "https://answers.yahoo.com/question/index?qid=20080603233755AA7dVW2", "passage_text": "The person who receives your gift or your estate will not have to pay any federal gift tax or estate tax because of it. Also, that person will not have to pay income tax on the value of the gift or inheritance received: Basically your parents can each give you a gift tax free gift of $12,000. I would figure that when you receive the money just file it as a gift when you fill out your normal income taxes."}, {"url": "https://answers.yahoo.com/question/index?qid=20080603233755AA7dVW2", "passage_text": "Best Answer: 1. The receiver of the gift does not pay any tax. So you can receive gift of any amount without filing gift tax return. 2. If your parents are U.S. citizen or resident, then they can each give a gift of $12,000 in a year to any number of persons without any gift tax. So both parents can give you $24,000 in a year. Also, that person will not have to pay income tax on the value of the gift or inheritance received: Basically your parents can each give you a gift tax free gift of $12,000. I would figure that when you receive the money just file it as a gift when you fill out your normal income taxes."}, {"url": "http://blog.taxact.com/gift-tax-do-i-have-to-pay-gift-tax-when-someone-gives-me-money/", "passage_text": "That still doesn’t mean they owe gift tax. For example, say someone gives you $20,000 in one year, and you and the giver are both single. The giver must file a gift tax return, showing an excess gift of $6,000 ($20,000 – $14,000 exclusion = $6,000). Each year, the amount a person gives other people over the annual exclusion accumulates until it reaches the lifetime gift tax exclusion. The person who makes the gift files the gift tax return, if necessary, and pays any tax. If someone gives you more than the annual gift tax exclusion amount ($14,000 in 2015), the giver must file a gift tax return."}, {"url": "http://www.catalogs.com/info/how-to/do-i-have-to-report-cash-gifts-to-the-irs.html", "passage_text": "If you give a cash gift: As of in 2007, with few exceptions, you can give up to $12,000 each to any number of people and none of the gifts will be taxable, nor will you have to file a 709 Gift Tax form. As of 2007, the unified lifetime credit for gifts was $345,800. That means up to $345,800 in taxes otherwise owed for gifts is exempt from payment. This is a lifetime, and not an annual amount once that credit is used in full, gift taxes over the annual exclusion will result in tax liabilities."}, {"url": "http://finance.zacks.com/can-taxed-money-gifts-abroad-7760.html", "passage_text": "Reporting a Gift. The IRS does not require you to pay tax on a gift, but you might still be required to report the money. You must complete Form 3520, an informational return, to inform the IRS of the bequest if the gift is more than $100,000 and from a foreign estate or a nonresident alien. If you receive the gift with the expectation of performing a service, the money is income, not a gift. In such a case, complete Form 2555, attach the form to your tax return and report the foreign income as Other income on Form 1040."}, {"url": "http://www.nydailynews.com/new-york/money-pros-large-cash-gift-considered-income-reported-irs-article-1.1237806", "passage_text": "The person receiving the gift does not report it. Technically, relatively small gifts can completely avoid gift tax. Any one person can gift someone up to the allowable annual exclusion, which is $13,000 for 2012 ($14,000 in 2013), and not incur a tax or any filing requirement. Anything over that amount is possibly subject to a tax and needs to be reported on Form 709, the Gift Tax Return. A married couple that consents to split gifts of over $13,000 in 2012 ($14,000 in 2013) to any one person must report this on a gift tax return. By splitting their gifts, married couples can give up to twice the amount tax-free."}, {"url": "http://finance.zacks.com/can-taxed-money-gifts-abroad-7760.html", "passage_text": "The Internal Revenue Service taxes gifts differently than income. If you receive a gift of money from someone living abroad, how the money is reported to the IRS depends on the amount and the residency of the giver. Gifts under $14,000 a year are excluded from federal income taxes as of 2013. If you receive the gift with the expectation of performing a service, the money is income, not a gift. In such a case, complete Form 2555, attach the form to your tax return and report the foreign income as Other income on Form 1040."}]