[{"url": "http://www.ign.com/articles/2014/07/22/heres-how-much-money-game-developers-make", "passage_text": "The average game developer in the U.S. earned just over $83,000 USD in 2013, while Canadian and European based developers averaged a salary of $71,000 USD (up 9 percent from 2012) and $46,000 USD (no change), respectively. How to Thank a Game Developer-Podcast Beyond. 04:19. We want to hear it. Audio professionals and programmers followed closely behind, each earning average salaries of over $90,000 USD. Solo indie developers experienced a 49 percent drop in salary, while the average salary for developers belonging to indie teams shot up a staggering 161 percent."}, {"url": "http://work.chron.com/much-money-developer-make-2876.html", "passage_text": "The survey of design salaries for 2011 makes a distinction between web developer and web designer salaries. The average web developer pay in the design industry for 2011 was $60,000, with the average web designer pay at $52,000. With employment at 19,250 jobs, Florida comes next, but the average annual salary is lower at $67,300. The state of New York rounds out the top five in number of web developer jobs at 18,840, earning an average annual pay of $89,650."}, {"url": "https://answers.yahoo.com/question/index?qid=20100422210828AAHYJlT", "passage_text": "Asker's rating. Report Abuse. Real estate developers are much like anyone who works on 100% commission in the sense that their income is only as good as how well he/she does hes/her job. There is no salary range because a real estate developer is not a salaried position. "}, {"url": "http://tech.co/much-software-developer-make-every-state-2015-03", "passage_text": "North Dakota offers the lowest salary: Software developers there earn $64,890 per year. In South Carolina, they take home $71,610 each year. Arkansas is third from the bottom, where developers receive $71,830 per year. 0 Shares. The median pay for software developers in the United States is $93,350 per year, more than the annual wage for all workers. But how high salaries get is contingent on what state they live and work. Fixr, an online marketplace for services, used federal data to give a snapshot of software development wages in each state"}, {"url": "http://www.dwuser.com/education/content/earning-more-money-as-a-freelance-web-developer-designer/", "passage_text": "Average Salaries. There's no exact answer for how much money a freelance web developer can make-there are several factors that will determine a person's salary. According to salary.com, the median salary (for employees) ranges from about $51,000 to about $76,000 USD depending on level of experience"}, {"url": "http://money.usnews.com/careers/best-jobs/web-developer/salary", "passage_text": "Salary Outlook. The BLS reports that Web developers made a median salary of $63,160 in 2013. The highest-paid in the profession earned $110,350, while the lowest-paid earned $33,320 that year. Computer systems design and information services employ the largest share of Web developers in the field. "}, {"url": "http://www.ehow.com/info_10066382_much-money-developer-make.html", "passage_text": "The average Web developer made $79,370 a year, as of 2010, according to the Bureau of Labor Statistics. Salaries started at less than $43,190 for developers in the 10th percentile and less than $57,240 for those in the 25th percentile, with the median income at $75,660. Web developers in the 75th percentile earned over $97,660 a year, while those in the 90th percentile made more than $119,940 a year. Web developers working independently in the industry of technical consulting services earned an average of $86,740 a year, while those working for insurance carriers earned an average of $78,450."}, {"url": "http://work.chron.com/much-money-developer-make-2876.html", "passage_text": "Texas and Virginia boast large numbers of web developer jobs with 21,030 and 20,530 respectively. Developers in Texas earn an average of $83,530 per year, with those in Virginia earning $93,130. With employment at 19,250 jobs, Florida comes next, but the average annual salary is lower at $67,300. The state of New York rounds out the top five in number of web developer jobs at 18,840, earning an average annual pay of $89,650."}]