[{"url": "http://www.steadyhealth.com/topics/singulair-and-weight-gain", "passage_text": "Singulair can be taken with or without food. Singulair side effects are usually mild and they vary depending on the age of a patient. The most common side effects from taking Singulair are headache, soar throat, ear infection, respiratory infection, abnormal dreams, abdominal pain, fever, flu etc. But, we have noticed that many patients taking this medication have problems with weight gain, like in your case. However, weight gain is not listed as a side effect of taking Singulair. Maybe your eating habits have changed since you started taking this medicine. You should go to your doctor so that he can examine you and determine what is the cause for your weight gain. After a weight gain of 15-20 pounds, I discussed with my physician and was told that Singulair should not cause ANY weight gain. Through a series of changing my meds around (not recommended), I have come to the conclusion that Singulair has been the cause of this extra weight."}, {"url": "http://allergies.emedtv.com/singulair/singulair-and-weight-gain.html", "passage_text": "Therefore, if you are taking the medication and notice an increase in your weight, try increasing the amount of exercise you get and decreasing your alcohol intake. There are a number of possible side effects with Singulair ® (montelukast sodium). Weight gain, however, does not appear to be one of them. This conclusion is based on the results of clinical trials, where Singulair was extensively studied and side effects were documented. For people taking Singulair, weight gain was not reported as either a common or rare side effect. If you are noticing an unexplained increase in weight while taking Singulair, there are some things that you can do."}, {"url": "http://www.livestrong.com/article/460984-singulair-weight-loss/", "passage_text": "Singulair side-effects do not include direct weight loss or weight gain. Side effects that may occur include headache, weakness, tiredness, trouble sleeping, cough, dizziness, indigestion, nausea or stomach upset and a stuffy nose. Some of these side effects, such as tiredness or weakness, may interfere with the exercise regimen you use for weight loss. If such side effects are persistent, contact your doctor, recommend the experts at Drugs.com. Severe side effects also are possibl"}, {"url": "http://allergies.emedtv.com/singulair/singulair-and-weight-gain.html", "passage_text": "In clinical studies, gaining weight while taking Singulair was not reported as a possible side effect. There are a number of possible side effects with Singulair ® (montelukast sodium). Weight gain, however, does not appear to be one of them. This conclusion is based on the results of clinical trials, where Singulair was extensively studied and side effects were documented. For people taking Singulair, weight gain was not reported as either a common or rare side effect. If you are noticing an unexplained increase in weight while taking Singulair, there are some things that you can do."}, {"url": "http://www.rxlist.com/singulair-side-effects-drug-center.htm", "passage_text": "Singulair is available as oral tablets, oral granules, or chewable tablets. Side effects of Singulair can include skin rash, mood changes, tremors, headache, stomach pain, heartburn, upset stomach, nausea, diarrhea, tooth pain, tiredness, fever, stuffy nose, sore throat, cough, and hoarseness. Singulair may interact with phenobarbital or rifampin. Less serious side effects may include: 1  headache; 2  stomach pain, heartburn, upset stomach, nausea, diarrhea; 3  tooth pain; 4  tired feeling; 5  fever, stuffy nose, sore throat, cough, hoarseness; or."}, {"url": "http://www.steadyhealth.com/topics/singulair-and-weight-gain?page=2", "passage_text": "I never was told about this potential side effect but was put on it after being admitted to the hospital with my asthma for two days back in late April, was also on Prednisone IV for those two days and then for two weeks after, as well as three other puffers and Singulair. I too went on singulair last year and have gained 10 pounds. I lost almost 70 pounds five years ago and have stuck around the same weight since then...until now. I noticed in my pants and back...I can't zip up any of my dresses anymore. I can understand a pound or two of gain from eating...but not 10 in five months."}, {"url": "http://www.everydayhealth.com/drugs/singulair", "passage_text": "Singulair is indicated for the treatment of asthma and allergies. Common side effects reported with Singulair include headache, upset stomach, nausea and diarrhea, tiredness, sore throat and cough. A search of prescribing information for Singulair did not specifically list weight gain as a side effect. Most people who use Singulair do not have serious side effects. Singulair does have some common side effects that should decrease or go away in time. These include: 1  Headache. 2  Stomach pain, heartburn, upset stomach, nausea, diarrhea. 3  Tooth pain. 4  Tired feeling. 5  Dizziness. 6  Fever, stuffy nose, sore throat, cough, hoarseness. 7  Mild rash"}, {"url": "https://www.healthtap.com/topics/singulair-and-weight-gain", "passage_text": "If you are exercising but also eating more, you will gain weight. Try exercising 30 min a day -- brisk walking, biking, or swimming. Also try to eat 3 sensible meals a day, with more fruits, veg; and less carbs and fat. Drink plenty of water. "}]