[{"url": "http://home.costhelper.com/electricians.html", "passage_text": "1 Although there are still a few low-cost areas where electricians work for $30-$50 an hour, typically they charge $50-$100 an hour or more depending on local rates and their qualifications. 2  Some electricians quote a flat fee per job rather than an hourly rate, depending on the scope and type of work to be performed."}, {"url": "http://www.payscale.com/research/US/Job=Electrician_Journeyman/Hourly_Rate", "passage_text": "Chicago is home to an above-average pay rate for Electrician Journeymans, 64 percent higher than the national average. Electrician Journeymans will also find cushy salaries in New York (+44 percent), Seattle (+29 percent), Boston (+22 percent), and Los Angeles (+16 percent)."}, {"url": "http://www.ehow.com/info_7749018_average-hourly-rate-electrician.html", "passage_text": "The average hourly wage of electricians nationwide was $25.75 as of May 2013, according to the U.S. Bureau of Labor Statistics. This comes to $53,560 annually for full-time work. Eighty percent of electricians earned between $14.74 and $40.32 per hour in 2013. Nearly all electricians have full-time jobs."}, {"url": "http://work.chron.com/much-electricians-typically-charge-per-hour-6397.html", "passage_text": "According to the Bureau of Labor Statistics, the mean annual wage for an electrician was $52,910 as of May 2011. This worked out to $25.44 an hour, and the best paid -- or busiest -- electricians could earn the equivalent of $39.75 an hour or more if they were in the top 10 percent of earners."}, {"url": "http://www.payscale.com/research/US/Job=Electrician_Journeyman/Hourly_Rate", "passage_text": "(United States). Very much a male-dominated career in the United States, Electrician Journeymans earn an average of $22.33 per hour. Geographic location is the biggest factor affecting pay for this group, followed by tenure and the specific company."}, {"url": "http://work.chron.com/much-electricians-typically-charge-per-hour-6397.html", "passage_text": "Average Charges. Professional electricians may actually charge anywhere from $40 to $100 an hour, depending on the job and the skill level of the person performing it. For instance, a licensed journeyman averaged a $54.39 per hour charge for residential work as of 2012, according to the Top Electricians website. If an apprentice electrician is sent to perform a simpler job, the charge may be lower, with an average of $39.79 an hour."}, {"url": "http://www.ehow.com/info_7749018_average-hourly-rate-electrician.html", "passage_text": "In 2013, building equipment contractors were the biggest employer of electricians, according to the BLS. Their average hourly wage in this industry was $25.47, just pennies less than the overall national average. The second-largest employer was local government, paying an average hourly rate of $28.68."}]