[{"url": "http://www.babycenter.com/0_baby-sleep-training-night-weaning_1505721.bc", "passage_text": "Find out common causes of night wakings such as terrors, and how you can help your baby when she does wake up. Baby sleep training: The basics. How and when to teach your baby healthy sleep habits, your sleep training options, and what the experts say about sleep trainin... Babies who are used to eating several times a night tend to wake up out of habit, and it can take time to change this routine. It's hard to maintain your own health and well-being if you're chronically sleep deprived. So the decision to end to your baby's night feeding depends in part on how it's affecting you."}, {"url": "http://www.babycenter.com/0_baby-sleep-training-night-weaning_1505721.bc", "passage_text": "If your baby's at least 4 to 6 months old, you can probably begin to wean her from nighttime feedings. Of course, even if your baby doesn't need to eat in the middle of the night, she may still wake up wanting to. Babies who are used to eating several times a night tend to wake up out of habit, and it can take time to change this routine. It's hard to maintain your own health and well-being if you're chronically sleep deprived. So the decision to end to your baby's night feeding depends in part on how it's affecting you."}, {"url": "http://healthysleep.med.harvard.edu/healthy/getting/overcoming/tips", "passage_text": "#7 Keep Your Internal Clock Set with a Consistent Sleep Schedule. Going to bed and waking up at the same time each day sets the body’s internal clock to expect sleep at a certain time night after night. Try to stick as closely as possible to your routine on weekends to avoid a Monday morning sleep hangover. #5 Don’t Be a Nighttime Clock-Watcher. Staring at a clock in your bedroom, either when you are trying to fall asleep or when you wake in the middle of the night, can actually increase stress, making it harder to fall asleep."}, {"url": "http://wellnessmama.com/4936/improve-sleep-naturally/", "passage_text": "To help improve your chances of quality sleep, these are the best foods to consume: 1  Healthy Fats – such as coconut oil, organic and pasture raised meats, eggs, avocado and butter all help provide your body with the necessary building blocks to manufacture sleep hormones. "}, {"url": "http://www.stop-being-tired.com/tiredness-and-sleep/stop-waking-up", "passage_text": "Many people have problems with waking up in the middle of the night and then being unable to get back to sleep. This can lead to a difficult day ahead, as well as increasing your fatigue. Find out how you can deal with this problem and improve the quality of your sleep. In order to sleep well, it is worth creating some good sleeping habits. Plan to: 1  Try to go to bed and get up at the same time every day as this will set your body into a positive pattern of expectation. 2  Don’t take caffeine (coffee, tea, colas etc) after 4 pm as this can increase wakefulness."}, {"url": "http://healthysleep.med.harvard.edu/healthy/getting/overcoming/tips", "passage_text": "Also, if a pet regularly wakes you during the night, you may want to consider keeping it out of your bedroom. It may help to limit your bedroom activities to sleep and sex only. Keeping computers, TVs, and work materials out of the room will strengthen the mental association between your bedroom and sleep. #5 Don’t Be a Nighttime Clock-Watcher. Staring at a clock in your bedroom, either when you are trying to fall asleep or when you wake in the middle of the night, can actually increase stress, making it harder to fall asleep."}, {"url": "http://www.fertilityfriend.com/Faqs/Night-Waking.html", "passage_text": "If you have to get up in the night and it is unavoidable, like having to take care of a small child, or if you have to go to the bathroom, just do the best you can. Some women notice rocky temperatures when they wake during the night while some women notice little impact. If waking in the night is an issue, take your BBT as close as you can to the same time each morning and choose a time that is likely to be when you have had the most sleep. For example, if your toddler wakes up every morning at 6 am, then take your temperature at that time, even if you go back to sleep"}]