[{"url": "http://www.booksourcemagazine.com/story.php?sid=105", "passage_text": "(Ibid., p.505). It needs no ghost come from the grave (not that I am one yet or coming from there now) to suppose that a writer as prolific and popular as P.G. Wodehouse must have, over a period of seventy years, attracted the attention of other writers. Some such attention is almost too well-known to mention: Hilaire Belloc’s statement in a U.S. radio broadcast that “P.G. Wodehouse is the best writer of English now alive,” Evelyn Waugh’s definitive observation in a B.B.C. broadcast that “Mr. Wodehouse’s idyllic world can never stale. A writer who once wanted “all the books of P.G. Wodehouse for the voyage home” (in 1928 they numbered almost 40, counting the school stories) is not forever tucked in the wallet at the back of Time, wherein are alms for oblivion."}, {"url": "https://en.wikipedia.org/wiki/P._G._Wodehouse", "passage_text": "A third milestone in Wodehouse's life came towards the end of 1915: his old songwriting partner Jerome Kern introduced him to the writer Guy Bolton, who became Wodehouse's closest friend and a regular collaborator. Bolton and Kern had a musical, Very Good Eddie, running at the Princess Theatre in New York. Most of Wodehouse's canon is set in an undated period around the 1920s and 1930s. The critic Anthony Lejeune describes the settings of Wodehouse's novels, such as the Drones Club and Blandings Castle, as a fairyland."}, {"url": "http://onlinebooks.library.upenn.edu/webbin/book/search?author=Wodehouse&amode=words", "passage_text": "A Wikipedia article about this author is available. 1  Wodehouse, P. G. (Pelham Grenville), 1881-1975: The Adventures of Sally (Gutenberg text). 2  Wodehouse, P. G. (Pelham Grenville), 1881-1975: The Clicking of Cuthbert (Gutenberg text). 3  Wodehouse, P. G. (Pelham Grenville), 1881-1975: The Coming of Bill (Gutenberg text). 1 Wodehouse, P. G. (Pelham Grenville), 1881-1975: The head of Kay's. ( 2 New York, The Macmillan co., etc., etc., [1922]) (page images at HathiTrust). 3  Wodehouse, P. G. (Pelham Grenville), 1881-1975: Indiscretions of Archie."}, {"url": "https://en.wikipedia.org/wiki/P._G._Wodehouse", "passage_text": "Born in Guildford, the son of a British magistrate based in Hong Kong, Wodehouse spent happy teenage years at Dulwich College, to which he remained devoted all his life. After leaving school he was employed by a bank but disliked the work and turned to writing in his spare time. Most of Wodehouse's canon is set in an undated period around the 1920s and 1930s. The critic Anthony Lejeune describes the settings of Wodehouse's novels, such as the Drones Club and Blandings Castle, as a fairyland."}, {"url": "https://en.wikipedia.org/wiki/P._G._Wodehouse", "passage_text": "Sir Pelham Grenville Wodehouse, KBE (/ˈwʊdhaʊs/ ; 15 October 1881 – 14 February 1975) was an English author and one of the most widely read humorists of the 20th century. Most of Wodehouse's canon is set in an undated period around the 1920s and 1930s. The critic Anthony Lejeune describes the settings of Wodehouse's novels, such as the Drones Club and Blandings Castle, as a fairyland."}, {"url": "https://en.wikipedia.org/wiki/P._G._Wodehouse", "passage_text": "In 1934 Wodehouse moved to France for tax reasons; in 1940 he was taken prisoner at Le Touquet by the invading Germans and interned for nearly a year. After his release he made six broadcasts from German radio in Berlin to the US, which had not yet entered the war. Most of Wodehouse's canon is set in an undated period around the 1920s and 1930s. The critic Anthony Lejeune describes the settings of Wodehouse's novels, such as the Drones Club and Blandings Castle, as a fairyland."}, {"url": "http://www.goodreads.com/author/show/7963.P_G_Wodehouse", "passage_text": "J.B. Morton. Sir Pelham Grenville Wodehouse, KBE, was a comic writer who enjoyed enormous popular success during a career of more than seventy years and continues to be widely read over 40 years after his death. "}, {"url": "https://en.wikiquote.org/wiki/P._G._Wodehouse", "passage_text": "P. G. Wodehouse. Pelham Grenville Wodehouse KBE (/ˈwʊdhaʊs/; 15 October 1881 – 14 February 1975) was an English comic writer who enjoyed enormous popular success during a career that lasted more than seventy years."}, {"url": "http://www.online-literature.com/pg-wodehouse/", "passage_text": "Pelham Plum Grenville Wodehouse was born on 15 October 1881 in Guildford, Surrey, England, the third of four sons born to Eleanor and Henry Ernest Wodehouse (1845-1929), who at the time of his birth was working as a judge in Hong Kong. George Orwell wrote In Defence of P. G. Wodehouse (1946); Back in America and away from the controversy, Wodehouse continued to write and collaborate on plays. He and Ethel settled in Remsenburg, Long Island, New York State."}]