[{"url": "http://dbpedia.org/page/Roemheld_syndrome", "passage_text": "1 Mają charakter zaburzeń rytmu lub objawow objawów dławicy. Piersiowej zespoł Zespół Opisał (ludwig-roemheld).== §1871 2  ==. 1938 przypisy (ROEMHELD), syndrome rs also Known-As-Roemheld-Techlenburg ceconi syndrome-or, gastric cardia is a complex of gastrocardiac symptoms first Described By (ludwig–roemheld).  1871 1938 It is a syndrome where maladies in the gastrointestinal tract or abdomen trigger/cause cardiac symptoms. There is rarely a traceable cardiac source to the symptoms which may lead to a lengthy period of misdiagnosis."}, {"url": "http://roemheld-syndrome.com/", "passage_text": "Introduction. This site is in progress and will be a hub for information on Roemheld Syndrome (also known as RS or Gastric Cardia) for those that suffer from it. Visit again as we fill in pages and set up a forum. In the meantime, a short summary. Roemheld Syndrome symptoms: 1  Arrhythmia (irregular heart beat)"}, {"url": "http://dbpedia.org/page/Roemheld_syndrome", "passage_text": "Roemheld syndrome (RS), also known as Roemheld-Techlenburg-Ceconi-Syndrome or gastric-cardia, is a complex of gastrocardiac symptoms first described by Ludwig Roemheld (1871–1938). It is a syndrome where maladies in the gastrointestinal tract or abdomen trigger/cause cardiac symptoms. There is rarely a traceable cardiac source to the symptoms which may lead to a lengthy period of misdiagnosis."}, {"url": "http://roemheld-syndrome.com/learn-about-roemheld-syndrome.html", "passage_text": "Start here-Podcast # 490 - Roemheld Syndrome: The Gastric-Cardiac Connection Explained. Roemheld Syndrome-GERD-Heartburn-HealingWell.com Forum. Roemheld syndrome-Wikipedia, the free encyclopedia. I have Roemheld Syndrome-Stomach problems discussions | SteadyHealth.com. Heart Palpitations Forum-Roemheld syndrome RLR. Roemheld syndrome (rs) - Digestive Disorders Message Board-HealthBoards. "}, {"url": "http://www.healthboards.com/boards/digestive-disorders/836958-important-roemheld-syndrome-rs.html", "passage_text": "Im looking for anybody that has Roemheld Syndrome (aka gastro-cardiac syndrome). Its where your digestive system causes cardiac arrhythmia's from gas, GERD, digestion etc........there is nothing structurally wrong with the heart itself, but pressure in the stomach causes palpitations and afib. "}, {"url": "https://en.wikipedia.org/wiki/Roemheld_syndrome", "passage_text": "Roemheld syndrome (RS), also known as Roemheld-Techlenburg-Ceconi-Syndrome or gastric-cardia, is a complex of gastrocardiac symptoms first described by Ludwig Roemheld (1871–1938). It is a syndrome where maladies in the gastrointestinal tract or abdomen trigger/cause cardiac symptoms. There is rarely a traceable cardiac source to the symptoms which may lead to a lengthy period of misdiagnosis. Ludwig Roemheld characterized this particular syndrome shortly before his death; one of his research topics around this time was the effects of calorie intake on the heart."}, {"url": "http://superhumanradio.com/490-roemheld-syndrome-the-gastric-cardiac-connection.html", "passage_text": "Twitter Guest: Dr. Michael SmithLudwig Roemheld was a physician in the late 1800's doing caloric intake research when he stumbled upon a critical link between the stomach and the heart. Roemheld Syndrome was taught to physician in the early to mid 1900's but is all but ignored by physicians today. Guest: Dr. Michael Smith. Ludwig Roemheld was a physician in the late 1800's doing caloric intake research when he stumbled upon a critical link between the stomach and the heart."}, {"url": "https://en.wikipedia.org/wiki/Roemheld_syndrome", "passage_text": "Roemheld syndrome is characterized strictly by abdominal maladies triggering reflexes in the heart. There are a number of pathways through which cardiac reflexes can occur: hormones, mechanical, neurological and immunological. Ludwig Roemheld characterized this particular syndrome shortly before his death; one of his research topics around this time was the effects of calorie intake o"}]