[{"url": "http://www.wikihow.com/Reduce-Sensory-Overload", "passage_text": "People with Sensory Integration Dysfunction, or with similar conditions like autism, can sometimes go into an acute state of sensory overload. Overload occurs when they have experienced too much sensory stimulation, like a computer trying to process too much data and overheating. Here's how to help someone. Do not touch or crowd them. Many people with sensory processing issues are hypersensitive to touch, and being touched or thinking they are about to be touched can worsen the overload. Also, do not tower over them."}, {"url": "https://en.wikipedia.org/wiki/Sensory_overload", "passage_text": "Sensory overload occurs when one or more of the body's senses experiences over-stimulation from the environment. There are many environmental elements that impact an individual. Sensory overload can result from the overstimulation of any of the senses. 1  Hearing: Loud noise or sound from multiple sources, such as several people talking at once or a loud fire alarm. 2  Sight: Bright lights, strobing lights, or environments with lots of movement such as crowds or frequent scene changes on television"}, {"url": "http://www.brainbalancecenters.com/blog/2012/05/minimizing-sensory-overload-in-kids-with-special-needs/", "passage_text": "1. Earn Their Trust. Children with severe sensory issues often feel out of control and seem to be in “fight or flight” mode most of the time. Let your child know that you understand his issues are real and that you are working on a concrete plan to help minimize his stress and sensory overload. Extreme sensitivity to noise, crowds, touch, textures, bright lights, bothersome clothing, and new experiences are often so overwhelming for kids with sensory problems that it can run their lives and the lives of their parents."}, {"url": "https://en.wikipedia.org/wiki/Sensory_overload", "passage_text": "A person’s mentality can be detrimental with a high degree of exposure of sensory overload. The raw reaction to new stimuli will be different when a person’s sensory experiences are overloaded (from past stimuli), compared to when they are not overloaded, the experience will be more pure. Sensory overload can result from the overstimulation of any of the senses. 1  Hearing: Loud noise or sound from multiple sources, such as several people talking at once or a loud fire alarm. 2  Sight: Bright lights, strobing lights, or environments with lots of movement such as crowds or frequent scene changes on television"}, {"url": "http://www.lapublishing.com/tbi-sensory-hypersensitivities-overload", "passage_text": "After brain injury, sensory hypersensitivities are a real concern and can contribute to fatigue and overload. This tip card helps survivors, families, and caregivers identify signs and symptoms of sensory hypersensitivities and offers coping strategies to overcome sensory overload, pain and fatigue. Item: HYPE. If your sense of touch, taste, smell, hearing or vision seems extra sensitive after your brain injury, it is not your imagination. This tip card offers an explanation and examples of sensory hypersensitivities, including being startled by sounds and feeling like everyone is talking too loudly."}, {"url": "http://www.counselingtherapyonline.com/online-therapy-for-ptsd/", "passage_text": "Post-traumatic Stress Disorder (PTSD) results when the mind is unable to process extreme experiences. It is a form of sensory and emotional overload. Mindfulness Therapy allows you to re-process your traumatic memories so that they are no longer overpowering for you. The secret is to change the way you see your memories and emotional imprints. When you change the imagery, you directly change the associated emotions. The actual experience of a traumatic event generates very intense stimulation at both the sensory and emotional levels. The mind finds it very difficult to process this and literally experiences"}]