[{"url": "http://medical-dictionary.thefreedictionary.com/bulbourethral+gland", "passage_text": "The gland in the male that surrounds the neck of the bladder and the urethra. It is partly glandular, with ducts opening into the prostatic portion of the urethra, and partly muscular. It secretes a thin, opalescent, slightly alkaline fluid that forms part of the semen. A gland secreting substances that enhance the function of another gland or organ; e.g., in the male reproductive tract, the prostate, which secretes fluids that improve the viability of sperm, is an accessory gland to the testis."}, {"url": "http://www.webmd.com/sex-relationships/guide/male-reproductive-system?page=2", "passage_text": "1 Bulbourethral glands: Also called Cowper's glands, these are pea-sized structures located on the sides of the urethra just below the prostate gland. 2  These glands produce a clear, slippery fluid that empties directly into the urethra. Prostate fluids also help to nourish the sperm. The urethra, which carries the ejaculate to be expelled during orgasm, runs through the center of the prostate gland. 1 "}, {"url": "https://en.wikipedia.org/wiki/Bulbourethral_gland", "passage_text": "A bulbourethral gland, also called a Cowper gland for English anatomist William Cowper, is one of two small exocrine glands in the reproductive system of many male mammals (of all domesticated animals, they are only absent in the dog). They are homologous to Bartholin's glands in females. The bulbourethral glands are compound tubulo-alveolar glands, each approximately the size of a pea in humans. In chimpanzees, they are not visible during dissection, but can be found on microscopic examination."}, {"url": "http://www.innerbody.com/image_repmov/repo16-new2.html", "passage_text": "Each Cowper’s gland is made of several connected glandular lobules. Many tiny hollow tubules spread through each lobule and are surrounded by columnar glandular epithelium.... Click to read more below. The Cowper’s glands (or bulbourethral glands) are a pair of exocrine glands in the male reproductive system. Roughly the size of peas, they are located inferior to the prostate gland and lateral to the urethra in the urogenital diaphragm. "}, {"url": "http://training.seer.cancer.gov/anatomy/reproductive/male/glands.html", "passage_text": "The prostate gland is a firm, dense structure that is located just inferior to the urinary bladder. It is about the size of a walnut and encircles the urethra as it leaves the urinary bladder. Numerous short ducts from the substance of the prostate gland empty into the prostatic urethra. Secretions from the seminal vesicles make up about 60 percent of the volume of the semen, with most of the remainder coming from the prostate gland. The sperm and secretions from the bulbourethral gland contribute only a small volume."}, {"url": "http://www.webmd.com/sex-relationships/guide/male-reproductive-system?page=2", "passage_text": "The internal organs of the male reproductive system, also called accessory organs, include the following: Epididymis: The epididymis is a long, coiled tube that rests on the backside of each testicle. It transports and stores sperm cells that are produced in the testes. Prostate fluids also help to nourish the sperm. The urethra, which carries the ejaculate to be expelled during orgasm, runs through the center of the prostate gland. 1  Bulbourethral glands: Also called Cowper's glands, these are pea-sized structures located on the sides of the urethra just below"}, {"url": "http://www.mananatomy.com/body-systems/male-reproductive-system/bulbourethral-glands", "passage_text": "Bulbourethral glands, also known as Cowper’s glands, are two small exocrine glands that lie beneath the sphincter urethrae muscle. "}, {"url": "http://www.healthline.com/human-body-maps/bulbourethral-cowpers-gland", "passage_text": "Bulbourethral gland (Cowper's gland). The bulbourethral glands are part of the male reproductive system. They may also be referred to as the Cowper's glands since they were first documented by anatomist William Cowper in the late 1600s. The paired bulbourethral glands are roughly the size of a pea and are located in the deep perineal pouch. They are at the base of the penis and are lateral (to the side) and posterior to (behind) the urethra, which is the tube through which semen and urine exit the body."}, {"url": "http://www.wisegeek.org/what-is-the-cowpers-gland.htm", "passage_text": "A Cowper’s gland, or bulbourethral gland, is one of two pea-sized organs found at the base of the penis that produce secretions necessary for fertile sexual activity. Together with the prostate and seminal vesicles, these glands make a mucus-like substance that goes into semen and also acts as a lubricant during sex. Function of Secretions. Pre-ejaculate fluid, produced solely by the Cowper’s gland, serves three main functions. It's slightly alkaline, so it neutralizes acid levels in a man's urethra so that his sperm can move freely."}]