[{"url": "https://www.luriechildrens.org/en-us/care-services/conditions-treatments/postural-orthostatic-tachycardia-syndrome/Pages/index.aspx", "passage_text": "Postural Orthostatic Tachycardia syndrome. Postural orthostatic tachycardia syndrome (POTS) is a chronic condition affecting the regulation of pressure that is most often seen after the onset of puberty. POTS results from a problem with the autonomic nervous system which controls “automatic” functions, or those that we don't have to think about. "}, {"url": "http://www.medicinenet.com/pot_syndrome/article.htm", "passage_text": "Postural orthostatic tachycardia syndrome (POTS) is one of a group of disorders that have orthostatic intolerance (OI) as their primary symptom. OI describes a condition in which an excessively reduced volume of blood returns to the heart after an individual stands up from a lying down position. In POTS, the lightheadedness or fainting is also accompanied by a rapid increase in heartbeat of more than 30 beats per minute, or a heart rate that exceeds 120 beats per minute, within 10 minutes of rising. The faintness or lightheadedness of POTS are relieved by lying down again."}, {"url": "https://en.wikipedia.org/wiki/Postural_orthostatic_tachycardia_syndrome", "passage_text": "The hallmark symptom of POTS is an increase in heart rate by at least 30 beats per minute within 10 minutes of assuming an upright position. For people aged between 12 and 19, the minimum increase for diagnosis is 40 beats per minute. This symptom is known as orthostatic (upright) tachycardia (fast heart rate). Other symptoms of an orthostatic nature — occurring in response to upright posture — may accompany the tachycardia. The causes of POTS are poorly understood, and it is likely that several distinct underlying problems can lead to the symptoms of POTS."}, {"url": "http://www.dysautonomiainternational.org/page.php?ID=30", "passage_text": "Diagnostic Criteria. The current diagnostic criteria for POTS is a heart rate increase of 30 beats per minute (bpm) or more, or over 120 bpm, within the first 10 minutes of standing, in the absence of orthostatic hypotension. 1,2,3,4 In children and adolescents, a revised standard of a 40 bpm or more increase has recently been adopted. While some of the physical symptoms of POTS overlap with the symptoms of anxiety, such as tachycardia and palpitations, POTS is not caused by anxiety. POTS patients are often misdiagnosed as having anxiety or panic disorder, but their symptoms are real and can severely limit a person's ability to function."}, {"url": "http://www.dinet.org/index.php/information-resources/pots-place/pots-symptoms", "passage_text": "POTS Symptoms. Postural Orthostatic Tachycardia is a syndrome. As such, there is a collection of symptoms that distinguish it. The symptoms are widespread because the autonomic nervous system plays an extensive role in regulating functions throughout the body."}, {"url": "http://www.potsuk.org/what_is_pots2", "passage_text": "Postural tachycardia syndrome is an abnormality of the functioning of the autonomic (involuntary) nervous system. To be diagnosed with PoTS, an individual must experience a group of symptoms in the upright position (usually standing) that are relieved by lying down. A persistent increase in heart rate of 30 beats per minute (40 bpm if under 19 years of age) should be recorded within ten minutes of standing. The Postural Tachycardia Syndrome (PoTS) is an abnormality of the autonomic nervous system (sometimes called ‘dysautonomia’). The autonomic nervous system (ANS) is in charge of all bodily functions that we don’t have to think about, such as: 1  Heart rate and blood pressure regulation. 2  Digestion. 3  Bladder control. 4  Sweating."}, {"url": "http://www.nhs.uk/conditions/postural-tachycardia-syndrome/Pages/Introduction.aspx", "passage_text": "Postural tachycardia syndrome (PoTS) is an abnormal increase in heart rate after sitting or standing up. It typically causes dizziness, fainting, sweating and other symptoms. "}, {"url": "http://www.ncbi.nlm.nih.gov/pmc/articles/PMC2600095/", "passage_text": "Postural orthostatic tachycardia syndrome (POTS) is an autonomic disturbance characterised by the clinical symptoms of orthostatic intolerance, mainly light‐headedness, fatigue, sweating, tremor, anxiety, palpitation, exercise intolerance and near syncope on upright posture. "}, {"url": "http://www.ninds.nih.gov/disorders/postural_tachycardia_syndrome/postural_tachycardia_syndrome.htm", "passage_text": "Postural orthostatic tachycardia syndrome (POTS) is one of a group of disorders that have orthostatic intolerance (OI) as their primary symptom. OI describes a condition in which an excessively reduced volume of blood returns to the heart after an individual stands up from a lying down position. "}, {"url": "https://en.wikipedia.org/wiki/Postural_orthostatic_tachycardia_syndrome", "passage_text": "Not to be confused with Pott's Disease. Postural orthostatic tachycardia syndrome (POTS, also known as postural tachycardia syndrome) is a condition in which a change from the supine position to an upright position causes an abnormally large increase in heart rate, called tachycardia. Other symptoms of an orthostatic nature — occurring in response to upright posture — may accompany the tachycardia. The causes of POTS are poorly understood, and it is likely that several distinct underlying problems can lead to the symptoms of POTS."}]