[{"url": "http://www.ehow.com/how_5467258_care-sicilian-donkeys.html", "passage_text": "Feeding Sicilian Donkeys. Your donkey probably doesn't require grain unless pregnant or nursing, or is an animal doing regular work. What he does need is good quality grass or timothy hay, access to a salt block and a constant supply of clean water. These donkeys are virtually gone from Sicily and Sardinia. They're relatively easy equines to care for, but they need company. While another Sicilian donkey is ideal, horses, ponies, goats and similar hooved animals will fill the bill."}, {"url": "http://thefarmatwalnutcreek.com/Horses_Sicilian-Donkey.html", "passage_text": "However the Sicilian donkey is known for its sweet, affectionate disposition. Donkeys are very social creatures and need the company of other donkeys or animals. Contrary to popular opinion, donkeys are not dumb animals. They are actually very clever but can often be stubborn. The Sicilian donkey is a miniature breed of domestic donkey, standing only 28-38 inches tall at the withers. They usually weigh between 250 and 450 pounds. The most common color is gray, but they can range from black, brown, chestnut, white, or spotted"}, {"url": "http://www.johnnyspark.com/siciliandonkey.html", "passage_text": "The donkey, also known as burro or ass, is a descendent of the Nubian and Somali wild asses. The Sicilian donkey is the rarest breed of donkey. They originated in Arabia and Africa.. A female donkey is called a jennet or jenny, a male is a jack, and a baby is a foal. Sicilian donkeys are considered the miniature breed of domestic donkey, growing to 250-500 pounds and 35-40 inches tall. "}, {"url": "http://www.ansi.okstate.edu/breeds/other/donkey/mini/", "passage_text": "Miniature. Miniature donkeys are native to the Mediterranean islands of Sicily and Sardinia. They are identified as either Sicilian or Sardinian donkeys according to their ancestry, although the two types do not differ. The adult miniature donkey must not be more than 36 inches tall when mature, measured from the highest point of the withers to the ground. Characteristics. The Miniature Mediterranean Donkey is by nature one of the friendliest and most affectionate animals of its type. They are very tame and gentle."}, {"url": "http://valleystables-exotics.com/donkeys.html", "passage_text": "Registered with the International Miniature Donkey Registry (IMDR) & The Miniature Donkey Registry. The MINIATURE SICILIAN DONKEY is like no other equine. They are so very affectionate and truly born that way. The donkeys bred and raised here at Valley Exotics are all registered with the International Miniature Donkey Registry. The jennet should be a little larger to help prevent birthing problems. The Sicilian Donkey according to an article dated 1995 are on the USDA livestock conservancy list with the worlds population numbering less than 10,000. Don’t confuse the common donkey of small size with the Sicilian."}, {"url": "http://animals.mom.me/habitat-sicilian-donkey-3284.html", "passage_text": "Ablestock.com/AbleStock.com/Getty Images. More commonly known as miniature donkeys, Sicilian donkeys actually arrived in Sicily via their native North Africa. Throughout the world, these hardy little equids carry people and goods and pull carts. They mature early, ready to work by the age of 3. History. Donkeys helped build human history. Remains of domestic donkeys have been found dating to around 4000 BCE in Egypt. The ancestors of the Sicilian donkey originated in North Africa, eventually shipped to the Italian island."}, {"url": "http://thefarmatwalnutcreek.com/Horses_Sicilian-Donkey.html", "passage_text": "Description. The Sicilian donkey is a miniature breed of domestic donkey, standing only 28-38 inches tall at the withers. They usually weigh between 250 and 450 pounds. The most common color is gray, but they can range from black, brown, chestnut, white, or spotted"}, {"url": "http://www.lazylsafari.com/albums/album_image/7032987/5204616.htm", "passage_text": "Miniature Sicilian Donkeys are native to the Mediterranean Islands of Sicily and Sardinia. They are identified as either Sicilian or Sardinian donkeys according to their ancestry, although the two types do not differ. The male donkey is called a Jack and the female is called a Jennet. They range in size from 31 to 35. Their colors range from black to white and everything in between including spotted. Donkeys communicate by braying or more commonly known as hee-haw."}, {"url": "http://www.ehow.com/how_5467258_care-sicilian-donkeys.html", "passage_text": "Your Sicilian donkey 's ancestors, prior to arriving in Sicily, originally hailed from the Mediterranean region of North Africa. Such donkeys not only ended up in Sicily as working animals, but also on the island of Sardinia. Although the Sicilian and Sardinian donkeys once had distinct ancestry, today they are known simply as miniature Mediterranean donkeys. These donkeys are virtually gone from Sicily and Sardinia. They're relatively easy equines to care for, but they need company. While another Sicilian donkey is ideal, horses, ponies, goats and similar hooved animals will fill the bill."}]