[{"url": "https://en.wikipedia.org/wiki/Gadsden_Purchase", "passage_text": "The purchase included lands south of the Gila River and west of the Rio Grande; it was largely so that the U.S.A. could construct a transcontinental railroad along a deep southern route. The Gadsden Purchase (shown in yellow with present-day state boundaries and cities) Northeastern boundary was the disputed U.S.–Mexico boundary; line shown is the unratified Bartlett–Conde compromise proposal which was preempted by the Gadsden Purchase."}, {"url": "https://history.state.gov/milestones/1830-1860/gadsden-purchase", "passage_text": "The Gadsden Purchase, or Treaty, was an agreement between the United States and Mexico, finalized in 1854, in which the United States agreed to pay Mexico $10 million for a 29,670 square mile portion of Mexico that later became part of Arizona and New Mexico. President Pierce signed the treaty and Gadsden presented the new treaty to Santa Anna, who signed it on June 8, 1854. After Gadsden’s Purchase a new border dispute caused tension over the United States’ payment, and the treaty failed to resolve the issues surrounding financial claims and border attacks."}, {"url": "http://www.answers.com/Q/What_was_the_Gadsden_Purchase", "passage_text": "Confidence votes 83. U.S. purchase of land in southern New Mexico and Arizona south of the Gila River on December 30, 1853. It was purchased to get approval for a southern railroad route to the Pacific Coast in that territory. Franklin Pierce was the President when the Gadsden Purchase was made in 1853. The Gadson Purchase was an 1853 agreement to buy a strip of land in what is now the southern United States so that a railroad line could be built to the Gulf of California. James Gadsden was the U.S. Minister to Mexico and the man responsible for the deal."}, {"url": "http://www.thefreedictionary.com/Gadsdena", "passage_text": "An area in extreme southern New Mexico and Arizona south of the Gila River. It was purchased by the United States from Mexico in 1853 to ensure territorial rights for a practicable southern railroad route to the Pacific Coast. "}, {"url": "http://www.answers.com/Q/What_was_the_Gadsden_Purchase", "passage_text": "The Gadsden Purchase was the United States' land acquisition from Mexico in 1853. The U.S. paid $15,000,000 (including $3,000,000 in claims of American citizens) for the 45,53 … 5 square miles of land that became the southern parts of Arizona and New Mexico. The Gadson Purchase was an 1853 agreement to buy a strip of land in what is now the southern United States so that a railroad line could be built to the Gulf of California. James Gadsden was the U.S. Minister to Mexico and the man responsible for the deal."}, {"url": "http://history1800s.about.com/od/1800sglossary/g/Gadsden-Purchase.htm", "passage_text": "The Gadsden Purchase was a strip of territory the United States purchased from Mexico following negotiations in 1853. The land was purchased because it was considered to be a good route for a railroad across the Southwest to California. The Gadsden Purchase represented the last parcel of land acquired by the United States to complete the 48 mainland states. The transaction with Mexico was controversial and it intensified the simmering conflict over slavery and helped to inflame the regional differences that eventually led to the Civil War."}, {"url": "http://www.historytoday.com/richard-cavendish/gadsden-purchase", "passage_text": "Modern USA Political Franklin Pierce. It was the Gadsden Purchase on December 30th, 1853, that settled the main boundaries of the USA. It was the Gadsden Purchase that settled the main boundaries of the United States of America (though Alaska was added in 1867)"}]