[{"url": "http://www.cheese.com/grana-padano/", "passage_text": "Grana Padano, granted DOP on 12 June 1996, is one of the few cheeses that can possibly compete with the King of Cheeses; Parmigiano-Reggiano. Created by the Cistercian monks of Chiaravalle in the 12 th century, it is still made throughout the Po River Valley in northeastern Italy. It is sold at different ripening stages: Grana Padano (9 to 16 months), Grana Padano oltre 16 mesi (over 16 months) and Grana Padano Riserva (over 20 months)."}, {"url": "http://www.ehow.com/about_5085489_grana-padano-cheese.html", "passage_text": "Uses. Grana Padano is a crumbly cheese, similar to Parmesan, and is used in similar ways. Grana Padano can be eaten on its own, as part of a cheese course. Mostly, however, the cheese is grated and used as an ingredient or garnish for other dishes, such as in pastas, soups and souffles. Grana Padano is a mild, crumbly cheese made from cow's milk. It originates in Italy, where it was first made by Cistercian monks from an abbey near Milan. It is similar to Parmesan cheese, and is used in many of the same ways. 1  Substitutes for Grana Padano Cheese"}, {"url": "https://en.wikipedia.org/wiki/Grana_Padano", "passage_text": "The name comes from the Italian word grana (‘grain’), which refers to the distinctively grainy texture of the cheese, and the adjective Padano, which refers to the valley Pianura Padana. It is called Grana Padano and not Grana Padana because the Italian word grana is the masculine noun, il grana, describing this specific cheese, and not the feminine noun la grana, which means grain."}, {"url": "http://www.cheese.com/grana-padano/", "passage_text": "Grana Padano is manufactured in cylindrical wheels measuring 35 to 45 cm in diameter, and 15 to 18 cm in height. It is sold at different ripening stages: Grana Padano (9 to 16 months), Grana Padano oltre 16 mesi (over 16 months) and Grana Padano Riserva (over 20 months). Try pairing the cheese with a Barolo, Zinfandel or Gavi white wine. 1  Made from unpasteurized cow 's milk"}, {"url": "http://www.cheese.com/grana/", "passage_text": "Grana Padano, on the other hand, refers to the valley Pianura Padana in which it is made. Though similar to Parmigianino-Reggiano, young Grana Padano is slightly less crumbly, milder and less complex than its famous, aged kin. Around the world, Grana is a generic term used to define three main varieties of grana cheese—Parmigianino-Reggiano, Grana Padano and Grana Trentino and other smaller variants like Granone Lodigiano, Trentingrana and Gransardo."}, {"url": "https://en.wikipedia.org/wiki/Grana_(cheese)", "passage_text": "Grana originally referred to a class of hard, mature cheeses from Italy which have a granular texture and are often used for grating. These cheeses are typically made in the form of large drums. Grana originally described a type of hard cheese from the Po Valley (Valle Padana), Northern Italy, with a distinctive granular texture (the word grana in Italian means grain)."}, {"url": "http://www.cheese.com/grana/", "passage_text": "The most popular Grana Italian cheeses are of course Parmigiano-Reggiano and Grana Padano. True Parmigianino-Reggiano, named after the Provinces of Parma, Reggio Emilia, Modena, Bologna and Mantua, in which it is made, has a hard, gritty texture and is fruity and nutty in taste. Around the world, Grana is a generic term used to define three main varieties of grana cheese—Parmigianino-Reggiano, Grana Padano and Grana Trentino and other smaller variants like Granone Lodigiano, Trentingrana and Gransardo."}, {"url": "http://www.recipetips.com/glossary-term/t--35837/grana-padano-cheese.asp", "passage_text": "Grana Padano is an Italian semi-fat, hard cheese with a finely grained texture. It is pale yellow in color and has a delicate flavor. Produced in a cylindrical shape, it is then cut and sold in wedges. It is made from top quality milk from cows that have been fed and raised under strict guidelines. It is also a good melting cheese for cooking. Grana Padano is very similar to Parmigiano-Reggiano but has been aged for less time and has a more delicate flavor. It is also less expensive than Parmigiano-Reggiano, which is produce only during a specific time of the year."}]