[{"url": "http://msue.anr.msu.edu/news/deer_and_rabbits_and_mice_oh_my", "passage_text": "Damage to landscape plants from mammals such as deer, rabbits and field mice (voles) adds to this winter’s carnage. Posted on May 9, 2014 by Bert Cregg, Michigan State University Extension, Departments of Horticulture and Forestry. 1  Tweet. 2  Pin It. "}, {"url": "http://www.madelinedyer.com/are-rabbits-rodents/", "passage_text": "Many people class rabbits as being in the same ‘order’ or ‘family’ as guinea pigs, mice and voles, thus calling them rodents, but is this true? The answer is no; Rabbits are not rodents (of the order rodentia), as they make up the mammal order ‘Lagomorpha’ along with pikas and hares. Within the order Lagomorpha, rabbits belong to their own family ‘Leporidae’ along with hares."}, {"url": "http://www.rabbit.org/fun/answer5.html", "passage_text": "Rabbits aren't rodents (like rats or mice) - they are lagomorphs. While lagomorphs and rodents are certainly related, you might also say that rabbits are related to horses as well. Rabbits and horses share similarities in their diet and in their method of digesting food. "}, {"url": "https://en.wikipedia.org/wiki/Rodent", "passage_text": "Well-known rodents include mice, rats, squirrels, prairie dogs, porcupines, beavers, guinea pigs, hamsters, and capybaras. Other animals such as rabbits, hares and pikas were once included with them, but are now considered to be in a separate order, Lagomorpha. Rodents (from Latin rodere, to gnaw) are mammals of the order Rodentia, which are characterized by a single pair of unremittingly growing incisors in each of the upper and lower jaws. About forty percent of all mammal species are rodents; they are found in vast numbers on all continents except Antarctic"}, {"url": "http://www.ucmp.berkeley.edu/mammal/rodentia/rodentia.html", "passage_text": "The single largest group of mammals is the Rodentia. Most non-flying mammals are rodents: there are about 1,500 living rodent species (out of about 4,000 living mammals overall). Most people are familiar with mice, rats, hamsters, and guinea pigs, which are commonly kept as pets. The Rodentia also includes beavers, muskrats, porcupines, woodchucks, chipmunks, squirrels, prairie dogs, marmots, chinchillas, voles, lemmings, and many others. (Incidentally, the Rodentia does not include rabbits; rabbits differ from rodents in having an extra pair of incisors and in other skeletal features. Rabbits, hares, and a few other species make up the Lagomorpha. Shrews, moles and hedgehogs are also not rodents; they are classified in the Insectivora .)"}, {"url": "http://synapsida.blogspot.com/2012/03/why-rabbits-arent-rodents.html", "passage_text": "Well, you'd never mistake a rabbit for a mouse, but the fact is, not all rodents do look like that. Some rodents, such as beavers and porcupines, are much larger than rabbits, or, in some cases, even hares. However, that's going by the scientific meaning of the word 'rodent'. In everyday speech, I've heard the term applied to a even wider range of animals, including such things as shrews, but, most commonly, rabbits. Yet rabbits, along with hares and pikas, are not rodents."}, {"url": "http://www.odh.ohio.gov/odhprograms/bid/zdp/animals/rodents.aspx", "passage_text": "Wild rodents (chipmunks, squirrels, mice, rats, muskrats) and rabbits can be found throughout Ohio and are well-adapted to living in urban, suburban and rural environments. In addition, many types of rodents have become popular pocket pets (hamsters, gerbils, guinea pigs) along with domestic rabbits and hedgehogs. T. mentagrophytes causes scaly white lesions around the head of mice and rabbits, although some animals may be inapparent carriers without signs of disease. People can develop dermatophytosis after contact with infected rodents or rabbits."}, {"url": "http://www.odh.ohio.gov/odhprograms/bid/zdp/animals/rodents.aspx", "passage_text": "Domestic rabbit-, rodent-and hedgehog-related diseases of concern in Ohio include: 1  Animal bites: rabbits, rodents and pocket pets. 2  Dermatophytosis (ringworm). 3  Leptospirosis. 4  Lymphocytic choriomeningitis virus (LCMV). 5  Monkeypox. 6  Rat-bite fever. 7  Salmonellosis. T. mentagrophytes causes scaly white lesions around the head of mice and rabbits, although some animals may be inapparent carriers without signs of disease. People can develop dermatophytosis after contact with infected rodents or rabbits."}]