[{"url": "http://www.onemedical.com/blog/live-well/blood-work-basics/", "passage_text": "Fasting Requirements. Fasting means that, with the exception of water, you refrain from eating or drinking for a minimum of 8 hours (10 to 12 hours is preferable) prior to the draw. This means no coffee or tea, so save that morning trip to the cafe café for after your. draw"}, {"url": "http://www.questdiagnostics.com/home/patients/prepare-for-test/fasting", "passage_text": "Generally, before a lipid or a glucose tolerance test, you’ll be told to fast for eight hours. However, your healthcare provider may advise you differently. Always follow his/her instructions to the letter. If you don’t fast, or fast for a shorter time than prescribed, your tests could give inaccurate results, meaning you’ll likely have to repeat the test. If you think fasting is going to be a problem for you, please discuss it with your healthcare provider."}, {"url": "https://answers.yahoo.com/question/index?qid=20071212094942AAY8KIt", "passage_text": "If your doctor wants to get a fasting blood glucose (sugar), a cholesterol level, or certain other tests, you would need to fast overnight (as others have said, 12 hours is plenty) and I can't think of any blood tests offhand that would require anything more than that. But ask your doctor what is needed. Report Abuse. For a CBC you don't need to fast. An overnight fast is preferred when checking transaminases, and 14 hours is best for a lipid profile, but the simple hemogram won't be affected by fasting status. W W D · 8 years ago."}, {"url": "http://www.answers.com/Q/How_long_do_you_fast_for_a_fasting_blood_test", "passage_text": "It depends on the type of blood test. For fasting sugar tests it  can have an affect. Fasting longer than 12 to 14 hours will cause  your body to start utilizing glycogen th … at is primarily stored in  your muscles and that can affect blood tests for fasting sugar. "}, {"url": "http://www.nhs.uk/chq/Pages/1018.aspx?CategoryID=69", "passage_text": "Iron blood test. Iron blood tests are usually taken in the morning before you eat anything. You should also avoid taking iron pills or tablets for 24 hours before your test. Your body absorbs iron very quickly from food or pills, so this can raise your iron levels and affect the test results."}, {"url": "http://www.livestrong.com/article/492574-can-i-have-coffee-if-im-fasting-before-blood-work/", "passage_text": "In some instances, your doctor will ask you to avoid only certain foods, beverages or medications before a test. Your doctor will inform you what time your blood test is scheduled, whether to fast and, if so, how long you must fast beforehand, generally between eight and 12 hours. Prepare for a water-only fast by eating a nutritious meal prior to the fasting period. "}, {"url": "http://www.nhs.uk/chq/Pages/1018.aspx?CategoryID=69", "passage_text": "Fasting blood glucose test. Do not eat or drink anything except water for 8 to 10 hours before a fasting blood glucose test. These are used to diagnose diabetes, a condition caused by too much glucose (sugar) in the blood. Iron blood tests are usually taken in the morning before you eat anything. You should also avoid taking iron pills or tablets for 24 hours before your test. Your body absorbs iron very quickly from food or pills, so this can raise your iron levels and affect the test results."}, {"url": "https://answers.yahoo.com/question/index?qid=20070115142715AAWKvpR", "passage_text": "The blood sugar level varies as much as 5 mg-% on a minute--to-minute basis; therefore, any GROSSLY abnormal result will show up. The technician should have performed the test. As a general rule of thumb, 8-12 hours is fasting, if you're going for surgery, and are apt to vomit your stomach contents. If you're going for blood tests, then 6-8 hours is OK, and you might stretch it to 4-6 hours if the preceding meal was not loaded with carbohydrates (depending on what the test was for). Best Answer: I am a type 1 diabetic and the lab I use is a 45 minute drive from my house, so fasting is not easy for me when I need a fasting blood workup (usually a lipid)I go 8 hours, my doctor told me 8 is good enough, but he'd prefer 10-12 hours."}, {"url": "http://www.buzzle.com/articles/how-long-to-fast-before-a-blood-test.html", "passage_text": "Fasting Duration. The starving time varies in accordance to the specific approach for which the blood work is being performed. In general, the fasting period for blood test is 8 hours, and the maximum duration does not exceed 12 hours. During the starving time, a candidate can drink water to reduce hunger pangs. Also, according to the main approach for blood test, certain beverages and current medications are allowed during fasting. The fasting duration for lipid panel is 10-12 hours, after which, the physician will draw blood sample for testing. So, this was an overview concerning the importance of fasting before a blood test. Remember to follow the instructions to get accurate test results."}, {"url": "http://www.answers.com/Q/How_long_do_you_fast_for_a_fasting_glucose_blood_test", "passage_text": "It depends on the type of blood test. For fasting sugar tests it  can have an affect. Fasting longer than 12 to 14 hours will cause  your body to start utilizing glycogen th … at is primarily stored in  your muscles and that can affect blood tests for fasting sugar. Is 15 hours fasting too long for a blood test? i just had my blood drawn today and i'd say as long as you drink plenty of water you should be ok, i went for 18 hours without food or water and i passed out."}]