[{"url": "http://1by1leadershipfoundation.org/what-do-mountains-symbolize-in-the-bible/", "passage_text": "Good Morning Friends, There is something mysterious about mountains. You see from the experience on the mountains of Ararat, Sinai, to Horeb, Hermon and Calvary the message is the same. God has a power we do not have. He is holy and we are not. He is God and we are not. But these mountains were also pagan places of worship"}, {"url": "http://bustedhalo.com/questionbox/what-is-the-significance-of-mountains-in-the-bible", "passage_text": "In the Old Testament, the mountains of Sinai and Zion are most significant. Mount Sinai, of course, is associated with Moses and is the place where Moses received the gift of the Law, the Ten Commandments. Thus, Mount Sinai is a symbol of God’s Covenant with Israel. As a result, mountains and hills are mentioned over 500 times in the Bible. Mountains have a logical religious symbolism for biblical cultures since they are “closer to God” who was believed to dwell in the heavens (as in the sky). As a result, God often reveals himself on the mountaintop."}, {"url": "http://bustedhalo.com/questionbox/what-is-the-significance-of-mountains-in-the-bible", "passage_text": "First of all, mountains are mentioned frequently in the Bible because mountains dotted the landscape of biblical regions. In other words, while mountains have a significant symbolic value in the Bible, they first and foremost are part of the physical reality of the Bible. As a result, mountains and hills are mentioned over 500 times in the Bible. Mountains have a logical religious symbolism for biblical cultures since they are “closer to God” who was believed to dwell in the heavens (as in the sky). As a result, God often reveals himself on the mountaintop."}, {"url": "http://www.biblemeanings.info/Words/Geographical/Hill.htm", "passage_text": "In these passages mountains denote celestial love, and hills spiritual love; that mountains are not here meant, nor hills, nor they who were upon mountains and hills, is very manifest. [8] In Isaiah :--. There shall be upon every high mountain, and upon every lifted up hill, streams, channels of waters (Isa. 30:25); "}, {"url": "http://symbolism.wikia.com/wiki/Mountain", "passage_text": "Some of the things that a mountain or range of mountains can symbolize 1  : obstacles. 2  climbing over one or passing through a range indicates overcoming obstacles or making progress. 3  climbing up a mountain or other height often indicates spiritual or mental rising or improvement. 4  permanence and immovability. "}, {"url": "http://www.symbolism.org/writing/books/sp/2/page6.html", "passage_text": "The place symbolism of the polar regions is similar in ways to desert place symbolism in that they are vast areas of unchanging landscape. But unlike deserts, these regions have little life and symbolize the most barren places of the world. (f) Mountains. A quarter of the Earth's surface lies at heights above 3,300 feet or more above sea level but these mountain areas are thinly populated by man. Mountains are the closest we can get to the heavens on earth and this says much about their symbolic significance in stories. From the peak of a mountain a character has a better perspective on things. Perhaps he can even see the divisions of ecosystems from his lofty observation point"}, {"url": "http://www.answers.com/Q/What_does_the_mountain_represent_in_lord_of_The_Flies", "passage_text": "Making the world better, one answer at a time. The mountain represents the hope for rescue, and the longing return to home. It is also symbolic for Piggy as his deathbed, and the end of Technology in the book. The mountain represents the hope for rescue, and the longing return to home. It is also symbolic for Piggy as his deathbed, and the end of Technology in the book. "}, {"url": "http://www.askmefast.com/What_do_mountains_symbolize_in_literature-qna397814.html", "passage_text": "Usually mountain have permanence and immovability. It can represent dwelling of a holy being or something representing a deity.This word can use to indicate secluded, isolated and hard to reach place. But commonly symbolizes that the obstacles, strength, courage, challenges, to overcome, endurance, etc... "}]