[{"url": "http://time.com/money/2902066/swimming-pools-cost-vs-value-home-improvement-or-pain-in-the-rear/", "passage_text": "The average in-ground swimming pool costs $21,919, according to home improvement site Fixr. And that’s for a pretty basic 32’ by 16’ model. (Eleven years ago, we spent about $24,000 on our pool plus that pavered patio.). But that’s just to build the thing. "}, {"url": "http://www.riverpoolsandspas.com/blog/bid/23495/How-Much-do-Above-Ground-and-Inground-Swimming-Pools-Cost", "passage_text": "The installation costs of above ground pools usually run $1000-$3000, depending on the size and type of pool. Keep in mind that oval pools normally cost more to install than round pools, and the kits are also more expensive. The average above ground swimming pool kit will cost between $1500 and $4500, depending on the quality of the pool. Typically, the more resin and less metal the pool has, the higher the price will be and the longer it will last."}, {"url": "http://www.poolpricer.com/", "passage_text": "Understanding that this is a very rough figure, you can expect to pay $25,000-50,000 for an inground pool. Of course, that’s assuming a pool of average size, in an average city with the average cost of living, average extras, and average materials. Of course, you probably aren’t average. The size of the pool is the biggest factor in determining how much it costs. For every square foot, expect to pay around $50. Depth. This is part of the pool’s size, but it’s worth calling attention to it separately. If you want a deeper pool, that’s going to require more labor (digging) and"}, {"url": "http://piggington.com/pros_and_cons_of_having_a_pool_and_how_much_month_to_maintain_po", "passage_text": "I don't know how much it costs to run our pool pump, but when I read the post saying $250/month got me concerned enough to check into it. We have a typical size pool (pool builders call it standard size). We run our 1HP pump an average of 5 hrs/day (6 hrs/day in summer and 4 hrs/day in winter). I would guess $500/Month (midwest utility prices) for 45,000 gallons if you keep it warm, 84F. My family would say, can't have cold water in the pool. While we are on realestate hold here, on the wish list is pool/spa, creative landscaping, some sort of view and as high efficiency heating as you can get."}, {"url": "http://www.kayakpoolsmidwest.com/cool-pool-ideas/above-ground-vs-in-ground-pools-cost/", "passage_text": "Generally, due to site preparation, installation costs, and potential maintenance, above ground pools are a fraction of the cost of an in-ground pool, which can start at around $20,000 on the low-end – usually not including a deck, heating system, slide or other accessories. "}, {"url": "http://www.riverpoolsandspas.com/inground-pool-cost-guide", "passage_text": "As a general rule, to find the average price of a fiberglass pool package of this type, take the length of the pool and add two to six thousand dollars. For example, a 30' fiberglass pool package might cost $34,000. Most people will spend another $5k-$15k in pool accessories, electrical work, patio, and fencing. Base vinyl liner packages from most pool builders typically cost $25,000-$35,000 while turn-key vinyl liner packages will typically cost $35,000-$55,000. Now let's take a look at how much it costs to own each type of pool over time."}, {"url": "http://www.fixr.com/costs/build-swimming-pool", "passage_text": "For the purpose of this discussion, we will look at the costs associated with the installation of both kinds of modern swimming pools. According to P.K. Data the average cost of a 19' diameter above ground swimming pool is $6,243; while the average cost of a 32'x16' inground swimming pool is $21,919. "}, {"url": "http://www.midwestpools.com/fiberglass-pool-costs.php", "passage_text": "Installing Fiberglass Pools. At Midwest Pools, we can install your pool in as little as three days. In order to keep the cost of the process down and to ensure efficiency, we maintain our own machinery such as hydraulic excavators, dump trucks, overhead cranes, and even a water tanker. Overall, fiberglass pool costs are kept down by the fact that the amount of time and money spent on maintenance is minimal. Also, if your pool is indoors, you won't have to pay any storage costs."}, {"url": "http://www.midwestpools.com/fiberglass-pool-costs.php", "passage_text": "Fiberglass Pool Costs. On average, the starting price for a high-quality fiberglass pool is around $15,000. This is far less than the cost of other entertainment investments like luxury boats, campers, and cabins. Overall, fiberglass pool costs are kept down by the fact that the amount of time and money spent on maintenance is minimal. Also, if your pool is indoors, you won't have to pay any storage costs."}, {"url": "http://home.costhelper.com/swimming-pool.html", "passage_text": "1 Installing an aboveground pool can cost $1,500-$5,000; for in-ground estimated costs are $7,000-$16,000 for a vinyl-lined model, $15,000-$25,000 for a fiberglass shell and $17,000-$45,000 for concrete or gunite. 2  However, custom designs can run prices much higher. 1 This Old House uses photos to show the steps used to create an $80,000 custom concrete in-ground pool. 2  BettersHomesandGardens.com presents on overview of the various types of pools as well as a slide show of poolside pavilions that could be included in your project."}]