[{"url": "https://itunes.apple.com/us/app/hangouts/id643496868?mt%3D8", "passage_text": "Description. Use Hangouts to keep in touch. Message friends, start free video or voice calls, and hop on a conversation with one person or a group. Say more with photos, stickers, and emoji. • Include all your friends with group chats for up to 100 people. "}, {"url": "http://www.webopedia.com/TERM/G/google_hangouts.html", "passage_text": "Google+ Hangouts is a free video chat service from Google that enables both one-on-one chats and group chats with up to ten people at a time. While somewhat similar to Skype, FaceTime and Facebook Video Chat, Google Hangouts focuses more on face-to-face-to-face group interaction as opposed to one-on-one video chats, and utilizes sophisticated technology to seamlessly switch the focus to the person currently chatting."}, {"url": "https://en.wikipedia.org/wiki/Google_Hangouts", "passage_text": "Google Hangouts is a communication platform developed by Google which includes instant messaging, video chat, SMS and VOIP features. In Android 4.4, Hangouts is integrated with text messages sending and receiving functions, which is the default SMS app on the Nexus 5. For other Android phones, users can choose to open the SMS function when they download the new version of Hangouts via Google Play."}, {"url": "https://support.google.com/hangouts/answer/3115403?hl=en", "passage_text": "History is on by default for all Hangouts, but you can turn it off and on for each Hangout at any time. Saving your Hangouts history lets you review your previous messages right from your Hangout window. Open a Hangout and scroll upward to see your saved messages. You can turn off your Hangout’s history if you don’t want to save a copy of the messages being sent for privacy or safety reasons. 1  Open Hangouts. 2  Choose the Hangout to change the history setting. 3  Click settings. 4  Click the box next to Hangout history.."}, {"url": "http://www.androidcentral.com/what-you-need-know-about-new-google-hangouts-and-google-voice", "passage_text": "And to make phone calls through your Google Voice number, you're going to need the new Hangouts Dialer app, which also requires that new v2.3 of the Hangouts app. Things get a little funny here, because once the dialer is installed and you open Hangouts or open Hangouts Dialer, they look and function exactly the same. Google Hangouts is getting a pretty major refresh, and it now integrates with Google Voice. And there's a new Hangouts Dialer to contend with if you want to use both together. If it's all just a wee bit confusing, we understand."}, {"url": "https://en.wikipedia.org/wiki/Google_Hangouts", "passage_text": "As with the previous Google+ Hangouts, users can also perform a group video chat with up to 10 users at a time. The new Google Hangouts app on iOS integrates a Google Voice number to some extent, but on Android the SMS support in Hangouts doesn't fully integrate with Google Voice for calls or texts. In Android 4.4, Hangouts is integrated with text messages sending and receiving functions, which is the default SMS app on the Nexus 5. For other Android phones, users can choose to open the SMS function when they download the new version of Hangouts via Google Play."}, {"url": "https://en.wikipedia.org/wiki/Google_Hangouts", "passage_text": "Google has also stated that Hangouts is designed to be the future of its telephony product, Google Voice, and integrated some of the capabilities of Google Voice into Hangouts. In Android 4.4, Hangouts is integrated with text messages sending and receiving functions, which is the default SMS app on the Nexus 5. For other Android phones, users can choose to open the SMS function when they download the new version of Hangouts via Google Play."}, {"url": "https://hangouts.google.com/", "passage_text": "1 Make completely free calls to other Hangouts users. 2  Call almost any phone number in the US and Canada for free, and get super low rates on international calls*. 3  Get voice calling for Hangouts on Android with Hangouts Dialer. 1 Make calls from your Android, iOS, or desktop. 2  Make completely free calls to other Hangouts users. 3  Call almost any phone number in the US and Canada for free, and get super low rates on international calls*. 4  Get voice calling for Hangouts on Android with Hangouts Dialer. 5  Download Hangouts Dialer on the Play Store"}]