[{"url": "http://www.beefandlamb.com.au/How_to/Cooking_beef_and_lamb/Preparation_tips/How_to_cook_sausages_just_perfectly", "passage_text": "1 Place a sheet of baking paper on oven tray. 2  Cut the sausage links and place the sausages over the baking paper, use a large enough oven tray so that it allows some room around each of the sausages. 3  Place sausages in oven and roast for 15 minutes or until cooked."}, {"url": "https://uk.answers.yahoo.com/question/index?qid=20081119080331AALp5jq", "passage_text": "Report Abuse. Well this is how i do mine Put the sausages in a roasting tin and place them in a medium oven (gas mark 4 or 180 degrees) for 35 to 45 minutes. Baking can dry the sausages so baste them in the juices 2 or 3 times during cooking."}, {"url": "http://www.beefandlamb.com.au/How_to/Cooking_beef_and_lamb/Preparation_tips/How_to_cook_sausages_just_perfectly", "passage_text": "1 Cut the sausage links and place the sausages over the baking paper, use a large enough oven tray so that it allows some room around each of the sausages. 2  Place sausages in oven and roast for 15 minutes or until cooked. 3  Shake the oven tray from time to time to turn the sausages so they brown evenly."}, {"url": "http://www.food.com/recipe/super-easy-baking-sausage-373812", "passage_text": "1 Place them back in the oven for another 10 minutes or until sausage is thoroughly cooked through. 2  Remove finished sausage to paper towels or brown paper and blot excess grease off of the links with paper towels. 3  Repeat process until entire 3-pounds of sausage is cooked."}, {"url": "http://www.wikihow.com/Cook-Italian-Sausage", "passage_text": "Place the baking sheet on the middle rack of the oven to ensure even cooking. Bake for 20 to 25 minutes. 1  Note that thicker sausages may need to bake longer. 2  Extremely large or thick links may need to be baked anywhere from 40 to 60 minutes. 3  If cooking them this long, however, you should turn the sausages at least once."}, {"url": "http://www.sausagelinks.co.uk/sausage-recipes/cooking-sausages/", "passage_text": "Baking. 20% of sausages are baked. To bake, put the sausages in a roasting tin and place them in a medium oven (gas mark 4 or 180 degrees) for 35 to 45 minutes. Baking can dry the sausages so baste them in the juices 2 or 3 times during cooking."}]