[{"url": "http://nchfp.uga.edu/how/freeze/shrimp.html", "passage_text": "Select high quality, fresh shrimp for freezing. Shrimp can be frozen cooked or raw, in or out of the shell. For maximum storage life and quality, freeze shrimp raw, with heads removed but shells still on. Be sure to wash and drain the shrimp if frozen raw. Quickly chill shrimp cooked before freezing."}, {"url": "http://stilltasty.com/fooditems/index/18320", "passage_text": "1 Refrigerate cooked shrimp in covered airtight containers. 2  To freeze, place shrimp in airtight plastic containers or heavy-duty freezer bags. 3  Freezer time shown is for best quality only — foods kept constantly frozen at 0° F will keep safe indefinitely. 1 Refrigerate within two hours of cooking. 2  Refrigerate cooked shrimp in covered airtight containers. 3  To freeze, place shrimp in airtight plastic containers or heavy-duty freezer bags. 4"}, {"url": "http://www.answers.com/Q/How_long_can_you_keep_frozen_uncooked_shrimp", "passage_text": "ANSWER:Unless frozen, shrimp breaks down rather rapidly. If you peel and de-vein, and soak in salted water, you can keep shrimp in a 34.5 degree refrigerator for up to 4 days. … After that the shrimp will spoil. Making the world better, one answer at a time. Most things frozen can last awhile, but....once you start to see lots of ice crystals on your frozen food, or places on the shrimp that might have dried out with some discoloration then it's probably freezer burnt and been in there too long. A couple months...."}, {"url": "https://answers.yahoo.com/question/index?qid=20081029211213AA8Iitc", "passage_text": "Report Abuse. Depends on how cold you keep the shrimp. The colder you keep it, the longer it will last. The health department will allow restaurants to keep and serve meat and seafood up to 7 days if kept at 41 F. However, I have never seen shrimp make it this long. Usually it is finished by the 5th day. "}, {"url": "http://www.answers.com/Q/How_long_can_you_keep_shrimp_in_freezer", "passage_text": "If this is frozen in an air tight container, you can keep it in the freezer for up to 3 to 4 months. If stored in freezer bags, it will not last as long. About a month. 1 person found this useful. Edit. Share to: Neila Rockson. 1,158,732 Contributions. Cooking is something I love to do. It is a true passion. "}, {"url": "http://www.ehow.com/decision_6904561_long-frozen-shrimp-freezer-home_.html", "passage_text": "If you've bought frozen shrimp in their original packaging, the packaging will often have a Use-by or Best before date on it. That's the vendor's estimate of how long your shrimp will retain their best flavor and quality. Usually it will be 4 to 6 months for uncooked shrimp, or about half that for cooked. You can still eat them after that time -- they'll be safe for as long as they stay properly frozen -- but their texture will suffer, they'll begin to acquire off-flavors from the freezer, and eventually they'll succumb to freezer burn. How to Do It. 1  For the best storage life, divide the frozen shrimp into meal-sized portions as soon as you get home. 2  Use a vacuum-sealer, if you have one, to extract as much air as possible. 3  Otherwise, use regular freezer bags but suck out as much air as you can, through a straw, before sealing."}, {"url": "http://www.ehow.com/decision_6904561_long-frozen-shrimp-freezer-home_.html", "passage_text": "For the longest storage life, keep your shrimp in a chest freezer rather than a refrigerator freezer. The relatively small freezer compartment in your fridge warms up quickly whenever you open it and takes time to return to its usual 0 degrees Fahrenheit. How to Do It. 1  For the best storage life, divide the frozen shrimp into meal-sized portions as soon as you get home. 2  Use a vacuum-sealer, if you have one, to extract as much air as possible. 3  Otherwise, use regular freezer bags but suck out as much air as you can, through a straw, before sealing."}]