[{"url": "http://www.thedentistsnetwork.net/newsletters/print/bryen/printBryen75.html", "passage_text": "Example of the After Tax Cost. Let’s illustrate the cost of a dental practice to a buyer using after tax dollars and see what the amount becomes once an agreement on the purchase price has been determined. We’ll use a purchase price of $500,000. "}, {"url": "http://smallbusiness.chron.com/average-expenses-dentists-47536.html", "passage_text": "Scottsdale Dental Business Management states that 10 percent of gross revenue is an average lab fee cost for most practices. Conversely, the cost of malpractice insurance for a dentist is static no matter the number of customers seen but can increase on an annual basis. Dental practices that see more patients and offer a wider variety of services spend more on the materials to accomplish this extra work. On average, dental supply expenses take up approximately 5 percent of the practice's revenue according to Dental Economics."}, {"url": "http://www.dentaleconomics.com/articles/print/volume-96/issue-9/features/the-real-cost-of-dentistry.html", "passage_text": "We will begin our cost analysis with a simple and basic dental procedure-a Class I occlusal composite filling (code D2391). We will use an average national fee schedule for the fee-for-service cost, which is $110, and we will use the average of 11 PPO insurance plans for the comparison (Figure 2). Additionally, we will calculate the average cost to keep the dental office open per hour based upon a national average of rural and urban areas. In other words, if a dental office can net $312 an hour after all expenses, that office should fall into the $525,000 average yearly revenue bracket. Here is the clinical technique we will use to illustrate completing a Class I restoration."}, {"url": "http://www.dentaleconomics.com/articles/print/volume-96/issue-9/features/the-real-cost-of-dentistry.html", "passage_text": "Click here to enlarge image. The average annual overhead for a dental office (not including the dentist’s salary) is $350,000. The average clinician works 33 hours per week for 48 weeks, which is 1,600 hours per year. In other words, if a dental office can net $312 an hour after all expenses, that office should fall into the $525,000 average yearly revenue bracket. Here is the clinical technique we will use to illustrate completing a Class I restoration."}, {"url": "http://www.dentaleconomics.com/articles/print/volume-101/issue-2/features/purchasing-a-practice.html", "passage_text": "Price. Price is the easier of the two concepts. Price, as with any commodity, is determined by the marketplace. Currently the national average for the price of a dental practice is approximately 65% of the past year's gross receipts. This rule of thumb value can range from 50% of gross in rural areas, to 100% of gross in desirable urban areas. Essentially, the local prevailing market will dictate the price. "}, {"url": "http://howtoopenadentaloffice.com/dental-practice-start-up-costs/", "passage_text": "– 3 strategies for any dentist to afford the costs. The Average Range of. Costs for Start-Up Dental Practices. Over the last few years, the average range we’ve seen has been between $250,000 – $500,000. I’ll break that number into categories of spending below. For some, that sounds like good news since they’ve heard it can cost seven figures."}, {"url": "http://www.dentistryiq.com/articles/2014/09/starting-a-dental-practice-how-can-you-afford-it.html", "passage_text": "At current rates of 5%, borrowing $500,000 will cost a dentist $7,067 for a seven-year term, $5,303 for a 10-year term, or $4,625 for a 12-year term. Taking into account practice overhead, it will take monthly collections of $21,200, $16,000, or $14,000 respectively to cover the debt service. We should also look at controlling our supply expenses and bank fees. If an average dentist spends $50,000 annually on clinical supplies and $10,000 on credit card processing fees, the ability to save on these costs by using a different mindset can have a tangible effect on the profitability of a practice. The dental supply industry is very fragmented"}, {"url": "http://www.ada.org/en/science-research/health-policy-institute/dental-statistics/income-billing-and-other-dentistry-statistics", "passage_text": "The average net income for a private practitioner in 2013 was $180,950 for a general practitioner and $283,900 for a specialist. Source: Income, Gross Billings, and Expenses: Selected 2013 Results from the Survey of Dental Practice (Tables in Excel). Available as a free download. The average gross billings per dentist for owner dentists in 2013 was $646,440 for a general practitioner and $857,110 for a specialist. Source: Income, Gross Billings, and Expenses: Selected 2013 Results from the Survey of Dental Practice (Tables in Excel)."}]