[{"url": "http://www.answers.com/Q/What_is_the_importance_of_Australia_Day", "passage_text": "Australia Day is celebrated on 26 January each year. The day commemorates the arrival of the First Fleet in 1788, the unfurling of the British flag at Sydney Cove and the pr … oclamation of British sovereignty over the eastern seaboard of Australia."}, {"url": "http://www.answers.com/Q/Why_is_Australia_day_important_and_celebrated", "passage_text": "Australia Day commemorates the arrival of the First Fleet at Sydney Cove in New South Wales on 26 January 1788. This was a significant date because it marked the beginning of … European settlement in and colonisation of Australia."}, {"url": "http://www.answers.com/Q/Why_is_Australia_day_important_and_celebrated", "passage_text": "Australia Day celebrates the arrival of the First Fleet of European settlers on Australia's shores, on 26 January 1788. There continues to be much debate about whether this is … an appropriate day to celebrate any longer, as it marked the beginning of the displacement of the indigenous people."}, {"url": "http://www.answers.com/Q/What_is_the_importance_of_Australia_Day", "passage_text": "Australia Day commemorates the arrival of the First Fleet at Sydney Cove in New South Wales on 26 January 1788. This was a significant date because it marked the beginning of … European settlement in and colonisation of Australia."}, {"url": "http://www.anzac.com/anzac_day.html", "passage_text": "Anzac Day. Anzac Day is a very special day both in Australia and New Zealand. The anniversary of the Anzac day is probably Australia\\'s most important national occasion. It marks the anniversary of the first major military action fought by New Zealand and Australian forces during the First World War."}, {"url": "http://www.answers.com/Q/Why_is_Australia_day_important_and_celebrated", "passage_text": "Australia Day is commemorated on 26th January, and is the anniversary of the arrival of Governor Phillip and the First Fleet at Sydney Cove, to found a penal colony in New Sou … th Wales, as Australia was then known. It is celebrated in all states of Australia with a national holiday."}, {"url": "http://www.army.gov.au/Our-history/Traditions/ANZAC-Day", "passage_text": "Anzac Day. Anzac Day is one of Australia’s most important national commemorative occasions. It marks the anniversary of the first major military action fought by Australian and New Zealand forces during the First World War."}, {"url": "http://www.answers.com/Q/What_is_the_importance_of_Australia_Day", "passage_text": "Australia Day, celebrated annually on January 26, commemorates the landing of the First Fleet at Port Jackson, and the raising of the Union Jack to claim the land as belonging to England. It has nothing to do with Captain Cook landing on Australian shores in 1770."}]