[{"url": "http://www.cropsreview.com/what-is-agriculture.html", "passage_text": "In relation to crop farming and livestock farming, the term “agriculture” may be defined as: the art and science of growing plants and other crops and the raising of animals for food, other human needs, or economic gain. This definition I use as a compressed answer to the main question what is agriculture."}, {"url": "http://www.sustainabletable.org/246/sustainable-agriculture-the-basics", "passage_text": "Sustainable Agriculture. In simplest terms, sustainable agriculture is the production of food, fiber, or other plant or animal products using farming techniques that protect the environment, public health, human communities, and animal welfare."}, {"url": "http://www.westernsare.org/About-Us/What-is-Sustainable-Agriculture", "passage_text": "Sustainable agriculture can be defined in many ways, but ultimately it seeks to sustain farmers, resources and communities by promoting farming practices and methods that are profitable, environmentally sound and good for communities. Sustainable agriculture fits into and complements modern agriculture."}, {"url": "http://www.e-agriculture.org/", "passage_text": "The e-Agriculture Community of Practice, in collaboration with the Food and Agriculture Organization of the United Nations (FAO), the International Telecommunication Union (ITU) and the Technical Centre for Agriculture and Rural Cooperation (CTA) organized its 25th e-Agriculture forum entitled “..."}, {"url": "http://kids.mongabay.com/lesson_plans/lisa_algee/agriculture.html", "passage_text": "Photos by Rhett Butler. What happens with agriculture is that this web is interrupted. Instead of having herbivores eat the plants, the plants are protected for human consumption. This means that not only are plant eating animals excluded from the food web, but also carnivorous animals and even decomposers."}, {"url": "http://www.cropsreview.com/what-is-agriculture.html", "passage_text": "4. Agriculture is practiced for the purpose of producing food and other human needs such as clothing, shelter, medicines, weapons, tools, ornaments, and indefinitely many more. It is likewise practiced as a business for economic gain. The ultimate purpose is essentially important in clarifying what is agriculture."}, {"url": "http://www.e-agriculture.org/", "passage_text": "Read CTA's latest ICT UPDATE-More than Mobile. The guest article shows the power of the mobile revolution and its implications for agricultural development in ACP and beyond. But the conclusion is that, to be able to have the desired impact, it is more than mobile."}]