[{"url": "http://www.meaning-of-names.com/persian-names/jasmine.asp", "passage_text": "Meaning of Jasmine. Persian name. In Persian, the name Jasmine means-a climbing vine plant that has fragrant flowers used to make perfume.. Other origins for the name Jasmine include-Persian, African.The name Jasmine is most often used as a girl name or female name. Persian Name Meaning-a climbing vine plant that has fragrant flowers used to make perfume. Origin-Persian. Alternate Origins-African."}, {"url": "https://en.wikipedia.org/wiki/Jasmine_(given_name)", "passage_text": "Jasmine is a feminine given name. It refers to the scented flowering plant, jasmine. It is originated from Persian یاسمین or یاسمن, which means the Yas flower. The name has been popular in a number of countries in recent years. In the United States, it first entered the top 1,000 list of most popular names in 1973"}, {"url": "http://www.sheknows.com/baby-names/name/jasmine", "passage_text": "Persian Meaning: The name Jasmine is a Persian baby name. In Persian the meaning of the name Jasmine is: From the name of the flower, jasmine. American Meaning: The name Jasmine is an American baby name. In American the meaning of the name Jasmine is: From the name of the flower, jasmine."}, {"url": "http://www.thinkbabynames.com/meaning/0/Jasmine", "passage_text": "Jasmine. Jasmine /jas-mine/ [2 sylls.] as a girls' name is pronounced JAZ-min, jaz-MEEN. It is of Old French and Persian origin, and the meaning of Jasmine is jasmine. Refers to the climbing plant with delicate, fragrant flowers, which derives from Yasmin. The name was made popular by character Princess Jasmine in the film Aladdin (1990). The name is popular among Hispanic and African American families. Jasmine is a very popular first name for females (#404 out of 4276, Top 9%) and also a very popular last name for all people (#43290 out of 150436, Top 29%). (2000 U.S. Census). Presented below is the birth name popularity of Jasmine for girls."}, {"url": "http://www.thenamemeaning.com/jasmine/", "passage_text": "Jasmine Name Meaning. The meaning of Jasmine is “A Flower in the Olive Family”. Keep in mind that many names may have different meanings in other countries and languages, so be careful that the name that you choose doesn’t mean something bad or unpleasant. Form of: Yasmin. The meaning of the name “Jasmine” is: “A Flower in the Olive Family”. .adslot_1 { width: 336px; height: 280px; } @media (max-width:350px) { .adslot_1 { width: 300px; height: 250px; } }."}, {"url": "http://www.babynamespedia.com/meaning/Jasmine/f", "passage_text": "[ 2 syll. ja-smi-ne, jas-m- ine ] The baby girl name Jasmine is also used as a boy name, though it is far more popular for girls. It is pronounced JH AE ZMihN †. Jasmine is of Old Persian origin. It is used mainly in English and French. An older form of the name is Jasamin (Old Persian). The first name is derived from the name of the fragrant flower which is used to make perfume. The flower name is itself derived via Old French from the Persian element yasmin. "}, {"url": "http://www.behindthename.com/name/Jasmine", "passage_text": "Meaning & History. From the English word for the climbing plant with fragrant flowers which is used for making perfumes. It is derived from Persian یاسمن (yasamen) (which is also a Persian name). "}]