[{"url": "http://www.answers.com/Q/Where_is_the_gallbladder_located_on_the_human_body", "passage_text": "The main duct is called the common bile duct. It is  common to the liver, gallbladder and farther down line, to the  pancreas as well. on the left side of your liver   It is on the right side of your body. The gallbladder is beneath your liver. It is behind your lower right ribs. Your gallbladder is located on the right side of your body, connected to your liv … er. 1  A General Medical Overview of Gallbladder Tests Gallbladder disease is a comprehensive term that describes many conditions that upset the normal functioning of the gallbladder."}, {"url": "http://www.organsofthebody.com/gall-bladder/", "passage_text": "Gallbladder Facts. The digestive system is perhaps the largest system in the human body with many accessory organs and glands to perform its overall digestive function. Gall bladder is a small gland located at the base of liver that assists in the emulsification, digestion and absorption of fats in food. Bile is secreted by liver and transferred to gall bladder for temporary storage."}, {"url": "http://www.myhealthyfeeling.com/where-is-the-liver-located-in-the-human-body/", "passage_text": "The liver is located on the upper side of your right abdomen below your diaphragm and enclosed by your rib cage. At the back of your liver is where the gallbladder is located and closer to the spleen, stomach, intestines and kidneys. You can actually feel your liver by laying your fingers under your right rib cage. The liver processes everything you ingest into your body, from foods to medicines, even lotions and deodorants"}, {"url": "https://en.wikipedia.org/wiki/Gallbladder", "passage_text": "In vertebrates the gallbladder (also gall bladder, biliary vesicle or cholecyst), is a small organ where bile (a fluid produced by the liver) is stored and concentrated before it is released into the small intestine. The gallbladder is a hollow organ that sits just beneath the right lobe of the liver. In adults, the gallbladder measures approximately 8 centimetres (3.1 in) in length and 4 centimetres (1.6 in) in diameter when fully distended. The gallbladder has a capacity of about 100 mL."}, {"url": "http://www.buzzle.com/articles/where-is-the-gallbladder-located-in-the-body.html", "passage_text": "The gallbladder is a small, green, pear-shaped organ located in the abdominal cavity of vertebrates. It grows to a length of 8 centimeters, and has a diameter of 4 centimeters. The function of the gallbladder is to store the bile secreted by the liver. Location of the Gallbladder. ► The gallbladder is located beneath the liver. Its location corresponds to the lowest ribs, on the right side of the rib cage."}, {"url": "http://www.webmd.com/digestive-disorders/picture-of-the-gallbladder", "passage_text": "Front View of the Gallbladder. The gallbladder is a small pouch that sits just under the liver. The gallbladder stores bile produced by the liver. After meals, the gallbladder is empty and flat, like a deflated balloon. Before a meal, the gallbladder may be full of bile and about the size of a small pear. "}, {"url": "http://www.answers.com/Q/Where_is_the_gallbladder_located", "passage_text": "Making the world better, one answer at a time. The gallbladder is located behind the liver on the right side of the rib cage. It hits up against the under surface of the liver. There is a duct from the liver to the small intestine which is joined by a duct from and to the gallbladder. The main duct is called the common bile duct. It is common to the liver, gallbladder and farther down line, to the pancreas as well. on the left side of your liver. It is on the right side of your body. The gallbladder is beneath your liver."}, {"url": "http://www.healthline.com/human-body-maps/gallbladder", "passage_text": "Gallbladder. The gallbladder is a pear-shaped, hollow structure located under the liver and on the right side of the abdomen. Its primary function is to store and concentrate bile, a yellow-brown digestive enzyme produced by the liver. The gallbladder is part of the biliary tract"}]