[{"url": "http://www.payscale.com/research/US/Employer=Shop-Rite_Super_Market%2c_Inc./Hourly_Rate", "passage_text": "Jobs. The highest average salaries go to Supermarket Department Manager, Dairys, who bring in close to around $21.27 per hour, though Pharmacy Technicians are not far behind at $12.45 along with Stockers (about $11.50) and Food Service Workers ($11.50). Cashiers are among the lowest paid at a median salary of $8.50. Respondents who have been working for five to nine years make approximately $12.28 per hour on average. The greater proportion of employees (38 percent) report one to four years of experience and bring home median pay of $9.26 per hour."}, {"url": "http://www.twc.state.tx.us/news/efte/c_regular_rate_hourly.html", "passage_text": "Thus a $6 hourly rate will bring, for an employee who works 46 hours, a total weekly wage of $294 (46 hours at $6 plus 6 at $3). In other words, the employee is entitled to be paid an amount equal to $6 an hour for 40 hours and $9 an hour for the 6 hours of overtime, or a total of $294. (b) Hourly rate and bonus. If the employee receives, in addition to his earnings at the hourly rate, a production bonus of $9.20, the regular hourly rate of pay is $6.20 an hour (46 hours at $6 yields $276; the addition of the $9.20 bonus makes a total of $285.20; this total divided by 46 hours yields a rate of $6.20)."}, {"url": "http://www.payscale.com/research/US/Employer=Shop-Rite_Super_Market%2c_Inc./Hourly_Rate", "passage_text": "Salaries approach $13.88 per hour for Certified ServSafe Food Handlers; non-accredited workers make much less. At Shop-Rite Super Market, Inc., employees who hold an Associate's Degree receive the highest pay at approximately $15.88."}, {"url": "http://www.illinois.gov/idol/Laws-Rules/FLS/Pages/minimum-wage-law.aspx", "passage_text": "Guarantees a minimum wage of $8.25 per hour for workers 18 years of age and older; workers under 18 may be paid $.50 per hour less than the adult minimum wage. Credit for tips may not exceed 40% of the applicable minimum wage. Employers may apply for licenses to pay sub-minimum rates to learners and certain workers with physical and mental limitations. Overtime must be paid after 40 hour of work per week at time and one-half the regular rate."}, {"url": "http://www.twc.state.tx.us/news/efte/c_regular_rate_hourly.html", "passage_text": "As an example, if the normal hourly rate is $12.50 per hour, and an employee receives a shift differential of $1.50 per hour, the regular rate of pay for that employee would be $14.00 per hour. 29 C.F.R. 778.110 covers the issue of the regular rate for employees who are paid a simple hourly rate."}]