[{"url": "http://nihseniorhealth.gov/parkinsonsdisease/whatcausesparkinsonsdisease/01.html", "passage_text": "A Shortage of Dopamine. Parkinson's disease occurs when nerve cells, or neurons, in an area of the brain that controls movement become impaired and/or die. Normally, these neurons produce an important brain chemical known as dopamine, but when the neurons die or become impaired, they produce less dopamine."}, {"url": "http://www.nhs.uk/Conditions/Parkinsons-disease/Pages/Causes.aspx", "passage_text": "Causes of Parkinson's disease. Parkinson's disease is caused by a loss of nerve cells in the part of the brain called the substantia nigra. Nerve cells in this part of the brain are responsible for producing a chemical called dopamine. It is not known why the loss of nerve cells associated with Parkinson's disease occurs, although research is ongoing to identify potential causes. Currently, it is believed that a combination of genetic changes and environmental factors may be responsible for the condition."}, {"url": "http://www.webmd.com/parkinsons-disease/guide/parkinsons-causes", "passage_text": "In this article. Font Size. A. A. A. Parkinson's disease is caused by the progressive impairment or deterioration of neurons (nerve cells) in an area of the brain known as the substantia nigra. When functioning normally, these neurons produce a vital brain chemical known as dopamine. There is considerable controversy surrounding the possibility of a genetic cause of Parkinson's disease. In a small number of families, specific genetic abnormalities leading to the illness have been identified."}, {"url": "https://en.wikipedia.org/wiki/Parkinson%27s_disease", "passage_text": "Parkinson's disease is the most common form of parkinsonism and is usually defined as primary parkinsonism, meaning parkinsonism with no external identifiable cause. In recent years several genes that are directly related to some cases of Parkinson's disease have been discovered. Parkinson's disease (PD, also known as idiopathic or primary parkinsonism, hypokinetic rigid syndrome (HRS), or paralysis agitans) is a degenerative disorder of the central nervous system mainly affecting the motor system."}, {"url": "http://www.medicinenet.com/parkinsons_disease/page2.htm", "passage_text": "Although it is well known that lack of dopamine causes the motor symptoms of Parkinson's disease, it is not clear why the dopamine-producing brain cells deteriorate. Genetic and pathological studies have revealed that various dysfunctional cellular processes, inflammation, and stress can all contribute to cell damage. "}, {"url": "http://www.webmd.com/parkinsons-disease/default.htm?names-dropdown=ID", "passage_text": "Parkinsons Overview. Parkinson’s disease affects the nerve cells in the brain that produce dopamine. Parkinson’s disease symptoms include muscle rigidity, tremors, and changes in speech and gait. After diagnosis, treatments can help relieve symptoms, but there is no cure. Symptoms of Parkinson's disease differ from person to person. They also change as the disease progresses. Symptoms that one person gets in the early stages of the disease, another person may not get until later-or not at all. Symptoms typically begin appearing between the ages of 50 and 60."}, {"url": "http://www.mayoclinic.org/diseases-conditions/parkinsons-disease/basics/causes/CON-20028488", "passage_text": "In Parkinson's disease, certain nerve cells (neurons) in the brain gradually break down or die. Many of the symptoms are due to a loss of neurons that produce a chemical messenger in your brain called dopamine. When dopamine levels decrease, it causes abnormal brain activity, leading to signs of Parkinson's disease. The cause of Parkinson's disease is unknown, but several factors appear to play a role, including: Your genes. Researchers have identified specific genetic mutations that can cause Parkinson's disease, but these are uncommon except in rare cases with many family members affected by Parkinson's diseas"}, {"url": "https://en.wikipedia.org/wiki/Parkinson%27s_disease", "passage_text": "The motor symptoms of Parkinson's disease result from the death of dopamine-generating cells in the substantia nigra, a region of the midbrain. The causes of this cell death are poorly understood. Parkinson's disease (PD, also known as idiopathic or primary parkinsonism, hypokinetic rigid syndrome (HRS), or paralysis agitans) is a degenerative disorder of the central nervous system mainly affecting the motor system."}]