[{"url": "http://www.everydayhealth.com/drugs/albuterol", "passage_text": "A: Albuterol (Ventolin, Proair, Proventil) is a bronchodilator that relaxes muscles in the airways and increases air flow to the lungs. Albuterol is used to treat or prevent bronchospasm in people with reversible obstructive airway disease. Albuterol is also used to prevent exercise-induced bronchospasm."}, {"url": "http://www.goodrx.com/proair-hfa/what-is", "passage_text": "Uses For Proair HFA. Albuterol is used to treat or prevent bronchospasm in patients with asthma, bronchitis, emphysema, and other lung diseases. This medicine is also used to prevent wheezing caused by exercise (exercise-induced bronchospasm)."}, {"url": "http://www.goodrx.com/proair-hfa/what-is", "passage_text": "The albuterol inhalation aerosol (eg, Proair® HFA) and albuterol inhalation powder (eg, Proair® Respiclick™) is used with a special inhaler that comes with patient instructions. Read the directions carefully before using this medicine."}, {"url": "http://www.everydayhealth.com/drugs/albuterol", "passage_text": "Albuterol is the generic form of the brand-name drugs Proventil, ProAir, and Ventolin, which are used to treat lung diseases such as asthma and chronic obstructive pulmonary disease (COPD). Albuterol can quickly relieve shortness of breath, coughing, wheezing, and chest tightness."}, {"url": "http://www.webmd.com/drugs/2/drug-144702/proair-hfa-inhalation/details", "passage_text": "Uses. Albuterol (also known as salbutamol) is used to prevent and treat wheezing and shortness of breath caused by breathing problems (such as asthma, chronic obstructive pulmonary disease). It is also used to prevent asthma brought on by exercise. It is a quick-relief drug."}, {"url": "http://www.webmd.com/drugs/2/drug-144702/proair-hfa-inhalation/details", "passage_text": "Albuterol (also known as salbutamol) is used to prevent and treat wheezing and shortness of breath caused by breathing problems (such as asthma, chronic obstructive pulmonary disease). It is also used to prevent asthma brought on by exercise. It is a quick-relief drug."}]