[{"url": "http://pets.thenest.com/life-expectancy-staffordshire-terrier-9455.html", "passage_text": "Typical Life Expectancy. On average, owners can anticipate Staffordshire Terriers to live between 9 and 15 years. However, all members of the breed are indeed individuals with different medical circumstances, so these numbers often greatly vary. Some Staffordshire Terriers may live less than 9 years, while others may surpass 15 years by a mile."}, {"url": "http://www.caninejournal.com/life-expectancy-of-dogs/", "passage_text": "Dog Size. Research shows that larger dogs live for a shorter period of time when compared to smaller ones. For example, an Irish Wolfhound (average 115 lbs) has an average lifespan of 7 years, while a Jack Russell Terrier (average 15 lbs) can live up to 13-16 years. Chihauhuas are normally referred to as the breed with the longest lifespan. They average 15-20 years and are one of the smallest dog breeds. The oldest Chihuahua on record 1, Megabyte, died at the age of 20 years and 265 days."}, {"url": "http://www.yorkieinfocenter.com/yorkshire-terrier-life-span", "passage_text": "The life expectancy of the Yorkshire Terrier is between is between 12 to 15 years with a median age of 13.5 years. Female Yorkies live-on average - 1.5 years longer than males. Since this is such a threat to the life span of the Yorkshire Terrier, moderate to severe cases are treated with surgery. Over 50% of dogs that have shunts severe enough to cause clinical signs and changes to behavior will die in one year without this surgical procedure."}, {"url": "https://answers.yahoo.com/question/index?qid=20070102140008AABfhYf", "passage_text": "Report Abuse. Cairn Terriers make wonderful pets for all ages of family members and with proper care, which includes a healthy diet (making sure to keep them trim and fit), exercise and lots of love, they have an average life span of 12-15 years with many living longer. Source(s): Cairn Terrier Club of America www.puppydogweb.com."}, {"url": "http://www.bterrier.com/boston-terrier-life-span-average-expectancy/", "passage_text": "The average life span of a Boston Terrier is around 11 and 15 years. The life span all depends according to the general health, diet, and living conditions of the individual dog. "}, {"url": "http://www.yorkieinfocenter.com/yorkshire-terrier-life-span", "passage_text": "There are 2 main reasons why this breed does have a life span that is longer than the national average: 1) Toy breeds life longer than medium and large breed dogs. 2) The Yorkshire Terrier is a rather healthy breed. The majority of health issues that Yorkies contend with are not fatal. Since this is such a threat to the life span of the Yorkshire Terrier, moderate to severe cases are treated with surgery. Over 50% of dogs that have shunts severe enough to cause clinical signs and changes to behavior will die in one year without this surgical procedure."}, {"url": "http://www.answers.com/Q/What_is_the_average_life_expectancy_for_a_rat_terrier", "passage_text": "The Rat Terrier life expectancy is about 25 years. Well, the long life span of Rat Terrier will never make you feel lonely and keep your house lively. The average Rat Terrier life span is about 15 - 18 years. With good dog care you can extend the life span of Rat Terrier to over 25 years. Many experts even say the Rat Terrier life expectancy is just 13 to 16"}]