[{"url": "http://www.uky.edu/~brmacp/oralhist/module4/lecture/oh4lect.htm", "passage_text": "Dental pulp is an unmineralized oral tissue composed of soft connective tissue, vascular, lymphatic and nervous elements that occupies the central pulp cavity of each tooth. Pulp has a soft, gelatinous consistency. Figure 1 (adjacent), indicates that by either weight or volume, the majority of pulp (75-80%) is water."}, {"url": "http://www.mouthhealthy.org/en/az-topics/t/tooth/", "passage_text": "Tooth. Your teeth are composed of four dental tissues. Three of them—enamel, dentin and cementum—are hard tissues. The fourth tissue—pulp, or the center of the tooth that contains nerves, blood vessels and connective tissue—is a soft, or non-calcified, tissue."}, {"url": "http://www.mouthandteeth.com/anatomy/tooth-anatomy.htm", "passage_text": "The Dental Pulp. The dental pulp is the soft living tissue of the tooth. It can be found in the pulp chamber, a cavity in the center of the crown of each tooth, and inside the root canals which connect the pulp cavity with the opening at the root tip (apex) and through that with the rest of the body."}, {"url": "http://www.mouthhealthy.org/en/az-topics/t/tooth/", "passage_text": "1 The portion of the pulp cavity inside the root of a tooth; the chamber within the root of the tooth that contains the pulp. 2  Cementum. 3  Hard connective tissue covering the tooth root, giving attachment to the periodontal ligament. 4  Periodontal Ligament."}, {"url": "http://www.tpub.com/dental1/26.htm", "passage_text": "The dental pulp, (figure 4-7), is the soft tissue of the tooth, which develops from the connective tissue of the dental papilla. Within the crown, the chamber containing the dental pulp is called the pulp chamber. The pulp contains blood vessels and nerves that enter through the apical foramen."}, {"url": "http://www.answers.com/Q/What_are_the_three_types_of_tooth_tissues", "passage_text": "The structure of a tooth includes three major divisions: the tooth root, the dentin (pulp) and the enamel. The tooth root is connected to the blood supply, which carries oxygen and nutrients to the cell, including calcium to replace worn enamel."}, {"url": "http://www.mouthandteeth.com/anatomy/tooth-anatomy.htm", "passage_text": "If we take a section of a human tooth we will be able to distinguish 4 different types of tissues, enamel, cementum, dentin, and pulp tissue. The main characteristics of each part of the tooth structure are described in this article (for more detailed information about each one follow the links to the specific pages)."}]