[{"url": "http://www.answers.com/Q/What_is_the_difference_between_a_neutron_and_a_nucleus", "passage_text": "A nuclide, also known as an isotope, … is a nucleus with a specified number of both protons and neutrons. So, for example, we know that the element carbon always has six protons in its nucleus; that is what makes it carbon rather than a different element. But it can have different numbers of neutrons. All of the different nuclei that exist that have the same number of protons, but different number of neutrons, are isotopes of whatever atom is being defined by the number of protons in that nucleus."}, {"url": "http://www.differencebetween.com/difference-between-neutron-and-vs-neutrino/", "passage_text": "Neutrons and protons in the nucleus are collectively known as nucleons. By looking at the atomic number and the mass number of an element, we can determine the number of neutrons it has. Number of neutrons= mass number-atomic number. Rutherford first described the neutron in 1920. Neutron does not have a charge. Its mass is 1.674927 X 10 −27 kg, which is slightly higher than the mass of a proton. A nucleus of an atom also contains protons, which are positively charged. If there are only protons in the nuclei, the repulsion between those will be higher."}, {"url": "http://www.answers.com/Q/What_is_the_difference_between_a_neutron_and_a_nucleus", "passage_text": "Confidence votes 3. Well a neutron and a nucleus are different from each other because a neutron is a particle within the atom nucleus with a neutral charge The nucleus however is all the neutrons and the protons. Nucleus could also mean the nucleus of a cell, which is commonly refered to as well, but is completely different. All of the different nuclei that exist that have the same number of protons, but different number of neutrons, are isotopes of whatever atom is being defined by the number of protons in that nucleus."}, {"url": "https://en.wikipedia.org/wiki/Beta_decay", "passage_text": "In nuclear physics, beta decay (β -decay) is a type of radioactive decay in which a proton is transformed into a neutron, or vice versa, inside an atomic nucleus. This process allows the atom to move closer to the optimal ratio of protons and neutrons. Electron capture is sometimes included as a type of beta decay, because the basic nuclear process, mediated by the weak force, is the same. In electron capture, an inner atomic electron is captured by a proton in the nucleus, transforming it into a neutron, and an electron neutrino is released."}, {"url": "http://www.differencebetween.com/difference-between-neutron-and-vs-neutrino/", "passage_text": "Neutron is a sub atomic particle, which resides in the nucleus of an atom. It is denoted by n. Neutron does not have a charge. Its mass is 1.674927 X 10 −27 kg, which is slightly higher than the mass of a proton. A nucleus of an atom also contains protons, which are positively charged. If there are only protons in the nuclei, the repulsion between those will be higher. Therefore, presence of neutrons is important to bind the protons together in the nuclei. Single element can have different number of neutrons in their nuclei"}, {"url": "http://www.differencebetween.com/difference-between-proton-and-vs-neutron/", "passage_text": "Most of the space in an atom is empty. The attractive forces between the positive charged nucleus (positive charge due to protons) and the negatively charged electrons maintain the atom’s shape. Both protons and neutrons are nucleons. They are located together in the nuclei of atoms bound by the nuclei force. • Proton has a positive charge, but neutrons are electrically neutral. • The mass of a neutron is little bit larger than that of a proton. • Protons are considered to be stable, because they have very long half life times (years). But neutrons are unstable and have very short half lifetimes."}, {"url": "http://www.answers.com/Q/What_is_the_difference_between_a_neutron_a_electron_a_proton_and_a_nucleus", "passage_text": "Electrons have a negative (-) charge.   Proton and neutron are roughly the same size  Electron … s are considerably smaller than protons or neutrons  Protons and neutrons have a relative atomic mass of 1  The mass of electrons is so small it is not included in calculations of an atom's mass. The nucleus is the cental part of atoms. It is so small, that the dimension of nucleus is like 1/ 1.000.000.000.000.000 m. Nucleus is form by the protons and the neutrons. Proton have positive electrical charge. Neutron don`t have elctrical charge. All protons and all neutrons form together the nucleu"}, {"url": "https://en.wikipedia.org/wiki/Neutron", "passage_text": "Their properties and interactions are described by nuclear physics. The nucleus consists of Z protons, where Z is called the atomic number, and N neutrons, where N is the neutron number. The atomic number defines the chemical properties of the atom, and the neutron number determines the isotope or nuclide. The terms isotope and nuclide are often used synonymously, but they refer to chemical and nuclear properties, respectively. The atomic mass number, symbol A, equals Z+N. "}]