[{"url": "http://www.healthgrades.com/symptoms/tremor-symptoms", "passage_text": "The term “tremor” most accurately refers to a small, rhythmic shaking movement that occurs in a back-and-forth pattern. However, tremor is also commonly used to refer to sudden jerking or muscle spasms of the body or extremities, such as the symptoms described for restless leg syndrome. Tremors can be classified as rest or action tremors. Rest tremors are movements that occur while your body is at rest, such as shaking of the arms or hands while they are supported on your lap."}, {"url": "http://www.freemd.com/s1/uncontrolled-shaking.htm", "passage_text": "Uncontrolled Shaking 62 Causes. The freeMD virtual doctor has found 62 conditions that can cause Uncontrolled Shaking. Mouse over to view each condition's most common symptoms. There are 5 common conditions that can cause Uncontrolled Shaking. There are 17 somewhat common conditions that can cause Uncontrolled Shaking"}, {"url": "http://www.healthgrades.com/symptoms/tremor-symptoms", "passage_text": "Tremor symptoms are involuntary muscle movements that can occur in a specific body area. The most commonly affected and most noticeable areas include the hands, arms, and head, as well as a quavering voice if the tremor affects the voice box (larynx). Tremors can be classified as rest or action tremors. Rest tremors are movements that occur while your body is at rest, such as shaking of the arms or hands while they are supported on your lap."}, {"url": "http://symptomchecker.webmd.com/multiple-symptoms?symptoms=seizures-(uncontrollable-jerking-of-limbs)%7Cshaking-hands-or-tremor&symptomids=468%7C394&locations=52%7C50", "passage_text": "WebMD Symptom Checker helps you find the most common medical conditions indicated by the symptoms seizures (uncontrollable jerking of limbs) and shaking hands or tremor including Epilepsy (tonic clonic or grand mal seizures), Benign essential tremor, and Fever seizures in children. "}, {"url": "http://www.webmd.com/brain/understanding-essential-tremor-making-diagnosis", "passage_text": "A. Essential tremor, sometimes referred to as ET, is a nerve disorder characterized by uncontrollable shaking -- or tremors -- in different parts and on different sides of the body. Areas affected often include the hands, arms, head, larynx, or voice box (making the voice sound shaky), tongue, chin, and other areas. Symptoms more unique to essential tremor include: 1  Uncontrollable tremors that occur for brief periods of time. 2  A shaking voice. 3  Nodding head. 4  Tremors that worsen during periods of emotional stress."}, {"url": "http://www.livingwithanxiety.com/anxiety-symptoms-shaking.htm", "passage_text": "Other symptoms associated with uncontrollable shaking. Other symptoms that are associated with uncontrollable shaking could be: numbness or tingling of the arms, hands, or feet. weak legs, feeling dizzy or lightheaded. It's difficult and even frustrating to understand the symptoms you may have, but there are answers"}, {"url": "http://www.webmd.com/brain/essential-tremor-basics", "passage_text": "A. Essential tremor (ET) is a nerve disorder characterized by uncontrollable shaking, or tremors, in different parts and on different sides of the body. Areas affected often include the hands, arms, head, larynx (voice box), tongue, and chin. The lower body is rarely affected. The primary symptoms associated with essential tremor include: 1  Uncontrollable shaking that occurs for brief periods of time. 2  Shaking voice. 3  Nodding head. 4  Tremors that worsen during periods of emotional stress."}]