[{"url": "http://www.answers.com/Q/What_is_a_reactant_and_a_product", "passage_text": "The substances used up in a reaction are the reactants. The new substances made are called the products.   The terms reactant and product can be used to describe cons … tituents of individual enzymatic reactions or entire metabolic pathways. Reactants are the substances used in a chemical reaction, usually on the left side of the reaction arrow. The products are the things that are made after the reacton is comple … te. 7 people found this useful. Graham Howarth."}, {"url": "http://www.answers.com/Q/What_are_reactants", "passage_text": "Reactants (or 'substrates') are two or more elements/ compounds that chemically interact to form a new substance. They are the starting materials for a reaction and are always found at the left side of a chemical equations. A reactant is one of the inputs in a reaction, that get changed. The word reactant is used in chemistry. A substance that has a reaction and undergoes a change is considered reactant"}, {"url": "http://www.answers.com/Q/What_is_a_reactant_and_a_product", "passage_text": "The substances that are initially present and consumed in a chemical reaction are called reactants and the substance which is formed at the end of the reaction is called … products.. 2 people found this useful. Reactants are the substances used in a chemical reaction, usually on the left side of the reaction arrow. The products are the things that are made after the reacton is comple … te. 7 people found this useful. Graham Howarth."}, {"url": "https://en.wikipedia.org/wiki/Chemical_reaction", "passage_text": "The substance (or substances) initially involved in a chemical reaction are called reactants or reagents. Chemical reactions are usually characterized by a chemical change, and they yield one or more products, which usually have properties different from the reactants. "}, {"url": "https://en.wikipedia.org/wiki/Reagent", "passage_text": "Although the terms reactant and reagent are often used interchangeably, a reactant is more specifically a substance that is consumed in the course of a chemical reaction. Solvents, although they are involved in the reaction, are usually not referred to as reactants. "}, {"url": "http://www.thefreedictionary.com/Reactants", "passage_text": "Noun. 1. reactant-a chemical substance that is present at the start of a chemical reaction. chemical, chemical substance-material produced by or used in a reaction involving changes in atoms or molecules. 1  Facebook. 2  Twitter. reactant. n. 1. (Chemistry) a substance that participates in a chemical reaction, esp a substance that is present at the start of the reaction. Compare product 4."}, {"url": "http://www.thefreedictionary.com/reactant", "passage_text": "Noun. 1. reactant-a chemical substance that is present at the start of a chemical reaction. chemical, chemical substance-material produced by or used in a reaction involving changes in atoms or molecules. 1  Facebook. "}]