[{"url": "http://www.webmd.com/a-to-z-guides/liver-function-test-lft", "passage_text": "Your doctor may conduct liver enzyme and liver function tests if: 1  You are taking a medication that can harm the liver. 2  You have liver disease. 3  You have symptoms of liver or bile system disease (abdominal pain, nausea and vomiting, or yellow skin)."}, {"url": "http://www.mayoclinic.org/tests-procedures/liver-function-tests/basics/definition/PRC-20012602", "passage_text": "Liver function tests are blood tests used to help diagnose and monitor liver disease or damage. The tests measure the levels of certain enzymes and proteins in your blood."}, {"url": "http://www.liver.ca/liver-disease/diagnosing-liver-disease/liver-function-tests.aspx", "passage_text": "Liver tests (LTs) are blood tests used to assess the general state of the liver or biliary system. Few of these tests actually measure how well the liver or biliary system is functioning, but rather reflect the presence of damage or inflammation."}, {"url": "http://www.medicinenet.com/liver_blood_tests/article.htm", "passage_text": "Liver blood tests are some of the most commonly performed blood tests. These tests can be used to assess liver functions or liver injury. An initial step in detecting liver damage is a simple blood test to determine the level of certain liver enzymes (proteins) in the blood."}, {"url": "http://www.mayoclinic.org/tests-procedures/liver-function-tests/basics/definition/PRC-20012602", "passage_text": "Some of these tests measure how well the liver is performing its normal functions of producing protein and clearing bilirubin, a blood waste product. Other liver function tests measure enzymes that liver cells release in response to damage or disease. Abnormal liver function test results don't always indicate liver disease. Your doctor will explain your results and what they mean. 1  Why it's done."}, {"url": "http://www.webmd.com/a-to-z-guides/liver-function-test-lft", "passage_text": "Liver enzyme tests, formerly called liver function tests (LFTs), are a group of blood tests that detect inflammation and damage to the liver. They can also check how well the liver is working."}, {"url": "http://www.webmd.com/digestive-disorders/tc/liver-function-panel-topic-overview", "passage_text": "A liver (hepatic) function panel is a blood test to check how well the liver is working. This test measures the blood levels of total protein, albumin, bilirubin, and liver enzymes. High or low levels may mean that liver damage or disease is present. The liver serves several important functions in the body, including changing nutrients into energy for the body and breaking down toxic substances."}]