[{"url": "http://www.globalhealingcenter.com/natural-health/types-of-calcium-supplements/", "passage_text": "The most effective form of calcium supplement, created through the use of the mineral salts of orotic acid. Calcium orotates are found in small amounts in all living beings. It is a primary mineral for the creation of bones and teeth, and fosters cellular communications. “A supplemental form of calcium can be delivered in the form of calcium ascorbate, which delivers the essential organic calcium, with the addition of vitamin C.”. Would be interested to hear your comments on this. Thank you for the article."}, {"url": "http://medical-dictionary.thefreedictionary.com/Calcium+ions", "passage_text": "Within the body fluids calcium exists in three forms. Protein-bound calcium accounts for about 47 per cent of the calcium in plasma; most of it in this form is bound to albumin. Another 47 per cent of plasma calcium is ionized. It is present in dairy products, almonds, leafy greens, sardines and salmon; proper absorption of calcium hinges on appropriate acidity of the stomach, presence of vitamin D and a balance of other minerals, including phosphorus and mangesium."}, {"url": "http://www.evitamins.com/encyclopedia/assets/generic/calcium-which-form-is-best/~default", "passage_text": "For example, calcium carbonate appears to be as well absorbed as the calcium found in. In fact, some studies indicate that calcium carbonate is absorbed as well as most other forms besides calcium citrate/malate (CCM). For people willing to take more pills to achieve a given amount of calcium (typically 800 to 1,000 mg), calcium carbonate does not appear to be the optimal choice, because other forms have been reported to absorb better (however, they do require more pills per day because each pill contains less calcium)."}, {"url": "http://medical-dictionary.thefreedictionary.com/Calcium+ions", "passage_text": "Calcium carbonate is the most common calcium compound. Calcium also occurs as a component of the natural compound gypsum, which forms plaster of paris when heated. It is also a component of calcium cyanamid, a fertilizer and progenitor of other nitrogen compounds. It is present in dairy products, almonds, leafy greens, sardines and salmon; proper absorption of calcium hinges on appropriate acidity of the stomach, presence of vitamin D and a balance of other minerals, including phosphorus and mangesium."}, {"url": "http://www.globalhealingcenter.com/natural-health/types-of-calcium-supplements/", "passage_text": "The form of calcium found in foods such as aged cheese and baking powder. This form is the most commonly used antacid and is added to fruits to keep them firm and extend shelflife. It has a medium bioavailablity in the body because it can be absorbed at various pHs. 6. “A supplemental form of calcium can be delivered in the form of calcium ascorbate, which delivers the essential organic calcium, with the addition of vitamin C.”. Would be interested to hear your comments on this. Thank you for the article."}, {"url": "http://www.evitamins.com/encyclopedia/assets/generic/calcium-which-form-is-best/~default", "passage_text": "For instance, in the calcium carbonate form, calcium accounts for 40% of the compound, while the calcium citrate form provides 24% elemental calcium. Many medical doctors recommend calcium carbonate because it requires the fewest pills to reach a given level of calcium and it is readily available and inexpensive. For people willing to take more pills to achieve a given amount of calcium (typically 800 to 1,000 mg), calcium carbonate does not appear to be the optimal choice, because other forms have been reported to absorb better (however, they do require more pills per day because each pill contains less calcium)."}, {"url": "http://www.nutriology.com/calcium.html", "passage_text": "Once elemental calcium is released in the body, it is then incorporated into 1 of 2 possible forms. Most of the calcium in the human exists as calcium phospate crystals, in the bones and teeth. The calcium phosphate crystals in teeth and bones forms the cement that gives strength to them. This brings calcium levels back down to the normal range. Calcium can be found in milk, dairy products, and calcium supplements (tablets), typically in the form of CaCO 3, (calcium carbonate), calcium lactate, or calcium gluconate. You may see different brands of calcium, such as oyster shell calcium, etc."}, {"url": "http://www.chemistryexplained.com/elements/A-C/Calcium.html", "passage_text": "Isotopes. Six naturally occurring isotopes of calcium exist: calcium-40, calcium-42, calcium-43, calcium-44, calcium-46, and calcium-48. Isotopes are two or more forms of an element. Isotopes differ from each other according to their mass number. The number written to the right of the element's name is the mass number. "}, {"url": "http://www.nutriology.com/calcium.html", "passage_text": "The other form of calcium existing in the human is pure elemental calcium, Ca +2 (Click here for an explanation of the Ca +2, which is called the ionic form of calcium). This ionic form functions in helping nerve impulse conduction, muscle contraction, ion transport, and signals across membranes. This brings calcium levels back down to the normal range. Calcium can be found in milk, dairy products, and calcium supplements (tablets), typically in the form of CaCO 3, (calcium carbonate), calcium lactate, or calcium gluconate. You may see different brands of calcium, such as oyster shell calcium, etc."}, {"url": "http://www.nutriology.com/calcium.html", "passage_text": "Remember, calcium is complexed in different forms. Some are better absorbed than others. Dietary calcium can be obtained from milk, milk products, and calcium supplements. Supplements typically contain calcium in the form of calcium carbonate (CaCO 3), calcium gluconate, or calcium lactate. This brings calcium levels back down to the normal range. Calcium can be found in milk, dairy products, and calcium supplements (tablets), typically in the form of CaCO 3, (calcium carbonate), calcium lactate, or calcium gluconate. You may see different brands of calcium, such as oyster shell calcium, etc."}]