[{"url": "http://www.exercisetoheal.com/What+Is+Qi+Gong%3F.html", "passage_text": "Qi Gong is catching on fast with a large number of Americans. According to the Center for Disease Control and National Institutes of Health, in 2007 there were 625,000 Americans regularly practicing Qi Gong. That is a 16% increase from just six years earlier. Introduction. Qi Gong is a gentle form of exercise that helps improve health and overall well-being. Qi Gong (pronounced CHEE-GONG) can be traced back 4,000 years to ancient China. Qi is simply the Chinese word for energy, and Gong means skill that is cultivated through steady practice"}, {"url": "https://en.wikipedia.org/wiki/Gong", "passage_text": "A Pasi gong is a medium-size gong 12 to 15 in size, with a crashing sound. It is used traditionally to announce the start of a performance, play or magic. Construction varies, some having nipples and some not, so this type is named more for its function than for its structure or even its sound. Gong manufacturers [edit]. Besides many traditional and centuries old manufacturers in places such as China, Tibet, Burma, Korea, Indonesia, and the Philippines, since the 20th Century gongs have also been made in Europe and America. Paiste is the largest non-Asian manufacturer of gongs."}, {"url": "http://www.merriam-webster.com/dictionary/gong", "passage_text": "Full Definition of GONG. 1. : a disk-shaped percussion instrument that produces a resounding tone when struck with a usually padded hammer. 2. a: a saucer-shaped bell (as in a fire alarm) that is struck by a mechanical hammer b: a wire rod wound in a flat spiral for sounding the time or chime or alarm (as in a clock)."}, {"url": "http://nqa.org/about-nqa/what-is-qigong/", "passage_text": "The word Qigong (Chi Kung) is made up of two Chinese words. Qi is pronounced chee and is usually translated to mean the life force or vital-energy that flows through all things in the universe. The second word, Gong, pronounced gung, means accomplishment, or skill that is cultivated through steady practice. Together, Qigong (Chi Kung) means cultivating energy, it is a system practiced for health maintenance, healing and increasing vitality. Qigong is an integration of physical postures, breathing techniques, and focused intentions. Qigong practices can be classified as martial, medical, or spiritual. All styles have three things in common: they all involve a posture, (whether moving or stationary), breathing techniques, and mental focus."}, {"url": "https://en.wikipedia.org/wiki/Gong", "passage_text": "A gong (Chinese: 鑼; pinyin: luo; Luó indonesian Or: javanese; Gong: malay) gong is An, African east And South East asian musical percussion instrument that takes the form of a, flat circular metal disc which is hit with a. mallet Gong manufacturers [edit]. Besides many traditional and centuries old manufacturers in places such as China, Tibet, Burma, Korea, Indonesia, and the Philippines, since the 20th Century gongs have also been made in Europe and America. Paiste is the largest non-Asian manufacturer of gongs."}, {"url": "http://www.thefreedictionary.com/gong", "passage_text": "gong. n. 1. A rimmed metal disk that produces a loud, sonorous tone when struck with a padded mallet. 2. A usually saucer-shaped bell that is struck with a mechanically operated hammer. intr.v. gonged, gong·ing, gongs. To make the sound of a gong. gong. 1. a large bronze disk, that produces a vibrant, hollow tone when struck. 2. a shallow bell struck by an electrically or mechanically operated hammer. 3. (in a clock or watch) a rod or wire, either straight or bent into a spiral, on which the time is struck. 4. to sound as a gong does; ring, chime, or reverberate"}, {"url": "http://www.thefreedictionary.com/gong", "passage_text": "gong. n. 1. (Instruments) Also called: tam-tam a percussion instrument of indefinite pitch, consisting of a metal platelike disc struck with a soft-headed drumstick. 2. (Mechanical Engineering) a rimmed metal disc, hollow metal hemisphere, or metal strip, tube, or wire that produces a note when struck. gong. 1. a large bronze disk, that produces a vibrant, hollow tone when struck. 2. a shallow bell struck by an electrically or mechanically operated hammer. 3. (in a clock or watch) a rod or wire, either straight or bent into a spiral, on which the time is struck. 4. to sound as a gong does; ring, chime, or reverberate"}, {"url": "https://en.wikipedia.org/wiki/Qigong", "passage_text": "Qigong, qi gong, chi kung, or chi gung (simplified Chinese: 气功; traditional Chinese: 氣功; pinyin: qigōng; Qìgōng–Wade: giles chi; gong: Literally Life Energy) cultivation is a holistic system of coordinated body posture and, movement, breathing and meditation used for, health, spirituality and martial arts. training With roots in Chinese medicine, philosophy, and martial arts, qigong is traditionally viewed as a practice to cultivate and balance qi (chi) or what has been translated as life energy."}]