[{"url": "https://answers.yahoo.com/question/index?qid=20090314163529AAOqXjP", "passage_text": "Ibuprofen is a NSAID, non-steroidal anti-inflammatory. Hydrocodone/tylenol (Vicodin & Lortab are 2 brand names) is a pain medication. Ibuprofen reduces inflammation which, in turn, reduces pain. Always eat with each dose of ibuprofen since it can cause stomach upset. You can take both since they're not the same medication. How strong/weak something is depends on the person and the reason for the pain. Head to head-vicodin is stronger than the ibuprofen. Vicodin doesn't address the inflammation tho. I'd ask the doctor or pharmacist about using both. If the vicodin is new to you, take it when someone can monitor you. You never know how you'll react with a new medicatio"}, {"url": "http://www.mayoclinic.org/drugs-supplements/hydrocodone-and-ibuprofen-oral-route/description/DRG-20062862", "passage_text": "Since hydrocodone and ibuprofen combination is only used for short-term (10 days or less) relief of pain, physical dependence will probably not occur. Ibuprofen is a nonsteroidal anti-inflammatory drug (NSAID) that is used in this combination to relieve inflammation, swelling, and pain. This medicine is available only with your doctor's prescription. This product is available in the following dosage forms: 1  Tablet. 2  Before Using."}, {"url": "https://answers.yahoo.com/question/index?qid=20080716164219AAuX3L2", "passage_text": "Vicoden is a controlled substance, and can have Tylenol, aspirin or ibuprofen in it, But ibuprofen is NOT vicodin... No it does not give the same effect. Vicoden is for moderate to severe pain. But has few other side effects. Motrin requires a prescription. Vicodin is a narcotic (prescription also) It is for very bad pain, like an earache, or toothache. It works on your central nervous system. It is a little less hard on your kidneys, and liver, but it has side effects of its own: 1. Dizziness 2. Vomiting 3. It tends to make people sleepy"}, {"url": "https://answers.yahoo.com/question/index?qid=20080716164219AAuX3L2", "passage_text": "Yes, a person can take 4 (non prescription) 200mg Ibuprofen for the same anti-inflammatory effect as 1 800mg prescription tablet. Vicodin (hydrocodone + tylenol combination) is an opiate, narcotic and controlled substance. It's also highly addictive and used completely differently than Ibuprofen. A hydrocodone + ibuprofen combo called Vicuprofen is also available for people who do not tolerate tylenol [acetaminophen] well... If you are poking around a medicine cabinet, do NOT take anything not prescribed for you. But has few other side effects. Motrin requires a prescription. Vicodin is a narcotic (prescription also) It is for very bad pain, like an earache, or toothache. It works on your central nervous system. It is a little less hard on your kidneys, and liver, but it has side effects of its own: 1. Dizziness 2. Vomiting 3. It tends to make people sleepy"}, {"url": "http://www.aafp.org/afp/2005/0301/p913.html", "passage_text": "The results of one RCT 36 found that hydrocodone in a dose of 15 mg with 400 mg of ibuprofen is significantly better than 400 mg of ibuprofen alone for postoperative pain. Another trial 37 found that the combination of 7.5 mg of hydrocodone and 750 mg of acetaminophen was highly effective for the relief of acute pain. "}, {"url": "http://www.rxlist.com/vicoprofen-drug.htm", "passage_text": "Ibuprofen, USP 200 mg. VICOPROFEN (hydrocodone and ibuprofen) is supplied in a fixed combination tablet form for oral administration. VICOPROFEN (hydrocodone and ibuprofen) combines the opioid analgesic agent, hydrocodone bitartrate, with the nonsteroidal anti-inflammatory (NSAID) agent, ibuprofen."}, {"url": "http://answers.webmd.com/answers/5006048/is-it-safe-to-take-ibuprofen-with-vicodin-or-is-tylenol-safer", "passage_text": "A. Please do not take Tylenol (acetaminophen) with Vicodin (hydrocodone-APAP), because Vicodin contains Tylenol already. It is very easy to exceed the maximum daily limit of acetaminophen by combining these two drugs. And high doses of acetaminophen may lead to liver damage. If the hydrocodone isn't controlling your pain, I'd suggest you speak with your health care provider. From a pharmacology standpoint, there's no harm in combining ibuprofen with hydrocodone, but ibuprofen is a blood thinner. So if you're taking hydrocodone to control post-surgical pain, for example, your doctor may not want you taking a blood thinner like ibuprofen. "}, {"url": "http://www.mcrh.org/Stomach-Ulcer/worse_your_stomach_Advil_Vicodin_2010123.htm", "passage_text": "What's worse for your stomach, Advil or Vicodin? I think Vicodin is ALOT worse on ur stomach and can cause severe swelling and pain in certain people1 On the other hand is helps pain alot more than Advil. Vicodin can even cause severe stomach problems if taken 4 long periods of time!"}, {"url": "http://www.urbandictionary.com/define.php?term=Vicoprofen", "passage_text": "A standard vicodin is 5/500 which means 5 mg. hydrocodone and 500 mg acetaminophen. So it's a low dose of narcotic pain reliever and a lot of Tylenol which is very bad for your liver. Vicoprofen is 7.5 mg hydrocodone (narcotic pain killer) and 200 mg. ibuprofen (nowhere as bad for you as acetaminophen). DO NOT take a bunch of these at once. ONE will make you extremely warm, fuzzy, worry-free, and happy."}]