[{"url": "http://www.payscale.com/research/US/Job=Architectural_Engineer/Salary", "passage_text": "An Architectural Engineer earns an average salary of $63,261 per year. Experience has a moderate effect on pay for this job. People in this job generally don't have more than 20 years' experience."}, {"url": "http://www.payscale.com/research/US/Job=Architectural_Engineer/Salary", "passage_text": "Architectural engineers apply architectural engineering principles for designing, planning and construction. They often work with other engineers, architects, project managers, construction workers and their company's clients. These engineers often work on-site or in an office with a team of other engineers."}, {"url": "http://learn.org/articles/What_is_the_Average_Earnings_of_an_Architectural_Engineer.html", "passage_text": "Salaries by Employer. As of May 2013, the BLS reported that most civil engineers worked for architectural, engineering and related services and earned an average wage of $87,620."}, {"url": "http://everydaylife.globalpost.com/much-architectural-engineers-make-month-16951.html", "passage_text": "According to the Missouri University of Science and Technology, architectural engineering co-ops pay an average of $2,233 per month, while internships pay an average of $2,578 per month."}, {"url": "http://everydaylife.globalpost.com/much-architectural-engineers-make-month-16951.html", "passage_text": "Pay for Experienced Engineers. According to the American Association of Engineering Societies, architectural engineers earned a median yearly salary of $74,000 and median monthly income of $6,167 by the time they had nine years of experience."}, {"url": "https://www.recruiter.com/salaries/architectural-and-engineering-managers-salary/", "passage_text": "Architectural and Engineering Managers will most likely receive an average wage of One Hundred Twenty Seven Thousand Three Hundred dollars on a yearly basis. Architectural and Engineering Managers are paid most highly in California, where they can receive an average salary rate of near $142120."}, {"url": "http://work.chron.com/salaries-architectural-engineers-4978.html", "passage_text": "Across the nation, architectural engineers earn on average $74,000 a year for those with at nine to 10 years of experience in the field, according to Career Cornerstone using data from the Engineering Workforce Commission."}, {"url": "http://work.chron.com/salaries-architectural-engineers-4978.html", "passage_text": "The Milwaukee School of Engineering lists the starting salary for an entry-level architectural engineer between $40,000 and $67,860, with a national average of $51,229."}, {"url": "http://www.ehow.com/info_7736746_average-salary-architectural-engineer.html", "passage_text": "Architectural engineers tend to make slightly less than architects. The average earnings for architects in May 2008 were $70,320, according to the Occupational Outlook Handbook. The average salary of architectural engineers reported by Simply Hired is 95 percent that of architects' average earnings."}]