[{"url": "http://biology.about.com/od/humananatomybiology/ss/salivary-glands-and-saliva.htm", "passage_text": "Salivary Glands and Saliva. 1  parotid glands-produce a serous, watery secretion. 2  submaxillary (mandibular) glands-produce a mixed serous and mucous secretion. 3  sublingual glands-secrete a saliva that is predominantly mucous in character. 4  serous cells, which secrete a watery fluid, essentially devoid of mucus. 1 submaxillary (mandibular) glands-produce a mixed serous and mucous secretion. 2  sublingual glands-secrete a saliva that is predominantly mucous in character. 3"}, {"url": "https://en.wikipedia.org/wiki/Salivary_gland", "passage_text": "The salivary glands in mammals are exocrine glands, glands with ducts, that produce saliva. They also secrete amylase, an enzyme that breaks down starch into maltose. There are 800-1000 minor salivary glands located throughout the oral cavity within the submucosa of the oral mucosa in the tissue of the buccal, labial, and lingual mucosa, the soft palate, the lateral parts of the hard palate, and the floor of the mouth or between muscle fibers of the tongue."}, {"url": "http://www.webmd.com/oral-health/salivary-glands", "passage_text": "Salivary Glands. Salivary glands produce saliva, which moistens the mouth to help a person chew and swallow food. Saliva also contains substances (enzymes) that begin the breakdown of food. There are four pairs of salivary glands: 1  The parotid glands are located between the ear and the jaw. 1 The submandibular glands are located under the jaw. 2  The sublingual glands are located on the floor of the mouth under the tongue. 3  The buccal glands are not shown in this picture. 4  They are located in the mucous membrane lining the cheeks and mouth. 5  These glands produce only a small amount of saliva."}, {"url": "http://www.cancer.org/cancer/salivaryglandcancer/detailedguide/salivary-gland-cancer-what-is-salivary-gland-cancer", "passage_text": "Salivary gland cancer starts in one of the salivary glands. It’s not just a single disease. There are actually several different salivary glands found inside and near your mouth. Many types of cancer and benign (non-cancerous) tumors can develop in these glands. The 2 main types of salivary glands are the major salivary glands and minor salivary glands. There are 3 sets of major salivary glands on each side of the face: 1  The parotid glands, the largest salivary glands, are just in front of the ears."}, {"url": "http://www.entnet.org/content/salivary-glands", "passage_text": "We call the major salivary glands the parotid, submandibular, and sublingual glands. They all secrete saliva into your mouth, the parotid through tubes that drain saliva, called salivary ducts, near your upper teeth, submandibular under your tongue, and the sublingual through many ducts in the floor of your mouth. Salivary gland problems that cause clinical symptoms include: Obstruction: Obstruction to the flow of saliva most commonly occurs in the parotid and submandibular glands, usually because stones have formed. Symptoms typically occur when eating."}, {"url": "http://www.vivo.colostate.edu/hbooks/pathphys/digestion/pregastric/salivary.html", "passage_text": "Salivary Glands and Saliva. Saliva is produced in and secreted from salivary glands. The basic secretory units of salivary glands are clusters of cells called an acini. These cells secrete a fluid that contains water, electrolytes, mucus and enzymes, all of which flow out of the acinus into collecting ducts. "}, {"url": "http://www.entnet.org/content/salivary-glands", "passage_text": "Besides these glands, there are many tiny glands called minor salivary glands located in your lips, inner cheek area (buccal mucosa), and extensively in other linings of your mouth and throat. Salivary glands produce the saliva used to moisten your mouth, initiate digestion, and help protect your teeth from decay. Salivary gland problems that cause clinical symptoms include: Obstruction: Obstruction to the flow of saliva most commonly occurs in the parotid and submandibular glands, usually because stones have formed. Symptoms typically occur when eating."}, {"url": "http://www.answers.com/Q/What_is_the_function_of_the_salivary_glands", "passage_text": "Confidence votes 13.5K. The function of the salivary glands is to make saliva and help the bolus (soft mass of chewed food) go down the esophagus easily. Saliva contains enzymes which help break down food to a form which the body can use. It is to secrete saliva to help digestion... the salivary glands produce saliva. "}, {"url": "http://www.answers.com/Q/What_does_Salivary_gland_do_for_the_Digestive_System", "passage_text": "The salivary glands are located in the mouth, and their job is to secrete (guess what) saliva. When you first chew your food, the saliva moistens your food as it forms a bolus … . A moist bolus is easy to swallow. Making the world better, one answer at a time. The salivary glands secretes saliva that aids in chewing and starts the digestion process. This part of digestion is took place in your mouth. Saliva glands are located in the mouth providing the first ingested digestive chemical breakdown. Saliva also lubricates ingestion to aid in mastication"}]