[{"url": "http://www.ibuzzle.com/articles/bed-bugs-how-to-get-rid-of-them.html", "passage_text": "If you want to get rid of bed bugs, the natural or traditional way, you could spray neem oil on carpets, curtains and mattresses. Two of the latest techniques in how to get rid of them employ canine detection teams and diatomaceous earth."}, {"url": "https://answers.yahoo.com/question/index?qid=20090414175056AAG6r1z", "passage_text": "Best Answer: That is how most of people get bed bugs. Bed bug can travel with you in your belongings or on your clothes. We had a bed infestation years ago, and we got rid of bed bugs WITHOUT throwing away the mattress! First of all, you need to wash your bedding items with HOT water. And use a steam cleaner on the mattress and on the carpet."}, {"url": "http://www.kingcounty.gov/healthservices/health/ehs/bedbugs.aspx", "passage_text": "How to sleep at night after a bed bug problem. If you have bed bugs it is not necessary to get rid of your mattress or box springs. Encasements will prevent bed bugs from hiding in your mattress and box springs, but if you have bed bugs in other places, they can still crawl into your bed."}, {"url": "http://www.bed-bugs-how-to-get-rid-of-them.com/", "passage_text": "You CAN Kill Bed Bugs! You have come to the right place to learn everything you need to know about how to get rid of bed bugs. Here at how to get rid of bed bugs, we will share everything you need to know on bed bigs how to get rid of them. As the bed bug guru, I want to help you take care of your embarrassing problem! Check out all of the pages here for great free information on bed bugs bites, bed bug spray, bed bugs pictures, bed bug mattress covers, and everything you need to know to get rid of bed bugs.I have experience in the pest control industry."}, {"url": "http://www.kingcounty.gov/healthservices/health/ehs/bedbugs.aspx", "passage_text": "Bed bugs are very difficult to get rid of because they are hard to find and kill. Making your home bed bug-free will take time and effort from you; the housing manager (if the home is a rental unit); and a pest control company."}, {"url": "http://www.bed-bugs-how-to-get-rid-of-them.com/", "passage_text": "You have come to the right place to learn everything you need to know about how to get rid of bed bugs. Here at how to get rid of bed bugs, we will share everything you need to know on bed bigs how to get rid of them. As the bed bug guru, I want to help you take care of your embarrassing problem! Check out all of the pages here for great free information on bed bugs bites, bed bug spray, bed bugs pictures, bed bug mattress covers, and everything you need to know to get rid of bed bugs.I have experience in the pest control industry."}]