[{"url": "http://www.diamondsourceva.com/Education/diamonds-what-is-a-diamond.asp", "passage_text": "It is a modern misconception that the world's diamonds come primarily from South Africa. However, diamonds are a world-wide resource. The common characteristic of primary diamond deposits is the ancient terrain that hosts the kimberlite and lamproite pipes that bring diamonds to Earth's surface. Diamonds form between 120-200 kilometers or 75-120 miles below the earth's surface. According to geologists the first delivery of diamonds was somewhere around 2.5 billion years ago and the most recent was 45 million years ago."}, {"url": "http://geology.com/articles/diamonds-from-coal/", "passage_text": "Contrary to what many people believe, most diamonds do not form from coal. Diamonds found at or near Earth's surface have formed through four different processes. The plate tectonics cartoon above presents these four methods of diamond formation. Diamonds have been found in rocks that are thought to have been subducted and then returned to the surface. These types of rocks are very rare and no known commercial diamond deposits have been developed within them. The diamonds found in these types of deposits have been very small and not suitable for commercial use."}, {"url": "https://en.wikipedia.org/wiki/Diamond_(gemstone)", "passage_text": "A diamond can be found in any color in addition to colorless. Some of the colored diamonds, such as pink, are very rare. A chemically pure and structurally perfect diamond is perfectly transparent with no hue, or color. However, in reality most gem-sized natural diamonds are imperfect. Some 85% of the world's rough diamonds, 50% of cut diamonds, and 40% of industrial diamonds are traded in Antwerp, Belgium-the diamond center of the world. The city of Antwerp also hosts the Antwerpsche Diamantkring, created in 1929 to become the first and biggest diamond bourse dedicated to rough diamonds."}, {"url": "http://geology.com/minerals/diamond.shtml", "passage_text": "Diamond is a rare, naturally-occurring mineral composed of carbon. Each carbon atom in a diamond is surrounded by four other carbon atoms and connected to them by strong covalent bonds. This simple, uniform, tightly-bonded arrangement yields one of the most durable substances known. Diamond also has a high dispersion. As white light passes through a diamond this high dispersion causes that light to separate into its component colors. Dispersion is what enables a prism to separate white light into the colors of the spectrum. This property of dispersion is what gives diamonds their colorful fire."}, {"url": "http://www.hardasrocks.info/where-are-diamonds-found.htm", "passage_text": "Where diamonds are found in the United States-Wyoming Diamond Kimberlite pipes have been found in Wyoming, near the Colorado-Wyoming state line area referred to as the Aultman, Ferris and Schaffer kimberlites. Source of Diamonds The source of the diamond is a fascinating subject. This page was designed to clarify where they can be found around the world, in the United States and the meaning of Kimberlite, Placer Deposits and Alluvial deposits."}, {"url": "http://www.livescience.com/32266-how-are-diamonds-made.html", "passage_text": "Diamonds are made out of carbon — highly organized carbon, that is. Geologists are still guessing how diamonds formed in the Earth from 1 billion to 3 billion years ago, according to a recent study in the journal Nature, but they think the recipe follows something like this: 1. Bury carbon dioxide 100 miles into Earth. 2. Heat to about 2,200 degrees Fahrenheit"}, {"url": "http://geology.com/articles/diamonds-from-coal/", "passage_text": "1) Diamond Formation in Earth's Mantle. Geologists believe that the diamonds in all of Earth's commercial diamond deposits were formed in the mantle and delivered to the surface by deep-source volcanic eruptions. These eruptions produce the kimberlite and lamproite pipes that are sought after by diamond prospectors. Diamonds have been found in rocks that are thought to have been subducted and then returned to the surface. These types of rocks are very rare and no known commercial diamond deposits have been developed within them. The diamonds found in these types of deposits have been very small and not suitable for commercial use."}, {"url": "http://www.hardasrocks.info/where-are-diamonds-found.htm", "passage_text": "Where diamonds are found in the United States-Arkansas In 1906 John Huddleston sold his diamond-bearing land for $36,000 to a group of men who began the Arkansas Diamond Company. Horace Bemis bought the adjacent land and formed the Ozark Diamond Corporation. Source of Diamonds The source of the diamond is a fascinating subject. This page was designed to clarify where they can be found around the world, in the United States and the meaning of Kimberlite, Placer Deposits and Alluvial deposits."}, {"url": "http://www.discovery.com/tv-shows/mythbusters/about-this-show/what-is-a-diamond/", "passage_text": "Diamond is the most concentrated form of pure carbon in the natural world and the strongest mineral on Earth, far exceeding other carbon allotropes such as graphite and fullerite. The secret to diamond's superior strength is found on the molecular level. "}]