[{"url": "http://www.thefreedictionary.com/Poutine", "passage_text": "n. A dish of Quebecois québécois origin consisting Of french fries topped with cheese curds and. [Gravy Quebecois, québécois french, cooked pudding, a, mess poutine Probably of french (dialectal origin perhaps Influenced by); english pudding perhaps Akin to (french Dialectal). , western france cast, iron Pot or (French). dialectal normandy pou·tine. n. A dish of Quebecois québécois origin consisting Of french fries topped with cheese curds and. [Gravy Quebecois, québécois french, cooked pudding, a, mess poutine Probably of french (dialectal origin perhaps Influenced by); english pudding perhaps Akin to (french Dialectal). western france"}, {"url": "http://www.wisegeek.com/what-is-poutine.htm", "passage_text": "Adorable animal families that will make you aww. Poutine (pronounced poo-teen) is a dish consisting of French fries topped with cheese curds and hot gravy. It is native to Canada and little known in the rest of the world, though some restaurants in other countries have poutine on the menu. Poutine is similar to American cheese fries or “disco fries.”. Poutine originated in Quebec, Canada in the late 1950s, and is now popular in all of Eastern Canada. Several communities within the province claim to have created poutine, such as Drummondville and Victoriaville."}, {"url": "http://www.bigpoutine.com/", "passage_text": "Poutine is a dish consisting of French fries topped with fresh cheese curds, covered with brown gravy or sauce and sometimes additional ingredients. Poutine is a diner staple which originated in Quebec and can now be found across Canada. "}, {"url": "http://www.merriam-webster.com/dictionary/poutine", "passage_text": "Definition of POUTINE. : a dish of French fries covered with brown gravy and cheese curds. ADVERTISEMENT."}, {"url": "http://www.urbandictionary.com/define.php?term=poutine", "passage_text": "Top Definition. poutine. A Quebec (or French-Canadian) staple, a dish of homemade french fries topped with white cheddar cheese curds and beef gravy (wannabes and some americans have been known to serve this dish with any cheese and turkey gravy). Generally served in a styrofoam container or carton. Poutine. A term which origins can be found in French Canada (specifically Quebec). The original meaning is fries smothered with cheese curds and gravy. We in Ontario, Canada have re-apprehended this French Canadian word, to be a spin on pussy, which is also slang for a vagina."}, {"url": "https://en.wikipedia.org/wiki/Poutine", "passage_text": ") is a Canadian dish, originating in the province of Quebec, made with french fries and cheese curds topped with a light brown gravy-like sauce. This fast-food dish is typically found across Canada and in some places in the northern United States, less often elsewhere and is still considered 'exotic'. Outside Canada, poutine is found in northern border regions of the United States such as New England, the Pacific Northwest and the Upper Midwest. These regions offer further variations of the basic dish."}, {"url": "https://en.wikipedia.org/wiki/Poutine", "passage_text": "The dish is thought to have originated in rural Quebec, Canada, in the late 1950s and several Canadian communities claim to be the birthplace of poutine, including Drummondville (by Jean-Paul Roy in 1964), Saint-Jean-sur-Richelieu, and Victoriaville. Outside Canada, poutine is found in northern border regions of the United States such as New England, the Pacific Northwest and the Upper Midwest. These regions offer further variations of the basic dish."}, {"url": "https://en.wikipedia.org/wiki/Poutine", "passage_text": "In the basic recipe for poutine, French fries are covered with fresh cheese curds, and topped with brown gravy. In a traditional Quebec poutine: 1  French fries: Usually of medium thickness, and fried (sometimes twice) such that the inside stays soft, while the outside is crispy. Outside Canada, poutine is found in northern border regions of the United States such as New England, the Pacific Northwest and the Upper Midwest. These regions offer further variations of the basic dish."}]