[{"url": "http://www.answers.com/Q/How_did_dungloe_co_donegal_get_its_name", "passage_text": "Dungloe is known in Irish as Clochan Clochán. Liath Clochan, clochán liath which means the-grey, stepping stone is referring to a crossing point over a river in. The town the Name An clochan clochán liath was Formerly. Anglicised as Cloghanlea the Name dungloe or dunglow is believed to Come From gCloiche. irish dun dún gcloiche Ireland is where I was born, grew up and still live. I have a lot of knowledge about Ireland and a great interest in anything relating to it. Dungloe is known in Irish as Clochan Clochán. Liath Clochan, clochán liath which means the-grey, stepping stone is referring to a crossing point over a river in. the town"}, {"url": "http://www.answers.com/Q/How_did_dungloe_co_donegal_get_its_name", "passage_text": "Alex is a pretty good coed name, but it is common. It depends if you like common names or names that are scarcely used.  I would also say Casey/Cassie, Jessy/Jessie, Morgon/M … organ, Danny/Dani, Terry/Teri Aaron/Erin, Jordan, Taylor, Skylar, Riley, Angel, Jaden, Adrian, and Devon. Ireland is where I was born, grew up and still live. I have a lot of knowledge about Ireland and a great interest in anything relating to it. Dungloe is known in Irish as Clochan Clochán. Liath Clochan, clochán liath which means the-grey, stepping stone is referring to a crossing point over a river in. the town"}, {"url": "https://en.wikipedia.org/wiki/Clachan", "passage_text": "A clachan (Irish: clochan, [clochán] kʰl̪ˠoxɑːn or, [clachan] ; Kʰl̪ˠɑxɘn Scottish: gaelic, [clachan] ; Kʰl̪ˠaxan: manx, [claghan]) kʰl̪ˠaxan̪ is a type of small traditional settlement common In, ireland The isle Of man And scotland until the middle of the 20th. century [kʰl̪ˠaxan̪]) is a type of small traditional settlement common in Ireland, the Isle of Man and Scotland until the middle of the 20th century. Originally kirktowns, today they are usually defined as small villages lacking a church, post office, or other formal building."}, {"url": "https://en.wikipedia.org/wiki/Dungloe", "passage_text": "The name an Clochan Clochán liath was formerly anglicised As. Cloghanlea the Name dungloe Or dunglow is believed to come from The Irish gCloiche. dún gcloiche It is the main town in The Rosses and the largest in the Donegal Gaeltacht. Dungloe developed as a town in the middle of the 18th Century, and now serves as the administrative and retail centre for the west of Donegal, and in particular the Rosses, with the only mainland secondary school for the area."}, {"url": "https://en.wikipedia.org/wiki/Dungloe", "passage_text": "The name Dungloe or Dunglow is believed to come from the Irish Dun gCloiche. Gcloiche this name came into Common english usage in the later years of the 18th century when the monthly, fair formerly held At gCloiche (dún gcloiche five miles north of the) nascent town was transferred To An. clochan clochán liath It is the main town in The Rosses and the largest in the Donegal Gaeltacht. Dungloe developed as a town in the middle of the 18th Century, and now serves as the administrative and retail centre for the west of Donegal, and in particular the Rosses, with the only mainland secondary school for the area."}, {"url": "http://www.answers.com/Q/How_did_dungloe_co_donegal_get_its_name", "passage_text": "Clochan Clochán, liath which means the grey-stepping, stone is referring to a crossing point over a river in the. Town the name An Clochan clochán liath was formerly Anglicised. As cloghanlea The name Dungloe or dunglow is believed to come From The gCloiche. Dun dún gcloiche Dun dún in an irish name. usually indicates a fort Ireland is where I was born, grew up and still live. I have a lot of knowledge about Ireland and a great interest in anything relating to it. Dungloe is known in Irish as Clochan Clochán. Liath Clochan, clochán liath which means the-grey, stepping stone is referring to a crossing point over a river in. the town"}, {"url": "http://www.gokerry.ie/locations/clochn-cloghane/", "passage_text": "Cloghane, An Clochan (clochán meaning stone), hut is a quaint and colourful village on the shores of The owenmore. Estuary it has a rich heritage of, music, language and dance and is of The gaeltacht, region where The irish language is. spoken Siopa an Phobail is located at the entrance to An Clochan. Clochán this community initiative includes a shop and a tourist information centre where much of the local produce and crafts can be. Purchased adjacent to this is a, Bakery Bacus. bácús bhreanainn bhréanainn"}, {"url": "http://www.merriam-webster.com/dictionary/anglicize", "passage_text": "Full Definition of ANGLICIZE. transitive verb. 1. : to make English in quality or characteristics. 2. : to adapt (a foreign word, name, or phrase) to English usage: as a: to alter to a characteristic English form, sound, or spelling. — an·gli·ci·za·tion \\ˌaŋ-glə-sə-ˈzā-shən\\ noun often capitalized. See anglicize defined for English-language learners. See anglicize defined for kids. "}]