[{"url": "http://study.com/academy/lesson/ionic-compounds-formation-lattice-energy-and-properties.html", "passage_text": "4. They conduct electricity well when dissolved in water. This is because the ionic compound is made up of ions, which are all either positively or negatively charged. When the ions are separated in water, they allow the electrons to flow. 5. As a solid, ionic compounds are good insulators. Examples of ionic compounds include pyrite, FeS2. Remember that an ionic bond is formed through the transfer of electrons. These compounds are usually formed between metals and non-metals. The ratio of cations to anions is always in a way that there is no net charge."}, {"url": "http://www.answers.com/Q/What_are_ionic_compound_made_of", "passage_text": "The electronegativity difference between carbon and oxygen is small. So they will form only covalent compounds and not ionic compounds. CO (carbon monoxide) and CO2 (carbon … dioxide) are the two covalent compounds formed. In addition they can form ions like bicarbonate ion (HCO3-) and carbonate ion (CO32-) where there is covalent bond (and not ionic) between carbon and oxygen. Ionic bonds are formed when there is a strong difference between the electronegativity of the two atoms involved. Also, a metal is almost ALWAYS involved in ionic bonding. In fact, I can't think of any ionic compounds not involving metals."}, {"url": "http://study.com/academy/lesson/what-are-ionic-reactions-definition-examples.html", "passage_text": "Lesson Summary. Ionic compounds are compounds made up of ions. These ions are atoms that gain or lose electrons, giving them a net positive or negative charge. Metals tend to lose electrons, so they become cations and have a net positive charge. Nonmetals tend to gain electrons, forming anions that have a net negative charge. Ionic compounds must be balanced-the sum of the positive and negative charges must equal zero. But while the charges of an ionic compound are the sum of their parts, the substance that is formed is quite different. Separately, you would not want to eat sodium as a metal or chlorine as a gas."}, {"url": "https://en.wikipedia.org/wiki/Ionic_compound", "passage_text": "In chemistry, an ionic compound is a chemical compound in which ions are held together in a structure by electrostatic forces termed ionic bonds. The positively charged ions are called cations and the negatively charged ions are called anions. Ionic compounds without the acidic hydrogen ion (H +), or the basic ions hydroxide (OH −) or oxide (O 2−), are also known as salts and can be formed by acid-base reactions. Ionic compounds containing hydrogen ions are classified as acids and compounds containing hydroxide or oxide ions are classified as bases."}, {"url": "http://study.com/academy/lesson/ionic-compounds-formation-lattice-energy-and-properties.html", "passage_text": "This is an example of an ionic compound. An ionic compound is a compound held together by ionic bonds. Examples of ionic compounds include pyrite, FeS2. Remember that an ionic bond is formed through the transfer of electrons. These compounds are usually formed between metals and non-metals. The ratio of cations to anions is always in a way that there is no net charge."}, {"url": "http://www.weegy.com/?ConversationId=7B3AD33C", "passage_text": "User: An ionic compound is typically made of A. two metals. B. two nonmetals. C. a metal and a nonmetal. D. none of the above. Weegy: C. a metal and a nonmetal.(Source: Expert answered|lgcn|Points 1333|User: Name the following chemical compound. "}, {"url": "http://www.wikihow.com/Name-Ionic-Compounds", "passage_text": "Ionic compounds are made up of cations (positive ions) and anions (negative ions). Ionic compounds generally consist of a metal and one or more non-metals. Write the name of the metal, or the cation.This is the positively charged ion in the compound, and it is always written first in ionic compound formulas. Na is sodium. So, write Sodium."}, {"url": "http://dl.clackamas.edu/ch104/lesson7ionic_compound_formulas_names.html", "passage_text": "So we have a +1 charge for sodium and a -1 charge for chloride. The charges are opposite but equal; therefore, there is a 1:1 ratio of sodium ions to chloride ions and NaCl is the formula of the compound. The name of this ionic compound is sodium chloride because it is made of sodium ions and chloride ions. "}, {"url": "https://answers.yahoo.com/question/index?qid=20080906085532AAy75qf", "passage_text": "Ionic compounds are made up of metal/nonmetal substances Covalent compounds are made up of nonmetal/nonmetal substances. Source(s): ionic compounds covalent compounds of: https://shortly.im/ZQpla. "}, {"url": "http://study.com/academy/lesson/what-are-ionic-reactions-definition-examples.html", "passage_text": "Ionic Compounds Are Balanced. Table salt is an example of an ionic compound. Sodium and chlorine ions come together to form sodium chloride, or NaCl. The sodium atom in this compound loses an electron to become Na+, while the chlorine atom gains an electron to become Cl-. Ionic compounds must be balanced-the sum of the positive and negative charges must equal zero. But while the charges of an ionic compound are the sum of their parts, the substance that is formed is quite different. Separately, you would not want to eat sodium as a metal or chlorine as a gas."}]