[{"url": "http://localfoods.about.com/od/crab/qt/How-To-Cook-Crab.htm", "passage_text": "Bring an inch of salt water to a boil in a large pot. Put the crabs in a steamer basket or insert, or simply pile them into the pot and let the bottom crab or two boil slightly and act as a platform for the other crabs to steam. Cook 10 to 20 minutes, depending on the size of the crabs. Bring the water back to a boil and cook until the crabs start to float. Depending on the size of the crabs, this will happen in 10 to 15 minutes or so. Use tongs to remove the crabs and set them out until cool enough to handle."}, {"url": "http://www.louisianacookin.com/cajun-crab-boil/", "passage_text": "1 Add crabs, potatoes, corn, and onions. 2  Return mixture to a rolling boil, and cook for 5 minutes. 3  Turn heat off, and cover pot for 15 to 20 minutes. 4  Pour ice into pot. ( 5 This helps the crabs absorb the seasonings and prevents them from overcooking.) Let crabs stand in water for at least 1 hour before serving. 1 In a very large stockpot, bring 4 quarts water, vinegar, Crab Boil, bay leaves, chiles, thyme, garlic, salt, and lemons to a rolling boil over high heat. 2  Add crabs, potatoes, corn, and onions. 3  Return mixture to a rolling boil, and cook for 5 minutes. 4  Turn heat off, and cover pot for 15 to 20 minutes. 5  Pour ice into pot."}, {"url": "http://www.epicurious.com/recipes/food/views/spicy-boiled-crabs-shrimp-potatoes-corn-and-garlic-12397", "passage_text": "1 Return water to a boil. 2  Transfer about 6 crabs carefully with long tongs to sieve, holding them down in sieve with tongs, and turn crabs out into boiling water. 3  Add remaining crabs in same manner. 4  Return water to a boil and cook crabs until just cooked through, about 10 minutes. 1 In a 7- to 8-gallon kettle bring 5 gallons water to a boil. 2  While water is coming to a boil, in a deep sink rinse crabs in 2 or 3 changes of water."}, {"url": "http://www.soulfoodandsoutherncooking.com/seafood-boil.html", "passage_text": "Start off your seafood boil by bringing 6 to 8 quarts water to a rolling boil. Add Zatarain's crab boil and red potatoes and cook for about 15 minutes. Next add sausage and sweet corn to the boiling water and cook for another 10 minutes until the red potatoes are tender. Next add shrimp and snow crab legs and cook for 3 to 5 minutes. Be sure not to over cook the crab legs and shrimp. Follow the preparation instructions given to you at purchase and you'll be okay. Remove the cooked shrimp and crab legs from boiling water."}, {"url": "http://www.epicurious.com/recipes/food/views/spicy-boiled-crabs-shrimp-potatoes-corn-and-garlic-12397", "passage_text": "Preparation. 1  In a 7- to 8-gallon kettle bring 5 gallons water to a boil. 2  While water is coming to a boil, in a deep sink rinse crabs in 2 or 3 changes of water. 3  Add Zatarain's crab boil or 5 tablespoons Old Bay seasoning, cayenne, salt, lemons, and onions to boiling water and boil 5 minutes. 4  Return water to a boil. 5  Return water to boil and cook ... 1"}, {"url": "http://syrupandbiscuits.com/shrimp-crab-boil/", "passage_text": "It takes some time to get a pot this big heated to boil. Add potatoes, bring to boil, and cook for 5 minutes. Add corn, bring to boil, and cook for 5 minutes. Add shrimp first and then place crab clusters on top. Bring to a boil, cover and remove from heat. Let sit at least 10 minutes up to one hour. The longer it sits, the more flavor the seafood and vegetables absorb. This batch sat in the seasoned water for about 45 minutes. "}, {"url": "http://allrecipes.com/recipe/44033/daves-low-country-boil/", "passage_text": "1 Add potatoes, and sausage, and cook for about 10 minutes. 2  Add the corn and crab; cook for another 5 minutes, then add the shrimp when everything else is almost done, and cook for another 3 or 4 minutes. 3  Drain off the water and pour the contents out onto a picnic table covered with newspaper. 1 Add the corn and crab; cook for another 5 minutes, then add the shrimp when everything else is almost done, and cook for another 3 or 4 minutes. 2"}, {"url": "http://www.epicurious.com/recipes/food/views/spicy-boiled-crabs-shrimp-potatoes-corn-and-garlic-12397", "passage_text": "1 While water is coming to a boil, in a deep sink rinse crabs in 2 or 3 changes of water. ( 2 Do not fill sink too full or crabs may crawl out.). 3  Add Zatarain's crab boil or 5 tablespoons Old Bay seasoning, cayenne, salt, lemons, and onions to boiling water and boil 5 minutes. 1 In a 7- to 8-gallon kettle bring 5 gallons water to a boil. 2 "}, {"url": "http://allrecipes.com/recipe/44033/daves-low-country-boil/", "passage_text": "1 Add Old Bay Seasoning to taste, and bring to a boil. 2  Add potatoes, and sausage, and cook for about 10 minutes. 3  Add the corn and crab; cook for another 5 minutes, then add the shrimp when everything else is almost done, and cook for another 3 or 4 minutes. 1 Add the corn and crab; cook for another 5 minutes, then add the shrimp when everything else is almost done, and cook for another 3 or 4 minutes. 2  Drain off the water and pour the contents out onto a picnic table covered with newspaper."}]