[{"url": "http://www.webmd.com/parenting/baby/tc/jaundice-in-newborns-hyperbilirubinemia-topic-overview", "passage_text": "Jaundice is a yellow tint to a newborn's skin and the white part of the eyes. It is a sign that there's too much bilirubin in the baby's blood. The word for having too much bilirubin in the blood is hyperbilirubinemia (say hy-per-bil-ih-roo-bih-NEE-mee-uh). "}, {"url": "http://www.emedicinehealth.com/jaundice/article_em.htm", "passage_text": "Jaundice is a yellow discoloration of the skin, mucous membranes, and the whites of the eyes caused by increased amounts of bilirubin in the blood. Jaundice is a sign of an underlying disease process. Bilirubin is a by-product of the daily natural breakdown and destruction of red blood cells in the body. The hemoglobin molecule that is released into the blood by this process is split, with the heme portion undergoing a chemical conversion to bilirubin."}, {"url": "http://www.healthline.com/health/jaundice-yellow-skin", "passage_text": "Jaundice is the medical term that describes yellowing of the skin and eyes. This condition forms when there is too much bilirubin in your system. Bilirubin is a yellow pigment that is formed by the breakdown of dead red blood cells in the liver. Normally, the liver gets rid of bilirubin along with old red blood cells."}, {"url": "http://www.medicinenet.com/jaundice_in_adults/article.htm", "passage_text": "Jaundice, also referred to as icterus, is the yellow staining of the skin and sclerae (the whites of the eyes) by abnormally high blood levels of the bile pigment, bilirubin. The yellowing extends to other tissues and body fluids and also may turn the urine dark. Jaundice is a yellowish discoloration of the skin, mucous membranes and of the white of the eyes caused by elevated levels of the chemical bilirubin in the blood (hyperbilirubinemia). The term jaundice is derived from the French word jaune, which means yellow."}, {"url": "https://labtestsonline.org/understanding/conditions/jaundice", "passage_text": "Jaundice, also known as icterus, is a yellowing of the skin, whites of the eyes, and body fluids due to an increase in the amount of bilirubin in the blood. Bilirubin is a yellowish pigment and byproduct of the natural daily breakdown of red blood cells (RBCs). Causes. Jaundice is not an illness but a medical condition or sign of an underlying problem with the liver, pancreas, or gallbladder. Infections, use of certain drugs, cancer, blood disorders, gallstones, birth defects, inherited conditions, and a number of other medical conditions can result in jaundice."}, {"url": "http://www.mayoclinic.org/diseases-conditions/infant-jaundice/basics/definition/CON-20019637", "passage_text": "Definition. Infant jaundice is a yellow discoloration in a newborn baby's skin and eyes. Infant jaundice occurs because the baby's blood contains an excess of bilirubin (bil-ih-ROO-bin), a yellow-colored pigment of red blood cells. Infant jaundice usually occurs because a baby's liver isn't mature enough to get rid of bilirubin in the bloodstream. In some cases, an underlying disease may cause jaundice. Treatment of infant jaundice often isn't necessary, and most cases that need treatment respond well to noninvasive therapy."}, {"url": "http://www.ncbi.nlm.nih.gov/pubmedhealth/PMH0001259/", "passage_text": "Jaundice. A condition in which the skin and the whites of the eyes become yellow, urine darkens, and the color of stool becomes lighter than normal. Jaundice occurs when the liver is not working properly or when a bile duct is blocked. PubMed Health Glossary. "}, {"url": "http://www.healthline.com/health/newborn-jaundice", "passage_text": "Newborn jaundice is a yellowing of a baby’s skin and eyes. Newborn jaundice is very common and can occur when babies have a high level of bilirubin, a yellow pigment produced during normal breakdown of red blood cells. "}, {"url": "http://www.webmd.com/children/digestive-diseases-jaundice", "passage_text": "In this article. Jaundice can occur in babies, children, and adults. Jaundice is not an illness in itself, but a medical condition in which too much bilirubin -- a compound produced by the breakdown of hemoglobin from red blood cells -- is circulating in the blood. The excess bilirubin causes the skin, eyes, and mucus membranes in the mouth to turn a yellowish color. "}, {"url": "http://www.medicalnewstoday.com/articles/165749.php", "passage_text": "Jaundice, also known as icterus, is a term used to describe a yellowish tinge to the skin and sclerae (the white part of the eye) that is caused by hyperbilirubinemia (an excess of bilirubin in the blood). Body fluids may also be yellow. "}]