[{"url": "http://www.answers.com/Q/What_does_a_rheostat_control", "passage_text": "In other words, the terms 'rheostat' and 'potentiometer' do not describe devices but, rather, they describe two applications of a variable resistor. As a rheostat, the variable resistor is connected in series with a load, and two of its three terminals are used-one of the fixed terminal and the slider terminal. A rheostat is a resistor with variable resistance.There are many type of rheostat,involved of a rotary-type rheostat and a sliding rheostst.I dunn know much about the rotary-t … ype rheostat but I can tell u how does a sliding rheostat work."}, {"url": "http://www.answers.com/Q/What_is_a_microscope_rheostat_control", "passage_text": "A rheostat is a resistor with variable resistance.There are many type of rheostat,involved of a rotary-type rheostat and a sliding rheostst.I dunn know much about the rotary-t … ype rheostat but I can tell u how does a sliding rheostat work. The purpose of the rheostat is use to change the resistance of the circuit. The rheostat is use to define Ohm Laws th … e 2nd situation is use to find out what the fixed resistor's resistance. 3rd purpose: used to control the resistance of circuit. eg Radio."}, {"url": "http://www.wisegeek.com/what-is-a-rheostat.htm", "passage_text": "A rheostat is a device which is used to vary the resistance in an electrical circuit without interrupting the circuit. Rheostats are a kind of potentiometer. These devices can be used in a variety of settings, and are usually designed to be sealed so that environmental factors cannot interfere with the function of"}, {"url": "http://www.answers.com/Q/What_does_a_rheostat_control", "passage_text": "Rheostat is simply a variable resistor. i.e., typically 3 contacts, either end of resistive element and slider contact that moves along resistive element. So, in old radios wo … uld typically be used as a volume control.   A variable resistor may be used to control current, in which case it is called a rheostat. A rheostat is a resistor with variable resistance.There are many type of rheostat,involved of a rotary-type rheostat and a sliding rheostst.I dunn know much about the rotary-t … ype rheostat but I can tell u how does a sliding rheostat work."}, {"url": "http://www.tech-faq.com/rheostat.html", "passage_text": "2. Rheostats in cathodic protection. a rheostat is a resistor used to adjust current in a circuit. can any body please tell me what is the use of ammeter. An ammeter measures the electric current in a circuit. Rheostat Construction. Most rheostats are the wire-wound type that have a long length of conductive wire coiled into a tight spiral. The linear type has a straight coil, while the rotary type has the coil curved into a torus to save space."}, {"url": "https://answers.yahoo.com/question/index?qid=20110827035658AAbMBRw", "passage_text": "Report Abuse. A rheostat is an adjustable resistor that is used to control the electrical resistance of a circuit without interrupting the flow of electrical current to that circuit. Rheostats are used for appliances and other items that need both high voltage and electrical current that can be interrupted. A rheostat is simply a coil of resistance wire with a slider on it so that the resistance can be varied. The list of ways that it can be used is very long. Prior to solid state devices they have been used to control lighting or battery charging. speed control of motors. production of variable emf etc."}, {"url": "http://www.tech-faq.com/rheostat.html", "passage_text": "Rheostats. A rheostat is an electrical component that has an adjustable resistance. It is a type of potentiometer that has two terminals instead of three. The two main types of rheostat are the rotary and slider. The symbol for a rheostat is a resistor symbol with an arrow diagonally across it. Rheostat Construction. Most rheostats are the wire-wound type that have a long length of conductive wire coiled into a tight spiral. The linear type has a straight coil, while the rotary type has the coil curved into a torus to save space."}, {"url": "https://en.wikipedia.org/wiki/Resistor", "passage_text": "A resistor is a passive two-terminal electrical component that implements electrical resistance as a circuit element. "}, {"url": "http://www.tedss.com/LearnMore/rheostats", "passage_text": "Rheostat is an adjustable or variable resistor. It is used to control the electrical resistance of a circuit without interrupting the flow of current. Rheostat has 3 terminals and usually consist of a resistive wire wrapped to form a toroid coil with a wiper that slides along the surface of the coil. It is most often designed with a ceramic core. Rheostats are used in applications that require high voltage and current."}, {"url": "http://www.ehow.com/how-does_5217277_rheostats-work.html", "passage_text": "Rheostats and Resistance. A rheostat is a simple variable resistor with two contacts. A resistor is a device designed to resist the flow of electricity. The more resistance an electronic current has, the more slowly the current in it flows. Inside a Rheostat. Most rheostats contain a strip of some substance with fairly high resistance, such as carbon. One of the rheostat's two contacts attaches to the end of the carbon strip. The other moves along the strip as you adjust the rheostat slider or knob."}]