[{"url": "http://www.everydayhealth.com/drugs/cephalexin", "passage_text": "Cephalexin, an antibiotic in the cephalosporin family, is used to treat infections caused by bacteria. Cephalexin and other cephalosporin antibiotics are broad-spectrum antibiotics, meaning they're used to treat a wide range of infections caused by many different bacteria."}, {"url": "http://www.webmd.com/drugs/2/drug-11757/cephalexin-oral/details/list-conditions", "passage_text": "cephalexin oral may also be used to treat: Treatment to Prevent Bacterial Infection of a Heart Valve, Urinary Tract Infection Prevention, Bacterial Infection of Breast, Diabetic with Foot Infection due to a Specific Bacteria. "}, {"url": "http://antibiotics.emedtv.com/cephalexin/what-is-cephalexin-used-for.html", "passage_text": "Cephalexin may be used to treat a number of other bacterial infections. In addition, it can be substituted in place of penicillin to treat common infections in those people who are allergic to penicillin. Bacterial infections that cephalexin can treat are sinus infections, irritations of the prostate, and skin infections (like cellulitis)."}, {"url": "http://www.vetrxdirect.com/product/view/cephalexin-for-cats-and-dogs", "passage_text": "Cephalexin. Prescription Cephalexin is antibiotic that provides safe and effective treatment of a range of infections common in cats and dogs including bacterial infections of the: skin, respiratory system, urinary tract, bones, and joints. "}, {"url": "http://www.everydayhealth.com/drugs/cephalexin", "passage_text": "12 Reviews. Cephalexin, an antibiotic in the cephalosporin family, is used to treat infections caused by bacteria. Cephalexin is prescribed to treat respiratory tract, middle ear, skin, bone, and urinary tract infections (UTI). It's also used to prevent infections caused by streptococcal bacteria, including prevention of rheumatic fever. Cephalexin isn't recommended for sinus infections. Cephalexin and other cephalosporin antibiotics are broad-spectrum antibiotics, meaning they're used to treat a wide range of infections caused by many different bacteria."}, {"url": "http://www.1800petmeds.com/Cephalexin-prod10050.html", "passage_text": "Cephalexin is a broad-spectrum antibiotic available as capsules or suspension used to treat bacterial infections of the skin, urinary tract, respiratory tract, bones, and joints. Cephalexin requires a prescription from your veterinarian. Symptoms may begin to improve before the infection is completely treated. What is Cephalexin: Cephalexin is an antibiotic belonging to a class of drugs called cephalosporins that fight bacteria in the body. Cephalexin can be used to treat infections such as bronchitis as well as ear, skin, and urinary tract infections. Cephalexin may also be used for purposes other than those listed"}, {"url": "http://www.lifescript.com/health/centers/copd/s.aspx?query=what%20does%20keflex%20treat", "passage_text": "Cephalexin symptoms can occur after taking cephalosporin antibiotic, which is used to treat certain bacterial infections, including pneumonia and bone, ear, skin and urinary tract infections. ... Urinary Tract Infection (uti) www.lifescript.com/health/a-z/mayo/u/urinary_tract_infection_uti.aspx. Female anatomy. Cephalexin is used to treat conditions such as bone, ear, skin, and urinary tract infections, and ... While cephalexin is not expected to be harmful to unborn babies, be sure to inform your ... take a poll: Do you take heart medications and supplements to lower your LDL cholesterol? ..."}, {"url": "http://www.petrescuerx.com/index.cfm/product/27_51/cephalexin.cfm", "passage_text": "Keftab®. General Description: An oral cephalosporin antibiotic used to treat many common bacterial infections in dogs and cats (ex. urinary tract, skin and soft tissue, bone and respiratory tract infections). Cephalexin may be given with meals. Cephalexin is available in capsules, tablets or as an oral suspension. "}]