[{"url": "http://www.sheknows.com/baby-names/name/diane", "passage_text": "French Meaning: The name Diane is a French baby name. In French the meaning of the name Diane is: The French form of the Latin Diana. Famous bearer: Diane de Poitiers, mistress of France's King Henri II.Divine. Mythological ancient Roman divinity Diana was noted for beauty and swiftness; often depicted as a huntress. Greek goddess of the moon"}, {"url": "http://www.sheknows.com/baby-names/name/diana", "passage_text": "The name Diana is a French baby name. In French the meaning of the name Diana is: From the Greek goddess of the moon. Latin Meaning: The name Diana is a Latin baby name. In Latin the meaning of the name Diana is: Fertile. God, devine. Famous bearers: Diana was the Roman goddess of fertility and childbirth, of hunting, and the moon. The late Lady Diana Spencer, often called 'Lady Di', married British Prince Charles and became Princess Diana of Wales."}, {"url": "http://www.babynamewizard.com/baby-name/girl/diana", "passage_text": "Comments and insights on the name Diana: | Edit. Diana is an extremely gorgeous, ravishingly alluring, classic, young, beautiful name for a baby girl. Pronounced Dye-anne-uh. Aidan, Dania, Diana and Nadia are anagrams of each other; they contain the same letters. Origin of the name Diana: Derived from the Latin Diviana, which is from divus (divine). The name is borne in Roman mythology by the virgin goddess of the moon and of hunting. From A World of Baby Names by Teresa Norman"}, {"url": "http://www.ohbabynames.com/meaning/name/diana/351", "passage_text": "Etymology & Historical Origin-Diana. The name Diana is borne from Roman mythology by the goddess of the hunt and the moon (in Greek mythology her name is Artemis). Diana was the daughter of the king of all Roman gods, Jupiter, and the twin sister of Apollo, god of the arts and the sun"}, {"url": "http://www.behindthename.com/name/diana", "passage_text": "Meaning & History. Probably derived from an old Indo-European root meaning heavenly, divine, related to dyeus (see ZEUS). Diana was a Roman goddess of the moon, hunting, forests, and childbirth, often identified with the Greek goddess Artemis. As a given name, Diana has been regularly used since the Renaissance. It became more common in the English-speaking world following Sir Walter Scott's novel 'Rob Roy' (1817), which featured a character named Diana Vernon. It also appeared in George Meredith's novel 'Diana of the Crossways' (1885)."}, {"url": "http://www.thinkbabynames.com/meaning/0/Diana", "passage_text": "Diana /di-ana/ [3 sylls.] as a girls' name is pronounced dy-ANN-ah, dee-AHN-ah. It is of Latin origin, and the meaning of Diana is divine. Mythology: Diana was an ancient Roman goddess who came to be associated with the Greek god Artemis. Noted for her beauty and fleetness, Diana is often depicted as a huntress. Used since the 16th century. Made popular by the late Princess of Wales. See also Dionne and Diantha. Diana is a very popular first name for females (#96 out of 4276, Top 2%) and also a very popular surname for all people (#10811 out of 150436, Top 7%). (2000 U.S. Census). Presented below is the baby name popularity of Diana for girls."}, {"url": "https://en.wikipedia.org/wiki/Diana_(given_name)", "passage_text": "It is the name of the Roman goddess Diana, the goddess of the hunt, forests, and childbirth. The French form of the name is Diane. In Persian language Diana means supplier (messenger) of beneficence & wellness. Diana has consistently ranked among the top 200 names used for girls born in the United States since the 1930s. It was the 107th most popular name for baby girls born in the United States in 2007"}, {"url": "http://nameberry.com/babyname/Diana", "passage_text": "Diana is the Latin name for the Roman goddess associated with the moon, virginity, and hunting; she is the protector of wild animals, represented in myth as both beautiful and chaste. Two of her most prominent bearers today are singers Diana (born Diane) Ross and Krall. "}, {"url": "http://www.sheknows.com/baby-names/name/diane", "passage_text": "The name Diane is an American baby name. In American the meaning of the name Diane is: The French form of the Latin Diana. Famous bearer: Diane de Poitiers, mistress of France's King Henri II.Divine. Mythological ancient Roman divinity Diana was noted for beauty and swiftness; often depicted as a huntress. In French"}]