[{"url": "http://www.slideshare.net/sarihafizh/language-dialect-and-varieties-31983024", "passage_text": "1 2. Language variation • No two speakers of a language speak exactly the same way • No individual speaker speaks the same way all the time. 2  3. Language Varieties Language variety refers to the various forms of language triggered by social factors. 1 3. Language Varieties Language variety refers to the various forms of language triggered by social factors. 2  Language may changes from region to region, from one social class to another, from individual to individual, and from situation to situation. 3  This actual changes result in the varieties of language."}, {"url": "http://elearning.la.psu.edu/aplng/802/lesson-3/copy_of_lesson-page-2", "passage_text": "Language Varieties. The term language varieties refers to any form of a language---whether a regional or social dialect, a pidgin, creole, or some other language code. The differences may be related to the formality of the context, but language varieties also are associated with geographic patterns in the way people talk as well as social contexts or groupings."}, {"url": "http://grammar.about.com/od/il/g/Language-Variety.htm", "passage_text": ". . [and] (2) use-related varieties, associated with function, such as legal English (the language of courts, contracts, etc.) and literary English (the typical usage of literary texts, conversations, etc.).. Also see: 1  Lect. 2  Linguistic Variation. 3  Dialectology. 4  Diglossia. 5  Expanding Circle. 6  Global English. 7  Koineization. "}, {"url": "https://en.wikipedia.org/wiki/Variety_(linguistics)", "passage_text": "For the commune in France, see Lect, Jura. In sociolinguistics a variety, also called a lect, is a specific form of a language or language cluster. This may include languages, dialects, registers, styles or other forms of language, as well as a standard variety. Sociolinguists generally recognize the standard variety of a language as one of the dialects of that language. In some cases, an official body, such as the Academie académie, francaise française describes the grammar and usage of a."}, {"url": "http://www.hawaii.edu/satocenter/langnet/", "passage_text": "Welcome to the Language Varieties Web Site!! This site is about varieties of language that differ from the standard variety that is normally used in the media and taught in the schools. These include pidgins, creoles, regional dialects, minority dialects and indigenized varieties. People don't think one way is right and one way is wrong-just that they're different. It's the same with the language varieties described in this site. * * * * * * Click on any of the locations on the map below to find out more about a language variety spoken there. (Or click on the name of the variety below the map.)."}, {"url": "http://www.hawaii.edu/satocenter/langnet/definitions/index.html", "passage_text": "A regional dialect is not a distinct language but a variety of a language spoken in a particular area of a country. Some regional dialects have been given traditional names which mark them out as being significantly different from standard varieties spoken in the same place. Like a pidgin, a creole is a distinct language which has taken most of its vocabulary from another language, the lexifier, but has its own unique grammatical rules. Unlike a pidgin, however, a creole is not restricted in use, and is like any other language in its full range of functions."}, {"url": "https://en.wikipedia.org/wiki/Variety_(linguistics)", "passage_text": "O'Grady et al. define dialect as, A regional or social variety of a language characterized by its own phonological, syntactic, and lexical properties.. A variety spoken in a particular region is called a regional dialect; some regional varieties are called topolects, especially when discussing varieties of Chinese. Sociolinguists generally recognize the standard variety of a language as one of the dialects of that language. In some cases, an official body, such as the Academie académie, francaise française describes the grammar and usage of a."}, {"url": "https://en.wikipedia.org/wiki/Variety_(linguistics)", "passage_text": "Dialectology is the study of dialects and their geographic or social distribution. Traditionally, dialectologists study the variety of language used within a particular speech community, a group of people who share a set of norms or conventions for language use. Sociolinguists generally recognize the standard variety of a language as one of the dialects of that language. In some cases, an official body, such as the Academie académie, francaise française describes the grammar and usage of a."}, {"url": "http://www.hawaii.edu/satocenter/langnet/definitions/index.html", "passage_text": "A pidgin is a new language which develops in situations where speakers of different languages need to communicate but don't share a common language. The vocabulary of a pidgin comes mainly from one particular language (called the 'lexifier'). An early 'pre-pidgin' is quite restricted in use and variable in structure. But the later 'stable pidgin' develops its own grammatical rules which are quite different from those of the lexifier. Like a pidgin, a creole is a distinct language which has taken most of its vocabulary from another language, the lexifier, but has its own unique grammatical rules. Unlike a pidgin, however, a creole is not restricted in use, and is like any other language in its full range of functions."}]