[{"url": "http://resourcesforhistory.com/", "passage_text": "In the Iron Age, the people of Britain lived in tribes. Today these people are often called 'Celts'. The Celts controlled most of central Europe and by 700BC they also conquered the lands of Northern Spain. The Celts were a force in Britain by 480BC."}, {"url": "http://www.bbc.co.uk/wales/celts/factfile/", "passage_text": "The Iron Age Celts lived in Britain before and after Jesus. We're going back a very, very long time-two thousand years ago, in fact."}, {"url": "http://resources.woodlands-junior.kent.sch.uk/homework/celts.htm", "passage_text": "The Celts arrived in Britain about the year 500 BC. They were farmers and lived in small village groups in the centre of their arable fields. These groups slowly collected together into larger tribes, living in their own special regions. Each tribe was ruled by a king or queen."}, {"url": "http://www.answers.com/Q/How_did_the_celts_live", "passage_text": "The Celts lived in central Europe: northern France, part of Holland, Belgium, England, and parts of Switzerland. These lands had long been settled by the warlike Celts. Soon after 500 BC, the Celts wandered east and west in search of fertile farm land."}, {"url": "http://www.bbc.co.uk/wales/celts/factfile/", "passage_text": "Archaeologists believe that the head was greatly respected by the Celts. The Celts lived across most of Europe during the Iron Age. Today the Celts live in Wales, Ireland, Scotland, the Isle of Man, Cornwall and in Brittany, France. Their culture lives on in language, music, song and literature."}, {"url": "http://www.bbc.co.uk/wales/celts/factfile/", "passage_text": "Contact Us. The Iron Age Celts lived in Britain before and after Jesus. We're going back a very, very long time-two thousand years ago, in fact. Our years are numbered by starting at the year Jesus Christ was born-and the Iron Age Celts lived here 750 years before that."}, {"url": "http://www.answers.com/Q/How_did_the_celts_live", "passage_text": "The Celts lived as a trading race. throughout Europe, Britain,France Germany and the like. They were large in number but had no Head quaters. they moved freely and lived from the land. they also had a deep spiritual relationship with the earth."}, {"url": "http://www.primaryhomeworkhelp.co.uk/celts.htm", "passage_text": "The Iron Age Celts lived here 750 years before Jesus was born. The Iron Age ended in AD43 (43 years after Jesus was born) when the Romans invaded Britain."}]