[{"url": "http://www.health.com/health/gallery/0,,20387825,00.html", "passage_text": "by Mara Betsch. Anywhere from 33% to 75% of people with rheumatoid arthritis (RA) feel that there are some foods that make symptoms, such as stiff and painful joints, better or worse."}, {"url": "http://www.webmd.com/rheumatoid-arthritis/biologics-15/rheumatoid-arthritis-diet", "passage_text": "Veggies, beans, and whole grains are high in fiber. Fish are a good source of omega-3 fatty acids, or healthy fats. Fatty fish, like salmon, herring, sardines, and anchovies, have the most. This diet also relies on olive oil, another healthy fat, to take the place of full-fat dairy products like butter."}, {"url": "http://www.everydayhealth.com/rheumatoid-arthritis/food-cures-for-rheumatoid-arthritis-do-they-work.aspx", "passage_text": "Rheumatoid arthritis (RA) causes pain, swelling, and stiffness in your joints. Some people find that one way to relieve their joint pain is to make changes in their diet. “There is no one food that helps everyone with rheumatoid arthritis,” says Scott Zashin, MD, a rheumatologist at the Texas Health Presbyterian Hospital in Dallas and an author of Natural Arthritis Treatment. But some people find that eating foods that reduce inflammation can help ease their joint pain."}, {"url": "http://www.webmd.com/rheumatoid-arthritis/guide/ra-foods", "passage_text": "Go Mediterranean. People with RA have immune systems that harm the lining of their joints. This damage causes chronic inflammation, stiffness, and pain. Research shows the Mediterranean diet's tasty fare -- like olive oil, fish, greens, and other vegetables -- can lower inflammation, which is good for your whole body."}, {"url": "http://www.everydayhealth.com/rheumatoid-arthritis/food-cures-for-rheumatoid-arthritis-do-they-work.aspx", "passage_text": "Putting Together an Anti-Inflammatory Diet for RA. Paying more attention to the foods you eat -- especially those that reduce inflammation and have lots of antioxidants -- may ease your rheumatoid arthritis symptoms."}, {"url": "http://www.healwithfood.org/rheumatoidarthritis/diet.php", "passage_text": "Foods rich in beta-carotene should be included in any diet designed for rheumatoid arthritis patients. Beta-carotene is a fat soluble antioxidant with strong anti-inflammatory properties, and research shows that low levels of beta-carotene are a risk factor for rheumatoid arthritis."}]