[{"url": "https://en.wikipedia.org/wiki/Space_elevator_economics", "passage_text": "The costs of using a well-tested system to launch payloads are high. Prices range from about $4,300/kg for a Proton launch to about US$ 40,000/kg for a Pegasus launch (2004). Some systems under development, such as the SpaceX Falcon Heavy, offer rates as low as $1,600/kg. For a space elevator, the cost varies according to the design. Bradley C. Edwards received funding from NIAC from 2001 to 2003 to write a paper, describing a space elevator design. In it he stated that: The first space elevator would reduce lift costs immediately to $100 per pound ($220/kg)"}, {"url": "https://en.wikipedia.org/wiki/Space_elevator_economics", "passage_text": "Using wholesale electricity prices for 2008 to 2009, and the current 0.5% efficiency of power beaming, a space elevator would require US$220/kg just in electrical costs. Dr. Edwards expects technical advances to increase the efficiency to 2%. For a space elevator, the cost varies according to the design. Bradley C. Edwards received funding from NIAC from 2001 to 2003 to write a paper, describing a space elevator design. In it he stated that: The first space elevator would reduce lift costs immediately to $100 per pound ($220/kg)"}, {"url": "http://www.bbc.com/future/story/20120817-space-elevators-going-up", "passage_text": "Price estimates vary from $10 to $50 billion, which is still cheaper than the cost of the International Space Station (ISS). A space elevator would also take around the same amount of time to build as the ISS and would, arguably, be much more useful. "}, {"url": "http://www.mill-creek-systems.com/HighLift/chapter11.html", "passage_text": "For operating the space elevator we will assume two platform facilities with crews (20 per facility), technical staff (30 per facility), support personal (30 per facility), and administration (10 per facility). This is a total of 140 people (this is roughly equivalent to the Sealaunch program). Chapter 11: Budget Estimates. Estimating the cost of building and operating a space elevator at this stage of development is challenging, but we feel for at least large segments of the program we can get cost estimates that can guide future decisions."}, {"url": "http://science.howstuffworks.com/space-elevator4.htm", "passage_text": "Perhaps the biggest factor propelling the idea of a space elevator is that it would significantly lower the cost of putting cargo into space. Although slower than the chemically propelled space shuttle, the lifters reduce launch costs from $10,000 to $20,000 per pound, to approximately $400 per pound. "}, {"url": "https://answers.yahoo.com/question/index?qid=20060721170139AA5i2dM", "passage_text": "Update: Here is some information for you-A circular geosynchronous orbit in the plane of the Earth's equator has a radius of approximately approximately 35,786 km (22,236 statute miles) above mean sea level. A statute mile is 1,760 yards-or 5280 feet so to get to a geosynchronous orbit it would take a... Carbon nanotubes are strong enough with a tensile strength of 63 gigapascals. The idea would be to tether a very small asteroid at the top just a few kilometers PAST geo synchronous orbit to keep the space elevator cable under tension at all times."}, {"url": "https://answers.yahoo.com/question/index?qid=20060721170139AA5i2dM", "passage_text": "Best Answer: http://www.liftport.com/files/521Edwards... It would probably cost tens to hundreds of billions of dollars. The problem is finding a material strong enough to support itself without breaking. Kevlar is not strong enough with a tensile strength of about 3.7 gigapascals. Carbon nanotubes are strong enough with a tensile strength of 63 gigapascals. The idea would be to tether a very small asteroid at the top just a few kilometers PAST geo synchronous orbit to keep the space elevator cable under tension at all times."}, {"url": "https://en.wikipedia.org/wiki/Space_elevator_economics", "passage_text": "For comparison, in potentially the same time frame as the elevator, the Skylon, a 12,000 kg cargo capacity single-stage-to-orbit spaceplane (not a conventional rocket) is estimated to have an R&D and production cost of about $15 billion. The vehicle has about the same $3,000/kg price tag. For a space elevator, the cost varies according to the design. Bradley C. Edwards received funding from NIAC from 2001 to 2003 to write a paper, describing a space elevator design. In it he stated that: The first space elevator would reduce lift costs immediately to $100 per pound ($220/kg)"}, {"url": "http://www.abc.net.au/news/2014-09-21/japanese-construction-giants-promise-space-elevator-by-2050/5756206", "passage_text": "The Japanese construction giant Obayashi says they will build a space elevator that will reach 96,000 kilometres into space. Robotic cars powered by magnetic linear motors will carry people and cargo to a newly-built space station, at a fraction of the cost of rockets. It will take seven days to get there. "}]