[{"url": "http://www.womenshealth.gov/publications/our-publications/fact-sheet/menstruation.html", "passage_text": "It also prepares your body for pregnancy each month. A cycle is counted from the first day of 1 period to the first day of the next period. The average menstrual cycle is 28 days long. Cycles can range anywhere from 21 to 35 days in adults and from 21 to 45 days in young teens. The rise and fall of levels of hormones during the month control the menstrual cycle."}, {"url": "http://menstrupedia.com/articles/physiology/menstruation-last", "passage_text": "On an average a period lasts between 3 to 5 days. It is normal for a girl to have irregular periods in the beginning. During this time, the duration of her periods may vary from as short as 2 days to as long as 7 days. It can take up to a year for periods to become regular."}, {"url": "http://www.acog.org/Patients/FAQs/Your-First-Period-Especially-for-Teens", "passage_text": "A menstrual cycle is counted from the first day of bleeding in one month to the first day of bleeding in the next month. The average menstrual cycle is about 28 days, but cycles that are 21–45 days also are normal. It may take 6 years or more after your period starts for your cycle to get regular."}, {"url": "http://www.webmd.boots.com/menopause/guide/heavy-periods-menopause", "passage_text": "On average, a menstrual cycle lasts about 28 days, but anywhere between 21 and 35 days may be considered normal. One of the first signs of changing hormone levels is a change in the pattern of your monthly period. As your body transitions to menopause you may experience a range of symptoms that include changes in:"}, {"url": "http://www.summitmedicalgroup.com/library/pediatric_health/hhg_period_late_or_missed/", "passage_text": "A menstrual cycle is the time from the day a menstrual period starts to the time the next period starts. The average menstrual cycle is 28 days long. However, a normal cycle can be shorter or longer than this. It may be anywhere from 21 to 35 days long. Most periods last 3 to 5 days, but anywhere from 2 to 7 days is normal."}]