[{"url": "http://creditcardforum.com/blog/what-is-the-highest-credit-score-you-can-have/", "passage_text": "Most websites also get the average seriously wrong, too. A FICO score can range from 300 to 850. There is a lot of misinformation on the internet as to what the average score is (many sources cite numbers in the 670’s)."}, {"url": "http://www.huffingtonpost.com/simple-thrifty-living/what-is-the-optimal-credi_b_3845664.html", "passage_text": "If you are looking for the best rates and the highest credit limits, you should aim for a credit score of 760, according to FICO. Anything above a 760 is just going to be for bragging rights, since a score of 760 or above will get you the best rates and credit limits."}, {"url": "http://www.answers.com/Q/What_is_highest_credit_score_possible", "passage_text": "The highest credit score one can have ranges from 760-850. A poor credit score would be in the range of 500-579. Poor credit ratings can prevent one from obtaining mortgages … and approvals on loans."}, {"url": "http://creditcardforum.com/blog/what-is-the-highest-credit-score-you-can-have/", "passage_text": "Fair Isaac Corporation developed the FICO score 27 years ago (1987). Since that time, it has definitely been the gold standard for credit scoring, as it is the score most commonly used by lenders. You can get your FICO score for free with these cards."}, {"url": "http://creditcardforum.com/blog/what-is-the-highest-credit-score-you-can-have/", "passage_text": "Of course we all want the best, but the highest possible credit score — the 850 FICO — is almost unattainable. In fact, there are many loan officers that have been in the business for years who have said they’ve never seen a perfect 850 credit score before."}, {"url": "http://www.thetruthaboutcreditcards.com/what-is-the-highest-credit-score/", "passage_text": "The VantageScore credit score ranges from 501-990, so 990 is the highest credit score you can achieve if a bank or lender uses that scoring model. Again, the higher the credit score the better. Anything above 900 would land you in their “A” bucket, which as we know all from grade school is the best you can do."}, {"url": "http://creditcardforum.com/blog/what-is-the-highest-credit-score-you-can-have/", "passage_text": "As of Q3 2015, there are only three places you can buy real FICO scores and those are Experian (via its credit-monitoring service), Equifax and MyFICO. All the other websites sell Fake/Fako score because they don’t have a license for using the proprietary FICO scoring formula."}, {"url": "http://www.answers.com/Q/What_is_highest_credit_score_possible", "passage_text": "The highest possible credit score is 850- anything above around 700 is really good. Below 620 you are considered a serious credit risk and will pay high interest rates on any … loans, credit cards, etc. you can get It depends on the Credit Reporting Agency because they all use varying models."}]