[{"url": "http://www.bnl.gov/bnlweb/pubaf/pr/1999/bnlpr092299.html", "passage_text": "Bone flute found in China at 9,000-year-old Neolithic site. Upton, NY-Researchers in China have uncovered what might be the oldest playable musical instrument. Their work is described in a paper published in the September 23 issue of the scientific journal Nature. The flutes may be the earliest complete, playable, tightly-dated, multinote musical instruments. Garman Harbottle, a chemist at the U.S. Department of Energy's Brookhaven National Laboratory and member of the Jiahu research team, helped analyze data from carbon-14 dating done in China on materials taken from the site."}, {"url": "http://www.answers.com/Q/The_oldest_playable_musical_instruments_were_discovered_in_and_are_thought_to_be_between_7000_and_9000_years_old", "passage_text": "The oldest playable flutes were made of bone. These flutes are over  40,000 years old, making the flute the oldest musical instrument  ever found. 1 person found this useful. Edit. Share to: 1  The History of Fort Lee Virginia Fort Lee in Virginia goes a long way back in American history."}, {"url": "http://www.answers.com/Q/The_oldest_playable_musical_instruments_were_discovered_in_and_are_thought_to_be_between_7000_and_9000_years_old", "passage_text": "In Musical Instruments. The oldest playable musical instrument was discovered in China. The  instrument were 9,000 years old, and was a type of flute. The flute  was made from the bone of a bird's … wing. There were other flutes  found in the area, but these were far less playable and intact. These flutes are over  40,000 years old, making the flute the oldest musical instrument  ever found. 1 person found this useful. Edit. Share to: 1  The History of Fort Lee Virginia Fort Lee in Virginia goes a long way back in American history."}, {"url": "http://www.nytimes.com/1999/09/28/science/after-9000-years-oldest-playable-flute-is-heard-again.html", "passage_text": "Science. Chinese archeologists have unearthed what is believed to be the oldest known playable musical instrument, a seven-holed flute fashioned 9,000 years ago from the hollow wing bone of a large bird. Photo: The oldest known playable flute (second from bottom) with five other 9,000-year-old flutes made from crane bones that were discovered in China.(Juzhong Zhang)."}, {"url": "https://answers.yahoo.com/question/index?qid=20081003112939AAMzwx3", "passage_text": "Chinese scholars have recovered six bone flutes dating from 8,000 to 9,000 years ago, the world's oldest complete, playable, multinote musical instruments. The oldest playable musical instruments were discovered in __________ and are thought to be between 7,000 and 9,000 years old. please help me!!!!!!!!! Add your answer. Source"}, {"url": "http://www.bnl.gov/bnlweb/pubaf/pr/1999/bnlpr092299.html", "passage_text": "Brookhaven Lab Expert Helps Date Flute Thought to be Oldest Playable Musical Instrument Bone flute found in China at 9,000-year-old Neolithic site Upton, NY-Researchers in China have uncovered what might be the oldest playable musical instrument. Their work is described in a paper published in the September 23 issue of the scientific journal Nature. The flutes may be the earliest complete, playable, tightly-dated, multinote musical instruments. Garman Harbottle, a chemist at the U.S. Department of Energy's Brookhaven National Laboratory and member of the Jiahu research team, helped analyze data from carbon-14 dating done in China on materials taken from the site."}, {"url": "http://www.answers.com/Q/The_oldest_playable_instruments_discovered_in_China_were_tuned_to_the_scale", "passage_text": "The oldest playable musical instrument was discovered in China. The  instrument were 9,000 years old, and was a type of flute. The flute  was made from the bone of a bird's … wing. There were other flutes  found in the area, but these were far less playable and intact. The oldest instrument ever found is the flute. Bird bone and ivory flutes have been discovered in Europe and China dating back 40,000 years."}, {"url": "http://www.answers.com/Q/The_oldest_playable_instruments_discovered_in_China_were_tuned_to_the_scale", "passage_text": "The oldest playable flutes were made of bone. These flutes are over  40,000 years old, making the flute the oldest musical instrument  ever found. The oldest instrument ever found is the flute. Bird bone and ivory flutes have been discovered in Europe and China dating back 40,000 years."}, {"url": "http://superbeefy.com/how-was-music-invented-and-when/", "passage_text": "The oldest musical instrument ever found is between 43,000 and 82,000 years old. It’s part of the thigh bone of a bear with four holes carved into it, it must have been a type of flute. The oldest playable musical instrument found so far is 9,000 years old. Several flutes were found in China, made from the wing bones of the red-crowned crane. The best preserved flute has been played and we now know that Stone Age people listened to a sort of weedy recorder. "}]