[{"url": "https://en.wikipedia.org/wiki/Kussmaul_breathing", "passage_text": "Adolph Kussmaul, who introduced the term, referred to breathing when metabolic acidosis was sufficiently severe for the respiratory rate to be abnormal or reduced."}, {"url": "https://en.wikipedia.org/wiki/Kussmaul_breathing", "passage_text": "Kussmaul breathing is a deep and labored breathing pattern often associated with severe metabolic acidosis, particularly diabetic ketoacidosis (DKA) but also kidney failure."}, {"url": "http://allnurses.com/nursing-student-assistance/respiratory-acidosis-alkalosis-205406.html", "passage_text": "respiratory alkalosis: hyper ventilation, rapid rate of breathing, causes too much carbon dioxide to be exhaled and the ph of the body rises. the cardinal sign of respiratory alkalosis is the deep, rapid breathing, more than 40 breaths per minute, that is similar to kussmaul's respirations (seen in metabolic acidosis)."}, {"url": "https://en.wikipedia.org/wiki/Kussmaul_breathing", "passage_text": "Note that Kussmaul breathing occurs only in advanced stages of acidosis, and is fairly rarely reached. In less severe cases of acidosis, rapid, shallow breathing is seen. Kussmaul breathing is a kind of very deep, gasping, desperate breathing."}, {"url": "http://www.wisegeekhealth.com/what-is-kussmaul-breathing.htm", "passage_text": "Kussmaul breathing is an abnormal type of respiration. Kussmaul breathing is characterized by breathing that is very deep and labored."}, {"url": "http://www.medicinenet.com/script/main/art.asp?articlekey=4123", "passage_text": "Kussmaul breathing: Air hunger, or the rapid, deep, and labored breathing characteristic of patients with acidosis (excess acidity of tissues). For example, Kussmaul breathing is seen with the acidosis of diabetes mellitus that is seriously out of control. Treatment is directed toward controlling the underlying disease."}, {"url": "https://en.wikipedia.org/wiki/Kussmaul_breathing", "passage_text": "In metabolic acidosis, breathing is first rapid and shallow but as acidosis worsens, breathing gradually becomes deep, labored and gasping. It is this latter type of breathing pattern that is referred to as Kussmaul breathing."}, {"url": "http://drugline.org/medic/term/kussmaul-breathing/", "passage_text": "Kussmaul breathing is a deep and labored breathing pattern often associated with severe metabolic acidosis, particularly diabetic ketoacidosis (DKA) but also renal ..."}, {"url": "http://www.wisegeekhealth.com/what-is-kussmaul-breathing.htm", "passage_text": "Kussmaul breathing is a type of abnormal respiration, characterized by being labored and very deep, that can be seen in patients with extreme metabolic acidosis. This condition is usually identified and treated before Kussmaul breathing develops."}]