[{"url": "http://www.encyclopedia.com/topic/Glycocalyx.aspx", "passage_text": "Glycocalyx. The glycocalyx is a carbohydrate-enriched coating that covers the outside of many eukaryotic cells and prokaryotic cells, particularly bacteria. When on eukaryotic cells the glycocalyx can be a factor used for the recognition of the cell. 1. A layer of carbohydrate on the surface of the plasma membrane of most eukaryotic cells. It is made up of the oligosaccharide side-chains of the glycolipid and glycoprotein components of the membrane and may include oligosaccharides secreted by the cell."}, {"url": "http://www.merriam-webster.com/medical/glycocalyx", "passage_text": "Medical Definition of GLYCOCALYX. : a polysaccharide or glycoprotein covering on a cell surface. "}, {"url": "https://en.wikipedia.org/wiki/Glycocalyx", "passage_text": "The glycocalyx is a type of identifier that the body uses to distinguish between its own healthy cells and transplanted tissues, diseased cells, or invading organisms. The glycocalyx exists in bacteria as either a capsule or a slime layer. 6 points at the glycocalyx. The difference between a capsule and a slime layer is that in a capsule polysaccharides are firmly attached to the cell wall, while in a slime layer the glycoproteins are loosely attached to the cell wall."}, {"url": "http://study.com/academy/lesson/glycocalyx-definition-function.html", "passage_text": "This is where the glycocalyx comes in. The glycocalyx is a thick outer covering of the plasma membrane. It is composed of strands of sugars and proteins bound together. The result is a thick, sticky layer that helps cells stay put in environments with lots of physical stress. Think of it as ultra sticky tape. Next is the bacterial glycocalyx. This is the reason we just can't get that slime off the bathtub. Most bacteria make a glycocalyx, but some are experts. These expert bacteria make a very thick glycocalyx that helps them to adhere to each other and surfaces in extreme environments."}, {"url": "http://www.biology-online.org/dictionary/Glycocalyx", "passage_text": "(2) Sugar coat surrounding the cell wall of bacterium, as bacterial capsule or slime layer in various bacterial cells. Supplement. The various functions of glycocalyx of a cell includes the following: 1  cell recognition. 2  cell adhesion. 3  protection. 4  permeability barrier."}, {"url": "https://en.wikipedia.org/wiki/Glycocalyx", "passage_text": "The glycocalyx is a glycoprotein-polysaccharide covering that surrounds the cell membranes of some bacteria, epithelia and other cells. Most animal epithelial cells have a fuzz-like coat on the external surface of their plasma membranes. The glycocalyx exists in bacteria as either a capsule or a slime layer. 6 points at the glycocalyx. The difference between a capsule and a slime layer is that in a capsule polysaccharides are firmly attached to the cell wall, while in a slime layer the glycoproteins are loosely attached to the cell wall."}, {"url": "http://groups.molbiosci.northwestern.edu/holmgren/Glossary/Definitions/Def-G/glycocalyx.html", "passage_text": "Extracellular polymeric material produced by some bacteria. Term initially applied to the polysaccharide matrix excreted by epithelial cells forming a coating on the surface of epithelial tissue. General term for polysaccharide compounds outside the bacterial cell wall. Also called slime layer, EPS, or matrix polymer. (See EPS.). "}, {"url": "http://dictionary.sensagent.com/Glycocalyx/en-en/", "passage_text": "Glycocalyx is a general term referring to extracellular polymeric material (glycoprotein) produced by some bacteria, epithelia and other cells. The slime on the outside of a fish is considered a glycocalyx. External to the plasma membrane, all animal cells have a fuzzy coat called the glycocalyx. This coat consists of the carbohydrate moieties of membrane glycolipids and glycoproteins. Only identical twins have chemically identical glycocalices; everyone else is unique."}, {"url": "https://en.wikipedia.org/wiki/Glycocalyx", "passage_text": "Included in the glycocalyx are cell-adhesion molecules that enable cells to adhere to each other and guide the movement of cells during embryonic development. The glycocalyx plays a major role in regulation of endothelial vascular tissue, including the modulation of red blood cell volume in capillaries. The glycocalyx exists in bacteria as either a capsule or a slime layer. 6 points at the glycocalyx. The difference between a capsule and a slime layer is that in a capsule polysaccharides are firmly attached to the cell wall, while in a slime layer the glycoproteins are loosely attached to the cell wall."}]