[{"url": "https://www.sciencebasedmedicine.org/garcinia-probably-works-but-is-far-from-a-weight-loss-miracle/", "passage_text": "Garcinia cambogia extract (GCE) comes from a tropical fruit from India and Southeast Asia. The active ingredient, hydroxycitric acid (HCA), is said to block fat and suppress the appetite. Dr. Oz has promoted a series of weight loss supplements on his show. Garcinia cambogia extract (GCE) comes from a tropical fruit grown in India and Southeast Asia. The active ingredient has been identified: hydroxycitric acid (HCA). It is said to block fat and suppress the appetite. It inhibits a key enzyme, citrate lyase, that the body needs to make fat from carbohydrates."}, {"url": "http://davesgarden.com/guides/articles/view/4166/", "passage_text": "These slow growing, tropical, glossy-leaved trees prefer hot, moist growing conditions. Garcinia Health Claims Garcinia fruits contain Hydroxycitric acid (HCA), a derivative of citric acid found in many weight loss supplements bearing claims to burn fat quickly and reduce appetite. Garcinia cambogia is said to aide in weight loss by decreasing appetite and therefore food intake, while boosting serotonin levels. Some say that eating Garcinia fruit can block fat and may benefit in reducing cholesterol, low-density lipoproteins (LDL) and triglycerides."}, {"url": "https://en.wikipedia.org/wiki/Garcinia_gummi-gutta", "passage_text": "Garcinia gummi-gutta is a tropical species of Garcinia native to Indonesia. Common names include garcinia cambogia (a former scientific name), as well as brindleberry, Malabar tamarind, and kudam puli (pot tamarind). This fruit looks like a small pumpkin and is green to pale yellow in color. "}, {"url": "http://www.wellbella.com/features/garcinia-cambogia-the-tropical-fruit-fat-burner/", "passage_text": "What is it: Garcinia Cambogia is a small pumpkin-shaped sour fruit. Active ingredient: HCA (hydroxycitric acid) is what makes the fruit effective for weight loss; it’s a cousin to the citric acid found in oranges. Dosage: 2,400 mg of HCA daily. "}, {"url": "http://garciniacambogiasideeffects.com/", "passage_text": "Garcinia Cambogia is a small tropical tree fruit that also goes by the name of Malabar tamarind. The Fruit is shaped like a pumpkin. "}, {"url": "http://www.webmd.com/vitamins-supplements/ingredientmono-818-GARCINIA.aspx?activeIngredientId=818&activeIngredientName=GARCINIA", "passage_text": "1 Weight loss. 2  The effect of garcinia on weight loss is not clear. 3  Some research shows that taking garcinia fruit rind extract doesn't seem to decrease fat breakdown or energy expenditure in overweight people. 4  However, other research suggests that it might improve weight loss. 5  Treating worms and parasites. 1 The effect of garcinia on weight loss is not clear. 2  Some research shows that taking garcinia fruit rind extract doesn't seem to decrease fat breakdown or energy expenditure in overweight people. 3  However, other research suggests that it might improve weight loss. 4  Treating worms and parasites. 5  Emptying the bowel."}, {"url": "http://www.bodybuilding.com/fun/fat-loss-hope-or-hype-the-truth-about-garcinia-gambogia.html", "passage_text": "Website: jonnybowden.com. Garcinia cambogia, also known as the Malabar tamarind, is a small, sweet tropical tree fruit shaped like a pumpkin. In the late 1960s, scientists discovered an acid in the fruit somewhat similar to the citric acid found in fruits like oranges and lemons. "}, {"url": "https://en.wikipedia.org/wiki/Garcinia", "passage_text": "Garcinia is a plant genus of the family Clusiaceae native to Asia, Australia, tropical and southern Africa, and Polynesia. The number of species is highly disputed, with various sources recognizing between 50 and about 300. Most species in Garcinia are known for their gum resin, brownish-yellow from xanthonoids such as mangostin, and used as purgative or cathartic, but most frequently – at least in former times – as a pigment. The colour term gamboge refers to this pigment."}, {"url": "http://www.webmd.com/vitamins-and-supplements/garcinia-cambogia-weight-loss", "passage_text": "Garcinia cambogia, a tropical fruit also known as the Malabar tamarind, is a popular weight-loss supplement. People say it blocks your body's ability to make fat and it puts the brakes on your appetite. It could help keep blood sugar and cholesterol levels in check, too. Garcinia cambogia may make it easier for your body to use glucose, the sugar your cells need for energy. Mice that got garcinia cambogia in one study had lower insulin levels than mice that didn't. That's another reason, besides weight loss, that people with diabetes are interested in it."}]