[{"url": "http://www.indeed.com/salary/q-Computer-Technician-l-Dallas,-TX.html", "passage_text": "Average Computer Technician salaries for job postings in Dallas, TX are 2% higher than average Computer Technician salaries for job postings nationwide. "}, {"url": "http://work.chron.com/average-salary-computer-repair-technician-9314.html", "passage_text": "National Salary Information. Computer and office machine repairmen reported an average hourly wage of $18.44 and an average salary of $38,360 per year to the Bureau of Labor Statistics, or BLS, as of May 2011. The median-earning 50 percent of computer and office machine repair technicians reported annual incomes ranging from $28,030 to $46,520, while the highest-paid 10 percent made $57,790 or more annually."}, {"url": "http://www.indeed.com/salary/q-PC-Technician-l-Dallas,-TX.html", "passage_text": "Average PC Technician salaries for job postings in Dallas, TX are 2% higher than average PC Technician salaries for job postings nationwide. "}, {"url": "http://work.chron.com/average-salary-computer-repair-technician-9314.html", "passage_text": "Across the United States, computer repair technicians working in the Northeast reported the highest average salaries. Technicians in Connecticut ranked first by state with an average salary of $47,350, while both Massachusetts and Minnesota reported average salaries of just over $44,000 per year. The median-earning 50 percent of computer and office machine repair technicians reported annual incomes ranging from $28,030 to $46,520, while the highest-paid 10 percent made $57,790 or more annually."}, {"url": "http://www.salarylist.com/city/Dallas-TX-Salary.htm", "passage_text": "Dallas, TX Salary. Dallas, TX average salary is $63,110, median salary is $57,194 with a salary range from $18,880 to $1,320,144. Dallas, TX salaries are collected from government agencies and companies. Each salary is associated with a real job position. Dallas, TX salary statistics is not exclusive and is for reference only. "}, {"url": "http://www1.salary.com/TX/Dallas/Pharmacy-Technician-I-salary.html", "passage_text": "The salary for someone with the job title Pharmacy Technician I in Dallas, TX varies depending on a number of factors. This chart describes the expected percentage of people who perform the job of Pharmacy Technician I in Dallas, TX that make less than that salary."}, {"url": "http://bizbeatblog.dallasnews.com/2013/01/tech-salaries-rose-in-dallas-fort-worth-and-nationally-in-2012.html/", "passage_text": "Salaries for Dallas-Fort Worth area technology professionals rose 2 percent to an average of $86,136 in 2012 from 2011, according to the annual Dice Salary Survey released today. – Entry-level techies – those with two years or less of experience — earned their first annual wage increase in three years, up 8 percent to an average of $46,315. – The average salary for someone with at least 15 years of experience topped six-figures for the first time, up 4 percent from 2011."}, {"url": "http://www.salarylist.com/jobs/Dallas-TX/Computer-Technician-Salary.htm", "passage_text": "Computer Technician Dallas, TX Salary. Computer Technician Dallas, TX average salary is $63,110, median salary is $57,194 with a salary range from $18,880 to $1,320,144. Computer Technician Dallas, TX salaries are collected from government agencies and companies. Each salary is associated with a real job position. Computer Technician Dallas, TX salary statistics is not exclusive and is for reference only. They are presented as is and updated regularly."}, {"url": "http://www.simplyhired.com/salaries-k-sterile-processing-technician-l-dallas-tx-jobs.html", "passage_text": "Average Sterile Processing Technician Salaries. The average salary for sterile processing technician jobs in Dallas, TX is $39,000. Average sterile processing technician salaries can vary greatly due to company, location, industry, experience and benefits. The average salary for sterile processing technician jobs in Dallas, TX is $39,000"}]