[{"url": "http://www.just-health.net/How-Long-Does-Salmon-Last-In-The-Fridge.html", "passage_text": "1. Salmon can be kept fresh in your refrigerator for up to two days. As soon as you bring your salmon home, unwrap it and wipe it down with a damp towel then wrap it in plastic wrap and place it in the coldest area of your refrigerator. This is typically the back of the bottom drawer in the"}, {"url": "http://www.ehow.com/facts_5459637_long-smoked-salmon-last.html", "passage_text": "Refrigeration. Hot-smoked salmon has a slightly higher longevity than cold-smoked salmon. You can safely store it in the refrigerator for one to two weeks. With cold-smoked salmon, you should use it within three days."}, {"url": "http://www.just-health.net/How-Long-Does-Salmon-Last-In-The-Fridge.html", "passage_text": "In the Refrigerator. Salmon can be kept fresh in your refrigerator for up to two days. As soon as you bring your salmon home, unwrap it and wipe it down with a damp towel then wrap it in plastic wrap and place it in the coldest area of your refrigerator. This is typically the back of the bottom drawer in the"}, {"url": "http://www.ehow.com/facts_5459637_long-smoked-salmon-last.html", "passage_text": "Hot-smoked salmon has a slightly higher longevity than cold-smoked salmon. You can safely store it in the refrigerator for one to two weeks."}, {"url": "http://www.answers.com/Q/How_long_can_you_keep_smoked_salmon_in_fridge", "passage_text": "How long can you keep cooked salmon in the fridge? Cooked salmon can be kept in the refrigerator in a covered dish for  up to 4 days. Uncooked salmon should only be kept in the fridge for  2 to 3 days before cooking. Edit."}, {"url": "http://www.just-health.net/How-Long-Does-Salmon-Last-In-The-Fridge.html", "passage_text": "2. Salmon can be kept fresh in your freezer for up to eight weeks. When you bring home your fresh salmon take it out of the packaging, rinse it off using cold water and pat it dry. Cut your salmon into the desired portions and store it in freezer wrap, foil, freezer bags or an airtight freezer friendly container."}]