[{"url": "https://investor.vanguard.com/ira/roth-ira", "passage_text": "A Roth IRA is an individual retirement account that offers tax-free growth and tax-free withdrawals in retirement. Roth IRA rules dictate that as long as you've owned your account for 5 years* and you're age 59½ or older, you can withdraw your money when you want to and you won't owe any federal taxes. "}, {"url": "http://www.schwab.com/public/schwab/investing/retirement_and_planning/understanding_iras/roth_ira/withdrawal_rules", "passage_text": "However, you may have to pay taxes and penalties on earnings in your Roth IRA. Withdrawals from a Roth IRA you've had less than five years. If you take a distribution of Roth IRA earnings before you reach age 59½ and before the account is five years old, the earnings may be subject to taxes and penalties. Age 70½ and over. Withdrawals from a Roth IRA you've had less than five years. If you haven’t met the five-year holding requirement, your earnings will be subject to taxes but not penalties. Withdrawals from a Roth IRA you've had more"}, {"url": "http://www.fool.com/money/allaboutiras/allaboutiras07.htm", "passage_text": "Penalties on Earnings from Contributions. Unless an exception applies, most distributions from a Roth IRA before the owner reaches age 59 1/2 will be subject to an early withdrawal penalty of 10% on the amount of the distribution. Penalties on Conversions From a Traditional IRA to a Roth IRA. The penalty rules regarding conversions are a bit different than those for annual contributions, which may be taken at any time for any purpose free of income taxes and penalty."}, {"url": "https://www.irs.gov/retirement-plans/roth-iras", "passage_text": "A Roth IRA is an IRA that, except as explained below, is subject to the rules that apply to a traditional IRA. You cannot deduct contributions to a Roth IRA. If you satisfy the requirements, qualified distributions are tax-free. You can make contributions to your Roth IRA after you reach age 70 ½. You can leave amounts in your Roth IRA as long as you live. The account or annuity must be designated as a Roth IRA when it is set up."}, {"url": "http://cashmoneylife.com/roth-ira-withdrawal-rules/", "passage_text": "In most cases, withdrawals made after age 59½ will be qualified distributions, provided they meet the 5 year rule for investment gains. According to IRS Publication 590 : A qualified distribution is any payment or distribution from your Roth IRA that meets the following requirements. First home purchase withdrawal from Roth IRA. Early Roth IRA withdrawals for the purchase of a first home are allowed up to a $10,000 life time maximum per account. Withdrawals can be made for the purchase of your first home, or the benefit can be used for your children or grandchildren."}, {"url": "http://www.kiplinger.com/article/retirement/T046-C001-S001-roth-ira-withdrawal-rules.html", "passage_text": "SEE ALSO: The Basics of Roth IRAs. The tax and penalty situation is based on order-of-withdrawal rules. When you withdraw money from a Roth IRA, your contributions are counted first, then the conversions, and finally, the earnings. "}, {"url": "http://cashmoneylife.com/roth-ira-withdrawal-rules/", "passage_text": "Roth IRA 5 year rule. Withdrawals from your Roth IRA will only be classified as qualified distributions if it has been at least 5 years since you first opened and contributed to your Roth IRA, regardless of your age when you opened it. First home purchase withdrawal from Roth IRA. Early Roth IRA withdrawals for the purchase of a first home are allowed up to a $10,000 life time maximum per account. Withdrawals can be made for the purchase of your first home, or the benefit can be used for your children or grandchildren."}, {"url": "http://www.rothira.com/roth-ira-withdrawal-rules", "passage_text": "A qualified distribution from a Roth IRA is tax-free and penalty-free, provided that the five-year aging requirement has been satisfied and one of the following conditions is met: 1  Over age 59½. 2  Death or disability. 3  Qualified first-time home purchase. Quick Summary: 1  If you are over 59½, you may withdraw as much as you want so long as your Roth IRA has been open for at least 5 years. 2  If you are under 59½, you may withdraw the exact amount of your Roth IRA contributions with no penalties."}, {"url": "http://www.obliviousinvestor.com/roth-ira-withdrawal-rules/", "passage_text": "Example: During 2011, you contribute $5,000 to a Roth IRA. You also convert $20,000 from a traditional IRA into your Roth IRA. Of that $20,000, $13,000 was taxable upon the conversion, and $7,000 was not because it came from nondeductible IRA contributions. 5-Year Rule. Any earnings distribution prior to the first day of the fifth year after your first Roth was established will be taxed as ordinary income, at whatever your tax rate is at the time. Example: You open a Roth IRA on May 18, 2009. The 5-Year Rule will be satisfied as of January 1, 2014."}, {"url": "http://www.bankrate.com/finance/taxes/when-its-ok-to-tap-your-ira.aspx", "passage_text": "This means you can take out your retirement money without penalty, and because Roth earnings are tax-free, you'll have no IRS bill, either. If, however, you opened your Roth IRA less than five years ago, the withdrawal is an early distribution. As with a traditional IRA early withdrawal, a Roth holder can use the first-home exception to avoid the 10 percent penalty but might owe tax on earnings that are withdrawn. "}]