[{"url": "https://en.wikipedia.org/wiki/Taste", "passage_text": "Taste, gustatory perception, or gustation is the sensory impression of food or other substances on the tongue and is one of the five traditional senses. Taste is the sensation produced when a substance in the mouth reacts chemically with taste receptor cells located on taste buds. Each taste bud contains 50 to 100 taste receptor cells. The sensation of taste can be categorized into five basic tastes: sweetness, sourness, saltiness, bitterness, and umami. Taste buds are able to differentiate among different tastes through detecting interaction with different molecules or ions."}, {"url": "http://faculty.washington.edu/chudler/tasty.html", "passage_text": "The Taste Bud Image from Biodidac There are two cranial nerves that innervate the tongue and are used for taste: the facial nerve (cranial nerve VII) and the glossopharyngeal nerve (cranial nerve IX). The cranial nerves carry taste information into the brain to a part of the brain stem called the nucleus of the solitary tract. From the nucleus of the solitary tract, taste information goes to the thalamus and then to the cerebral cortex."}, {"url": "https://ca.answers.yahoo.com/question/index?qid=20070416175656AA6Ihv1", "passage_text": "The facial nerve innervates the anterior (front) two-thirds of the tongue and the glossopharyngeal nerve innervates that posterior (back) one-third part of the tongue. Another cranial nerve (the vagus nerve, X) carries taste information from the back part of the mouth. Source(s): Beckers · 9 years ago. Answers. Best Answer: There are five primary tastants: sweet, sour, salt, bitter, and umami, which is the taste of the amino acid glutamate, a major ingredient of monosodium glutamate (MSG)."}, {"url": "http://www.answers.com/Q/What_is_the_five_primary_taste_qualities_and_the_cranial_nerves_that_serve_the_sense_of_Taste", "passage_text": "There are two cranial nerves that are involved with your sense of taste. Facial nerve (CN VII), more specifically chorda tympani branch is responsible for the anterior 2/3 of … your tongue. Glossopharyngeal nerve (CN IX) is responsible for the posterior 1/3 of your tongue. Olfactory nerve (CN I) is responsible for your sense of smell."}, {"url": "https://au.answers.yahoo.com/question/index?qid=20060909232925AAJ2h9w", "passage_text": "If you are wanting to know which cranial nerve is responsible for each of the five senses, here it is: vision-optic smell-olfactory taste-glossopharyngeal and facial hearing-vestibulocohlear touch-not really represented by one CN, but certain ones are sensory for the face, like trigeminal. Amanda · 9 years ago. "}, {"url": "https://answers.yahoo.com/question/index?qid=20070516181333AAin384", "passage_text": "The Facial Nerve carries information from the front 2/3 of the tongue. (Cranial Nerve VII) The Glossopharyngeal Nerve carries information from the back 1/3 of the tongure (Cranial Nerve IX) The Vagus Nerve also carries some taste information, but it's a minor component (Cranial Nerve X)."}, {"url": "http://www.answers.com/Q/What_cranial_nerves_are_taste_buds_monitored_by", "passage_text": "There are two cranial nerves that are involved with your sense of taste. Facial nerve (CN VII), more specifically chorda tympani branch is responsible for the anterior 2/3 of … your tongue. "}, {"url": "https://ca.answers.yahoo.com/question/index?qid=20070416175656AA6Ihv1", "passage_text": "There are two cranial nerves that innervate the tongue and are used for taste: the facial nerve (cranial nerve VII) and the glossopharyngeal nerve (cranial nerve IX). Answers. Best Answer: There are five primary tastants: sweet, sour, salt, bitter, and umami, which is the taste of the amino acid glutamate, a major ingredient of monosodium glutamate (MSG)."}, {"url": "https://en.wikipedia.org/wiki/Cranial_nerve", "passage_text": "Cranial nerves are the nerves that emerge directly from the brain (including the brainstem), in contrast to spinal nerves (which emerge from segments of the spinal cord). Cranial nerves exchange information between the brain and parts of the body, primarily to and from regions of the head and neck. "}, {"url": "https://answers.yahoo.com/question/index?qid=20070415201101AAbSCyl", "passage_text": "Best Answer: The 4 basic tastes are sweet, salt, bitter, sour. As far as the cranial nerves go here they are: Cranial nerve (cn) 7 or the facial nerve is for taste on the anterior 2/3 of the tongue. the posterior 1/3 is mainly cn-9. Cn-10 is for taste of the palate. Source(s): mr.answerman · 9 years ago."}]