[{"url": "http://www.howmuchisit.org/how-much-does-a-headstone-cost/", "passage_text": "1 For example, a headstone designed like a heart will cost $1,500 to $4,500 more than a square shaped headstone. 2  Headstones designed as a bench can cost anywhere from $1,000 to $2,900. 3  A bench headstone will have the name either engraved into the seat or the back of the bench."}, {"url": "http://www.ehow.com/about_6454210_cost-tombstones.html", "passage_text": "The average cost of a funeral in the United States is between $6,000 and $9,000, as of April 2010. The cost of a tombstone (also called a gravestone, headstone, or grave marker) is just one of the considerations to be made when planning for the services of a deceased loved one."}, {"url": "http://www.howmuchisit.org/gravestone-engraving-cost/", "passage_text": "1 For example, a 25-word engraving job on a granite tombstone could cost $200 to $350 while a larger job that has inscriptions on both the front and back could cost upwards of $1,000. 2  If you wanted something simple such as, “In Loving Memory Of…,” this could cost around $350."}, {"url": "http://www.ehow.com/about_6454210_cost-tombstones.html", "passage_text": "Cost of Tombstones. The average cost of a funeral in the United States is between $6,000 and $9,000, as of April 2010...."}, {"url": "http://www.iscga.org/how-much-does-a-gravestone-cost.html", "passage_text": "For instance, you can find most flat grave markers around $1,000 or less. An upright headstone, on the other hand, shall cost up to $10,000. Nonetheless, you can get simple upright tombstones in the range of $1.000 to $3,000. Thus, the average cost of a gravestone is $1,500 to $2,000. However, companion headstones are priced higher than the ones made for individuals. Nowadays, people mostly choose granite and bronze headstones."}, {"url": "http://personalfinance.costhelper.com/gravesite.html", "passage_text": "1 In addition to the cost of the burial plot, it can run $250-$600 for a simple flat granite grave marker or $1,000-$3,000 and up for an upright monument. 2  See How Much Do Headstones Cost. 3  Many private cemeteries require a grave liner or burial vault to protect the casket underground, with costs starting at $400-$5,000."}]