[{"url": "http://www.learner.org/courses/amerhistory/units/8/", "passage_text": "Antebellum Reform. As a response to increasing social ills, the nineteenth century generated reform movements: temperance, abolition, school and prison reform, as well as others. "}, {"url": "http://apcentral.collegeboard.com/apc/members/repository/us-history-sf-antebellum-reform.pdf", "passage_text": "18 Special Focus: Antebellum Reform Sarah and Angelina Grimke, “Letters to Catherine E. Beecher” (1837)www.pinn.net/~sunshine/whm2000/grimke4.html Assessments 1. Have class as individuals or as a group design a WebSearch/WebQuest activity about the history of the women’s rights movement, 1848–1919. Such an exercise allows students to see a multiplicity of perspectives and begin to imagine how these debates played themselves out in the period under question.Reform is one of the 12 themes in the AP U.S. History Course Description and as such is an important element of the course."}, {"url": "http://teachinghistory.org/history-content/beyond-the-textbook/24124", "passage_text": "Women's Reform Movement. A common story runs through textbook accounts of antebellum women reformers. It is a tale of origins and future progress, of new roles for women and the beginning of a movement for gender equality stretching to the present day. This is a compact, readable, and reliable survey of the role of women in antebellum reform, and one that pays attention to class and religious differences among them. The treatment of Seneca Falls and the Women's Rights Movement is brief, but rich."}, {"url": "http://www.megaessays.com/viewpaper/24471.html", "passage_text": "The Antebellum era or the Pre-Civil War period was known for many reform movements. The society at the time was experiencing a major change. Many movements such as the Transcendentalism and the Second Great Awakening inspired many intellectuals. These people are given the knowledge and the courage to fight for many things in society that were unfortunately looked down on in the past."}, {"url": "http://memory.loc.gov/ammem/aaohtml/exhibit/aopart2.html", "passage_text": "Free Blacks in the Antebellum Period. Free blacks in the antebellum period--those years from the formation of the Union until the Civil War--were quite outspoken about the injustice of slavery. Their ability to express themselves, however, was determined by whether they lived in the North or the South. "}, {"url": "http://www.sparknotes.com/history/american/precivilwar/section9.rhtml", "passage_text": "The Rise of Social Reform. The revivalism that spread across the country during the antebellum era also gave rise to numerous social reform movements, which challenged Americans to improve themselves and their communities. Because revivalism and reform went hand in hand, many prominent reformers were women"}, {"url": "http://www.shmoop.com/antebellum/", "passage_text": "In A Nutshell. Our historical understanding of antebellum America is heavily colored by our knowledge of the disaster that brought that era of American history to a close: the Civil War. But the people who lived through the antebellum period had no way of knowing that historians would later define their era by the war that ended it. (Antebellum is Latin for pre-war.) Antebellum Americans did, however, understand and appreciate the seriousness of the increasing sectional conflict dividing the country between the slave-labor, agricultural South and the free labor, industrializing North."}, {"url": "http://antebellumperiodreformmovements.weebly.com/", "passage_text": "The period before the Civil War is known as the Antebellum period. In this time period, many reform groups were established to improve and perfect life in America. Because a large majority of the social reform took place in the North, the country was split, and the South believed that the social reforms were a northern conspiracy against the South."}, {"url": "http://www.historynet.com/antebellum-period", "passage_text": "Antebellum Period summary: The Antebellum Period in American history is generally considered to be the period before the civil war and after the War of 1812, although some historians expand it to all the years from the adoption of the Constitution in 1789 to the beginning of the Civil War. Because of the Second Awakening, some began to see slavery as a sin, with emancipation as the only way to atone for this sin. The Quakers, who believed that all people were equal in the eyes of God, had been speaking out against slavery since the 1600s, forming the first abolitionist group in the 1790s."}]