[{"url": "http://whatscookingamerica.net/Eggs/BoiledEggs.htm", "passage_text": "As soon as the water reaches a rapid boil, remove pan from heat and cover egg pan tightly with a lid. Set timer for 17 minutes for large eggs or 20 minutes for jumbo eggs. After 17 or 20 minutes (depending on size of your eggs), remove lid and drain off water from the eggs. An egg that is at room temperature at the start of the cooking process will require about 1 minute less cooking time than eggs taken directly from the refrigerator. 4. Technique for hard-cooking (boiled) eggs: Choose the right size pot to cook your eggs in: The eggs must not be stacked but be in one (1) layer only."}, {"url": "https://answers.yahoo.com/question/index?qid=20081024081327AAu9sWF", "passage_text": "HOW TO BOIL EGGS Bring eggs to room temperature before using. If the egg has been stored in the refrigerator it can be warmed gently under a flowing hot tap. Place sufficient water to cover the eggs in a saucepan and bring to a gentle boil. Lower the eggs carefully into the water, using a tablespoon. You should start timing the eggs from the moment the water first boils. Soft-boiled (soft whites, soft yolks): Large size: 3 minutes 20 seconds. Medium size: 3 minutes. Small size: 2 minutes 40 seconds."}, {"url": "http://www.thekitchn.com/how-to-boil-eggs-perfectly-every-time-cooking-lessons-from-the-kitchn-202415", "passage_text": "Instructions. 1  Put the eggs in a pan of cold water: Place 6 cold eggs in a saucepan and fill with cold water, covering the eggs by an inch. 2  Bring the water to a rolling boil: Set the pan over high heat and bring the water to a boil, uncovered. 3  The water should come to a full, rolling boil. As soon as the water comes to a boil, remove the pan from heat and cover the pan. Don't forget about the pan on the stove and let the eggs boil for too long or they will over cook! Set your timer for the desired time: Leave the eggs in the covered pan for the right amount of time."}, {"url": "http://www.foodnetwork.com/recipes/food-network-kitchens/deviled-eggs-recipe.html", "passage_text": "Place your eggs in a pot and cover with cold water by 1 inch. Bring to a boil over medium-high heat, then cover, remove from the heat and set aside 8 to 10 minutes. Drain, cool in ice water and peel. How to Make Deviled Eggs: Transfer hard-boiled eggs to a bowl of ice water with a slotted spoon and let cool. "}, {"url": "http://www.simplyrecipes.com/recipes/how_to_make_perfect_hard_boiled_eggs/", "passage_text": "Depending on how cooked you like your hard boiled eggs, the eggs should be done perfectly in 10-12 minutes. That said, depending on your altitude, the shape of the pan, the size of the eggs, the ratio of water to eggs, it can take a few minutes more. Older eggs are easier to peel than fresh eggs. If you are planning to make hard boiled eggs for Easter and want to make sure that the eggs are easy to peel, buy your eggs at least a week ahead of time (two weeks even better, they'll keep)."}, {"url": "http://www.thekitchn.com/how-to-boil-eggs-perfectly-every-time-cooking-lessons-from-the-kitchn-202415", "passage_text": "1 Put the eggs in a pan of cold water: Place 6 cold eggs in a saucepan and fill with cold water, covering the eggs by an inch. 2  Bring the water to a rolling boil: Set the pan over high heat and bring the water to a boil, uncovered. 3  The water should come to a full, rolling boil. 4  Turn off the heat and cover the pan. As soon as the water comes to a boil, remove the pan from heat and cover the pan. Don't forget about the pan on the stove and let the eggs boil for too long or they will over cook! Set your timer for the desired time: Leave the eggs in the covered pan for the right amount of time."}, {"url": "http://eggtutor.com/how-to-hard-boil-eggs/", "passage_text": "Put eggs into a pan of cold water and bring the eggs to a boil. Cover the pan with a lid and remove the pan from the heat. Let the pan stand for 25 minutes. Rinse the eggs under cold water. "}, {"url": "http://www.bbc.co.uk/food/techniques/how_to_boil_eggs", "passage_text": "Allow three and a half minutes for a medium-sized egg and four minutes for a large egg. The yolk will be runny and the white just set. Cook for a further minute if you like your soft boiled eggs a little firmer. For a hard-boiled egg, start the egg in cold water and bring up to the boil. Once the water is gently boiling, set the timer for between 7-10 minutes depending on how well cooked you like your eggs. The longer you boil the egg, the firmer it will be. Once cooked, plunge the hard-boiled egg into plenty of cold water for one minute."}, {"url": "https://answers.yahoo.com/question/index?qid=20081024081327AAu9sWF", "passage_text": "Immerse the eggs in water and add a pinch of salt. This salt is to prevent the shell from breaking when it is boiling. After 10-11 min switch off the stove or whatever you are using to boil. Allow the eggs to stay in that hot water for the next 10 min and then start peeling the shell off. You should start timing the eggs from the moment the water first boils. Soft-boiled (soft whites, soft yolks): Large size: 3 minutes 20 seconds. Medium size: 3 minutes. Small size: 2 minutes 40 seconds."}, {"url": "http://www.simplyrecipes.com/recipes/how_to_make_perfect_hard_boiled_eggs/", "passage_text": "If you need easy-to-peel eggs and you have fresh eggs, you might want to try steaming the eggs for 15 minutes. Pour an inch of water into a pot and insert a steamer basket.Bring to a boil. Place the eggs in the steamer basket, cover and steam for 15 minutes (more or less, check!). Older eggs are easier to peel than fresh eggs. If you are planning to make hard boiled eggs for Easter and want to make sure that the eggs are easy to peel, buy your eggs at least a week ahead of time (two weeks even better, they'll keep)."}]