[{"url": "http://learn.org/articles/What_is_the_Average_Salary_for_a_Phlebotomy_Technician.html", "passage_text": "If you work as a phlebotomist, you may also transport and store specimens in addition to writing medical reports. According to the American Society for Clinical Pathology (ASCP), the average annual salary for staff-level phlebotomists was $32,448 in 2013 (www.ascp.org). The ASCP also indicates that phlebotomy technicians tend to be some of the lowest paid among all medical and clinical technicians. For example, the ASCP states that histotechnicians made a higher average annual salary of $49,837 in 2013. The average for all phlebotomy technicians at the staff level was $15.60 per hour. According to the U.S. Bureau of Labor Statistics (BLS), five states in May 2012 with the highest phlebotomist employment levels included California, Texas, Florida, Pennsylvania and Ohio."}, {"url": "http://phlebotomyscout.com/phlebotomist-salary/", "passage_text": "As you can see from a graph below, salary for phlebotomists with less than 1 year of experience is only $2,000 – $2,300 lower than for those who practice phlebotomy for 4-10 years. The difference only starts to be notable compared to 10+ years of experience. The most popular certification in the phlebotomy field is ASCP Certified Phlebotomy Technician (PBT). Also, American Medical Technologists (AMT) Certified Phlebotomists seem to get a good starting salary of $27,514."}, {"url": "http://money.usnews.com/careers/best-jobs/phlebotomist/salary", "passage_text": "Salary Outlook. Phlebotomists made a median salary of $30,150 in 2013, according to the BLS. The highest-paid 10 percent in the profession earned $43,190, while the lowest-paid earned $21,760 that year. $30,910. With an average annual salary of $31,410 in 2013, phlebotomists made less than dental assistants, who had an average annual salary of $35,640, and clinical laboratory techs, who brought home an average salary of $40,240. Medical assistants earned a similar salary as phlebotomists, pulling in $30,780 in 2013"}, {"url": "http://www.payscale.com/research/US/Job=Phlebotomy_Technician/Hourly_Rate", "passage_text": "Phlebotomy Technician Salary. (United States). Average Phlebotomy Technicians in the United States make around $12.86 per hour. The bottom of the pay range sits near $9.66 per hour, and the top verges on $17.61. Career duration is the biggest factor affecting pay for this group, followed by the specific employer and geographic location"}, {"url": "http://www.indeed.com/q-Lab-Technician-Phlebotomist-jobs.html", "passage_text": "Screens lab reports for  action limit values; Formal phlebotomy training or certification OR experience performing the duties of a phlebotomist.... State of Oregon - 7 days ago-save job-email-more... 1  View all Salem, OR jobs. 2  Salary Search: Laboratory Technician salaries in Salem, OR. "}, {"url": "http://learn.org/articles/What_is_the_Average_Salary_for_a_Phlebotomy_Technician.html", "passage_text": "However, if you were employed in a physician's office laboratory, you could earn significantly more at $24.78 per hour. Nonprofit institutions paid an hourly wage of $14.55, while those working for private industries made $19.61 per hour. The average for all phlebotomy technicians at the staff level was $15.60 per hour. According to the U.S. Bureau of Labor Statistics (BLS), five states in May 2012 with the highest phlebotomist employment levels included California, Texas, Florida, Pennsylvania and Ohio."}, {"url": "http://study.com/articles/Certified_Phlebotomy_Technician_Job_Info_and_Requirements_for_a_Career_as_a_Certified_Phlebotomy_Technician.html", "passage_text": "Career and Economic Outlook. According to the BLS, career opportunities for medical and clinical laboratory technicians, including phlebotomy technicians, are expected to increase by 30% between 2012 and 2022. The BLS reported a mean annual wage of $30,910 for phlebotomists working in May 2012. Unlike phlebotomists, biological technicians typically need a bachelor's degree, but their average pay is also higher, according to the BLS. In May 2012, the BLS reported that the average wage for biological technicians was $42,600. The BLS projects a 10% increase in biological technician jobs from 2012 to 2022."}, {"url": "http://www.bls.gov/ooh/Healthcare/Medical-and-clinical-laboratory-technologists-and-technicians.htm", "passage_text": "11%. Employment of medical laboratory technologists is projected to grow 14 percent from 2012 to 2022, about as fast as the average for all occupations. Employment of medical laboratory technicians is projected to grow 30 percent from 2012 to 2022, much faster than the average for all occupations. "}, {"url": "http://www.payscale.com/research/US/Job=Phlebotomy_Technician/Hourly_Rate", "passage_text": "Survey participants with less than five years' experience pocket $26K on average, but those with five to 10 years of experience enjoy a much bigger median of $31K. For Phlebotomy Technicians, 10 to 20 years of experience on the job amounts to an average salary of $33K. Average Phlebotomy Technicians in the United States make around $12.86 per hour. The bottom of the pay range sits near $9.66 per hour, and the top verges on $17.61."}]