[{"url": "http://www.badassfitness.typepad.com/badass-fitness/2011/04/healthy-snack-or-calorie-and-sugar-trap.html", "passage_text": "This is so good for me! you exclaim as you grab another big handful. Twenty minutes later, your 'snack' has turned into the calorie, sugar and fat equivalent of a generously portioned dessert. Consider the Kirkland's Signature Trail Mix, sold at Costco and Wal-Mart. Yogurt-covered raisins: These aren't unhealthy like french fries are unhealthy. But they are higher in sugar than you might think, and a serving size is so small you are probably eating more like two or three servings. If you're watching calories and sugar, these are not the snack for you."}, {"url": "http://www.powerscandy.com/why-trail-mix/", "passage_text": "It's fast, it's tasty and easy to make -- and yes, trail mix can be good for you, too. You can just grab-and-go with a handful of trail mix. It offers satisfaction to growling tummies and usable energy for your body. Just how healthy your trail mix is depends on the individual ingredients you use. What you may or may not already know is that trail mix is very high-calorie. Another great thing about trail mix is that it keeps your blood sugar levels constant. This helps you to avoid the roller coaster effect.. If you have a carefully measured portion of nuts or trail mix at around 2 pm, you'll avoid that 3 pm crash."}, {"url": "http://www.reviewstream.com/reviews/?p=153304", "passage_text": "1 I feel like these little packs of trail mix are the perfect size. 2  We get the Kirkland Signature Trail Mix from Costco, a store that sells things in bulk, in a fairly large box with multiple snack packs. 3  The trailmix includes peanuts,M&M’s, raisins, almonds and cashews. You actually get very satisfied from eating one pouch, it is not one of those snacks that makes you feel like you still havent eaten anything after you ate it. You feel satisfied once you eat it. I love these little trail mix pouches."}, {"url": "http://www.badassfitness.typepad.com/badass-fitness/2011/04/healthy-snack-or-calorie-and-sugar-trap.html", "passage_text": "Trail mix. Granola. Yogurt-covered raisins. These are the snack words that conjure up feelings of righteousness and self-control. These are the snacks we proudly display to our friends and colleagues because they are so healthy. Yogurt-covered raisins: These aren't unhealthy like french fries are unhealthy. But they are higher in sugar than you might think, and a serving size is so small you are probably eating more like two or three servings. If you're watching calories and sugar, these are not the snack for you."}, {"url": "http://www.reviewstream.com/reviews/?p=153304", "passage_text": "1 It just varies as I go through the pack. 2  I feel like these little packs of trail mix are the perfect size. 3  We get the Kirkland Signature Trail Mix from Costco, a store that sells things in bulk, in a fairly large box with multiple snack packs. You actually get very satisfied from eating one pouch, it is not one of those snacks that makes you feel like you still havent eaten anything after you ate it. You feel satisfied once you eat it. I love these little trail mix pouches."}, {"url": "http://www.livestrong.com/article/397236-how-healthy-is-trail-mix/", "passage_text": "Dried fruit trail mix spilling out of bag. Photo Credit Juanmonino/iStock/Getty Images. It's fast, it's tasty and easy to make -- and yes, trail mix can be good for you, too. You can just grab-and-go with a handful of trail mix. It offers satisfaction to hunger and usable energy for your body. Just how healthy your trail mix is depends on the individual ingredients you use. Other names for trail mix include gorp, which etymology expert Barry Popik says may be an acronym for good old raisins and peanuts.. Whatever you call it, trail mix typically includes nuts, seeds and dried fruit tossed together without cooking or lightly roasted."}, {"url": "http://www.reviewstream.com/reviews/?p=153304", "passage_text": "1 If you like those nuts, this is totally a trail mix for you. 2  I really do like nuts and these are my three favorite kind. 3  That is one of the many reasons I love this trail mix. 4  They have the best tasting almonds. You actually get very satisfied from eating one pouch, it is not one of those snacks that makes you feel like you still havent eaten anything after you ate it. You feel satisfied once you eat it. I love these little trail mix pouches."}, {"url": "http://www.badassfitness.typepad.com/badass-fitness/2011/04/healthy-snack-or-calorie-and-sugar-trap.html", "passage_text": "See, those trail mixes and breakfast granolas certainly have healthy elements-nuts for good fats, antioxidant-rich raisins, whole-grain oats. But they also are often loaded with sugar, fat and calorie-dense dried fruits that you would be better off eating as ripe fruit. Yogurt-covered raisins: These aren't unhealthy like french fries are unhealthy. But they are higher in sugar than you might think, and a serving size is so small you are probably eating more like two or three servings. If you're watching calories and sugar, these are not the snack for you."}, {"url": "http://www.reviewstream.com/reviews/?p=35335", "passage_text": "The water I ... Kirkland Signature Trail Mix. These little snack sized pouch trail mixes are great for when you are on the go or just for a quick snack. I eat these just about everywhere, from sporting events to re-energize, lunchs, to after school snacks, I have these just about anywhere. Everything in the trailmix tastes ... I think the Melba toast in some trail mixes is what really tastes disgusting to me, so I was happy when I saw that the Kirkland Signature doesn’t include that particular item. Kirkland is full of peanuts, so this. isn’t for people who are allergic."}]