[{"url": "http://www.foodnetwork.com/recipes/ina-garten/herb-roasted-lamb-recipe.html", "passage_text": "Place in the bottom of a large roasting pan. Place the lamb on top of the potatoes and roast for 1 1/4 to 1 1/2 hours, or until the internal temperature of the lamb is 135 degrees (rare) or 145 degrees (medium). Remove from the oven and put the lamb on a platter; cover tightly with aluminum foil"}, {"url": "http://www.taste.com.au/recipes/23077/traditional+roast+lamb", "passage_text": "Reduce oven temperature to 180°C/160°C fan-forced. Roast lamb, basting with remaining oil mixture every 20 minutes, for 1 hour 15 minutes for medium or until cooked to your liking. Add potatoes to pan for last 40 minutes, turning halfway through cooking. Preheat oven to 200°C/180°C fan-forced. Lightly grease roasting pan. Place lamb in pan. Combine oil, rosemary and garlic in a bowl. Rub half the oil mixture over lamb. Season with salt and pepper. Roast for 15 minutes."}, {"url": "http://www.foodnetwork.com/recipes/emeril-lagasse/rosemary-and-garlic-roast-leg-of-lamb-recipe.html#!", "passage_text": "Preheat the oven to 400 degrees F. Using your hands, rub the lamb all over with the lemon juice. Pat the garlic and rosemary evenly all over the surface of the meat. Season the meat with the salt and pepper and place the lamb in a roasting pan. Place the lamb in the oven and roast for 30 minutes."}, {"url": "http://whatscookingamerica.net/Lamb/Roast_Boneless-LegLamb.htm", "passage_text": "Sear the lamb roast for 15 minutes at the higher oven temperature (450 degrees F.), then turn the oven to the lower temperature (325 degrees F.) for the rest of the cooking time. Do Not Cover the roast. Insert meat thermometer so tip is in thickest part of lamb (not resting in fat). Cook until the lamb roast reaches an internal temperature of 120 degrees F. Remove from oven, cover with aluminum foil, and let sit approximately 15 to 20 minutes. Remember, the lamb roast will continue to cook as it sets"}, {"url": "http://www.recipetips.com/kitchen-tips/t--896/roasting-lamb.asp", "passage_text": "Roast lamb should be allowed to rest, loosely covered with foil, for 10 to 30 minutes (depending on the cut) after removal from the oven. Cooking will continue during the resting period (the internal temperature will rise at least 5ºF and as much as 10ºF), reaching the desired level of doneness. Typical cooking times (after the roast is seared) are 10 minutes per pound for rare meat, 12 minutes per pound for medium-rare, 15 minutes for medium, 20 minutes for well-done. These are approximate times, for average size, bone-in roasts at room temperature."}, {"url": "http://dish.allrecipes.com/how-to-roast-lamb/", "passage_text": "Roasted to Perfection. Before roasting your lamb, remove it from the refrigerator and allow it to sit for 30 minutes. A piece of meat at room temperature will roast more evenly. Use a roasting rack to ensure even browning and heat circulation around the meat. Roasting is a “dry heat” cooking method, meaning that you do not add any liquid to the meat as you cook it. Dry heat is best for cuts of meat that are naturally tender. 1  Roast Lamb Recipes."}, {"url": "http://dish.allrecipes.com/how-to-roast-lamb/", "passage_text": "1 For a lean piece of meat, cook at 450 degrees F (230 degrees C) for the first 15 minutes, then turn the temperature down to 350 degrees F (175 degrees C) to continue roasting–the meat will take about 25 minutes per pound to reach medium rare. Roasting is a “dry heat” cooking method, meaning that you do not add any liquid to the meat as you cook it. Dry heat is best for cuts of meat that are naturally tender. 1  Roast Lamb Recipes."}, {"url": "http://www.cooks.com/rec/search/0,1-0,lamb_roast_temperature,FF.html", "passage_text": "Make the mint ... aside at room temperature for 2 or ... cut slits in lamb and fill slits ... in roasting tin. Roast for 15 minutes. ... separately with the lamb. 10. ROAST LEG OF BABY SPRING LAMB. To Roast Lamb: Rub leg ... oven. When internal temperature of 90 degrees ... Mix together the ... all over the lamb; cover with ... stand at room temperature for 2 to ... shallow roasting pan. Roast uncovered 10 minutes; ..."}, {"url": "http://www.cooks.com/rec/search/0,1-0,lamb_roast_temperature,FF.html", "passage_text": "Preheat the oven ... sheet pan and roast until it is ... top of the lamb (see tip). Meanwhile, ... stand at room temperature for 30 minutes ... before roasting. Mix together the ... all over the lamb; cover with ... stand at room temperature for 2 to ... shallow roasting pan. Roast uncovered 10 minutes; ..."}]