[{"url": "http://www.itjobswatch.co.uk/jobs/uk/support%20analyst.do", "passage_text": "Included is a guide to the average salaries offered in IT jobs that have cited Support Analyst in their job title over the 3 months to 15 October 2015 with a comparison to the same period in the previous 2 years. The table below looks at the demand and provides a guide to the average salaries quoted in IT jobs citing Support Analyst within the UK over the 3 months to 15 October 2015."}, {"url": "http://www.indeed.com/salary/Technical-Support-Analyst.html", "passage_text": "$82,000. Average Technical Support Analyst salaries for job postings nationwide are 42% higher than average salaries for all job postings nationwide."}, {"url": "http://www.salarylist.com/jobs/Support-Analyst-Salary.htm", "passage_text": "Support Analyst Salary. Support Analyst average salary is $66,009, median salary is $65,000 with a salary range from $21,549 to $176,800. Support Analyst salaries are collected from government agencies and companies. Each salary is associated with a real job position. "}, {"url": "http://www1.salary.com/Technical-Support-Analyst-I-salary.html", "passage_text": "For example the median expected annual pay for a typical Technical Support Analyst I in the United States is $54,898 so 50% of the people who perform the job of Technical Support Analyst I in the United States are expected to make less than $54,898. Source: HR Reported data as of October 2015. Median $54,898. The annual salary for someone with the job title Technical Support Analyst I may vary depending on a number of factors including industry, company size, location, years of experience and level of education."}, {"url": "http://www.itjobswatch.co.uk/jobs/uk/support%20analyst.do", "passage_text": "This chart provides a salary histogram for IT jobs citing Support Analyst over the 3 months to 15 October 2015 within the UK. The table below looks at the demand and provides a guide to the average salaries quoted in IT jobs citing Support Analyst within the UK over the 3 months to 15 October 2015. The 'Rank Change' column provides an indication of the change in demand within each location based on the same 3 month period last year"}, {"url": "http://www.salarylist.com/jobs/It-Support-Analyst-Salary.htm", "passage_text": "Home It, Support Analyst Salary. It, Support Analyst average salary is $68,270, median salary is $69,718 with a salary range from $36,750 to $100,000. It, Support Analyst salaries are collected from government agencies and companies. Each salary is associated with a real job position."}, {"url": "http://www.payscale.com/research/US/Job=Support_Analyst%2c_Information_Technology_(IT)/Salary", "passage_text": "After working for 10 to 20 years, Information Technology Support Analysts make a median salary of $59K. People who have worked for more than 20 years report a median income of $61K, which is barely higher than the median for folks with 10 to 20 years of experience. A support information technology (IT) analyst is responsible for much of the day-to-day technical support and development in a business or corporate setting. These analysts respond to problems and complaints from other departments regarding the quality of their technological systems (such as computers and phones)."}, {"url": "http://www.totaljobs.com/salary-checker/average-support-analyst-salary", "passage_text": "Salary results for Support Analyst. Here you can see the average salary for the job you entered, based on our most recent job adverts. Our salary calculator also lets you view the highest and lowest salaries recently offered for that job, and how your current salary compares. "}, {"url": "http://www.totaljobs.com/salary-checker/average-it-support-analyst-salary", "passage_text": "salary results for it support analyst here you can see the average salary for the job you entered based on our most recent job adverts our salary calculator also lets you view the highest and lowest salaries recently offered for that job and how your current salary compares "}, {"url": "http://www.payscale.com/research/US/Job=Support_Analyst%2c_Information_Technology_(IT)/Salary", "passage_text": "Support Analyst, Information Technology (IT) Salary. (United States). Median pay for Information Technology Support Analysts in the United States lies in the neighborhood of $52K per year. A support information technology (IT) analyst is responsible for much of the day-to-day technical support and development in a business or corporate setting. These analysts respond to problems and complaints from other departments regarding the quality of their technological systems (such as computers and phones)."}]