[{"url": "http://www.bbc.co.uk/schools/gcsebitesize/geography/rock_landscapes/rock_types_rev2.shtml", "passage_text": "Ribblehead, North Yorkshire. 1  One of the largest areas of limestone [limestone: A sedimentary rock consisting mainly of calcium carbonate. 2  It is commonly used as a building stone. ] 3  in the UK is found in the Yorkshire Dales National Park, near Malham and Ingleton. 4  Limestone is a sedimentary rock made of calcium carbonate. 1 It is commonly used as a building stone. ] 2  in the UK is found in the Yorkshire Dales National Park, near Malham and Ingleton. 3"}, {"url": "http://geography.about.com/od/studygeography/a/regionalgeography.htm", "passage_text": "Since the 1980s, regional geography has seen a resurgence as branch of geography in many universities. Because geographers today often study a wide variety of topics, it is helpful to break the world down into regions to make information easier to process and display. Regional geography is a branch of geography that studies the world's regions. A region itself is defined as a part of the Earth's surface with one or many similar characteristics that make it unique from other areas."}, {"url": "http://www.answers.com/Q/What_is_resurgence_in_geography", "passage_text": "For a river to become an underground river in the … first place it must flow over an area of limestone rock. The mildly acidified river water (it is acidified by dissolved carbon dioxide which is present in rainwater) reacts with the limestone (which is 80% calcium carbonate) and dissolves it. This forms a swallow hole into which the river flows. 1 The Journal of Geography The Journal of Geography is a magazine that is published by the National Council for Geographic Education (NCGE). 2  Historically, in the journal are published articles that pre…. 3  Top Famous Geographers Geography science is a separate field of study today, but is hasn't always been the case."}, {"url": "http://www.bbc.co.uk/education/clips/zg7vr82", "passage_text": "A demonstration of the features formed by water drainage in limestone areas, both at the surface and underground. Permeable and impermeable layers of rock in the Malham area give rise to intermittent drainage. We see features formed both at the surface and underground. Surface water passes over impermeable rock until it reaches permeable limestone. The water passes through the limestone and erodes it to form swallow holes. Gaping Gill is a swallow hole where water has eroded a cave to form the highest waterfall in Britain. The water continues to flow underground until the limestone meets impermeable rock at the valley floor. Here there is a resurgence where the water returns to the surface. Shake holes and water sinks are also formed by the flow of surface water"}, {"url": "http://www.bbc.co.uk/schools/gcsebitesize/geography/rock_landscapes/rock_types_rev2.shtml", "passage_text": "1 One of the largest areas of limestone [limestone: A sedimentary rock consisting mainly of calcium carbonate. 2  It is commonly used as a building stone. ] 3  in the UK is found in the Yorkshire Dales National Park, near Malham and Ingleton. 4  Limestone is a sedimentary rock made of calcium carbonate. 1 It is commonly used as a building stone. ] 2  in the UK is found in the Yorkshire Dales National Park, near Malham and Ingleton. 3"}, {"url": "http://geographyfieldtrips.com/listing-type/resurgence/", "passage_text": "Malham Cove. Malham Cove. Malham Cove is an amphitheater shaped cliff formation of limestone rock. Water from Malham Tarn once flowed over the cliff. It is now a popular destination for climbers who dare to scale the 260ft cliff face. There are a range of limestone features here. These include: – a limestone pavement. "}, {"url": "http://www.bbc.co.uk/schools/gcsebitesize/geography/rock_landscapes/rock_types_rev2.shtml", "passage_text": "1 ] in the UK is found in the Yorkshire Dales National Park, near Malham and Ingleton. 2  Limestone is a sedimentary rock made of calcium carbonate. 3  It dissolves slowly in carbonic acid (carbon dioxide and rainwater) creating a range of distinctive landforms. 1 It is commonly used as a building stone. ] 2  in the UK is found in the Yorkshire Dales National Park, near Malham and Ingleton. 3"}, {"url": "http://www.answers.com/Q/What_is_resurgence_in_geography", "passage_text": "Answered by The Community. Making the world better, one answer at a time. Where a spring of a river appears above ground after the river having been flowing flowing underground. Above the spring in Limestone and below is impermeable rock. 1 The Journal of Geography The Journal of Geography is a magazine that is published by the National Council for Geographic Education (NCGE). 2  Historically, in the journal are published articles that pre…. 3  Top Famous Geographers Geography science is a separate field of study today, but is hasn't always been the case."}]