[{"url": "http://www.wisegeek.com/what-is-point-of-presence.htm", "passage_text": "With the advent of the Internet, the point-of-presence came to be identified with switches and routers that allowed users to establish a connection to the World Wide Web."}, {"url": "https://en.wikipedia.org/wiki/Point_of_presence", "passage_text": "A point of presence was a location where a long-distance carrier (IXC) could terminate services and provide connections into a local telephone network (LATA). An Internet point of presence is an access point to the Internet. It is a physical location that houses servers, routers, ATM switches and digital/analog call aggregators."}, {"url": "https://en.wikipedia.org/wiki/Point_of_presence", "passage_text": "A point of presence (PoP) is an artificial demarcation point OR interface point between communicating entities."}, {"url": "http://www.thenetworkencyclopedia.com/entry/point-of-presence-pop/", "passage_text": "Definition of point of presence (POP) in The Network Encyclopedia. point of presence (POP) The local access point for an Internet service provider (ISP). A point of presence (POP) consists of the high-speed telecommunications equipment and technologies that enable users to connect to the Internet via their ISP."}, {"url": "http://www.wisegeek.com/what-is-point-of-presence.htm", "passage_text": "A point-of-presence, often referred to as a POP, is the physical location where two or more types of communication devices establish a connection."}, {"url": "http://www.accesskenya.com/index.php/networks/point-of-presence.html", "passage_text": "Network. AccessKenya's Point of Presence (POP) is located in a data centre of one of the world's largest Internet Carriers (Tier 1) also known as a carrier of carriers in North America."}, {"url": "http://www.accesskenya.com/index.php/networks/point-of-presence.html", "passage_text": "Point of Presence. AccessKenya's Point of Presence (POP) is located in a data centre of one of the world's largest Internet Carriers (Tier 1) also known as a carrier of carriers in North America."}]