[{"url": "http://www.pwc.com/us/en/audit-assurance-services/conflict-minerals.html", "passage_text": "The rule describes the assessment and reporting requirements for issuers whose products contain conflict minerals. These minerals – tin, tantalum, tungsten and gold – are used in a wide range of products across numerous industries."}, {"url": "http://www.raisehopeforcongo.org/content/initiatives/conflict-minerals", "passage_text": "Conflict Minerals in Your Electronics. Profit from the mineral trade is one of the main motives for armed groups on all sides of the conflict in eastern Congo-the deadliest since World War II. Armed groups earn hundreds of millions of dollars per year by trading four main minerals: the ores that produce tin, tantalum, tungsten, and gold."}, {"url": "http://www.intel.com/content/www/us/en/corporate-responsibility/conflict-free-minerals.html", "passage_text": "2. Conflict minerals, as defined by the U.S. Securities and Exchange Commission (SEC), is a broad term that means tin, tantalum, tungsten, and gold, regardless of whether these minerals finance conflict in the Democratic Republic of the Congo (DRC) or adjoining countries."}, {"url": "http://www.sec.gov/News/PressRelease/Detail/PressRelease/1365171484002", "passage_text": "The Securities and Exchange Commission today adopted a rule mandated by the Dodd-Frank Wall Street Reform and Consumer Protection Act to require companies to publicly disclose their use of conflict minerals that originated in the Democratic Republic of the Congo (DRC) or an adjoining country."}, {"url": "http://enoughproject.org/special-topics/progress-and-challenges-conflict-minerals-facts-dodd-frank-1502", "passage_text": "1 The U.N. Group of Experts on Congo found in 2015 that gold continued to be a source of funding for armed groups and Congo’s army. 2  A study from the Enough Project found that armed groups made an estimated $185 million from conflict minerals in 2008."}, {"url": "http://www.enoughproject.org/conflicts/eastern_congo/conflict-minerals", "passage_text": "What Are Conflict Minerals? Tin, tantalum, tungsten (the 3 T's) and gold are mined in eastern Congo and are in all consumer electronics products, as well as products from the jewelry, automotive, aerospace, medical equipment, and many other industries."}, {"url": "http://www.lg.com/global/sustainability/business-partner/conflict-minerals", "passage_text": "Overview of the Conflict Minerals Issue. The Democratic Republic of the Congo (DRC) is a Central African country with vast mineral wealth, including reserves of cassiterite (tin), columbite-tantalite (tantalum), wolframite (tungsten) and gold."}, {"url": "http://www.raisehopeforcongo.org/content/conflict-minerals", "passage_text": "In August 2012, the Securities and Exchange Commission (SEC) issued its Conflict Minerals Rule along with guidance for how companies should report on the source of the minerals in question: tin, tungsten, tantalum, and gold."}]