[{"url": "http://www.answers.com/Q/Why_did_the_blitz_happen", "passage_text": "The Blitz was the sustained bombing of Britain by Nazi Germany between 7 September 1940 and 10 May 1941, during the Second World War. "}, {"url": "https://answers.yahoo.com/question/index?qid=20080202015221AA5fwPn", "passage_text": "The Blitz though, was the nickname of the air raids against British cities during WWII. All during the war, but especially during the Summer of 1940, the German Air Force (Luftwaffe) sent waves of bombers against targets in British cities. However, suddenly and for no apparent reason, the Luftwaffe turned from bombing RAF facilities to bombing cities, first London and then others. This became known as the Blitz."}, {"url": "https://en.wikipedia.org/wiki/The_Blitz", "passage_text": "Starting on 7 September 1940, one year into the war, London was bombed by the Luftwaffe for 57 consecutive nights. More than one million London houses were destroyed or damaged, and more than 40,000 civilians were killed, almost half of them in London. In comparison to the Allied bombing campaign against Germany, the Blitz resulted in relatively few casualties; the British bombing of Hamburg in July 1943 alone inflicted some 42,000 civilian deaths, about the same as the entire Blitz."}, {"url": "http://www.bbc.co.uk/schools/primaryhistory/world_war2/air_raids/", "passage_text": "Air raids on London began in September 1940. This was the start of the Blitz. Lots of other places were bombed, including industrial cities and ports such as Birmingham, Coventry, Southampton, Sheffield, Manchester, Liverpool, Hull and Glasgow. "}, {"url": "http://www.answers.com/Q/When_did_the_blitz_happen", "passage_text": "The Blitz was the sustained bombing of Britain by Nazi Germany between 7 September 1940 and 10 May 1941, during the Second World War. Over 41,000 Brits died and 137,000 injure … d.The Germans attacked London because it is the heart of Britain. + 64 others found this useful. "}, {"url": "http://www.military-history.org/articles/world-war-2/blitz-ww2.htm", "passage_text": "The Blitz (the London Blitz) was the sustained bombing of Britain by Nazi Germany between 7th September 1940 and 10th May 1941 during the World War Two. Every night bar one for ten solid weeks,from 7 September to 14 November 1940, London was attacked by an average of 160 bombers. "}, {"url": "https://en.wikipedia.org/wiki/The_Blitz", "passage_text": "The Blitz (shortened from German Blitzkrieg, lightning war) was the period of sustained strategic bombing of the United Kingdom by Nazi Germany during the Second World War. In comparison to the Allied bombing campaign against Germany, the Blitz resulted in relatively few casualties; the British bombing of Hamburg in July 1943 alone inflicted some 42,000 civilian deaths, about the same as the entire Blitz."}, {"url": "https://answers.yahoo.com/question/index?qid=20080202015221AA5fwPn", "passage_text": "Best Answer: Hitler wanted to invade the UK as it was, at the time, the only country still fighting against him. His planned invasion required the knocking out of the RAF and that is what was tried in late August/September 1940 and is now known as The Battle of Britain. However, suddenly and for no apparent reason, the Luftwaffe turned from bombing RAF facilities to bombing cities, first London and then others. This became known as the Blitz."}]