[{"url": "https://en.wikipedia.org/wiki/Plant_operator", "passage_text": "A plant operator is a person who supervises the operation of an industrial plant. The term is usually applied to power plants or chemical plants such as gas extraction, petrochemical or oil refinery or other chemical processes. There may be a control room in the plant where the operator works. These are known as board operators. Generally, operators are assigned to a particular unit, on which they are responsible for a certain function or area of equipme"}, {"url": "http://www.wisegeek.org/what-does-a-power-plant-operator-do.htm", "passage_text": "A power plant operator may be responsible for performing maintenance and troubleshooting on equipment. A power plant operator may use computers to monitor equipment functionality. Control center at a nuclear power plant. A nuclear power plant operator may be tasked with monitoring the status of a reactor's fuel rods. Power plant operators often work from a control room"}, {"url": "http://www1.salary.com/Chemical-Plant-Operator-salary.html", "passage_text": "For example the median expected annual pay for a typical Chemical Plant Operator in the United States is $48,636, so 50% of the people who perform the job of Chemical Plant Operator in the United States are expected to make less than $48,636. Source: HR Reported data as of October 2015. 1  Salary. 2  Salary + Bonus. 3  Benefits. "}, {"url": "http://www.bls.gov/ooh/Production/Water-and-wastewater-treatment-plant-and-system-operators.htm", "passage_text": "Employment of water and wastewater treatment plant and system operators is projected to grow 8 percent from 2012 to 2022, about as fast as the average for all occupations. Job prospects are expected to be excellent. Water and wastewater treatment plant and system operators must have the ability to apply data to formulas that determine treatment requirements, flow levels, and concentration levels. Mechanical skills. Water and wastewater treatment plant and system operators must know how to work with machines and use tools."}, {"url": "http://www.bls.gov/ooh/Production/Power-plant-operators-distributors-and-dispatchers.htm", "passage_text": "Power plant operators, dispatchers, and distributors need extensive on-the-job training that may include a combination of classroom and hands-on training. Nuclear power reactor operators also need a license. Many jobs require a background check, and workers are subject to drug and alcohol screenings. Power plant operators, dispatchers, and distributors need extensive on-the-job training which"}, {"url": "http://www.payscale.com/research/US/Job=Power_Plant_Operator/Hourly_Rate", "passage_text": "Very much a male-dominated career in the United States, Power Plant Operators earn an average of $26.84 per hour. Residence is the biggest factor affecting pay for this group, followed by career length and the specific company. The majority of workers are highly satisfied with their job. "}, {"url": "http://www.bls.gov/ooh/Production/Water-and-wastewater-treatment-plant-and-system-operators.htm", "passage_text": "Employment of water and wastewater treatment plant and system operators is projected to grow 8 percent from 2012 to 2022, about as fast as the average for all occupations. A growing population and increased demand for water and wastewater treatment services will drive employment growth. Water and wastewater treatment plant and system operators must have the ability to apply data to formulas that determine treatment requirements, flow levels, and concentration levels. Mechanical skills. Water and wastewater treatment plant and system operators must know how to work with machines and use tools."}, {"url": "http://www.wisegeek.org/what-does-a-power-plant-operator-do.htm", "passage_text": "This means that a power plant operator should know as much as possible about the specific equipment used in the plant. One way to accomplish this is by operator training. Many operators undergo constant and rigorous training in order to ensure accurate and safe operation. Maintenance might be another aspect of the job. A power plant operator may use computers to monitor equipment functionality. Control center at a nuclear power plant. A nuclear power plant operator may be tasked with monitoring the status of a reactor's fuel rods."}]