[{"url": "http://www.diet.com/g/macronutrients", "passage_text": "Nutrients are substances needed for growth, metabolism, and for other body functions. Macronutrients are nutrients that provide calories or energy. The prefix makro is from the Greek and means big or large, used because macronutrients are required in large amounts. There are three broad classes of macro-nutrients: proteins, carbohydrates, and fats. Carbohydrates are roughly 50% oxygen, and like fats, they usually have less than 5% nitrogen or none at all. Proteins, on the other hand, consist of 15-25% nitrogen and about an equal amount of oxygen. The three macronutrients are often found together in most foods, but in varying amounts, or alone in other foods."}, {"url": "http://www.innerbody.com/nutrition/macronutrients", "passage_text": "Like carbohydrates and lipids, proteins are one of the macronutrients. Though protein provides your body with 4 kcals per gram, giving you energy is not its primary role. Rather, it’s got way too many other things going on. In fact, your body contains thousands of different proteins, each with a unique function. A complete protein includes all of the essential amino acids. Complete proteins include all animal proteins and soy. Incomplete proteins lack one or more essential amino acids. Beans, nuts, grains and vegetables are incomplete proteins."}, {"url": "http://paleoleap.com/micronutrients-nourishing-diet/", "passage_text": "This framework consists of two types of nutrients: macronutrients (protein, fat, and carbohydrates), which supply energy in the form of calories, and micronutrients (vitamins and minerals), which support the various biochemical processes in your body. Keeping track of macronutrients is fairly simple – there are only three, and most people have a rough idea of what kinds of foods supply which ones. But tracking every single micronutrient in your diet to make sure you meet your RDA would be impossibly tedious. Luckily, you don’t have to."}, {"url": "http://www.macronutrients.net/micronutrients-vs-macronutrients/", "passage_text": "Macronutrients. Macronutrients constitute the bulk of the food we eat. The macronutrients are proteins, carbohydrates and fats. Proteins a€“ â proteins are called building blocks of. Life it is what most of our body is made up. Of proteins themselves are made of amino. acids"}, {"url": "http://www.deathtodiabetes.com/uploads/z_0977360741_Chapter_5_Pg_69-73.pdf", "passage_text": "CHAPTER 5 55 Chapter 5. The Major Macronutrients The 4 Macronutrients Sometimes it is confusing trying to figure out how carbohydrates, proteins, fats, vitamins, minerals, fiber, calories and all of the other nutritional components fit into an overall eating plan or diet. Coincidentally, there are four macronutrients that reside in every cell in the human body: Carbohydrates, which come primarily from plants, e.g. land vegetables, fruits, grains, sea vegetables, other plant foods; and, from man-made processed foods, e.g. bread (flour), pasta, cereal."}, {"url": "http://www.livestrong.com/article/132977-what-nutrients-can-be-found-beef-steak/", "passage_text": "A steak can be virtually any type of meat, although it usually refers to beef. The specific name of the steak indicates the part of the animal that the steak comes from. Beef steak is generally high in protein and the fat content can vary greatly according to the type of steak. "}, {"url": "http://www.macronutrients.net/micronutrients-vs-macronutrients/", "passage_text": "The macronutrients are proteins, carbohydrates and fats. Proteins a€“ â proteins are called building blocks of. Life it is what most of our body is made up. Of proteins themselves are made of amino. Acids some good sources of protein include, fish poultry, meat, legumes, soy, eggs milk and milk. products Macronutrients constitute the bulk of the food we eat. The macronutrients are proteins, carbohydrates and fats. Proteins a€“ â proteins are called building blocks of. Life it is what most of our body is made up. Of proteins themselves are made of amino. acids"}, {"url": "http://healthyeating.sfgate.com/nutritional-serving-ground-beef-1952.html", "passage_text": "Macronutrients. A 4-ounce serving of extra-lean ground beef contains 260 calories, along with 21 grams of protein and 20 grams of fat, including 8 grams of saturated fat. The same serving of regular ground beef contains 350 calories, along with 19 grams of protein and 30 grams of fat, including 12 grams of saturated fat. Ground beef is a good source of vitamin B-12, zinc, niacin, riboflavin, phosphorus, vitamin B-6 and iron. It also provides you with smaller amounts of thiamine, riboflavin and folate."}, {"url": "http://www.fitday.com/fitness-articles/nutrition/vitamins-minerals/the-3-primary-macronutrients-and-their-importance.html", "passage_text": "Vitamins and Minerals. The three macronutrients of protein, fat, and carbohydrates all perform essential roles in the human body. Macronutrients are the main components of our diet. Our bodies require others nutrients as well, such as vitamins and minerals. "}]