[{"url": "http://www.healthline.com/health/bilirubin-blood", "passage_text": "In an older child or adult, normal values of direct (conjugated) bilirubin are from 0 to 0.3 milligrams per deciliter (mg/dL). Normal values of total bilirubin (direct and indirect) are from 0.3 to 1.9 mg/dL. Testing for bilirubin in the blood is therefore a good test of damage to your liver. Newborn infants often have some jaundice, and bilirubin in the blood may be tested several times in the first few days of an infant’s life to check that the liver is starting to work properly."}, {"url": "http://www.aafp.org/afp/2002/0215/p599.html", "passage_text": "Phototherapy should be instituted when the total serum bilirubin level is at or above 15 mg per dL (257 mol per L) in infants 25 to 48 hours old, 18 mg per dL (308 mol per L) in infants 49 to 72 hours old, and 20 mg per dL (342 mol per L) in infants older than 72 hours. 1, 3, 10 In the term newborn with hemolysis, a bilirubin level above 20 mg per dL (342 μ mol per L) is a concern. 1, 3. The effects of bilirubin toxicity are often devastating and irreversible (Table 2) . 3, 9 Early signs of kernicterus are subtle and nonspecific, typically appearing three to four days after birth."}, {"url": "http://www.healthline.com/health/bilirubin-blood", "passage_text": "In a newborn, higher bilirubin is normal due to the stress of birth. Normal bilirubin in a newborn would be under 5 mg/dL, but up to 60 percent of newborns have some kind of jaundice and bilirubin levels above 5 mg/dL. Testing for bilirubin in the blood is therefore a good test of damage to your liver. Newborn infants often have some jaundice, and bilirubin in the blood may be tested several times in the first few days of an infant’s life to check that the liver is starting to work properly."}, {"url": "http://www.medicalhealthtests.com/articles/337/general-articles/bilirubin-chart-for-newborn.html", "passage_text": "With full term babies, if the bilirubin levels are only slightly higher than the normal values listed in the bilirubin chart for newborn babies, then treatment may not even be required. However, all instances of high levels of bilirubin in a child should be closely monitored by a doctor. Tweet. A bilirubin chart newborn babies is like a graph or a chart, which can help to measure the levels of bilirubin in a newborn baby's blood."}, {"url": "http://www.aafp.org/afp/2002/0215/p599.html", "passage_text": "Breast milk jaundice occurs later in the newborn period, with the bilirubin level usually peaking in the sixth to 14th days of life. This late-onset jaundice may develop in up to one third of healthy breastfed infants. 1 Total serum bilirubin levels vary from 12 to 20 mg per dL (340 μ mol per L) and are nonpathologic. 1, 3, 10 In the term newborn with hemolysis, a bilirubin level above 20 mg per dL (342 μ mol per L) is a concern. 1, 3. The effects of bilirubin toxicity are often devastating and irreversible (Table 2) . 3, 9 Early signs of kernicterus are subtle and nonspecific, typically appearing three to four days after birth."}, {"url": "https://answers.yahoo.com/question/index?qid=20070622055505AA0k3ZM", "passage_text": "Best Answer: The reference range for total bilirubin is 2 - 14. It is not uncommon to see high bilirubin levels in newborns, typically 1 to 3 days old. This is sometimes called physiologic jaundice of the newborn. Within the first 24 hours of life, up to 50% of full-term newborns, and an even greater percentage of pre-term babies, may have a high bilirubin level."}, {"url": "https://www.healthtap.com/topics/bilirubin-normal-range-for-newborn-baby", "passage_text": "6. Get help from a doctor now ›. See below: Bilirubin levels in full term, healthy newborns that may require treatment serum bilirubin levels age of baby above 10 mg less than 24 hours old above 15 mg 24-48 hours old above 18 mg 49-72 hours old above 20 mg older than 72 hours good luck. ...Read more."}, {"url": "http://www.aafp.org/afp/2002/0215/p599.html", "passage_text": "Neonatal hyperbilirubinemia, defined as a total serum bilirubin level above 5 mg per dL (86 μmol per L), is a frequently encountered problem. Although up to 60 percent of term newborns have clinical jaundice in the first week of life, few have significant underlying disease. 1, 3, 10 In the term newborn with hemolysis, a bilirubin level above 20 mg per dL (342 μ mol per L) is a concern. 1, 3. The effects of bilirubin toxicity are often devastating and irreversible (Table 2) . 3, 9 Early signs of kernicterus are subtle and nonspecific, typically appearing three to four days after birth."}, {"url": "http://www.medicalhealthtests.com/articles/337/general-articles/bilirubin-chart-for-newborn.html", "passage_text": "According to a bilirubin chart in newborn babies, the normal values that have been highlighted are: Premature Babies. 1  Less than 24 hours: Below 8.0 mg/ dl (below 137 mmol/ l). 2  Less than 48 hours: Below 12.0 mg/ dl (below 205 mmol/ l). 3  Aged between 3 and 5 days: Below 15.0 mg/ dl (below 256 mmol/ l). A bilirubin chart newborn babies is like a graph or a chart, which can help to measure the levels of bilirubin in a newborn baby's blood."}]