[{"url": "http://www.therichest.com/celebnetworth/celeb/ralph-lauren-net-worth/", "passage_text": "About Ralph Lauren. American fashion designer and business executive, Ralph Lauren has an estimated net worth of $6.5 billion as of October 2015, according to Forbes. The Bronx native worked his first job at Brooks Brothers, and left school to design ties for Beau Brummel 1976. He launched Polo with $50,000 later that year. "}, {"url": "https://en.wikipedia.org/wiki/Ralph_Lauren", "passage_text": "In 2010, Lauren was declared Chevalier de la Legion d'honneur by French President Nicolas Sarkozy. As of January 2015, Forbes estimates his wealth at $8 billion, which makes Ralph Lauren the 155th richest person in the world. This was the first time the Polo emblem was seen, displayed on the cuff of the suit. Ralph Lauren released Polo's famous short sleeve pique shirt with the Polo logo in 1972 and unveiled his first Ralph Lauren collection for women."}, {"url": "http://www.bornrich.com/ralph-lauren.html", "passage_text": "Ralph Lauren net worth is comprise of his $10 billion fashion empire, which owes its origin to a mere $50,000 loan that he took in 1960s is more than enough to establish his credentials as an astute businessman with the style and elegance of his own. Ralph Lauren owns a 1934 Bugatti Type 59. It has a powerful engine, 3.3 liter unit with a single Roots type supercharger fed by two down draft Zenith carburetors, and equipped with twin overhead camshaft engine."}, {"url": "https://www.richestnetworth.com/ralph-lauren-net-worth/", "passage_text": "Ralph Lauren is a Bronx-born American fashion designer with a net worth of $4.6 billion dollars. Ralph Lauren attended Baruch College in N... [read more]. Ralph Lauren attended Baruch College in New York, but did not complete his degree in business, instead dropping out to sell men's wear. He later began to design his own neckties and men's clothes, and later added a women's wear line."}, {"url": "http://www.forbes.com/profile/ralph-lauren/", "passage_text": "He is still chairman of the $7.5 billion (sales) company. His son David heads global advertising and marketing and recently joined the company's board. Lauren owns one of the most valuable car collections in the world, pegged to be worth $200 million by one expert. His most valuable: a rare Bugatti Type 57SC Antantics (price tag: an estimated $40 million)."}, {"url": "http://www.bornrich.com/ralph-lauren.html", "passage_text": "His Polo brand not only provided the office goers the much needed sense of power and style in 1980s but also augmented Ralph Lauren net worth. It is Lauren's innovativeness, among many other traits of the model businessman that has made him the founder, designer and chairman of a $10 billion company. Ralph Lauren owns a 1934 Bugatti Type 59. It has a powerful engine, 3.3 liter unit with a single Roots type supercharger fed by two down draft Zenith carburetors, and equipped with twin overhead camshaft engine."}, {"url": "http://www.celebritynetworth.com/richest-businessmen/richest-designers/ralph-lauren-net-worth/", "passage_text": "Ralph Lauren net worth: Ralph Lauren is an American fashion designer who has a net worth of $8.2 billion dollars. Ralph Lauren attended Baruch College in New York, but did not complete his degree in business, instead dropping out to sell men's wear. He later began to design his own neckties and men's clothes, and eventually added a women's wear line. He currently owns 35 boutique shops in the US. Lauren has accumulated his net worth largely through the extreme popularity of his various clothing brands, including most famously Polo Ralph Lauren. He was born Ralph Lifshitz, and changed his name due to his original name's unfortunate obscene connotations in English"}, {"url": "http://networthcity.com/ralph-lauren-net-worth/", "passage_text": "He turned rugs into ties and sold them in small shops in New York city. Now that Ralph Lauren is one of the richest people in the world with net worth of $7.7 billion, one may only wonder what would have happened if the tie company accepted the design. "}, {"url": "http://www.bornrich.com/ralph-lauren.html", "passage_text": "Ralph Lauren net worth is estimated at $7.1 billion according to Forbes. Ralph Lauren is a fashion entrepreneur and that too a highly successful one, but more than anything else he is an iconic brand, whose creations have redefined the fashion scene time and again. Ralph Lauren owns a 1934 Bugatti Type 59. It has a powerful engine, 3.3 liter unit with a single Roots type supercharger fed by two down draft Zenith carburetors, and equipped with twin overhead camshaft engine."}]