[{"url": "http://medical-dictionary.thefreedictionary.com/Bulimia+nervosa", "passage_text": "Bulimia nervosa is a serious and sometimes life-threatening eating disorder affecting mainly young women. People with bulimia, known as bulimics, consume large amounts of food (binge) and then try to rid themselves of the food and calories (purge) by fasting, excessive exercise, vomiting, or using laxatives."}, {"url": "http://www.medicinenet.com/script/main/art.asp?articlekey=2546", "passage_text": "Bulimia: Also called bulimia nervosa. An eating disorder characterized by episodes of secretive excessive eating (binge-eating) followed by inappropriate methods of weight control, such as self-induced vomiting (purging), abuse of laxatives and diuretics, or excessive exercise. The insatiable appetite of bulimia is often interrupted by periods of anorexia."}, {"url": "https://www.nationaleatingdisorders.org/bulimia-nervosa", "passage_text": "Bulimia Nervosa. Bulimia nervosa is a serious, potentially life-threatening eating disorder characterized by a cycle of bingeing and compensatory behaviors such as self-induced vomiting designed to undo or compensate for the effects of binge eating. Symptoms."}, {"url": "http://www.healthline.com/health/bulimia-nervosa", "passage_text": "Bulimia is an eating disorder characterized by binge eating followed by purging, often through forced vomiting. Some people with bulimia purge through excessive exercise or by taking laxatives or diuretics. Bulimia is a serious condition that can be life threatening. Bulimia can be broken into two categories: purging and non-purging. Purging bulimia follows the binge-and-purge cycle."}, {"url": "https://en.wikipedia.org/wiki/Bulimia_nervosa", "passage_text": "Bulimia nervosa, also known as simply bulimia, is an eating disorder characterized by binge eating followed by purging. Binge eating refers to eating a large amount of food in a short amount of time. Purging refers to attempts to rid oneself of the food consumed. This may be done by vomiting or taking a laxative. "}]