[{"url": "https://uk.answers.yahoo.com/question/index?qid=20131017050854AAYEo8i", "passage_text": "The cause is Bacillus Cereus (pronounced B.Serious which makes it easy to remember… but take it seriously, this is no joke). Cooked rice should be cooled rapidly, and stored in a clean, sealed container, within 1 hour of cooking. Treat it like cooked meat, 3-4 days in the fridge should be fine. When you cook it, stir fry it on a high temperature until it's thoroughly cooked through. Source(s): http://www.foodsafety.gov/poisoning/caus.."}, {"url": "http://www.answers.com/Q/How_long_does_cooked_rice_stay_fresh_in_the_refrigerator", "passage_text": "Answer by Chazah. Confidence votes 181. Answer: Cooked foods should be used within 3 days of refrigeration. ----------------------------------------. Leave cooked rice uncovered until it's cooled slightly. Refrigerate in its cooking container and cover when cold. Next day, use a serving spoon to transfer to a freezer bag, separating the grains by applying pressure to the bag, squeezing out all the air and spinning the bag to twist closed."}, {"url": "http://community.cookinglight.com/archive/index.php/t-28743.html", "passage_text": "Cooked rice, when not eaten immediately, should be cooled quickly. To store cooked rice, place in a shallow container, cover, and place in refrigerator. Cooked rice may be stored in the refrigerator for up to 3 days. I also read where it can be frozen for up to 6 months. Ohioan. 08-24-2002, 10:34 AM. I'm usually kind of careless about how long I leave things in the fridge, but even I wouldn't leave cooked rice more than three days."}, {"url": "http://www.answers.com/Q/How_long_does_cooked_rice_stay_fresh_in_the_refrigerator", "passage_text": "---------------------------------------- Answer: About 3-4 days. I never have any problem with storing cooked rice in the fridge, but make sure its cooled and place in an airtight container. It never goes dry, hard or loses its flavor and I've been doing this for over 20yrs. Leave cooked rice uncovered until it's cooled slightly. Refrigerate in its cooking container and cover when cold. Next day, use a serving spoon to transfer to a freezer bag, separating the grains by applying pressure to the bag, squeezing out all the air and spinning the bag to twist closed."}, {"url": "http://www.answers.com/Q/How_long_can_cooked_rice_stay_on_the_fridge", "passage_text": "Depending on the temperature of your refrigerator about a week is safe. You should keep some white medical tape handy and mark leftovers with the date on them, and use a … refigerator thermometer to adjust the temperature so it remains about 38 to 42 degrees farenheit. "}, {"url": "http://www.stilltasty.com/articles/view/71", "passage_text": "How to reheat cooked rice: - On the stovetop: Add 2 tablespoons of liquid per each cup of cooked rice. Cover and heat about five minutes on top of the stove. - In the microwave: Add 2 tablespoons of liquid per each cup of cooked rice. Microwave on high power — allow about 1 minute for each cup of rice being reheated. To reheat frozen rice: microwave for 2 minutes on high power for each cup of rice."}, {"url": "http://www.answers.com/Q/How_long_does_cooked_rice_stay_fresh_in_the_refrigerator", "passage_text": "Meats are kept better in the freezer. Meats can be kept in the refrigerator for 3 to 4 days if raw and 1 to 2 days longer if cooked. Always place cooked meats in an airt … ight container. Leave cooked rice uncovered until it's cooled slightly. Refrigerate in its cooking container and cover when cold. Next day, use a serving spoon to transfer to a freezer bag, separating the grains by applying pressure to the bag, squeezing out all the air and spinning the bag to twist closed."}, {"url": "http://food.unl.edu/now-youre-cooking-brown-rice", "passage_text": "Storing Brown Rice. Cooked brown rice can be stored, covered tightly, in a shallow container in the refrigerator for 4 days. It will maintain good quality in the freezer for 6 months but will remain safe in the freezer as long as the temperature remains at 0 degrees F or lower. "}, {"url": "https://answers.yahoo.com/question/index?qid=20070607082419AAsUa3W", "passage_text": "You didn't mention whether the rice is plain, cooked rice (white, brown, etc), or if it has had other ingredients added to it. That's important. Plain rice will last in the fridge for quite a while--maybe a week. The important thing is to limit exposure to air, which will dry out the rice. The best way is to store it in a zipper-top plastic bag. Squeeze out as much air as you possibly can, then seal the bag."}]