[{"url": "http://www.babynamespedia.com/meaning/Basil", "passage_text": "Tweet. Basil is used mostly in Arabic, Czech, English, French, and German, and it is of Old Greek origin. Basil is of the meaning royal, kingly. Original forms of the name include Basileios (Old Greek) and Basilius (Latin). Saint Basil the Great was a well known 4th-century bishop of Caesarea whose fame contributed to the popularity of the name among early Christians. The name was also borne by two Byzantine emperors. The popularity of the name saw a substantial revival in the 19th century, promoted by the plant name, which is derived from the same root word 'basileus' for its excellent medicinal qualities. As a first name, Basil shares the same etymology as Rex, which is from the Latin cognate of the same root word."}, {"url": "http://foodmuseum.typepad.com/food_museum_blog/2004/09/you_say_basil_a.html", "passage_text": "Fellow foodies, I seek your help. In the past 10 years or so I've been baffled by the change in the American English pronunciation of the word basil, the aromatic herb. It's derived from the Greek, basilikon, meaning kingly. By the way, most people pronounce Chicago incorrectly. You should say shi caw' go and you should refrain from using the short A that is used in the correct (according to you) pronunciation of basil."}, {"url": "https://en.wikipedia.org/wiki/Basil_(name)", "passage_text": "The name Basil (/ˈbaezəl/ ; ˈbæzəl, royal) kingly comes from the Male greek Name (Vassilios: GREEK, βασίλειος female Version), bασιλική which first appeared during The hellenistic. period It was brought to England by the Crusaders, having been common in the eastern Mediterranean. It is more often used in Britain and Europe than in the US and is also the name of a common herb. In Arabic, Bas(s)el (باسل, bāsil) is an indirect Quranic name for boys that means brave, fearless, intrepid."}, {"url": "http://dictionary.cambridge.org/pronunciation/english/basil", "passage_text": "How to pronounce basil in American English. (English pronunciations of basil from the Cambridge Advanced Learner’s Dictionary & Thesaurus and from the Cambridge Academic Content Dictionary, both sources © Cambridge University Press). "}, {"url": "http://www.sheknows.com/baby-names/name/basil", "passage_text": "Greek Meaning: The name Basil is a Greek baby name. In Greek the meaning of the name Basil is: Royal. Kingly. St Basil the Great was Bishop of Caesarea in the latter half of the 4th century. This name was introduced into Western Europe by the Crusaders. Derived from the same Greek word as the plant name basil. American Meaning: The name Basil is an American baby name. In American the meaning of the name Basil is: Royal. Kingly. St Basil the Great was Bishop of Caesarea in the latter half of the 4th century. This name was introduced into Western Europe by the Crusaders."}, {"url": "http://www.youtube.com/watch?v=yU8u4PPf-5U", "passage_text": "http://www.bearstearnsbravo.com. This video shows you how to pronounce basil. Learn the correct American English pronunciation of the culinary herb Ocimum basilicum. 1  Howto & Style. 2  Standard YouTube License. "}, {"url": "http://www.babynamespedia.com/meaning/Basil", "passage_text": "The name Basil is widely used; it has 48 derivatives that are used in English and other languages. English derivatives include Basal, Base, Basel, Basey, Basileios, Basilic, Basilides, Basilie, Basino, Bassel, Bazeel, Bazeelius, Brasil, Bresal, Vas (used in Russian too), and Vasily (used in Russian too). The popularity of the name saw a substantial revival in the 19th century, promoted by the plant name, which is derived from the same root word 'basileus' for its excellent medicinal qualities. As a first name, Basil shares the same etymology as Rex, which is from the Latin cognate of the same root word."}, {"url": "http://www.thenamemeaning.com/basil/", "passage_text": "Search comprehensively and find the name meaning of Basil and its name origin or of any other name in our database. Also note the spelling and the pronunciation of the name Basil and check the initials of the name with your last name to discover how it looks and sounds. The history and meaning of the name Basil is fascinating, learn more about it. Pronunciation: (BAZ il); (BAY zul). Form of: Basilius. The meaning of the name “Basil” is: “Like a King”. .adslot_1 { width: 336px; height: 280px; } @media (max-width:350px) { .adslot_1 { width: 300px; height: 250px; } }."}]