[{"url": "https://en.wikipedia.org/wiki/Cerebral_cortex", "passage_text": "The cerebral cortex is gray matter, consisting mainly of cell bodies (with astrocytes being the most abundant cell type in the cortex as well as the human brain as a whole) and capillaries. It contrasts with the underlying white matter, consisting mainly of the white myelinated sheaths of neuronal axons. The cerebral cortex plays a key role in memory, attention, perception, awareness, thought, language, and consciousness. The human cerebral cortex is 2 to 4 millimetres (0.079 to 0.157 in) thick. In large mammals, the cerebral cortex is folded, giving a much greater surface area in the confined volume of the skull."}, {"url": "http://www.wisegeekhealth.com/what-is-the-cerebral-cortex.htm", "passage_text": "Top 10 amazing movie makeup transformations. The cerebral cortex is the outermost layer of the brain in complex animals such as mammals, including humans. Despite a thickness of less than 0.2 inch (5 mm), it is responsible for most higher brain functions, including language, memory, and consciousness. The cerebral cortex is responsible for higher brain functions like language and memory. The cerebral cortex is a layer of the brain responsible for complex functions. The cerebral cortex is the outermost layer of brain."}, {"url": "http://biology.about.com/od/anatomy/a/aa032505a.htm", "passage_text": "The cerebral cortex is the layer of the brain often referred to as gray matter. The cortex (thin layer of tissue) is gray because nerves in this area lack the insulation that makes most other parts of the brain appear to be white. Most of the actual information processing in the brain takes place in the cerebral cortex. The cerebral cortex is divided into lobes that each have a specific function. For example, there are specific areas involved in vision, hearing, touch, movement, and smell."}, {"url": "http://www.slideshare.net/neurosciust/the-cerebral-cortex", "passage_text": "1 1. 2  The cerebral cortex is the part of the brain that  is visible from the outside. 3  The cerebral cortex is the outermost layer of the brain and consists of a collection of nerve cell bodies made up of gray matter. 4  The axons of these neurons extend in toward the center of the brain and into the white matter. 5  2. 1 The cerebral cortex is the outermost layer of the brain and consists of a collection of nerve cell bodies made up of gray matter. 2  The axons of these neurons extend in toward the center of the brain and into the white matter. 3  2. 4  The brain is divided into two hemispheres,  each of which has slightly different functions."}, {"url": "https://en.wikipedia.org/wiki/Cerebral_cortex", "passage_text": "The cerebral cortex is the cerebrum 's (brain) outer layer of neural tissue in humans and other mammals. It is divided into two cortices, along the sagittal plane: the left and right cerebral hemispheres divided by the medial longitudinal fissure. The cerebral cortex plays a key role in memory, attention, perception, awareness, thought, language, and consciousness. The human cerebral cortex is 2 to 4 millimetres (0.079 to 0.157 in) thick. In large mammals, the cerebral cortex is folded, giving a much greater surface area in the confined volume of the skull."}, {"url": "http://www.appsychology.com/Book/Biological/cerebral_cortex.htm", "passage_text": "Now the cerebral cortex is divided into two hemispheres-the left and right hemispheres. For the most part the hemispheres exhibit what we call Contralateral control: which means the left hemisphere controls the right side of out body and the right hemisphere controls the left side. "}, {"url": "http://www.slideshare.net/neurosciust/the-cerebral-cortex", "passage_text": "1 The cerebral cortex is the part of the brain that  is visible from the outside. 2  The cerebral cortex is the outermost layer of the brain and consists of a collection of nerve cell bodies made up of gray matter. 3  The axons of these neurons extend in toward the center of the brain and into the white matter. 4  2. 1 The cerebral cortex is the outermost layer of the brain and consists of a collection of nerve cell bodies made up of gray matter. 2  The axons of these neurons extend in toward the center of the brain and into the white matter. 3  2. 4  The brain is divided into two hemispheres,  each of which has slightly different functions."}, {"url": "http://brainmadesimple.com/cortex-and-lobes-of-the-brain.html", "passage_text": "Fun Fact. Over time, the human cortex undergoes a process of corticalization, or wrinkling of the cortex. This process is due to the vast knowledge that the human brain accumulates over time. Therefore, the more wrinkly your brain, the smarter and more intelligent you are! Function: Responsible for thinking and processing information from the five senses. The Cerebral Cortex is made up of tightly packed neurons and is the wrinkly, outermost layer that surrounds the brain. It is also responsible for higher thought processes including speech and decision making."}]