[{"url": "http://www.thefreedictionary.com/isomer", "passage_text": "Noun. 1. isomer-a compound that exists in forms having different arrangements of atoms but the same molecular weight. chemical compound, compound - (chemistry) a substance formed by chemical union of two or more elements or ingredients in definite proportion by weight. Translations. [ˈaɪsəməʳ] N → isomero isómero. m"}, {"url": "http://www.merriam-webster.com/dictionary/isomerism", "passage_text": "Definition of ISOMERISM. 1. : the relationship of two or more chemical species that are isomers. 2. : the relation of two or more nuclides with the same mass numbers and atomic numbers but different energy states and rates of radioactive decay. Medical Definition of ISOMERISM. 1. : the relation of two or more chemical species that are isomers."}, {"url": "https://en.wikipedia.org/wiki/Isomer", "passage_text": "In skeletal isomers the main carbon chain is different between the two isomers. This type of isomerism is most identifiable in secondary and tertiary alcohol isomers. Tautomers are structural isomers of the same chemical substance that spontaneously interconvert with each other, even when pure. They have different chemical properties and, as a consequence, distinct reactions characteristic to each form are observed. The different types of isomers, including position isomers 2-fluoropropane and 1-fluoropropane on the left. In structural isomers, sometimes referred to as constitutional isomers, the atoms and functional groups are joined together in different ways. Structural isomers have different IUPAC names and may or may not belong to the same functional group"}, {"url": "http://www.merriam-webster.com/dictionary/isomer", "passage_text": "Definition of ISOMER. 1. : one of two or more compounds, radicals, or ions that contain the same number of atoms of the same elements but differ in structural arrangement and properties. 2. : a nuclide isomeric with one or more others. See isomer defined for kids. ADVERTISEMENT"}, {"url": "http://chemistry.about.com/od/chemistryglossary/a/isomerdef.htm", "passage_text": "Post. Share. Isomer Definition: An isomer is a chemical species with the same number and types of atoms as another chemical species, but possessing different properties. There are structural isomers, geometric isomers, optical isomers, and stereoisomers"}, {"url": "http://chemistry.about.com/od/chemistryglossary/g/Structural-Isomer-Definition.htm", "passage_text": "By Anne Marie Helmenstine, Ph.D. Definition: Structural isomers are isomers that have the same component atoms but arranged differently from each other. Examples: Butane and isobutane (C 4 H 10) are structural isomers of each other. "}]