[{"url": "http://work.chron.com/much-licensed-vocational-nurse-make-4142.html", "passage_text": "The country’s 729,140 licensed vocational nurses earned a mean $20.21 per hour, or $42,040 per year, as of May 2011, according to the Bureau of Labor Statistics. The lowest-paid LVNs earned $14.74 per hour, or $30,650 per year. The highest wages went above $27.44 per hour, or $57,080 per year. Almost 30 percent of LVNs worked in nursing care facilities, where they took care of the chronically ill, injured or disabled. Salaries averaged $23.04 per hour, or $47,930 per year. Texas offered the most jobs for LVNs -- almost 10 percent of the total jobs in the country -- and paid a mean $20.32 per hour, or $42,260 per year, according to the 2011 BLS statistics."}, {"url": "http://www.indeed.com/salary/q-Dialysis-LVN-l-Houston,-TX.html", "passage_text": "$104,000. Average Dialysis LVN salaries for job postings in Houston, TX are 13% higher than average Dialysis LVN salaries for job postings nationwide."}, {"url": "http://www.answers.com/Q/What_are_LVN_salaries_in_Tyler_Texas", "passage_text": "A licensed vocational nurse in Bedford, TX makes about $20 per hour  to start. Experienced nurses can make from $25 to $30 per hour. My first job straight out of school was at a nursing home, I worked there for 9 months making $16.50/hr. Then I left there and went to w … ork at a local hospital full-time and my base-pay was $12.47/hr but with shift-diff and all the extra stuff added on it ended up I was making about $17/hr on average."}, {"url": "http://allnurses.com/texas-nursing/lvn-salary-in-389978.html", "passage_text": "last year as an LVN working in dialysis at Davita I was making $21. finished RN school in may 2010 and Davita offered me $27/hr so I said goodbye and got me a job at a private dialysis center making $34/hr with only 4 months of RN experience, I was only an LVN for 1 year and a dialysis PCT for 16 years. "}, {"url": "http://www.ehow.com/facts_7503127_much-lvn-make-texas.html", "passage_text": "Throughout the major metropolitan centers of Texas (defined as areas with populations above 100,000), LVNs earned between $13.50 per hour and $21 per hour. LVNs in Houston, earned, on average, $21 per hour. Licensed vocational nurses (LVNs) work in a variety of settings, often have relatively flexible schedules and generally receive benefits as part of the compensation package. As of November 2010, LVNs earned wages between $12 and $21 per hour, base in part on their location within Texas."}, {"url": "http://www.answers.com/Q/How_much_does_a_LVN_or_LPN_get_paid_in_Houston_Texas", "passage_text": "A licensed vocational nurse in Bedford, TX makes about $20 per hour  to start. Experienced nurses can make from $25 to $30 per hour. My first job straight out of school was at a nursing home, I worked there for 9 months making $16.50/hr. Then I left there and went to w … ork at a local hospital full-time and my base-pay was $12.47/hr but with shift-diff and all the extra stuff added on it ended up I was making about $17/hr on average."}, {"url": "http://www.answers.com/Q/What_are_LVN_salaries_in_Tyler_Texas", "passage_text": "In the state of Texas, the average annual salary for an LVN is  $50,120. This is higher than the national average, which is  $44,000. My first job straight out of school was at a nursing home, I worked there for 9 months making $16.50/hr. Then I left there and went to w … ork at a local hospital full-time and my base-pay was $12.47/hr but with shift-diff and all the extra stuff added on it ended up I was making about $17/hr on average."}, {"url": "http://www.indeed.com/salary/q-LVN-l-Houston,-TX.html", "passage_text": "Average LVN salaries for job postings in Houston, TX are 13% higher than average LVN salaries for job postings nationwide. "}, {"url": "http://work.chron.com/much-licensed-vocational-nurse-make-4142.html", "passage_text": "States. Texas offered the most jobs for LVNs -- almost 10 percent of the total jobs in the country -- and paid a mean $20.32 per hour, or $42,260 per year, according to the 2011 BLS statistics. Salaries averaged $23.04 per hour, or $47,930 per year. Texas offered the most jobs for LVNs -- almost 10 percent of the total jobs in the country -- and paid a mean $20.32 per hour, or $42,260 per year, according to the 2011 BLS statistics."}]