[{"url": "http://www.lenntech.com/periodic/elements/f.htm", "passage_text": "Fluorine. Fluorine is an univalent poisonous gaseous halogen, it is pale yellow-green and it is the most chemically reactive and electronegative of all the elements. Fluorine readily forms compounds with most other elements, even with the noble gases krypton, xenon and radon. It is so reactive that glass, metals, and even water, as well as other substances, burn with a bright flame in a jet of fluorine gas."}, {"url": "http://www.webelements.com/fluorine/", "passage_text": "Fluorine: the essentials. Fluorine is a Group 17 element. Fluorine is the most electronegative and reactive of all elements. It is a pale yellow, corrosive gas, which reacts with practically all organic and inorganic substances. Finely divided metals, glass, ceramics, carbon, and even water burn in fluorine with a bright flame. Fluorine as fluoride (F -) is probably an essential element for humans and certainly is for some molluscs. In some areas, fluoride ion is added to drinking water (in very low concentrations) since it renders tooth enamel relatively immune to bacteriological attack."}, {"url": "http://www.medicalnewstoday.com/articles/154164.php", "passage_text": "Knowledge center. Fluoride, the 13th most abundant element on the earth's crust, is a chemical ion of the element fluorine-fluoride has one extra electron that gives it a negative charge. Fluoride is found naturally in soil, water, foods, and several minerals, such as fluorapatite and fluorite. Fluoride concentration in seawater averages 1.3 ppm (parts per million), while in fresh water supplies the natural range is typically between 0.01 to 0.3 ppm."}, {"url": "https://en.wikipedia.org/wiki/Fluorine", "passage_text": "As the most electronegative element, it is extremely reactive: almost all other elements, including some noble gases, form compounds with fluorine. Among the elements, fluorine ranks 24th in universal abundance and 13th in terrestrial abundance. "}, {"url": "http://www.thefreedictionary.com/fluorine", "passage_text": "fluorine. n. 1. (Elements & Compounds) a toxic pungent pale yellow gas of the halogen group that is the most electronegative and reactive of all the elements, occurring principally in fluorspar and cryolite: used in the production of uranium, fluorocarbons, and other chemicals. fluor·ine. Symbol F A pale-yellow, poisonous, gaseous halogen element that is highly corrosive. It is used to separate certain isotopes of uranium and to make refrigerants and high-temperature plastics. It is also added in fluoride form to the water supply to prevent tooth decay."}, {"url": "http://chemistry.about.com/od/elementfacts/a/fluorine.htm", "passage_text": "It is highly reactive, participating in reactions with virtually all organic and inorganic substances. Fluorine is the most electronegative element. Metals, glass, ceramics, carbon, and water will burn with a bright flame in fluorine. It is possible that fluorine can substitute for hydrogen in organic reactions. "}, {"url": "http://www.chemicool.com/elements/fluorine.html", "passage_text": "Fluorine is the most reactive and the most electronegative of all the elements. Fluorine is a pale yellow, diatomic, highly corrosive, flammable gas, with a pungent odor. Fluorine is highly toxic and corrosive. Characteristics: Fluorine is the most reactive and the most electronegative of all the elements. Fluorine is a pale yellow, diatomic, highly corrosive, flammable gas, with a pungent odor. It is the lightest halogen. It reacts violently with water to produce oxygen and the extremely corrosive hydrofluoric acid"}, {"url": "http://www.wisegeek.com/what-is-fluorine.htm", "passage_text": "Fluorine is an extremely reactive and highly toxic gaseous element. In very small amounts, it is also a trace element necessary for the health of most organisms, although the line between enough and too much is very fine. "}]