[{"url": "http://www.defenders.org/forest/types-forests", "passage_text": "Due to the high levels of precipitation and moderate temperatures, there is a long growing season, resulting in trees that grow very tall. Dominant tree species found in temperate coniferous forests include cedar, cypress, Douglas fir, pine, spruce and redwood. Location: This is the northern most forest type and is found between 50 and 60 degrees N latitude. Boreal forests are found in Canada, northern Asia, Siberia and Scandinavia (Denmark, Norway, Sweden, Finland)."}, {"url": "http://wwf.panda.org/about_our_earth/ecoregions/about/habitat_types/habitats/coniferous_forests/", "passage_text": "Evergreen regions. Coniferous forests are made up mainly of cone-bearing or coniferous trees, such as spruces, hemlocks, pines and firs. The leaves of these trees are either small and needle-like or scale-like and most stay green all year around (evergreen). All are softwoods able to survive cold termperatures and acidic soil. "}, {"url": "http://www.defenders.org/forest/types-forests", "passage_text": "Boreal (taiga) Forest. Location: This is the northern most forest type and is found between 50 and 60 degrees N latitude. Boreal forests are found in Canada, northern Asia, Siberia and Scandinavia (Denmark, Norway, Sweden, Finland). About two-thirds of the world's boreal forests are found in Scandinavia"}, {"url": "http://www.earthobservatory.nasa.gov/Experiments/Biome/bioconiferous.php", "passage_text": "Description. Between the tundra to the north and the deciduous forest to the south lies the large area of coniferous forest. One type of coniferous forest, the northern boreal forest, is found in 50° to 60°N latitudes. Another type, temperate coniferous forests, grows in lower latitudes of North America, Europe, and Asia, in the high elevations of mountains. "}, {"url": "https://en.wikipedia.org/wiki/Temperate_coniferous_forest", "passage_text": "Temperate evergreen forests are common in the coastal areas of regions that have mild winters and heavy rainfall, or inland in drier climates or mountain areas. Coniferous forests can be found in the United States, Canada, Europe, and Asia. Many species of tree inhabit these forests including cedar, cypress, Douglas fir, fir, juniper, kauri, pine, podocarpus, spruce, redwood and yew."}, {"url": "http://www.worldwildlife.org/biomes/temperate-coniferous-forest", "passage_text": "Temperate Coniferous Forest. Temperate evergreen forests are found predominantly in areas with warm summers and cool winters, and vary enormously in their kinds of plant life. In some, needleleaf trees dominate, while others are home primarily to broadleaf evergreen trees or a mix of both tree types. The understory also contains a wide variety of herbaceous and shrub species. Temperate conifer forests sustain the highest levels of biomass in any terrestrial ecosystem and are notable for trees of massive proportions in temperate rainforest regions."}, {"url": "http://www.worldwildlife.org/biomes/temperate-coniferous-forest", "passage_text": "Temperate evergreen forests are common in the coastal areas of regions that have mild winters and heavy rainfall, or inland in drier climates or montane areas. Many species of trees inhabit these forests including pine, cedar, fir, and redwood. The understory also contains a wide variety of herbaceous and shrub species. Temperate conifer forests sustain the highest levels of biomass in any terrestrial ecosystem and are notable for trees of massive proportions in temperate rainforest regions."}, {"url": "http://lib.colostate.edu/wildlife/forest-biome.html", "passage_text": "Forest Biome. Forest is a broad term used to describe areas where there are a large number of trees. Depending on the type of trees in that area forests can be further divided into five main categories. These are: coniferous forest, deciduous forest, mixed leaved forest, Mediterranean forest, and tropical rainforests. Below are their descriptions."}, {"url": "https://en.wikipedia.org/wiki/Temperate_coniferous_forest", "passage_text": "A pine forest is an example of a temperate coniferous forest. Map of temperate coniferous forest ecoregions of the world. Temperate coniferous forest is a terrestrial biome found in temperate regions of the world with warm summers and cool winters and adequate rainfall to sustain a forest. Coniferous forests can be found in the United States, Canada, Europe, and Asia. Many species of tree inhabit these forests including cedar, cypress, Douglas fir, fir, juniper, kauri, pine, podocarpus, spruce, redwood and yew."}, {"url": "http://www.skyenimals.com/browse_habitat.cgi?habitat=coniferous_forest", "passage_text": "Coniferous Forest Coniferous forests are home to the world's toughest trees. The evergreen trees in these forests live through extreme weather conditions. Coniferous forest types include the huge boreal forests in the northern hemisphere and the much smaller temperate rain forests, such as America's Pacific Northwest. A large number of animal species make their home in coniferous forests. A wide variety of mammals, invertebrates, and birds live in the coniferous forest"}]