[{"url": "https://en.wikipedia.org/wiki/River_Erne", "passage_text": "It rises on the east shoulder of Slieve Glah mountain three miles south of Cavan in County Cavan and flows 80 miles (129km) through Lough Gowna, Lough Oughter and Upper and Lower Lough Erne, County Fermanagh, to the sea at Ballyshannon, County Donegal. The River Erne (Irish: Abhainn na hÉirne héirne Or Éirne), eirne éirne in the Northwest, of ireland is-the second longest River. in ulster"}, {"url": "https://www.cruise-ireland.com/the-irish-experience/shannon-and-erne/", "passage_text": "Shannon and Erne. The Shannon and the Erne. The River Shannon is the longest river in Ireland running over 380km (240 miles) from the Shannon Pot in County Cavan to the sea at Limerick. The river is navigable for most of its length from Lough Allen to Killaloe and provides one of the most peaceful waterways in Europe. There are plenty of places to visit, including some of the best heritage sites in Ireland. The picturesque Kesh River winds through fields to the tiny village of Kesh with a hotel, shops and pubs. The lowest point of navigation on the Erne is the village of Belleek where you can visit the world-famous pottery."}, {"url": "https://en.wikipedia.org/wiki/River_Shannon", "passage_text": "At a total length of 360.5 km (224 miles), this means it is the longest river in Ireland. That the Shannon is the longest river in the wider British Isles was evidently known in the 12th century, although a map of the time showed this river as flowing out of the south of Ireland. Limerick is the end point of the river, where it flows into the Shannon Estuary. Though the Shannon has always been important for navigation in Ireland, there is a fall of only 18 m (60 ft) in the first 250 Km (140 miles)."}, {"url": "https://en.wikipedia.org/wiki/River_Shannon", "passage_text": "The River Shannon (Irish: Abha na Sionainne / an tSionainn / an tSionna) is the longest river in Ireland at 360.5 km (224 miles). The River Shannon drains the Shannon River Basin which has an area of 16,865 km 2 (6,512 ml 2), one fifth of the area of Ireland. Limerick is the end point of the river, where it flows into the Shannon Estuary. Though the Shannon has always been important for navigation in Ireland, there is a fall of only 18 m (60 ft) in the first 250 Km (140 miles)."}, {"url": "http://www.worldwide-river-cruise.com/info/ni-tours/lougherne.html", "passage_text": "Lough Erne refers to two lakes in Northern Ireland, situated along the River Erne. The waterway is mostly situated in County Fermanagh. The river begins by flowing north, and then curves west into the Atlantic. The southern-most lake is further up the river and so is named Upper Lough Erne. 1 0.0 km Belturbet-Belturbet is a lively and bustling town on the River Erne. 2  there is a good selection of shops, restaurants and pubs here. 3  There is also plenty to do in Belturbet with Bike hire, a 9 hole golf course and a 13th century Anglo-Norman motte and bailey on Turbet Island."}, {"url": "https://en.wikipedia.org/wiki/River_Erne", "passage_text": "The river is 120 kilometres long and is very popular for fly fishing for trout and salmon, with a number of fisheries along both the river itself and its tributaries. The town of Enniskillen is mostly situated on an island in the river, between Upper and Lower Lough Erne. It is linked to the River Shannon by the Shannon–Erne Waterway. The total catchment area of the River Erne is 4,372 km 2. The long-term average flow rate of the River Erne is 101.7 cubic metres per second (m 3 /s). The River Erne (Irish: Abhainn na hÉirne héirne Or Éirne), eirne éirne in the Northwest, of ireland is-the second longest River. in ulster"}, {"url": "http://www.worldwide-river-cruise.com/info/ni-tours/lougherne.html", "passage_text": "The northern lake is Lower Lough Erne. A canal exists between the upper end of the River Shannon and the River Erne, allowing boat movements from the Shannon estuary in South West Ireland. Lough Erne is a particularly scenic waterway in Ireland, it is renowned for the beautiful setting. The area is also popular for angling. 1 0.0 km Belturbet-Belturbet is a lively and bustling town on the River Erne. 2  there is a good selection of shops, restaurants and pubs here. 3  There is also plenty to do in Belturbet with Bike hire, a 9 hole golf course and a 13th century Anglo-Norman motte and bailey on Turbet Island."}, {"url": "http://www.lookaroundireland.com/ireland-travel-guide/rivers-of-ireland/", "passage_text": "The Erne. The River Erne is located in the north-west of Ireland, rising in Beaghy Lough in County Cavan and flowing in a general north-westerly direction. It is approximately 120 kilometres in length and winds its way through a number of loughs including Upper and Lower Lough Erne. The Bann is the longest river in Northern Ireland, stretching a total of 129 kilometres from the Mourne Mountains in County Down to the northern coast of Ireland, entering the Atlantic Ocean at Portstewart."}, {"url": "http://www.seomraranga.com/dev/wp-content/uploads/2010/08/river_shannon.ppt", "passage_text": "The Shannon-Erne Waterway is a canal linking the River Shannon in the Republic of Ireland with the River Erne in Northern Ireland. It is managed by Waterways Ireland. The canal is 63 km (39 mi) in length, has sixteen locks and runs from Leitrim village in County Leitrim to Upper Lough Erne in County Fermanagh. "}]