[{"url": "http://oregonorchidsociety.org/education/what-is-an-orchid", "passage_text": "The orchid family (aka Orchidaceae) is the largest flowering plant family on earth with about 30,000 species. It is also one of the oldest plant families – developing about 84 million years ago. Being so old, orchids have had plenty of time to develop into very specialized organisms. LIP. All orchids have a petal that forms a lip. For the pollinator, the lip often serves as a landing pad of sorts. Most orchids turn in the development of the bud so that the lip is at the bottom of the flower but some have a lip at the top and are called “non-resupinate”."}, {"url": "https://en.wikipedia.org/wiki/Orchidaceae", "passage_text": "Regardless, the number of orchid species nearly equals the number of bony fishes and more than twice the number of bird species, and about four times the number of mammal species. The family also encompasses about 6–11% of all seed plants. Orchidaceae are well known for the many structural variations in their flowers. Some orchids have single flowers, but most have a racemose inflorescence, sometimes with a large number of flowers."}, {"url": "https://en.wikipedia.org/wiki/Orchid_(color)", "passage_text": "Orchid is a bright rich purple color that is a representation of the color of the orchidaceae flower. Various tones of orchid may range from grayish purple to purplish-pink to strong reddish purple. The first recorded use of orchid as a color name in English was in 1915. In 1987, orchid was included as one of the X11 colors."}, {"url": "http://oregonorchidsociety.org/education/what-is-an-orchid", "passage_text": "Asters vs. Orchids…. Orchids are debatably the largest flowering plant family on Earth (30,000+ species). The only other contender for that title would be the aster family, Asteraceae, which is a much later development in terms of evolutionary history (42 MYA). This family includes asters, dandelions and daisies. LIP. All orchids have a petal that forms a lip. For the pollinator, the lip often serves as a landing pad of sorts. Most orchids turn in the development of the bud so that the lip is at the bottom of the flower but some have a lip at the top and are called “non-resupinate”."}, {"url": "http://www.teleflora.com/orchids/cat210155", "passage_text": "When buying orchids, the most common varieties are the phalaenopsis (moth orchid), the vanda, paphiopedilum (slipper orchid), or the dendrobium (Singapore orchid). Many decorative forms of orchids are grown specifically to be used as cut flowers. Despite being native to tropical regions, orchids actually don't need that much watering. For best results, water the plant every five to 12 days, depending on the type of orchid, the temperature it resides in and what time of year it is."}, {"url": "http://www.merriam-webster.com/dictionary/orchid", "passage_text": "Full Definition of ORCHID. 1. : any of a large family (Orchidaceae, the orchid family) of perennial epiphytic or terrestrial monocotyledonous plants that usually have showy 3-petaled flowers with the middle petal enlarged into a lip and differing from the others in shape and color. 2. : a light purple. "}, {"url": "http://www.gardeners.com/how-to/growing-orchids/5072.html", "passage_text": "1 Most orchids bloom once a year, but if they are really happy, they may bloom more often. 2  If you want an orchid that blooms during a particular season, the best bet is to purchase a plant that is in bloom at that time. 3  When an orchid does flower it usually remains in bloom for six to ten weeks. "}, {"url": "https://simple.wikipedia.org/wiki/Orchid_%28color%29", "passage_text": "Orchid is a bright rich purple color that resembles the color of some orchids. Various tones of orchid may range from grayish purple to purplish-pink to strong reddish purple. The first written use of orchid as a color name in English was in 1915. In 1987, orchid was included as one of the X11 colors. "}, {"url": "https://en.wikipedia.org/wiki/Orchidaceae", "passage_text": "The leaves of most orchids are perennial, that is, they live for several years, while others, especially those with plicate leaves as in Catasetum, shed them annually and develop new leaves together with new pseudobulbs. The leaves of some orchids are considered ornamental. Orchidaceae are well known for the many structural variations in their flowers. Some orchids have single flowers, but most have a racemose inflorescence, sometimes with a large number of flowers."}]