[{"url": "http://www.dietitians.ca/Your-Health/Nutrition-A-Z/Minerals/Food-Sources-of-Phosphorus.aspx", "passage_text": "*This includes sources of phosphorus from food and supplements. Phosphorus is found in high amounts in protein foods such as milk and milk products and meat and alternatives, such as beans, lentils and nuts. Grains, especially whole grains provide phosphorus. Phosporus is found in smaller amounts in vegetables and fruit. Information About Phosphorus. 1  Phosphorus is a mineral that is part of every cell in your body. 2  Phosphorus works with calcium and other nutrients to build healthy bones and teeth. 3  Phosphorus also helps maintain normal acid/base balance, supports growth, and is involved with the storage and use of energy."}, {"url": "http://www.vitaminsdiary.com/minerals/phosphorus.html", "passage_text": "Information on Deficiency, Benefits, Food Sources. Phosphorus is a mineral colleague of calcium within the body. A proper balance of phosphorus must be present in the bloodstream for good teeth and bones or nourish the brain and nerves."}, {"url": "http://www.vitaminsdiary.com/minerals/phosphorus.html", "passage_text": "Phosphorus Sources-Rich food in phosphorus. The most important food sources of phosphorus are whole grain cereals, milk, and fish. Vegetables such as carrots, and leafy vegetables; fruits like black currants, raspberries, raisins, and apricots are fairly good sources. Other sources of this mineral are soya beans, lentils, and other pulses and legumes. Phosphorus is a mineral colleague of calcium within the body. A proper balance of phosphorus must be present in the bloodstream for good teeth and bones or nourish the brain and nerves."}, {"url": "http://health.learninginfo.org/phosphorus.htm", "passage_text": "and Food Sources. Phosphorus is a mineral that is a vital part of healthy living, but it is often forgotten in the long list of vitamins and minerals that keep us healthy. It is important to be aware of your phosphorus intake to ensure you are getting the proper amount in your diet to stay healthy. Phosphorus Mineral: Functions, Benefit"}, {"url": "https://healthychildren.org/English/healthy-living/nutrition/Pages/Minerals-Calcium-Phosphorus-and-Magnesium.aspx", "passage_text": "Phosphorus is in almost all animal and vegetable foods and is often found in foods that contain calcium. Milk and dairy products, fish bones (such as in canned salmon and sardines), and dark-green, leafy vegetables are the best sources of calcium. Magnesium, like phosphorus, is abundant in animal and plant cells. Three minerals— calcium, phosphorus, and magnesium—account for 98% of the body’s mineral content by weight. Calcium and phosphorus play basic roles in countless biochemical reactions at the cellular level."}, {"url": "http://www.healthylivinganswers.com/vitamins/phosphorus-mineral.html", "passage_text": "Phosphorus Sources. Good Phosphorus sources include many of the same foods that contain Calcium. Milk, hard cheese, yogurt, eggs, canned fish, chicken, red meat, nuts, walnuts, almonds, whole wheat and wheat germ and pumpkin seeds are all good sources. The RDA of Phosphorus is 1,000 mg for adults. Within the body, up to 80% of the Phosphorus mineral can be found in the teeth and the bones. Working together, both the calcium mineral and phosphorus are responsible for ensuring proper bone growth and maintenance. Within the bones and teeth, the Phosphorus mineral is present as calcium phosphate."}, {"url": "http://lpi.oregonstate.edu/mic/minerals/phosphorus", "passage_text": "Dairy foods, cereal products, meat, and fish are particularly rich sources of phosphorus (7) . Phosphorus is also a component of many food additives that are used in food processing and is present in cola soft drinks as phosphoric acid (8) . 1 Phosphorus is found in most food sources and is a component of many commonly used food additives. 2  The bioavailability of phosphorus from food is usually very high with the exception of phytate phosphorus in plant sources, such as grains, legumes, and seeds, which is poorly digested. ( 3 More information)."}, {"url": "https://www.sharecare.com/health/mineral-phosphorus/what-is-phosphorus", "passage_text": "Phosphorus is a mineral found mostly in foods like beans, nuts, dairy products, fish, chicken and other meats. A Stacy Wiegman, PharmD, Pharmacy, answered. Phosphorus is a mineral found mostly in foods like beans, nuts, dairy products, fish, chicken and other meats. Its primary function in the human body is building and strengthening bones and teeth."}]