[{"url": "http://minecraft-mp.com/type/faction/", "passage_text": "Minecraft Faction servers are like a clan server, create your faction or join one and fight or raid other factions. Minecraft-mp.com is not affiliated with Minecraft and Mojang AB. Welcome on the top Minecraft server list. Find all the best Minecraft multiplayer servers on Minecraft-mp.com."}, {"url": "http://www.youtube.com/user/TheCampingRusher", "passage_text": "Minecraft Factions Server Let's Play Ep 601 - Minecraft Factions is a gamemode where you must learn how to team up with friends and create your very own group or  Faction  and as a team, you attempt to raid and take down other faction groups on your quest to becoming the strongest and richest players on the server. Minecraft Factions Server Let's Play Ep 675 - Minecraft Factions is a gamemode where you must learn how to team up with friends and create your very own group or  Faction  and as a team, you atte... 12:31"}, {"url": "http://www.youtube.com/user/TheCampingRusher", "passage_text": "TheCampingRusher plays Minecraft Factions on TheArchon Server with ChildDolphin and Mrmitch361. Stay up to date with this Minecraft Faction Server Let's Play because there is a new episode every day! Minecraft Factions Server Let's Play Ep 675 - Minecraft Factions is a gamemode where you must learn how to team up with friends and create your very own group or  Faction  and as a team, you atte... 12:31."}, {"url": "http://minecraft-server-list.com/sort/Factions/", "passage_text": "Minecraft Factions Servers. This is the Minecraft Faction servers. The use of Factions will give players the ability to form guilds / clan / factions with friends and fellow players. Protect property that belongs to the faction. Some servers also split up the factions so you can take part in sides. "}, {"url": "http://www.youtube.com/playlist?list=PLDzzbNR8UfN2NlIfGj0AkhEieRD6wsRq_", "passage_text": "TheCampingRusher plays Minecraft Factions on TheArchon Server with ChildDolphin and Mrmitch361. Stay up to date with this Minecraft Faction Server Let's Play because there is a new episode every day! Minecraft FACTIONS Server Lets Play-EBAY ALT ACCOUNT SCAM!!- Ep. 638 (Minecraft Faction)."}, {"url": "http://cubemc.wikia.com/wiki/TheCampingRusher", "passage_text": "Factions on the Archon. Rusher, ChildDolphin and MrMitch361 play factions on their server, the Archon as TeamNudist, which is now known as Famil1y although the name is speculated to soon change. Other friends include RumbleCrumble, also a member of TeamNudist, who has now left the show but is planned to come back one day. TheCampingRusher, more commonly known as Rusher, (and Brayden by close friends) is a Canadian Minecrafter and YouTuber. Rusher is a real life friend of MrMitch361 and ChildDolphin. Rusher is a member of the Cube group and plays on The Cube SMP, UHC and Cube Evolution servers."}, {"url": "http://www.youtube.com/user/TheCampingRusher", "passage_text": "Minecraft Factions Server Let's Play Ep 677 - Minecraft Factions is a gamemode where you must learn how to team up with friends and create your very own group or  Faction  and as a team, you atte... Minecraft Factions Server Let's Play Ep 675 - Minecraft Factions is a gamemode where you must learn how to team up with friends and create your very own group or  Faction  and as a team, you atte... 12:31"}, {"url": "http://www.youtube.com/playlist?list=PLDzzbNR8UfN2NlIfGj0AkhEieRD6wsRq_", "passage_text": "Minecraft FACTIONS Server Lets Play-RICHEST MAN HAS 400 MILLION $! - Ep. 689 (Minecraft Faction). Minecraft FACTIONS Server Lets Play-EBAY ALT ACCOUNT SCAM!!- Ep. 638"}, {"url": "http://minecraft-mp.com/type/faction/", "passage_text": "Minecraft Faction Servers. Servers: 6210. Minecraft Faction servers are like a clan server, create your faction or join one and fight or raid other factions. Usually griefing is allowed, but some servers don't allow it. Minecraft-mp.com is not affiliated with Minecraft and Mojang AB. Welcome on the top Minecraft server list. Find all the best Minecraft multiplayer servers on Minecraft-mp.com."}]