[{"url": "https://en.wikipedia.org/wiki/Glucosamine", "passage_text": "In the first study, glucosamine sulfate was given to healthy volunteers at a range of doses (750, 1500 and 3000 mg) once daily. In the second study, oral glucosamine sulfate capsules (1500 mg) were given daily for two weeks to 12 patients with osteoarthritis. Glucosamine concentrations in plasma and synovial fluid increased significantly from baseline levels and the levels in the two fluids were highly correlated. Commonly sold forms of glucosamine are glucosamine sulfate, glucosamine hydrochloride, and N-acetylglucosamine. Glucosamine is often sold in combination with other supplements such as chondroitin sulfate and methylsulfonylmethane."}, {"url": "http://www.mayoclinic.org/drugs-supplements/glucosamine/dosing/HRB-20059572", "passage_text": "To treat bone diseases (Kashin-Beck disease), 480 milligrams of glucosamine hydrochloride has been taken by mouth three times daily for six months, as well as 750 milligrams of glucosamine hydrochloride by mouth twice daily for six weeks. Up to 400 milligrams of glucosamine has also been injected into the joint, vein, or muscle for varying durations. To treat rheumatoid arthritis, 420 milligrams of Teoremac® has been taken by mouth daily for 14 days. Glucosamine is not suggested in children, due to lack of data."}, {"url": "https://www.sharecare.com/health/glucosamine/how-much-glucosamine-should-take", "passage_text": "1 In most available studies, 500 milligrams of glucosamine sulfate has been taken by mouth as tablets or capsules three times daily for 30 to 90 days. 2  Once daily dosing as 1.5 grams (1,500 milligrams) has also been used. Adults (18 years and older): 1  In most available studies, 500 milligrams of glucosamine sulfate has been taken by mouth as tablets or capsules three times daily for 30 to 90 days."}, {"url": "http://www.mayoclinic.org/drugs-supplements/glucosamine/dosing/HRB-20059572", "passage_text": "To treat knee osteoarthritis, 300-500 milligrams of glucosamine sulfate or 480 milligrams of glucosamine hydrochloride has been taken by mouth three times daily for up to 12 weeks. To treat low back pain, 1500 milligrams of glucosamine has been taken by mouth daily for six months. Up to 400 milligrams of glucosamine has also been injected into the joint, vein, or muscle for varying durations. To treat rheumatoid arthritis, 420 milligrams of Teoremac® has been taken by mouth daily for 14 days. Glucosamine is not suggested in children, due to lack of data."}, {"url": "http://www.mayoclinic.org/drugs-supplements/glucosamine/dosing/HRB-20059572", "passage_text": "To treat high cholesterol, 1,500 milligrams of glucosamine, 1,527 milligrams of glucosamine sulfate (equivalent to 1,200 milligrams glucosamine), or 750 milligrams glucosamine hydrochloride (equal to 625 milligrams glucosamine) has been taken by mouth daily for up to 14 weeks. Up to 400 milligrams of glucosamine has also been injected into the joint, vein, or muscle for varying durations. To treat rheumatoid arthritis, 420 milligrams of Teoremac® has been taken by mouth daily for 14 days. Glucosamine is not suggested in children, due to lack of data."}, {"url": "http://www.naturopathydigest.com/nutrition_herbs/vitamins/glucosamine.php", "passage_text": "For the symptoms of osteoarthritis, most adults take 500 milligrams of glucosamine sulfate three times per day. It is often taken in conjunction with chondroitin sulfate and manganese ascorbate. "}, {"url": "http://www.mayoclinic.org/drugs-supplements/glucosamine/safety/HRB-20059572", "passage_text": "Side Effects and Warnings. Glucosamine is likely safe when taken by mouth in studied doses (500 milligrams three times daily up to 90 days or 1,500 milligrams once daily up to six months) for a short time by healthy adults. "}, {"url": "http://www.glucosaminefordogshq.com/how-much-glucosamine-for-dogs/", "passage_text": "Pet owners often wonder how much glucosamine for dogs would be the best dosage. Well, the dosage will depend on many factors including the severity of the problem, the weight of your canine, the breed, and its age. Arthritis is a common ailment among dogs, and about 30% of canines suffer from this disease."}, {"url": "http://www.glucosaminefordogshq.com/how-much-glucosamine-for-dogs/", "passage_text": "Usually sulfate and hydrochloride are the best forms of glucosamine, and we will be considering these forms for the dosage. Generally, it is recommended that you administer per day, 20 mg of the supplement, per pound of your dog’s weight. So if your dog weighs fifty pounds, 1000 mg would be sufficient per day. Well, the dosage will depend on many factors including the severity of the problem, the weight of your canine, the breed, and its age. Arthritis is a common ailment among dogs, and about 30% of canines suffer from this disease."}]