[{"url": "http://www.endocrineweb.com/endocrinology/overview-adrenal-glands", "passage_text": "1 The adrenal cortex—the outer part of the gland—produces hormones that are vital to life, such as cortisol (which helps regulate metabolism and helps your body respond to stress) and aldosterone (which helps control blood pressure). When you think of the adrenal glands (also known as suprarenal glands), stress might come to mind. And rightly so—the adrenal glands are arguably best known for secreting the hormone adrenaline, which rapidly prepares your body to spring into action in a stressful situation."}, {"url": "http://www.webmd.com/a-to-z-guides/features/adrenal-fatigue-is-it-real", "passage_text": "Reviewed by Brunilda Nazario, MD. Adrenal fatigue is a term that's used by some to say that fatigue and other symptoms are caused by a poorly working adrenal gland in people who are under mental, emotional, or physical stress. But it's not a proven medical condition. Your adrenal glands make hormones. One of these is cortisol, which helps your body deal with stress. According to the adrenal fatigue theory, if your life is too stressful, your adrenal glands may not pump out enough hormones, leading to a wide variety of symptoms. But there's no evidence to support this theory. "}, {"url": "https://en.wikipedia.org/wiki/Adrenal_gland", "passage_text": "The adrenal glands (also known as suprarenal glands) are endocrine glands that produce a variety of hormones including adrenaline and the steroids aldosterone and cortisol. They are found above the kidneys and consist of a series of layers with different structure and functions. The adrenal cortex itself is divided into three zones: zona glomerulosa, the zona fasciculata and the zona reticularis. The adrenal cortex produces a class of steroid hormones called corticosteroids, named according to their effects."}, {"url": "https://adrenalfatigue.org/what-is-adrenal-fatigue/", "passage_text": "What is adrenal fatigue? Adrenal fatigue is a collection of signs and symptoms, known as a syndrome, that results when the adrenal glands function below the necessary level. "}, {"url": "http://www.news-medical.net/health/What-Does-the-Adrenal-Gland-Do.aspx", "passage_text": "The adrenal cortex secretes corticosteroids, such as glucocorticoids and mineralocorticoids. These hormones are responsible for responding to stress; using carbohydrates, fats and proteins; and regulating the salt and water balance in the body. Shape and structure. In human beings the right adrenal gland is triangular shaped while the left suprarenal gland is shaped like half a moon or semilunar in shape. Each of the glands are around 4 to 6 cm in length."}, {"url": "https://www.nichd.nih.gov/health/topics/adrenalgland/conditioninfo/Pages/default.aspx", "passage_text": "The adrenal glands, located on the top of each kidney, are responsible for releasing different classes of hormones. The outer part of the gland, called the adrenal cortex, produces the hormones cortisol (pronounced KAWR-tuh-sohl) and aldosterone (pronounced al-DOS-tuh-rohn). The inner part of the gland, called the adrenal medulla (pronounced muh-DUHL-uh), produces the hormones adrenaline and noradrenaline."}, {"url": "http://www.cancer.org/cancer/adrenalcorticalcancer/detailedguide/adrenal-cortical-cancer-what-is-adrenal-cortical-cancer", "passage_text": "1 Adrenal androgens are hormones which can be converted to more common forms of the sex hormones estrogen and testosterone in other parts of the body. 2  The amount of these hormones that result from conversion of adrenal androgens is small compared to what is made in other parts of the body. The adrenals are small glands that sit above each of the kidneys. The kidneys are located deep inside the upper part of the abdomen. The adrenal gland has 2 parts. The outer part, called the cortex, is where most tumors develop."}, {"url": "https://en.wikipedia.org/wiki/Adrenal_gland", "passage_text": "Corticosteroids are a group of steroid hormones produced from the cortex of the adrenal gland, from which they are named. Corticosteroids are named according to their actions: 1  Mineralocorticoids such as aldosterone regulate salt (mineral) balance and blood volume. The adrenal cortex itself is divided into three zones: zona glomerulosa, the zona fasciculata and the zona reticularis. The adrenal cortex produces a class of steroid hormones called corticosteroids, named according to their effects."}, {"url": "http://www.endocrineweb.com/endocrinology/your-adrenal-glands", "passage_text": "The adrenal glands are orange-colored endocrine glands which are located on the top of both kidneys. The adrenal glands are triangular shaped and measure about one-half inch in height and 3 inches in length. Each gland consists of a medulla (the center of the gland) which is surrounded by the cortex. The medulla is responsible for producing epinephrine and norepinephrine (adrenaline). The adrenal cortex produces other hormones necessary for fluid and electrolyte (salt) balance in the body such as cortisone and aldosterone. The indications for surgical removal of the adrenal gland are relatively straightforward and include, but are not limited to the following: 1  Tumors of the adrenal cortex which overproduce hormones. 2  One such tumor is shown in the picture...it is the round yellow mass located within the triangular adrenal gland."}]