[{"url": "http://www.everydayhealth.com/drugs/augmentin", "passage_text": "Augmentin is the brand name of a combination antibiotic drug containing amoxicillin and clauvulanate. It's used to treat bacterial infections in your airways, such as a sinus infection or pneumonia. "}, {"url": "http://antibiotics.emedtv.com/augmentin/augmentin.html", "passage_text": "Augmentin ® (amoxicillin and clavulanate potassium) is a prescription antibiotic medication. It is used to treat a variety of infections. Augmentin ES -600 ® and Augmentin XR ® are similar but slightly different products. This article applies only to regular Augmentin products (not ES or XR). "}, {"url": "http://livertox.nih.gov/AmoxicillinClavulanate.htm", "passage_text": "The combination of amoxicillin and clavulanate is an oral antibiotic widely used in the treatment of mild-to-moderate bacterial infections including sinusitis, bronchitis, otitis media, cellulitis and community acquired pneumonia. The combination consists of amoxicillin which is a semisynthetic, third generation penicillin and clavulanate which is a beta lactam that acts as an inhibitor of beta lactamase, the major bacterial enzyme responsible for penicillin resistance."}, {"url": "https://en.wikipedia.org/wiki/Augmentin", "passage_text": "Amoxicillin/clavulanic acid (INN) or co-amoxiclav (BAN) is an antibiotic useful for the treatment of a number of bacterial infections. It is a combination antibiotic consisting of amoxicillin trihydrate, a β-lactam antibiotic, and potassium clavulanate, a β-lactamase inhibitor. Amoxicillin/clavulanic acid is widely used to treat or prevent many infections caused by susceptible bacteria, such as: 1  urinary tract infections. 2  respiratory tract infections. 3  skin and soft tissue"}, {"url": "http://livertox.nih.gov/AmoxicillinClavulanate.htm", "passage_text": "The combination of amoxicillin and clavulanate is a commonly used antibiotic which is active against many bacterial organisms that cause sinusitis, bronchitis, otitis media, skin and tissue infections and community acquired pneumonia. The combination consists of amoxicillin which is a semisynthetic, third generation penicillin and clavulanate which is a beta lactam that acts as an inhibitor of beta lactamase, the major bacterial enzyme responsible for penicillin resistance."}, {"url": "http://www.rxlist.com/augmentin-drug.htm", "passage_text": "DRUG DESCRIPTION. AUGMENTIN is an oral antibacterial combination consisting of amoxicillin and the beta-lactamase inhibitor, clavulanate potassium (the potassium salt of clavulanic acid). Amoxicillin is an analog of ampicillin, derived from the basic penicillin nucleus, 6-aminopenicillanic acid. "}, {"url": "http://www.goodrx.com/augmentin/what-is", "passage_text": "Uses For Augmentin. Amoxicillin and clavulanate combination is used to treat bacterial infections in many different parts of the body. Amoxicillin and clavulanate combination is an antibiotic that belongs to the group of medicines known as penicillins and beta-lactamase inhibitors."}, {"url": "http://www.webmd.com/drugs/2/drug-4333/augmentin-oral", "passage_text": "AMOXICILLIN/CLAVULANIC ACID CHEWABLE TABLET-ORAL. AMOXICILLIN/CLAVULANIC ACID SUSPENSION-ORAL. The medication you searched for has more than one listing. Multiple listings, which are compiled by generic name indicate a drug is available in more than one dose or in different forms, such as tablets, liquid or injection."}, {"url": "http://www.rxlist.com/augmentin-side-effects-drug-center.htm", "passage_text": "Augmentin (amoxicillin/clavulanate) is a combination antibiotic used to treat bacterial infections including sinusitis, pneumonia, ear infections, bronchitis, urinary tract infections, and infections of the skin. Side effects of Augmentin (amoxicillin/clavulanate) can include. 1  nausea, 2  vomiting, 3  headache, "}, {"url": "http://antibiotics.emedtv.com/augmentin/what-is-augmentin-prescribed-for.html", "passage_text": "Augmentin ® (amoxicillin and clavulanate potassium) is prescribed for treating a wide variety of infections, such as: 1  Lower respiratory tract infections, such as pneumonia. 2  Ear infections. 3  Sinus infections. "}]