[{"url": "http://emedicine.medscape.com/article/1159069-overview", "passage_text": "Background. Meniere ménière disease is a disorder of the inner ear that is also known as idiopathic endolymphatic. Hydrops endolymphatic hydrops refers to a condition of increased hydraulic pressure within the inner ear endolymphatic. system Similarly, when the cause of vertigo is known, Meniere ménière disease is not the. Diagnosis in other, Words meniere ménière syndrome is endolymphatic hydrops caused by a, specific Condition and meniere ménière disease is endolymphatic hydrops (of, unknown etiology ie). idiopathic"}, {"url": "http://www.medtronic.com/patients/menieres-disease/index.htm", "passage_text": "Definition. Meniere’ménière s disease is an inner ear condition that causes dizziness or, vertigo hearing, loss and ringing in the (ears). Tinnitus Many’meniere ménière s disease patients also have a feeling of pressure in. the ear What initially causes Meniere’ménière s disease is. Unknown But’meniere ménière s disease patients have too much fluid in the. Inner ear, this fluid, called endolymph sends messages to the brain about your hearing. And balance too much endolymph can cause swelling in the. inner ear"}, {"url": "http://www.affoto.com/eardisease.html", "passage_text": "Meniere'menière s disease is caused by an imbalance in the fluid in the sacs in the inner. Ear when the sacs of the endolymphatic system of the inner balloon within the inner, ear a sudden hearing, loss, vertigo (ringing), tinnitus/and or pressure in the ear. occur Go to Patient Comment Page. Ear Diseases. Ear disease causes significant discomfort and hearing loss. It also creates work loss and decreased productivity-- this increases as the persons communicative skills decrease when associated hearing loss increases. In children, developmental delays and academic failure may result."}, {"url": "http://www.medtronic.com/patients/menieres-disease/index.htm", "passage_text": "Definition. Meniere’ménière s disease is an inner ear condition that causes dizziness or, vertigo hearing, loss and ringing in the (ears). Tinnitus Many’meniere ménière s disease patients also have a feeling of pressure in. The Ear’usually meniere ménière s disease, affects one ear but can. occur in both What initially causes Meniere’ménière s disease is. Unknown But’meniere ménière s disease patients have too much fluid in the. Inner ear, this fluid, called endolymph sends messages to the brain about your hearing. And balance too much endolymph can cause swelling in the. inner ear"}, {"url": "http://vestibular.org/autoimmune-inner-ear-disease-aied", "passage_text": "Autoimmune inner ear disease (AIED) is the name used to describe the variety of disorders in which the ear is the sole target of an inappropriate attack by the immune system. This disorder differs from other vestibular disorders because medical treatment can succeed when given early and aggressively. The symptoms of autoimmune problems can be similar, even indistinguishable, from other vestibular disorders. Diagnosing an autoimmune disorder as the cause of inner ear symptoms can be difficult. To succeed, a physician must have training and experience in these"}, {"url": "http://www.entnet.org/content/autoimmune-inner-ear-disease", "passage_text": "Autoimmune inner ear disease (AIED) is an inflammatory condition of the inner ear. It occurs when the body's immune system attacks cells in the inner ear that are mistaken for a virus or bacteria. AIED is a rare disease occurring in less than one percent of the 28 million Americans with a hearing loss. "}, {"url": "http://www.mayoclinic.org/diseases-conditions/menieres-disease/basics/causes/CON-20028251", "passage_text": "The cause of Meniere's disease isn't well understood. It appears to be the result of the abnormal volume or composition of fluid in the inner ear. The inner ear is a cluster of connected passages and cavities called a labyrinth. Factors that alter the properties of inner ear fluid may help cause Meniere's disease. Scientists have proposed a number of potential causes or triggers, including: 1  Improper fluid drainage, perhaps because of a blockage or anatomic abnormality. 2  Abnormal immune response."}, {"url": "http://american-hearing.org/disorders/autoimmune-inner-ear-disease-aied/", "passage_text": "Autoimmune inner ear disease (AIED) is a syndrome of progressive hearing loss and/or dizziness that is caused by antibodies or immune cells which are attacking the inner ear. 1 This theory might explain the attack/remission cycle of disorders such as Meniere’s disease. 2  Cross-reactions: Antibodies or rogue T-cells cause accidental inner ear damage because the ear shares common antigens with a potentially harmful substance, virus, or bacteria that the body is fighting off."}, {"url": "http://www.webmd.com/brain/vertigo-symptoms-causes-treatment", "passage_text": "Meniere's disease. This is an inner ear disorder thought to be caused by a buildup of fluid and changing pressure in the ear. It can cause episodes of vertigo along with ringing in the ears (tinnitus) and hearing loss. Vestibular neuritis or labyrinthitis."}]