[{"url": "https://en.wikipedia.org/wiki/Cimetidine", "passage_text": "In a deal expected to take effect in 2012, GlaxoSmithKline sold Tagamet and 16 other brands to Prestige Brands. Tagamet has now been largely replaced by the proton pump inhibitors for treating peptic ulcers, but is now available as an over-the-counter medicine for heartburn in many countries. Cimetidine, approved by the FDA for inhibition of gastric acid secretion, has been advocated for a number of dermatological diseases. Cimetidine was the prototypical histamine H2-receptor antagonist from which the later members of the class were developed."}, {"url": "http://gerd.emedtv.com/cimetidine/cimetidine.html", "passage_text": "Cimetidine (Tagamet ®) is a medicine that is available as prescription medication and as an over-the-counter drug. It is used to treat several conditions related to the esophagus, stomach, and intestines. It is part of a class of drugs known as H2 blockers. "}, {"url": "http://gerd.emedtv.com/tagamet/generic-tagamet.html", "passage_text": "Generic Tagamet is available in over-the-counter and prescription forms. Tagamet ® (cimetidine) is a medication that has been licensed to treat several conditions of the esophagus, stomach, and intestines. It is part of a class of drugs known as H2 blockers. Generic Tagamet is available both over the counter and by prescription. Prescription Tagamet tablets were originally manufactured by GlaxoSmithKline, although they are no longer being made. Generic prescription Tagamet tablets and solution are still available. Over-the-counter Tagamet HB tablets are made by GlaxoSmithKline."}, {"url": "http://www.webmd.com/drugs/2/drug-11210/cimetidine-oral/details", "passage_text": "This medication is also available without a prescription. It is used to treat occasional heartburn caused by too much acid in the stomach (also called acid indigestion or sour stomach). It is also used to prevent heartburn and acid indigestion caused by certain foods and beverages. If any of these effects persist or worsen, notify your doctor or pharmacist promptly. If your doctor has directed you to use this medication, remember that he or she has judged that the benefit to you is greater than the risk of side effects. Many people using this medication do not have serious"}, {"url": "http://www.everydayhealth.com/drugs/cimetidine", "passage_text": "Cimetidine is the generic form of the brand name drug Tagamet, which is used to treat and prevent symptoms of heartburn. The medication is commonly taken by people with gastroesophageal reflux disease (GERD) and Zollinger-Ellison syndrome. Cimetidine is sometimes used to treat stress ulcers, hives, and itching. It can also be given to prevent aspiration pneumonia during anesthesia. The medicine comes in a prescription and over-the-counter (OTC) form. Cimetidine is an H2-blocker, which works by reducing acid in the stomach. The Food and Drug Administration (FDA) first approved this medicine in 1977. It's manufactured as Tagamet by Prestige Brands, Inc. Cimetidine (Tagamet) Dosage. Cimetidine comes as a tablet or liquid to take by mouth. Your dose will depend on your medical condition; whether you use the prescription or OTC form; and your response to treatment. The medicine is typically taken once a day at bedtime."}, {"url": "https://en.wikipedia.org/wiki/Cimetidine", "passage_text": "Cimetidine INN (/sɨˈmɛtɨdiːn/ or /saɪˈmɛtɨdiːn/) is a histamine H2-receptor antagonist that inhibits stomach acid production. It is largely used in the treatment of heartburn and peptic ulcers. It has been marketed by GlaxoSmithKline (which is selling the brand to Prestige Brands) under the trade name Tagamet (sometimes Tagamet HB or Tagamet HB200). Cimetidine, approved by the FDA for inhibition of gastric acid secretion, has been advocated for a number of dermatological diseases. Cimetidine was the prototypical histamine H2-receptor antagonist from which the later members of the class were developed."}, {"url": "http://www.knowyourotcs.org/ingredient/cimetidine/", "passage_text": "Cimetidine is an acid reducer active ingredient available in over-the-counter (OTC) medicines that relieve or prevent heartburn symptoms associated with acid indigestion and sour stomach. Cimetidine is part of a group of acid reducers called histamine-2 antagonists, or H2 blockers. "}, {"url": "http://www.webmd.com/drugs/2/drug-7035/tagamet-oral/details", "passage_text": "Cimetidine belongs to a class of drugs commonly called H2 blockers. It works by reducing the amount of acid in your stomach. This medication is also available without a prescription. It is used to treat occasional heartburn caused by too much acid in the stomach (also called acid indigestion or sour stomach). If any of these effects persist or worsen, notify your doctor or pharmacist promptly. If your doctor has directed you to use this medication, remember that he or she has judged that the benefit to you is greater than the risk of side effects."}, {"url": "http://gerd.emedtv.com/tagamet/generic-tagamet.html", "passage_text": "Generic Tagamet: An Overview. Tagamet ® (cimetidine) is a medication that has been licensed to treat several conditions of the esophagus, stomach, and intestines. It is part of a class of drugs known as H2 blockers. Generic Tagamet is available both over the counter and by prescription. Prescription Tagamet tablets were originally manufactured by GlaxoSmithKline, although they are no longer being made. Generic prescription Tagamet tablets and solution are still available. Over-the-counter Tagamet HB tablets are made by GlaxoSmithKline."}]