[{"url": "http://www.holiday-weather.com/st_lucia/averages/december/", "passage_text": "Weather lowdown. The weather continues to get cooler in St Lucia in December. During this month, the average temperature starts off at 27.5°C (created by highs of 30°C and lows of 25°C) on December 1 st and falls down to 27°C (highs of 29°C and lows of 25°C) gradually by December 31 st. The average sea temperature for St Lucia stays pleasantly warm throughout the year. In December, it’s 28°C – that’s the same as last month – which is certainly warm enough for a swim. Thanks to its tropical climate, St Lucia remains humid all-year-round."}, {"url": "http://www.surf-forecast.com/breaks/St-Lucia/seatemp", "passage_text": "St Lucia water temperatures peak in the range 26 to 28°C (79 to 82°F) on around the 4th of February and are at their lowest on about the 3rd of August, in the range 20 to 23°C (68 to 73°F). Year round warm water temperatures at St Lucia climb to their highest in early February. St Lucia water temperatures are lowest at the start of August. Surfers should use a 2mm long sleeve shorty or a 3/2mm spring wetsuit if the wind is up. Actual sea surface water temperatures close to shore at St Lucia can vary by several degrees compared with these open water averages."}, {"url": "http://www.holiday-weather.com/st_lucia/averages/december/", "passage_text": "Even though it only happens on an average of 10% of days, temperatures can sometimes rise above 30°C and fall below 22°C in St Lucia in December. The hottest temperature ever recorded on the island at this time of year is 33°C, whilst the coldest temperature ever registered here during this month is 16°C. The average sea temperature for St Lucia stays pleasantly warm throughout the year. In December, it’s 28°C – that’s the same as last month – which is certainly warm enough for a swim. Thanks to its tropical climate, St Lucia remains humid all-year-round."}, {"url": "http://www.caribeez.com/st-lucia/article/st_lucia_average_weather", "passage_text": "St. Lucia climate is typical for eastern Caribbean weather. It has monthly high temperatures average in the mid-80s Fahrenheit with only a few degrees of variation throughout the year. The average low temperatures hover around the mid-70s. But it's the rainfall that determines the popularity of each month with visitors. St. Lucia weather in February through May is part of a regular dry season. It has a rainy season from June until Decembe"}, {"url": "http://www.caribeez.com/st-lucia/article/st_lucia_average_weather", "passage_text": "St. Lucia weather in September and October is the worst part of the annual hurricane season. The number of rain days each month varies as well from a low of 12 in April to a high of at least 20 days from July through November. The average low temperatures hover around the mid-70s. But it's the rainfall that determines the popularity of each month with visitors. St. Lucia weather in February through May is part of a regular dry season."}, {"url": "http://www.weather2travel.com/climate-guides/south-africa/st-lucia.php", "passage_text": "The St Lucia, South Africa climate guide is perfect for planning your holiday. Monthly weather averages give the best indication of what the weather is usually like for every month of the year including figures for temperature, rainfall and sunshine."}, {"url": "http://www.holiday-weather.com/st_lucia/averages/", "passage_text": "St Lucia: Annual Weather Averages. November is the hottest month in St Lucia with an average temperature of 29°C (83°F) and the coldest is January at 26°C (79°F) with the most daily sunshine hours at 10 in March. The wettest month is September with an average of 193mm of rain. "}, {"url": "http://caribya.com/st.lucia/weather/", "passage_text": "The average temperature on St. Lucia ranges from 70 degrees Fahrenheit to the upper 90s. Humidity on the island averages between 70 and 90 percent throughout the year. December through January are generally the coolest months with the temperatures being in the mid 70s to mid 80s in degrees Fahrenheit. The summer months of June through August are the hottest on St. Lucia where temperatures in the mid to upper 90s Fahrenheit are not uncommon"}, {"url": "http://www.weather2travel.com/climate-guides/st-lucia/", "passage_text": "The St Lucia climate guide is perfect for planning your holiday. Monthly weather averages give the best indication of what the weather is usually like for every month of the year including figures for temperature, rainfall and sunshine. The St Lucia climate guide shown below is for Castries."}, {"url": "https://weatherspark.com/averages/33731/1/Castries-St-Lucia", "passage_text": "This report describes the typical weather at the George F. L. Charles Airport (Vigie Airport) (Castries, St. Lucia) weather station over the course of an average January. It is based on the historical records from 2008 to 2012. Earlier records are either unavailable or unreliable. "}]