[{"url": "https://www.purina.com/dogs/puppy-care/does-my-puppy-need-shots", "passage_text": "In the first three months of your puppy's life, your veterinarian will probably want to see your puppy every two or three weeks for vaccinations. Initial vaccinations for many diseases start at about six weeks and are repeated every two to three weeks until your puppy reaches 14 weeks of age."}, {"url": "http://www.bridgeveterinarygroup.co.uk/puppies-and-kittens/vaccination-schedule", "passage_text": "The earliest a puppy can be vaccinated is 6 weeks. If they are vaccinated that early then they must get their 2nd vaccination at 10 weeks of age. Our vaccination protocol has changed ever since the vaccine company developed a more comprehensive Leptospirosis vaccine."}, {"url": "https://uk.answers.yahoo.com/question/index?qid=20061105045730AA5aTTv", "passage_text": "Puppies should start their vaccinations at 8 weeks old. They should have vacciantions at 8 weeks, 12 weeks and 16 weeks. They can go out and about after their second vaccination. Vacciantions should NEVER be given until after a puppy has completed his 7 th week, but preferably at 8 weeks."}, {"url": "http://www.rspca.org.uk/adviceandwelfare/pets/general/vaccinating", "passage_text": "However, this protection only lasts a few weeks so they need regular vaccinations from an early age. Puppies are typically vaccinated at eight and 10 weeks, kittens at nine and 12 weeks, with an initial course of two injections. Your young pet should then be given a booster 12 months after their first vaccination. Rabbits need regular vaccinations too."}, {"url": "http://www.vetwest.com.au/pet-library/caring-for-your-dog-vaccinations-worming-flea-heartworm-feeding", "passage_text": "At 6-8 weeks of age puppies should receive their first vaccination; this is temporary and needs to be followed up with another one at 12 weeks. After the 12 week vaccination you can then take your puppy out in public areas."}, {"url": "http://dogs.about.com/od/veterinarycare/a/puppyvaccs.htm", "passage_text": "Puppy vaccines are typically first administered at about six to eight weeks of age, then repeated every three to four weeks until about four months of age. Some of these vaccines might be given together in one injection that is called a combination vaccine."}]