[{"url": "http://www.answers.com/Q/How_much_does_a_herbalist_make", "passage_text": "How much does a herbalist make? already exists. already exists as an alternate of this question. exists and is an alternate of. Who's your current celebrity crush? How is a herbalist different from a American doctor? Where is Amish herbalist Jake Schwartz located? How long of classes does it take to become a herbalist? What did herbalist in the ... I am a Master Herbalist. I got my diploma from the American College of Healthcare Sciences, at www.achs.edu. My program took me about 2 years to complete, but since it i … s distance learning and self-paced, you may be able to do it faster or slower, depending on your schedule and needs."}, {"url": "http://www.answers.com/Q/How_much_does_a_herbalist_make", "passage_text": "How much does Obama make or how much does he have? It's not illegal to ask: all public service employee salaries are public record! The POTUS earns a $400,000 anual personal salary along with a $50,000 expense account, $100,0 … 00 travel account, and $19,000 entertainment account for official use. I am a Master Herbalist. I got my diploma from the American College of Healthcare Sciences, at www.achs.edu. My program took me about 2 years to complete, but since it i … s distance learning and self-paced, you may be able to do it faster or slower, depending on your schedule and needs."}, {"url": "http://www.ehow.com/about_5583411_herbalist-salary.html", "passage_text": "Self-employed herbalists could make $60 to $280 per hour; if employed by a health store, the rates may be $8 to $15 an hour; those working as sales representatives could make $24,000 to $75,000 a year, according to medical-career-training.com. The salary for herbalists can range from $20,000 to $120,000, according to the American Herbalist Association."}, {"url": "http://www.answers.com/Q/How_much_does_a_herbalist_make", "passage_text": "How much money an herbalist earns can vary greatly. Those who work  in a health food store an earn $20,000 per year. Those who work in  sales can earn up to $75,000 per year … , and those who are self  employed can earn over $100,000 per year. I am a Master Herbalist. I got my diploma from the American College of Healthcare Sciences, at www.achs.edu. My program took me about 2 years to complete, but since it i … s distance learning and self-paced, you may be able to do it faster or slower, depending on your schedule and needs."}, {"url": "http://www.naturalhealers.com/alternative-medicine/salary/", "passage_text": "Find out how much you can earn in the alternative medicine field and what your job prospects look like. According to the Bureau of Labor Statistics (BLS) latest salary updates, health diagnosing and treating practitioners earn a median annual salary of $72,710. NDs just starting out who and building a client base or have an early residency position may earn between $20,000 and $30,000 per year, according to the AANMC. But the chance to earn more is certainly there."}, {"url": "http://www.wikihow.com/Become-an-Herbalist", "passage_text": "How to Become an Herbalist. An herbalist is a person who studies herbal medicine, the healing properties of plants, as it is practiced in traditional China and Western cultures. In written records, the study of herbs dates back over 5,000 years to the Sumerians, amongst the earliest civilizations of the world. "}, {"url": "http://www.insights-for-acupuncturists.com/acupuncturists-earn.html", "passage_text": "1 How much you earn from herbal or other retail products. 2  How much you earn from passive income sources. 3  What state and state you are practicing in. ( 4 See the graph below.). 5  Whether you accept and bill for insurance, whether you are an in-network or out-of-network provider and what the reimbursement rate is. An acupuncturist's income is dependent on a multitude of factors. So be aware that researching income can never be a guarantee for how much money YOU can earn as a professional acupuncturist."}, {"url": "http://www.answers.com/Q/How_much_money_does_a_herbalist_earn", "passage_text": "Making the world better, one answer at a time. How much money an herbalist earns can vary greatly. Those who work in a health food store an earn $20,000 per year. Those who work in sales can earn up to $75,000 per year, and those who are self employed can earn over $100,000 per year. About 435,000 a year. Unless you own your own company you will get paid around in the 900,000k to millions. Some types of builders make up to 200+ dollars a day. by owning … your own business you will get around £900,000 a year. 27 people found this useful."}, {"url": "http://study.com/articles/Salary_and_Career_Info_for_a_Master_Herbalist.html", "passage_text": "Salary and Career Info for a Master Herbalist. Learn about the education and preparation needed to become a master herbalist. Get a quick view of the requirements as well as details about schooling, job duties and certification to find out if this is the career for you. PayScale.com also published in January 2015 that the median hourly rate earned by managers working in herbal supplement retail stores was $12.75, while customer service managers in the same type of stores earned a median of $13.50 an hour. Show me 10 popular schools."}]