[{"url": "http://adb.anu.edu.au/biography/frayne-ursula-3572", "passage_text": "by Imelda Palmer. This article was published in Australian Dictionary of Biography, Volume 4, (MUP), 1972. Ursula Frayne (1816-1885), mother superior, was born on 5 October 1816 in Dublin, Ireland, daughter of Robert Frayne, a prosperous businessman, and his wife Bridget. In 1842 she was appointed Superior of the institute's first foreign mission foundation in Newfoundland and in 1845 went on foundation to Perth, Western Australia, at the request of the newly consecrated Bishop John Brady for Sisters to staff his proposed schools."}, {"url": "https://en.wikipedia.org/wiki/Ursula_Frayne", "passage_text": "Clara Frayne was born to a wealthy businessman Robert Frayne, and his wife, Bridget, in Dublin, Ireland. She entered Baggot street with Catharine McAuely the then recently formed Institute of Mercy in Dublin in 1834 and took Ursula in place of her baptismal name. She is commemorated in the name of the Ursula Frayne Catholic College, Perth, Western Australia-and also in the dementia ward of Mercy Place, Albury; renamed in 2014 to commemorate Ursula Frayne."}, {"url": "https://en.wikipedia.org/wiki/Ursula_Frayne", "passage_text": "Ursula Frayne (5 October 1816 – 9 June 1885), born Clara Frayne, was an Irish nun who became a Mother Superior of the Sisters of Mercy and spent her life in missionary work, initially in Canada but largely in Australia developing schools and academies. Contents. She is commemorated in the name of the Ursula Frayne Catholic College, Perth, Western Australia-and also in the dementia ward of Mercy Place, Albury; renamed in 2014 to commemorate Ursula Frayne."}, {"url": "http://www.ursulafrayne.wa.edu.au/tradition/mother-ursula-frayne", "passage_text": "A perfect role model for the students of Ursula Frayne Catholic College. She was a person who led a group of courageous Irish women committed in faith to the pursuit of Justice and Compassion. Clara Mary Frayne was born in Dublin in 1817 and died in Melbourne in 1885. She was trained by Catherine McAuley, and became a professed Sister of Mercy on 25 January 1837. In 1845 Ursula Frayne had 21 days to prepare to sail for Western Australia with five other Sisters of Mercy and one Postulant. Together with Bishop Brady, his European missionaries, one Irish priest and seven Irish catechists, they sailed for Western Australia via the Cape of Good Hope"}, {"url": "http://www.resourcemelb.catholic.edu.au/object.cfm?o=209&pid=1528&showrm=true&uptam=false", "passage_text": "Ursula Frayne (her baptismal name was Clara) was born to enterprising and well-to-do parents in Dublin in 1816. She joined the newly founded Mercy Sisters in 1832. The sisters were known as ‘the walking nuns’ because they were constantly seen on the streets and lanes of Dublin attending to those most in need. "}, {"url": "http://www.mercy.edu.au/_uploads/rsfil/000332_aebb.pdf", "passage_text": "Young, vital and committed to the development of a better Australia, Ursula Frayne is an ideal example for all young Australians as women and men are encouraged to be resourceful and merciful followers of Christ in the world. Clara Mary Frayne was born in Dublin in 1817 and died in Melbourne in 1885. She was a person who led a group of courageous Irish women committed in faith to the pursuit of justice and compassion. 1817-1885 Mother Ursula Frayne opened the first Mercy school in Australia on 2 February 1846 with planks, bricks and packing cases as the furniture."}, {"url": "http://www.mercyworld.org/heritage/tmplt-foundressstory.cfm?loadref=213", "passage_text": "A biography written by Ursula Gilbert rsm. Born in Dublin, Ursula entered in Baggot Street in 1834 and was trained by the foundress Mother Catherine-who was always stressing that the sisters preserve union and charity. She was professed in 1837 and in the same year went on the foundation to Carlow with M. Frances Warde"}]