[{"url": "http://www.eutimes.net/2009/03/want-to-make-money-try-collecting-poisonous-snake-venom-for-more-than-1000gr/", "passage_text": "Snakes do plenty of good things, especially for farmers. Snakes eat mice, rats, gophers, and other small mammals that eat farm crops. Snakes also help scientists and doctors. Snake venom is used in research and in making medicines. One medicine made from venom helps treat certain types of heart attacks. Another is antivenin (an tee VEHN uhn), a drug used to treat snakebite"}, {"url": "https://answers.yahoo.com/question/index?qid=20110106174353AAxphVS", "passage_text": "You'd most likely have to have a degree in herpetology and work for a large producer. You would not be paid per oz. Most likely you'd get a salary or wage per hour just like anyone else. The company would make the money from the sales of venom. Not just anyone can milk snakes for venom. Best Answer: My blog site is: http://zoocrewkids.blogspot.com/ If you look on the right side you'll see a section about the value of venoms. I currently have a gila monster which I take to presentations and discuss the cures the proteins from this particular venom produce in humans."}, {"url": "https://www.quora.com/Do-snakes-bite-humans-without-any-reason", "passage_text": "In other words, you cannot teach a snake not to bite the way you can train a dog, because snakes do not understand punishment. If it feels threatened, especially if it is about to shed or is guarding a nest, it will bite. It's worth mentioning, also, that not all snake bites include an injection of venom. "}, {"url": "https://en.wikipedia.org/wiki/Snake_venom", "passage_text": "Snake venom is highly modified saliva containing zootoxins that facilitates the immobilization and digestion of prey, and defends against a threat. It is injected by unique fangs after a bite but some species are also able to spit. "}, {"url": "http://snakegetters.com/hk/handling.html", "passage_text": "Disclaimer: Handling venomous snakes is a high risk activity, and a mistake can maim you for life or kill you. It should best be left to professionals and very serious private collectors who are willing to devote a significant percentage of their time, energy and money to the safe maintenance of their collections. "}, {"url": "http://www.venomousreptiles.org/articles/55", "passage_text": "The following article is for information purposes only and does not necessarily reflect the views of the Southeastern Hot Herp Society. Anyone who has had any experience with venomous reptiles has had a chance to engage the thought of keeping a venomous snake that has no venom. "}, {"url": "http://abcnews.go.com/Technology/national-zoo-cottonmouth-viper-spits-employee/story?id=13192710", "passage_text": "It turns out that while the reptile keeper was attempting to transfer a 3-foot-long cottonmouth viper to its holding cage, the snake bit itself in the tail, releasing a combination of urine, feces and venom. A small amount of that mixture shot into the employee's right eye. For a reptile keeper at the National Zoo in Washington, D.C., the toxic concoction got her a quick trip to the hospital and a star appearance Monday on the District of Columbia Fire Department's twitter feed."}, {"url": "http://www.jobmonkey.com/uniquejobs/snake-milker/", "passage_text": "The USDA regulates who can buy and sell snake venom. It is very important to learn about these regulations so that you can operate properly. On average, snake milkers make around $2,500 per month, but snake venom is an expensive market. One gram of certain types of snake venom can sell for $2,000. If you are crazy enough to capture, milk, and breed snakes, please take the precaution to wear protective clothing and always have antivenom close at hand. Snake milkers have an insane job. They “milk” snakes for their venom. This means that every single day, a snake milker handles deadly, venomous snakes. It’s a hands on job where you put your fingers millimeters away from the sharp, fangs of asps, vipers, cobras, corals, mambas, kraits, and rattlesnakes."}, {"url": "https://answers.yahoo.com/question/index?qid=20110106174353AAxphVS", "passage_text": "Asker's rating. Report Abuse. If you are asking how much does anti-venom cost per ounce it varies depending on the species. Contrary to what one answer posted it is not a degree in herpetology that is required, in fact there is no such thing as a degree in herpetology there is a concentration in herpetology. Best Answer: My blog site is: http://zoocrewkids.blogspot.com/ If you look on the right side you'll see a section about the value of venoms. I currently have a gila monster which I take to presentations and discuss the cures the proteins from this particular venom produce in humans."}]