[{"url": "http://study.com/academy/lesson/fibrous-connective-tissue-function-types.html", "passage_text": "One of the specific types of connective tissue is fibrous connective tissue, or FCT. This high-strength, slightly stretchy tissue consists mainly of collagen, a protein which is known for providing strength and stability. Connective tissue is one of the four main tissue types; the others are epithelial tissue, muscle tissue and nervous tissue. Connective tissue includes tissues such as cartilage, bone, blood and fat. In this lesson, we'll be specifically looking at fibrous connective tissue."}, {"url": "http://www.news-medical.net/health/What-is-Fibrosis.aspx", "passage_text": "By Sally Robertson, BSc. The term fibrosis describes the development of fibrous connective tissue as a reparative response to injury or damage. Fibrosis may refer to the connective tissue deposition that occurs as part of normal healing or to the excess tissue deposition that occurs as a pathological process. When fibrosis occurs in response to injury, the term “scarring” is used. Pulmonary fibrosis refers to a number of conditions that cause interstitial lung damage, followed by fibrosis and eventually loss of lung elasticity. These conditions lead to symptoms such as persistent cough, chest pain, difficulty breathing and fatigue."}, {"url": "https://en.wikipedia.org/wiki/Pulmonary_fibrosis", "passage_text": "Scar formation, the accumulation of excess fibrous connective tissue (the process called fibrosis), leads to thickening of the walls, and causes reduced oxygen supply in the blood. As a consequence patients suffer from perpetual shortness of breath. Pulmonary fibrosis (literally scarring of the lungs ) is a respiratory disease in which scars are formed in the lung tissues, leading to serious breathing problems."}, {"url": "http://www.merriam-webster.com/dictionary/fibrosis", "passage_text": "Medical Definition of FIBROSIS. : a condition marked by increase of interstitial fibrous tissue: fibrous degeneration. Definition of FIBROSIS. : a condition marked by increase of interstitial fibrous tissue. — fi·brot·ic \\-ˈbrae-ˈbrä\\ tik. adjective"}, {"url": "http://medical-dictionary.thefreedictionary.com/fibrous+tissue", "passage_text": "chromaffin tissue a tissue composed largely of chromaffin cells, well supplied with nerves and vessels; it occurs in the adrenal medulla and also forms the paraganglia of the body. cicatricial tissue the dense fibrous tissue forming a cicatrix, derived directly from granulation tissue; called also scar tissue. connective tissue the tissue that binds together and is the support of the various structures of the body; see also connective tissue. fibrous tissue, the connective tissue of the body, consisting of closely woven elastic fibers and fluid-filled areolae. Also called fibroelastic tissue. Compare areolar tissue. S"}, {"url": "http://www.merriam-webster.com/dictionary/fibrosis", "passage_text": "Definition of FIBROSIS. : a condition marked by increase of interstitial fibrous tissue. — fi·brot·ic \\-ˈbrae-ˈbrä\\ tik. Adjective see fibrosis defined for. KIDS. advertisement Definition of FIBROSIS. : a condition marked by increase of interstitial fibrous tissue. — fi·brot·ic \\-ˈbrae-ˈbrä\\ tik. adjective"}, {"url": "http://study.com/academy/lesson/fibrous-connective-tissue-function-types.html", "passage_text": "In this lesson, you'll learn about a specific type of connective tissue called fibrous connective tissue. You'll also discover the other specialized fibrous connective tissues: tendons, ligaments and fasciae. Connective tissue is one of the four main tissue types; the others are epithelial tissue, muscle tissue and nervous tissue. Connective tissue includes tissues such as cartilage, bone, blood and fat. In this lesson, we'll be specifically looking at"}, {"url": "http://medical-dictionary.thefreedictionary.com/fibrous+tissue", "passage_text": "fatty tissue connective tissue made of fat cells in a meshwork of areolar tissue. fibrous tissue the common connective tissue of the body, composed of yellow or white parallel elastic and collagen fibers. gelatinous tissue mucous tissue. fibrous tissue, the connective tissue of the body, consisting of closely woven elastic fibers and fluid-filled areolae. Also called fibroelastic tissue. Compare areolar tissue. See also connective tissue."}, {"url": "https://en.wikipedia.org/wiki/Fibrosis", "passage_text": "Fibrosis is the formation of excess fibrous connective tissue in an organ or tissue in a reparative or reactive process. This can be a reactive, benign, or pathological state. In response to injury, this is called scarring, and if fibrosis arises from a single cell line, this is called a fibroma. Physiologically, fibrosis acts to deposit connective tissue, which can obliterate the architecture and function of the underlying organ or tissue. Fibrosis can be used to describe the pathological state of excess deposition of fibrous tissue, as well as the process of connective tissue deposition in healing"}, {"url": "http://vidatherapeutics.com/fibrotic-disease.html", "passage_text": "Cardiac Fibrosis. Fibrosis is a pathologic process, which includes scar formation and over production of extracellular matrix, by the connective tissue, as a response to tissue damage. Damage to tissue can result from a variety of stimuli including autoimmune reactions and mechanical injury. "}]