[{"url": "http://www.youtube.com/user/getridoflegcellulite", "passage_text": "So, I have a great video for you, which will teach you how to reverse the 2 main causes of cellulite, and an odd tip to dramatically reduce your cellulite in 14 days. Also, I want to give you for free my diet and exercise routine, the one I followed for 2 months to get rid of cellulite at home."}, {"url": "http://www.youtube.com/user/getridoflegcellulite", "passage_text": "- Do an anti cellulite massage at home. - Do exercises that tone your thighs and butt muscles, like squats and lunges. 3 great cellulite workouts for free here http://getridofcellulite-na... Try to consume a cellulite diet-natural multivitamins and a source of Omega 3, because they will make your skin more elastic."}, {"url": "http://www.top10homeremedies.com/how-to/get-rid-cellulite-thighs.html", "passage_text": "1. Dry Brushing. Dry brushing is one of the simplest ways to get rid of cellulite in your thighs. The process of dry brushing improves blood circulation and lymphatic drainage, and removes the build-up of toxins from the upper skin layer, which in turn reduces the appearance of cellulite."}, {"url": "http://www.rapidhomeremedies.com/cellulite.html", "passage_text": "2. Dry brushing is perhaps the most effective home remedies for cellulite removal. When you rub a dry brush onto your dry skin, you help tighten the epidermis and also in breaking up the toxic material which makes up the cellulite. Many people have used dry brushing to miraculously get rid of"}, {"url": "http://www.rapidhomeremedies.com/cellulite.html", "passage_text": "With the perfect cellulite diet as well as exercises, you can get rid of cellulites soon. The home remedies for cellulite too are there to help you out! So get set and select your own combination of cellulite remedies, diet and exercises for cellulite removal."}, {"url": "http://www.youtube.com/watch?v=lwb9EqSj6qk", "passage_text": "- Do exercises that tone your thighs and butt muscles, like squats and lunges. 3 great cellulite workouts for free here http://getridofcellulite-naturally.org/ Try to consume a cellulite diet-natural multivitamins and a source of Omega 3, because they will make your skin more elastic."}, {"url": "http://www.youtube.com/user/getridoflegcellulite", "passage_text": "To learn how to get rid of cellulite fast and naturally on thighs, legs and butt with the best natural cellulite treatment, watch this video till the end! *It’s important to note, specific results are not typical and are NOT guaranteed and your results may vary greatly."}]