[{"url": "http://www.florencemailboxes.com/downloads/techdocs/Sentinel_Terms-Definitions.pdf", "passage_text": "That is, if 1 volt of potential difference is applied to a resistive load, and a current of 1 ampere flows, then 1 watt of power is dissipated. Common Electrical Terms, Abbreviations and Definitions…pg 3 volt (V) Practical Definition: Volt is used to quantify the electrical potential of an electrical source."}, {"url": "http://www.answers.com/Q/What_does_common_mean_in_terms_of_wiring_IE_hot_neutral_ground_line_NO_NC", "passage_text": "In terms of hot,neutral,ground, the neutral is classed as the common. In regards to a switch which has a NO, NC, C. This is classed as a C form switch. It has a common terminal, a normally open terminal and a normally closed terminal."}, {"url": "http://www.florencemailboxes.com/downloads/techdocs/Sentinel_Terms-Definitions.pdf", "passage_text": "Common Electrical Terms, Abbreviations and Definitions lumen (lm) Practical Definition: This is a measurement of how bright a light source is rated. Really not a good practical measurement. An example is when you purchase a 100-watt light bulb."}, {"url": "http://www.justanswer.com/electrical/23ltf-meaning-common-wire-terminal.html", "passage_text": "HiCustomer The term common can have 2 different meanings when it comes to electrical wiring. It can refer to either a neutral wire, or a wire that is connected to more than one other wire. For example, on a relay, you would connect a common (hot, not neutral) wire to a terminal."}, {"url": "http://www.answers.com/Q/What_does_COM_mean_in_an_electrical_wiring_diagram", "passage_text": "Answer by Johnny3h. Confidence votes 7.8K. Meaning of the term COM in Electrical Wiring Diagrams Usually, that is an abbreviation for the word, Common which means the return side of all, or almost all, components, which are connected to this common point or series of points all connected together."}, {"url": "http://metrosbestelectric.com/glossary-common-electrical-terms/", "passage_text": "Here is a list of common electrical terms that you may hear in the course of researching electricians to do work in your home. A little knowledge can go a long way toward your satisfaction when the work is completed."}]