[{"url": "http://infospace.ischool.syr.edu/2012/05/11/what-is-natural-language-processing/", "passage_text": "Natural Language Processing (NLP) is a branch of information machine science that deals with natural language information. Human language is dauntingly complex for a computer to understand. Think about the following two sentences: “Mary had a little lamb and drove her car to a farm. That is what the Center for Natural Language Processing in the Syracuse University iSchool works with, developing systems that derive meaningful information from human language for computers."}, {"url": "http://blog.mashape.com/list-of-25-natural-language-processing-apis/", "passage_text": "Note: Check out our latest API collections page for the list of updated APIs. Natural Language Processing, or NLP, is a field of computer science, artificial intelligence, and linguistics concerned with the interactions between computers and human (natural) languages. A service for automatic proofreading of multilingual texts. This API uses multilingual Natural Language Processing technology to check the spelling, grammar and style of your texts with high accuracy, in order to provide precise and up-to-date suggestions and educational explanations based on references."}, {"url": "https://en.wikipedia.org/wiki/Natural_language_processing", "passage_text": "For the processing of language by the human brain, see Language processing in the brain. Natural language processing (NLP) is a field of computer science, artificial intelligence, and computational linguistics concerned with the interactions between computers and human (natural) languages. As such, NLP is related to the area of human–computer interaction. Many challenges in NLP involve natural language understanding, that is, enabling computers to derive meaning from human or natural language input, and others involve natural language generation. An automated online assistant providing customer service on a web page, an example of an application where natural language processing is a major component."}, {"url": "http://www.mind.ilstu.edu/curriculum/protothinker/natural_language_processing.php", "passage_text": "One author notes two opposite approaches to natural language processing. One approach tries to use all the information in a sentence, as a human would, with the goal of making the computer able to process to the degree that it could converse with a human. In discussions of natural language processing by computers, it is just presupposed that machine level processing is going on as the language processing occurs, and it is not considered as a topic in natural language processing per se."}, {"url": "http://www.mind.ilstu.edu/curriculum/protothinker/natural_language_processing.php", "passage_text": "The result of a human person processing a sentence in a natural language is that the person understands the meaning of the sentence. We ignore consideration of whether a book, a play, or some other story or narrative has a single meaning intended by the author that is the meaning. In discussions of natural language processing by computers, it is just presupposed that machine level processing is going on as the language processing occurs, and it is not considered as a topic in natural language processing per se."}, {"url": "http://ccls.columbia.edu/research/natural-language-processing", "passage_text": "Applications of Natural Language Processing: Although the language and security applications for NLP are obvious, the analytic techniques used in Natural Language Processing also have unexpected applications to projects that at first do not seem to involve a language or linguistics. For example: "}, {"url": "http://www.upf.edu/hipertextnet/en/numero-5/pln.html", "passage_text": "Problems with natural language processing: linguistic variation and ambiguity. Natural language, understood as a tool that people use to express themselves, has specific properties that reduce the efficacy of textual information retrieval systems. These properties are linguistic variation and ambiguity. 2. Problems with natural language processing: linguistic variation and ambiguity. 3. Natural Language processing in textual information retrieval. 3.1. Statistical processing of natural language. 3.2. Linguistic processing of natural language. 4. Related topics in research. 5."}, {"url": "https://en.wikipedia.org/wiki/Outline_of_natural_language_processing", "passage_text": "Natural language processing can be described as all of the following: 1  A field of science – systematic enterprise that builds and organizes knowledge in the form of testable explanations and predictions about the universe. 2  An applied science – field that applies human knowledge to build or design useful things. 1 A form of computer technology – computers and their application. 2  NLP makes use of computers, image scanners, microphones, and many types of software programs. 3  Language technology – consists of natural language processing (NLP) and computational linguistics (CL) on the one hand, and speech technology on the other."}]