[{"url": "http://www.niddk.nih.gov/health-information/health-topics/digestive-diseases/colon-polyps/Pages/overview.aspx", "passage_text": "Definition and Facts for Colon Polyps. Colon polyps are growths on the lining of your colon or rectum. Over time, some polyps can become cancerous, and removing polyps can help prevent cancer of the colon and rectum.​."}, {"url": "http://www.cancer.org/cancer/news/removing-polyps-prevents-colon-and-rectal-cancer-deaths", "passage_text": "The study, published in the Feb. 23, 2012 issue of The New England Journal of Medicine, is the first to show that removing polyps prevents deaths from colon and rectal cancer. Previous studies have shown that removing polyps prevents these cancers from developing."}, {"url": "http://www.nytimes.com/2009/02/24/health/esn-colonoscopy-expert.html", "passage_text": "This area, called the cecum and ascending colon, is an important area to see with the colonoscope because cancers commonly develop there. It’s also the most likely area for cancers to develop after a normal colonoscopy. Flat polyps are common in this area and can be hard to see even when bowel preparation is perfect."}, {"url": "http://www.berkeleywellness.com/self-care/preventive-care/article/do-you-need-colonoscopy", "passage_text": "Print. Screening for colorectal cancer—that is, cancers of the colon (large intestine) and rectum—is a proven lifesaver. This is partly due to the fact that this is one cancer which screening can actually prevent, since it can lead to the detection and removal of polyps, some of which may progress to cancer."}, {"url": "http://www.cancer.org/cancer/news/removing-polyps-prevents-colon-and-rectal-cancer-deaths", "passage_text": "A colonoscopy allows a doctor to examine the entire length of the colon and rectum to look for polyps and cancer. Any polyps or other growths detected can be removed during the procedure. If they are non-cancerous or pre-cancerous, removal prevents them from turning into cancer."}, {"url": "http://www.colorectal-cancer.ca/en/screening/screening-tests/", "passage_text": "Therefore, if the test is positive, a colonoscopy is required to determine if there is a cancer, polyp, or other cause of bleeding such as ulcers, hemorrhoids, diverticulosis (tiny pouches that form at weak spots in the colon wall) or inflammatory bowel disease (colitis)."}, {"url": "http://www.cancer.org/cancer/news/removing-polyps-prevents-colon-and-rectal-cancer-deaths", "passage_text": "The new findings add to the evidence supporting the use of colonoscopy as a screening test. (Screening is testing for a disease such as cancer in people before they have any symptoms.) However, the study doesn't prove by itself that screening with colonoscopy can reduce the risk of death from colon and rectal cancer."}]