[{"url": "http://priceofsilver.org/price-of-silver-per-troy-oz/", "passage_text": "The ounce is slightly heavier than the troy ounce, with one troy ounce equaling 1.097 oz. One can know the price of silver per troy oz, per ounce, per gram, per kilogram and also in terms of various currencies such as the dollar, the yen and so on. Silver-which denomination to buy. Due to the skyrocketing price of silver per troy oz today, many investors are investing in bars, rounds, coins"}, {"url": "http://www.answers.com/Q/What_is_the_current_value_of_one_troy_ounce_of_silver", "passage_text": "See Related Links     The spot price of silver fluctuates daily. See the Related Link for Kitco: Spot price of precious metals for the current value.   Answer …   According to this morning's paper (April 23, 2007), yesterday's price for one troy ounce (31.1 grams) was $14.33 if you buy a 1000 Tr Oz. ingot."}, {"url": "http://priceofsilver.org/current-price-of-silver-per-troy-ounce/", "passage_text": "Silver is a whitish precious metal and has been used since about 4000 BC for various purposes such as money, silverware, jewelry and so on. Silver is measured in troy ounces. A troy ounce is 31.10348 grams. A troy ounce is about 10 percent more than the avoirdupois ounce."}, {"url": "http://www.jmbullion.com/silver/", "passage_text": "Silver Prices. One of the most important factors when it comes to buying silver bullion are silver spot prices. The spot price of silver is more or less the going rate for the metal calculated per troy ounce (31.1034768 grams)."}, {"url": "http://priceofsilver.org/current-price-of-silver-per-troy-ounce/", "passage_text": "After knowing the current price of silver per troy ounce, one can invest in silver bullion such as silver bars or coins or in silver stocks, exchange traded funds (Silver ETFs) or digital silver products. Silver or Gold. Many investors are plagued by the question of whether to invest in gold or silver."}, {"url": "http://cointrackers.com/silver-prices/", "passage_text": "The troy ounce is the standard silver price that you see on the t.v. 1 troy ounce = 31.1034768 grams or 1.09714 U.S. Ounces. It is usually just referred to as an oz."}, {"url": "http://cointrackers.com/silver-prices/", "passage_text": "1 Silver Content US Coins-Get the silver value of US coins. 2  Troy Ounce vs Ounce -1 Troy ounce contains 2.75 grams more... 3  Coin Collecting Investment-Investing in a coin collection. 4  Current Gold Price-get an up to the minute gold price."}]