[{"url": "http://www.fast-dry.com/faq.php", "passage_text": "The cost to build a new Har-Tru tennis court is dependent on a variety of factors, including the size of the court itself, the geographic location, the irrigation system installed (sprinkler or FDC HydroCourt), the fencing materials and layout chosen, lighting systems, site access, etc. However, you will need slightly more room than either of these sizes for most residential applications as the tennis court will need to be set back from the property lines in order to meet zoning requirements. Consult your local building department for the setback requirements in your municipality."}, {"url": "http://www.qualitycourt.com/index.php/faq", "passage_text": "How much does it cost to build a court? The average cost to build a residential tennis court from start to finish including dirt work, post tension slab, fencing, lighting, surfacing and accessories, is about $65,000. However, prices can easily range anywhere between $50,000 to $80,000 depending on options."}, {"url": "http://www.fast-dry.com/faq.php", "passage_text": "The minimum size approved by the American Sports Builders Association is 56' wide by 114' long. However, you will need slightly more room than either of these sizes for most residential applications as the tennis court will need to be set back from the property lines in order to meet zoning requirements. Consult your local building department for the setback requirements in your municipality."}, {"url": "http://www.fast-dry.com/faq.php", "passage_text": "The cost to build a new asphalt tennis court is dependent on a variety of factors, including the size of the court itself, the geographic location, the surfacing system installed on top of the asphalt, the fencing materials and layout chosen, site access, etc. However, you will need slightly more room than either of these sizes for most residential applications as the tennis court will need to be set back from the property lines in order to meet zoning requirements. Consult your local building department for the setback requirements in your municipality."}, {"url": "http://www.tennisindustrymag.com/articles/2014/09/13_tennis_lighting_the_life_an.html", "passage_text": "In my city, a kilowatt-hour of electricity costs about 15 cents, times eight fixtures, or $1.20 per hour to light one court. Multiply by four hours and you get $4.80 for the night, times 180 nights a year is $864 in electricity costs to light one court. For seven years, then, electricity cost is $6,048. As mentioned earlier, plan on $900 per court for MH maintenance. (Individual bulbs may burn out sooner, but this is a reasonable average vendor cost to maintain appropriate light levels.) Over a seven-year period, you should replace all eight bulbs twice near the beginning and end of this period, or $1,800. Let’s start with the hard costs of MH. We have to make some assumptions, but this analysis will give you a point of comparison between an MH court and its most likely successor, LED technology. Let’s assume a typical tennis court with eight 1,000-watt MH fixtures, or 8,000 total watts. That’s like eight hair dryers going full blast. A busy outdoor facility might run them an average of four hours a night (an indoor club obviously much more) and 180 nights a year (some climates more, some less)"}, {"url": "http://www.fast-dry.com/faq.php", "passage_text": "We generally build your new tennis court on a properly prepared sub-base. This means that you as the owner (or your general contractor) are responsible for clearing the land, stabilizing the sub-base (if necessary), grading the sub-base to the required slope and staking the four corners of the court. However, you will need slightly more room than either of these sizes for most residential applications as the tennis court will need to be set back from the property lines in order to meet zoning requirements. Consult your local building department for the setback requirements in your municipality."}, {"url": "http://www.britecourt.com/", "passage_text": "About Brite Court and our experience. Brite Court is a division of Alternative LED (ALED). The Founders of ALED developed the 1st T5 fluorescent indoor tennis lighting back in 2002 and since then they have designed lighting for more than 500 courts. All of the Brite Court tennis lighting is designed specifically for tennis use."}, {"url": "http://www.residential-landscape-lighting-design.com/lighting_tennis_court.htm", "passage_text": "Tennis Court Fixture Mounting Methods: In tennis court lighting you have low-mast and high-mast pole configurations to consider when making your selection. Most residential tennis court lighting is low-mast lighting and high mast lighting is used in areas where higher light levels are required. Identify Your Tennis Court Layout: One of the first things in selecting proper tennis court lighting is to identify the size and layout of your court."}]