[{"url": "https://en.wikipedia.org/wiki/Silk", "passage_text": "Silk fabric was first developed in ancient China. The earliest example of silk fabric is from 3630 BC, and it was used as wrapping for the body of a child from a Yangshao site in Qingtaicun at Xingyang, Henan. Legend gives credit for developing silk to a Chinese empress, Leizu (Hsi-Ling-Shih, Lei-Tzu). The protein fiber of silk is composed mainly of fibroin and is produced by certain insect larvae to form cocoons. The best-known silk is obtained from the cocoons of the larvae of the mulberry silkworm Bombyx mori reared in captivity (sericulture)."}, {"url": "http://www.silk-road.com/artl/silkhistory.shtml", "passage_text": "In 408 AD when Alaric, a Goth, besieged Rome, his price for sparing the city included 5000 pounds of gold, 3000 pounds of pepper, 30,000 pounds of silver and 4000 tunics of silk. SILK TODAY. World silk production has approximately doubled during the last 30 years in spite of man-made fibers replacing silk for some uses. China and Japan during this period have been the two main producers, together manufacturing more than 50% of the world production each year. The key to understanding the great mystery and magic of silk, and China's domination of its production and promotion, lies with one species: the blind, flightless moth, Bombyx mori. It lays 500 or more eggs in four to six days and dies soon after. The eggs are like pinpoints one hundred of them weigh only one gram."}, {"url": "https://en.wikipedia.org/wiki/Silk_(soy_milk)", "passage_text": "Silk was founded by Steve Demos in Boulder, Colorado in 1978. The first product was introduced in March 1996 by WhiteWave, Inc. at the Natural Foods Expo in Anaheim, California. In the years that followed, Silk became a successful, world-wide, organic brand. In 2002 WhiteWave, Inc (parent of Silk Soymilk) was sold to Dean Foods for just under $300 million. The company's sales grew to $350 million in annual revenues by 2005."}, {"url": "http://www.youtube.com/watch?v=-wbmEjTvszI", "passage_text": "This video tells the story of silk production in Shanghai, China starting with the eggs of silkworms to worms' production of fibers to make their cocoons. The silk is unraveled from the cocoons like thread from a spool. The Chinese have cultivated silkworms for more than 5,000 years. 1  Education. "}, {"url": "http://www.madehow.com/Volume-2/Silk.html", "passage_text": "Generally, one cocoon produces between 1,000 and 2,000 feet of silk filament, made essentially of two elements. The fiber, called fibroin, makes up between 75 and 90%, and sericin, the gum secreted by the caterpillar to glue the fiber into a cocoon, comprises about 10-25% of silk. The secret to silk production is the tiny creature known as the silk-worm, which is the caterpillar of the silk moth Bombyx mori. The cultivation of silkworms for the purpose of producing silk is called sericulture. Over the centuries, sericulture has been developed and refined to a precise science."}, {"url": "http://www.ducksters.com/history/china/legend_of_silk.php", "passage_text": "Silk is a thin, but strong fiber that silkworms produce when they are making their cocoons. It can be woven into a very soft and smooth fabric. Silk fabric was invented in Ancient China and played an important role in their culture and economy for thousands of years. Legend of Silk. Legend has it that the process for making silk cloth was first invented by the wife of the Yellow Emperor, Leizu, around the year 2696 BC. The idea for silk first came to Leizu while she was having tea in the imperial gardens. "}, {"url": "https://en.wikipedia.org/wiki/History_of_Silk", "passage_text": "In 1996 it produced 58,000 tonnes out of a world production of 81,000, followed by India at 13,000 tonnes. Japanese production is now marginal, at only 2500 tonnes. Between 1995 and 1997 Chinese silk production went down 40% in an effort to raise prices, reminiscent of earlier shortages. "}, {"url": "https://en.wikipedia.org/wiki/Silk", "passage_text": "Silk is a natural protein fiber, some forms of which can be woven into textiles. The protein fiber of silk is composed mainly of fibroin and is produced by certain insect larvae to form cocoons. The best-known silk is obtained from the cocoons of the larvae of the mulberry silkworm Bombyx mori reared in captivity (sericulture)."}, {"url": "http://www.whoinventedit.net/who-invented-silk.html", "passage_text": "A recent archeological discovery appears to contradict this legend. It is a cup made from ivory and inscribed with silkworm designs. Along with the cup, they also found silk-making equipment. The items are believed to be about 6,000 to 7,000 years old. "}, {"url": "https://en.wikipedia.org/wiki/Silk", "passage_text": "Several kinds of wild silk, which are produced by caterpillars other than the mulberry silkworm, have been known and used in China, South Asia, and Europe since ancient times. However, the scale of production was always far smaller than for cultivated silks. The protein fiber of silk is composed mainly of fibroin and is produced by certain insect larvae to form cocoons. The best-known silk is obtained from the cocoons of the larvae of the mulberry silkworm Bombyx mori reared in captivity (sericulture)."}]