[{"url": "http://www.state.nj.us/dobi/ins_ombudsman/wysk1.htm", "passage_text": "(For more information, see third party claims...). It depends. If your car is stolen, most insurance policies will reimburse you for a stated amount towards the cost of a rental vehicle for a limited time starting 48 hours after the theft, as long as you report the theft to the police and to the insurance company. Check your policy for the exact wording."}, {"url": "http://insurance.illinois.gov/autoinsurance/auto_own_claim.asp", "passage_text": "It depends. If your vehicle is stolen, most insurance policies will reimburse you for the cost of a rental vehicle starting 48 hours after the theft, as long as you report the theft to the police and your insurance company. Check your policy for the dollar limits."}, {"url": "https://www.esurance.com/info/car/after-your-car-is-stolen", "passage_text": "After you've filed a police report, contact your car insurance company. If you're an Esurance customer, you can report the stolen car online, on your smartphone, or by calling us anytime at 1-800-ESURANCE (1-800-378-7262) . A dedicated claims rep will help you through every step of the claims process."}, {"url": "http://www.state.nj.us/dobi/ins_ombudsman/wysk1.htm", "passage_text": "If you file a first party claim, your insurance company will either pay to repair the damages to your vehicle or pay you the value of your vehicle if the damages exceed the car's worth. First, though, the company will subtract the deductible amount you have chosen for that coverage."}, {"url": "http://insurance.illinois.gov/autoinsurance/auto_own_claim.asp", "passage_text": "If your vehicle is stolen, most insurance policies will reimburse you for the cost of a rental vehicle starting 48 hours after the theft, as long as you report the theft to the police and your insurance company."}, {"url": "http://www.usacoverage.com/auto-insurance/how-long-will-it-take-to-have-a-claim-paid-for-a-stolen-car.html", "passage_text": "Generally, claims for a stolen car are released within two weeks to thirty days. Some companies would only make their claimants for two weeks, with the thinking that if his or her vehicle wasn’t recovered within a few days, it is unlikely to be recovered in the succeeding days."}]