[{"url": "http://www.webmd.com/food-recipes/ss/slideshow-vitamin-d-overview", "passage_text": "Symptoms of D Deficiency. Most people with low blood levels of vitamin D don't notice any symptoms. A severe deficiency in adults can cause soft bones, called osteomalacia (shown here). The symptoms include bone pain and muscle weakness. In children, a severe deficiency can lead to rickets and symptoms of soft bones and skeletal problems. Rickets is rare in the United States."}, {"url": "https://en.wikipedia.org/wiki/Osteomalacia", "passage_text": "The most common cause of osteomalacia is a deficiency of vitamin D, which is normally derived from sunlight exposure and, to a lesser extent, from the diet. Measures to prevent and treat osteomalacia usually revolve around intake of vitamin D and calcium supplements. Vitamin D should always be administered in conjunction with calcium supplementation since most of the consequences of vitamin D deficiency are a result of impaired mineral ion homeostasis."}, {"url": "https://en.wikipedia.org/wiki/Vitamin_D", "passage_text": "Osteomalacia is a disease in adults that results from vitamin D deficiency. Characteristics of this disease are softening of the bones, leading to bending of the spine, bowing of the legs, proximal muscle weakness, bone fragility, and increased risk for fractures. Vitamin D deficiency causes osteomalacia (called rickets when it occurs in children). Use of vitamin D in children with normal vitamin D levels does not appear to improve bone density. Beyond that, low serum vitamin D levels have been associated with falls, and low bone mineral density."}, {"url": "http://patient.info/health/vitamin-d-deficiency-including-osteomalacia-and-rickets-leaflet", "passage_text": "A more severe lack can cause serious problems such as rickets (in children) and osteomalacia (in adults), described below. Treatment is with vitamin D supplements. Some people are more at risk of vitamin D deficiency, and so are recommended to take vitamin D supplements routinely. A lack of vitamin D is very common. Vitamin D is mostly made in the skin by exposure to sunlight. Most foods contain very little vitamin D naturally, though some are fortified (enriched) with added vitamin D. A mild lack of vitamin D may not cause symptoms but can cause tiredness and general aches and pains."}, {"url": "http://www.medicinenet.com/vitamin_d_deficiency/page2.htm", "passage_text": "Yes, deficiency of vitamin D can cause bone pain and muscle weakness. However, mild vitamin D deficiency is not necessarily associated with any symptoms. Vitamin D has been referred to as the sunlight vitamin because it is made in our skin when we are exposed to sunlight. "}, {"url": "http://articles.mercola.com/sites/articles/archive/2014/05/28/vitamin-d-deficiency-signs-symptoms.aspx", "passage_text": "“Many of these symptoms are classic signs of vitamin D deficiency osteomalacia, which is different from the vitamin D deficiency that causes osteoporosis in adults,” he says. “What’s happening is that the vitamin D deficiency causes a defect in putting calcium into the collagen matrix into your skeleton. "}, {"url": "http://www.answers.com/Q/What_is_the_name_of_the_vitamin_D-deficiency_disease_in_adults", "passage_text": "The deficiency of Vitamin D causes osteoporosis in adults.Osteoporosis is a disease of bones that leads to an increased risk of fracture. Vitamin D is essential for strong bones, because it  helps the body use calcium from the diet.  Traditionally, vitamin D deficiency has been associated with  rickets, a dis … ease in which the bone tissue doesn't properly  mineralize, leading to soft bones and skeletal deformities."}, {"url": "http://www.neurology.org/content/74/1/e2.full", "passage_text": "Vitamin D deficiency can cause weakening of the bones, which is called “rickets” in children and “osteomalacia” in adults. It may be linked to chronic medical illnesses, such as heart disease and diabetes. In the brain, vitamin D deficiency may be linked to cognitive impairment. Vitamin D deficiency has many causes. It can occur in people who cannot get vitamin D, such those who do not get enough sunlight. Older adults are at risk for developing vitamin D deficiency because they are not able to make enough of the vitamin in the skin."}, {"url": "http://www.webmd.com/diet/guide/vitamin-d-deficiency", "passage_text": "Symptoms of bone pain and muscle weakness can mean you have a vitamin D deficiency. However, for many people, the symptoms are subtle. Yet, even without symptoms, too little vitamin D can pose health risks. Because the body makes vitamin D when your skin is exposed to sunlight, you may be at risk of deficiency if you are homebound, live in northern latitudes, wear long robes or head coverings for religious reasons, or have an occupation that prevents sun exposure. You have dark skin."}]