[{"url": "http://www.hpcorporategroup.com/pros-and-cons-of-biodegradable-packing-peanuts.html", "passage_text": "Biodegradable packing peanuts are made from natural, nontoxic sources, such as wheat and corn starch. They dissolve in water and can be thrown into compost piles after a single use. In addition, biodegradable foam peanuts do not have an electrostatic charge, meaning they will not stick to clothes. Here, we will examine the pros and cons of biodegradable peanuts. Pros: Composed of polystyrene, a plastic polymer better known as Styrofoam, traditional loose fill packing peanuts are difficult to decompose. After disposal, they can end up in a landfill or floating around the ocean for many, many years."}, {"url": "http://premierhandling.com/history-packing-peanuts/", "passage_text": "Packing peanuts were invented in 1965 by Dow Chemical. There are two types of packing peanuts, those made from foam, and those made from starches like corn or grain sorghum. Polystyrene-based packing peanuts were invented in 1965 and have been used ever since. Polystyrene packing peanuts can be used over and over again and can be recycled at shipping stores around the world. Ever since the early 1990s, corn starch has been increasingly used to form packing peanuts. these are more environmentally-friendly as they can be dissolved in water. They are also non-toxic to humans and pets if accidentally ingested. "}, {"url": "http://www.farmshow.com/a_article.php?aid=9697", "passage_text": "Packing peanuts made out of corn. Here's another exciting new use for corn - packing peanuts made out of cornstarch using a revolutionary new process that makes conventional hard-to-get-rid-of polystyrene peanuts obsolete. «Previous Next». Packing peanuts made out of corn. Here's another exciting new use for corn - packing peanuts made out of cornstarch using a revolutionary new process that makes conventional hard-to-get-rid-of polystyrene peanuts obsolete. New cornstarch peanuts are easy to dispose of since they dissolve in water."}, {"url": "https://en.wikipedia.org/wiki/Foam_peanut", "passage_text": "Foam peanuts (made of expanded polystyrene. Packaging peanuts made from bioplastics (thermoplastic starch). Foam peanuts, also known as packing peanuts, styrofoam popcorn or packing noodles are a common loose-fill packaging and cushioning material used to prevent damage to fragile objects during shipping. They are shaped to interlock when compressed and free flow when not compressed. They are roughly the size and shape of an unshelled peanut and commonly made of expanded polystyrene foam. Two to three inches (50–75 mm) of peanuts are typically used for cushioning and void filling packaging applications."}, {"url": "https://en.wikipedia.org/wiki/Foam_peanut", "passage_text": "Polystyrene-based packing peanuts were developed and patented by Tektronix Inc. They were made commercially available circa 1965 by Dow Chemical. Originally made from 100% virgin polystyrene resin, peanuts made from 100% recycled polystyrene have been commercially available since the mid-90s. They are shaped to interlock when compressed and free flow when not compressed. They are roughly the size and shape of an unshelled peanut and commonly made of expanded polystyrene foam. Two to three inches (50–75 mm) of peanuts are typically used for cushioning and void filling packaging applications."}, {"url": "http://www.cupcakeproject.com/2008/05/i-ate-packing-peanut-from-wholly.html", "passage_text": "November 23, 2008 at 12:19 pm. Packing peanuts that are made from EPS, Corn, or Wheat should not be eaten! They are at least 5% plastic and will build up in your system. The only truly biodegradable packing peanuts in the US are Puffy Stuff of Tennessee. "}, {"url": "http://www.hpcorporategroup.com/pros-and-cons-of-biodegradable-packing-peanuts.html", "passage_text": "Fortunately, with the increasing awareness of the materials' impact on the environment, biodegradable packing peanuts are now available as a more eco-friendly alternative to the traditional polystyrene peanuts. Here, we will examine the pros and cons of biodegradable peanuts. Pros: Composed of polystyrene, a plastic polymer better known as Styrofoam, traditional loose fill packing peanuts are difficult to decompose. After disposal, they can end up in a landfill or floating around the ocean for many, many years."}, {"url": "http://www.farmshow.com/a_article.php?aid=9697", "passage_text": "Packing peanuts made out of corn AG WORLD Ag World 15-4-19 Here's another exciting new use for corn - packing peanuts made out of cornstarch using a revolutionary new process that makes conventional hard-to-get-rid-of polystyrene peanuts obsolete. «Previous Next». Packing peanuts made out of corn. Here's another exciting new use for corn - packing peanuts made out of cornstarch using a revolutionary new process that makes conventional hard-to-get-rid-of polystyrene peanuts obsolete. New cornstarch peanuts are easy to dispose of since they dissolve in water."}]