[{"url": "http://www.rockliffs.com.au/articles/types-of-assets-that-can-be-acquired-by-a-self-managed-superannuation-fund-from-a-related-party/", "passage_text": "1 A loan to a related party: An SMSF can loan money to a related party (apart from members and relatives) as long as the money lent does not exceed more than five per cent (5%) of the value of the SMSF’s total assets. Types of Assets that can be acquired by a Self-Managed Superannuation Fund from a Related Party. Related Party. The definition of a “Related Party” under s.10 of the Superannuation Industry (Supervision) Act 1993 (“SISA”) is very broad and includes: 1  Members of the Self-Managed Superannuation Fund (“SMSF”);"}, {"url": "http://aquilasuper.com/blog/accountants/smsf-related-party-leases-and-tenant-fit-out/", "passage_text": "1 A market rate of rent must be paid by the related party tenant to the SMSF. 2  There should be a written lease in place. 3  Rent is paid regularly and pursuant to the lease. 4  If rent isn’t paid the SMSF trustee needs to enforce the terms of the lease as any third party landlord would in similar circumstances. While trustees are permitted to lease business real property to related parties, there are rules that must be followed to ensure that the arrangement meets the legislative requirements. This includes that: 1  A market rate of rent must be paid by the related party tenant to the SMSF."}, {"url": "http://dmgfinancial.com.au/smsfs-and-related-party-transfers/", "passage_text": "“In-house assets”. Your SMSF can invest up to 5% of your SMSF’s value in “in-house assets”. An in-house asset is a loan to, or an investment in a related party or trust of your SMSF or a lease arrangement with a related party or trust. For instance, an SMSF can acquire shares in the member’s brother’s business as long as the value of those shares does not exceed 5% of the fund’s total market value. A related party of your SMSF broadly includes any other member of the SMSF, an employer that contributes to the fund by agreement (“standard employer-sponsor”), your relatives, partners, and companies where the member or standard employer-sponsor controls or significantly influences the company."}, {"url": "http://www.rockliffs.com.au/articles/types-of-assets-that-can-be-acquired-by-a-self-managed-superannuation-fund-from-a-related-party/", "passage_text": "In-House Asset Provisions. An “In-House Asset” under s.71 of the SISA is an asset of an SMSF that is a loan to, or an investment in, a related party of the SMSF, or an asset of the SMSF subject to a lease between a trustee of an SMSF and a related party of the SMSF. Types of Assets that can be acquired by a Self-Managed Superannuation Fund from a Related Party. Related Party. The definition of a “Related Party” under s.10 of the Superannuation Industry (Supervision) Act 1993 (“SISA”) is very broad and includes: 1  Members of the Self-Managed Superannuation Fund (“SMSF”);"}, {"url": "http://supervision.com.au/property/property-faq/", "passage_text": "SMSF’s are permitted to invest in residential property as long as you don’t buy the property from a related party of a member. For example, you can’t own the family home through your super fund. Nor can you rent a residential property owned by your SMSF to a fund member, or to their related parties. Generally, your SMSF can buy a beach house that you rent out to tenants who are not members of the fund, their relatives, or other unrelated parties of your fund. We recommend that you speak with a financial adviser to help you decide if buying property through your super fund is right for you."}, {"url": "http://aquilasuper.com/blog/accountants/smsf-related-party-leases-and-tenant-fit-out/", "passage_text": "Accountants, Financial Planners, Trustees. Comments Off on SMSF related party leases and a tenant fit out. A great advantage of an SMSF investing in business real property is that the trustee is able to lease the property to a member or a related party tenant. While trustees are permitted to lease business real property to related parties, there are rules that must be followed to ensure that the arrangement meets the legislative requirements. This includes that: 1  A market rate of rent must be paid by the related party tenant to the SMSF."}, {"url": "http://www.rockliffs.com.au/articles/types-of-assets-that-can-be-acquired-by-a-self-managed-superannuation-fund-from-a-related-party/", "passage_text": "1 An asset of the SMSF leased to a Related Party: An SMSF can lease an asset belonging to the SMSF to a Related Party, provided the value of the assets is no more than five per cent (5%) of the value of the SMSF’s total assets. Types of Assets that can be acquired by a Self-Managed Superannuation Fund from a Related Party. Related Party. The definition of a “Related Party” under s.10 of the Superannuation Industry (Supervision) Act 1993 (“SISA”) is very broad and includes: 1  Members of the Self-Managed Superannuation Fund (“SMSF”);"}, {"url": "http://www.dbalawyers.com.au/ato/lrbas-related-party-leases-need-know/", "passage_text": "In-house assets include assets of a fund that are subject to a lease or lease arrangement between the trustee and a related party. One exception to this rule is where the lease or lease arrangement is in respect of business real property. However, where the complexity arises is where the related party tenant wishes to make changes or improvements to the property. Invariably, on the exit of a prior commercial tenant a refurbishment is required. Indeed, economic changes may force a change in use and layout during a lease term."}]