[{"url": "http://homeguides.sfgate.com/need-grow-black-wax-beans-67688.html", "passage_text": "Water. Give black wax beans enough water to produce flowers and bean pods. Extreme fluctuations of soil moisture produce deformed pods. Only the first seeds develop in the pod, while the rest of the pod withers. Poor water supply causes the flowers and beans to fall off the plants prematurely. Use 1/2 cup of fertilizer for every 25 feet of planting row. These plants do not need heavy applications of nitrogen because this member of the legume family fixes nitrogen in the soil"}, {"url": "http://homeguides.sfgate.com/need-grow-black-wax-beans-67688.html", "passage_text": "The plants grow as a bush type of bean, reaching only 14 to 16 inches tall, so room for trellises is not an issue. The seeds are commonly spaced 2 to 6 inches apart in rows 18 to 36 inches apart. Use 1/2 cup of fertilizer for every 25 feet of planting row. These plants do not need heavy applications of nitrogen because this member of the legume family fixes nitrogen in the soil. Give black wax beans enough water to produce flowers and bean pods. Extreme fluctuations of soil moisture produce deformed pods."}, {"url": "https://ag.arizona.edu/pubs/garden/mg/vegetable/beans.html", "passage_text": "Beans are light feeders. Since beans are legumes they will fix nitrogen once a good root system is established; inoculation will speed the process. Excess nitrogen will delay flowering, so sidedress only after heavy bloom and set of pods, using l 1/2 ounces or 3 tablespoons of 10-10-10 per 10-foot row. End of pod will be spongy. For dry beans (of all types) pods should remain on bush until dry and brown. Approximate yields: 3 to 5 pounds snap beans, 4 to 6 pounds lima beans per 10-ft. row. Amount to Raise: 8 pounds of snap beans, 5 to 10 pounds of lima beans per person."}, {"url": "http://www.growitalian.com/beans/", "passage_text": "Posted by on. Italians love beans and the huge variety of beans we carry is a testament to that. In the markets, you see crates piled high with fancy thin filet beans, long flat beans, and plump shelling beans. We have them all, in green, purple, yellow, and speckles. "}, {"url": "http://homeguides.sfgate.com/need-grow-black-wax-beans-67688.html", "passage_text": "Black wax beans (Phaseolus vulgaris) are also known as pencil pod or Eastern black wax beans, which grow as annuals in every U.S. Department of Agriculture plant hardiness zone. Use 1/2 cup of fertilizer for every 25 feet of planting row. These plants do not need heavy applications of nitrogen because this member of the legume family fixes nitrogen in the soil. Give black wax beans enough water to produce flowers and bean pods. Extreme fluctuations of soil moisture produce deformed pods."}, {"url": "http://homeguides.sfgate.com/need-grow-black-wax-beans-67688.html", "passage_text": "Loose soil makes it easier for the seeds to emerge from the ground. Mixing in a 5-10-10 slow-release fertilizer into the top 6 inches of soil gives the bean plants a head start. Use 1/2 cup of fertilizer for every 25 feet of planting row. These plants do not need heavy applications of nitrogen because this member of the legume family fixes nitrogen in the soil. Give black wax beans enough water to produce flowers and bean pods. Extreme fluctuations of soil moisture produce deformed pods."}, {"url": "http://www.gardeningknowhow.com/edible/vegetables/beans/harvesting-beans-when-do-you-pick-beans.htm", "passage_text": "How to Harvest and Dry Beans. The last way to harvest shell beans is to pick the beans as dry beans. In order to do this, you will leave he beans on the vine until the pod and the bean is dry and hard. Once he beans are dry, they can be stored in a dry, cool place for many months, even years. Print This Article."}, {"url": "http://www.seedman.com/beans.htm", "passage_text": "Bean plants need about an inch of water per week. The beans should be watered in the morning so the foliage is dry before dark. Bush beans will mature in 50 to 60 days; pole beans in 60 to 90 days. Beans are light feeders and do not need extra fertilizing as long as you plant in an enriched soil. Some dry bean varieties are viney like garden bean varieties, while others are more of an erect, bushy plant, like soybeans. Dry beans do not grow as vigorously as soybeans, usually reaching only about 18 to 24 inches in height. Pods, each containing 2 to 4 seeds, are borne upon the length of the stem. Dry beans average about 22% protein in the seed. The amino acid profile of dry beans complements that of corn and other cereal grains, which is why the corn-bean diet was so standard through the Americas"}, {"url": "http://www.seedsofindia.com/Beans.htm", "passage_text": "Also known as asparagus bean. Heat and wet tolerant. Pods: long and slender, 50 to 70 cm long, medium green color. The vines are rampant climbers, so plant next to a bean tower or trellis. Maturity: beginning of harvest 50-60 days after sowing. Pick beans when they are the width of a pencil"}]