[{"url": "http://jewelrygemsabout.com/gems/agate.html", "passage_text": "AGATE JEWELRY. Agates have been worked since prehistoric times, and were among the world's first lapidary materials. Since ancient times agate gemstones used for making jewelry, beads, rings, earrings, brooches and bowles. Often made of agate intaglio-stones with carved patterns, which are usually used as a stamp. Cylinder stamps from agate existed in Mesopotamia had for 4000 years BC. Greek master maded agate cameo from embossed."}, {"url": "https://en.wikipedia.org/wiki/Agate", "passage_text": "Agate /ˈaeɡət/ ˈæɡət is a cryptocrystalline variety of, silica chiefly, chalcedony characterised by its fineness of grain and brightness of. color The first deposit on the wall of a cavity, forming the skin of the agate, is generally a dark greenish mineral substance, like celadonite, delessite or  green earth , which are rich in iron probably derived from the decomposition of the augite in the enclosing volcanic rock."}, {"url": "http://www.merriam-webster.com/dictionary/agate", "passage_text": "Definition of AGATE for Kids. : a mineral that is a form of quartz with colors arranged in stripes or patches and that is used especially in jewelry. "}, {"url": "http://www.jewelrysupply.com/agate-beads", "passage_text": "Home Beads Gemstone Beads Agate. Agate is a type of chalcedony quartz that forms by filling a cavity in a rock. When extracted, the layers that have formed resemble that of tree rings. Varieties of agate are formed by the differences in shape and color of these bands. "}, {"url": "http://www.collectorsweekly.com/fine-jewelry/agate", "passage_text": "Agates are a type of chalcedony, which is a cryptocrystalline quartz. Agates grow in the voids of rock masses such as lavas, building themselves in layers from the outside-in over millions of years. As the softer, surrounding rock erodes away, the agates remain. "}, {"url": "http://www.ross-simons.com/content/jewelry-reference/agate-gemstones.htm", "passage_text": "Ross-Simons' Agate Jewelry. Agate is a variety of chalcedony that comes in variety colors making it ideal for all kinds of jewelry designing. Blue agate is as expected, light blue. Moss agate is dark green, often with clear patches. Tree agate is green and white. Agate: Stripes Earned by Nature. With its combination of earthiness and elegance, agate is one of the most unusual gemstones. There are many varieties of agate, including blue lace agate, moss agate, tree agate and petrified wood."}, {"url": "http://www.gemselect.com/gem-info/agate/agate-gemstone-information-and-education.php", "passage_text": "Agate gemstones are one of the oldest stones in recorded history. Agate is known as a stone of protection, protecting one from nightmares, stress and fatigue. Since biblical times, agates have been worn and used in jewelry to protect against imminent storms. Agate belongs to the quartz (silicon dioxide) family of minerals. Quartz is the second most abundant mineral found on earth’s continental crust, second only to the feldspar mineral group. Quartz is distinguished and separated into two main branches: macrocrystalline quartz and cryptocrystalline quartz."}, {"url": "http://www.bernardine.com/gemstones/agates.htm", "passage_text": "See agate jewelry. Agate is the Mystical birthstone for September. It is also the birth stone for the Zodiac sign of Gemini (see the birthstone list for other references to agate). Agate is the accepted gemstone for the 12th and 14th wedding anniversaries. A very small sample of some of the many agates which are found all over the world. Plume agate is another that often brings high dollar. Agate is found all over the world including: the Africa, Asia, Brazil, Egypt, Germany, India, Italy, Mexico, Nepal, and the USA. Pictures and description of Montana Agate."}]