[{"url": "https://en.wikipedia.org/wiki/Gourami", "passage_text": "Gouramis, particularly the three spot and dwarf, are often kept in home aquaria. As labyrinth fish, they will often swim near the top of the tank. As with other tropical freshwater fish, an aquarium heater is often used. Gouramis will eat either prepared or live foods. The fish are native to Asia, from Pakistan and India to the Malay Archipelago and north-easterly towards Korea. The name gourami, of Javanese origin, is also used for fish of the families Helostomatidae and Anabantidae. Many gouramis have an elongated, feeler-like ray at the front of each of their pelvic fins."}, {"url": "http://freshaquarium.about.com/video/How-to-Care-for-Gourami-Fish.htm", "passage_text": "There are over twelve species of Gourami. All of the species come from Africa and Asia. Most of what you get in aquariums have been captive bred, so not directly from either of those areas. They are a very hearty fish, a very easy fish to care for, a pretty good beginner fish. "}, {"url": "http://www.youtube.com/watch?v=Dy9nwhB_wK4", "passage_text": "Gourami fish originate from Africa and Asia and are a popular fish for home aquariums. Watch this About.com video to learn how to care for Gourami, a freshwater fish. "}, {"url": "https://en.wikipedia.org/wiki/Gourami", "passage_text": "Gouramis or gouramies (i) [go rɒm ee] are a group of freshwater perciform fishes that comprise the family, Osphronemidae. The fish are native to Asia, from Pakistan and India to the Malay Archipelago and north-easterly towards Korea. The name gourami, of Javanese origin, is also used for fish of the families Helostomatidae and Anabantidae. Many gouramis have an elongated, feeler-like ray at the front of each of their pelvic fins."}, {"url": "http://fish-etc.com/fish/gouramis", "passage_text": "Gouramis. The Gourami family, Osphronemidae, stems from the freshwater perciform fishes. They are native to Asia, from Pakistan and India to the Malay Archipelago and further north-easterly towards Korea. The name “gourami” is also used for fish of the families Helostomatidae and Anabantidae. Just for interest sake, the plural “Gouramis” so commonly used among aquarists, is an example of a redundant plural. In its original language, ‘Gourami’ is already plural."}, {"url": "http://www.aquaticcommunity.com/gourami/fish.php", "passage_text": "All Gourami species originate from Africa and Asia, and there are approximately 12 different Gourami species frequently kept in aquariums today. Many of the Gourami species can be found in several different colour variations. The Gourami species named Osphronemus goramy is considered the “true Gourami”. It originates from Indonesia, but is today found wild in Chinese and South Asian waters as well. It has been deliberately introduced by man and is considered a delicates."}, {"url": "http://www.wikihow.com/Care-for-a-Dwarf-Gourami", "passage_text": "Only one gourami per aquarium or a pair but, should come from the SAME aquarium and the SAME store! Gouramis are like betta fish; they will attack fish that resemble the physical appearance of a betta fish. 1. Know your fish. The dwarf gourami is one of the smallest of the Belontiidae Family. Which since they are 2 inches (5.1 cm) in size they would make a great center piece for a smaller community aquarium maybe the size of 20 gallons (75 Liters). Like most tropical fish, they appear vibrant"}, {"url": "https://en.wikipedia.org/wiki/Dwarf_gourami", "passage_text": "The dwarf gourami (Trichogaster lalius) is a species of gourami native to South Asia. The dwarf gourami is native to Pakistan, India and Bangladesh. However, it has also been widely distributed outside of its native range. It is an inhabitant of slow-moving waters in rivulets, streams and lakes occurring in areas with plentiful vegetation."}, {"url": "https://en.wikipedia.org/wiki/Dwarf_gourami", "passage_text": "Dwarf gouramis are generally peaceful fish. The much larger standard gourami can become aggressive. They do well in most community aquariums and they are good with most fish: beta, platys, Mollys, plecs, ghost catfish etc.They require a tank that is at least ten gallons (twenty gallons is much better). The dwarf gourami is native to Pakistan, India and Bangladesh. However, it has also been widely distributed outside of its native range. It is an inhabitant of slow-moving waters in rivulets, streams and lakes occurring in areas with plentiful vegetation."}]