[{"url": "http://www.mrlinfo.org/history/lostrichmond/starrpiano.htm", "passage_text": "In 1893 it became the Starr Piano Company, and it soon became a sprawling complex of buildings and lumber yards and one of the biggest employers in Richmond. By the 1920s, it was manufactuing not only pianos but phonographs, and, to go with the phonographs it began producing records. The Starr Piano Company began as the Trayser Piano Co. in 1872. One if its founders was James Starr. In 1878, the company was reorganized as the Chase Piano Company, and Benjamin Starr joined his brother James in the business."}, {"url": "http://www.starrgennett.org/starr-piano-and-gennett-records/", "passage_text": "But because other piano and phonograph companies were reluctant to sell in their own stores records bearing the name of a competitor, Starr soon changed its label to Gennett, for Henry Gennett, by then the company’s president. By the mid-1880s, the growing factory operated in the gorge of the Whitewater River under the “Starr” name. In 1893, three Southern investors, including Henry Gennett of Nashville, Tennessee, acquired control of the company. At the turn of the century, the Gennett family assumed full ownership of Starr Piano."}, {"url": "https://en.wikipedia.org/wiki/Gennett_Records", "passage_text": "Gennett Records was founded in Richmond, Indiana by the Starr Piano Company. It released its first records in October 1917. The company took its name from its top managers: Harry, Fred and Clarence Gennett. Earlier, the company had produced recordings under the Starr Records label."}, {"url": "http://www.starrcompanies.com/WhoWeAre", "passage_text": "Starr & Co., Inc. The shared history of STARR Companies can be traced back to December 1919, when Cornelius Vander Starr founded an insurance company in Shanghai, China. Starr formed STARR International in September 1943 in Panama"}, {"url": "http://www.collectorsworldonline.com/genett-starr.html", "passage_text": "Old rugs hung from the ceiling. Walls were stuffed with straw to dampen the racket made by passing locomotives. These were the humble beginnings of the first recorded jazz music in the country.Gennett records was founded in Richmond, Indiana by the Starr Piano Company, and released its first records in October 1917. Earlier, the company had produced recordings under the Starr Records label. The early issues were vertically cut in the gramophone record grooves, using the hill-and-dale method of a U-shaped groove and sapphire ball stylus, but they switched to the more popular lateral cut method in April 1919."}, {"url": "http://www.mrlinfo.org/history/lostrichmond/starrpiano.htm", "passage_text": "Starr Piano Factory South First Street 1884 From a map published by O. H. Bailey & Co., Boston The Starr Piano Company began as the Trayser Piano Co. in 1872. One if its founders was James Starr. In 1878, the company was reorganized as the Chase Piano Company, and Benjamin Starr joined his brother James in the business. In 1884 they bought 23 acres in the Whitewater Valley gorge and constructed a six-story factory powered by the river."}, {"url": "http://www.starrgennett.org/starr-piano-and-gennett-records/", "passage_text": "STARR PIANO AND GENNETT RECORDS. The Starr Piano Company story begins in Richmond in 1872 when two business leaders, including James Starr, partnered with Alsatian piano craftsman George Trayser to open a small piano factory downtown. By the mid-1880s, the growing factory operated in the gorge of the Whitewater River under the “Starr” name. In 1893, three Southern investors, including Henry Gennett of Nashville, Tennessee, acquired control of the company. At the turn of the century, the Gennett family assumed full ownership of Starr Piano."}, {"url": "http://antiquepianoshop.com/online-museum/starr/", "passage_text": "The prestigious Starr Piano Company was established in Richmond, Indiana in 1872 by founder James M. Starr. Starr was known for building very high quality instruments, and they enjoyed huge success well into the 20th Century. "}, {"url": "https://en.wikipedia.org/wiki/Apple_Records", "passage_text": "Apple Records is a record label founded by the Beatles in 1968, as a division of Apple Corps Ltd. It was initially intended as a creative outlet for the Beatles, both as a group and individually, plus a selection of other artists including Mary Hopkin, James Taylor, Badfinger, and Billy Preston. Apple Records' distribution contract with EMI expired in 1976 and control of the Beatles' catalogue, including solo recordings to date by George Harrison, John Lennon and Ringo Starr, reverted to EMI (Paul McCartney had acquired ownership of his solo recordings when he re-signed with Capitol in 1975)."}, {"url": "http://classic.motown.com/history/", "passage_text": "THE STORY OF MOTOWN RECORDS. With an $800 loan from his family, Berry Gordy Jr. established Motown Records in January 1959. Within a few years, this Detroit-based outfit was selling more singles and releasing more hits than any other record company. Beyond the formidable music and sales figures, Motown itself became a cultural icon"}]