[{"url": "http://www.famousscientists.org/benjamin-franklin/", "passage_text": "Benjamin Franklin was born on January 17, 1706, in Boston, Massachusetts. His father, Josiah, was a tallow chandler, candle maker, and soap boiler who had moved to the American Colonies from England. "}, {"url": "http://www.history.com/this-day-in-history/benjamin-franklin-dies", "passage_text": "On April 17, 1790, American statesman, printer, scientist, and writer Benjamin Franklin dies in Philadelphia at age 84. Born in Boston in 1706, Franklin became at 12 years old an apprentice to his half brother James, a printer and publisher. "}, {"url": "http://www.answers.com/Q/Where_was_Benjamin_Franklin_born", "passage_text": "Benjamin Franklin was born on January 17, 1706 on Milk Street in Boston, Massachusetts. He died on April 17, 1790 at his home in Philadelphia. http://www.revolutionary-war-a … nd-beyond.com/facts-about-benjamin-franklin.html. Benjamin Franklin was born in Boston on January 17, 1706. He died in Philadelphia on April 17, 1790 at the age of 84. Over 20,000 people attended his funeral. 69 people found this useful."}, {"url": "http://www.biography.com/people/benjamin-franklin-9301234", "passage_text": "Early Life. Benjamin Franklin was born on January 17, 1706, in Boston in what was then known as the Massachusetts Bay Colony. His father, Josiah Franklin, a soap and candle maker, had 17 children, seven with first wife, Anne Child, and 10 with second wife Abiah Folger. Benjamin was his 15th child and the last son. "}, {"url": "http://www.answers.com/Q/When_was_benjamin_franklin_born_and_when_did_he_die", "passage_text": "Benjamin Franklin was born in Boston on January 17, 1706. He died in Philadelphia on April 17, 1790 at the age of 84. Benjamin Franklin was born on January 17, 1706 on Milk Street in Boston, Massachusetts. He died on April 17, 1790 at his home in Philadelphia."}, {"url": "http://www.ushistory.org/franklin/info/", "passage_text": "Benjamin Franklin was born in Boston on January 17, 1706. He was the tenth son of soap maker, Josiah Franklin. Benjamin's mother was Abiah Folger, the second wife of Josiah. In all, Josiah would father 17 children. Josiah intended for Benjamin to enter into the clergy. "}, {"url": "http://www.history.com/topics/american-revolution/benjamin-franklin", "passage_text": "One of the leading figures of early American history, Benjamin Franklin (1706-90) was a statesman, author, publisher, scientist, inventor and diplomat. Born into a Boston family of modest means, Franklin had little formal education. Benjamin Franklin was born on January 17, 1706, in colonial Boston. His father, Josiah Franklin (1657-1745), a native of England, was a candle and soap maker who married twice and had 17 children."}, {"url": "http://www.americaslibrary.gov/aa/franklinb/aa_franklinb_subj.html", "passage_text": "Benjamin Franklin. Born: January 17 [Jan. 6, Old Style], 1706 Died: April 17, 1790 Benjamin Franklin was many things: a printer, writer, scientist, inventor, statesman, civic leader, and diplomat. As a scientist, he is best known for his experiments with electricity. As a writer, he is known for Poor Richard's Almanac and his autobiography"}, {"url": "http://www.notablebiographies.com/Fi-Gi/Franklin-Benjamin.html", "passage_text": "Benjamin Franklin was born on January 17, 1706, in Boston, Massachusetts, into a devoted Puritan household. (The Puritans were a religious group that stood against the practices of the Church of England.) In 1683 his family had left England and moved to New England in search of religious freedom. Born: January 17, 1706 Boston, Massachusetts Died: April 17, 1790 Philadelphia, Pennsylvania. American scholar, diplomat, author, scientist, and inventor. B enjamin Franklin was a leader of America's revolutionary generation."}]