[{"url": "http://www.lifeextension.com/Protocols/Health-Concerns/Chronic-Pain/Page-03", "passage_text": "Nociceptive Pain and Inflammation. Inflammation and nociceptive pain go hand-in-hand. Inflammation is initiated upon tissue injury and sets off a cascade of biochemical reactions that prime the nervous system for pain sensing. Moreover, long-term inflammation reinforces adaptive changes in the nervous system that can cause the sensation of pain to become exaggerated or inappropriate (Ji 2011). Therefore, taking steps to ease inflammation is an effective means of interfering with the process of pain sensitization. This is why drugs like acetaminophen (the active ingredient in Tylenol®) and ibuprofen, which are anti-inflammatory in nature, relieve pain."}, {"url": "http://www.health.com/health/gallery/0,,20705881,00.html", "passage_text": "Inflammation is part of the body’s immune response; without it, we can't heal. But when it's out of controlas in rheumatoid arthritisit can damage the body. Plus, it's thought to play a role in obesity, heart disease, and cancer. Foods high in sugar and saturated fat can spur inflammation. "}, {"url": "https://en.wikipedia.org/wiki/Inflammation", "passage_text": "Inflammation (Latin, inflammatio) is part of the complex biological response of body tissues to harmful stimuli, such as pathogens, damaged cells, or irritants. Inflammation is a protective response that involves immune cells, blood vessels, and molecular mediators. Inflammation can be classified as either acute or chronic. Acute inflammation is the initial response of the body to harmful stimuli and is achieved by the increased movement of plasma and leukocytes (especially granulocytes) from the blood into the injured tissues."}, {"url": "http://www.cdc.gov/ibd/what-is-ibd.htm", "passage_text": "Inflammatory bowel disease (IBD) is a broad term that describes conditions with chronic or recurring immune response and inflammation of the gastrointestinal tract. The two most common inflammatory bowel diseases are ulcerative colitis and Crohn’s disease. "}, {"url": "http://www.webmd.com/arthritis/about-inflammation", "passage_text": "Inflammation is a process by which the body's white blood cells and substances they produce protect us from infection with foreign organisms, such as bacteria and viruses. Some, but not all, types of arthritis are the result of misdirected inflammation. Arthritis is a general term that describes inflammation in the joints. Some types of arthritis associated with inflammation include the following: 1  Rheumatoid arthritis."}, {"url": "http://www.webmd.com/arthritis/about-inflammation", "passage_text": "When inflammation occurs, chemicals from the body's white blood cells are released into the blood or affected tissues to protect your body from foreign substances. This release of chemicals increases the blood flow to the area of injury or infection, and may result in redness and warmth. Some, but not all, types of arthritis are the result of misdirected inflammation. Arthritis is a general term that describes inflammation in the joints. Some types of arthritis associated with inflammation include the following: 1  Rheumatoid arthritis."}, {"url": "https://en.wikipedia.org/wiki/Inflammation", "passage_text": "The purpose of inflammation is to eliminate the initial cause of cell injury, clear out necrotic cells and tissues damaged from the original insult and the inflammatory process, and to initiate tissue repair. The classical signs of acute inflammation are pain, heat, redness, swelling, and loss of function. Inflammation can be classified as either acute or chronic. Acute inflammation is the initial response of the body to harmful stimuli and is achieved by the increased movement of plasma and leukocytes (especially granulocytes) from the blood into the injured tissues."}, {"url": "https://www.womentowomen.com/inflammation/causes-of-inflammation/", "passage_text": "Infection or injury trigger a chain of events called the inflammatory cascade. The familiar signs of normal inflammation — heat, pain, redness, and swelling — are the first signals that your immune system is being called into action. "}, {"url": "http://www.healthline.com/health-slideshow/inflammatory-arthritis", "passage_text": "Arthritis is a condition in which one or more of your joints are inflamed. This can result in stiffness, soreness, and in many cases, swelling. Inflammatory and non-inflammatory arthritis are the two most common forms of the condition. However, there are dozens of different arthritis types. Even though it is called non-inflammatory arthritis, OA still results in inflammation of the joints. The difference is that this inflammation is the result of wear and tear. In particular, OA results from the breakdown of cartilage."}]