[{"url": "http://www.thefreedictionary.com/deteriorate", "passage_text": "1. deteriorate-become worse or disintegrate; His mind deteriorated. go to pot, go to the dogs-become ruined; His business went to pot when economy soured. decay, dilapidate, crumble-fall into decay or ruin; The unoccupied house started to decay. References in classic literature? Hannah was so satisfied with her own unexpectedly radiant prospects that she hardly realized her mother's anxieties; for there are natures which flourish, in adversity, and deteriorate when exposed to sudden prosperity."}, {"url": "http://dictionary.reverso.net/english-cobuild/deteriorate", "passage_text": "deteriorate (deteriorates 3rd person present) (deteriorating present participle) (deteriorated past tense & past participle) If something deteriorates, it becomes worse in some way. verb (Antonym: improve) There are fears that the situation might deteriorate into full-scale war... V ♦ deterioration n-uncount (Antonym: improvement) ...concern about the rapid deterioration in relations between the two countries."}, {"url": "http://www.merriam-webster.com/dictionary/deteriorate", "passage_text": "Origin of DETERIORATE. Late Latin deterioratus, past participle of deteriorare, from Latin deterior worse, from de- + -ter (suffix as in Latin uter which of two) + -ior (comparative suffix) — more at whether, -er. First Known Use: 1572."}, {"url": "http://www.yourdictionary.com/deteriorate", "passage_text": "-·rat·ed, -·rat·ing. to make or become worse; lower in quality or value; depreciate. ; from Late Latin deterioratus, past participle of deteriorare, to make worse; from Classical Latin deterior, worse, inferior; from an unverified form deter, below; from de-, from + -ter, comparative suffix. Origin of deteriorate. To diminish or impair in quality, character, or value: Time and neglect had deteriorated the property. verb. 1  To grow worse; degenerate: The weather deteriorated overnight. 2  To weaken or disintegrate; decay: The nation's highways are deteriorating at a rapid pace."}, {"url": "http://www.yourdictionary.com/deteriorate", "passage_text": "Buildings deteriorating. Buildings deteriorating. Deteriorate is defined as to make or become worse or lower in value or quality. 1  An example of deteriorate is a child's mood going from happy to crying. 2  An example of deteriorate is an orange going from ripe to moldy. To diminish or impair in quality, character, or value: Time and neglect had deteriorated the property. verb. 1  To grow worse; degenerate: The weather deteriorated overnight. 2  To weaken or disintegrate; decay: The nation's highways are deteriorating at a rapid pace."}, {"url": "http://www.merriam-webster.com/dictionary/deteriorate", "passage_text": "Full Definition of DETERIORATE. transitive verb. 1. : to make inferior in quality or value: impair. 2. : disintegrate. intransitive verb. — de·te·ri·o·ra·tive \\-ˌrā-tiv\\ adjective. See deteriorate defined for English-language learners. See deteriorate defined for kids. Late Latin deterioratus, past participle of deteriorare, from Latin deterior worse, from de- + -ter (suffix as in Latin uter which of two) + -ior (comparative suffix) — more at whether, -er. First Known Use: 1572."}, {"url": "http://www.thefreedictionary.com/deteriorate", "passage_text": "It contained about three hundred and twenty cubic feet of gas, which, if pure hydrogen, would support twenty-one pounds upon its first inflation, before the gas has time to deteriorate or escape. References in classic literature? Hannah was so satisfied with her own unexpectedly radiant prospects that she hardly realized her mother's anxieties; for there are natures which flourish, in adversity, and deteriorate when exposed to sudden prosperity."}, {"url": "http://www.definitions.net/definition/deteriorate", "passage_text": "Wiktionary (0.00 / 0 votes) Rate this definition: deteriorate (Verb). To make worse; to make inferior in quality or value; to impair. deteriorate (Verb). To grow worse; to be impaired in quality; to degenerate. Princeton's WordNet (5.00 / 1 vote) Rate this definition: deteriorate (verb). become worse or disintegrate. His mind deteriorated. devolve, deteriorate, drop, degenerate (verb). grow worse."}, {"url": "http://www.yourdictionary.com/deteriorate", "passage_text": "(third-person singular simple present deteriorates, present participle deteriorating, simple past and past participle deteriorated). 1  To make worse; to make inferior in quality or value; to impair. To diminish or impair in quality, character, or value: Time and neglect had deteriorated the property. verb. 1  To grow worse; degenerate: The weather deteriorated overnight. 2  To weaken or disintegrate; decay: The nation's highways are deteriorating at a rapid pace."}]