[{"url": "http://www.howtocallabroad.com/sweden/", "passage_text": "Calling Sweden from the United States explained: 1  011 - US exit code; dial first for international calls made from the USA or Canada. 2  Phone Number (may not begin with 0): 3  fixed - 7 to 9 digits, area code included. "}, {"url": "http://www.wikihow.com/Call-the-United-States-From-Sweden", "passage_text": "Dial 00, the exit code to make an international call from Sweden. 1  The exit code (also known as an international access code) depends on where you're calling from. 2  If you're using an international roaming or global cellular phone in Sweden, you still need to dial the Swedish exit code to make an international call. 1 Zero-zero is the exit code for Sweden and most of Europe, but if you were placing a call from the United States or Canada you would dial 011 instead"}, {"url": "https://en.wikipedia.org/wiki/List_of_international_call_prefixes", "passage_text": "An international call prefix or dial out code is a trunk prefix used to select an international telephone circuit for placing an international call. The prefix must be dialed before the country calling code and the destination telephone number. It is synonymous with international access code or exit code. The international call prefix is part of the telephone numbering plan of a country for calls to another country."}, {"url": "https://www.countrycode.org/switzerland", "passage_text": "CountryCode.org is your complete guide to make a call from anywhere in the world, to anywhere in the world. This page details Switzerland phone code. The Switzerland country code 41 will allow you to call Switzerland from another country. Switzerland telephone code 41 is dialed after the IDD. Switzerland international dialing 41 is followed by an area code. The Switzerland area code table below shows the various city codes for Switzerland. "}, {"url": "http://www.prokerala.com/how-to/call/sweden", "passage_text": "There are 264 area codes in Sweden. Sweden area codes usually have 1, 2 or 3 digits. While calling Sweden from abroad, you need to dial the ISD code followed by the area code and finally the phone number. Given below is a list of area codes for calling Sweden's major cities/regions. Given below is the procedure and dialing codes for making international calls to Sweden mobile or land line. While calling to Sweden from abroad, the dialing procedure is same whether you are calling from Land phone or cell phone. The international dialing codes and dialing format to call Sweden is :"}, {"url": "http://www.wikihow.com/Call-the-United-States-From-Sweden", "passage_text": "1. Dial 00, the exit code to make an international call from Sweden. 1  The exit code (also known as an international access code) depends on where you're calling from. 2  Zero-zero is the exit code for Sweden and most of Europe, but if you were placing a call from the United States or Canada you would dial 011 instead. 1 Zero-zero is the exit code for Sweden and most of Europe, but if you were placing a call from the United States or Canada you would dial 011 instead. 2  If you're using an international roaming or global cellular phone in Sweden, you still need to dial the Swedish exit code to make an international call."}, {"url": "https://www.globaltel.com/international-call-prefixes.aspx", "passage_text": "When calling a phone number in another country, there is always a prefix to dial that indicates you are placing an international call; this prefix varies by country. After the international dialling prefix, you dial the international country code for the country you are calling, followed by the local number. In many cases, the international dialing prefix is simply 00. This was set as a standard by the International Telecommunications Union. However, not every country has adopted this method for their own phone prefix system. These countries have special international prefixes."}, {"url": "http://www.countrycallingcodes.com/mobile/mobile-codes.php?callfrom=United+States&callto=Sweden", "passage_text": "Tips for calling a cell phone in Sweden: To call a Swedish cell phone from a land line, simply follow the mobile country code dialing instructions above to place your call. 1  To call a Swedish cell phone from a land line, simply follow the mobile country code dialing instructions above to place your call. To call a Swedish cell phone from your cell phone, you may need to first use the + (plus) sign prior to entering the Sweden mobile code and telephone number"}, {"url": "http://www.countrycallingcodes.com/country.php?country=Sweden", "passage_text": "The Sweden country code is 46. Get the mobile country codes for Sweden. Sweden Information: Sweden Emergency Numbers. Local Telephone Prefix: More ways to call Sweden: Sweden on Wikipedia The currency of Sweden is the Swedish Krona. The nationality of Sweden is Swedes. "}, {"url": "https://en.wikipedia.org/wiki/Telephone_numbers_in_Sweden", "passage_text": "Telephone numbers in Sweden. From Wikipedia, the free encyclopedia. In Sweden, the area codes are, including the leading 0, two, three or four digits long, with larger towns and cities having shorter area codes permitting a larger number of telephone numbers in the eight to ten digits used (including the leading '0')."}]