[{"url": "http://www.answers.com/Q/What_is_the_largest_African_desert", "passage_text": "The Sahara is the largest hot desert in the world covering 3.6 milllion square miles, but Antarictica covers 5.5 million square miles and has less than 10 inches of precipitat … ion per year. therefore Antarctica is the largest desert in the world. It isn't. The Sahara Desert is only the world's largest hot desert. The world's largest desert is Antarctica since a desert is defined as an area receiving less than 250 mm or … 10 inches of precipitation per year. The Antarctic desert covers 13.9 million square kilometres, or almost 5.5 million square miles"}, {"url": "http://www.answers.com/Q/What_is_the_name_of_the_largest_desert_in_Africa", "passage_text": "It is also the largest in Africa. The second largest is the Kalahari Desert in Botswana. The Sahara is the largest desert is Africa. At over 9,400,000 square kilometres (3,630,000 sq mi), it covers most of Northern Africa, making it almost as large as Europe or the United States. It stretches from the Atlantic Ocean on the west coast of Africa to the Red Sea on the east coast of Africa. Technically, the largest desert is actually the continent of Antarctica. In terms of what most people call the largest desert, that would be the Sahara. The largest desert in … the world is not located in Africa, it is in  Antarctica. The Sahara is the largest hot  desert in the world and located in Africa."}, {"url": "http://www.livescience.com/23140-sahara-desert.html", "passage_text": "The Sahara is the world’s largest hot desert and one of the harshest environments on the planet. It is third largest desert overall after Antarctica and the Arctic, which are cold deserts. At 3.6 million square miles (9.4 million square kilometers), the Sahara, which is Arabic for The Great Desert, engulfs most of North Africa. The desert covers large sections of Algeria, Chad, Egypt, Libya, Mali, Mauritania, Morocco, Niger, Western Sahara, Sudan and Tunisia."}, {"url": "http://www.answers.com/Q/What_is_the_largest_African_desert", "passage_text": "The largest hot desert in the world, and the largest African desert, is the Sahara. It has an area of around 9,000,000 square kilometres (3,500,000 sq mi). The largest desert in the world is Antarctica. It isn't. The Sahara Desert is only the world's largest hot desert. The world's largest desert is Antarctica since a desert is defined as an area receiving less than 250 mm or … 10 inches of precipitation per year. The Antarctic desert covers 13.9 million square kilometres, or almost 5.5 million square miles"}, {"url": "http://www.eyesonafrica.net/Articles/deserts-africa.htm", "passage_text": "The Deserts of Africa -- Unimaginable Beauty. Africa-the second largest continent in the world is also home to the largest desert in the world-the Sahara. In fact there are three deserts on the continent-The Sahara, the Namib and the Kalahari"}, {"url": "http://www.mapsofworld.com/world-top-ten/world-top-ten-largest-deserts-map.html", "passage_text": "The third largest desert in the world, and the largest non-polar desert is the Sahara. Situated in North Africa, the Sahara makes up parts of Algeria, Chad, Egypt, Eritrea, Libya, Mali, Mauritania, Morocco, Niger, Sudan, Tunisia, and Western Sahara. "}, {"url": "http://geology.com/records/largest-desert.shtml", "passage_text": "The rest of Earth's deserts are outside of the polar areas. The largest is the Sahara Desert, a subtropical desert in northern Africa. It covers a surface area of about 3.5 million square miles. A list of the twenty largest non-polar deserts can be found below. When most people think of a desert they imagine a landscape covered with sand and sand dune"}]