[{"url": "http://www.wordaz.com/endoluminal.html", "passage_text": "Synonyms of endoluminal. Here you will find one or more explanations in English for the word endoluminal. Also in the bottom left of the page several parts of wikipedia pages related to the word endoluminal and, of course, endoluminal synonyms and on the right images related to the word endoluminal. 'endoluminal pulmonary artery banding: technique, applications and results'. the annals. - 'dela**** treatment of traumatic rupture of the thoracic aorta with endoluminal covered stent'. circulation 99 (4): 498–504."}, {"url": "http://www.wordaz.com/endoluminal.html", "passage_text": "- minimally invasive limited ligation endoluminal-****isted revision (miller) banding is a minimally invasive technique for banding dialysis accesses in. - the netherlands found a decrease of 5.5 bmi points in 3 months with an endoluminal sleeve. 'endoluminal pulmonary artery banding: technique, applications and results'. the annals. - 'dela**** treatment of traumatic rupture of the thoracic aorta with endoluminal covered stent'. circulation 99 (4): 498–504."}, {"url": "http://www.wordaz.com/endoluminal.html", "passage_text": "Meaning of endoluminal from wikipedia. - endoluminal capsule monitoring is a non-invasive medical diagnostic procedure which uses a miniaturized wireless radio transmitter embedded into an ingestible. - resonance imaging (mri). a virtual colonoscopy can provide 3d reconstructed endoluminal views of the bowel. 'endoluminal pulmonary artery banding: technique, applications and results'. the annals. - 'dela**** treatment of traumatic rupture of the thoracic aorta with endoluminal covered stent'. circulation 99 (4): 498–504."}, {"url": "http://www.wordaz.com/endoluminal.html", "passage_text": "Definition of endoluminal. Here you will find one or more explanations in English for the word endoluminal. Also in the bottom left of the page several parts of wikipedia pages related to the word endoluminal and, of course, endoluminal synonyms and on the right images related to the word endoluminal. 'endoluminal pulmonary artery banding: technique, applications and results'. the annals. - 'dela**** treatment of traumatic rupture of the thoracic aorta with endoluminal covered stent'. circulation 99 (4): 498–504."}, {"url": "http://www.google.com/patents/US8715335", "passage_text": "More particularly, the present invention provides an endoluminal graft, stent, stent-graft and web-stent that is made of a material having controlled heterogeneities along the blood flow or tissue-contacting surface of the stent. is a photographic top plan view of a web-stent in accordance with the present invention. The endoluminal stent-graft is characterized by having controlled heterogeneities in the stent material along the blood flow surface of the stent and the method of fabricating the stent using vacuum deposition methods."}, {"url": "http://www.google.com/patents/US8715335", "passage_text": "Patents. An implantable endoluminal device that is fabricated from materials that present a blood or body fluid and tissue contact surface that has controlled heterogeneities in material constitution. An endoluminal stent-graft and web-stent that is made of an monolithic material deposited into a monolayer and... The endoluminal stent-graft is characterized by having controlled heterogeneities in the stent material along the blood flow surface of the stent and the method of fabricating the stent using vacuum deposition methods."}, {"url": "http://www.google.com/patents/US8715335", "passage_text": "An endoluminal graft is also provided which is made of a biocompatible metal or metal-like material. The endoluminal stent-graft is characterized by having controlled heterogeneities in the stent material along the blood flow surface of the stent and the method of fabricating the stent using vacuum deposition methods."}, {"url": "http://www.google.com/patents/US8715335", "passage_text": "Controlling the surface profile of an endoluminal device is significant because blood protein interactions with surfaces of endoluminal devices appear to be the initial step in a chain of events leading to tissue incorporation of the endovascular device. The endoluminal stent-graft is characterized by having controlled heterogeneities in the stent material along the blood flow surface of the stent and the method of fabricating the stent using vacuum deposition methods."}, {"url": "http://www.acronymfinder.com/Endoluminal-Graft-(ELG).html", "passage_text": "NOTE TO EDITOR: Corvita Corporation has developed an endoluminal graft for minimally invasive repair of vascular trauma, occlusive disease and aneurysms which combines a self-expanding metallic stent with its proprietary elastomeric spun fiber graft. It offers Powerlink System, a catheter and endoluminal graft (ELG) for the treatment of abdominal aortic aneurysm, a weakening of the wall of the aorta, the artery of the body."}]