[{"url": "http://www.answers.com/Q/What_is_the_hoedown_dance", "passage_text": "the hoedown dance is a dance where you all hold hand and run aroung it a circle. it sort of a hippee dance and you dress more like a cowboy. "}, {"url": "http://whoselineisitanyway.wikia.com/wiki/Hoedown", "passage_text": "Hoedown. 708 pages on this wiki. Click on this image to watch an animated GIF of a Hoedown. Hoedown is a game played on both the British version and American version .The four performers sing a hoedown about an audience-provided subject, with each performing four-line stanzas (unrelated to each other). "}, {"url": "http://www.definitions.net/definition/hoedown", "passage_text": "Wiktionary (0.00 / 0 votes) Rate this definition: hoedown (Noun). A type of American folk or square dance. John and Susie went to the square dance and did the hoedown. hoedown (Noun). The type of music typically played for such a dance. hoedown (Noun). A gathering at which such dances take place. "}, {"url": "http://www.hoedownbands.co.uk/what_is_a_hoedown.html", "passage_text": "The actual word “hoedown” is American in its roots. More specifically, it is likely to have originated in America’s mid-west. It is generally believed that the word is a literal derivation of putting a “hoe down”. It is easy to romanticise visions of the early American farming communities in those wild days of yore. "}, {"url": "http://www.urbandictionary.com/define.php?term=hoedown", "passage_text": "7. hoedown. Term often heard when a dancer or stripper crashes to the ground or the stage. This type of fall is a direct result from a blown out strap usually because the shoe was too small, borrowed, or just plain busted.. much like the stripper wearing them. As Shanaynay took the stage her shoe gave out and caused the stripper to fall in her 8 inch platforms, the screams of hoedown filled the air"}, {"url": "https://en.wikipedia.org/wiki/Hoedown", "passage_text": "In contest fiddling, a hoedown is a tune in fast 2/4 time. In many contests, fiddlers are required to play a waltz, a hoedown, and a tune of choice, which must not be a waltz or a hoedown (typically it is a jig or a schottische). In the 1940s and early 1950s, the term hoedown was sometimes used to mean a call made up of parts of other calls. Hoedown was, and occasionally still is, also used to mean a dance jointly sponsored by several dance clubs or by a federation of clubs. The most famous hoedown in classical music is the section entitled Hoe-Down from the Rodeo ballet by Aaron Copland (1942"}, {"url": "https://en.wikipedia.org/wiki/Hoedown_Throwdown", "passage_text": "Hoedown Throwdown  is a song performed by American recording artist Miley Cyrus, combining elements of country pop, dance pop, and hip hop, It was released as a single from the soundtrack for Hannah Montana: The Movie. Hoedown Throwdown is written in the key of E♭ major. Cyrus' vocals span two octaves, from B♭ 3 to F 5. The song begins with an intro in which Cyrus repeats Boom Boom clap, boom di-clap di-clap four times. This line is reused in the song's outro."}, {"url": "http://www.merriam-webster.com/dictionary/hoedown", "passage_text": "Full Definition of HOEDOWN. 1. : square dance. 2. : a gathering featuring hoedowns. See hoedown defined for English-language learners. See hoedown defined for kids. ADVERTISEMENT. "}, {"url": "https://en.wikipedia.org/wiki/Hoedown", "passage_text": "The most popular sense of the term is associated with Americans in rural or southeastern parts of the country, particularly Appalachia. It is a dance in quick movement most likely related to the jig, reel or clog dance. In the 1940s and early 1950s, the term hoedown was sometimes used to mean a call made up of parts of other calls. Hoedown was, and occasionally still is, also used to mean a dance jointly sponsored by several dance clubs or by a federation of clubs. The most famous hoedown in classical music is the section entitled Hoe-Down from the Rodeo ballet by Aaron Copland (1942)"}]