[{"url": "https://www.etrailer.com/Accessories-and-Parts/Tow-Ready/TR118665.html", "passage_text": "1 You will need a battery isolator, like Tow Ready Battery Isolation Solenoid, part # TR118665, if you plan on leaving the trailer connected to the truck when the truck is off. 1 You may be able to use the existing 12V feed at the back of your truck to charge your trailer battery while driving but you will need to install a battery isolation solenoid to disconnect this line when the tow vehicle is off."}, {"url": "https://www.etrailer.com/question-23212.html", "passage_text": "If it only has power when the key is on, then you have found your keyed power source. If not, then you will need to find a wire that is on the ignition circuit to turn on the Tow Ready Battery Isolation Solenoid, part # TR118665. expert reply by: Jameson C. Can I mount the Tow Ready Battery Isolation Solenoid on the trailer in the accessory wire from the 7 pin harness that would be used to charge the trailer battery."}, {"url": "http://www.sunpowerrv.com/battery-isolators/", "passage_text": "These batteries are typically deep cycle batteries that prefer to be partially discharged and recharged on a regular basis. Some sort of battery isolator is required if the alternator is going to be used to charge more than one battery. A battery isolator is a one-way electrical device that allows an electrical current to flow in one direction but not the other."}, {"url": "http://www.expeditionportal.com/forum/threads/76484-What-s-the-big-difference-in-a-battery-isolator-versus-starter-solenoid", "passage_text": "Ok my goal is to have my camper battery charge off the vehicle alternator, and not have it kill my starter batteries when camping. I picked up a ford starter solenoid for 13 bucks; I priced an isolator for about $140 bucks. The idea is to connect grounds to camper battery and starter battery together, solenoid will connect positive lead of camper battery to starter battery only when ignition is on. He was asking about the difference between a starter solenoid and a solenoid-type isolator. The difference, as I said, is continuous duty rating. A typical dumb solenoid wired to be energized when the key is turned to ignition is as simple and bulletproof-and fool proof-as it gets."}, {"url": "http://www.sunpowerrv.com/battery-isolators/", "passage_text": "Additional relays transmit the charging current from the alternator to the idle batteries. A solenoid battery isolator does not have as much current degradation as a diode isolator and is more efficient. Some sort of battery isolator is required if the alternator is going to be used to charge more than one battery. A battery isolator is a one-way electrical device that allows an electrical current to flow in one direction but not the other."}, {"url": "http://www.carliving.info/isolator/index.html", "passage_text": "First, if you use a CD solenoid, when you turn on your ignition you connect the two sets of batteries. So If your starter battery is a little discharged, and you've flattened your house battery/batteries the house batteries will immediately start to equalise from your starter battery. Installing a battery isolator / dual battery system. Your car battery is generally quite valuable. If you let it discharge too often it will dramatically shorten the life of the battery. In applications where you are running electrical devices from your car, you should install a"}, {"url": "https://www.etrailer.com/Accessories-and-Parts/Tow-Ready/TR118665.html", "passage_text": "1 When Using the Tow Ready Battery Isolation Solenoid, item # TR118665, for isolating a vehicle 12 volt battery from the power going to a 12 volt trailer battery through the vehicle trailer connector, we use 10 gauge wire, item # 10-1-1 or # 10-2-1, depending on the wiring situation. 1 You may be able to use the existing 12V feed at the back of your truck to charge your trailer battery while driving but you will need to install a battery isolation solenoid to disconnect this line when the tow vehicle is off."}, {"url": "http://www.sunpowerrv.com/battery-isolators/", "passage_text": "A simple setup is one in which a vehicle contains two batteries, both of which are attached to the isolator. The battery isolator is attached to the vehicle's alternator, which is the device responsible for providing the vehicle with electrical power and for charging the vehicle's battery. Some sort of battery isolator is required if the alternator is going to be used to charge more than one battery. A battery isolator is a one-way electrical device that allows an electrical current to flow in one direction but not the other."}, {"url": "http://www.sunpowerrv.com/battery-isolators/", "passage_text": "There are two main types of battery isolators: the diode isolator and the solenoid isolator. A diode isolator uses two high-current diodes to direct the flow of current from the battery to the battery isolator. Some sort of battery isolator is required if the alternator is going to be used to charge more than one battery. A battery isolator is a one-way electrical device that allows an electrical current to flow in one direction but not the other."}, {"url": "https://www.etrailer.com/Accessories-and-Parts/Tow-Ready/TR118665.html", "passage_text": "This battery isolation solenoid shuts off the 12-volt feed from your vehicle battery to 12-volt accessories on your trailer when the ignition is turned off. This lets you run the trailer's electrical components without draining your battery. 1 You may be able to use the existing 12V feed at the back of your truck to charge your trailer battery while driving but you will need to install a battery isolation solenoid to disconnect this line when the tow vehicle is off."}]