[{"url": "http://www.cnet.com/news/chromecast-vs-apple-tv-vs-roku-3-which-media-streamer-should-you-buy/", "passage_text": "If you're looking to buy a media-streaming player, it's likely you'll end up choosing between four kinds of products: Chromecast, Roku, Amazon Fire TV and Apple TV. And if you happen to be a hard-core Google fan, you might be considering the Google Nexus Player and Android TV. For bargain hunters the cheaper Roku Streaming Stick is nearly as good, and the Google Chromecast is so cheap it's almost an impulse purchase. Meanwhile Apple TV and Fire TV have plenty of good points, particularly if you've already bought a lot of music, movies or TV shows from Apple or Amazon."}, {"url": "http://www.fool.com/investing/general/2015/09/21/apple-tv-vs-amazon-fire-tv-which-is-a-better-buy.aspx", "passage_text": "Amazon's Fire Stick Source: Amazon Apple TV is an excellent box for $69, but the lack of an app store is a major drawback because there is no guarantee the company will add new or even updated apps to the fixed selection offered on the now-outdated device. For potential Amazon customers, the choice is a little easier since the older set-top box model is not available and the new one has enhanced voice search through Alexa (its answer to Apple's Siri, which is included in the new Apple TV)."}, {"url": "http://www.cnet.com/news/smart-tv-or-media-streamer/", "passage_text": "The better media streamers, like Roku and Apple TV, have Amazon Instant Video (or iTunes), along with a lot of other content like HBO Go in the US or Sky's Now TV in the UK. HBO Go is available on numerous streaming boxes, but the only smart TVs that have it are from Samsung. Behold, the pros and cons of TV apps and media streamers. First, some terminology. A smart TV is one with built-in apps for services like Netflix. Often they have web browsers, games, and other timesinks. A media streamer is something like Roku, Apple TV, Chromecast, Amazon Fire TV, and so on. They are solely for the purpose of streaming content from the Internet or local network to your TV. On a basic level, smart TV features and media streamers do the same thing (stream content), but how well they do it varies a lot"}, {"url": "http://www.cnet.com/news/chromecast-vs-apple-tv-vs-roku-3-which-media-streamer-should-you-buy/", "passage_text": "Plenty of apps (except Amazon): The Apple TV used to get a lot of flak for its limited app support, but it's done a much better job recently, adding high-quality services like HBO Go and Watch ESPN. Aside from Amazon Instant, pretty much every major video app is now available on Apple TV. For bargain hunters the cheaper Roku Streaming Stick is nearly as good, and the Google Chromecast is so cheap it's almost an impulse purchase. Meanwhile Apple TV and Fire TV have plenty of good points, particularly if you've already bought a lot of music, movies or TV shows from Apple or Amazon."}, {"url": "http://www.imore.com/apple-tv-vs-amazon-fire-tv-which-one-should-you-buy", "passage_text": "Fire TV is Amazon's answer to the Apple TV, and to other options like the Roku 3 and the Google Chromecast. Fire TV brings Amazon Instant Video, Showtime Anytime, and tons of games to your big screen TV. The Amazon Fire TV seems pretty cool, but it seems like you really need to purchase Amazon Prime to make it worthwhile. (Netflix is on both, so that's a wash.). But for me, the biggest draw of Apple TV is AirPlay."}, {"url": "http://time.com/49323/amazon-fire-tv-vs-apple-tv-vs-roku/", "passage_text": "Fire TV is primarily for Amazon Prime users. Unlike Roku or Apple TV, Amazon’s interface has Amazon Prime DNA pretty much embedded throughout, and that’s an annual service that costs another $99 (bringing your total all the way up to $240, plus the recurring subscription fee, if you opt for the Fire TV gamepad)."}, {"url": "http://www.cnet.com/news/chromecast-vs-apple-tv-vs-roku-3-which-media-streamer-should-you-buy/", "passage_text": "Content-agnostic: Roku's interface doesn't push you toward one app or service. The platform has a refreshing come one, come all vibe that seems more customer-friendly than Apple TV, Amazon Fire TV or Android TV, which all more or less push you toward the hardware makers' own content. For bargain hunters the cheaper Roku Streaming Stick is nearly as good, and the Google Chromecast is so cheap it's almost an impulse purchase. Meanwhile Apple TV and Fire TV have plenty of good points, particularly if you've already bought a lot of music, movies or TV shows from Apple or Amazon."}, {"url": "http://www.consumerreports.org/cro/streamingmediaplayers/new-apple-tv-vs-roku-3-and-amazon-fire-tv", "passage_text": "Apple has now unveiled its long-awaited new Apple TV, which boasts innovative features and higher price points—$149 and $199, depending on internal storage capacity—that set it apart from competitors such as the Roku 3 and Amazon Fire TV. "}]