[{"url": "http://www.bettersleep.org/mattresses-and-more/mattress-sizes/", "passage_text": "Twin Mattress. A twin mattress is the smallest possible mattress size, other than a crib-sized mattress. Twin mattress dimensions are approximately 38 inches wide by 75 inches long. Both twin and full sizes are approximately 75 inches long, which may be too short for some adults, especially men."}, {"url": "http://www.crib-mattress-guide.com/crib-mattress-size.html", "passage_text": "The depth of your crib mattress should: Most crib mattresses. on the market are standard size and will fit standard size cribs. However, some may vary slightly in length and width and may be a potential safety hazard, if not fitted with the proper crib. So please take these measurements very seriously. 1  51-5/8 inches in length and 27-1/4 inches wide."}, {"url": "http://www.bedbathandbeyond.com/1/3/crib-mattress-size", "passage_text": "Your little aviator's imagination will soar with the vintage aircraft print on Glenna Jean's Fly-By Fitted Crib Sheet. Crafted of soft 100% cotton for his comfort, the sheet fits a standard size crib mattress and is fully elasticized for a secure fit."}, {"url": "http://www.bettersleep.org/mattresses-and-more/mattress-sizes/", "passage_text": "Full Mattress. Sometimes still called a double mattress, a full size mattress is 53 inches wide, which is just 15 inches wider than a twin size (single). That leaves each partner only 27 inches of personal space, or about the width of a crib."}, {"url": "http://baby.about.com/od/sleep/f/What-Is-The-Standard-Mattress-Size.htm", "passage_text": "Specifically speaking, for mattresses sold in both the United States and Canada, crib mattress size may range between 27 5/8 to 28 5/8 wide and 51 3/4 to 53 in length."}, {"url": "http://www.bedbathandbeyond.com/1/3/full-size-crib-mattress", "passage_text": "This convertible crib grows with your child. Four mattress heights adjust into a crib, toddler bed, daybed and full-sized bed. It's elegantly detailed with an arched back panel, thick slats, winged corners, curved posts and even has a drawer for storage."}]