[{"url": "http://www.homewyse.com/services/cost_to_install_concrete_edging.html", "passage_text": "Get an INSTANT estimate of the cost to Install Concrete Edging! Our free calculator uses recent, trusted data to estimate costs for your Concrete Edging Installation project. For a basic 60 feet project in zip code 47474, the benchmark cost to Install Concrete Edging ranges between $4.75 - $8.49 per linear foot."}, {"url": "http://homewyse.com/services/cost_to_install_concrete_curb.html", "passage_text": "$24.58. Get an INSTANT estimate of the cost to Install a Concrete Curb! Our free calculator uses recent, trusted data to estimate costs for your Concrete Curb Installation project. For a basic 25 feet project in zip code 47474, the benchmark cost to Install a Concrete Curb ranges between $17.69 - $24.58 per linear foot."}, {"url": "http://www.improvenet.com/r/costs-and-prices/concrete-curbing", "passage_text": "Cost of Concrete Curb. 1  On average, homeowners should expect to pay approximately $16.90 for a linear square foot of concrete curb installed. 2  The maximum reported price per linear foot of concrete curb is $20.89. 3  The minimum reported price for concrete curb is $13.37 per linear foot."}, {"url": "http://www.improvenet.com/r/costs-and-prices/concrete-curbing", "passage_text": "1 On average, homeowners should expect to pay approximately $16.90 for a linear square foot of concrete curb installed. 2  The maximum reported price per linear foot of concrete curb is $20.89. 3  The minimum reported price for concrete curb is $13.37 per linear foot."}, {"url": "http://www.costowl.com/home-improvement/landscaping-landscape-curbing-cost.html", "passage_text": "The most popular material used to date in landscape curbing is concrete, mostly for its cost-effectiveness. A typical concrete curb installation will cost approximately $5 per linear foot. Extra site preparation, custom curb shape design, and color may make the price more expensive; closer to $10 per foot. Asphalt curbs are just slightly more expensive, coming in at around $6 to $7"}]