[{"url": "http://www.innovateus.net/science/what-galvanizing", "passage_text": "Galvanizing is the practice of immersing clean, oxide-free steel into molten zinc to from a protective coating over the metal. The coating is bonded metallurgically to the steel and this coating helps to protect the surface against corrosion. In recent use, the term refers to the coating of steel or iron with zinc. 1 Electro-Galvanizing: It is an electrolytic process for galvanizing, where a thinner, tighter bonding coat of zinc is applied to a metal through “electroplating”. 2  Electro plating is a process of running a current of electricity through a saline/ zinc solution with a zinc anode and steel conductor."}, {"url": "https://en.wikipedia.org/wiki/Galvanization", "passage_text": "Galvanizing protects in two ways: 1  It forms a coating of corrosion-resistant zinc which prevents corrosive substances from reaching the more delicate part of the metal. 2  The zinc serves as a sacrificial anode so that even if the coating is scratched, the exposed steel will still be protected by the remaining zinc. The earliest known example of galvanizing of iron, encountered by Europeans is found on 17th century Indian armor in the Royal Armouries Museum collection. It was named in English via French from the name of Italian scientist Luigi Galvani."}, {"url": "https://prezi.com/qmg_t5xafdzp/what-is-hot-dip-galvanizing/", "passage_text": "Hot-dip galvanizing is the process of dipping fabricated steel into a bath or kettle of molten zinc. While the steel is in the kettle, the iron in the steel metallurgically reacts with the molten zinc to form a series of tightly-bonded alloy layers. Once used only for corrosion protection, hot-dip galvanizing is now specified for many reasons including: Surface Preparation."}, {"url": "http://www.innovateus.net/science/what-galvanizing", "passage_text": "Galvanization is the process by which zinc is coated over corrosive (easily rusted) metals. Galvanizing involves coating corrosive metals, such as steel and iron, with a non-corrosive metal. The process of galvanizing, not only protects from corrosion of various ‘soft metals’ but also adds strength of the original, uncoated metal. 1 Electro-Galvanizing: It is an electrolytic process for galvanizing, where a thinner, tighter bonding coat of zinc is applied to a metal through “electroplating”. 2  Electro plating is a process of running a current of electricity through a saline/ zinc solution with a zinc anode and steel conductor."}, {"url": "https://en.wikipedia.org/wiki/Hot-dip_galvanization", "passage_text": "The process of hot-dip galvanizing results in a metallurgical bond between zinc and steel with a series of distinct iron-zinc alloys. The resulting coated steel can be used in much the same way as uncoated. A typical hot-dip galvanizing line operates as follows: 1  Steel is cleaned using a caustic solution. 2  The caustic cleaning solution is rinsed off. 3  The steel is pickled in an acidic solution to remove mill scale. 4  The pickling solution is rinsed off. 5  A flux, often zinc ammonium chloride is applied to the steel to inhibit oxidation of the cleaned 6  ... The One common use is in metal pails. Galvanised steel is also used in most heating and co oling duct systems in buildings. Individual metal articles, such as steel girders or wrought iron gates, can be hot-dip galvanized by a process called batch galvanizing."}, {"url": "https://en.wikipedia.org/wiki/Galvanization", "passage_text": "Galvanization, or galvanisation, is the process of applying a protective zinc coating to steel or iron, to prevent rusting. The most common method is hot-dip galvanization, in which parts are submerged in a bath of molten zinc. The earliest known example of galvanizing of iron, encountered by Europeans is found on 17th century Indian armor in the Royal Armouries Museum collection. It was named in English via French from the name of Italian scientist Luigi Galvani."}, {"url": "http://www.galvanizeit.org/hot-dip-galvanizing/what-is-hot-dip-galvanizing-hdg", "passage_text": "What is Hot-Dip Galvanizing (HDG)? Hot-dip galvanizing (HDG) , as referenced on this site, is the process of dipping fabricated steel into a kettle or vat containing molten zinc. "}, {"url": "http://www.coatfab.com/galvanizing.htm", "passage_text": "GALVANIZING The galvanizing reaction takes place at between 445 and 465°C. When the dried steel part is immersed in the galvanizing bath the steel surface is wetted by the molten zinc and reacts to form a series of zinc-iron alloy layers. The work remains in the bath until its temperature reaches that of the molten zinc, so that all the galvanizing reactions can go to completion. In simplistic terms, while there is zinc on the surface the steel will be protected from corrosion. Hot dip galvanizing is one of a number of methods available to the surface finisher for applying a zinc coating to an item. Other techniques include electroplating, mechanical plating, and sherardising, painting with zinc-rich coatings and zinc spraying or metallising"}]