[{"url": "http://www.icr.org/article/did-some-dinosaurs-really-have-feathers/", "passage_text": "A feathered dinosaur may someday be discovered. But even then, feathers on a dinosaur would not solve evolution’s biophysical impasse of converting a reptile skeleton into that of a bird. And so far, the evidence for feathered dinosaurs is much better interpreted as decayed skin fibers."}, {"url": "http://www.uky.edu/KGS/education/trex.htm", "passage_text": "They weren’t birds, just dinosaurs with feathers! So far, no T-rex fossils have ever been found with feathers. Feathers, however, are not commonly preserved, and T-rex is very closely related to dinosaurs that had feathers, so it’s possible that T-rex was covere"}, {"url": "http://www.smithsonianmag.com/science-nature/five-things-we-dont-know-about-tyrannosaurus-rex-180951072/", "passage_text": "At the crack of dawn this morning, a long-awaited Tyrannosaurus rex skeleton, dubbed the Nation’s T. rex, ended its epic road trip, when a 53-foot-long semi pulled up to the loading dock at the National Museum of Natural History in Washington, DC."}, {"url": "http://www.smithsonianmag.com/science-nature/five-things-we-dont-know-about-tyrannosaurus-rex-180951072/", "passage_text": "Paleontologists have long debated this. A string of studies in the past decade have pointed to the potential widespread presence of either feathers or fuzz-like proto-feathers in dinosaur species. In 2012, paleontologists found that a T. rex relative, Yutyrannus huali, had filamentous feathers."}, {"url": "http://news.nationalgeographic.com/news/2004/10/1006_041006_feathery_dino.html", "passage_text": "A tiny, earlier cousin of Tyrannosaurus rex sported at least a partial coat of hairlike feathers, scientists reported today. The dinosaur chased prey and roamed the lakeside forests of Liaoning Province in northern China some 130 million years ago, researchers said."}, {"url": "http://www.smithsonianmag.com/science-nature/five-things-we-dont-know-about-tyrannosaurus-rex-180951072/", "passage_text": "Evidence of T. rex skin—whether from impressions or preserved skin—would obviously shed light on the issue, but so far paleontologists haven’t had any luck there. Having darker colored skin certainly might have been an advantageous camouflage for T. rex as a predator."}, {"url": "http://www.uky.edu/KGS/education/trex.htm", "passage_text": "But birds can be very colorful. There is mounting evidence that birds are related to dinosaurs. In fact, in a National Geographic article (v. 196, no. 5, p. 98-99) on feathered dinosaurs, C. Sloan (1999) paints T. rex hatchlings with feathers. Some dinosaurs may have been colorful."}, {"url": "http://www.wired.com/2012/04/yutyrannus-huali-feathers/", "passage_text": "Giant Feathered Tyrannosaur Found in China. Artist's impression of Yutyrannus and the smaller Beipiaosaurus. Image: Brian Choo. It’s not your father’s tyrannosaur: Yutyrannus huali, a newly discovered ancestor of Tyrannosaurus rex, was covered from head to tail in downy feathers."}, {"url": "http://tisfortrex.com/?p=430", "passage_text": "Velociraptor #2. To top it all off, near the end of the exhibit an information panel stated that scientists have discovered recent evidence that even the mighty T.rex sported a coat of downy feathers as a juvenile, which it shed on its way to adulthood."}]