[{"url": "http://www.answers.com/Q/What_is_the_normal_human_body_temperature", "passage_text": "The average human body temperature is 98.6º F or 37º C, but it can vary somewhat. Average adult temperature is 98.2º F (36.8º C). Older people average a bit less. These values can also vary with time of day."}, {"url": "http://www.webmd.boots.com/a-to-z-guides/normal-body-temperature", "passage_text": "'A Critical Appraisal of 98.6F, the Upper Limit of the Normal Body Temperature, and Other Legacies of Carl Reinhold August Wunderlich', JAMA. 1992;268(12):1578-1580. 'Normal Body Temperature: Rethinking the normal human body temperature', Harvard Health Publications."}, {"url": "https://www.nlm.nih.gov/medlineplus/ency/article/001982.htm", "passage_text": "Normal body temperature varies by person, age, activity, and time of day. The average normal body temperature is generally accepted as 98.6°F (37°C). Some studies have shown that the normal body temperature can have a wide range, from 97°F (36.1°C) to 99°F (37.2°C)."}, {"url": "http://hyperphysics.phy-astr.gsu.edu/hbase/thermo/heatreg.html", "passage_text": "The human body has the remarkable capacity for regulating its core temperature somewhere between 98°F and 100°F when the ambient temperature is between approximately 68°F and 130°F according to Guyton."}, {"url": "http://drsircus.com/medicine/low-body-temperature-symptoms-causes-treat/", "passage_text": "This temperature is however, the average body temperature and the overall normal temperature varies from a minimum of 97.7° Fahrenheit (36.5° Celsius) to a maximum of almost 99.5° Fahrenheit (37.5° Celsius). Any temperature above or below this range is abnormal."}, {"url": "http://www.answers.com/Q/What_is_the_normal_human_body_temperature", "passage_text": "98.6 degrees Fahrenheit, or 37 degrees Celsius is approximately normal temperature for the human body.   The human body operates best at 98.6 degrees Fahreinheit (about 37o C). The healthy body temperature for humans is between 95 and between 99.3."}, {"url": "http://www.webmd.com/first-aid/body-temperature", "passage_text": "Most people think of a normal body temperature as an oral temperature of 98.6°F (37°C) . This is an average of normal body temperatures. Your temperature may actually be 1°F (0.6°C) or more above or below"}]