[{"url": "https://en.wikipedia.org/wiki/Inventory_control", "passage_text": "Stock control systems [edit]. An inventory control system or a computerized inventory system is a process for managing and locating objects or materials. In common usage, the term may also refer to just the software components. Many shops now use stock control systems. Inventory Control or Stock control can be broadly defined as the activity of checking a shop’s stock. More specifically inventory control may refer to: 1  In operations management, logistics and supply chain management, the technological system and the programmed software necessary for managing inventory."}, {"url": "http://www.innovativeretailtechnologies.com/doc/inventory-replenishment-what-is-it-exactly-an-0001", "passage_text": "Dictionaries define Replenishment as filling again by supplying what has been used up.. This definition does not adequately address the business conditions in retail inventory management. "}, {"url": "http://www.investopedia.com/terms/i/inventory-management.asp", "passage_text": "DEFINITION of 'Inventory Management'. Inventory management is the overseeing and controlling of the ordering, storage and use of components that a company will use in the production of the items it will sell as well as the overseeing and controlling of quantities of finished products for sale. BREAKING DOWN 'Inventory Management'. Successful inventory management involves creating a purchasing plan that will ensure that items are available when they are needed (but that neither too much nor too little is purchased) and keeping track of existing inventory and its use."}, {"url": "http://www.businessdictionary.com/definition/inventory-management.html", "passage_text": "Definition. Activities employed in maintaining the optimum number or amount of each inventory item. The objective of inventory management is to provide uninterrupted production, sales, and/or customer-service levels at the minimum cost."}, {"url": "https://en.wikipedia.org/wiki/Inventory", "passage_text": "Inventory or stock refers to the goods and materials include that a business holds for the ultimate purpose of resale (or repair). Inventory management is a science primarily about specifying the shape and percentage of stocked goods. It is required at different locations within a facility or within many locations of a supply network to precede the regular and planned course of production and stock of materials. Inventory proportionality is the goal of demand-driven inventory management. The primary optimal outcome is to have the same number of days' (or hours', etc.) worth of inventory on hand across all products so that the time of runout of all products would be simultaneous."}, {"url": "http://www.businessdictionary.com/definition/inventory-management.html", "passage_text": "Since for many companies inventory is the largest item in the current assets category, inventory problems can and do contribute to losses or even business failures. Also called inventory control. See also inventory analysis. The objective of inventory management is to provide uninterrupted production, sales, and/or customer-service levels at the minimum cost."}, {"url": "http://smallbusiness.chron.com/perpetual-inventory-retail-mean-22738.html", "passage_text": "Inventory Management Systems. According to generally accepted accounting principles, businesses can use either a periodic or a perpetual inventory management system. Regardless of the inventory system adopted, it is a good practice for businesses to conduct a manual inventory at least once a year. Before computerized inventory systems, most businesses used periodic or non-continuous inventory systems. Inventory accounting uses either a periodic or perpetual method for reporting. According to the book “Getting the Count Right: Understanding Inventory Accuracy,” perpetual inventory systems work best in retail."}]