[{"url": "http://dinosaurs.about.com/od/otherprehistoriclife/a/earlymammals.htm", "passage_text": "Before discussing how mammals evolved, it's helpful to define what distinguishes mammals from other animals (and especially reptiles). Female mammals have milk-producing mammary glands with which they suckle their young; most mammals have hair or fur, and all have warm-blooded (endothermic) metabolisms. By the time they went extinct in the mid-Jurassic period, some therapsids had evolved various proto-mammalian traits (fur, cold noses, warm-blooded metabolisms, and possibly live birthing) that were further elaborated upon by their descendants, the true mammals."}, {"url": "http://kidzone.ws/animals/mammals3.htm", "passage_text": "Well, even though some baby mammals are born different ways, they all drink milk that comes from their mothers' bodies. Baby pigs, dolphins, bats and elephants all drink milk! Because the babies rely on their mother's milk to live, the mammal mommies have to care for their young. The length of time varies from a few weeks for mice to many years for humans! Gorilla mother and child. photo by: Martha de Jong-Lantink, CC BY-NC-ND 2.0. People have baby teeth or milk teeth. So do all of the other mammals! (Although I think the tooth fairy only takes human teeth...) The only exceptions are mammals like anteaters -- they don't have any teeth at all. Mammal mothers are hard workers. Baby mammals learn from their mothers."}, {"url": "http://www.bbc.co.uk/education/clips/z7jv87h", "passage_text": "A look at how different animals live and look after their young in Africa. Includes a lion and lioness with their cubs; an elephant with its calf; a giraffe with her calf; and a hippopotamus with its calf. Students could work in pairs, each taking a different African animal as their focus of study. One person in the pair could look at the adult animal and the other, the young. The pairs could research their animals and then compare the adult and young for each species."}, {"url": "http://www.bbc.co.uk/nature/life/Platypus", "passage_text": "Platypuses are both bizarre looking and unusually adapted. They belong to a sub-group of mammals that lay eggs rather than giving birth to live young (monotremes). When the first platypus was shipped to Britain from Australia, people thought it was a joke and that someone had sewn a duck's bill to a mammal's body."}, {"url": "http://www.saburchill.com/chapters/chap0039.html", "passage_text": "Elephant. 3 - 4 years. In species where the offspring stay for a long time with their mother the offspring will get the opportunity to suckle for a long time. For example, the baby chimpanzee stays with its mother for 5 to 7 years but the offspring of a rat must leave its mother soon after weaning at 3 weeks old. The bear cub is naked and blind when it is born and it will remain in the den (the bear's home) for up to three months. The foal of a zebra, however, is on its feet and running with its parents less than one hour after it is born."}, {"url": "http://www.factmonster.com/dk/encyclopedia/mammals.html", "passage_text": "MARSUPIALS. MONOTREMES. FIND OUT MORE. A group of warm-blooded animals with a bony skeleton, mammals include mice and other RODENTS, PRIMATES, such as monkeys and humans, and animals as various as hippos, deer, and cats. The 4,500 or so species include elephants, the largest creatures on land, and whales, the largest of all animals on Earth. Gestation takes longer in some mammals than in others. In rodents, such as hamsters, it takes just two to three weeks. Larger mammals produce fewer offspring, which usually take much longer to gestate. Elephants take the longest time of all—20 months."}, {"url": "https://en.wikipedia.org/wiki/Mammal", "passage_text": "All female mammals nurse their young with milk, which is secreted from special glands, the mammary glands. According to Mammal Species of the World, 5,416 species were known in 2006. Except for the five species of monotremes (egg-laying mammals), all modern mammals give birth to live young. Most mammals, including the six most species-rich orders, belong to the placental group."}, {"url": "http://naturemappingfoundation.org/natmap/facts/cougar_k6.html", "passage_text": "How they develop: Cougars begin breeding at about 3 years of age. Typical litters have 1 to 6 kittens born after a 3-month pregnancy (people have a 9-month pregnancy). Their eyes open in 8 or 9 days and the young are weaned from the mother in 2 to 3 months. The kittens may remain with the mother into their second year."}, {"url": "http://www.wildernessclassroom.com/wilderness-library/red-fox/", "passage_text": "Red foxes range in color from red to gray but most are a reddish brown color. They have a white belly, chin, and throat and a white tipped tail. They weigh between 7 1/2 pounds to 15 pounds. Red foxes are between 35-41 inches long and their long tails are about 13-17 inches long. "}]