[{"url": "http://communicationtheory.org/framing/", "passage_text": "Introduction. Framing is a concept which is commonly used to understand the media effects. It is regarded as the extension of agenda setting theory which prioritize an issue and makes the audience think about its effects. "}, {"url": "http://ironshrink.com/2007/12/what-is-relational-frame-theory-part-one/", "passage_text": "Relational frame theory is the result of research by Dr. Steven Hayes, along with Dermot Barnes-Holms and several other scholarly types who have helped shape this large body of work. RFT is an attempt to fill a void left by the behaviorist B. F. Skinner. – Sponge. Dear Sponge, Relational frame theory (RFT) is a novel explanation of cognition and language. It influences the clinical work that I do with anxiety and depression and, like evolutionary psychology, it manages to inject a bit of hard science into psychology’s soft, squishy center."}, {"url": "https://en.wikipedia.org/wiki/Framing_(social_sciences)", "passage_text": "In social theory, framing is a schema of interpretation, a collection of anecdotes and stereotypes, that individuals rely on to understand and respond to events. In other words, people build a series of mental filters through biological and cultural influences. Chong and Druckman suggest framing research has mainly focused on two types of frames: equivalency and emphasis frames. Equivalency frames offer different, but logically equivalent phrases, which cause individuals to alter their preferences."}, {"url": "https://en.wikipedia.org/wiki/Relational_frame_theory", "passage_text": "From Wikipedia, the free encyclopedia. Relational frame theory (RFT) is a psychological theory of human language. It was developed largely through the efforts of Steven C. Hayes of University of Nevada, Reno and Dermot Barnes-Holmes of National University of Ireland, Maynooth"}, {"url": "http://www.csun.edu/%7Erk33883/Framing%20Theory%20Lecture%20Ubertopic.htm", "passage_text": "(Compiled for Management 360). The Basics. Framing theory and the concept of framing bias suggests that how something is presented (the frame) influences the choices people make. This idea is important because it is contrary to the central concept of of rational choice theory. The elements of the Communication Frame include: A message, an audience, a messenger, a medium, images, a context, and especially, higher-level moral and conceptual frames. The choice of language is, of course, vital, but it is vital because language evokes frames"}, {"url": "https://en.wikipedia.org/wiki/Relational_frame_theory", "passage_text": "Relational frame theory focuses on how humans learn language (i.e., communication) through interactions with the environment and is based on a philosophical approach referred to as functional contextualism. Relational frame theory (RFT) is a psychological theory of human language. It was developed largely through the efforts of Steven C. Hayes of University of Nevada, Reno and Dermot Barnes-Holmes of National University of Ireland, Maynooth"}, {"url": "https://en.wikipedia.org/wiki/Relational_frame_theory", "passage_text": "Relational Frame Theory argues that the building block of human language and higher cognition is 'relating', i.e. the human ability to create links between things. It can be contrasted with Associative Learning, which discusses how animals form links between stimuli in the form of the strength of associations in memory. Relational frame theory (RFT) is a psychological theory of human language. It was developed largely through the efforts of Steven C. Hayes of University of Nevada, Reno and Dermot Barnes-Holmes of National University of Ireland, Maynooth"}, {"url": "https://www.newharbinger.com/blog/relational-frame-theory-101-introduction", "passage_text": "To date, the most comprehensive published collection of RFT research is Advances in Relational Frame Theory: Research and Application, edited by Simon Dymond, PhD, and Bryan Roche, PhD. From the RFT perspective, relational framing is the process that underlies language (see Hayes, et al., 2001). In contrast to the outdated Skinnerian approach which came before it, RFT is a modern, behavior analytic approach to human language. Any stimulus can be related to any other stimulus in accordance with any relational frame. Since natural language has its greatest use in the description and analysis of our environment, the fact that relational framing is arbitrarily applicable does not mean that it is arbitrarily applied."}]