[{"url": "https://www.quora.com/For-how-long-can-dairy-products-be-safely-left-out-of-the-fridge", "passage_text": "If you had a gallon of milk unopened but out for 2 hours and it's at 80 degrees, sorry milk isn't expensive enough for me to take a chance plus the quality has probably degraded significantly. Opened dairy products in a home setting I wouldn't leave out longer than 2 hours. In a retail food setting they have up to 4 hours at which time they have to dispose of the items. It depends on the dairy product. Milk for instance if it was in a retail setting would have to be disposed of if they were using time as a public health control after 4 hours."}, {"url": "http://www.wikihow.com/Soften-Cream-Cheese", "passage_text": "5. Don't let softened cream cheese sit for long periods of time. Cream cheese has a fairly long shelf life: in the fridge, it can sometimes last for up to a month and in the freezer it can easily last twice that. However, like many dairy products, it spoils fairly quickly at room temperature. 1 If the cream cheese isn't soft enough, continue to heat it in ten second increments. 2  Check its texture after each heating session. 3  If the cream cheese is too soft, let it sit in a cool bowl on the counter for five minutes (or in the fridge for two minutes)."}, {"url": "http://www.fitday.com/fitness-articles/nutrition/healthy-eating/myth-or-fact-leftover-pizza-is-okay-to-leave-out.html", "passage_text": "Some foods can be left out in room temperature for periods of time and still be safe to eat without the risk for foodborne illness or food poisoning. While pizza should be refrigerated, whether or not it's cooked, leaving it out in room temperature for short periods of time is generally okay. Throw away any pizza that's been sitting out in room temperature for more than two hours. The FDA notes that if you keep leftover pizza in the freezer instead of the fridge, it's safe to keep it for one to two months."}, {"url": "https://answers.yahoo.com/question/index?qid=20100328231128AAZhyiu", "passage_text": "In those days, there was no refrigeration, so this is how, perhaps, some cheeses began to aquire mold like bleu cheese, for example. The fact is that cheese can be stored at room temperature (78 F) for an indefinite period of time if it is wrapped in something sanitary."}, {"url": "http://blogcritics.org/should-you-eat-string-cheese-left/", "passage_text": "1 Cottage cheese left out for three hours: “When perishable foods like cottage cheese are left at room temperature for longer than 2 hours bacteria can develop that cause foodborne illness.”. 2  Butter at room temperature: “…it will develop a rancid taste.”. She didn’t approve of anything: 1 "}, {"url": "http://www.answers.com/Q/How_long_can_you_leave_cheese_out_of_the_fridge", "passage_text": "Foods that are left out in room temperature for more than an hour can begin bacteria growth. Our stomach acids can kill some of these bacterias but not all and some can make you very sick. Keep foods OUT of the danger zone-Above 45 degrees and Below 145 degrees. Between these temperatures bacteria lives and breeds on our foods."}, {"url": "http://www.answers.com/Q/How_long_can_you_leave_cheese_out_before_it_goes_bad", "passage_text": "Confidence votes 30.7K. Foods that are left out in room temperature for more than an hour can begin bacteria growth. Our stomach acids can kill some of these bacterias but not all and some can make you very sick. The actual amount of time shredded cheese can be safely left  outside of the refrigerator, depends on the moisture level of the  cheese as well as the temperature of the roo … m. A few hours at sixty  degrees in a covered or sealed container, is probably fine."}, {"url": "http://www.answers.com/Q/How_long_can_you_leave_cheese_out_of_the_fridge", "passage_text": "Cream cheese should not be left out of the fridge for more than 2 hours. Make that only one hour if the temperature is quite warm. Less time is better. 3 people found this useful. Our stomach acids can kill some of these bacterias but not all and some can make you very sick. Keep foods OUT of the danger zone-Above 45 degrees and Below 145 degrees. Between these temperatures bacteria lives and breeds on our foods."}, {"url": "http://www.fitday.com/fitness-articles/nutrition/healthy-eating/myth-or-fact-leftover-pizza-is-okay-to-leave-out.html", "passage_text": "Pizza can be left in room temperature for up to two hours -- or one hour in hot temperatures above 90 degrees Fahrenheit -- and still be safe to eat, according to the USDA. Throw away any pizza that's been sitting out in room temperature for more than two hours. The FDA notes that if you keep leftover pizza in the freezer instead of the fridge, it's safe to keep it for one to two months."}]