[{"url": "https://en.wikipedia.org/wiki/Erika_(given_name)", "passage_text": "The given name Erika, or Erica, is a feminine form of Eric, deriving from the Old Norse name Eirikr (eiríkr Or erikr Eríkr In eastern scandinavia due). to monophthongization "}, {"url": "http://www.thinkbabynames.com/meaning/1/Erik", "passage_text": "Erik /erik/ [2 sylls.] as a boys' name is of Old Norse, Old French and Old German origin, and the name Erik means complete ruler; peaceful ruler. Erik is an alternate form of Aric (Old Norse): variation of Eric. Erik is also a form of Frederick (Old French, Old German): from fred. Erik is a very prominent first name for males (#231 out of 1220, Top 19%) and a slightly less prominent last name for both adults and children (#142819 out of 150436, Top 95%). (2000 U.S. Census). Charted below is the baby name popularity of Erik for boys."}, {"url": "https://en.wikipedia.org/wiki/Eric", "passage_text": "The most common spelling in Scandinavia is Erik. In Norway, another form of the name (which has kept the Old Norse diphthong) Eirik is also commonly used. In Finland, the form Erkki is also used. The modern Icelandic version is Eirikur, eiríkur while the Modern faroese version Is. eirikur This was partly because of the publishing of the novel Eric, or, Little by Little by Frederick William Farrar in 1858. In Norway, Sweden and Finland, the name day for Erik and Eirik is 18 May, commemorating the death of Saint Eric of Sweden."}, {"url": "http://www.thinkbabynames.com/meaning/1/Eric", "passage_text": "Eric /er-ic/ [2 sylls.] as a boys' name is pronounced AIR-ik. It is of Old Norse origin, and the meaning of Eric is complete ruler . From ei meaning ever, always (or einn one, alone) and r kr meaning rule, power. The original form is Erik, which has been borne by nine Danish kings. Also used as a nickname for Frederic and Frederic"}, {"url": "http://www.meaning-of-names.com/scandinavian-names/erik.asp", "passage_text": "Meaning of Erik. Scandinavian name. In Scandinavian, the name Erik means-honorable ruler.The name Erik originated as an Scandinavian name. The name Erik is most often used as a boy name or male name. Scandinavian Name Meaning-honorable ruler. Origin-Scandinavia"}, {"url": "https://en.wikipedia.org/wiki/Eric", "passage_text": "Look up Eric, Erik, Erick in Wiktionary, the free dictionary. The given name Eric, Erik, or Erick is derived from the Old Norse name Eirikr (eiríkr Or erikr Eríkr In eastern scandinavia due). to monophthongization This was partly because of the publishing of the novel Eric, or, Little by Little by Frederick William Farrar in 1858. In Norway, Sweden and Finland, the name day for Erik and Eirik is 18 May, commemorating the death of Saint Eric of Sweden."}, {"url": "https://en.wikipedia.org/wiki/Eric", "passage_text": "The given name Eric, Erik, or Erick is derived from the Old Norse name Eirikr (eiríkr Or erikr Eríkr In eastern scandinavia due). To monophthongization the, first-element ei is derived either from The-Older * proto(norse) aina z meaning one or alone Or-From * proto(norse) aiwa z meaning ever. or eternal This was partly because of the publishing of the novel Eric, or, Little by Little by Frederick William Farrar in 1858. In Norway, Sweden and Finland, the name day for Erik and Eirik is 18 May, commemorating the death of Saint Eric of Sweden."}, {"url": "http://www.sheknows.com/baby-names/name/erik", "passage_text": "Scandinavian Meaning: The name Erik is a Scandinavian baby name. In Scandinavian the meaning of the name Erik is: Ever kingly. In Scandinavian legend the Viking sea rover Ericson: (son of Eric the Red) landed on the shores of America 500 years before Christopher Columbus. Swedish Meaning: The name Erik is a Swedish"}]