[{"url": "https://sg.answers.yahoo.com/question/index?qid=20070125102800AAx70cs", "passage_text": "Pads should be between $25 and $75 for passenger cars Most shops charge 1 hour labor and depending where you live that should be from $40 - $80 an hour. So for pads you could look at $65 - $150 depending on the car and condition. Rotors (discs) from $50-$200 a set. Most times it is just pads unless you have a warped or damages brake disc."}, {"url": "http://www.answers.com/Q/How_much_should_it_cost_to_replace_rear_brake_pads_and_rotors", "passage_text": "Don't know about calipers-have never needed to replace those. If you are replacing, yourself, the parts (pads and rotors) will cost anywhere from $120 up for front p … ads and rotors (pads $20 up for a full set, rotors $45 up each). If you check the web, there are some sites where you can order an entire set (pads and rotors) for around $90. A brake and rotor replacement for a Chevy Blazer typically costs  between $300 and $600 depending on the number of components that  need to be replaced. Generally rotors wil … l last the life of the  vehicle unless the pads have been allowed to wear excessively."}, {"url": "https://sg.answers.yahoo.com/question/index?qid=20070125102800AAx70cs", "passage_text": "Best Answer: Depending on the type of vehicle a typical front brake job (disc) is about $125.00 If the brake rotors have to be replaced or machined it will cost you more. So for pads you could look at $65 - $150 depending on the car and condition. Rotors (discs) from $50-$200 a set. Most times it is just pads unless you have a warped or damages brake disc."}, {"url": "http://repairpal.com/estimator/brake-pad-and-rotor-replacement-cost", "passage_text": "Parts: $145 - $213. The average cost for a brake pad and rotor replacement is between $297 to $406. Labor costs are estimated between $152 to $193 while parts are priced between $145 to $213. Get a personalized estimate based on your location and specific car. Estimate does not include taxes and fees. Brake rotors should be measured at every brake pad replacement. If found to be at or below the manufacturer's minimum thickness specification, they will require replacement. These measurements should always be noted on your repair order. We recommend braking gently for the first 40 to 50 miles of driving on new pads."}, {"url": "http://www.carsdirect.com/car-repair/how-much-should-replacement-brakes-cost", "passage_text": "If you wish to replace the discs on the front an average price for a set of brake pads is approximately $60.00 - $111.00 but depending on the make and model of your car it could cost a lot more than that. "}, {"url": "https://answers.yahoo.com/question/index?qid=20070604210522AA7CYcJ", "passage_text": "Best Answer: The cost of FORD parts for your particular car is as follows: Front Brake Pads (part number 3S4Z-2001-AA) $106.97US Front Brake Rotors (part number 3S4Z-1125-AA) $77.31US x2 The prices above were obtained through www.fordparts.com. GOOD LORD do it yourself, front brake pads for your car $25, rear brakes $25, rotors $24 a piece, you can do it in about an hour."}, {"url": "http://cars.costhelper.com/brakes.html", "passage_text": "1 For work on front and back brakes, CostHelper readers reported paying $273-$1,025 for an average of $567 at standard repair shops, or $280-$935 for an average of $578 at dealerships. 1 CostHelper readers report paying $23-$285 for an average of $104 for materials for brakes on one axle, and $135-$439 for all parts for both front and back brakes, for an average of $304."}, {"url": "https://answers.yahoo.com/question/index?qid=20070815154414AA6KDq1", "passage_text": "DEpends on the make and model. If it is a Cavalier, pads and rotors should be no more than $175. If it's a Mercedes or Ferrari, maybe $1000 A chrysler Sebring shuld cost you $200 to $250. Depending on what grade of brake pads you buy. I would recommend going with ceramic pads. "}, {"url": "http://www.answers.com/Q/How_much_should_replacing_brake_rotors_cost", "passage_text": "It depends on the type of pads and rotors. A generic set of pads and rotors can typically cost $100-150 for one axle. Using those numbers, you can expect about 200-300 in part … s plus labor which could run another several hundred dollars. Using the OEM parts or premium parts is far more expensive, for example $100 for a single rotor is not uncommon. $20-$25 for most rotors, times 2 that's about $50. Pads for each side, maybe $30-$50 times 2, … that's $60-$100. This is providing that you only have disc brakes on the front. If you have 4 wheel disc, then multiply by 4 for instead of 2."}]