[{"url": "http://www.ehow.com/how_4443804_get-sector-7-slums-key.html", "passage_text": "During the final act of Final Fantasy VII, it's possible to go back and visit many areas you've already explored -- in some cases with new treasures and secrets to find. Midgar's Sector 5 is one such area, home to the Wall Market and host to a couple of powerful endgame items previously unavailable."}, {"url": "http://www.ehow.com/how_4488750_escape-gas-chamber-final-fantasy.html", "passage_text": "Press “O” and “Triangle” at the same time to unlock Tifa's right arm. Press “O” one final time to free her left arm and escape the chair. Rush over to the gas panel and inspect it to turn off the gas, then try to open the door to activate a cutscene. After the cutscene, Tifa is free from the gas chamber and ready to move on."}, {"url": "http://www.ehow.com/how_4488750_escape-gas-chamber-final-fantasy.html", "passage_text": "Tips & Warnings. 1  After Tifa has the key in her mouth, you can press “Square” and “Triangle” at the same time to unlock her left instead of right arm. 2  If you make this choice, press the “Square” button afterward to free her"}, {"url": "http://www.ign.com/wikis/final-fantasy-vii/Escape_from_Junon", "passage_text": "When Tifa awakens, talk to Barret and follow the soldiers through Shinra's Junon Branch to the Press Room. When Weapon is detected, defeat the Attack Squad and try to open the door to the gas chamber. Talk to Cait Sith near the exit, head out into the corridor, and take the path to the right. Make your way to the Airport and find the HIGHWIND in the far right corner of the platform. Free Tifa from the chair, shut down the gas chamber, and attempt to exit*."}, {"url": "http://www.cheathappens.com/show_board2.asp?headID=37669&titleID=6282", "passage_text": "5: Right arm. 6: Right arm. 7: Turn off the gas on the left side of the chair. You may not get steps 3 and 4 in one shot, you'll see a different animation with her moving the key to another part of her body when it works."}]