[{"url": "http://eric.ed.gov/?id=EJ893424", "passage_text": ", v25 n3 p277-286 Sep 2010. The Cognitive Proficiency Index (CPI) developed for the most recent Wechsler intelligence scales comprises the working memory and processing speed subtests."}, {"url": "https://www.pearsonclinical.com.au/files/WISCIVTechReport6_CPI.pdf", "passage_text": "1 technical report #6 Using the cognitive proficiency index in psychoeducational assessment Lawrence G. Weiss, PhD Amy Dilworth Gabel, PhD Introduction The Cognitive Proficiency Index (CPI) summarizes performance on the WISC–IV working memory and processing speed indices in a single score."}, {"url": "http://eric.ed.gov/?id=EJ965136", "passage_text": "Devena, Sarah E.; Watkins, Marley W. , v28 n2 p133-154 2012. The Wechsler Intelligence Scale for Children-Fourth Edition General Abilities Index and Cognitive Proficiency Index have been advanced as possible diagnostic markers of attention deficit hyperactivity disorder."}, {"url": "http://www.answers.com/Q/What_is_cognitive_fluency", "passage_text": "Cognitive fluency measures the ability to perform simple and complex tasks quickly and fluently. The fluency aspect refers to automaticity, or the ability to develop or use skills so quickly that they become routine and do not require much effort.*."}, {"url": "http://images.pearsonclinical.com/images/Products/Wechsler/Wechsler_GAI.pdf", "passage_text": "• The CPI is an optional index score for the WISC-IV and. the WAIS-IV. • The CPI is the counterpart to the GAI. It is derived from. the core Working Memory and Processing Speed. subtests. • Theoretically, the CPI represents an individual’s. proficiency at cognitive processing."}, {"url": "http://www.iqscorner.com/2009/04/wisc-iv-cognitive-proficiency-index.html", "passage_text": "Just learned that the WISC-IV now has a way to provide a  cognitive proficiency  index. See Technical Report 6. Interesting. Composition is conceptually identical to WJ III Cognitive Efficiency cluster (Gsm+Gs), one of the most sensitive clusters for all kinds of deficits and disorders."}, {"url": "http://eric.ed.gov/?id=EJ893424", "passage_text": "It reflects the proficiency and efficiency of cognitive processing and provides another lens for analyzing children's abilities assessed by the Wechsler Intelligence Scale for Children--Fourth Edition (WISC-IV)."}, {"url": "http://images.pearsonclinical.com/images/Products/Wechsler/Wechsler_GAI.pdf", "passage_text": "CPI=Cognitive Proficiency Index. • The CPI is an optional index score for the WISC-IV and the WAIS-IV.• The CPI is the counterpart to the GAI. It is derived from the core Working Memory and Processing Speed subtests.• Theoretically, the CPI represents an individual’s proficiency at cognitive processing."}]