[{"url": "http://college.usatoday.com/2014/05/10/viewpoint-4-reasons-your-college-gpa-wont-matter-once-you-graduate/", "passage_text": "EMAIL. College is the one place you invest your time and money, only to graduate and step into the realm of uncertainty. You stayed up all night studying for finals, and even skipped that toga party to review flashcards for your philosophy class. But the truth of the matter is, those countless hours spent slaving over your textbooks may not matter when it comes to the real job market."}, {"url": "http://college.usatoday.com/2014/05/10/viewpoint-4-reasons-your-college-gpa-wont-matter-once-you-graduate/", "passage_text": "Here are four reasons your college GPA won’t matter once you graduate. 1. Grade inflation is known as the practice of giving higher grades for work that would’ve received lower grades in the past. This makes it more difficult to identify the best students since more people are given the highest possible grade. You stayed up all night studying for finals, and even skipped that toga party to review flashcards for your philosophy class. But the truth of the matter is, those countless hours spent slaving over your textbooks may not matter when it comes to the real job market."}, {"url": "http://www.campusexplorer.com/college-advice-tips/D760D54D/Does-My-College-GPA-Matter/", "passage_text": "The GPA is calculated by averaging your grades together based on a point system, which is usually a 4.0 scale. There are two types of college GPAs: semester GPA and cumulative GPA. Here are some helpful tips on how you can earn a high GPA in college: 1  Learn good study habits. 2  Don’t wait until the last minute to cram. 3  Instead, study in short periods each day. 4  This is half the battle in achieving good grades in your courses. 5  Show up to every class. 6  Attendance can be a percentage of the grade."}, {"url": "http://www.takeyoursuccess.com/does-your-college-gpa-matter-to-employers/", "passage_text": "Employers are forced to look at your GPA, because that is one of the only “objective” metrics available that shows your ability to succeed in the position. Certainly it is more objective for students with the same major in the same school. Sign 2: In college, most students are forced to take general classes that they aren’t interested in or familiar with. So, your GPA partly tells if you can learn a large amount of information in a short amount of time."}, {"url": "http://college.usatoday.com/2014/05/10/viewpoint-4-reasons-your-college-gpa-wont-matter-once-you-graduate/", "passage_text": "Not necessarily. There are many factors that can determine what your overall gpa will be. For example, if the student with the 3.5 gpa also had a part time job and 2 prestigious internships, that is much more impressive than a person with a 4.0 gpa and no involvement in activities, internships or jobs. You stayed up all night studying for finals, and even skipped that toga party to review flashcards for your philosophy class. But the truth of the matter is, those countless hours spent slaving over your textbooks may not matter when it comes to the real job market."}, {"url": "http://collegelife.about.com/od/glossary/f/Does-Gpa-Matter-In-College.htm", "passage_text": "Answer: This seemingly simple question actually has a complicated answer. Your college GPA can matter quite a bit -- or it can matter not at all. Your GPA is important during your time in school for a multitude of reasons. You likely need to keep it above a certain number in order to avoid being placed on academic probation."}, {"url": "http://www.campusexplorer.com/college-advice-tips/D760D54D/Does-My-College-GPA-Matter/", "passage_text": "When calculating a student’s GPA, a college generally does not count grades of F, Incomplete, or Pass/Fail. But this is not always the rule, as Thomas Edison State College recently passed the policy that these grades will be reflected on a student’s GPA. Here are some helpful tips on how you can earn a high GPA in college: 1  Learn good study habits. 2  Don’t wait until the last minute to cram. 3  Instead, study in short periods each day. 4  This is half the battle in achieving good grades in your courses. 5  Show up to every class. 6  Attendance can be a percentage of the grade."}, {"url": "http://www.takeyoursuccess.com/does-your-college-gpa-matter-to-employers/", "passage_text": "Yes, for the most part companies do care about your grades when hiring. That’s why you put your GPA on your resume if it shows you in a positive light, and don’t if it’s a negative aspect. Sign 2: In college, most students are forced to take general classes that they aren’t interested in or familiar with. So, your GPA partly tells if you can learn a large amount of information in a short amount of time."}, {"url": "http://college.usatoday.com/2014/02/26/new-study-says-high-school-gpa-matters-more-than-sat-scores/", "passage_text": "A recent Bates College study found that high school GPA is the best indicator of success in college — not standardized test scores. The three year study looked at 123,000 students at 33 U.S. colleges and universities that are test-optional. "}, {"url": "http://collegelife.about.com/od/glossary/f/Does-Gpa-Matter-In-College.htm", "passage_text": "If you're interested in graduate school, your GPA will be required (and a major factor in your admissions chances). Your college GPA, then, becomes important only in how important it is for your future plans. This seemingly simple question actually has a complicated answer. Your college GPA can matter quite a bit -- or it can matter not at all. Your GPA is important during your time in school for a multitude of reasons."}]