[{"url": "http://literarydevices.net/metaphor/", "passage_text": "Metaphor Definition. Metaphor is a figure of speech which makes an implicit, implied or hidden comparison between two things or objects that are poles apart from each other but have some characteristics common between them. Furthermore, a metaphor develops a comparison which is different from a simile i.e. we do not use “like” or “as” to develop a comparison in a metaphor. It actually makes an implicit or hidden comparison and not an explicit one."}, {"url": "http://examples.yourdictionary.com/metaphor-examples.html", "passage_text": "comments powered by Disqus. The definition of a metaphor is a figure of speech containing an implied comparison, in which a word or phrase ordinarily and primarily used of one thing is applied to another. For example, the curtain of night or all the world's a stage.. View & Download PDF. "}, {"url": "http://www.merriam-webster.com/dictionary/metaphor", "passage_text": "Full Definition of METAPHOR. 1. : a figure of speech in which a word or phrase literally denoting one kind of object or idea is used in place of another to suggest a likeness or analogy between them (as in drowning in money); broadly: figurative language — compare simile. 2. : an object, activity, or idea treated as a metaphor: symbol 2."}, {"url": "http://www.literarydevices.com/metaphor/", "passage_text": "Definition of Metaphor. A metaphor is a rhetorical figure of speech that compares two subjects without the use of “like” or “as.” Metaphor is often confused with simile, which compares two subjects by connecting them with “like” or “as” (for example: “She’s fit as a fiddle”)."}, {"url": "http://grammar.about.com/od/mo/g/metaphorterm.htm", "passage_text": "Definition. A metaphor is a trope or figure of speech in which an implied comparison is made between two unlike things that actually have something in common. Adjective: metaphorical. A metaphor is said to express the unfamiliar (the tenor) in terms of the familiar (the vehicle). A metaphor is a trope or figure of speech in which an implied comparison is made between two unlike things that actually have something in common. Adjective: metaphorical"}, {"url": "http://www.yourdictionary.com/metaphor", "passage_text": "noun. The definition of a metaphor is a word or phrase used to compare two unlike objects, ideas, thoughts or feelings to provide a clearer description. An example of a metaphor is calling the dependable father a rock. "}, {"url": "http://www.ereadingworksheets.com/figurative-language/figurative-language-examples/metaphor-examples/", "passage_text": "Metaphor Examples. A metaphor is a comparison between two unlike things not using the word “like” or “as” to make the comparison. Metaphors can be powerful, but they can also be tricky to identify at times. This page contains 100 metaphor examples. I have separated the metaphors on this page into two list"}, {"url": "http://examples.yourdictionary.com/metaphor-examples-for-kids.html", "passage_text": "A metaphor is a word or phrase that is used to make a comparison between two people, things, animals, or places. They can be very helpful for kids who are learning the meaning of specific words because they provide a more visual description of the word or thought. Check out these examples of metaphors. "}]