[{"url": "http://www.md-health.com/Types-Of-Bacteria.html", "passage_text": "2. Some of the harmful types of bacteria are those which can cause disease or adversely affect one's health, and these include: Mycobacteria, which are rod-shaped, and neither Gram-positive nor Gram-negative microorganisms that can cause infections of the lungs, skin and other parts of the body. In general most of these bacteria consist of: Lactobacilli, which are rod-shaped, Gram-positive bacteria normally found in the human intestine, vagina and mouth. Their presence prevents the overgrowth of harmful bacteria in these body parts by producing lactic acid."}, {"url": "https://en.wikipedia.org/wiki/Human_microbiome", "passage_text": "The human microbiota is the aggregate of microorganisms, a microbiome that resides on the surface and in deep layers of skin (including in mammary glands), in the saliva and oral mucosa, in the conjunctiva, and in the gastrointestinal tracts. They include bacteria, fungi, and archaea. The main bacterial inhabitants of the stomach include: Streptococcus, Staphylococcus, Lactobacillus, Peptostreptococcus, and types of yeast. Helicobacter pylori is a Gram-negative spiral organism that establishes on gastric mucosa causing chronic gastritis and peptic ulcer disease."}, {"url": "http://www.3fatchicks.com/5-harmful-types-of-bacteria/", "passage_text": "Nutrition. Bacteria are generally classified as either helpful or harmful. Bacteria can be found everywhere, and appear on every surface and every part of the human body. The helpful bacteria are those commonly found in yogurt and in the making of cheeses, and are good for the intestinal tract. Type #1: Streptococcus Pyogenes. The streptococcus pyogenes is the bacteria responsible for many of the common human diseases seen today, including mild skin infections and sore throats. The bacterium is spherical shaped, growing in chains and existing in the human body where the temperature is right for its growth."}, {"url": "https://en.wikipedia.org/wiki/Human_microbiome", "passage_text": "The human skin contains microbes that reside either in or on the skin and can be residential or transient.Resident microorganism types vary in relation to skin type on the human body. A majority of bacteria reside on superficial cells on the skin or prefer to associate with glands. The main bacterial inhabitants of the stomach include: Streptococcus, Staphylococcus, Lactobacillus, Peptostreptococcus, and types of yeast. Helicobacter pylori is a Gram-negative spiral organism that establishes on gastric mucosa causing chronic gastritis and peptic ulcer disease."}, {"url": "http://publications.nigms.nih.gov/findings/jan12/body-bacteria.asp", "passage_text": "Our skin is home to about a trillion microscopic organisms like bacteria and fungi. Together, these creatures and their genetic material—their genomes—make up the microbiome of human skin. Grice studies the skin microbiome to learn how and why bacteria colonize particular places on the body. Already, she's found that the bacterial communities on healthy skin are different from those on diseased skin. "}, {"url": "https://en.wikipedia.org/wiki/Human_microbiome", "passage_text": "It is estimated that 500 to 1,000 species of bacteria live in the human gut Bacterial cells are much smaller than human cells, and it is often said that there are at least ten times as many bacteria as human cells in the body, although the actual ratio has not been strictly defined. The main bacterial inhabitants of the stomach include: Streptococcus, Staphylococcus, Lactobacillus, Peptostreptococcus, and types of yeast. Helicobacter pylori is a Gram-negative spiral organism that establishes on gastric mucosa causing chronic gastritis and peptic ulcer disease."}, {"url": "http://www.wisegeek.org/what-are-good-bacteria.htm", "passage_text": "More than 400 types of bacteria live in the human digestive system. Many of these bacteria types are good bacteria — they help the digestive system to do its job. Beneficial bacteria, like acidophilus and bifidobacterium, may also prevent disease by making an unfavorable environment for less desirable bacteria. Good bacteria can do several things to promote health."}, {"url": "http://www.md-health.com/Types-Of-Bacteria.html", "passage_text": "Harmful Bacteria. Some of the harmful types of bacteria are those which can cause disease or adversely affect one's health, and these include: Mycobacteria, which are rod-shaped, and neither Gram-positive nor Gram-negative microorganisms that can cause infections of the lungs, skin and other parts of the body. In general most of these bacteria consist of: Lactobacilli, which are rod-shaped, Gram-positive bacteria normally found in the human intestine, vagina and mouth. Their presence prevents the overgrowth of harmful bacteria in these body parts by producing lactic acid."}, {"url": "http://www.scientificamerican.com/article/ultimate-social-network-bacteria-protects-health/", "passage_text": "It is more like a complex ecosystem—a social network—containing trillions of bacteria and other microorganisms that inhabit our skin, genital areas, mouth and especially intestines. In fact, most of the cells in the human body are not human at all. Bacterial cells in the human body outnumber human cells 10 to one. "}]