[{"url": "http://www.medicalnewstoday.com/articles/245491.php", "passage_text": "An ultrasound scan, also referred to as a sonogram, diagnostic sonography, and ultrasonography, is a device that uses high frequency sound waves to create an image of some part of the inside of the body, such as the stomach, liver, heart, tendons, muscles, joints and blood vessels. "}, {"url": "http://www.webmd.com/a-to-z-guides/what-is-an-ultrasound", "passage_text": "An instrument called a transducer emits high-frequency sound, inaudible to human ears, and then records the echoes as the sound waves bounce back to determine the size, shape, and consistency of soft tissues and organs. This information is relayed in real time to produce images on a computer screen. Many people who hear the term  ultrasound  likely picture a pregnant woman in her doctor's office getting a sneak peek of the baby growing inside her womb -- perhaps even finding out whether she should paint the nursery pink or blue."}, {"url": "http://science.howstuffworks.com/ultrasound1.htm", "passage_text": "In ultrasound, the following events happen: 1  The ultrasound machine transmits high-frequency (1 to 5 megahertz) sound pulses into your body using a probe. 2  The sound waves travel into your body and hit a boundary between tissues (e.g. between fluid and soft tissue, soft tissue and bone). "}, {"url": "https://en.wikipedia.org/wiki/Ultrasound", "passage_text": "Ultrasound s are sound waves with frequencies higher than the upper audible limit of human hearing. Ultrasound is not different from 'normal' (audible) sound in its physical properties, only in that humans cannot hear it. This limit varies from person to person and is approximately 20 kilohertz (20,000 hertz) in healthy, young adults. Ultrasound devices operate with frequencies from 20 kHz up to several gigahertz"}, {"url": "http://americanpregnancy.org/prenatal-testing/ultrasound/", "passage_text": "Ultrasound: Sonogram. An ultrasound exam is a procedure that uses high-frequency sound waves to scan a woman’s abdomen and pelvic cavity, creating a picture (sonogram) of the baby and placenta. Although the terms ultrasound and sonogram are technically different, they are used interchangeably and reference the same exam. Enroll Now. An ultrasound exam is a procedure that uses high-frequency sound waves to scan a woman’s abdomen and pelvic cavity, creating a picture (sonogram) of the baby and placenta."}, {"url": "http://www.radiologyinfo.org/en/info.cfm?pg=genus", "passage_text": "Ultrasound is safe and painless, and produces pictures of the inside of the body using sound waves. Ultrasound imaging, also called ultrasound scanning or sonography, involves the use of a small transducer (probe) and ultrasound gel placed directly on the skin. High-frequency sound waves are transmitted from the probe through the gel into the body"}, {"url": "http://www.mayoclinic.org/tests-procedures/ultrasound/basics/definition/prc-20020341", "passage_text": "Diagnostic ultrasound, also called sonography or diagnostic medical sonography, is an imaging method that uses high-frequency sound waves to produce images of structures within your body. The images can provide valuable information for diagnosing and treating a variety of diseases and conditions. Most ultrasound examinations are done using a sonar device outside your body, though some ultrasound examinations involve placing a device inside"}, {"url": "http://www.healthline.com/health/ultrasound", "passage_text": "An ultrasound scan is a medical test that uses high-frequency sound waves to capture live images from the inside of your body. The technology is similar to that used by sonar and radar, which help the military detect planes and ships. An ultrasound allows your doctor to see problems with organs, vessels, and tissues—without needing to make an incision. Unlike other imaging techniques, ultrasound uses no radiation, so it is the preferred method for viewing a developing fetus during pregnancy."}]