[{"url": "http://www.softschools.com/facts/biomes/tropical_rainforest_biome_facts/160/", "passage_text": "The tropical rainforest biome is an ecosystem that covers about 7% of the Earth’s surface. They are found all over the world but the majority of the tropical rainforest lies in South America in Brazil. The weather in the tropical rainforest is rainy yet pleasant all year round, day or night."}, {"url": "https://www.recyclingfactsguide.com/tropical-rainforest-ecosystem/", "passage_text": "Tropical Rainforest Ecosystem Facts. A tropical rainforest ecosystem is becoming the most endangered type in the world. It can be found in places near the equator in the countries of Asia, Australia, Africa, South America, Central America and on many of the Pacific Islands."}, {"url": "https://www.controllingpollution.com/rainforest-ecosystem/", "passage_text": "In the rainforest ecosystem the smallest creatures and plants are still important to the structure of the environment. From the smallest gnat to the largest predator, the relationship between the food chain is vital to the balance of the ecosystem."}, {"url": "http://www.srl.caltech.edu/personnel/krubal/rainforest/Edit560s6/www/what.html", "passage_text": "Rainforests are the Earth's oldest living ecosystems. They are so amazing and beautiful. These incredible places cover only 6 % of the Earth's surface but yet they contain MORE THAN 1/2 of the world's plant and animal species! A Rainforest can be described as a tall, dense jungle."}, {"url": "http://www.rainforest-facts.com/rainforest-ecosystem.html", "passage_text": "On the land there are terrestrial ecosystems such as forests, grasslands or rainforests; and in the water there are freshwater and marine ecosystems such as lakes and, say, coral reef. (By the way coral reef is the second species-richest ecosystem on the Earth). Rainforest biome is very complex. It includes a myriad of different species of plants and animals that are all adapted to rain, and lots of it. © Poster by AllPosters."}, {"url": "http://www.srl.caltech.edu/personnel/krubal/rainforest/Edit560s6/www/what.html", "passage_text": "WHAT IS A RAINFOREST Rainforests are the Earth's oldest living ecosystems. They are so amazing and beautiful. These incredible places cover only 6 %of the Earth's surface but yet they contain MORE THAN 1/2 of the world's plant and animal species! A Rainforest can be described as a tall, dense jungle."}, {"url": "http://www.answers.com/Q/How_is_the_rainforest_an_ecosystem", "passage_text": "The rainforest is an ecosystem because it is home to many plants and animals which all exist in relationship with one another. Because it is a specific type of environment, there are different weather patterns, different plants and different animals, all reliant upon the unique conditions of that ecosystem."}]