[{"url": "http://www.webmd.com/cholesterol-management/tests-for-high-cholesterol-lipid-panel", "passage_text": "Your total cholesterol level is in the Desirable range, but your level of bad LDL cholesterol is High. This may mean that your level of high-density lipoprotein (HDL), or good cholesterol, is too low. It is best to have a high level of good HDL and a low level of bad LDL. The HDL helps keep your LDL level in check. Ask your doctor for your HDL level. If your HDL is low, increasing your physical activity can increase it, which may help reduce your LDL level. Your total cholesterol level is in the Desirable range, but your level of bad LDL cholesterol is Very High."}, {"url": "http://www.webmd.com/cholesterol-management/tc/when-to-have-a-cholesterol-test-topic-overview", "passage_text": "How often you should get a cholesterol test depends on your cholesterol level, your other health problems, and your overall chance of heart disease. An adult who is being treated for high cholesterol may need more frequent tests, depending on his or her cholesterol level and the type of treatment being used. This may mean that your level of high-density lipoprotein (HDL), or good cholesterol, is too low. It is best to have a high level of good HDL and a low level of bad LDL because the HDL helps keep your LDL level in check. Ask your doctor for your HDL level."}, {"url": "http://newsroom.ucla.edu/releases/majority-of-hospitalized-heart-75668", "passage_text": "The study also showed that HDL cholesterol, or good cholesterol, levels have dropped in patients hospitalized for heart attack over the past few years, possibly due to increasing rates of obesity, insulin resistance and diabetes. Researchers found that 54.6 percent of patients had HDL levels below 40 mg/dL. Specifically, these patients had low-density lipoprotein (LDL) cholesterol levels that met current guidelines, and close to half had LDL levels classified in guidelines as optimal (less than 100 mg/dL)."}, {"url": "http://www.findpulse.com/how-often-should-i-have-my-triglycerides-checked/", "passage_text": "If you don’t have heart disease or high cholesterol, you should have your triglycerides level checked at least every 5 years. Establish your baseline by having a lipid panel done in early adulthood, around 18 to 20 years old. Then, if that is normal, the American Heart Association recommends retesting every five years. If you are a diabetic or have pre-diabetes, or if you are overweight, have your triglycerides checked at least every year. If your triglycerides are above 150 mg/dl, it is best to check more often. Triglycerides, unless you are dealing with genetic issues, respond very nicely to changes in your diet and lifestyle."}, {"url": "http://www.webmd.com/cholesterol-management/tests-for-high-cholesterol-lipid-panel", "passage_text": "Having high total cholesterol, high bad cholesterol, or low good cholesterol could place you at higher than average risk for heart disease. Knowing about high cholesterol is the first step toward lowering it, which reduces your risk. That's the reason to get a cholesterol test. The HDL helps keep your LDL level in check. Ask your doctor for your HDL level. If your HDL is low, increasing your physical activity can increase it, which may help reduce your LDL level. Your total cholesterol level is in the Desirable range, but your level of bad LDL cholesterol is Very High."}, {"url": "http://www.mayoclinic.org/diseases-conditions/high-blood-cholesterol/in-depth/statins/ART-20045772", "passage_text": "Low-density lipoprotein cholesterol (LDL, or bad cholesterol) should be below 100 mg/dL (3.37 mmol/L). But the numbers alone won't tell you or your doctor the whole story. High cholesterol is only one of a number of risk factors for heart attack and stroke. Whether you need to be on a statin depends on your cholesterol level, along with your other risk factors for cardiovascular disease. Most people should try to keep their total cholesterol level below 200 milligrams per deciliter (mg/dL) (6.22 millimoles per liter, or mmol/L)."}, {"url": "http://www.webmd.com/cholesterol-management/tc/when-to-have-a-cholesterol-test-topic-overview", "passage_text": "Your total cholesterol level is in the Desirable range, but your level of bad LDL cholesterol is High. This may mean that your level of high-density lipoprotein (HDL), or good cholesterol, is too low. It is best to have a high level of good HDL and a low level of bad LDL. The HDL helps keep your LDL level in check. Ask your doctor for your HDL level. This may mean that your level of high-density lipoprotein (HDL), or good cholesterol, is too low. It is best to have a high level of good HDL and a low level of bad LDL because t"}, {"url": "http://www.cdc.gov/cholesterol/cholesterol_education_month.htm", "passage_text": "More than 102 million American Adults (20 years or older) have total cholesterol levels at or above 200 mg/dL, which is above healthy levels. More than 35 million of these people have levels of 240 mg/dL or higher, which puts them at high risk for heart disease. "}, {"url": "https://www.bhf.org.uk/heart-matters-magazine/medical/drug-cabinet/statins", "passage_text": "You’ll need a blood test to check that your blood cholesterol level has come down. After starting a statin, it takes about six weeks for cholesterol levels to stabilise, so most doctors would re-check your cholesterol after about eight weeks. You should have a check-up at least once a year or more often if your doctor thinks it is necessary. "}, {"url": "http://www.findpulse.com/how-often-should-i-have-my-triglycerides-checked/", "passage_text": "If YOU Have Heart Disease. If you have heart disease, work with your doctor on how often you should have your lipid panel done. Depending on your treatment, you may have your triglycerides and cholesterol checked as often as every two months. If you are a diabetic or have pre-diabetes, or if you are overweight, have your triglycerides checked at least every year. If your triglycerides are above 150 mg/dl, it is best to check more often. Triglycerides, unless you are dealing with genetic issues, respond very nicely to changes in your diet and lifestyle."}]