[{"url": "http://economictimes.indiatimes.com/definition/risk", "passage_text": "Definition: Risk implies future uncertainty about deviation from expected earnings or expected outcome. Risk measures the uncertainty that an investor is willing to take to realize a gain from an investment. Description: Risks are of different types and originate from different situations. "}, {"url": "https://en.wikipedia.org/wiki/Risk", "passage_text": "Risk is potential of losing something of value. Values (such as physical health, social status, emotional well being or financial wealth) can be gained or lost when taking risk resulting from a given action, activity and/or inaction, foreseen or unforeseen. Risk can be seen as relating to the probability of uncertain future events. For example, according to factor analysis of information risk, risk is: the probable frequency and probable magnitude of future loss. In computer science this definition is used by The Open Group"}, {"url": "http://economictimes.indiatimes.com/definition/risk-management", "passage_text": "Definition: In the world of finance, risk management refers to the practice of identifying potential risks in advance, analyzing them and taking precautionary steps to reduce/curb the risk. Description: When an entity makes an investment decision, it exposes itself to a number of financial risks. Tweet. R"}, {"url": "http://www.hsa.ie/eng/Topics/Hazards/", "passage_text": "When we refer to risk in relation to occupational safety and health the most commonly used definition is ‘ risk is the likelihood that a person may be harmed or suffers adverse health effects if exposed to a hazard.’. "}, {"url": "http://www.businessdictionary.com/definition/risk.html", "passage_text": "6. Workplace: Product of the consequence and probability of a hazardous event or phenomenon. For example, the risk of developing cancer is estimated as the incremental probability of developing cancer over a lifetime as a result of exposure to potential carcinogens (cancer-causing substances). "}, {"url": "http://www.ccohs.ca/oshanswers/hsprograms/hazard_risk.html", "passage_text": "The meaning of the word hazard can be confusing. Often dictionaries do not give specific definitions or combine it with the term risk. For example, one dictionary defines hazard as a danger or risk which helps explain why many people use the terms interchangeably. There are many definitions for hazard but the more common definition when talking about workplace health and safety is: A hazard is any source of potential damage, harm or adverse health effects on something or someone under certain conditions at work."}, {"url": "http://www.ccohs.ca/oshanswers/hsprograms/hazard_risk.html", "passage_text": "1 what kind of effect could result from the specific exposure a person experienced, 2  the risk (or likelihood) that exposure to a hazardous thing or condition would cause an injury, or disease or some incidence causing damage, and. 3  how severe would the damage, injury or harm (adverse health effect) be from the exposure. There are many definitions for hazard but the more common definition when talking about workplace health and safety is: A hazard is any source of potential damage, harm or adverse health effects on something or someone under certain conditions at work."}, {"url": "http://www.investopedia.com/terms/r/riskmanagement.asp", "passage_text": "BREAKING DOWN 'Risk Management'. Simply put, risk management is a two-step process-determining what risks exist in an investment and then handling those risks in a way best-suited to your investment objectives. Risk management occurs everywhere in the financial world. DEFINITION of 'Risk Management'. The process of identification, analysis and either acceptance or mitigation of uncertainty in investment decision-making."}, {"url": "https://technet.microsoft.com/en-us/library/cc539279.aspx", "passage_text": "Risk Management Examples. Risk Management Examples. This section of the documentation provides example risk deliverables you can use for your own risk management. Each example focuses on a specific situation with background details to help you understand the context of using the various risk management spreadsheets."}]