[{"url": "https://answers.yahoo.com/question/index?qid=20071202191548AAMbTFP", "passage_text": "Proximal Convoluted Tube is-Fluid in the filtrate entering the proximal convoluted tubule is reabsorbed into the peritubular capillaries. This is driven by sodium transport from the lumen into the blood by the Na+/K+ ATPase in the basolateral membrane of the epithelial cells. This is the most important transport mechanism in the PCT. The proximal tubule is the portion of the duct system of the nephron leading from Bowman's capsule to the loop of Henle. Structure and appearance The most distinctive characteristic of the proximal tubule is its brush border (or striated border)."}, {"url": "http://www.wisegeek.com/what-is-the-proximal-convoluted-tubule.htm", "passage_text": "Each nephron consists of the renal corpuscle, the proximal convoluted tubule, the loop of Henle and the distal convoluted tubule. As blood flows through the capillaries in the renal corpuscle, about 20 percent of the plasma water is secreted into Bowman's capsule. The proximal convoluted tubule (PCT) is a small tubular structure within the nephron of the kidney. The PCT connects Bowman's capsule with the proximal straight tubule, and it is essential for the reabsorption of water and solutes from filtrate within the nephron"}, {"url": "http://en.wikivet.net/Reabsorption_and_Secretion_Along_the_Proximal_Tubule_-_Anatomy_%26_Physiology", "passage_text": "The majority (70%) of sodium is reabsorbed in the proximal tubule. It is reabsorbed into the cytosol of the epithelial cells either alone by diffusion through ion channels followed by water and chloride or together with another product such as glucose or AA using a co-transporter by secondary active co-transport. Epithelial Transport. Sodium is the most important ion in relation to reabsorption from the proximal tubule. Water and chloride follow sodium passively and many other ions, compounds and molecules are absorbed through co-transporters with sodium."}, {"url": "http://medcell.med.yale.edu/histology/urinary_system_lab/proximal_convoluted_tubule.php", "passage_text": "Proximal Convoluted Tubule. The proximal convoluted tubule is the site where majority (65%) of ions and water in the urinary space is reabsorbed back into the body. The cells of the proximal convoluted tubule have a deeply stained, eosinophilic cytoplasm. "}, {"url": "https://quizlet.com/11088399/proximal-tubule-flash-cards/", "passage_text": "passive transport; As fluid is reabsorbed from the proximal tubule, the concentration of urea in the luminal fluid will increase. This creates a concentration gradient for urea which favors the passive diffusion of urea out of the tubule lumen into the peritubular capillaries (passive reabsorption of urea). Obligatory-Proximal tubule. Approximately 2/3 of the filtered solute and H2O are reabsorbed in the proximal tubule in a fixed ratio. This is, water and solute are reabsorbed in a fixed pattern due to the obligatory coupling of H2O flow to solute flow in this segment of the nephron."}, {"url": "http://www.wisegeek.com/what-is-the-proximal-convoluted-tubule.htm", "passage_text": "These 10 animal facts will amaze you. The proximal convoluted tubule (PCT) is a small tubular structure within the nephron of the kidney. The PCT connects Bowman's capsule with the proximal straight tubule, and it is essential for the reabsorption of water and solutes from filtrate within the nephron"}, {"url": "https://en.wikipedia.org/wiki/Proximal_convoluted_tubule", "passage_text": "Fluid in the filtrate entering the proximal convoluted tubule is reabsorbed into the peritubular capillaries. This is driven by sodium transport from the lumen into the blood by the Na+/K+ ATPase in the basolateral membrane of the epithelial cells. Sodium reabsorption is primarily driven by this P-type ATPase. The proximal tubule is the portion of the duct system of the nephron of the kidney which leads from Bowman's capsule to the loop of Henle."}]