[{"url": "http://www.homeadvisor.com/cost/garages/build-a-garage/", "passage_text": "Find out how much your project will cost. Provide a few details about your project and receive competitive quotes from local pros. The average national cost to build a garage is $23,573, with most homeowners spending between $14,621 and $32,525. When it comes to building a garage, a lot of factors come into play, which mimic other large-scale building projects"}, {"url": "http://www.behmdesign.com/garage-building-cost.aspx", "passage_text": "If you are in an area with higher-than-average cost of living you can use $50 to $55. If there are complications or you prefer top quality materials and components the price can go up.So, generally speaking, a 24 ft.sq., two car, basic garage will cost in the range of $17,000 to $23,000. But for now this will get you in the ballpark of cost to build your new garage. Foundation/Slab Cost: $_____________________________________. The most reliable method for rough cost estimating of concrete foundation and slab work is to contact a local concrete contractor-one who specializes in this work."}, {"url": "http://www.fixr.com/costs/build-attached-garage", "passage_text": "Adding a garage to a home can require an extensive amount of work, and for this project we will assess the cost of building an attached garage of 676 square feet (26'x26') to a pre-existing home (this is going to easily accommodate two vehicles, provide storage and even have room for a small work area). For the garage addition, the typical costs include: 1  According to author Stu Silverman the average cost of adding a garage begins at roughly $7,500, and for a two-car garage the average costs will go much higher. 2  The above figures place the garage addition at $40 per square foo t."}, {"url": "http://thehousingforum.com/how-much-does-it-cost-to-build-a-garage/", "passage_text": "In the example given above, the 728 SF garage and 380 SF loft totals 1108 SF. With some frills, it should cost $35-$45K/SF or $35000-$45000. DIY. One way to save money is to buy materials, perhaps a kit, and do as much of the labor as you can, contracting out what you cannot do. Excavation and foundation will cost $15-$20/SF, the higher end for northern frosts or poor soil anywhere."}, {"url": "http://home.costhelper.com/build-garage.html", "passage_text": "1 Upgrading the quality of materials can bump the cost to $55 a square foot, or $13,200 for a minimum single-car structure, $21,000 for a two-car garage and $47,000 or more for the dream version. 1 Kits with pre-cut or pre-fab materials to build a steel or wood garage run $5,000-$14,000 or more, depending on the size of the structure and the quality of materials."}, {"url": "http://www.fixr.com/costs/build-detached-garage", "passage_text": "For the building of the garages, the typical costs will include: 1  Two car-According to Hanley Wood and their Remodeling magazine, the cost to construct a standard two-car garage addition is $58,432. 2  This translates to $86 per square foot; and. 1 Concrete footings and slab to grade - The average price of concrete is $75 per cubic yard, with the full slab it that would require roughly 13 cubic yards for the two car version at a cost of $975, while it would take 27 cubic yards for the four car version at a cost of $2025;"}, {"url": "http://www.rempros.com/costs/building_garage_prices.html", "passage_text": "How much does it cost to build a garage? Cost to build a new 2 car garage will vary from $30 to $41 per square foot for standard construction including labor cost and materials prices. How much does it cost to get a permit for building a new garage? The city or village will define the cost of the permit, but on average the price will vary from $190 to $270."}, {"url": "http://www.fixr.com/costs/build-attached-garage", "passage_text": "1 According to author Stu Silverman the average cost of adding a garage begins at roughly $7,500, and for a two-car garage the average costs will go much higher. 2  This sort of structure will average at $27,040. 3  The resale value of this update would hold at $21,635, or a nearly 81% return on investment. For the garage addition, the typical costs include: 1  According to author Stu Silverman the average cost of adding a garage begins at roughly $7,500, and for a two-car garage the average costs will go much higher. 2  The above figures place the garage addition at $40 per square foo t."}, {"url": "http://www.behmdesign.com/garage-building-cost.aspx", "passage_text": "by Jay Behm-A very basic way to estimate the cost of building a detached garage is to simply apply a typical average per square foot construction of $30 to $40. That is for an average cost basis for having a contractor / builder build a basic one story garage for you on your property. But for now this will get you in the ballpark of cost to build your new garage. Foundation/Slab Cost: $_____________________________________. The most reliable method for rough cost estimating of concrete foundation and slab work is to contact a local concrete contractor-one who specializes in this work."}]