[{"url": "http://www.autodealerpeople.com/forum/topics/start-up-cost-with-current-25k-in-flooring", "passage_text": "Eric, starting your own used car dealership is great! What a lot of dealers fail to do is write a business plan. I highly recommend you put one together as a road map for your store. Having the experience you have is great and having a business plan will help you execute your strategies. "}, {"url": "http://www.autoincome.com/car-industry-problems.htm", "passage_text": "The average monthly overhead cost to maintain a used car dealership in any state will vary between $1,000 to $5,000 depending upon the particular state. Imagine spending $1,000 to $5,000 each month just to have access to a used car dealer license. The only way to thrive in the used car sales industry today is to cut costs and the best way to do so is to join an AutoIncome Co-op Used Car Dealership. Before we introduce our Dealer License Co-op Solution, lets examine why it cost so much to maintain a used car dealer license today."}, {"url": "http://www.edmunds.com/car-buying/where-does-the-car-dealer-make-money.html", "passage_text": "That $4,000 is essentially the dealer's expected profit. Dealers will point out that they have to recondition used cars, and that costs money. But even so, the profit margin on a used car is typically more than what a new car sale can bring. NADA reports that at the average car dealership in 2012, net profit per new vehicle retailed was $111. "}, {"url": "http://smallbusiness.chron.com/average-startup-costs-new-car-dealership-12923.html", "passage_text": "Cars and light trucks sold and marketed throughout the United States usually come through franchised dealers. New car dealerships or dealers make up the largest part of the national retail industry. Since 2007, their revenues have amounted to more than $690 billion."}, {"url": "http://www.wikihow.com/Become-an-Auto-Dealer", "passage_text": "1. Save your money. Almost every step toward becoming a car dealer will cost you money. Depending on the type of business you want to run and the amount of inventory you plan on holding, your costs can run anywhere from $30,000 to $1,000,000 or more. Ad."}, {"url": "http://www.autoincome.com/car-industry-problems.htm", "passage_text": "Most states require that a used car dealership be located in a commercially zoned location and that usually means high rent. Landlord's will require a first month rent and security deposit and that will cost between $1,000 to $3,000 depending on the location. The only way to thrive in the used car sales industry today is to cut costs and the best way to do so is to join an AutoIncome Co-op Used Car Dealership. Before we introduce our Dealer License Co-op Solution, lets examine why it cost so much to maintain a used car dealer license today."}, {"url": "http://www.autoincome.com/car-industry-problems.htm", "passage_text": "This is not the industry of 30 years ago when a dealer could buy a car at auction and sell it a few weeks later for a handsome profit. Increased costs are cutting into the used car dealer's profit margin and will continue to do so. The only way to thrive in the used car sales industry today is to cut costs and the best way to do so is to join an AutoIncome Co-op Used Car Dealership. Before we introduce our Dealer License Co-op Solution, lets examine why it cost so much to maintain a used car dealer license today."}, {"url": "http://www.autoincome.com/car-industry-problems.htm", "passage_text": "Commercial used car dealer insurance can cost up to $20,000 per year and usually requires a down payment of twenty to forty percent..! Now add in the cost of the bond, utility deposits, signage, legal fees and other requirements and you can plan on spending another $1,000 to $3,000..! The only way to thrive in the used car sales industry today is to cut costs and the best way to do so is to join an AutoIncome Co-op Used Car Dealership. Before we introduce our Dealer License Co-op Solution, lets examine why it cost so much to maintain a used car dealer license today."}, {"url": "http://www.clublexus.com/forums/car-chat/222988-cost-of-opening-a-car-dealership.html", "passage_text": "I also was wondering if a exotic dealership would really cost that much more then a korean car dealership. Cause if you think about 150 kia's @ $20,000 average per car is 3 million, where as 15 exotic cars @ $200,000 average per car is 3 million as well. "}]