[{"url": "http://nursejournal.org/articles/types-of-nursing-degrees/", "passage_text": "Doctorate. The highest level of nursing degree that you can earn is a doctor of nursing practice, or DNP. You need to have a bachelor’s degree at least to enter a DNP program. You also usually already have your MSN in this program, but there are some DNP programs that allow you to earn your MSN and DNP at the same time. You will qualify for 88% or more of the available nursing jobs if you have your BSN; that falls to only 37% with an associate’s degree. This is a four year degree that combines learning in the classroom with clinical training."}, {"url": "https://en.wikipedia.org/wiki/Diploma_in_Nursing", "passage_text": "In the United States, this diploma is usually awarded by hospital-based nursing schools. Students awarded a Diploma in Nursing are qualified to take the NCLEX-RN exam and apply for licensure as a Registered Nurse. At one time, all nurses in the United States were diploma-prepared. "}, {"url": "http://www.innerbody.com/careers-in-health/nursing-degrees", "passage_text": "Overview. A career in nursing is a great decision for many people. Indeed, many nurses feel it is more of a calling than a career per se; they are driven to provide care to those who need it. Few other professions, if any, afford the opportunity to care for a multitude of other people to such an extent as nursing."}, {"url": "http://study.com/nursing_school_requirements.html", "passage_text": "Nursing School Requirements by Degree Level. Nursing school students in associate and bachelor's degree programs learn a vast array of skills, such as patient care, pharmacology and mental health treatment, all of which are necessary to enter the nursing field."}, {"url": "http://nursingschoolprograms.com/nursing-diploma/nursing-diploma/", "passage_text": "A diploma in nursing is an entry-level nursing degree. This means that completing a nursing diploma program can make you eligible for sitting in the NCLEX, the mandatory examination for getting a license as a registered nurse. An associates degree in nursing meets all requirements for a higher nursing education so you have the flexibility to pursue a BSN degree if you want. The nursing diploma program, on the other hand, does not. This difference is particularly important if you have plans in advancing your degree in the future."}, {"url": "http://study.com/nursing_school_requirements.html", "passage_text": "Associate Degree in Nursing. An ADN program typically takes two years to complete and is designed to prepare students for the demands of a career as a registered nurse (RN). For any ADN program, students must have a high school diploma or equivalent. Nursing school students in associate and bachelor's degree programs learn a vast array of skills, such as patient care, pharmacology and mental health treatment, all of which are necessary to enter the nursing field."}, {"url": "http://www.innerbody.com/careers-in-health/nursing-degrees", "passage_text": "The third way of becoming a registered nurse is by attending a college or university for a bachelor’s degree in nursing (BSN). Unlike the ADN, which takes two years to accomplish, this degree requires four years, unless the student already holds a bachelor’s degree. Indeed, many nurses feel it is more of a calling than a career per se; they are driven to provide care to those who need it. Few other professions, if any, afford the opportunity to care for a multitude of other people to such an extent as nursing."}, {"url": "http://www.allnursingschools.com/nursing-careers/registered-nursing/degrees/", "passage_text": "Bachelor's Degree Programs. An aspiring RN can earn a bachelor's of science in nursing (BSN) in four years at a college or university. If you're already an RN, you can enroll in an RN-to-BSN program which is geared specifically for RNs who have an associate's degree or nursing diploma. This path usually takes about two to three years. Earning an ADN is the most popular option for registered nurses and opens the door to entry-level staff nurse positions which will provide you with hands-on experience in the medical field. This is the fastest path to becoming a registered nurse as most associate's degree programs last"}, {"url": "http://nursingschoolprograms.com/nursing-diploma/nursing-diploma/", "passage_text": "A nursing diploma program is not the only express route to starting one’s career in nursing. The associate’s degree in nursing or ADN is another entry-level nursing degree that can lead to a license as a registered nurse. An associates degree in nursing meets all requirements for a higher nursing education so you have the flexibility to pursue a BSN degree if you want. The nursing diploma program, on the other hand, does not. This difference is particularly important if you have plans in advancing your degree in the future."}, {"url": "http://www.rasmussen.edu/degrees/nursing/blog/nursing-credentials-101-from-lpn-lvn-bsn-dnp/", "passage_text": "Mean salary: $157,000 - $214,000. The CRNA is a graduate-level certification that nurses are eligible to pursue after completing a BSN program. Accredited CRNA programs culminate in either a master’s degree or doctorate with the opportunity to sit for a national certification exam. The most common graduate-level degree in nursing is MSN but there are several variations including Master of Nursing (MN) and Master of Science (MS) or Master of Arts (MA) with a major in nursing."}]