[{"url": "http://safetyonlinecourse.co.uk/about-human-focus/", "passage_text": "Company Overview. Human Focus is a web-based health and safety compliance support company — specialising in areas such an training (E-learning), health and safety records management, and, contractor management."}, {"url": "http://theengagementeffect.com/our-toolset/additional-tools/human-performance-improvement", "passage_text": "The process is driven by a business need and a performance need, justified by the results of a cause analysis. The Human Performance Improvement process is very similar to Human Performance Technology. HPI provides you with a systematic process to follow on what can often be a not-so-systematic path. Being business focused means having a clear understanding what your organization’s strategic priorities are and using those priorities to guide your management decisions. The process of analyzing performance begins with a analyzing your business, which allows you to focus on the goals for your business."}, {"url": "http://www.apa.org/action/science/developmental/", "passage_text": "Developmental Psychology Studies Human Development Across the Lifespan. Developmental psychologists focus on human growth and changes across the lifespan, including physical, cognitive, social, intellectual, perceptual, personality and emotional growth. Developmental psychologists study human growth and development over the lifespan, including physical, cognitive, social, intellectual, perceptual, personality and emotional growth. Developmental psychologists working in colleges and universities tend to focus primarily on research or teaching."}, {"url": "http://www.focushr.net/", "passage_text": "Focus HR is dedicated to helping small business owners grow their business. We look out for your best interests, minimize your risks, and protect your most vital resource – your employees. We provide cost-effective business solutions so you can focus on increasing your bottom line. 1  250+ Clients. "}, {"url": "http://www.nationalhumanservices.org/what-is-human-services", "passage_text": "The field of Human Services is broadly defined, uniquely approaching the objective of meeting human needs through an interdisciplinary knowledge base, focusing on prevention as well as remediation of problems, and maintaining a commitment to improving the overall quality of life of service populations. The primary purpose of the human services professional is to assist individual and communities to function as effectively as possible in the major domains of living. A strong desire to help others is an important consideration for a job as a human services worker."}, {"url": "http://www.creativehrm.com/", "passage_text": "The modern Human Resources Management translates the business strategy into the HR Strategy. However, Human Resources Management is not strategically linked with the business strategy yet (see more about the history of Human Resources Management). The HR Strategy is the essential document, which drives the development of Human Resources in the organization. The HR Strategy sets a clear path for HR professionals in the organization and aligns HR employees around shared strategic HR goals."}, {"url": "http://theengagementeffect.com/our-toolset/additional-tools/human-performance-improvement", "passage_text": "The HPI process helps you to articulate your business goals, link these goals to human performance, diagnose the current state of performance in the organization, find the root causes for performance deficiencies, implement solutions, and evaluate the results of the interventions. Being business focused means having a clear understanding what your organization’s strategic priorities are and using those priorities to guide your management decisions. The process of analyzing performance begins with a analyzing your business, which allows you to focus on the goals for your business."}, {"url": "http://www.humanfocus.org.uk/content/doc/RoSPAAccreditationOfHF.pdf", "passage_text": "This arrangement permits the display of the RoSPA logo by Human Focus to recognize this accreditation What is RoSPA accrediting in the Human Focus system? RoSPA accredits two aspects of Human Focus-these are: 1. The technical content of Human Focus health and safety training programmes 2. The technical content of the organisation level certification process provided by Human Focus Terms and conditions of this accreditation 1. Human Focus is responsible for all aspects of the delivery of its training and certification processes. Participating organisations are certified by Human Focus and not RoSPA. This accreditation confirms that the technical content of these processes and training programmes are approved by RoSPA. 2."}, {"url": "http://www.nationalhumanservices.org/what-is-human-services", "passage_text": "The field of Human Services is a broadly defined one, uniquely approaching the objective of meeting human needs through an interdisciplinary knowledge base, focusing on prevention as well as remediation of problems and maintaining a commitment to improving the overall quality of life of service populations. The primary purpose of the human services professional is to assist individual and communities to function as effectively as possible in the major domains of living. A strong desire to help others is an important consideration for a job as a human services worker."}, {"url": "http://www.globalspec.com/reference/73276/203279/5-human-resource-focus", "passage_text": "5 Human Resource Focus. Category 5 asks about how you cultivate effective employees and provide them with the knowledge, skills, and motivation to enable them to perform consistently well. "}]