[{"url": "http://www.medicinenet.com/script/main/art.asp?articlekey=4425", "passage_text": "Monoclonal antibody: An antibody produced by a single clone of cells. A monoclonal antibody is therefore a single pure type of antibody. Monoclonal antibodies can be made in large quantities in the laboratory and are a cornerstone of immunology. Monoclonal antibodies are increasingly coming into use as therapeutic agents. "}, {"url": "http://medical-dictionary.thefreedictionary.com/monoclonal+antibody", "passage_text": "Monoclonal antibody. A protein substance which is produced in the laboratory by a single population of cells. They are being tested as a possible form of cancer treatment. Any of a class of highly specific antibodies produced by the clones of a single hybrid cell formed in the laboratory by the fusion of a B cell with a tumor cell and widely used in medical and biological research."}, {"url": "http://medical-dictionary.thefreedictionary.com/monoclonal+antibody", "passage_text": "an antibody produced by a clone or genetically homogeneous population of fused hybrid cells, that is, hybridoma. Hybrid cells are cloned to establish cell lines producing a specific antibody that is chemically and immunologically homogeneous. Any of a class of highly specific antibodies produced by the clones of a single hybrid cell formed in the laboratory by the fusion of a B cell with a tumor cell and widely used in medical and biological research."}, {"url": "http://www.biology-online.org/dictionary/Monoclonal", "passage_text": "1. (Science: cell biology) Used of a cell line whether within the body or in culture to indicate that it has a single clonal origin. 2. (Science: immunology) monoclonal antibodies are produced by a single clone of hybridoma cells and are therefore a single species of antibody molecule. "}, {"url": "http://www.whatisbiotechnology.org/science/mabs", "passage_text": "Definition. Monoclonal antibodies are complex proteins derived from a single B cell made by the body's immunological defence system to recognise and fight foreign invaders such as bacteria and viruses. Each monoclonal antibody is designed to recognise and bind to specific cell-surface receptors. Monoclonal antibodies are made from natural antibodies made by the body to fight foreign invaders. Their production involves several steps. In the first instance a laboratory animal is injected with a desired target to stimulate their immune system to produce antibodies."}, {"url": "http://www.cancer.org/treatment/treatmentsandsideeffects/treatmenttypes/immunotherapy/immunotherapy-monoclonal-antibodies", "passage_text": "Monoclonal antibodies to treat cancer. One way the immune system attacks foreign substances in the body is by making large numbers of antibodies. An antibody is a protein that sticks to a specific protein called an antigen. Antibodies circulate throughout the body until they find and attach to the antigen. Once attached, they can recruit other parts of the immune system to destroy the cells containing the antigen."}, {"url": "http://study.com/academy/lesson/what-are-antibodies-definition-function-types.html", "passage_text": "Antibodies Defined. Antibodies are proteins that are produced by the immune system to help stop harm from occurring. They are also called immunoglobulins. When an intruder, such as a virus, bacteria, or other chemical, enters the body, the immune system springs into action. These invaders, antigens, are met by the B cells (a type of white blood cell from the immune system). These B cells will begin to create Y-shaped proteins called antibodies that begin the process to destroy the antigen and to protect the body from harm and infection."}, {"url": "https://en.wikipedia.org/wiki/Monoclonal_antibodies", "passage_text": "Monoclonal antibodies (mAb or moAb) are monospecific antibodies that are made by identical immune cells that are all clones of a unique parent cell, in contrast to polyclonal antibodies which are made from several different immune cells. Monoclonal antibodies have monovalent affinity, in that they bind to the same epitope. Given almost any substance, it is possible to produce monoclonal antibodies that specifically bind to that substance; they can then serve to detect or purify that substance."}, {"url": "http://www.whatisbiotechnology.org/science/mabs", "passage_text": "Monoclonal antibodies. Monoclonal antibodies are made from natural antibodies made by the body to fight foreign invaders. Their production involves several steps. In the first instance a laboratory animal is injected with a desired target to stimulate their immune system to produce antibodies."}, {"url": "http://medical-dictionary.thefreedictionary.com/monoclonal+antibody", "passage_text": "An antibody produced by a clone or genetically homogeneous population of hybrid cells (i.e., hybridoma); hybrid cells are cloned to establish cell lines producing a specific antibody that is chemically and immunologically homogeneous; a mainstay of immunologic research and medical diagnosis. Any of a class of highly specific antibodies produced by the clones of a single hybrid cell formed in the laboratory by the fusion of a B cell with a tumor cell and widely used in medical and biological research."}]