[{"url": "http://ftw.usatoday.com/2014/04/jack-nicklaus-tiger-woods-record", "passage_text": "Instead of debating “when” Tiger will break Jack Nicklaus’ record of 18 career majors, which seemed inevitable for so many years, many experts wonder if Woods will ever add to his total. Nicklaus, for one, still believes Woods will surpass him."}, {"url": "http://www.usatoday.com/story/sports/golf/2015/02/20/jack-nicklaus-tiger-woods-comments-golf-channel/23735169/", "passage_text": "Jack Nicklaus believes Tiger Woods will pass his major record. Few people have the perspective on Tiger Woods' career than Jack Nicklaus who has Woods in his rear-view mirror. The 18-time major winner appeared on Golf Channel and said he thinks Tiger will pass his record."}, {"url": "http://espn.go.com/golf/story/_/id/10748397/jack-nicklaus-says-tiger-woods-break-record-18-majors", "passage_text": "But Jack Nicklaus -- who holds the record of 18 victories in golf's Grand Slam events -- still thinks Woods eventually will break that mark and get to his goal of 19."}, {"url": "http://www.golf.com/tour-and-news/tiger-woods-vs-jack-nicklaus-major-championship-records", "passage_text": "He was 32. Jack Nicklaus won 18 professional majors, an iconic total that has become the most significant record in golf, and one of the most significant in all of sports. Tiger Woods has won a staggering 14 majors, but his quest to pass Nicklaus has stalled. Here's how their records compare."}, {"url": "http://www.golfchannel.com/news/joe-posnanski/will-woods-break-nicklaus-majors-record/", "passage_text": "Why Woods will not break the record: He has stopped winning Masters. Nicklaus was great at the all the majors, of course. He won four U.S. Opens, three British Opens and five PGA Championships. But the Masters was the key."}, {"url": "http://www.sbnation.com/golf/2015/1/15/7547703/tiger-woods-majors-record-jack-nicklaus", "passage_text": "Breaking news: Jack Nicklaus holds a press conference and no one asks him if Tiger Woods still has a chance to break his majors record."}, {"url": "http://www.sbnation.com/golf/2014/12/30/7463679/tiger-woods-major-wins-record-age-39-jack-nicklaus", "passage_text": "Rory McIlroy is now shorter odds than Tiger Woods to break Jack Nicklaus' record of 18 Majors. Rory is 6/1 and Tiger is 8/1. #RoryEra. If he's healthy, I think Tiger's got 10-plus years to play top-quality tournament golf, Nicklaus remarked in May."}, {"url": "http://www.sbnation.com/golf/2015/1/15/7547703/tiger-woods-majors-record-jack-nicklaus", "passage_text": "Rory McIlroy is now shorter odds than Tiger Woods to break Jack Nicklaus' record of 18 Majors. Rory is 6/1 and Tiger is 8/1."}]