[{"url": "http://www.hopkinsmedicine.org/healthlibrary/test_procedures/gynecology/colposcopy_92,P07770/", "passage_text": "Colposcopy is a procedure that uses an instrument with a magnifying lens and a light, called a colposcope, to examine the cervix (opening to the uterus) and vagina for abnormalities."}, {"url": "http://www.medicinenet.com/colposcopy/article.htm", "passage_text": "1 This procedure is often done to evaluate an abnormal appearing cervix or an abnormal Pap smear result. 2  Special tests are done during colposcopy, including acetic acid wash, use of color filters, and sampling (biopsy) of tissues."}, {"url": "http://www.nhs.uk/conditions/colposcopy/pages/introduction.aspx", "passage_text": "Introduction. A colposcopy is a procedure to find out whether there are abnormal cells on or in a woman's cervix or vagina. The cervix is the part of the womb that sits in the vagina. Abnormalities tend to occur at the opening of the cervix to the birth canal, where it enters the womb."}, {"url": "https://www.plannedparenthood.org/learn/womens-health/cryotherapy-leep/colposcopy", "passage_text": "A colposcopy is a way to get a close-up view of the cervix. It is used to detect abnormal cells on the cervix and the area near the cervix. During a colposcopy procedure, a health care provider uses a colposcope — an instrument that looks like binoculars with a bright light mounted on a stand."}, {"url": "http://www.medicinenet.com/colposcopy/article.htm", "passage_text": "1 Colposcopy is a procedure used by physicians that provides a magnified and illuminated view of the vulva, vaginal walls, and uterine cervix. 2  This procedure is often done to evaluate an abnormal appearing cervix or an abnormal Pap smear result."}, {"url": "http://www.mayoclinic.org/tests-procedures/colposcopy/basics/definition/PRC-20014027", "passage_text": "Colposcopy (kol-POS-kuh-pee) is a procedure to closely examine your cervix, vagina and vulva for signs of disease. During colposcopy, your doctor uses a special instrument called a colposcope. Your doctor may recommend colposcopy if your Pap test has shown abnormal results."}, {"url": "http://www.whscarlisle.com/services-colposcopy.php", "passage_text": "Colposcopy. A colposcopy is a special way of looking at the cervix. It uses a light and a low-powered microscope to make the cervix appear much larger. This helps your health care provider find and then biopsy abnormal areas on your cervix."}, {"url": "http://www.webmd.com/cancer/cervical-cancer/colposcopy-and-cervical-biopsy", "passage_text": "Colposcopy is done to: 1  Look at the cervix for problem areas when a Pap test was abnormal. 2  If an area of abnormal tissue is found during colposcopy, a cervical biopsy or a biopsy from inside the opening of the cervix (endocervical canal) is usually done."}]