[{"url": "http://drivelineretail.com/contact.htx", "passage_text": "Contact Us-We're Here To Help. At Driveline, we work hard to provide a high level of service and support to all our customers. This includes support for both current and future retail clients as well as our mission critical Driveline Field Team. Our friendly customer service representatives are committed to answering your questions and meeting your needs."}, {"url": "http://www.4xshaft.com/driveline101.asp", "passage_text": "Driveline Geometry 101. O.K. so now you've done it. You put that lift in your vehicle or changed the engine, transmission or transfer case or differential maybe all of the above and now your go anywhere four wheel drive baby rides like a out of balance washing machine. Or now that you've got all that raw power & torque you keep breaking your drive shaft."}, {"url": "http://ask.cars.com/2013/01/is-driveline-another-name-for-drive-shaft.html", "passage_text": "Nitin, Labasa, Fiji. The driveline is basically all of the components that deliver power to the wheels except for the engine and transmission (which are part of the drivetrain or powertrain, along with the driveline). "}, {"url": "http://www.4xshaft.com/driveline101.asp", "passage_text": "Tail Shaft Conversion Kits Driveline Geometry 101 O.K. so now you've done it. You put that lift in your vehicle or changed the engine, transmission or transfer case or differential maybe all of the above and now your go anywhere four wheel drive baby rides like a out of balance washing machine. Or now that you've got all that raw power & torque you keep breaking your drive shaft."}, {"url": "https://answers.yahoo.com/question/index?qid=20070604160111AAqwk6D", "passage_text": "Best Answer: Scheduled services for driveline components are basically fluid service for the transmission (manual or automatic), differential (final drive) and transfer case on 4x4s; lubrication of U-joints and slipjoints; and inspection and lubrication of front-drive CV joints and boots. Source(s): the drive line is everything that makes your car move-includes your engine and transmission when they look at your car there looking at the axles,CV boots and bearing's things like that depends on the car and if its like a 4-wheel drive they may look at the transfer case which makes all four tires turn at once."}, {"url": "https://en.wikipedia.org/wiki/Driveline_windup", "passage_text": "Mechanical components in the drivetrain of vehicles may bind and wear, which may occur when tires of varying sizes are used on one vehicle. It is a particular issue in 4WD cars with tires having varied tread patterns or brands. Driveline windup is also known as axle binding or driveline binding."}, {"url": "http://www.drivelineretail.com/", "passage_text": "Driveline provides the widest range of instore as well as value add services available. Truly a one stop shop for your initiatives to remove the headaches of dealing with multiple providers during project planning and execution. Our team of 13,000+ field associates is comprised of experienced personnel committed to executing your plan and understand the impact of this execution on your bottom line. Driveline only employs W-2 personnel-NO 1099 CONTRACTORS."}, {"url": "http://www.indeed.com/cmp/Driveline-Retail-Merchandising", "passage_text": "The best part of the job is definitely the flexibility, most of your assigned jobs can be scheduled for any time within a 2 week period. The hours are ok, but you never know what your paycheck will look like in 2 months. You may have a 40 hour week or you may have a 4 hour week, it just depends on what the company has been hired to do. The hardest part and also the easiest part of the job is definitely dealing with store managers. "}, {"url": "http://www.gkn.com/driveline", "passage_text": "GKN Driveline’s countertrack TM Technology can improve the efficiency of a car's driveline by up to 1%, which means savings in fuel and reduced CO2 emissions. More than just a drop in the ocean! GKN Driveline, the global leader in automotive driveline technology, has appointed Adam Touhig as President of its operations in Japan."}, {"url": "http://www.drivelineretail.com/", "passage_text": "OUR SERVICES. Driveline provides our clients with the broadest, most cost effective retail execution programs available. Our experience coupled with large scale of experienced personnel assures that your retail initiatives are executed nationwide quickly and accurately. Our team of 13,000+ field associates is comprised of experienced personnel committed to executing your plan and understand the impact of this execution on your bottom line. Driveline only employs W-2 personnel-NO 1099 CONTRACTORS."}]