[{"url": "http://www.mdguidelines.com/internal-derangement-of-knee", "passage_text": "Internal derangement is an old term that describes internal damage to the joint generally caused by trauma. It is a nonspecific term that usually must be further refined by history, physical exam, x-rays, and frequently MRI studies. The knee joint is the largest of weight bearing joint in the body. The knee has four major ligaments and each is vulnerable to injury: the anterior cruciate ligament (ACL), the medial collateral ligament (MCL) the posterior cruciate ligament (PCL) and the lateral collateral ligament (LCL). Each ligament restricts certain abnormal movement of the knee."}, {"url": "http://www.veterans.gc.ca/eng/services/after-injury/disability-benefits/benefits-determined/entitlement-eligibility-guidelines/internald", "passage_text": ", is a chronic disorder of the knee due to a torn, ruptured or deranged meniscus of the knee, or a partial or complete cruciate rupture, with or without injury to the capsular ligament of the knee, resulting in ongoing or intermittent signs and symptoms such as pain, instability, or abnormal mobility of that knee. Anatomy and Physiology. Internal derangement of the knee is a mechanical disorder of the knee which interferes with normal joint motion and/or mobility. A fragment of soft tissue or bone that suddenly becomes interposed between the articular surfaces is the classic cause of internal derangement."}, {"url": "https://ca.answers.yahoo.com/question/index?qid=20110316114527AAgoZj8", "passage_text": "Answers. Best Answer: Melissa, an internal derangement of the knee simply means that something internal is not working correctly. An ultrasound is limited in its capacity to see all of the structures within the knee. So a recommendation was made of an MRI. This will show you all of the internal structures of the knee. This Site Might Help You. RE: What is internal derangement in a knee? So I am a 16 year old female dancer and about a month and a half ago I really hurt my knee. I went to a walk in clinic and they sent me to get an ultra sound. This is what they said in the review..."}, {"url": "http://www.icd9data.com/2012/Volume1/710-739/710-719/717/717.9.htm", "passage_text": "Unspecified internal derangement of knee. 1  Short description: Int derangement knee NOS. 2  ICD-9-CM 717.9 is a billable medical code that can be used to indicate a diagnosis on a reimbursement claim, however, 717.9 should only be used for claims with a date of service on or before September 30, 2015. "}, {"url": "http://www.mdguidelines.com/internal-derangement-of-knee", "passage_text": "Internal derangement of the knee describes a variety of conditions with varying severity. Prognosis will depend on the nature and severity of the condition, available treatments, and the health status, age, and activity requirements of the patient. The knee has four major ligaments and each is vulnerable to injury: the anterior cruciate ligament (ACL), the medial collateral ligament (MCL) the posterior cruciate ligament (PCL) and the lateral collateral ligament (LCL). Each ligament restricts certain abnormal movement of the knee."}, {"url": "http://www.mdguidelines.com/internal-derangement-of-knee", "passage_text": "Internal derangement of the knee may involve injury to muscle, ligament, tendon, meniscus, or bone. Rehabilitation will depend on the nature of the underlying pathology, the extent of injury, type of treatment (i.e., surgical, nonsurgical), and the functional goals of the individual. The knee has four major ligaments and each is vulnerable to injury: the anterior cruciate ligament (ACL), the medial collateral ligament (MCL) the posterior cruciate ligament (PCL) and the lateral collateral ligament (LCL). Each ligament restricts certain abnormal movement of the knee."}, {"url": "http://www.dynasplint.com/glossary/term/internal-derangement-of-the-joint/", "passage_text": "Internal Derangement of the Joint. A general term describing a mechanical derangement of a joint structure (knee, elbow, shoulder). This is a term often used when the examiner doesn’t quite know the exact diagnoses but can determine something is functionally incorrect."}, {"url": "http://www.findacode.com/icd-9/717-9-unspecified-internal-derangement-knee-icd-9-code.html", "passage_text": "717.9 - Unspecified internal derangement of knee The above description is abbreviated. This code description may also have Includes, Excludes, Notes, Guidelines, Examples and other information.Click here to Sign In to your account.Click here to View Pricing now. The above description is abbreviated. "}]