[{"url": "http://rf.harris.com/media/Radio%20Comms%20in%20the%20Digital%20Age%20-%201_tcm26-12947.pdf", "passage_text": "A wavelength at 20 kHz is 15 kilometerslong. At 30,000 MHz, the wavelength is only 1 centimeter.The HF band is defined as the frequency range of 3 to 30 MHz. In prac-tice, most HF radios use the spectrum from 1.6"}, {"url": "http://rf.harris.com/media/Radio%20Comms%20in%20the%20Digital%20Age%20-%202_tcm26-12948.pdf", "passage_text": "The Radio Frequency Spectrum In the radio frequency spectrum (Figure 1-2), the usable frequency range forradio waves extends from about 20 kHz (just above sound waves) to above30,000 MHz. A wavelength at 20 kHz is 15 kilometers long. At 30,000 MHz,the wavelength is only 1 centimeter. The High Frequency (HF) Band The HF band is defined as the frequency range of 3 to 30 MHz. In practice,most HF radios use the spectrum from 1.6 to 30 MHz. Most long-haulcommunications in this band take place between 4 and 18 MHz."}, {"url": "http://www.arrl.org/vhf-and-uhf", "passage_text": "Antennas for the VHF and UHF bands are similar in many ways to HF antennas. The main differences are that VHF/UHF antennas are smaller and the losses caused by poor feed lines and elevated SWRs (or both) are more critical."}, {"url": "http://www.qsl.net/ah6rh/am-radio/getting-started/first-station.html", "passage_text": "It gives you flexibility to use both VHF and UHF. For those radios with a third band, whether it's 50 MHz, 222 MHz or 1.2 GHz, it's rarely used, unless you know someone specifically that's operating on those frequencies. When you consider buying the radio, find out what kind of antenna connector is on the radio."}, {"url": "http://www.amazon.com/s?ie=UTF8&page=1&rh=n%3A172282%2Ck%3Auhf%20vhf%20antenna", "passage_text": "Tram 1180 Amateur Dual-Band NMO 38 inch Antenna VHF 114-148 & UHF 430-450 MHz for Mobile Radios. by tram-browning. $29.99 Prime."}, {"url": "http://www.eham.net/newham/firstradio", "passage_text": "I did enjoy making a six meter antenna to use the 1 watt carrier AM mode on the Yaesu VX-7R, and with the same radio, making a small 222 MHz yagi to get the most out of its 300 mw maximum output on that band."}, {"url": "http://www.arrl.org/vhf-and-uhf", "passage_text": "This type of VHF antenna transmits and receives in all directions at once (the same is true of the dipoles, loops and vertical antennas for HF use). All commonly used mobile antennas are omnidirectional."}]