[{"url": "http://www.lobels.com/recipe/perfectsteak.aspx", "passage_text": "1 Steaks should always be at room temperature before they are cooked. 2  Remove your steaks from the refrigerator at least 30 minutes before cooking. 3  Pat them dry with a paper towel. 4  Preheat grill to maximum temperature."}, {"url": "http://www.bhg.com/recipes/beef/steak/cook-steak-in-oven/", "passage_text": "-- Place the steaks on the unheated rack of the broiler pan. -- For 1-inch steaks cooked to medium doneness, broil the steaks for about 15 minutes, turning once halfway through cooking time. Allow less time for rare steaks and more time for well-done steaks."}, {"url": "https://www.heb.com/recipe/recipe-article/grill-times-temperatures-for-steak/1392677044707", "passage_text": "Check Internal Temperature. Remove steaks from the grill when a quick-response meat thermometer inserted through the side of the steak to its center reads the desired temperature below. To retain juices and reach final temperature, let steaks sit for 2 minutes before cutting."}, {"url": "http://www.food.com/recipe/grilled-flat-iron-steak-307631", "passage_text": "1 Remove meat from the marinade and discard marinade. 2  Place steak on heated grill, cook about 5 minutes. 3  You can rotate the steak about 45 degrees to create grill cross-hatch marks. 4  Turn the steak over and move to a slightly cooler part of the grill and continue grilling about 4 minutes."}, {"url": "http://www.ehow.com/how_4486012_determine-cooking-time-steak.html", "passage_text": "Take a look at how thick your steaks are. The thickness is one of the deciding factors of cooking time. Common measurements are 3/4 inch, one inch, one and a half inch and two inches thick. Grill thicker steaks on a lower temperature; the thicker the steak, the lower the heat you'll use."}, {"url": "http://www.foodnetwork.com/recipes/bobby-flay/perfectly-grilled-steak-recipe.html/", "passage_text": "About 20 minutes before grilling, remove the steaks from the refrigerator and let sit, covered, at room temperature. Heat your grill to high. Brush the steaks on both sides with oil and season liberally with salt and pepper. Place the steaks on the grill and cook until golden brown and slightly charred, 4 to 5 minutes."}, {"url": "http://www.foodnetwork.com/recipes/bobby-flay/perfectly-grilled-steak-recipe.html/", "passage_text": "Turn the steaks over and continue to grill 3 to 5 minutes for medium-rare (an internal temperature of 135 degrees F), 5 to 7 minutes for medium (140 degrees F) or 8 to 10 minutes for medium-well (150 degrees F)."}]