[{"url": "http://hepc.liverfoundation.org/diagnosis/how-hep-c-is-spread/", "passage_text": "Hepatitis C is transmitted or spread when the blood from a Hepatitis C-infected person enters the bloodstream of someone who is not infected. Today, most people become infected with HCV by sharing needles or other equipment to inject drugs. "}, {"url": "http://www.cdc.gov/hepatitis/hcv/cfaq.htm", "passage_text": "Chronic Hepatitis C is a serious disease that can result in long-term health problems, including liver damage, liver failure, liver cancer, or even death. It is the leading cause of cirrhosis and liver cancer and the most common reason for liver transplantation in the United States. “Hepatitis” means inflammation of the liver. Toxins, certain drugs, some diseases, heavy alcohol use, and bacterial and viral infections can all cause hepatitis. Hepatitis is also the name of a family of viral infections that affect the liver; the most common types are Hepatitis A, Hepatitis B, and Hepatitis C."}, {"url": "http://www.medicinenet.com/hepatitis_c/article.htm", "passage_text": "1 Hepatitis C is one of several viruses that cause hepatitis (inflammation of the liver). 2  Up to 85% of individuals who are initially (acutely) infected with hep C will fail to eliminate the virus and will become chronically infected. 3  Hepatitis C is spread most commonly through inadvertent exposure to infected blood. 1 Hepatitis C is diagnosed by determining levels in the blood of antibodies to the virus and then confirming the infection with other tests for viral RNA. 2  The amount of viral RNA in the blood (viral load) does not correlate with the severity of the disease but can be used to track the response to treatment."}, {"url": "http://www.ncbi.nlm.nih.gov/pubmedhealth/PMH0001329/", "passage_text": "Hepatitis C virus can cause damage to the liver usually in an insidious manner (chronic hepatitis C infection). Sometimes, the liver damage can be so severe that the liver is not able to carry out the normal functions, resulting in liver failure. Infectious liver disease caused by the hepatitis C virus for which there is no vaccine and which commonly becomes chronic. Now the most common cause of cirrhosis in the United States. PubMed Health Glossary. (Source: NIH-National Institute of Diabetes and Digestive and Kidney Diseases and National Library of Medicine)."}, {"url": "https://en.wikipedia.org/wiki/Hepatitis_C", "passage_text": "It is one of five known hepatitis viruses: A, B, C, D, and E. The virus persists in the liver in about 85% of those infected. This chronic infection can be treated with medication: the standard therapy is a combination of peginterferon and ribavirin, with either boceprevir or telaprevir added in some cases. "}, {"url": "http://www.ncbi.nlm.nih.gov/pubmedhealth/PMH0001329/", "passage_text": "About Hepatitis C Infection. Hepatitis C is a disease caused by a virus that infects your liver. Your liver is an important organ in your body and has many functions. The liver removes harmful chemicals from your body, aids digestion, and processes vitamins and nutrients from food. Infectious liver disease caused by the hepatitis C virus for which there is no vaccine and which commonly becomes chronic. Now the most common cause of cirrhosis in the United States. PubMed Health Glossary. (Source: NIH-National Institute of Diabetes and Digestive and Kidney Diseases and National Library of Medicine)."}, {"url": "http://hepc.liverfoundation.org/what-is-hepatitis-c/", "passage_text": "Hepatitis C is a disease caused by a virus that infects the liver. The virus, called the Hepatitis C virus or HCV for short, is just one of the hepatitis viruses. The other common hepatitis viruses are A and B, which differ somewhat from HCV in the way they are spread and treated."}, {"url": "http://www.cdc.gov/hepatitis/HCV/PDFs/HepCGeneralFactSheet.pdf", "passage_text": "In the United States, the most common types of viral hepatitis are Hepatitis A, Hepatitis B, and Hepatitis C. Most people who get infected with the Hepatitis C virus develop a chronic, or lifelong, infection. What is Hepatitis C? Hepatitis C is an infection of the liver that results from the Hepatitis C virus. Acute Hepatitis C refers to the first several months after someone is infected. Acute infection can range in severity from a very mild illness with few or no symptoms to a serious condition requiring hospitalization. tested. Doctors use a blood test, called a Hepatitis C Antibody Test, which looks for antibodies to the Hepatitis C virus. Antibodies are chemicals released into the bloodstream when someone gets infected. Antibodies remain in the bloodstream, even if the person clears the virus."}, {"url": "http://www.cdc.gov/hepatitis/hcv/cfaq.htm", "passage_text": "Chronic Hepatitis C virus infection is a long-term illness that occurs when the Hepatitis C virus remains in a person’s body. Hepatitis C virus infection can last a lifetime and lead to serious liver problems, including cirrhosis (scarring of the liver) or liver cancer. “Hepatitis” means inflammation of the liver. Toxins, certain drugs, some diseases, heavy alcohol use, and bacterial and viral infections can all cause hepatitis. Hepatitis is also the name of a family of viral infections that affect the liver; the most common types are Hepatitis A, Hepatitis B, and Hepatitis C."}, {"url": "http://www.emedicinehealth.com/hepatitis_c/article_em.htm", "passage_text": "This inflammation can be caused by contagious diseases such as viral infections. Hepatitis can also be caused by exposure to alcohol, certain medications, chemicals, poisons, and other toxins, or by other diseases. hepatitis C (HCV) is one of the many viruses that can cause inflammation of the liver. Inflammation of the liver caused by infection with HCV is referred to as hepatitis C. 1  If the infection does not resolve, it becomes chronic (ongoing, long term) and can cause chronic liver disease, which can be serious or even fatal"}]