[{"url": "http://www.domorewithoxygen.com/bid/340083/Do-Portable-Oxygen-Concentrators-Require-a-Prescription", "passage_text": "Your doctor will probably write out your prescription on a printed pad, order form or office letterhead. In order to be valid, your prescription should include the following: 1  Specifics regarding the duration of oxygen use and flow. 2  Defined delivery device, often a nasal cannula or oxygen mask."}, {"url": "http://www.justanswer.com/health/27ulm-prescription-oxygen.html", "passage_text": "You just said he was clueless. He needs to write the prescription for Oxygen, the amount of liters per minute, by what type of delivery device (nasal cannula, mask,), how often it is to be used, and what type of oxygen system (concentrator, compressed gas by tank, or liquid oxygen)."}, {"url": "http://www.oxygenconcentratorstore.com/blog/customer-questions-why-do-i-need-a-prescription-to-buy-an-oxygen-concentrator/", "passage_text": "There are several important factors that go into a prescription for oxygen use. Which oxygen concentrator you purchase is also largely determined by your prescription, and your prescription and needs are individual to you."}, {"url": "http://www.curezone.org/forums/am.asp?i=1696203", "passage_text": "You can use either an Oxygen concentrator or a Oxygen tank for Ozone depending on what type of therapy you want to do. Oxygen has to be use with Ozone if you have a medical Ozone generator."}, {"url": "http://www.justanswer.com/health/27ulm-prescription-oxygen.html", "passage_text": "I had asked my neurologist for a prescription for oxygen and he was clueless. I have ongoing, serious migraine, cluster headaches and recently horrible headaches in the middle of the night/morning."}, {"url": "http://aspenoxygen.com/faq.php?cID=1", "passage_text": "1 Recreational oxygen does not require a prescription or a license, and it is safe and affordable to use. 2  Recreational oxygen is not intended to treat, cure or diagnose any medical condition. 3  If you have a condition related to or affected by the use of oxygen, you should consult with your doctor prior to use of oxygen."}, {"url": "http://www.justanswer.com/health/27ulm-prescription-oxygen.html", "passage_text": "Customer Question. I had asked my neurologist for a prescription for oxygen and he was clueless. I have ongoing, serious migraine, cluster headaches and recently horrible headaches in the middle of the night/morning. Submitted: 6 years ago via HealthBoards."}, {"url": "http://www.oxygenconcentratorstore.com/blog/customer-questions-why-do-i-need-a-prescription-to-buy-an-oxygen-concentrator/", "passage_text": "To purchase an oxygen concentrator from our store, you do need a prescription from your doctor, stating specifically what you need."}, {"url": "http://www.oxygenconcentratorstore.com/blog/customer-questions-why-do-i-need-a-prescription-to-buy-an-oxygen-concentrator/", "passage_text": "Supplemental oxygen is classified as a prescription medication in the United States, since using oxygen that you don't need, or in too high of a dose, or too low of a dose, can be detrimental to your health and even cause damage to lung tissue."}]