[{"url": "http://explorehealthcareers.org/en/Career/141/Perfusionist", "passage_text": "A perfusionist operates a heart-lung machine, which is an artificial blood pump, which propels oxygenated blood to the patient’s tissues while the surgeon operates on the heart. The perfusionist manages the physiological and metabolic demands of the patient while the cardiac surgeon operates on the heart. It is also the perfusionist’s responsibility to deliver the drug that stops the heart."}, {"url": "http://www.webmd.com/heart-disease/cardiac-perfusion-scan", "passage_text": "Cardiac Perfusion Scan. Guide. A cardiac perfusion scan measures the amount of blood in your heart muscle at rest and during exercise. It is often done to find out what may be causing symptoms like angina (such as chest pain or pressure). Why It Is Done. A cardiac perfusion scan is done to: 1  Find the cause of unexplained chest pain or pressure. 2  Find the cause of chest pain or pressure brought on by exercise. 3  Check for the location and amount of damage caused by a heart attack. 4  Identify coronary artery disease (CAD) ."}, {"url": "http://www.hopkinsmedicine.org/healthlibrary/test_procedures/cardiovascular/myocardial_perfusion_scan_stress_92,P07979/", "passage_text": "Myocardial perfusion scan with exercise. A myocardial perfusion scan with exercise is used to determine what areas of the heart muscle (myocardium) demonstrate decreased blood flow during exercise. This is done by injecting a radionuclide (thallium or technetium) into a vein in the arm or hand during exercise. There are two types of stress myocardial perfusion scans, one that is used in conjunction with exercise (myocardial perfusion scan with exercise) and one that is used in conjunction with medication (pharmacologic myocardial perfusion scan)."}, {"url": "http://www.youtube.com/watch?v=QDesZ4Grb_E", "passage_text": "Cynthia Cervantes, Director of the Barry University Cardiovascular Perfusion program, explains CVP and what it takes to be a perfusionist. For more information about a degree in Cardiovascular Perfusion at Barry University, please visit http://www.barry.edu/cvp. "}, {"url": "http://www.perfusion.com/cgi-bin/absolutenm/templates/articledisplay.asp?articleid=1550", "passage_text": "Wednesday, September 01, 2004 - Perfusion.com Inc. A perfusionist is a skilled, allied health professional, trained and educated specifically as a member of an open-heart, surgical team responsible for the selection, setup, and operation of a mechanical device commonly referred to as the heart-lung machine."}, {"url": "http://michener.ca/program/cardiovascular-perfusion/", "passage_text": "Cardiovascular perfusion is a profession primarily focused on supporting the normal functions of the heart and lungs during open-heart surgery. This allows the heart to be stopped to facilitate cardiac surgery. "}, {"url": "https://en.wikipedia.org/wiki/Perfusionist", "passage_text": "A perfusionist, also known as a clinical perfusionist or a cardiovascular perfusionist, is a specialized healthcare professional who uses the heart-lung machine during cardiac surgery and other surgeries that require cardiopulmonary bypass to manage the patient's physiological status. The perfusionist is responsible for the management of circulatory and respiratory functions of the patient which has a great effect on the patient systemic condition and allows the cardiac surgeon to focus on the actual surgical procedure and less on the immediate needs of the patient."}, {"url": "http://www.hopkinsmedicine.org/healthlibrary/test_procedures/cardiovascular/myocardial_perfusion_scan_stress_92,P07979/", "passage_text": "A stress myocardial perfusion scan is used to assess the blood flow to the heart muscle (myocardium) when it is stressed by exercise or medication and to determine what areas of the myocardium have decreased blood flow. There are two types of stress myocardial perfusion scans, one that is used in conjunction with exercise (myocardial perfusion scan with exercise) and one that is used in conjunction with medication (pharmacologic myocardial perfusion scan)."}, {"url": "http://www.wisegeekhealth.com/what-is-perfusion.htm", "passage_text": "Perfusion refers to the flow of blood through the veins and arteries of the body. Poor perfusion may cause organ failure. Perfusion is a common cause of amputation after an injury. In perfusion, blood moves from the heart, through a network of arteries and into the smallest blood vessels in the body. View slideshow of images above. "}, {"url": "http://www.webmd.com/heart-disease/cardiac-perfusion-scan", "passage_text": "A cardiac perfusion scan is done to: 1  Find the cause of unexplained chest pain or pressure. 2  Find the cause of chest pain or pressure brought on by exercise. 3  Check for the location and amount of damage caused by a heart attack. Why It Is Done. A cardiac perfusion scan is done to: 1  Find the cause of unexplained chest pain or pressure. 2  Find the cause of chest pain or pressure brought on by exercise. 3  Check for the location and amount of damage caused by a heart attack. 4  Identify coronary artery disease (CAD) ."}]