[{"url": "http://www.youtube.com/watch?v=WNLP1PHJXu8", "passage_text": "Spartan Blue Laser is from http://www.dragonlasers.com. With 1 watt of power, the blue Spartan laser point is the most powerful pocket sized laser pointer on the market. The nearest rival only has average power levels in the range of 800-900mW. This video demonstrates how much moer powerful the Spartan blue laser is over it's nearest rival, the Artic blue laser."}, {"url": "http://laserpointersafety.com/news/news/other-news_files/461ae1d859ee748f4c9215184ecd1fdc-181.php", "passage_text": "Worldwide: Laser pointers reach 2000 milliwatts (2 watts). Jun 24 2011 -- Filed in: Easy availability | Unusual lasers & uses. An online laser seller has announced a number of 2000 milliwatt (2 watt) laser pointers. This is a new high power for handheld lasers intended to be sold to consumers. And the end-user price of under USD $200 is remarkably low. Only a few years ago, a small portable 2 W laser would have cost thousands of dollars."}, {"url": "http://hypertextbook.com/facts/2003/AmyLy.shtml", "passage_text": "The green light is more damaging to the eye because it has a wavelength of 533 nm and a high frequency of 1064 nm. The red light has a weaker effect coming in 670 nm, 650 nm, and 635 nm. The frequency of the red light is lower. The power of laser points vary from 1-5 mW."}, {"url": "http://laserpointersafety.com/news/news/other-news_files/461ae1d859ee748f4c9215184ecd1fdc-181.php", "passage_text": "1 The U.S. limit for a laser to be sold as a pointer is 5 mW (0.005 watt). 2  The new lasers are 400 times more powerful than a “legal” laser pointer. 3  The infamous Wicked Laser Spyder III Arctic is nominally a 1000 mW laser (1 watt)."}, {"url": "http://www.wickedlasers.com/arctic", "passage_text": "Between lasers of equal output power (in mW), lasers closest to the peak visibility wavelength of 555nm will have more range and brightness than other wavelengths of laser light. Green lasers (532nm) are closest to the peak visibility wavelength (555nm), and therefore brighter than red, blue, and purple lasers. A laser's wavelength and power are two of the most important factors in choosing a laser."}]