[{"url": "http://www.regannursery.com/index.cfm/fuseaction/home.showpage/pageID/30/", "passage_text": "Finding the type of rose that's right for your garden. The wide variety and types of roses we offer can be a bit overwhelming. Here is a quick introduction to the various types of roses available. Regan Nursery carries more than 1000 types of Grade 1 roses. Here are the different types of roses we offer."}, {"url": "http://www.rose-gardening-made-easy.com/rose-types.html", "passage_text": "Fortunately all types of roses are divided into class types, that will help you narrow down your rose choices. Understanding these various types of roses is a good place to start your rose selection. Such as the mature plant size, frequency of bloom, fragrance etc. You'll want to familiarize youself with all the different rose types, so you can aquire the type of rose that meets your garden's need, and your own taste and desire."}, {"url": "http://www.rose-gardening-made-easy.com/different-types-of-roses.html", "passage_text": "With many thousands of different types of roses available, It can be confusing and difficult to find the right rose for your garden. But no matter what type of roses you would like to buy, be sure it's the type that fit your garden situation and climate zone. So it's very convenient that information on different rose types, and roses of all different types, are being grouped in various ways with names of roses and rose types."}, {"url": "http://hedgerowrose.com/types-of-roses/", "passage_text": "Modern Roses are a broad mix which include the following types: Climbing, Floribunda, Grandiflora, Hybrid Musk, Hybrid Rugosa, Hybrid Tea, Landscape (including Groundcover) or Shrub, Miniature, Mini-flora and Polyantha. The American Rose Society currently recognizes 37 classes of roses."}, {"url": "http://www.rose-gardening-made-easy.com/different-types-of-roses.html", "passage_text": "These are the different types of roses that are very old. The main groups of old garden roses, heirloom old garden roses, heritage bushes of roses, whatever you choose to call these antique old roses from the past, include the following rose types."}, {"url": "http://www.rose-gardening-made-easy.com/different-types-of-roses.html", "passage_text": "Roses are prized for their for their lovely, often fragrant flowers. Many rose types carry their blossoms in clusters, but some, notably hybrid teas tend to bear their flowers singly, one bud per stem. Below are the three major groups of the different types of rose plants."}]