[{"url": "https://support.microsoft.com/en-us/kb/811528", "passage_text": "For example, if you type filename or filename.txt at a command prompt, Filename.txt may run as a program instead of being opened in Notepad. This may also occur if the file is called as a command line in a batch (.bat) file or in a Windows NT command script (.cmd) file. WORKAROUND. Open the file by using Windows Explorer, or use the following command line to open the file in the appropriate program: For example, to open Filename.txt in Notepad, use the following command line: program filename.ext. notepad filename.txt"}, {"url": "http://www.c3scripts.com/tutorials/msdos/open-window.html", "passage_text": "Run cmd.exe or command.exe To open a Microsoft MS-DOS command prompt shell window, first click the Windows Start menu (located at the very lower-left corner of your computer's desktop) and select Run.... Then if you are using Windows XP or Vista or Windows 7, type cmd into the Run box and click OK. To open a Microsoft MS-DOS command prompt shell window, first click the Windows Start menu (located at the very. corner of your computer's desktop) and select Run.... Then if you are using Windows XP or Vista or Windows 7, type cmd into the Run box and click OK. You could also type cmd.exe."}, {"url": "https://support.microsoft.com/en-us/kb/811528", "passage_text": "When you type a file name at a command prompt, or you use a file name as a command line in a batch file or Windows NT command script, Cmd.exe calls the CreateProcess function to open the file. The CreateProcess function examines the file's contents. WORKAROUND. Open the file by using Windows Explorer, or use the following command line to open the file in the appropriate program: For example, to open Filename.txt in Notepad, use the following command line: program filename.ext. notepad filename.txt"}, {"url": "http://www.computerhope.com/issues/chusedos.htm", "passage_text": "Open a Windows command line window by following the steps below. If you need additional information or alternative methods for all versions of Windows, see our how to get into DOS and Windows command line page. 1  Click Start. 2  In the Search or Run line type cmd and press enter. After the file has been moved into the dir2 directory, move into that directory with the cd command to rename the file. In the dir2 directory use the rename command to rename the example file into an alternate name. Type rename example.bat first.bat at the prompt to rename the file to first.bat."}, {"url": "http://answers.microsoft.com/en-us/windows/forum/windows_8-files/how-do-i-open-a-program-via-command-prompt-in/72df34ea-236d-403c-a96c-2db42a06486a", "passage_text": "Hi AhmadulHoq, You want to open a program using command prompt. I will help you with this issue. You need to type the exact location of the file location and then the program will launch. When you are in cmd, you need to get to the C root directory and then type the location of the file. Once you have reached the file location, type the exact file name."}, {"url": "http://www.wikihow.com/Run-a-Program-on-Command-Prompt", "passage_text": "2. In the Command Prompt window, type start explorer. This opens the Windows File Explorer. 3. Go to the Program Files folder, and then open the Internet Explorer folder. 1  You can use any other software program folder, too. Open the program properties. Find the program file ending in .exe that you'd like open with Command Prompt. Right-click the program file, and then click Properties. 4. In the Properties window, next to Location, write down the full file path."}, {"url": "http://www.c3scripts.com/tutorials/msdos/open-window.html", "passage_text": "Step 1. Run cmd.exe or command.exe. To open a Microsoft MS-DOS command prompt shell window, first click the Windows Start menu (located at the very. corner of your computer's desktop) and select Run.... Then if you are using Windows XP or Vista or Windows 7, type cmd into the Run box and click OK. You could also type cmd.exe."}, {"url": "http://www.bleepingcomputer.com/tutorials/windows-command-prompt-introduction/", "passage_text": "The Exit command-This command will close the command prompt. Simply type exit and press enter and the command prompt will close. The CD command-This command allows you to change your current directory or see what directory you are currently in. To use the CD command you would type cd directoryname and press enter. To start a Command Prompt you simply need to type cmd.exe in the search field in the Start menu or click on Start, then Accessories, and then click on the Command Prompt icon. A window will appear, called the Command Prompt, that will open in your user profile ..."}, {"url": "http://www.c3scripts.com/tutorials/msdos/open-window.html", "passage_text": "Overview: Run cmd.exe or command.exe. To open a Microsoft MS-DOS command prompt shell window, first click the Windows Start menu (located at the very. corner of your computer's desktop) and select Run.... Then if you are using Windows XP or Vista or Windows 7, type cmd into the Run box and click OK. You could also type cmd.exe."}]