[{"url": "http://www.costofwedding.com/", "passage_text": "Average Wedding Cost. The average wedding cost in the United States is $26,444. Couples typically spend between $19,833 and $33,055 but, most couples spend less than $10,000. This does not include cost for a honeymoon. Understanding wedding cost now can help you with your wedding budget later"}, {"url": "http://www.askmen.com/money/investing_300/348_the-new-rules-of-the-engagement-ring.html", "passage_text": "Well, we’re here to tell you that it doesn’t have to be that way. There’s a new set of rules that apply when looking for that all-important ring. The traditional rule of thumb was that the groom should plan to spend anywhere from one to three month’s salary on the engagement ring. But as priorities shift, that rule has fallen out of favor. "}, {"url": "https://www.theknot.com/content/engagement-ring-insurance-101", "passage_text": "Average Cost: The yearly cost to insure your ring is $1 to $2 for every $100 that it would cost to replace. In plain English, this means that if your ring would cost $9,000 to replace, you might expect to pay between $90 and $180 per year to insure it—or slightly more in cities where the risk of theft is higher. Who Needs Ring Insurance Most: Any couple with jewelry that has pricey material or sentimental value. Whether your wedding and engagement rings cost $500 or $50,000, an insurance policy is a way of honoring not just their financial value but what they represent."}, {"url": "http://www.weddingstats.org/average-cost-of-a-wedding-ring.html", "passage_text": "The center stone constitutes the most expensive part of a classic solitaire ring, accounting for as much as 85 percent of its price. $6113(includes bride's ring and band). In 2015, the average cost of a wedding ring is between $5968-$6258. This includes both the engagement ring and traditional wedding band. $468 (for the groom). In 2013, the average cost of a groom's wedding ring is between $389-$547. "}, {"url": "https://www.theknot.com/content/average-wedding-cost-2014", "passage_text": "It's called The Knot Real Weddings Study, and we have to be honest, our findings are eye-opening. For starters, the national average cost of a wedding is at an all-time high since we started the survey in 2008. National wedding budgets on average are at $29,858. "}, {"url": "http://www.usatoday.com/story/money/personalfinance/2014/06/14/buying-an-engagement-ring/10358507/", "passage_text": "That could be one reason the national average spent on an engagement ring, as well as diamond carat size, or weight, have been rising. The average spent on an engagement ring grew 3% to $5,598 last year from a year earlier, according to TheKnot. That's still down from 2009's average of $5,861, however. "}, {"url": "http://www.womenshealthmag.com/sex-and-love/engagement-ring-cost", "passage_text": "Your Privacy Rights. Putting a ring on it might be super romantic, but it's also seriously pricey. The average price tag for an engagement ring is $2,311, according to new data from American Express Spending & Savings Tracker. MORE: 9 Ways to Survive Engagement Season. "}, {"url": "https://answers.yahoo.com/question/index?qid=20061116084116AAhgMAB", "passage_text": "Engagement Rings costs $100, $1000, $10,000 or even as much as $100,000 on an engagement ring so that one is a tough one to answers. Source(s): Buy Engagement Rings Online http://www.amazon.com/Engagement-Rings/b... Jewelry Buying Guides http://www.amazon.com/Jewelry-Buying-Gui... . I want to buy my girlfriend an engagement ring that is nice and will make her friends ooh and aah but don't have unlimited funds. I know the 2 month salary rule..blah, blah, blah. I want to know the approximate dollar amount for an impressive-sized ring with good clarity that wont cost me arm and leg."}, {"url": "http://weddings.costhelper.com/engagement-ring.html", "passage_text": "Discounts: 1  Like all valuable jewelry, engagement rings should be insured. 2  With vintage or antique diamond rings, sizing might cost $20 to $50 extra. 3  For a custom-made engagement ring, expect to pay a design fee of at least $200. "}]