[{"url": "https://en.wikipedia.org/wiki/Fennel", "passage_text": "Florence fennel (Foeniculum vulgare Azoricum Group; syn. F. vulgare var. azoricum) is a cultivar group with inflated leaf bases which form a bulb-like structure. It is of cultivated origin, and has a mild anise-like flavor, but is sweeter and more aromatic. Florence fennel plants are smaller than the wild type. Fennel, Foeniculum vulgare, is a perennial herb. It is erect, glaucous green, and grows to heights of up to 2.5 m, with hollow stems. The leaves grow up to 40 cm long; they are finely dissected, with the ultimate segments filiform (threadlike), about 0.5 mm wide."}, {"url": "https://en.wikipedia.org/wiki/Fennel", "passage_text": "Florence fennel or finocchio is a selection with a swollen, bulb-like stem base that is used as a vegetable. Fennel is used as a food plant by the larvae of some Lepidoptera species including the mouse moth and the anise swallowtail. Fennel, Foeniculum vulgare, is a perennial herb. It is erect, glaucous green, and grows to heights of up to 2.5 m, with hollow stems. The leaves grow up to 40 cm long; they are finely dissected, with the ultimate segments filiform (threadlike), about 0.5 mm wide."}, {"url": "http://www.wikihow.com/Grow-Fennel", "passage_text": "1 Herb fennel does not produce the same bulbous stem. 2  It is grown for its delicate leaves, which are used as a herb. 3  Herb fennel also produces seeds which have a licorice-like flavor (as does the rest of the plant) and are used for seasoning. The type of fennel you choose to grow will depend on what part of the fennel plant you wish to use -- the bulb, the fronds or the seeds. 1  Florence Fennel is grown for its bulbous stem, which can be eaten raw, grilled or baked. 2 "}, {"url": "http://www.heirloom-organics.com/guide/va/guidetogrowingfennel.html", "passage_text": "Fennel is native to the Mediterranean region, but is now cultivated worldwide. It is an aromatic perennial that grows to about five feet in height, having dark green, feathery leaves, umbels of yellow flowers, and small, ridged, oval-shaped seeds, which are gathered in the autumn. Be careful to plant fennel away from other plants in the garden, because it will cross-pollinate, and the results of this is disappointing. Grow instead in pots away from the garden plot, or at the very least at the back of the garden."}, {"url": "http://www.gardeningblog.net/how-to-grow/fennel/", "passage_text": "Fennel is a multi-purpose plant for your garden that will provide you with aromatic seeds for seasoning as well as a thick bulb for a vegetable. You can even eat the thicker stalks, like celery. The fine leaves can be snipped off and also used as an herb. The seeds have a licorice-like flavor very similar to anise, as do the other parts of the plant (those not as strongly as the seeds). Fennel bulb is a popular ingredient in Mediterranean cuisine, and it can be eaten raw, grilled, or baked. "}, {"url": "http://www.reluctantgourmet.com/fennel-how-to-use-it/", "passage_text": "Fennel is a plant whose leaves look very much like dill thin, waving frondy filaments of bright green. Not only are the leaves edible, but so are the seeds, bulbs and even the pollen. If you have never tried fennel, let me see if I can describe the flavor to you. Fennel bulb, which looks kind of like a cross between an onion and the base of a bunch of celery, has a sweet, perfumy, anise-like flavor. Rather than making food taste like licorice, though, fennel imparts a light, bright spring-like quality to foods. Plus, fennel is good for you"}, {"url": "http://www.gardenersnet.com/herbs/fennel.htm", "passage_text": "With bright green, fern-like leaves and aromatic yellow flowers, this plant will grow three to four feet tall. Plant it in the back of the herb garden, or in your vegetable garden. The plant foliage and seeds have an anise-like flavor. Plant Propagation: Grow Fennel plants from seed. Directly sow Fennel seeds into your garden as early in the season as the ground can be worked. Sow seeds and cover with 1/4 of soil. Space seedlings or thin plants to 10-12 apart, in rows 18-24 inches apart. While classified as a herb, Fennel is a popular European vegetable. Native to Mediterranean region, the bulbous base and stalk of this plant, is popular eaten raw like celery, cooked, or boiled. Closely related to Parsley, Fennel is popular in Italian and other Mediterranean recipes."}, {"url": "https://en.wikipedia.org/wiki/Fennel", "passage_text": "Dried fennel seed is an aromatic, anise-flavored spice, brown or green in color when fresh, slowly turning a dull grey as the seed ages. For cooking, green seeds are optimal. The leaves are delicately flavored and similar in shape to those of dill. Fennel, Foeniculum vulgare, is a perennial herb. It is erect, glaucous green, and grows to heights of up to 2.5 m, with hollow stems. The leaves grow up to 40 cm long; they are finely dissected, with the ultimate segments filiform (threadlike), about 0.5 mm wide."}, {"url": "http://www.thekitchn.com/what-is-fennel-and-how-do-i-us-111595", "passage_text": "Brie, fennel is a bulbous vegetable with a tall, wispy, fronded top that looks rather like dill. The fronds can be used in salads, but the main attraction of fennel is the bulb itself. It's very firm and crunchy, and it tastes a bit like licorice and anise. "}]