[{"url": "https://en.wikipedia.org/wiki/Perth", "passage_text": "Perth is a particularly sunny city for this type of climate; it has an average of 8.8 hours of sunshine per day, which equates to around 3200 hours of annual sunshine, and 138.7 clear days annually, making it the sunniest capital city in Australia. Perth /ˈpɜrθ/ is the capital and largest city of the Australian state of Western Australia. It is the fourth-most populous city in Australia, with an estimated population of 2.02 million (as of 30 June 2014) living in Greater Perth."}, {"url": "http://www.holiday-weather.com/perth_au/averages/", "passage_text": "Perth: Annual Weather Averages. January is the hottest month in Perth with an average temperature of 25°C (76°F) and the coldest is July at 13°C (55°F) with the most daily sunshine hours at 13 in January. The wettest month is June with an average of 140mm of rain."}, {"url": "http://waclimate.net/", "passage_text": "Average temperature trends across Western Australia. Below is an approximate 100 year comparison of average annual mean minimum and maximum temperatures at 32 different locations across Western Australia, including weather in the capital city of Perth. The temperature averages have been extracted from the database publicly available at the Australian Bureau of Meteorology website for Western Australia, and from the first ever climate study conducted in the colony of Western Australia before 1900. 32 combined average temperatures."}, {"url": "http://www.holiday-weather.com/perth_au/averages/january/", "passage_text": "The city of Perth lies on the southwestern coast of Australia. It is not only the capital of Western Australia, but it is also the fourth most populous city in continental Australia. On average, the city receives 3000 hours of sunshine per year. The weather maintains mild conditions during the months of winter. In summer, .."}, {"url": "http://www.holiday-weather.com/perth_au/averages/january/", "passage_text": "In this hottest month of the year, temperatures average around 25 degrees. In January, the sunniest month of Perth, 13 hours of sunshine can be enjoyed. The sea water temperature at Cottesloe Beach remains at an ideal warmth at 21 degrees. Kings Park and Botanical Garden is the most popular attraction in Perth. It is not only the capital of Western Australia, but it is also the fourth most populous city in continental Australia. On average, the city receives 3000 hours of sunshine per year. The weather maintains mild conditions during the months of winter. In summer, .."}, {"url": "http://www.westernaustralia.com/en/About_Western_Australia/Weather_and_Climate/Pages/Climate_Weather.aspx", "passage_text": "Perth weather. WA’s capital city of Perth is bathed in sunshine for an average of nine hours a day, with a total of 131 perfect blue-sky days every year. That officially makes it the sunniest capital city in Australia, with one of the most enviable outdoor lifestyles in the world."}, {"url": "http://www.perth.climatemps.com/", "passage_text": "1 The typical Mediterranean climate average monthly temperatures in excess of 22.0 C (71.6 F) in its warmest month and an average in the coldest month between 18 to -3 C (64 to 27 F) with at least four months above 10 C (50 F). 2  Seasonality is moderate (K ppen-Geiger classification: Csa). 1 Perth, Western Australia, Australia is at 31 55'S, 115 58'E, 20 m (66 ft). 2  See map."}, {"url": "http://www.worldweatheronline.com/Perth-weather-averages/Western-Australia/AU.aspx", "passage_text": "Summer in Perth is from December until February and sees temperatures averaging between a high of 27 and 33 degrees Celsius and an average low of between 15 and 18 degrees Celsius. January and February tend to be warmer than December, so if you are susceptible to the effects of heat stroke, be very careful in the Perth summer. Winter. From June until the August the temperature dips in Perth to the twenties, with it not falling below 15 degrees on average during the daytime. At night there is a slightly colder feel to the city with temperatures falling as low as 6 degrees in July"}]