[{"url": "https://callcopic.com/", "passage_text": "Enhancing LivesAt COPIC, our mission is to improve medicine in the communities we serve. We are dedicated to providing tools and resources to health care professionals so they can focus on delivering the best in patient care.learn more. At COPIC, our mission is to improve medicine in the communities we serve. Enhancing CommunitiesSince 1992, COPIC Medical Foundation has made grants totaling more than $4.5 million to organizations involved in initiatives that improve health care in their communities."}, {"url": "http://debbiehodge.com/pillar-content-parent/how-to-use-copic-markers/", "passage_text": "Copic markers were originally created for designers and with the needs of designers in mind. Here are things that make them special: 1  All of the markers can be refilled with ink and come with replaceable nibs or tips. 2  The labeling on the side of the markers is embossed so will not rub off. The ink is waterproof and compatible with Copic markers. They come in black and 5 colors as well. If you have a favorite sketch pen already you can always test it with your Copics. Draw a small circle on your paper, color in the inside of your circle with a Copic marker."}, {"url": "http://www.dickblick.com/products/copic-multiliner-pens/", "passage_text": "↓ SAVE 30 - 40% off List! Copic Multiliner Pens are fine quality inking pens available in a variety of sizes and styles. The pigment-based ink is waterproof and won't bleed or smear when used with Copic Markers. These quick-drying pens are ideal for anime, illustration, cartooning, pen-and-ink drawing, scrapbooking, and other detail work. Copic Multiliner Pens have Black ink and are available in nine different nibs, including seven widths, from 0.03 mm to 1.0 mm, as well as Brush Small (BS) and Brush Medium (BM). Conforms to ASTM D-4236."}, {"url": "http://www.dickblick.com/products/copic-multiliner-pens/", "passage_text": "They're great for use as a complement to Copic Sketch Markers. Copic Multiliner Pens have Black ink and are available in nine different nibs, including seven widths, from 0.03 mm to 1.0 mm, as well as Brush Small (BS) and Brush Medium (BM). Conforms to ASTM D-4236."}, {"url": "http://debbiehodge.com/pillar-content-parent/how-to-use-copic-markers/", "passage_text": "Copic makes sketch pens called multilinkers. There are 2 styles of these pens. The Copic Multiliner is a great sketch pen that ranges in size from .03mm to 1.0mm and also comes in 2 brush sizes. The ink is waterproof and compatible with Copic markers. They come in black and 5 colors as well. If you have a favorite sketch pen already you can always test it with your Copics. Draw a small circle on your paper, color in the inside of your circle with a Copic marker."}, {"url": "http://www.dickblick.com/products/copic-sketch-markers/", "passage_text": "The choice of professionals worldwide, the Copic marker offers outstanding performance in all areas of design and illustration. Two versatile tips produce a range of strokes from fine lines to wide color fills. The roll-proof flat barrel is filled with alcohol based ink for a long life. "}, {"url": "http://www.ehow.com/info_8115949_copic-markers.html", "passage_text": "Jupiterimages/Comstock/Getty Images. Copic markers are part of a line of products manufactured in Japan and marketed in the United States and Canada through Imagination International, Inc. The Copic line includes markers, pens, inks, papers and an airbrush system, along with informational books and DVDs about Copic products and their uses. "}, {"url": "https://en.wikipedia.org/wiki/Copic", "passage_text": "Copic (コピック, Kopikku) is a brand of markers as well as inking and related products made in Japan by Too and distributed in the United States and Canada by Imagination International. These markers are available in 358 colors with a brush nib and a smaller chisel-shaped nib. They are compatible to the Copic Airbrush System. These are the most popular marker from Too. The 25th anniversary markers are available in 36 colors with a brush nib and a small standard tip. They have a special black barrel and were produced in limited quantities to commemorate the company's 25th anniversary"}, {"url": "https://en.wikipedia.org/wiki/Copic", "passage_text": "Copic markers are available in 358 permanent, non-toxic, alcohol-based ink colors and are refillable using standard color ink refills. The refill inks can be mixed to create custom colors, and empty markers are sold for this purpose. These markers are available in 358 colors with a brush nib and a smaller chisel-shaped nib. They are compatible to the Copic Airbrush System. These are the most popular marker from Too. The 25th anniversary markers are available in 36 colors with a brush nib and a small standard tip. They have a special black barrel and were produced in limited quantities to commemorate the company's 25th anniversary"}]