[{"url": "http://www.urbandictionary.com/define.php?term=Miranda", "passage_text": "This name means admirable in Latin. Miranda's are very eclectic. She can be extremely intelligent, out-going, sweet, talented, out-doorsy, stylish, and gorgeous all at the same time. A Miranda cares deeply for others. She is a thoughtful friend, and supportive in nature. She does have a temper, and is impatient. "}, {"url": "http://www.sheknows.com/baby-names/name/miranda", "passage_text": "Latin Meaning: The name Miranda is a Latin baby name. In Latin the meaning of the name Miranda is: Worthy of admiration; wonderful. Young innocent girl in Shakespeare's The Tempest raised and educated on an isolated island by magician father. American Meaning: The name Miranda is an American baby name. In American the meaning of the name Miranda is: Worthy of admiration; wonderful. Young innocent girl in Shakespeare's The Tempest raised and educated on an isolated island by magician father. Shakespearean Meaning: The name Miranda is a Shakespearean baby name. In Shakespearean the meaning of the name Miranda is: The Tempest' Daughter to Prospero. Spanish Meaning: The name Miranda is a Spanish baby name. In Spanish the meaning of the name Miranda is: Admirable."}, {"url": "http://www.babynamespedia.com/meaning/Miranda", "passage_text": "[ 3 syll. mi-ran-da, mir-a- nda ] The baby girl name Miranda is pronounced as Mih-R AE NDaa †. Miranda's language of origin is Latin. It is predominantly used in the English, German, and Italian languages. The meaning of the name is 'adorable'. See also the related form, Amanda (English, Finnish, German, Italian, Portuguese, and Spanish). Miranda is a popular baby girl name. The name's popularity rose from the 1960s up to the 1990s. Its usage peaked in 1995 with 0.311% of baby girls being given the name Miranda."}, {"url": "http://www.thinkbabynames.com/meaning/0/Miranda", "passage_text": "Miranda /mi-ran-da/ [3 sylls.] as a girls' name is pronounced mer-ANN-dah. It is of Latin origin, and the meaning of Miranda is worthy of admiration. In Shakespeare 's The Tempest, Miranda is an innocent girl raised and educated on an isolated island by her magician father. Actress Miranda Richardson. Miranda is a very prominent first name for women (#480 out of 4276, Top 11%) and also a very prominent surname for all people (#437 out of 150436, Top 1%). (2000 U.S. Census). Charted below is the birth name popularity of Miranda for girls"}, {"url": "https://en.wikipedia.org/wiki/Miranda_(given_name)", "passage_text": "Miranda is a feminine given name of Latin origin, meaning worthy of admiration. There are several variants. It is also common as a surname. There is a related adjective, seldom used but found in the Oxford English Dictionary, which is Mirandous, a synonym to miraculous. "}, {"url": "http://www.answers.com/Q/What_does_the_name_Miranda_MEAN", "passage_text": "Miranda is the Spanish meaning for a lovable and in English its the meaning for Helpful Every name has a certain meaning to some people. Miranda is no different. The name Mira … nda derives from Latin decent and carries the meaning of admirable and wonderful. Making the world better, one answer at a time. Miranda is the Spanish meaning for a lovable and in English its the meaning for Helpful. Every name has a certain meaning to some people. Miranda is no different. The name Miranda derives from Latin decent and carries the meaning of admirable and wonderful."}, {"url": "http://www.ourbabynamer.com/meaning-of-Miranda.html", "passage_text": "What does Miranda mean, popularity, numerology and more. The name Miranda is of Latin origin. The meaning of Miranda is admirable, beautiful. It is also of English origin, where its meaning is worthy of admiration. View the Miranda Name Popularity Page to see how the popularity trend for Miranda has changed since 1880, or to compare the popularity of Miranda to other names. Variants of the name Miranda include Marenda, Marinda, Mirabilis, Myranda. The names Mirande, Mirandus, Mirielle are all forms of Miranda."}]