[{"url": "http://www.lingo2word.com/lingodetail.php?WrdID=10940", "passage_text": "muva. has the following definition + add your definition. mother. mother is used in Slang Leet Texting. The word muva is used in Slang, Leet, Texting meaning mother. "}, {"url": "https://en.wikipedia.org/wiki/Leet", "passage_text": "Leet (or  1337 ), also known as eleet or leetspeak, is an alternative alphabet for the English language that is used primarily on the Internet. It uses various combinations of ASCII characters to replace Latinate letters. Leet originated within bulletin board systems (BBS) in the 1980s, where having elite status on a BBS allowed a user access to file folders, games, and special chat rooms. The Cult of the Dead Cow hacker collective has been credited with the original coining of the term, in their text-files of that era."}, {"url": "http://www.urbandictionary.com/define.php?term=leet", "passage_text": "Yes, leet is a language, now used by gamers, some deserving of using such a language and some not. As for origins, it started with hackers who DIDN'T create a language when the hacked into Microsoft or whatever shit was put before. Due to it being great to be known as leet, newbies started adopting the term and using to describe themselves, often with numerical variations. Anyone who considers themselves leet should be able to tell you who/what Razor1911 is, anyone failing to answer this question should be laughed at."}, {"url": "http://onlineslangdictionary.com/meaning-definition-of/leet", "passage_text": "Link to this slang definition. To link to this term in a web page or blog, insert the following. To link to this term in a wiki such as Wikipedia, insert the following. Some wikis use a different format for links, so be sure to check the documentation. 1 From elite. 2  Also written l33t. 3  That website is leet. 4  See more words with the same meaning: good, okay, cool, awesome, fun."}, {"url": "http://www.urbandictionary.com/define.php?term=leet", "passage_text": "leet. A derivitave of the 80's software piracy scene. Originally elite was used to show status on a BBS. Commonly the people who cracked the software, or had sysop access on a board would be referred to as Elite. Due to it being great to be known as leet, newbies started adopting the term and using to describe themselves, often with numerical variations. Anyone who considers themselves leet should be able to tell you who/what Razor1911 is, anyone failing to answer this question should be laughed at."}, {"url": "https://en.wikipedia.org/wiki/Internet_slang", "passage_text": "For a list of terms, see Wiktionary:Appendix:English internet slang. Internet slang (Internet shorthand, Cyber-slang, netspeak, or chatspeak) refers to a variety of slang languages used by different people on the Internet. It is difficult to provide a standardized definition of Internet slang due to the constant changes made to its nature. Internet slang originated in the early days of the Internet with some terms predating the Internet. Internet slang is used in chat rooms, social networking services, online games, video games and in the online community."}, {"url": "http://www.answers.com/Q/What_does_1337_mean", "passage_text": "1337 = leet as in elite (type 1337 on a calculator and turn it upside-down). It can mean that someone is very good at a game, or anything really. It's the opposite of noob, as in newbie. NOTE: Noob and newb are 2 different things. Technically, it in itself does not mean anything, but if you type it into a calculator and turn it upside-down, it says LEET as is elite, it is used to refer to someone who … is good/skilled at something (aka opposite of a noob/newbie) PS."}, {"url": "https://en.wikipedia.org/wiki/Leet", "passage_text": "For example, leet spellings of the word leet include 1337 and l33t; eleet may be spelled 31337 or 3l33t. The term leet is derived from the word elite. The leet alphabet is a specialized form of symbolic writing. Leet originated within bulletin board systems (BBS) in the 1980s, where having elite status on a BBS allowed a user access to file folders, games, and special chat rooms. The Cult of the Dead Cow hacker collective has been credited with the original coining of the term, in their text-files of that era."}]