[{"url": "http://disney.wikia.com/wiki/Arendelle", "passage_text": "History. Due to the unstable nature of Elsa's powers, until Elsa could learn to control her winter magic, the castle was closed off for 13 years following the late king's orders; this was done for Elsa's safety, as well as the safety of Anna. "}, {"url": "https://answers.yahoo.com/question/index?qid=20140103191745AAtP3v9", "passage_text": "I wasn't able to identify anything from Anna's clothing or hair and it's really bugging me! I really thought it was around the 1870s the whole way through the movie until I looked back at Hans' outfit, because of what Anna and Elsa wear, but I'm just completely guessing. You have a good point on what Hans wears, but then again, just look at Elsa&#x27;s outfit... Maybe present time, idk I just don&#x27;t think Disney was really trying to put t in a time period. Source(s): Idk my brain and the movie. Emma Beatty · 2 years ago. Thumbs up"}, {"url": "http://www.scmfocus.com/sapplanning/2010/03/02/frozen-period/", "passage_text": "Background on the Frozen Period. I am sometimes asked to describe the frozen period and the benefits and costs to setting it at certain durations. At some companies setting a real frozen period can be a challenge and often times they want to know why should use any frozen period at all. The previous article describes how the frozen period can be set by matching to the industry. "}, {"url": "http://disney.wikia.com/wiki/Thread:307915", "passage_text": "There are many films that are set in certain time periods by official sources. Even though its not a fairy-tale, PotC is most definately set in the 18th century, and it wouldn't make sense for it to be set in the 'time of fairy-tales'. And don't say 500 years because of the 1840 timeline of Frozen, because the Tangled makers said 400 (making the 500 years edit false and especially untrue because they set Tangled in the 1780s)."}, {"url": "http://d-princesses.livejournal.com/1104677.html", "passage_text": "22 June 2011 @ 10:03 pm. Estimated Time Periods and Locations of the Disney Princesses. There was a post a while back discussing when and where each of the Disney Princess films took place; I decided to look into it myself, and I might have an answer. The first of many headaches. These are the time periods when huge poofy sleeves would have been in fashion. The late 1600's was The Golden Age of piracy and of sailing in general. The late 1800's/early 1900's was another important age in sailing."}, {"url": "http://disney.wikia.com/wiki/Thread:307915", "passage_text": "Tangled is set in the 1780s according to the Mother Gothel page. The user who wrote the information didn't write possibly in his/her trivia. That's why people think it takes place in 1780s BUT the user DID NOT cite any source, which can be questioned where did the user get the info he/she wrote. And don't say 500 years because of the 1840 timeline of Frozen, because the Tangled makers said 400 (making the 500 years edit false and especially untrue because they set Tangled in the 1780s)."}, {"url": "http://disney.wikia.com/wiki/Thread:307915", "passage_text": "DustAndShadows wrote: Frozen: According to the book, it's set in the 1840s, so I'll go with it. Tangled: 1780s, according to creators, so it's canon too. Rapunzel cameo: It's a cameo. There are tons of cameos in Disney movies, but they are never canon. So I don't think Frozen and Tangled are taking place in the same period. And don't say 500 years because of the 1840 timeline of Frozen, because the Tangled makers said 400 (making the 500 years edit false and especially untrue because they set Tangled in the 1780s)."}, {"url": "http://www.answers.com/Q/What_time_period_is_Romeo_and_Juliet_set_in", "passage_text": "The movie High School Musical is loosely based on Romeo and Juliet, and that, of course is set in modern day America. One reason why all of Shakespeare's plays are so successful 400 years after his death is that they can be set in almost any time period and almost any place. Confidence votes 38. Although Romeo and Juliet was written between 1591-1596, the play could have been set at any time from 1300 to 1600. An argument can be made that it takes place around the late 1400's. Italy was then in a time of unrest, as is showcased in the drama."}]