[{"url": "https://en.wikipedia.org/wiki/Evaporation", "passage_text": "Evaporation is a type of vaporization of a liquid that occurs from the surface of a liquid into a gaseous phase that is not saturated with the evaporating substance. The other type of vaporization is boiling, which is characterized by bubbles of saturated vapor forming in the liquid phase. "}, {"url": "https://en.wikipedia.org/wiki/Vaporization", "passage_text": "Evaporation may occur when the partial pressure of vapor of a substance is less than the equilibrium vapour pressure. Boiling is a phase transition from the liquid phase to gas phase that occurs at or above the boiling temperature. Boiling, as opposed to evaporation, occurs below the surface. Boiling occurs when the equilibrium vapour pressure of the substance is greater than or equal to the environmental pressure. Evaporation is a surface phenomenon whereas boiling is a bulk phenomenon. Sublimation is a direct phase transition from the solid phase to the gas phase, skipping the intermediate liquid phase. The term vaporization has also been used to refer to the physical destruction of an object that is exposed to intense heat."}, {"url": "http://www.lenntech.com/evaporation.htm", "passage_text": "The pressure exerted by the vapor of a liquid in a confined space is called its vapor pressure. It differs for different substances at any given temperature, but each substance has a specific vapor pressure for each given temperature. At its boiling point the vapor pressure of a liquid is equal to atmospheric pressure. For example, the vapor pressure of water, measured in terms of the height of mercury in a barometer, is 4.58 mm at 0°C and 760 mm at 100°C (its boiling point). "}, {"url": "http://water.usgs.gov/edu/watercycleevaporation.html", "passage_text": "Credit: U.S. Nuclear Regulatory Commission. Evaporation is the process by which water changes from a liquid to a gas or vapor. Evaporation is the primary pathway that water moves from the liquid state back into the water cycle as atmospheric water vapor. A very small amount of water vapor enters the atmosphere through sublimation, the process by which water changes from a solid (ice or snow) to a gas, bypassing the liquid phase."}, {"url": "http://www.pkwy.k12.mo.us/west/teachers/anderson/pack7/boil/boil.html", "passage_text": "When the air is saturated with water vapor, the molecules in the vapor condense to a liquid as fast as the liquid evaporates, and the two processes (evaporation and condensation) continue at equal rates. This is called an equilibrium. The evaporation and condensation are proceeding at the same rate, so there is no net change. In a closed container, the pressure due to the water vapor reaches a maximum value (for a given temperature) called vapor pressure. Vapor pressure is the pressure caused by a liquid's own vapor. As the temperature of the water increases, its vapor pressure increases. When the vapor pressure equals the atmospheric pressure on the liquid, the liquid will boil. At high altitudes, the boiling point of liquids is lower than at sea level. In Denver, Colorado, water will boil at about 94°C."}, {"url": "https://en.wikipedia.org/wiki/Vaporization", "passage_text": "Evaporation is a phase transition from the liquid phase to vapor (a state of substance below critical temperature and critical pressure) that occurs at temperatures below the boiling temperature at a given pressure. Evaporation is a surface phenomenon whereas boiling is a bulk phenomenon. Sublimation is a direct phase transition from the solid phase to the gas phase, skipping the intermediate liquid phase. The term vaporization has also been used to refer to the physical destruction of an object that is exposed to intense heat."}, {"url": "http://www.chem.fsu.edu/chemlab/chm1046course/liquids.html", "passage_text": "Vaporization is the process of converting a liquid into a gas. It is also called evaporation. Since we know that the particles of a gas are moving faster than those of a liquid, an input of energy must be required for a liquid to become a gas. The boiling point of a liquid is the temperature at which the liquid will convert to a gas. If the atmospheric pressure at this temperature is given as 1 atmosphere or 760 mmHg, then this temperature is called the normal boiling point of the liquid."}, {"url": "https://en.wikipedia.org/wiki/Water_vapor", "passage_text": "Water vapor, water vapour or aqueous vapor, is the gaseous phase of water. It is one state of water within the hydrosphere. Water vapor can be produced from the evaporation or boiling of liquid water or from the sublimation of ice. Unlike other forms of water, water vapor is invisible. Under typical atmospheric conditions, water vapor is continuously generated by evaporation and removed by condensation."}, {"url": "https://en.wikipedia.org/wiki/Vaporization", "passage_text": "Vaporization (or vaporisation) of an element or compound is a phase transition from the liquid phase to vapor There are two types of vaporization: evaporation and boiling. This diagram shows the nomenclature for the different phase transitions. Evaporation is a surface phenomenon whereas boiling is a bulk phenomenon. Sublimation is a direct phase transition from the solid phase to the gas phase, skipping the intermediate liquid phase. The term vaporization has also been used to refer to the physical destruction of an object that is exposed to intense heat."}]