[{"url": "http://www.naturalnews.com/001978.html", "passage_text": "If you really want to get your blood sugar down, it's time to change your diet. Remember, your health outcome is in your hands. You are the only person who can alter your blood sugar on a permanent basis, and the way to do that is to make new choices in the types of food and beverages that you consume. "}, {"url": "http://www.diabeticlivingonline.com/monitoring/blood-sugar/morning-highs-how-to-lower-morning-blood-sugar", "passage_text": "Many people believe that what you eat in the evening affects blood glucose, also known as blood sugar, but often the real culprit is what's gone awry with the hormones that work to control blood sugar levels. Here are some steps you can take to lower your morning highs. By Hope S. Warshaw, RD, CDE, 2012. As Type 2 Diabetes Develops. During the years when type 2 diabetes slowly develops (which may be up to 10 years through developing metabolic syndrome and continuing on to prediabetes), hormonal control of blood glucose breaks down."}, {"url": "http://www.naturalnews.com/001978_blood_sugar_high.html", "passage_text": "I'm not being blameful here, just matter-of-fact. I've been there, too: I ate sugars and white flour up until I was in my mid 20's. That, in effect, is the answer to your question. If you really want to get your blood sugar down, it's time to change your diet. Remember, your health outcome is in your hands. You are the only person who can alter your blood sugar on a permanent basis, and the way to do that is to make new choices in the types of food and beverages that you consume. "}, {"url": "http://answers.webmd.com/answers/5046667/foods-to-bring-down-your-blood-sugar-naturally", "passage_text": "foods to bring down your blood sugar naturally. I would like to know what foods to eat to bring down my blood sugar naturally. I do not want to take any of the shots, as they cause CANCER, and there is enough CANCER in my family line now. Related Topics: Food, Blood Sugar, Family. "}, {"url": "http://www.webmd.com/diabetes/morning-high-blood-sugar-levels", "passage_text": "Once you and your doctor figure out how your blood sugar levels behave overnight, she may suggest changes like these: 1  Change the type of insulin so it doesn’t peak at the wrong time or in the middle of the night. 2  Take extra insulin overnight if your blood sugar goes up during the evening. This could happen if you took too much insulin earlier or if you didn’t have enough of a bedtime snack. To learn the reason for your high morning blood sugar, your doctor will likely ask you to check your levels between 2 a.m. and 3 a.m. for a few nights in a row. If it’s consistently low during this time, the Somogyi effect is probably the cause"}, {"url": "http://www.webmd.com/diabetes/morning-high-blood-sugar-levels", "passage_text": "The term refers to pattern of your blood sugar being high in the morning, after having been low (hypoglycemia). Usually there are no symptoms, but night sweats can be a sign. Your blood sugar may drop too low in the middle of the night. In response, your body releases hormones to raise it. This could happen if you took too much insulin earlier or if you didn’t have enough of a bedtime snack. To learn the reason for your high morning blood sugar, your doctor will likely ask you to check your levels between 2 a.m. and 3 a.m. for a few nights in a row. If it’s consistently low during this time, the Somogyi effect is probably the cause"}, {"url": "http://www.diabeticlivingonline.com/monitoring/blood-sugar/how-to-lower-morning-blood-sugar", "passage_text": "Find out why your blood sugar might be high in the morning. You may be surprised that the cause is not just too much food the night before. Plus, learn the steps you can take to lower your morning high blood sugar levels. By Hope S. Warshaw, RD, CDE; Reviewed 2014. « 1  prev. Mix and Match Solutions with the Help of Your Provider. Before you act on a solution to lower your morning fasting blood sugar, consider the blood sugar numbers on your meter, your A1C results, your lifestyle, your schedule, the medications your health plan covers, and what you can afford. Use meter checks and regular A1C results to assess the solutions you try"}, {"url": "http://www.diabeticlivingonline.com/monitoring/blood-sugar/morning-highs-how-to-lower-morning-blood-sugar", "passage_text": "High fasting blood sugar levels, particularly in the earlier years of type 2 diabetes, result from this hormonal imbalance. Evening meals and snacks may get the blame for morning highs, but hormones are the likely cause. As Type 2 Diabetes Develops. During the years when type 2 diabetes slowly develops (which may be up to 10 years through developing metabolic syndrome and continuing on to prediabetes), hormonal control of blood glucose breaks down."}]