[{"url": "https://en.wikipedia.org/wiki/RNA_polymerase", "passage_text": "RNA polymerase enzymes are essential to life and are found in all organisms and many viruses. It then produces an RNA chain, which is complementary to the template DNA strand. The process of adding nucleotides to the RNA strand is known as elongation; in eukaryotes, RNAP can build chains as long as 2.4 million nucleotides (the full length of the dystrophin gene)."}, {"url": "http://www.web-books.com/MoBio/Free/Ch4B1.htm", "passage_text": "E. coli. An E. coli RNA polymerase is composed of five subunits: two α subunits, and one for each β, β', and σ subunit. β (151 kD) and β' (156 kD) are significantly larger than α (37 kD). Several different forms of σ subunits have been identified, with molecular weights ranging from 28 kD to 70 kD. Both RNA and DNA polymerases can add nucleotides to an existing strand, extending its length. However, there is a major difference between the two classes of enzymes: RNA polymerases can initiate a new strand but DNA polymerases cannot."}, {"url": "https://en.wikipedia.org/wiki/RNA_polymerase", "passage_text": "Compare RNA-dependent RNA polymerase. RNA polymerase (RNAP or RNApol), also known as DNA-dependent RNA polymerase, is an enzyme that produces primary transcript RNA. In cells, RNAP is necessary for constructing RNA chains using DNA genes as templates, a process called transcription. It then produces an RNA chain, which is complementary to the template DNA strand. The process of adding nucleotides to the RNA strand is known as elongation; in eukaryotes, RNAP can build chains as long as 2.4 million nucleotides (the full length of the dystrophin gene)."}, {"url": "https://en.wikipedia.org/wiki/RNA_polymerase_II", "passage_text": "RNA polymerase II of Saccharomyces cerevisiae consisting of all 12 subunits. RNA polymerase II (RNAP II and Pol II) is an enzyme found in eukaryotic cells. It catalyzes the transcription of DNA to synthesize precursors of mRNA and most snRNA and microRNA. 1 RPB2 (POLR2B) - the second-largest subunit that in combination with at least two other polymerase subunits forms a structure within the polymerase that maintains contact in the active site of the enzyme between the DNA template and the newly synthesized RNA."}, {"url": "http://www.answers.com/Q/What_is_the_function_of_RNA_polymerase", "passage_text": "Basically, RNA polymerase's role is very similar to that of DNA polymerase. RNA polymerase is an enzyme that is used during transcription in the nucleus. Similar to DNA polyme … rase, RNA polymerase codes for the complementary nucleotides to a DNA strand. Instead of thymine though, uracil codes with adenine. DNA polymerases always extend the primer in the 5' to 3' direction. RNA polymerases are used to transcribe genes from DNA. Transcribtion is the process of making an RNA copy of information encoded in DNA."}, {"url": "http://www.ncbi.nlm.nih.gov/books/NBK22085/", "passage_text": "Figure 10-6. Transcription of two genes. (a) RNA polymerase moves from the 3′ end of the template strand, creating an RNA strand that grows in a 5′ → 3′ direction (because it must be antiparallel to the template strand). Transcription and RNA polymerase. As described earlier, transcription relies on the complementary pairing of bases. The two strands of the double helix separate locally, and one of the separated strands acts as a template."}, {"url": "https://www.ndsu.edu/pubweb/~mcclean/plsc431/eukarychrom/eukaryo2.htm", "passage_text": "The second two activities of DNA Pol I are important for replication, but DNA Polymerase III (Pol III) is the enzyme that performs the 5'-3' polymerase function. 1  Primase-The requirement for a free 3' hydroxyl group is fulfilled by the RNA primers that are synthesized at the initiation sites by these enzymes. "}, {"url": "http://www.sp.uconn.edu/~ttc02001/MCB3201/RA%20(V)/RNA%20polymerase%20II.pdf", "passage_text": "[1] RNA polymerase II (RNAP II and Pol II) is an enzyme found in eukaryotic cells. It catalyzes the transcription of DNA to synthesize precursors of mRNA and most snRNA and microRNA. [2][3] A 550 kDa complex of 12 subunits, RNAP II is the most studied type of RNA polymerase. Subunits The eukaryotic core RNA polymerase II was first purified using transcription assays. [4] The purified enzyme has typically 10-12 subunits (12 in humans and yeast) and is incapable of specific promoter recognition. [5] Many subunit-subunit interactions are known."}, {"url": "https://answers.yahoo.com/question/index?qid=20101229113909AAVhExE", "passage_text": "Answers. Best Answer: RNA polymerase (RNAP or RNApol) is an enzyme that produces RNA. In cells, RNAP is needed for constructing RNA chains from DNA genes as templates, a process called transcription. RNA polymerase enzymes are essential to life and are found in all organisms and many viruses. In chemical terms, RNAP is a nucleotidyl transferase that polymerizes ribonucleotides at the 3' end of an RNA transcript"}]