[{"url": "http://www.recovery-ios.com/recover-whatsapp-chat-history-on-iphone.html", "passage_text": "For the tutorial on how to recover WhatsApp chats from iCloud backup or with iOS data recovery program, you can simply refer to the steps in the following article. iPhone WhatsApp Recovery Software. iPhone Data Recovery enables you to recover deleted WhatsApp chat history by scanning your iPhone 5/4S/4/3GS."}, {"url": "http://www.transfer-iphone-recovery.com/iphone-whatsapp-chat-history-recovery.html", "passage_text": "If you have iTunes backup, you can surely restore WhatsApp chat history directly from iTunes, otherwise, you cannot do so directly. Fortunately, you can use iPhone data recovery software, which enables you to recover deleted WhatsApp chat history in 3 ways."}, {"url": "http://www.recovery-android.com/recover-samsung-whatsapp-chat-history.html", "passage_text": "You can download the trial version of Android Data Recovery for free on your computer first. As you have downloaded Android Data Recovery on your computer, you will see the main interface of Android Data Recovery. Follow the steps below and you will get your Samsung lost WhatsApp chat history soon."}, {"url": "http://www.recovery-android.com/retrieve-whatsapp-from-android.html", "passage_text": "After that, you can click “ Next ” to have the program begin scanning your Android for deleted data. Step 5 Preview and recover WhatsApp chat history from Android device. It will take you some time to scan the data. After that, you can preview all recoverable data found in the scan result one by one."}, {"url": "http://www.recovery-android.com/retrieve-whatsapp-from-android.html", "passage_text": "If you want to recover WhatsApp chat history, click “WhatsApp” and you can preview all your WhatsApp chat history to choose which to restore on your computer. Click “Recover” button, and within few minutes you can retrieve your WhatsApp deleted messages from your Android."}, {"url": "http://android.stackexchange.com/questions/57447/contact-still-visible-in-whatsapp-after-deleting-out-of-my-contactlist-from-my-p", "passage_text": "To delete a contact from the WhatsApp contact list, you will need to delete the contact from your phone's address book. In order to find the WhatsApp contact in your phone's address book: 1  Find the contact in the Select contact page. 2  Tap on the contact."}, {"url": "http://www.pcnexus.net/2014/01/whatsapp-trick-recover-messages-from-deleted-whatsapp-account.html", "passage_text": "If you have this database then you can restore your deleted messages in Whatsapp. Check this tutorial to restore your deleted Whatsapp messages. The “msgstore.db.crypt” chat database is the only way to restore your deleted Whatsapp messages. But what if you have accidently deleted this database. This chat history database will be deleted if you delete your Whatsapp account or you manually deleted it or the conversation backup is never done."}, {"url": "http://geekeasier.com/restore-deleted-whatsapp-chat-history/973/", "passage_text": "Here are how to restore whatsapp chat history. Go to the Database folder within the SD card on your smartphone – the exact location of that backup files is /sdcard/WhatsApp/Databases. Inside the Databases folder you’ll see various data files that something named like db.crypt."}]