[{"url": "http://blog.about-esl.com/teaching-english-luxembourg/", "passage_text": "Expected Salary and Living Costs. The typical salaries on offer can be anywhere from $1000 – $3000 per month. If you secure a job in an international school or university (there is only 1 university in Luxembourg!) then you can expect to earn towards the higher end of this pay scale. It is an advanced economy and is a member of international organisations such as the EU, NATO, and the United Nations. There are 3 official languages in the country including: Luxembourgish, French and German."}, {"url": "http://www.oecd.org/edu/skills-beyond-school/48631286.pdf", "passage_text": "The salaries of lower secondary school teachers with at least 15 years of experience range from less than USD 15 000 in Hungary, Indonesia and the Slovak Republic to USD 60 000 or more in Germany, Ireland and the Netherlands, and exceed USD 100 000 in Luxembourg (Table D3.1 and Chart D3.1). Salaries after 11 years of experience. Countries are ranked in descending order of the index of change between 2005 and 2009 in teachers' salaries in lower secondary education after 15 years of experience. Source: OECD."}, {"url": "http://www.educationworld.net/salaries_jp.html", "passage_text": "Teacher Salary Information-Japan. In Japan, public school teachers are paid paid by the Prefectural Government. In 2005, the average salary for an elementary teacher is equivalent to $45,515 USD. Japanese teachers are the 5th best paid behind Luxembourg, Switzerland, Germany and Korea. The following table details the salaries for teachers, head teachers and principals employeed in the public school system in Japan. The data is from 2001-2002."}, {"url": "http://www.oecd.org/edu/Luxembourg-EAG2014-Country-Note.pdf", "passage_text": "24% teachers in Luxembourg are under 30, compared to the. 13% average across OECD countries. At the lower secondary levelthe pattern is very similar: the propo rtion of teachers, under 30, in. Luxembourg, is double the proportion for OECD and EU21 countries. At the secondary level, annual expenditure per student is over USD 16 200, while the average in OECD and EU21 countries is approximately USD 9 500. A young teaching workforce that is getting younger."}, {"url": "http://www.wort.lu/en/luxembourg/luxembourg-teachers-at-the-top-of-oecd-salary-ranking-50c775ace4b01bf23d29cc98", "passage_text": "(CS) The OECD has ranked Luxembourg teachers in the number one spot when it comes to wages, with a maximum yearly salary of 128,181 USD, the equivalent of over 98,000 euros. This stands in stark comparison to an OECD average of just 47,721 USD or around 36,700 euros. The compiled data dates from 2010 or the latest available year. Starting salaries in Luxembourg were calculated at 65,171 USD for primary school teachers and 73,777 USD for secondary education. These levels climb to 95,043 USD and 101,775 USD respectively after 15 years of service"}, {"url": "https://www.justlanded.com/english/Luxembourg/Jobs", "passage_text": "Jobs. Finding a job in Luxembourg isn't easy-especially as foreigner. Our job guide provides information about salaries, contracts and working conditions. Look in the classifieds for positions available and post an ad with your details. Chat with other job-seekers in the forum"}, {"url": "http://qz.com/115252/luxembourgs-teachers-make-twice-as-much-as-americas/", "passage_text": "In Indonesia, teachers earn $2,849 on average a year, while in the Slovak Republic, it’s $13,864 for top teachers with many years experience. The highest paid teachers are found in Luxembourg at $125,962 annually. Meanwhile, Switzerland pays an average $94,038 a year for the most experienced teachers. "}, {"url": "http://www.wort.lu/en/luxembourg/luxembourg-teachers-at-the-top-of-oecd-salary-ranking-50c775ace4b01bf23d29cc98", "passage_text": "Slovak teachers earn just 13,680 USD a year. Even countries with traditionally high teacher salaries such as Switzerland and Germany rank far behind Luxembourg in the study. For example, Swiss upper secondary teachers receive a maximum salary 90,374 USD after 27 years of service. The compiled data dates from 2010 or the latest available year. Starting salaries in Luxembourg were calculated at 65,171 USD for primary school teachers and 73,777 USD for secondary education. These levels climb to 95,043 USD and 101,775 USD respectively after 15"}, {"url": "http://www.oecd.org/edu/skills-beyond-school/48631286.pdf", "passage_text": "Chile, Estonia, Hungary, Indonesia, Mexico and the Slovak Republic show the lowest salaries per teaching hour – USD 30 or less. In contrast, salaries per hour reach USD 70 or more at all education levels in Denmark, Germany, Japan and Luxembourg. Salaries after 11 years of experience. Countries are ranked in descending order of the index of change between 2005 and 2009 in teachers' salaries in lower secondary education after 15 years of experience. Source: OECD."}]