[{"url": "http://time.com/3624820/pugsley-addams-family-ken-weatherwax/", "passage_text": "Ken Weatherwax, who played the Addams Family’s pudgy, cake-loving son Pugsley on the 1960s television hit, has died. He was 59. The actor died of a heart attack on Sunday, his niece, Shanyn Vieira, said on Facebook. "}, {"url": "https://en.wikipedia.org/wiki/Pugsley_Addams", "passage_text": "Pugsley Addams is a member of the fictional Addams family, created by American cartoonist Charles Addams. The 1998 series The New Addams Family features Pugsley played by Vancouver native Brody Smith. He is essentially the same as the original 1960s incarnation; however the influence of director John Bell's namesake Charlie 'Edge' Bell is undeniable. Also, he is portrayed as the younger sibling, as opposed to Wednesday."}, {"url": "http://www.tmz.com/2014/12/08/ken-weatherwax-dead-dies-pugsley-addams-family-heart-attack/", "passage_text": "'Addams Family' Star. Ken Weatherwax -- who played Pugsley on . The Addams Family  TV show -- died at his home Sunday in California after having a heart attack. Weatherwax's family tells TMZ there will be 2 funerals -- one for the family, and one for his fans. The actor stuck with the Pugsley role over the years ... "}, {"url": "http://www.bbc.co.uk/news/entertainment-arts-30392859", "passage_text": "Image caption The Addams Family featured a family of macabre oddballs, including Pugsley (left). Ken Weatherwax, who played Pugsley in the original Addams Family, has died at the age of 59. The actor suffered a heart attack and was found at his home in California on Sunday. Pugsley was the oldest child of Gomez and Morticia Addams in the 1960s TV series. Weatherwax, who also voiced the role of Pugsley in an animated version of the series in the 1970s, played Pugsley senior in a TV special Halloween With the New Addams Family in 1977.."}, {"url": "http://www.cnn.com/2014/12/09/showbiz/tv/ken-weatherwax-pugsley-addams-dies/index.html", "passage_text": "People we lost in 2014 – Ken Weatherwax, who played Pugsley on the 1960s TV show The Addams Family, died December 7, according to the Ventura County Coroner's Office. He was 59. Ken Weatherwax, who played Pugsley on the 1960s TV show The Addams Family, died Sunday, according to the Ventura County Coroner's Office. He was 59. According to the coroner's office, he died of natural causes. His niece, Shanyn Vieira, posted on Facebook that he had a heart attack."}]