[{"url": "http://www.peteducation.com/article.cfm?c=2+2115&aid=960", "passage_text": "Consult with your veterinarian to determine which vaccinations your puppy should receive, and how often. Drs. Foster and Smith prefer to vaccinate puppies with a combination vaccine at six weeks of age initially, with boosters given every three weeks until the puppy is about sixteen weeks of age. We feel that this schedule will help protect the widest range of dogs."}, {"url": "http://pugspot.com/articles/what-vaccinations-does-my-pug-need", "passage_text": "So, if you have your Pug vaccinated against distemper or another disease you should not rush out and expose him to other dogs or take him to places where he could encounter diseases. Use caution and common sense when it comes to protecting your Pug’s health. There are a couple of different vaccination protocols recommended for puppies, depending on which one your veterinarian follows. One protocol suggests that puppies should begin having their shots when they are five weeks old."}, {"url": "http://pugspot.com/articles/what-vaccinations-does-my-pug-need", "passage_text": "Your Pug will receive some immunity to the most common canine diseases from his mother when he’s born. His mother will most likely have been receiving vaccinations throughout her life and she passes her own immunity on to her puppies during the first 48 hours of life through the colostrum in her milk. There are a couple of different vaccination protocols recommended for puppies, depending on which one your veterinarian follows. One protocol suggests that puppies should begin having their shots when they are five weeks old."}, {"url": "http://www.pug-puppy.com/pug-vaccinations.html", "passage_text": "Vaccinations are a very important part of Pug ownership. Your Pug should be properly vaccinated against certain diseases at certain times to help protect him and other animals he may come in to contact with. At age 16 weeks, your Pug can be vaccinated for Rabies. Rabies is usually transmitted to dogs through saliva-most often in the form of a bite from an infected animal. Rabies affects all warm blooded animals but is most often found in bats, skunks, and raccoons. Rabies is always fatal."}, {"url": "http://pugspot.com/articles/what-vaccinations-does-my-pug-need", "passage_text": "For a puppy who begins his vaccinations at five weeks, a typical vaccination schedule will look like this: 5 weeks: Parvovirus vaccination. 6 & 9 weeks: Combination vaccine without leptospirosis. Combination vaccine usually includes adenovirus, hepatitis, canine distemper, parinfluenza and parvovirus. There are a couple of different vaccination protocols recommended for puppies, depending on which one your veterinarian follows. One protocol suggests that puppies should begin having their shots when they are five weeks old."}, {"url": "http://www.natural-dog-health-remedies.com/canine-vaccines.html", "passage_text": "When Not to Vaccinate Your Dog. As vaccinations put a lot of stress on your dog's immune system, vaccinations should NOT be given to the following dogs: 1  Too Young Puppies: Vaccinating young puppies too early and too often can prevent vaccines from having the desired effect. 1 Too Young Puppies: Vaccinating young puppies too early and too often can prevent vaccines from having the desired effect. 2  One reason is that young puppies (4-9 week-old nursing puppies) get maternal antibodies from their mother's milk. 3  The antibodies identify the vaccines as foreign infectious agents and destroy them."}, {"url": "http://pets.thenest.com/age-vaccinate-puppy-4526.html", "passage_text": "Puppies that play outside may be at risk of contracting parvovirus if they are not vaccinated. Vaccinations are vital to your puppy’s health. You should begin vaccinating your puppy at 6 weeks of age and provide him with his core vaccines during his first six months of life. However, your puppy’s vaccination schedule may vary based on other factors, such as his size or his dam. "}, {"url": "http://spiritualityhealth.com/articles/holistic-approach-vaccination-dogs", "passage_text": "7. If you live in an area with rabies or travel with your dog, the vaccine may be necessary. Give it at least four to eight weeks from other vaccinations. In my experience, healthy puppies may not need any vaccination and will maintain their antibodies (protections) for a lifetime. This is the safest way. "}, {"url": "http://pugspot.com/articles/what-vaccinations-does-my-pug-need", "passage_text": "After your Pug is a year old he will need his booster shots. These can be given in a combination vaccine or you can talk to your vet about giving your dog the boosters in alternating years since there is evidence from the American Veterinary Medical Association that immunity from each vaccine lasts longer than one year. There are a couple of different vaccination protocols recommended for puppies, depending on which one your veterinarian follows. One protocol suggests that puppies should begin having their shots when they are five weeks old."}]