[{"url": "http://www.rent.com/texas/clute-apartments/2-146", "passage_text": "Overview of Clute. Located about 60 miles south of Houston, Clute, Texas, is a city of numerous amenities and opportunities. Located in Brazoria County, Clute is far enough away from Houston that it offers a small-town vibe while still boasting numerous amenities, services and access to entertainment. Home to around 11,200 people, Clute's suburban vibe and standalone nature have created a growing and self-sufficient community. In fact, the nearest institute of higher learning is the University of Houston, Clear Lake, which is located 42 miles away in Houston. Clute serves as an employment hub for the surrounding area, as a few major companies are located within the city."}, {"url": "http://www.crescentwoodapts.com/", "passage_text": "Located on the corner of N Dixie Dr. and Brazoswood Dr., Crescentwood is ideally situated within Clute as well as all of the shopping, dining and entertainment that nearby Lake Jackson, Texas has to offer. Take a swim in our gorgeous pool, stroll through our pet-friendly community or have a day out with the kids in our on-site park. If you're looking for a home close to Lake Jackson or want to experience the perks of a wonderful apartment home in a convenient location, Crescentwood is the place for you in Clute."}, {"url": "http://www.ci.clute.tx.us/pages/clute-municipal-park.php", "passage_text": "The department is now occupying the B.R. Hester Complex located at the corner of Parkview Drive and Emerald Drive in Clute Municipal Park. This complex houses the Parks and Recreation Department offices, the Clute Visitors Bureau office, the Clute Event Center, and the Clute Fitness Center. The office hours are Monday through Friday 8:00 am - 5:00 pm. You may reserve a facility, make payments, conduct business with the parks department at the new location"}, {"url": "https://en.wikipedia.org/wiki/Angleton,_Texas", "passage_text": "Angleton is a city in and the county seat of Brazoria County, Texas, United States, within the Houston–The Woodlands–Sugar Land metropolitan area. Angleton lies at the intersection of State Highway 288, State Highway 35, and the Union Pacific Railroad. The population was 18,862 at the 2010 census. Angleton is located near the center of Brazoria County at 29°9′59″N 95°25′41″W﻿ / ﻿29.16639°N 95.42806°W﻿ / 29.16639; -95.42806 (29.166478, -95.428122). Texas State Highway 288, a four-lane freeway, runs along the western edge of the city, with access from five exits."}, {"url": "http://www.ci.clute.tx.us/pages/index.php", "passage_text": "Thursday, October 22, 2015 City Council Meeting at 7:00 p.m. FAIR HOUSING AND EQUAL OPPORTUNITY. The City of Clute affirmatively supports the efforts of the Federal Government and the State of Texas to assure equal access to all Americans to rental housing and homeownership opportunities."}, {"url": "https://en.wikipedia.org/wiki/Clute,_Texas", "passage_text": "Clute was incorporated in May 1952 under the name Clute City, with a commission form of government; in 1955 the town changed its name back to Clute and adopted an alderman (city council) form of government. According to the United States Census Bureau, the city has a total area of 5.6 square miles (15 km 2), of which, 5.3 square miles (14 km 2) of it is land and 0.3 square miles (0.78 km 2) of it (5.14%) is water. Clute's history began at the junction of the old Calvit and Eagle Island Plantations. Alexander Calvit, one of Stephen F. Austin 's Old Three Hundred, obtained title to the land in 1824. Eagle Island Plantation belonged to Jared Groce, the richest man in Austin's Colony"}, {"url": "https://en.wikipedia.org/wiki/Clute,_Texas", "passage_text": "Clute is a city in Brazoria County, Texas within the Houston–Sugar Land–Baytown metropolitan area. According to the United States Census Bureau, the city has a total area of 5.6 square miles (15 km 2), of which, 5.3 square miles (14 km 2) of it is land and 0.3 square miles (0.78 km 2) of it (5.14%) is water. Clute's history began at the junction of the old Calvit and Eagle Island Plantations. Alexander Calvit, one of Stephen F. Austin 's Old Three Hundred, obtained title to the land in 1824. Eagle Island Plantation belonged to Jared Groce, the richest man in Austin's Colony"}, {"url": "http://www.crescentwoodapts.com/", "passage_text": "Welcome to Crescentwood Apartments. Live in one of the coziest apartments in Clute, TX and surround yourself with beautiful landscaping, charming homes, and thoughtful amenities. Take a swim in our gorgeous pool, stroll through our pet-friendly community or have a day out with the kids in our on-site park. If you're looking for a home close to Lake Jackson or want to experience the perks of a wonderful apartment home in a convenient location, Crescentwood is the place for you in Clute."}]