[{"url": "https://en.wikipedia.org/wiki/Tower_block", "passage_text": "A tower block, high-rise, apartment tower, residential tower, apartment block, block of flats, or office tower is a tall building or structure used as a residential and/or office building. In some areas it may be referred to as an MDU, standing for Multi Dwelling Unit. "}, {"url": "http://articles.latimes.com/2013/feb/13/business/la-fi-home-elevators-20130213", "passage_text": "In Los Angeles County, permit fees will add to the cost of a home elevator in the cities of Los Angeles, La Canada-Flintridge and Manhattan Beach. A standard-size elevator is 12 to 15 square feet, and a mid-size is 15 to 18 square feet. Some luxury homes will have even larger commercial elevators or more than one lift. With so many variables, costs can range from $25,000 to $125,000 or more to add an elevator to an existing house. Hoping to tap into the growing demand for design-oriented elevators, Elevator Boutique of Australia opened a showroom this year in the Pacific Design Center in West Hollywood"}, {"url": "http://www.answers.com/Q/How_much_does_a_residential_elevator_cost", "passage_text": "There will be a fixed cost for a given mechanical system (motor, controls, etc), plus an incremental cost for the height of the lift (shaft, cables) and the size and weight of the car. Many car features will also drive up the cost: gate/door/enclosures, lighting, air conditioning, emergency lighting, etc. So, for a one home project, figure $100 and then add on upgrades beyond basic construction, concrete work (flatwork), landscaping, etc.     It is easy to spend $200 to $300 or more per square foot, and that is before the land cost."}, {"url": "http://www.goftp.com/qna/How_much_does_it_cost_to_install_an_elevator-qna68570.html", "passage_text": "To make an elevator costs a lot to the user.... 4. 0. To make an elevator costs a lot to the user as the average elevator will cost you between 15000$ to 25000$ and that does not include the cost for the maintainance in future.. How an elevator is installed and operated also influences the cost of residential elevators. The cost o lies approximately between $15,000 and $20,000, with the Nominal types bottoming out at about $10,000 and the most exclusive reaching up to $100,000 and beyond."}, {"url": "http://www.goftp.com/qna/How_much_does_it_cost_to_install_an_elevator-qna68570.html", "passage_text": "Commerical elevators can cost tens of thousands of dollars. The cost to install will depend on how large the building is and how many floors. A 2 story building will be much cheaper than a 50 story building. Commercial elevators can be quite sturdy so they are more expensive than passenger ones. How an elevator is installed and operated also influences the cost of residential elevators. The cost o lies approximately between $15,000 and $20,000, with the Nominal types bottoming out at about $10,000 and the most exclusive reaching up to $100,000 and beyond."}, {"url": "http://articles.latimes.com/2013/feb/13/business/la-fi-home-elevators-20130213", "passage_text": "The average cost for a basic two-stop home elevator in a new home is $21,000 to $25,000, experts say. Three stops run from $28,000 to $30,000 and costs increase for customized cabs, as the residential cars are called. Adding an elevator within an existing home can easily double the expense. A standard-size elevator is 12 to 15 square feet, and a mid-size is 15 to 18 square feet. Some luxury homes will have even larger commercial elevators or more than one lift. With so many variables, costs can range from $25,000 to $125,000 or more to add an elevator to an existing house."}, {"url": "http://www.cmdgroup.com/smartbuildingindex/elevators/costs/", "passage_text": "Hydraulic Piston-When figuring the cost for a hydraulic elevator, make sure that the excavation for the elevator piston is included in the estimate. For each floor above grade that the elevator is to travel, there should be an equal length of piston below grade. Dumbwaiters and elevators are estimated and purchased in a method similar to buying a car. The manufacturer has a base unit with standard features. Added to this base unit price will be whatever options the owner or specifications require."}, {"url": "http://www.fixr.com/costs/elevator-installation", "passage_text": "So, for the purpose of this discussion we will consider the needs and costs of installing a 15 square foot hydraulic elevator of average design, in a pre-existing home, which would adhere to the average pricing of $15,000 to $16,000 for the project. The costs associated with selling an existing home and relocating to a new home can be quite exorbitant, but this is a common solution for millions of people with mobility issues who can no longer manage the stairs in their home. Instead of leaving their home, however, they could opt for the installation of an elevator. According to Jay Romano, in the New York Times, the average cost of a residential elevator installation is $15,000. This sort of elevator would be able to manage weights of 500 to 1,000 pounds and rise around 50 feet in total distance"}]