[{"url": "https://en.wikipedia.org/wiki/Skeletal_striated_muscle", "passage_text": "The myofibrils are composed of actin and myosin filaments, repeated in units called sarcomeres, the basic functional units of the muscle fiber. The sarcomere is responsible for the striated appearance of skeletal muscle, and forms the basic machinery necessary for muscle contraction. Skeletal muscle is a form of striated muscle tissue which is under the voluntary control of the somatic nervous system. It is one of three major muscle types, the others being cardiac muscle and smooth muscle. Most skeletal muscles are attached to bones by bundles of collagen fibers known as tendons"}, {"url": "http://training.seer.cancer.gov/anatomy/muscular/structure.html", "passage_text": "Structure of Skeletal Muscle. A whole skeletal muscle is considered an organ of the muscular system. Each organ or muscle consists of skeletal muscle tissue, connective tissue, nerve tissue, and blood or vascular tissue. Skeletal muscles vary considerably in size, shape, and arrangement of fibers. An individual skeletal muscle may be made up of hundreds, or even thousands, of muscle fibers bundled together and wrapped in a connective tissue covering. Each muscle is surrounded by a connective tissue sheath called the epimysium. Fascia, connective tissue outside the epimysium, surrounds and separates the muscles."}, {"url": "https://en.wikipedia.org/wiki/Skeletal_striated_muscle", "passage_text": "Skeletal muscle is made up of individual muscle cells or myocytes, known as muscle fibers. They are formed from the fusion of developmental myoblasts (a type of embryonic progenitor cell that gives rise to a muscle cell) in a process known as myogenesis. Muscle fibres are cylindrical, and multinucleated. Skeletal muscle is a form of striated muscle tissue which is under the voluntary control of the somatic nervous system. It is one of three major muscle types, the others being cardiac muscle and smooth muscle. Most skeletal muscles are attached to bones by bundles of collagen fibers known as tendons"}, {"url": "https://answers.yahoo.com/question/index?qid=20111119175138AA4112d", "passage_text": "Another name for a skeletal muscle cell is? a. muscle fiber b. fascicle c. aponeurosis d. fascia 2. which is not true of the myelin sheath? a. it's associated with white fibers in the brain b. it's important for nerve impulse conduction c. it covers cell bodies in... show more 1. "}, {"url": "http://www.answers.com/Q/What_is_the_scientific_name_for_a_skeletal_muscle_cell", "passage_text": "As its name suggests, most skeletal muscle is attached to bones by bundles of collagen fibers called tendons. The muscle fibers that make up skeletal muscle are called myofibers and consist of long, cylindrical, multinucleated cells. These cells are made of actin and myosin fibers repeated as a sacromere. Therefore skeletal muscle cells are long, cylindrical, multinucleated cells made of actin and myosin myofibers. They come together to create the fibers which make up tissues such as skeletal muscle tissue. Skeletal muscle is a form of striated muscle tissue existing under control of the somatic nervous system. It is one of three major muscle types, the others being cardiac and s … mooth."}, {"url": "http://training.seer.cancer.gov/anatomy/muscular/structure.html", "passage_text": "Each skeletal muscle fiber is a single cylindrical muscle cell. An individual skeletal muscle may be made up of hundreds, or even thousands, of muscle fibers bundled together and wrapped in a connective tissue covering. Each muscle is surrounded by a connective tissue sheath called the epimysium. Fascia, connective tissue outside the epimysium, surrounds and separates the muscles."}, {"url": "http://courses.washington.edu/conj/motor/musclereview.htm", "passage_text": "Since muscle cells are elongated and cylindrical, each muscle cell is usually called a muscle fiber. In skeletal muscle, the muscle fibers are very large, multinucleated, and up to several millimeters in length. "}, {"url": "https://en.wikipedia.org/wiki/Muscle_cell", "passage_text": "A myocyte (also known as a muscle cell) is the type of cell found in muscle tissue. Myocytes are long, tubular cells that develop from myoblasts to form muscles in a process known as myogenesis. There are various specialized forms of myocytes: cardiac, skeletal, and smooth muscle cells, with various properties. "}, {"url": "http://starklab.slu.edu/PhysioLab/NKPhysioMuscleAnswer.htm", "passage_text": "2. List the three types of contractile cells in the body. Skeletal muscle cells, cardiac muscle cells, and smooth muscle cells. 3-5. Give the shapes for each of the three muscle types. Skeletal muscles are elongated, cardiac muscles are branched, and smooth muscles are spindle-shaped. 6-11. "}]