[{"url": "http://healthquestions.medhelp.org/symbicort-hoarseness", "passage_text": "There are three versions-Advir Hfa, Symbicort and Dulera is the newest. They do not cause the throat irritation and hoarseness that the dry powder do. With COPD it is vital that you stop lung function loss as it is irreversible. I also take symbicort and I have to for the rest of my life, take this and wash my mouth out after every use. Read More. headache, dizziness, nervousness; sleep problems (insomnia); cough, hoarseness, sore throat, runny or stuffy nose; dry mouth and throat; muscle pain; or diarrhea."}, {"url": "http://www.rxlist.com/script/main/rxlist_view_comments.asp?drug=symbicort&questionid=fdb148393_pem", "passage_text": "Before the Symbicort, I was on Advair. I was constantly hoarse and coughing, and my results began to be worse. So, onto the Symbicort, which did seem to help...for a while. Now, I am only slightly better than I was with the Advair, and I have some unpleasant symptoms that may be from this medication. "}, {"url": "http://healthquestions.medhelp.org/symbicort-side-effects-hoarseness", "passage_text": "Read More. If a steroid inhaler is required to control your symptoms, then try the one that gives the best delivery method to the lungs. I have used symbicort for years, and it only caused hoarseness for me when I do a lot of load talking (say in a noisy restaurant). Perhaps you will have to get your students to learn to listen to you when speaking in softer tones. A direct definition from drugs.com states: albuterol side effects Stop using Albuterol and get emergency medical help if you have any of these signs of an allergic reaction: hives; difficulty breathing; swelling of your face, lips, tongue, or throat."}, {"url": "http://www.domorewithoxygen.com/bid/281560/COPD-and-Hoarseness-What-You-Can-Expect", "passage_text": "For those with COPD, hoarseness can become a part of everyday life, so it’s important not to let it get you down. For tips fending off low feelings caused by COPD, click here. Topics: COPD, hoarseness. Arthur Strohmer I now use both Spiriva and Symbicort. The most common cause of hoarseness in an individual without COPD is acute laryngitis caused by an upper respiratory tract infection, according to MedicineNet.com. Less common causes for those without COPD are misuse of the voice (such as from yelling or improper singing technique) and cold or flu."}, {"url": "http://healthquestions.medhelp.org/symbicort-hoarseness", "passage_text": "Read More. If a steroid inhaler is required to control your symptoms, then try the one that gives the best delivery method to the lungs. I have used symbicort for years, and it only caused hoarseness for me when I do a lot of load talking (say in a noisy restaurant). Perhaps you will have to get your students to learn to listen to you when speaking in softer tones. I also take symbicort and I have to for the rest of my life, take this and wash my mouth out after every use. Read More. headache, dizziness, nervousness; sleep problems (insomnia); cough, hoarseness, sore throat, runny or stuffy nose; dry mouth and throat; muscle pain; or diarrhea."}, {"url": "http://www.inspire.com/groups/american-lung-association-copd/discussion/symbicort-and-hoarse-voice/", "passage_text": "I have taken symbicort for years now which seems to work well but my voice is hoarse no matter how many times I rinse my mouth. Does anyone have a remedy for this problem. Reply Report post. Your throat gets hoarse because the medicine in any of these inhalers dialates the bronchial tubes, which then press on the area of vocal chords, causing the hoarsness. This is what your inhaler is supposed to do. The hoarseness is a harmless side effect of the medicine at work."}, {"url": "http://www.peoplespharmacy.com/2009/07/20/lung-inhaler-da/", "passage_text": "Thank you for alerting me to this side effect. I stopped taking the Advair 10 days ago after my doctor changed my medication, and my voice is gradually returning to normal. A. The steroid fluticasone found in Advair and Flovent can cause hoarseness, throat irritation and cough. These complications appear more common than many health professionals realize (Journal of Laryngology and Otology, Oct. 2008). I have been using Advair inhaler for about 6 months for Asthma And COPD. My voice became hoarse, which I knew was a side effect and can deal with. Also a slight cough and clearing my throat became apparent. What is happening with me now; Every once in a while (about once every week or two weeks), I get a sore throat"}, {"url": "http://www.getbetterhealth.com/some-asthma-inhalers-can-cause-fungal-laryngitis-thrush-of-the-voice-box/2011.06.14", "passage_text": "June 14th, 2011 by ChristopherChangMD in Health Tips. It is a big bummer to be an asthmatic. Not only is breathing a problem, but even the treatment for asthma can cause problems. Take for example steroid inhalers like advair, symbicort, fluticasone, etc."}]