[{"url": "https://en.wikipedia.org/wiki/Rheumatoid_arthritis", "passage_text": "Rheumatoid arthritis (RA) is a long lasting autoimmune disorder that primarily affects joints. It typically results in warm, swollen, and painful joints. Pain and stiffness often worsen following rest. Most commonly the wrist and hands are involved with typically the same joints involved on both sides of the body. While the cause of rheumatoid arthritis is not clear, it is believed to involve a combination of genetic and environmental factors. The underlying mechanism involves the body's immune system attacking the joints. This results in inflammation and thickening of the joint capsule."}, {"url": "http://www.medicinenet.com/script/main/art.asp?articlekey=60768", "passage_text": "Rheumatoid arthritis (RA) is an inflammatory disease that causes pain, swelling, stiffness, and loss of function in the joints. It occurs when the immune system, which normally defends the body from invading organisms, turns its attack against the membrane lining the joints. Features of Rheumatoid Arthritis. 1  Tender, warm, swollen joints. 2  Symmetrical pattern of affected joints. 3  Joint inflammation often affecting the wrist and finger joints closest to the hand. 4  Joint inflammation sometimes affecting other joints, including the neck, shoulders, elbows, hips, knees, ankles, and feet."}, {"url": "http://emedicine.medscape.com/article/331715-clinical", "passage_text": "Juvenile idiopathic arthritis (JIA), sometimes referred to as juvenile rheumatoid arthritis (JRA), is the most common form of childhood arthritis. In most patients, the immunogenic associations, clinical pattern, and functional outcome of JIA are different from those of adult-onset RA. "}, {"url": "http://conditions.about.com/cc/rheumatoid-arthritis/overview/what-is-rheumatoid-arthritis/typical-features", "passage_text": "Joints Affected. With rheumatoid arthritis, there is typically involvement of the wrist joints as well as the finger joints closest to the hand. Evidence of wrist and hand involvement usually occurs early in the course of the disease. Small joints of the feet are characteristically involved as well. Morning stiffness is also a well-known characteristic of rheumatoid arthritis. People with rheumatoid arthritis usually wake with considerable stiffness in the affected joints."}, {"url": "http://www.niams.nih.gov/health%5Finfo/rheumatic%5Fdisease/", "passage_text": "Rheumatoid arthritis has several features that make it different from other kinds of arthritis. (See box “Features of Rheumatoid Arthritis.”) For example, rheumatoid arthritis generally occurs in a symmetrical pattern, meaning that if one knee or hand is involved, the other one also is. The disease often affects the wrist joints and the finger joints closest to the hand. 1 Rest and exercise: People with rheumatoid arthritis need a good balance between rest and exercise, with more rest when the disease is active and more exercise when it is not. 2  Rest helps to reduce active joint inflammation and pain and to fight fatigue."}, {"url": "http://www.ncbi.nlm.nih.gov/pubmedhealth/PMH0001467/", "passage_text": "About RA. Rheumatoid arthritis (RA) is a disease that causes pain, swelling, and stiffness in the joints. In some people, it can also cause the joints to become damaged and deformed. "}, {"url": "http://www.medicinenet.com/script/main/art.asp?articlekey=60768", "passage_text": "For example, rheumatoid arthritis generally occurs in a symmetrical pattern, meaning that if one knee or hand is involved, the other one also is. The disease often affects the wrist joints and the finger joints closest to the hand. Features of Rheumatoid Arthritis. 1  Tender, warm, swollen joints. 2  Symmetrical pattern of affected joints. 3  Joint inflammation often affecting the wrist and finger joints closest to the hand. 4  Joint inflammation sometimes affecting other joints, including the neck, shoulders, elbows, hips, knees, ankles, and feet."}, {"url": "http://www.niams.nih.gov/health%5Finfo/rheumatic%5Fdisease/", "passage_text": "Rheumatoid arthritis (RA) is an inflammatory disease that causes pain, swelling, stiffness, and loss of function in the joints. It occurs when the immune system, which normally defends the body from invading organisms, turns its attack against the membrane lining the joints. 1 Rest and exercise: People with rheumatoid arthritis need a good balance between rest and exercise, with more rest when the disease is active and more exercise when it is not. 2  Rest helps to reduce active joint inflammation and pain and to fight fatigue."}, {"url": "http://www.webmd.com/rheumatoid-arthritis/guide/rheumatoid-arthritis-symptoms", "passage_text": "1 Stiffness. 2  The joint is harder to use and doesn't move as well as it should. 3  It’s especially common in the morning. 4  While many people with other forms of arthritis have stiff joints in the morning, it takes people with rheumatoid arthritis more than an hour (sometimes several hours) before their joints feel loose. 1 It’s especially common in the morning. 2  While many people with other forms of arthritis have stiff joints in the morning, it takes people with rheumatoid arthritis more than an hour (sometimes several hours) before their joints feel loose. 3  Swelling."}]