[{"url": "http://forums.roadbikereview.com/components-wrenching/removing-bar-tape-217584.html", "passage_text": "The only tape I use is to anchor the start of the wrap at the bar end, and at the finish of the wrap to hold it at the stem. Before you criticize someone walk a mile in their shoes. That way when you criticize them you'll be a mile away & you'll have their shoes. Before you criticize someone walk a mile in their shoes. Yesterday, I attempted to retape my handlebar but had a hell of time taking the old tape off. It’s amazing how strong they make the adhesive on these tapes. I had to scrap off the tape in chunks. It took almost 20 min to get the tape off of one side."}, {"url": "http://bicycles.stackexchange.com/questions/11216/how-to-clean-white-handlebar-tape", "passage_text": "It comes in a spray bottle initially. I use it to clean my bicycle rather than soap and water. It is safe to use and doesn't harm the paint. Just spray it on the bike or a soft cloth, and wipe the grease and dirt/dust off easily. No need to rinse the bike. It should gently remove the dirt/sweat from your handlebar tape. If the grips are cork, use just a little Simple Green on a soft cloth and wipe gently and remove from the tape. Don't allow the Simple Green to stay on the tape for an extended period (which is determined by the strength you mix the Simple Green)."}, {"url": "http://sheldonbrown.com/handlebar-tape.html", "passage_text": "Whether you start from the middle or from the ends, make sure to go in the same direction on both sides. I generally start from the underside of the bar, with the tape feeding outwards. You can do it the other way too, but make sure you follow the same pattern on both sides. "}, {"url": "http://velo-orange.blogspot.com/2009/01/shellac-and-bar-tape-guide.html", "passage_text": "If you use aero brake levers or brifters, secure the cables to the bars with electrical tape or metal foil tape. Tape your bars and put a wrap of masking tape (or any type of tape) around the center section of the bar to keep shellac off. Spread a drop cloth under your bike, or roll it outside. I don't bother to mask-off the bike because any shellac dripped on it can easily be wiped off with a paper towel dipped in alcohol. "}, {"url": "http://www.bike198.com/bar-tape-installation-wrap-your-drop-handlebars/", "passage_text": "Using black electrical tape (or tape provided with your bar tape), tightly wrap the end of the bar tape to the handlebars to secure it in place. I like to do several, tight wraps to really make sure everything is in place and secure. Install Note: How far you wrap the bars up the handlebars on your road bike is a personal preference and dependent upon how much bar tape you have available. Personally, with flat surface bars like the K-Wings, I do not need/want the tape to extend all the way to the center of the bars on the top."}, {"url": "http://www.youtube.com/watch?v=cwTgZ4r4_cg", "passage_text": "Please try again later. Mark, from Performance Bicycle, demonstrates the proper way to wrap road bike handlebars with handlebar tape, using our Forte Forté-Grip Tec Handlebar: tape://http.www.performancebike/com/... Bikes visit://http.www.performancebike com for all your cycling, needs great, values and good deals every. day "}, {"url": "http://www.youtube.com/watch?v=w8PqH7bltJQ", "passage_text": "Wrap bar tape like a pro with Daniel Lloyd! Changing the handlebar tape on your road bike is something of an art, and we look at how to get it right. Follow GCN on YouTube: http://gcn.eu/gcnsubs."}, {"url": "http://www.slowtwitch.com/Tech/Bar_Tape_How-To_Road_3401.html", "passage_text": "I terminate my bar tape so it lines up exactly with the end of my last wrap of electrical tape (the electrical tape that is holding the cable housings down). Use scissors to cut the tape off. You re cutting the tape at an angle, but the result is a straight end (perpendicular to the handlebar). "}, {"url": "http://branfordbike.com/articles/handlebar-taping-tips-pg74.htm", "passage_text": "In the picture below, the tape should end at the sleeve. Use a sharp knife and make a superficial cut in the tape ONLY along the ending line. Be careful not to scratch or score the aluminum handlebar as this will weaken it. Back tape off two wraps and use scissors to extend the cut all the way through the tape. Maintain the line shown by the cut and cut the tape cleanly. Finish wrapping the tape. Cut the tape so the end is at the bottom of your handlebar. Use Cafe/3M Finishing Tape to end your wrap. We often use Cafe tape and then add a Le Tour finishing strip for extra security and great looks.We do not recommend electrician's tape because it will slip and eventually fall off. "}]