[{"url": "http://www.webmd.com/drugs/2/drug-6365/tylenol-pm-extra-strength-oral/details", "passage_text": "Get medical help right away if you take too much acetaminophen (overdose), even if you feel well. Overdose symptoms may include nausea, vomiting, loss of appetite, sweating, stomach / abdominal pain, extreme tiredness, yellowing eyes / skin, and dark urine. How to use Tylenol PM Extra Strength. See also Warning section. If you are taking an over-the-counter product, read all directions on the product package before taking this medication. If you have any questions, consult your pharmacist."}, {"url": "http://articles.mercola.com/sites/articles/archive/2010/08/03/tylenol-pm-causes-brain-damage.aspx", "passage_text": "Anticholinergic drugs are available both over-the-counter and by prescription, as medications used for a variety of symptoms can have this effect. Examples include night-time pain relievers, antihistamines, and other sleep aids, such as: 1  Excedrin PM. 2  Tylenol PM. 3  Nytol. 4  Sominex. 5  Unisom. 6  Benadryl. 7  Dramamine. "}, {"url": "https://en.wikipedia.org/wiki/Nyquil", "passage_text": "Vicks NyQuil is a brand of over-the-counter medication manufactured by Procter & Gamble intended for the relief of various symptoms of the common cold. All medications within the NyQuil imprint contain sedating antihistamines, hypnotics, or alcohol, and are intended to be taken before sleep. Nyquil Sinus' active ingredients are: 1  Acetaminophen (pain reliever/fever reducer). 2  Doxylamine succinate (antihistamine/hypnotic). 3  Phenylephrine (nasal decongestant)."}, {"url": "http://www.unisom.com/common-questions/", "passage_text": "SleepGels: The active sleep-aid ingredient is diphenhydramine HCl (50 mg/dose). SleepTabs: SleepTabs contain doxylamine succinate (25 mg/dose). SleepMinis: The active sleep-aid ingredient is Diphenhydramine HCl (50 mg/dose). Unisom Liquid: The active sleep-aid ingredient is diphenhydramine HCl (50 mg/dose or 30mL/dose). SleepMelts: The active sleep-aid ingredient is diphenhydramine HCl (50 mg/dose). PM Pain: The active sleep-aid ingredient is diphenhydramine HCl (50 mg/dose). PM Pain also contains the pain reliever acetaminophen (3"}, {"url": "http://www.webmd.com/drugs/2/drug-6365/tylenol-pm-extra-strength-oral/details", "passage_text": "Before taking this medication, tell your doctor or pharmacist if you are allergic to acetaminophen or antihistamines; or if you have any other allergies. This product may contain inactive ingredients, which can cause allergic reactions or other problems. How to use Tylenol PM Extra Strength. See also Warning section. If you are taking an over-the-counter product, read all directions on the product package before taking this medication. If you have any questions, consult your pharmacist."}, {"url": "https://www.datalounge.com/thread/13338870-tylenol-pm-or-advil-pm-", "passage_text": "You're talking Benadryl every time you take Tylenol PM or Advil PM. Benadryl is the same medicine in the PM products: diphenhydramine, Tylenol PM is acetaminophen (generic Tylenol) and diphenhydramine (generic Benadryl), Advil PM is ibuprofen and dyphenhydramine. [quote]You are, however, much less likely to damage your liver with Advil PM. True, but you're more likely to damage your stomach. OP, you shouldn't take unnecessary pain meds when all you need is a sleep aid. Try Benadryl or generic diphenhydramine, or Unisom or generic doxylamine."}, {"url": "https://www.datalounge.com/thread/13338870-tylenol-pm-or-advil-pm-", "passage_text": "You can get the ingredient in Tylenol PM and Advil PM that makes you sleepy without getting the advil or tylenol. Diphenhydramine HCI is used in ZzzQUIL, Sominex and other sleep products. I buy a nighttime sleep aid from Walmart that has 25mg of Diphenhydramine HCI, their brand of Equate Nighttime sleep aid. [quote]You are, however, much less likely to damage your liver with Advil PM. True, but you're more likely to damage your stomach. OP, you shouldn't take unnecessary pain meds when all you need is a sleep aid. Try Benadryl or generic diphenhydramine, or Unisom or generic doxylamine."}, {"url": "https://www.consumerhealthdigest.com/sleep-aid-reviews/tylenol-pm.html", "passage_text": "Tylenol PM is made from acetaminophen and diphenhydramine HCI. This is actually a pain reliever that is considered to be non-habit forming. That’s because it doesn’t contain aspirin. More importantly, it’s mild enough that won’t irritate your stomach. It basically helps you get the sleep you need at night. However, Tylenol PM is more than just a sleep aid. It relieves you from headaches and pains that plague you at night. When you don’t feel well, you lose sleep. You get up in the morning feeling tired and listless, and a result, you can’t function well during the day"}]