[{"url": "http://extension.illinois.edu/herbs/chives.cfm", "passage_text": "1 Garlic Chives (Allium tuberosum) – Also called Chinese Chives. 2  Similar in appearance to garden chives but leaves are flat and not round and flowers are white not pink. 3  Growing to about 12-18 inches. 4  Culture is the same as for garden chives. 1 ‘Staro’ Chives – Extra thick dark leaves. 2  Garlic Chives (Allium tuberosum) – Also called Chinese Chives. 3  Similar in appearance to garden chives but leaves are flat and not round and flowers are white not pink. 4  Growing to about 12-18 inches. 5"}, {"url": "http://www.petpoisonhelpline.com/poison/chives/", "passage_text": "Share. Onions, garlic, chives, and leeks are of the Allium family, and are poisonous to both dogs and cats. Garlic is considered to be about 5X as potent as onions. Certain breeds and species seem to be more sensitive: Japanese breeds of dogs (e.g., Akita, Shiba Inu) and cats"}, {"url": "http://www.herbinfosite.com/?page_id=346", "passage_text": "Fresh ChivesFresh Chives. INTRODUCTION: Chives are a well-known member of the onion family. Chives are the meekest of the all the onions. This herb is native to Britain, Northern Europe and North America. They are the easiest to grow of the fresh herbs used for culinary purposes. Chives are found in many English, French and German gardens."}, {"url": "http://foodfacts.mercola.com/chives.html", "passage_text": "Chives are an excellent source of vitamin A –145 percent of the daily recommended value per 100 grams – more than any other allium, and with it, carotenes, which are flavonoid antioxidants like zeaxanthin and lutein that protect you from lung and mouth cancers. Like other allium members, chives contain antioxidants that kill free radicals. Thiosulfinites like allyl propyl disulfide and diallyl disulfide (known to inhibit breast cancer cells) contain enzymes that convert to allicin when its leaves are cut or crushed."}, {"url": "http://foodfacts.mercola.com/chives.html", "passage_text": "Chives are an attractive garnish for green salads, taste great when sprinkled on grilled fish or baked potatoes, and add dimension to creamy potato soup. They're delicious stirred up in mashed potatoes fines herbes (the classic French combination of chervil, parsley, chives, and tarragon) with a dollop of sour cream. Like other allium members, chives contain antioxidants that kill free radicals. Thiosulfinites like allyl propyl disulfide and diallyl disulfide (known to inhibit breast cancer cells) contain enzymes that convert to allicin when its leaves are cut or crushed."}, {"url": "http://www.nutrition-and-you.com/chives.html", "passage_text": "Chives nutrition facts. Sweet, mild-onion flavored chives are fresh top greens in the onion family of bulb vegetables. Its stiff, hollow, tubular leaves appear similar to that of onions, but smaller in diameter, and appear somewhat like grass from a distance."}, {"url": "http://foodfacts.mercola.com/chives.html", "passage_text": "Not just a tasty garnish or baked potato topping, chives are considered both a healing herb and an allium vegetable related to onions and garlic. Flavor-wise, these tall, graceful garden additions can be compared to a mild cross between garlic and leeks (although chives are Lilliputian next to leeks). Like other allium members, chives contain antioxidants that kill free radicals. Thiosulfinites like allyl propyl disulfide and diallyl disulfide (known to inhibit breast cancer cells) contain enzymes that convert to allicin when its leaves are cut or crushed."}, {"url": "http://www.livestrong.com/article/407900-health-benefits-of-chives/", "passage_text": "If the only time you consume chives is when you order a fast food baked potato, you might be missing out on many health benefits. Chives are members of the allium family, which also includes garlic, onions, scallions and leeks. You can find chives in most grocery stores, but they are also simple to grow in your backyard or container garden. "}, {"url": "http://extension.illinois.edu/herbs/chives.cfm", "passage_text": "Description. Chives belong to the same family as onion, leeks and garlic. They are a hardy, drought-tolerant perennial growing to about 10-12 inches tall. They grow in clumps from underground bulbs and produce round, hollow leaves that are much finer than onion. 1 ‘Staro’ Chives – Extra thick dark leaves. 2  Garlic Chives (Allium tuberosum) – Also called Chinese Chives. 3  Similar in appearance to garden chives but leaves are flat and not round and flowers are white not pink. 4  Growing to about 12-18 inches. 5  Culture is the same as for garden chives."}]