[{"url": "http://www.ehow.com/info_8206359_credit-debit-card-declined.html", "passage_text": "Jupiterimages/Polka Dot/Getty Images. When you make a purchase with your credit or debit card or you attempt to withdraw money from an ATM, you may find your card has been declined. There are a variety of reasons for credit and debit card decline, such as reasons associated with your balance, security and other reasons. Although a credit or debit card decline is an inconvenient and embarrassing event, it often occurs to protect you card's security. To avoid declines, review your financial institution's rules and regulations on balances and the maximum allowed transactions."}, {"url": "http://www.debitcards.com.au/why-does-my-debit-card-get-declined/", "passage_text": "Another reason for a card to be declined is if the card is going to go over its daily spending limit. Cards can also be declined if the security has been compromised, the card has been cloned or there is thought to be some suspicion of fraud (even if this proves to be groundless). Posted on July 30, 2010 by Amy. Having a debit card declined can be puzzling, but there are a number of reasons why a debit card may be declined. One of the most common reasons for declining a debit card is that the card has expired. This will mean that the debit card is no longer being used and a replacement has been sent"}, {"url": "http://www.bankrate.com/finance/credit-cards/reasons-credit-card-declined-1.aspx", "passage_text": "We've all been there -- a perfect moment shattered by the disgrace of a declined credit card. Maybe it was a flawless date -- romantic ambiance, carefree banter, flirty eyes -- ruined by that record-scratching moment when your waiter tells you in hushed tones that your credit card didn't go through.. "}, {"url": "http://www.lowcards.com/credit-cards-declined-34289", "passage_text": "Despite your embarrassment, the merchant is often responsible for your credit card being declined. For example, a retailer's credit card terminal may not be able to communicate with the payment network, or a telephone representative may input your number incorrectly. Account issues. Despite the fact that many credit cards are declined due to no fault of the cardholder, there are also some instances where purchases are declined due to issues with their account. Obviously, your card will be declined if it is expired, or if it has been previously reported lost or stolen."}, {"url": "http://www.debitcards.com.au/why-does-my-debit-card-get-declined/", "passage_text": "Another reason why there could be a declined debit card is that there are insufficient funds in the underlying account. Debit cards do not have funds of their own and they rely on underlying accounts. Posted on July 30, 2010 by Amy. Having a debit card declined can be puzzling, but there are a number of reasons why a debit card may be declined. One of the most common reasons for declining a debit card is that the card has expired. This will mean that the debit card is no longer being used and a replacement has been sent"}, {"url": "http://classroom.synonym.com/debit-card-being-declined-gas-pumps-12175.html", "passage_text": "Card Issues. Other issues that can cause your card to be declined at the pump may be linked directly to your debit card. Some card issuers can restrict or prohibit card use for prepayment at gas pumps. Authorization Declines. Most gas stations have a “pay-at-the-pump” feature that allows you to insert your debit or credit card at the pump and authorize payment before you dispense gas. Your bank or the gas station's payment processors may set different authorization requirements for prepayment at pumps."}, {"url": "http://virtualpaymentsystem.com/help/knowledgebase.php?article=1", "passage_text": "If you've had a debit or check card payment declined and you have enough money in your account to cover the payment, there are four conditions that can prevent your payment from going through: "}, {"url": "http://classroom.synonym.com/debit-card-being-declined-gas-pumps-12175.html", "passage_text": "System Issues. When you use a debit card to pay for gas, your card information is captured by the station’s payment processor and sent to your bank to verify funds before your transaction is authorized. If either the station’s payment system is down, or your bank’s system is down, your transaction can be declined. Authorization Declines. Most gas stations have a “pay-at-the-pump” feature that allows you to insert your debit or credit card at the pump and authorize payment before you dispense gas. Your bank or the gas station's payment processors may set different authorization requirements for prepayment at pumps."}]