[{"url": "http://www.cancer.org/treatment/understandingyourdiagnosis/examsandtestdescriptions/understanding-your-lab-test-results", "passage_text": "The most common lab test that you’ll have done during treatment is called a complete blood count, or CBC. Blood is made up of water, proteins, nutrients, and living cells. A CBC tells your health care team about the cells in your blood. It measures 3 basic types of blood cells: "}, {"url": "http://www.mayoclinic.org/tests-procedures/complete-blood-count/basics/definition/prc-20014088", "passage_text": "A complete blood count (CBC) is a blood test used to evaluate your overall health and detect a wide range of disorders, including anemia, infection and leukemia. A complete blood count test measures several components and features of your blood, including: 1  Red blood cells, which carry oxygen. Definition. A complete blood count (CBC) is a blood test used to evaluate your overall health and detect a wide range of disorders, including anemia, infection and leukemia. A complete blood count test measures several components and features of your blood, including: 1  Red blood cells, which carry oxygen. 2  White blood cells, which fight infection."}, {"url": "https://labtestsonline.org/understanding/analytes/cbc/tab/test", "passage_text": "1 White blood cell (WBC) count is a count of the total number of white blood cells in a person's sample of blood. 2  White blood cell differential may or may not be included as part of the panel of tests. 3  It identifies and counts the number of the various types of white blood cells present. 1 Evaluation of platelets, cell fragments that are vital for normal blood clotting: 2  The platelet count is the number of platelets in a person's sample of blood. 3  Mean platelet volume (MPV) may be reported with a CBC. 4  It is a calculation of the average size of platelets."}, {"url": "https://labtestsonline.org/understanding/analytes/cbc/tab/test", "passage_text": "The complete blood count (CBC) is often used as a broad screening test to determine an individual's general health status. It can be used to: 1  Screen for a wide range of conditions and diseases. 2  Help diagnose various conditions, such as anemia, infection, inflammation, bleeding disorder or leukemia, to name just a few. 1 Evaluation of platelets, cell fragments that are vital for normal blood clotting: 2  The platelet count is the number of platelets in a person's sample of blood. 3  Mean platelet volume (MPV) may be reported with a CBC. 4  It is a calculation of the average size of platelets."}, {"url": "http://www.webmd.com/a-to-z-guides/complete-blood-count-cbc", "passage_text": "A complete blood count (CBC) gives important information about the kinds and numbers of cells in the blood, especially red blood cells, white blood cells, and platelets. A CBC helps your doctor check any symptoms, such as weakness, fatigue, or bruising, you may have. A CBC also helps him or her diagnose conditions, such as anemia, infection, and many other disorders. A CBC test usually includes: 1  White blood cell (WBC, leukocyte) count. 2  White blood cells protect the body against infection. 3  If an infection develops, white blood cells attack and destroy the bacteria, virus, or other organism causing it. 4  White blood cells are bigger than red blood cells but fewer in number. 1 White blood cell types (WBC differential). 2  The major types of white blood cells are neutrophils, lymphocytes, monocytes, eosinophils, and basophils. 3  Immature neutrophils, called band neutrophils, are also part of this test. 4  Each type of cell plays a different role in protecting the body."}, {"url": "http://www.medicinenet.com/complete_blood_count/page2.htm", "passage_text": "The complete blood count (CBC) is one of the most commonly ordered blood tests. The complete blood count is the calculation of the cellular (formed elements) of blood. These calculations are generally determined by special machines that analyze the different components of blood in less than a minute. A major portion of the complete blood count is the measure of the concentration of white blood cells, red blood cells, and platelets in the blood."}, {"url": "http://www.webmd.com/a-to-z-guides/complete-blood-count-cbc?page=3", "passage_text": "A complete blood count (CBC) gives important information about the kinds and numbers of cells in the blood, especially red blood cells, white blood cells, and platelets. A CBC helps your doctor check any symptoms, such as weakness, fatigue, or bruising, you may have. "}, {"url": "http://www.emedicinehealth.com/complete_blood_count_cbc/article_em.htm", "passage_text": "Complete Blood Count (CBC) Overview. The complete blood count (CBC) is one of the most commonly ordered blood tests. To understand this test, it is important to know that blood consists of two major parts: plasma and cellular elements. The plasma is the part of the blood that is liquid which allows the blood to flow easily. "}]