[{"url": "http://www1.salary.com/Healthcare-Administrative-Salaries-9.html", "passage_text": "Browse Healthcare -- Administrative jobs by salary range: , $30K-$50K, $50K-$80K, $80K-$100K, or. Search by: Keyword Category. Search. Jobs by Salary Ranges: Click a salary category to find jobs in your target salary range. 1  Six Figure Income jobs ($100,000+). 2  High Income jobs ($80,000 - $100,000). 3  Upper Middle Income jobs ($50,000 - $80,000). 4  Middle Income jobs ($30,000 - $50,000). 5  Entry Level Income jobs ($10,000 - $30,000). "}, {"url": "http://www.payscale.com/research/US/Job=Vice_President_(VP)%2c_Human_Resources_(HR)/Salary", "passage_text": "(United States). The average salary for a Vice President (VP), Human Resources (HR) is $127,873 per year. The highest paying skills associated with this job are International Human Resources (HR), Labor Relations, and Organizational Development. Most people in this job have more than five years' experience in related jobs"}, {"url": "http://www.payscale.com/research/US/Job=Assistant_Vice_President_(AVP)%2c_Regional_Director/Salary", "passage_text": "Assistant Vice President (AVP), Regional Director Tasks. 1  Manage the budget allocated for given region, distributing resources to where they are needed. 2  Report business activities in region to superiors, and make recommendations for improvements to vice president and president. An assistant vice president is usually a regional director who provides high level management for a highly trained staff. These professionals may oversee several different areas, such as operations, marketing, human resources, or legal affairs."}, {"url": "http://www.indeed.com/q-Assistant-Vice-President-Hospital-jobs.html", "passage_text": "Assistant Vice President-Support Operations (1156). Under the general supervision of the Vice President-Support Operations, the Assistant Vice President-Support Operations will assume oversight for leadership... 21 days ago-save job-email-more... The Vice President is a member of senior management and facilitates the achievement of the mission and goals of the hospital.... 9 days ago-save job-email-more... 1  View all Monroe, PA jobs. 2  Salary Search: VP Patient Care Service salaries in Monroe, PA."}, {"url": "http://www.payscale.com/research/US/Job=Assistant_Vice_President_(AVP)%2c_Regional_Director/Salary", "passage_text": "(United States). The average pay for an Assistant Vice President (AVP), Regional Director is $113,384 per year. Most people in this job have more than five years' experience in related jobs. The skills that increase pay for this job the most are Strategic Planning, Budget Management, and Project Management. An assistant vice president is usually a regional director who provides high level management for a highly trained staff. These professionals may oversee several different areas, such as operations, marketing, human resources, or legal affairs."}, {"url": "http://www.salarylist.com/jobs/Assistant-Vice-President-Salary.htm", "passage_text": "Assistant Vice President Salary. Assistant Vice President average salary is $99,729, median salary is $100,000 with a salary range from $24,627 to $275,000. Assistant Vice President salaries are collected from government agencies and companies. Each salary is associated with a real job position"}]