[{"url": "http://www.slate.com/articles/news_and_politics/explainer/2009/12/soluble_dilemma.html", "passage_text": "The assassins typically use sodium hydroxide or potassium hydroxide, strong bases commonly known as lye. (The Times story misidentified their reagent of choice as an acid.) Heated to 300 degrees, a lye solution can turn a body into tan liquid with the consistency of mineral oil in just three hours. You can purchase 8 pounds of it —enough to dissolve a few bodies—from soap-making or farm-supply stores for less than $15. If you can't wait for delivery, pick up some drain cleaner from the supermarket, but it's so dilute that you may need to use quite a few bottles."}, {"url": "https://en.wikipedia.org/wiki/Lye", "passage_text": "Both sodium hydroxide and potassium hydroxide are used in making soap. Sodium hydroxide is often used to make solid soap, while potassium hydroxide is used to make liquid soap. Potassium hydroxide soaps are softer and more easily dissolved in water than sodium hydroxide soaps. Pellets of sodium hydroxide. A lye is a liquid obtained by leaching ashes (containing largely potassium carbonate or potash), or a strong alkali which is highly soluble in water producing caustic basic solutions."}, {"url": "http://www.sciencebuzz.org/blog/dissolving-our-dead-bodies-lye-good-idea-it-going-far-enoug", "passage_text": "This is alkaline hydrolysis. Basically what happens is this: you’re put into a large tank filled with a lye solution, heated up to 300 degrees, and submitted to about 60 pounds of pressure per square inch (about the same as the pressure in a bicycle tire). "}, {"url": "http://www.wisegeek.com/what-is-lye.htm", "passage_text": "In regard to the soapmaking... when lye is used to make soap it undergoes a chemical reaction. There is no longer lye, it is soap. This is why you should let your cold process soaps sit for up to 7 weeks though, so this chemical reaction can complete. Hope this helps you. Lye is a chemical when its mixed with water it can cause chemical burns because of the reaction it has. lye is a base and is neutralized by an acid, vinegar. When Lye is in powder form it is completely harmless until it comes in contact with water."}, {"url": "http://usatoday30.usatoday.com/tech/science/2008-05-08-mortuary-science-lye_N.htm", "passage_text": "The process is called alkaline hydrolysis and was developed in this country 16 years ago to get rid of animal carcasses. It uses lye, 300-degree heat and 60 pounds of pressure per square inch to destroy bodies in big stainless-steel cylinders that are similar to pressure cookers. Since they first walked the planet, humans have either buried or burned their dead. Now a new option is generating interest — dissolving bodies in lye and flushing the brownish, syrupy residue down the drain."}, {"url": "http://www.diynatural.com/sodium-hydroxide-lye/", "passage_text": "Lye is also made from wood ash, but that lye is inconsistent and makes a very soft bar. If you want to learn how to make lye this way, there are many tutorials available on the internet. I’ve wanted to try making Black Soap using banana leaves that is done much the same way. "}, {"url": "https://uk.answers.yahoo.com/question/index?qid=20140220111411AAfa8kG", "passage_text": "What is sprinkled over decomposing bodies? I remember seeing on a tv show that there are two types of lye, one commonly used in gardening and the other to cover dead bodies by killers. My friends say that it is lime and it helps decompose bodies. So will someone who knows what they're talking about explain this... Quicklime (CaO) or Lye (NaOH) will both speed composition of dead bodies. Quicklime was historically used in old mass pauper's graves, but they will both work."}, {"url": "http://www.slate.com/articles/news_and_politics/explainer/2009/12/soluble_dilemma.html", "passage_text": "In addition to being safer and more efficient, lye is also easier to obtain than strong acids. You can purchase 8 pounds of it —enough to dissolve a few bodies—from soap-making or farm-supply stores for less than $15. If you can't wait for delivery, pick up some drain cleaner from the supermarket, but it's so dilute that you may need to use quite a few bottles."}, {"url": "http://www.bulkapothecary.com/raw-ingredients/other-ingredients-and-chemicals/sodium-hydroxide-lye/", "passage_text": "Pure Lye. Sodium hydroxide, also known as Caustic Soda or Lye, is a product that is used in the creation of soap, detergent, paper, textiles and drinking water. It is a chemical base and comes packaged as a white solid. Sodium Hydroxide (Lye) – Uses and Benefits"}]