[{"url": "http://www.nature.com/modpathol/journal/v24/n9/full/modpathol201178a.html", "passage_text": "Abstract. Tubal metaplasia of the endometrium may occasionally display cytologic atypia (atypical tubal metaplasia) resembling serous carcinoma or endometrial intraepithelial carcinoma. Although atypical tubal metaplasia is presumed to be reactive or degenerative in etiology, its clinical significance is unknown."}, {"url": "http://sunnybrook.ca/content/?page=dept-labs-apath-gynpath-imgat-cvx-neo-tm", "passage_text": "Click to enlarge image. Tubal metaplasia is a common phenomenon in the endocervical glands where endocervical cells become cuboidal and may show cilia. Tubal metaplasia also shows some crowing of the nuclei and hyperchromasia and therefore it can be misinterpreted as endocervical dysplasia or adenocarcinoma in situ."}, {"url": "http://sunnybrook.ca/content/?page=dept-labs-apath-gynpath-imgat-cvx-neo-tm", "passage_text": "Tubal metaplasia is a common phenomenon in the endocervical glands where endocervical cells become cuboidal and may show cilia."}, {"url": "http://www.palmonline.org/node/125", "passage_text": "ABSTRACT. Metaplasia is a reversible reprogramming of stem cells of the epithelium. Usually, squamous metaplasia is observed in the endocervix. However, less frequently, tubal metaplasia may develop, replacing nonciliated columnar cells by ciliated columnar cells, similar to fallopian tube epithelium. Here we present a case of tubal metaplasia of the endocervical canal."}, {"url": "http://www.nature.com/modpathol/journal/v24/n9/full/modpathol201178a.html", "passage_text": "Keywords: atypia; endometrium; Ki-67; p53; TERT; tubal metaplasia. Tubal (or ciliated cell) metaplasia of the endometrium is a frequent finding in endometrial sampling specimens and is commonly associated with the follicular phase of the menstrual cycle and with anovulatory cycles."}, {"url": "http://medical-dictionary.thefreedictionary.com/metaplasia", "passage_text": "• Tubal metaplasia of the endometrium—i.e., replacement of the normal endometrial glands with ciliated (fallopian) tubal cells—may occur in endometrial polyps, mild adenomatous hyperplasia and in senile endometrium, but is rarely (and then only coincidentally) associated with malignancy."}]