[{"url": "https://factman.wordpress.com/2007/09/17/vaseline-the-miracle-product/", "passage_text": "Vaseline, the Miracle Product. Robert Chesebrough (1837-1933), a British-born chemist who invented petroleum jelly, which he named Vaseline. When he first invented the product he found it very difficult to convince stores and chemist shops to stock it. It was only his own determination and belief in the product that brought him success. "}, {"url": "https://en.wikipedia.org/wiki/Robert_Chesebrough", "passage_text": "Chesebrough opened his first factory in 1870. The first known reference to the name Vaseline is in his U.S. patent: “I, Robert Chesebrough, have invented a new and useful product from petroleum which I have named 'Vaseline…' . The word is believed to come from German wasser (water) + Greek έλαιον (oil). Chesebrough began his career as a chemist clarifying kerosene from the oil of sperm whales. The discovery of petroleum in Titusville, Pennsylvania, rendered his job obsolete, so he traveled to Titusville to research what new materials might be created from the new fuel."}, {"url": "http://quadcitiesdaily.com/?p=148126", "passage_text": "Inventor of Vaseline, ate a spoon full every morning: Interesting Facts! By Staff | January 25, 2014 | Filed under: News. The chemist Sir Robert Chesebrough, was the one who invented Vaseline, also known as petroleum jelly. He patented the product in 1872. The product wasn’t accepted until he travelled around New York doing demonstrations on himself. "}, {"url": "http://4thefirsttime.blogspot.com/2007/10/1865-invention-of-petroleum-jelly.html", "passage_text": "1865: invention of petroleum jelly. The raw material for petroleum jelly (also known as petrolatum or soft paraffin) was discovered in 1859 in Titusville, Pennsylvania where it was stuck to some of the first oil rigs in the US. By 1870, Chesebrough was marketing his petroleum jelly product as Vaseline (claimed to be from the German word for water (wasser -- pronounced vahser), and the Greek word for oil (elaion), but this is unconfirmed). He patented the process in 1872."}, {"url": "http://www.edinformatics.com/inventions_inventors/petroleum_jelly.htm", "passage_text": "In 1872, Chesebrough patented (U.S. Patent 127,568) the process of making petroleum jelly. The patent said that distillation by heat under vacuum involves less heat than without the vacuum, and yields a better quality of jelly. The product is then filtered through bone char. Petroleum jelly. Petroleum jelly or petrolatum is a byproduct of the refining of petroleum, made from the residue of petroleum distillation left in the still after all the oil has been vaporized."}, {"url": "http://www.edinformatics.com/inventions_inventors/petroleum_jelly.htm", "passage_text": "History. Petroleum jelly was discovered by Robert Chesebrough in 1859 in Brooklyn, New York. Chesebrough was intrigued by the paraffin-like substance that stuck to the drilling rigs. The riggers hated the material because it caused the rigs to seize up, but they used it on cuts and burns because it hastened healing. Petroleum jelly. Petroleum jelly or petrolatum is a byproduct of the refining of petroleum, made from the residue of petroleum distillation left in the still after all the oil has been vaporized."}, {"url": "https://en.wikipedia.org/wiki/Petroleum_jelly", "passage_text": "After petroleum jelly became a medicine chest staple, consumers began to use it for myriad ailments and cosmetic purposes, including toenail fungus, genital rashes (non-STD), nosebleeds, diaper rash, and chest colds. Petroleum jelly, petrolatum, white petrolatum, soft paraffin or multi-hydrocarbon, CAS number 8009-03-8, is a semi-solid mixture of hydrocarbons (with carbon numbers mainly higher than 25), originally promoted as a topical ointment for its healing properties."}, {"url": "https://en.wikipedia.org/wiki/Petroleum_jelly", "passage_text": "The raw material for petroleum jelly was discovered in 1859 in Titusville, Pennsylvania, United States, on some of the country's first oil rigs. Petroleum jelly, petrolatum, white petrolatum, soft paraffin or multi-hydrocarbon, CAS number 8009-03-8, is a semi-solid mixture of hydrocarbons (with carbon numbers mainly higher than 25), originally promoted as a topical ointment for its healing properties."}, {"url": "https://en.wikipedia.org/wiki/Robert_Chesebrough", "passage_text": "Robert Augustus Chesebrough, (January 9, 1837 – September 8, 1933) was an American chemist. He discovered petroleum jelly which he marketed as Vaseline and he founded the Chesebrough Manufacturing Company. Chesebrough began his career as a chemist clarifying kerosene from the oil of sperm whales. The discovery of petroleum in Titusville, Pennsylvania, rendered his job obsolete, so he traveled to Titusville to research what new materials might be created from the new fuel."}]