[{"url": "http://www.merriam-webster.com/dictionary/soma", "passage_text": "Definition of SOMA. : an intoxicating juice from a plant of disputed identity that was used in ancient India as an offering to the gods and as a drink of immortality by worshippers in Vedic ritual and worshipped in personified form as a Vedic god. "}, {"url": "http://www.everydayhealth.com/drugs/carisoprodol", "passage_text": "9 Reviews. Carisoprodol is the generic form of the prescription drug Soma, which is used to relax muscles and help alleviate pain from muscle spasms. Carisoprodol belongs to a group of drugs known as muscle relaxants. It was originally approved by the Food and Drug Administration (FDA) in 2007. Soma is manufactured by Meda Pharmaceuticals."}, {"url": "http://www.webmd.com/drugs/2/drug-12153/soma-oral/details", "passage_text": "Side Effects. Dizziness, drowsiness, or headache may occur. If any of these effects persist or worsen, tell your doctor or pharmacist promptly. Remember that your doctor has prescribed this medication because he or she has judged that the benefit to you is greater than the risk of side effects. A very serious allergic reaction to this drug is rare. However, get medical help right away if you notice any symptoms of a serious allergic reaction, including: rash, itching /swelling (especially of the face/ tongue /throat), severe dizziness, trouble breathing. This is not a complete list of possible"}, {"url": "http://www.webmd.com/drugs/2/drug-12153/soma-oral/details", "passage_text": "How to use Soma. Take this medication by mouth with or without food as directed by your doctor, usually 4 times a day. The dosage is based on your medical condition and response to treatment. This medication should only be used short-term (for 3 weeks or less) unless directed by your doctor. A very serious allergic reaction to this drug is rare. However, get medical help right away if you notice any symptoms of a serious allergic reaction, including: rash, itching /swelling (especially of the face/ tongue /throat), severe dizziness, trouble breathing. This is not a complete list of possible side effects."}, {"url": "https://en.wikipedia.org/wiki/Carisoprodol", "passage_text": "Carisoprodol is a centrally acting skeletal muscle relaxant of the carbamate class and produces all the effects associated with barbiturate receptor ligands. It is slightly soluble in water and freely soluble in ethanol, chloroform and acetone. The drug's solubility is practically independent of pH. Reports from Norway have shown carisoprodol has abuse potential as a prodrug of meprobamate and/or potentiator of hydrocodone, oxycodone, codeine and similar drugs. In May 2008 it was taken off the market in Norway."}, {"url": "http://www.webmd.com/drugs/2/drug-12153/soma-oral/details", "passage_text": "Carisoprodol is used short-term to treat muscle pain and discomfort. It is usually used along with rest, physical therapy, and other treatments. It works by helping to relax the muscles. A very serious allergic reaction to this drug is rare. However, get medical help right away if you notice any symptoms of a serious allergic reaction, including: rash, itching /swelling (especially of the face/ tongue /throat), severe dizziness, trouble breathing. This is not a complete list of possible side effects."}, {"url": "http://www.webmd.com/drugs/2/drug-8625/carisoprodol-oral/details", "passage_text": "Carisoprodol is used short-term to treat muscle pain and discomfort. It is usually used along with rest, physical therapy, and other treatments. It works by helping to relax the muscles. How to use carisoprodol. Take this medication by mouth with or without food as directed by your doctor, usually 4 times a day. The dosage is based on your medical condition and response to treatment."}, {"url": "http://www.urbandictionary.com/define.php?term=soma", "passage_text": "Soma is a muscle relaxer that works by blocking pain sensations between the nerves and the brain. Typically prescribed to patients that have herniated discs to help with the muscle spasms and sleep. When taken in large doses, it can act as a benzo. soma. 1-A drug used by the masses in Aldulous Huxley's book A Brave New World. It would be used on a daly basis by the citizens of this futuristic society in small doses to dull the senses,or keep people impassive and unfeeling."}, {"url": "https://en.wikipedia.org/wiki/Soma", "passage_text": "Both Soma and the Avestan Haoma are thought to be derived from Proto-Indo-Iranian *sauma- . The name of the Scythian tribe Hauma-varga is related to the word, and probably connected with the ritual. Soma is also often associated with Light and Indra is the Lord of Light as shown in the following verses from the RgVeda: RV 8.82.25 For thee, O Lord of Light, are shed these Soma-drops, and grass is strewn."}]