[{"url": "http://www.allboxerinfo.com/boxer-dog-exercise", "passage_text": "Over the course of the 1st year, you can increase exercise with your Boxer, until he or she is meeting the requirements of an adult dog. A Boxer should have a brisk (20 minutes for a puppy, 30 minutes to 45 minutes for an adult) walk each day, given that the temperatures and weather are not extreme."}, {"url": "http://www.thekennelclub.org.uk/getting-a-dog-or-puppy/general-advice-about-caring-for-your-new-puppy-or-dog/puppy-and-dog-walking/", "passage_text": "The government recommends that we get at least 30 minutes of exercise each day and this is something that everybody can achieve, and go beyond, on a daily dog walk. Dogs' exercise needs vary according to the breed that you have but every dog should have at least one walk a day, often two."}, {"url": "http://www.animalplanet.com/pets/how-much-exercise-does-a-puppy-need/", "passage_text": "Most adult dogs should participate in some form of physical activity for at least 30 minutes and up to two hours every day. Your puppy's genetics will determine when it's time to move her up to adult dog exercise. If she won't get any larger than 25 pounds (11 kilograms), then she can start at around 9 months."}, {"url": "http://dogtime.com/dog-health/fitness/49-exercise-needs", "passage_text": "How much exercise is enough depends on your dog’s age, breed, and health. A 10-month old Irish Terrier puppy is going to need more than a five-year old Whippet (you could appropriately sing, “Wild thing, you make my heart sing” as your puppy races around the house and yard)."}, {"url": "https://puppydogweb.com/articles/exercisepuppiesneed.htm", "passage_text": "Depending on the energy level of your puppy, you may take him out for walks even twice per day. The exercise time can be as little as 5 minutes, but again, a higher energy level dog will need more. Add 5 extra minutes for every month of age until the dog reaches maturity (6 to 12 months)."}, {"url": "http://www.thelabradorsite.com/labrador-puppy-exercise-how-much-is-too-much/", "passage_text": "Keeping a balance. Labrador puppy exercise is not something you should be worrying about. Just try and keep a balance. If you have been to visit a friend with your five month old pup and their dog has played for half an hour in the garden with yours, your dog does not need a walk as well."}, {"url": "http://www.animalplanet.com/pets/how-much-exercise-does-a-puppy-need/", "passage_text": "In other words, a 3-month-old puppy will need 15 minutes of exercise while a 4-month-old will need 20 minutes. This may take the form of low-impact activities like swimming or playing with small dog exercise balls. You can also take your puppy out for short walks on a leash."}, {"url": "https://puppydogweb.com/articles/exercisepuppiesneed.htm", "passage_text": "Puppies need exercise, but you have to make sure you don t exceed the puppy exercise limits. Puppies can play and walk, and these are great ways of exercising and socializing. The puppy exercise amount depends on the age, the breed and the energy level of the dog. Puppy Exercise Limits. 1  Unlike adult dogs, puppies get tired after a few minutes of exercise, as they don t have endurance. 2  Puppy exercise amount differs from one breed to another, according to"}]