[{"url": "https://www.kenhub.com/en/library/anatomy/coronal-section-of-the-kidney", "passage_text": "The kidneys are a pair of bean-shaped organs located on either side of the superior posterior abdominal wall. Its lateral border is convex while its medial border is concave. The medial concavity is the point at which the renal neurovascular structures enter and leave the kidneys. These organs accomplish their excretory role by converting nitrogenous waste to urine. It is also an integral part of water and pH homeostasis, blood pressure regulation and red blood cell regulation. The calyces act as conduits for urine to leave the medulla and enter the ureters. There are minor calyces and major calyces. Each minor calyx is a funnel shaped structures that surrounds a renal papilla and collects urine from it through the area cribrosa (sieve-like apparatus)."}, {"url": "https://en.wikipedia.org/wiki/Hilum_of_kidney", "passage_text": "(Redirected from Hilum of kidney). The renal hilum (Latin: hilum renale) or renal pedicle is the hilum of the kidney, that is, its recessed central fissure where its vessels, nerves and ureter pass. "}, {"url": "http://faculty.scf.edu/husseim/APII/labs/Urinary.pdf", "passage_text": "The ureter transports urine from the kidney to the urinary bladder. ♦ The hilus (16) is a prominent indentation on the medial side of the kidney; it is the point of entry for the renal artery and the point of exit for the renal vein and the ureters. ♦The renal cortex (8) is the outer region of the kidney where most urine formation occurs. The cortex looks granular because of all of the blood vessels and nephrons in it. ♦Deep to the cortex is the renal medulla (9) . The medulla consists of renal pyramids (10) ."}, {"url": "http://www.ivyroses.com/HumanBody/Urinary/Urinary_System_Kidney_Diagram.php", "passage_text": "Renal hilus: The renal hilus is an indentation near to the centre of the concave area of the kidney. This is the area of the kidney through which the ureter leaves the kidney and the other structures including blood vessels (illustrated), lymphatic vessels, and nerves enter/leave the kidney. Renal capsule:"}, {"url": "http://www.urology-textbook.com/kidney-anatomy.html", "passage_text": "The lateral surface is convex. The medial surface is concave, deeply grooved (renal sinus) and forms the renal hilum. The ureter/renal pelvis, renal artery, renal vein, lymphatic vessels and nerves enter or exit through the renal hilum the kidney. The kidneys are located in the retroperitoneum, right and left of the spine and below the diaphragm. Normal position: 1  Left kidney: from the 11th rib to third lumbar vertebra. 2  Right kidney: slightly lower position, 12th rib to the lower part of the"}, {"url": "https://www.kenhub.com/en/library/anatomy/coronal-section-of-the-kidney", "passage_text": "The open cavity in the medial concavity of the kidney – the renal sinus – is partly occupied by the calyces and the renal pelvis. The calyces act as conduits for urine to leave the medulla and enter the ureters. There are minor calyces and major calyces. Each minor calyx is a funnel shaped structures that surrounds a renal papilla and collects urine from it through the area cribrosa (sieve-like apparatus)."}, {"url": "http://training.seer.cancer.gov/anatomy/urinary/components/kidney.html", "passage_text": "The kidneys are the primary organs of the urinary system. The kidneys are the organs that filter the blood, remove the wastes, and excrete the wastes in the urine. They are the organs that perform the functions of the urinary system. The other components are accessory structures to eliminate the urine from the body. The cortex and medulla make up the parenchyma, or functional tissue, of the kidney. The central region of the kidney contains the renal pelvis, which is located in the renal sinus, and is continuous with the ureter. The renal pelvis is a large cavity that collects the urine as it is produced. The periphery of the renal pelvis is interrupted by cuplike projections called calyces"}, {"url": "http://www.aw-bc.com/info/ip/assignmentfiles/urinary/Anatomy_Review.doc", "passage_text": "• An adrenal gland, which is part of the endocrine system, lies on top of each kidney. • Several structures enter or exit the concave surface of the kidney at the renal hilus, including the ureter and the renal vein, which drains into the inferior vena cava. • Label this diagram: Page 5. "}]