[{"url": "http://soils.ifas.ufl.edu/wetlandextension/types/mangroves.htm", "passage_text": "Florida's mangroves: Florida is home to approximately 2,700 square kilometers of this dominant subtropical coastal ecosystem. Florida's mangrove swamps are concentrated along the southwest coast, where the Everglades and Big Cypress Swamp drain to the Gulf of Mexico. Crabs burrow in the sediments, prey on mangrove seedlings, facilitate litter decomposition and help convert detritus energy to the ecosystem's birds and fish. Well-known mangroves: With an area of about 600 square kilometers, Florida's Ten Thousand Islands is one of the world's largest mangrove swamps."}, {"url": "http://soils.ifas.ufl.edu/wetlandextension/types/mangroves.htm", "passage_text": "It is illegal to remove mangroves from the shoreline. Mangrove vegetation: Three of the 10 known mangrove species dominate Florida's mangroves: red mangroves, black mangroves, and white mangroves. Red mangroves have dense roots and are found along coastal edges that face the sea. Black mangroves are most common in hammock wetlands and basin swamps. Crabs burrow in the sediments, prey on mangrove seedlings, facilitate litter decomposition and help convert detritus energy to the ecosystem's birds and fish. Well-known mangroves: With an area of about 600 square kilometers, Florida's Ten Thousand Islands is one of the world's largest mangrove swamps."}, {"url": "http://oceanservice.noaa.gov/facts/mangroves.html", "passage_text": "Mangroves are a group of trees and shrubs that live in the coastal intertidal zone. Mangrove forest in Loxahatchee, Florida. There are about 80 different species of mangrove trees. All of these trees grow in areas with low-oxygen soil, where slow-moving waters allow fine sediments to accumulate. "}, {"url": "https://en.wikipedia.org/wiki/Mangrove", "passage_text": "The mangrove biome, or mangal, is a distinct saline woodland or shrubland habitat characterized by depositional coastal environments, where fine sediments (often with high organic content) collect in areas protected from high-energy wave action. Mangrove swamps are found in tropical and subtropical tidal areas. Areas where mangal occurs include estuaries and marine shorelines. The intertidal existence to which these trees are adapted represents the major limitation to the number of species able to thrive in their habitat."}, {"url": "http://mangrove.org/video/Mangrove.pdf", "passage_text": "Ecological Importance of mangrove Habitat Coastal Reforestation Technology Green Funeral Services mangrove.org 6001 Highway A1A Indian River Shores, FL 32963 Tel: 321-431-6595 E-mail: riley@mangrove.org Mangrove trees are an indigenous species to Florida and a major contributor to the state's marine environment. "}, {"url": "http://soils.ifas.ufl.edu/wetlandextension/types/mangroves.htm", "passage_text": "Crabs are another important mangrove species, as they help maintain biodiversity. Crabs burrow in the sediments, prey on mangrove seedlings, facilitate litter decomposition and help convert detritus energy to the ecosystem's birds and fish. Well-known mangroves: With an area of about 600 square kilometers, Florida's Ten Thousand Islands is one of the world's largest mangrove swamps."}, {"url": "http://www.ecologic.org/actions-issues/about-the-region/what-is-a-mangrove/", "passage_text": "A mangrove commonly refers to two different things: a tidal swamp ecosystem found in tropical deltas, estuaries, lagoons or islands, and the characteristic tree species populating this ecosystem. Mangrove trees have developed unique adaptations to the harsh conditions of coastal environments. Mangrove forests are an ecosystem of incredible biological diversity comprising hundreds of algae, mollusk, crustacean, fish, insect, reptile, bird, and mammal species. Saltwater crocodiles, pelicans, egrets, spoonbills, flying foxes and monkeys are all residents of mangroves, just to name a few."}, {"url": "http://wwf.panda.org/about_our_earth/blue_planet/coasts/mangroves/mangrove_ecosystems/", "passage_text": "© WWF / Roger LeGUEN. Mangrove forests play a central role in transferring organic matter and energy from the land to marine ecosystems. This matter and energy comes from detritus from fallen leaves and branches, and forms the base of important marine food chains. These same bacteria give mangroves their rotten egg smell-as the sediment is oxygen-poor, only bacteria that use sulphur for energy can survive. The dense root systems form a home for fish, crabs, shrimps, and molluscs. They also serve as nurseries for juvenile fish."}, {"url": "http://dep.state.fl.us/water/wetlands/mangroves/mangrove_facts.htm", "passage_text": "Mangroves are tropical plants that are adapted to loose, wet soils, salt water, and being periodically submerged by tides. Four major factors appear to limit the distribution of mangroves: climate salt water tidal fluctuation soil type There are more that 50 species of mangroves found throughout the world. Mangroves are tropical plants that are adapted to loose, wet soils, salt water, and being periodically submerged by tides. Four major factors appear to limit the distribution of mangroves: 1  climate."}]