[{"url": "http://www.ark-survival.net/en/2015/07/05/cooking-recipe-cheatsheet/", "passage_text": "Cooking Recipe Cheatsheet. Discuss this on reddit. Also be sure to check out our cheatsheets for Taming Times and Engrams. Linking etiquette. Due to the rapid changes that come with Early Access, I expect cooking recipes to change over time as well. This infographic will be updated to reflect that, but I can’t guarantee it will have the same filename."}, {"url": "http://www.ign.com/cheats/games/ark-survival-evolved-pc-20037096", "passage_text": "ARK: Survival Evolved Beginner Tips. If you are just beginning an adventure in ARK: Survival Evolved, keep the following tips in mind to get started on the right foot. 1  Pay attention to the order in which you place things. Press TAB to bring up the cheat console. From there, you can enter the following codes and press ENTER to unlock the corresponding effects. 1  God-Enables God Mode. 2  Fly-You can fly. 3  Walk-Deactivates Fly cheat."}, {"url": "http://ark.gamepedia.com/Cooking", "passage_text": "Recipes [edit | edit source]. Recipes can be found all around the map via beacon drops or even drop off various creatures. Recipes can be put in the Cooking Pot in order to craft food that gives extra buffs such as more stamina or prolonged oxygen. Advanced food can be utilized by dinosaurs. They do get the benefit of the food (195.2). Cooking meat requires a Campfire or an Industrial Grill, while cooking recipes requires a Cooking Pot. 1  Require a Waterskin, Water Jar or Canteen that is at least 25% full."}, {"url": "http://segmentnext.com/2015/06/18/ark-survival-evolved-cooking-guide-recipes/", "passage_text": "Depending upon the recipe, the cooked food provide you with additional buffs such as Stamina, increased Oxygen, and more. One important thing to bear in mind is that you will also need Wood and Water (from Water Jug or Waterskin) and you must take out Charcoal while you are cooking a recipe. The following list contains all the Food Recipes found in the game: You will also need raw material such as Water, Berries, or Meat along with items such as Savoroot, Longrass, Rockarrot, and Citronal. Once you’ve acquired all required material, you will also need Food Recipes which are scattered across the in-game world or are dropped by dinosaurs."}, {"url": "http://ark.gamepedia.com/Cooking", "passage_text": "Cooking is the act of creating food using a Campfire, a Cooking Pot, or an Industrial Grill. Cooking meat requires a Campfire or an Industrial Grill, while cooking recipes requires a Cooking Pot. 1  Require a Waterskin, Water Jar or Canteen that is at least 25% full. 2  Take 60 seconds to cook"}, {"url": "http://ark.gamepedia.com/Recipes", "passage_text": "In ARK: Survival Evolved you are able to cook various recipes with a Cooking Pot. Recipes can be used to craft food that gives extra buffs or to make dyes to customize all kinds of items and structures. Kibbles [edit | edit source]. In addition to the ingredients given below, all kibble recipes require 2 Mejoberries, 3 Fiber and a Waterskin (or other water storage device) with at least 25% water in it."}, {"url": "http://segmentnext.com/2015/06/18/ark-survival-evolved-cooking-guide-recipes/", "passage_text": "Follow Us: Follow @SegmentNext. In order to cook in Ark: Survival Evolved, you need to use a Campfire or a Cooking Pot. You will also need raw material such as Water, Berries, or Meat along with items such as Savoroot, Longrass, Rockarrot, and Citronal. Once you’ve acquired all required material, you will also need Food Recipes which are scattered across the in-game world or are dropped by dinosaurs."}, {"url": "http://www.ign.com/cheats/games/ark-survival-evolved-pc-20037096", "passage_text": "Submitted by: ign_cheats. If you are just beginning an adventure in ARK: Survival Evolved, keep the following tips in mind to get started on the right foot. Pay attention to the order in which you place things. For example, you should place a foundation before you place a ramp. Press TAB to bring up the cheat console. From there, you can enter the following codes and press ENTER to unlock the corresponding effects. 1  God-Enables God Mode. 2  Fly-You can fly. 3  Walk-Deactivates Fly cheat."}, {"url": "http://segmentnext.com/2015/06/07/ark-survival-evolved-crafting-guide-recipes-metal-farming-tips/", "passage_text": ": N/A. In order to start crafting, you need Engram Points which let you learn crafting abilities after leveling up your character. You can use the Engram Points to unlock Craftable Engrams for crafting. For more help on Ark: Survival Evolved, read our Engram Points and Leveling, Taming Guide and Cave Locations Guide. Once you’ve acquired around 14 metal, you can climb down to safety. Once you’ve found ingots, you’ll either need to be Level 25 or learn the Smithy Engram."}]