[{"url": "http://homeguides.sfgate.com/long-germination-time-bermuda-grass-seed-73963.html", "passage_text": "You can grow common Bermuda grass from seed in U.S. Department of Agriculture plant hardiness zones 9 through 11. Under the right conditions, the seeds will begin germinating in five to 14 days but take 14 to 28 days to germinate completely. Seeding rates for Bermuda grass range from 1 to 2 pounds of hulled seed or 2 to 3 pounds of coated seed per 1,000 square feet of lawn. Use a rotary spreader and divide the seed in half and apply it in two directions. When you finish, lightly roll the seed to increase its contact with the soil."}, {"url": "http://www.gardenguides.com/115292-pre-germinate-grass-seed.html", "passage_text": "Overview. Pre-germination of grass seed will enable you to grow and repair patches of grass more quickly than if you put down dry seed. Many sports fields and golf courses use pre-germination, but it can come in handy for regular homeowners as well. Once you have started the process of pre-germination you must lay the seed quickly or it will die. However, you may refrigerate the seeds to extend their life for up to one week. Cool season grasses, such as Kentucky Bluegrass, seem to do best in the pre-germination process."}, {"url": "http://www.scotts.com/smg/goART2/InfoHowTo/the-questions-people-ask-most-about-grass-seed/18700002///", "passage_text": "If stored in a cool, dry place, grass seed can last for 2-3 years. However, the germination rate (the number of seeds that will grow) will decrease over time, so you may not get the same results you would if you were using fresh seed. For best results, use fresh product and try to plant it within a year. "}, {"url": "http://homeguides.sfgate.com/long-germination-time-bermuda-grass-seed-73963.html", "passage_text": "Climate and Germination. Bermuda grass seeds will germinate best if in a soil with a pH between 6 and 7. The grass grows best when the soil temperature is between 75 and 95 degrees Fahrenheit and the air temperature is between 75 and 95 F. You can expect a complete turf cover in four to six weeks. Seeding rates for Bermuda grass range from 1 to 2 pounds of hulled seed or 2 to 3 pounds of coated seed per 1,000 square feet of lawn. Use a rotary spreader and divide the seed in half and apply it in two directions. When you finish, lightly roll the seed to increase its contact with the soil."}, {"url": "http://thehousingforum.com/how-long-does-it-take-for-grass-seed-to-grow/", "passage_text": "Replanting New Grass Seed. Grass is a fast growing plant, but the exact rate at which it grows depends upon the type of grass used and the growing conditions. Germination. Grass seeds usually germinate between seven and ten days after they have been sown, although it can take between three and thirty days. Growth. A fast growing variety of grass sown under good growing conditions will produce a green covering in about a week, although it will not yet be properly established."}, {"url": "http://www.youtube.com/watch?v=UgdBVTTV7OU", "passage_text": "http://homeimprovementhobbyist.com/pl... Here's the exact method that homeowners can use to plant grass seed and grow lush, green lawns. This is how many golf courses grow their grass and it can work for you as well. The key is to mix the soil and seed together BEFORE putting the seed down. This eliminates a lot of raking and it assures that you'll have plenty of seed covered with soil properly which will help it germinate quicker."}, {"url": "http://homeguides.sfgate.com/fast-grass-seed-germinate-47825.html", "passage_text": "Several factors affect how quickly grass seed germinates. Germination is the term for when a new plant emerges from a seed. How fast grass seed germinates depends on the variety of grass and environmental conditions. Grass seed that is provided optimal germination conditions germinates faster than it does under different conditions. Depending on the grass variety planted and environmental conditions, seed germination can take place from three to 28 days after planting. One environmental condition that affects germination is temperature. In northern California, cool-season grasses grow best due to the cooler air and soil temperatures."}, {"url": "https://answers.yahoo.com/question/index?qid=1006051507285", "passage_text": "Some grass seeds germinate slightly faster than others, but most all have a germination rate of 7-10 days. If the seed does not receive enough moisture it will not start to germinate as soon. however, if you drown the seeds they will rot before they germinate. "}, {"url": "https://lawnuk.com/content/grass-seed-germination", "passage_text": "How long does it take for grass seed to germinate? (See also How long does it take for seed to grow). Depending on the conditions, you can expect to see some grass seed mixtures germinate quite quickly. If conditions at the time of sowing are perfect, you may see germination is as little as 2-4 days. On average though, germination will take between 7-14 days"}]