[{"url": "https://en.wikipedia.org/wiki/Sade_Sati", "passage_text": "Sade-Sati is the 7 1⁄2 years long period of Saturn (Shani). This astrological phase is much feared by those in India who give credence to Indian Astrology. According to those beliefs, this is a period with many challenges."}, {"url": "http://www.vedicscholar.com/sadesatti.php", "passage_text": "When, Saturn transits through the 12th, 1st, and 2nd house from the natal moon (where one's Moon is placed in the birth chart), this is termed Sade satti. Saturn takes 2 years to pass through each sign (30 years to make one round of the zodiac), its passing through 3 signs make it 7 years."}, {"url": "http://www.priestservices.com/spirituallibrary/sade-sati", "passage_text": "Sade Sati. The transit of Sani in the 12th,1st and 2nd houses from the Janma Rasi (Natal Chandra sign) is called Sade-Sati or the seven and half year period. Each house is transited by Sani for about 2½ years each."}, {"url": "http://www.astrologyguru.org/SadeSati.htm", "passage_text": "Sade sati is the time when Saturn is transiting through the sign previous to the Janmarashi (two and half years), in the Janmarashi itself (again two and a half years), and the sign next to Janmarashi (again two and half years making it a course of 7 and half years in total)."}, {"url": "http://www.astrosage.com/free/sade-sati-report.asp", "passage_text": "When transit (gochar) Shani passes over birth Moon or twelfth or second from it, it is called Shani Sade Sati or Saturn Sade Sati. Shani Sade Sati remains in these three signs for approx 7.5 years and this period is generally considered troublesome and problematic for the native."}, {"url": "http://www.prokerala.com/astrology/sade-sati.php", "passage_text": "Shani Sade Sati or simply Sade Sati is a period in the life of an individual, spanning approximately seven and a half years, which is dubiously associated with difficulties and challenges."}, {"url": "https://en.wikipedia.org/wiki/Sade_Sati", "passage_text": "The period of Sade-sati starts when Saturn enters the zodiac sign immediately before the zodiac sign of Moon at the time of the birth of the individual. That is, if the Moon sign (Ayamsha) at the time of birth of the native was Taurus, then the Sadesati will begin when Saturn enters sign Aries."}, {"url": "http://astrobix.com/horoscope/sadesati/", "passage_text": "Saturn Sadesati is the 7.5 years long transit of Saturn through the 12th house to the 2nd house during which time Saturn may give an unusual amount of stress to the person."}]