[{"url": "http://energy.gov/energysaver/estimating-appliance-and-home-electronic-energy-use", "passage_text": "Annual cost to operate: The utility rate is 11 cents per kWh.4.68 kWh × $0.11/kWh = $0.51/year. Determining how much electricity your appliances and home electronics use can help you understand how much money you are spending to use them. Annual cost: The utility rate is 11 cents per kWh. 547.5 kWh × $0.11/kWh = $60.23/year. II. Following the steps above, find the annual cost to operate a paper shredder. 1. Estimate of time used: The shredder is used for about 15 minutes per day (0.25 hour)."}, {"url": "http://michaelbluejay.com/electricity/refrigerators.html", "passage_text": "Fridge should be 36-40F, and the freezer should be 0-5F (-17 to -10C). Fridges set 10 degrees lower than needed (or freezers set 5 degrees lower than needed) can increase energy use by as much as 20-25%. Personally, I set my own fridge to 56 because as a vegan I never store super-perishables like meat or dairy. Home Energy magazine says door openings account for 7% of fridge energy use, assuming 42 door openings a day. But the Institute of Food & Agricultural Sciences at the University of Florida (link no longer available) says poor open/close habits waste 50 to 120kWh a year, which would be 10-24% of a 500 kWh/yr. fridge."}, {"url": "http://michaelbluejay.com/electricity/refrigerators.html", "passage_text": "At 15 kWh, trading in a pre-1986 fridge for a new efficient one would save about $158 a year in electricity costs. And some older fridges are even worse than the average. One reader estimates her savings to be $238 per year for trading in her 1979 fridge for a 2004 model. Home Energy magazine says door openings account for 7% of fridge energy use, assuming 42 door openings a day. But the Institute of Food & Agricultural Sciences at the University of Florida (link no longer available) says poor open/close habits waste 50 to 120kWh a year, which would be 10-24% of a 500 kWh/yr. fridge."}, {"url": "http://energyusecalculator.com/electricity_refrigerator.htm", "passage_text": "A fridge will use anywhere from 100 to 400 watts depending on size, an average modern fridge will use 180 watts. Click calculate to find the energy consumption of a refrigerator using 180 Watts for 24 hours a day @ $0.10 per a kWh. Cost Per Hour: (For example: 30 minutes per a day is 0.5). If you are using an old fridge we highly recommend you upgrade to a more efficient modern model, advances in the past 15-20 years have reduced the energy use of refrigeration."}, {"url": "http://michaelbluejay.com/electricity/refrigerators.html", "passage_text": "Refrigerators are a big chunk of home energy use. In most homes the refrigerator is the second-largest user of electricity (13.7%), right after the air conditioner (14.1%). (Dept. of Energy) With most appliances you save energy by using them less, but you can't very well do that with your fridge. Home Energy magazine says door openings account for 7% of fridge energy use, assuming 42 door openings a day. But the Institute of Food & Agricultural Sciences at the University of Florida (link no longer available) says poor open/close habits waste 50 to 120kWh a year, which would be 10-24% of a 500 kWh/yr. fridge."}, {"url": "http://www.green-energy-efficient-homes.com/how-much-electricity-refrigerators-use.html", "passage_text": "As a result, that same 17 cubic foot bottom freezer refrigerator which was ENERGY STAR qualified at 507 kwh in 2005 would just barely scrape by the minimum requirement by today’s standard, and a current ENERGY STAR qualified fridge of that size would need to use 455 kwh per year or less. About $21. If you really want to know how much electricity your refrigerator uses, you should use a device like the Kill A Watt meter or Belkin energy cost monitor to measure the fridge’s power consumption."}, {"url": "http://fridgeadvisor.com/how-many-watts-does-a-refrigerator-use/", "passage_text": "So, To convert these wattages into a daily use of kilowatt hours (kWh – the standard billing unit of electricity suppliers), the following equation applies -. (Wattage x eight) ÷ 1000 = kWh per day. Where eight represents our presumed eight hours active time per day. Thus a 600 Watt unit – typical of older, larger refrigerators – would use 4.8 kilowatt hours daily, or 1750 per year; where a more modern 140 watt unit uses about 1.1 kWh daily, or approximately 400 per year. This is how many watts does a refrigerator use. No information is provided by the author. "}, {"url": "http://www.t2c.org.uk/saving-energy/electricity-usage/", "passage_text": "Electricity Usage. The amount of energy used by each appliance depends on how much power it draws when in operation and how much of the time it is used. The power usage is measured in watts and kilowatts (a kilowatt =1000 watts), and the amount of energy that it consumes in watt-hours or kilowatt hours (kWh). A single bar electric fire often uses electricity at the rate of one kilowatt (kW) per hour. So, in an hour an electric fire will use one kilowatt hour (kWh). One kilowatt hour is also referred to as a ‘unit’ of electricity. In 2010 this cost an average of around 13p."}, {"url": "http://energyusecalculator.com/electricity_refrigerator.htm", "passage_text": "Price (kWh): Enter the cost you are paying on average per a kilowatt hour, average price in North America is 10 cents. If you are using an old fridge we highly recommend you upgrade to a more efficient modern model, advances in the past 15-20 years have reduced the energy use of refrigeration. If your refrigerator has been purchased in the last 10 years then buying a new one may not give you a significant improvement. (For example: 30 minutes per a day is 0.5)"}, {"url": "http://www.wisegeek.org/how-much-electricity-do-appliances-use.htm", "passage_text": "To figure how many kilowatts an appliance uses, take the wattage of the appliance, multiply it by the number of hours used, and divide by 1,000. For example, if a new refrigerator has a wattage of 300, multiplied by 730 hours, and divided by 1,000, it averages 219 kilowatt hours. Ad. The price of a kilowatt hour varies in the US, depending on location and peak usage times, but on average, one kilowatt hour costs about $0.06 USD. Electric bills will usually state exactly how many cents are being charged per kilowatt hour, which can help determine the cost of running an appliance."}]