[{"url": "http://www.realtytrac.com/mapsearch/sold/fl/collier-county/marco-island/", "passage_text": "(845 results). Search for recently sold homes in Marco Island, Collier County, Florida. "}, {"url": "http://www.yellowbook.com/s/government-offices-county/marco-island-florida/", "passage_text": "{$Name} will call you soon. Yellowbook recognizes the importance of protecting your privacy. See our Privacy Policy. This service is free of charge and is for US calls or text messages only. Standard carrier rates are applied according to users' wireless plan. Close. Your email Separate multiple emails with a semicol"}, {"url": "http://www.city-data.com/city/Marco-Island-Florida.html", "passage_text": "Fire-safe hotels and motels in Marco Island, Florida: 1  Marco Beach Hilton, 560 S Collier Blvd, Marco Island, FL 33937. 2  Lakeside Inn, 155 1ST Ave, Marco Island, FL 33937. 3  Marco Island Marriott Resort Golf Club & Spa, 400 S Collier Blvd, Marco Island, FL 34145, Phone: (239) 394-2511, Fax: (239) 642-2774. Colleges/universities with over 2000 students nearest to Marco Island: 1  Hodges University (about 24 miles; Naples, FL; Full-time enrollment: 2,132). 2  Florida Gulf Coast University (about 37 miles; Fort Myers, FL; FT enrollment: 11,165). 3  Edison State College (about 44 miles; Fort Myers, FL; FT enrollment: 10,649)."}, {"url": "https://en.wikipedia.org/wiki/Marco_Island", "passage_text": "(Redirected from Marco Island). Marco Island is a city in Collier County, Florida, United States, located on an island by the same name in the Gulf of Mexico off the coast of Southwest Florida. It is a principal city of the Naples –Marco Island Metropolitan Statistical Area. The population was 16,413 at the 2010 census. Marco Island is the largest barrier island within Southwest Florida's Ten Thousand Islands area extending southerly to Cape Sable"}, {"url": "http://www.colliermuseums.com/", "passage_text": "Take a Bite of History. Journey back over more than a million years of Southwest Florida history at the Collier County Museums in Naples, Everglades City, Naples Depot, Immokalee and Marco Island. Recreation for your mind. Journey back over more than a million years of Southwest Florida history at the Collier County Museums in Naples, Everglades City, Naples Depot, Immokalee and Marco Island."}, {"url": "http://www.colliermuseums.com/", "passage_text": "at Collier County Museums. Journey back over more than a million years of Southwest Florida history at the Collier County Museums in Naples, Everglades City, Naples Depot, Immokalee and Marco Island. Recreation for your mind. Journey back over more than a million years of Southwest Florida history at the Collier County Museums in Naples, Everglades City, Naples Depot, Immokalee and Marco Island."}, {"url": "https://en.wikipedia.org/wiki/Naples-Marco_Island,_Florida_Metropolitan_Statistical_Area", "passage_text": "Collier County's main administration building, left, and the back end of the county courthouse, right. Collier County is a county located in the U.S. state of Florida. As of the 2010 census, the population was 321,520. Its county seat is East Naples, where the county offices were moved from Everglades in 1962. "}]