[{"url": "http://patient.info/doctor/typhoid-and-paratyphoid-fever-pro", "passage_text": "In non-endemic countries, patients presenting with symptoms suggestive of typhoid or paratyphoid fever are initially assessed in hospital where a firm diagnosis by blood culture or bone marrow culture can be made, and antibiotic sensitivities determined. "}, {"url": "http://patient.info/health/typhoid-and-paratyphoid-fever-leaflet", "passage_text": "About 1 in 10 people with typhoid or paratyphoid fever infections have complications. These can occur at any time while you have the infection, even if you have a mild infection. 1  The two most common complications are bleeding from, and rupture of, the bowel. 2  These occur in about 2 in 100 cases. The diseases are known by various other names, such as gastric fever, enteric fever, abdominal typhus, infantile remittent fever, slow fever, nervous fever, and pythogenic fever. The name typhoid means resembling typhus."}, {"url": "http://www.who.int/water_sanitation_health/diseases/typhoid/en/", "passage_text": "Typhoid and paratyphoid enteric fevers. Typhoid and paratyphoid fevers are infections caused by bacteria which are transmitted from faeces to ingestion. Clean water, hygiene and good sanitation prevent the spread of typhoid and paratyphoid. Contaminated water is one of the pathways of transmission of the disease. Typhoid and paratyphoid fevers are caused by the bacteria Salmonella typhi and Salmonella paratyphi respectively. Typhoid and paratyphoid germs are passed in the faeces and urine of infected people."}, {"url": "http://patient.info/health/typhoid-and-paratyphoid-fever-leaflet", "passage_text": "Paratyphoid fever is an infection which is similar but has milder symptoms. This is caused by the bacterium Salmonella paratyphi. There are three strains of Salmonella paratyphoid: often called strains A B and C. A is the most common worldwide, although B is more common in Europe. C is rare. The diseases are known by various other names, such as gastric fever, enteric fever, abdominal typhus, infantile remittent fever, slow fever, nervous fever, and pythogenic fever. The name typhoid means resembling typhus."}, {"url": "https://en.wikipedia.org/wiki/Paratyphoid_fever", "passage_text": "Paratyphoid fever is a type of enteric fever along with typhoid fever. Paratyphoid is caused by the bacteria Salmonella enterica of the serotype Paratyphi A, Paratyphi B or Paratyphi C growing in the intestines and blood. They are usually spread by eating or drinking food or water contaminated with the feces of an infected person."}, {"url": "http://www.health.nsw.gov.au/Infectious/factsheets/Pages/Typhoid.aspx", "passage_text": "People with typhoid or paratyphoid fever may experience mild or severe symptoms. The symptoms may include fever, headache, general discomfort and a lack of appetite. Some people have rose spots on the trunk of the body. Constipation or diarrhoea may occur. Typhoid or paratyphoid fever is treated with antibiotics. Some people may never have symptoms but may be carriers of typhoid or paratyphoid. Antibiotic treatment is required to treat carriers also. If symptoms are severe, hospitalisation may be required."}, {"url": "https://en.wikipedia.org/wiki/Paratyphoid_fever", "passage_text": "Paratyphoid fever, also known simply as paratyphoid, is a bacterial infection caused by one of the three types of Salmonella enterica. Symptoms usually begin six to thirty days after exposure and are the same as those of typhoid fever. Often there is a gradual onset of a high fever over several days. Paratyphoid is caused by the bacteria Salmonella enterica of the serotype Paratyphi A, Paratyphi B or Paratyphi C growing in the intestines and blood. They are usually spread by eating or drinking food or water contaminated with the feces of an infected person."}, {"url": "https://en.wikipedia.org/wiki/Typhoid_fever", "passage_text": "Typhoid fever is a type of enteric fever along with paratyphoid fever. The cause is the bacterium Salmonella typhi, also known as Salmonella enterica serotype typhi, growing in the intestines and blood. Typhoid is spread by eating or drinking food or water contaminated with the feces of an infected person. Typhoid fever, also known simply as typhoid, is a symptomatic bacterial infection due to Salmonella typhi. Symptoms may vary from mild to severe and usually begin six to thirty days after exposure. Often there is a gradual onset of a high fever over several days."}, {"url": "http://wwwnc.cdc.gov/travel/yellowbook/2014/chapter-3-infectious-diseases-related-to-travel/typhoid-and-paratyphoid-fever", "passage_text": "Typhoid and paratyphoid fever are most often acquired through consumption of water or food that has been contaminated by feces of an acutely infected or convalescent person or a chronic, asymptomatic carrier. Transmission through sexual contact, especially among men who have sex with men, has been documented rarely. Typhoid fever is a potentially severe and occasionally life-threatening febrile illness caused by the bacterium Salmonella enterica serotype Typhi. Paratyphoid fever is a similar illness caused by S. enterica serotype Paratyphi A, B (tartrate negative), or C."}]