[{"url": "http://www.webmd.com/balance/guide/what-is-holistic-medicine", "passage_text": "In this article. Font Size. A. A. A. Holistic medicine is a form of healing that considers the whole person -- body, mind, spirit, and emotions -- in the quest for optimal health and wellness. 1 All people have innate healing powers. 2  The patient is a person, not a disease. 3  Healing takes a team approach involving the patient and doctor, and addresses all aspects of a person's life using a variety of health care practices. 4  Treatment involves fixing the cause of the condition, not just alleviating the symptoms."}, {"url": "http://www.hearthsidehealing.com/holistic-mental-health-therapy/", "passage_text": "As a holistic mental health therapist, I am often asked how that is different from a regular counselor. While there is some overlap, there are also some differences. These are some of the tools a holistic therapist may use in helping a patient to heal. The fundamental cornerstone of holistic therapy is nourishing the body so that positive transformations in mental health can take place."}, {"url": "http://emmyvadnais.com/what-is-holistic-occupational-therapy", "passage_text": "Occupational Therapy is already a very holistic profession as it can assist a person with all aspects of their life. With the ‘alternative therapy’ field expanding in the past 10 years, consumers and practitioners are exploring these approaches and are integrating them in to care. First, Occupational Therapy is a form of therapy that helps people with what ‘occupies’ their time. This covers every aspect of a person’s life, from the cradle to the grave."}, {"url": "http://www.webmd.com/balance/guide/what-is-holistic-medicine", "passage_text": "Holistic medicine is also based on the belief that unconditional love and support is the most powerful healer and a person is ultimately responsible for his or her own health and well-being. Other principles of holistic medicine include the following: 1  All people have innate healing powers. 2  The patient is a person, not a disease. 3  Healing takes a team approach involving the patient and doctor, and addresses all aspects of a person's life using a variety of health care practices. 1 All people have innate healing powers. 2  The patient is a person, not a disease. 3  Healing takes a team approach involving the patient and doctor, and addresses all aspects of a person's life using a variety of health care practices. 4  Treatment involves fixing the cause of the condition, not just alleviating the symptoms."}, {"url": "http://www.wisegeek.com/what-is-holistic-therapy.htm", "passage_text": "Holistic therapy is a branch of complementary medicine known as alternative medicine. In other words, these treatment options do not fall into traditional conventional medicine practices. "}, {"url": "http://www.myshrink.com/counseling-support-center.php", "passage_text": "(i.e. I'm less prone to stress-related illnesses as I work through emotional issues). This is in contrast to Western medicine which targets separate body areas and promotes the use of pharmaceuticals as a first resort. Acupuncture-massage-naturopathy-reiki are holistic therapies that you're already familiar with. However, I doubt you've ever thought of counseling as holistic. There's a reason for this."}, {"url": "http://myjobsearch.com/careers/holistic-therapist.html", "passage_text": "A holistic therapist is an individual who has been trained in the art of holistic therapy. Holistic therapy is treatment which aims to treat a client as a whole, rather than as a being separated into different parts which do not interconnect. Holistic therapy treats the individual’s body, spirit, and mind. "}, {"url": "http://www.hearthsidehealing.com/holistic-mental-health-therapy/", "passage_text": "Holistic Mental Health Therapy. As a holistic mental health therapist, I am often asked how that is different from a regular counselor. While there is some overlap, there are also some differences. The main difference is that a holistic therapist spends quite a bit of time focused on health and well being. That means I look at diet, lifestyle habits, herbal and vitamin supplements, sleep, rest and exercise patterns as cornerstones of good mental health. These are some of the tools a holistic therapist may use in helping a patient to heal. The fundamental cornerstone of holistic therapy is nourishing the body so that positive transformations in mental health can take place."}, {"url": "http://my.clevelandclinic.org/services/wellness/integrative-medicine/treatments-services/holistic-psychotherapy", "passage_text": "Holistic psychotherapy utilizes traditional and non-traditional therapies of holistic healing with the purpose of creating an integration of the mind, body and spirit. "}, {"url": "http://healing.about.com/od/faq/p/holistichealing.htm", "passage_text": "What primarily distinguishes holistic healing apart from alternative medicine, complementary medicine, and integrative medicine is that physical health is not necessarily the main focus. Even so, it is often the experience of physical discomfort that will first prompt a person's pursuit of holistic healing. It is true that our pains and other physical discomforts demand our attention. This is where the saying sticking out like a sore thumb' originated from. Holistic healing is not an alternative to conventional medical care. Sometimes going to a medical professional is the best solution to addressing a dis-ease. Physical illnesses are the symptoms of a greater imbalance that may or may not have a root cause in the physical."}]