[{"url": "http://listverse.com/2012/03/09/top-10-mass-extinctions/", "passage_text": "Enormous sea scorpions became abundant, and trilobites continued to dominate. 420 million years ago, there was a sudden climate change which caused the extinction of perhaps 30% of all species. The atmospheric gases changed in proportions that many creatures found disagreeable or toxic. The cause of this change is not known. This is the biggest mass extinction in history, and is known as the a€˜â Great’. Dying for, reference let us look at the extinction of animals caused by. Humans during our, tenure high estimates suggest that we have wiped out nearly 1000 species of. animal"}, {"url": "http://personal.denison.edu/~hauk/bio380-2001/Cambrian.html", "passage_text": "1 There were many small-scale, sporadic extinction events during the Cambrian Period. 2  A large-scale mass extinction event occurred approximately 500 million years ago. 3  Scientists believe was caused by a significant decrease in global temperature. 1 A large-scale mass extinction event occurred approximately 500 million years ago. 2  Scientists believe was caused by a significant decrease in global temperature. 3  Decrease in global temperature created an ice age-further eliminated many of the oceanic species."}, {"url": "https://en.wikipedia.org/wiki/Cambrian_explosion", "passage_text": "The Cambrian explosion, or less commonly Cambrian radiation, was the relatively short evolutionary event, beginning around 542 million years ago in the Cambrian Period, during which most major animal phyla appeared, as indicated by the fossil record. "}, {"url": "http://austhrutime.com/mass_extinctions.htm", "passage_text": "There was at least 1 mass extinction event during this period that covered the time between 4.6 Ga (billion years ago) to 523 Ma (million years ago), occurring near the end of the period. During this period all organisms were soft-bodied, the first hard-shelled forms didn't evolve until the the Cambrian. "}, {"url": "http://personal.denison.edu/~hauk/bio380-2001/Cambrian.html", "passage_text": "Extinction Events. 1  There were many small-scale, sporadic extinction events during the Cambrian Period. 2  A large-scale mass extinction event occurred approximately 500 million years ago. 3  Scientists believe was caused by a significant decrease in global temperature. 1 A large-scale mass extinction event occurred approximately 500 million years ago. 2  Scientists believe was caused by a significant decrease in global temperature. 3  Decrease in global temperature created an ice age-further eliminated many of the oceanic species."}, {"url": "http://science.nationalgeographic.com/science/prehistoric-world/cambrian/", "passage_text": "Click here to download. The Cambrian period, part of the Paleozoic era, produced the most intense burst of evolution ever known. The Cambrian Explosion saw an incredible diversity of life emerge, including many major animal groups alive today. "}, {"url": "http://www.livescience.com/28098-cambrian-period.html", "passage_text": "Trilobites were the dominant species during the Cambrian Period, 540 to 490 million years ago. Credit: Bill Frische | Shutterstock. View full size image. The Cambrian Period is the first geological time period of the Paleozoic Era (the “time of ancient life”). This period lasted about 53 million years and marked a dramatic burst of evolutionary changes in life on Earth, known as the Cambrian Explosion.. Fossils of the Cambrian Period. Scientists find some of the best specimens for the “evolutionary experiments” of the Cambrian Period in the fossil beds of the Sirius Passet formation in Greenland; Chenjiang, China; and the Burgess Shale of British Columbia."}, {"url": "http://personal.denison.edu/~hauk/bio380-2001/Cambrian.html", "passage_text": "Cambrian Period. The Cambrian Period is the first period of the Paleozoic Era spanning from approximately 540 to 500 million years ago. It was named in 1835 by the geologist Adam Sedqwick, after the region of Cambria in Southern Wales and England, where rocks of this age were first found. 1 A large-scale mass extinction event occurred approximately 500 million years ago. 2  Scientists believe was caused by a significant decrease in global temperature. 3  Decrease in global temperature created an ice age-further eliminated many of the oceanic species."}, {"url": "http://www.ucmp.berkeley.edu/cambrian/cambrian.php", "passage_text": "The Cambrian Period. The Cambrian Period marks an important point in the history of life on Earth; it is the time when most of the major groups of animals first appear in the fossil record. This event is sometimes called the Cambrian Explosion, because of the relatively short time over which this diversity of forms appears. Stratigraphy. A lot can happen in 40 million years, the approximate length of the Cambrian Period. Animals showed dramatic diversification during this period of Earth's history. This has been called the Cambrian Explosion."}, {"url": "http://www.livescience.com/28098-cambrian-period.html", "passage_text": "The end of the Cambrian Period is marked by evidence in the fossil record of a mass extinction event about 490 million years ago. The Cambrian Period was followed by the Ordovician Period. Fossils of the Cambrian Period. Scientists find some of the best specimens for the “evolutionary experiments” of the Cambrian Period in the fossil beds of the Sirius Passet formation in Greenland; Chenjiang, China; and the Burgess Shale of British Columbia."}]