[{"url": "http://money.usnews.com/money/retirement/articles/2013/09/23/11-ways-to-avoid-the-ira-early-withdrawal-penalty", "passage_text": "But there are a variety of ways to avoid the IRA early withdrawal penalty if you meet specific criteria: Turn age 59 1/2. Once you turn age 59 1/2, you can withdraw any amount from your IRA without having to pay the 10 percent penalty. But regular income tax will still be due on each withdrawal. IRA distributions are not required until after age 70 1/2."}, {"url": "http://www.fool.com/money/allaboutiras/allaboutiras07.htm", "passage_text": "Penalties on Earnings from Contributions. Unless an exception applies, most distributions from a Roth IRA before the owner reaches age 59 1/2 will be subject to an early withdrawal penalty of 10% on the amount of the distribution."}, {"url": "http://www.rothira.org/early-withdrawal-penalties.html", "passage_text": "The rules for determining the penalties for withdrawing money early from a Roth IRA account are pretty easy to understand. You are allowed to withdraw money from your Roth IRA account once you reach age 59 1/2. If you withdraw funds from the account before you reach that age, you will be assessed the penalty."}, {"url": "http://finance.zacks.com/california-penalty-early-ira-distribution-8115.html", "passage_text": "The California IRA early withdrawal penalty isn't nearly as harsh as the IRS penalty. Instead of charging you 10 percent, California only hits your early IRA distribution with a 2.5 percent penalty. For example, if you take a $5,000 early IRA withdrawal, you owe $125 in penalties to California."}, {"url": "http://money.usnews.com/money/retirement/slideshows/10-ways-to-avoid-the-ira-early-withdrawal-penalty", "passage_text": "Withdrawals from individual retirement accounts before age 59 1/2 typically trigger a 10 percent early withdrawal penalty. However, there are several exceptions to the penalty if you meet certain circumstances or spend the money on specific purchases."}, {"url": "http://www.fool.com/money/allaboutiras/allaboutiras07.htm", "passage_text": "In 2001, before he is age 59 1/2, Paul withdraws $10,000 from the Roth IRA. Paul will have no tax to pay on this withdrawal because he paid income taxes on the full $20,000 he converted in 1998; however, he WILL have to pay a 10% penalty (or $1,000) unless one of the IRA early withdrawal exceptions apply."}]