[{"url": "http://www.ducks.org/conservation/waterfowl-biology/the-incubation-period/page2", "passage_text": "For female waterfowl, hatching a nest requires a big investment of time and energy. PAGE 1 2. SIGN IN SAVE TO MY DU PRINT AAA. The incubation period for waterfowl lasts from 21 to 31 days, and females spend from 73 to more than 99 percent of each day on the nest. In the extreme case of emperor geese, females spend as much as 99.5 percent of each day on the nest. This leaves a mere seven minutes a day for other activities such as feeding. "}, {"url": "http://www.ducks.org/conservation/waterfowl-biology/the-incubation-period", "passage_text": "Incubation provides the heat needed for embryos to develop inside the eggs of ducks and geese. Because the required temperature range of developing embryos is narrow, parents must commit to a rigorous incubation schedule. "}, {"url": "http://www.moosemanorfarms.com/about-muscovy-ducks.html", "passage_text": "Since Muscovy are genetically disimilar to other domestic waterfowl, many folks believe that they're more of a goose than a duck. For instance, they eat grass, as do geese, have a similarly long egg incubation period of 35 days (compared with 28 days for ducks), and they don't quack. This is a good trait since they are quiet ducks. The male has a low breathy call, and the female a quiet trilling coo. "}, {"url": "http://www.answers.com/Q/How_long_is_the_incubation_period_for_a_duck", "passage_text": "It's 28 days for all domestic ducks except Muscovies, who are 35 days. Muscovies, at least, sit undisturbed for 24 hours when commencing the sit. If you have other duck eggs that you want to add to the Muscovy's clutch, wait a week and make sure the eggs are warm when you slip them under. If you keep the water temperature at a steady 70 degrees Fahrenheit, the incubation period for a goldfish is about five days. If the water temperature is kept at around 65 deg … rees Fahrenheit, the incubation period is about seven days. 3 people found this useful."}, {"url": "http://www.answers.com/Q/How_long_is_the_incubation_period_for_a_duck", "passage_text": "What temperature for duck egg incubation period?   99.5 degrees Fahrenheit (37.5 degrees Celsius) is optimum incubating temp. for duck eggs with the temp. being lowered by one degree to 98.5 in the last 3 days of incubat … ion (25-28th day). Lowest temp. If you keep the water temperature at a steady 70 degrees Fahrenheit, the incubation period for a goldfish is about five days. If the water temperature is kept at around 65 deg … rees Fahrenheit, the incubation period is about seven days. 3 people found this useful."}, {"url": "http://woodducksociety.com/qanda.htm", "passage_text": "Predicting Jump Day: A hen wood duck usually lays one egg per day until her clutch is complete. The normal incubation period for a wood duck is usually 29 -30 days. You will have to get an accurate egg count and note the date sometime during the egg laying stage, before the hen starts her incubation. When the entire clutch of eggs has been laid, the hen will begin full-time incubation. This assures that all the eggs have a good chance to hatch together on the same day. During the incubation period, the hen will leave the nest box twice daily to feed (morning and evening) for about 30 minutes."}, {"url": "http://www.grit.com/animals/duck-hatching-our-morning-surprise.aspx", "passage_text": "We have two ducks sitting on eggs right now. One is in the feed area (she deserves her very own blog post), and the other is in the duck pen. Recently, I'd looked up the incubation period for ducks, and while baby chickens hatch in 21 days, Rouen ducks hatch in 28 days and Muscovies in 35 days. As this is our first time hatching our own – in fact, we're not hatching anything .."}, {"url": "http://www.enature.com/expert/expert_show_question.asp?questionID=4772", "passage_text": "The incubation period for mallards is 23 to 29 days; other duck species are similar. The fact that the hen has not eaten is unusual. Hens usually leave the nest a couple of times a day for short periods, a hour or less, to feed. "}, {"url": "http://woodducksociety.com/qanda.htm", "passage_text": "The incubation period for wood ducks varies, but is usually between 28 and 32 days. The entire clutch hatches in less than 24 hours. The hen will leave the nest box with her new brood on the first morning after the initial egg was hatched. When the entire clutch of eggs has been laid, the hen will begin full-time incubation. This assures that all the eggs have a good chance to hatch together on the same day. During the incubation period, the hen will leave the nest box twice daily to feed (morning and evening) for about 30 minutes."}]