[{"url": "http://www.taopage.org/tao.html", "passage_text": "The Chinese character for tao is made of 2 signs: head and foot or walking. That is the conscious walking or the ancient (way of) walking. In Tao-te ching, Tao is the name given by Lao-tzu to the Great Pervader or the Mother of all Things. Tao is the creator and sustainer of everything in the Universe. It is described as follows: There was something undefined and complete, coming into existence before Heaven and Earth... "}, {"url": "http://taoism.net/tao/what-is-tao/", "passage_text": "Tweet. Tao (pronounced “dao”) means literally “the path” or “the way.” It is a universal principle that underlies everything from the creation of galaxies to the interaction of human beings. The workings of Tao are vast and often beyond human comprehension. In order to understand it, reasoning alone will not suffice. "}, {"url": "http://www.beliefnet.com/faiths/taoism/what-do-taoists-believe.aspx", "passage_text": "Not a transcendent ultimate, the Tao is found in the world (especially through nature), and can be encountered directly through mystical experience. It is the ultimate reality as well as the proper natural way of life humans must follow. Taoism prizes naturalness, non-action, and inwardness. "}, {"url": "http://taoism.net/articles/what_tao.htm", "passage_text": "Tao (pronounced dao) means literally the path or the way.. It is a universal principle that underlies everything from the creation of galaxies to the interaction of human beings. The workings of Tao are vast and often beyond human logic. In order to understand Tao, reasoning alone will not suffice. One must also apply intuition."}, {"url": "https://en.wikipedia.org/wiki/Tao", "passage_text": "The concept of Tao differs from conventional (western) ontology: it is an active and holistic conception of Nature, rather than a static, atomistic one. Within the context of traditional Chinese philosophy and religion, The Tao is the intuitive knowing of life that of which cannot be grasped full-heartedly as just a concept but known nonetheless through actual living experience of one's everyday being."}, {"url": "https://en.wikipedia.org/wiki/Taoism", "passage_text": "Taoism (sometimes Daoism) is a philosophical, ethical or religious tradition of Chinese origin, or faith of Chinese exemplification, that emphasizes living in harmony with the Tao (also romanized as Dao). In Taoism, however, Tao denotes something that is both the source of, and the force behind, everything that exists."}, {"url": "https://en.wikipedia.org/wiki/Tao", "passage_text": "In the foundational text of Taoism, the Tao Te Ching, Laozi explains that Tao is not a 'name' for a 'thing' but the underlying natural order of the universe whose ultimate essence is difficult to circumscribe due to it being non conceptual yet evident in one's being of aliveness. Within the context of traditional Chinese philosophy and religion, The Tao is the intuitive knowing of life that of which cannot be grasped full-heartedly as just a concept but known nonetheless through actual living experience of one's everyday being."}, {"url": "https://en.wikipedia.org/wiki/Taoism", "passage_text": "The term Tao means way, path, or principle, and can also be found in Chinese philosophies and religions other than Taoism. In Taoism, however, Tao denotes something that is both the source of, and the force behind, everything that exists."}, {"url": "http://taoism.about.com/od/tao/a/taopathlessway.htm", "passage_text": "The literal translation of Tao is “way” or “path.” It is associated with a life of simplicity, quietude and harmony, both in relation to the natural world, as well as in our interactions with social/political institutions. Although there are hundreds of deities in the Taoist pantheon, with Tai-shang Lao-chun -- the deified Laozi -- at the top, Taoism’s ultimate principle, named as Tao, is decidedly non-theistic, pointing to a realm beyond any specific form."}, {"url": "http://www.bbc.co.uk/religion/religions/taoism/beliefs/tao.shtml", "passage_text": "The most useful words to stimulate an idea of the Tao are found in the Tao Te Ching and Chuang Tzu : The Tao that can be told is not the eternal Tao; The name that can be named is not the eternal name. The Nameless is the origin of Heaven and Earth; The Named is the mother of all things. ...... There was something undifferentiated and yet complete, Which existed before Heaven and Earth. Relating to the Tao. Many Taoist ideas come from other Chinese schools of thought. It's not always easy to draw accurate distinctions between ideas that are fundamentally Taoist and those that Taoism took in from elsewhere, especially Buddhism."}]