[{"url": "http://usatoday30.usatoday.com/sports/baseball/stories/2001-12-05-antitrust-explanation.htm", "passage_text": "The Supreme Court hasn't reviewed the exemption since the Flood case, and it has been punctured since then in Florida and Pennsylvania. The Florida Supreme Court, in a 5-1 decision in 1994, ruled the antitrust exemption applies only to the reserve system, not the overall business of the sport. By Ronald Blum, The Associated Press. Unlike other sports, baseball can block franchise moves and sales because of a unique antitrust exemption created by the U.S. Supreme Court in 1922. Baltimore, the last team remaining from the Federal League that operated in 1914-15, sued major league owners, claiming they violated the Sherman Antitrust Ac"}, {"url": "http://blog.oup.com/2013/03/baseball-history-antitrust-law/", "passage_text": "The exemption’s origin is a 1922 Supreme Court case called Federal Baseball Club of Baltimore v. National League, in which the Court held that the federal antitrust laws did not apply to baseball, because these laws only governed interstate commerce, and baseball was not a form of interstate commerce. Stuart Banner is the Norman Abrams Professor of Law at UCLA. His latest book, The Baseball Trust: A History of Baseball’s Antitrust Exemption (2013), has just been published by Oxford University Press."}, {"url": "http://sportslaw.uslegal.com/antitrust-and-labor-law-issues-in-sports/", "passage_text": "Baseball has held a unique exemption from antitrust laws i n accordance with the interpretation of the Supreme Court in Federal Baseball Club of Baltimore, Inc. v. National League of Professional Baseball Clubs (1922). The Court held that antitrust laws do not apply to professional baseball. "}, {"url": "http://www.slate.com/articles/news_and_politics/history_lesson/2002/07/baseballs_con_game.html", "passage_text": "The antitrust exemption is an irony. Owners and players prove day after day that they consider baseball above all a business. But the exemption stems from the government's naive insistence that baseball is only a game. Abolishing the antitrust exemption wouldn't bring peace to baseball. Conflict is hardwired into the player-owner relationship, as it is in any labor-management arrangement where gross inequities persist."}, {"url": "http://blog.oup.com/2013/03/baseball-history-antitrust-law/", "passage_text": "Nor can it be found in the economic structure of the baseball business, which is identical to that of the other major professional team sports. Applying antitrust law to sports can raise some difficult questions, but they are the same questions in baseball as in other sports. Stuart Banner is the Norman Abrams Professor of Law at UCLA. His latest book, The Baseball Trust: A History of Baseball’s Antitrust Exemption (2013), has just been published by Oxford University Press."}, {"url": "https://en.wikipedia.org/wiki/Federal_Baseball_Club_v._National_League", "passage_text": "Federal Baseball Club v. National League, 259 U.S. 200 (1922), is a case in which the U.S. Supreme Court ruled that the Sherman Antitrust Act did not apply to Major League Baseball. "}]