[{"url": "http://www.howtogeek.com/183667/how-to-use-onedrive-as-your-default-save-location-on-windows-8.1/", "passage_text": "Right-click one of the libraries and select Properties. Click the Add button to add a new folder and select a folder in your OneDrive folder. You may need to create a new folder in OneDrive for this. Add that folder to the library, then select it and click Set save location. Files you save to the library will now automatically be saved to the folder on OneDrive and synchronized across your computers."}, {"url": "https://support.google.com/drive/answer/2424384?hl=en", "passage_text": "With Google Drive on the web, you can: 1  Create, add, or upload a file using a single button. 2  Find and add files shared with you more easily. 3  Single-click a file to select it and double-click a file to open it. 4  Drag-and-drop files and folders just like you do on your desktop. 5  Take advantage of improved accessibility. With Google Drive on your Mac/PC, you can: 1  Drag files into and out of the folder. 2  Rename files. 3  Move files and folders around. 4  Edit and save files. 5  Move files to trash. 6  Access your files even when you’re not connected to the Internet"}, {"url": "https://support.google.com/drive/answer/2424384?hl=en", "passage_text": "With Google Drive on your mobile device, you can: 1  View, share, and organize your files. 2  Upload and store new files directly from your phone or tablet. 3  Print files from your mobile device. 4  Scan important documents using the camera on your mobile device. 5  Access your files even when you’re not connected to the Internet. With Google Drive on your Mac/PC, you can: 1  Drag files into and out of the folder. 2  Rename files. 3  Move files and folders around. 4  Edit and save files. 5  Move files to trash. 6"}, {"url": "https://www.google.com/drive/using-drive/", "passage_text": "Share how you want. Safe and secure. Your storage works with Drive, Gmail and Google Photos, so you can store files, save email attachments and back-up photos directly to Drive. You can also purchase a larger cloud storage plan as you need it. Photos, videos, presentations, PDFs – even Microsoft Office files. Get that expertly edited look without the effort, plus animations, movies, and more.. Google Drive is built-in to Chromebooks, so your files and photos are automatically backed up. You'll get 100GB of free storage for two years with most new Chromebooks."}, {"url": "http://www.hongkiat.com/blog/google-drive-tips-tricks/", "passage_text": "5. If you want to instantly save images, documents, HTML5 audio and videos to your Google Drive, you can do so by installing the Save to Google Drive Chrome extension. With the extension, whenever you right click on a link or image, you get the option to save the image or link directly to your Google Drive. "}, {"url": "http://ctrlq.org/save/", "passage_text": "save web files. You can save any file from the Internet directly to your account on Dropbox, Google Drive, Box or Microsoft OneDrive. There's no need to download the file to your computer and the app works on mobile too.. learn more →."}, {"url": "https://plus.google.com/+GoogleDrive/posts/A9NNmYBG2BN", "passage_text": "Save content from anywhere on the web to your Drive with a new Chrome extension, plus updates to images. Today, we're introducing a new Save to Drive Chrome extension that gives you a couple of ways to capture content from around the web and store it right to your Google Drive. Once you've installed the extension, you can click the Drive extension icon to save an image of a page, the HTML source code, or a Web archive. Or you can right-click on images or links to files and save them directly to Drive. We've also added a few new ways to work with images that are already stored in Drive"}]