[{"url": "http://costowl.com/home-improvement/garage-build-cost.html", "passage_text": "1 According to HomeAdvisor.com, a new garage costs between $9,000 and $45,000, with an average cost of roughly $20,000 to $30,000. 2  Per square foot (psf), expect garage prices to begin at $30 to $50 psf for basic materials. 3  Using higher end materials could increase costs by 15 to 25 percent ($35 to $65 psf). "}, {"url": "http://www.fixr.com/costs/build-detached-garage", "passage_text": "For the building of the garages, the typical costs will include: 1  Two car-According to Hanley Wood and their Remodeling magazine, the cost to construct a standard two-car garage addition is $58,432. 2  This translates to $86 per square foot; and. 1 This translates to $86 per square foot; and. 2  Four car-Traditionally, the per square foot costs on larger structures will decrease, and it is safe to assume a $60 per square foot cost on the larger unit. 3  This translates to a total cost of $86,400."}, {"url": "http://www.fixr.com/costs/build-attached-garage", "passage_text": "Adding a garage to a home can require an extensive amount of work, and for this project we will assess the cost of building an attached garage of 676 square feet (26'x26') to a pre-existing home (this is going to easily accommodate two vehicles, provide storage and even have room for a small work area). For the garage addition, the typical costs include: 1  According to author Stu Silverman the average cost of adding a garage begins at roughly $7,500, and for a two-car garage the average costs will go much higher. 2  This sort of structure will average at $27,040."}, {"url": "http://www.fixr.com/costs/build-detached-garage", "passage_text": "For this discussion we will assess the costs of building detached a two-car as well as a four car garage. The measurements of the average two car model is 26'x26'or 676 square feet. The average square footage of a four car garage is 48'x30' or 1440 square feet. 1 This translates to $86 per square foot; and. 2  Four car-Traditionally, the per square foot costs on larger structures will decrease, and it is safe to assume a $60 per square foot cost on the larger unit. 3  This translates to a total cost of $86,400."}, {"url": "http://www.fixr.com/costs/build-detached-garage", "passage_text": "1 Four car-Traditionally, the per square foot costs on larger structures will decrease, and it is safe to assume a $60 per square foot cost on the larger unit. 2  This translates to a total cost of $86,400. 1 This translates to $86 per square foot; and. 2  Four car-Traditionally, the per square foot costs on larger structures will decrease, and it is safe to assume a $60 per square foot cost on the larger unit. 3"}, {"url": "http://www.behmdesign.com/garage-building-cost.aspx", "passage_text": "by Jay Behm-A very basic way to estimate the cost of building a detached garage is to simply apply a typical average per square foot construction of $30 to $40. That is for an average cost basis for having a contractor / builder build a basic one story garage for you on your property. But for now this will get you in the ballpark of cost to build your new garage. Foundation/Slab Cost: $_____________________________________. The most reliable method for rough cost estimating of concrete foundation and slab work is to contact a local concrete contractor-one who specializes in this work."}, {"url": "http://www.buildingsguide.com/faq/how-much-does-it-cost-build-30x40-garage", "passage_text": "If a foundation is needed for a prefabricated steel garage, its cost will add another $4 to $8 per square foot. In contrast, hiring a contractor to build a traditional (stick built) wooden 30x40 garage can cost from $35 to $45 per square foot, for a total cost of $42,000 to $54,000. This equates to a saving of around $20,000 (assuming you self-build). "}, {"url": "http://www.rempros.com/costs/building_garage_prices.html", "passage_text": "Cost to build a new 2 car garage will vary from $30 to $41 per square foot for standard construction including labor cost and materials prices. "}, {"url": "http://www.homerenovationwi.com/how-much-will-it-cost-to-build-a-garage-on-my-property/", "passage_text": "The cost to build your garage is generally calculated by the square footage of the building along with any of the additional extras you might require. A good rough ballpark would be $40-$100 per square foot of construction. This would be a decent sized two car garage with a bit of room around the edges for shelving and storage. If we calculate out a rough finished cost of say $55 per square foot to construct the building you are looking at roughly $38,500 to build your very basic, bare bones garage."}, {"url": "http://home.costhelper.com/build-garage.html", "passage_text": "1 Upgrading the quality of materials can bump the cost to $55 a square foot, or $13,200 for a minimum single-car structure, $21,000 for a two-car garage and $47,000 or more for the dream version. "}]