[{"url": "http://waynesville-ohio.org/", "passage_text": "Village of Waynesville’s Mayor, David Stubbs, has called a Special Council Meeting on Thursday October 15th, 2015 at 7 PM at the Waynesville Government Center, 1400 Lytle Road. The public is welcome to attend. The purpose for this meeting is to discuss the topic of the sewer plant transfer and related issues."}, {"url": "http://www.skydivewarrencounty.com/", "passage_text": "Skydiving Cincinnati and the Tri-State Area since 1969. Welcome to Skydive Warren County, the Tri-State's oldest United States Parachute Association dropzone. Our family owned and operated dropzone has been providing first-class skydiving in Ohio since 1969. Your safety is always our number one priority."}, {"url": "https://www.coldwellbanker.com/real_estate/home_search/oh/Waynesville", "passage_text": "The median age of homes in Waynesville, OH is 30 years, with 67% of those homes owned, 28% rented, and 5% not occupied. In the previous year, 30 Waynesville properties were sold. The median sale price of a home in Waynesville in the previous year was $124,404."}, {"url": "http://www.ohioslargestplayground.com/shop/antique-specialty-shops/waynesville/browse", "passage_text": "Waynesville. Founded before Ohio even became a state, a trip to Waynesville is like stepping back in time. Waynesville has earned an unsurpassed reputation for its variety of antique shops and unique treasures."}, {"url": "http://ohio.hometownlocator.com/oh/warren/waynesville.cfm", "passage_text": "The Village of Waynesville had a population of 2,904 as of July 1, 2015. The primary coordinate point for Waynesville is located at latitude 39.5319 and longitude -84.0909 in Warren County. The formal boundaries for the Village of Waynesville (see map below) encompass a land area of 2.38 sq. miles and a water area of 0.01 sq. miles. Warren County is in the Eastern time zone (GMT -5)."}, {"url": "https://www.coldwellbanker.com/real_estate/home_search/oh/Waynesville", "passage_text": "Waynesville, Ohio is located in Warren County. Waynesville is a suburban community with a population of 2,928. The median household income is $49,576. In Waynesville, 51% of residents are married, and families with children reside in 35% of the households."}]