[{"url": "http://www.maldonsalt.co.uk/The-Story-How-Maldon-Salt-is-made.html", "passage_text": "Harvesting sea salt the traditional way. You could contend that Maldon Salt is really made by nature, with just a little helping hand from man to release it from the clutches of the environment. Certainly the ‘process’, if you can call it that, is about as natural as these things can be"}, {"url": "http://www.maldonsalt.co.uk/About-Salt-What-is-Salt.html", "passage_text": "It is translucent, colourless, odourless (officially, though we think you can smell the freshness of the sea in one of our boxes) and has a distinctive and characteristic taste. Salt occurs naturally in many parts of the world in mineral form and has been mined for thousands of years. Chemically, sea salt is the same. Gastronomically, it’s very different. Our rather firm views on salt are not shared by everybody. You’ll find some alternative points of view among the sources below, included here in a spirit of salty open mindedness, rather than agreement"}, {"url": "http://www.maldonsalt.co.uk/About-Salt-What-is-Salt.html", "passage_text": "We’ll adopt a schoolmasterly tone at this point. Salt (NaCl) is a natural mineral made up of white cube-shaped crystals composed of two elements, sodium and chlorine. Salt occurs naturally in many parts of the world in mineral form and has been mined for thousands of years. Chemically, sea salt is the same. Gastronomically, it’s very different. Our rather firm views on salt are not shared by everybody."}, {"url": "https://en.wikipedia.org/wiki/Maldon,_Essex", "passage_text": "Maldon (/ˈmɔːldən/ , locally /ˈmɒldən/) is a town on the Blackwater estuary in Essex, England. It is the seat of the Maldon district and starting point of the Chelmer and Blackwater Navigation. Maldon is twinned with the Dutch town of Cuijk. The charter between the two towns was signed in 1970 to cement the relationship."}, {"url": "http://www.williams-sonoma.com/products/maldon-salt/", "passage_text": "Summary. You can taste the difference between common table salt and this superb natural sea salt. Founded in 1882, England’s Maldon Salt Crystal Company still draws salt from seawater using traditional long-handled rakes, processing it with no artificial additives for flavor that's pure and clean. 1  Premium all-natural sea salt has a clean taste with no bitterness. 1 Premium all-natural sea salt has a clean taste with no bitterness. 2  The purity of the water’s trace elements makes this salt more flavorful, so you can use less. 3  Soft, flaky, pyramid-shaped crystals dissolve easily."}, {"url": "http://www.thespicehouse.com/spices/english-maldon-sea-salt", "passage_text": "Categories: English, Salt. Maldon English Sea Salt is a fabulous pure crystal salt. It comes from Essex, which is located in Southeastern England. This fine salt is harvested by a family run business that has been panning salt since 1882. This family run business has been producing sea salt since 1882. "}, {"url": "http://www.cooksinfo.com/maldon-salt", "passage_text": "Maldon Salt is one of the very best finishing salts, both owing to its taste and its crisp texture. 1 cup maldon salt = 4 1/2 oz = 130g. The Romans devised the original methods for harvesting the salt here during the time that Essex was a Roman colony. Maldon Salt is made in Essex County, England, in the town of Maldon (known by the locals as Maldon on the Mud) by the Maldon Crystal Salt Company. To make the salt, seawater is taken from estuaries"}, {"url": "http://www.maldonsalt.co.uk/The-Story-How-Maldon-Salt-is-made.html", "passage_text": "How Maldon Salt is Made. You could contend that Maldon Salt is really made by nature, with just a little helping hand from man to release it from the clutches of the environment. Certainly the ‘process’, if you can call it that, is about as natural as these things can b"}, {"url": "http://www.cooksinfo.com/maldon-salt", "passage_text": "Maldon Salt is an English sea-salt. It comes in large, thin, uneven, crunchy salt flakes that have a very clean, pure salt taste. It is meant to be a finishing salt, used at the table in small amounts, rather than in cooking. Maldon Salt is made in Essex County, England, in the town of Maldon (known by the locals as Maldon on the Mud) by the Maldon Crystal Salt Company. To make the salt, seawater is taken from estuaries"}]