[{"url": "http://www.chattahoocheetech.edu/wp-content/uploads/2015/04/tuition-and-fees-fall-2015.pdf", "passage_text": "Full time enrollment for federal student aid (Pell Grant, etc.) and insurance verification purposes is 12 or more credit hours. Tuition is assessed at one of three levels per semester: 1. Standard tuition cost is $89 per credit hour for in-state, Georgia residents. Maximum per term: $1,335.00. 2. Out-of-state students pay tuition twice the amount charged for Georgia residents. "}, {"url": "http://www.collegecalc.org/colleges/georgia/chattahoochee-technical-college/", "passage_text": "Annual Total Cost. The total list price for in-state Georgia residents to go to Chattahoochee Technical College is $9,531 for the 2014/2015 academic year. Out-of-state students who don't possess Georgia residence can expect a one year cost of $11,667. This could be your effective total out of pocket cost of an education at Chattahoochee Technical College. Note that this calculation assumes you don't pay full list price tuition, are part of the reported 87% of students at this school who receive financial aid and you are paying an average annual net price of $6,365."}, {"url": "http://www.cappex.com/colleges/Chattahoochee-Technical-College/tuition-and-costs", "passage_text": "Unknown No information on this college's average annual institutional aid available. Future projections are based on past four years' data averaging 3.26% annual change in in-state tuition and fees and 2.04% change in out-of-state tuition and fees. Amounts shown are estimates only and not guaranteed. For a better estimate, contact the college directly. Average Aid. Future projections are based on past four years' data averaging 3.26% annual change in in-state tuition and fees and 2.04% change in out-of-state tuition and fees."}, {"url": "http://college-tuition.startclass.com/l/1005/Chattahoochee-Technical-College", "passage_text": "Out-of-State : $4,818. Chattahoochee Technical College's in-state tuition is more expensive than the average public 2 year college in Georgia's in-state tuition ($2,388), but it is cheaper than the average college in Georgia's in-state tuition ($7,680). The school's out-of-state tuition is more expensive than the average public 2 year college in Georgia's out-of-state tuition ($4,489), but it is cheaper than the average college in Georgia's out-of-state tuition ($9,648). 2014-2015 Academic Year."}, {"url": "http://www.collegetuitioncompare.com/edu/140331/chattahoochee-technical-college/tuition/", "passage_text": "Chattahoochee Technical College is public, 2-4 years located in Marietta, Georgia. For academic year 2014-2015, the undergraduate tuition & fees at Chattahoochee Technical College is $2,682 for in-state and $4,818 for out-of-state students. Average living costs is $5,899 for students living off campus. On-campus living costs stayed same from the previous year"}, {"url": "http://www.cappex.com/colleges/Chattahoochee-Technical-College/tuition-and-costs", "passage_text": "Tuition Trends. Future projections are based on past four years' data averaging 3.26% annual change in in-state tuition and fees and 2.04% change in out-of-state tuition and fees. Amounts shown are estimates only and not guaranteed. For a better estimate, contact the college directly. Average Aid. Future projections are based on past four years' data averaging 3.26% annual change in in-state tuition and fees and 2.04% change in out-of-state tuition and fees."}, {"url": "http://www.collegecalc.org/colleges/georgia/atlanta-technical-college/", "passage_text": "This is 35% cheaper than the national average public two year tuition of $3,263. The cost is $2,903 and 58% cheaper than the average Georgia tuition of $5,039 for 2 year colleges. Tuition ranks 21st in Georgia amongst 2 year colleges for affordability and is the 33rd most expensive 2 year college in the state. Annual Total Cost. The total list price for in-state Georgia residents to go to Atlanta Area Tech is $8,740 for the 2014/2015 academic year. Out-of-state students who don't possess Georgia residence can expect a one year cost of $10,876."}, {"url": "http://www.collegecalc.org/colleges/georgia/chattahoochee-technical-college/", "passage_text": "Chattahoochee Technical College tuition is $2,136 per year for in-state residents. This is 35% cheaper than the national average public two year tuition of $3,263. The cost is $2,903 and 58% cheaper than the average Georgia tuition of $5,039 for 2 year colleges. Tuition ranks 17th in Georgia amongst 2 year colleges for affordability and is the 37th most expensive 2 year college in the state. This could be your effective total out of pocket cost of an education at Chattahoochee Technical College. Note that this calculation assumes you don't pay full list price tuition, are part of the reported 87% of students at this school who receive financial aid and you are paying an average annual net price of $6,365."}]