[{"url": "https://answers.yahoo.com/question/index?qid=20060926153952AAmAQI0", "passage_text": "Where I live they pay teens $10/hour. The other answers must come from small towns or the midwest where the rates are lower. The kids in my city would laugh if you offered to pay them $5/per hour. My 12 year old makes $5/hour as a mother's helper (the mom is home with her)."}, {"url": "http://www.babysitting-rates.com/", "passage_text": "Time of Day. Regular babysitting hours are typically considered between 8:00am and 10:00pm. If you require a babysitter to babysit outside of these usual hours, additional compensation should be considered. If paying hourly, an extra $2 per hour worked past 10:00pm or before 8:00am is reasonable. How much experience a babysitter has is one of the most important factors in determining a reasonable babysitting charge. A high school student with little or no experience would normally earn much less than an experienced adult."}, {"url": "http://www.huffingtonpost.com/2012/06/07/babysitting-costs-hourly-rate-infographic-urbansitter_n_1577285.html", "passage_text": "Some New York babysitters caring for three children at a time might even make more than $20 per hour. The overall average hourly cost for babysitters in all cities is $12.75. Other sites, like Sittercity.com and Care.com, offer alternative (and seemingly more modest) rate calculators. Care.com recommends $12.50 per hour for a single-child sitter in New York City; Sittercity.com recommends $14.50. "}, {"url": "http://www.care.com/child-care-babysitting-cost-p1145-q22781.html", "passage_text": "You can also use the Care.com Babysitter Pay Calculator to see what the average rate is in your town. If you want to use this rate, we suggest adding the Babysitting Pay Calculator Widget to your blog or in any messages you send to a potential sitter so the pay rate in your area is known. 1 Where you live -- Cost of living is an issue no matter the job title. 2  Babysitters in big cities will get paid more than babysitters in small towns. 3  If you live near Boston, visit our Boston Babysitters page to see what the average pay is for sitters in the area."}, {"url": "http://www.care.com/child-care-babysitting-cost-p1145-q22781.html", "passage_text": "Babysitting a child is a sensitive job. you as a babysitter are responsible for that child. the average rate starts at 10$/hour for one child. if the parents want to pay 20-40$/day they should take the children to daycare. 1 Where you live -- Cost of living is an issue no matter the job title. 2  Babysitters in big cities will get paid more than babysitters in small towns. 3  If you live near Boston, visit our Boston Babysitters page to see what the average pay is for sitters in the area."}, {"url": "http://www.care.com/child-care-babysitting-cost-p1145-q22781.html", "passage_text": "1 Number and age(s) of children -- If you have more than one child, expect to pay $2 to $5 more an hour for each additional child. 2  This range reflects variability in the care giving required for each child (see below). 1 Where you live -- Cost of living is an issue no matter the job title. 2  Babysitters in big cities will get paid more than babysitters in small towns. 3  If you live near Boston, visit our Boston Babysitters page to see what the average pay is for sitters in the area."}, {"url": "http://www.care.com/babysitting-rates", "passage_text": "1 Expect to pay at least another $1-2 per hour in addition to the basic rate. 2  Basic tidying up and getting the kids a snack are usually included in your basic rate—just be sure your babysitter knows what your expectations are. "}, {"url": "http://abcnews.go.com/Business/pay-babysitter/story?id=23736479", "passage_text": "According to UrbanSitter's 2014 Childcare Rate Survey of nine large metro areas, the average babysitter wage paid in New York City is $15.34 per hour while in Denver it's $10.84 per hour. The non-scientific survey was conducted in March and April 2014 with UrbanSitter's transactional data from 7,500 families. "}, {"url": "https://nz.answers.yahoo.com/question/index?qid=20091025054328AANa0wh", "passage_text": "Best Answer: Contact 3 local day care centers. Ask their hourly or daily rate for the age groups that you'll be babysitting. If you get a daycare license, you can charge dollar for dollar. If unlicensed, you will need to charge a dollar less per hour. I strongly suggest a business license when babysitting, even if a teenager. "}, {"url": "https://answers.yahoo.com/question/index?qid=20070611164247AAPUGd9", "passage_text": "· just now. Report Abuse. It depends how many kids you are watching, If you are watching 1 or 2 kids I would say $4 to $5 an hour. If three or more for 4 hours of babysitting I would say $6.00 an hour. or a flat $ 25 to $30 A night. Taht is very reasonable. mommy4 five · 8 years ago. "}]