[{"url": "http://www.factmonster.com/cig/chemistry/what-acids-bases.html", "passage_text": "Generally, the Lewis definition of acids and bases is the most useful because it is the most inclusive of the three definitions. For example, the Broensted-Brønsted lowry definition of an acid INCLUDES hf but NOT bh, 3 which'doesn t lose a proton when attached by the lone pairs on A lewis. Base excerpted. © from 2003 By Ian. guch "}, {"url": "http://www.answers.com/Q/What_is_true_about_nucleic_acids", "passage_text": "No, definitely not. An amino acid is a building block, a constituent, the base unit of polypeptides and thus of proteins. There are 20 different amino acids (valine, lysine, … aspartate, glutamate, glycine, tryptophan, phenylalanine and so on). "}, {"url": "https://en.wikipedia.org/wiki/Acid", "passage_text": "An acid (from the Latin acidus/acēre meaning sour) is a chemical substance whose aqueous solutions are characterized by a sour taste, the ability to turn blue litmus red, and the ability to react with bases and certain metals (like calcium) to form salts. Aqueous solutions of acids have a pH of less than 7. Non-aqueous acids are usually formed when an anion (negative ion) reacts with one or more positively charged hydrogen cations. A lower pH means a higher acidity, and thus a higher concentration of positive hydrogen ions in the solution. A strong acid is one that completely dissociates in water; in other words, one mole of a strong acid HA dissolves in water yielding one mole of H + and one mole of the conjugate base, A − , and none of the protonated acid HA."}, {"url": "http://openstudy.com/updates/51b508a5e4b06ee3ee2855b8", "passage_text": "You've already chosen the best response. strong acids give up hydrogen ions when dissolving in water, and do so very nearly completely. a strong acid does not have to have a high concentration (you could mix a small quantity with a large volume of water, which would make a low concentration of a strong acid). "}, {"url": "https://www.wyzant.com/resources/lessons/science/chemistry/acid-base-titrations", "passage_text": "To begin a discussion about acid-base titrations, we must first recall that there are several definitions of acids and bases. For the purpose of this exercise, we will consider the Arrhenius definition of acids and bases, in which an acid is a proton (H +) donor and a base produces hydroxide (OH -) in solution. There are several different types of acid-base titrations. To understand the difference, we must briefly review what a strong acid/base vs. a weak acid/base is. A strong acid is an acid that is said to completely dissociate, meaning that every molecule of that acid in solution gives off an H +"}, {"url": "https://answers.yahoo.com/question/index?qid=20100314224837AAycEUE", "passage_text": "Here's why: An acid has a pH below 7. At exactly pH 7 a solution is neutral. Any pH above 7 is basic. Electrolytes are compounds that dissociate (separate) in solutions. Strong acids/bases are strong electrolytes. Weak acids/bases are weak electrolytes. So, answer C is incorrect because it could be true or false depending upon what kind of acid you have. Acids want to get rid of H+ ions (it's part of what characterizes them). Bases have an affinity for H+ ions and want to pick them up. "}, {"url": "https://answers.yahoo.com/question/index?qid=20091124133911AAiB8qW", "passage_text": "This is what strong acids do. strong acids conjugate to weak bases, acids have low pH, all acids are pretty good electrolytes, and all acids will react with either weak or strong bases. illuminatiscott · 6 years ago. Thumbs up. "}, {"url": "http://chemed.chem.purdue.edu/genchem/topicreview/bp/ch11/acidbase.php", "passage_text": "Al(OH) 3, for example, acts as an acid when it reacts with a base. Conversely, it acts as a base when it reacts with an acid. The Br nsted Definition of Acids and Bases. The Brnsted, or Brnsted-Lowry, model is based on a simple assumption: Acids donate H ions to another ion or molecule, which acts as a base. The dissociation of water, for example, involves the transfer of an H + ion from one water molecule to another to form H 3 O + and OH-ions. Acids provide the H + ion; bases provide the OH-ion; and these ions combine to form water. H+(aq) + OH-(aq) H2O(l). The Arrhenius theory has several disadvantages. 1  It can be applied only to reactions that occur in water because it defines acids and bases in terms of what happens when compounds dissolve in water."}, {"url": "http://www.ducksters.com/science/acids_and_bases.php", "passage_text": "Almost all liquids are either acids or bases to some degree. Whether a liquid is an acid or base depends on the type of ions in it. If it has a lot of hydrogen ions, then it is an acid. If it has a lot of hydroxide ions, then it is a base. Acids with a low pH of around 1 are very reactive and can be dangerous. The same is true for bases of a pH near 13. Chemists use strong acids and bases to get chemical reactions in the lab."}, {"url": "http://chemed.chem.purdue.edu/genchem/topicreview/bp/ch11/acidbase.php", "passage_text": "These definitions tie the theory of acids and bases to a simple laboratory test for acids and bases. To decide whether a compound is an acid or a base we dissolve it in water and test the solution to see whether the H + or OH-ion concentration has increased. Acids provide the H + ion; bases provide the OH-ion; and these ions combine to form water. H+(aq) + OH-(aq) H2O(l). The Arrhenius theory has several disadvantages. 1  It can be applied only to reactions that occur in water because it defines acids and bases in terms of what happens when compounds dissolve in water."}]