[{"url": "http://essayinfo.com/essays/definition_essay.php", "passage_text": "Remember: A definition essay is writing that explains what a term means. When writing a definition essay, remember to tell readers what term is being defined, to present a clear and basic definition, and to use facts, examples, or anecdotes that readers will understand."}, {"url": "http://www.custom-essays.org/samples/by_type/Examples_of_a_Definition_Essay.html?page=2", "passage_text": "A definition essay is an essay concentrated on the explanation of the meaning of a definite term. The term may be analyzed from the position of one and only meaning and also from the position of subjectivity of the person defining the term."}, {"url": "https://academichelp.net/academic-assignments/essay/write-definition-essay.html", "passage_text": "How to Write a Definition Essay. In a definition essay, you explain the meaning of a certain term by giving a detailed description of it, and support your definition with clear examples or facts. Such explanations are needed if a term is special, abstract, disputed or does not have a common meaning."}, {"url": "http://custom-essays.org/samples/by_type/Examples_of_a_Definition_Essay.html", "passage_text": "A definition essay is an essay concentrated on the explanation of the meaning of a definite term. The term may be analyzed from the position of one and only meaning and also from the position of subjectivity of the person defining the term. List of our examples of definition essays :"}, {"url": "https://academichelp.net/samples/academics/essays/definition/", "passage_text": "Definition Essay Samples. Using dictionary definitions to write your essay won’t cut it. Check out our examples of definition essays to grasp what it really means to write one."}, {"url": "http://essayinfo.com/essays/definition_essay.php", "passage_text": "A definition essay is writing that explains what a term means. Some terms have definite, concrete meanings, such as glass, book, or tree. Terms such as honesty, honor, or love are abstract and depend more on a person's point of view."}]