[{"url": "http://medical-dictionary.thefreedictionary.com/Muscle+Spasms+and+Cramps", "passage_text": "Most people are familiar with the sudden pain of a muscle cramp. The rapid, uncontrolled contraction, or spasm, happens unexpectedly, with either no stimulation or some trivially small one. The muscle contraction and pain last for several minutes, and then slowly ease."}, {"url": "http://www.merriam-webster.com/dictionary/spasm", "passage_text": "Medical Definition of SPASM. 1. : an involuntary and abnormal contraction of muscle or muscle fibers or of a hollow organ (as an artery, the colon, or the esophagus) that consists largely of involuntary muscle fibers. 2."}, {"url": "http://www.spine-health.com/glossary/muscle-spasm", "passage_text": "Causes of Back Muscle Spasms Video. Muscle spasm is an involuntary contraction of a muscle that can cause a great deal of pain. When the facet joints of the spine become injured or inflamed, the muscles supporting the spine can spasm causing low back pain and limitation in motion."}, {"url": "http://www.spine-health.com/glossary/muscle-spasm", "passage_text": "Muscle spasm is typically treated conservatively with muscle relaxants and exercise therapy. Muscle relaxants inhibit painful contractions by sedating the muscle, while exercise stretches the muscles so they are less likely to strain, tear or spasm."}, {"url": "http://www.merriam-webster.com/dictionary/spasm", "passage_text": "1. : an involuntary and abnormal contraction of muscle or muscle fibers or of a hollow organ (as an artery, the colon, or the esophagus) that consists largely of involuntary muscle fibers."}, {"url": "http://www.mayoclinic.org/diseases-conditions/angina/expert-answers/coronary-artery-spasm/faq-20058316", "passage_text": "Coronary artery spasm. A coronary artery spasm is a temporary tightening (constriction) of the muscles in the wall of one of the arteries that supplies blood flow to your heart muscle. This can narrow and decrease or even completely prevent blood flow to part of the"}, {"url": "http://www.medicinenet.com/script/main/art.asp?articlekey=11248", "passage_text": "A muscle spasm can be quite painful, with the muscle clenching tightly. A spasm of the coronary artery can cause the pain of angina. Spasms in various types of tissue may be caused by stress, medication, and overexercise."}, {"url": "http://www.thefreedictionary.com/spasm", "passage_text": "Noun. 1. spasm-a painful and involuntary muscular contraction. cramp, muscle spasm. symptom - (medicine) any sensation or change in bodily function that is experienced by a patient and is associated with a particular disease."}]