[{"url": "http://www.answers.com/Q/How_long_will_cooked_chicken_stay_fresh_in_the_refrigerator", "passage_text": "NEVER thaw chicken at room temperature. USDA recommends 1-2 days of refrigerated storage (40°F). Depending upon the packaging of the chicken, how it was handled in-transit, and the temperature in the refrigerator, the chicken could last longer. Cooked salmon will stay good longer than raw salmon. You can keep cooked salmon in the refrigerator for about 5 days. Any longer than that and it will start to spoil.  … . + 56 others found this useful. Kay Cook. The question and answer are locked and cannot be edited."}, {"url": "http://blog.foodnetwork.com/healthyeats/2013/06/25/how-long-will-the-food-in-your-refrigerator-last/", "passage_text": "1 Cooked ground chicken or turkey: 3 to 4 days (refrigerator) or 2 to 3 months (freezer). 2  Cooked chicken nuggets: 1 to 2 days (refrigerator) or 1 to 2 months (freezer). 3  Meats with gravy or sauces: 1 to 2 days refrigerator or 6 months (freezer). 1 Cooked chicken or turkey dishes: 3 to 4 days (refrigerator) or 4 to 6 months (freezer). 2  Fried chicken: 3 to 4 days (refrigerator) or 4 months (freezer). 3  Cooked ground chicken or turkey: 3 to 4 days (refrigerator) or 2 to 3 months (freezer)."}, {"url": "http://www.answers.com/Q/How_long_will_cooked_chicken_stay_fresh_in_the_refrigerator", "passage_text": "Meats are kept better in the freezer. Meats can be kept in the refrigerator for 3 to 4 days if raw and 1 to 2 days longer if cooked. Always place cooked meats in an airt … ight container.  . + 42 others found this useful. Cooked salmon will stay good longer than raw salmon. You can keep cooked salmon in the refrigerator for about 5 days. Any longer than that and it will start to spoil.  … . + 56 others found this useful. Kay Cook. The question and answer are locked and cannot be edited."}, {"url": "http://www.lifehacker.com.au/2012/11/ask-lh-how-long-can-i-keep-cooked-chicken-in-the-fridge/", "passage_text": "If refrigerated right after cooking, how long does cooked chicken last in the fridge? All the US government sites suggest 3 to 4 days, but I can’t find any reference points for Australia. "}, {"url": "http://stilltasty.com/fooditems/index/16787", "passage_text": "1 To further extend the shelf life of cooked chicken, freeze it; freeze in covered airtight containers or heavy-duty freezer bags, or wrap tightly with heavy-duty aluminum foil or freezer wrap. 1 The precise answer to the question “How long does cooked chicken last?” depends to a large extent on storage conditions — refrigerate chicken within two hours of cooking."}, {"url": "http://www.organicauthority.com/eco-chic-table/guide-to-leftovers.html", "passage_text": "GRAVY & BROTH: Cooked gravy and broth will stay fresh and safe to eat for 1-2 days in your refrigerator. Freeze it into ice cube trays and you’ll have a handy burst of flavor to add to your next meal. PASTA: Cooked pasta keeps for 3-5 days in the refrigerator, although pasta in soups will swell after the first day. RICE: Cooked rice may be stored safely in your refrigerator for up to one week. SALADS: Egg, tuna, ham, chicken and macaroni salads can be kept safely for 3-5 days."}, {"url": "http://www.rachaelray.com/2012/02/how-long-can-you-keep-chicken-in-the-fridge", "passage_text": "Dear SS: According to Foodsafety.gov, uncooked poultry is safe in the refrigerator for 1-2 days, and safe in the freezer for 9 months (for pieces) and up to 12 months for whole chickens or turkey. Cooked poultry is safe refrigerated for 3-4 days. You can also freeze your cooked breaded chicken cutlets (tightly wrapped in foil or saran wrap and place in freezer bags) for 1-3 months. Just pull it out the night before you want to have it and thaw in the fridge. "}, {"url": "http://blog.foodnetwork.com/healthyeats/2013/06/25/how-long-will-the-food-in-your-refrigerator-last/", "passage_text": "1 Fried chicken: 3 to 4 days (refrigerator) or 4 months (freezer). 2  Cooked ground chicken or turkey: 3 to 4 days (refrigerator) or 2 to 3 months (freezer). 3  Cooked chicken nuggets: 1 to 2 days (refrigerator) or 1 to 2 months (freezer). 4  Meats with gravy or sauces: 1 to 2 days refrigerator or 6 months (freezer). 1 Cooked chicken or turkey dishes: 3 to 4 days (refrigerator) or 4 to 6 months (freezer). 2  Fried chicken: 3 to 4 days (refrigerator) or 4 months (freezer). 3  Cooked ground chicken or turkey: 3 to 4 days (refrigerator) or 2 to 3 months (freezer)."}, {"url": "http://www.organicauthority.com/eco-chic-table/guide-to-leftovers.html", "passage_text": "LUNCH MEATS: Prepackaged lunch meats last for 3-5 days once their packages have been opened, while sliced meats from the deli will last for 5 days. MEAT: Cooked beef, pork or poultry can be kept safely in the refrigerator for 3-4 days, and can be frozen safely for up to 6 months. RICE: Cooked rice may be stored safely in your refrigerator for up to one week. SALADS: Egg, tuna, ham, chicken and macaroni salads can be kept safely for 3-5 days."}]