[{"url": "http://www.stmartinisland.org/destination-st-martin/saint-martin-island-life.html", "passage_text": "St. Martin / St. Maarten: an island with a unique status ... The island is divided into two geographical zones. At the signing of the Treaty of Concordia in 1648 the island was split into two parts: the southern part (Sint Maarten) was granted to the Netherlands and the northern part was given to France (Saint Martin)."}, {"url": "http://wikitravel.org/en/Saint_Martin", "passage_text": "Saint Martin is an island split between the French collectivity of Saint-Martin and the Dutch territory of Sint Maarten (formerly part of the Netherlands Antilles, but now a constituent state of the Kingdom of the Netherlands). It is one of the smallest land masses divided between two countries."}, {"url": "http://www.stmartinisland.org/destination-st-martin/saint-martin-island-life.html", "passage_text": "dutch sint-maarten. In 1954, the Netherlands granted the Netherlands Antilles (Curacao, Curaçao, Aruba, Bonaire, Saba statia and The dutch part Of. St) martin a status giving them internal autonomy within The Dutch kingdom on a large. scale"}, {"url": "http://traveltips.usatoday.com/st-maarten-immigration-requirements-64113.html", "passage_text": "St. Maarten is an interesting island in the northeastern Caribbean that is unlike any other island in the world. It is a multinational tourist destination and the easiest way to visit two countries at once. The island is divided between the Dutch and the French."}, {"url": "http://www.kabgsxm.com/consular-dutch-nationality.aspx", "passage_text": "If you do not have the Dutch nationality, in some cases, you can obtain the Dutch nationality by option or naturalization. For more information about option and naturalization visit the website of the Immigration and Naturalization Service (IND) of the Ministry of Security and Justice of the Netherlands: www.ind.nl."}, {"url": "http://www.stmartinisland.org/destination-st-martin/saint-martin-island-life.html", "passage_text": "dutch sint-maarten. In 1954, the Netherlands granted the Netherlands Antilles (Curacao, Curaçao, Aruba, Bonaire, Saba statia and The dutch part Of. St) martin a status giving them internal autonomy within The Dutch kingdom on a large. Scale Only defence And Foreign affairs remained Under dutch. control"}, {"url": "http://www.kabgsxm.com/consular-national-passport.aspx?language=EN", "passage_text": "Residents of St. Maarten with the Dutch nationality can apply for a national passport at the Civil Registry Department of Sint Maarten (Census Office), Soualiga Road 6, Pondfill Philipsburg."}, {"url": "http://www.stmartinisland.org/destination-st-martin/geography-st-martin.html", "passage_text": "Located in the southern section of the island, St. Maarten was part of the Netherlands Antilles, a group of five islands that included Bonaire, Curacao, Curaçao, Saba statia And. St. Maarten On october 10th 2010 Sint maarten became a country within The Dutch. kingdom"}, {"url": "http://www.stmartinisland.org/destination-st-martin/saint-martin-island-life.html", "passage_text": "On October 10th, 2010, Sint Maarten became a country within the Dutch Kingdom giving it an equal status to Aruba, Curacao and the Netherlands. The government of Country of St. Maarten is a parliamentary democracy, the new Prime Minister is Mrs. Sarah Wescott-Williams.."}]