[{"url": "http://www.payscale.com/research/US/Job=Certified_Occupational_Therapy_Assistant_(COTA)/Hourly_Rate/7fb068c4/Houston-TX", "passage_text": "A Certified Occupational Therapy Assistant (COTA) in Houston, Texas earns an average wage of $30.11 per hour. The skills that increase pay for this job the most are Acute Care, Long Term Care, Patient Education, Geriatrics, and Rehabilitation. Pay for this job rises steadily for more experienced workers, but goes down noticeably for the few employees with more than 20 years' experience. $30,968 - $65,000."}, {"url": "http://www.payscale.com/research/US/Job=Certified_Occupational_Therapy_Assistant_(COTA)/Hourly_Rate", "passage_text": "(United States). Certified Occupational Therapy Assistants in the United States pull down an average of $25.41 per hour. Lower pay rates hover around $18.94 per hour, and the higher rates verge on $34.14. This group's pay is mainly influenced by location, followed by the specific employer and tenure. Certified Occupational Therapy Assistants can also look forward to large paychecks in cities like Dallas (+22 percent), San Antonio (+16 percent), Houston (+14 percent), and Chicago (+10 percent)."}, {"url": "http://money.usnews.com/careers/best-jobs/occupational-therapy-assistant/salary", "passage_text": "Occupational therapy assistants earned a mean salary of $53,090 in 2012, which is about $23,000 less than occupational therapists. However, OT assistants earn more than other health care jobs on our list, including medical assistants ($30,550) and home health aides ($21,830). The average salary of an occupational therapy assistant working in Fort Worth, Texas is $76,710."}, {"url": "http://www.otcareerpath.com/assistant/salary", "passage_text": "The average annual salary for OTAs is $56,950, according to a BLS report from May 2014. The lowest 10 percent earned less than $36,420, and the top 10 percent earned more than $76,790. Occupational therapy assistants can earn more money if they are experienced in certain areas. For example, OTAs who are trained to work with children may have an easier time finding a job at a pre-school. According to the Bureau of Labor and Statistics (BLS), the best-paying jobs are in clients’ homes, nursing facilities, and hospitals. OTAs in Texas, Nevada, California, and New Jersey can make as much as $60,000+ per year."}, {"url": "http://www1.salary.com/TX/Houston/Certified-Occupational-Therapist-Assistant-salary.html", "passage_text": "The salary for someone with the job title Certified Occupational Therapist Assistant in Houston, TX varies depending on a number of factors. Requires an associate's degree and passing of a national examination to be a Certified Occupational Therapist Assistant (COTA). Familiar with standard concepts, practices, and procedures within a particular field. Relies on experience and judgment to plan and accomplish goals."}, {"url": "http://money.usnews.com/careers/best-jobs/occupational-therapy-assistant/salary", "passage_text": "The average salary of an occupational therapy assistant working in El Paso, Texas is $83,090. The average salary of an occupational therapy assistant working in Fort Worth, Texas is $76,710."}, {"url": "http://www.indeed.com/salary/q-Occupational-Therapy-Assistant-l-Dallas,-TX.html", "passage_text": "Average Occupational Therapy Assistant salaries for job postings in Dallas, TX are 2% higher than average Occupational Therapy Assistant salaries for job postings nationwide. "}, {"url": "http://money.usnews.com/careers/best-jobs/occupational-therapy-assistant/salary", "passage_text": "Occupational therapy assistants earned a median salary of $55,270 in 2013, according to the BLS. The lowest-paid in the field took home less than $34,870 in 2013, while the best-paid made upward of $74,000. The most lucrative sectors are in ambulatory health care and home health care. The average salary of an occupational therapy assistant working in Fort Worth, Texas is $76,710."}, {"url": "http://www.indeed.com/salary/q-Occupational-Therapy-Assistant-l-Texas.html", "passage_text": "Average Occupational Therapy Assistant salaries for job postings in Texas are 3% lower than average Occupational Therapy Assistant salaries for job postings nationwide. "}]