[{"url": "http://www.rsc.org/Education/Teachers/Resources/cfb/transport.htm", "passage_text": "Transport of oxygen in the blood Blood Blood is an 'aqueous body fluid'. In other words it is water containing a whole range of substances. It is contained in a complex network called the vascular system and is pumped around the body by the heart. "}, {"url": "http://www.factmonster.com/ipka/A0774536.html", "passage_text": "The circulatory system is the body's transport system. It is made up of a group of organs that transport blood throughout the body. The heart pumps the blood and the arteries and veins transport it. Oxygen-rich blood leaves the left side of the heart and enters the biggest artery, called the aorta. The aorta branches into smaller arteries, which then branch into even smaller vessels that travel all over the body."}, {"url": "http://www.innerbody.com/image/cardov.html", "passage_text": "The heart is a pumping system which takes in deoxygenated blood through the veins and delivers it to the lungs for oxygenation before pumping it into the various arteries (which provide oxygen and nutrients to body tissues by transporting the blood throughout the body). The cardiovascular system consists of the heart, blood vessels, and the approximately 5 liters of blood that the blood vessels transport."}, {"url": "http://anthro.palomar.edu/blood/blood_components.htm", "passage_text": "They transport oxygen from the lungs to all of the living tissues of the body and carry away carbon dioxide. The red cells are produced continuously in our bone marrow from stem cells at a rate of about 2-3 million cells per second. Hemoglobin is the gas transporting protein molecule that makes up 95% of a red cell. As a consequence, fetal hemoglobin molecules attract and transport relatively more oxygen to the cells of the body. White Cells. White cells, or leukocytes, exist in variable numbers and types but make up a very small part of blood's volume--normally only about 1% in healthy people."}, {"url": "https://en.wikipedia.org/wiki/Hemoglobin", "passage_text": "Hemoglobin in the blood carries oxygen from the respiratory organs (lungs or gills) to the rest of the body (i.e. the tissues). There it releases the oxygen to permit aerobic respiration to provide energy to power the functions of the organism in the process called metabolism. "}, {"url": "http://www.apa.org/helpcenter/stress-body.aspx", "passage_text": "The heart and blood vessels comprise the two elements of the cardiovascular system that work together in providing nourishment and oxygen to the organs of the body. The activity of these two elements is also coordinated in the body's response to stress. "}, {"url": "http://www.ptdirect.com/training-design/anatomy-and-physiology/major-functions-of-the-cardiovascular-system-2013-a-closer-look", "passage_text": "1. Red blood cells. 2. White blood cells. 3. Platelets. Red blood cells are responsible for transporting oxygen around the body to the tissues and organs that need it. As oxygen enters the blood stream through the alveoli of the lungs it binds to a special protein in the red blood cells called haemoglobin. This can be seen in the adjacent image. "}, {"url": "http://www.oxygen-review.com/human-body.html", "passage_text": "Oxygen's influence and its role in Human Body. In the human body, the oxygen is absorbed by the blood stream in the lungs, being then transported to the cells where an elaborated change process takes place. Oxygen plays a vital role in the breathing processes and in the metabolism of the living organisms. In the human body, oxygen uptake is carried out by the following processes: Oxygen diffuses through membranes and into red blood cells after inhalation into the lungs. The heme group (that consists of an iron) of hemoglobin binds oxygen when it is present, changing haemoglobin’s color from bluish red to bright red."}, {"url": "https://en.wikibooks.org/wiki/Human_Physiology/Blood_physiology", "passage_text": "Overview of Blood [edit]. The primary function of blood is to supply oxygen and nutrients as well as constitutional elements to tissues and to remove waste products. Blood also enables hormones and other substances to be transported between tissues and organs. "}, {"url": "http://anthro.palomar.edu/blood/blood_components.htm", "passage_text": "Normally, 7-8% of human body weight is from blood. In adults, this amounts to 4.5-6 quarts of blood. This essential fluid carries out the critical functions of transporting oxygen and nutrients to our cells and getting rid of carbon dioxide, ammonia, and other waste products. In addition, it plays a vital role in our immune system and in maintaining a relatively constant body temperature. As a consequence, fetal hemoglobin molecules attract and transport relatively more oxygen to the cells of the body. White Cells. White cells, or leukocytes, exist in variable numbers and types but make up a very small part of blood's volume--normally only about 1% in healthy people."}]