[{"url": "http://www.answers.com/Q/When_was_HPV_discovered", "passage_text": "Human papillomavirus-HPV, discovered in 1956, is a group of viruses that affect the skin and mucous membranes of humans. "}, {"url": "http://www.austincc.edu/microbio/2993r/hpv.htm", "passage_text": "There are over 100 types of HPV and over 60 cause warts on non-genital skin (common warts) and the other 40 are referred to as mucosal, genital type because they thrive only in squamous epithelial cells in the body. Furthermore, these 40 types are divided into two categories of high risk or low risk types. The HPV test on the other hand checks for the virus itself and is used with the pap in women 30 and older, especially if the pap has unclear results. [1, 3, 4, 5] The HPV test, like the pap, takes a sample of cervical cells, which is then hybridized with a specific HPV RNA probe cocktail."}, {"url": "http://www.austincc.edu/microbio/2993r/hpv.htm", "passage_text": "On the other hand, the high risk types, like HPV 16 and 18 have been linked to cancer of the vulva, vagina, cervix, anus and penis. [2] For the most part, most HPV infections do not pose any real harm, even if infected by multiple types. The HPV test on the other hand checks for the virus itself and is used with the pap in women 30 and older, especially if the pap has unclear results. [1, 3, 4, 5] The HPV test, like the pap, takes a sample of cervical cells, which is then hybridized with a specific HPV RNA probe cocktail."}, {"url": "https://en.wikipedia.org/wiki/HPV_vaccines", "passage_text": "Two vaccines have market approval in many countries as of 2014 (called Gardasil and Cervarix in the US). Both vaccines protect against the two HPV types (HPV-16 and HPV-18) that cause 70% of cervical cancers, 80% of anal cancers, 60% of vaginal cancers, and 40% of vulvar cancers. These HPV types also cause most HPV induced oral cancers, and some other rare genital cancers. Gardasil 9 protects against infection with the strains covered by the first generation of Gardasil (HPV-6, HPV-11, HPV-16, and HPV-18) and protects against five other HPV strains responsible for 20% of cervical cancers (HPV-31, HPV-33, HPV-45, HPV-52, and HPV-58)."}, {"url": "http://www.mademan.com/mm/history-hpv.html", "passage_text": "One of the first signs of HPV came in Italy in 1842 when a doctor noticed that married women and prostitutes developed cervical cancer, but nuns did not. While the doctor did not successfully determine the cause, this research was one of the first signs that cancers could be sexually transmitted. "}, {"url": "http://www.cancercouncil.com.au/1060/cancer-information/cancer-risk-and-prevention/screening-and-early-detection/cervical-cancer-vaccine-fact-sheet/", "passage_text": "The HPV vaccine currently available in Australia is called Gardasil. This vaccine prevents infection with HPV types 16, 18, 6 and 11. HPV 16 and 18 are responsible for the majority (70% internationally; 80% in Australia) of cervical cancers. HPV 6 and 11 are responsible for 90% of genital warts. Having the vaccine will protect those who have never been exposed to these types of HPV."}, {"url": "http://nucleionline.org/human-papillomaviruses-from-discovery-to-vaccine/", "passage_text": "It is estimated that 16% of cancer cases are related to infections. HPV are contributing for 30% of all infection-associated cancers [4] . HPV are present in almost all of cervical cancer cases, with HPV16 and 18 accounting for 70% of cases."}, {"url": "http://www.hpvvaccine.org.au/the-hpv-vaccine/vaccine-background.aspx", "passage_text": "The HPV vaccine. A vaccine called Gardasil has been developed that protects against the two high-risk HPV types (types 16 and 18), which cause 70% of cervical cancers in women and 90% of all HPV-related cancers in men. It also protects against two low-risk HPV types (types 6 and 11), which cause 90% of genital warts. Australia's Professor Ian Frazer and his team at the University of Queensland discovered how to make the vaccine particles, which form the basis of the HPV vaccine."}, {"url": "http://www.austincc.edu/microbio/2993r/hpv.htm", "passage_text": "The first time HPV was discovered was back in 1956 by a group of scientists. It was in 1984, when Harald zur Hausen discovered, cloned, and attributed cervical cancer to HPV 16 and 18.Throug his research, he has contributed to the production of the vaccines [6]. HPV gets its name because certain strain causes warts, also known as papillomas [4]. The HPV test on the other hand checks for the virus itself and is used with the pap in women 30 and older, especially if the pap has unclear results. [1, 3, 4, 5] The HPV test, like the pap, takes a sample of cervical cells, which is then hybridized with a specific HPV RNA probe cocktail."}, {"url": "http://nucleionline.org/human-papillomaviruses-from-discovery-to-vaccine/", "passage_text": "Zur Hausen postulated and analyzed a possible role of HPV in cervical cancer development. The first HPV types (HPV16 and 18) were isolated from cancer biopsies of the cervix and were cloned in 1983 and 1984, respectively [1] . Further epidemiological studies have confirmed that cervical infection by high-risk (HR) HPV types is the main risk factor for cervical cancer development. HPV are contributing for 30% of all infection-associated cancers [4] . HPV are present in almost all of cervical cancer cases, with HPV16 and 18 accounting for 70% of cases."}]