[{"url": "http://www.indiana.edu/~primate/brain.html", "passage_text": "Most humans (but not all) have left hemisphere specialization for language abilities. The only direct tests for speech lateralization are too invasive to use on healthy people, so most of what we know in this area comes from clinical reports of people with brain injuries or diseases."}, {"url": "http://www.allpsychologycareers.com/topics/lateralization-right-brain-left-brain.html", "passage_text": "And since the right side of the brain isn’t a “talker,” as Gazzaniga describes the right hemisphere, the scientists knew that in order for individuals to properly articulate what they saw in their left visual field, information must pass from the brain’s right hemisphere to the left hemisphere."}, {"url": "http://www.indiana.edu/~primate/brain.html", "passage_text": "The human brain is a paired organ; it is composed of two halves (called cerebral hemispheres) that look pretty much alike. The term brain lateralization refers to the fact that the two halves of the human brain are not exactly alike."}, {"url": "http://www.thefreedictionary.com/Lateralization+of+brain+function", "passage_text": "left′ brain′. the left cerebral hemisphere, controlling activity on the right side of the body: in humans, usu. showing some degree of specialization for language and calculation. Compare right brain."}, {"url": "http://www.wisegeekhealth.com/what-is-brain-lateralization.htm", "passage_text": "Each of the two hemispheres is responsible for a distinct set of duties in brain lateralization; the left side handles analytical, logical, and verbal thought processes while the right oversees more sensitive processes, like feelings, intuition, and sensory matters."}, {"url": "http://nspt4kids.com/healthtopics-and-conditions-database/brain-lateralization/", "passage_text": "Brain Lateralization is a complex and ongoing process by which differing regions of the brain “take over” the functioning of specific behaviors and cognitive skills. Lateralization literally means that certain functions are located (in part or total) on one side of the brain."}, {"url": "http://www.thefreedictionary.com/lateralization", "passage_text": "functional specialization of the brain, with some skills, as language, occurring primarily in the left hemisphere and others, as the perception of visual and spatial relationships, occurring primarily in the right hemisphere."}, {"url": "http://sharif.ir/~khosravizadeh/linkfile/handedness.pdf", "passage_text": "It is believed that most people enjoy a lateralized brain, with a bias toward using the right hand and in turn, the more dominant hemisphere is involved in language functions and speech, while the other hemisphere, the right one in case of most individuals, controls the emotional behavior [6]."}, {"url": "http://www.indiana.edu/~primate/brain.html", "passage_text": "In humans, the most obvious functional specialization is speech and language abilities. In the mid-1800s, Paul Broca (a French neurosurgeon) identified a particular area of the left hemisphere that plays a primary role in speech production."}, {"url": "http://nspt4kids.com/healthtopics-and-conditions-database/brain-lateralization/", "passage_text": "Functions related to the left side of the brain include understanding and use of language (listening, reading, speaking and writing), memory for spoken and written language, analysis of information in detail, and motor control of the right side of the body."}]