[{"url": "http://www.aconcordcarpenter.com/installing-deck-footings.html", "passage_text": "If your deck has two wood support posts and a ledger board that is bolted to the house, each of the two deck post holds up approximately 25 percent of the total weight. In this situation, the soil under each deck footing may be called upon to support 3,000 plus pounds. Trick for Lining Up the Footings. My way of installing deck footings starts by attaching the ledger joist to the house. Attach the two end joists of the deck to the ledger joist. Temporarily support the other end of the joists with a piece of lumber making sure the joists are level."}, {"url": "http://www.contractortalk.com/f7/deck-posts-bury-not-bury-5281/", "passage_text": "Some will put the post on the soil, hammer a few nails in the side of the post and pour cement around it. The requirement to bury 42 below grade is because of the frost that would heave the posts and deck if it were on top of grade. Your requirements I'm sure are different because you probably do not get frost. Our code is 32 to bottom of footing, and a minimum of 8 of concrete, I don't believe the post even has to be in sunk into the concrete. I saw one builder put a large cinder block at the bottom of the footing to keep the post up off the ground and then just poured a bag or two of cement around it to fill in the footer."}, {"url": "http://www.youtube.com/watch?v=aWan7JE6UZE", "passage_text": "Mix your concrete and scoop it into the hole. Use a small post to mix the concrete, eliminating air pockets to ensure it's level. When the concrete is set, place the post in the footing and make sure it is level and against the marked line. Fill the hole with gravel. Once all the posts are filled, spread the gravel out on the fabric. Let the concrete dry for several days to ensure that the footings are strong. "}, {"url": "http://www.decks.com/how-to/30/post-base-attachment", "passage_text": "Post Base Attachment. Use a drill with a hammer drill bit to install a concrete sleeve anchor into the center of the concrete footing. Enlarge. Install the Simpson Strong Tie ABE66Z Adjustable Post Base to the sleeve anchor and tighten the bolt to secure the attachment."}, {"url": "http://www.diychatroom.com/f19/deck-framing-beams-top-footing-not-enough-space-post-72393/", "passage_text": "I too prefer to put a wood post on top of the footing. My concern is two fold: (1) If I go with a post, it will only be around 2.5. My concern it is too thin that It crack and split once the load is on. Originally Posted by Maatoy. I too prefer to put a wood post on top of the footing. My concern is two fold: (1) If I go with a post, it will only be around 2.5. My concern it is too thin that It crack and split once the load is on. I was hoping that the risk may be a bit lower if I use a 6X6 post."}, {"url": "http://diy.stackexchange.com/questions/35920/how-do-i-place-a-terminal-fence-post-next-to-my-house", "passage_text": "One way to do it would be to cut terminal post off by the extra 10 inches, setting it in concrete on top of the footing concrete, and attaching the post to the house with 180 degree chain link brace bands. Or, you could nail a 2x6 to the house and attach the brace bands to it. "}, {"url": "http://www.diychatroom.com/f19/deck-framing-beams-top-footing-not-enough-space-post-72393/", "passage_text": "Deck Framing-Beams on top of footing (not enough space for post). Hi All, I am a newbie trying to build a deck (no experience). The deck that I am planning to build is only 23 above ground. It will be a floating/free standing deck. I am using Azek deck boards (1 thick), 2X10 PT joist on top of two 2X10 PT beam. The footing will be concrete 11 diameter, 48 below grade to protect from the Canadian weather. The deck board and joist and beams will add to 19.5 inches. Factoring in 1 for post stand off, the overall height is 20.5 leaving only 2.5'(23 less 20.5=2.5), which I believe is not enough for a post. Originally Posted by Maatoy. I too prefer to put a wood post on top of the footing. My concern is two fold: (1) If I go with a post, it will only be around 2.5. My concern it is too thin that It crack and split once the load is on. I was hoping that the risk may be a bit lower if I use a 6X6 post."}, {"url": "http://countryplans.com/foundation/", "passage_text": "A pier and beam (sometimes called post and beam) foundation involves wood posts or concrete piers set into the ground and bearing the weight of the building on foundation beams. "}, {"url": "http://diy.stackexchange.com/questions/27653/how-should-i-build-the-concrete-footings-for-my-deck", "passage_text": "I plan on making a small deck and I live in Howard County Maryland. The deck code here says that the concrete footing must be 30 in below ground level and have a thickness of at least 8 inches (i.e. to 22 inches below ground level). This which means the wood post is in the ground. This is also how all the contractors I have talked to would do it. (Deck guide for my county (PDF)). The books on deck building I have only suggest having the concrete footing extend above ground level by a little bit (I think this is called a tube footing). This method has the post not touching the dirt."}]