[{"url": "https://en.wikipedia.org/wiki/List_of_Attack_on_Titan_characters", "passage_text": "Deputy leader of the Survey Corps Special Ops, he has 14 Titan kills and 32 assists. He has a calm demeanor. After the Female Titan is initially devoured, he leads the Squad to protect Eren in their retreat but when the Female Titan reappears, he has the Squad attack her, but she bites his head off and spits it out. The main protagonist of the series who after witnessing his mother being devoured by a Titan, dedicates his life to their eradication. After graduating fifth in his cadet class, he is swallowed by a bearded Titan during his first mission in Trost."}, {"url": "https://en.wikipedia.org/wiki/Attack_on_titan_episodes", "passage_text": "Attack on Titan is a 2013 anime series based on the manga by Hajime Isayama serialized in Bessatsu Shōnen Magazine. It is set in a world where humanity lives inside cities surrounded by enormous walls due to the Titans, gigantic humanoid beings who devour humans seemingly without reason. When the three of them give conflicting sources on where Eren is in the formation, they realize the Female Titan's target is Eren and they must stop her. Despite their failed attempts to attack, she leaves them and heads to the center of the group where Eren is at."}, {"url": "http://www.youtube.com/watch?v=mA6YQIAG_v8", "passage_text": "However, Commander Kitz Weilman and his men did see it and have Eren cornered with Armin and Mikasa defending him. Kitz accuses Eren of being a Titan spy and demands to know what he is, but Eren has no idea since he has no memories of becoming a Titan or how his limbs grew back. His anger over the Titans caused Eren to burst out of the Titan's stomach by transforming into a Titan himself and going on a rampage against them. When Eren regains his consciousness, to his confusion, he, Armin, and Mikasa are surrounded by the Army who are aiming their weapons at him."}, {"url": "http://www.imdb.com/name/nm0924038/", "passage_text": "Official Photos ». Jill Whelan was born on September 29, 1966 in Oakland, California, USA as Jill E. Whelan. She is an actress, known for The Love Boat (1977), Airplane! (1980) and The Love Boat: A Valentine Voyage (1990). She has been married to Michael Chaykowsky since April 2, 2004. They have one child."}, {"url": "http://www.threeifbyspace.net/2012/07/perception-pilot-recap/", "passage_text": "Let me just begin by saying that if you haven’t watched this episode this recap contains spoilers. If you don’t like spoilers, don’t read this article. If you read this article and get upset that it has spoilers you probably should avoid the internet. Thank you. "}, {"url": "http://attackontitans.wikia.com/wiki/Rico", "passage_text": "85 pages on this wiki. Rico Brzenska (リコ・プレツェンスカ, Riko Brezensuka) is the Squad Leader of the 1st Division Elite Force of the Stationary Guard. She is the sole survivor of the elite squads assigned to protect Eren during the liberation of Trost District. She does not trust Eren and still views him as an unstable threat"}, {"url": "https://en.wikipedia.org/wiki/List_of_Attack_on_Titan_characters", "passage_text": "This is a list of characters of the Attack on Titan manga series written and illustrated by Hajime Isayama, and the television series based on it. The main protagonist of the series who after witnessing his mother being devoured by a Titan, dedicates his life to their eradication. After graduating fifth in his cadet class, he is swallowed by a bearded Titan during his first mission in Trost."}, {"url": "https://en.wikipedia.org/wiki/Attack_on_titan_episodes", "passage_text": "Both Funimation and Crunchyroll have streamed the series with subtitles on their respective websites. Funimation has also licensed the anime for home video release in 2014. Episode 1 of the English version premiered at Anime Boston, with other episodes put on Funimation's subscription services. When the three of them give conflicting sources on where Eren is in the formation, they realize the Female Titan's target is Eren and they must stop her. Despite their failed attempts to attack, she leaves them and heads to the center of the group where Eren is at."}, {"url": "http://www.thetoptens.com/attack-titan-episodes/", "passage_text": "The 9th episode of Attack on Titan revealed what'd happened to Eren after he'd gotten eaten up, and even has a short part of Levi's squad retaking a town from the Titans. It's quite intense, with Eren and Kitz Weilman arguing, and finally firing at him, Mikasa, and Armin. - TheFlyingOtter. 5 Episode 25 (Wall: Assault on Stohess, Part 3). The very last episode of Attack on Titan: Season 1. It's epically suspenseful, and a great final episode to a season. Annie's memories of her father, and just the fight and struggle are what make this episode great."}]