[{"url": "http://www.mananatomy.com/digestive-system/peritoneum", "passage_text": "Peritoneum is the thin serous membrane that lines the walls of the abdominal and pelvic cavities and clothes the abdominal and pelvic viscera. It is the largest serous membrane of human body and has a rather complex arrangement. "}, {"url": "https://en.wikipedia.org/wiki/Peritoneum", "passage_text": "The peritoneum /ˌpɛrɨtəˈniːəm/ is the serous membrane that forms the lining of the abdominal cavity or coelom in amniotes and some invertebrates, such as annelids. It covers most of the intra-abdominal (or coelomic) organs, and is composed of a layer of mesothelium supported by a thin layer of connective tissue. "}, {"url": "http://www.auuuu.org/digestive/serous-membranes/", "passage_text": "The abdominopelvic cavity houses the majority of the digestive organs. Serous membranes, the same ones which line the abdominal cavity, cover the digestive organs and provide basic structural support. Simple squamous epithelium intermittently straddled with connective tissue creates the serous membranes."}, {"url": "http://anatomyandphysiologyi.com/body-cavities-and-membranes/", "passage_text": "The walls of the ventral body cavity and outer covering of its organs contain a thin covering called the serosa (also called serous membrane). It is a double-layered membrane made up of two parts called the “ parietal serosa ” (lines the cavity walls) and “ visceral serosa ” (covers organs in the cavity). The serous membranes are separated by a thin layer of fluid called “ serous fluid “."}, {"url": "https://en.wikipedia.org/wiki/Serous_membrane", "passage_text": "A serous membrane (also referred to as a serosa) is one of the thin membranes that cover the walls and organs in the thoracic and abdominopelvic cavities. The parietal layers of the membranes line the walls of the body cavity (pariet-refers to a cavity wall). The visceral layer of the membrane covers the organs (the viscera). Between the parietal and visceral layers is a very thin, fluid-filled serous space, or cavity. The serous membrane covering the heart and lining the mediastinum is referred to as the pericardium, the serous membrane lining the thoracic cavity and surrounding the lungs is referred to as the pleura, and that lining the abdominopelvic cavity and the viscera is referred to as the peritoneum."}, {"url": "http://www.answers.com/Q/What_is_the_medical_term_meaning_membrane_lining_the_abdominal_cavity", "passage_text": "Answer by 1Jazz. Confidence votes 9.4K. The Peritoneum is the serous membrane that lines the abdominal cavity. The parietal peritoneum lines the abdominal wall, and the visceral peritoneum lines the outside of the organs within the cavity. The viseral and parietal peritoneum line the abdominal cavity. Peritoneum. parietal peritoneum. peritoneum. peritoneum. "}, {"url": "http://www.answers.com/Q/What_is_the_serous_membrane_in_the_abdominopelvic_cavity", "passage_text": "Split and merge into it. Answered by The Community. Making the world better, one answer at a time. The peritoneum is the serous membrane of the abdominopelvic or peritoneal cavity. The parietal peritoneum lines the cavity, and the visceral peritoneum lines the organs. peritoneum. "}, {"url": "https://en.wikipedia.org/wiki/Serous_membrane", "passage_text": "The inner layer covers organs in bodily cavities and is called the visceral membrane; this inner layer of epithelial cells is followed by a connective tissue; after the connective tissue is the second layer of epithelial cells of the serous membrane called the parietal layer. The Latin anatomical name is tunica serosa. The serous membrane covering the heart and lining the mediastinum is referred to as the pericardium, the serous membrane lining the thoracic cavity and surrounding the lungs is referred to as the pleura, and that lining the abdominopelvic cavity and the viscera is referred to as the peritoneum."}, {"url": "http://vanat.cvm.umn.edu/TFFlectPDFs/LectSerousCavities.pdf", "passage_text": "15 Serous Membranes & Cavities Body Cavities The major cavities of the body are withinthe trunk. They contain visceral organs andserous membrane cavities:Thoracic cavity — is lined byendothoracic fascia.Abdominal & pelvic cavities — arelined by transversalis fascia. "}]