[{"url": "http://longtermcare.gov/the-basics/how-much-care-will-you-need/", "passage_text": "The duration and level of long-term care will vary from person to person and often change over time. Here are some statistics (all are “on average”) you should consider: 1  Someone turning age 65 today has almost a 70% chance of needing some type of long-term care services and supports in their remaining years."}, {"url": "http://www.ahcancal.org/ncal/resources/Pages/ResidentProfile.aspx", "passage_text": "Percentage Of All Residents By Age Groups: In 2010, 54 percent of assisted living residents are 85 years or older; 27 percent are 75-84 years old; 9 percent of residents are between 65 and 74 years; and 11 percent are younger than 65 years old."}, {"url": "http://www.kiplinger.com/article/insurance/T036-C001-S001-how-to-minimize-long-term-care-premiums.html", "passage_text": "The answer can help you decide if you need long-term-care insurance and, if so, how much coverage to get. It can also help you figure out good strategies for minimizing your premiums. The average stay for nursing-home residents is 28 months, and the average stay for assisted-living residents is 27 months. But many of those people receive some other kind of long-term care before or after their stay."}, {"url": "http://www.alfa.org/alfa/Assessing_Cost.asp", "passage_text": "The average cost for a private one-bedroom apartment in an assisted living residence is over $3,000 per month, according to research compiled by several nonprofit senior living organizations, including the Assisted Living Federation of America."}, {"url": "http://www.seniorhomes.com/p/assisted-living-cost/", "passage_text": "Just as the cost of real estate varies by geographic area, assisted living costs also vary nationwide. In the 2015 Cost of Care Survey conducted by Genworth Financial, assisted living showed an increase of 2.86% compared to the 2014 costs and the national median monthly rate is $3,600."}, {"url": "http://www.assistedlivingfacilities.org/resources/who-lives-in-assisted-living-/", "passage_text": "CDC found the average length of stay for residents assisted living stays are as follows: 35% of residents stay one year or more, 16% stay 3 years or more, 15% stay over 5 years, 14% stay 6 months or less, 9% stay more than 3 months, and 9% less than 3 months. Length of Stay. Responses of don't know (."}, {"url": "http://www.longtermcarelink.net/eldercare/assisted_living.htm", "passage_text": "Medicare does not pay for assisted living. About 75% of all costs are paid by residents out of personal funds or family assistance. SSI (supplemental security income) pays for 14% and 2% is covered by long-term care insurance."}]