[{"url": "https://en.wikipedia.org/wiki/Meningitis", "passage_text": "The inflammation may be caused by infection with viruses, bacteria, or other microorganisms, and less commonly by certain drugs. Meningitis can be life-threatening because of the inflammation's proximity to the brain and spinal cord; therefore, the condition is classified as a medical emergency. Some forms of meningitis (such as those associated with meningococci, Haemophilus influenzae type B, pneumococci or mumps virus infections) may be prevented by immunization. In 2013 meningitis resulted in 303,000 deaths – down from 464,000 deaths in 1990."}, {"url": "http://www.ninds.nih.gov/disorders/encephalitis_meningitis/detail_encephalitis_meningitis.htm", "passage_text": "Meningitis is most often caused by a bacterial or viral infection. It also may be caused by a fungal infection, parasite, a reaction to certain medications or medical treatments, a rheumatologic disease such as lupus, some types of cancer, or a traumatic injury to the head or spine. Bacterial meningitis is a rare but potentially fatal disease. It can be caused by several types of bacteria that first cause an upper respiratory tract infection and then travel through the blood stream to the brain."}, {"url": "http://www.healthcommunities.com/meningitis/types.shtml", "passage_text": "Types of Meningitis. Meningitis is either infectious (contagious) or noninfectious. Infectious meningitis is classified as viral, bacterial, fungal, or parasitic, depending on the type of organism causing the infection. Viral meningitis, also called aseptic meningitis, is the most common type. It is rarely fatal and usually resolves with treatment"}, {"url": "http://www.ncbi.nlm.nih.gov/pubmedhealth/PMH0001700/", "passage_text": "Infection of the membranes and the fluid surrounding the brain (meningitis) and of the fluid‐filled spaces in the brain (ventriculitis) may be caused by bacteria, especially gram‐negative bacteria. This type of infection is difficult to eradicate using safe doses of antibiotics given into the blood stream. Inflammation of the meninges (three thin layers of tissue that cover and protect the brain and spinal cord). Meningitis is usually caused by a bacterial or viral infection, but sometimes is caused by cancer, drug allergies, or inflammatory diseases."}, {"url": "http://www.ncbi.nlm.nih.gov/pubmedhealth/PMH0001700/", "passage_text": "Bacterial meningitis is a rare but potentially fatal disease. It can be caused by several types of bacteria that first cause an upper respiratory tract infection and then travel through the blood stream to the brain. Inflammation of the meninges (three thin layers of tissue that cover and protect the brain and spinal cord). Meningitis is usually caused by a bacterial or viral infection, but sometimes is caused by cancer, drug allergies, or inflammatory diseases."}, {"url": "http://www.cdc.gov/pneumococcal/about/infection-types.html", "passage_text": "Streptococcus pneumoniae bacteria, or pneumococcus, can cause many types of illnesses. Some of these illnesses can be life-threatening. Pneumococcus is the most common cause of bloodstream infections, pneumonia, meningitis, and middle ear infections in young children. You have probably heard of pneumonia, which is an infection of the lungs. Pneumonia can be caused by many different bacteria, viruses, and even fungi"}, {"url": "http://www.cdc.gov/meningitis/bacterial.html", "passage_text": "Bacterial meningitis is usually severe. While most people with meningitis recover, it can cause serious complications, such as brain damage, hearing loss, or learning disabilities. There are several pathogens (types of germs) that can cause bacterial meningitis."}, {"url": "http://www.webmd.com/children/understanding-meningitis-basics", "passage_text": "Meningitis is almost always caused by a bacterial or viral infection that began elsewhere in the body, such as in the ears, sinuses, or upper respiratory tract. Less common causes of meningitis include fungal infection, autoimmune disorders, and medications. Viral meningitis is more common than the bacterial form and generally -- but not always -- less serious. It can be triggered by a number of viruses, including several that can cause diarrhea. People with viral meningitis are much less likely to have permanent brain damage after the infection resolves."}, {"url": "http://www.ncbi.nlm.nih.gov/pubmedhealth/PMH0001700/", "passage_text": "About Meningitis. Meningitis is most often caused by a bacterial infection. It also may be caused by a virus, fungal infection, parasite, a reaction to certain medications or medical treatments, a rheumatologic disease such as lupus, some types of cancer, or a traumatic injury to the head or spine. Inflammation of the meninges (three thin layers of tissue that cover and protect the brain and spinal cord). Meningitis is usually caused by a bacterial or viral infection, but sometimes is caused by cancer, drug allergies, or inflammatory diseases."}]