[{"url": "http://www.everythingaboutgermany.com/germany-attractions/mountains-in-germany/", "passage_text": "The Ore Mountains (German Erzgebirge, Czech Krušne krušné) hory are a mountain range In germany and The Czech. Republic they form the border between both countries for 150, km extending from the western border Of saxony to The elbe. River the western portions of The Ore mountains have the highest. peaks"}, {"url": "http://www.everythingaboutgermany.com/germany-attractions/mountains-in-germany/", "passage_text": "The Ore Mountains (German Erzgebirge, Czech Krušne krušné) hory are a mountain range In germany and The Czech. Republic they form the border between both countries for 150, km extending from the western border Of saxony to The elbe. river"}, {"url": "http://www.worldatlas.com/webimage/countrys/europe/lgcolor/decolorlf.htm", "passage_text": "The Bavarian Alps, the highest mountains in Germany stretch across its southern border with Austria. Snow covered Zugspitze, Germany's highest point is found here. Stretched along the northern coastline, the Frisian Islands, East and North are separated from the mainland by the Waddenmeer."}, {"url": "http://www.everythingaboutgermany.com/germany-attractions/mountains-in-germany/", "passage_text": "The Bavarian Forest (German: Bayerischer Wald) is a low mountain range in Bavaria, Germany. It extends along the Czech border and is continued on the Czech side by the Sumava (Bohemian Forest). Geographically the Bavarian Forest and Bohemian Forest are the same mountain range."}, {"url": "http://peakery.com/region/germany-mountains/", "passage_text": "Zugspitze is a 9,718 ft / 2,962 m mountain peak in the Wetterstein Range in Bavaria, Germany. Based on peakery data, it ranks as the 1st highest mountain in Bavaria and the 1st highest mountain in... 9,429 ft / 2,874 m • 0 summits •"}, {"url": "http://www.touristlink.com/germany/cat/mountain-ranges/map.html", "passage_text": "Check out our photos of Mountain Ranges in Germany.. Click a photo of a mountain range to see its location on the map and find out more information. We have photos of all 1,381 tourist attractions around Germany or add your own (Click here to browse them)."}, {"url": "http://www.everythingaboutgermany.com/germany-attractions/mountains-in-germany/", "passage_text": "The Harz is a mountain range in northern Germany. The northernmost mountain chain of Germany, it straddles the border between the states of Lower Saxony, Saxony-Anhalt and Thuringia. The name Harz derives from a Middle High German word meaning “forest”."}, {"url": "http://www.ducksters.com/geography/mountain_ranges.php", "passage_text": "Alps. The Alps are a major mountain range in central Europe. They pass through many European countries including France, Germany, Switzerland, Italy, Austria, and Slovenia. The tallest peak in the Alps is Mont Blanc at 15,782 feet located on the French-Italian border."}, {"url": "http://www.mountainprofessor.com/the-alps.html", "passage_text": "The Alps are the largest mountain system in Europe. They cover parts of southeastern France and northern Italy, most of Switzerland, part of southern Germany, and some of Austria and Yugoslavia."}]