[{"url": "https://www.sharecare.com/health/kidney-disease/kidney-disease-affect-the-body", "passage_text": "Kidney disease damages your kidneys, preventing them from cleaning your blood as well as they should. This damage can cause wastes to build up in your body and lead to other health problems, including heart disease, anemia and bone disease. Chronic kidney disease eventually can cause kidney failure if it is not treated. Renal function, or kidney function, is a measure of how well the kidneys are filtering blood. If you have two fully-functioning kidneys, you have all of your renal function (100 percent). A majority of kidney diseases damage renal function by attacking little filtration units in the kidneys, called nephrons."}, {"url": "http://www.answers.com/Q/What_body_systems_are_affected_by_kidney_failure", "passage_text": "1 About Kidney Disease Diet Restrictions The job of the body's kidneys is to filter fluids and remove extra waste from the body. 2  When kidneys fail, fluid and wastes can accumulate in the body and be hazardous to you…. "}, {"url": "http://www.kidney-cares.org/ckd-prognosis/4205.html", "passage_text": "Besides, renal high blood pressure can make cerebral angiospasm. When neuromusclular system is affected, you have insomnia, muscle cramp, restless leg syndrome, illusion, etc. From the above, we can see that when your kidneys shut down, almost your body system will be affected. Therefore, early treatment is needed to repair the damaged kidneys and improve kidney function. Only in this way can you reduce the damaged to your body. Besides blood pollution, the damaged kidneys can not regulate the blood pressure and pH. High blood pressure, acidosis, hyperkalemia, water and sodium retention, anemia and other toxins may be the contributor to heart failure. Respiratory system. Some kidney patients complaint about metal taste in mouth."}, {"url": "http://www.mayoclinic.org/diseases-conditions/high-blood-pressure/in-depth/high-blood-pressure/art-20045868", "passage_text": "Damage to your kidneys. Your kidneys filter excess fluid and waste from your blood — a process that depends on healthy blood vessels. High blood pressure can injure both the blood vessels in and leading to your kidneys, causing several types of kidney disease (nephropathy). Having diabetes in addition to high blood pressure can worsen the damage. 1  Kidney failure. 2  High blood pressure is one of the most common causes of kidney failure"}, {"url": "http://www.kidneyfailureweb.com/urine-changes/399.html", "passage_text": "Also, they can realize the strong smell of urine. Kidney failure is a life-threatening medical condition. Aside from affecting patient’s urinary system, it also can affect patient’s digestive system, nerve system, respiratory system and cardiovascular system and so on. Therefore, having an effective prevention for kidney failure means a lot for kidney disease patients. Kidney Failure patients always experience a series of urine changes like frequent urination at night, decreased urine output, bubbly urine, blood urine and urgent urine and so on. All these symptoms are related with urinary system."}, {"url": "http://www.davita.com/kidney-disease/overview/symptoms-and-diagnosis", "passage_text": "Renal means related to the kidneys. Acute means sudden. So acute renal failure means the kidneys have failed suddenly, often due to a toxin (a drug allergy or poison) or severe blood loss or trauma. Dialysis is used to clean the blood and give the kidneys a rest. If the cause is treated, the kidneys may be able to recover some or all of their function."}, {"url": "http://www.kidneyfailureweb.com/urine-changes/399.html", "passage_text": "Aside from affecting urinary system directly, kidney failure also may affect urinary system by causing urinary tract infection. Compared with healthy people, kidney failure patients suffer from urinary tract infection easily. Kidney Failure patients always experience a series of urine changes like frequent urination at night, decreased urine output, bubbly urine, blood urine and urgent urine and so on. All these symptoms are related with urinary system."}, {"url": "http://www.livestrong.com/article/177937-what-body-systems-do-the-kidneys-work-with/", "passage_text": "When patients are first diagnosed with kidney disease, they are often overwhelmed by the sheer amount of information they have to learn. Renal disease is complicated because impairment of the kidneys affects many different systems of the body and can result in hypertension, anemia and bone problems. These issues go far beyond filtration of blood, which is one of the kidneys&#039; main functions. The kidneys are also part of the endocrine system because they release a hormone called erythropoitin--abbreviated EPO-- which is responsible for transforming reticulocytes into mature iron-bearing red blood cells."}, {"url": "http://www.kidneyfailureweb.com/urine-changes/399.html", "passage_text": "Kidney is one of the parts of urinary system, so when kidney failure is formed, urinary system is affected at the same time. Kidney failure occurs as the final consequence of acute kidney problem and chronic kidney problem. Glomerulus and renal tubule are important kidney tissues. Kidney Failure patients always experience a series of urine changes like frequent urination at night, decreased urine output, bubbly urine, blood urine and urgent urine and so on. All these symptoms are related with urinary system."}]