[{"url": "http://www.healthcare-salaries.com/technicians/radiology-technician-salary", "passage_text": "According to the bureau of labor statistics, a radiology technician in US receives an average hourly wage of about $26.13 per hour. The highest salary for the 10 percent of the radiology technicians is around more than $76,850 whereas the lowest 10 percent of them received less than $36,510 per year. radiology technician salary. Radiology technician’s salary (shortly known as radiology tech salary) in the United States ranges from $24,000 – $36,000 per annum."}, {"url": "http://work.chron.com/much-xray-technicians-make-per-year-6870.html", "passage_text": "Salaries. The American Society of Radiologic Technologists reported in 2010 that the average salary of X-ray technicians was $53,953 a year, and the median salary reported was $50,149. California reported the highest pay for X-ray techs of any state in 2010, an average of $75,363 a year. Massachusetts reported the second-highest average salary, $71,501 a year."}, {"url": "http://work.chron.com/much-money-radiologic-technician-make-4036.html", "passage_text": "A 2010 salary survey conducted by the American Society of Radiologic Technologists found that starting salaries for this occupation averaged about $46,500 per year. Between six and 10 years, the average salary rose to about $57,000 per year. Those employed by medical and diagnostic laboratories reported a mean salary of about $59,000 per year, while those in general hospitals and in outpatient centers averaged between $56,000 and $57,000 per year. Radiologic technicians employed in physician's offices averaged about $55,000 in annual pay."}, {"url": "http://work.chron.com/much-money-radiologic-technician-make-4036.html", "passage_text": "The 2010 ASRT salary survey also revealed that radiologic technicians who concentrate in different specialty areas earn significantly different levels of income. Radiographers earned the lowest average salary, about $54,000 per year, followed by bone densitometrists at about $56,500. Those employed by medical and diagnostic laboratories reported a mean salary of about $59,000 per year, while those in general hospitals and in outpatient centers averaged between $56,000 and $57,000 per year. Radiologic technicians employed in physician's offices averaged about $55,000 in annual pay."}, {"url": "http://www.bls.gov/ooh/Healthcare/Radiologic-technologists.htm", "passage_text": "$34,750. The median annual wage for radiologic technologists was $54,620 in May 2012. The median wage is the wage at which half the workers in an occupation earned more than that amount and half earned less. The lowest 10 percent earned less than $37,060, and the highest 10 percent earned more than $77,160. The median annual wage for MRI technologists was $65,360 in May 2012. The lowest 10 percent earned less than $46,400, and the highest 10 percent earned more than $89,130. Most radiologic and MRI technologists work full time."}, {"url": "http://www.answers.com/Q/How_much_money_does_a_radiology_technician_earn", "passage_text": "The median expected salary for a typical Radiologic Technologist in the United States is $45,616. As of 2005, The American Society of Radiologic Technologists survey showed an average annual income of approx. * According to the American Medical Association, the average starting salary for pharmacy technicians is $19,000. The wages vary by industry and level of experienceThe salary per year for a pharmacy technician is about $10.00 to $17.00 per hour."}, {"url": "http://work.chron.com/much-money-radiologic-technician-make-4036.html", "passage_text": "As of 2011, radiologic technicians working in the United States reported an average hourly wage of $27.29 and a mean annual salary of $56,760 to the Bureau of Labor Statistics. Those employed by medical and diagnostic laboratories reported a mean salary of about $59,000 per year, while those in general hospitals and in outpatient centers averaged between $56,000 and $57,000 per year. Radiologic technicians employed in physician's offices averaged about $55,000 in annual pay."}, {"url": "http://www.healthcare-salaries.com/technicians/radiology-technician-salary", "passage_text": "Based on percentiles, the median yearly salary for 90th percentile of radiology technicians has been around $57,482. Similarly, about 75th percentile of radiology technicians received $53,259, 25th percentile of them received $44,565 while 10th percentile received $40,873 per year. Radiology technician’s salary (shortly known as radiology tech salary) in the United States ranges from $24,000 – $36,000 per annum."}, {"url": "http://www.healthcare-salaries.com/technicians/radiology-technician-salary", "passage_text": "An average annual salary for a radiology technician in Australia is about AU$40,000. According to payscale Australia, a radiology technician receives an average yearly salary ranging from between AU$35,317 – AU$90,042 per hour. Radiology technician’s salary (shortly known as radiology tech salary) in the United States ranges from $24,000 – $36,000 per annum."}]