[{"url": "http://www.city-data.com/county/Jefferson_County-MO.html", "passage_text": "0.03% of residents moved to foreign countries ($232 average AGI)Jefferson County:0.03%Missouri average:0.05% 4.13% relocated to other counties in Missouri ($25,477 average AGI) 1.34% relocated to other states ($10,254 average AGI)Jefferson County:1.34%Missouri average:2.76%..02% of residents moved from foreign countries ($73 average AGI)Jefferson County:0.02%Missouri average:0.04% 4.06% relocated from other counties in Missouri ($27,586 average AGI) 1.17% relocated from other states ($8,930 average AGI)Jefferson County:1.17%Missouri average:2.54%."}, {"url": "https://en.wikipedia.org/wiki/Jefferson_City,_Missouri", "passage_text": "When the Missouri Territory was organized in 1812, St. Louis was Missouri's seat of government. St. Charles would serve as the next capital. In the middle of the state, Jefferson City was chosen as the new capital in 1821 when Thomas Jefferson was still living.efferson City is home to Lincoln University, a historically black college founded in 1866 and later designated as a land-grant university. In 2013, Jefferson City was named America's Most Beautiful Small Town by Rand McNally."}, {"url": "http://www.colecounty.org/", "passage_text": "Welcome to Cole County 301 E High Street Jefferson City, MO Phone:573-634-9100 Fax: 573 634-8031."}, {"url": "https://en.wikipedia.org/wiki/Jefferson_County,_Missouri", "passage_text": "Jefferson County is a county located in the eastern portion of the state of Missouri. As of the 2010 census, the population was 218,733, making it the sixth-most populous county in Missouri. Its county seat is Hillsboro. The county was organized in 1818 and named in honor of former President Thomas Jefferson. In 1980 the county contained the mean center of U.S. population. Jefferson County is part of the St. Louis, MO-IL Metropolitan Statistical Area and encompasses many of the city's southern suburbs. Governor Mel Carnahan was killed near Goldman, Missouri in a plane crash on October 16, 2000"}, {"url": "https://en.wikipedia.org/wiki/Jefferson_City,_Missouri", "passage_text": "In addition, state agencies are headquartered in Jefferson City. The Missouri State Archives is located in Jefferson City. The Missouri Department of Corrections (MDOC) operates the Jefferson City Correctional Center and the Algoa Correctional Center in Jefferson City.efferson City is home to Lincoln University, a historically black college founded in 1866 and later designated as a land-grant university. In 2013, Jefferson City was named America's Most Beautiful Small Town by Rand McNally."}, {"url": "https://en.wikipedia.org/wiki/Jefferson_City,_Missouri", "passage_text": "Jefferson City is the capital of the U.S. state of Missouri. As of the 2010 census, its population was 43,079, making it the 15th largest city in the state. It is also the county seat of Cole County, although a small portion of the city extends into Callaway County. Jefferson City is home to Lincoln University, a historically black college founded in 1866 and later designated as a land-grant university. In 2013, Jefferson City was named America's Most Beautiful Small Town by Rand McNally."}, {"url": "http://www.jeffersoncitymo.gov/", "passage_text": "Upon arriving in Jefferson City, visitors are captivated by the majestic Missouri River and tree lined bluffs."}, {"url": "http://www.city-data.com/city/Jefferson-City-Missouri.html", "passage_text": "3.9%. According to our research of Missouri and other state lists there were 130 registered sex offenders living in Jefferson City, Missouri as of October 08, 2015. The ratio of number of residents in Jefferson City to the number of sex offenders is 332 to 1.anks with most branches in Jefferson City (2011 data): 1  The Central Trust Bank: Central Bank West Branch, Limited Service Branch (Courier), at 238 Madison Street, Central Motor Branch, Wal-Mart Supercenter Facility, - Wal Mart Ea."}]