[{"url": "http://www.merriam-webster.com/dictionary/carbon%20footprint", "passage_text": "Definition of CARBON FOOTPRINT. : the amount of greenhouse gases and specifically carbon dioxide emitted by something (as a person's activities or a product's manufacture and transport) during a given period. ADVERTISEMENT. "}, {"url": "http://www.greenhq.net/carbon-footprint/", "passage_text": "The term “carbon footprint” is used to denote the amount of carbon dioxide produced by your daily activities and use of material goods. Since CO2 is the most common of the greenhouse gases, you can determine your personal participation in Global Warming. Your primary footprint comes from your personal activities that result in carbon dioxide emissions – things like your car burning fossil fuels, the energy you use to heat and cool your home, the electricity consumed at home or work, etc."}, {"url": "http://timeforchange.org/what-is-a-carbon-footprint-definition", "passage_text": "What is a carbon footprint-definition. The total amount of greenhouse gases produced to directly and indirectly support human activities, usually expressed in equivalent tons of carbon dioxide (CO2). Usually a carbon footprint is calculated for the time period of a year. The best way is to calculate the carbon dioxide emissions based on the fuel consumption. In the next step you can add the CO2 emission to your carbon footprint."}, {"url": "http://www.answers.com/Q/What_does_the_word_Carbon_Footprint_mean", "passage_text": "Carbon footprint is a measure of the impact our activities have on  the environment, and in particular climate change. It relates to  the amount of greenhouse gases produced … in our day-to-day lives  through burning fossil fuels for electricity, heating and  transportation etc. A carbon footprint is a measure of the impact human activities have on the environment in terns of the amount of greenhouse gases produced, measured in units of carbon dioxide … ."}, {"url": "http://whatis.techtarget.com/definition/carbon-footprint", "passage_text": "Part of the Smart grid glossary: A carbon footprint is the measure of the environmental impact of a particular individual or organization's lifestyle or operation, measured in units of carbon dioxide. A carbon footprint is composed of two parts, a primary and secondary footprint. "}, {"url": "http://homeguides.sfgate.com/reducing-carbon-footprint-mean-78722.html", "passage_text": "Taking the bus to work instead of driving one weekday for a year reduces your footprint by 1,167 lbs. of carbon dioxide (see References 1). Your carbon footprint measures the total amount of greenhouse gases emitted as a result of your daily activities. When you drive to work, run the appliances in your home or sneak off for a weekend getaway, you cause the burning of fossil fuels, which provide the energy needed to power your lifestyle. Food and Diet. To appreciate the carbon footprint of food, compare the fuel used to transport locally grown strawberries to market with midwinter strawberries that likely travel thousands of miles to arrive at your grocer's produce section. Also consider the type of food consumed."}, {"url": "https://en.wikipedia.org/wiki/Carbon_footprint", "passage_text": "A carbon footprint is historically defined as the total sets of greenhouse gas emissions caused by an organization, event, product or individual.. The total carbon footprint cannot be calculated because of the large amount of data required and the fact that carbon dioxide can be produced by natural occurrences. Carbon footprint is one of a family of footprint indicators, which also includes water footprint and land footprint."}, {"url": "http://timeforchange.org/what-is-a-carbon-footprint-definition", "passage_text": "Your carbon footprint is the sum of all emissions of CO2 (carbon dioxide), which were induced by your activities in a given time frame. Usually a carbon footprint is calculated for the time period of a year. The best way is to calculate the carbon dioxide emissions based on the fuel consumption. In the next step you can add the CO2 emission to your carbon footprint. Below is a table for the most common used fuels: Examples: 1  For each (UK-) gallon of petrol fuel consumed, 10.4 kg carbon dioxide (CO 2) is emitted. 2  For each (US-) gallon of gasoline fuel consumed, 8.7 kg carbon dioxide (CO 2) is emitted"}, {"url": "http://gogreencyclopedia.blogspot.com/2012/04/what-is-carbon-footprint-and-what-does.html", "passage_text": "A carbon footprint is a measure of the impact our activities have on the environment, and in particular climate change. It relates to the amount of carbon emissions produced in our day-to-day lives through burning fossil fuels for electricity, heating, transportation, etc. "}, {"url": "http://timeforchange.org/what-is-a-carbon-footprint-definition", "passage_text": "A carbon footprint is defined as: The total amount of greenhouse gases produced to directly and indirectly support human activities, usually expressed in equivalent tons of carbon dioxide (CO2). Usually a carbon footprint is calculated for the time period of a year. The best way is to calculate the carbon dioxide emissions based on the fuel consumption. In the next step you can add the CO2 emission to your carbon footprint."}]