[{"url": "http://www.literarydevices.com/epistrophe/", "passage_text": "Definition of Epistrophe. Epistrophe is a figure of speech that involves the repetition of a word or phrase at the end of successive clauses or sentences. Epistrophe is also known as epiphora or antistrophe. The word epistrophe comes from the Greek for “return.”. The definition of epistrophe is opposite to that of anaphora, which is the repetition of words at the beginning of successive clauses or sentences."}, {"url": "http://fos.iloveindia.com/epistrophe-examples.html", "passage_text": "In case of English, epistrophe is used as a means to draw your focus to the actual meaning of it. Epistrophe is a rhetorical terms for the repetition of a word or a phrase used at the end of a clause or a sentence. Epistrophe also has other names like epiphora or antistrophe. When observed keenly, the use of ephistrophe examples create a particular pattern and gives rise to an ease of familiarity. "}, {"url": "http://literarydevices.net/epistrophe/", "passage_text": "The Difference between Anaphora and Epistrophe. Anaphora is the opposite of epistrophe and means the repetition of the same phrase or word at the beginning of successive sentences such as in this example. 1. Five years have passed; Five summers, with the length of. Five long winters! and again I hear these waters…."}, {"url": "http://www.merriam-webster.com/dictionary/epistrophe", "passage_text": "Definition of EPISTROPHE. : repetition of a word or expression at the end of successive phrases, clauses, sentences, or verses especially for rhetorical or poetic effect (as Lincoln's “of the people, by the people, for the people”) — compare anaphora. ADVERTISEMENT."}, {"url": "http://the-difference-between.com/epistrophe/anaphora", "passage_text": "is that anaphora is (rhetoric) the repetition of a phrase at the beginning of phrases, sentences, or verses, used for emphasis while epistrophe is (rhetoric) the repetition of the same word or words at the end of successive phrases, clauses or sentences. 1 In context\\|rhetoric\\|lang=en terms the difference between anaphora and epistrophe is that anaphora is (rhetoric) the repetition of a phrase at} DUPipeline_QISnippet_FirstGood_Snippet_v1: {},{-1|-1|1|Anaphora is an antonym of epistrophe."}, {"url": "http://literarydevices.net/epistrophe/", "passage_text": "Epistrophe is derived from a Greek word that means turning upon, which indicates the same word returns at the end of each sentence. Epistrophe is a stylistic device that can be defined as the repetition of phrases or words at the end of the clauses or sentences. It is also called epiphora. Epistrophe examples are frequently found in literary pieces, in persuasive writing and speeches. Anaphora is the opposite of epistrophe and means the repetition of the same phrase or word at the beginning of successive sentences such as in this example. 1. Five years have passed; Five summers, with the length of. Five long winters! and again I hear these waters…."}, {"url": "https://en.wikipedia.org/wiki/Epistrophe", "passage_text": "Epistrophe (Greek: ἐπιστροφή, return) is the repetition of the same word or words at the end of successive phrases, clauses or sentences. It is also known as epiphora and occasionally as antistrophe. It is a figure of speech and the counterpart of anaphora. Greek Epistrophe: a word coined by Plato as a goal of philosophical education and the term adopted by early Christians for conversion.."}]