[{"url": "http://www.madrid.climatemps.com/", "passage_text": "1 Average monthly temperatures vary by 18.8 °C (33.8°F). 2  This indicates that the continentality type is oceanic, subtype semicontinental. 3  Total annual Precipitation averages 411.9 mm (16.2 inches) which is equivalent to 411.9 Litres/m (10.1 Gallons/ft). 4  On average there are 2910 hours of sunshine per year. 1 Total annual Precipitation averages 411.9 mm (16.2 inches) which is equivalent to 411.9 Litres/m (10.1 Gallons/ft). 2"}, {"url": "https://en.wikipedia.org/wiki/Climate_of_Madrid", "passage_text": "General [edit]. Its average annual temperature is 19.4 °C (66.9 °F) during the day and 9.7 °C (49.5 °F) at night. In the coldest month – January, typically the temperature ranges from 5 to 15 °C (41 to 59 °F) during the day and −2 to 6 °C (28 to 43 °F) at night. The highest temperature recorded during the day is 40.6 °C (105.1 °F) on the 10 August 2012. On the August 1933 reported record, the average maximum temperature during the day was 35.5 °C (95.9 °F). The coldest temperature recorded was −10.1 °C (13.8 °F) at night on 16 January 1945."}, {"url": "http://www.gomadrid.com/madrid-weather.html", "passage_text": "The time and date in Spain is now ... Today's weather in Madrid ... Madrid Weather Forecast, Spain. Average yearly temperatures here. In Spain, the time during the winter months is GMT+1 and during the summer GMT+2. "}, {"url": "http://www.madrid.climatemps.com/temperatures.php", "passage_text": "Average Temperatures in Madrid, Spain. 1  The annual average temperature in Madrid, Spain is mild at 13.9 degrees Celsius (57.1 degrees Fahrenheit). 2  Average monthly temperatures have a range of 18.8 C (33.8 F) which is a slightly low range. 3  There is a variation/ range of daily average temperatures of 13.4 C (24.2 F). 1 There is a variation/ range of daily average temperatures of 13.4 C (24.2 F). 2  The hottest month (July) is fairly hot having an average temperature of 24.3 degrees Celsius (75.74 degrees Fahrenheit). 3  The coolest month (January) is cool with a mean temperature of 5.5 degrees Celsius (41.9"}, {"url": "http://www.madrid-tourist-guide.com/en/weather/weather-madrid.html", "passage_text": "Winter in Madrid is bright and sunny. Due to Madrid's high altitude of 650 metres, it experiences quite different temperatures in the summer and the winter. The most pleasant warm weather falls between May and mid July when average temperatures are between 20 and 32 degrees Celsius (68°F - 90°F). September is a pleasant month, with temperatures back down to around 25 degrees Celsius (77°F). October is also still fairly warm with an average daytime temperature of 20 degrees Celsius (68°F) and is still a pleasant time to visit. The weather in Madrid is predominantly dry, but that doesn't mean that rain can be ruled out. Especially in the winter months"}, {"url": "https://en.wikipedia.org/wiki/Climate_of_Madrid", "passage_text": "Madrid has on average only 63 precipitation days a year, therein average several rainy days per month (≥ 1 mm), ranging from 2 days in July and August to 8 days in May. The average annual precipitation is less than 436 mm (17.87 inches), ranging from 10 mm (0.35 inch) in Austust to 56 mm in November and December. The highest temperature recorded during the day is 40.6 °C (105.1 °F) on the 10 August 2012. On the August 1933 reported record, the average maximum temperature during the day was 35.5 °C (95.9 °F). The coldest temperature recorded was −10.1 °C (13.8 °F) at night on 16 January 1945."}, {"url": "http://www.madrid.climatemps.com/temperatures.php", "passage_text": "1 Average monthly temperatures have a range of 18.8 C (33.8 F) which is a slightly low range. 2  There is a variation/ range of daily average temperatures of 13.4 C (24.2 F). 3  The hottest month (July) is fairly hot having an average temperature of 24.3 degrees Celsius (75.74 degrees Fahrenheit). 1 There is a variation/ range of daily average temperatures of 13.4 C (24.2 F). 2  The hottest month (July) is fairly hot having an average temperature of 24.3 degrees Celsius (75.74 degrees Fahrenheit). 3  The coolest month (January) is cool with a mean temperature of 5.5 degrees Celsius (41.9"}, {"url": "http://www.madrid.climatemps.com/temperatures.php", "passage_text": "1 The annual average temperature in Madrid, Spain is mild at 13.9 degrees Celsius (57.1 degrees Fahrenheit). 2  Average monthly temperatures have a range of 18.8 C (33.8 F) which is a slightly low range. 3  There is a variation/ range of daily average temperatures of 13.4 C (24.2 F). 1 There is a variation/ range of daily average temperatures of 13.4 C (24.2 F). 2  The hottest month (July) is fairly hot having an average temperature of 24.3 degrees Celsius (75.74 degrees Fahrenheit). 3  The coolest month (January) is cool with a mean temperature of 5.5 degrees Celsius (41.9"}, {"url": "http://www.holiday-weather.com/madrid/averages/", "passage_text": "Madrid: Annual Weather Averages. July is the hottest month in Madrid with an average temperature of 25°C (76°F) and the coldest is January at 6°C (42°F) with the most daily sunshine hours at 13 in July. The wettest month is April with an average of 50mm of rain. Loading weather data."}]