[{"url": "http://www.answers.com/Q/How_much_does_an_aba_player_get_paid", "passage_text": "NFL player contracts are based on the teams and players agent agreement. Minimum salary per year in the NFL is $310,000. The average yearly salary in the NFL is $1.1millio … n a year. Answered by The Community. Making the world better, one answer at a time. ABA does not exist anymore. However, it did years ago and when it did, the common salary was anywhere between $500 to $2000 a week."}, {"url": "https://en.wikipedia.org/wiki/ABA-NBA_merger", "passage_text": "1 The four remaining ABA teams had to pay a $3.2 million expansion fee to the NBA by September 15, 1976. 2  The New York Nets were to pay an additional $4.8 million directly to their in-town rival, the New York Knicks, as compensation for invading the New York area. Tom Nissalke left the ABA to coach the NBA's Houston Rockets in the first post-merger season and won the Central Division; Nissalke was named NBA Coach of the Year. Former Kentucky Colonels coach Hubie Brown took over the NBA's Atlanta Hawks, and the four former ABA teams kept their coaches as they entered the NBA."}, {"url": "http://www.oursportscentral.com/boards/archive/index.php/t-3847.html", "passage_text": "10-12-2006, 04:29 AM. Just curious. Because I know that most local ABA teams go into bankruptcy, and rely on sponsors etc, so I wonder how much do they pay their players. The ones on the court, and the ones sitting on the bench."}, {"url": "https://en.wikipedia.org/wiki/American_Basketball_Association", "passage_text": "In 1999, a new league calling itself the ABA 2000 was established. The new league uses a similar red, white and blue basketball as the old ABA, but unlike the original ABA, it does not feature players of the same caliber as the NBA, nor does it play games in major arenas nor on television as the original ABA did. Nevertheless, the emergence of the ABA boosted the salaries of referees just as it did the salaries of players. The freewheeling style of the ABA eventually caught on with fans, but the lack of a national television contract and protracted financial losses would spell doom for the ABA as an independent circuit."}, {"url": "http://www.answers.com/Q/How_much_does_an_aba_player_get_paid", "passage_text": "The average salary of a basketball player in the NBA is about $4.2 million per year.A … starting rookie player makes about $750,000 per year, while a highly paid and highly skilled NBA player can make upwards of $10 million per year. Answered by The Community. Making the world better, one answer at a time. ABA does not exist anymore. However, it did years ago and when it did, the common salary was anywhere between $500 to $2000 a week."}, {"url": "http://www.ridiculousupside.com/2013/5/3/4296092/examining-the-low-pay-of-nba-d-league-players", "passage_text": "Still, such isn't much to write home about. In addition to the modest salary, there are other varied perks. The D-League teams do in fact pay for player housing, provide certain benefits, and grant each of their players a $40 per-diem for food, etc. "}, {"url": "http://www.oursportscentral.com/boards/showthread.php?t=11743", "passage_text": "But......................there is always a BUT in the ABA............ but those teams went to another league. Most ABA teams won't pay anything. They don't have the money to answer the phone let alone pay the player. A good ABA team will actually pay the player......an average ABA team will fold. Posts: 1,066. Last year there were several ABA teams actually paying that much or more per week for some of their players. But, it looks like nearly all of those teams have either closed up shop or defected so I think that the $600/mo number moving forward might be accurate."}, {"url": "http://www.oursportscentral.com/boards/archive/index.php/t-3847.html", "passage_text": "Teams like Rochester use much of it, while there are teams that pay players a nominal fee. I believe the OC Buzz paid guys $50 or $100 a game, and they agreed to that and moved forward. Because I know that most local ABA teams go into bankruptcy, and rely on sponsors etc, so I wonder how much do they pay their players. The ones on the court, and the ones sitting on the bench."}, {"url": "http://usatoday30.usatoday.com/sports/basketball/story/2012-05-19/nba-wnba-basketball-salary-disparity/55079608/1", "passage_text": "The rise in NBA salaries can be traced to the 1970s when the league competed against the American Basketball Association for players. Harvey Catchings noted that Julius Erving 's spectacular play — and by 1970s standards, spectacular salary -- was a catalyst for the NBA/ABA merger. "}]