[{"url": "http://www.space.com/30372-gas-giants.html", "passage_text": "View full size image. A gas giant is a large planet composed mostly of gases, such as hydrogen and helium, with a relatively small rocky core. The gas giants of our solar system are Jupiter, Saturn, Uranus and Neptune. "}, {"url": "https://en.wikipedia.org/wiki/Terrestrial_planet", "passage_text": "A terrestrial planet, telluric planet or rocky planet is a planet that is composed primarily of silicate rocks or metals. Within the Solar System, the terrestrial planets are the inner planets closest to the Sun, i.e. Mercury, Venus, Earth, and Mars. "}, {"url": "http://lasp.colorado.edu/education/outerplanets/giantplanets_whatandwhere.php", "passage_text": "The cores of all four jovian planets are made of some combination of rock, metal and hydrogen compounds. Jupiter and Saturn have similar interiors, with layers extending outward of metallic hydrogen, liquid hydrogen, gaseous hydrogen, and topped with a layer of visible clouds. All four jovian planets have rings, although only Saturn's rings are easily visible from Earth. Rings are composed of countless small pieces of rock and ice, each orbiting its planet like a tiny moon. The rings look flat because the particles all orbit in essentially the same plane."}, {"url": "http://www.answers.com/Q/What_are_jovian_planets_made_of", "passage_text": "The Jovian planets, or Gas Giants are not all comprised of the same gases. The Traditional Jovian planets, Jupiter and Saturn, contain mostly hydrogen and helium with other … heavy elements making about 3 to 10 percent of its mass. Jovian planets can also be called gas giants. They are Jupiter, Saturn, Neptune and Uranus. They are mostly made up of gas, but they have a rocky core, (somewhere!). They are … said to lack a solid surface, But they actually don't really have a surface at all!"}, {"url": "https://en.wikipedia.org/wiki/Gas_giant", "passage_text": "A gas giant is a giant planet composed mainly of hydrogen and helium. Jupiter and Saturn are the Solar System 's gas giants. The term gas giant was originally synonymous with giant planet, but in the 1990s it became known that Uranus and Neptune are really a distinct class of giant planet, being composed mainly of heavier volatile substances (which are referred to as 'ices'). Jupiter and Saturn consist mostly of hydrogen and helium, with heavier elements making up between 3 and 13 percent of the mass. They are thought to consist of an outer layer of molecular hydrogen surrounding a layer of liquid metallic hydrogen, with probably a molten rocky core."}, {"url": "https://en.wikipedia.org/wiki/Jovian_planet", "passage_text": "Relative masses of the giant planets of the Solar System. A giant planet is any massive planet. They are usually primarily composed of low-boiling-point materials (gas or ices), rather than rock or other solid matter, but massive solid planets can also exist. There are four giant planets in the Solar System: Jupiter, Saturn, Uranus and Neptune. Many extrasolar giant planets have been identified orbiting other stars. Giant planets are also sometimes called jovian planets, after Jupiter. They are also sometimes known as gas giants."}, {"url": "http://lasp.colorado.edu/education/outerplanets/giantplanets_whatandwhere.php", "passage_text": "Composition. Jupiter, Saturn, Uranus and Neptune collectively make up the group known as the jovian planets. The general structures of the jovian planets are opposite those of the terrestrial planets. All four jovian planets have rings, although only Saturn's rings are easily visible from Earth. Rings are composed of countless small pieces of rock and ice, each orbiting its planet like a tiny moon. The rings look flat because the particles all orbit in essentially the same plane."}, {"url": "http://planetfacts.org/jovian-planets/", "passage_text": "A Jovian planet is a gas giant, the term is derived from Jupiter which describes the three other gas giants in the Solar System as Jupiter-like. Though the name may imply it, a gas giant is not composed only of gas. "}, {"url": "http://www.pbs.org/wgbh/nova/education/activities/3113_origins_07.html", "passage_text": "Terrestrial and Jovian Planets. With the exception of Pluto, planets in our solar system are classified as either terrestrial (Earth-like) or Jovian (Jupiter-like) planets. Terrestrial planets include Mercury, Venus, Earth, and Mars. These planets are relatively small in size and in mass. Jovian planets include Jupiter, Saturn, Uranus, and Neptune. These planets have larger sizes and masses. Jovian planets do not have solid surfaces. They are sometimes called gas giants because they are large and made mostly of gases. Small amounts of rocky materials are only found deep in the cores of Jovian planets. In the solar system, Jovian planets are located farther from the sun than terrestrial planets, and are therefore cooler"}]