[{"url": "http://cirisenergy.com/terminology/natural-gas-terminology/independent-producer/", "passage_text": "INDEPENDENT PRODUCER. It is defined in IRC section 613A(d) as a producer who does not have more than $5 million in retail sales of oil or gas in a year and who does not refine more than 50,000 barrels of crude on any day during the year."}, {"url": "http://www.mineralweb.com/library/oil-and-gas-terms/independent-producer-definition/", "passage_text": "Independent Producer | definition. An energy company, usually in the exploration and production segment of the industry – and generally, with no marketing, transportation or refining operations. Also known as a non-integrated producing company in the oil industry"}, {"url": "http://work.chron.com/responsibilities-independent-producer-17900.html", "passage_text": "An independent producer finds people who want to invest in the movie for a variety of reasons, either in hopes of realizing a profit, or because of a personal connection, or because they support and believe in the project itself. A producer can be responsible for everything from raising money to hiring actors to overseeing the budget. Some producers work for one of the major Hollywood film studios, while others are independent. Some independently produced movies have been major hits."}, {"url": "https://en.wikipedia.org/wiki/Film_producer", "passage_text": "Either employed by a production company or independent, producers plan and coordinate various aspects of film production, such as selecting script, coordinating writing, directing and editing, and arranging financing. Whereas historically in television, the primary role of the producer was to oversee all aspects of video production, in film and often in television today, this role is filled by the Line Producer. The line producer may manage a film's budget and maintain a schedule."}, {"url": "https://en.wikipedia.org/wiki/Independent_Insurance_Agent", "passage_text": "Independent insurance agents, also known as insurance sales agents or producers, typically sell a variety of insurance and financial products, including property insurance and casualty insurance, life insurance, health insurance, disability insurance, and long-term care insurance. Independent agents own and control their accounts, policy records, and renewals. If an independent agent’s contract with a particular insurance company terminates, the agent retains the rights to active accounts and may place them with another insurer. Competition exists between exclusive agents and independent agents."}, {"url": "https://en.wikipedia.org/wiki/Film_producer", "passage_text": "The average Hollywood film made in 2013 had just over 10 producer credits (3.2 producers, 4.4 executive producers, 1.2 co-producers, 0.8 associate producers and 0.5 other types of producer). Whereas historically in television, the primary role of the producer was to oversee all aspects of video production, in film and often in television today, this role is filled by the Line Producer. The line producer may manage a film's budget and maintain a schedule."}, {"url": "http://www.ehealthlink.com/what_is_insurance.asp", "passage_text": "An insurance producer must also be appointed by at least one insurance company to transact business on its behalf. He or she may be appointed with several insurance companies or health plans. An insurance producer is usually an independent businessperson rather than an employee of an insurance company. Oregon. Washington. Arizona. An insurance producer (also called an agent or insurance broker) is an individual licensed by a State's Insurance Division or Department to sell insurance in that State."}, {"url": "http://work.chron.com/responsibilities-independent-producer-17900.html", "passage_text": "Duties of an Independent Producer. Independent producers usually perform all of the job duties of a studio movie producer, plus the additional duty of finding investors for the project. Independent movies usually cost less money to make than their studio counterparts, but they are still expensive. A producer can be responsible for everything from raising money to hiring actors to overseeing the budget. Some producers work for one of the major Hollywood film studios, while others are independent. Some independently produced movies have been major hits."}, {"url": "http://merlin.obs.coe.int/iris/2003/9/article16.en.html", "passage_text": "The UK has amended the definition of independent producer for the purposes of section 16 of the Broadcasting Act 1990, which requires that independent productions form at least 25% of programmes broadcast by the major broadcasters. "}, {"url": "http://definitions.uslegal.com/i/independent-producer-oil-and-gas/", "passage_text": "Independent Producer is an energy company, usually in the exploration and production segment of the industry and generally, with no marketing, transportation or refining operations. "}]