[{"url": "http://www.vanityfair.com/news/politics/2014/12/obama-end-of-afghan-war", "passage_text": "President Barack Obama declared the 13-year war in Afghanistan officially over on Sunday, praising the troops and claiming that Americans are safer for their efforts. In Kabul, General John Campbell folded the flag of the International Security Assistance Force, and unfurled the flag of a new mission, Resolute Support. “For more than 13 years, ever since nearly 3,000 innocent lives were taken from us on 9/11, our nation has been at war in Afghanistan,” Obama’s statement about the changing missions read. The president highlighted the “extraordinary sacrifices” of troops, some 2,200 of whom have died to date during the $1 trillion war."}, {"url": "http://mediamatters.org/blog/2013/08/05/fox-uses-terror-threat-to-falsely-claim-obama-d/195240", "passage_text": "On Your World, Fox News contributor Lisa Daftari told host Neil Cavuto, We've been told by this administration that the war on terror is over.. But as TIME magazine's Michael Crowley explained, Obama did not declare the war on terror over; rather, he warned that the threat of al Qaeda has shifted: During a segment on The Five about the threat, Fox producer Jesse Watters stated that in the big speech he gave three months ago, Obama said, technically"}, {"url": "http://mediamatters.org/blog/2013/08/05/fox-uses-terror-threat-to-falsely-claim-obama-d/195240", "passage_text": "Fox News figures are using a possible al Qaeda plot to falsely claim that President Obama declared the war on terror over. The State Department has closed embassies and consulates in the Middle East and Africa in response to an intercepted communication between al Qaeda leaders about a potential terror attack. During a segment on The Five about the threat, Fox producer Jesse Watters stated that in the big speech he gave three months ago, Obama said, technically the war on terror is over.."}, {"url": "http://thehill.com/homenews/administration/189075-obama-to-declare-iraq-war-over-with-troops-home-at-years-end", "passage_text": "Obama declares Iraq war over with all US troops home at year's end. &nbsp. By Sam Youngman - 10/21/11 07:49 PM EDT. Obama said he invited Maliki to the White House in December to discuss the normal relationship the two nations will now enjoy. President Obama announced Friday that the U.S. will complete its drawdown of troops by the end of the year, concluding the war in Iraq after almost nine years."}, {"url": "http://thehill.com/homenews/administration/189075-obama-to-declare-iraq-war-over-with-troops-home-at-years-end", "passage_text": "Obama, who sprang to national prominence with his condemnation of the war begun by his predecessor, declared in the White House briefing room that after nearly nine years, America's war in Iraq will be over.. Obama said he invited Maliki to the White House in December to discuss the normal relationship the two nations will now enjoy. President Obama announced Friday that the U.S. will complete its drawdown of troops by the end of the year, concluding the war in Iraq after almost nine years."}, {"url": "http://www.cbsnews.com/news/obama-announces-end-of-iraq-war-troops-to-return-home-by-year-end/", "passage_text": "Obama ends Iraq war. President Obama on Friday announced plans to withdraw all U.S. troops from Iraq by the end of the year, formally ending the war that has claimed ... After nearly 9 years, America's war in Iraq will be over, said Mr. Obama. He said the last American troops will depart the country by January 1 with their heads held high, proud of their success, and knowing that the American people stand united in our support for our troops.. Play Video Washington Unplugged Obama ends Iraq war President Obama on Friday announced plans to withdraw all U.S. troops from Iraq by the end of the year, formally ending the war that has claimed ... Washington Unplugged."}, {"url": "http://www.dailymail.co.uk/news/article-2331112/GOP-bashes-Obama-declaring-war-terror-over.html", "passage_text": "Some call it wishful thinking, but President Barack Obama has all but declared an end to the global war on terror. Obama is not claiming final victory over extremists who still seek to kill Americans and other Westerners. Obama under fire for declaring the war on terror 'over' in week of extremist attacks. 1  Obama says al-Qaida is 'on the path to defeat,' reducing the scale of terrorism to pre-Sept. 11 levels. ' 2 Wishing the defeat of terrorists does not make it so,' said Rep. Mac Thornberry, a Texas Republican."}, {"url": "http://mediamatters.org/blog/2013/08/05/fox-uses-terror-threat-to-falsely-claim-obama-d/195240", "passage_text": "Obama's speech actually disappointed some liberals actually might like to see Obama declare an end to the terror war-not as a matter of defeatism, but as a step towards policies that rely less on killing and more on capture and prosecution in the criminal justice system. During a segment on The Five about the threat, Fox producer Jesse Watters stated that in the big speech he gave three months ago, Obama said, technically the war on terror is over.."}, {"url": "http://readersupportednews.org/news-section2/308-12/8014-breaking-obama-declares-iraq-war-over", "passage_text": "Sam Youngman Reports: President Obama announced Friday that the U.S. will complete its drawdown of troops by the end of the year, concluding the war in Iraq after almost nine years.. President Barack Obama speaks in the briefing room of the White House in Washington, 10/21/11. (photo: Philip Scott Andrews/NYT). Obama is moving forces to base in Bahrain. Did not say how Iraq is better - democratic after nine years of occupation-how the defense budget will be cut by 50% -  17,000 State Department personnel.. translate private armed US gangs .."}, {"url": "http://www.telegraph.co.uk/news/worldnews/barackobama/7772598/Barack-Obama-declares-the-War-on-Terror-is-over.html", "passage_text": "President Barack Obama has rejected George W. Bush's doctrine that placed the war on terror at the centre of American foreign policy, Barack Obama Photo: REUTERS. In the 52-page document, drawn up after 16 months of deliberations, Mr Obama outlines a much broader set of priorities and methods than Mr Bush's tightly-focused determination to eradicate Islamism by any means possible and alone if necessary."}]