[{"url": "http://bladder.emedtv.com/nitrofurantoin/nitrofurantoin-dosage.html", "passage_text": "For long-term treatment to prevent UTIs in adults, a dose of 50 or 100 mg once daily at bedtime is usually sufficient. The recommended dose of nitrofurantoin for treating urinary tract infections in children (age one month and older) is based on body weight. As a result, it is best if your child's healthcare provider weighs your child in order to determine an accurate dosage, especially if your child has not been weighed recently"}, {"url": "http://antibiotics.emedtv.com/macrobid/macrobid-dosage.html", "passage_text": "When taking Macrobid for the treatment of a urinary tract infection (UTI), the typical dosage is 100 mg twice a day for seven days. There is only one standard dose for Macrobid ® (nitrofurantoin monohydrate/macrocrystalline), regardless of your age or weight. As is always the case, do not adjust this amount unless your healthcare provider specifically tells you to do so."}, {"url": "http://www.medicinenet.com/nitrofurantoin/article.htm", "passage_text": "DRUG CLASS AND MECHANISM: Nitrofurantoin is an antibiotic that is used for treating urinary tract infections caused by several types of bacteria. It is effective against E. Coli, Enterobacter cystitis, Enterococcus, Klebsiella, and S taphylococcus aureus. "}, {"url": "http://bladder.emedtv.com/nitrofurantoin/nitrofurantoin-dosage.html", "passage_text": "The recommended nitrofurantoin dosage for treating UTIs in adults is 50 to 100 mg four times daily, continued for at least three days after the infection has cleared. The recommended dose of nitrofurantoin for treating urinary tract infections in children (age one month and older) is based on body weight."}, {"url": "http://www.everydayhealth.com/drugs/macrobid", "passage_text": "Macrobid is the brand name for nitrofurantoin, an antibiotic used to treat or prevent urinary tract infections. Macrobid works by killing the bacteria that cause the infection or by preventing the bacteria from growing. Macrobid (Nitrofurantoin) Interactions. If you are taking Macrobid, avoid antacids that contain magnesium trisilicate. Taking both together will reduce how well and how quickly the antibiotic is absorbed. Taking Macrobid while you are on the antifungal drug Diflucan (fluconazole) is not recommended."}, {"url": "http://www.rxlist.com/macrobid-drug/indications-dosage.htm", "passage_text": "To reduce the development of drug-resistant bacteria and maintain the effectiveness of Macrobid and other antibacterial drugs, Macrobid should be used only to treat or prevent infections that are proven or strongly suspected to be caused by susceptible bacteria. The U.S. Food and Drug Administration today approved Zerbaxa (ceftolozane/tazobactam), a new antibacterial drug product, to treat adults with complicated intra-abdominal infections (cIAI) and complicated urinary tract infections (cUTI). Zer..."}, {"url": "http://antibiotics.emedtv.com/macrobid/macrobid-dosage.html", "passage_text": "An Introduction to Dosing With Macrobid. The recommended Macrobid dosage for treating urinary tract infections in people age 12 and older is 100 mg twice daily for seven days. This medication is not approved for children under 12 years of age. There is only one standard dose for Macrobid ® (nitrofurantoin monohydrate/macrocrystalline), regardless of your age or weight. As is always the case, do not adjust this amount unless your healthcare provider specifically tells you to do so."}, {"url": "http://www.everydayhealth.com/drugs/macrobid", "passage_text": "The recommended dose of Macrobid is different depending on whether it is being used to treat a urinary tract infection or prevent one. In general, here are the ranges of oral doses given: 1  50 to 100 milligrams (mg) at bedtime for adults and teens to prevent infections. Macrobid (Nitrofurantoin) Interactions. If you are taking Macrobid, avoid antacids that contain magnesium trisilicate. Taking both together will reduce how well and how quickly the antibiotic is absorbed. Taking Macrobid while you are on the antifungal drug Diflucan (fluconazole) is not recommended."}, {"url": "http://bladder.emedtv.com/nitrofurantoin/nitrofurantoin-dosage.html", "passage_text": "Nitrofurantoin Dosage for Macrodantin and Furadantin. The recommended nitrofurantoin dosage for treating UTIs in adults is 50 to 100 mg four times daily, continued for at least three days after the infection has cleared. For uncomplicated infections, the lower amount is usually recommended. The recommended dose of nitrofurantoin for treating urinary tract infections in children (age one month and older) is based on body weight."}, {"url": "http://www.rxlist.com/macrobid-drug/indications-dosage.htm", "passage_text": "INDICATIONS. Macrobid is indicated only for the treatment of acute uncomplicated urinary tract infections (acute cystitis) caused by susceptible strains of Escherichia coli or Staphylococcus saprophyticus. Nitrofurantoin is not indicated for the treatment of pyelonephritis or perinephric abscesses. The U.S. Food and Drug Administration today approved Zerbaxa (ceftolozane/tazobactam), a new antibacterial drug product, to treat adults with complicated intra-abdominal infections (cIAI) and complicated urinary tract infections (cUTI). Zer..."}]