[{"url": "http://www.thesherwoodinn.com/patisserie", "passage_text": "The Patisserie features artisan breads, fine pastries, specialty cookies and pies as well as traditional holiday baked goods. For that special day, consider a custom designed Wedding Cake from The Patisserie. (315) 685-2433. The Patisserie features artisan breads, fine pastries, specialty cookies and pies as well as traditional holiday baked goods. For that special day, consider a custom designed Wedding Cake from The Patisserie. Cake tastings available by appointment."}, {"url": "http://www.merriam-webster.com/dictionary/patisserie", "passage_text": "French patisserie, pâtisserie From Middle french, pastiserie from pasticier to make, pastry From Old *french pastitz, cake From Vulgar *latin, pasticium From Late latin pasta. dough French patisserie, pâtisserie From Middle french, pastiserie from pasticier to make, pastry From Old *french pastitz, cake From Vulgar *latin, pasticium From Late latin pasta. Dough First Known: use. 1784"}, {"url": "http://www.definitions.net/definition/patisserie", "passage_text": "In France and Quebec, the term patisserie pâtisserie also refers to the pastries produced by a. Patissier-pâtissier mass produced pastries are also sometimes. Called Patisserie, pâtisserie in australia patisserie pâtisserie is used commonly along with the words. bakery or pastry shop In Korea the term patissier pâtissier is used as. Well In france And, quebec the term patisserie pâtisserie also refers to the pastries produced by. A-patissier pâtissier mass produced pastries are also. sometimes called patisserie pâtisserie"}, {"url": "http://www.answers.com/Q/What_is_sold_at_a_patisserie_in_France", "passage_text": "A patisserie is a French pastry shop. It sells cakes, pies, fancy sweet pastries, tarts and puddings, as well as croissants and other types of light bread. Patisseries also usually make cakes for special occasions to order. They should not be confused with mainstream bakeries-a bakery in France is called a boulangerie. It took over the site of former Patisserie Francais, which was owned by the Pechon family for over three generations.   BelgraviaThe first of three locations to open in 2003 was in Motcomb Street, Belgravia."}, {"url": "http://www.definitions.net/definition/patisserie", "passage_text": "Patisserie. Pâtisserie a patisserie pâtisserie is the Type of French or belgian bakery that specializes in pastries. And sweets in both countries it is a legally controlled title that may only be used by bakeries that employ a licensed. maitre maître patissier pâtissier In Korea the term patissier pâtissier is used as. Well In france And, quebec the term patisserie pâtisserie also refers to the pastries produced by. A-patissier pâtissier mass produced pastries are also. sometimes called patisserie pâtisserie"}, {"url": "http://www.definitions.net/definition/patisserie", "passage_text": "A patisserie pâtisserie is the type Of french Or belgian bakery that specializes in pastries and. Sweets in both countries it is a legally controlled title that may only be used by bakeries that employ a licensed maitre. maître patissier pâtissier In Korea the term patissier pâtissier is used as. Well In france And, quebec the term patisserie pâtisserie also refers to the pastries produced by. A-patissier pâtissier mass produced pastries are also. sometimes called patisserie pâtisserie"}, {"url": "http://www.definitions.net/definition/patisserie", "passage_text": "In Korea the term patissier pâtissier is used as. Well In france And, quebec the term patisserie pâtisserie also refers to the pastries produced by. A-patissier pâtissier mass produced pastries are also. Sometimes Called, patisserie pâtisserie in australia patisserie pâtisserie is used commonly along with the. words bakery or pastry shop In Korea the term patissier pâtissier is used as. Well In france And, quebec the term patisserie pâtisserie also refers to the pastries produced by. A-patissier pâtissier mass produced pastries are also. sometimes called patisserie pâtisserie"}, {"url": "https://en.wikipedia.org/wiki/Pâtisserie", "passage_text": "In both countries it is a legally controlled title that may only be used by bakeries that employ a licensed maitre maître (patissier pâtissier master). Pastry Chef in France and belgium the patissier pâtissier is a pastry chef who has completed a, lengthy training process, typically an apprenticeship and passed. a written examination "}]