[{"url": "http://www.coloradolegalservices.org/lawhelp/resource/landlords-and-lockouts", "passage_text": "4) Sue: (a)If all you are seeking is money damages from your landlord, you can sue the landlord. If your money damages are not more than $7,500, you can sue the landlord in Small Claims Court. Click here for information about Small Claims on the state court website, or click here to fill out a Small Claims form online."}, {"url": "http://www.nolo.com/legal-encyclopedia/can-i-sue-my-landlord-changing-my-locks-and-throwing-away-my-possessions.html", "passage_text": "Related Ads. Landlords must follow specific state rules and procedures when evicting a tenant. A landlord who takes the law into his or her own hands—for example by changing the locks on your apartment door and removing your belongings—is violating the law."}, {"url": "http://www.coloradolegalservices.org/lawhelp/resource/landlords-and-lockouts", "passage_text": "Colorado Law requires landlords to file an eviction action against the tenant giving the tenant notice of the proceeding and obtaining an order from a court authorizing an eviction before they can change the locks or remove a tenant's belongings."}, {"url": "http://texaslawhelp.org/resource/tenant-lock-outs", "passage_text": "When your landlord changes your door locks because you are behind on paying the rent, the landlord must give you advanced written notice of the proposed lock change AND a written notice at the time your locks are changed."}, {"url": "http://www.thisismoney.co.uk/money/experts/article-2441999/Should-landlord-change-locks-new-tenancy.html", "passage_text": "We have asked the landlord if he can change the locks for us on both the front and back door due to our concern that the previous tenants may have not returned them or cut a copy."}, {"url": "http://www.coloradolegalservices.org/lawhelp/resource/landlords-and-lockouts", "passage_text": "Landlords and Lockouts. A lockout is when the landlord has changed the locks or is denying you access to your rental unit without an eviction order from the Court."}, {"url": "http://www.dallaslandlordlawyer.com/Changing_Locks.htm", "passage_text": "Furthermore, a landlord may not change the locks on the door of a tenant's dwelling on a day, or on a day immediately before a day, on which the landlord or other designated individual is not available, or on which any on-site management office is not open, for the tenant to tender the delinquent rent."}, {"url": "http://www.washingtonlawhelp.org/resource/my-landlord-locked-me-out-what-can-i-do", "passage_text": "If the landlord does lock you out, you can take the landlord to court. If you can show the lockout was illegal, the court should order the landlord to pay you damages plus court costs. Our publication called Small Claims Court has information that may help, depending on how much your claim is for."}, {"url": "http://www.zillow.com/advice-thread/Can-a-renter-change-the-locks/425978/", "passage_text": "You can change the locks on your door anytime you want for your personal well being, however not giving a copy of the key to your landlord is grounds for a seven day eviction notice which has to take it's course through the court system."}]