[{"url": "http://pets.webmd.com/cats/guide/cat-vaccinations", "passage_text": "Lucky for us, there are vaccines to help prevent many illnesses that affect cats. Vaccinating your cat has long been considered one of the easiest ways to help her live a long, healthy life. Not only are there different vaccines for different diseases, there are different types and combinations of vaccines. Bottom line-vaccines are very important in managing the health of your cats. That said, not every cat needs to be vaccinated against every disease. It is very important to discuss with your veterinarian a vaccination protocol that’s right for your cat."}, {"url": "http://www.howmuchisit.org/cat-vaccinations-cost/", "passage_text": "1 The factors to include are the location, the clinic you’re going to and more. 2  The first year cat vaccination cost will generally be the most expensive year, costing upwards of $120 for the entire year. 3  After the cat’s first year, the costs will usually be around $30 to $50 for the entire year for basic vaccinations. 1 After the cat’s first year, the costs will usually be around $30 to $50 for the entire year for basic vaccinations. 2  According to PetEducation, Kittens usually get the most vaccinations in the first year."}, {"url": "http://pets.costhelper.com/cat-vaccination.html", "passage_text": "1 The average cost for cat vaccinations ranges from $45 to $85 and up in the first year, and from $10 to $35 and up per year afterward. I got an exam for my cat and he got a rabies and distemper vaccines. That cost $310. I had to bring him back for a distemper booster (he's an adult indoor cat and hadn't been vaccinated since we rescued him several years ago). That was an additional $89. Yep, the cost of everything is grossly over-inflated in MA."}, {"url": "http://www.howmuchisit.org/cat-vaccinations-cost/", "passage_text": "1 According to PetEducation, Kittens usually get the most vaccinations in the first year. 2  From 10 weeks until their 19th week, they are going to need their Chlamydophila, Rabies, Feline Leukemia, as well as Fel.V. 3  These vaccinations are going to run anywhere from $10 to as much as $90 for the shot itself. 1 After the cat’s first year, the costs will usually be around $30 to $50 for the entire year for basic vaccinations. 2 "}, {"url": "http://www.vetinfo.com/how-much-do-cat-vaccinations-cost.html", "passage_text": "Average Costs of Cat Vaccinations. The average cost of cat vaccinations may be between $50 and $100 during the first year. There may be clinics with more expensive rates per vaccination. The cat will also require boosters (yearly or upon the recommendations of the vet) and these boosters may cost between $10 and $50 per year. There are also certain low cost clinics, organizations or animal shelters that will charge less for vaccinations. "}, {"url": "http://cats.about.com/od/responsibleownership/a/care_costs.htm", "passage_text": "1 The cost will vary depending on the risk factor in your own cat and rabies laws in your area. 2  As with spay and neuter, there are many low-cost vaccination clinics available Let's go with a maximum of $80 for the complete first year series, a high estimate, and around the cost of one night in a moderately nice motel. 1 You can obtain a litter box for $6 to $200 for a deluxe self-cleaning box. 2  A 17-pound bag of World's Best Cat Litter costs around $19, and regular scooping should make it last almost two months for one cat."}, {"url": "http://pets.costhelper.com/cat-vaccination.html", "passage_text": "What should be included: Additional costs: 1  Kittens usually receive a combination vaccine for feline distemper, rhinotracheitis and calcivirus at seven weeks, 10 weeks and 13 weeks, with a separate rabies vaccine at 12 or 13 weeks. 2  PetEducation.com offers detailed information on vaccines and a typical vaccination schedule for kittens and cats. I got an exam for my cat and he got a rabies and distemper vaccines. That cost $310. I had to bring him back for a distemper booster (he's an adult indoor cat and hadn't been vaccinated since we rescued him several years ago). That was an additional $89. Yep, the cost of everything is grossly over-inflated in MA."}, {"url": "http://www.howmuchisit.org/cat-vaccinations-cost/", "passage_text": "1 The cost of the vet exam itself is all going to vary from $55 to as much as $120 just for the visit. 2  The factors to include are the location, the clinic you’re going to and more. 3  The first year cat vaccination cost will generally be the most expensive year, costing upwards of $120 for the entire year. 1 After the cat’s first year, the costs will usually be around $30 to $50 for the entire year for basic vaccinations. 2  According to PetEducation, Kittens usually get the most vaccinations in the first year."}, {"url": "http://www.howmuchisit.org/cat-vaccinations-cost/", "passage_text": "1 The first year cat vaccination cost will generally be the most expensive year, costing upwards of $120 for the entire year. 2  After the cat’s first year, the costs will usually be around $30 to $50 for the entire year for basic vaccinations. 1 After the cat’s first year, the costs will usually be around $30 to $50 for the entire year for basic vaccinations. 2  According to PetEducation, Kittens usually get the most vaccinations in the first year."}]