[{"url": "http://www.answers.com/Q/Should_the_wife_confront_the_other_woman_about_the_affair", "passage_text": "YES! because if the wife finds out and she also finds out that you known she will not be happy. She will also figure out that her husband is not right for her. ANSWER: Sho … uld she, yes, if she knows the wife of the married man she's having an affair with. But this other woman needs to be brave because when she does, the wife will have a lot of questions to her, like why, how, and when. "}, {"url": "http://www.marriage-sanctuary.com/marriage_affair.html", "passage_text": "Now an affair does not mean the end of a marriage. By talking to each other you and your husband can agree to commit and work at fixing your marriage. In most cases, initially the husband does not end communication with the lover. So dealing with the other woman can be looked at from two perspectives. Talk to your husband on ending communication with the other woman and how to deal with any potential threats from this person should they react to being dumped. The next step is to agree on how to move forward in your relationship and marriage."}, {"url": "http://divorcesupport.about.com/od/theothermanotherwoman/p/othermanwoman.htm", "passage_text": "How you handle the fact that there is another man or woman has a great deal to do with whether or not you end up in divorce court or, are able to save your marriage. I have a few suggestions that will help save your sanity and possibly your marriage. Spend your time and energy focused on the problems in the marriage that led to an affair and finding a solution for those problems. See The Relationship For What It Really Is: The relationship with the other man/other woman is an intoxicating fantasy relationship with no foundation but lies and dishonesty."}, {"url": "http://www.yourtango.com/questions/should-i-confront-other-woman-my-husband-having-affair/", "passage_text": "He made the decision, and if it's not her, it will be some other woman. I can understand your anger, but it's misdirected. If you should feel anger towards anyone, it should be towards a man who would be selfish enough to leave his wife and child. "}, {"url": "http://www.marriage-sanctuary.com/marriage_affair.html", "passage_text": "It is important to get the third party out of the relationship and begin to restore your marriage. The knowledge of an affair in itself is a traumatic experience already. When the other woman makes her presence felt, it is even worse to deal with. This is why I advise not to contact the other woman. Talk to your husband on ending communication with the other woman and how to deal with any potential threats from this person should they react to being dumped. The next step is to agree on how to move forward in your relationship and marriage."}, {"url": "http://talkaboutmarriage.com/ladies-lounge/11683-should-i-contact-other-woman.html", "passage_text": "Posts: 9. Re: Should I contact the other woman? do not contact her unless you are going to say your peice and put the phone down, I made the mistake of contacting the other woman and have regretted it, she will rub your nose in it and you will forever replay thier memories in your mind. Re: Should I contact the other woman? If you really think it would make you feel better to send her back the artwork and pictures, then do so."}, {"url": "http://www.lifescript.com/well-being/articles/0/6_strategies_for_confronting_the_other_woman.aspx", "passage_text": "When a husband has an affair, sometimes the wife may resort to confronting the other woman. In one sense, the husband has a legal obligation to uphold. Even if your spouse tells you about the affair, you may decide not to tell him that you will be confronting the other woman. If you tell him, he could try to step in and prevent the meeting, perhaps fearing the leakage of additional condemning evidence. Or he may try to go with you and smooth things over"}, {"url": "http://talkaboutmarriage.com/ladies-lounge/11683-should-i-contact-other-woman.html", "passage_text": "Re: Should I contact the other woman? I get it. You want to scream I won! in her face. I would like to do it too. Send it, just that, and don't make contact or judge her ever again. Re: Should I contact the other woman? If you really think it would make you feel better to send her back the artwork and pictures, then do so."}, {"url": "http://www.jamaicaobserver.com/magazines/allwoman/Should-you-confront-the-other-woman_8695070", "passage_text": "This intervention, that can leave the wife vulnerable and embarrassed, though, is not something advised by psychologists who posit that it's better to confront hubby instead. Psychologist Dr Leahcim Semaj said the wife's main issue is with the man, not the other woman. The other woman would not have a place if the man did not make that open door available, he said. If he did not give her the (phone) number, if he did not do anything to encourage this relationship, she (other woman) would not be doing it."}]