[{"url": "http://ocarm.org/en/content/liturgy/st-joachim-and-st-anne-parents-virgin-mary-protectors-order-m", "passage_text": "According to tradition, Saint Anne was born in Bethlehem, and married Joachim of Nazareth, both descendants of David. Together with her husband, Anne raised Mary to be a paragon of virtue and entrusted her to the temple as a child. It appears that she died at an advanced age."}, {"url": "http://www.answers.com/Q/When_did_Saint_Anne_die", "passage_text": "Nobody really knows when Saint Anne died, but it is assumed it was before Jesus was born. She died of old age. She was alive when Mary returned from her visit to her cousin, b … ut is not mentioned again before Mary and Joseph left for Bethlehem."}, {"url": "http://www.marypages.com/Anna.htm", "passage_text": "“Good Saint Anne” is the loving way that many Catholics address the mother of the Virgin Mary, the Mother of God. Fifty years after Saint Anne’s death, her body was brought to France by Saint Mary Magdalene and her companions in the year 47."}, {"url": "http://www.marypages.com/Anna.htm", "passage_text": "Saint Anne The Mother of the Blessed Virgin Feast: July 26 Anne (Hebrew, Hannah, grace; also spelled Ann, Anne, Anna) is the wife of Joachim and the mother of Mary. She is the grandmother according to the flesh of our Lord, God and Saviour Jesus Christ."}, {"url": "http://www.answers.com/Q/When_did_Saint_Anne_die", "passage_text": "The 5 facts about Saint Anne is that she was the mother of the  Virgin Mary. This therefore means that she was the grandmother to  Jesus. Saint Anne was also the mother-in-l … aw to Joseph."}, {"url": "http://stanneparish.org/patron-saints/", "passage_text": "She lived until Jesus was 8 years old and was 56 years old. She died in the arms of her most beloved daughter Immaculate Mary. Jesus, Mary and Joseph assisted at her death. We celebrate Saint Anne’s feast day July 26."}, {"url": "http://www.answers.com/Q/When_did_Saint_Anne_die", "passage_text": "She was the mother of the Virgin Mary and wife of St. Joachim. She was very unhappy because she was withoout child, but an angle came to her and told she would give birt … h. Saint Anne is the protector of woman in labour, and her feast day is July 26."}, {"url": "http://www.theworkofgod.org/Saints/Lives/AneJoach.htm", "passage_text": "St. Anne spoused St. Joachim at the age of twenty four and she died when she was forty eight. Both St. Joachim and St. Anne were informed of the dignity of Mary just before they died. The Work of God Apostolate www.theworkofgod.org."}]