[{"url": "https://www.wyzant.com/resources/lessons/science/chemistry/bonds", "passage_text": "The value of difference in electronegativity between two atoms in a covalent bond is less than 1.7. Covalent bonds often form between similar atoms, nonmetal to nonmetal or metal to metal. Covalent bonding signals a complete sharing of electrons. "}, {"url": "https://en.wikipedia.org/wiki/Covalent_bond", "passage_text": "A covalent bond forming H 2 (right) where two hydrogen atoms share the two electrons. A covalent bond is a chemical bond that involves the sharing of electron pairs between atoms. A double bond between two given atoms consists of one sigma and one pi bond, and a triple bond is one sigma and two pi bonds. Covalent bonds are also affected by the electronegativity of the connected atoms which determines the chemical polarity of the bond."}, {"url": "http://medical-dictionary.thefreedictionary.com/Molecular+bonds", "passage_text": "covalent bond, a chemical bond that forms by the sharing of two electrons between atoms. A double bond is formed when four electrons are shared between two atoms; a triple bond is formed when six electrons are shared between two atoms. n chemical bond that involves sharing of electrons between atoms of the same element to give a molecule of that element (e.g., nitrogen) or atoms of two or more elements to give a molecule of a compound (e.g., carbon dioxide); the predominant type of bonding in organic chemistry."}, {"url": "http://www.diffen.com/difference/Covalent_Bonds_vs_Ionic_Bonds", "passage_text": "About Covalent and Ionic Bonds. The covalent bond is formed when two atoms are able to share electrons whereas the ionic bond is formed when the sharing is so unequal that an electron from atom A is completely lost to atom B, resulting in a pair of ions. Each atom consists of protons, neutrons and electrons."}, {"url": "http://www.ehow.com/facts_4909878_definition-molecular-bonds.html", "passage_text": "Access Excellence's Covalent and Ionic Bonds. A molecular, or covalent bond, is formed when atoms bond by sharing pairs of electrons. This sharing can occur from atom to atom, or from an atom to another molecular bond. In a coordinate covalent bond, a covalent, or molecular bond, is formed when only one of the two atoms is responsible for providing both"}, {"url": "https://en.wikipedia.org/wiki/Chemical_bond", "passage_text": "A chemical bond is an attraction between atoms that allows the formation of chemical substances that contain two or more atoms. The bond is caused by the electrostatic force of attraction between opposite charges, either between electrons and nuclei, or as the result of a dipole attraction. A double bond between two atoms is formed by the sharing of two pairs of electrons, one in a sigma bond and one in a pi bond, with electron density concentrated on two opposite sides of the internuclear axis."}, {"url": "http://medical-dictionary.thefreedictionary.com/Molecular+bond", "passage_text": "covalent bond, a chemical bond that forms by the sharing of two electrons between atoms. A double bond is formed when four electrons are shared between two atoms; a triple bond is formed when six electrons are shared between two atoms. n chemical bond that involves sharing of electrons between atoms of the same element to give a molecule of that element (e.g., nitrogen) or atoms of two or more elements to give a molecule of a compound (e.g., carbon dioxide); the predominant type of bonding in organic chemistry."}, {"url": "http://www.ehow.com/facts_4909878_definition-molecular-bonds.html", "passage_text": "Types. The are two types of molecular bonds: polar bonds and non-polar bonds. In polar bonds, the molecular bond is unevenly shared between atoms; in non-polar bonds, the electrons are evenly shared between the two atoms. In a coordinate covalent bond, a covalent, or molecular bond, is formed when only one of the two atoms is responsible for providing both electrons."}, {"url": "http://www.sparknotes.com/testprep/books/sat2/chemistry/chapter4section7.rhtml", "passage_text": "A chemical bond is the result of an attraction between atoms or ions. The types of bonds that a molecule contains will determine its physical properties, such as melting point, hardness, electrical and thermal conductivity, and solubility. (The obvious exception is in a bond between two atoms of the same element.) We say that covalent bonds are nonpolar if the electronegativity difference between the two atoms involved falls between 0 and 0.4. We say they are polar if the electronegativity difference falls between 0.4 and 1.67."}, {"url": "http://www.thefreedictionary.com/Molecular+bonds", "passage_text": "covalent bond. n. 1. (Chemistry) a type of chemical bond involving the sharing of electrons between atoms in a molecule, esp the sharing of a pair of electrons by two adjacent atoms."}]