[{"url": "http://www.medicinenet.com/echocardiogram/article.htm", "passage_text": "1 Echocardiography (echo) is a painless test that uses sound waves to create pictures of your heart. 2  This test gives your doctor information about the size and shape of your heart and how well your heart's chambers and valves are working."}, {"url": "http://www.webmd.com/heart-disease/guide/diagnosing-echocardiogram", "passage_text": "1 Stress echocardiogram: This is an echocardiogram that is performed while the person exercises on a treadmill or stationary bicycle. 2  This test can be used to visualize the motion of the heart's walls and pumping action when the heart is stressed."}, {"url": "http://www.heartrhythmspecialistsla.com/services-echocardiogram-los-angeles-ca.html", "passage_text": "1 Problems with your heart's valves. 2  Echo can show whether any of the valves of your heart don't open normally or don't form a complete seal when closed. 3  Problems with your heart's structure. 4  Echo can detect many structural problems, such as a hole in the septum and other congenital heart defects."}, {"url": "http://www.heart.org/HEARTORG/Conditions/HeartAttack/SymptomsDiagnosisofHeartAttack/Echocardiogram---Echo_UCM_451485_Article.jsp", "passage_text": "An echocardiogram (echo) is a test that uses high frequency sound waves (ultrasound) to make pictures of your heart. The test is also called echocardiography or diagnostic cardiac ultrasound. Quick facts."}, {"url": "https://www.healthtap.com/topics/can-an-echocardiogram-detect-heart-disease", "passage_text": "Heart structure/func: It is an excellent test for detecting structural problems and can also be used to assess ventricular function, or the ability of the heart to pump blood effectively. A stress echocardiogram can be used as a screen for coronary disease, but echo does not actually show coronary artery anatomy well."}, {"url": "http://www.nhlbi.nih.gov/health/health-topics/topics/echo/", "passage_text": "Echocardiography (EK-o-kar-de-OG-rah-fee), or echo, is a painless test that uses sound waves to create moving pictures of your heart. The pictures show the size and shape of your heart. They also show how well your heart's chambers and valves are working."}, {"url": "https://www.healthtap.com/topics/can-an-echocardiogram-detect-heart-disease", "passage_text": "Echo: Echocardiogram detects how well the heart is working by calculating an ejection fraction of how much blood it is pumping out. It can also detect valve abnormalities and if certain portions of the heart are functioning properly. I will not see blocked arteries. That is a coronary angiogram."}, {"url": "http://www.webmd.com/heart-disease/heart-failure/echocardiogram-test", "passage_text": "An echocardiogram (often called an echo) is a graphic outline of the heart 's movement. During this test, high-frequency sound waves, called ultrasound, provide pictures of the heart's valves and chambers. This allows the technician, called a sonographer, to evaluate the pumping action of the heart."}, {"url": "http://www.mayoclinic.org/tests-procedures/echocardiogram/basics/results/PRC-20013918", "passage_text": "1 Heart defects. 2  Many heart defects can be detected with an echocardiogram, including problems with the heart chambers, abnormal connections between the heart and major blood vessels, and complex heart defects that are present at birth. 3  Echocardiograms can even be used to monitor a baby's heart development before birth."}]