[{"url": "http://www.sheknows.com/baby-names/name/isabelle", "passage_text": "Hebrew Meaning: The name Isabelle is a Hebrew baby name. In Hebrew the meaning of the name Isabelle is: Devoted to God. American Meaning: The name Isabelle is an American baby name. In American the meaning of the name Isabelle is: Devoted to God. Spanish Meaning: The name Isabelle is a Spanish baby name. In Spanish the meaning of the name Isabelle is: Devoted to God. A Spanish. English Meaning: The name Isabelle is an English baby name. In English the meaning of the name Isabelle is: My God is bountiful;God of plenty"}, {"url": "http://www.names.org/n/isabelle/about", "passage_text": "The name Isabelle is of French origin, and it means God is my Oath . It's a name commonly given to girls. Isabelle was born in 1955 as Isabelle Yasmina Adjani in Paris, France. "}, {"url": "http://www.thinkbabynames.com/meaning/0/Isabel", "passage_text": "Isabel /is-abel/ [3 sylls.] as a girls' name is pronounced iz-a-bel. It is of Hebrew origin, and the meaning of Isabel is God is my oath. Spanish variant of Elizabeth. Literary: Henry James named the heroine of his  Portrait of a Lady Isabel Archer. Isabella is the name of several Spanish queens. Isabel is a very prominent first name for females (#313 out of 4276, Top 7%) and also a very prominent surname for both adults and children (#23454 out of 150436, Top 16%). (2000 U.S. Census). Displayed below is the birth name popularity of Isabel for girls."}, {"url": "http://www.ourbabynamer.com/meaning-of-Isabelle.html", "passage_text": "Isabelle is a form of the name Elizabeth. The name Elizabeth is derived from Elisabet (ελισαβε&tau), the Greek form of the Hebrew name Elisheva (אֱלִישֶׁבַע). The Hebrew name Elisheva, appears in the Old Testament where Elisheva is the wife of Aaron. What does Isabelle mean, popularity, numerology and more. The name Isabelle is of French origin. The meaning of Isabelle is my G-d is an oath, pledged to G-d."}, {"url": "http://www.babycenter.com/baby-names-isabella-4891.htm", "passage_text": "A variation of Isabel, itself a variation of Elizabeth, meaning devoted to God in Hebrew. England, France, Portugal, and Hungary all had royal Isabellas in their courts. Nicknames: Bella, Izzy, Izzie. Well-known Isabellas: actress Isabella Rossellini. "}, {"url": "http://www.sheknows.com/baby-names/name/isabella", "passage_text": "Hebrew Meaning: The name Isabella is a Hebrew baby name. In Hebrew the meaning of the name Isabella is: Devoted to God. American Meaning: The name Isabella is an American baby name. In American the meaning of the name Isabella is: Devoted to God. Italian Meaning: The name Isabella is an Italian baby name. In Italian the meaning of the name Isabella is: consecrated to God. Shakespearean Meaning: The name Isabella is a Shakespearean baby name."}, {"url": "https://en.wikipedia.org/wiki/Isabel", "passage_text": "Isabel (/ˈɪz.ə.bɛl/) is a Romance-language given name. It is related to Isabelle (French, Dutch, German, Catalan, Provencal), Provençal (Isabella), italian and The English. elizabeth "}, {"url": "http://www.thinkbabynames.com/meaning/0/Isabelle", "passage_text": "Isabelle /is-abel-le/ [3 sylls.] as a girls' name. Isabelle's name origin is Hebrew, and the meaning of the name Isabelle is God is my oath. Isabelle is an alternate spelling of Elizabeth (Hebrew). Isabelle is also a derivative of Isabel (Hebrew). Kreatif forms: Idabelle, Isabelio, Isabelleio. Below is a graphed comparison of the popularity of Isabelle and related names. Isabella (#4 last year) , Elizabeth (#14) , Isabel (#144) , Izabella (#200) , Isabela (#717) , Izabelle, Isabell, Belle and Isobel are the popular variation forms of Isabelle (#96 last year) ranked in the Top 1000."}]