[{"url": "http://beatingpancreatitis.com/i-have-pancreatitis-what-can-i-eat/", "passage_text": "Here is a view of that short list of foods usually safe to eat when you have pancreatitis (NOT when you are just coming out of an acute pancreatitis attack). 1  Egg whites (packed with protein – ZERO fat). 2  Legumes (beans, lentils, peas). 3  Vegetables (all kinds – leafy greens, tubers and cruciferous)."}, {"url": "http://healthyeating.sfgate.com/certain-foods-trigger-pancreatic-attacks-3137.html", "passage_text": "Because pancreatitis can increase your risk of breathing problems, diabetes, infections, kidney failure, malnutrition and pancreatic cancer, watching what you eat is essential. Eating certain foods can help prevent an attack and reduce symptoms, the University of Maryland Medical Center reports."}, {"url": "http://healthyeating.sfgate.com/certain-foods-trigger-pancreatic-attacks-3137.html", "passage_text": "A pancreas attack, or pancreatitis, occurs when the pancreas becomes inflamed and unable to work properly. Certain foods can cause pancreatitis to flare up; avoiding them can help you manage your symptoms."}, {"url": "http://beatingpancreatitis.com/acute-pancreatitis-what-happens-during-an-acute-pancreatitis-attack/", "passage_text": "What happens to your pancreas during an acute attack of pancreatitis is this: 1  Your pancreas becomes inflamed due to alcohol consumption, gall stone obstruction, high blood fats, abdominal trauma or a myriad of other reasons. 2  The inflammation activates your pancreatic enzymes. 3  The enzymes eat your pancreas."}, {"url": "http://www.wikihow.com/Avoid-Foods-That-Cause-Pancreatitis", "passage_text": "1. Avoid foods with high fat content. One of the causes of pancreatitis are high triglycerides (fats) in the blood. A diet high in fat is sure to bring on pancreatitis attacks so it is best to avoid meats, dairy and fried foods."}, {"url": "https://www.nlm.nih.gov/medlineplus/ency/patientinstructions/000201.htm", "passage_text": "You were in the hospital because you have pancreatitis. This is a swelling of the pancreas. You may have had blood tests and imaging exams, such as a CT scan or ultrasound. You may have been given medicines to help your pain or fight and prevent infections."}, {"url": "http://umm.edu/health/medical/altmed/condition/pancreatitis", "passage_text": "Pancreatitis may be either acute (sudden and severe) or chronic. Both types of pancreatitis can cause bleeding and tissue death in or around the pancreas. Mild attacks of acute pancreatitis can improve on their own, or with dietary changes."}, {"url": "http://healthyeating.sfgate.com/certain-foods-trigger-pancreatic-attacks-3137.html", "passage_text": "Foods made with refined grains can cause pancreatitis to flare up. White flour can increase your triglyceride levels, which can irritate your pancreas and cause an attack. Don't eat bread, breakfast cereal or pasta made with refined white flour. Pass on white rice as well."}, {"url": "http://beatingpancreatitis.com/acute-pancreatitis-what-happens-during-an-acute-pancreatitis-attack/", "passage_text": "Yep, you can have pain in the pancreas without an acute attack. That is one of the symptoms of chronic pancreatitis. I’m not saying you have CP. I’m just saying yes, pancreas pain can be present without what would be diagnosed as"}]