[{"url": "http://www.indiachildnames.com/name.aspx?name=Adarsh", "passage_text": "Name Adarsh generally means Ideal, is of Indian origin, Name Adarsh is a Masculine (or Boy) name. Person with name Adarsh are mainly Hindu by religion. Name Adarsh belongs to rashi Mesh (Aries) with dominant planet Mars (Mangal) and Nakshatra (stars) Krithika. Find qualities of Aries (Mesh) or Find Numerology, Lucky number, lucky days, lucky color, Auspicious stones for Adarsh or Find Chinese zodiac sign or Birthstone for your birthday or Find compatibility of Mesh (Aries) with other zodiac signs. Similar sounding names: Adarsha, Aadarsh. Show more information for this name"}, {"url": "http://www.babynamespedia.com/meaning/Aadarsh", "passage_text": "[ syll. aa-dar - (s)(h) , aad-a- rsh ] The baby boy name Aadarsh is pronounced as AA-D AA R-SH †. Aadarsh's origin is Sanskrit. The name Aadarsh means one who has principles. The names Aadersh, Adarsh, Addarsh, Addersh, and Adersh are variant forms of Aadarsh. Aadarsh is uncommon as a baby boy name. It is not in the top 1000 names. Baby names that sound like Aadarsh include Aadersh, Adarsh, Addarsh, Addersh, Adersh, Adrik, Atreus, Audre, Audrick, Audrik, Adarsa, Audrea, Audrius, Autrea, Ulderycco, Ulderycko, Ulderyco, Adiraja, Uldericco, and Uldericko."}, {"url": "http://www.kabalarians.com/Male/adarsh.htm", "passage_text": "(viewable to Premium Members only). Below is a brief analysis of the first name only. For an analysis of your full name and destiny, see our full free Name and Birth Date Report service for further details. Your name of Adarsh has made you good-natured, friendly, and kind. As diplomacy is one of your strong points, people like you at first meeting. Your quickness of mind and considerate manner put others at ease as you work to resolve contentious issues. You make friends easily. "}, {"url": "http://astrobix.com/name/meaning/Adarsh", "passage_text": "Meaning of the name Adarsh is 'Ideal'. Adarsh is a name of Hindu / Indian origin, and is commonly used for males. The name number for Adarsh is '6'. Click here to get the numerological analysis for the name 'Adarsh"}, {"url": "http://www.thenamemeaning.com/adarsh/", "passage_text": "Search comprehensively and find the name meaning of Adarsh and its name origin or of any other name in our database. Also note the spelling and the pronunciation of the name Adarsh and check the initials of the name with your last name to discover how it looks and sounds. If you consider naming your baby Adarsh we recommend you take note of the special meaning and history of the name as your baby’s name will play a big role in its life and your baby will hear it spoken every day."}, {"url": "http://www.thenamemeaning.com/adarsh/", "passage_text": "Adarsh Name Meaning. The meaning of Adarsh is “Ideal, perfection; mirror”. Keep in mind that many names may have different meanings in other countries and languages, so be careful that the name that you choose doesn’t mean something bad or unpleasant. If you consider naming your baby Adarsh we recommend you take note of the special meaning and history of the name as your baby’s name will play a big role in its life and your baby will hear it spoken every day."}, {"url": "http://www.meaning-of-names.com/indian-names/adarsh.asp", "passage_text": "Meaning of Adarsh. Indian name. In Indian, the name Adarsh means-ideal.The name Adarsh originated as an Indian name. The name Adarsh is most often used as a boy name or male name. Indian Name Meaning-ideal."}, {"url": "http://www.thenamemeaning.com/adarsh/", "passage_text": "Below you will find the popularity of the baby name Adarsh displayed annually, from 1880 to the present day in our name popularity chart. Hover over or click on the dots that represent a year to see how many babies were given the name for that year, for both genders, if available. If you consider naming your baby Adarsh we recommend you take note of the special meaning and history of the name as your baby’s name will play a big role in its life and your baby will hear it spoken every day."}]