[{"url": "http://www.medscape.com/viewarticle/478418", "passage_text": "Nurse practitioner and attorney who specializes in the legal issues affecting medical practices and nurse practitioners. She is the author of 5 books. Ms. Buppert counsels clients, and lectures extensively on reimbursement issues, how to avoid malpractice, and contract negotiation. She is also president of Better Life Health Care Systems, which contracts with businesses and educational institutions for nurse practitioner services. Her Web site is www.buppert.com. NPs should avoid prescribing legend (prescription) drugs for family members, unless the family member is enrolled at a practice where the NP regularly diagnoses and treats patients."}, {"url": "http://midlevelu.com/blog/writing-prescriptions-nurse-practitioner-faqs", "passage_text": "Some states allow NPs to prescribe these drugs with few guidelines. Other states require, for example, that nurse practitioners work under a collaborative agreement with a physician in order to prescribe controlled substances. Muscle relaxers for back pain, nausea medications for vomiting, and migraine meds for headaches. Prescribing is at the core of many nurse practitioner's practice. Unfortunately, the guidelines surrounding this privilege can be difficult to sort through and understand."}, {"url": "http://nurse-practitioners-and-physician-assistants.advanceweb.com/Article/The-Obstacle-Course-of-NP-Prescribing.aspx", "passage_text": "But do NPs, when properly counted, write enough prescriptions for pharmaceutical companies to take notice? According to the results of a 2004 American Academy of Nurse Practitioners member survey, almost 97% of NPs prescribe pharmacotherapy, and almost 65% are authorized to prescribe at least some controlled substances. Out-of-State Prescribing Whether over the phone or on the prescription pad, nurse practitioners in all states can order nonscheduled drugs for patients and rest assured that the local pharmacy will fill the prescription."}, {"url": "http://www.medscape.com/viewarticle/478418", "passage_text": "Thus, a practitioner may not self-prescribe or self-administer controlled substances...Accepted and prevailing standards of care require that a practitioner maintain detached professional judgment when utilizing controlled substances in the treatment of family members. Her Web site is www.buppert.com. NPs should avoid prescribing legend (prescription) drugs for family members, unless the family member is enrolled at a practice where the NP regularly diagnoses and treats patients."}, {"url": "http://blog.al.com/wire/2013/04/alabama_senate_passes_bill_to_4.html", "passage_text": "MONTGOMERY, Alabama --- The Alabama Senate has passed a bill that would allow certified registered nurse practitioners to prescribe some drugs they can't prescribe now, a move that the sponsor of the bill said would expand access to health care in some areas. "}, {"url": "http://www.npcentral.net/mc/pubs/q&a.doc", "passage_text": "A nurse practitioner (NP) is a registered nurse with advanced academic and clinical education and experience who are qualified to meet the majority of patients’ health care needs, such as managing most common and many chronic illnesses. NPs are uniquely focused on “caring” as opposed to “curing.” NPs combine nursing education and experience with through education in medical care for their specialty area. They take the “whole person” into account, not just the immediate ailment. NPs provide patient-centered care."}, {"url": "http://www.npcentral.net/mc/pubs/q&a.doc", "passage_text": "-more-. Nurse Practitioners/Page 2. States where NPs can prescribe (including controlled substances) with some degree of physician involvement: AR, CA, CO, CT, DE, FL, GA, HI, ID, IL, IN, KS, MA, MI, MN, NC, ND, NE, NJ, NY, OK, PA, RI, SC, SD, TN, VT, WV. NPs are uniquely focused on “caring” as opposed to “curing.” NPs combine nursing education and experience with through education in medical care for their specialty area. They take the “whole person” into account, not just the immediate ailment. NPs provide patient-centered care."}, {"url": "http://www.npcentral.net/mc/pubs/q&a.doc", "passage_text": "What are some of the advantages to nurse practitioner care? NPs are uniquely focused on “caring” as opposed to “curing.” NPs combine nursing education and experience with through education in medical care for their specialty area. They take the “whole person” into account, not just the immediate ailment. NPs provide patient-centered care."}, {"url": "http://midlevelu.com/blog/writing-prescriptions-nurse-practitioner-faqs", "passage_text": "In every state except Alabama and Florida, nurse practitioners are allowed to prescribe at least some controlled substances. Controlled medications are categorized into groups called 'schedules' based on their potential for abuse. Muscle relaxers for back pain, nausea medications for vomiting, and migraine meds for headaches. Prescribing is at the core of many nurse practitioner's practice. Unfortunately, the guidelines surrounding this privilege can be difficult to sort through and understand."}, {"url": "http://allnurses.com/nurse-practitioners-np/can-nps-prescribe-68427.html", "passage_text": "likewise, it is not a good idea to prescribe legend drugs for one's self. i found no state law expressly prohibiting prescribing legend drugs to oneself. an np, however, should never prescribe controlled substances for himself or herself or for family members, as it is expressly illegal in many states. furthermore, drug enforcement administration (dea) numbers are specific to a practice setting, so an np who prescribes a controlled substance for a family member who does not come to the practice setting may be violating 2 laws."}]