[{"url": "http://study.com/academy/lesson/wave-parameters-wavelength-amplitude-period-frequency-speed.html", "passage_text": "While period is measured in seconds per cycle, frequency is measured in cycles per second. Consider our wave with a period of 2 seconds. Since the wave completes one cycle every two seconds, then its frequency is one half or 0.5 Hz. So you see-period and frequency are reciprocals of each other. The symbol for frequency is the lowercase f and we measure it in cycles per second, which is the same as the unit hertz. A wave with a frequency of 20 Hz completes 20 wave cycles every second. Be careful that you don't confuse frequency with period."}, {"url": "http://www.physicsclassroom.com/class/waves/Lesson-2/Frequency-and-Period-of-a-Wave", "passage_text": "The period of a wave is the time for a particle on a medium to make one complete vibrational cycle. Period, being a time, is measured in units of time such as seconds, hours, days or years. The period of orbit for the Earth around the Sun is approximately 365 days; it takes 365 days for the Earth to complete a cycle. Answer: D. Frequency refers to the number of occurrences of a periodic event per time and is measured in cycles/second. In this case, there are 10 cycles per 2 minutes (also known as 10 cycles per 120 seconds)."}, {"url": "http://www.studyphysics.ca/newnotes/20/unit03_mechanicalwaves/chp141516_waves/lesson44.htm", "passage_text": "Lesson 44: Frequency, Wavelength, & Amplitude. The period means that it will take 4.5 seconds for the pendulum to swing back and forth once. So, I expect that my frequency will be a decimal, since it will complete a fraction of a swing per second. Be careful when changing the 700nm into metres. Amplitude is a measure of how big the wave is. 1  Imagine a wave in the ocean. 2  What you are actually seeing are waves with different amplitudes. 3  They might have the exact same frequency and wavelength, but the amplitudes of the waves can be very different."}, {"url": "http://www.studyphysics.ca/newnotes/20/unit03_mechanicalwaves/chp141516_waves/lesson44.htm", "passage_text": "Determine the frequency of this pendulum. The period means that it will take 4.5 seconds for the pendulum to swing back and forth once. So, I expect that my frequency will be a decimal, since it will complete a fraction of a swing per second. Be careful when changing the 700nm into metres. Amplitude is a measure of how big the wave is. 1  Imagine a wave in the ocean. 2  What you are actually seeing are waves with different amplitudes. 3  They might have the exact same frequency and wavelength, but the amplitudes of the waves can be very different."}, {"url": "http://hannahhelpphysics.blogspot.com/2013/03/33-define-amplitude-frequency.html", "passage_text": "Time taken for the source to produce one complete wave. As a wave vibrates to either side of the direction of travel, the amplitude is the distance between the line of the direction of travel and the furthest point the it vibrates away from the line: The number of waves per second, it is measured in Hertz (Hz). You can think of it as how quickly the waves are travelling. The distance between one point on a wave and the same point on the next wave; usually the point from the top/bottom of one wave (peak/trough) to the top/bottom of the next. "}, {"url": "http://www.physicsclassroom.com/class/waves/Lesson-2/Frequency-and-Period-of-a-Wave", "passage_text": "So the frequency is f =10 cycles / 120 s = 0.0833 cycles/s. Answer: D. Frequency refers to the number of occurrences of a periodic event per time and is measured in cycles/second. In this case, there are 10 cycles per 2 minutes (also known as 10 cycles per 120 seconds)."}, {"url": "http://www.physicsclassroom.com/class/waves/Lesson-2/Frequency-and-Period-of-a-Wave", "passage_text": "The frequency of swing is _________. a. 0.5 Hz b. 1 Hz c. 2 Hz See Answer Answer: A Frequency refers to the number of occurrences of a periodic event per time and is measured in cycles/second. In this case, there is 1 cycle per 2 seconds. Answer: D. Frequency refers to the number of occurrences of a periodic event per time and is measured in cycles/second. In this case, there are 10 cycles per 2 minutes (also known as 10 cycles per 120 seconds)."}, {"url": "http://study.com/academy/lesson/wave-parameters-wavelength-amplitude-period-frequency-speed.html", "passage_text": "Waves are described and measured by five wave parameters: the period, the frequency, the amplitude, the wavelength, and the speed. The period of a wave is the time it takes to complete one cycle. The frequency is just the opposite; it's the number of wave cycles that are completed in one second. The symbol for frequency is the lowercase f and we measure it in cycles per second, which is the same as the unit hertz. A wave with a frequency of 20 Hz completes 20 wave cycles every second. Be careful that you don't confuse frequency with period."}, {"url": "http://www.physicsclassroom.com/calcpad/waves", "passage_text": "Wave Basics: Problem Set Overview. This set of 29 problems targets your ability to determine wave quantities such as frequency, period, wavelength, amplitude and speed from verbal descriptions and diagrams of physical situations pertaining to waves. "}, {"url": "http://www.physicsclassroom.com/class/waves/Lesson-2/Frequency-and-Period-of-a-Wave", "passage_text": "Frequency is the reciprocal of the period. The period is 5 seconds, so the frequency is 1/(5 s) = 0.20 Hz. 8. A common physics lab involves the study of the oscillations of a pendulum. If a pendulum makes 33 complete back-and-forth cycles of vibration in 11 seconds, then its period is ______. Answer: D. Frequency refers to the number of occurrences of a periodic event per time and is measured in cycles/second. In this case, there are 10 cycles per 2 minutes (also known as 10 cycles per 120 seconds)."}]