[{"url": "http://myfwc.com/research/saltwater/tarpon/information/facts/", "passage_text": "1 In their larval stage, tarpon are transparent, have a ribbonlike body and prominent fanglike teeth, and are less than an inch long. 2  Tarpon can only be fished recreationally in Florida. 3  The majority of recreational anglers practice catch and release since the fish is not considered to be of any food value."}, {"url": "http://www.saltwatersportsman.com/species/tarpon-fishing/all-about-tarpon", "passage_text": "It’s true that tarpon don’t have teeth, but they do have very coarse jaws that will wear through fishing line within seconds. Leaders are, therefore, a must. Tarpon also have great eyesight, so it’s a good idea to stick to fluorocarbon during daylight hours. At night, regular monofilament will do fine. For sight-casting at adult fish with either spinning or fly, 50- to 60-pound fluoro is ideal."}, {"url": "http://myfwc.com/research/saltwater/tarpon/information/facts/", "passage_text": "1 Fossil research shows that tarpon have been swimming in our oceans since prehistoric times. 2  Tarpon can reach sizes up to 8 feet and can weigh up to 280 pounds. 3  The life span of a tarpon can be in excess of 50 years. 4  The oldest tarpon in captivity lived to be 63 years old."}, {"url": "http://myfwc.com/research/saltwater/tarpon/information/facts/", "passage_text": "1 Tarpon have a special ability to gulp air at the surface when they are in a habitat that doesn't provide enough oxygen. 2  In their larval stage, tarpon are transparent, have a ribbonlike body and prominent fanglike teeth, and are less than an inch long. 3  Tarpon can only be fished recreationally in Florida."}, {"url": "https://answers.yahoo.com/question/index?qid=20090202055428AADhK1x", "passage_text": "Report Abuse. Here is a link to absolutely everything you ever needed to know about Tarpon. Scroll down to the 'Biology' section, in there is a subsection called 'food habits', and there is your answer. Basically, yes they do have teeth, but they are called minute. Source(s): http://www.flmnh.ufl.edu/fish/gallery/De..."}, {"url": "http://www.justsportfishing.com/tarpon.html", "passage_text": "The tarpon has a superior mouth with the lower jaw extending far beyond the gape. The fins contain no spines, but are all composed of soft rays. The tail fin is deeply forked, and the lobes appear equal in length. Size ~ Angler caught Tarpon are in the 40 to 100 pound range with fish over 150 pounds being rare."}, {"url": "http://myfwc.com/research/saltwater/tarpon/information/facts/", "passage_text": "This article is a list of interesting facts about tarpon. 1  Fossil research shows that tarpon have been swimming in our oceans since prehistoric times. 2  Tarpon can reach sizes up to 8 feet and can weigh up to 280 pounds. 3  The life span of a tarpon can be in excess of 50 years."}]