[{"url": "http://www.thefreedictionary.com/instruction", "passage_text": "instruction. n. 1. a direction; order. 2. the process or act of imparting knowledge; teaching; education. 3. (Computer Science) computing a part of a program consisting of a coded command to the computer to perform a specified function. in·struc·tion. n. 1. The act, practice, or profession of instructing: math instruction. 2."}, {"url": "http://www.answers.com/Q/What_is_the_main_purpose_of_8086_instruction_queue", "passage_text": "The 8086/8088 instruction queue is a buffer that holds opcode bytes that have been prefetched by the bus interface unit. This speeds up operations of the processor by helping to reduce fetch latency, i.e. to improve the probability that an opcode byte fetched by the processor is already available. The main point here is that, fetching of the next instruction is overlapped with the execution of current instruction. This is called pipe lining pipe lining saves time required for executing instructions."}, {"url": "http://www.answers.com/Q/What_is_the_main_purpose_of_technical_directions", "passage_text": "The purpose of technical writing is to inform the reader of  something. A technical writer needs to be able to write  instructions, concepts, principles, and details in a cl … ear, concise  way. 1 person found this useful. Answers Publisher. "}, {"url": "https://en.wikipedia.org/wiki/Central_processing_unit", "passage_text": "A central processing unit (CPU) is the electronic circuitry within a computer that carries out the instructions of a computer program by performing the basic arithmetic, logical, control and input/output (I/O) operations specified by the instructions. The description of the basic operation of a CPU offered in the previous section describes the simplest form that a CPU can take. This type of CPU, usually referred to as subscalar, operates on and executes one instruction on one or two pieces of data at a time."}, {"url": "http://www.explainers.com/Articles/Four-Essentials-Effective-Work-Instructions.htm", "passage_text": "Overview: Returning the Focus to the Worker. A work instruction is a tool provided to help someone to do a job correctly. This simple statement implies that the purpose of the work instruction is quality and that the target user is the worker. Unfortunately, in many workplaces, today’s work instructions have little connection with this fundamental focus."}, {"url": "http://www.rtinetwork.org/learn/what/whatisrti", "passage_text": "Response to Intervention (RTI) is a multi-tier approach to the early identification and support of students with learning and behavior needs. The RTI process begins with high-quality instruction and universal screening of all children in the general education classroom. "}, {"url": "http://www.indiana.edu/~idtheory/methods/m1a.html", "passage_text": "The purpose of instruction is to help people learn. The goal of instructional designers is to make learning easier, quicker, and more enjoyable. Some people view training as a process of finding out who the brightest employees are. But performance in a course is not very highly correlated with the basic ability to be good on the job."}, {"url": "http://successfulenglish.com/2010/02/purpose-of-language-instruction/", "passage_text": "The purpose of language education, according to the paper, should be to help students become autonomous – independent, self-directed – language acquirers. If you have read ABOUT Successful English, you will already know that this is the purpose of Successful English. "}, {"url": "http://www.cs.umd.edu/class/sum2003/cmsc311/Notes/Overall/steps.html", "passage_text": "The main purpose of a CPU is to execute instructions. We've already seen some simple examples of instructions, i.e., add and addi. The CPU executes the binary representation of the instructions, i.e., machine code. Since programs can be very large, and since CPUs have limited memory, programs are stored in memory (RAM). To fetch an instruction involves the following steps: 1  CPU must place an address to the MAR. 2  CPU must activate the tri-state buffer so MAR contents are placed on the address bus. 3  CPU sends R/\\W = 1 and CE = 1 to memory, to indicate it wants to do a read. 4  Memory eventually puts instruction on the data bus."}, {"url": "http://www.thefreedictionary.com/instruction", "passage_text": "1 disciple, discipline-Disciple comes from a Latin word meaning learner and discipline comes from one meaning instruction, knowledge.. 2  document-First meant instruction or evidence, whether written or not. 3  lore-Originally meant the act of teaching or a piece of instruction, lesson.. in·struc·tion. n. 1. The act, practice, or profession of instructing: math instruction. 2."}]