[{"url": "http://www.healthline.com/health-slideshow/types-rheumatoid-arthritis", "passage_text": "Rheumatoid arthritis (RA) is an autoimmune disease that causes inflammation of the joints. Because many symptoms of RA are similar to those of a variety of other diseases, diagnosis can be difficult. A correct diagnosis requires clinical evaluation, X-rays, and a series of laboratory tests. "}, {"url": "http://www.joybauer.com/arthritis/different-types-of-arthritis/", "passage_text": "Osteoarthritis (OA) is one of the most common types of arthritis that occurs when cartilage in the joints begins to break down. Without that cushion, the bones rub against one another, causing symptoms like stiffness, joint pain, and loss of movement, especially in the knees, hips, and lower back. Symptoms of psoriatic arthritis may be milder than other types of arthritis, affecting only a few joints, particularly those at the ends of the fingers and toes. But in some people, the arthritis may be more severe and cause stiffness, burning, and pain in the lower spine and sacrum."}, {"url": "http://www.webmd.com/rheumatoid-arthritis/guide/most-common-arthritis-types", "passage_text": "Joints that bear weight -- such as your knees, hips, feet, and spine-are the most common places it affects. It often comes on gradually over months or years. It causes the pain in the affected joint. But people who have it don’t feel sick or have the fatigue that comes with some other types of arthritis. What happens: Your cartilage gradually breaks down. Cartilage is a slippery material that covers the ends of bones. It’s your body’s shock absorber."}, {"url": "https://en.wikipedia.org/wiki/Arthritis", "passage_text": "There are over 100 different forms of arthritis. The most common form of arthritis is osteoarthritis (degenerative joint disease), a result of trauma to the joint, infection of the joint, or age. Other arthritis forms are rheumatoid arthritis, psoriatic arthritis, and related autoimmune diseases. Pain, which can vary in severity, is a common symptom in virtually all types of arthritis. Other symptoms include swelling, joint stiffness and aching around the joint(s). Arthritic disorders like lupus and rheumatoid arthritis can affect other organs in the body, leading to a variety of symptoms. Symptoms may include:"}, {"url": "http://www.niams.nih.gov/Health_Info/Bone/Osteoporosis/Conditions_Behaviors/osteoporosis_arthritis.asp", "passage_text": "Arthritis. Arthritis is a general term for conditions that affect the joints and surrounding tissues. Joints are places in the body where bones come together, such as the knees, wrists, fingers, toes, and hips. The two most common types of arthritis are osteoarthritis and rheumatoid arthritis. 1  Osteoarthritis (OA) is a painful, degenerative joint disease that often involves the hips, knees, neck, lower back, or small joints of the hands. "}, {"url": "http://www.webmd.com/rheumatoid-arthritis/guide/most-common-arthritis-types?page=2", "passage_text": "They are often more severe than in osteoarthritis. You may feel pain and stiffness and have swelling in your hands, wrists, elbows, shoulders, knees, ankles, feet, jaw, and neck. Sometimes the pain happens in one body part. But more commonly, rheumatoid arthritis pain affects several joints. "}, {"url": "http://www.healthline.com/health-slideshow/arthritis-types", "passage_text": "Arthritis is not just a disease of the elderly. According to the Arthritis Foundation, arthritis affects 50 million Americans—two thirds of whom are under 65. Over 100 different kinds of arthritis cause joint pain that can be debilitating. Gout is a form of arthritis caused by the accumulation of urate crystals inside joints. High levels of uric acid in your blood can put you at risk for gout. According to the Centers for Disease Control and Prevention (CDC) , an estimated 64 people in 1000 have gout, and the ratio of men to women is more than 3 to 1."}, {"url": "http://www.disabled-world.com/health/autoimmunediseases/arthritis/arthritis-types.php", "passage_text": "Arthritis is defined as a form of joint disorder that involves inflammation of one or more joints. There are over 100 different forms of arthritis. The most common form of arthritis is osteoarthritis (degenerative joint disease), a result of trauma to the joint, infection of the joint, or age. Many people confuse osteoporosis and different types of arthritis. Arthritis-A general term for conditions that affect the joints and surrounding tissues. Joints are places in the body where bones come together, such as the knees, wrists, fingers, toes, and hips. The two most common types of arthritis are osteoarthritis and rheumatoid arthritis. Osteoporosis-A condition in which the bones become less dense and more likely to fractur"}]