[{"url": "http://www.northgate-is.com/", "passage_text": "It is The Northgate Advantage – the critical combination of Deep Market Experience and insight, Advanced Technology Platforms and applications, and unparalleled, Flexible Service Delivery that sets us apart from our competitors."}, {"url": "http://www.continuitysa.com/services/", "passage_text": "The Leader in Business Continuity Management. For the past 21 years, ContinuitySA has led the business continuity industry in South Africa and Africa as a whole. Our focus remains on ensuring that our clients’ businesses can continue to operate effectively through any crisis or disruption."}, {"url": "http://businesscontinuitycenterofseattle.com/", "passage_text": "Business Continuity Center of Seattle (BCCS), a division of Allied Business Systems, Inc., is a Northwest business continuity assurance facility. We provide the technology, facilities, equipment and know how to ensure our subscriber companies' Information Technology survival, should the unthinkable happen."}, {"url": "http://www.continuitysa.com/services/", "passage_text": "For the past 21 years, ContinuitySA has led the business continuity industry in South Africa and Africa as a whole. Our focus remains on ensuring that our clients’ businesses can continue to operate effectively through any crisis or disruption."}, {"url": "http://www.northgate-is.com/", "passage_text": "Northgate provides technology solutions and services for human resources management through our NGA Human Resources business. Northgate is proud to work with some of the world's most well-known organisations, enjoying both extensive local and global experience."}, {"url": "http://www.northgate-is.com/", "passage_text": "The Northgate Advantage. Across both of our business divisions, we provide our clients with The Northgate Advantage – the critical combination of Deep Market Experience and insight, Advanced Technology Platforms and applications, and unparalleled, Flexible Service Delivery."}, {"url": "http://bc.ehps.ncsu.edu/", "passage_text": "Plan development for Academic Continuity, Research Continuity, Business Continuity, Information Technology and Disaster Recovery, Service Center Continuity, and Student Services Continuity. Read more about plan development..."}]