[{"url": "http://www.behindthename.com/name/silver", "passage_text": "From the English word for the precious metal or the colour, ultimately derived from Old English seolfor. "}, {"url": "http://www.surnamedb.com/Surname/Silver", "passage_text": "Recorded in many forms including Silber, Silbermann, Silver, Silvers, Silverman, Silvermann, Zylberman, Zylberdik, and Silversmid, this surname is mainly English, Scottish, German, and Hebrew. Early examples of the surname recordings include: Radolfus Silberer of Oberschwaben, Germany, in 1249, whilst Thomas atte Selure, and Thomas del Silvere were both recorded in the Subsidy Rolls of the county of Worcestershire in 1327 and 1332 respectively."}, {"url": "http://www.ancestry.com/name-origin?surname=silver", "passage_text": "You can find out where the majority of the Silver families were living before they immigrated to the U.S and learn where to focus your search for foreign records. Immigration records can tell you an ancestor's name, ship name, port of departure, port of arrival, and destination. from the New York Passenger Lists. You can see how Silver families moved over time by selecting different Census years. Census records can tell you little-known facts about your ancestors such as birthplace, occupation and value of personal estate. 1  England (39). 2  Ireland (35)."}, {"url": "http://www.surnamedb.com/Surname/Silver", "passage_text": "The first recorded spelling of the family name is shown to be that of Lucas Siluer, which was dated 1205, in the Book of Seals for Lincolnshire, during the reign of King John, of England, 1199 - 1216. Early examples of the surname recordings include: Radolfus Silberer of Oberschwaben, Germany, in 1249, whilst Thomas atte Selure, and Thomas del Silvere were both recorded in the Subsidy Rolls of the county of Worcestershire in 1327 and 1332 respectively."}, {"url": "http://www.answers.com/Q/Origin_name_of_silver", "passage_text": "Name Origin: From the Old English word seolfor (silver) Symbol Origin: From the Latin word argentum (silver) Date of Discovery: Known to the ancients. 1 person found this useful. exists and is an alternate of. Merge this question into. Split and merge into it. Answer by Ttreloar. Confidence votes 211. The word silver comes from the Anglo-Saxon words seolfar and siolfur. It is closely related to the Old High German word silbar."}, {"url": "http://www.surnamedb.com/Surname/Silver", "passage_text": "Tradition holds that the surname Silver inscribed on a tomb in the Calton cemetery, Edinburgh, suggested to Robert Louis Stevenson the name of Long John Silver in the famous book Treasure Island. Early examples of the surname recordings include: Radolfus Silberer of Oberschwaben, Germany, in 1249, whilst Thomas atte Selure, and Thomas del Silvere were both recorded in the Subsidy Rolls of the county of Worcestershire in 1327 and 1332 respectively."}, {"url": "http://www.sheknows.com/baby-names/name/silver", "passage_text": "The name Silver is an Anglo-Saxon baby name. In Anglo-Saxon the meaning of the name Silver is: White. SoulUrge Number: 5. Expression Number: 4. People with this name have a deep inner desire for travel and adventure, and want to set their own pace in life without being governed by tradition. People with this name tend to be orderly and dedicated to building their lives on a solid foundation of order and service."}, {"url": "http://www.babynamewizard.com/baby-name/girl/silver", "passage_text": "Personal experiences with the name Silver: | Edit. Share what you know! Nicknames for Silver: | Edit. Share what you know! Meanings and history of the name Silver: | Edit. A word meaning shiny gray-white metal or the color resembling the metal silver. "}]