[{"url": "http://hyperphysics.phy-astr.gsu.edu/hbase/organic/nucleotide.html", "passage_text": "Nucleotides are the basic structural units of nucleic acids, which control the production of proteins in living organisms. The nucleotides are made up of a phosphate group, a pentose sugar, and a nitrogen base. This shows the basic structure of a nucleotide. This example has the sugar ribose, and is characteristic of RNA."}, {"url": "https://en.wikipedia.org/wiki/Nucleotide", "passage_text": "A nucleotide is made of a nucleobase (also termed a nitrogenous base), a five-carbon sugar (either ribose or 2-deoxyribose) depending on if it is DNA or RNA, and one or, depending on the definition, more than one phosphate groups. Cyclic nucleotides form when the phosphate group is bound to two of the sugar's hydroxyl groups. Nucleotides contain either a purine or a pyrimidine base. Ribonucleotides are nucleotides in which the sugar is ribose. Deoxyribonucleotides are nucleotides in which the sugar is deoxyribose. Nucleic acids are polymeric macromolecules made from nucleotide monomer"}, {"url": "http://www.biologyreference.com/Mo-Nu/Nucleotides.html", "passage_text": "The phosphate group is bonded to the 5 carbon of the sugar (see Figure 2), and when nucleotides are joined to form RNA or DNA, the phosphate of one nucleotide is joined to the sugar of the next nucleotide at its 3 carbon, to form the sugar-phosphate backbone of the nucleic acid. Photo by: Cybrain. Nucleotides are the subunits that are linked to form the nucleic acids ribonucleic acid (RNA) and deoxyribonucleic acid (DNA), which serve as the cell's storehouse of genetic information."}, {"url": "http://www.biologyreference.com/Mo-Nu/Nucleotides.html", "passage_text": "All nucleotides are composed of three parts: a five-carbon sugar, a phosphate, and a nitrogen-rich structure called a nitrogenous base. The sugar can be ribose, which is found in ribonucleotides and RNA, or deoxyribose, which is found in deoxyribonucleotides and DNA. Photo by: Cybrain. Nucleotides are the subunits that are linked to form the nucleic acids ribonucleic acid (RNA) and deoxyribonucleic acid (DNA), which serve as the cell's storehouse of genetic information."}, {"url": "http://www.phschool.com/science/biology_place/biocoach/dnarep/structure.html", "passage_text": "The basic building block of DNA is the nucleotide. The nucleotide in DNA consists of a sugar (deoxyribose), one of four bases (cytosine (C), thymine (T), adenine (A), guanine (G)), and a phosphate. Cytosine and thymine are pyrimidine bases, while adenine and guanine are purine bases. The sugar and the base together are called a nucleos"}, {"url": "https://en.wikipedia.org/wiki/Nucleotide", "passage_text": "This nucleotide contains the five-carbon sugar deoxyribose, a nitrogenous base called adenine, and one phosphate group. Together, the deoxyribose and adenine make up a nucleoside (specifically, a deoxyribonucleoside) called deoxyadenosine. Cyclic nucleotides form when the phosphate group is bound to two of the sugar's hydroxyl groups. Nucleotides contain either a purine or a pyrimidine base. Ribonucleotides are nucleotides in which the sugar is ribose. Deoxyribonucleotides are nucleotides in which the sugar is deoxyribose. Nucleic acids are polymeric macromolecules made from nucleotide monomers"}, {"url": "https://en.wikipedia.org/wiki/Nucleotide", "passage_text": "Nucleotides are organic molecules that serve as the monomers, or subunits, of nucleic acids like DNA and RNA. The building blocks of nucleic acids, nucleotides are composed of a nitrogenous base, a five-carbon sugar (ribose or deoxyribose), and at least one phosphate group. Cyclic nucleotides form when the phosphate group is bound to two of the sugar's hydroxyl groups. Nucleotides contain either a purine or a pyrimidine base. Ribonucleotides are nucleotides in which the sugar is ribose. Deoxyribonucleotides are nucleotides in which the sugar is deoxyribose. Nucleic acids are polymeric macromolecules made from nucleotide monomers"}, {"url": "http://www.answers.com/Q/What_are_nucleotides", "passage_text": "If a nucleoside is different from a nucleotide I haven't been able to find it. Nucleic acids are made up of nucleotides. Each nucleotide is composed of a sugar + a phosphate + a nitrogen base. The nitrogenous bases are Adenine which pairs with Thymine and Cytosine which pairs with Guanine. "}]