[{"url": "http://www.wikihow.com/Treat-Broken-Ribs", "passage_text": "1 Do not attempt to bandage or wrap your broken ribs at home. 2  If warranted and recommended short-term, allow a trained health professional to do it, such as a physician, chiropractor, physiotherapist or nurse. 3  The ribs in the middle of the chest are the ones that fracture most often. A compression wrap may be needed short-term (a few days) for stabilization and pain / inflammation control, but the restricted breathing caused by the wrapping is not good for your condition if done long-term (a few weeks or more). 1  Do not attempt to bandage or wrap your broken ribs at home."}, {"url": "https://uk.answers.yahoo.com/question/index?qid=20080410050428AA7KTaP", "passage_text": "Best Answer: If you were not having any difficulty in breathing, they normally do not x-ray for broken ribs. If you would have had difficulty, the x-ray would be used to see if the fractured rib, punchered a lung..... As for how long will it take..... the pain should start subsiding after the 1st week..... provided you do not over stretch, hit it against anything, etc"}, {"url": "http://www.wikihow.com/Treat-Broken-Ribs", "passage_text": "Although broken ribs will eventually heal on their own in 1-2 months if you are relatively healthy, knowing how to treat them at home will significantly reduce your discomfort. In rare cases, fractured ribs puncture the lungs or damage other internal organs, which necessitates emergency medical treatment. Ad. A compression wrap may be needed short-term (a few days) for stabilization and pain / inflammation control, but the restricted breathing caused by the wrapping is not good for your condition if done long-term (a few weeks or more). 1  Do not attempt to bandage or wrap your broken ribs at home."}, {"url": "https://www.healthtap.com/topics/fractured-ribs-how-long-to-heal", "passage_text": "Posterior fractures of my 2 3 and 4th ribs. 10. Get help from a doctor now ›. Rib fractures: Time. It takes about 6 weeks for fractures to heal. Adequate pain control while still painful is important to adequately take deep breaths. Then majority of the pain should subside in 2-3 weeks. "}, {"url": "https://uk.answers.yahoo.com/question/index?qid=20080410050428AA7KTaP", "passage_text": "Report Abuse. I'm surprised that you were not given x-rays of your ribs to make sure (if broken) they are not puncturing anything else. Broken and/or cracked ribs take about 6 weeks to heal, just as any other bone that may be broken. Decoy Duck · 8 years ago. If you would have had difficulty, the x-ray would be used to see if the fractured rib, punchered a lung..... As for how long will it take..... the pain should start subsiding after the 1st week....."}, {"url": "http://www.swedish.org/blog/2012/08/rib-fractures-essentials-of-management-and-treatment-options", "passage_text": "Thank you for your response to our blog. When you have a fractured rib or ribs you can experience pain and disability for the upwards of 6 weeks, depending on how severely the fracture is displaced. It can be helpful to see your doctor for pain management during this time. If your ribs are more severely injured or displaced you may need to see a specialist. Pain is the most common symptom that people experience with rib fractures. It will often take the upwards of 6 weeks, sometimes 6 months for the fractures to heal and for patients to become entirely pain free."}, {"url": "http://www.ehow.com/how-does_4685302_broken-rib-heal.html", "passage_text": "Eventually, the bone will regain all of its original strength and will be completely healed. If the fracture is not severe, the healing time will take 3 to 6 weeks, provided that you rest. There is no magic way of getting a bone to heal, because the body will heal it on its own in due time. In the meantime, take it easy and get some rest. After a couple of weeks, you should begin to feel better. "}, {"url": "http://www.webmd.com/a-to-z-guides/fractured-rib-topic-overview?page=2", "passage_text": "Home treatment will help you manage the pain while you heal. Pain relief can help you feel better and let you take deeper breaths. A fractured rib usually takes at least 6 weeks to heal. To help manage the pain while the fracture heals: 1  Put ice on the injured area. 2  Get extra rest. 3  Take pain medicine such as aspirin or ibuprofen. 4  Your doctor may prescribe a stronger pain medicine if over-the-counter medicines don't work. "}]