[{"url": "http://www.oxforddictionaries.com/definition/english/lac", "passage_text": "1 These strains might not even use their lac gene products to metabolize lactose. 2  In addition to the lac operon, a number of other synthetic and natural genetic circuits have been analyzed for robustness and evolvability. adjective. Denoting the ability of normal strains of the bacterium E. coli to metabolize lactose, or the genetic factors involved in this ability (which is lost in some mutant strains): the lac operon. More example sentences. 1 "}, {"url": "https://en.wikipedia.org/wiki/Lac_operon", "passage_text": "lac operon (lactose operon) is an operon required for the transport and metabolism of lactose in Escherichia coli and many other enteric bacteria. Although glucose is the preferred carbon source for most bacteria, the lac operon allows for the effective digestion of lactose when glucose is not available. In summary: 1  When lactose is absent then there is very little Lac enzyme production (the operator has Lac repressor bound to it). 2  When lactose is present but a preferred carbon source (like glucose) is also present then a small amount of enzyme is produced (Lac repressor is not bound to the operator)."}, {"url": "http://www.thefreedictionary.com/lac", "passage_text": "lac 1. n. A resinous secretion of lac insects, used in making shellac. 1. (Elements & Compounds) a resinous substance secreted by certain lac insects, used in the manufacture of shellac. [C16: from Dutch lak or French laque, from Hindi lākh resin, ultimately from Sanskrit lākshā ]. (laek). læk"}, {"url": "http://www.thefreedictionary.com/lac", "passage_text": "Noun. 1. lac-resinlike substance secreted by certain lac insects; used in e.g. varnishes and sealing wax. seal, sealing wax-fastener consisting of a resinous composition that is plastic when warm; used for sealing documents and parcels and letters. 1. (Elements & Compounds) a resinous substance secreted by certain lac insects, used in the manufacture of shellac. [C16: from Dutch lak or French laque, from Hindi lākh resin, ultimately from Sanskrit lākshā ]. (laek). læk"}, {"url": "http://www.definitions.net/definition/LAC", "passage_text": "Lac. Lac is the scarlet resinous secretion of a number of species of insects, namely some of the species of the genera Metatachardia, Laccifer, Tachordiella, Austrotacharidia, Afrotachardina, and Tachardina of the superfamily Coccoidea, of which the most commonly cultivated species is Kerria lacca."}, {"url": "https://en.wikipedia.org/wiki/Lac_operon", "passage_text": "In this case, when lactose is required as a sugar source for the bacterium, the three genes of the lac operon can be expressed and their subsequent proteins translated: lacZ, lacY, and lacA. The gene product of lacZ is β-galactosidase which cleaves lactose, a disaccharide, into glucose and galactose. In summary: 1  When lactose is absent then there is very little Lac enzyme production (the operator has Lac repressor bound to it). 2  When lactose is present but a preferred carbon source (like glucose) is also present then a small amount of enzyme is produced (Lac repressor is not bound to the operator)."}, {"url": "http://www.merriam-webster.com/dictionary/lac", "passage_text": "Definition of LAC. : a resinous substance secreted by a scale insect (Laccifer lacca) and used chiefly in the form of shellac. See lac defined for kids. ADVERTISEMENT"}, {"url": "https://en.wikipedia.org/wiki/Lac", "passage_text": "Lac is the scarlet resinous secretion of a number of species of lac insects, of which the most commonly cultivated species is Kerria lacca. Cultivation begins when a farmer gets a stick (broodlac) that contains eggs ready to hatch and ties it to the tree to be infested. Lac for dye has been somewhat replaced by the emergence of synthetic dyes, though it remains in use, and some juices, carbonated drinks, wine, jam, sauce, and candy are colored using it. Lac is used in folk medicine as a hepatoprotective and anti-obesity drug. It is used in violin and other varnish and is soluble in alcohol. This type of lac was used in the finishing of 18th-century fowling guns in the United States. the lac is highly inflammable as mentioned in the ancient Indian epic Mahabharata"}]