[{"url": "http://www.ehow.com/info_8322039_much-university-make-per-year.html", "passage_text": "The average salary of doctoral professors in the United States was $138,472 per year as of 2014, according the AAUP survey. Those in public universities earned the least, with an average salary of $126,981. These teachers made a median wage of $68,970 annually in that same year. But not all of these teachers are university professors. Professors teaching at universities generally have even higher wages."}, {"url": "http://www.ehow.com/info_8322039_much-university-make-per-year.html", "passage_text": "The AAUP found that university professors with just a bachelor's degree earned $94,145 per year on average in 2014. For those working at public universities, the salary was $87,262 on average. Private and religiously affiliated universities paid $106,641 and $80,810 respectively. These teachers made a median wage of $68,970 annually in that same year. But not all of these teachers are university professors. Professors teaching at universities generally have even higher wages."}, {"url": "http://work.chron.com/much-professors-earn-8913.html", "passage_text": "Rank. Wages for professor varied by rank. The lowest-paid had no rank and earned a mean $65,574 per year for the 2010-11 school year, according to the American Association of University Professors. Lecturers earned an average annual $53,556 and instructors received an average $47,143 yearly. The highest-paid professors by subject as of May 2011, were law teachers, who earned an average $108,760 per year, according to the Bureau of Labor Statistics. The agency did not calculate hourly wages because professors did not work a standard 40-hour week throughout the year."}, {"url": "http://www.npr.org/2014/02/03/268427156/part-time-professors-demand-higher-pay-will-colleges-listen", "passage_text": "A full-time professor's salary can average from $72,000 a year up to $160,000; adjuncts average $25,000 to $27,000 a year, and often much less, regardless of where they teach. 'We Have To Stop Hiding In The Shadows'. "}, {"url": "http://www.insidejobs.com/articles/how-much-does-a-college-professor-make", "passage_text": "The lowest-paid 10 percent of all University Professors earn less than $28,870, while the highest-paid 10 percent are paid more than $121,850 per year. The middle 50 percent of all University Professors earn between $41,600 and $83,960, so chances are good that you’ll earn more than the average annual salary. The American Association of University Professors reports that the salary of full-time faculty at private colleges and universities average $92,257, as compared to $77,009 for those teaching at public colleges and universities."}, {"url": "http://www.ehow.com/info_8322039_much-university-make-per-year.html", "passage_text": "Before reaching the rank of professor you may have to settle for a lower wage. According to the AAUP, the average associate professor earned $81,980 per year in 2014. Assistant professors earned even less at $69,848 annually. Instructors made $49,963 per year and lecturers made $55,890. These teachers made a median wage of $68,970 annually in that same year. But not all of these teachers are university professors. Professors teaching at universities generally have even higher wages."}, {"url": "http://work.chron.com/much-professors-earn-8913.html", "passage_text": "The highest wages were in doctoral institutions, which paid a mean $127,296 per year for full professors, and $92,468 annually for all teachers. Masters facilities were next with an annual average of $91,998 for professors, and an average $71,121 yearly for all teachers. The highest-paid professors by subject as of May 2011, were law teachers, who earned an average $108,760 per year, according to the Bureau of Labor Statistics. The agency did not calculate hourly wages because professors did not work a standard 40-hour week throughout the year."}, {"url": "http://work.chron.com/much-professor-university-make-per-year-9417.html", "passage_text": "For example, mathematical science professors at state-owned universities earned mean annual wages of $76,010, while those who taught at private universities made $77,060 as of May 2011, according to the Bureau of Labor Statistics. Although university professors might have numerous titles, the common levels of full-time professorship include assistant professor, associate professor and full professor. An assistant professor is a full-time professor, but without tenure. Once she gains tenure she is known as an associate"}, {"url": "http://www.answers.com/Q/How_much_does_a_college_professor_make", "passage_text": "Answer by Toomuch386. Confidence votes 31. According to a recent poll of Professor salaries across the US, they ranged from roughly $61,000 to over $108,000, with a very few (the top 5%) making over $500,000 per year for very specific fields of study and interest. The pay for college professors varies widely depending on their specialty and the quality and prestige of the school. Highly paid are professors in fields like medicine and s … cience at schools with international reputations. Their salaries may be in the $150,000 to $200,000 range."}]