[{"url": "http://www.yourdictionary.com/datum", "passage_text": "noun. The definition of a datum is a fact used to make a conclusion or a point of reference in geography or geology. 1  An example of a datum is a new scientific discovery used to reach a conclusion about the common cold."}, {"url": "http://oceanservice.noaa.gov/facts/datum.html", "passage_text": "A geodetic datum is an abstract coordinate system with a reference surface (such as sea level) that serves to provide known locations to begin surveys and create maps. In this way, datums act similar to starting points when you give someone directions."}, {"url": "http://www.definitions.net/definition/Datum", "passage_text": "datum (Noun). plural: data A measurement of something on a scale understood by both the recorder (a person or device) and the reader (another person or device). The scale is arbitrarily defined, such as from 1 to 10 by ones, 1 to 100 by 0.1, or simply true or false, on or off, yes, no, or maybe, etc."}, {"url": "http://wiki.gis.com/wiki/index.php/Datum_(geodesy)", "passage_text": "Horizontal datums are used for describing a point on the earth 's surface, in latitude and longitude or another coordinate system. Vertical datums measure elevations or depths. In engineering and drafting, a datum is a reference point, surface, or axis on an object against which measurements are made."}, {"url": "http://mirkostrade10.sydneyinstitute.wikispaces.net/file/view/Class+Notes+Levelling.pdf", "passage_text": "This may be the National Datum (Australian Height Datum) or local datum point established on a construction site. Mean sea level (MSL) is the average (mean) height of the sea between High and Low tides Reduced Level (RL) – A distance recorded as a Height Above or Below the DATUM. This height is in metres."}, {"url": "http://tidesandcurrents.noaa.gov/datum_options.html", "passage_text": "Tidal Datums. In general, a datum is a base elevation used as a reference from which to reckon heights or depths. A tidal datum is a standard elevation defined by a certain phase of the tide."}, {"url": "http://www.ngs.noaa.gov/datums/vertical/", "passage_text": "More broadly, a vertical datum is the entire system of the zero elevation surface and methods of determining heights relative to that surface. Over the years, many different types of vertical datums have been used. The most predominant types today are tidal datums and geodetic datums."}]