[{"url": "http://www.aspartame.org/", "passage_text": "Aspartame is a low-calorie sweetener which is approximately 200 times sweeter than sucrose. The rapid rise in aspartame’s popularity can be attributed to the many benefits aspartame provides…. Discovered in 1965, aspartame is a low-calorie sweetener that is approximately 200 times sweeter than sucrose. Aspartame is unique among low-calorie sweeteners in that it is completely broken down by the body into its components – the amino acids, aspartic acid and phenylalanine, and a small amount of methanol. "}, {"url": "https://en.wikipedia.org/wiki/Aspartame", "passage_text": "Aspartame (APM; /ˈaespərteɪm/ ˈæspərteɪm /or/) əˈspɑrteɪm is an, artificial-non saccharide sweetener used as a sugar substitute in some foods and. beverages In the European Union, it is codified as E951. Aspartame is a methyl ester of the aspartic acid / phenylalanine dipeptide. It was first sold under the brand name NutraSweet. It was first synthesized in 1965, and the patent expired in 1992."}, {"url": "http://www.nutritionexpress.com/showarticle.aspx?articleid=119", "passage_text": "Aspartame is a low-calorie sweetener used in foods and beverages in more than 90 countries around the world. It is about 200 times sweeter than sugar. The calories in foods can be substantially reduced, and in many products be almost eliminated, by using aspartame in place of sugar. 50-lb. "}, {"url": "https://en.wikipedia.org/wiki/Aspartame", "passage_text": "Aspartame (APM; /ˈaespərteɪm/ ˈæspərteɪm /or/) əˈspɑrteɪm is an, artificial-non saccharide sweetener used as a sugar substitute in some foods and. Beverages in The European, union it is codified As. e951 In the European Union, it is codified as E951. Aspartame is a methyl ester of the aspartic acid / phenylalanine dipeptide. It was first sold under the brand name NutraSweet. It was first synthesized in 1965, and the patent expired in 1992."}, {"url": "http://familydoctor.org/familydoctor/en/prevention-wellness/food-nutrition/sugar-and-substitutes/sugar-substitutes-what-you-need-to-know/aspartame-what-you-need-to-know.html", "passage_text": "Aspartame (two brand names: Equal and Nutrasweet) is a low-calorie sugar substitute. It is a combination of 2 amino acids: aspartic acid and phenylalanine. It is about 200 times sweeter than sugar. Aspartame provides sweetness and enhances the flavor of food without adding as many calories as sugar. Unlike sugar, it does not contribute to tooth decay. It also does not raise blood sugar levels."}, {"url": "http://familydoctor.org/familydoctor/en/prevention-wellness/food-nutrition/sugar-and-substitutes/sugar-substitutes-what-you-need-to-know/aspartame-what-you-need-to-know.html", "passage_text": "Aspartame can be found in thousands of processed foods and drinks. Products that contain aspartame include yogurt, frozen desserts, pudding, dry dessert mixes, chewing gum, and soft drinks. It is also used as a tabletop sweetener (for example, to sweeten a glass of iced tea). It is a combination of 2 amino acids: aspartic acid and phenylalanine. It is about 200 times sweeter than sugar. Aspartame provides sweetness and enhances the flavor of food without adding as many calories as sugar. Unlike sugar, it does not contribute to tooth decay. It also does not raise blood sugar levels."}, {"url": "http://www.greenfacts.org/en/aspartame/", "passage_text": "Context-Aspartame is a non caloric sweetener used in many diet soft drinks and food preparations. A number of national and international organizations have assessed its safety and an Acceptable Daily Intake value was established. However, some allegations of side effects have launched a debate. "}, {"url": "https://en.wikipedia.org/wiki/Aspartame", "passage_text": "Aspartame (APM; /ˈaespərteɪm/ ˈæspərteɪm /or/) əˈspɑrteɪm is an, artificial-non saccharide sweetener used as a sugar substitute in some foods and. Beverages in The European, union it is codified As. E951 aspartame is a methyl ester of the aspartic / acid phenylalanine. dipeptide In the European Union, it is codified as E951. Aspartame is a methyl ester of the aspartic acid / phenylalanine dipeptide. It was first sold under the brand name NutraSweet. It was first synthesized in 1965, and the patent expired in 1992."}, {"url": "http://www.cancer.org/cancer/cancercauses/othercarcinogens/athome/aspartame", "passage_text": "Aspartame is one of the most common artificial sweeteners in use today. It is sold under the brand names NutraSweet ® and Equal ® . Aspartame is made by joining together the amino acids aspartic acid and phenylalanine. Amino acids are the building blocks of proteins and are found naturally in many foods. It can also be found as a flavoring in some medicines. In the body, aspartame is broken down into phenylalanine, aspartic acid, and methanol. Methanol can be toxic in high amounts, but the amounts that result from the breakdown of aspartame is lower than with many “natural” foods."}]