[{"url": "http://www.cdc.gov/meningitis/bacterial.html", "passage_text": "Other meningitis-causing bacteria are not spread person-to-person, but can cause disease because the person has certain risk factors (such as a weak immune system or head trauma). Unlike other bacterial causes of meningitis, you can get Listeria monocytogenes by eating contaminated food. While most people with meningitis recover, it can cause serious complications, such as brain damage, hearing loss, or learning disabilities. There are several pathogens (types of germs) that can cause bacterial meningitis."}, {"url": "http://immunizeforgood.com/vaccines/vaccine-types/meningococcal", "passage_text": "Vaccine Recommendations. Meningococcal vaccines protect against most types of meningitis, but they do not prevent all cases. Meningococcal conjugate vaccine is recommended for people 11 – 54 years of age, as well as certain high-risk children from ages nine months through ten years. Bacterial meningitis is typically caused by one of three types of bacteria: Haemophilus influenzae type b (Hib), Neisseria meningitidis, or Streptococcus pneumoniae bacteria. Before the 1990's, Haemophilus influenzae type b (Hib) was the leading cause of bacterical meningitis."}, {"url": "http://www.cdc.gov/meningitis/bacterial.html", "passage_text": "The germs that cause bacterial meningitis can be contagious. Some bacteria can spread through the exchange (e.g., by kissing) of respiratory and throat secretions (e.g., saliva or mucus). Fortunately, most of the bacteria that cause meningitis are not as contagious as viruses that cause the common cold or the flu. While most people with meningitis recover, it can cause serious complications, such as brain damage, hearing loss, or learning disabilities. There are several pathogens (types of germs) that can cause bacterial meningitis."}, {"url": "http://www.webmd.com/children/vaccines/prevent-meningitis-tips-protect-your-teen", "passage_text": "There's a lot you can do to help prevent meningitis in your teenager. For one, a meningococcal vaccine can help prevent the leading cause of bacterial meningitis in teens. Your teen can also take steps to enhance his or her immune system and to prevent the spread of the disease. Meningococcal disease is a leading cause of bacterial meningitis in teens and young adults. The CDC recommends a meningococcal vaccine for all children 11 to 18. The vaccine is routinely given at 11-12, but it is also recommended for:"}, {"url": "https://answers.yahoo.com/question/index?qid=1006021609797", "passage_text": "Does the bacterial meningitis vaccine prevent bacterial or viral meningitis. We are having a serious problem with meningtis in our area. My students are very concerned about their risk factors and if the vaccine will prevent either viral or bacterial meningitis. Rating Newest Oldest. Best Answer: The currently available meningococcal meningitis vaccine protects against four types of the bacterium Neisseria meningitidis, a very important cause of bacterial meningitis and sepsis in adolescents and young adults in the United States."}, {"url": "http://www.meningitis.org/disease-info/vaccines", "passage_text": "Yes, there are vaccines that protect against some forms of meningitis and septicaemia, but although these vaccines provide excellent protection, they can't prevent all strains of these diseases. As yet there is no vaccine that can prevent all forms of meningitis and septicaemia. Group B meningococcal bacteria currently cause around 50% of all meningitis and septicaemia in the UK. A new MenB vaccine, called Bexsero®, which is licensed in Europe, has recently been recommended for all babies"}, {"url": "https://answers.yahoo.com/question/index?qid=1006021609797", "passage_text": "The vaccine will not totally eliminate the risk of meningococcal disease, though it is highly effective against the four types of bacterial meningitis that account for about 70 to 80 percent of the cases of meningitis in college students. Rating Newest Oldest. Best Answer: The currently available meningococcal meningitis vaccine protects against four types of the bacterium Neisseria meningitidis, a very important cause of bacterial meningitis and sepsis in adolescents and young adults in the United States."}, {"url": "http://www.webmd.com/children/vaccines/understanding-meningitis-prevention", "passage_text": "Meningitis Vaccines. Meningococcal meningitis is a serious disease -- even with treatment. That's why prevention is a far better approach. The meningococcal vaccine can prevent meningitis infection. In the U.S., three types of meningococcal vaccines are used: 1  Meningococcal conjugate vaccine (MCV4) -- These include Menactra and Menveo. 2  Meningococcal polysaccharide vaccine (MPSV4) -- Menoimune"}, {"url": "http://www.webmd.com/children/vaccines/prevent-meningitis-tips-protect-your-teen", "passage_text": "Meningitis Prevention: Protect With a Vaccine. Meningococcal disease is a leading cause of bacterial meningitis in teens and young adults. The CDC recommends a meningococcal vaccine for all children 11 to 18. The vaccine is routinely given at 11-12, but it is also recommended for:"}]