[{"url": "http://animalplacesanctuary.blogspot.com/2008/03/poultry-not-considered-livestock.html", "passage_text": "Poultry not considered livestock. I looked up the definition of livestock just for giggles. By definition, any animal raised for profit on a farm or ranch is livestock. Seems simple enough"}, {"url": "https://answers.yahoo.com/question/index?qid=20070527172309AAp1ruv", "passage_text": "Report Abuse. Chickens are poultry, which is a form of small livestock. Livestock usually means to sell, but can include animals that produce some type of food, whether it is milk, eggs, whatever. However, chances are, if your community doesn't allow livestock, it means no chickens, in addition to goats, cows, etc, etc. Best Answer: Actually they could be considered both. Depends on why you have them. If you plan to sell them they are considered livestock. If you just want them as pets or for meat or eggs then they are poultry."}, {"url": "http://www.righttothrive.org/lesson/backyard-poultry-more-than-just-eggs/", "passage_text": "Keeping Chickens & Ducks. Chickens and ducks are considered livestock animals-and animals used in food production are usually found on rural farms. Many cities have allowed chickens and other poultry to live inside city limits, even while other livestock animals are still banned. "}, {"url": "http://pickchicks.blogspot.com/2010/09/are-chickens-livestock-or-pets.html", "passage_text": "Dress-up clothes for chickens allow an owner to get his chicken into the spirit of the holidays as a chicken Santa or Uncle Sam There are even pet sitters that specialize in chicken sitting while the pets' owner is away (8). Livestock have numbers; pets have names. Livestock lives far from human dwellings; pets live in close proximity to their owners.Livestock does not receive regular, positive human interaction; pets do.Sick or injured livestock are typically culled; pets go to the veterinarian for medical care. The care of dogs at puppy-breeding operations closely parallels the care of chickens in egg-production facilities. For the operators of these types of commercial enterprises, the animals are livestock."}, {"url": "http://www.backyardchickens.com/t/74311/are-chickens-considered-livestock-in-your-state-town", "passage_text": "Poultry being any domesitcated fowl. If they didn't want folks to have chickens, they should have said so in the current bylaws, been more specific. I was told by the CUP board that anything that lives on a farm is considered livestock. Well, dogs and cats live on farms, so they are livestock. They angrily shouted NO, they are pets, everyone knows that. Hi-. Dealing with town here regarding my chickens and living in Residential A where livestock is permitted with a Conditional Use Permit."}, {"url": "https://answers.yahoo.com/question/index?qid=20070527172309AAp1ruv", "passage_text": "I suppose the chicken could be considered a pet so long as you are not raising the bird for its eggs. If you are then the bird is being used for a food source and therefore would be considered livestock and a subcategory of poultry. Best Answer: Actually they could be considered both. Depends on why you have them. If you plan to sell them they are considered livestock. If you just want them as pets or for meat or eggs then they are poultry."}, {"url": "https://en.wikipedia.org/wiki/Livestock", "passage_text": "Livestock are domesticated animals raised in an agricultural setting to produce commodities such as food, fiber and labor. This article does not discuss poultry or farmed fish, although these, especially poultry, are commonly included within the meaning of livestock. Livestock are generally raised for profit. Raising animals (animal husbandry) is a component of modern agriculture. It has been practiced in many cultures since the transition to farming from hunter-gather lifestyles. "}, {"url": "http://www.backyardchickens.com/t/39147/are-chickens-considered-livestock", "passage_text": "nope rabbits and chickens are poultry here. we fought our town ordinances and they have to allow us 12 layers in town and had to get a poultry permit. by law with the ordinace already in place legally they couldn't deny us but they sure did put the limits on it to go with it. It depends on where you live. Some places exclude a few hens in the livestock description, some make no exceptions. You'll have to find out the definition in your bylaws of just what livestock is."}]