[{"url": "https://en.wikipedia.org/wiki/Sunroof", "passage_text": "Sunroofs, by historical definition, are opaque. The first car company to offer a sunroof as a standard option was the Nash Motor Company as an option on some of its 1937 models. Today, most factory sliding sunroof options feature a glass panel and are sometimes marketed as moonroofs, a term introduced in 1973 by John Atkinson, a marketing manager at Ford for the Lincoln Continental Mark IV. For the first year, Ford sent out its Mark IVs to American Sunroof Company for offline installation."}, {"url": "http://autorepair.about.com/od/glossary/a/sun_vs_moon_roof.htm", "passage_text": "Just as a sedan is a distinctive type of automobile, a moonroof is a type of sunroof. Sunroof is the generic term used to describe any panel in a vehicle roof which can let in light and/or air. While most sunroof panels are operable, some may be fixed. The term moonroof was used in the 70's to describe a glass panel inbuilt electric sunroof, and is now used generically to describe all glass panel inbuilt sunroofs. An inbuilt sunroof is one where the operable panel slides between the vehicle roof and headliner, and is often powered but may be manually operated. "}, {"url": "http://www.diffen.com/difference/Moonroof_vs_Sunroof", "passage_text": "Moonroof vs. Sunroof. Diffen › Automotive › Cars. A sunroof is an operable metal panel in a car roof that slides back to let in light and air. A moonroof is a similar panel, but its panel is made of glass and can let light in even when closed. The term moonroof was coined by Ford in the 70s but is now used generically to describe glass-panel inbuilt electric sunroofs in vehicles by all manufacturers. To use the moonroof in light-only mode, all you need to do is slide back the fabric-covered panel to expose the glass. A sunroof is an operable metal panel in a car roof that slides back to let in light and air"}, {"url": "http://columbuscaraudio.com/what-is-the-difference-between-a-sunroof-a-moonroof/", "passage_text": "Today sunroof is simply a generic term used to describe any panel in the roof of a vehicle which lets in light and/or air. Moonroof is now most commonly used to describe glass panel inbuilt sunroofs, where the panel slides between the vehicle roof and headliner. The majority of new cars technically have moonroofs, as what was originally considered a sunroof has pretty much gone out of style. Technically, there is a difference between a sunroof and a moonroof, but today everybody mostly uses the terms interchangeably, and the truth is a moonroof is a type of sunroof."}, {"url": "https://www.cars.com/articles/whats-the-difference-between-a-sunroof-and-a-moonroof-1420666252506/", "passage_text": "2014 Jeep Cherokee Cars.com photo by Evan Sears. There is a technical difference between a sunroof and a moonroof, but most everybody uses the terms interchangeably. First off, both are panels in the roof that let light or fresh air inside the cabin. Getting down to details, though: A sunroof is typically a solid body-colored panel that pops up or is removable. A moonroof is a type of sunroof, except that it’s a sliding glass panel. The majority of new cars have moonroofs, as what’s technically considered a sunroof has pretty much gone out of style"}, {"url": "http://www.nbcnewyork.com/news/local/Shattered-Glass-Sunroof--293692881.html", "passage_text": "More videos (1 of 9). The type of glass used in sunroof windows can shatter without warning into thousands of tiny shards, and the I-Team found hundreds of complaints within the National Highway Traffic Safety Administration's database from drivers who had it happen in their cars. Pei-Sze Cheng reports. (Published Tuesday, Feb. 24, 2015). "}, {"url": "http://www.sunroofs.org/faq.htm", "passage_text": "Sunroof is the generic term used to describe an operable panel in a vehicle roof which can let in light and/or air. Moonroof is a term created by Ford in the 70's, yet is now used generically to describe glass panel inbuilt electric sunroofs. "}, {"url": "http://www.sunroofs.org/srcare.htm", "passage_text": "POP-UP SUNROOFS. Pop-up sunroofs vent in the rear, and have a removable glass panel. They require little maintenance, except for regular cleaning. Start with the gasket, which is the seal between the glass and the main body of the sunroof. This type of sunroof is usually found in luxury vehicles, although is also common among imports. The sunroof panel lowers and glides between the outside roof and headliner of the vehicle with the push of a button! Most have glass panels with a sliding panel shade, and many also include a tilt up vent mode."}, {"url": "https://en.wikipedia.org/wiki/Sunroof", "passage_text": "An automotive sunroof is a fixed or operable (venting or sliding) opening in an automobile roof which allows light and/or fresh air to enter the passenger compartment. Sunroofs may be manually operated or motor driven, and are available in many shapes, sizes and styles. Today, most factory sliding sunroof options feature a glass panel and are sometimes marketed as moonroofs, a term introduced in 1973 by John Atkinson, a marketing manager at Ford for the Lincoln Continental Mark IV. For the first year, Ford sent out its Mark IVs to American Sunroof Company for offline installation."}]