[{"url": "http://www.answers.com/Q/What_2_continents_are_divided_by_the_Ural_Mountains", "passage_text": "It's Europe. Which is why there was Eurasia. Today we have 7 continents, so Europe would become the 2nd smallest continent while the Ural Mountains in Russia naturally marks t … he beginning of Asia. So Siberia (Ural, Siberian, and Far East Federal Districts) is occupied in Asia (North Asia). Europe is the continent that extends west from the Dardanelles, the  Black Sea, and the Ural Mountains."}, {"url": "http://todiscoverrussia.com/ural-mountains-divide-russia-into-europe-and-asia/", "passage_text": "Ural Mountains divide Russia into Europe and Asia. The Ural Mountains are famous for the fact that they serve as a natural divider between the two continents: Europe and Asia. The Ural Mountains begin where the East European Plain ends. Immediately east of the Urals begins Siberia. The Ural Mountains are lower than most of the famous mountains such as the Himalayas, for example. But they have a distinct advantage: they are extremely rich in minerals (over 200) and commercial deposits (48 types)."}, {"url": "http://www.answers.com/Q/What_do_the_Ural_mountains_divide", "passage_text": "The Ural Mountains are located mostly in Russia, with the southern end in Kazakhstan. The range is considered to mark the continental border between Europe and Asia, e … xtending 1500 miles from the Kara Sea and Arctic Ocean in the north nearly to the Aral and Caspian Seas in the south.  . The Ural Mountains are known for separating the continents of Europe and Asia. The Ural Mountains are known for being 1500 miles wide and the highest point is Mount Narodnaya."}, {"url": "http://www.rusnet.nl/encyclo/u/urals_physic.shtml", "passage_text": "The Urals divide into five sections. The northernmost Polar Urals extend some 240 miles from Mount Konstantinov Kamen in the northeast to the Khulga River in the southeast; most mountains rise to 3,300-3,600 feet (1,000-1,100 metres) above sea level, although the highest peak, Mount Payer, reaches 4,829 feet. "}, {"url": "https://en.wikipedia.org/wiki/Ural_mountains", "passage_text": "Uralskiye gory; [ʊˈralʲskʲɪjə ˈgorɨ] ; Bashkir: урал тауҙары), or simply the Urals, are a mountain range that runs approximately from north to south through western Russia, from the coast of the Arctic Ocean to the Ural River and northwestern Kazakhstan. The areas west of the Ural Mountains are 1–2 °C (1.8–3.6 °F) warmer in winter than the eastern regions because the former are warmed by Atlantic winds whereas the eastern slopes are chilled by Siberian air masses."}, {"url": "http://schoolworkhelper.net/ural-mountains-geography-people-features/", "passage_text": "Print PDF. The Ural Mountains are a rugged spine across Russia, running 1,300 miles from the fringe of the Arctic in the North, to the bend of the Ural River in the South. Traditionally they form a boundary between Europe and Asia. Physical Features. The Urals divide into five sections. The northernmost Polar Urals extend some 240 miles from Mount Konstantinov Kamen in the north-east to the Khulga River the southeast; most mountains rise to 3300-3600 feet above sea level, although the highest peak, Mount Payer reaches 4829 ft."}, {"url": "http://www.counter-currents.com/2011/08/europes-continental-boundaries/", "passage_text": "The watershed divide of the Ural Mountains forms the natural land boundary between the continents of Europe and Asia. The range, averaging 3,000–4,000 ft. in height, extends about 1,640 miles north-south from the Arctic Ocean to the northern steppe of Kazakhstan. "}, {"url": "http://novaonline.nvcc.edu/eli/evans/HIS241/Notes/Geography/Urals.html", "passage_text": "The Ural Mountains have long been considered the traditional boundary/dividing line between Europe and Asia. The Ural Mountains (уральские горы, Uralskie gory, the Stone Belt) as a mountain range run roughly north and south through Russia to Kazakhstan for a little more than 1,500 mi. The Central Urals contain important mineral and metal deposits, such as iron, copper, chromium, nickel, coal and oil, and it is one of the most industrialized regions of Russia, especially around the cities of Perm, Cheliabinsk, Ekaterinburg and Magnitogorsk."}, {"url": "http://novaonline.nvcc.edu/eli/evans/HIS241/Notes/Geography/Urals.html", "passage_text": "The most northerly section of the Ural Mountains are known as the Pre-Polar and Polar Urals.. The mountain range in the north tends to be generally higher and subject to a more extreme tundra-like climate, with summer lasting only around a month. The Central Urals contain important mineral and metal deposits, such as iron, copper, chromium, nickel, coal and oil, and it is one of the most industrialized regions of Russia, especially around the cities of Perm, Cheliabinsk, Ekaterinburg and Magnitogorsk."}]