[{"url": "http://www.whatisbiotechnology.org/science/extraction", "passage_text": "DNA extraction. DNA (DeoxyriboNucleic Acid) is a long stringy molecule that can be extracted from any biological material such as living or conserved tissues, cells and virus particles. A number of basic procedures are carried out to isolate and purify DNA. First the cell is broken open to expose its DNA. This is achieved by blending or grinding the cell. The next step involves breaking down and emulsifying the fat and proteins that make up the cell's membrane."}, {"url": "http://serc.carleton.edu/microbelife/research_methods/genomics/dnaext.html", "passage_text": "Simply put, DNA Extraction is the removal of deoxyribonucleic acid (DNA) from the cells or viruses in which it normally resides. The DNA was extracted from the thermal STIV virus and cut with three separate restriction enzymes. (picture supplied by the author). Instrumentation used in DNA Extraction -. This bead beater is used in the breaking apart or lysing of cells in the early steps of extraction in order to make the DNA accessible."}, {"url": "http://biotechlearn.org.nz/themes/dna_lab/dna_extraction", "passage_text": "DNA extraction is a routine procedure used to isolate DNA from the nucleus of cells. DNA precipitate. Scientists can buy ready-to-use DNA extraction kits. These kits help extract DNA from particular cell types or sample types. However, they can be expensive to use routinely, so many labs have their own methods for DNA extraction. "}, {"url": "http://www.biologyjunction.com/extracting_dna.htm", "passage_text": "Introduction: Since DNA is the blueprint for life, everything living contains DNA. DNA isolation is one of the most basic and essential techniques in the study of DNA. The extraction of DNA from cells and its purification are of primary importance to the field of biotechnology and forensics. "}, {"url": "https://en.wikipedia.org/wiki/DNA_extraction", "passage_text": "1 Breaking the cells open, commonly referred to as cell disruption or cell lysis, to expose the DNA within. 2  This is commonly achieved by chemical and physical methods-blending, grinding or sonicating the sample. 3  Removing membrane lipids by adding a detergent or surfactants which also serves in cell lysis. DNA isolation is a process of purification of DNA from sample using a combination of physical and chemical methods. The first isolation of DNA was done in 1869 by Friedrich Miescher. Currently it is a routine procedure in molecular biology or forensic analyse"}, {"url": "http://www.lifesciences.sourcebioscience.com/genomic-services/faq/dna-extraction/", "passage_text": "What is the typical DNA yield from a 10ml blood extraction? The yield is dependent on the amount of DNA-containing cells in the sample but is typically 300-500µg of DNA from a 10ml blood extraction, 15-25µg from a 2ml blood extraction and 4-6µg from a 200µl blood extraction. "}, {"url": "https://en.wikipedia.org/wiki/DNA_extraction", "passage_text": "DNA absorbs UV light at 260 and 280 nanometres, and aromatic proteins absorb UV light at 280 nm; a pure sample of DNA has a ratio of 1.8 at 260/280 and is relatively free from protein contamination. A DNA preparation that is contaminated with protein will have a 260/280 ratio lower than 1.8. DNA isolation is a process of purification of DNA from sample using a combination of physical and chemical methods. The first isolation of DNA was done in 1869 by Friedrich Miescher. Currently it is a routine procedure in molecular biology or forensic analyses"}, {"url": "http://learn.genetics.utah.edu/content/labs/extraction/", "passage_text": "DNA is extracted from human cells for a variety of reasons. With a pure sample of DNA you can test a newborn for a genetic disease, analyze forensic evidence, or study a gene involved in cancer. Try this virtual laboratory to perform a cheek swab and extract DNA from human cells. Javascript is required to view this content."}, {"url": "http://serc.carleton.edu/microbelife/research_methods/genomics/dnaext.html", "passage_text": "Extraction of DNA is often an early step in many diagnostic processes used to detect bacteria and viruses in the environment as well as diagnosing disease and genetic disorders. The DNA was extracted from the thermal STIV virus and cut with three separate restriction enzymes. (picture supplied by the author). Instrumentation used in DNA Extraction -. This bead beater is used in the breaking apart or lysing of cells in the early steps of extraction in order to make the DNA accessible."}]