[{"url": "http://www.innerbody.com/image/digeov.html", "passage_text": "The digestive system is a group of organs working together to convert food into energy and basic nutrients to feed the entire body. Food passes through a long tube inside the body known as the alimentary canal or the gastrointestinal tract (GI tract). Accessory organs of the digestive system include the teeth, tongue, salivary glands, liver, gallbladder, and pancreas. To achieve the goal of providing energy and nutrients to the body, six major functions take place in the digestive system: 1  Ingestion. 2  Secretion. 3  Mixing and movement. 4  Digestion."}, {"url": "http://my.clevelandclinic.org/health/diseases_conditions/hic_the_structure_and_function_of_the_digestive_system", "passage_text": "The pancreas secretes digestive enzymes into the duodenum, the first segment of the small intestine. These enzymes break down protein, fats, and carbohydrates. The pancreas also makes insulin, secreting it directly into the bloodstream. Insulin is the chief hormone for metabolizing sugar. The colon is a 6-foot long muscular tube that connects the small intestine to the rectum. The large intestine is made up of the cecum, the ascending (right) colon, the transverse (across) colon, the descending (left) colon, and the sigmoid colon, which connects"}, {"url": "http://www.webmd.com/heartburn-gerd/your-digestive-system", "passage_text": "The mouth is the beginning of the digestive tract. In fact, digestion starts here as soon as you take the first bite of a meal. Chewing breaks the food into pieces that are more easily digested, while saliva mixes with food to begin the process of breaking it down into a form your body can absorb and use. Peristalsis (contractions) is also at work in this organ, moving food through and mixing it up with digestive secretions. The duodenum is largely responsible for continuing the process of breaking down food, with the jejunum and ileum being mainly responsible for the absorption of nutrients into the bloodstream."}, {"url": "http://www.buzzle.com/articles/organs-of-the-digestive-system.html", "passage_text": "Large intestine: Also known as the large bowel, the large intestine is a highly specialized organ of the digestive system. Its main function is to absorb the remaining water from the indigestible food matter and pass unwanted waste matter from the body. Liver: The liver is one of the most important organs of the human body. The liver basically performs the task of producing digestive juices, biochemicals and also helps in protein synthesis. Pancreas: The pancreas secretes enzymes into the duodenum which breaks down the fats, carbohydrates and protein."}, {"url": "http://www.webmd.com/heartburn-gerd/your-digestive-system", "passage_text": "Stomach. The stomach is a sac-like organ with strong muscular walls. In addition to holding the food, it's also a mixer and grinder. The stomach secretes acid and powerful enzymes that continue the process of breaking down the food. When it leaves the stomach, food is the consistency of a liquid or paste. Peristalsis (contractions) is also at work in this organ, moving food through and mixing it up with digestive secretions. The duodenum is largely responsible for continuing the process of breaking down food, with the jejunum and ileum being mainly responsible for the absorption of nutrients into the bloodstream."}, {"url": "http://www.buzzle.com/articles/organs-of-the-digestive-system.html", "passage_text": "Mouth: This is the first organ that begins the digestion process and it is here that mastication or breaking down of food takes place. The mouth further contains three basic organs-the salivary glands, tongue and the teeth. Liver: The liver is one of the most important organs of the human body. The liver basically performs the task of producing digestive juices, biochemicals and also helps in protein synthesis. Pancreas: The pancreas secretes enzymes into the duodenum which breaks down the fats, carbohydrates and protein."}, {"url": "http://www.webmd.com/digestive-disorders/digestive-system", "passage_text": "Stop 1: The Mouth. The mouth is the beginning of the digestive system, and, in fact, digestion starts here before you even take the first bite of a meal. The smell of food triggers the salivary glands in your mouth to secrete saliva, causing your mouth to water. When you actually taste the food, saliva increases. In addition, juices are produced that will help to further break down food. Chew your food more -- it helps with your digestion. Stop 2: The Pharynx and Esophagus. Also called the throat, the pharynx is the portion of the digestive tract that receives the food from your mouth. Branching off the pharynx is the esophagus, which carries food to the stomach, and the trachea or windpipe, which carries air to the lungs. 1 | 2 | 3 | 4"}, {"url": "http://www.livescience.com/22367-digestive-system.html", "passage_text": "The human digestive system is a series of organs that converts food into essential nutrients that are absorbed into the body and eliminates unused waste material. It is essential to good health because if the digestive system shuts down, the body cannot be nourished or rid itself of waste. "}, {"url": "http://www.webmd.com/heartburn-gerd/your-digestive-system", "passage_text": "Bile is a compound that aids in the digestion of fat and eliminates waste products from the blood. Peristalsis (contractions) is also at work in this organ, moving food through and mixing it up with digestive secretions. The duodenum is largely responsible for continuing the process of breaking down food, with the jejunum and ileum being mainly responsible for the absorption of nutrients into the bloodstream."}]