[{"url": "http://www.cliffordawright.com/caw/food/entries/display.php/id/15/", "passage_text": "The Origin and History of Spinach. Spinach comes from a central and southwestern Asian gene center where it may have originated from Spinacia tetranda, which is still gathered as a wild edible green in Anatolia. Spinach was unknown to the ancient Mediterranean world."}, {"url": "http://www.cliffordawright.com/caw/food/entries/display.php/id/15/", "passage_text": "In thirteenth century Damascus, burani was a popular dish of Persian origin, made with spinach or Swiss chard and yogurt, garlic, and spices. In 1614, Castelvetro calls for spinach to be used as the stuffing for tortelli."}, {"url": "http://www.foodreference.com/html/art-spinach-22007.html", "passage_text": "Spinach originates from the Middle East, most likely Persia or modern-day Iran. It was brought to Spain via the Moors somewhere between 800 AD and 1200 AD. Cultivation of spinach began in the USA around 1806."}, {"url": "http://wanttoknowit.com/where-does-spinach-come-from/", "passage_text": "It is believed that spinach was domesticated in Persia (modern day Iran) and spread into India and China (about 650 A.D.) from here. It was introduced to Sicily in 827 and Spain in the 12th century. It spread to Germany, England and France a few hundred years later."}, {"url": "http://www.cliffordawright.com/caw/food/entries/display.php/id/15/", "passage_text": "Spinach became a popular vegetable in the Arab Mediterranean and arrived in Spain by the latter part of the twelfth century where the great Arab agronomist Ibn al-'Awwam called it the captain of leafy greens.. Spinach was also the subject of a special treatise in the eleventh century by Ibn Hajjaj."}, {"url": "http://www.world-foodhistory.com/2006/09/origin-and-history-of-spinach.html", "passage_text": "In thirteenth century Damascus, burani was a popular dish of Persian origin, made with spinach or Swiss chard and yogurt, garlic, and spices. In 1614, Castelvetro calls for spinach to be used as the stuffing for tortelli. In the latter part of the sixteenth century, spinach was known and generally eaten in England."}, {"url": "https://en.wikipedia.org/wiki/Spinach", "passage_text": "Spinach is thought to have originated in ancient Persia (modern Iran and neighboring countries). It is not known by whom, or when, spinach was introduced to India, but the plant was subsequently introduced to ancient China, where it was known as Persian vegetable (bōsī cai; cài; 波斯菜:present). 菠菜"}]