[{"url": "http://www.nbcc.org/Footer/FAQ", "passage_text": "Yes, NBCC will send you a statement each year 90 days in advance of the due date. If the fee is not paid by that due date, there will be a $15 late fee charged to your account. In the fifth year, instead of an annual statement, you will receive a recertification form in the mail. That form will bill you for your annual fee and tell you whether or not you have been selected for the mandatory audit. There may be a problem with the document that is not approved. In this instance, a Certification Department reviewer will contact you. If you do not hear from us within two weeks, please e-mail us at certification@nbcc.org to make sure that we have your up-to-date contact information."}, {"url": "http://www.nbcc.org/Footer/FAQ", "passage_text": "Your NCE scores will not automatically be sent to your state board if you took the NCE as a part of your NCC application. In order to access an official copy of your scores for state licensure or a third-party agency, you must submit your final documents and a Score Verification Request. There may be a problem with the document that is not approved. In this instance, a Certification Department reviewer will contact you. If you do not hear from us within two weeks, please e-mail us at certification@nbcc.org to make sure that we have your up-to-date contact information."}, {"url": "http://hiset.ets.org/scores/get/", "passage_text": "For paper-delivered tests, how long it takes for your scores to be available depends on receipt of your answer sheets at ETS for scoring. If the test center does not send answer sheets to ETS promptly, your scores may be delayed. When you complete a computer-delivered test, immediate, unofficial scores are displayed for all multiple-choice sections. On average, official test scores for both computer-and paper-delivered tests are posted within: 1  3–5 business days for multiple-choice sections. 2  6–10 business days for the essay section."}, {"url": "http://www.twu.edu/downloads/family-sciences/what-happens-after-i-take-the-nce.pdf", "passage_text": "You’ll see a button on the left side of the screen. The cost is $40 and you can take it at any time. You don’t need to have received your NCE scores or have a license. Once you sign up, you can take the test at your leisure (it’s online) and you don’t have to complete it in one sitting. The test contains ethics questions and you must go to each link to look up the answers to the questions. This is a good time to decide what you’re going to do after you graduate. You can begin looking for an LPC-S if you haven’t already found one. You can go to the state site: https://legateway.dshs.state.tx.us/datamart/selSearchType.do to find a list of supervisors in the area."}, {"url": "http://www.eiu.edu/counseling/NCE_retake_exam.pdf", "passage_text": "How can I retake the exam? How long are applications held open? We hold applications open for a two-year time period from the original exam date for which you applied or 3 unsuccessful attempts to pass the NCE, whichever comes first. Note: not taking the NCE does not count as one of your three attempts to pass."}, {"url": "http://www.nbcc.org/Footer/FAQ", "passage_text": "After you pass the NCE and graduate, you have three years to complete and submit documentation of 3,000 hours of counseling work experience and 100 hours of direct counseling supervision completed over a minimum of 24 months. There may be a problem with the document that is not approved. In this instance, a Certification Department reviewer will contact you. If you do not hear from us within two weeks, please e-mail us at certification@nbcc.org to make sure that we have your up-to-date contact information."}, {"url": "http://counselingexam.com/nce/request/request.pdf", "passage_text": "THE NCE EXAM Ok, lets get real here. You only have a limited time left before the exam. Besides taking care of the kids, going to your job, and having a life, you have to squeeze in some time for studying if you're going to pass this exam. For some, passing the exam makes the difference between a promotion or not. EXAM CONTENT AREA: The NCE is composed of 200 multiple-choice questions. A different version of the exam is compiled each time the test is given. Only 160 of the 200 questions count towards your final grade; the other 40 are field tested"}, {"url": "http://www.twu.edu/downloads/family-sciences/what-happens-after-i-take-the-nce.pdf", "passage_text": "It will take about 8 weeks until you receive your NCE scores (it took our group 9 weeks). This is a good time to decide what you’re going to do after you graduate. You can begin looking for an LPC-S if you haven’t already found one. You can go to the state site: https://legateway.dshs.state.tx.us/datamart/selSearchType.do to find a list of supervisors in the area."}, {"url": "http://www.nceexamprep.com/testimonials.aspx", "passage_text": "I will be using this program again when I prepare for my State NCE exam this fall. Thank you! ---------- UPDATE!!! ----------. Thank you NCEExamPrep.com. I passed the NCE and received a score of 122/160 (76%). Passing was 97 (61%) and the National Average is 107 (67%). I also used your program last spring when I was preparing for my CPCE an exam graduate students in professional counseling need to pass in order to graduate. "}, {"url": "https://www.counselorexams.com/faq", "passage_text": "What do I do to get my money back for not passing? To receive your pass guarantee refund, forward the Study Supplement along with a copy of your exam results within 90 days of receiving your score to our office: Career Training Concepts, Inc., ATTN: Deb Storm, 3640 Hewatt Court, Snellville, GA 30039. We do not know every customer's pass/fail history, but we do know that based on the percentage of customers who request their money back based on our Pass Guarantee, our customer's pass rate is 94%. Clearly those using the Dr. Arthur Study Guide to prepare perform above the national pass rate (72%) for the NCE."}]