[{"url": "http://www.healthguideinfo.com/nutritional-supplements/p57614/", "passage_text": "However, since there are many different types of magnesium supplements, many people do not know which type of magnesium supplement they should take. The different types of magnesium supplements include magnesium sulfate, magnesium citrate, magnesium hydroxide, magnesium oxide, magnesium gluconate, and magnesium lactate. Magnesium sulfate is a type of magnesium supplement most commonly used in multivitamins. When magnesium sulfate is administered in high doses, it can be used to help treat convulsions, a magnesium deficiency, childhood acute kidney inflammation, and pre-eclampsia in pregnant women."}, {"url": "http://www.ehow.com/about_5130706_types-magnesium-supplements.html", "passage_text": "There are several different types of magnesium supplements available so one must choose which one is right for them. Types of magnesium supplements include magnesium citrate, magnesium lactate, magnesium gluconate, magnesium oxide, magnesium sulfate and magnesium hydroxide."}, {"url": "http://www.ancient-minerals.com/magnesium-supplements/", "passage_text": "Another term used for these types of magnesium supplements is “inorganic”, however this can be misleading as this form is often closest to the forms of magnesium actually found in nature. Mineral salt forms of magnesium supplements include: 1  Magnesium Bicarbonate. 2  Magnesium Carbonate. 3  Magnesium Chloride. 4  Magnesium Hydroxide. Tested levels of absorption of oral magnesium supplements vary from 4% absorbed to about 50%. Mineral Salts of Magnesium. These forms of magnesium are typically minerals or salts found in nature, such as magnesium chloride, a common component of sea waters."}, {"url": "http://www.clareharding.com/what-types-of-magnesium-are-there-and-what-do-they-do-magnesium-supplementation/", "passage_text": "There are many different types of magnesium supplements. Here is a list of nine them plus a brief summary of what they can do for us. Overall, magnesium is a calming mineral that helps us relax, sleep, lose weight, improve heart health, energy production and reduce cramps and night sweats. "}, {"url": "http://www.swansonvitamins.com/blog/vitamins-supplements-faqs/magnesium", "passage_text": "By Vitamins and Supplements FAQs. There are many different types of magnesium: The typical uses of magnesium supplements are to support bone and muscle health, as well as cardiovascular health and nervous system function. "}, {"url": "http://peoplesrx.com/the-best-kind-of-magnesium-for-you/", "passage_text": "Magnesium amino acid chelate is usually bonded to a variety of amino acids, which are all larger molecules. In this form there is less magnesium by weight but the individual amino acids could all be beneficial for different things. Magnesium Citrate. This is one of the most common forms of Mg on the commercial market. This is Mg bonded to citric acid, which increases the rate of absorption. Citrate is a larger molecule than the simple oxygen of oxide, so there is less magnesium by weight than in the oxide form. This is the most commonly used form in laxative preparations. Magnesium Glycinate and Magnesium Amino Acid Chelate. In this form, Mg is bonded to the amino acid glycine"}, {"url": "http://www.globalhealingcenter.com/natural-health/types-of-magnesium/", "passage_text": "3. Magnesium Citrate. Derived from the magnesium salt of citric acid, this form of magnesium has lower concentration, but a high level of bioavalibity (90%). Magnesium citrate is commonly used as to induce a bowel movement, but has also been studied for kidney stone prevention. Share. Magnesium is one of the most abundant minerals in the human body and 50% of magnesium is located in the bones. Magnesium, similar to zinc, is a necessary cofactor for over 300 biochemical reactions in the human body."}, {"url": "http://www.globalhealingcenter.com/natural-health/types-of-magnesium/", "passage_text": "A mineral chelate form of magnesium containing an ion of magnesium oxide connected to a mixture of some other form of amino acid. This could be a lactate, a glycine, aspartate or arginate, etc. The best chelated amino acid form of magnesium is aspartate or arginate. Share. Magnesium is one of the most abundant minerals in the human body and 50% of magnesium is located in the bones. Magnesium, similar to zinc, is a necessary cofactor for over 300 biochemical reactions in the human body."}, {"url": "http://www.globalhealingcenter.com/natural-health/types-of-magnesium/", "passage_text": "2. Also referred to as “Magnesia”, magnesium oxide is commonly used therapeutically as a laxative and relief for acid reflux. This type of magnesium shows high levels of concentration, but poor levels of bioavailability (only 4%). Share. Magnesium is one of the most abundant minerals in the human body and 50% of magnesium is located in the bones. Magnesium, similar to zinc, is a necessary cofactor for over 300 biochemical reactions in the human body."}]