[{"url": "https://en.wikipedia.org/wiki/SkyActiv", "passage_text": "SKYACTIV is a brand name for a series of technologies developed by Mazda which increase fuel efficiency and engine output. The initial announcement of the SKYACTIV technologies include new engines, transmissions, body, and chassis, which appeared in Mazda products from 2011."}, {"url": "http://www.biggersmazda.com/what-is-skyactiv-technology/", "passage_text": "Thinking Forward. The engineers at Mazda continue to develop SKYACTIV technology to keep Mazda at the forefront of automotive innovation in the 21 st century. Through its commitment to performance, efficiency, and safety, Mazda is proving that you really can have it all."}, {"url": "http://www.coxmazda.com/what-is-skyactiv-technology/", "passage_text": "Using SKYACTIV on a larger crossover like the Mazda CX-5 allows it to retain capability while raising fuel economy to the level of most passenger cars. Standard for the 2015 Mazda CX-5 is a 2.0L four-cylinder engine producing 155 hp and 150 lb-ft of torque. With this engine, drivers can get up to 35 mpg highway."}, {"url": "https://www.mazda.co.uk/aboutmazda/skyactiv-technology/", "passage_text": "SKYACTIV Technology – for a new breed of cars. Mazda vs. Greyhound SKYACTIV i-stop Technology 2014. ‘i-Stop’ allows you to re-start almost instantly while leading to a significant improvement in fuel economy. Much like the greyhound, the ultimate sprinter, being aerodynamic and graceful."}, {"url": "http://www.biggersmazda.com/what-is-skyactiv-technology/", "passage_text": "One of the biggest developments Mazda has made over the past several years is SKYACTIV, an integrated system of state-of-the-art technologies specifically designed to improve engine output and increase fuel efficiency at the same time."}, {"url": "http://autoweek.com/article/car-reviews/mazda-skyactiv-technology-autoweek-flash-drive-car-review", "passage_text": "Mazda's coming SkyActiv technology is not just a couple of engines, a torque converter or a transmission--it is a whole new, more efficient way of engineering cars."}, {"url": "http://autoweek.com/article/car-reviews/mazda-skyactiv-technology-autoweek-flash-drive-car-review", "passage_text": "Engineers said the cost of SkyActiv technology is no more than conventional cars, too. The Mazda 3 will get a 2.0-liter SkyActiv gasoline engine this fall, perhaps as early as October. The new Mazda CX-5 will get it next, in early 2012. Look for SkyActiv-D diesel engines in late 2012 or early 2013. And that's not all."}]