[{"url": "https://answers.yahoo.com/question/index?qid=20081229093626AAeGzL4", "passage_text": "Report Abuse. It takes about 8 minutes for a ray of light from Sun to reach Earth. Since Mercury is close to the Sun, lets say 8 minutes at the speed of light to travel to Mercury from Earth The Sun is about 96 million miles from the Earth. Take 96 million miles and divide by 40000 miles per hour: It would take 2400 hours, or 100 days to travel to Mercury at that speed."}, {"url": "http://www.universetoday.com/33719/how-long-does-it-take-to-get-to-mercury/", "passage_text": "Mariner 10 took 147 days to get from Earth to Mercury. More recently, NASA’s MESSENGER spacecraft launched on August 3, 2004 to study Mercury in orbit. It made its first flyby on January 14th, 2008. That’s a total of 1,260"}, {"url": "http://www.enotes.com/homework-help/travel-time-from-earth-mercury-468153", "passage_text": "Mercury is very close to sun. Because of this its orbit takes 88 days while earths orbit takes 365 days. The distance between earth and mercury changes from time to time. Currently the distance is 113 million km or 70 million miles (recorded in October 2014)."}, {"url": "http://www.answers.com/Q/How_long_would_it_take_to_reach_mercury_from_earth", "passage_text": "The Speed of light is approximately: 186000 miles per second     The distance from the Earth to Mercury is approximately 48 million miles on average.   …   so, 48000000 / 186000 = 258 seconds     60 seconds per minute     so     258 / 60 = 4.3 minutes."}, {"url": "http://www.space.com/18646-mercury-distance.html", "passage_text": "Mercury boasts an orbit that is the most elliptical of all of the planets, stretched out from a perfect circle. When it is closest to the sun, it is only 29 million miles (47 million km), but at its farthest, the distance to Mercury is 43 million miles (70 million km)."}, {"url": "http://coolcosmos.ipac.caltech.edu/ask/25-How-far-is-Mercury-from-Earth-", "passage_text": "Mercury is the first planet from Sun and Earth is the third planet from the Sun. Mercury is an average distance of 48 million miles (77 million km) from Earth. The precise distance between the two planets depends on where they are in their respective orbits."}]