[{"url": "http://money.stackexchange.com/questions/33359/what-us-law-requires-a-bank-to-reopen-a-closed-account-if-a-third-party-sends-mo", "passage_text": "Any time there is a deposit request for a account that has been closed we by law must reopen the account and deposit the funds. I used to have an account with a local credit union. I moved, then closed the account. The credit union mailed me a check for my remaining balance and confirmed the account was closed. This was 14 months ago."}, {"url": "https://uk.answers.yahoo.com/question/index?qid=20110403180309AAgKBAP", "passage_text": "RE: Barclays closed down my account & now I can&#39;t get an account with any bank!? I was with Barclays for 6 years, I had no overdraft & a Barclay Card which I paid every month. Four months ago the cash machine ate my card & when I went into the bank to find out what was going on, I was told my account was being closed."}, {"url": "http://www.consumeractiongroup.co.uk/forum/showthread.php?163955-Help!-Barclays-have-closed-my-account", "passage_text": "Barclays have closed my account. Hi there, hope you can all help me.. I have found out today that Barclays have closed my bank accounts with them. I have/had 2 bank accounts with them for the last 8 years or so, one of which was a student account and another that was my current account that my salary was paid into."}, {"url": "http://www.answers.com/Q/Can_you_reopen_a_bank_account_that%27s_been_closed", "passage_text": "No. Once a bank account is closed, the account number remains unused by the bank for seven or more years (it varies by individual bank). You may reopen a new account with the same bank, provided the first account was not closed by the bank for improprieties perpetrated by you."}, {"url": "http://britishexpats.com/forum/australia-54/barclays-bank-has-closed-my-bank-account-849400/", "passage_text": "Barclays Bank has closed my Bank account!!! Hi all, I am hoping someone here has had a similar experience and can recommend a solution. In short, I found out today by my folks in the UK that Barclays Bank have closed my Uk Barclays Bank account. There was over 2,000 pounds sterling in my account when I left the UK in January 2010."}]