[{"url": "https://www.webelements.com/copper/", "passage_text": "Copper: the essentials. Copper appears in the periodic table at the top of Group 11 above silver and gold. Collectively these are sometimes referred to as the coinage metals, although in modern times these metals are used less frequently than in the past. Copper is one of the most important metals. Copper is reddish with a bright metallic lustre. It is malleable, ductile, and a good conductor of heat and electricity (second only to silver in electrical conductivity). Its alloys, brass and bronze, are very important. Monel and gun metals also contain copper."}, {"url": "https://en.wikipedia.org/wiki/Copper", "passage_text": "Copper is a chemical element with symbol Cu (from Latin: cuprum) and atomic number 29. It is a ductile metal with very high thermal and electrical conductivity. Pure copper is soft and malleable; a freshly exposed surface has a reddish-orange color. There are 29 isotopes of copper. 63 Cu and 65 Cu are stable, with 63 Cu comprising approximately 69% of naturally occurring copper; they both have a spin of 3⁄2. The other isotopes are radioactive, with the most stable being 67 Cu with a half-life of 61.83 hours."}, {"url": "http://www.answers.com/Q/What_does_the_symbol_of_copper_mean", "passage_text": "Use cupric when … the oxidation of copper is +2 and cuprous when the oxidation is +1   The symbol for copper from the PTE (Periodic Table of Elements) is Cu. 4 people found this useful. It was called cuprum back in the day, which i … s Latin. And that Latin name is the source of its chemical symbol, Cu.   You may be familiar with natrium (sodium, chemical symbol Na) and ferrum (iron, chemical symbol Fe)."}, {"url": "http://www.symbols.com/symbol/149", "passage_text": "This page is about the meaning, origin and characteristic of the symbol, emblem, seal, sign, logo or flag: Copper. Alchemy symbol for copper. This was also the symbol for the goddess and the planet Venus. In Greece, copper was known by the name chalkos (χαλκός). It was an important resource for the Romans, Greeks and other ancient peoples. In Roman times, it was known as aes Cyprium, aes being the generic Latin term for copper alloys and Cyprium from Cyprus, where much copper was mined."}, {"url": "http://www.definitions.net/definition/COPPER", "passage_text": "Copper is a chemical element with the symbol Cu and atomic number 29. It is a ductile metal with very high thermal and electrical conductivity. Pure copper is soft and malleable; a freshly exposed surface has a reddish-orange color. "}, {"url": "http://www.answers.com/Q/What_does_the_symbol_of_copper_mean", "passage_text": "Yes, Cu is the chemical symbol for copper (Latin-cuprum) and the atomic number 29. It was called cuprum back in the day, which i … s Latin. And that Latin name is the source of its chemical symbol, Cu.   You may be familiar with natrium (sodium, chemical symbol Na) and ferrum (iron, chemical symbol Fe)."}, {"url": "http://www.abbreviations.com/CU", "passage_text": "copper, Cu, atomic number 29 (noun). a ductile malleable reddish-brown corrosion-resistant diamagnetic metallic element; occurs in various minerals but is the only metal that occurs abundantly in large masses; used as an electrical and thermal conductor. see more on Definitions.net ». "}, {"url": "http://www.answers.com/Q/What_does_the_symbol_of_copper_mean", "passage_text": "The symbol of copper is Cu, which means cuprum, the Latin word for copper. It was called cuprum back in the day, which i … s Latin. And that Latin name is the source of its chemical symbol, Cu.   You may be familiar with natrium (sodium, chemical symbol Na) and ferrum (iron, chemical symbol Fe)."}, {"url": "https://en.wikipedia.org/wiki/Symbol_%28chemistry%29", "passage_text": "For example, He is the symbol for helium (English name, not known in ancient Roman times), Pb for lead (plumbum in Latin), W for tungsten (wolfram in German, not known in Roman times). Only the first letter is capitalized. In chemistry, a symbol is a code for a chemical element. It is usually derived from the name of the element, often in Latin. This is an example of an atomic symbol. The text boxes explain where the numbers are derived from"}]