[{"url": "http://www.news-medical.net/health/What-is-Ileus.aspx", "passage_text": "Paralytic ileus is a form of postoperative ileus that lasts longer than five days after surgery. It represents a common side-effect of certain types of surgical interventions. The condition is also termed pseudo-obstruction and it is one of the major causes of bowel obstruction in infants and children. "}, {"url": "http://medical-dictionary.thefreedictionary.com/paralytic+ileus", "passage_text": "paralytic ileus. loss of all intestinal tone and motility as a result of reflex inhibition in acute peritonitis, from excessive handling during bowel surgery, prolonged and severe distention due to intestinal obstruction and in grass sickness of horses. The effect is the same as that of an acute intestinal obstruction. Called also ileus, adynamic ileus. paralytic myoglobinuria. a disease of horses characterized by red-brown urine due to myoglobinuria, and acute myopathy with muscle weakness, often to the point of being unable to get up."}, {"url": "http://www.primehealthchannel.com/paralytic-ileus-definition-causes-symptoms-and-treatment.html", "passage_text": "Paralytic Ileus is a paralysis of the intestine. It is a complicated medical condition that is characterized by partial or total non-mechanical obstruction of the large or small intestine. This blockage occurs when the intestinal muscles suffer a paralysis. Paralytic Ileus Complications. Paralytic Ileus causes intestinal distension which can lead to an injury of the thin serosal membrane. It may also result in Ischemia or a local anemia in the abdominal region. If a bowel blockage is not treated in time, it can result in serious c"}, {"url": "http://www.medicinenet.com/script/main/art.asp?articlekey=7886", "passage_text": "Paralytic ileus: Obstruction of the intestine due to paralysis of the intestinal muscles. The paralysis does not need to be complete to cause ileus, but the intestinal muscles must be so inactive that it prevents the passage of food and leads to a functional blockage of the intestine. Irrespective of the cause, ileus causes constipation, abdominal distention, and nausea and vomiting. On listening to the abdomen with a stethoscope, few or no bowel sounds are heard (because the bowel is inactive)."}, {"url": "http://www.rightdiagnosis.com/p/paralytic_ileus/causes.htm", "passage_text": "Causes of Paralytic ileus. The most common cause of paralytic ileus is recent abdominal surgery. Other causes include electrolyte imbalances, food poisoning, decreased blood supply to the abdominal area, kidney disease and certain medications (e.g. narcotics). Medications or substances causing Paralytic ileus: The following drugs, medications, substances or toxins are some of the possible causes of Paralytic ileus as a symptom. This list is incomplete and various other drugs or substances may cause your symptoms."}, {"url": "http://medical-dictionary.thefreedictionary.com/paralytic+ileus", "passage_text": "paralytic ileus. n. Nonmechanical obstruction of the bowel from paralysis of the bowel wall, usually as a result of localized or generalized peritonitis or shock. The effect is the same as that of an acute intestinal obstruction. Called also ileus, adynamic ileus. paralytic myoglobinuria. a disease of horses characterized by red-brown urine due to myoglobinuria, and acute myopathy with muscle weakness, often to the point of being unable to get up."}, {"url": "http://www.healthline.com/health/ileus", "passage_text": "Ileus is a blockage of the intestines caused by a lack of peristalsis. Peristalsis is the pumping action of the intestines that helps move food through the digestive system. Ileus is used to describe both full and partial blockages. Solids (food), liquids, and gases are not able to move properly through the body when ileus occurs."}, {"url": "http://www.healthgrades.com/conditions/paralytic-ileus", "passage_text": "Paralytic ileus is a serious medical condition that should be evaluated immediately by a health care provider. Seek immediate medical care (call 911) if you develop symptoms of paralytic ileus, such as being unable to eliminate feces or pass gas, accompanied by abdominal pain or swelling. The bowel, or intestine, is the part of the digestive tract that absorbs nutrients from foods we eat. The residue of digested food passes through the bowel and is excreted during elimination, the final stage of digestion."}, {"url": "http://www.healthgrades.com/conditions/paralytic-ileus", "passage_text": "This process can be interrupted or halted by the presence of a bowel obstruction, a blockage that prevents the passage of intestinal contents, such as feces and fluid. Paralytic ileus is the occurrence of intestinal blockage in the absence of an actual physical obstruction. This type of blockage is caused by a malfunction in the nerves and muscles in the intestine that impairs digestive movement. The bowel, or intestine, is the part of the digestive tract that absorbs nutrients from foods we eat. The residue of digested food passes through the bowel and is excreted during elimination, the final stage of digestion."}, {"url": "http://www.healthgrades.com/conditions/paralytic-ileus", "passage_text": "Find a Gastroenterologist Near You. Paralytic ileus can produce a variety of symptoms, such as a distended abdomen, fullness, gas, abdominal spasms, constipation, diarrhea, nausea with or without vomiting, and foul-smelling breath. The bowel, or intestine, is the part of the digestive tract that absorbs nutrients from foods we eat. The residue of digested food passes through the bowel and is excreted during elimination, the final stage of digestion."}]