[{"url": "http://www.livescience.com/27406-meerkats.html", "passage_text": "Though they are considered carnivores, meerkats eat more than just meat. Their diet includes lizards, birds, bugs and fruit, according to the National Geographic. They also like to treat themselves to scorpions. Adult meerkats have some immunity to the venom, so scorpion stingers are no problem. They are identified by their long bodies; short, flat ears; and their ability to stand on their back feet. Meerkat coats can be gold, silver, orange or brown with dark patches of fur around the eyes. Meerkats are small animals, measuring 9.75 to 11.75 inches (25 to 30 centimeters) from head to rump."}, {"url": "http://www.livescience.com/27406-meerkats.html", "passage_text": "Meerkats are catlike carnivores that are part of the civets and mongoose family. They are identified by their long bodies; short, flat ears; and their ability to stand on their back feet. Meerkat coats can be gold, silver, orange or brown with dark patches of fur around the eyes. Meerkats are small animals, measuring 9.75 to 11.75 inches (25 to 30 centimeters) from head to rump."}, {"url": "http://www.theanimalfiles.com/mammals/carnivores/meerkat.html", "passage_text": "12 - 14 Yrs. Main Characteristics. Meerkats are members of the Mongoose family. They stand at around 25 - 35 cms (10 - 14 inches) tall and the weigh between 1.5 - 2 lbs (0.68 - 0.9 Kgs). Their tail is 17 - 25 cms (6.5 - 10 inches) long and they use this as a tripod to balance on when they stand in an upright position. Diet Insects such as scorpions (Meerkats are immune to their venom), beetles, spiders, centipedes, crickets, millipedes and worms form part of a Meerkat's diet. They also eat eggs, tubers, roots, small mammals and small reptiles."}, {"url": "http://www.answers.com/Q/Are_meerkats_herbivores", "passage_text": "Confidence votes 2.4K. Meerkats are carnivores, They eat insects like scorpions, millipedes, and other things they find crawling around in the dirt. "}, {"url": "https://en.wikipedia.org/wiki/Meerkat", "passage_text": "The meerkat is a small diurnal herpestid (mongoose) weighing on average about 0.5 to 2.5 kilograms (1.1 to 5.5 lb). Its long slender body and limbs give it a body length of 35 to 50 centimetres (14 to 20 in) and an added tail length of around 25 centimetres (9.8 in). Like cats, meerkats have binocular vision, their eyes being on the front of their faces. At the end of each of a meerkat's fingers is a claw used for digging burrows and digging for prey. Claws are also used with muscular hindlegs to help climb trees. Meerkats have four toes on each foot and long slender limbs."}, {"url": "http://pafoszoo.com/animals/mammals/carnivores/", "passage_text": "CARNIVORES. We have a number of carnivores animals at the Zoo from our amazing White Lions to our charismatic Meerkats. All are surviving on a diet consisting mainly or exclusively of meat either through predation or scavenging. "}, {"url": "https://en.wikipedia.org/wiki/Meerkat", "passage_text": "Meerkat digging for insects. Meerkat eating a frog. Meerkats are primarily insectivores, but also eat other animals (lizards, snakes, scorpions, spiders, eggs, small mammals, millipedes, centipedes and, more rarely, small birds), plants and fungi (the desert truffle Kalaharituber pfeilii). Like cats, meerkats have binocular vision, their eyes being on the front of their faces. At the end of each of a meerkat's fingers is a claw used for digging burrows and digging for prey. Claws are also used with muscular hindlegs to help climb trees. Meerkats have four toes on each foot and long slender limbs."}, {"url": "http://meerkats.wikia.com/wiki/Meerkat", "passage_text": "10-15 years. The Meerkat (Suricata suricatta) is a small member of the mongoose family, which is part of the Feliformia (cat-like carnivores) order. They are also refered to as suricates, s lender-tailed meerkats and grey meerkats. There is plentiful confusion over the origin of the meerkat's name. The name 'meerkat' is Afrikaans for 'mongoose'. Though unconfirmed, it's a possibility that 'meerkat' derived from the Afrikaan phrase 'meer kat as hund', meaning 'more cat than dog'."}, {"url": "http://www.zoo.org/page.aspx?pid=1888", "passage_text": "Classification and Range. The Meerkat belongs to the family Herpestidae or mongoose family. Meerkats are part of the group of mammals known as carnivores, which means they eat mostly meat. Meerkats dwell in the savannas and grasslands of South Africa, Namibia, Botswana and Angola. Each meerkat family is made up of a breeding pair and their offspring. Only the dominant pair in a colony are usually allowed to mate. Meerkats will mate any time during the year."}, {"url": "http://animals.sandiegozoo.org/animals/meerkat", "passage_text": "Yet meerkats groups have been known to accept outside individuals into their mob, and they sometimes share their burrows with yellow mongooses. Unfortunately for meerkats, they are a tasty treat for larger carnivores, especially jackals, eagles, and falcons. However, meerkats have developed a way to forage in relative safety: adults take turns acting as guard while the others can look for food without worries. At the San Diego Zoo and the San Diego Zoo Safari Park, the meerkats are fed a ground meat diet made especially for zoo carnivores, cat kibble, mealworms, crickets, and small amounts of produce."}]