[{"url": "http://www.answers.com/Q/How_bad_is_alcohol_for_you", "passage_text": "Wine is an Alcohol and it is good for one glass of red wine a day. It helps your heart. When you have alcohol, there are units which represent the amount of Alcohol in a drink. A woman is supposed to have 2- 3 units and 3- 4 units if you are a man. This is as the man's body is larger built so the body can handle more."}, {"url": "http://www.answers.com/Q/How_bad_is_alcohol_for_you", "passage_text": "Alcohol in large amounts can be very bad for you. Alcohol can damage your liver and if you have a lot you get hang over and vomit, it's tear up the lining of your throat."}, {"url": "http://niaaa.nih.gov/alcohol-health/alcohols-effects-body", "passage_text": "Alcohol's Effects on the Body. Drinking too much – on a single occasion or over time – can take a serious toll on your health. Here’s how alcohol can affect your body: Brain: Alcohol interferes with the brain’s communication pathways, and can affect the way the brain looks and works."}, {"url": "http://pubs.niaaa.nih.gov/publications/AlcoholOverdoseFactsheet/Overdosefact.htm", "passage_text": "Heavy or at-risk drinking for women is the consumption of more than 3 drinks on any day or more than 7 per week, and for men it is more than 4 drinks on any day or more than 14 per week. This pattern of drinking too much, too often, is associated with an increased risk for alcohol use disorders."}, {"url": "http://familyshare.com/health/3-reasons-why-drinking-too-much-water-is-bad-for-you", "passage_text": "If you drink too much water too quickly, the blood becomes diluted and the kidneys cannot filter it fast enough to maintain the proper sodium balance, explained Jill Lee in her article,  Can Drinking Too Much Water Hurt Your Kidneys  for Livestrong.com."}, {"url": "http://www.answers.com/Q/Why_is_alcohol_bad_for_you", "passage_text": "In excess, it can be bad for you. For example, being in charge of a vehicle whilst over the legal alcohol limit can lead to hefty fines, disqualification from driving, loss of employment, imprisonment and death. drinking alcahol is bad because alcahol harms your kidney."}, {"url": "http://www.nhs.uk/Livewell/alcohol/Pages/Effectsofalcohol.aspx", "passage_text": "When you drink, alcohol reaches your baby through the placenta. Too much exposure to alcohol can seriously affect your baby's development. If you're pregnant and choose to drink, do not drink more than 1-2 units of alcohol once or twice a week, and do not get drunk. This will minimise the risk to the baby."}, {"url": "http://www.answers.com/Q/Why_is_alcohol_bad_for_you", "passage_text": "Drinking alcohol in moderation is not bad for people. To the contrary, drinking in moderation is associated with better health and greater longevity than is abstaining. However, abusing alcohol can be"}]