[{"url": "http://www.foodnetwork.com/how-to/photos/how-to-hard-boil-and-soft-cook-eggs.html", "passage_text": "Step 1: Place the Eggs in a Pan of Water and Bring to a Boil. For hard-boiled eggs, put the eggs in a pan and cover them with cold water. This way you'll have less of a chance of breaking them. Bring to a boil, put a lid on it and turn off the heat. Let it stand for 10 to 15 minutes."}, {"url": "http://www.foodnetwork.com/how-to/photos/how-to-hard-boil-and-soft-cook-eggs.html", "passage_text": "Lower the heat to a simmer. In about 3 to 4 minutes you'll have the perfect consistency: tender-set egg whites with a creamy yolk. http://foodnetwork.sndimg.com/content/dam/images/food/fullset/2011/7/15/3/HT_Hard-Boil-Beauty-02_s4x3.jpg.rend.snigalleryslide.jpeg."}, {"url": "http://www.thekitchn.com/how-to-boil-eggs-perfectly-every-time-cooking-lessons-from-the-kitchn-202415", "passage_text": "Instructions. 1  Put the eggs in a pan of cold water: Place 6 cold eggs in a saucepan and fill with cold water, covering the eggs by an inch. 2  Bring the water to a rolling boil: Set the pan over high heat and bring the water to a boil, uncovered. 3  Turn off the heat and cover the pan."}, {"url": "http://www.taste.com.au/how+to/articles/2508/how+to+boil+eggs", "passage_text": "Simmer the eggs for 4 minutes for soft-boiled eggs. For semi-firm yolks and hard whites, simmer for 5 minutes. For hard-boiled eggs, simmer for 8 minutes. Use a slotted spoon to remove the egg from the water."}, {"url": "http://www.food.com/recipe/perfect-soft-boiled-eggs-163724", "passage_text": "Cook. When I want a soft boiled egg I want the yolk soft and the white firm. The boiling time has a lot to do with your elevation. 5 minutes is perfect for an elevation of 1100 ft (330 meters) if you are nearer sea level decrease the boiling time if at a higher elevation increase the time."}, {"url": "http://www.marthastewart.com/318797/marthas-soft-boiled-eggs", "passage_text": "Directions. Place eggs in a saucepan large enough to accommodate them in a single layer. Fill the pan with cold water, covering eggs by an inch. Set over medium-high heat, and bring to a boil. Turn off heat, cover, and let stand 1 1/2 to 2 minutes. Remove eggs from water. Serve immediately in egg cups -- perfect for cracking and scooping the egg right from the shell."}]