[{"url": "https://en.wikipedia.org/wiki/Corbin,_Kentucky", "passage_text": "The Whitley County portion of Corbin is the smaller city of the Corbin-London CSA, a Combined Statistical Area that includes the Corbin (Whitley County) and the larger London (Laurel County) micropolitan areas, which had a combined population of 94,486 at the 2010 census."}, {"url": "http://www.golflink.com/golf-courses/course.aspx?course=439245", "passage_text": "The 9-hole Tri-County course at the Tri-County Country Club facility in Corbin, Kentucky features 2,899 yards of golf from the longest tees for a par of 35. The course rating is 33.4 and it has a slope rating of 107. Tri-County golf course opened in 1932. Terry Saylor manages the course as the General Manager."}, {"url": "http://www.homefacts.com/city/Kentucky/Whitley-County/Corbin.html", "passage_text": "Corbin is located in Whitley County, KY. The population is 7,010, making Corbin the largest city in Whitley County. There are 12 public schools in Corbin with an average Homefacts rating of B+. The total crime rate for Corbin is very low, and there are 58 registered sex offenders residing in the city."}, {"url": "https://en.wikipedia.org/wiki/Corbin,_Kentucky", "passage_text": "Corbin is one of the few cities in Kentucky that lie in two counties—Whitley and Knox. Many built-up areas in neighboring Laurel County have a Corbin postal address, but lie outside of the city limits. This arrangement has created some problems with taxes, and also the census records."}, {"url": "http://www.golflink.com/golf-courses/course.aspx?course=439245", "passage_text": "View Scorecard. Input Score. The 9-hole Tri-County course at the Tri-County Country Club facility in Corbin, Kentucky features 2,899 yards of golf from the longest tees for a par of 35. The course rating is 33.4 and it has a slope rating of 107. Tri-County golf course opened in 1932. Terry Saylor manages the course as the General Manager."}, {"url": "https://en.wikipedia.org/wiki/Corbin,_Kentucky", "passage_text": "Corbin is a home rule-class city in Whitley and Knox counties in the southeastern portion of the U.S. state of Kentucky."}, {"url": "http://www.tricountycineplex.com/", "passage_text": "Tri-County Cineplex is conveniently located on U.S. 25/Cumberland Falls Highway at Interstate 75's exit 25 in Corbin, Kentucky and is just a short drive from Barbourville, London, Mt. Vernon, and Williamsburg. Tri-County Cineplex-your best entertainment value in Southeastern Kentucky."}]