[{"url": "http://www.webmd.com/heart-disease/heart-disease-aortic-aneurysm?page=2", "passage_text": "The diagnosis of an aortic aneurysm is difficult because often there are no symptoms. A doctor may find one incidentally during an exam. A thoracic aneurysm may cause a heart murmur. An abdominal aneurysm feels like a pulsating mass in the stomach. If one is detected, it must be monitored. Aneurysms are at higher risk of rupture as they grow larger."}, {"url": "http://www.webmd.com/heart-disease/heart-disease-aortic-aneurysm?page=2", "passage_text": "Aortic aneurysms often cause no symptoms at all. But if present, symptoms include: 1  Tearing pain in the chest, abdomen, and/or middle of the back between the shoulder blades. 2  Thoracic aneurysms may cause shortness of breath, hoarseness, cough (due to pressure on the lungs and airways), and difficulty swallowing (pressure on the esophagus). A thoracic aneurysm may cause a heart murmur. An abdominal aneurysm feels like a pulsating mass in the stomach. If one is detected, it must be monitored. Aneurysms are at higher risk of rupture as they grow larger."}, {"url": "https://uk.answers.yahoo.com/question/index?qid=20070110101603AAdvjhO", "passage_text": "Aneurysms can develop anywhere along the aorta, but mostly occur in the abdominal section and are aptly called abdominal aortic aneurysms. Aneurysms that occur in the upper part of the aorta are called thoracic aortic aneurysms. Aortic aneurysms often grow slowly and usually without symptoms, making them difficult to detect. Not all aortic aneurysms reach the point of rupture. Many start small and stay small, although many expand over time."}, {"url": "http://www.webmd.com/heart-disease/heart-disease-aortic-aneurysm?page=2", "passage_text": "1 Tearing pain in the chest, abdomen, and/or middle of the back between the shoulder blades. 2  Thoracic aneurysms may cause shortness of breath, hoarseness, cough (due to pressure on the lungs and airways), and difficulty swallowing (pressure on the esophagus). A thoracic aneurysm may cause a heart murmur. An abdominal aneurysm feels like a pulsating mass in the stomach. If one is detected, it must be monitored. Aneurysms are at higher risk of rupture as they grow larger."}, {"url": "http://www.hopkinsmedicine.org/heart_vascular_institute/conditions_treatments/conditions/aneurysms.html", "passage_text": "An aneurysm is a weak spot in the wall of a blood vessel, which can cause the blood vessel to bulge. The most common aneurysms occur in the aorta, the large artery that sends blood from the heart to the rest of the body. A ruptured aneurysm can cause hemorrhaging (severe bleeding), which is often fatal. 1 Many aneurysms are caused by atherosclerosis, a buildup of fatty plaque in the artery. 2  People with certain connective tissue disorders may also be at risk. 3  Treatment is based on an aneurysm’s size and rate of growth. 4  Surgery is often needed to repair the aneurysm and avert a potential rupture."}, {"url": "http://www.mayoclinic.org/diseases-conditions/thoracic-aortic-aneurysm/symptoms-causes/dxc-20122022", "passage_text": "Aneurysms that form in the lower part of your aorta — called abdominal aortic aneurysms — are more common than thoracic aortic aneurysms. An aneurysm can also occur in between the upper and lower parts of your aorta. This type of aneurysm is called a thoracoabdominal aneurysm. "}, {"url": "http://www.hopkinsmedicine.org/heart_vascular_institute/conditions_treatments/conditions/aneurysms.html", "passage_text": "1 Aneurysms may be characterized by a severe, pulsing pain in the chest (thoracic aneurysm) or lower back (abdominal aneurysm). 2  Many aneurysms are caused by atherosclerosis, a buildup of fatty plaque in the artery. 3  People with certain connective tissue disorders may also be at risk. 1 Many aneurysms are caused by atherosclerosis, a buildup of fatty plaque in the artery. 2  People with certain connective tissue disorders may also be at risk. 3  Treatment is based on an aneurysm’s size and rate of growth. 4  Surgery is often needed to repair the aneurysm and avert a potential rupture."}, {"url": "http://www.texasheart.org/HIC/Topics/Cond/Aneurysm.cfm", "passage_text": "Related terms: abdominal aortic aneurysm (AAA), aortic aneurysm, aortic dissection, cardiac tamponade, cerebral aneurysm, ventricular aneurysm. An aneurysm is a balloon-like bulge in an artery. Aneurysms can form in arteries of all sizes. An aneurysm occurs when the pressure of blood passing through part of a weakened artery forces the vessel to bulge outward, forming what you might think of as a blister. Not all aneurysms are life-threatening. 1 Aortic aneurysms can occur in the area below the stomach (abdominal aneurysm) or in the chest (thoracic aneurysm). 2  An abdominal aortic aneurysm (AAA) is usually located below the kidneys. 3  Aortic dissection can occur in the aorta and its main branches."}, {"url": "http://www.hopkinsmedicine.org/heart_vascular_institute/conditions_treatments/conditions/aneurysms.html", "passage_text": "Aortic Aneurysm: What You Need to Know. 1  Aneurysms may be characterized by a severe, pulsing pain in the chest (thoracic aneurysm) or lower back (abdominal aneurysm). 1 Many aneurysms are caused by atherosclerosis, a buildup of fatty plaque in the artery. 2  People with certain connective tissue disorders may also be at risk. 3  Treatment is based on an aneurysm’s size and rate of growth. 4  Surgery is often needed to repair the aneurysm and avert a potential rupture."}, {"url": "http://www.webmd.com/heart-disease/tc/aortic-aneurysm-overview", "passage_text": "An aortic aneurysm (say a-OR-tik AN-yuh-rih-zum) is a bulge in a section of the aorta, the body's main artery. The aorta carries oxygen-rich blood from the heart to the rest of the body. Because the section with the aneurysm is overstretched and weak, it can burst. Blood flow often slows in the bulging section of an aortic aneurysm, causing clots to form. If a blood clot breaks off from an aortic aneurysm in the chest area, it can travel to the brain and cause a stroke. Blood clots that break off from an aortic aneurysm in the belly area can block blood flow to the belly or legs."}]