[{"url": "http://www1.salary.com/Anesthesia-Technician-salary.html", "passage_text": "The annual salary for someone with the job title Anesthesia Technician may vary depending on a number of factors including industry, company size, location, years of experience and level of education. For example the median expected annual pay for a typical Anesthesia Technician in the United States is $38,037, so 50% of the people who perform the job of Anesthesia Technician in the United States are expected to make less than $38,037. Source: HR Reported data as of October 2015. 1  Salary. 2  Salary + Bonus. 3  Benefits"}, {"url": "http://www.healthcareworkersalary.com/technicians-and-technologists/anesthesia-technician-salary/", "passage_text": "The annual basic median anesthesia technician salary in this state is roughly $39,082. Florida. These professionals operating within the confines of the state of Florida make an annual basic salary that can lie between the ranges of $27,039 – $46,683. The annual median salary for this state falls around $35,533. An anesthesia technician working in the state of California and particularly in Los Angeles city, can expect to take home an annual salary that can fall between the range of $29,741 – $51,347."}, {"url": "http://www.healthcare-salaries.com/technicians/anesthesia-technician-salary", "passage_text": "Overtime, a starting annual wage for an anesthesia technician increases for up to $8.30 – $28.19 per hour thus averaging to a total annual salary ranging from $22,360 – $46,486. Read more about anesthesia technician salary, anesthesia technician certification and training. An anesthesia technician with 1 to 4 years of clinical experience earns an annual salary ranging from $29,479 – $45,781 while the one with 5 to 9 years of experience receives an average yearly salary from$28,658 – $42,000. 1  Share on Facebook. 2  Share on Twitter. 3  Share on Google+."}, {"url": "http://www.payscale.com/research/US/Job=Anesthesia_Technician/Hourly_Rate", "passage_text": "Anesthesia Technician Salary. (United States). The average pay for an Anesthesia Technician is $15.30 per hour. Most people with this job move on to other positions after 20 years in this career."}, {"url": "http://www.healthcareworkersalary.com/technicians-and-technologists/anesthesia-technician-salary/", "passage_text": "An anesthesia technician salary in the state of Georgia often can vary from $27,343 -$47,206 each year. The annual median salary for such professionals in this state is roughly $35,931. An anesthesia technician working in the state of California and particularly in Los Angeles city, can expect to take home an annual salary that can fall between the range of $29,741 – $51,347."}, {"url": "http://www.healthcareworkersalary.com/technicians-and-technologists/anesthesia-technician-salary/", "passage_text": "An anesthesia technician salary in the state of New York is often between $32,139 -$55,487, which is arguably one of the highest compensation that these professionals can receive in the US. The annual basic median salary for New York is around $ 42,234. An anesthesia technician working in the state of California and particularly in Los Angeles city, can expect to take home an annual salary that can fall between the range of $29,741 – $51,347."}, {"url": "http://www.simplyhired.com/salaries-k-anesthesia-technician-jobs.html", "passage_text": "The average salary for anesthesia technician jobs is $37,000. Average anesthesia technician salaries can vary greatly due to company, location, industry, experience and benefits. This salary was calculated using the average salary for all jobs with the term anesthesia technician anywhere in the job listing."}, {"url": "http://www.healthcare-salaries.com/technicians/anesthesia-technician-salary", "passage_text": "Anesthesia technician salary. Anesthesia technician’s salary (also known as anesthesia tech salary) in the United States according to the Bureau of Labor Statistics $38,740 per year and an hourly wage ranges from $10.51 – $20.03 per hour. An anesthesia technician with 1 to 4 years of clinical experience earns an annual salary ranging from $29,479 – $45,781 while the one with 5 to 9 years of experience receives an average yearly salary from$28,658 – $42,000. 1  Share on Facebook. 2  Share on Twitter. 3  Share on Google+."}]