[{"url": "http://www.answers.com/Q/What_is_beyblade", "passage_text": "Beyblade are toys based on ancient spinning tops. There are 3 main parts: Launcher, Rip Cord, and Blade. For the plastics blades there are: Bit beast, attack ring, defense ring, and base. The series coming in Spring 2010 have 4 parts: Face, MetalWheel (Clear Wheel Sometimes), track, and tip. The point of the game is to have the last blade standing. Oh and there is 4 types: Attack, Defense, Endurance/Stamina, and Balance. Beyblades are modifyed tops with a facebolt,energy ring,fusion wheel,spin track, and tip(in order). In the show they are tops that have special powers in battle. The real ones … are tops with a code for the online wedpage."}, {"url": "http://www.urbandictionary.com/define.php?term=beyblade", "passage_text": "2. beyblade. A customizable spinning battle top (or high preformance) with a spin blade base, spin gear, weight disk, attack ring, aqnd usually a but chip with a bit-beast used in a beystadium against other beyblade. It is also a show about some kids who beyblade called the baldebreakers. Kai is the hottest ^_^"}, {"url": "http://beyblade.wikia.com/wiki/Beyblade_(toy)", "passage_text": "The introduction of the toy corresponded with the broadcast. of the Beyblade anime television series of the same name. In 2002, Hasbro began to sell Beyblade toys internationally (under license from, and produced by, Takara) along with a coordinated country-by-country rollout of localized versions of the TV series. Spin Track: The Spin Track is the component of the Beyblade that connects the Fusion Wheel and Performance Tip. The Spin Track determines the height of the Beyblade. Their names (when read with a decimal before the last digit) determine their height in millimeters."}, {"url": "http://www.qwhatis.com/what-is-a-beyblade/", "passage_text": "Beyblade toys and merchandise also became a big hit for die-hard “beyblading” fans. There are also online communities and fan sites to interact with other beybladers around the globe and to play the online version of the game. If you like this article or our site. Please spread the word. The main character of the series is Takao Kinomiya, which is renamed to Tyson Granger for the American market. He has a beyblade named Dragoon and a sidekick named Kyonuju, which is Kenny in the Amercian version. In the early part of the story, Takao/Tyson’s dream is to become the best beyblader in the world and he strives hard to achieve this goal all throughout the series"}, {"url": "https://en.wikipedia.org/wiki/Beyblade_(toy)", "passage_text": "Beyblade HMS (Hard Metal System) is a line of Beyblade toys released after the Engine Gear line of blades in respect to the anime series. This series, unlike ones in the past, use smaller pieces made mostly of metal. 1 Blade Base (BB) : The Blade Base determines how the Beyblade spins, and also affects its movement pattern. 2  The Blade Base determines the direction of the Beyblade's rotation; either clockwise (right) or counterclockwise (left) dependent on what Spin Gear is used."}, {"url": "https://en.wikipedia.org/wiki/Beyblade_(toy)", "passage_text": "Beyblade is a brand name for a line of spinning top toys originally developed and manufactured by Takara Tomy, first released in 2000. The toys usually include a 'launcher' – a device for bringing the spinning top up to speed, with either a separate or integral rip-cord. 1 Blade Base (BB) : The Blade Base determines how the Beyblade spins, and also affects its movement pattern. 2  The Blade Base determines the direction of the Beyblade's rotation; either clockwise (right) or counterclockwise (left) dependent on what Spin Gear is used."}, {"url": "http://www.qwhatis.com/what-is-a-beyblade/", "passage_text": "Beyblade refers to the manga series in Japan or the toys that came along with it as merchandise. This particular manga or comic book series has 14 volumes and became widely popular among Japanese kids since the first release in 1999. The main character of the series is Takao Kinomiya, which is renamed to Tyson Granger for the American market. He has a beyblade named Dragoon and a sidekick named Kyonuju, which is Kenny in the Amercian version. In the early part of the story, Takao/Tyson’s dream is to become the best beyblader in the world and he strives hard to achieve this goal all throughout the series"}, {"url": "https://en.wikipedia.org/wiki/Beyblade_(toy)", "passage_text": "The introduction of the toy corresponded with the broadcast of the Beyblade anime television series of the same name. In 2002, Hasbro began to sell Beyblade toys internationally (under license from, and produced by, Takara) along with a coordinated country-by-country rollout of localized versions of the TV series. 1 Blade Base (BB) : The Blade Base determines how the Beyblade spins, and also affects its movement pattern. 2  The Blade Base determines the direction of the Beyblade's rotation; either clockwise (right) or counterclockwise (left) dependent on what Spin Gear is used."}]