[{"url": "http://abcnews.go.com/Business/walmart-ceo-pay-hour-workers-year/story?id=11067470", "passage_text": "A second Walmart cause concern for Chicago locals. Walmart, meanwhile, said that its wages across the country are competitive in local markets and that on average, hourly employee pay -- which includes more experienced workers but not managers -- ranges from $10 to more than $12. He, too, would have liked to see the retailer pay at least $11 an hour to new employees, but added that he's glad Walmart's $8.75 starting pay is above minimum wage."}, {"url": "http://www.usatoday.com/story/money/2015/02/19/walmart-employees-raises/23666047/", "passage_text": "Full-time employees currently make an average of $12.85 an hour, and part-time employees make an average of $9.48, Lundberg says. Those averages will increase to $13 and $10 respectively under the new plan. That's at least $1.75 more than the federal minimum hourly wage of $7.25. By February 2016, hourly employees will make at least $10 an hour after completing about six months of training."}, {"url": "http://www.answers.com/Q/How_much_does_a_walmart_employee_make", "passage_text": "How much do Walmart employees get paid in the US?   * In 2001, sales associates, the most common job in Wal-Mart, earned on average $8.23 an hour for annual wages of $13,861. The 2001 poverty line for a family of three wa … s $14,630. The average Walmart employee makes between 1400-1600 a month .this amount is before taxes. It is very difficult to work in this company knowing what you have to put up w … ith in order to make the pennies these tightwads want to give to their associates."}, {"url": "http://www.answers.com/Q/How_much_money_does_the_average_walmart_employee_make_a_month", "passage_text": "How much money does a Lowe's employee make? The prevailing wage or minimum wage would apply. The reported averages from this year are from $ 9.34 an hour for retail cashiers to $ 13.20 or $ 13.24 an hour for Sales Speci … alists and Associates. Making the world better, one answer at a time. The average Walmart employee makes between 1400-1600 a month .this amount is before taxes. It is very difficult to work in this company knowing what you have to put up with in order to make the pennies these tightwads want to give to their associates."}, {"url": "http://www.answers.com/Q/How_much_does_a_walmart_employee_make", "passage_text": "In Jobs for Teens. How much Walmart employees get paid varies with the type of  position they hold and how long they have worked for Walmart. On  average, a new employee earns about 7 dollars … to about 18 dollars  per hour. The average Walmart employee makes between 1400-1600 a month .this amount is before taxes. It is very difficult to work in this company knowing what you have to put up w … ith in order to make the pennies these tightwads want to give to their associates."}, {"url": "http://www.usatoday.com/story/money/2015/02/19/walmart-employees-raises/23666047/", "passage_text": "After years of employee protests and outrage over meager pay, Walmart said Thursday that it will spend $1 billion this year to give raises to half-a-million workers. About 500,000 full-and part-time associates at both Walmart and the company's Sam's Club warehouse stores will start making $9 an hour or more in April. That's at least $1.75 more than the federal minimum hourly wage of $7.25. By February 2016, hourly employees will make at least $10 an hour after completing about six months of training."}, {"url": "http://www.businessinsider.com/walmart-employees-pay", "passage_text": "In other words, if Walmart decided to use 100% of its operating profit to pay all of its employees more, the average store associate's salary would go from $20,000 to $30,000. If Walmart paid bosses like CEO Mike Duke less (Duke made $6 million last year) that would create some more operating profit. And right now, many people argue, Walmart is very much part of the problem. The average Walmart associate, Wake Up Walmart reports, makes $11.75 an hour. That's $20,744 per year. Those wages are slightly below the national average for retail employees, which is $12.04 an hour. They also produce annual earnings that, in a one-earner household, are below the $22,000 poverty line"}, {"url": "http://www.usatoday.com/story/money/2015/02/19/walmart-employees-raises/23666047/", "passage_text": "Walmart shares closed down 3.21% in afternoon trading to $83.52. Walmart employs more than 1.3 million people in the U.S. Of the 500,000 employees getting raises, approximately 6,000 currently make the federal minimum of $7.25 an hour, says spokesperson Kory Lundberg. That's at least $1.75 more than the federal minimum hourly wage of $7.25. By February 2016, hourly employees will make at least $10 an hour after completing about six months of training."}]