[{"url": "http://www.nejm.org/doi/full/10.1056/NEJM199603073341007", "passage_text": "Results. For all emergency department visits, the average charge was $383, the average cost was $209, and the marginal cost was $88 (42 percent of the average cost). Thirty-two percent of the visits were classified as nonurgent, 26 percent as semiurgent, and 42 percent as urgent. The average total charge, including hospital and physicians' charges, for the 24,010 visits was $383.29, the average direct cost was $166.28, the average total cost (direct plus indirect) was $209.42, and the marginal cost was $87.6"}, {"url": "http://www.consumerhealthratings.com/index.php?action=showSubCats&cat_id=274", "passage_text": "Average expenses for people who had one or more visits to the Emergency Room were $1318 in 2009, according to the Medical Expenditure Panel Survey (MEPS). Median, or typical, cost was $615. For people ages 45 to 64, the cost was substantially higher on average ($1696). An average physician office visit in 2008 cost $199, compared to $922 for an Emergency Room visit (median was $89 for doctor's visit, vs. $422 for ER). Top 5 conditions shown for each ambulatory care visit type. Consumers should expect considerably higher prices since 2008."}, {"url": "http://health.costhelper.com/emergency-room.html", "passage_text": "1 An emergency room visit typically is covered by health insurance. 2  For patients covered by health insurance, out-of-pocket cost for an emergency room visit typically consists of a copay, usually $50-$150 or more, which often is waived if the patient is admitted to the hospital. 1 At Dartmouth-Hitchcock Medical Center, a low-level emergency room visit costs about $220, including hospital charge and doctor fee, with the uninsured discount, while a moderate-level visit costs about $610 and a high-level visit about $1,400. 2  Services, diagnostic tests and laboratory fees add to the final bill."}, {"url": "http://health.costhelper.com/emergency-room.html", "passage_text": "1 For patients without health insurance, an emergency room visit typically costs from $150-$3,000 or more, depending on the severity of the condition and what diagnostic tests and treatment are performed. 1 At Dartmouth-Hitchcock Medical Center, a low-level emergency room visit costs about $220, including hospital charge and doctor fee, with the uninsured discount, while a moderate-level visit costs about $610 and a high-level visit about $1,400. 2  Services, diagnostic tests and laboratory fees add to the final bill."}, {"url": "http://www.howmuchisit.org/emergency-room-visit-cost/", "passage_text": "1 According to the website Consumer Health Ratings, the cost of an emergency room visit can range anywhere from $1,800 to $5,000. 2  Keep in mind that these prices can include overnight stays, x-rays, blood work and more. 1 The cost would also vary depending on the type of tests that will be performed to the patient; this will vary based on the type of injury or ailment the patient has sustained. 2  On average, plan on spending anywhere from $300 to as much as $1,000 just for a basic emergency room visit."}, {"url": "http://www.nejm.org/doi/full/10.1056/NEJM199603073341007", "passage_text": "Discussion. This study shows that the average cost of a nonurgent visit to an emergency department is much lower than commonly believed, and the marginal cost of a nonurgent visit is about $25. For all 24,010 visits, the average cost was 55 percent of the average charge. The average total charge, including hospital and physicians' charges, for the 24,010 visits was $383.29, the average direct cost was $166.28, the average total cost (direct plus indirect) was $209.42, and the marginal cost was $87.68 (42 percent of the average cost)."}, {"url": "http://www.consumerhealthratings.com/index.php?action=showSubCats&cat_id=274", "passage_text": "Find the average cost of an emergency room (ER / ED) visit at each Florida hospital in 2011-2012. North Florida Regional Medical Center in Gainsville had the highest average charge in FL at $8342 per ER visit in 2011 through first quarter 2012. Only 6 hospitals had an average charge under $1000. An average physician office visit in 2008 cost $199, compared to $922 for an Emergency Room visit (median was $89 for doctor's visit, vs. $422 for ER). Top 5 conditions shown for each ambulatory care visit type. Consumers should expect considerably higher prices since 2008."}, {"url": "http://health.costhelper.com/emergency-room.html", "passage_text": "1 For patients covered by health insurance, out-of-pocket cost for an emergency room visit typically consists of a copay, usually $50-$150 or more, which often is waived if the patient is admitted to the hospital. 2  Depending on the plan, costs might include coinsurance of 10% to 50%. 1 At Dartmouth-Hitchcock Medical Center, a low-level emergency room visit costs about $220, including hospital charge and doctor fee, with the uninsured discount, while a moderate-level visit costs about $610 and a high-level visit about $1,400. 2  Services, diagnostic tests and laboratory fees add to the final bill."}]