[{"url": "http://www.carsdirect.com/car-repair/5-causes-of-engine-vibration", "passage_text": "Loose or disconnected hoses can also be a common cause of many types of engine vibration. A loose or disconnected air hose or vacuum hose can cause quite a bit of violent shaking and vibration in your car's engine. To correct the problem, simply look for any loose or disconnected hoses and reattach them and replace them as needed."}, {"url": "http://www.freeasestudyguides.com/engine-mount-vibration.html", "passage_text": "Engine mounts prevent engine vibrations from transferring to the passenger compartment. This is one of the most common causes for engine vibration; this is especially true in front wheel drive vehicles. Many of today's engines have a balance shaft to keep engine vibrations to a minimum. They work like a counter weight to the engines crankshaft."}, {"url": "http://www.carsdirect.com/car-repair/5-causes-of-engine-vibration", "passage_text": "Sometimes, idling problems that cause engine vibration may be as simple as adjusting the idle on a carburetor or cleaning components in the fuel intake system so that fuel passes through the engine more easily creating cleaner and more efficient combustion your car's engine."}, {"url": "http://www.carsdirect.com/car-repair/5-causes-of-engine-vibration", "passage_text": "In many vehicles a common cause of engine vibration is worn out or faulty sparkplugs. Worn out or dirty sparkplugs will cause the car's engine to misfire or not properly fire on each and every cylinder. When this occurs, it is commonly referred to as the engine missing or not firing on all cylinders."}, {"url": "http://ecmweb.com/motors/basic-motor-vibration-troubleshooting-tips", "passage_text": "Because the causes of machine vibration are so numerous, the underlying problem is often difficult to isolate. Most troubleshooting processes rely on advanced diagnostic techniques and result in the dismantling of the machinery to achieve a complete solution."}, {"url": "http://ecmweb.com/motors/basic-motor-vibration-troubleshooting-tips", "passage_text": "Even though the causes of motor vibration seem almost endless, with a few straightforward checks and an inquisitive attitude, you can minimize risk during motor and train startup and maximize overall reliability of the equipment."}, {"url": "http://www.premierservicecenter.com/some-main-causes-of-car-vibration/", "passage_text": "Mostly, the vibration in car is caused by the damaged or unbalanced wheels or tires. In addition, the damage on the suspension, drivetrain, and steering components can also cause the annoying vibrations. However, there are some other causes of car vibrations. You can see in the following account."}, {"url": "http://www.carsdirect.com/car-repair/5-causes-of-engine-vibration", "passage_text": "5 Causes of Engine Vibration. There are several common causes of engine vibration in a car, and they all result in shaking and noises that can be quite alarming and sometimes scary."}]