[{"url": "http://www.ideafinder.com/history/inventions/wheel.htm", "passage_text": "From tiny watch gears to automobiles, jet engines and computer disk drives, the principle is the same. Based on diagrams on ancient clay tablets, the earliest known use of this essential invention was a potters wheel that was used at Ur in Mesopotamia (part of modern day Iraq} as early as 3500 BC. The first use of the wheel for transportation was probably on Mesopotamian chariots in 3200 BC. "}, {"url": "http://sumerians.wikispaces.com/Inventions-The+Wheel-Nika", "passage_text": "The invention of the wheel is probably the most important invention of the Mesopotamians. Without the wheel, the world simply wouldn't exist as we know it. The invention of the wheel was one of the most important inventions because now days we see that without this invention our life would’ve been much harder. "}, {"url": "http://www.answers.com/Q/How_did_Mesopotamians_use_the_wheel", "passage_text": "Answer: -They would kick the wheel to make the pottery wheel spin. -Mesopotamians used the sledge to cut wood or grooves, it was kind of like a sled and a wedge put together. - The chariot was used in the army, (it just has wheels on it like how there are wheels on cars)."}, {"url": "http://www.ancientmesopotamians.com/mesopotamia-wheels.html", "passage_text": "It was one of the biggest achievements in history. The earliest known use of this essential invention was a potter's wheel that was used at Ur in Mesopotamia as early as 3500 BC. The first use of the wheel for transportation was on Mesopotamian chariots in 3200 BC. Along with the various other inventions Mesopotamia is well known for the unique and an important invention of the wheels. The wheels were invented by the Sumerians around 3500 BC. The wheel is a cylinder shaped object that rolls fairly easily. The first wheel was made from clay, rock and mud which slowly developed to the making of wheels by joining together of wooden planks. They connected it to vehicles called chariots"}, {"url": "https://en.wikipedia.org/wiki/Mesopotamia", "passage_text": "Widely considered to be the cradle of civilization by the Western world, Bronze Age Mesopotamia included Sumer and the Akkadian, Babylonian, and Assyrian empires, all native to the territory of modern-day Iraq. In the Iron Age, it was controlled by the Neo-Assyrian and Neo-Babylonian Empires. The indigenous Sumerians and Akkadians (including Assyrians and Babylonians) dominated Mesopotamia from the beginning of written history (c. 3100 BC) to the fall of Babylon in 539 BC, when it was conquered by the Achaemenid Empire."}, {"url": "http://www.ancient-origins.net/ancient-technology/revolutionary-invention-wheel-001713", "passage_text": "Nevertheless, the wheel (specifically as a means of transportation) was actually invented at a relatively late point of human history. The oldest known wheel found in an archaeological excavation is from Mesopotamia, and dates to around 3500 BC. This period was known as the Bronze Age, which is a relatively late chapter in the story of the development of human civilisation. One of these is the wheel. Take a look around, and you will see wheels everywhere, be it as tyres, or in everyday machinery. The wheel has even been imbued with symbolic meanings, most famously, perhaps, as a metaphor for the never ending cycle of life."}, {"url": "https://kidskonnect.com/history/ancient-mesopotamia/", "passage_text": "1 Most of Ancient Mesopotamia was located in what today is the country of Iraq. 2  Mesopotamia was known as the land between two rivers. 3  The Tigris River ran along the north and the Euphrates River ran along the south. 4  These rivers flow into the Persian Gulf. 5  The area is also known as “The Fertile Crescent”. 1 Mesopotamia was known as the land between two rivers. 2  The Tigris River ran along the north and the Euphrates River ran along the south. 3  These rivers flow into the Persian Gulf. 4"}, {"url": "http://www.ancient-origins.net/ancient-technology/revolutionary-invention-wheel-001713", "passage_text": "A Mesopotamian wheel. Photo source. One of the reasons why the wheel was invented only at this point in history is due to the fact that metal tools were needed to chisel fine-fitted holes and axles. This leads to the next reason – the wheel was not just a cylinder rolling on its edge. One of these is the wheel. Take a look around, and you will see wheels everywhere, be it as tyres, or in everyday machinery. The wheel has even been imbued with symbolic meanings, most famously, perhaps, as a metaphor for the never ending cycle of life."}, {"url": "http://www-news.uchicago.edu/releases/03/oi/030715.oi-firsts.shtml", "passage_text": "1 The wheel: The ancient Mesopotamians were using the wheel by about 3,500 B.C. 2  They used the potter’s wheel to throw pots and wheels on carts to transport both people and goods. 3  This invention had an impact on ceramic technology, trade, and warfare in the early city-states. "}]