[{"url": "http://www.arthritis.org/about-arthritis/where-it-hurts/hip-pain/causes/", "passage_text": "Hip joint pain, hip arthritis pain & other hip diseases. Many forms of arthritis & related conditions that affect the joint, muscles & bones can cause hip pain, stiffness & swelling."}, {"url": "http://www.medicinenet.com/hip_pain/symptoms.htm", "passage_text": "Pain in the hip can result from a number of factors. Abnormalities of the skin, nerves, bones, joints, blood vessels, and soft tissues of the hip can all result in pain. Sometimes diseases that affect other joints in the body, such as the inflammation resulting from arthritis, can be the cause of pain in the hip."}, {"url": "http://www.mayoclinic.org/symptoms/hip-pain/basics/definition/SYM-20050684", "passage_text": "Hip pain on the outside of your hip, upper thigh or outer buttock is usually caused by problems with muscles, ligaments, tendons and other soft tissues that surround your hip joint. Hip pain can sometimes be caused by diseases and conditions in other areas of your body, such as your lower back or your knees. This type of pain is called referred pain. Most hip pain can be controlled with self-care at home. 1  Causes."}, {"url": "http://www.medicinenet.com/hip_pain/symptoms.htm", "passage_text": "Hip pain may also occur because of a problem with the back or spine. Depending upon the cause of hip pain, the pain may occur when walking, running, or engaging in activity. Bursitis of one of the two bursae of the hip (sacs that provide cushioning between bones and tissues) can cause hip pain."}, {"url": "https://neckandback.com/conditions/causes-of-lower-back-pain/", "passage_text": "Pain in the lower back has a multitude of causes. The discs, facets, pars interarticularis, sacroiliac joints, hip joints and nerves can all cause a form of lower back pain. Even compression fractures at T12 and a high grade thoracic hyperkyphosis (increased thoracic curve) can cause"}, {"url": "https://www.nlm.nih.gov/medlineplus/ency/article/003179.htm", "passage_text": "Hip pain may be caused by problems in the bones or cartilage of your hip. 1  Hip fractures can cause of sudden hip pain. 2  These injuries can be a serious and lead to major problems. 3  Hip fractures are more common as people get older because falls are more likely and your bones become weaker."}, {"url": "http://www.spine-health.com/conditions/arthritis/hip-osteoarthritis", "passage_text": "View ArthritisVideos. Hip osteoarthritis, a breakdown of cartilage in the hip joint, can often cause symptoms of back, hip, and leg pain. Often, patients with arthritis in the back will also have it in other joints, and it can be difficult to distinguish which area may in fact be the cause of the patient's pain."}]