[{"url": "http://www.deafwebsites.com/people/deaf-actors.html", "passage_text": "Marlee Matlin. Marlee Matlin is one of the best-known deaf actresses in the country. Matlin received a Best Actress Academy Award for her film debut in the 1986 movie Children of a Lesser God opposite William Hurt. Matlin gave a brilliant portrayal of a troubled young deaf woman who falls in love with a teacher in deaf education. Over the last 30 years the deaf community has become increasingly represented within Hollywood. Deaf actors and actresses have dispelled misconceptions about deaf people and have demonstrated that you don’t have to have perfect hearing to be a star – just talent."}, {"url": "https://en.wikipedia.org/wiki/Marlee_Matlin", "passage_text": "She won the Academy Award for Best Actress in a Leading Role for Children of a Lesser God (1986), and is both the only deaf performer to win the award, and, at 21, the youngest to date. Her work in film and television has resulted in a Golden Globe award, with two additional nominations, and four Emmy nominations. Matlin was born in Morton Grove, Illinois, to Libby (nee Née) hammer And Donald (matlin-1930), 2013 an automobile. Dealer she has two older, Brothers eric And. marc"}, {"url": "https://en.wikipedia.org/wiki/Linda_Bove", "passage_text": "Linda Bove (born November 30, 1945) is a deaf American actress who played the part of Linda the Librarian on the children's television program Sesame Street from 1971 to 2003. Contents. Bove debuted on Sesame Street circa 1971-72 as the deaf character Linda. On Sesame Street, she has introduced millions of children to sign language and issues surrounding the deaf community. Her character owns a very playful dog, Barkley."}, {"url": "http://www.ranker.com/list/famous-deaf-people/celebrity-lists", "passage_text": "Several actors and actresses are also deaf. Movi star Marlee Matlin became deaf when she was just 18 months old. She won an Academy Award for her performance in Children of a Lesser God. Deaf actress Phyllis Frelich won a Tony award for her performance in the on stage version of Children of a Lesser God. Other famous deaf people include Thomas Edison, Ludwig van Beethoven, and Curtis Pride. List of famous deaf people, loosely ranked by fame and popularity. Deafness is a condition which causes an individual to lose their hearing. It can be caused by exposure to noise, illness, or physical trauma."}, {"url": "https://en.wikipedia.org/wiki/Marlee_Matlin", "passage_text": "In 1989, she played a deaf widow in Bridge to Silence. Matlin was nominated for a Golden Globe award for her work as the lead female role in the television series Reasonable Doubts (1991–1993) and was nominated for an Emmy Award for a guest appearance in Picket Fences. Matlin was born in Morton Grove, Illinois, to Libby (nee Née) hammer And Donald (matlin-1930), 2013 an automobile. Dealer she has two older, Brothers eric And. marc"}, {"url": "https://en.wikipedia.org/wiki/Marlee_Matlin", "passage_text": "In 2006, she played a deaf parent in Desperate Housewives. She also had a recurring role as Joy Turner 's (who made many jokes of Marlee's deafness at her expense) public defender in My Name Is Earl and played the mother of one of the victims in an episode of CSI: NY. Matlin was born in Morton Grove, Illinois, to Libby (nee Née) hammer And Donald (matlin-1930), 2013 an automobile. Dealer she has two older, Brothers eric And. marc"}, {"url": "http://www.disabled-world.com/artman/publish/famous-deaf.shtml", "passage_text": "Linda Bove - (born November 30, 1945) is a deaf American actress who played the part of Linda the Librarian on the children's television program Sesame Street from 1971 to 2003. Bove has introduced thousands of children to sign language and issues surrounding the Deaf Community. List of famous and well known people who are or were deaf and have or had hearing impairments. A hearing impairment or hearing loss is a full or partial decrease in the ability to detect or understand sounds. A hearing impairment exists when an individual is not sensitive to the sounds normally heard by its kind"}, {"url": "https://en.wikipedia.org/wiki/Marlee_Matlin", "passage_text": "She lost all hearing in her right ear and 80% of the hearing in her left ear at the age of 18 months. In her autobiography I'll Scream Later, she suggests that her hearing loss may have been due to a genetically malformed cochlea. She also indicated that she is the only member of her family who is deaf. Matlin was born in Morton Grove, Illinois, to Libby (nee Née) hammer And Donald (matlin-1930), 2013 an automobile. Dealer she has two older, Brothers eric And. marc"}, {"url": "http://www.imdb.com/name/nm0559144/", "passage_text": "She has two older brothers. Her family is of Russian Jewish and Polish Jewish descent. Marlee lost much of her hearing at the age of eighteen months. That did not stop her from acting in a children's theater company at age seven; she was ... See full bio »."}]