[{"url": "http://watershipdown.wikia.com/wiki/Bigwig", "passage_text": "Bigwig in the snare. When Fiver interjects, Bigwig carries on traveling with the others. He and the others travel along in a ditch, when Bigwig hears something calling his name. He becomes frightened, hiding behind the others, and become convinced that the Black Rabbit of Inle is calling for him. Film Edit. Bigwig listens to Hazel and Fiver in the Threarah's burrow. In the film, Bigwig retains his book personality. He is strong and brave, but is also impatient and at first unwilling to trust in Fiver's visions, however, he and the others come to trust in Fiver and respect Hazel's authority."}, {"url": "http://watershipdown.wikia.com/wiki/Bigwig", "passage_text": "In the TV series, Bigwig is large, loyal, and strong rabbit, with a large mane of fur around his neck and shoulders, thus, making him most likely a Lion Headed Rabbit. At first he and Hazel have differences over who is the leader, but Bigwig eventually tells Hazel that it is not him, and that Hazel should lead. Film Edit. Bigwig listens to Hazel and Fiver in the Threarah's burrow. In the film, Bigwig retains his book personality. He is strong and brave, but is also impatient and at first unwilling to trust in Fiver's visions, however, he and the others come to trust in Fiver and respect Hazel's authority."}, {"url": "http://www.genome.ucsc.edu/goldenPath/help/bigWig.html", "passage_text": "To create a bigWig track from a wiggle file, follow these steps: 1  Create a wig format file following the directions here. 2  Note that when converting a wig file to a bigWig file, you are limited to one track of data in your input file; you must create a separate wig file for each data track. The main advantage of the bigWig files is that only the portions of the files needed to display a particular region are transferred to UCSC, so for large data sets bigWig is considerably faster than regular wiggle files. The bigWig file remains on your web accessible server (http, https, or ftp), not on the UCSC server."}, {"url": "http://www.thefreedictionary.com/bigwig", "passage_text": "Noun. 1. bigwig-the most important person in a group or undertaking. kingpin, top banana. important person, influential person, personage-a person whose actions and opinions strongly influence the course of events. bigwig. n. 1. an important person. (ˈbɪgˌwɪg). n."}, {"url": "http://www.genome.ucsc.edu/goldenPath/help/bigWig.html", "passage_text": "1 Note that when converting a wig file to a bigWig file, you are limited to one track of data in your input file; you must create a separate wig file for each data track. 2  Note that this is the file that is referred to as. The main advantage of the bigWig files is that only the portions of the files needed to display a particular region are transferred to UCSC, so for large data sets bigWig is considerably faster than regular wiggle files. The bigWig file remains on your web accessible server (http, https, or ftp), not on the UCSC server."}, {"url": "http://watershipdown.wikia.com/wiki/Bigwig", "passage_text": "Bigwig is a large and strong rabbit known for the tuft of hair on his head from which his Lapine name, Thlayli (literally translating to fur-head), is derived. He was part of the Sandleford Owsla with Silver and Captain Holly. He with several others left with Hazel and Fiver. Film Edit. Bigwig listens to Hazel and Fiver in the Threarah's burrow. In the film, Bigwig retains his book personality. He is strong and brave, but is also impatient and at first unwilling to trust in Fiver's visions, however, he and the others come to trust in Fiver and respect Hazel's authority."}, {"url": "http://www.merriam-webster.com/dictionary/bigwig", "passage_text": "Full Definition of BIGWIG. : an important person. See bigwig defined for English-language learners. See bigwig defined for kids. ADVERTISEMENT. Rhymes with BIGWIG. bagwig, bushpig, cat rig, Danzig, earwig, fright wig, Gehrig, hedgepig, Leipzig, lime-twig, pfennig, renege, Schleswig, shindig, square rig, unrig, zaftig."}]