[{"url": "https://www.calcxml.com/calculators/how-much-will-my-company-bonus-net-after-taxes", "passage_text": "A bonus from your employer is always a good, however, you may want to estimate what you will actually take-home after federal withholding taxes, social security taxes and other deductions are taken out. Use this calculator to help determine your net take-home pay from a company bonus. Amount of bonus ($). "}, {"url": "http://www.employmentspot.com/employment-articles/salary-after-taxes/", "passage_text": "By using these after tax income calculators to calculate your salary after taxes, you can get a better idea of what to expect when your paycheck comes. This may help you budget and plan your finances. Your $40,000 salary probably seems a lot lower when you consider the reality of your net salary after taxes."}, {"url": "http://www.employmentspot.com/employment-articles/salary-after-taxes/", "passage_text": "While there may be dollar signs in your eyes when you are given news of a job offer or promotion, you might not be as happy when your paycheck comes in the mail. Your $40,000 salary probably seems a lot lower when you consider the reality of your net salary after taxes. If you want to know what to expect before viewing the damages when your check comes in the mail, there is a way you can calculate after tax income"}, {"url": "http://www.adp.com/tools-and-resources/calculators-and-tools/payroll-calculators.aspx", "passage_text": "Hourly Paycheck Calculator Enter up to six different hourly rates to estimate after-tax wages for hourly employees. Gross Pay Calculator. Plug in the amount of money you'd like to take home each pay period and this calculator will tell you what your before-tax earnings need to be. If you are an employee of a non-profit organization, calculate how much of your income you should defer through your organization's 403(b) plan to prepare for retirement. Employee Stock Option Calculator Estimate the after-tax value of non-qualified stock options — before cashing them in."}, {"url": "http://www.ehow.com/how_4795789_calculate-salary-after-taxes.html", "passage_text": "Annual Salary After Tax Calculation. Divide the proposed annual salary by the pay period frequency (how many times you will receive a paycheck in a year). For example, if your annual salary is $31,200.00 and you will be paid weekly (52 times within the year), your weekly salary is $600.00. For example, a $600.00 salary minus $8.70 for Medicare, $25.20 for Social Security, $57.00 for federal and $21.97 for state taxes is a weekly salary of $487.13 per week after taxes."}, {"url": "http://www.csmonitor.com/Business/The-Simple-Dollar/2012/0723/How-much-do-you-really-make-Calculate-your-true-hourly-wage", "passage_text": "So, your starting salary of $50,000 gets 20% lopped off with taxes and $8,100 in additional expenses chopped off, so you’re left with a salary of $31,900. You’re actually working 2,700 hours per year, so your actual hourly wage at work isn’t the nice $25 you thought it was. It’s actually $11.81. "}, {"url": "http://www.ehow.com/how_4795789_calculate-salary-after-taxes.html", "passage_text": "Subtract the calculated tax deductions for Medicare, Social Security, federal and state taxes from your pay period salary. For example, a $600.00 salary minus $8.70 for Medicare, $25.20 for Social Security, $57.00 for federal and $21.97 for state taxes is a weekly salary of $487.13 per week after taxes. Multiply the pay period salary after taxes by the pay period frequency to calculate your annual salary after taxes. For example, if your weekly salary after taxes is $487.13 and your pay period frequency is weekly (or 52 times per year), your annual salary after taxes is $25,330.76"}, {"url": "http://www.thesalarycalculator.co.uk/salary.php", "passage_text": "How to use the Take-Home Calculator. To use the tax calculator, enter your annual salary (or the one you would like) in the Salary box. New! If you are earning a bonus payment one month, enter the value of the bonus into the bonus box for a side-by-side comparison of a normal month and a bonus month. Find out the benefit of that overtime! If you know your tax code, enter it into the tax code box for a more accurate take-home pay calculation. If you are unsure of your tax code just leave it blank and the default code will be applied."}, {"url": "http://www.employmentspot.com/employment-articles/salary-after-taxes/", "passage_text": "Knowing your salary after taxes may also help you decide if you want to invest more in your retirement or change your withholding tax allowance. In general, it is a good idea to be aware of how much money is being taken out of your paycheck for taxes, and using these after tax salary calculators can help you do this. Your $40,000 salary probably seems a lot lower when you consider the reality of your net salary after taxes."}, {"url": "http://www.adp.com/tools-and-resources/calculators-and-tools/payroll-calculators.aspx", "passage_text": "Salary Paycheck Calculator How much are your wages after taxes? This powerful tool does all the gross-to-net calculations to estimate take-home (net) pay in any part of the United States. If you are an employee of a non-profit organization, calculate how much of your income you should defer through your organization's 403(b) plan to prepare for retirement. Employee Stock Option Calculator Estimate the after-tax value of non-qualified stock options — before cashing them in."}]