[{"url": "https://answers.yahoo.com/question/index?qid=20091201142005AAw80jC", "passage_text": "Drumsticks don't take long to cook. Boil them for 30 to 45 minutes then add your vegetables cook for an additional 15 minutes. Don't add the veggies until chicken is done or lacking a few minutes of being done. If you put them in while chicken is raw the veggies will cook to mush and have no flavor to them. You want to cook the chicken legs in a pot with enough water to cover them about 2 inches. Bring them to a boil, then reduce heat to low and cover the pot, and cook/simmer for about 1-1/2 to 2 hours, or until meat pulls away from bone easily. Pull leg out and set aside to cool."}, {"url": "https://answers.yahoo.com/question/index?qid=20091201142005AAw80jC", "passage_text": "Drumsticks don't take long to cook. Boil them for 30 to 45 minutes then add your vegetables cook for an additional 15 mins. Don't add the vegs until chicken is done or lacking a few minutes of being done. If you put them in while chicken is raw the vegs will cook to mush and have no flavor to them. You want to cook the chicken legs in a pot with enough water to cover them about 2 inches. Bring them to a boil, then reduce heat to low and cover the pot, and cook/simmer for about 1-1/2 to 2 hours, or until meat pulls away from bone easily. Pull leg out and set aside to cool."}, {"url": "http://www.wikihow.com/Boil-Chicken", "passage_text": "Boil boneless, skinless chicken breasts for 15 to 20 minutes. Thick chicken breasts will need about 20 minutes, while thinner, flatter pieces and smaller chicken breast halves will only need about 15 minutes. Cook skinless, boneless chicken tenderloins for 10 minutes or less. These strips of chicken are very thin, so they usually finish cooking in 10 minutes or less. This amount of time also applies to boneless chicken breast cut into 2-inch (5-cm) pieces."}, {"url": "http://www.food.com/recipe/simple-baked-chicken-drumsticks-443758", "passage_text": "Directions. 1  Put some olive oil in the bottom of a 9X13 pan (just enough to put the drumsticks on). 2  Add drumsticks (space enough apart so they aren't touching each other). 3  Sprinkle generously with pepper and garlic powder. 4  Bake at 375 for half an hour. 5  Bake another half an hour (or until cooked til 160 degrees)). 1 Put some olive oil in the bottom of a 9X13 pan (just enough to put the drumsticks on). 2  Add drumsticks (space enough apart so they aren't touching each other). 3  Sprinkle generously with pepper and garlic powder. 4  Sprinkle lightly with salt. 5  Bake at 375 for half an hour"}, {"url": "https://answers.yahoo.com/question/index?qid=20110712141328AAmFCX2", "passage_text": "To parboil chicken pieces before grilling, place them in cold water and bring the water to a boil. When the water comes to a boil, turn down the heat and let them simmer for about 20 to 22 minutes. Then skim the impurities, that will form the top layer of water. Here's a useful recipe for a brine/marinade you can use for your chicken before you grill or BBQ it. --------------------------------------... Basic Chicken Brine Recipe 1 gallon water 1 cup kosher salt 2/3 cup white sugar Bring the water to a boil, then add the sugar and salt, stirring until completely dissolved."}, {"url": "http://www.food.com/recipe/simple-baked-chicken-drumsticks-443758", "passage_text": "Directions. 1  Put some olive oil in the bottom of a 9X13 pan (just enough to put the drumsticks on). 2  Add drumsticks (space enough apart so they aren't touching each other). 3  Sprinkle generously with pepper and garlic powder. 4  Sprinkle lightly with salt. 5  Bake at 375 for half an hour. 1 Put some olive oil in the bottom of a 9X13 pan (just enough to put the drumsticks on). 2  Add drumsticks (space enough apart so they aren't touching each other). 3  Sprinkle generously with pepper and garlic powder."}, {"url": "http://www.bhg.com/recipes/how-to/cooking-basics/how-to-oven-bake-chicken-legs/", "passage_text": "Preheat the oven to 400°F. Bake the chicken, uncovered, for 35 to 40 minutes or until the chicken is no longer pink inside. You can bake the chicken legs in a 375°F. oven, if desired. Increase the baking time to 45 to 50 minutes. "}, {"url": "http://www.md-health.com/Parboil-Chicken.html", "passage_text": "Alternatively, one can also boil water with the seasonings first then drop the chicken pieces one at a time. Chicken breasts usually take 10 minutes to parboil, while legs, thighs, and quarters take about 5 minutes. Parboil chicken wings for 15-20 minutes."}]