[{"url": "http://www.aquahobby.com/e_aquarium_plants.php", "passage_text": "The main issues in this case are compatibility with your setup (lighting, substrate, CO2, size, etc), easiness of care, and also the placement of each plant species in the aquarium, in order to obtain a visually attractive aquascape."}, {"url": "http://nwseed.com/content/fish/List_of_freshwater_aquarium_plant_species.html", "passage_text": "Aquatic plants are used to give the aquarium a natural appearance, oxygenate the water, and provide habitat for fish, especially fry (babies) and for invertebrate species. Some aquarium fish and invertebrates also eat live plants."}, {"url": "http://www.liveaquaria.com/product/aquarium-fish-supplies.cfm?c=768", "passage_text": "Freshwater Aquarium Plants. Improve the water quality of your freshwater tank while enhancing the natural beauty of your aquarium and providing shelter and security for your fish. All freshwater aquarium plants are individually labeled with color identification photos and care information to guarantee the freshest and most vigorous plants."}, {"url": "http://kids.nceas.ucsb.edu/biomes/freshwater.html", "passage_text": "PLANTS: Plants and algae are important to freshwater biomes because they provide oxygen through photosynthesis, and food for animals in this biome. Yum, delicious algae. In fact, that slimy scum you see on the surface of a pond or lake is lunch for many of your favorite aquatic animals, like turtles."}, {"url": "http://www.aquatic-experts.com/freshwater_plants.html", "passage_text": "The freshwater plants also add beauty to the freshwater wild habitats and are a primary enhancement accessory in the aquarium hobby adding esthetic beauty and a natural equilibrium to the aquarium."}, {"url": "http://www.aquatic-experts.com/freshwater_plants.html", "passage_text": "FRESHWATER PLANTS. Freshwater plants are important in any healthy aquatic ecosystem. Freshwater plants help filter the water regulating some harmful chemicals. They are also a key food source for many aquatic organisms which feed on them. Their leaves also capture small bits of organic matter which are dragged by the water current."}, {"url": "http://floridaaquatic.com/aquarium_plants_1.html", "passage_text": "Pictures of the aquarium plants include the flowers and emersed growth of many of the different aquatic plant species. More information on the aquarium plants and new pictures of the aquarium plants are added regularly."}]