[{"url": "http://www.webmd.com/erectile-dysfunction/news/20080701/watermelon-a-natural-viagra", "passage_text": "He does know that a typical 4-ounce serving of watermelon (about 10 watermelon balls) has about 150 milligrams of citrulline. But he can't say how much citrulline is needed to have Viagra-like effects. He's hopeful that someone will pick up on his research and study the fruit's effect on penile erections. "}, {"url": "http://en.allexperts.com/q/Food-Safety-Issues-767/half-watermelon-long-keep.htm", "passage_text": "Generally, cut watermelon needs to be used within 3-4 days as it will start to sour and soften after 4-5 days. A colder refrigerator (34-36 degrees) will prolong this from happening but you should plan to use the watermelon within 3-4 days of cutting. You can freeze watermelon in small chunks. "}, {"url": "http://www.whataboutwatermelon.com/index.php/2009/05/ask-the-experts-how-long-will-my-watermelon-last/", "passage_text": "So, if you’ve already got a whole watermelon in the fridge, you should keep it there. But if you’re storing it outside the fridge, put it in the fridge about three hours before you plan to eat it in order to cool it down to just the right temperature. I keep seeing everywhere an uncut melon will only last 7-10 days, but i have had this large 1-1.5 ft long watermelon sitting in my kitchen since early summer (maybe june to very early july)."}, {"url": "http://www.eatbydate.com/fruits/fresh/watermelon/", "passage_text": "1 Day. 3-5 Days. Of course, all foods last for a shorter period of time if they are not stored properly. But remember, watermelon, like a lot of other fresh fruits, usually does not have a use by date or a best before date so you will have to use the date purchased or date picked. There is rarely a picnic that does not include a watermelon. Its sweet, juicy red flesh has plenty of Vitamins A & C and the anti-oxident lycopene which is good for heart and bone health. It has no fat and is very low in calories as it is comprised of 90% water and 8% natural sugar."}, {"url": "http://www.answers.com/Q/How_long_does_a_uncut_watermelon_stay_fresh_sitting_on_the_counter", "passage_text": "Answer by Collin Wang. Confidence votes 147. According to the University of Illinois website, an uncut watermelon will stay fresh at room temp for about two weeks after being harvested. By practical experience, I just cut open a watermelon that has been sitting in my kitchen floor that I purchased two months ago. Answer   fresh uncooked sealed meat can stay good 7-10 from purchase if kept inn fridge at the right temp.   Answer   It depends on what type of meat. Some meat c … an stay in you fridge for 3 days but chicken and fish don't work."}, {"url": "http://www.answers.com/Q/How_long_does_a_uncut_watermelon_stay_fresh_sitting_on_the_counter", "passage_text": "Melons do not last long once they become ripe. A whole uncut melon will stay good for 5 to 7 days. If the melon is cut it will last only 3 days. Answer   fresh uncooked sealed meat can stay good 7-10 from purchase if kept inn fridge at the right temp.   Answer   It depends on what type of meat. Some meat c … an stay in you fridge for 3 days but chicken and fish don't work."}, {"url": "http://www.eatbydate.com/fruits/fresh/watermelon/", "passage_text": "The shelf life of watermelon depends when the watermelon was picked and how it is stored. A watermelon, actually a vegetable but normally considered a fruit, is completely edible including the rind and seeds. There is rarely a picnic that does not include a watermelon. Its sweet, juicy red flesh has plenty of Vitamins A & C and the anti-oxident lycopene which is good for heart and bone health. It has no fat and is very low in calories as it is comprised of 90% water and 8% natural sugar."}, {"url": "http://www.answers.com/Q/How_long_can_a_watermelon_stay_fresh_in_a_refrigerator", "passage_text": "Melons do not last long once they become ripe. A whole uncut melon will stay good for 5 to 7 days. If the melon is cut it will last only 3 days. + 13 others found this useful. "}, {"url": "http://www.whataboutwatermelon.com/index.php/2009/05/ask-the-experts-how-long-will-my-watermelon-last/", "passage_text": "First of all, there’s no such thing as “too much watermelon.” Second, there are so many things you can do with those leftovers, but that’s a subject for another day. To answer your question, if the watermelon has already been cut, it should be okay in the fridge for 3 or 4 days. While it’s in there, keep it in a container (if it’s cubed) or place plastic wrap over the exposed edge. I keep seeing everywhere an uncut melon will only last 7-10 days, but i have had this large 1-1.5 ft long watermelon sitting in my kitchen since early summer (maybe june to very early july)."}]