[{"url": "https://support.office.com/en-us/article/Add-a-pie-chart-812DCCCE-9E44-41C6-9091-225C7C3DF3E0", "passage_text": "Click Insert Insert Pie or Doughnut Chart, and then pick the chart you want. Click the chart and then click the icons next to the chart to add finishing touches: To show, hide, or format things like axis titles or data labels, click Chart Elements. To quickly change the color or style of the chart, use the Chart Styles. Word. Click Insert Chart. Click Pie and then double-click the pie chart you want. In the spreadsheet that appears, replace the placeholder data with your own information. For more information about how pie chart data should be arranged, see Data for pie charts. When you’ve finished, close the spreadsheet."}, {"url": "http://presentationsoft.about.com/od/powerpoint-charts/ss/120627-powerpoint-pie-chart.htm", "passage_text": "Create a Pie Chart with the Title and Content Slide Layout. 1  Choose the Appropriate Slide Layout for the Pie Chart. 2  Add a new slide, using the Title and Content slide layout. 3  Click on the Insert Chart icon (shown as the middle icon on the top row of the group of six icons shown in the body of the slide layout). 1 When you create a pie chart on a PowerPoint slide, the screen is then split into two windows featuring both PowerPoint and Excel. 2  The PowerPoint 2010 window contains a generic pie chart. 3  The Excel 2010 window contains the generic data that is used to create the generic pie chart in the PowerPoint window."}, {"url": "https://support.microsoft.com/en-us/kb/151355", "passage_text": "1 To add Data Labels on the outer pie slices: 2  Click the outer pie. 3  On the Insert menu, click Data Labels. 4  Click the Show Label and Percent option button under the Data Labels group box and click OK. 5  This places the data labels for the outer pie in the plot area of the chart. "}, {"url": "https://technet.microsoft.com/en-us/library/cc281298(v=sql.100).aspx", "passage_text": "To display percentage values as labels on a pie chart. Add a pie chart to your report. For more information, see How to: Add a Chart to a Report. On the design surface, right-click on the pie and select Show Data Labels. The data labels should appear within each slice on the pie chart. "}, {"url": "http://yourbusiness.azcentral.com/create-animated-pie-charts-powerpoint-2352.html", "passage_text": "Step 4. Click on the pie chart and select the Animations tab of the ribbon. Click the drop-down arrow on the Animation Effects gallery in the Animation group and choose the effect you want to apply to the chart or click More Effects to select from other options. Step 5"}, {"url": "https://technet.microsoft.com/en-us/library/cc627437(v=sql.100).aspx", "passage_text": "To display data point labels inside a pie chart. Add a pie chart to your report. For more information, see How to: Add a Chart to a Report. On the design surface, right-click on the chart and select Show Data Labels. Create a pie chart and display the data labels. Open the Properties pane. On the design surface, click on the chart. The properties for the chart are displayed in the Properties pane. In the Misc section, expand the CustomAttributes node."}, {"url": "https://support.office.com/en-us/article/Add-a-pie-chart-812DCCCE-9E44-41C6-9091-225C7C3DF3E0", "passage_text": "PowerPoint. Click Insert Chart Pie, and then pick the pie chart you want to add to your slide. In the spreadsheet that appears, replace the placeholder data with your own information. For more information about how to arrange pie chart data, see Data for pie charts. When you’ve finished, close the spreadsheet. Word. Click Insert Chart. Click Pie and then double-click the pie chart you want. In the spreadsheet that appears, replace the placeholder data with your own information. For more information about how pie chart data should be arranged"}, {"url": "http://yourbusiness.azcentral.com/create-animated-pie-charts-powerpoint-2352.html", "passage_text": "Step 2. Select the Insert tab and click Chart in the Illustrations group. Choose Pie in the list of chart types. Click on the specific sub-type of pie chart you want to use and click OK.. PowerPoint adds a chart to the slide and an Excel worksheet opens as well. Click on the pie chart and select the Animations tab of the ribbon. Click the drop-down arrow on the Animation Effects gallery in the Animation group and choose the effect you want to apply to the chart or click More Effects to select from other options."}, {"url": "http://gethelp.library.upenn.edu/workshops/biomed/ppt07/charts07.html", "passage_text": "After creating a chart you may want to update, add, or delete information. Changing Values. 1  Click on the chart to select it. 2  The Chart Tools tabs appear, including separate tabs for Design, Layout, and Format. 3  In the Design tab under the Data group click on EDIT DATA. 4  Change your data. 5  When finished, click the in the upper right hand corner of Excel to close the worksheet."}]