[{"url": "http://drugabuse.com/library/the-effects-of-xanax-use/", "passage_text": "The negative effects of Xanax withdrawal are counter to the desired effects of the drug. They include: 1  Insomnia. 2  Muscle tension. 3  Digestive upset. 4  Depression. 5  Anxiety. 6  Tremors. 7  Seizures. 8  Tingling, pins and needles, or numbness in extremities."}, {"url": "http://www.everydayhealth.com/drugs/xanax", "passage_text": "Xanax is the brand name of alprazolam, a prescription drug used to treat anxiety disorders. Xanax is prescribed for generalized anxiety disorder (GAD) , anxiety associated with depression, and panic disorder. Other uses include treatment of depression and premenstrual syndrome (PMS) ."}, {"url": "http://www.everydayhealth.com/drugs/xanax", "passage_text": "Xanax (alprazolam) is a benzodiazepine that works on chemicals in the brain that become unbalanced. It's used to treat anxiety. Common side effects of Xanax include drowsiness, dizziness, dry mouth, muscle weakness, and blurred speech."}, {"url": "http://www.everydayhealth.com/drugs/xanax", "passage_text": "Some of the common side effects of Xanax, reported in greater than 5% of patients during clinical trials of anxiety disorders, include drowsiness, lightheadedness, depression, headache, confusion, insomnia, dry mouth, constipation, diarrhea, nausea /vomiting, tachycardia, blurred vision and nasal congestion."}, {"url": "http://www.everydayhealth.com/drugs/xanax", "passage_text": "A: Xanax (alprazolam) (http://www.everydayhealth.com/drugs/xanax) is a benzodiazepine that works on chemicals in the brain that become unbalanced. Xanax is indicated for anxiety. Common side effects of Xanax include drowsiness, dizziness, dry mouth, muscle weakness, and blurred speech."}, {"url": "http://www.rxlist.com/xanax-xr-side-effects-drug-center.htm", "passage_text": "The recommended dose of Xanax XR is 3 to 6 mg daily. Xanax XR may interact with Ketoconazole (Nizoral), itraconazole (Sporanox), nefazodone (Serzone), cimetidine (Tagamet), and fluvoxamine (Luvox). Alcohol and sedative drugs add to its sedative effect."}, {"url": "http://www.webmd.com/drugs/2/drug-9824/xanax-oral/details", "passage_text": "How to use Xanax. Take this medication by mouth as directed by your doctor. Dosage is based on your medical condition, age, and response to treatment. Your dose may be gradually increased until the drug starts working well. Follow your doctor's instructions closely to reduce the risk of side effects."}, {"url": "http://www.rxlist.com/xanax-side-effects-drug-center.htm", "passage_text": "Other drug interactions include ketoconazole and itraconazole (Sporanox). Side effects of Xanax (alprazolam) include drowsiness, dizziness, insomnia, memory problems, poor balance or coordination, slurred speech, trouble concentrating, and irritability. Other, less common, side effects can include diarrhea, sweating, headache, nausea, blurred vision, and appetite changes."}]