[{"url": "http://www.learnhowtobecome.org/physical-therapist/", "passage_text": "In order to work as a physical therapist, you must complete a Doctor of Physical Therapy degree program. As of 2014, there were 228 physical therapy programs accredited by the Commission on Accreditation in Physical Therapy Education (CAPTE), most of which last three years. "}, {"url": "https://bigfuture.collegeboard.org/careers/health-care-support-physical-therapist-assistants#!", "passage_text": "Physical therapist assistants work with physical therapists to help patients with exercises and other therapeutic treatments, such as bathing, applying hot and cold packs, and massaging. Working as a physical therapist assistant is not a stepping-stone on the way to becoming a physical therapist. To become a PT, you’ll need at least a master’s degree."}, {"url": "http://www.wikihow.com/Become-a-Physical-Therapist-Assistant", "passage_text": "Physical therapist assistants (PTAs) work as part of a dynamic healthcare team. Assistants help physical therapists maintain therapy facilities and monitor patient progress, while also helping patients by assisting them on difficult movements and instructing them on how to use walking aids. "}, {"url": "http://www.learnhowtobecome.org/physician-assistant/", "passage_text": "Physician assistants work under the supervision of a doctor, surgeon, or medical professional to provide support to a healthcare or medical team. Often an exciting career, physician assistants are required to have an advanced education and extensive training in a medical setting. Certified physician assistants need to take the Physician Assistant National Recertifying Exam (PANRE) during the last two years of the six-year certification maintenance or the 10-year certification maintenance cycle."}, {"url": "http://study.com/articles/How_to_Become_a_Licensed_Physical_Therapist_Assistant.html", "passage_text": "Under the supervision of a licensed physical therapist, physical therapist assistants help to improve the mobility and daily function of patients who have been injured or have disabilities. Physical therapist assistants looking to advance should consider continuing their education and pursuing a degree to become a physical therapist."}, {"url": "http://www.op.nysed.gov/prof/pt/ptfaq.htm", "passage_text": "A physician assistant may perform medical services when under the supervision of a physician. Medical services which may be performed by a physician assistant include a referral to a physical therapist for treatment. In making such a referral, the physician assistant is acting as the agent of the physician. New York State law restricts the practice of physical therapy to licensed physical therapists or certified physical therapist assistants. Individuals who are not licensed or certified may not provide physical therapy services."}, {"url": "https://answers.yahoo.com/question/index?qid=20130420080419AAtIli3", "passage_text": "However, the incidence and magnitude of litigation in PT and physician assistant is to a much lesser degree than that of a physician. Honestly, if you are a physically active person, I would encourage you to consider being a PT. Best Answer: I think being a PA or a PT would fulfill most of your requirements. Although very competitive, entrance into PA or PT school is certainly not as academically challenging as med school."}, {"url": "https://bigfuture.collegeboard.org/careers/health-care-support-physical-therapist-assistants#!", "passage_text": "As a physical therapist assistant, you’ll work under the supervision of a physical therapist (PT) to help patients whose ability to move is impaired, from injured athletes to disabled children. You’ll provide the kind of practical, hands-on help that can be truly life-changing. Working as a physical therapist assistant is not a stepping-stone on the way to becoming a physical therapist. To become a PT, you’ll need at least a master’s degree."}, {"url": "http://www.apta.org/PTAEducation/Overview/", "passage_text": "Physical therapist assistant (PTA) education, obtained in a CAPTE-accredited two-year associate degree program, prepares graduates for taking the national licensure examination and entering the field of physical therapy with the required knowledge, skills, and behaviors of a PTA. "}, {"url": "http://www.bls.gov/ooh/Healthcare/Physical-therapist-assistants-and-aides.htm", "passage_text": "Most states require physical therapist assistants to have an associate’s degree from an accredited physical therapist assistant program. Physical therapist aides generally have a high school diploma and receive on-the-job training. Physical therapist assistants record patients’ progress and report the results of each treatment to the physical therapist. Physical therapist aides work under the direct supervision of a physical therapist or physical therapist assistant."}]