[{"url": "http://www.merriam-webster.com/medical/intraocular%20pressure", "passage_text": "Medical Definition of INTRAOCULAR PRESSURE. : the pressure within the eyeball that gives it a round firm shape and is caused by the aqueous humor and vitreous body—called also intraocular tension. What made you want to look up intraocular pressure? "}, {"url": "http://www.adsyes.org/intensive-outpatient-program/", "passage_text": "The Intensive Outpatient Program (IOP) is designed to provide intensive counseling for those clients dealing with a diagnosis of substance dependence. The program is up to 12 weeks in length and blends both individual counseling and group counseling in a structured outpatient treatment setting. "}, {"url": "http://www.medicinenet.com/script/main/art.asp?articlekey=10603", "passage_text": "IOP (intraocular pressure): The pressure created by the continual renewal of fluids within the eye. The normal IOP varies among individuals. The intraocular pressure is increased in glaucoma. In acute angle-closure glaucoma, the intraocular pressure rises rapidly because the iris blocks the angle in the front of the eye where the anterior chamber fluid normally drains out."}, {"url": "http://thecounselingcenter.com/about-outpatient-treatment/", "passage_text": "Intensive Outpatient Treatment (also known as IOP for Intensive Outpatient Program) is a primary treatment program recommended in some circumstances by a clinical and medical assessment. IOP may be recommended for those who do not need medically-supervised detox. With an outpatient program like the IOP offered by The Counseling Center at Freehold, you continue to live at your own home. You remain in control of your own life. You can still go to work or get a job, and begin rebuilding your personal life, with the help and support you receive from the program."}, {"url": "https://en.wikipedia.org/wiki/Intraocular_pressure", "passage_text": "Intraocular pressure (IOP) is the fluid pressure inside the eye. Tonometry is the method eye care professionals use to determine this. IOP is an important aspect in the evaluation of patients at risk from glaucoma. Most tonometers are calibrated to measure pressure in millimeters of mercury (mmHg). Intraocular pressure is mainly determined by the coupling of the production of aqueous humor and the drainage of aqueous humor mainly through the trabecular meshwork located in the anterior chamber angle. An important quantitative relationship is provided below:"}, {"url": "http://www.medicinenet.com/script/main/art.asp?articlekey=4014", "passage_text": "Intraocular pressure: The pressure created by the continual renewal of fluids within the eye. The intraocular pressure is increased in glaucoma. In acute angle-closure glaucoma, the intraocular pressure rises because the canal into which the fluid in the front part of the eye normally drains is suddenly blocked."}, {"url": "http://www.thefreedictionary.com/IOP", "passage_text": "Noun. 1. IOP-pressure exerted by the fluids inside the eyeball; regulated by resistance to the outward flow of aqueous humor; glaucoma can result from increased intraocular pressure. intraocular pressure"}, {"url": "https://en.wikipedia.org/wiki/Intensive_outpatient_program", "passage_text": "(March 2015). An intensive outpatient program (IOP) is a kind of treatment service and support program used primarily to treat eating disorders, depression, self harm and chemical dependency that does not rely on detoxification. The typical IOP program offers group and individual services of 10–12 hours a week. IOP allows the individual to be able to participate in their daily affairs, such as work, and then participate in treatment at an appropriate facility in the morning or at the end of the day."}, {"url": "http://thecounselingcenter.com/about-outpatient-treatment/", "passage_text": "For the typical rehab experience lasting 30 days, this can mean a significant time away from work, family, and personal obligations. With an outpatient program like the IOP offered by The Counseling Center at Freehold, you continue to live at your own home. You remain in control of your own life. You can still go to work or get a job, and begin rebuilding your personal life, with the help and support you receive from the program."}]