[{"url": "http://www.wikihow.com/Use-Uber", "passage_text": "1 Taxi – This calls a taxi that has an agreement with Uber. 2  These taxis are much like any normal taxi, except that you can pay through the app. 3  UberX – This sends an everyday car to your location with seating for up to four people. 4  This is Uber’s budget option. 1 The Uber app will provide you with the phone number of your driver. 2  You can use this contact the driver if you have any special considerations. 3  If you need to cancel your reservation, you will be charged a $5-$10 fee if you cancel after five minutes."}, {"url": "http://time.com/3556741/uber/", "passage_text": "The service’s lowest-cost option, UberX, runs in everyday cars like the Toyota Prius. Uber Black is the company’s original service, costing a bit more but running in high-end town cars with professional drivers. Uber SUV is precisely what it sounds like, charging a premium for a larger vehicle. But in smaller Uber bergs like Blacksburg, Virg., the app is likely a dead zone in the middle of the night. Still, if you fire up the app and can see a car on the map, there’s one nearby. Hail the ride and you’ll get a fairly accurate estimated time of arrival. This Uber feature is a major draw, and compared to calling a taxi dispatcher and being given a rough estimate for arrival, there’s no surprise why the service is doing so well"}, {"url": "http://www.wikihow.com/Use-Uber", "passage_text": "1 Black Car – This is Uber’s original service. 2  Choosing Black Car will send a high-end sedan to your location, with seating for up to 4 people. 3  Taxi – This calls a taxi that has an agreement with Uber. 4  These taxis are much like any normal taxi, except that you can pay through the app. 1 The Uber app will provide you with the phone number of your driver. 2  You can use this contact the driver if you have any special considerations. 3  If you need to cancel your reservation, you will be charged a $5-$10 fee if you cancel after five minutes."}, {"url": "http://www.ctvnews.ca/business/uber-ride-share-taxi-or-tech-company-1.2044508", "passage_text": "No cab. Tonight I see the need for more competition with @Uber // @Uber_Ottawa #ottcity — John Baird (@HonJohnBaird) October 5, 2014. As the app-based ridesharing service Uber fights to stay in Ottawa, debate is heating up over whether the company is a technology middle-man or an unlicensed, unregulated taxi service. Uber is cheaper than a comparable cab ride, since it cuts out a lot of the overhead costs that come with running a fully-licensed and regulated taxi service. Many have lauded the service as a low-cost measure to ease city traffic and speed up taxi wait times, while driving down taxi prices."}, {"url": "https://en.wikipedia.org/wiki/Uber_(company)", "passage_text": "Since Uber's launch, several other companies have copied its business model, a trend that has come to be referred to as Uberification. Uber was founded as UberCab by Travis Kalanick and Garrett Camp in 2009 and the app was released the following June. Beginning in 2012, Uber expanded internationally. In 2014, it experimented with carpooling features and made other updates. In some cities, if the Uber car is travelling at a speed greater than 11 mph (18 km/h), the price is calculated on a distance basis, otherwise, the price is calculated on a time basis. At the end of a ride, the complete fare is automatically billed to the customer's credit card."}, {"url": "https://en.wikipedia.org/wiki/Uber_(company)", "passage_text": "Uber Technologies Inc. is an American international transportation network company headquartered in San Francisco, California. The company develops, markets and operates the Uber mobile app, which allows consumers with smartphones to submit a trip request which is then routed to Uber drivers who use their own cars. In some cities, if the Uber car is travelling at a speed greater than 11 mph (18 km/h), the price is calculated on a distance basis, otherwise, the price is calculated on a time basis. At the end of a ride, the complete fare is automatically billed to the customer's credit card."}, {"url": "http://www.wikihow.com/Use-Uber", "passage_text": "Uber is an on-demand car service that allows you to request private drivers through applications for iPhone and Android devices. The service utilizes dispatch software to send the nearest driver to your location. 1 The Uber app will provide you with the phone number of your driver. 2  You can use this contact the driver if you have any special considerations. 3  If you need to cancel your reservation, you will be charged a $5-$10 fee if you cancel after five minutes."}, {"url": "http://www.thedailybeast.com/articles/2014/03/28/uber-s-biggest-problem-isn-t-surge-pricing-what-if-it-s-sexual-harassment-by-drivers.html", "passage_text": "One afternoon in late September, I opened the Uber app and requested a ride. For the unitiated, Uber is a hugely popular app that allows people to summon a private car with a few taps of their fingers. Since launching in 2009, the company has expanded to 34 countries, mainstreaming on-demand private transportation. Existing laws have prevented Uber from operating in Las Vegas, where the minimum time for a ride in a private car is one hour and in Miami, where a reservation for a limousine is required to be made an hour in advance, with a minimum fare of $80."}, {"url": "http://www.nbcnewyork.com/news/national-international/Uber-Ride-Sharing-Taxi-surge-pricing-cab-booking-266414691.html", "passage_text": "1 of. Summoning a driver at a push of a smartphone button is a lot easier than trying to hail a cab during rush hour, which may explain why Uber, a car service app that connects passengers and car services within minutes, has become so popular. The San Francisco-based startup, which launched in 2010, is the biggest of the car-hailing apps (others include Lyft, Sidecar and Wingz), operating in 120 cities and 37 countries. Uber relies on a surge-pricing model, which means the fares increase during high-demand periods."}]