[{"url": "http://www.wisegeek.com/what-are-wax-beans.htm", "passage_text": "Wax beans are a type of edible bean known for their bright yellow coloration. Similar in taste to string or green beans, wax beans can be used in a variety of dishes and may be eaten cooked or raw. Also known as butter beans, they are typically harvested in late spring and early summer, and grow in temperate areas. All you need to make the wax bean soup is onions, parsley, butter, wax beans, vegetable juice, water, milk, wheat flour and a bit of sour cream. To start, all you need to do is saute the onions and parsley in some butter."}, {"url": "http://waxedbean.blogspot.com/p/what-is-waxed-bean.html", "passage_text": "Wax bean is a species that belongs to the phaseolus family and it is related with the dragon tongue beans and green beans and it is similar in taste to the yard long green bean. Wax bean is also called butter bean, due to the fact that it presents yellow pods. Usually, the wax bean is colored in yellow, gold or purple and sometimes it is considered a more colored version of the immature green bean. Other given names are yellow bean and purple bean."}, {"url": "http://waxedbean.blogspot.com/p/what-is-waxed-bean.html", "passage_text": "-July 2010. Wax bean is a species that belongs to the phaseolus family and it is related with the dragon tongue beans and green beans and it is similar in taste to the yard long green bean. Wax bean is also called butter bean, due to the fact that it presents yellow pods. Usually, the wax bean is colored in yellow, gold or purple and sometimes it is considered a more colored version of the immature green bean. Other given names are yellow bean and purple bean."}, {"url": "http://www.specialtyproduce.com/produce/Yellow_Wax_Beans_602.php", "passage_text": "Yellow Wax beans' ancestors are native to Central and South America. Many Yellow Wax bean varieties, though, were first introduced to their respective culinary regions from Algeria. The Algerian Wax bean is responsible for the development of several varieties of Wax beans from the 18th to the 20th Century. It is considered the oldest known cultivar still in production."}, {"url": "http://www.marthastewart.com/334122/in-season-wax-beans", "passage_text": "Wax beans, which are pale yellow in color, are a type of snap bean with a slightly mild flavor, similar to green beans. They are at the peak of their season from late July to late September. Buying and Storing. Look for crisp beans that snap when you break them. They should be free of wrinkles, bruises, and spots. "}, {"url": "http://www.wisegeek.com/what-are-wax-beans.htm", "passage_text": "Wax beans are a type of bright yellow edible bean. Wax beans can be used as a substitute for green beans when called for in a recipe. Lightly steamed wax beans can add crunch to a leafy green salad. All you need to make the wax bean soup is onions, parsley, butter, wax beans, vegetable juice, water, milk, wheat flour and a bit of sour cream. To start, all you need to do is saute the onions and parsley in some butter."}, {"url": "http://www.williams-sonoma.com/recipe/tip/all-about-wax-beans.html", "passage_text": "All About Wax Beans. Closely related to green beans, wax beans differ in their color, which can be vibrant yellow or dark purple and, as their name suggests, in that their texture is slightly waxier. Like green beans, wax beans are enjoyed whole with pod and seeds, and they taste mild and fresh with sweet, grassy overtones. Wax beans make a colorful side dish steamed or sauteed sautéed with butter or olive. Oil they are ideal in vegetable, salads pairing well with, potatoes, beets, corn and. Peas they can be added, to or substituted, for green beans in. Recipes. Selecting purchasing wax beans is much like purchasing green. beans"}, {"url": "https://en.wikipedia.org/wiki/Wax_bean", "passage_text": "Phaseolus vulgaris, the common bean (also known as the string bean, field bean, flageolet bean, French bean, garden bean, green bean, haricot bean, pop bean, or snap bean), is a herbaceous annual plant grown worldwide for its edible dry seed (known as just  beans ) or unripe fruit (green beans). Green beans may have a purple rather than green pod, which changes to green when cooked. Wax beans are P. vulgaris beans that have a yellow or white pod. Wax bean cultivars are commonly grown; the plants are often of the bush form."}, {"url": "http://www.specialtyproduce.com/produce/Yellow_Wax_Beans_602.php", "passage_text": "Yellow Wax beans are a member of the Fabaceae family, along with common beans, pulses and peas. Yellow Wax is a given name to dozens of wax bush bean varieties that individually simply happen to have different shades of yellow in appearance and variance in waxiness depending on the cultivar. Many Yellow Wax bean varieties, though, were first introduced to their respective culinary regions from Algeria. The Algerian Wax bean is responsible for the development of several varieties of Wax beans from the 18th to the 20th Century. It is considered the oldest known cultivar still in production."}, {"url": "http://recipes.wikia.com/wiki/Wax_bean", "passage_text": "About Wax bean Edit. Wax bean is a specie that belongs to the phaseolus family and it is related with the dragon tongue beans and green beans and it is similar in taste to the yard long green bean. Wax bean is also called butter bean, due to the fact that it presents yellow pods. Usually, the wax bean is colored in yellow, gold or purple and sometimes it is considered a more colored version of the immature green bean. Other given names are yellow bean and purple bean."}]