[{"url": "http://www.ipwatchdog.com/2013/06/10/think-patent-arbitration-cant-work-think-again/id=41447/", "passage_text": "In March 2013, the World Intellectual Property Organization (“WIPO”) published results of a survey that found resolving technology disputes in arbitration saved, on average, more than 60% in time and up to 55% in costs, compared to litigation."}, {"url": "http://biztaxlaw.about.com/od/resolvingbusinessdisputes/a/arbitratelitiga.htm", "passage_text": "Cost of the Process. The costs for the arbitration process are limited to the fee of the arbitrator(depending on the size of the claim, expertise of the arbitrator, and expenses), and attorney fees. Costs for litigation include attorney fees and court costs, which can be very high."}, {"url": "http://www.forbes.com/2009/07/14/lipner-arbitration-litigation-intelligent-investing-cost.html", "passage_text": "In litigation (or, in court), filing and service of process fees are smaller (about $500); there are no “hearing session fees.” But, when in court, there is a different expense to be incurred–one not seen in arbitration–the cost of stenographic court reporters."}, {"url": "http://www.forbes.com/2009/07/14/lipner-arbitration-litigation-intelligent-investing-cost.html", "passage_text": "As a FINRA arbitration progresses, more “forum fees” are incurred–$1,200 per half-day hearing session. The average arbitration requires three days of hearings. That’s six hearing sessions. So, if the parties do not settle in advance of the hearing, FINRA will have an outstanding bill of about $7,200."}, {"url": "http://law.freeadvice.com/litigation/arbitration/arbitrate_dispute.htm", "passage_text": "Just the initial filing for federal court costs $400. This does not include copy fees, transcription fees, payment of experts, or even the response filing fee for the other side. On average a typical civil case is court will cost a plaintiff $130,112,080. The average cost of an arbitration from start to finish is $870. Unlike litigation, the parties have far greater control in terms of choosing their arbitrator and to determine when, where, and how the matter will be decided."}, {"url": "http://www.citizen.org/documents/ACF110A.PDF", "passage_text": "Thus, while it costs the Clerk of theCircuit Court of Cook County an average of $44.20 to administer a case, AAA’sadministrative cost per case averages $340.63, about 700 percent more.§ Arbitration saddles claimants with a plethora of extra fees that they would not be charged ifthey went to court."}, {"url": "http://www.wipo.int/export/sites/www/amc/en/docs/adrcosts2012.pdf", "passage_text": "Comparing court litigation and arbitration, in general, from start to completion an arbitration can be less costly than a fully litigated and appealed case in court. The reason is that by far the largest cost of both arbitration and court litigation are the parties’ costs, in particular the lawyers’ fees 7."}]