[{"url": "http://www.contractortalk.com/f5/cost-per-sq-ft-6284/", "passage_text": "Re: Cost Per Sq Ft. I buy copper by the sheet. I can tell you exactly what a square foot of copper will cost. $3.50 per square foot, which is also a pound. I know that wasn't the question but I wanted to appear intelligent."}, {"url": "http://www.electrical-contractor.net/forums/ubbthreads.php/topics/156063/per_sq_ft_residential.html", "passage_text": "So, I estimate the house will take 300 man hours to wire and $6000 in material for basic electrical to code.With a man hour rate of $65 an hour plus $6000 material, I have $25500 for the basic price without extras. $25500 divided by 6124 sq ft = $4.16 per square foot. "}, {"url": "http://www.homewyse.com/services/cost_to_install_electrical_wiring.html", "passage_text": "Get an INSTANT estimate of the cost to Install Electrical Wiring! Our free calculator uses recent, trusted data to estimate costs for your Electrical Wiring Installation project. For a basic 1 wiring project in zip code 47474, the benchmark cost to Install Electrical Wiring ranges between $131.55 - $216.42 per wiring. To estimate costs for your project: 1. Set Project Zip Code Enter the Zip Code for the location where labor is hired and materials purchased."}, {"url": "http://www.ehow.com/how_6393755_calculate-foot-commercial-electrical-work.html", "passage_text": "Commercial electrical work sometimes requires the bidder to submit a price-per-square-foot bid. The bidder must understand the scope of the work in some detail in order to make a realistic bid. Once the probable cost is known and the profit margin determined, the calculation itself is simple. "}, {"url": "http://www.jalapenopaintwerx.com/blog/bid/255223/What-are-average-interior-painting-prices", "passage_text": "Labor Costs of about $.70 per square foot of wall/ceiling space. To figure this, multiply the perimeter of the room by the height..then, multiply by $.60. This will get you an approximate labor cost if there's not a lot of repair work needed. A 12x12x8 room will have about 384 square feet of wall space. Paint for this room will run about $.20 per square foot of wall space. This will add about $70 to the price above if using a Benjamin Moore high quality paint. Then, sundries, or supplies will be added. They typical cost for this will be about $50 ($.13 per square foot) for a typical room."}, {"url": "http://home.costhelper.com/rewire-house.html", "passage_text": "1 Average total cost (materials and labor) for rewiring a house starts around $3,500-$8,000 for a moderate-sized home with easy access (at least 18-inches of crawlspace under the home plus an accessible attic) but can run $8,500-$20,000 or even as high as $30,000 for a large house and/or one with difficult access. "}, {"url": "http://www.answermefast.com/What_is_the_average_cost_per_square_foot_of_electrical_work_for_a_new_home_in_louisiana-qna21758.html", "passage_text": "1 51% - What is the electrical labor cost for a 1800 sqaure foot home tract home in lathrop california? 2  47% - How much does it cost to heat 2000 square foot home with an electric furnace? 3  53% - Average labor rate per square foot for commerical construction? 1 53% - Average labor rate per square foot for commerical construction? 2  14% - I want to do the electrical jobs of my new house of 1100 square feet house how much wil be the cost in kerala-for the complete work? 3  36% - How much gas for a 200 square foot home? 4  36% - How large an oil furnace for a 16 square foot home"}, {"url": "http://homewyse.com/services/cost_to_install_concrete_pad.html", "passage_text": "Get an INSTANT estimate of the cost to Install a Concrete Pad! Our free calculator uses recent, trusted data to estimate costs for your Concrete Pad Installation project. For a basic 120 square feet project in zip code 47474, the benchmark cost to Install a Concrete Pad ranges between $4.64 - $6.36 per square foot* . To estimate costs for your project: 1. Set Project Zip Code Enter the Zip Code for the location where labor is hired and materials purchased. 2"}, {"url": "http://homebuildingsmart.com/house-building-cost-per-square-foot/", "passage_text": "Slab – A concrete slab will cost about $4 per square foot. So if a the slab is 24 x 30 foot, then your slab would cost $2880. This price varies though in different areas, and with the cost of concrete. Crawl Space – The cost is based on the perimeter of the home. Adding about $500 for additional support pillars under the house, should leave you with a good idea of how much a crawl space foundation will cost. Basement – Unfinished basement costs in the US vary from $12 to $28 per square foot. Soil conditions vary and it could be even more in some areas."}]