[{"url": "http://www.priceselfstorage.com/azusa-rv-boat-storage/", "passage_text": "Photo Gallery Video Tour. Our RV and boat storage facility in Azusa accommodates large vehicles, RV's, and watercraft of virtually any size. We offer 7 day access for your convenience, spaces ranging from 25’ to 35’ feet in length, pull through and extra wide spaces, as well as a sanitary waste disposal station. If you're looking for RV or Boat storage, from a watercraft or a 35’ foot RV, we have a spot for you. Price Self Storage makes it easy: 1  Month-to-month leases."}, {"url": "http://www.howmuchisit.org/boat-storage-cost/", "passage_text": "1 With boat storage facilities, the prices can range anywhere from $25 to $2,000 per month. 2  The more you want inside of the facility, the more you are going to have to pay. 1 Typically, plan on spending at least 50% more for indoor storage compared to outdoor. 2  Some users on a forum thread on the website City-Data.com claimed that they paid anywhere from $160 to $220 per month for dry storage near Lake Norman."}, {"url": "http://www.unclebobs.com/vehicle-storage/boat-storage.cfm", "passage_text": "Boat Storage. Uncle Bob's offers a variety of outdoor storage options that can accommodate all types and sizes of boats. When shopping for boat storage, be sure to include the extra length and width that the trailer adds! If you've never prepared your boat for storage, particularly in the winter, please see our article How to Prepare your Boat for Winter-great storage tips from boating experts and manufacturers."}, {"url": "https://www.sparefoot.com/boat-storage.html", "passage_text": "The downside to storing your boat in a storage unit is that it may not fit. At minimum, you’ll likely require a 10x15 self-storage unit for your boat. There are only two standard sizes that are larger: 10x20s and 10x30s. If your boat is 10 feet wide and 30 feet long, it won’t fit inside a standard self-storage unit. Keep in mind that storage units are usually between 8 and 10 feet high, meaning that if your boat is taller, then that it won’t fit either."}, {"url": "http://www.boatstorageillinois.com/storageprices.html", "passage_text": "Outside Storage. For outside storage we provide a 12,000 ft 2 yard enclosed by a 10 ft high cyclone fence. The charge for a boat/camper/trailer up to 25 feet is $2.50 per running foot per month which includes the trailer tongue; 25 feet to 35 feet $2.75 and over 35 feet $3.00. The charge for autos is 40.00 and for other vehicles with side doors, trucks, vans, and the like, the charge is $2.50 per running foot. The charge for a boat/camper/trailer up to 25 feet is $3.50 per running foot per month which includes the trailer tongue; 25 feet to 35 feet $3.75 and over 35 feet $4.00. The charge for autos is $70.00 and for other vehicles with side doors, trucks, vans and the like, is $3"}, {"url": "http://www.boatstorageillinois.com/storageprices.html", "passage_text": "Inside Storage. The charge for a boat/camper/trailer up to 25 feet is $3.50 per running foot per month which includes the trailer tongue; 25 feet to 35 feet $3.75 and over 35 feet $4.00. The charge for autos is $70.00 and for other vehicles with side doors, trucks, vans and the like, is $3.50 per running foot"}, {"url": "http://www.howmuchisit.org/boat-storage-cost/", "passage_text": "1 If you do not want your boat covered, the prices will range from $55 to as much as $150 per month. 2  Again, this will depend on the amount of space that you need. 3  Most, if not all storage facilities will include a secure gate that requires a pass code, a designated parking spot if parked outside or indoor garage. 1 Typically, plan on spending at least 50% more for indoor storage compared to outdoor. 2  Some users on a forum thread on the website City-Data.com claimed that they paid anywhere from $160 to $220 per month for dry storage near Lake Norman."}, {"url": "http://www.howmuchisit.org/boat-storage-cost/", "passage_text": "1 Plan on spending anywhere from $2 to $5 per foot, per month. 2  For instance, higher-end storage units will have electric gates, 24/7 security, dumpsters and even a wash down area, while your lower-end storage places will just let you park the boat in the a parking lot surrounded by barbed wire and that is it. 1 Typically, plan on spending at least 50% more for indoor storage compared to outdoor. 2  Some users on a forum thread on the website City-Data.com claimed that they paid anywhere from $160 to $220 per month for dry storage near Lake Norman."}, {"url": "http://www.howmuchisit.org/boat-storage-cost/", "passage_text": "1 BoatStorageIllinois.com charges a flat $2 per running foot per month for outside storage. 2  BoatRVStorage.com, a company located in Florida, charges $149 for a 12×30 space and $199 per month for a 12×40 space that is covered. 1 Typically, plan on spending at least 50% more for indoor storage compared to outdoor. 2  Some users on a forum thread on the website City-Data.com claimed that they paid anywhere from $160 to $220 per month for dry storage near Lake Norman."}]