[{"url": "http://www.answers.com/Q/How_fast_did_the_first_car_go", "passage_text": "The average car can go anywhere from 110mph to 160mph in America. There are faster cars of course, but that's the average American's car speed. it realy does depend on which lotus you are looking at...   however,   speed has never been lotus's specialty, they are more familiar with the handling and acceler … ation aspect of a car, but they do exceed 135mph on the whole. 14 people found this useful."}, {"url": "https://answers.yahoo.com/question/index?qid=20070225203155AAejFmw", "passage_text": "The engines for the model T were designed and built by the Germans. The car went up to 30mph. The first car was steam powered and it was designed and built by Joseph Cugnot in the 1700's. The 1st gas powered car was made by Karl Benz, who named his car the Mercedes Benz. The model T was not even Ford's first car.. And Ford wasn't the first manufacturer. The first car probably went a couple miles per hour uphll and faster downhill. There were no digital speedometers back then and no measured miles like today."}, {"url": "https://uk.answers.yahoo.com/question/index?qid=20091026164144AAtr2yu", "passage_text": "Report Abuse. The limiting factor wasn't how fast the car could go, it was the roads. In the '20's & even into the early '30's, horse-drawn wagons and cars shared the same 'road'. I use the word 'road' loosely, they were heavily rutted mud based paths, at best. Another major problem was the fuel. "}, {"url": "http://www.answers.com/Q/How_fast_did_the_first_car_go", "passage_text": "the first STEAM POWERED vehicle to move on its own power (1796) went with a unbelievable topspeed of 2 miles per hour.   later cars around the 1900's had a topspeed o … f about 6/7 miles per hour. it realy does depend on which lotus you are looking at...   however,   speed has never been lotus's specialty, they are more familiar with the handling and acceler … ation aspect of a car, but they do exceed 135mph on the whole. 14 people found this useful."}, {"url": "https://answers.yahoo.com/question/index?qid=20070225203155AAejFmw", "passage_text": "The 1st Internal combustion Engine driven vehicle was developed in 1808, but it was not until Benz built his first car in 1885 that things really started to take off. In 1893 Benz developed a 4 wheeler The model T appeared in 1908, 6 years after Oldsmobile had started production. The model T had a top speed of 45 mph. The model T was not even Ford's first car.. And Ford wasn't the first manufacturer. The first car probably went a couple miles per hour uphll and faster downhill. There were no digital speedometers back then and no measured miles like today."}, {"url": "http://www.answers.com/Q/How_fast_did_the_first_car_go_when_it_was_first_invented", "passage_text": "Answer Karl Benz in 1885 Answer The first car was invented in the year of 1769 by a Frenchman named Nicolas Joseph Cugnot. iI was built under his instructions in the Paris … Arsenal by Mechanic Brezin. The first car was invented in the year of 1769 by a French man named Nicolas Joseph Cugnot, who build it under his instructions in the Paris Arsenal by Mechanic Brezin. The ca … r only had 3 wheels and was used to carry heavy artilary during war. The car could go up to about 22 miles per hour and was powered by steam."}, {"url": "http://www.answers.com/Q/How_fast_did_the_first_car_go_when_it_was_first_invented", "passage_text": "The first practical car was invented by Karl Benz in 1885. It was a 3 wheel car with a 958cc engine that developed about .8 hp. The first car was invented in the year of 1769 by a French man named Nicolas Joseph Cugnot, who build it under his instructions in the Paris Arsenal by Mechanic Brezin. The ca … r only had 3 wheels and was used to carry heavy artilary during war. The car could go up to about 22 miles per hour and was powered by steam."}, {"url": "http://www.answers.com/Q/How_fast_did_the_first_car_go_when_it_was_first_invented", "passage_text": "Built and raced a car for 2 years on the drag racing circuit. The first practical car was invented by Karl Benz in 1885. It was a 3 wheel car with a 958cc engine that developed about .8 hp. It had a top speed of around 8 mph. The first car was invented in the year of 1769 by a French man named Nicolas Joseph Cugnot, who build it under his instructions in the Paris Arsenal by Mechanic Brezin. The ca … r only had 3 wheels and was used to carry heavy artilary during war. The car could go up to about 22 miles per hour and was powered by steam."}, {"url": "http://www.answers.com/Q/How_fast_did_the_first_car_go", "passage_text": "The first practical car was invented by Karl Benz in 1885. It was a 3 wheel car with a 958cc engine that developed about .8 hp. It had a top speed of around 8 mph. it realy does depend on which lotus you are looking at...   however,   speed has never been lotus's specialty, they are more familiar with the handling and acceler … ation aspect of a car, but they do exceed 135mph on the whole. 14 people found this useful."}]