[{"url": "https://en.wikipedia.org/wiki/Ethanol", "passage_text": "Hydrous ethanol (about 95% ethanol and 5% water) can be used as fuel in more than 90% of new gasoline-engined cars sold in the country. Brazilian ethanol is produced from sugar cane and noted for high carbon sequestration. The US uses Gasohol (max 10% ethanol) and E85 (85% ethanol) ethanol/gasoline mixtures. Mixtures of ethanol and water form an azeotrope at about 89 mole-% ethanol and 11 mole-% water or a mixture of 95.6 percent ethanol by mass (or about 97% alcohol by volume) at normal pressure, which boils at 351K (78 °C)."}, {"url": "https://en.wikipedia.org/wiki/Methyl_Alcohol", "passage_text": "However, unlike ethanol, methanol is highly toxic and unfit for consumption. At room temperature, it is a polar liquid, and is used as an antifreeze, solvent, fuel, and as a denaturant for ethanol. It is also used for producing biodiesel via transesterification reaction. If as little as 10 mL of pure methanol is ingested, for example, it can break down into formic acid, which can cause permanent blindness by destruction of the optic nerve, and 30 mL is potentially fatal, although the median lethal dose is typically 100 mL (3.4 fl oz) (i.e. 1–2 mL/kg body weight of pure methanol)."}, {"url": "http://phys.org/news/2013-02-chemists-hydrogen-methanol-temperature.html", "passage_text": "To overcome this, methanol can be used as a material for the storage of hydrogen, because it is a liquid at room temperature and contains 12.6 per cent hydrogen. Approaching ‘real’ aqueous methanol reforming. Credit: Nature (2013) doi:10.1038/nature11891. (Phys.org)—A team of German and Italian chemists working at the University of Rostock has discovered a way to extract hydrogen from methanol at low temperatures and ambient pressure using a common catalyst."}, {"url": "https://en.wikipedia.org/wiki/Methyl_Alcohol", "passage_text": "Methanol, also known as methyl alcohol, wood alcohol, wood naphtha, methyl hydrate, or wood spirits, is a chemical with the formula C H 3 O H (often abbreviated MeOH). Methanol acquired the name wood alcohol because it was once produced chiefly as a byproduct of the destructive distillation of wood. Modern-day methanol production occurs in a catalytic industrial process directly from carbon monoxide, carbon dioxide, and hydrogen. If as little as 10 mL of pure methanol is ingested, for example, it can break down into formic acid, which can cause permanent blindness by destruction of the optic nerve, and 30 mL is potentially fatal, although the median lethal dose is typically 100 mL (3.4 fl oz) (i.e. 1–2 mL/kg body weight of pure methanol)."}, {"url": "https://en.wikipedia.org/wiki/Ethanol", "passage_text": "Ethanol is a volatile, flammable, colorless liquid with a slight chemical odor. It is used as an antiseptic, a solvent, a fuel, and, due to its low freezing point, the active fluid in post-mercury thermometers. Its structural formula, CH 3CH 2OH, is often abbreviated as C 2H 5OH, C 2H 6O or EtOH. Mixtures of ethanol and water form an azeotrope at about 89 mole-% ethanol and 11 mole-% water or a mixture of 95.6 percent ethanol by mass (or about 97% alcohol by volume) at normal pressure, which boils at 351K (78 °C)."}, {"url": "http://www.bnl.gov/newsroom/news.php?a=11654", "passage_text": "UPTON, NY—Scientists at the U.S. Department of Energy's (DOE) Brookhaven National Laboratory have discovered a new catalytic system for converting carbon dioxide (CO 2) to methanol—a key commodity used to create a wide range of industrial chemicals and fuels. "}, {"url": "http://www.answers.com/Q/How_was_methanol_discovered", "passage_text": "Methanol was discovered in 1661 by an Irish chemist named Robert Boyle. The carbon and especially the OH hydrogen have partial loss of electrons in the bond, and thus assume a partial positive charge. In solution, the negative oxygen centers attract the positive hydrogen centers and form what is known as hydrogen bonding, an electrostatic attraction between oxygen (-) and hydrogen (+)."}, {"url": "http://news.stanford.edu/news/2014/march/methanol-new-catalyst-030214.html", "passage_text": "An international research team has discovered a potentially clean, low-cost way to convert carbon dioxide into methanol, a key ingredient in the production of plastics, adhesives and solvents, and a promising fuel for transportation. In a typical methanol plant, natural gas and water are converted to synthesis gas (syngas), which consists of carbon monoxide, carbon dioxide and hydrogen. The syngas is then converted into methanol in a high-pressure process using a catalyst made of copper, zinc and aluminum."}, {"url": "http://news.stanford.edu/news/2014/march/methanol-new-catalyst-030214.html", "passage_text": "Jens Noerskov nørskov and colleagues At, STANFORD slac and The Danish Technical university have discovered a new catalyst that could lead to the-low cost production of clean. methanol In a typical methanol plant, natural gas and water are converted to synthesis gas (syngas), which consists of carbon monoxide, carbon dioxide and hydrogen. The syngas is then converted into methanol in a high-pressure process using a catalyst made of copper, zinc and aluminum."}]