[{"url": "http://www.familylawaustralia.org/children.html", "passage_text": "A parenting order may deal with the following 1  :-. the person or persons with whom the child is to live (a residence order). 2  contact between a child and another person or persons (a contact order). 3  maintenance of a child (a child maintenance order). Some court orders allow contact to take place between the child and other relatives and friends. Child Maintenance and child support payments are paid by one parent to the other parent to help with the costs of a bringing up a child aged less than 18 years."}, {"url": "http://www.netmums.com/coffeehouse/advice-support-40/single-parents-support-45/418066-residence-order-advice-all.html", "passage_text": "This is the accompanying leaflet Ref: CB1, which gives you advice how to apply for a Residence Order. If you are going to be representing yourself in court, you can get advice from the Community Legal Advice site. I just recently got a Residency Order. I have a 21 month old son and split with his dad when he was 6 months old. My ex has a past history of violence and abuse. He had contact every 2 weeks for 3 hours with my supervision. After i came across more disturbing information i ceased contact and sought legal advice to obtain a Residence Order and the issue of Contact. In the 7 months that i was seaking advice my ex didnt make contact with me nor did he reply to any solicitor letters"}, {"url": "http://www.kewlaw.co.uk/our-services/family-divorce-law/children-matters/residence-orders/", "passage_text": "It is important to take advice and give serious thought before issuing an application to the Court for a Residence Order. An application to the Court can be stressful and have an unsettling effect on the family and especially children. Other people connected to the child, such as grandparents, aunts, uncles or older brothers and sisters of a child would need to apply to the Court for the Court’s permission to issue an application in the first instance. The procedure for applying for a Residence Order is as follows:-. 1  Original application to the Court is made with a Court fee. 2  The Court arranges an initial appointment, usually approximately 21 days after receiving the application. 3  Papers are then sent to the other party"}, {"url": "http://www.kewlaw.co.uk/our-services/family-divorce-law/children-matters/residence-orders/", "passage_text": "If no agreement can be reached, the matter will go before the Judge who will suggest a timetable for how the case is to proceed. Under the Children Act 1989 the Court has to give paramount consideration to the welfare of the child when deciding whether or not to make a Residence Order. Other people connected to the child, such as grandparents, aunts, uncles or older brothers and sisters of a child would need to apply to the Court for the Court’s permission to issue an application in the first instance. The procedure for applying for a Residence Order is as follows:-. 1  Original application to the Court is made with a Court fee. 2  The Court arranges an initial appointment, usually approximately 21 days after receiving the application. 3  Papers are then sent to the other party"}, {"url": "http://www.pauljwatson.com/family_solicitor_in_middlesbrough/child-residence/", "passage_text": "One is a full Residence Order and the other is a shared (joint) Residence Order. Full Residence Order – States which parent the child should live with full time. Shared (Joint) Residence Order – States that the child lives with both parents, for a particular period of time. This is not necessarily a 50/50 division, although it can be"}, {"url": "http://www.familylawaustralia.org/children.html", "passage_text": "1 the person or persons with whom the child is to live (a residence order). 2  contact between a child and another person or persons (a contact order). 3  maintenance of a child (a child maintenance order). 4  any other aspect of parental responsibility for a child-a specific issues order. Some court orders allow contact to take place between the child and other relatives and friends. Child Maintenance and child support payments are paid by one parent to the other parent to help with the costs of a bringing up a child aged less than 18 years."}, {"url": "http://www.blackdownfamilylaw.co.uk/matrimonial-financial-litigation.html", "passage_text": "The various financial orders which the court has power to make when it grants a divorce are known as ancillary relief or matrimonial financial proceedings. The procedure can be expensive but is designed to promote agreement between the parties, reduce delay and limit costs. At the Final Hearing, the Judge can order one or a combination of the following:-. 1  One party to make to the other party, periodical payments for the period of time that is specified in the order – known as maintenance. 2  One party to pay a lump sum or sums of money to the other party."}, {"url": "http://www.pauljwatson.com/family_solicitor_in_middlesbrough/child-residence/", "passage_text": "A Residence Order is usually in place until the child reaches 16 years of age and grants parental responsibility to the holder of the order for the lifetime of the Order, although there can be exceptional circumstances where this is not the case. Full Residence Order – States which parent the child should live with full time. Shared (Joint) Residence Order – States that the child lives with both parents, for a particular period of time."}]