[{"url": "https://answers.yahoo.com/question/index?qid=20090420234101AA4GxJ4", "passage_text": "Report Abuse. A surname is a name added to a given name and is part of a personal name. In many cases a surname is a family name; the family-name meaning first appeared in 1375. Many dictionaries define surname as a synonym of family name."}, {"url": "http://genealogy.about.com/od/surname_meaning/", "passage_text": "45 Articles in: Surname Meaning | Surname Origin-Find the Meaning of Your Surname. View More. Learn how to find the meaning of your last name and trace your surname's origin back through history. Describes the different ways in which surnames developed and tips for tracing last name meanings and origins. Visser Surname Meaning & Origin. Share. Learn the origins and meanings of the popular Irish last name Boyle and its variations such as Boyles, O Boyle, O Baoighill and O Baoill, plus learn about the crest of Clan Boyle and how to research your own Boyle last name."}, {"url": "https://en.wikipedia.org/wiki/Surname", "passage_text": "In most Hispanophone and Lusophone countries, two or more last names (or surnames) may be used. In China, Hungary, Japan, Korea, Madagascar, Nepal, Vietnam, parts of India and in many other East Asian countries, the family name is placed before a person's given name. In some cultures, including those of most Western countries, the surname or family name (last name) is placed after the personal or given name (first name). In other cultures the surname is placed first, followed by the given name or names."}, {"url": "https://en.wikipedia.org/wiki/Given_name", "passage_text": "A given name (also known as a personal name, first name, forename, or Christian name) is a part of a person's full nomenclature. It identifies a specific person, and differentiates that person from other members of a group, such as a family or clan, with whom that person shares a common surname. "}, {"url": "https://en.wikipedia.org/wiki/Surname", "passage_text": "A surname or family name is a name added to a given name. In many cases, a surname is a family name and many dictionaries define surname as a synonym of family name.. In the western hemisphere, it is commonly synonymous with last name because it is usually placed at the end of a person's given name. In some cultures, including those of most Western countries, the surname or family name (last name) is placed after the personal or given name (first name). In other cultures the surname is placed first, followed by the given name or names."}, {"url": "http://www.definitions.net/definition/surname", "passage_text": "A surname is a name added to a given name and is part of a personal name. In many cases, a surname is a family name and many dictionaries define surname as a synonym of family name. In the western hemisphere, it is commonly synonymous with last name, since it is usually placed at the end of a person's given name. The style of having both a family name and a given name is far from universal. In many countries it is common for ordinary people to have only one name or mononym. The concept of a 'surname' is a relatively recent historical development, evolving from a medieval naming practice called a 'byname'."}, {"url": "https://answers.yahoo.com/question/index?qid=20090420234101AA4GxJ4", "passage_text": "1 2 3 surname c.1330, name, title, or epithet added to a person's name, from sur above + name; modeled on Anglo-Fr. surnoun surname (c.1325), variant of O.Fr. surnom, from sur over + nom name.. Meaning family name is first found 1375. In many cases a surname is a family name; the family-name meaning first appeared in 1375. Many dictionaries define surname as a synonym of family name."}, {"url": "http://genealogy.about.com/od/surname_meaning/", "passage_text": "Surname Meanings & Origins. Learn about the origin of your surname, the history and meaning of your surname, if your surname is common and where it is common, and the how and why of name changes and variant spellings. Visser Surname Meaning & Origin. Share. Learn the origins and meanings of the popular Irish last name Boyle and its variations such as Boyles, O Boyle, O Baoighill and O Baoill, plus learn about the crest of Clan Boyle and how to research your own Boyle last name."}]