[{"url": "http://www.naukrihub.com/salary-in-india/hindustan-unilever-ltd.html", "passage_text": "Salary and Benefits. Asides from the great prospects of career development, prospective employees at Hindustan Unilever Ltd can look forward to salaries and benefits which are fairly competitive by market standards. Here is a look at the average salaries at Hindustan Unilever Ltd. A part of the 44.3 billion Unilever Group, Hindustan Unilever Ltd or HUL has significantly contributed towards hygiene, nutrition and personal needs of consumers for decades."}, {"url": "http://www1.salary.com/Engineering-Salaries.html", "passage_text": "Well there are a wide range of jobs in the Engineering category and their pay varies greatly. If you know the pay grade of the job you are searching for you can narrow down this list to only view Engineering jobs that pay less than $30K, $30K-$50K, $50K-$80K, $80K-$100K, or more than $100K. Browse Engineering jobs by salary range: , $30K-$50K, $50K-$80K, $80K-$100K, or. Search by: Keyword Category. Search. Jobs by Salary Ranges: Click a salary category to find jobs in your target salary range. 1  Six Figure Income jobs ($100,000+). 2  High Income jobs ($80,000 - $100,000). 3  Upper Middle Income jobs ($50,000 - $80,000). 4  Middle Income jobs ($30,000 - $50,000). 5  Entry Level Income jobs ($10,000 - $30,000)"}, {"url": "https://www.glassdoor.co.uk/Salary/Unilever-Salaries-E3513.htm", "passage_text": "How much do Unilever employees make? Glassdoor has salaries, tips, bonuses and hourly wages submitted anonymously by 187 Unilever employees. 1  Salaries by Job. 2  Salaries by Company. 3  Salaries by City. 4  Reviews by Company. 5  Interview Questions by Job. 6  Interviews by Company. 7  Benefits by Company. 8  Jobs by Title. 9  Jobs by Company. 10  Jobs by City. “Very understanding about working from home from time to time. Certain jobs enforce it.” (4 comments). See Unilever Hourly Wages, Unilever Bonuses, or check out salaries for Unilever Internship or Unilever Contractor."}, {"url": "http://money.usnews.com/careers/best-jobs/mechanical-engineer/salary", "passage_text": "With an average salary of $85,930 in 2013, mechanical engineers are filling their coffers at a higher rate than a number of other technology jobs. Computer programmers, by comparison, make $80,930. The gap is wider for computer support specialists, who earn an average annual salary of $64,160. Still, some technology jobs, like information security analysts ($91,210) and IT managers ($132,570), earn more than mechanical engineers. Salary Outlook. According to the BLS, mechanical engineers earned a median salary of $82,100 in 2013. The best-paid earned about $123,340, while the lowest-paid earned less than $52,550. Industries that pay well include oil and gas extraction as well as information services."}, {"url": "http://www.payscale.com/research/US/Employer=Unilever/Salary", "passage_text": "Read More. An average Unilever employee can expect to make $74K annually. The most important factor affecting pay for Unilever employees is how long you've been working, though what you do at the company and geography play a role as well. The data for this overview comes from answers to PayScale's salary questionnaire. Employer: Unilever. Certified Six Sigma Green Belts also rank high on the pay scale, with expected average earnings of around $84K per year. Unilever provides the highest financial reward to those with a B.A. in Liberal Studies — these employees rake in $103K annually."}, {"url": "http://www1.salary.com/Engineering-Salaries.html", "passage_text": "Related job categories: IT -- All, Construction and Installation. Browse Engineering jobs by salary range: , $30K-$50K, $50K-$80K, $80K-$100K, or. Search by: Keyword Category. Search. Jobs by Salary Ranges: Click a salary category to find jobs in your target salary range. 1  Six Figure Income jobs ($100,000+). 2  High Income jobs ($80,000 - $100,000). 3  Upper Middle Income jobs ($50,000 - $80,000). 4  Middle Income jobs ($30,000 - $50,000). 5  Entry Level Income jobs ($10,000 - $30,000)"}]