[{"url": "http://biology.stackexchange.com/questions/11377/difference-between-cds-and-cdna", "passage_text": "The difference boils down to UnTranslated Regions. A CDS or coding sequence is the part of a transcript that is actually translated into protein. Therefore a CDS will (almost) always start with an AUG codon and stop at one of the three STOP codons (UAA,UGA,UAG). The CDS of the gene depicted in image above will only contain the ATG, the STOP and the two green regions (exons). The cDNA will contain all that and, in addition, the two UTRs."}, {"url": "https://en.wikipedia.org/wiki/Three_prime_untranslated_region", "passage_text": "Several regions of the mRNA molecule are not translated into protein including the 5' cap, 5' untranslated region, 3' untranslated region, and the poly(A) tail. The 3'-UTR often contains regulatory regions that post-transcriptionally influence gene expression. Another set of elements that is present in both the 5' and 3'-UTR are iron response elements (IREs). The IRE is a stem-loop structure within the untranslated regions of mRNAs that encode proteins involved in cellular iron metabolism."}, {"url": "https://en.wikipedia.org/wiki/Five_prime_untranslated_region", "passage_text": "This sequence allows the recruitment of proteins that bind simultaneously to both the 5’ and 3′ UTR, not allowing translation proteins to assemble. However, it has also been noted that Sxl can also repress translation of RNAs that do not contain a poly(A) tail, or more generally, 3′ UTR. The elements of a eukaryotic and prokaryotic 5′ UTR differ greatly. The prokaryotic 5′ UTR contains a ribosome binding site (RBS), also known as the Shine Dalgarno sequence (AGGAGGU) which is usually 3-10 base pairs upstream from the initiation codon."}, {"url": "http://www.answers.com/Q/Can_clones_isolated_from_cDNA_libraries_contain_promoter_sequences", "passage_text": "A genomic library will contain all the exons, introns, and transcriptional factors that are not found in the cDNA library. **2/24/2011** cDNA library does contain exons, which is the protein coding regions. + 42 others found this useful. Preeti Shah. Only protein coding regions will be present in a cDNA library. This also means that a cDNA library is often times tissue specific. Since the expression of mRNAs will be different in different tissues of the organism it will appear different then a genomic library."}, {"url": "http://humangenes.org/cdna-complementary-dna", "passage_text": "cDNA (Complementary DNA). The term cDNA refers to complementary DNA. cDNA is known to be synthesized, or manufactured from an mRNA or messenger RNA template. It is synthesized in a reaction that is catalyzed by the reverse transcriptase and DNA polymerase enzymes. "}, {"url": "https://en.wikipedia.org/wiki/Three_prime_untranslated_region", "passage_text": "In molecular genetics, the three prime untranslated region (3'-UTR) is the section of messenger RNA (mRNA) that immediately follows the translation termination codon. An mRNA molecule is transcribed from the DNA sequence and is later translated into protein. Another set of elements that is present in both the 5' and 3'-UTR are iron response elements (IREs). The IRE is a stem-loop structure within the untranslated regions of mRNAs that encode proteins involved in cellular iron metabolism."}, {"url": "http://passel.unl.edu/pages/informationmodule.php?idinformationmodule=959197140&topicorder=15&maxto=16", "passage_text": "2) A cDNA library will not contain a clone of every gene of the organism. A genomic library could have a clone of every gene for that organism.. 3) If a gene is expressed at a high level in certain tissues, a cDNA library made from mRNA of that tissue will contain many copies of that gene. Other clones will rarely or never be found in a cDNA library because the gene is not expressed or is rarely expressed. The “c” in cDNA stands for copy because a double stranded DNA copy is made from a mRNA. Because of the different starting material, cDNA libraries will have some key distinctions from a genomic library. The reasons for the differences above are because of the nature of gene expression."}, {"url": "https://en.wikipedia.org/wiki/Three_prime_untranslated_region", "passage_text": "The 3'-UTR also has silencer regions which bind to repressor proteins and will inhibit the expression of the mRNA. Many 3'-UTRs also contain AU-rich elements (AREs). Proteins bind AREs to affect the stability or decay rate of transcripts in a localized manner or affect translation initiation. Another set of elements that is present in both the 5' and 3'-UTR are iron response elements (IREs). The IRE is a stem-loop structure within the untranslated regions of mRNAs that encode proteins involved in cellular iron metabolism."}, {"url": "http://www.answers.com/Q/Does_a_cDNA_library_have_only_exons", "passage_text": "A genomic library will contain all the exons, introns, and transcriptional factors that are not found in the cDNA library. **2/24/2011** cDNA library does contain exons, which is the protein coding regions. + 42 others found this useful. Preeti Shah. A cDNA library consists only of genes that are expressed, hence they do contain only exons. They contain no introns."}, {"url": "http://biology.stackexchange.com/questions/11377/difference-between-cds-and-cdna", "passage_text": "A cDNA sequence is derived from the transcript by reverse transcription and will, therefore, also contain the 5' and 3' UTRs. For example, see this schematic diagram of an unspliced transcript: The CDS of the gene depicted in image above will only contain the ATG, the STOP and the two green regions (exons). The cDNA will contain all that and, in addition, the two UTRs. Of course, both the cDNA and the CDS will not contain the introns."}]