[{"url": "http://www.answers.com/Q/Do_butterball_turkeys_contain_MSG", "passage_text": "They most likely contain MSG since most turkeys do, but you won't see it listed in the ingredients, (even though it's the law) and here's why. A company can, and many times will, use MSG as a secondary ingredient in things such as Maltodextrin, Modified Food Starch or when you read the words natural flavorings. "}, {"url": "https://suenawilliams.wordpress.com/2015/10/17/the-facts-about-peanut-butter-and-msg/", "passage_text": "I checked the ingredients of several different popular brands of peanut butter and found that ALL of them include such MSG-reaction-causing ingredients as hydrogenated vegetable oil, soybean oil, hydrogenated cottonseed oil, rapeseed oil, soy extract and wheat. Great Value notes the product also contains traces of wheat and soy. If you have an MSG allergy and enjoy peanut butter as I do, it’s time to avoid the popular brands of peanut butter on the market and jettison them from your kitchen cabinet."}, {"url": "http://www.comfytummy.com/2010/02/02/natural-flavorings-in-butter/", "passage_text": "Because the added synthesized industrial MSG is a relatively small amount to the butter it is in, the MSG does not have to be put on the label. I was grossed out, so I set out to learn how to make my own butter from cream from a local organic free range, grass eating cows. So I immediately started thinking about the times I used butter and if any of my MSG symptoms were triggered. But of course, butter is such a common component in so many dishes, I couldn’t tell. I decided that I would do without butter unless I could find some without these natural flavorings."}, {"url": "https://suenawilliams.wordpress.com/2015/10/17/the-facts-about-peanut-butter-and-msg/", "passage_text": "The Facts About Peanut Butter and MSG. Let me begin by saying, I LOVE peanut butter. I’m not the type to eat it straight out of the jar or anything, but I love spreading it on warm toast and on crackers. This was THE MOST shocking thing I’ve discovered yet in my research of MSG In foods. Basically, EVERY SINGLE brand of peanut butter on supermarket shelves contains MSG. Great Value notes the product also contains traces of wheat and soy. If you have an MSG allergy and enjoy peanut butter as I do, it’s time to avoid the popular brands of peanut butter on the market and jettison them from your kitchen cabinet."}, {"url": "http://www.comfytummy.com/2010/02/02/natural-flavorings-in-butter/", "passage_text": "As someone who is EXTREMELY sensitive to MSG, I am always wary of “natural flavoring” as it may contain some form of it. So I immediately started thinking about the times I used butter and if any of my MSG symptoms were triggered. But of course, butter is such a common component in so many dishes, I couldn’t tell. I decided that I would do without butter unless I could find some without these natural flavorings."}, {"url": "http://euphory.com/ingredients-that-contain-hidden-msg/", "passage_text": "What many don’t know is that common ingredients used by food manufacturers, contain processed free glutamic acid (the harmful component of monosodium glutamate) that causes these reactions. It’s important to know that MSG stands for ALL processed glutamic acid, not just monosodium glutamate. Glutamic acid found in unadulterated protein does not cause adverse reactions. To cause adverse reactions, the glutamic acid must have been processed/manufactured or come from protein that has been fermented."}, {"url": "http://www.answers.com/Q/Is_there_MSG_in_peanut_butter", "passage_text": "Peanuts are better than peanut butter because peanut butter has  sugar added to it, but it you can buy a healthier version without  the sugar and palm oil and all of the hyd … rogenated oils. Try to  look on the ingredient list and see if there is anything other than  peanuts and salt in there. No. Peanut butter is, at its most basic, ground peanuts (sugar or salt is sometimes added). The consistency, creamy and suggestive of butter, is actually due to the peanut sol … ids being in suspension in the peanut oil that is released when the peanuts are ground up. + 10 others found this useful."}, {"url": "http://www.truthinlabeling.org/II.WhereIsMSG.html", "passage_text": "Autolyzed yeast,  maltodextrin , hydrolyzed pea protein, and sodium caseinate are the common or usual names of some ingredients that contain MSG. Unlike the ingredient called monosodium glutamate, they give the consumer no clue that there is MSG in the ingredient. WWW .truthinlabeling.org -- Home page. Types of products that contain MSG. In general. MSG can be used (and hidden) in processed foods, dietary supplements, cosmetics, personal care products, pharmaceuticals, and the food that is given to pets and other animals."}]