[{"url": "http://www.careersinpublichealth.net/careers/research-data-analyst", "passage_text": "Average Research Data Analyst salaries for job postings in Hawaii are 35% lower than average Research Data Analyst salaries for job postings nationwide. The average salary ranks 50th among states in the country. Average Research Data Analyst salaries for job postings in Montana are 6% lower than average Research Data Analyst salaries for job postings nationwide. The average salary ranks 24"}, {"url": "http://www.careersinpublichealth.net/careers/research-data-analyst", "passage_text": "Average Research Data Analyst salaries for job postings in Tennessee are 7% lower than average Research Data Analyst salaries for job postings nationwide. The average salary ranks 30th among states in the country. Average Research Data Analyst salaries for job postings in Montana are 6% lower than average Research Data Analyst salaries for job postings nationwide. The average salary ranks 24"}, {"url": "http://money.usnews.com/careers/best-jobs/financial-analyst/salary", "passage_text": "Average Financial Analyst Pay vs. Other Best Jobs. The average salary for a financial analyst was $91,620 in 2013, which is slightly less than that of financial advisors ($99,920) and mid-range compared with other occupations on our list of the Best Business Jobs. For example, in 2013, a sales manager made $123,150 and a marketing manager made $133,700. "}, {"url": "http://www.payscale.com/research/AU/Job=Data_Analyst/Salary", "passage_text": "Data Analyst Salary. (Australia). The average pay for a Data Analyst is AU$66,398 per year. Skills that are associated with high pay for this job are Data Modeling, R, and Statistical Analysis. Most people with this job move on to other positions after 20 years in this career. AU$47,969 - AU$91,679"}, {"url": "http://www1.salary.com/Business-Data-Analyst-I-salary.html", "passage_text": "For example the median expected annual pay for a typical Business Data Analyst I in the United States is $55,487 so 50% of the people who perform the job of Business Data Analyst I in the United States are expected to make less than $55,487. Source: HR Reported data as of October 2015. "}, {"url": "http://www.salarylist.com/jobs/Data-Analyst-Salary.htm", "passage_text": "Data Analyst Salary. Data Analyst average salary is $58,941, median salary is $57,781 with a salary range from $22,880 to $625,000. Data Analyst salaries are collected from government agencies and companies. Each salary is associated with a real job position. Data Analyst salary statistics is not exclusive and is for reference only. "}, {"url": "http://www.careersinpublichealth.net/careers/research-data-analyst", "passage_text": "Average Research Data Analyst salaries for job postings in Arizona are 15% lower than average Research Data Analyst salaries for job postings nationwide. The average salary ranks 41st among states in the country. Average Research Data Analyst salaries for job postings in Montana are 6% lower than average Research Data Analyst salaries for job postings nationwide. The average salary ranks 24th"}, {"url": "http://www.salarylist.com/jobs/Flight-Analyst-Salary.htm", "passage_text": "Flight Analyst Salary. Flight Analyst average salary is $80,000, median salary is $80,000 with a salary range from $80,000 to $80,000. Flight Analyst salaries are collected from government agencies and companies. Each salary is associated with a real job position. Flight Analyst salary statistics is not exclusive and is for reference onl"}, {"url": "http://www.careersinpublichealth.net/careers/research-data-analyst", "passage_text": "Average Research Data Analyst salaries for job postings in Pennsylvania are 7% lower than average Research Data Analyst salaries for job postings nationwide. The average salary ranks 27th among states in the country. Average Research Data Analyst salaries for job postings in Montana are 6% lower than average Research Data Analyst salaries for job postings nationwide. The average salary ranks 24"}]