[{"url": "http://www.usbr.gov/ssle/safety/RSHS/appC.pdf", "passage_text": "Reclamation Safety and Health Standards C-2 October 2009 grounding conductor is the same conductor. This is permitted only on the line side of the service disconnect. On the load side of the service disconnect, the neutral cannot be used as the equipment grounding conductor. For example, if you do not have an equipment grounding conductor, but you do have a good ground rod (NEC 250-84 indicates that a good ground rod is 25 ohms), Ohms law (I = V/R) gives the current flow."}, {"url": "http://www.samlexamerica.com/support/faqs/faq16.aspx", "passage_text": "A grounded system is a system in which one of the current-carrying conductors is grounded. An  equipment grounding conductor  is a conductor that does not normally carry current (except under fault conditions) and is also connected to earth. In some areas, the term earthing is used instead of grounding. A  grounded conductor  is a current-carrying conductor that normally carries current and is also connected to earth. Examples are the neutral conductor in AC wiring and the negative conductor in many DC systems."}, {"url": "http://garyklinka.com/necquiz150.htm", "passage_text": "5. Where circuit conductors are spliced within a box, or terminated on equipment within or supported by a box, any equipment grounding conductors associated with those circuit conductors must be spliced or joined in the box or to the box with the devices suitable for the use."}, {"url": "http://www.electrician2.com/electa1/ground2.html", "passage_text": "The Code permits an Equipment Grounding Circuit conductor to be bare or insulated. However, if the conductor is bare there may be some arcing between the bare conductor and the interior of the conduit at points other than the point at which the ground fault occurs. In the second category we could include all industrial plants where a metallic Equipment Grounding Circuit sized per Table 250-122, must be run parallel with and within the conductor enclosure so as to ensure continuity if that circuit is broken owing to corrosion sooner or later."}, {"url": "http://www.prospex.us/DOCS/ELECTRICAL/ELECTRICAL%20SYSTEM%20BONDING%20AND%20GROUNDING%20.pdf", "passage_text": "EQUIPMENT GROUND ING CONDUCTOR An equipment ground ing conductor is a wire that connects non-current-carrying metal parts such as raceways, enclosures, and the metal frames of equipment, appliances, motors, etc. back to the main bonding jumper (also referred to as a “bus link ”). The purpose of grounding is to stabilize voltage in relation to the earth or to another body that serves in place of the earth so that the voltage measured between an unground ed conductor (also referred to as the “hot,” “live,” or phase conductor) and a grounded object is always at the same potential which is zero."}, {"url": "http://www.electrician2.com/electa1/ground2.html", "passage_text": "When a metallic conductor enclosure is used as an Equipment Grounding Circuit Conductor it must have continuity as well as the required conductivity to pass enough current to facilitate the operation of the overcurrent devices. In the second category we could include all industrial plants where a metallic Equipment Grounding Circuit sized per Table 250-122, must be run parallel with and within the conductor enclosure so as to ensure continuity if that circuit is broken owing to corrosion sooner or later."}, {"url": "http://garyklinka.com/necquiz102.htm", "passage_text": "When a single equipment grounding conductor is used for multiple circuits in the same raceway or cable, the single equipment grounding conductor must be sized according to ____. Equipment grounding conductors for feeder taps must be sized in accordance with ____ based on the ampere rating of the circuit protection device ahead of the feeder, but in no case is it required to be larger than the circuit conductors."}, {"url": "http://www.samlexamerica.com/support/faqs/faq16.aspx", "passage_text": "A  grounding electrode conductor  is the conductor between a common single grounding point in the system and the grounding electrode.  Bond  refers to the connection between the grounded conductor, the equipment grounding conductors and the grounding electrode conductor. Bonding is also used to describe connecting all of the exposed metal surfaces together to complete the equipment-grounding conductors. In some areas, the term earthing is used instead of grounding. A  grounded conductor  is a current-carrying conductor that normally carries current and is also connected to earth. Examples are the neutral conductor in AC wiring and the negative conductor in many DC systems."}, {"url": "http://www.electrician2.com/electa1/ground2.html", "passage_text": "Whether to use a metallic Equipment Grounding Circuit per Table 250-122 or to rely on the conductor enclosure to serve as the Equipment Grounding Circuit is a question that must be answered by the design engineer, electrical contractor, electrician, and electrical inspector. In the second category we could include all industrial plants where a metallic Equipment Grounding Circuit sized per Table 250-122, must be run parallel with and within the conductor enclosure so as to ensure continuity if that circuit is broken owing to corrosion sooner or later."}, {"url": "http://www.electrical-forensics.com/EquipGnd/EquipGnd.html", "passage_text": "Figure 1 is the schematic of an appliance without an equipment grounding conductor connected to the metal chassis. The appliance is sitting on a wood table, and therefore isolated from earth ground. The appliance is OFF, but a wire insulation fault has occurred before the switch. Furthermore, there is usually considerable resistance between the appliance and earth ground. For example, the appliance may be sitting on a concrete slab. Figure 3 depicts the same appliance with"}]