[{"url": "http://a-z-animals.com/animals/dingo/", "passage_text": "The dingo is medium-sized canine natively found on the Australian continent and even into South-East Asia. The dingo is thought to have once been a domestic dog that has returned to living in the wild now for thousands of years."}, {"url": "https://en.wikipedia.org/wiki/Dingo", "passage_text": "Compared to most domestic dogs, the bark of a dingo is short and monosyllabic, and is rarely used. Barking was observed to make up only 5% of vocalisations. Dog barking has always been distinct from wolf barking. Australian dingoes bark mainly in swooshing noises or in a mixture of atonal and tonal sounds. Dingo-like domestic dogs and dingo-hybrids can be generally distinguished from pure dingoes by their fur colour, since there is a wider range of colours and patterns among them than among dingoes."}, {"url": "http://www.australiazoo.com.au/our-animals/mammals/dingoes/", "passage_text": "Dingoes are Australia's wild dog. They arrived in Australia about 5,000 years ago-brought to Australian shores by Indonesian Seafarers. Dingoes do not bark, but howl like wolves. (Canis lupus dingo). The Dingo is a medium sized dog weighing between 13-24kg, with males usually heavier than the females. "}, {"url": "https://en.wikipedia.org/wiki/Dingo", "passage_text": "The dingo is the largest terrestrial predator in Australia, and plays an important role as an apex predator. However, the dingo is seen as a pest by livestock farmers due to attacks on animals. Dingo-like domestic dogs and dingo-hybrids can be generally distinguished from pure dingoes by their fur colour, since there is a wider range of colours and patterns among them than among dingoes."}, {"url": "https://en.wikipedia.org/wiki/Dingo", "passage_text": "Dingo conservation efforts focus primarily on preventing interbreeding between dingoes and other domestic dogs in order to conserve the population of pure dingoes. This is extremely difficult and costly. Conservation efforts are hampered by the fact that it is not known how many pure dingoes still exist in Australia. Dingo-like domestic dogs and dingo-hybrids can be generally distinguished from pure dingoes by their fur colour, since there is a wider range of colours and patterns among them than among dingoes."}, {"url": "http://animals.nationalgeographic.com/animals/mammals/dingo/", "passage_text": "The dingo is legendary as Australia's wild dog, though it also occurs in Southeast Asia. The Australian animals may be descendents of Asian dingoes that were introduced to the continent some 3,000 to 4,000 years ago. "}, {"url": "http://a-z-animals.com/animals/dingo/", "passage_text": "The dingo is a carnivorous animal and one of Australia's most dominant predators. The diet of the dingo is similar to that of other pack-canines such as wolves, as they hunt rabbits, rodents, small mammals, lizards, birds, wallabys and even the occasional kangaroo. The dingo is thought to have once been a domestic dog that has returned to living in the wild now for thousands of years."}, {"url": "http://www.dogbreedinfo.com/dingo.htm", "passage_text": "Puppies cost from $500 -$1000 Australian. A Dingo Farm in Australia has over 100 dingoes and is breeding the dog to ensure it is around for prosperity in the 'pure bloodline.' Owners of the Dingo need to display a natural authority over the dog. Calm, but firm, confident and consistent with the rules. Proper canine to human communication is essential. The Dingo is a breed that has never been fully domesticated. It is almost never kept as a companion. This is partly due to its remote isolation, but also through lack of human intervention. Untrained Dingoes are unsuitable child companions and cannot easily be obedience trained."}, {"url": "http://www.merriam-webster.com/dictionary/dingo", "passage_text": "Full Definition of DINGO. : a wild dog (Canis dingo) of Australia having a tan or reddish coat that is often considered a subspecies (C. familiaris dingo) of the domestic dog. See dingo defined for English-language learners. See dingo defined for kids. ADVERTISEMENT. "}, {"url": "http://australianmuseum.net.au/dingo", "passage_text": "Animal Species: Dingo. The Dingo is Australia's wild dog. It was probably introduced to Australia by Asian seafarers about 4,000 years ago. Its origins have been traced back to a south Asian variety of Grey Wolf (Canis lupus lupus). Identification. The Dingo, Canis lupus dingo, is a placental mammal which means it gives birth to live young, feeds its young via mammary glands that produce milk and has fur or hair of some form. The colour of a Dingo's coat is largely determined by where it lives. The 'standard' coat colour is ginger with white feet."}]