[{"url": "http://www.ehow.com/facts_7195356_difference-between-engineered-laminate-flooring_.html", "passage_text": "Both engineered hardwood and laminate are flooring options for those who like the look of natural wood but want a smaller price tag. Engineered hardwood and laminate floors are both very resistant to damage."}, {"url": "http://www.coswick.com/blog/deciding-between-hardwood-and-laminate-flooring-which-is-better", "passage_text": "Engineered hardwood flooring is a type of wood floor that consists of several wood or plywood layers. Bottom and middle layers are manufactured from cross-laid solid wood or plywood planks. The top layer consists of a solid sawn wood lamella, often stained and prefinished in factory setting."}, {"url": "http://www.youtube.com/watch?v=ODLzn_NVED8", "passage_text": "This video describes the difference between engineered hardwood flooring and laminate flooring. Description includes how each is made, maintenance, durability, and price. Visit http://www.prefloors.com or call 408-294-1970 today for a free estimate."}, {"url": "http://www.coswick.com/blog/deciding-between-hardwood-and-laminate-flooring-which-is-better", "passage_text": "Most solid hardwood floors can be sanded up to 6-7 times, while quality engineered hardwood floors – up to 4 times. Given that the average time between sanding is 10 – 20 years, it’s easy to see how real wood floors easily outlast laminate."}, {"url": "http://www.coswick.com/blog/deciding-between-hardwood-and-laminate-flooring-which-is-better", "passage_text": "Appearance and Aesthetics. In terms of aesthetics, the difference between hardwood and laminate floors is glaringly obvious. Real wood is characterized by tremendous texture variation of the wood grain, which is why no two planks of hardwood flooring, whether solid or engineered, appear exactly alike."}, {"url": "http://www.ehow.com/facts_7195356_difference-between-engineered-laminate-flooring_.html", "passage_text": "Cost. Laminate floors are often less expensive than engineered hardwood floors, though the cost of an engineered floor depends on the type of wood used for the top layer. Harder, thicker woods cost more."}, {"url": "http://www.coswick.com/blog/deciding-between-hardwood-and-laminate-flooring-which-is-better", "passage_text": "Laminate floors have a relatively short life-span as compared to hardwood flooring. It is estimated that on average, a laminate floor will need to be replaced after no more than 20 years. Twenty years is the time it usually takes for a family to wear down the floor finish."}, {"url": "http://www.ehow.com/facts_7195356_difference-between-engineered-laminate-flooring_.html", "passage_text": "Makeup. Laminate floors are made from different synthetic materials to make them lighter and cheaper than wood. Engineered hardwood floors feature a coating made from different types of natural wood and a base layer made of plywood."}, {"url": "http://cleanmyspace.com/hardwood-vs-laminate-vs-engineered-hardwood-floors-whats-the-difference/", "passage_text": "Hardwood floors are made from solid, natural wood and depending on the kind of floor you want, you can purchase a variety of wood species. The entire plank is made from wood, it is the only material used in the manufacturing of hardwood floors. Modern hardwood is typically made with a tongue and groove system for easy installation. Hardwood floor is easy to sand and refinish, and requires a healthy amount of maintenance to keep them looking great."}]