[{"url": "http://www.asianinfo.org/asianinfo/korea/history/koryo_dynasty.htm", "passage_text": "Koryo Dynasty. Shilla was torn to pieces by rebel leaders such as Kyon Hwon who proclaimed the Latter Paekche (Hu Paekche) state in Chongju in 900, and Kung Ye who proclaimed to Latter Koguryo (Hu Koguryo) state, the following year at Kaesong. "}, {"url": "http://www.turtlepress.com/training/taekwondo-black-belt-poomse-symbolism", "passage_text": "Poomse Koryo. Poomse Koryo symbolizes seonbae which means a learned man, who is characterized by a strong martial spirit as well as a righteous spirit. The choonbi-sugi (ready stance) is tongmilgi which promotes concentration by placing the hands between the upper and lower abdomen, the center of ki in the body. The movement line of Koryo represents the Chinese character for seonbae or seonbi, which means a learned man or a man of virtue in Korean. For the 1st dan. Poomse Ilyeo represents the harmonization of body and spirit, which is the culmination of martial arts practice. The line of movements symbolizes the Buddhist mark which means a state of perfect selflessness where origin, substance and service come into congruity. For the 7th Dan."}, {"url": "http://sataekwondo.8m.com/koryo.htm", "passage_text": "Koryo poomsae symbolizes 'seonbae' which means a learned man, who is characterized by a strong martial spirit as well as a righteous learned man's spirit. The spirit had been inherited through the ages of Koguryo, Pahae and down to Koryo, which is the background of organizing the Koryo poomsae. . . . Koryo (Korea) is the name of an ancient dynasty (A.D. 918-1392) in Korea. The English word 'Korea' is originated from the name of 'Koryo' Dynasty. Koryo's legacy to the Korean people is very significant."}, {"url": "http://archive.artsmia.org/art-of-asia/history/korea-koryo-dynasty.cfm", "passage_text": "Koryo Dynasty. The last Silla king abdicated the throne in the early 10th century and married the daughter of the upstart General Wang Kon, who founded the Koryo dynasty (918-1392). "}, {"url": "http://sataekwondo.8m.com/koryo.htm", "passage_text": "Koryo symbolizes the high-spirited Koryo people.The Koryo people emphasized moderation in actions. The 1975 Taekwondo poomse textbook describes Koryo as follows: Koryo (Korea) is the name of an ancient dynasty (A.D. 918-1392) in Korea. The English word 'Korea' is originated from the name of 'Koryo' Dynasty. Koryo's legacy to the Korean people is very significant."}, {"url": "http://encyclopedia2.thefreedictionary.com/Koryo", "passage_text": "Koryo was founded by Wang Kon, and its capital was the city of Kaegyong (modern Kaesong). Under Wang Kon’s successors it became a centralized state, in which the state peasants (yangmin) were the main tax-paying stratum and also performed military service. In the 13th century Koryo was subject to Mongol invasions. After the Mongols were driven from Koryo (in 1356), the supporters of Yi Song-gye came to power (1388) as the result of a prolonged struggle. Yi Song-gye became king in 1392, thereby founding the new Yi dynasty. Under the Yi dynasty the state was renamed Choson and the capital was moved to Seoul. 1  Facebook"}, {"url": "http://masterkamrul.blogspot.com/2013/03/meaning-of-taekwondo-koryo-poomse.html", "passage_text": "It has 30 movements and is the name of the ancient Korean dynasty (A.D 918 – 1392) in which the English word Korea was derived from. This poomse is significant as it symbolizes the great fortitude displayed by the people who were persistently defeating the aggression of Mongolians who were sweeping Asia at the time. "}, {"url": "http://www.taekwondopatterns.info/koryo/", "passage_text": "Number of Movements: 50. Advancement: This is the pattern required to advance from 1st Kup Red Belt with Black Tag to 1st Degree Black Belt. Meaning of Pattern: Koryo (Korea) is the name of an old Korean Dynasty. The people from the Koryo-period defeated the Mongolian aggressors. Their spirit is reflected in the movements of the Poomse Koryo. "}, {"url": "http://www.martialtalk.com/threads/the-meaning-of-koryo-poomsae.93063/", "passage_text": "1st and 2nd Dans, and the reason why I say that is because of my. understanding of Koryo. The 1975 Taekwondo poomsae textbook describes Koryo as follows: Koryo. (Korea) is the name of an ancient dynasty (A.D. 918-1392) in Korea. The English word 'Korea' is originated from the name of 'Koryo'. Dynasty. "}]