[{"url": "http://www.radgray.com/mri/brain-mri/subdural-hygroma", "passage_text": "Subdural hygroma. A subdural hygroma is a subdural body of cerebrospinal fluid (CSF), without blood. Most subdural hygromas are believed to be derived from chronic subdural hematomas. It is commonly seen in elderly patients after minor trauma but can be seen in children after an infection. "}, {"url": "http://www.babycenter.com/400_cystic-hygroma-11-weeks_2045569_525.bc", "passage_text": "Cystic Hygroma @ 11 weeks. Share. My husband and I were devastated to learn just over a week ago that at 11 weeks, our baby has a condition called cystic hygroma. We were told that, in our baby's case, this pocket of fluid under the skin extends from about the base of the head to the mid area of his/her legs. "}, {"url": "http://www.merriam-webster.com/medical/hygroma", "passage_text": "Medical Definition of HYGROMA. : a cystic tumor of lymphatic origin. What made you want to look up hygroma? Please tell us where you read or heard it (including the quote, if possible). View Seen & Heard Highlights from Around the Site. Test Your Vocabulary! Test Your Vocabulary! "}, {"url": "http://www.thefreedictionary.com/hygroma", "passage_text": "hygroma. n. 1. (Veterinary Science) pathol a swelling in the soft tissue that occurs over a joint, usually caused by repeated injury. [C20: from hygro- + -oma]. Translations. "}, {"url": "http://www.ncbi.nlm.nih.gov/pubmed/18332811", "passage_text": "Traumatic subdural hygromas: proposed pathogenesis based classification. Zanini MA(1), de Lima Resende LA, de Souza Faleiros AT, Gabarra RC. Author information: (1)Department of Neurology and Psychiatry, School of Medicine of Botucatu, Sao São Paulo State, University, Botucatu. brazil "}, {"url": "http://www.rightdiagnosis.com/c/cystic_hygroma/intro.htm", "passage_text": "Disease Topics Related To Cystic Hygroma. Research the causes of these diseases that are similar to, or related to, Cystic Hygroma: 1  Posterior triangle tumour. 2  Congenital multiloculated lymphatic lesion. 3  Branchial left cyst. 4  Fetal hydrops. Evidence Based Medicine Research for Cystic Hygroma. Medical research articles related to Cystic Hygroma include: 1  Histopathology Neck-Lymphangioma (cystic hygroma). 2  Turner Syndrome: Diagnosis and Management. 3  Characteristics and outcome of fetal cystic hygroma diagnosed in the first trimester."}, {"url": "http://medical-dictionary.thefreedictionary.com/hygroma", "passage_text": "cystic hygroma, hygroma cysticum. an endothelium-lined, fluid-containing lesion of lymphatic origin. elbow hygroma. a fluid-filled, painless, subcutaneous swelling over the point of the elbow involving the formation of a false bursa. Occurs mainly in the large breeds of dogs and in horses where it is called shoe boil. hock hygroma. a swelling of the subcutaneous bursa over the tuber calcis. The initial soft fluctuating swelling is replaced by a firm fibrous capsule to form a hygroma. hygroma. an accumulation of fluid in a sac, cyst or bursa. carpal hygroma. large fluid-filled subcutaneous sac on the anterior aspect of the carpus caused by trauma. Carpal"}, {"url": "http://www.childrenshospital.vanderbilt.org/services.php?mid=8705", "passage_text": "Cystic hygromas are cysts or a group of cysts found mostly in the neck. Cystic hygromas are caused by an error in the development of lymph sacs and lymph vessels as the baby is developing during pregnancy. By the end of the fifth week of pregnancy, the baby's lymphatic tissues form as lymph sacs develop from veins."}]