[{"url": "http://www.answers.com/Q/What_does_tingling_and_numbness_in_your_left_arm_mean", "passage_text": "Tingling and numbness in your arm can mean a number of things, from minor to major or life threatening. The only way to be sure what the tingling means is to consult your health care provider. Read on for more information."}, {"url": "http://www.wisegeekhealth.com/what-are-the-most-common-causes-of-forearm-tingling.htm", "passage_text": "Forearm tingling has a number of possible causes, including diabetes and MS. Tennis elbow is a condition resulting from the overuse of the wrist and forearm. Commonly used to treat tennis elbow, an elbow sleeve provides pressure and support for muscles and connective tissues around the forearm and elbow. Carpal tunnel syndrome can cause forearm tingling."}, {"url": "http://www.wisegeekhealth.com/what-are-the-most-common-causes-of-forearm-tingling.htm", "passage_text": "Forearm tingling can be attributed to a variety of minor and major conditions. For instance, it may be caused by tennis elbow, nerve damage, carpal tunnel syndrome, chronic paresthesia or multiple sclerosis."}, {"url": "http://www.answers.com/Q/What_does_tingling_and_numbness_in_your_left_arm_mean", "passage_text": "1 If you have tingling and numbness in your left arm, it usually indicates a problem with a disk in your neck around C6/C7 (cervical spine). 2  Of course it depends on where the pain numbness is and how far down it reaches. 3  If it's in the upper arm, then it's more likely at C4/5 or C5/C6."}, {"url": "http://www.chiropractic-help.com/tingling-in-arms-and-hands.html", "passage_text": "Tingling in arms and hands is not the only sensation that may be caused. You may also have numbness, weakness and arm pain. The pain is of a deep aching nature, and can be very severe, and is often worst at night."}, {"url": "http://symptomchecker.webmd.com/multiple-symptoms?symptoms=numbness-or-tingling|numbness-or-tingling|pain-or-discomfort|tenderness-to-touch&symptomids=164|164|1|266&locations=45|47|45|45", "passage_text": "Advertisement. WebMD Symptom Checker helps you find the most common medical conditions indicated by the symptoms numbness or tingling (forearm (flexor)), numbness or tingling (wrist), pain or discomfort and tenderness to touch including Tendinitis, Phlebitis, and Median nerve injury."}]