[{"url": "http://www.scientificera.com/windows/45-windows/224-what-is-a-domain-controller.html", "passage_text": "A domain controller is a great tool for system administrators, as it allows them to grant or deny users access to system-wide resources, such as printers, documents, folders, network locations etc, via a single username and password. Domain Controller Compatibility with Operating Systems. A domain controller can communicate with all domain members or workstations but there is a limitation to the Active Directory (AD) System. The limitation is that the domain controller must host a Windows-based operating system."}, {"url": "http://www.informit.com/articles/article.aspx?p=26866&seqNum=4", "passage_text": "Domain Controller. A domain controller is a server containing a copy of the Active Directory. All domain controllers are peers, and maintain replicated versions of the Active Directory for their domains. The domain controller plays an important role in both the logical and physical structure of the Active Directory. "}, {"url": "http://serverfault.com/questions/84732/what-is-a-domain-controller-when-is-it-needed-and-how-to-set-it-up", "passage_text": "You have to add a domain controller to your network when you decide that it is cost-effective for your organization to have the unified system of credentials, users, groups, and permissions that an Active Directory domain provides, in addition to the machine and user policies provided by Group Policy. A domain controller in a computer network is the center piece of the Active Directory (AD) services that provides domain-wide services to the users, such as security policy enforcement, user authentication, and access to resources."}, {"url": "http://www.scientificera.com/windows/45-windows/224-what-is-a-domain-controller.html", "passage_text": "A domain controller in a computer network is the centrepiece of the Active Directory (AD) services that provides domain-wide services to the users, such as security policy enforcement, user authentication, and access to resources. Domain Controller Compatibility with Operating Systems. A domain controller can communicate with all domain members or workstations but there is a limitation to the Active Directory (AD) System. The limitation is that the domain controller must host a Windows-based operating system."}, {"url": "http://serverfault.com/questions/84732/what-is-a-domain-controller-when-is-it-needed-and-how-to-set-it-up", "passage_text": "Once that is understood, a domain controller (DC) or network domain controller is a Windows-based computer system that is used for storing user account data in a central database. A domain controller in a computer network is the center piece of the Active Directory (AD) services that provides domain-wide services to the users, such as security policy enforcement, user authentication, and access to resources."}, {"url": "https://technet.microsoft.com/en-us/library/cc977987.aspx", "passage_text": "Domain Controllers. A domain controller is a computer that is running Windows 2000 Server and hosts Active Directory. Domain controllers run the KDC service, which is responsible for authenticating domain user logons. Most operations can be made at any domain controller and the effects of these operations (for example, deleting a user object) are replicated to all other domain controllers that store a replica of the same directory partition in which the change occurred."}, {"url": "https://en.wikipedia.org/wiki/Domain_controller", "passage_text": "On Microsoft Servers, a domain controller (DC) is a server that responds to security authentication requests (logging in, checking permissions, etc.) within a Windows domain. Windows Server can be one of three kinds: Active Directory domain controllers, Active Directory member servers and Windows Workgroup stand-alone servers. The term Active Directory Server is sometimes used by Microsoft as synonymous to Domain Controller. The term is discouraged."}, {"url": "http://www.webopedia.com/TERM/D/domain_controller.html", "passage_text": "Abbreviated as DC, domain controller is a server on a Microsoft Windows or Windows NT network that is responsible for allowing host access to Windows domain resources. The domain controllers in your network are the centerpiece of your Active Directory directory service. "}, {"url": "https://msdn.microsoft.com/en-us/library/bb727049.aspx", "passage_text": "Deletions of the lingering objects replicate to the other domain controllers. Any domain controller that is running Windows 2000 Server with SP2, and that does not have the object, logs event ID 1388. In this case, the missing object is revived as a tombstone, and replicates as such. Preferred bridgehead server. This configuration is not recommended for domain controllers running Windows 2000 Server. However, if the domain controller is configured to be a preferred bridgehead server, you must reconfigure the domain controller as a preferred bridgehead server after you reinstall Active Directory."}]