[{"url": "http://www.merriam-webster.com/dictionary/cloture", "passage_text": "Definition of CLOTURE. : the closing or limitation of debate in a legislative body especially by calling for a vote. — cloture transitive verb. ADVERTISEMENT"}, {"url": "http://www.answers.com/Q/What_is_cloture_in_the_US_government", "passage_text": "Whenever they take a Vote of Cloture any further discussion, regarding the bill, is eliminated and thus forces a vote sending it to the next body in the government. There is … a big question if this is constitutional or not. Cloture is when 3/5 of the senate votes to limit each senator to only 1 hour of debate whoch thus kills a filibuster and allows everyone to get a say and to be able to vote. 3 people found this useful."}, {"url": "https://en.wikipedia.org/wiki/Cloture", "passage_text": "Cloture (/ˈkloʊtʃər/ KLOH-chər) is a motion or process in parliamentary procedure aimed at bringing debate to a quick end. It is also called closure or, informally, a guillotine. To invoke cloture to end debate over changing the Senate Rules, the original version of the rule (two-thirds of those Senators present and voting) still applies. The procedure for invoking cloture, or ending a filibuster, is as follows: 1  A minimum of sixteen senators must sign a petition for cloture."}, {"url": "http://www.wisegeek.com/what-is-cloture.htm", "passage_text": "Cloture or closure is a concept in parliamentary procedure, which is the backbone of government in many nations of the world. If a motion for cloture passes, debate on the topic at hand must end, and a vote is taken immediately. The concept can be used to defeat filibusters, and it is also used to move voting along, or to avoid the introduction of amendments which are not relevant to the bill at hand."}, {"url": "http://www.yourdictionary.com/cloture", "passage_text": "1 (law) In legislative assemblies that permit unlimited debate (filibuster); a motion, procedure or rule, by which debate is ended so that a vote may be taken on the matter. 2  For example, in the United States Senate, a three-fifths majority vote of the body is required to invoke cloture and terminate debate. the parliamentary procedure by which debate is closed and the measure under discussion is put to an immediate vote. French cloture, clôture a, closing closing of; debate From Old french; closture From Medieval latin (clostura altered After Classical latin: claustrum see) ; cloister From Classical latin: clausura see. closure"}, {"url": "http://uspolitics.about.com/od/usgovernment/a/filibuster.htm", "passage_text": "The filibuster is a historical method used to delay vote or block debate in the Senate. Some call it unconstitutional, unfair, a historical relic. Others insist that it is a tool that protects the rights of the minority against the tyranny of the majority. 1 This vote-to table the appeal-is procedural and cannot be subjected to a filibuster; it requires only a majority vote (in case of a tie, the Vice President casts the tie-breaking vote). 2  With debate ended, the Senate would vote on the issue at hand; this vote requires only a majority of those voting."}, {"url": "https://en.wikipedia.org/wiki/Cloture", "passage_text": "The cloture procedure originated in the French National Assembly, from which the name is taken. Cloture clôture Is french for ending or. Conclusion it was introduced into The parliament of The United kingdom By William Ewart gladstone to overcome the obstruction of The irish nationalist party and was made permanent in. 1887 To invoke cloture to end debate over changing the Senate Rules, the original version of the rule (two-thirds of those Senators present and voting) still applies. The procedure for invoking cloture, or ending a filibuster, is as follows: 1  A minimum of sixteen senators must sign a petition for cloture."}, {"url": "http://legal-dictionary.thefreedictionary.com/Cloture+motion", "passage_text": "Cloture. The procedure by which debate is formally ended in a meeting or legislature so that a vote may be taken. Cloture is a means of terminating a filibuster, which is a prolonged speech on the floor of the Senate designed to forestall legislative action."}, {"url": "http://uspolitics.about.com/od/usgovernment/a/filibuster.htm", "passage_text": "The filibuster is related to cloture, a rule adopted almost 100 years ago requiring a two-thirds vote. At times this was two-thirds of those voting; for a limited time, it was two-thirds of membership. In 1975, the Senate reduced the number of votes needed to invoke cloture to three-fifths (60) of Senate membership. 1 This vote-to table the appeal-is procedural and cannot be subjected to a filibuster; it requires only a majority vote (in case of a tie, the Vice President casts the tie-breaking vote). 2  With debate ended, the Senate would vote on the issue at hand; this vote requires only a majority of those voting."}, {"url": "http://www.answers.com/Q/What_is_cloture_in_the_US_government", "passage_text": "A cloture can end debate on a topic in Congress and bring it to a  vote. The House of Representatives has strict rules about how long  members can debate a topic. The Senate … , on the other hand, has no  rules regarding filibuster and members can debate as long as they  would like. Cloture is when 3/5 of the senate votes to limit each senator to only 1 hour of debate whoch thus kills a filibuster and allows everyone to get a say and to be able to vote. 3 people found this useful."}]