[{"url": "http://www.livestrong.com/article/149231-side-effects-of-konjac-root/", "passage_text": "Overview. Widely marketed as a weight-loss supplement, the fiber from konjac root, also known as glucomannan, appears to have some other medicinal properties of interest. These include the ability to inhibit absorption of cholesterol and glucose by the gastrointestinal system, as well as strong laxative effects. It is important that they take these properties of the konjac root fiber into consideration before beginning to use products containing glucomannan. The net effect of taking both without first consulting a health professional could be to reduce serum glucose and/or lipids beyond levels that are considered healthy."}, {"url": "http://www.webmd.com/vitamins-supplements/ingredientmono-205-GLUCOMANNAN.aspx?activeIngredientId=205&activeIngredientName=GLUCOMANNAN", "passage_text": "Glucomannan is a sugar made from the root of the konjac plant (Amorphophallus konjac). Glucommanan powder, capsules, and tablets are used as medicine. Glucomannan is used for constipation, weight loss in adults and children, type 2 diabetes, blood sugar control, and lowering cholesterol. In foods, glucomannan is used as a thickener or gelling agent. Glucommanan flour and powder are used in food. Glucomannan might work in the stomach and intestines by absorbing water to form a bulky fiber which treats constipation. It may also slow the absorption of sugar and cholesterol from the gut, helping to control sugar levels in diabetes, and reducing cholesterol levels."}, {"url": "http://www.livestrong.com/article/149231-side-effects-of-konjac-root/", "passage_text": "Widely marketed as a weight-loss supplement, the fiber from konjac root, also known as glucomannan, appears to have some other medicinal properties of interest. It is important that they take these properties of the konjac root fiber into consideration before beginning to use products containing glucomannan. The net effect of taking both without first consulting a health professional could be to reduce serum glucose and/or lipids beyond levels that are considered healthy."}, {"url": "https://en.wikipedia.org/wiki/Glucomannan", "passage_text": "Glucomannan is a water-soluble polysaccharide that is considered a dietary fiber. It is a hemicellulose component in the cell walls of some plant species. Glucomannan is a food additive used as an emulsifier and thickener. Glucomannan is mainly a straight-chain polymer, with a small amount of branching. The component sugars are β-(1→4)-linked D-mannose and D-glucose in a ratio of 1.6:1. The degree of branching is about 8% through β-(1→6)-glucosyl linkages."}, {"url": "http://www.uofmhealth.org/health-library/hn-2852001", "passage_text": "Glucomannan is a water-soluble dietary fiber derived from konjac root (Amorphophallus konjac) . Glucomannan delays stomach emptying, leading to a more gradual absorption of dietary sugar. 4 to 13 grams daily. Glucomannan is a water-soluble dietary fiber that has been shown to significantly reduce total blood cholesterol, LDL cholesterol, and triglycerides, and to raise HDL cholesterol. Glucomannan is a water-soluble dietary fiber that is derived from konjac root."}, {"url": "http://blogs.webmd.com/food-and-nutrition/2012/06/glucomannan-fat-fighting-fiber-or-fraudulent-fad.html", "passage_text": "Glucomannan, the viscous soluble dietary fiber found in the Konjac root, is the secret behind the zero-calorie claim and what makes these noodles so appealing for helping with weight loss efforts. Looking at the effects of glucomannan alone or in combination with other fibers on an older, overweight but not obese population, 165 male and female participants were either given a placebo; glucomannan; or a combination of glucomannan, guar gum, and alginate (derived from seaweed) for 5 weeks."}, {"url": "http://www.konjacfoods.com/noodles/24.htm", "passage_text": "Glucomannan is a dietary fiber that dissolves in water and comes from the root of the Konjac plant, As with most dietary fiber, glucomannan is an effective bulk-forming laxative, meaning that it stimulates the passing of larger stools which can move through the colon smoothly and is easier to eject. Soluble fibers such as Glucomannan have many health-promoting benefits due to their ability to form a soft gel with water. Research indicates that soluble fibers help lower blood cholesterol, slow glucose absorption, lower the Glycemic index and promote regular bowel movements."}, {"url": "http://www.uofmhealth.org/health-library/hn-2852001", "passage_text": "Glucomannan is a water-soluble dietary fiber that has shown to be effective as a bulk-forming laxative. Glucomannan is a water-soluble dietary fiber that is derived from konjac root. Like other sources of fiber, such as psyllium and fenugreek, glucomannan is considered a bulk-forming laxative. 4 to 13 grams daily. Glucomannan is a water-soluble dietary fiber that has been shown to significantly reduce total blood cholesterol, LDL cholesterol, and triglycerides, and to raise HDL cholesterol. Glucomannan is a water-soluble dietary fiber that is derived from konjac root."}, {"url": "https://en.wikipedia.org/wiki/Glucomannan", "passage_text": "Glucomannan is a soluble fiber, and as such, has been investigated for the treatment of constipation. Glucomannan may relieve constipation by decreasing fecal transit time. Glucomannan is mainly a straight-chain polymer, with a small amount of branching. The component sugars are β-(1→4)-linked D-mannose and D-glucose in a ratio of 1.6:1. The degree of branching is about 8% through β-(1→6)-glucosyl linkages."}]