[{"url": "http://www.ourbabynamer.com/meaning-of-Vincent.html", "passage_text": "Vincent is a form of the name Vincere. The names Bence, Bikendi, Bingen, Bixintxo, Uinseann, Vicente, Vikenti, Vince, Vincentas, Vincente, Vinko are all forms of Vincent. Vincent has the diminutives (nicknames) Vic, Vin, Vinnie. Vincent is generally used as a boy's name. It consists of 7 letters and 2 syllables and is pronounced Vin-cent. In the U.S. in 2014, it ranked 104 in baby name popularity for boys with 3744 occurrences. Less than 5 girls were given the name."}, {"url": "http://www.meaning-of-names.com/english-names/vincent.asp", "passage_text": "Meaning of Vincent. English name. In English, the name Vincent means-Conquering.. Other origins for the name Vincent include-English, Latin-American.The name Vincent is most often used as a boy name or male name. English Name Meaning-Conquering. Origin-English."}, {"url": "http://www.ourbabynamer.com/meaning-of-Vincent.html", "passage_text": "English names generally consist of a given name, middle name and family name. Many English speaking countries have fairly flexible naming laws. This allows the multicultural families that live in these countries to merge the naming conventions of their faiths or previous nationalities with their current homeland. Vincent is generally used as a boy's name. It consists of 7 letters and 2 syllables and is pronounced Vin-cent. In the U.S. in 2014, it ranked 104 in baby name popularity for boys with 3744 occurrences. Less than 5 girls were given the name."}, {"url": "http://www.ourbabynamer.com/meaning-of-Vincent.html", "passage_text": "What does Vincent mean, popularity, numerology and more. The name Vincent is of Latin origin. The meaning of Vincent is conquering. It is also of English origin, where its meaning is to conquer. Vincent is generally used as a boy's name. It consists of 7 letters and 2 syllables and is pronounced Vin-cent. In the U.S. in 2014, it ranked 104 in baby name popularity for boys with 3744 occurrences. Less than 5 girls were given the name."}, {"url": "http://www.thinkbabynames.com/meaning/1/Vincent", "passage_text": "Vincent /vin-cent/ [2 sylls.] as a boys' name is pronounced VIN-sent. It is of Latin origin, and the meaning of Vincent is prevailing. From Vincentius. The name ultimately derives from Latin vincere, meaning to conquer. Steadily used since the early Christian days. Saint Vincent de Paul, a 17th-century priest, founded an order of missionary brothers. "}, {"url": "http://www.sheknows.com/baby-names/name/vincent", "passage_text": "English Meaning: The name Vincent is an English baby name. In English the meaning of the name Vincent is: Conquering. Latin Meaning: The name Vincent is a Latin baby name. In Latin the meaning of the name Vincent is: Conquering. American Meaning: The name Vincent is an American baby name. In American the meaning of the name Vincent is: Conquering."}, {"url": "http://www.babynamewizard.com/baby-name/boy/vincent", "passage_text": "Origin of the name Vincent: French form of the Late Latin Vincentius (conquering), which is derived from vincere (to conquer). Var: Vince. From A World of Baby Names by Teresa Norman. Vincent s derived from the Latin name Vincentius meaning conquering (from Latin vincere - to conquer). The French brought the name to the English and the Irish. The Gaelic forms of Vincent are “Uinseann” and “Uinsionn.”."}, {"url": "http://www.babynamewizard.com/baby-name/boy/vincent", "passage_text": "Meanings and history of the name Vincent : | Edit. Vincent s derived from the Latin name Vincentius meaning conquering (from Latin vincere - to conquer). The French brought the name to the English and the Irish. The Gaelic forms of Vincent are “Uinseann” and “Uinsionn.”."}, {"url": "http://www.babynamespedia.com/meaning/Vincent", "passage_text": "Vincent is largely used in the Dutch, English, French, and Scandinavian languages, and it is derived from Latin origins. A biblical name, it is derived from the elements 'vincens' meaning winning, conquering; 'vincere' to win, to conquer. Vincentius (Latin) is an old form of Vincent. The meaning of the name has sometimes been associated with the Christian concept of 'winning' or 'conquering' the sins of the world. "}]