[{"url": "http://www.emedicinehealth.com/urinary_tract_infection_uti/article_em.htm", "passage_text": "Patient Comments Read 40 Comments Share Your Story. A urinary tract infection is an infection that can occur in any area of the urinary tract, including the ureters, bladder, kidneys, or urethra. Bladder infections (cystitis) and urethra infections (urethritis) are most common. Picture of the urinary tract. Urinary tract infections can be categorized as either simple or complicated. 1  Simple UTIs occur in healthy people with normal urinary tracts. 2  This is the type of UTI that occurs most frequently in women."}, {"url": "http://www.mayoclinic.org/diseases-conditions/urinary-tract-infection/basics/causes/CON-20037892", "passage_text": "Causes. Urinary tract infections typically occur when bacteria enter the urinary tract through the urethra and begin to multiply in the bladder. Although the urinary system is designed to keep out such microscopic invaders, these defenses sometimes fail. The most common UTIs occur mainly in women and affect the bladder and urethra. 1  Infection of the bladder (cystitis). 2  Infection of the urethra (urethritis). 3  Symptoms. 4  Risk factors."}, {"url": "http://www.medicalnewstoday.com/articles/189953.php", "passage_text": "A urinary tract infection (UTI) is an infection of any part of the urinary system. 2 Most infections involve the lower urinary tract. The urinary tract is comprised of the bladder, kidneys, ureters and urethra. Urinary tract infections are the second most common type of infection in the body and account for around 8.1 million visits to health care providers each year. Here are some key points about urinary tract infection. More detail and supporting information is in the main article. 1  40-50% of women have at least one urinary tract infection (UTI) during their lifetime. 2  20-30% have a recurrent UTI (2 infections in 6 months, or more than 3 infections a year)."}, {"url": "http://www.webmd.com/a-to-z-guides/urinary-tract-infections-in-teens-and-adults-cause", "passage_text": "Bacteria that enter the urethra and travel up the urinary tract are the usual cause of urinary tract infections (UTIs). Bacteria that normally live in the large intestine and are present in feces (stool) are the most common source of infection. "}, {"url": "http://www.mayoclinic.org/diseases-conditions/urinary-tract-infection/basics/definition/con-20037892", "passage_text": "Male urinary system. A urinary tract infection (UTI) is an infection in any part of your urinary system — your kidneys, ureters, bladder and urethra. Most infections involve the lower urinary tract — the bladder and the urethra. Women are at greater risk of developing a UTI than men are. Infection limited to your bladder can be painful and annoying. However, serious consequences can occur if a UTI spreads to your kidneys."}, {"url": "http://www.cdc.gov/getsmart/community/for-patients/common-illnesses/uti.html", "passage_text": "Causes. UTIs occur when bacteria enter and infect the urinary tract. UTIs can affect several parts of the urinary tract, but the most common type of UTI is a bladder infection (also known as cystitis). Urinary tract infections (UTIs) are among the most common infections in people, and antibiotic treatment is usually helpful in treating an infection. Your healthcare professional will be able to determine if you or your child has a UTI and what antibiotic is needed."}, {"url": "http://my.clevelandclinic.org/health/diseases_conditions/hic_Urinary_Tract_Infections", "passage_text": "Sometimes, however, bacteria from outside the body get into the urinary tract, and cause infection and inflammation. This is a urinary tract infection. The infection can involve the urethra (a condition called urethritis), kidneys (a condition called pyelonephritis) or bladder, (a condition called cystitis). A urinary tract infection causes the lining of the urinary tract to become red and irritated, which may produce some of the following symptoms: 1  Pain in the flank (side), abdomen or pelvic area. 2  Pressure in the lower pelvis."}, {"url": "http://www.mayoclinic.org/diseases-conditions/urinary-tract-infection/basics/causes/CON-20037892", "passage_text": "The most common UTIs occur mainly in women and affect the bladder and urethra. 1  Infection of the bladder (cystitis). 2  This type of UTI is usually caused by Escherichia coli (E. coli), a type of bacteria commonly found in the gastrointestinal (GI) tract. 3  However, sometimes other bacteria are responsible. The most common UTIs occur mainly in women and affect the bladder and urethra. 1  Infection of the bladder (cystitis). 2  Infection of the urethra (urethritis). 3  Symptoms. 4  Risk factors."}, {"url": "https://en.wikipedia.org/wiki/Urinary_tract_infection", "passage_text": "Lower urinary tract infection is also referred to as a bladder infection. The most common symptoms are burning with urination and having to urinate frequently (or an urge to urinate) in the absence of vaginal discharge and significant pain. Symptoms from a lower urinary tract include painful urination and either frequent urination or urge to urinate (or both); while the symptoms of pyelonephritis include fever and flank pain in addition to the symptoms of a lower UTI."}, {"url": "http://www.mayoclinic.org/diseases-conditions/urinary-tract-infection/basics/causes/CON-20037892", "passage_text": "1 Infection of the bladder (cystitis). 2  This type of UTI is usually caused by Escherichia coli (E. coli), a type of bacteria commonly found in the gastrointestinal (GI) tract. 3  However, sometimes other bacteria are responsible. 4  Sexual intercourse may lead to cystitis, but you don't have to be sexually active to develop it. The most common UTIs occur mainly in women and affect the bladder and urethra. 1  Infection of the bladder (cystitis). 2  Infection of the urethra (urethritis). 3  Symptoms. 4  Risk factors."}]