[{"url": "http://www.homewyse.com/services/cost_to_remove_bathroom_tile.html", "passage_text": "Get an INSTANT estimate of the cost to Remove Bathroom Tile! Our free calculator uses recent, trusted data to estimate costs for your Bathroom Tile Removal project. For a basic 120 square feet project in zip code 47474, the benchmark cost to Remove Bathroom Tile ranges between $2.95 - $6.25 per square foot* . To estimate costs for your project: 1. Set Project Zip Code Enter the Zip Code for the location where labor is hired and materials purchased."}, {"url": "http://www.homewyse.com/services/cost_to_remove_tile.html", "passage_text": "Our free calculator uses recent, trusted data to estimate costs for your Tile Removal project. For a basic 120 square feet project in zip code 47474, the benchmark cost to Remove Tile ranges between $2.71 - $5.77 per square foot* . To estimate costs for your project: 1. Set Project Zip Code Enter the Zip Code for the location where labor is hired and materials purchased. 2."}, {"url": "http://home.costhelper.com/tile-roof.html", "passage_text": "1 Concrete tiles cost about $4.50-$9 a square foot for installing standard-grade tiles, or $7,650-$19,000 for a basic roof on a one-story ranch-style home (1,700-2,100 square feet of roof). 2  It runs $7-$10 or more a square foot for deluxe concrete tiles, or $11,900-$21,000 or more for 1,700-2,100 square feet."}, {"url": "http://www.homewyse.com/services/cost_to_remove_tile.html", "passage_text": "For a basic 120 square feet project in zip code 47474, the benchmark cost to Remove Tile ranges between $2.71 - $5.77 per square foot* . To estimate costs for your project: 1. Set Project Zip Code Enter the Zip Code for the location where labor is hired and materials purchased. 2."}, {"url": "https://flooring.installationcalculator.com/tile-flooring-installation-calculator/", "passage_text": "$1.50 per square foot for the tile multiplied by 250 square feet, which equals $375. Add in 10% and the total for flooring materials comes to $412.50. For labor, $3 times 250 square feet equals $750. No need to add 10% here. Add in the removal and haul away for the carpeting and the total labor cost is $900."}]