[{"url": "http://healthyeating.sfgate.com/many-carbohydrates-banana-weighs-37-ounces-8993.html", "passage_text": "Natural Sugars. Of the 23 grams of carbs in a small 3.7-ounce banana, 12 grams are from natural sugar, a type of carbohydrate. The American Heart Association recommends limiting added sugars to 38 grams for most men and 25 grams daily for the majority of women. This means when eating 2,000 calories daily, aim for 225 to 325 grams of carbs and when following a 2,500-calorie plan, shoot for 281 to 406 grams of carbs each day. Of the 23 grams of carbs in a small 3.7-ounce banana, 12 grams are from natural sugar, a type of carbohydrate."}, {"url": "https://answers.yahoo.com/question/index?qid=20070611120448AAy1ank", "passage_text": "Report Abuse. One medium banana contains 1 gram of protein and 3 grams of dietary fiber. try this website for other fruits and further info; http://www.healthalternatives2000.com/fr... Dan G · 8 years ago. Thumbs up"}, {"url": "http://www.theglobeandmail.com/life/health-and-fitness/ask-a-health-expert/why-does-my-trainer-tell-me-bananas-are-bad-for-me/article4545026/", "passage_text": "Not so. A medium banana has 105 calories and 27 grams of carbohydrate. Not much more than many other types of fruit: 1 medium pear (103 calories, 27 gm carb), 1 medium apple (95 calories, 25 gm carb), 1 cup pineapple (82 calories, 21 gm carb) and 1 cup blueberries (84 calories, 21 gm carb). Thinkstock. "}, {"url": "http://woman.thenest.com/grams-sugar-carbs-banana-7403.html", "passage_text": "Sugar. A medium banana contains almost 15 grams of sugar, meaning sugar makes up nearly 56 percent of the total amount of carbs. Bananas contain three types of sugar: glucose, fructose and sucrose. Approximately 20 percent, or 3 grams, of the sugar in a banana is sucrose. "}, {"url": "http://www.answers.com/Q/How_many_grams_of_protein_are_in_one_banana", "passage_text": "medium sized banana contains 1 grams of protien ..... 3 grames dietary fiber............... 26.9 carbohydrates......... eat banana daily is the best .................. "}, {"url": "http://healthyeating.sfgate.com/many-carbohydrates-banana-weighs-37-ounces-8993.html", "passage_text": "Total Carbohydrates. Once small banana weighing about 3.7 ounces contains 23 grams of total carbohydrates, according to the USDA Nutrient Data Laboratory. The Institute of Medicine recommends you obtain 45 to 65 percent of your calorie intake from carbohydrates. This means when eating 2,000 calories daily, aim for 225 to 325 grams of carbs and when following a 2,500-calorie plan, shoot for 281 to 406 grams of carbs each day. Of the 23 grams of carbs in a small 3.7-ounce banana, 12 grams are from natural sugar, a type of carbohydrate."}, {"url": "http://www.livestrong.com/article/300447-calories-protein-in-a-banana/", "passage_text": "Calories. The number of calories in a banana depends on its size. A small banana measuring 6 to 6 7/8 inches long contains 90 calories, and one that is 7 to 7 7/8 inches long contains110 calories. Large and extra large bananas that range from 8 inches to over 9 inches contain between 121 and 135 calories each. Bananas do contain small amounts of protein, but they are not considered a complete protein. A banana contains between 1.1 gram and 1.66 grams of protein, depending"}, {"url": "http://www.livestrong.com/article/300447-calories-protein-in-a-banana/", "passage_text": "Bananas actually make a healthy snack for just about everyone -- from babies to adults. The number of calories in a banana depends on its size. A small banana measuring 6 to 6 7/8 inches long contains 90 calories, and one that is 7 to 7 7/8 inches long contains110 calories. Large and extra large bananas that range from 8 inches to over 9 inches contain between 121 and 135 calories each. Bananas do contain small amounts of protein, but they are not considered a complete protein. A banana contains between 1.1 gram and 1.66 grams of protein, depending"}, {"url": "http://healthyeating.sfgate.com/carbohydrates-bananas-oranges-6659.html", "passage_text": "One banana has 26.95 grams and an orange has 11.28 grams of total carbohydrates. These values are for a medium banana that’s about 7 inches long and weighs 118 grams, and a small orange that’s about 2 inches in diameter and weighs 96 grams. Fiber. The banana has 3.1 grams and the orange has 2.3 grams of fiber. Both fruits contain soluble and insoluble fiber, but bananas have more soluble fiber and oranges have more of the insoluble type. Soluble fiber helps regulate blood sugar and lowers levels of cholesterol."}]