[{"url": "http://www.answers.com/Q/Is_zinc_ductile_and_malleable", "passage_text": "Zinc is malleable if you heat it to between 100 degrees C and 150 degrees C; outside that temperature range it's brittle. As to whether it's ductile...no, and that's immaterial anyway because the wire would break if you made any. well one of the physical properties of metals is being ductile and zinc is a metal so the answer is yes= not really Zinc is hard and brittle which makes it hard to stretch it. … Tungsten is a metal and is to hard to even try to turn into a wire. 6 people found this useful."}, {"url": "http://www.bbc.co.uk/schools/gcsebitesize/science/add_aqa/bonding/structure_propertiesrev5.shtml", "passage_text": "Metals. Layers of atoms slide over each other when metals are bent or stretched. Metals are malleable malleable: If a material is malleable it is capable of being hammered or pressed out of shape without being likely to break or return to the original shape. - they can be bent and shaped. This is because they consist of layers of atoms [atom: All elements are made of atoms. "}, {"url": "https://answers.yahoo.com/question/index?qid=20080521154903AAaAJdr", "passage_text": "Rating Newest Oldest. Best Answer: Zn is a metal and all metals are malleable and ductile, though some metals are better than others. The reason is because of their loosely held valence electrons. Source(s): pilio123 · 7 years ago. Source(s): zinc ductile malleable: https://trimurl.im/h58/is-zinc-ductile-a..."}, {"url": "http://www.answers.com/Q/Is_zinc_ductile_and_malleable", "passage_text": "Malleability is how malleable an object is, for example a metal is malleable as it can be hammered or bent into different shapes without breaking. Ductility is how ductile a … n object is, again many metals are ductile as they can be drawn or pulled into a long strand of wire without breaking. well one of the physical properties of metals is being ductile and zinc is a metal so the answer is yes= not really Zinc is hard and brittle which makes it hard to stretch it. … Tungsten is a metal and is to hard to even try to turn into a wire. 6 people found this useful."}, {"url": "http://www.infoplease.com/encyclopedia/science/malleability.html", "passage_text": "Metals vary in this respect; pure gold is the most malleable. Silver, copper, aluminum, lead, tin, zinc, and iron are also very malleable. Some heating usually increases malleability. Zinc, for example, at ordinary temperatures is very brittle, but is malleable in the temperature range from about 120°C. to 150°C. Impurities adversely affect the malleability of metals. The Columbia Electronic Encyclopedia, 6th ed. Copyright © 2012, Columbia University Press. "}, {"url": "http://study.com/academy/lesson/malleability-in-chemistry-definition-examples-quiz.html", "passage_text": "Therefore, gold is often mixed with less malleable metals, such as copper or nickel, to form alloys that are not so easily dented. The great malleability of gold and its alloys is exemplified by gold leaf that is used in decorating picture frames or book covers. Malleability is the ability of a substance, usually a metal, to be deformed or molded into a different shape. For chemists, the malleability of the metal gives an important means of describing the specific characteristics of a metal and relating it to the arrangement of the atoms within the metal."}, {"url": "http://www.bookrags.com/research/malleability-woc/", "passage_text": "Iron requires considerably more effort to pound into a sheet and is therefore less malleable. Yet, both are metals. In contrast, non-metallic elements, such as carbon or sulfur, shatter into pieces when hammered. Malleability is a valuable property because it allows metals to be shaped into useful forms. Pure gold is the most malleable metal. Silver, aluminum, lead, tin, and copper are also very malleable. Heating usually increases malleability. For instance, zinc, at standard temperatures is brittle, but becomes malleable at temperatures between 248°F (120°C) and 302°F (150°C). "}, {"url": "http://study.com/academy/lesson/malleability-in-chemistry-definition-examples-quiz.html", "passage_text": "The reason metals bend or dent when struck is linked to malleability, a physical property that is very important to chemists as well as engineers. Malleability is the ability of a substance, usually a metal, to be deformed or molded into a different shape. For chemists, the malleability of the metal gives an important means of describing the specific characteristics of a metal and relating it to the arrangement of the atoms within the metal."}]