[{"url": "http://www.mymajors.com/career/funeral-home-assistant/", "passage_text": "What Funeral Attendants do: 1  Direct or escort mourners to parlors or chapels in which wakes or funerals are being held. 2  Greet people at the funeral home. 3  Perform a variety of tasks during funerals to assist funeral directors and to ensure that services run smoothly and as planned. 1 Greet people at the funeral home. 2  Perform a variety of tasks during funerals to assist funeral directors and to ensure that services run smoothly and as planned. 3  Carry flowers to hearses or limousines for transportation to places of interment."}, {"url": "http://www.healthcare-salaries.com/allied-health-professionals/funeral-director-salary", "passage_text": "Funeral director salary. Funeral director’s salary is around $55,000. The job is as rewarding as it can also be challenging. The primary function of a funeral director is to oversee all memorial and funeral arrangements in the funeral home, from preparation of the corpse to the wake and the burial. Funeral Director salary in the USA. A basic funeral director’s salary in the US is from $24,220 to $61,087. Add in the bonus and profit, it can increase to as high as $63,278 in a year. Those with more experience receive a higher pay."}, {"url": "http://www.indeed.com/q-Administrative-Assistant-Funeral-Home-jobs.html", "passage_text": "We are seeking an Administrative Assistant for Restland Funeral Home & Cemetery. The Administrative Assistant will work closely with location management teams... 24 days ago-email. Get email updates for the latest Administrative Assistant Funeral Home jobs. My email: You can cancel email alerts at any time. We are seeking an Administrative Assistant for Restland Funeral Home & Cemetery. The Administrative Assistant will work closely with location management teams... Easily apply. 25 days ago-save job-email-more..."}, {"url": "http://www.myplan.com/careers/funeral-attendants/description-39-4021.00.html", "passage_text": "Perform a variety of tasks during funerals to assist funeral directors and to ensure that services run smoothly and as planned. Greet people at the funeral home. Offer assistance to mourners as they enter or exit limousines. Close caskets at appropriate point in services. "}, {"url": "http://www1.salary.com/Administrative-Assistant-I-hourly-wages.html", "passage_text": "For example the median expected annual pay for a typical Administrative Assistant I in the United States is $18 an hour, so 50% of the people who perform the job of Administrative Assistant I in the United States are expected to make less than $18. Source: HR Reported data as of October 2015. 1  Salary. 2  Salary + Bonus. "}, {"url": "http://www.simplyhired.com/salaries-k-funeral-home-assistant-jobs.html", "passage_text": "The average salary for funeral home assistant jobs is $30,000. Average funeral home assistant salaries can vary greatly due to company, location, industry, experience and benefits. This salary was calculated using the average salary for all jobs with the term funeral home assistant anywhere in the job listing."}, {"url": "http://work.chron.com/funeral-home-assistant-8758.html", "passage_text": "The assistant does not handle or help with embalming or other aspects of the funeral director's job that require training and licensing. Rather, the assistant helps to make funerals as stress-free and comforting for the bereaved as possible. Pre-Funeral Planning. A funeral assistant may help with picking up the remains of the deceased at a residence, nursing home, hospital or other location. This can put the assistant in contact with the bereaved family. If so, the assistant's appearance and decorum are very important. The assistant usually wears dress clothes to show respect"}, {"url": "http://www.indeed.com/q-Administrative-Assistant-Funeral-Home-jobs.html", "passage_text": "Administrative Assistant. Funeral Home in Garden City is looking for a part time administrative assistant. We are a family owned funeral home that prides itself in the service we extend... CareerBuilder - 3 days ago-save job-email-more... 1  View all Garden City, MI jobs. We are seeking an Administrative Assistant for Restland Funeral Home & Cemetery. The Administrative Assistant will work closely with location management teams... Easily apply. 25 days ago-save job-email-more..."}]