[{"url": "http://www.ehow.com/how_4540982_long-become-medical-assistant_.html", "passage_text": "In most states, you can become a medical assistant, or MA, simply by finding a physician who is willing to hire and train you. However, many employers prefer MAs who have been trained in a formal program, which may take one to two years."}, {"url": "http://www.ehow.com/video_4754641_how-long-does-become-medical.html", "passage_text": "5. Cancel. A medical assistant is required to complete an accredited program that takes between six months and one year of training. Manage medical files, answer phones and help check in patients as a medical assistant with information from a family doctor in this free video on medical careers."}, {"url": "http://differentmedicalcareers.com/how-long-does-it-take-to-become-a-medical-assistant/", "passage_text": "Employment is seen to rapidly increase by from 527,600 medical assistants in 2010 to 690,400 in 2020. This 31 percent projected growth by the end of the decade is fueled by the aging population and the demand for health care, according to the BLS."}, {"url": "http://differentmedicalcareers.com/how-long-does-it-take-to-become-a-medical-assistant/", "passage_text": "Although you could get a job as a medical assistant at a physician’s office and learn the skills, you may be better off spending 6 months to 2 years and becoming certified or registered and having an associate’s degree. Most states have no formal education requirements."}, {"url": "http://differentmedicalcareers.com/how-long-does-it-take-to-become-a-medical-assistant/", "passage_text": "In the 2010 data of the Bureau of Labor Statistics, medical assistants earned a median annual wage of $28,860, with the top 10 percent earning more than $40,190."}, {"url": "http://www.wikihow.com/Become-a-Medical-Assistant-Fast", "passage_text": "If you do decide to go to school for a medical assisting program, you can take either of the following tracks: 1  Medical Assistant Certificate/Diploma. 2  This takes about 9 months to a year for most applicants to complete. 3  Medical Assistant Associate Degree. 4  This takes about 2 years"}, {"url": "http://www.onlinemedicalassistantprograms.net/how-to-become/", "passage_text": "In order to be eligible to sit for the CMA exam, you must complete a medical assistant training program through an accredited school. The examination is given in January, June, and October of each year. The cost of the exam is between $95 and $145 for AAMA, ABHES, CAAHEP, and NCCA members, and $195 for non-members."}]