[{"url": "http://www.rxlist.com/doryx-drug/patient-images-side-effects.htm", "passage_text": "Doxycycline is a tetracycline antibiotic. It fights bacteria in the body. Doxycycline is used to treat many different bacterial infections, such as urinary tract infections, acne, gonorrhea, and chlamydia, periodontitis (gum disease), and others. Doxycycline is also used to treat blemishes, bumps, and acne-like lesions caused by rosacea. Doxycycline will not treat facial redness caused by rosacea. Doxycycline may also be used for purposes not listed in this medication guide."}, {"url": "http://www.ehealthme.com/ds/doxycycline/ototoxicity/", "passage_text": "More questions for: Doxycycline, Ototoxicity. You may be interested at these reviews (Write a review): 1  Breast tenderness with doxycycline hyclate (1 response). 2  I had eye infection and my opthalmologist prescribed 100mg of doxycycline hyclate BID for 10 days. I was on doxycycline for acne for roughly 12 weeks. During week 10, I was prescribed cyclobenzaprine 10 mg for muscle spasms in my neck. These two drugs were prescribed by 2 different doctors (dermatologist and G.P.)."}, {"url": "http://hearinglosshelp.com/blog/doxycycline-and-hearing-loss/", "passage_text": "Drugs in the Tetracycline family are no exception. Here is what I can tell you about them. The Tetracycline family of antibiotics includes drugs such as Tetracycline, Chlortetracycline, Doxycycline and Minocycline to name some of the more common ones. Often drugs in the same family have much the same ototoxic properties. Thus, it is wise for you to be wary, especially since you already have a hearing loss. This is because people with hearing losses are even more susceptible to the ravages of ototoxic drugs than those with normal hearing."}, {"url": "https://vestibular.org/ototoxicity", "passage_text": "Oto = ear; toxicity = poisoning. Ototoxicity is, quite simply, ear poisoning (oto = ear, toxicity = poisoning), which results from exposure to drugs or chemicals that damage the inner ear or the vestibulo-cochlear nerve (the nerve sending balance and hearing information from the inner ear to the brain). The occurrence and degree of inner ear poisoning depends upon the drug involved as well as other factors such as heredity. Ototoxicity can be temporary or permanent. The effect of certain drugs is often temporary, while other drugs typically produce permanent changes to the ear."}, {"url": "http://www.dizziness-and-balance.com/disorders/bilat/ototoxins.html", "passage_text": "Macrolides and other antibiotics that are only slightly ototoxic: Azithromycin, is a macrolide -- and not in the same family as Gentamicin. Nevertheless, there are occasional reports of ototoxicity, when there have been prolonged and high levels. Comment: While reportedly ototoxic, chemotherapeutic medications are rarely encountered as a source of vestibular dysfunction. Cisplatin is the most widely used anticancer drug currently and unfortunately, it is cochleotoxic, and may injure supporting cells (Ramirez-Camacho et al, 2004)."}, {"url": "https://en.wikipedia.org/wiki/Ototoxicity", "passage_text": "Ototoxic drugs include antibiotics such as gentamicin, loop diuretics such as furosemide and platinum-based chemotherapy agents such as cisplatin. A number of nonsteroidal anti-inflammatory drugs (NSAIDS) have also been shown to be ototoxic. This can result in sensorineural hearing loss, dysequilibrium, or both. It is difficult to distinguish between nerve damage and structural damage due to similarity of the symptoms. Diagnosis of ototoxicity typically results from ruling out all other possible sources of hearing loss and is often the catchall explanation for"}, {"url": "http://www.ehealthme.com/ds/doxycycline/ototoxicity/", "passage_text": "Summary: Ototoxicity is reported only by a few people who take Doxycycline. We study 12,112 people who have side effects while taking Doxycycline from FDA and social media. Find out below who they are, when they have Ototoxicity and more. I was on doxycycline for acne for roughly 12 weeks. During week 10, I was prescribed cyclobenzaprine 10 mg for muscle spasms in my neck. These two drugs were prescribed by 2 different doctors (dermatologist and G.P.)."}, {"url": "http://www.wong.ro/oto/shingvl.html", "passage_text": "Several kinds of antibiotics are known to be ototoxic. The most famous one is aminoglycoside. These ototoxic antibiotics will be discussed below. It is poorly absorbed through gastrointestinal tract and thus, it is commonly given through parental route or sometimes as topical agent, e.g. as ear drop for chronic otitis media. It is cleared through kidney. Ototoxicity: Prospective study demonstrates an incidence ranging from 4% to 24%."}, {"url": "http://hearinglosshelp.com/blog/doxycycline-and-hearing-loss/", "passage_text": "Although Tetracycline and Doxycycline are not listed in the Physicians’ Desk Reference (PDR) as causing hearing loss, Minocycline is. However, we get a different story when looking through the Canadian equivalent–the Compendium of Pharmaceuticals and Specialties (CPS). Thus, it is wise for you to be wary, especially since you already have a hearing loss. This is because people with hearing losses are even more susceptible to the ravages of ototoxic drugs than those with normal hearing."}]