[{"url": "http://www.termpaperwarehouse.com/essay-on/Configure-Group-Policy-Objects-And-Microsoft/201013", "passage_text": "In this lab, you used group policy objects to create a minimum password length password policy and link it to the newly created domain from the previous lab. You also ran the Microsoft® Baseline Security Analyzer (MBSA) and reviewed the results of the MBSA scan. Lab Assessment Questions & Answers. "}, {"url": "http://www.famu.edu/cis/project3.pdf", "passage_text": "Companies that primarily use Microsoft Windows products use a freely available tool called Security Microsoft BaselineAnalyzer (MBSA). MBSA can be used to scan systems and identify missing patches and missing or weak passwords and other common security issues. Microsoft Baseline Security Analyzer (MBSA) 3 updated as recommended. The resulting security scan report will be analyzed for c ritical issues, non-critical issues, and best practices and passed checks. The critical scans will be addressed and corrected as recommended by the tool."}, {"url": "http://www.famu.edu/cis/project3.pdf", "passage_text": "MBSA 2.2 will be used in this project to help determine how safe a Windows system is by checking for common misconfigurations and missing security updates and by using the recommendations provided to improve the system safeguards in accordance with the Microsoft security standards. Microsoft Baseline Security Analyzer (MBSA) 3 updated as recommended. The resulting security scan report will be analyzed for c ritical issues, non-critical issues, and best practices and passed checks. The critical scans will be addressed and corrected as recommended by the tool."}, {"url": "https://msdn.microsoft.com/en-us/library/ff647642.aspx", "passage_text": "The following procedure describes how to use the MBSA GUI tool. To use the MBSA GUI tool to scan for updates and patches. 1  On the Programs menu, click Microsoft Baseline Security Analyzer. 2  Click Scan a computer. 3  Make sure that the following options are not selected, and then click Start scan. 4  Check for Windows administrative vulnerabilities. 5  Check for weak passwords. 1 You can use MBSA from the graphical user interface (GUI) executable file, Mbsa.exe, or from the command line executable file, Mbsacli.exe. 2  MBSA uses ports 138 and 139 to perform its vulnerability assessment scans; it requires a secure connection using DCOM through the Windows Firewall to perform security update scans."}, {"url": "http://www.famu.edu/cis/project3.pdf", "passage_text": "Microsoft Baseline Security Analyzer (MBSA) 6 adopt a strong password policy, which is one the most effective ways to ensure system security. When the tool scanned the Automatic Update feature, it resulted in a good score. This meant that updates were automatically downloaded and installed on the system. Microsoft Baseline Security Analyzer (MBSA) 3 updated as recommended. The resulting security scan report will be analyzed for c ritical issues, non-critical issues, and best practices and passed checks. The critical scans will be addressed and corrected as recommended by the tool."}, {"url": "http://h10032.www1.hp.com/ctg/Manual/c02657476.pdf", "passage_text": "MBSA 2.2 runs on Windows Server ® 2008 R2, Windows 7, Windows Server 2008, Windows Vista™, Windows Server 2003, Windows XP and Windows 2000 systems and will scan for missing security updates, rollups, and service packs using Microsoft Update technologies. This is especially important in the case of the security. update catalog (Wsusscn2.cab), because Microsoft releases an updated. version of this file whenever a new security bulletin is released or updated. When you run MBSA to perform security update checks on remote computers, MBSA deploys the."}, {"url": "http://www.studymode.com/course-notes/Lab-4-45164254.html", "passage_text": "In this lab, you used group policy objects to create a minimum password length password policy and link it to the newly created domain from the previous lab. You also ran the Microsoft® Baseline Security Analyzer (MBSA) and reviewed the results of the MBSA scan. Lab Assessment Questions & Answers. "}, {"url": "http://www.microsoft.com/en-us/download/details.aspx?id=7558", "passage_text": "The Microsoft Baseline Security Analyzer provides a streamlined method to identify missing security updates and common security misconfigurations. MBSA 2.3 release adds support for Windows 8.1, Windows 8, Windows Server 2012 R2, and Windows Server 2012. Windows 2000 will no longer be supported with this release. 1  Details. "}, {"url": "http://h10032.www1.hp.com/ctg/Manual/c02657476.pdf", "passage_text": "Background To easily assess the security state of Windows machines, Microsoft offers the free Microsoft Baseline Security Analyzer (MBSA) scan tool. MBSA includes a graphical and command line interface that can perform local or remote scans of Microsoft Windows systems. This is especially important in the case of the security. update catalog (Wsusscn2.cab), because Microsoft releases an updated. version of this file whenever a new security bulletin is released or updated. When you run MBSA to perform security update checks on remote computers, MBSA deploys the."}]