[{"url": "http://www.dartmouth.edu/%7Ehumananatomy/part_2/chapter_9.html", "passage_text": "Muscles of arm (table 9-1). The muscles of the anterior arm are the biceps, coracobrachialis, and brachialis. They are supplied by the musculocutaneous nerve. The triceps is the muscle of the posterior arm, and it is supplied by the radial nerve."}, {"url": "https://quizlet.com/20769941/elbow-and-forearm-flash-cards/", "passage_text": "How many muscles cross the elbow joint? -Twenty-four muscles cross the elbow joint. -Some of them act on the elbow joint exclusively; others act at the wrist and finger joints. -Most are capable of producing three movements at the elbow, wrist, or phalangeal joints. Medial epicondylitis. -(golfer's elbow) wrist flexor origin, the flexor carpi radialis and the origin of pronator teres-almost always overuse rather than trauma, with three common environmental conditions leading to tissue injury."}, {"url": "http://teachmeanatomy.info/upper-limb/muscles/anterior-forearm/", "passage_text": "The superficial muscles in the anterior compartment are the flexor carpi ulnaris, palmaris longus, flexor carpi radialis and pronator teres. They all originate from a common tendon, which arises from the medial epicondyle of the humerus. Flexor Carpi Ulnaris. 1  Attachments: Originates from the medial epicondyle with the other superficial flexors. 2  It also has a long origin from the ulna. 3  It passes into the wrist, and attaches to the pisiform carpal bone. 4  Actions: Flexion and adduction at the wrist. 5  Innervation: Ulnar nerve."}, {"url": "http://www.innerbody.com/image/musc07.html", "passage_text": "Although it is found mostly in the forearm, the brachioradialis is the third flexor muscle of the elbow, running from the distal end of the humerus to the distal end of the radius. Two muscles-the triceps brachii and anconeus-act as the extensors of the forearm. The triceps brachii is a long muscle that runs posterior to the humerus from the scapula to the olecranon of the ulna."}, {"url": "http://www.livestrong.com/article/510307-the-muscles-involved-with-flexion-of-the-elbow-joint/", "passage_text": "Biceps Brachii. The biceps brachii, a two-headed muscle, sits on the front of your upper arm and is the most visible elbow flexor. It originates on the scapula, runs the length of your upper arm and attaches to the bones of the forearm, the ulna and radius. Besides elbow flexion, the biceps muscle is also involved in forearm supination -- turning your forearm so your palm faces up. It's more active in elbow flexion when your forearm is supinated and less active when your forearm is pronated -- your palm faces down."}, {"url": "http://www.livestrong.com/article/510307-the-muscles-involved-with-flexion-of-the-elbow-joint/", "passage_text": "When asked to flex a muscle, you'll most likely flex your biceps by bending your elbow. Although the biceps muscle is involved with flexion of the elbow, contrary to popular belief, it's not always the most active elbow flexor. Several other arm muscles are involved in elbow flexion and can be more active than the biceps, depending on the position of your arm. Besides elbow flexion, the biceps muscle is also involved in forearm supination -- turning your forearm so your palm faces up. It's more active in elbow flexion when your forearm is supinated and less active when your forearm is pronated -- your palm faces down."}, {"url": "http://www.innerbody.com/image/musc07.html", "passage_text": "The elbow is a synovial hinge joint located between the upper arm and forearm. It is formed by the meeting of three bones: the humerus in the upper arm and the ulna and radius in the lower arm. Like all other hinge joints, the elbow permits movement in one plane, namely the flexion and extension of the forearm relative to the upper arm. Two muscles-the triceps brachii and anconeus-act as the extensors of the forearm. The triceps brachii is a long muscle that runs posterior to the humerus from the scapula to the olecranon of the ulna."}, {"url": "https://en.wikipedia.org/wiki/Ulnar_nerve", "passage_text": "The ulnar nerve and its branches innervate the following muscles in the forearm and hand: An Articular branch that passes to the elbow joint while the ulnar nerve is passing between the olecranon and medial epicondyle of the humerus. 1  In the forearm, via the muscular branches of ulnar nerve 2  : Flexor carpi ulnaris. The ulnar collateral ligament of elbow joint is in relation with the ulnar nerve. The nerve is the largest unprotected nerve in the human body (meaning unprotected by muscle or bone), so injury is common."}, {"url": "http://www.livestrong.com/article/510307-the-muscles-involved-with-flexion-of-the-elbow-joint/", "passage_text": "Other Muscles. The pronator teres, flexor carpi radialis and extensor carpi radialis longus, three small muscles in the forearm, are also involved in elbow flexion, but not to the extent of the biceps, brachialis and brachioradialis. Besides elbow flexion, the biceps muscle is also involved in forearm supination -- turning your forearm so your palm faces up. It's more active in elbow flexion when your forearm is supinated and less active when your forearm is pronated -- your palm faces down."}, {"url": "http://www.innerbody.com/image/musc07.html", "passage_text": "The flexor group-including the brachialis, biceps brachii, and the brachioradialis-bend the arm by decreasing the angle between the forearm and upper arm. The brachialis is the primary flexor of the elbow and is found mainly in the upper arm between the humerus and the ulna. Two muscles-the triceps brachii and anconeus-act as the extensors of the forearm. The triceps brachii is a long muscle that runs posterior to the humerus from the scapula to the olecranon of the ulna."}]