[{"url": "http://www.military.com/join-armed-forces/join-reserve-marines.html", "passage_text": "Travel-As a member of the Marine Corps Reserve you will have the opportunity to travel both on duty and off. You also qualify for military Space Available travel within and between the continental United States, Alaska, Hawaii, Guam and Puerto Rico."}, {"url": "http://www.protectplanetocean.org/collections/introduction/introbox/reserves/introduction-item.html", "passage_text": "They are often called a 'no-take' MPA. Examples of prohibited activities in marine reserves are fishing, aquaculture, dredging, and mining. In contrast, activities such as swimming, boating, and scuba diving are usually allowed."}, {"url": "http://www.protectplanetocean.org/somr/scientificConsiderations.html", "passage_text": "One important goal for creating marine reserves is to protect or restore an ocean ecosystem, enabling it to provide ecosystem services such as seafood production, good water quality, coastal protection, and climate regulation on a sustainable basis."}, {"url": "http://www.pcouncil.org/habitat-and-communities/marine-protected-areas/", "passage_text": "Marine Protected Areas (MPAs) are versatile management tools that can be used to help conserve marine natural and cultural resources, and can be an integral part of an ecosystem approach to management."}, {"url": "http://www.protectplanetocean.org/collections/introduction/introbox/reserves/introduction-item.html", "passage_text": "Marine Reserves a re a special type of marine protected area. They are fully and permanently protected from activities that remove animals or plants, or that alter habitats, except as needed for scientific monitoring."}, {"url": "http://oceanservice.noaa.gov/ecosystems/mpa/", "passage_text": "MPAs act as safe havens for marine life. There are many different types of MPAs including national marine sanctuaries and national estuarine research reserves. Marine protected areas (MPAs) are areas of the oceans or Great Lakes that are protected for a conservation purpose."}, {"url": "http://www.pcouncil.org/habitat-and-communities/marine-protected-areas/", "passage_text": "The Council’s focus on marine reserves as “no fishing” areas (or areas where only certain types of fishing are allowed) reflects its area of regulatory authority: fishing. Hypothetical example of a marine protected area, a marine reserve, and a no-take marine reserve. Regulations in brackets are examples only, though a no-take marine area means no fishing is allowed."}, {"url": "http://www.pcouncil.org/habitat-and-communities/marine-protected-areas/", "passage_text": "Marine reserves can also have educational and research value. To successfully manage these resources, managers need better knowledge of the biology, habits, and behaviors of fish stocks and the ecosystems that support them."}, {"url": "http://www.pcouncil.org/habitat-and-communities/marine-protected-areas/", "passage_text": "Marine reserves provide one tool to control fishing mortality. For example, a Cowcod Conservation Area protect cowcod off southern California. In this case, marine reserves were used to eliminate groundfish harvests in areas with high cowcod bycatch rates."}]