[{"url": "http://www.exo.net/~pauld/activities/flying/glideratio.html", "passage_text": "To Do and Notice. Fly your paper plane. Trim it until it glides in a straight line smoothly to the floor. All paper airplane gliders have a natural speed and angle at which they will steadily glide down to the ground. Introduction. A paper airplane falls down due to gravity and glides forward through the air at the same time. We'll measure the glide ratio the ratio of the distance glided to the distance fallen. Material. 1  A paper airplane."}, {"url": "http://www.skybrary.aero/index.php/Glide_Performance", "passage_text": "Description. The Glide ratio of an aircraft is the distance of forward travel divided by the altitude lost in that distance. The glide ratio is affected by all of the four fundamental forces that act on an aircraft in flight-lift, drag, weight and thrust. "}, {"url": "http://encyclopedia2.thefreedictionary.com/Glide+ratio", "passage_text": "glide ratio. The ratio of the forward distance traveled to the vertical distance an aircraft descends when gliding without any power. Also called a gliding ratio. "}, {"url": "http://reconinstruments.desk.com/customer/portal/articles/959658-what-is-glide-ratio-", "passage_text": "Last Updated: Jan 23, 2013 02:22PM PST. Glide Ratio tells you the ratio between how much distance you are travelling forward to how much you are falling downward. Simply put, the higher the number the more you are flying rather than falling. "}, {"url": "http://www.definitions.net/definition/glide%20ratio", "passage_text": "glide ratio (Noun). The instantaneous ratio of rate of fall to horizontal speed for a glider. glide ratio (Noun). The maximum ratio of rate of fall to horizontal speed that a glider can maintain. "}, {"url": "http://www.pprune.org/tech-log/490979-737-glide-ratio-speed.html", "passage_text": "737 glide ratio and speed. I have been trying unsuccessfully to find the boeing 737 classics glide ratio and speed (depending on weight for sure) . Please somebody direct me to where in the documentation to find it. i do know that in the QRH below 270 speed 300. "}, {"url": "http://aviation.stackexchange.com/questions/1738/how-does-the-boeing-787-dreamliners-glide-ratio-compare-to-other-airliners", "passage_text": "There are many factors to glide ratio of an airplane, but a good indication is the aspect ratio (see more here: Wikipedia). The aspect ratio tells us how slim the wing is. The slimmer a wing, the less induced drag it will create. The downside is that the longer a wing is, the more parasitic drag it creates. "}, {"url": "http://www.nasa.gov/pdf/582952main_Glide-Slope%20Ratio%20Explanation.pdf", "passage_text": "Glide Slope Ratio The Glide Slope Ratio is a number that indicates how well your designed shoebox glider flies through the air in terms of its forward distance vs. its drop in altitude. Glide Ratio = Horizontal Distance divided by the Change in Altitude. "}, {"url": "http://www.paul.moggach.yorksoaring.com/GliderInstructorGSX/glide_ratio.html", "passage_text": "Glide Ratio. There are three main components to staying within safe gliding range of the airfield, the still air glide performance of the aircraft, the effect of headwinds and tailwinds, and the presence of rising or sinking air. Compared to most of their powered cousins, gliders have quite good glide performance."}]