[{"url": "http://runthetrap.com/what-is-trap-music/", "passage_text": "Modern producers of the new trap music genre that have been emerging above the rest include artists RL Grime, TNGHT (Hudson Mohawke x Lunice), Flosstradamus, Baauer, DJ Sliink, Heroes x Villians, UZ, LOUDPVCK, gLAdiator, and Luminox. And the Trap Music genre continues to evolve as it progresses. Take a look at this 20 minute documentary from Clubtapes.com to learn more about “Original Trap Music” genre, and the new “EDM Trap” that’s emerging on to the scene."}, {"url": "https://answers.yahoo.com/question/index?qid=20090413194956AAvAcW2", "passage_text": "i dont really like it. and by trap music i mean like the drug trafficking type music, whippin up bricks and flippin chickens. the only trap artists i like are T.I. and Young Jeezy cus at least their lyrics are way better than these sucky trap stars like Gucci Mane and O.J. da Juiceman. So what do you think about... Rating Newest Oldest. Best Answer: trap music is alright in small doses. i like willie the kid and cam'ron, t.i. and jeezy are cool, i even liked julez and weezy's mixtape (and i ahte weezy) but i wouldn't listen to trap music if i didn't sell drugs or ever sold weight or lived in the burbs."}, {"url": "http://www.laweekly.com/music/what-the-hell-is-trap-music-and-why-is-dubstep-involved-2408170", "passage_text": "Thursday, October 4, 2012 | 3 years ago. Baauer. You may have heard the term trap music.. You may even realize that what people are calling trap music today (which sounds a whole lot like dubstep) is not necessarily what people were calling trap music a few years ago. See also: Flying Lotus' Nocturnal Visions: Once believing himself destined to fail, the DJ-producer returns triumphant on his new album."}, {"url": "https://en.wikipedia.org/wiki/Trap_(music_genre)", "passage_text": "Throughout 2011 to 2012, trap songs maintained a strong presence on the mainstream Billboard music charts with records released by rappers such as Young Jeezy, Chief Keef and Future went viral. Jeezy's single  Ballin  hit #57 on the Billboard charts and was considered one of Jeezy's best tracks in some time. It is typified by its aggressive lyrical content and sound, where the instrumentals are propelled by 808 kick drums or heavy extended sub-bass lines, double-time, triple-time and other faster time division hi-hats, layered synthesizers, and cinematic strings."}, {"url": "https://en.wikipedia.org/wiki/Trap_(music_genre)", "passage_text": "Trap music is also defined by its ominous, bleak, gritty and belligerent lyrical content which varies widely according to artist. Typical lyrical themes portrayed include observations of street life, poverty, violence, hardship in the trap and harsh experiences in urban surroundings. It is typified by its aggressive lyrical content and sound, where the instrumentals are propelled by 808 kick drums or heavy extended sub-bass lines, double-time, triple-time and other faster time division hi-hats, layered synthesizers, and cinematic strings."}, {"url": "http://www.answers.com/Q/What_is_trap_music", "passage_text": "Trap music is based on use of the 808 Roland drum machine, pitched and re-sampled hiphop/rap vocals, pipe flutes, gangsta synth leads, and various FX. Similar to rap without the main vocal, Trap music has been gaining lots of attention from major DJ's and labels. Although, the style originated many years ago, Trap music has recently been making a new school comeback in many new forms such as Trap, Chirp, SeaPunk, PsyTrap, and TrapStep. 1/3 hip hop (tempo and song structure similar) -- however vocals are usually pitched lower or higher. 1/3 dubstep (similar drum arrangements, different builds and drops). 1/3 dub (Low frequency focus and strong emphasis on repetitiveness throughout a song). That's what trap music is."}, {"url": "https://en.wikipedia.org/wiki/Trap_(music_genre)", "passage_text": "During the early-to-mid 2000s, trap music began to emerge as a recognized genre after the mainstream success of a number of albums and singles with lyrics that covered topics about life in the trap, drug dealing and the struggle for success. It is typified by its aggressive lyrical content and sound, where the instrumentals are propelled by 808 kick drums or heavy extended sub-bass lines, double-time, triple-time and other faster time division hi-hats, layered synthesizers, and cinematic strings."}, {"url": "http://runthetrap.com/what-is-trap-music/", "passage_text": "Trap music is a genre that is starting to gain quite a bit of momentum through the ever growing sub-genres of dance music culture. Take a look at this 20 minute documentary from Clubtapes.com to learn more about “Original Trap Music” genre, and the new “EDM Trap” that’s emerging on to the scene."}, {"url": "http://runthetrap.com/what-is-trap-music/", "passage_text": "Trap music fist emerged coming primarily from the south, a genre filled with a hard attitude that you can feel in the sound of the brass, triangle, triplet hi hats, loud kicks, snappy snares and low end 808 bass samples that are used when composing tracks. Take a look at this 20 minute documentary from Clubtapes.com to learn more about “Original Trap Music” genre, and the new “EDM Trap” that’s emerging on to the scene."}, {"url": "https://en.wikipedia.org/wiki/Trap_(music_genre)", "passage_text": "Trap music is a music genre that originated in the early 1990s in the Southern United States. It is typified by its aggressive lyrical content and sound, where the instrumentals are propelled by 808 kick drums or heavy extended sub-bass lines, double-time, triple-time and other faster time division hi-hats, layered synthesizers, and cinematic strings."}]