[{"url": "http://www.cnet.com/news/house-of-cards-wins-a-fourth-season-on-netflix-in-2016/#!", "passage_text": "Twitter/screenshot by Lance Whitney/CNET. The Underwoods will be back in office next year when Netflix's House of Cards embarks on a fourth season. The show's renewal was revealed Thursday by a tweet from Netflix displaying a black image with an upside down American flag and the words: Season 4 Coming 2016.."}, {"url": "http://season-release-date.com/house-of-cards-season-3-air-date/", "passage_text": "«House of Cards» season 3 premiere – [ February 27, 2015 ]. The release date of the first out of ten ordered episodes is scheduled for February 2015, which is confirmed by Netflix channel representatives."}, {"url": "http://www.christianpost.com/news/house-of-cards-season-3-release-date-cast-rumors-netflix-premiere-date-february-2015-zoe-barnes-returning-video-124222/", "passage_text": "House of Cards Season 3 is currently in production and should be released on Netflix some time in February 2015."}, {"url": "http://sharetv.com/shows/house_of_cards", "passage_text": "House Of Cards Renewed For Season 4. Netflix announced today that House of Cards has been renewed for a fourth season. The political drama is the streaming service's first original series and has continued to be one of its most acclaimed and popular. Production on Season 4 is scheduled to begin this summer, with an expected return in 2016."}, {"url": "http://fansided.com/2015/04/03/house-of-cards-season-4-video/", "passage_text": "I will leave a legacy. #Underwood2016 pic.twitter.com/lEC49fd7X1. — House of Cards (@HouseofCards) April 2, 2015. The message of “Season 4 Coming 2016″ was sent out to the world and the world has been waiting for this announcement."}, {"url": "http://deadline.com/2015/04/house-of-cards-renewed-season-4-netflix-kevin-spacey-1201403706/", "passage_text": "Having launched the third season of House Of Cards on February 27, Netflix said today that the award-winning drama starring Kevin Spacey and Robin Wright will be back for a fourth season in 2016."}, {"url": "http://www.christianpost.com/news/house-of-cards-season-3-release-date-cast-rumors-netflix-premiere-date-february-2015-zoe-barnes-returning-video-124222/", "passage_text": "The House of Cards Season 3 release date will be in February 2015, according to new rumors, and of course the Netflix hit series will release every single episode simultaneously on the premiere date to ensure fans can binge watch their way through as Frank Underwood takes charge of The White House."}]