[{"url": "http://www.medilexicon.com/medicaldictionary.php?t=35389", "passage_text": "transverse fracture. Definitions: 1. a fracture, the line of which forms a right angle with the longitudinal axis of the bone. The definition information for transverse fracture is provided by Stedman's. You can search our medical dictionary here. Stedman's, part of Lippincott Williams & Wilkins, provides a comprehensive line of health-science publications for healthcare professionals and medical students."}, {"url": "http://www.medicinenet.com/script/main/art.asp?articlekey=8081", "passage_text": "Transverse fracture: A fracture in which the break is across a bone, at a right angle to the long axis of the bone."}, {"url": "http://www.medilexicon.com/medicaldictionary.php?t=35389", "passage_text": "1. a fracture, the line of which forms a right angle with the longitudinal axis of the bone. The definition information for transverse fracture is provided by Stedman's. You can search our medical dictionary here. Stedman's, part of Lippincott Williams & Wilkins, provides a comprehensive line of health-science publications for healthcare professionals and medical students."}, {"url": "http://fansided.com/2014/11/01/transverse-process-fracture/", "passage_text": "A fracture of a transverse processis a break of a part of one of the bones in the spine. This part extends out from the side of the main body of the bone (called the vertebral body). A transverse process is shaped like a wing. They extend from both the left and right sides of the vertebral body."}, {"url": "http://www.sportsinjuryclinic.net/sport-injuries/low-back-pain/transverse-process-fracture", "passage_text": "Transverse process fracture of the spine include sudden pain in the back at the time of injury. There will be decreased range of motion of the affected area of the spine and pain when trying to bend or twist the affected area. In particular there may be tenderness and swelling around the site of the fracture."}, {"url": "http://texasorthopedic.com/hl/?/894287/Transverse-process-fracture", "passage_text": "The bones of spinal column are called vertebrae. Each vertebra has two wing-like protrusions, called a transverse process, that extend toward the sides. These protrusions provide an area for muscles and ligaments to attach to provide movement and flexibility in the back."}]