[{"url": "http://www.meaning-of-names.com/irish-names/morven.asp", "passage_text": "Irish name. In Irish, the name Morven means-mariner. Other origins for the name Morven include-Irish, Celtic, Gaelic.The name Morven is most often used as a boy name or male name. Irish Name Meaning"}, {"url": "http://www.babynamespedia.com/meaning/Morven/m", "passage_text": "Morven is derived from Scottish Gaelic origins. The name is of the meaning child of the sea, a mariner. See Morven for more information. Morven is of Irish Gaelic origin. The meaning here is great, fair-skinned one. [ 2 syll. mor-ven, mo-rv-en ] The baby boy name Morven is also used as a girl name. Its pronunciation is M AO RVAHN †. Morfan, Morfen, Morfin, Morfun, Morfyn, Morvan, Morvin, Morvun, and Morvyn are variants of Morven. Morven is an infrequently used baby name for boys. It is not listed in the top 1000 names."}, {"url": "http://www.sheknows.com/baby-names/name/morven", "passage_text": "Gaelic Meaning: The name Morven is a Gaelic baby name. In Gaelic the meaning of the name Morven is: Pale. Celtic Meaning: The name Morven is a Celtic baby name. In Celtic the meaning of the name Morven is: Lives by the sea. SoulUrge Number: 11. Expression Number: 6. People with this name have a deep inner desire to inspire others in a higher cause, and to share their own strongly held views on spiritual matters."}, {"url": "http://www.babynamewizard.com/baby-name/girl/morven", "passage_text": "Share what you know! Meanings and history of the name Morven: | Edit. From the Scottish Gaelic Mhor 'big' + bheinn 'peak' or bhairne 'gap'. The name of mountain/hills in Aberdeenshire and Caithness, Scotland and used to deignate all of Northwest Scotland. Pronounced: MOHR-vin. "}, {"url": "http://www.behindthename.com/name/morven", "passage_text": "From a Scottish place name meaning big gap. This was the name of Fingal's kingdom in James Macpherson's poems. "}, {"url": "http://www.meaning-of-names.com/celtic-names/morven.asp", "passage_text": "Meaning of Morven. Celtic name. In Celtic, the name Morven means-Lives by the sea.. Other origins for the name Morven include-Celtic, Irish, Gaelic.The name Morven is most often used as a boy name or male name. Celtic Name Meaning-Lives by the sea"}, {"url": "http://www.babynamespedia.com/meaning/Morven/f", "passage_text": "[ 2 syll. mor-ven, mo-rv-en ] The baby girl name Morven is also used as a boy name. It is pronounced M AO RVAHN †. Morven is of Scottish origin. It is used mainly in English and Scottish. The name Morven means 'big peak, big gap'. It is derived from mor mór which ' means, big ' ; great 'bhein' ; peak 'bhairne'. Gap the name is of obscure; derivation it is of the first 'element' mor and the second 'element' bheinn or. bhairne Morven is of Scottish origin. It is used mainly in English and Scottish. The name Morven means 'big peak, big gap'. It is derived from mor mór which ' means, big ' ; great 'bhein' ; peak 'bhairne'. gap"}, {"url": "http://www.thinkbabynames.com/meaning/1/Morven", "passage_text": "Morven /mor-ven/ [2 sylls.] as a boys' name is of Scottish and Gaelic origin, and the meaning of Morven is huge mountain. Kreatif forms: Muirven, Murven. Morven is an unusual given name for men. Morven is also an unusual last name for all people. (2000 U.S. Census). Shown below is the baby name popularity of Morven for boys."}]