[{"url": "http://www.answers.com/Q/How_would_you_define_cultural_awareness", "passage_text": "Simply, cultural awareness refers to the recognition that not all people are from the same cultural background. It also refers to recognising people have different values, different behaviours and different approaches to life."}, {"url": "http://www.ehow.com/info_8726927_meaning-cultural-awareness.html", "passage_text": "Basic Definition. Cultural awareness is the ability and willingness to objectively examine the values, beliefs, traditions and perceptions within our own and other cultures. At the most basic level, it is the ability to walk in someone else's shoes in terms of his or her cultural origins."}, {"url": "http://dictionary.reverso.net/english-cobuild/cultural%20awareness", "passage_text": "cultural awareness. Someone's cultural awareness is their understanding of the differences between themselves and people from other countries or other backgrounds, especially differences in attitudes and values. n-uncount. ...programs to promote diversity and cultural awareness within the industry."}, {"url": "http://www.nccccurricula.info/awareness/", "passage_text": "Cultural awareness is a major element of cultural competence as defined by the National Center for Cultural Competence (NCCC). It is the first and foundational element because without it, it is virtually impossible to acquire the attitudes, skills, and knowledge that are essential to cultural competence."}, {"url": "http://dictionary.reverso.net/english-cobuild/cultural%20awareness", "passage_text": "Search also in: Web News Encyclopedia Images. cultural awareness Someone's cultural awareness is their understanding of the differences between themselves and people from other countries or other backgrounds, especially differences in attitudes and values. n-uncount. ...programs to promote diversity and cultural awareness within the industry."}, {"url": "http://www.nccccurricula.info/culturalcompetence.html", "passage_text": "There is no one definition of cultural competence. Definitions of cultural competence have evolved from diverse perspectives, interests and needs and are incorporated in state legislation, Federal statutes and programs, private sector organizations and academic settings."}]