[{"url": "http://www.youtube.com/watch?v=eIoc4gOgMpc", "passage_text": "jamming with the track The Clincher by Chevelle, from the album This Type of Thinking (Could Do Us In). This is most definitely not 100% accurate.  1 The Clincher by Chevelle (Google Play • iTunes • AmazonMP3). 2  Music. 3  Standard YouTube License. "}, {"url": "http://www.pandora.com/chevelle", "passage_text": "Yeah they do sound like Tool, that's because they were inspired by them. Not too bad of a band to sound like, Chevelle does a great job of balancing the inspiration from Tool while still sounding like themselves. Inspired by the lurching riffs of Helmet and the soft/loud vocal dynamics of Tool, the Chicago-based trio Chevelle formed in 1995 with an aggressive, heavy sound."}, {"url": "http://www.uberproaudio.com/who-plays-what/284-chevelle-pete-loeffler-guitar-gear-rig-and-equipment", "passage_text": "Published on Wednesday, 14 May 2008 12:16. Pete Loeffler is the lead guitarist and lead singer for the Chicago hard rock band Chevelle. Let's look at some of the gear and equipment that has been seen in the Chevelle guitar player, Pete Loeffler's guitar rig. Click the gear images for more info and specs at Musician's Friend. Guitars. - PRS Custom 24 guitars."}, {"url": "http://www.mtv.com/artists/chevelle/", "passage_text": "Rock. Pete Loeffler-Guitar,Vocals Sam Loeffler-Drums Dean Bernardini-Bass, Vocals CHEVELLE preserve their underdog spirit on Hats Off to the Bull (Epic Records)--their sixth full-length album. That spirit has characterized the Chicago alternative hard rock trio since its independent debut, 1999's Point #1. In the end, Chevelle are speaking out for underdogs across the board. I'm writing about a lot of serious issues and emotions, says Pete. When I was a kid, I used to throw on Led Zeppelin records, turn off the lights, and watch the stereo lights blink in total darkness."}, {"url": "http://www.encyclopedia.com/doc/1G2-3496200019.html", "passage_text": "Newspaper article from: St. Joseph News-Press By 2008, Chevelle already had achieved what most hard rock...the Foo Fighters and Alice in Chains. Chevelle even had a platinum and gold record to...in the digital music era.Yet after Chevelle's release of the 2007 album Vena... Chevelle members hold back likewise on other stereotypical musical labels; yet while the band rebuffs the label of Christian rock band, in April of 2000 the Chevelle debut album won a Dove Award from the Gospel Music Association for Best Hard Music Album."}, {"url": "http://www.mtv.com/artists/chevelle/", "passage_text": "The album spawned chart-topping hits Send the Pain Below and The Red, leading to high-profile tours like OZZfest. Meanwhile, their next effort, 2004's This Type of Thinking Could Do Us In, exceeded gold status and the follow-up Vena Sera bolstered their prominence even further. In the end, Chevelle are speaking out for underdogs across the board. I'm writing about a lot of serious issues and emotions, says Pete. When I was a kid, I used to throw on Led Zeppelin records, turn off the lights, and watch the stereo lights blink in total darkness."}, {"url": "http://www.last.fm/music/Chevelle", "passage_text": "Chevelle is an alternative metal band from Grayslake, IL. They formed in 1994 with the members of Sam Loeffler, Pete Loeffler (brothers) and Matt Scott. Matt was later replaced in 1996 by Joe Loeffler as bass player. On July 10, 2005 Joe was fired because of irreconcilable differences. "}, {"url": "http://www.youtube.com/watch?v=trinU3VD1Zo", "passage_text": "Chevelle's official music video for 'The Red'. Click to listen to Chevelle on Spotify: http://smarturl.it/ChevelleSpotify?IQ... "}, {"url": "https://en.wikipedia.org/wiki/Chevelle_%28band%29", "passage_text": "Chevelle is an American alternative metal band that formed in 1995 in Grayslake, Illinois, a suburb of Chicago. The band was originally composed of brothers: Pete Loeffler (lead vocals and guitar), Sam Loeffler (drums and percussion) and Joe Loeffler (bass and backing vocals). When Joe left the band in 2005, Geno Lenardo subbed-in as the bassist until he was replaced by Pete and Sam's brother-in-law, Dean Bernardini. The band's first studio album, Point #1 was released on a small record label called Squint Entertainment. Chevelle's second album, Wonder What's Next (October 8, 2002), was certified Platinum by the RIAA after a debut at No. 14 on the United States albums chart, Billboard 200."}, {"url": "https://en.wikipedia.org/wiki/Chevelle_%28band%29", "passage_text": "Chevelle has sold over four million albums in the United States. The band's first studio album, Point #1 was released on a small record label called Squint Entertainment. Chevelle's second album, Wonder What's Next (October 8, 2002), was certified Platinum by the RIAA after a debut at No. 14 on the United States albums chart, Billboard 200."}]