[{"url": "https://answers.yahoo.com/question/index?qid=20071128175537AA4cT9s", "passage_text": "An egg is really three separate foods, the whole egg, the white, and the yolk, each with its own distinct nutritional profile. A whole egg is a high-fat, high-cholesterol, high-quality protein food packaged in a high-calcium shell that can be grounded and added to any recipe. Cooking the egg inactivates avidin. An egg yolk is a high-fat, high-cholesterol, high-protein food, a good source of vitamin A derived from carotenes eaten by the laying hen, plus vitamin D, B vitamins, and heme iron, the form of iron most easily absorbed by your body."}, {"url": "http://health.usnews.com/health-news/blogs/eat-run/2014/05/30/egg-yolks-to-eat-or-toss", "passage_text": "One large egg contains 3.6 grams of protein in the egg white and an additional 2.7 grams of protein in the yolk – that’s 60 percent protein in the egg white and 40 percent in the yolk! Something to think about the next time you’re about to discard that yolk. "}, {"url": "http://ncegg.org/egg-nutrition-center/yolks-vs-whites/", "passage_text": "Yolk. The yolk, or yellow portion, of an egg makes up about 34% of the liquid weight of the egg. It contains all of the fat in the egg and a little less than half of the protein. The yolk of a large egg contains about 55 calories. With the exception of niacin and riboflavin, the yolk contains a higher proportion of the egg’s vitamins than the white, including vitamins B6 and B 12, folic acid, pantothenic acid and thiamin. All of the egg’s vitamins A, D, E and K are in the yolk. Egg yolks are one of the few foods naturally containing vitamin D. The yolk also contains more calcium, copper, iron, manganese, phosphorus, selenium and zinc than the white"}, {"url": "http://healthyeating.sfgate.com/much-vitamins-protein-one-egg-white-have-6702.html", "passage_text": "Protein. The most abundant nutrient in egg whites is protein. The white from one large egg contains 3.6 grams of protein, and roughly 85 percent of the egg white's calories come from its protein content. Like other animal sources of protein, egg whites provide all the essential amino acids your body needs from your diet. Egg whites represent a cholesterol-free option for those sensitive to dietary cholesterol, and they are also low in calories, with each egg white containing just 17 calories. Eating the whites provides your body with protein, as well as some vitamins important for maintaining your health."}, {"url": "http://www.fitday.com/fitness-articles/nutrition/healthy-eating/the-nutrition-of-egg-whites.html", "passage_text": "The Nutrition of Egg Whites. Egg whites are a great alternative to whole eggs if you're watching your fat or cholesterol intake. By discarding the egg yolk, you eliminate the source of the egg's fat and cholesterol. Egg whites are a healthy choice because they're low in calories and high in protein. One large egg contains about 33 g of egg whites, which consists of only 16 calories, 0.1 g of fat, 0 g of saturated fat, 0 g of cholesterol, 55 mg of sodium, 0.2 g of carbohydrates and 3.6 g of protein. In addition, egg whites are also rich in vitamins like riboflavin and selenium"}, {"url": "https://en.wikipedia.org/wiki/Yolk", "passage_text": "The yolk of a chicken egg. The yolk is a part of an egg (or just of the egg cell in non-egg-laying animals) that feeds the developing embryo in animals. In whole eggs, 43% of the protein comes from the yolk. Also known as deutoplasm, this food material is accumulated during oogenesis, together with RNA molecules and other substances"}, {"url": "http://www.answers.com/Q/What_does_a_egg_white_consist_of", "passage_text": "87% of Egg white is water. The rest of it is made up of proteins, vitamins, minerals, fat and glucose. 12% proteins, 0.8% carbohydrates. This leave 0.2% of vitamins and minerals. An average large egg white contains 20 calories and has no cholesterol. Egg white contain 40 proteins. The yolk is basically the food supply for a developing chick, and the white is the protective membrane and cushion to protect the chick. As the chick grows in the egg, the yol … k gets used up, and the white thins out to make room for the chick. Note that all of that only happens if the egg is fertile."}]