[{"url": "http://study.com/academy/lesson/vesicles-definition-function-quiz.html", "passage_text": "Summary of Vesicles. Vesicles are small cellular containers that perform a variety of functions. They can be used to move molecules, secrete substances, digest materials, or regulate the pressure in the cell. To unlock this lesson you must be a Study.com Member. Create your account. Lysosomes are used by cells to break down food particles and to get rid of unneeded cellular materials. Transport vesicles move molecules within the cells. All cells make proteins and require them to function."}, {"url": "http://www.answers.com/Q/What_is_the_function_of_vesicles", "passage_text": "Also pinocytosis is a related term to endocytosis and refers to the intake of specifically aqueous material; Vesicles can also transport material within the cell. For example, vesicles transport proteins from the rough endoplasmic reticulum to the Golgi apparatus. Some veiscles serve as storage vessels as well. Pinocytosis is  cell drinking,  so the function of the pimocytic vesicle is it's pinched off status formed when the cell membrane invaginates, forms a pocket, and the vesicl … e is formed and taken into the cell proper. Some nutrients come along for the ride. 1 person found this useful."}, {"url": "http://www.buzzle.com/articles/vesicle-function.html", "passage_text": "The vesicle is separated from the rest of the cytoplasm by at least one phospholipid bilayer. The membrane that encloses the vesicle is similar to the plasma membrane. Thus, vesicles can fuse with the plasma membrane when they want to release their contents outside the boundaries of the cell. However, vesicles can also fuse with other organelles that are present inside the cell to release or engulf substances. The function of vesicles in a cell, thus, varies depending on the type of vesicle that is present. Lysosomes are specialized organelles that contain digestive enzymes that are used to break down substances in the cell into smaller molecules. As these organelles are present only in animal cells, the function of vesicles in this case will be different compared to that of the plant cell."}, {"url": "http://www.answers.com/Q/Function_of_vesicles", "passage_text": "Also pinocytosis is a related term to endocytosis and refers to the intake of specifically aqueous material; Vesicles can also transport material within the cell. For example, vesicles transport proteins from the rough endoplasmic reticulum to the Golgi apparatus. Vesicles are mainly involved in the transportation of material in/out or within the cell. They are made of at least one layer of the phospholipid-bilayer; which is the majo … r constituent of the cell membrane."}, {"url": "http://study.com/academy/lesson/vesicles-definition-function-quiz.html", "passage_text": "Lysosomes are cellular vesicles that contain digestive enzymes. Lysosomes are used by cells to break down food particles and to get rid of unneeded cellular materials. Transport vesicles move molecules within the cells. All cells make proteins and require them to function. Proteins are made in riboso"}, {"url": "http://www.4to40.com/science/index.asp?p=Vesicle_Function", "passage_text": "The membrane that encloses the vesicle is similar to the plasma membrane. Thus, vesicles can fuse with the plasma membrane when they want to release their contents outside the boundaries of the cell. However, vesicles can also fuse with other organelles that are present inside the cell to release or engulf substances. Vesicles are small cell organelles that are present in cells. These organelles are small, membrane enclosed sacs which store and transport substances to and from one cell to another and from one part of a cell to another. They are one of the important parts of a cell"}, {"url": "https://en.wikipedia.org/wiki/Vesicle_(biology_and_chemistry)", "passage_text": "The membrane enclosing the vesicle is also a lamellar phase, similar to that of the plasma membrane, and vesicles can fuse with the plasma membrane to release their contents outside of the cell. Vesicles can also fuse with other organelles within the cell. Vesicles perform a variety of functions. Because it is separated from the cytosol, the inside of the vesicle can be made to be different from the cytosolic environment. For this reason, vesicles are a basic tool used by the cell for organizing cellular substances. Vesicles are involved in metabolism, transport, buoyancy control, and enzyme storage"}, {"url": "http://www.uniprot.org/locations/SL-0244", "passage_text": "Definition. The secretory vesicle is a vesicle that mediates the vesicular transport of cargo-e.g. hormones or neurotransmitters-from an organelle to specific sites at the cell membrane, where it docks and fuses to release its content. "}]