[{"url": "http://rarediseases.org/rare-diseases/pompe-disease/", "passage_text": "Summary. Pompe disease is a rare multisystem genetic disorder that is characterized by absence or deficiency of the lysosomal enzyme alpha-glucosidase (GAA). This enzyme is required to breakdown (metabolize) the complex carbohydrate glycogen and convert it into the simple sugar glucose."}, {"url": "http://www.niams.nih.gov/Health_Info/Pompe_Disease/", "passage_text": "Pompe disease is diagnosed by screening for the common mutations in the GAA gene, by measuring the level of the GAA enzyme in a blood sample, or by a muscle biopsy. Once a diagnosis is obtained, consultation with a geneticist and screening of other family members is recommended."}, {"url": "http://wiki.ggc.edu/wiki/Pompe_Disease", "passage_text": "Pompe disease is a hereditary disorder that disables the heart and muscles. It is rare, most often times fatal, and found 1 in every 40,000 births. The disorder is caused by mutations in the gene that makes the enzyme alpha-glucosidase (GAA), which reduces or eliminates the enzyme alpha-glucosidase."}, {"url": "http://www.niams.nih.gov/Health_Info/Pompe_Disease/", "passage_text": "Pompe (POM-pay) disease, also known as glycogen storage disease type II or acid maltase deficiency, is a rare genetic disorder that results in profound muscle weakness. The disease is caused by mutations in the gene that instructs the body to make an enzyme called acid alpha-glucosidase (GAA)."}, {"url": "http://www.understandinganimalresearch.org.uk/why/human-health/pompe-disease/", "passage_text": "Pompe disease. Pompe disease (glycogen storage disease type 2, acid maltase deficiency) is a rare genetic disorder which causes progressive muscle weakness. It affects around 1 in 40,000 births and is a recessive genetic disease, meaning both parents must carry the faulty gene."}, {"url": "http://www.webmd.com/children/pompe-disease", "passage_text": "Summary. Pompe disease is a rare multisystem genetic disorder that is characterized by absence or deficiency of the lysosomal enzyme alpha-glucosidase (GAA). This enzyme is required to breakdown (metabolize) the complex carbohydrate glycogen and convert it into the simple sugar glucose."}, {"url": "http://www.pompe.com/en/patients/about/cause.aspx", "passage_text": "The underlying cause of Pompe disease is always the same in all patients: the absence or marked deficiency of a specific enzyme, acid alpha-glucosidase (pronounced “AL-fa glue-CO-sih-days” and often abbreviated GAA)."}, {"url": "http://www.medindia.net/patients/patientinfo/pompe-disease.htm", "passage_text": "The disease is caused by genetic mutations that lead to deficiency or absence of the enzyme acid alpha-glucosidase (GAA), also known as acid maltase. This enzyme is required to breakdown glycogen, a stored sugar into glucose. Pompe disease exists in three forms-infantile, juvenile, and adult-onset."}]