[{"url": "http://insomnia.emedtv.com/ambien/ambien-dosage.html", "passage_text": "Dose of Ambien for Insomnia. For women, the standard recommended dosage of Ambien is 5 mg at bedtime. For men, the recommended dosage is 5 to 10 mg at bedtime. For people who are taking other medicines that affect the brain, have liver disease, or are older, the recommended starting dose may be Ambien 5 mg."}, {"url": "http://www.minddisorders.com/Py-Z/Zolpidem.html", "passage_text": "The maximum dose for one day is 10 mg. People who miss a dose of zolpidem should skip the missed dose, and take the next dose at the regularly scheduled time. Under no circumstances should a person take more than 10 mg in one day. Zolpidem should be taken exactly as directed by the prescribing physician. Recommended dosage. The usual dose of zolpidem in adults is 5–10 mg. For healthy adults, 10 mg is commonly recommended. However, people taking other drugs that cause drowsiness, people who have severe health problems, especially liver disease, and older people (over age 65) should take a lower dose, usually 5 mg."}, {"url": "http://www.ems1.com/medical-clinical/articles/681652-Zolpidem-Ambien-Drug-Whys/", "passage_text": "Dosing and Administration – The normal zolpidem dose for treatment of insomnia in adults is 10 milligrams immediate release or 12.5 milligrams extended release taken orally immediately before bedtime. Dosing should be individualized to patient response. Therapy should be limited to seven to 10 days. In reality, insomnia patients are often long-term users of zolpidem; few experience adverse effects. While the manufacturer recommends a maximum adult dose of 10 milligrams (immediate release), studies have found 10 to 20 milligrams effective for insomnia in healthy adults. There are no data on the effectiveness or safety of zolpidem in children under 18 years of ag"}, {"url": "http://www.rxlist.com/ambien-drug/indications-dosage.htm", "passage_text": "Dosage In Adults. Use the lowest effective dose for the patient. The recommended initial dose is 5 mg for women and either 5 or 10 mg for men, taken only once per night immediately before bedtime with at least 7-8 hours remaining before the planned time of awakening. If the 5 mg dose is not effective, the dose can be increased to 10 mg. In some patients, the higher morning blood levels following use of the 10 mg dose increase the risk of next day impairment of driving and other activities that require full alertness [see WARNINGS AND PRECAUTIONS ]."}, {"url": "http://www.fda.gov/Drugs/DrugSafety/ucm334041.htm", "passage_text": "A. FDA has informed the manufacturers that the recommended dose of zolpidem for women should be lowered from 10 mg to 5 mg for immediate-release products (Ambien, Edluar, and Zolpimist) and from 12.5 mg to 6.25 mg for extended-release products (Ambien CR). A. If you are currently taking the 10 mg or 12.5 mg dose of zolpidem-containing insomnia medicine, continue taking your prescribed dose as directed until you have contacted your health care professional to ask for instructions on how to safely continue to take your medicine."}, {"url": "https://answers.yahoo.com/question/index?qid=20100718211821AAxf6ut", "passage_text": "The recommended dose of Ambien CR for adults is 12.5 mg once daily immediately before bedtime. The total Ambien CR dose should not exceed 12.5 mg per day.. In some causes doctors may, at their discretion, prescribe a larger dose if the doctor feels it is appropriate. Best Answer: The FDA maximum dose for Ambien (zolpidem) is 10 mg. For Ambien CR (zolpidem extended-release) the maximum dose is 12.5 mg. Ambien comes in 5 mg and 10 mg tablets. Ambien CR comes in 6.25 mg and 12.5 mg tablets"}, {"url": "https://answers.yahoo.com/question/index?qid=20100718211821AAxf6ut", "passage_text": "Rating Newest Oldest. Best Answer: The FDA maximum dose for Ambien (zolpidem) is 10 mg. For Ambien CR (zolpidem extended-release) the maximum dose is 12.5 mg. Ambien comes in 5 mg and 10 mg tablets. Ambien CR comes in 6.25 mg and 12.5 mg tablets"}]