[{"url": "http://www.news-medical.net/news/2007/10/08/30907.aspx", "passage_text": "The cecum is a pouch-like structure of the colon and the appendix is near the junction of the small intestine and the large intestine and has abundant infection-fighting lymphoid cells, which suggests it plays a role in the immune system."}, {"url": "http://www.webmd.com/digestive-disorders/picture-of-the-appendix", "passage_text": "1 Appendicitis: For unclear reasons, the appendix often becomes inflamed, infected, and can rupture. 2  This causes severe pain in the right lower part of the belly, along with nausea and vomiting. 3  Tumors of the appendix: Carcinoid tumors secrete chemicals that cause periodic flushing, wheezing, and diarrhea."}, {"url": "http://www.mayoclinic.org/diseases-conditions/appendicitis/basics/definition/CON-20023582", "passage_text": "Appendicitis is an inflammation of the appendix, a finger-shaped pouch that projects from your colon on the lower right side of your abdomen. The appendix doesn't seem to have a specific purpose. Appendicitis causes pain in your lower right abdomen."}, {"url": "http://www.webmd.com/digestive-disorders/digestive-diseases-appendicitis", "passage_text": "In this article. Appendicitis is an inflammation of the appendix, a 3 1/2-inch-long tube of tissue that extends from the large intestine. No one is absolutely certain what the function of the appendix is. One thing we do know: We can live without it, without apparent consequences."}, {"url": "http://www.globalhealingcenter.com/natural-health/what-does-the-appendix-do/", "passage_text": "The appendix is a tube-shaped sac that’s attached to the large intestine. It exists in humans and a small number of other mammals, including the koala and apes. In medical terms, it’s referred to as ‘vermiform appendix’ for its thin, worm-like shape."}, {"url": "http://www.wereyouwondering.com/what-does-the-appendix-do/", "passage_text": "Partially digested food and foreign antigens can become stuck in the appendix because of its remote location. Your appendix is a closed tube, making it difficult for your body to clear away debris, should any infection causing bacteria or other matter become stuck."}, {"url": "http://www.wereyouwondering.com/what-does-the-appendix-do/", "passage_text": "by Katrina Cain. Tweet. Your appendix is located in your lower right abdomen, attached to the large intestine. Just past the ileocecal valve; the gateway between the small and large intestine, is the cecum; a bulbous mass located at the bottom of the ascending colon."}]