[{"url": "http://www.dummies.com/how-to/content/how-to-determine-marginal-cost-marginal-revenue-an.html", "passage_text": "Marginal cost. Marginal cost is the derivative of the cost function, so take the derivative and evaluate it at x = 100. Thus, the marginal cost at x = 100 is $15 — this is the approximate cost of producing the 101st widget."}, {"url": "http://economicsconcepts.com/marginal_cost.htm", "passage_text": "For example, the total cost of producing one pen is $5 and the total cost of producing two pens is $9, then the marginal cost of expanding output by one unit is $4 only (9 - 5 = 4)."}, {"url": "http://www.businessdictionary.com/definition/marginal-cost.html", "passage_text": "Marginal costs are variable costs consisting of labor and material costs, plus an estimated portion of fixed costs (such as administration overheads and selling expenses). In companies where average costs are fairly constant, marginal cost is usually equal to average cost."}, {"url": "http://www.ehow.com/about_6523991_definition-marginal-cost-economics.html", "passage_text": "Other Terms. Other cost terms, in addition to marginal cost and total cost, that are necessary to fully understand the producer's costs of production are average cost, average total cost, average fixed cost and average variable cost."}, {"url": "http://www.investopedia.com/terms/m/marginalcostofproduction.asp", "passage_text": "The change in total cost that comes from making or producing one additional item. The purpose of analyzing marginal cost is to determine at what point an organization can achieve economies of scale. The calculation is most often used among manufacturers as a means of isolating an optimum production level. Next Up."}, {"url": "http://economicsconcepts.com/marginal_cost.htm", "passage_text": "Example: For example, the total cost of producing one pen is $5 and the total cost of producing two pens is $9, then the marginal cost of expanding output by one unit is $4 only (9 - 5 = 4). The marginal cost of the second unit is the difference between the total cost of the second unit and total cost of the first unit. The marginal cost of the 5th unit is $5. It is the difference between the total cost of the 6th unit and the total cost of the, 5th unit and so forth."}]