[{"url": "http://roofingca.owenscorning.com/homeowner/thingsyoushouldknow/howmuch.aspx", "passage_text": "Estimating. To estimate how many shingles you'll need, first estimate the total square footage of your roof's surface. To do this, measure the length and width of each plane on the roof, including dormers. Then, multiply length x width to get the square footage of each plane. Finally, calculate your roof's total square footage by simply adding the square footage of each of the planes together. For example, this shed roof has one roof plane. Simply measure length (A) x width (B): A x B = 120' x 100' = 12,000 sq. ft. for the total square footage of the roof. This gable roof has two planes."}, {"url": "http://homeguides.sfgate.com/calculate-square-footage-roof-8729.html", "passage_text": "Multiply the number of roofing squares for a low-pitch roof by 1.06 to 1.08 to get the square roof area. Multiply the number of roofing squares for a medium-pitch roof by 1.12 to 1.25 -- or by 1.3 to 1.42 for a high-pitch roof -- to get the square roof area. Convert the area to roofing squares. Because each 100 square feet of roof is one roofing square, divide the total area from Step 1 by 100. The answer is the number of roofing squares for the roof."}, {"url": "http://homeguides.sfgate.com/calculate-square-footage-roof-8729.html", "passage_text": "A low pitch rises 3 inches every 12 inches of base horizontal length. A medium pitch rises 6 to 9 inches every 12 inches of base horizontal length. A high pitch roof rises more than 9 inches for every 12 inches of base horizontal length. Estimate the roof pitch by sight or calculate it with a level in the next step. Convert the area to roofing squares. Because each 100 square feet of roof is one roofing square, divide the total area from Step 1 by 100. The answer is the number of roofing squares for the roof."}, {"url": "http://www.ehow.com/how_4514291_calculate-shingles-needed.html", "passage_text": "Instructions. Measure each plane of your roof, length and width. Record the length and width of each plane and then multiply these numbers together to get the square footage of each plane of your home's roof. "}, {"url": "http://www.wikihow.com/Measure-a-Roof", "passage_text": "4. Determine the pitch of the roof. The pitch is how steep the roof is. Pitch is calculated by the roof's rise over its run. Measure from the edge of the roof over 12 inches (12 is the run) and see how many inches up the roof line is (this is the rise). Get a slope multiplier from the chart below. "}, {"url": "http://www.bhg.com/home-improvement/exteriors/roofs/roofing-materials-calculator/", "passage_text": "A few tips: To figure the size of your roof, see our square footage calculator. In roofing terminology, a square is 100 square feet. Composition shingles (asphalt or fiberglass) come in bundles that cover 1/3 square. Roofing comes in rolls 3 feet wide and 36 feet long, for a coverage of about 1 square. "}, {"url": "http://www.curtislumber.com/measure-roof.asp", "passage_text": "In order to estimate how much roofing you will need, you must first estimate the total square footage of your roof's surface. Measure the length and width of each plane on the roof, including dormers. Then, multiply length x width to get the square footage of each plane. "}, {"url": "http://www.improvenet.com/a/how-to-measure-roof-pitch", "passage_text": "That is the roof's rise. Knowing that will determine what your roof’s pitch since the run is 12 inches by default. In the attic, put the level against a rafter with the 12-inch mark on the bottom. Measure the inches from the level’s end up to the bottom edge of the rafter. That measurement is the roof’s rise. "}, {"url": "http://www.hgtv.com/design/decorating/clean-and-organize/roofing-needs-require-some-math", "passage_text": "Roof: Ratio of rafter pitch x length. To determine the pitch of the roof, measure over on a level line 12 inches from the edge of the roof on any part of the roof and measure vertically to see what the rise is. You also mentioned dormer windows, which leads me to think that the pitch of your roof is at least a 6/12. The length of the rafter depends on the pitch or angle of the roof and the amount of overhang at the eaves. The pitch is the rate of vertical elevation of the rafter in inches for every 12 inches of horizontal run. For a home 24 feet from front to rear, the total run to the center of the home will be 12 feet"}]