[{"url": "http://wecaremedicalmall.org/washington_mri_-_ct.htm", "passage_text": "Seattle, Everett, Washington CT Scan with contrast $370. Seattle, Everett, Washington CT Scan with and without contrast $370. Cheap Low Cost Cash Discount Washington MRI's $380 Cheap Low Cost Cash Discount Washington CT Scans $270 National Quality Imaging Centers. Save time. Call us toll free (888) 380-6337. Seattle, Everett, Washington CT Scan with and without contrast $370. WISCONSIN LOWEST COST MRI $435 WISCONSIN LOWEST COST CT SCAN $480 --once you have a doctor's referral. call toll free 888-380-6337 to schedule--."}, {"url": "http://www.medicaldiscounts.com/mri.htm", "passage_text": "Low Cost, Discount Cheap MRI's starting at $300 National price range for a basic CT Scan no contrast is from $390 - $1,585 Using our service, the average nationwide CT Scan price is $300. "}, {"url": "http://northwestmri.com/cost-of-mri/", "passage_text": "A typical MRI in Oregon averages of $1950. (see below for our chart of the cost of an MRI in Oregon, and the national averages). Northwest MRI offers affordable MRI’s! We keep our costs low to save you money. Northwest MRI is Oregon owned and operated, and we used only American doctors via tele-medicine to save on overhead. "}, {"url": "http://health.costhelper.com/mri.html", "passage_text": "Insurance: Allegiance. Our insurance gave us an EOB yesterday the MRI is going to cost us $2700.00 and the contrast dye was $600.00 so in total a 45 minute brain MRI with contrast dye at Aurora St. Lukes in Milwaukee, WI is $3300.00 with Allegiance Medical Insurance. What should be included: 1  A spinal MRI is used to find various spinal problems, including nerve damage or tumors. 2  It typically costs $1,000-$5,000, depending on the part of the spine being scanned and whether the procedure is performed in a hospital or physician's office."}, {"url": "http://thehealthcareblog.com/blog/2014/08/06/how-much-does-an-mri-cost-in-california-255-973-25-2925/", "passage_text": "No. 3 and No. 4: Two of our community members sent in prices for that same MRI of the lower back (CPT code 72148), both at a Health Diagnostics location at 325 Sacramento St. in San Francisco. One a Medicare recipient, was charged $2,450, and Medicare paid $255. There was no patient payment. No. 1: We heard from one Kaiser member, who received an MRI of the lower back, without contrast or dye (CPT code 72148) at the Kaiser Antioch Medical Center on Sand Creek Road in Antioch, Calif. This person was charged $973.25 and paid $973.25; insurance paid nothing."}, {"url": "http://waortho.com/", "passage_text": "For larger scans, such as backs and hips, we schedule imaging at Washington Diagnostic MRI and Providence Centralia Hospital directly adjacent to our offices. Our patients also benefit from the latest technology in tele-radiology. "}, {"url": "http://wecaremedicalmall.org/knee_mri.htm", "passage_text": "Arkansas low cost knee, shoulder, elbow, hip MRI starting at $510. California low cost knee, shoulder, elbow, hip MRI starting at $325. Colorado low cost knee, shoulder, elbow, hip MRI starting at $510. Connecticut low cost knee, shoulder, elbow, hip MRI starting at $830. Delaware low cost knee, shoulder, elbow, hip MRI starting at $755. District of Columbia low cost knee, shoulder, elbow, hip MRI starting at $555. Florida low cost knee, shoulder, elbow, hip MRI starting at $335. Michigan low cost knee, shoulder, elbow, hip MRI starting at $560. Minnesota low cost knee, shoulder, elbow, hip MRI starting at $435. Mississippi low cost knee, shoulder, elbow, hip MRI starting at $510. Missouri low cost knee, shoulder, elbow, hip MRI starting at $380."}, {"url": "https://www.anthem.com/imaging/", "passage_text": "Q. How much money could I save by visiting a lower-cost imaging provider? A. In some areas, the cost for an MRI or CT scan can vary by more than $1,000. If, for example, your plan requires you to pay a 20% coinsurance, and you use a provider that charges $1,000 less, you could save at least $200 out of pocket. The cost of advanced imaging procedures has increased in recent years, contributing to higher medical costs. For example, the cost for MRIs and CT scans can vary from $350 to $2,000, depending on the region where you live and the facility where a procedure is performed."}, {"url": "http://wecaremedicalmall.org/knee_mri.htm", "passage_text": "Texas low cost knee, shoulder, elbow, hip MRI starting at $380. Utah low cost knee, shoulder, elbow, hip MRI starting at $540. Virginia low cost knee, shoulder, elbow, hip MRI starting at $560. Washington low cost knee, shoulder, elbow, hip MRI starting at $380. Michigan low cost knee, shoulder, elbow, hip MRI starting at $560. Minnesota low cost knee, shoulder, elbow, hip MRI starting at $435. Mississippi low cost knee, shoulder, elbow, hip MRI starting at $510. Missouri"}]