[{"url": "http://www.bananalink.org.uk/all-about-bananas", "passage_text": "All about bananas. Bananas are the most popular fruit in the world. The banana is, in fact, not a tree but a high herb that grows up to 15 metres. It is believed that there are almost 1000 varieties of bananas in the world, subdivided in 50 groups. The most commonly known banana is the Cavendish variety, which is the one produced for export markets."}, {"url": "http://foodfacts.mercola.com/banana.html", "passage_text": "There are many reasons why bananas are one of the most popular foods in the world. They offer the perfect portion size, come in their own handy, natural protective wrap, and are extremely economical. Fresh and creamy, bananas mix well with other fruits and are a favorite lunchtime addition or for noshing on the go. "}, {"url": "http://www.merriam-webster.com/dictionary/banana", "passage_text": "Definition of BANANA for Kids. : a fruit that is shaped somewhat like a finger, is usually yellow when ripe, and grows in bunches on a large treelike tropical plant with very large leaves. Full Definition of BANANA. 1. : an elongated usually tapering tropical fruit with soft pulpy flesh enclosed in a soft usually yellow rind. 2. : any of several widely cultivated perennial herbs (genus Musa of the family Musaceae, the banana family) bearing bananas in compact pendent bunches."}, {"url": "http://www.ehow.com/about_4586613_what-banana.html", "passage_text": "Save. Bananas are one of the most widely consumed fruits in the world, and for good reason. Harvested year round, they are an inexpensive super food that's readily available and loaded with healthy vitamins and minerals. Benefits. The banana is packed with vitamins and minerals, making it one of the most beneficial fruits you can eat. They are a leading source of potassium, which is necessary for healthy blood circulation, preventing muscle cramps (it affects muscle contraction) and lowering blood pressure."}, {"url": "https://en.wikipedia.org/wiki/Banana", "passage_text": "Worldwide, there is no sharp distinction between bananas and plantains. Especially in the Americas and Europe, banana usually refers to soft, sweet, dessert bananas, particularly those of the Cavendish group, which are the main exports from banana-growing countries. The banana plant is the largest herbaceous flowering plant. All the above-ground parts of a banana plant grow from a structure usually called a  corm . Plants are normally tall and fairly sturdy, and are often mistaken for trees, but what appears to be a trunk is actually a false stem or pseudostem."}, {"url": "http://www.whfoods.com/genpage.php?tname=foodspice&dbid=7", "passage_text": "At about 3 grams per medium banana, we rank bananas as a good source of fiber. Approximately one-third of the fiber in bananas is water-soluble fiber. For one medium-sized banana, this amount translates into 1 gram of soluble fiber per banana. This chart graphically details the %DV that a serving of Bananas provides for each of the nutrients of which it is a good, very good, or excellent source according to our Food Rating System. Additional information about the amount of these nutrients provided by Bananas can be found in the Food Rating System Chart."}, {"url": "https://en.wikipedia.org/wiki/Banana", "passage_text": "The banana fruits develop from the banana heart, in a large hanging cluster, made up of tiers (called hands), with up to 20 fruit to a tier. The hanging cluster is known as a bunch, comprising 3–20 tiers, or commercially as a banana stem, and can weigh 30–50 kilograms (66–110 lb). The banana plant is the largest herbaceous flowering plant. All the above-ground parts of a banana plant grow from a structure usually called a  corm . Plants are normally tall and fairly sturdy, and are often mistaken for trees, but what appears to be a trunk is actually a false stem or pseudostem."}, {"url": "http://www.medicalnewstoday.com/articles/271157.php", "passage_text": "Bananas are one of the most widely consumed fruits in the world for good reason. The curved yellow fruit packs a big nutritional punch, wrapped in its own convenient packaging. Some scientists believe that the banana may have even been the world's first fruit. "}, {"url": "https://en.wikipedia.org/wiki/Banana", "passage_text": "The banana is an edible fruit, botanically a berry, produced by several kinds of large herbaceous flowering plants in the genus Musa. In some countries, bananas used for cooking may be called plantains. The fruit is variable in size, color and firmness, but is usually elongated and curved, with soft flesh rich in starch covered with a rind which may be green, yellow, red, purple, or brown when ripe. The banana plant is the largest herbaceous flowering plant. All the above-ground parts of a banana plant grow from a structure usually called a  corm . Plants are normally tall and fairly sturdy, and are often mistaken for trees, but what appears to be a trunk is actually a false stem or pseudostem."}]