[{"url": "http://www.answers.com/Q/Why_is_all_of_your_DNA_in_all_somatic_cells", "passage_text": "Confidence votes 98. Somatic cells are all the cells in an organism's body except for the gametes. Certain somatic cells may have different functions in an organism due to differences in gene expression; which simply mean that somatic cells only use certain parts of the DNA. Therefore, all somatic cells have the same DNA"}, {"url": "http://www.wisegeek.org/what-are-somatic-cells.htm", "passage_text": "All animal cells are somatic, except those used for reproduction. All somatic cells contain mitochondria. In most cases, all somatic cells within an organism carry the same DNA genetic code. Each somatic cell contains a nucleus at its center, within which its chromosomes are contained. Germ cells each contain 23 chromosomes. When an egg and sperm fuse to produce a zygote, the new cell therefore has the full complement of 46, with one set of 23 from the egg and one from the sperm. All of the somatic cells that develop from the zygote have the same 46"}, {"url": "http://www.wisegeek.org/what-are-somatic-cells.htm", "passage_text": "DNA Content. The somatic cells of an animal species contain a specific number of chromosomes that must be maintained for the cells to work properly. In humans, they each contain 46 chromosomes, which includes 22 pairs of homologous chromosomes and one pair that is non-homologous. Germ cells each contain 23 chromosomes. When an egg and sperm fuse to produce a zygote, the new cell therefore has the full complement of 46, with one set of 23 from the egg and one from the sperm. All of the somatic cells that develop from the zygote have the same 46"}, {"url": "http://csls-text.c.u-tokyo.ac.jp/active/12_02.html", "passage_text": "In somatic cell division, a 2n parent cell doubles its DNA in accordance with the cell cycle and distributes it to two daughter cells (Fig. 12-2A). In meiosis, on the other hand, a 2n cell doubles its DNA and undergoes two successive divisions to become four 1n cells (Fig. 12-2B). "}, {"url": "http://learn.genetics.utah.edu/content/cloning/whatiscloning/", "passage_text": "Let's take it apart: Somatic cell: A somatic cell is any cell in the body other than sperm and egg, the two types of reproductive cells. Reproductive cells are also called germ cells. In mammals, every somatic cell has two complete sets of chromosomes, whereas the germ cells have only one complete set. Nuclear: The nucleus is a compartment that holds the cell's DNA. The DNA is divided into packages called chromosomes, and it contains all the information needed to form an organism. It's small differences in our DNA that make each of us unique. Transfer: Moving an object from one place to another. To make Dolly, researchers isolated a somatic cell from an adult female sheep"}, {"url": "https://answers.yahoo.com/question/index?qid=20090309203539AAXie7m", "passage_text": "Best Answer: Your somatic cell need the entire DNA code so that they know which proteins they are to produce and what function they serve. "}, {"url": "https://en.wikipedia.org/wiki/Somatic_cell", "passage_text": "A somatic (Greek: σὠμα/soma = body) or vegetative cell is any biological cell forming the body of an organism; that is, in a multicellular organism, any cell other than a gamete, germ cell, gametocyte or undifferentiated stem cell. Due to the fusion of the two gametes, a human zygote contains 46 chromosomes (i.e. 23 pairs). However, a large number of species have the chromosomes in their somatic cells arranged in fours ( tetraploid ) or even sixes ( hexaploid ). Thus, they can have diploid or even triploid germline cells."}, {"url": "https://en.wikipedia.org/wiki/Somatic_cell_nuclear_transfer", "passage_text": "In genetics and developmental biology, somatic cell nuclear transfer (SCNT) is a laboratory strategy for creating a viable embryo from a body cell and an egg cell. The technique consists of taking an enucleated oocyte (egg cell) and implanting a donor nucleus from a somatic (body) cell. "}]