[{"url": "http://www.emedicinehealth.com/chalazion_lump_in_eyelid/article_em.htm", "passage_text": "A chalazion is caused by the oil in the gland becoming too thick to flow out of the gland or the opening of the gland being obstructed. Without anywhere to go, the oil builds up inside the gland and forms a lump in the eyelid. Each of the oil glands, called meibomian glands, produces oil that flows out of the gland into the tears. The oil exits from each gland through a tiny circular opening just behind the eyelashes of the upper and lower lids of both eyes."}, {"url": "http://kellogg.umich.edu/patientcare/conditions/chalazion.html", "passage_text": "Chalazion is a swelling in your eyelid caused by chronic inflammation of one of the small oil producing glands (meibomian glands) located in the upper and lower eyelids. This swelling is localized and often resembles a pea-like lump under your eyelid skin. When a chalazion is small and without symptoms, it may disappear without treatment. If the chalazion is large, it may cause blurred vision by distorting the shape of your eye. A chalazion is sometimes confused with a stye, which also appears as a lump in the eyelid."}, {"url": "https://en.wikipedia.org/wiki/Chalazion", "passage_text": "From Wikipedia, the free encyclopedia. For the fungi genus, see Chalazion (fungus) . A chalazion (/kəˈleɪziən/ ; plural chalazia /kəˈleɪziə/), also known as a meibomian gland lipogranuloma, is a cyst in the eyelid that is caused by inflammation of a blocked meibomian gland, usually on the upper eyelid. Chalazia differ from styes (hordeola) in that they are subacute and usually painless nodules. "}, {"url": "http://www.medicinenet.com/chalazion/article.htm", "passage_text": "1 A chalazionis a lump in the upper or lower eyelid caused by obstruction and inflammation of an oil gland of the eyelid. 2  A chalazion is not a tumor or growth and does not cause permanent changes in the vision. 3  A chalazion is very common and usually goes away without the necessity of surgery. Eyelid glands are called the meibomian glands. They are also known as the palpebral glands, tarsal glands, or tarsoconjunctival glands. There are 30 to 40 of these glands in each of the upper and lower lids. These glands produce a thick liquid secretion that is discharged into the tear film of the eye."}, {"url": "http://www.emedicinehealth.com/chalazion_lump_in_eyelid/article_em.htm", "passage_text": "A chalazion is a lump of the lid that is caused by obstruction of the drainage duct of an oil gland within the upper or lower eyelid. This lump may increase in size over days to weeks and may occasionally become red, warm, or painful. Each of the oil glands, called meibomian glands, produces oil that flows out of the gland into the tears. The oil exits from each gland through a tiny circular opening just behind the eyelashes of the upper and lower lids of both eyes."}, {"url": "http://www.medicinenet.com/chalazion/article.htm", "passage_text": "Chalazion facts. 1  A chalazionis a lump in the upper or lower eyelid caused by obstruction and inflammation of an oil gland of the eyelid. 2  A chalazion is not a tumor or growth and does not cause permanent changes in the vision. Eyelid glands are called the meibomian glands. They are also known as the palpebral glands, tarsal glands, or tarsoconjunctival glands. There are 30 to 40 of these glands in each of the upper and lower lids. These glands produce a thick liquid secretion that is discharged into the tear film of the eye."}, {"url": "http://www.chalaziontreatment.com/chalazion-causes/", "passage_text": "Chalazion Causes. Chalazion causes vary, but they are basically caused by a blockage or obstruction of the ducts in the meibomian glands. These glands are responsible for lubricating the film of tears with lipid material — a combination of oil and mucus. Chalazion Causes, Signs, and Symptoms. Signs and symptoms of a chalazion include eyelid swelling and tenderness, sensitivity to light, more frequent tearing and heaviness of the eyelid. A chalazion tends to point towards the nose. In some cases, the eyelid may even swell suddenly"}, {"url": "http://www.healthline.com/health/chalazion", "passage_text": "Causes and Risk Factors. The bump that characterizes a chalazion is caused by a blockage in the Meibomian gland on the eyelid. Meibomian glands produce oil in both the upper and lower eyelids. Certain people are more likely than others to get a chalazion. A chalazion is a small bump that appears on your eyelid because of a blocked oil gland. It can develop on the lower or upper eyelid, and it often disappears without treatment in about one month"}]