[{"url": "http://business-schools.startclass.com/l/177/Rice-University-Jones-TX", "passage_text": "Average GPA Admitted. Admission Criteria. Students admitted to Rice Jones School have an average GMAT score of 676 and an average undergraduate GPA of 3.3. Admitted students work an average of 5.1 years before applying here, which is an average amount of time compared to other schools. Average Post-Graduation Salary. Costs. The total cost of a two-year degree for full-time students at Rice Jones School is $122,382. Based on the total cost of a two-year degree and the average post-graduation salary, you will need to work at least 1.21 years to offset the cost of attending business school."}, {"url": "http://ceve.rice.edu/degrees.aspx", "passage_text": "Students will complete at least 30 semester hours of graduate level courses (All 30 hours of course work must be at or above the 500 level) in our Civil Engineering or Sustainable Environmental Engineering and Design sub-tracks including the required core courses and a final project. Master of Civil and Environmental Engineering (MCEE). 1  30 semester hours of graduate level courses. 2  24 semester hours must be at Rice University (no more than 6 hours of transfer credit)."}, {"url": "http://www.acceptancerate.com/schools/rice-university", "passage_text": "Many of the students accepted into this school got an SAT score between 2040 - 2320, or got accepted with an ACT score in the range of 31 - 34. By applying sampled GPA data from over 150 schools, we are able to estimate that the Rice University average GPA ranges from 3.82 to 4 for accepted students. The acceptance rate of Rice University is considered highly competitive, with only 20% of students which applied on average being admitted. The acceptance rate for Rice University is more than 100% lower than the national average of all colleges which is around 55.5%."}, {"url": "http://www.prepscholar.com/sat/s/colleges/Rice-University-admission-requirements", "passage_text": "The average SAT score composite at Rice University is a 2180. This score makes Rice University Strongly Competitive for SAT test scores. The 25th percentile SAT score is 2040, and the 75th percentile SAT score is 2320. "}, {"url": "http://www.prepscholar.com/sat/s/colleges/Rice-University-SAT-scores-GPA", "passage_text": "Average SAT: 2180. The average SAT score composite at Rice University is a 2180. The 25th percentile SAT score is 2040, and the 75th percentile SAT score is 2320. In other words, a 2040 places you below average, while a 2320 will move you up to above average. There's no absolute SAT requirement at Rice University, but they really want to see at least a 2040 to have a chance at being considered. The average GPA at Rice University is 4.08. This makes Rice University Extremely Competitive for GPAs. (Most schools use a weighted GPA out of 4.0, though some report an unweighted GPA. This school did not officially report its average GPA, but we've estimated it here using data from over 1,000 schools.)."}, {"url": "http://www.newgmat.org/good-gmat-score-rice-universitys/", "passage_text": "The average undergraduate GPA of applicants admitted to the Jones Graduate School of Business in 2011 was 3.40. The undergraduate GPA range (10th-90th percentile) was 2.9-3.8. The average GMAT score of applicants accepted to the Jones Graduate School of Business in 2011 was 673. The GMAT range (10th-90th percentile) was 600-740."}, {"url": "http://ceve.rice.edu/degrees.aspx", "passage_text": "1 30 semester hours of graduate level courses. 2  24 semester hours must be at Rice University (no more than 6 hours of transfer credit). 3  All 30 hours of course work must be at or above the 500 level. 4  All courses must be in the relevant field. Master of Civil and Environmental Engineering (MCEE). 1 "}, {"url": "http://students.rice.edu/students/Requirements.asp", "passage_text": "To graduate from Rice University, all students must: 1  Be registered at Rice full time for at least four full fall and/or spring semesters. 2  Complete the requirements of at least one major degree program. 3  Complete at least 120 semester hours (some degree programs require more than 120 hours). 1 Complete the requirements of at least one major degree program. 2  Complete at least 120 semester hours (some degree programs require more than 120 hours). 3  Complete at least 60 semester hours at Rice University. 4  Complete at least 48 hours of all degree work in upper-level courses (at the 300 level or higher"}]