[{"url": "http://www.answers.com/Q/What_are_some_environmental_factors_that_can_affect_gene_expression", "passage_text": "some environmental factors that can influence gene expression some environmental factors that can influence gene expression are the temperature, nutrition, light, chemical, a … nd infectious agents. 13 people found this useful."}, {"url": "http://utminers.utep.edu/rwebb/html/factors_affecting_expression.html", "passage_text": "Many factors can affect the rate at which a gene is expressed: 1  Gene copy number, simply, is the number of copies of the gene available for transcription. 2  Naturally, the higher the gene copy number, the greater the level of expression."}, {"url": "http://www.diabetesandenvironment.org/home/mech/genes", "passage_text": "The debate is not genes versus the environment anymore. Now, we wonder how the environment can affect how genes control the function of cells (gene expression). Some environmental exposures can affect gene expression through epigenetic or other processes. Epigenetic processes may be involved in the development of diabetes and obesity."}, {"url": "http://www.nature.com/scitable/topicpage/Environmental-Influences-on-Gene-Expression-536", "passage_text": "Light can also influence gene expression, as in the case of butterfly wing development and growth. For example, in 1917, biologist Thomas Hunt Morgan conducted studies in which he placed Vanessa urtica and Vanessa io caterpillars under red, green, or blue light, while other caterpillars were kept in the dark."}, {"url": "http://www.answers.com/Q/What_are_some_environmental_factors_that_can_affect_gene_expression", "passage_text": "The expression of genes in an organism can be influenced by the environment, including the external world in which the organism is located or develops, as well as the organism … 's internal world, which includes such factors as its hormones and metabolism."}, {"url": "http://www.diabetesandenvironment.org/home/mech/genes", "passage_text": "Environmental factors that can affect gene expression. Exposing a fetus, infant, or child to a chemical or nutritional (or other) stressor during development can affect the risk of disease development even into adulthood. The mechanisms involved are probably epigenetics (Boekelheide et al. 2012)."}, {"url": "http://www.nature.com/scitable/topicpage/Phenotypic-Range-of-Gene-Expression-Environmental-Influence-581", "passage_text": "Genes are actually quite active throughout our lives, switching their expression on and off in response to the environment and experience. Environmental factors can affect and alter gene expression, while our genes can define how we respond to different environments."}, {"url": "http://www.nature.com/scitable/topicpage/Environmental-Influences-on-Gene-Expression-536", "passage_text": "The presence of drugs or chemicals in an organism's environment can also influence gene expression in the organism. Cyclops fish are a dramatic example of the way in which an environmental chemical can affect development."}, {"url": "http://www.answers.com/Q/What_are_some_environmental_factors_that_can_influence_gene_expression", "passage_text": "Making the world better, one answer at a time. some environmental factors that can influence gene expression. some environmental factors that can influence gene expression are the temperature, nutrition, light, chemical, and infectious agents."}]