[{"url": "https://en.wikipedia.org/wiki/Dove_(toiletries)", "passage_text": "Dove is primarily made from synthetic surfactants, vegetable oils (such as palm kernel) and salts of animal fats (tallow). In some countries Dove is derived from tallow and for this reason it is not considered vegan, unlike vegetable oil based soaps. Dove have created a number of largely online-only short films, including Daughters (which was also broadcast during the Super Bowl XL), Evolution (which won two awards at the Cannes Lions International Advertising Festival), Onslaught, Amy."}, {"url": "http://theconcourse.deadspin.com/no-but-seriously-dove-soap-is-bad-1696932973", "passage_text": "This is not an accident: Dove bars are made to look like soap, so that soap shoppers will purchase them. Ooh, I like this soap, this is the luxury soap that beautifies my skin is the precise thought that is meant to lead to the purchase of Dove bars. It is a damn lie. Presumably you are meant to wash your face with some variety of actual soap, for the purpose of rendering it clean, and then you are meant to rub it down with the lather of the Dove loaf, for the purpose of rendering it moist. Many things are moist. Motor oil. Braised pork belly. A bog. Bangladesh"}, {"url": "https://en.wikipedia.org/wiki/Dove_(toiletries)", "passage_text": "Dove is a personal care brand owned by Unilever originating in the United Kingdom. Dove products are manufactured in Argentina, Australia, Brazil, Canada, China, Germany, India, Indonesia, Israel, Ireland, Mexico, Netherlands, Pakistan, Philippines, South Africa, Thailand, Turkey and United States. The products are sold in more than 80 countries and are offered for both women and men. Dove have created a number of largely online-only short films, including Daughters (which was also broadcast during the Super Bowl XL), Evolution (which won two awards at the Cannes Lions International Advertising Festival), Onslaught, Amy."}, {"url": "https://en.wikipedia.org/wiki/Soap", "passage_text": "In chemistry, soap is a salt of a fatty acid. Consumers mainly use soaps as surfactants for washing, bathing, and cleaning, but they are also used in textile spinning and are important components of lubricants. Soaps are key components of most lubricating greases, which are usually emulsions of calcium soap or lithium soap and mineral oil. These calcium-and lithium-based greases are widely used. Many other metallic soaps are also useful, including those of aluminium, sodium, and mixtures of them."}, {"url": "http://www.alabu.com/dove-ingredients/", "passage_text": "1 How It's Made: This detergent is chemically synthesized in a lab. 2  Summary: This Dove soap ingredient does not appear to have any beneficial properties for your skin (aside from cleaning it), and may dry it out. "}, {"url": "http://www.stylecraze.com/articles/benefits-of-dove-soap-for-oily-skin/", "passage_text": "3. Dove Soap Is A Natural Moisturizer: Dove is manufactured in such a way that it works like a moisturizer for the oily skin. It is a well-known fact that oily skin can become very sensitive and has lots of blemishes and dryness if one uses any product carelessly. Dove soap for oily skin helps in retaining the right amount of moisture and maintaining hydration all over the skin, while removing excess oil. This soap also prevents the skin from getting irritated and has the ability to give the skin a healthy complexion. [ Read: Dove Face Washes ]."}, {"url": "http://www.stylecraze.com/articles/benefits-of-dove-soap-for-oily-skin/", "passage_text": "4. Dove Soap Provides Complete And Balanced Nourishment: An oily skin is usually a result of unbalanced hormonal changes in the body that is reflected on the skin. It is often seen that an imbalance in the hormones result in either excessive secretions or lack in secretions. Dove soap for oily skin helps in retaining the right amount of moisture and maintaining hydration all over the skin, while removing excess oil. This soap also prevents the skin from getting irritated and has the ability to give the skin a healthy complexion. [ Read: Dove Face Washes ]."}, {"url": "https://www.unilever.com/brands/our-brands/dove.html", "passage_text": "Dove. Share. Dove believes that beauty-feeling and looking your personal best-is the result of proper care. Dove always aims to deliver products which tangibly improve the condition of skin or hair and give a pleasurable experience of care, because when you look and feel beautiful, it makes you feel happier. It’s a feeling every woman should experience every day. Dove Body Wash shows the power of just one shower. Dove has unlocked the key to softer and smoother skin after just one shower with a new body wash containing a breakthrough formula that delivers superior care. Find out more."}, {"url": "http://www.stylecraze.com/articles/benefits-of-dove-soap-for-oily-skin/", "passage_text": "But with Dove soap oily skin will be a thing of the past. Dove soap contains all the relevant creams and compounds that not only cleanse the oily skin but also prevent it from dryness and dirt. This soap can not only be used on the face but on the entire body as well. Dove soap for oily skin helps in retaining the right amount of moisture and maintaining hydration all over the skin, while removing excess oil. This soap also prevents the skin from getting irritated and has the ability to give the skin a healthy complexion. [ Read: Dove Face Washes ]."}]