[{"url": "http://www.sciatica-pain.org/sciatica-mri.html", "passage_text": "Sciatica MRI Diagnostic Benefits. Sciatica MRI is an advanced diagnostic imaging tool which completely visualizes the entire diversity of spinal structures in an effort to determine the exact anatomical source of symptoms. First, the interpretation of the images is a highly subjective process. Just because a spinal abnormality is seen, does not mean that it is in any way responsible for your pain. Second, MRI does not replace neurological testing or symptom correlation. These are crucial aspects of achieving an accurate diagnosis."}, {"url": "http://www.webmd.com/back-pain/ss/slideshow-visual-guide-to-sciatica", "passage_text": "An MRI can show the alignment of vertebral disks, ligaments, and muscles. A CT scan using contrast dye can also provide a useful picture of the spinal cord and nerves. Determining the cause of sciatica can help guide the course of treatment. X-rays can help identify bony abnormalities but can't detect nerve problems. It connects the lower spine to the upper thighbone and runs directly over the sciatic nerve. If this muscle goes into spasm, it can put pressure on the sciatic nerve, triggering symptoms of sciatica. Piriformis syndrome is more common in women."}, {"url": "https://en.wikipedia.org/wiki/Magnetic_resonance_neurography", "passage_text": "Magnetic resonance neurography is used to evaluate major nerve compressions such as those affecting the sciatic nerve (e.g. piriformis syndrome), the brachial plexus nerves (e.g. thoracic outlet syndrome), the pudendal nerve, or virtually any named nerve in the body. Neurography has been applied increasingly to evaluate the distal nerve roots, lumbo-sacral plexus and proximal sciatic nerve in the pelvis and thigh to find other causes of sciatica. It is increasingly important for brachial plexus imaging and for the diagnosis of thoracic outlet syndrome."}, {"url": "http://www.webmd.com/back-pain/ss/slideshow-visual-guide-to-sciatica", "passage_text": "But this doesn't always involve the sciatic nerve. In many cases, back pain is the result of overextending or straining the muscles in the lower back. What most often sets sciatica apart is the way the pain radiates down the leg and into the foot. It may feel like a bad leg cramp that lasts for days. It connects the lower spine to the upper thighbone and runs directly over the sciatic nerve. If this muscle goes into spasm, it can put pressure on the sciatic nerve, triggering symptoms of sciatica. Piriformis syndrome is more common in women."}, {"url": "https://en.wikipedia.org/wiki/Magnetic_resonance_neurography", "passage_text": "Magnetic resonance imaging (MRI) is based on differences in the physical properties of protons in water molecules in different tissues in the body. The protons and the water molecules of which they are part have subtly different movement characteristics that relate to their biophysical surroundings. Neurography has been applied increasingly to evaluate the distal nerve roots, lumbo-sacral plexus and proximal sciatic nerve in the pelvis and thigh to find other causes of sciatica. It is increasingly important for brachial plexus imaging and for the diagnosis of thoracic outlet syndrome."}, {"url": "http://www.webmd.com/back-pain/ss/slideshow-visual-guide-to-sciatica", "passage_text": "This is a large nerve that runs from the lower back down the back of each leg. When something injures or puts pressure on the sciatic nerve, it can cause pain in the lower back that spreads to the hip, buttocks, and leg. Up to 90% of people recover from sciatica without surgery. It connects the lower spine to the upper thighbone and runs directly over the sciatic nerve. If this muscle goes into spasm, it can put pressure on the sciatic nerve, triggering symptoms of sciatica. Piriformis syndrome is more common in women."}, {"url": "http://healthquestions.medhelp.org/mri-scan-of-sciatic-nerve", "passage_text": "mri-scan. So far, We did MRI twice and it showed the enlargement of sciatic nerve (left)but the doctors couldnt tell why it happened Some specialists thought it could be Dejerin-Sottas desease. Pain has nothing whatsoever to do with an MRI report. In the case of sciatic some people have severe damage and experience no pain whereas some people have barely perceptible damage and are in agony."}, {"url": "https://www.laserspineinstitute.com/articles/pinched_nerve_articles/mri/230/", "passage_text": "The proper diagnosis of a pinched nerve may not necessarily require an MRI (Magnetic Resonance Imaging.) However, this is the most precise and comprehensive diagnostic test available. "}, {"url": "https://en.wikipedia.org/wiki/Magnetic_resonance_neurography", "passage_text": "Magnetic resonance neurography (MRN) is the direct imaging of nerves in the body by optimizing selectivity for unique MRI water properties of nerves. It is a modification of magnetic resonance imaging. Neurography has been applied increasingly to evaluate the distal nerve roots, lumbo-sacral plexus and proximal sciatic nerve in the pelvis and thigh to find other causes of sciatica. It is increasingly important for brachial plexus imaging and for the diagnosis of thoracic outlet syndrome."}]