[{"url": "http://www.heraldsun.com.au/sport/afl/afl-players-laughing-all-the-way-to-the-bank-average-salary-now-265179/story-fni5f22o-1226834339957", "passage_text": "But that is long enough now for a player to collect more than $1 million, along with free tertiary education, a cache of frequent-flier points and valuable off-field connections. The average AFL player salary last season was $265,179 - up $13,620 or 5.4 per cent on the 2012 average. And the divide with the average fan-who is generating the growing pots of gold and adulation for the new generation of AFL players-is deepening while the players’ financial portfolios are growing. The average income of all working Australians last year was, by Australian Bureau of Statistics figures, $57,460. This is less than 25 per cent of the average AFL player salary. The working fan’s pay packet grew by 4.8 per cent, comparable with the AFL player"}, {"url": "http://www.heraldsun.com.au/sport/afl/the-average-wage-for-an-afl-player-will-hit-300000-in-2015/story-fni5f22o-1226878215786", "passage_text": "Outgoing AFL boss Andrew Demetriou. Picture: Getty Source: Getty Images. THE average pay for an AFL player will hit $300,000 next year, with the players to become an early beneficiary of the league’s equalisation measures. A review of the players’ collective bargaining agreement is expected to be completed this month, with the AFLPA, the AFL and club officials all involved in talks"}, {"url": "https://en.wikipedia.org/wiki/AFL_salary_cap", "passage_text": "The AFL Players Association negotiates for players with the AFL on the topic of average salary. 1 In 1998, the West Coast Eagles were fined $100,000 and forfeited their third round pick in the National Draft after an AFL investigation found that they had exceeded the salary cap by a total of $165,000 during the 1997 and 1998 seasons."}, {"url": "https://en.wikipedia.org/wiki/AFL_salary_cap", "passage_text": "In 2014, the AFL and its clubs accepted a luxury tax on football department spending (excluding the salary cap) to take effect in 2015 and an overall revenue tax to take effect by 2017. 1 In 1998, the West Coast Eagles were fined $100,000 and forfeited their third round pick in the National Draft after an AFL investigation found that they had exceeded the salary cap by a total of $165,000 during the 1997 and 1998 seasons."}, {"url": "https://en.wikipedia.org/wiki/AFL_salary_cap", "passage_text": "The cap was set at A$ 1.25 million for 1987–1989 as per VFL agreement, with the salary floor set at 90% of the cap or $1.125 million; the salary floor was increased to 92.5% of the cap in 2001, and to 95% of the cap for 2013 onwards due to increased revenues. 1 In 1998, the West Coast Eagles were fined $100,000 and forfeited their third round pick in the National Draft after an AFL investigation found that they had exceeded the salary cap by a total of $165,000 during the 1997 and 1998 seasons."}, {"url": "https://en.wikipedia.org/wiki/Australian_Football_League", "passage_text": "Salaries of draft selections are fixed for two years. Salaries for senior players are not normally released to the public, though the average AFL player salary at the conclusion of the 2012 season was $251,559 and the top few players can expect to earn up to and above $1,000,000 a year. The Australian Football League (AFL) is the highest-level professional competition in the sport of Australian rules football. Through the AFL Commission, the AFL also serves as the sport's governing body, and is responsible for controlling the Laws of the Game."}, {"url": "http://www.nydailynews.com/sports/football/arena-football-league-players-cry-foul-owners-survive-shutdown-article-1.423904", "passage_text": "AFL salaries are modest, with most players earning between $40,000 and $50,000 per season. The league minimum is $31,000, and the average salary, boosted by the contracts of a handful of franchise players who earn six figures, is $80,000. Most arena athletes hold non-football jobs during the offseason."}, {"url": "http://www.answers.com/Q/What_is_the_average_AFL_player_salary", "passage_text": "The minimum salary for an AFL player is somewhere around $30,000. The league average salary is around $75,000 with top players making in the neighborhood of $200,000 per … year. Answered. What is the average salary for a player in the NBDL? The NBA itself claims that they range from $27,000 to $40,000, but National Public Radio reported that the real figure is $12,000 to $24,000."}, {"url": "http://www.heraldsun.com.au/sport/afl/the-average-wage-for-an-afl-player-will-hit-300000-in-2015/story-fni5f22o-1226878215786", "passage_text": "The average pay for players who have played a senior game was $288,000 in 2013, and $266,000 for all listed players. The players’ share of football department spending is set at $9.6 million per club this year. Picture: Getty Source: Getty Images. THE average pay for an AFL player will hit $300,000 next year, with the players to become an early beneficiary of the league’s equalisation measures."}]