[{"url": "http://www.teenink.com/nonfiction/travel_culture/article/420924/What-is-Ugadi", "passage_text": "Ugadi literally means beginning of an era (Perl). The name comes from two Sanskrit words yuga-which means era, and aadi-which means beginning, so Ugadi is the South Indian Hindu New Year (Perl). It is believed by many Hindus, that Brahma, the Hindu god of creation, created the universe on this day (Perl). It is more or less the same thing as the western New Year’s resolution. One more important custom on Ugadi is to eat the prepared special foods (Perl). If you do not eat the special foods, it means the rest of your year could be unlucky (Perl). On Ugadi day, the rituals and customs start from right when you wake up."}, {"url": "http://www.aryabhatt.com/fast_fair_festival/Festivals/Ugadi.htm", "passage_text": "Thus there is a Telugu New Year's Day, a Tamil New Year's Day, and a New Year's distinct from these in the almanac of North India. According to Chandramana, Ugadi is celebrated on the bright fortnight ('Shukla Paksha') of the first month ('Chaitra Masa') in the first season of the year i.e. Spring ('Vasanta-Ritu'). Also the calculations of the great Indian Mathematician Bhaskaracharya proclaim the Ugadi day as the beginning of the New Year, New month and New day. The onset of spring also marks a beginning of new life with plants acquiring new life, shoots and leaves."}, {"url": "http://www.day-finder.com/ugadi-2015.php", "passage_text": "The term Ugadi stems from the Sanskrit words of “yuga,” meaning age, and “adi,” which means beginning. Together they mean “the beginning of a new age.”. The Ugadi 2015 celebration is the New Year according to the lunisolar calendar and occurs on different days each year. Ugadi, sometimes spelled Yugadi, is the New Year’s Day celebration for the Deccan region of India and is celebrated by the Andhra Pradesh and Larnatak people. The Deccan region consists of the large Deccan Plateau that makes up a majority of the southern part of India"}, {"url": "https://en.wikipedia.org/wiki/Ugadi", "passage_text": "The name Yugadi or Ugadi is derived from the Sanskrit words yuga (age) and ādi (beginning): the beginning of a new age. It falls on a different day every year because the Hindu calendar is a lunisolar calendar. In some parts of India it is known as Vikram Samvat or Bhartiya Nav Varsh. While the people of Andhra Pradesh, and Telangana use the term ఉగాది/Ugadi and Karnataka use the term Yugadi/Ugadi for this festival, the people of Maharashtra term the same festival, observed on the same day, Gudi Padwa (Marathi: गुढी पाडवा)."}, {"url": "https://en.wikipedia.org/wiki/Ugadi", "passage_text": "The word ugadi can be explained as; ' Yuga ' is the word for 'epoch' or 'era', and 'ādi' stands for 'the beginning' in Sanskrit. Yugadi specifically refers to the start of the age we are living in now, Kali Yuga. Kali Yuga started the moment when Lord Krishna left the world. In some parts of India it is known as Vikram Samvat or Bhartiya Nav Varsh. While the people of Andhra Pradesh, and Telangana use the term ఉగాది/Ugadi and Karnataka use the term Yugadi/Ugadi for this festival, the people of Maharashtra term the same festival, observed on the same day, Gudi Padwa (Marathi: गुढी पाडवा)."}, {"url": "http://www.teenink.com/nonfiction/travel_culture/article/420924/What-is-Ugadi", "passage_text": "The Ugadi festival not only celebrates the new year, but it also celebrates the start of spring (What is the Meaning of Ugadi (Telugu New Year)). The day of Ugadi is the first time there is a new moon since the spring equinox (Perl). At the time of Ugadi, plants are just starting to grow and everything is beautiful. It puts a festive mood in the air. Ugadi is also the start of the hot season, which coincides with summer holidays for students (Perl). It is more or less the same thing as the western New Year’s resolution. One more important custom on Ugadi is to eat the prepared special foods (Perl). If you do not eat the special foods, it means the rest of your year could be unlucky (Perl). On Ugadi day, the rituals and customs start from right when you wake up."}, {"url": "http://fullforms.com/Ugadi", "passage_text": "The name Ugadi is derived from the Sanskrit words Yuga (English: age) and Aadi (English: beginning), which means “the beginning of a new age”. "}, {"url": "http://journeymart.com/holidays-ideas/festivals/ugadi-karnataka.aspx", "passage_text": "When: 8th April, 2016. Where: Andhra Pradesh, Karnataka. The festival of Ugadi heralds the start of a New Year in Andhra Pradesh and Karnataka. In both states the festival is locally referred to as Telugu Panchang and Kannada Panchang, respectively. Ugadi comes from two words, 'Yuga' meaning 'era', and 'aadi' means 'the beginning’. People of Maharashtra also observe the same day as ‘ Gudi Padwa ’. Ugadi is believed to be the day when Brahma-the Creator, in the Hindu Trinity-formed the universe. "}, {"url": "https://en.wikipedia.org/wiki/Ugadi", "passage_text": "In Telugu, the greeting is ugadi subhakankshalu -ఉగాది శుభాకాంక్షలు (Greetings for the festival of ugadi) and Nutana samvastara shubhakankshalu -నూతన సంవత్సర శుభాకాంక్షలు (Greetings on the new year). In some parts of India it is known as Vikram Samvat or Bhartiya Nav Varsh. While the people of Andhra Pradesh, and Telangana use the term ఉగాది/Ugadi and Karnataka use the term Yugadi/Ugadi for this festival, the people of Maharashtra term the same festival, observed on the same day, Gudi Padwa (Marathi: गुढी पाडवा)."}]