[{"url": "http://micro.magnet.fsu.edu/optics/olympusmicd/galleries/darkfield/acanthocephalaadultlow.html", "passage_text": "Instead of growing and reproducing in a profitable fashion, pigs and other farm animals expend energy trying to fend off the parasitic infection, feed less, and lose nutrients to the spiny-headed worms and damaged gut linings. Spiny-headed worms are dual-host parasites and there are three classes known. The bodies of the acanthocephalans are long, flattened, and vary in length from 1.5 millimeters to 1 meter, but do not include a digestive tract. Instead of a mouth, anus, and digestive tube, nutrients are taken in via pores and by diffusion, while the excretory system is tied to the sexual reproductive system."}, {"url": "http://micro.magnet.fsu.edu/optics/olympusmicd/galleries/darkfield/acanthocephalaadultlow.html", "passage_text": "The proboscis also acts as the means of locomotion for these internal parasites. The bodies of the acanthocephalans are long, flattened, and vary in length from 1.5 millimeters to 1 meter, but do not include a digestive tract. Instead of a mouth, anus, and digestive tube, nutrients are taken in via pores and by diffusion, while the excretory system is tied to the sexual reproductive system."}, {"url": "http://micro.magnet.fsu.edu/optics/olympusmicd/galleries/darkfield/acanthocephalaadultlow.html", "passage_text": "Members of the phylum Acanthocephala are entirely endoparasitic, but when compared to other invertebrate parasites such as the roundworms (phylum Nematoda) and tapeworms (phylum Platyhelminthes, class Cestoda), they are relatively rare. The bodies of the acanthocephalans are long, flattened, and vary in length from 1.5 millimeters to 1 meter, but do not include a digestive tract. Instead of a mouth, anus, and digestive tube, nutrients are taken in via pores and by diffusion, while the excretory system is tied to the sexual reproductive system."}, {"url": "http://www.thefreedictionary.com/parasite", "passage_text": "1. (Biology) an animal or plant that lives in or on another (the host) from which it obtains nourishment. The host does not benefit from the association and is often harmed by it. 2. a person who habitually lives at the expense of others; sponger. 3. (formerly) a sycophant. Noun. 1. parasite-an animal or plant that lives in or on a host (another animal or plant); it obtains nourishment from the host without benefiting or killing the host."}, {"url": "http://micro.magnet.fsu.edu/optics/olympusmicd/galleries/darkfield/acanthocephalaadultlow.html", "passage_text": "A thin cuticle of mucopolysaccharides and a noncellular cuticle cover the body walls of these endoparasites, protecting them from the digestive juices and immune systems of the hosts. Economic impacts associated with spiny-headed worms result from severe discomfort and illness in parasitized domestic livestock. The bodies of the acanthocephalans are long, flattened, and vary in length from 1.5 millimeters to 1 meter, but do not include a digestive tract. Instead of a mouth, anus, and digestive tube, nutrients are taken in via pores and by diffusion, while the excretory system is tied to the sexual reproductive system."}, {"url": "http://www.faculty.ucr.edu/~legneref/invertebrate/rotifera.htm", "passage_text": "The Phylum: Rotifera derives its name from Bearing a wheel or Wheel animacules.. There is a prominent circular array of cilia at the anterior end of the animal that looks like a rotating wheel. This is known as the Trochal disc or Corona. Rotifers occur primarily in freshwater and all are microscopic. -- There are two kinds of locomotion: (1) ciliary activity on the corona and (2) crawling on vegetation by making particular use of the foot. Pedal glands secrete adhesive material, which comes out on the foot. It can thus adhere to surfaces. The movement is of inch-worm type."}, {"url": "http://waynesword.palomar.edu/trnov01.htm", "passage_text": "In a cross sectional view, animal embryos are composed of an outer layer called ectoderm, a middle layer or mesoderm, and an internal layer or endoderm that surrounds the digestive cavity. Multicellular animals are heterotrophic by ingestion of food into a body cavity (coelom) that is completely lined by the mesoderm. Primitive phyla without a true coelom include the Porifera and Coelenterata (Cnidaria). Animal phyla are classified according to certain criteria, including the type of coelom, symmetry, body plan, and presence of segmentation. Phyla with a true coelom and digestive system are divided into two groups, the protostomes and the deuterostomes. As the hollow sphere of cells known as a blastula develops, an invagination produces an opening called the blastopore."}, {"url": "https://en.wikibooks.org/wiki/General_Biology/Classification_of_Living_Things/Eukaryotes/Animals/Phyla", "passage_text": "Animals in this phyla have no true tissues, which means, for example, that they have no nervous system or sense organs. Although sponges are multicellular, they are described as being essentially at a cellular level of organization. They are sessile as adults, but have a free swimming larva. Name means the chordates, i.e., these animals have a notochord at some stage in their lifecycle. This phylum consists of tunicates, lancelets, and the vertebrates. There are four major features that characterize the phylum Chordata."}, {"url": "https://en.wikipedia.org/wiki/Flatworm", "passage_text": "The flatworms, or Platyhelminthes, Plathelminthes, or platyhelminths (from the Greek πλατύ, platy, meaning flat and ἕλμινς (root: ἑλμινθ-), helminth- , meaning worm) are a phylum of relatively simple bilaterian, unsegmented, soft-bodied invertebrates. Over half of all known flatworm species are parasitic, and some do enormous harm to humans and their livestock. Schistosomiasis, caused by one genus of trematodes, is the second-most devastating of all human diseases caused by parasites, surpassed only by malaria."}, {"url": "http://www.ucmp.berkeley.edu/phyla/rotifera/rotifera.html", "passage_text": "The name rotifer is derived from the Latin word meaning wheel-bearer; this makes reference to the crown of cilia around the mouth of the rotifer. The rapid movement of the cilia in some species makes them appear to whirl like a wheel. At left, you can see a photomicrograph identifying basic anatomical features of Epiphanes brachionus. The general body plan of a rotifer consists of four basic regions: head, neck, trunk (body), and the foot."}]