[{"url": "http://dogcare.dailypuppy.com/old-can-puppy-bath-2574.html", "passage_text": "Puppies shouldn't be bathed using most dog shampoos until they're 12 weeks old, but dog shampoos differ, much as human shampoos do. For example, if your puppy got into something stinky, you can use a deodorizing shampoo. Putting a puppy in some warm, shallow water for a shampoo-less bath can be beneficial to both her and you. Breeds that require a lot of grooming will benefit from getting used to bath time at a young age. In fact, a puppy's early introduction to a bath can also benefit you, no matter what breed she is."}, {"url": "http://www.dogster.com/answers/question/bloody_stool_i_am_worried-186", "passage_text": "Wait until around 2 months to give a full bath, and even then it should only be done if absolutely necessary, not just to make them smell better (use dog wipes for that). If the pup is extremely dirty, try a sponge bath before a full-blown bath. The issue is mainly keeping the puppy warm, which is really important. A puppy shouldn't have a bath unless he is really, really dirty until he's at least 3 months old. Then, look for tearless formula puppy shampoo and make sure you keep the puppy warm and very dry afterwards. Basically, you should wash and care for a bathed puppy in the same manner as bathing a newborn."}, {"url": "http://dogcare.dailypuppy.com/old-can-puppy-bath-2574.html", "passage_text": "In general, puppies don't need to be bathed unless they're visibly dirty or smelly. Puppies -- and older dogs -- need the natural oils in their fur to keep their coats and skin healthy. Most dog shampoos are for dogs around 3 months old or older, but you can still bathe younger puppies if need be. Putting a puppy in some warm, shallow water for a shampoo-less bath can be beneficial to both her and you. Breeds that require a lot of grooming will benefit from getting used to bath time at a young age. In fact, a puppy's early introduction to a bath can also benefit you, no matter what breed she is."}, {"url": "http://www.doggiebowties.com/DoggieBowTiesShihTzuPuppyBath.htm", "passage_text": "If your new puppy arrives clean and freshly bathed, you will probably not need to give him a bath for a couple of weeks or until he is about 12 weeks old. 1  A Shih Tzu that is cut down with short hair bathe every 10 days to 2 weeks. 2  A Shih Tzu with long hair bathe weekly. Most likely your new Shih Tzu puppy will already have had its first bath from the breeder before you get him at anywhere between 8 weeks and"}, {"url": "http://www.k9puppydogs.com/html/puppy_first_bath.htm", "passage_text": "Puppies generally do not need to get bathed until they are five months old since they get their vaccinations during these first five months of their lives and during this time their bodies are more sensitive to catching a cold. It's always best to take all the necessary precautions just to be sure. When your puppy finally takes his first bath, make sure to find a nice warm spot to it in and use the appropriate dog shampoo. Puppies and dogs don't need to get bathed very often in order to stay clean."}, {"url": "https://answers.yahoo.com/question/index?qid=20090726133501AAECK3m", "passage_text": "Best Answer: Puppies can be pretty young (8-10 weeks) to get their first bath. But make sure you do it VERY slowly and that you have plenty of towels and it's not too cold so you can keep your puppy warm as you dry her off. Also puppies should be bathed every week or every 2 weeks. Asker's rating. Report Abuse. Puppies can be pretty young (8-10 weeks) to get their first bath. But make sure you do it VERY slowly and that you have plenty of towels and it's not too cold so you can keep your puppy warm as you dry her off."}]