[{"url": "http://www.ivyroses.com/HumanBody/Urinary/Urinary_System_Nephron_Diagram.php", "passage_text": "Helped by the increased pressure in the glomerular capillaries, a filtration process occurs in which some blood fluid is forced out of the glomerulus and into the capsular space of the Bowman's Capsule. The fluid that is filtered into the Bowman's Capsule is called the glomerular filtrate. The renal tubule is the part of the kidney nephron into which the glomerular filtrate passes after it has reached the Bowman's capsule. The first part of the renal tubule is called the proximal convoluted tubule (PCT), which is shown on the right-hand side of the diagram above."}, {"url": "https://en.wikipedia.org/wiki/Glomerulus_(kidney)", "passage_text": "The glomerulus is a tuft of small blood vessels called capillaries located within Bowman's capsule within the kidney. Between the capillaries and Bowman's capsule lies mesangium. Glomerulus (kidney). From Wikipedia, the free encyclopedia. A glomerulus is a network (as a tuft) of capillaries located at the beginning of a nephron in the kidney. It serves as the first stage in the filtering process of the blood carried out by the nephron in its formation of urine."}, {"url": "https://en.wikipedia.org/wiki/Bowman%27s_capsule", "passage_text": "Bowman's capsule (or the Bowman capsule, capsula glomeruli, or glomerular capsule) is a cup-like sac at the beginning of the tubular component of a nephron in the mammalian kidney that performs the first step in the filtration of blood to form urine. A glomerulus is enclosed in the sac. Fluids from blood in the glomerulus are collected in the Bowman's capsule (i.e., glomerular filtrate) and further processed along the nephron to form urine. This process is known as ultrafiltration."}, {"url": "http://www.innerbody.com/image_card08/card65-new.html", "passage_text": "The renal tubule ... Click to read more below. The Bowman's capsule is an expansion at the closed end of a renal tubule. A kidney's renal corpuscle is composed of tangled clusters of blood capillaries, called a glomerulus, and a thin-walled, saclike structure called the Bowman's capsule, which surrounds the glomerulus. "}, {"url": "https://answers.yahoo.com/question/index?qid=20090716183345AAzxedW", "passage_text": "4.Bowman's Capsule The filtrate produced in the glomerulus is collected in a bulblike start to the nephron called the glomerular capsule or Bowman's capsule (named for British surgeon Sir William Bowman). Each nephron is composed of an initial filtering component and a tubule specialized for reabsorption and secretion. Composed of a glomerulus and Bowman's capsule, the renal corpuscle is the beginning of the nephron."}, {"url": "https://en.wikipedia.org/wiki/Glomerulus_(kidney)", "passage_text": "The blood plasma is filtered through the capillaries of the glomerulus into the capsule. The Bowman's capsule empties the filtrate into the proximal tubule that is also part of the nephron. A glomerulus receives its blood supply from an afferent arteriole of the renal circulation. Glomerulus (kidney). From Wikipedia, the free encyclopedia. A glomerulus is a network (as a tuft) of capillaries located at the beginning of a nephron in the kidney. It serves as the first stage in the filtering process of the blood carried out by the nephron in its formation of urine."}, {"url": "http://www.healthhype.com/nephron-glomerulus-and-tubule-structure-diagram-functions.html", "passage_text": "It has two parts, namely the network of capillaries that transport the blood to the site (glomerular capillaries) and the enlarged head of the nephron which collects the filtered fluid (Bowman’s capsule). This part of the nephron lies in the renal cortex. 1 Bowman’s capsule. 2  Collects the incoming fluid from the glomerular capillaries. 3  Proximal tubule. 4  Sodium, chloride, water, glucose and amino acids are reabsorbed (removed from the tubules). 5  Organic acids and bases like bile salts, oxalate and urate are secreted into the p"}, {"url": "http://www.answers.com/Q/Structure_that_surrounds_glomerulus_and_collects_filtrate", "passage_text": "The glomerulus is a cluster of capillaries that can be found in the kidney. Each cluster is next to a Bowman's capsule, which is the filter unit of the nephron. Blood passes … from the renal artery into the glomerulus at high pressure, allowing small substances to diffuse into the nephron, via the Bowman's capsule. 4 people found this useful. Answered. The glomerulus is surrounded in the kidneys by a structure called 'the Bowman's capsule'. This is where the various substances from the blood pass into-a process called filt … ration."}]