[{"url": "http://www.healthgrades.com/symptoms/bladder-pain--causes", "passage_text": "Bladder pain may be the result of multiple factors, including infection, disease or injury to the bladder. Symptoms may arise if you experience problems with normal bladder function, such as difficulty urinating, increased frequency of urination, or painful urination. Bladder pain can involve other regions of the body if it is caused by cancers, endometriosis, or bowel disorders. These conditions can lead to bladder damage, and their symptoms may include bloody urine, fever, or pain in the lower back, abdomen or side. Bladder pain that is associated with a serious medical condition, such as cancer, may have long-term and even life-threatening complications. Further, bladder pain that is associated with an acute bladder infection could lead to a more serious complication, such as widespread infection."}, {"url": "http://www.medicinenet.com/bladder_spasms/page2.htm", "passage_text": "1 Urinary tract infection (UTI): Bladder pain and burning are a common symptom of a UTI. 2  Interstitial cystitis (IC), also called painful bladder syndrome: This condition refers to bladder and urinary pain that is not due to other causes, such as a urinary tract infection. 3  Pain is recurring and often severe. Some common causes of bladder spasms are: 1  Urinary tract infection (UTI): Bladder pain and burning are a common symptom of a UTI. 2  Interstitial cystitis (IC), also called painful bladder syndrome: This condition refers to bladder and urinary pain that is not due to other causes, such as a urinary tract infection."}, {"url": "http://www.urologyhealth.org/urologic-conditions/interstitial-cystitis", "passage_text": "It is a feeling of pain and pressure in the bladder area. Along with this pain are lower urinary tract symptoms which have lasted for more than 6 weeks, without having an infection or other clear causes. Symptoms range from mild to severe. "}, {"url": "http://www.wisegeek.org/what-causes-bladder-pain.htm", "passage_text": "Bladder pain may be caused by a number of conditions, including a urinary tract infection. A urine sample can be used to detect a bladder infection. Several forms of cancer may result in pain in the bladder. Pain is a common symptom of bladder tumor growths. The human urinary tract, including the bladder in pink at the bottom. Patients recovering from a urinary tract infection should drink plenty of water. A more common cause of bladder pain is urinary tract infection (UTI), which can also produce changes in urine color, difficulty urinating, and a feeling of fullness"}, {"url": "http://www.healthgrades.com/symptoms/bladder-pain", "passage_text": "In other cases, bladder pain may come from a chronic underlying disease, such as cancer, endometriosis, and bowel disorders. Malignant tumors can cause bladder pain, as well as pain with urination, abdominal pain, and bloody urine. Interstitial cystitis is a poorly understood bladder abnormality that is related to the central nervous system’s ability to regulate the bladder. It causes bladder pain that may also be accompanied by pain in the genitals, pelvis and anal region."}, {"url": "http://www.webmd.com/pain-management/bladder-pain", "passage_text": "In this article. The bladder is the hollow organ in the lower abdomen that stores urine. As the bladder fills, muscles in its walls relax so that it can expand. As the bladder empties during urination, the muscles contract to squeeze the urine out through the urethra. Several different bladder problems can cause pain. The three most common causes of bladder pain are interstitial cystitis, urinary tract infection, and bladder cancer. "}, {"url": "http://www.healthgrades.com/symptoms/bladder-pain", "passage_text": "Bladder pain can result from inflammation, infection, damage or injury to the bladder. The symptoms may be constant or variable and may improve or worsen with movement. The pain may be described as sharp, dull, stabbing, burning or throbbing, and can range in intensity from mild to severe. Interstitial cystitis is a poorly understood bladder abnormality that is related to the central nervous system’s ability to regulate the bladder. It causes bladder pain that may also be accompanied by pain in the genitals, pelvis and anal region."}, {"url": "http://www.wisegeek.org/what-causes-bladder-pain.htm", "passage_text": "In that case, it could be a urinary tract infection, which is often associated with burning and bladder pain. Other possible causes of burning and bladder pain are bladder cysts, or a reaction from a catheter. A more common cause of bladder pain is urinary tract infection (UTI), which can also produce changes in urine color, difficulty urinating, and a feeling of fullness in the bladder."}, {"url": "http://www.healthgrades.com/symptoms/bladder-pain", "passage_text": "There are many potential causes of bladder pain. Urinary tract infection and interstitial cystitis are among the most common. Interstitial cystitis is a poorly understood bladder abnormality that is related to the central nervous system’s ability to regulate the bladder. It causes bladder pain that may also be accompanied by pain in the genitals, pelvis and anal region. Urinary tract infection is a cause of bladder pain that is typically accompanied by pain with urination, increased urinary frequency, or urgency (pressing need to urinate)"}]