[{"url": "http://www.merriam-webster.com/dictionary/peripheral%20neuropathy", "passage_text": "Definition of PERIPHERAL NEUROPATHY. : a disease or degenerative state of the peripheral nerves in which motor, sensory, or vasomotor nerve fibers may be affected and which is marked by muscle weakness and atrophy, pain, and numbness. ADVERTISEMENT"}, {"url": "http://medical-dictionary.thefreedictionary.com/Peripheral+nerve", "passage_text": "sensory nerve a peripheral nerve that conducts impulses from a sense organ to the spinal cord or brain. See also neuron. somatic n's the sensory and motor nerves supplying skeletal muscle and somatic tissues. gangliated nerve any nerve of the sympathetic nervous system. inhibitory nerve one that transmits impulses resulting in a decrease in functional activity. medullated nerve myelinated nerve. mixed nerve (nerve of mixed fibers) a nerve composed of both sensory (afferent) and motor (efferent) fibers."}, {"url": "http://www.merriam-webster.com/dictionary/peripheral%20neuropathy", "passage_text": "Medical Definition of PERIPHERAL NEUROPATHY. : a disease or degenerative state (as polyneuropathy) of the peripheral nerves in which motor, sensory, or vasomotor nerve fibers may be affected and which is marked by muscle weakness and atrophy, pain, and numbness. : a disease or degenerative state"}, {"url": "http://www.merriam-webster.com/dictionary/peripheral%20nervous%20system", "passage_text": "noun. : the part of the nervous system that is outside the central nervous system and comprises the cranial nerves excepting the optic nerve, the spinal nerves, and the autonomic nervous system. Britannica English: Translation of peripheral nervous system for Arabic speakers. : the part of the nervous system that is outside the central nervous system and comprises the cranial nerves excepting the optic nerve, the spinal nerves, and the autonomic nervous system. See peripheral nervous system defined for kids. ADVERTISEMENT."}, {"url": "http://www.medicinenet.com/script/main/art.asp?articlekey=4838", "passage_text": "Peripheral neuropathy: A problem with the functioning of the nerves outside the spinal cord. Symptoms of peripheral neuropathy may include numbness, weakness, burning pain (especially at night), and loss of reflexes. "}, {"url": "http://www.medicinenet.com/script/main/art.asp?articlekey=8258", "passage_text": "Peripheral nervous system: The portion of the nervous system that is outside the brain and spinal cord. Abbreviated PNS. The nerves in the PNS connect the central nervous system (CNS) to sensory organs, such as the eye and ear, and to other organs of the body, muscles, blood vessels, and glands. The peripheral nerves include the 12 cranial nerves, the spinal nerves and roots, and the autonomic nerves. "}, {"url": "https://en.wikipedia.org/wiki/Neuropathy", "passage_text": "Peripheral neuropathy (PN) is damage to or disease affecting nerves, which may impair sensation, movement, gland or organ function, or other aspects of health, depending on the type of nerve affected. "}, {"url": "http://www.merriam-webster.com/dictionary/peripheral%20nervous%20system", "passage_text": "Definition of PERIPHERAL NERVOUS SYSTEM. : the part of the nervous system that is outside the central nervous system and comprises the cranial nerves excepting the optic nerve, the spinal nerves, and the autonomic nervous system. Britannica English: Translation of peripheral nervous system for Arabic speakers. : the part of the nervous system that is outside the central nervous system and comprises the cranial nerves excepting the optic nerve, the spinal nerves, and the autonomic nervous system. See peripheral nervous system defined for kids. ADVERTISEMENT."}, {"url": "http://medical-dictionary.thefreedictionary.com/Peripheral+neuropathy", "passage_text": "The term peripheral neuropathy encompasses a wide range of disorders in which the nerves outside of the brain and spinal cord—peripheral nerves—have been damaged. Peripheral neuropathy may also be referred to as peripheral neuritis, or if many nerves are involved, the terms polyneuropathy or polyneuritis may be used. Peripheral nervous system (PNS) — Nerves that are outside of the brain and spinal cord. Sensory — Refers to peripheral nerves that transmit information from the senses to the brain. A few peripheral neuropathies are eventually fatal. Fatalities have been associated with some cases of diphtheria, botulism, and others."}, {"url": "http://www.webmd.com/brain/understanding-peripheral-neuropathy-basics", "passage_text": "Peripheral: Beyond (in this case, beyond the brain and the spinal cord.). Neuro-: Related to the nerves. -pathy: Disease. Peripheral neuropathy refers to the conditions that result when nerves that carry messages to and from the brain and spinal cord from and to the rest of the body are damaged or diseased. The peripheral nerves make up an intricate network that connects the brain and spinal cord to the muscles, skin, and internal organs."}]