[{"url": "http://misc.medscape.com/pi/android/medscapeapp/html/A125764-business.html", "passage_text": "Overview. Thyroxine-binding globulin (TBG) deficiency is a nonharmful condition that is either acquired or inherited. The only known complications associated with TBG deficiency are those stemming from the primary disorders that cause the acquired form of this condition. The most important aspect of dealing with thyroxine-binding globulin (TBG) deficiency is to recognize and correctly diagnose this condition in order to avoid unnecessary treatment for a mistaken diagnosis of hypothyroidism."}, {"url": "http://www.mayomedicallaboratories.com/interpretive-guide/?alpha=T&unit_code=9263", "passage_text": "Thyroxine binding globulin (TBG) is the high-affinity serum binding protein for thyroxine and triiodothyronine. Normally, the thyroid adjusts to changing concentrations of TBG by producing more or less thyroid hormone to maintain a constant level of metabolically important free hormone. "}, {"url": "http://ghr.nlm.nih.gov/condition/inherited-thyroxine-binding-globulin-deficiency", "passage_text": "Inherited thyroxine-binding globulin deficiency is a genetic condition that typically does not cause any health problems. Thyroxine-binding globulin is a protein that carries hormones made or used by the thyroid gland, which is a butterfly-shaped tissue in the lower neck. Thyroid hormones play an important role in regulating growth, brain development, and the rate of chemical reactions in the body (metabolism). Inherited thyroxine-binding globulin deficiency results from mutations in the SERPINA7 gene. This gene provides instructions for making thyroxine-binding globulin. Some mutations in the SERPINA7 gene prevent the production of a functional protein, causing TBG-CD."}, {"url": "http://ghr.nlm.nih.gov/condition/inherited-thyroxine-binding-globulin-deficiency", "passage_text": "Although inherited thyroxine-binding globulin deficiency does not cause any health problems, it can be mistaken for more serious thyroid disorders (such as hypothyroidism). Therefore, it is important to diagnose inherited thyroxine-binding globulin deficiency to avoid unnecessary treatments. Inherited thyroxine-binding globulin deficiency results from mutations in the SERPINA7 gene. This gene provides instructions for making thyroxine-binding globulin. Some mutations in the SERPINA7 gene prevent the production of a functional protein, causing TBG-CD."}, {"url": "http://www.ncbi.nlm.nih.gov/gtr/conditions/C1839141/", "passage_text": "Summary. Inherited thyroxine-binding globulin deficiency is a genetic condition that typically does not cause any health problems. Thyroxine-binding globulin is a protein that carries hormones made or used by the thyroid gland, which is a butterfly-shaped tissue in the lower neck. Thyroid hormones play an important role in regulating growth, brain development, and the rate of chemical reactions in the body (metabolism)"}, {"url": "http://medical-dictionary.thefreedictionary.com/thyroxine-binding+globulin", "passage_text": "thyroxine-binding globulin (TBG), a plasma protein that binds with and transports thyroxine in the blood. A gene on chromosome Xq22.2 that encodes thyroxine-binding globulin (TBG), the major thyroid hormone transport protein, which is genomically—but not functionally—related to the serpin family. thyronine-binding globulin (TBG) (thyroxine-binding globulin) an acidic glycoprotein that is the main binding protein in the blood for thyroxine, and less firmly for triiodothyronine."}, {"url": "http://emedicine.medscape.com/article/125764-overview", "passage_text": "Thyroxine-binding globulin (TBG) deficiency is a nonharmful condition that is either acquired or inherited. The only known complications associated with TBG deficiency are those stemming from the primary disorders that cause the acquired form of this condition. Thyroxine-binding globulin (TBG) is a 395–amino acid, 54kd polypeptide that is synthesized in the liver and encoded by a single gene copy. The gene locus in humans is on chromosome band Xq22."}, {"url": "https://en.wikipedia.org/wiki/Thyroxine-binding_globulin", "passage_text": "Thyroxine-binding globulin (TBG) binds thyroid hormone in circulation. It is one of three proteins (along with transthyretin and albumin) responsible for carrying the thyroid hormones thyroxine (T4) and 3,5,3’-triiodothyronine (T3) in the bloodstream. Of these three proteins, TBG has the highest affinity for T4 and T3, but is present in the lowest concentration."}, {"url": "http://emedicine.medscape.com/article/2089554-overview", "passage_text": "Reference Range. Thyroid-binding globulin (TBG) is produced in the liver and is a circulating protein that reversibly binds thyroid hormones3,5,3’-triiodothyronine (T3) and thyroxine (T4) and carries them in the bloodstream. The reference range for TBG is 1.1-2.1mg/dL. Description. Thyroid-binding globulin (TBG) is produced in the liver and is a circulating protein that reversibly binds thyroid hormones3,5,3’-triiodothyronine (T3) and thyroxine (T4) and carries them in the bloodstream."}]