[{"url": "http://www.answers.com/Q/Why_is_the_atacama_desert_the_driest_place_on_earth", "passage_text": "The next driest place is the Atacama desert in Chile. In some areas, no rain has fallen there for 400 years and its average annual rainfall is a tiny 0.1 mm (0.004 inches). Antarctica is the coldest, highest and driest continent on the  planet, it also occupies 10% o … f the earth's surface.   The dry valley region in Antarctica is one of the driest places on  earth. The Attacama Desert is recognized as the driest place"}, {"url": "http://www.answers.com/Q/Why_is_the_atacama_desert_the_driest_place_on_earth", "passage_text": "The driest deserts on earth are Antarctica and the Atacama Desert  in South America. The driest place on earth is either the Atacama Desert of South  America or Antarctica. … Scientists vary in opinion. Antarctica is the coldest, highest and driest continent on the  planet, it also occupies 10% o … f the earth's surface.   The dry valley region in Antarctica is one of the driest places on  earth. The Attacama Desert is recognized as the driest place"}, {"url": "http://www.almaobservatory.org/en/about-alma/location/atacama", "passage_text": "One of the driest places on Earth ! The Atacama Desert is considered as one of the driest places on Earth. Covering an area of 181,300 square kilometers, the Atacama desert is enclosed to the East by the main chain of the Andes, while to the West lies a secondary mountain range of the Andes called Cordillera de Domeyko. "}, {"url": "http://www.astrobio.net/topic/origins/extreme-life/driest-place-on-earth-hosts-life/", "passage_text": "Researchers have pinpointed the driest location on Earth in the Atacama Desert, a region in Chile already recognised as the most arid in the world. They have also found evidence of life at the site, a discovery that could have far-reaching implications for the search for life on Mars. "}, {"url": "http://news.softpedia.com/news/The-Driest-Place-on-Earth-Atacama-Desert-55456.shtml", "passage_text": "In some spots it has not been raining for at least 500 years! The Atacama Desert is located in northern Chile and reaches a small part of southern Peru (South America), climbing up to 3,200 m (10,670 ft) altitude on an area of 181,300 square km (72,500 square mi). "}, {"url": "http://www.windows2universe.org/earth/atacama_desert.html", "passage_text": "Atacama Desert. The Atacama Desert is one of the driest places on Earth. The Atacama is in the country of Chile in South America. In an average year, much of this desert gets less than 1 millimeter (0.04 inch) of rain! That makes it 50 times drier than Death Valley in California. It is hard to survive in the Atacama Desert. Few people, animals, plants, or even microbes live there."}, {"url": "https://en.wikipedia.org/wiki/Atacama_Desert", "passage_text": "The Atacama Desert is commonly known as the driest non-polar place in the world, especially the surroundings of the abandoned Yungay town (in Antofagasta Region, Chile). According to estimates the Atacama Desert proper occupies 105,000 square kilometres (41,000 sq mi), or 128,000 square kilometres (49,000 sq mi) if the barren lower slopes of the Andes are included. Most of the desert is composed of stony terrain, salt lakes (salares), sand, and felsic lava that flows towards the Andes."}, {"url": "http://www.astrobio.net/topic/origins/extreme-life/the-driest-place-on-earth/", "passage_text": "The Atacama desert is one of the driest places on Earth. Scientists are searching for traces of microorganisms in this extreme environment. Credit: Carnegie Mellon University. In Northern Chile, a pick-up truck bumps along dusty old mining roads toward the Atacama Desert. Water is necessary for life, but water is so scarce in the Atacama that it is a wonder anything can live there at all. Some parts of the desert have not seen rain for centuries. The desert itself is thought to be between 10 to 15 million years old, making it the oldest desert on Earth."}, {"url": "https://en.wikipedia.org/wiki/Atacama_Desert", "passage_text": "The Atacama Desert (Spanish: Desierto de Atacama) is a plateau in South America, covering a 1,000-kilometre (600 mi) strip of land on the Pacific coast, west of the Andes mountains. It is the driest non-polar desert in the world. According to estimates the Atacama Desert proper occupies 105,000 square kilometres (41,000 sq mi), or 128,000 square kilometres (49,000 sq mi) if the barren lower slopes of the Andes are included. Most of the desert is composed of stony terrain, salt lakes (salares), sand, and felsic lava that flows towards the Andes."}, {"url": "http://www.extremescience.com/driest.htm", "passage_text": "Even the Driest Place on Earth has Water. These incredibly dry mountains see an average of less than .004 inches/.01cm of rain per year. Many times this area will go without rainfall at all for years. Some places in the Atacama Desert have not had rainfall for over 400 years. The Atacama desert is found along the coast of Chile, South America-right next to the Pacific Ocean-the biggest body of water in the world. "}]