[{"url": "http://grammar.about.com/od/tz/g/Word-Formation.htm", "passage_text": "Definition. In linguistics (particularly morphology), word formation refers to the ways in which new words are made on the basis of other words or morphemes. Also called derivational morphology. Word-formation can denote either a state or a process, and it can be viewed either diachronically or synchronically. 1 Cambridge University Press, 2003). 2  Processes of Word-Formation.  3 Apart from the processes that attach something to a base (affixation) and processes that do not alter the base (conversion), there are processes involving the deletion of material. . .."}, {"url": "http://encyclopedia2.thefreedictionary.com/Word+formation", "passage_text": "(1) The process or result of forming new words, called derived words, from words or word groups with the same root. Word formation occurs through formal means established within a given language that give a new or more precise meaning to the original elements. Word formation studies the alignment of derived words in series and families, as well as derivational meanings and categories. It establishes the structural and organizational principles of the derivational system as a whole. Word formation is distinct from inflection and the derivation of word form"}, {"url": "https://en.wikipedia.org/wiki/Word_formation", "passage_text": "1 Clipping: Also known as truncation or shortening, clipping is the word formation process which consists in the reduction of a word to one of its parts, e.g. fax (facsimile), flu (influenza) and bot (robot). 2  Clipped words may not retain their original meaning. A blend is a word formed by joining parts of two or more older words. An example is smog, which comes from smoke and fog, or brunch, which comes from 'breakfast' and 'lunch'. Sub-categories of blending are:"}, {"url": "http://www.departments.bucknell.edu/linguistics/lectures/05lect10.html", "passage_text": "Linguistics 105 * Words and Sounds Lecture Number Ten Word Formation: Lexical Derivation Competence and Performance Language versus Language Use. In addition to the rules of grammar, there are rules for using grammar. We use rules of grammar to form the Imperative Mood, Passive Voice, and relative clauses. "}, {"url": "http://www.brighthubeducation.com/esl-lesson-plans/59679-forming-new-words-compounds-clipping-and-blends/", "passage_text": "Compounding is the word formation process in which two or more lexemes combine into a single new word. Compound words may be written as one word or as two words joined with a hyphen. For example: 1  noun-noun compound: note + book → notebook. 2  adjective-noun compound: blue + berry → blueberry. Clipping is the word formation process in which a word is reduced or shortened without changing the meaning of the word. Clipping differs from back-formation in that the new word retains the meaning of the original word. For example: 1  advertisement – ad. 2  alligator – gator. 3  examination – exam."}, {"url": "https://en.wikipedia.org/wiki/Word_formation", "passage_text": "Word formation is sometimes contrasted with semantic change, which is a change in a single word's meaning. The boundary between word formation and semantic change can be difficult to define: a new use of an old word can be seen as a new word derived from an old one and identical to it in form (see conversion). A blend is a word formed by joining parts of two or more older words. An example is smog, which comes from smoke and fog, or brunch, which comes from 'breakfast' and 'lunch'. Sub-categories of blending are:"}, {"url": "http://encyclopedia2.thefreedictionary.com/Word+formation", "passage_text": "Word formation is a means of deriving (generating) linguistic units in order to create a new one-word name having a semantic and formal connection with the original unit. It is an important means of supplementing vocabulary and forming specialized terms. (2) The study of “how words are made” (L. Word formation studies the alignment of derived words in series and families, as well as derivational meanings and categories. It establishes the structural and organizational principles of the derivational system as a whole. Word formation is distinct from inflection and the derivation of word forms"}]