[{"url": "http://www.differencebetween.com/difference-between-cpvc-and-vs-pvc/", "passage_text": "by olivia. CPVC vs PVC. Most of us are aware of PVC, which is a widely used plumbing material in construction and drainage. It stands for Polyvinyl chloride, and is one thermoplastic polymer that is abundantly used all over the world for plumbing purposes. Essentially, CPVC is nothing but PVC that has been subjected to a process known as chlorination. This chlorination takes place through a chemical reaction called free radical chlorination that makes use of thermal or UV energy."}, {"url": "https://en.wikipedia.org/wiki/Chlorinated_polyvinyl_chloride", "passage_text": "Chlorinated polyvinyl chloride (CPVC) is PVC (polyvinyl chloride) that has been chlorinated via a free radical chlorination reaction. This reaction is typically initiated by application of thermal or UV energy utilizing various approaches. CPVC shares most of the features and properties of PVC. It is also readily workable, including machining, welding, and forming. Because of its excellent corrosion resistance at elevated temperatures, CPVC is ideally suited for self-supporting constructions where temperatures up to 200 °F (90 °C) are present."}, {"url": "http://www.wisegeek.org/what-is-cpvc-pipe.htm", "passage_text": "Chlorinated polyvinyl chloride pipe, more commonly known as “CPVC pipe,” is a plumbing material made of highly durable thermopastic. When it dries, apply cpvc glue to either end of the pipe and inside the new elbow, enough for coverage, but not excessive. Finally, replace the new elbow and wiggle/roll the fitting/pipes to ensure a good seal and fit."}, {"url": "http://www.ppfahome.org/cpvc/index.aspx", "passage_text": "GENERAL. Chlorinated Poly (Vinyl Chloride) (CPVC) is a thermoplastic pipe and fitting material made with CPVC compounds meeting the requirements of ASTM Class 23447 as defined in ASTM Specification D1784. "}, {"url": "http://www.commercial-industrial-supply.com/resource-center/whats-the-difference-between-pvc-and-cpvc-pipe/", "passage_text": "You can think of CPVC as PVC’s cousin. They are similar in many ways, but they shouldn't be used interchangeably. Both are made of the same basic elements with one distinguishing factor. CPVC is altered by a free radical chlorination reaction that effectively increases the chlorine content of the material. Before purchasing CPVC be aware of what your use will be, and what sizing system you require. Color can be a clue, too. Often CTS CPVC is an off-white or yellowish color, while schedule 80 CPVC (NPS) is a light gray color. PVC pipe and fittings usually comes in white or dark gray."}, {"url": "http://www.commercial-industrial-supply.com/resource-center/whats-the-difference-between-pvc-and-cpvc-pipe/", "passage_text": "No, CPVC and Schedule 80 PVC are different. Schedule 80 just refers to the thickness of the PVC pipe, and you can have schedule 80 CPVC as well. CPVC differs from PVC in chemical makeup and in how it should be used. For instance, CPVC can withstand temperatures of up to 200 degrees F while PVC is best used for temperatures below about 140F. Before purchasing CPVC be aware of what your use will be, and what sizing system you require. Color can be a clue, too. Often CTS CPVC is an off-white or yellowish color, while schedule 80 CPVC (NPS) is a light gray color. PVC pipe and fittings usually comes in white or dark gray."}, {"url": "http://www.ehow.com/about_6667763_difference-between-pvc-cpvc-pipe_.html", "passage_text": "Uses of CPVC. CPVC has similar uses as PVC. However, because of the chlorinating process, CPVC is able to withstand higher pressures and temperatures. CPVC has an upper temperature tolerance of 180 degrees, so it can be used for hot water pipes. PVC. PVC stands for polyvinyl chloride. This type of pipe is less expensive than other types, resists cracking and isn't affected by acids. It is manufactured in white, gray and clear, and can be rigid or flexible."}, {"url": "https://en.wikipedia.org/wiki/Chlorinated_polyvinyl_chloride", "passage_text": "Chlorinated polyvinyl chloride (CPVC) is a thermoplastic produced by chlorination of polyvinyl chloride (PVC) resin. Uses include hot and cold water pipes, and industrial liquid handling. CPVC shares most of the features and properties of PVC. It is also readily workable, including machining, welding, and forming. Because of its excellent corrosion resistance at elevated temperatures, CPVC is ideally suited for self-supporting constructions where temperatures up to 200 °F (90 °C) are present."}, {"url": "http://www.buildings.com/article-details/articleid/3421/title/the-piping-debate-copper-vs-cpvc.aspx", "passage_text": "Chlorinated polyvinyl chloride (CPVC) is a thermoplastic pipe and fitting material (produced by the post chlorination of polyvinyl resin) used for potable water distribution, corrosive fluid handling, and fire suppression. "}]