[{"url": "http://windowsitpro.com/networking/pptp-vs-l2tp", "passage_text": "The PPTP protocol encapsulates IP packets for transmission over an IP-based network. PPTP clients use the destination TCP port 1723 to create a PPTP control connection for a tunnel. This process takes place in the transport layer. As with PPTP, L2TP data tunneling begins with a PPP payload. L2TP encapsulates the PPP payload with a PPP header and an L2TP header, which results in an L2TP-encapsulated packet. UDP then encapsulates this packet."}, {"url": "http://windowsitpro.com/networking/pptp-vs-l2tp", "passage_text": "In addition to PPTP, Win2K supports the Layer 2 Tunneling Protocol (L2TP). When choosing which protocol to use to set up your server, you should understand how both protocols work and consider their authentication and encryption features. As with PPTP, L2TP data tunneling begins with a PPP payload. L2TP encapsulates the PPP payload with a PPP header and an L2TP header, which results in an L2TP-encapsulated packet. UDP then encapsulates this packet."}, {"url": "https://technet.microsoft.com/en-us/library/cc771298(v=ws.10).aspx", "passage_text": "L2TP is a combination of PPTP and Layer 2 Forwarding (L2F), a technology developed by Cisco Systems, Inc. L2TP represents the best features of PPTP and L2F. Unlike PPTP, the Microsoft implementation of L2TP does not use MPPE to encrypt PPP datagrams. L2TP relies on Internet Protocol security (IPsec) in Transport Mode for encryption services. The combination of L2TP and IPsec is known as L2TP/IPsec. A VPN solution based on Point-to-Point Tunneling Protocol (PPTP), Layer Two Tunneling Protocol (L2TP), or Secure Socket Tunneling Protocol (SSTP) can be configured."}, {"url": "http://windowsitpro.com/networking/pptp-vs-l2tp", "passage_text": "PPTP and L2TP then add another layer of encapsulation to tunnel the payload through a public network. Table 1 shows the layers in which certain protocols operate within the OSI model. PPP, in the data-link layer of the OSI model, was originally developed to encapsulate data and carry it over point-to-point links. As with PPTP, L2TP data tunneling begins with a PPP payload. L2TP encapsulates the PPP payload with a PPP header and an L2TP header, which results in an L2TP-encapsulated packet. UDP then encapsulates this packet."}, {"url": "http://zaielacademic.net/security/l2tp.htm", "passage_text": "Some Background. L2TP-Layer 2 Tunneling Protocol is a tunneling protocol that operates at layer 2 of the OSI model. It was developed by Cisco, largely to combat what Cisco considered to be deficiencies in PPTP. Their initial effort resulted in the L2F-Layer 2 Forwarding protocol. In order to make use of the features of both PPTP and L2F, L2TP was developed in a joint venture between Microsoft and Cisco. L2TP was definitely an improvement. L2TP does not provide its own internal encryption capabilities. But L2TP was developed to make sue of IPSec for encryption among other things."}, {"url": "http://www.differencebetween.net/technology/difference-between-pptp-and-l2tp/", "passage_text": "L2TP. Layer 2 Tunneling Protocol or L2TP is a tunneling protocol that allows remote users to access the common network. L2TP lets a Point-to-Point Protocol (PPP) session travel over several networks and links. PPTP. PPTP or Point-to-Point Tunneling Protocol is a method used for creating Virtual Private Networks over the internet. It is developed by Microsoft. With its use, users can remotely access corporate networks from any Internet Service Provider (ISP) that supports the protocol."}, {"url": "http://zaielacademic.net/security/l2tp.htm", "passage_text": "L2TP-Layer 2 Tunneling Protocol is a tunneling protocol that operates at layer 2 of the OSI model. It was developed by Cisco, largely to combat what Cisco considered to be deficiencies in PPTP. In order to make use of the features of both PPTP and L2F, L2TP was developed in a joint venture between Microsoft and Cisco. L2TP was definitely an improvement. L2TP does not provide its own internal encryption capabilities. But L2TP was developed to make sue of IPSec for encryption among other things."}, {"url": "http://searchenterprisewan.techtarget.com/definition/Layer-Two-Tunneling-Protocol", "passage_text": "Layer Two Tunneling Protocol (L2TP) is an extension of the Point-to-Point Tunneling Protocol (PPTP) used by an Internet service provider (ISP) to enable the operation of a virtual private network (VPN) over the Internet. "}, {"url": "http://compnetworking.about.com/od/vpn/g/bldef_pptp.htm", "passage_text": "PPTP (Point-to-Point Tunneling Protocol) is a network protocol used in the implementation of Virtual Private Networks (VPN) . PPTP works on a client server model. PPTP VPN clients are included by default in Microsoft Windows and also available for both Linux and Mac OS X. Newer VPN technologies like OpenVPN, L2TP and IPsec may offer better network security support, but PPTP remains a popular network protocol especially on Windows computers."}, {"url": "https://technet.microsoft.com/en-us/library/dd469817(v=ws.10).aspx", "passage_text": "You can configure a VPN solution based on PPTP, Layer Two Tunneling Protocol (L2TP), Secure Socket Tunneling Protocol (SSTP), or Internet Protocol security (IPsec) using Internet Key Exchange version 2 (IKEv2). PPTP, L2TP, and SSTP depend heavily on the features originally specified for Point-to-Point Protocol (PPP). For example, VPN uses Point-to-Point Tunneling Protocol (PPTP) to encapsulate IP packets over a public network, such as the Internet."}]