[{"url": "https://askabiologist.asu.edu/neuron-anatomy", "passage_text": "There are many kinds of neurons in your body, specialized to be good at doing different things. Multipolar neurons have one axon and many dendritic branches. These carry signals from the central nervous system to other parts of your body such as your muscles and glands. Unipolar neurons are also known as sensory neurons. They have one axon and one dendrite branching off in opposite directions from the cell body. These cells pass signals from the outside of your body, such as touch, along to the central nervous system. "}, {"url": "http://science.howstuffworks.com/life/inside-the-mind/human-brain/brain2.htm", "passage_text": "1 Sensory neurons carry signals from the outer parts of your body (periphery) into the central nervous system. 2  Motor neurons (motoneurons) carry signals from the central nervous system to the outer parts (muscles, skin, glands) of your body. 3  Interneurons connect various neurons within the brain and spinal cord. Interneurons, or associative neurons, carry information between motor and sensory neurons. These fundamental members of the nervous system also vary with respect to their functions. 1 "}, {"url": "https://explorable.com/types-of-neurons", "passage_text": "Another type of neurons is the bipolar neurons, each having an axon that transmits signals from the cell body going to the brain and the spinal cord, and dendrites that send signals from the body organs to the cell body. These bipolar neurons are usually found in sensory organs such as the eyes, nose and ears. Motor neurons carry signals from the brain and spinal cord to muscles. Interneurons connect one neuron to another: the long axons of projection interneuons link distant brain regions; the shorter axons of local interneurons form smaller circuits between neighboring cells."}, {"url": "http://www.gwinnett.k12.ga.us/LilburnES/PromoteGA/biochemistry/Neurons_types.html", "passage_text": "There are several different types of neurons. Sensory neurons carry signals from the outer parts of your body into the central nervous system or CNS. For example, if somebody puts ice on your hand, the sensory neurons send the message from your hand to your central nervous system telling you the ice is cold. Motor neurons carry signals from the central nervous system to the outer parts of your body doing the opposite of sensory neurons. For example, if you were driving, the motor neurons would take the message from your central nervous system to your hand telling you to turn the key."}, {"url": "https://en.wikipedia.org/wiki/Neuron", "passage_text": "A typical neuron consists of a cell body (soma), dendrites, and an axon. The term neurite is used to describe either a dendrite or an axon, particularly in its undifferentiated stage. These signals between neurons occur via synapses, specialized connections with other cells. Neurons can connect to each other to form neural networks. Neurons are the core components of the brain and spinal cord of the central nervous system (CNS), and of the ganglia of the peripheral nervous system (PNS)."}, {"url": "https://en.wikipedia.org/wiki/Unipolar_neuron", "passage_text": "Unipolar neuron. A unipolar neuron is a type of neuron in which only one protoplasmic process (neurite) extends from the cell body. Most neurons are multipolar, generating several dendrites and an axon and there are also many bipolar neurons. "}, {"url": "https://faculty.washington.edu/chudler/cells.html", "passage_text": "The human body is made up of trillions of cells. Cells of the nervous system, called nerve cells or neurons, are specialized to carry messages through an electrochemical process. The human brain has approximately 100 billion neurons. To learn how neurons carry messages, read about the action potential. Neurons come in many different shapes and size"}, {"url": "http://users.rcn.com/jkimball.ma.ultranet/BiologyPages/N/Neurons.html", "passage_text": "Link to CNS. The cell bodies of the sensory neurons leading to the spinal cord are located in clusters, the dorsal root ganglia (DRG), next to the spinal cord. Their axon extends in both directions: a peripheral axon to receptors at the periphery and a central axon passing into the spinal cord. "}, {"url": "https://en.wikipedia.org/wiki/Neuron", "passage_text": "A neuron (/ˈnjʊərɒn/ NYEWR-on or /ˈnʊərɒn/ NEWR-on; also known as a neurone or nerve cell) is an electrically excitable cell that processes and transmits information through electrical and chemical signals. These signals between neurons occur via synapses, specialized connections with other cells. Neurons can connect to each other to form neural networks. Neurons are the core components of the brain and spinal cord of the central nervous system (CNS), and of the ganglia of the peripheral nervous system (PNS)."}, {"url": "https://explorable.com/types-of-neurons", "passage_text": "Neurons are the specialized cells in the central nervous system. Neurons are classified according to structure, shape and function. Each type of neuron has a specific role for the proper functioning of the brain and the spinal cord. Motor neurons carry signals from the brain and spinal cord to muscles. Interneurons connect one neuron to another: the long axons of projection interneuons link distant brain regions; the shorter axons of local interneurons form smaller circuits between neighboring cells."}]