[{"url": "http://www.livestrong.com/article/468546-how-to-cook-moon-fish/", "passage_text": "Step 2. Place the moonfish fillets or steaks about 1 inch apart in a shallow dish and place them in the oven. Roast moonfish fillets and steaks for 15 to 20 minutes per pound or until they feel firm to the touch; roast fillets for 15 to 17 minutes and steaks for 17 to 20 minutes. Step 3. Steam moonfish steaks for 12 to 15 minutes; 12 minutes for steaks up to 1 inch thick and 15 minutes for those over 1 inch thick. Steam moonfish fillets for 10 to 12 minutes; 10 minutes for fillets less than 3/4 inch and 12 minutes for fillets thicker than 3/4 inch"}, {"url": "http://allrecipes.com/recipe/87237/super-summer-grilled-bluefish/", "passage_text": "1 Preheat a grill for high heat. 2  When the grill is hot, oil the grate. 3  Place fish fillets on the grill, and discard the marinade. 4  Cook for 4 minutes on each side, or until fish flakes with a fork. 5  Transfer to a serving platter, and remove the dark blue part of the fish before serving. 1 When the grill is hot, oil the grate. 2  Place fish fillets on the grill, and discard the marinade. 3  Cook for 4 minutes on each side, or until fish flakes with a fork. 4  Transfer to a serving platter, and remove the dark blue part of the fish before serving."}, {"url": "http://busycooks.about.com/video/Cook-Fish-in-Foil.htm", "passage_text": "Preheat a grill at medium-high heat, or preheat the oven at 425 degrees. Cut two large pieces of aluminum foil. First prepare the seasoning for the fish. Roughly chop the cilantro and place about 3 tablespoons into a bowl. Add 3 tablespoons of olive oil and 1 1/2 half teaspoons of minced garlic. Place them in the oven and cook about 15 minutes per inch of the filet. When the fish is opaque and the vegetables are tender, remove from heat. Allow the packets to stand for about 5 minutes before opening. Be careful of the hot steam when you open up the foil. Place the meal on a plate and enjoy! Thanks for watching."}, {"url": "http://www.foodandwine.com/recipes/grilled-opah-with-olives", "passage_text": "1 Rub the opah with oil and season with salt. 2  Grill over high heat until just cooked through, 1 1/2 minutes per side. 3  Slice each steak into 4 pieces. 4  Spoon the topping over the fish and serve. Instructions. 1  In a saucepan, melt the butter in 1 tablespoon of olive oil. 2  Cook over moderate heat until the butter browns slightly and smells nutty, 2 minutes. 3  Add the anchovy, crushed red pepper, pine nuts, capers, olives and lemon juice and cook for 1 minute."}, {"url": "http://www.recipetips.com/kitchen-tips/t--1429/grilling-fish.asp", "passage_text": "Cooking. Use the indirect grilling method with a medium hot grill when cooking whole fish and thick fillets or steaks. 1  Place the fish skin side up on the grill grate over indirect heat area. 2  Do not place directly over the heat source. 3  Cook the fish for 10 minutes per inch of thickness. 1 Place the fish skin side up on the grill grate over the direct heat source. 2  Cook the fish for 4 to 6 minutes and then turn to grill on the other side for approximately same amount of time. 3  Insert the tip of a knife in thickest area of the fish to check for doneness. 4  The meat should be flakey and opaque in appearance."}, {"url": "http://www.recipetips.com/kitchen-tips/t--1429/grilling-fish.asp", "passage_text": "Cooking. Use the direct grilling method with a medium hot grill when cooking thinner fillets and pieces of fish. 1  Place the fish skin side up on the grill grate over the direct heat source. 2  Cook the fish for 4 to 6 minutes and then turn to grill on the other side for approximately same amount of time. 1 Place the fish skin side up on the grill grate over the direct heat source. 2  Cook the fish for 4 to 6 minutes and then turn to grill on the other side for approximately same amount of time. 3  Insert the tip of a knife in thickest area of the fish to check for doneness. 4  The meat should be flakey and opaque in appearance."}, {"url": "http://www.finecooking.com/item/51317/lesson-7-how-to-grill-fish-fillets-steaks-and-whole", "passage_text": "Cook the first side of the fish a little longer than the second. This gives the fish nice sear marks for a good presentation, and it also helps the fish release from the grill without sticking. The usual rule of thumb for cooking time--10 minutes per inch of thickness--tends to produce overcooked fish on the grill. For steaks and fillets, 8 minutes per inch of thickness is a better guideline. "}, {"url": "http://busycooks.about.com/video/Cook-Fish-in-Foil.htm", "passage_text": "Fold the sides and seal the packet well. If you are grilling, cook for 10 minutes on each side. To bake, place the packets on a baking sheet. Place them in the oven and cook about 15 minutes per inch of the filet. When the fish is opaque and the vegetables are tender, remove from heat. Allow the packets to stand for about 5 minutes before opening. Be careful of the hot steam when you open up the foil. Place the meal on a plate and enjoy! Thanks for watching."}]