[{"url": "http://www.qacollections.com/Will-a-Boost-drink-cause-constipation", "passage_text": "On One Hand: Pressure on Anus May Cause FlatulenceThe pressure in the anal tract and intestines from constipation can cause bacterial buildup that may lead to gas and flatulence.On the Other: Gas a..."}, {"url": "http://www.early-retirement.org/forums/f27/health-question-constipation-and-boost-ensure-22707.html", "passage_text": "__________________. Health Question: Constipation and Boost / Ensure. My aging granddad is having several problems, among them insufficient nutrition and constipation when using dairy products. I wanted to get him to try a drink like Boost or Ensure for the vitamin supplement and perhaps some extra calories, too. (He doesn't seem to want to take vitamin pills.) He has severe constipation problems when he uses dairy products, so I checked the ingredients lists."}, {"url": "https://www.boost.com/health-and-nutrition/tips-faq", "passage_text": "BOOST ® COMPACT Drink — to provide complete nutrition in half the size of a full size nutritional drink**. BOOST ® CALORIE SMART ® 100 Calories Drink — to provide extra protein and nutrition without the extra calories. You can find more information about all of the BOOST ® Drinks here."}, {"url": "http://www.early-retirement.org/forums/f27/health-question-constipation-and-boost-ensure-22707.html", "passage_text": "1. The constipation is usually due to lack of activity, water, and fiber. There are liquid Boost-like supplements that have fiber added-check at the pharmacy. 2. Lactase is the problem for most people with milk intolerance, and while it usually causes cramps and diarrhea, it can cause constipation, too. 3."}, {"url": "https://www.boost.com/products/glucose-control", "passage_text": "BOOST Glucose Control ® Drink is a balanced nutritional drink specially formulated for people with diabetes. It provides a balance of protein, carbohydrates and fat which are designed to help manage blood glucose levels as part of a balanced diet."}, {"url": "https://www.boost.com/products/glucose-control", "passage_text": "When your busy schedule makes nutritious eating difficult, BOOST Glucose Control ® Drink can be used as convenient mini-meal or snack. It provides balanced nutrition with 190 calories and 16g of protein to help manage hunger."}, {"url": "http://www.qacollections.com/Will-a-Boost-drink-cause-constipation", "passage_text": "You can buy smoothies with no added sugar:)Or if you are fortunate enough to have a health food store nearby you can get freshly made juice:)I use to make my own juice before doing jiu jitsu for a ... Read More »."}]