[{"url": "http://www.certified-mail-envelopes.com/2009-usps-certified-mail-rates/", "passage_text": "The United States Postal Service (USPS) has approved new 2015 postal rates that begin Sunday, May 31, 2015. The 2015 cost of sending a 1-ounce USPS Certified Mail letter with Return Receipt (old fashioned green card) will cost $6.74. If you send Certified Mail using Electronic Delivery Confirmation the cost is $4.69. USPS Mail Service: 2014 Rate VS: 2015 Rates: Certified Mail Fee $3.30 $3.45. "}, {"url": "http://www.certified-mail-envelopes.com/certified-mail-return-receipt-requested/", "passage_text": "Certified Mail Return Receipt Requested. Each USPS Certified Mail letter provides proof of mailing and delivery of a letter. The sender receives a receipt at the time of mailing from the Postal Service. Certified Mail Return Receipt Requested is a product of the US Postal Service that provides information about when a letter is mailed and delivered."}, {"url": "http://cme.uservoice.com/knowledgebase/articles/66083-cost-of-sending-usps-certified-mail", "passage_text": "$6.74 is the current USPS Certified Mail rate to send a 1-ounce Certified Mail letter with Return Receipt Requested service (old fashioned green card). New 2015 postal rates increased the costs of the Certified Mail fee, First Class postage and the old fashioned green card. Follow this link to learn more about the USPS Certified Mail rates. ﻿ The US Postal Board of Governors approves all USPS Postal Rates for sending USPS Certified Mail. The cost to send a 1-ounce USPS Certified Mail letter with Return Receipt (green card) is $6.74. The new Certified Mail rate became effective Sunday May 31, 2015"}, {"url": "http://www.certified-mail-envelopes.com/certified-mail-return-receipt-requested/", "passage_text": "Certified Mail Return Receipt provides proof of USPS Certified Mail letter delivery. The ‘old fashioned green card’ is quickly being replaced by a the ‘Electronic Return Receipt’ PDF file that provides delivery confirmation and ‘in-route’ letter tracking authored by The United States Postal Service. The sender receives a receipt at the time of mailing from the Postal Service. Certified Mail Return Receipt Requested is a product of the US Postal Service that provides information about when a letter is mailed and delivered."}, {"url": "http://www.stamps.com/usps/return-receipt/", "passage_text": "Return Receipt is available for Priority Mail Express ® , Priority Mail ® , First Class Mail ® , Parcel Post ® and Media Mail. The cost of Return Receipt is $2.80 for a mailed receipt or $1.40 for an electronic receipt that is emailed to you. It can be combined with extra services including USPS Tracking, Signature Confirmation™, Special Handling, Restricted Delivery and Parcel Airlift Service. "}, {"url": "https://www.certifiedmaillabels.com/", "passage_text": "Skip the trip to the Post Office… Address and print USPS Certified Mail Labels online. Save $2.05 on postage for each Certified Mail green card receipt. No monthly fees, no long term contracts and no software or special equipment. Get email notification with Electronic Delivery Confirmations, Return Receipt Signatures and 10 year tracking and archive at no extra cost."}, {"url": "https://www.certifiedmaillabels.com/usps-postal-rates/", "passage_text": "2015 Certified Mail Rate Update: On May 31, 2015 the U.S. Postal Service announced new postal rates that were approved by the Postal Regulatory Commission. The new rates begin at 12:01 AM Sunday May 31 2015. The cost to send a 1-ounce USPS Certified Mail letter with Return Receipt (Green Card) will be $6.74. If you use Electronic Delivery Confirmation the cost can be reduced to $4.69. Additional options such as Return Receipt Signature Electronic in PDF format cost $1.40. The First Class 1 oZ. PC postage will not change. USPS Certified Mail rates increased to $3.45 per letter on May 31, 2015. Using the old-fashioned green cards with the traditional U. S. Postal Service Return Receipt service (PS Form 3811) will add $2.80 to your mailing cost."}]