[{"url": "http://healthyeating.sfgate.com/difference-between-sucrose-glucose-fructose-8704.html", "passage_text": "Sugar cane is a natural source of sucrose, or table sugar. Sucrose, glucose and fructose are important carbohydrates, commonly referred to as simple sugars. Sugar is found naturally in whole foods and is often added to processed foods to sweeten them and increase flavor. Simple carbohydrates are classified as either monosaccharides or disaccharides. Monosaccharides are the simplest, most basic units of carbohydrates and are made up of only one sugar unit. Glucose and fructose are monosaccharides and are the building blocks of sucrose, a disaccharide. Thus, disaccharides are just a pair of linked sugar molecules. They are formed when two monosaccharides are joined together and a molecule of water is removed -- a dehydration reaction"}, {"url": "https://en.wikipedia.org/wiki/Sucrose", "passage_text": "Saccharose is an obsolete name for sugars in general, especially sucrose. The molecule is a disaccharide combination of the monosaccharides glucose and fructose with the formula C12H22O11. Sucrose is often extracted and refined from either cane or beet sugar for human consumption. The word sucrose was coined in 1857 by the English chemist William Miller from the French sucre (sugar) and the generic chemical suffix for sugars-ose. The abbreviated term Suc is often used for sucrose in scientific literature."}, {"url": "http://healthyeating.sfgate.com/difference-between-sucrose-glucose-fructose-8704.html", "passage_text": "Sucrose is commonly known as table sugar, and is obtained from sugar cane or sugar beets. Fruits and vegetables also naturally contain sucrose. When sucrose is consumed, the enzyme beta-fructosidase separates sucrose into its individual sugar units of glucose and fructose. Simple carbohydrates are classified as either monosaccharides or disaccharides. Monosaccharides are the simplest, most basic units of carbohydrates and are made up of only one sugar unit. Glucose and fructose are monosaccharides and are the building blocks of sucrose, a disaccharide. Thus, disaccharides are just a pair of linked sugar molecules. They are formed when two monosaccharides are joined together and a molecule of water is removed -- a dehydration reaction"}, {"url": "http://chemistry.elmhurst.edu/vchembook/546sucrose.html", "passage_text": "Sucrose. Sucrose is made from glucose and fructose units: Sucrose or table sugar is obtained from sugar cane or sugar beets. The glucose and fructose units are joined by an acetal oxygen bridge in the alpha-1 on the glucose and beta-2 on the fructose orientation. "}, {"url": "http://study.com/academy/lesson/what-is-sucrose-function-structure-chemical-equation.html", "passage_text": "Sucrose is a disaccharide sugar, meaning it is made up of two monosaccharide sugar units. In the case of sucrose, the two units are glucose and fructose. The name sucrose comes from the French word for sugar: sucre. Sugarcane and sugar beets are the two plants that are used to make most sucrose, or refined table sugar. Hot water is used to extract sucrose. The extract can then be concentrated into syrup and then crystallized to make"}, {"url": "http://www.answers.com/Q/What_are_the_uses_of_sucrose", "passage_text": "Making the world better, one answer at a time. Sucrose is a natural and economical sweetener. It is the most versatile of all the Sucrose is a natural and economical sweetener. It is the most versatile of all the sweetener … s, performing many useful functions in a range of foods. Making the world better, one answer at a time. Sucrose is a natural and economical sweetener. It is the most versatile of all the Sucrose is a natural and economical sweetener. It is the most versatile of all the sweetener"}, {"url": "http://study.com/academy/lesson/what-is-sucrose-function-structure-chemical-equation.html", "passage_text": "Sucrose, or table sugar, is a common type of sugar made of glucose and fructose. It is a disaccharide and a simple carbohydrate. Sucrose is a crystal at room temperature that can be caramelized by heating. Sucrose is found naturally in foods, but it is also added to processed foods for preservation and flavor. Sugarcane and sugar beets are the two plants that are used to make most sucrose, or refined table sugar. Hot water is used to extract sucrose. The extract can then be concentrated into syrup and then crystallized to make"}, {"url": "http://www.benefits-of-honey.com/sucrose.html", "passage_text": "Sucrose, the technical name for table sugar, cane sugar, or white sugar, is made of one glucose molecule and one fructose molecule bound together. Comes in powdered and granulated forms, sugar is made from highly processed form of sugar beet or sugar cane plant extracts. "}]