[{"url": "http://www.consumerreports.org/cro/2012/04/quinine-for-night-time-leg-cramps-no-longer-recommended/index.htm", "passage_text": "If you have nocturnal (nighttime) leg cramps, your doctor might prescribe quinine (Qualaquin)-even though the U.S. Food and Drug Administration has approved it for only one purpose: to treat malaria (although doctors can legally prescribe most medications for any type of treatment they deem appropriate). "}, {"url": "https://en.wikipedia.org/wiki/Tonic_water", "passage_text": "Tonic water (or Indian tonic water) is a carbonated soft drink, in which quinine is dissolved. Originally used as a prophylactic against malaria, tonic water usually now has a significantly lower quinine content and is consumed for its distinctive bitter flavour. It is often used in mixed drinks, particularly in gin and tonic."}, {"url": "https://en.wikipedia.org/wiki/Quinine", "passage_text": "Quinine was the first effective Western treatment for malaria caused by Plasmodium falciparum, appearing in therapeutics in the 17th century. It remained the antimalarial drug of choice until the 1940s, when other drugs, such as chloroquine, that have fewer unpleasant side effects replaced it. Quinine is also used to treat lupus and arthritis. In the past, quinine was frequently prescribed in the US as an off-label treatment for nocturnal leg cramps, but this has become less prevalent due to a Food and Drug Administration statement warning against the practice."}, {"url": "http://www.peoplespharmacy.com/2010/10/11/is-quinine-in-tonic-water-safe/", "passage_text": "Tonic contains 83 mg. of quinine in a liter. An eight-ounce glass or tonic would only have about 20 mg of quinine, considerably less than the dose that used to be prescribed for leg cramps (200 to 300 mg). The trouble is that some people are extremely sensitive to quinine’s toxic effects. This drug can cause headache, rash, ringing in the ears, nausea, dizziness and blurred vision. The most serious reactions are rare but can be life threatening."}, {"url": "http://www.everydayhealth.com/drugs/quinine", "passage_text": "Quinine is only approved for the treatment of malaria. Tonic water contains quinine but it does not have enough quinine to help with leg cramps. Common side effects associated with quinine can include headache, nausea, diarrhea, vomiting, hives, fever, ringing in the ears, vision problems, and bleeding problems."}, {"url": "http://www.ncbi.nlm.nih.gov/pubmedhealth/PMHT0011919/?report=details", "passage_text": "Uses of This Medicine. Quinine is used to treat malaria caused by Plasmodium falciparum. Plasmodium falciparum is a parasite that gets into the red blood cells in the body and causes malaria. Quinine works by killing the parasite or preventing it from growing. Quinine should not be used to treat or prevent night time leg cramps. This medicine may cause very serious unwanted effects and should only be used for patients with malaria. This medicine is available only with your doctor's prescription."}, {"url": "http://www.everydayhealth.com/drugs/quinine", "passage_text": "1 Review. Quinine is the generic form of the brand-name drug qualaquin, a medication used to treat uncomplicated P. falciparum malaria, a specific type of malaria. Malaria is a disease caused by parasites that typically enter the body through the bite of a mosquito. Tonic water contains quinine but it does not have enough quinine to help with leg cramps. Common side effects associated with quinine can include headache, nausea, diarrhea, vomiting, hives, fever, ringing in the ears, vision problems, and bleeding problems."}, {"url": "https://en.wikipedia.org/wiki/Quinine", "passage_text": "Quinine occurs naturally in the bark of the cinchona tree, though it has also been synthesized in the laboratory. The medicinal properties of the cinchona tree were originally discovered by the Quechua, who are indigenous to Peru and Bolivia; later, the Jesuits were the first to bring cinchona to Europe. Quinine is also used to treat lupus and arthritis. In the past, quinine was frequently prescribed in the US as an off-label treatment for nocturnal leg cramps, but this has become less prevalent due to a Food and Drug Administration statement warning against the practice."}, {"url": "https://en.wikipedia.org/wiki/Quinine", "passage_text": "Quinine is on the WHO Model List of Essential Medicines, a list of the most important medications needed in a basic health system. As of 2006, it is no longer recommended by the WHO (World Health Organization) as a first-line treatment for malaria, and it should be used only when artemisinins are not available. Quinine is also used to treat lupus and arthritis. In the past, quinine was frequently prescribed in the US as an off-label treatment for nocturnal leg cramps, but this has become less prevalent due to a Food and Drug Administration statement warning against the practice."}]