[{"url": "http://www.ehso.com/siccodes.php", "passage_text": "SIC Code List The U.S. Standard Industrial Classification (SIC) system was the older way of classifying businesses to provide new comparability in statistics about business activity across North America."}, {"url": "http://siccode.com/en/", "passage_text": "The North American Industry Classification System (NAICS) is used by businesses and governments to classify and measure economic activity in Canada, Mexico, and the United States. NAICS is currently the standard used by federal statistical agencies in classifying ..."}, {"url": "http://siccode.com/en/pages/industry-codes", "passage_text": "SIC Directory-Browse the entire SIC directory with codes, definitions, cross references, and illustrated examples. SIC-to-NAICS Conversion-Convert SIC Codes to NAICS Codes. SIC Code Lookup-Use the search bar to look up SIC codes-Enter keyword or SIC Code. SIC Business Lists-Build a customized business list."}, {"url": "http://dor.wa.gov/content/aboutus/statisticsandreports/sic_vs_naics.aspx", "passage_text": "These codes were developed by the federal government and are used by the U.S. Office of Management and Budget (OMB) as well as many other U.S. statistical agencies. In 1997, OMB adopted NAICS as its new industry classification system. Every registered Washington firm is assigned a SIC or NAICS code. SIC codes can be up to four digits and NAICS codes can be up to six digits. The Quarterly Business Review (QBR) and the other Create a Report functions (i.e."}, {"url": "http://sic-codes.findthedata.com/", "passage_text": "The more digits a code contains, the more specific it is. For example, 2-digit codes are very broad while 8-digits codes can be very specific. Search by SIC Code. The Standard Industrial Classification (SIC) code system is used to classify a firm's primary industry. Search by Industry. An industry is the primary business activity of any firm. Industries are determined by common products, services, production and delivery system of businesses."}, {"url": "http://sic-codes.findthedata.com/", "passage_text": "The Standard Industrial Classification (SIC) code system is used to classify a firm's primary industry based on common products, services, production processes, and delivery systems."}, {"url": "http://siccode.com/en/pages/industry-codes", "passage_text": "NAICS Directory-Search the Entire NAICS directory with codes, definitions, cross-references, and illustrated examples. NAICS-to-SIC Conversions-Convert NAICS codes to SIC codes. NAICS Code Lookup-Use the search bar to look up NAICS codes-Enter Keyword or NAICS Code. NAICS Business Lists-Build a customized list."}, {"url": "http://sic-codes.findthedata.com/", "passage_text": "SIC codes have a hierarchical structure that begins broadly and becomes more specific. 2-digit codes are the broadest while 4, 6, and 8-digit codes become increasingly specific with additional digits. You can easily find broader codes by taking out the first several digits of any SIC code."}]