[{"url": "http://www.nursetogether.com/practicing-independently-nurse-practitioner", "passage_text": "Practicing Independently as a Nurse Practitioner. By NT Contributor on Fri, Aug 2, 2013. There are a tremendous amount of determining factors involved when choosing a career path as a Nurse Practitioner. One key factor is state legislature and the effect that it has on restrictions and limitations on practice. It differs from state to state, at times, quite drastically."}, {"url": "http://healthcare-training-center.com/nurse-practioners/states-where-nurse-practitioners-can-practice-independently", "passage_text": "States independently regulate the practice of nursing, and there is considerable variation among the states as to APNs' scope of All 47 states that authorize APNs to prescribe controlled substances authorize nurse practitioners to prescribe controlled substances. Forty-six states authorize nurse … View Document. "}, {"url": "https://www.discovernursing.com/specialty/independent-nurse-contractor", "passage_text": "RN Diploma, ASN or BSN. An Independent Nurse Contractor works on a contractual basis instead of directly for a health care provider. They play a major role in filling the void left by the current nursing shortage, especially in under-served areas where hiring and retaining qualified nurses is difficult. An Independent Nurse Contractor works on a contractual basis instead of directly for a health care provider"}, {"url": "http://www.usatoday.com/story/news/nation/2014/08/18/nurse-practitioner-independence-laws/13470733/", "passage_text": "Granting independent practice to nurse practitioners would be creating two classes of care: one run by a physician-led team and one run by less-qualified health professionals, said a 2012 academy report. Americans should not be forced into this two-tier scenario. Everyone deserves to be under the care of a doctor.. "}, {"url": "https://nnbanow.com/independent-contractor/", "passage_text": "Registered nurses can provide nursing services in the patient’s home. The patient pays for the services. The nursing care must follow the state’s nurse practice act. NANDA nursing diagnosis and care plans can be used to standardize care. Holistic nurses are independent practitioners. The services provided must fall within the position statement issued by the state nurse practice act. If you are working alone as a independent contractor, the earnings are limited to the number of hours you can physically work. The earnings vary by location and are often the same as working on the high end of the pay scale at a hospital in that same locale. Nurse practitioners’ bill rates are higher than an RN’s."}, {"url": "http://allnurses.com/entrepreneurs-in-nursing/independent-nurses-providing-35825.html", "passage_text": "1 This may be a dumb question, but how can a nurse be an independent care provider as so much of what we do depends on physician orders (IVF, meds, certain procedures, etc.)? I'm very curious about how this is done, as the idea of being an independent contractor is very appealing to me. I understand how it can be done as, say, a legal nurse consultant or someone who is not doing direct patient care, but I don't understand how it works when you're providing direct patient care."}, {"url": "http://allnurses.com/entrepreneurs-in-nursing/independent-nurses-providing-35825.html", "passage_text": "Rachel: In many states, the Medicaid program uses the term independent nurse provider (INP) to designate a nurse who is self-employed. I am an INP for Medi-Cal in CA. INP means that I provide nursing care independent of employee status with a healthcare organization. I'm very curious about how this is done, as the idea of being an independent contractor is very appealing to me. I understand how it can be done as, say, a legal nurse consultant or someone who is not doing direct patient care, but I don't understand how it works when you're providing direct patient care."}]