[{"url": "http://www.mypetsmart.com/breeds/dachshund-standard-and-miniature.shtml", "passage_text": "Height: Miniature: up to 14 inches; Standard: 14 inches (Male). Weight: Miniature: 11 pounds and under; Standard: 16 pounds (Male). Click on a thumbnail to enlarge. Origin: Germany. Male height: Miniature: up to 14 inches; Standard: 14 inches. Male weight: Miniature: 11 pounds and under; Standard: 16 pounds. Coat: There are three coat types (varieties): smooth, longhaired and wirehaired."}, {"url": "http://www.creamridgedachshunds.com/Standard.html", "passage_text": "Size, Proportion, Substance-Bred and shown in two sizes, standard and miniature; miniatures are not a separate classification but compete in a class division for 11 pounds and under at 12 months of age and older.. Weight of the standard size is usually between 16 and 32 pounds. Head-Viewed from above or from the side, the head tapers uniformly to the tip of the nose. The eyes are of medium size, almond-shaped and dark-rimmed, with an energetic, pleasant expression; not piercing; very dark in color. "}, {"url": "https://en.wikipedia.org/wiki/Dachshund", "passage_text": "An increasingly common size for family pets falls between the miniature and the standard size, frequently referred to as tweenies, not an official classification. A full-grown standard dachshund averages 16 lb (7.3 kg) to 32 lb (15 kg), while the miniature variety normally weighs less than 12 lb (5.4 kg). The kaninchen weighs 8 lb (3.6 kg) to 11 lb (5.0 kg). The dachshund (UK /ˈdaeksənd/ ˈdæksənd OR /us/ ˈDɑːKSHʊNT-dahks huunt OR /us/ ;) ˈdɑːksənt is a-short, legged-long bodied dog breed belonging to the hound. family"}, {"url": "http://dogtime.com/dog-breeds/dachshund", "passage_text": "Size. Dachshunds are bred and shown in two sizes: Standard and Miniature. Standard Dachshunds of all varieties (Smooth, Wirehair, and Longhair) usually weigh between 16 and 32 pounds. Miniature Dachshunds of all varieties weigh 11 pounds and under at maturity."}, {"url": "http://www.dogbreedinfo.com/dachshund.htm", "passage_text": "Height, Weight. There are three varieties of Dachshund, the shorthaired, the wirehaired, and the longhaired. According to AKC standard, there are two sizes, Standard and Miniature. Unlike the AKC, Europe also recognizes the Toy variety called a kaninchen, which is the German word for rabbit. Standard: Height 8 - 11 inches (20 - 27cm); Weight-over 11 pounds (4.9 kg) at the age of 12 months. Miniature: Height up to 5 - 7 inches (13 - 18 cm); Weight 11 pounds (4.9 kg) or less at the age of 12 months"}, {"url": "http://www.nationalkennelclub.com/Breed-Standards/dachshund.htm", "passage_text": "Standard Dachshund: Sizes average height 8-9 inches and weight over 11 lbs. (usually 16-32 lbs.). Miniature Dachshund: Sizes average height 5-6 inches and weight under 11 lbs. Standards: Fine, slightly arched muzzle. "}, {"url": "http://www.anniemany.com/2013/07/sizeweight-and-types-of-dachshund.html", "passage_text": "Above picture shows Standard Dachshund.The biggest in size and the oldest of all three types.Height for a Standard male Dachshund lies in the range of 9-11 inches or 21-28 cm whereas for a female height ranges from 20-25 cm.A standard adult Dachshund weighs around 10-11 lbs or 4.5-4.9 kg. Toy Dachshunds are not recognized by American Kennel Club however they are still considered as a separate Dachshund type in many other countries.Height for Toy Dachshund ranges from 10-12 inches or 25-30 cm whereas weight for toy Dachshunds ranges from 7-9 lbs or 3.1-4.1 kg."}, {"url": "http://www.dachshund-owner-guide.com/miniature-dachshund.html", "passage_text": "you have to watch this you-tube video, it's so funny. The dachshund that is not a mini or a standard. Tweenie as they are more commonly known are between 12 to 15 pounds (5.5 - 6.8 kg), therefore they are neither standard or miniature size. They may not make a great show dog but they do make a great pet. "}, {"url": "http://dogtime.com/dog-breeds/dachshund", "passage_text": "In the United States, Dachshunds are either miniature (11 pounds and under as an adult) or standard (usually between 16 and 32 pounds as an adult). If your Dachshund weighs between 11 and 16 pounds, he's called a tweenie. Other countries have a wider variance in the sizes. Dachshunds are bred and shown in two sizes: Standard and Miniature. Standard Dachshunds of all varieties (Smooth, Wirehair, and Longhair) usually weigh between 16 and 32 pounds. Miniature Dachshunds of all varieties weigh 11 pounds and under at maturity."}]