[{"url": "http://www.backspasmadvice.com/back-muscle-spasms-causes-and-treatment/", "passage_text": "The most common cause of muscle cramps is injury of the muscles or the bone to which the muscles are attached. In the case of muscle spasm in back, an injury to the spine will cause back muscles to contract as they try to provide more support to the injured bone area. Similarly, when the muscles, themselves, are injured, they will spasm or contract in order to protect themselves. Some medication can also cause muscle cramps"}, {"url": "http://www.healthgrades.com/symptoms/back-spasm", "passage_text": "A back spasm is a sudden and involuntary contraction, or uncontrollable tightening, of a muscle in response to strain, overuse, weakness, or muscle pain related to injury or a disorder. Back spasms often occur near the spinal cord or near the nerve roots that lead in and out of the spinal cord. "}, {"url": "http://www.back-exercise-and-pain-relief.com/back-muscle-spasm.html", "passage_text": "Causes of Muscle Spasms. Muscle spasms in the back can often be caused by a twisting or strain on one of the back muscles, which in turn causes involuntary muscle contractions. Although this often occurs when tense, tight back muscles are present, it can happen in any circumstance. As a result of the contraction people often complain of having symptoms of either a locked back, or a knot in their back. Among the most common causes of muscle spasms in the back... 1  a sneeze or cough. 2  lifting heavy objects. 3  incorrect sitting posture. 4  muscle overuse, or injury. 5  dehydration."}, {"url": "http://www.spine-health.com/video/causes-back-muscle-spasms-video", "passage_text": "Causes of Back Muscle Spasms Video. A muscle spasm is the body's method of protecting injured structures, or as a means to protect itself from injury. Muscle spasms in the back can be caused by a muscle strain, a sprained muscle, or an underlying condition. 1  Tweet. 2  Print."}, {"url": "http://www.healthline.com/health/back-pain/lower-back-spasms", "passage_text": "Back spasms can be the result of injuries to the muscles, tendons, and ligaments in the back or it can be related to more serious medical conditions. Heavy lifting is a common cause of back spasms. Any activity that puts excessive strain on the muscles and ligaments in the lower back can cause an injury. A back spasm is the involuntary contraction or tensing of the muscles in the lower back. The condition ranges from infrequent and mild discomfort to severe pain that makes it difficult to move."}, {"url": "http://www.spine-health.com/video/causes-back-muscle-spasms-video", "passage_text": "Video Transcript. In discussing back muscle spasms, it's important to remember that sometimes spasms of the muscle in the back is just a spasm of the muscle. When I say that, what I mean is muscles have their own intrinsic protective mechanisms. A muscle spasm is the body's method of protecting injured structures, or as a means to protect itself from injury. Muscle spasms in the back can be caused by a muscle strain, a sprained muscle, or an underlying condition. 1  Tweet. 2  Print."}, {"url": "http://www.med-health.net/Back-Spasms.html", "passage_text": "Muscle spasm and severe pain can occur due to irritation or injury of the nerves, ligaments or muscles in the back. Most people who suffer from back spasms feel a severe muscle pain and tightening as well as a palpable tension or a knot. "}, {"url": "http://www.spine-health.com/blog/what-your-back-muscle-spasm-telling-you", "passage_text": "The first step to getting to the bottom of what your back is telling you and to feeling better is to determine the cause of your back muscle spasm. Muscles spasms occur: 1  As a result of the muscles trying to protect themselves from a muscle strain or sprain or. 2  In response to an underlying condition. Muscle spasms in your back can be so painful that they may have you headed for the emergency room. If you experience a back muscle spasm, make sure to stop and listen to your body. Either your back is telling you not to do that activity ever again, or it's warning you that there's a more serious underlying issue."}, {"url": "http://www.backspasmadvice.com/back-muscle-spasms-causes-and-treatment/", "passage_text": "Dealing with the causes of the spasm. Continued cramps or back muscles pain may mean that your back muscles have been strained or torn. In that case, the best thing to do is to start treating the muscles, immediately. Applying ice to the injured area will help relax the muscles. In the case of muscle spasm in back, an injury to the spine will cause back muscles to contract as they try to provide more support to the injured bone area. Similarly, when the muscles, themselves, are injured, they will spasm or contract in order to protect themselves."}, {"url": "http://www.webmd.boots.com/pain-management/guide/muscle-spasms-and-cramps", "passage_text": "Muscle spasms and cramps. Cramps are caused by muscle spasms, involuntary contractions of one or more muscles. In addition to the foot and calf muscles, other muscles prone to spasms include the front and back of the thigh, the hands, arms, abdomen and muscles along the ribcage. Almost everyone experiences muscle cramps, which come without warning."}]