[{"url": "http://www.anesthesiamedications.com/Isoflurane.html", "passage_text": "Isoflurane is a halogenated ether used for inhalational anesthesia. Together with enflurane and halothane, it replaced the flammable ethers used in the pioneer days of surgery. Its name comes from being a structural isomer of enflurane, hence they have the same empirical formula. Anesthesia gases used globally contribute the equivalent of 1 million cars to global warming. Isoflurane is a greenhouse gas, with a global warming potential of 1401. One tonne of sevoflurane emitted is equivalent to 1401 tonnes of carbon dioxide in the atmosphere."}, {"url": "http://medical-dictionary.thefreedictionary.com/isoflurane", "passage_text": "isoflurane. a potent inhalational anesthetic similar to enflurane, used for induction and maintenance of general anesthesia. /iso·flu·rane/ (-floo´rān) a potent inhalational anesthetic similar to enflurane, used for induction and maintenance of general anesthesia. "}, {"url": "https://en.wikipedia.org/wiki/Desflurane", "passage_text": "Desflurane (1,2,2,2-tetrafluoroethyl difluoromethyl ether) is a highly fluorinated methyl ethyl ether used for maintenance of general anesthesia. Like halothane, enflurane, and isoflurane, it is a racemic mixture of (R) and (S) optical isomers (enantiomers). Together with sevoflurane, it is gradually replacing isoflurane for human use, except in economically undeveloped areas, where its high cost precludes its use. It has the most rapid onset and offset of the volatile anesthetic drugs used for general anesthesia due to its low solubility in blood. "}, {"url": "http://www.rxlist.com/forane-drug/indications-dosage.htm", "passage_text": "Premedication should be selected according to the need of the individual patient, taking into account that secretions are weakly stimulated by FORANE (isoflurane, USP), and the heart rate tends to be increased. The use of anticholinergic drugs is a matter of choice. Inspired concentrations of 1.5 to 3.0% isoflurane usually produce surgical anesthesia in 7 to 10 minutes. Surgical levels of anesthesia may be sustained with a 1.0 to 2.5% concentration when nitrous oxide is used concomitantly. An additional 0.5 to 1.0% may be required when isoflurane is given using oxygen alone."}, {"url": "http://livertox.nih.gov/Isoflurane.htm", "passage_text": "Isoflurane has been linked to rare instances of severe acute liver injury resembling halothane induced liver injury in small case series and individual case reports. Isoflurane is metabolized to some extent by the microsomal drug metabolizing enzyme CYP 2E1 to a trifluoroacetylated reactive intermediate (TFA) that is capable of binding to multiple intracytoplasmic proteins forming potentially immunogenic adducts."}, {"url": "http://www.anesthesiamedications.com/Isoflurane.html", "passage_text": "- WIKIPEDIA. A major advantage of isoflurane is that the patent covering its use has expired, therefore it is very economical to use. Anesthesia gases used globally contribute the equivalent of 1 million cars to global warming. Isoflurane is a greenhouse gas, with a global warming potential of 1401. One tonne of sevoflurane emitted is equivalent to 1401 tonnes of carbon dioxide in the atmosphere."}, {"url": "https://en.wikipedia.org/wiki/Isoflurane", "passage_text": "From Wikipedia, the free encyclopedia. Isoflurane (2-chloro-2-(difluoromethoxy)-1,1,1-trifluoro-ethane) is a halogenated ether used for inhalational anesthesia. Together with enflurane and halothane, it replaced the flammable ethers used in the pioneer days of surgery. Its use in human medicine is now starting to decline, being replaced with sevoflurane, desflurane, and the intravenous anaesthetic propofol. Isoflurane is still frequently used for veterinary anaesthesia. Isoflurane is always administered in conjunction with air and/or pure oxygen. Often nitrous oxide is also used"}]