[{"url": "http://www.healthline.com/health/berberine-can-it-lower-cholesterol", "passage_text": "Berberine is an alkaloid, which is a chemical compound found in several plants such as goldenseal. For centuries, this herb was used by a number of Native American tribes for medicinal purposes, including stomach ulcers and eye irritation. A 2012 study using human subjects found that three 500 mg doses of berberine a day for 12 weeks was more effective in lowering cholesterol than ezetimibe. Ezetimibe is a statin that is commonly found in medications for high cholesterol. Unfortunately, some people are unable to tolerate the side effects of statins."}, {"url": "https://en.wikipedia.org/wiki/Berberine", "passage_text": "Berberine is a quaternary ammonium salt from the protoberberine group of isoquinoline alkaloids. It is found in such plants as Berberis [e.g. Berberine was supposedly used in China as a broad-spectrum anti-microbial medicine by Shennong around 3000 BC. This first recorded use of Berberine is described in the ancient Chinese medical book The Divine Farmer's Herb-Root Classic."}, {"url": "http://www.ncbi.nlm.nih.gov/pubmed/10767672", "passage_text": "The berberine alkaloid can be found in the roots, rhizomes, and stem bark of the plants. Berberine extracts and decoctions have demonstrated significant antimicrobial activity against a variety of organisms including bacteria, viruses, fungi, protozoans, helminths, and chlamydia. Berberine is a plant alkaloid with a long history of medicinal use in both Ayurvedic and Chinese medicine. It is present in Hydrastis canadensis (goldenseal), Coptis chinensis (Coptis or goldenthread), Berberis aquifolium (Oregon grape), Berberis vulgaris (barberry), and Berberis aristata (tree turmeric)."}, {"url": "https://en.wikipedia.org/wiki/Berberine", "passage_text": "Berberine is usually found in the roots, rhizomes, stems, and bark. Berberine was supposedly used in China as a broad-spectrum anti-microbial medicine by Shennong around 3000 BC. This first recorded use of Berberine is described in the ancient Chinese medical book The Divine Farmer's Herb-Root Classic."}, {"url": "http://articles.mercola.com/sites/articles/archive/2015/06/22/berberine-benefits.aspx#!", "passage_text": "By Dr. Mercola Berberine is a yellow-colored alkaloid compound found in several different plants, including European barberry, goldenseal, goldthread, Oregon grape, phellodendron, and tree turmeric. Berberine has antibacterial, anti-inflammatory, and immune-enhancing properties. "}, {"url": "http://www.swansonvitamins.com/swanson-premium-berberine-400-mg-60-caps", "passage_text": "Supports healthy cholesterol and glucose levels already within the normal range. Berberine is a natural alkaloid found in a wide variety of traditional herbs including goldenseal, barberry and Oregon grape. Many herbalists credit this unique alkaloid for the benefits of ancient herbal tonics used by native populations throughout the world. "}, {"url": "http://www.naturalmedicinejournal.com/journal/2012-12/clinical-applications-berberine", "passage_text": "The chemical berberine is found in a handful of plants widely used in botanical medical practice including Goldenseal (Hydrastis canadensis), Oregon grape (Berberis aquifolium), Barberry (Berberis vulgaris), and Chinese Goldthread (Coptis chinensis). "}, {"url": "http://www.buffalonews.com/columns/peoples-pharmacy/berberine-found-in-medicinal-plants-20151003", "passage_text": "Some studies I found equate berberine with metformin for effectiveness. A. Berberine is a natural compound found in many medicinal plants such as Oregon grape or goldenseal. Long ago it was identified as having antimicrobial activity. It also is a component of several plants used in traditional Chinese medicine to treat high blood sugar. "}, {"url": "http://www.thesourcenatural.com/ns/DisplayMonograph.asp?storeID=DHAP6V4FB7SR2NM700AKHLBD3CMFBXMD&DocID=bottomline-berberine", "passage_text": "Background Berberine is a bitter-tasting, yellow compound found in plants. It has a long history of medical use in Chinese and Ayurvedic medicine. Berberine is found in the roots and stem bark of many plants, including goldenseal, coptis or goldenthread, Oregon grape, barberry, and tree turmeric."}, {"url": "http://www.raysahelian.com/berberine.html", "passage_text": "Berberine is a plant alkaloid isolated from the roots and bark of several herbs. Some of these herbs include: Barberry (Berberis vulgaris), Berberis integerrima. Berbamine and berberine are found in the plant barberry. Coptis chinensis or Berberis aristata Goldenseal (Hydrastis canadensis) Oregon Grape (Berberis aquifolium) Phellodendron Amurense Yerba mansa (Anemopsis californica). Cardiovascular actions of berberine. Cardiovasc Drug Rev. 2001. Berberine, is an alkaloid from Hydrastis canadensis., Chinese herb Huanglian, and many other plants. It is widely used in traditional Chinese medicine as an antimicrobial in the treatment of dysentery and infectious diarrhea."}]