[{"url": "http://www.wikihow.com/Grow-and-Use-Aloe-Vera-for-Medicinal-Purposes", "passage_text": "Aloe vera, also known as medicinal aloe, is a species of succulent plant that thrives in dry, hot regions of the world. Aloe vera is a stemless or very short-stemmed succulent plant that can grow as high as 3 feet tall. Purchase a small plant from a garden store and then repot it in a larger container. If you care for the plant properly, it will thrive and produce plenty of aloe for medicinal use. 1  Choose a wide container to repot your aloe plant since aloes tend to produce offshoots, or baby aloe plants."}, {"url": "http://www.twineagles.org/medicinal-uses-of-aloe-vera.html", "passage_text": "Aloe vera is a succulent and mucilaginous plant that can grow up to 40 inches in height. Without a stem, its green leaves resemble blades or a sword coming out from a central point. These thick and heavy leaves contain the precious healing gel that provides the medicinal uses of aloe vera. You can use the aloe vera fresh from a plant. All you need to do is cut up a leaf from the plant and scoop out the gel for your recipe. Here is a helpful tip: When you remove a leaf, make sure to separate the leaf right at the base of the leaf itself, at the point where it connects to the rest of the plant."}, {"url": "http://homeguides.sfgate.com/kind-soil-aloe-vera-plants-need-46807.html", "passage_text": "Sand and Gravel. All members of the Aloe genus require sandy or gravelly soil with very good drainage to reduce the risk of root rot and nutritional deficiencies. When planted in containers, aloe vera plants do well in a mixture of commercial potting mix with extra sand, granite grit or perlite added. They can also be planted in potting soil meant specifically for cactuses. When planting aloe vera outdoors, look for a sandy spot that dries out completely after rainfall. Raised Planting. Outdoor aloes sometimes need extra drainage help in wet climates, since their soil may not dry out completely between rain showers. Consider planting your aloe vera in a raised bed or on a slope to discourage wet conditions and increase the amount of oxygen available to the roots."}, {"url": "http://www.gardenguides.com/96693-types-aloe-plants.html", "passage_text": "Aloe is the name of a plant genus that contains more than 300 species. Most of the aloe species are native to Africa, Madagascar and the Arabian Peninsula. In addition to the familiar cactus-like plant called aloe vera that many people use to soothe sunburns and other skin ailments, this genus has plants that range from grassy succulents to large trees. "}, {"url": "http://garden.lovetoknow.com/wiki/Aloe_Vera_Plants", "passage_text": "Aloe Vera plants, Aloe barbadensis, are perennial plants in the Lily family that are known for their healing and soothing properties. The thick, succulent leaves are pale grayish-green with lighter spots and points along the edges. The center of each leaf is filled with a viscous gel. "}, {"url": "http://www.aloeplant.info/the-type-of-soil-an-aloe-vera-plant-needs-to-thrive/", "passage_text": "1. Half Potting Soil, Half Sand: Perhaps the easiest and cheapest solution to your aloe vera soil dilemma is to simply mix your regular potting soil with the same amount of sand. You will want to use river sand, not beach sand. 2. "}, {"url": "https://en.wikipedia.org/wiki/Aloe_vera", "passage_text": "Aloe vera (/ˈaeloʊiː/ ˈæloʊiː /or/) ˈaeloʊ ˈæloʊ is a succulent. plant species The species has a number of synonyms: A. barbadensis Mill., Aloe indica Royle, Aloe perfoliata L. var. vera and A. vulgaris Lam. Common names include Chinese Aloe, Indian Aloe, True Aloe, Barbados Aloe, Burn Aloe, First Aid Plant. The species epithet vera means true or genuine."}, {"url": "http://homeguides.sfgate.com/potting-mix-aloe-vera-plants-45212.html", "passage_text": "Aloe vera plants are succulents. Aloe vera, also known as Aloe barbadensis, is a succulent plant with thick, fleshy leaves and other adaptations that allow it to flourish in hot, dry environments, but these same traits make standard potting mix a less-than-ideal growing medium. Aloes are not fussy plants, and most will do fine with this mixture. For a more precision mix, consider what your aloe needs from its soil. The Cactus and Succulent Society of America identifies four key soil components necessary for a healthy plant: support, water, air, nutrients and availability."}, {"url": "http://aloevera.com/the-ultimate-guide-to-the-aloe-vera-plant/", "passage_text": "There are many different types of aloe plants, but they don’t all have the medicinal benefits that come from the aloe vera plant. While these plants do often bloom with beautiful flowers, they are not grown for their beauty. They are grown today for their many health benefits and medicinal uses. "}]