[{"url": "http://www.answers.com/Q/What_is_the_smallest_part_of_the_element_gold_that_still_retains_the_chemical_properties_of_gold", "passage_text": "An atom is the smallest unit of an element that retains the identity (and the chemical properties) of that element. + 66 others found this useful. Sandra Pinzon. Edit. The atom is the smallest particle of an element that retains it's characteristics. Sub-atomic particles such as protons, neutrons and electrons form the atom and it is the amo … unt of each of these sub-atomic particles that make the element that element. 5 people"}, {"url": "https://en.wikipedia.org/wiki/Chemical_substance", "passage_text": "A chemical substance is a form of matter that has constant chemical composition and characteristic properties. It cannot be separated into components by physical separation methods, i.e., without breaking chemical bonds. Chemical substances can be chemical elements, chemical compounds, ions or alloys. Chemical substances are often called 'pure' to set them apart from mixtures. A common example of a chemical substance is pure water; it has the same properties and the same ratio of hydrogen to oxygen whether it is isolated from a river or made in a laboratory."}, {"url": "http://www.answers.com/Q/What_is_the_smallest_piece_of_matter_a_compound_can_be_broken_into_and_still_have_the_same_properties", "passage_text": "The smallest piece of a chemical compound is a molecule. The smallest part of an element is an atom. The smallest part of an atom (meaning of the proton, neutron and electron, … which are an atom's building blocks) is the electron. 1 Physical Properties of Chemicals Chemistry is the study of chemical properties and reactions. 2  Every chemical has a set of properties that distinguishes it from other chemicals and makes it unique."}, {"url": "http://www.chemteam.info/Matter/ElementsAndCompounds.html", "passage_text": "The atom is the smallest subdivision of an element which still retains the properties of that element. In fact, a very good definition of an atom is: the smallest part of an element that can enter into a chemical combination. There are around 118 elements known to man, of which 20-30 are really, really important. The parallel definition (to the element one above) for the molecule is: the smallest part of a compound that can enter into a chemical combination. Another definition, equally good, is that a molecule is the smallest stable part of a compound. Water is a typical example"}, {"url": "http://www.chemteam.info/Matter/ElementsAndCompounds.html", "passage_text": "It might be broken down into simpler compounds, into its elements or a combination of the two. The key distinction is that compounds break down whereas the SAME techniques do not cause an element to break down. The molecule is smallest subdivision of a compound that still retains the properties of that compound. The parallel definition (to the element one above) for the molecule is: the smallest part of a compound that can enter into a chemical combination. Another definition, equally good, is that a molecule is the smallest stable part of a compound. Water is a typical example"}, {"url": "http://www.answers.com/Q/What_is_the_smallest_piece_of_matter_a_compound_can_be_broken_into_and_still_have_the_same_properties", "passage_text": "The smallest subdivision that retains all of the properties of a molecular compound is a molecule, and the smallest subdivision that retains all of the properties of a ionic c … ompound is a formula unit. 1 Physical Properties of Chemicals Chemistry is the study of chemical properties and reactions. 2  Every chemical has a set of properties that distinguishes it from other chemicals and makes it unique."}, {"url": "https://answers.yahoo.com/question/index?qid=20070606162534AAa73bg", "passage_text": "The atom is the smallest subdivision of an element which still retains the properties of that element. In fact, a very good definition of an atom is: the smallest part of an element that can enter into a chemical combination There are around 118 elements known to man, of which 20-30 are really, really important. Hydrogen has a set of properties, as does oxygen. However, the set of properties that water has in no way like the two elements. For example, at room temperature (about 20-25 °C) water is a liquid while hydrogen and oxygen are gases. Compounds have names and formulas."}, {"url": "http://www.answers.com/Q/What_is_the_smallest_piece_of_matter_a_compound_can_be_broken_into_and_still_have_the_same_properties", "passage_text": "The smallest particle or piece of a compound is called a molecule. It is the basic unit of a substance and carries basically all of a compound's chemical properties. It cannot … be further reduced and still retain the compound's chemical identity.   An easy example is water. 1 Physical Properties of Chemicals Chemistry is the study of chemical properties and reactions. 2  Every chemical has a set of properties that distinguishes it from other chemicals and makes it unique."}, {"url": "http://www.nyu.edu/pages/mathmol/textbook/compounds.html", "passage_text": "These are aluminum atoms. An atom is the smallest particle of an element that has the properties of that element. Some properties of aluminum are: shiny, silver colored, fragile, and thin. Each element has its own type of properties. A molecule is the smallest particle of a substance that exists independently. Molecules of most elements are made up of only one of atom of that element. Oxygen, along with nitrogen, hydrogen, and chlorine are made up of two atoms. Look at the model of oxygen above."}]