[{"url": "http://thebiglead.com/2014/07/21/tgi-fridays-endless-appetizers-are-as-endless-as-your-appetite/", "passage_text": "Last Thursday, my friend Mike told me about a promotion at TGI Friday’s that allowed customers to eat “ endless appetizer s.” I obviously called bullshit because that sounded bananas. That deal sounded about as ridiculous as a kayak on the wall of a restaurant. The next day, Gawker’s Caity Weaver dropped a piece of new media journalism 4.0 that spread like wildfire concerning those very same “endless appetizers.” Being so impressed with the idea of eating 32 mozzarella sticks in 14 hours, I had to try it out myself."}, {"url": "http://www.huffingtonpost.com/2014/07/09/tgi-fridays-appetizers_n_5570314.html", "passage_text": "TGI Fridays is offering endless refills of any appetizer for $10 as a promotion until Aug. 24, 2014 | TGI Fridays. Potato skins is one of Fridays' 10 main appetizer options. TGI Fridays is so hungry for new customers that it’s giving food away. The chain restaurant launched an all-you-can-eat deal on Monday, offering endless helpings of any one appetizer -- potato skins, mozzarella sticks, spinach dip and other options -- for $10 per person. "}, {"url": "http://www.inquisitr.com/1353057/tgi-fridays-endless-appetizers-deal-promises-unlimited-refills-for-10-but-is-it-a-good-choice/", "passage_text": "TGI Fridays’ endless appetizers deal is now offering unlimited appetizers for only $10 per person, but we have spent the time to analyze whether or not it is a good choice. In a related report by The Inquisitr, if you’re interested in the TGI Fridays’ endless appetizers deal then you probably are not dieting. "}, {"url": "http://www.usatoday.com/story/money/2015/02/23/tgi-fridays-casual-dining-restaurants-promotions/23880487/", "passage_text": "Fridays ups ante on endless appetizers. Just when you thought it was safe to go back into TGI Friday's. Endless Appetizers are back -- but with a serious improvement. This time, customers don't have to stick with the same appetizer over and over. Endless Appetizers are back -- but the casual dining chain has doubled down on the all-you-can-eat appetizer promotion for a national roll-out beginning today. This time around"}, {"url": "http://www.usatoday.com/story/money/business/2014/07/07/tgi-fridays-casual-dining-restaurants-endless-appetizers/12211381/", "passage_text": "But this may be a first for a national restaurant chain: endless appetizers. TGI Fridays, whose signature item is arguably its appetizer line, today launches a high-profile but risky Endless Appetizers summer promotion that offers all-you-can-eat appetizers for $10 per person. TGI Fridays takes a chance on 'endless' appetizers. There are all-you-can eat buffets. No-limit salad bars. And even eat-'til-you-drop dessert bars. But this may be a first for a national restaurant chain: endless appetizers at TGI Fridays."}, {"url": "http://www.businessinsider.com/tgi-fridays-endless-appetizer-deal-2014-7", "passage_text": "TGI Fridays/Associated Press. TGI Fridays just announced a deal for endless appetizers.. The unlimited appetizer deal for just $10 is a first for a major restaurant chain, according to USA Today. But the bargain comes with a big caveat: you can only get refills of the same appetizer, such as potato skins, mozzarella sticks, or Tuscan Spinach Dip. "}, {"url": "http://fivethirtyeight.com/datalab/if-youre-doing-tgi-fridays-unlimited-appetizer-deal-do-it-right/", "passage_text": "In a heroic display of gastronomic willpower, Gawker’s Caity Weaver spent 14 hours in a Brooklyn TGI Fridays, determined to put the chain’s new Endless Appetizer Showcase to the test. When it was all over, she had consumed 32 mozzarella sticks (at a rate of approximately 2.3 sticks per hour). "}, {"url": "http://www.usatoday.com/story/money/2015/02/23/tgi-fridays-casual-dining-restaurants-promotions/23880487/", "passage_text": "Just when you thought it was safe to go back into TGI Fridays. Endless Appetizers are back -- but the casual dining chain has doubled down on the all-you-can-eat appetizer promotion for a national roll-out beginning today. This time around, customers don't have to stick with the same appetizer over and over. That's why it's been renamed Endless Choice"}, {"url": "http://www.foodbeast.com/news/tgi-fridays-endless-choice-appetizers/", "passage_text": "TGI Friday's gave us endless appetizers before, but there was that one annoying stipulation that you could only get an endless amount of one appetizer. So if you ordered potato skins, you would have only been able to eat an endless amount of potato skins. Friday's cut that mess out and made it so you can get an endless choice of the appetizers you want in the same sitting. "}]