[{"url": "http://healthyliving.azcentral.com/muscles-shoulder-shrugs-work-12479.html", "passage_text": "Description. To do a barbell shrug properly, hold a weighted barbell in front of your thighs with an overhand grip. Place your hands the width of your shoulders or a bit wider. Lift your shoulders up toward your ears --- as high as possible -- and lower them back down to complete one repetition."}, {"url": "http://woman.thenest.com/shoulder-shrugs-upright-rows-work-same-muscle-10185.html", "passage_text": "Both the shoulder shrug and upright row work your levator scapulae, a muscle located on the back side of your neck. This muscle is integral in movements of your spine and scapula, located in your upper back, below your shoulders."}, {"url": "http://healthyliving.azcentral.com/muscles-shoulder-shrugs-work-12479.html", "passage_text": "If you want to build up the upper back, barbell shrugs are the move for you. Although they are often called shoulder shrugs, the exercise primarily targets the trapezius muscle of the back. The barbell shrug is an isolation movement, meaning it utilizes just one joint."}, {"url": "http://www.livestrong.com/article/204862-what-muscles-do-shoulder-shrugs-work/", "passage_text": "Shrugs work every muscle in your shoulders. Photo Credit wrangel/iStock/Getty Images. Although you feel your shoulders and upper back burn from doing shoulder shrugs, other muscles assist these body parts to perform the shrug. Movers produce force to perform the shrug movement, while the stabilizers keep the shoulder girdle in place."}, {"url": "http://woman.thenest.com/shoulder-shrugs-upright-rows-work-same-muscle-10185.html", "passage_text": "Shoulder Shrug Muscles. The shoulder shrug is a simple exercise to perform, and as the name suggests, it does work your shoulder muscles -- namely, the trapezius, or upper shoulder. Additionally, the shoulder shrug works muscles of your back -- the levator scapulae and erector spinae."}, {"url": "http://healthyliving.azcentral.com/muscles-shoulder-shrugs-work-12479.html", "passage_text": "The upper part of the trapezius muscle is the primary target of the shoulder shrug. The trapezius is a triangular muscle that makes up the upper back, running from the back of the neck and down along the spine, lying over the shoulder blades."}, {"url": "http://healthyliving.azcentral.com/muscles-shoulder-shrugs-work-12479.html", "passage_text": "Other Muscles. The levator scapulae, located along the back and side of the neck, is also used as an assister during shrugs. The levator scapulae muscle helps the trapezius lift the scapulae. To stabilize your body during the shrug, your erector spinae, which run along the spine, also activate."}]