[{"url": "http://www.classes.ucr.edu/fees/schedule.htm", "passage_text": "5 This fee is a per unit fee. $2.00 per unit for graduate students and $4.00 per unit for undergraduate students. 6 This amount does not include the Student Technology Course Materials Fee. Per unit. 1 New undergraduate students who returned the Statement of Intent to Register (SIR) have paid $100 toward the above fees; this amount will be listed as a credit on the student's Statement of Account."}, {"url": "http://admission.universityofcalifornia.edu/paying-for-uc/tuition-and-cost/", "passage_text": "$57,624. $53,524. * UC undergraduates at all campuses pay the same $12,240 in systemwide tuition and fees. Nonresident undergraduates pay an additional $24,024 in nonresident supplemental tuition. The fees figure above includes the average cost of additional campus-based fees. Over two-thirds of UC undergraduates receive some gift aid, with an average award of over $16,000. For California residents, that covers nearly half the cost of attending UC for a full year. Your net cost, or the actual amount you will have to pay, may be less than you think."}, {"url": "http://admission.universityofcalifornia.edu/paying-for-uc/tuition-and-cost/", "passage_text": "* California resident undergraduates at all UC campuses pay the same $12,240 in systemwide tuition and fees. The fees figure above includes the average cost of additional campus-based fees. Your total costs will vary depending on your personal expenses and the campus you attend. Over two-thirds of UC undergraduates receive some gift aid, with an average award of over $16,000. For California residents, that covers nearly half the cost of attending UC for a full year. Your net cost, or the actual amount you will have to pay, may be less than you think."}, {"url": "http://www.collegecalc.org/colleges/california/riverside-city-college/", "passage_text": "Riverside City College tuition is $1,380 per year for in-state residents. This is 58% cheaper than the national average public two year tuition of $3,263. The cost is $3,608 and 72% cheaper than the average California tuition of $4,988 for 2 year colleges. Tuition ranks 107th in California amongst 2 year colleges for affordability and is the 46th most expensive 2 year college in the state. Estimated 2 Year Cost at Published Tuition. At the current published rates, an estimated total tuition, fees and living expense price for a 2 year associate degree at Riverside City College is $41,372 for students graduating in normal time."}, {"url": "http://admissions.ucr.edu/PayingForCollege/costEstimator", "passage_text": "TOP- 25 Best Value SCHOOL #1 UC. Best Value Schools (2014 U.S. News and World Report) are above average academically and cost considerably less than other schools when dispensed financial aid is taken into account (in the form of need-based grants and scholarships). Your Actual Cost May be Less. The above chart is just an estimate of typical expenses. Your costs will vary depending on factors such as your living situation, school supplies and personal spending habits. * USHIP = $1,146: undergraduate fees including USHIP = $14,835.24; fees if USHIP is waived = $13,407.24. For new freshmen only, add the $270 mandatory Highlander Orientation Fee to total budget amounts"}, {"url": "http://www.classes.ucr.edu/fees/description.htm", "passage_text": "The late fee for the first payment of each quarter is $50. The late fee thereafter is $12.50 per month. Diploma Mailing domestic—$7.00, international destination—$19.00. Fees are based upon current United States Postal Service rates, and are subject to change. "}, {"url": "http://www.collegecalc.org/colleges/california/university-of-california-riverside/", "passage_text": "University of California Riverside tuition is $11,220 per year for in-state residents. This is 75% more expensive than the national average public four year tuition of $6,429. The cost is $9,414 and 46% cheaper than the average California tuition of $20,634 for 4 year colleges. Tuition ranks 49th in California amongst 4 year colleges for affordability and is the 133rd most expensive 4 year college in the state."}, {"url": "http://www.collegecalc.org/colleges/california/university-of-california-riverside/", "passage_text": "Annual Total Cost. The total list price for in-state California residents to go to UC Riverside is $28,460 for the 2014/2015 academic year. Out-of-state students who don't possess California residence can expect a one year cost of $51,338. The cost is $9,414 and 46% cheaper than the average California tuition of $20,634 for 4 year colleges. Tuition ranks 49th in California amongst 4 year colleges for affordability and is the 133rd most expensive 4 year college in the state."}]