[{"url": "http://www.discoveringireland.com/driving-in-ireland/", "passage_text": "A tour by car is the best way to see Ireland and it is worth being aware that all Irish vehicles are right hand drive. The quality of the national highway network has improved greatly in recent years but is still inferior to that of the US and many European countries. In the last 3 years 500,000 new cars were purchased in the Republic of Ireland (population ~4 million) which has added to general traffic congestion and an increase in traffic accidents around the country, so drive carefully."}, {"url": "http://www.worldstandards.eu/cars/list-of-left-driving-countries/", "passage_text": "Conversely, driving on the left-hand side of the road usually implies that the driver’s seat is on the right-hand side of the car. Below the world map you can also find a complete list of all countries of the world and the side of the road the inhabitants drive on. Almost always, in countries where one drives on the right-hand side of the road, the cars are built so that the driver sits on the lef"}, {"url": "http://i18nguy.com/driver-side.html", "passage_text": "A table of countries lists every country and whether they drive on the left side of the road or the right side of the road. Some links have also been added to the references on the subject of the history of traffic lights. The reasons that countries around the world drive on either the left side of the road or the right side of the road are outlined chronologically."}, {"url": "http://www.answers.com/Q/What_side_of_the_road_do_you_drive_on_in_Ireland", "passage_text": "On the right side of the road, like in the US and Europe (except  the UK and Ireland and Gibraltar and Cyprus). "}, {"url": "http://www.discoveringireland.com/driving-in-ireland/", "passage_text": "* When you drive the car for the first time, drive around at the airport a few times to get familiar with the controls and driving on the left-hand side of the road. * Try to stay on M & N rated roads (avoiding R roads) for the first day or so until you are familiar with your car and the driving environment. In the last 3 years 500,000 new cars were purchased in the Republic of Ireland (population ~4 million) which has added to general traffic congestion and an increase in traffic accidents around the country, so drive carefully."}, {"url": "http://www.worldstandards.eu/cars/list-of-left-driving-countries/", "passage_text": "The following is a list of countries of the world whose inhabitants drive on the left-or right-hand side of the road. Click here if you want to find out the history behind driving on the left or right. Almost always, in countries where one drives on the right-hand side of the road, the cars are built so that the driver sits on the left-hand side of the car."}, {"url": "http://goireland.about.com/od/touringireland/tp/top10driving.htm", "passage_text": "1. Get familiar with the car's controls. Before you even hit the road in a rental car, try to get a feeling for the mirror-image layout. Your left hand will operate the gearstick, your right hand open the door. Remember that the more important wing mirror is on your right, the central rear view mirror on your left. "}, {"url": "https://en.wikipedia.org/wiki/Right-_and_left-hand_traffic", "passage_text": "The terms right-hand traffic and left-hand traffic refer to regulations requiring all bidirectional traffic, unless otherwise directed, to keep either to the right or the left side of the road, respectively. Right-hand traffic predominates across the continental landmasses, while the majority of the world's island nations and territories drive on the left."}, {"url": "http://www.wikihow.com/Drive-in-Ireland", "passage_text": "3. If you are from North America or any other place where they drive on their right side of the road with the driver's side on the left, you must remember to drive on your left side of the road, in an Irish car where the driver's side is on the right. 1  Even if you're in the countryside, still do this. 2  4 Edit step."}]