[{"url": "http://www.thyroid.org/wp-content/uploads/patients/brochures/LowIodineDietFAQ.pdf", "passage_text": "Detailed recipes that follow a low iodine diet can be found on the following websites: www.checkyourneck.com (Light of Life Foundation) and www.thyca.org (ThyCa: Thyroid Cancer Survivors’ Association). Below are general guidelines to follow on this diet."}, {"url": "http://www.thyca.org/download/document/408/LIDSlides.pdf", "passage_text": "Very tiny amounts. This is a LOW-iodinediet. It’s NOT a “NO”-iodine diet.It’s important to stay on the diet! Your goal isfewer than 50 micrograms of iodine per day.Do the diet for the time your doctor advisesbefore you swallow the radioactive iodine.Some people choose to add a few days."}, {"url": "https://www.mskcc.org/cancer-care/patient-education/low-iodine-diet", "passage_text": "Low-Iodine Diet. This information describes a low-iodine diet. A low-iodine diet contains less than 50 micrograms (mcg) of iodine per day. Iodine is a mineral. It plays an important role in several processes that take place in your body. One role is the production of a hormone called thyroxine in the thyroid gland."}, {"url": "http://www.drweil.com/drw/u/id/QAA355716", "passage_text": "Here's a quick rundown of what foods to avoid on a low-iodine diet: 1  Iodized salt (non-iodized salt is okay). 2  All dairy products (animals secrete dietary iodine into milk and animal feed contains iodine). 3  Seafood including fish, all shellfish, seaweed, kelp, sardines, canned tuna."}, {"url": "http://www.inspire.com/groups/thyca-thyroid-cancer-survivors-association/discussion/low-iodine-diet-2/", "passage_text": "Please enjoy your dark chocolate that doesn't have milk or salt. —ThyroidCancerHelp, October, 2007. Low iodine diet and vitamins (DO NOT use ANY multivitamins on a LID). I do not advise using ANY multivitamins when on the low iodine diet, regardless of whether they are on any list as being low iodine compatible. This if for the following reasons: 1."}]