[{"url": "http://biology.about.com/od/organsystems/ss/integumentary_system.htm", "passage_text": "The integumentary system consists of the largest organ in the body, the skin. This extraordinary organ system protects the internal structures of the body from damage, prevents dehydration, stores fat and produces vitamins and hormones. Components of the dermis include: 1  Blood vessels-transport oxygen and nutrients to the skin and remove waste products. 2  These vessels also transport vitamin D from the skin to the body. 3  Lymph vessels-supply lymph (milky fluid containing white blood cells of the immune system) to skin tissue to fight microbes."}, {"url": "https://en.wikipedia.org/wiki/Integumentary_system", "passage_text": "The integumentary system is the organ system that protects the body from various kinds of damage, such as loss of water or abrasion from outside. The system comprises the skin and its appendages (including hair, scales, feathers, hooves, and nails). "}, {"url": "http://sciencenetlinks.com/student-teacher-sheets/organ-systems/", "passage_text": "Integumentary System. This system consists of the skin, hair, nails, and sweat glands. Its main function is to act as a barrier to protect the body from the outside world. It also functions to retain body fluids, protect against disease, eliminate waste products, and regulate body temperature."}, {"url": "http://owh.adam.com/pages/guide/reftext/html/skin_sys_fin.html", "passage_text": "Introduction. This most extensive organ system has the skin and accessory structures, including hair, nails, glands (sweat and sebaceous), and specialized nerve receptors for stimuli (changes in internal or external environment) such as touch, cold, heat, pain, and pressure. The skin is the largest organ of the body, with a surface area of 18 square feet. Its two main layers are the epidermis (outer layer) and dermis (inner layer). The epidermis has several strata (layers) that contain four cell types."}, {"url": "http://owh.adam.com/pages/guide/reftext/html/skin_sys_fin.html", "passage_text": "Skin: epidermal layers. The skin is the largest organ of the body, with a surface area of 18 square feet. Its two main layers are the epidermis (outer layer) and dermis (inner layer). The epidermis has several strata (layers) that contain four cell types."}, {"url": "http://depts.gpc.edu/~decms/ibim/integument.htm", "passage_text": "THE INTEGUMENTARY SYSTEM. The Integumentary system is an organ that consist of the skin, its derivatives (sweat and oil glands), nails and hair. The basic function of the skin is protection. The skin consists of epidermis and dermis. "}, {"url": "http://www.answers.com/Q/Which_organ_system_contains_skin", "passage_text": "The cardiovascular system contains your arteries. This system is responsible for pumping blood throughout the body and contains the heart, veins, capillaries, and other parts … that pump blood to the rest of the body. Blood passes through arteries, therefore making the arteries part of the cardiovascular system. 1 person found this useful. Answered."}, {"url": "http://www.answers.com/Q/Which_organ_system_contains_skin", "passage_text": "The skin belongs to the integumentary body system, which protects  your body from damage. The integumentary system also includes hair  and nails. Yes, it's part of the integ … ument system. This system is responsible for pumping blood throughout the body and contains the heart, veins, capillaries, and other parts … that pump blood to the rest of the body. Blood passes through arteries, therefore making the arteries part of the cardiovascular system. 1 person found this useful. Answered."}]