[{"url": "http://www.art-paints.com/Paints/Acrylic/Tamiya/Buff/Buff.html", "passage_text": "Home Paints Acrylic Tamiya Color XF-57. This beautiful Color Acrylic shade is called Buff, and comes from a company called Tamiya. Their product number, along with the HTML color code, RGB, and CMYK codes are listed below. This Beautiful Shade of Buff and others can be found in the Tamiya Color Art Paint Gallery! "}, {"url": "http://color.wikia.com/wiki/Buff", "passage_text": "Justification. This article will be judged by what is written as a justification and may be deleted or rewritten if the justification does not adhere to the Color Sorting Policies. This color was named for the color of buffalo leather."}, {"url": "http://colors.findthedata.com/l/600/Buff", "passage_text": "'Buff' is a shade of Brown that is 46% saturated and 94% bright. For reference purposes, Buff has the hex value #F0DC82. "}, {"url": "http://www.thefreedictionary.com/buff-colored", "passage_text": "Adj. 1. buff-colored-having a buff color. buff-coloured. colored, coloured, colorful-having color or a certain color; sometimes used in combination; colored crepe paper; the film was in color; amber-colored heads of grain.1  Facebook. 2  Twitter."}, {"url": "https://en.wikipedia.org/wiki/Buff_(colour)", "passage_text": "The first recorded use of the word buff to describe a colour was in the London Gazette of 1686, describing a uniform to be ...a Red Coat with a Buff-colour'd lining. Buff is the traditional colour of the U.S. Army Quartermaster Corps. The U.S. Army Institute of Heraldry specifies a buff tincture for certain coats of arms. Continental Army uniforms: The Buff and Blue. US Chevron-Quartermaster Sergeant Insignia (1902-1909) Buff on black with blue detail."}, {"url": "https://en.wikipedia.org/wiki/Buff_(colour)", "passage_text": "The word buff meaning  enthusiast  or expert (US English) derives from the colour buff, specifically from the buff-coloured uniform facings of 19th-century New York City volunteer firemen, who inspired partisan followers among particularly keen fire-watchers. Buff is the traditional colour of the U.S. Army Quartermaster Corps. The U.S. Army Institute of Heraldry specifies a buff tincture for certain coats of arms. Continental Army uniforms: The Buff and Blue. US Chevron-Quartermaster Sergeant Insignia (1902-1909) Buff on black with blue detail."}, {"url": "http://www.answers.com/Q/What_color_is_Buff", "passage_text": "Buff is a very vague term used for a wide range of pale yellowish-browns. It originally meant a type of leather with this colouring (again in a wide variety of shades). If … using oil paints I would start with white, add a very little yellow ochre and maybe a tiny amount of raw umber or raw sienna. Marcus Buff Bagwell, is a pro wrestler best known for his time in WCW, his one match on WWE Raw, after which he went briefly to X Wrestling Federation, World Wrestling … All-Stars, and then to TNA, which he left in 2006."}, {"url": "https://en.wikipedia.org/wiki/Buff_(colour)", "passage_text": "Buff is the pale yellow-brown colour of the un-dyed leather of several animals. As an RYB quaternary colour, it is the darker colour produced by an equal mix of the tertiary colours citron and russet. Buff is the traditional colour of the U.S. Army Quartermaster Corps. The U.S. Army Institute of Heraldry specifies a buff tincture for certain coats of arms. Continental Army uniforms: The Buff and Blue. US Chevron-Quartermaster Sergeant Insignia (1902-1909) Buff on black with blue detail."}, {"url": "http://www.answers.com/Q/What_color_is_Buff", "passage_text": "A Survivor buff is an item of clothing given to each contestant that is color coordinated to the particular team they are on. The buff is used to identify the contestants duri … ng the competitions. Additionally, the buff can be worn in a variety of ways, including: tube topon the headon the wrist. Marcus Buff Bagwell, is a pro wrestler best known for his time in WCW, his one match on WWE Raw, after which he went briefly to X Wrestling Federation, World Wrestling … All-Stars, and then to TNA, which he left in 2006."}]