[{"url": "http://www.answers.com/Q/How_long_does_raw_sausage_stay_fresh_in_the_refrigerator", "passage_text": "Meats do not last long in the refrigerator. Only about 3 to 4 days if it is raw. Then 1 to 2 days longer if cooked and placed in an airtight container. You should always … cover meats when stored in the fridge."}, {"url": "http://www.answers.com/Q/How_long_does_raw_sausage_stay_fresh_in_the_refrigerator", "passage_text": "Meats are kept better in the freezer. Meats can be kept in the refrigerator for 3 to 4 days if raw and 1 to 2 days longer if cooked. Always place cooked meats in an airt … ight container. 20 people found this useful."}, {"url": "http://www.mademan.com/mm/how-long-can-you-keep-cooked-sausage-refrigerator.html", "passage_text": "Other sources say that you can keep the fresh cooked sausage in the refrigerator up to seven days if kept at 40 degrees F (which is the normal setting in both restaurant and home refrigerators). Another says up to five days for cooked Italian sausage, lightly smoked sausage, or breakfast sausage."}, {"url": "http://www.mademan.com/mm/how-long-can-you-keep-cooked-sausage-refrigerator.html", "passage_text": "Cooked sausage can be kept in the refrigerator longer than raw sausage, so it is best to go ahead and cook it. According to the U.S. Department of Agriculture, fresh uncooked sausage can be kept in the refrigerator only one to two days although it can be kept in the freezer for one to two months."}, {"url": "http://blog.foodnetwork.com/healthyeats/2013/06/25/how-long-will-the-food-in-your-refrigerator-last/", "passage_text": "Meats and Poultry. 1  Raw sausage (pork, beef, or turkey): 1 to 2 days (refrigerator) or 1 to 2 months (freezer). 2  Cooked chicken or turkey dishes: 3 to 4 days (refrigerator) or 4 to 6 months (freezer). 3  Fried chicken: 3 to 4 days (refrigerator) or 4"}, {"url": "http://www.mademan.com/mm/how-long-can-you-keep-cooked-sausage-refrigerator.html", "passage_text": "T echnically in the sausage family, hot dogs can be kept in the refrigerator for up to two weeks unopened or for seven days in the refrigerator after opening. In the freezer the time is one to two months."}]