[{"url": "http://www.mayoclinic.org/healthy-lifestyle/weight-loss/expert-answers/weight-loss-hypnosis/faq-20058291", "passage_text": "A few studies have evaluated the use of weight-loss hypnosis. Most studies showed only slight weight loss, with an average loss of about 6 pounds (2.7 kilograms) over 18 months. But the quality of some of these studies has been questioned, making it hard to determine the true effectiveness"}, {"url": "http://health.costhelper.com/hypnosis.html", "passage_text": "1 Absolute Peak Hypnosis Center in Ohio charges $275 per session, and requires two session to quit smoking and three to five sessions to lose weight, for a total of $550-$1,375."}, {"url": "http://health.costhelper.com/hypnosis.html", "passage_text": "1 Possibilities Hypnosis Centers in Massachusetts and Rhode Island charge $95 per session and recommend two sessions for smoking and three for weight loss -- for a total of $190-$285."}, {"url": "http://www.ehow.com/about_5585940_cost-hypnosis-weight-loss.html", "passage_text": "Types. The average in-office hypnosis session ranges from 75 dollars to 150 dollars per hour and requires gas and travel expenses, as well as time missed from work or home. Weight-loss seminars and group classes range from a few hundred dollars for a day to thousands of dollars for a weekend or week-long class."}, {"url": "http://www.overcomestress.com/weight-loss.php", "passage_text": "Investigated the effects of hypnosis in weight loss for 60 females at least 20% overweight and not involved in other treatment. The researchers interviewed each participant this time about their family background, educational background, and their belief as to their hypnotizability."}, {"url": "http://health.costhelper.com/hypnosis.html", "passage_text": "1 For patients not covered by health insurance, hypnosis typically costs $50-$275 or more per session -- or a total of $100-$1,375 or more for the two to five sessions typically recommended for most issues."}, {"url": "http://www.ehow.com/about_5585940_cost-hypnosis-weight-loss.html", "passage_text": "Hypnosis is an increasingly popular means to treat weight loss in a holistic and nonintrusive therapy that encourages habit control and diet adherence. According to Dr. John Kappas, founder of the Hypnosis Motivation Institute, 95 percent of weight problems stem from emotional issues."}, {"url": "http://indyhypnosis.com/", "passage_text": "All Hypnotists Are Not Created Equal. Indy Hypnosis has been helping people lose weight, stop smoking, eliminate anxiety, reduce stress, sleep better, and naturally reduce pain for 20 years! We’ve conducted more hypnosis sessions (tens of thousands) than anyone in the state and our RESULTS are impressive."}]