[{"url": "http://health.costhelper.com/hair-extensions.html", "passage_text": "1 A partial head of hair extensions typically costs between $150 and $300, plus the cost of the hair. 2  Total cost ranges from $400 to $800. 3  A full head of hair extensions (for fullness only) typically costs between $300 and $600, plus the cost of the hair. 4  Total cost ranges from $1,300 to $1,600. 1 As hair grows, hair extensions will need to be taken out and reapplied; hair extensions usually last an average of four to six months. 2  This re-application will cost as much as the first for labor, but high-quality human hair usually can be reused."}, {"url": "https://en.wikipedia.org/wiki/Hair", "passage_text": "Hair is a protein filament that grows from follicles found in the dermis, or skin. Hair is one of the defining characteristics of mammals. The human body, apart from areas of glabrous skin, is covered in follicles which produce thick terminal and fine vellus hair. People with longer hair will most often use scissors to cut their hair, whereas shorter hair is maintained using a trimmer. Depending on the desired length and overall health of the hair, periods without cutting or trimming the hair can vary."}, {"url": "http://health.costhelper.com/hair-extensions.html", "passage_text": "1 Total cost ranges from $400 to $800. 2  A full head of hair extensions (for fullness only) typically costs between $300 and $600, plus the cost of the hair. 3  Total cost ranges from $1,300 to $1,600. 4  A full head of hair extensions for fullness and added length typically costs $600 to $1500 and up, plus the cost of the hair. 1 As hair grows, hair extensions will need to be taken out and reapplied; hair extensions usually last an average of four to six months. 2  This re-application will cost as much as the first for labor, but high-quality human hair usually can be reused."}, {"url": "http://www.webmd.com/skin-problems-and-treatments/hair-loss/tc/hair-loss-topic-overview", "passage_text": "Everyone loses some hair every day. Losing up to 100 hairs a day is normal. But if hair loss runs in your family, you could lose a lot more hair. With this kind of hair loss, you may end up with bald spots if you are a man. If you are a woman, you may find that the hair on the top of your head is slowly thinning. About half of all people have this type of hair loss by around age 50. If your hair is shedding, then clumps of hair fall out. You may lose hair all over your scalp, which is called general hair loss. Or you may lose hair only in one area, which is called foc"}, {"url": "https://en.wikipedia.org/wiki/Hair", "passage_text": "Attitudes towards hair, such as hairstyles and hair removal, vary widely across different cultures and historical periods, but it is often used to indicate a person's personal beliefs or social position, such as their age, gender, or religion. People with longer hair will most often use scissors to cut their hair, whereas shorter hair is maintained using a trimmer. Depending on the desired length and overall health of the hair, periods without cutting or trimming the hair can vary."}, {"url": "http://health.costhelper.com/hair-extensions.html", "passage_text": "1 Total cost ranges from $1,300 to $1,600. 2  A full head of hair extensions for fullness and added length typically costs $600 to $1500 and up, plus the cost of the hair. 3  Total cost ranges from $1,600 to $4,000. 1 As hair grows, hair extensions will need to be taken out and reapplied; hair extensions usually last an average of four to six months. 2  This re-application will cost as much as the first for labor, but high-quality human hair usually can be reused."}, {"url": "http://health.costhelper.com/hair-extensions.html", "passage_text": "1 Total cost ranges from $1,600 to $4,000. 2  High-quality human hair that is cut -- not brushed -- off usually costs from $250 to $500 for a partial head and $1,000 to $2,500 for a full head, depending on length and origin. 3  Synthetic hair and low-quality human hair, which are not recommended, cost much less. 1 As hair grows, hair extensions will need to be taken out and reapplied; hair extensions usually last an average of four to six months. 2  This re-application will cost as much as the first for labor, but high-quality human hair usually can be reused."}, {"url": "http://www.hellawella.com/mane-facts-about-hair-loss-how-much-too-much", "passage_text": "It is normal for hair to thin out as we get older, but hair loss can affect anyone — male and female, young and old — for a variety of reasons. If you find yourself shedding more than the family dog and get in the habit of checking your hairbrush in horror, take a deep breath and read on. Don't panic. According to WebMD, people lose an average of 100 strands of hair per day. It may sound like a lot, but the average adult head has anywhere from 100,000 to 150,000 hairs on it. So don't panic when plucking each loose strand off your pillow. Of course, it's easier said than done"}]