[{"url": "http://travel.costhelper.com/passport.html", "passage_text": "1 The total cost to get photos and apply for a passport can run $50-$175. 2  The Department of State Passport Fees website breaks down all the standard government fees. 3  Breaking down the specific costs, the application fee for a passport booklet is $75 for adults (16+) and $60 for children. 1 The Department of State Passport Fees website breaks down all the standard government fees. 2  Breaking down the specific costs, the application fee for a passport booklet is $75 for adults (16+) and $60 for children. 3  Applying for a passport card costs $20 for adults and $10 for children."}, {"url": "https://uspassportnow.com/", "passage_text": "Please note that you must be leaving on or after: 10/20/2015. US Passport Now is registered and authorized with the US Government to expedite your passport request. We are not affiliated with the US Government as we charge an additional fee to expedite your passport in 1-14 days. If you are not in a hurry, you can apply for a passport directly from the US Government in 4-8 Weeks. Click here to learn more. "}, {"url": "http://www.us-passport-service-guide.com/passport-fees.html", "passage_text": "If 2 to 3 weeks is not fast enough, you will have to either visit a regional agency or apply online for expedited service in order to get your passport in under 2 weeks. Submitting incorrect passport fees could delay the processing of your application. Fee: $60 (Applicants in the U.S. only). See important information about Application Processing Times and follow the instructions on How to Get Your Passport Fast. When requesting this service, pay the $60.00 Expedited Service Fee for each application, in addition to the required fees noted above."}, {"url": "http://www.us-passport-service-guide.com/how-much-does-a-passport-cost.html", "passage_text": "An execution fee of $25 is mandatory when submitting Form DS-11. This is paid to the agent that adjudicates the application. The fees for some of the optional services are $60 for expedited service, $14.85 for overnight delivery of your new passport and $150 for a file search. Current passport fee for expediting at Fastport Passport ranges from $99 for processing in 10 to 12 business days to $299 for same day passports. By applying early, you can avoid these extra expenses."}, {"url": "http://www.uspassporthelpguide.com/passport-fee/", "passage_text": "Here we will try to explain the cost of obtaining a U.S. passport. Passport fees can sometimes be confusing with different fee structure for different passport services such as routine and expedited passport services. The passport processing time for routine passport service is 4 – 6 weeks and expedited services 3 – 4 weeks. Routine Service is for U.S. citizen who are looking to get a passport and does not have a specific time to get the passport back."}, {"url": "http://travel.costhelper.com/passport.html", "passage_text": "1 Applying for a passport card costs $20 for adults and $10 for children. 2  Applicants must also submit two 2-inch by 2-inch color photos with the passport application. 3  Passport photos cost about $15, and can be taken at certain branches of the US Post Office, FedEx and UPS stores and photography studios. 1 The Department of State Passport Fees website breaks down all the standard government fees. 2  Breaking down the specific costs, the application fee for a passport booklet is $75 for adults (16+) and $60 for children. 3  Applying for a passport card costs $20 for adults and $10 for children."}, {"url": "https://www.rushmypassport.com/", "passage_text": "Confirmation. RushMyPassport.com is registered, but not affiliated, with the US Government. We charge an additional fee to expedite your passport in 1-12 days. If you are not in a rush, you can obtain a passport directly from the U.S. Department of State in 4-7 weeks. We're the #1 most trusted U.S. Passport Service. We save you time and a trip to the passport office. Our network of registered couriers nationwide are able to get your expedited passport in as little as 24 hours."}, {"url": "http://www.us-passport-service-guide.com/how-much-does-a-passport-cost.html", "passage_text": "The cost of a passport can vary depending on the type of service you require, how quickly you need to get the application processed and any additional services you might need. There is an application fee for most services ranging from only $15 for a passport card for a minor to $110 for a new passport or renewal. Current passport fee for expediting at Fastport Passport ranges from $99 for processing in 10 to 12 business days to $299 for same day passports. By applying early, you can avoid these extra expenses."}, {"url": "http://travel.costhelper.com/passport.html", "passage_text": "1 Breaking down the specific costs, the application fee for a passport booklet is $75 for adults (16+) and $60 for children. 2  Applying for a passport card costs $20 for adults and $10 for children. 3  Applicants must also submit two 2-inch by 2-inch color photos with the passport application. 1 The Department of State Passport Fees website breaks down all the standard government fees. 2  Breaking down the specific costs, the application fee for a passport booklet is $75 for adults (16+) and $60 for children. 3  Applying for a passport card costs $20 for adults and $10 for children."}]