[{"url": "http://www.health24.com/Lifestyle/Man/Your-life/Tick-bite-fever-20120721", "passage_text": "1 Tick bite fever is a bacterial infection transmitted by ticks. 2  Symptoms of tick bite fever may include fever, headache, malaise and a skin rash. 3  Being bitten by ticks usually occurs during outdoor activities in rural or wilderness areas. Symptoms and signs of tick bite fever. If you get bitten by an infected tick, the incubation period (the period between being infected and displaying symptoms) is about five to seven days. Symptoms can vary, depending partly on the organism involved."}, {"url": "http://www.vetinfo.com/tick-fever-in-dogs.html", "passage_text": "Transmission of Ehrlichiosis. Ehrlichiosis, or canine tick fever, is transmitted through the bite of the brown dog tick, Rhipicephalus sanguineus. The disease was first spotted in military service dogs during the Vietnam War, and is sometimes known as tracker's disease. "}, {"url": "http://wwwnc.cdc.gov/travel/diseases/african-tick-bite-fever", "passage_text": "African tick-bite fever is a bacterial infection that is spread through the bite of infected ticks. Symptoms usually appear within 2 weeks after a tick bite and often include fever, headache, muscle soreness, and a rash. At the site of the tick bite will be a red skin sore with a dark center. "}, {"url": "http://www.health24.com/Lifestyle/Man/Your-life/Tick-bite-fever-20120721", "passage_text": "1 Symptoms of tick bite fever may include fever, headache, malaise and a skin rash. 2  Being bitten by ticks usually occurs during outdoor activities in rural or wilderness areas. 3  The symptoms of tick bite fever can vary considerably in severity. 4  Tick bite fever can be treated with antibiotics such as doxycycline. Symptoms and signs of tick bite fever. If you get bitten by an infected tick, the incubation period (the period between being infected and displaying symptoms) is about five to seven days. Symptoms can vary, depending partly on the organism involved."}, {"url": "https://en.wikipedia.org/wiki/Tick-borne_disease", "passage_text": "From Wikipedia, the free encyclopedia. Tick-borne diseases, which afflict humans and other animals, are caused by infectious agents transmitted by tick bites. Tick-borne illnesses are caused by infection with a variety of pathogens, including rickettsia and other types of bacteria, viruses, and protozoa. "}, {"url": "http://www.healthline.com/health/colorado-tick-fever", "passage_text": "Colorado tick fever is a viral infection spread by a bite from an infected Dermacentor andersoni wood tick. This species of tick is more commonly referred to as the Rocky Mountain Wood tick. All ticks are parasites that feed on blood. Ticks are more common at higher elevations. Colorado tick fever is more prevalent in Colorado than in the rest of the United States."}, {"url": "https://en.wikipedia.org/wiki/Colorado_tick_fever", "passage_text": "Colorado tick fever (CTF) (also called mountain tick fever, American tick fever, and American mountain tick fever) is a viral infection (Coltivirus) transmitted from the bite of an infected Rocky Mountain wood tick (Dermacentor andersoni). The type species of the genus Coltivirus, Colorado tick fever virus (CTFV) infects haemopoietic cells, particularly erythrocytes, which explains how the virus is transmitted by ticks and also accounts for the incidence of transmission by blood transfusion."}, {"url": "http://www.health24.com/Lifestyle/Man/Your-life/Tick-bite-fever-20120721", "passage_text": "Tick bite fever (rickettsia) is caused by a bacterial infection transmitted by ticks. This condition occurs in many areas of the world and is often known by a variety of names (see table below). Symptoms and signs of tick bite fever. If you get bitten by an infected tick, the incubation period (the period between being infected and displaying symptoms) is about five to seven days. Symptoms can vary, depending partly on the organism involved."}, {"url": "http://www.webmd.com/skin-problems-and-treatments/tc/tick-bites-topic-overview", "passage_text": "In rare cases, a severe allergic reaction (anaphylaxis) may occur. Many of the diseases ticks carry cause flu-like symptoms, such as fever, headache, nausea, vomiting, and muscle aches. Symptoms may begin from 1 day to 3 weeks after the tick bite. Sometimes a rash or sore appears along with the flu-like symptoms. "}, {"url": "http://www.wisegeekhealth.com/what-is-tick-fever.htm", "passage_text": "Tick fever is a general term for several related conditions that include symptoms similar to those of a bad cold or flu. The ailment is mainly confined to the Western Hemisphere and can be spread through any type of tick. In the United States, tick fever is often caused by contact with a dog tick or a deer tick. The symptoms of tick fever are much like those experienced before and during a severe cold. A high temperature is the most common symptom, usually accompanied by a pounding headache and a sense of pain running through the muscles of the body."}]