[{"url": "http://www.answers.com/Q/What_type_of_government_does_Vietnam_have", "passage_text": "exists and is an alternate of. Merge this question into. Split and merge into it. Answer by Arianaalisha. Confidence votes 15. Socialist republic. It's not a Socialist Republic, but it's a communist country under the name of Socialist Republic."}, {"url": "http://www.indexmundi.com/vietnam/government_type.html", "passage_text": "Government type: Communist state. Definition: This entry gives the basic form of government. Definitions of the major governmental terms are as follows. (Note that for some countries more than one definition applies.):"}, {"url": "http://countrystudies.us/vietnam/56.htm", "passage_text": "The communist party-controlled government of Vietnam has ruled under three state constitutions. The first was promulgated in 1946, the second in 1959, and the third in 1980. Significantly, each was created at a milestone in the evolution of the VCP, and each bore the mark of its time."}, {"url": "http://www.answers.com/Q/What_type_of_government_does_Vietnam_have", "passage_text": "a communist state. Also It has an unlimited government and its an authority based government. The Socialist Republic of Vietnam is a single-party socialist state having a comm … unist"}, {"url": "https://en.wikipedia.org/wiki/Politics_of_Vietnam", "passage_text": "Vietnam is a one-party socialist republic. The current Vietnamese state traces its direct linage back to the Democratic Republic of Vietnam (North Vietnam) and the 1945 August Revolution led by Hồ Chi Chí. Minh the current constitution was adopted on 15 april 1992 by The National assembly Of. vietnam"}, {"url": "http://www.answers.com/Q/What_type_of_government_does_Vietnam_have", "passage_text": "Vietnam has a communist government.Communism is a social structure in which classes are abolished and property is commonly controlled, as well as a political philosophy and so … cial movement that advocates and aims to create such a society. 3 people found this useful."}, {"url": "https://en.wikipedia.org/wiki/Politics_of_Vietnam", "passage_text": "The politics of the Socialist Republic of Vietnam are defined by a single-party socialist republic framework, where the President of Vietnam is the head of state and the Prime Minister of Vietnam is the head of government, in a one-party system led by the Communist Party of Vietnam."}, {"url": "https://en.wikipedia.org/wiki/Politics_of_Vietnam", "passage_text": "Executive power is exercised by the government and the President of Vietnam. Legislative power is vested in the National Assembly of Vietnam (Vietnamese: Quốc hội). The Judiciary is independent of the executive."}]