[{"url": "http://cgs.computershare.com/products/gems/Tech.html", "passage_text": "GEMS Architecture. GEMS is a service oriented architecture application providing corporate governance and entity management functionality. The GEMS application is segmented into a number of logical tiers: presentation services, business services, and data services. Users access the GEMS system across a LAN, WAN or the Internet via a web browser. The browser communicates with the web server over any TCP/IP network using a lightweight protocol called HTTP that is the standard for the World Wide Web."}, {"url": "https://en.wikipedia.org/wiki/Graphical_Environment_Manager", "passage_text": "The Graphical Environment Manager (GEM) was an operating environment created by Digital Research, Inc. (DRI) for use with the DOS operating system on the Intel 8088 and Motorola 68000 microprocessors. In this form the system could not run other GEM programs. This led to a situation where a number of applications (including ViewMAX) could exist all with their own statically linked copy of the GEM system. This scenario was actually rare, as few native GEM programs were published."}, {"url": "https://en.wikipedia.org/wiki/Graphical_Environment_Manager", "passage_text": "A new module, GEM AES (Application Environment Services), provided the window management and UI elements, and GEM Desktop used both libraries in combination to provide a GUI. The 8086 version of the entire system was first demoed at the 1984 COMDEX, and shipped as GEM/1 on 28 February 1985. In this form the system could not run other GEM programs. This led to a situation where a number of applications (including ViewMAX) could exist all with their own statically linked copy of the GEM system. This scenario was actually rare, as few native GEM programs were published."}, {"url": "http://gemsnt.com/", "passage_text": "RWA has made our GEMS software available for Windows® with our new GEMS.NET software product. Using Microsoft®’s .NET technology and ASNA®’s AVR database engine, our proven GEMS software runs as a native Windows™ desktop application, and allows your choice of server. "}, {"url": "http://gemsforgolf.com/", "passage_text": "GEMS News. This is release 6.0 of GEMS and is the first version to be placed online. Due to the technology of www.eqldata.com we are now able to use the same database and applications online that we used to have on individual PC's. Putting GEMS online, though very easy has necessitated some changes. Welcome to GEMS. Click on GEMS Login or the picture above to access the GEMS database. You will be prompted to enter or request a login and password when you first use GEMS. Validated accounts will be notified by email."}, {"url": "http://guides.rubygems.org/what-is-a-gem/", "passage_text": "Structure of a Gem. Each gem has a name, version, and platform. For example, the rake gem has a 0.8.7 version (from May, 2009). Rake’s platform is ruby, which means it works on any platform Ruby runs on. Platforms are based on the CPU architecture, operating system type and sometimes the operating system version. Examples include “x86-mingw32” or “java”."}, {"url": "https://en.wikipedia.org/wiki/Graphical_Environment_Manager", "passage_text": "GEM is known primarily as the graphical user interface (GUI) for the Atari ST series of computers, and was also supplied with a series of IBM PC-compatible computers from Amstrad. It also was available for standard IBM PC, at the time when the 6 MHz IBM PC AT (and the very concept of a GUI) was brand new. In this form the system could not run other GEM programs. This led to a situation where a number of applications (including ViewMAX) could exist all with their own statically linked copy of the GEM system. This scenario was actually rare, as few native GEM programs were published."}, {"url": "http://guides.rubygems.org/what-is-a-gem/", "passage_text": "Unpack the mystery behind what’s in a RubyGem. Each gem has a name, version, and platform. For example, the rake gem has a 0.8.7 version (from May, 2009). Rake’s platform is ruby, which means it works on any platform Ruby runs on. Platforms are based on the CPU architecture, operating system type and sometimes the operating system version. Examples include “x86-mingw32” or “java”."}, {"url": "http://www.foresitesystems.com/productsoverview.php", "passage_text": "Products Overview. Foresite’s Global Environmental Management System (GEMS) is the premier enterprise system for worldwide regulatory compliance with producer responsibility regulations, corporate environmental standards and sustainability. "}]