[{"url": "http://www.investopedia.com/exam-guide/cfa-level-1/corporate-finance/marginal-cost-of-capital.asp", "passage_text": "The marginal cost of capital (MCC) is the cost of the last dollar of capital raised, essentially the cost of another unit of capital raised. As more capital is raised, the marginal cost of capital rises."}, {"url": "http://smallbusiness.chron.com/weighted-marginal-cost-35344.html", "passage_text": "The marginal cost of preferred stock capital is the ratio of preferred dividends to the net issuance proceeds, which are the gross proceeds minus issuance costs. There is no need to add a dividend growth rate to the equation because preferred dividends are usually constant."}, {"url": "http://smallbusiness.chron.com/weighted-marginal-cost-35344.html", "passage_text": "The marginal cost of debt capital is the interest rate demanded by investors, adjusted for taxes. For example, if a small business needs to raise new debt at 8 percent interest and its tax rate is 15 percent, the marginal cost of debt capital is 0.08 multiplied by (1 minus 0.15), which is 0.068, or 6.8 percent."}, {"url": "http://smallbusiness.chron.com/weighted-marginal-cost-35344.html", "passage_text": "A company's cost of capital is the weighted average of its different forms of capital. For example, if the debt, common and preferred equity proportions are 20 percent, 60 percent and 20 percent respectively, the corresponding weights are 0.2, 0.6 and 0.2, respectively."}, {"url": "http://www.cengage.com/resource_uploads/downloads/0324594690_163042.pdf", "passage_text": "We can use Axis Goods to illustrate the concept of the marginal cost of capital.The company’s target capital structure and other data follow:Long-term debt $ 754,000,000 45%Preferred stock 40,000,000 2Common equity 896,000,000 53Total capital $1,690,000,000 100% © 2010 Cengage Learning."}, {"url": "http://smallbusiness.chron.com/weighted-marginal-cost-35344.html", "passage_text": "Marginal Cost of Equity. The marginal cost of common stock capital is the expected dividend growth rate plus the ratio of next year's dividend payments to the stock price, adjusted for stock issuance costs."}, {"url": "http://www.investopedia.com/exam-guide/cfa-level-1/corporate-finance/marginal-cost-of-capital.asp", "passage_text": "MCC Vs. WACC. The marginal cost of capital is simply the weighted average cost of the last dollar of capital raised. As mentioned previously, in making capital decisions, a company keeps with a target capital structure. There comes a point, however, when retained earnings have been depleted and new common stock has to be used."}]