[{"url": "http://www.urmc.rochester.edu/encyclopedia/content.aspx?ContentTypeID=167&ContentID=free_androgen_index", "passage_text": "This causes health problems for both men and women. A testosterone test is a blood test that measures total testosterone, free testosterone, and a protein called steroid hormone binding globulin (SHBG). A free androgen index measures testosterone in your blood and compares it with the total amount of testosterone and SHBG in your body. "}, {"url": "http://www.brighthub.com/science/medical/articles/98574.aspx", "passage_text": "Testosterone is a male hormone found in the blood that affects development and sexual features. In men, it is produced by the testicles, whereas in women, it is produced by the ovaries. The adrenal glands in both men and women also produce a small amount of testosterone. A blood test to check the free testosterone levels may be ordered in several cases. Some of these cases are: 1  A man or woman is complaining of a decreased sex drive. 2  A man is suffering from erectile dysfunction."}, {"url": "http://www.urmc.rochester.edu/encyclopedia/content.aspx?ContentTypeID=167&ContentID=testosterone_free", "passage_text": "If you are a man and this test reveals your free testosterone is lower than normal, your health care provider may prescribe testosterone therapy. The FDA has not approved any testosterone drugs for women. You may have this test to find out whether a low sex drive is caused by a low level of free testosterone. In recent years, health care providers have used testosterone therapy to treat both men and women with low sex drives."}, {"url": "http://www.webmd.com/men/testosterone-15738", "passage_text": "A testosterone test is done to: 1  See why a man is having problems in fathering a child (infertility). 2  A low amount of testosterone can lead to low sperm counts. 3  Check a man's sexual problems. 4  Having a low level of testosterone may lower a man's sex drive or not allow him to have an erection (erectile dysfunction). This hormone tells the testicles to make more testosterone. Before puberty, the testosterone level in boys is normally low. Testosterone increases during puberty. This causes boys to develop a deeper voice, get bigger muscles, make sperm, and get facial and body hair."}, {"url": "http://www.webmd.com/men/testosterone-15738", "passage_text": "In both men and women, testosterone is made in small amounts by the adrenal glands, and in women, by the ovaries. The pituitary gland controls the level of testosterone in the body. When the testosterone level is low, the pituitary gland releases a hormone called luteinizing hormone (LH) . This hormone tells the testicles to make more testosterone. Before puberty, the testosterone level in boys is normally low. Testosterone increases during puberty. This causes boys to develop a deeper voice, get bigger muscles, make sperm, and get facial and body hair."}, {"url": "http://www.healthtestingcenters.com/testosterone-free-total.aspx", "passage_text": "Testosterone Total and Free, describes a particular hormone found in the blood stream. Produced by the adrenal glands, it affects the body by stimulating various organs -- ovaries in women and testicles in men. To assess the possibility of low testosterone, one must measure the amount of free testosterone that affects the body in certain ways, such as the hormonal contribution to the sex drive. Most total testosterone is not free. Free means simply that it is not bound to something else. Most of the total testosterone is bound to a specific type of cell called the SHBG (sex hormone binding globulin). A smaller portion is connected to a blood protein (albumin)"}, {"url": "http://www.urmc.rochester.edu/encyclopedia/content.aspx?ContentTypeID=167&ContentID=testosterone_free", "passage_text": "This test measures your total testosterone and the amount of unattached, or free, testosterone in your blood. Men and women both make testosterone, a hormone that helps children develop into adult males and females. Most of the testosterone in your blood attaches to two proteins: albumin and sex hormone binding globulin, or SHBG. Some testosterone is unattached to proteins, or free. It can be important to measure a person's level of free testosterone because this hormone is responsible for sexual traits. You may have this test to find out whether a low sex drive is caused by a low level of free testosterone. In recent years, health care providers have used testosterone therapy to treat both men and women with low sex drives."}, {"url": "http://www.brighthub.com/science/medical/articles/98574.aspx", "passage_text": "Testosterone is usually bound, or connected, to a protein called sex hormone binding globulin. Testosterone that is not bound to this hormone is known as free testosterone. Testing the levels of free testosterone in the blood may be done if the patient is experiencing certain issues. slide 2 of 5. A blood test to check the free testosterone levels may be ordered in several cases. Some of these cases are: 1  A man or woman is complaining of a decreased sex drive. 2  A man is suffering from erectile dysfunction."}]