[{"url": "http://www.urmc.rochester.edu/encyclopedia/content.aspx?ContentTypeID=134&ContentID=37", "passage_text": "Ampullary cancer, or ampullary carcinoma, is a life-threatening cancer that forms in a body part called the ampulla of Vater. The ampulla of Vater is a small opening that enters into the first portion of the small intestine, known as the duodenum."}, {"url": "http://www.surgery.usc.edu/divisions/tumor/pancreasdiseases/web%20pages/BILIARY%20SYSTEM/AMPULLARY%20CANCER.html", "passage_text": "Ampullary cancer is a cancer that arises from the Ampulla Vater. The Ampulla Vater is a nipple like projection into the duodenum (the first portion of the intestine) into which the pancreatic and bile ducts open. All of the pancreatic and biliary secretion enter the duodenum through"}, {"url": "http://medical-dictionary.thefreedictionary.com/ampulla", "passage_text": "hepatopancreatic ampulla ampulla of Vater; a flasklike cavity in the major duodenal papilla into which the common bile duct and pancreatic duct open. Hepatopancreatic ampulla, receiving the common bile and pancreatic ducts and entering the duodenum at the major duodenal papilla."}, {"url": "http://www.mayoclinic.org/diseases-conditions/ampullary-cancer/basics/definition/con-20030207", "passage_text": "Ampullary (AM-poo-la-ree) cancer is a rare cancer that forms in an area of your digestive system called the ampulla of Vater. The ampulla of Vater is where your bile duct and pancreatic duct join and empty into your small intestine."}, {"url": "http://emedicine.medscape.com/article/282920-overview", "passage_text": "Background. Carcinoma of the ampulla of Vater, shown in the image below, is a rare malignant tumor arising within 2 cm of the distal end of the common bile duct, where it passes through the wall of the duodenum and ampullary papilla. Endoscopic view of an ampullary carcinoma."}, {"url": "http://www.medicinenet.com/script/main/art.asp?articlekey=24475", "passage_text": "Ampulla: In anatomy, a sac-like enlargement of a canal or duct. The ampulla of Vater is the enlargement of the ducts from the liver and pancreas at the point where they enter the small intestine. Ampulla in Latin means flask. An ampulla was a flask used in ancient Rome to hold ointment, perfume, and wine."}, {"url": "http://emedicine.medscape.com/article/282920-overview", "passage_text": "Carcinoma of the ampulla of Vater, shown in the image below, is a rare malignant tumor arising within 2 cm of the distal end of the common bile duct, where it passes through the wall of the duodenum and ampullary papilla. Endoscopic view of an ampullary carcinoma."}, {"url": "http://www.merriam-webster.com/dictionary/ampulla", "passage_text": "Definition of AMPULLA. 1. : a glass or earthenware flask with a globular body and two handles used especially by the ancient Romans to hold ointment, perfume, or wine. 2. : a saccular anatomical swelling or pouch."}]