[{"url": "http://www.geology.sdsu.edu/how_volcanoes_work/Lavaflows.html", "passage_text": "INTRODUCTION. Volumetrically, most lava is of basaltic composition. Basaltic melts have overall lower gas contents and are more fluid than their andesitic-to-rhyolitic counterparts. Their higher fluidity (lower viscosity) is a product of their lower SiO 2 (silica) contents."}, {"url": "http://www.tulane.edu/~sanelson/Natural_Disasters/volcan%26magma.htm", "passage_text": "Explosive eruptions are favored by high gas content and high viscosity (andesitic to rhyolitic magmas). Explosive bursting of bubbles will fragment the magma into clots of liquid that will cool as they fall through the air. Siliceous Lava Flow s-High viscosity andesitic and rhyolitic lava flows, because they can’t flow very easily, form thick stubby flows that don’t move far from the vent. Lava Domes or Volcanic Domes-result from the extrusion of highly viscous, gas poor andesitic and rhyolitic lava."}, {"url": "http://www.answers.com/Q/Which_kind_of_magma_is_hotter_basaltic_or_rhyolitic", "passage_text": "Basaltic magma is low in silica and rich in iron and magnesium. It  is denser, more fluid, and hotte … r than most other types of magma.  Because of its generally low gas content, volcanic eruptions  involving it are typically non-explosive or only mildly explosive,  often resulting in rivers of red hot lava. It is less dense, more viscous, and cooler than most other types of  magma. It usually has a very high gas content, meaning that most  eruptions involving it will be highly explosive. Most  supervolcanoes are fed by rhyolitic magma."}, {"url": "http://www.answers.com/Q/Which_kind_of_magma_is_hotter_basaltic_or_rhyolitic", "passage_text": "Andesitic magma is in between basaltic and rhyolitic magma, with a  moderate amount of silica. It has an intermediate density, cooling  point, and viscosity compared with other types of magma. Eruptions  involving it are often explosive, but not catastrophically violent. 1 person found this useful. It is less dense, more viscous, and cooler than most other types of  magma. It usually has a very high gas content, meaning that most  eruptions involving it will be highly explosive. Most  supervolcanoes are fed by rhyolitic magma."}, {"url": "http://www.brighthub.com/environment/science-environmental/articles/98266.aspx", "passage_text": "Rhyolitic Lava. Rhyolitic lava has the highest viscosity of any type of lava, and it has the greatest content of SiO 2. Typically, the SiO 2 content of rhyolitic lava is greater than 68 percent of its total composition. It flows much slower than andesitic and basaltic lava. It has a high iron and magnesium content. It has a relatively low viscosity, when compared to other types of lava. It is the fastest flowing lava. Basaltic lava is commonly expelled from shield volcanoes, and it usually flows in the Pahoehoe or A'a style."}, {"url": "http://www.tulane.edu/~sanelson/Natural_Disasters/volcan%26magma.htm", "passage_text": "Non explosive eruptions are favored by low gas content and low viscosity magmas (basaltic to andesitic magmas). If the viscosity is low, non-explosive eruptions usually begin with fire fountains due to release of dissolved gases. When magma reaches the surface of the earth, it is called lava. Since it its a liquid, it flows downhill in response to gravity as a lava flows. Different magma types behave differently as lava flows, depending on their temperature, viscosity, and gas content. Siliceous Lava Flow s-High viscosity andesitic and rhyolitic lava flows, because they can’t flow very easily, form thick stubby flows that don’t move far from the vent. Lava Domes or Volcanic Domes-result from the extrusion of highly viscous, gas poor andesitic and rhyolitic lava."}, {"url": "http://www.answers.com/Q/Which_kind_of_magma_is_hotter_basaltic_or_rhyolitic", "passage_text": "Basaltic magma is hotter, denser, and less viscous than most other  types of lava. It is poor in silica and rich in iron and magnesium.  Eruptions involving it are typically … non explosive or only mildly  explosive. It is less dense, more viscous, and cooler than most other types of  magma. It usually has a very high gas content, meaning that most  eruptions involving it will be highly explosive. Most  supervolcanoes are fed by rhyolitic magma."}, {"url": "http://www.brighthub.com/environment/science-environmental/articles/98266.aspx", "passage_text": "Lava is molten rock that flows out of volcanoes. Depending on its composition, lava can be categorized as basaltic, andesitic, or rhyolitic. The different types of lava move in different ways including pahoehoe, A'a, sheet, and block flows. Lava cools and becomes igneous rocks. It has a high iron and magnesium content. It has a relatively low viscosity, when compared to other types of lava. It is the fastest flowing lava. Basaltic lava is commonly expelled from shield volcanoes, and it usually flows in the Pahoehoe or A'a style."}]