[{"url": "http://www.seatguru.com/airlines/American_Airlines/baggage.php", "passage_text": "Effective Feb. 10, 2011, for the Caribbean and Central America to/from the U.S., Puerto Rico, the U.S. Virgin Islands, Canada, Europe and India: 1  Economy Class: May check one bag for no charge and a second bag for $30 each way within size and weight limitations."}, {"url": "http://traveltips.usatoday.com/american-airlines-international-luggage-restrictions-105721.html", "passage_text": "The overall limit is 10 bags per passenger. American Airlines determines its allowable sizes by adding up the total outside dimensions -- length, width and height -- of each bag. Checked bags can't exceed 62 inches, and can't weigh more than 50 pounds."}, {"url": "http://www.delta.com/content/www/en_US/traveling-with-us/baggage/before-your-trip/checked.html", "passage_text": "If your bag exceeds weight or size limits, please review the Additional, Overweight, and Oversized Baggage section. You may also carry on one bag and one small personal item at no charge. Visit our Carry-on Baggage section for more information."}, {"url": "http://www.airline-baggage-fees.com/american-airlines.php", "passage_text": "Checked Baggage Summary. Flights within and between the US, Canada, US Virgin Islands and Puerto Rico will always charge for every bag, including your first checked bag. The rate is $25 for the first bag, $35 for a second bag, $150 for a 3rd bag, and $200 for every additional bag. The weight is limited to 23kg (50lbs) for each of those bags."}, {"url": "http://www.airline-baggage-fees.com/american-airlines.php", "passage_text": "American Airlines Carry-On Allowance 2015 ↑ Back to Top Carry-On Summary One carry-on bag is allowed on American Airlines flights, with dimensions being limited to 22 x 14 x9 inches (56x35x23cm), in order to be able to fit it into the overhead compartment or below your seat."}, {"url": "http://traveltips.usatoday.com/american-airlines-international-luggage-restrictions-105721.html", "passage_text": "Baggage Limits. When traveling to or from Japan and China on American Airlines, passengers can check two bags and bring one personal item and one carry-on item at no charge. Travelers to Europe aboard American can check one bag"}, {"url": "http://www.seatguru.com/airlines/American_Airlines/baggage.php", "passage_text": "1 Maximum Dimensions of Carry-on Luggage: 45 linear in/114 cm (length + width + height) and cannot exceed any of the following measurements: 22 long x 14 wide x 9 tall or 114cm (56 x 35 x 23 cm)."}, {"url": "http://www.airline-baggage-fees.com/american-airlines.php", "passage_text": "American Airlines Checked Baggage Allowance 2015 ↑ Back to Top Checked Baggage Summary Flights within and between the US, Canada, US Virgin Islands and Puerto Rico will always charge for every bag, including your first checked bag. The rate is $25 for the first bag, $35 for a second bag, $150 for a 3rd bag, and $200 for every additional bag. The weight is limited to 23kg (50lbs) for each of those bags."}]