[{"url": "http://www.homeadvisor.com/cost/fencing/", "passage_text": "Since the cost for fencing can vary widely, it's important to estimate cost per project, keeping the specific materials and dimensions in mind. Nationally, costs range from about $1,500 to $4,000 for new fence installation. On average, homeowners spend $2,550, but prices can vary slightly by region. Continue Reading."}, {"url": "http://www.homeadvisor.com/cost/fencing/install-a-fence/", "passage_text": "If so, there are a few things you need to understand about the process to make an informed decision. Building a fence costs approximately $2,652 for the average installation. Some owners can save as much as $1,000 off that price while the upper price boundary is $4,000."}, {"url": "http://home.costhelper.com/aluminum-fencing.html", "passage_text": "Shopping for an aluminum fence: 1  If the fence encloses a driveway, a driveway gate can cost $1,400-$3,200 for one that opens manually, or an automated ornamental driveway gate can cost $2,000-$7,700 or more. 2  With installation, the total cost can be $1,800-$9,000."}, {"url": "http://www.improvenet.com/a/how-much-does-a-fence-cost", "passage_text": "While a wooden fence offers more privacy and security, the costs of labor and materials will be more. According to our fence installation cost estimator, the average price to install a fence is $2,388. No matter your preferred type, most homeowners choose a six-foot privacy fence."}, {"url": "http://www.rempros.com/installation-prices/cost_to_install_fence.html", "passage_text": "$245 - $410. Cost of materials is a charge will be added to the gross expenses to build a new fence if a contractor will purchase and supply all necessary materials at his own discretion for the standard fence installation. If a homeowner has a preference besides material type the final price will be discussed."}, {"url": "http://www.rempros.com/installation-prices/cost_to_install_fence.html", "passage_text": "How much does it cost to install a fence? Cost of fence installation vary from $15 per linear foot for standard 4’ high chain link on 2-3/8” in diameter 16-gauge galvanized steel posts fence to $460 / Ln. Ft. or even more for custom build 6 Ft. high stone fence. Accurate estimate can be provided only after on-site inspection and analyzing work complexity."}]