[{"url": "http://www.thejunglestore.com/Kinkajou_Facts", "passage_text": "However, the kinkajou (Potos flavus) is not a primate. Actually more closely-related to raccoons, kinkajous are one of only two members of the Carnivora order with prehensile tails, the other being the binturong. Fully-grown kinkajous weigh 3-10lbs and have a total body length of 16-24 inches. In addition, their powerful tails may equal or exceed their bodies in length. They are nocturnal animals that usually forage alone in the dark of night, returning to sleep in tree holes with a family unit during daylight hours. Kinkajous breed throughout the year and can live for well over twenty years. KINKAJOU FACTS. 1  The longest-lived kinkajou on record reached 41 years of age."}, {"url": "https://en.wikipedia.org/wiki/Kinkajou", "passage_text": "The kinkajou (Potos flavus) is a rainforest mammal of the family Procyonidae related to olingos, coatis, raccoons, and the ringtail and cacomistle. It is the only member of the genus Potos and is also known as the honey bear (a name that it shares with the sun bear). An adult kinkajou weighs 1.4–4.6 kg (3–10 lb). The adult body length is 40–60 cm (16–24 in); in addition to body length, the tail length is 40–60 cm (16–24 in). The kinkajou's woolly fur consists of an outer coat of gold (or brownish-gray) overlapping a gray undercoat."}, {"url": "https://en.wikipedia.org/wiki/Kinkajou", "passage_text": "Although the kinkajou is classified in the order Carnivora and has sharp teeth, its omnivorous diet consists mainly of fruit. Kinkajous particularly enjoy figs. An adult kinkajou weighs 1.4–4.6 kg (3–10 lb). The adult body length is 40–60 cm (16–24 in); in addition to body length, the tail length is 40–60 cm (16–24 in). The kinkajou's woolly fur consists of an outer coat of gold (or brownish-gray) overlapping a gray undercoat."}, {"url": "http://encyclopedia2.thefreedictionary.com/Kinkachu", "passage_text": "Kinkajou. (Potos flavus), a predatory mammal of the family Procyonidae. Body length, 41–57 cm; tail length, 40–50 cm; weight, 1.5–2.7 kg. The head of the kinkajou is round, the snout short, and the tail long and prehensile."}, {"url": "http://www.bioexpedition.com/kinkajou/", "passage_text": "Kinkajou Description. The Kinkajou is quite small with their weight from 3 to 10 pounds. They can be up to 24 inches long. Their tail can be up to another 22 inches in length for them. They have a coat of fur that is thick and has a wooly texture to it. The coloring can range from light brown to grayish. The Kinkajou is nocturnal which means it only comes out at night. It has very good vision that allows it to see well in complete darkness. During the day they are well hidden in the rainforest. They rest and they stay in the shade to take solace from the heat."}, {"url": "http://animals.sandiegozoo.org/animals/kinkajou", "passage_text": "It is able to climb with confidence when about three months old. Young males stay with their mother until they are about 18 months old; females stay until they are about two years old. A kinkajou's hearing is sharp enough to detect the movement of a snake. In Belize, kinkajous are called night walkers.. Kinkajous are able to turn their feet in the opposite direction and run backward just as quickly as they run forward. This also makes it easy for them to climb up and down trees headfirst. "}, {"url": "https://animalcorner.co.uk/animals/kinkajou/", "passage_text": "Kinkajou Diet. Although Kinkajous are classified in the order Carnivora and equipped with sharp teeth, they actually primarily eat fruit. One source of help in getting fruit in small areas is their long tongue that is slender and has a length of 5 inches. The Kinkajou (Potos flavus), also known as the ‘Honey Bear’, ‘Sugar Bear’, or ‘Cat Monkey’ is a small rainforest mammal related to the olingo, cacomistle and raccoon and is native to Latin and South America. The Kinkajou is the only member of the genus ‘Potos’."}, {"url": "https://animalcorner.co.uk/animals/kinkajou/", "passage_text": "Kinkajou. The Kinkajou (Potos flavus), also known as the ‘Honey Bear’, ‘Sugar Bear’, or ‘Cat Monkey’ is a small rainforest mammal related to the olingo, cacomistle and raccoon and is native to Latin and South America. The Kinkajou is the only member of the genus ‘Potos’."}]