[{"url": "http://www.webmd.com/sleep-disorders/tc/melatonin-overview", "passage_text": "Melatonin is a hormone made by the pineal gland, a small gland in the brain. Melatonin helps control your sleep and wake cycles. Very small amounts of it are found in foods such as meats, grains, fruits, and vegetables. You can also buy it as a supplement. Melatonin supplements are sometimes used to treat jet lag or sleep problems (insomnia). Scientists are also looking at other good uses for melatonin, such as: 1  Treating seasonal affective disorder (SAD)."}, {"url": "http://www.answers.com/Q/Is_melatonin_addictive", "passage_text": "Melatonin is a natural hormone that regulates the human biological clock.     Melatonin is produced by the pineal gland, located within the brain. Levels of … melatonin in the body fluctuate with the cycles of night and day. The highest melatonin levels are found at night. Melatonin is not habit forming, having no withdrawal symptoms like heavy-duty 'knock-out' sleeping pills do. Melatonin does NOT force the body to sleep like commercial sleeping pills; it relaxes the body, calms the heart rate, cools the body, and prepares it for sleep and body repair at the cellular level."}, {"url": "http://drug.addictionblog.org/can-you-get-addicted-to-melatonin/", "passage_text": "Melatonin supplements are a relatively safe substance when used in the short term: over a period of days or weeks. Furthermore, melatonin has been shown to be safe at relatively high doses and in various formulations. However, the safety of melatonin when used over months and years, remains unclear. Thanks for your question. In its natural form, melatonin is produced by the brain’s pineal gland to regulate the sleep cycle. When the body is working best, the level melatonin in the bloodstream rises sharply, reducing alertness and inviting sleep, and in the morning it falls back, encouraging waking."}, {"url": "http://www.doctoroz.com/article/fact-sheet-melatonin", "passage_text": "MORE FROM THIS EPISODE. Melatonin is a natural, non-addicting hormone supplement that assists with sleep. Millions of people in the United States take it in order to get a good night’s sleep after having difficulties falling asleep or staying asleep. However, beware! Melatonin is a powerful hormone. Many may mistake its power for that of a sleeping pill and feel compelled to take more for better sleep. However, at the wrong dosage, melatonin may actually destroy your sleep cycle."}, {"url": "http://www.doctoroz.com/article/fact-sheet-melatonin", "passage_text": "From This Episode: Melatonin is naturally produced in your brain. It tells your body that it’s nighttime and it’s time to go to bed. Melatonin is a powerful hormone. Many may mistake its power for that of a sleeping pill and feel compelled to take more for better sleep. However, at the wrong dosage, melatonin may actually destroy your sleep cycle. Too much melatonin at one time may also cause headaches, nausea, dizziness, or irritability"}, {"url": "http://www.easy-immune-health.com/melatonin-addiction.html", "passage_text": "While Melatonin addiction is just simply not a problem, getting rid of addictions with the help of melatonin may be a possibility. While there are a limited number of studies done on this topic, it seems that melatonin could potentially be helpful for those with addictions to: 1  Sedatives and sleeping pills. Melatonin Addiction. If you are concerned about addiction to melatonin, you can stop being concerned. In the thousands of studies done over the past decade, and even years of usage of Melatonin for Children, there have just simply been no reports of addiction to melatonin or dependency in anyone."}, {"url": "http://drug.addictionblog.org/can-you-get-addicted-to-melatonin/", "passage_text": "Melatonin is a naturally occuring neuro-hormone which is synthesized by the pineal gland. Natural melatonin is thought to regulated sleep, mood, puberty, and ovarian cycles. Melatonin supplements are still be investigated for use in people. Thanks for your question. In its natural form, melatonin is produced by the brain’s pineal gland to regulate the sleep cycle. When the body is working best, the level melatonin in the bloodstream rises sharply, reducing alertness and inviting sleep, and in the morning it falls back, encouraging waking."}, {"url": "http://www.answers.com/Q/Is_melatonin_addictive", "passage_text": "Melatonin is a precious master hormone Melatonin = C13H16N2O2 and is produced in the pineal gland, which is just below the hypothalamus, just below the two hemispheres of the … brain. It is very difficult to get at in a 'live' human patient. Melatonin is not habit forming, having no withdrawal symptoms like heavy-duty 'knock-out' sleeping pills do. Melatonin does NOT force the body to sleep like commercial sleeping pills; it relaxes the body, calms the heart rate, cools the body, and prepares it for sleep and body repair at the cellular level."}, {"url": "http://www.mayoclinic.org/drugs-supplements/melatonin/background/HRB-20059770", "passage_text": "Melatonin is a hormone produced in the brain by the pineal gland from the amino acid tryptophan. The production and release of melatonin are stimulated by darkness and decreased by light, suggesting that melatonin is involved in circadian rhythm (the internal body clock) and regulation of diverse body functions. Levels of melatonin in the blood are highest prior to bedtime."}, {"url": "http://www.webmd.com/vitamins-supplements/ingredientmono-940-MELATONIN.aspx?activeIngredientId=940&activeIngredientName=MELATONIN", "passage_text": "Melatonin is a hormone found naturally in the body. Melatonin used as medicine is usually made synthetically in a laboratory. It is most commonly available in pill form, but melatonin is also available in forms that can be placed in the cheek or under the tongue. "}]