[{"url": "http://www.healthline.com/health/cost-epilepsy-medications", "passage_text": "These treatments are typically more expensive than older treatments. If you have seizures or have been diagnosed with epilepsy, you may need to take medication on a daily basis. Paying for all of that medication can be a real burden. But there are things you can do to reduce the costs. Research your medicine."}, {"url": "http://www.webmd.com/epilepsy/news/20000330/cost-epilepsy-higher-previous-estimates", "passage_text": "These people, and others who have uncontrolled epilepsy, contribute disproportionately to the cost of treating the chronic disease, say researchers who found that patients with poor seizure control represented 25% of all cases, but accounted for up to 86% of all costs."}, {"url": "http://www.healthline.com/health/cost-epilepsy-medications", "passage_text": "The most common drugs for treating epilepsy are anticonvulsants, which are used for treating seizure disorders. The prices listed for each of these drugs are an average of estimated cash costs for brand name and generic medications. These cash costs do not take health insurance into consideration."}, {"url": "http://www.ncbi.nlm.nih.gov/pubmed/8956917", "passage_text": "The mean yearly costs (expressed in 1991 prices) of epilepsy-related health care including antiepileptic drug treatment was US $1,594 the year before starting GVG therapy, and US $2959 the first year of GVG treatment including a mean yearly cost of GVG of US $1,572."}, {"url": "http://www.cdc.gov/epilepsy/basics/fast-facts.htm", "passage_text": "Cost of Epilepsy. The total indirect and direct cost of epilepsy in the United States is estimated to be $15.5 billion yearly. This estimate is based on a reported cost of $12.5 billion in 1995 converted to 2004 dollar value using Bureau of Labor Statistics data. 4."}, {"url": "http://www.webmd.com/epilepsy/news/20000330/cost-epilepsy-higher-previous-estimates", "passage_text": "WebMD Health News. March 30, 2000 (Atlanta) -- As many as 44% of the people in the U.S. who have epilepsy -- more than 1 million people -- continue to have seizures, despite getting medical treatment, according to a report in the March issue of the journal Epilepsia."}, {"url": "http://www.healthline.com/health/cost-epilepsy-medications", "passage_text": "If you have seizures or have been diagnosed with epilepsy, you may need to take medication on a daily basis. Paying for all of that medication can be a real burden. But there are things you can do to reduce the costs."}, {"url": "http://www.neurologyindia.com/article.asp?issn=0028-3886;year=2000;volume=48;issue=4;spage=322;epage=9;aulast=Thomas", "passage_text": "[10] That study estimated the national cost of epilepsy at $3.6 billion for 2.1 million cases. On a per patient basis, the 1975 Figureure represents US $7440 in 1995, $1150 (15%) for direct treatment-related costs and $6290 (85%) for indirect employment-related costs."}]