[{"url": "http://wdfw.wa.gov/fishing/salmon/whenwhere/month.html", "passage_text": "The Skokomish River will be a good bet for chinook fishing. The Quilcene River is a great bet for coho when it opens in mid-August, but expect lots of company. In odd numbered years, pink salmon will be throughout Puget Sound from Sekiu to the San Juan Islands and from Everett down to Tacoma."}, {"url": "http://www.nature.org/ourinitiatives/regions/northamerica/unitedstates/washington/washington-salmon.xml", "passage_text": "This has led to listing some species of salmon on the endangered species list. Salmon need cold, clear water to thrive. In Washington state, The Nature Conservancy is working to restore forests on the Olympic Peninsula so that they provide shade and filter the water for our rivers and streams. In time, this conservation work will lead to recovery of wild salmon populations."}, {"url": "http://westsideguide.com/the-fish-2/salmon-fishing", "passage_text": "A trophy salmon in Washington state is 50 pounds. The fall season produces quite a few of these monsters. Some will reach the 60 lb. class. Our feisty Silvers are huge! The average Silver is about 10 pounds with many in the teens and 20’s."}, {"url": "http://www.oncosportfishing.com/Home.htm", "passage_text": "In the spring we are fishing the Columbia River from Cathlamet, I-5 at Portland to the Bonneville Dam chasing the Spring Kings in our jet sled. These are a prized fish, the first to enter the river, full of fat, succulent, and some of the best eating salmon Washington State has to offer."}, {"url": "http://www.nature.org/ourinitiatives/regions/northamerica/unitedstates/washington/washington-salmon.xml", "passage_text": "Nothing says “Pacific Northwest” like a salmon sizzling on a barbeque in the summer. Salmon is an iconic food in the Pacific Northwest and we can’t seem to get enough of it. From 2000 to 2004, Americans consumed an average of about 284,000 metric tons of salmon annually."}, {"url": "http://www.oncosportfishing.com/Home.htm", "passage_text": "We invite you to join us on some of the most productive waters Washington State has to offer the fishing sportsmen and enthusiasts. We target some of the most sought after fishing destinations for salmon, steelhead, and other game fish. O nco Sportfishing offers spring, summer, fall, and winter fishing."}, {"url": "http://www.oncosportfishing.com/Home.htm", "passage_text": "We also fish the Cowlitz River for Winter Steelhead, Spring Salmon, Summer Steelhead, and Fall Salmon. Join us on any one of these destinations and enjoy the beauty and fishing bounties Washington state and the Pacific Northwest provide."}]