[{"url": "http://recipes.answers.wikia.com/wiki/How_long_should_you_cook_a_3_pound_meatloaf", "passage_text": "how long deo you cook a 3 pound meatloaf. It depends on what kind of container you're cooking it in. The thicker the meatloaf (i.e. cooked in a breadpan), the longer the cooking times. If you're cooking a 3-lb. loaf, I recommend using something larger than a standard baking pan.... something like a lasagne baking pan. If you do this, it should be ready in an hour at 375. 1  In a meat loaf pan-A good rule seems to be 1/2 hour per pound. 2  Then letting it sit for 10 minutes before slicing it."}, {"url": "http://www.answers.com/Q/How_long_does_it_take_to_cook_a_2.5lb_meatloaf", "passage_text": "A 2.5 pound meatloaf should be cooked for approximately 1.5 hours  in a preheated 350 degree oven. Cook until the inside of the  meatloaf is 170 degrees or until the juices … are no longer pink or  red. 5 people found this useful. "}, {"url": "https://answers.yahoo.com/question/index?qid=20060627154542AAr7XtW", "passage_text": "Report Abuse. At 350 degrees in a conventional oven a 2 pound meatloaf should cook 1 hour 20 minutes otherwise it is still raw folks. I used two pounds of hamburger, , 1 box of chicken flavored stove top stuffing as my bread crumbs, 2 eggs, 1 cup of water, and 1/2 cup of original Kraft BBQ sauce mixed together well put in a loaf pan let it cook covered with aluminum foil for 1 hour then take it out and top with ketchup and cook remaining 20 minutes."}, {"url": "http://www.ehow.com/how_5064187_cook-onepound-meatloaf.html", "passage_text": "1 Small 1-pound meatloaves can be cooked at a lower temperature of 300 F to 325 F, if you prefer, for 10 to 12 minutes longer. 2  This gentler cooking minimizes moisture loss as the meatloaf cooks, yielding a moister and juicier end result. Tips & Warnings. 1 "}, {"url": "http://www.food.com/recipe/turkey-meatloaf-54752", "passage_text": "1 Cook onion and garlic in melted butter for 5 minutes, stirring occasionally. 2  Place mixture in a large bowl to cool for 5 minutes. 3  Combine turkey, bread crumbs, egg, 1/4 cup of the catsup, Worcestershire sauce, salt, and pepper with onion mixture. 4  Press meatloaf into an 8x4-inch loaf pan. 1 Melt butter in a skillet. 2  Cook onion and garlic in melted butter for 5 minutes, stirring occasionally. 3  Place mixture in a large bowl to cool for 5 minutes. 4"}, {"url": "http://www.foodnetwork.com/recipes/ellie-krieger/moms-turkey-meatloaf-recipe.html", "passage_text": "Directions. Preheat the oven to 350 degrees F. In a small bowl, stir together the oats and milk. Thinly slice 1/4 of the onion and set aside. Finely chop the remaining onion. In a large bowl combine the turkey, oat mixture, chopped onion, bell pepper, eggs, Worcestershire sauce, ketchup, salt and a few grinds of pepper. Mix just until well combined. Transfer the mixture to a 9 by 13-inch baking dish and shape into a loaf about 5 inches wide and 2 1/2 inches high. Pour the tomato sauce over the meatloaf and sprinkle with the sliced onions. Bake for about 1 hour or until an instant-read thermometer registers 160 degrees.F. "}, {"url": "https://answers.yahoo.com/question/index?qid=20080911215116AAphv75", "passage_text": "Report Abuse. If its a all hamburger meatloaf try 1 hour at 350 degrees. If it has sausage in it bake it for 1 hour 15 minutes. Source(s): Just made a 2 lb meatloaf with hamburger and sausage in an oven at 350 for 75 minutes Wednsday and it came out great. A thick, wide meatloaf will take longer. Put it in the oven and check it after a 1/2 hour. Use a meat thermometer. Ground beef needs to reach 155 F in order to be safe. Test the very center in the thickest part. I never use set times for anything I cook."}, {"url": "https://answers.yahoo.com/question/index?qid=20080911215116AAphv75", "passage_text": "It all depends on what shape it is. A long, narrow meatloaf won't take as long. A thick, wide meatloaf will take longer. Put it in the oven and check it after a 1/2 hour. Use a meat thermometer. Ground beef needs to reach 155 F in order to be safe. Test the very center in the thickest part. I never use set times for anything I cook."}, {"url": "http://www.simplyrecipes.com/recipes/classic_meatloaf/", "passage_text": "Cover the meatloaf mixture with the rest of the ketchup. 5 Bake for 1 hour at 350°F, or until a meat thermometer inserted into the center of the meatloaf reads 155°F. Remove from oven and let sit for 10 minutes. Then use a metal spatula to gently lift the meatloaf out of the loaf pan to a serving plate. Make thick slices to serve."}, {"url": "http://recipes.answers.wikia.com/wiki/How_long_should_you_cook_a_3_pound_meatloaf", "passage_text": "That way, the cooking time will be reduced. If you do this, it should be ready in an hour at 375. 1  In a meat loaf pan-A good rule seems to be 1/2 hour per pound. 2  Then letting it sit for 10 minutes before slicing it. 3  Make your gravy while the meatloaf sets"}]