[{"url": "http://niams.nih.gov/health_info/bursitis/", "passage_text": "Tendinitis causes pain and tenderness just outside a joint. Some common names for tendinitis identify with the sport or movement that typically increases risk for tendon inflammation. They include tennis elbow, golfer’s elbow, pitcher’s shoulder, swimmer’s shoulder, and jumper’s knee. Some common examples follow. Biceps tendinitis causes pain in the front or side of the shoulder and may travel down to the elbow and forearm. Pain may also occur when the arm is raised overhead. The biceps muscle, in the front of the upper arm, helps stabilize the upper arm bone (humerus) in the shoulder socket."}, {"url": "http://niams.nih.gov/Health_Info/Bursitis/bursitis_ff.asp", "passage_text": "Bursitis and tendinitis are both common conditions that cause swelling around muscles and bones. They occur most often in the shoulder, elbow, wrist, hip, knee, or ankle. A bursa is a small, fluid-filled sac that acts as a cushion between a bone and other moving body parts such as muscles, tendons, or skin. A tendon is a flexible band of tissue that connects muscles to bones. Tendons can be small, like those found in the hand or ankle, or large, like the Achilles tendon in the heel. Tendons help create movement by making the muscles push or pull the bones in different ways. Tendinitis is the severe swelling of a tendon."}, {"url": "http://www.webmd.com/fitness-exercise/tennis-elbow-lateral-epicondylitis", "passage_text": "Tennis elbow is a type of tendinitis -- swelling of the tendons -- that causes pain in the elbow and arm. These tendons are bands of tough tissue that connect the muscles of your lower arm to the bone. Despite its name, you can still get tennis elbow even if you've never been near a tennis court. The symptoms of tennis elbow include pain and tenderness in the bony knob on the outside of your elbow. This knob is where the injured tendons connect to the bone. The pain may also radiate into the upper or lower arm. Although the damage is in the elbow, you're likely to hurt when doing things with your hands."}, {"url": "http://www.everydayhealth.com/drugs/bisoprolol", "passage_text": "Bisoprolol is in a group of drugs called beta-blockers. Beta-blockers affect the heart and circulation (blood flow through arteries and veins). Bisoprolol is used to treat hypertension (high blood pressure). Bisoprolol may also be used for other purposes not listed in this medication guide. Do not skip doses or stop taking bisoprolol without first talking to your doctor. Bisoprolol Interactions. Bisoprolol can cause side effects that may impair your thinking or reactions. Be careful if you drive or do anything that requires you to be awake and alert. Avoid getting up too fast from a sitting or lying position, or you may feel dizzy. Get up slowly and steady yourself to prevent a fall."}, {"url": "http://www.rxlist.com/zebeta-drug/patient-images-side-effects.htm", "passage_text": "Bisoprolol is in a group of drugs called beta-blockers. Beta-blockers affect the heart and circulation (blood flow through arteries and veins). Bisoprolol is used to treat hypertension (high blood pressure). "}, {"url": "http://www.everydayhealth.com/drugs/bisoprolol", "passage_text": "A: Bisoprolol (Zebeta) belongs to the group of drugs known as beta blockers. Bisoprolol affects the heart and blood vessels and is used to treat hypertension (high blood pressure). The most common side effects of bisoprolol include nausea, vomiting, diarrhea, decreased heart rate, and fatigue. Bisoprolol Interactions. Bisoprolol can cause side effects that may impair your thinking or reactions. Be careful if you drive or do anything that requires you to be awake and alert. Avoid getting up too fast from a sitting or lying position, or you may feel dizzy. Get up slowly and steady yourself to prevent a fall."}, {"url": "http://www.physioworks.com.au/injuries-conditions-1/rotator-cuff-tendonitis", "passage_text": "Shoulder tendonitis (or tendinitis) is an inflammation injury to the tendons of your shoulder's rotator cuff. Because inflammation is not always present in injuries to the shoulder tendons, this group of injuries are medically known as a rotator cuff tendinopathy or tendinopathies. "}, {"url": "http://www.webmd.com/fitness-exercise/arthritis-tendinitis", "passage_text": "1 Overuse or doing too much too soon when the tendons are not used to a movement or to the task taken on. 2  Tendinitis is common in weekend warriors, people that play and exercise hard only on weekends. 3  Occasionally an infection can cause tendinitis, especially infection from a cat or dog bite to the hand or a finger. The symptoms of tendinitis include: 1  Pain at the site of the tendon and surrounding area. 2  Pain may gradually build up or be sudden and severe, especially if calcium deposits are present. 3  Loss of motion in the shoulder, called adhesive capsulitis or frozen shoulder."}, {"url": "http://www.webmd.com/fitness-exercise/arthritis-tendinitis", "passage_text": "Tendinitis (also called tendonitis) is an inflammation or irritation of a tendon, a thick cord that attaches bone to muscle. Exercises for OA of the Knee. The symptoms of tendinitis include: 1  Pain at the site of the tendon and surrounding area. 2  Pain may gradually build up or be sudden and severe, especially if calcium deposits are present. 3  Loss of motion in the shoulder, called adhesive capsulitis or frozen shoulder."}, {"url": "http://niams.nih.gov/health_info/bursitis/", "passage_text": "Bursae are found throughout the body. Bursitis occurs when a bursa becomes inflamed (redness and increased fluid in the bursa). A tendon is a flexible band of fibrous tissue that connects muscles to bones. Tendinitis is inflammation of a tendon. Tendons transmit the pull of the muscle to the bone to cause movement. They are found throughout the body, including the hands, wrists, elbows, shoulders, hips, knees, ankles, and feet. Biceps tendinitis causes pain in the front or side of the shoulder and may travel down to the elbow and forearm. Pain may also occur when the arm is raised overhead. The biceps muscle, in the front of the upper arm, helps stabilize the upper arm bone (humerus) in the shoulder socket."}]