[{"url": "http://www.vintageamanda.com/2013/02/the-kale-thyroid-connection/", "passage_text": "Kale is a cruciferous vegetable (also known as brassicas). Cruciferous veggies include cabbage, kale, broccoli, cauliflower, bok choi, arugula (rocket), turnips and watercress (get a longer list of cruciferous vegetables here). There are a lot of healthy veggies in the list!"}, {"url": "http://www.whfoods.com/genpage.php?tname=foodspice&dbid=38", "passage_text": "In fact, most foods that are commonly called goitrogenic — such as the cruciferous vegetables (including kale, broccoli, and cauliflower) and soyfoods — do not interfere with thyroid function in healthy persons even when they are consumed on a daily basis."}, {"url": "http://www.livestrong.com/article/519961-greens-kale-thyroid-problems/", "passage_text": "Green vegetables, especially kale, contain chemicals called goitrogens that may inhibit absorption of dietary iodine. A decrease in iodine in your body can worsen symptoms of hypothyroidism, a condition where your thyroid gland does not produce enough hormones."}, {"url": "http://www.incrediblesmoothies.com/faq-questions-answers/does-raw-kale-and-other-cruciferous-brassica-leafy-greens-cause-thryoid-problems-qa-2/", "passage_text": "The cautionary tale concludes with a dire warning: “Kale killed my thyroid”. Well, not quite. Cruciferous vegetables such as kale, bok choy, collards, turnip and broccoli do contain goitrogenic glucosinolates, which produce thiocyanates that compete with iodine for absorption by the thyroid gland."}, {"url": "http://www.whfoods.com/genpage.php?tname=george&dbid=250", "passage_text": "In fact, most foods that are commonly called goitrogenic-such as the cruciferous vegetables (including broccoli, cabbage, kale, and cauliflower) and soyfoods-do not interfere with thyroid function in healthy persons even when they are consumed on a daily basis."}, {"url": "http://www.livestrong.com/article/519961-greens-kale-thyroid-problems/", "passage_text": "Goitrogens. Goitrogens are chemicals in food such as kale, cruciferous vegetables and soybeans. Many, but not all, green vegetables contain some levels of goitrogens. Even when eaten frequently, foods containing goitrogens will not cause thyroid disease in healthy people."}, {"url": "http://www.answers.com/Q/FAQ/13206", "passage_text": "From what I have found on the Internet, Chinese kale seems to contain goitrogens. See pp. 148 and 149 of this scientific journal article by a group of Chinese researchers: http://www.academicjournals.org/AJB/PDF/pdf2008/18Jan/You%20et%20al.pdf."}, {"url": "http://deliciouslyorganic.net/green-smoothie-recipe/", "passage_text": "Kale contains many beneficial nutrients, but it’s not good idea to eat these hearty leafy greens raw. Kale is a goitrogenic vegetable and when eaten raw in small quantities, this vegetable can inhibit the uptake of iodine by the thyroid gland."}]