[{"url": "http://www.merriam-webster.com/dictionary/barbecue", "passage_text": "Full Definition of BARBECUE. transitive verb. 1. : to roast or broil on a rack or revolving spit over or before a source of heat (as hot coals). 2. : to cook in a highly seasoned vinegar sauce. — bar·be·cu·er noun. See barbecue defined for English-language learners. See barbecue defined for kids. "}, {"url": "http://bbq.wikia.com/wiki/What_is_BBQ%3F", "passage_text": "20 pages on this wiki. Barbecue (also barbeque or BBQ) is a method for char grilling food in the hot smoke of a wood fire, usually charcoal fueled. BBQ is usually done outdoors by cooking and smoking the meat over wood or charcoal. Restaurant barbecue may be cooked in large brick or metal ovens. 1. Chicago style involves seasoning the meat with a dry rub, searing it over a hot grill and a slow cooking it in an oven. The meat, typically ribs, are then finished with a sweet-tangy sauce. 2. Texas style often uses beef and it can be associated with any type of sauce (depends on the person and the establishment)."}, {"url": "http://www.pnwba.com/whatisbbq_page.htm", "passage_text": "I like my ribs dry with a bit of some sweet tangy tomato based sauce on the side. The pork is mixed with the local sauce and it's not to be missed. Traditional American barbecue is not what your Dad did to hamburgers and hot dogs in the backyard on the 4th of July. That was grilling (cooking directly over flames) a great tradition but it ain't real barbecue. "}, {"url": "http://bbq.netrelief.com/what_is_barbecue.shtml", "passage_text": "Many people misuse the term barbecue. It has come to be applied to anything cooked on a grill, or even in the oven if a spicy tomato based sauce is applied. Barbecue is not a dish, or a cooking device, it is a method of cooking. There is a distinct difference between grilling and barbecueing, however"}, {"url": "https://en.wikipedia.org/wiki/Barbecue_sauce", "passage_text": "Barbecue sauce (also abbreviated BBQ sauce) is a flavoring sauce used as a marinade, basting or topping for meat cooked in the barbecue cooking style, including pork or beef ribs and chicken. It is an ubiquitous condiment and is used on many other foods as well. The sauce for asado, similar to barbecue in Argentina and Uruguay, is called chimichurri – a parsley based green sauce used as a condiment on the table, a marinade, and a grilling sauce. Chimichurri is used on beef, lamb, pork, goat, fowl, venison and root vegetables."}, {"url": "http://www.reluctantgourmet.com/bbq-what-is-barbecue/", "passage_text": "You can barbecue (verb) meat, but the noun barbecue is reserved for barbecued pork. But, go to Texas, and it’s all about the beef. While folks in the North or South Carolina might cry foul, Texas barbecue (noun) is beef. And crying foul might be a mild reaction. You can tell a smoker apart from a grill because in a smoker, the firebox is separate from the smoke chamber where the meat is actually cooked. Flame never touches the food in smoking whereas in grilling, food is placed directly over hot coals. The typical smoker has a firebox on one side and a chimney on the other."}, {"url": "http://www.papasmokehousebbq.com/What_is_BBQ.html", "passage_text": "It has been implied to mean anything cooked on a grill. It may mean a party or a get together with friends and family. But, Barbecue is not a dish, or a cooking device, nor an event. It is a METHOD of cooking. There is definite difference between grilling and barbecuing. If you “grill” the meat it means you are cooking it over direct heat of a fire, searing the outside and concentrating on not overcooking the inside."}, {"url": "http://amazingribs.com/BBQ_articles/barbecue_defined.html", "passage_text": "As the word expanded barbecue came to mean (1) food cooked by a barbecue method, (2) a cooking device, (3) an event at which barbecue is cooked, and (4) a flavor that is similar to sweet ketchup-based barbecue sauce. That is the way the word is commonly used by most people. American Competition Barbecue in which the food is usually cooked by indirect heat from charcoal with hardwood, straight hardwood, or hardwood pellets, in well insulated steel ovens with precise temperature and smoke control usually managed by constricting airflow."}, {"url": "https://en.wikipedia.org/wiki/Barbecue_grill", "passage_text": "A barbecue grill is a device that cooks food by applying heat from below. There are several varieties of grills, with most falling into one of two categories: gas-fueled or charcoal. There is a debate over whether charcoal or gas cooking method yields superior results. "}]