[{"url": "http://www.bbc.co.uk/education/guides/zm6rd2p/revision/2", "passage_text": "Anaerobic respiration. Unlike aerobic respiration, anaerobic respiration does not need oxygen. It is the release of a relatively small amount of energy in cells by the breakdown of food substances in the absence of oxygen."}, {"url": "http://www.diffen.com/difference/Aerobic_Respiration_vs_Anaerobic_Respiration", "passage_text": "Diffen › Science › Biology. Aerobic respiration, a process that uses oxygen, and anaerobic respiration, a process that doesn't use oxygen, are two forms of cellular respiration. Although some cells may engage in just one type of respiration, most cells use both types, depending on an organism's needs."}, {"url": "http://www.bbc.co.uk/education/guides/zq349j6/revision", "passage_text": "Glucose and oxygen react together in cells to produce carbon dioxide and water and releases energy. The reaction is called aerobic respiration because oxygen from the air is needed for it to work. Here is the word equation for aerobic respiration: glucose + oxygen → carbon dioxide + water."}, {"url": "http://www.diffen.com/difference/Aerobic_Respiration_vs_Anaerobic_Respiration", "passage_text": "Anaerobic respiration is respiration without oxygen; the process uses a respiratory electron transport chain but does not use oxygen as the electron acceptors. Cells that use it. Aerobic respiration occurs in most cells."}, {"url": "http://employee.heartland.edu/hfei/Labs/CellularRespirationProtocol.pdf", "passage_text": "Most of the time, the cells in our bodies use aerobic respiration: When oxygen is not available, cells use anaerobic processes to produce ATP. (The an in front of aerobic means not aerobic.) Under anaerobic conditions, many cells use a process called fermentation to make ATP."}, {"url": "http://www.mcqueens.net/mcqueen-ntl/dis/toc_/Pt20.html", "passage_text": "Respiration means the release of energy from food. This is a process carried out by all living things. The chemical process involved works most efficiently if oxygen is used. Just like a fire needs an oxygen supply to burn the fuel, so aerobic respiration needs oxygen."}]