[{"url": "http://www.answers.com/Q/What_did_the_voting_rights_act_outlaw", "passage_text": "The Voting Rights Act of 1965 got rid of the literacy tests which needed to be passed before being able to vote. By the end of 1965, 250,000 black Americans had registerd to v … ote (one-third had been assisted bu the government monitors who checked that the law was being followed). Confidence votes 99. It outlawed discriminatory voting practices against African Americans. Some states had previously excluded legitimate black voters by means of a literacy test, etc. This became unlawful with the Voting Rights Act which forbade any and all discriminatory qualifications."}, {"url": "http://www.crf-usa.org/black-history-month/the-voting-rights-act", "passage_text": "The Voting Rights Act of 1965 had immediate and dramatic results. Within two years with the help of many volunteers, African-American voter registration throughout the South increased to more than 50 percent of the voting-age population. Southern states had historically deprived the vote from millions of African-American citizens. Although guaranteed by the 15th Amendment, the right to vote had been denied blacks through discriminatory legal strategies, economic intimidation, and physical threats."}, {"url": "http://www.answers.com/Q/What_did_the_voting_rights_act_outlaw", "passage_text": "First of all, the Voting Rights Act was in 1965 NOT 1969. The  Voting Rights Act was the law that was passed to ban racial  dicrimnation in voting practices by the federal g … overnment as well  as the state and local goverment. Confidence votes 99. It outlawed discriminatory voting practices against African Americans. Some states had previously excluded legitimate black voters by means of a literacy test, etc. This became unlawful with the Voting Rights Act which forbade any and all discriminatory qualifications."}, {"url": "http://www.crf-usa.org/black-history-month/the-voting-rights-act", "passage_text": "Lyndon Johnson, who became president following the assassination of John F. Kennedy, sailed to a landslide victory in the 1964 presidential election. After the election, Johnson moved to do something about voting rights. President Lyndon Johnson signs the Voting Rights Act of 1965. (Wikimedia Commons). Southern states had historically deprived the vote from millions of African-American citizens. Although guaranteed by the 15th Amendment, the right to vote had been denied blacks through discriminatory legal strategies, economic intimidation, and physical threats. The civil rights movement had focused on voting rights, particularly during Freedom Summer in Mississippi in 1964"}, {"url": "http://www.history.com/topics/black-history/voting-rights-act", "passage_text": "Introduction. The Voting Rights Act, signed into law by President Lyndon Johnson (1908-73) on August 6, 1965, aimed to overcome legal barriers at the state and local levels that prevented African Americans from exercising their right to vote under the 15th Amendment (1870) to the Constitution of the United States. In 1965, at the time of the passage of the Voting Rights Act, there were six African-American members of the U.S. House of Representativesandno blacks in the U.S. Senate. By 1971, there were 13 members of the House and one black member of the Senate"}, {"url": "https://en.wikipedia.org/wiki/Voting_Rights_Act", "passage_text": "It was signed into law by President Lyndon B. Johnson during the height of the American Civil Rights Movement on August 6, 1965, and Congress later amended the Act five times to expand its protections. The Voting Rights Act of 1965 is a landmark piece of federal legislation in the United States that prohibits racial discrimination in voting."}, {"url": "http://www.history.com/topics/black-history/voting-rights-act", "passage_text": "After debating the bill for more than a month, the U.S. House of Representatives passed the bill by a vote of 333-85 on July 9. Johnson signed the Voting Rights Act into law on August 6, with Martin Luther King Jr. and other civil rights leaders present at the ceremony. In 1965, at the time of the passage of the Voting Rights Act, there were six African-American members of the U.S. House of Representativesandno blacks in the U.S. Senate. By 1971, there were 13 members of the House and one black member of the Senate"}, {"url": "http://www.nolo.com/legal-encyclopedia/content/voting-act.html", "passage_text": "AN ACT To enforce the fifteenth amendment to the Constitution of the United States, and for other purposes. Be it enacted by the Senate and House of Representatives of the United States of America in Congress assembled, That this Act shall be known as the Voting Rights Act of 1965.. SEC. 2. The Voting Rights Act of 1965 outlawed the discriminatory voting practices that had been used to disenfranchise black Americans since the Civil War. It was an act to enforce the 15th Amendment to the Constitution, which had been ratified nearly a century earlier."}, {"url": "http://civilrights.findlaw.com/discrimination/civil-rights-and-voting-history-and-law.html", "passage_text": "Download article as a PDF. The Voting Rights Act of 1965 prohibits discrimination in voting practices or procedures because of race and color. In 1957 and 1960, Congress had enacted voting rights laws that took small steps toward increasing minority voting participation for all Americans. "}]