[{"url": "http://www.investopedia.com/articles/pf/07/avoid_pmi.asp", "passage_text": "1 Cost-Private mortgage insurance typically costs between 0.5% to 1% of the entire loan amount on an annual basis. 2  On a $100,000 loan this means the homeowner could be paying as much as $1,000 a year, or $83.33 per month-assuming a 1% PMI fee. 1 On a $100,000 loan this means the homeowner could be paying as much as $1,000 a year, or $83.33 per month-assuming a 1% PMI fee. ( 2 Calculated as: $100,000 x 1% = $1,000 / 12 = $83.33) By itself that's a pretty hefty sum."}, {"url": "http://www.homebuyinginstitute.com/news/how-much-is-pmi-538/", "passage_text": "PMI fees are generally expressed as a percentage of the loan amount. They can range from about 0.3% to 1.15% of the amount being borrowed. This is the amount you pay each year. (Example: a $300,000 home loan with an annual insurance rate of 0.5% would have $1,500 added onto it every year. But in most cases, a down payment below 20% brings the added cost of PMI. In 2014, the cost of private mortgage insurance ranges from 0.3% to 1.15% of the base loan amount, on average. This could increase your monthly payments anywhere from $50 to more than $100 a month"}, {"url": "http://personalfinance.costhelper.com/mortgage-insurance.html", "passage_text": "1 Private mortgage insurance typically costs 0.5%-1% of the entire loan amount on an annual basis. 2  On a $200,000 loan this means the homeowner could pay as much as $2,000 a year, or $167 per month. 1 The monthly insurance premium is calculated as a percent of the mortgage annually, and then divided by 12 for equal monthly payments. 2 "}, {"url": "http://www.zillow.com/mortgage-learning/private-mortgage-insurance/", "passage_text": "How much is PMI? Conventional Mortgage insurance rates vary — usually, the lower your down payment and/or the lower your credit score, the higher the premiums — but typically the premiums can range from $30-70 per month for every $100,000 borrowed. So, if you bought a $300,000 home, you might pay about $150 per month for mortgage insurance. On FHA loans, there is an up-front MIP (mortgage insurance premium) and annual premium which is collected monthly. VA loans have an up-front fee(funding fee) and no annual or monthly premiums."}, {"url": "http://michaelbluejay.com/house/pmi.html", "passage_text": "Last update: June 2013 (includes new FHA rules & rates). When your down payment is less than 20%, you usually have to pay for Mortgage Insurance, (PMI). This protects the lender in case you don't make your house payments, they repossess your house, and they have to sell it for less than the amount left on the loan. Your down payment is $10,000 and the morgtage is $190,000. Divide the $190,000 mortgage by 1500 and you get your monthly PMI cost, $127. PMI doesn't change as the outstanding balance changes."}, {"url": "http://www.investopedia.com/articles/pf/07/avoid_pmi.asp", "passage_text": "For a couple with a $250,000 loan and a $2,500 annual PMI payment (1% of the outstanding loan), this deduction could translate into savings of $300 to $400 dollars or more (depending upon the couple's tax bracket). Also private mortgage insurance often can be paid up front. 1 On a $100,000 loan this means the homeowner could be paying as much as $1,000 a year, or $83.33 per month-assuming a 1% PMI fee. ( 2 Calculated as: $100,000 x 1% = $1,000 / 12 = $83.33) By itself that's a pretty hefty sum."}, {"url": "http://www.investopedia.com/articles/pf/07/avoid_pmi.asp", "passage_text": "Six Good Reasons to Avoid PMI. 1  Cost-Private mortgage insurance typically costs between 0.5% to 1% of the entire loan amount on an annual basis. 2  On a $100,000 loan this means the homeowner could be paying as much as $1,000 a year, or $83.33 per month-assuming a 1% PMI fee. 1 On a $100,000 loan this means the homeowner could be paying as much as $1,000 a year, or $83.33 per month-assuming a 1% PMI fee. ( 2 Calculated as: $100,000 x 1% = $1,000 / 12 = $83.33) By itself that's a pretty hefty sum."}, {"url": "http://www.mtgprofessor.com/A%20-%20PMI/what_is_the_real_cost_of_mortgage_insurance.htm", "passage_text": "Mortgage insurance costs can be reduced if you manage to get the insurance removed early. For example, if the insurance on a 95% fixed-rate mortgage is removed in 5 years but you stay with the mortgage for 10, the cost falls to 10.8%. However, if you move in 5 years and pay off the mortgage, there is no saving. The cost calculation above assumes that you take a fixed-rate mortgage with a loan-to-value ratio of 95%, and pay mortgage insurance for 10 years. Change the assumptions and you change the cost. For example: *On 85% and 90% loans, the cost is 13.4% and 12.5%, respectively."}, {"url": "http://michaelbluejay.com/house/pmi.html", "passage_text": "A rough way to estimate the monthly PMI cost for 30-year conventional loans is to divide the loan amount by 900, 1300, 1900, or 3200 for loans with down payments of 3%, 5%, 10%, or 15% respectively. For example, let's say you buy a $200,000 home and put 5% down. Your down payment is $10,000 and the morgtage is $190,000. Divide the $190,000 mortgage by 1500 and you get your monthly PMI cost, $127. PMI doesn't change as the outstanding balance changes."}]