[{"url": "http://www.sciencedirect.com/science/article/pii/S0143974X03002013", "passage_text": "A combined experimental and theoretical study on the racking strength and stiffness of cold-formed steel wall frames is presented. A variety of bracing methods including no bracing, bracing with cement particle board or oriental strand board, and bracing with single or double X strap are investigated. 9, strap width has a relatively small effect on racking failure load and strap force, but great influence on the deflection. For a 10 times increase in strap width, the racking failure load only increases by about 10%, whereas the deflection is reduced by about 5 times."}, {"url": "http://timber.ce.wsu.edu/Resources/papers/2-1-2.pdf", "passage_text": "It is showed 2.35 times of racking strength for the wall nailed in the same manner as comparedto the results of gypsum wall specimens (Yeh, 1997).Interior finish and sidingsThe spruce wood has been extensively used as interior wall board in Taiwan. Asindicated in Table 2, the values of racking strength for the wood-framed wall sheathed with calcium silicate panel aretwice of those wall sheathed with 12-mm thick gypsum boards, in which are commonly used for noise insulation."}, {"url": "http://www.usacarry.com/racking-pistol-slide-technique-not-strength/", "passage_text": "I want to emphasize that efficiently racking a slide is NOT about muscles and strength, it is about TECHNIQUE and your positive mindset and practice. So, I want to share with you some of the considerations and the technique for easily racking a semi-automatic pistol. "}, {"url": "http://timber.ce.wsu.edu/Resources/papers/5-4-2.pdf", "passage_text": "The ultimate racking strength of shear walls was reached at around or before the displacement of 20mm. Inthis study, the required minimum racking strength and minimum width for shear wall was proposed to be 500kgf and900mm, respectively. Racking resistance of shear walls decreased linearly as opening area increased. However, whenthe shear wall section left after opening cut is less than the required minimum width for shear wall, the racking resistancewas considerably less than the linear relationship between racking strength and opening area. For example, the required minimum racking is 500kgf for shear wall, then around 955mm can be obtained as the minimum width for shear walls from the equation for NB (SEC) (stabilized. envelope curve for specimens with no hold-down connector)."}, {"url": "http://timber.ce.wsu.edu/Resources/papers/2-1-2.pdf", "passage_text": "Besides, the values of racking strength and shear modulus for thewall specimens with spruce boards applied horizontally was reduced to 61% and 31%, respectively, if the smaller size ofthe finish board with 0.95cm (t) ×8.41cm (w) was applied instead. Asindicated in Table 2, the values of racking strength for the wood-framed wall sheathed with calcium silicate panel aretwice of those wall sheathed with 12-mm thick gypsum boards, in which are commonly used for noise insulation."}, {"url": "http://timber.ce.wsu.edu/Resources/papers/2-1-2.pdf", "passage_text": "The racking strength and shear modulus values of the wall sheathed with 3-mm thick fancy plywood were only60% and 40% of those evaluated from the walls sheathed with 12-mm thick gypsum wall, respectively. While the sheardeformation was increased up to 56% as compared to that of gypsum wall. Asindicated in Table 2, the values of racking strength for the wood-framed wall sheathed with calcium silicate panel aretwice of those wall sheathed with 12-mm thick gypsum boards, in which are commonly used for noise insulation."}, {"url": "http://www.ncsu.edu/bioresources/BioRes_02/BioRes_02_1_003_019_Bi_Coffin_RackingStrengthPaperboard.pdf", "passage_text": "PEER-REVIEWED ARTICLE ncsu.edu/ bioresources Bi and Coffin (2006). “Racking Strength of Paperboard,” B io R esources 2(1), 3-19. 6 tests before stud replacement, and (3) the optional use of a middle wooden stud at the center of one span in the 32-inch racking tester. PEER-REVIEWED ARTICLE ncsu.edu/ bioresources Bi and Coffin (2006). “Racking Strength of Paperboard,” B io R esources 2(1), 3-19. 9 portion of the curve corresponds to lifting the frame off the bottom support."}, {"url": "http://www.centexsprayfoam.com/index.php?option=com_content&view=article&id=145:what-is-racking-strength&catid=37:articles", "passage_text": "Racking strength, simply explained, is the ability of a square or rectangular (wall) area to maintain its shape under duress. The picture below (from an old federal document testing racking strength) demonstrates what can happens with stress exceeds a wall's racking strength. "}, {"url": "http://www.ncsu.edu/bioresources/BioRes_02/BioRes_02_1_003_019_Bi_Coffin_RackingStrengthPaperboard.pdf", "passage_text": "10. Clearly the gluing method provided superior racking stiffness and racking strength with a 40-50% increase in racking strength and about a 50% increase in racking stiffness for paperboard A. The average values of buckling extents and initial slopes (average-type) are compared for the two methods in Table 3. PEER-REVIEWED ARTICLE ncsu.edu/ bioresources Bi and Coffin (2006). “Racking Strength of Paperboard,” B io R esources 2(1), 3-19. 9 portion of the curve corresponds to lifting the frame off the bottom support."}, {"url": "http://www.ncsu.edu/bioresources/BioRes_02/BioRes_02_1_003_019_Bi_Coffin_RackingStrengthPaperboard.pdf", "passage_text": "PEER-REVIEWED ARTICLE ncsu.edu/ bioresources Bi and Coffin (2006). “Racking Strength of Paperboard,” B io R esources 2(1), 3-19. 17 012345670.00 0.01 0.02 0.03 0.04 Racking Shear StrainRacking Shear Load (KN/m) gluedstapled Fig. PEER-REVIEWED ARTICLE ncsu.edu/ bioresources Bi and Coffin (2006). “Racking Strength of Paperboard,” B io R esources 2(1), 3-19. 9 portion of the curve corresponds to lifting the frame off the bottom support."}]