[{"url": "http://www.shrinkabulls.com/fab/french-bulldog-nutrition.htm", "passage_text": "French bulldogs should drink about an ounce of water per pound of body weight daily, and of course have fresh, clean water available several times per day. Most French bulldogs regulate their own intake; if you notice changes in your Frenchie's drinking habits, see your vet, as this could indicate health problems."}, {"url": "http://healthypets.mercola.com/sites/healthypets/archive/2014/05/07/dog-water-consumption.aspx", "passage_text": "So a healthy 65-pound Labrador Retriever should be drinking between about 33 and 65 ounces, or about ¼ to ½ gallon of water daily. If your dog is eating a moisture-rich, species-appropriate diet, she’s getting some of her water needs met with each meal, so she may not drink as much from her water bowl."}, {"url": "http://dogcare.dailypuppy.com/much-water-should-new-puppy-drink-2986.html", "passage_text": "The average dog needs between 1/2 ounce to 1 ounce of water per pound of body weight in a given day. If your puppy weighs 20 pounds, for instance, he’d need between 10 and 20 ounces of water for the day to stay hydrated. Most dogs will automatically hydrate to the correct amount, though some may over-or under drink."}, {"url": "http://www.dogster.com/dog-food/how-much-water-should-a-dog-drink", "passage_text": "How much water a day should a dog drink? How much and how carefully you have to monitor him depends on several factors: 1  Size: On the average, a healthy dog drinks about 1/2 to 1 ounce of water per pound of body weight per day."}, {"url": "http://healthypets.mercola.com/sites/healthypets/archive/2014/05/07/dog-water-consumption.aspx", "passage_text": "1 How much water your dog needs each day depends on several factors, including her size, diet, age, activity level, and the time of year. 2  As a general rule, healthy dogs need from ½ to 1 ounce of water per pound of body weight each day."}, {"url": "http://www.mycockerspaniel.com/h2o.htm", "passage_text": "dogs requirement of water (ml/day) = (70 (body weight in kg)0.75) x 1.6. As a general guideline, the daily water requirement of dogs and cats, expressed in ml/day, is roughly equivalent to the daily energy requirement (DER) in kcal/day (for dogs 1.6 x resting energy requirement [RER], for cats 1.2 x RER)."}, {"url": "http://pets.webmd.com/dogs/my-dog-always-thirsty", "passage_text": "If your dog seems mildly dehydrated but is not vomiting, give your pet small amounts of water -- one teaspoon for a little dog, 1-2 tablespoons for larger dogs -- every ten minutes for a few hours."}, {"url": "http://www.dogster.com/dog-food/how-much-water-should-a-dog-drink", "passage_text": "1 Size: On the average, a healthy dog drinks about 1/2 to 1 ounce of water per pound of body weight per day. 2  Food: A healthy diet is as important as water and the type of food your dog eats affects his water intake."}]