[{"url": "http://www.mass.gov/eea/agencies/massdep/water/drinking/arsenic-in-private-well-water-faqs.html", "passage_text": "Arsenic (chemical symbol As) occurs naturally in soil and bedrock in many parts of the United States, including parts of Massachusetts. During the 1800s it was mined commercially in New Hampshire, but since 1985 arsenic used in the U.S. has been imported. Activities that could have left arsenic residuals include apple orchard spraying, coal ash disposal, and use of some pressure treated wood."}, {"url": "http://www.cancer.org/cancer/cancercauses/othercarcinogens/intheworkplace/arsenic?sitearea=PED", "passage_text": "Arsenic is a natural element that can be found in rocks and soil, water, air, and in plants and animals. It can also be released into the environment from some agricultural and industrial sources. "}, {"url": "http://www.fda.gov/Food/ResourcesForYou/Consumers/ucm271595.htm", "passage_text": "Arsenic is present in the environment as a naturally occurring substance or as a result of contamination from human activity. It is found in water, air, food and soil. There are two general types of arsenic: organic and inorganic. Some scientific studies have shown that two forms of organic arsenic found in apple juice, dimethylarsinic acid (DMA) and monomethylarsonic acid (MMA), may also be a health concern, and because of this, the FDA is considering how any possible health risk from these two forms of organic arsenic should be evaluated."}, {"url": "https://en.wikipedia.org/wiki/Arsenic", "passage_text": "Arsenic is a chemical element with symbol As and atomic number 33. Arsenic occurs in many minerals, usually in conjunction with sulfur and metals, and also as a pure elemental crystal. Arsenic is a metalloid. It can exist in various allotropes, although only the gray form has important use in industry. The three most common arsenic allotropes are metallic gray, yellow, and black arsenic, with gray being the most common. Gray arsenic (α-As, space group R 3 m No. 166) adopts a double-layered structure consisting of many interlocked, ruffled, six-membered rings."}, {"url": "http://www.fda.gov/ForConsumers/ConsumerUpdates/ucm319827.htm", "passage_text": "Arsenic is a chemical element distributed in the Earth’s crust. It is released from volcanoes and from the erosion of mineral deposits. It is found throughout the environment—in water, air and soil. "}, {"url": "http://www.greenfacts.org/en/arsenic/", "passage_text": "2.1 Arsenic is found in the natural environment in some abundance in the Earth’s crust and in small quantities in rock, soil, water and air. It is present in many different minerals. About one third of the arsenic in the atmosphere comes from natural sources, such as volcanoes, and the rest comes from man-made sources. Due to natural geological contamination, high levels of arsenic can be found in drinking water that has come from deep drilled wells. 2.3 Arsenic occurs in different forms and some is transported between different parts of the environment where it may change its form. Arsenic in weathered rock or soil can be picked up and moved by the wind and water."}, {"url": "http://www.ecy.wa.gov/programs/tcp/area_wide/AW/AppK_gardening_guide.pdf", "passage_text": "3 Gardening on Lead-and Arsenic-Contaminated Soils h Lead and arsenic in the environment Lead is a metallic element found everywhere in the human environment because of industri-alization. Humans have used it in some form since prehistoric times. 6 A Gardening on Lead-and Arsenic-Contaminated Soils Soil testing Chemical analysis of soil will confirm the presence of elevated concentrations of leador arsenic.Locate a soil testing laboratory and discuss requirements for soil sample size and containersbefore collecting samples."}, {"url": "http://www.greenfacts.org/en/arsenic/l-2/arsenic-2.htm", "passage_text": "Inorganic arsenic of geological origin is found in groundwater used as drinking water in several parts of the world, for example Bangladesh, India and Taiwan. Some chemical forms of arsenic adhere strongly to clay and organic matter and this can affect how they behave in the environment. There is potential for arsenic to be released from water and sediments, again depending on the chemical and biological conditions."}, {"url": "http://www.greenfacts.org/en/arsenic/l-2/arsenic-2.htm", "passage_text": "The transport and distribution of arsenic in the environment is complex, due to the many chemical forms in which it may be present and because there is continuous cycling of different forms of arsenic through air, soil and water. Some chemical forms of arsenic adhere strongly to clay and organic matter and this can affect how they behave in the environment. There is potential for arsenic to be released from water and sediments, again depending on the chemical and biological conditions."}, {"url": "http://www.fda.gov/Food/ResourcesForYou/Consumers/ucm271595.htm", "passage_text": "Even organic apples come from trees that grow in soil that may contain arsenic. The FDA is not aware of any data that shows a difference in the amount of arsenic found in organic juice vs. non-organic juice. Some scientific studies have shown that two forms of organic arsenic found in apple juice, dimethylarsinic acid (DMA) and monomethylarsonic acid (MMA), may also be a health concern, and because of this, the FDA is considering how any possible health risk from these two forms of organic arsenic should be evaluated."}]