[{"url": "http://kids.nceas.ucsb.edu/biomes/temperateforest.html", "passage_text": "Following rainforests, temperate deciduous forests are the second-rainiest biome. The average yearly precipitation is 30 - 60 inches (75 - 150 cm). This precipitation falls throughout the year, but in the winter it falls as snow. The average temperature in temperate deciduous forests is 50°F (10°C). "}, {"url": "http://www.answers.com/Q/Average_rainfall_in_the_coniferous_forest", "passage_text": "Most precipitation in the Coniferous forest arrives as rain in summer. The average yearly precipitation is 12 to 33 inches.     Hope This Helps!  … ~Harlee C. . "}, {"url": "http://www.blueplanetbiomes.org/taiga_climate_page.htm", "passage_text": "For half of the year, the average temperature is below freezing. In the winter the average air temperature is warmer than it is for tundra, which lies north of the taiga. The taiga climate has an average annual rainfall of 12 - 33 inches (30 - 84 cm). Most of it falls in the summer as rain. The Dis a snow climate, while the fmeans there is enough precipitation in all months. The cmeans that fewer than 4 months have an average temperature over 50° F (10° C). The taiga climate is for the most part dominated by cold arctic air."}, {"url": "http://www.blueplanetbiomes.org/taiga_climate_page.htm", "passage_text": "The average precipitation for the summer is between 10-20 inches. The average precipitation for the winter is between 20-40 inches. The type of precipitation that falls in the taiga climate are rain in summer andmostly snow in winter. The Dis a snow climate, while the fmeans there is enough precipitation in all months. The cmeans that fewer than 4 months have an average temperature over 50° F (10° C). The taiga climate is for the most part dominated by cold arctic air."}, {"url": "http://www.answers.com/Q/What_is_the_average_precipitation_of_the_coniferous_forest", "passage_text": "Most precipitation in the Coniferous forest arrives as rain in summer. The average yearly precipitation is 12 to 33 inches. What is the average yearly precipitation in a tropical rain forest? in the tropical rain forest, 50-260 inches(125-660cm) is the yearly average precipitation."}, {"url": "http://northwesternconiferousforest.blogspot.com/2014/04/climate.html", "passage_text": "Climate. The majority of the Northwestern Coniferous Forest is found in the temperate climate zone. Because of this biome's climate zone, abundant amounts of rainfall, and lush vegetation, this biome is also known as a temperate rainforest. Temperatures can get very cold in the winter, and fairly warm in the summer. Average yearly temperatures range from 14° F, to 60°F. Moist oxygen coming from the Pacific ocean provides large amounts of rainfall to the Northwestern Coniferous Forest. The majority of this biome's precipitation comes in the spring, fall, and winter. Yearly, this biome receives up to 150 millimeters of precipitation."}, {"url": "http://www.answers.com/Q/What_is_the_average_precipitation_of_the_coniferous_forest", "passage_text": "The average rainfall in the coniferous forest biome is 12 to 33 inches a year. What is the average yearly precipitation in a tropical rain forest? in the tropical rain forest, 50-260 inches(125-660cm) is the yearly average precipitation."}, {"url": "http://www.earthobservatory.nasa.gov/Experiments/Biome/bioconiferous.php", "passage_text": "Some of the more common conifers are spruces, pines, and firs. Precipitation in coniferous forests varies from 300 to 900 mm annually, with some temperate coniferous forests receiving up to 2,000 mm. The amount of precipitation depends on the forest location. In the northern boreal forests, the winters are long, cold and dry, while the short summers are moderately warm and moist. In the lower latitudes, precipitation is more evenly distributed throughout the year. "}, {"url": "http://cforest.weebly.com/climateannual-graphs.html", "passage_text": "The average climate for the coniferous forest each year falls below -32°F. This biome can also be as low as -76°F. In the summer, the temperature can reach as high as 104°F. Fall is the shortest season and spring brings flowers and animals that wake up from hibernation. But when summertime finally comes around, the forest can get up to 20 hours of sunlight. Summer rain gives the forest an average of 10-20 inches of rain per year, and in winter snow is always on the ground."}, {"url": "http://cforest.weebly.com/climateannual-graphs.html", "passage_text": "During wintertime, the forest may only get a few key hours of sunlight. But when summertime finally comes around, the forest can get up to 20 hours of sunlight. Summer rain gives the forest an average of 10-20 inches of rain per year, and in winter snow is always on the ground. There is a low evaporation rate, so the climate in the forest is very humid"}]