[{"url": "http://www.md-health.com/Leukocytes.html", "passage_text": "Leukocytes in urine are not a dangerous condition, but they are a sign that you are suffering from an infection or damage. Leukocytes are white blood cells (WBC) that work with the immune system to defend against infectious disease. Damage to the kidneys, ureters, urethra or bladder can cause leukocytes to appear. Bladder infections or inflammation of the urinary tract and ureters can also cause leukocytes to appear in the urine. Sexual intercourse can cause the transfer of bacteria that can cause an infection to form in the urinary tract."}, {"url": "https://www.healthtap.com/topics/what-does-a-trace-of-leukocytes-in-urine-mean", "passage_text": "Get help from a doctor now ›. Usually normal: Leukocyte esterase released by lysed neutrophils and macrophages is a surrogate marker of the presence of white blood cells (WBCs). Leukocyte esterase suggests that there are white blood cells in the urine. Get help from a doctor now ›. Leukocytes = WBCs: White blood cells in the urine indicate that an inflammatory or immune system reaction is taking place. Without more information, in terms of other urine or laboratory markers, symptoms, etc. That is about all one can say with regard to this."}, {"url": "http://www.wisegeek.org/what-do-urinary-leukocytes-indicate.htm", "passage_text": "Leukocytes are white blood cells that protect the body from infections and certain diseases. White blood cells in the urine are detected by measuring the amount of leukocyte esterase in the urine. Esterase is an enzyme that is produced by white blood cells, and it is the identifying factor in detecting leukocytes. "}, {"url": "http://symptomstreatment.org/leukocytes-in-urine-what-does-it-mean/", "passage_text": "Sponsored link. The presence of leukocytes in urine is generally indicative of a urinary tract infection. When a urinalysis is ordered, it may be ordered as part of a panel of multiple constitutes monitoring for abnormal levels; or as a single test called leukocyte esterase. "}, {"url": "http://www.justanswer.com/medical/6tle3-does-trace-a-mean-leukocyte-esterase-unrinalysis.html", "passage_text": "Hi, I'm Doctor Robert, a Medical Internist (MD) who deals with diseases of all organ systems. All my education has been completed in the US. Trace amounts of leukocyte esterase which is produced by White Blood Cell (WBC) in the urine. That they are there indicates the possibility of an infection. Normal urine has NO WBC's, so if they're there, they're there for a reason; to fight bacteria"}, {"url": "http://www.ehow.com/about_5577338_positive-leukocytes-mean.html", "passage_text": "Save. Leukocytes are a type of white blood cell. When urine is positive for leukocytes, there are leukocytes in the urine. White blood cells in urine are typically a sign of infection. A urinalysis positive for leukoctyes is most commonly the result of a urinary tract infection. "}, {"url": "https://en.wikipedia.org/wiki/Leukocyte_esterase", "passage_text": "Leukocyte esterase (LE) is a urine test for the presence of white blood cells and other abnormalities associated with infection. White blood cells in the urine usually indicate a urinary tract infection. The leukocyte esterase (LE) test detects esterase, an enzyme released by white blood cells. Positive test results are clinically significant."}, {"url": "http://www.md-health.com/Leukocytes.html", "passage_text": "A blockage in the urinary tract can cause leukocytes to appear in the urine. This is often accompanied by blood in the urine. Trauma to the pelvis, a pelvis tumor, bladder or kidney stones, unwanted objects in the urinary tract or prostate hypertrophy can cause a blockage that damages the urinary system. Bladder infections or inflammation of the urinary tract and ureters can also cause leukocytes to appear in the urine. Sexual intercourse can cause the transfer of bacteria that can cause an infection to form in the urinary tract."}, {"url": "http://symptomstreatment.org/leukocytes-in-urine/", "passage_text": "A test known as urinalysis is normally used to detect the occurrence of leukocytes in urine. The detection of leukocytes in urine via the above mentioned test most often indicates that there may be infection of the urinary tract. However, leukocytes in urine may result from other causes as well. "}]