[{"url": "https://blog.lizardwrangler.com/2008/02/28/steering-committee/", "passage_text": "The Steering Committee is a set of people who both represent and provide leadership in the various types of activities we are working on. Today the term “Steering Committee” is used inside the Mozilla Corporation (“MoCo”). Mozilla Messaging may or may not use this term or mechanism, and the Mozilla Foundation doesn’t currently use this term. The goals of the Steering Committee are: 1  to track the overall progress of MoCo efforts;"}, {"url": "http://www.trentu.ca/vpadmin/committees_ITSteeringCommittee.php", "passage_text": "An IT Steering Committee is an administrative body that reviews, monitors and prioritizes major IT projects from a cross-functional perspective. The two key concerns of a technology steering committee are: Alignment. The committee helps ensure that IT strategy is aligned with the strategic goals of the organization. "}, {"url": "https://en.wikipedia.org/wiki/Steering_committee", "passage_text": "A steering committee is a committee that provides guidance, direction and control to a project within an organization. The term is derived from the steering mechanism that changes the steering angle of a vehicle's wheels. A standing committee is a subunit of a political or deliberative body established in a permanent fashion to aid the parent assembly in accomplishing its duties."}, {"url": "http://www.esi-intl.co.uk/blogs/pmoperspectives/index.php/appreciating-the-role-of-the-steering-group-part-1/", "passage_text": "Give Strategic Direction. Normally, the members of a Steering Committee are selected because they are in such positions in an organisation that the ability and authority to make strategic decisions is a natural assumption, and this is usually the case. Thus, a Steering Committee typically comprises senior managers who have a vested interest in the delivery and/or outcome of the project/programme. We take a look at both of those guiding principles in turn."}, {"url": "http://searchcio.techtarget.com/definition/steering-committee", "passage_text": "Upland WorkEngine. A steering committee is a group of high-level advisors who have been asked to govern an organization or organizational segment and provide it with direction. Download 9 FREE Strategic Planning Templates that your Peers Already Use. Many steering committees create project charters to hold project teams accountable. Other possible functions and objectives of an IT steering committee include: 1  Building a business case for an IT project. 2  Encouraging a collaborative work environment. 3  Monitoring progress towards goals."}, {"url": "https://en.wikipedia.org/wiki/Steering_committee", "passage_text": "A committee (or commission) is a type of small deliberative assembly that is usually intended to remain subordinate to another, larger deliberative assembly. When a larger assembly meets as a committee to discuss or debate, this is called a  committee of the whole . A standing committee is a subunit of a political or deliberative body established in a permanent fashion to aid the parent assembly in accomplishing its duties."}, {"url": "http://www.egovernment.tas.gov.au/__data/assets/pdf_file/0008/78182/Steering_Committee_Nuts_and_Bolts_Fact_Sheet.pdf", "passage_text": "A project Steering Committee is the key body within the governance structure which is responsible for the business issues associated with the project that are essential to the ensuring the delivery of the project outputs and the attainment of project outcomes. "}, {"url": "https://en.wikipedia.org/wiki/Steering_committee", "passage_text": "1 Large academic conferences are usually organized by a co-ordinating committee drawn from the relevant professional body. 2  Research and recommendations: Committees are often formed to do research and make recommendations on a potential or planned project or change. A standing committee is a subunit of a political or deliberative body established in a permanent fashion to aid the parent assembly in accomplishing its duties."}, {"url": "https://blog.lizardwrangler.com/2008/02/28/steering-committee/", "passage_text": "Steering Committee. Every now and then someone asks a question about the “Steering Committee” so I thought I’d give some background on what it is and how it came to be. The Steering Committee began early in the days of the Mozilla Foundation, sometime in 2004, I’m guessing. Today the term “Steering Committee” is used inside the Mozilla Corporation (“MoCo”). Mozilla Messaging may or may not use this term or mechanism, and the Mozilla Foundation doesn’t currently use this term. The goals of the Steering Committee are: 1  to track the overall progress of MoCo efforts;"}, {"url": "http://it.toolbox.com/blogs/coneblog/roles-of-your-steering-committee-1454", "passage_text": "They wished that the had paid more attention to who participated in the project steering committee, and the role of the committee. These days, it is not enough to deliver a technically successful IT project – you have to bring the customer community along, and the best way to do that is with a Steering Committee. Here is a list of Steering Committee Roles and Responsibilities: • Take responsibility for the project's feasibility, business plan and achievement of outcomes; • Ensure the project's scope aligns with the requirements of the stakeholder groups, and to represent stakeholder interests in project deliberations;"}]