[{"url": "http://www.answers.com/Q/What_is_the_difference_between_codon_and_anticodon", "passage_text": "Each transfer RNA has an anticodon whose bases are complementary to a codon on the mRNA strand. The ribosome positions the start codon to attract its anticodon, which is … part of the tRNA that binds the next codon and its anticodon. A codon is the triplet sequence in messenger RNA (mRNA) that specifies an amino acid or a start or stop command. Its complementary sequence in transfer RNA (tRNA) is cal … led the anticodon. 1 person found this useful. 1  The Five Major Parts of the Brain At its most basic, the brain controls the body."}, {"url": "http://www.merriam-webster.com/dictionary/anticodon", "passage_text": "Medical Definition of ANTICODON. : a triplet of nucleotide bases in transfer RNA that identifies the amino acid carried and binds to a complementary codon in messenger RNA during protein synthesis at a ribosome. ADVERTISEMENT."}, {"url": "https://answers.yahoo.com/question/index?qid=20090119233709AA63jPc", "passage_text": "Best Answer: Basically, tRNA has a nucleotide triplet that is called an anticodon. The anticodon corresponds with the codon on the mRNA. In the process of translation during protein synthesis, the mRNA goes through a ribosome, and as it travels through, tRNA with the anticodon that matches each mRNA codon join. On the other end of the tRNA is an amino acid. Each anticodon codes for an amino acid. As each tRNA meets with its corresponding mRNA codon as the codon moves along the ribosome, the amino acids join one by one, eventually forming a polypeptide which is processed to become a specific protein."}, {"url": "https://en.wikipedia.org/wiki/Transfer_RNA", "passage_text": "An anticodon is a unit made up of three nucleotides that correspond to the three bases of the codon on the mRNA. Each tRNA contains a specific anticodon triplet sequence that can base-pair to one or more codons for an amino acid. One end of the tRNA matches the genetic code in a three-nucleotide sequence called the anticodon. The anticodon forms three base pairs with a codon in mRNA during protein biosynthesis. The mRNA encodes a protein as a series of contiguous codons, each of which is recognized by a particular tRNA."}, {"url": "http://www.answers.com/Q/What_is_the_difference_between_codon_and_anticodon", "passage_text": "A codon is the triplet sequence in the messenger RNA (mRNA) transcript which specifies a corresponding amino acid (or a start or stop command). An anticodon is the corresponding triplet sequence on the transfer RNA (tRNA) which brings in the specific amino acid to the ribosome during translation. The anticodon is complementary to the codon, that is, if the codon is AUU, then the anticodon is UAA. There are no T (Thymine) nitrogen bases in mRNA. A codon is the triplet sequence in messenger RNA (mRNA) that specifies an amino acid or a start or stop command. Its complementary sequence in transfer RNA (tRNA) is cal … led the anticodon. 1 person found this useful. 1  The Five Major Parts of the Brain At its most basic, the brain controls the body."}, {"url": "http://academic.brooklyn.cuny.edu/biology/bio4fv/page/antico.htm", "passage_text": "The anticodon region of a transfer RNA is a sequence of three bases that are complementary to a codon in the messenger RNA. During translation, the bases of the anticodon form complementary base pairs witht the bases of the codon by forming the appropriate hydrogen bonds. In this diagram you see a tRNA that has the anticodon UUU which is complementary to the codon AAA. The codon AAA specifies the amino acid phenylalanine. You also see the tRNA with the anticodon CCC which is complementary to the codon GGG. The codon GGG specifies the amino acid glycine"}, {"url": "http://medical-dictionary.thefreedictionary.com/anticodon", "passage_text": "a sequence of three nucleotides found in transfer RNA. Each anticodon pairs complementarily with a specific codon of messenger RNA during protein synthesis and specifies a particular amino acid in the protein. See also genetic code, transcription, translation. anticodon. a triplet of nucleotides in transfer RNA that is complementary to the codon in messenger RNA that specifies the amino acid. Anticodon. The three nucleotides (shaded) on a transfer RNA bind to a complementary messenger RNA codon. From Dorland's, 2000"}, {"url": "https://en.wikipedia.org/wiki/Transfer_RNA", "passage_text": "A transfer RNA (abbreviated tRNA and archaically referred to as sRNA, for soluble RNA) is an adaptor molecule composed of RNA, typically 76 to 90 nucleotides in length, that serves as the physical link between the mRNA and the amino acid sequence of proteins. One end of the tRNA matches the genetic code in a three-nucleotide sequence called the anticodon. The anticodon forms three base pairs with a codon in mRNA during protein biosynthesis. The mRNA encodes a protein as a series of contiguous codons, each of which is recognized by a particular tRNA."}]