[{"url": "http://knowledgecenter.csg.org/kc/content/savings-and-cost-containment-medicaid", "passage_text": "Thursday, June 26, 2014 at 08:48 AM. |. WASHINGTON, D.C.—A tobacco cessation program in Massachusetts saved the state Medicaid program $3 for every $1 it invested within the first 17 months. “It is very rare to have a program where cost savings can be quantified within 17 months,” Leighton Ku said about the program. Matt McKillop a senior research associate from The Pew Charitable Trusts said improper Medicaid payments cost the states $11 billion in 2010. He said the eye-popping amount led Pew to establish its Medicaid anti-fraud and abuse database, www.pewstates.org/Medicaid-fraud."}, {"url": "http://www.nasbo.org/publications-data/issue-briefs/medicaid-cost-containment-recent-proposals-and-trends-0", "passage_text": "Funding ongoing Medicaid programs is one of the greatest challenges for states. In governors’ proposed budgets for fiscal 2012, cost containment in Medicaid is a dominant theme. Medicaid spending is estimated at $354 billion in fiscal 2010, according to NASBO’s 2009 State Expenditure Report. As a result, Medicaid surpassed elementary and secondary education as the largest component of total state spending for the first time since 2006 based on estimated fi scal 2010 spending data. "}, {"url": "http://knowledgecenter.csg.org/kc/content/savings-and-cost-containment-medicaid", "passage_text": "“Research in Washington (state) shows individuals enrolled in Medicaid experienced 16 percent fewer detentions during the following year than those individuals released without coverage,” said Blandford. “They also found a cost-savings of a $1.06 to the criminal justice system for every $1 spent.”. Matt McKillop a senior research associate from The Pew Charitable Trusts said improper Medicaid payments cost the states $11 billion in 2010. He said the eye-popping amount led Pew to establish its Medicaid anti-fraud and abuse database, www.pewstates.org/Medicaid-fraud."}, {"url": "http://www.nasbo.org/sites/default/files/Medicaid%20Cost%20Containment%20-%20Recent%20Proposals%20and%20Trends_1.pdf", "passage_text": "Summary Funding ongoing Medicaid programs is one of the greatest challenges for states. In governors’ proposed budgets for fi scal 2012, cost containment in Medicaid is a dominant theme. Medicaid spending is estimated at $354 billion in fi scal 2010, according to NASBO’s 2009 State Expenditure Report. Medicaid is projected to increase at an average annual increase of 8.3 percent over the next 10 years according to the CMS Offi ce of the Actuary.Medicaid cost containment proposals follow on the heels of state actions to address Medicaid costs the past several years."}, {"url": "http://advocatesforohio.org/perch/resources/AOFMedicaidCost-ContainmentStrategiesFinalWebVersion.pdf", "passage_text": "However, Medicaid spending is growing at an unsustainable rate and Ohio has an opportunity to make changes in Medicaid that transform Ohio’s entire health care system. Advocates for Ohio’s Future (AOF) supports Governor Kasich's goal of containing health costs and making Ohio's Medicaid program more effective. 1. Incorporate housing needs into the broader view of Medicaid and health and human services overseen by the Health Transformation Office in order to break down additional barriers preventing some individuals from accessing home-and community-based care. Advocates for Ohio’s Future Medicaid Strategies Page 5 2."}, {"url": "http://www.nasbo.org/sites/default/files/Medicaid%20Cost%20Containment%20-%20Recent%20Proposals%20and%20Trends_1.pdf", "passage_text": "Below are some examples and trends of Medicaid cost containment in governors’ budget proposals for fi s-cal 2012 as well as general trends in state actions to contain Medicaid spending. Medicaid is projected to increase at an average annual increase of 8.3 percent over the next 10 years according to the CMS Offi ce of the Actuary.Medicaid cost containment proposals follow on the heels of state actions to address Medicaid costs the past several years."}, {"url": "http://knowledgecenter.csg.org/kc/content/savings-and-cost-containment-medicaid", "passage_text": "Medicaid is a reimbursement source for about 40 percent of the clients of the centers. Effective primary care can reduce specialty, emergency and inpatient cost. Ku said studies show individuals who use community health centers have a 24 percent reduction in annual health care costs. Matt McKillop a senior research associate from The Pew Charitable Trusts said improper Medicaid payments cost the states $11 billion in 2010. He said the eye-popping amount led Pew to establish its Medicaid anti-fraud and abuse database, www.pewstates.org/Medicaid-fraud."}, {"url": "http://www.nasbo.org/sites/default/files/Medicaid%20Cost%20Containment%20-%20Recent%20Proposals%20and%20Trends_1.pdf", "passage_text": "In the fi rst 6 months, the Offi ce will advance the Administration’s Medicaid modernization and cost-containment priorities of the operating budget as well as engage private sector partners to set clear over-all expectations for overall health system performance. Medicaid is projected to increase at an average annual increase of 8.3 percent over the next 10 years according to the CMS Offi ce of the Actuary.Medicaid cost containment proposals follow on the heels of state actions to address Medicaid costs the past several years."}]