[{"url": "http://wikitravel.org/en/Romsey", "passage_text": "Romsey station is on the route from Portsmouth to Cardiff via Southampton, Salisbury, Bath and Bristol, and direct trains run by First Great Western link Romsey to these places (and some other smaller places along the route) hourly, seven days a week."}, {"url": "http://wikitravel.org/en/Romsey", "passage_text": "Romsey station is located a 5 minute level walk from the town centre. Bus : Buses from Winchester (operated by Stagecoach South), Eastleigh (by Wilts & Dorset) and Southampton (by Bluestar) run frequently and stop centrally in the town. Buses from Salisbury run less frequently."}, {"url": "http://www.visitromsey.co.uk/", "passage_text": "Explore its main tourist attractions of Romsey Abbey, King John’s House and the Town Hall, all less than five minutes walk between them. Meander through the Memorial Park and follow the path along the famous River Test. Relax in its variety of restaurants, coffee shops and pubs to suit all pockets and palates."}, {"url": "http://www.maplandia.com/united-kingdom/england/south-east/hampshire-county/romsey/", "passage_text": "Welcome to the Romsey google satellite map! This place is situated in Hampshire County, South East, England, United Kingdom, its geographical coordinates are 50° 59' 0 North, 1° 30' 0 West and its original name (with diacritics) is Romsey. See Romsey photos and images from satellite below, explore the aerial photographs of Romsey in United Kingdom."}, {"url": "http://www.romseytowncouncil.hampshire.org.uk/index.htm", "passage_text": "Romsey is also home to the southern offices of Test Valley Borough Council, situated in the Former Magistrates' Court, Church Street. Many residents with a Romsey postal address actually live in Romsey Extra which has its own Parish Council and Website."}, {"url": "http://www.romseytowncouncil.hampshire.org.uk/index.htm", "passage_text": "Romsey. SO51 8YZ. 01794 512837. Romsey in Hampshire, is the Southern Gateway to the beautiful Test Valley and sits astride the river crossing at Middlebridge, a strategic staging point on the route west to the King's hunting grounds in the New Forest."}]