[{"url": "http://www.cancercenter.com/bile-duct-cancer/risk-factors/", "passage_text": "1 Family history: Although a family history of bile duct cancer may increase a person’s bile duct cancer risks, the risk is low because this is a rare disease. 2  Most cases of bile duct cancer do not appear to a have a familial link. 1 Age: Bile duct cancer is not very common in young or middle-aged adults. 2  Over 60 percent of bile duct cancer patients are 65 years or older."}, {"url": "http://www.cancer.org/cancer/bileductcancer/detailedguide/bile-duct-cancer-risk-factors", "passage_text": "1 Primary sclerosing cholangitis is a condition in which inflammation of the bile ducts (cholangitis) leads to the formation of scar tissue (sclerosis). 2  People with this condition have an increased risk of bile duct cancer. 3  The cause of the inflammation is not usually known. 1 The cause of the inflammation is not usually known. 2  Many people with this disease also have inflammation of the large intestine called ulcerative colitis. 3  Bile duct stones, which are similar to, but much smaller than gallstones, can also cause inflammation that increases the"}, {"url": "http://www.cpmc.org/advanced/liver/patients/topics/cholangiocarcinoma.html", "passage_text": "Cancer of the biliary system—including the gallbladder, bile ducts within the liver and bile ducts extending outside of the liver that drain into the intestine—is relatively uncommon, affecting about 9,000 individuals in the United States annually. "}, {"url": "http://www.cancer.org/cancer/bileductcancer/detailedguide/bile-duct-cancer-what-causes", "passage_text": "But inherited gene mutations are not thought to cause very many bile duct cancers. Gene mutations related to bile duct cancers are usually acquired during life rather than being inherited. For example, acquired changes in the TP53 tumor suppressor gene are found in most bile duct cancers. Other genes that may play a role in bile duct cancers include KRAS, HER2, and MET. Some of the gene changes that lead to bile duct cancer might be caused by inflammation. But sometimes what causes these changes is not known. Many gene changes might just be random events that sometimes happen inside a cell, without having an outside cause. "}, {"url": "http://www.cancercenter.com/bile-duct-cancer/risk-factors/", "passage_text": "GENETICS. 1  Family history: Although a family history of bile duct cancer may increase a person’s bile duct cancer risks, the risk is low because this is a rare disease. 1 Age: Bile duct cancer is not very common in young or middle-aged adults. 2  Over 60 percent of bile duct cancer patients are 65 years or older."}, {"url": "http://www.cancer.org/cancer/bileductcancer/detailedguide/bile-duct-cancer-risk-factors", "passage_text": "Several conditions of the liver or bile ducts can cause this. 1  Primary sclerosing cholangitis is a condition in which inflammation of the bile ducts (cholangitis) leads to the formation of scar tissue (sclerosis). 2  People with this condition have an increased risk of bile duct cancer. 1 The cause of the inflammation is not usually known. 2  Many people with this disease also have inflammation of the large intestine called ulcerative colitis. 3  Bile duct stones, which are similar to, but much smaller than gallstones, can also cause inflammation that increases the"}, {"url": "http://www.cpmc.org/advanced/liver/patients/topics/bileduct-profile.html", "passage_text": "Cancers of the bile ducts within the liver, liver cancers or cancers metastatic to the liver can cause obstruction of the bile duct system. Diagnosis is usually made by radiographic studies (CT or MRI). Prior to treatment of the obstruction, a full work-up of the lesion to determine the extent of disease is necessary. Pancreatic cancers can cause obstruction of the bile duct just as it enters the intestine (Figure 1b). Diagnosis is usually made radiographically. Treatment of this patient requires a multidisciplinary approach encompassing surgeons, oncologists, radiologists and radiation oncologists for optimal outcome."}, {"url": "https://en.wikipedia.org/wiki/Cholangiocarcinoma", "passage_text": "Cholangiocarcinoma is a form of cancer that is composed of mutated epithelial cells (or cells showing characteristics of epithelial differentiation) that originate in the bile ducts which drain bile from the liver into the small intestine. Other biliary tract cancers include pancreatic cancer, gallbladder cancer, and cancer of the ampulla of Vater. Cholangiocarcinoma is a relatively rare neoplasm that is classified as an adenocarcinoma (a cancer that forms glands or secretes significant amounts of mucins)."}, {"url": "http://www.medicinenet.com/bile_duct_cancer_cholangiocarcinoma/article.htm", "passage_text": "Bile duct cancer arises from the cells that line the bile ducts, the drainage system for bile produced by the liver. Bile ducts collect this bile, draining it into the gallbladder and finally into the small intestine where it aids in the digestion process. Bile duct cancer is also called cholangiocarcinoma. Bile duct cancer is a rare form of cancer, with approximately 2,000 new cases diagnosed in the United States each year. There are three general locations where this type of cancer may arise within the bile drainage system: 1  Within the liver (intrahepatic) affecting the bile ducts located within the liver. The incidence of bile duct cancer increases with age. It is a slow-growing cancer that invades local structures and for that reason, the diagnosis is often made late in the disease process when the bile ducts become blocked. This blockade prevents bile drainage from the liver into the gallbladder and intestine."}]