[{"url": "http://www.indeed.com/q-Sales-Associate-Payless-Shoesource-jobs.html", "passage_text": "PT Sales Associate. Join the Payless team as Part Time Sales Associate. Career with Payless ShoeSource the perfect fit for you. Our Payless teams are built on:...."}, {"url": "http://salesassociatejobdescriptions.com/sales-associate-duties/", "passage_text": "Welcome to Sales Associate Job Description ! Our goal is to become your number one informational resource for your aspiring career as a sales associate. We have a description of duties and responsibilities, retail sales associate resume sample and tips, salary information, a jobs listing, and more. Enjoy your stay!"}, {"url": "http://www.job-applications.com/payless-shoes-sales-associate/", "passage_text": "Applicants seeking work with major shoe retailer Payless ShoeSource must stand at least 17 years of age for employment consideration, at most locations. Entry-level job titles available include sales associate positions, which represent some of the most common positions for hire on a regular basis. The average Payless sales associate starts out as a part-time employee."}, {"url": "http://www.indeed.com/q-Sales-Associate-Payless-Shoesource-jobs.html", "passage_text": "Join the Payless team as Part Time Sales Associate*. Payless ShoeSource is an Equal Opportunity Employer. Our Payless teams are built on:...."}, {"url": "http://www.job-applications.com/payless-shoes-sales-associate/", "passage_text": "Interacting with customers and assisting in sales constitute the general responsibilities Payless ShoeSource sales associate jobs carry. Additional job duties may include ringing up purchases, retrieving shoes from shelves and back storage areas, and answering telephones."}, {"url": "http://www.indeed.com/q-Payless-Shoe-Sales-Associate-jobs.html", "passage_text": "Join the Payless team as Part Time Sales Associate*. Are passionate about shoes-Then you have FOUND YOUR FIT with Payless ShoeSource!..."}, {"url": "http://www.indeed.com/q-Sales-Associate-Payless-Shoesource-jobs.html", "passage_text": "Join the Payless team as Part Time Sales AssociateFlexible work schedule, approximate number of hours-up to 30 hours/week. Our Payless teams are built on:.... Easily apply. 19 days ago-save job-email-more... 1  View all Payless Shoe Source jobs in Crescent City, CA-Crescent City jobs."}]