[{"url": "http://www.answers.com/Q/How_fast_does_a_hurricane_travel", "passage_text": "A hurricane's rotational speed must be at least 74mph(120km/h) to be called a hurricane, anything less and it is a tropical storm or depression. A hurricane can travel from a stationary position to speeds in excess of 70 mph depending on the upper level steering current winds. Most move about 15-30 mph."}, {"url": "http://www.ask.com/science/fast-hurricanes-travel-2f340bbea0f4ffa2", "passage_text": "Meteorologists classify hurricanes based on their wind speed. A hurricane with a 74 mph wind is a Category 1 hurricane. Category 2 winds are at least 96 mph. Category 3 winds are at least 111 mph. A Category 4 hurricane has wind speeds of at least 131 mph, and those of a Category 5 are at least 155 mph. The Gulf Coast and the coast of Florida have experienced numerous hurricanes that were traveling in excess of 100 mph when they struck land."}, {"url": "http://www.answers.com/Q/How_fast_does_a_hurricane_travel", "passage_text": "Confidence votes 77. A hurricane's rotational speed must be at least 74mph(120km/h) to be called a hurricane, anything less and it is a tropical storm or depression. A hurricane can travel from a stationary position to speeds in excess of 70 mph depending on the upper level steering current winds. Most move about 15-30 mph."}, {"url": "http://www.weatherwizkids.com/weather-hurricane.htm", "passage_text": "A hurricane is a huge storm! It can be up to 600 miles across and have strong winds spiraling inward and upward at speeds of 75 to 200 mph. Each hurricane usually lasts for over a week, moving 10-20 miles per hour over the open ocean."}, {"url": "http://www.answers.com/Q/How_fast_are_hurricanes", "passage_text": "A hurricane's rotational speed must be at least 74mph(120km/h) to be called a hurricane, anything less and it is a tropical storm or depression. A hurricane can travel from a … stationary position to speeds in excess of 70 mph depending on the upper level steering current winds."}, {"url": "http://abcnews.go.com/Technology/story?id=1145613&page=1", "passage_text": "Tropical depressions have maximum sustained wind speeds of 38 mph or less -- stronger tropical storms have maximum sustained wind speeds from 39 to 73 mph. When wind speeds reach 74 mph or more, the storm is upgraded to a hurricane."}]