[{"url": "https://en.wikipedia.org/wiki/Thoracic_diaphragm", "passage_text": "The diaphragm separates the thoracic cavity containing the heart and lungs, from the abdominal cavity and performs an important function in respiration: as the diaphragm contracts, the volume of the thoracic cavity increases and air is drawn into the lungs. The diaphragm is a dome-shaped structure of muscle and fibrous tissue that separates the thoracic cavity from the abdomen."}, {"url": "http://www.webmd.com/sex/birth-control/barrier-methods-of-birth-control-19059", "passage_text": "Natural membrane (sheepskin) condoms do not protect you against all STIs. Barrier methods of birth control, such as a diaphragm, cervical cap, or condom, are a good choice if: 1  You want an option that does not require hormones or insertion of an intrauterine device. 2  You want an option that does not restrict when you have sexual intercourse, such as natural family planning. Unlike other methods of birth control, barrier methods are used only when you have sexual intercourse. Be sure to read the instructions before using a barrier method. It is very important that you use a barrier method correctly every time you have sex."}, {"url": "https://www.optionsforsexualhealth.org/birth-control-pregnancy/birth-control-options/barrier-methods/diaphragm/using-diaphragm", "passage_text": "1 Take the diaphragm and hold it up to the light. 2  Check the diaphragm for any tears or holes in the cup or for cracks along the rim before each use. 3  Squeeze at least a tablespoon of spermicidal jelly into the cup, and spread it around the rim and inside the cup with a clean finger. 1 Check the diaphragm for any tears or holes in the cup or for cracks along the rim before each use. 2  Squeeze at least a tablespoon of spermicidal jelly into the cup, and spread it around the rim and inside the cup with a clean finger. 3  Press the rim of the diaphragm together with the spermicide inside the dome."}, {"url": "https://en.wikipedia.org/wiki/Diaphragm_%28contraceptive%29", "passage_text": "A diaphragm that is too small might fit inside the vagina without covering the cervix, or might become dislodged from the cervix during intercourse or bowel movements. It is also more likely that a woman's partner will feel the anterior rim of a too-small diaphragm during intercourse. This is the strongest type of rim available in a diaphragm, and may be used by women with any level of vaginal tone. Unlike other spring types, arcing springs may be used by women with mild cystocele, rectocele, or retroversion."}, {"url": "https://en.wikipedia.org/wiki/Diaphragm_%28contraceptive%29", "passage_text": "The rim of a diaphragm is squeezed into an oval or arc shape for insertion. A water-based lubricant (usually spermicide) may be applied to the rim of the diaphragm to aid insertion. One teaspoon (5 mL) of spermicide may be placed in the dome of the diaphragm before insertion, or with an applicator after insertion. This is the strongest type of rim available in a diaphragm, and may be used by women with any level of vaginal tone. Unlike other spring types, arcing springs may be used by women with mild cystocele, rectocele, or retroversion."}, {"url": "http://www.floridaabortion.com/birthcontrol/thediaphragm.shtml", "passage_text": "The diaphragm is a barrier method of birth control that prevents pregnancy by placing a physical and chemical wall between the sperm and the cervix. It must always be used with a spermicidal cream or jelly. Be sure that the jelly or cream you purchase is a spermicide containing nonoxynol-9. The diaphragm may not be a good choice for you if you are unlikely to use it correctly every time you have sex. You may not be able to use it if you or your partner is sensitive to the chemicals used in spermicides or has a latex allergy."}, {"url": "http://youngwomenshealth.org/2011/06/24/diaphragm/", "passage_text": "A diaphragm is a soft latex-free dome and flexible rim made from silicone. It forms a barrier to stop sperm from reaching your cervix, so you won’t get pregnant. It is always used with spermicidal cream or gel. The cream or gel is used with the diaphragm to kill any sperm that might leak in around the edges of the dome. If you want to use a diaphragm, you need to get fitted for one by your health care provider. The diaphragm is then available by prescription. It costs between $20-$75 USD. The gel or cream is bought over-the-counter in a drug store."}, {"url": "https://en.wikipedia.org/wiki/Diaphragm_%28contraceptive%29", "passage_text": "The diaphragm is a cervical barrier type of birth control. It is a soft latex or silicone dome with a spring molded into the rim. The spring creates a seal against the walls of the vagina. This is the strongest type of rim available in a diaphragm, and may be used by women with any level of vaginal tone. Unlike other spring types, arcing springs may be used by women with mild cystocele, rectocele, or retroversion."}, {"url": "http://www.webmd.com/sex/birth-control/barrier-methods-of-birth-control-19059", "passage_text": "Barrier methods include the diaphragm, cervical cap, male condom, and female condom and spermicidal foam, sponges, and film. Unlike other methods of birth control, barrier methods are used only when you have sexual intercourse. Be sure to read the instructions before using a barrier method. It is very important that you use a barrier method correctly every time you have sex."}, {"url": "http://youngwomenshealth.org/2011/06/24/diaphragm/", "passage_text": "If you decide to use a diaphragm, you need to use it every time you have sexual intercourse. Women using a barrier method, such as a diaphragm or sponge, should be aware of the very low risk of getting toxic shock syndrome (TSS). Also, women who are allergic to nonoxyl-9 should not use any vaginal barrier method that contains spermicide or works with spermicide. If you want to use a diaphragm, you need to get fitted for one by your health care provider. The diaphragm is then available by prescription. It costs between $20-$75 USD. The gel or cream is bought over-the-counter in a drug store."}]