[{"url": "http://www.webmd.com/vitamins-supplements/ingredientmono-924-NIACIN%20AND%20NIACINAMIDE%20VITAMIN%20B3.aspx?activeIngredientId=924&activeIngredientName=NIACIN%20AND%20NIACINAMIDE%20VITAMIN%20B3", "passage_text": "Niacin and niacinamide are forms of Vitamin B3. Vitamin B3 is found in many foods including yeast, meat, fish, milk, eggs, green vegetables, beans, and cereal grains. Niacin and niacinamide are also found in many vitamin B complex supplements with other B vitamins. Niacin is used for high cholesterol. It is also used along with other treatments for circulation problems, migraine headache, dizziness, and to reduce the diarrhea associated with cholera."}, {"url": "http://www.webmd.com/drugs/2/drug-6926/niacinamide-oral/details", "passage_text": "Niacinamide (nicotinamide) is a form of vitamin B3 (niacin) and is used to prevent and treat niacin deficiency (pellagra). Niacin deficiency can cause diarrhea, confusion (dementia), tongue redness/swelling, and peeling red skin."}, {"url": "https://www.nlm.nih.gov/medlineplus/druginfo/natural/924.html", "passage_text": "Niacin and niacinamide are forms of Vitamin B3. Vitamin B3 is found in many foods including yeast, meat, fish, milk, eggs, green vegetables, beans, and cereal grains. Niacin and niacinamide are also found in many vitamin B complex supplements with other B vitamins."}, {"url": "http://www.ehow.com/facts_5191763_niacinamide_.html", "passage_text": "Niacinamide is a form of vitamin B3 that occurs in most natural foods. Supplementing niacinamide can help you break down carbohydrates into ready-to-use energy. However, too much niacinamide can cause you to experience an irregular heartbeat and blushing."}, {"url": "http://www.mayoclinic.org/drugs-supplements/niacin--niacinamide/background/hrb-20059838", "passage_text": "Vitamin B3 is made up of niacin and niacinamide, and can be found in many foods, including yeast, meat, fish, milk, eggs, green vegetables, and cereal grains. Vitamin B3 is often found in combination with other B vitamins, including thiamine, riboflavin, pantothenic acid, pyridoxine, cyanocobalamin, and folic acid."}, {"url": "http://umm.edu/health/medical/altmed/supplement/vitamin-b3-niacin", "passage_text": "It is also known as niacin (nicotinic acid) and has 2 other forms, niacinamide (nicotinamide) and inositol hexanicotinate, which have different effects from niacin. All B vitamins help the body convert food (carbohydrates) into fuel (glucose), which the body uses to produce energy."}, {"url": "http://www.rxlist.com/niacin_and_niacinamide_vitamin_b3/supplements.htm", "passage_text": "Niacin and niacinamide are forms of Vitamin B3. Vitamin B3 is found in many foods including yeast, meat, fish, milk, eggs, green vegetables, beans, and cereal grains. Niacin and niacinamide are also found in many vitamin B complex supplements with other B vitamins."}]