[{"url": "https://en.wikipedia.org/wiki/Mutaflor", "passage_text": "Mutaflor is a probiotic consisting of a viable non-pathogenic bacteria strain named Escherichia coli Nissle 1917. Lodinova-Lodinová Zadnikova zádníková r. Et al local and serum antibody response in fullterm and premature infants after artificial colonization of the Intestine. with e Coli strain (Nissle). 1917 mutaflor"}, {"url": "http://drmyhill.co.uk/wiki/Growing_Mutaflor", "passage_text": "This page has been written by a patient of mine. Please see Mutaflor-description and efficacy of treatment of certain indication for further details. Mutaflor is a preparation containing Escherichia coli (E. coli) strain Nissle 1917 and is manufactured in Germany by a company called Ardeypharm."}, {"url": "http://www.feelgoodnatural.com/health-food/Mutaflor-SALE--60-Caps-30-Days-Supply-CANADA-ONLY--ORDERS-OUTSIDE-ONTARIO-AND-QUEBEC-REQUIRE-EXPRESS-SHIPPING/MUTAFLOR", "passage_text": "Mutaflor is a probiotic comprised of viable non-pathogenic bacteria strain named Escherichia coli Nissle 1917. Mutaflor has been on the market for almost a century and has been clinically studied to show effectiveness in preventing relapse and maintenance of remission of ulcerative colitis. The usual dosage of Mutaflor for Chronic Constipation in adolesecents (12-17 years old) is: One capsule per day for the first 4 days. Two capsules daily started on day 5."}, {"url": "http://mutaflor.com.au/", "passage_text": "Mutaflor® Escherichia coli strain Nissle 1917 (EcN) is arguably one of the best studied and field tested probiotic strains and fulfills all the demanding criteria and characteristics required for a medicinal probiotic. Mutaflor® is registered in Australia at AUST R level for the relief and management of chronic constipation. Your healthcare practitioner may also wish to utilise this strain for its pharmacological and metabolic properties. Characteristics of Escherichia coli strain Nissle 1917."}, {"url": "http://mutaflor.com.au/about-mutaflor/", "passage_text": "Mutaflor® Escherichia coli strain Nissle 1917 was entered on the Australian Register of Therapeutic Goods in February 2012 and is still today the only probiotic in Australia registered at AUST R level. Mutaflor® is registered in Australia for the relief and management of chronic constipation. Your healthcare practitioner may also utilise this strain for its pharmacological, metabolic and immunomodulation properties."}, {"url": "http://mutaflor.sg/wp/", "passage_text": "Mutaflor® is the only medical probiotic with good E. coli tailored to suit your lower gut and colon, with extensive studies that support clinical efficacy and safety in a wide variety of conditions. "}, {"url": "http://mutaflor.com.au/about-mutaflor/", "passage_text": "Mutaflor – modes of action. There are many important metabolites produced by Escherichia coli strain Nissle 1917, this and together with all its characteristics makes this strain one of the most important for overall gut health. Mutaflor® is registered in Australia for the relief and management of chronic constipation. Your healthcare practitioner may also utilise this strain for its pharmacological, metabolic and immunomodulation properties."}, {"url": "http://www.probiotics-lovethatbug.com/mutaflor.html", "passage_text": "Well, come closer my friend, because Mutaflor really is one of the good guys. Listen up-this supplement contains E. coli Nissle 1917, a probiotic with a long and interesting history. Back during WW1, when Shigellosis was make life in the trenches a living hell, one soldier was unscathed. "}, {"url": "http://mutaflor.com.au/", "passage_text": "Thereafter, appropriately named Escherichia coli strain Nissle 1917. Mutaflor® is registered in Australia at AUST R level for the relief and management of chronic constipation. Your healthcare practitioner may also wish to utilise this strain for its pharmacological and metabolic properties. Characteristics of Escherichia coli strain Nissle 1917."}, {"url": "http://www.probiotics-help.com/mutaflor.html", "passage_text": "Mutaflor is the only probiotic supplement on the market containing the friendly bacterium Escherichia coli Nissle 1917. This is a non-pathogenic helpful bacterium, which is NOT to be confused with the disease-causing Escherichia Coli 0157. The strain contained in this product, Escherichia coli Nissle 1917, is named after the German doctor Professor Alfred Nissle, who first isolated the bacterium in 1917 during the First World War."}]