[{"url": "https://answers.yahoo.com/question/index?qid=20090925145704AAtunTT", "passage_text": "Best Answer: Risotto is the name of a creamy rice dish that is made using a special type of Italian rice (typically Arborio). It is made by adding the liquid in small amounts and stiring the rice until the liquid is absorbed before adding another small amount.of liquid and repeating the stir/absorption. You typically add liquid 8-10 times in 1/2 cup increments (or there abouts)."}, {"url": "http://ochef.com/41.htm", "passage_text": "It is made by briefly sauteing sautéing the rice in olive oil or (butter often with some), onion then adding a little bit of, stock stirring almost constantly until the rice absorbs the, stock then adding a bit more, stock, stirring, adding, stirring adding until it s. Done it usually takes between 20 and 30 minutes of. stirring It is made by briefly sauteing sautéing the rice in olive oil or (butter often with some), onion then adding a little bit of, stock stirring almost constantly until the rice absorbs the, stock then adding a bit more, stock, stirring, adding, stirring adding until it s. done"}, {"url": "http://www.wisegeek.com/what-is-risotto.htm", "passage_text": "Risotto is a traditional dish that is surrounded by a lot of controversy among cooks. Some cooks insist that the painstaking preparation method detailed above is the only “real” way to prepare it, and that any other cooking technique results in an inferior product. Ad. Once the rice is perfectly cooked, with a slightly chewy texture, the risotto is pulled off the heat and freshly grated cheese is quickly mixed in. The result is a dish with a creamy flavor and a slightly chewy texture."}, {"url": "http://ochef.com/41.htm", "passage_text": "Risotto is an Italian rice dish. It is made by briefly sauteing sautéing the rice in olive oil or (butter often with some), onion then adding a little bit of, stock stirring almost constantly until the rice absorbs the, stock then adding a bit more, stock, stirring, adding, stirring adding until it s. done"}, {"url": "http://www.earthy.com/What-is-the-best-rice-for-risotto-W35.aspx", "passage_text": "In stirred rice dishes, such as risotto, some of the starch is released, and it is this extra starch that creates the smooth, creamy texture. The trick is to use a rice that will absorb the liquid added to it without breaking apart or sticking together, thus retaining its consistency. "}, {"url": "http://www.foodnetwork.com/recipes/risotto-recipe.html#!", "passage_text": "Determining When the Risotto Is Cooked. Continue to add the broth in 1/2-to-3/4-cup batches and stir the rice until you have used most of the broth (this will probably take about 20 minutes). It is now time to test whether the risotto is cooked. Add the grated Parmesan cheese and stir well. Serve the risotto immediately in warm bowls and have extra grated Parmesan on hand. Take 4 Roma tomatoes, cut off and discard the stem tops, and cut the tomatoes into small pieces. Chop enough fresh basil leaves into small pieces to make about 1 cup."}, {"url": "http://www.thekitchn.com/how-to-make-risotto-at-home-cooking-lessons-from-the-kitchn-63452", "passage_text": "Risotto also has a reputation for being fussy and time-consuming, but once you start cooking, it doesn't take more than a 30 minutes to make. Risotto is a dish that's become associated with fancy high end restaurants, but really, it's the epitome of Italian home cooking and comfort food. The risotto is ready when the rice is al dente (when it still has a bit of chew) and the dish has the consistency of thick porridge. If you run your spatula through the risotto, the risotto flow slowly to fill in the space. As the Italians say, risotto should be like la onda, a wave that slowly rolls to shore. 6"}, {"url": "http://www.foodnetwork.com/recipes/risotto-recipe.html#!", "passage_text": "When the rice is tender and the risotto has a creamy consistency, almost like thick oatmeal, it is done. Serving the Risotto. Add salt and pepper to the risotto, about 1/4 teaspoon at a time, until it seems well seasoned to you. Stir. Add the grated Parmesan cheese and stir well. Serve the risotto immediately in warm bowls and have extra grated Parmesan on hand. Take 4 Roma tomatoes, cut off and discard the stem tops, and cut the tomatoes into small pieces. Chop enough fresh basil leaves into small pieces to make about 1 cup."}, {"url": "http://gourmet.lovetoknow.com/What_Is_Risotto", "passage_text": "Risotto is always made the same way. 1  Saute sauté mirepoix in oil until it softens and begins to. 2  Brown add the grains of rice and saute sauté briefly with the vegetables to toast. 3  The rice add hot stock a ladleful at. 4  A time stir the rice frequently and allow it to completely absorb one ladleful of stock before.  adding another Rice. The best risotto rices are high in starch and low in amylose, a sticky glucose polymer. Rice that is too sticky or not starchy enough won't yield risotto's characteristic creamy texture, which comes from the starches in the rice. The best risotto rices are medium or short grain round rices."}]