[{"url": "http://www.kilaueaadventure.com/mount-kilauea-facts.php", "passage_text": "Kilauea can be found on the Big Island of Hawaii, on the southeastern slope of Mauna Loa, Hawaii Volcanoes National Park. Kilauea is one of largest active craters in the world, has a circumference of 8 mi (13 km) and is surrounded by a wall of volcanic rock 200 to 500 ft (61—152 m) high. Mount Kilauea Facts. Kilauea - (kē´laewā´) läwā is a shield, volcano located in a 3,646 3646 (1,111 1111) m. Deep kilauea can be found on The Big island Of, hawaii on the southeastern slope Of Mauna, Loa Hawaii Volcanoes National. park"}, {"url": "http://www.kilaueaadventure.com/mount-kilauea-facts.php", "passage_text": "The oldest dated rock is about 23,000 years old and the oldest eruption of Kilauea was about 300,000-600,000 years ago. (More history dates on Mount Kilauea). Kilauea was formed under a hot spot under the crust. So were the other volcanoes on the Big Island such as Kohala, Mauna Kea, Mauna Loa, and Hualalai. There have been 34 eruptions since 1952 and 61 eruptions total. Mount Kilauea Facts. Kilauea - (kē´laewā´) läwā is a shield, volcano located in a 3,646 3646 (1,111 1111) m. Deep kilauea can be found on The Big island Of, hawaii on the southeastern slope Of Mauna, Loa Hawaii Volcanoes National. park"}, {"url": "http://www.livescience.com/27622-kilauea.html", "passage_text": "View full size image. Kilauea is one of the world’s most active volcanoes. It is a shield-type volcano that makes up the southeastern side of the Big Island of Hawaii. The volcano rises 4,190 feet (1,227 meters) above sea level and is about 14 percent of the land area of the Big Island"}, {"url": "http://www.nationalgeographic.com/features/04/forcesofnature/forces/v_4.html", "passage_text": "Type: Shield volcano with a cinder cone. Hawaii's famous Kilauea volcano emerged from the sea more than 50,000 years ago, and it has been active ever since. Kilauea, formed from an intraplate hot spot, is the most studied volcano in the world. Composed mostly of lava flows, Kilauea also has some deposits from explosive eruptions. It has erupted from three main areas: its summit and two rift zones. Most of Kilauea's eruptions are relatively gentle lava flows. "}, {"url": "http://www.planetdiary.com/background/geoact0.html", "passage_text": "Igneous rocks are those that formed from magma or lava. Most of the igneous rocks we see on the surface were born inside the Earth millions of years ago. But new igneous rock is forming all the time. Hawaii's Kilauea volcano is a great place to see this process in action. In this activity, you'll go on a virtual tour of Kilauea. Along the way, you'll learn about the volcano's features and history as well as some interesting things about volcanoes in general."}, {"url": "http://www.kids-fun-science.com/hawaiian-volcanoes.html", "passage_text": "Kilauea volcano Kilauea is one of the most active volcanoes on our planet. The volcano began the longest rift-zone eruption in historic times on January 3, 1983. Lava fountains formed in the rift zone about ten miles below the summit caldera. Powerful eruptions threw molten rock high in the air building a cinder cone. Big Island volcanoes. The Big Island of Hawaii was created by five volcanoes: Mauna Kea, Mauna Loa, Kilauea, Kohala Volcano and Hualalai Volcano.The tallest volcanoes in the Pacfic Ocean are Mauna Kea and Mauna Loa. Mauna Kea is the tallest volcano in the Hawaiian chain. It is 4,205 meters (13,796 feet) above sea level"}, {"url": "http://www.answers.com/Q/How_did_mount_Kilauea_form", "passage_text": "It is an active as well as the youngest volcano on the island of Hawaii. It rises 1,247 meters above sea level. It has erupted 62 times in 245 years. Kilauea is the most visit … ed volcano in the world. It emits sulphur dioxide and thus produces a desert effect in the Kilauea region. The lava is basalt. Mount Kilauea formed as a Shield Volcano, as the Pacific plate moved over a geological hot spot magma broke through the crust of the earth and formed a set of volcanic mountains on the sea floor. The tops of these mountains are now the Hawaiian islands. 9 people found this useful."}]