[{"url": "http://www.concretenetwork.com/concrete-parking-lots/why-use-concrete.html", "passage_text": "Over the typical 20-year life of a parking lot, concrete will have very little maintenance expense while maintenance for an asphalt lot will be as much as 80% of the initial construction cost. On one Florida project, asphalt was shown to be twice the cost of a concrete lot over 20 years. Concrete parking lots make sense for many applications. Wisconsin Ready Mixed Concrete Association. Comparing the initial cost and the cost over a 20-year life cycle, concrete is considerably less expensive. But today asphalt prices have skyrocketed to where concrete is competitive on a first-cost basis, making the life cycle argument nearly overwhelming. If you are trying to sell concrete or considering concrete, here are a few of the reasons why a building owner should pave his parking lots with concrete:"}, {"url": "http://www.fixasphalt.com/blog/cost-to-pave-parking-lot", "passage_text": "The average cost in the Mid-Atlantic Market for a 50,000 sq ft parking lot ranges in price from $1.25 - $1.50 per square foot for a 1 ½” – 2” compacted overlay. "}, {"url": "http://watrydesign.com/insights/top-10-issues-affecting-cost-of-building-a-parking-space", "passage_text": "7- Total parking spaces – The overall size of a project has an effect on the cost per parking space. A smaller project will cost more per space than a larger project. A 200-stall parking structure on a small site may cost about 30% more per square foot than a 1,000-stall structure on a “reasonably” sized lot. 8- Efficiency – This is the amount of square footage it takes for every parking stall overall. This cost would then be around 45% higher than the original cost or approximately $72 per square foot. 4- Structural system – 60% to 70% of the cost of parking is in the structural system. Therefore, the selection of the framing system will have a significant effect on the cost of each"}, {"url": "https://www.linkedin.com/pulse/average-cost-pave-asphalt-parking-lot-steven-brahney", "passage_text": "The average cost in the Mid-Atlantic Market for a 50,000 square foot (5,555 square yards) parking lot ranges in price from $1.25 - $1.50 per square foot for a 1 &frac12;” – 2” compacted overlay. The factors listed below will also dictate the installation price. "}, {"url": "http://usf-cutr.custhelp.com/app/answers/detail/a_id/2161/~/is-there-a-rough-dollar-figure-for-parking-space-costs%3F", "passage_text": "Wilson estimated break-even fees that would cover the monthly cost of providing a parking space at 10 case study sites--office buildings--in suburban areas of southern California. These averaged $48 a month and ranged from $28 to $61 (in 1992 dollars), although none of the sites had parking charges of any kind. APA's Planning Advisory Service, in a 1998 PAS Memo, stated typical surface car parking capital costs as $2,500 to $4,000 per space, including land cost, but I have heard higher figures."}, {"url": "http://usf-cutr.custhelp.com/app/answers/detail/a_id/2161/~/is-there-a-rough-dollar-figure-for-parking-space-costs%3F", "passage_text": "I've read that surface parking can cost as much as $10,000 per space and subterranean parking can cost as much as $25,000 to $35,000 per space. Of course these figures will change dramatically depending on what part of the country the parking is being built, the scarcity of land, etc. etc. APA's Planning Advisory Service, in a 1998 PAS Memo, stated typical surface car parking capital costs as $2,500 to $4,000 per space, including land cost, but I have heard higher figures."}, {"url": "http://www.concretenetwork.com/concrete-parking-lots/why-use-concrete.html", "passage_text": "Concrete parking lots make sense for many applications. Wisconsin Ready Mixed Concrete Association. Here's a new truth: concrete is cheaper than asphalt! For years we have tried to sell concrete parking lots by emphasizing the low life cycle costs based on concrete's long life span and low maintenance needs. But today asphalt prices have skyrocketed to where concrete is competitive on a first-cost basis, making the life cycle argument nearly overwhelming. If you are trying to sell concrete or considering concrete, here are a few of the reasons why a building owner should pave his parking lots with concrete:"}, {"url": "http://shoup.bol.ucla.edu/HighCost.pdf", "passage_text": "For example, the average cost of constructing anunderground garage in Boston is $95 per square foot, and the average spaceoccupies 330 square feet, so the average cost of a parking space is $31,000($95 × 330). Seattle andNew York have the lowest parking requirements (1 space per 1,000 squarefeet) and the lowest cost increases (25 percent and 16 percent). The last rowshows that the required parking increases the average cost of an ofﬁcebuilding by 47 percent.Table 2 shows the results for underground parking."}, {"url": "http://usf-cutr.custhelp.com/app/answers/detail/a_id/2161/~/is-there-a-rough-dollar-figure-for-parking-space-costs%3F", "passage_text": "Parking Professional, June 1999, suggested land cost of $22 per sq. ft. as the level at which structured parking becomes the more favorable option. Since a parking lot normally requires 300-350 square feet per car, this would put the land cost decision level at $6,600 to $7,700 per space. EPA's Parking Alternatives guidebook at http://www.smartgrowth.org/pdf/PRKGDE04.pdf contains a discussion of car parking costs. APA's Planning Advisory Service, in a 1998 PAS Memo, stated typical surface car parking capital costs as $2,500 to $4,000 per space, including land cost, but I have heard higher figures."}, {"url": "http://grist.org/cities/500-million-reasons-to-rethink-the-parking-lot/", "passage_text": "All of those parking lots are not only expensive but represent an opportunity lost. The average parking lot cost is $4,000 per space, with a space in an above-grade structure costing $20,000, and a space in an underground garage $30,000-$40,000."}]