[{"url": "http://www.goodhousekeeping.com/home/cleaning/tips/a24186/throwing-out-paint/", "passage_text": "Find a disposal location. If you can't properly dispose of the paint curbside, let the professionals handle it. Companies like Lowe's, Habitat for Humanity, and PaintCare accept leftover paint in order to recycle it. You can also search for a hazardous waste drop-off facility in your area at Earth911.com. Leftover paint can be hazardous, as it contains materials that can leak into the ground, cause physical injury to sanitation workers, or contaminate septic tanks. Here's how to properly dispose of it. Think before you toss."}, {"url": "http://www.popularmechanics.com/science/environment/a3098/paint-disposal-options/", "passage_text": "4. Recycle empty paint cans. If you've emptied a can of paint, let the residue air dry, then recycle the can with other metals. Check with your waste hauler, first, but many community recycling programs accept paint cans this way, Berry said. 5. Dispose of oil paints as hazardous waste. "}, {"url": "http://www.consumerreports.org/cro/news/2008/02/tip-of-the-day-how-to-dispose-of-paint/index.htm", "passage_text": "To find out whether paint recycling is an option in your area, contact your municipal recycling or household-hazardous-waste center. You can also search for recycling options by ZIP code by clicking on “Paint recycling” at Earth911 or by calling the group’s free service line at 800-253-2687. Dispose of it. If you can’t donate or recycle your paint, find out how to properly dispose of it in your area. Each municipality has different requirements, depending on whether the paint is oil-or water-based. Oil-based paint is always considered hazardous and should be disposed of at a household-hazardous-waste collection facility."}, {"url": "http://your.kingcounty.gov/solidwaste/facilities/latex-paint-disposal.asp", "passage_text": "Be sure it's latex paint or stain! Look on the label for the word latex, or for directions to clean up or thin with water. Oil-based paints should be brought to a hazardous waste facility for proper disposal. Once the latex paint has hardened or solidified, place the can with the lid off in your garbage container. The garbage hauler needs to see that the paint has been solidified."}, {"url": "http://www.wikihow.com/Safely-Dispose-of-Paint", "passage_text": "If you don't have use for the paint and can't find a paint recycling program, dispose of the paint by placing it in a plastic container filled with kitty litter or paper scraps, letting it dry, and throwing it away with the trash. 1 It can damage your pipes and it isn't good for the water supply. 2  Don't pour paint into the ground. 3  This is hazardous to the soil. 4  If you need to get rid of a lot of latex paint you may want to consider purchasing waste paint hardener."}, {"url": "http://www.lowes.com/projects/paint-stain-and-wallpaper/store-dispose-paint-properly/project", "passage_text": "Step 1. Here's how to dispose of latex paint without taking it to a recycling center. Add equal parts cat litter to latex paint in the can. If you have more than a half a can, you can also pour the paint into a lined box or trash can. "}, {"url": "http://budgeting.thenest.com/dispose-unused-house-paint-31377.html", "passage_text": "How to Dispose of Unused House Paint. Many paints contain petrochemicals that are harmful if released in landfills.. Unused house paint looks harmless in its sealed container. However, you can't dispose of it by dumping the closed paint can in the trash. When paint buckets eventually rupture in landfills, they can release petrochemical solvents and other environmental toxins into the soil. 1 You can dry up small amounts of latex paint by pouring the kitty litter or sawdust directly into the bucket. 2  Stir the mix, then let the paint dry before closing the lid and placing the paint bucket in the trash can. 3  Most recycling services accept empty steel paint cans"}, {"url": "http://www.houstontx.gov/solidwaste/paint.html", "passage_text": "Recycle Latex paint can be recycled by bringing the paint to the City of Houston's Westpark Consumer Recycling Center, located at 5900 Westpark, Houston, TX 77057 and the ESC's.. This facility is open 9 a.m. - 5 p.m. Monday thru Saturday. Latex paint can be recycled by bringing the paint to the City of Houston's Westpark Consumer Recycling Center, located at 5900 Westpark, Houston, TX 77057 and the ESC's .. This facility is open 9 a.m. - 5 p.m. Monday thru Saturday. Please limit your load to 1 5-gallon and 10 1-gallon buckets"}]