[{"url": "http://www.viviscal.com/best-hair-vitamins", "passage_text": "For hair growth, be sure to get a balanced diet with Vitamin C, Biotin (i.e. Vitamin B7 or Vitamin H) and Niacin (Vitamin B3). If you cannot get enough of these vitamins in your diet, you may need to take a vitamin supplement for hair growth."}, {"url": "http://www.viviscal.com/best-hair-vitamins", "passage_text": "Biotin is a B-vitamin complex sometimes called Vitamin B7 or Vitamin H. Your body produces it in the intestines and it is also found in foods such as dark green leafy vegetables, nuts and egg yolks. Biotin deficiency can cause hair loss."}, {"url": "http://www.med-health.net/Hair-Loss-Vitamins.html", "passage_text": "Vitamin is important for hair growth and can stimulate the hair follicles to grow new hair. Vitamin D can be obtained by eating foods including dairy products, fish, cod liver oil, fortified cereals, oysters, eggs and mushrooms."}, {"url": "http://www.worldofhair.com/geo/vitamins.htm", "passage_text": "Some of the healthy hair vitamins are as follows: 1. Vitamin A This vitamin is an antioxidant that helps produce healthy sebum in the scalp. Food sources: Fish liver oil, meat, milk, cheese, eggs, spinach, broccoli, cabbage, carrots, apricots and peaches. Daily dosage should be 5,000 IU."}, {"url": "http://www.healthdiaries.com/eatthis/the-10-best-vitamins-for-hair-regrowth.html", "passage_text": "Biotin. Biotin is known as the “hair vitamin” for good reason. It promotes hair growth and prevents brittle, fragile hair. Severe biotin deficiency can lead to loss of hair, eyelashes, and eyebrows. (See 5 Best Biotin Supplements to see which ones rate highest according to reviews.)."}, {"url": "http://www.viviscal.com/vitamins-for-natural-hair-loss-treatment", "passage_text": "Hair loss vitamins such as Biotin, Niacin (Vitamin B3) and Vitamin C, and minerals for hair loss such as Zinc and Iron, provide essential hair nutrients to nourish healthy and longer hair. Eating enough of these key hair growth vitamins can help prevent hair loss in both men and women."}, {"url": "http://www.healthdiaries.com/eatthis/the-10-best-vitamins-for-hair-regrowth.html", "passage_text": "Vitamin B12. Vitamin B12 is one of the most important vitamins for our hair and a deficiency can result in hair loss and premature graying. A surprising number of people are deficient in B12. Including enough vitamin C and iron in your diet will help you body absorb more B12."}]