[{"url": "http://www.parkinson.org/understanding-parkinsons/what-is-parkinsons/young-onset-parkinsons", "passage_text": "The diagnosis of young-onset Parkinson's disease is the same as idiopathic, or typical, Parkinson's disease except for the age of the patient. The average age of diagnosis is around 62. A recent study found that 65% of people with Parkinson's onset under 20 years old and 32% of people with uonset between 20 and 30 had a genetic mutation that scientists believe increases the risk of Parkinson's. To the best of our knowledge, there are no genes that guarantee that you will develop Parkinson's."}, {"url": "http://www.webmd.com/parkinsons-disease/news/20101004/parkinsons-later-diagnosis-earlier-death", "passage_text": "Most cases occur in people over the age of 60, but some people develop the disease much earlier in life, as was the case with actor Michael J. Fox, who was diagnosed at age 30. Parkinson’s is a chronic, progressive disease characterized by motor symptoms including tremors, muscle stiffness, and slowed movement. Oct. 4, 2010 -- Parkinson’s disease is not considered fatal, but people with Parkinson’s have a shorter life expectancy than the general population. Now new research provides clues as to why some patients die sooner than others."}, {"url": "http://www.healthline.com/health/parkinsons/early-onset", "passage_text": "Learn about the signs and symptoms of early-onset Parkinson’s and who is most at risk. More than 1.5 million Americans have Parkinson’s disease, and each year 50,000 more individuals are diagnosed with the condition. According to the National Institute of Neurological Disorders and Stroke, five to 10 percent of the 50,000 are under the age of 50. (The average age for Parkinson’s diagnosis is 60.) These patients have what’s known as “early-onset” or young Parkinson’s disease. However, most people diagnosed with early-onset Parkinson’s disease (and Parkinson’s disease in general) have no family history or obvious risk factors. Researchers believe a combination of factors—both hereditary and environmental—combine to increase a person’s chance of developing the degenerative disease."}, {"url": "http://nihseniorhealth.gov/parkinsonsdisease/whatisparkinsonsdisease/01.html", "passage_text": "One clear risk factor for Parkinson's is age. The average age of onset is 60 years and the risk rises significantly with advancing age. However, about 5 to 10 percent of people with Parkinson's have early-onset disease which begins before the age of 50. Early-onset forms of Parkinson's are often inherited, though not always, and some have been linked to specific gene mutations. Diagnosis Can Be Difficult. About 60,000 Americans are diagnosed with Parkinson's disease each year. However, it's difficult to know exactly how many have it because many people in the early stages of the disease think their symptoms are due to normal aging and do not seek help from a doctor."}, {"url": "https://www.sharecare.com/health/parkinsons-disease-causes-risk-factors/what-age-parkinsons-disease-occur", "passage_text": "One clear risk factor for Parkinson's disease is age. The average age of the onset of the disease is 60 years, and the incidence rises significantly with increasing age. However, about 5-10 percent of people with Parkinson's disease have an early-onset of the disease, which begins before the age of 50. An estimated 15-25 percent of people with Parkinson's disease have a known relative with the disease. In rare cases, parkinsonian symptoms may appear in people before the age of 20. This condition is called juvenile parkinsonism."}, {"url": "https://www.michaeljfox.org/understanding-parkinsons/i-have-got-what.php", "passage_text": "Parkinson's disease is a chronic, degenerative neurological disorder that affects one in 100 people over age 60. While the average age at onset is 60, some people are diagnosed at 40 or younger. 1 Progressive Supranuclear Palsy (PSP). 2  PSP is characterized by early onset of imbalance, frequent falls, rigidity of the trunk, and (eventually) eye-movement problems. 3  Symptoms usually begin after age 50 and progress more rapidly than with Parkinson s disease."}, {"url": "https://www.sharecare.com/health/parkinsons-disease-causes-risk-factors/what-age-parkinsons-disease-occur", "passage_text": "Parkinson’s disease is most often diagnosed in patients in their 60s, with 1-to-2 percent of the population over the age of 65 having Parkinson’s disease. However, Parkinson’s disease can also be diagnosed in patients who are under the age of 50, in which case it is referred to as young-onset Parkinson’s disease. An estimated 15-25 percent of people with Parkinson's disease have a known relative with the disease. In rare cases, parkinsonian symptoms may appear in people before the age of 20. This condition is called juvenile parkinsonism."}, {"url": "http://nihseniorhealth.gov/parkinsonsdisease/whatisparkinsonsdisease/01.html", "passage_text": "The average age of onset is 60 years, and the risk of developing Parkinson's goes up with age. Click for more information. Parkinson's disease was first described in 1817 by James Parkinson, a British doctor who published a paper on what he called the shaking palsy.. Diagnosis Can Be Difficult. About 60,000 Americans are diagnosed with Parkinson's disease each year. However, it's difficult to know exactly how many have it because many people in the early stages of the disease think their symptoms are due to normal aging and do not seek help from a doctor."}]