[{"url": "https://en.wikipedia.org/wiki/Steam_power", "passage_text": "Using boiling water to produce mechanical motion goes back over 2000 years, but early devices were not practical. The Spanish inventor Jeronimo jerónimo De ayanz Y beaumont patented in 1606 the first steam. Engine in 1698 Thomas savery patented a steam pump that used steam in direct contact with the water being. pumped The centrifugal governor was adopted by James Watt for use on a steam engine in 1788 after Watt’s partner Boulton saw one at a flour mill Boulton & Watt were building. The governor could not actually hold a set speed, because it would assume a new constant speed in response to load changes."}, {"url": "http://www.dreamessays.com/customessays/History/8710.htm", "passage_text": "The steam engine use throughout the several professions revolutionized numerous aspects of Western European Society. The first important use of the steam engine came in 1776. The steam engine was used to show the Cornish miners how successful it could be in removing the water from the mineshafts. This proved to be of great importance to the Cornish, because one of their biggest problems was the flooding of the mining shafts. Not only did the steam engine lead into the use of the means of traveling, for the purpose of importing, local deliveries, and transports of materials, but it made those three things quicker and cheaper. Transportation, which is a necessity for everyone today, was revolutionized because of the steam engine."}, {"url": "https://en.wikipedia.org/wiki/Steam_power", "passage_text": "A steam engine is a heat engine that performs mechanical work using steam as its working fluid. Using boiling water to produce mechanical motion goes back over 2000 years, but early devices were not practical. The Spanish inventor Jeronimo jerónimo De ayanz Y beaumont patented in 1606 the first steam. engine The centrifugal governor was adopted by James Watt for use on a steam engine in 1788 after Watt’s partner Boulton saw one at a flour mill Boulton & Watt were building. The governor could not actually hold a set speed, because it would assume a new constant speed in response to load changes."}, {"url": "http://schools-wikipedia.org/wp/s/Steam_engine.htm", "passage_text": "A steam engine is a heat engine that performs mechanical work using steam as its working fluid. Using boiling water to produce mechanical motion goes back about 2,000 years, but early devices were not practical. Since the late 1700s steam engines have become a major source of mechanical power. Boulton and Watt's early engines used half as much coal as John Smeaton's improved version of Newcomen's. Newcomen's and Watt's early engines were atmospheric. They were powered by air pressure pushing a piston into the partial vacuum generated by condensing steam, instead of the pressure of expanding steam."}, {"url": "http://www.livescience.com/44186-who-invented-the-steam-engine.html", "passage_text": "While the Spaniard first patented a steam-operated machine for use in mining, an Englishman is usually credited with inventing the first steam engine. In 1698, Thomas Savery, an engineer and inventor, patented a machine that could effectively draw water from flooded mines using steam pressure. Newcomen's atmospheric engine — so named because the level of steam pressure it used neared atmospheric pressure — was the first commercially successful machine that used steam to operate a water pump."}, {"url": "https://en.wikipedia.org/wiki/Steam_power", "passage_text": "James Watt, in 1781, patented steam engine that produced continued rotary motion and the power about 10 hp. It was the first type of steam engine to make use of steam at a pressure just above atmospheric to drive the piston helped by a partial vacuum. The centrifugal governor was adopted by James Watt for use on a steam engine in 1788 after Watt’s partner Boulton saw one at a flour mill Boulton & Watt were building. The governor could not actually hold a set speed, because it would assume a new constant speed in response to load changes."}, {"url": "http://inventors.about.com/od/indrevolution/a/Steam-Engines.htm", "passage_text": "In 1765, Scottish engineer, James Watt began studying Thomas Newcomen's steam engine and invented an improved version. It was Watt's engine that was the first to have a rotary motion. James Watt's design was the one that succeeded and the use of steam engines became widespread. Steam engines' had a profound effect on the history of transportation."}, {"url": "https://en.wikipedia.org/wiki/Steam_power", "passage_text": "The most useful instrument for analyzing the performance of steam engines is the steam engine indicator. Early versions were in use by 1851, but the most successful indicator was developed for the high speed engine inventor and manufacturer Charles Porter by Charles Richard and exhibited at London Exhibition in 1862. The centrifugal governor was adopted by James Watt for use on a steam engine in 1788 after Watt’s partner Boulton saw one at a flour mill Boulton & Watt were building. The governor could not actually hold a set speed, because it would assume a new constant speed in response to load changes."}, {"url": "http://www.livescience.com/44186-who-invented-the-steam-engine.html", "passage_text": "In 1606, de Ayanz registered the first patent for a machine that used steam power to propel water from mines. The Spanish inventor — who is also credited with inventing one of the world's first air conditioning systems — used his steam engine to remove water from silver mines in Guadalcanal, Seville. Newcomen's atmospheric engine — so named because the level of steam pressure it used neared atmospheric pressure — was the first commercially successful machine that used steam to operate a water pump."}, {"url": "http://www.thomasnet.com/articles/custom-manufacturing-fabricating/steam-engine-history", "passage_text": "In time, these steam engines were used in power boats and railways in 1802 and 1829 respectively. Almost half a century later, the first steam-powered automobiles were invented. Charles A. Parsons came up with first steam turbine in 1880. By the 20th century, the steam engine was widely used in automobiles and ships. At this time, the true power of steam was showcased as the energy was used to pump up the water from deep within the mines. With this, the potential power of steam was discovered, leading to the invention of a full fledged steam engine. Steam-powered electrical power plants in the modern world came later."}]