[{"url": "http://www.cvphysiology.com/Blood%20Pressure/BP016.htm", "passage_text": "Vasopressin (Antidiuretic Hormone). Vasopressin (arginine vasopressin, AVP; antidiuretic hormone, ADH) is a peptide hormone formed in the hypothalamus, then transported via axons to, and released from, the posterior pituitary into the blood. AVP has two principle sites of action: the kidney and blood vessels. 1  The primary function of AVP in the body is to regulate extracellular fluid volume by affecting renal handling of water, although it is also a vasoconstrictor and pressor agent (hence, the name vasopressin)."}, {"url": "http://www.differencebetween.net/science/health/difference-between-adh-and-aldosterone/", "passage_text": "ADH is completely known as the antidiuretic hormone. It is also identified as AVP or arginine vasopressin or simply vasopressin. Basically, the difference between the two is regarding the mechanism of action. Although both hormones have the same ultimate goal of water preservation or retention, they have different ways of attaining such."}, {"url": "https://en.wikipedia.org/wiki/Vasopressin", "passage_text": "Vasopressin is a peptide hormone that increases water permeability of the kidney's collecting duct and distal convoluted tubule by inducing translocation of aquaporin-CD water channels in the plasma membrane of collecting duct cells. 1 It is likely that vasopressin acts in conjunction with corticotropin-releasing hormone to modulate the release of corticosteroids from the adrenal gland in response to stress, particularly during pregnancy and lactation in mammals."}, {"url": "http://ghr.nlm.nih.gov/gene/AVP", "passage_text": "The AVP gene provides instructions for making a hormone called vasopressin or antidiuretic hormone (ADH). ADH starts out as a larger molecule called a preprohormone, which is cut (cleaved) and modified to produce the active hormone and several related proteins. The major function of ADH is to help control the body's water balance by determining how much water is excreted in urine. Normally, when a person's fluid intake is low or when a lot of fluid is lost (for example, through sweating), the pituitary gland releases more ADH into the bloodstream."}, {"url": "https://labtestsonline.org/understanding/analytes/adh/tab/test", "passage_text": "Antidiuretic hormone, also called arginine vasopressin (AVP), is a hormone produced by the hypothalamus in the brain and stored in the posterior pituitary gland at the base of the brain. ADH helps regulate water balance in the body. ADH deficiency is often seen with one of two types of diabetes insipidus. Central diabetes insipidus is a decrease in the production of ADH by the hypothalamus or in the release of ADH from the pituitary while nephrogenic diabetes insipidus is characterized by a decrease in the kidney's response to ADH."}, {"url": "http://www.everydayhealth.com/drugs/vasopressin", "passage_text": "Be the first to review this Drug. Vasopressin is a man-made form of a hormone called anti-diuretic hormone that is normally secreted by the pituitary gland. Vasopressin acts on the kidneys and blood vessels. Vasopressin is used to treat diabetes insipidus, which is caused by a lack of this naturally occurring pituitary hormone in the body. Vasopressin is also used to treat or prevent certain conditions of the stomach after surgery or during abdominal x-rays."}, {"url": "http://www.differencebetween.com/difference-between-aldosterone-and-vs-antidiuretic-hormone-adh/", "passage_text": "Potassium can be induced by angiotensin II. Antidiuretic Hormone (ADH). ADH is a polypeptide, which is secreted by the hypothalamus, and it is stored in the posterior pituitary gland. ADH is released when water level is low in the blood stream. ADH regulates the body water level by concentrating urine and thereby reducing urine volume. "}, {"url": "https://en.wikipedia.org/wiki/Vasopressin", "passage_text": "Vasopressin, also known as arginine vasopressin (AVP), antidiuretic hormone (ADH), or argipressin, is a neurohypophysial hormone found in most mammals. Its two primary functions are to retain water in the body and to constrict blood vessels. 1 It is likely that vasopressin acts in conjunction with corticotropin-releasing hormone to modulate the release of corticosteroids from the adrenal gland in response to stress, particularly during pregnancy and lactation in mammals."}]