[{"url": "http://www.topindiatour.com/punjab-travel.html", "passage_text": "Punjab. About the State. The state of Punjab is located in the northwestern part of the Indian subcontinent. The state forms a part of the larger Punjab region that includes the province of Punjab (Pakistan) too. Amritsar, the second largest city in Punjab, is internationally renowned for the Golden Temple or Harimandir Sahib. Amritsar is the very city where the horrible Jallianwala Bagh massacre had taken place. Other tourist attractions of the city include the Durgiana Temple, Rambagh, Ram Teerth and Taren Taran."}, {"url": "https://en.wikipedia.org/wiki/Punjab_region", "passage_text": "The Punjab region of India and Pakistan has a historical and cultural link to Indo-Aryan peoples as well as partially to various indigenous communities. As a result of several invasions from Central Asia and the Middle East, many ethnic groups and religions make up the cultural heritage of Punjab. Sikhism, a religion founded in the late 15th century, is the main religion practised in Indian Punjab. About 60% of the population of the post-1966 Indian Punjab is Sikh, 37% is Hindu, and the rest are Muslims, Christians, and Jains."}, {"url": "http://www.mapsofindia.com/tourism/buddhist-pilgrimage-locations.html", "passage_text": "Sarnath. Sarnath is considered as an important Buddhist pilgrimage destination in India. The place is known by many names, such as Sarangnath, Rishipattana, Isipatana, Mrigadava, and so on. Sarnath is located at a distance of 13 kilometers to the northeast of Benaras in Uttar Pradesh. "}, {"url": "https://en.wikipedia.org/wiki/Mohali", "passage_text": "Sahibzada Ajit Singh Nagar (formerly Mohali) is a city which is a commercial hub lying adjacent to the city of Chandigarh in Punjab, India. It is administrative headquarters of Sahibzada Ajit Singh Nagar District. It is still known and popular, as Mohali among local people and other parts of India. Today, Mohali and Chandigarh are contiguous areas with only the boundary of Punjab and UT of Chandigarh dividing this area. The original plan of Mohali is in fact a mere extension of the road and design system of Chandigarh without any unique planning. The development earlier was only till Phase VII."}, {"url": "https://en.wikipedia.org/wiki/Punjab_region", "passage_text": "The Punjab (/ˈpʌndʒɑːb/ or /ˈpʌndʒaeb/), ˈpʌndʒæb also Spelled, panjab-panj, āb five (Rivers: punjabi. , پنجاب. , ਪੰਜਾਬ: hindi. ), पंजाब is a geographical region in The indian subcontinent Or South asia comprising vast areas of Eastern pakistan and Northern. india Sikhism, a religion founded in the late 15th century, is the main religion practised in Indian Punjab. About 60% of the population of the post-1966 Indian Punjab is Sikh, 37% is Hindu, and the rest are Muslims, Christians, and Jains."}, {"url": "http://www.pbs.org/thestoryofindia/gallery/photos/18.html", "passage_text": "Click for detailed map. Sikhism's holiest place of worship is the Golden Temple, or Harmandir, in the city of Amritsar. Located in the state of Punjab, the city, established to be a place of pilgrimage, derives its name from the sacred tank, or pool, called the Amrita Saras (pool of nectar), where the temple was built. The Golden Temple reflecting in the Amrita Saras. Golden Temple is the name of Amritsar's hallowed Sikh shrine and the religious complex where it's located. The shimmering two-story temple sits atop a square platform in the center of a man-made tank, called the Amrita Saras (pool of nectar)."}, {"url": "http://sikhism.about.com/od/history/a/Golden_Temple.htm", "passage_text": "Darbar Harmandir Sahib, the Golden Temple of the Sikhs. The Golden Temple is situated in Amritsar, located in Northern Punjab, India, which is close to the border of Pakistan. It is the central gurdwara, or worship place, for all Sikhs in the world. Its proper name is Harmandir, which means Temple of God and is respectfully referred to as Darbar Sahib (meaning court of the Lord). Darbar Harmandir Sahib is popularly known as the Golden Temple because of its unique features"}, {"url": "http://www.goldentempleamritsar.co.uk/", "passage_text": "Golden Temple or Sri Harmandir Sahib Ji,is located in Amritsar,Punjab (India). The Golden Temple,also referred to as the Darbar Sahib,is of significant importance to the Sikh faith. The location of the Golden Temple,originally a small lake in a deep forest,has long been recognised as a place of spiritual significance. "}, {"url": "http://www.pbs.org/thestoryofindia/gallery/photos/18.html", "passage_text": "Even Hindus are known to worship there. Although pilgrimage is not a part of Sikhism, devotees do journey to its foremost place of worship, the Golden Temple in Amritsar, Punjab, as well as locations associated with the lives of its ten gurus (spiritual leaders). The Golden Temple reflecting in the Amrita Saras. Golden Temple is the name of Amritsar's hallowed Sikh shrine and the religious complex where it's located. The shimmering two-story temple sits atop a square platform in the center of a man-made tank, called the Amrita Saras (pool of nectar)."}, {"url": "https://en.wikipedia.org/wiki/Punjab_region", "passage_text": "The name of the region is a compound of two Persian words and was introduced to the region by the Turkic Muslim conquerors of India and more formally popularized during the Mughal Empire. Punjab literally means (The Land of) Five Waters referring to the following rivers: the Jhelum, Chenab, Ravi, Sutlej, and Beas. Sikhism, a religion founded in the late 15th century, is the main religion practised in Indian Punjab. About 60% of the population of the post-1966 Indian Punjab is Sikh, 37% is Hindu, and the rest are Muslims, Christians, and Jains."}]