[{"url": "http://www.dermaharmony.com/dermatitis/perioraldermatitis.aspx", "passage_text": "Perioral dermatitis is a common facial skin irritation affecting the skin around the mouth, extending at times upwards or outwards onto the cheeks, and less commonly around the eyes or forehead. Approximately 90% of cases are women between the ages of 16 and 45; it is very rarely seen in men."}, {"url": "http://www.dermnetnz.org/acne/perioral-dermatitis.html", "passage_text": "Perioral dermatitis is a common facial skin problem in which groups of itchy or tender small red papules (bumps) appear around the mouth. The papules spare the skin bordering the lips (which then appears pale) but develop on the sides of the chin, and then spread to include upper lip and cheeks."}, {"url": "http://www.webmd.com/skin-problems-and-treatments/perioral-dermatitis", "passage_text": "In this article. Perioral dermatitis is a facial rash that causes bumps to develop around the mouth. In some cases, a similar rash may appear around the eyes, nose, or forehead. The condition is most commonly seen in young women (90% of cases), but it can affect men as well."}, {"url": "http://www.healthline.com/health/perioral-dermatitis", "passage_text": "Perioral dermatitis is inflammation of the skin around the mouth. It usually appears as a rash around the lips that may be scaly or bumpy. According to Medscape, perioral dermatitis can happen to anyone, but it occurs most often in women ages 20 to 45. In fact, 90 percent of cases reported are in young women."}, {"url": "http://www.healthline.com/health/perioral-dermatitis", "passage_text": "Perioral dermatitis is characterized by a rash of red bumps around the mouth and in the folds around the nose. The bumps can also appear in the area under the eyes, on the forehead, and on the chin. These small bumps can be filled with pus or fluids and may resemble acne."}, {"url": "http://patient.info/health/perioral-dermatitis-leaflet", "passage_text": "Perioral dermatitis is a common skin rash that mainly affects young women. The rash affects the skin around the mouth. Use of a steroid cream on the face seems to trigger the condition in many cases. Treatment includes stopping the use of all creams and ointments to the face, including cosmetics and topical steroids."}, {"url": "http://osmiaorganics.com/blogs/blog/13768653-perioral-dermatitis-eczema-meet-acne", "passage_text": "Perioral dermatitis (PD) is a very common condition of the facial skin (perioral = around the mouth), especially in women of menstruating age. It is frequently undiagnosed or misdiagnosed, and acts like a cross between acne and eczema."}]