[{"url": "http://www.indeed.com/salary/Biomedical-Technician.html", "passage_text": "Average Biomedical Technician salaries for job postings nationwide are 37% lower than average salaries for all job postings nationwide. "}, {"url": "http://www.healthcare-salaries.com/technicians/biomedical-technician-salary", "passage_text": "Biomedical technician salary in USA. An average starting hourly wage for a biomedical technician in the United States ranges from between $14.85 – $28.33 per hour which gradually increases by $20.88 – $44.28 overtime. An average annual salary bonus of around $2,469 will be included and the total annual salary ranges from between $31,600 – $61,941. Conclusion about biomedical technician salary. According to percentile statistics, the median wage and salary for 90th percentile of biomedical technicians has been around $37.58 per hour and $78,160 per year."}, {"url": "http://www.biomedicaltechnician.net/biomedical-equipment-technician-salary-usa/", "passage_text": "Highest Paying States for a Biomedical Equipment Technician. Biomedical equipment technician salary is higher in Alaska than it is in any other state, as technicians there make an average of $69,510 annually. Highest Paying biomedical Equipment Technician Industries. Biomedical equipment technician salary is highest among workers in general medical and surgical hospitals, where individuals can expect to earn an average of $50,43"}, {"url": "http://www.payscale.com/research/US/Job=Biomedical_Equipment_Technician_(BMET)/Hourly_Rate", "passage_text": "Pay for Biomedical Equipment Technicians in the United States sits in the ballpark of $20.89 per hour. Earnings generally vary between $15.95 per hour and $29.18. Experience level is the biggest factor affecting pay for this group, followed by geography and the particular employer. Job satisfaction for Biomedical Equipment Technicians is high. "}, {"url": "http://www.healthcare-salaries.com/technicians/biomedical-technician-salary", "passage_text": "Average biomedical technician salary. The average expected wage and annual salary for a biomedical technician in the United States is around $27.94 per hour and $58,120 per annum. Conclusion about biomedical technician salary. According to percentile statistics, the median wage and salary for 90th percentile of biomedical technicians has been around $37.58 per hour and $78,160 per year."}, {"url": "http://www.healthcare-salaries.com/technicians/biomedical-technician-salary", "passage_text": "The annual salary for the top 10 percent biomedical technicians is more than $70,260, while the lowest 10% of them earned less than $26,040 per year. Keep reading for more information and facts about biomedical technician salary. Conclusion about biomedical technician salary. According to percentile statistics, the median wage and salary for 90th percentile of biomedical technicians has been around $37.58 per hour and $78,160 per year."}, {"url": "http://www.biomedicaltechnician.net/biomedical-equipment-technician-salary-usa/", "passage_text": "Other states where technicians may earn less than the median annual wage include Arkansas, a state where the average salary is $35,650; Oklahoma, where employees average $36,020; and Louisiana, where workers make an average of $37,000 per year. Highest Paying biomedical Equipment Technician Industries. Biomedical equipment technician salary is highest among workers in general medical and surgical hospitals, where individuals can expect to earn an average of $50,430 annually."}, {"url": "http://work.chron.com/biomedical-equipment-technician-salaries-5489.html", "passage_text": "Salaries by State. Biomedical equipment technicians working in Utah reported the highest average salary by state in 2011, $59,830 a year. Arizona ranked second with an average annual salary of $57,800 for BMETs, followed by Alaska at $55,390, Minnesota at $55,140 and Maryland at $54,560. North Dakota reported the lowest salary in the country, an average of $33,190 per year. Related Reading: Job Description of a Medical Delivery Set-up Technician. As of 2011, BMETs reported a mean hourly wage of $22.60 and mean annual income of $47,010 to the Bureau of Labor Statistics. The median earnings reported were $21.57 an hour and $44,870 per year, and the median-earning 50 percent of BMETs working in the United States made between $33,640 and $58,400 per year. Biomedical equipment technicians working in Utah reported the highest average salary by state in 2011, $59,830 a year"}]