[{"url": "http://www.brighton-hove.gov.uk/content/council-tax-and-benefits/council-tax/council-tax-information-landlords", "passage_text": "Council Tax liability. Who is liable to pay Council Tax depends on who is highest on the hierarchy of legal interest. This normally means that where tenants are issued with a secure joint tenancy agreement for the entire property, they would be furthest up the hierarchy and therefore liable to pay the Council Tax. Where tenants hold individual tenancy agreements or licences to occupy a property, the owner becomes liable for the Council Tax as the property is classed as a ‘ house in multiple occupation ' (HMO)."}, {"url": "https://www.gov.uk/council-housing/types-of-tenancy", "passage_text": "As a flexible tenant, you have tenancy for a fixed period. This is usually for at least 5 years, though in some cases it may be between 2 and 5 years. At the end of the fixed period the council may decide to: 1  offer you another fixed-term tenancy. 2  offer you a secure tenancy. 3  not renew your tenancy. "}, {"url": "http://www.leeds.gov.uk/residents/Pages/Rented-properties.aspx", "passage_text": "Tenants have to pay council tax for the property they rent if it’s their only or main home (their 'sole or main residence'). If the property is a House in Multiple Occupation (HIMO), the owner will usually be responsible for paying. Properties that are classed as a ‘House in Multiple Occupation’ (HIMO). If it’s a tenancy agreement for six months or more, the tenant will usually have to pay Council Tax up until the official tenancy end-date (unless someone else moves in before then)."}, {"url": "https://www.blackburn.gov.uk/Pages/Council-tax-liability-.aspx", "passage_text": "Usually the landlord has to pay the council tax if nobody lives in the property. However, the tenant will have to pay if they have a fixed-term tenancy or lease for six months or more and the tenancy or lease has not yet ended. 1 Tenants: if tenants live in the property, it is the tenants and their partners who pay the council tax, except if the property is a 'house in multiple occupation'. ' 2 House in multiple occupation': the landlord pays the council tax."}, {"url": "https://www.citizensadvice.org.uk/housing/renting-a-home/tenancy-agreements/", "passage_text": "The tenancy agreement is a contract between you and your landlord. It may be written or oral.The tenancy agreement gives certain rights to both you and your landlord, for example, your right to occupy the accommodation and the your landlord’s right to receive rent for letting the accommodation. The tenancy agreement should be signed by both you and your landlord. Each tenant, if there are joint tenants, should receive a copy of the agreement. Your landlord is obliged by law to give you their name and address, regardless of whether or not you have a written tenancy agreement."}, {"url": "http://www.landlords.org.uk/news-campaigns/news/council-tax", "passage_text": "A vacant and substantially unfurnished property is exempt from Council Tax for up to six months, following which if it is still vacant the landlord will be liable at the discounted rate of up to 50 per cent. RP: For the majority of residential let property the Council Tax liability falls to the tenant, however in regard to Houses in Multiple Occupation (HMO) landlords are liable."}, {"url": "http://www.gateshead.gov.uk/Benefits%20and%20Council%20Tax/Council%20Tax/Who-pays.aspx", "passage_text": "Tell us about a change for your property. The Council Tax bill will be sent to the person who appears first on this list: 1  Resident freeholder e.g. an owner occupier. 2  Resident leaseholder e.g. an owner occupier who is paying a ground rent. 3  Resident statutory or secure tenant e.g. a council or private tenant. If you are jointly and severally liable for the council tax you are, in fact, personally responsible for paying the whole of the council tax bill, and not just a share of it. If you pay your 'share' but the other person does not pay their 'share', we can recover the arrears from you, not just from the other person"}, {"url": "http://www.pims.co.uk/tenant-payment-of-council/", "passage_text": "The tenant is liable for council where the property in entirety is under their exclusive control. This means if you rent rooms or split a rental unit by issuing multiple tenancy agreements in respect of the same dwelling, then you as the Landlord could [should] be liable for council tax. You let for less than six months to a tenant whose main residence is elsewhere. Where a Landlord lets a property but specifies that they retain use of part of the building for their use [such as storage, office etc]. Just because your tenancy agreement says the tenant is liable for Council Tax, this is not."}]