[{"url": "http://www.wisegeek.org/what-causes-swollen-hands-and-feet.htm", "passage_text": "Swelling in the extremities is often caused by idiopathic edema or excess salt consumption. Swollen hands and feet are commonly caused by idiopathic edema, which is usually not serious. Swollen hands may be a sign of heart disease. Prolonged periods of physical inactivity may cause swollen hands and feet. Reducing salt consumption, for example, eliminating salty snacks can aleviate swelling."}, {"url": "http://www.healthgrades.com/symptoms/hand-swelling", "passage_text": "Because swollen hands can be a sign of a serious disease or disorder, you should seek prompt medical care and talk with your medical professional about your symptoms, especially if you experience hand swelling with pain, redness or warmth. Health Stories: Read how this real patient found the right care."}, {"url": "http://www.medicalnewstoday.com/articles/159111.php", "passage_text": "Edema is swelling caused by fluid retention-excess fluid is trapped in the body's tissues. In the UK/Ireland/Australasia and some other countries, the word is spelled oedema. Swelling caused by edema commonly occurs in the hands, arms, ankles, legs and feet. It is usually linked to the venous or lymphatic systems."}, {"url": "http://www.wikihow.com/Reduce-Swollen-Fingers", "passage_text": "Two Parts: Treating Swollen Fingers Diagnosing Your Swelling. Swollen fingers may result from an injury or from edema, a common medical condition that causes excess fluid to be stored in various locations of the body, including the hands, feet, ankles and legs."}, {"url": "http://www.mayoclinic.org/diseases-conditions/edema/basics/definition/CON-20033037", "passage_text": "Edema is swelling caused by excess fluid trapped in your body's tissues. Although edema can affect any part of your body, it's most commonly noticed in the hands, arms, feet, ankles and legs."}, {"url": "http://www.mayoclinic.org/diseases-conditions/edema/expert-answers/hand-swelling/faq-20058255", "passage_text": "Hand swelling during exercise is a fairly common problem. The cause isn't completely clear, but hand swelling appears to be a result of the way your body and blood vessels respond to the increased energy demands of your muscles during exercise."}, {"url": "http://symptomchecker.webmd.com/multiple-symptoms?symptoms=joint-pain%7Cnumbness-or-tingling%7Cswelling%7Cunable-to-grip-(hands)&symptomids=279%7C164%7C5%7C348&locations=50%7C50%7C50%7C50", "passage_text": "WebMD Symptom Checker helps you find the most common medical conditions indicated by the symptoms joint pain, numbness or tingling, swelling and unable to grip (hands) including Peripheral neuropathy, Carpal tunnel syndrome, and Generalized anxiety disorder."}, {"url": "http://www.healthgrades.com/symptoms/hand-swelling", "passage_text": "Hand swelling is a sign of fluid buildup or inflammation of the tissues or joints of the hand. Hand swelling, which is also called edema, can also result from serious infections, trauma, and other abnormal processes."}, {"url": "http://www.rightdiagnosis.com/sym/hand_swelling.htm", "passage_text": "Hand swelling: Introduction. Hand swelling: Swelling of one or both hands. See detailed information below for a list of 54 causes of Hand swelling, Symptom Checker, Assessment Questionnaire, including diseases and drug side effect causes."}]