[{"url": "http://courses.washington.edu/engr100/Section_Wei/engine/UofWindsorManual/Piston%20and%20Piston%20Rings.htm", "passage_text": "A piston is a cylindrical engine component that slides back and forth in the cylinder bore by forces produced during the combustion process. The piston acts as a movable end of the combustion chamber. The stationary end of the combustion chamber is the cylinder head. Combustion gas pressure forces the piston ring against the cylinder wall to form a seal. Pressure applied to the piston ring is approximately proportional to the combustion gas pressure. A wiper ring is the piston ring with a tapered face located in the ring groove between the compression ring and the oil ring."}, {"url": "http://courses.washington.edu/engr100/Section_Wei/engine/UofWindsorManual/Piston%20and%20Piston%20Rings.htm", "passage_text": "Piston features include the piston head, piston pin bore, piston pin, skirt, ring grooves, ring lands, and piston rings. The piston head is the top surface (closest to the cylinder head) of the piston which is subjected to tremendous forces and heat during normal engine operation. Combustion gas pressure forces the piston ring against the cylinder wall to form a seal. Pressure applied to the piston ring is approximately proportional to the combustion gas pressure. A wiper ring is the piston ring with a tapered face located in the ring groove between the compression ring and the oil ring."}, {"url": "https://en.wikipedia.org/wiki/Piston_ring", "passage_text": "The gap in the piston ring compresses to a few thousandths of an inch when inside the cylinder bore. Piston rings are a major factor in identifying if an engine is two stroke or four stroke. Three piston rings suggest that it is a four stroke engine while two piston rings suggest that it is a two stroke engine. 1 Sealing the combustion chamber so that there is no transfer of gases from the combustion chamber to the crank. 2  Supporting heat transfer from the piston to the cylinder wall. 3  Regulating engine oil consumption."}, {"url": "http://smallengineinformation.com/?page_id=500", "passage_text": "Once the piston ring grooves are cleaned, and the piston wiped off, side clearance for the rings can be checked. This dimension is the clearance between a piston ring and the upper edge(usually called the inside edge) of the groove in which it rests. Piston ring side clearance performs an important function. Excess movement of a piston ring may also cause it to break. If clearance is too small, the ring may bind in its groove when the piston heats up and expands. To measure the piston ring side clearance, the ring does not need to be installed on the piston."}, {"url": "http://www.enginebasics.com/Engine%20Basics%20Root%20Folder/Piston%20Rings.html", "passage_text": "The last ring is called the oil ring. These work with the piston in the engine to lubricate the cylinder, walls, pistons, rings, and wrist pins. This ring keeps the oil out of the combustion process. The oil rings also help the thermal control because it cools the piston by directing oil around it. The piston rings are located on the piston. The piston is located in the cylinder, and multiple cylinders are usually arranged side by side in a bank. This bank is known as the engine block."}, {"url": "http://www.rlengines.com/Web_Pages/pistonrings.html", "passage_text": "The end gap is measured by placing the piston ring in the cylinder bore & squaring it to the bore. Squaring the rings in the bore will allow for an precise measurement of the end gaps.This can be accomplished either with a ring squaring tool or a piston. Insert a feeler gauge between the ends of the ring. When measuring piston ring end gap, check the gap with the rings at the top and the bottom of the bore. If the bore has taper wear (bores typically wear most at the top), the end gap will be larger at the top and smaller at"}, {"url": "https://en.wikipedia.org/wiki/Piston_ring", "passage_text": "The piston ring (PR) is a split band pressed against the wall of the cylinder by springs (S) mounted in the inner junk ring (JR). The tongue (T) maintains the seal as the ring expands and splits apart. Spring-loaded piston rings. A pair of piston rings mounted on a 47mm two-stroke cycle scooter piston. A piston ring is a split ring that fits into a groove on the outer diameter of a piston in a reciprocating engine such as an internal combustion engine or steam engine. 1 Sealing the combustion chamber so that there is no transfer of gases from the combustion chamber to the crank. 2  Supporting heat transfer from the piston to the cylinder wall. 3  Regulating engine oil consumption."}, {"url": "http://courses.washington.edu/engr100/Section_Wei/engine/UofWindsorManual/Piston%20and%20Piston%20Rings.htm", "passage_text": "Piston rings commonly used on small engines include the compression ring, wiper ring, and oil ring. A compression ring is the piston ring located in the ring groove closest to the piston head. The compression ring seals the combustion chamber from any leakage during the combustion process. Combustion gas pressure forces the piston ring against the cylinder wall to form a seal. Pressure applied to the piston ring is approximately proportional to the combustion gas pressure. A wiper ring is the piston ring with a tapered face located in the ring groove between the compression ring and the oil ring."}, {"url": "http://courses.washington.edu/engr100/Section_Wei/engine/UofWindsorManual/Piston%20and%20Piston%20Rings.htm", "passage_text": "An oil ring is the piston ring located in the ring groove closest to the crankcase. The oil ring is used to wipe excess oil from the cylinder wall during piston movement. Excess oil is returned through ring openings to the oil reservoir in the engine block. Combustion gas pressure forces the piston ring against the cylinder wall to form a seal. Pressure applied to the piston ring is approximately proportional to the combustion gas pressure. A wiper ring is the piston ring with a tapered face located in the ring groove between the compression ring and the oil ring."}]