[{"url": "http://blog.geniusondemand.com.au/2012/12/09/127/", "passage_text": "Of the 3 cameras that are available I chose the QC3834 which also offers PTZ (Pan Tilt Zoom), I’m sure the other two are almost identical except for the housing. Picture Quality – At 640×480 (max) the picture quality is adequate and colour is good."}, {"url": "https://addons.mozilla.org/en-US/firefox/addon/pdf-plugin-for-firefox-on-mac-/", "passage_text": "Note from Mozilla: This add-on has been discontinued. Try PDF Viewer instead. PDF plugin for Firefox 3 on Mac OS X. Displays PDF documents in the browser. Download for Mac OS X. This add-on is not compatible with your version of Firefox because of the following: Download Anyway."}, {"url": "http://download.cnet.com/SuperCam/3000-2064_4-75613015.html", "passage_text": "IP cameras are one of the most viable solutions offered to security-conscious small businesses and homeowners. You can access them from any computer with an Internet connection. SuperLivePro lets you watch some cameras from your Android-powered smartphone or tablet. However, you might not be able to tap into all of your camera's features with this app."}, {"url": "http://download.cnet.com/SuperCam/3000-2064_4-75613015.html", "passage_text": "Editors' Review. by: Download.com staff on January 07, 2013. IP cameras are one of the most viable solutions offered to security-conscious small businesses and homeowners. You can access them from any computer with an Internet connection. SuperLivePro lets you watch some cameras from your Android-powered smartphone or tablet. However, you might not be able to tap into all of your camera's features with this app."}, {"url": "http://blog.geniusondemand.com.au/2012/12/09/127/", "passage_text": "After some shopping around for security cameras I recently opted to try out the Jaycar Techview QC3834 for it’s low cost and wireless capabilities. Like many devices this new range of wireless IP (QC3834 – QC3836 – QC3832) cameras is almost fully Mac compatible despite no information about Mac installation. Readers may not be familiar with some of this terminology, so before I go into any further detail about setup I will give a few definitions."}]