[{"url": "http://www.infoplease.com/encyclopedia/science/pepsin.html", "passage_text": "pepsin. pepsin, enzyme produced in the mucosal lining of the stomach that acts to degrade protein. Pepsin is one of three principal protein-degrading, or proteolytic, enzymes in the digestive system, the other two being chymotrypsin and trypsin. The three enzymes were among the first to be isolated in crystalline form."}, {"url": "https://en.wikipedia.org/wiki/Pepsin", "passage_text": "Pepsin is a digestive protease, a member of the aspartate protease family. Pepsin is one of three principal protein-degrading, or proteolytic, enzymes in the digestive system, the other two being chymotrypsin and trypsin. The three enzymes were among the first to be isolated in crystalline form. Pepsin is expressed as a pro-form zymogen, pepsinogen, whose primary structure has an additional 44 amino acids. In the stomach, chief cells release pepsinogen."}, {"url": "http://www.worthington-biochem.com/PM/default.html", "passage_text": "Enzymatic Reaction (image will open in a new window). Pepsin is the principal proteolytic enzyme of vertebrate gastric juice. Its inactive precursor form, pepsinogen, is produced in stomach mucosa. The minor pepsins are designated “B”, “C”, and “D”, while the major component is “A”, to which the following data applies. History:"}, {"url": "https://en.wikiversity.org/wiki/Enzyme_structure_and_function", "passage_text": "[edit]. α-chymotrypsin. The labelled amino acids form the active site of the enzyme. 1  Enzymes are protein macromolecules. 2  They have a defined amino acid sequence, and are typically 100-500 amino acids long. 3  They have a defined three-dimensional structure. 1 Enzymes are protein macromolecules. 2  They have a defined amino acid sequence, and are typically 100-500 amino acids long. 3  They have a defined three-dimensional structure. 4  Enzymes are catalysts. 5  They act as a catalyst to a chemical or biochemical reaction, with a defined mechanism."}, {"url": "http://www.biotopics.co.uk/jsmol/pepsin.html", "passage_text": "Click on the interactive links below. Pepsin is a protease (protein-digesting enzyme), which is active in the stomach. The porcine pepsin molecule displayed here consists of 327 amino acid residues - 2797 atoms, ignoring hydrogen atoms, but this also includes oxygens from 375 water molecules! "}, {"url": "https://en.wikipedia.org/wiki/Pepsin", "passage_text": "Pepsin is an enzyme whose zymogen (pepsinogen) is released by the chief cells in the stomach and that degrades food proteins into peptides. Pepsin is expressed as a pro-form zymogen, pepsinogen, whose primary structure has an additional 44 amino acids. In the stomach, chief cells release pepsinogen."}, {"url": "https://en.wikiversity.org/wiki/Enzyme_structure_and_function", "passage_text": "In this lesson, the three-dimensional structure of proteins will be discussed: the primary structure of polypeptides, secondary structures found in proteins (α-helix, β-sheet), and the tertiary structure. The concept of an enzyme active site will be introduced. 1 Enzymes are protein macromolecules. 2  They have a defined amino acid sequence, and are typically 100-500 amino acids long. 3  They have a defined three-dimensional structure. 4  Enzymes are catalysts. 5  They act as a catalyst to a chemical or biochemical reaction, with a defined mechanism."}]