[{"url": "http://www.cbsnews.com/news/can-i-apply-for-multiple-jobs-at-the-same-company/", "passage_text": "If you apply for every job at every store, then you've got the do not hire stamp on your forehead. But if you apply for the same job at five different stores (or five very similar jobs) and it's feasible that you could work for any of them, you look like you're very interested in working for this company."}, {"url": "http://www.learnvest.com/2013/10/tempted-to-apply-for-multiple-jobs-at-the-same-company/", "passage_text": "Applying for different positions in the company works if you are truly qualified for the positions you’re applying to. It also helps if you are tailoring your resume résumé for each. Position another factor you must consider is the size of the. company"}, {"url": "http://publichealth.gwu.edu/blogs/careers/2014/06/25/weekly-career-tip-applying-for-two-jobs-at-the-same-company/", "passage_text": "Can you apply to more than one job at the same company? Yes, but there are a couple of things to keep in mind. First, make sure that you’re actually qualified for the jobs to which you apply, and second make sure that the jobs are similar enough that you’re communicating a targeted job search."}, {"url": "https://answers.yahoo.com/question/index?qid=20110528053657AAbWybr", "passage_text": "Most job seekers apply for multiple jobs and employers are very aware of it. In most cases when two or more employers offer a position it is up to the candidate to chose one. Most candidates do not mention that they have more than one offer."}, {"url": "http://www.cbsnews.com/news/can-i-apply-for-multiple-jobs-at-the-same-company/", "passage_text": "Dear Evil HR Lady, I just read your article about applying to any and all jobs at one specific company, and how that's, well, crazy. While I would never beat an employer over the head trying to get a job, I would like to know your opinion on applying for the same position, but in different locations within the company."}, {"url": "http://www.cpa911.com/wordpress/2011/11/279/", "passage_text": "To apply the payment to the individual jobs/invoices use the following steps: 1  Choose Customers | Receive Payments. 2  In the Received From field, select one of the jobs (do not select the customer). 3  Fill in the amount of the check that is earmarked for this job’s invoice. 4  Enter the check number. 5  Select the invoice."}, {"url": "http://www.popsugar.com/smart-living/Acceptable-Apply-Multiple-Positions-One-Company-1640702", "passage_text": "Applying for different positions in the company works if you are truly qualified for the positions you're applying to. It also helps if you are tailoring your resume résumé for each. Position another factor you must consider is the size of the. company"}, {"url": "http://idealistcareers.org/community-question-can-i-apply-for-multiple-positions-at-the-same-organization/", "passage_text": "Some people worry that applying for multiple positions shows indecisiveness or lack of commitment to one job field. A recent thread on Reddit asked this same questions and the folks who replied said to apply separately for each position, catering each cover letter and resume to fit the different job."}]