[{"url": "http://www.futures-supplies.co.uk/product.asp?p_part_code=007%2E041S", "passage_text": "Viakal... your solution for limescale removal for a shine that lasts. Viakal is a limescale and watermark remover for house surfaces e.g. baths, taps, sinks and toilets. Limescale is the build up of mineral deposits which occur in everyone's water supply"}, {"url": "http://www.janitorialdirect.co.uk/viakal-bathroom-cleaner-and-descaler-750ml-2984.html", "passage_text": "Viakal can safely be used on: Chrome fixtures, stainless steel and fibreglass surfaces, ceramic tiles, porcelain (sink, shower tray, WC, bidet), glass/plastic (shower doors, plastic baths, vases), aluminium. Viakal is also safe for septic tanks. Limescale is the build up of mineral deposits which occur in everyone's water supply. Householders in hard water areas (about 47% of the UK population) are particularly prone to limescale build-up, although it does occur with soft water aswell."}, {"url": "https://en.wikipedia.org/wiki/Limescale", "passage_text": "Limescale is the hard, off-white, chalky deposit found in kettles, hot-water boilers and the inside of inadequately maintained hot-water central heating systems. It is also often found as a similar deposit on the inner surface of old pipes and other surfaces where  hard water  has evaporated. In addition to being unsightly and hard to clean, limescale seriously impairs the operation or damages various components. Limescale buildup inside a pipe reduces both liquid flow through the pipe and thermal conduction from the liquid to the outer pipe shell. Both effects will reduce the pipe's overall thermal efficiency when used as a heat exchanger."}, {"url": "http://www.tesco.com/groceries/Product/Details/?id=252675391", "passage_text": "Description. Viakal Descaler removes hard water marks & dissolves limescale. Its formula helps avoid watermarks & prevent limescale return while respecting your surfaces. Ideal for surfaces that are exposed to water in your bathroom and kitchen. You can use it every day for a brilliant shine"}, {"url": "http://www.dooyoo.co.uk/household-cleaning/viakal/", "passage_text": "Using Viakal is quite simple, however there are instructions on the back of the bottle which are also accompanied with small pictures. To use the Viakal you spray it onto the surface, wipe with either a dry or damp cloth and then rinse thoroughly with clean water. The Viakal comes in a white plastic bottle, this is wider at the bottom and thinner towards the top which makes it an ideal shape to hold, it also has a blue and white spray trigger on top which can be unscrewed if needed."}, {"url": "http://www.janitorialdirect.co.uk/viakal-bathroom-cleaner-and-descaler-750ml-2984.html", "passage_text": "Viakal is a blue liquid with a refreshing fragrance. It dissolves limescale and creates a water sheeting action on surfaces to prevent further limescale build-up, whilst delivering a remarkable end shine by removing the dulling effect caused by limescale deposits. Limescale is the build up of mineral deposits which occur in everyone's water supply. Householders in hard water areas (about 47% of the UK population) are particularly prone to limescale build-up, although it does occur with soft water aswell."}, {"url": "http://www.janitorialdirect.co.uk/viakal-bathroom-cleaner-and-descaler-750ml-2984.html", "passage_text": "Viakal is a limescale and watermark remover for house surfaces e.g. baths, taps, sinks and toilets. Limescale is the build up of mineral deposits which occur in everyone's water supply. Householders in hard water areas (about 47% of the UK population) are particularly prone to limescale build-up, although it does occur with soft water aswell."}, {"url": "http://www.dooyoo.co.uk/household-cleaning/viakal/", "passage_text": "I have used Viakal on several occasions and have been pleased with the results every time, personally I do not use it every day and tend just to use it when I have tough limescale that needs removing. I particularly like Viakal is it is easy to use and can make your sink shiny very quickly without any hassle or mess. The Viakal comes in a white plastic bottle, this is wider at the bottom and thinner towards the top which makes it an ideal shape to hold, it also has a blue and white spray trigger on top which can be unscrewed if needed."}, {"url": "http://www.dooyoo.co.uk/household-cleaning/viakal/", "passage_text": "The first time I used Viakal the limescale was so thick especially around the taps and I found I had to do a little scrubbing with the scouring side of an ordinary kitchen sponge but I did get 100% of the lime scale off easily. The Viakal comes in a white plastic bottle, this is wider at the bottom and thinner towards the top which makes it an ideal shape to hold, it also has a blue and white spray trigger on top which can be unscrewed if needed."}]