[{"url": "http://www.doxycycline-100mg.com/doxycycline_acne.html", "passage_text": "Doxycycline is a tetracycline antibiotic. It works by slowing the growth of bacteria in the body. Doxycycline 100mg is used to treat many different bacterial infections, for example urinary tract infections, gonorrhea, chlamydia, periodontitis (gum disease), and even acne."}, {"url": "http://antibiotics.emedtv.com/doxycycline/doxycycline-dosage.html", "passage_text": "In children ages eight or older, your healthcare provider will prescribe a doxycycline dosage based on a weight chart, usually about 1 to 2 mg per pound of body weight per day. The dose is divided and taken for 7 to 14 days."}, {"url": "http://www.doxycycline-100mg.com/doxycycline_acne.html", "passage_text": "Doxycycline is usually perscribed when other treatments have failed. It is often used for inflammatory acne or for people who have had acne for a long time. People often start to see an improvement within 7-10 days with good improvement in skin condition after about 4 weeks."}, {"url": "http://acne.emedtv.com/doryx/doryx-dosage.html", "passage_text": "In children ages eight or older, your healthcare provider will prescribe a Doryx dose based on the child's weight, usually about 1 to 2 mg per pound of body weight per day. The dose is taken for 7 to 14 days. Children weighing more than 100 pounds should receive the standard adult dosage."}, {"url": "http://antibiotics.emedtv.com/doxycycline/doxycycline-dosage.html", "passage_text": "Dose of Doxycycline for Bacterial Infections. The recommended doxycycline dosage for most types of bacterial infections in adults is 100 mg to 200 mg per day for 7 to 14 days. For chronic (long-term) or more serious infections, treatment can be carried out for a longer time."}, {"url": "http://antibiotics.emedtv.com/doxycycline/doxycycline-dosage.html", "passage_text": "The recommended doxycycline dosage for most types of bacterial infections in adults is 100 mg to 200 mg per day for 7 to 14 days. For chronic (long-term) or more serious infections, treatment can be carried out for a longer time."}, {"url": "http://acne.emedtv.com/doryx/doryx-dosage.html", "passage_text": "The recommended dose of Doryx for preventing malaria in adults is 100 mg daily. For children, the dosage is 2 mg per kilogram of body weight (about 0.9 mg per pound), not to exceed 100 mg per day."}, {"url": "http://www.everydayhealth.com/drugs/doxycycline", "passage_text": "For adults, the normal dose of oral doxycycline is 200 mg on the first day of treatment. Usually you take that as two 100-mg doses, 12 hours apart. After this initial dose, people usually take a maintenance dose of 100 mg daily for seven to 10 days."}, {"url": "http://www.ncbi.nlm.nih.gov/pubmed/16146617", "passage_text": "Doxycycline hyclate 20 mg bid is an effective maintenance dosage in patients with inflammatory acne. Twelve subjects aged 14 to 36, both men and women, completed a 16-week study to demonstrate the effectiveness of submicrobial dosing of doxycycline hyclate."}]