[{"url": "http://andrewmoultonmd.com/spine-anatomy.php", "passage_text": "Beneath the last cervical vertebra are the 12 vertebrae of the Thoracic Spine. These are abbreviated T1 through T12 (top to bottom). T1 is the smallest and T12 is the largest thoracic vertebra. The thoracic vertebrae are larger than the cervical bones and have longer spinous processes. "}, {"url": "http://www.dartmouth.edu/~humananatomy/part_7/chapter_39.html", "passage_text": "The vertebral column usually consists of 33 vertebrae: 24 presacral vertebrae (7 cervical, 12 thoracic, and 5 lumbar) followed by the sacrum (5 fused sacral vertebrae) and the coccyx (4 frequently fused coccygeal vertebrae). The 24 presacral vertebrae allow movement and hence render the vertebral column flexible. "}, {"url": "https://en.wikipedia.org/wiki/Lumbar_vertebrae", "passage_text": "In the upper lumbar region the lamina are taller than wide but in the lower lumbar vertebra the lamina are wider than tall. The lamina connect the spinous process to the pedicles. The vertebral foramen within the arch is triangular, larger than in the thoracic vertebrae, but smaller than in the cervical vertebrae. Sacralization of the fifth lumbar vertebra (or sacralization) is a congenital anomaly, in which the transverse process of the last lumbar vertebra (L5) fuses to the sacrum on one side or both, or to ilium, or both. These anomalies are observed at about 3.5 percent of people, and it is usually bilateral"}, {"url": "http://www.innerbody.com/anatomy/skeletal/lumbar-vertebrae-lateral", "passage_text": "The lumbar vertebrae consist of five individual cylindrical bones that form the spine in the lower back. These vertebrae carry all of the upper body’s weight while providing flexibility and movement to the trunk region. They also protect the delicate spinal cord and nerves within their vertebral canal. Found along the body’s midline in the lumbar (lower back) region, the lumbar vertebrae make up the region of the spine inferior to the thoracic vertebrae in the thorax and superior to the sacrum and coccyx in the pelvis.... "}, {"url": "http://www.answers.com/Q/What_are_vertebrae_and_what_is_their_function", "passage_text": "Answer by Ligand. Confidence votes 7.7K. A vertebrae are bones in the spinal column (also called spine or backbone). The function of the spinal column is to protect the soft spinal cord and to support the body and hold the head upright. Plural for vertebra. Bony segments forming the human spinal column."}, {"url": "https://www.kenhub.com/en/library/anatomy/thoracic-vertebrae", "passage_text": "The thoracic vertebrae are located in the middle section of the vertebral column, specifically inferior to the cervical vertebrae and superior to the lumbar vertebrae. These vertebrae span the large majority of the chest cavity area. There are 12 thoracic vertebrae (denoted as T1-T12) found in adult humans, and they are situated in between the cervical and lumbar vertebrae, with a general sizing larger than the cervical but smaller than"}, {"url": "https://www.kenhub.com/en/library/anatomy/thoracic-vertebrae", "passage_text": "1 Fifth thoracic vertebrae (T5) : The T5 and T4 vertebrae are at the same levels as the sternal angle. 2  The trachea branches into the two main bronchi at the level of T5. 3  The thoracic spinal nerve 5 passes through underneath T5. 4  Sixth thoracic vertebrae (T6) : The thoracic spinal nerve 6 passes through underneath T6. There are 12 thoracic vertebrae (denoted as T1-T12) found in adult humans, and they are situated in between the cervical and lumbar vertebrae, with a general sizing larger than the cervical but smaller than the lumbar vertebrae."}, {"url": "http://neuroscience.uth.tmc.edu/s2/chapter03.html", "passage_text": "The spinal cord is the most important structure between the body and the brain. The spinal cord extends from the foramen magnum where it is continuous with the medulla to the level of the first or second lumbar vertebrae. It is a vital link between the brain and the body, and from the body to the brain. The spinal cord is 40 to 50 cm long and 1 cm to 1.5 cm in diameter. Two consecutive rows of nerve roots emerge on each of its sides. These nerve roots join distally to form 31 pairs of spinal nerves."}]