[{"url": "https://www.navycs.com/asvab-test.html", "passage_text": "The AFCT is a version of the ASVAB, and it is administered in the same manner as the ASVAB's paper-version. NPS applicants with AFQT scores less than 50 must have a Tier I education status (i.e... Traditional high school diploma graduate, 15 semester hours of accredited college credit or other approved avenues-check with your Navy Recruiter for your education Tier status). Check with your local Navy Recruiter for updates. ASVAB line score data current as of June 1, 2015 according to COMNAVCRUITCOMINST 1130.8J latest change, Change 8."}, {"url": "http://www.instantasvab.com/score/requirements-for-navy-jobs.html", "passage_text": "Qualification for jobs in the Navy are based on your ASVAB line scores which, in turn, are combinations of your scores on the various subtests that make up the ASVAB. Below is a table listing the Navy job rating and title and the minimum ASVAB subtest scores required to qualify for the training. NEW! Check out the ASVAB Score Calculator for the most up-to-date information about Navy score requirements."}, {"url": "http://work.chron.com/jobs-asvab-score-60-18861.html", "passage_text": "Army jobs most likely available for AFQT 60 score recipients include combat, administrative, intelligence, mechanical, medical and computer jobs, plus many others. Jobs in the other military branches are just as varied for those with an AFQT score of 60, including many technical specialties. AFQT Score Range. According to the U.S. Army, people are referring to their AFQT score when they talk about their ASVAB score. AFQT scores range from 1 to 99 and they're spread across eight categories from Category I for scores of 93 to 99 down to Category V for scores of 1 to 9."}, {"url": "http://www.navydads.com/forum/topics/asvab-scores-by-rate", "passage_text": "Jobs in the Navy are called Ratings. To find the rating you qualify for, the Navy looks at your ASVAB subtest scores-different subtests for different ratings. Note: The data listed here is subject to change and is only an example of how ASVAB Scores are related to job selection for the Navy. RATING, NAVY RATING TITLE and Minimum ASVAB Subtest Scores. ABE-Aviation Boatswain's Mate-Equipment AR+MC+AS=130."}, {"url": "http://www.military.com/ASVAB/0,,ASVAB_MOS.html", "passage_text": "Your ASVAB scores determine what jobs you will qualify for in the military. Before you embarrass yourself though, you should know that a job in the Army and the Marine Corps is called an MOS - short for Military Occupational Specialty.. "}, {"url": "http://work.chron.com/jobs-asvab-score-60-18861.html", "passage_text": "ASVAB Subtest Scores. Each military branch uses the ASVAB's 10 subtests, such as word knowledge and mathematics knowledge, to create a composite score for each job. In addition to its AFQT, every military job also has a minimum ASVAB composite score that an enlistee must meet to qualify for training in that job. AFQT Score Range. According to the U.S. Army, people are referring to their AFQT score when they talk about their ASVAB score. AFQT scores range from 1 to 99 and they're spread across eight categories from Category I for scores of 93 to 99 down to Category V for scores of 1 to 9."}, {"url": "http://www.military.com/ASVAB/0,,ASVAB_MOS_Navy.html", "passage_text": "Jobs in the Navy are called Ratings. To find the rating you qualify for, the Navy looks at your ASVAB subtest scores-different subtests for different ratings. Note: The data listed here is subject to change and is only an example of how ASVAB Scores are related to job selection for the Navy."}, {"url": "https://www.navycs.com/asvab-test.html", "passage_text": "The AFQT standard (raw) score is computed with the formula 2VE+AR+MK. That standard score is then compared to a chart for the version of the ASVAB/AFCT you took to produce your true AFQT. The ASVAB/AFCT tests are made up of nine sections in the following order: 1  General Science (GS). 2  Arithmetic Reasoning (AR). Check with your local Navy Recruiter for updates. ASVAB line score data current as of June 1, 2015 according to COMNAVCRUITCOMINST 1130.8J latest change, Change 8."}]