[{"url": "http://www.theatlantic.com/business/archive/2015/02/how-much-do-waiters-really-earn-in-tips/385515/", "passage_text": "In PayScale's sample, women earned $1 more per hour in tips, but men were paid $1 more in base pay—bringing both to about $13 for median pay per hour. That's still below the national median for hourly wage for all occupations, which is $16.87, but it's $4 more than the BLS median for waiters and waitresses. "}, {"url": "https://answers.yahoo.com/question/index?qid=1006042205136", "passage_text": "I lived in Georgia then, have lived in Florida since January this year. In Georgia, I made 2.18 as hourly pay, with tips (worked at Cracker Barrel) the average was between $12 and $15 an hour. My wages last year (hourly and tips together) was a little over $22,000. "}, {"url": "http://www.indeed.com/forum/job/waiter%2Fwaitress/Hourly-pay-question/t32968", "passage_text": "If you say you are making 50-100 a shift and you work 5 shifts, then at $75, thats $750 every two weeks. I think you are just inexperienced and with any industry you have to have experience to make $. I have been in the industry for 15 yrs and last year on paper alone I claimed 45,000. I've only been at it for about a month so far. Here's my question: I get paid $2.19 hourly, plus tips, which are usually between $50 and $100 per shift. My last paycheck was for only $23 for two weeks worth of base salary work (74 hours). $139 was taken out in taxes."}, {"url": "http://houston.culturemap.com/news/restaurants-bars/12-28-11-being-a-waiter-is-a-better-job-than-you-think-average-salary-of-49000-a-year-in-houston/", "passage_text": "According to SimplyHired.com, the average salary for a waiter in Houston is $49,000 a year, and some can make a lot more than that. “I’ve being doing this for 10 years,” says 28-year-old Michael Brand, who works at the just-opened Triniti. According to SimplyHired.com, the average salary for a waiter in Houston is $49,000 a year, and some can make a lot more than that. b). It’s hard work. Physically hard and emotionally taxing."}, {"url": "http://houston.culturemap.com/news/restaurants-bars/12-28-11-being-a-waiter-is-a-better-job-than-you-think-average-salary-of-49000-a-year-in-houston/", "passage_text": "According to SimplyHired.com, the average salary for a waiter in Houston is $49,000 a year, and some can make a lot more than that. The longevity is just unbelievable,” Tony Vallone says of his waitstaff. Raul Larios has been with Vallone for 37 years. I eat in restaurants. I write about them. According to SimplyHired.com, the average salary for a waiter in Houston is $49,000 a year, and some can make a lot more than that. b). It’s hard work. Physically hard and emotionally taxing."}, {"url": "http://money.usnews.com/careers/best-jobs/waiter-and-waitress/salary", "passage_text": "But even though they earn a combination of hourly wages and tips, waiters and waitresses don’t make much money. According to the BLS, servers earned an average hourly wage of $10.04, or about $20,880 for the year. They made a median salary of $18,590 in 2013. Best Paying Cities for Waiters and Waitresses. The highest paid in the waiter and waitress profession work in the metropolitan areas of Boston, Seattle, and Burlington, Vermont. The Spokane, Washington area also pays well, as does the city of Peabody, Massachusetts."}, {"url": "https://www.recruiter.com/salaries/waiters-and-waitresses-salary/", "passage_text": "A high school diploma is often required for employment in this professional field. A Waiter or Waitress can expect a pay level of somewhere between 16000 and 24000 based on experience. Waiters and Waitresses usually get an average pay level of Twenty Thousand Eight Hundred dollars per year. Waiters and Waitresses are paid most highly in Washington, where they get wages of about $28590. People holding this job title are compensated most highly in Administrative, Support and Waste Management Services, where they earn average job salaries of $29810. The national wage distribution is shown below."}, {"url": "http://www.payscale.com/research/US/Job=Waiter%2fWaitress/Hourly_Rate", "passage_text": "Waiter/Waitress Salary. (United States). The average pay for a Waiter/Waitress is $4.94 per hour. For the first five to ten years in this position, pay increases sharply, but any additional experience does not have a big effect on pay. People in this job generally don't have more than 20 years' experience. $8,525 - $40,463"}, {"url": "http://work.chron.com/much-money-average-waitress-make-per-month-22289.html", "passage_text": "Income and Qualifications. Most waitresses are paid by the hour and earn tips on top of their hourly wages. Average tips for a waitress are 15 to 20 percent of the total bill, according to iTipping.com. Therefore, a waitress that rings up $400 during a four-hour shift should make $60 to $80 in tips. Average hourly rates for waitresses were $9.95 as of May 2012, according to the U.S Bureau of Labor Statistics -- or $20,710 per year. This equates to $1,725.83 per month. The top 10 percent made over $2,459.16 monthly."}]