[{"url": "http://www.utiitsl.com/UTIITSL_SITE/site/pan/", "passage_text": "General Information for Application of PAN card 1. Application for a PAN card should be made on the UTIITSL given form or the form given by the Service Center of IT PAN, or the website: http://www.utiitsl.com. 2. Also Rs.106/- worth processing coupon, from any IT PAN Service Center must be affixed to the form. 3. For instance, if the box 7 is checked, which is for communication address, the address would be changed itself, by default, and updated in ITD records. It is important to note that while using PAN card India any ITD change in regards to the information given to ITD, must be notified to them by way of this form."}, {"url": "http://www.utiitsl.com/UTIITSL_SITE/site/pan/", "passage_text": "It is done when any data relevant to the PAN card, such as applicant’s name, father’s name, change in birth date, alteration of the address, etc need to be made, and updated in the ITD records. Though this does not result in the change in the PAN number, the relevant information is updated, and a new PAN card is issued. For instance, if the box 7 is checked, which is for communication address, the address would be changed itself, by default, and updated in ITD records. It is important to note that while using PAN card India any ITD change in regards to the information given to ITD, must be notified to them by way of this form."}, {"url": "https://en.wikipedia.org/wiki/Permanent_account_number", "passage_text": "Permanent Account Number (PAN) is a code that acts as identification of Indians, especially those who pay Income Tax. An example number would be in the form of AAAPL1234C. It is issued by the Indian Income Tax Department under the supervision of the Central Board for Direct Taxes (CBDT) and it also serves as an important proof of identification."}, {"url": "http://www.knowyourpancard.com/2015/03/how-to-check-address-in-your-pan-card.html", "passage_text": "When ever government issue pan card in that there is no address are their. So, everyone want to know that which address i have given to my PAN Card. Because if some one stay some rent house or changed the address of the house. So, for checked that each and every things we want to know the address of the Pan Card. But you want to know How to Check Address in Pan Card. It's really easy steps to check it out address. Follow Below mention steps for checking address in your pan c"}, {"url": "https://www.tin-nsdl.com/pan-verify/pan-varify-index.php", "passage_text": "Online PAN Verification. To enable eligible Entities verify Permanent Account Numbers (PANs), Income Tax Department (ITD) has authorized NSDL e-Governance Infrastructure Limited (NSDL e-Gov) to launch an online PAN verification service for verification of PANs by authorized entities. "}, {"url": "http://www.fingyan.com/how-to-verify-your-pan-address-in-pan-database/", "passage_text": "If you want to update your PAN address in case of change in your residence address or job location then all you have to do is follow the steps given below to get your data corrected in the PAN database. Like to make income tax department send your tax refund at your present address it is important for you to know is your present address updated at PAN database or not if not how you can update the same to avoid any delay in receiving refund amount."}, {"url": "http://pancardoffice.com/know-pan-card-holder-name-address-pan-number/", "passage_text": "Then Login here https://incometaxindiaefiling.gov.in/e-Filing/UserLogin/LoginHome.html. here you will see your Address 1, and Address 2. Verify any pan card details like pan number, name, AO, Jurisdictional Assessing officer, building name from our new website www.searchpan.com. Categories. 1  change name. 2  changes. 3  complains. 4  forms. 5  minor. 6  pan card reissue. 7  pan-correction. 8  pan-status. 9  questions. 10  uncategorize. 11  Uncategorized."}, {"url": "http://www.thepancard.com/apply-pan-correction.php", "passage_text": "Apply for Changes or Correction in PAN details. This application should be used when a Permanent Account Number (PAN) has already been allotted to the applicant, but when data associated with the PAN (e.g. name of applicant / father's name / date of birth / address) is required to be updated in records of ITD. "}, {"url": "http://pancardoffice.com/know-pan-card-holder-name-address-pan-number/", "passage_text": "How to know pan card holder name and address from pan number. December 18, 2014October 7, 2015 Admin. Know the pan card holder’s name and address details or verify pan details through the PAN card number. income tax India efiling have a facility for knowing the Jurisdictional Assessing officer. Categories. 1  change name. 2  changes. 3  complains. 4  forms. 5  minor. 6  pan card reissue. 7  pan-correction. 8  pan-status. 9  questions. 10  uncategorize. 11  Uncategorized."}, {"url": "http://www.utiitsl.com/UTIITSL_SITE/site/pan/", "passage_text": "Apply Online for Change/Correction in PAN Card details (CSF): » Apply for Change/Correction in PAN Card details (CSF). » Regenerate your Online Application for Change Request. » Download blank Change Request Form (pdf). Click here to check status online. For instance, if the box 7 is checked, which is for communication address, the address would be changed itself, by default, and updated in ITD records. It is important to note that while using PAN card India any ITD change in regards to the information given to ITD, must be notified to them by way of this form."}]