[{"url": "http://learn.org/articles/What_is_the_Starting_Salary_for_a_Probation_Officer.html", "passage_text": "Payscale.com reported in January 2014 that most probation officers with 1-4 years of experience earned between $24,666 and $48,479, while those with 10-19 years of experience had an annual salary range of $30,932 to $79,983. Workers in the bottom 10 percentile of salaries made $31,590 or less, and those in the top 10 percentile of salaries made $83,410 or higher. A January 2014 salary report from Payscale.com showed most probation officers earned between $24,666 and $48,479 with less than a year of experience."}, {"url": "http://work.chron.com/average-salary-juvenile-probation-officer-masters-degree-5234.html", "passage_text": "Probation officer salaries averaged $47,840 per year as of May 2011, according to the Bureau of Labor Statistics. The lowest 10 percent earned $31,210, and the highest earned more than $80,000. Highest-Paying Areas. The BLS reports that the states paying the highest wages for probation officers in 2011 included California, with annual wages of $77,230; Texas, with annual wages of $40,670; and Florida, with annual wages of $37,860."}, {"url": "http://learn.org/articles/What_is_the_Starting_Salary_for_a_Probation_Officer.html", "passage_text": "Your salary can also depend on your employer. Probation officers are most often employed by state and local government agencies. The BLS reported that mean earnings for those working for state government were $52,840 in May 2012, while those working for local government made mean wages of $53,110. Workers in the bottom 10 percentile of salaries made $31,590 or less, and those in the top 10 percentile of salaries made $83,410 or higher. A January 2014 salary report from Payscale.com showed most probation officers earned between $24,666 and $48,479 with less than a year of experience."}, {"url": "http://www.probationofficeredu.org/juvenile-probation-officer/juvenile-probation-officer-salary/", "passage_text": "Different Employers, Different Salaries. State or local governments employ the majority of juvenile probation officers. The average juvenile probation officer salary paid by local agencies is $53,110, and similarly, the average salary for state court probation officers is $52,840. Courts serving urban areas tend to offer much greater salaries than those within similar courts in rural area"}, {"url": "http://probationofficerinfo.com/probation-officer-salary.php", "passage_text": "The average range of a probation officer salary is about $40,000 - $60,000 per year. While a small number of probation officers earn below $30,000 per year, as well as a small number earning over $70,000 per year. "}, {"url": "http://work.chron.com/average-salary-juvenile-probation-officer-masters-degree-5234.html", "passage_text": "Probation officers in nonmetropolitan areas may earn less than $40,000 per year. Although probation officers are required to have a bachelor's degree, they gain no financial incentives such as enhanced pay offered for advanced education or training, per the American Probation and Parole Association 2009 survey. Highest-Paying Areas. The BLS reports that the states paying the highest wages for probation officers in 2011 included California, with annual wages of $77,230; Texas, with annual wages of $40,670; and Florida, with annual wages of $37,860."}, {"url": "http://www1.salary.com/Parole-Officer-salary.html", "passage_text": "For example the median expected annual pay for a typical Parole Officer in the United States is $53,140, so 50% of the people who perform the job of Parole Officer in the United States are expected to make less than $53,140. Source: HR Reported data as of October 2015. 1  Salary. 2  Salary + Bonus. 3  Benefits. The annual salary for someone with the job title Parole Officer may vary depending on a number of factors including industry, company size, location, years of experience and level of education."}, {"url": "http://www.access2knowledge.org/jobs-education/how-much-does-a-probation-officer-make/", "passage_text": "How much do probation officers make? According to the United States Bureau of Labor Statistics, there are 86,780 probation officers employed throughout the United States. The average probation officer salary is $52,380, which equates to an average hourly wage of $25.18. The bottom ten percent in the profession makes $31,590 or less, the top ten percent of probation officers bring home a mean $83,410 each year. "}, {"url": "http://learn.org/articles/What_is_the_Starting_Salary_for_a_Probation_Officer.html", "passage_text": "Salary Overview. The BLS reported that the mean wage of probation officers and correctional treatment specialists in May 2012 was $52,380. Workers in the bottom 10 percentile of salaries made $31,590 or less, and those in the top 10 percentile of salaries made $83,410 or higher. A January 2014 salary report from Payscale.com showed most probation officers earned between $24,666 and $48,479 with less than a year of experience. Your salary for the first and subsequent years is determined by a number of factors, such as years of experience, job location and employer"}]