[{"url": "http://ecmweb.com/content/calculating-your-true-electrical-labor-cost", "passage_text": "You have to decide if you're going to use a shop average labor rate or a weighted job average labor rate. The labor cost per man-hour is significantly different in different areas of the country. For example, in the Southeast, a qualified licensed electrician might have a base pay rate of less than $15 per hour. In the North or Midwest, the base pay rate might be over $50 per hour. Therefore I have elected to use $21 per man-hour for this discussion"}, {"url": "http://work.chron.com/much-electricians-typically-charge-per-hour-6397.html", "passage_text": "For instance, many electricians will charge a higher rate for the first hour of work or include additional charges for travel. They may also charge a minimum fee, often the equivalent of one hour of work, for even the simplest and quickest of jobs. Average Income. According to the Bureau of Labor Statistics, the mean annual wage for an electrician was $52,910 as of May 2011. This worked out to $25.44 an hour, and the best paid -- or busiest -- electricians could earn the equivalent of $39.75 an hour or more if they were in the top 10 percent of earners."}, {"url": "http://ths.gardenweb.com/discussions/2589415/average-hourly-rate-for-electrician", "passage_text": "The top-paying industry for electricians was motion pictures and videos, at a much higher than average hourly rate of $36.32. No real pattern emerged from the BLS's study on the top-paying states for electrician rates. Alaska took the top honors with an hourly mean rate of $32.44. Closely behind were Illinois, at $32.33 per hour, and New York, at $32.00 per hour. Also higher than the country's median was Hawaii, at $31.59 per hour, and New Jersey, at $31.02 per hour.. These numbers represent what an electrician actually gets paid. 70 dollars per hour is my break even point to send a fully licensed electrician to a job. That includes vehicle cost not including any other overhead. Now I need a profit to stay in business. The only way to go cheaper is to bypass the governing agencies that are overseeing the integrity and safety of the work."}, {"url": "http://home.costhelper.com/electricians.html", "passage_text": "1 Although there are still a few low-cost areas where electricians work for $30-$50 an hour, typically they charge $50-$100 an hour or more depending on local rates and their qualifications. 2  Some electricians quote a flat fee per job rather than an hourly rate, depending on the scope and type of work to be performed. 1 There may also be a minimum $50-$150 service charge to come to the house and evaluate the problem. 2  Total cost for hiring an electrician will depend on the type of work done."}, {"url": "http://home.costhelper.com/electricians.html", "passage_text": "Electrician Cost. 1  Although there are still a few low-cost areas where electricians work for $30-$50 an hour, typically they charge $50-$100 an hour or more depending on local rates and their qualifications. 1 There may also be a minimum $50-$150 service charge to come to the house and evaluate the problem. 2  Total cost for hiring an electrician will depend on the type of work done."}, {"url": "http://www.ehow.com/info_8112070_much-typically-charge-per-hour.html", "passage_text": "The median rate is $22.68 per hour, with electricians in the 10th percentile charging $13.79, those in the 25th percentile earning $17.30, those in the 75th percentile earning $30.35, and those in the 90th percentile earning $38.59. In natural gas distribution, an electrician charges an hourly rate of $33.87 per hour, those working in services to buildings and dwellings earn $32 an hour, and those working in pipeline transportation of natural gas earn $30.73 an hour. Hourly rates for electricians vary depending on the cost of living in the area. The BLS names Alaska as the highest-paying state for electricians with an hourly mean wage of $32.44, followed by Illinois with a rate of $32.33 per hour and New York with a rate of $32 per hour"}, {"url": "http://www.topelectricians.com/articles/cost-per-hour", "passage_text": "In most states electrician hourly rates are fixed between 40 to 100 dollars per hour, if they are trained to be a professional electrician. Federal laws and codes govern the electrical work carried out by licensed electricians. "}, {"url": "http://work.chron.com/much-electricians-typically-charge-per-hour-6397.html", "passage_text": "Average Charges. Professional electricians may actually charge anywhere from $40 to $100 an hour, depending on the job and the skill level of the person performing it. For instance, a licensed journeyman averaged a $54.39 per hour charge for residential work as of 2012, according to the Top Electricians website. If an apprentice electrician is sent to perform a simpler job, the charge may be lower, with an average of $39.79 an hour. Average Income. According to the Bureau of Labor Statistics, the mean annual wage for an electrician was $52,910 as of May 2011. This worked out to $25.44 an hour, and the best paid -- or busiest -- electricians could earn the equivalent of $39.75 an hour or more if they were in the top 10 percent of earners."}]