[{"url": "https://answers.yahoo.com/question/index?qid=20070512234508AANvoKV", "passage_text": "The epidermis or outer layer is the active growing layer of the skin, which provides a tough outer layer of cells that protect us .It does not contain blood vessels and is nourished by a process called diffusion, in which fluid coming from the blood vessels in the next lower layer, the dermis. Source(s): Just to point out, you asked which part of the DERMIS does not contain any blood vessels. The epidermis is avascular as the answers above have mentioned, but the epidermis is not part of the dermis. The dermis and epidermis are two separate and distinct parts of the skin."}, {"url": "http://owh.adam.com/pages/guide/reftext/html/skin_sys_fin.html", "passage_text": "Skin: epidermal layers. The skin is the largest organ of the body, with a surface area of 18 square feet. Its two main layers are the epidermis (outer layer) and dermis (inner layer). The epidermis has several strata (layers) that contain four cell types. Loose connective tissue such as adipose tissue (fat) insulates the body, conserving heat. It also contains blood vessels, lymph vessels, and the bases of hair follicles and sweat glands. The fat distribution in this layer gives the female form its characteristic curves."}, {"url": "http://www.wisegeek.com/what-is-the-papillary-dermis.htm", "passage_text": "The papillary dermis contains blood vessels that serve two primary functions. One of these functions is to provide the tissue of the skin with vital nutrients and oxygen. Ad. The second function of the blood vessels within the papillary dermis to to regulate body temperature. Nerves present in the skin tell the body what the surrounding temperature is. This information can be used to either conserve or dissipate heat by increasing or decreasing blood flow to the dermis."}, {"url": "https://quizlet.com/1402815/deck-26-blood-vessels-and-the-heart-flash-cards/", "passage_text": "What type of blood vessel does not have these three layers. Terminal capillaries do not have these layers. Tunica intima is the innermost layer of endothelium and associated connective tissue. It varies in thickness and in specific vessels. Its surface is non-thrombogenic and it secretes materials to regulate blood fluidity."}, {"url": "http://www.ncbi.nlm.nih.gov/pubmedhealth/PMHT0022670/", "passage_text": "Arteries. A blood vessel that carries blood from the heart to tissues and organs in the body. Dermis. The inner layer of the two main layers of the skin. The dermis has connective tissue, blood vessels, oil and sweat glands, nerves, hair follicles, and other structures. It is made up of a thin upper layer called the papillary dermis, and a thick lower layer called the reticular dermis. Epidermis. Papillary Dermis. The thin top layer of the dermis (the inner layer of the skin). The papillary dermis has connective tissue and blood vessels that give nutrients to the epidermis (the outer layer of the skin) and that help control the temperature of the skin. PubMed Health Glossary."}, {"url": "https://en.wikipedia.org/wiki/Dermis", "passage_text": "The dermis is a layer of skin between the epidermis (with which it makes up the cutis) and subcutaneous tissues, that consists of connective tissue and cushions the body from stress and strain. "}, {"url": "http://www.answers.com/Q/What_is_the_function_of_the_papillary_layer_of_the_dermis", "passage_text": "The upper, papillary layer, contains a thin arrangement of collagen fibers. The papillary layer supplies nutrients to select layers of the epidermis and regulates temperature. Both of these functions are accomplished with a thin, extensive vascular system that operates similarly to other vascular systems in the body. The Papillary dermis and the Recticular dermis.   epidermis   endodermis The dermis does not have layers. However, the dermis is one of three major layers of skin."}, {"url": "http://www.answers.com/Q/What_is_the_function_of_the_papillary_layer_of_the_dermis", "passage_text": "Both layers comprise the dermis; the papillary layer is the upper layer and the reticular layer is the lower. The papillary layer is loose areolar connective tissue and the re … ticular layer is a dense irregular connective tissue. The Papillary dermis and the Recticular dermis.   epidermis   endodermis The dermis does not have layers. However, the dermis is one of three major layers of skin."}, {"url": "https://answers.yahoo.com/question/index?qid=20070512234508AANvoKV", "passage_text": "The overall dermis is vascular. The only part that could be avascular are the dermal papillae (upper part of the dermis), but this would be the exception rather than the rule because most dermal papillae contain blood vessels. Just to point out, you asked which part of the DERMIS does not contain any blood vessels. The epidermis is avascular as the answers above have mentioned, but the epidermis is not part of the dermis. The dermis and epidermis are two separate and distinct parts of the skin."}]