[{"url": "http://children.costhelper.com/nanny.html", "passage_text": "1 Costs for a nanny vary greatly by region. 2  According to BabyCenter.com and our own data points, a nanny can cost between $400 - $1,000+ a week based on the local supply and demand, the local cost of living, and the qualifications you seek in a nanny. Related articles: Day Care, Baby Sitter, Preschool. 1  Costs for a nanny vary greatly by region. 2  According to BabyCenter.com and our own data points, a nanny can cost between $400 - $1,000+ a week based on the local supply and demand, the local cost of living, and the qualifications you seek in a nanny."}, {"url": "http://www.nannies4hire.com/tips/983-nanny-salaries.htm", "passage_text": "According to the 2012 INA Nanny Salary and Benefits Survey: 1  The national average hourly rate for babysitting or short-term assignments is $16 per hour. 2  The national average gross weekly salary for full-time live-out nannies is $705. 3  The national average gross weekly salary for full-time live-in nannies is $652. Generally, a nanny with a lot of experience should average about $350 to $800 or more per week, based on a variety of factors. If you are just starting out as a nanny, don't be discouraged by the pay for nannies."}, {"url": "http://www.nannies4hire.com/tips/983-nanny-salaries.htm", "passage_text": "1 The national average hourly rate for babysitting or short-term assignments is $16 per hour. 2  The national average gross weekly salary for full-time live-out nannies is $705. 3  The national average gross weekly salary for full-time live-in nannies is $652. Generally, a nanny with a lot of experience should average about $350 to $800 or more per week, based on a variety of factors. If you are just starting out as a nanny, don't be discouraged by the pay for nannies."}, {"url": "http://www.safeandsoundnannies.com/cost.aspx", "passage_text": "Cost. In San Diego, the minimum hourly rate for a nanny is $15.00 per hour. Hourly rates may vary depending on (a) number of children, (b) location and (c) commuting time. As an employer, you pay the Nanny directly. Safe and Sound Nannies charges a one-time referral fee equal to one month of the nanny's wages. "}, {"url": "http://www.nannies4hire.com/tips/983-nanny-salaries.htm", "passage_text": "If you are looking into part-time nanny work, you can expect to be paid between $6 and $18 per hour, depending on the area you work and what is being offered by the parents. You can negotiate the cost of your services at the interview. Generally, a nanny with a lot of experience should average about $350 to $800 or more per week, based on a variety of factors. If you are just starting out as a nanny, don't be discouraged by the pay for nannies."}, {"url": "http://www.care.com/child-care-nanny-cost-p1145-q83979.html", "passage_text": "According to various web sources, in 2006, full-time nannies (45-50 hours/week) caring for one to two children received: 1  $325-$450 live-in; $8-12/hour live-out -- for a nanny who is 18-20 years old or has less than two years verifiable child care experience. CA. (I know some of the posters balk at paying someone $10/hr. but realistically one can't demand Beverly Hills or NYC prices in Fresno, CA, for instance.) The going hourly rate for a full-time nanny in our area per our requirements (9+ years experience) according to the care.com calculator is $12.50 an hour."}, {"url": "http://children.costhelper.com/nanny.html", "passage_text": "1 According to BabyCenter.com and our own data points, a nanny can cost between $400 - $1,000+ a week based on the local supply and demand, the local cost of living, and the qualifications you seek in a nanny. Related articles: Day Care, Baby Sitter, Preschool. 1  Costs for a nanny vary greatly by region. 2  According to BabyCenter.com and our own data points, a nanny can cost between $400 - $1,000+ a week based on the local supply and demand, the local cost of living, and the qualifications you seek in a nanny."}, {"url": "http://www.nannypoppinz.com/how-to/how-much-does-a-nanny-cost.html", "passage_text": "The average cost of a Nanny per hour will run from $12.00 to $20.00 per hour depending on family situation and Nanny qualifications. Our NO FEE Policy. Nanny Poppinz does not charge a fee of any kind UNTIL we provide you with the Nanny of your choice. The cost also varies owing to the location (state and city). In the basic case of 1 child for a short time (4 hours) salary to the Nanny will vary from minimum wage to $20 per hour."}]