[{"url": "http://thehavenportugal.com/interesting-facts", "passage_text": "Interesting Facts About Portugal. 1. The Vasco da Gama Bridge in Lisbon is the longest bridge in Europe. It measures 17,185 meters (56,381 feet). 2. PORTUGAL is the largest producer of cork in the world. 3. The oldest male porpoise living in captivity can be found at ZOOMARINE PARK IN SOUTHERN PORTUGAL. "}, {"url": "http://facts.net/portugal-facts/", "passage_text": "Lisbon Is the Capital of Portugal. The capital of the country is Lisbon, and there are many Portugal facts relating to this beautiful and cosmopolitan city. Lisbon is the westernmost capital city in continental Europe, lying on the Atlantic Ocean and the River Tagus. It has a population of approximately 552,700. When it comes to Portugal facts, Lisbon is not the only city worth mentioning. The second largest city in the country is Porto. Porto is one of the oldest cities in Europe, and is located in northern Portugal on the estuary of the Douro River, where it was once an outpost of the Roman Empire."}, {"url": "http://www.1stcontact.com/blog/social/funstuff-social/11-unusual-facts-about-portugal", "passage_text": "in Funstuff, Migration. Portugal is a country rich in history and culture, with a mild, temperate climate, excellent food and wine, and friendly, hospitable people. Here are 11 unusual facts about the country. 1  The Montado landscape of Portugal produces more than 50% of the world’s cork exports. 2  In 2008, Portugal became the first country to make it compulsory for people to have fingerprints on identity cards."}, {"url": "http://occidentalcollege-incantatotour.blogspot.com/2013/09/fun-and-interesting-facts-about-lisbon.html", "passage_text": "1 Today however, it serves as a monument to Portugal's Age of Discovery and it provides a beautiful panoramic view of the city. 2  Lisbon is also known as the town of seven hills which are compromised of the seven hills: Castelo, Graca, Monte, Penha de Franca, S.Pedro de Alcantara, Santa Catarina and Estrela. 1 In Lisbon, the streets are pretty much all black and white. 2  People say the reason for this centers around the patron Saint of Lisbon; Saint Vincent. 3  It's said that the black represents the attire worn by Saint Vincent whereas the white represents the white outfit of the Christian Crusaders who vanquished the Moors."}, {"url": "http://www.sciencekids.co.nz/sciencefacts/countries/portugal.html", "passage_text": "Lisbon is the capital and largest city of Portugal. It is the oldest city in Western Europe and one of the oldest cities in the world. Lisbon was devastated by a major earthquake in 1755. Although the city was rebuilt within a few years, the quake led to the country losing much of its wealth and status. The official name of Portugal is the Portuguese Republic. Portugal is the westernmost country of the European mainland. The country also holds sovereignty over the Atlantic archipelagos of the Azores and the Madeira Islands. Portugal has a population of over 10 million people (10,799,270) as of July 2013."}, {"url": "http://lifestyle.iloveindia.com/lounge/facts-about-portugal-1568.html", "passage_text": "1 Lisbon, the largest city in Portugal, is also the country’s capital city. 2  Parliamentary democracy is followed in Portugal. 3  Majority of the Portuguese are Roman Catholic, with a very small proportion making up Protestants and other. Facts About Portugal. Portugal is a European country, situated on the Iberian Peninsula. It stands bordered by the Atlantic Ocean in the west and south and by Spain, in the north and east."}, {"url": "http://www.sciencekids.co.nz/sciencefacts/countries/portugal.html", "passage_text": "Portugal Facts for Kids. Learn some interesting information about Portugal while enjoying a range of fun facts and trivia that's perfect for kids! The official name of Portugal is the Portuguese Republic. Portugal is the westernmost country of the European mainland. The country also holds sovereignty over the Atlantic archipelagos of the Azores and the Madeira Islands. Portugal has a population of over 10 million people (10,799,270) as of July 2013."}, {"url": "http://occidentalcollege-incantatotour.blogspot.com/2013/09/fun-and-interesting-facts-about-lisbon.html", "passage_text": "Fun and interesting facts about Lisbon, Portugal. Lisbon is full of beauty and charm. However, don't scrape the surface thinking it's just like any other place in the world. Lisbon has a list of interesting secrets as you see below: 1  In Lisbon, the streets are pretty much all black and white. 1 In Lisbon, the streets are pretty much all black and white. 2  People say the reason for this centers around the patron Saint of Lisbon; Saint Vincent. 3  It's said that the black represents the attire worn by Saint Vincent whereas the white represents the white outfit of the Christian Crusaders who vanquished the Moors."}, {"url": "http://lifestyle.iloveindia.com/lounge/facts-about-portugal-1568.html", "passage_text": "1 Portugal is the oldest country in Europe. 2  Portugal has the same defined borders since 1139, making it the oldest nation-state in Europe. 3  The official language of Portugal is Portuguese, while the official currency is Euro. 4  Lisbon, the largest city in Portugal, is also the country’s capital city. Facts About Portugal. Portugal is a European country, situated on the Iberian Peninsula. It stands bordered by the Atlantic Ocean in the west and south and by Spain, in the north and east."}]