[{"url": "http://www.innerbody.com/image_card01/card46-new2.html", "passage_text": "Deoxygenated blood enters the right atrium through three major veins: the superior and inferior vena cava and the coronary sinus. The superior vena cava returns all of the blood to the heart from tissues superior to the heart in the head, neck, arms and upper thorax."}, {"url": "http://biology.about.com/od/anatomy/ss/vena_cavae.htm", "passage_text": "The superior vena cava is located in the upper chest region and is formed by the joining of the brachiocephalic veins. It is bordered by heart structures such as the aorta and pulmonary artery."}, {"url": "http://www.cancer.net/navigating-cancer-care/side-effects/superior-vena-cava-syndrome", "passage_text": "Superior vena cava syndrome (SVCS) occurs when a person’s superior vena cava is partially blocked or compressed. The superior vena cava is a major vein in a person’s body. It carries blood from the head, neck, upper chest, and arms to the heart. Cancer is usually the main cause of SVCS."}, {"url": "http://www.answers.com/Q/Location_of_superior_vena_cava", "passage_text": "Confidence votes 390. The superior vena cava is located in the upper thoracic region. It is the main vein that drains into the right atrium of the heart. Blood returning from the brain, upper thoracic region, and arms travels through this vein to"}, {"url": "http://www.medicinenet.com/script/main/art.asp?articlekey=5974", "passage_text": "Vena cava: The superior vena cava is the large vein which returns blood to the heart from the head, neck and both upper limbs. The inferior vena cava returns blood to the heart from the lower part of the body. The return of blood via the vena cava can be compromised and cause disease."}, {"url": "http://www.medicinenet.com/superior_vena_cava_syndrome/article.htm", "passage_text": "Introduction. The superior vena cava is a large vein located in the upper chest, which collects blood from the head and arms and delivers it back to the right atrium of the heart. If this vein is compressed by outside structures, or if a thrombus or clot develops within it, return blood flow to the heart is impeded."}, {"url": "http://www.cardioconsult.com/Anatomy/", "passage_text": "The right atrium receives de-oxygenated blood from the body through the superior vena cava (head and upper body) and inferior vena cava (legs and lower torso). The sinoatrial node sends an impulse that causes the cardiac muscle tissue of the atrium to contract in a coordinated, wave-like manner."}, {"url": "http://www.medicinenet.com/superior_vena_cava_syndrome/article.htm", "passage_text": "The superior vena cava is a large vein located in the upper chest, which collects blood from the head and arms and delivers it back to the right atrium of the heart."}]