[{"url": "https://posnation.com/", "passage_text": "Finally, a POS System That Fits Your Business. Your search for the perfect POS system is over. POS Nation recognizes that retail store, restaurant, and specialty store owners need a point of sale specifically tailored to their unique businesses."}, {"url": "http://www.wisegeek.org/what-is-a-pos-system.htm", "passage_text": "In the retail trade, the “point of sale” is the moment when a customer walks up to a counter with goods and prepares to purchase them. A POS system handles the transaction, whether it takes the form of an adding machine and a hand written receipt pad or a complex computer system."}, {"url": "https://en.wikipedia.org/wiki/Point_of_sale", "passage_text": "The point of sale (POS) is the time and place where a retail transaction is completed. It is the point at which a customer makes a payment to the merchant in exchange for goods or after provision of a service."}, {"url": "http://www.wisegeek.org/what-is-a-pos-system.htm", "passage_text": "These 10 animal facts will amaze you. A Point of Sale (POS) system is a system for managing the sales of retail goods. The term is used to refer to the software and hardware associated with check out stands, and all of the bundled features which are included."}, {"url": "https://en.wikipedia.org/wiki/Point_of_sale", "passage_text": "The point of sale is often referred to as the point of service because it is not just a point of sale but also a point of return or customer order. Additionally, today POS software may include additional features to cater for different functionality, such as inventory management, CRM, financials, warehousing, etc."}, {"url": "http://www.posmatic.com/point-of-sale/what-is-point-of-sale.php", "passage_text": "And Why it is Essential for a Retail Business. POS or PoS is an abbreviation for Point of Sale (or Point-of-Sale, or Point of Service). The term is applicable to a retail shop or store, the checkout/cashier counter in the store, or a location where such transactions can occur in this type of environment."}, {"url": "http://www.uniquepos.com/What-is-Pos-System-s/17.htm", "passage_text": "A Point of Sale (POS) system is a system for managing the sales of retail goods. The term is used to refer to the software and hardware associated with check out stands, and all of the bundled features which are included."}]