[{"url": "http://acad.carleton.edu/curricular/BIOL/classes/bio302/Pages/FossilizationHome.html", "passage_text": "Fossilization. There are two major types of fossils-body fossils and trace fossils. Both are the remains of living organisms. Body fossils reveal the body structure of the organism while trace fossils reveal the activities of these organisms. The process of fossilization is called taphonomy. There are three main components. First, there is the death of the organism. Then, there are certain processes that can happen to the organism before it is buried. These processes can include body decay due to natural elements such as wind, water or attack from predators."}, {"url": "http://anthro.palomar.edu/time/time_1.htm", "passage_text": "In order for a fossil to form, the body must not be eaten or destroyed by erosion and other natural forces. Preservation would most likely occur if the organism were buried quickly and deeply. In most environments, soft body parts, such as skin, muscle, fat, and internal organs, deteriorate rapidly and leave no trace. Only very rarely do we find the casts of such tissues."}, {"url": "http://en.citizendium.org/wiki/Fossilization_%28palaeontology%29", "passage_text": "Understanding the process of fossilization, and the different means through which it can occur, is used by taphonomists, paleontologists, and geologists to understand the lives of past organisms and the ancient environments in which they lived. 1 Thus, fossilization is much more common in marine environments, which are characterized preferentially by sediment deposition rather than erosion. 2  In continental environments, fossils are most common in fluvial sediments, and rare in soils."}, {"url": "http://www.geo.arizona.edu/geo3xx/geo308/FoldersOnServer/2003/1fossil&taph&ichno.htm", "passage_text": "1 Trace fossils are often preserved in environments that are hostile to the preservation of body fossils (e.g. shallow, high energy environments, shallow marine sandstones, and deep marine shales). 1.2.2 Other types of fossils. 1  1. Trace fossils. 2  Unlike body fossils, where a portion of the actual organism or its skeleton is preserved, trace fossils are the remains of an organism's activity or behavior. 3  Examples include tracks, trails, burrows, and borings. 4  Trace fossils will be covered in detail in a later lab."}, {"url": "http://geology.teacherfriendlyguide.org/index.php/fossils-mw", "passage_text": "Examples of such exceptional preservation include fossils in concretions, such as those in the Mazon Creek deposit in Illinois. Since rapid burial in sediment is important for the formation of fossils, most fossils form in marine environments, where sediments are more likely to accumulate. The “soft” tissues of an organism, such as skin, muscles, and internal organs are typically not preserved as fossils. Exceptions to this rule occur when conditions favor rapid burial and mineralization or very slow decay."}, {"url": "http://www.creationwiki.org/Fossilization", "passage_text": "Fossilization is the process by which plant and animal remains are preserved in sedimentary rock. The Earth is covered in layers of fossils, and this record of history helps us understand what types of organisms that lived in the distant past (i.e. before the flood of Noah). The best fossilization occurs when there is rapid burial and anoxic conditions to prevent scavenging, no reworking by currents, and diagentic alteration which preserves a fossil rather than destroy it. These conditions are what is expected in models of the Flood."}, {"url": "http://en.citizendium.org/wiki/Fossilization_%28palaeontology%29", "passage_text": "Conditions for preservation. Fossils represent a very small proportion of all the organisms which have ever lived. This is because fossils only form under specific conditions. Decomposition is a requirement for environments to function, and so fossilization represents a deviation from this natural process. 1 Thus, fossilization is much more common in marine environments, which are characterized preferentially by sediment deposition rather than erosion. 2  In continental environments, fossils are most common in fluvial sediments, and rare in soils."}, {"url": "http://www.fossilmuseum.net/fossilrecord/fossilization/fossilization.htm", "passage_text": "Fossils are not only the actual remains of organisms, such as teeth, bones, shell, and leaves (body fossils), but also the results of their activity, such as burrows and foot prints (trace fossils), and organic compounds they produce by biochemical processes (chemical fossils). The definitions below explain the types of fossils found in the context of fossilization processes. You will find there is some overlaps in the terminology commonly used in paleontology and geology. Body Fossils The processes of fossilization are complex with many stages from burial to discovery as a fossil."}, {"url": "http://www.ucmp.berkeley.edu/paleo/fossilsarchive/permin.html", "passage_text": "As with almost all fossilization processes, the specific type of permineralization, silicification (because of its conditions for fossilization), tells us a much about what type of environment the organism most likely lived in. This is because specific fossil types occur in environments with certain features. One of the common types of fossils is permineralization. This occurs when the pores of the plant materials, bones, and shells are impregnated by mineral matter from the ground, lakes, or ocean. In some cases, the wood fibers and cellulose dissolve and some minerals replace them"}]