[{"url": "http://www.bhg.com/recipes/how-to/cooking-basics/how-to-cook-brisket/", "passage_text": "Bake the Brisket. 1  Place a fat-trimmed 3- to 3-1/2-pound fresh beef brisket in a 13x9x2-inch baking pan. 2  Cover the pan with foil. 3  Bake in a 325 degrees F oven about 3 hours or until tender, turning once halfway through cooking time. 1 Pour the sauce over the brisket. 2  Cover the slow cooker and cook on the low-heat setting for 12 to 14 hours. 3  Or cook on the high-heat setting for 6 to 7 hours. 4  Serve the sliced brisket with the cooking liquid."}, {"url": "http://www.bhg.com/recipes/how-to/cooking-basics/how-to-cook-brisket/", "passage_text": "Bake the Brisket. 1  Place a fat-trimmed 3- to 3-1/2-pound fresh beef brisket in a 13x9x2-inch baking pan. 2  Pour the cooking liquid over the meat. 3  Cover the pan with foil. 4  Bake in a 325 degrees F oven about 3 hours or until tender, turning once halfway through cooking time. 1 Pour the sauce over the brisket. 2  Cover the slow cooker and cook on the low-heat setting for 12 to 14 hours. 3  Or cook on the high-heat setting for 6 to 7 hours. 4  Serve the sliced brisket with the cooking liquid."}, {"url": "http://www.bhg.com/recipes/how-to/cooking-basics/how-to-cook-brisket/", "passage_text": "1 Season the brisket with ground black pepper. 2  Pour the sauce over the brisket. 3  Cover the slow cooker and cook on the low-heat setting for 12 to 14 hours. 4  Or cook on the high-heat setting for 6 to 7 hours. 1 Pour the sauce over the brisket. 2  Cover the slow cooker and cook on the low-heat setting for 12 to 14 hours. 3  Or cook on the high-heat setting for 6 to 7 hours. 4  Serve the sliced brisket with the cooking liquid."}, {"url": "http://www.smoking-meat.com/faq-how-long-to-smoke-a-brisket", "passage_text": "Q: Sir, Do you have a best guess on how long a 8-10 lbs brisket at 200-225 will take to get done. I was thinking about 1 hour per pound. Is this close. thank you! A: You can usually figure about 1.5 hours per pound at 225 degrees for brisket, pork shoulder and other larger pieces of meat. Several things can affect this time such as wind, temperature and how often you open the door of the smoker. "}, {"url": "http://startcooking.com/how-to-cook-corned-beef-brisket", "passage_text": "Corn beef brisket requires long, slow, moist cooking, either on the stove top or in the oven. (How to Cook Like Your Grandmother has an excellent photo-tutorial on cooking corned beef in the oven.) I’ll show you the stove-top version. Set the brisket in a large heavy pot with a lid. Cover the brisket with water. Brisket is the name of a particular “cut” of beef, which tells you what part of the cow it came from. Corned Beef is is a cut of meat (brisket) that has been cured (or pickled) in a seasoned brine. For this recipe you will need to purchase a corned beef brisket."}, {"url": "http://www.bhg.com/recipes/how-to/cooking-basics/how-to-cook-brisket/", "passage_text": "1 Place a fat-trimmed 3- to 3-1/2-pound fresh beef brisket in a 13x9x2-inch baking pan. 2  Pour the cooking liquid over the meat. 3  Cover the pan with foil. 4  Bake in a 325 degrees F oven about 3 hours or until tender, turning once halfway through cooking time. 1 Pour the sauce over the brisket. 2  Cover the slow cooker and cook on the low-heat setting for 12 to 14 hours. 3  Or cook on the high-heat setting for 6 to 7 hours. 4  Serve the sliced brisket with the cooking liquid."}, {"url": "http://startcooking.com/how-to-cook-corned-beef-brisket", "passage_text": "Sean Carr, a 20 year old civil engineering student at Northeastern University, cooks his corn beef brisket in a covered roasting pan with 2 inches of water at 325 degrees for 5-5.5 hours. If you are cooking several briskets for a party, this is actually a very clever way to do it. Brisket is the name of a particular “cut” of beef, which tells you what part of the cow it came from. Corned Beef is is a cut of meat (brisket) that has been cured (or pickled) in a seasoned brine. For this recipe you will need to purchase a corned beef brisket."}, {"url": "http://www.wikihow.com/Cook-a-Brisket-in-the-Oven", "passage_text": "The beef brisket should be roasted for roughly 1 hour per l lb (450 g) of meat. In this case, the brisket should cook for 3 to 4 hours. 1  Do not unwrap the brisket during the cooking process unless you are checking for doneness. 1 Check the internal temperature of the brisket with a meat thermometer. 2  The temperature should be between 190 and 200 degrees Fahrenheit (88 to 93 degrees Celsius) when safe and tender enough to eat, and the meat should be easy to pull apart."}, {"url": "http://www.chowhound.com/post/long-cook-brisket-755286", "passage_text": "I have a 6lb beef brisket to serve for Christmas dinner - 11 people. How long should I cook the brisket? I've done smaller ones that took about 2 hrs., but never anything this size. I don't want to do it too long and have it dried out. "}]