[{"url": "http://www.songfacts.com/detail.php?id=2012", "passage_text": "When Prince takes the stage, he introduces Purple Rain as being written by Wendy and Lisa, then tears down the house with it. Wendy and Lisa were real members of Prince's band until 1987 when they left to record as a duo."}, {"url": "http://www.nme.com/blogs/nme-blogs/20-things-you-didnt-know-about-purple-rain", "passage_text": "The film would come out a month later and quickly become a cult classic and must-see for Prince fans. Nestled in the soundtrack was, of course, the title track opus ‘Purple Rain’ itself. Eight minutes of slow-burn, red-hot emo joy. Here are 20 things you might not know about the unholy triptych. 1 Prince initially asked Stevie Nicks to write lyrics for 'Purple Rain'. It was so overwhelming, that 10-minute track..."}, {"url": "http://prince.org/msg/7/365629", "passage_text": "prince originally wrote purple rain for stevie nicks. http://www.startribune.co...=2&c=y. This summer, Stevie Nicks was invited to sing on TV's America's Got Talent and The Voice.. This month, she joined Jeff Bridges and John Fogerty at a benefit for wounded soldiers in Sturgis, S.D."}, {"url": "https://en.wikipedia.org/wiki/Purple_Rain_(album)", "passage_text": "Purple Rain is the sixth studio album by American recording artist Prince and The Revolution and is the soundtrack album to the 1984 film of the same name. It was released on June 25, 1984 by Warner Bros. Records. Purple Rain is regularly ranked among the best albums in music history."}, {"url": "http://www.last.fm/music/Prince+&+The+Revolution/_/Purple+Rain", "passage_text": "+52 other releases. read more. Purple Rain is a power ballad by Prince and the The Revolution. It was his third US single (second UK) and title track from the 1984 album of the same name, which in turn was the soundtrack album for the 1984 film of the same name. The song is an emotional combination of rock and roll, pop and gospel music."}, {"url": "https://en.wikipedia.org/wiki/Purple_Rain_%28song%29", "passage_text": "Purple Rain  is a song by Prince and The Revolution. It is the title track from the 1984 album of the same name, which in turn is the soundtrack album for the 1984 film of the same name, and was released as the third single from that album. The song is a combination of rock, pop, gospel, and orchestral music."}]