[{"url": "http://www.tssurgeryguide.com/transgender-orchiectomy.html", "passage_text": "An orchiectomy (spelled orchidectomy in British English), is the medical term for the surgical procedure to remove one or more of the testicles. A bilateral orchiectomy is the removal of both testicles and is commonly referred to as castration. An orchiectomy doesn't remove the penis, which would be a penectomy. The most common reason for an orchiectomy is as a treatment for testicular cancer. If only one testicle is found to be cancerous then only that one is removed. Even if both testicles are removed, male sexual function can be restored and maintained through the use of testosterone injections or patches."}, {"url": "http://www.bcmj.org/letters/surgical-orchiectomy-time-revisit", "passage_text": "Additionally, there would be considerable cost savings to the taxpayer. The fee for bilateral orchiectomy is $139, the anesthetic fee is $75, and the daycare hospital charge is $540, for a one-time cost of $754. The annual cost per patient for LHRHa is about $5000."}, {"url": "http://www.annierichards.com/orchidectomy.htm", "passage_text": "Cost. To some women, one of the great advantages of Orchiectomy compared with SRS is the much lower cost. SRS can cost anything from $8000 to over $20,000 for a top class surgeon (and sadly, you often get what you pay for). The other does not wish to have SRS. Cost To some women, one of the great advantages of Orchiectomy compared with SRS is the much lower cost. SRS can cost anything from $8000 to over $20,000 for a top class surgeon (and sadly, you often get what you pay for)."}, {"url": "http://www.howmuchisit.org/orchiectomy-cost/", "passage_text": "1 On the other hand, in Mexico, Costa Rica, and Colombia, the cost of the same surgery is less than $1,000. 2  Someone answered the question at a forum on answers.yahoo.com saying that orchiectomy can cost around $2,000 to $ 3,000 in Florida. 3  Srsmiami.com, for example, charges $2,500 for an orchiectomy procedure. How much does it cost? 1  According to many sources online, an orchiectomy is going to cost anywhere from as little as $2,200 to as much as $5,000 without any sort of insurance."}, {"url": "http://www.webmd.com/cancer/radical-inguinal-orchiectomy-for-testicular-cancer", "passage_text": "The testicles are the male sex organs that produce sperm and the male hormone, testosterone. An orchiectomy is a common treatment for testicular cancer. It may also be done to treat other conditions such as prostate cancer or in the event of severe trauma to one or both testes. When this surgery is done for testicular cancer, it is called a radical inguinal orchiectomy"}, {"url": "http://www.medsolution.com/surgery_urogen-orchiectomy.asp", "passage_text": "Orchiectomy, also known as Orchidectomy or Castration is a surgical procedure to remove one or both testicles in men. Testicles are sex organs in the males that produce sperms and testosterone (a hormone). Orchiectomy will make you sterile (infertile) and may reduce your sex drive due to loss of testosterone. Cost of procedure performed in the US: $4,000 to $7,000."}, {"url": "http://www.howmuchisit.org/orchiectomy-cost/", "passage_text": "1 Surgeryoverseas.com supplied varying approximate costs of orchiectomy according to country. 2  For example, in the United States, the procedure could cost anywhere from $3,000 to $5,000. How much does it cost? 1  According to many sources online, an orchiectomy is going to cost anywhere from as little as $2,200 to as much as $5,000 without any sort of insurance."}, {"url": "http://www.howmuchisit.org/orchiectomy-cost/", "passage_text": "1 According to many sources online, an orchiectomy is going to cost anywhere from as little as $2,200 to as much as $5,000 without any sort of insurance. 2  If the patient has health insurance, most providers will cover the bill as long as it is deemed medically necessary. How much does it cost? 1  According to many sources online, an orchiectomy is going to cost anywhere from as little as $2,200 to as much as $5,000 without any sort of insurance."}]