[{"url": "http://www2.estrellamountain.edu/faculty/farabee/biobk/BioBookPLANTHORM.html", "passage_text": "Auxins promote stem elongation, inhibit growth of lateral buds (maintains apical dominance). They are produced in the stem, buds, and root tips. Example: Indole Acetic Acid (IA). Auxin is a plant hormone produced in the stem tip that promotes cell elongation. Auxin moves to the darker side of the plant, causing the cells there to grow larger than corresponding cells on the lighter side of the plant."}, {"url": "http://study.com/academy/lesson/plant-hormones-chemical-control-of-growth-and-reproduction.html", "passage_text": "Gibberellins are hormones produced in meristems of stems and roots that help regulate stem elongation. Dwarf plants often do not contain much of this hormone and are therefore shorter than normal. Ethylene is a chemical produced in fruits, flowers and aging leaves that promotes fruit ripening. Hormones in plants act in similar ways. They are produced by cells in one area of the plant-such as the leaves, stems or root-and then transported to a different area of the plant in order to produce a response."}, {"url": "http://www.canna-uk.com/plant_hormones", "passage_text": "Auxin is a hormone that is produced in the plant’s growing tips both above ground and in the roots. It influences water absorption, cell division and cell stretching (it softens cell walls), among other things. Because auxin promotes the formation of roots on stems it is used in a variety of forms in rooting hormones. Hormones play an important role in the growth and flowering of the plant, among other things. This article explains briefly how plant hormones work and how they ensure that plants grow and flower. Hormones are produced by and transported around the entire plant."}, {"url": "http://www.ext.colostate.edu/mg/gardennotes/145.html", "passage_text": "Plant Hormones and Plant Growth Regulators. Another factor in plant growth is the influence of plant hormones. Hormones are chemicals produced by plants that regulate the growth processes. Plant growth regulators are chemicals applied by a horticulturist to regulate plant growth. Figure 4. Geotropism – Under the influence of gravity, auxins accumulate in the lower side of a horizontal stem, causing cells to enlarge faster, turning the stem upright. Figure 5. Phototropism The auxin concentration on the shaded side stimulates cell elongation, turning the stem to the sun."}, {"url": "http://www.biologyreference.com/Ho-La/Hormones-Plant.html", "passage_text": "Hormones, Plant. Photo by: Claude Calcagno. Plant hormones are chemical messengers that are produced in one part of the plant and have a physiological effect on a target tissue that may be distant from the site of production. "}, {"url": "https://www.ndsu.edu/pubweb/chiwonlee/plsc211/student%20papers/articles00/mplace/mplace.htm", "passage_text": "Auxin: The Functions, Effects, and Applications of a Plant Growth Hormone By Michael Place. Auxin is the first and most studied plant growth hormone in horticultural study. For the professor or student of a plant science, auxin is a readily accepted term that can be placed to many biological plant functions. Answer: Auxin is a plant growth hormone that can be created chemically or produced biologically by the plant. In biological synthesis, the natural hormone is represented by the symbol IAA, standing for indoleacetic acid."}, {"url": "https://en.wikipedia.org/wiki/Plant_hormone", "passage_text": "Plant hormones (also known as phytohormones) are chemicals that regulate plant growth, which, in the UK, are termed 'plant growth substances'. The word hormone is derived from Greek, meaning set in motion. Plant hormones affect gene expression and transcription levels, cellular division, and growth. They are naturally produced within plants, though very similar chemicals are produced by fungi and bacteria that can also affect plant growth."}, {"url": "http://www.canna-uk.com/plant_hormones", "passage_text": "Hormones are organic molecules that can influence the physiology of plants and animals, even at low concentrations. Hormones play an important role in the growth and flowering of the plant, among other things. This article explains briefly how plant hormones work and how they ensure that plants grow and flower. Hormones are produced by and transported around the entire plant. Put simply, hormones are like signals that can be sent and received throughout the entire plant. So a leaf can transmit a signal to the end of the stem telling it to form flowers for example"}, {"url": "https://en.wikipedia.org/wiki/Plant_hormone", "passage_text": "Plants, unlike animals, lack glands that produce and secrete hormones. Instead, each cell is capable of producing hormones. Plant hormones shape the plant, affecting seed growth, time of flowering, the sex of flowers, senescence of leaves, and fruits. They affect which tissues grow upward and which grow downward, leaf formation and stem growth, fruit development and ripening, plant longevity, and even plant death. The word hormone is derived from Greek, meaning set in motion. Plant hormones affect gene expression and transcription levels, cellular division, and growth. They are naturally produced within plants, though very similar chemicals are produced by fungi and bacteria that can also affect plant growth."}]