[{"url": "https://en.wikipedia.org/wiki/Daylight_saving_time", "passage_text": "Daylight saving time (DST) or summer time is the practice of advancing clocks during summer months by one hour so that in the evening daylight is experienced an hour longer, while sacrificing normal sunrise times. New Zealander George Hudson proposed the modern idea of daylight saving in 1895. Germany and Austria-Hungary organized the first implementation, starting on 30 April 1916. Many countries have used it at various times since then, particularly since the energy crisis of the 1970s."}, {"url": "http://www.webexhibits.org/daylightsaving/e.html", "passage_text": "The Federal law was amended in 1986 to begin Daylight Saving Time on the first Sunday in April. Under legislation enacted in 1986, Daylight Saving Time in the U.S. began at 2:00 a.m. on the first Sunday of April and ended at 2:00 a.m. on the last Sunday of October. In 1917, Australia and Newfoundland began saving daylight. The plan was not formally adopted in the U.S. until 1918. ' An Act to preserve daylight and provide standard time for the United States ' was enacted on March 19, 1918. [See law] It both established standard time zones and set summer DST to begin on March 31, 1918. Daylight Saving Time was observed for seven months in 1918 and 1919"}, {"url": "http://aa.usno.navy.mil/faq/docs/daylight_time.php", "passage_text": "As of 2007, daylight time begins in the United States on the second Sunday in March and ends on the first Sunday in November. On the second Sunday in March, clocks are set ahead one hour at 2:00 a.m. local standard time (which becomes 3:00 a.m. local daylight time). On the first Sunday in November, clocks are set back one hour at 2:00 a.m. local daylight time (which becomes 1:00 a.m. local standard time). These dates were established by Congress in the Energy Policy Act of 2005, Pub. L. no. 109-58, 119 Stat 594 (2005) . Beginning in 2007, daylight time starts on the second Sunday in March and ends on the first Sunday in November. For a very readable account of the history of standard and daylight time in the U.S., see. Ian R. Bartky and Elizabeth Harrison: Standard and Daylight-saving Time, , May 1979 (Vol. 240, No. 5), pp. 46-53."}, {"url": "http://www.infoplease.com/askeds/daylight-saving-time.html", "passage_text": "The Answer: The first national observance of Daylight Saving Time in the United States was in 1918, to save energy during World War I. This lasted seven months before being repealed. A similar, year-round, national observance went into effect in World War II, starting February 9, 1942, and ending September 30, 1945. Beginning in 2007, the observance starts on the second Sunday in March and ends in the first Sunday in November, adding an additional month. For more on Daylight Saving Time around the world, click here."}, {"url": "http://geography.about.com/cs/daylightsavings/a/dst.htm", "passage_text": "At 2 a.m. on the second Sunday in March, we set our clocks forward one hour ahead of Standard Time (Spring forward, even though Spring doesn't begin until late March, over a week after the start of Daylight Saving Time). By Matt Rosenberg. Daylight Saving Time began on Sunday, March 8, 2015 at 2 a.m and will end on Sunday, November 1, 2015 at 2 a.m."}, {"url": "https://en.wikipedia.org/wiki/Daylight_saving_time_in_Australia", "passage_text": "The choice of whether to use daylight saving time (DST) in Australia is a matter for the individual states and territories. However, during World War I and World War II all states and territories had daylight saving. In 1968 Tasmania became the first state since the war to practise daylight saving. "}, {"url": "http://www.timeanddate.com/time/dst/", "passage_text": "Daylight Saving Time (DST) is the practice of setting the clocks forward one hour from Standard Time during the summer months, and back again in the fall, in order to make better use of natural daylight. The sculpture Six Public Clocks by Konstantin Grcic. US inventor and politician Benjamin Franklin first proposed the concept of DST in 1784, but modern Daylight Saving Time first saw the light of day, in 1895 when an entomologist from New Zealand, George Vernon Hudson, presented a proposal for a two-hour daylight saving shift."}]