[{"url": "http://www.pitstop.co.nz/Extractors", "passage_text": "1 • Extractors replace standard exhaust manifolds, providing your vehicle with more power, and more economy. • 2  Typical power increases of 5-15% are common, with even more horsepower increase possible by also fitting a larger bore, free flowing exhaust system. "}, {"url": "http://www.autogeek.net/carpet-hot-water-extractors.html", "passage_text": "To get carpets and upholstery truly clean, you need a professional carpet hot water extractor. Carpet extractors, also called carpet shampooers, are an auto detailing essential, especially for anyone in the business of detailing. These carpet cleaning machines break up tough greasy stains using the power of hot water and eliminate the mess with powerful suction. There's one to suit your interior detailing needs. Clean, spot-free carpet, rugs, and upholstery are a sign of a great detailer. Impress your clients and keep them coming back with a professional hot water carpet extractor. You too can get results like this with your own hot water carpet extractor!"}, {"url": "http://www.rightlook.com/heated-hot-water-carpet-extractor.html", "passage_text": "Get your professional auto detailing carpet extractors from the auto detailing pros at Rightlook.com. We’ll help you select exactly the right carpet extractor system for your professional style—whether full-service detailing shop or mobile auto detailer. Use professional equipment if you want professional results! In addition to our great selection of car extractors, we offer professional-grade accessories that let you clean every nook and cranny of any vehicle. Order your hot-cater carpet extractor today and watch your interior-detailing business clean up year after year! Click here to view all extractors and accessories."}, {"url": "http://www.detailplus.com/auto-detailing/equipment/soil-extractors.htm", "passage_text": "There are four models available, offering the auto detailing choices based on budget or cleaning requirements. DETAIL PLUS Extractors offer both in-line heaters and tank heaters and a choice of pumps from 60 PSI to 150 PSI, and 2 or 3-stage vacuum motors. Whatever the cleaning need, or budget, DETAIL PLUS Soil Extractors can satisfy your requirements and need"}, {"url": "https://www.sunbeltrentals.com/equipment/items/1022/carpet-extractors/", "passage_text": "Carpet Extractors provide quick, efficient cleaning of carpeted areas, upholstery, and fabric covered surfaces, utilizing solution sprayers, scrub brushes, and powerful wet vacuums to achieve fast, professional results. 1 1/2 Gallon Carpet Extractor. "}, {"url": "http://www.medcarelifts.com/car-extractor.php", "passage_text": "Car Extractor Lifts. The Medcare Car Extractor Lift was created to safely lift and move patients into and out of nearly any vehicle, from a compact automobile to a fire/emergency van. Like all of Medcare's patient lifts, the car extractor lift is engineered and manufactured in the United States. We guarantee 24-hour parts delivery as well as complete customer support. Your patients and staff can expect the best service and support, because that's what we provide."}, {"url": "http://www.youtube.com/watch?v=AyvDLUPrCjY", "passage_text": "To throughly detail a car, carpet extractors are the best way to get upholstery clean. Find out more about carpet extractors with tips from the owner of a car detail shop in this free video about how to detail a car. Expert: Dowell Jones. "}, {"url": "http://www.youtube.com/watch?v=rT86aCFUDUc", "passage_text": "Please try again later. Critical Details offers a wide range of auto detailing services from the basic wash and wax all the way up to a multiple step paint correction. Whether your vehicle is a daily driver or a show car Critical Details can rejuvenate your vehicle to its original showroom condition"}]