[{"url": "http://www.answers.com/Q/Subunit_of_carbohydrate", "passage_text": "Carbohydrates are made up of glucose subunits. In complex carbohydrates long polymer chains of glucose subunits form the higher structure, they can be nibbled from either e … nd by digestion enzymes. The breakdown into glucose is needed for metabolism. Sugar units are called saccharides in chemistry. Starch and cellulose are polysaccharides made from glucose."}, {"url": "https://answers.yahoo.com/question/index?qid=20100906111420AAKA4hp", "passage_text": "Lipids are a glycerol molecule which has three alcohol/hydroxide groups on it, this makes it able to form three ester bonds with three carboxylic acid/fatty acid molecules, this is the basic structure of a fat/lipid molecule. It also makes them useful for enzymes, because without enzymes you wouldn't be reading this text, and I would never have written it, they make chemical reactions possible at temperatures that in the lab simply are not possible. There is a lot of info on the internet about proteins you should have a look."}, {"url": "https://answers.yahoo.com/question/index?qid=20110921190157AAfHwuj", "passage_text": "· just now. Report Abuse. I think the Monomer subunit of carbohydrate is monosacharide.It contain only only sugar molecule. Monosacharides are categorized as triose,tetrose,pentose,hexose. according to the number of carbon atoms availability. if the monosacharide contain, 3 carbon-triose-eg. Glyceralthehyde 4 carbon-tetrose-eg.erythrose 5 carbon-pentose-eg. ribose,rebulose 6 carbon-hexose-eg. glucose,fructose,galactose."}, {"url": "http://www.answers.com/Q/What_are_the_subunits_of_lipids_carbohydrates_proteins_and_nucleic_acids", "passage_text": "Amino acids combine in the synthesis of the polypeptide chains that make up proteins. Glycerol (a trihydric alcohol) and three fatty acids combine to form a lipid. Monosaccharides combine to form polysaccharides (complex carbohydrates). Nucleotides combine to form a strand of a nucleic acid. Split and merge into it. Answered by The Community. Making the world better, one answer at a time. lipids do not have monomers, they are made of fatty acid chains and a glycerol molecule, unless it is a phospholipid, they are made of fatty acids and a phosphate head."}, {"url": "https://quizlet.com/8909254/biology-unit-32-carbohydrates-lipids-and-proteins-flash-cards/", "passage_text": "Many glucose subunits can be linked differently to form Starch (storage in plant cells), cellulose (plant cell wall) and glycogen (storage in animal cells).   . Used in energy storage, heat insulation, buoyancy, cell membranes, steroid hormones, protection (e.g kidneys), and waterproofing in plants and insects. "}, {"url": "http://www.answers.com/Q/Subunit_of_carbohydrate", "passage_text": "The subunit of carbohydrates is glucose.The subunit of  nucleic acids is a nucleotide. The sub unit for protein is  an amino acid. Lipid sub units are fatty acids and  gylc … erol. In complex carbohydrates long polymer chains of glucose subunits form the higher structure, they can be nibbled from either e … nd by digestion enzymes. The breakdown into glucose is needed for metabolism. Sugar units are called saccharides in chemistry. Starch and cellulose are polysaccharides made from glucose."}, {"url": "https://answers.yahoo.com/question/index?qid=20110921190157AAfHwuj", "passage_text": "Monomer-Monosaccharide ex: glucose, fructose, galactose Polymers-disaccharides and polysaccharides Two monosaccharides joined by glycosidic linkage are disaccharides. Monosacharides are categorized as triose,tetrose,pentose,hexose. according to the number of carbon atoms availability. if the monosacharide contain, 3 carbon-triose-eg. Glyceralthehyde 4 carbon-tetrose-eg.erythrose 5 carbon-pentose-eg. ribose,rebulose 6 carbon-hexose-eg. glucose,fructose,galactose."}, {"url": "https://en.wikipedia.org/wiki/Polysaccharide", "passage_text": "Starch (a polymer of glucose) is used as a storage polysaccharide in plants, being found in the form of both amylose and the branched amylopectin. In animals, the structurally similar glucose polymer is the more densely branched glycogen, sometimes called 'animal starch'. Examples include storage polysaccharides such as starch and glycogen, and structural polysaccharides such as cellulose and chitin. Polysaccharides are often quite heterogeneous, containing slight modifications of the repeating unit."}, {"url": "http://www.austincc.edu/biology/assessment/pdf/Module2_Macromolecules.pdf", "passage_text": "Carbohydrates  Made mostly of carbon, hydrogen and oxygen  Small carbohydrates are called monosaccharides, single or simple sugars.  Most common monosaccharide is glucose: C 6 H 12 O 6  In cells, glucose looks like: C 6 C5 C4 C1. Summary of Proteins  Subunits are amino acids  Amino acids are joined by condensation reactions that form peptide bonds  The amino acid sequence is a protein’s primary structure."}]