[{"url": "http://homeguides.sfgate.com/long-should-furnace-air-conditioning-unit-last-92434.html", "passage_text": "Central Air Conditioners. Central air conditioners typically last from 10 to 15 years. The lifespan of a central cooling unit may be reduced if its capacity is not properly matched to the cooling load of the home. New air conditioning and heating equipment lasts longer than ever. The end of a furnace's or air conditioner’s service life depends on more than just chronological age. Energy-efficiency issues and the price of any necessary repairs versus the cost of upgrading to a new unit all enter into that determination."}, {"url": "http://www.youtube.com/watch?v=SaHh28TBMZM", "passage_text": "Please try again later. Home air conditioners should last for up to 30 years, though improper installation can reduce the lifespan of a unit. Discover the factors that affect the lifespan of an central air conditioner with help from an AC technician in this free video on heating and cooling the home. Expert: Airworx Utah."}, {"url": "http://www.doityourself.com/stry/how-long-should-home-air-conditioners-last", "passage_text": "Usage. An average air conditioner will last around 20 years with the proper maintenance. However, units that get heavy usage may not live this long. If you live in an area with high humidity, or average summer temperatures above 90 degrees, the lifetime of your unit can be cut by almost half. Just because the air conditioner itself will last 20 years, this doesn't mean that all the parts will last this long. Evaporation coils, scroll compressors, and air handlers can go out much earlier. As long as this is caught in time, these parts can be replaced without having to replace the entire unit"}, {"url": "http://www.ehow.com/video_7524724_long-home-air-conditioners-last_.html", "passage_text": "Cancel. Home air conditioners should last for up to 30 years, though improper installation can reduce the lifespan of a unit. Discover the factors that affect the lifespan of an central air conditioner with help from an AC technician in this free video on heating and cooling the home. "}, {"url": "http://www.michaelbonsbyhvac.com/how-long-do-air-conditioners-last", "passage_text": "The Average Air Conditioner Lifespan. The average air conditioner lifespan is around 15-20 years, according to the U.S. Department of Energy. While there is no way you can guarantee that your unit will last forever, there ARE a number of things that you can do to make sure it lasts as long as possible. 1  Keep up on maintenance"}, {"url": "http://whisperairhvac.com/how-long-does-a-central-air-conditioner-last/", "passage_text": "Categories: Buying Central A/C. There are many factors that affect how long a central air conditioner will last. According to ASHRAE, an HVAC industry organization, a central air conditioning system can last on average 15 years. "}, {"url": "http://homeguides.sfgate.com/long-should-furnace-air-conditioning-unit-last-92434.html", "passage_text": "Furnace Lifespan. The average service life of a new furnace is 15 to 20 years. Most furnace parts that fail during that span are replaceable at a cost that makes repair a better call than replacing the entire furnace. The exception is the heat exchanger, a furnace's single most expensive component. New air conditioning and heating equipment lasts longer than ever. The end of a furnace's or air conditioner’s service life depends on more than just chronological age. Energy-efficiency issues and the price of any necessary repairs versus the cost of upgrading to a new unit all enter into that determination."}, {"url": "http://floridabryantdealers.com/tips/air-conditioning/south-florida-bryant-how-long-do-air-conditioners-last", "passage_text": "Like any homeowner, you'd probably like your air conditioner to last for a very long time. After all, a decent unit represents a sizeable investment. When you consider the important role that an air conditioner plays in the indoor comfort of your home, however, the cost is well worth it. How to Make Your Air Conditioner Last Longer. Air conditioners last longer when homeowners are conscientious about taking care of them. Unfortunately, many people do little more than switch them on at the beginning of the summer and switch them off at the onset of winter."}, {"url": "http://floridabryantdealers.com/tips/air-conditioning/south-florida-bryant-how-long-do-air-conditioners-last", "passage_text": "The average lifespan for an air conditioner is 10 to 15 years. Some air conditioners last up to 20 years. As interesting as these data points may be, they don't tell you the whole story. The issue is that a variety of factors affect the lifespan of an air conditioner. When you buy a new A/C unit, you may be given a rough estimate about how long it will last. How to Make Your Air Conditioner Last Longer. Air conditioners last longer when homeowners are conscientious about taking care of them. Unfortunately, many people do little more than switch them on at the beginning of the summer and switch them off at the onset of winter."}]