[{"url": "http://www.answers.com/Q/What_does_sedimentary_rock_look_like", "passage_text": "The layers of a sedimentary rock are like a sandwich because the  sediments are compacted together to form something similar to a  sandwich."}, {"url": "http://geology.about.com/cs/basics_roxmin/a/aa011804b.htm", "passage_text": "In these conditions the sediment is cemented into rock: sand becomes sandstone and clay becomes shale. If gravel or pebbles are part of the sediment, the rock that forms is conglomerate. If the rock is broken and recemented together it is called breccia. See examples of all these in the Sedimentary Rock Index."}, {"url": "http://www.answers.com/Q/What_does_sedimentary_rock_look_like", "passage_text": "A sugar cube looks like a sedimentary rock because, it has small  and tiny particals such as those tiny crystals you see in a sugar  cube. A sedimentary rock on the other ha … nd, is composed of small  sediments, like a sugar cube is composed of small particals and  crystals. 2 people found this useful."}, {"url": "https://www.irvmat.com/kids/whatIsLimestone.htm", "passage_text": "Limestone is a sedimentary rock, which means it was formed from small particles of rock or stone that have been compacted by pressure. Sedimentary rock is important because it often contains fossils and gives clues about what type of rock was on the Earth long ago."}, {"url": "http://geology.about.com/cs/basics_roxmin/a/aa011804c.htm", "passage_text": "By Andrew Alden. Metamorphic rocks are the third great class of rocks. These are what happens when sedimentary and igneous rocks become changed, or metamorphosed (changed in form), by conditions underground. The four main agents that metamorphose rocks are heat, pressure, fluids and strain."}, {"url": "https://www.irvmat.com/kids/whatIsLimestone.htm", "passage_text": "What is Limestone. Limestone is a sedimentary rock, which means it was formed from small particles of rock or stone that have been compacted by pressure. Sedimentary rock is important because it often contains fossils and gives clues about what type of rock was on the Earth long ago."}, {"url": "http://www.answers.com/Q/What_do_Sedimentary_Rocks_look_like", "passage_text": "A sugar cube looks like a sedimentary rock because, it has small  and tiny particals such as those tiny crystals you see in a sugar  cube. A sedimentary rock on the other ha … nd, is composed of small  sediments, like a sugar cube is composed of small particals and  crystals."}]