[{"url": "https://en.wikipedia.org/wiki/Android_(operating_system)", "passage_text": "Variants of Android are also used on notebooks, game consoles, digital cameras, and other electronics. As of 2015, Android has the largest installed base of all operating systems. It is the second most commonly used mobile operating system in the United States, while iOS is the first. Android's kernel is based on one of the Linux kernel 's long-term support (LTS) branches. Since April 2014, Android devices mainly use versions 3.4 or 3.10 of the Linux kernel."}, {"url": "https://en.wikipedia.org/wiki/Android_(operating_system)", "passage_text": "Initially developed by Android, Inc., which Google bought in 2005, Android was unveiled in 2007, along with the founding of the Open Handset Alliance – a consortium of hardware, software, and telecommunication companies devoted to advancing open standards for mobile devices. Android's kernel is based on one of the Linux kernel 's long-term support (LTS) branches. Since April 2014, Android devices mainly use versions 3.4 or 3.10 of the Linux kernel."}, {"url": "http://www.wikihow.com/Use-an-Android-Tablet", "passage_text": "Check the version of Android your tablet is running on. Different tablets run on different versions of the Android OS. The Android version can be found in the About Tablet section of the settings panel. 1  Most tablets run on Android Ice Cream Sandwich (4.0) or higher. 2  Some older tablets run on Android Honeycomb (3.x). 3  The OS version gives a brief idea of the features packed in a tablet. It can also be used as a camera or camcorder. However, an Android tablet is a bit different from an Android phone. Not only is the form-factor different, the user-interface is different too."}, {"url": "http://www.techradar.com/news/phone-and-communications/mobile-phones/what-is-android-a-beginner-s-guide-975482", "passage_text": "Android is open source, meaning that manufacturers don't have to pay Google to use it, and that they're free to modify it. This means that it's used in a wide range of hardware varying in price from small budget phones to large-screen high-end handsets. Android's standard layout is to have a series of Home screens, which can contain shortcuts to launch apps, or can contain widgets, which are small programs that serve a single function, such as controlling your music or displaying Facebook updates."}, {"url": "http://www.wikihow.com/Use-an-Android-Tablet", "passage_text": "How to Use an Android Tablet. Android tablets are digital slates running the Android operating system. They can be used for multiple purposes like: checking e-mails, playing games, watching videos, and listening to music. It can also be used as a camera or camcorder. However, an Android tablet is a bit different from an Android phone. Not only is the form-factor different, the user-interface is different too."}, {"url": "http://google.about.com/od/socialtoolsfromgoogle/p/android_what_is.htm", "passage_text": "Introduction: Android is a Linux-based mobile phone operating system developed by Google. Android is unique because Google is actively developing the platform but giving a portion of it away for free to hardware manufacturers and phone carriers who want to use Android on their devices. Google only charges manufacturers if they also install the Google apps portion of the OS. To use Android on a phone, you generally need a data plan on top of your voice plan. Some networks in the US offer tiered data service, and some offer unlimited plans. Google Services: Because Google developed Android, it comes with a lot of Google app services installed right out of the box."}, {"url": "https://en.wikipedia.org/wiki/Android_(operating_system)", "passage_text": "Android is a mobile operating system (OS) currently developed by Google, based on the Linux kernel and designed primarily for touchscreen mobile devices such as smartphones and tablets. Android's kernel is based on one of the Linux kernel 's long-term support (LTS) branches. Since April 2014, Android devices mainly use versions 3.4 or 3.10 of the Linux kernel."}, {"url": "http://www.androidcentral.com/what-android", "passage_text": "You might have dabbled with this type of Android if you have used custom ROMs. Many third-party developers have taken AOSP and built it as-is for popular phones and tablets. It's pretty bare-bones, but does have everything you need to power and use a smartphone. Or possibly a robot. Google maintains an open-source operating system named Android. It's got all the low-level stuff as well as the needed middleware to power and use an electronic device, and it is freely given away to anyone who wants to grab the code and build the operating system from it."}, {"url": "http://www.androidcentral.com/what-android", "passage_text": "Android means a few different things — but in the end it's all good! You see the word Android used a lot on the Internet, and it gets used interchangeably for a few different things. I'm not even talking about robots (though some Androids could be running on Android), I'm talking about the mobile platform we all love. Google maintains an open-source operating system named Android. It's got all the low-level stuff as well as the needed middleware to power and use an electronic device, and it is freely given away to anyone who wants to grab the code and build the operating system from it."}]