[{"url": "http://divorcesupport.about.com/od/financialissues/f/costofdivorce.htm", "passage_text": "How much will a divorce cost? The average cost of divorce in the United States is $15,000. The good news is that the cost of a divorce can be managed just as you manage a household budget."}, {"url": "http://info.legalzoom.com/average-cost-divorce-20103.html", "passage_text": "Legal Fees. In a divorce, both spouses will generally have lawyers. Attorney fees vary widely depending on the area, the individual attorney, the number of contested issues and the length of the trial. According to Divorce Court Attorneys, a two day divorce trial can cost as much as $25,000 in legal fees alone."}, {"url": "http://www.womansdivorce.com/cost-of-a-divorce.html", "passage_text": "The average cost of a divorce can range from between $1500 for an uncontested divorce to over $15,000 for a contested divorce. If you are like most people, you want to end your marriage as cost-effectively as possible."}, {"url": "http://www.forbes.com/2006/11/07/divorce-costs-legal-biz-cx_lh_1107legaldivorce.html", "passage_text": "Divorce proceedings can range anywhere from several hundred to several thousand dollars. Estimates on the average cost of a divorce in the U.S. range from $15,000 to $30,000."}, {"url": "http://info.legalzoom.com/average-cost-uncontested-divorce-20665.html", "passage_text": "Whether you handle your divorce yourself or hire an attorney, there will be extra costs. State courts charge a filing fee for a divorce petition, usually in the neighborhood of $200. If you use a sheriff or private process server to deliver your petition to your spouse, this will cost an additional $35 to $100. In most states, you can bypass this expense if you’re on amicable terms with your spouse."}, {"url": "http://info.legalzoom.com/average-cost-divorce-20103.html", "passage_text": "According to a 2006 article on Forbes.com, divorce proceedings can range from a few hundred to many thousands of dollars, with the average cost of a contested divorce ranging from $15,000 to $30,000. Most of this money is spent on legal fees."}]