[{"url": "http://www.answers.com/Q/What_is_average_IQ_of_mensa_members", "passage_text": "Bearing in mind that Mensa members are at the high end of the curve on the graph, the mode (average-most often) is likely to be 148 because more people have an IQ of 148 than 149, and more people have an IQ of 149 than 150, and so on. Candidates for membership in Mensa must achieve a score at or above the 98th percentile on a standard test of intelligence (a score that is greater than or equal to that achieved by 98 percent of the general population taking the test)."}, {"url": "http://www.i3mindware.com/mensa-requirements", "passage_text": "An ‘ average IQ score’ or ‘normal IQ score’ can be defined as a score between 85 and 115. 68% of people score between 85 and 115. The Mensa qualifying IQ score is a score that puts you in the top 2% of the population in a bell curve like this one. The Mensa qualifying score is 130 or higher, as shown below. This table indicates how IQ levels can be classified."}, {"url": "https://en.wikipedia.org/wiki/Mensa_International", "passage_text": "Mensa is the largest and oldest high IQ society in the world. It is a non-profit organization open to people who score at the 98th percentile or higher on a standardized, supervised IQ or other approved intelligence test. American Mensa's oldest member is 102, and British Mensa had a member aged 103. According to American Mensa's website (as of 2013), 38 percent of its members are baby boomers between the ages of 51 and 68, 31 percent are Gen-Xers between the ages of 27 and 48, and more than 2,600 members are under the age of 18."}, {"url": "http://us.mensa.org/join/testing/scoreevaluation/", "passage_text": "If you have an IQ between 85 and 110, you may not qualify for Mensa, but you’re still in good company; 68 percent of the population scores within this range. And we bet you’re smart enough to see that neither you nor your quality of life is defined by a number. Nearly 70 percent of the population has an IQ between 85 and 115 on most tests. The scores above 115 are generally considered as “high IQ,” and those above 130 to 132 (depending on the test taken) are usually considered highly gifted and are in the top 2 percent of the population."}, {"url": "http://math.stackexchange.com/questions/749664/average-iq-of-mensa", "passage_text": "2. I was wondering, what the average IQ at Mensa is. Mensa is a group of people with an IQ of at least 130. And the IQ is normally distribed with $\\mu = 100$ and $\\sigma = 15$. My idea was this: To get the mean of a function in interval $[a,b]$ I have to calculate. $$\\bar{f}(x) = \\frac{1}{b-a} \\int_a^b f(x)\\; dx$$"}, {"url": "http://www.answers.com/Q/What_is_average_IQ_of_mensa_members", "passage_text": "No, the IQ entry level for Mensa membership is extremely high, by average adult IQ scores, but is not consi considered genius, but there are Memsa members, who test much hig … her than the entry level, who do have what is considered genius level IQ. Candidates for membership in Mensa must achieve a score at or above the 98th percentile on a standard test of intelligence (a score that is greater than or equal to that achieved by 98 percent of the general population taking the test)."}, {"url": "https://www.mensa.org/about-us", "passage_text": "There is simply no one prevailing characteristic of Mensa members other than high IQ. There are Mensans for whom Mensa provides a sense of family, and others for whom it is a casual social activity. There have been many marriages made in Mensa, but for many people, it is simply a stimulating opportunity for the mind. Mensans have ranged in age from 2 to more than 100, but most are between 20 and 60. In education they range from preschoolers to high school dropouts to people with multiple doctorates. There are Mensans on welfare and Mensans who are millionaires."}, {"url": "http://mensa.org.uk/what-is-an-iq-test", "passage_text": "A top 2% mark in recognised IQ test qualifies you for entry to Mensa. IQ tests accepted by Mensa include the Cattell III B, Culture Fair, Ravens Advanced Matrices, Ravens Standard Matrices, Wechsler Scales and Stanford Binet (this list is not exhaustive). "}, {"url": "http://www.i3mindware.com/mensa-requirements", "passage_text": "An IQ in the top 2%. Getting into Mensa is NOT EASY. You have to score at or above the 98th percentile – the top 2% – on a standardized, professionally administered IQ test. This is typically a score of 130 or more. 68% of people score between 85 and 115. The Mensa qualifying IQ score is a score that puts you in the top 2% of the population in a bell curve like this one. The Mensa qualifying score is 130 or higher, as shown below. This table indicates how IQ levels can be classified."}]