[{"url": "http://www.wikihow.com/Paint-Aluminum-Siding", "passage_text": "Instead of replacing old aluminum siding, it is often more cost effective to repaint it. It's a very straightforward process and, provided you can set aside preparation and painting time, it is something most homeowners can do without professional assistance. 1 Many paint manufacturers recommend using only latex paint over steel. 2  Determine if the siding has been previously painted and what kind of paint has been used. 3  If possible, bring a sample to a professional. 4  Aluminum can be difficult to tell apart from vinyl if brand new."}, {"url": "http://www.benjaminmoore.com/en-us/for-contractors/painting-vinyl-and-aluminum-siding", "passage_text": "Add value to your painting business, and to your customer's home, by painting vinyl siding. Many homeowners are not aware that vinyl siding can be successfully painted. With the right paint and appealing color options, you can give your customer's home a whole new look—without investing in new siding. Plus, you can grow your business by reaching out to clients who own vinyl-sided homes. Applying paint to vinyl siding improves its durability, and is actually less labor-intensive than painting wood, masonry, or hardboard surfaces. Because the siding does not retain moisture, it is easy to clean and dries quickly"}, {"url": "http://www.wikihow.com/Paint-Aluminum-Siding", "passage_text": "1 Be cautious when using an acrylic primer, which can only be paired with acrylic paint. 2  Avoid latex primer since it generally contains ammonia, which reacts over time with aluminum to form microscopic gas bubbles and can lead to premature failure of the primer, removing the paint from the surface or the siding. 1 Many paint manufacturers recommend using only latex paint over steel. 2  Determine if the siding has been previously painted and what kind of paint has been used. 3  If possible, bring a sample to a professional. 4  Aluminum can be difficult to tell apart from vinyl if brand new."}, {"url": "http://www.edpaintingonline.com/blog/exterior/can-you-paint-aluminum-siding/", "passage_text": "The short answer is yes, you can paint aluminum siding, and it would typically last 15-20 years. With that said I’d like to go into some more details on how you can do that. The first step is to pressure wash the surface using a pressure washer. Tags: aluminum siding, exterior painting, refinish. This entry was posted on Sunday, March 13th, 2011 at 2:21 pm and is filed under Aluminum Siding, Exterior, House Painting CT. You can follow any responses to this entry through the RSS 2.0 feed. You can leave a response, or trackback from your own site."}, {"url": "http://www.edpaintingonline.com/blog/exterior/can-you-paint-aluminum-siding/", "passage_text": "You can apply a coat of primer or add Emulsa-Bond to your first coat of paint before you proceed with painting aluminum siding. The primer will allow the paint to bond correctly to the surface. A good latex primer applied using an airless sprayer is an excellent choice. Tags: aluminum siding, exterior painting, refinish. This entry was posted on Sunday, March 13th, 2011 at 2:21 pm and is filed under Aluminum Siding, Exterior, House Painting CT. You can follow any responses to this entry through the RSS 2.0 feed. You can leave a response, or trackback from your own site."}, {"url": "http://www.doityourself.com/stry/how-to-paint-an-aluminum-soffit", "passage_text": "Painting aluminum soffit can be a difficult project, but there are a few steps that you can take to help you through. Here are some steps to follow to guide you through your next project. Step 1 - Clean the Area. The most important thing to do before you begin the painting process is to clean off the aluminum soffit. If you begin with a dirty surface, the paint won't look as great or last as long. You can use a cleaner and a rag and rinse with water. Be sure that everything is completely dry before you pain"}, {"url": "http://www.ehow.com/how_7704150_paint-aluminum-soffit.html", "passage_text": "When inexperienced amateurs paint the exterior of their home, they tend to treat each surface the same, regardless of its composition. If you attempt to paint your aluminum soffit the same way you would a surface made of wood, heavy flaking will ultimately ensue. Aluminum soffits are nonporous. This makes them poorly suited for paint. Treat the soffit with a special acidic base coat, formulated for metallic surfaces. Once the soffits are primed, they will take a painted finish. Apply the paint, using a certain type of brush, or subtle flaws may appear in the finish."}, {"url": "http://www.todayshomeowner.com/how-to-paint-aluminum-siding/", "passage_text": "They apply a latex primer. This is probably the worst thing you can do when painting aluminum siding. Most latex paint has ammonia in it, and that includes primer. Ammonia has a chemical reaction to aluminum, which produces a tiny amount of gas. You will have to wait longer for an oil primer to dry, but it’s better than having to re-do everything within a year or two. Once the primer is dry, top coat with a 100% acrylic paint. If you take this approach to your aluminum siding paint project, you’ll have a long-lasting finish you can be proud of."}, {"url": "http://www.paintquality.com/en/advice-and-tips/faq/exterior/aluminum-siding", "passage_text": "After you clean and rinse the surface, you will need to prime all areas of exposed aluminum (that is, where you can see the metal), or where any of the white salts were. For the primer, use a latex corrosion-inhibitive primer. Ask for this at a paint store. "}]