[{"url": "http://venezuelanalysis.com/basicfacts", "passage_text": "Venezuela, named the Bolivarian Republic of Venezuela since 1999, is located on the northern coast of South America. The country comprises a continental mainland and numerous islands in the Caribbean Sea."}, {"url": "http://venezuelanalysis.com/basicfacts", "passage_text": "Basic Facts on Venezuela. Venezuela, named the Bolivarian Republic of Venezuela since 1999, is located on the northern coast of South America. The country comprises a continental mainland and numerous islands in the Caribbean Sea. It borders Guyana to the east, Brazil to the south, and Colombia to the west."}, {"url": "https://en.wikipedia.org/wiki/Government_of_Venezuela", "passage_text": "Venezuela is a federal presidential republic. The chief executive is President of Venezuela who is both head of state and head of government. Executive power is exercised by the President. Legislative power is vested in the National Assembly."}, {"url": "http://www.answers.com/Q/What_form_of_government_does_Venezuela_have", "passage_text": "Confidence votes 85. Venezuela is a country in South America and its government is known as a federal republic. Another Opinion: Although Venezuela's government is ostensibly claimed to be a federal republic, it is very rapidly becoming a tyrannical dictatorship under President Hugo Chavez."}, {"url": "http://www.ehow.com/facts_5290926_type-government-venezuela.html", "passage_text": "With a population of over 28 million, Venezuela is one of South America's major countries. It won independence from Spain in 1830 and became a constitutional democracy in 1959."}, {"url": "http://venezuelanalysis.com/basicfacts", "passage_text": "Since the discovery of oil in the early 20th century, Venezuela has been one of the world's leading exporters of oil, and it is a founding member of OPEC. Previously an underdeveloped exporter of agricultural commodities such as coffee and cocoa, oil quickly came to dominate exports and government revenues."}, {"url": "http://venezuelanalysis.com/basicfacts", "passage_text": "Venezuela is also among the most urban countries in Latin America. The majority of the population is concentrated in the north, especially in the largest metropolis, Caracas. Other major cities include Maracay, Maracaibo, Barquisimeto, Valencia, and Ciudad Guayana."}]