[{"url": "https://en.wikipedia.org/wiki/Capillary_electrophoresis", "passage_text": "Capillary electrophoresis (CE) is a family of electrokinetic separation methods performed in submillimeter diameter capillaries and in micro-and nanofluidic channels. The set-up for fluorescence detection in a capillary electrophoresis system can be complicated. The method requires that the light beam be focused on the capillary, which can be difficult for many light sources. Laser-induced fluorescence has been used in CE systems with detection limits as low as 10 −18 to 10 −21 mol."}, {"url": "http://chemistry.tutorvista.com/environmental-chemistry/capillary-electrophoresis.html", "passage_text": "Capillary Electrophoresis System. 1  The DNA fragments are separated by size. 2  The agarose gel is used for separation of large DNA molecule and the polyacrylamide gel is used for the small DNA fragments. 3  The gel is dipped in the buffer solution. The capillary electrophoresis is easy method and can be used for small ions to macromolecules like proteins, peptides, chiral compounds, nucleic acid. The electrophoresis involves the migration of ions and the opposite charged ions are attracted towards to the oppositely charged electrodes."}, {"url": "https://en.wikipedia.org/wiki/Capillary_electrophoresis", "passage_text": "A basic schematic of a capillary electrophoresis system is shown in figure 1. The system's main components are a sample vial, source and destination vials, a capillary, electrodes, a high voltage power supply, a detector, and a data output and handling device. The set-up for fluorescence detection in a capillary electrophoresis system can be complicated. The method requires that the light beam be focused on the capillary, which can be difficult for many light sources. Laser-induced fluorescence has been used in CE systems with detection limits as low as 10 −18 to 10 −21 mol."}, {"url": "http://www2.le.ac.uk/departments/emfpu/genetics/explained/electrophoresis", "passage_text": "Electrophoresis. There two main techniques by which electrophoresis is achieved today: gel and capillary electrophoresis, both of which are based on the same principle of size and charge based fragment separation. Capillaries are made of fused silica and have an internal diameter of only 50-100μm and can be 25-100cm in length. Similarly to gel electrophoresis, size separation is achieved via use of buffer solutions and application of positive and negative charges at either end of the capillary."}, {"url": "http://chemistry.tutorvista.com/environmental-chemistry/capillary-electrophoresis.html", "passage_text": "Capillary Electrophoresis. Electrophoresis is an analytical separation technique. It is especially used in clinical and research fields, and molecular biology. It deals with the separation and characterization of molecules like proteins, nucleic acids, small organelles and viruses. The capillary electrophoresis is easy method and can be used for small ions to macromolecules like proteins, peptides, chiral compounds, nucleic acid. The electrophoresis involves the migration of ions and the opposite charged ions are attracted towards to the oppositely charged electrodes."}, {"url": "http://www.shsu.edu/chm_tgc/primers/pdf/CE.pdf", "passage_text": "CapillaryElectrophoresis The heart of capillary electrophoresis (CE) is electroosmotic flow (EOF). This is the mobile phase “pump” inCE. Unlike gas chromatography (GC), there is no pressurized gas acting as the mobile phase in CE. "}, {"url": "https://en.wikipedia.org/wiki/Capillary_electrophoresis%E2%80%93mass_spectrometry", "passage_text": "Capillary electrophoresis–mass spectrometry (CE-MS) is an analytical chemistry technique formed by the combination of the liquid separation process of capillary electrophoresis with mass spectrometry. "}, {"url": "http://www.answers.com/Q/What_is_Capillary_Electrophoresis", "passage_text": "Confidence votes 55. Capillary electrophoresis (CE), also known as capillary zone electrophoresis (CZE), can be used to separate ionic species by their charge and frictional forces. In traditional electrophoresis, electrically charged analytes move in a conductive liquid medium under the influence of an electric field. With DNA capillary electrophoresis, DNA strands are made through DNA replication with dNTPs that are fluorescently labeled for the different nucleotides. Each base is labeled a different color. A fine laser lights up the DNA strand in the capillary tube and reads what color fluoresces."}, {"url": "http://chemistry.tutorvista.com/environmental-chemistry/capillary-electrophoresis.html", "passage_text": "The capillary electrophoresis is good and widely used due to the following advantage.It is a high resolution non chromatography separation technique.It has low operating cost and small amount of sample is required. The capillary electrophoresis is easy method and can be used for small ions to macromolecules like proteins, peptides, chiral compounds, nucleic acid. The electrophoresis involves the migration of ions and the opposite charged ions are attracted towards to the oppositely charged electrodes."}, {"url": "http://chemistry.tutorvista.com/environmental-chemistry/capillary-electrophoresis.html", "passage_text": "Capillary electrophoresis is an analytical separation technique of electrophoresis. The capillary electrophoresis is a high resolution separation technique. The separation of ions is based on the electrophoretic mobility of ions under an applied voltage. The capillary electrophoresis is easy method and can be used for small ions to macromolecules like proteins, peptides, chiral compounds, nucleic acid. The electrophoresis involves the migration of ions and the opposite charged ions are attracted towards to the oppositely charged electrodes."}]