[{"url": "http://www.nebraskamed.com/careers/education-programs/asp/restrictions/colistin", "passage_text": "Restrictions and Dosing Guidelines. Colistin is a polymyxin E antibiotic administered as the prodrug colistimethate which was originally introduced in the late 1950’s. 1 Colistin’s association with adverse effects including nephrotoxicity and neurotoxicy led to a decline in use. "}, {"url": "https://en.wikipedia.org/wiki/Colistin", "passage_text": "Colistin is a decades-old drug that fell out of favor due to its nephrotoxicity. It remains one of the last-resort antibiotics for multidrug-resistant Pseudomonas aeruginosa, Klebsiella pneumoniae, and Acinetobacter. Colistin sulfate is stable, but colistimethate sodium is readily hydrolysed to a variety of methanesulfonated derivatives. Colistin sulfate and colistimethate sodium are eliminated from the body by different routes."}, {"url": "https://en.wikipedia.org/wiki/Polymyxin", "passage_text": "Polymyxins B and E (also known as colistin) are used in the treatment of Gram-negative bacterial infections. The global problem of advancing antimicrobial resistance has led to a renewed interest in their use recently. Polymyxin M is also known as mattacin. "}, {"url": "https://en.wikipedia.org/wiki/Colistin", "passage_text": "There are two forms of colistin available commercially: colistin sulfate and colistimethate sodium (colistin methanesulfonate sodium, colistin sulfomethate sodium). Colistin sulfate is stable, but colistimethate sodium is readily hydrolysed to a variety of methanesulfonated derivatives. Colistin sulfate and colistimethate sodium are eliminated from the body by different routes."}, {"url": "http://cid.oxfordjournals.org/content/40/9/1333.long", "passage_text": "When colistin is used, we suggest the dosage of 160 mg (2 million IU) ever 8 h (or 240 mg [3 million IU] every 8 h for life-threatening infections). The duration of treatment depends on the type of infection and may be 14 days in cases of pneumonia and/or bacteremia. Subsequently, the intravenous use of colistin was mainly restricted during the past 2 decades for the treatment of lung infections due to multidrug-resistant (MDR), gram-negative bacteria in patients with cystic fibrosis [ 10 – 12 ]."}, {"url": "http://the-medical-dictionary.com/colistin_article_2.htm", "passage_text": "Administration. Colistin is used as a sulphate or as sulphomethylated form, colistimethate. Colistin sulphate tablets are used to treat intestinal infections, or to suppress colon flora. Colistin sulphate is also used as topical creams, powders, and otic solutions. Colistimethate is used for parenteral administration, and also as an aerosol to treat pulmonary infections."}, {"url": "https://en.wikipedia.org/wiki/Colistin", "passage_text": "Colistin has been used in combination with rifampicin, and there is in-vitro evidence of synergy, and the combination has been used successfully in patients. There is also in-vitro evidence of synergy for colistimethate sodium used in combination with other antipseudomonal antibiotics. Colistin sulfate is stable, but colistimethate sodium is readily hydrolysed to a variety of methanesulfonated derivatives. Colistin sulfate and colistimethate sodium are eliminated from the body by different routes."}, {"url": "http://www.niaid.nih.gov/topics/antimicrobialResistance/Pages/colistin.aspx", "passage_text": "Healthcare providers had largely stopped using colistin in the 1970s because of its toxicity. However, with antibacterial resistance on the rise, colistin is increasingly being used today to treat severe, multidrug-resistant Gram-negative bacterial infections, particularly among intensive care-based patients. Colistin: The Return of a 50-Year-Old Antibiotic. In recent years, antimicrobial (drug) resistance has become an increasingly important health issue, forcing healthcare providers to rely on a dwindling selection of drugs to fight infection among patients."}, {"url": "http://www.webmd.com/drugs/2/drug-8761/colistin-colistimethate-sodium-injection/details", "passage_text": "How to use colistin (colistimethate sodium) injection. Colistimethate for injection is usually given into a vein or a muscle as directed by your doctor. The dosage is based on your medical condition and response to treatment. If you are giving this medication to yourself at home, learn all preparation and usage instructions from your health care professional."}]