[{"url": "http://www.merriam-webster.com/dictionary/brass", "passage_text": "Full Definition of BRASS. 1. : an alloy consisting essentially of copper and zinc in variable proportions. 2. a: the brass instruments of an orchestra or band —often used in plural b: a usually brass memorial tablet c: bright metal fittings, utensils, or ornaments d: empty cartridge shells. 3"}, {"url": "https://en.wikipedia.org/wiki/Brass", "passage_text": "By comparison, bronze is principally an alloy of copper and tin. However, bronze and brass may also include small proportions of a range of other elements including arsenic, phosphorus, aluminium, manganese, and silicon. The term is also applied to a variety of brasses, and the distinction is largely historical. By varying the proportions of copper and zinc, the properties of the brass can be changed, allowing hard and soft brasses. The density of brass is approximately .303 lb/cubic inch, 8.4 to 8.73 grams per cubic centimetre."}, {"url": "http://www.audioenglish.org/dictionary/brass.htm", "passage_text": "• BRASS (noun). The noun BRASS has 7 senses: 1. an alloy of copper and zinc. 2. a wind instrument that consists of a brass tube (usually of variable length) that is blown by means of a cup-shaped or funnel-shaped mouthpiece. 3. the persons (or committees or departments etc.) who make up a body for the purpose of administering something. 4. impudent aggressiveness. Hypernyms (brass is a kind of...): wind; wind instrument (a musical instrument in which the sound is produced by an enclosed column of air that is moved by the breath). Meronyms (parts of brass): valve (device in a brass wind instrument for varying the length of the air column to alter the pitch of a tone)."}, {"url": "http://ell.stackexchange.com/questions/48029/what-does-the-brass-mean-exactly-in-military-context", "passage_text": "The brass refers to officers, and it's shorthand for the older phrase the brass hats.. From the OED: brass hat n. [so called from the gilt insignia on an officer's cap] colloq. (orig. Mil. slang) a high-ranking officer in the armed forces, originally in the British army; cf. tin hat n. 1b. In books by many different authors I encountered phrases like this: He curses the brass for not caring whether he lives or dies. From context, it seemed to me that it meant high-rank officers, about the rank of general. But sometimes it seems to mean lower (than general) rank commissioned officers, too."}, {"url": "http://www.thefreedictionary.com/brass", "passage_text": "brass. n. 1. (Metallurgy) an alloy of copper and zinc containing more than 50 per cent of copper. Alpha brass (containing less than 35 per cent of zinc) is used for most engineering materials requiring forging, pressing, etc Alpha-beta brass (35-45 per cent zinc) is used for hot working and extrusion. Beta brass (45-50 per cent zinc) is used for castings. cartridge brass-an alloy of copper and zinc (containing about 30% zinc) that is wrought into cartridges or tubing. copper-base alloy-any alloy whose principal component is copper."}, {"url": "http://www.definitions.net/definition/Brass", "passage_text": "Princeton's WordNet (0.00 / 0 votes) Rate this definition: brass (noun). an alloy of copper and zinc. brass, brass instrument (noun). a wind instrument that consists of a brass tube (usually of variable length) that is blown by means of a cup-shaped or funnel-shaped mouthpiece. Brass is an alloy of copper and zinc; the proportions of zinc and copper can be varied to create a range of brasses with varying properties. By comparison, bronze is principally an alloy of copper and tin."}, {"url": "http://www.thefreedictionary.com/brass", "passage_text": "alpha-beta brass, Muntz metal, yellow metal-a brass that has more zinc and is stronger than alpha brass; used in making castings and hot-worked products. alpha brass-an alloy of brass and zinc; used mainly for cold working. bearing brass-a brass bushing or a lining for a bearing. cartridge brass-an alloy of copper and zinc (containing about 30% zinc) that is wrought into cartridges or tubing. copper-base alloy-any alloy whose principal component is copper."}, {"url": "https://en.wikipedia.org/wiki/Brass", "passage_text": "Brass is a metal alloy made of copper and zinc; the proportions of zinc and copper can be varied to create a range of brasses with varying properties. It is a substitutional alloy: atoms of the two constituents may replace each other within the same crystal structure. By varying the proportions of copper and zinc, the properties of the brass can be changed, allowing hard and soft brasses. The density of brass is approximately .303 lb/cubic inch, 8.4 to 8.73 grams per cubic centimetre."}]