[{"url": "http://articles.mercola.com/sites/articles/archive/2014/08/23/health-benefits-cucumbers.aspx", "passage_text": "1 Cucumbers are made up of 95 percent water, making them an ideal hydrating and cooling food. 2  Cucumbers contain an anti-inflammatory flavonol called fisetin that appears to play an important role in your brain health. Cucumbers belong to the same plant family as squash, pumpkin, and watermelon (the Cucurbitaceae family). Like watermelon, cucumbers are made up of mostly (95 percent) water, which means eating them on a hot summer day can help you stay hydrated."}, {"url": "http://lajollamom.com/drink-cucumber-water-health/", "passage_text": "Health Benefits Of Cucumber Water. 1. It’s good for your muscles: Cucumbers contain silica, a trace mineral necessary to keep connective tissue healthy. Add a few slices to your workout water bottle. 2. It’s good for your skin: The silica and antioxidants help your skin stay clear and supple. "}, {"url": "http://www.whfoods.com/genpage.php?tname=foodspice&dbid=42", "passage_text": "Cucumbers are scientifically known as Cucumis sativus and belong to the same botanical family as melons (including watermelon and cantaloupe) and squashes (including summer squash, winter squash, zucchini and pumpkin). First, it is important to remember that the skins and seeds of cucumbers are both rich in nutrients. In fact, the nutrient richness of both plant parts is significantly higher than the flesh. For this reason, consumption of both skins and seeds is desirable from a nutritional standpoint."}, {"url": "http://www.livestrong.com/article/409250-are-cucumbers-good-for-you/", "passage_text": "All varieties of cucumbers are low in calories. A half cup of raw, sliced cucumbers with skin is only 10 calories. This vegetable also contains no cholesterol or sodium and is naturally fat free. The cucumber tends to be a mildly sweet flavored snack and delivers 2 g of carbohydrates and 1 g of sugars with each serving. "}, {"url": "http://www.symptomfind.com/nutrition-supplements/reasons-cucumbers-are-good-for-you/", "passage_text": "While eating cucumbers is a great way to get their health benefits, there are also other ways in which cucumbers are good for us. Cucumbers are great for conditioning damaged hair. Simply puree one quarter of a cucumber and blend with an egg and a tablespoon of olive oil. Low Calorie Snack. For all the nutritional benefits packed into cucumbers, they are very low in calories. One cup of cucumbers only contains 15 calories, but is rich in vitamin K, vitamin C and other vitamins and minerals. Cucumbers also contain quite a bit of water as well, which can help stave off dehydration."}, {"url": "https://answers.yahoo.com/question/index?qid=20070414054956AA2Jdny", "passage_text": "Best Answer: Cucumber is well-known as a natural 'heat decreaser', or coolant. It contains high percentage of water and fiber. It is the best for people who are suffering from acne, dehydration, sore throat, fever, and any problem you can related to heat. You can either eat it raw, cook it or blend it. cucumbers are good for your eyes you know like when your getting a facial and cucumber is a good source of vitamins c, k and potassiun it also has vitamin a and b which are good for eyesight and goo for providing energu your body needs."}, {"url": "http://www.care2.com/greenliving/16-superb-health-benefits-of-cucumber.html", "passage_text": "Pick a handful of firm, dark green cucumbers and pop them into your shopping basket. Congratulations! You have just bought yourself a fruit (yes, the cool cuke is fruit, not a vegetable) full of good health! Here is a short list of the impressive health benefits that a cucumber carries: 1  Keeps you hydrated. 2  If you are too busy to drink enough water, munch on the cool cucumber, which is 96 percent water. "}, {"url": "http://foodfacts.mercola.com/cucumber.html", "passage_text": "Cucumbers: Why They're Beneficial. Botanical name: Cucumis sativus. The fourth most widely cultivated vegetable in the world, the cucumber, related to both the melon and squash families, is technically a fruit. With its mild, refreshing flavor that mixes so well with other garden offerings, cucumbers are actually 90% water, but still manage to provide many valuable health benefits. Drain and rinse the salted cucumbers with fresh water. Mix in the sliced chiles, onion and garlic in a heatproof airtight container, then pour the hot vinegar mixture over the vegetables. Cover and refrigerate for 2 to 3 hours to blend the flavors."}, {"url": "http://foodfacts.mercola.com/cucumber.html", "passage_text": "Botanical name: Cucumis sativus The fourth most widely cultivated vegetable in the world, the cucumber, related to both the melon and squash families, is technically a fruit. With its mild, refreshing flavor that mixes so well with other garden offerings, cucumbers are actually 90% water, but still manage to provide many valuable health benefits. Drain and rinse the salted cucumbers with fresh water. Mix in the sliced chiles, onion and garlic in a heatproof airtight container, then pour the hot vinegar mixture over the vegetables. Cover and refrigerate for 2 to 3 hours to blend the flavors."}, {"url": "http://www.disabled-world.com/artman/publish/cucumber_benefits.shtml", "passage_text": "Japanese cucumbers or kyuri-A dark green cucumber with a very bumpy skin. Mainly used for slicing, salads and pickling. Cucumber is a very edible fruit which comes from the cucumber plant cucumis sativus, which is part of the gourd family. It is being used for different purpose as it can be eaten raw or cooked. With so many health benefits it becomes one of the most important parts of food diet as well as skin diet"}]