[{"url": "http://budgeting.thenest.com/much-expect-pay-recessed-lights-23513.html", "passage_text": "The cost to install recessed lighting generally ranges between $66 and $133 for each light. If the ceiling is already open, as in a home under construction or a room that is already being renovated, the cost will be on the low side of the range. Outdoors, they can be installed under eaves and porch ceilings. The cost of having recessed lights installed in your home will usually range from $150 to $200 per light. The cost of the lights themselves and the work required for an electrician to wire the ceiling will most affect the price."}, {"url": "http://home.costhelper.com/recessed-lighting.html", "passage_text": "1 Just the lights start about $25-$75 each, but can be $100-$150 or more apiece for higher-end models. 2  Installation by an electrician runs about $100-$200 per light, but can be more if access is limited (no attic) or if there are other circumstances that make installation difficult. What should be included: Shopping for recessed lighting: 1  Recessed lights are extremely versatile, and can be used for unobtrusive general lighting; for lighting above a desk, sink or other work area; or to accent artwork, walls or other features."}, {"url": "http://www.howmuchisit.org/recessed-lighting-cost/", "passage_text": "1 To have the holes installed for the lighting as well as install the lights, the price may range anywhere from $10 to $75 per light. 2  These prices are for those that have a new-construction based home. 3  Higher end lights can cost upwards of $130 each. 1 These prices are for those that have a new-construction based home. 2  Higher end lights can cost upwards of $130 each. 3  For example, a contractor pack can cost $38 to $52. 4  To have an electrician install the lights, each light can cost anywhere from $30 to $250 per light depending on the complexity of the setup."}, {"url": "http://budgeting.thenest.com/much-expect-pay-recessed-lights-23513.html", "passage_text": "Cost of the Lights. Low-end recessed lights cost between $20 and $60 each. Higher-end, low-voltage recessed lighting can cost $75 to $150 or more per light. Each light requires a housing that goes into the ceiling and a trim that covers gaps between the housing and the drywall. Outdoors, they can be installed under eaves and porch ceilings. The cost of having recessed lights installed in your home will usually range from $150 to $200 per light. The cost of the lights themselves and the work required for an electrician to wire the ceiling will most affect the price."}, {"url": "http://home.costhelper.com/recessed-lighting.html", "passage_text": "1 Having an electrician install the lights in an open ceiling can run $50-$200 or more per light (and averages about $125-$150) depending on local rates and the relative ease of installation. What should be included: Shopping for recessed lighting: 1  Recessed lights are extremely versatile, and can be used for unobtrusive general lighting; for lighting above a desk, sink or other work area; or to accent artwork, walls or other features."}, {"url": "http://www.howmuchisit.org/recessed-lighting-cost/", "passage_text": "1 To have an electrician install the lights, each light can cost anywhere from $30 to $250 per light depending on the complexity of the setup. 2  The more lights that have to be installed, the lower the price per bulb may be. 1 These prices are for those that have a new-construction based home. 2  Higher end lights can cost upwards of $130 each. 3  For example, a contractor pack can cost $38 to $52. 4 "}, {"url": "http://www.homewyse.com/services/cost_to_install_recessed_lighting.html", "passage_text": "Get an INSTANT estimate of the cost to Install Recessed Lighting! Our free calculator uses recent, trusted data to estimate costs for your Recessed Light Installation project. For a basic 1 light project in zip code 47474, the benchmark cost to Install Recessed Lighting ranges between $185.86 - $336.37 per light. To estimate costs for your project: 1. Set Project Zip Code Enter the Zip Code for the location where labor is hired and materials purchased. 2"}, {"url": "http://home.costhelper.com/recessed-lighting.html", "passage_text": "1 An Oregon do-it-yourselfer installed eight recessed lights in a kitchen with an open ceiling for $180. 2  Having an electrician install the lights in an open ceiling can run $50-$200 or more per light (and averages about $125-$150) depending on local rates and the relative ease of installation. What should be included: Shopping for recessed lighting: 1  Recessed lights are extremely versatile, and can be used for unobtrusive general lighting; for lighting above a desk, sink or other work area; or to accent artwork, walls or other features."}, {"url": "http://ths.gardenweb.com/discussions/2438048/cost-to-install-recessed-lights", "passage_text": "Our 4 inch (line voltage) cans inch cans were about $20. We also are installing 2 (4 inch) low voltage cans - $75 each. Trims for the cans range from about $10 to $30. Remodel cans (used when you are not tearing out the ceiling and have no access from above) are slightly higher. Can't really help you on the cost. Our ceiling was taken down plus we have access from above and we are replacing all wiring in the kitchen. "}]