[{"url": "http://www.atitesting.com/ati_next_gen/skillsmodules/content/medication-administration-1/equipment/gen_vs_trade.html", "passage_text": "A drug s brand or trade name is the name its manufacturer gives the drug, thus one drug might have several trade names, each assigned by a different manufacturer. For example, ibuprofen is marketed as Advil, Motrin, Nuprin, and others. Each drug has only one generic name and it is used by all manufacturers of the drug. Different pharmacies prepare drug labels different ways, but often you will see the generic name printed on a drug label in small type, sometimes in parentheses, under the brand name."}, {"url": "https://en.wikipedia.org/wiki/Generic_drug", "passage_text": "Generic drugs are labeled with the name of the manufacturer and the adopted name (nonproprietary name) of the drug. A generic drug must contain the same active ingredients as the original formulation. According to the U.S. Food and Drug Administration (FDA), generic drugs are identical or within an acceptable bioequivalent range to the brand-name counterpart with respect to pharmacokinetic and pharmacodynamic properties. When generic products become available, the market competition often leads to substantially lower prices for both the original brand name product and the generic forms. The time it takes a generic drug to appear on the market varies."}, {"url": "http://www.fda.gov/Drugs/ResourcesForYou/Consumers/QuestionsAnswers/ucm100100.htm", "passage_text": "Yes. A generic drug is the same as a brand-name drug in dosage, safety, strength, quality, the way it works, the way it is taken and the way it should be used. FDA requires generic drugs have the same high quality, strength, purity and stability as brand-name drugs. Not every brand-name drug has a generic drug. When new drugs are first made they have drug patents. Most drug patents are protected for 20 years. The patent, which protects the company that made the drug first, doesn't allow anyone else to make and sell the drug"}, {"url": "http://www.medicinenet.com/script/main/art.asp?articlekey=46204", "passage_text": "Generic drugs are copies of brand-name drugs that have exactly the same dosage, intended use, effects, side effects, route of administration, risks, safety, and strength as the original drug. In other words, their pharmacological effects are exactly the same as those of their brand-name counterparts. An example of a generic drug, one used for diabetes, is metformin. A brand name for metformin is Glucophage. (Brand names are usually capitalized while generic names are not.) A generic drug, one used for hypertension, is metoprolol, whereas a brand name for the same drug is Lopressor"}, {"url": "https://en.wikipedia.org/wiki/Generic_drug", "passage_text": "A generic drug (generic drugs, short: generics) is a drug defined as a drug product that is comparable to a brand/reference listed drug product in dosage form, strength, quality and performance characteristics, and intended use.. When generic products become available, the market competition often leads to substantially lower prices for both the original brand name product and the generic forms. The time it takes a generic drug to appear on the market varies."}, {"url": "http://patient.info/health/generic-vs-brand-name-medicines", "passage_text": "1 Each medicine has an approved name called the generic name. 2  A group of medicines that have similar actions often have similar-sounding generic names. 3  For example, phenoxymethylpenicillin, ampicillin, amoxicillin and flucloxacillin are in one group of antibiotics. 4  Brand (trade) name. 1 Start a discussion. 2  Generic name. 3  Each medicine has an approved name called the generic name. 4  A group of medicines that have similar actions often have similar-sounding generic names. 5"}, {"url": "http://www.webmd.com/epilepsy/features/epilepsy-medications-when-is-it-safe-to-substitute-a-generic", "passage_text": "The FDA tightly regulates manufacture of all generic drugs, just like brand-name drugs. Epilepsy drugs are held to the same high standards: 1  Generic epilepsy drugs have precisely the same amount of drug as the brand-name version. 2  Generic drugs must meet the same high standards for purity, quality, and strength as the drugs they imitate. "}, {"url": "http://patient.info/health/generic-vs-brand-name-medicines", "passage_text": "1 Generic name. 2  Each medicine has an approved name called the generic name. 3  A group of medicines that have similar actions often have similar-sounding generic names. 4  For example, phenoxymethylpenicillin, ampicillin, amoxicillin and flucloxacillin are in one group of antibiotics. 5  Brand (trade) name. 1 Start a discussion. 2  Generic name. 3  Each medicine has an approved name called the generic name. 4  A group of medicines that have similar actions often have similar-sounding generic names. 5"}, {"url": "http://www.medicinenet.com/script/main/art.asp?articlekey=10127", "passage_text": "Generic name, drug: The term generic name has several meanings as regards drugs: 1  The chemical name of a drug. 2  A term referring to the chemical makeup of a drug rather than to the advertised brand name under which the drug is sold. 3  A term referring to any drug marketed under its chemical name without advertising. "}, {"url": "http://www.ncbi.nlm.nih.gov/pubmedhealth/drug-names-and-classes/", "passage_text": "Drug names and classes. A drug can have several names. There is usually a generic name for a drug substance plus one or more brand names. You can search for drugs by either their generic or brand names on PubMed Health. Generic names for drugs are chosen by a variety of official bodies. That means that these names sometimes vary from country to country. "}]