[{"url": "http://www.answers.com/Q/What_is_thrust_force", "passage_text": "Thrust is a reaction force described quantitatively by Newton's second and third laws. When a system expels or accelerates mass in one direction the accelerated mass will cause a proportional but opposite force on that system. Let's take the forces one-at-a-time starting with Thrust. 1. Thrust-is provided by the propeller or jet engine; thrust acts to move the plane forward into the air. 2. Li … ft-As the plane moves forward the shape of the wing (airfoil) causes a pressure difference that exerts an upward force on the wing -- the lift force."}, {"url": "http://www.grc.nasa.gov/WWW/K-12/airplane/thrust1.html", "passage_text": "Thrust is the force which moves an aircraft through the air. Thrust is used to overcome the drag of an airplane, and to overcome the weight of a rocket. Thrust is generated by the engines of the aircraft through some kind of propulsion system. Thrust is a mechanical force, so the propulsion system must be in physical contact with a working fluid to produce thrust. Thrust is generated most often through the reaction of accelerating a mass of gas. Since thrust is a force, it is a vector quantity having both a magnitude and a direction. The engine does work on the gas and accelerates the gas to the rear of the engine; the thrust is generated in the opposite direction from the accelerated gas."}, {"url": "http://howthingsfly.si.edu/forces-flight/four-forces", "passage_text": "1 Lift is the force that acts at a right angle to the direction of motion through the air. 2  Lift is created by differences in air pressure. 3  Thrust is the force that propels a flying machine in the direction of motion. 4  Engines produce thrust. 5  Drag is the force that acts opposite to the direction of motion. Four Forces Affect Things That Fly: 1  Weight is the force of gravity. 2  Lift is the force that acts at a right angle to the direction of motion through the air. 3  Thrust is the force that propels a flying machine in the direction of motion. 4"}, {"url": "http://www.allstar.fiu.edu/aero/thrust.htm", "passage_text": "Thrust is the force necessary to move the aircraft forward and lift is the force acting in the upward direction required to keep the aircraft aloft. Opposing thrust is DRAG or the force produced by air resistance. The last force is the WEIGHT of the airplane, the downward acting force, and is produced by gravity. "}, {"url": "http://classroom.synonym.com/thrust-22828.html", "passage_text": "Video Transcript. Hello, my name is Walter Unglaub, and this is what is thrust. Thrust is a type of reaction force due to the acceleration of matter in a, in the separate direction. So as an example, let's consider a rocket. "}, {"url": "https://spaceflightsystems.grc.nasa.gov/education/rocket/rktth1.html", "passage_text": "Thrust is the force which moves the rocket through the air, and through space. Thrust is generated by the propulsion system of the rocket through the application of Newton's third law of motion; For every action there is an equal and opposite re-action. The re-action to the acceleration of the working fluid produces the thrust force on the engine. The working fluid is expelled from the engine in one direction and the thrust force is applied to the engine in the opposite direction. Forces are vector quantities having both a magnitude and a"}, {"url": "https://en.wikipedia.org/wiki/Thrust", "passage_text": "The force applied on a surface in a direction perpendicular or normal to the surface is called thrust. Force, and thus thrust, is measured in the International System of Units (SI) as the newton (symbol: N), and represents the amount needed to accelerate 1 kilogram of mass at the rate of 1 metre per second squared. The power needed to generate thrust and the force of the thrust can be related in a non-linear way. In general, . The proportionality constant varies, and can be solved for a uniform flow: Note that these calculations are only valid for when the incoming air is accelerated from a standstill-for example when hovering."}, {"url": "http://www.thefreedictionary.com/thrust", "passage_text": "thrust. The force that causes an object to move forward. Thrust in a jet or rocket engine develops as a reaction to the ejection of exhaust gases from the rear of the engine. Thrust in a propeller results from the spinning of the propeller blades that pushes air or water in a certain direction"}, {"url": "http://www.audioenglish.org/dictionary/thrust.htm", "passage_text": "• THRUST (noun). The noun THRUST has 5 senses: 1. the force used in pushing. 2. a strong blow with a knife or other sharp pointed instrument. 3. the act of applying force to propel something. 4. verbal criticism. 5. a sharp hand gesture (resembling a blow). Familiarity information: THRUST used as a noun is common. "}]