[{"url": "http://www.ehow.com/info_12075702_salary-range-dog-breeder.html", "passage_text": "Considerations. The type of breed may affect how much money a dog breeder earns. More expensive breeds such as the Irish wolfhound, Akita, rottweiler and English bulldog tend to cost more than other types of dogs, which could increase a breeder's salary. Litter size is another consideration; larger logs tend to have bigger litters, while smaller dogs have smaller litters."}, {"url": "http://study.com/articles/Animal_Breeder_Information_About_Starting_a_Career_as_an_Animal_Breeder.html", "passage_text": "Even within the small and domestic animal breeding category, the earning potential depends on the type of animal bred and whether or not that breeder has produced any verifiable champions. However, the BLS reported that animal breeders earned an average annual salary of $37,230 in May 2012. States with the highest number of professional animal breeders in the same year included Kentucky, Wisconsin and California, per the BLS. Animal breeders may breed purebred cats or dogs to be sold as pets or to show professionally. When this is the case, animal breeders strive to meet specific standards in their animals as set by organizations such as the American Kennel Club."}, {"url": "http://www.ehow.com/info_12075702_salary-range-dog-breeder.html", "passage_text": "States with the most breeders include Wisconsin, California, Texas, Iowa and Florida; breeder incomes can vary dramatically depending on region, with the state of Washington leading the pack at an average salary of $56,840, according to the BLS. More expensive breeds such as the Irish wolfhound, Akita, rottweiler and English bulldog tend to cost more than other types of dogs, which could increase a breeder's salary. Litter size is another consideration; larger logs tend to have bigger litters, while smaller dogs have smaller litters."}, {"url": "http://www.answers.com/Q/How_much_do_dog_breeders_earn", "passage_text": "I will say now that dog breeding isn't ideally an income earning career. It takes 300% of your time, envelopes your life and only just covers itself. Firstly, pedigree dogs are much more valuable to sell as adults and puppies than cross breed or mongrols. It depends on the breeder, of course. I just got a papillon puppy from a breeder. In my search I saw all kinds of prices. $650, $900, $1200 (most common), $1500 and $1800. The … prices seem to go up depending on the quality of the dog. That is, breeders with many champion show dogs in the lines charge more, even for a pet/companion. You can usually get an adult papillon from a breeder for less. I've seen $700,$900 and $1000. These are usually b!tches that are former champion"}, {"url": "http://learn.org/articles/Animal_Breeder_Your_Salary_and_Career_Questions_Answered.html", "passage_text": "You may also work in a laboratory. You'll facilitate conventional mating and, in some cases, artificial insemination. According to the U.S. Bureau of Labor Statistics (BLS) in May 2013, animal breeders earned an average hourly wage of $19.38 and an average annual wage of $40,310 (www.bls.gov). The BLS reported that Wisconsin had more animal breeders than any other state that year, with approximately 250. The average salary for animal breeders in this state was higher than the national average, at $47,430. The other top states in terms of employment level were Iowa, California, Florida and Texas."}, {"url": "http://www.answers.com/Q/Salary_of_a_dog_breeder", "passage_text": "Confidence votes 2. the salary of a dog breeder depends on what type of breed the dogs are and the price range and if the dogs have papers if not the price would have to be half price and how many puppies are. It would depend on many things. I will say now that dog breeding isn't ideally an income earning career. It takes 300% of your time, envelopes your life and only just covers i … tself. Firstly, pedigree dogs are much more valuable to sell as adults and puppies than cross breed or mongrols."}, {"url": "http://www.ehow.com/info_12075702_salary-range-dog-breeder.html", "passage_text": "SVPhilon/iStock/Getty Images. From poodles to pugs, the job of a dog breeder is to select and breed dogs according to their genealogy and, in many cases, sell them to the public once the pups are of age, generally between eight and12 weeks. More expensive breeds such as the Irish wolfhound, Akita, rottweiler and English bulldog tend to cost more than other types of dogs, which could increase a breeder's salary. Litter size is another consideration; larger logs tend to have bigger litters, while smaller dogs have smaller litters."}, {"url": "http://www.insidejobs.com/careers/dog-breeder", "passage_text": "Education: Associate's Salary: $18,000 – $57,000 Animal Breeder Research animal bloodlines and match up specific traits to be reproduced. Education: Associate's Salary: $18,000 – $57,000 Canary Breeder Breed beautiful canaries from eggs for sale as pets. They may know how tall, how big, how speckled, and how shiny a dog should be when full-grown, and they won’t pay top dollar for a substandard specimen. This makes your job very important, because as a Dog Breeder, you supervise the breeding of dogs to create puppies that conform to buyer’s expectations."}]