[{"url": "http://www.fws.gov/midwest/Endangered/fishes/ozkcf_fc.html", "passage_text": "1 It is pinkish-white and blind. 2  Habitat-The Ozark cavefish lives in cave streams and springs. 3  The cave ecosystem is often dependent upon bats (especially gray bats) as a source of energy and nutrients. 4  Reproduction-Very little is known about the reproduction of the Ozark cavefish. 1 The cavefish primarily eats plankton. 2  They also eat isopods, amphipods, crayfish, salamander larvae, and bat guano. 3  Range-The cavefish can be found in caves within the Springfield Plateau of the Ozark Highlands in Arkansas, Missouri, and Oklahoma."}, {"url": "http://www.wildlifedepartment.com/wildlifemgmt/endangered/cavefish.htm", "passage_text": "Ozark Cavefish (Amblyopsis rosae). (Federally listed as Threatened). Description: The Ozark Cavefish is a small that grows no more than two inches in length. Its skin is unpigmented so it looks white in color, and it has no eyes. Despite its small size, this can be a long-lived fish, often living more than 15 years. Cavefish feed on small invertebrates. Habitat: The Ozark Cavefish is specially adapted for life in subterranean water."}, {"url": "http://www.fws.gov/midwest/Endangered/fishes/ozkcf_fc.html", "passage_text": "1 Appearance-The Ozark cavefish is a small fish about 2-1/4 inches long. 2  It is pinkish-white and blind. 3  Habitat-The Ozark cavefish lives in cave streams and springs. 4  The cave ecosystem is often dependent upon bats (especially gray bats) as a source of energy and nutrients. 1 The cavefish primarily eats plankton. 2  They also eat isopods, amphipods, crayfish, salamander larvae, and bat guano. 3  Range-The cavefish can be found in caves within the Springfield Plateau of the Ozark Highlands in Arkansas, Missouri, and Oklahoma."}, {"url": "http://www.fws.gov/midwest/Endangered/fishes/ozkcf_fc.html", "passage_text": "1 Habitat-The Ozark cavefish lives in cave streams and springs. 2  The cave ecosystem is often dependent upon bats (especially gray bats) as a source of energy and nutrients. 3  Reproduction-Very little is known about the reproduction of the Ozark cavefish. 1 The cavefish primarily eats plankton. 2  They also eat isopods, amphipods, crayfish, salamander larvae, and bat guano. 3  Range-The cavefish can be found in caves within the Springfield Plateau of the Ozark Highlands in Arkansas, Missouri, and Oklahoma."}, {"url": "http://www.wired.com/2011/05/blind-fish-in-dark-caves-shed-light-on-the-evolution-of-sleep/", "passage_text": "A world without light is quite an alien place. There are many examples of fish that live in completely dark caves. Remarkably, if you compare these fish to their relatives that live in rivers or in the ocean, you find that the cavefish often undergo a similar set of changes. Their eyes do not fully develop, rendering them essentially blind"}, {"url": "http://www.pittsburghzoo.org/animal.aspx?id=123", "passage_text": "Blind Cavefish. The blind cavefish (astyanax mexicanus), also known as the Mexican tetra, lives in deep, dark caves in the warm waters of Central America. Blind cavefish are born with eyes, but as they get older, skin grows over them and their vision degenerates. Size: Blind cavefish grow to about 3.5 inches long"}, {"url": "http://runescape.wikia.com/wiki/Cavefish", "passage_text": "For the raw version, see Raw cavefish. Cavefish is a type of fish that can only be found in the Living Rock Caverns. The Living Rock Caverns are located underneath the Dwarven Mine, which is located under Falador and extends to Ice Mountain. In order to fish raw cavefish you will need a fishing rod (not a fly fishing rod) and normal fishing bait. Players who wish to catch Cavefish should beware of the high level Living rock creatures in the area. Fishing with other players can be safer for an individual by spreading the creatures' attacks out amongst the group. Prior to the world list update, worlds 84, 77, and 88 were the unofficial Living Rock Caverns worlds"}, {"url": "https://en.wikipedia.org/wiki/Amblyopsidae", "passage_text": "The Amblyopsidae are a fish family commonly referred to as cavefish, blindfish, or swampfish. They are small freshwater fish found in the dark environments of swamps, caves, and deep lakes in the eastern half of the United States. Blindfish are generally small, ranging up to 11 cm (4.3 in) in length. Cavefish are probably ancient in origin. Adaptations common to many cavefish include reduced susceptibility to light, pigment loss, or reduction in skin scales, as well as development of chemoreceptors in the sensory organs of the body surface and the lateral line"}]