[{"url": "http://www.webmd.com/children/vaccines/tc/tetanus-topic-overview?page=2", "passage_text": "The bacteria that cause tetanus are called Clostridium tetani. They are usually found in dirt and soil, most often in areas with animal waste such as farms and ranches. These bacteria typically enter the body through a wound, cut, or splinter."}, {"url": "http://www.healthline.com/health/tetanus", "passage_text": "Tetanus is a serious bacterial infection that affects the nervous system and causes muscles throughout the body to tighten. Tetanus is also commonly called lockjaw, because the infection primarily causes muscle contractions in the jaw and neck, but can eventually spread to other parts of the body. Without treatment, tetanus infection can be life-threatening."}, {"url": "https://www.health.ny.gov/diseases/communicable/tetanus/fact_sheet.htm", "passage_text": "Tetanus, commonly called lockjaw, is a serious bacterial disease that affects muscles and nerves. It is characterized by muscle stiffness that usually involves the jaw and neck that then progresses to involve other parts of the body. Death can result from severe breathing difficulties or heart abnormalities."}, {"url": "http://www.webmd.com/children/vaccines/understanding-tetanus-basics", "passage_text": "Tetanus is a dangerous nerve ailment caused by the toxin of a common bacterium, Clostridium tetani. Bacterial spores are found in soil -- most frequently in cultivated soil, least frequently in virgin soil. The spores can remain infectious for more than 40 years in soil."}, {"url": "http://www.medicalnewstoday.com/articles/163063.php", "passage_text": "Knowledge center. Tetanus (or lockjaw) is a serious infection caused by Clostridium tetani bacteria which produce a toxin that affects the brain and nervous system. The toxin leads to stiffness in the jaw muscles as well as other muscles."}, {"url": "http://www.webmd.boots.com/children/guide/tetanus-causes-symptoms-prevention", "passage_text": "Tetanus is a serious infection caused by bacteria getting into the body through a wound, such as a cut, bite or burn. Tetanus is caused by Clostridium tetani bacterium, which is found in soil, dust and animal and human waste faeces."}, {"url": "http://www.medicalnewstoday.com/articles/163063.php", "passage_text": "Tetanus is caused by the Clostridium tetani bacterium. Clostridium tetani spores are able to survive for a long time outside of the body. They are most commonly found in animal manure and contaminated soil, but may exist virtually anywhere."}, {"url": "http://www.healthline.com/health/tetanus", "passage_text": "Tetanus is caused by bacteria called Clostridium tetani that can be found in dust, dirt, and animal droppings. A person can become infected when these bacteria enter the bloodstream through a cut or deep wound."}]