[{"url": "https://en.wikipedia.org/wiki/Potassium_nitrate", "passage_text": "Potassium nitrate is a chemical compound with the chemical formula K N O 3. It is an ionic salt of potassium ions K + and nitrate ions NO 3 − . It occurs as a mineral niter and is a natural solid source of nitrogen. Potassium nitrate is one of several nitrogen-containing compounds collectively referred to as saltpeter or saltpetre. "}, {"url": "http://www.bhsu.edu/Portals/91/Tutorials2/ChemEquations/WCEI.pdf", "passage_text": "The Net Ionic Equation The complete ionic equation, Ag + (aq) + NO 3- (aq) + Na + (aq) + Cl - (aq)=AgCl(s) + Na + (aq) + NO 3- (aq) contains two ions that appear on both sides of the chemical equation, Na + (aq) and NO 3- (aq). Things that appear unchanged on both sides of a chemical reaction are called spectators. One last problem…. Write the molecular, complete ionic and net ionic equations for the reaction of barium hydroxide and nitric acid. I stepped it up a notch here. I told you the reactants, but I didn’t give you’re the products, that is up to you.Actually this is not as bad as it sounds."}, {"url": "https://answers.yahoo.com/question/index?qid=20120224031623AAwiidu", "passage_text": "Report Abuse. First you write a molecular equation with states-that is the normal equation that you write for a chemical reaction: Molecular equation: AgNO3(aq) + KCl(aq) → AgCl(s) + KNO3(aq) Write the full ionic equation: To do this you separate anything that can dissociate, into its respective ions. AgNO3(aq), KCl(aq), and KNO3(aq) are strong electrolytes and so the ionic equation is: Ag+(aq) + Cl-(aq) + K+(aq) + NO3-(aq) → AgCl(s) + K+(aq) + NO3-(aq). K+(aq) and NO3-(aq) are both spectator ions and are eliminated to yield the net ionic: Ag+(aq) + Cl-(aq) → AgCl(s)."}, {"url": "http://www.chemteam.info/Equations/Net-Ionic-Equation-prob11-25.html", "passage_text": "Ag + (aq) + CH 3 3 COO(s) + H + (aq). Nitrate is the only spectator ion. Problem #12: Write balanced molecular equation and net ionic equations for the following reactions. a) A solution of potassium hydroxide reacts with a solution of sodium hydrogen phosphate. b) A solution of magnesium nitrate reacts with a solution of ammonium carbonate."}, {"url": "http://cms.cerritos.edu/uploads/Chemistry/Chem_111/111%20worksheets/Worksheet%20Net%20Ionic.pdf", "passage_text": "WORKSHEET-MOLECULAR AND IONIC EQUATIONS (Any soluble substance given below is in aqueous solution.) Write molecular, total-ionic and net-ionic equations for the following: 1) Potassium phosphate and calcium nitrate. Molecular equation: Total-ionic equation: Net-ionic equation: 2) Barium chloride and sodium sulfate. "}, {"url": "http://dl.clackamas.edu/ch105/lesson3precipitation_reactions.html", "passage_text": "This representation is called the complete ionic equation. The barium and sulfate ions actually react to form the barium sulfate product. The copper(II) ions and the nitrate ions are not actually involved in the reaction. They are called spectator ions. Net Ionic Equations. If we eliminate the spectator ions from the complete ionic equation we have what is called the net ionic equation. It shows only the ions that are actually involved in the reaction. "}, {"url": "http://www.bhsu.edu/Portals/91/Tutorials2/ChemEquations/WCEI.pdf", "passage_text": "Finallyyp we remove the spectator ions that occur on both sides. of the complete ionic equation to get the net ionic equation: Ba 2+ (aq) + CrO 42- (aq) = BaCrO(aq) + 4 (s). One last problem…. Write the molecular, complete ionic and net ionic equations for the reaction of barium hydroxide and nitric acid. I stepped it up a notch here. I told you the reactants, but I didn’t give you’re the products, that is up to you.Actually this is not as bad as it sounds."}, {"url": "https://answers.yahoo.com/question/index?qid=20120224031623AAwiidu", "passage_text": "This was the answer that was provided: AgNO3(aq), KCl(aq), and KNO3(aq) are strong electrolytes and so the ionic equation is: Ag+(aq) + Cl-(aq) + K+(aq) + NO3-(aq) → AgCl(s) + K+(aq) + NO3-(aq) K+(aq) and NO3-(aq) are both spectator ions and are eliminated to yield the net ionic: Ag+(aq) + Cl-(aq) →... AgNO3(aq), KCl(aq), and KNO3(aq) are strong electrolytes and so the ionic equation is: Ag+(aq) + Cl-(aq) + K+(aq) + NO3-(aq) → AgCl(s) + K+(aq) + NO3-(aq). K+(aq) and NO3-(aq) are both spectator ions and are eliminated to yield the net ionic: Ag+(aq) + Cl-(aq) → AgCl(s)."}, {"url": "http://www.onlinemathlearning.com/ionic-equation.html", "passage_text": "Write the ionic equation for the word equation. Sodium chloride(aq) + silver nitrate(aq) → silver chloride(s) + sodium nitrate(aq). Solution: Step 1: Write the equation and balance it if necessary. NaCl(aq) + AgNO 3 (aq) → AgCl(s) + NaNO 3 (aq). Step 2: Split the ions. Molecular, Complete Ionic, and Net Ionic Equations. How to write a net ionic equation. (double replacement). Basic lesson on molecular equations, complete ionic equations, and net ionic equations."}, {"url": "http://www.bhsu.edu/Portals/91/Tutorials2/ChemEquations/WCEI.pdf", "passage_text": "Example problem Write the balanced molecular, com plete ionic and net ionic equations for the reaction of barium nitrate and potassium chromate in solution, where they react to form a barium chromate precipitate and aqueous potassium nitratechromate precipitate and aqueous potassium nitrate. One last problem…. Write the molecular, complete ionic and net ionic equations for the reaction of barium hydroxide and nitric acid. I stepped it up a notch here. I told you the reactants, but I didn’t give you’re the products, that is up to you.Actually this is not as bad as it sounds."}]