[{"url": "http://www.olemiss.edu/courses/bisc102/macromol.html", "passage_text": "Amino acids have a carbon attached to a hydrogen, an amino group, a carboxyl group and something else (R). Its the something else that give the amino acid its characteristics (3.12a&b, pg 42). Amino acids are joined together by peptide bonds (dehydration synthesis) (3.13, pg 43)."}, {"url": "http://www.austincc.edu/biology/assessment/pdf/Module2_Macromolecules.pdf", "passage_text": "Summary of Proteins  Subunits are amino acids  Amino acids are joined by condensation reactions that form peptide bonds  The amino acid sequence is a protein’s primary structure. The primary structure can also be called a polypeptide."}, {"url": "http://chemistry24.com/biology/the-macromolecules.html", "passage_text": "A macromolecule is a very large molecule made up of smaller units called monomers. The monomers may be the same or slightly different. Macromolecules are formed by dehydration reactions in which water molecules are removed from the formation of bonds. Four main types of macromolecules control all activities. They are proteins, carbohydrates, nucleic acids and lipids. Their monomers are amino acids, sugars, nucleosides and glycerol and fatty acids."}, {"url": "https://en.wikibooks.org/wiki/An_Introduction_to_Molecular_Biology/Macromolecules_and_Cells", "passage_text": "Proteins are polymer of amino acids linked together by peptide bonds. Amino acids can be divided into two group essential amino acids and non-essential amino acids. Proteins and carbohydrates contain 4 kcal/gram as opposed to lipids which contain 9 kcal/ gram."}, {"url": "http://www.olemiss.edu/courses/bisc102/macromol.html", "passage_text": "Fats. Fats are large molecules made of two types of molecules, glycerol and some type of fatty acid. The fatty acid has a long chain of carbon and hydrogen, usually referred to as the hydrocarbon tail, with a carboxyl group head. (The carboxyl group is why its called an acid)."}, {"url": "http://www.answers.com/Q/What_bonds_form_macromolecules", "passage_text": "depends on the macromolecule. the broad category would be covalent bonds ... but there are sort of subcategories... like, proteins are joined with peptide bonds (which occur through dehydrogenation-removal of a water molecule) protein folding is also a function of hydrogen bonding."}, {"url": "https://en.wikibooks.org/wiki/An_Introduction_to_Molecular_Biology/Macromolecules_and_Cells", "passage_text": "A noncovalent bond is a type of chemical bond, typically between macromolecules, that does not involve the sharing of pairs of electrons, but rather involves more dispersed variations of electromagnetic interactions. The noncovalent bond is the dominant type of bond between supermolecules in supermolecular chemistry."}, {"url": "http://www.olemiss.edu/courses/bisc102/macromol.html", "passage_text": "These are known as macromolecules. Most macromolecules are polymers, which are long chains of subunits called monomers. These subunits are often very similar to each other, and for all the diversity of polymers (and living things in general) there are only about 40 - 50 common monomers."}, {"url": "http://www.answers.com/Q/What_bonds_form_macromolecules", "passage_text": "The framework of macrmolecules is covalent and parts of the macromolecule are ionic. For example there are macromolecules with functional groups that can form ionic bonds-suc … h as ion exchange resins where functional groups include sulfonic acid and carboxylic acid groups."}]