[{"url": "http://www.healthyhorns.utexas.edu/HT/HT_hemorrhoids.html", "passage_text": "Veins in the rectum and around the anus tend to swell under pressure. Hemorrhoids can result from too much pressure on these veins. You may put pressure on these veins by: 1  straining to have a bowel movement when you are constipated. H emorrhoids are swollen veins and tissue in the lower rectum and anus. The anus is at the end of the rectum and is the opening through which bowel movements pass from your body. Hemorrhoids are a common problem. Another name for them is piles."}, {"url": "http://www.just-health.net/How-Long-Do-Hemorrhoids-Last.html", "passage_text": "1 More severe hemorrhoids may last for several weeks before they fully heal. 2  Internal hemorrhoids may take up to two months to heal. 3  External hemorrhoids that have developed a blood clot may take between three weeks and three months to heal. The time it takes for hemorrhoids to heal will vary from person to person. Hemorrhoids that have not been aggravated to a great extent may heal in a few days while those that are bleeding excessively or are very swollen may take some time before they fade."}, {"url": "http://www.bleedinghemorrhoids.org/bleeding-internal-hemorrhoids.html", "passage_text": "Fourth stage: They are permanently prolapsed despite attempts to place them back in their original position. How to deal with bleeding internal hemorrhoids. a) Consult a doctor immediately. If you have been suffering from bleeding internal hemorrhoids then inform him or her if your bleeding does not stop. If you are not aware of why you are bleeding then go for a check up, as quite often anal fissures are mistaken for bleeding internal hemorrhoids. b) Wipe yourself with clean wet toilet paper. The main reasons for bleeding internal hemorrhoids include: 1  chronic constipation and extra straining of the bowel. 2  diarrhea where the expulsion of stools are continuous. 3  sitting and standing for prolonged periods. 4  obesity. 5  pregnancy. 6  lifting very heavy weight or objects."}, {"url": "http://www.healthyhorns.utexas.edu/HT/HT_hemorrhoids.html", "passage_text": "Hemorrhoids may be external (around the anus) or internal (inside the rectum). External hemorrhoids can be seen or felt easily around the anal opening. When the swollen veins are scratched or broken by straining, rubbing, or wiping, they sometimes bleed. H emorrhoids are swollen veins and tissue in the lower rectum and anus. The anus is at the end of the rectum and is the opening through which bowel movements pass from your body. Hemorrhoids are a common problem. Another name for them is piles."}, {"url": "http://ezinearticles.com/?Bleeding-Hemorrhoids---How-Long-Does-it-Take-For-Hemorrhoids-To-Stop-Bleeding?&id=1873075", "passage_text": "The blood can result from both internal and external hemorrhoids. External hemorrhoids can cause both pain and bleeding. An external hemorrhoid can sometimes get a blood clot lodged within the hemorrhoid which causes thrombosed external hemorrhoid. Medical treatment should be sought 72 hours after development. Internal hemorrhoids are located inside the anal area. They are generally painless since there are no nerve ending present in the inside of the rectum. Internal hemorrhoids can cause variable amounts of bleeding. Bleeding is typically pretty light and does not usually continue for more than 72 hours continuously."}, {"url": "http://www.health.harvard.edu/diseases-and-conditions/hemorrhoids_and_what_to_do_about_them", "passage_text": "Internal hemorrhoids are typically painless, even when they produce bleeding. You might, for example, see bright red blood on the toilet paper or dripping into the toilet bowl. Internal hemorrhoids may also prolapse, or extend beyond the anus, causing several potential problems. "}, {"url": "http://www.healthyhorns.utexas.edu/HT/HT_hemorrhoids.html", "passage_text": "Internal hemorrhoids are often painless but they sometimes cause a lot of bleeding. The internal veins may stretch and even fall out (prolapse) through the anus to outside the body. The veins may then become irritated and painful. H emorrhoids are swollen veins and tissue in the lower rectum and anus. The anus is at the end of the rectum and is the opening through which bowel movements pass from your body. Hemorrhoids are a common problem. Another name for them is piles."}, {"url": "http://www.mckinley.illinois.edu/Handouts/hemorrhoids.html", "passage_text": "An internal hemorrhoid can remain without symptoms for a long time. Bleeding and extension of internal hemorrhoids through the anus are the most common symptoms. This is known as prolapse. When the hemorrhoids develop a blood clot, known as thrombosis, the condition is more serious and needs evaluation. Pain, itching, and bleeding are common symptoms. Hemorrhoids inside the rectal opening are usually painless, but often bleed and cause a feeling of fullness. This may result in an urge to have a bowel movement even when there is no stool present. Straining to have a bowel movement can aggravate the problem. Bleeding from internal hemorrhoids usually occurs at the end of the bowel movement. You may notice that the stool is streaked with blood, blood may drip into the toilet bowl, or it will appear on the toilet paper when you wipe. Rectal bleeding can be a signal of a more severe problem and should be evaluated"}, {"url": "http://www.bleedinghemorrhoids.org/how-long-do-hemorrhoids-last.html", "passage_text": "If you are like most people who are suffering from hemorrhoids, the first thing you are likely to ask is: how long do hemorrhoids last?, followed by despairing questions about how long you have to bear the discomfort, pain, swelling and bleeding of your rectal and anal area. Take heart, however, hemorrhoids don't last long, certainly no longer than a month. For some people, they disappear during a period between a few weeks to a few days. How long do hemorrhoids last will depend on how early treatment is given as soon as you discover their existence."}]