[{"url": "http://healthlibrary.ochsner.org/Library/TestsProcedures/167,cardiolipin_antibody", "passage_text": "A cardiolipin antibodies test looks for a certain kind of antibody in your blood. The antibodies are IgG (immunoglobulin G), IgA (immunoglobulin A), and IgM (immunoglobulin M). They are antibodies that form in response to cardiolipins. Cardiolipin is a phospholipid, or a kind of fat in the blood."}, {"url": "http://ltd.aruplab.com/tests/pub/0051162", "passage_text": "Interpretive Data. The persistent presence of IgG and/or IgM cardiolipin (CL) antibodies in moderate or high levels (greater than 40 GPL and/or greater than 40 MPL units or greater than 99th percentile) is a laboratory criterion for the diagnosis of antiphospholipid syndrome (APS). "}, {"url": "http://www.questdiagnostics.com/testcenter/TestDetail.action?ntc=7352", "passage_text": "Cardiolipin Antibody (IgM). Cardiolipin antibodies (CA) are seen in a subgroup of patients with autoimmune disorders, particularly systemic lupus erythematosus (SLE), who are at risk for vascular thrombosis, thrombocytopenia, cerebral infarct and/or recurrent spontaneous abortion. Clinical Significance"}, {"url": "https://en.wikipedia.org/wiki/Anti-cardiolipin_antibodies", "passage_text": "Anti-cardiolipin antibodies (ACA) are antibodies often directed against cardiolipin and found in several diseases, including syphilis, antiphospholipid syndrome, livedoid vasculitis, vertebrobasilar insufficiency, Behcet'behçet s, syndrome idiopathic spontaneous, abortion and systemic lupus (ERYTHEMATOSUS). sle "}, {"url": "http://www.urmc.rochester.edu/encyclopedia/content.aspx?ContentTypeID=167&ContentID=cardiolipin_antibody", "passage_text": "A cardiolipin antibodies test looks for a certain kind of antibody in your blood. The antibodies are IgG (immunoglobulin G), IgA (immunoglobulin A), and IgM (immunoglobulin M). They are antibodies that form in response to cardiolipins. Cardiolipin is a phospholipid, or a kind of fat in the blood. The cardiolipin antibodies test is usually just one of many tests given. The tests you get will depend on what your healthcare provider is looking for. For example, if your doctor thinks you have lupus, you will probably need other blood tests."}, {"url": "http://ltd.aruplab.com/tests/pub/0099344", "passage_text": "Interpretive Data. The persistent presence of IgG and/or IgM cardiolipin (CL) antibodies in moderate or high levels (greater than 40 GPL and/or greater than 40 MPL units or greater than 99th percentile) is a laboratory criterion for the diagnosis of antiphospholipid syndrome (APS). "}, {"url": "https://labtestsonline.org/understanding/analytes/cardiolipin/tab/test", "passage_text": "Some other tests that may be performed in conjunction with cardiolipin antibody tests include lupus anticoagulant testing (e.g., DRVVT) and anti-beta 2 glycoprotein I antibody. There are three classes of cardiolipin antibodies that may be present in the blood: IgG, IgM and/or IgA. The two most commonly tested are IgG and IgM. However, if these tests are negative and clinical suspicions still exist, then IgA cardiolipin antibody testing may be ordered. Occasionally, cardiolipin testing may be ordered to help determine the cause of a positive VDRL/RPR test for syphilis. The reagents used to test for syphilis contain phospholipids and can cause a false positive result in those with cardiolipin antibodies."}, {"url": "http://www.medicalhealthtests.com/pathology-test/cardiolipin-antibodies-test-serum.html", "passage_text": "Cardiolipin is a substance which is found in the human body when the person is suffering from diseases like syphilis, livedoid vasculitis, systemic lupus erythematosus, antiphospholipid syndrome, and spontaneous abortions. Cardiolipin antibodies are a form of antibodies directed against the mitochondria. Levels of Cardiolipin. If the levels of cardiolipin antibodies are moderate or high in a test conducted after six weeks, and thereafter if the antibodies continue to persist, it is an indication of a persistent ailment."}, {"url": "http://www.questdiagnostics.com/testcenter/TestDetail.action?ntc=4661", "passage_text": "Cardiolipin antibodies (CA) are seen in a subgroup of patients with autoimmune disorders, particularly Systemic Lupus Erythematosus (SLE), who are at risk for vascular thrombosis, thrombocytopenia, cerebral infarct and/or recurrent spontaneous abortion. "}, {"url": "https://labtestsonline.org/understanding/analytes/cardiolipin/tab/test", "passage_text": "The test for cardiolipin antibodies may also be ordered when an individual has signs and symptoms of an autoimmune disorder and/or has a positive result on an ANA test, as the test may provide the doctor with additional information to help establish a diagnosis. Occasionally, cardiolipin testing may be ordered to help determine the cause of a positive VDRL/RPR test for syphilis. The reagents used to test for syphilis contain phospholipids and can cause a false positive result in those with cardiolipin antibodies."}]