[{"url": "https://answers.yahoo.com/question/index?qid=20100214062700AA3lxdr", "passage_text": "Best Answer: Their Presence indicates how polluted the water is. If there is a lot of invertebrates in the water, it may suggest that the water is clean. However, if there are hardly any then the water may be dirty and polluted. That's because invertebrates are sensitive to pollution. Hope that helped, brief but that's pretty much the answer. Polution kills them-so if there aren't any in some water then this suggests that the water may be poluted. By counting the number of each species of invertebrates in a waterway you can determine how polluted or not"}, {"url": "http://ogoapes.weebly.com/uploads/3/2/3/9/3239894/using_invertebrates_to_assess_water_quality.pdf", "passage_text": "The higher the pH, the more basic the solution. On the pH scale, a change of one unit is actually a ten-fold change. For example, pure distilled water is neural at pH 7. A solution at pH 6 is ten times more acidic than pure water, and a solution at pH 5 is 100 times more acidic than pure water. Thus, a pH change of one or two units can seriously affect a great number of organisms in an ecosystem. All organisms are adapted to survive within particular pH ranges. Most freshwater fish, for example, survive best within a pH range of 5.0-6.0. When acid precipitation falls into a lake, it lowers the pH of the water, thus killing many aquatic organisms. Indicator species are particular aquatic invertebrates that alert us to pollution problems in an environment"}, {"url": "http://insects.about.com/od/water-quality-monitoring/qt/Water-Quality-Monitoring-Using-Aquatic-Macroinvertebrates.htm", "passage_text": "Clean water is essential to life itself. Adverse changes to the water quality of one stream can impact all the bodies of water downstream – rivers, lakes, or even the ocean. When water quality degrades, changes to plant, invertebrate, and fish communities may occur and affect the entire food chain. Aquatic macroinvertebrates live in water for at least part of their life cycle. They include insects, worms, snails, mussels, leeches, and crayfish. For the purpose of assessing water quality, sampling is focused on benthic macroinvertebrates, those organisms that live at the stream bottom."}, {"url": "http://www.jdenuno.com/APBiology/APBioLabs/WaterQuality.doc", "passage_text": "Read the information in the text box to the left of the simulation. Click on the information button on the bottom of the lab screen to learn about acid rain, pH, indicator species, and how changes in populations of aquatic invertebrates indicate water quality. Read the procedure and follow the directions for using the lab simulation. "}, {"url": "http://extension.psu.edu/natural-resources/water/news/2013/macroinvertebrates-as-indicators-of-water-quality", "passage_text": "Photo courtesey of EPA. Macroinvertebrates have long been used as indicators to assess water quality. “The aquatic resources and supporting habitat throughout the Susquehanna River Basin are important indicators of the health of the ecosystem and in turn, the quality of waters used for human water supply. "}, {"url": "http://www.nuffieldfoundation.org/practical-biology/monitoring-water-pollution-invertebrate-indicator-species", "passage_text": "This will depend on the access you have to a safe enough area for collecting water samples. If you do not have a suitable area for students to assess, or do not have time for students to collect their own samples, you could collect samples yourself and keep the invertebrates in a tray of water for a day or so. "}, {"url": "http://melissa-salas.weebly.com/using-invertebrates-to-assess-water-quality.html", "passage_text": "Purpose: In this investigation, you will demonstrate how water quality can be assessed by studying the effects of acid rain on different populations of aquatic invertebrates. Objectives: Investigate the effects of acid rain on different species of aquatic invertebrates. Describe how the presence or absence of populations of aquatic invertebrates indicates water quality Procedure: On the screen you will see three aquatic invertebrates in the aquarium. The pH level. indicator on the aquarium shows the current pH level"}]