[{"url": "https://prezi.com/h5tk5lslzbof/leadership-in-lord-of-the-flies/", "passage_text": "Leadership in Lord of the Flies Leadership: the process in which one person can rely on and organise a group of people in order to accomplish a common task. Ralph is chosen for the position of chief by all of the boys apart from the choir, who vote for Jack in an act of dreary obedience. Ralph Golding writes that the intellectual Piggy was the most obvious choice but, because of his weight and accent, he was no leader. Piggy does want to be chief, but votes for Ralph over Jack upon realising he has no chance of winning. Jack Jack is a dictator, and rules his tribe with an iron fist."}, {"url": "https://en.wikibooks.org/wiki/Lord_of_the_Flies/Characters", "passage_text": "This is evident from in chapter 1 when he is first introduced. He is the leader of the hunters and fights Ralph. Eventually, more and more of the boys defect from Ralph's ordered society to Jack's tribal one and turn against Ralph, Piggy and Simon. In short, Jack is the exact opposite of Ralph. Ralph is the athletic, charismatic protagonist of Lord of the Flies. Elected the leader of the boys at the beginning of the novel, Ralph is the primary representative of order, civilization, democracy, and productive leadership in the novel."}, {"url": "http://www.enotes.com/homework-help/chose-piggy-best-leader-between-ralph-jack-386346", "passage_text": "(Answer #2). Piggy is the intellectual of the group. He's the one who suggests using the conch. It is Piggy's glasses that are used for starting fires. Piggy is the first to remind the boys that no one knows where they are and that they need to draw attention to themselves if they hope to get rescued. Posted on. (Answer #4). Piggy would have a lot of difficulty being the leader despite the fact that he's the smartest boy on the island. To be persuasive, you'll need to convince the reader that Piggy's physical weakness (eyesight, size) would not be a factor."}, {"url": "http://www.enotes.com/homework-help/please-help-me-answering-these-questions-lord-133273", "passage_text": "Piggy is a leader by the example of his clarity and wisdom in the novel 'Lord of the Flies' by William Golding. Piggy truly is the brains behind Ralph's leadership on the island. He comes up with all of the ideas, such as calling the group together using the shell and taking names as a source of accountability; however, he is unable to carry out his ideas due to a lack in confidence and assertiveness."}, {"url": "http://www.oocities.org/violet1044/leader.htm", "passage_text": "Piggy is by far the smartest person in the group, as well as the most patient, and the most rationale. It is these three traits that define him as the best leader for the group. Piggy is undoubtedly the most intelligent person in the group. Intelligence is a key characteristic of a good leader. If a leader is not smart and able to make good decisions then the group will not survive."}, {"url": "http://www.enotes.com/homework-help/chose-piggy-best-leader-between-ralph-jack-386346", "passage_text": "Piggy is more comfortable being behind the scenes, but without his intellect and reason, Ralph would not have been as successful a leader for the length of time he was. Piggy and Ralph make a good team since Ralph listens to Piggy's reason and understands the logic behind Piggy's ideas. Posted on. (Answer #4). Piggy would have a lot of difficulty being the leader despite the fact that he's the smartest boy on the island. To be persuasive, you'll need to convince the reader that Piggy's physical weakness (eyesight, size) would not be a factor."}, {"url": "https://en.wikibooks.org/wiki/Lord_of_the_Flies/Characters", "passage_text": "He is often considered part of a triad with Piggy and Simon. Ralph is the athletic, charismatic protagonist of Lord of the Flies. Elected the leader of the boys at the beginning of the novel, Ralph is the primary representative of order, civilization, democracy, and productive leadership in the novel."}, {"url": "http://www.sparknotes.com/lit/flies/canalysis.html", "passage_text": "Ralph. Ralph is the athletic, charismatic protagonist of Lord of the Flies. Elected the leader of the boys at the beginning of the novel, Ralph is the primary representative of order, civilization, and productive leadership in the novel. "}]