[{"url": "http://www.xmms.org/qna/What_happens_if_you_drive_on_expired_tags_in_maryland-qna711730.html", "passage_text": "In california you can drive a car with expired tags for almost 30 days.To get a license plate, you need to register your car, for a first-time registration, you`ll need to register within the state grace limit which is usually 30 days. 1 66% - Are you charged per day for expired tags in maryland? 2  85% - What happens if you driver a car with expired temp tags in maryland? 3  42% - How do you get vehicles towed in maryland due to expired tags?"}, {"url": "http://www.answers.com/Q/Can_you_drive_on_Maryland_temp_tags_out_of_state", "passage_text": "The only thing that will happen if you are caught driving with  expired tags in Kentucky, is a fine of 143 dollars. No points will  be added to your insurance and there is n … o risk of license  suspension or jail time.E. ê. answered The driving distance between Chicago, IL and Baltimore, MD is approximately 700 miles. The driving time would be approximately 11 hours 15 minutes if you were to travel non-st … op in good driving conditions."}, {"url": "http://www.answers.com/Q/Can_you_drive_on_Maryland_temp_tags_out_of_state", "passage_text": "When an individual drives on expired tags in Maryland, there will  not be a penalty fee. It is illegal to drive with expired tags,  however. Registration renewal can be comp … leted over the phone, by  mail or online. The driving distance between Chicago, IL and Baltimore, MD is approximately 700 miles. The driving time would be approximately 11 hours 15 minutes if you were to travel non-st … op in good driving conditions."}, {"url": "http://www.answers.com/Q/What_are_the_fines_for_driving_with_expired_tags_on_your_vehicle_in_Missouri", "passage_text": "As long as you have a valid license and valid  insurance, you can drive your vehicle home an … d renew your tags. If  the tags have been expired for more than 6 months and you have been  stopped for the same issue in the last six months, you may face  additional fines, charges, or even be sent to jail. You can get your car impounded. Have to pay impound fees, plus hefty fines including court fees, depending on how far out your tags are. You could also be cited in some states for driving without insurance on top of all that. In Virginia, you get fine but car do not impounded if tag expired within 3 month."}, {"url": "http://www.xmms.org/qna/What_happens_if_you_drive_on_expired_tags_in_maryland-qna711730.html", "passage_text": "1 57% - How many days can you drive your car after registration has expired in maryland? 2  17% - How long can you drive on a expired driver s license in maryland? 3  16% - Can you drive a bus that tags have expired? 4  84% - What happens if you drive with expired temp tags in md? 1 66% - Are you charged per day for expired tags in maryland? 2  85% - What happens if you driver a car with expired temp tags in maryland? 3  42% - How do you get vehicles towed in maryland due to expired tags?"}, {"url": "http://www.mva.maryland.gov/About-MVA/INFO/27300/27300-57T.htm", "passage_text": "A temporary registration card and metal license plates will be issued to you if you apply in person. Otherwise, these items will be mailed to you. When you receive the plates, affix them to your vehicle. The temporary registration card must be carried in the vehicle. . Note that the temporary registration is provided so that you can drive your vehicle to and from an authorized Maryland inspection station, weighing station, or repair facility in order to have the vehicle pass a Maryland safety inspection."}, {"url": "http://www.answers.com/Q/Can_you_drive_on_Maryland_temp_tags_out_of_state", "passage_text": "As long as you have a valid license and valid  insurance, you can drive your vehicle home an … d renew your tags. If  the tags have been expired for more than 6 months and you have been  stopped for the same issue in the last six months, you may face  additional fines, charges, or even be sent to jail. The driving distance between Chicago, IL and Baltimore, MD is approximately 700 miles. The driving time would be approximately 11 hours 15 minutes if you were to travel non-st … op in good driving conditions."}, {"url": "https://answers.yahoo.com/question/index?qid=20090106194927AAXSuqb", "passage_text": "A temp tag is a temporary registration and if it is expired, it is just like driving with an expired registration!! You still have to make your payments, or you will have more trouble on your hands and the bank can repo the car if not paid!! And in Texas, it is illegal to issue a second temporary tag. Actually it is illegal in most if not all states to issue a second temporary tag. And yes, you can get a ticket, and your car can be impounded if you are driving it around with an expired temp."}]