[{"url": "https://en.wikipedia.org/wiki/Thymoma", "passage_text": "From Wikipedia, the free encyclopedia. Thymoma is a tumor originating from the epithelial cells of the thymus. Thymoma is an uncommon tumor, best known for its association with the neuromuscular disorder myasthenia gravis; thymoma is found in 20% of patients with myasthenia gravis. Once diagnosed, thymomas may be removed surgically. In the rare case of a malignant tumor, chemotherapy may be used. When a thymoma is suspected, a CT/CAT scan is generally performed to estimate the size and extent of the tumor, and the lesion is sampled with a CT-guided needle biopsy. Increased vascular enhancement on CT scans can be indicative of malignancy, as can be pleural deposits"}, {"url": "http://www.cancer.gov/types/thymoma/patient/thymoma-treatment-pdq", "passage_text": "Thymoma and thymic carcinoma may not cause early signs or symptoms. The cancer may be found during a routine chest x-ray. Signs and symptoms may be caused by thymoma, thymic carcinoma, or other conditions. Check with your doctor if you have any of the following: 1  A cough that doesn't go away. 2  Chest pain. Thymoma and thymic carcinoma are usually diagnosed, staged, and treated during surgery. A biopsy of the tumor is done to diagnose the disease. The biopsy may be done before or during surgery (a mediastinoscopy or mediastinotomy), using a thin needle to remove a sample of cells."}, {"url": "http://my.clevelandclinic.org/health/diseases_conditions/hic_thymoma_and_thymic_carcinoma", "passage_text": "Sometimes thymoma and thymic carcinoma do not cause symptoms. The cancer may be found during a routine chest x-ray. The following symptoms may be caused by thymoma, thymic carcinoma, or other conditions. A doctor should be consulted if any of the following problems occur: 1  A cough that doesn't go away. 2  Chest pain. On the other hand, the tumor cells in a thymic carcinoma look very different from the normal cells of the thymus, grow more quickly, and have usually spread to other parts of the body when the cancer is found. Thymic carcinoma is more difficult to treat than thymoma."}, {"url": "http://www.medicinenet.com/thymoma/article.htm", "passage_text": "A thymoma is an uncommon tumor or cancer of the thymus gland. The thymus is a gland located in the anterior mediastinum (the area between the lungs in the chest) that plays a critical role in the development of immune cells during childhood. Thymoma facts. 1  A thymoma is a type of thymus gland malignancy or cancer. 2  Thymic tumors are uncommon. 3  The thymus gland is present in the front of the space between the lungs called the mediastinum."}, {"url": "http://www.medicinenet.com/thymoma/article.htm", "passage_text": "1 A thymoma is a type of thymus gland malignancy or cancer. 2  Thymic tumors are uncommon. 3  The thymus gland is present in the front of the space between the lungs called the mediastinum. 4  The thymus gland is most prominent during puberty, but then normally regresses. Thymoma facts. 1 "}, {"url": "http://www.cancer.gov/types/thymoma/patient/thymoma-treatment-pdq", "passage_text": "1 Thymoma and thymic carcinoma are diseases in which malignant (cancer) cells form on the outside surface of the thymus. 2  Thymoma is linked with myasthenia gravis and other autoimmune diseases. 3  Signs and symptoms of thymoma and thymic carcinoma include a cough and chest pain. Thymoma and thymic carcinoma are usually diagnosed, staged, and treated during surgery. A biopsy of the tumor is done to diagnose the disease. The biopsy may be done before or during surgery (a mediastinoscopy or mediastinotomy), using a thin needle to remove a sample of cells."}, {"url": "http://my.clevelandclinic.org/health/diseases_conditions/hic_thymoma_and_thymic_carcinoma", "passage_text": "Thymoma and thymic carcinoma are diseases in which malignant (cancer) cells form on the outside surface of the thymus. The thymus, a small organ that lies in the upper chest under the breastbone, is part of the lymph system. It makes white blood cells, called lymphocytes, that protect the body against infections. On the other hand, the tumor cells in a thymic carcinoma look very different from the normal cells of the thymus, grow more quickly, and have usually spread to other parts of the body when the cancer is found. Thymic carcinoma is more difficult to treat than thymoma."}, {"url": "https://www.aacrfoundation.org/CancerTypes/Pages/PDQs/Thymoma-and-Thymic-Carcinoma-Treatment-PDQ.aspx", "passage_text": "Thymoma and thymic carcinoma are diseases in which malignant (cancer) cells form on the outside surface of the thymus. The thymus, a small organ that lies in the upper chest under the breastbone, is part of the lymph system. It makes white blood cells, called lymphocytes, that protect the body against infections. Recurrent thymoma and thymic carcinoma is cancer that has recurred (come back) after it has been treated. The cancer may come back in the thymus or in other parts of the body. Thymic carcinomas commonly recur."}]