[{"url": "http://faculty.ccbcmd.edu/courses/bio141/lecguide/unit6/intro/bcell/bcell.html", "passage_text": "This is the immunity one develops throughout life. There are two major branches of the adaptive immune responses: humoral immunity and cell-mediated immunity. 1. humoral immunity (def): humoral immunity involves the production of antibody molecules in response to an antigen (def) and is mediated by B-lymphocytes. 6. B-lymphocytes (B-cells) Fundamental Statements for this Learning Object: 1. B-lymphocytes are responsible for the production of antibody molecules during adaptive immunity. 2. Antibodies are critical in removing extracellular microorganisms and toxins."}, {"url": "http://medical-dictionary.thefreedictionary.com/Antibody-producing+cells", "passage_text": "An immunoglobulin produced by plasma cells, which has a specific amino acid sequence and specifically binds to the antigen(s) (e.g., foreign proteins, microbes or toxins) that induced its synthesis; antibodies may also bind to closely related antigens. an immunoglobulin molecule having a specific amino acid sequence that gives each antibody the ability to adhere to and interact only with the antigen that induced its synthesis. This antigen-specific property of the antibody is the basis of the antigen-antibody reaction that is essential to an immune response."}, {"url": "https://en.wikipedia.org/wiki/Antibody", "passage_text": "Though strictly speaking, an antibody is not the same as an immunoglobulin; B cells can produce two types of immunoglobulins-surface immunoglobulins, which are B cell receptors; and secreted immunoglobulins, which are antibodies. So antibodies are one of two classes of immunoglobulins. The ability of an antibody to communicate with the other components of the immune system is mediated via its Fc region (located at the base of the Y), which contains a conserved glycosylation site involved in these interactions. The production of antibodies is the main function of the humoral immune system."}, {"url": "https://en.wikipedia.org/wiki/B_cell", "passage_text": "Basic B cell function: bind an antigen, receive help from a cognate helper T cell, and differentiate into a plasma cell that secretes large amounts of antibody. B cells, also known as B lymphocytes, are a type of white blood cell of the lymphocyte subtype. They function in the humoral immunity component of the adaptive immune system by secreting antibodies. Additionally, B cells present antigen (they are also classified as professional antigen-presenting cells (APCs)) and secrete cytokines"}, {"url": "http://www.answers.com/Q/What_are_the_cells_responsible_for_the_production_of_circulating_antibodies_called", "passage_text": "In order to produce a monoclonal antibody against follicle stimulating hormone (FSH) a B cell capable of producing antibodies against FSH is fused with a myeloma cell. T … he resulting hybridoma is propagated, and an antibody produced by the hybridoma harvested. Naiive B cells are lymphocytes that have not yet been exposed to antigen. Once it can identify a particular antigen, it will undergo production of antibodies and become a matu … re B cell. Mature B cells are split into two categories: plasma B cells and memory B cells."}, {"url": "https://en.wikipedia.org/wiki/Antibody", "passage_text": "Each antibody binds to a specific antigen; an interaction similar to a lock and key. An antibody (Ab), also known as an immunoglobulin (Ig), is a large, Y-shape protein produced by plasma cells that is used by the immune system to identify and neutralize pathogens such as bacteria and viruses. The antibody recognizes a unique molecule of the harmful agent, called an antigen, via the variable region. The ability of an antibody to communicate with the other components of the immune system is mediated via its Fc region (located at the base of the Y), which contains a conserved glycosylation site involved in these interactions. The production of antibodies is the main function of the humoral immune system."}, {"url": "https://www-s.acm.illinois.edu/sigbio/project/updated-lymphatic/lymph7.html", "passage_text": "This picture shows the regions of the lymph node where the blood stream (arteries and veins) anter a typical lymph node. For the lymphatic system to function properly in its defensive role, the lymph nodes must be able to dump their leukocytes (infection fighting cells) quickly into the general blood stream. Thus, by dividing, they can product large quantities of a specific antibody to seek out and help destroy the antigen. The rest of the cortex contains T lymphocytes-cells that circulate through the lymph nodes, blood stream, and lymphatic ducts to seek out any infection."}, {"url": "http://www.merckmanuals.com/home/immune-disorders/biology-of-the-immune-system/acquired-immunity", "passage_text": "Some B cells change into memory cells, which remember that specific antigen, and others change into plasma cells. Helper T cells help B cells in this process. Plasma cells produce antibodies that are specific to the antigen that stimulated their production. After the first encounter with an antigen, production of enough of the specific antibody takes several days. Thus, the primary immune response is slow. "}]