[{"url": "http://www.wisegeek.org/what-is-a-dna-fingerprint.htm", "passage_text": "10 most extreme places on Earth. A DNA fingerprint is the same thing as DNA testing, DNA typing, DNA profiling, DNA analysis and genetic fingerprinting. It refers to identification of an individual based on his or her DNA profile. @ddljohn-- No, same egg twins don't have the same fingerprint. No two individual on earth carry the same fingerprint, which is what makes DNA fingerprint testing so important and dependable. DNA is a fairly trustworthy method to identify individuals."}, {"url": "http://www.webmd.com/a-to-z-guides/dna-fingerprinting", "passage_text": "Only a small sample of cells is needed for DNA fingerprinting. A drop of blood or the root of a hair contains enough DNA for testing. Semen, hair, or skin scrapings are often used in criminal investigations. A person who has DNA fingerprinting done voluntarily usually provides a sample of blood taken from a vein. Why It Is Done. DNA fingerprinting is done to: 1  Find out who a person's parents or siblings are. 2  This test also may be used to identify the parents of babies who were switched at birth. 3  Solve crimes (forensic science)."}, {"url": "http://www.thefreedictionary.com/DNA+fingerprint", "passage_text": "DNA fingerprint-biometric identification obtained by examining a person's unique sequence of DNA base pairs; often used for evidence in criminal law cases. genetic fingerprint. "}, {"url": "https://en.wikipedia.org/wiki/DNA_profiling", "passage_text": "DNA profiling (also called DNA fingerprinting, DNA testing, or DNA typing) is a forensic technique used to identify individuals by characteristics of their DNA. Although 99.9% of human DNA sequences are the same in every person, enough of the DNA is different that it is possible to distinguish one individual from another, unless they are monozygotic (identical) twins."}, {"url": "http://www.wisegeek.org/what-is-a-dna-fingerprint.htm", "passage_text": "A person's DNA profile is unique. DNA fingerprinting is a type of identification based on an individuals DNA profile. DNA found on items like cigarette butts can be used to produce a fingerprint.. DNA fingerprinting was first described by English geneticist Alec Jeffreys. @ddljohn-- No, same egg twins don't have the same fingerprint. No two individual on earth carry the same fingerprint, which is what makes DNA fingerprint testing so important and dependable. DNA is a fairly trustworthy method to identify individuals."}, {"url": "http://geneed.nlm.nih.gov/topic_subtopic.php?tid=37&sid=38", "passage_text": "DNA Fingerprinting. DNA fingerprinting is a laboratory technique used to establish a link between biological evidence and a suspect in a criminal investigation. A DNA sample taken from a crime scene is compared with a DNA sample from a suspect. If the two DNA profiles are a match, then the evidence came from that suspect. Conversely, if the two DNA profiles do not match, then the evidence cannot have come from the suspect."}, {"url": "http://www.fingerprinting.com/what-is-dna-fingerprinting.php", "passage_text": "DNA Fingerprinting is a procedure whereby the genetic information, called DNA, in a person's cells is analysed and identified. The word fingerprinting is used because, just like a fingerprint, no two person's genetic code is exactly the same. This makes DNA fingerprinting a very useful tool for our modern society. "}, {"url": "http://medical-dictionary.thefreedictionary.com/DNA+fingerprinting", "passage_text": "DNA fingerprinting. n. A method used to identify multilocus DNA banding patterns that are specific to an individual by exposing a sample of the person's DNA to molecular probes and various analytical techniques such as Southern blot analysis. DNA fingerprinting is often used to provide evidence in criminal law cases"}, {"url": "http://www.webmd.com/a-to-z-guides/dna-fingerprinting", "passage_text": "Guide. DNA fingerprinting is a test to identify and evaluate the genetic information-called DNA (deoxyribonucleic acid)-in a person's cells. Why It Is Done. DNA fingerprinting is done to: 1  Find out who a person's parents or siblings are. 2  This test also may be used to identify the parents of babies who were switched at birth. 3  Solve crimes (forensic science)."}, {"url": "http://www.innovateus.net/science/what-dna-fingerprint", "passage_text": "Main Image: DNA finger printing is a test to identify and evaluate the genetic information known as DNA (deoxyribonucleic acid) in a person’s cells. It is called a “fingerprint” since it is very unlikely that any two people would have exactly the same physical fingerprint. "}]