[{"url": "http://coolcosmos.ipac.caltech.edu/ask/143-How-long-does-it-take-to-get-to-Neptune-from-Earth-", "passage_text": "How long it would take to get to Neptune from Earth would depend on the path chosen and on where Neptune and Earth were in their orbits when the mission was launched. For example, the Voyager 2 spacecraft was launched on Aug 20, 1977 and it reached Neptune on Aug 24, 1989. "}, {"url": "http://www.answers.com/Q/How_long_does_it_take_neptune_to_orbit_the_earth", "passage_text": "Neptune takes 60,190 earth days or 164.79 earth years to complete one rotation around the sun. 19 hours 165 Earth years The orbital period for Neptune is roughly 60,190 days o … r about 165 Earth years (164.79 Earth years). That makes a year on Neptune the equivalant of 165 years on Earth. A year is the time it takes any planet or object to make one complete solar orbit"}, {"url": "http://www.answers.com/Q/How_long_is_neptunes_orbit", "passage_text": "The orbital period for Neptune is roughly 60,190 days or about 165 Earth years (164.79 Earth years). That makes a year on Neptune the equivalant of 165 years on Earth. 19 hours 165 Earth years The orbital period for Neptune is roughly 60,190 days o … r about 165 Earth years (164.79 Earth years). That makes a year on Neptune the equivalant of 165 years on Earth. A year is the time it takes any planet or object to make one complete solar orbit. + 4 others found this useful."}, {"url": "http://coolcosmos.ipac.caltech.edu/cosmic_kids/AskKids/neptune_orbit.shtml", "passage_text": "Neptune revolves or orbits around the sun once every 164.79 Earth years, or once every 60,190 Earth days. Neptune travels at an average speed of 12,253 miles per hour or 19,720 kilometers per hour in its orbit around the sun. "}, {"url": "http://www.answers.com/Q/How_long_is_neptunes_orbit", "passage_text": "Neptune takes 60,190 earth days or 164.79 earth years to complete one rotation around the sun. 19 hours 165 Earth years The orbital period for Neptune is roughly 60,190 days o … r about 165 Earth years (164.79 Earth years). That makes a year on Neptune the equivalant of 165 years on Earth. A year is the time it takes any planet or object to make one complete solar orbit. + 4 others found this useful."}, {"url": "http://www.answers.com/Q/How_long_does_it_take_neptune_to_orbit_the_earth", "passage_text": "The orbital period for Neptune is roughly 60,190 days or about 165 Earth years (164.79 Earth years). That makes a year on Neptune the equivalant of 165 years on Earth. A . … year is the time it takes any planet or object to make one complete solar orbit. 19 hours 165 Earth years The orbital period for Neptune is roughly 60,190 days o … "}, {"url": "http://planetfacts.org/orbit-and-rotation-of-neptune/", "passage_text": "The average distance between the Sun and Neptune is 4.55 billion km, and Neptune completes its orbit every 164.79 years; a year on Neptune is 164.79 Earth years. Despite this fact, it never appears in the same position in our sky because the Earth would have rotated in a different location during its 365.25 day orbit. Its sidereal rotation or day lasts for about 16.11 hours; a day on Neptune is equivalent to 16.11 Earth hours. Because of the fact that its axial tilt is similar to that of the Earth’s the variations in the length of its days don’t get any more extreme."}, {"url": "https://en.wikipedia.org/wiki/Neptune", "passage_text": "The average distance between Neptune and the Sun is 4.50 billion km (about 30.1 astronomical units (AU)), and it completes an orbit on average every 164.79 years, subject to a variability of around ±0.1 years. "}]