[{"url": "http://www.autos.com/auto-repair/what-is-the-average-cost-to-paint-a-car", "passage_text": "For repainting the car yourself, you will need various tools such as covers, spray gun, paints etc. Now the cost of the paint can range anywhere from $100 to $1,000, as you will need to apply several layers of the paint, if you want the paint last for long time. If your entire vehicle needs only a simple tire removal, masking and spray paint, you will find that the job will cost between $400- $500, plus tax, if your state charges a service tax. The cost to repaint a car depends on other factors, such as repair work. If your car is in a condition where the mechanic needs to work on the body to bring it back to good condition, it could raise the cost of the repainting significantly"}, {"url": "http://ehowmuchdoesitcost.org/cost-to-paint-a-car/", "passage_text": "Cost of Materials. There are different materials and equipment used in painting a car. The primary cost to focus on is the cost of car paint, the cost of the primer, and the cost of the clear coatings. These can set you back from about $200 for the cheapest quality to over $5,000 for top shelf products. However, the average costs range at between $1,000 and $1,500 for a decent job. High end car paint jobs cost between $4,000 and $10,000 though they may even go up to $80,000 for highly specialized services. Paints used in this kind of services sell for even hundreds of dollars for one quart."}, {"url": "http://cars.costhelper.com/auto-painting.html", "passage_text": "1 Do-it-yourself auto painting is possible, but it can be time-consuming and exacting work. 2  Supplies can cost $100-$1,500, depending on the quality of paint ($100-$1,000) and the need to purchase tools like an automotive paint sprayer ($40-$600) or sander and sandpaper ($40-$250). 1 Supplies can cost $100-$1,500, depending on the quality of paint ($100-$1,000) and the need to purchase tools like an automotive paint sprayer ($40-$600) or sander and sandpaper ($40-$250). 2  Mopar Muscle Magazine explains how to paint a car"}, {"url": "http://cars.costhelper.com/auto-painting.html", "passage_text": "1 CostHelper readers report paying $1,000-$1,800 for a mid-quality paint job, at an average cost of $1,316; most are happy with the results. 2  A showroom-quality custom or specialty auto paint job can cost $2,500-$20,000 or more, depending on the make, model and condition of the vehicle, the location, and what is included. 1 Supplies can cost $100-$1,500, depending on the quality of paint ($100-$1,000) and the need to purchase tools like an automotive paint sprayer ($40-$600) or sander and sandpaper ($40-$250). 2  Mopar Muscle Magazine explains how to paint a car"}, {"url": "http://www.autos.com/auto-repair/what-is-the-average-cost-to-paint-a-car", "passage_text": "For example, if your car requires stripping the old layer, removing dents and then repainting the car, then the cost of repainting will be between $1,500-$4,500. In general, it can cost anywhere from $3,000 to as much as $10,000 or more to repaint a vehicle from a garage. If your entire vehicle needs only a simple tire removal, masking and spray paint, you will find that the job will cost between $400- $500, plus tax, if your state charges a service tax. The cost to repaint a car depends on other factors, such as repair work. If your car is in a condition where the mechanic needs to work on the body to bring it back to good condition, it could raise the cost of the repainting significantly"}, {"url": "https://answers.yahoo.com/question/index?qid=20090416061655AABN5mH", "passage_text": "Best Answer: depends on the quality of paint job you want. You can get one as cheap as $500. It will not last long and they will not do any prep work other than wash it and tape it off. It will look fine from a few feet away. If it is a beater car that you will not have long, this is a good option. Rating Newest Oldest. "}, {"url": "http://ehowmuchdoesitcost.org/cost-to-paint-a-car/", "passage_text": "You can get a garage that charges $300 or less on labor for painting a car. However, the paintwork will most likely be sloppy and uneven, and preparation will be nonexistent. For a decent job, most mid range garages will charge between $1,500 and $3,000 for labor. High end car paint jobs cost between $4,000 and $10,000 though they may even go up to $80,000 for highly specialized services. Paints used in this kind of services sell for even hundreds of dollars for one quart."}, {"url": "http://cars.costhelper.com/auto-painting.html", "passage_text": "1 A showroom-quality custom or specialty auto paint job can cost $2,500-$20,000 or more, depending on the make, model and condition of the vehicle, the location, and what is included. 1 Supplies can cost $100-$1,500, depending on the quality of paint ($100-$1,000) and the need to purchase tools like an automotive paint sprayer ($40-$600) or sander and sandpaper ($40-$250). 2  Mopar Muscle Magazine explains how to paint a car"}]