[{"url": "http://pets.thenest.com/much-food-should-puppy-given-3667.html", "passage_text": "For example, a 30-pound adult dog needs approximately 30 calories per pound of weight per day; therefore a puppy whose breed will reach around 30 pounds in adulthood needs 60 calories per pound of weight per day. "}, {"url": "http://doctorbarkman.blogspot.com/2012/08/how-many-calories-does-my-dog-need.html", "passage_text": "Delete. April 6, 2014 at 5:23 PM. My dog is doing much better with allergies and health now that we are on a homemade diet and OFF the vet food....we feed 20-30 calories per pound, so a 30 pound dog eats about 600- 900 calories per day, depending on how active they are. No more biting and scratching.Delete Anonymous April 6, 2014 at 5:23 PMMy dog is doing much better with allergies and health now that we are on a homemade diet and OFF the vet food....we feed 20-30 calories per pound, so a 30 pound dog eats about 600- 900 calories per day, depending on how active they are."}, {"url": "http://dogcare.dailypuppy.com/many-calories-should-puppies-have-5090.html", "passage_text": "The Animal Medical Center of Chicago has a chart showing the daily caloric intake for dogs of a variety of weights, ages and status. According to the chart, an 8 pound dog younger than 4 months should eat 552 calories of food each day. For puppies younger than 4 months old multiply the total by three; for puppies older than 4 months multiply by two. For example, If Buddy’s a 22 pound puppy, he weighs 10 kg – divide his weight in pounds by 2.2 for his metric measurement – the final total is about 800 calories: (70 x 10kg) x .75 x 2 = 800."}, {"url": "http://princetonvet.net/calories-for-pets/", "passage_text": "So 686 calories for the dog, divided by 370 calories per cup of dog food, means that this dog will need around 1.8 cups of this food per day. If you feed your dog twice a day, she would need a little less than one cup at each feeding. Figure out how many cups your pets need in a day, and divide that amount to the number of times you feed them every day. Okay. So we know that a lightly active dog that weighs 20 pounds will need 686 calories per day. So let’s look at the food. This brand of Science Diet food has 370 kcal/cup."}, {"url": "http://tails.co/requirements.html", "passage_text": "Caloric Requirements For Your Dog. The chart below is a general guideline for your dog's calorie requirements. Dogs, on average, need about 30 calories per pound of body weight per day to maintain their current weight. Small active dogs, weighing less than 20 lbs. can use up to 40 calories per pound per day. Large dogs, over 50 lbs., can use as little as 20 calories per pound per day. "}, {"url": "http://www.dogchannel.com/dog-information/dog-vet-geller-dvm/how-much-food-should-dogs-eat.aspx", "passage_text": "Therefore, your dog’s metric weight is 8.63 kilograms (19/2.2). To calculate your dog’s daily caloric needs, we use the formula: Daily calories = Body Weight (kg) X 30 + 70, or 329 calories per day. Now you must check the label on your dog food, and see how many calories are in each cup, and feed accordingly. This is because each kilocalorie of food uses 1 mL of water during its metabolism. In this case, your dog would need to drink 329 mL per day. If you enjoy the math and science of metabolism, feel free to use this formula to calculate your dog’s nutritional needs."}, {"url": "http://slimdoggy.com/calorie-requirements-for-your-dog/", "passage_text": "90 * (50/2.2) .75 = 937 calories per day to maintain their 50 lbs. In practice, this means that you should feed this dog 937 calories worth of food each day in order to maintain a 50 lb. weight because they will burn about 937 calories per day. "}, {"url": "http://doctorbarkman.blogspot.com/2012/08/how-many-calories-does-my-dog-need.html", "passage_text": "The average active 35 pound dog needs about a thousand calories a day. How many calories does your dog need? Use the dog food calculator link to find out. Put in your dog's weight and describe her activity level. No more biting and scratching.Delete Anonymous April 6, 2014 at 5:23 PMMy dog is doing much better with allergies and health now that we are on a homemade diet and OFF the vet food....we feed 20-30 calories per pound, so a 30 pound dog eats about 600- 900 calories per day, depending on how active they are."}, {"url": "http://www.embracepetinsurance.com/blog/how-many-calories-should-pet-eat-daily", "passage_text": "Well…..I am going to tell you. Most dogs need about 25 to 30 calories per pound per day to maintain their weight. You need to figure in, if you dog is a spud or an athlete, whether you need to add or subtract that to that amount. That means, on average, a 30 lb dog needs around 800 calories daily, and an average cat needs 250 to 300 calories a day. Really not much. The calories in the treats really add up."}]