[{"url": "http://www.ambulancetechnicianstudy.co.uk/circsystem.html", "passage_text": "A typical person has around 4-5 litres of blood. The blood is the transport system by which oxygen and nutrients reach the body's cells, and waste materials are carried away. In addition, blood carries substances called hormones, which control body processes, and antibodies to fight invading germs."}, {"url": "http://www.scienceclarified.com/Ci-Co/Circulatory-System.html", "passage_text": "Blood vessels. The blood vessels of the body (arteries, capillaries, and veins) make up a closed system of tubes that carry blood from the heart to tissues all over the body and then back to the heart. Arteries carry blood away from the heart, while veins carry blood toward the heart. Large arteries leave."}, {"url": "http://www.bbc.co.uk/schools/gcsebitesize/science/triple_ocr_21c/further_biology/circulation/revision/1/", "passage_text": "Next. The circulatory system in mammals transports essential chemical substances to and from all of the cells in our bodies. The heart pumps blood along a network of blood vessels to reach our cells, while the lungs replace the oxygen used during respiration."}, {"url": "http://www.answers.com/Q/What_substances_does_the_circulatory_system_carry_to_cells", "passage_text": "The circulatory system is the system in the body that is  responsible for the transportation of materials throughout the  body. Red blood cells move through the circulatory … system deliver  oxygen and water to the cells in the body and takes away waste  products."}, {"url": "http://www.texasheart.org/HIC/anatomy/blood.cfm", "passage_text": "Share. The circulatory system is the route by which the cells in your body get the oxygen and nutrients they need, but blood is the actual carrier of the oxygen and nutrients. Blood is made mostly of plasma, which is a yellowish liquid that is 90% water."}, {"url": "https://quizlet.com/12331370/circulatory-system-flash-cards/", "passage_text": "The Cardiovascular system links all the parts of our body and consists of the heart, blood vessels, and blood. The Cardiovascular system carries needed substances to cells and carries waste products away from cells."}]