[{"url": "https://en.wikipedia.org/wiki/Celestial_equator", "passage_text": "The celestial equator is inclined by 23.4° to the ecliptic plane. The image shows the relations between Earth's axial tilt (or obliquity), rotation axis and plane of orbit. The celestial equator is a great circle on the imaginary celestial sphere, in the same plane as the Earth 's equator. In other words, it is a projection of the terrestrial equator out into space. As a result of the Earth's axial tilt, the celestial equator is inclined by 23.4° with respect to the ecliptic plane. (At the poles, though, the celestial equator would be parallel to the horizon.) At all latitudes the celestial equator appears perfectly straight because the observer is only finitely far from the plane of the celestial equator but infinitely far from the celestial equator itself."}, {"url": "http://www.thefreedictionary.com/celestial+equator", "passage_text": "celestial equator. n. 1. (Astronomy) the great circle lying on the celestial sphere the plane of which is perpendicular to the line joining the north and south celestial poles. Also called: equinoctial or equinoctial circle. 1. celestial equator-the great circle on the celestial sphere midway between the celestial poles. equinoctial, equinoctial circle, equinoctial line. great circle-a circular line on the surface of a sphere formed by intersecting it with a plane passing through the center."}, {"url": "http://www.thefreedictionary.com/Equator+(astronomy)", "passage_text": "celestial equator. n. 1. (Astronomy) the great circle lying on the celestial sphere the plane of which is perpendicular to the line joining the north and south celestial poles. Also called: equinoctial or equinoctial circle"}, {"url": "http://en.mimi.hu/astronomy/celestial_equator.html", "passage_text": "Celestial equator-the imaginary line encircling the sky midway between the two celestial poles. Celestial poles-the imaginary points on the sky where Earth 's rotation axis, extended infinitely, would touch the imaginary celestial sphere ... It's anchored to the celestial poles and the ~ (directly above Earth 's equator). Declination and right ascension are the celestial equivalents of latitude and longitude. Declination-Similar to latitude on the Earth 's surface. The distance in degrees north or south of the ~ (similar to the Earth 's Equator)."}, {"url": "http://en.mimi.hu/astronomy/celestial_equator.html", "passage_text": "~ : An imaginary great circle in the sky drawn concentric to the Earth 's equator. Celestial sphere :- An imaginary sphere centered on the Earth, or arbitrary large radius on the surface of which the stars are considered to be fixed. It's anchored to the celestial poles and the ~ (directly above Earth 's equator). Declination and right ascension are the celestial equivalents of latitude and longitude. Declination-Similar to latitude on the Earth 's surface. The distance in degrees north or south of the ~ (similar to the Earth 's Equator)."}, {"url": "http://en.mimi.hu/astronomy/celestial_equator.html", "passage_text": "~ - The Earth 's equator projected onto the celestial sphere. Celestial Poles-The Earth 's axis of rotation projected onto the celestial sphere. The celestial poles on the celestial sphere correspond to the North and South rotation al poles on the Earth. ~ - The circle where the Earth 's equator, if extended outward into space, would intersect the celestial sphere ... ~. The projection of Earth 's equator onto the sky. It's anchored to the celestial poles and the ~ (directly above Earth 's equator). Declination and right ascension are the celestial equivalents of latitude and longitude. Declination-Similar to latitude on the Earth 's surface. The distance in degrees north or south of the ~ (similar to the Earth 's Equator)."}, {"url": "http://www.thefreedictionary.com/Equator+(astronomy)", "passage_text": "Noun. 1. celestial equator-the great circle on the celestial sphere midway between the celestial poles. equinoctial, equinoctial circle, equinoctial line. great circle-a circular line on the surface of a sphere formed by intersecting it with a plane passing through the center. 1. (Astronomy) the great circle lying on the celestial sphere the plane of which is perpendicular to the line joining the north and south"}, {"url": "https://en.wikipedia.org/wiki/Celestial_equator", "passage_text": "The celestial equator is defined to be infinitely distant (since it is on the celestial sphere); thus the observer always sees the ends of the semicircle disappear over the horizon exactly due east and due west, regardless of the observer's position on Earth. (At the poles, though, the celestial equator would be parallel to the horizon.) At all latitudes the celestial equator appears perfectly straight because the observer is only finitely far from the plane of the celestial equator but infinitely far from the celestial equator itself."}]