[{"url": "http://www.fivecentnickel.com/2009/11/05/how-much-to-budget-for-car-maintenance/", "passage_text": "That’s money out the window any way you look at it. Most everything else on a car you’d have to pay regardless of how new or old it was – oil changes, insurance, gas, tires, etc. My 2001 vehicle has cost us about $700 more than my husband’s 2007 vehicle."}, {"url": "http://quotewizard.com/auto-insurance/small-accidents", "passage_text": "1 The claim will be larger than your deductible. 2  How much larger depends on what you can afford to pay out of pocket at the time. 3  Most car insurance experts agree it’s not a good idea to file small claims, however, not all agree on what the definition of “small” is."}, {"url": "http://cars.costhelper.com/car-windows.html", "passage_text": "1 Expect to pay about $100-$350 to have someone replace a standard side door car window, depending on location and the year, make and model of vehicle; windows on rare, exotic or luxury vehicles can cost more."}, {"url": "http://carinsurance.about.com/od/CarInsuranceClaims/tp/Should-I-Pay-For-An-At-Fault-Claim-Myself.htm", "passage_text": "It damages your tire, rim, and alignment. The cost of repair is $1100 and you have a $500 deductible. You also filed an at-fault accident on your car insurance policy less than a year ago. Having two at-fault accidents on your record will put you up for non-renewal. You would have to get high risk insurance until the oldest claim is more than three years old."}, {"url": "http://www.fivecentnickel.com/2009/11/05/how-much-to-budget-for-car-maintenance/", "passage_text": "On a relatively new vehicle you might get away with $500/yr and that’s mostly for routine maintenance. 5 yrs and up and you’re looking at closer to $2000 since repairs will be needed. If the car is paid for, that’s still a good bit cheaper than buying a new one every few years."}, {"url": "http://www.today.com/home/having-auto-body-work-done-read-first-2D80555134", "passage_text": "It’s often set at $500, but you may have bumped it up to $1,000 at some point – a tactic that really can help you save on insurance rates over time. Considering the high cost of auto-body repairs, though, just be prepared to pay the full deductible amount out of pocket if the accident is your fault. 2."}]