[{"url": "http://my.clevelandclinic.org/services/orthopaedics-rheumatology/diseases-conditions/hic-behcets-disease-what-you-need-to-know", "passage_text": "Behcet'behçet s disease or syndrome is a (chronic long) term inflammatory condition caused by (vasculitis an inflammation of the blood) vessels that results in damage to both arteries and. veins"}, {"url": "http://www.nhs.uk/Conditions/Behcets-disease/Pages/introduction.aspx", "passage_text": "Introduction. Behcet'behçet s disease is a rare and poorly understood condition in which blood vessels and tissues may become (inflamed). Swollen it is sometimes referred to as an autoinflammatory, disease as certain cells of the immune system may begin this inflammation when. triggered"}, {"url": "http://niams.nih.gov/Health_Info/Behcets_Disease/behcets_disease_ff.asp", "passage_text": "Behcet’behçet (S-BEH chets Or-BEH) shets disease is an illness that causes symptoms in various parts of the. Body the more common symptoms include sores in the mouth and on the (genitals sex). Organs more serious symptoms can include (inflammation, swelling, heat, redness and) pain in the eyes and other parts of the. body"}, {"url": "http://niams.nih.gov/Health_Info/Behcets_Disease/behcets_disease_ff.asp", "passage_text": "Nearly all of the symptoms of Behcet’behçet s disease are due to an inflammation of the blood. Vessels doctors'aren t sure what causes this. Inflammation some people may have (inherited passed on from parent to) child a problem with the immune system that makes them more likely to develop the. disease"}, {"url": "http://www.behcetsdisease.com/what-is-behcets-disease.html", "passage_text": "Behcet'behçet s disease is a, rare-multi system rheumatic disorder that causes the inflammation of blood vessels anywhere in the. Body this inflammation is known as. Vasculitis the location of the(inflammation) s is what dictates your. Symptoms there are many different pronunciations of the Word'behcet. behçet s"}, {"url": "http://www.niams.nih.gov/health_info/behcets_disease/", "passage_text": "The exact cause of Behcet’behçet s disease is. Unknown most symptoms of the disease are caused by inflammation of the blood. Vessels inflammation is a characteristic reaction of the body to injury or disease and is marked by four: signs, swelling, redness, heat and. pain"}, {"url": "http://my.clevelandclinic.org/services/orthopaedics-rheumatology/diseases-conditions/hic-behcets-disease-what-you-need-to-know", "passage_text": "Behcet'behçet s disease or syndrome is a (chronic long) term inflammatory condition caused by (vasculitis an inflammation of the blood) vessels that results in damage to both arteries and. Veins the cause Of'behcet behçet s disease. is unknown"}, {"url": "http://www.behcetsdisease.com/what-is-behcets-disease.html", "passage_text": "Behcet'behçet s disease is a, rare-multi system rheumatic disorder that causes the inflammation of blood vessels anywhere in the. Body this inflammation is known as. vasculitis"}, {"url": "http://www.behcets.com/site/c.8oIJJRPsGcISF/b.9196317/k.904C/Behcets_Disease.htm", "passage_text": "Behcet's Disease. Behcet's Disease, also known as Behcet's syndrome, is a rare, chronic, autoinflammatory disorder of unknown origin. Its manifestations are thought to be caused by vasculitis resulting in damage to blood vessels throughout the body."}]