[{"url": "http://www.answers.com/Q/1_kilogram_is_equal_to_how_many_grams", "passage_text": "1 gram = 0.001 kilogram *The kilogram is the larger unit, equal to 1000 grams. i.e. 1kg = 1000g, 2kg=2000g, 1/2kg = 500g and for a weird one: 5.735902kg = 5735.902g. 3 people found this useful. Edit. Share to: Answered. "}, {"url": "http://www.merriam-webster.com/dictionary/kilogram", "passage_text": "2. : a unit of force or weight equal to the weight of a kilogram mass under a gravitational attraction equal to that of the earth. See kilogram defined for English-language learners. See kilogram defined for kids. 1. : the base unit of mass in the International System of Units that is equal to the mass of a prototype agreed upon by international convention and that is nearly equal to the mass of 1000 cubic centimeters of water at the temperature of its maximum density. 2."}, {"url": "http://www.traditionaloven.com/culinary-arts/weight/convert-kilogram-kg-to-pound-lb.html", "passage_text": "The answer is: The change of 1 kg (kilogram) unit for a weight and mass measure equals = into 2.20 lb-lbs (pound) as per its equivalent weight and mass unit type measure often used. Calculate pounds in weight and mass per 1 kilogram unit. The weight and mass kitchen measuring units converter for culinary chefs, bakers and other professionals."}, {"url": "http://www.merriam-webster.com/dictionary/kilogram", "passage_text": ": a unit of force or weight equal to the weight of a kilogram mass under a gravitational attraction equal to that of the earth. See kilogram defined for English-language learners. 1. : the base unit of mass in the International System of Units that is equal to the mass of a prototype agreed upon by international convention and that is nearly equal to the mass of 1000 cubic centimeters of water at the temperature of its maximum density. 2."}, {"url": "https://en.wikipedia.org/wiki/Kilogram", "passage_text": "The original prototype kilogram, manufactured in 1799 and from which the IPK is derived, had a mass equal to the mass of 1.000025 liters of water at 4 °C. The kilogram is the only SI base unit with an SI prefix (kilo, symbol k) as part of its name. "}, {"url": "http://www.convertunits.com/from/kilogram/to/pounds", "passage_text": "›› Definition: Kilogram. The kilogram or kilogramme, (symbol: kg) is the SI base unit of mass. A gram is defined as one thousandth of a kilogram. Conversion of units describes equivalent units of mass in other systems. "}, {"url": "http://www.merriam-webster.com/dictionary/kilogram", "passage_text": "Medical Definition of KILOGRAM. 1. : the base unit of mass in the International System of Units that is equal to the mass of a prototype agreed upon by international convention and that is nearly equal to the mass of 1000 cubic centimeters of water at the temperature of its maximum density. 2."}, {"url": "http://www.asknumbers.com/KilogramsToPoundsConversion.aspx", "passage_text": "From kilograms to pounds weight units conversion factor is 2.20462262 (for troy measurement, it is 2.67922888). To find out how many pounds in kilograms, multiply by the conversion factor or use the converter below. 1 Kilogram = 2.20462262 Pounds. Kilogram is the base unit of mass in metric system and defined as the mass of one liter of water. It's commonly used globally except a few countries. The abbreviation is kg. Pound is the unit of mass in imperial, U.S. customary and a few other measurement systems."}, {"url": "http://www.asknumbers.com/KilogramsToGrams.aspx", "passage_text": "The conversion factor from kilograms to grams is 1000. To find out how many grams in a kilogram, simply multiply by the conversion factor or use the converter below. 1 Kilogram = 1000 Grams. Kilogram is a commonly used base unit of mass in metric system and equals to the mass of one liter of water. 1 kilogram equals to 2.20462262 pounds. In metric system, the prefix kilo denotes the factor of 1000 which makes it easier to remember how many grams in a kilogram. The abbreviation is kg. "}, {"url": "http://www.merriam-webster.com/dictionary/kilogram", "passage_text": "Full Definition of KILOGRAM. 1. : the base unit of mass in the International System of Units that is equal to the mass of a prototype agreed upon by international convention and that is nearly equal to the mass of 1000 cubic centimeters of water at the temperature of its maximum density — see metric system table. 2. 1. : the base unit of mass in the International System of Units that is equal to the mass of a prototype agreed upon by international convention and that is nearly equal to the mass of 1000 cubic centimeters of water at the temperature of its maximum density. 2."}]