[{"url": "http://www.scleroderma.org/site/DocServer/digestive_system_article.pdf?docID=314", "passage_text": "2 A fter the skin, the digestive system is the most com-monly affected organ system in people with scleroderma, affect-ing about 75 to 90 percent of all patients (Figure 1). The majority of people with gut involvement experi-ence symptoms that interfere with their day-to-day activities and qual-ity of life. "}, {"url": "http://www.cnn.com/2013/08/28/health/gi-disorders-ibs-cic/index.html", "passage_text": "You may have a chronic GI disorder such as ulcerative colitis, Crohn's disease or celiac disease. Or you may have a functional bowel disorder; two of the most common are irritable bowel syndrome with constipation (IBS-C) and chronic idiopathic constipation (CIC). CIC has similar symptoms, such as hard stools, and infrequent and incomplete bowel movements, but is usually not associated with pain. Although idiopathic means the cause is unknown, potential factors may include changes in water balance and motility in the colon."}, {"url": "http://www.news-medical.net/health/Chronic-Idiopathic-Constipation-(CIC)-Treatment.aspx", "passage_text": "By Dr Ananya Mandal, MD. Chronic Idiopathic Constipation (CIC) management involves some basic steps. The first step is to rule out other secondary causes that may be causing constipation. As the name suggests, chronic idiopathic constipation seldom has a definite cause. "}, {"url": "http://www.cnn.com/2013/08/28/health/gi-disorders-ibs-cic/index.html", "passage_text": "Let the physician know the details of any symptoms you experience, how often and what you've tried in the past to help alleviate them. There is no cure for IBS-C or CIC, but there are ways to help manage symptoms: Change your diet. Increasing fiber in your diet may help create softer stools that are easier to pass. CIC has similar symptoms, such as hard stools, and infrequent and incomplete bowel movements, but is usually not associated with pain. Although idiopathic means the cause is unknown, potential factors may include changes in water balance and motility in the colon."}, {"url": "http://www.webmd.com/manage-ibsc-cic-symptoms/treating", "passage_text": "LINZESS (linaclotide) is a prescription medication used in adults to treat irritable bowel syndrome with constipation (IBS-C) and chronic idiopathic constipation (CIC). Idiopathic means the cause of the constipation is unknown. It is not known if LINZESS is safe and effective in children. 1 Making dietary changes: Adding high-fiber foods, such as fruits, vegetables, beans, and bran flakes, into your diet may help create softer stools that are easier to pass. 2  Drinking more water: Staying hydrated may help with the symptoms of CIC. 3  It is important to drink 6 to 8 glasses of water per day."}, {"url": "https://www.sharecare.com/health/constipation/what-is-constipation", "passage_text": "Constipation that keeps coming back may indicate a chronic condition, such as chronic idiopathic constipation (CIC) or irritable bowel syndrome with constipation (IBS-C). CIC is chronic constipation with no known cause, and IBS-C is one of the three major subtypes of IBS. Also known as irregularity, constipation can include pain when having a bowel movement, an inability to “go” after trying for a prolonged period or having less than 3 bowel movements a week. Everyone’s habits and patterns are different, so what is considered “normal” varies from person to person."}, {"url": "https://www.sharecare.com/health/constipation/what-is-constipation", "passage_text": "Constipation is generally defined as having fewer than three bowel movements per week, having difficulty while passing a bowel movement or both. Signs and symptoms of constipation may include hard or lumpy stools, straining or incomplete bowel movements. Also known as irregularity, constipation can include pain when having a bowel movement, an inability to “go” after trying for a prolonged period or having less than 3 bowel movements a week. Everyone’s habits and patterns are different, so what is considered “normal” varies from person to person."}, {"url": "http://www.webmd.com/manage-ibsc-cic-symptoms/treating", "passage_text": "While there is no cure for CIC, there are several ways to manage your symptoms, some of which you may have already tried or may even be trying now: 1  Making dietary changes: Adding high-fiber foods, such as fruits, vegetables, beans, and bran flakes, into your diet may help create softer stools that are easier to pass. 1 Making dietary changes: Adding high-fiber foods, such as fruits, vegetables, beans, and bran flakes, into your diet may help create softer stools that are easier to pass. 2  Drinking more water: Staying hydrated may help with the symptoms of CIC. 3  It is important to drink 6 to 8 glasses of water per day."}, {"url": "http://www.webmd.com/manage-ibsc-cic-symptoms/about-ibs-c-cic", "passage_text": "IBS-C is defined as belly pain (abdominal pain) or discomfort associated with constipation. The symptoms of IBS-C are long-lasting and keep coming back. Those suffering from IBS-C also have hard or lumpy stools at least 25% of the time, and loose or watery stools less than 25% of the time. But if your constipation is long-lasting or keeps coming back, it may be chronic. Chronic constipation without an identifiable cause is often referred to as chronic idiopathic constipation (CIC). Idiopathic means the cause is unknown."}]