[{"url": "https://en.wikipedia.org/wiki/Trusted_Platform_Module", "passage_text": "Trusted Platform Module offers facilities for the secure generation of cryptographic keys, and limitation of their use, in addition to a random number generator. It also includes capabilities such as remote attestation and sealed storage, as follows: In this context integrity means behave as intended, and a platform is generically any computer platform – not limited to PCs or a particular operating system: start the power-on boot process from a trusted condition and extend this trust until the operating system has fully booted and applications are running."}, {"url": "https://en.wikipedia.org/wiki/Trusted_Platform_Module", "passage_text": "Software can use a Trusted Platform Module to authenticate hardware devices. Since each TPM chip has a unique and secret RSA key burned in as it is produced, it is capable of performing platform authentication. In this context integrity means behave as intended, and a platform is generically any computer platform – not limited to PCs or a particular operating system: start the power-on boot process from a trusted condition and extend this trust until the operating system has fully booted and applications are running."}, {"url": "http://www.webopedia.com/TERM/T/Trusted_Platform_Module.html", "passage_text": "Trusted Platform Module (TPM) is a hardware device that is basically a secure micro-controller with added cryptographic functionality. "}, {"url": "https://technet.microsoft.com/en-us/library/cc749022(v=ws.10).aspx", "passage_text": "This Step-by-Step Guide provides the instructions necessary to use Trusted Platform Module (TPM) Management in a test lab environment. A TPM is a microchip designed to provide basic security-related functions, primarily involving encryption keys. The TPM is usually installed on the motherboard of a computer or laptop, and communicates with the rest of the system using a hardware bus."}, {"url": "https://en.wikipedia.org/wiki/Trusted_Computing", "passage_text": "Chip manufacturers Intel and AMD, hardware manufacturers such as HP and Dell, and operating system providers such as Microsoft all plan to include Trusted Computing in coming generations of products. The U.S. Army requires that every new PC it purchases comes with a Trusted Platform Module (TPM). There is concern amongst critics that it will not always be possible to examine the hardware components on which Trusted Computing relies, the Trusted Platform Module, which is the ultimate hardware system where the core 'root' of trust in the platform has to reside."}, {"url": "http://www.answers.com/Q/What_is_a_TPM_chip", "passage_text": "Answered by The Community. Making the world better, one answer at a time. The Trusted Platform Module (TPM) chip designed by the TCG (Trusted Computing Group), it stores passwords, encryption keys and digital certificates. Pros: -Provides added security in case your laptop got lost or stolen, the above average joe won't be able to get into it. "}, {"url": "http://whatis.techtarget.com/definition/trusted-platform-module-TPM", "passage_text": "Part of the Hardware glossary: A Trusted Platform Module (TPM) is a specialized chip on an endpoint device that stores RSA encryption keys specific to the host system for hardware authentication. Each TPM chip contains an RSA key pair called the Endorsement Key (EK). The pair is maintained inside the chip and cannot be accessed by software. "}, {"url": "https://technet.microsoft.com/en-us/library/cc749022(v=ws.10).aspx", "passage_text": "Trusted Platform Module (TPM) Management is a new feature set in Windows Vista® and Microsoft ® Windows Server® 2008 used to administer the TPM security hardware in your computer. The feature set includes the TPM Management console, and an API called TPM Base Services (TBS). A TPM is a microchip designed to provide basic security-related functions, primarily involving encryption keys. The TPM is usually installed on the motherboard of a computer or laptop, and communicates with the rest of the system using a hardware bus."}, {"url": "https://en.wikipedia.org/wiki/Trusted_Platform_Module", "passage_text": "Trusted Platform Module (TPM) is an international standard for a secure cryptoprocessor, which is a dedicated microprocessor designed to secure hardware by integrating cryptographic keys into devices. TPM's technical specification was written by a computer industry consortium called Trusted Computing Group (TCG). In this context integrity means behave as intended, and a platform is generically any computer platform – not limited to PCs or a particular operating system: start the power-on boot process from a trusted condition and extend this trust until the operating system has fully booted and applications are running."}]