[{"url": "http://www.innerbody.com/image_card01/card46-new2.html", "passage_text": "Deoxygenated blood enters the right atrium through three major veins: the superior and inferior vena cava and the coronary sinus. The superior vena cava returns all of the blood to the heart from tissues superior to the heart in the head, neck, arms and upper thorax."}, {"url": "https://www.sharecare.com/health/blood-basics/how-blood-pump-through-heart", "passage_text": "All blood enters the heart's right side through two veins: The superior vena cava and the inferior vena cava. The superior vena cava collects blood from the body's upper half. The inferior vena cava collects blood from the body's lower half. When blood leaves these two veins, it enters the heart's right atrium."}, {"url": "http://health.howstuffworks.com/human-body/systems/circulatory/heart3.htm", "passage_text": "Blood Flow. All blood enters the right side of the heart through two veins: The superior vena cava (SVC) and the inferior vena cava (IVC) (see figure 3). The SVC collects blood from the upper half of the body. The IVC collects blood from the low"}, {"url": "http://www.leememorial.org/cardiaccare/about/blood_heart.asp", "passage_text": "Blood enters the heart through two large veins, the inferior and superior vena cava, emptying oxygen-poor blood from the body into the right atrium. Left Side. Oxygen-rich blood returns from the lungs to your heart's left atrium through the pulmonary veins."}, {"url": "http://www.vanderbilthealth.com/heart/10902", "passage_text": "Blood returns to the heart through two large blood veins: the inferior vena cava and superior vena cava. The inferior vena cava carries the blood from the lower body parts, the legs and feet and from organs in the abdomen and pelvis."}, {"url": "http://www.innerbody.com/image_dige07/card26.html", "passage_text": "The inferior vena cava is the largest vein in the human body. It collects blood from veins serving the tissues inferior to the heart and returns this blood to the right atrium of the heart."}, {"url": "http://www.medicinenet.com/heart_how_the_heart_works/page3.htm", "passage_text": "1 Blood enters the heart through two large veins, the inferior and superior vena cava, emptying oxygen-poor blood from the body into the right atrium of the heart. 2  As the atrium contracts, blood flows from your right atrium into your right ventricle through the open tricuspid valve."}, {"url": "http://www.medicinenet.com/heart_how_the_heart_works/page3.htm", "passage_text": "Right Side of the Heart. 1  Blood enters the heart through two large veins, the inferior and superior vena cava, emptying oxygen-poor blood from the body into the right atrium of the heart. 2  As the atrium contracts, blood flows from your right atrium into your right ventricle through the open tricuspid valve."}]