[{"url": "http://www.onegeology.org/eXtra/kids/earthProcesses/weathering.html", "passage_text": "Organic weathering happens when plants break up rocks with their growing roots or plant acids help dissolve rock. Once the rock has been weakened and broken up by weathering it is ready for erosion. Erosion happens when rocks and sediments are picked up and moved to another place by ice, water, wind or gravity. Mechanical weathering physically breaks up rock. One example is called frost action or frost shattering"}, {"url": "https://en.wikipedia.org/wiki/Erosion", "passage_text": "Feedbacks are also possible between rates of erosion and the amount of eroded sediment that is already carried by, for example, a river or glacier. While erosion is a natural process, human activities have increased by 10-40 times the rate at which erosion is occurring globally. Wind erosion is much more severe in arid areas and during times of drought. For example, in the Great Plains, it is estimated that soil loss due to wind erosion can be as much as 6100 times greater in drought years than in wet years."}, {"url": "http://sciencenetlinks.com/lessons/soil-erosion/", "passage_text": "Soil erosion may be a slow process that continues relatively unnoticed, or it may occur at an alarming rate causing serious loss of topsoil. The loss of soil from farmland may be reflected in reduced crop production potential, lower surface water quality, and damaged drainage networks. Soil erosion is a naturally occurring process on all land. The agents of soil erosion are water and wind, each contributing a significant amount of soil loss each year. Soil erosion and degradation are so severe worldwide that it threatens our agricultural base."}, {"url": "http://www.bbc.co.uk/schools/gcsebitesize/geography/water_rivers/river_processes_rev1.shtml", "passage_text": "Erosion involves the wearing away of rock and soil found along the river bed and banks. Erosion also involves the breaking down of the rock particles being carried downstream by the river. "}, {"url": "http://mamontoff.org/weathering%20-%20erosion%20-%20deposition.htm", "passage_text": "Weathering: The breaking down of rocks. Sediment: Broken down rocks. Erosion: The carrying away of sediment. Transport: The carrrying of sediment. Deposition: When the sediment is deposited or put down. Destructive process: Process that wears down, or removes material. Erosion is a destructive process. Constructive process: Process that makes greater or builds up material on the surface of the earth"}, {"url": "https://en.wikipedia.org/wiki/Erosion", "passage_text": "In earth science, erosion is the action of exogenic processes (such as water flow or wind) which remove soil and rock from one location on the Earth's crust, then transport it to another location where it is deposited. Eroded sediment may be transported just a few millimetres, or for thousands of kilometres. Wind erosion is much more severe in arid areas and during times of drought. For example, in the Great Plains, it is estimated that soil loss due to wind erosion can be as much as 6100 times greater in drought years than in wet years."}, {"url": "https://answers.yahoo.com/question/index?qid=20121106102844AAc4QG9", "passage_text": "A.The process of erosion creates soil. B. The process of erosion moves soil. C. People's activities have no effect on erosion. D. Erosion is a natural occurrence. E. Erosion can be harmful to the environment. F. Erosion can have a negative impact on people's activities. G. Erosion can benefit the... "}, {"url": "https://en.wikipedia.org/wiki/Erosion", "passage_text": "Natural rates of erosion are controlled by the action of geomorphic drivers, such as rainfall; bedrock wear in rivers; coastal erosion by the sea and waves; glacial plucking, abrasion, and scour; areal flooding; wind abrasion; and mass movement processes in steep landscapes like landslides and debris flows. Wind erosion is much more severe in arid areas and during times of drought. For example, in the Great Plains, it is estimated that soil loss due to wind erosion can be as much as 6100 times greater in drought years than in wet years."}]