[{"url": "http://www.answers.com/Q/Are_there_canary_islands_in_the_pacific_ocean", "passage_text": "However, there are a lot more such as: Ascension Island (UK) Azores (Portugal) The Bahamas Barbados … Brazil Islands Burmuda (UK) Canary Islands (Spain) Cape Verde Islands Falkland Islands (UK) Florida Keys Great Britain Greenland Iceland Ireland Newfoundland (Canada). The premis is wrong, the Canary Islands are in the Atlantic, not  the Pacific. 2 people found this useful. Penny Kaye. 166,274 Contributions. Always let your conscience be your guide.: Penny Kaye has a BS degree in Elementary Education."}, {"url": "http://www.answers.com/Q/Are_there_canary_islands_in_the_pacific_ocean", "passage_text": "The Canary Islands are a Spanish autonomous community (an  independent territory of Spain) located in the North Atlantic Ocean  off the northwest coast of the African contin … ent (west of the  Morocco-Western Sahara border). The premis is wrong, the Canary Islands are in the Atlantic, not  the Pacific. 2 people found this useful. Penny Kaye. 166,274 Contributions. Always let your conscience be your guide.: Penny Kaye has a BS degree in Elementary Education."}, {"url": "http://www.answers.com/Q/What_animal_are_the_Canary_Islands_in_the_Pacific_named_after", "passage_text": "Split and merge into it. Answer by W4jle. Confidence votes 4. The Canary Islands are a Spanish autonomous community (an independent territory of Spain) located in the North Atlantic Ocean off the northwest coast of the African continent (west of the Morocco-Western Sahara border). They're named after dogs, from the Latin root that gives us canine.. The islands' name is likely derived from t … he Latin term Insula Canaria, meaning Island of the Dogs, a name applied originally only to the island of Gran Canaria."}, {"url": "http://www.answers.com/Q/Are_there_canary_islands_in_the_pacific_ocean", "passage_text": "There is a myth that the Canary Islands were named after a dog is a  common one, but not accurate. The islands were actually named for a  species of Monk Seals called Canis Marinus in Latin, literally sea  dog, the common name for seals during the Roman Empire. The premis is wrong, the Canary Islands are in the Atlantic, not  the Pacific. 2 people found this useful. Penny Kaye. 166,274 Contributions. Always let your conscience be your guide.: Penny Kaye has a BS degree in Elementary Education."}, {"url": "https://en.wikipedia.org/wiki/Canary_Islands", "passage_text": "The main islands are (from largest to smallest) Tenerife, Fuerteventura, Gran Canaria, Lanzarote, La Palma, La Gomera and El Hierro. The archipelago also includes a number of islets: La Graciosa, Alegranza, Isla de Lobos, Montana Montaña, Clara roque Del oeste And roque Del. este The Romans called each of the islands; Ninguaria or Nivaria (Tenerife), Canaria (Gran Canaria), Pluvialia or Invale (Lanzarote), Ombrion (La Palma), Planasia (Fuerteventura), Iunonia or Junonia (El Hierro) and Capraria (La Gomera)."}, {"url": "http://www.answers.com/Q/What_animal_are_the_Canary_Islands_in_the_Pacific_named_after", "passage_text": "The islands were once densely populated with the species, which today are critically endangered and no longer inhabit the islands. The premis is wrong, the Canary Islands are in the Atlantic, not the Pacific. They're named after dogs, from the Latin root that gives us canine.. The islands' name is likely derived from t … he Latin term Insula Canaria, meaning Island of the Dogs, a name applied originally only to the island of Gran Canaria."}, {"url": "https://en.wikipedia.org/wiki/Canary_Islands", "passage_text": "Many of the plant species in the Canary Islands, like the Canary Island pine and the dragon tree, Dracaena draco are endemic, as noted by Sabin Berthelot and Philip Barker Webb in their epic work, L'Histoire Naturelle des Îles îles (canaries–1835). 50 The Romans called each of the islands; Ninguaria or Nivaria (Tenerife), Canaria (Gran Canaria), Pluvialia or Invale (Lanzarote), Ombrion (La Palma), Planasia (Fuerteventura), Iunonia or Junonia (El Hierro) and Capraria (La Gomera)."}, {"url": "https://en.wikipedia.org/wiki/Canary_Islands", "passage_text": "Las Palmas de Gran Canaria has been the largest city in the Canaries since 1768, except for a brief period in 1910. Between the 1833 territorial division of Spain and 1927 Santa Cruz de Tenerife was the sole capital of the Canary Islands. The Romans called each of the islands; Ninguaria or Nivaria (Tenerife), Canaria (Gran Canaria), Pluvialia or Invale (Lanzarote), Ombrion (La Palma), Planasia (Fuerteventura), Iunonia or Junonia (El Hierro) and Capraria (La Gomera)."}, {"url": "http://ctspanish.com/communities/canarym/canary%20islands.htm", "passage_text": "Location & Size The Canary Islands are located in the Atlantic Ocean off the coast of Africa. The eastern most island, Lanzarote is located about 70 miles from coast of Africa. The islands, stretch out into the Atlantic Ocean with the western most island, Hierro being about 300 miles away. The largest island in size is Tenerife which is 786 square miles. It also has the most people, 665,000. The Symbol of the Canary Islands The symbol of the Canary Islands is very interesting. The ribbon says Oceano because they are islands located in the Atlantic Ocean. The Crown is because they are a part of Spain, which is has a king. The 7 symbols on the shield represent the 7 main islands."}, {"url": "http://www.answers.com/Q/Are_there_canary_islands_in_the_pacific_ocean", "passage_text": "The islands  were once densely populated with the species, which today are  critically endangered and no longer inhabit the islands.    The premis is wrong, the Canary Islands are in the Atlantic, not  the Pacific. 2 people found this useful. Penny Kaye. 166,274 Contributions. Always let your conscience be your guide.: Penny Kaye has a BS degree in Elementary Education."}]