[{"url": "https://en.wikipedia.org/wiki/Mongolian_cuisine", "passage_text": "The nomads of Mongolia sustain their lives directly from the products of domesticated animals such as cattle, horses, camels, yaks, sheep, and goats, as well as game. Meat is either cooked, used as an ingredient for soups and dumplings (buuz, khuushuur, bansh, manti), or dried for winter (borts). Mongolian cuisine refers to the local culinary traditions of Mongolia and Mongolian styled dishes. The extreme continental climate has affected the traditional diet, so the Mongolian cuisine primarily consists of dairy products, meat, and animal fats. Use of vegetables and spices are limited"}, {"url": "http://www.asian-recipe.com/mongolia", "passage_text": "Mongolia Cuisine, Food & Recipes. Mongolian cuisine is less complex than that of most Asian countries. The most common rural dish is cooked mutton, often bereft of other ingredients. In the cities, a popular snack is buuz-dumplings filled with meat, cooked in steam. Bansh are dumplings boiled in water, whilst Khuushuur are deep fried in mutton fat."}, {"url": "http://news.at0086.com/China-fine-dining/Top-8-Most-Popular-Food-in-Inner-Mongolia.html", "passage_text": "Now we will recommend 8 most popular Mongolian food. Roast Lamb. Roast lamb is the traditional Mongolian food, which is specially prepared when a dinner party is held in honor of the distinguished guests or a great celebration is held. The roast lamb, which looks golden red and tastes quite delicious, is laid on a square wooden dish. The visitors who come to Hohhot always have a taste of shaomai. Shaomai is characteristic of unique technique, fine raw materials, nice and thin wrappers, delicious fillings and all necessary ingredients and seasoning."}, {"url": "http://www.buffaloeats.org/2014/01/26/mongolian-food/", "passage_text": "White rice is also eaten fairly regularly, but is not nearly as popular as flour-based dishes. One of the most popular foods in Mongolia is a steamed mutton dumpling, called buuz (pictured below, photo credit). The buuz filling is often made with ground mutton, salt, and onion. The exterior flour shell is similar to that of a potsticker, although sometimes a bit thicker. The first thing that you have to know about Mongolian food is that the two most fundamental ingredients are mutton and flour. We’re talking mutton, not lamb. The difference is in the age of the animal, and therefore in how gamey the meat is."}, {"url": "http://mongoluls.net/ger/meatmilk.shtml", "passage_text": "On top of the canteens and cafes serving Mongolian food, there are now many restaurants, canteens, bakeries and tea shops which serve meals from Russia, Italy, India, China, Japan, Korea, England, France, Senegal and Turkey. Most of these restaurants are located in the capital, Ulaanbaatar. The hierarchy of foods in the Mongolian diet. The meat-dependent diet arises from the need for hearty food to stave off the cold and long winters. Traditionally nomadic herders, Mongolians have for centuries been dependent on mostly animal products for their dietary staples."}, {"url": "http://news.at0086.com/China-fine-dining/Top-8-Most-Popular-Food-in-Inner-Mongolia.html", "passage_text": "Instant-boiled mutton, also called the Mongolian Fire Pot, was created in the Yuan Dynasty. Choose mutton from the back, rear legs or tail of a killed sheep. Cut the mutton into slices. The boiled mutton is fresh and tender, not greasy. The visitors who come to Hohhot always have a taste of shaomai. Shaomai is characteristic of unique technique, fine raw materials, nice and thin wrappers, delicious fillings and all necessary ingredients and seasoning."}, {"url": "http://www.answers.com/Q/What_is_the_most_popular_food_in_Mongolia", "passage_text": "One of the most popular foods in Zimbabwe is the national dished called Sadza. Sadza is made from cornmeal or maize, and is usually eaten with relish. Relish may refer to any … kind of vegetable stew, but nyama is the common relish to the Zimbabweans. Nyama means meat, such as beef or chicken. Sadza is cooked very slowly until is is thick and rich, very much like the consistency of porridge. Other popular foods in Zimbabwe include peanuts, cucumbers, butternut squash, beans, gem squash and corn. Bowara, pumpkin leaves, are commonly used in stews, but can also be eaten fresh. Bowara is commonly used in dovi, which is a peanut butter stew"}, {"url": "http://www.answers.com/Q/What_is_the_most_popular_food_in_Mongolia", "passage_text": "1 This meal is a popular British dish,…. 2  Mongolia's Climate: The Good and Bad Mongolia, one of the least densely-populated nations in the world, has a rich history and a unique place in its region. 3  The nation, located in the Northern Hemisphere near Ch…. Nyama means meat, such as beef or chicken. Sadza is cooked very slowly until is is thick and rich, very much like the consistency of porridge. Other popular foods in Zimbabwe include peanuts, cucumbers, butternut squash, beans, gem squash and corn."}]