[{"url": "https://answers.yahoo.com/question/index?qid=1006042730932", "passage_text": "Report Abuse. A genetically modified organism (GMO) is an organism whose genetic [material] has been altered using techniques in genetics generally known as recombinant DNA technology. Recombinant DNA technology is the ability to combine DNA molecules from different sources into the one molecule in a test tube. Thus, the abilities or the phenotype of the organism, or the proteins it produces, can be modified through the modification of its genes. "}, {"url": "https://en.wikipedia.org/wiki/DNA", "passage_text": "A gene is a sequence of DNA that contains genetic information and can influence the phenotype of an organism. Within a gene, the sequence of bases along a DNA strand defines a messenger RNA sequence, which then defines one or more protein sequences. Deoxyribonucleic acid (/diˌɒksiˌraɪbɵ.njuːˌkleɪ.ɨk ˈaesɪd/ ; ˈæSɪD) dna is a molecule that carries most of the genetic instructions used in the, development functioning and reproduction of all known living organisms and many. viruses"}, {"url": "https://en.wikipedia.org/wiki/Gene", "passage_text": "The mRNA matches the sequence of the gene's DNA coding strand because it is synthesised as the complement of the template strand. Transcription is performed by an enzyme called an RNA polymerase, which reads the template strand in the 3' to 5' direction and synthesizes the RNA from 5' to 3' . This requires first making a duplicate copy of every gene in the genome in a process called DNA replication. The copies are made by specialized enzymes known as DNA polymerases, which read one strand of the double-helical DNA, known as the template strand, and synthesize a new complementary strand."}, {"url": "https://en.wikipedia.org/wiki/Gene", "passage_text": "The total complement of genes in an organism or cell is known as its genome, which may be stored on one or more chromosomes. A chromosome consists of a single, very long DNA helix on which thousands of genes are encoded. The region of the chromosome at which a particular gene is located is called its locus. This requires first making a duplicate copy of every gene in the genome in a process called DNA replication. The copies are made by specialized enzymes known as DNA polymerases, which read one strand of the double-helical DNA, known as the template strand, and synthesize a new complementary strand."}, {"url": "http://www.merckmanuals.com/home/fundamentals/genetics/genes-and-chromosomes", "passage_text": "A trait is any gene-determined characteristic. Many traits are determined by the function of more than one gene. For example, a person's height is likely to be determined by genes affecting growth, appetite, muscle mass, and activity level. Every human cell contains 23 pairs of chromosomes, for a total of 46 chromosomes. A trait is any gene-determined characteristic and is often determined by more than one gene. Some traits are caused by abnormal genes that are inherited or that are the result of a new mutation. Proteins are probably the most important class of material in the body"}, {"url": "http://legacy.hopkinsville.kctcs.edu/instructors/Jason-Arnold/VLI/Module%201/m1DNAfunction/m1DNAfunction_print.html", "passage_text": "DNA and RNA are involved in the synthesis of proteins. The genes in DNA contain the instructions for the amino acid sequence of a protein. Since enzymes are proteins, an error in the gene for that enzyme could render the enzyme non-functional. "}, {"url": "http://www.novozymes.com/en/about-us/our-business/what-are-enzymes/Pages/DNA-genes-and-chromosones.aspx", "passage_text": "Genes are transcribed into proteins via RNA. Every gene in the DNA codes for one protein. The unique order of the base pairs in each gene specifies the sequence of amino acids in the long string of amino acids from which the corresponding protein is made. The DNA, however, does not code for the protein directly. It uses an intermediate called RNA. Genes contain the blueprints for life. All living organisms contain genes. The traits of a human being, for example, are based on the expression of approximately 80,000 different genes. The unique composition of these genes is based on our inheritance from our parents."}, {"url": "http://www2.le.ac.uk/departments/genetics/vgec/schoolscolleges/topics/dna-genes-chromosomes", "passage_text": "DNA. DNA (or deoxyribonucleic acid) is the molecule that carries the genetic information in all cellular forms of life and some viruses. It belongs to a class of molecules called the nucleic acids, which are polynucleotides-that is, long chains of nucleotides. Each nucleotide consists of three components: The nucleus of each cell in our bodies contains approximately 1.8 metres of DNA in total, although each strand is less than one millionth of a centimetre thick. This DNA is tightly packed into structures called chromosomes, which consist of long chains of DNA and associated proteins."}, {"url": "https://en.wikipedia.org/wiki/DNA", "passage_text": "Transcription is carried out by a DNA-dependent RNA polymerase that copies the sequence of a DNA strand into RNA. To begin transcribing a gene, the RNA polymerase binds to a sequence of DNA called a promoter and separates the DNA strands. Deoxyribonucleic acid (/diˌɒksiˌraɪbɵ.njuːˌkleɪ.ɨk ˈaesɪd/ ; ˈæSɪD) dna is a molecule that carries most of the genetic instructions used in the, development functioning and reproduction of all known living organisms and many. viruses"}]