[{"url": "http://www.wisegeek.com/what-are-the-different-types-of-work-environment.htm", "passage_text": "Matching employees with the right environment can result in better performance and more satisfaction. Holland’s approach to the types of work environment looked at the nature of the work done. He identified six different environments: realistic, social, enterprising, artistic, investigative, and conventional."}, {"url": "http://sourcesofinsight.com/6-personality-and-work-environment-types/", "passage_text": "If you’re looking for a job or thinking about your career, you can use Holland’s theory of career choice to help you find a better fit. I’m a fan of lenses to help me get a better perspective or vantage point on my job personality. John L. Holland identified 6 job personality and work environment types."}, {"url": "http://www.wisegeek.com/what-are-the-different-types-of-work-environment.htm", "passage_text": "There are many different types of work environment. Several attempts have been made to quantify the different types in an organized way, as seen with the Holland Codes proposed by John Holland, a psychologist with an interest in matching people with work environments that suit their personalities."}, {"url": "http://sourcesofinsight.com/6-personality-and-work-environment-types/", "passage_text": "Here is a summary of the six job personality and work environment types based on Holland: 1  Realistic (Do’er) – Prefers physical activities that require skill, strength, and coordination. 2  Traits include genuine, stable, conforming, and practical. 3  Example professions include architect, farmer, and engineer."}, {"url": "http://www.skwirk.com/p-c_s-18_u-130_t-359_c-1255/types-of-employment/nsw/types-of-employment/employment-issues/work-environment", "passage_text": "Types of employment : We now have many choices in the work we do, due to our changing economy and society. Employers (bosses, businesses or organisations who pay us for our work) can employ us to work in a number of different employment types. This chapter will briefly outline the various types of employment and the advantages and disadvantages of each type."}]