[{"url": "http://www.nytimes.com/2007/09/16/weekinreview/16fuller.html", "passage_text": "As a result, the Golden Triangle has been eclipsed by the Golden Crescent the poppy-growing area in and around Afghanistan that is now the source of an estimated 92 percent of the world s opium, according to the United Nations. THE enduring image of Southeast Asia s Golden Triangle is of brightly colored poppy fields, opium-smoking hill tribes and heroin labs hidden in the jungle. Skip to next paragraph."}, {"url": "https://en.wikipedia.org/wiki/Golden_Triangle_%28Southeast_Asia%29", "passage_text": "The Golden Triangle designates the confluence of the Ruak River and the Mekong River, since the term has been appropriated by the Thai tourist industry to describe the nearby border tripoint of Thailand, Laos and Myanmar. Poppy cultivation in the country decreased more than 80 percent from 1998 to 2006 following an eradication campaign in the Golden Triangle. Officials with the United Nations Office of Drugs and Crime say opium poppy farming is now expanding. The number of hectares used to grow the crops increased 29% in 2007"}, {"url": "http://thaihorsefarm.com/en/northern-thailand/golden-triangle/", "passage_text": "The Golden Triangle. T he term  Golden Triangle  refers to the border regions between Thailand, Burma and Laos and when gold was used by Chinese traders to pay for opium grown there. W ithin Southeast Asia the term is synonymous with the opium and heroin trade. T he history of the opium poppy in the Golden Triangle can be traced back to various Chinese migrant groups for whom the poppy was an integral part of their cultural traditions. T he governments in the  Golden Triangle  have dealt with the problem of poppy production with differing levels of intensity. In Thailand the cultivation of poppies is illegal and in the Northern provinces they have been very effective in limiting cultivation."}, {"url": "http://geography.about.com/od/economic-geography/fl/The-Golden-Triangle.htm", "passage_text": "The Golden Triangle is an area covering 367,000 square miles in Southeast Asia where a significant portion of the world’s opium has been produced since the beginning of the twentieth century. This area is centered around the meeting point of the borders that separate Laos, Myanmar, and Thailand. Since 1991, the Golden Triangle’s opium production has been outpaced by the Golden Crescent, which refers to an area that traverses the mountainous regions of Afghanistan, Pakistan and Iran. A Brief History of Opium in Southeast Asia"}, {"url": "https://en.wikipedia.org/wiki/Golden_Triangle_%28Southeast_Asia%29", "passage_text": "It is an area of around 950,000 square kilometres (367,000 sq mi) that overlaps the mountains of three countries of Southeast Asia: Myanmar, Laos and Thailand. Along with Afghanistan in the Golden Crescent, it has been one of the most extensive opium-producing areas of Asia and of the world since the 1950s. Most of the world's heroin came from the Golden Triangle until the early 21st century when Afghanistan became the world's largest producer. Poppy cultivation in the country decreased more than 80 percent from 1998 to 2006 following an eradication campaign in the Golden Triangle. Officials with the United Nations Office of Drugs and Crime say opium poppy farming is now expanding. The number of hectares used to grow the crops increased 29% in 2007"}, {"url": "http://www.unodc.org/unodc/en/frontpage/2013/December/golden-triangle-opium-production-rises-22-per-cent-in-2013-says-unodc.html", "passage_text": "18 December 2013 - Led by a 13 per cent increase in Myanmar opium cultivation to 57,800 hectares (from 51,000 ha in 2012), opium poppy cultivation in Southeast Asia's Golden Triangle of Myanmar, Lao PDR and Thailand rose for the seventh consecutive year, according to a new UNODC report. In Myanmar and Lao PDR, the use of heroin, opium and synthetic drugs remains high-and was much higher in poppy-growing villages. Myanmar is Southeast Asia's largest opium poppy-growing country and the world's second largest after Afghanistan. Shan State remains the centre of Myanmar's opium activities, accounting for 92 per cent of opium poppy cultivation, with the rest located mainly in Kachin State"}]