[{"url": "http://www.payscale.com/research/US/Job=Boilermaker/Hourly_Rate", "passage_text": "Job Description for Boilermaker. A boilermaker deals with all things related to boilers. This includes construction, assembly, maintenance, and repair of stationary steam boilers and boiler house accessories. Boilermakers must align components or plate sections while assembling vats and framer tank for boilers. Pay by Experience Level for. Median of all compensation (including tips, bonus, and overtime) by years of experience. Boilermakers with a lot of experience do not necessarily enjoy more money."}, {"url": "http://www1.salary.com/Boilermaker-I-salary.html", "passage_text": "The annual salary for someone with the job title Boilermaker I may vary depending on a number of factors including industry, company size, location, years of experience and level of education. Our team of Certified Compensation Professionals has analyzed survey data collected from thousands of HR departments at companies of all sizes and industries to present this range of annual salaries for people with the job title Boilermaker I in the United States."}, {"url": "http://www.payscale.com/research/US/Job=Boilermaker/Hourly_Rate", "passage_text": "Compensation ranges between $16.00 per hour and $36.44. Medical benefits are awarded to a large number, and the greater part earn dental coverage. Job satisfaction is reported as high by the vast majority of workers. Pay by Experience Level for. Median of all compensation (including tips, bonus, and overtime) by years of experience. Boilermakers with a lot of experience do not necessarily enjoy more money."}, {"url": "http://www1.salary.com/Boilermaker-I-salary.html", "passage_text": "For example the median expected annual pay for a typical Boilermaker I in the United States is $36,430 so 50% of the people who perform the job of Boilermaker I in the United States are expected to make less than $36,430. Source: HR Reported data as of October 2015. Median $36,430. Our team of Certified Compensation Professionals has analyzed survey data collected from thousands of HR departments at companies of all sizes and industries to present this range of annual salaries for people with the job title Boilermaker I in the United States."}, {"url": "http://work.chron.com/salary-boilermakers-apprentice-6414.html", "passage_text": "Boilermaker Wages. Boilermaker apprentices are typically paid a percentage of a journeyman boilermaker's wages. Hour wages vary regionally, but the national mean hourly wage for boilermakers was $27.23 as of May 2011, according to the Bureau of Labor Statistics. Apprentices in the International Brotherhood of Boilermakers Union Local No. 7 in Orchard Park, New York, start at 65 percent of a journeyman's wages, and receive a 5 percent increase after each six-month period."}, {"url": "http://www.livingin-canada.com/salaries-for-boilermakers-canada.html", "passage_text": "The 2014 full-time average hourly wage rate for trades, transport and equipment operators, which includes boilermakers, is $22.64. The 2014 corresponding median weekly wage rate is $950, giving an approximate full-time annual salary for this employment unit of $49,000. The Canadian national occupation classification code (NOC) for this employment is 7262. Job titles and exact duties vary in this occupation and examples of some job titles are: boilermaker, boiler installer and boiler shop mechanic."}, {"url": "http://www.livingin-canada.com/salaries-for-boilermakers-canada.html", "passage_text": "Average Boilermaker’s Salary in Canada. The table below details the hourly wages for Boilermakers. The Canadian national occupation classification code (NOC) for this employment is 7262. Job titles and exact duties vary in this occupation and examples of some job titles are: boilermaker, boiler installer and boiler shop mechanic."}, {"url": "http://www.payscale.com/research/US/Job=Boilermaker/Hourly_Rate", "passage_text": "Boilermakers see a median salary of $70K after reaching one to two decades on the job. Veterans who have acquired more than 20 years report a median income of $81K, which is generally higher than the pay reported by other tenure groups. Pay by Experience Level for. Median of all compensation (including tips, bonus, and overtime) by years of experience. Boilermakers with a lot of experience do not necessarily enjoy more money."}, {"url": "http://www.livingin-canada.com/salaries-for-boilermakers-canada.html", "passage_text": "According to the latest figures, the highest hourly average (median) wages are earned in Edmonton and Calgary, Alberta at $40.21 per hour and the lowest average (median)wages are earned in Winnipeg, Manitoba at $32.40 per hour. The Canadian national occupation classification code (NOC) for this employment is 7262. Job titles and exact duties vary in this occupation and examples of some job titles are: boilermaker, boiler installer and boiler shop mechanic."}]