[{"url": "http://pcsupport.about.com/od/fileextensions/f/mdb-file.htm", "passage_text": "If you find that an application on your PC does try to open the MDB file but it's the wrong application or if you would rather have another installed program open MDB files, see my How To Change the Default Program for a Specific File Extension guide for making that change in Windows. You do not need to have Microsoft Access installed to use this program. If you know anything else useful about MDB files, like other programs that open the file type, please let me know so I can update this page. Tip: Use Notepad or another text editor to open the MDB file."}, {"url": "http://listoffreeware.com/list-of-best-free-mdb-viewer-software/", "passage_text": "It also lets you create, view and edit .mdb files (Microsoft Access files) easily and quickly. This freeware is a part of the OxygenOffice Professional. It is a useful .mdb viewer software for your computer. You can tryout this freeware to open, view and edit .mdb files easily. This free .mdb file viewer application RIA-Media Viewer can view and open .mdb files (Microsoft Access) files easily and quickly. This freeware also supports a wide variety of file formats e.g. DBF, PDF, FLV, SWF, XML, JPG and many more."}, {"url": "http://pcsupport.about.com/od/fileextensions/f/mdb-file.htm", "passage_text": "How To Open an MDB File. The easiest way to open an MDB file is to double-click on it and let your PC decide which default application should open the file. If no program opens the MDB file then you probably don't have an application installed that can view and/or edit MDB files. You do not need to have Microsoft Access installed to use this program. If you know anything else useful about MDB files, like other programs that open the file type, please let me know so I can update this page. Tip: Use Notepad or another text editor to open the MDB file."}, {"url": "http://pcsupport.about.com/od/fileextensions/f/mdb-file.htm", "passage_text": "MDB files can be opened with Microsoft Access and probably some other database programs as well. Microsoft Excel will import MDB files, but that data will then have to be saved in some other spreadsheet format. MDB Viewer Plus is a free program that can open and edit MDB files. You do not need to have Microsoft Access installed to use this program. If you know anything else useful about MDB files, like other programs that open the file type, please let me know so I can update this page. Tip: Use Notepad or another text editor to open the MDB file."}, {"url": "http://download.cnet.com/MDB-Viewer-Plus/3000-10254_4-75285626.html", "passage_text": "From Alex Nolan: MDB Viewer Plus is a freeware viewer and editor for Microsoft Access MDB and Accdb database files. It does not require an install to run provided that Microsoft Data Access Components (MDAC) is installed on your PC (In most versions of Windows this is the case). MDB Viewer Plus has been written to provide a free, quick and easy way to view, edit, filter, sort, and search MDB files without having Microsoft Access installed. This is useful if you need to look at an MDB or Accdb file but do not have Microsoft Access installed on your PC."}, {"url": "http://www.alexnolan.net/software/mdb_viewer_plus.htm", "passage_text": "Opening MDB and ACCDB Files. MDB Viewer Plus can be used to open MDB files and Accdb files without having Access installed. It will also use workgroup files if specified in the open options. Workgroup files (MDW) can be specified using the open options. If you need to open and view many MDB files frequently. If you do not have the Access Database Engine installed you will receive and error Provider can't be found .... For more details on the different ways of how to open MDB files, see the MDB Viewer Plus user guide."}, {"url": "http://www.isunshare.com/blog/how-to-open-and-edit-mdb-file-without-microsoft-access/", "passage_text": "It does not need to be installed to run. It uses Microsoft Data Access Components (MDAC) which is installed as part of Windows. It can open, view, edit, filter, sort, import to, export from, modify and search MDB and ACCDB files. Other features of MDB Viewer Plus: 1  Support Access 2007 ACCDB files. 2  Create new blank database. 3  Create, rename, delete table. "}, {"url": "http://download.cnet.com/MDB-Viewer-Plus/3000-10254_4-75285626.html", "passage_text": "by: Download.com staff on September 16, 2014. MDB Viewer Plus is a bare-bones database application. It allows you to view, edit, and search through a Microsoft Access database file without having Access installed on the machine. It serves as a valuable substitute when you don't have Access available to you. MDB Viewer Plus has been written to provide a free, quick and easy way to view, edit, filter, sort, and search MDB files without having Microsoft Access installed. This is useful if you need to look at an MDB or Accdb file but do not have Microsoft Access installed on your PC."}]