[{"url": "http://www.whfoods.com/genpage.php?tname=foodspice&dbid=47", "passage_text": "The fruit, as well as the other parts of the papaya tree, contain papain, an enzyme that helps digest proteins. This enzyme is especially concentrated in the fruit when it is unripe. Papain is extracted to make digestive enzyme dietary supplements and is also used as an ingredient in some chewing gums. The nutrients in papaya have also been shown to be helpful in the prevention of colon cancer. Papaya's fiber is able to bind to cancer-causing toxins in the colon and keep them away from the healthy colon cells. In addition, papaya's folate, vitamin C, beta-carotene, and vitamin E have each been associated with a reduced risk of colon cancer"}, {"url": "http://www.whfoods.com/genpage.php?tname=foodspice&dbid=47", "passage_text": "Vitamin C and vitamin A, which is made in the body from the beta-carotene in papaya, are both needed for the proper function of a healthy immune system. Papaya may therefore be a healthy fruit choice for preventing such illnesses as recurrent ear infections, colds and flu. The nutrients in papaya have also been shown to be helpful in the prevention of colon cancer. Papaya's fiber is able to bind to cancer-causing toxins in the colon and keep them away from the healthy colon cells. In addition, papaya's folate, vitamin C, beta-carotene, and vitamin E have each been associated with a reduced risk of colon cancer"}, {"url": "http://healthyeating.sfgate.com/papaya-good-want-lose-weight-11074.html", "passage_text": "Papaya is a nutrient-rich fruit. Papaya contains significant amounts of fiber, folate, and vitamins A and C. It's also relatively low in calories, making it a good choice for those looking to lose weight. Add papaya to your morning smoothie, use it in a fruit salad for a snack or make a fruit salsa to serve beside fish or chicken. People who consumed a low-fat diet high in fiber lost more weight than those consuming a diet high in fat and low in fiber, according to a study published in May 2006 in Diabetologia.. Each cup of papaya features 2.5 grams of fiber, or 10 percent of the daily value."}, {"url": "http://healthyeating.sfgate.com/papaya-good-want-lose-weight-11074.html", "passage_text": "This serving of papaya has 0.4 gram of fat, 0.7 gram of protein and 15.7 grams of carbohydrates. Trade in your usual sweet dessert for a cup of papaya, and you'll save calories and fat, making it easier to reach your weight-loss goals. People who consumed a low-fat diet high in fiber lost more weight than those consuming a diet high in fat and low in fiber, according to a study published in May 2006 in Diabetologia.. Each cup of papaya features 2.5 grams of fiber, or 10 percent of the daily value."}, {"url": "http://healthyeating.sfgate.com/papaya-good-want-lose-weight-11074.html", "passage_text": "Fresh papaya is low in energy density, or calories per gram. Consuming foods that are low in energy density, such as most fruits and vegetables, allows you to fill up without consuming a lot of calories, making it easier to lose weight. People who consumed a low-fat diet high in fiber lost more weight than those consuming a diet high in fat and low in fiber, according to a study published in May 2006 in Diabetologia.. Each cup of papaya features 2.5 grams of fiber, or 10 percent of the daily value."}, {"url": "http://www.webmd.com/food-recipes/fruit-month-papaya", "passage_text": "Papayas are a rich source of vitamin A and C. One half of a small papaya can provide 150% of the recommended dietary intake of Vitamin C. It is low in calories, fat free, cholesterol free, and a good source of potassium, folate, and fiber. Most of the papayas imported come from Hawaii, but smaller quantities from Florida, California, Mexico, Puerto Rico, and Central and South American countries are becoming more available. The papaya enzyme called papain, is used as a meat tenderizer. It breaks down tough meat fibers."}, {"url": "http://livewell.jillianmichaels.com/papaya-weight-loss-5530.html", "passage_text": "Considerations. There is one indirect way in which papaya can help you lose weight. If you consume papaya instead of other, more calorically dense foods, you will take in fewer calories and will consequently burn fat to make up the deficit. Papaya Enzymes. Papaya enzyme is the most common reason some people think papaya makes a good dietary aid. Unfortunately, there's simply no scientific proof to support the idea that papaya enzyme burns fat. Papain is actually a proteolytic, meaning it digests protein."}, {"url": "http://foodfacts.mercola.com/papaya.html", "passage_text": "Botanical name: Carica papaya Native to southern Mexico and Central America, papaya is now cultivated in most tropical regions, including Hawaii, where it was introduced in the early 1800s. Today, Hawaii is still the only U.S. state where papaya is commercially grown."}]