[{"url": "http://www.psych.nyu.edu/jost/Jost,%20Liviatan,%20van%20der%20Toorn,%20Ledgerwood,%20Mandisodza,%20&%20Nosek%20(xxxx)%20System%20justification.%20How%20do%20we%20know%20it's%20motivated.PDF", "passage_text": "1 System justification theory does not suggest that people always perceive the status quo as completely fair and just; as with other motives (including ego and group justification motives), the strength of system justification motives is expected to vary considerably across individuals, groups, and situations. 3 Another difference between system justification and cognitive dissonance theories is that the latter assumes people experience dissonance only when something that they choose is incongruent with other. System Justification is Motivated 4 To take just one example, Jost, Pelham, et al."}, {"url": "https://en.wikipedia.org/wiki/System_justification", "passage_text": "System justification theory builds off the cognitive dissonance framework, in that it posits people will justify a social system in order to retain a positive image of that social system, due to the fact that they inherently play a role (whether passive or active) in perpetuating it. Based on cognitive dissonance theory that holds people have a need to reduce dissonance and maintain cognitive consistency, system justification theory explains that people are motivated to rationalize and justify instances of inequality in order to preserve and defend the legitimacy of the system."}, {"url": "http://www.psychwiki.com/wiki/System_Justification_Theory", "passage_text": "System Justification Theory was inspired by several concepts and theories within multiple disciplines such as philosophy, sociology, political science, and social psychology to posit that people have a tendency to justify and perceive the established arrangements and social systems as desirable, fair, and legitimate. Specifically, system Justification motive increases as a) the perceived system inescapability and inevitability increases, b) the system is threatened or criticized c) the perceived dependability of the individual on the system increases. IV."}, {"url": "https://en.wikipedia.org/wiki/System_justification", "passage_text": "This theory has widely been compared to system justification theory since they are both system justifying theories. Social dominance theory focuses on people’s motive to maintain a positive group image by generally supporting hierarchical inequality at the group level. Based on cognitive dissonance theory that holds people have a need to reduce dissonance and maintain cognitive consistency, system justification theory explains that people are motivated to rationalize and justify instances of inequality in order to preserve and defend the legitimacy of the system."}, {"url": "http://www.psychwiki.com/wiki/System_Justification_Theory", "passage_text": "System Justification Theory seeks to address, from a social psychological prospective, the ultimate question of why despite the prevalence of systems of inequality, injustice, and exploitation, resistance and collective action for change, even by those who suffer most from such systems, are relatively rare. Specifically, system Justification motive increases as a) the perceived system inescapability and inevitability increases, b) the system is threatened or criticized c) the perceived dependability of the individual on the system increases. IV."}, {"url": "http://www.psych.nyu.edu/jost/Jost,%20Liviatan,%20van%20der%20Toorn,%20Ledgerwood,%20Mandisodza,%20&%20Nosek%20(xxxx)%20System%20justification.%20How%20do%20we%20know%20it's%20motivated.PDF", "passage_text": "According to system justification theory, people are motivated to defend and legitimize social systems that affect them. In this chapter, we review fifteen years of theory and empirical research bearing on the motivational underpinnings of system justification processes. 3 Another difference between system justification and cognitive dissonance theories is that the latter assumes people experience dissonance only when something that they choose is incongruent with other. System Justification is Motivated 4 To take just one example, Jost, Pelham, et al."}, {"url": "https://en.wikipedia.org/wiki/System_justification", "passage_text": "System Justification theory addressed the additional, prevalent phenomenon known as out-group favoritism, in which people defend the social systems (status quo) even when it does not benefit, and in the long-run may even cause more harm, to the individual or the group to which he or she belongs. Based on cognitive dissonance theory that holds people have a need to reduce dissonance and maintain cognitive consistency, system justification theory explains that people are motivated to rationalize and justify instances of inequality in order to preserve and defend the legitimacy of the system."}, {"url": "https://en.wikipedia.org/wiki/System_justification", "passage_text": "System justification theory, while keeping the perspective that people are inclined to believe the world is just, extracts the underlying epistemic needs of the just world ideology and uses them as support for why people are motivated to uphold the system. Based on cognitive dissonance theory that holds people have a need to reduce dissonance and maintain cognitive consistency, system justification theory explains that people are motivated to rationalize and justify instances of inequality in order to preserve and defend the legitimacy of"}, {"url": "http://www.psychwiki.com/wiki/System_Justification_Theory", "passage_text": "System Justification Theory (SJT) is a theory of social psychology that postulates that people are motivated, often unconsciously, to bolster, defend, and justify the status quo–-that is, the prevailing social, economic, and political systems. Specifically, system Justification motive increases as a) the perceived system inescapability and inevitability increases, b) the system is threatened or criticized c) the perceived dependability of the individual on the system increases. IV."}]