[{"url": "http://www.answers.com/Q/Where_did_the_ancient_Greeks_live", "passage_text": "In ancient times, the vast majority of the mainland Greeks lived in narrow valleys, isolated from each other by high mountain ranges (this was, however, not always the case: S … parta for example sat in a broad valley)."}, {"url": "http://www.allabouthistory.org/ancient-greeks-faq.htm", "passage_text": "Contrary to other pagan groups, the ancient Greeks believed that souls of the deceased were not reincarnated into another bodily form and placed back on earth, but lived on in either hell or heaven as a spirit. Their after life destination was presumably based on how well they lived their life prior to their death."}, {"url": "http://www.answers.com/Q/Where_did_the_ancient_Greeks_live", "passage_text": "The ancient Greeks lived in Greece. The normal house was a courtyard with rooms around it. Most Greeks lived near the Eastern Mediterranean sea and in southern Europe. Some citys they lived in are Athens, Sparta, and Crete. They inspired many cultures from their beliefs."}, {"url": "http://www.bbc.co.uk/schools/primaryhistory/ancient_greeks/greek_world/", "passage_text": "Ancient Greece had a warm, dry climate, as Greece does today. People lived by farming, fishing, and trade. Some were soldiers. Others were scholars, scientists or artists. Most Greeks lived in villages or in small cities."}, {"url": "http://www.bbc.co.uk/schools/primaryhistory/ancient_greeks/home_life/", "passage_text": "Most Greek houses were small, with a walled garden or yard in the middle. The house was made of sun-dried mud brick. Mud houses crumbled away in a few years, and had to rebuild. So archaeologists do not dig up the ruins of Ancient Greek homes."}, {"url": "http://www.bbc.co.uk/schools/primaryhistory/ancient_greeks/greek_world/", "passage_text": "The Ancient Greeks lived in mainland Greece and the Greek islands, but also in what is now Turkey, and in colonies scattered around the Mediterranean sea coast."}, {"url": "http://www.bbc.co.uk/schools/primaryhistory/ancient_greeks/greek_world/", "passage_text": "Ancient Greece is called 'the birthplace of Western civilisation'. About 2500 years ago, the Greeks created a way of life that other people admired and copied. The Romans copied Greek art and Greek gods, for example."}, {"url": "http://www.allabouthistory.org/ancient-greeks-faq.htm", "passage_text": "The ancient Greeks, regardless of the nuances of the religious shifts, believed it was a necessity to live in such a way as to appease the gods and thus diligently sought to offer frequent sacrifices, prayers and hymns, living in constant awareness of the imminent anger of the gods."}]