[{"url": "https://www.petpremium.com/pet-health-center/care/dog-pregnancy-and-birth/", "passage_text": "Dog Pregnancy and Birth. A dog pregnancy is medically defined as the time period between conception and birth or the time in which puppies are developing inside a female dog’s uterus. If your dog is pregnant, you may be excited but a little apprehensive as well. To ensure that your pet has a healthy litter, the following information can help"}, {"url": "http://pets.webmd.com/dogs/signs-dog-pregnant", "passage_text": "See Your Vet. If you think your dog is pregnant, take her to your vet. It's a good idea to take her for a prenatal checkup 2 or 3 weeks after she has mated. Your vet can answer any questions you may have, such as the type of food pregnant dogs should eat and what changes you should expect. "}, {"url": "http://www.ehow.com/about_6534430_period-pregnancy-dogs.html", "passage_text": "puppies image by Bobi from Fotolia.com. The period of pregnancy in dogs is called gestation. During gestation the puppies develop in the mother's uterus. Average gestation in dogs lasts approximately nine weeks, or 63 days. However, puppies can be born as early as 58 days or as late as 68 days. Unlike humans, pregnancy in dogs cannot be confirmed with a urine or blood test. Instead, veterinarians rely on feeling a dog's abdomen 26 to 35 days after breeding for signs. However, this proves only 85 percent accurate. Owners may need to wait 45 days after breeding to see true confirmation on an X-ray."}, {"url": "http://www.aboutsmalldogbreeds.com/dog-gestation-period.html", "passage_text": "Hopefully this canine gestation period chart will take the guess work out of this exciting time for you and your new mother. As with human pregnancy times, the gestation period of a dog may vary by a day or two either way. When your little sweetheart is about 35 days into her doggie pregnancy, she will need about twice her normal amount of food. She is also going to need almost double that when she starts nursing her little pups. Plan the Big Day. Dog gestation period is the time is takes from date of mating to the date when you can expect your little puppies. Always a big event. This chart helps you to plan the arrival of the little ones."}, {"url": "http://www.pethealthandcare.com/blog/dog-health/dog-pregnancy-cycle.html", "passage_text": "Dog Pregnancy Cycle. A dog pregnancy cycle lasts about nine weeks or a little over two months. The due date is determined by calculating the number of days from the day the dog mated and delivery can occur anywhere between the 58th and the 64th day. "}, {"url": "http://www.enkivillage.com/how-long-are-dogs-pregnant.html", "passage_text": "The Average Length of a Dog's Pregnancy. The simple answer to this question is between 58 and 67 days, with the average time frame being closer to 63 days, or around 2 months. "}]