[{"url": "http://www.sparkpeople.com/calories-in.asp?food=mcdonalds+large+coke", "passage_text": "1 Calories Burned For Treadmill: 15% Incline, 10 mph (6 minutes per mile). 2  Calories Burned For Ladies Workout Express Circuit Training. 3  Calories Burned For Biking/Cycling: 10-11.9 mph (6 minutes per mile- 5 minutes per mile). "}, {"url": "http://www.huffingtonpost.com/2012/06/14/sugary-beverages-calories_n_1595014.html", "passage_text": "A 12-ounce can of the summer favorite clocks in at 150 calories, more than a can of Coke and the same as a can of Pepsi. Photo from Amazon.com. Snapple Apple Fruit Drink. Amazon.com. There are 100 calories in every 8 ounces of this fruity pick, but the bottle is deceiving, since it packs 16 ounces. The ban would apply to drinks larger than 16 ounces, hitting back hard at some of those all-too-common, outrageously large portion sizes -- but even smaller portions can carry hefty calorie counts. Cola always seems to be the face of this sugary beverage enemy, but Coke and Pepsi are only the beginning. A 12-ounce can of Coca Cola clocks in at 140 calories, and the same size Pepsi has 150. But a can or bottle of these 11 sugary drinks has even more"}, {"url": "http://www.myfitnesspal.com/food/calories/amc-theaters-large-coke-39629037", "passage_text": "*Percent Daily Values are based on a 2000 calorie diet. Your daily values may be higher or lower depending on your calorie needs. "}, {"url": "http://www.fatsecret.com/calories-nutrition/coca-cola/coca-cola-classic-(20-oz)", "passage_text": "There are 240 calories in a 1 bottle serving of Coca-Cola Coca-Cola Classic (20 oz). Calorie breakdown: 0% fat, 100% carbs, 0% protein. Additional Description/Notes: Changed calories from 258 to 240, changed sodium from 60 to 75,changed total carbs from 64 to 65. These are the nutritional guidelines as provided by Coca Cola. Do not change unless you check your facts first at the source."}, {"url": "http://www.weightlossresources.co.uk/calories/calorie_counter/drinks.htm", "passage_text": "Our chart shows how many calories in a selection of drinks. Alternatively you can search our food database to find calories in over 60,000 foods and calculate the calories in your serving. Try it Free"}, {"url": "http://www.fatsecret.com/calories-nutrition/mcdonalds/coca-cola-(large)", "passage_text": "Percent Daily Values are based on a 2000 calorie diet. Your daily values may be higher or lower depending on your calorie needs. Information for this food was submitted to the FatSecret food database by member myTybaby on 16 Jun 10, and last modified on 28 Oct 14 by member Great567. "}, {"url": "http://www.answers.com/Q/How_many_calories_does_a_large_fountain_coke_have", "passage_text": "It depends on a number of things: the type of whiskey, the type of coke, the amount of whiskey and the amount of coke. A typical glass of 25 ml Scotch whiskey and 100 ml Coca- … Cola will normally contain about 65 calories for the whiskey and about 45 calories for the Coca-Cola, making it about 110 calories in total. 35 ml of Scotch and 90 ml of Coca-Cola is about 120 calories. One of the most fattening whiskey and cokes you can drink is a Jack Daniels and coke, which has about 130 calories for just a 25 ml serving of whiskey. However, a Southern Comfort and diet coke drink will contain less than 80 calories for a 25 ml serving. The calorie content of whiskey (whiskey in Scotland) differs depending on the grains used to make the drink, which includes barley, malted barley, rye, malted rye, wheat, maize and corn. One of the most fattening whiskey and cokes you can drink is a Jack Daniels and coke, which has about 130 calories for just a 25 ml serving of whiskey"}, {"url": "http://www.myfitnesspal.com/food/calories/coca-cola-large-coke-icee-55454698", "passage_text": "*Percent Daily Values are based on a 2000 calorie diet. Your daily values may be higher or lower depending on your calorie needs. "}]