[{"url": "http://www.herbwisdom.com/herb-agnus-castus.html", "passage_text": "Vitex agnus-castus has been used since ancient times as a female remedy. One of its properties was to reduce sexual desire and it is recorded that Roman wives whose husbands were abroad with the legions spread the aromatic leaves on their couches for this purpose. "}, {"url": "http://health.howstuffworks.com/wellness/natural-medicine/herbal-remedies/chaste-tree-herbal-remedies.htm", "passage_text": "Vitex, also known as Chaste Tree or Monk's Pepper, was said to be used as herbal remedy by monks in the Middle Ages to diminish their sex drive, and its common names stem from its use by monks to maintain celibacy. Chaste tree's berries also can be used for menopausal bleeding irregularities, such as frequent or heavy bleeding; it is often combined with hormonal herbs such as black cohosh or soy. Therapy of six months to one year is usually recommended. Chaste tree is a slow-acting herb and can take months to produce effects."}, {"url": "https://en.wikipedia.org/wiki/Vitex_agnus-castus", "passage_text": "Vitex agnus-castus, also called vitex, chaste tree, chasteberry, Abraham's balm, lilac chastetree, or monk's pepper, is a native of the Mediterranean region. It is one of the few temperate-zone species of Vitex, which is on the whole a genus of tropical and sub-tropical flowering plants. Vitex, its name in Pliny the Elder, is derived from the Latin vieo, meaning to weave or to tie up, a reference to the use of Vitex agnus-castus in basketry. Its macaronic specific name repeats  chaste  in both Greek and Latin, and considered to be sacred to the goddess Hestia / Vesta."}, {"url": "http://www.babyhopes.com/articles/vitex.html", "passage_text": "Also known as Chaste Berry, Vitex Agnus-Castus, is an herb that has used to correct hormonal imbalances in women for centuries. The berries from the Vitex agnus-castus tree are used to create herbal supplements that can help improve your hormone balance and increase your fertility. If you have any of these hormonal issues and want to get pregnant, vitex may be beneficial to you. 1  PMS or PMDD. 2  Missing or Irregular Periods. 3  Anovulation."}, {"url": "http://natural-fertility-info.com/vitex", "passage_text": "Vitex is a beautiful shrub native to Greece and Italy whose berries have been used in herbal medicine for centuries. It is considered one of the most popular herbs in Europe and other Western nations for the support of gynecological imbalances. Vitex is a fantastic herb for fertility, helping with a range of issues such as PMS, low progesterone, lack of ovulation, irregular menstrual cycles, lack of a menstrual cycle, acne and so much more. Vitex offers many benefits but requires patience and consistency of use."}, {"url": "http://www.webmd.com/vitamins-supplements/ingredientmono-968-VITEX%20AGNUS-CASTUS.aspx?activeIngredientId=968&activeIngredientName=VITEX%20AGNUS-CASTUS", "passage_text": "Historians say that monks chewed chaste tree parts to make it easier to maintain their celibacy. Vitex agnus-castus is also used for acne, nervousness, dementia, joint conditions, colds, upset stomach, spleen disorders, headaches, migraine, eye pain, body inflammation, and swelling. Some people apply vitex agnus-castus to the skin to flush out parasites and to prevent insect bites and stings. Taking vitex agnus-castus with these medications might increase the effects and side effects of some medications used for Parkinson's disease. Some medications used for Parkinson's disease include bromocriptine (Parlodel), levodopa (Dopar, component of Sinemet), pramipexole (Mirapex), ropinirole (Requip), and others."}, {"url": "http://www.webmd.com/vitamins-supplements/ingredientmono-968-VITEX%20AGNUS-CASTUS.aspx?activeIngredientId=968&activeIngredientName=VITEX%20AGNUS-CASTUS", "passage_text": "Vitex agnus-castus is sometimes called “the women’s herb.” It is used for menstrual cycle irregularities, premenstrual syndrome (PMS), a more severe form of PMS called premenstrual dysphoric disorder (PMDD), and symptoms of menopause. Taking vitex agnus-castus with these medications might increase the effects and side effects of some medications used for Parkinson's disease. Some medications used for Parkinson's disease include bromocriptine (Parlodel), levodopa (Dopar, component of Sinemet), pramipexole (Mirapex), ropinirole (Requip), and others."}, {"url": "https://en.wikipedia.org/wiki/Vitex", "passage_text": "The genus Vitex was named by Linnaeus in Species Plantarum in 1753. Vitex was the name used by Pliny the Elder for Vitex agnus-castus. It is derived from the Latin vieo, meaning to weave or to tie up, a reference to the use of Vitex agnus-castus in basketry. "}]