[{"url": "http://www.medhelp.org/posts/Womens-Health/What-is-the-normal-size-of-the-uterus/show/32471", "passage_text": "In inches, the size of my uterus was 6.3 inches (length) x 4.3 inches (width) x 3.9 inches (AP diameter). Because I'm petite, my uterus could be felt above my belly button. I'm 47 and 4 years from the average age of onset of menopause (51)."}, {"url": "http://www.md-health.com/Uterus-Size.html", "passage_text": "Size after Puberty. The normal length is about 7.6 cm and width is 4.5 cm. The average normal thickness is 3.0 cm and in an adult female, the uterus weights about 60 grams but ranges up to 200 grams depending on various conditions. A variety of factors can result in enlargement of the uterus."}, {"url": "http://www.nuff.org/health_theuterus.htm", "passage_text": "A normal uterus is typically the size and shape of an upside down pear and weighs somewhere around 6 ounces. Its dimensional size is about eight to ten centimeters by six centimeters (roughly 3-4 inches by 2 inches)."}, {"url": "http://www.hersfoundation.com/docs/Fibroids.html", "passage_text": "In the middle 40's, the uterus including fibroids is, on average, about the size of a 14-16 week pregnancy--about 17cm in the largest dimension. And for women in their late 40's to early 50's, the uterus including fibroids is, on average, the size of an 18-20 week pregnancy--about 21"}, {"url": "http://www.tandurust.com/health-faq-2/normal-size-of-a-uterus.html", "passage_text": "The uterus is a very important part of a woman. No more than an avocado in size when the women is not pregnant, it holds the baby for the full course of 9 months of pregnancy. The normal size of a uterus may vary from woman to woman, although the general dimension should not exceed 3 inches in long."}, {"url": "http://www.md-health.com/Uterus-Size.html", "passage_text": "The prepubertal uterus is about 3.5 cm in length and thickness is on average 1 cm. Hormonal stimulation that occurs during puberty will result in rapid growth and changes in the size of the uterus. The normal length is about 7.6 cm and width is 4.5 cm. The average normal thickness is 3.0 cm and in an adult female, the uterus weights about 60 grams but ranges up to 200 grams depending on various conditions. A variety of factors can result in enlargement"}, {"url": "http://www.buzzle.com/articles/normal-size-of-uterus.html", "passage_text": "The normal size of the uterus in cm is said to be 7.6 cm x 4.5 cm x 3 cm, with the length being 7.6 cm and width being 4.5 cm. Its thickness (anteroposterior diameter) is usually around 3 cm. The volume of the uterus varies and fluctuates between 75cc and 200cc."}, {"url": "http://www.medhelp.org/posts/Womens-Health/What-is-the-normal-size-of-the-uterus/show/32471", "passage_text": "Normal size of a non-pregnant uterus is sort of the size of a pear or maybe an avocado for a bigger girl. It grows to grapefruit size very fast in early pregnancy, then on from there. A very stretchy muscle, and very accomodating of things inside it."}]