[{"url": "http://www.carsdirect.com/auto-loans/what-credit-score-do-you-need-for-an-auto-loan", "passage_text": "Your credit score is very important when shopping for an auto loan, as it's what lenders look to as a point of reference. Here is a breakdown of the typical interest rates you can expect with different credit scores: 1  850 - 740: Excellent credit score - 3.2% interest rate (on average). "}, {"url": "http://carbuyinghowto.com/good-credit-score-to-buy-a-car/", "passage_text": "Credit Score: 300-499 – This is not a good credit score to buy a car. In fact this is a bad to very bad credit score and sometimes the best option for buying and financing a car is at one of the many Buy Here Pay Here car dealers scattered across the country. They specialize in low credit score car buying and financing. Lenders want to lend you money to purchase a car. Obviously this is the ideal credit score for buying a car, but not everyone has such a score. Credit Score: 680-719 – This is recognized by most auto lenders to be"}, {"url": "http://blog.quizzle.com/2013/06/what-kind-of-credit-score-do-i-need-to-buy-a-car/", "passage_text": "On the other hand, if you have credit score below 620 and you’re applying for an auto loan, you could end up with a very high interest rate, upwards of 18% or 20% – costing you thousands of dollars more over the lifetime of your auto loan. A car loan may be out of the picture entirely. But bad credit doesn’t mean that you can’t buy a new set of wheels. Regardless of your credit score, you still have other financing options if you want to purchase a car."}, {"url": "http://blog.readyforzero.com/what-is-a-good-credit-score-to-buy-a-car/", "passage_text": "MyFICO.com offers an up-to-date chart on the interest rate you can expect to pay for various FICO score levels, depending upon the length of your loan. According to their chart, a “good” credit score to have in terms of an interest rate below 5% is between 690-850 for a 36 month loan."}, {"url": "http://www.carfax.com/blog/credit-score-for-car-loans/", "passage_text": "Thus, if a lender is touting a 2 percent interest rate on a car loan, you should know that this rate applies only to people with the best credit. If you have a subprime credit score, your loan rate may fall between 6 and 10 percent, perhaps more. FICO may not be the only credit score, but it is most likely the one used by your lender. While credit reports can be obtained for free, you must pay a nominal fee to retrieve your credit score. What is considered excellent credit has everything to do with the car loan you are seeking."}, {"url": "http://carbuyinghowto.com/good-credit-score-to-buy-a-car/", "passage_text": "Credit Score: 500-579 – The minimum credit score to buy a car falls in this range. When your credit score is in this range lenders are hesitant to grant you a car buying loan. There are lenders that will, but they are sub-prime lenders and a down payment of some kind is required. Lenders want to lend you money to purchase a car. Obviously this is the ideal credit score for buying a car, but not everyone has such a score. Credit Score: 680-719 – This is recognized by most auto lenders to be a good credit score to buy a car."}, {"url": "http://carbuyinghowto.com/good-credit-score-to-buy-a-car/", "passage_text": "Having a good credit score for buying car is critical to getting the car you want at a rate you can afford. Bad credit or Good credit Click Here to get approved first and save some time and money. Find out your credit score and protect your identity. Lenders want to lend you money to purchase a car. Obviously this is the ideal credit score for buying a car, but not everyone has such a score. Credit Score: 680-719 – This is recognized by most auto lenders to be a good credit score to buy a car."}, {"url": "http://blog.credit.com/2014/09/what-credit-score-to-buy-a-car-95781/", "passage_text": "You know it’s time to for a new vehicle, but there’s one thing holding you back: your credit. You aren’t sure what credit score you need to buy a car. If you absolutely must get another vehicle, you can probably find a way to finance it. The real question is what it will cost you. The better your credit, the better your options, and a big factor will be your credit scores. "}, {"url": "http://www.creditscoreresource.com/what-does-your-credit-score-need-to-be-to-get-a-car-loan/40185", "passage_text": "Lenders will always have a range of credit scores they find acceptable for the different loans and financing offers they provide. The credit score to get a car loan does not have to be high, however, it will still affect the financing and loan options for the car. Traditional lenders will always require fair or good credit score to get a car loan. The credit score for what they consider to be acceptable credit is between 620 and 700. "}, {"url": "http://finance.yahoo.com/news/credit-score-buy-car-120043623.html", "passage_text": "More from Credit.com. You know it’s time to for a new vehicle, but there’s one thing holding you back: your credit. You aren’t sure what credit score you need to buy a car. If you absolutely must get another vehicle, you can probably find a way to finance it. The real question is what it will cost you. "}]