[{"url": "http://steamykitchen.com/10725-crispy-roasted-chickpeas-garbanzo-beans.html", "passage_text": "Chickpeas and garbanzo beans are the same thing. Just one warning. as I ate the entire batch by myself in one sitting: These Roasted Chickpeas are really are perfect as a little bar snack to nibble on with beer. And I emphasize nibble and little. How to make Roasted Chickpeas/Garbanzo Beans. Four ingredients – salt, seasoning blend of your choice, garbanzo beans and olive oil. First drain the can of garbanzo beans. You’ll want to rinse the beans for a few seconds to rid the surface of the cloudy, starchy, slippery water it was packaged in."}, {"url": "https://en.wikipedia.org/wiki/Chickpea", "passage_text": "The chickpea or chick pea (Cicer arietinum) is a legume of the family Fabaceae, subfamily Faboideae. It is also known as gram, or Bengal gram, garbanzo or garbanzo bean, and sometimes known as Egyptian pea, ceci, cece or chana, or Kabuli chana (particularly in northern India). Its seeds are high in protein. It is one of the earliest cultivated legumes: 7,500-year-old remains have been found in the Middle East. Hummus with olive oil. Hummus is the Arabic word for chickpeas, which are often cooked and ground into a paste and mixed with tahini (sesame seed paste), the blend called hummus bi tahini, or chickpeas are roasted, spiced, and eaten as a snack, such as leblebi."}, {"url": "http://cooking.stackexchange.com/questions/47748/what-is-the-difference-between-chickpeas-and-garbanzo-beans", "passage_text": "They're the same thing. About the only difference is that garbanzo bean is less common in British English than in American English, and chickpea is more common either way, but it's just a language thing. There are indeed different varieties, with some smaller and some larger, but they don't have common language names like that"}, {"url": "http://www.entirelypets.com/honey-roasted-chickpeas-recipe.html", "passage_text": "Let us know in the comments! Chickpeas and garbanzo beans are the same thing so look for either but always try to go for organic. Watch out for salt too since sea salt is the only kind considered safe for dogs. The brand I use contains only water and seaweed, another healthy ingredient for dogs. "}, {"url": "http://cooking.stackexchange.com/questions/47748/what-is-the-difference-between-chickpeas-and-garbanzo-beans", "passage_text": "Almost everywhere on the internet I see that garbanzo beans and chickpeas are the same thing. Here on Seasoned Advice I also see that the tag chickpeas comes up when you type garbanzo. About the only difference is that garbanzo bean is less common in British English than in American English, and chickpea is more common either way, but it's just a language thing."}, {"url": "http://healthyeating.sfgate.com/nutrients-benefits-chick-peas-garbanzo-beans-7490.html", "passage_text": "Chickpeas contain healthy protein, fiber, vitamins and minerals. Chickpeas, also called garbanzo beans, belong to the legume family, which includes a variety of beans, peanuts, soybeans and lentils."}, {"url": "http://steamykitchen.com/10725-crispy-roasted-chickpeas-garbanzo-beans.html", "passage_text": "Make sure that the beans do not burn. 4. Season with salt and spice blend. 1. Preheat oven to 400F. 2. Drain the can of garbanzo beans in a strainer and rinse with water for a few seconds to clean off the beans. Shake and tap the strainer to rid of excess water. Lay paper towl on a baking sheet, and spread the beans over. Use another paper towel to gently press and absorb the water on the beans. How to make Roasted Chickpeas/Garbanzo Beans. Four ingredients – salt, seasoning blend of your choice, garbanzo beans and olive oil. First drain the can of garbanzo beans. You’ll want to rinse the beans for a few seconds to rid the surface of the cloudy, starchy, slippery water it was packaged in."}, {"url": "http://www.differencebetween.net/object/comparisons-of-food-items/processed-foods/difference-between-garbanzo-beans-and-chickpeas/", "passage_text": "Garbanzo Beans vs Chickpeas. Garbanzo beans and chickpeas are the same plant, or specifically, the same legume. Like many plants, garbanzo beans and chickpeas are just one of the various names and layman’s terms of the Cicer arietinum. Though referring to the same species, “chickpea” is often the common name used for English-speaking people while “garbanzo” is used by Spanish-speaking people. In a nation with both languages present, the names might be used interchangeably. Two types of garbanzo beans or chickpeas are known, the Kabuli and the Desi. The Kabuli means from Kabul. It has a light color with large seeds as well as a smooth coat. It also has a uniform size and a round shape"}, {"url": "http://www.differencebetween.net/object/comparisons-of-food-items/processed-foods/difference-between-garbanzo-beans-and-chickpeas/", "passage_text": "Summary: 1.Garbanzo beans and chickpeas are the same thing. They are both common names for a plant specie named Cicer arietinum. Because they are the same plant and entity, they share the same scientific classification, uses, types, and other identifying characteristics. Though referring to the same species, “chickpea” is often the common name used for English-speaking people while “garbanzo” is used by Spanish-speaking people. In a nation with both languages present, the names might be used interchangeably. Two types of garbanzo beans or chickpeas are known, the Kabuli and the Desi. The Kabuli means from Kabul. It has a light color with large seeds as well as a smooth coat. It also has a uniform size and a round shape"}]