[{"url": "http://www1.salary.com/Membership-Assistant-salary.html", "passage_text": "For example the median expected annual pay for a typical Membership Assistant in the United States is $36,266 so 50% of the people who perform the job of Membership Assistant in the United States are expected to make less than $36,266. Source: HR Reported data as of October 2015. Median $36,266. Processes periodical subscriptions and membership applications or changes. Maintains membership records, solicits and acknowledges memberships, and prepares advertisements or correspondence regarding the organization and its programs."}, {"url": "http://www.answers.com/Q/How_much_does_costco_pay", "passage_text": "Service clerks, Meat Department, cashiers make $11.25-$11.50 per hour to start and time and a half for Sundays. When I worked 3rd shift For Wal-Mart 8 month ago they paid $10.20 per hour and only $1.00 an hour extra for Sundays. In addition, Costco offers the best health insurance for Part Time/ Full Time employees in the retail industry. Not to mention, paid holidays, paid vacation. Typically employees start out at 11.00 an hour as a low level employee. If you're assistant manager you'll start at about 12.50. in the first 400 hours theres a .25 raise and … more occur after each block of 800 hours. Everyone starts off at 11/hr and you get a .50 raise when you reach a certain goal in your hours."}, {"url": "http://www1.salary.com/Membership-Assistant-salary.html", "passage_text": "The annual salary for someone with the job title Membership Assistant may vary depending on a number of factors including industry, company size, location, years of experience and level of education. Processes periodical subscriptions and membership applications or changes. Maintains membership records, solicits and acknowledges memberships, and prepares advertisements or correspondence regarding the organization and its programs."}, {"url": "http://www.salarylist.com/company/Costco-Salary.htm", "passage_text": "Costco Salary. Costco average salary is $77,208, median salary is $76,043 with a salary range from $23,858 to $126,000. Costco salaries are collected from government agencies and companies. Each salary is associated with a real job position. Costco salary statistics is not exclusive and is for reference only. Costco average salary is $77,208, median salary is $76,043 with a salary range from $23,858 to $126,000. Costco salaries are collected from government agencies and companies. Each salary is associated with a real job position"}, {"url": "http://www.answers.com/Q/How_much_does_costco_pay", "passage_text": "I work for Costco in California. They currently are hiring people in at $11.00 an hour, and time and a half on sundays. I work at warehouse 307 in Nashua New Hampshire base rate pay is $11.00 -$11.50 per hour. Typically employees start out at 11.00 an hour as a low level employee. If you're assistant manager you'll start at about 12.50. in the first 400 hours theres a .25 raise and … more occur after each block of 800 hours. Everyone starts off at 11/hr and you get a .50 raise when you reach a certain goal in your hours."}, {"url": "http://www.indeed.com/cmp/Costco-Wholesale/salaries", "passage_text": "The average Costco Wholesale salary ranges from approximately $15,000 per year for Vendor to $145,000 per year for Database Administrator. "}, {"url": "http://www1.salary.com/Membership-Assistant-salary.html", "passage_text": "Job Description for Membership Assistant. Assists in the recruitment and retention of members for a membership organization or association. Processes periodical subscriptions and membership applications or changes. Maintains membership records, solicits and acknowledges memberships, and prepares advertisements or correspondence regarding the organization and its programs."}, {"url": "http://www.payscale.com/research/US/Employer=Costco_Wholesale_Company/Salary", "passage_text": "It's pretty easy to fin... Key Results of the 2015 Women In the Workplace Study. Women in the Workplace, a recent study conducted by LeanIn.org and McKinsey & Company – building off of similar work done by the latter in 2012 – exam... How to Influence Without Authority. "}]