[{"url": "http://www.thechicagotraveler.com/2012/07/10-famous-people-from-chicago/", "passage_text": "People like Al Capone made a mark in Chicago but were not born here. Ted Kaczynski, the Unabomber, was born in Chicago and is one of the world’s most famous criminals. July 18, 2012 3 Comments Written by Al. Chicago has long been known to be a top producer of celebrities and famous people. There are hundreds of people that have lived in and made Chicago proud; however, many of these people were not born in Chicago. The Chicago Traveler has compiled a list of the Top 10 famous people that were born in Chicago"}, {"url": "http://www.ranker.com/list/famous-people-from-illinois/reference", "passage_text": "List of famous people from Illinois, including photos when available. The people below are listed by their popularity, so the most recognizable names are at the top of the list. Some of the people below are celebrities born in Illinois, while others are simply notable locals. If you're from Illinois you might already know that these prominent figures are also from your hometown, but some of the names below may really surprise you. This list includes people who were born and raised in Illinois, as well as those who were born there but moved away at a young age. People include everything from John S. Kyser to Rex Ingram. "}, {"url": "http://www.imdb.com/search/name?birth_place=Chicago%2C+Illinois%2C+USA&", "passage_text": "Jennifer Morrison Actress, Warrior Jennifer Marie Morrison was born in Chicago, Illinois, the oldest child of teachers David and Judy Morrison. She was raised in Arlington Heights, IL, with a younger sister and brother. She attended the same school her parents taught at, Prospect High School. Terrence Howard Actor, Iron Man Terrence Howard was born in Chicago, Illinois, to Anita Jeanine Williams (nee Née) hawkins And Tyrone. Howard he was raised In, Cleveland. Ohio his love for acting came, naturally through summers spent with his-great, Grandmother New york stage Actress Minnie. gentry"}, {"url": "http://www.imdb.com/search/name?birth_place=Chicago%2C+Illinois%2C+USA&", "passage_text": "Mandy Patinkin Actor, Pilot Mandy Patinkin was born Mandel Bruce Patinkin in Chicago, Illinois, to Doris Doralee (Sinton), a homemaker and cookbook writer, and Lester Patinkin, who operated two scrap metal plants. Terrence Howard Actor, Iron Man Terrence Howard was born in Chicago, Illinois, to Anita Jeanine Williams (nee Née) hawkins And Tyrone. Howard he was raised In, Cleveland. Ohio his love for acting came, naturally through summers spent with his-great, Grandmother New york stage Actress Minnie. gentry"}, {"url": "http://www.imdb.com/search/name?birth_place=Chicago%2C+Illinois%2C+USA&", "passage_text": "Jennifer Beals Actress, Flashdance Jennifer Beals was born on December 19, 1963 in Chicago, Illinois, and grew up in the city. She is the daughter of Jeanne (Anderson), an elementary school teacher, and Alfred Leroy Beals, who owned grocery stores. Terrence Howard Actor, Iron Man Terrence Howard was born in Chicago, Illinois, to Anita Jeanine Williams (nee Née) hawkins And Tyrone. Howard he was raised In, Cleveland. Ohio his love for acting came, naturally through summers spent with his-great, Grandmother New york stage Actress Minnie. gentry"}, {"url": "http://www.thingstodo.com/states/IL/famous_people.htm", "passage_text": "Harrison Ford (1942 -) Actor made famous in the original Star Wars trilogy and as Indiana Jones in the Indiana Jones film series. His career spans 6 decades and includes roles in several blockbusters including The Fugitive, Blade Runner, Air Force One and Clear and Present Danger. Born in Chicago, IL (141). Anthony Joseph Adducci (1937 - 2006) A pioneer of the medical device industry in Minnesota. He is best known for co-founding Guidant Corp., the company that manufactured the world's first lithium battery powered artificial pacemaker. Born in Chicago, IL (1233). Eddie Albert (1906 - 2005) Born Edward Albert Heimberger."}, {"url": "http://www.ranker.com/list/celebrities-who-live-in-chicago/celebrity-lists", "passage_text": "75+ Celebrities Who Live in Chicago. Several famous actors, musicians, and comedians have lived in Chicago. Many celebrities were born in Chicago and others relocated to the Windy City to start their career in comedy and theater. One of the most powerful people in the world even has a home in Chicago. This l ist of celebrities who live in Chicago and famous Chicagoans has been loosely ranked by fame and popularity. "}, {"url": "https://en.wikipedia.org/wiki/List_of_people_from_Quincy,_Illinois", "passage_text": "The following list includes notable people who were born or have lived in Quincy, Illinois. For a similar list organized alphabetically by last name, see the category page People from Quincy, Illinois. "}]