[{"url": "http://www.rd.com/health/healthy-eating/how-long-can-you-store-meat-in-the-fridge-or-freezer/", "passage_text": "Red meat and pork can remain in the refrigerator up to 5 days and can be frozen for 4-12 months. Leftover cooked meat will last 3-4 days in the refrigerator and 2-6 months in the freezer. Ground meats (beef, veal, pork, or poultry) can be refrigerated for 1-2 days and frozen for 3-4 months. Lunchmeats and hot dogs will last two weeks in the refrigerator unopened and should be eaten within 3-5 days of opening (hot dogs can go a couple of days longer). In the freezer they’ll last 1-2 months. Bacon is safe to eat for up to a week in the fridge—but raw sausage should be eaten within two days. Both can be frozen for a month, and some sausage will freeze for twice as long. Eggs can be refrigerated for up to a month raw but no more than a week hard-boiled."}, {"url": "http://www.fsis.usda.gov/wps/portal/fsis/topics/food-safety-education/get-answers/food-safety-fact-sheets/meat-preparation/ground-beef-and-food-safety/ct_index", "passage_text": "Can I refrigerate or freeze leftover cooked hamburgers? How should they be reheated? If ground beef is refrigerated promptly after cooking (within 2 hours; 1 hour if the temperature is above 90 °F), it can be safely refrigerated for about 3 or 4 days. If frozen, it should keep its quality for about 4 months. "}, {"url": "http://www.startribune.com/how-long-can-beef-stay-in-refrigerator/43423877/", "passage_text": "A Ground beef should be used within two days of purchase. Be sure to check the use by information on the package label before purchase. You can store ground beef safely in your refrigerator at 35 to 40 degrees, for one to two days. If you can't use it within that time, freeze it. It can be stored frozen for three to four months."}, {"url": "http://www.answers.com/Q/How_long_can_you_refrigerate_ground_beef", "passage_text": "uncooked ground beef can be kept in fridge well covered for about 5 days or until the bad smell of it tells you to throw it out. But the expiration date on package should also be noted. It isn't going to be safe to eat until it is cooked. For best quality, ground beef should be cooked within 2 days of purchase. Fre … eze the meat if you won't be able to use it in that time frame. If your fridge has a super-chill drawer, you might get an extra day or two before it starts to turn."}, {"url": "http://www.stilltasty.com/fooditems/index/16508", "passage_text": "1 How long does ground beef last in the fridge once it is cooked? 2  Cooked ground beef will usually stay good for 3 to 4 days in the fridge and 3 months in the freezer. 1 After ground beef is purchased, it may be refrigerated for 1 to 2 days — the sell-by date on the package may expire during that storage period, but the ground beef will remain safe to use after the sell by date if it has been properly stored."}, {"url": "http://askkaren.custhelp.com/app/answers/detail/a_id/502/~/how-long-does-it-take-for-beef-to-thaw%3F", "passage_text": "In the refrigerator, ground beef, stew meat, and steaks may thaw within a day. Bone-in parts and whole roasts may take 2 days or longer. Once the raw ground beef thaws, it will be safe in the refrigerator for 1 to 2 days. All other cuts of beef can be refrigerated safely for 3 to 5 additional days before cooking. During this time, if you decide not to use the beef, you can safely refreeze it without cooking. Thawing Tips: there are three safe ways to thaw beef: in the refrigerator, in cold water, and in the microwave."}, {"url": "http://www.meatsafety.org/ht/d/sp/i/26030/pid/26030", "passage_text": "If ground beef is refrigerated promptly after cooking, it can be safely refrigerated for about 3 or 4 days. If frozen, it should keep its quality for about 4 months. When reheating fully cooked patties or casseroles containing ground beef, be sure the internal temperature reaches 165 F or it is hot and steaming. Allow at least 24 hours in the refrigerator to defrost a 1 to 1 A½ â½ inch thick package of ground, beef which should be placed on a tray in the refrigerator the day before it will be. Prepared allow 12 hours in the refrigerator to defrost/1 2 to/3-4 inch thick ground beef. patties"}, {"url": "http://www.stilltasty.com/fooditems/index/16508", "passage_text": "1 Ground beef that has been defrosted in the fridge can be kept for an additional 1 to 2 days in the refrigerator before cooking; ground beef that was thawed in the microwave or in cold water should be cooked immediately. 1 After ground beef is purchased, it may be refrigerated for 1 to 2 days — the sell-by date on the package may expire during that storage period, but the ground beef will remain safe to use after the sell by date if it has been properly stored."}, {"url": "http://www.startribune.com/how-long-can-beef-stay-in-refrigerator/43423877/", "passage_text": "• For beef stored in the refrigerator, be sure to follow the use by information on package labels. If you can't remember when a food item was placed there, throw it out. All fresh ground beef should be used within two days of purchase. You can store ground beef safely in your refrigerator at 35 to 40 degrees, for one to two days. If you can't use it within that time, freeze it. It can be stored frozen for three to four months."}]