[{"url": "http://www.biography.com/people/geronimo-9309607", "passage_text": "Geronimo was a Bedonkohe Apache leader of the Chiricahua Apache, who led his people's defense of their homeland against the military might of the United States. A legend of the untamed American frontier, the Apache leader Geronimo was born in June 1829 in No-Doyohn Canyon, Mexico."}, {"url": "http://www.nytimes.com/learning/general/onthisday/bday/0616.html", "passage_text": "LAWTON, Okla., Feb. 17.--Geronimo, the Apache Indian chief, died of pneumonia to-day in the hospital at Fort Sill. He was nearly 90 years of age, and had been held at the Fort as a prisoner of war for many years. For many years he followed the lead of old Cochise, the hereditary chief of the Apaches, who died in 1875 and was succeeded by Natchez, his son, who, however, was soon displaced by Geronimo with his superior cunning and genius for the Indian method of warfare."}, {"url": "http://www.history.com/this-day-in-history/geronimo-surrenders", "passage_text": "The last American Indian warrior surrenders. For almost 30 years he had fought the whites who invaded his homeland, but Geronimo, the wiliest and most dangerous Apache warrior of his time, finally surrenders in Skeleton Canyon, Arizona, on this day in 1886. On this day in 1886, Apache chief Geronimo surrenders to U.S. government troops. For 30 years, the mighty Native American warrior had battled to protect his tribe’s homeland; however, by 1886 the Apaches were exhausted and hopelessly outnumbered."}, {"url": "http://publicdomainreview.org/2011/08/29/geronimo-the-warrior/", "passage_text": "In 1906 Geronimo published his autobiography recounting the fascinating story of his life, from his years as a resistance fighter, to his capture and subsequent period of celebrity in which he appeared at the 1904 St Louis World Fair and met President Roosevelt. In addition, Geronimo saw his autobiography as a way to make money; during his late years as a prisoner, he had learned the power of money and had taken to selling photographs, buttons, and other souvenirs."}, {"url": "http://genealogytrails.com/oka/Geronimo.html", "passage_text": "A Chiricahua Apache religious and military leader, Geronimo was born in the 1820s, perhaps near present Clifton, Arizona. His Apache name was Goyahkla (One Who Yawns). He achieved a reputation as a spiritual leader and tenacious fighter against those who threatened his people's ways of life. As prisoners of war Geronimo and his followers were exiled, being sent first to Florida, then to Alabama, and finally to Fort Sill, Oklahoma Territory, in 1894. Geronimo and 341 other Apache prisoners of war were brought to Fort Sill where they lived in villages on the range."}, {"url": "http://www.indians.org/welker/geronimo.htm", "passage_text": "Geronimo's war career was linked with that of his brother-in-law, Juh, a Chiricahua chief. Although he was not a hereditary leader, Geronimo appeared so to outsiders because he often acted as spokesman for Juh, who had a speech impediment. Geronimo was the leader of the last American Indian fighting force formally to capitulate to the United States."}, {"url": "http://www.biography.com/people/geronimo-9309607", "passage_text": "Early Years. A legend of the untamed American frontier, the Apache leader Geronimo was born in June 1829 in No-Doyohn Canyon, Mexico. He was a naturally gifted hunter, who, the story goes, as a boy swallowed the heart of his first kill in order to ensure a life of success on the chase"}, {"url": "http://www.ducksters.com/history/native_americans/geronimo.php", "passage_text": "1 Occupation: Apache Chief. 2  Born: June 1829 in Arizona. 3  Died: February 17, 1909 in Fort Sill, Oklahoma. 4  Best known for: Fighting against the Mexican and U.S. governments to protect his homeland. 5  Skydivers often yell Geronimo when they jump out of the airplane. Geronimo was born in eastern Arizona in the year 1829. At the time, his homeland was claimed by both the Mexican government and the Apache people. Geronimo's family was part of the Bedonkohe band of the Apache."}, {"url": "http://www.ducksters.com/history/native_americans/geronimo.php", "passage_text": "At around the age of seventeen, Geronimo became an Apache warrior. As a warrior he could get married. Geronimo was in love with a young girl named Alope from a nearby village. He presented Alope's father with a number of horses that he had taken in a raid and her father allowed them to get married. Geronimo was born in eastern Arizona in the year 1829. At the time, his homeland was claimed by both the Mexican government and the Apache people. Geronimo's family was part of the Bedonkohe band of the Apache."}]