[{"url": "http://www.insee.fr/en/methodes/default.asp?page=definitions/contrat-trav-duree-determinee.htm", "passage_text": "Definition. A fixed-term employment contract (or CDD) is an employment contract by which an employer (company, enterprise...) recruits an employee for a limited period of time. Such contracts are possible only to perform a specific, temporary task, and only in those cases set out by law."}, {"url": "http://www.minkenemploymentlawyers.com/employment-law-issues/types-of-employment-contracts-fixed-term-vs-indefinite-duration/", "passage_text": "Fixed Term Employment Contracts. In fixed-term contracts, the employment relationship is intended to last for only a specific and definite length of time or until a specific project is completed. Once the term or project is finished, the fixed-term employment relationship ends. Such employees are often referred to as being in a “contract” position."}, {"url": "https://www.gov.uk/fixed-term-contracts", "passage_text": "What counts as a fixed-term contract. Employees are on a fixed-term contract if both of the following apply: 1  they have an employment contract with the organisation they work for. 2  their contract ends on a particular date, or on completion of a specific task, eg a project."}, {"url": "http://www.mywage.co.za/main/decent-work/employment-security/fixed-term-contract", "passage_text": "A fixed term contract of employment is similiar to a contract of permanent employment. The difference is that the fixed term contract will stipulate a starting date and an ending date. The duration of the contract is clearly specified between employer and employee."}, {"url": "http://smallbusiness.chron.com/consequences-breach-fixedterm-employment-contract-employees-18662.html", "passage_text": "A fixed-term employment contract is a legal agreement that an employer signs with what is known as a contract employee. It outlines specific duties, payment terms and the ending date, after which the employee leaves the company unless he is retained under a new contract."}]