[{"url": "http://www.ehow.com/how_2319645_maintain-aloe-vera-plants.html", "passage_text": "Save. Aloe vera doesn't mean easy care in any known language, but maybe it should. Commonly called medicine aloe or burn plant, aloe vera requires little attention or care to thrive if properly planted. Give it a wind-protected spot with well-draining soil and bright sun and your aloe is likely good to go. Each plant grows to a clump 2 to 3 feet tall and wide, so allow enough space for the aloe vera to grow. Sarah Vantassel/Demand Media. Water and Fertilizer. Aloe vera is drought-tolerant, and rainfall alone is often enough to keep aloe vera happy in most climates, especially coastal climates."}, {"url": "http://www.almanac.com/plant/aloe-vera", "passage_text": "1 Water aloe deeply but then allow the soil to dry at least 1 to 2 inches deep between waterings, in order to discourage rot; water even less in winter. 2  Aloe plants produce offsets or plantlets or “babies” that can be removed to produce an entirely new plant. 1 Water aloe deeply but then allow the soil to dry at least 1 to 2 inches deep between waterings, in order to discourage rot; water even less in winter. 2  In spring, you could give the Aloe Vera some fertilizer--a diluted solution of bloom type fertilizer (10-40-10)."}, {"url": "http://www.gardeningknowhow.com/houseplants/aloe-vera/aloe-vera-plant-care.htm", "passage_text": "You can fertilize your aloe vera plant, but aloes do not need to be fertilized. If you decide to add fertilizing to part of your aloe vera plant care routine, aloe vera plants should be fertilized once a year in the spring. You can use a phosphorus-heavy water-based fertilizer at half strength. When the aloe plant is watered, the soil should be thoroughly drenched, but the water should be allowed to drain freely from the soil. The most common reason an aloe plant dies is that the owners water too often or do not allow the water to drain. Do not make this mistake when taking care of aloe houseplants."}, {"url": "http://www.gardeningknowhow.com/houseplants/aloe-vera/aloe-vera-plant-care.htm", "passage_text": "Another important part of how to grow an aloe plant is to water the plant properly. The soil of the aloe vera plant should be allowed to go completely dry before being watered. When the aloe plant is watered, the soil should be thoroughly drenched, but the water should be allowed to drain freely from the soil. The most common reason an aloe plant dies is that the owners water too often or do not allow the water to drain. Do not make this mistake when taking care of aloe houseplants."}, {"url": "http://www.gardenguides.com/108322-grow-maintain-aloe-vera-plants.html", "passage_text": "Step 1. Plant aloe vera in a loamy soil so that the roots are thoroughly covered by soil. Water the soil so that it is wet as soon as the aloe vera is in place. Do not water again until the soil is dry to the touch. Overview. Aloe vera, according to Union County College, is one of 250 species of aloes in the world. Aloes are part of the lily family and are also considered a succulent plant because of their ability to hold liquid in their leaves."}, {"url": "http://homeguides.sfgate.com/care-indoor-aloe-plant-44255.html", "passage_text": "1. Plant aloe in a pot that contains at least one large drainage hole and is 2 to 3 inches larger in diameter than the base of the aloe plant. Use a soil mixture formulated for cactus, or combine equal parts potting soil and coarse sand to make your own mix. Water the aloe plant only when the soil has dried out completely. Pour water onto the soil near the base of the plant until it drains from the bottom. Allow the pot to fully drain for about 30 minutes, and then promptly empty the drained water from the pot's drip tray."}, {"url": "http://www.ehow.com/how_2319645_maintain-aloe-vera-plants.html", "passage_text": "Sarah Vantassel/Demand Media. Soil and Sunlight. If you can't plant your aloe vera in well-draining soil, don't plant it at all. Aloe vera prefers sandy, gravelly or loamy soil with a pH of 7 to 8.5, and the plant will die in muddy or constantly wet soil. Each plant grows to a clump 2 to 3 feet tall and wide, so allow enough space for the aloe vera to grow. Sarah Vantassel/Demand Media. Water and Fertilizer. Aloe vera is drought-tolerant, and rainfall alone is often enough to keep aloe vera happy in most climates, especially coastal climates."}, {"url": "http://www.gardeningknowhow.com/houseplants/aloe-vera/aloe-vera-plant-care.htm", "passage_text": "The first step in aloe vera plant care is to realize that this plant is a succulent. Like cacti, succulents do best in dry conditions. When growing aloe vera plants, plant them in a cactus potting soil mix or a regular potting soil that has been amended with additional perlite or building sand. Also, make sure that the pot has plenty of drainage holes. Aloe vera plants cannot tolerate standing water. When the aloe plant is watered, the soil should be thoroughly drenched, but the water should be allowed to drain freely from the soil. The most common reason an aloe plant dies is that the owners water too often or do not allow the water to drain. Do not make this mistake when taking care of aloe houseplants."}, {"url": "http://www.almanac.com/plant/aloe-vera", "passage_text": "I have an aloe plant and I keep it inside by my window with indirect sunlight and water it exactly how I should: when the soil is a couple inches dry and just enough water to barely see seep through the bottom of the pot. But lately, the tips have turned brown and started to curl sideways slightly .. 1 Water aloe deeply but then allow the soil to dry at least 1 to 2 inches deep between waterings, in order to discourage rot; water even less in winter. 2  In spring, you could give the Aloe Vera some fertilizer--a diluted solution of bloom type fertilizer (10-40-10)."}]