[{"url": "https://en.wikipedia.org/wiki/Language", "passage_text": "Human language has the properties of productivity, recursivity, and displacement, and relies entirely on social convention and learning. Its complex structure affords a much wider range of expressions than any known system of animal communication. Africa is home to a large number of language families, the largest of which is the Niger-Congo language family, which includes such languages as Swahili, Shona, and Yoruba. Speakers of the Niger-Congo languages account for 6.9% of the world's population."}, {"url": "https://en.wikipedia.org/wiki/Language", "passage_text": "Human language is unique in comparison to other forms of communication, such as those used by non-human animals. Communication systems used by other animals such as bees or apes are closed systems that consist of a finite, usually very limited, number of possible ideas that can be expressed. Africa is home to a large number of language families, the largest of which is the Niger-Congo language family, which includes such languages as Swahili, Shona, and Yoruba. Speakers of the Niger-Congo languages account for 6.9% of the world's population."}, {"url": "http://mashable.com/2014/01/21/learn-programming-languages/", "passage_text": "Image: Wikimedia Commons. What it is: A general-purpose, imperative programming language developed in the early '70s, C is the oldest and most widely used language, providing the building blocks for other popular languages, such as C#, Java, JavaScript and Python. C is mostly used for implementing operating systems and embedded applications. "}, {"url": "http://anthro.palomar.edu/language/language_2.htm", "passage_text": "Humans are not unique in this capability. However, human language is unique in being a symbolic communication system that is learned instead of biologically inherited. Symbols are sounds or things which have meaning given to them by the users. Originally, the meaning is arbitrarily assigned. (They all are words for dog in European languages.). A word is one or more sounds that in combination have a specific meaning assigned by a language. The symbolic meaning of words can be so powerful that people are willing to risk their lives for them or take the lives of others."}, {"url": "http://faculty.washington.edu/ezent/el.htm", "passage_text": "Concise Language. A hallmark of effective writers is the ability to express the desired message in as few words as possible. Good writers, in other words, use language which is straightforward and to-the-point. Consider the following examples. (1) It is widely discussed by employees that many of them will be forced to change jobs and take on new responsibilities when the merger takes place between the two companies"}, {"url": "https://en.wikipedia.org/wiki/Programming_language", "passage_text": "A programming language is a formal constructed language designed to communicate instructions to a machine, particularly a computer. Programming languages can be used to create programs to control the behavior of a machine or to express algorithms. A programming language is a notation for writing programs, which are specifications of a computation or algorithm. Some, but not all, authors restrict the term programming language to those languages that can express all possible"}, {"url": "https://en.wikipedia.org/wiki/Language", "passage_text": "Language is the ability to acquire and use complex systems of communication, particularly the human ability to do so, and a language is any specific example of such a system. The scientific study of language is called linguistics. Africa is home to a large number of language families, the largest of which is the Niger-Congo language family, which includes such languages as Swahili, Shona, and Yoruba. Speakers of the Niger-Congo languages account for 6.9% of the world's population."}, {"url": "http://changingminds.org/techniques/language/language.htm", "passage_text": "Use of Language. Techniques. When you seek to convince, persuade or otherwise change other people's minds, the language you use is extremely important. Each word is a little packet of meaning from which the other person infers understanding. It gets even more complex when words combine in the semantics of entire sentences. "}, {"url": "https://en.wikipedia.org/wiki/Programming_language", "passage_text": "It is difficult to determine which programming languages are most widely used, and what usage means varies by context. One language may occupy the greater number of programmer hours, a different one have more lines of code, and a third may consume the most CPU time. A programming language is a notation for writing programs, which are specifications of a computation or algorithm. Some, but not all, authors restrict the term programming language to those languages that can express all possible algorithms."}]