[{"url": "http://www.oceankayak.com/kayak_basics/choosing_a_kayak/single_or_tandem/", "passage_text": "This is one of the most basic questions you'll have to answer. While one person can paddle a tandem alone, it requires sitting in the rear of the kayak while ballasting the front. The kayak will move, but not at its optimal level. On the other hand, it's a lot of fun to go out with a partner, often safer, and usually cheaper than buying two boats. "}, {"url": "http://naturesportcentral.com/best-tandem-kayak-reviews/", "passage_text": "A 2 person kayak, otherwise called a tandem kayak, is simply a kayak that has room for two paddlers. This variety of kayaks is a relatively modern spinoff since kayaks were historically designed only for a single person. 1 The middle seat can be removed to convert the inflatable tandem kayak into a one person vessel for solo excursions. 2  An additional air chamber is present for safety – it ensure that you remain afloat no matter what. 3  Cons: 4  The limited carry capacity of 350 pounds leaves little room for extra cargo."}, {"url": "http://www.paddling.net/guidelines/showArticle.html?6", "passage_text": "Still, tandem boats are more versatile. It's easier for one person to paddle a tandem than it is to cram two adult paddlers into a solo pack canoe. That can be done, of course, but solo boats are best when paddledyou guessed itsolo. A skilled paddler can paddle most tandem canoes or kayaks soloyou can buy solo seats to put in many tandem boats, in factbut there's always a price to pay. Tandem boats are designed to be paddled by two (or more) paddlers. When paddled solo, they can be sluggish and unresponsive."}, {"url": "http://www.clubkayak.com/greenwave/showpage.asp?page=tandemkayaks", "passage_text": "1 A tandem allows both paddlers to arrive at exactly the same time, without one person always waiting for the other. 2  When one paddler is a child. 3  By using a tandem, your child can ride up front in their own seat, with plenty of room. 1 When one paddler is a child. 2  By using a tandem, your child can ride up front in their own seat, with plenty of room. 3  No more being squished between a parent's legs in a sit-in or sitting behind in the tank well of a sit-on-top boat. 4  Your child can even snooze as you paddle along."}, {"url": "http://www.canoekayak.com/gear/hobie-mirage-oasis/", "passage_text": "Hobie Mirage Oasis. Photo: Rob Casey. The most innovative tandem we tested, the Mirage Oasis can be powered by pedals, kayak paddles, plug-in eVolve electric motor, or by sail. At 14′-6″ long this one to two person kayak is fast, versitile, and is ideal for fishing, extended day trips, or casual paddling. Two Hobie Mirage Drives drop into each foot well to move the boat efficiently using pedal power."}, {"url": "http://www.clubkayak.com/greenwave/showpage.asp?page=tandemkayaks", "passage_text": "Tandem Kayaks-The Divorce Boat. Two people paddling one boat at the same time requires some level of communication. The person in front needs to relay information, such as Hey, there is a rock 10 feet in front of us. Turn left., and the person in back needs to be able to make corrective actions by steering the kayak. 1 When one paddler is a child. 2  By using a tandem, your child can ride up front in their own seat, with plenty of room. 3  No more being squished between a parent's legs in a sit-in or sitting behind in the tank well of a sit-on-top boat. 4  Your child can even snooze as you paddle along."}, {"url": "http://www.clubkayak.com/greenwave/showpage.asp?page=tandemkayaks", "passage_text": "Like a tandem bicycle, tandem kayaks can be good or bad, depending upon your perspective and intended use. We investigate when tandems work best in the next section, and a bit further down the page we look at three different types of boats, sit-on-top tandems, sit-in recreational and tandem sea kayaks. 1 When one paddler is a child. 2  By using a tandem, your child can ride up front in their own seat, with plenty of room. 3  No more being squished between a parent's legs in a sit-in or sitting behind in the tank well of a sit-on-top boat. 4  Your child can even snooze as you paddle along."}, {"url": "http://www.clubkayak.com/greenwave/showpage.asp?page=tandemkayaks", "passage_text": "Whether it is to take your friend, spouse, child or dog for a trip on a nearby river or bay, a tandem kayak can serve you well. Many couples start with a tandem and then as their kayaking skills develop, they purchase one or two single kayaks and keep the tandem for use by visiting friends and family. 1 When one paddler is a child. 2  By using a tandem, your child can ride up front in their own seat, with plenty of room. 3  No more being squished between a parent's legs in a sit-in or sitting behind in the tank well of a sit-on-top boat. 4  Your child can even snooze as you paddle along."}, {"url": "http://www.kayakfishingmagazine.net/articles/102-current-issue-featured-articles-on-kayak-fishing/628-choosing-a-fishing-kayak.html", "passage_text": "Sometimes a tandem is preferable. Two adults can use a tandem kayak like a flats boat. The person in the bow can stand and sight fish while the person in the back propels the kayak. I like tandems that have a dedicated center seat option so when used alone they act and feel like a single seat kayak. "}, {"url": "http://www.austinkayak.com/blog/2011/07/to-tandem-or-not-that-is-the-question/", "passage_text": "Pros – The ideal kayak for those who want to enjoy tandem or solo paddling. In some cases, depending on the model and capacity, a 3rd person (usually a child) can sit in the middle position. Also exhibits the same Pros as the standard tandems. A Pro/Con comparison between Tandem and Single Kayaks. I can’t even count the number of times I’ve heard the phrase “ I want to buy a tandem so that I can either paddle alone or with my… ” only to find that after a few trips, that same person actually finds themselves paddling alone the majority of the time."}]