[{"url": "http://www.livestrong.com/article/42153-lima-beans-nutrition-information/", "passage_text": "The Basics. A fourth-cup serving of baby lima beans—about 45 grams of beans—has about 170 calories, including 5 calories from fat. You'll get 32 grams of carbohydrates, including 10 grams of dietary fiber, and 10 grams of fiber from that serving of baby limas. The same size serving of large lima beans actually has fewer calories: One-fourth cup of large lima beans has 150 calories, with no calories from fat. For vegetarians, the fact that a serving of lima beans, whether of baby lima beans or of large lima beans, contains about 4 percent of the recommended daily value for protein can be a big plus because many protein sources are derived from animals."}, {"url": "http://www.whfoods.com/genpage.php?tname=foodspice&dbid=59", "passage_text": "Additional information about the amount of these nutrients provided by Lima beans can be found in the Food Rating System Chart. A link that takes you to the In-Depth Nutritional Profile for Lima beans, featuring information over 80 nutrients, can be found under the Food Rating System Chart. The Healthiest Way of Cooking Lima Beans. To cook lima beans, place them in a pot and add three cups of fresh water or broth for each cup of dried beans. The liquid should be about one to two inches above the top of the beans."}, {"url": "http://www.whfoods.com/genpage.php?tname=foodspice&dbid=59", "passage_text": "While there are many varieties of lima beans, the ones that are most popular in the U.S. are the Fordhook, commonly known as the butterbean, and the baby lima bean. The pod of the lima bean is flat, oblong and slightly curved, averaging about three inches in length. The Healthiest Way of Cooking Lima Beans. To cook lima beans, place them in a pot and add three cups of fresh water or broth for each cup of dried beans. The liquid should be about one to two inches above the top of the beans."}, {"url": "http://www.nutrition-and-you.com/lima-beans.html", "passage_text": "Lima beans come in several forms; fresh, dried, small (baby beans), large, and in variety of distinctive color patterns. In the US markets, fresh green lima hit the market by July. Fresh-frozen, dried, canned, or roasted beans can also be readily available in the store across the US. Furthermore, lima and butter beans are one of the excellent sources of minerals like molybdenum, iron, copper, manganese, calcium, magnesium. They hold (1724 mg) more potassium than red kidney beans (1359 mg), broad beans (1062 mg), black beans (1483 mg)."}, {"url": "http://www.sparkpeople.com/calories-in.asp?food=baby+lima", "passage_text": "1 Calories In Baby Lima bean salad. 2  59 calories, 2g fat, 9g carbs, 3g protein, 3g fiber. 3  Calories In Lemony Quinoa and Baby Lima Bean Salad. 4  180 calories, 7g fat, 24g carbs, 7g protein, 5g fiber. "}, {"url": "http://www.nutrition-and-you.com/lima-beans.html", "passage_text": "Lima beans are important sources of plant proteins. 100 g beans carry 338 calories and provide 21.46 g or 38% of daily recommended intake of protein. In addition, lima are rich source of antioxidants, vitamins, minerals, and plant sterols. They, fresh or dried, contain substantial amounts of dietary fiber (50% per100g RDA). Furthermore, lima and butter beans are one of the excellent sources of minerals like molybdenum, iron, copper, manganese, calcium, magnesium. They hold (1724 mg) more potassium than red kidney beans (1359 mg), broad beans (1062 mg), black beans (1483 mg)."}, {"url": "http://www.livestrong.com/article/42153-lima-beans-nutrition-information/", "passage_text": "Like most beans, lima beans are a good source of several different nutrients. A fourth-cup serving of baby lima beans—about 45 grams of beans—has about 170 calories, including 5 calories from fat. You'll get 32 grams of carbohydrates, including 10 grams of dietary fiber, and 10 grams of fiber from that serving of baby limas. The same size serving of large lima beans actually has fewer calories: One-fourth cup of large lima beans has 150 calories, with no calories from fat. For vegetarians, the fact that a serving of lima beans, whether of baby lima beans or of large lima beans, contains about 4 percent of the recommended daily value for protein can be a big plus because many protein sources are derived from animals."}, {"url": "http://www.nutrition-and-you.com/lima-beans.html", "passage_text": "In general, bush beans those yield small seeds often recognized as sieve or baby lima or butter beans. Whereas, vine or pole varieties are large seeds and categorized as lima beans. While small beans measure 3 x 2 cm in dimension, large lima beans measure 4 x 2.5 cm. Furthermore, lima and butter beans are one of the excellent sources of minerals like molybdenum, iron, copper, manganese, calcium, magnesium. They hold (1724 mg) more potassium than red kidney beans (1359 mg), broad beans (1062 mg), black beans (1483 mg)."}, {"url": "http://www.fns.usda.gov/sites/default/files/HHFS_BEANS_BABYLIMA_DRY_100378aug2012.pdf", "passage_text": "BEANS, BABY LIMA, DRY Date: August 2012 Code: 100378 PRODUCT DESCRIPTION • Dry baby lima beans are U.S. Grade A, canned dry and cooked and packed in salt water. PACK/YIELD • Dry baby lima beans are packed in 2-pound packages. A 2-pound bag of dry beans will be about 24 servings (½ cup each) after cooking. STORAGE • Store dry beans in a cool, dry place off the floor. Drain the soaked beans; rinse. with clean water and drain again. 3. Add 3 cups clean water for every 1 cup of dry. beans. 4. Bring to a boil, turn the heat down to low, and. cook slowly until tender—about 2 hours. 5. You may need to add more water during cooking."}]