[{"url": "http://www.wikihow.com/Tell-if-Your-Car%27s-Thermostat-Is-Stuck-Closed", "passage_text": "The thermostat in your car is responsible for controlling the amount of coolant released into your engine. When your car first starts up, the thermostat is closed and does not allow coolant into the engine until it is warmed up. The thermostat should open and allow coolant in once the engine is adequately heated. Sometimes the thermostat fails and remains closed. Locate your radiator and remove the cap. 3. Unfasten the radiator drain cock located near the bottom of the radiator and allow some of the coolant to drain out into a container with a lid until the level is below the upper radiator hose."}, {"url": "https://answers.yahoo.com/question/index?qid=20090201153228AA7NSDs", "passage_text": "· just now. Report Abuse. If it is stuck open then the car will not heat up to normal operating temp. driving down the road. if it is stuck closed it will over heat driving down the road. assuming that it is winter and you are wondering id say you don't get enough heat. either bad thermostat or no thermostat at all. · just now. Report Abuse. Very simple, if you take the thermostat off the car and immerse it in a saucepan with cold water and then heat the water till boiling point you will visually see the thermostat opening up, if it doesn't then the thermostat is faulty and then you have to renew it. It's a very inexpensive item"}, {"url": "http://www.ehow.com/how_4480353_know-car-thermostat-bad.html", "passage_text": "You will need a new thermostat gasket and gasket sealer to replace the old gasket once it is removed, even if your thermostat is in good condition. Disconnect the thermostat housing from the engine block, and you will find your thermostat sitting in the engine block. Remove the gasket and pull out the thermostat. Be sure the car engine and coolant is not hot when you drain the coolant. You may also disconnect the housing without first draining the coolant from the radiator, but you will need to be prepared to either absorb or catch the coolant, which is in the hose at the time, usually about 1 to 2 quarts."}, {"url": "http://www.doityourself.com/stry/4-symptoms-of-a-bad-car-thermostat", "passage_text": "1. Overheating: Bad thermostat can cause the car to swelter, as the thermostat is a heat-sensitive control device situated at the radiator hose. If the thermostat is stuck here, the radiator coolant would stop working, resulting in the car overheating."}, {"url": "http://www.wikihow.com/Tell-if-Your-Car%27s-Thermostat-Is-Stuck-Closed", "passage_text": "Locate your thermostat. The thermostat housing is usually under the upper radiator hose. Unbolt the housing and remove the thermostat, using a screwdriver and pliers. Locate your radiator and remove the cap. 3. Unfasten the radiator drain cock located near the bottom of the radiator and allow some of the coolant to drain out into a container with a lid until the level is below"}, {"url": "http://www.answers.com/Q/How_can_I_tell_if_my_thermostat_is_bad", "passage_text": "When the car is hot, squeeze the upper radiator hose. If it feels soft, then the thermostat is not opening and therefore bad. If you squeeze the hose and its hard to squ … eeze, then it is pressurized and the thermostat is open. That is one way to check if the thermostat is stuck closed. To test a thermostat remove it while the motor is cold and make sure it is not stuck open. If it is stuck open when cold it is faulty. If it it is closed put it in water on a … stove with a thermometer and heat the water."}, {"url": "http://www.ehow.com/how_4480353_know-car-thermostat-bad.html", "passage_text": "Before you remove the thermostat, you will need to drain the radiator partially down, so the coolant level in the radiator is below where the top hose connects to the radiator. You can save and reuse this coolant. Be sure the car engine and coolant is not hot when you drain the coolant. You may also disconnect the housing without first draining the coolant from the radiator, but you will need to be prepared to either absorb or catch the coolant, which is in the hose at the time, usually about 1 to 2 quarts."}, {"url": "http://www.ehow.com/how_4480353_know-car-thermostat-bad.html", "passage_text": "To actually test the thermostat, remove it from the thermostat housing in your car engine. To locate your thermostat, look to where the end of the top radiator hose leads on the engine. Be sure the car engine and coolant is not hot when you drain the coolant. You may also disconnect the housing without first draining the coolant from the radiator, but you will need to be prepared to either absorb or catch the coolant, which is in the hose at the time, usually about 1 to 2 quarts."}, {"url": "http://www.youtube.com/watch?v=o5uxFk_mFO4", "passage_text": "The easiest way to tell if a car's thermostat is faulty is by looking out for a car overheating or giving off no heat. Find out how a car thermostat works with help from an auto mechanic in this free video on car repair and diagnostics. Expert: Tom Brintzenhofe. "}]