[{"url": "http://www.daviddarling.info/encyclopedia/L/lymphatic_system.html", "passage_text": "After the fluid enters the lymph capillaries, it is called lymph. The second function of the lymphatic system is the absorption of fats and fat-soluble vitamins from the digestive system and the subsequent transport of these substances to the venous circulation. The lymphatic system includes the bone marrow, spleen, thymus, lymph nodes, and lymphatic vessels (a network of thin tubes that carry lymph and white blood cells, or leukocytes). Lymphatic vessels branch, like blood vessels, into all the tissues of the body."}, {"url": "http://www.answers.com/Q/What_specialized_lymphatic_capillaries_of_the_intestine_that_absorb_digested_fats", "passage_text": "Answered by The Community. Making the world better, one answer at a time. Lacteals are the specialized lymphatic capillaries of the small intestine which transfer fats from the digetive system into the blood. Chyle (pronounced Kyle) is milky fluid found in the lacteals formed by fat globules and lymph. "}, {"url": "http://www.vivo.colostate.edu/hbooks/pathphys/digestion/smallgut/absorb_lipids.html", "passage_text": "Transport of lipids into the circulation is also different from what occurs with sugars and amino acids. Instead of being absorbed directly into capillary blood, chylomicrons are transported first into the lymphatic vessel that penetrates into each villus. Chylomicron-rich lymph then drains into the system lymphatic system, which rapidly flows into blood. In order for the triglyceride to be absorbed, two processes must occur: 1  Large aggregates of dietary triglyceride, which are virtually insoluble in an aqueous environment, must be broken down physically and held in suspension-a process called emulsification."}, {"url": "http://www.daviddarling.info/encyclopedia/L/lymphatic_system.html", "passage_text": "There are blood capillaries and special lymph capillaries, called lacteals (see below), in the center of each villi. The blood capillaries absorb most nutrients, but the fats and fat-soluble vitamins are absorbed by the lacteals. The lymphatic system includes the bone marrow, spleen, thymus, lymph nodes, and lymphatic vessels (a network of thin tubes that carry lymph and white blood cells, or leukocytes). Lymphatic vessels branch, like blood vessels, into all the tissues of the body."}, {"url": "http://www.answers.com/Q/Digested_fats_are_absorbed_from_the_intestine_by_the_lymph_capillaries", "passage_text": "Lacteals are the specialized lymphatic capillaries of the small intestine which transfer fats from the digetive system into the blood. Chyle (pronounced Kyle) is milky f … luid found in the lacteals formed by fat globules and lymph. The digested food is taken up by the walls of the small intestine. The inner lining of the small intestine has numerous finger-like projections called villi which increase the … surface area for absorption."}, {"url": "http://www.web-books.com/eLibrary/Medicine/Physiology/Lymphatic/Lymphatic.htm", "passage_text": "The mucosa that lines the small intestine is covered with fingerlike projections called villi. There are blood capillaries and special lymph capillaries, called lacteals, in the center of each villus. The blood capillaries absorb most nutrients, but the fats and fat-soluble vitamins are absorbed by the lacteals. The smallest lymphatic vessels are the lymph capillaries, which begin in the tissue spaces as blind-ended sacs. Lymph capillaries are found in all regions of the body except the bone marrow, central nervous system, and tissues, such as the epidermis, that lack blood vessels."}, {"url": "http://www.histology.leeds.ac.uk/digestive/small_intestine.php", "passage_text": "The lamina propria which underlies the epithelium has a rich vascular and lymphatic network, which absorbs the digestive products, and there is a muscularis mucosae layer immediately at the base of the crypts. The lymphatic capillaries are called lacteals, and absorb lipids. The vascular capillaries are fenestrated to aid absorption. The muscularis externa layer contains two layers of smooth muscle, an inner circular and outer longitudinal, for continuous peristaltic activity of the small intestine. "}, {"url": "https://en.wikipedia.org/wiki/Lacteal", "passage_text": "A lacteal is a lymphatic capillary that absorbs dietary fats in the villi of the small intestine. Triglycerides are emulsified by bile and hydrolyzed by the enzyme lipase, resulting in a mixture of fatty acids and monoglycerides. These then pass from the intestinal lumen into the enterocyte, where they are re-esterified to form triacylglycerol."}, {"url": "http://www.answers.com/Q/Digested_fats_are_absorbed_from_the_intestine_by_the_lymph_capillaries", "passage_text": "Each villus has a network of capillaries and fine lymphatic vessels called lacteals close to its surface. The epithelial cells of the villi transport nutrients from the lumen of the intestine into these capillaries (amino acids and carbohydrates) and lacteals (lipids). The digested food is taken up by the walls of the small intestine. The inner lining of the small intestine has numerous finger-like projections called villi which increase the … surface area for absorption."}, {"url": "http://study.com/academy/lesson/lipids-digestion-and-absorption.html", "passage_text": "Lipids, or fats, are digested and absorbed in the small intestine. In this lesson you will learn how bile salts emulsify fat so pancreatic lipase can digest it. You will also learn how fats first enter lymphatic capillaries, called lacteals, before entering your blood circulation. Chylomicrons are small globules composed of protein and lipid. The chylomicrons first enter lymphatic capillaries called lacteals before entering the general blood circulation. Fats are used to build cell membranes, make myelin sheathes, insulate the body or as an alternate fuel source."}]