[{"url": "http://www.disabled-world.com/artman/publish/candida_.shtml", "passage_text": "Candida, or Candida albicans, is a type of yeast that is generally found in the regular flora of the skin, intestinal track and the mouth, rectum, and vagina. Although Candida is naturally present in the body, it can cause problems if there is an overgrowth, resulting in Candidiasis. Fruit Never eat dried fruit, and when you start the Candida cleanse diet it is best to avoid all fruit because of the fructose the sugar it contains. Once you have eliminated the current Candida infection then eat fruit with a moderate amount of sugar."}, {"url": "http://www.disabled-world.com/artman/publish/candida_.shtml", "passage_text": "Diet That encourage the growth of yeast and should be avoided. AVOID All sweets including hidden sweeteners in processed foods, such as soups, all fruit and fruit juice. Avoid grains such as prepared flake cereals sprouted grain cereals such as: Amaranth, Buckwheat, Corn, Millet, Rice, Rye, Spelt, Wheat. Fruit Never eat dried fruit, and when you start the Candida cleanse diet it is best to avoid all fruit because of the fructose the sugar it contains. Once you have eliminated the current Candida infection then eat fruit with a moderate amount of sugar."}, {"url": "http://www.natural-health-and-wellbeing.com/foods-that-cause-candida.html", "passage_text": "Foods that contribute to Candia overgrowth. The foods that cause Candida and encourage it to mutate in your body are... 1  Sugar, and any food that contains sugar. 2  Yeast and products which includes alcoholic and baked items, Marmite, Oxo, Bovril, Bisto and gravy mixes. Apart from the foods that cause Candida there are other things you need to do to eliminate the fungus from your body. Candida lives naturally in all of us. It only starts causing problems when it has mutated into a fungus, and diet alone can cause this too happen if you've been eating poor quality food for a long time."}, {"url": "http://health.usnews.com/health-news/blogs/eat-run/2013/10/25/how-to-cure-candida", "passage_text": "Candida is a type of yeast found in the body. In normal amounts, it's simply a harmless gut flora, but an overgrowth can cause fungal infections. Yuri Elkaim Fungal infections compromise our immune system, which can lead to a host of problems. A few examples are: allergies, food sensitivities, brain fog, changes in mood and even autoimmune disorders. "}, {"url": "http://www.mayoclinic.org/healthy-lifestyle/consumer-health/expert-answers/candida-cleanse/faq-20058174", "passage_text": "To cure the syndrome, they recommend a candida cleanse diet, which includes no sugar, white flour, yeast and cheese, based on the theory that these foods promote candida overgrowth. Unfortunately, there isn't much evidence to support the diagnosis of yeast syndrome. "}, {"url": "http://www.mindbodygreen.com/0-11005/10-foods-to-fight-candida.html", "passage_text": "If so, you may have Candida overgrowth. Candida is one of the scientific names for yeast, which is a form of fungus. A very small amount naturally resides in your mouth and intestines to aid digestion, but your medications, diet, and environment can all change your normal balance of Candida."}, {"url": "http://www.brainyweightloss.com/foods-that-cause-candida.html", "passage_text": "Yes, cutting these foods that cause Candida can be a decision tough to make and even tougher to stick to, because a lot of these are popular foods. But you'll see, the results are going to be spectacular! Try a Candida defense diet for a month-take a look at some delicious sample menus from our Candida-free diet. That's a LOT, I know. It’s time now for the bit of good news. Try to avoid these foods that cause Candida until you bring your system back to a healthy balance – typically about a month, more or less depending on your general health and the severity of your Candida symptoms."}, {"url": "http://www.natural-health-and-wellbeing.com/foods-that-cause-candida.html", "passage_text": "Foods that cause Candida are just a small part of Candida overgrowth. Usually something else has triggered the growth of the Candia, and the foods that you eat just make the problem worse. Changing your diet is one part of a multi level approach you need to stop the yeast from mutating in your body. Apart from the foods that cause Candida there are other things you need to do to eliminate the fungus from your body. Candida lives naturally in all of us. It only starts causing problems when it has mutated into a fungus, and diet alone can cause this too happen if you've been eating poor quality food for a long time."}]