[{"url": "http://www.medicalnewstoday.com/articles/146935.php", "passage_text": "Two types of fiber-soluble and insoluble. Legumes are rich in solubleand insoluble fiber. Fiber is made up of non-starch polysaccharides, such as cellulose, dextrins, inulin, lignin, chitins, pectins, beta-glucans, waxes and oligosaccharides. The word fiber is misleading, because many types of dietary fibers are not fibers at all. There are two broad types of fiber, soluble and insoluble. 1  Soluble fiber dissolves in water. 2  It changes as it goes through the digestive tract, where it is fermented by bacteria. 3  As it absorbs water it becomes gelatinous. 4  Insoluble fiber does not dissolve in water"}, {"url": "https://en.wikipedia.org/wiki/Dietary_fiber", "passage_text": "Dietary fibers can act by changing the nature of the contents of the gastrointestinal tract and by changing how other nutrients and chemicals are absorbed. Some types of soluble fiber absorb water to become a gelatinous, viscous substance which is fermented by bacteria in the digestive tract. Soluble fiber is found in varying quantities in all plant foods, including: 1  legumes (peas, soybeans, lupins and other beans). 2  oats, rye, chia, and barley. 3  some fruits (including figs, avocados, plums, prunes, berries, ripe bananas, and the skin of apples, quinces and pears)."}, {"url": "http://www.medicinenet.com/script/main/art.asp?articlekey=3444", "passage_text": "Soluble fiber and insoluble fiber differ in function. For example, soluble fiber delays the time of transit through the intestine whereas insoluble fiber speeds up intestinal transit. For another example, soluble fiber and may decrease the level of cholesterol in the blood whereas insoluble fiber has no effect on serum cholesterol."}, {"url": "https://en.wikipedia.org/wiki/Dietary_fiber", "passage_text": "Dietary fiber or roughage is the indigestible portion of food derived from plants. It has two main components: 1  Soluble fiber, which dissolves in water, is readily fermented in the colon into gases and physiologically active byproducts, and can be prebiotic and viscous. Soluble fiber is found in varying quantities in all plant foods, including: 1  legumes (peas, soybeans, lupins and other beans). 2  oats, rye, chia, and barley. 3  some fruits (including figs, avocados, plums, prunes, berries, ripe bananas, and the skin of apples, quinces and pears)."}, {"url": "http://medical-dictionary.thefreedictionary.com/insoluble+fiber", "passage_text": "insoluble fiber that not soluble in water, composed mainly of lignin, cellulose, and hemicelluloses and primarily found in the bran layers of cereal grains. Its actions include increasing fecal bulk and decreasing free radicals in the gastrointestinal tract. crude fiber the fiber that remains after food is digested with alkali and acid, which destroys all soluble and some insoluble fiber. It is mainly lignin and cellulose. depressor f's afferent nerve fibers that when stimulated reflexly cause diminished vasomotor tone and thus decreased arterial pressure."}, {"url": "http://www.merriam-webster.com/dictionary/insoluble", "passage_text": "Full Definition of INSOLUBLE. : not soluble: as a archaic: indissoluble c: incapable of being dissolved in a liquid and especially water; also: soluble only with difficulty or to a slight degree. — in·sol·u·bil·i·ty \\-ˌsael-ˌsäl-yə-ˈbi-lə\\ tē. — noun insoluble. — noun·in·sol·u·ble \\-ness-ˈsael-ˈsäl-yə\\ bəl. — nəs·noun·in·sol \\-u\\ bly. blē adverb"}, {"url": "http://www.myfooddiary.com/resources/ask_the_expert/soluble_insoluble_fiber.asp", "passage_text": "Good sources of soluble fiber include oats and oatmeal, legumes (peas, beans, lentils), barley, fruits and vegetables (especially oranges, apples and carrots). Insoluble fiber does not absorb or dissolve in water. It passes through our digestive system in close to its original form. Most of insoluble fibers come from the bran layers of cereal grains. Since dietary fiber is found only in plant products (i.e., nuts, whole grains, legumes, fruits and vegetables), these are essential to a healthy diet."}, {"url": "http://www.medicinenet.com/script/main/art.asp?articlekey=3444", "passage_text": "Fiber, soluble and insoluble: Fiber (the portion of plants that cannot be digested by the human digestive tract) is classified as soluble and insoluble. Oats, beans, dried peas, and legumes are major sources of soluble fiber whereas wheat bran, whole grain products, and vegetables are major sources of insoluble fiber. For example, soluble fiber delays the time of transit through the intestine whereas insoluble fiber speeds up intestinal transit. For another example, soluble fiber and may decrease the level of cholesterol in the blood whereas insoluble fiber has no effect on serum cholesterol."}, {"url": "https://en.wikipedia.org/wiki/Dietary_fiber", "passage_text": "Sources of insoluble fiber include: 1  whole grain foods. 2  wheat and corn bran. 3  legumes such as beans and peas. 4  nuts and seeds. 5  potato skins. 6  lignans. 7  vegetables such as green beans, cauliflower, zucchini (courgette), celery, and nopal. Soluble fiber is found in varying quantities in all plant foods, including: 1  legumes (peas, soybeans, lupins and other beans). 2  oats, rye, chia, and barley. 3  some fruits (including figs, avocados, plums, prunes, berries, ripe bananas, and the skin of apples, quinces and pears)."}]