[{"url": "http://www.creditcards.com/credit-card-news/how-long-old-debt-stays-on-credit-reports-1294.php", "passage_text": "The statute of limitations and the length of time items remain on your credit report are two completely separate issues. The length of your statute of limitations -- the number of years before a debt is time barred from collection -- is based on state law."}, {"url": "http://www.answers.com/Q/How_long_do_unpaid_debts_stay_on_your_credit_report", "passage_text": "An unpaid collection account will remain on your credit report for  7 years from the date the account was reported by the collection  agency. Keep in mind that any new activ … ity regarding the account  (for example, if you decide to pay it off) will reset the time  limit."}, {"url": "http://blog.equifax.com/credit/how-long-does-information-stay-on-my-credit-report/", "passage_text": "1 Tax liens. 2  Paid tax liens will typically stay on your credit report for seven years from the date released (paid), while unpaid tax liens can remain on your credit report for 15 years. 3  Bankruptcies. 4  In general, the public record of a bankruptcy can stay on your credit report for 10 years."}, {"url": "http://www.answers.com/Q/How_long_do_unpaid_credit_cards_stay_on_your_credit_report", "passage_text": "An unpaid tax lien will remain on your credit report for 10 years  from the date it's filed. A paid tax lien will remain on your  credit report for seven years from its date … of filing. 1 person found this useful."}, {"url": "http://www.answers.com/Q/How_long_do_unpaid_credit_cards_stay_on_your_credit_report", "passage_text": "An unpaid collection account will remain on your credit report for  7 years from the date the account was reported by the collection  agency. Keep in mind that any new activ … ity regarding the account  (for example, if you decide to pay it off) will reset the time  limit."}, {"url": "http://blog.readyforzero.com/how-long-does-a-bad-mark-stay-on-your-credit-report/", "passage_text": "How long a bankruptcy stays on your credit report depends on the type of bankruptcy you filed. Chapter 13 bankruptcies may be removed from your credit report after 7 years, whereas Chapter 7 and Chapter 11 bankruptcies can remain on your report for 10 years."}, {"url": "http://www.creditcards.com/credit-card-news/how-long-old-debt-stays-on-credit-reports-1294.php", "passage_text": "Nothing's stopping creditors from attempting to contact you, as long as they stay within the rules. If you pay off the debt, it will be marked as paid on your credit report. If you don't pay off the debt, the best you can do is to keep your credit report clean from now on and wait for the seven years to pass. Keep a close eye on your credit from now on, and soon you can have a credit history to be proud of."}, {"url": "http://www.answers.com/Q/How_long_do_unpaid_debts_stay_on_your_credit_report", "passage_text": "An unpaid tax lien will remain on your credit report for 10 years  from the date it's filed. A paid tax lien will remain on your  credit report for seven years from its date … of filing."}]