[{"url": "http://birdsflight.com/where-peacocks-live-peacocks-habitat-facts-about-peacocks-different-types-peacocks/", "passage_text": "Most of us perhaps wonder about where do peacocks live in the real world. We might also have had an experience of gazing at these birds in the zoo behind cage but never able to figure out the actual peacocks habitat. Facts about Peacocks. 1  Male peafowl are known as peacocks while females are generally called peahens. 2  Group name of peahens is called Harem whereas in case of peacocks, it’s a party. 3  The weight of peacocks ranges from 1 kilogram to 6 kilograms."}, {"url": "http://nwrf.net/peacocksofpleasance/About%20Peafowl.htm", "passage_text": "Peafowl (Pavo cristatus) are beautiful birds that are native to Southeast Asia. The male peafowl is called a peacock; the female peafowl is called a peahen. In the wild, they live in deciduous tropical rainforests. Peacocks do not migrate. A group of peafowl is called a muster. "}, {"url": "https://en.wikipedia.org/wiki/Indian_Peafowl", "passage_text": "The Indian peafowl or blue peafowl (Pavo cristatus), a large and brightly coloured bird, is a species of peafowl native to South Asia, but introduced in many other parts of the world. The Indian peafowl lives mainly on the ground in open forest or on land under cultivation where they forage for berries, grains but also prey on snakes, lizards, and small rodents. Their loud calls make them easy to detect, and in forest areas often indicate the presence of a predator such as a tiger."}, {"url": "http://nationalzoo.si.edu/Animals/Birds/Facts/fact-peafowl.cfm", "passage_text": "Diet: Indian Peafowl do most of their foraging in the early morning and shortly before sunset. They retreat to the shade and security of the forest for the hottest portion of the day. Foods include grains, insects, small reptiles, small mammals, berries, drupes, wild figs, and some cultivated crops. "}, {"url": "http://www.brighthub.com/environment/science-environmental/articles/68137.aspx", "passage_text": "Peacocks are actually peafowls. Males are called peacocks and females are called peahens. Baby peafowls are called peachicks. There are two familiar species of peafowl: Indian Peafowl (Pavo cristatus or blue peacock) and Green Peafowl (Pavo muticus or green peacock). The Indian Peafowl resides in the Indian subcontinent and is the national bird of the Republic of India."}, {"url": "http://birdsflight.com/where-peacocks-live-peacocks-habitat-facts-about-peacocks-different-types-peacocks/", "passage_text": "Even though most people call them peacocks however, these birds are called peafowl because only male peafowl is recognized by the name of peacock. 1  Blue or Indian Peafowl. 2  Congo Peafowl. 3  Green Peafowl. Facts about Peacocks. 1  Male peafowl are known as peacocks while females are generally called peahens. 2  Group name of peahens is called Harem whereas in case of peacocks, it’s a party. 3  The weight of peacocks ranges from 1 kilogram to 6 kilograms."}, {"url": "http://www.bigrunwolfranch.org/peacock.html", "passage_text": "Wild birds in North America that are believed to be closely related to the peafowl include the ring-necked pheasant, gray partridge, and chukar. Where Peafowl Live. The wild Indian peafowl is native to dense, hilly forests in India, Pakistan, and Sri Lanka. In fact, it is the national bird of India. Domestic (tame) peafowl are raised on farms and ranches and in parks and zoos around the world, including much of the United States. Peafowl and Relatives. The spectacular peafowl species that most people are familiar with is the Indian, or common, peafowl. Two other species of peafowl are the green jungle peafowl of Southeast Asia (which is similar to the Indian peafowl) and the Congo peafowl of Africa (which is not as fancy as the Indian peafowl)."}, {"url": "http://wanttoknowit.com/where-do-peacocks-live/", "passage_text": "20 Jun, 2011 where do 1. A Peacock is the male member of the peafowl species, which is part of the pheasant family (although peacock is now recognized as the name for both male and female birds of this species). The peacock has a spectacular tail of green and brown feathers, which spread open wide when courting."}, {"url": "http://images.nationalgeographic.com/wpf/sites/kids/NGS/wpf/printcreature/indianpeafowl.html", "passage_text": "1 Indian peafowl are a species in a group of birds called pheasants. 2  The males are called peacocks, while the females are called peahens. 3  Together, they are peafowl. "}]