[{"url": "http://www.timescolonist.com/life/ask-eric-is-it-safe-to-eat-imported-basa-fish-1.87907", "passage_text": "It is a type of catfish and its Latin name is Pangasius bocourti. We don’t fish for it in Canada. Basa, also called swai and a few other names, is native to Southeast Asia. It is farmed in large numbers in pens around the Mekong River system of Vietnam, as well as in China and Cambodia."}, {"url": "http://mekong.riverawarenesskit.org/html/1.12a.0_fish_fisheries.html", "passage_text": "The Mekong River system has a tremendous diversity of fish species, and this resource is a critical source of protein for the millions of people who live in the watershed. Over 1,200 fish species are known to inhabit the Mekong River system. These fisheries resources play a critical role in the regional economy and food security of all the riparian countries."}, {"url": "http://www.mekonginfo.org/assets/midocs/0002744-biota-1-200-different-fish-species-in-the-mekong-basin.pdf", "passage_text": "1,200 DIFFERENT FISH SPECIES IN THE MEKONG BASIN The problem is that no matter how many species you find, you can always go out tomorrow and find others that you have not seen before, says Dr Rainboth, working for the MRC Secretariat on the production of a new guide to fish species in the Mekong River. As reported in the February issue of Catch and Culture, a field guide to identify Mekong fish species in Cambodia is being prepared for the Mekong River Commission by Dr Walter Rainboth of the Department of Biology, University of Wisconsin, Oshkosh, USA."}, {"url": "http://www.siamfishingtours.com/fishspecies.html", "passage_text": "Introduction. The Mekong River Basin is home to more species of massive fish than any river on Earth. It is also the most productive fishery in the world, generating $1.7 billion each year in revenue from the thousands of fish farms along it's banks. In addition to Thailand's native fish species, there have been many introduced species especially from the Amazon region. Although most introduced species still reside purely in commercial waters, in 2009 a 100kg Arapaima was captured form a tributary of the Mekong River."}, {"url": "http://mekong.riverawarenesskit.org/html/1.12a.0_fish_fisheries.html", "passage_text": "SUMMARY. The Mekong River system has a tremendous diversity of fish species, and this resource is a critical source of protein for the millions of people who live in the watershed. Over 1,200 fish species are known to inhabit the Mekong River system. These fisheries resources play a critical role in the regional economy and food security of all the riparian countries."}, {"url": "http://www.fishsiam.com/species/", "passage_text": "The Bony Lipped Barb is a native freshwater fish species found in Thailand and throughout South East Asia. Barb, Golden Belly. The Golden Belly Barb is a native species of freshwater fish indigenous to the Mekong River, Chaophraya River and Maeklong Rivers and their tributaries. The Giant Mekong Catfish in Thailand is a contender for the world's largest freshwater fish and has been caught at incredible weights to 293kg's and has been described as being the hardest fighting freshwater fish in the world."}, {"url": "http://www.timescolonist.com/life/ask-eric-is-it-safe-to-eat-imported-basa-fish-1.87907", "passage_text": "Dear Eric: Just recently I ate a white fish called basa. It was very delicious and no bones. Americans say it comes from the polluted Mekong River, while the Australians say that the fish comes from fish farms near the Mekong River and is highly recommended. We need your advice. Al. Dear Al: With the name basa, one might think it’s related to bass, a fish Canadians cast for in local rivers and lakes. Basa, also called swai and a few other names, is native to Southeast Asia. It is farmed in large numbers in pens around the Mekong River system of Vietnam, as well as in China and Cambodia."}, {"url": "http://www.fishsiam.com/species/", "passage_text": "Catfish, Thai Shark. The Thai Shark Catfish is a native species of Thailand catfish which is found throughout the Mekong basin and Chaophraya basins in Thailand in addition to being present in Borneo, Sumatra and the Malay peninsula. The Giant Mekong Catfish in Thailand is a contender for the world's largest freshwater fish and has been caught at incredible weights to 293kg's and has been described as being the hardest fighting freshwater fish in the world."}, {"url": "http://talk.onevietnam.org/cause-of-death-consumption-of-basa-fish/", "passage_text": "Basa fish are farmed along the Mekong River—one of the most polluted rivers in the world. Large manufacturers planted along this river frequently dump extremely toxic and dangerous chemicals and industrial waste directly into it. Shrimp is a very clean animal, it can not live in dirty water. Most Shrimp, Basa fish, and Tilapia fish are farm raised in the delta of Mekong River in Vietnam. If the farmer can raise shrimp there: the water of the river is not dirty. Mekong River flow rate is about 50000 cubic meter/second, a lot of water, my friends."}]