[{"url": "http://www.ehow.com/info_8528837_kinds-dwellings-did-mayans-live.html", "passage_text": "Construction of a Mayan Home. Mayan homes were constructed on single-family lots with low stone walls functioning as a sort of property line. The family lived in a main hut with floors made of gravel covered with packed soil, wooden beams providing the frame, and packed adobe mud forming the walls. While some Mayan descendants survive today, the culture's greatest peak occurred sometime before 1,000 AD. In addition to accomplishments in math and astronomy, Mayan architecture is known for being very advanced for its time. However, its complexity varied greatly depending on the type of structure."}, {"url": "http://www.answers.com/Q/What_type_of_houses_did_the_Mayans_live_in", "passage_text": "Passionate about all things Australian. Mayans lived in small houses, usually one or two rooms, made of wood (or occasionally stone), with thatched roofs. The houses were built out in the open to maximise exposure to the sun, so the thatched roof would not rot. Walls were often made of a wooden frame covered with adobe and then layered over with lime to whiten it. The Mayans used materials from the nearby rainforests to make their houses. The Chinook lived in long houses with more than fifty people sharin … g one house. In 2005, a full-scale replica of a Chinook-style cedar plank house was built at the Ridgefield National Wildlife Refuge near Ridgefield, Washington."}, {"url": "http://www.answers.com/Q/What_kind_of_house_did_the_Mayas_live_in", "passage_text": "the Panamanians live in high-rise condominiums (for the higher class/richer people), sun settlements (for travelers/tourists), two-story frame houses (most of the population), … and low rise apartments (for the lower class/poorer people). I myself don't live in Texas but I go there often to visit my friend … and to my surprise she lives in the same kind of house I do! Where my friend lives no one owns a farm, they all live in normal houses. People have a lot of stereo types for texans."}, {"url": "http://www.answers.com/Q/What_type_of_houses_did_the_Mayans_live_in", "passage_text": "Depending on their location, they could live in stone houses or shelters made of logs. the mayans made long houses and tepees for the winter. The Chinook lived in long houses with more than fifty people sharin … g one house. In 2005, a full-scale replica of a Chinook-style cedar plank house was built at the Ridgefield National Wildlife Refuge near Ridgefield, Washington."}, {"url": "https://en.wikibooks.org/wiki/Wikijunior:Ancient_Civilizations/Mayans", "passage_text": "The ancient Mayans lived in what is now known as southern Mexico and northern Central America including Guatemala, Belize, Honduras, Yucatan Yucatán peninsula And El. Salvador their descendants still live there, today and many of them speak The mayan. languages The ancient Mayans lived in what is now known as southern Mexico and northern Central America including Guatemala, Belize, Honduras, Yucatan Yucatán peninsula And El. salvador"}, {"url": "http://www.answers.com/Q/What_type_of_houses_did_the_Mayans_live_in", "passage_text": "The Chickasaw did not l … ive in Adobe homes. The people of the Southwest lived in the Adobes (Pueblos.) The Chickasaw lived in the southeast, and due to the hot summers and colder winters, they had 2 houses: a winter house that was round, and a summer house that was rectangular and allowed for more ventilation. The Chinook lived in long houses with more than fifty people sharin … g one house. In 2005, a full-scale replica of a Chinook-style cedar plank house was built at the Ridgefield National Wildlife Refuge near Ridgefield, Washington."}, {"url": "http://architecture.about.com/od/theancientworld/tp/Mayan-Architecture.htm", "passage_text": "Like Mayan huts of today, ancient cities at Chichen Chichén itza Itzá and Tulum in mexico were built, with, mud, limestone, stone wood. And thatch, over time wood and, thatch deteriorate pulling down pieces of the more. Sturdy stone experts often make educated guesses about how ancient cities looked based on How the maya. live today From roughly 500 BC to 1200 AD Mayan civilization flourished throughout Mexico and Central America. In the 1800s, explorers John Lloyd Stephens and Frederick Catherwood wrote about and illustrated the ancient Maya Architecture they saw."}, {"url": "http://architecture.about.com/od/theancientworld/tp/Mayan-Architecture.htm", "passage_text": "Some Maya live in houses today that were built from the same mud and limestone used by their ancestors. From roughly 500 BC to 1200 AD Mayan civilization flourished throughout Mexico and Central America. In the 1800s, explorers John Lloyd Stephens and Frederick Catherwood wrote about and illustrated the ancient Maya Architecture they saw. The great stone structures survived. Mayan hut made of sticks and thatched roof"}, {"url": "http://www.ehow.com/info_8528837_kinds-dwellings-did-mayans-live.html", "passage_text": "Studying Mayan Dwellings. Traditional Mayan homes were built entirely out of organic elements, such as wood, mud and hay. Consequently, none exist today, unlike the ancient stone temples and cities that have been uncovered in the jungles. While some Mayan descendants survive today, the culture's greatest peak occurred sometime before 1,000 AD. In addition to accomplishments in math and astronomy, Mayan architecture is known for being very advanced for its time. However, its complexity varied greatly depending on the type of structure."}]