[{"url": "http://www.answers.com/Q/Do_mice_grow_fast", "passage_text": "Six mice can multiply into 60 mice in less than 3 months. One  female can have 5 to 10 litters per year. They have about 10 babies  per litter. Mice are smaller than rats (averaging up to 5 inches in length, including tail) but they live longer and are more common. All of these rodents will eat food and chew on property if they find their way into a home. Severe rodent infestations can result in structural damage."}, {"url": "http://www.thefunmouse.com/info/general.cfm", "passage_text": "*Based on a 20g mouse. *Data will vary based on age, size, weight, weight, individual, strain, environmental conditions, etc. Blood pressure: 83-164 mm Hg (millimeters of mercury). Heart rate: A healthy new born should have 286 +/- 56.8 bpm (beats per minute) and an adult should have 632 +/- 51.3 bpm. (wild mice live longer.. around 5 years in captivity, though only around 6 months in the wild due to predators and environmental factors). Maturity: 4 - 8 weeks of age, varying from line to line and mouse to mouse. This is the time that males and females can become fertile"}, {"url": "http://www.thefunmouse.com/info/general.cfm", "passage_text": "Unlike humans, mice do not loose baby teeth and grow adult teeth. Mice have one set of teeth their entire life. However, they continue to grow throughout life. The top front teeth of the mouse (incisors) should slightly overlap, in front of, the bottom teeth. (wild mice live longer.. around 5 years in captivity, though only around 6 months in the wild due to predators and environmental factors). Maturity: 4 - 8 weeks of age, varying from line to line and mouse to mouse. This is the time that males and females can become fertile"}, {"url": "http://www.afrma.org/mousemultiply.htm", "passage_text": "How fast can mice multiply? Start with 2 baby mice, one of each sex. At 6 weeks old the female can become pregnant. Gestation is 3 weeks, and under optimal conditions the female can become pregnant again immediately after giving birth. Assume a litter of eight, four male and four female, which are paired and bred when they are 6 weeks old."}, {"url": "http://www.crittercatchersinc.com/critters/Mice/Mousereproduction.html", "passage_text": "A family of 6 mice can multiply into a family of 60 mice in 3 months. Reaching sexual maturity at about four weeks of age, it’s easy to understand how a mouse population within a home can quickly grow out-of-hand. 1 Mice produce a great number of young, but have a high mortality rate. 2  Mice are an important source of food for wildlife such as hawks, owls, and fox which can control populations outdoors. 3  The lifespan of a house mouse is approximately 1 year."}, {"url": "http://www.answers.com/Q/When_will_my_baby_mice_open_there_eyes_and_grow_fur_they_r_3_days_old", "passage_text": "A baby mouse will open its eyes at thirteen days old. Baby mice are weaned of their mothers milk at four weeks. So you should continue feeding it formula if it dosent have its … mum. At three weeks you should introduce mouse food from the store to help wean them off the milk. Confidence votes 10. Mice pups are blind, deaf and furless when they're born but hair will begin to appear after just 2-4 days. The ears open after 3-5 days, while the eyes remain shut until the pups are two weeks old."}, {"url": "http://www.thefunmouse.com/info/general.cfm", "passage_text": "Complete Physical Maturity: Mice are not done growing until they are between 3 and 5 months of age, depending on the line. Mice should NEVER be bred until they are at least 12 weeks age. If you don't know the line really well, wait until at least 12 weeks, if not longer. (wild mice live longer.. around 5 years in captivity, though only around 6 months in the wild due to predators and environmental factors). Maturity: 4 - 8 weeks of age, varying from line to line and mouse to mouse. This is the time that males and females can become fertile"}, {"url": "https://answers.yahoo.com/question/index?qid=20091112182039AAQN5mR", "passage_text": "Answers. Best Answer: In about a month from birth it'll be adult. As for pregnancy, that's about 3 weeks. Male mice like most rodents have large testicles compared to their body size, so that should be easy to tell. (Sort the genders out at about 3-4 weeks, otherwise you'll end up having incest problems with the mice.). "}, {"url": "http://www.livescience.com/28028-mice.html", "passage_text": "Some are very tiny and others are around the size of a baked potato. Mice typically grow from 1 to 7 inches (2.54 to 18 centimeters) in length and weigh between 0.5 and 1 ounce (.23 to .028 kilograms). The African pygmy is the smallest known mouse on the planet. It measures 1.2 - 3.1 inches (3.04 to 7.874 cm) and can weigh less than .35 ounces (.01 kg)"}]