[{"url": "https://en.wikipedia.org/wiki/Golden_Gate_Bridge", "passage_text": "The Golden Gate Bridge's clearance above high water averages 220 feet (67 m) while its towers, at 746 feet (227 m) above the water, were the world's tallest on a suspension bridge until 1998 when bridges in Denmark and Japan were completed."}, {"url": "https://en.wikipedia.org/wiki/San_Francisco_Bay", "passage_text": "The waterway entrance to San Francisco Bay from the Pacific Ocean is called the Golden Gate. Across the strait spans the Golden Gate Bridge. The bay was designated a Ramsar Wetland of International Importance on February 2, 2013."}, {"url": "http://www.unmuseum.org/7wonders/goldengate.htm", "passage_text": "The Golden Gate Bridge was the longest suspension bridge in the world when it was completed. in 1937. (Copyright Lee Krystek, 2011). They said it couldn't be built. The strait that connects the Pacific Ocean with the San Francisco Bay is one of the most unforgiving stretches of water in the world."}, {"url": "https://en.wikipedia.org/wiki/Golden_Gate_Bridge", "passage_text": "The Golden Gate Bridge is a suspension bridge spanning the Golden Gate strait, the 1 mile (1.6 km) wide, 3 mile (5 km) long channel between San Francisco Bay and the Pacific Ocean."}, {"url": "http://xsquared.wikispaces.com/GoldenGateBridge", "passage_text": "The cables are connected to the towers at points that are 5000 feet above the road, and the road is about 220 feet above the mean water level. A few Golden Gate Bridge facts to illustrate its size: · Total length: Including approaches, 1.7 miles (8,981 feet or 2,737 m). · Middle span: 4,200 feet (1,966 m)."}, {"url": "http://www.pcimagenetwork.com/golden_gate/golden_gate.html", "passage_text": "The Golden Gate Bridge was named for the entrance to the San Francisco Bay. Army Captain John C. Fremont named the strait “Chrysopylae” or Golden Gate in 1846. Building a Bridge across this strait was a feat of modern engineering."}, {"url": "http://www.inetours.com/Pages/SFNbrhds/Golden_Gate_Bridge.html", "passage_text": "The Golden Gate Bridge in San Francisco, California is one of the most beautiful, and most photographed, bridges in the world."}, {"url": "http://www.pbs.org/wgbh/americanexperience/features/general-article/goldengate-underwater/", "passage_text": "Tumultuous Currents. The narrow strait between Marin County and San Francisco is one of the world's most tumultuous bodies of water. Up to 335 feet deep and only a mile and a quarter wide, the Golden Gate is the largest California coastal opening -- a portal into which the Pacific Ocean surges."}, {"url": "http://www.pbs.org/wgbh/americanexperience/features/general-article/goldengate-bridgefacts/", "passage_text": "Water depth at the Golden Gate is more than 300 feet, but San Francisco Bay waters are, on average, just 14 feet deep. Thousands of animal species, including over 130 species of fish, call the bay home."}, {"url": "http://xsquared.wikispaces.com/GoldenGateBridge", "passage_text": "The main suspension cables between the towers of the Golden Gate Bridge form a parabola that can be modeled by the quadratic function: Y = 0.000112x2 + 220. where x is the horizontal distance from the middle of the bridge to the towers and y is the vertical distance from the water level to the bridge deck."}]