[{"url": "http://www.treeremoval.com/trimming-and-pruning/", "passage_text": "Tree Trimming & Pruning: Tips & Techniques. By knowing the basics about tree trimming and tree pruning, you may be able to handle the majority of this kind of work yourself. There are a variety of great trimming tips and pruning techniques that can help keep your trees in excellent shape. With the right knowledge and equipment, you can prune your trees as necessary to maintain their appearance and health and to eliminate potentially dangerous dead branches and other common issues. Tree Trimming Techniques. Here are a few tree pruning techniques to keep in mind: 1  Before making a cut, look for the branch collar, which grows from the stem tissue at the bottom base of the branch. 2  Look for the branch ridge, which is on the upper surface and is parallel to the branch angle at the stem."}, {"url": "http://www.bhg.com/gardening/trees-shrubs-vines/care/how-to-prune-trees/", "passage_text": "1 Trees that have just leafed out in spring could be weakened by pruning too early. 2  Pruning in late summer will prevent weakening. 3  Pruning for structure and form is best left until after the leaves fall and the branches can be seen clearly. 4  Remove dead wood in the summer when leafless branches are easily spotted. Whether it's keeping a large-growing species in scale or giving a shaggy tree a trim, smart pruning can improve a tree's appearance. Some trees show their attractive bark or flowers more effectively when pruned. Cut off water sprouts and suckers for neatness. Learn how to prune your shrubs, too."}, {"url": "https://www.arborday.org/trees/tips/when-to-prune.cfm", "passage_text": "If your purpose for pruning is to enhance flowering: 1  For trees that bloom in spring, prune when their flowers fade. 2  Trees and shrubs that flower in mid-to late summer should be pruned in winter or early spring. This depends to a large extent on why you prune. Light pruning and the removal of dead wood can be done anytime. Otherwise, here are some guidelines, but recognizing that individual species may differ is important to remember"}, {"url": "http://www.treehelp.com/how-to-prune-a-tree/", "passage_text": "When to Prune. For most trees, the dormant season, late fall or winter, is the best time to prune although dead branches can and should be removed at any time. Pruning during the dormant period minimizes sap loss and subsequent stress to the tree. In the case of a large tree where you want to remove big branches in the upper area of the crown, it may be best to hire experts. Large tree pruning, in particular, can require climbing and heavy saws or even cherry-pickers and chain saws. However, there are new tools available that can make this a manageable job."}, {"url": "http://www.wikihow.com/Trim-Trees", "passage_text": "You'll need a handheld pruner and a larger lopping shears to trim branches that are small to medium-sized. For mature trees, you'll need a pole pruner to safely reach high branches and a handsaw or chainsaw to remove thick limbs.Wear eyeglasses in accordance with ANSI standards or risk your vision! Wait until the right time of year to trim trees. Trim deciduous and fruit trees when they are dormant, flowering trees after the blooms fade and evergreens during springtime or their growing season."}, {"url": "http://www.wikihow.com/Prune-a-Tree", "passage_text": "Pruning helps trees grow strong and look neat and attractive. One prunes a tree to remove damaged branches, allow for new growth or create a distinctive shape. It's important to do it correctly, so you don't end up damaging the tree. Read on to learn the basics. 1 Do not top shade trees. 2  Topping a tree is pruning it for height-shade trees are meant to grow tall. 3  Topping has serious implications re branch structure/strength and overall tree health. 4  Do not attempt to control the height of a large tree by shearing the top."}, {"url": "http://www.wikihow.com/Trim-Trees", "passage_text": "How to Trim Trees. It's important to trim young and mature trees so they remain healthy. Dead and crowding branches can be removed to help sunlight reach the tree's interior. Trimming also promotes blooming and fruit production on flowering and fruit trees. It's important to trim branches at the right time of year and use the proper technique. Wait until the right time of year to trim trees. Trim deciduous and fruit trees when they are dormant, flowering trees after the blooms fade and evergreens during springtime or their growing season."}, {"url": "https://www.arborday.org/trees/tips/when-to-prune.cfm", "passage_text": "When to Prune. This depends to a large extent on why you prune. Light pruning and the removal of dead wood can be done anytime. Otherwise, here are some guidelines, but recognizing that individual species may differ is important to remember"}]