[{"url": "https://en.wikipedia.org/wiki/Domestic_cat", "passage_text": "The domestic cat (Felis catus or Felis silvestris catus) is a small, usually furry, domesticated, and carnivorous mammal. They are often called housecats when kept as indoor pets or simply cats when there is no need to distinguish them from other felids and felines. Feral cats are domestic cats that were born in or have reverted to a wild state. They are unfamiliar with and wary of humans and roam freely in urban and rural areas. The numbers of feral cats is not known, but estimates of the US feral population range from 25 to 60 million."}, {"url": "http://www.answers.com/Q/What_is_the_domestic_cat's_ancestor", "passage_text": "Confidence votes 9.7K. There has been much debate over the origins of the domestic cat over the last century or so. It is most likely that the African wildcat (Felis silvestris lybica), is the ancestor of the modern domestic cat. It was a small predator, slightly larger than a modern domestic cat. Proailurus is thought to be to be a likely ancestor to Pseudaelurus, prehistoric cat that lived 20-8 million years ago. Pseudaelurus is the ancestor of today's cats, as well as the famous sabre-tooth cats."}, {"url": "http://news.nationalgeographic.com/news/2007/06/070628-cat-ancestor.html", "passage_text": "The Near Eastern wildcat still roams the deserts of Israel, Saudi Arabia, and other Middle Eastern countries. (See map .) Between 70,000 and 100,000 years ago the animal gave rise to the genetic lineage that eventually produced all domesticated cats. "}, {"url": "http://www.livescience.com/7299-house-cats-wild-ancestor.html", "passage_text": "Domestic cats have been traced back to a single wild ancestor whose relatives still live in the remote deserts of the Middle East today. The transformation of a vicious predator into a docile tabby took place some 10,000 years ago, a new genetic analysis suggests. The DNA from domestic cats matched up with that of the Near Eastern wildcat subspecies Felis silvestris lybica, which lives in the remote deserts of Israel and Saudi Arabia. They detail the results this week in the online version of the journal Science."}, {"url": "http://news.nationalgeographic.com/news/2007/06/070628-cat-ancestor_2.html", "passage_text": "The sampling of feline genes revealed that the Near Eastern wildcat and domestic cats fell into the same genetic clade, a group of species with the same ancestor. This meant the ancient ancestors of the wildcats were likely the first cats to be domesticated. "}, {"url": "http://icatcare.org/advice/cat-care/origins-cats", "passage_text": "The domestic cat was first classified as Felis catus in 1758 by Carolus Linnaeus, and although this nomenclature is still the most commonly used, recent studies suggest that the domestic cat should really be regarded as a sub-species of the Wildcat-ie Felis sylvestris catus – and this term is used by some. The domestic cat (Felis catus) is one of the most recently evolved species within the Felidae family. The Felidae family have been split into three genera: 1  Panthera (cats that roar – lions, tigers, leopards, snow leopards, clouded leopards, and jaguars). 2  Acinonyx (the Cheetah)"}, {"url": "http://www.livescience.com/7299-house-cats-wild-ancestor.html", "passage_text": "They found that each wild group represents a subspecies of the wildcat Felis silvestris. The DNA from domestic cats matched up with that of the Near Eastern wildcat subspecies Felis silvestris lybica, which lives in the remote deserts of Israel and Saudi Arabia. They detail the results this week in the online version of the journal Science."}, {"url": "http://www.nytimes.com/2013/08/20/science/the-wild-past-of-domestic-cats.html", "passage_text": "A. A 2007 study of genes from 997 individual cats, both wild and domestic, points to common ancestors of domestic cats among the Near Eastern wildcat, Felis sylvestris lybica, one of the five subspecies of wildcat still found around the Old World. Times Topic: Q & A. The article, published in the journal Science, said that the domestic cats in the study shared at least five matriarchal lineages, as traced by mitochondrial DNA. The earliest evidence found of cats living with humans was a cat burial in Cyprus from about 9,500 years ago, reported in 2004."}]