[{"url": "http://www.lifescript.com/health/centers/atrial_fibrillation/s.aspx?query=what+causes+burning+feet", "passage_text": "Burning Feet-Common Causes www.lifescript.com/health/briefs/b/burning_feet_-_common_causes.aspx. Or you may have a fungal disease, such as athlete's foot, according to the Mayo Clinic. But if your burning feet symptoms are persistent, then the cause could be related to nerve damage. "}, {"url": "http://www.diabetesforecast.org/2010/sep/can-diabetes-cause-burning-in-the-feet.html", "passage_text": "Lee Sanders, DPM, responds: A painfully hot or burning sensation in the feet, especially in middle-aged and older people, could be caused by small fiber neuropathy. Diabetes is the most common cause of this condition; symptoms typically start with burning feet and numb toes. Though this sensation is not uncommon in people with diabetes, hot or burning feet can have many other causes. Since your friend says his feet feel very hot from time to time, but not all the time, he and his doctor should rule out other causes. A person's occupation and footwear are frequently responsible for hot feet."}, {"url": "http://www.mayoclinic.org/symptoms/burning-feet/basics/causes/SYM-20050809", "passage_text": "Persistent or progressive burning feet, however, can be a symptom of nerve damage (peripheral neuropathy), perhaps due to diabetes, chronic alcohol use, exposure to certain toxins, certain B vitamin deficiencies or HIV. Possible causes of burning feet: 1  Alcohol use disorder or chronic alcohol use. 2  Athlete's foot. 3  Charcot-Marie-Tooth disease (a group of hereditary disorders that affects the nerves in your arms and legs). 4  Chemotherapy. 5  Chronic kidney disease. 6  Complex regional pain syndrome (chronic pain due to a dysfunctional nervous system). Causes. Burning feet that occurs infrequently or for a short time may simply occur because your feet are tired or you have an irritation such as a"}, {"url": "http://www.footvitals.com/nerves/burning-feet.html", "passage_text": "The causes of burning feet are numerous and varied, ranging from simple fatigue to more serious conditions such as a nerve damage or circulatory issues. Therefore, the underlying cause should be diagnosed as soon as possible to avoid long-term damage and morbidity. "}, {"url": "https://en.wikipedia.org/wiki/Burning_feet_syndrome", "passage_text": "Burning feet syndrome, also known as Grierson-Gopalan syndrome, is a medical condition that causes severe burning and aching of the feet, hyperesthesia, and vasomotor changes of the feet that leads to excessive sweating. "}, {"url": "http://www.healthgrades.com/symptoms/burning-feet--causes", "passage_text": "Burning feet can be caused by nerve or skin damage in the feet and surrounding tissues. Burns from extreme heat or chemicals and exposure to poisonous substances may damage the nerves in the skin, resulting in burning feet. "}, {"url": "http://www.mayoclinic.org/symptoms/burning-feet/basics/definition/SYM-20050809", "passage_text": "Definition. Burning feet — the sensation that your feet are painfully hot — can be mild or severe. In some cases, your burning feet may be so painful that the pain interferes with your sleep. With certain conditions, burning feet may also be accompanied by a pins and needles sensation (paresthesia) or numbness, or both. "}, {"url": "http://www.webmd.com/pain-management/burning-feet-causes-treatments", "passage_text": "Besides neuropathy, infections and inflammation of the feet can also cause a burning sensation. The most common of these is athlete's foot, an infection of the skin caused by fungus. Peripheral artery disease (PAD) also commonly causes burning feet. Many other conditions can cause neuropathy or a burning sensation in the feet: 1  Chronic kidney disease (uremia). 2  Small fiber neuropathy. 3  Vitamin deficiency (vitamin B12 and occasionally vitamin B6). 4  Alcohol abuse. 5  Low thyroid hormone levels (hypothyroidism). 6  Lyme disease. 7  HIV /AIDS. 8  Amyloid polyneuropathy"}, {"url": "http://www.diabetesforecast.org/2010/sep/can-diabetes-cause-burning-in-the-feet.html", "passage_text": "Another common cause of burning feet is athlete's foot fungus. Some less common causes include alcoholism, chronic kidney failure, peripheral arterial disease, tarsal tunnel syndrome, Morton's neuroma, vitamin deficiency, HIV or AIDS, complex regional pain syndrome, and gastric bypass surgery. Though this sensation is not uncommon in people with diabetes, hot or burning feet can have many other causes. Since your friend says his feet feel very hot from time to time, but not all the time, he and his doctor should rule out other causes. A person's occupation and footwear are frequently responsible for hot feet."}]