[{"url": "http://www.fda.gov/ForConsumers/ConsumerUpdates/ucm181577.htm", "passage_text": "Some people are more sensitive to the effects of salt than others. The guidelines also recommend that, in general, individuals with hypertension, blacks, and middle-aged and older adults should limit intake to 1,500 mg of sodium per day. The exceptions to this guideline are people whose doctors have put them on a diet that requires even less sodium because of a medical condition. 1 The recommended intake of potassium for adolescents and adults is 4,700 mg/day. 2  Potassium-rich foods include leafy, green vegetables and fruits from vines. 3  Flavor food with pepper and other herbs and spices instead of salt. 4  Choose unsalted snacks. 5  Read food labels and choose foods low in sodium."}, {"url": "http://www.who.int/mediacentre/factsheets/fs394/en/", "passage_text": "Most people consume too much sodium through salt (corresponding to an average of 9–12 g of salt per day) and not enough potassium. High salt consumption and insufficient potassium intake (less than 3.5 g) contribute to high blood pressure, which in turn increases the risk of heart disease and stroke (6, 10). "}, {"url": "http://healthyeating.sfgate.com/fda-recommended-sodium-intake-1873.html", "passage_text": "The “Dietary Guidelines for Americans 2010” addresses sodium intake in detail. The average daily sodium intake for Americans is 3,400 milligrams per day, an excessive amount that raises blood pressure and poses health risks. In general, Americans should limit daily sodium consumption to 2,300 milligrams, but this is an upper safe limit, not a recommended daily allowance"}, {"url": "http://hc-sc.gc.ca/fn-an/nutrition/sodium/index-eng.php", "passage_text": "Recommended intake of sodium. It is recommended that people over the age of one year eat between 1000-1500 mg sodium per day. This is referred to as the Adequate Intake (AI) . People aged 14 and over should not eat more than 2300 mg sodium per day. This is referred to the Tolerable Upper Intake Level (UL). A sodium intake above 2300 mg per day is likely to pose a health risk."}, {"url": "http://www.livestrong.com/article/482968-what-is-the-rda-of-sodium/", "passage_text": "Sodium Recommendation. The RDA for sodium is currently no more than 2.3 g, or 2,300 mg, of sodium daily for healthy adults. That is equivalent to about 1 tsp. of salt a day. According to the Institute of Medicine, the maximum daily intake for sodium are the following: ages 1 to 3, 1,500 mg; ages 4 to 8, 1,900 mg; ages 9 to 13, 2,200 mg, and ages 14 to 18, 2,300 mg. People who are sensitive to sodium should only consume 1,500 mg of sodium per day. "}, {"url": "http://www.fda.gov/Food/ResourcesForYou/Consumers/ucm315393.htm", "passage_text": "1 The Nutrition Facts Label lists the Percent Daily Value (%DV) of sodium in one serving of a food. 2  The %DV for sodium is based on 100% of the recommended amount of sodium, which is less than 2400 milligrams (mg) per day. 1 Read the Nutrition Facts Label to see how much sodium is in the foods you are considering. 2  All Americans should consume less than 100% of the Daily Value or less than 2400 mg of sodium each day."}, {"url": "http://www.cdc.gov/salt/pdfs/Sodium_Dietary_Guidelines.pdf", "passage_text": "What Do the 2010 Guidelines Say About Sodium? The problem of eating too much sodium is covered in the report: n The Dietary Guidelines for Americans, 2010 recommend that Americans aged 2 and up reduce sodium intake to less than 2,300 milligrams (mg) per day."}, {"url": "http://www.livestrong.com/article/4734-need-recommended-daily-sodium-intake/", "passage_text": "The minimum requirement of sodium for normal body function is about 500 mg/day. The recommendation for sodium intake is less than 2,300 mg/day for adults. This equals about one teaspoon of table salt. Most people consume far too much sodium through processed foods and table salt, therefore, this recommendation is set at an upper limit. "}, {"url": "http://healthyeating.sfgate.com/fda-recommended-sodium-intake-1873.html", "passage_text": "The FDA urges Americans to limit dietary sodium. The U.S. Food and Drug Administration recommends that individuals consume no more than 2,300 milligrams of sodium per day, and that certain groups limit intake to 1,500 milligrams per day. The average daily sodium intake for Americans is 3,400 milligrams per day, an excessive amount that raises blood pressure and poses health risks."}, {"url": "http://www.fitday.com/fitness-articles/nutrition/healthy-eating/how-much-sodium-should-you-consume-per-day.html", "passage_text": "Setting Limits. The American Heart Association recommends limiting your sodium intake to less than 2,000 milligrams per day. And this may be easier said than done, due to the amount of sodium found in processed and canned foods. Frozen foods can even contain high amounts of sodium in an effort to keep them fresh longer. "}]