[{"url": "http://www.fingerprinting.com/what-is-dna-fingerprinting.php", "passage_text": "DNA Fingerprinting is a procedure whereby the genetic information, called DNA, in a person's cells is analysed and identified. The word fingerprinting is used because, just like a fingerprint, no two person's genetic code is exactly the same. This makes DNA fingerprinting a very useful tool for our modern society."}, {"url": "http://www.webmd.com/a-to-z-guides/dna-fingerprinting", "passage_text": "Only a small sample of cells is needed for DNA fingerprinting. A drop of blood or the root of a hair contains enough DNA for testing. Semen, hair, or skin scrapings are often used in criminal investigations. A person who has DNA fingerprinting done voluntarily usually provides a sample of blood taken from a vein."}, {"url": "http://www.wisegeek.org/what-is-dna-fingerprinting.htm", "passage_text": "Fingerprints might be left at a crime scene. DNA fingerprinting can establish a criminal's guilt. The majority of a human's DNA will match that of any other human. The sections of DNA used in DNA fingerprinting are passed doen from parents to their children."}, {"url": "http://itotd.com/articles/572/dna-fingerprinting/", "passage_text": "From high-profile trials to popular TV shows, numerous events have imprinted on our collective psyche the fact that DNA evidence can be used to solve crimes. But the technique has extensive uses that go far beyond forensic science. You may even owe tonight’s dinner, in part, to DNA fingerprinting."}, {"url": "http://itotd.com/articles/572/dna-fingerprinting/", "passage_text": "1 By using DNA fingerprinting, this harmful strain can be identified easily if it’s present in food. 2  After a major outbreak of this E. coli strain in 1993, the CDC created PulseNet, a national network of laboratories that performs DNA fingerprinting on food-borne bacteria."}, {"url": "http://genetics.thetech.org/original_news/news16", "passage_text": "To find a DNA fingerprint, a scientist has to first take the DNA out of the nucleus of a cell. The cell that is used to get a DNA fingerprint can be a skin cell, a hair root cell, or even a cheek cell that gets washed out of your mouth in your spit. This is because your unique DNA is the same in all of your cells."}, {"url": "http://itotd.com/articles/572/dna-fingerprinting/", "passage_text": "Therefore, in DNA fingerprinting, fragments of DNA are extracted and a collection is created that is unique for each person. There are several techniques for doing so; they differ mainly in how the fragments are extracted and how they are converted into a form that can be analyzed for identification."}]