[{"url": "http://www.rabbit.org/journal/4-11/symbol.html", "passage_text": "Last summer, as I was reading Stories Rabbits Tell, by Susan Davis and Margo DeMello, I was struck by the sheer complexity of our images of Rabbit.. One could even delve deeper into the mystical and ethereal symbolic meanings of Rabbit and the significance of Rabbit in dreams and in art. And one important symbolical meaning that Rabbit should elicit in us is that of playfulness and joy. Their nonsense displays of happiness are part of the Dance of Life-which is nothing more than a Cosmic Binkie. House Rabbit Society is a nonprofit rescue and education group."}, {"url": "https://en.wikipedia.org/wiki/Rabbits_and_hares_in_art", "passage_text": "In Judaism, the rabbit is considered an unclean animal, because though it chews the cud, does not have a divided hoof .. This led to derogatory statements in the Christian art of the Middle Ages, and to an ambiguous interpretation of the rabbit's symbolism. The  shafan  in Hebrew has symbolic meaning. Although rabbits were a non-kosher animal in the Bible, positive symbolic connotations were sometimes noted, as for lions and eagles. 16th century German scholar Rabbi Yosef Hayim Yerushalmi, saw the rabbits as a symbol of the Diaspora. In any case, a three hares motif was a prominent part of many Synagogues."}, {"url": "http://www.answers.com/Q/What_is_the_symbolic_meaning_of_rabbit", "passage_text": "Rabbit freezes when frightened. Usual predators of the rabbit watch for movement. If there is no movement by the rabbit, they are not spotted. When they are noticed it is the time to manuever. When in doubt, do nothing. When the presence of opportunity arrises leap for it quickly. Rabbit is a symbol of fertility. Rabbit shows us new growth in artistic areas and new projects. "}, {"url": "http://www.whats-your-sign.com/symbolic-rabbit-meanings.html", "passage_text": "Symbolic Rabbit Meanings. Animal Symbolism of the Rabbit. Symbolic rabbit meanings deal primarily with abundance, comfort, and vulnerability. Traditionally, rabbits are associated with fertility, sentiment, desire, and procreation. That's symbolic of the cycle of life, and they way life carries on generation after generation. This could hearken to our ideals of ancestry. Indeed in many cultures (Asian, for example) the rabbit is a symbol of longevity and a long family line."}, {"url": "http://www.whats-your-sign.com/symbolic-rabbit-meanings.html", "passage_text": "The rabbit is also a symbol of Ostara (see Rabbit Meanings Around the World below), an ancient fertility goddess whose symbols are rabbits, various flowers and eggs (more life/growth/fertility themes!). That's symbolic of the cycle of life, and they way life carries on generation after generation. This could hearken to our ideals of ancestry. Indeed in many cultures (Asian, for example) the rabbit is a symbol of longevity and a long family line."}, {"url": "http://www.rabbit.org/journal/4-11/symbol.html", "passage_text": "Rabbits are more than companion animals to many of us in the House Rabbit Society-they are also living symbols of a life style, a philosophy and a value system. Many people who live with a house bunny have chosen a vegetarian or vegan lifestyle, for example. And one important symbolical meaning that Rabbit should elicit in us is that of playfulness and joy. Their nonsense displays of happiness are part of the Dance of Life-which is nothing more than a Cosmic Binkie. House Rabbit Society is a nonprofit rescue and education group."}, {"url": "http://www.whats-your-sign.com/symbolic-rabbit-meanings.html", "passage_text": "Symbolic Rabbit Meanings via Physical/Behavioral Associations. Rabbits love to chew, and their teeth never stop growing. Symbolically, chewing implies repetition, contemplation, and breaking concepts down into component parts. Their diet is light and green, which implies symbolism of health and prosperity. That's symbolic of the cycle of life, and they way life carries on generation after generation. This could hearken to our ideals of ancestry. Indeed in many cultures (Asian, for example) the rabbit is a symbol of longevity and a long family line."}, {"url": "http://www.universeofsymbolism.com/rabbit-symbolism.html", "passage_text": "The abundance of babies that are born to the rabbits, exemplify the symbolism of abundance and fertility. It is no surprise that Rabbit symbolism is popular and makes an excellent totem for those wanting the blessings of fertility and the anticipation of the new arrival of a baby. Rabbit Symbolism Abundance & Blessings are in your midst. Rabbit Symbolism & Meaning. . . Rabbit finds many avenues to communicate it's magic with us, she comes to us in music, in movies in books and timeless tales."}, {"url": "http://www.sunsigns.org/rabbit-animal-totem-symbolism-meanings/", "passage_text": "Rabbit Animal Totem Symbolism. The soft and jovial rabbit animal totem is the ultimate symbol of abundance, prosperity, and fertility. Many expressions exist to describe the sexual and procreative abilities of these furry creatures and for good reason. A white rabbit in particular is a symbolic meaning of faithfulness in a loving and committed relationship, and to see one in your dreams should be taken as a very promising good omen. Alternatively, a black rabbit is an indication of your fears of intimacy."}, {"url": "http://www.whats-your-sign.com/symbolic-rabbit-meanings.html", "passage_text": "A mother rabbit can have forty or more babies a year. That's symbolic of the cycle of life, and they way life carries on generation after generation. This could hearken to our ideals of ancestry. Indeed in many cultures (Asian, for example) the rabbit is a symbol of longevity and a long family line."}]