[{"url": "http://www.ehow.com/info_8560336_tax-deduction-hot-tubs.html", "passage_text": "Save. Most people probably consider a hot tub a luxury, but it's possible to deduct one on your taxes. And you can potentially continue to take deductions on the hot tub in later years and avoid other state taxes. However, proving the necessity of a hot tub is going to be tough, and expect the Internal Revenue Service to want every detail about the hot tub purchase in case of an audit."}, {"url": "http://www.nordichottubs.com/health-blog/25-health-issues/124-hot-tub-tax-deduction.html", "passage_text": "Posted in Health Issues. Claiming a tax deduction for your Hot Tub: The IRS stated in its opinion letter Index No.: 213.05-00,  Section 213(a) allows as a [tax] deduction the expenses paid during the taxable year for medical care of the taxpayer, spouse, or dependent."}, {"url": "http://www.olympichottub.com/hot-tubs-sauna-blog/2012/02/how-to-claim-your-hot-tub-as-medical-expense-deduction-on-your-2011-tax-return/", "passage_text": "A doctor’s prescription can turn your hot tub into a piece of deductible medical equipment, as long as you satisfy a few IRS conditions. Remember that a written recommendation is the first and most important step in the deduction process. Look for IRS Publication 502, which covers medical expenses."}, {"url": "http://www.nordichottubs.com/health-blog/25-health-issues/124-hot-tub-tax-deduction.html", "passage_text": "If you deduct the cost of your hot tub on your tax return and in the next year obtain reimbursement from an insurance company, you would then have to declare that reimbursement as income on your next year's tax return."}, {"url": "http://www.ehow.com/info_8560336_tax-deduction-hot-tubs.html", "passage_text": "Other Deductions. You can deduct expenses related to the hot tub, such as installation. You also can deduct repair and maintenance during the lifetime of the tub on future tax returns--assuming that you still need the hot tub for medical reasons."}, {"url": "http://www.justanswer.com/tax/0pztu-claim-portion-installling-walk-in-bathtub.html", "passage_text": "Yes, you can claim a portion of this expense on your income tax return. Per IRS Publication 502, when you install special equipment in your home to assist with a medical need, part of the cost can be deducted as a medical expense."}]