[{"url": "http://alsplumbing.com/types-of-plumbing-pipes/", "passage_text": "There are a few different types of metal plumbing pipes; some transport water to faucets and other areas, and others are used to carry water away to the sewer or to the septic tank. Copper pipes are used to transport fresh water from your water supply throughout your home."}, {"url": "http://alsplumbing.com/types-of-plumbing-pipes/", "passage_text": "There are many different types of pipes used in plumbing, with various sizes and materials commonly being implemented to take care of different jobs. For example, the pipes that carry water to your commode are very small, but the pipe that carries waste away from that commode are very large."}, {"url": "http://alsplumbing.com/types-of-plumbing-pipes/", "passage_text": "Metal Piping. There are a few different types of metal plumbing pipes; some transport water to faucets and other areas, and others are used to carry water away to the sewer or to the septic tank. Copper pipes are used to transport fresh water from your water supply throughout your home."}, {"url": "http://plumbing.about.com/od/basics/tp/List-Of-Pipes-Used-For-Plumbing.htm", "passage_text": "There are a lot of types of pipe used for plumbing so it can get a little confusing when you go to buy materials for a project. Some pipes can be used for water while others cannot. Take a look at some of the most common types of pipe used for plumbing so that you can find the right match for your next project."}, {"url": "http://plumbing.about.com/od/basics/tp/Types-Of-Pipe.htm", "passage_text": "PVC stand for PolyVinyl Chloride. This type of pipe has a wide variety of plumbing uses from drainage pipe to water mains. It is most commonly used for irrigation piping, home, and building supply piping. PVC is also very common in pool and spa systems."}, {"url": "http://www.dummies.com/how-to/content/how-to-recognize-different-types-of-pipes.html", "passage_text": "Recognizing the different types of pipes within your house is vital to knowing the right repair technique. The most common pipes used today are copper, PVC, or ABS. However, when dealing with older homes, you might encounter a number of other piping material."}, {"url": "http://www.wisegeek.com/what-are-the-different-types-of-plumbing-pipe.htm", "passage_text": "Plastic pipes include polyvinyl chloride (PVC), chlorinated polyvinyl chlorine (CPVC), PEX pipe and PolyPipe®. Copper, stainless steel and galvanized steel are all types of metal plumbing pipe. Not all pipes are as useful or effective as others, and each type is used for a specific purpose in plumbing."}, {"url": "http://plumbing.about.com/od/basics/tp/Types-Of-Pipe.htm", "passage_text": "Take a look at this list of commonly used types of water pipes. Although there are other types of pipes used for water, these are some of the most common ones that can be found at your local home improvement or hardware stores."}]