[{"url": "http://www.hopkinsmedicine.org/neurology_neurosurgery/centers_clinics/peripheral_nerve_surgery/conditions/peripheral_nerve_system.html", "passage_text": "“Peripheral nerve” is a term used synonymously to describe the peripheral nervous system. The peripheral nervous system is a network of 43 pairs of motor and sensory nerves that connect the brain and spinal cord (the central nervous system) to the entire human body. These nerves control the functions of sensation, movement and motor coordination"}, {"url": "http://www.spine-health.com/conditions/spine-anatomy/cervical-nerves", "passage_text": "1 C1 and C2 (the first two cervical nerves) control the head. 2  C3 and C4 help control the diaphragm (the sheet of muscle that stretches to the bottom of the rib cage and plays an important role in breathing and respiration). Watch Cervical Radiculopathy Video. In addition to the seven cervical vertebrae, cervical anatomy features eight cervical nerves (C1-C8) that branch off of the spinal cord and control different types of bodily and sensory activities. Each cervical nerve is named based on the lower cervical vertebra that it runs between."}, {"url": "http://www.wisegeek.com/what-are-the-nerves-in-the-neck.htm", "passage_text": "Nerves in the neck control various functions of the human body. Cervical nerves C1 and C2 are responsible for the movement of the head. Commonly referred to as the suboccipital nerve, C1 also links to other nerves running through the neck, such as the vagus nerve and hypoglossal nerve. These nerves in the neck form the phrenic nerve, which helps control the diaphragm and regulate breathing. Injury to the phrenic nerve can result in problems breathing and even death. Ad. Together, nerves C1-C4 work to complete the functions of the cervical plexus."}, {"url": "http://www.wisegeek.com/what-are-the-nerves-in-the-neck.htm", "passage_text": "Nerve C6 controls movement in the wrists and C7 controls the triceps. Cervical nerve C8 works to control the hands. These functions are assisted through the branching of nerves from the brachial plexus to the regions they control. These nerves in the neck form the phrenic nerve, which helps control the diaphragm and regulate breathing. Injury to the phrenic nerve can result in problems breathing and even death. Ad. Together, nerves C1-C4 work to complete the functions of the cervical plexus."}, {"url": "http://www.wisegeek.org/what-are-cervical-nerves.htm", "passage_text": "Cervical nerves are spinal nerves from the first seven vertebrae of the spinal cord. These seven vertebrae, called C1 through C7, begin at the base of the skull and make up the cervical spine in humans and most other mammals. 1 Cervical nerves stem from the first seven vertebrae, C1-C7, of the spinal cord in your neck. 2  Cervical nerves can affect motor function in both the upper and lower body."}, {"url": "http://www.hopkinsmedicine.org/neurology_neurosurgery/centers_clinics/peripheral_nerve_surgery/conditions/peripheral_nerve_system.html", "passage_text": "The peripheral nervous system includes the following nerves: 1  Brachial plexus nerve – This nerve is actually a network of nerves that consists of the last 4 cervical nerve roots (vertebrae C5-C8) and the first thoracic (vertebrae T1) nerve root, and ensures motion and feeling in the upper limbs. The peripheral nervous system is a network of 43 pairs of motor and sensory nerves that connect the brain and spinal cord (the central nervous system) to the entire human body."}, {"url": "http://www.emedicinehealth.com/cervical_spinal_stenosis-health/article_em.htm", "passage_text": "The seven vertebrae between the head and the chest make up the cervical spine. Squeezing the nerves and cord in the cervical spine can change how the spinal cord functions and cause pain, stiffness, numbness, or weakness in the neck, arms, and legs. It can also affect your control of your bowels and bladder. "}, {"url": "http://www.webmd.com/brain/areas-the-nerves-control-in-the-spinal-cord-injury", "passage_text": "Areas the Nerves Control. The nerves in the area of a vertebra control specific parts of the body. For example, the 7th cervical nerve (C7) in the neck area controls the triceps (the muscle in the upper arm), while the thoracic nerves (T2 through T7) control the chest muscles. The higher the injury on the spinal cord, the more paralysis there is. For example, damage high on the spinal cord, in the cervical segment, can result in paralysis of the chest, arms, and legs (tetraplegia, also known as quadriplegia). Damage lower down on the spine (thoracic, lumbar, or sacral segments) can result in paralysis of the legs and lower body (paraplegia)"}]