[{"url": "http://medical-dictionary.thefreedictionary.com/masseter", "passage_text": "the thick rectangular muscle in the cheek that functions to close the jaw. It is one of the four muscles of mastication. The masseter is innervated by the masseteric nerve from the mandibular division of the trigeminal nerve. The major jaw muscle, which participates in protraction, retraction and side to side movement of the jaw. Action. Closes jaw. A muscle with origin from the inferior border and medial surface of the zygomatic arch, with insertion into the lateral surface of the ramus of the mandible, with nerve supply from the masseteric nerve, and whose action closes the jaw during chewing."}, {"url": "http://www.healthline.com/human-body-maps/masseter-muscle", "passage_text": "Masseter. The masseter muscle is a facial muscle that plays a major role in the chewing of solid foods. The muscle is shaped similar to a parallelogram, connecting to the mandible (lower jawbone) and the cheekbone. The masseter is divided into two distinct sections, the superficial and deep portions. The masseter is the key muscle that pulls the mandible upward. All four muscles are connected to a single division of the trigeminal nerve. Because of the sheer bulk of the masseter muscle, portions of it are sometimes removed by plastic surgeons performing jaw reduction surgery."}, {"url": "https://en.wikipedia.org/wiki/Masseter_muscle", "passage_text": "In human anatomy, the masseter is one of the muscles of mastication. In the animal kingdom, it is particularly powerful in herbivores to facilitate chewing of plant matter. The most obvious muscle of mastication is the masseter muscle, since it is the most superficial and one of the strongest."}, {"url": "http://www.gustrength.com/muscles:masseter-muscle-actions-and-trigger-points", "passage_text": "Posted on 18 Oct 2010 15:27. By Ground Up Strength. The masseter is a jaw muscle that gets its name from the Greek work to chew. It is the major muscle of mastication (chewing) of the human jaw and serves primarily to elevate the mandible (lower jaw) while the deep tissues help to protrude (protract) it forward. In general, masseter trigger points cause pain in the eye, face, jaw, and teeth area. An unexplained earache can be a result of masseter trigger points and it is reported in Travell an Simons that TrPs of the masseter can even cause that annoying itch deep in the ear that you can never quite scratch."}, {"url": "https://www.kenhub.com/en/library/anatomy/masseter-muscle", "passage_text": "Anatomy and supply. The masseter muscle is a thick, rectangular muscle of mastication. It consists of a superficial and a deep part, both originating from the zygomatic arch. The masseter is one of the four muscles of the masticatory apparatus. It elevates the mandible causing a powerful jaw closure. The contraction of the superior part which runs diagonally to the front moves the mandible forward (protrusion)."}, {"url": "http://www.merriam-webster.com/dictionary/masseter", "passage_text": "Medical Definition of MASSETER. : a large muscle that raises the lower jaw and assists in mastication, arises from the zygomatic arch and the zygomatic process of the temporal bone, and is inserted into the mandibular ramus and gonial angle. — mas·se·ter·ic \\ˌmas-ə-ˈter-ik\\ adjective. Definition of MASSETER. : a large muscle that raises the lower jaw and assists in mastication. — mas·se·ter·ic \\ˌma-s"}, {"url": "http://www.neuronarc.com/masseter-muscle.html", "passage_text": "Masseter Muscle: Parts ,Origin and insertion. The masseter muscle consists of a superficial and a deep part. The origin of the superficial part is on the zygomatic arch and its insertion is on the lateral masseteric tuberosity at the angle of the mandible. Origin and insertion of the masseter muscle. Schematic drawing showing the areas of origin and insertion of the masseter muscle. The origin of the pars superficialis is on the inferior surface of the zygomatic arch ante­rior to that of the pars profunda. The insertion of the pars superfi­cialis lies on the lateral surface of"}, {"url": "http://www.youtube.com/watch?v=BJ9uUSyhyYc", "passage_text": "Find more videos at: https://www.kenhub.com. Subscribe to our YouTube channel: http://bit.ly/VOEG2I. The masseter muscle is a thick, rectangular muscle of mastication. It consists of a superficial and a deep part, both originating from the zygomatic arch. "}, {"url": "http://www.healthline.com/human-body-maps/masseter-muscle", "passage_text": "The superficial portion of the masseter is the thick and tendon-like portion of the muscle that connects to the cheekbone, while the deep portion is the smaller and more muscular portion of the muscle that connects to the mandible. The masseter is the key muscle that pulls the mandible upward. All four muscles are connected to a single division of the trigeminal nerve. Because of the sheer bulk of the masseter muscle, portions of it are sometimes removed by plastic surgeons performing jaw reduction surgery."}]