[{"url": "http://www.miamiherald.com/entertainment/celebrities/article20846022.html", "passage_text": "Bravo viewers are accustomed to seeing chef Ben Robinson cook on the high seas in Below Deck, which follows the motley crew of the yacht Honor during charter season and its colorful set of often finicky guests."}, {"url": "http://www.chefbenrobinson.com/", "passage_text": "Chef Ben Robinson believes in challenging the status quo. He believes that food is one of the most fascinating subjects on earth. Food is art, chemistry, and medicine."}, {"url": "http://www.bravotv.com/people/ben-robinson", "passage_text": "Chef Ben Robinson, 33, is accomplished both on land and sea. He worked under Italian master chefs in Florence and gained an apprenticeship at 3-Michelin Star restaurant The Fat Duck, based in the United Kingdom."}, {"url": "http://www.chefbenrobinson.com/about-private-chef-ben-robinson/", "passage_text": "Chef Ben Robinson runs a top-notch Fort Lauderdale catering company. As a chef, he believes in challenging the status quo, and that food is one of the most fascinating subjects on earth. Food is art, chemistry, and taste."}, {"url": "https://www.facebook.com/BenRobinsonChef", "passage_text": "Ben Robinson exclusive interview. Ben Robinson is the dashing and divinely talented chef (ahoy there!) on Bravo's massive hit show, Below Deck (Cruise yourself over to Bravo on Tuesdays at 9 PM."}, {"url": "http://realitytv.about.com/od/Reality-Shows-A-M/ss/Below-Deck-Season-2-Meet-the-Cast.htm", "passage_text": "Returning for the second season, 33-year-old Chef Ben Robinson, is an accomplished chef on land and sea. He worked under Italian master chefs in Florence and gained an apprenticeship at the 3- Michelin Star British restaurant, The Fat Duck. Since then Ben has been a head chef on yachts for more than a decade."}, {"url": "http://realitytv.about.com/od/Reality-Shows-A-M/ss/Cast-Of-Below-Deck.htm", "passage_text": "Ben Robinson is a 31-year-old chef from Oxford, England. He is accomplished as a chef on both land and sea. After working under Italian master chefs in Florence, he gained an apprenticeship with the three-Michelin Star restaurant The Fat Duck, based in the United Kingdom."}, {"url": "http://web.poptower.com/ben-robinson-below-deck.htm", "passage_text": "Ben Robinson from  Below Deck  stars in the Bravo reality docu-series. Ben Robinson is an accomplished chef on land and sea. He worked under Italian master chefs in Florence and gained an apprenticeship at 3-Michelin Star restaurant The Fat Duck."}]