[{"url": "http://www.randallreilly.com/markets/recruiting/driver-recruiting-calculator/", "passage_text": "If not, $120,000 is a good place to start. Assuming that recruiting an extra 130 drivers means 130 more trucks on the road, you’ll want to multiply your revenue per truck by the number of drivers you want to add to your fleet. Let’s walk through the steps to calculating how much you should be spending to recruit the drivers your fleet will need this year. (You can also fill out the form on the right to download our easy-to-use Driver Recruiting Calculator in Microsoft Excel, and let us do the math for you.)."}, {"url": "http://schneiderjobs.com/company-drivers/driving-opportunities/over-the-road", "passage_text": "Schneider understands the importance of a positive work-life balance. That’s why we do our best to get our drivers home as often as we can. As a full-time OTR truck driver, you can expect to be home five days in a 28-day period, or choose a part-time truck driving option. "}, {"url": "http://askthetrucker.com/truck-driver-recruiter-wages-surpass-driver-pay/", "passage_text": "As in the company example above, at $400 per new-hire after fourteen days, a recruiter can earn $62,400 per year by hauling in just three new drivers per week and with the industry’s established driver retention plan still in place, there is never a shortage of new-hires for truck driver recruiters. © 2013, Allen Smith. Examining the average pay for a truck driver recruiter within various cities across the United States, one can see how location can play a part in salary income: 1  New York City, NY = $85,000. 2  Washington, D.C. = 3  $77,000. 4  Atlanta, GA = $76,000. 5  Boston, MA = $74,000. 6  Chicago, IL = $72,000. 7  Los Angeles, CA = $70,000."}, {"url": "http://askthetrucker.com/truck-driver-recruiter-wages-surpass-driver-pay/", "passage_text": "Truck driver recruiter pay is surpassing driver salaries by nearly three times as much, depending on geographical area. One company is hiring truck driver recruiters by offering $400 per new-hire with the only stipulation being that in order to be paid, the new-hire must stay with the company for at least 14 days. Examining the average pay for a truck driver recruiter within various cities across the United States, one can see how location can play a part in salary income: 1  New York City, NY = $85,000. 2  Washington, D.C. = 3  $77,000. 4  Atlanta, GA = $76,000. 5  Boston, MA = $74,000. 6  Chicago, IL = $72,000. 7  Los Angeles, CA = $70,000."}, {"url": "http://www.kansascity.com/news/business/article1993207.html", "passage_text": "Signing bonuses. Productivity premiums. Calls from recruiters. Remedies for a worsening truck driver shortage are popping up across the country. Most agree the freight industry will need to do more. “The companies need to stop being so greedy and start paying the driver,” said James Hart, an over-the-road driver who had stopped for fuel in Oak Grove recently. They are going to customers, including big retailers, and talking about the need for rate increases to help cover the drivers’ pay raises. US Xpress Enterprises, a long-haul trucking company like Swift, does say how much its August pay increase was — 13 percent and the biggest in its 28-year history."}, {"url": "http://www.randallreilly.com/markets/recruiting/driver-recruiting-calculator/", "passage_text": "If so, you need to figure out if your fleet should invest more money in recruiting, and if you do what that will that mean for the bottom line. The average fleet makes between $100,000 to $160,000 per year per truck in revenue. If you know what the annual value of a truck is for you, use that number. Let’s walk through the steps to calculating how much you should be spending to recruit the drivers your fleet will need this year. (You can also fill out the form on the right to download our easy-to-use Driver Recruiting Calculator in Microsoft Excel, and let us do the math for you.)."}, {"url": "http://www.truck-drivers-money-saving-tips.com/recruiters.html", "passage_text": "Mike has talked with a number of other recruiters through the years. Much of the information that was a mystery to truck drivers in the 1990s is now openly available on trucking companies' websites. Drivers can cut through the recruiters' lines to get some solid facts. 1 info on those who hire new and experienced truck drivers; and. 2  a long list of questions -- borne out of our experience -- that you might ask before you hire on with any trucking company regarding the company, the equipment, the freight, operations, drivers, communication, benefits and accidents."}, {"url": "http://www.truckingtruth.com/trucking_blogs/Article-3676/the-biggest-mistake-new-drivers-make-when-speaking-with-recruiters", "passage_text": "by Brett Aquila. Recruiters for truck driving schools and trucking companies are a valuable resource for anyone considering a career as a truck driver. But far too many new drivers equate the professionalism of the recruiter with the quality of the company or school, and that couldn't be further from the truth. Taking care of current students or drivers is the job of Human Resources, not recruiting, so you'll likely never speak with them again. If you're a student at school, it's your trainers that will make all the difference when it comes to the quality of your training, not the recruiter. If you're a driver, it's your dispatcher and load planners that will make the difference when it comes to your miles and home time, not the recruiter. So don't get the impression that the recruiter can make things happen for you once you sign on the dotted line. In fact, it's quite the opposite"}]