[{"url": "http://kb.winzip.com/kb/entry/19/", "passage_text": "WinZip Courier provides an easy way to compress attachments when you press Send or immediately as you attach your files. Courier requires a supported version of Outlook or a supported webmail service used with a supported internet browser in order to work. WinZip will compress the selected items in a temporary Zip file, create a new email message, and attach the Zip file to it. You can then address and mail the message as you normally would. WinZip will automatically delete the temporary Zip file when it is no longer needed."}, {"url": "http://www.wikihow.com/Make-a-Zip-File", "passage_text": "2. Right-click on the folder. Click the “Compress” option. The folder will be compressed into a ZIP file. The new ZIP file will be located in the same location as the folder that you compressed. 1  You can also select multiple files in your file explorer, right-click on one of them, and then follow the above steps. First, place all of the files that you want to compress into a single folder, and then rename that folder to the name that you want your ZIP file to have. 1  Open the Terminal. 2  Navigate to where the folder that you want to compress is located. 3  Enter the command: 4  Create a password."}, {"url": "http://smallbusiness.chron.com/send-zip-files-mac-osx-via-gmail-43451.html", "passage_text": "However, if your attachments are large or if you have multiple files to send, you may want to compress the files into a single ZIP file before sending it out to others. Step 1. Select the file you wish to compress. If you want to select multiple files, hold the “Command” key and click on the files you wish to compress. You can also select a folder or folders to compress into a single file. Step 2. Click “File” and click “Compress” from the drop-down menu. A ZIP file of the items you selected will appear."}, {"url": "http://kb.winzip.com/help/courier/OfcSendZipped.htm", "passage_text": "Your options in this dialog are: 1  Zip file name: WinZip Courier will suggest a file name. 2  You can leave this selected, or you can specify a different name by clicking Use this name and typing in the desired name. 3  Please specify the file name only; do not include a drive letter or folder name. You can then address the e-mail message, add body text, and send the e-mail as you usually would. Click Cancel to return to your Office application without creating the e-mail or Zip file. You must send or close the e-mail message created by this feature before you can continue using your Office application."}, {"url": "http://www.ehow.com/how_4933639_send-zip-file.html", "passage_text": "Instructions. Right-click on the file you want to send. Hold your mouse over the Send To option. Click Compressed (zipped) folder.. A zipped version of the file appears in the same location as the original. Enter the recipient's address in the To field, and type any desired text in the Subject and Body Fields.. Click on the Attach button. In most email services, this is labeled with a paperclip icon. Browse your computer's folders until you locate the newly created zip file. Double-click on the file to attach it to your message. When it finishes attaching, your message is complete and you can send your zip file off into cyberspace"}, {"url": "https://www.nebraska.gov/NREC/real/realzipfiles.html", "passage_text": "If you are unable to send to a Compressed or Zipped Folder when right-clicking on your files, you may not have a zip software program installed. Click here to choose which zip software program you would like to download. 1  Select all the files you want to zip together by holding the CTRL key and clicking on each one. Click the right hand button on your mouse, and select Send to from the menu that appears. Select Compressed or Zipped Folder from the secondary menu. This will create a new Zipped Folder, which will show up as a new icon. 1 Open the folder that contains the files you would like to Zip together. 2  Click the right hand button on your mouse and select New from the menu that appears. 3  Select Zipped File from the secondary menu. 4  A new icon will appear in the folder, which is ready to be renamed."}, {"url": "http://kb.winzip.com/help/courier/OfcSendZipped.htm", "passage_text": "Your options in this dialog are: 1  Zip file name: WinZip Courier will suggest a file name. 2  Compression Method: You can choose either Zip: Legacy compression or Zipx: Best method. 3  Encryption: If you want to encrypt the document in the Zip file e-mail attachment, check Encrypt. You can then address the e-mail message, add body text, and send the e-mail as you usually would. Click Cancel to return to your Office application without creating the e-mail or Zip file. You must send or close the e-mail message created by this feature before you can continue using your Office application."}, {"url": "http://www.liutilities.com/how-to/zip-a-pdf-file/", "passage_text": "Select the file you want to zip and click the 'Add' button again. A list of files will appear. Select your chosen file again and click on the 'Add' button. Step 11. You will find your new .zip archive to the left of the panel. Highlight this and click on 'Action', proceed to 'More Function', and then to 'Create SFX'. "}, {"url": "http://www.liutilities.com/how-to/send-a-zip-file/", "passage_text": "Try to find an 'add attachment' button or option and click. This would prompt a blank field or blank fields, which you can fill in manually if you have memorized the location and name of your file, or just click on the 'browse' button beside the field. Step 4. It is advisable to check if any of the files in the zipped file you are sending may contain malicious software. Most applications that may cause harm or damage to a computer or compromise the privacy of a system are spread through email attachments. Right-click on the zipped file and choose 'Scan for Viruses'."}]