[{"url": "http://grumomedia.com/how-much-a-typical-promo-video-costs/", "passage_text": "Even at $100K that is about $3,000 per second of video compared to $170 per second for a one minute $10K promo video. The difference is a whopping 18 times cheaper! Again that is considering a cheap TV ad versus an expensive animated promo video. So in reality the difference is usually 30 to 50 times less in price for a typical 1 minute demo video than for a 30 sec commercial. The typical animated promo video costs anywhere from $3K to $10K a minute. $3K will get you a very simple animated promo video as it will barely cover the costs of producing the script, storyboard, voiceover and hiring an animator. A good animator charges between $300 to $500 a day. If the animation is very simple a good animator can produce about one minute of content a week. At $400 a day that is $2K just to animate a simple project not counting any revisions"}, {"url": "http://www.qudos-animations.co.uk/animation/how-much-should-a-whiteboard-animation-cost.html", "passage_text": "It is hard to place a figure on how much a whiteboard animation would cost, as it usually works on a case-by-case basis. However, as an idea, the cost of a well-made whiteboard animation would be from £2,000 - £4,000 to begin with. The Duration. This brings us to the next factor that determines the cost of a whiteboard animation and that is the time it takes to make it. A typical 60-90 second whiteboard animation would take at least 6-8 weeks to produce."}, {"url": "http://www.awn.com/forum/thread/1010315", "passage_text": "You just cut your rough animation schedule in half from 14 weeks to 7 weeks. Now you're only paying the five animators $1,500 a week for 7 weeks = $52,500 rough animation budget. The clean up drawing quota can go up from an average of 10 drawings per day to 15 drawings per day. Now you're getting those 5760 clean up drawings done in 7.6 weeks. "}, {"url": "http://www.videobrewery.com/blog/how-much-does-an-explainer-video-cost", "passage_text": "A lot of people are surprised, even shocked, when they first hear how much an explainer video can cost. But if you don't understand the amount of time and effort that go in to producing one, it's hard to wrap your head around just what your money is buying. The number one question we hear from people is “how much does an explainer video cost?” For our purposes here, we’re talking about a 60-second animated explainer video, which is typically the most popular offering. As you’d probably expect, you can find a wide range of prices out there, anywhere from $1,500 to $15,000."}, {"url": "http://www.payscale.com/research/US/Job=Animator/Salary", "passage_text": "An Animator earns an average salary of $50,281 per year. A skill in 2D Animation is associated with high pay for this job. Pay for this job rises steadily for more experienced workers, but goes down significantly for the few employees with more than 20 years' experience. "}, {"url": "http://www.austincc.edu/sfarr/animation-costs.html", "passage_text": "A television series like .  is in the $500 per second range. Commercials average in the $3,000 to $5,000 per second range. Until recently, the average price of any animation that would be considered professional was about $1,000 per second minimum. Television shows like . A television series like The Simpsons is in the $500 per second range. Commercials average in the $3,000 to $5,000 per second range. Until recently, the average price of any animation that would be considered professional was about $1,000 per second minimum. Television shows like Dr."}, {"url": "http://www.digicast.com.au/marketing-video-blog/bid/90470/How-much-does-a-video-cost", "passage_text": "Expect to pay around $1,500 per minute for basic animation and up to $3,500 per minute for 3D animations. CFA-How Stress Affects Your Brain from Digicast Productions on Vimeo. As you can now understand, corporate video or marketing video costs can vary in price depending on all of the extras you want to include. Price depends on the length and the complexity of the visuals, but expect the price to be upwards of $2,000 for a 2 minute video. 2. Standard Marketing Video. The difference between an amateur video and a professional one can be many."}, {"url": "http://www.cartoonbrew.com/ideas-commentary/72508-72508.html", "passage_text": "Some of the star animators produced up to 10 seconds a week. To be completed, the animation still had to pass through several hands. No wonder feature quality traditional animation typically cost between $80,000 and $1,000,000 per minute to produce within the studio system. Although the goals on my Kickstarter project are set at $15K per minute, this won’t be the amount I’ll be getting for the production. However, both films share one thing in common: they have budgeted their animation at $15,000 per minute. Gagne gagné set his goal at15,000 15000 to produce-one minute of, film with each additional minute produced at a$ 15k. increment"}]