[{"url": "http://www.merriam-webster.com/dictionary/fracking", "passage_text": "Definition of FRACKING. : the injection of fluid into shale beds at high pressure in order to free up petroleum resources (such as oil or natural gas). — frack \\ˈfrak\\ verb. ADVERTISEMENT. by shortening & alteration from (hydraulic) fracturing. : the injection of fluid into shale beds at high pressure in order to free up petroleum resources (such as oil or natural gas). — frack \\ˈfrak\\ verb"}, {"url": "http://www.investopedia.com/terms/f/fracking.asp", "passage_text": "DEFINITION of 'Fracking'. A slang term for hydraulic fracturing. Fracking refers to the procedure of creating fractures in rocks and rock formations by injecting fluid into cracks to force them further open. The larger fissures allow more oil and gas to flow out of the formation and into the wellbore, from where it can be extracted. Fracking has resulted in many oil and gas wells attaining a state of economic viability, due to the level of extraction that can be reached."}, {"url": "https://en.wikipedia.org/wiki/Hydraulic_fracturing", "passage_text": "Hydraulic fracturing (also hydrofracturing, hydrofracking, fracking or fraccing) is a well-stimulation technique in which rock is fractured by a pressurized liquid. The process involves the high-pressure injection of 'fracking fluid' (primarily water, containing sand or other proppants suspended with the aid of thickening agents) into a wellbore to create cracks in the deep-rock formations through which natural gas, petroleum, and brine will flow more freely."}, {"url": "http://www.bbc.com/news/uk-14432401", "passage_text": "Drilling companies suggest trillions of cubic feet of shale gas may be recoverable from underneath parts of northern England, through a process known as fracking. Hydraulic fracturing, or fracking, is a technique designed to recover gas and oil from shale rock. Fracking is the process of drilling down into the earth before a high-pressure water mixture is directed at the rock to release the gas inside. Water, sand and chemicals are injected into the rock at high pressure which allows the gas to flow out to the head of the well."}, {"url": "http://www.investopedia.com/terms/r/refracking.asp", "passage_text": "DEFINITION of 'Re-fracking'. Re-fracking is the practice of returning to older shale oil and gas wells that had been fracked in the recent past to capitalize on newer, more effective extraction technology."}, {"url": "http://www.what-is-fracking.com/", "passage_text": "Learn how fracking uses water to extract oil and natural gas from shale plays, why fracking is an economic and energy security solution, and where fracking is safely taking place in America. Learn More. WP-Backgrounds Lite by InoPlugs Web Design and Juwelier Schoenmann schönmann 1010. wien "}, {"url": "http://www.urbandictionary.com/define.php?term=Fracking", "passage_text": "5. Fracking. Like the term used in oil and gas mining where water is pumped with high pressure into the ground to bring hidden treasure to the surface, Fracking, in the world of adventurous sex, is a term describing an act where dicks are used as a high pressure douching implements."}, {"url": "http://www.definition-of.com/fracking", "passage_text": "(Verb) Slang term for hydraulic fracturing. Fracking is the drilling method that uses water, sand and other additives to expand fissures in underground rocks to free oil or natural gas trapped within them. Before the development of fracking, it was not commercially viable to try to mine these resources with existing technology. (Noun) hydraulic fracturing. (Noun) hydraulic fracturing; the process of creating cracks in rock formations by injecting fluid into cracks to force them open to collect the gas that seeps out. (Noun) The extraction of natural gas through the process of"}]