[{"url": "http://www.buzzle.com/articles/aerobic-and-anaerobic-respiration.html", "passage_text": "In this process, energy, carbon dioxide, and lactic acid or alcohol are produced by the breakdown of glucose molecules. It uses electron acceptors other than oxygen, and involves the processes of glycolysis and fermentation. Anaerobic respiration, in case of yeast cells, is commonly referred to as fermentation. Anaerobic respiration refers to the type of respiration that takes place in the absence of oxygen. This form of respiration is carried out in bacteria, yeasts, some prokaryotes, and muscle cells."}, {"url": "https://en.wikipedia.org/wiki/Anaerobic_respiration", "passage_text": "Not to be confused with Lactic acid fermentation. Anaerobic respiration is a form of respiration using electron acceptors other than oxygen. Although oxygen is not used as the final electron acceptor, the process still uses a respiratory electron transport chain; it is respiration without oxygen. In order for the electron transport chain to function, an exogenous final electron acceptor must be present to allow electrons to pass through the system"}, {"url": "http://www.diffen.com/difference/Aerobic_Respiration_vs_Anaerobic_Respiration", "passage_text": "Diffen › Science › Biology. Aerobic respiration, a process that uses oxygen, and anaerobic respiration, a process that doesn't use oxygen, are two forms of cellular respiration. Although some cells may engage in just one type of respiration, most cells use both types, depending on an organism's needs. Anaerobic respiration is respiration without oxygen; the process uses a respiratory electron transport chain but does not use oxygen as the electron acceptors. Cells that use it. Aerobic respiration occurs in most cell"}, {"url": "http://passmyexams.co.uk/GCSE/biology/aerobic-and-anaerobic-respiration.html", "passage_text": "Respiration is the process of releasing energy from the breakdown of glucose. Respiration takes place in every living cell, all of the time and all cells need to respire in order to produce the energy that they require. "}, {"url": "http://www.saylor.org/site/wp-content/uploads/2010/11/Wiki-Cellular-respiration.pdf", "passage_text": "Cellular respiration 3. Glycolysis Glycolysis is a metabolic pathway that is found in the cytoplasm of cells in all living organisms and is anaerobic(that is, oxygen is not required). The process converts one molecule of glucose into two molecules of pyruvate, itmakes energy in the form of two net molecules of ATP. Cellular respiration (also known as'oxidative metabolism') is the set of themetabolic reactions and processes that takeplace in organisms' cells to convertbiochemical energy from nutrients intoadenosine triphosphate (ATP), and thenrelease waste products."}, {"url": "http://www.answers.com/Q/Anaerobic_respiration_is_also_known_as", "passage_text": "Anaerobic respiration is the process by which non-oxygen dependent  organisms breath. It is mostly commonly used in the process of  fermentation.    Anaerobic respiration is respiration that uses electron acceptors  other than oxygen. Anaerobic respiration can be found in protozoans  and bacteria. Anaerobic respiration is a type of cellular respiration. It occurs  when oxygen is not available or is available in very low  quantities. It is also a respiration in the absence of oxygen. Oxygen is not used as the final electron acceptor. "}, {"url": "http://www.answers.com/Q/Anaerobic_respiration_is_also_called", "passage_text": "Anaerobic respiration is the process by which non-oxygen dependent  organisms breath. It is mostly commonly used in the process of  fermentation.    Anaerobic respiration is respiration that uses electron acceptors  other than oxygen. Anaerobic respiration can be found in protozoans  and bacteria. Anaerobic respiration is a type of cellular respiration. It occurs  when oxygen is not available or is available in very low  quantities. It is also a respiration in the absence of oxygen. Oxygen is not used as the final electron acceptor. "}]