[{"url": "http://www.realtytoday.com/articles/5007/20140111/ellen-degeneres-drops-39-8-million-los-angeles-brody-house.htm", "passage_text": "more big. Although DeGeneres can afford to pay for the home just running a talk show and hosting awards and stuff (her net worth is $200 million and she makes about $65 million a year approximately), looks like she made some clear property moves here. (Photo: Reuters). Ellen DeGeneres is back in real estate action. She also sold a home in Los Angeles for $21 million, reports Daily Mail. Although DeGeneres can afford to pay for the home just running a talk show and hosting awards and stuff (her net worth is $200 million and she makes about $65 million a year approximately), looks like she made some clear property moves here."}, {"url": "http://www.celebritynetworth.com/richest-celebrities/richest-comedians/ellen-degeneres-net-worth/", "passage_text": "$75 Million. Ellen DeGeneres net worth and salary: Ellen DeGeneres is an American comedian, actres, and TV personality who has a net worth of $330 million and an annual salary of $70 million. Ellen DeGeneres was born on January 26, 1958 in Metairie, Louisiana. Today, The Ellen DeGeneres show is one of the most-watched shows on daytime television. As of February 2014, the show has aired more than 1800 episodes over 11 seasons and has won 33 Daytime Emmys."}, {"url": "http://www.therichest.com/celebnetworth/celeb/tv-personality/ellen-degeneres-net-worth/", "passage_text": "About Ellen DeGeneres. Emmy award winner Ellen DeGeneres is probably one of the most popular TV talk show hosts in the world today. This American actress, talk show host and stand-up comedian is known to host the 10-year running The Ellen DeGeneres Show. Her net worth is estimated to be $345 million in 2015. Ellen DeGeneres was born on January 26, 1958 in Metairie, Louisiana, U.S. She is of Irish, German, English and French descent. Ellen is a self-proclaimed lesbian. She is a recipient of 13 Grammy Awards for her impressive hosting abilities"}, {"url": "http://richestcelebrities.org/richest-tv-personalities/ellen-degeneres-net-worth/", "passage_text": "Ellen DeGeneres net worth: With $200 million of her net worth and $65 million as her yearly salary, is it possible to picture that how wealthy is Ellen degeneres? Produced as Ellen Lee DeGeneres on January 26, 1958, she’s called American comic, performer as well as her television show that really success. Tags $285 Million $65 million 1958 5 ft 7 in (1.71 m) Actor Anne Heche Betty DeGeneres Comedian Daytime Emmy Awards Degeneres Ellen Ellen DeGeneres Ellen Degeneres Net Worth Ellen Lee DeGeneres Elliott DeGeneres Film producer Forbes January 26 Louisiana Metairie Oprah Winfrey Portia de Rossi Portia de Rossi (m."}, {"url": "http://www.celebritynetworth.com/couples/ellen-degeneres-portia-de-rossi-net-worth/", "passage_text": "Ellen DeGeneres net worth and salary: Ellen DeGeneres is an American comedian, actres, and TV personality who has a net worth of $330 million and an annual salary... Portia de Rossi net worth: Portia de Rossi is an Australian-American actress and model who has a net worth of $20 million. Portia de Rossi... Profession. $270 Million. Ellen DeGeneres is an American comedian and TV star who has been married to her partner, actress Portia de Rossi, since 2008. Ellen is a well-known comedian who got her start after being named Funniest Person in America by Showtime in the 1980s."}, {"url": "http://www.richestnetworth.com/ellen-degeneres-net-worth/", "passage_text": "Ellen DeGeneres is an American comedian, actress, and TV personality with a net worth of $85 million and an annual salary of $45million. ... [read more]. "}, {"url": "http://www.cownetworth.com/ellen-degeneres-net-worth/", "passage_text": "2 comments. Ellen Degeneres is the stunning actress who hails from America to capture the whole world in her hand with her sizzling performance. She is even admired as a rocking and hilarious comedian and TV presenter who came into spot light for different shows such as Oprah Winfrey Show, TGI Friday, and many more"}]