[{"url": "https://www.verizon.com/support/residential/internet/fiosinternet/networking/troubleshooting/dlink624/130259.htm", "passage_text": "What are the default user name and password for my D-Link DI-624 router? The default user name for the D-Link DI-624 wireless router is admin, and the Password field should be left blank.The user name and password are both case-sensitive, so be sure to enter the user name in lower case. SolutionDesc2=17073; Contact Us. N N N N N N N N 29176 c29176."}, {"url": "http://blog.dlink.com/what-to-do-if-you-forget-your-network-passwords-2/", "passage_text": "Resetting your D-Link® router’s Wi-Fi password is easy: 1  Type your router’s IP address — 192.168.0.1 — into your Web browser. 2  At the login screen, select “Admin” from the drop down menu and enter your admin password. 3  Once you access the Web configuration screen, click “Setup” in the top menu. 1 Type your router’s IP address — 192.168.0.1 — into your Web browser. 2  At the login screen, select “Admin” from the drop down menu and enter your admin password. 3  Once you access the Web configuration screen, click “Setup” in the top menu."}, {"url": "http://www.ehow.com/how_7353264_password-d_link.html", "passage_text": "Type 192.168.0.1 into your address bar. This is the default internet protocol address for most home broadband routers, such as the D-Link router. This address will allow you access into your router's configurations. Enter admin as the user ID and leave the password field blank when directed to log in. Enter 192.168.0.1 into your address bar. Log in to your router using admin as the user ID and leave the password field blank. Click the Tools tab located at the top of the page. A page titled Admin will pop up."}, {"url": "http://www.ehow.com/how_7353264_password-d_link.html", "passage_text": "Resetting your D-Link Router. Power on the D-Link router. Locate the small toothpick sized hole on the back of your D-Link router, usually found to the left of the power jack. This hole contains a small button. Press down on the button using a toothpick (or an object of equal size). Enter 192.168.0.1 into your address bar. Log in to your router using admin as the user ID and leave the password field blank. Click the Tools tab located at the top of the page. A page titled Admin will pop up."}, {"url": "http://forums.dlink.com/index.php?topic=40701.0", "passage_text": "Open a browser and type in 192.168.0.1. You'll need the password to log in if you have that. If you don't then you'll need to do a factory reset of the router which will clear all passwords and set everything back to defaults which will have no passwords on the admin log in or the WiFi. "}, {"url": "http://smallbusiness.chron.com/reset-dlink-administrator-password-51323.html", "passage_text": "1 If you saved your router's configuration to a file, you can use this file to quickly restore the settings after resetting the admin password. 2  To make the file, go to the D-Link router settings page, then click Tools, System and Save Configuration.. Step 3. Click Setup at the top of the page. Click Wireless Settings on the left side of the page. Step 4. Click Manual Wireless Connection Setup.. Scroll down to find the Pre-Shared Key field. Step 5. Type a new Wi-Fi password in the Pre-Shared Key field. Close the window to save the new password."}, {"url": "http://blog.dlink.com/what-to-do-if-you-forget-your-network-passwords-2/", "passage_text": "1 At the login screen, select “Admin” from the drop down menu and enter your admin password. 2  Once you access the Web configuration screen, click “Setup” in the top menu. 3  Select the “Wireless Settings” link on the left-hand side. 4  From there, click on the “Manual Wireless Connection Setup” button. 1 Type your router’s IP address — 192.168.0.1 — into your Web browser. 2  At the login screen, select “Admin” from the drop down menu and enter your admin password. 3  Once you access the Web configuration screen, click “Setup” in the top menu."}, {"url": "http://blog.dlink.com/what-to-do-if-you-forget-your-network-passwords-2/", "passage_text": "1 Select the “Wireless Settings” link on the left-hand side. 2  From there, click on the “Manual Wireless Connection Setup” button. 3  Scroll down to the field representing my “Pre-Shared Key”. 4  If you don’t see it, select a security mode from the dropdown menu at the bottom of the screen first. 5  Type in a new password. 1 Type your router’s IP address — 192.168.0.1 — into your Web browser. 2  At the login screen, select “Admin” from the drop down menu and enter your admin password. 3  Once you access the Web configuration screen, click “Setup” in the top menu."}, {"url": "http://www.ehow.com/how_7353264_password-d_link.html", "passage_text": "Securing Your D-Link Router. Enter 192.168.0.1 into your address bar. Log in to your router using admin as the user ID and leave the password field blank. Click the Tools tab located at the top of the page. A page titled Admin will pop up."}]