[{"url": "http://www.bbc.com/news/health-26449497", "passage_text": "People will be advised to halve the amount of sugar in their diet, under new World Health Organization guidance. The recommended sugar intake will stay at below 10% of total calorie intake a day, with 5% the target, says the WHO. The suggested limits apply to all sugars added to food, as well as sugar naturally present in honey, syrups, fruit juices and fruit concentrates. "}, {"url": "http://www.cbsnews.com/news/world-health-organization-lowers-sugar-intake-recommendations/", "passage_text": "The World Health Organization is dropping its sugar intake recommendations from 10 percent of your daily calorie intake to 5 percent. For an adult of a normal body mass index (BMI), that works out to about 6 teaspoons -- or 25 grams -- of sugar per day. Many people don't realize much of the sugar they take in are hidden in processed foods, according to WHO. A can of soda may contain up to 10 teaspoons or 40 grams of sugar. They were opened up for public comment through March 31, 2014. The American Heart Association recommends limiting sugar intake to no more than half of your daily discretionary calorie allowance: No more than 100 calories per day for women (about 6 teaspoons) and no more than 150 calories per day for men (9 teaspoons)."}, {"url": "http://www.livestrong.com/article/474832-recommended-grams-of-sugar-per-day/", "passage_text": "This means that there is no minimum amount you need to take in each day, but there is a maximum. These recommendations are based on gender. Women should limit sugar intake to no more than 6 teaspoons per day, which provides about 100 calories. Men should limit sugar intake to no more than 9 teaspoons, or about 150 calories. In contrast, the average adult consumes 22 teaspoons per day. This is equal to about 3,550 pounds of sugar in a lifetime. The consumption of added sugar accounts for an intake of 500 calories per day, which can cause a weight gain of 1 pound per week."}, {"url": "http://www.livestrong.com/article/474832-recommended-grams-of-sugar-per-day/", "passage_text": "The average American consumes 3 pounds of sugar a week and 130 pounds a year, reports Forbes.com. This is equal to about 3,550 pounds of sugar in a lifetime. The consumption of added sugar accounts for an intake of 500 calories per day, which can cause a weight gain of 1 pound per week."}, {"url": "http://answers.webmd.com/answers/5008459/how-many-grams-of-sugar-per-day", "passage_text": "For example, the World Health Organization recommends keeping added sugar intake to 10% of total calories. For the average 2000 calorie-diet that's a maximum of 50 grams. The American Heart Association recommends 6 teaspoons of sugar for women and 9 for men (1 teaspoon of sugar has about 4g of sugar). The primary source of added sugars are soft drinks and other sugar-sweetened beverag"}, {"url": "http://who.int/mediacentre/news/releases/2015/sugar-guideline/en/", "passage_text": "4 March 2015 ¦ Geneva-A new WHO guideline recommends adults and children reduce their daily intake of free sugars to less than 10% of their total energy intake. A further reduction to below 5% or roughly 25 grams (6 teaspoons) per day would provide additional health benefits. Reducing free sugars intake to less than 10% of total daily energy intake was recommended by the WHO Study Group for the first time in 1989 and was further elaborated by a joint WHO/FAO Expert Consultation in 2002."}, {"url": "http://www.livestrong.com/article/363283-recommended-daily-allowance-of-sugar/", "passage_text": "Fruit has naturally occuring sugars. Photo Credit Purestock/Purestock/Getty Images. The American Heart Association recommends men limit added sugar to 36 grams, or 9 teaspoons, per day. Women should limit added sugar to 24 grams, or 6 teaspoons, each day. "}, {"url": "http://www.today.com/health/4-rules-added-sugars-how-calculate-your-daily-limit-t34731", "passage_text": "For a person consuming 2000 calories, this is about 200 calories per day (or 50 grams and about 12 teaspoons a day). Here's how to translate from calories to grams to teaspoons. Use the divide by 4 rule of simple sugar math. Take the calories and divide by 4 to get the grams of added sugar. When it comes to added sugars in the diet, here's the bottom line: For 2000 calories per day, 50 grams of added sugars, about 12 teaspoons. Start with your calories, and use the first 3 numbers for the 10 percent added sugar goal (1,500 daily calories is 150; 2,400 daily calories is 240)."}, {"url": "http://www.everydayhealth.com/columns/jackie-arnett-green-plate-special/lets-talk-about-how-much-sugar-you-eat-prediabetes/", "passage_text": "The recommended sugar intake for adult women is 22 grams of sugar per day, for adult men, it’s 36 grams daily, and for children, it’s 12 grams a day. "}]