[{"url": "http://www.uofmhealth.org/health-library/abp6943", "passage_text": "That's because it can cause loss of vision and may lead to a stroke or mini-strokes. Some people who have giant cell arteritis also have polymyalgia rheumatica. This is another inflammatory condition that affects the muscles. It causes pain and stiffness in the hip, neck, or shoulder area. "}, {"url": "http://www.mayoclinic.org/diseases-conditions/vasculitis/basics/symptoms/CON-20026049", "passage_text": "Giant cell arteritis. This condition is an inflammation of the arteries in your head, especially at the temples. It usually occurs in people over age 50. Giant cell arteritis can cause headaches, scalp tenderness, jaw pain, blurred or double vision, and even blindness. It is also called temporal arteritis. Giant cell arteritis is linked to polymyalgia rheumatica, which causes pain and stiffness in muscles of the neck, shoulders, hips and thighs. "}, {"url": "http://www.hopkinsvasculitis.org/types-vasculitis/giant-cell-arteritis/", "passage_text": "Giant cell arteritis is vasculitis of unknown cause that affects the elderly and is characterized by panarteritis of medium-to large-sized arteries, especially in the extracranial branches of the carotid artery. The average age of onset is 72 years, and women are affected two times as often as men. Giant cell arteritis can begin suddenly or gradually with nonspecific symptoms such as malaise, weight loss, depression, and fatigue or with the classic symptoms of headache, scalp tenderness, jaw claudication, visual changes, or polymyalgia rheumatica."}, {"url": "http://www.nhlbi.nih.gov/health/health-topics/topics/vas/types", "passage_text": "Giant Cell Arteritis. Giant cell arteritis (ar-ter-I-tis) usually affects the temporal artery, an artery on the side of your head. This condition also is called temporal arteritis. Symptoms of this condition can include headaches, scalp tenderness, jaw pain, blurred vision, double vision, and acute (sudden) vision loss. Giant cell arteritis is the most common form of vasculitis in adults older than 50."}, {"url": "http://www.dreddyclinic.com/findinformation/aa/giantcellarteritis.htm", "passage_text": "Giant cell arteritis (GCA) is an inflammation of the lining of your arteries-the blood vessels that carry oxygen-rich blood from your heart to the rest of your body. Although GCA can affect the arteries in your neck, upper body and arms, it occurs most often in the arteries in the head, especially the temples. Giant cell arteritis is a condition which causes inflammation on the inside of some arteries (blood vessels). It is called 'giant cell' because typical large cells develop in the wall of the inflamed arteries."}, {"url": "http://www.hopkinsvasculitis.org/types-vasculitis/giant-cell-arteritis/", "passage_text": "Patients with polymyalgia rheumatica but no symptoms of giant cell arteritis above the neck (such as jaw claudication, headache and visual symptoms) do not need temporal artery biopsy and respond to low–dose prednisone (10 to 20 mg/d orally). Giant cell arteritis can begin suddenly or gradually with nonspecific symptoms such as malaise, weight loss, depression, and fatigue or with the classic symptoms of headache, scalp tenderness, jaw claudication, visual changes, or polymyalgia rheumatica."}, {"url": "http://www.webmd.com/heart/tc/giant-cell-arteritis-topic-overview", "passage_text": "Because it often affects the artery in the temple, it is also called temporal arteritis. People who have giant cell arteritis need to be treated right away. That's because it can cause loss of vision and may lead to a stroke or mini-strokes. Some people who have giant cell arteritis also have polymyalgia rheumatica. This is another inflammatory condition that affects the muscles. It causes pain and stiffness in the hip, neck, or shoulder area"}, {"url": "http://www.aafp.org/afp/2013/1115/p676-s1.html", "passage_text": "Giant cell arteritis (ar-ter-EYE-tiss), or GCA, is a condition in which one or more of your arteries (the blood vessels that carry blood and oxygen from your heart to the rest of your body) become inflamed on the inside. It makes it harder for blood to flow to some parts of your body. "}, {"url": "http://my.clevelandclinic.org/services/orthopaedics-rheumatology/diseases-conditions/hic-polymyalgia-rheumatica", "passage_text": "Polymyalgia rheumatica (PMR) and giant cell arteritis (GCA) frequently affect the same types of people. The diseases may occur independently or in the same patient, either together or at different times. "}]