[{"url": "https://en.wikipedia.org/wiki/Magnet", "passage_text": "To demagnetize a saturated magnet, a certain magnetic field must be applied, and this threshold depends on coercivity of the respective material. Hard materials have high coercivity, whereas soft materials have low coercivity. Materials that can be magnetized, which are also the ones that are strongly attracted to a magnet, are called ferromagnetic (or ferrimagnetic). These include iron, nickel, cobalt, some alloys of rare earth metals, and some naturally occurring minerals such as lodestone."}, {"url": "http://www.thefreedictionary.com/magnetic", "passage_text": "1. magnetic-of or relating to or caused by magnetism; magnetic forces. 2. magnetic-having the properties of a magnet; i.e. of attracting iron or steel; the hard disk is covered with a thin coat of magnetic material. mag·net·ic. adj. 1. a. Of or relating to magnetism or magnets. b. Having the properties of a magnet. c. Capable of being magnetized or attracted by a magnet. d. Operating by means of magnetism: a magnetic recorder. 2"}, {"url": "http://www.thefreedictionary.com/magnet", "passage_text": "mag·net. n. 1. An object that is surrounded by a magnetic field and that has the property, either natural or induced, of attracting iron or steel. 2. An electromagnet. 3. A person, a place, an object, or a situation that exerts attraction: a village that is a magnet for tourists. "}, {"url": "http://www.thefreedictionary.com/magnetic", "passage_text": "1. of or pertaining to a magnet or magnetism. 2. having the properties of a magnet. 3. capable of being magnetized or attracted by a magnet. 4. of, pertaining to, or being a medium created with magnetically sensitive material for storing electronic data, as a magnetic card or disk. mag·net·ic. adj. 1. a. Of or relating to magnetism or magnets. b. Having the properties of a magnet. c. Capable of being magnetized or attracted by a magnet. d. Operating by means of magnetism: a magnetic recorder. 2"}, {"url": "http://www.definitions.net/definition/Magnet", "passage_text": "Magnet. A magnet is a material or object that produces a magnetic field. This magnetic field is invisible but is responsible for the most notable property of a magnet: a force that pulls on other ferromagnetic materials, such as iron, and attracts or repels other magnets. Princeton's WordNet (5.00 / 1 vote) Rate this definition: magnet (noun). (physics) a device that attracts iron and produces a magnetic field. attraction, attractor, attracter, attractive feature, magnet (noun). a characteristic that provides pleasure and attracts. flowers are an attractor for bees."}, {"url": "http://www.ehow.com/info_8119535_hard-soft-magnets.html", "passage_text": "Hard magnets are permanent magnets that do not require electricity to retain their magnetism and are not easily demagnetized. They are magnetically charged naturally or artificially in production and maintain a magnetic field. Hard magnets are in use all around the modern home and are part of our daily lives. "}, {"url": "http://saravanamoorthy-physics.blogspot.com/2011/04/differences-between-hard-and-soft.html", "passage_text": "Hard Magnetic Materials. Soft Magnetic Materials. 1. Materials which retain their magnetism and are difficult to demagnetize are called hard magnetic materials. These materials retain their magnetism even after the removal of the applied magnetic field. Hence these materials are used for making permanent magnets. In permanent magnets the movement of the domain wall is prevented. They are prepared by heating the magnetic materials to the required temperature and then quenching them. Impurities increase the strength of hard magnetic materials. Soft magnetic materials are easy to magnetize and demagnetize. These materials are used for making temporary magnets. The domain wall movement is easy. Hence they are easy to magnetize. By annealing the cold worked material, the dislocation density is reduced and the domain wall movement is made easier"}, {"url": "https://en.wikipedia.org/wiki/Magnet", "passage_text": "An electromagnet is made from a coil of wire that acts as a magnet when an electric current passes through it but stops being a magnet when the current stops. Often, the coil is wrapped around a core of soft ferromagnetic material such as steel, which greatly enhances the magnetic field produced by the coil. The overall strength of a magnet is measured by its magnetic moment or, alternatively, the total magnetic flux it produces. Materials that can be magnetized, which are also the ones that are strongly attracted to a magnet, are called ferromagnetic (or ferrimagnetic). These include iron, nickel, cobalt, some alloys of rare earth metals, and some naturally occurring minerals such as lodestone."}]