[{"url": "https://en.wikipedia.org/wiki/Symbiodinium", "passage_text": "These unicellular algal protists commonly reside in the endoderm of tropical cnidarians such as corals, sea anemones, and jellyfish, where the products of their photosynthetic processing are exchanged in the host for inorganic molecules. The life stages of dinoflagellates in the genus Symbiodinium. (A) Electron micrographs of a Symbiodinium mastigote (motile cell) with characteristic gymnodinioid morphology (S. natans; Hansen & Daugbjerg 2009) and (B) the coccoid cell in hospite."}, {"url": "http://www.merriam-webster.com/dictionary/zooxanthella", "passage_text": "Definition of ZOOXANTHELLA. : any of various symbiotic dinoflagellates that live within the cells of other organisms (as reef-building coral polyps). ADVERTISEMENT."}, {"url": "http://www.oxforddictionaries.com/definition/english/zooxanthella", "passage_text": "Example sentences. 1  The plants are tiny single-celled algae, the zooxanthellae or symbiotic dinoflagellates, that live within the tissues of corals in great numbers. 1 It is not known whether rugose corals had symbiotic photosymbiotic zooxanthellae as modern corals do. 2  The zooxanthellae in these corals are dinoflagellates, and it is suspected that there may be a relationship between their diversifications."}, {"url": "https://en.wikipedia.org/wiki/Dinoflagellate", "passage_text": "The dinoflagellates (Greek δῖνος dinos whirling and Latin flagellum whip, scourge) are a large group of flagellate protists that constitute the phylum Dinoflagellata. Most are marine plankton, but they are common in fresh water habitats as well. Some species are endosymbionts of marine animals and play an important part in the biology of coral reefs. Other dinoflagellates are colorless predators on other protozoa, and a few forms are parasitic (see for example Oodinium, Pfiesteria). Some dinoflagellates produce resting stages, called dinoflagellate cysts or dinocysts, as part of their life cycles. Dinoflagellates are considered to be protists, with their own division, Dinoflagellata"}, {"url": "https://en.wikipedia.org/wiki/Symbiodinium", "passage_text": "Symbiodinium are colloquially called  zooxanthellae  (or  zoox ), and animals symbiotic with algae in this genus are said to be zooxanthellate. The term was loosely used to refer to any golden-brown endosymbionts, including diatoms and other dinoflagellates. The life stages of dinoflagellates in the genus Symbiodinium. (A) Electron micrographs of a Symbiodinium mastigote (motile cell) with characteristic gymnodinioid morphology (S. natans; Hansen & Daugbjerg 2009) and (B) the coccoid cell in hospite."}, {"url": "https://en.wikipedia.org/wiki/Dinoflagellate", "passage_text": "Their populations are distributed depending on temperature, salinity, or depth. Many dinoflagellates are known to be photosynthetic, but a large fraction of these are in fact mixotrophic, combining photosynthesis with ingestion of prey (phagotrophy). Some species are endosymbionts of marine animals and play an important part in the biology of coral reefs. Other dinoflagellates are colorless predators on other protozoa, and a few forms are parasitic (see for example Oodinium, Pfiesteria). Some dinoflagellates produce resting stages, called dinoflagellate cysts or dinocysts, as part of their life cycles. Dinoflagellates are considered to be protists, with their own division, Dinoflagellata"}, {"url": "https://en.wikipedia.org/wiki/Symbiodinium", "passage_text": "Generally, these dinoflagellates enter the host cell through phagocytosis, persist as intracellular symbionts, reproduce, and disperse to the environment. The exception is in most mollusks, where Symbiodinium are intercellular (between the cells). The life stages of dinoflagellates in the genus Symbiodinium. (A) Electron micrographs of a Symbiodinium mastigote (motile cell) with characteristic gymnodinioid morphology (S. natans; Hansen & Daugbjerg 2009) and (B) the coccoid cell in hospite."}, {"url": "http://www.oxforddictionaries.com/definition/english/zooxanthella", "passage_text": "1 The plants are tiny single-celled algae, the zooxanthellae or symbiotic dinoflagellates, that live within the tissues of corals in great numbers. 2  It is not known whether rugose corals had symbiotic photosymbiotic zooxanthellae as modern corals do. 1 It is not known whether rugose corals had symbiotic photosymbiotic zooxanthellae as modern corals do. 2  The zooxanthellae in these corals are dinoflagellates, and it is suspected that there may be a relationship between their diversifications."}, {"url": "http://ag.arizona.edu/azaqua/algaeclass/symbios.htm", "passage_text": "INTRODUCTION. The relationship between cnidarians and dinoflagellate algae is termed as symbiotic, because both the animal host and the algae are benefiting from the association. It is a mutualistic interaction. For some cnidarian species, it has been studied whether or not they could even survive without the dinoflagellate algae. Before discussing the different advantages between the symbiosis of cnidarians and dinoflagellate algae, a brief overview of dinoflagellate characteristics must first be presented. Dinoflagellate algae make up the division Pyrrophyta."}]