[{"url": "http://www.glutenfreefaces.com/forum/topics/a-review-of-olive-garden-gf", "passage_text": "hello, i work at the olive garden and the gluten free pasta is wonderful when ordered with extra sauce and i like to add extra vegetables on top such as asparagus, garlic, and squash. "}, {"url": "http://celiac-disease.com/olive-garden-gluten-free/", "passage_text": "Olive Garden has been serving gluten-free food for a while now. They’ve recently added some new gluten-free dishes, including a new pasta dish. If you have seen the new Olive Garden commercial, you may have heard “gluten-free” mentioned during the spot. The gluten-free menu includes steak, salmon, chicken and even a penne pasta dish for kids. "}, {"url": "http://gfcfcoaching.blogspot.com/2012/03/olive-garden-restaurant-review.html", "passage_text": "I decided to combine a needed trip to the Great Mall in Milpitas with a review of the Olive Garden. They have a full gluten free menu which includes Penne Rigate Pomodoro, Penne Rigate Marinara, Steak Toscano, Herb Grilled Salmon and Mixed Grill (steak and chicken). "}, {"url": "http://celiac-disease.com/olive-garden-gluten-free-restaurant-menu/", "passage_text": "I found out yesterday about Olive Garden having a Gluten-Free Pasta Dish, so I happily went there today to try it out. All I can say is that it is awful!!! It seemed like Dry Penne with a couple tablespoons of old tomato paste. Now, even those with gluten intolerance can feel a part of the experience! Apparently Olive Garden has prepared a number of their specialty dishes without gluten and posted a gluten free menu on their website."}, {"url": "http://www.glutenfibrofree.com/restaurants-2/eating-gluten-free-at-olive-garden/", "passage_text": "While Olive Garden only has 7 items on their gluten-free menu, only one of which is a pasta dish, there are still a couple more that I would like to try. I chose to avoid the pasta dish tonight since I had read the bad review before. The waiter was very nice and brought me a separate salad bowl without croutons. With pasta being their thing, you might expect a lot of options, but that is not the case. Expect to have a few good options and have an enjoyable experience with your family. I applaud Olive Garden for being one of the first restaurants to offer a gluten-free menu."}, {"url": "http://healthyeating.sfgate.com/olive-garden-gluten-menu-6880.html", "passage_text": "Olive Garden Options. The bulk of the Olive Garden menu entrees include pasta, which is made from wheat flour, but there are a few options that don't contain gluten. Have a garden fresh salad or a Caesar salad without the croutons. Before you change your mind, Olive Garden does offer a limited gluten-free menu. Make sure to tell your server that you can't have gluten when you're ordering to be sure every precaution is taken to ensure the safety of your meal."}, {"url": "http://healthyeating.sfgate.com/olive-garden-gluten-menu-6880.html", "passage_text": "Olive Garden is a chain restaurant that serves a variety of Italian entrees, most of which feature pasta. Because pasta is made with flour, they have gluten in them, which might leave you wondering if you should skip Olive Garden and head somewhere else to eat. Before you change your mind, Olive Garden does offer a limited gluten-free menu. Make sure to tell your server that you can't have gluten when you're ordering to be sure every precaution is taken to ensure the safety of your meal."}, {"url": "http://celiac-disease.com/olive-garden-gluten-free-restaurant-menu/", "passage_text": "I ate at an Olive Garden in Virginia, and since this article was posted they have added a pasta dish (Pennine Rigate with Marinara) which was very good, except that the edges didn’t have any sauce on it. However I do plan to go there again sometime regardless. For eating out gluten free is was very good. Now, even those with gluten intolerance can feel a part of the experience! Apparently Olive Garden has prepared a number of their specialty dishes without gluten and posted a gluten free menu on their website."}, {"url": "http://healthyeating.sfgate.com/olive-garden-gluten-menu-6880.html", "passage_text": "Olive Garden offers gluten-free penne pasta in dishes called Penne Rigate Pomodoro or Penne Regate with Marinara. A chicken or mixed grill platter comes with meat, broccoli and grilled vegetables and doesn't contain any gluten. The steak Toscano and the herb-grilled salmon entrees are also gluten-free. Before you change your mind, Olive Garden does offer a limited gluten-free menu. Make sure to tell your server that you can't have gluten when you're ordering to be sure every precaution is taken to ensure the safety of your meal."}]