[{"url": "http://medical-dictionary.thefreedictionary.com/Thiamine+deficiency", "passage_text": "Definition. Beriberi is a disease caused by a deficiency of thiamine (vitamin B 1) that affects many systems of the body, including the muscles, heart, nerves, and digestive system. Beriberi literally means I can't, I can't in Singhalese, which reflects the crippling effect it has on its victims. "}, {"url": "http://www.healthline.com/health/beriberi", "passage_text": "To prevent beriberi, eat a healthy, balanced diet that emphasizes foods rich in thiamine. Pregnant and nursing mothers should be check regularly for any vitamin deficiencies Infant formulas should also be checked for adequate thiamine. Anyone who abuses alcohol should be checked for Vitamin-B deficiencies. Yet, if you have access to foods rich in Vitamin B-1, your chances of developing beriberi are low. Meat, dairy products, and whole grains are all excellent sources of Vitamin B-1 that can prevent you from getting the disease."}, {"url": "http://www.healthline.com/health/beriberi", "passage_text": "Overview. Beriberi is a disease brought on by a Vitamin B-1 (thiamine) deficiency. There are two types of the disease: wet beriberi and dry beriberi. Wet beriberi can effect heart function and, in the most extreme cases, heart failure. Yet, if you have access to foods rich in Vitamin B-1, your chances of developing beriberi are low. Meat, dairy products, and whole grains are all excellent sources of Vitamin B-1 that can prevent you from getting the disease."}, {"url": "http://www.healthizen.com/diet-nutrition/Prevention-of-Beriberi.aspx", "passage_text": "A deficiency of thiamine or vitamin B1 is known to cause beriberi. A person suffering from this disease feels lethargic and fatigued all the time. "}, {"url": "http://medical-dictionary.thefreedictionary.com/beriberi", "passage_text": "Beriberi. Beriberi is a disease caused by a deficiency of thiamine (vitamin B 1) that affects many systems of the body, including the muscles, heart, nerves, and digestive system. Beriberi literally means I can't, I can't in Singhalese, which reflects the crippling effect it has on its victims. Cerebral beriberi, also known as Wernicke-Korsakoff syndrome, usually occurs in chronic alcoholics and affects the central nervous system (brain and spinal cord). It can be caused by a situation that aggravates a chronic thiamine deficiency, like an alcoholic binge or severe vomiting."}, {"url": "http://allnutriments.blogspot.com/2009/09/disease-of-b1-deficiency-beriberi.html", "passage_text": "Beriberi disease is a disease caused by vitamin B1(thiamine) deficiency. Primary cause of the disease is malnutrition in the form of reduced intake of essential nutrients by the economically weaker sections of the society. Beriberi disease also occurs in populations who take polished white rice as main staple food. A balanced diet consisting of both animal and plant sources of food can prevent not only vitamin B1 deficiency caused disease like beriberi, but also all types of vitamin deficiency caused diseases. We should use whole cereals and whole wheat flour, as sufficient thiamin can be obtained from them."}, {"url": "http://medical-dictionary.thefreedictionary.com/beriberi", "passage_text": "A balanced diet containing all essential nutrients will prevent a thiamine deficiency and the development of beriberi. People who consume large quantities of junk food like soda, pretzels, chips, candy, and high carbohydrate foods made with unenriched flours may be deficient in thiamine and other vital nutrients. Cerebral beriberi, also known as Wernicke-Korsakoff syndrome, usually occurs in chronic alcoholics and affects the central nervous system (brain and spinal cord). It can be caused by a situation that aggravates a chronic thiamine deficiency, like an alcoholic binge or severe vomiting."}, {"url": "http://www.moondragon.org/health/disorders/beriberi.html", "passage_text": "BERIBERI DESCRIPTION. B-VITAMIN NUTRITIONAL DEFICIENCY Beriberi is a disease caused by a deficiency of the B vitamins, particularly Vitamin B-1 (Thiamine) that affects many systems of the body, including the muscles, heart, nerves, and digestive system. "}, {"url": "http://www.healthgrades.com/conditions/beriberi", "passage_text": "Beriberi is a disease caused by a lack of vitamin B1 (thiamine) in the body. Although beriberi can occur in anyone who is poorly nourished, it is very rare in the United States due to the addition of vitamins to many of the foods we eat. Beriberi generally affects the cardiovascular system (known as wet beriberi) or the nervous system (known as dry beriberi). Wernicke-Korsakoff syndrome is a brain disorder caused by thiamine deficiency that results in a number of neurologic symptoms and can lead to psychosis, confusion and hallucinations."}, {"url": "http://www.nytimes.com/health/guides/disease/beriberi/overview.html", "passage_text": "Back to Top Prevention. Eating a proper diet that is rich in thiamine and other vitamins will prevent beriberi. Nursing mothers should make sure that their diet contains all vitamins and be sure that infant formulas contain thiamine. "}]