[{"url": "http://www.costowl.com/home-improvement/bathroom-shower-replacement-cost.html", "passage_text": "New Shower Costs. The actual cost of a new shower depends on your location, the materials used, the complexity of the installation, and other factors. 1  A basic shower enclosure may cost as little as $400 to $600, while a combination bath/shower unit or a top-of-the-line surround could cost $1,500 to $3,000 or more. 1 A basic shower enclosure may cost as little as $400 to $600, while a combination bath/shower unit or a top-of-the-line surround could cost $1,500 to $3,000 or more. 2  A shower surround can be installed by a plumber for $150 to $300."}, {"url": "http://home.costhelper.com/bathroom-addition.html", "passage_text": "1 Adding new floor space to your home for a basic 6x8-foot bathroom addition starts around $25,000-$50,000 and goes up depending on complexity, quality of fixtures, number of amenities and local labor rates. Comments (4). A bathroom addition can range from a small half-bath (sink, toilet and mirror) to a spa-like master bath. Adding a bathroom is usually more expensive per square foot than other rooms because it requires specific types of plumbing, heating, electricity and ventilation. Typical costs:"}, {"url": "http://www.costowl.com/home-improvement/bathroom-shower-replacement-cost.html", "passage_text": "1 For tile shower installation, you’re probably looking at a minimum cost of at least $1,500, although intricate, labor-heavy designs and add-ons (such as new faucets and a tub) could easy bring the price up to $5,000 or more. 1 A basic shower enclosure may cost as little as $400 to $600, while a combination bath/shower unit or a top-of-the-line surround could cost $1,500 to $3,000 or more. 2  A shower surround can be installed by a plumber for $150 to $300."}, {"url": "http://home.costhelper.com/bathroom-addition.html", "passage_text": "1 However, costs can be $7,000-$25,000 or more for a more luxurious bathroom, or if the new bathroom is far from existing water and sewer lines. Comments (4). A bathroom addition can range from a small half-bath (sink, toilet and mirror) to a spa-like master bath. Adding a bathroom is usually more expensive per square foot than other rooms because it requires specific types of plumbing, heating, electricity and ventilation. Typical costs:"}, {"url": "http://www.victoriana.com/Bathroom/extra-bathroom.html", "passage_text": "3) Check floor joists when you add a bathroom: conventional fixtures weigh up to 20 pounds per square foot; tile in mortar up to 30 pounds. On spans over 11 feet, better double 2x8 joists on 16 inch centers. 4) How to add a bathroom to a small space? Have the door swing out, or install a sliding pocket door. Architects maintain that a second or third bathroom can be installed into almost any size home if you look carefully. Bath fixtures can be located in a much smaller area than you think. Into 25 square feet, you can fit a complete – if cramped – shower bathroom which would keep the cost to add an extra bathroom low."}, {"url": "http://www.victoriana.com/Bathroom/extra-bathroom.html", "passage_text": "According to the National Kitchen & Bath Association, the cost to add a master bath, averages at about $16,000 and up depending on the location of plumbing and electric; the level of the materials and fixtures; and whether you do it yourself or hire a professional remodeler. Architects maintain that a second or third bathroom can be installed into almost any size home if you look carefully. Bath fixtures can be located in a much smaller area than you think. Into 25 square feet, you can fit a complete – if cramped – shower bathroom which would keep the cost to add an extra bathroom low."}, {"url": "http://www.zillow.com/advice-thread/Can-anyone-give-me-a-cost-estimate-to-add-a-bathroom-and-250-300-sq-ft-addition/475386/", "passage_text": "Standard bathroom is 5'x8', that includes the depth of the tub. (40sqft). Cost on adding a bathroom depends if you have an existing room or if you will be adding a new roof to cover the new room. The latter is the most expensive as you will have framing costs (and permits and blueprints,etc) and could cost $10-$15k. "}, {"url": "http://www.remodelormove.com/articles/cost-to-add-a-bathroom/", "passage_text": "After careful review of your Cost to add a bathroom project where you Hire a contractor, do None of the work yourself and use Average cost materials, we estimate the cost will be between $10,500 and $12,100. We also estimate the payback (the amount your home will appreciate by doing the remodel) will be $800. "}, {"url": "http://thehousingforum.com/how-much-does-it-cost-to-add-on-a-bathroom/", "passage_text": "Tile. Depending on the type of tile you want, tile can eat away your bathroom budget rather quickly. Tiles range in price from under $1 per square to high-end tiles that can cost approximately $100 per square. Remember to use a type of tile that fits the rest of your home. If you enlist the assistance of a professional they will make sure your space meets code and will add labor charges to your renovation bill. More current figures give a median cost of bathroom additions a $15,000 bill."}, {"url": "http://www.costowl.com/home-improvement/bathroom-shower-replacement-cost.html", "passage_text": "1 The total cost for a new shower surround should average $1,200 to $2,000. 2  For tile shower installation, you’re probably looking at a minimum cost of at least $1,500, although intricate, labor-heavy designs and add-ons (such as new faucets and a tub) could easy bring the price up to $5,000 or more. 1 A basic shower enclosure may cost as little as $400 to $600, while a combination bath/shower unit or a top-of-the-line surround could cost $1,500 to $3,000 or more. 2  A shower surround can be installed by a plumber for $150 to $300."}]