[{"url": "http://www.healthguidance.org/entry/14582/1/How-Food-Allergies-Can-Affect-Your-Life.html", "passage_text": "When we think of food allergies, we often think of someone sitting at a restaurant and becoming suddenly unable to breathe after accidentally eating something he/she is allergic to. What we may not realize is that food allergies can affect our bodies in many other ways."}, {"url": "http://www.hopkinsmedicine.org/healthlibrary/conditions/allergy_and_asthma/allergies_and_the_immune_system_85,P00039/", "passage_text": "The organs involved with the immune system are called the lymphoid organs, which affect growth, development, and the release of lymphocytes (a certain type of white blood cell)."}, {"url": "https://www.sharecare.com/health/allergy/how-allergies-affect-body", "passage_text": "Because there are so many different types of allergies, they can affect the body in a variety of ways that range from merely annoying to life-threatening. Most often, allergies affect the skin, eyes, and respiratory system."}, {"url": "http://www.childrensdisabilities.info/allergies/allergies-allergicreactions.html", "passage_text": "Food allergies mostly affect the nervous, respiratory, gastrointestinal and skin areas. Allergic reaction can be caused by food additives and environmental chemicals such as chemical sprays, pesticides, hydrocarbons, tobacco smoke plus thousands of others. Allergies to certain foods are associated with certain symptoms."}, {"url": "http://www.everydayhealth.com/digestive-health/experts-how-do-food-allergies-affect-digestion.aspx", "passage_text": "Lisa Ganjhu, DO (wehealnewyork.org). Some of the most common food allergies are peanuts, milk, soy, shellfish, fish, nuts, and eggs. Some people can have very severe reactions to those foods if they are allergic. The digestive tract is the first line of contact to food, so it is where allergic reactions originate."}, {"url": "http://www.childrensdisabilities.info/allergies/allergies-allergicreactions.html", "passage_text": "The main organs that are affected are the brain, eyes, ears, nose, lungs, heart, skin, bowel, genoto-urinary system and musculo-skeletal system. The brain is the most sensitive of the bodys organs and is easily affected by allergies."}, {"url": "http://www.childrensdisabilities.info/allergies/allergies-allergicreactions.html", "passage_text": "Allergies and Allergic Reactions. Allergies and allergic reactions can affect your immune system. By: Stewart Hare. Allergies are disorders of the immune system, which when a foreign substance that is normally harmless in most people causes an extreme reaction within the body."}, {"url": "http://www.hopkinsmedicine.org/healthlibrary/conditions/allergy_and_asthma/allergies_and_the_immune_system_85,P00039/", "passage_text": "Allergies are disorders of the immune system. Most allergic reactions are a result of an immune system that responds to a false alarm.."}]