[{"url": "http://www.audioenglish.org/dictionary/hepatitis.htm", "passage_text": "Hypernyms (hepatitis is a kind of...): liver disease (a disease affecting the liver). infectious disease (a disease transmitted only by a specific kind of contact). Hyponyms (each of the following is a kind of hepatitis): "}, {"url": "http://medical-dictionary.thefreedictionary.com/hepatitis", "passage_text": "hepatitis C a viral disease caused by the hepatitis C virus, commonly occurring after transfusion or parenteral drug abuse; it frequently progresses to a chronic form that is usually asymptomatic but that may involve cirrhosis. cholangiolitic hepatitis cholestatic h. (1). n an inflammation of the liver. hepatitis C (Hep C, non-A, non-B hepatitis), n a type transmitted largely by blood transfusion or percutaneous inoculation, such as with in-travenous drug users sharing needles. The disease progresses to chronic hepatitis in up to 50% of the patients acutely infected."}, {"url": "http://www.answers.com/Q/What_does_hepatitis_mean", "passage_text": "1 Sexually Transmitted Diseases: Risk Factors for Hepatitis Hepatitis is a viral infection that causes inflammation of the liver. 2  Anyone is susceptible to hepatitis because of the various ways that it is transmitted. This form of hepatitis can become chronic, meaning you will have it with you either always or for a very long time. This is a dangerous disease in that it causes changes in the liver tissue. Some of these changes are scarring, bridging, and fatty deposits."}, {"url": "https://labtestsonline.org/understanding/analytes/hepatitis-panel/tab/test", "passage_text": "An acute viral hepatitis panel is used to help detect and/or diagnose acute liver infection and inflammation that is due to one of the three most common hepatitis viruses: hepatitis A virus (HAV), hepatitis B virus (HBV), or hepatitis C virus (HCV). "}, {"url": "http://www.mayoclinic.org/diseases-conditions/hepatitis-b/basics/definition/CON-20022210", "passage_text": "The liver. Hepatitis B is a serious liver infection caused by the hepatitis B virus (HBV). For some people, hepatitis B infection becomes chronic, meaning it lasts more than six months. "}, {"url": "http://www.cdc.gov/knowmorehepatitis/LearnMore.htm", "passage_text": "Hepatitis C is a serious liver disease that results from infection with the Hepatitis C virus. Hepatitis C has been called a silent epidemic because most people with Hepatitis C do not know they are infected. Hepatitis C is usually spread when blood from a person infected with the Hepatitis C virus enters the body of someone who is not infected. This can happen through multiple ways. Before widespread screening of the blood supply began in 1992, Hepatitis C was spread through blood transfusions and organ transplants"}, {"url": "http://www.audioenglish.org/dictionary/viral_hepatitis.htm", "passage_text": "Meaning: Hepatitis caused by a virus. Classified under: Nouns denoting stable states of affairs. Hypernyms (viral hepatitis is a kind of...): hepatitis (inflammation of the liver caused by a virus or a toxin). Hyponyms (each of the following is a kind of viral hepatitis): "}, {"url": "http://www.answers.com/Q/What_does_hepatitis_mean", "passage_text": "Hepatitis C is a blood borne infection of the liver. This means that you get it by blood to blood exposure. Unlike hepatitis B, it does not always come and go and leave no tra … ce behind. This form of hepatitis can become chronic, meaning you will have it with you either always or for a very long time. This is a dangerous disease in that it causes changes in the liver tissue. Some of these changes are scarring, bridging, and fatty deposits."}, {"url": "https://en.wikipedia.org/wiki/Hepatitis", "passage_text": "Hepatitis (plural: hepatitides) is a medical condition defined by the inflammation of the liver and characterized by the presence of inflammatory cells in the tissue of the organ. Hepatitis may occur with limited or no symptoms, but often leads to jaundice (a yellow discoloration of the skin, mucous membrane, and conjunctiva), poor appetite, and malaise. Hepatitis is acute when it lasts less than six months and chronic when it persists longer."}]