[{"url": "http://www.mottchildren.org/conditions-treatments/ped-heart/conditions/bicuspid-aortic-valve", "passage_text": "In bicuspid aortic valve (5), there are only 2 leaflets instead of three and the valve leaflets are often thickened. This can result in obstruction of blood flow across the valve, a condition called aortic stenosis and/or valve leakage, a condition called aortic valve regurgitation."}, {"url": "http://www.chd-uk.co.uk/types-of-chd-and-operations/bicuspid-aortic-valve/", "passage_text": "A bicuspid aortic valve is a heart condition that is usually due to a congenital deformity. A normal aortic valve has three cusps, whereas a bicuspid valve has only two. About 1-2% of the population have bicuspid aortic valves, although the condition is nearly twice as common in males."}, {"url": "http://www.heart-valve-surgery.com/bicuspid-aortic-valve-symptoms.php", "passage_text": "In the simplest terms, a bicuspid aortic valve (BAV) can be a serious heart valve disorder in which the valve only has two leaflets, or flaps, that control bloodflow through the heart. Like the tricuspid valve and the pulmonary valves, normal aortic valves have three tissue leaflets."}, {"url": "http://www.mottchildren.org/conditions-treatments/ped-heart/conditions/bicuspid-aortic-valve", "passage_text": "The aortic valve (1) is one of four valves in the normal heart. It sits between the left ventricle (2) and the aorta (3). Heart valves are thin flaps of tissue anchored in a fibrous ring. The normal aortic valve has 3 leaflets (4) that open to allow blood to move forward and close to prevent backward blood flow."}, {"url": "https://www.nlm.nih.gov/medlineplus/ency/article/007325.htm", "passage_text": "Causes. The aortic valve allows oxygen-rich blood to flow from the heart to the aorta. It prevents the blood from flowing back from the aorta into the heart when the pumping chamber relaxes. Bicuspid aortic valve is present at birth (congenital)."}, {"url": "http://www.cedars-sinai.edu/Patients/Health-Conditions/Bicuspid-Aortic-Disease.aspx", "passage_text": "Bicuspid aortic disease occurs when a defect is present in the valve that opens and shuts to allow blood flow from the heart through the aorta. While the defective valve may be easy to see, the defect also causes changes in the tissues of the aorta and the heart."}, {"url": "http://heartvalvedisease.nm.org/bicuspid-aortic-valve.html", "passage_text": "Bicuspid Aortic Valve. Bicuspid aortic valve (BAV) affects approximately one to two percent of people. It is the most common congenital heart disorder, impacting both the aortic valve (which controls the flow of blood into the aorta) and the thoracic aorta (the major vessel that sends blood throughout the body)."}, {"url": "http://bav.nm.org/what-is-bav.html", "passage_text": "The aortic valve controls the flow of blood from the heart to the aorta, and out to the body. Normally, the aortic valve has three leaflets that work to keep blood moving in one direction. With bicuspid aortic valve (BAV), two of the three leaflets of the aortic valve fuse during a person's fetal development."}, {"url": "https://www.nlm.nih.gov/medlineplus/ency/article/007325.htm", "passage_text": "A bicuspid aortic valve is an aortic valve that only has two leaflets, instead of three. The aortic valve regulates blood flow from the heart into the aorta, the major blood vessel that brings blood to the body."}]