[{"url": "http://www.perfectpaws.com/htrp.html", "passage_text": "However, the more time you spend with your puppy, the quicker he will be house trained. Your objective is to take your puppy to his toilet area every time he needs to eliminate. This should be about once every 30-45 minutes; just upon waking; just after eating or drinking; and just after a play session. Provide house training taxi service to avoid unnecessary mistakes"}, {"url": "http://dogcare.dailypuppy.com/old-before-puppy-fully-potty-trained-2576.html", "passage_text": "Most puppies have a good understanding of where they're supposed to potty after about a month of house-training. By the time she is 4 months old, your pup knows to wait for you to take her outside, and she might understand ways to tell you she has to go, such as barking or scratching at the door. Age to Start. Most puppies aren't able to control when they go until they are at least 12 weeks old. After she's about 6 weeks old, you can start taking her outside at least every hour to give her the chance to go. While this can cut down on indoor accidents, she won't be ready for true house-training until 12 weeks."}, {"url": "http://www.pets4homes.co.uk/pet-advice/puppy-toilet-training.html", "passage_text": "However, puppy toilet training should begin as soon as you get your new puppy home at the age of at least 8 weeks old. Reward your puppy with a treat or praise after they have been to the toilet, so that they build up positive associations with toilet training and the training and reward process. Never punish your puppy for inappropriate toileting, lack of understanding, or not always getting things right. Share. Share"}, {"url": "http://dogcare.dailypuppy.com/old-before-puppy-fully-potty-trained-2576.html", "passage_text": "Potty Pro. Many dogs are fully house-trained by 6 months old, but don't be discouraged if your pooch has accidents through 12 months old. Every dog is different, and some take a bit longer to make it to professional potty level. Age to Start. Most puppies aren't able to control when they go until they are at least 12 weeks old. After she's about 6 weeks old, you can start taking her outside at least every hour to give her the chance to go. While this can cut down on indoor accidents, she won't be ready for true house-training until 12 weeks."}, {"url": "http://www.thekennelclub.org.uk/getting-a-dog-or-puppy/general-advice-about-caring-for-your-new-puppy-or-dog/toilet-training-for-puppies/", "passage_text": "Toilet training for puppies: basic tips & techniques. How to toilet train your dog © Rebecca Newens. Toilet training your puppy should be quite a simple process, as long as you take the time and trouble to get into a good routine. Initially, you will have to build your routine around your puppy's needs, and these are reliably predictable when they are very young. How to toilet train your puppy: common errors. Unfortunately there are many reasons why 'toilet training' might not go as smoothly as it could, so make sure you do not make any of the following mistakes: 1  Over-feeding. 2  Feeding an unsuitable diet or giving a variety of foods."}]