[{"url": "http://www.ehow.com/info_12136339_much-cost-build-basement-within-existing-home.html", "passage_text": "Overall Cost. The overall cost of constructing a basement under an existing home will vary widely depending on a number of factors, including the size of the basement, the labor required, the materials and the paperwork required. Expect to pay no less than $30,000 to $50,000 to build yourself a basement. "}, {"url": "http://home.costhelper.com/basement.html", "passage_text": "1 In warmer climates where the foundation does not have to be as deep (typically 18-20 for a crawlspace or a few inches for a slab foundation), including a basement adds more to the total cost of the house because it requires a lot more additional excavation, far beyond what would be done without a basement. 1 Having a prefabricated safe room (a welded steel box, a steel skeleton with steel planks or a prefabricated unit that is bolted together on site) installed in a basement can cost $3,000-$20,000 or more, depending on materials and size."}, {"url": "http://home.costhelper.com/basement.html", "passage_text": "1 A finished basement typically includes all of that plus flooring, walls, ceilings, drywall, windows, and additional waterproofing and more in order to provide the desired living space. 2  Overall, a basement adds about 3-4 weeks to the new-house construction schedule. 1 Having a prefabricated safe room (a welded steel box, a steel skeleton with steel planks or a prefabricated unit that is bolted together on site) installed in a basement can cost $3,000-$20,000 or more, depending on materials and size."}, {"url": "http://www.thisoldhouse.com/toh/article/0,,1024509,00.html", "passage_text": "Although costs vary with the size and complexity of the project, remodeling an existing basement starts at about $20 per square foot, a fraction of what it costs to build an addition or enlarge second-floor space with. dormers. "}, {"url": "http://www.dbhousemovers.com/page/page/3985052.htm", "passage_text": "We will set the building on it's new foundation. Install a Basement under existing House. Our company can install a new basement under your existing house while you continue to live in the house. We will insert beams under your house, lift the house free of the foundation with our unified Sidewinder Jacking System. Excavate under the house keeping most all utilities hooked up. Install footers and block"}, {"url": "http://home.costhelper.com/basement.html", "passage_text": "1 Adding a basement to an existing house can cost $30,000-$70,000 or more, depending on the size of the existing crawlspace or half-basement or if the house is on a slab foundation, and how much of the work is do-it-yourself and how much is done by contractors. 1 Having a prefabricated safe room (a welded steel box, a steel skeleton with steel planks or a prefabricated unit that is bolted together on site) installed in a basement can cost $3,000-$20,000 or more, depending on materials and size."}, {"url": "http://www.klierstructuralmovers.com/basementaddsunderhouse.html", "passage_text": "Do you want more room in your home but are reluctant to take up valuable lawn, garden or play space? Why add on when you can add under? Adding a basement to an existing home is the most cost effective addition you can put on your house per square foot. "}, {"url": "http://www.ehow.com/info_8640040_much-cost-put-basement.html", "passage_text": "A basic basement costs only $20 or so per square foot to install once the excavation is complete, but it cannot be used for much except storage. Remodeling to add electrical, walls, floors and making the basement a room or rooms in the house can cost another $20 per square foot when all the costs are added. "}, {"url": "https://answers.yahoo.com/question/index?qid=20071201234920AAQANUZ", "passage_text": "Answers. Best Answer: Usually basements are dug before the house is built. Putting one now could cause the house to collapse. The 1st step is hire a good local engineer to look at the home and draw plans for the project. He will let you know whether the project is feasible or not. If it is, take the plans to several reputable local contractors who are licensed to do the work and get bids."}, {"url": "http://arch.designcommunity.com/viewtopic.php?f=7&t=2675", "passage_text": "New Basement under existing house. by JWmHarmon » Mon Nov 08, 2004 1:16 am. It is possible to build a new basement under an existing house. The house would have to be jacked up and have steel I-beams placed under the walls and floors. If your house is built on a slab you may have to build a temporary floor to hold the walls together"}]