[{"url": "http://www.blueplanetbiomes.org/rainforest.htm", "passage_text": "Plants Animals Climate Southeast Asian Rainforests The tropical rain forest is a forest of tall trees in a region of year-round warmth. An average of 50 to 260 inches (125 to 660 cm.) of rain falls yearly. Rain forests belong to the tropical wet climate group. A tropical rain forest has more kinds of trees than any other area in the world. Scientists have counted about 100 to 300 species in one 2 1/2-acre (1-hectare) area in South America. Seventy percent of the plants in the rainforest are trees. About 1/4 of all the medicines we use come from rainforest plants."}, {"url": "http://kids.nceas.ucsb.edu/biomes/rainforest.html", "passage_text": "LOCATION: There are two types of rainforest biomes: temperate and tropical rainforests. Temperate rainforests are found along coasts in temperate regions. The largest temperate rainforests are on the Pacific coast in North America, stretching from Alaska to Oregon. Other temperate rainforests are found along the coast of Chile, the United Kingdom, Norway, Japan, New Zealand, and S. Australia. Tropical rainforests are lush and warm all year long! Temperatures don’t even change much between night and day. The average temperature in tropical rainforests ranges from 70 to 85°F (21 to 30°C). The environment is pretty wet in tropical rainforests, maintaining a high humidity of 77% to 88% year-round."}, {"url": "https://php.radford.edu/~swoodwar/biomes/?page_id=100", "passage_text": "Tropical Rainforest. Introduction: The tropical rainforest is earth’s most complex biome in terms of both structure and species diversity. It occurs under optimal growing conditions: abundant precipitation and year round warmth. There is no annual rhythm to the forest; rather each species has evolved its own flowering and fruiting seasons"}, {"url": "http://www.blueplanetbiomes.org/rainforest.htm", "passage_text": "Tropical rainforests produce 40% of Earth's oxygen. A tropical rain forest has more kinds of trees than any other area in the world. Scientists have counted about 100 to 300 species in one 2 1/2-acre (1-hectare) area in South America. Seventy percent of the plants in the rainforest are trees. About 1/4 of all the medicines we use come from rainforest plants."}, {"url": "http://kids.nceas.ucsb.edu/biomes/rainforest.html", "passage_text": "Temperate rainforests are also wet, but not as rainy as tropical rainforests. It rains about from 60 - 200 inches (150 - 500 cm) each year, while the other moisture comes from the coastal fog that lingers on the trees. The fog provides about 7 - 12 inches (18 - 30°C) of rain each year. Tropical rainforests are lush and warm all year long! Temperatures don’t even change much between night and day. The average temperature in tropical rainforests ranges from 70 to 85°F (21 to 30°C). The environment is pretty wet in tropical rainforests, maintaining a high humidity of 77% to 88% year-round."}, {"url": "http://kids.nceas.ucsb.edu/biomes/rainforest.html", "passage_text": "Tropical rainforests can be found around the world: In Central and South America; in Western Africa, eastern Madagascar, and the Zaire basin; and in Indo-Malaysia along the west coast of India, Assam, Southeast Asia, New Guinea, and Queensland, Australia. Tropical rainforests are lush and warm all year long! Temperatures don’t even change much between night and day. The average temperature in tropical rainforests ranges from 70 to 85°F (21 to 30°C). The environment is pretty wet in tropical rainforests, maintaining a high humidity of 77% to 88% year-round."}, {"url": "http://www.blueplanetbiomes.org/rainforest.htm", "passage_text": "**** Rainforests by Michael G. 2001 In an average year the climate in a tropical rain forest is very humid because of all the rainfall. A tropical rainforest gets about 150 cm of rain per year. It gets lots of rain because it is very hot and wet in rain forests. The hotter the air, the more water vapor it can hold. A tropical rain forest has more kinds of trees than any other area in the world. Scientists have counted about 100 to 300 species in one 2 1/2-acre (1-hectare) area in South America. Seventy percent of the plants in the rainforest are trees. About 1/4 of all the medicines we use come from rainforest plants."}, {"url": "http://www.softschools.com/facts/biomes/tropical_rainforest_biome_facts/160/", "passage_text": "The tropical rainforest biome is an ecosystem that covers about 7% of the Earth’s surface. They are found all over the world but the majority of the tropical rainforest lies in South America in Brazil. The weather in the tropical rainforest is rainy yet pleasant all year round, day or night. Rainforests are extremely important because the water they produce is evaporated and then used as rain in other areas. The average temperature of the tropical rainforest remains between 70 and 85° F. The tropical rainforest is very rainy as its name implies. The rainfall can reach up to 400 inches in one year."}, {"url": "http://www.cotf.edu/ete/modules/msese/earthsysflr/rforest.html", "passage_text": "Tropical Rainforest The tropical rainforest is a hot, moist biome found near Earth's equator. The world's largest tropical rainforests are in South America, Africa, and Southeast Asia. Tropical rainforests receive from 60 to 160 inches of precipitation that is fairly evenly distributed throughout the year. "}]