[{"url": "https://www.irs.gov/retirement-plans/retirement-plans-for-self-employed-people", "passage_text": "You can put all your net earnings from self-employment in the plan: up to $12,000 in 2014 and $12,500 in 2015 (plus an additional $2,500 in 2014 and $3,000 in 2015 if you're 50 or older) in salary reduction contributions and either a 2% fixed contribution or a 3% matching contribution. Establish the plan: "}, {"url": "http://finance.zacks.com/roth-ira-vs-sep-selfemployed-3979.html", "passage_text": "Another advantage over a Roth IRA is the higher contribution limit. You may contribute as much as 25 percent of your annual income, up to $50,000 cap, in 2012. Because these contributions are made on a pretax basis, however, once you reach retirement age -- at least 59 1/2 -- you pay income tax on all distributions. If you are self-employed and have no other employees or high employee turnover, a SEP IRA may be a good solution for your retirement needs. A SEP allows you to make pretax contributions similar to a traditional IRA, which reduces your taxable income rather than after-tax contributions like a Roth IRA."}, {"url": "http://www.ehow.com/info_8125543_ira-same-sep.html", "passage_text": "You must have earned income, such as wages, before you can contribute to a traditional or Roth IRA. The amount of that earned income must be as much or greater than the amount you contribute. For instance, the 2011 limit for IRA contributions is $5,000, plus an extra $1,000 if you are 50 years of age or older. Traditional vs. Roth. If you have earned income, you can contribute to either a traditional or Roth IRA. With a traditional IRA, you get a tax deduction based on the amount of your contribution."}, {"url": "https://www.fidelity.com/retirement-ira/small-business/self-employed-401k/overview", "passage_text": "How a Self-Employed 401(k) contribution can add up. As you can see from the example below, for 2012 a self-employed business owner who is age 50 with $100,000 in compensation may save up to $20,500 more with a Self-Employed 401(k) than with a SEP-IRA or Profit Sharing Plan. "}, {"url": "http://www.rothira.org/roth-ira-for-self-employed.html", "passage_text": "Self-employed individuals have the option of opening either a traditional IRA, or a Roth version. The contributions you make to a traditional IRA are tax deductible every year, but you will have to pay the taxes on the income when you cash out the account during retirement. With a Roth IRA, you do not get tax deductibles for your annual contributions, but you do not have to pay the taxes upon cashing the money out. For most people, Roth IRAs save them more money in taxes overall, even though the initial contributions are not deductible"}, {"url": "http://finance.zacks.com/can-make-sep-ira-contribution-traditional-ira-contribution-same-year-4120.html", "passage_text": "SEP IRAs are often utilized by the self-employed, but anyone with a business can use this tax-advantaged retirement vehicle. You can contribute to both a SEP IRA and a traditional IRA in the same year, but there are some factors to consider. Contribution limits can vary based on whether you're the business owner, and different rules might apply depending on the plan's rules. SEP stands for Simplified Employee Pension"}, {"url": "http://finance.zacks.com/roth-ira-vs-sep-selfemployed-3979.html", "passage_text": "Roth IRA Contribution Basics. Self-employed investors may use a Roth IRA to help fund part of their retirement. The only requirements are that you -- and/or your spouse -- have earned income equal to your contributions, but your adjusted gross income must be under $125,000 if single or $183,000 if married. If you are self-employed and have no other employees or high employee turnover, a SEP IRA may be a good solution for your retirement needs. A SEP allows you to make pretax contributions similar to a traditional IRA, which reduces your taxable income rather than after-tax contributions like a Roth IRA."}, {"url": "http://budgeting.thenest.com/can-selfemployed-401k-roth-ira-26183.html", "passage_text": "Both Roth IRAs and self-employed 401(k)s offer tax-sheltered growth. If you’re self-employed, you can boost the amount you can stash away in qualified retirement plans by using both a Roth IRA and a self-employed 401(k). For the purposes of annual contribution limits, a self-employed 401(k) plan is treated the same as a 401(k) plan through an employer"}, {"url": "http://budgeting.thenest.com/can-selfemployed-401k-roth-ira-26183.html", "passage_text": "Maximum Contributions. Your contributions to a Roth IRA do not affect your ability to contribute to a self-employed 401(k) plan. For example, as of 2011, you can contribute up to $5,000 ($6,000 if you are 50 or older) to your Roth IRA and $50,000 ($55,500 if you are 50 or older) to your self-employed 401(k) plan. If you’re self-employed, you can boost the amount you can stash away in qualified retirement plans by using both a Roth IRA and a self-employed 401(k)."}, {"url": "http://www.wsj.com/articles/SB10001424052748704293604575342753455405696", "passage_text": "Clearly, it's a good thing that you can deduct contributions to a tax-deferred retirement plan set up for your self-employed business, such as a SEP. However, that doesn't necessarily mean such contributions are preferable to contributing the same amounts to a Roth IRA instead. "}]