[{"url": "http://www.worldatlas.com/as/sg/where-is-singapore.html", "passage_text": "Location of Singapore on a map. Singapore is the capital city of Singapore. It has a population of 3,547,809, and is located on a latitue of 1.29 and longitude of 103.85. Singapore is also the political center of Singapore, which is considered a Republic, and home to its Ceremonial head of state. The population of Singapore is 5,353,494 (2012) and the nation has a density of 7793 people per square kilometer. The currency of Singapore is the Singapore Dollar (SGD). As well, the people of Singapore are refered to as Singapore. The dialing code for the country is 65 and the top level internet domain for Singapore sites is .sg. Singapore does not share land borders with any countries"}, {"url": "http://www.mapsofworld.com/singapore/", "passage_text": "The year 1963 is an important year in the history of Singapore as the island merged with Malaya, North Borneo, and Sarawak on September 16 and formed Malaysia. However, the union proved unsuccessful. On August 9, 1965,Singapore gained independence from Malaysia, and thus began the journey of The Republic of Singapore. It is home to the Universal Studios Singapore – the 2nd in Asia and the 1st in Southeast Asia. Visitors have several state-of-the-art rides to choose from. It also has seven differently-themed zones ranging from Sci-fi to Madagascar and Waterworld to Ancient Egypt."}, {"url": "http://www.mapsofworld.com/singapore/", "passage_text": "One of the popular and most visited tourist attractions of Singapore is the island of Sentosa. It is home to the Universal Studios Singapore – the 2nd in Asia and the 1st in Southeast Asia. Visitors have several state-of-the-art rides to choose from. It also has seven differently-themed zones ranging from Sci-fi to Madagascar and Waterworld to Ancient Egypt."}, {"url": "http://www.mapsofworld.com/singapore/singapore-location-map.html", "passage_text": "Where is Singapore. Singapore is located on the southern tip of the Malay Peninsula in Southeast Asia, between the Indian Ocean and the South China Sea. Singapore is situated between parts of Malaysia and Indonesia, and features a hot, wet climate and tropical rainforests. All the islands combined account for a land area of about 704 square kilometers (272 square miles). Singapore, which has a population of over 5 million, had been a British colony before seceding from Malaysia as an independent state in 1965. Singapore's economy is primarily based on trade and the hospitality industry."}, {"url": "https://en.wikipedia.org/wiki/Singapore_in_Malaysia", "passage_text": "Singapore was one of the 14 states of Malaysia from 1963 to 1965. It became part of Malaysia on 16 September 1963, Malaysia being a new political entity formed from the merger of the Federation of Malaya with North Borneo, Sarawak and Singapore. "}, {"url": "http://www.nationsonline.org/oneworld/singapore.htm", "passage_text": "A virtual travel guide to Singapura; the Malay name for Lion City. Singapore is famous for shopping, activities, dining and entertainment. The city-state in Southeast Asia consists of the island of Singapore and about 54 smaller islands. The mai nisland is linked by a causeway to the southern tip of the Malay Peninsula. Singapore, officially the Republic of Singapore, is situated 137 km (85 mi) north of the equator, and just south of Peninsular Malaysia. In south the Strait of Singapore separates the island from the Riau Archipelago of Indonesia."}, {"url": "http://www.mapsofworld.com/singapore/singapore-location-map.html", "passage_text": "Location Map of Singapore. Singapore is located on the southern tip of the Malay Peninsula in Southeast Asia, between the Indian Ocean and the South China Sea. Singapore is situated between parts of Malaysia and Indonesia, and features a hot, wet climate and tropical rainforests. All the islands combined account for a land area of about 704 square kilometers (272 square miles). Singapore, which has a population of over 5 million, had been a British colony before seceding from Malaysia as an independent state in 1965. Singapore's economy is primarily based on trade and the hospitality industry."}, {"url": "http://goasia.about.com/od/destinations/f/Where-is-Singapore.htm", "passage_text": "Answer: Singapore is an island nation, both a city and a country, located just off the southern tip of Malaysia in Southeast Asia. Although located just east of Sumatra in Indonesia and west of Borneo, Singapore is a highly developed country with a strong economy. Singapore is slightly smaller than the U.S. city of Lexington, Kentucky, however, 5.3 million residents are squeezed into the tiny country's 274 square miles of land mass. Singapore's Changi Airport (airport code: SIN) is an impressive welcome into the country and is considered one of the best airports in the world. Numerous carriers connect Singapore with more than 200 major hubs all over"}]