[{"url": "http://medical-dictionary.thefreedictionary.com/Laryngo+pharynx", "passage_text": "pharynx. the throat; the musculomembranous crossroads of the digestive and respiratory systems, found behind the nasal cavities and mouth, and rostral to the larynx and esophagus. The pharynx is the part of the throat that lies between the mouth and the larynx or voice box."}, {"url": "http://medical-dictionary.thefreedictionary.com/pharynx", "passage_text": "pharynx. the throat; the musculomembranous crossroads of the digestive and respiratory systems, found behind the nasal cavities and mouth, and rostral to the larynx and esophagus. "}, {"url": "http://www.innerbody.com/anatomy/respiratory", "passage_text": "The respiratory system provides oxygen to the body’s cells while removing carbon dioxide, a waste product that can be lethal if allowed to accumulate. There are 3 major parts of the respiratory system: the airway, the lungs, and the muscles of respiration. The airway, which includes the nose, mouth, pharynx, larynx, trachea, bronchi, and bronchioles, carries air between the lungs and the body’s exterior."}, {"url": "http://www.dartmouth.edu/~humananatomy/part_8/chapter_53.html", "passage_text": "53-8) and the posterior aspect of the larynx is related to the laryngopharynx, the prevertebral fascia and muscles, and to the bodies of cervical vertebrae 3 to 6. Laterally, the larynx is related to the carotid sheath, infrahyoid muscles, sternomastoid muscle, and the thyroid gland. The laryngopharynx extends from the superior border of the epiglottis to the inferior border of the cricoid cartilage, where it becomes continuous with the esophagus. Its anterior aspect has the inlet of the larynx and the posterior aspects of the arytenoid and cricoid cartilages."}, {"url": "http://teachmeanatomy.info/neck/viscera/pharynx/", "passage_text": "Fig 1.0 – The pharynx in relation to the nasal and oral cavities. The pharynx is a muscular tube that connects the nasal cavities to the larynx and oesophagus. It is common to both the alimentary and the respiratory tract. The tube begins at the base of the skull and ends inferior to the cricoid cartilage (C6). The most distal part of the pharynx, this is located between the superior border of the epiglottis and inferior border of the cricoid cartilage (C6), at which point it becomes continuous with the"}, {"url": "https://en.wikipedia.org/wiki/Pharynx", "passage_text": "It makes up the part of the throat situated immediately posterior to the nasal cavity, posterior to the mouth and superior to the esophagus and larynx. The human pharynx is conventionally divided into three sections: the nasopharynx, the oropharynx and the laryngopharynx. It is also important in vocalization. There are two sets of pharyngeal muscles that act upon the pharynx. These are arranged as an inner layer of longitudinal muscles and an outer circular layer."}, {"url": "http://www.emory.edu/ANATOMY/AnatomyManual/pharynx.html", "passage_text": "The PHARYNX is a fibromuscular tube which extends from the base of the skull to the lower border of the cricoid cartilage (at which point it becomes the esophagus). Portions of the pharynx lie posterior to the nasal cavity (nasal pharynx), oral cavity (oral pharynx) and larynx (laryngeal pharynx). "}, {"url": "http://www.nature.com/gimo/contents/pt1/full/gimo5.html", "passage_text": "a: Midline sagittal view. b: Posterior view of the oral cavity and pharynx. In this view, the spinal column has been removed, so that the view is into the pharynx. The esophagus and pharynx have been opened to show the connections of the nasal cavity, oral cavity, larynx, and esophagus into the pharynx. "}, {"url": "http://www.dartmouth.edu/~humananatomy/part_8/chapter_53.html", "passage_text": "The word throat is used for the parts of the neck anterior to the vertebral column, especially the pharynx and the larynx. The pharynx is the part of the digestive system situated posterior to the nasal and oral cavities and posterior to the larynx. It is therefore divisible into nasal, oral, and laryngeal parts: the (1) nasopharynx, (2) oropharynx, and (3) laryngopharynx. The laryngopharynx extends from the superior border of the epiglottis to the inferior border of the cricoid cartilage, where it becomes continuous with the esophagus. Its anterior aspect has the inlet of the larynx and the posterior aspects of the arytenoid and cricoid cartilages."}, {"url": "https://en.wikipedia.org/wiki/Pharynx", "passage_text": "The pharynx (plural: pharynges) is an organ found in vertebrates and invertebrates, though the structure is not universally the same across the species. In humans the pharynx is part of the digestive system and also of the conducting zone of the respiratory system. The human pharynx is conventionally divided into three sections: the nasopharynx, the oropharynx and the laryngopharynx. It is also important in vocalization. There are two sets of pharyngeal muscles that act upon the pharynx. These are arranged as an inner layer of longitudinal muscles and an outer circular layer."}]