[{"url": "http://energyusecalculator.com/electricity_refrigerator.htm", "passage_text": "A fridge will use anywhere from 100 to 400 watts depending on size, an average modern fridge will use 180 watts. Click calculate to find the energy consumption of a refrigerator using 180 Watts for 24 hours a day @ $0.10 per a kWh. Cost Per Hour: (For example: 30 minutes per a day is 0.5). If you are using an old fridge we highly recommend you upgrade to a more efficient modern model, advances in the past 15-20 years have reduced the energy use of refrigeration."}, {"url": "http://energy.gov/energysaver/estimating-appliance-and-home-electronic-energy-use", "passage_text": "Annual cost to operate: The utility rate is 11 cents per kWh.4.68 kWh × $0.11/kWh = $0.51/year. Determining how much electricity your appliances and home electronics use can help you understand how much money you are spending to use them. 4.68 kWh × $0.11/kWh = $0.51/year. If you want more detailed data on your home's energy use (as well as the ability to measure the energy use of 240-volt appliances), you might consider installing a whole-house energy monitoring system."}, {"url": "http://michaelbluejay.com/electricity/refrigerators.html", "passage_text": "At 15 kWh, trading in a pre-1986 fridge for a new efficient one would save about $158 a year in electricity costs. And some older fridges are even worse than the average. One reader estimates her savings to be $238 per year for trading in her 1979 fridge for a 2004 model. Pick a good spot for the fridge. More on temperature & energy use: A Sun Frost fridge uses 61% more energy in a 90-degree F environment than a 70-degree environment. Home Energy magazine has a chart showing refrigerator energy use per degree of temperature."}, {"url": "http://www.consumerreports.org/cro/news/2013/03/a-mini-refrigerator-can-max-out-your-utility-bill/index.htm", "passage_text": "It costs $180 but could cost you $80 per year to run if the refrigerator temperature is set to the recommended 37 degrees (based on a national average of 11.8 cents per kilowatt hour). That's more than some 31 cubic foot models. A top-freezer model that we named a CR Best Buy, the Frigidaire Gallery FGUI2149L[P] , $850, has a claimed capacity of 20.6 cubic feet and costs $47 per year to run. If you need a second refrigerator and have the space, you might want to consider a larger energy miser over a small energy hog."}, {"url": "http://michaelbluejay.com/electricity/refrigerators.html", "passage_text": "Refrigerators are a big chunk of home energy use. In most homes the refrigerator is the second-largest user of electricity (13.7%), right after the air conditioner (14.1%). (Dept. of Energy) With most appliances you save energy by using them less, but you can't very well do that with your fridge. Pick a good spot for the fridge. More on temperature & energy use: A Sun Frost fridge uses 61% more energy in a 90-degree F environment than a 70-degree environment. Home Energy magazine has a chart showing refrigerator energy use per degree of temperature."}, {"url": "http://www.ebay.com/gds/How-Much-Energy-Does-a-Mini-Fridge-Use-/10000000178626958/g.html", "passage_text": "Reasons for High Energy Use. On average, a standard model mini fridge uses roughly 230 kilowatt-hours per year, as much as many Energy Star rated full-sized refrigerators. The amount of energy a mini fridge consumes is due in large part to poor insulation and lack of cooling features. With the number of variables that factor into appliance energy consumption, it is difficult to predict how much energy a mini fridge may use. However, there are ways to estimate energy use and cost based on the wattage ratings of appliances."}, {"url": "http://homeguides.sfgate.com/much-electricity-mini-fridge-take-84594.html", "passage_text": "According to Consumer Reports testing, annual operating costs for the most efficient 4.4-cubic-foot mini fridge can be as low as $27, while a much larger 20.6-cubic-foot refrigerator costs just $47 per year. A compact refrigerator, often referred to as a mini fridge, is commonly used for extra food cooling in home bars, kids' or bonus rooms, home offices and dorm rooms. It's easy to assume that small refrigerators equate to small energy consumption, but this is not typically the case."}, {"url": "http://www.ebay.com.au/gds/How-Much-Energy-Does-a-Mini-Fridge-Use-/10000000178626958/g.html", "passage_text": "Reasons for High Energy Use. On average, a standard model mini fridge uses roughly 230 kilowatt-hours per year, as much as many Energy Star rated full-sized refrigerators. The amount of energy a mini fridge consumes is due in large part to poor insulation and lack of cooling features. The drawback to their small size is that a mini fridge sometimes uses more energy than a full-size refrigerator, according to a Consumer Reports review. The actual cost to run a mini fridge depends on several factors, including the size of the refrigerator and the number of hours in use."}, {"url": "http://www.wisegeek.org/how-much-electricity-do-appliances-use.htm", "passage_text": "To figure how many kilowatts an appliance uses, take the wattage of the appliance, multiply it by the number of hours used, and divide by 1,000. For example, if a new refrigerator has a wattage of 300, multiplied by 730 hours, and divided by 1,000, it averages 219 kilowatt hours. Ad. The price of a kilowatt hour varies in the US, depending on location and peak usage times, but on average, one kilowatt hour costs about $0.06 USD. Newer appliances are generally built to be more efficient, and the location at which the appliance is placed also affects how much power the appliance will use; most new appliances include information regarding their average usage rate."}]