[{"url": "http://www.answers.com/Q/What_is_the_purpose_of_the_public_works_administration", "passage_text": "In The Great Depression. The Public Works Administration was created by the National Industrial Recovery Act in 1933. It was created to spend large sums of money on big public works. The Act budgeted … billions of dollars on public works construction thus providing employment to a large number of the unemployed, improve the public welfare, and contribute to stabilizing the economy and reviving American industry."}, {"url": "http://openstudy.com/updates/542c1a3be4b0173657da42b7", "passage_text": "To help industries plan production. Public Works Administration (PWA), part of the New Deal of 1933, was a large-scale public works construction agency in the United States headed by Secretary of the Interior Harold L. Ickes. Works Administration (PWA), in U.S. history, New Deal government agency (1933–39) designed to reduce unemployment and increase purchasing power through the construction of highways and public buildings. g-mario."}, {"url": "https://answers.yahoo.com/question/index?qid=20100202132629AA6xiSp", "passage_text": "Best Answer: The giant National Industrial Recovery Act not only created new public works programs—the Public Works Administration (PWA) and Civil Works Administration (CWA)—and guaranteed the rights of organized labor for collective bargaining. From Shmoop. Source(s): http://www.shmoop.com/fdr-new-deal/polit... "}, {"url": "https://en.wikipedia.org/wiki/Public_Works_Administration", "passage_text": "Public Works Administration (PWA), part of the New Deal of 1933, was a large-scale public works construction agency in the United States headed by Secretary of the Interior Harold L. Ickes. It was created by the National Industrial Recovery Act in June 1933 in response to the Great Depression. It built large-scale public works such as dams, bridges, hospitals, and schools."}, {"url": "http://www.infoplease.com/encyclopedia/history/public-works-administration.html", "passage_text": "Public Works Administration (PWA), in U.S. history, New Deal government agency established (1933) by the Congress as the Federal Administration of Public Works, pursuant to the National Industrial Recovery Act. "}, {"url": "http://spartacus-educational.com/USARpwa.htm", "passage_text": "Public Works Administration. The Public Works Administration (PWA) was headed by Harold Ickes, Secretary of the Interior. Congress gave permission for the PWA to spend $3,300,000,000 for various public works projects. This included the construction of schools, hospitals, post offices, roads and dams. By June 1934 the agency had distributed its entire fund to 13,266 federal projects and 2,407 non-federal projects"}, {"url": "https://en.wikipedia.org/wiki/Public_Works_Administration", "passage_text": "Most of the spending came in two waves in 1933-35, and again in 1938. Originally called the Federal Emergency Administration of Public Works, it was renamed the Public Works Administration in 1935 and shut down in 1943. The PWA spent over $6 billion in contracts to private construction firms that did the actual work. It was created by the National Industrial Recovery Act in June 1933 in response to the Great Depression. It built large-scale public works such as dams, bridges, hospitals, and schools."}, {"url": "http://www.pbs.org/wnet/blueprintamerica/reports/profiles-from-the-recession/report-bridge-to-somewhere-public-works-administration/?p=693", "passage_text": "Many people believe the Triborough Bridge in New York was built by the WPA, the Works Progress Administration. But it wasn’t. It was built by the PWA, the Public Works Administration. The confusion is easy to understand, given the similar abbreviations of the two New Deal programs. But somehow it’s the WPA that gets all the fame. "}]