[{"url": "http://www.ucmp.berkeley.edu/plants/plantae.html", "passage_text": "The Plantae includes all land plants: mosses, ferns, conifers, flowering plants, and so onan amazing range of diverse forms. With more than 250,000 species, they are second in size only to the arthropoda. The green kingdom. The Plantae includes all land plants: mosses, ferns, conifers, flowering plants, and so onan amazing range of diverse forms. With more than 250,000 species, they are second in size only to the arthropoda. Plants have been around for a very long time."}, {"url": "http://study.com/academy/lesson/kingdom-plantae-facts-characteristics-examples.html", "passage_text": "There are over 250,000 species that make up the kingdom plantae, which is the second largest kingdom after the animal kingdom. When you think of a plant, that green stuff that grows inside your fish tank probably isn't the first thing that comes to mind, but algae is in the kingdom plantae. "}, {"url": "http://www.thebigger.com/biology/plant/what-is-kingdom-plantae/", "passage_text": "Plantae are defined as multi cellular organisms which produce their food by photosynthesis. They are also known as metaphyta. Mainly in the old classification plant kingdom is divided into three groups which are thallophytes, bryophytes and tracheophytes. Thallophytes include fungi and algae. "}, {"url": "http://biology.tutorvista.com/organism/kingdom-plantae.html", "passage_text": "The Kingdom plantae is also called as kingdom Metaphyta. The Kingdom plantae includes all types of eukaryotic, multicellular, photosynthetic plants found in this biosphere. Most of the organism in this kingdom is autotrophs, which synthesis their own food with the help of solar energy. "}, {"url": "http://www.infoplease.com/encyclopedia/science/plant-the-plant-kingdom.html", "passage_text": "The systems of classification of the plant kingdom vary in naming and placing the larger categories (even the divisions) because there is little reliable fossil evidence, as there is in the case of animals, to establish the true evolutionary relationships of and distances between these groups. 1 plant: The Plant Kingdom-The Plant Kingdom The systems of classification of the plant kingdom vary in naming and placing the 2  ... Life Science-Life Science Scientific Classification Human Body Oldest Human Remains in North America Found Major ..."}, {"url": "http://www.ric.edu/faculty/ptiskus/six_kingdoms/", "passage_text": "Plants. You are probably quite familiar with the members of this kingdom as it contains all the plants that you have come to know-flowering plants, mosses, and ferns. Plants are all multicellular and consist of complex cells. In addition plants are autotrophs, organisms that make their own food. With over 250,000 species, the plant kingdom is the second largest kingdom. Plant species range from the tiny green mosses to giant trees. Without plants, life on Earth would not exist! Plants feed almost all the heterotrophs (organisms that eat other organisms) on Earth. When Linnaeus developed his system of classification, there were only two kingdoms, Plants and Animals. But the use of the microscope led to the discovery of new organisms and the identification of differences in cells."}, {"url": "http://www.factmonster.com/ipka/A0932480.html", "passage_text": "(or Plantae). Virtually all other living creatures depend on plants to survive. Through photosynthesis, plants convert energy from sunlight into food stored as carbohydrates. Because animals cannot get energy directly from the sun, they must eat plants (or other animals that have had a vegetarian meal) to survive."}, {"url": "http://www.thefreedictionary.com/plant+kingdom", "passage_text": "plant kingdom - (botany) the taxonomic kingdom comprising all living or extinct plants. kingdom Plantae, Plantae. plant life, flora, plant - (botany) a living organism lacking the power of locomotion. phytology, botany-the branch of biology that studies plants. "}, {"url": "http://biology.tutorvista.com/plant-kingdom.html", "passage_text": "Kingdom Plantae consist of living multicellular organisms and are also known as green plants. They form a group that includes plants of different varieties like the flowering plants, confers, gymnosperms, ferns, mosses, liverworts, and also green algae etc. Plants are present on land, in fresh and marine waters. Plantae is the group where living organisms other than animals are traditionally divided into. This division dates back to Aristotle who distinguished plants to be organisms which do not move. Later, Linnaeus proposed the the basis of modern classification, the division was of two groups Plantae and Animalia."}]