[{"url": "http://www.nkba.org/Learn/Homeowners/Tips/Tile/ChoosingTheRightTile.aspx", "passage_text": "Porcelain tile is generally made by pressing porcelain clays, which results in a tile that's dense, impervious, fine grained, and smooth with a sharply formed face. Porcelain tiles usually have a much lower water absorption rate than ceramic tiles, making them more frost resistant, although not frost proof."}, {"url": "http://buildipedia.com/at-home/floors/tile-flooring-101-types-of-tile-flooring", "passage_text": "Ceramic Tile. Ceramic tile is manufactured from clay materials that are quarried, prepared, and then formed into a mold. Common forming methods for ceramic tile include dry press, extruded, and slush mold. The dry press forming method involves a mixture of dry material being pressed into a mold under extreme pressure."}, {"url": "http://buildipedia.com/at-home/floors/tile-flooring-101-types-of-tile-flooring", "passage_text": "Ceramic tile can best be characterized as either porcelain or non-porcelain. Traditional ceramic tile is non-porcelain and is made from white, red, and/or brown clay and other minerals. Porcelain ceramic tile is made from clay and minerals as well, but it also contains 50% of a white dust or sand called feldspar."}, {"url": "http://homerenovations.about.com/od/tiling/a/Porcelain-Tile-Vs-Ceramic-Tile.htm", "passage_text": "Porcelain and ceramic tile are essentially the same, with one slight difference. Both are part of the larger category of tiles we can call ceramic. It is more a case of reverse-naming, whereby manufacturers take tiles that have certain qualities and then assign the ceramic or porcelain titles to them."}, {"url": "http://www.overstock.com/guides/porcelain-tiles-vs-ceramic-tiles", "passage_text": "Ceramic tile is made from natural clay, sand and water. These materials are molded to form square or rectangular tiles and then baked in a kiln to remove most of the moisture. Porcelain tile is also made from clay but tends to be made using denser types of clay than ceramic."}, {"url": "http://starcraftcustombuilders.com/porcelain.or.ceramic.htm", "passage_text": "Porcelain tile is harder to install than ceramic tile. Any well fired, dense, hard clay tile is more difficult to install than softer tiles not fired as long. Hard tiles are less porous and may, but do not always, require a special setting adhesive to bond well to whatever surface they are being installed on."}, {"url": "http://www.wikihow.com/Tell-The-Difference-Between-Porcelain-and-Ceramic-Tiles", "passage_text": "1 Group two: the porcelain tiles are generally made by the dust pressed method from porcelain clays which result in a tile that is denser and more durable than ceramic tile. 2  The finish is a finer grained and smoother with sharply formed faces."}, {"url": "http://homefixcos.com/ceramic-tile/", "passage_text": "Ceramic tile is made up of sand, natural products, and clays and once it has been moulded into shape they are then fired in a kiln. When making ceramic tiles they can either be glazed or unglazed, but the majority of homeowners have glazed ceramic tiles in their home."}, {"url": "http://www.wikihow.com/Tell-The-Difference-Between-Porcelain-and-Ceramic-Tiles", "passage_text": "1 Stay with a good quality ceramic tile if it is going to be in a high traffic area such as an entry way or heavy used hallway. 2  For bathrooms or laundry rooms, use a porcelain tile. 3  Not only is porcelain tile more durable because of their hardness, they are more resistant to moisture."}]