[{"url": "https://en.wikipedia.org/wiki/Lake_trout", "passage_text": "Description [edit]. A lake trout. Lake trout are the largest of the chars; the record weighed almost 46.3 kilograms (102 lb) (netted) with a length of 50 inches (130 cm), and 15– to 40-pound fish are not uncommon. The average length is 24–36 inches (61–91 centimetres)"}, {"url": "http://www.michigan.gov/dnr/0,4570,7-153-10364_18958-45670--,00.html", "passage_text": "Thus, while the lake trout may be found in shallow water only 10 to 15 feet deep in spring and fall, it follows these frigid water temperatures to depths of 100 to 200 feet in the summer and winter. This restless denizen of the cold, deep waters is a true wanderer, often ranging many miles in search of prey. The eggs are deposited after dark, often on shoals. Young lake trout become sexually mature at 6 or 7 years of age. The average adult weighs in at 9 - 10 pounds but some individuals weigh up to 50 pounds (the Michigan record is 61 1bs and 8 oz). The life-span of the lake trout may exceed 25 years."}, {"url": "https://en.wikipedia.org/wiki/Trout", "passage_text": "Trout is the common name for a number of species of freshwater fish belonging to the genera Oncorhynchus, Salmo and Salvelinus, all of the subfamily Salmoninae of the family Salmonidae. A rainbow trout that spends time in the ocean is called a steelhead. Trout are an important food source for humans and wildlife including brown bears, birds of prey such as eagles, and other animals. They are classified as oily fish."}, {"url": "https://en.wikipedia.org/wiki/Trout", "passage_text": "Most trout such as lake trout live in freshwater lakes and/or rivers exclusively, while there are others such as the rainbow trout which may either live out their lives in fresh water, or spend two or three years at sea before returning to fresh water to spawn, a habit more typical of salmon. A rainbow trout that spends time in the ocean is called a steelhead. Trout are an important food source for humans and wildlife including brown bears, birds of prey such as eagles, and other animals. They are classified as oily fish."}, {"url": "http://www.wikihow.com/Catch-Lake-Trout", "passage_text": "1. Use a light-action rod with 4 to 6 pound test line. This is the best rod to use for trout fishing and allows you to use a variety of techniques to catch your trout. The lighter line has less friction with the water, allowing you cast your line to the very bottom of the lake with ease. 1  Some lake trout can be over 35 pounds, you will need a heavier rod for these. 2. Try jigging for trout. This technique is best in areas where fish are concentrated, so you might want to try it if you're fishing a well-stocked lake. Use a spoon jig or a white buck-tail jig, and bait with a minnow or a piece of sucker meat."}, {"url": "https://en.wikipedia.org/wiki/Trout", "passage_text": "1 It is recommended that when fishing for trout, that the fisher(s) should use line in the 4–8 lb test for streamfish, and stronger line with the same diameter for trout from the sea or from a large lake, such as Lake Michigan. 2  It is also recommended to use a hook size 8-5 for trout of all kind. A rainbow trout that spends time in the ocean is called a steelhead. Trout are an important food source for humans and wildlife including brown bears, birds of prey such as eagles, and other animals. They are classified as oily fish."}, {"url": "http://fieldguide.mt.gov/detail_AFCHA05050.aspx", "passage_text": "General Description. The Lake Trout is a char of the same genus as Bull Trout and Brook Trout. Lake Trout are native in the St. Mary and Missouri River drainages and have been introduced to a few other scattered mountain lakes, Flathead Lake, and Fort Peck Reservoir. "}, {"url": "https://en.wikipedia.org/wiki/Lake_trout", "passage_text": "Other names for it include mackinaw, lake char (or charr), touladi, togue, and grey trout. In Lake Superior, it can also be variously known as siscowet, paperbelly and lean. The lake trout is prized both as a game fish and as a food fish. A lake trout. Lake trout are the largest of the chars; the record weighed almost 46.3 kilograms (102 lb) (netted) with a length of 50 inches (130 cm), and 15– to 40-pound fish are not uncommon. The average length is 24–36 inches (61–91 centimetres)"}, {"url": "http://www.twin-lakes-air.com/lake-trout.htm", "passage_text": "Lake Trout like small lures more than big lures. The very best lure is a small Sutton Silver Spoon. You can also use #1 or #0 Mepps, Panther Martins or Blue Foxes. Small Cleos or a small Mepps Cyclopes are also good. A 1-oz weight with 6-pound test dark green line is good for fishing down to 40 feet. "}]