[{"url": "http://www.answers.com/Q/Who_is_the_lieutenant_governor_of_Indiana", "passage_text": "The current Lieutenant Governor of New York is Robert Duffy. Duffy assumed office as Lieutenant Governor of New York on January 1, 2011. who is the lieutenant governor of New … York State."}, {"url": "http://www.ltgov.ri.gov/about/", "passage_text": "About the Lieutenant Governor. Daniel J. McKee was sworn in as the 69th lieutenant governor of Rhode Island on Jan. 6, 2015. Dan ran for lieutenant governor to create more economic opportunity for all Rhode Island families and to help build solvent communities and better public schools. As a private citizen, businessman and elected official, he has spent his adult life advocating for positive change in Rhode Island."}, {"url": "https://en.wikipedia.org/wiki/Lieutenant_Governor_of_Indiana", "passage_text": "The Lieutenant Governor of Indiana is a constitutional office in the US State of Indiana. Republican Sue Ellspermann, who assumed office in January 2013, is the incumbent. The lieutenant governor holds statutory positions, serving as the head of the state agricultural and rural affairs bureaus, and as the chairman of several state committees. The annual salary of the lieutenant governor of Indiana is $76,000. The lieutenant governor is elected on the same election ticket as the Governor in a statewide election held every four years, concurrent with United States presidential elections"}, {"url": "http://voices.washingtonpost.com/thefix/governors/indiana-lt-gov-becky-skillman.html", "passage_text": "Indiana Lt. Gov. Becky Skillman bows out. By Aaron Blake. Indiana Lt. Gov. Becky Skillman said Monday that she will not run for governor in 2012, leaving a opening that many expect will now be filled by Rep. Mike Pence. The Republican congressman has been eyeing a presidential campaign, but sources in Indiana are now expecting him to run for governor. Though many in Washington see a national campaign in Pence's future, Republicans in Indiana think a governor run just got more likely. Lots of moves and more than idle chit-chat lead me to say with confidence he's running for governor, said one Republican insider."}, {"url": "http://www.coats.senate.gov/indiana/", "passage_text": "Indiana Resources. I'm proud to represent Indiana in the U.S. Senate and honored to serve Hoosier families. Indiana is a special place defined by its timeless traditions, hard-working citizens and diverse natural resources. Below you can find a list of my Congressional colleagues from Indiana, our Governor and Lieutenant Governor, facts about the Hoosier state and links to other Indiana resources."}, {"url": "https://en.wikipedia.org/wiki/Sue_Ellspermann", "passage_text": "Sue Ellspermann (born c. 1960) is an American politician who serves as the 50th and current Lieutenant Governor of Indiana. Early life and career [edit]. Ellspermann was born in Ferdinand, Indiana, and is one of six children to Tom and Betty Boeglin. She graduated in 1978 from Forest Park High School in Ferdinand, Indiana."}, {"url": "http://www.answers.com/Q/Who_is_the_lieutenant_governor_of_Indiana", "passage_text": "Making the world better, one answer at a time. The current Lieutenant Governor of Indiana is Becky Stillman. Stillman assumed office as Lieutenant Governor of Indiana on January 10, 2005. Duffy assumed office as Lieutenant Governor of New York on January 1, 2011. who is the lieutenant governor of New … York State."}, {"url": "http://www.answers.com/Q/Who_is_Lieutenant_Governor_of_Indiana", "passage_text": "The Governor of a State is the head of the executive in that state while the Lieutenant Governor has to be ready to take control if the Governor dies, resigns, or is imp … eached. 28 people found this useful. Nobody, actually. Arizona is one of only a handful of US states that does not elect a lieutenant governor, as such an office is not specified in the state's constitution. The … first in line to succeed the governor is the Arizona secretary of state. There is no such position in Arizona government."}]