[{"url": "http://boards.straightdope.com/sdmb/showthread.php?t=676030", "passage_text": "Are GABA supplements addictive. I have been having a lot of stress, so I bought a supplement called Pharmagaba, which is supposed to be a form of GABA which can cross the blood brain barrier. I took a chewable pill and I feel pretty good. Relaxed, fairly happy, etc. Supplemental GABA Derivitives. Though nature may limit GABA from crossing the barrier, chemists have found a way to create GABA-like supplements or analogues that can cross the barrier and function like GABA in the brain. Phenibut, or beta-phenyl-gamma-aminobutyric acid Hcl, is a designer GABA analogue."}, {"url": "https://www.integrativepsychiatry.net/natural_gaba.html", "passage_text": "GABA is Gamma-aminobutyric acid, a neurotransmitter and the cornerstone of the inhibitory (calming) system in the body; controlling the action of epinephrine, norepinephrine, and dopamine. GABA Supplements. While drugs alter or potentiate the GABA receptor, they do not add any GABA to the system. Drugs rely on a sufficient supply of endogenous GABA in the brain to function properly. However, due to factors like diet, stress, and genetics, a healthy supply of GABA may not be available."}, {"url": "http://www.doctoroz.com/article/gaba-boosting-brain-foods", "passage_text": "From This Episode: While there are several drugs that help to boost GABA, there are also some natural ways to get the peace and calm your brain needs. Finding natural solutions have a few benefits. First, they’re not addictive like many of the prescription medications. "}, {"url": "http://extrahappiness.com/happiness/?p=3582", "passage_text": "GABA (gamma aminobutyric acid) is a non-essential amino acid found mainly in the human brain and eyes. It is considered an inhibitory neurotransmitter, which means it regulates brain and nerve cell activity by inhibiting the number of neurons firing in the brain. "}, {"url": "http://www.denvernaturopathic.com/news/GABA.html", "passage_text": "INTRODUCTION: Gamma-Amino Butyric acid (GABA) is an amino acid which acts as a neurotransmitter in the central nervous system. It inhibits nerve transmission in the brain, calming nervous activity. As a supplement it is sold and promoted for these neurotransmitter effects as a natural tranquilizer. Serotonin is another neurotransmitter and it enhances GABA. Therefore, as precursors to serotonin, Tryptophan and 5-HTP increase GABA action. Theanine is an amino acid found in large amounts in tea. It is why a cup of tea can be calming despite the fact it contains caffeine."}, {"url": "https://www.ondietandhealth.com/anxiety-addiction-2/", "passage_text": "Anxiety and Addiction. GABA is our main inhibitory neurotransmitter, and a key regulator of both anxiety and addiction. It helps us stay in that calm, healing, para-sympathetic mode, and avoid the sympathetic flight or fight mode. It governs dozens of functions in the mind and body"}, {"url": "http://raysahelian.com/gaba.html", "passage_text": "GABA or gamma-aminobutyric acid, discovered in 1950, is the most important and widespread inhibitory neurotransmitter in the brain. Excitation in the brain must be balanced with inhibition. Too much excitation can lead to restlessness, irritability, insomnia, and even seizures. "}, {"url": "http://herbalextractsplus.com/gaba.html", "passage_text": "Perhaps it’s time for the soothing effects of GABA, a natural amino acid that helps to calm the central nervous system and prevent anxiety and stress-related messages from reaching the motor centers of the brain-without the addictive side effects of synthetic tranquilizers. Gamma-aminobutyric acid was first synthesized in 1883, and was first known only as a plant and microbe metabolic product. In 1950, GABA was discovered to be an integral part of the mammalian central nervous system."}, {"url": "https://www.integrativepsychiatry.net/natural_gaba.html", "passage_text": "GABA is the primary inhibitory neurotransmitter in the brain and therefore filters out irrelevant messages (static) by terminating signals from the excitatory neurotransmitters: glutamate, and its positive modulators epinephrine, norepinephrine, and PEA. GABA Supplements. While drugs alter or potentiate the GABA receptor, they do not add any GABA to the system. Drugs rely on a sufficient supply of endogenous GABA in the brain to function properly. However, due to factors like diet, stress, and genetics, a healthy supply of GABA may not be available."}]