[{"url": "http://www.enotes.com/homework-help/what-were-major-characteristics-pax-romana-314789", "passage_text": "The period known as the pax romana lasted approximately 200 years from the battle of Actium when Octavian defeated Anthony until the time of the Emperor Aurelius. In view of this the first and main character of the pax romana is the founder of it all, Octavian (Augustus)."}, {"url": "http://www.answers.com/Q/What_was_a_benefit_of_the_time_period_known_as_Pax_Romana", "passage_text": "The Pax Romana refers to the period from 30 BC to roughly 200 AD.  This was a time of relative peace and great prosperity for the  Roman empire. Most characterize this perio … d with Romans' success in  keeping order around the Mediterranean."}, {"url": "http://www.answers.com/Q/What_are_benefits_of_pax_romana", "passage_text": "The Pax Romana (Roman peace) was a 200 year period of relative political stability in the Roman Empire."}, {"url": "http://www.ushistory.org/civ/6c.asp", "passage_text": "The term Pax Romana, which literally means Roman peace, refers to the time period from 27 B.C.E. to 180 C.E. in the Roman Empire. This 200-year period saw unprecedented peace and economic prosperity throughout the Empire, which spanned from England in the north to Morocco in the south and Iraq in the east."}, {"url": "http://www.coreknowledge.org.uk/resources/Resource%20Pack-%20Year%204-%20Life%20in%20Ancient%20Rome.pdf", "passage_text": "Lesson 1. Pax Romana For 200 years following the reign of Emperor Augustus (27 AD), there was a period of history known as the Pax Romana (Roman peace). The strength of the Roman Empire, coupled with its large territorial reach, meant no civilisation could oppose Rome."}, {"url": "http://www.answers.com/Q/What_was_a_benefit_of_the_time_period_known_as_Pax_Romana", "passage_text": "The period known as the Pax Romana was a span of time that lasted  about 200 years in the Roman Empire. During this time, there was  peace and prosperity in this empire. It … was established by  Augustus, and it began in 27 B.C. and ended about 180 A.D. There  were five good emperors associated with this period."}, {"url": "http://www.answers.com/Q/What_was_a_benefit_of_the_time_period_known_as_Pax_Romana", "passage_text": "Pax Romana is a term historians use to indicate a 200-year period  of relative political stability within the Roman Empire which  followed the establishment of rule by emper … ors by Augustus."}, {"url": "http://www.answers.com/Q/What_are_benefits_of_pax_romana", "passage_text": "The Pax Romana lasted from 27 BC to 180 AD. It was a period of internal political stability within the Roman Empire after the civil war that put Augustus in power."}]