[{"url": "http://www.spiritoffreedom.com.au/diving/dive_seasons.html", "passage_text": "Visibility. While visibility can vary due to wind, tide, and current, the Great Barrier Reef experiences an average visibility of 20 metres (~65 feet) with a range of 10 to 30 metres, while the Coral Sea Reefs experience a year round average of 30 metres (~100 feet) visibility."}, {"url": "http://mclean.ch/climate/GBR_sea_temperature.htm", "passage_text": "We can also compare the monthly average SST for the GBR Marine Park with the monthly mean temperatures for the Australian Bureau of Meteorology's observation station on Willis Island, which is located at Lat. 16.3S Long. 150.0E on the Great Barrier Reef, 455km almost due East from the city of Cairns."}, {"url": "http://maps.travelmate.com.au/Places/Featured_Regions.asp?RegionId=20", "passage_text": "The Great Barrier Reef has a tropical climate, with average temperatures in summer of between 24 and 33 degrees Celsius, in winter 14 to 26 degrees. Being a wet tropic climate, there are only 2 seasons, 'the green' and 'the dry'."}, {"url": "http://www.great-barrier-reef.com/great-barrier-reef-weather.html", "passage_text": "The temperatures are recorded as average maximums of (Celsius) 30 degrees and average minimums of (Celsius) 21 degrees. The Tropical North has an average rainfall of 2010mm (an average of 168mm per month). For more information on weather around the Great Barrier Reef visit the Bureau of Meteorology."}, {"url": "http://www.weather-guide.com/Tourist-destinations/great-barrier-reef-weather.html", "passage_text": "The following 2 weather charts display the average weather conditions of The Great Barrier Reef, Australia. The first chart plots the maximum temperature and the amount of rain in mm. The second The Great Barrier Reef chart indicates the average amount sunshine per day and the number of wet days per month."}, {"url": "http://www.weather-guide.com/Tourist-destinations/great-barrier-reef-weather.html", "passage_text": "The Great Barrier Reef, Australia. The average weather for The Great Barrier Reef. The region appears to have a huge amount of rain fall during the wet summer season of November through to April and especially in February. This is also the summer season as the seasons are reversed in the southern hemisphere."}, {"url": "http://travel.usnews.com/Great_Barrier_Reef_Australia/When_To_Visit/", "passage_text": "This is the Great Barrier Reef's rainy season, with average temperatures in the north hovering in the high 80s. Intermittent tropical downpours are common, meaning water visibility is blurred and conditions are muggy."}, {"url": "http://the-great-barrier-reef-experience.com/great-barrier-reef-climate.html", "passage_text": "The Great Barrier Reef climate varies between the northern and southern extremes of the area. With the exception of a few islands in the very south of the Great Barrier Reef Marine Park Authority boundaries, the entire Reef lies within the tropical belt between the Tropic of Capricorn and the Equator."}]