[{"url": "https://en.wikipedia.org/wiki/Bacillus_(shape)", "passage_text": "A bacillus (plural bacilli) is a rod-shaped bacterium. Bacilli are found in many different taxonomic groups of bacteria. However, the name Bacillus, capitalized and italicized, refers to a specific genus of bacteria. The name Bacilli, capitalized but not italicized, can also refer to a less specific taxonomic group of bacteria that includes two orders, one of which contains the genus Bacillus."}, {"url": "http://faculty.ccbcmd.edu/courses/bio141/lecguide/unit1/shape/shape.html", "passage_text": "THE PROKARYOTIC CELL: BACTERIA. 1. There are three basic shapes of bacteria: coccus, bacillus, and spiral. 2. Based on planes of division, the coccus shape can appear in several distinct arrangements: diplococcus, streptococcus, tetrad, sarcina, and staphylococcus. Most bacteria come in one of three basic shapes: coccus, rod or bacillus, and spiral. a. Division in one plane produces either a diplococcus or streptococcus arrangement. diplococcus: cocci arranged in pairs (see Fig."}, {"url": "http://classes.midlandstech.edu/carterp/courses/bio225/chap04/lecture2.htm", "passage_text": "Most bacteria are 0.2 um in diameter and 2-8 um in length. The three basic bacterial shapes are coccus (spherical), bacillus (rod-shaped), and spiral (twisted), however pleomorphic bacteria can assume several shapes. Arrangement of cocci. Cocci may be oval, elongated, or flattened on one side. Cocci that divide in multiple planes and form grape like clusters or sheets are called staphylococci. Bacilli. Since bacilli only divide across their short axis there are fewer groupings. Bacillus is a shape (rod shaped) but there is also a genus of bacteria with the name Bacillus."}, {"url": "http://www.whatarebacteria.com/shapes-of-bacteria/", "passage_text": "There are three main shapes of bacteria: bacillus, coccus, and spiral. Bacillus, or rod shaped bacteria, are one of the main forms, and are typically 0.5 micrometers to 1.0 micrometer in width, and from 1.0 micrometer to 4.0 micrometers in length. Examples of bacilli include Bacillus anthracis, the bacterium that causes anthrax, and the well known E. coli. Another common shape of bacteria is the coccus. Cocci are spherically shaped bacteria that organize in several distinct arrangements when in groups: diplococcus, tetrad, sarcina, and staphylococcus arrangements."}, {"url": "http://www.answers.com/Q/What_shapes_can_bacteria_be", "passage_text": "Depending on shape of Bacteria it is divided into Bacilli (Bacteria which is in the form of 'rod' shape), Cocci (Bacteria in the form of 'spherical' shape), Vibrios (Bact … eria in the form of 'comma' shaped which are resembles to rod shape), Spirilla (Bacteria in the form of 'spiral' shaped). Shape: Bacteria have three main shapes, they can be cocci (round), bacillus (rod-like), spirochete (helical or spiral). They can also be club shaped, and vibrio shaped (like a … crescent moon or curved rod). Cocci can be in singles, clumps, pairs, tetrads (four), and chains"}, {"url": "http://www.microbiologyinfo.com/different-size-shape-and-arrangement-of-bacterial-cells/", "passage_text": "The three basic bacterial shapes are coccus (spherical), bacillus (rod-shaped), and spiral (twisted), however pleomorphic bacteria can assume several shapes. Shape of Bacterial Cell. 1  Cocci (or coccus for a single cell) are round cells, sometimes slightly flattened when they are adjacent to one another. 2  Bacilli (or bacillus for a single cell) are rod-shaped bacteria."}, {"url": "http://faculty.ccbcmd.edu/courses/bio141/lecguide/unit1/shape/shape.html", "passage_text": "For example, bacillus-shaped bacteria that have an inactivated MreB gene become coccoid shaped, and coccus-shaped bacteria naturally lack the MreB gene. Most bacteria come in one of three basic shapes: coccus, rod or bacillus, and spiral. a. Division in one plane produces either a diplococcus or streptococcus arrangement. diplococcus: cocci arranged in pairs (see Fig."}, {"url": "http://www.microbiologyinfo.com/different-size-shape-and-arrangement-of-bacterial-cells/", "passage_text": "1 Bacilli (or bacillus for a single cell) are rod-shaped bacteria. 2  Spirilla (or spirillum for a single cell) are curved bacteria which can range from a gently curved shape to a corkscrew-like spiral. 3  Many spirilla are rigid and capable of movement. Shape of Bacterial Cell. 1  Cocci (or coccus for a single cell) are round cells, sometimes slightly flattened when they are adjacent to one another. 2 "}, {"url": "http://www.answers.com/Q/What_shapes_can_bacteria_be", "passage_text": "Coccus. Coccus (plural cocci or coccuses) can be used to describe any bacterium that has a spherical shape. It is one of the three distinct types of bacteria shapes, the oth … er two being bacillus (rod-shaped) and spirillum (spiral-shaped) cells. Shape: Bacteria have three main shapes, they can be cocci (round), bacillus (rod-like), spirochete (helical or spiral). They can also be club shaped, and vibrio shaped (like a … crescent moon or curved rod). Cocci can be in singles, clumps, pairs, tetrads (four), and chain"}]