[{"url": "https://en.wikipedia.org/wiki/Battle_of_the_Atlantic", "passage_text": "The name Battle of the Atlantic was coined by Winston Churchill in February 1941. It has been called the longest, largest, and most complex naval battle in history. The campaign started immediately after the European war began, and lasted six years. It was at its height from mid-1940 through to the end of 1943. The Battle of the Atlantic pitted U-boats and other warships of the Kriegsmarine (German navy) and aircraft of the Luftwaffe (German Air Force) against the Royal Canadian Navy, Royal Navy, and Allied merchant shipping."}, {"url": "https://answers.yahoo.com/question/index?qid=20090517123125AA4jEBs", "passage_text": "Answers. Best Answer: In WWII the battle of the Atlantic started with the beginning of the war in September 1939. The Germans sent out their U-Boats to sink any ships that could be taking supplies to Britain. They also had battleships in the Atlantic for the same purpose. One prominent one was Atlantis, sunk. The real battle of the Atlantic began when the US and Canada started to put together convoys to take supplies from the Americas to Great Britain."}, {"url": "https://en.wikipedia.org/wiki/Battle_of_the_Atlantic", "passage_text": "In essence, the Battle of the Atlantic was a tonnage war: the Allied struggle to supply Britain and the Axis attempt to stem the flow of merchant shipping that enabled Britain to keep fighting. It was at its height from mid-1940 through to the end of 1943. The Battle of the Atlantic pitted U-boats and other warships of the Kriegsmarine (German navy) and aircraft of the Luftwaffe (German Air Force) against the Royal Canadian Navy, Royal Navy, and Allied merchant shipping."}, {"url": "http://www.answers.com/Q/Why_did_the_battle_of_atlantic_happen", "passage_text": "The Battle of the Atlantic was one of the longest-lasting military campaigns in the second world war. It lasted from 1939 to 1945, and was about the German forces (mostly U-bo … ats, their submarines) cutting Britain off from the supplies sent by America. The battle of the Atlantic effected America by entering the US into the conflict on the sides of the Allies, Britain, France, Poland and other European countries."}, {"url": "https://en.wikipedia.org/wiki/Battle_of_the_Atlantic", "passage_text": "The Battle of the Atlantic was the longest continuous military campaign in World War II, running from 1939 to the defeat of Germany in 1945. At its core was the Allied naval blockade of Germany, announced the day after the declaration of war, and Germany's subsequent counter-blockade. It was at its height from mid-1940 through to the end of 1943. The Battle of the Atlantic pitted U-boats and other warships of the Kriegsmarine (German navy) and aircraft of the Luftwaffe (German Air Force) against the Royal Canadian Navy, Royal Navy, and Allied merchant shipping."}, {"url": "http://ww2db.com/battle_spec.php?battle_id=33", "passage_text": "Although submarines had scored the first victories in the Battle of the Atlantic, the German submarine fleet was small at the start of the war; there were only 57 in operational status, some of which were in use as minelayers rather than raiders. The German campaign in Norway in Apr 1940 also drew away many warships that were on raiding duties at the start of the war. It would not be until after the fall of France in Jun 1940 when the German Navy would escalate the actions in the Atlantic Ocean."}, {"url": "http://history.co.uk/study-topics/history-of-ww2/battle-of-the-atlantic", "passage_text": "Winston Churchill. The Battle of the Atlantic, which lasted from September 1939 until the defeat of Germany in 1945, was the war’s longest continuous military campaign. During six years of naval warfare, German U-boats and warships – and later Italian submarines – were pitted against Allied convoys transporting military equipment and supplies across the Atlantic to Great Britain and the Soviet Union."}, {"url": "http://www.bbc.co.uk/history/worldwars/wwtwo/battle_atlantic_01.shtml", "passage_text": "The Battle of the Atlantic: The U-boat peril. By Dr Gary Sheffield Last updated 2011-03-30. The Battle of the Atlantic was a fight for Britain's very survival. Winston Churchill, wartime prime minister, claimed that the 'U-boat peril' was the only thing that ever really frightened him during World War Two. Here, Gary Sheffield explains why. "}, {"url": "http://www.answers.com/Q/Why_did_the_battle_of_the_atlantic_happen", "passage_text": "The Battle of the Atlantic was one of the longest-lasting military campaigns in the second world war. It lasted from 1939 to 1945, and was about the German forces (mostly U-bo … ats, their submarines) cutting Britain off from the supplies sent by America. The battle of the Atlantic effected America by entering the US into the conflict on the sides of the Allies, Britain, France, Poland and other European countries."}, {"url": "http://www.historylearningsite.co.uk/world-war-two/war-in-the-atlantic/battle-of-the-atlantic/", "passage_text": "The Battle of the Atlantic played a very significant part in World War Two. In World War Two, after the escape at Dunkirk and the inspiration of the Battle of Britain, the Battle of the Atlantic was Britain’s next nightmare. The Battle of the Atlantic was “the only thing that ever frightened me.” Winston Churchill."}]