[{"url": "http://www.allabouthistory.org/mayflower-compact.htm", "passage_text": "The Mayflower Compact was drawn up with fair and equal laws, for the general good of the settlement and with the will of the majority. The Mayflower s passengers knew that the New World s earlier settlers failed due to a lack of government. They hashed out the content and eventually composed the Compact for the sake of their own survival. All 41 of the adult male members on the Mayflower signed the Compact. The original document is said to have been lost, but the writings of William Bradford s journal Of Plymouth Plantation and in Edward Winslow s Mourt s Relation: A Journal of the Pilgrims at Plymouth are in agreement and accepted as accurate. The Mayflower Compact reads:"}, {"url": "http://totallyhistory.com/mayflower-compact/", "passage_text": "Pilgrims. Later on called Pilgrims, 41 adult males out of the 102 settlers decided to create a law, called the Mayflower Compact. They knew that the first group of settlers, those who went to the “New World” before they did, failed because they did not have any system of self-government. In order to ensure their success this time, they decided to create a government, and the Mayflower Compact was the first law ever enacted. The first settlers in America were British. They were on a ship called the Mayflower, and they anchored in New Plymouth, which is currently in the Provincetown Harbor located near Cape Cod, Massachusetts."}, {"url": "http://www.allabouthistory.org/mayflower-compact.htm", "passage_text": "One of the first lists of the Mayflower Compact s signers was provided by William Bradford s nephew, Nathaniel Morton. The names are published in his 1669 New England s Memorial. The original document is said to have been lost, but the writings of William Bradford s journal Of Plymouth Plantation and in Edward Winslow s Mourt s Relation: A Journal of the Pilgrims at Plymouth are in agreement and accepted as accurate. The Mayflower Compact reads:"}, {"url": "https://en.wikipedia.org/wiki/Mayflower_Compact", "passage_text": "The Mayflower Compact was signed aboard ship on November 11, 1620 by the Pilgrims. Reasons for the Compact. The Mayflower was originally bound for the Colony of Virginia, financed by the Company of Merchant Adventurers of London. Storms forced them to anchor at the hook of Cape Cod in what is now Massachusetts."}, {"url": "https://en.wikipedia.org/wiki/Mayflower_Compact", "passage_text": "The Mayflower Compact was the first governing document of Plymouth Colony. It was written by separatist Congregationalists who called themselves Saints. Later they were referred to as Pilgrims or Pilgrim Fathers. They were fleeing from religious persecution by King James of England. Reasons for the Compact. The Mayflower was originally bound for the Colony of Virginia, financed by the Company of Merchant Adventurers of London. Storms forced them to anchor at the hook of Cape Cod in what is now Massachusetts."}, {"url": "https://goodnewstucson.wordpress.com/2010/06/01/mayflower-compact-the-puritans-experiment-with-socialism/", "passage_text": "Mayflower Compact, The Puritans Experiment with Socialism. Leading up to 1620, the religious climate of the world was changing. The Protestant Reformation in Europe was a reaction to the corruption in the Catholic Church. "}, {"url": "http://www.answers.com/Q/FAQ/8985", "passage_text": "The men on the Mayflower had prior knowledge that a lack of government was the reason other colonies had failed. So all 41 men signed the compact to provide fair and equal laws to all. These settlers had come to America a refuges from religious intolerance and for the sake of survival, drew up the …. The Mayflower Compact was the first governing document of Plymouth Colony. It was drafted by the pilgrims who crossed the Atlantic aboard the Mayflower. It was signed on November 21, 1620 in what is now Province…."}, {"url": "http://www.history.com/topics/mayflower-compact", "passage_text": "A+E Networks. The Mayflower Compact, signed by 41 English colonists on the ship Mayflower on November 11, 1620, was the first written framework of government established in what is now the United States. "}, {"url": "http://www.plimoth.org/learn/just-kids/homework-help/mayflower-and-mayflower-compact", "passage_text": "That’s what the Pilgrims did in the year 1620, on a ship called Mayflower. Mayflower set sail from England in July 1620, but it had to turn back twice because Speedwell, the ship it was traveling with, leaked. After deciding to leave the leaky Speedwell behind, Mayflower finally got underway on September 6, 1620."}, {"url": "http://mayflowerhistory.com/mayflower-compact/", "passage_text": "The Mayflower Compact. The Mayflower Compact was signed on 11 November 1620 onboard the Mayflower shortly after she came to anchor off Provincetown Harbor. The Pilgrims had obtained permission from English authorities to settle in Virginia, whose northern border at the time extended up to what is now New York. "}]