[{"url": "http://dish.allrecipes.com/turkey-cooking-time-guide/", "passage_text": "4-1/2 to 5 hours. 5-1/2 to 6-1/4 hours. Cook the turkey until the skin is a light golden color, and then cover loosely with a foil tent. During the last 45 minutes of baking, remove the foil tent to brown the skin. "}, {"url": "http://extension.illinois.edu/turkey/unstuffed.cfm", "passage_text": "Check the wing and the thickest part of the breast. You may choose to cook the turkey to higher temperatures. Cooking time will vary. For example, a 20 pound turkey will take 4 1/4 to 5 hours to cook, check the temperature on the thermometer after 4 1/4 hours. 4. Meanwhile, mix the stuffing or dressing. Place in a casserole and pop it into the oven during the last hour or so of roasting time. "}, {"url": "http://www.butterball.com/how-tos/roast-a-turkey", "passage_text": "1 Place your turkey in the oven. 2  When the turkey is about ⅔ done, loosely cover breast and top of drumsticks with a piece of foil to prevent overcooking. 3  Your turkey is done when the temperature with a meat thermometer is 180° F in thigh and 165° F in breast or stuffing. 1 Place turkey in pre-heated oven. 2  When turkey is about ¾ done, loosely cover breast and top of drumsticks with a piece of foil to prevent overcooking. 3  After about 3 hours, insert an oven-safe thermometer deep into the thigh without touching the bone."}, {"url": "http://www.wikihow.com/Slow-Cook-a-Turkey", "passage_text": "1 Cook the turkey uncovered in the oven at 500 degrees Fahrenheit for 15 to 20 minutes. 2  Reduce the heat to 200 degrees Fahrenheit (94 degrees Celsius) for slow cooking and cook for 40 to 50 minutes per lb. 3  Let the roasted turkey rest for 20 to 30 minutes before carving. 1 Place the turkey onto the rack, breast side up. 2  Cook the turkey uncovered in the oven at 500 degrees Fahrenheit for 15 to 20 minutes. 3  Reduce the heat to 200 degrees Fahrenheit (94 degrees Celsius) for slow cooking and cook for 40 to 50 minutes per lb. 4"}, {"url": "http://www.cooks.com/rec/story/66/", "passage_text": "Whole Turkey Oven Temperature Cooking Time (hours) Temp when cooked 4-8 pounds 325 degrees F 2 - 3 hours 160 - 170 8-12 pounds 325 degrees F 3 - 4 hours 160 - 170 12 - 16 pounds 325 degrees F 4 - 5 hours 160 - 170 16 - 20 pounds 325 degrees F 5 - 6 hours 160 - 170 20 - 24 pounds 325 degrees F 6 - 7 hours 160 - 170. The following chart is for whole turkey cooked at an oven temperature of 325 degrees. Allow slightly longer times for turkeys which are cooked in a slower oven, and conversely less time for a higher temperature oven. If you have a convection oven, cut time by as much as 1/3 or consult manufacturer's instructions."}, {"url": "http://www.fabulousfoods.com/articles/19926/turkey-roasting-time-temperature-and-cooking-method-guide", "passage_text": "1. Do not roast the turkey in a oven temperature lower than 325° F. Poultry should be roasted at 325° F. or higher to avoid potential food safety problems. 2. Do not roast the turkey in a brown paper grocery bag. Present day grocery bags may be made of recycled materials and are not considered safe for food preparation. 3"}, {"url": "http://whatscookingamerica.net/Poultry/GuidelinesRoastingTurkey.htm", "passage_text": "Oven Temperature-Set the oven temperature no lower than 325 degrees F. Pre-heating is not necessary. How To Cook Turkey-Turkey Roasting Instructions For Safety And Doneness: How To Cook Turkey-Turkey Roasting Instructions For Safety And Doneness: 1. "}, {"url": "http://www.foodnetwork.com/recipes/food-network-kitchens/roasted-turkey-recipe.html", "passage_text": "Tent the bird with foil. Roast the turkey for 2 hours. Remove the foil and baste with the remaining butter. Increase oven temperature to 425 degrees F and continue to roast until an instant read thermometer registers 165 degrees F in the thigh of the bird, about 45 minutes more. Remove turkey form the oven and set aside to rest for 15 minutes before carving. Carve and serve with dressing. Preheat oven to 325 degrees F. Put the stuffing cubes in a large bowl and set aside. Butter a 3-quart casserole dish. Melt 2 tablespoons of butter in a large skillet over medium-high heat."}, {"url": "http://www.butterball.com/how-tos/roast-a-turkey", "passage_text": "1 After about 3 hours, insert an oven-safe thermometer deep into the thigh without touching the bone. 2  Begin checking the turkey for doneness about 30 minutes before the recommended cook time. 3  Your turkey is done when the temperature with a meat thermometer is 180° F in thigh and 165° F in breast or stuffing. 1 Place turkey in pre-heated oven. 2  When turkey is about ¾ done, loosely cover breast and top of drumsticks with a piece of foil to prevent overcooking. 3 "}]