[{"url": "http://www.sfgate.com/bayarea/article/Uber-Lyft-vs-taxis-in-New-Year-s-Eve-fare-war-5984146.php", "passage_text": "Uber, Lyft vs. taxis in New Year’s Eve fare war. Back to Gallery. New Year’s Eve is a night of parties, revelry and drinks. That makes it a prime business opportunity for taxicabs and app-based ride competitors such as Uber and Lyft. Both Lyft and Uber have partnered with Mothers Against Drunk Driving and will donate a percentage of New Year’s Eve ride fees to that organization. Uber e-mailed drivers and said “some” would make $70 or $80 an hour on the big night. But not all ride-service drivers agree that surge pricing benefits them."}, {"url": "http://www.lyftvsuber.com/", "passage_text": "While both companies offer a range of more expensive, premium rides in luxury SUVs and limos, a basic ride will cost you about the same in Lyft as it will in UberX. While costs vary city-to-city for Uber and Lyft, rides are generally $1 to start, $1.50/mile, and $0.25/min. • Lyft Drivers: $500 bonus after you sign-up for Uber and give 25 rides within 30 days of activation! • You must sign-up through a referral link to receive a bonus. If you use mine, it helps me out a little, and for that I thank you from the bottom of my heart :)."}, {"url": "http://www.latinpost.com/articles/24514/20141026/lyft-vs-uber-drivers-struggle-financially-as-prices-drop-due-to-competition.htm", "passage_text": "Ride sharing has become a new hip way to travel in the U.S. with Uber and Lyft as the two dominant industry players. Of course, when something does well in a niche market, it is to be expected that more competitors will come to have a share of the market. The move was seen as a way to ease out Lyft, which charges lower rates. The rates fluctuate though, since Uber raises their rates (termed surge pricing) during peak hours. Lyft has what they call prime time pricing although they also have happy hour rates when the demand for rides is low."}, {"url": "http://www.latinpost.com/articles/24514/20141026/lyft-vs-uber-drivers-struggle-financially-as-prices-drop-due-to-competition.htm", "passage_text": "However, the scene is now different due to competition and Uber was forced to lower its fares, making it cheaper to have an UberX ride in several metropolitan areas compared to regular taxi cabs. Share This Story. Like Us on Facebook. The move was seen as a way to ease out Lyft, which charges lower rates. The rates fluctuate though, since Uber raises their rates (termed surge pricing) during peak hours. Lyft has what they call prime time pricing although they also have happy hour rates when the demand for rides is low."}, {"url": "http://www.lyftvsuber.com/", "passage_text": "At high-demand times and locations, the cost of a Lyft or Uber ride can significantly increase. For Lyft,  Prime Time  can increase the cost of a ride by 25 to 200%. For Uber,  Surge Pricing  can increase the cost of a ride by as much as 7 to 8 times the cost. • Lyft Drivers: $500 bonus after you sign-up for Uber and give 25 rides within 30 days of activation! • You must sign-up through a referral link to receive a bonus. If you use mine, it helps me out a little, and for that I thank you from the bottom of my heart :)."}, {"url": "http://www.lyftvsuber.com/", "passage_text": "For drivers and passengers, both the Lyft and Uber app are generally accepted as user friendly and functional. Both apps allow you to request a ride, plug-in an address prior to pick-up, watch your driver navigate to your location on a map, and submit ratings with an electronic payment at the end of your ride. • Lyft Drivers: $500 bonus after you sign-up for Uber and give 25 rides within 30 days of activation! • You must sign-up through a referral link to receive a bonus. If you use mine, it helps me out a little, and for that I thank you from the bottom of my heart :)."}, {"url": "http://www.techtimes.com/articles/33494/20150218/uber-vs-lyft-which-car-hailing-app-is-best-for-you.htm", "passage_text": "At 3:30 p.m. an Uber's estimated arrival time was 5 minutes vs. Lyft's 8 minutes. At 5:30 p.m. the estimated arrival time for an Uber was 3 minutes vs. Lyft's 6 minutes. So not huge a difference, but still a difference. In terms of app functionality, both apps are fairly user-friendly but the Uber app makes it slightly easier for users to estimate fares. Which one is more comfortable. Additionally, many Uber drivers are complaining that the company offers no tipping feature in its app. With the Lyft app, after each ride the user is prompted to tip their driver with gratuities of $1, $2, $5, or a custom amount."}, {"url": "http://www.latimes.com/business/technology/la-fi-tn-lyft-uber-rivalry-20140812-story.html", "passage_text": "Lyft this week said its data show that at least 177 known Uber employees have opened up the Lyft app, requested a ride and subsequently canceled it as part of a strategy to jam Lyft's service and prompt customers to use Uber instead, according to CNN Money. Lyft vs. Uber: The battle between the ridesharing rivals intensifies. Lyft. Lyft. Uber and Lyft have each offered drivers as much as $500 to switch sides, according to Forbes."}, {"url": "http://www.howtogeek.com/219126/uber-vs-lyft-what%E2%80%99s-the-difference-and-which-should-i-use/", "passage_text": "Price. Both Uber and Lyft enjoy pricing models which simply blow the yellow-tinted competition clean out of the water, though the cost will vary city-to-city depending on local regulations. Lyft will generally hover around $1.50 for the base charge, and run equally about $1.50 per mile after that. Uber’s just about the same, with some cities going as low as $0.75 a mile, while others tip out at about $2, depending on how congested or clear the area of the town or city you’re travelling in might be."}]