[{"url": "https://www.gov.uk/police-powers-of-arrest-your-rights", "passage_text": "Police powers of arrest: your rights. To arrest you the police need reasonable grounds to suspect you’re involved in a crime for which your arrest is necessary. The police have powers to arrest you anywhere and at any time, including on the street, at home or at work. "}, {"url": "https://www.citizensadvice.org.uk/law-and-rights/legal-system/police/police-powers/", "passage_text": "But the police do not have the right to stop and search you just because of your race or religious background. When the police stop and search you, they must provide you with the following information before the search can begin: 1  proof of their warrant card. 2  information on police powers to stop and search. 3  information on your rights. 4  the police officer's name and police station. 5  the reason for the search"}, {"url": "http://www.police.qld.gov.au/programs/roadSafety/drugDriving.htm", "passage_text": "If a police officer reasonably suspects that your driving ability has been impaired by any drug you may be required to provide a specimen of blood for analysis. If you fail to provide a specimen as required, or a drug is detected in your blood, you will be charged and required to appear in court. "}, {"url": "http://ctb.ku.edu/en/table-of-contents/advocacy/direct-action/letters-to-elected-officials/main", "passage_text": "Maybe you're not convinced that writing a letter to your elected official is the best way to spend your time. There are several reasons it’s worth your while, including: 1  To explain to an official how a particular issue affects you or your group. 2  To express support for a proposed law, policy, or course of action. If you are writing to an elected official, show respect for the position by using the title of the office, and the official's full name. In any other letter, use the familiar term Dear, the title Mr., Mrs., Ms., Miss, or Dr."}, {"url": "http://drivesmartbc.ca/police/qa-making-driving-complaint-police", "passage_text": "If the driving behaviour is serious and could result in immediate harm to others call 911 and make the report immediately. If this is not the case, a call to the police non-emergency number as soon as reasonably possible is sufficient. After you have provided the particulars of your case, ask for and record the file number of your complaint. I'm sure that we've all felt that way at one time or another but haven't followed through because we didn't know if it was worthwhile or if anything would happen to the offending driver if we did. Here is what you need to know in order to make an effective driving complaint to police in BC."}, {"url": "https://www.citizensadvice.org.uk/scotland/law-and-rights/legal-system-s/police-s/police-powers-s/", "passage_text": "The police can also stop and search you or your vehicle if they reasonably suspect you of terrorist activity. They can't stop and search you just for being in a particular area, unless they reasonably suspect you of terrorist activity. A police officer can search someone in the street if the person consents to the search. The police officer should always make it clear that consent is being asked for. Unless you agree, the search should not take place."}, {"url": "http://drivesmartbc.ca/police/qa-making-driving-complaint-police", "passage_text": "If you report as an anonymous complainant, all that the police can do is patrol the area of your complaint and react to something that they see the suspect vehicle do, if anything. This type of complaint is usually assigned a low priority. I'm sure that we've all felt that way at one time or another but haven't followed through because we didn't know if it was worthwhile or if anything would happen to the offending driver if we did. Here is what you need to know in order to make an effective driving complaint to police in BC."}, {"url": "http://www.cab.org.nz/vat/gl/roi/Pages/Policeandtheindividual.aspx", "passage_text": "Whether you are required to give Police information, and what kinds of information is required, depends on whether you have been arrested. If you have not been arrested 1  : If you are driving, the Police can stop the vehicle and ask you for your name, address and birth date. 2  If you don’t own the vehicle the Police can also require you to tell them who the owner is. When laying a complaint, whether to your local Police or to the IPCA, ensure you have included as much relevant information as possible such as: 1  your name and contact details, 2  a description of what happened, 3  the date, time and location of the incident, 4  the names of anyone involved, or anyone who could help you resolve your complaint, 5  the name 6  ... d"}, {"url": "http://www.urban75.org/legal/complaints.html", "passage_text": "(There are other actions you can take, which are discussed below.) Information on how to do this can be found at the Independent Police Complaints Commission (IPCC) website. This guide is based on material posted on the Police Complaints Authority (PCA) website, which was replaced by the IPCC in 2004. "}]