[{"url": "http://www1.salary.com/Social-Services-Director-salary.html", "passage_text": "The annual salary for someone with the job title Social Services Director may vary depending on a number of factors including industry, company size, location, years of experience and level of education. For example the median expected annual pay for a typical Social Services Director in the United States is $103,192 so 50% of the people who perform the job of Social Services Director in the United States are expected to make less than $103,192."}, {"url": "http://www1.salary.com/Human-Services-Worker-salary.html", "passage_text": "The annual salary for someone with the job title Human Services Worker may vary depending on a number of factors including industry, company size, location, years of experience and level of education. For example the median expected annual pay for a typical Human Services Worker in the United States is $25,782 so 50% of the people who perform the job of Human Services Worker in the United States are expected to make less than $25,782. Source: HR Reported data as of September 2015. Median $25,782. 1  Salary"}, {"url": "http://online.shorter.edu/human-services/human-services-salary-what-to-expect-with-your-degree/", "passage_text": "Substance abuse counselors come in between the national average for all occupations and community and social service occupations. The national median salary for all positions is $33,840 and the median salary for all community and social service occupations is $39,280. The top 10 percent of program directors made more than $96,920 and the bottom 10 percent earned less than $34,330. Compared to other management positions, human services program directors are underpaid. The median annual wage for all management occupations in May 2010 was $91,440."}, {"url": "http://www.schools.com/news/social-and-human-service-assistants-salary-career-outlook.html", "passage_text": "Social and human service assistant salary info. The BLS reports that the mean annual salary for social and human service assistants in the U.S. was $31,280 in 2013, with the lowest 10 percent earning up to $19,620 and the top 10 percent earning $46,620 and more for the year. "}, {"url": "http://online.shorter.edu/human-services/human-services-salary-what-to-expect-with-your-degree/", "passage_text": "However, human services program directors still earn well above the national median wage for all occupations, which was $22,840 in May 2010. Wages vary by area for program directors, as well. The table below shows a breakdown of salaries by industry. The top 10 percent of program directors made more than $96,920 and the bottom 10 percent earned less than $34,330. Compared to other management positions, human services program directors are underpaid. The median annual wage for all management occupations in May 2010 was $91,440."}, {"url": "http://www.humanservicesedu.org/human-services-salary.html", "passage_text": "There are a wide range of Human Services salaries based on occupation, and there are also some substantial distinctions within different career tracks based on location, experience, licensure and educational background. Below we have aggregated a number of Human Services salaries based on position. The range of salaries for a Family and Human Development worker depending on the state and employer ranges from $34,440 to $47,790. For more information on the Family and Human Development Worker click here :"}, {"url": "http://www.simplyhired.com/salaries-k-human-services-jobs.html", "passage_text": "Average Human Services Salaries. The average salary for human services jobs is $54,000. Average human services salaries can vary greatly due to company, location, industry, experience and benefits. This salary was calculated using the average salary for all jobs with the term human services anywhere in the job listing."}]