[{"url": "http://themedicalbiochemistrypage.org/aminoacidderivatives.php", "passage_text": "The tissue from which the neurotransmitter/hormone is derived expresses a specific set, or all, of these enzymes such that only dopamine (substantia nigra) is the result, or only norepinephrine (locus coeruleus), or both norepinephrine and epinephrine (adrenal medulla). Tryptophan-Derived Neurotransmitters. Tryptophan serves as the precursor for the synthesis of serotonin (5-hydroxytryptamine, 5-HT, see also Biochemistry of Nerve Transmission) and melatonin (N-acetyl-5-methoxytryptamine). Pathway for serotonin and melatonin synthesis from tryptophan."}, {"url": "http://www.news-medical.net/health/What-is-Serotonin.aspx", "passage_text": "Serotonin is a monoamine transmitter called 5 hydroxytryptamine (5-HT) and is derived from tryptophan. It was first discovered by Vittorio Erspamer in Rome in 1935 and American scientists corroborated the findings in the late 1940s. "}, {"url": "http://www.merriam-webster.com/dictionary/melatonin", "passage_text": ": a vertebrate hormone C13H16N2O2 that is derived from serotonin, is secreted by the pineal gland especially in response to darkness, and has been linked to the regulation of circadian rhythms. Definition of MELATONIN. : a vertebrate hormone that is derived from serotonin, is secreted by the pineal gland especially in response to darkness, and has been linked to the regulation of circadian rhythms. See melatonin defined for kids. ADVERTISEMENT. Greek melas black + -tonin (as in serotonin)."}, {"url": "http://www.answers.com/Q/Which_amine_hormone_derived_from_serotonin", "passage_text": "This chemical also regulates eating and aggression; it can contribute to depression … . A neurotransmitter, derived from Tryptophan, that is involved in sleep, depression, memory, and other neurological processes. I assume you mean serotonin, which is a neurotransmitter in your body. To do this, the impulse triggers the release of a transmitter chemical (such as serotonin) from the end of the neurone into the synapse. 3. These transmitter chemical molecules diffuse across the gap between the two neurones, and bind to special receptor molecules on the membrane (outer skin) of the next neurone. 4."}, {"url": "http://www.thefreedictionary.com/melatonin", "passage_text": "A hormone, C 13 H 16 N 2 O 2, derived from serotonin and produced by the pineal gland. It stimulates color change in the epidermis of amphibians and reptiles and plays a role in the function of circadian rhythms and estrous cycles in mammals. Noun. 1. melatonin-hormone secreted by the pineal gland. endocrine, hormone, internal secretion-the secretion of an endocrine gland that is transmitted by the blood to the tissue on which it has a specific effect. Translations. n melatonina."}, {"url": "https://en.wikipedia.org/wiki/Serotonin", "passage_text": "Serotonin /ˌsɛrəˈtoʊnɨn/ or 5-hydroxytryptamine (5-HT) is a monoamine neurotransmitter. Biochemically derived from tryptophan, serotonin is primarily found in the gastrointestinal tract (GI tract), blood platelets, and the central nervous system (CNS) of animals, including humans. It is popularly thought to be a contributor to feelings of well-being and happiness. Serotonin secreted from the enterochromaffin cells eventually finds its way out of tissues into the blood. There, it is actively taken up by blood platelets, which store it."}, {"url": "https://en.wikipedia.org/wiki/Serotonin", "passage_text": "Serotonin's presence in insect venoms and plant spines serves to cause pain, which is a side-effect of serotonin injection. Serotonin is produced by pathogenic amoebae, and its effect on the gut causes diarrhea. Serotonin secreted from the enterochromaffin cells eventually finds its way out of tissues into the blood. There, it is actively taken up by blood platelets, which store it."}, {"url": "http://www.vivo.colostate.edu/hbooks/pathphys/endocrine/otherendo/pineal.html", "passage_text": "The precursor to melatonin is serotonin, a neurotransmitter that itself is derived from the amino acid tryptophan. Within the pineal gland, serotonin is acetylated and then methylated to yield melatonin. Synthesis and secretion of melatonin is dramatically affected by light exposure to the eyes. The pineal gland or epiphysis synthesizes and secretes melatonin, a structurally simple hormone that communicates information about environmental lighting to various parts of the body."}, {"url": "http://www.interactive-biology.com/3931/basics-of-hormone-classification/", "passage_text": "They are commonly derived from tyrosine and tryptophan. There are two types of tyrosine derived hormones: thyroid hormone and catecholamines. Thyroid hormone is one of the most important in the body because it regulates the development of organs and metabolism. Norepinephrine and epinephrine are catecholamines. Both are stress hormones and are also neurotransmitters."}]