[{"url": "http://www.webopedia.com/TERM/C/COBOL.html", "passage_text": "Acronym for common business oriented language. Developed in the late 1950s and early 1960s, COBOL is the second-oldest high-level programming language (FORTRAN is the oldest). It is particularly popular for business applications that run on large computers."}, {"url": "http://groups.engin.umd.umich.edu/CIS/course.des/cis400/cobol/cobol.html", "passage_text": "History. COBOL (Common Business Oriented Language) was one of the earliest high-level programming languages. It was developed in 1959 by a group of computer professionals called the Conference on Data Systems Languages (CODASYL). Since 1959 it has undergone several modifications and improvements. The language continues to evolve today. Object-oriented COBOL is a subset of COBOL 97, which is the fourth edition in the continuing evolution of ANSI/ISO standard COBOL. COBOL 97 includes conventional improvements as well as object-oriented features."}, {"url": "http://www.pgrocer.net/Cis12/cobollan.html", "passage_text": "1 A COBOL program is written in an English type language that cannot be understood by the machine, therefore it has to be translated using a compiler. 2  A compiler translates the code all at once and produces a machine version of the program. 1 This translation is done with a compiler that reads the high level COBOL language of the SOURCE PROGRAM and converts each high level COBOL instruction into one or more machine language instructions. 2  The OBJECT PROGRAM is the result."}, {"url": "https://en.wikipedia.org/wiki/COBOL", "passage_text": "COBOL is an industry language and is not the property of any company or group of companies, or of any organization or group of organizations. No warranty, expressed or implied, is made by any contributor or by the CODASYL COBOL Committee as to the accuracy and functioning of the programming system and language. COBOL has an English-like syntax, which was designed to be self-documenting and highly readable. However, it is verbose and uses over 300 reserved words. In contrast with modern, succinct syntax like y = x; , COBOL has a more English-like syntax (in this case, MOVE x TO y). COBOL code is split into four divisions (identification, environment, data and procedure) containing a rigid hierarchy of sections, paragraphs and sentences"}, {"url": "https://en.wikipedia.org/wiki/COBOL", "passage_text": "COBOL is primarily used in business, finance, and administrative systems for companies and governments. In 1997, Gartner Group estimated that there were a total of 200 billion lines of COBOL in existence, which ran 80% of all business programs. COBOL has an English-like syntax, which was designed to be self-documenting and highly readable. However, it is verbose and uses over 300 reserved words. In contrast with modern, succinct syntax like y = x; , COBOL has a more English-like syntax (in this case, MOVE x TO y). COBOL code is split into four divisions (identification, environment, data and procedure) containing a rigid hierarchy of sections, paragraphs and sentence"}, {"url": "https://en.wikipedia.org/wiki/COBOL", "passage_text": "COBOL (/ˈkoʊbɒl/ , an acronym for co mmon b usiness-o riented l anguage) is a compiled English-like computer programming language designed for business use. COBOL has an English-like syntax, which was designed to be self-documenting and highly readable. However, it is verbose and uses over 300 reserved words. In contrast with modern, succinct syntax like y = x; , COBOL has a more English-like syntax (in this case, MOVE x TO y). COBOL code is split into four divisions (identification, environment, data and procedure) containing a rigid hierarchy of sections, paragraphs and sentences"}, {"url": "http://www.csis.ul.ie/COBOL/Course/COBOLIntro.htm", "passage_text": "COBOL programming site with a comprehensive set of COBOL tutorials making a full COBOL course as well as COBOL lecture notes, COBOL programming exercises with sample solutions, COBOL programming exam specifications with model answers, COBOL project specifications, and over 50 example COBOL programs. "}]