[{"url": "https://answers.yahoo.com/question/index?qid=20111231131920AAHezta", "passage_text": "Most people make Cream Cheese Frosting for their Carrot Cake. Here's a simple recipe for it: 1 cube butter-room temp 1 (8 oz) pkg cream cheese-room temp 1 box powdered sugar-sifted 1 tsp vanilla Beat the butter and cream cheese. Add the vanilla and beat again. Add the powdered sugar and beat until spreading consistency."}, {"url": "http://snippets.com/what-kind-of-icing-goes-on-carrot-cake.htm", "passage_text": "Realistically, you could put any icing you wanted on a carrot cake. The wonderful beauty of cooking is that you can make it to your liking. But, the traditional icing that most people put on carrot cake is cream cheese icing. You can find this icing at the store, or look up a recipe to make it yourself."}, {"url": "http://www.wedding-cakes-for-you.com/carrotcakeicing.html", "passage_text": "I crumb coat the cake in a thick layer of the carrot cake frosting, put it in the fridge for a few hours and then finish the cake with my best Italian meringue frosting. If you don't have a large mixer than you will have to do this in smaller batches. 2 1/2 lbs. cream cheese."}, {"url": "https://answers.yahoo.com/question/index?qid=20111231131920AAHezta", "passage_text": "Report Abuse. Most people make Cream Cheese Frosting for their Carrot Cake. Here's a simple recipe for it: 1 cube butter-room temp 1 (8 oz) pkg cream cheese-room temp 1 box powdered sugar-sifted 1 tsp vanilla Beat the butter and cream cheese. Add the vanilla and beat again. Add the powdered sugar and beat until spreading consistency."}, {"url": "http://snippets.com/what-kind-of-icing-goes-on-carrot-cake.htm", "passage_text": "Answer by joantheresa (1421). The usual icing for carrot cake is Cream Cheese Frosting, and it is very tasty. To make it you mix 1 3-ounce package cream cheese with 1/4 cup of butter or margarine and one teaspoon of vanilla. Mix until light and fluffy. Gradually add in 2 cups sifted confectioner's (powdered) sugar."}]