[{"url": "https://en.wikipedia.org/wiki/H-reflex", "passage_text": "The H-reflex (or Hoffmann's reflex) is a reflectory reaction of muscles after electrical stimulation of sensory fibers (Ia afferents stemming from muscle spindles) in their innervating nerves (for example, those located behind the knee). After about 5 days in zero gravity, for instance in orbit around Earth, the h-reflex diminishes significantly. It is generally assumed that this is due to a marked reduction in the excitability of the spinal cord in zero gravity."}, {"url": "http://www.sciencedirect.com/science/article/pii/S1388245710002737", "passage_text": "We have studied the soleus H-reflex elicited by stimulation of the S1 nerve root at the S1 foramen. The normal values for the S1-foramen H-reflex have been reported in a previous study, but there are no definitive reports in patients with S1 radiculopathy. In 1918, Hoffmann originally described the H-reflex occurring in calf muscles of humans on stimulation of the tibial nerve in the popliteal fossa. Hugon described a standardised technique for soleus H-reflex testing (Hugon, 1973)."}, {"url": "https://en.wikipedia.org/wiki/H-reflex", "passage_text": "The primary difference between the H-reflex and the spinal stretch reflex is that the H-reflex bypasses the muscle spindle, and, therefore, is a valuable tool in assessing modulation of monosynaptic reflex activity in the spinal cord.. After about 5 days in zero gravity, for instance in orbit around Earth, the h-reflex diminishes significantly. It is generally assumed that this is due to a marked reduction in the excitability of the spinal cord in zero gravity."}, {"url": "http://www.ncbi.nlm.nih.gov/pubmed/19942720", "passage_text": "Increased H-reflex response induced by intramuscular electrical stimulation of latent myofascial trigger points. Ge HY, Serrao M, Andersen OK, Graven-Nielsen T, Arendt-Nielsen L. Comment in Acupunct Med. 2009 Dec;27(4):148-9. "}, {"url": "http://www.sciencedirect.com/science/article/pii/S1388245710002737", "passage_text": "The aim of this study was to evaluate the role of the soleus H-reflex elicited by electrical stimulation of the S1 nerve root in the determination of S1 radiculopathy, and to compare the diagnostic sensitivity for S1 radiculopathy between the S1 nerve H-reflex and conventional tibial nerve H-reflex. In 1918, Hoffmann originally described the H-reflex occurring in calf muscles of humans on stimulation of the tibial nerve in the popliteal fossa. Hugon described a standardised technique for soleus H-reflex testing (Hugon, 1973)."}, {"url": "http://www.dartmouth.edu/~dons/electrodiagnosis/Electrodiagnosis.html", "passage_text": "The H-reflex is most commonly tested by electrical stimulation of the tibial nerve, with recordings from the gastrocnemius/soleus muscle complex (i.e., the triceps surae) (Figure 6). Therefore, this response utilizes the same neural pathway as the ankle jerk reflex. Since the H-reflex is mediated primarily over the S1 nerve root (just like the ankle jerk reflex), it is a sensitive test for S1 radiculopathy. However, once the reflex arc has been damaged, it often does not return to normal (making the test less useful in investigating the question of recurrent radiculopathy)."}, {"url": "https://en.wikipedia.org/wiki/H-reflex", "passage_text": "That response is usually a clear wave, called H-wave, 28-35 ms after the stimulus, not to be confused with an F-wave. An M-wave, an early response, occurs 3-6 ms after the onset of stimulation. The H and F-waves are later responses. After about 5 days in zero gravity, for instance in orbit around Earth, the h-reflex diminishes significantly. It is generally assumed that this is due to a marked reduction in the excitability of the spinal cord in zero gravity."}, {"url": "https://en.wikipedia.org/wiki/H-reflex", "passage_text": "The H-reflex test is performed using an electric stimulator, which gives usually a square-wave current of short duration and small amplitude (higher stimulations might involve alpha fibers, causing an F-wave, compromising the results), and an EMG set, to record the muscle response. After about 5 days in zero gravity, for instance in orbit around Earth, the h-reflex diminishes significantly. It is generally assumed that this is due to a marked reduction in the excitability of the spinal cord in zero gravity."}, {"url": "http://www.sciencedirect.com/science/article/pii/S1388245710002737", "passage_text": "The H-reflex on stimulation of the tibial nerve in the popliteal fossa is routinely used in the diagnosis of first sacral (S1) nerve-root radiculopathy. The H-reflex latency, however, is considered to lack sensitivity since a small change from the focal root pathology can be diluted in a relatively long reflex latency. In 1918, Hoffmann originally described the H-reflex occurring in calf muscles of humans on stimulation of the tibial nerve in the popliteal fossa. Hugon described a standardised technique for soleus H-reflex testing (Hugon, 1973)."}]