[{"url": "http://www.bls.gov/ooh/architecture-and-engineering/civil-engineers.htm", "passage_text": "What Civil Engineers Do About this section. Civil engineers design major transportation projects. Civil engineers design, construct, supervise, operate, and maintain large construction projects and systems, including roads, buildings, airports, tunnels, dams, bridges, and systems for water supply and sewage treatment. Many civil engineers work in design, construction, research, and education. Civil engineers must first complete a bachelor’s degree in civil engineering or one of its specialties. A program accredited by ABET is needed in order to gain licensure, which is required to work as a professional engineer (PE)."}, {"url": "http://www.youtube.com/watch?v=cJaRjI7K-Lw", "passage_text": "If you look around, civil engineering is everywhere! Meet three civil engineers whose work is having a real impact on people's lives. Whether involved in projects underground, on huge structures or meeting the water needs of developing communities, these engineers are making a difference. See if you have what it takes to be a civil engineer. "}, {"url": "https://en.wikipedia.org/wiki/Civil_engineering", "passage_text": "Civil engineering is a professional engineering discipline that deals with the design, construction, and maintenance of the physical and naturally built environment, including works like roads, bridges, canals, dams, and buildings. Civil engineers typically possess an academic degree in civil engineering. The length of study is three to five years, and the completed degree is designated as a bachelor of engineering, or a bachelor of science."}, {"url": "http://www.wisegeek.org/what-is-civil-engineering.htm", "passage_text": "Civil engineering is one of the oldest engineering disciplines, since civil engineers of one form or another have been around ever since humans started building major public works such as roads, bridges, tunnels, and large public buildings. A civil engineer may analyze the conception and design of a project. It is a civil engineer's job to ensure that building structures are safe and functional. A civil engineer who focuses on transportation may specialize in building roads."}, {"url": "http://www.wikihow.com/Become-a-Civil-Engineer", "passage_text": "Civil engineering is an exciting career with opportunities in many different areas. Some civil engineers work in the field, some work in offices doing design, and others work in a combination of the two. Here are some helpful steps to starting your career as a civil engineer. "}, {"url": "http://civil.columbia.edu/what-civil-engineering", "passage_text": "Civil engineering is arguably the oldest engineering discipline. It deals with the built environment and can be dated to the first time someone placed a roof over his or her head or laid a tree trunk across a river to make it easier to get across. And they plan and oversee the construction of these facilities as construction managers. Civil engineering is an exciting profession because at the end of the day you can see the results of your work, whether this is a completed bridge, a high-rise building, a subway station, or a hydroelectric dam."}, {"url": "http://www.livescience.com/47612-civil-engineering.html", "passage_text": "Civil engineering is the design and construction of public works, such as dams, bridges and other large infrastructure projects. It is one of the oldest branches of engineering, dating back to when people first started living in permanent settlements and began shaping their environments to suit their needs. Civil engineers design, construct, supervise, operate and maintain large construction projects and systems, including roads, buildings, airports, tunnels, dams, bridges, and systems for water supply and sewage treatment, according to the U.S. Bureau of Labor Statistics (BLS)."}, {"url": "https://en.wikipedia.org/wiki/Civil_engineer", "passage_text": "A civil engineer is a person who practices civil engineering – the application of planning, designing, constructing, maintaining, and operating infrastructures while protecting the public and environmental health, as well as improving existing infrastructures that have been neglected. "}, {"url": "http://www.asce.org/about_civil_engineering/", "passage_text": "Share. Civil engineers design, build, and maintain the foundation for our modern society – our roads and bridges, drinking water and energy systems, sea ports and airports, and the infrastructure for a cleaner environment, to name just a few. Civil engineering touches us throughout our day. Think of a civil engineer when you: "}, {"url": "http://www.bls.gov/ooh/architecture-and-engineering/civil-engineers.htm", "passage_text": "What Civil Engineers Do. Civil engineers design, construct, supervise, operate, and maintain large construction projects and systems, including roads, buildings, airports, tunnels, dams, bridges, and systems for water supply and sewage treatment. Many civil engineers work in design, construction, research, and education. Civil engineers must first complete a bachelor’s degree in civil engineering or one of its specialties. A program accredited by ABET is needed in order to gain licensure, which is required to work as a professional engineer (PE)."}]