[{"url": "http://www.medicinenet.com/antiphospholipid_syndrome/article.htm", "passage_text": "Patients with antiphospholipid syndrome have both blood clots and antiphospholipid antibodies that are detectable with blood testing. Antiphospholipid syndrome is also called phospholipid antibody syndrome, cardiolipin antibody syndrome, and Hughes syndrome in honor of the doctor who first described it. It is important to note that antiphospholipid antibodies can also be found in the blood of individuals without any disease process."}, {"url": "http://www.mollysfund.org/2014/06/antiphospholipid-syndrome/", "passage_text": "As if receiving a diagnosis of lupus is not complicated and scary enough, being diagnosed with something called antiphospholipid (pronounced An-ti-fos-fo-LIP-id) syndrome (APS) can be even more confusing and scary. 1 In APS, your body produces antiphospholipid antibodies that mistakenly attack your body’s own phospholipids. 2  An antibody is a protein that is produced by the plasma (blood) cells An and used by the immune system."}, {"url": "http://www.lupus.org/answers/entry/what-are-antiphospholipid-antibodies", "passage_text": "There are several kinds of antiphospholipid antibodies. The three most widely measured are lupus anticoagulant, anticardiolipin antibody, and anti-β 2 glycoprotein I. These antibodies react with proteins in the blood that are bound to phospholipid, a type of fat molecule that is part of the normal cell membrane. Autoantibodies are antibodies that are directed against one’s self. Antiphospholipid antibodies interfere with the normal function of blood vessels, causing narrowing and irregularity of the vessel (vasculopathy), and by causing blood clots in the vessel (thrombosis)."}, {"url": "http://syndrome.org/lupus-anticoagulant-syndrome/", "passage_text": "Alternatively known as antiphospholipid antibody syndrome, lupus anticoagulant syndrome is a coagulation disorder which causes formation of thrombosis in blood vessels. In very uncommon circumstances, lupus anticoagulant syndrome causes a person to develop rapid organ failure as a result of generalized thrombosis. This stage of condition is referred as catastrophic antiphospholipid syndrome."}, {"url": "http://www.mollysfund.org/2014/06/antiphospholipid-syndrome/", "passage_text": "1 cell together. 2  Within these phospholipids, antibodies play a role in how quickly or slowly blood clots. 3  In APS, your body produces antiphospholipid antibodies that mistakenly attack your body’s own phospholipids. 4  An antibody is a protein that is produced by the plasma (blood) cells An and used by the immune system. 1 In APS, your body produces antiphospholipid antibodies that mistakenly attack your body’s own phospholipids. 2"}, {"url": "http://www.mollysfund.org/2014/06/antiphospholipid-syndrome/", "passage_text": "1 An antibody is a protein that is produced by the plasma (blood) cells An and used by the immune system. 2  The antibodies seek out and target antigens (foreign objects such as viruses and bacteria). 3  Some examples of antigens include: microorganisms like bacteria, fungi, parasites, viruses, and chemicals. 1 In APS, your body produces antiphospholipid antibodies that mistakenly attack your body’s own phospholipids. 2 "}, {"url": "http://www.webmd.com/lupus/tc/lupus-and-antiphospholipid-antibody-syndrome-topic-overview", "passage_text": "About 1 out of 3 people with lupus produce an antibody that attacks certain blood-clotting factors, which can cause the blood to clot easily. A person who has this antibody and has had blood clots is said to have antiphospholipid antibody syndrome. This can lead to mild or severe blood-clotting complications, including: 1  Stroke, transient ischemic attack (TIA) , or heart attack. 2  Deep vein thrombosis or pulmonary embolism."}, {"url": "http://www.hopkinslupus.org/lupus-tests/antiphospholipid-antibodies/", "passage_text": "The presence of an antiphospholipid antibody such as the lupus anticoagulant and anticardiolipin antibody in an individual is associated with a predisposition for blood clots. Blood clots can form anywhere in the body and can lead to stroke, gangrene, heart attack, and other serious complications. Antiphospholipid Antibody Syndrome (APS). Individuals who experience complications from antiphospholipid antibodies are diagnosed with Antiphospholipid Antibody Syndrome (APS). This condition can occur both in people with lupus and those without lupus. Fifty percent of people with lupus have APS."}, {"url": "http://www.hopkinslupus.org/lupus-tests/antiphospholipid-antibodies/", "passage_text": "Antiphospholipid Antibodies. Antiphospholipid antibodies are antibodies directed against phosphorus-fat components of your cell membranes called phospholipids, certain blood proteins that bind with phospholipids, and the complexes formed when proteins and phospholipids bind. Antiphospholipid Antibody Syndrome (APS). Individuals who experience complications from antiphospholipid antibodies are diagnosed with Antiphospholipid Antibody Syndrome (APS). This condition can occur both in people with lupus and those without lupus. Fifty percent of people with lupus have APS."}, {"url": "https://en.wikipedia.org/wiki/Antiphospholipid_syndrome", "passage_text": "Antiphospholipid syndrome is an autoimmune disease, in which antiphospholipid antibodies (anticardiolipin antibodies and lupus anticoagulant) react against proteins that bind to anionic phospholipids on plasma membranes. Like many autoimmune diseases, it is more common in women than in men. Antiphospholipid syndrome often requires treatment with anticoagulant medication such as heparin to reduce the risk of further episodes of thrombosis and improve the prognosis of pregnancy."}]