[{"url": "http://www.oxforddictionaries.com/definition/english/marginalize", "passage_text": "1 The term ethnic minority is often used to refer to marginalized cultural groups. 2  Literature that is widely taught today includes writings by women and members of other historically marginalized groups. Treat (a person, group, or concept) as insignificant or peripheral: by removing religion from the public space, we marginalize it (as adjective marginalized) members of marginalized cultural groups. More example sentences. 1 "}, {"url": "http://www.thefreedictionary.com/Marginalized+group", "passage_text": "Noun. 1. marginalization-the social process of becoming or being made marginal (especially as a group within the larger society); the marginalization of the underclass; the marginalization of literature. marginalisation. social process-a process involved in the formation of groups of persons. "}, {"url": "http://www.businessdictionary.com/definition/marginalization.html", "passage_text": "Definition. The process whereby something or someone is pushed to the edge of a group and accorded lesser importance. This is predominantly a social phenomenon by which a minority or sub-group is excluded, and their needs or desires ignored. The marginalization of black people as a whole went on unopposed throughout much of the twentieth century, fortunately things are improving."}, {"url": "http://www.oxforddictionaries.com/definition/english/marginalize", "passage_text": "verb. Treat (a person, group, or concept) as insignificant or peripheral: by removing religion from the public space, we marginalize it (as adjective marginalized) members of marginalized cultural groups. More example sentences. 1  The term ethnic minority is often used to refer to marginalized cultural groups."}, {"url": "http://www.merriam-webster.com/dictionary/marginalize", "passage_text": "Full Definition of MARGINALIZE. transitive verb. : to relegate to an unimportant or powerless position within a society or group. — mar·gin·al·i·za·tion \\ˌmaerj-ˌmärj-nə-lə-ˈzā, shən-ˌmaer-ˌmär-jə-\\ nəl. ə noun see marginalize Defined-for english. Language learners see marginalize defined. for kids "}, {"url": "http://www.uua.org/governance/polity/47014.shtml", "passage_text": "Marginalized Groups. How power is used in negotiating difference is among the most difficult of all issues faced by institutions-particularly those that choose to be in voluntary association such as religious institutions. "}, {"url": "https://en.wikipedia.org/wiki/Marginalization", "passage_text": "Social exclusion (or marginalization) is social disadvantage and relegation to the fringe of society. It is a term used widely in Europe, and was first used in France. It is used across disciplines including education, sociology, psychology, politics and economics. “Social exclusion is about the inability of our society to keep all groups and individuals within reach of what we expect as a society...[or] to realise their full potential.."}, {"url": "https://answers.yahoo.com/question/index?qid=20081202183031AAFvtnH", "passage_text": "Asker's rating. Report Abuse. Marginalization is the social process of becoming or being made marginal (to relegate or confine to a lower social standing or outer limit or edge, as of social standing); the marginalization of the underclass; marginalization of literature and many other are some examples. Marginalization involves people being denied degrees of power. Marginalization has the potential to result in severe material deprivation, and in its most extreme form can exterminate groups.. To dumb it down, marginalization is basically being treated like a 3rd class citizen."}, {"url": "http://www.right-to-education.org/issue-page/marginalised-groups", "passage_text": "Marginalised groups are often left behind by national educational policies, denying many people their right to education. Although thinking about groups can be helpful, the distinction is somewhat artificial. People who are marginalised are very likely to be subject to multiple layers of discrimination, that is, they belong to more than one marginalised group. Non-discrimination and equality are key human rights principles that apply to the"}, {"url": "http://www.sociologyguide.com/civil-society/marginalization.php", "passage_text": "Home Civil Society Marginalization and role of civil society. Marginalization has been defined as a complex process of relegating specific groups of people to the lower or outer edge of society. It effectively pushes these groups of people to the margin of society economically, politically, culturally and socially following the policy of exclusion. "}]