[{"url": "http://www.bloomberg.com/research/stocks/private/snapshot.asp?privcapId=25029", "passage_text": "In addition, the company operates POS devices network of Argentina, which captures credit card and other types of transactions. First Data Cono Sur SA was formerly known as Argencard S.A. and changed its name to First Data Cono Sur SA in 2007. The company was founded in 1971 and is based in Buenos Aires, Argentina. As of December 11, 2006, First Data Cono Sur SA operates as a subsidiary of First Data International Incorporated"}, {"url": "http://www.bloomberg.com/research/stocks/private/snapshot.asp?privcapId=25029", "passage_text": "First Data Cono Sur SA provides card issuing and merchant acquiring services supporting various banks, cardholders, and merchants. The company also offers issuing, processing, and acquiring MasterCard cards in Argentina and Uruguay. First Data Cono Sur SA was formerly known as Argencard S.A. and changed its name to First Data Cono Sur SA in 2007. The company was founded in 1971 and is based in Buenos Aires, Argentina."}, {"url": "https://www.flexjobs.com/jobs/telecommuting-jobs-at-first_data", "passage_text": "First Data, based in Atlanta, Georgia, is a global payment processing company founded in 1971. First Data processes more than 2,000 financial transactions each second and serves clients in more than 70 countries around the world. First Data maintains a team of nearly 25,000 owner-associates to provide payment technology and processing solutions to over six million customers including financial institutions, small businesses, merchants, and multinational corporations worldwide."}, {"url": "http://www.privco.com/private-company/first-data-corporation", "passage_text": "Privately-held First Data Corporation is a global technology and payments processing leader, serving more than 6 million merchant locations, thousands of card issuers and millions of consumers worldwide. 1 That's the idea behind CartoDB, to make any location data easy to visualize quickly and intuitively. 2  First Data Corp., a payments technology company, is looking to pull in $2.5 billion in an IPO that could come as early as the end of the month."}, {"url": "https://en.wikipedia.org/wiki/First_Data", "passage_text": "First Data Corporation was incorporated in 1971. In 1980, American Express Information Services Corporation (ISC) bought 80% of First Data. The remaining 20% was purchased in 5% increments each subsequent year until June 1983. First Data Corporation spun off from American Express and went public in 1992. However, the company's LBO was financed with $24 billion in debt, and it remains heavily leveraged. In June 2014, First Data raised a historic $3.5 billion private placement. $1.2 billion of the placement came from KKR; however the majority, $2.3 billion, was from hedge funds, mutual funds and institutions."}, {"url": "https://en.wikipedia.org/wiki/First_Data", "passage_text": "First Data Corporation is a global payment technology solutions company headquartered in Atlanta, Georgia, United States. The company's STAR interbank network offers PIN-secured debit acceptance at ATM and retail locations. First Data has a global footprint of 6 million merchants, the largest in the payments industry. However, the company's LBO was financed with $24 billion in debt, and it remains heavily leveraged. In June 2014, First Data raised a historic $3.5 billion private placement. $1.2 billion of the placement came from KKR; however the majority, $2.3 billion, was from hedge funds, mutual funds and institutions."}, {"url": "http://www.hoovers.com/company-information/cs/company-profile.First_Data_Corporation.bd4b684a831cf684.html", "passage_text": "First Data Corporation Company Profile. Paper, plastic, or digital -- in whatever form, First Data moves the money. One of the world's largest electronic payments processors, First Data serves more than 6 million merchants and some 4,000 card issuers in some 35 countries. ), electronic bill payment management, and point-of-sale (POS) services. First Data operates through three primary segments: retail and alliance services, financial services, and international. It owns a majority stake in."}, {"url": "https://en.wikipedia.org/wiki/First_Data", "passage_text": "In October 2014, First Data launched First Data Salutes. First Data Salutes is the company-wide military engagement strategy aimed at helping the veteran-owned business community and service members and their families transitioning to civilian careers. However, the company's LBO was financed with $24 billion in debt, and it remains heavily leveraged. In June 2014, First Data raised a historic $3.5 billion private placement. $1.2 billion of the placement came from KKR; however the majority, $2.3 billion, was from hedge funds, mutual funds and institutions."}, {"url": "http://www.bloomberg.com/research/stocks/private/snapshot.asp?privcapId=28532", "passage_text": "First Data Corporation also provides money transmission services; operates payment systems and related technologies in the government sector; and provides electronic tax payment processing services. The company was founded in 1989 and is headquartered in Atlanta, Georgia. Sep 28 15. First Data Corporation, has collaborated with Google to support Android Pay. First Data will provide processing solutions for Android Pay that ensure a safe, secure transaction at the point of sale, enabling payment with a single, contactless tap."}]