[{"url": "http://www.yourdentistryguide.com/orthodontics-advantage/", "passage_text": "Products such as Invisalign or Clear Correct may cost more than traditional braces, but they typically range from $3,500 to $6,000; the latter tending to be the national average cost. Costs vary due to the severity of the orthodontic problem, as well as the regional differences in fees."}, {"url": "http://www.yourdentistryguide.com/braces-faq/", "passage_text": "The cost for Invisalign Teen treatment is approximately $5,000, which is about the same as the cost for traditional braces. Invisalign Express treatment requires fewer aligners than the full treatment, so the cost is less and ranges between $1,800 and $3,500, with $2,500 being the average."}, {"url": "https://www.deltadentalins.com/oral_health/adultBraces.html", "passage_text": "Braces aren't just for teenagers – it’s never too late to improve your dental health and beautify your smile. About 1 million Americans over the age of 18 wear braces. Your general dentist can help you determine if orthodontic treatment is the right option for you."}, {"url": "https://www.deltadentalins.com/oral_health/adultBraces.html", "passage_text": "As with children, adults may need to wear a retainer to maintain the results of treatment after braces are removed. The cost of braces depends on the type you select. On average, metal braces cost $5,000 to $6,000. Keep in mind that your out-of-pocket costs will likely be higher if you choose non-metal braces. Check your Evidence of Coverage, Summary Plan Description or Group Dental Service Contract to see if your dental plan covers orthodontic treatment for adults."}, {"url": "http://www.oralb.com/embraceit/how-much-do-braces-cost", "passage_text": "Metal braces (traditional braces) : $3,000 - 7,000. Ceramic braces : $4,000 - 8,000. Lingual braces : $8,000 - 10,000. Invisalign : $4,000 - 7,400. Prices depend on where you live – orthodontists in more rural areas are often less expensive than ones in larger cities-and may be at the orthodontist's discretion."}, {"url": "http://health.costhelper.com/braces.html", "passage_text": "1 CostHelper readers with insurance coverage for braces report paying $1,500 -$8,500 out of pocket for traditional metal braces, at an average out-of-pocket expense of $3,407. 2  Dental insurance may pay up to a specific amount for braces (typically $1,000 -$2,000) if the patient is 18 years old or younger."}, {"url": "http://www.yourdentistryguide.com/braces-faq/", "passage_text": "The cost of invisible braces is approximately the same or higher than traditional orthodontic treatment, which ranges from $2,500 to $8,000. Products such as Invisalign Full may cost more than traditional braces, but they typically range from $3,500 to $8,000. The national average cost is approximately $5,000. Costs vary due to the severity of the orthodontic problem, as well as regional differences in fees."}]