[{"url": "https://en.wikipedia.org/wiki/Kilgore_College", "passage_text": "Kilgore College (KC) is a community college located in Kilgore in Gregg County in east Texas. It has an annual enrollment in excess of 5,000 students. The school was established in 1935 at the height of the East Texas oil boom. As such, it is home to the East Texas Oil Museum which houses a large collection of memorabilia documenting this period of Texas history. It is noted for the Kilgore College Rangerettes, the first precision dance team in the world, created in 1940 by Gussie Nell Davis."}, {"url": "http://www.city-data.com/city/Kilgore-Texas.html", "passage_text": "Click to draw/clear city borders. Notable locations in Kilgore: Rangerette Showcase Museum (A) , East Texas Oil Museum at Kilgore College (B) , Kilgore Fire Department Station 2 (C) , Kilgore Fire Department Station 3 (D) , Kilgore Fire Department Central Station (E) . Display/hide their locations on the map. "}, {"url": "http://kilgorechamber.com/visit-kilgore", "passage_text": "Come visit the World’s Richest Acre that features replica oil derricks located in Downtown Kilgore or tour the East Texas Oil Museum to learn about the oil industry that put Kilgore, Texas on the map. The history of the Rangerettes is displayed at the Rangerette Museum located on the Kilgore College campus. Come VisitKilgore for a weekend, during the week or during one of our many cultural events or family fun festivals! Spring. 1  KilGogh Art Festival. 2  Avalon Faire. 3  Kilgore Film Festival. 4  Rangerette Revels."}, {"url": "https://tshaonline.org/handbook/online/articles/hek02", "passage_text": "KILGORE, TEXAS (Gregg County). Kilgore is on U.S. Highway 259 and State highways 31, 42, and 135, 120 miles east of Dallas in south central Gregg County."}, {"url": "http://www.rentals.com/Texas/Kilgore/", "passage_text": "1 Kilgore is home to the East Texas Oil Museum. 2  Located at Kilgore College, the museum provides visitors with tons of information on the oil culture and history of the area. 3  The World's Richest Acre Park is also in Kilgore and represents an area where there was large concentration of oil derricks. Find Perfect Houses for Rent in Kilgore, TX. Just south of Interstate 20 in eastern Texas is the city of Kilgore. The closest major city is Shreveport, Louisiana, but Texarkana and Dallas aren't far either. Although famous for its rich oil history, homes for rent in Kilgore are still great for families today."}, {"url": "https://tshaonline.org/handbook/online/articles/hek02", "passage_text": "In the early 1990s the town housed a major office of the Oil and Gas Division of the Railroad Commission and the headquarters of various branches of the petroleum industry. The East Texas Oil Museum and Kilgore College, the home of the famed Kilgore Rangerettes, are also located in Kilgore. BIBLIOGRAPHY: Al Eason, Boom Town: Kilgore, Texas (Kilgore Chamber of Commerce, 1979). Longview Junior Chamber of Commerce, The History of Gregg County (Fort Worth, 1957). Kilgore is on U.S. Highway 259 and State highways 31, 42, and 135, 120 miles east of Dallas in south central Gregg County."}, {"url": "http://kilgorechamber.com/visit-kilgore", "passage_text": "Welcome to Kilgore, Texas, located in the lush piney woods of East Texas. We invite you to VisitKilgore and discover what we have to offer. Kilgore was thrust into the international spotlight in the 1930’s with the discovery of one of the greatest oil fields and an acre that quickly became the richest acre in the world. The history of the Rangerettes is displayed at the Rangerette Museum located on the Kilgore College campus. Come VisitKilgore for a weekend, during the week or during one of our many cultural events or family fun festivals! Spring. 1  KilGogh Art Festival. 2  Avalon Faire. 3  Kilgore Film Festival. 4  Rangerette Revels."}, {"url": "https://en.wikipedia.org/wiki/Kilgore,_Texas", "passage_text": "Kilgore is a city in Gregg and Rusk counties in the eastern part of the U.S. state of Texas. It is the home of Kilgore College. It was the childhood residence from the age of six of the noted classical pianist Van Cliburn. The population was 12,975 at the 2010 census; a 2014 estimate placed it at 14,948. Kilgore is home to the Texas Shakespeare Festival, an annual summer repertory company. Founded in 1986. The Texas Shakespeare Festival presents four shows in rotating repertory every summer at the Van Cliburn Auditorium on the campus"}, {"url": "http://cityofkilgore.com/", "passage_text": "Welcome to Kilgore, Texas. The City of Kilgore is located in Gregg and Rusk County and is 11 miles south of the county seat of Longview and 25 miles east of Tyler. The City is approximately 120 miles east of Dallas and 60 miles west of Shreveport, Louisiana on Interstate 20. Kilgore has been identified by the Texas Legislature as the “City of Stars.” The stars that top the sixty oil derricks throughout the City are lighted during the holiday season."}]