[{"url": "http://www.merriam-webster.com/dictionary/gladiator", "passage_text": "Full Definition of GLADIATOR. 1. : a person engaged in a fight to the death as public entertainment for ancient Romans. 2. : a person engaging in a public fight or controversy. 3. : a trained fighter; especially: a professional boxer. — glad·i·a·to·ri·al \\ˌgla-dē-ə-ˈtȯr-ē-əl\\ adjective. "}, {"url": "http://www.pitara.com/science-for-kids/5ws-and-h/who-or-what-is-a-gladiator/", "passage_text": "Image of a gladiator carved on concrete wall. The first ‘gladiatorial games’ were ‘offered’ in Rome in 264 B.C by sons of Junius Brutus Pera in their father’s honour after he had died. A gladiator was either a professional fighter or a slave, trained to entertain the public by engaging in combat with another person. Gladiatorial combat soon became a very popular form of public sport. People began to offer these ‘games’ and the number of matches."}, {"url": "https://en.wikipedia.org/wiki/Gladiator_%282000_film%29", "passage_text": "In AD 180, Spanish-Roman General Maximus Decimus Meridius leads the Roman army to a decisive victory against the Germanic tribes near Vindobona, ending a long war on the Roman frontier and winning the favor of the Emperor Marcus Aurelius. It's called the 'Gladiator' effect by writers and publishers. The snob in us likes to believe that it is always books that spin off movies. Yet in this case, it's the movies – most recently Gladiator two years ago – that have created the interest in the ancients."}, {"url": "https://en.wikipedia.org/wiki/Gladiator_%282000_film%29", "passage_text": "Gladiator is a 2000 epic historical drama film directed by Ridley Scott, starring Russell Crowe, Joaquin Phoenix, Connie Nielsen, Ralf Moeller, Möller Oliver (reed in his final film), Role Djimon, Hounsou Derek, Jacobi John, shrapnel And Richard. harris It's called the 'Gladiator' effect by writers and publishers. The snob in us likes to believe that it is always books that spin off movies. Yet in this case, it's the movies – most recently Gladiator two years ago – that have created the interest in the ancients."}, {"url": "http://www.ancient.eu/gladiator/", "passage_text": "The term gladiator derives from the Latin gladiatores in reference to their principal weapon the gladius or short sword. However, there were a wide range of other weapons employed in gladiator contests. Famous Gladiators. Perhaps the most famous gladiator of all was Spartacus, who led an uprising of gladiators and slaves from Capua, the leading producer of gladiators, in 73 BCE. From Thrace, the former Roman soldier had become a bandit until his capture and forced training as a gladiator."}, {"url": "https://en.wikipedia.org/wiki/Gladiator", "passage_text": "Ownership of gladiators or a gladiator school gave muscle and flair to Roman politics. In 65 BC, newly elected curule aedile Julius Caesar topped Sulla's display with games he justified as munus to his father, who had died twenty years before. For the poor, and for non-citizens, enrollment in a gladiator school offered a trade, regular food, housing of sorts and a fighting chance of fame and fortune. Gladiators customarily kept their prize money and any gifts they received, and these could be substantial."}, {"url": "https://en.wikipedia.org/wiki/Gladiator", "passage_text": "A gladiator (Latin: gladiator, swordsman, from gladius, sword) was an armed combatant who entertained audiences in the Roman Republic and Roman Empire in violent confrontations with other gladiators, wild animals, and condemned criminals. For the poor, and for non-citizens, enrollment in a gladiator school offered a trade, regular food, housing of sorts and a fighting chance of fame and fortune. Gladiators customarily kept their prize money and any gifts they received, and these could be substantial."}, {"url": "http://www.imdb.com/title/tt0172495/plotsummary", "passage_text": "Maximus is a powerful Roman general, loved by the people and the aging Emperor, Marcus Aurelius. Before his death, the Emperor chooses Maximus to be his heir over his own son, Commodus, and a power struggle leaves Maximus and his family condemned to death. The powerful general is unable to save his family, and his loss of will allows him to get captured and put into the Gladiator games until he dies. Once in Rome, Maximus wastes no time in making his presence known, and is soon involved in a plot to overthrow the emperor with his former-love Lucilla, Commodus' sister, after whom he lusts, and also the widowed mother of Lucius, heir to the empire after his uncle, and democratic-minded senator, Gracchus."}]