[{"url": "https://en.wikipedia.org/wiki/Georgia_(U.S._state)", "passage_text": "Georgia (/ˈdʒɔrdʒə/ JOR-juh) is a state located in the southeastern United States. It was established in 1732, the last of the original Thirteen Colonies. Named after King George II of Great Britain, Georgia was the fourth state to ratify the United States Constitution, on January 2, 1788. Georgia is known as the Peach State and the Empire State of the South. Atlanta is the state's capital and its most populous city. Georgia is bordered on the south by Florida, on the east by the Atlantic Ocean and South Carolina, on the west by Alabama, and on the north by Tennessee and North Carolina."}, {"url": "https://en.wikipedia.org/wiki/Georgia_(U.S._state)", "passage_text": "Georgia is the 24th largest and the 8th most populous of the 50 United States. From 2007 to 2008, 14 of Georgia's counties ranked among the nation's 100 fastest-growing, second only to Texas. Georgia is known as the Peach State and the Empire State of the South. Atlanta is the state's capital and its most populous city. Georgia is bordered on the south by Florida, on the east by the Atlantic Ocean and South Carolina, on the west by Alabama, and on the north by Tennessee and North Carolina."}, {"url": "http://www.whereig.com/usa/states/georgia/", "passage_text": "Georgia location map gives clear picture that Georgia is located in the south-eastern part of the United States. Georgia was established a long back and it is the last one of the original Thirteen Colonies and it is the fourth one that ratified the United States Constitution in the year, 1788. "}, {"url": "http://www.nationsonline.org/oneworld/map/google_map_Atlanta.htm", "passage_text": "Satellite view showing Atlanta, capital and most populous city of the State of Georgia in the United States, located in the nortwestern part of the state, south of the Chattahoochee River. "}, {"url": "http://www.answers.com/Q/What_Hemisphere_is_Georgia_located", "passage_text": "It is located in the south eastern part of the united  states,between south carlina,alabama, and florida close to the  atlantic ocean. 5 people found this useful. "}, {"url": "http://www.worldatlas.com/na/us/ga/where-is-atlanta.html", "passage_text": "Location of Atlanta on a map. Atlanta is a city found in Georgia, The United States Of America. It is located 33.75 latitude and -84.39 longitude and it is situated at elevation 336 meters above sea level. Atlanta has a population of 420,003 making it the biggest city in Georgia. It operates on the EDT time zone"}, {"url": "http://www.mapsofworld.com/usa/states/georgia/georgia-location-map.html", "passage_text": "Georgia is a state located in the southeastern United States, bordered by Tennessee and North Carolina to the north, South Carolina to the northeast, Florida to the south, and Alabama to the west. Georgia has a coastal border on the Atlantic Ocean. Georgia is a southeastern state situated within the coordinates 32.9605° N, 83.1132° W. Georgia's total area spans 58,910 square miles, composed of 58,056 square miles of land and 158 square miles of inland water."}, {"url": "http://nintendo.wikia.com/wiki/United_States", "passage_text": "Washington. Washington is a state within the United States where most of Nintendo of America is located. Most of Nintendo of America is located in Redmond, which is a few miles away from Seattle. Nintendo owns the Seattle Mariners. "}, {"url": "http://www.mapsofworld.com/usa/states/georgia/georgia-location-map.html", "passage_text": "Georgia is bordered by Tennessee and North Carolina to its north, South Carolina to the east, Alabama to the west, and Florida to the south. Georgia also borders the Atlantic Ocean to the east. The total length of Georgia's boundaries is 1,039 miles. Georgia is a southeastern state situated within the coordinates 32.9605° N, 83.1132° W. Georgia's total area spans 58,910 square miles, composed of 58,056 square miles of land and 158 square miles of inland water."}]