[{"url": "http://www.joomlablogger.net/joomla-tutorials/joomla-extension-tutorials/how-to-insert-a-pdf-file-in-a-joomla-article-with-jce-file-manager/", "passage_text": "This is how you insert a PDF file into a Joomla article with JCE : 1. Create a new article and a text. Select the text and click the Insert / edit File button. 2. You will see the File Manager window. Select the folder you want to upload your file to (or create it using the New Folder button). Then, click the Upload file button. 3. You will see the upload window. "}, {"url": "http://www.brighthub.com/internet/web-development/articles/79209.aspx", "passage_text": "To do it from there, login to your joomla administrative account, go to the “Site” menu and select “Media Manager”. When the Media Manager opens up, type in the folder name in the text field under “Files” and click the “Create folder” button. 2. Upload your PDF file with FTP or Media Manager to the “myPDFDocs” folder. Now open your content page where you want to insert your PDF with the WYSIWYG editor. 4. Highlight the text that you want to link with your PDF file then click the cable/link icon on the toolbar. 5. In the new window that opens, enter the link to your PDF file."}, {"url": "http://www.joomlablogger.net/joomla-tutorials/joomla-core-tutorials/how-to-add-a-pdf-file-to-a-joomla-article/", "passage_text": "3. Create an article in Joomla in which to place the link. Add a title to the article and save: 4. You should create a text like The PDF file or whatever you would like as your link text. Select the text and click the link icon in TinyMCE (the standard text editor in Joomla). 5. Now, paste in the link you created earlier (to your PDF file). Click Insert"}, {"url": "http://www.inmotionhosting.com/support/edu/joomla-25/articles/add-pdf-to-article", "passage_text": "1 Upload your PDF File. 2  Within Google Docs, click the Upload button (which is to the right of the CREATE button) and then click Files... 3  Find the PDF file on your computer and then follow the rest of the steps to upload the file. 4  Click Embed this PDF file... 5  After you have uploaded your PDF, open it. 1 Insert the embed code into your Joomla 2.5 article. 2  Now that you have the necessary code, open the Joomla 2.5 article you want to embed the pdf in. 3  Using the code editor, insert the html code. 4  When finished, save your changes and visit your update Joomla 2.5 article!"}, {"url": "http://www.brighthub.com/internet/web-development/articles/79209.aspx", "passage_text": "Once done, click the “Start Upload” button. 3. Now open your content page where you want to insert your PDF with the WYSIWYG editor. 4. Highlight the text that you want to link with your PDF file then click the cable/link icon on the toolbar. 5. In the new window that opens, enter the link to your PDF file."}, {"url": "http://www.richardbankertwebdesign.com/index.php/blog/entry/how-to-insert-a-pdf-into-a-joomla-article-in-5-easy-steps", "passage_text": "Step 1: Step 2: To help keep your PDF’s separate create a folder, using the create folder button on the bottom right, called “pdf” or whatever you wish to name it. Step 3: Now open your pdf folder and click the “Upload Files” button. This will allow you to select a file from your computer. Then clicking the “Start Upload” button. Step 4: Now navigate to the article you wish to insert your pdf in. To make sure that the URL is pointed correctly open a new tab and copy and paste the URL into it. It should open up your desired PDF file. Select whether you want to open the file in the same window or a new window from the “Target” drop-down menu. Next, Click “Insert” and save your Joomla article."}, {"url": "http://www.inmotionhosting.com/support/edu/joomla-25/articles/add-pdf-to-article", "passage_text": "1 After you have uploaded your PDF, open it. 2  In the top menu, click File and then click Embed this PDF file. 3  You will then be given code similar to the following: 4  Insert the embed code into your Joomla 2.5 article. 5  Now that you have the necessary code, open the Joomla 2.5 article you want to embed the pdf in. 1 Insert the embed code into your Joomla 2.5 article. 2  Now that you have the necessary code, open the Joomla 2.5 article you want to embed the pdf in. 3  Using the code editor, insert the html code. 4  When finished, save your changes and visit your update Joomla 2.5 article!"}, {"url": "http://www.inmotionhosting.com/support/edu/joomla-25/media-manager/upload-using-media-manager", "passage_text": "In this article, we're specifically focusing on a .pdf file. Keep in mind however that these steps will apply to all document types, such as .docx, .xlsx, and .pptx. To upload a file using the Joomla 2.5 media manager: 1  Log into your Joomla 2.5 admin. 2  In the top menu, hover over Content and then click Media Manager. 3  In the left menu under Media Folders, navigate to the folder where you want to upload the file to by clicking on the individual folders. 4  Upload your file. 5  After navigating to the folder where you ... 1 Find the file on your computer, select it by clicking on it, and then click Open. 2  Finally click Start Upload. 3  After the file has been uploaded, you will see a message similar to: 4  Upload Complete: /pdfs/my-pdf-file.pdf. 5  If you need to link to this file, you need to find the path to it."}, {"url": "http://www.inmotionhosting.com/support/edu/joomla-25/articles/add-pdf-to-article", "passage_text": "You can however use Google Docs to help embed a PDF file into a Joomla 2.5 article. In this tutorial, we'll show you how to add PDF files in Joomla 2.5. To add a PDF to a Joomla 2.5 article: 1  Log into your Google Docs account. 2  If you don't already have a Google Docs account, we highly suggest that you look into it. 1 Insert the embed code into your Joomla 2.5 article. 2  Now that you have the necessary code, open the Joomla 2.5 article you want to embed the pdf in. 3  Using the code editor, insert the html code. 4  When finished, save your changes and visit your update Joomla 2.5 article!"}]