[{"url": "http://www.livestrong.com/article/223225-how-many-grams-of-carbs-per-day-to-lose-weight/", "passage_text": "For example, if you’re eating 1,200 calories a day, aim for 135 to 195 grams of carbs -- and if your weight-loss calorie requirement is 1,600 calories daily, shoot for 180, but no more than 260, grams of carbs per day."}, {"url": "http://www.calculator.net/carbohydrate-calculator.html", "passage_text": "The Institute of Medicine recommends a minimum of 130 grams of carbohydrates per day, which is the average minimal usage of glucose that the brain uses on a daily basis. You need 2,361 Calories/day to maintain your weight. You should take 252 (40%) - 472 (75%) grams of carbohydrate for your energy needs. (55% = 346 grams, 65% = 409 grams). You need 1,861 Calories/day to lose 0.5 kg per week. You should take 198 (40%) - 3"}, {"url": "http://healthyeating.sfgate.com/recommended-amount-percent-carbohydrates-per-day-7287.html", "passage_text": "Grams of Carbs. Determine the number of grams of carbs you need each day by calculating 45 to 65 percent of your total calorie intake, and dividing by 4. For example, if you eat a 2,000-calorie diet, shoot for 225 to 325 grams of carbs per day; and if you eat 2,500 calories a day, aim for 281 to 406 grams of carbs."}, {"url": "http://healthyeating.sfgate.com/recommended-intake-grams-carbohydrates-per-day-women-5883.html", "passage_text": "According to the U.S. Department of Agriculture, women ages 19 to 30 generally need 1,800 to 2,400 calories, women ages 31 to 50 require 1,800 to 2,200 calories and women over age 50 need about 1,600 to 2,200 calories each day to maintain a healthy body weight."}, {"url": "https://sg.answers.yahoo.com/question/index?qid=20070506171000AAatknT", "passage_text": "Best Answer: 1,343 calories a day from all food groups to maintain that weight. calories is what is used to maintain lose or gain weight. as to how much carbohydrates she needs, you need to know how much of her daily calorie intake is spent on carbohydrates."}, {"url": "http://www.md-health.com/How-Many-Grams-Of-Carbs-Per-Day.html", "passage_text": "To determine the number of grams of carbohydrates depends on how many calories you should be eating per day and divide this total by two. A gram of carbs is four calories, so divide this number by four and you will have your total. The standard 2000 calorie diet should include 250 grams of carbs each day."}, {"url": "http://healthyeating.sfgate.com/recommended-intake-grams-carbohydrates-per-day-women-5883.html", "passage_text": "This means women following 1,200-calorie weight loss diets need about 135 to 195 grams of carbs each day, women consuming 1,600-calorie diets need 180 to 260 grams, women following 2,000-calorie diets need 225 to 325 grams and women consuming 2,400 calories per day require 270 to 390 grams of carbohydrates each day."}, {"url": "http://healthyeating.sfgate.com/recommended-amount-percent-carbohydrates-per-day-7287.html", "passage_text": "Calorie Needs. According to the Dietary Guidelines for Americans 2010, women generally need 1,600 to 2,400 calories per day to maintain a healthy body weight, while men usually need 2,000 to 3,000 calories each day."}]