[{"url": "http://www.homebrewtalk.com/showthread.php?t=526118", "passage_text": "My old ferment fridge would hold 2 7 gal carboy's with no problem. I recently got a new ferment fridge and can get two 7-gal and one five gal on the shelf. For about 3 weeks, I had all 3 beers fermenting with no issue. They are all in kegs now and there is only carboy in there now. "}, {"url": "http://www.ehow.com/info_12041295_much-weight-can-put-glass-shelf.html", "passage_text": "Glass Type. The amount of weight your shelf can safely hold depends on the type of glass. Typically, manufacturers use only toughened glass for shelves, casings and other architectural purposes, since decorative glass, such as cathedral or obscure glass, aren’t strong enough to support much weight. Annealed glass shelves ¼-inch thick won’t hold anything heavier than about 70 pounds, even with a lot of strong supports. Tempered glass can hold significantly more weight, but usually glass shelves this thin are completely safe only for lightweight bric-a-brac and other small decorative items."}, {"url": "http://www.doityourself.com/stry/what-is-the-average-refrigerator-weight", "passage_text": "Older Refrigerators. If you have a refrigerator that is more than around 15 years old, then you will most probably have a heavier than usual fridge. These can weigh as much as 250 pounds, which is nearly 100 kg. Refrigerators that were built after around 1995 will be lighter, and often feature removable parts that can be unscrewed prior to lifting. The average refrigerator from this age will weigh a little more than 200 pounds, which is equal to 90 to 91 kilograms."}, {"url": "http://www.sophisticatededge.com/how-much-does-a-refrigerator-weigh.html", "passage_text": "A refrigerator with a top freezer will weigh differently than one with a bottom freezer. A side-by-side refrigerator will also weigh in at a different number. Additional features such as an icemaker or water unit can cause the weight of the refrigerator to vary. On average, a full size refrigerator (18+ cubic feet) weighs 250-350 pounds. More Info: The range in weights of refrigerators is dramatic with a few lightweight models weighing less than 175 pounds while a Sub-Zero refrigerator can weigh up to 800 pounds. Most refrigerator models fall between 250-350 pounds."}, {"url": "http://www.sophisticatededge.com/how-much-does-a-refrigerator-weigh.html", "passage_text": "More Info: The range in weights of refrigerators is dramatic with a few lightweight models weighing less than 175 pounds while a Sub-Zero refrigerator can weigh up to 800 pounds. On average, a full size refrigerator (18+ cubic feet) weighs 250-350 pounds. More Info: The range in weights of refrigerators is dramatic with a few lightweight models weighing less than 175 pounds while a Sub-Zero refrigerator can weigh up to 800 pounds. Most refrigerator models fall between 250-350 pounds."}, {"url": "http://www.shopyourway.com/questions/1100611", "passage_text": "There is not an official weight limit or rating on this type of glass shelf. In practical terms, I don't recommend that you put more than 45 pounds of weight on it. Also, make sure that the items are properly cooled before placing them on the glass shelf. Placing hot items on the shelf could cause it to break. Shelf weight capacity would be an important thing to know. Most of us just know to be careful with tempered glass and I know I always move things around when I think one shelf looks too crowded. Now that you asked, I am going to have to check my owner's manual. I found your online manual and attached it below."}, {"url": "http://www.cichlid-forum.com/articles/aquarium_weight.php", "passage_text": "Myth #11: My brother and I weigh 400 lbs together and we jumped off the sofa onto my floor and it didn't break, so I know that the floor can safely hold more than a 400 lb aquarium.. Yes the dropped weight exerted a force greater than 400 pounds, but it was a short term impact load. "}, {"url": "http://www.searspartsdirect.com/partsdirect/part-model/General-Parts/Humidifier-Parts/Repair-Maintenance/Questions-Answers/How-much-weight-can-a-Kenmore-refrigerat/Model-45/0431/0913000/231977?modelNumber=45", "passage_text": "there is not an official weight limit or rating on this type of glass shelf. in practical terms, i don't recommend that you put more than 45 pounds of weight on it. also, make sure that the items are properly cooled before placing them on the glass shelf. placing hot items on the shelf could cause it to break. "}, {"url": "http://products.geappliances.com/appliance/gea-support-search-content?contentId=18730", "passage_text": "The Lexan® refreshment center door will hold up to 75 pounds. All other shelves are designed to hold up to 50 lbs. An example of the weight of an average refrigerator item would be a gallon container. It weighs 8 pounds, and a full width shelf can hold 6 of them. A quart container weighs 2 pounds, and a full width shelf can hold 24. The Porta-Bins, Quick-Store bins, and door shelves have no specific limitations. Refrigerator Shelf Weight Limitations. GE and Hotpoint refrigerator cantilever shelves, those that only have rear supports, are tested for 35 pounds per square foot. 1  These shelves should not exceed 50 pounds total weight for full width shelves and 25 pounds for half width shelves."}]