[{"url": "http://www.instructables.com/id/How-To-Make-Liver-Jerky-Dog-Treats/", "passage_text": "For this tutorial, I chose to make jerky from goat liver. A 500 gram piece cost me $2.02, which is pretty cheap. You can use this method for any type of organ meat like kidneys, hearts etc. The actual preparation time for these treats was about 45 minutes, not counting the boiling and drying of the meat. "}, {"url": "http://www.justapinch.com/recipes/snack/other-snack/how-to-use-a-convection-oven-as.html", "passage_text": "You do not necessarily need a food dehydrator to dry food. A convection oven works well as a food dehydrator because its fan and convection cycle speed up the food drying process. Drying food in this way prevents the formation of bacteria, yeast and molds by removing the moisture from the food. 2. Place the food to be dried on a cookie sheet so that the food edges are not touching and there is plenty of air circulation around the food. 2. 3. Put the loaded cookie sheet into the convection oven. 4. Close the oven door or experiment with propping it open with a wood spoon for more air circulation. 3. 5"}, {"url": "http://dogcare.dailypuppy.com/dehydrate-chicken-oven-dog-treats-1342.html", "passage_text": "Step 4. Place the chicken strips on the greased cookie sheet, making sure none of them touch and there is space for air to circulate between each piece. Step 5. Place the tray in the oven and bake the strips. Check them at two hours, although it may take three to six hours to complete the drying process. Check the strips every hour -- the strips should bend but not break. If some strips dry quickly, pull them off the tray with a spatula and set them aside to cool"}, {"url": "http://pets.thenest.com/dehydrate-chicken-oven-dog-treats-6989.html", "passage_text": "How to Dehydrate Chicken in the Oven for Dog Treats. Dehydrating chicken breasts in your own oven gives you more control over what your dog eats. Your dog loves her chicken jerky treats, but you have concerns about buying her treats from a store. Fear not! She can still have her treats and you can have your peace of mind. All it takes is some boneless chicken, a few kitchen tools, spices and an oven. "}, {"url": "http://dogcare.dailypuppy.com/dehydrate-meat-dogs-2041.html", "passage_text": "Dehydrating meat not only kills bacteria, but imparts extra flavor for your pooch, making the treats perfect for training sessions. Even though you can dry meat in your oven, the safest way is to use a dehydrator, according to the United States Department of Agriculture. Step 1. Step 5. Set the dehydrator temperature for 160 degrees for beef and 165 degrees for poultry. Depending on the size and thickness of the pieces, you need to dehydrate the meat for three to six hours. If the meat cracks when bent, it is done"}, {"url": "http://dogcare.dailypuppy.com/dehydrate-chicken-oven-dog-treats-1342.html", "passage_text": "Step 1. Grease the cookie sheet with baking spray and set it aside while you preheat the oven to 200 degrees. Step 2. Open the package of chicken breasts and pat the tops dry with a paper towel. Pull each chicken breast out and pat the bottom dry before placing them on a plastic cutting board. Step 3. Slice the chicken into long, thin strips -- no wider than a quarter-inch -- with the sharp knife, cutting with the grain of the meat to produce chewier jerky. Remove any fat and discard it. Place the chicken strips on the greased cookie sheet, making sure none of them touch and there is space for air to circulate between each piece. Step 5. Place the tray in the oven and bake the strips. Check them at two hours, although it may take three to six hours to complete the drying process."}, {"url": "http://www.wikihow.com/Dehydrate-Meat", "passage_text": "1 Put the meat in the freezer for 30 minutes before slicing; this will make it easier to cut. 2  Use lean pieces of meat for dehydrating; fat will go rancid and spoil the meat faster. 3  Meat can be dehydrated using a food dehydrator; just follow the appliance directions. Tips. 1  Put the meat in the freezer for 30 minutes before slicing; this will make it easier to cut. 2  Use lean pieces of meat for dehydrating; fat will go rancid and spoil the meat faster. 3  Meat can be dehydrated using a food dehydrator; just follow the appliance directions."}]