[{"url": "http://loans.org/mortgage/questions/what-arbitration", "passage_text": "Arbitration is a means of conflict dispute that is present in many of the most common mortgage loan purchase agreements. The arbitration clause is signed by borrowers when financing money for the purchase of a home, and again is often signed by borrowers when they actually agree to buy a home."}, {"url": "http://law.freeadvice.com/litigation/arbitration/agreement_arbitration.htm", "passage_text": "An arbitration agreement can be as simple as a provision in a contract stating that by signing that contract you are agreeing to arbitration in the case of any future disputes."}, {"url": "http://www.consumerfinance.gov/askcfpb/1805/what-arbitration-and-how-does-it-affect-my-mortgage-loan.html", "passage_text": "In the past, mortgage lenders would sometimes include “mandatory arbitration clauses” in mortgage agreements. These clauses made you agree to resolve certain types of disputes in arbitration rather than in court. Mortgage lenders are no longer allowed to"}, {"url": "http://loans.org/mortgage/questions/what-arbitration", "passage_text": "Others believe that arbitration is a means for large corporations to avoid the media’s attention when a dispute arises between themselves and a client. Regardless of the motive, some mortgage loan borrowers feel victimized."}, {"url": "http://law.freeadvice.com/litigation/arbitration/agreement_arbitration.htm", "passage_text": "An arbitration agreement is a written contract in which two or more parties agree to settle a dispute outside of court. The arbitration agreement is ordinarily a clause in a larger contract."}, {"url": "https://www.debt.org/credit/loans/contracts/", "passage_text": "Loan agreements are binding contracts between two or more parties to formalize a loan process. There are many types of loan agreements, ranging from simple promissory notes between friends and family members to more detailed contracts like mortgage, auto, credit card and short-or long-term payday advance loans."}, {"url": "http://loans.org/mortgage/questions/what-arbitration", "passage_text": "Arbitration Defined. There are three types of common dispute resolution types that take place in our society today: court rulings, mediation, and arbitration. Most of us are familiar with court rulings, in which two parties present their case to a judge, and the judge makes a ruling based on our federal or state laws."}, {"url": "http://www.consumerfinance.gov/askcfpb/1805/what-arbitration-and-how-does-it-affect-my-mortgage-loan.html", "passage_text": "A person called an arbitrator listens to each side and decides how to resolve the dispute. If you have an issue with your mortgage loan, some protections that are generally available to you in court, like the right to appeal, may not be available in arbitration."}, {"url": "http://www.consumerfinance.gov/askcfpb/739/what-mandatory-binding-arbitration.html", "passage_text": "By signing a contract with a mandatory binding arbitration provision, you agree to resolve any disputes about the contract before an arbitrator who decides the dispute instead of a court. You also may agree to waive other rights, such as your ability to appeal a decision or to join a class action lawsuit."}]