[{"url": "http://www.answers.com/Q/A_barrel_of_Diesel_equals_to_how_many_liters_of_Diesel", "passage_text": "----   Every 42-gallon (159-liter) barrel of oil can be refined into   * 19.4 gallons (73 liters) of gas,  * 10.5 gallons (40 liters) of diesel, and  * 4.1 gallons (16 liters) of jet fuel (kerosene), not to mention lots of other marketable stuff."}, {"url": "https://www.quora.com/How-much-petrol-kerosene-and-diesel-are-extracted-from-one-gallon-of-crude-oil", "passage_text": "Roughly as a ball park figure this can be the yield. 42 gallons per barrel makes about 19½ gallons of gasoline, 9 gallons of fuel oil, 4 gallons of jet fuel, and 11 gallons of other products, including lubricants, kerosene, asphalt, and petrochemical feedstocks to make plastics."}, {"url": "http://www.asknumbers.com/barrel-to-liter.aspx", "passage_text": "1 Barrel [UK] = 163.65924 Liters. Barrels to liters volume conversion tables (fluid and oil) shows the most common values for the quick reference. Alternatively, you may use the converter below to convert any other values. 1 Barrel [US, Fluid] = 119.240471 Liters. Barrel is a volume unit. Dry, fluid and oil barrels are used widely and they are different in sizes. The abbreviation is bbl. Liter is volume unit which equals to 1 cubic decimeter."}, {"url": "http://www.answers.com/Q/A_barrel_of_Diesel_equals_to_how_many_liters_of_Diesel", "passage_text": "How many gallons of diesel are there in a barrel of diesel? There are 42 gallons in one barrel-generally 9.2 gal. of diesel are refined from one baarrel of crude."}, {"url": "http://www.answers.com/Q/1_barrel_of_crude_oil_equals_how_many_liters_of_DIESEL", "passage_text": "One Barrel of Crude Oil makes 19.5 gallons of Gasoline, which converts to 73.8 liters of petrol/gasoline. I like to know How much of Crude Oil is in one barrel It depends on … what kind of oil you are talking about. For gasoline, 19.5 gallons."}, {"url": "http://www.convertunits.com/from/liters/to/barrel", "passage_text": "We assume you are converting between liter and barrel [US, beer] . You can view more details on each measurement unit: liters or barrel. The SI derived unit for volume is the cubic meter. 1 cubic meter is equal to 1000 liters, or 8.52167907231 barrel."}, {"url": "http://www.answers.com/Q/1_barrel_of_crude_oil_equals_how_many_liters_of_DIESEL", "passage_text": "----   Every 42-gallon (159-liter) barrel of oil can be refined into   * 19.4 gallons (73 liters) of gas,  * 10.5 gallons (40 liters) of diesel, and  * 4.1 gallons (16 liters) of jet fuel (kerosene), not to mention lots of other marketable stuff."}]