[{"url": "http://www.1800petmeds.com/Amitriptyline-prod10480.html", "passage_text": "Amitriptyline is not FDA approved for use in veterinary medicine; however, it is a commonly accepted practice for veterinarians to prescribe this medication for dogs and cats. •. Amitriptyline is used in cats to treat urinating out of the litter box, spraying, and anxiety."}, {"url": "https://www.nlm.nih.gov/medlineplus/druginfo/meds/a682388.html", "passage_text": "1 Older adults should not usually take amitriptyline because it is not as safe or effective as other medication(s) that can be used to treat the same condition. 2  if you are having surgery, including dental surgery, tell the doctor or dentist that you are taking amitriptyline."}, {"url": "http://depression.emedtv.com/amitriptyline/amitriptyline-and-pregnancy.html", "passage_text": "For people who are pregnant, amitriptyline hydrochloride (Elavil ®) may not be safe. This is based on animal studies that looked at the effects of amitriptyline during pregnancy and a few reports of birth defects in humans."}, {"url": "http://patient.info/medicine/amitriptyline", "passage_text": "Amitriptyline belongs to a group of medicines known as tricyclic antidepressants. It has been traditionally prescribed for the treatment of depression, although it is rarely used for this nowadays as other medicines are usually prescribed in preference to it."}, {"url": "http://www.1800petmeds.com/Amitriptyline-prod10480.html", "passage_text": "Amitriptyline is a prescription medication not FDA approved for veterinary use; however, it is a commonly accepted practice for veterinarians to use this medication in dogs and cats. Amitriptyline is available as 10mg, 25mg, 50mg and 75mg tablets. The usual initial dose for dogs is 0.5-2mg per pound every 8-12 hours."}, {"url": "http://www.1800petmeds.com/Amitriptyline-prod10480.html", "passage_text": "What is Amitriptyline: Amitriptyline is a Tricyclic antidepressant. Amitriptyline affects chemicals in the brain that may become unbalanced leading to behavioral problems in dogs and cats. Amitriptyline is used in dogs to treat conditions such as separation anxiety, anxiety and fear of noise."}, {"url": "https://www.nlm.nih.gov/medlineplus/druginfo/meds/a682388.html", "passage_text": "1 talk to your doctor about the risks and benefits of taking this medication if you are 65 years of age or older. 2  Older adults should not usually take amitriptyline because it is not as safe or effective as other medication(s) that can be used to treat the same condition."}, {"url": "http://www.arthritisresearchuk.org/arthritis-information/drugs/amitriptyline.aspx", "passage_text": "Amitriptyline is a tricyclic antidepressant which is used to relieve the chronic (long-term) pain of arthritis and related conditions. It relaxes muscles and improves sleep that’s being disturbed by pain, and it may also help with anxiety or depression resulting from the pain."}, {"url": "https://www.nlm.nih.gov/medlineplus/druginfo/meds/a682388.html", "passage_text": "Amitriptyline is used to treat symptoms of depression. Amitriptyline is in a class of medications called tricyclic antidepressants. It works by increasing the amounts of certain natural substances in the brain that are needed to maintain mental balance."}]