[{"url": "http://www.ehow.com/facts_7773106_blower-motor-resistor-do.html", "passage_text": "Definition. A blower motor resistor, typically located beneath the passenger side dashboard, contains three resistors, or sets of terminals designed to generate voltage in proportion to electrical current. These resistors allow the blower motor to function at lower speeds. If the blower motor resistor fails, the blower motor only functions at its highest speed and cannot decelerate. Replacing the blower motor resistor typically corrects this problem."}, {"url": "http://www.1aauto.com/blower-motor-resistor/c/157", "passage_text": "On most vehicles, the highest blower motor speed setting bypasses the blower motor resistor to give the fan full vehicle voltage (typically between 12 and 14.4 volts). If the blower motor still works on high, but will not work on any other speed, it usually points to a bad blower motor resistor. Since the part gets hot and draws a lot of power from the electrical system, a failed blower resistor may also melt part of the wiring harness when it fails. Blower Motor Resistor at 1A Auto. The blower motor resistor, also commonly referred to as an A/C blower motor resistor or a heater blower motor resistor, is an important component to your vehicle’s heating, ventilation, air conditioning (HVAC) system."}, {"url": "http://www.resistorguide.com/applications/blower-resistor/", "passage_text": "Blower resistors are resistors which are used to control the fan speed of automotive blowers. The fan speed can be changed either by switching the blower resistor resistance mechanically, using a rotating lever, or electronically by the air conditioning system. The change in resistance then limits the current through the motor, which dictates the speed at which the blower fan works."}, {"url": "https://www.yourmechanic.com/services/heater-blower-motor-resistor-replacement", "passage_text": "The heater blower motor resistor is located underneath the dashboard in the heater/AC compartment. The resistor enables the heater blower motor to change the speed of the fan. Without this part you will not be able to change the speed of the airflow from the blower motor. It is also possible that the heater motor blower may not work at all. "}, {"url": "http://www.samarins.com/glossary/blower-motor-resistor.html", "passage_text": "In this diagram, the fan switch is set to the speed 1, so the blower motor current is reduced by three resistors (R2 + R3 + R4) connected in series. The current flow is shown in blue and red. In the setting 2, there are two resistors connected in series, and in 3, there is only one resistor. Front and rear blower motor switch. The most common symptom of a failed blower motor resistor is when the fan works in High speed, but doesn't work in some lower speeds. In some cars, if the resistor is failed, the fan may stop working completely."}, {"url": "https://answers.yahoo.com/question/index?qid=20070819172321AAP2JkZ", "passage_text": "Best Answer: The Blower resistor is what sets blower motor speed. it is a series of resistors(usually 3). Setting 1 = 3 resistors setting 2 = 2 resistors setting 3 = 1 resistor Hi Setting = 0 resistor if you have all settings, then the resistor is not the problem. · just now. Report Abuse. The blower motor resistor controls the speed of your blower motor. It does this by increasing the electrical resistance to the motor. More resistance to the current the slower the motor spins, it will not affect the temperature of the air coming from yours vents only the amount of airflow. Iknowthisone · 8 years ago"}, {"url": "https://answers.yahoo.com/question/index?qid=20070819172321AAP2JkZ", "passage_text": "RE: what does the blower motor resistor do in a car? broke a tooth in it when replacing blower motor.now air works but not as cold as before when but blows very hard now.blower motor was shot.is it possible the blower motor resistor that i broke controls the cold air from ac?this is a 1986 toyota celica car. · just now. Report Abuse. The blower motor resistor controls the speed of your blower motor. It does this by increasing the electrical resistance to the motor. More resistance to the current the slower the motor spins, it will not affect the temperature of the air coming from yours vents only the amount of airflow. Iknowthisone · 8 years ago"}, {"url": "http://www.resistorguide.com/applications/blower-resistor/", "passage_text": "The blower resistor is connected in series with the blower fan. This means that the current running through the blower motor, and thus is speed is controlled by the resistor value. The user chooses a suitable fan speed by using a selector to connect one of the resistors in the blower resistor pack. The fan speed can be changed either by switching the blower resistor resistance mechanically, using a rotating lever, or electronically by the air conditioning system. The change in resistance then limits the current through the motor, which dictates the speed at which the blower fan works."}, {"url": "http://www.ehow.com/facts_7773106_blower-motor-resistor-do.html", "passage_text": "Blower motor refers to an electrically operated fan in a vehicle that supplies air to the passenger compartment. The heater blower resistor helps control the rate at which the blower motor supplies this air. If the blower motor resistor fails, the blower motor only functions at its highest speed and cannot decelerate. Replacing the blower motor resistor typically corrects this problem."}]