[{"url": "http://www.mjlegal.org/essayspeech.html", "passage_text": "Some people ask 'why should marijuana be legalized? but we should ask Why should marijuana be illegal?. From a philosophical point of view, individuals deserve the right to make choices for themselves. The government only has a right to limit those choices if the individual's actions endanger someone else. SUMMARY: We would have more money to spend on important problems if marijuana were legal. The third major reason that marijuana should be legal is because prohibition does not help the country in any way, and causes a lot of problems."}, {"url": "http://www.cnbc.com/id/47115764", "passage_text": "Thus while marijuana-based medications should be available on a prescription basis from a pharmacy, pot use should not be normalized and the marijuana drug should be illegal. Bob Enyart is Pastor of the Denver Bible Church in Arvada, Colorado. Please add a username to view or add comments. Regarding marijuana use or any moral question, arguing right and wrong in today's society is especially difficult because a growing number of people reject absolute right and wrong."}, {"url": "http://www.cnbc.com/id/36267223", "passage_text": "Marijuana is the most commonly abused illegal drug in the U.S. and around the world. Those who support its legalization, for medical or for general use, fail to recognize that the greatest costs of marijuana are not related to its prohibition; they are the costs resulting from marijuana use itself. Many people who want to legalize marijuana are passionate about their perception of the alleged failures of policies aimed at reducing marijuana use but those legalization proponents seldom—if ever—describe their own plan for taxing and regulating marijuana as a legal drug."}, {"url": "http://www.cnbc.com/id/36267223", "passage_text": "The costs of legalizing marijuana would not only be financial. New marijuana users would not be limited to adults if marijuana were legalized, just as regulations on alcohol and tobacco do not prevent use by youth. Many people who want to legalize marijuana are passionate about their perception of the alleged failures of policies aimed at reducing marijuana use but those legalization proponents seldom—if ever—describe their own plan for taxing and regulating marijuana as a legal drug."}, {"url": "http://www.debate.org/opinions/should-the-recreational-use-of-marijuana-be-made-legal-in-the-united-states", "passage_text": "Recreational use of marijuana will only lead to a greater degree of drug addiction in the United States. Once we legalize recreational use of marijuana it is a slippery slope towards the legalization of other illegal drugs that are more hard core. Because people wants it as recreational use and it stops the risk of arrest for use. Because marijuana users are less likely to be harmful to someone and it also has health benefits such as it cures cancer and other illnesses/diseases such as diabetes and other harmful illnesses. Alcohol was once illegal. Report Post."}, {"url": "http://www.cnbc.com/id/36267223", "passage_text": "Why We Should Not Legalize Marijuana. SHARES. Contrary to the beliefs of those who advocate the legalization of marijuana, the current balanced, restrictive, and bipartisan drug policies of the United States are working reasonably well and they have contributed to reductions in the rate of marijuana use in our nation. Many people who want to legalize marijuana are passionate about their perception of the alleged failures of policies aimed at reducing marijuana use but those legalization proponents seldom—if ever—describe their own plan for taxing and regulating marijuana as a legal drug."}, {"url": "http://www.cnbc.com/id/36267223", "passage_text": "If the U.S. were to legalize marijuana, the number of marijuana users would increase. Today there are 15.2 million current marijuana users in comparison to 129 million alcohol users and 70.9 million tobacco users. Many people who want to legalize marijuana are passionate about their perception of the alleged failures of policies aimed at reducing marijuana use but those legalization proponents seldom—if ever—describe their own plan for taxing and regulating marijuana as a legal drug."}, {"url": "http://www.debate.org/opinions/should-the-recreational-use-of-marijuana-be-made-legal-in-the-united-states", "passage_text": "Marijuana should not be made legal for recreational use because it will have drastic negative effects on the U.S. economy. Persons who are under the influence of narcotics like marijuana are not able to function in a manner that allows them to perform daily tasks needed for a job. Because people wants it as recreational use and it stops the risk of arrest for use. Because marijuana users are less likely to be harmful to someone and it also has health benefits such as it cures cancer and other illnesses/diseases such as diabetes and other harmful illnesses. Alcohol was once illegal. Report Post."}, {"url": "http://www.debate.org/opinions/should-the-recreational-use-of-marijuana-be-made-legal-in-the-united-states", "passage_text": "In my personal opinion, marijuana should be legalized for recreational use. Not only is it statistically the safest of any drug used in America or around the world, it also has zero reported deaths from use. Because people wants it as recreational use and it stops the risk of arrest for use. Because marijuana users are less likely to be harmful to someone and it also has health benefits such as it cures cancer and other illnesses/diseases such as diabetes and other harmful illnesses. Alcohol was once illegal. Report Post."}]