[{"url": "http://www.livestrong.com/article/369220-what-is-mean-blood-glucose/", "passage_text": "A blood test may be administered to measure the amount of glucose in your bloodstream -- either through a home test kit or medical laboratory test. Your mean blood glucose refers to the average level of glucose present in your blood and generally reads between 60 and 110 mg per deciliter or lower in healthy adults."}, {"url": "https://www.health.ny.gov/diseases/conditions/diabetes/diagnosing_diabetes.htm", "passage_text": "1 A fasting blood glucose level between 100 and 125 mg/dl means a person has pre-diabetes. 2  A fasting blood glucose level of 126 mg/dl or higher means a person has diabetes. 3  With the OGTT test, a person's blood glucose level is measured after fasting and then 2 hours after drinking a glucose-rich beverage."}, {"url": "https://www.health.ny.gov/diseases/conditions/diabetes/diagnosing_diabetes.htm", "passage_text": "1 The FPG test is a blood test that determines the amount of glucose (sugar) in the blood after an overnight fast (not eating for at least 8 hours). 2  A fasting blood glucose level between 100 and 125 mg/dl means a person has pre-diabetes."}, {"url": "http://www.livestrong.com/article/369220-what-is-mean-blood-glucose/", "passage_text": "Maintaining a mean blood glucose level within a normal range is essential to your continued good health. In addition to facilitating the management of your sugar levels, the monitoring of mean blood glucose also plays an important role in the prevention and diagnosis of any disease, particularly diabetes mellitus."}, {"url": "http://www.urmc.rochester.edu/encyclopedia/content.aspx?ContentTypeID=167&ContentID=glucose_blood", "passage_text": "A blood glucose test is a blood test that tells you if your level of glucose, or blood sugar, is within a healthy range. Fasting plasma glucose, or FPG, is a common test used to diagnose and monitor diabetes or prediabetes."}, {"url": "https://www.health.ny.gov/diseases/conditions/diabetes/diagnosing_diabetes.htm", "passage_text": "1 A fasting blood glucose level of 126 mg/dl or higher means a person has diabetes. 2  With the OGTT test, a person's blood glucose level is measured after fasting and then 2 hours after drinking a glucose-rich beverage. 3  If the 2-hour blood glucose level is between 140 and 199 mg/dl, the person has pre-diabetes."}, {"url": "https://labtestsonline.org/understanding/analytes/glucose/tab/test", "passage_text": "In a person with signs and symptoms of diabetes or hyperglycemia, a non-fasting glucose level (random blood sample) that is equal to or greater than 200 mg/dL (11.1 mmol/L) indicates diabetes. The following information summarizes the meaning of other test results."}, {"url": "http://www.urmc.rochester.edu/encyclopedia/content.aspx?ContentTypeID=167&ContentID=glucose_urine", "passage_text": "A urine glucose test is used to indirectly determine whether your levels of glucose, or blood sugar, are within a healthy range. It's used to monitor both type 1 and type 2 diabetes. If your blood glucose rises above normal, your kidneys get rid of the extra glucose in your urine."}, {"url": "https://www.sharecare.com/health/diabetes/what-results-blood-glucose-test", "passage_text": "If you haven’t eaten within a couple hours, your blood sugar levels should be between 70 and 100. A measure of 100-125 is considered prediabetic, and 126 means you’ve got diabetes. If you’ve eaten recently and your blood sugar level reads above 200, it places you among the 80 million Americans living with diabetes."}, {"url": "https://labtestsonline.org/understanding/analytes/glucose/tab/test", "passage_text": "1 Fasting glucose (fasting blood glucose, FBG) – this test measures the level of glucose in the blood after fasting for at least 8 hours. 2  2-hour glucose tolerance test (GTT) – for this test, the person has a fasting glucose test done (see above), then drinks a 75-gram glucose drink."}]