[{"url": "http://www.cnbc.com/id/36267223", "passage_text": "New marijuana users would not be limited to adults if marijuana were legalized, just as regulations on alcohol and tobacco do not prevent use by youth. Rapidly accumulating new research shows that marijuana use is associated with increases in a range of serious mental and physical problems. Why We Should Not Legalize Marijuana. SHARES. Contrary to the beliefs of those who advocate the legalization of marijuana, the current balanced, restrictive, and bipartisan drug policies of the United States are working reasonably well and they have contributed to reductions in the rate of marijuana use in our nation."}, {"url": "http://www.alternet.org/story/60959/the_top_ten_reasons_marijuana_should_be_legal", "passage_text": "The issue of marijuana's legalization is a persistent issue that, like marijuana, will simply not go away. Marijuana will be legalized because marijuana users will continue to fight for it until they succeed. Learn more about High Times 's 420 Campaign marijuana legalization strategy. Smoking pot clearly has far fewer dangerous and hazardous effects on society than legal drugs such as alcohol. Here is High Times 's top 10 reasons that marijuana should be legal, part of its 420 Campaign legalization strategy. 10. Prohibition has failed to control the use and domestic production of marijuana."}, {"url": "http://time.com/3079707/marijuana-legalization-teens-health/", "passage_text": "Yes, it’s harmful, and yes, it should be legalized. It’s not often that the White House responds directly to a newspaper op-ed, as it did last week when the New York Times editorial board published its opinion that the federal government should repeal the ban on the production, sale and use of marijuana. "}, {"url": "http://www.huffingtonpost.com/2013/10/24/marijuana-legalization_n_4151423.html", "passage_text": "2013 has markedly been a successful year for marijuana legalization, with Colorado and Washington both passing laws to decriminalize the drug. Now, 58 percent of Americans are in favor allowing the plant to be legal. With the majority of Americans agreeing that marijuana should be legalized, we've gathered up eight reasons why those who are still on the fence about the natural plant should possibly reconsider their feelings. It's time to legalize! "}, {"url": "http://civilliberty.about.com/od/drugpolicy/tp/Why-Marijuana-Should-Be-Legalized.htm", "passage_text": "We really shouldn't have to ask why marijuana should be legal; the burden is on the government to show why it shouldn't, and none of the explanations for marijuana prohibition are especially convincing. But as long as we have to deal with the reality of marijuana laws, we can present a strong case for repeal. "}, {"url": "http://www.theatlantic.com/magazine/archive/2014/07/why-marijuana-should-be-legal-and-expensive/372303/", "passage_text": "Marijuana is becoming more mainstream: more than 20 states have legalized it in some form, and several others are mulling relaxing their pot laws. Many public-health experts speculate that if marijuana becomes a substitute for alcohol, this shift may have a positive overall influence on the health of American adults. "}, {"url": "http://www.teenink.com/opinion/drugs_alcohol_smoking/article/315432/Should-Marijuana-Be-Legal-/", "passage_text": "By Nikkko, Bayside, NY. The legalization of Marijuana is a highly heated and controversial issue in America today. Data shows that over 55% of Americans believe marijuana should continue to be illegal and the remaining 45% believe the pot‘s legal status should be altered. If pot was to be legalized the US could be savings up to $2 billion to $10 billion of tax payer money on law enforcement like the FBI, police, courts and prisons."}, {"url": "http://www.debate.org/opinions/should-marijuana-be-legalized", "passage_text": "• If legalized, marijuana can be taxed which would produce billions of dollars annually in profit which in turn would help our nation get out of debt. Cannabis farms can be set up as well, and growing and harvesting marijuana can become a profession thus lowering the unemployment rate. • It is not addictive and is actually far less addictive than caffeine. • If legalized, far less more minors would be using Cannabis. or weed would be sold in stores, valid ID must be given and the user must be at least 21 years of age."}, {"url": "http://www.usnews.com/debate-club/should-marijuana-use-be-legalized", "passage_text": "Next week, voters Colorado, Washington, and Oregon will cast ballots on the question of legalizing marijuana use. If passed, the ballot initiatives would directly contradict federal law, which classifies cannabis as a Schedule I drug under the Control Substances Act of 1970. "}, {"url": "http://abcnews.go.com/blogs/politics/2014/02/should-marijuana-be-legal/", "passage_text": "This morning on This Week, with Colorado and Washington State legalizing the sale of marijuana for recreational use, our special panel debates the law's impact and the future of marijuana policy. On Friday, George asked if marijuana should be legalized nationwide. Below are a selection of your responses. "}]