[{"url": "https://en.wikipedia.org/wiki/Walleye", "passage_text": "Walleye (Sander vitreus, formerly Stizostedion vitreum) is a freshwater perciform fish native to most of Canada and to the Northern United States. It is a North American close relative of the European pikeperch. The relationship described in this section suggests a 50 cm (20 in) walleye will weigh about 1.5 kg (3.3 lb), while a 60 cm (24 in) walleye will likely weigh about 2.5 kg (5.5 lb). In most of the species' range, male walleyes mature sexually between three and four years of age."}, {"url": "http://www.biokids.umich.edu/critters/Sander_vitreus/", "passage_text": "Walleyes are fairly small for predatory fish, reaching an average adult size of 350mm among males and 450mm among females. Walleyes are darkly colored on top, with colors ranging from brown, to olive, to dark yellow with a paler underside, ranging from white to pale yellow. For this reason, preferred walleye habitats are similar to rivers with slow-moving pools, such as oxbows, sloughs, and embayment habitats. While walleyes live in both rivers and lakes in the middle and northern end of their range, they live mostly in rivers farther south."}, {"url": "http://www.dec.ny.gov/outdoor/87391.html", "passage_text": "Walleye can be found in a variety of habitats in New York, from large lakes to small rivers. The current state record is an impressive 16 lb. 9 oz. walleye caught from Mystic Lake, Cattaraugus County. However, most walleye are much smaller with fish in the 2-3 pound range being more common. Live Bait Rigs. Popular live baits for walleye are night crawlers, minnows and leeches. They can be fished in a variety of ways, such as spinner rigs, bottom bouncing, suspended under a float or on a jig head. Spinner rigs or worm harnesses are one of the more common walleye methods."}, {"url": "http://www.aa-fishing.com/walleye-fishing.html", "passage_text": "Fish for walleye with live bait, spinners, spoons, crankbaits, jerkbaits, small spinner baits as well as plastic worms and grubs. Trolling is a very effective way to fish for these tasty fish. Walleye fishing offers a blend of the fishing trip excitement with the anticipation of at tasty meal for the successful angler. Walleye is a favorite of the white meat, fresh water fishes. Walleye spawn in spring and when the option is available, will choose to migrate from the lake up into feeder streams to spawn."}, {"url": "https://en.wikipedia.org/wiki/Walleye", "passage_text": "The walleye is the state fish of Minnesota, Vermont and South Dakota and the official fish of Saskatchewan. It is very popular with Minnesota residents; more walleye is eaten in Minnesota than in any other jurisdiction of the United States. The relationship described in this section suggests a 50 cm (20 in) walleye will weigh about 1.5 kg (3.3 lb), while a 60 cm (24 in) walleye will likely weigh about 2.5 kg (5.5 lb). In most of the species' range, male walleyes mature sexually between three and four years of age."}, {"url": "http://wdfw.wa.gov/fishing/walleye/", "passage_text": "How to Fish for Walleyes. One of the most popular sport fish in the northern and central United States has developed a similar reputation in Washington in the last several decades. Known for its exquisite flavor and large size, walleye are providing additional excitement and opportunity in a state already rich with fishing resources."}, {"url": "http://www.biokids.umich.edu/critters/Sander_vitreus/", "passage_text": "Adult walleyes feed on a large variety of fish species, including yellow perch, gizzard shads, emerald shiners, spottail shiners, and many other species, depending on what is available. For this reason, preferred walleye habitats are similar to rivers with slow-moving pools, such as oxbows, sloughs, and embayment habitats. While walleyes live in both rivers and lakes in the middle and northern end of their range, they live mostly in rivers farther south."}, {"url": "https://en.wikipedia.org/wiki/Walleye", "passage_text": "In some parts of its range, the walleye is known as the walleyed pike, colored pike, yellow pike or pickerel (esp. in English-speaking Canada), although the fish is not related to other species of pikes which are members of the family Esocidae. Walleyes show a fair amount of variation across watersheds. The relationship described in this section suggests a 50 cm (20 in) walleye will weigh about 1.5 kg (3.3 lb), while a 60 cm (24 in) walleye will likely weigh about 2.5 kg (5.5 lb). In most of the species' range, male walleyes mature sexually between three and four years of age."}, {"url": "http://www.dec.ny.gov/outdoor/87391.html", "passage_text": "Lakes can be challenging areas to fish walleye because of the amount of available fish holding locations. When fishing a lake, you may have walleyes holding in shallow water in weed beds, flats, humps, drop-offs, or in the deepwater basin. Live Bait Rigs. Popular live baits for walleye are night crawlers, minnows and leeches. They can be fished in a variety of ways, such as spinner rigs, bottom bouncing, suspended under a float or on a jig head. Spinner rigs or worm harnesses are one of the more common walleye methods."}, {"url": "http://www.biokids.umich.edu/critters/Sander_vitreus/", "passage_text": "Walleyes begin eating other fish early in life. Adult walleyes feed on a large variety of fish species, including yellow perch, gizzard shads, emerald shiners, spottail shiners, and many other species, depending on what is available. These fish may also eat smaller members of their own species. For this reason, preferred walleye habitats are similar to rivers with slow-moving pools, such as oxbows, sloughs, and embayment habitats. While walleyes live in both rivers and lakes in the middle and northern end of their range, they live mostly in rivers farther south."}]