[{"url": "http://medical-dictionary.thefreedictionary.com/acetylcholine", "passage_text": "A neurotransmitter that stimulates nicotinic receptors in autonomic ganglia, at the motor endplates of skeletal muscle, and in the central nervous system as well as muscarinic receptors in smooth muscle, in exocrine glands, and in the central nervous system. "}, {"url": "https://en.wikipedia.org/wiki/Acetylcholine", "passage_text": "Acetylcholine is the neurotransmitter used at the neuromuscular junction —in other words, it is the chemical that motor neurons of the nervous system release in order to activate muscles. This property means that drugs that affect cholinergic systems can have very dangerous effects ranging from paralysis to convulsions. The acetylcholine molecules then bind to nicotinic ion-channel receptors on the muscle cell membrane, causing the ion channels to open. Sodium ions then flow into the muscle cell, initiating a sequence of steps that finally produce muscle contraction."}, {"url": "https://en.wikipedia.org/wiki/Acetylcholine", "passage_text": "Acetylcholine has functions both in the peripheral nervous system (PNS) and in the central nervous system (CNS) as a neuromodulator. In the peripheral nervous system, acetylcholine activates muscles, and is a major neurotransmitter in the autonomic nervous system. The acetylcholine molecules then bind to nicotinic ion-channel receptors on the muscle cell membrane, causing the ion channels to open. Sodium ions then flow into the muscle cell, initiating a sequence of steps that finally produce muscle contraction."}, {"url": "https://en.wikipedia.org/wiki/Acetylcholine", "passage_text": "Acetylcholine is also used as a neurotransmitter in the autonomic nervous system, both as an internal transmitter for the sympathetic nervous system and as the final product released by the parasympathetic nervous system. The acetylcholine molecules then bind to nicotinic ion-channel receptors on the muscle cell membrane, causing the ion channels to open. Sodium ions then flow into the muscle cell, initiating a sequence of steps that finally produce muscle contraction."}, {"url": "http://www.livestrong.com/article/373400-the-effect-of-acetylcholine-on-muscle/", "passage_text": "Acetylcholine is a chemical messenger, a neurotransmitter, released by nerve cells in many parts of the peripheral nervous system. It controls the contraction of all skeletal or voluntary muscles, for instance. It also affects the contraction of smooth and cardiac muscle. The effect of acetylcholine on cardiac muscle, however, is very different from its effects on skeletal or smooth muscle. In the heart, acetylcholine activation of muscarinic receptors causes channels in the muscle membrane to let potassium pass."}, {"url": "http://www.chemistryexplained.com/A-Ar/Acetylcholine.html", "passage_text": "Acetylcholine. Photo by: RAJ CREATIONZS. Acetylcholine is the neurotransmitter produced by neurons referred to as cholinergic neurons. In the peripheral nervous system acetylcholine plays a role in skeletal muscle movement, as well as in the regulation of smooth muscle and cardiac muscle. "}, {"url": "http://medlicker.com/871-how-to-increase-acetylcholine", "passage_text": "In the peripheral nervous system, acetylcholine acts as a major neurotransmitter. On the other hand, the muscles in the skeleton are activated by the peripheral nervous system. In the muscles of the skeleton, acetylcholine joins with acetylcholine receptors. After that, in the muscle cells, the sodium ions enter. "}, {"url": "http://www.ncbi.nlm.nih.gov/pubmed/1665266", "passage_text": "Contraction of smooth muscle by acetylcholine is mediated by activation of muscarinic receptors of which M2 and M3 subtypes are present in longitudinal muscle of guinea pig intestine. The rise in internal calcium suppresses the voltage-dependent inward calcium current. A third important effect is the opening of channels which cause depolarization of the membrane and so increase action potential discharge and contraction in the whole muscle. These channels were studied by voltage-clamp of single cells from longitudinal muscle of rabbit small"}, {"url": "http://www.livestrong.com/article/373400-the-effect-of-acetylcholine-on-muscle/", "passage_text": "Acetylcholine’s Effect On Smooth Muscle. Acetylcholine activates a different type of receptor present in smooth muscle: the muscarinic receptor. When this receptor binds acetylcholine, one result is the release of calcium ions from internal stores. The effect of acetylcholine on cardiac muscle, however, is very different from its effects on skeletal or smooth muscle. In the heart, acetylcholine activation of muscarinic receptors causes channels in the muscle membrane to let potassium pass."}]