[{"url": "http://thekrazycouponlady.com/at-home/8-alternative-uses-for-listerine/", "passage_text": "2. You can use Listerine in a couple of different ways, including mixing it with shampoo in a bath or diluting it with water and using it as a spray. To get step-by-step instructions on how to use Listerine to kill fleas, check out this guide from eHow."}, {"url": "https://www.waterpik.com/oral-health/pro/order-support/faqs-for-professionals/", "passage_text": "1 Mouthwash-A small amount of mouthwash can be added to the water for flavoring and/or to enhance compliance. 2  Chlorhexidine and Listerine-Have been clinically tested for use with the Water Flosser. 3  CHX can be diluted in varying strengths."}, {"url": "https://www.sharecare.com/health/dental-drugs/can-i-overdose-on-fluoride", "passage_text": "A Stacy Wiegman, PharmD, Pharmacy, answered. Fluoride overdoses can occur if you ingest too much fluoride. For this reason, it is important to keep fluoride supplements out of reach of children. Give a supplement to your child only as directed by his dentist, doctor or pharmacist. Children can also ingest too much fluoride more slowly over time."}, {"url": "https://www.waterpik.com/oral-health/pro/order-support/faqs-for-professionals/", "passage_text": "However, patients can use certain agents with the Water Flosser: 1  Mouthwash-A small amount of mouthwash can be added to the water for flavoring and/or to enhance compliance. 2  Chlorhexidine and Listerine-Have been clinically tested for use with the Water Flosser."}, {"url": "https://answers.yahoo.com/question/index?qid=20071217152513AA6EJY9", "passage_text": "Compared to a control rinse, Listerine was statistically much more effective at reducing plaque and gingivitis. However, overuse of Listerine can lead to intra-oral lesions and soft tissue irregularities. Also, keep in mind Listerine kills both good and bad germs in your mouth. By using it too much, you're killing the healthy, protective flora and promoting yeast overgrowth. Using Listerine twice a day will be enough to give you 24 hour protection against germs that cause plaque and gingivitis, yet won't cause any damage to"}, {"url": "http://thekrazycouponlady.com/at-home/8-alternative-uses-for-listerine/", "passage_text": "Dab Listerine on the affected area using a clean cotton ball—just be sure not to use too much, and be cautious if you have sensitive skin. You can use Listerine in a couple of different ways, including mixing it with shampoo in a bath or diluting it with water and using it as a spray."}, {"url": "http://www.nytimes.com/health/guides/poison/mouthwash-overdose/overview.html", "passage_text": "This is for information only and not for use in the treatment or management of an actual poison exposure. If you have an exposure, you should call your local emergency number (such as 911) or the National Poison Control Center at 1-800-222-1222. News & Features."}]