[{"url": "http://wiki.pingry.org/u/ap-biology/index.php/Pyruvate_Oxidation_%26_The_Citric_Acid_Cycle", "passage_text": "Pyruvate oxidation, which follows glycolysis, is essentially the conversion of pyruvate molecules to carbon dioxide, acetyl coenzyme A, and NADH. The last step of glycolysis produces two pyruvate molecules in the cytosol, which are then brought to the mitochondrial matrix via active transport. There are eight steps to the citric acid cycle. 1) The acetyl group from Acetyl-CoA is transferred to the acceptor molecule, oxaloacetate. Coenzyme A can then return to pyruvate oxidation. The resulting molecule is citrate."}, {"url": "http://www.biology-online.org/dictionary/Acetyl-coa", "passage_text": "Acetyl-coa. (Science: enzyme) condensation product of coenzyme a and acetic acid, symbolised as CoAS~COCH3; intermediate in transfer of two-carbon fragment, notably in its entrance into the tricarboxylic acid cycle and in fatty acid synthesis. Acetyl-coenzyme a synthase is found in bacteria and plants and catalyses the reaction in which acetate enters metabolic pathways and forms acetyl-coenzyme a. Synonym: acetyl-coenzyme a, active acetate. Please contribute to this project, if you have more information about this term feel free to edit this page"}, {"url": "https://en.wikipedia.org/wiki/Coenzyme_A", "passage_text": "All genomes sequenced to date encode enzymes that use coenzyme A as a substrate, and around 4% of cellular enzymes use it (or a thioester, such as acetyl-CoA) as a substrate. In humans, CoA biosynthesis requires cysteine, pantothenate, and adenosine triphosphate (ATP). Coenzyme A is also the source of the phosphopantetheine group that is added as a prosthetic group to proteins such as acyl carrier protein and formyltetrahydrofolate dehydrogenase."}, {"url": "http://biology.about.com/od/cellularprocesses/ss/Citric-Acid-Cycle.htm", "passage_text": "Since two acetyl CoA molecules are generated from the two pyruvic acid molecules produced in glycolysis, the total number of these molecules yielded in the citric acid cycle is doubled to 2 ATP, 6 NADH, 2 FADH 2, 4 CO 2, and 6 H + . "}, {"url": "http://hyperphysics.phy-astr.gsu.edu/hbase/Organic/acetylcoa.html", "passage_text": "Acetyl-CoA. Acetyl-CoA is an important biochemical molecule in cellular respiration. It is produced in the second step of aerobic respiration after glycolysis and carries the carbon atoms of the acetyl group to the TCA cycle to be oxidized for energy production. "}, {"url": "https://en.wikipedia.org/wiki/Acetyl-CoA", "passage_text": "Structure of coenzyme A (CoASH or CoA) consists of a β-mercaptoethylamine group linked to the vitamin pantothenic acid through an amide linkage. The acetyl group of acetyl-CoA is linked by a high energy thioester to the sulfhydryl portion of the β-mercaptoethylamine. It is this thioester bond that makes acetyl-CoA one of the high energy compounds. Choline, in combination with acetyl-CoA, is catalyzed by the enzyme choline acetyltransferase to produce acetylcholine and a Coenzyme A byproduct. Konrad Bloch and Feodor Lynen were awarded the 1964 Nobel Prize in Physiology and Medicine for their discoveries linking acetyl-CoA and fatty acid metabolism."}, {"url": "https://en.wikipedia.org/wiki/Acetyl-CoA", "passage_text": "Acetyl coenzyme A or acetyl-CoA is an important molecule in metabolism, used in many biochemical reactions. Its main function is to convey the carbon atoms within the acetyl group to the citric acid cycle (Krebs cycle) to be oxidized for energy production. Choline, in combination with acetyl-CoA, is catalyzed by the enzyme choline acetyltransferase to produce acetylcholine and a Coenzyme A byproduct. Konrad Bloch and Feodor Lynen were awarded the 1964 Nobel Prize in Physiology and Medicine for their discoveries linking acetyl-CoA and fatty acid metabolism."}, {"url": "http://what-when-how.com/molecular-biology/acetyl-coenzyme-a-molecular-biology/", "passage_text": "Acetyl Coenzyme A (Molecular Biology). Acetyl coenzyme A (acetylCoA) consists of a two-carbon activated acetyl unit attached to coenzyme A in thioester linkage. AcetylCoA is central to energy generation from the degradative pathways of oxidative fuel metabolism and to a number of biosynthetic pathways that utilize the activated two-carbon acetyl unit. 1. Structure. The ability of acetylCoA to participate in these diverse metabolic pathways is derived from the thioester bond formed between the acyl carbon of the acetyl unit and the sulfhydryl group of coenzyme A (CoASH) (Fig."}, {"url": "http://www.biologyreference.com/Ho-La/Krebs-Cycle.html", "passage_text": "In eukaryotic cells, pyruvate is transported to the mitochondrial matrix, where the Krebs cycle takes place. Before entering the Krebs cycle, the three-carbon pyruvate is oxidized to a two-carbon acetate molecule and carbon dioxide, producing one molecule of NADH. The acetate joins to a molecule of coenzyme A to form acetyl coenzyme A, which carries the acetyl group to the Krebs cycle. The acetate enters the cycle by combining with OAA (oxaloacetic acid) to form citric acid. As the reactions of the Krebs cycle continue, the two acetyl carbons are successively oxidized to carbon dioxide, forming two molecules of NADH and one of FADH 2, which will provide electrons to the electron transport chain to form ATP."}]