[{"url": "http://www.dnaftb.org/21/problem.html", "passage_text": "HI! RNA acts as the information bridge between DNA and protein. mRNA is the message that carries genetic information from the DNA in the nucleus to the cytoplasm. tRNA is the adaptor that reads the mRNA and brings the amino acids to the ribosomes for protein synthesis. RNA polymerase is an enzyme that makes RNA using a DNA template. Like DNA polymerase, RNA polymerase adds nucleotides in the 5' to 3' direction. "}, {"url": "https://quizlet.com/4007985/dna-and-protein-synthesis-flash-cards/", "passage_text": "Initiation: a promoter nucleotide sequence signals the start of transcription. RNA polymerase enzyme attaches to the promoter to start mRNA synthesis. 2. Elongation: Individual complementary mRNA nucleotides bond together to form a single mRNA strand. 3. Termination: RNA polymerase reaches a base called a terminator. mRNA is released from the DNA template. "}, {"url": "http://classes.midlandstech.edu/carterp/Courses/bio225/chap08/lecture3.htm", "passage_text": "RNA and Protein Synthesis. During transcription, the enzyme RNA polymerase synthesizes a strand of messenger RNA (mRNA) using one strand of the gene as a template. mRNA is synthesized using nucleotides that contain the bases A, C, G, and U (instead of T), which pair with the complementary bases of the DNA template strand. The starting point for transcription, where RNA polymerase unwinds the DNA and begins to make a complementary mRNA copy, is the promoter site; the region of DNA that is the endpoint of transcription is the terminator site; mRNA is synthesized in the 5’ to 3’ direction."}, {"url": "http://classes.midlandstech.edu/carterp/Courses/bio225/chap08/lecture3.htm", "passage_text": "First of all, since RNA polymerase synthesizes mRNA from 5' to 3' (just like DNA polymerase) the DNA template strand has to be read from 3' to 5' (just like when DNA polymerase uses a DNA template strand to synthesize a new complementary DNA strand). The starting point for transcription, where RNA polymerase unwinds the DNA and begins to make a complementary mRNA copy, is the promoter site; the region of DNA that is the endpoint of transcription is the terminator site; mRNA is synthesized in the 5’ to 3’ direction."}, {"url": "http://www.laney.edu/wp/cheli-fossum/files/2012/01/DNA-Replication-and-Protein-Synthesis.pdf", "passage_text": "This is called semiconservative replication. (Each DNA is half old and half new.) Transcription – Synthesis of RNA from a DNA template Occurs in a region of the nucleus called the nucleolus. RNA polymerase enzyme synthesizes a strand of RNA complementary to a section of one of the DNA strands (the template strand). 1. Initiation: A section of DNA known as the promoter (TATA box for eukaryotes) signals where the transcription begins. RNA polymerase recognizes and binds to this site. "}, {"url": "https://en.wikipedia.org/wiki/Transcription_(genetics)", "passage_text": "Transcription is the first step of gene expression, in which a particular segment of DNA is copied into RNA (mRNA) by the enzyme RNA polymerase. The antisense strand of DNA is read by RNA polymerase from the 3' end to the 5' end during transcription (3' → 5'). The complementary RNA is created in the opposite direction, in the 5' → 3' direction, matching the sequence of the sense strand with the exception of switching uracil for thymine."}, {"url": "https://en.wikipedia.org/wiki/Complementary_DNA", "passage_text": "In genetics, complementary DNA (cDNA) is double-stranded DNA synthesized from a messenger RNA (mRNA) template in a reaction catalysed by the enzyme reverse transcriptase. cDNA is often used to clone eukaryotic genes in prokaryotes. "}, {"url": "http://www.nature.com/scitable/topicpage/Translation-DNA-to-mRNA-to-Protein-393", "passage_text": "During transcription, the enzyme RNA polymerase (green) uses DNA as a template to produce a pre-mRNA transcript (pink). The pre-mRNA is processed to form a mature mRNA molecule that can be translated to build the protein molecule (polypeptide) encoded by the original gene. In the simplest sense, expressing a gene means manufacturing its corresponding protein, and this multilayered process has two major steps. In the first step, the information in DNA is transferred to a messenger RNA (mRNA) molecule by way of a process called transcription."}, {"url": "https://answers.yahoo.com/question/index?qid=20110729013220AA8o4Gs", "passage_text": "Rating Newest Oldest. Best Answer: c. RNA polymerase The correct answer is NOT reverse transcriptase. Reverse transcriptaste is an enzyme that allows retroviruses to synthesize DNA from an RNA template. DNA polymerase, of course, synthesizes a complementary strand of DNA from a DNA template. Source(s): A.S. Liberal arts and sciences (science and mathematics). Kendra N · 4 years ago"}]