[{"url": "http://www.intrepid247.com/tips-resources/travelling-within-canada", "passage_text": "As Alberta warns its citizens: Always make sure “supplementary health insurance or travel medical insurance will assist with the cost of ground or air ambulance services.”. It could cost an out-of-province traveller more than $700 for a ground ambulance in Nova Scotia, and in Ontario $240. The cost of an air ambulance could cost $2,700 an hour in British Columbia, and nearly $3,000 per hour in Quebec. Other provinces may have similar charges, but they are not generally disclosed on government websites. It will be much less expensive for medical insurance for travel within Canada than to another country. But, unlike the cost of an air ambulance membership card in Quebec, the price will vary by age and plan. One plan for travel within Canada would charge as little as 36 cents a day for a person aged 54 or younger, and about 3.5 times as much for someone age 65 to 69"}, {"url": "http://www.viha.ca/visit/fees/patient_transportation_fees.htm", "passage_text": "If you have Medical Services Plan (MSP) coverage: Ambulance trips to hospital (911 calls)*. 1  If you are taken to a hospital by ground or air ambulance, the BC Ambulance Service (BCAS) will bill you $80. 2  If an ambulance is requested and then declined, you will receive a bill for $50. 3  If you receive Income Assistance or MSP Premium Assistance you will not be charged. 1 Ground: $530 flat rate. 2  Air ambulance (airplane): $7 per mile ($4.34/km). 3  Air ambulance (helicopter): $2,746 per hour. 4  If you do not need medical care, but are not well enough to travel on your own, then a non-emergency patient transfer service, such as Medi-Van, is recommended (fees range)."}, {"url": "http://www.health.gov.on.ca/en/public/publications/ohip/amb.aspx", "passage_text": "Otherwise, you are responsible for an ambulance service co-payment charge of $240.00 for each land ambulance service rendered, and/or the actual cost for each air ambulance service rendered. You are responsible for an ambulance service co-payment charge of $240.00 for each land ambulance service rendered, and/or the actual cost for each air ambulance service rendered 1  : if you are a resident of Ontario, and."}, {"url": "http://www.viha.ca/visit/fees/patient_transportation_fees.htm", "passage_text": "1 If you are taken to a hospital by ground or air ambulance, the BC Ambulance Service (BCAS) will bill you $80. 2  If an ambulance is requested and then declined, you will receive a bill for $50. 3  If you receive Income Assistance or MSP Premium Assistance you will not be charged. 1 Ground: $530 flat rate. 2  Air ambulance (airplane): $7 per mile ($4.34/km). 3  Air ambulance (helicopter): $2,746 per hour. 4  If you do not need medical care, but are not well enough to travel on your own, then a non-emergency patient transfer service, such as Medi-Van, is recommended (fees range)."}, {"url": "http://health.costhelper.com/air-ambulances.html", "passage_text": "1 Arranging an air ambulance flight through a broker can add hundreds or thousands of dollars to the final cost due to commissions paid to the broker. 2  Or, a service such as AirAmbulanceBroker.com provides price quotes from various companies for free. Discounts: 1  Some companies do not include ground ambulance transport from the current facility to the aircraft and from the landing location to the new facility. 2 "}, {"url": "http://www.aerocare.com/", "passage_text": "Air Ambulance & Medevac Services. AeroCare is a nationally recognized and accredited provider of worldwide air ambulance and medevac services. AeroCare’s air medical transport services also include commercial flight nurse escorts throughout the world. AeroCare offers 24 hour emergency and non-emergency medevac and medical transport services throughout the world. With aircraft bases in Illinois and Arizona, our aircraft are strategically located to provide optimal response times and cost effective air ambulance pricing."}, {"url": "http://www.wikihow.com/Determine-the-Cost-of-an-Air-Ambulance", "passage_text": "Determining the cost of an air ambulance, either by helicopter or small plane, isn’t straightforward; there are no national requirements regarding fees, which can range from under $12,000 to more than $25,000 for a short flight. While it is true that transportation to a medical facility via an air ambulance may save your life, it is also true that you will end up burdened with a lifetime of debt for the trip."}, {"url": "http://health.costhelper.com/air-ambulances.html", "passage_text": "1 For a flight from Arizona to Australia, Air Ambulance 1 charges about $155,000 on a light jet, if staffed by paramedics (about $160,000 if staffed by a doctor and nurse) or about $177,000 on a mid-sized jet (about $182,000 if staffed by a doctor and nurse). Discounts: 1  Some companies do not include ground ambulance transport from the current facility to the aircraft and from the landing location to the new facility. 2  Arranging an air ambulance flight through a broker can add hundreds or thousands of dollars to the final cost due to commissions paid to the broker."}, {"url": "http://health.costhelper.com/air-ambulances.html", "passage_text": "1 The total can be less than $2,000 for a short flight to almost $50,000 for a longer domestic flight to $200,000 or more for an international flight. 2  For example, Air Ambulance 1 charges about $2,500 for a 55-mile flight on a twin-engine propeller plane, staffed by paramedics, from Saint Joseph, MO, to Kansas City, MO. Discounts: 1  Some companies do not include ground ambulance transport from the current facility to the aircraft and from the landing location to the new facility. 2  Arranging an air ambulance flight through a broker can add hundreds or thousands of dollars to the final cost due to commissions paid to the broker."}]