[{"url": "http://www.surnamedb.com/Surname/Reid", "passage_text": "This is a surname of some controversy. Recorded in several spellings including Reid, generally held to be Scottish, Read, Reade, Reed, Red and Redd, it has at least three possible origins. "}, {"url": "http://www.babynamewizard.com/baby-name/boy/reid", "passage_text": "Origin of the name Reid: Transferred use of the surname derived from the Scottish reid (red). The name arose as a nickname for someone with red hair or a red, ruddy complexion. From A World of Baby Names by Teresa Norman. From an English surname which comes from multiple sources, including Old English read meaning red (originally a nickname given to a person with red hair or a ruddy complexion) and Old English ried meaning clearing (given to a person who lived in a clearing in the woods)."}, {"url": "http://forebears.io/surnames/reid", "passage_text": "Reid Surname Meaning. An epithet surname meaning 'red haired' or 'ruddy complexioned.' The spelling red is modern, like the pronunciation. The e was originally long, and in Chaucer mss. the form is usually reed. In later English it was reede, read, reade; in Scottish reid (Skeat, A Student's pastime, p."}, {"url": "http://forebears.io/surnames/reid", "passage_text": "Middle English reed or rede, red. Reid is a Scottish and N. English variant. Our directories teem with the name in all its forms, as is the case with all nicknames taken from the complexion of hair or face. Godwin le Rede, Norfolk, 1273. Hundred Rolls. An epithet surname meaning 'red haired' or 'ruddy complexioned.' The spelling red is modern, like the pronunciation. The e was originally long, and in Chaucer mss. the form is usually reed. In later English it was reede, read, reade; in Scottish reid (Skeat, A Student's pastime, p."}, {"url": "http://www.ancestry.com/name-origin?surname=reid", "passage_text": "Reid Name Meaning. nickname for a person with red hair or a ruddy complexion, from Older Scots reid ‘red’.topographic name for someone who lived in a clearing, from Old English r¯d ‘woodland clearing’. Compare English Read. "}, {"url": "https://en.wikipedia.org/wiki/Reid", "passage_text": "Reid is a surname of Scottish origin, and is the 90th most common surname in the UK. It may refer to: People with the surname Reid: 1  Alan Reid (disambiguation). 2  Alex Reid (disambiguation). 3  Andy Reid (disambiguation). 4  Angella Reid, White House Chief Usher. 5  Antonio Reid, record executive. "}, {"url": "http://www.thinkbabynames.com/meaning/1/Reid", "passage_text": "Reid /reid/ [1 syll.] as a boys' name (also used less generally as girls' name Reid) is pronounced reed. It is of Old English origin, and the meaning of Reid is near the reeds; red-haired. Reid is a somewhat popular first name for men (#812 out of 1220, Top 67%) and an even more popular surname for all people (#263 out of 150436, Top 1%). (2000 U.S. Census). Shown below is the baby name popularity of Reid for boys"}, {"url": "http://www.sheknows.com/baby-names/name/reid", "passage_text": "The name Reid is an English baby name. In English the meaning of the name Reid is: Red haired. American Meaning: The name Reid is an American baby name. In American the meaning of the name Reid is: Red haired. Scottish Meaning: The name Reid is a Scottish baby name. In Scottish the meaning of the name Reid is: Redheaded. Surname."}]