[{"url": "http://www.sheknows.com/baby-names/name/miriam", "passage_text": "In Biblical the meaning of the name Miriam is: Rebellion. Hebrew Meaning: The name Miriam is a Hebrew baby name. In Hebrew the meaning of the name Miriam is: Rebellious. In the Old Testament, Miriam was the sister of Moses and Aaron."}, {"url": "https://en.wikipedia.org/wiki/Maryam_(name)", "passage_text": "Maryam or Mariam is the Aramaic name (ܡܪܝܡ) of Mary the mother of Jesus and of Miriam, the sister of Moses. She is mentioned in the Greek translation of the Tanakh or Old Testament known as the Septuagint, in the original Greek text of the New Testament, and in the Qur'an."}, {"url": "http://www.meaning-of-names.com/israeli-names/mariam.asp", "passage_text": "In Israeli, the name Mariam means-wished-for child.The name Mariam originated as an Israeli name. The name Mariam is most often used as a girl name or female name. Israeli Name Meaning-wished-for child. Origin-Israel. Global Star Registery-Name a star after someone special!"}, {"url": "http://www.thinkbabynames.com/meaning/0/Mariam", "passage_text": "Mariam's name origins are French, Latin and Hebrew, and the meaning of the name Mariam is star of the sea; grace. Mariam is a version of Marian (French, Latin, Hebrew). Mariam is also a variation of Mary (Latin). Mariam is also used as a variation of Miriam (Hebrew)."}, {"url": "http://www.thinkbabynames.com/meaning/0/Mariam", "passage_text": "Mariam /mari-am/ [3 sylls.] as a girls' name. Mariam's name origins are French, Latin and Hebrew, and the meaning of the name Mariam is star of the sea; grace. Mariam is a version of Marian (French, Latin, Hebrew). Mariam is also a variation of Mary (Latin). Mariam is also used as a variation of Miriam (Hebrew)."}, {"url": "http://www.sheknows.com/baby-names/name/maryam", "passage_text": "The name Maryam is an Arabic baby name. In Arabic the meaning of the name Maryam is: Bitter. Greek Meaning: The name Maryam is a Greek baby name. In Greek the meaning of the name Maryam is: Bitter. American Meaning: The name Maryam is an American baby name. In American"}]