[{"url": "http://healthyeating.sfgate.com/nutrition-medjool-dates-5371.html", "passage_text": "With about 1.6 grams per date, Medjools are an excellent source of dietary fiber. A 3.5-ounce serving of the fruit provides 6.7 grams of fiber, or 27 percent of the daily value. All dates are especially high in soluble fiber, the type that promotes and helps maintain healthy blood glucose and cholesterol levels."}, {"url": "http://healthyeating.sfgate.com/calories-benefits-dates-4120.html", "passage_text": "A 3.5-ounce serving of pitted deglet noors, or 14 dates, provides about 282 calories, 2.5 grams of protein, less than half a gram of fat and 75 grams of carbohydrates, of which nearly 63.4 grams are the simple sugars sucrose, fructose and glucose."}, {"url": "http://www.livestrong.com/article/368890-are-medjool-dates-healthy/", "passage_text": "Almost all of these calories -- 99 percent -- come from carbohydrates, and each serving of medjool dates ups your carbohydrate intake by 54 grams. Because your brain and muscles use carbohydrates as fuel, medjool dates help promote these tissues' functions."}, {"url": "http://www.acaloriecounter.com/food/dates-medjool", "passage_text": "Here you will find the full nutrition facts for Dates, medjool including calories, protein, carbs, fat and much more."}, {"url": "http://www.livestrong.com/article/264064-nutritional-information-for-medjool-dates/", "passage_text": "Medjool dates are a fairly dense source of calories, as one 24 g date -- a little less than 1 oz. -- contains 66 calories. When dates are stuffed with high-fat ingredients such as cream cheese, the calorie count goes up. When eating dates as appetizers, many people eat more than one."}, {"url": "http://healthyeating.sfgate.com/nutrition-medjool-dates-5371.html", "passage_text": "The large, semi-soft Medjool date is moist, meaty, exceptionally sweet and widely available in the United States. A 3.5-ounce serving of Medjool dates, or about four pitted fruits, has 277 calories, 75 grams of carbohydrates, 1.8 grams of protein and almost no fat. Almost 90 percent of the carbohydrates in a serving of Medjools, or approximately 66.5 grams, are sugar."}, {"url": "http://www.livestrong.com/article/264064-nutritional-information-for-medjool-dates/", "passage_text": "Carbohydrates. Dates are rich in carbohydrates, and Medjools are no exception. One date contains 18 g of carbohydrate. Most of the carbohydrate is in the form of sugars. Medjool dates contain 8 g of glucose, 7.7 g of fructose and a negligible amount of sucrose. Not surprisingly, dates are frequently consumed as dessert."}]