[{"url": "https://en.wikipedia.org/wiki/Beta_thymosins", "passage_text": "NMR structure of a β-thymosin. Both thymosin α 1 and β-thymosins are intrinsically unstructured proteins, i.e. they lack a stable fold when free in aqueous solution. This structure, mostly alpha helix, was artificially stabilised by an organic solvent. The thymosin illustrated, originally named β 9 is the cow orthologue of human β 10. Thymosin β 4 induces the activity of the enzyme terminal deoxynucleotidyl transferase in populations of thymocytes (thymus-derived lymphocytes). This suggests that the peptide may contribute to the maturation of these cells."}, {"url": "http://www.endocrineweb.com/endocrinology/overview-thymus", "passage_text": "Thymus Essentials. 1  The thymus gland, located behind your sternum and between your lungs, is only active until puberty. 2  After puberty, the thymus starts to slowly shrink and become replaced by fat. 3  Thymosin is the hormone of the thymus, and it stimulates the development of disease-fighting T cells. The thymus reaches its maximum weight (about 1 ounce) during puberty. Thymosin: The Hormone of the Thymus. Thymosin stimulates the development of T cells. Throughout your childhood years, white blood cells called lymphocytes pass through the thymus, where they are transformed into T cells."}, {"url": "http://www.endocrineweb.com/endocrinology/overview-thymus", "passage_text": "The thymus produces and secretes thymosin, a hormone necessary for T cell development and production. The thymus is special in that, unlike most organs, it is at its largest in children. Once you reach puberty, the thymus starts to slowly shrink and become replaced by fat. The thymus reaches its maximum weight (about 1 ounce) during puberty. Thymosin: The Hormone of the Thymus. Thymosin stimulates the development of T cells. Throughout your childhood years, white blood cells called lymphocytes pass through the thymus, where they are transformed into T cells."}, {"url": "http://www.answers.com/Q/What_is_the_function_of_the_thymosin_hormone", "passage_text": "Split and merge into it. Answer by Emma Torres. Confidence votes 241. Thymosin is a hormone produced by the thymus and it works with the lymph nodes and white blood cells, for example, to buildup immunity. Source. Introduction to the Human Body. by Gerard Tortora and Bryan Derrickson. "}, {"url": "https://en.wikipedia.org/wiki/Thymosins", "passage_text": "They are named thymosins because they were originally isolated from the thymus, but most are now known to be present in many other tissues. Thymosins have diverse biological activities, and two in particular, thymosins α 1 and β 4, have potentially important uses in medicine, some of which have already progressed from the laboratory to the clinic. In relation to diseases, thymosins have been categorized as biological response modifiers."}, {"url": "http://www.wisegeek.com/what-is-a-thymosin.htm", "passage_text": "10 hilariously insightful foreign words. A thymosin is a hormone-like substance that plays an important role in regulating the immune system. Discovered in the mid-1960s, it was originally found in the thymus gland, but has also been located in many different human and animal tissues. The thymus is found in the area of the chest that is between the lungs. Alpha and beta thymosins are used to detect the presence of autoimmune diseases and cancer. Thymosin was first observed in the thymus gland. High densities of thymosin beta 4 are found in blood platelets."}, {"url": "http://www.endocrineweb.com/endocrinology/overview-thymus", "passage_text": "1 The thymus gland, located behind your sternum and between your lungs, is only active until puberty. 2  After puberty, the thymus starts to slowly shrink and become replaced by fat. 3  Thymosin is the hormone of the thymus, and it stimulates the development of disease-fighting T cells. The thymus reaches its maximum weight (about 1 ounce) during puberty. Thymosin: The Hormone of the Thymus. Thymosin stimulates the development of T cells. Throughout your childhood years, white blood cells called lymphocytes pass through the thymus, where they are transformed into T cells."}, {"url": "http://www.innerbody.com/image_endoov/lymp04-new.html", "passage_text": "The thymus gland, despite containing glandular tissue and producing several hormones, is much more closely associated with the immune system than with the endocrine system. The thymus serves a vital role in the training and development of T-lymphocytes or T cells, an extremely important type of white blood cell. The thymus is a soft, roughly triangular organ located in the mediastinum of the thoracic cavity anterior and superior to the heart and posterior to the sternum...."}, {"url": "https://eaware.org/thymus-gland/", "passage_text": "The thymus gland also produces a hormone called thymosin, which stimulates the T cells in the other lymphatic organs to mature. This gland also produces another hormone called thymopoietin, which is protein present in the mRNA (messenger RNA) and is encoded by the TMPO gene. Another function of thymus gland is to prevent the abnormal growth of cells, that may lead to cancer. The T lymphocytes travel from the bone marrow to the thymus gland where they remain until they get activated. After maturity, the lymphocytes enter the blood stream."}]