[{"url": "http://ie.linkedin.com/in/richardbruton", "passage_text": "Summary. Richard Bruton TD was appointed Minister of Jobs, Enterprise and Innovation in March 2011. He is an experienced Deputy representing Dublin North Central and is a Research Economist by profession. He was first elected to the Dail dáil in. 1982 he Was minister For enterprise And employment-1994 97 and chaired The European Industrial council During’ireland S eu presidency in. 1996 he Was minister Of state at The department Of industry And commerce-1986. 87"}, {"url": "http://www.prnewswire.com/news-releases/enterprise-ireland-dubai-hosts-irish-minister-at-arab-health-2013-188956081.html", "passage_text": "The sector brings together multinational companies and Irish owned companies-employing 25,000 people-and we are bringing representatives of both to Dubai to participate in Arab Health.. He continued, The sector is of enormous importance to Ireland but we are not resting on our laurels."}, {"url": "https://www.djei.ie/en/", "passage_text": "We develop, promote and co-ordinate science, technology and innovation policy. We influence the European and International research agenda to allow research and enterprise in Ireland avail of opportunities arising through research programmes."}, {"url": "http://www.uaeinteract.com/docs/Nahyan-receives-Irish-Minister-for-Enterprise-Jobs-and-Innovation/68110.htm", "passage_text": "NREC is also the prime developer of Abu Dhabi's Dh3.6 billion Reem Mall project in Abu Dhabi. The Irish minister expressed hope that the UAE will continue to make progress in infrastructure construction, a field he described as the foundation for economic development and welfare of peoples of the world."}, {"url": "http://irishtechnews.net/ITN3/minister-for-social-enterprise-launches-community-finance-with-over-e100-million-available/", "passage_text": "Local News. Recently appointed Minister for Social Enterprise Ann Phelan TD, formally launched Community Finance (Ireland) the new brand for one of the largest providers of finance to the community and voluntary sector in Ireland."}, {"url": "https://en.wikipedia.org/wiki/Minister_for_Jobs,_Enterprise_and_Innovation", "passage_text": "The current Minister for Jobs, Enterprise and Innovation is Richard Bruton, TD. He is assisted by: 1  Gerald Nash, TD – Minister of State for Business and Employment. 2  Damien English, TD – Minister of State for Skills, Research and Innovation."}]