[{"url": "http://www.ehealthmedicare.com/faq-does-medicare-cover-shingles-vaccine/", "passage_text": "Original Medicare, Part A and Part B, does not cover the shingles vaccination. To get this covered, you must enroll in either a stand-alone Medicare Prescription Drug Plan (PDP) or a Medicare Advantage plan that includes drug coverage (also known as MAPD)."}, {"url": "http://www.northjersey.com/news/does-medicare-cover-the-shingles-vaccine-1.539653", "passage_text": "Print. Print. Yes, the shingles vaccine is covered by Medicare but your physician cannot bill Medicare for the vaccine. Unlike some other vaccines that are covered under Part B Medicare, the shingles vaccine is covered by Part D, the Medicare Prescription Drug Plan. You purchase Part D as a private stand alone prescription plan if you have Original Medicare, sometimes referred to as Traditional Medicare."}, {"url": "https://www.medicare.gov/coverage/shingles-vaccine.html", "passage_text": "The shingles shot isn’t covered by Medicare Part A (Hospital Insurance) or Medicare Part B (Medical Insurance) . Generally, Medicare prescription drug plans (Part D) cover all commercially-available vaccines (like the shingles shot) needed to prevent illness. "}, {"url": "https://www.caring.com/questions/does-medicare-pay-for-shingles-vaccine", "passage_text": "Part D covers it as a prescription drug (even though it is a preventive vaccine). If your Medicare advantage plan covers part D (drugs) then the shingles vaccine is covered. Your copay may vary from plan to plan. CDC determines the cost of the vaccine including the administration fee is around $190 (2013 price). The copay one has to pay may vary from $60 to 80 to 100."}, {"url": "http://www.northjersey.com/news/does-medicare-cover-the-shingles-vaccine-1.539653", "passage_text": "The reason the shingles vaccine is covered by your Medicare prescription drug plan is because these plans are required, by law, to cover any commercially-available vaccine. Your Part D plan will pay for the vaccination itself and for your doctor or other health care provider to give you the shot (administration)."}]