[{"url": "http://programmerguru.com/android-tutorial/android-activity/", "passage_text": "Activity is a Java code that supports a screen or UI. In other words, building block of the user interface is the activity. Activity class is a pre-defined class in Android and every application which has UI must inherit it to create window. Let us create a simple application which displays current time when you just tap the window. We will dissect the code to understand how the activity works."}, {"url": "http://www.mkyong.com/android/how-to-set-default-activity-for-android-application/", "passage_text": "In Android, you can configure the starting activity (default activity) of your application via following “ intent-filter ” in “ AndroidManifest.xml “. See following code snippet to configure a activity class “ logoActivity ” as the default activity. File: AndroidManifest.xml."}, {"url": "http://www.learncomputer.com/tutorials/android/activities-and-intents/intent/", "passage_text": "In case, intent passes through multiple filters and there are multiple target activities eligible to receive that intent, it’s developer’s responsibility to decide which activity is to be used. In the next module, we talk about the User Interface aspects of an Android application."}, {"url": "http://www.learncomputer.com/tutorials/android/activities-and-intents/intent/", "passage_text": "Another important Android application concept is Intent. In simple words, an Intent describes the operation to be performed. Intents are used to start an activity using either of the following methods – Context.startActivity() or Activity.startActivityForResult()."}, {"url": "http://www.learncomputer.com/tutorials/android/activities-and-intents/manifest/", "passage_text": "Before we cover the key concepts of Activity and Intent, it’s important to understand one key aspect of an Android application – the manifest file (AndroidManifest.xml) . This file is present in the root folder for every Android application and it provides the following information."}]