[{"url": "http://murine.com.au/products/eye-drops/murine-clear-eyes/", "passage_text": "Lots of things can cause red and bloodshot eyes, from lack of sleep to smoky environments and swimming in chlorinated pools. Red or bloodshot eyes are caused by widening or dilation of blood vessels in the white part of the eye. The blood vessels look prominent and give the white of the eye a pink/red appearance. "}, {"url": "http://glassescrafter.com/information/cause-of-bloodshot-eyes.html", "passage_text": "When the vessel bursts, the blood leaks under the clear coating of the eye and causes the entire eye to appear bloodshot. These vessels may break for many reasons from a hard sneeze, to vomiting or high blood pressure. In some people, bloodshot eyes can be the result of contact lens wear. This redness is the result of blood vessels close to the surface of the eye becoming dilated and enlarged. There are many reasons for this to occur, some of which are relatively harmless and some that may be a cause for concern."}, {"url": "http://www.healthgrades.com/symptoms/bloodshot-eyes", "passage_text": "Bloodshot eyes describe a condition in which the whites of the eyes appear red. Bloodshot eyes occur when the blood vessels in the sclera (the white of the eye) dilate or swell. A variety of mild to serious diseases, disorders and conditions can irritate the blood vessels of the sclera and cause bloodshot eyes. Bloodshot eyes are often due to mild conditions, such as eye fatigue, dehydration, and overuse of contact lenses. They can also be due to infections and allergic reactions."}, {"url": "http://www.nytimes.com/health/guides/symptoms/eye-redness/overview.html", "passage_text": "Back to Top Causes. Bloodshot eyes appear red because the vessels at the surface of the white portion of the eye (sclera) become swollen. Vessels may swell due to: 1  Eye dryness. 2  Too much sun exposure. 3  Dust or other particles in the eye. 4  Allergies. 5  Infection. 6  Injury. Sometimes, a bright red spot, called a subconjunctival hemorrhage, will appear on the white of the eye. This often happens after straining or coughing, which causes a broken blood vessel on the surface of the eye. Most often, there is no pain and your vision is normal."}, {"url": "http://glassescrafter.com/information/cause-of-bloodshot-eyes.html", "passage_text": "Bloodshot eyes are not an attractive condition to suffer from. This redness is the result of blood vessels close to the surface of the eye becoming dilated and enlarged. There are many reasons for this to occur, some of which are relatively harmless and some that may be a cause for concern."}, {"url": "http://emedicine.medscape.com/article/1192122-overview", "passage_text": "Conjunctivitis, the most common cause of red eye, is characterized by vascular dilation of the superficial conjunctival blood vessels, cellular infiltration, and exudation; it must be differentiated on the basis of etiology (viral, bacterial, or allergic). Pathophysiology and Etiology. A red eye is caused by dilation of blood vessels in the eye. Diagnosis may be aided by the differentiation between ciliary and conjunctival injection. Ciliary injection involves branches of the anterior ciliary arteries and indicates inflammation of the cornea, iris, or ciliary body"}, {"url": "http://www.allaboutvision.com/conditions/red-eyes.htm", "passage_text": "Red eyes occur when the blood vessels on the surface of the eye expand. The appearance of red eye ranges in severity from a bright red that completely covers the sclera to a few enlarged blood vessels that look like wiggly red or pink lines across the white of the eye. On this page: Causes of red eyes • Red eye treatment • Tips for preventing red eyes. See also: Broken blood vessel in the eye • All about eye allergies • Answers to reader questions about dry eyes • Relief for dry, irritated eyes. We've all experienced red, bloodshot eyes from time to time, affecting one or both eyes. Red eye is caused by swollen or dilated blood vessels on the sclera, the white outer surface of the eye. Red eyes can be accompanied by eye pain, itching, eye discharge, swollen eyes or visual disturbances such as blurry vision. In other cases, a red eye may cause no irritation at all"}, {"url": "http://medical-dictionary.thefreedictionary.com/bloodshot", "passage_text": "bloodshot, a redness of the conjunctiva or sclera of the eye caused by dilation of blood vessels in the tissues. adjective Red and inflamed; infused with blood, or having turgid blood vessels; especially, inflamed or irritated conjunctivae."}]