[{"url": "http://www.huffingtonpost.com/2012/03/20/freezing-meat_n_1367941.html", "passage_text": "Before you put meat in the freezer, you should always write the date on it -- that way you don't have to question how long it's been frozen. And, believe it or not, some meats can last in the freezer for up to one year. 1  Cooked poultry -- 4 months. 2  Uncooked poultry parts -- 9 months. 3  Uncooked whole poultry -- 12 months."}, {"url": "http://www.stilltasty.com/fooditems/index/16508", "passage_text": "1 Ground beef that has been defrosted in the fridge can be kept for an additional 1 to 2 days in the refrigerator before cooking; ground beef that was thawed in the microwave or in cold water should be cooked immediately."}, {"url": "http://stilltasty.com/fooditems/index/16498", "passage_text": "1 How long does a cooked roast of beef last at room temperature? 2  Bacteria grow rapidly at temperatures between 40 °F and 140 °F; cooked roast beef should be discarded if left for more than 2 hours at room temperature."}, {"url": "http://stilltasty.com/fooditems/index/16498", "passage_text": "1 The precise answer to the question “How long does a cooked roast of beef last?” depends to a large extent on storage conditions — refrigerate roast beef within two hours of cooking."}, {"url": "http://www.fsis.usda.gov/wps/portal/fsis/topics/food-safety-education/get-answers/food-safety-fact-sheets/meat-preparation/ground-beef-and-food-safety/ct_index", "passage_text": "If ground beef is refrigerated promptly after cooking (within 2 hours; 1 hour if the temperature is above 90 °F), it can be safely refrigerated for about 3 or 4 days. If frozen, it should keep its quality for about 4 months."}, {"url": "http://healthycanadians.gc.ca/eating-nutrition/healthy-eating-saine-alimentation/safety-salubrite/meat-viandes/hamburger-eng.php", "passage_text": "Hamburger safety tips. Canada's food supply is considered one of the safest in the world. Still, if you eat undercooked ground beef it may result in a type of food poisoning that is commonly called hamburger disease. You can minimize your risk by handling and cooking raw ground beef properly."}, {"url": "http://www.stilltasty.com/fooditems/index/16508", "passage_text": "1 How long does ground beef last in the fridge once it is cooked? 2  Cooked ground beef will usually stay good for 3 to 4 days in the fridge and 3 months in the freezer."}]