[{"url": "http://www.oxforddictionaries.com/definition/english/contort", "passage_text": "More. torch from Middle English: A torch in the original sense of ‘something soaked in an inflammable substance used to give light’ was often made of twisted hemp or other fibres. This is still the American meaning, and reflects the word's Latin origin, torquere ‘to twist’. The Latin source of torch, torquere, is found in a large number of other English words. Most obviously it is the source of the engineer's torque (late 19th century), and the twisted Celtic neck-ring the torc (mid 19th century)."}, {"url": "http://www.yourdictionary.com/contort", "passage_text": "verb. verb. 1  To twist, wrench, or bend out of proper or natural shape: fingers contorted by arthritis. 2  See Synonyms at distort. 3  To cause to deviate from what is normal, proper, or accurate: The leaders of the movement contorted their own principles in trying to get what they wanted. When you taste something very sour and you twist your face up in an odd expression to show your displeasure, this is an example of a time when you contort your face."}, {"url": "http://www.ldoceonline.com/dictionary/contort", "passage_text": "contort with/in. His face was contorted with rage. His body contorted in agony. Definition from the Longman Dictionary of Contemporary English. Advanced Learner's Dictionary. "}, {"url": "http://www.merriam-webster.com/dictionary/contort", "passage_text": "Full Definition of CONTORT. transitive verb. intransitive verb. : to twist into or as if into a strained shape or expression. — con·tor·tion \\-ˈtȯr-shən\\ noun. — con·tor·tive \\-ˈtȯr-tiv\\ adjective. distort and contort both imply a wrenching from the natural or normal, but contort suggests a more involved twisting and a more grotesque and painful result. warp indicates an uneven shrinking that bends or twists out of a flat plane."}, {"url": "http://www.yourdictionary.com/contort", "passage_text": "LINK / CITE ADD TO WORD LIST. verb. The definition of contort is to twist or bend out very out of shape. When you taste something very sour and you twist your face up in an odd expression to show your displeasure, this is an example of a time when you contort your face."}, {"url": "http://www.yourdictionary.com/contort", "passage_text": "contort. to twist or wrench out of its usual form into one that is grotesque; distort violently: a face contorted with pain. ; from Classical Latin contortus, past participle of contorquere, to whirl, twist; from com- , together + torquere, to twist: see tort. Origin of contort. When you taste something very sour and you twist your face up in an odd expression to show your displeasure, this is an example of a time when you contort your face."}, {"url": "http://www.collinsdictionary.com/dictionary/english/contort", "passage_text": "Translations for 'contort'. 1  British English: contort If someone's face or body contorts or is contorted, it moves into an unnatural and unattractive shape or position. 2  VERBHis face contorts as he screams out the lyrics.He gesticulated wildly and contorted his body into odd shapes. "}, {"url": "http://www.definitions.net/definition/contort", "passage_text": "Wiktionary (0.00 / 0 votes) Rate this definition: contort (Verb). To twist in a violent manner; as, features contorted with fury. contort (Verb). To twist into or as if into a strained shape or expression. Origin: con- + -tort, from Middle English, from contortus, past participle of contorquere, from com- + torqueo."}, {"url": "http://www.merriam-webster.com/dictionary/contort", "passage_text": "Word Root of CONTORT. The Latin word torquēre, meaning “ to twist, ” and its form tortus give us the root tort. Words from the Latin torquēre have something to do with twisting. A re tort, or angry reply to another's words, twists those words back at the person. distort and contort both imply a wrenching from the natural or normal, but contort suggests a more involved twisting and a more grotesque and painful result. warp indicates an uneven shrinking that bends or twists out of a flat plane."}]