[{"url": "http://animals.mom.me/mating-season-reproduction-snapping-turtle-1721.html", "passage_text": "Nesting and Incubation. A female snapping turtle will typically lay her eggs in early summer. Depending on when she mated, egg-laying may extend into autumn. She chooses a nesting site in an area of loose soil, sand, loam, vegetation debris or sawdust, where she digs a nest 4 to 7 inches deep. Hatchlings will emerge from their soft shells 55 to 125 days after the mama snapping turtle lays the eggs. The time to hatching is longest in the northern part of the snapping turtle's range. Generally, incubation takes from 75 to 95 days, and hatchings emerge between August and October."}, {"url": "http://animals.mom.me/mating-season-reproduction-snapping-turtle-1721.html", "passage_text": "The Mating Season and Reproduction of the Snapping Turtle. Snapping turtles are named for their powerful jaws and defensive behavior. Dan Kitwood/Getty Images News/Getty Images. Common snapping turtles (Chelydra serpentina) are large, freshwater turtles native to North America. Hatchlings will emerge from their soft shells 55 to 125 days after the mama snapping turtle lays the eggs. The time to hatching is longest in the northern part of the snapping turtle's range. Generally, incubation takes from 75 to 95 days, and hatchings emerge between August and October."}, {"url": "http://animals.mom.me/mating-season-reproduction-snapping-turtle-1721.html", "passage_text": "Snapping turtles mate between April and November, and are most active in breeding during warmer months. They begin courtship by facing one another and moving their heads from side to side. Mating begins with the male mounting the female and adjusting his tail beneath the female's to allow the cloacal openings to touch. Hatchlings will emerge from their soft shells 55 to 125 days after the mama snapping turtle lays the eggs. The time to hatching is longest in the northern part of the snapping turtle's range. Generally, incubation takes from 75 to 95 days, and hatchings emerge between August and October."}, {"url": "http://www.tortoisetrust.org/articles/snappers.htm", "passage_text": "Hatchling snapping turtles are about the size of a quarter. (9) Adult female snapping turtles usually measure from 9.5 to 14.5 inches (24 to 36 cm) (mean carapace length is 11 inches or 28.4 cm). Adult males usually range from 9.5 to15.5 inches (24 to 39 cm) (mean carapace length is 13.3 inches or 33.6 cm)."}, {"url": "http://nationalzoo.si.edu/Animals/ReptilesAmphibians/Facts/FactSheets/Alligatorsnappingturtle.cfm", "passage_text": "Zoo Diet: During reproduction, the male alligator snapping turtle mounts the back of the female. He grasps her shell with all four of his feet and inseminates her. It is unlikely that females reproduce more than once a year, and some females lay eggs in alternate years. Alligator snapping turtles are the largest freshwater turtles. They weigh between 155 and 175 pounds (70 to 80 kg). They are characterized by three large, pronounced ridges, or keels, that run from the front to the back of the carapace."}, {"url": "http://www.biokids.umich.edu/critters/Chelydra_serpentina/", "passage_text": "The eggs and hatchlings of snapping turtles may be eaten by other large turtles, great blue herons, crows, raccoons, skunks, foxes, bullfrogs, water snakes, and large predatory fish, such as largemouth bass. However, once snapping turtles become larger, there are few animals that prey on them. Like all turtles, snapping turtles have a shell that covers their back, also called a carapace. In snapping turtles the carapace is normally between 8 and 18 1/2 inches long. The shell color ranges from dark brown to tan and can even be black."}, {"url": "http://www.chelydra.org/alligator_snapping_turtle_reproduction.html", "passage_text": "Sponsor links. Alligator snapping turtle reproduction. The alligator snapping turtles reach sexual maturity at the age between 11 - 13, and weight of about 30 pounds. They lay from 9 to 52 eggs in a single clutch, which are spherical like a ping-pong ball and 1.25 to 2 inches in diameter. They lay their eggs at night. Alligator snapping turtle reproduction. The alligator snapping turtles reach sexual maturity at the age between 11 - 13, and weight of about 30 pounds. They lay from 9 to 52 eggs in a single clutch, which are spherical like a ping-pong ball and 1.25 to 2 inches in diameter"}]