[{"url": "http://www.youtube.com/watch?v=bTyE5BRuokU", "passage_text": "Please try again later. Watch this video to learn how good governance can ensure accountability, fairness and transparency as an association makes decisions on behalf of its members. https://www.orea.com/Leadership. 1  Education. 2  Standard YouTube License."}, {"url": "http://unu.edu/publications/articles/what-does-good-governance-mean.html", "passage_text": "In short, the term “good governance” has become a catchy shorthand way to describe a variety of political and economic institutions and outcomes. While it thus is likely to remain in common public usage, as is, it is not a useful concept for development analysts and policymakers. Good governance as a concept. In general, work by the World Bank and other multilateral development banks on good governance addresses economic institutions and public sector management, including transparency and accountability, regulatory reform, and public sector skills and leadership."}, {"url": "http://www.unescap.org/resources/what-good-governance", "passage_text": "Abstract. Recently the terms governance and good governance are being increasingly used in development literature. Bad governance is being increasingly regarded as one of the root causes of all evil within our societies. "}, {"url": "http://www.goodgovernance.org.au/about-good-governance/what-is-good-governance/", "passage_text": "Accountability is a fundamental requirement of good governance. Local government has an obligation to report, explain and be answerable for the consequences of decisions it has made on behalf of the community it represents. Good governance is equitable and inclusive. A community’s wellbeing results from all of its members feeling their interests have been considered by council in the decision-making process. This means that all groups, particularly the most vulnerable, should have opportunities to participate in the process."}, {"url": "http://www.ohchr.org/EN/Issues/Development/GoodGovernance/Pages/GoodGovernanceIndex.aspx", "passage_text": "There is no single and exhaustive definition of “good governance,” nor is there a delimitation of its scope, that commands universal acceptance. The term is used with great flexibility; this is an advantage, but also a source of some difficulty at the operational level. "}, {"url": "http://www.unescap.org/sites/default/files/good-governance.pdf", "passage_text": "Introduction Recently the terms governance and good governance are being increasingly used in development literature. Bad governance is being increasingly regarded as one of the root causes of all evil within our societies. "}, {"url": "http://unu.edu/publications/articles/what-does-good-governance-mean.html", "passage_text": "“Good governance” is a term that has become a part of the vernacular of a large range of development institutions and other actors within the intenational arena. What it means exactly, however, has not been so well established. Good governance as a concept. In general, work by the World Bank and other multilateral development banks on good governance addresses economic institutions and public sector management, including transparency and accountability, regulatory reform, and public sector skills and leadership."}, {"url": "http://www.goodgovernance.org.au/about-good-governance/what-is-good-governance/", "passage_text": "Good governance is about the processes for making and implementing decisions. It’s not about making ‘correct’ decisions, but about the best possible process for making those decisions. Good decision-making processes, and therefore good governance, share several characteristics. Good governance is equitable and inclusive. A community’s wellbeing results from all of its members feeling their interests have been considered by council in the decision-making process. This means that all groups, particularly the most vulnerable, should have opportunities to participate in the process."}, {"url": "https://en.wikipedia.org/wiki/Good_governance", "passage_text": "Good governance is an indeterminate term used in international development literature to describe how public institutions conduct public affairs and manage public resources. Governance is the process of decision-making and the process by which decisions are implemented (or not implemented). The term governance can apply to corporate, international, national, local governance or to the interactions between other sectors of society. The concept of good governance often emerges as a model to compare ineffective economies or political bodies with viable economies and political bodies. Again, to refer to President Obama’s speech, what Africa needs is not more strong men, it needs more strong democratic institutions that will stand the test of time. (Applause.) Without good governance, no amount of oil or no amount of aid, no amount of effort can guarantee Nigeria’s success."}]