[{"url": "http://www.sorbacal.com/en/sulphur-so3", "passage_text": "Sulphur – SO3. SO 3 is also called Sulphuric anhydride, Sulfan ® , Sulphur trioxide or Sulphur trioxide. This product is similar to SO 2. Sulphur trioxide (also spelled sulfur trioxide) is the chemical compound with formula SO 3. In the gaseous form, this compound is a significant pollutant, and is the primary agent in acid rain. With the same origin as SO 2, this pollutant is a clear, colourless, odourless and oily liquid"}, {"url": "http://www.answers.com/Q/What_is_the_name_of_the_compound_SO3", "passage_text": "The compound Sn SO3 2 is Tin (IV) Sulphite.   It can be produced easily in a chemistry lab, but has few if any  commercial applications. 3 people found this useful. Edit. Share to: 1  The Periodic Table of Elements Life is sustained by a number of chemical elements. 1 The Periodic Table of Elements Life is sustained by a number of chemical elements. 2  They are responsible for the birth of planets and the evolution of cells to complex organisms."}, {"url": "https://en.wikipedia.org/wiki/SO3", "passage_text": "1 Sulfur trioxide, a chemical compound of sulfur and oxygen. 2  Sulfite, a chemical ion composed of sulfur and oxygen with a 2− charge. 3  SO(3) , the special orthogonal group in 3 dimensions; the rotations that can be given an object in 3-space. 4  Star Ocean: Till the End of Time, the third main game in the Star Ocean series. 1 Sulfite, a chemical ion composed of sulfur and oxygen with a 2− charge. 2  SO(3) , the special orthogonal group in 3 dimensions; the rotations that can be given an object in 3-space. 3  Star Ocean: Till the End of Time, the third main game in the Star Ocean series. 4  A staff officer of the third class, usually a junior officer."}, {"url": "http://www.answers.com/Q/What_is_the_name_of_the_compound_SO3", "passage_text": "The name of the molecular compound of chemical formula SO3 is  sulfur trioxide. As a gas, this is a pollutant agent of acid rain.  It is used as a precursor to sulfuric acid … . Jake Weatherby. 1 The Periodic Table of Elements Life is sustained by a number of chemical elements. 2  They are responsible for the birth of planets and the evolution of cells to complex organisms."}, {"url": "https://quizlet.com/37681084/chemistry-flash-cards/", "passage_text": "A) sulfur oxide B) sulfur(IV) oxide C) sulfur trioxide D) sulfur tetraoxide E) none of the above. "}, {"url": "https://en.wikipedia.org/wiki/SO3", "passage_text": "SO3 may refer to. 1  Sulfur trioxide, a chemical compound of sulfur and oxygen. 2  Sulfite, a chemical ion composed of sulfur and oxygen with a 2− charge. 1 Sulfite, a chemical ion composed of sulfur and oxygen with a 2− charge. 2  SO(3) , the special orthogonal group in 3 dimensions; the rotations that can be given an object in 3-space. 3  Star Ocean: Till the End of Time, the third main game in the Star Ocean series. 4  A staff officer of the third class, usually a junior officer."}, {"url": "https://en.wikipedia.org/wiki/Sulfur_trioxide", "passage_text": "Sulfur trioxide (alternative spelling, sul ph ur trioxide) is the chemical compound with the formula SO 3. In the gaseous form, this species is a significant pollutant, being the primary agent in acid rain. It is prepared on massive scales as a precursor to sulfuric acid. In terms of electron-counting formalism, the sulfur atom has an oxidation state of +6 and a formal charge of +3. The Lewis structure consists of an S=O double bond and two S–O dative bonds without utilizing d-orbitals. The electrical dipole moment of gaseous sulfur trioxide is zero."}, {"url": "http://www.answers.com/Q/What_is_the_name_of_the_molecular_compound_SO3", "passage_text": "Making the world better, one answer at a time. The name of the molecular compound of chemical formula SO3 is sulfur trioxide. As a gas, this is a pollutant agent of acid rain. It is used as a precursor to sulfuric acid. "}]