[{"url": "http://www.huffingtonpost.com/2014/05/08/foods-in-fridge_n_5280137.html", "passage_text": "You should store olive oil in a cool, dark place, but not in the fridge, where it will condense and turn to a harder, almost butter-like consistency. Coffee. Adam Gault via Getty Images. If you leave coffee in the refrigerator, it will lose its flavor and actually take on some of the odors in the fridge. You should store coffee in a cool, dark place, where it will retain its flavor and freshness. You can store larger quantities of coffee in the freezer, however."}, {"url": "http://www.stilltasty.com/questions/index/154/page:2", "passage_text": "Answer: No — it’s not necessary to refrigerate an opened jar of commercially manufactured peanut butter, says the National Peanut Board. An opened jar of processed peanut butter will usually keep well for about 3 months when stored in a dark cupboard at normal room temperature. And the major benefit of pantry storage, of course, is that it allows the peanut butter to spread more easily. "}, {"url": "http://stilltasty.com/fooditems/index/16649", "passage_text": "1 Do not store butter in the molded butter compartment of the refrigerator door for more than one week — butter will keep much longer when stored in the main body of the refrigerator. 1 Frozen salted butter will generally keep longer (up to 9 months for best quality) than unsalted butter (5-6 months for best quality). 2  Freezer time shown is for best quality only — foods kept constantly frozen at 0° F will keep safe indefinitely."}, {"url": "http://stilltasty.com/fooditems/index/16649", "passage_text": "1 Butter that has been continuously refrigerated will usually keep for about one month after the sell by date on the package. 2  If butter develops an off odor, flavor or appearance, it should be discarded. 1 Frozen salted butter will generally keep longer (up to 9 months for best quality) than unsalted butter (5-6 months for best quality). 2  Freezer time shown is for best quality only — foods kept constantly frozen at 0° F will keep safe indefinitely."}, {"url": "http://www.care2.com/greenliving/butter-in-the-fridge-or-safe-to-leave-on-the-counter.html", "passage_text": "The USDA guidelines state that butter should be stored in its original protective wrapping or a “container until ready for use,” and to remove from the refrigerator 10 to 15 minutes before use. The USDA even goes one step further and suggest freezing butter not intended for use within two or three days. "}, {"url": "http://gizmodo.com/stop-refrigerating-your-butter-1624023431", "passage_text": "Probably not, because you probably keep your butter in the refrigerator. It’s likely that you keep butter in the fridge because you think it’s safer that way. After all, butter is made from cream, and if you leave cream out in the open for too long, it can go bad. And if you consume bad cream, you could get sick, if not from the rancid taste then certainly from the foreign bacteria that feasted on the stuff when it was out in the open."}, {"url": "http://stilltasty.com/fooditems/index/16649", "passage_text": "1 To freeze butter, wrap tightly in heavy-duty aluminum foil or plastic freezer wrap, or place inside a heavy-duty freezer bag. 2  Frozen salted butter will generally keep longer (up to 9 months for best quality) than unsalted butter (5-6 months for best quality). 1 Frozen salted butter will generally keep longer (up to 9 months for best quality) than unsalted butter (5-6 months for best quality). 2  Freezer time shown is for best quality only — foods kept constantly frozen at 0° F will keep safe indefinitely."}, {"url": "http://thegourmetsurvivalist.com/2012/05/almond-butter-storage/", "passage_text": "If you don’t have electricity, you can store almond butter on the shelf for up to nine months, and after it’s opened, for up to three months, but again, use your eyes, nose and common sense. I’ve not been able to find a reliable source of information on this, so I can only offer my own experience. "}, {"url": "http://stilltasty.com/fooditems/index/16649", "passage_text": "Tips. 1  Butter that has been continuously refrigerated will usually keep for about one month after the sell by date on the package. 2  If butter develops an off odor, flavor or appearance, it should be discarded. 1 Frozen salted butter will generally keep longer (up to 9 months for best quality) than unsalted butter (5-6 months for best quality). 2  Freezer time shown is for best quality only — foods kept constantly frozen at 0° F will keep safe indefinitely."}, {"url": "http://www.huffingtonpost.com/2014/05/08/foods-in-fridge_n_5280137.html", "passage_text": "As with many culinary debates, there's not really a cut-and-dried answer. According to the USDA, you should store butter in its wrapper in the fridge and keep butter out only for 10 to 15 minutes before using, but some cooks will use butter after leaving it out for a week. Because butter is made from pasteurized milk, the chances of contamination are low, says cooking blog The Kitchn. If you leave coffee in the refrigerator, it will lose its flavor and actually take on some of the odors in the fridge. You should store coffee in a cool, dark place, where it will retain its flavor and freshness. You can store larger quantities of coffee in the freezer, however."}]