[{"url": "https://en.wikipedia.org/wiki/Central_nervous_system_disease", "passage_text": "Parkinson’s disease, or PD, is a progressive illness of the nervous system. Caused by the death of dopamine-producing brain cells that affect motor skills and speech. Symptoms may include bradykinesia (slow physical movement), muscle rigidity, and tremors. Every disease has different signs and symptoms. Some of them are persistent headache; pain in the face, back, arms, or legs; an inability to concentrate; loss of feeling; memory loss; loss of muscle strength; tremors; seizures; increased reflexes, spasticity, tics; paralysis; and slurred speech."}, {"url": "http://www.healthgrades.com/symptoms/leg-weakness--causes", "passage_text": "Amyotrophic lateral sclerosis (ALS, also known as Lou Gehrig’s disease; severe neuromuscular disease that causes muscle weakness and disability). Cerebral palsy (disordered brain function that leads to a variety of neuromuscular symptoms). Fibromyalgia (chronic condition that causes pain, stiffness and tenderness). Guillain-Barre syndrome (autoimmune nerve disorder). Multiple sclerosis (disease that affects the brain and spinal cord, causing weakness, coordination and balance difficulties, and other problems). Muscle breakdown (rhabdomyolysis). Muscular dystrophy (inherited disorder that causes progressive loss of muscle tissue and muscle weakness). Spinal causes of leg weakness. Conditions that affect the spinal cord, the backbone (vertebrae) or the nerves that exit from the spinal cord can all cause leg weakness along with pain, burning, numbness or a tingling sensation along the course of the nerve that is affected."}, {"url": "http://www.answers.com/Q/What_is_the_medical_term_meaning_progressive_degenerative_disease_of_the_cns_that_causes_weakness_and_other_muscular_symptoms", "passage_text": "What is the medical term meaning group of genetic diseases characterized by progressive weakness and degeneration of the skeletal muscles without affecting the nervous system? 1 Your immune system is what protects your body from illness and disease. 2  Too much stress, no…. 3  Symptoms of Degenerative Myleopathy Degenerative myelopathy is a condition that sees the wearing away of spinal tissue in dogs. 4  It is a serious condition that advances in severity over time."}, {"url": "http://www.medicinenet.com/degenerative_disc/page2.htm", "passage_text": "The pain from degenerative disc or joint disease of the spine is usually treated conservatively with intermittent heat, rest, rehabilitative exercises, and medications to relieve pain, muscle spasm, and inflammation. Medically Reviewed by a Doctor on 7/11/2014. Degeneration of the disc can cause local pain in the affected area. Any level of the spine can be affected by disc degeneration. When disc degeneration affects the spine of the neck, it is referred to as cervical disc disease. When the mid-back is affected, the condition is referred to as thoracic"}, {"url": "http://www.livestrong.com/article/117083-degenerative-muscle-disease-symptoms/", "passage_text": "The muscular dystrophies, amyotrophic lateral sclerosis, myasthenia gravis, and other inherited and acquired diseases cause muscle degeneration. The symptoms of degenerative muscle diseases relate to progressive weakness in the affected muscle groups. Degenerative muscle diseases that affect the muscles of the mouth and throat typically cause speech, chewing and swallowing difficulties. The Myasthenia Gravis Foundation of America notes that these symptoms are common with myasthenia gravis."}, {"url": "http://www.spine-health.com/conditions/degenerative-disc-disease/lumbar-degenerative-disc-disease-symptoms", "passage_text": "Lumbar Degenerative Disc Disease Video. Lumbar degenerative disc disease refers to the symptoms of lower back pain and/or radiating pain, numbness or weakness in the legs stemming from a degenerated spinal disc. Causes of Lower Back Pain Video. Chronic pain in the lower back may be caused by the discs or the joints of the spine. "}, {"url": "http://neuropathology-web.org/chapter9/chapter9fALS.html", "passage_text": "Degeneration may also infrequently involve sensory tracts. Spinal Spinal Muscular atrophy (SMA) is a genetic disorder that causes degeneration and loss of spinal and brain stem motor neurons (lower motor neurons) resulting in progressive muscle weakness. MOTOR NEURON DISEASES. Amyotrophic Lateral Sclerosis (ALS) is a fatal degenerative disorder of upper and lower motor neurons. Lower motor neuron loss causes muscle weakness, atrophy, and fasciculations; upper motor neuron involvement causes spasticity, clonus, hyperactive tendon reflexes, and Babinski signs."}, {"url": "http://www.livestrong.com/article/117083-degenerative-muscle-disease-symptoms/", "passage_text": "Overview. Degenerative muscle diseases cause progressive damage and loss of muscle cells with associated weakness. There are many types of degenerative muscle diseases, and they act in different ways to cause loss of functional muscle mass. Degenerative muscle diseases that affect the muscles of the mouth and throat typically cause speech, chewing and swallowing difficulties. The Myasthenia Gravis Foundation of America notes that these symptoms are common with myasthenia gravis."}, {"url": "http://www.livestrong.com/article/117083-degenerative-muscle-disease-symptoms/", "passage_text": "The loss of muscle cells associated with degenerative muscle diseases causes progressive and often profound loss of strength in the affected muscles. This symptom is characteristic of all degenerative muscle diseases, although the muscle groups exhibiting the most pronounced weakness vary from one disease to another. Degenerative muscle diseases that affect the muscles of the mouth and throat typically cause speech, chewing and swallowing difficulties. The Myasthenia Gravis Foundation of America notes that these symptoms are common with myasthenia gravis."}]