[{"url": "http://awfulannouncing.com/2015/skip-bayless-gets-paid-millions-espn-play-sides-fence.html", "passage_text": "But the truth is that Skip Bayless makes millions of dollars not just to debate Stephen A. Smith, but to debate himself. Skip Bayless makes millions of dollars to have opinions on everything, when it’s really opinions on nothing."}, {"url": "http://www.answers.com/Q/How_much_does_Skip_Bayless_make_each_year_from_ESPN", "passage_text": "ESPN sportscasters salaries vary over time and experience. Skip  Bayless, co-host of First Take has an annual salary of 500,000  dollars. That is nothing compared to Chris B … erman's 3 million  dollar annual salary."}, {"url": "http://www.therichest.com/celebnetworth/celeb/tv-personality/skip-bayless-net-worth/", "passage_text": "He is also a member of the inaugural class of the Vanderbilt Student Media Hall of Fame. Skip Bayless has an estimated net worth of $4 million with an annual salary of $500,000 as a commentator for ESPN. He began working as a writer for The Miami Herald for two years and then for The Los Angeles Times."}, {"url": "http://www.celebritynetworth.com/richest-athletes/skip-bayless-net-worth/", "passage_text": "Skip Bayless net worth: Skip Bayless is an American sports columnist who has a net worth of $7 million dollars. Skip's salary at ESPN is $2 million per year."}, {"url": "http://www.celebritynetworth.com/richest-athletes/skip-bayless-net-worth/", "passage_text": "$2 Million. Skip Bayless net worth: Skip Bayless is an American sports columnist who has a net worth of $7 million dollars. Skip's salary at ESPN is $2 million per year. Born in Oklahoma City, Oklahoma, Skip Bayless graduated from Vanderbilt University."}, {"url": "http://awfulannouncing.com/2015/skip-bayless-gets-paid-millions-espn-play-sides-fence.html", "passage_text": "Skip Bayless gets paid millions by ESPN to play both sides of the fence. Posted by Matt Yoder on May 11, 2015 11:45. Cavs are going to have to start making 3s to get back in this. Any Cav but LeBron, who's 6-38 from 3 in playoffs."}, {"url": "http://awfulannouncing.com/2015/skip-bayless-gets-paid-millions-espn-play-sides-fence.html", "passage_text": "— Skip Bayless (@RealSkipBayless) May 10, 2015 That was an extremely ill-timed charge by LeBron James. — Skip Bayless (@RealSkipBayless) May 10, 2015 That buzzer-beater didn't make up for the dozens he has missed in his career, but it sure helped."}]