[{"url": "http://education.jlab.org/qa/compound.html", "passage_text": "All compounds are molecules but not all molecules are compounds. Molecular hydrogen (H 2), molecular oxygen (O 2) and molecular nitrogen (N 2) are not compounds because each is composed of a single element. The smallest bit of each of these substances would be referred to as a molecule. For example, a single molecule of molecular hydrogen is made from two atoms of hydrogen while a single molecule of water is made from two atoms of hydrogen and one atom of oxygen."}, {"url": "http://www.biology-online.org/dictionary/Molecule", "passage_text": "(physics and chemistry) The smallest unit of an element or compound, made up of two or more atoms held together by strong chemical bond. Supplement. In physics and chemistry, a molecule is an electrically neutral, group of atoms that can exist alone in free state while its characteristic properties are retained. "}, {"url": "https://en.wikipedia.org/wiki/Molecule", "passage_text": "A molecule may be homonuclear, that is, it consists of atoms of a single chemical element, as with oxygen (O 2); or it may be heteronuclear, a chemical compound composed of more than one element, as with water (H 2 O). "}, {"url": "http://education.jlab.org/qa/compound.html", "passage_text": "A molecule is formed when two or more atoms join together chemically. A compound is a molecule that contains at least two different elements. The smallest bit of each of these substances would be referred to as a molecule. For example, a single molecule of molecular hydrogen is made from two atoms of hydrogen while a single molecule of water is made from two atoms of hydrogen and one atom of oxygen."}, {"url": "http://chemistry.about.com/od/moleculescompounds/f/What-Is-A-Molecule.htm", "passage_text": "The terms molecule, compound, and atom can be confusing! Here's an explanation of what a molecule is (and is not) with some examples of common molecules. Answer: Molecules form when two or more atoms form chemical bonds with each other. It doesn't matter if the atoms are the same or are different from each other. Here are examples of common molecules : Molecules made up of two or more elements are called compounds. Water, calcium oxide, and glucose are molecules that are compounds. All compounds are molecules; not all molecules"}, {"url": "http://whatis.techtarget.com/definition/molecule", "passage_text": "Part of the Computing fundamentals glossary: A molecule is the smallest particle in a chemical element or compound that has the chemical properties of that element or compound. Molecules are made up of atom s that are held together by chemical bonds. "}, {"url": "http://chemistry.about.com/od/moleculescompounds/f/What-Is-The-Difference-Between-A-Molecule-And-A-Compound.htm", "passage_text": "A molecule is formed when two or more atoms of an element chemically join together. If the types of atoms are different from each other, a compound is formed. Not all molecules are compounds, since some molecules, such as hydrogen gas or ozone, consist only of one element or type of atom. "}, {"url": "http://chemistry.stackexchange.com/questions/2879/what-is-the-definition-of-of-compound-mixture-element-and-molecule", "passage_text": "Compound: two or more different atoms bonded together. Mixture: two or more different atoms together but not joined. Molecule: two particles (same or different) bonded together. Element: only 1 type of atom; this definition is applied to things both bonded and not to itself. If one atom, then not molecule and not mixture and not compound. If two atoms and same element, then molecule and not compound and not mixture. If two atoms and not same element, then compound and molecule and not mixture. If two different molecules and evenly mixed, then homogeneous mixture. If two different substances and differentiable on the molecular level, then heterogeneous mixture. The air is a homogeneous mixture"}, {"url": "http://www.differencebetween.net/science/difference-between-molecules-and-compounds/", "passage_text": "A molecule came into being when two or more atoms interact chemically and combine together. Compound is also a molecule but it contains atom of minimum two or more elements. Generally all compounds can be considered as molecules but are molecules are not compound. A molecule can be most appropriately defined as a group of atoms tied in a definite arrangement. A compound is a substance that is made up of two or more elements having chemical bond between each other in a permanent percentage by mass. A molecule is the smallest part of a compound. One or more atoms that are chemically unite to form a molecule."}]