[{"url": "https://www.cimarex.com/", "passage_text": "Cimarex Energy Co. (NYSE: XEC) is an oil and gas exploration and production company with operations mainly located in Oklahoma, Texas and New Mexico. More."}, {"url": "http://www.investopedia.com/terms/e/exploration-production-company.asp", "passage_text": "DEFINITION of 'Exploration & Production-E&P'. An E&P company is known to be in a specific sector within the oil and gas industry. Companies involved in the high-risk/high-reward area of exploration and production focus on finding, augmenting, producing and merchandising different types of oil and gas. Next Up."}, {"url": "https://en.wikipedia.org/wiki/Production_company", "passage_text": "A production company is usually run by a producer or director, but can also be run by a career executive. In entertainment, a production company relies highly on talent or a well known entertainment franchise to raise the value of an entertainment project and draw out larger audiences."}, {"url": "http://www.investopedia.com/terms/e/exploration-production-company.asp", "passage_text": "Exploration and production (E&P) is known as the upstream oil and gas industry. The resource owners and operators of E&Ps work with a variety of contractors such as engineering procurement and construction (EPC) contractors, as well as with joint-venture partners and oil field service companies."}, {"url": "https://en.wikipedia.org/wiki/Production_company", "passage_text": "A production company provides the physical basis for works in the realms of the performing arts, new media art, film, television, radio, and video. 1  1 Tasks and functions."}, {"url": "http://smallbusiness.chron.com/start-up-film-production-company-4702.html", "passage_text": "Regardless of what your production company will do, each type of production company relies on the other types to ultimately create and produce any one film. Step 1. Pick what type of film production company you are establishing."}, {"url": "http://www.wisegeek.org/what-is-a-production-company.htm", "passage_text": "Top 10 unbelievable historical concurrencies. A production company is generally involved in producing either recorded or live entertainment. It might be responsible for booking and overseeing live rock shows, for instance."}, {"url": "https://en.wikipedia.org/wiki/Production_company", "passage_text": "A production company is responsible for the development and filming of a specific production or media broadcast. In entertainment, the production process begins with the development of a specific project."}]