[{"url": "http://ezinearticles.com/?Where-is-Cholesterol-Produced-in-the-Body?&id=1625707", "passage_text": "Now that you know where is cholesterol produced in the body you can see that it is an important part of proper bodily functions. It is also important to know that to much cholesterol is not good either and it is up to you to have your levels checked regularly and keep them under control. Cholesterol is a soft, waxy, fatty compound that is a type of steroid. It is an important nutrient that is essential in the formation and maintenance of cell membranes, and in the production of the sex hormones progesterone, testosterone, estradiol, and cortisol."}, {"url": "http://courses.washington.edu/conj/bess/cholesterol/liver.html", "passage_text": "The liver is central to the regulation of cholesterol levels in the body. Not only does it synthesize cholesterol for export to other cells, but it also removes cholesterol from the body by converting it to bile salts and putting it into the bile where it can be eliminated in the feces. "}, {"url": "http://health.howstuffworks.com/diseases-conditions/cardiovascular/cholesterol/how-the-body-uses-cholesterol.htm", "passage_text": "The body can even use cholesterol to make a significant amount of vitamin D, the vitamin responsible for strong bones and teeth, when the skin is exposed to sunlight. Cholesterol is also used to make bile, a greenish fluid that is produced by the liver and stored in the gallbladder. The body needs bile to digest foods that contain fat. Bile acts as an emulsifier -- it breaks down large globules of fat into smaller particles so they can mix better with the enzymes that digest fat. "}, {"url": "http://www.scienceclarified.com/Ca-Ch/Cholesterol.html", "passage_text": "Normally, cholesterol produced by the liver circulates in the blood and is taken up by the body's cells for their needs. Cholesterol can also be removed from the blood by the liver and secreted in bile into the small intestine. From the intestine, cholesterol is released back into the bloodstream. Eating saturated fats can cause the liver to produce more cholesterol than the body needs. Therefore, a diet high in saturated fats and cholesterol can raise blood cholesterol levels. Excess cholesterol that is not taken up by body cells may be deposited in the walls of arteries. Cholesterol and heart disease."}, {"url": "http://ezinearticles.com/?Where-is-Cholesterol-Produced-in-the-Body?&id=1625707", "passage_text": "Your liver is the primary organ responsible for the production cholesterol in your body, although a small amount is made by the lining of the small intestine and the individual cells of the body. Cholesterol is a soft, waxy, fatty compound that is a type of steroid. It is an important nutrient that is essential in the formation and maintenance of cell membranes, and in the production of the sex hormones progesterone, testosterone, estradiol, and cortisol."}, {"url": "http://www.disabled-world.com/artman/publish/body-cholesterol.shtml", "passage_text": "Your liver is the primary organ responsible for the production of cholesterol in your body, although a small amount is made by the lining of the small intestine and the individual cells of the body. Cholesterol is a soft, waxy, fatty compound that is a type of steroid. It is an important nutrient that is essential in the formation and maintenance of cell membranes, and in the production of the sex hormones progesterone, testosterone, estradiol, and cortisol. HDL cholesterol is considered the good cholesterol because its primary role is to transport LDL's back to the liver where it is disposed of. HDL is comprised of mainly protein and makes up about 20% of the cholesterol in the body."}, {"url": "http://www.buzzle.com/articles/where-is-cholesterol-produced-in-the-body.html", "passage_text": "Where is Cholesterol Produced in the Body. Cholesterol is a lipid found in animal fats, bile, blood, and nerve tissues. This article discusses how and where it is produced in the body. Cholesterol is an important component of the cell membrane. It is required for proper membrane permeability and fluidity. It plays an important role in a number of functions of the body."}, {"url": "http://www.heart.org/HEARTORG/Conditions/Cholesterol/AboutCholesterol/About-Cholesterol_UCM_001220_Article.jsp", "passage_text": "Cholesterol is a waxy substance that comes from two sources: your body and food. Your body, and especially your liver, makes all the cholesterol you need and circulates it through the blood. But cholesterol is also found in foods from animal sources, such as meat, poultry and full-fat dairy products. Your liver produces more cholesterol when you eat a diet high in saturated and trans fats."}, {"url": "http://www.scienceclarified.com/Ca-Ch/Cholesterol.html", "passage_text": "Cholesterol in the human body. Cholesterol is a biologically important compound in the human body. It is produced by the liver and used in the manufacture of vitamin D, adrenal gland hormones, and sex hormones. Large concentrations of cholesterol are found in the brain, spinal cord, and liver. Eating saturated fats can cause the liver to produce more cholesterol than the body needs. Therefore, a diet high in saturated fats and cholesterol can raise blood cholesterol levels. Excess cholesterol that is not taken up by body cells may be deposited in the walls of arteries. Cholesterol and heart disease."}, {"url": "http://www.disabled-world.com/artman/publish/body-cholesterol.shtml", "passage_text": "Now that you know where is cholesterol produced in the body you can see that it is an important part of proper bodily functions. It is also important to know that to much cholesterol is not good either and it is up to you to have your levels checked regularly and keep them under control. HDL cholesterol is considered the good cholesterol because its primary role is to transport LDL's back to the liver where it is disposed of. HDL is comprised of mainly protein and makes up about 20% of the cholesterol in the body."}]