[{"url": "https://answers.yahoo.com/question/index?qid=20060628094149AAFPYw2", "passage_text": "20 minutes is the average time that this takes for a meal that includes some fat, some carbs and some proteins. If it is a protein only meal or one that is high in fat, it can take 40 minutes to an hour because the stomach must first digest the proteins into useable carbs before sending them to the bloodstream. Best Answer: It takes only seconds for physical food to reach the physical stomach. However, the feeling of fullness is not determined by the filling of the stomach, but by an increase in blood sugar, which tells the brain you no longer need food."}, {"url": "http://www.answers.com/Q/How_long_does_it_take_a_meal_to_leave_your_stomach", "passage_text": "It takes anywhere from 1 to 3 hours for food to completely exit the stomach, depending on how much food you and what food you eat (protein takes longer to digest). Large meals … take 2 to 5 hours. How long it takes to get a flat stomach depends on a variety of  factors such as body shape, how much exercise you do and how many  calories you consume per day. You would n … eed to follow a strict  diet and exercise plan to flatten your stomach, and this could take  months if not years."}, {"url": "http://www.answers.com/Q/How_long_does_it_take_a_meal_to_leave_your_stomach", "passage_text": "It usually takes about 4 to 6 hours for a full stomach to digest the food. However, this varies from person to person, and if vomitting occurs, much less time. It takes … from 12 to 24 hours for the food to completely leave the digestive/excremetory systems. 7 people found this useful. How long it takes to get a flat stomach depends on a variety of  factors such as body shape, how much exercise you do and how many  calories you consume per day. You would n … eed to follow a strict  diet and exercise plan to flatten your stomach, and this could take  months if not years."}, {"url": "http://medicine62.blogspot.com/2009/11/generally-how-long-does-food-stay-in.html", "passage_text": "3 to 3 hrs in stomach. 6 to 8 hrs for digestion. it stays in the stomach for 2 hours and then in the intestine for another 2 hours. the undigested food goes to the large intestine and the digested food goes to whole body through blood. Carbhydrates and proteins about 1 1/2 -2 hrs. Fats 2 hrs"}, {"url": "http://boards.straightdope.com/sdmb/showthread.php?t=469164", "passage_text": "Once you have swallowed and your food has reached your stomach, how long does it take for it to completely be digested and for your stomach to become completely empty again? Does it depend on the food? It can take several hours for all the food to empty, by which time you've probably added more food. Your stomach is therefore working all day long."}, {"url": "http://www.mayoclinic.org/digestive-system/expert-answers/FAQ-20058340", "passage_text": "Digestion time varies between individuals and between men and women. After you eat, it takes about six to eight hours for food to pass through your stomach and small intestine. Food then enters your large intestine (colon) for further digestion, absorption of water and, finally, elimination of undigested food. "}, {"url": "http://www.vegsource.com/talk/raw/messages/100039792.html", "passage_text": "Re: How long does it take for food to leave the stomach. October 10, 2012 at 3:29 am PST. 1  Re: How long does it take for food to leave the stomach by Mark on 10/10/12 (2). 2  Re: How long does it take for food to leave the stomach by Libre on 10/10/12 (1). 1 Re: How long does it take for food to leave the stomach by Mark on 10/10/12 (2). 2  Re: How long does it take for food to leave the stomach by Libre on 10/10/12 (1). 3  Re: How long does it take for food to leave the stomach by Mark on 10/11/12 (0)."}, {"url": "http://whyeat.net/forum/threads/27269-How-long-does-it-take-for-food-to-leave-the-stomach", "passage_text": "In the stomach, food tends to hang around in the stomach for different time scales depending on a variety of factors including the amount of food you have consumed, how much fat it contains, and also the acidity of the stomach. However, all food should have left the stomach within 2 to 4 hours. (approx. time spent in stomach before emptying) Liquid: Water-when stomach is empty, leaves immediately and goes into intestines, Juices-Fruit vegetables, vegetable broth - 15 to 20 minutes. Semi-liquid (blended salad, vegetables or fruits) - 20 to 30 min. Fruits: Watermelon - 20 min.digestion time. "}]