[{"url": "http://www.chron.com/news/nation-world/world/article/Nazi-stolen-Amber-Room-of-gold-may-finally-be-foun-6112457.php", "passage_text": "A tourist looks at the amber room, part of which had been restored by Russian craftsmen, July 10, 2000, in St. Catherine''s Palace in Tsarskoye Selo near St.Petersburg, Russia. Kaliningrad''s customs officials donated 2.5 tons of amber for restoration of the famous room. "}, {"url": "http://www.spiegel.de/international/germany/digging-for-nazi-treasure-german-treasure-hunters-claim-to-have-found-amber-room-a-536358.html", "passage_text": "Treasure hunters in Germany claim they have found hidden gold in an underground cavern that they are almost certain contains the Amber Room treasure, believed by some to have been stashed away by the Nazis in a secret mission in the dying days of World War II. I'm well over 90 percent sure we have found the Amber Room, the mayor of Deutschneudorf, Heinz-Peter Haustein, who led the search, told SPIEGEL ONLINE. The chamber is likely to be part of a labyrinth of storage rooms that the Nazis built here. I knew it was in this area"}, {"url": "http://www.amberroom.org/history.htm", "passage_text": "The Amber Room, Amber parts or iron parts holding some elements together, never have been found during the investigation... the Amber Room did not burn. It was last seen in spring of 1944 in Koenigsberg königsberg or still was there in the beginning Of september, 1944 if the letters Of. Dr rhodes count as. evidence The Amber Room together with the parquet and the doors had been removed and packed by the help and supervision of museum experts and art scientists in uniform. Thanks to the notice in the diary, the offenders are known."}, {"url": "https://en.wikipedia.org/wiki/Amber_Room", "passage_text": "Originally constructed in the 18th century in Prussia, the Amber Room disappeared during World War II and was recreated in 2003. Before the room was lost, it was considered an  Eighth Wonder of the World . Construction of the Amber Room first took place around 1701 in Prussia. The room was designed by German baroque sculptor Andreas Schlueter schlüter And danish amber Craftsman Gottfried. wolfram Corner section of the reconstructed Amber Room. The Amber Room was begun in 1701 with the purpose of being installed at Charlottenburg Palace, the residence of Frederick, the first King of Prussia, at the urging of his second wife, Sophie Charlotte."}, {"url": "http://www.dailymail.co.uk/news/article-1369271/60-year-hunt-Russian-Czars-missing-Amber-Room-discovery-Germany.html", "passage_text": "Discovery: Researchers in Germany may have found original Amber Room that was stolen. Pictured here is the replica made in the 70s. When its 565 candles were lit the Amber Room was said to 'glow a fiery gold'. Then he found details of clandestine shipments from the city of Koenigsberg-now Kaliningrad and part of Russia but in 1945 the main city of Germany's province of East Prussia-which was the last known storage place of the fabled Amber Room before it fell to the Red Army."}, {"url": "http://worldsoffascination.blogspot.com/2012/01/where-is-lost-amber-room.html", "passage_text": "The mysterious disappearance of the Amber Room has inevitably produced many groups of people who have hunted for the treasure, and some have even claimed to have found it, although none of the amber has ever been recovered. So if the Amber Room had been evacuated on this ship it is now at the bottom of the sea, and as the site of the wreck has been designated as a war memorial, it will never be open for exploration or salvage."}, {"url": "http://www.dailymail.co.uk/news/article-1369271/60-year-hunt-Russian-Czars-missing-Amber-Room-discovery-Germany.html", "passage_text": "Share this article. Share. Then he found details of clandestine shipments from the city of Koenigsberg-now Kaliningrad and part of Russia but in 1945 the main city of Germany's province of East Prussia-which was the last known storage place of the fabled Amber Room before it fell to the Red Army."}, {"url": "http://www.amberroom.org/history.htm", "passage_text": "The Amber Room had been brought to Koenigsberg, königsberg because it was made. There this is Why. Dr rohde writes in one of his, articles that The Amber room returned to its true, home the only origin of The. amber The Amber Room together with the parquet and the doors had been removed and packed by the help and supervision of museum experts and art scientists in uniform. Thanks to the notice in the diary, the offenders are known."}]