[{"url": "https://en.wikipedia.org/wiki/History_of_the_Republic_of_India", "passage_text": "India held its first national elections under the Constitution in 1952, where a turnout of over 60% was recorded. The National Congress Party won an overwhelming majority, and Jawaharlal Nehru began a second term as Prime Minister. In 1974, India tested its first nuclear weapon in the desert of Rajasthan. Meanwhile, in the Indian protectorate of Sikkim, a referendum was held that resulted in a vote to formally join India and depose the Chogyal. On 26 April 1975, Sikkim formally became India's 22nd state."}, {"url": "https://en.wikipedia.org/wiki/India", "passage_text": "In the Indian Ocean, India is in the vicinity of Sri Lanka and the Maldives; in addition, India's Andaman and Nicobar Islands share a maritime border with Thailand and Indonesia. With 7 of the world's top 15 information technology outsourcing companies based in India, the country is viewed as the second-most favourable outsourcing destination after the United States, as of 2009. India's consumer market, the world's eleventh-largest, is expected to become fifth-largest by 2030."}, {"url": "https://in.answers.yahoo.com/question/index?qid=20070208043016AABEsgR", "passage_text": "Although India became independent on 15th August 1947, we still had Lord Mountbatten. Therefore, in reality we became democratic when India became a Republic on 26th January 1950. The Constitution came into effect from 26th Jan,1950. However, it is not a perfect democratic model. I was surprised to read the response of the Maoist leader in Nepal about India's democracy."}, {"url": "https://en.wikipedia.org/wiki/India", "passage_text": "India, officially the Republic of India (Bhārat Gaṇarājya), is a country in South Asia. It is the seventh-largest country by area, the second-most populous country with over 1.2 billion people, and the most populous democracy in the world. With 7 of the world's top 15 information technology outsourcing companies based in India, the country is viewed as the second-most favourable outsourcing destination after the United States, as of 2009. India's consumer market, the world's eleventh-largest, is expected to become fifth-largest by 2030."}, {"url": "https://en.wikipedia.org/wiki/History_of_the_Republic_of_India", "passage_text": "The Constituent Assembly adopted the Constitution of India, drafted by a committee headed by Dr. B. R. Ambedkar, on 26 November 1949. India became a sovereign, democratic, republic after its constitution came into effect on 26 January 1950. Dr. Rajendra Prasad became the first President of India. In 1974, India tested its first nuclear weapon in the desert of Rajasthan. Meanwhile, in the Indian protectorate of Sikkim, a referendum was held that resulted in a vote to formally join India and depose the Chogyal. On 26 April 1975, Sikkim formally became India's 22nd state."}, {"url": "https://in.answers.yahoo.com/question/index?qid=20070208043016AABEsgR", "passage_text": "Report Abuse. India gave itself a Constitution which made India a Republic. The Constitution came into effect from 26th Jan,1950. However, it is not a perfect democratic model. I was surprised to read the response of the Maoist leader in Nepal about India's democracy."}, {"url": "http://www.meritnation.com/ask-answer/question/how-did-india-become-democratic-pls-tell-fast/what-is-democracy-why-democracy/2395755", "passage_text": "More Answers. THE ANSWER IS SHORT:-. The history of the Republic of India began on 26 January 1948. The country became an independent dominion within the British Commonwealth 15 August 1947. "}, {"url": "https://en.wikipedia.org/wiki/History_of_the_Republic_of_India", "passage_text": "The history of the Republic of India began on 26 January 1950. The country became an independent nation within the British Commonwealth on 15 August 1947. Concurrently the Muslim-majority northwest and east of British India was separated into the Dominion of Pakistan, by the partition of India. In 1974, India tested its first nuclear weapon in the desert of Rajasthan. Meanwhile, in the Indian protectorate of Sikkim, a referendum was held that resulted in a vote to formally join India and depose the Chogyal. On 26 April 1975, Sikkim formally became India's 22nd state."}, {"url": "http://therace.in/ianswer.php?question=india-became-a-sovereign-democratic-republic-on-&iqid=548&itid=18", "passage_text": "Ours is a democratic form of Government. According to Abraham Lincoln the former President of America 'Democracy is a government of the people, for the people and by the people'. In a Democracy voice of the people is given utmost importance. India attained freedom on 15th August 1947. Our National leaders set up the Constituent Assembly to draw a Constitution for India. Our constitution came into force on 26th January 1950, we celebrate this day as the Republic day."}]