[{"url": "http://www.answers.com/Q/How_to_change_Ford_ranger_automatic_transmission", "passage_text": "Making the world better, one answer at a time. Remove the Ford Ranger automatic transmission drain plug. The drain plug is in the bottom of the transmission. Allow the oil to drain out and replace the plug. Fill the transmission with new transmission fluid. You can start by removing a few of the bolts holding the transmission fluid pan to the underside of the transmission, which will likely allow some of the fluid to drain out. While carefully holding the pan in place, remove the rest of the bolts, and remove the pan."}, {"url": "http://www.ehow.com/how_5837801_remove-transmission-ford-ranger.html", "passage_text": "Unscrew the transmission oil pan bolts from the transmission using a wrench. Wait until all the fluid has drained from the pan, then remove the pan from the transmission. Unscrew the two bolts that secure the torque converter access cover to the converter housing using a socket. Unscrew the bolts that secure the starter motor to the engine block, using a socket. Tie the starter motor to the vehicle’s frame using a plastic wire tie, so that the motor does not hang from the wiring harness. Unscrew the transmission cooler lines from the passenger side of the transmission, using a line wrench."}, {"url": "http://www.ehow.com/how_5336603_out-ford-ranger-transmission.html", "passage_text": "Remove the Transmission from the Vehicle. Place a transmission jack underneath the transmission. Raise the jack until it is supporting the weight of the transmission. Remove the bolts that connect the engine to the transmission. Remove the bolts that secure the transmission to the engine. Remove the bolts that secure the transmission to the transmission crossmember. Remove the bolts that connect the transmission crossmember to the vehicle's frame. Remove the transmission crossmember from the vehicle. Slide the transmission rearward until the front of the transmission housing disengages from the locating pins on the engine block"}, {"url": "http://www.youtube.com/watch?v=SJ-CBzPjWzo", "passage_text": "This feature is not available right now. Please try again later. How to remove the transmission on a 1999 Ford Ranger. This is a 5 speed manual with 2WD. 2.5 liter 4 cylinder engine. This procedure took about an hour. 1  Autos & Vehicles. 2  Standard YouTube License. "}, {"url": "https://answers.yahoo.com/question/index?qid=20090529120947AAp3xeo", "passage_text": "Rating Newest Oldest. Best Answer: maybe the starter is holding it. you don,t have to take the converter bolts out to get the transmission out. the converter would just stay on the flex plate when you drop the transmission that,s all. the converter would just slide right out of the pump and stay on the flex plate. sounds more like the starter needs to be taken clean off. Source(s): "}, {"url": "https://answers.yahoo.com/question/index?qid=20070818203900AAslvuu", "passage_text": "Here is how, remove the cover that allows you to access the torque converter remove all the torque converter bolts (rotate the crankshaft a full turn to make sure they are out, next unbolt the u-bolts for the driveshaft. Disconnect all the electrical conectors and the shift linkage. Attach the transmission to the transmission jack. Remove the transmission mounts and remove the two last bell housing bolts. Using a prybar make sure the flywheel is free from the torque converter. Lower the transmission from the truck. Installation is the reverse of removal"}, {"url": "http://www.ehow.com/how_5837801_remove-transmission-ford-ranger.html", "passage_text": "Pull the crossmember from the vehicle. Unscrew the bolts that secure the transmission to the engine block, using a socket. Slide the transmission backward, away from the engine. Lower the transmission jack and slide it out from underneath the vehicle. Unscrew the bolts that secure the starter motor to the engine block, using a socket. Tie the starter motor to the vehicle’s frame using a plastic wire tie, so that the motor does not hang from the wiring harness. Unscrew the transmission cooler lines from the passenger side of the transmission, using a line wrench."}, {"url": "https://answers.yahoo.com/question/index?qid=20070818203900AAslvuu", "passage_text": "Now remove all except two of the easiest bell housing bolts to access. Attach the transmission to the transmission jack. Remove the transmission mounts and remove the two last bell housing bolts. Using a prybar make sure the flywheel is free from the torque converter. Lower the transmission from the truck. Installation is the reverse of removal"}]