[{"url": "http://www.peoplespharmacy.com/2014/08/04/what-can-you/", "passage_text": "It takes a long time (about 6 months) for the nail to grow out, but the fungus is gone. However, it does come back and the treatment has to be repeated.” M.W. “I have had fungus and nail bed damage on my right thumb nail (about half way up the nail) for approximately 8 eight years. "}, {"url": "http://www.sterishoe.com/foot-care-blog/toenail-fungus/how-long-does-toenail-fungus-treatment-take/", "passage_text": "The answer varies from person to person because it depends upon how long it takes for your toenail to grow out. Discovery Health says it can take “a year to a year-and-a-half to grow from cuticle to tip.” As long as your old infected nail is there, you will still have toenail fungus. No matter which course of treatment you choose, you will still have to wait for this process to happen"}, {"url": "http://www.sterishoe.com/foot-care-blog/toenail-fungus/how-long-does-toenail-fungus-treatment-take/", "passage_text": "If you have no risk of liver problems, you may want to try a prescription medication like Lamisil, which shows some results within three months of daily use. Some people with recurrent toenail fungus opt to have laser toenail treatments done. One study revealed that 85% of the toenails had improved after six months. Discovery Health says it can take “a year to a year-and-a-half to grow from cuticle to tip.” As long as your old infected nail is there, you will still have toenail fungus."}, {"url": "http://ezinearticles.com/?How-Long-Does-It-Take-To-Get-Rid-Of-A-Nail-Fungus-Infection?&id=446786", "passage_text": "1. The first question a person may ask when they develop a nail fungus infection is how long it will take to get rid of the infection. The duration of a nail fungus infection depends on the severity of the infection, the type of treatment that is used and the general health of the person. These medications are typically taken for three months but it can take up to a year for a new nail to fully grow. Some people use a foot soak for nail fungus infections that is a combination of vinegar and hydrogen peroxide."}, {"url": "http://www.killnailfungus.com/stop-nail-fungus-cm/1_0_1_0_C/", "passage_text": "1 There are remedies that work in getting rid of nail fungus, but it can take as long as a year for complete results to be obtained. 2  By reading all the recommendations and suggestions from others suffering from fungus infection of the nails on KillNailFungus.com you should find something that works for you. I have nail fungus for a year, but I have treated it by using Vicks. I clipped out my bad nail since it was detached from the nail bed. I then applied vicks generously twice a day, and in around 3 months my complete nail was healthy. I have been fighting toenail fungi for 5-10 years. The MD script Lamisil did not work."}, {"url": "http://getridofnailfungus101.com/how-long-does-nail-fungus-take-to-go-away/", "passage_text": "If you discover you have nail fungus at home when you have the right medication at your fingertips. With nail fungus you don’t need to have your treatment done by your medical practitioner; as long as you follow the medicine instructions you’ll find that home treatment is effective and comfortable. You might actually be quite surprised how common nail fungus is You would actually be surprised just how common nail fungus is than most people realize and can be quite dangerous. If you share a home with family, make sure you don’t share towels, and other personal items."}, {"url": "http://www.sterishoe.com/foot-care-blog/toenail-fungus/how-long-does-toenail-fungus-treatment-take/", "passage_text": "Unfortunately, it could take forever to get rid of toenail fungus if you wait for it to go away on its own. “Sad fact is, a toenail fungus problem will not usually go away on its own,” says the California Foot and Ankle Doctors. Discovery Health says it can take “a year to a year-and-a-half to grow from cuticle to tip.” As long as your old infected nail is there, you will still have toenail fungus."}, {"url": "http://ezinearticles.com/?How-Long-Does-It-Take-To-Get-Rid-Of-A-Nail-Fungus-Infection?&id=446786", "passage_text": "If your nail fungus infection lingers you should see your doctor to rule out underlying health problems that may be associated with the fungus infection. Because you are the one in control of treatment it is really up to you to decide how long a nail fungus infection will last. These medications are typically taken for three months but it can take up to a year for a new nail to fully grow. Some people use a foot soak for nail fungus infections that is a combination of vinegar and hydrogen peroxide."}]