[{"url": "http://www.mybarcodestore.com/gs1-pricing.htm", "passage_text": "When you purchase a UPC code from GS1 you pay an initial fee, and a yearly fee every year after that. You are basically renting your UPC codes. The pricing varies depending on the number of UPC codes you purchase. So a single bar code costs $250.00 plus $50.00 a year for each year you continue to use the bar code. If you need 25 bar codes, you pay $750.00 plus $150.00 for each additional year you need the bar code. These reoccurring fees can certainly add up. Elfring Fonts Inc. 2020 Dean St, Unit N."}, {"url": "http://www.codeupc.net/", "passage_text": "Most products put into distribution require a valid UPC or EAN code, also known as GTIN [Global Trade Item Number]. Here at Code UPC we offer an instant solution. Once payment is completed the UPC codes are generated instantly on the checkout page and a copy is delivered via email. Welcome to Code UPC! We deliver UPC codes, EAN codes and barcodes to merchants worldwide. All types of businesses are welcome including amazon sellers, google merchants, yahoo merchants, online and local retailers."}, {"url": "http://www.codeupc.net/", "passage_text": "Your source for UPC Codes. Welcome to Code UPC! We deliver UPC codes, EAN codes and barcodes to merchants worldwide. All types of businesses are welcome including amazon sellers, google merchants, yahoo merchants, online and local retailers."}, {"url": "http://voices.washingtonpost.com/small-business/2007/10/how_do_iget_a_upc_bar_code.html", "passage_text": "The U.S. branch is in Dayton, Ohio. To obtain a UPC, you first must become a GS1 member and pay a fee to the global standards-setting body. It's not cheap. Membership will cost at least $750 for the initial fee and then there's an annual fee of at least $150. GS1 calculates member fees based on annual revenue and on the number of unique products the member sells."}, {"url": "http://www.howmuchisit.org/how-much-does-a-upc-code-cost/", "passage_text": "1 On average, UPC code can cost anywhere between $7.95 and $250. 2  GS1 will charge you $250 for 10 unique products with a yearly renewal rate of $50. 3  However, in order to receive a UPC code, you will need to pay at least $750 for the initial fee and at least $150 a year to keep your membership active. 1 Membership costs begin at $250 and can be as high as $750 for the initial charges. 2  There is an annual renewal fee starts at $50 up to $150. 3  The fees depend upon the number of unique items you sell. 4  There are lots of barcode hardware and software available."}, {"url": "http://www.howmuchisit.org/how-much-does-a-upc-code-cost/", "passage_text": "1 GS1 will charge you $250 for 10 unique products with a yearly renewal rate of $50. 2  However, in order to receive a UPC code, you will need to pay at least $750 for the initial fee and at least $150 a year to keep your membership active. 1 Membership costs begin at $250 and can be as high as $750 for the initial charges. 2  There is an annual renewal fee starts at $50 up to $150. 3  The fees depend upon the number of unique items you sell. 4  There are lots of barcode hardware and software available."}, {"url": "http://www.howmuchisit.org/how-much-does-a-upc-code-cost/", "passage_text": "1 To obtain Universal Product Codes, one must first become a member of GS1 and pay capacity-based membership fees to this global standards-setting body. 2  Membership costs begin at $250 and can be as high as $750 for the initial charges. 3  There is an annual renewal fee starts at $50 up to $150. 1 Membership costs begin at $250 and can be as high as $750 for the initial charges. 2  There is an annual renewal fee starts at $50 up to $150. 3  The fees depend upon the number of unique items you sell. 4  There are lots of barcode hardware and software available."}, {"url": "http://www.mybarcodestore.com/gs1-pricing.htm", "passage_text": "$750.00. With Elfring Fonts, a single bar code costs $50.00 and there are never any additional fees. If you need 25 bar codes, you pay only $500.00. Even 100 bar codes cost only $750.00 and you don't have to worry about GS1's reoccurring $150 a year fee. Elfring Fonts Inc. So a single bar code costs $250.00 plus $50.00 a year for each year you continue to use the bar code. If you need 25 bar codes, you pay $750.00 plus $150.00 for each additional year you need the bar code. These reoccurring fees can certainly add up. Elfring Fonts Inc. 2020 Dean St, Unit N."}, {"url": "https://buyabarcode.com/how-much-does-a-upc-barcode-cost/", "passage_text": "Buying a UPC Barcode for your product can vary in cost depending on where you purchase them from. All genuine barcodes originate from the GS-1 which is the governing organization of UPC Barcodes. Purchasing a UPC prefix from the GS-1 makes sense for larger manufactures or product distributors. These days, purchasing and maintaining a UPC prefix from the GS-1 can be quite expensive. The cost can range $250 up to $10,500 for Barcodes depending on how many you need. There is also an Annual Renewal Fee that can range from $50 to $2,100. This means that if you purchase your barcodes directly from the GS-1, the barcodes will always cost you money to maintain"}, {"url": "http://voices.washingtonpost.com/small-business/2007/10/how_do_iget_a_upc_bar_code.html", "passage_text": "That number enables a firm to create its own identification code. A company needs a different UPC code for each type of product it sells. Each bar code reflects a product's weight, cost, size, etc. For example, a 12 oz. can of Coke has a different UPC than a 16 oz. can or a 2 liter bottle. Membership will cost at least $750 for the initial fee and then there's an annual fee of at least $150. GS1 calculates member fees based on annual revenue and on the number of unique products the member sells."}]