[{"url": "http://healthyeating.sfgate.com/sources-insoluble-fiber-1413.html", "passage_text": "Whole-wheat flour, whole grains and wheat bran are chock-full of insoluble fiber. Read the nutrition facts label on your favorite type of bread or cereal. Ingredients on food labels are listed by weight. The term whole grain or whole wheat should be listed in the first few ingredients."}, {"url": "http://healthyeating.sfgate.com/add-insoluble-fiber-wheat-2358.html", "passage_text": "Alternative Grains. Most whole grains contain insoluble fiber, which is found in the bran portion of the grain. Rye, barley and brown rice all contain high levels of insoluble fiber and are generally easy to find at grocery stores or health food stores. Avoid rye and barley if you are removing gluten from your diet."}, {"url": "http://healthyeating.sfgate.com/add-insoluble-fiber-wheat-2358.html", "passage_text": "Most whole grains contain insoluble fiber, which is found in the bran portion of the grain. Rye, barley and brown rice all contain high levels of insoluble fiber and are generally easy to find at grocery stores or health food stores. Avoid rye and barley if you are removing gluten from your diet."}, {"url": "http://www.mayoclinic.org/healthy-lifestyle/nutrition-and-healthy-eating/in-depth/fiber/art-20043983", "passage_text": "Fiber is commonly classified as soluble, which dissolves in water, or insoluble, which doesn't dissolve. 1  Soluble fiber. 2  This type of fiber dissolves in water to form a gel-like material. 3  It can help lower blood cholesterol and glucose levels."}, {"url": "http://www.mayoclinic.org/healthy-lifestyle/nutrition-and-healthy-eating/in-depth/fiber/art-20043983", "passage_text": "Most plant-based foods, such as oatmeal and beans, contain both soluble and insoluble fiber. However, the amount of each type varies in different plant foods. To receive the greatest health benefit, eat a wide variety of high-fiber foods."}, {"url": "https://www.nlm.nih.gov/medlineplus/ency/article/002136.htm", "passage_text": "1 Soluble fiber is found in oat bran, barley, nuts, seeds, beans, lentils, peas, and some fruits and vegetables. 2  It is also found in psyllium, a common fiber supplement. 3  Some types of soluble fiber may help lower risk of heart disease. 4  Insoluble fiber is found in foods such as wheat bran, vegetables, and whole grains."}, {"url": "http://www.mayoclinic.org/healthy-lifestyle/nutrition-and-healthy-eating/in-depth/fiber/art-20043983", "passage_text": "1 Soluble fiber. 2  This type of fiber dissolves in water to form a gel-like material. 3  It can help lower blood cholesterol and glucose levels. 4  Soluble fiber is found in oats, peas, beans, apples, citrus fruits, carrots, barley and psyllium."}, {"url": "https://www.nlm.nih.gov/medlineplus/ency/article/002136.htm", "passage_text": "1 It is also found in psyllium, a common fiber supplement. 2  Some types of soluble fiber may help lower risk of heart disease. 3  Insoluble fiber is found in foods such as wheat bran, vegetables, and whole grains. 4  It adds bulk to the stool and appears to help food pass more quickly through the stomach and intestines."}]