[{"url": "http://convert-to.com/conversion/length/convert-chain-length-to-ft.html", "passage_text": "Convert chain (chain-unit) versus feet (ft) in swapped opposite direction from feet to chains Or use utilized converter page with the length or distance multi-units converter conversion result for two length or distance units: From unit SymbolEquals ResultTo unit Symbol 1 chain chain-unit = 66.00 feet ft. "}, {"url": "http://www.metric-conversions.org/length/chains-to-feet.htm", "passage_text": "Chains. Unit of length equal to 66 feet, used especially in the U.S. public land surveys. The original measuring instrument (Gunter's chain) was literally a chain consisting of 100 iron links, each 7.92 inches long. Steel-ribbon tapes began to supersede chains around 1900, but surveying tapes are often still called chains and measuring with a tape is often called chaining."}, {"url": "http://www.gloverfamily.com/docs/landmeasurements.htm", "passage_text": "These were literally chains made up of 100 links. Each Chain was 66 feet long. Each link was 0.666 of a foot...or 7.92. To convert the distances on a plat measured in chains (abbreviate Ch) simply multiply the distance in chains by 66. Another common unit of measurement was the Pole. The Pole is exactly what it sounds like; a wood pole which was 16.5' feet long."}, {"url": "http://www.asknumbers.com/FeetToChainConversion.aspx", "passage_text": "Feet to chains conversion table shows the most common values for the quick reference. Alternatively, you may use the converter below to convert any other values. 1 Foot = 0.0151515152 Chain. 1 Chain = 66 Feet. Foot is an imperial, us customary length unit and commonly used in daily life. Historically, it is also one of the oldest units of length since in most ancient systems, they were using parts of human body as a measurement of length. 1 foot is 12 inches and 1/3 of a yard. The abbreviation is ft or ′ (prime symbol). Chain is an old unit of length used in some english speaking countries."}, {"url": "https://en.wikipedia.org/wiki/Chain_(unit)", "passage_text": "A chain (ch) is a unit of length. It measures 66 feet, or 22 yards, or 100 links, or 4 rods (20.1168 m). There are 10 chains in a furlong, and 80 chains in one statute mile. An acre is the area of 10 square chains (that is, an area of one chain by one furlong). The chain has been used for several centuries in Britain and in some other countries influenced by British practice."}, {"url": "https://en.wikipedia.org/wiki/Link_(unit)", "passage_text": "The link (usually abbreviated as l., li. or lnk.), sometimes called a Gunter’s link, is a unit of length formerly used in many English-speaking countries. A link is exactly 66⁄100 of a foot, or exactly 7.92 inches. The unit is based on Gunter's chain, a metal chain 66 feet long with 100 links, that was formerly used in land surveying. "}, {"url": "http://www.metric-conversions.org/length/inches-to-chains.htm", "passage_text": "Unit of length equal to 66 feet, used especially in the U.S. public land surveys. The original measuring instrument (Gunter's chain) was literally a chain consisting of 100 iron links, each 7.92 inches long. Steel-ribbon tapes began to supersede chains around 1900, but surveying tapes are often still called chains and measuring with a tape is often called chaining."}, {"url": "http://www.aqua-calc.com/what-is/length/chain", "passage_text": "Chain is a length measurement unit. Chain is a unit of length or distance was used for land measurements in the Imperial (UK) and US measurement systems. One chain is defined as twenty two (22) yards or sixty six (66) feet. What is chain (unit). Chain is a unit of length or distance was used for land measurements in the Imperial (UK) and US measurement systems. One chain is defined as twenty two (22) yards or sixty six (66) feet."}, {"url": "http://www.unitconversion.org/length/chain-conversion.html", "passage_text": "A chain is a unit of length. A chain measures generally between 60 and 100 feet. If not otherwise qualified, the chain as a unit normally refers to the English unit chain, also called a Gunter's chain. This is defined as 66 feet (20.1168 metres). It is also known as the surveyor's chain or land chain. "}]