[{"url": "https://en.wikipedia.org/wiki/Rocker_arm", "passage_text": "Rocker arm. A rocker arm (in the context of an internal combustion engine of automotive, marine, motorcycle and reciprocating aviation types) is an oscillating lever that conveys radial movement from the cam lobe into linear movement at the poppet valve to open it. When the camshaft lobe raises the outside of the arm, the inside presses down on the valve stem, opening the valve. When the outside of the arm is permitted to return due to the camshafts rotation, the inside rises, allowing the valve spring to close"}, {"url": "http://www.crankshaftcoalition.com/wiki/Rocker_arms", "passage_text": "[edit] Overview. The rocker arm is a fulcrum. Its job is to turn the cam lobe's circular rotation into an up and down movement. This is able to be done because the rocker has a pivot point or fulcrum that allows the cam lobe to open the valve. These rockers are called 1.5 ratio rockers or just 1.5 rockers for short. This means that the rocker arm tip at the valve end of the rocker moves 1.5 times the amount of movement seen at the pushrod end of the rocker-which is also the same amount as the camshaft's lobe lift. Let's say your camshaft has 0.350"}, {"url": "http://www.knowyourparts.com/technical-articles/performance-rocker-arm-history/", "passage_text": "The shorter the pushrod side of the rocker arm and the longer the valve side of the rocker arm, the higher the lift ratio of the rocker. If the length of the valve side of the rocker is 1.5 times that of the pushrod side, the lift ratio will be 1.5:1. "}, {"url": "http://performancetrends.com/Definitions/Rocker-Ratio.htm", "passage_text": "Rocker Ratio Rocker Arm Ratio is the length of the valve side of the rocker arm to the center (or pivot point) of the rocker arm divided by the length of the Cam or Pushrod side to the center of the rocker arm. Typically the valve side is longer than the pushrod or cam side, so the Rocker Arm will multiply its motion by its Rocker Ratio. This ratio is typically in the range of 1.45 to 1.7, meaning that for each .100 of pushrod or cam motion you would get .145 to .170 of valve motion. Rocker Ratio."}, {"url": "http://www.crankshaftcoalition.com/wiki/Rocker_arms", "passage_text": "[edit] Rocker arm ratio. The rocker arm's pivot point is not in the center of the rocker; instead it is offset more towards the pushrod. The amount of offset is expressed as a ratio (1.5, 1.6, 1.7, etc.). The rocker arm ratio multiplied by the cam lobe lift equals the net valve lift. The stock small-block Chevy rocker arm has a 1.5:1 ratio. These rockers are called 1.5 ratio rockers or just 1.5 rockers for short. This means that the rocker arm tip at the valve end of the rocker moves 1.5 times the amount of movement seen at the pushrod end of the rocker-which is also the same amount as the camshaft's lobe lift. Let's say your camshaft has 0.350"}, {"url": "http://www.gregsengine.com/rocker-arm-ratio.html", "passage_text": "The rocker arm is the link between the camshaft and the valves-functioning as a lever arm to multiply the cams lobe lift to the valve lift. Stock rocker arm ratios vary between manufacturers and engine types, but generally all small block Chevy's come with a 1.5:1 ratio rocker arm. The ratio of a rocker arm is determined by the distance between the centerline of the pivot point to the centerline of the roller tip (or area of contact with the valve stem), divided by the centerline of the pushrod to the centerline of the pivot point (X)."}, {"url": "http://www.answers.com/Q/What_is_a_rocker_arm", "passage_text": "In traditional engines (not overhead cam), the camshaft pushes lifters UP. Lifters push the pushrods UP, but the valves need to be pushed DOWN... so the rocker arm rock … s on a shaft that pushes one side down when the other side goes up. It's not a difficult job. Rocker arms aren't doing the most stressful job in the engine, but they do eventually wear out."}, {"url": "http://www.wisegeek.com/what-is-a-rocker-arm.htm", "passage_text": "10 most extreme places on Earth. A rocker arm is a valvetrain component in internal combustion engines. As the arm is acted on by a camshaft lobe, it pushes open either an intake or exhaust valve. This allows fuel and air to be drawn into the combustion chamber during the intake stroke or exhaust gases to be expelled during the exhaust stroke. "}, {"url": "https://en.wikipedia.org/wiki/Rocker_arm", "passage_text": "The drive cam is driven by the camshaft. This pushes the rocker arm up and down about the trunnion pin or rocker shaft. Friction may be reduced at the point of contact with the valve stem by a roller cam follower. A similar arrangement transfers the motion via another roller cam follower to a second rocker arm. When the camshaft lobe raises the outside of the arm, the inside presses down on the valve stem, opening the valve. When the outside of the arm is permitted to return due to the camshafts rotation, the inside rises, allowing the valve spring to close"}]