[{"url": "https://uk.answers.yahoo.com/question/index?qid=20070728082334AAaRybS", "passage_text": "Report Abuse. Eating something like bread before drinking alcohol will line your stomach, also drinking water between each alcoholic drink will make it less likely that you are sick or get a hangover. Mixing milk and alcohol is more likely to make you sick as the milk will curdle. libbyft · 8 years ago."}, {"url": "https://answers.yahoo.com/question/index?qid=20100927232614AAJQBK3", "passage_text": "I heard somewhere that drinking a glass of milk before drinking alcohol helps prevent vomiting if you get drunk, is it true? Does the milk coat your stomach or slow alcohol absorption or something?"}, {"url": "http://www.wikihow.com/Prevent-a-Hangover", "passage_text": "1 Have a big glass of water before you start drinking, then try to drink a glass of water for every alcoholic drink that you have over the course of the night. 2  Your body will thank you for it in the morning."}, {"url": "http://goaskalice.columbia.edu/answered-questions/milk-alcohol-does-body-good", "passage_text": "Keep in mind that it typically takes the liver an hour to metabolize the alcohol in twelve ounces of beer, four to five ounces of wine, or one and a half ounces of 80-proof drinks. If drinking on an empty stomach, a person may seem to feel the effects of alcohol faster, but the alcohol can also irritate the stomach."}, {"url": "http://goaskalice.columbia.edu/answered-questions/milk-alcohol-does-body-good", "passage_text": "Dear Reader, Part of drinking responsibly is becoming familiar with the myths and facts about consuming alcohol. It is commonly believed that having milk or something greasy will coat the stomach and prevent you from getting drunk."}, {"url": "http://www.boldsky.com/health/disorders-cure/2014/foods-to-eat-before-drinking-alcohol-prevent-hangover-037291.html", "passage_text": "Not many know that when you consume healthy foods, you can drink more too! It is also safer for one to consume alcohol when your tummy is full and not hungry. These healthy foods to eat before drinking alcohol will protect the stomach too and not cause the alcohol to burn the thin layer in the intestine."}]