[{"url": "http://www.obesitycoverage.com/weight-loss-surgery-insurance-coverage-and-costs/", "passage_text": "A lot of time can be spent studying, reading and talking to post-op patients about their surgery. The average cost of gastric bypass surgery is $23,000, the average cost of lap band is $14,500, and the average cost of sleeve gastrectomy surgery is $14,900. So before getting too involved, spend time determining if your insurance will cover weight loss surgery."}, {"url": "http://health.costhelper.com/gastric-bypass-surgery.html", "passage_text": "1 For patients with insurance coverage, it is not uncommon for out-of-pocket costs for gastric bypass surgery -- which often include copays for office visits and coinsurance for surgery, to run from hundreds to several thousand of dollars."}, {"url": "http://health.costhelper.com/gastric-bypass-surgery.html", "passage_text": "Gastric bypass surgery -- the most common type is called Roux-en-Y gastric bypass -- is a form of weight loss surgery in which the doctor permanently reduces the size of the stomach to a small pouch, then attaches a tube of intestine to the pouch, bypassing about two feet of intestines."}, {"url": "https://www.gastricsurgeon.com/costs", "passage_text": "How much does gastric bypass surgery cost? The cost of gastric bypass surgery can range from $20,000 to $50,000. On average, gastric bypass surgery cost is usually about $25,000. The amount you pay out-of-pocket will depend on your insurance."}, {"url": "http://health.costhelper.com/stents.html", "passage_text": "I am a cardiologist who puts in the heart stents. I put in over 200 per year. I work for a group of 4 cardiologist. The cost of a stent is anywhere from 1500.00 to 3000.00. The overall cost do the procedure what the hospital charges is anywhere from 16000.00 to 22000.00. As time goes on insurances allow less money and will not pay if people come back within 30 days."}, {"url": "http://ptca.org/forumtopics/topic20010824.html", "passage_text": "From the looks of what it costs just for one stent, I can only imagine that my bill will be somewhere in the $60,000 range, meaning that I will end up with a bill I have to pay that is around $18,000. I make $25,000 a year. So much for insurance."}, {"url": "http://www.howmuchisit.org/how-much-does-a-stent-cost/", "passage_text": "1 The cost also depends on the stent’s type and the duration of stay in the hospital. 2  PSmag.com claims that the stent itself can cost $1,000 to $4,000. 3  The procedure, on the other hand, is going to range anywhere from as little as $30,000 to as much as $100,000."}]