[{"url": "http://www.ezlan.net/WOL.html", "passage_text": "Wake On LAN-Switch your computer ON through your LAN or the Internet. Wake on LAN (WOL) is a way to Switch On a computer that is connected to a Network from a Remote Computer. To support WOL you must have a computer with Motherboard that supports WOL, as well as a Network Controller (NIC) supporting this function. Most of the newer Motherboard (circa 2002 and On), have an On Board NIC that supports WOL. Otherwise you need to install a PCI NIC that is WOL capable"}, {"url": "http://www.nirsoft.net/utils/wake_on_lan.html", "passage_text": "1 In order to enable the Wake-on-LAN feature on the remote computer: 2  On some computers, you may need to enable this feature on the BIOS setup. 3  In the network card properties, you should go to the 'Power Management' and/or 'Advanced' tabs of the network adapter, and turn on the Wake-on-LAN feature. WakeMeOnLan allows you to wake up a computer on your network without displaying any user interface, by using the /wakeup command-line option. You can specify the computer name, IP address, or the free user text that you typed in the properties window, as long as the computer information is stored inside the .cfg file."}, {"url": "http://lifehacker.com/348197/access-your-computer-anytime-and-save-energy-with-wake-on-lan", "passage_text": "Enable Wake-on-LAN in Your BIOS. To access your BIOS, restart your computer and press and hold the Delete key (or whatever key your BIOS prompts you to hold) to enter the BIOS setup. Once you're in the BIOS, head to the Power management section and look for a Wake-on-LAN setting. Enable Wake-on-LAN in Windows. To enable Wake-on-LAN in Windows, right-click My Computer (or Computer in Vista), select Properties, then click on Device Manager (in XP that's in the Hardware tab). Find your network card in the hardware list, right-click it and click Properties again"}, {"url": "http://www.howtogeek.com/192642/how-to-remotely-turn-on-your-pc-over-the-internet/", "passage_text": "To make this work, you’ll first have to set up Wake-On-LAN normally. You’ll typically find this setting in a computer’s BIOS. Enter the BIOS and ensure the Wake-On-LAN option is enabled. If you don’t see this option in your BIOS, check the computer or motherboard’s manual to see if it supports Wake-on-LAN. The computer may not support Wake-on-LAN or WoL may always be enabled with no related options in the BIOS. "}, {"url": "http://wakeonlan.me/", "passage_text": "Online Wake-On-LAN. Home Products. Wake on LAN (WOL) is a standard that allows you to turn on a computer from another location over a network connection or Internet-read more about Wake-On-LAN and its proper configuration (rarely you can see it named as Wake-On-WAN. WAN = wide area network, such as Internet). This page is an online Wake-On-LAN tool that allow you to wake up your remote computer over Internet. It can be used for PC maintainence or any similiar purpose. The only things you should know are IP address of remote computer and it's MAC address."}, {"url": "https://support.microsoft.com/en-us/kb/2776718", "passage_text": "The Wake on LAN (WOL) feature wakes a computer from a low-power state when a network adapter detects a WOL event. Typically, such an event is a specially constructed Ethernet packet. The default behavior in response to WOL events has changed from Windows 7 to Windows 8. "}, {"url": "https://itworkerdaily.wordpress.com/2007/06/01/wol-wake-up-on-lan-how-to-set-it-up/", "passage_text": "If the computer powers on, then it’s all good ! If not, well, it is not over. You have to look at the settings of the computer that you want to wake up. You first need to set up the BIOS. Enter the BIOS, and look for a setting called “WOL, “Wake up ON LAN”, “Remote wake up”… Set this setting to “enable”. On some computers, if fast boot is enabled, it disables WOL. Check this. Then, you need to set up the network adapter options in Windows to enable WOL. Boot Windows and log on as an administrator. Launch Device Manager, select the network adapter used for WOL, open the properties and click the “advanced” tab. "}]