[{"url": "http://forums.studentdoctor.net/threads/why-do-clinical-pharmacists-make-less-than-retail-pharmacists.702130/", "passage_text": "1) Supply and demand. There are so many retail positions vacant that companies have to offer high pay to fill the jobs. There are more pharmacist that want to be clinical pharmacists than there are jobs, so they don't need to offer as high of a salary to fill the job. 2) Cinical pharmacists don't bring in the $$$$ for an organization the way a dispensing pharmacist does"}, {"url": "http://www.payscale.com/research/US/Job=Pharmacist/Salary", "passage_text": "Pay by Experience Level for Pharmacist. Median of all compensation (including tips, bonus, and overtime) by years of experience. Experience and pay tend to be weakly linked for Pharmacists — those with more experience do not necessarily bring in higher earnings. Even the relatively untried can take home bulky six-figure salaries; employees who have worked for fewer than five years report earning $108K on average. In fact, this transition is more common than anything else, and median pay for the role is $105K. Another common career choice for Pharmacists is to move into a Pharmacist in Charge role — this promotion usually pays $116K."}, {"url": "https://uk.answers.yahoo.com/question/index?qid=20090529122323AAirnjR", "passage_text": "Physicians and surgeons make on average anywhere from $137,119 per year to $259,948 per year depending on specialty. Pharmacists make on average $102,336 per year. Pay is maybe $5,000 less in hospital practice than in retail pharmacy. And yes, the doctor of pharmacy degree can take 8 years. Best Answer: Generally Doctors are more highly paid, but there is alot of Money to be made as a Pharmacist. You only have to study for 5 years to become a Doctor Can i just say, anybody who goes into Medicine just for the money will just be miserable and it really isn't the right job."}, {"url": "http://money.usnews.com/careers/best-jobs/pharmacist", "passage_text": "Salary. The median annual salary for a pharmacist was $119,280, or $57.35 per hour, in 2013. The best-paid 10 percent made $147,350, while the lowest-paid made $89,000. The best-compensated pharmacists are employed by merchandise stores. Most of the more than 100 PharmD programs require applicants to take the Pharmacy College Admissions Test. And after completing the program, there are several examinations to pass, as well as an optional one-, two-or three-year residency program."}, {"url": "http://work.chron.com/much-pharmacist-make-annually-3545.html", "passage_text": "Four states paid pharmacists more than $120,000 per year on average in 2011, according to the BLS. Alaska and Maine had average annual pay of $125,330 and $125,310 respectively. California paid an average of $122,800 per year, and Vermont paid an average of $122,490 annually. States With The Most Jobs. Five states had more than 12,000 pharmacist jobs in the 2011 BLS survey. California had 22,960 pharmacists, the largest number of any state. Texas had 20,000 pharmacists earning an average of $113,570 per year. New York and Florida had more than 17,000 pharmacists each and paid mean annual income of $111,750 and $111,760, respectively. In Pennsylvania, 12,110 pharmacists received average annual salaries of $105,210"}]