[{"url": "http://www.imdb.com/title/tt0181739/trivia", "passage_text": "Bill Murray 's character mentions a National Chicken Wing Festival in Buffalo, New York. While the festival did not exist during the filming of the movie, this mention caused organizers to create an annual festival in Buffalo. The dreams that Frank has in the order they are seen are: Honey, I forgot my pants; The Exam with disclaimer He didn't study... and the test is in five minutes!; Your Worst Nightmare with Uncle Bob marrying Shane; Girls from the bus stop."}, {"url": "http://memory-beta.wikia.com/wiki/Oralian_Way", "passage_text": "The Oralian Way is a Cardassian religion dating back to the early Hebitian people of Cardassia. Followers of the Way worship the deity Oralius and have a holy scripture called the Hebitian Records, where everything is written. "}, {"url": "http://tvtropes.org/pmwiki/pmwiki.php/Film/OsmosisJones", "passage_text": "1 Disney Death: There are actually 3 of these in this movie. 2  First, in a rare instance where a villain suffers a Disney Death, but is Killed Off for Real later on, after Osmosis Jones and Thrax blew up The Zit, they thought Thrax was dead, but when Osmosis goes to the movie theater, he finds out Thrax is alive. 1 The false eyelash that Shane's friend gives her. 2  In the climax, Ozzy and Thrax duke it out on top of it. 3  Thrax doesn't realize that it's fake until he gets his hand stuck in it...just before it falls off of Shane's eye into a beaker of alcohol. 4  Cue dramatic death scene."}, {"url": "http://tvtropes.org/pmwiki/pmwiki.php/Film/OsmosisJones", "passage_text": "Osmosis: (seeing Thrax in Frank's subconscious in a movie theater) Thrax is alive! Thrax is alive and in Frank's brain! Makeout teen: Thanks for spoiling the ending! 1  Stealth Pun: After Thrax first appears, he saunters along the boat while humming the melody from Fever. 1 The false eyelash that Shane's friend gives her. 2  In the climax, Ozzy and Thrax duke it out on top of it. 3  Thrax doesn't realize that it's fake until he gets his hand stuck in it...just before it falls off of Shane's eye into a beaker of alcohol. 4  Cue dramatic death scene."}, {"url": "http://www.imdb.com/character/ch0002004/quotes", "passage_text": "Shrek : [ grabs Donkey ] No! No, no no no. No. [ Donkey keeps humming the Duloc song ]. Shrek: All right, you're going the right way for a smacked bottom. Donkey: Sorry 'bout that. The Donkey: But that's no way to behave in front of a princess. [ Fiona burps louder ]. Princess Fiona: Thanks. The Donkey : [ to Shrek ] She's as nasty as you are. Shrek: Hold the phone. Princess Fiona: Well, when one lives alone, one has to learns these things in case there's..."}, {"url": "http://tvtropes.org/pmwiki/pmwiki.php/Film/OsmosisJones", "passage_text": "1 Thrax uses it to escape Frank's body. 2  The false eyelash that Shane's friend gives her. 3  In the climax, Ozzy and Thrax duke it out on top of it. 4  Thrax doesn't realize that it's fake until he gets his hand stuck in it...just before it falls off of Shane's eye into a beaker of alcohol. 1 The false eyelash that Shane's friend gives her. 2  In the climax, Ozzy and Thrax duke it out on top of it. 3  Thrax doesn't realize that it's fake until he gets his hand stuck in it...just before it falls off of Shane's eye into a beaker of alcohol. 4  Cue dramatic death scene."}, {"url": "http://tvtropes.org/pmwiki/pmwiki.php/Film/OsmosisJones", "passage_text": "After Thrax starts doing some damage, Osmosis is paired up with a cold pill named Drix (David Hyde Pierce). The two clash frequently, as most new cop partners do in movies, until Drix sees Thrax himself, and takes Ozzy's side. 1 The false eyelash that Shane's friend gives her. 2  In the climax, Ozzy and Thrax duke it out on top of it. 3  Thrax doesn't realize that it's fake until he gets his hand stuck in it...just before it falls off of Shane's eye into a beaker of alcohol. 4  Cue dramatic death scene."}, {"url": "https://www.fanfiction.net/s/11312448/1/Daddy-Thrax", "passage_text": "Hold on, baby.. Thrax said. Thrax still had his black trench coat on, so he wrapped the coat around the little girl's body as she clutched onto his gray turtle neck shirt and held her firmly. Quickly, he jumped over the dresser and past the fire quickly, making it out of the bedroom."}, {"url": "http://www.youtube.com/watch?v=XeSpW75M2w8", "passage_text": "* Thrax is short for 'Anthrax', a lethal disease who's main symptom is a terrible, deadly fever. Despite those two strong similarities, Thrax shares no other similarities with the Anthrax disease and is in fact not an Anthrax virus, and is most likely a fictitous disease. *The song Thrax is humming is called 'Fever'. "}]