[{"url": "http://www.costowl.com/home-improvement/roof-epdm-cost.html", "passage_text": "1 In general, you should expect the EPDM roofing cost to be between $2.50 and $5.00 per square foot. 2  For an average-sized roof of 1,500 square feet, that s a total cost of around $4,000 to $8,000. 3  Installing EPDM roofing on a small area because it involves more detailed work might cost up to $1"}, {"url": "http://home.costhelper.com/rubber-roof.html", "passage_text": "1 Having an EPDM rubber roof professionally installed runs around $2.50-$4.50 a square foot or $2,250-$4,000 for a 30x30-foot flat roof on a single family home, depending on thickness, color, local labor rates and whether the old roof has to be removed."}, {"url": "http://www.homewyse.com/services/cost_to_install_membrane_roofing_system.html", "passage_text": "Our free calculator uses recent, trusted data to estimate costs for your Membrance Roofing Installation project. For a basic 120 square feet project in zip code 47474, the benchmark cost to Install a Membrane Roofing System ranges between $3.16 - $6.09 per square foot* ."}, {"url": "http://www.costowl.com/home-improvement/roof-pvc-cost.html", "passage_text": "The actual cost of PVC roofing may vary based on your location, the materials selected, the complexity of the installation, and other factors. 1  PVC roofing generally costs $4.00 to $7.00 per square foot installed, but could be as much as $8.00 to $12.00 or more per square foot."}, {"url": "http://www.costowl.com/home-improvement/roof-pvc-cost.html", "passage_text": "1 PVC roofing generally costs $4.00 to $7.00 per square foot installed, but could be as much as $8.00 to $12.00 or more per square foot. 2  For an average sized 1,500 square foot roof, that works out to a total PVC roofing cost of $6,000 to $18,000."}, {"url": "http://www.improvenet.com/r/costs-and-prices/membrane-roofing", "passage_text": "Costs. Average highest cost: $1.50 per square foot. Average lowest cost: $0.30 per square foot. Rubber membrane roofs have some of the lowest costs of all roofing materials. The difference in price stems primarily from location, material thickness and coloration."}, {"url": "http://home.costhelper.com/roof.html", "passage_text": "1 A metal roof is lightweight, durable, fire-resistant and does not rot. 2  A professionally installed steel roof can be $5,100-$22,000 for steel roofing on a simple one-story ranch-style house; aluminum runs $11,900-$24,200 for the same roof; and copper jumps to $25,500-$39,600."}, {"url": "http://www.costowl.com/home-improvement/roof-pvc-cost.html", "passage_text": "1 For an average sized 1,500 square foot roof, that works out to a total PVC roofing cost of $6,000 to $18,000. 2  While certain types of PVC roofing material can be installed over the existing roof, the old roof may need to be removed and disposed of at an additional cost of $1.00 to $2.00 per square foot."}]