[{"url": "https://www.healthit.gov/providers-professionals/achieve-meaningful-use/menu-measures/transition-of-care", "passage_text": "The eligible professional who transitions their patient to another setting of care or provider of care or refers their patient to another provider of care should provide summary care record for each transition of care or referral."}, {"url": "http://www.nacns.org/docs/TC-definitions.pdf", "passage_text": "Definitions of Transitional Care Transitional care: Care involved when a patient/client leaves one care setting (i.e. hospital, nursing home, assisted living facility, SNF, primary care physician, home health, or specialist) and moves to another."}, {"url": "http://www.cms.gov/Regulations-and-Guidance/Legislation/EHRIncentivePrograms/downloads/8_Transition_of_Care_Summary.pdf", "passage_text": " NUMERATOR: Number of transitions of care and referrals in the denominator where a summary of care record was provided.  EXCLUSION: If an EP does not transfer a patient to another setting or refer a patient to another provider during the EHR reporting period then they would be excluded from this requirement."}, {"url": "http://www.cms.gov/Regulations-and-Guidance/Legislation/EHRIncentivePrograms/downloads/8TransitionofCareSummary.pdf", "passage_text": "Transition of Care. – The movement of a patient from one setting of care (hospital, ambulatory primary. care practice, ambulatory specialty care practice, long-term care, home health, rehabilitation facility) to. another."}, {"url": "https://www.healthit.gov/providers-professionals/achieve-meaningful-use/menu-measures/transition-of-care", "passage_text": "A transition of care summary, also known as a discharge summary in some circumstances, provides essential clinical information for the receiving care team and helps organize final clinical and administrative activities for the transferring care team."}, {"url": "http://www.nacns.org/docs/TC-definitions.pdf", "passage_text": "(www.ntocc.org) What do we mean by Care Transitions. The term care transitions refers to the movement patients make between health care practitioners and settings as their condition and care needs change during the course of a chronic or acute illness."}, {"url": "https://www.healthit.gov/providers-professionals/achieve-meaningful-use/menu-measures/transition-of-care", "passage_text": "Measure: The eligible professional who transitions or refers their patient to another setting of care or provider of care provides a summary of care record for more than 50 percent of transitions of care and referrals."}, {"url": "https://en.wikipedia.org/wiki/Transitional_care", "passage_text": "Transitional care refers to the coordination and continuity of health care during a movement from one healthcare setting to either another or to home, called care transition, between health care practitioners and settings as their condition and care needs change during the course of a chronic or acute illness."}, {"url": "http://www.cmsa.org/Consumer/FindaCaseManager/WhyisITransitionsofCareIImportant/tabid/282/Default.aspx", "passage_text": "A transition of care takes place when people move between care settings—such as when a person leaves the hospital and returns home or goes to a rehabilitation facility—or care providers (such as physicians and other members of the care team, or agencies involved with the same client or family)."}]