[{"url": "http://www.webmd.com/brain/brain-diseases", "passage_text": "Brain Diseases: Infections. Brain diseases in the category of infections include: Meningitis: An inflammation of the lining around the brain or spinal cord, usually due to infection; Neck stiffness, headache, fever, and confusion are common symptoms. Brain Diseases: Seizures. Included in the seizure category of brain diseases is epilepsy, a condition characterized by recurring seizures caused by abnormal and excessive electrical activity in the brain. Head injuries, brain infections, and strokes may cause epilsepsy, as well."}, {"url": "http://www.webmd.com/brain/brain-diseases", "passage_text": "Brain diseases come in different forms. Infections, trauma, stroke, seizures, and tumors are some of the major categories of brain diseases. Here's an overview of various diseases of the brain. Brain Diseases: Seizures. Included in the seizure category of brain diseases is epilepsy, a condition characterized by recurring seizures caused by abnormal and excessive electrical activity in the brain. Head injuries, brain infections, and strokes may cause epilsepsy, as well."}, {"url": "http://www.sleewee.com/brain-disorders.php", "passage_text": "Alzheimer's Disease Brain Disorder. Alzheimer's disease, also called Senile Dementia of the Alzheimer Type (SDAT) or simply Alzheimer's, is a brain disorder named for German physician Alois Alzheimer. He was the first scientist to described it in 1906. Alzheimer's disease is a progressive and fatal brain disease and the most common form of dementia. Currently there is no cure for this disease. Alzheimer's disease is unique for every individual."}, {"url": "http://www.peoi.org/Courses/Coursesen/psypatho/ch/ch9a.html", "passage_text": "DIFFERENT TYPES OF ORGANIC DISEASES: Here we will discuss different types of organic brain diseases. Before we do so, we need to classify organic brain diseases in the following subsections: atrophic diseases of brain, vascular diseases of brain, brain trauma and post traumatic psychosis. "}, {"url": "https://en.wikipedia.org/wiki/Dementia", "passage_text": "These diseases also have a significant effect on a person's caregivers. The most common type of dementia is Alzheimer's disease, which makes up 50% to 70% of cases. Other common types include vascular dementia (25%), Lewy body dementia (15%), and frontotemporal dementia. "}, {"url": "http://braindiseases.org/category/brain-diseases-types/", "passage_text": "There are different types of brain diseases to familiarize. Each of these has relative effects and consequences to the way individuals work, function and behave. Since the brain is a vital organ, any damage or injury to it will lead to changes to other parts of the body as well. "}, {"url": "http://braindiseases.org/", "passage_text": "There are different types of brain diseases. Some have causes that are not fully known while others are acquired due to infection, trauma and exposure to harmful agents. The best approach is to identify the problem correctly by ruling out all other possible illnesses and then creating the... Among the different brain diseases, schizophrenia is one of the most devastating. The mental disorder will be present in 1 in every 100 person. Millions of people are diagnosed with the mental condition."}, {"url": "http://www.webmd.com/brain/types-dementia", "passage_text": "The most common causes of dementia include: 1  Degenerative neurological diseases, including Alzheimer's disease, Parkinson's disease, Huntington's disease (a rare inherited disorder), and some types of multiple sclerosis. 2  Vascular disorders, such as multi-infarct dementia, which is caused by multiple strokes in the brain. 1 Degenerative neurological diseases, including Alzheimer's disease, Parkinson's disease, Huntington's disease (a rare inherited disorder), and some types of multiple sclerosis."}]