[{"url": "http://bio.classes.ucsc.edu/bio3/Hmwk/Hmwk309key.pdf", "passage_text": "If so are these reactions endergonic or exergonic? Explain. An anabolic metabolic pathway is a controlled series of reactions in which smaller, lower energy, less complex molecules are built up into larger, higher energy, and more complex molecules. This requires a net input of energy."}, {"url": "http://classes.midlandstech.edu/carterp/Courses/bio225/chap05/lecture1.htm", "passage_text": "Catabolic and Anabolic Reactions. The sum of all chemical reactions within a living organism is known as metabolism. Metabolic pathways are a series of chemical reactions in which the product of one reaction is the substrate for the next reaction."}, {"url": "http://www.answers.com/Q/What_are_catabolic_and_anabolic_pathways", "passage_text": "Confidence votes 6.6K. Anabolic pathway is the set of metabolic pathways that construct molecules from smaller units ie, it is constructive in nature while catabolic pathway is the set of metabolic pathways that break down molecules into smaller units and release energy ie, they are destructive in nature."}, {"url": "http://www.nature.com/scitable/content/catabolic-and-anabolic-pathways-in-cell-metabolism-14710857", "passage_text": "Catabolic and anabolic pathways in cell metabolism. Catabolic pathways involve the breakdown of nutrient molecules (Food: A, B, C) into usable forms (building blocks). In this process, energy is either stored in energy molecules for later use, or released as heat. Anabolic pathways then build new molecules out of the products of catabolism, and these pathways typically use energy."}, {"url": "http://bio.classes.ucsc.edu/bio3/Hmwk/Hmwk309key.pdf", "passage_text": "Explain. A catabolic metabolic pathway is a controlled series of reactions in which larger, higher energy, and more complex molecules are broken down into smaller, lower energy, less complex molecules. This results in a net release of energy."}, {"url": "https://en.wikipedia.org/wiki/Anabolism", "passage_text": "Anabolism is powered by catabolism, where large molecules are broken down into smaller parts and then used up in respiration. Many anabolic processes are powered by the hydrolysis of adenosine triphosphate (ATP)."}]