[{"url": "http://www.summitmedicalgroup.com/library/adult_health/sma_wrist_tendonitis/", "passage_text": "A wrist tendon injury is a problem with the muscles and tendons in your wrist. Tendons are bands of strong tissue that attach muscle to bone. You use the tendons and muscles in your wrist to move your wrist in all directions. Tendons can be injured suddenly or they may be slowly damaged over time."}, {"url": "http://www.webmd.com/fitness-exercise/wrist-sprain", "passage_text": "1 Rest your wrist for at least 48 hours. 2  Ice your wrist to reduce pain and swelling. 3  Do it for 20-30 minutes every three to four hours for two to three days, or until the pain is gone. 4  Compress the wrist with a bandage. 5  Elevate your wrist above your heart, on a pillow or the back of a chair. as often as you can."}, {"url": "http://www.cigna.com/healthwellness/hw/medical-topics/tendon-injury-uh2113", "passage_text": "In most cases, you can treat a tendon injury at home. To get the best results, start these steps right away: 1  Rest the painful area, and avoid any activity that makes the pain worse. 2  Apply ice or cold packs for 10 to 15 minutes at a time, as often as 2 times an hour, for the first 72 hours."}, {"url": "http://www.webmd.com/fitness-exercise/wrist-sprain", "passage_text": "1 Ice your wrist to reduce pain and swelling. 2  Do it for 20-30 minutes every three to four hours for two to three days, or until the pain is gone. 3  Compress the wrist with a bandage. 4  Elevate your wrist above your heart, on a pillow or the back of a chair. as often as you can."}, {"url": "http://www.livestrong.com/article/205425-how-long-can-tendonitis-stay-in-your-hand/", "passage_text": "Tendonitis in the hand occurs because the tendon tissues become inflamed. The inflammation can be the result of repetitive strain or trauma. However, repetitive strain, such as long hours of typing and playing golf, is the primary cause of tendonitis today."}, {"url": "http://www.cigna.com/healthwellness/hw/medical-topics/tendon-injury-uh2113", "passage_text": "It may take weeks or months for a tendon injury to heal. Be patient, and stay with your treatment. If you start using the injured tendon too soon, it can lead to more damage. To keep from hurting your tendon again, you may need to make some long-term changes to your activities."}, {"url": "http://www.webmd.com/fitness-exercise/wrist-sprain", "passage_text": "To speed the healing, you can: 1  Rest your wrist for at least 48 hours. 2  Ice your wrist to reduce pain and swelling. 3  Do it for 20-30 minutes every three to four hours for two to three days, or until the pain is gone."}, {"url": "http://www.webmd.com/first-aid/tc/tendon-injury-tendinopathy-treatment-overview", "passage_text": "1 Tendons require weeks of additional rest to heal. 2  You may need to make long-term changes in the types of activities you do or how you do them. 3  Apply ice or cold packs as soon as you notice pain and tenderness in your muscles or near a joint. 4  Apply ice 10 to 15 minutes at a time, as often as twice an hour, for 72 hours."}]