[{"url": "http://tiphero.com/12-uses-for-denture-tablets/", "passage_text": "1 Another household use for denture cleansing tablets is to clean baby bottles-you don’t need to use a brush to remove dried formula; teething toys-clean and deodorize at the same time; and pacifiers-clean all of the nooks and crannies without scrubbing. 2  If you have several items to clean, place them in your kitchen sink."}, {"url": "http://www.freysmiles.com/blog/view/the-best-way-to-care-for-clean-orthodontic-retainers", "passage_text": "DentaSoak). 1  Although you can still use any of the normal retainer and denture cleansers since they are more convenient, your best option is still to use a diluted bleach solution once a day for your mouthguards and nightguards just like you would with any clear plastic retainers."}, {"url": "http://thefrazzledhomemaker.com/clean-with-denture-cleaner-tablets/", "passage_text": "Below is a list of what I found out about how to clean with denture tablets. I will also let you know if I personally tried it and what the results were. 1  Clean Jewelry. 2  Add 1 denture tablet to a cup of warm water and add your jewelry. 3  Let it soak for 30 minutes then take your jewelry out and rinse."}, {"url": "http://prijom.com/posts/can-i-use-denture-tablets-to-clean-invisalign-retainers.php", "passage_text": "Soak your Invisalign braces in one tablet of the cleaner in the morning and another one in the. ITA: If you have a plastic and wire Hawley retainer, you can brush it with toothpaste Some people use denture cleaning tablets to clean their retainers or aligners. Posted on February 2, 2014 by Prijom Man in posts."}, {"url": "http://www.freysmiles.com/blog/view/the-best-way-to-care-for-clean-orthodontic-retainers", "passage_text": "1 Although you can still use any of the normal retainer and denture cleansers since they are more convenient, your best option is still to use a diluted bleach solution once a day for your mouthguards and nightguards just like you would with any clear plastic retainers."}, {"url": "http://prijom.com/posts/can-i-use-denture-tablets-to-clean-invisalign-retainers.php", "passage_text": "Cleaning with Denture Tablets: If youve never used denture cleaner tablets (I had a retainer in junior I have also heard that they can clear clogged drains and clean toilets. PostOp Care Instructions Invisalign Braces: They can also be soaked and cleaned in a denture cleaner while you are busy eating. The best way to clean your aligners is to use the Invisalign cleaning kit. Use denture cleaner tablets to clean trays at least once a day Always place trays."}, {"url": "http://www.youtube.com/watch?v=vPc4rwinDig", "passage_text": "hey guys! if you are anything like me you want to know what to use to clean your retainers...retainer brite and denture cleaning tablets have mostly the same ingredients so there is really no need to spend $25 on retainer brite when you can spend $1-$6 for the exact same thing! Retainer Brite."}]