[{"url": "http://www.wisegeek.org/what-is-the-best-time-of-day-to-water-the-garden.htm", "passage_text": "As a general rule, watering should be deep and infrequent, as this helps plants to establish a strong root system. The time of day that gardeners water the garden is also important. The best time of day to water outside plants is early morning, before the heat of the day has set in. This reduces the amount of water lost through evaporation, and also provides water for the plants to help them get through the heat of the day."}, {"url": "http://www.gardeningknowhow.com/edible/vegetables/vgen/water-plants-vegetable-garden.htm", "passage_text": "Watering Plants in the Morning. The very best time to water plants is in the early morning, while it is still cool. This will allow the water to run down into the soil and reach the roots of the plant without too much excess water lost to evaporation."}, {"url": "http://www.gardeningknowhow.com/edible/vegetables/vgen/water-plants-vegetable-garden.htm", "passage_text": "Advertisement. Watering in the early morning will also make the water available to the plants throughout the day so that the plants will be able to deal better with the heat of the sun. There is a gardening myth that watering in the morning will make the plants susceptible to scorch."}, {"url": "http://www.ehow.com/way_5120147_time-water-garden.html", "passage_text": "The Best Time of Day for Watering. The early morning is the best time to water a garden. The earlier in the morning that you head out to your garden, the better. Morning irrigation gives plants the crucial moisture they need to get through the hottest parts of the day. Watering plants in early morning also conserves the most water."}, {"url": "http://www.wikihow.com/Choose-the-Best-Time-for-Watering-the-Garden", "passage_text": "The best time of day to water a garden is in the morning, since that gives the plants time to dry off before nightfall. Leaving water on plants overnight can lead to mold. Watering your garden at the right time and using the right method will keep your plants healthy."}, {"url": "http://www.wikihow.com/Choose-the-Best-Time-for-Watering-the-Garden", "passage_text": "This is the best time to water your garden because it works with the plants' natural growth cycle. The plants are ready to drink early in the morning, when the sun is up but not quite high in the sky. During the rest of the day, they'll be able to drink in the water before the sun gets hot."}]