[{"url": "http://www.webmd.com/oral-health/guide/dental-health-thrush", "passage_text": "A. A. A. Thrush is an infection of the mouth caused by the candida fungus, also known as yeast. Candida infection is not limited to the mouth; it can occur in other parts of the body as well, causing diaper rash in infants or vaginal yeast infections in women. "}, {"url": "http://www.mayoclinic.org/diseases-conditions/oral-thrush/basics/causes/CON-20022381", "passage_text": "Oral thrush and other candida infections can occur when your immune system is weakened by disease or by drugs such as prednisone, or when antibiotics disturb the natural balance of microorganisms in your body. These diseases and conditions may make you more susceptible to oral thrush infection: 1  HIV/AIDS. 1 Vaginal yeast infections. 2  Vaginal yeast infections are caused by the same fungus that causes oral thrush. 3  Although a yeast infection isn't dangerous, if you're pregnant you can pass the fungus to your baby during delivery. 4  As a result, your newborn may develop"}, {"url": "http://www.cdc.gov/fungal/diseases/candidiasis/invasive/index.html", "passage_text": "Invasive candidiasis is an infection caused by a yeast (a type of fungus) called Candida. Unlike Candida infections in the mouth and throat (also called “thrush”) or vaginal “yeast infections,” invasive candidiasis is a serious infection that can affect the blood, heart, brain, eyes, bones, and other parts of the body."}, {"url": "https://en.wikipedia.org/wiki/Oral_candidiasis", "passage_text": "Oral candidiasis (also known as oral candidosis, oral thrush, oropharyngeal candidiasis, moniliasis, candidal stomatitis, muguet) is candidiasis that occurs in the mouth. That is, oral candidiasis is a mycosis (yeast/fungal infection) of Candida species on the mucous membranes of the mouth. "}, {"url": "https://en.wikipedia.org/wiki/Candidiasis", "passage_text": "Candidiasis is a fungal infection due to any type of Candida (a type of yeast). When it affects the mouth, it is commonly called thrush. Signs and symptoms include white patches on the tongue or other areas of the mouth and throat. Other symptoms may include soreness and problems swallowing. When it affects the vagina, it is commonly called a yeast infection. Signs and symptoms include genital itching, burning, and sometimes a white cottage cheese-like discharge from the vagina. Less commonly the penis may be affected, resulting in itchiness."}, {"url": "http://www.cdc.gov/fungal/diseases/candidiasis/index.html", "passage_text": "Photomicrograph of the fungus Candida albicans. Candidiasis is a fungal infection caused by yeasts that belong to the genus Candida. There are over 20 species of Candida yeasts that can cause infection in humans, the most common of which is Candida albicans."}, {"url": "http://www.medicinenet.com/thrush/article.htm", "passage_text": "1 Thrush (oropharyngeal candidiasis) is a medical condition in which a fungus called Candida albicans overgrows in the mouth and throat. 2  Thrush may be caused by a variety of factors, including illness, pregnancy, medications, smoking, or dentures. Thrush facts. 1  Thrush (oropharyngeal candidiasis) is a medical condition in which a fungus called Candida albicans overgrows in the mouth and throat. 2  Thrush may be caused by a variety of factors, including illness, pregnancy, medications, smoking, or dentures."}, {"url": "http://www.healthline.com/health/thrush", "passage_text": "Oral thrush occurs when a yeast infection develops on the inside of your mouth and on your tongue. This condition is also known as oropharyngeal candidiasis. Oral thrush is caused by the fungus Candida albicans. A small amount of this fungus normally lives in your mouth, but is kept in check by your immune system. An infection develops when the fungus overwhelms your body’s ability to control it. Oral thrush occurs most often in infants and toddlers."}, {"url": "http://www.webmd.boots.com/women/guide/vaginal-thrush-symptoms-diagnosis-treatment", "passage_text": "Vaginal thrush: Symptoms, diagnosis and treatment. Vaginal thrush is a yeast infection and is very common. Also known as candidiasis, yeast infections can develop in the warm, moist parts of your body such as the vagina, mouth and skin. Your doctor may diagnose you with vaginal thrush based on the description of your symptoms and possibly a vaginal examination. Vaginal thrush is a yeast infection. During the examination, your doctor may take a vaginal swab to look for the yeast under a microscope."}]