[{"url": "http://www.washington.edu/news/2008/08/21/brown-tree-snake-could-mean-guam-will-lose-more-than-its-birds-2/", "passage_text": "These traps are among 119 placed under or near trees on Guam and the nearby island of Saipan to determine the distribution of tree seeds. In the last 60 years, brown tree snakes have become the embodiment of the bad things that can happen when invasive species are introduced in places where they have few predators. Unchecked for many years, the snakes caused the extinction of nearly every native bird species on the Pacific island of Guam. “The brown tree snake has often been used as a textbook example for the negative impacts of invasive species, but after the loss of birds no one has looked at the snake’s indirect effects,” said Haldre Rogers, a UW doctoral student in biology."}, {"url": "http://earthsky.org/earth/lifeform-of-the-week-brown-tree-snakes-slithering-pariahs-of-the-pacific-islands", "passage_text": "The brown tree snake (BTS) is the quintessential invasive species. Since finding its way to the U.S. territory of Guam in the mid-20th Century, it has wiped out most of the island’s native bird species and continues to devour lizards and small mammals at an alarming rate. And with no native snake species to compete with, the brown tree snake had the buffet table all to itself. Population control of the BTS in its native range results from a more limited and elusive food supply."}, {"url": "https://en.wikipedia.org/wiki/Brown_tree_snake", "passage_text": "The brown tree snake (Boiga irregularis) is an arboreal rear-fanged colubrid snake native to eastern and northern coastal Australia, eastern Indonesia (Sulawesi to Papua), Papua New Guinea, and a large number of islands in northwestern Melanesia. Another possible negative outcome of introducing species as a control method for the brown tree snake population is predation on juvenile cane toads and red-bellied snakes by brown tree snakes themselves, because they are opportunistic and generalist feeders."}, {"url": "http://www.columbia.edu/itc/cerc/danoff-burg/invasion_bio/inv_spp_summ/boiga_irregularis.html", "passage_text": "Site and Date of Introduction: The brown tree snake was introduced into Guam in the 1950s. The snake was first sighted inland from the seaport and became conspicuous throughout central Guam by the 1960s. By 1968, brown tree snakes had successfully dispersed throughout the island. Reason(s) Why it has Become Established: The brown tree snake has become established on Guam due to the absence of natural population controls and the abundance of vulnerable prey on the island. For example, introduced lizards are popular food items for young snakes."}, {"url": "http://www.aphis.usda.gov/publications/wildlife_damage/content/printable_version/fs_brown_tree_snake_2011.pdf", "passage_text": "The brown tree snake (Boiga irregularis) was accidentally introduced to Guam in the late 1940s or early 1950s, probably from the Solomon Islands. Native to northeastern Australia, eastern Indonesia, and Melanesia, the brown tree snake has signiﬁ cantly damaged the economy and ecology of Guam. "}, {"url": "http://www.galvbayinvasives.org/Guide/Species/BoigaIrregularis", "passage_text": "This species has been introduced to the U.S. territory of Guam. In 1993 a brown tree snake was found in Corpus Christi, Texas in a shipment of cargo from Guam (McCoid et al. 1994). As of 2010, this species is not reported in Texas. The brown tree snake is an effective predator of small vertebrates, including birds and lizards. The brown tree snake has decimated bird populations in Guam. The species also causes frequent power outages by climbing onto power lines and wooden poles (USGS Date unknown) and is a noted agricultural pest (ISSG 2006a)."}, {"url": "http://eol.org/info/460", "passage_text": "1 The predatory brown tree snake was introduced to Guam in cargo from the Admiralty Islands. 2  Predation by brown tree snakes eliminated ten of the eleven native bird species endemic to the forests of Guam. 3  The Nile perch, a voracious predator, was introduced to Lake Victoria in Africa as a food fish. "}, {"url": "http://www.columbia.edu/itc/cerc/danoff-burg/invasion_bio/inv_spp_summ/boiga_irregularis.html", "passage_text": "Even though there is a wide variety of color variation in the brown tree snake across its range, coloration is constant at specific localities. The snake is about 18'' at hatching and may grow to about 3' in the first year. Adults can reach 8' and weight up to 5 lbs. Reason(s) Why it has Become Established: The brown tree snake has become established on Guam due to the absence of natural population controls and the abundance of vulnerable prey on the island. For example, introduced lizards are popular food items for young snakes."}, {"url": "http://www.columbia.edu/itc/cerc/danoff-burg/invasion_bio/inv_spp_summ/boiga_irregularis.html", "passage_text": "Original Distribution: The brown tree snake is native to the Moluccas (Spice Islands), Indonesia from Wallace's Line west of Sulawesi through New Guinea, and the humid northern and eastern rims of Australia to the Santa Cruz Islands (including the Solomon Islands, but excluding the San Cristobal area). Reason(s) Why it has Become Established: The brown tree snake has become established on Guam due to the absence of natural population controls and the abundance of vulnerable prey on the island. For example, introduced lizards are popular food items for young snakes."}]