[{"url": "http://www.symptomfind.com/diseases-conditions/meningitis/", "passage_text": "1 Bacteria. 2  Bacterial meningitis is the most severe and serious type of meningitis. 3  It occurs when bacteria migrates to the brain and spinal cord from the bloodstream. 4  In some cases, bacteria can directly invade the meninges as a result of physical trauma to the skull or from an ear or sinus infection."}, {"url": "http://www.symptomfind.com/diseases-conditions/meningitis/", "passage_text": "Causes. Meningitis can be caused by the following the infectious agents: 1  Bacteria. 2  Bacterial meningitis is the most severe and serious type of meningitis. 3  It occurs when bacteria migrates to the brain and spinal cord from the bloodstream."}, {"url": "http://www.rightdiagnosis.com/b/bacterial_meningitis/intro.htm", "passage_text": "Bacterial meningitis is a serious, life-threatening disease that causes inflammation of the membranes (meninges) and cerebrospinal fluid (CSF) of the nervous system. The meninges and the CSF encase and protect the brain and spinal cord. Bacterial meningitis is caused by an infection of bacteria. The most serious form of bacterial meningitis is called acute bacterial meningitis. Acute bacterial meningitis develops within hours or days and can be rapidly fatal or lead to serious, permanent complications if not recognized and treated immediately."}, {"url": "http://www.symptomfind.com/diseases-conditions/meningitis/", "passage_text": "1 Bacterial meningitis is the most severe and serious type of meningitis. 2  It occurs when bacteria migrates to the brain and spinal cord from the bloodstream. 3  In some cases, bacteria can directly invade the meninges as a result of physical trauma to the skull or from an ear or sinus infection."}, {"url": "http://www.healthgrades.com/conditions/bacterial-meningitis", "passage_text": "Bacterial meningitis is an infection, caused by bacteria, of the sac surrounding the brain and spinal cord. Typical symptoms include headache, sensitivity to light, and neck stiffness."}, {"url": "http://my.clevelandclinic.org/health/diseases_conditions/hic_Bacterial_Meningitis", "passage_text": "Meningitis is an infection of the membranes (meninges) surrounding the brain and spinal cord. Meningitis can be caused by a bacterial, fungal or viral infection. Meningitis can be acute, with a quick onset of symptoms, it can be chronic, lasting a month or more, or it can be mild or aseptic. Anyone experiencing symptoms of meningitis should see a doctor immediately."}, {"url": "http://www.cdc.gov/meningitis/bacterial.html", "passage_text": "Bacterial meningitis is usually severe. While most people with meningitis recover, it can cause serious complications, such as brain damage, hearing loss, or learning disabilities. There are several pathogens (types of germs) that can cause bacterial meningitis."}]