[{"url": "https://en.wikipedia.org/wiki/Crime_in_the_United_States", "passage_text": "Crime in the United States has been recorded since colonization. Crime rates have varied over time, with a sharp rise after 1963, reaching a broad peak between the 1970s and early 1990s. However, during the early 20th century, crime rates in the United States were higher compared to parts of Western Europe. For example, 198 homicides were recorded in the American city of Chicago in 1916, a city of slightly over 2 million at the time."}, {"url": "http://money.cnn.com/gallery/real_estate/2013/01/23/dangerous-cities/index.html", "passage_text": "Most dangerous U.S. cities. Crime rates inched slightly higher in 2011. Here are the cities that reported the highest rates of murder, rape, robbery, assault, burglary and car theft, according to CQ Press' annual analysis of FBI data. 1 of 10"}, {"url": "http://money.cnn.com/gallery/real_estate/2014/02/03/dangerous-cities/index.html", "passage_text": "Plagued by drugs, homelessness and poverty, Camden had the highest crime rate in the nation among cities of 75,000 residents or more, according to CQ Press' City Crime Rankings 2014, which are based on an analysis of FBI statistics from 2012. "}, {"url": "https://en.wikipedia.org/wiki/United_States_cities_by_crime_rate", "passage_text": "The following table of United States cities by crime rate is based on Federal Bureau of Investigation Uniform Crime Reports statistics. The population numbers are based on U.S. Census estimates for the year end. The number of murders includes nonnegligent manslaughter. This list is based on the reporting. "}, {"url": "http://lawstreetmedia.com/crime-america-2015-top-10-dangerous-cities-200000-2/", "passage_text": "Despite this trend, St. Louis still has the fourth highest violent crime rate among large cities in the United States. The city’s encouraging 20 percent drop in crime during the first six months of 2013 continued through the year’s end, as violent crime went down 10 percent for the entire year. #2 Oakland, California. Oakland, California maintains its spot as the #2 Most Dangerous City in the United States for the second year in a row; however, after reaching a 10-year high in violent crime in 2012, the city managed to decrease its crime rate last year."}, {"url": "http://www.usnews.com/news/articles/2011/02/16/the-11-most-dangerous-cities", "passage_text": "Several other cities that have high rates of particular crimes are not among the 11 cities with the worst crime rates. For example, New Orleans and Richmond, Virginia had the highest murder rates in the country in 2009, according to the FBI. [See a slide show of the 11 Most Dangerous Cities.]. An analysis of FBI data shows which cities in the United States have the highest overall incidence of crime, relative to the national rate. Below are the 11 U.S. cities with the greatest crime risk, according to an Onboard Informatics analysis of the most recent seven years of FBI crime reporting data"}, {"url": "http://www.usatoday.com/story/money/business/2013/10/05/most-dangerous-states/2925679/", "passage_text": "Of the 10 states with the highest rates of violent crime, eight have lower rates of adults with bachelor's degrees, and most of them had median income levels below the national figure in 2012. 24/7 Wall St. reviewed the states with the highest rates of violent crime in the country. While violent crime rose just under 1% nationally in 2012, the trend for the past 20 years has been steady decline."}, {"url": "http://www.huffingtonpost.com/2014/11/12/highest-murder-rate-us-cities-2013_n_6145404.html", "passage_text": "In this Nov. 2, 2005, file photo, the Detroit skyline is shown along the Detroit River. | ASSOCIATED PRESS. The FBI has released its annual stats for major U.S. cities with the highest crime figures. Topping the list -- with far and away the worst murder and violent crime rates -- is Detroit. The bureau on Monday published its 2013 Uniform Crime Reporting statistics, which show in part that Detroit has both the highest rates of murder and violent crime for cities with a population over 200,000. "}, {"url": "http://www.usnews.com/news/articles/2011/02/16/the-11-most-dangerous-cities", "passage_text": "Crime rates in the United States have dropped significantly in the last two decades and continue to be on a steady downward trajectory, according to FBI figures. In 1991, there were 758 violent crimes per 100,000 Americans, compared to 2009's figure of 429. [See a slide show of the 11 Most Dangerous Cities.]. An analysis of FBI data shows which cities in the United States have the highest overall incidence of crime, relative to the national rate. Below are the 11 U.S. cities with the greatest crime risk, according to an Onboard Informatics analysis of the most recent seven years of FBI crime reporting data"}]