[{"url": "http://pets.thenest.com/average-lifespan-parrots-6518.html", "passage_text": "Macaws also have an average lifespan of 25 to 50 years. Parakeets, which are also known as budgerigars or budgies, are popular with children and have an average lifespan of 5 to 15 years. African grey parrots, which are renowned for their speaking ability, have a lifespan of about 40 years, and some African greys live beyond the age of 60."}, {"url": "http://pets.thenest.com/average-lifespan-parrots-6518.html", "passage_text": "For parrot species that have only recently gained popularity as pets, such as the Pacific parrotlet, the average lifespan remains unknown. This medium-sized parrot, which is around 5 inches long, most likely has a lifespan of 15 to 20 years. African grey parrots, which are renowned for their speaking ability, have a lifespan of about 40 years, and some African greys live beyond the age of 60."}, {"url": "https://answers.yahoo.com/question/index?qid=20100618014011AAd74FP", "passage_text": "Also, do not confuse life span with life expectancy.. The life span of a species is the maximum number of years that it would be expected to live under *any* conditions. The life expectancy, on the other hand, is the *average* number of years a bird would typically live. Best Answer: There really is no such thing as a parrot --there are many types of parrots. A cockatoo type of parrot may live to be over 80. A cockatiel type of parrot may only live to be 15 or 20 years old. Macaws live to be 50 years old or more. I have a rainbow lorikeet who is around 20 years old and I heard of a red lory who was 34, but the average lifespan of a lory/lorikeet seems to be in the mid teens. So the answer depends on what TYPE of parrot you are asking about...and you didn't specify"}, {"url": "http://pets.thenest.com/average-lifespan-parrots-6518.html", "passage_text": "The Average Lifespan of Parrots. Large parrots can live for 40 years or more. When you bring a parrot into your household, you're truly making a friend for life. Depending on the species you choose, your new bird may have a lifespan almost as long as yours, so you can look forward to decades of talkative, clever companionship. African grey parrots, which are renowned for their speaking ability, have a lifespan of about 40 years, and some African greys live beyond the age of 60."}, {"url": "http://www.yourparrotcage.com/Bird%20Care/Birds%20Average%20Life%20Span.html", "passage_text": "A Parrots Average Life Span. So you’ve made the decision to enrich your life with a feathered friend. Parrots are unique among pet birds in that they have the potential to be with you for your entire life. A parrot’s life span in captivity is considerably shorter than his potential life span. This is due to environmental factures. How long they enrich your life is in your hands. Proper nutrition, veterinary care and your parrots mental health are key factures in the life span of your companion bird. Here are some approximate life spans for various species of common companion birds."}, {"url": "http://birdsflight.com/how-long-parrots-live/", "passage_text": "The average lifespan of Conures is about 6 – 8 years. (2) These birds are normally found in the Central America and South America. These types of parrots have an expected lifespan of about 50 – 60 years. Parrots are considered to be one of the most intelligent birds. These birds are generally found in the tropical and subtropical regions including Australia, Southeast Asia, South America, Philippines, New Guinea, Mexico, Europe and Bahamas."}, {"url": "http://www.answers.com/Q/What_is_the_average_lifespan_of_a_bird", "passage_text": "It depends on the species of the bird and also whether it is being kept in captivity or not. Some parrots have been noted to live over a hundred years in captivity, but the lifespans of most large birds range from 30 to 70 years. Smaller birds live for shorter lengths of time. For example, a pet canary will usually only live for about 10 years. Parrots can live to be over 100 years old. "}, {"url": "http://www.petyak.com/birds/bird-health/articles/life-expectancy-of-parrots/", "passage_text": "Of course not all parrots live to be 70 or 80 years of age. The life expectancy of parrots depends on many factors, and corresponds to the size of the bird. Generally speaking, the smaller the bird, the shorter its lifespan. A Budgie, when properly cared for, may live as long as 10 years; a Cockatoo given the same high quality of care could live to the age of 80. "}]