[{"url": "http://www.answers.com/Q/How_burning_fossil_fuels_can_cause_global_warming", "passage_text": "The two main causes of global warming are: Burning of fossil fuels (coal, oil and natural gas) which releases carbon dioxide.Deforestation, which removes the trees that take c … arbon dioxide from the atmosphere."}, {"url": "http://www.answers.com/Q/How_burning_fossil_fuels_can_cause_global_warming", "passage_text": "Yes, burning fossil fuels (coal, oil and natural gas) releases carbon dioxide, a powerful greenhouse gas into the atmosphere. We use fossil fuels constantly as fuel in industr … y and transport as well as to generate electricity."}, {"url": "http://www.ucsusa.org/global_warming/global_warming_101", "passage_text": "The primary cause of global warming is human activity, most significantly the burning of fossil fuels to drive cars, generate electricity, and operate our homes and businesses."}, {"url": "http://planetsave.com/2009/06/07/global-warming-effects-and-causes-a-top-10-list/", "passage_text": "1. Global Warming Cause: Carbon dioxide emissions from fossil fuel burning power plants. Our ever increasing addiction to electricity from coal burning power plants releases enormous amounts of carbon dioxide into the atmosphere."}, {"url": "http://www.educationscotland.gov.uk/weatherandclimatechange/energy/fossilfuels.asp", "passage_text": "When fossil fuels are burned they release carbon dioxide into the atmosphere which contributes to global warming. Using fossil fuels to generate energy also releases pollutants into the atmosphere-such as sulphur dioxide. Fossil fuels provide the main source of energy for our modern global economy."}, {"url": "http://www.nmsea.org/Curriculum/Primer/Global_Warming/fossil_fuels_and_global_warming.htm", "passage_text": "Global Warming is the increase of Earth's average surface temperature due to effect of greenhouse gases, such as carbon dioxide emissions from burning fossil fuels or from deforestation, which trap heat that would otherwise escape from Earth. This is a type of greenhouse effect."}, {"url": "http://priceofoil.org/thepriceofoil/global-warming/", "passage_text": "Oil and coal each account for 40 percent of global warming emissions from fossil fuels worldwide. In the United States, energy use accounts for 82 percent of our global warming emissions, with oil counting for 42 percent of those emissions."}, {"url": "http://www.nwf.org/Wildlife/Threats-to-Wildlife/Global-Warming/Global-Warming-is-Human-Caused.aspx", "passage_text": "Human activity--such as burning fossil fuels--causes more greenhouse gases to build up in the atmosphere. As the atmosphere thickens with more greenhouse gases, more heat is held in. Fossil fuels such as oil, coal and natural gas are high in carbon and, when burned, produce major amounts of carbon dioxide or CO2."}]