[{"url": "http://www.today.com/health/sleep-problems-carbs-night-not-too-late-may-help-1D79911268", "passage_text": "“It is the insulin changes from the carb bombs in your gut,” says Winter. High spikes of insulin, created by carbs and sugars, make people feel sluggish and sleepy. Eating carbs for dinner will slow the body down and ready it for sleep. But avoid the midnight snack. Night owls who scarf a late dinner are at greater risk of weight gain, a 2011 Northwestern Medicine study found. "}, {"url": "http://www.livestrong.com/article/94819-carbs-can-sleep/", "passage_text": "Warm Oatmeal. Rolled oats are a healthy whole-grain source of complex carbs, and it turns out they make a smart bedtime snack as well as a staple morning meal. Oatmeal contains the minerals phosphorus, magnesium, calcium, silicon and potassium, all of which can help promote a good night’s sleep. "}, {"url": "http://www.livestrong.com/article/555759-late-night-snack-to-help-sleep/", "passage_text": "A handful of nuts is also high in fiber and antioxidants. Low-fat milk, cheeses and yogurt are protein foods that contain a high level of tryptophan. Combine these foods with a complex carbohydrate and you will have yourself a healthy late-night snack to help you fall asleep."}, {"url": "http://www.webmd.com/sleep-disorders/ss/slideshow-sleep-foods", "passage_text": "Dairy foods contain tryptophan, which is a sleep-promoting substance. Other foods that are high in tryptophan include nuts and seeds, bananas, honey, and eggs. Carbohydrate-rich foods complement dairy foods by increasing the level of sleep-inducing tryptophan in the blood. So a few perfect late night snacks to get you snoozing might include a bowl of cereal and milk, yogurt and crackers, or bread and cheese."}, {"url": "https://sleepfoundation.org/sleep-topics/food-and-sleep", "passage_text": "1 Snooze Foods and Pick-Me-Ups Certain foods contain an amino acid called tryptophan that causes sleepiness. 2  Carbohydrates make tryptophan more available to the brain, which is why carbohydrate-heavy meals can make you drowsy. 1 It is made in the brain by converting tryptophan first to serotonin and then to melatonin, which is secreted at night by the pineal gland in the brain to induce and maintain sleep. 2  Scientific evidence shows little or no benefit of melatonin in improving sleep."}, {"url": "http://www.holisticonline.com/Remedies/Sleep/sleep_ins_food-and-diet.htm", "passage_text": "Recommendations If you want to fall asleep more easily, eat a high-carbohydrate snack and avoid high-protein foods in the hour or two before bed time. In the evening, eat turkey, bananas, figs, dates, yogurt, milk, tuna, and whole grain crackers or nut butter. These foods are high in tryptophan, which promotes sleep. Sugar and foods high in sugar and refined carbohydrates. These raise blood-sugar levels and can cause a burst of energy that disturbs sleep. Sugar and foods high in sugar and refined carbohydrates. These raise blood-sugar levels and can cause a burst of energy that disturbs sleep. Foods that are likely to cause gas, heartburn, or indigestion, such as fatty or spicy foods, garlic-flavored foods, beans, cucumbers, and peanuts"}, {"url": "http://www.holisticonline.com/Remedies/Sleep/sleep_ins_food-and-diet.htm", "passage_text": "Certain types of food promote sleep while others inhibit it. Foods to Eat. Foods such as bread, bagels, and crackers that are high in complex carbohydrates have a mild sleep-enhancing effect because they increase serotonin, a brain neurotransmitter that promotes sleep. Sugar and foods high in sugar and refined carbohydrates. These raise blood-sugar levels and can cause a burst of energy that disturbs sleep. Sugar and foods high in sugar and refined carbohydrates. These raise blood-sugar levels and can cause a burst of energy that disturbs sleep. Foods that are likely to cause gas, heartburn, or indigestion, such as fatty or spicy foods, garlic-flavored foods, beans, cucumbers, and peanuts"}, {"url": "http://www.nutritionbreakthroughs.com/html/sleep_inducing_foods.html", "passage_text": "Sesame seeds are rich in tryptophan. Other foods that are high in tryptophan, which can be combined with healthy carbohydrates to become natural sleep remedies, are whole grains, lentils, chickpeas, beans, eggs, sunflower seeds, and miso. It*s best to stay away from caffeine, sodas and nicotine in the evening. This explains why dairy products, which contain both tryptophan and calcium, are one of the top sleep-inducing foods.*. Dr. Sears recommends that foods high in carbohydrates and calcium, and medium-to-low in protein, make the most ideal sleep-inducing bedtime snacks."}, {"url": "http://www.webmd.com/sleep-disorders/ss/slideshow-sleep-foods", "passage_text": "Sorry Atkins. Protein, an essential part of our daytime fare, can be a poor choice for a bedtime snack. Protein-rich, high-fat foods are harder to digest. So skip the fatty high-protein snack before bedtime and opt for a glass of warm milk or some sleep-friendly carbs, like crackers. Carbohydrate-rich foods complement dairy foods by increasing the level of sleep-inducing tryptophan in the blood. So a few perfect late night snacks to get you snoozing might include a bowl of cereal and milk, yogurt and crackers, or bread and cheese."}]