[{"url": "http://energyinformative.org/how-does-tidal-power-work/", "passage_text": "Tidal energy or tidal power can be defined as the energy that is the result of the moon and the sun’s gravitaional influence on the ocean. Height differences between high and low tides create tidal currents in coastal areas, and these currents can be strong enough to drive turbines. "}, {"url": "http://oilprice.com/Alternative-Energy/Tidal-Energy/How-Does-Tidal-Energy-Work.html", "passage_text": "How Does Tidal Energy Work. Tidal energy is energy obtained from changing sea levels (the tide moving from high to low and vice versa.) This renewable energy source has great potential as tides are much more predictable than wind power and solar energy which are not at all consistent (seasons, bad weather, etc...). The tidal range (difference between high and low tide) needs to be in excess of five metres for the barrage to be workable. As the tide comes in, water flows through the dam into the basin. Then when the tide stops the gates are closed, which traps the water in the basin/estuary."}, {"url": "http://www.ducksters.com/science/environment/wave_and_tidal_energy.php", "passage_text": "There are also three main ways that tidal energy is harnessed: 1  Tidal Barrages-A tidal barrage works like a dam. 2  When the tide goes high, the reservoir fills up. 3  When the tide drops the dam lets the water out. 4  In both directions the moving water can spin the blades of turbines to create electricity. 1"}, {"url": "http://inventors.about.com/od/tstartinventions/a/tidal_power.htm", "passage_text": "1 Wave Energy. When the wave goes down, air flows through the turbine and back into the chamber through doors that are normally closed. This is only one type of wave-energy system. Others actually use the up and down motion of the wave to power a piston that moves up and down inside a cylinder. That piston can also turn a generator. Most wave-energy systems are very small. But, they can be used to power a warning buoy or a small light house"}, {"url": "http://solarpowernotes.com/renewable-energy/tidal-energy/tidal-energy.html", "passage_text": "Ways to use tidal power: Tides produce by ocean can be used in three different ways to get energy and generate electric power. First is its wave energy or kinetic energy that water gets due to movement of waves. This energy can power the turbine if waves rise to a chamber and force the air out from there. In this ways moving air can spin the turbine. Second is energy of tides that come into the shore. These tides can be trapped in a dam and electricity can be generated by operating dam as regular hydroelectric power plant. Third form is ocean’s thermal energy."}, {"url": "http://www.ehow.com/how-does_4574050_tidal-energy-work.html", "passage_text": "Harnessing the Energy. As the turbines turn they create energy. This happens both as the tide comes in and as the tide goes out. The turbines' energy is then routed to storage generators and sent out through power lines to feed the power needs of the community. Benefits and Setbacks. The benefits of using tidal energy is that it is a natural and predictable source of energy. However, it also has its setbacks since the tide is only moving for 8 to 10 hours per day."}, {"url": "https://en.wikipedia.org/wiki/Wave_power", "passage_text": "Wave power is the transport of energy by ocean surface waves, and the capture of that energy to do useful work – for example, electricity generation, water desalination, or the pumping of water (into reservoirs). "}, {"url": "http://oilprice.com/Alternative-Energy/Tidal-Energy/How-Does-Tidal-Energy-Work.html", "passage_text": "As the tide goes out gates in the dam which contain turbines are then opened and the flowing water passes through the turbines, thus generating energy. Tidal barrages have very high infrastructure costs and are very damaging on the local environment. Also construction of such dams is a very lengthy project. The tidal range (difference between high and low tide) needs to be in excess of five metres for the barrage to be workable. As the tide comes in, water flows through the dam into the basin. Then when the tide stops the gates are closed, which traps the water in the basin/estuary."}, {"url": "http://renewableenergyindex.com/hydro/how-does-wave-power-work", "passage_text": "Pelamis wave generator rising out of a wave. Image by P123. Wave power or wave energy comes from the waves in the ocean. It is important to understand the difference between tidal power and wave power before we continue. Tides are created by the gravity of the moon and to a lesser extent the sun. As you may know the waves can be felt beneath the water, as well as the surface. The generator uses the push of the wave, underneath the water, and turns it into electricity. One weeks worth of this energy could power the whole of the UK for 5 days. this includes all the wi-fi, electronics, TV, Sounds etc….."}, {"url": "http://energyinformative.org/wave-energy/", "passage_text": "Some of the kinetic (motional) energy in the wind is transformed into waves once the wind hits the ocean surface. Wind energy ultimately forms due to solar energy and its influence on high and low pressure. This is the reason why wave as well as wind power are considered renewable energy sources. The density of the energy that is transported under the waves under the ocean surface is about five times higher compared to the wind energy 20 meter (about 65 feet) above. In other words, the amount of energy in a single wave is very high."}]