[{"url": "https://en.wikipedia.org/wiki/Glomerular_filtrate", "passage_text": "The glomerulus is surrounded by a cup-like sac known as Bowman's capsule. The blood plasma is filtered through the capillaries of the glomerulus into the capsule. The glomerulus is a tuft of small blood vessels called capillaries located within Bowman's capsule within the kidney. Between the capillaries and Bowman's capsule lies mesangium."}, {"url": "http://www.answers.com/Q/What_is_found_in_filtrate", "passage_text": "exists and is an alternate of. Merge this question into. Split and merge into it. Answered by The Community. Making the world better, one answer at a time. I'm not completely sure but I think I that water, urea, glucose, amino acids, and salts (and other small molecules) are found in the filtrate. The stuff left  in the paper is called the residue, and the stuff which passes  through the paper is called the filtrate.   More generally, filtration is the action or process of filtering  something. + 54 others found this useful. Khaycee Morales."}, {"url": "https://en.wikipedia.org/wiki/Glomerular_filtrate", "passage_text": "(Redirected from Glomerular filtrate). A glomerulus is a network (as a tuft) of capillaries located at the beginning of a nephron in the kidney. It serves as the first stage in the filtering process of the blood carried out by the nephron in its formation of urine. The glomerulus is a tuft of small blood vessels called capillaries located within Bowman's capsule within the kidney. Between the capillaries and Bowman's capsule lies mesangium."}, {"url": "http://www.thefreedictionary.com/filtrate", "passage_text": "Noun. 1. filtrate-the product of filtration; a gas or liquid that has been passed through a filter. fluid-a substance that is fluid at room temperature and pressure. product-a chemical substance formed as a result of a chemical reaction; a product of lime and nitric acid. percolate-the product of percolation. "}, {"url": "http://medical-dictionary.thefreedictionary.com/Glomerular+filtrate", "passage_text": "glomerular. pertaining to or of the nature of a glomerulus, especially a renal glomerulus. glomerular basement membrane. the structure located between endothelial cells of renal capillaries and the visceral epithelial cells of the glomerulus. It functions as a barrier to filtration of large molecules. in normal subjects the capillary endothelium of the glomerulus, by virtue of its fenestration, is permeable to all blood constituents except blood cells and colloids so that the glomerular filtrate has a close similarity to plasma and interstitial fluid but has a lower protein concentration than both of them."}, {"url": "http://www.answers.com/Q/What_is_found_in_filtrate", "passage_text": "The filtrate is the liquid that is left after you filter something -- the liquid that is now missing the solid that was filtered out. For instance, if you are making … drip coffee, it is the coffee beverage (the coffee grinds are called the filtrand). The stuff left  in the paper is called the residue, and the stuff which passes  through the paper is called the filtrate.   More generally, filtration is the action or process of filtering  something. + 54 others found this useful. Khaycee Morales."}, {"url": "https://en.wikipedia.org/wiki/Glomerular_filtrate", "passage_text": "The Bowman's capsule empties the filtrate into the proximal tubule that is also part of the nephron. A glomerulus receives its blood supply from an afferent arteriole of the renal circulation. The glomerulus is a tuft of small blood vessels called capillaries located within Bowman's capsule within the kidney. Between the capillaries and Bowman's capsule lies mesangium."}]