[{"url": "http://www.puppyfind.com/weimaraner.php", "passage_text": "Weimaraners excel in a variety of dog sports such as agility competitions. The Weimaraner needs daily strenuous exercise such as a long jog or play in a yard; it has a seemingly endless supply of stamina. This is definitely not a breed for those who are unprepared to exercise it regularly. The Weimaraner has a shoulder height of 58-69 cm (23-27 in) and weighs 25-41 kg (55-90 lbs). The Weimaraner has a grey nose, grey or amber eyes, and long, highly-set ears. Weimaraners have a sloped back and webbed feet. Most have a tail docked to a third of its natural length"}, {"url": "http://www.petstew.com/weimaraner-prices.html", "passage_text": "Pricing & Costs. Not all breeds are priced the same way; some are bred champions and others recreationally. Some breeds follow Hollywood trends, and some are rarely bred at all driving up their prices. The lowest price we've ever had advertised for the Weimaraner is $150; the most expensive price is $1,995. Generally the average Weimaraner costs around $685 to purchase. The price of a dog will vary based on a large variety of factors including age, breed, geographic location, breeder, and many others. Taking this into account we realize that there is no starting MSRP like we have for vehicles or other retail items."}, {"url": "http://dogs.petbreeds.com/l/157/Weimaraner", "passage_text": "Description: The Weimaraner is a large purebred known for being alert, energetic, intelligent, loyal, responsive, and social. Feeding Fido. As a large dog expected to live 12 years or more, the Weimaraner will need approximately 3 to 4 cups of dry dog food daily. Proper nutrition is necessary for the dog to grow and thrive. Find and compare options below."}, {"url": "http://www.thedogtrainingclub.com/weimaraner/", "passage_text": "The Weimaraner is a highly adaptable and multitalented dog breed with a high intelligence and energy level. This makes the dog extremely versatile in its purposes, everywhere from working as a hunting dog, a police dog, a great family member, and much more. General Health Information. Since the Weimaraner is a dog with a deep chest, it is at a high risk of bloat. For this reason, it is very important to feed the dog several smaller meals every day, instead of a single large meal. Aside from bloat, the Weimaraner is quite a hardy, resilient dog."}, {"url": "http://www.puppyfind.com/weimaraner.php", "passage_text": "The Weimaraner is loyal, playful, friendly, eager to work, intelligent, and energetic. It is sometimes called the dog with a human brain because of its high problem solving abilities. Weimaraners are rambunctious and driven, particularly when young, and require a firm and patient owner. The Weimaraner has a shoulder height of 58-69 cm (23-27 in) and weighs 25-41 kg (55-90 lbs). The Weimaraner has a grey nose, grey or amber eyes, and long, highly-set ears. Weimaraners have a sloped back and webbed feet. Most have a tail docked to a third of its natural length"}, {"url": "http://www.thedogtrainingclub.com/weimaraner/", "passage_text": "On average, a typical month should cost about $30-35 to feed a Weimaraner, assuming that he or she is a healthy adult with a typical activity level and that 3-4 cups of an average quality dry food are consumed. Since the Weimaraner is a dog with a deep chest, it is at a high risk of bloat. General Health Information. Since the Weimaraner is a dog with a deep chest, it is at a high risk of bloat. For this reason, it is very important to feed the dog several smaller meals every day, instead of a single large meal. Aside from bloat, the Weimaraner is quite a hardy, resilient dog."}, {"url": "http://www.petinsurance.com/healthzone/pet-articles/pet-breeds/Weimaraners.aspx", "passage_text": "Weimaraners. Weimaraner owners will tell you that this “gray ghost” is an elegant dog with soulful eyes, a larger-than-life heart and an endless amount of energy. "}, {"url": "http://dogs.petbreeds.com/l/157/Weimaraner", "passage_text": "Origin: Germany. Description: The Weimaraner is a large purebred known for being alert, energetic, intelligent, loyal, responsive, and social. The most common colors for Weimaraners are gray and silver. To keep it healthy, it will need to get exercise regularly. Feeding Fido. As a large dog expected to live 12 years or more, the Weimaraner will need approximately 3 to 4 cups of dry dog food daily. Proper nutrition is necessary for the dog to grow and thrive. Find and compare options below."}, {"url": "http://herepup.com/best-dog-food-for-weimaraners/", "passage_text": "Calories, calories, calories. You’ll be pretty hard-pressed to find a dog that burns as many calories as a Weimaraner. Most of the time, it’s because your Weim is doing whatever it can to get as much exercise as it can. I know a Weim named Cooper, for example, who swims with (and out-swims) his owner on a daily basis. We consulted with a few breeding experts and Weimaraner enthusiasts to figure out exactly what you should be feeding your pup. And, of course, we used our dog for our in-house taste testing. So check out the information below to develop a great diet plan for your feisty Weim."}]