[{"url": "http://download.militaryonesource.mil/12038/MOS/Articles/QA_AboutMilitaryChildCareWaitingListsAndCosts.pdf", "passage_text": "Paying for child care. In general, the cost of military child care is lower than equivalent civilian care because the military subsidizes child care. The subsidies go directly to the program or to the family child care provider. Subsidies pay about half the total cost of care, and your fees pay the other half. "}, {"url": "http://www.military.com/spouse/military-life/military-resources/military-child-care.html", "passage_text": "DoD currently oversees 800 Child Development Centers (CDCs) located on military installations worldwide. These centers offer a safe child care environment and meet professional standards for early childhood education. Child care is typically available through these centers for children ages six weeks to twelve years. The centers are generally open Monday through Friday between the hours of 6:00AM and 6:30PM. All of these factors taken together mean that quality, affordable child care is a necessity for many active-duty families. DoD and the branches of service are constantly reviewing and initiating programs to provide military families and their children with the best possible child care options."}, {"url": "http://www.military.com/spouse/relationships/parenting-tips/military-childcare-waiting-lists-and-costs.html", "passage_text": "Paying for child care and youth programs In general, the cost of military child care is lower than equivalent civilian care because the military subsidizes the program. The subsidies go directly to the program or to the in-home care provider, and usually pay about half the cost of care. The length of time you spend on a waiting list varies considerably from place to place. The cost of child care also varies, but must stay within the fee ranges set by DoD, which are based on a sliding scale according to your family's total income. In areas where the cost of living is higher, care usually costs mo"}, {"url": "http://www.militaryonesource.mil/cyt/child-care-options?content_id=267339", "passage_text": "Fees for military child care. The amount a family pays for CDC and SAC services is determined by the family's income level. Because fees may change from year to year, be sure to ask for a current fee schedule. 1 Child Development Centers-On your installation, you'll usually find one or more Child Development Centers (CDC), which typically offer care for children from six weeks to five years of age. 2  In most cases, hours are from 6 a.m. to 6:30 p.m. on weekdays, year-round."}, {"url": "http://www.gao.gov/products/GAO-12-21", "passage_text": "Out-of-pocket costs for military families who use DOD-subsidized child care are largely driven by policies that vary by service. DOD establishes income-based fee ranges for on-installation child care, but each service sets its own fees and discounts within these parameters. GAO was mandated to examine: (1) the out-of-pocket child care costs paid by military families who use DOD-subsidized care; and (2) the barriers, if any, to obtaining DOD-subsidized care, and what has DOD done in response."}, {"url": "http://www.navy.mil/submit/display.asp?story_id=55669", "passage_text": "The Department of Defense establishes fee ranges for all military child development programs and recently released a policy addressing the fee adjustment. Under the new fee schedule, families with a total income of $85,000 or less will see their child care cost rise by $1 a week. Child care costs for families earning more than $85,000 will rise between $10 and $16 a week. For a 50-hour week, child care costs will range from $1.12 to $2.74 per hour. Here is the new fee schedule: Category I-incomes of $29,400 or below-will pay $56 per week (no change). Category II-incomes from $29,401 to $35,700 - will pay $70 per week (+$1.00 per week)"}, {"url": "http://www.gao.gov/products/GAO-12-21", "passage_text": "As a result, in school year 2010 the per-child costs that families from the same income categories paid for on-installation care varied by service and installation. For example, the monthly per-child cost for a family with an income of $50,000 could have ranged from $335 to $518. GAO was mandated to examine: (1) the out-of-pocket child care costs paid by military families who use DOD-subsidized care; and (2) the barriers, if any, to obtaining DOD-subsidized care, and what has DOD done in response."}, {"url": "http://www.rand.org/pubs/monograph_reports/MR1415.html", "passage_text": "The military child-care system, the largest system of employer-sponsored child care in the country, has received high marks for providing quality,accessible care for children of military employees. The authors conclude that child care is a costly employee benefit and the costs are particular high for infants and toddlers. Their survey of CDCs revealed dramatic differences across installations in the cost of care per child, with significantly lower per-child costs in larger centers."}, {"url": "http://www.militaryonesource.mil/cyt/child-care-options?content_id=267339", "passage_text": "The basics-child care options for military families. 1  Child Development Centers-On your installation, you'll usually find one or more Child Development Centers (CDC), which typically offer care for children from six weeks to five years of age. 2  In most cases, hours are from 6 a.m. to 6:30 p.m. on weekdays, year-round. 1"}]