[{"url": "http://blog.conservation.org/2010/09/ask-a-turtle-scientist/", "passage_text": "Reply. Turtle walking speeds have not received much study. The average walking speed of a land turtle/tortoise is somewhere under a mile an hour on a smooth level surface, but few tortoises walk for a long enough distance that it is meaningful to measure long-distance walking speed. Sprint speed over short distances is a bit higher, and sprint speed of some freshwater species on land, like softshell turtles and some others, may well exceed five miles per hour for a yard or two going downslope."}, {"url": "http://www.turtles.org/hawgrnd.htm", "passage_text": "Description. The green sea turtle is the largest hard-shelled sea turtle. Adults of this species commonly reach 100 cm in carapace length and 150 kg in mass. The average size of a female nesting at the French Frigate Shoals was reported in 1980 to be 92 cm straight carapace length, with an average body mass of 115 kg. "}, {"url": "https://en.wikipedia.org/wiki/Tortoise", "passage_text": "British usage, by contrast, tends not to use turtle as a generic term for all members of the order, and also applies the term tortoises broadly to all land-dwelling members of the order Testudines, regardless of whether they are actually members of the family Testudinidae. There are differences in usage of the common terms turtle, tortoise, and terrapin, depending on the variety of English being used; usage is inconsistent and contradictory."}, {"url": "https://answers.yahoo.com/question/index?qid=20090519190414AA6ZGvN", "passage_text": "This Site Might Help You. RE: How fast can an average sea turtle swim underwater? I know there are seven types of sea turtles, but I would just like to know the average speed of a sea turtle (in general)? Also, what is the highest recorded speed a sea turtle has swam? Thanks! "}, {"url": "http://www.wildlifedepartment.com/wildlifemgmt/turtles.htm", "passage_text": "This is a relatively large turtle with the adults reaching lengths of 8 to 18 inches and weights of 10 to 35 pounds (though a few males have been recorded at over 50lbs). On average, the males are larger than the females. Seventeen species of turtles are found in our state including two species of land-dwelling turtles (box turtles) and fifteen species of aquatic turtles. A brief description of each of these species is provided below. Altogether, these 15 species represent four families, or groups, of turtles."}, {"url": "http://hypertextbook.com/facts/1999/RachelShweky.shtml", "passage_text": "The average turtle swims at a pace of 10 to 12 mph (4 to 5 m/s) and walks at 3 to 4 mph (1 to 2 m/s). Newborn hatchling turtles swim about 25 miles (40 km) in 30 hours on average. Female turtles usually swim at a faster pace than that of their babies or the male turtle in order to protect their young from predators. The marine green turtle (Chelonia mydas) has been known to swim 300 miles (480 km) in 10 days. It has the ability to swim up to 20 mph (9 m/s). The fastest speed of any reptile was found to be 22 mph (9.8 m/s) in the case of a frightened pacific leatherback turtle. Generally, turtles move faster than tortoises, even on land. Tortoises of the genus Gopherus have been clocked at rates 0.13 to 0.30 mph (0.05 to 0.13 m/s). This is compared to the rate on land of a normally aquatic cooter (Pseudemys floridana) which has been recorded at 1.07 mph (0.47 m/s)"}, {"url": "http://www.answers.com/Q/What_is_the_average_speed_of_a_turtle", "passage_text": "It is distance traveled over time. Speed may vary on a trip, so those numbers are averaged to come up with average speed. To find an average, take all numbers, add them, the … n divide by the number of inputs. Example- 2, 3, 7, 4-add together-16 Divide by inputs or no of numbers-4 Answer-4 which is the AVERAGE. + 25 others found this useful. "}, {"url": "http://www.wildlifedepartment.com/wildlifemgmt/turtles.htm", "passage_text": "Oklahoma is home to a diverse community of turtles. Seventeen species of turtles are found in our state including two species of land-dwelling turtles (box turtles) and fifteen species of aquatic turtles. A brief description of each of these species is provided below. Altogether, these 15 species represent four families, or groups, of turtles."}]