[{"url": "http://www.answers.com/Q/What_do_the_colors_on_the_Australian_flag_mean", "passage_text": "The Australian National Flag today has a blue background: the Union  Jack, the Commonwealth Star and the Southern Cross.    The Union Jack in the upper left corner (or … canton) acknowledges  Australia's origin as a British settlement. The stars on the flag depict the Southern Cross. Stars appear white in the sky, so on the flag they are white. The Union Jack was placed there because Australia was a colony of England. The Union Jack's colors were predefined. The flags of Australia, New Zealand and some other countries are based on the Blue Ensign. Dark blue was the colour of the British blue ensign, which was used in colonial times for the flags of most colonies and south of the equator. New Zealand's flag is also based on the blue ensign"}, {"url": "http://www.answers.com/Q/What_does_the_Australian_national_flag_represent", "passage_text": "The Australian National Flag today has a blue background: the Union Jack, the Commonwealth Star and the Southern Cross. The Union Jack in the upper left corner (or canton) acknowledges Australia's origin as a British settlement. The five stars on the right hand side of the Australian flag represent the constellation called 'The Southern Cross'. This conste … llation is unique to the southern skies, and was a valuable navigation aid to early sailors. The seven-pointed star beneath the Union Jack is the Commonwealth star, or Federation star."}, {"url": "https://en.wikipedia.org/wiki/Flag_of_Australia", "passage_text": "The flag of Australia is a defaced Blue Ensign: a blue field with the Union Jack in the canton (upper hoist quarter), and a large white seven-pointed star known as the Commonwealth Star in the lower hoist quarter. The flag's original design (with a six-pointed Commonwealth Star) was chosen in 1901 from entries in a competition held following Federation, and was first flown in Melbourne on 3 September 1901, the date proclaimed as Australian National Flag Day."}, {"url": "http://www.answers.com/Q/What_does_the_Australian_national_flag_represent", "passage_text": "The five stars on the right hand side of the Australian flag represent the constellation called 'The Southern Cross'. This constellation is unique to the southern skies, and w … as a valuable navigation aid to early sailors. The seven-pointed star beneath the Union Jack is the Commonwealth star, or Federation star. The five stars on the right hand side of the Australian flag represent the constellation called 'The Southern Cross'. This conste … llation is unique to the southern skies, and was a valuable navigation aid to early sailors. The seven-pointed star beneath the Union Jack is the Commonwealth star, or Federation star."}, {"url": "http://australianflag.facts.co/australiaflagof/australianflag.php", "passage_text": "Australia National Flag-Information. The national flag of Australia is a blue field with the Union Jack in the upper hoist-side quadrant, and a large white seven-pointed star known as the Commonwealth Star or Federation Star in the lower hoist-side quadrant. Australia Flag-History, Facts & information for kids. The seven-pointed “Commonwealth Star” on Australian flag represents the six Australian states and the Northern Territory. Australian Red Ensign (Australian flag with red background, instead of the blue background) is generally restricted to privately owned vessels."}, {"url": "http://www.answers.com/Q/What_does_the_Australian_national_flag_represent", "passage_text": "The Australian National Flag today has a blue background: against this background are the symbols of the Union Jack, the Commonwealth Star and the Southern Cross. The Union … Jack in the upper left corner (or canton) acknowledges Australia's origin as a British settlement. The five stars on the right hand side of the Australian flag represent the constellation called 'The Southern Cross'. This conste … llation is unique to the southern skies, and was a valuable navigation aid to early sailors. The seven-pointed star beneath the Union Jack is the Commonwealth star, or Federation star."}]