[{"url": "https://en.wikipedia.org/wiki/Garter_snake", "passage_text": "Garter snake ‒ also called garden snake or gardener snake ‒ is the common name given to harmless, small to medium-sized snakes belonging to the genus Thamnophis. Endemic to North America, they can be found from the Subarctic plains of Canada to Central America. T. sirtalis, T. marcianus and T. sauritus are the most popular species of garter snakes kept in captivity. Baby garter snakes shed their first skin almost immediately, and will begin eating soon after."}, {"url": "http://www.biokids.umich.edu/critters/Thamnophis_sirtalis/", "passage_text": "The average lifespan of wild common garter snakes is approximately two years. Most common garter snakes probably die in their first year of life. Common garter snakes reach sexual maturity, and maximum size, at 3 to 4 years of age. The lifespan of common garter snakes kept in captivity is longer, between 6 and 10 years. One captive common garter snake lived to be 20 years old, but few wild snakes live this long."}, {"url": "http://www.snake-removal.com/gardensnake.html", "passage_text": "Habitat: Garden snakes are found throughout North America and are one of the most common types of snakes. They are probably the most commonly spotted type of snake in the United States. They have also been found to live in Alaska, making them one of the most northern snake species on the entire planet. Here is some information about the Garter/Garden Snake, which some people also call the Gardener Snake, or Gardner Snake: Biology: The Garden snake is one of the most common snakes in North America."}, {"url": "https://answers.yahoo.com/question/index?qid=20070417192756AA5hWvg", "passage_text": "Best Answer: Garden snakes are also called garter snakes. A garter snake is any species of North American snake within the genus Thamnophis. Garter snakes are extremely common all across North America, Canada and to Central America. They are an everyday find in gardens. They are the single most widely distributed species of reptile in North America, and in fact, the common garter snake, T. sirtalis, is the only species of snake to be found in Alaska. While some snake species do, garters do not. When living near the water, they will eat fish and other aquatic animals. The ribbon snake in particular favors frogs (including tadpoles), readily eating them despite their strong chemical defenses.[citation needed] Food is swallowed whole."}, {"url": "http://www.livescience.com/44072-garter-snake.html", "passage_text": "The common garter snake occurs throughout North America, from the Atlantic Ocean to the Pacific Ocean and into southern Canada, according to the Virtual Nature Trail at Pennsylvania State University New Kensington. Beane described garter snakes as generalists, inhabiting a wide variety of habitats.. They live in woodlands, meadows and grassy knolls and like to be near water, especially in the arid parts of the West, Beane said."}, {"url": "http://www.wikihow.com/Find-a-Garter-Snake", "passage_text": "How to Find a Garter Snake. Garter snakes (aka Garden Snakes, Gardner Snakes) are common across North America, from Canada to Central America. They are the single most widely distributed genus of reptile in North America, and are a common sight in American gardens, giving rise to the gardener snake nickname. Garter snakes (aka Garden Snakes, Gardner Snakes) are common across North America, from Canada to Central America"}, {"url": "https://answers.yahoo.com/question/index?qid=20070417192756AA5hWvg", "passage_text": "Garter snakes, like all snakes, are carnivorous. Their diet consists of almost any creature that they are capable of overpowering: slugs, earthworms, leeches, lizards, amphibians, birds, and rodents. A common misconception is that they eat insects. While some snake species do, garters do not. When living near the water, they will eat fish and other aquatic animals. The ribbon snake in particular favors frogs (including tadpoles), readily eating them despite their strong chemical defenses.[citation needed] Food is swallowed whole."}, {"url": "http://www.livescience.com/44072-garter-snake.html", "passage_text": "Thamnophis sirtalis (common garter snake): The common garter snake has the largest range, occurring in most of the continental United States with several subspecies, according to Beane. They are found everywhere from Alaska to Florida, though they do not live in the Southwest. Beane described garter snakes as generalists, inhabiting a wide variety of habitats.. They live in woodlands, meadows and grassy knolls and like to be near water, especially in the arid parts of the West, Beane said."}, {"url": "http://www.livescience.com/44072-garter-snake.html", "passage_text": "Garter snakes are among the most common snakes in North America, with a range spanning from Canada to Florida. Often kept as pets, they are relatively harmless, although some species do possess a mild neurotoxic venom. However, it is not dangerous to humans. Beane described garter snakes as generalists, inhabiting a wide variety of habitats.. They live in woodlands, meadows and grassy knolls and like to be near water, especially in the arid parts of the West, Beane said."}]