[{"url": "http://www.babynamewizard.com/baby-name/girl/celeste", "passage_text": "Origin of the name Celeste: Derived from the French celeste céleste which is from The latin (caelestis, celestial). Heavenly: Var. Celestia From A world Of Baby names By Teresa. norman 'Wow what a beautiful name'. In Spanish, people pronounce my name (Celeste-ay). Celeste is a pretty universal name in terms of pronunciation, and can be said easily in French, English, Spanish etc. One consideration is there aren't many good nicknames for Celeste."}, {"url": "http://www.babynames.com/name/CELESTE", "passage_text": "Here are pictures of people with the name Celeste. Help us put a face to the name by uploading your pictures to BabyNames.com! "}, {"url": "http://nameberry.com/babyname/Celeste", "passage_text": "Celeste is a softly pretty and somewhat quaint name with heavenly overtones, which kids might associate with Queen Celeste of Babar's elephant kingdom. She's a light and lovely choice that's finally getting noticed. Celeste has been in the Top 1000 every year since 1880, and now ranks at Number 467. "}, {"url": "http://www.smithsonianchannel.com/shows/the-true-story-of-the-mary-celeste/0/130102", "passage_text": "The True Story of the Mary Celeste. On December 4, 1872, the unmanned Mary Celeste was found adrift in the Atlantic with its cargo fully intact. The mystery of this ghost ship remained unanswered for over 135 years. What happened to the Mary Celeste is widely regarded as the most famous mystery of the sea. "}, {"url": "http://www.ourbabynamer.com/meaning-of-Celeste.html", "passage_text": "Celeste is generally used as a girl's name. It consists of 7 letters and 2 syllables and is pronounced Ce-leste. In the U.S. in 2014, it ranked 467 in baby name popularity for girls with 674 occurrences. Last year this name was ranked as one of the top 1000 most popular names within its gender. Keep in mind how popular a name is. Your child may feel that they fit in more with a more popular name. On the other hand, they may feel more special if their name is less popular and more uniquely their own."}, {"url": "https://en.wikipedia.org/wiki/Celesta", "passage_text": "The sound of the celesta is similar to that of the glockenspiel, but with a much softer and more subtle timbre. This quality gave the instrument its name, celeste meaning heavenly in French. The celesta is a transposing instrument; it sounds an octave higher than the written pitch. Not to be confused with Celestia. The celesta /sɨˈlɛstə/ or celeste /sɨˈlɛst/ is a struck idiophone operated by a keyboard. It looks similar to an upright piano (four-or five-octave), or a large wooden music box (three-octave). The keys connect to hammers that strike a graduated set of metal (usually steel) plates suspended over wooden resonators"}, {"url": "http://www.thinkbabynames.com/meaning/0/Celeste", "passage_text": "Celeste /ce-le-ste/ [2 sylls.] as a girls' name is pronounced seh-LEST. It is of Latin origin, and the meaning of Celeste is heavenly. Anglicized form of C leste (French), from Latin Caelestis, a popular name among early Christians. The masculine form Celestin was the name of five popes, the first one in AD 422. Celeste is a very prominent first name for females (#521 out of 4276, Top 12%) and also a very prominent last name for all people (#20111 out of 150436, Top 13%). (2000 U.S. Census). Shown below is the baby name popularity of Celeste for girls"}]