[{"url": "http://www.myparkingsign.com/MPS/article_ADA-Handicapped-Parking-Rules.aspx", "passage_text": "Minimum number of Handicap Parking Spaces required. The amount of accessible parking spaces that must be provided is determined by the total number of spaces present in each parking lot. It is important to note that ADA provides the central set of guidelines."}, {"url": "http://www.ada.gov/restripe.htm", "passage_text": "(plan drawing showing an accessible parking space for cars with a 96 inch wide designated parking space, a 60 inch wide min. marked access aisle and the following notes). Sign with the international symbol of accessibility mounted high enough so it can be seen while a vehicle is parked in the space."}, {"url": "http://www.myparkingsign.com/MPS/article_ADA-Handicapped-Parking-Rules.aspx", "passage_text": "1 Standard vehicle parking space (Cars) must have a 5 feet wide access aisle adjacent to parking space. 2  Regulations allow two adjacent parking spaces to share a common access aisle. 3  Parking spaces and access aisles shall be in level with surface slopes not exceeding 1:50 (2%) in all directions."}, {"url": "http://thelawdictionary.org/article/what-are-laws-for-handicap-parking-spaces/", "passage_text": "The number of parking spaces to be reserved for handicap vehicles and vans is calculated based on the number of spots in a parking lot. Lots with 1-25 spots need 1 handicap space; 26-50 spots need 2 handicap spaces; 51-75 spots need 3 handicap spaces; and 76-100 spots need 4 handicap spaces."}, {"url": "http://www.adaptiveaccess.com/handicap_parking.php", "passage_text": "Standard Accessible (std.) parking space is 8 foot minimum + 5 foot access aisle. * One in every 8 accessible parking spaces must be a van accessible space with an 8 foot wide access aisle. IMPORTANT NOTE: These are the minimum requirements of the ADA."}, {"url": "http://www.myparkingsign.com/MPS/article_ADA-Handicapped-Parking-Rules.aspx", "passage_text": "Accessible Parking Spaces. ADA access signs need to be posted at properly designated accessible parking spaces. To meet ADA requirements, handicapped parking space should be conveniently large enough for the vehicle to be parked."}, {"url": "http://www.ada.gov/restripe.htm", "passage_text": "Accessible parking spaces for cars have at least a 60-inch-wide access aisle located adjacent to the designated parking space. The access aisle is just wide enough to permit a person using a wheelchair to enter or exit the car. These parking spaces are identified with a sign and located on level ground."}, {"url": "http://thelawdictionary.org/article/what-are-laws-for-handicap-parking-spaces/", "passage_text": "The no parking space between handicap spaces must be 5 feet wide and the spaces next to or between two van accessible spaces must be 8 feet wide to accommodate the loading and unloading of wheel chairs and walkers."}, {"url": "http://thelawdictionary.org/article/what-are-laws-for-handicap-parking-spaces/", "passage_text": "If a lot only has 1 handicap space, that space will also be designated as van accessible. SIZE OF SPACES. The ADA provides the governing regulations for the width and height of handicap spaces. Each handicap space must be 8 feet wide and the van accessible spaces must have 98 inches of height clearance."}]