[{"url": "http://www.homeadviceguide.com/central-heating-cost/", "passage_text": "The reason being that in terms of both installation and running costs, gas central heating almost always works out cheaper than electric. Other options include LPG and Oil central heating system s, though in both cases are again less efficient financially speaking than gas. In terms of annual running costs, fuel bill will of course vary massively with usage and property size, though for the average UK home come out around: 1  Electric – £1,700. 2  Gas – £770. 3  Oil – £1,100. "}, {"url": "https://www.consumer.org.nz/topics/home-energy-costs", "passage_text": "We’ve calculated the rates charged for different ways of heating your home. Our data show costs for 1kWh of heating. These costs do not include fixed charges for natural gas, electricity and LPG (see below) but they do include GST. Firewood is pine and its costs are from our February 2015 survey of firewood prices. Electricity and natural gas prices are from Powerswitch."}, {"url": "http://homeguides.sfgate.com/heat-home-efficiently-propane-39940.html", "passage_text": "Dual-pane windows add efficiency to propane home heating. As a fuel for home-heating furnaces and water heaters, propane is available across the United States. Delivered to the home and stored in a special tank, it's more cost-efficient to buy propane in the summer months when per-gallon prices drop. Heating with propane reduces greenhouse gas emissions and can help save on overall energy costs. No special furnace is required to heat with propane. Used in conjunction with a boiler or propane-powered water heater, radiant systems pump heated water through tubes embedded in the flooring. Radiant heat can be more efficient than using a central-heating system and ductwork."}, {"url": "http://www.which.co.uk/energy/creating-an-energy-saving-home/guides/home-heating-systems/lpg-central-heating/", "passage_text": "How LPG central heating works. LPG central heating is normally used in a ‘wet’ heating system where an LPG-fired boiler heats water, which provides central heating through radiators and hot water through the taps in your home. Some boilers designed for mains gas can be converted to use LPG. If you're one of the 4 million households that aren't connected to mains gas and you use LPG, then you need to read on. We reveal the annual cost of heating your home using LPG, and the pros and cons of LPG central heating. Plus our experts recommend alternatives to heating your home."}, {"url": "http://www.petro.com/propane/propane-vs-electric", "passage_text": "The costs of electricity and propane can be compared using the BTU (British Thermal Unit), which measures the heating value of each fuel. National fuel prices from the U.S. Department of Energy show that the cost of electricity is more than twice the cost of propane. Compared with electric heat, propane is better in so many ways: 1  Propane is cheaper than electric: According to the U.S. Department of Energy, heating a home in the U.S. with propane in recent years has cost far less than heating with electricity."}, {"url": "http://www.homeheatingguide.co.uk/central-heating-cost.html", "passage_text": "Taking the increased boiler cost and additional tank installation an LPG central heating system can typically cost anything from £2,500 - £6,000 depending on the size of property. Ongoing running costs are higher than natural mains gas but lower than oil. "}, {"url": "http://www.alliantgas.com/why-propane/home-heating-systems", "passage_text": "1 Also, the cost of repairing a propane gas furnace is lower than the cost of repairing an electric heat pump. 2  Propane gas fireplace systems cost between 30 to 60 percent less per hour of operation than wood-burning fireplaces (according to the DOE and Energy Savings Calculator). 1 An electric heat pump produces heat only as warm as 95°F. 2  A gas furnace heats air to about 120°F, and operates in short intervals to minimize operating costs. 3  Lowering operating costs: In general, heating with propane entails lower operating costs than heating with electricity."}, {"url": "http://www.which.co.uk/energy/creating-an-energy-saving-home/guides/home-heating-systems/gas-central-heating/", "passage_text": "The average annual cost for heating and hot water using gas in the UK is £609 when consuming around 13,500 kWh a year. The annual fuel cost is based on the average cost of gas per kWh across all six energy suppliers multiplied by the median usage in kWh. "}, {"url": "http://www.which.co.uk/energy/creating-an-energy-saving-home/guides/home-heating-systems/lpg-central-heating/", "passage_text": "The average annual cost for heating and hot water using LPG in the UK is £1,125 when consuming around 13,500 kWh a year. This annual fuel cost is not based on actual fuel bills. If you're one of the 4 million households that aren't connected to mains gas and you use LPG, then you need to read on. We reveal the annual cost of heating your home using LPG, and the pros and cons of LPG central heating. Plus our experts recommend alternatives to heating your home."}]