[{"url": "http://www.answers.com/Q/Is_ammonia_an_ionic_compound", "passage_text": "Confidence votes 12.8K. No. In its pure, gaseous form Ammonia is molecular-formula NH3, formed with covalent bonds throughout. However, when ammonia dissolves in water (it is VERY soluble in water by the way...) it reacts with the water forming an ionic solution-ammonium hydroxide. "}, {"url": "https://en.wikipedia.org/wiki/Ammonia", "passage_text": "Ammonia or azane is a compound of nitrogen and hydrogen with the formula NH 3. It is a colourless gas with a characteristic pungent smell. Ammonia contributes significantly to the nutritional needs of terrestrial organisms by serving as a precursor to food and fertilizers. Ammonia is miscible with water. In an aqueous solution, it can be expelled by boiling. The aqueous solution of ammonia is basic. The maximum concentration of ammonia in water (a saturated solution) has a density of 0.880 g/cm 3 and is often known as '.880 ammonia'."}, {"url": "http://www.atsdr.cdc.gov/PHS/PHS.asp?id=9&tid=2", "passage_text": "In wells, rivers, lakes, and wet soils, the ammonium form is the most common. Ammonia can also be combined with other substances to form ammonium compounds, including salts such as ammonium chloride, ammonium sulfate, ammonium nitrate, and others. Ammonia is very important to plant, animal, and human life. Ammonia in this form is also known as ammonia gas or anhydrous (without water) ammonia. Ammonia gas can also be compressed and becomes a liquid under pressure. The odor of ammonia is familiar to most people because ammonia is used in smelling salts, household cleaners, and window cleaning products."}, {"url": "https://en.wikipedia.org/wiki/Ammonia", "passage_text": "Household ammonia or ammonium hydroxide is a solution of NH 3 in water. The concentration of such solutions is measured in units of the Baume baumé (scale), density with 26 degrees (baume bauméabout (30 %) by weight ammonia.at °15 5 c.or °59) 9 f being the-typical high concentration. commercial product Ammonia is miscible with water. In an aqueous solution, it can be expelled by boiling. The aqueous solution of ammonia is basic. The maximum concentration of ammonia in water (a saturated solution) has a density of 0.880 g/cm 3 and is often known as '.880 ammonia'."}, {"url": "http://bcn.boulder.co.us/basin/data/NEW/info/NO3+NO2.html", "passage_text": "Ammonia Ammonia, another inorganic form of nitrogen, is the least stable form of nitrogen in water. Ammonia is easily transformed to nitrate in waters that contain oxygen and can be transformed to nitrogen gas in waters that are low in oxygen. Ammonia is found in water in two forms-the ammonium ion (NH 4 +), and dissolved, unionized (no electrical charge) ammonia gas (NH 3). Nitrogen is very common and found in many forms in the environment. Inorganic forms include nitrate (NO 3), nitrite (NO 2), ammonia (NH 3), and nitrogen gas (N 2). Organic nitrogen is found in the cells of all living things and is a component of proteins, peptides, and amino acids."}, {"url": "https://en.wikipedia.org/wiki/Ammonia", "passage_text": "Ammonia can also be used to make compounds in reactions which are not specifically named. Examples of such compounds include: ammonium perchlorate, ammonium nitrate, formamide, dinitrogen tetroxide, alprazolam, ethanolamine, ethyl carbamate, hexamethylenetetramine, and ammonium bicarbonate. Ammonia is miscible with water. In an aqueous solution, it can be expelled by boiling. The aqueous solution of ammonia is basic. The maximum concentration of ammonia in water (a saturated solution) has a density of 0.880 g/cm 3 and is often known as '.880 ammonia'."}, {"url": "http://schools-wikipedia.org/wp/a/Ammonia.htm", "passage_text": "Ammonia or azane is a compound of nitrogen and hydrogen with the formula NH 3. It is a colourless gas with a characteristic pungent smell. Ammonia contributes significantly to the nutritional needs of terrestrial organisms by serving as a precursor to food and fertilizers. Household ammonia is a solution of NH 3 in water (i.e., ammonium hydroxide) used as a general purpose cleaner for many surfaces. Because ammonia results in a relatively streak-free shine, one of its most common uses is to clean glass, porcelain and stainless steel."}, {"url": "https://en.wikipedia.org/wiki/Ammonium", "passage_text": "Formation of ammonium compounds can also occur in the vapor phase; for example, when ammonia vapor comes in contact with hydrogen chloride vapor, a white cloud of ammonium chloride forms, which eventually settles out as a solid in a thin white layer on surfaces. It is formed by the protonation of ammonia (NH 3). Ammonium is also a general name for positively charged or protonated substituted amines and quaternary ammonium cations (NR 4 +), where one or more hydrogen atoms are replaced by organic groups (indicated by R)."}, {"url": "http://sciencelearn.org.nz/Contexts/Soil-Farming-and-Science/Science-Ideas-and-Concepts/The-nitrogen-cycle", "passage_text": "Nitrifying bacteria in the soil convert ammonia into nitrite (NO 2 -) and then into nitrate (NO 3 -). This process is called nitrification. Compounds such as nitrate, nitrite, ammonia and ammonium can be taken up from soils by plants and then used in the formation of plant and animal proteins. Denitrification completes the nitrogen cycle by converting nitrate (NO 3 -) back to gaseous nitrogen (N 2)."}]