[{"url": "http://heart-disease.emedtv.com/amlodipine/how-does-amlodipine-work.html", "passage_text": "Amlodipine besylate (Norvasc ®) is commonly prescribed for conditions affecting the heart and blood vessels. It is specifically used for controlling high blood pressure (hypertension) and treating heart disease, including angina and coronary artery disease in people who do not have heart failure."}, {"url": "http://www.rxlist.com/norvasc-drug/patient-images-side-effects.htm", "passage_text": "Amlodipine is in a group of drugs called calcium channel blockers. Amlodipine relaxes (widens) blood vessels and improves blood flow. Amlodipine is used to treat high blood pressure (hypertension) or chest pain (angina) and other conditions caused by coronary artery disease."}, {"url": "http://heart-disease.emedtv.com/amlodipine/how-does-amlodipine-work.html", "passage_text": "There are two basic types of calcium channel blockers: dihydropyridine and non-dihydropyridine. The most important difference between the two is that non-dihydropyridine calcium channel blockers can slow down the heart rate, while dihydropyridine calcium channel blockers do not. Amlodipine is a dihydropyridine calcium channel blocker, which means that it does not have an effect on heart rate."}, {"url": "http://www.webmd.com/drugs/2/drug-5891/amlodipine-oral/details", "passage_text": "Amlodipine is used with or without other medications to treat high blood pressure. Lowering high blood pressure helps prevent strokes, heart attacks, and kidney problems."}, {"url": "http://heart-disease.emedtv.com/amlodipine/amlodipine.html", "passage_text": "Amlodipine is part of a class of drugs called calcium channel blockers. The drug helps slow down the rate at which calcium moves into your heart and into the blood vessel walls. This, in turn, helps to relax the vessels, which allows better blood flow and causes lower blood pressure."}, {"url": "http://www.webmd.com/drugs/2/drug-5891/amlodipine-oral/details", "passage_text": "Uses. Amlodipine is used with or without other medications to treat high blood pressure. Lowering high blood pressure helps prevent strokes, heart attacks, and kidney problems. Amlodipine belongs to a class of drugs known as calcium channel blockers."}, {"url": "http://www.everydayhealth.com/drugs/norvasc", "passage_text": "A: Norvasc (amlodipine) belongs to a class of drugs called calcium channel blockers (CCBs) that relaxes (widens) blood vessels and improves blood flow. Norvasc is used to treat hypertension (high blood pressure), angina (chest pain), and other conditions caused by coronary artery disease."}, {"url": "https://www.nlm.nih.gov/medlineplus/druginfo/meds/a692044.html", "passage_text": "Amlodipine is used alone or in combination with other medications to treat high blood pressure and chest pain (angina). Amlodipine is in a class of medications called calcium channel blockers. It lowers blood pressure by relaxing the blood vessels so the heart does not have to pump as hard."}]