[{"url": "https://www.airport-parking-shop.co.uk/cardiff/cardiff-airport-parking.html", "passage_text": "The best selection of Cardiff airport parking deals starting from £8.27 per day or £33.18 per week. No need to pay more than you have to for Cardiff airport parking. Find and compare Cardiff on-airport and off-airport parking deals on Airport Parking Shop and pre-book to save up to 60% off gate price."}, {"url": "http://parkandridecardiff.co.uk/", "passage_text": "Ocean Park and Ride is Cardiff’s most convenient park and ride. Convenient, low cost and secure parking in the heart of Cardiff. Leave your vehicle with us from £5 per day while you work, shop or play. Enjoy an affordable all-day alternative to hourly-rate car parks and limited stay city centre parking in Cardiff. Conveniently park your car at Ocean Park & Ride and enjoy a short bus ride directly into the centre of Cardiff. Our buses depart every 15 minutes getting you into Cardiff City Centre in around 5 minutes"}, {"url": "http://www.holidayextras.co.uk/cardiff-airport-parking.html", "passage_text": "Top tip. The gate rate price for parking at Cardiff airport can be very expensive, sometimes as much as £7.75 per day. Always pre-book to get cheap Cardiff airport parking, and guarantee your space. The earlier you book, the cheaper the price of parking is. "}, {"url": "https://www.airport-parking-shop.co.uk/cardiff/cardiff-airport-parking.html", "passage_text": "There is both off airport and on airport Cardiff airport parking available. Cardiff Airport has two on airport Long Stay car parks (Long Stay 1 and Long Stay 2) situated close to the terminal building, only requiring a 5 minute transfer. Find and compare Cardiff on-airport and off-airport parking deals on Airport Parking Shop and pre-book to save up to 60% off gate price."}, {"url": "https://www.cardiff.gov.uk/ENG/resident/Parking-roads-and-travel/Parking-in-Cardiff/Car-parks/Pages/Car-Parks.aspx", "passage_text": "Cardiff Council operates Pay and Display car parks in the following locations: 1  Castle Mews (City Centre). 2  North Road (City Centre). 3  Sophia Gardens (City Centre). 4  Havannah Street (City Centre). 5  The Barrage (Cardiff Bay). Other Car Parks in Cardiff. Other car parks are available in the city centre and are operated by private companies. These can be found on our city centre map (4.25mb PDF)​​​​​​​​​​Link opens in a new window ​ . For all car parking enquiries please contact us."}, {"url": "http://www.cardiff-airport.com/long-stay-car-parks/", "passage_text": "Long stay car parks. Cardiff Airport's Long Stay car parking facilities are the convenient and cost-effective solution if you're travelling on holidays and business trips. What's more, all car parks are located conveniently on site, so it's just a short walk to the terminal or you can hop on the shuttle bu"}, {"url": "http://www.walesonline.co.uk/news/wales-news/parking-charges-cardiff-rocket-maximum-9981963", "passage_text": "The cost of parking for 10 hours will rise from £5.20 to £8 but the maximum charge will be for 12 hours, which will cost £10. Read more: The £40,000 car clamping down on drivers parking on zig-zag lines has hit Cardiff – and sparked much debate. Could not subscribe, try again later. Cardiff council will press ahead with parking charge increases despite opposition. Parking charges in Cardiff city centre will rocket to as much as £10 from this weekend – despite more than 150 objections. The new fees will come in from Sunday night, a city council spokesman said"}, {"url": "http://www.cardiff-airport.com/car-parking/", "passage_text": "At Cardiff airport we have a variety of car parking options available. We have a short stay car park for those taking a short trip or are just visiting. We have on-site Long Stay car parking facilities which are the convenient and cost-effective solution if you're travelling on holidays and business trips. For visitors who wish to drop off their passengers we have a FREE drop off area located directly outside the main Airport terminal building"}]