[{"url": "http://www.askamanager.org/2014/10/how-long-should-a-cover-letter-be.html", "passage_text": "If your letter does that but it’s longer than a page, look for ways to edit it down without losing its essence. If it’s half a page or less, you should just be damn sure that it’s truly passing that litmus test. It’s hard to meet that test if you’re writing very short. Not impossible, but a lot harder."}, {"url": "http://www.askamanager.org/2014/10/how-long-should-a-cover-letter-be.html", "passage_text": "The perfect length for a cover letter is the amount of space that it takes to explain why you’re an unusually strong candidate for the job aside from what’s on your resume. Half a page isn’t usually going to be enough to truly do that — although there are exceptions to that."}, {"url": "http://jobsearch.about.com/od/cover-letter/fl/How-Long-Should-a-Cover-Letter-Be.htm", "passage_text": "Your cover letter shouldn't be longer than one page. It should highlight your most relevant qualifications for the job and what you have to offer the employer. In fact, as far as how long your cover letter should be, shorter is better. Almost 70% of employers wanted a cover letter of less than a full page and about 25% said the shorter the better. Here are the preferences for cover letter length from the employers who responded to the survey: 1  Full page – 12.6%. 2  1/2 page – 43.7%."}, {"url": "http://www.ehow.com/info_8089884_can-cover-letters-long.html", "passage_text": "Chances are that if you think that your cover letter is too long, it probably is. A cover letter should be brief, highlighting only the prominent points that correspond to the job posting requirements."}, {"url": "http://www.resumemycareer.com/how-long-should-a-cover-letter-be/", "passage_text": "While writing a cover letter is fairly simple, it is also one of the most important things when it comes to submitting a resume. The cover letter serves as the first Hello from potential employee to employer. This means that even before they call you in for an interview, this is their first impression of you."}, {"url": "http://www.resumemycareer.com/how-long-should-a-cover-letter-be/", "passage_text": "A professional cover letter is not more than a page long. This space is quite limited hence the importance of one being specific. Write concisely focusing on the company’s present lack and the skills and experience that you have to fill the void."}]