[{"url": "https://recipes.sparkpeople.com/recipe-calories.asp?recipe=796019", "passage_text": "Here are the foods from our food nutrition database that were used for the nutrition calculations of this recipe. Calories per serving of Caramelized Onions. 22 calories of Onions, raw, (0.50 cup, sliced). 4 calories of Butter, unsalted, (0.04 tbsp). Looks like the math is wrong: 1/8th tsp does not equal .04 tsp, so the calorie count is wrong, as well. Also, I wouldn't try this in a non-stick pan-not good for the pan, and caramelization doesn't happen in non-stick as well as iron or steel."}, {"url": "http://www.calories-in-foods.com/calories-in-onions.php", "passage_text": "We will also provide onion rings calories for you as well. 1  A small boiled onion weighing 2.1 oz has 26 calories in. 2  A medium boiled onion weighing 3.3 oz has 41 calories in. 3  A large boiled onion weighing 4.5 oz has 56 calories. 4  A small raw onion weighing 2.5 oz has 29 calories in. Now let's look at the number of calories in onion rings, a popular product relating to the vegetable. 1  A 2.1 oz serving of 10 medium sized breaded onion rings, fried, has 244 calories in. 2  In 1 oz of breaded onion rings, fried, there are 115 calories. 3  In 1 oz of breaded onion rings, fried, there are 41 calories"}, {"url": "http://www.weightlossresources.co.uk/calories-in-food/veg/onions.htm", "passage_text": "Tweet. View calories and nutrition info per 1 Med Onion/180g of Onions and see how many calories are in 100g of Onions and its nutrition information. Plus, see how many calories you need each day and discover the easy way to count calories with our online food diary. It takes just 2 minutes to take a free trial and could be the breakthrough you've been waiting for!"}, {"url": "http://www.livestrong.com/article/302954-how-many-calories-are-in-an-onion/", "passage_text": "Nutrients. Onions serve as a good source of vitamin C. The National Nutrient Database reports that one medium onion provides 8.1 mg of this vitamin, the recommended daily intake of which ranges from 75 to 90 mg per day, according to Medline Plus. Onions are a commonly-found vegetable in your grocery store or farmer's market. This vegetable finds use raw, sauteed and grilled in many foods and offers a variety of nutritional benefits, including a small amount of calories."}, {"url": "http://www.livestrong.com/article/302954-how-many-calories-are-in-an-onion/", "passage_text": "One medium onion provides you with 44 calories that can be used to fuel your body, according to the United States Department of Agriculture National Nutrient Database. Few recipes call for an entire onion to be used in a serving size portion. Onions serve as a good source of vitamin C. The National Nutrient Database reports that one medium onion provides 8.1 mg of this vitamin, the recommended daily intake of which ranges from 75 to 90 mg per day, according to Medline Plus. Onions are a commonly-found vegetable in your grocery store or farmer's market. This vegetable finds use raw, sauteed and grilled in many foods and offers a variety of nutritional benefits, including a small amount of calories."}, {"url": "http://www.sparkpeople.com/calories-in.asp?food=onions+cooked", "passage_text": "1 Calories Burned For Treadmill: 15% Incline, 8.5 mph (7 minutes per mile). 2  Calories Burned For Treadmill: 15% Incline, 10 mph (6 minutes per mile). 3  Calories Burned For Ladies Workout Express Circuit Training. "}, {"url": "http://www.weightlossresources.co.uk/calories-in-food/veg/onions.htm", "passage_text": "Find the Calories in all the Foods You Eat. Quickly find the calories and nutrition info in all the foods and drinks you consume. Take a free trial with Weight Loss Resources and for 24 hours you get unlimited access to the UK's largest food and drink database. Plus, see how many calories you need each day and discover the easy way to count calories with our online food diary. It takes just 2 minutes to take a free trial and could be the breakthrough you've been waiting for!"}]