[{"url": "http://www.howmuchisit.org/nail-fungus-laser-cost/", "passage_text": "1 PintPointe(TM) FootLaser(TM): One of the only lasers on the market to have received FDA clearance. 2  They had received this clearance back in 2010. 3  The average treatment for this particular laser will last upwards of 30 minutes and can cost upwards of $750 to $1,500."}, {"url": "http://www.howmuchisit.org/nail-fungus-laser-cost/", "passage_text": "1 According to an article over on the Wall Street Journal, they claim that the laser nail fungus treatment cost can easily be within the range of $750 to as much as $1,500 per treatment. 2  As mentioned above, plan on paying out of pocket since most insurance companies won’t cover a procedure such as this one."}, {"url": "http://www.greatfootcare.com/our-services/fungal-toenail.aspx", "passage_text": "A: The laser procedure costs from about $800 on Long Island to upward of $1500 in Manhattan. Call now and be one of many to get rid of this disease with this great toenail fungus treatment, pain free!"}, {"url": "https://procedureclinic.com/cost/", "passage_text": "The cost of nail fungus laser procedure is $250 per treatment. We will do 3 laser procedures. Although we have found that while some people in Minnesota respond to just one to two treatments, nails grow so slowly (up to a year) that we couldn’t tell which patient will get better response within a few months."}, {"url": "http://www.howmuchisit.org/nail-fungus-laser-cost/", "passage_text": "1 The average cost for this laser treatment ranges in the $700 to $1,000 range, depending on the amount of toes. 2  PintPointe(TM) FootLaser(TM): One of the only lasers on the market to have received FDA clearance. 3  They had received this clearance back in 2010."}, {"url": "http://newyork-footdoctor.com/laser-toenail-fungus-treatment/", "passage_text": "“ $299 Exclusive Limited Time Offer – Up to 3 Treatments If Required “. $299 Toenail Fungus – Laser Treatment (Both Feet a $1,200 Value). The PinPointe FootLaser ™ is the first clinically proven laser device for the increase of clear nails in patients with onychomycosis, or nail fungus."}, {"url": "http://www.buzzle.com/articles/toenail-fungus-laser-treatment-cost.html", "passage_text": "About the Treatment. Laser treatment for toenail fungus can be performed at any laser clinic. The treatment includes targeting a laser beam on the fungal infection, so as to destroy it completely. A hand-held laser device is used for this purpose, so that the technician can adjust the beam in a better manner."}, {"url": "http://www.howmuchisit.org/nail-fungus-laser-cost/", "passage_text": "1 They had received this clearance back in 2010. 2  The average treatment for this particular laser will last upwards of 30 minutes and can cost upwards of $750 to $1,500. 3  Early studies have indicated that patients have had a success rate of more than 80 percent."}, {"url": "http://conejofeet.com/laser-treatment/", "passage_text": "If you decide laser treatment is right for you, the charge is $400 for up to five nails and $600 when all 10 are done. This fee includes TWO laser treatments six weeks apart. While the second Laser Treatment is included in this cost, not included, is a regular office visit fee of $45."}, {"url": "http://www.howmuchisit.org/nail-fungus-laser-cost/", "passage_text": "1 Being able to deliver more than 100 pulses a second, almost more than 70 percent that were treated have seen satisfying results. 2  The average cost for this laser treatment ranges in the $700 to $1,000 range, depending on the amount of toes."}]