[{"url": "https://www.governor.pa.gov/lt-gov-mike-stack/", "passage_text": "On January 20, 2015, Mike Stack was sworn in as Pennsylvania’s 33rd lieutenant governor, and in that role serves as presiding officer of the Pennsylvania Senate.He also chairs the Board of Pardons and was appointed by Governor Wolf to chair the Pennsylvania Emergency Management Council. "}, {"url": "https://en.wikipedia.org/wiki/Texas_Senate", "passage_text": "For this term of the Legislature the President of the Senate is Texas Lieutenant Governor David Dewhurst. The President Pro Tempore is Republican Craig Estes of District 30 (Wichita Falls). Presidents Pro Tempore are usually the most senior members of the Senate. The President Pro Tempore presides when the Lieutenant Governor is not present or when the legislature is not in regular session."}, {"url": "http://www.encyclopediaofalabama.org/article/h-2021", "passage_text": "The lieutenant governor's most important duties are as the successor to the governor and as the presiding officer of the state senate. Alabama is one of only five states in which the governor and lieutenant governor are elected separately and thus may be from different parties. In addition to the six lieutenant governors who served as governor, several have held other state elective offices. Bill Baxley, Thomas Knight Jr., and Siegelman each served as. attorney-general for one term, whereas Albert Carmichael served two terms in that office."}, {"url": "http://www.ltgov.state.al.us/AboutLtGov.aspx", "passage_text": "The Office of the Lieutenant Governor of Alabama, separate and distinct from the Alabama Legislature, was created by way of the Constitution of 1901. The Lieutenant Governor is first in the line of succession to the Governor and serves as President of the Alabama Senate. The Lieutenant Governor-along with the Governor, Attorney General, State Auditor, Secretary of State, State Treasurer, Commissioner of Agriculture and Industries and the Sheriff of each county-serves as a member of the Executive Department of state government."}, {"url": "http://www.atg.wa.gov/ago-opinions/lieutenant-governor-powers-and-duties-state-senate-presiding-officer-duties-power", "passage_text": "The lieutenant governor of the state of Washington has no legal authority to act as presiding officer of the state senate nor to cast the deciding vote in the state senate during the period in which he is serving as acting governor. The question of the possibility of the lieutenant governor serving in a dual capacity as acting governor and presiding officer of the senate has been indirectly ruled upon by the state supreme court in an early case, State ex rel. Murphy v. McBride, 29 Wash. 335"}, {"url": "http://www.house.mo.gov/content.aspx?info=/info/howbill.htm", "passage_text": "Senators from even-numbered districts are chosen in the off year elections. Each senator must be at least 30 years of age; a qualified voter of the state for three years; and of the district he represents for one year. The Lieutenant Governor is president and presiding officer of the Senate. In his absence, the President Pro Tem, who is elected by the Senate members, presides. The House of Representatives consists of 163 members, elected at each general election for two-year term"}, {"url": "http://www.atg.wa.gov/ago-opinions/lieutenant-governor-powers-and-duties-state-senate-presiding-officer-duties-power", "passage_text": "Art. III, § 16, provides for the powers and duties of lieutenant governor and specifies in substance that he shall be the presiding officer of the state senate and shall dischargesuch other duties as may be prescribed by law. The question of the possibility of the lieutenant governor serving in a dual capacity as acting governor and presiding officer of the senate has been indirectly ruled upon by the state supreme court in an early case, State ex rel. Murphy v. McBride, 29 Wash. 335"}, {"url": "http://www.atg.wa.gov/ago-opinions/lieutenant-governor-powers-and-duties-state-senate-presiding-officer-duties-power", "passage_text": "When the lieutenant governor becomes acting governor of the state he assumes all the powers and duties of the governor and cannot function for that period of time as lieutenant governor and presiding officer of the state senate. The question of the possibility of the lieutenant governor serving in a dual capacity as acting governor and presiding officer of the senate has been indirectly ruled upon by the state supreme court in an early case, State ex rel. Murphy v. McBride, 29 Wash. 335"}, {"url": "http://www.encyclopediaofalabama.org/article/h-2021", "passage_text": "It declared the lieutenant governor the presiding officer of the Senate, gave this individual a vote in the event of a tie vote in the Senate, and named the occupant of the office the first successor to the governor if that office was vacated. In addition to the six lieutenant governors who served as governor, several have held other state elective offices. Bill Baxley, Thomas Knight Jr., and Siegelman each served as. attorney-general for one term, whereas Albert Carmichael served two terms in that office."}]