[{"url": "http://undergroundcoal.com.au/fundamentals/01_types.aspx", "passage_text": "Different Types of Coal. It is important to be aware that coal can cover a variety of finished products of differing values and requiring different treatment. The main division is between coking coal and energy or steaming coal. "}, {"url": "http://teeic.indianaffairs.gov/er/coal/restech/tech/index.htm", "passage_text": "Coal is mined using giant machines to remove the coal from the ground. There are two basic methods to remove coal: surface mining and underground mining. Surface mining is used when the coal is typically less than 200 feet below the surface. It is also used to recover part of the coal left from underground mining. In the western United States, auger mining is used in conjunction with strip mining. Coal mining by the auger method entails boring horizontal or near-horizontal holes in an exposed face of the coal, and loading the coal removed by the auger."}, {"url": "http://feeco.com/types-coal-mining/", "passage_text": "When it comes to mining coal, there are two processes by which coal can be removed from the ground: surface mining, or underground mining. In Australia, the majority of coal mining is done via the opencast method, although often the method of choice is dependent on certain characteristics of the coal deposit 1. Whether it is underground mining, or surface mining, the use of quality conveyors in the coal industry is imperative to maintaining efficiency. FEECO has been involved with the coal industry for decades, providing superior quality conveyor systems, bucket elevators, belt trippers, and belt plows."}, {"url": "http://www.uky.edu/KGS/coal/coal_mining.htm", "passage_text": "Underground modes of access include drift, slope, and shaft mining, and actual mining methods include longwall and room and pillar mining. Drift mines enter horizontally into the side of a hill and mine the coal within the hill. Longwall mining is another type of underground mining. Mechanized shearers are used to cut and remove the coal at the face of the mine. After the coal is removed, it drops onto a chain conveyor, which moves it to a second conveyor that will ultimately take the coal to the surface."}, {"url": "https://en.wikipedia.org/wiki/Coal_mining", "passage_text": "The goal of coal mining is to obtain coal from the ground. Coal is valued for its energy content, and, since the 1880s, has been widely used to generate electricity. Steel and cement industries use coal as a fuel for extraction of iron from iron ore and for cement production. In the United States, United Kingdom, and South Africa, a coal mine and its structures are a colliery. In Australia, colliery generally refers to an underground coal mine. Coal mining has had many developments over the recent years, from the early days of men tunneling, digging and manually extracting the coal on carts to large open cut and long wall mines."}, {"url": "http://www.answers.com/Q/What_are_two_types_of_coal_mining", "passage_text": "Once the mining is finished, the dirt and rock are returned to the pit, the topsoil is replaced, and the area is replanted. Underground mining, sometimes called deep mining, is used when the coal is buried several hundred feet below the surface. Some underground mines are 1,000 feet deep. To remove coal in these underground mines, miners ride elevators down deep mine shafts where they run machines that dig out the coal. "}, {"url": "http://teeic.indianaffairs.gov/er/coal/restech/tech/index.htm", "passage_text": "In underground mining, after the initial development has gained access to the coalbed, one of three methods is commonly used to extract the coal: room-and-pillar, longwall, or shortwall. It is also used to recover part of the coal left from underground mining. In the western United States, auger mining is used in conjunction with strip mining. Coal mining by the auger method entails boring horizontal or near-horizontal holes in an exposed face of the coal, and loading the coal removed by the auger."}, {"url": "http://www.griffincoal.com.au/coal-education/coal-types/", "passage_text": "Vast specifications from locations all over the world. There are several different types of coal, that have different properties usually dependent on their age and the depth to which they have been buried under other rocks."}, {"url": "http://www.coalwoodwestvirginia.com/coal_mining.htm", "passage_text": "Coal Mining. Types of Coal Mines. There are four main types of coal mines: shaft mine, slope mine, drift mine, and surface (open-cast) mine. The mine at Coalwood was a shaft mine; the coal was brought up in an elevator from 600 to 800 feet underground."}]