[{"url": "http://www.inquisitr.com/2422751/jaden-smith-and-new-girlfriend-indulge-in-pda/", "passage_text": "Jaden Smith and Sarah Snyder Cuddling. Jaden Smith has been spotted getting cozy with new girlfriend Sarah Snyder at Gypsy Sport’s Spring Show on Tuesday, E! Online reports. Jaden Smith, 17, and Sarah Snyder, 19, were sitting front row at the fashion show, where they were seen indulging in some major PDA."}, {"url": "http://www.dailymail.co.uk/tvshowbiz/article-3237467/Jaden-Smith-takes-girlfriend-Sarah-Snyder-Kanye-West-s-NYFW.html", "passage_text": "She's been spotlighted as Jaden Smith's glamorous new girlfriend and now mingles with Hollywood's A-list. But Sarah Snyder, the woman seen smooching Will Smith's son during New York Fashion Week, is raising eyebrows for other reasons."}, {"url": "http://www.popsugar.com/celebrity/Jaden-Smith-Dating-Sarah-Snyder-38420626", "passage_text": "Thanks for your reaction Don’t forget to share this with your friends! 0 0 0 0 0 0. 1. Jaden Smith and His New Girlfriend Put Their Love on Display at NYFW. Jaden Smith is officially taken! On Tuesday, the 17-year-old attended the Gypsy Sport runway show at New York Fashion Week with his new girlfriend, Sarah Snyder. Jaden and the 19-year-old model kept close, cozying up to each other and even sneaking in a kiss."}, {"url": "http://www.eonline.com/news/696182/jaden-smith-and-new-girlfriend-sarah-snyder-cozy-up-during-new-york-fashion-week", "passage_text": "Click/tap elsewhere to exit, or press ESC. Mireya Acierto/Getty Images. Jaden Smith is ready to show the world that he has an adorable, new girlfriend. The 17-year-old actor was spotted at the Gypsy Sport fashion show on Tuesday during New York Fashion Week, putting his feelings on display for his new boo Sarah Snyder."}, {"url": "http://www.usmagazine.com/celebrity-news/news/jaden-smith-makes-out-with-girlfriend-sarah-snyder-pda-pics-2015159", "passage_text": "Jaden Smith makes out with girlfriend Sarah Snyder -- see the steamy pics Credit: Mireya Acierto/Getty Images. #YoungLove. Jaden Smith attended the Gypsy Sport show at New York Fashion Week with his girlfriend, Sarah Snyder, on Tuesday, Sept. 15, and got real close with the 19-year-old blonde."}]