[{"url": "http://www.webmd.com/baby/guide/vaginal-birth-after-cesarean-vbac-overview", "passage_text": "Having a vaginal birth after having a C-section can be a safe choice for most women. Whether it is right for you depends on several things, including why you had a C-section before and how many C-sections you've had. You and your doctor can talk about your risk for having problems during a trial of labor."}, {"url": "http://americanpregnancy.org/labor-and-birth/vbac/", "passage_text": "VBAC: Vaginal Birth after Cesarean. If you have experienced a cesarean delivery, you are not alone. In November 2005, the Centers for Disease Control and Prevention reported the national cesarean birth rate was the highest ever at 29.1%–more than a quarter of all deliveries."}, {"url": "http://www.babycenter.com/0_vaginal-birth-after-cesarean-vbac_1420895.bc", "passage_text": "As long as you're an appropriate candidate for a vaginal birth after a cesarean, also known as a VBAC, there's a good chance you'll succeed. Of course, your chances of success are higher if the reason for your previous c-section isn't likely to be an issue this time around."}, {"url": "http://www.webmd.com/baby/tc/vaginal-birth-after-cesarean-vbac-recovery", "passage_text": "After a vaginal delivery, the mother and baby can usually go home within 24 to 48 hours. By comparison, recovery from a cesarean section requires 2 to 4 days in the hospital and a period of limited activity as the incision heals."}, {"url": "http://www.mayoclinic.org/tests-procedures/vbac/basics/definition/PRC-20020457", "passage_text": "For many women, VBAC is an option. In fact, research on women who attempt a trial of labor after cesarean (TOLAC) shows that about 60 to 80 percent have a successful vaginal delivery. VBAC isn't right for everyone, though. Certain factors, such as a high-risk uterine scar, can make VBAC inappropriate."}, {"url": "http://www.babycenter.com/0_vaginal-birth-after-cesarean-vbac_1420895.bc", "passage_text": "For example, a woman who has already had an easy vaginal delivery and then had a c-section when her next baby was breech is much more likely to have a successful VBAC than one who had a c-section after being fully dilated and pushing for three hours with her first baby who was small and properly positioned."}, {"url": "http://www.webmd.com/baby/guide/vaginal-birth-after-cesarean-vbac-overview", "passage_text": "Most women, whether they deliver vaginally or by C-section, don't have serious problems from childbirth. If you and your doctor agree to try a VBAC, you will have what is called a trial of labor after cesarean, or TOLAC. This means that you plan to go into labor with the goal to deliver vaginally. But as in any labor, it is hard to know if a VBAC will work. You still may need a C-section."}]