[{"url": "http://www.livescience.com/25039-mantle-plumes-more-gold.html", "passage_text": "Gold, as well as other rare metals, can be brought to the surface by plumes of molten rock from deep within the mantle, the layer underneath Earth's crust, producing background levels of gold up to 13 times higher than elsewhere, according to research published Oct. 19 in the journal Geology."}, {"url": "http://nevada-outback-gems.com/basic_prospecting/gold_geology.htm", "passage_text": "The majority of the world's productive gold deposits, especially those found in volcanic and sedimentary rocks, formed from circulating ground waters driven by heat provided by bodies of magma (molten rock) intruded into the Earth's crust within about 2 miles of the earth's surface."}, {"url": "http://thegoldlab.com/2013/12/gold-facts-much-gold-earths-core/", "passage_text": "1 There is enough gold at the core of the earth to cover the surface of the planet in 12’ to 13’ depth. 2  Unfortunately, it’s 1,800 miles below our feet and at many thousands of degrees."}, {"url": "http://www.gold-traders.co.uk/gold-information/where-is-gold-found-on-earth.asp", "passage_text": "Despite the fact that gold can be found almost everywhere, there is very little gold in comparison to other elements on earth. In fact, if all the gold ever discovered were collected and melted down and formed into one cube, it would measure just 20 meters on each side."}, {"url": "http://www.mining.com/web/worlds-top-10-gold-deposits/", "passage_text": "It is located in the Ashanti region of southwest Ghana in western Africa; a prolific gold producing region for centuries. The underground operation extends to a depth of 1,500 meters or 4,900 feet (almost a mile)."}, {"url": "http://www.goldrushnuggets.com/howdogofo.html", "passage_text": "In fact, most of the gold on Earth is actually located in its core where its heavy properties caused it to sink over time. The gold that is found near the surface comes from relatively recent strikes of meteors that contained a considerable amount of gold."}, {"url": "http://www.gold-traders.co.uk/gold-information/where-is-gold-found-on-earth.asp", "passage_text": "With deposits of gold being found in the United States, Canada and Mexico, the North American continent is developing as a gold producing continent."}, {"url": "http://www.bbc.com/news/magazine-22904141", "passage_text": "Their proposition is that all the gold in the Earth's crust-or the overwhelming majority of it-was here on Earth all along. Most of it certainly alloyed with iron and migrated to the Earth's core, but a significant proportion-perhaps 0.2% - dissolved into a 700km deep magma ocean within the Earth's outer mantle."}, {"url": "http://www.mining.com/web/worlds-top-10-gold-deposits/", "passage_text": "It will also be one of the largest gold and copper producers on earth as it ramps up to full production. #5 | OLYMPIADA | 47,500,000 Oz Gold Location: Central Siberia, RUSSIA In the #5 spot is Olympiada, owned solely by Russian major Polyus."}, {"url": "http://www.gold-traders.co.uk/gold-information/where-is-gold-found-on-earth.asp", "passage_text": "Gold can be found on nearly every continent of the earth. It also exists in trace amounts in sea water and in the human body."}]