[{"url": "https://simple.wikipedia.org/wiki/Bear_(gay_slang)", "passage_text": "Bear is a gay slang term. It describes a hairy, heavy-set (sometimes muscular) gay or bisexual man. A bear typically projects an image of rugged masculinity. Some bears present a very masculine, over-the-top image of a ruggedly masculine man."}, {"url": "http://www.urbandictionary.com/define.php?term=bear", "passage_text": "The most common definition of a bear is a man who is hairy, has facial hair, and a cuddly body. However, the word Bear means many things to different people, even within the bear movement. Many men who do not have one or all of these characteristics define themselves as bears, making the term a very loose one."}, {"url": "http://www.thefreedictionary.com/bear", "passage_text": "bear a relation /relationship to. To have an association with or relevance to: That remark bears no relation to the matter at hand. bear a resemblance /liking /similarity to. To be similar to; appear or function like."}, {"url": "http://www.merriam-webster.com/dictionary/bear", "passage_text": "Full Definition of BEAR. 1. or plural bear: any of a family (Ursidae of the order Carnivora) of large heavy mammals of America and Eurasia that have long shaggy hair, rudimentary tails, and plantigrade feet and feed largely on fruit, plant matter, and insects as well as on flesh. 2."}, {"url": "http://www.investopedia.com/terms/b/bear.asp", "passage_text": "DEFINITION of 'Bear'. An investor who believes that a particular security or market is headed downward. Bears attempt to profit from a decline in prices. Bears are generally pessimistic about the state of a given market."}, {"url": "https://en.wikipedia.org/wiki/Bear", "passage_text": "The English word bear comes from Old English bera and belongs to a family of names for the bear in Germanic languages that originate from an adjective meaning  brown . In Scandinavia, the word for bear is bjoern (björn or), bjoern bjørn and is a relatively common given name. for males"}]