[{"url": "http://www.wine-searcher.com/regions-alsace+grand+cru", "passage_text": "Alsace Grand Cru Wine. Alsace Grand Cru is the appellation for the finest still white wines from the Alsace region of north-eastern France. Created in 1983, the appellation was based on a classification of the region's vineyards carried out in 1975 and has been the subject of several subsequent revisions."}, {"url": "https://en.wikipedia.org/wiki/Cru_(wine)", "passage_text": "A Grand Cru Champagne. Cru is a vineyard or group of vineyards, especially one of recognized quality. It is a French wine term which is traditionally translated as growth, as it was originally the past participle of the verb croitre (to grow)."}, {"url": "http://www.merriam-webster.com/dictionary/grand%20cru", "passage_text": "Definition of GRAND CRU. : a wine of the highest rank or reputation within its appellation. ADVERTISEMENT."}, {"url": "http://www.mymaninchampagne.com/jiles-hallings-blog/grand-cru-and-premier-cru-what-do-they-mean", "passage_text": "View Comments. If you see the words Grand Cru or Premier Cru on the label of a bottle of champagne it’s very likely that you will assume that what’s inside the bottle is of a superior quality to a champagne that does not display either of these terms."}, {"url": "http://grandcrucoffee.com.au/", "passage_text": "At Grand Cru Coffee, we have chosen to use Sanremo Verona TCS coffee machines and Mazzer grinders as our standard equipment. Sanremo Italy is our key espresso machine supplier. Sanremo is a young, dynamic company, setting high standards in the production of espresso coffee machines for professional use."}, {"url": "http://www.mymaninchampagne.com/jiles-hallings-blog/grand-cru-and-premier-cru-what-do-they-mean", "passage_text": "For the words Grand Cru to appear on a label all the grapes used to make the champagne in question must come from Grand Cru villages. Similarly a Premier Cru champagne must not contain any grapes from villages rated below 90%."}, {"url": "http://www.merriam-webster.com/dictionary/grand%20cru", "passage_text": "Origin of GRAND CRU. French, literally, great production (of something grown) — more at cru. This word doesn't usually appear in our free dictionary, but the definition from our premium Unabridged Dictionary is offered here on a limited basis. Note that some information is displayed differently in the Unabridged."}, {"url": "http://www.moorechampagne.com/grand-cru-grower-champagne/", "passage_text": "Grand Cru Grower Champagne is simply unique Champagne produced from the best vineyards by the very people who own the vineyard and who grew the grapes."}]