[{"url": "http://www.e-chords.com/chords/david-allan-coe/you-dont-even-call-me-by-my-name", "passage_text": "Request the video You Don't Even Call Me By My Name - Send You Don't Even Call Me By My Name. Ringtone to your Cell. there isn't a video lesson for this song. Full key step up. Half key step up. Half key step down. Full key step down. "}, {"url": "http://www.yourchords.com/194097/David-Allen-Coe/You-Never-Even-Called-Me-By-My-Name-Chords/", "passage_text": "People who played David Allen Coe-You Never Even Called Me By My Name Chords also played these songs by David Allen Coe: The Ride Tab, You Never Even Called Me By My Name Chords, The Ride Chords, The Ride Chords, Whips And Things Chords, Dont Bite The Dick Chords. Here you can post a video or audio performance. Tell me more ... Here you can post a video of you playing the You Never Even Called Me By My Name Chords, so your fellow guitarists will be able to see you and rate you."}, {"url": "http://www.cowboylyrics.com/tabs/coe-david-allan/call-me-by-my-name-7016.html", "passage_text": "1 Coe David Allan-Don't Cry Darlin' v2 Chords. 2  Coe David Allan-Drank My Wife Away Chords. 3  Coe David Allan-Drink Canada Dry Chords. 4  Coe David Allan-Drinking Her Off My Mind Chords. 5  Coe David Allan-Even After Forever Chords. 6  Coe David Allan-F.i.b. 1 Coe David Allan-The Last Time She ll Leave Me This Time Chords. 2  Coe David Allan-The Old Grey Goose Is Dead Chords. 3  Coe David Allan-The Only Thing Missing Is You Chords."}, {"url": "http://www.azchords.com/g/goodmansteve-tabs-5146/youneverevencallme-tabs-106470.html", "passage_text": "↑ Back to top | Goodman Steve Chords for You Never Even Call Me. Lyrics for acoustic guitar and electric guitar. Tablatures and chords are parodies/interpretations of the original songs. You may use it for private study, scholarship, research or language learning purposes only. "}, {"url": "http://www.yourchords.com/194097/David-Allen-Coe/You-Never-Even-Called-Me-By-My-Name-Chords/", "passage_text": "Show us your talent, perform You Never Even Called Me By My Name Chords! Here you can post a video or audio performance. Tell me more ... Here you can post a video of you playing the You Never Even Called Me By My Name Chords, so your fellow guitarists will be able to see you and rate you."}, {"url": "http://www.e-chords.com/chords/david-allan-coe/you-never-even-called-me-by-my-name", "passage_text": "Request the video You Never Even Called Me by My Name - Send You Never Even Called Me by My Name. "}, {"url": "http://www.cowboylyrics.com/tabs/coe-david-allan/call-me-by-my-name-7016.html", "passage_text": "1 Coe David Allan-Texas Lullaby Chords. 2  Coe David Allan-The 33rd Of August Chords. 3  Coe David Allan-The Fish Aren't Biting Today Chords. 4  Coe David Allan-The Ghost Of Hank Williams Chords. 1 Coe David Allan-The Last Time She ll Leave Me This Time Chords. 2  Coe David Allan-The Old Grey Goose Is Dead Chords. 3  Coe David Allan-The Only Thing Missing Is You Chords."}, {"url": "http://www.lyricsmode.com/lyrics/j/john_prine/you_never_even_call_me_by_my_name.html#!", "passage_text": "You don't have to call me darlin', darlin'. But you never even call me by my name. [spoken] This is a song I wrote with John Prine 4 years ago (1972) and we tried to put into one song, everything that had ever been in any of the country and western songs we had ever heard. Tried to put it all into one song. But you never even call me by name. [musical by mouth improv done in a Merle Haggard-like tone-no words]. [spoken] I've seen my name, a few times in the phone book. [spoken] And on the neon sign above the bar I used to own. [spoken] And there's only one thing I'm really sure of was that sucker."}]