[{"url": "http://england.shelter.org.uk/get_advice/repossession/ways_to_prevent_repossession/steps_before_court_action", "passage_text": "Your lender must also give you details of: 1  your payments over the past two years. 2  your monthly instalments. 3  the amount of your arrears. 4  how much is left to pay on your mortgage. 5  the interest or charges that will be added."}, {"url": "http://www.citizensinformation.ie/en/housing/losing_your_home/home_repossession.html", "passage_text": "You can consent to have your home repossessed. You may agree terms with your lender for the sale of the house, if you are unable to pay your mortgage. The lending institution must get a court order to repossess or sell your house unless you consent in writing 7 days before the repossession or sale."}, {"url": "http://www.repossession-stoppers.com/answers/how-long-does-a-house-repossession-take/", "passage_text": "Our Answer…. To answer your question simply, a repossession order will typically be a 60 day repossession order. If however you do not contest the repossession or don’t turn up to the hearing it is more likely to be a 3"}, {"url": "http://england.shelter.org.uk/get_advice/repossession/ways_to_prevent_repossession/steps_before_court_action", "passage_text": "Before a mortgage lender takes you to court to repossess your home, it must follow the rules outlined in the pre-action protocol."}, {"url": "https://www.cml.org.uk/consumers/payment-difficulties/what-to-do-if-repossession-occur/", "passage_text": "If there is a shortfall, your lender will contact you as soon as possible after the sale of the property telling you that there is a shortfall debt. They will also let you know that the shortfall debt may be pursued by another company."}, {"url": "http://england.shelter.org.uk/get_advice/repossession/ways_to_prevent_repossession/steps_before_court_action", "passage_text": "Rules your lender must follow. If you have mortgage arrears your lender can take you to court to repossess your home. But there are rules that mean your lender can only do this as a last resort and after other options have been exhausted."}, {"url": "https://www.citizensadvice.org.uk/debt-and-money/mortgage-problems/what-happens-when-your-mortgage-lender-takes-you-to-court/", "passage_text": "If you are in arrears with a second mortgage or secured loan, the lender may start court action to try and get possession of your property. They will want to sell your property in order to pay off the loan."}]