[{"url": "http://www.idrivewithuber.com/how-much-do-uber-drivers-make/", "passage_text": "Uber driver pay varies depending on where you live and how many hours you drive. I make between $20 and $25 an hour in Los Angeles. Studies across the nation show that Uber drivers make over $19 an hour on average. In New York City, the average Uber driver makes over $30 an hour. As I already explained, how much money an Uber driver makes depends on numerous factors. As a practical example, let’s assume you make $20 an hour after taxes and expenses, and you work 40 hours a week, like a regular full-time job: $19 x 40 hours/week= $760 a week."}, {"url": "http://www.businessinsider.com/how-much-you-can-earn-as-a-lyft-driver-2014-12", "passage_text": "Much has been written contrasting Uber's promise that drivers can make $90,000 a year with how much the ride-sharing company's drivers are really making. Not much has been written, however, about how much drivers earn working for Lyft, an on-demand car service similar to Uber. Lyft says its drivers can make $35 an hour. Vox editor Timothy Lee decided to conduct an experiment to see how much he could make. After a week, Lee had driven 54 passengers and made $596. His earnings came to about $10.50 an hour. BuzzFeed says the average Uber driver earns $34,164 annually, or roughly $21.95 an hour"}, {"url": "http://www.vox.com/2014/12/28/7451183/5-surprising-things-i-learned-during-my-week-as-a-lyft-driver", "passage_text": "Lyft offers a power driver bonus that pays drivers up to 25 percent extra if you drive at least 50 hours/week. But to qualify for this bonus (or the $30/hour guarantee in effect at the time I drove), drivers must accept at least 90 percent of the hails they receive. I got lucky. I drove at a time when Lyft was guaranteeing new drivers that they'd make at least $30 per hour if they drove 50 hours in one week. But if that guarantee wasn't in effect, I would have made less than $12 an hour."}, {"url": "http://www.businessinsider.com/how-to-make-50000-a-year-by-driving-for-uber-lyft-and-sidecar-2014-12", "passage_text": "SherpaShare’s per trip fare data for Uber shows that the average driver would have to drive 20.47 hours each week to make $50,000 a year. However, from anecdotal evidence and investigative reports, it is likely that the average driver utilization for ridesharing is much less than 50%. After looking at the numbers, NerdWallet had a few big takeaways: 1  Based on their data, drivers can, on average, make more working for Uber than for Lyft and Sidecar in most places. 2  Uber drivers make an average of $15.97 per ride with Uber, as opposed to Lyft ($11.48) and Sidecar ($13.35)."}, {"url": "http://www.businessinsider.com/how-much-you-can-earn-as-a-lyft-driver-2014-12", "passage_text": "In the case of Lyft, however, Lee says he made significantly more money because Lyft was running a promotion when he signed up — if drivers worked at least 50 hours and picked up 50 customers, they would make at least $1,500 per week, or $30 an hour. Not much has been written, however, about how much drivers earn working for Lyft, an on-demand car service similar to Uber. Lyft says its drivers can make $35 an hour. Vox editor Timothy Lee decided to conduct an experiment to see how much he could make. After a week, Lee had driven 54 passengers and made $596."}, {"url": "http://www.vox.com/2014/12/17/7402311/lyft-driver-pay", "passage_text": "When I signed up, Lyft was running a promotion guaranteeing new drivers that they'd make at least $1,500 per week if they worked 50 hours and served 50 passengers. That works out to an average compensation of $30 per passenger, which was a little crazy since I didn't have a single passenger who paid more than $25. I wound up working 50 hours, earning almost $600 in fares. And I actually made a lot more than that. Lyft paid me $1,500 (which I'll be donating to DC Central Kitchen) under a program that guaranteed drivers would make $30 per hour if they worked 50 hours."}, {"url": "http://www.idrivewithuber.com/how-much-do-uber-drivers-make/", "passage_text": "I usually drive between 30 and 50 hours, and I make between $900 and $1200 a week. After gas and taxes that is $750 – $1000 a week. Out of the 30-50 hours, I do not spend the entire time driving. Sometimes new ride requests do not come in immediately after one ride is completed. As I already explained, how much money an Uber driver makes depends on numerous factors. As a practical example, let’s assume you make $20 an hour after taxes and expenses, and you work 40 hours a week, like a regular full-time job: $19 x 40 hours/week= $760 a week."}, {"url": "http://www.businessinsider.com/how-to-make-50000-a-year-by-driving-for-uber-lyft-and-sidecar-2014-12", "passage_text": "1 Uber drivers make an average of $15.97 per ride with Uber, as opposed to Lyft ($11.48) and Sidecar ($13.35). 2  In order to make $50,000 a year, an Uber driver must provide 60.21 rides every week. 3  A Lyft driver would have to provide 83.76 rides, and a Sidecar driver would have to provide 72.03 rides. After looking at the numbers, NerdWallet had a few big takeaways: 1  Based on their data, drivers can, on average, make more working for Uber than for Lyft and Sidecar in most places. 2  Uber drivers make an average of $15.97 per ride with Uber, as opposed to Lyft ($11.48) and Sidecar ($13.35)."}, {"url": "http://www.businessinsider.com/how-to-make-50000-a-year-by-driving-for-uber-lyft-and-sidecar-2014-12", "passage_text": "1 In order to make $50,000 a year, an Uber driver must provide 60.21 rides every week. 2  A Lyft driver would have to provide 83.76 rides, and a Sidecar driver would have to provide 72.03 rides. 3  To put that in perspective, 60.21 rides each week equates to between 20 and 21 hours of driving per week for an Uber driver. After looking at the numbers, NerdWallet had a few big takeaways: 1  Based on their data, drivers can, on average, make more working for Uber than for Lyft and Sidecar in most places. 2  Uber drivers make an average of $15.97 per ride with Uber, as opposed to Lyft ($11.48) and Sidecar ($13.35)."}]