[{"url": "http://www.desertmuseum.org/kids/oz/long-fact-sheets/elf%20owl.php", "passage_text": "Identifying Features. Elf Owls do not have ear tufts or feathers on the top of their rounded heads. Their feathers are grayish brown in color. Their eyes are pale yellow and are highlighted by thin white eyebrows. The bill is gray with a horn-colored tip. Elf owls are the smallest owl in the Sonoran Desert. Wild Status. The most important threat to the elf owl is habitat loss both of its riparian forest habitat and desert-scrub habitats. In Arizona, the elf owl is not uncommon, but it's numbers are decreasing in California and Texas."}, {"url": "http://birding.about.com/od/Bird-Lists/fl/Owl-Species-List.htm", "passage_text": "Nick Jewell. Owls are some of the most popular raptors, not only for their nocturnal habits and amazingly expressive faces, but also for their outstanding abilities and the many legends and superstitions that surround them. "}, {"url": "http://www.weegy.com/?ConversationId=F2AB0A94", "passage_text": "How does Tennyson use juxtaposition in Break, Break, Break to make contrast more apparent? (A)He places images that signify good next to images that signify evil. (B)He places images that signify grief next to images that signify happiness and innocence. (C)both of these (D)of these. Weegy: Tennyson does not use juxtaposition in Break, Break, Break."}, {"url": "http://www.u-s-history.com/pages/h1438.html", "passage_text": "The outcome of the proceedings was never in doubt. The judge made clear to the jury that the law s constitutionality or efforts to support the validity of Darwin s theory were not germane; the only issue in question was whether or not Scopes had presented evolution as fact and he had admitted as much. The teacher was found guilty and fined $100 for his transgression. The Scopes Trial. In March 1925, the Tennessee legislature passed a measure known as the Butler Act that made it illegal for teachers in the public schools to present as factual any theory of creation other than the biblical account."}, {"url": "http://www.123helpme.com/view.asp?id=41619", "passage_text": "By traveling with these stories, the scops helped to preserve the history of the Germanic people for generations later. The Anglo Saxon people believed that poetry was the closest thing to immortality. Thanks to the work of these oral historians, we can still read about their culture, achievements, and beliefs. Some songs might deal with figures from the past like the ancestors of the Anglo Saxons. Other subjects reflected in the poetry include the sea, brave deeds, glory of warriors, and the love of home. Scops were also commissioned to write elegies or songs for the dead."}, {"url": "http://www.123helpme.com/view.asp?id=41619", "passage_text": "The scop was also referred to as a gleeman, from the Old English word “gleoman”, who was a musician or performer. Though the scop was a performer, like the gleeman, the work of the scop was more artistic, as the name denotes. Unlike the gleeman, scops also wrote and performed their own poetry. Some songs might deal with figures from the past like the ancestors of the Anglo Saxons. Other subjects reflected in the poetry include the sea, brave deeds, glory of warriors, and the love of home. Scops were also commissioned to write elegies or songs for the dead."}, {"url": "http://csis.pace.edu/grendel/projf20004d/History.html", "passage_text": "The History Behind Beowulf. Out of the 30,000 lines of literature left from the Anglo-Saxon period, almost 4,000 lines are preserved in the text of Beowulf, the epic poem of the hero with the strength of 30 men in each arm. It is a story of the supernatural as well as a record of Anglo-Saxon history. "}, {"url": "http://www.weegy.com/?ConversationId=742B0CBA", "passage_text": "Weegy: The speaker doesn't think because merchants need to seek for precious things in far away places because For loe my love doth in herself contain all this world's riches that may far be found, of Saphires, loe her eyes be saphires plain,. [ - See more at: ] (More). Question. "}, {"url": "http://www.123helpme.com/view.asp?id=41619", "passage_text": "If the scop sang of heroes, he also sang of the hardship, wounds, and death that often accompanied them. The entertainment they provided was not meant to be relaxing; it was meant to produce thought and stern feelings. The scops were very important to Anglo-Saxon society. Some songs might deal with figures from the past like the ancestors of the Anglo Saxons. Other subjects reflected in the poetry include the sea, brave deeds, glory of warriors, and the love of home. Scops were also commissioned to write elegies or songs for the dead."}]