[{"url": "http://web.stanford.edu/~asalehi/ahmadxx.htm", "passage_text": "It has been shown that survival and differentiation of BFCNs during development and their maintenance in the mature brain depends on supply of neurotrophins particularly nerve growth factor (NGF) (see Salehi et al., 1998, 2004; Sofroniew et al., 2001). The nucleus basalis of Meynert for instance, undergoes severe atrophy and decrease metabolic activity (Salehi et al., 1994; Swaab et al., 1994) in AD. For these reasons, studying the pathogenesis of BFCN degeneration is a key step into understanding the cellular and molecular events responsible for dementia."}, {"url": "http://www.sciencedirect.com/science/article/pii/S0165027012003937", "passage_text": "While the AAV–NSE vector used in this study resulted in CB expression in a substantial population of the BFCNs (up to 91%), we also observed CB expression beyond what is seen in intact brains in non-cholinergic neurons. In the studies reported here, a multi-use AAV vector system was employed for delivering the CB gene to the rat BFCNs. In one system, a cDNA encoding CB was inserted into pACP, a generic AAV vector in which expression is under the control of CMV immediate early gene promoter."}, {"url": "http://web.stanford.edu/~asalehi/ahmadxx.htm", "passage_text": "My research is focused on understanding the basis of selective degeneration of basal forebrain cholinergic neurons (BFCNs) in Alzheimer s disease (AD). The nucleus basalis of Meynert for instance, undergoes severe atrophy and decrease metabolic activity (Salehi et al., 1994; Swaab et al., 1994) in AD. For these reasons, studying the pathogenesis of BFCN degeneration is a key step into understanding the cellular and molecular events responsible for dementia."}, {"url": "http://bfcins.com/", "passage_text": "Serving the Insurance Community for Over 40 Years. We Represent the Finest A-Rated National. and Regional Mutual Companies. Writing all Classes of Commercial & Personal Lines. Prompt Quotes, Courteous Professional Service. Excellent Commissions. BROKERS FACILITIES CORP. "}, {"url": "http://web.stanford.edu/~asalehi/ahmadxx.htm", "passage_text": "Since AD is characterized by severe degeneration of BFCNs, it has been suggested that selective degeneration of these cells is due to failed NGF signaling. However, a number of studies showed that failed NGF signaling in AD is not due to reduced availability of NGF in the BFCN projection areas (see Salehi et al., 2003). The nucleus basalis of Meynert for instance, undergoes severe atrophy and decrease metabolic activity (Salehi et al., 1994; Swaab et al., 1994) in AD. For these reasons, studying the pathogenesis of BFCN degeneration is a key step into understanding the cellular and molecular events responsible for dementia."}, {"url": "http://web.stanford.edu/~asalehi/ahmadxx.htm", "passage_text": "The shrinkage and loss of markers in BFCNs contributes significantly to the progressive memory loss in AD and several other neurodegenerative disorders. The nucleus basalis of Meynert for instance, undergoes severe atrophy and decrease metabolic activity (Salehi et al., 1994; Swaab et al., 1994) in AD. For these reasons, studying the pathogenesis of BFCN degeneration is a key step into understanding the cellular and molecular events responsible for dementia."}, {"url": "http://www.sciencedirect.com/science/article/pii/S0165027012003937", "passage_text": "The cholinergic neurons of the basal forebrain (BFCNs) in human and non-human primates are rich in the calcium binding protein calbindin-D 28k (CB). In the studies reported here, a multi-use AAV vector system was employed for delivering the CB gene to the rat BFCNs. In one system, a cDNA encoding CB was inserted into pACP, a generic AAV vector in which expression is under the control of CMV immediate early gene promoter."}, {"url": "http://www.sciencedirect.com/science/article/pii/S0165027012003937", "passage_text": "Of interest in the context of AD, we have demonstrated that the BFCNs display a regionally and biochemically selective and substantial loss of CB in the course of normal aging in both the human and in non-human primates (Wu et al., 1997, Wu et al., 2003, Geula et al., 2003a and Geula et al., 2003b). In the studies reported here, a multi-use AAV vector system was employed for delivering the CB gene to the rat BFCNs. In one system, a cDNA encoding CB was inserted into pACP, a generic AAV vector in which expression is under the control of CMV immediate early gene promoter."}, {"url": "http://dsresearch.stanford.edu/community/archive_issue_07.html", "passage_text": "Basal forebrain cholinergic neurons (BFCNs) are a group of brain cells that are important for attention, learning and memory functions. BFCNs receive input from a protein produced in the hippocampus, called nerve growth factor (NGF). NGF plays a vital role in the well-being of BFCNs. We are happy to announce that the long awaited Down Syndrome Clinic at Stanford will open its doors on July 11th. The clinic is located in the Lucile Packard Children’s hospital. To make an appointment, please call the clinical coordinator at (650) 723-6858, extension 1."}, {"url": "http://dsresearch.stanford.edu/community/archive_issue_07.html", "passage_text": "Issue No. 7, Summer 2006. We are happy to announce that the long awaited Down Syndrome Clinic at Stanford will open its doors on July 11th. The clinic is located in the Lucile Packard Children’s hospital. To make an appointment, please call the clinical coordinator at (650) 723-6858, extension 1. For more information visit our clinic web page"}]